{
  "id": 4192,
  "mediaId": 2745,
  "date": "2022-03-02",
  "headline": "Opinion: Ukrainian Americans overpower the isolationist impulses of Trump-era GOP",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TNINXIEZZEI6ZGMHTXHO4YVD6Y.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/03/02/what-ukrainian-american-voters-are-doing-to-gop-politics/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Bush was damaged at home in the 1992 election by his infamous “Chicken Kiev” speech, in which he urged Ukraine to stay in Russia’s fold while warning against “suicidal nationalism.”\nPresident Donald Trump’s outspoken regard for Vladimir Putin and his shakedown of President Volodymyr Zelensky, which led to his first impeachment, took Republicans down some very bad roads with Ukrainian American voters.",
    "In fact, instead of arguing for staying out of the conflict altogether, as an alarming number of “America First” acolytes with megaphones were doing just days ago, Republican politicians increasingly criticize President Biden for not doing more to assist Ukraine.",
    "Ukrainians immigrated to the United States in four waves: for jobs during the Industrial Revolution, to flee Soviet persecution after a failed 1918 bid for independence, as refugees in the wake of World War II and following the fall of the Iron Curtain in 1991.",
    "She appeared at news conferences alongside House Minority Leader Kevin McCarthy (R-Calif.) on Tuesday and Sen. Lindsey O. Graham (R-S.C.) on Wednesday, where she read aloud from messages that have kept her cellphone buzzing day and night.",
    "Spartz, who moved to the United States at age 21 after falling in love with a Hoosier she met on a train while living in Kyiv, is among an estimated 1.1 million Ukrainian Americans, a bright blue-and-yellow patch in our national quilt.",
    "Vance, garnered national attention recently for saying: “I don’t really care what happens to Ukraine one way or another.” Since then, he seems to have learned that there are about 80,000 Ukrainian American voters in Ohio.",
    "In his news conference with Spartz, Graham proposed a congressional resolution that would make it the official position of the U.S. government that Russian leaders should be prosecuted by the International Criminal Court.",
    "Portman released a letter on Tuesday, signed by most Democratic senators, calling for Biden to grant temporary protected status to Ukrainians in the United States so they don’t have to go home.",
    "Now he’s calling Putin “an evil man” and saying the invasion is “unquestionably a tragedy.”\nCommunities such as Parma are preparing for an influx of Ukrainian refugees in the coming months.",
    "Both of them spoke during a rally on Sunday at St. Vladimir Ukrainian Orthodox Cathedral in Parma, a suburb of Cleveland and one of the biggest Ukrainian communities in the country.",
    "This diaspora happens to be disproportionately concentrated in urban areas of politically significant Midwestern states, from Cleveland to Chicago, Detroit and Philadelphia.",
    "Andriy Futey, the Ohio-based president of the Ukrainian Congress Committee of America, said Ukrainian Americans are rarely single-issue voters, but 2022 might be different.",
    "And they’re providing a vital counterweight to the isolationist, nativist and populist impulses of the Trump-era Republican Party — and to our politics in general.",
    "President Gerald Ford’s bid for a full term in 1976 was hurt when he insisted during a presidential debate that there was no Soviet domination of Eastern Europe.",
    "), the first Ukrainian-born immigrant to serve in Congress, has emerged as an unlikely voice inside the GOP amid Russia’s invasion of her native land.",
    "By returning to its hawkish roots on national security, the GOP is helping Washington project resolve to Moscow — and our allies.",
    "Rep. Marcy Kaptur (D-Ohio) is Polish but has been one of Ukraine’s biggest champions on Capitol Hill for decades.",
    "Democrats suffered for years after President Franklin D. Roosevelt’s concessions to Joseph Stalin at Yalta.",
    "Familial bonds deepened after the Cold War ended because it became easier to travel back and forth.",
    "The politics of Eastern European immigrants have never been easy for either party to navigate.",
    "What is certain is that politicians of all stripes will be working hard to win their votes.",
    "Portman is retiring, and there’s a wide-open Republican primary approaching to replace him.",
    "“I could see that alone being a determinant factor when people go to vote,” he said.",
    "But these are not typical times, and so Republicans are singing a different tune.",
    "“It’s political malpractice not to get our crap together,” Graham said.",
    "“They’re just killing us like we are animals,” a Spartz friend texted.",
    "Touting that tribunal is not something Republicans typically do.",
    "She is co-chair of the congressional Ukraine Caucus, while Sen.",
    "Rob Portman (R-Ohio) is a co-chair of its Senate counterpart.",
    "This is a positive role for the opposition party to play.",
    "“We are all Ukrainians,” he said on the Senate floor.",
    "One of the candidates, “Hillbilly Elegy” author J.D.",
    "(This gaffe probably cost him Ohio and Wisconsin.)",
    "Rep. Victoria Spartz (R-Ind.",
    "And President George H.W.",
    "“Putin’s not a genius.",
    "He’s a war criminal.”"
  ]
}