{
  "id": 4309,
  "mediaId": 2748,
  "date": "2022-02-26",
  "headline": "Biden Admin Asks Border Agents to Deploy to Europe Even as Southern Border Crisis Rages: Report",
  "image": "http://www.stationgossip.com/favicon.ico",
  "link": "http://www.stationgossip.com/2022/02/biden-admin-asks-border-agents-to.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STATION GOSSIP",
  "authorUrl": "https://www.blogger.com/profile/14290129071922737076",
  "termIds": [
    1328,
    3466,
    3975,
    1097,
    5254,
    5366,
    5371
  ],
  "sentences": [
    "According to Just the News, the Customs and Border Protection office of field operations sent a memo Thursday morning asking for volunteers to fly to Poland for “Operation Ukraine Support.”\n“The Office of Field Operations is seeking volunteers to assist with the possible evacuation of U.S. citizens, lawful permanent residents, and their immediate family members from Ukraine,” the memo said.",
    "“Eligible employees who volunteer for this situation may be selected to serve a temporary duty assignment in Poland to facilitate travelers for entry into the U.S., to include providing guidance and problems resolution to other government agencies.”\nIf this report is true, it seems to prove a point Fox News host Tucker Carlson made on his show on Wednesday.",
    "“As a mission necessity and to avoid post-arrival quarantine, volunteers must be able to provide a negative PCR test taken within 24 hours of arrival and meet one of the following conditions: fully vaccinated with a COVID-19 vaccination” or “recovered from COVID-19 within six months prior to arrival,” the memo said.",
    "Just the News pointed out that this is the second time in just six months that the Biden administration has scrambled to process arrivals from war-torn countries in the U.S.\nAfter Biden’s Afghanistan disaster, at least 50 Afghan refugees who pose significant security threats were let into the country.",
    "“We would be much better served, Tucker — our people would be safer — if we declared the Mexican cartels a terrorist organization, focused on them, and let Ukraine and Russia figure out what’s in Russia and Ukraine’s business,” Vance said.",
    "When the United States is invaded, it’s ‘equity.’ That may be why the Biden administration has admitted thousands of refugees into this country without vetting them.”\nOhio Senate candidate J.D.",
    "“The contrast between official concern over the borders of Ukraine and official neglect of our own borders is pretty hard to miss,” Carlson said.",
    "Leftists accused Carlson and Vance of ignoring the plight of Ukrainian citizens, but at some point, President Joe Biden has to make a decision.",
    "Of course, while the Biden administration has no problem ignoring the border crisis, the CBP memo made sure to mention the coronavirus.",
    "Now, a new report claims the administration plans to use the Ukraine crisis to further divert resources from the border.",
    "Is it more important to protect his own citizens or to protect citizens of another country halfway across the world?",
    "For months, the Biden administration has effectively ignored the crisis at the southern U.S. border.",
    "One would be hard-pressed to find a memo containing more misaligned priorities than this one.",
    "Vance joined Carlson during the segment and reiterated the same point.",
    "When Ukraine is invaded, it’s a war crime.",
    "“We think we’ve solved the riddle here.",
    "“We’ve returned to it again and again."
  ]
}