{
  "id": 4329,
  "mediaId": 2631,
  "date": "2022-02-28",
  "headline": "How a Trump-averse Republican in Ohio is shaking up a crowded Senate primary",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220228-matt-dolan-ohio-ONETIMEUSE-mn-1350-f85b6a.jpg",
  "link": "https://www.nbcnews.com/politics/elections/trump-averse-republican-ohio-shaking-crowded-senate-primary-rcna17923",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“What motivates me to run is to make sure we get Republican ideas back into law and execute on them so we can’t have the Biden administration keep destroying our country.”\nKasich, the former governor who is strenuously anti-Trump, has not weighed in on the Senate race.",
    "“I know of at least one person in the race who I won’t be endorsing,” Trump declared in September, upbraiding Dolan for being a member of the family that owns Cleveland’s Major League Baseball franchise that recently changed its name to the Guardians.",
    "“You have a handful of candidates that look the same, sound the same, act the same, and they’re letting Matt have the serious lane to himself,” said state Sen. Jay Hottinger, a Republican and a longtime friend of Dolan’s who has endorsed him.",
    "His pitch to primary voters is anchored in traditional conservative ideas and compromise rather than in the election conspiracy theories and right-wing cultural grievances that Trump employs and expects those angling for his support to echo.",
    "But he occasionally broke ranks, like the time during a state budget crunch when he voted with Democrats to end an income tax cut, or the time he supported legislation to ban discrimination against gay and transgender people.",
    "The strategy is to carve out a lane of either anti-Trump or Trump-ambivalent voters that Dolan has all to himself and cobble together a plurality — a majority is not required to win — while his rivals fight on the fringes.",
    "“When I made the decision to get involved in public service, I made a commitment that I would be true to who I am, be true to the issues that are facing our state and our nation and to act on what is right,” Dolan said.",
    "“I’m Matt Dolan and I approve this message because without a border,” he concludes as he snaps the pencil in half, “we have no country.” Dolan doesn’t mention Trump in the ads, but he does criticize President Joe Biden.",
    "He’s moved up in the polling,” said one unaligned Ohio Republican strategist, who is torn between Dolan and Jane Timken, a former state party chair, and requested anonymity to speak freely because of divided loyalties.",
    "Hansen said she sees in Dolan a return to the “traditional Republicanism” of Kasich and George Voinovich, a former U.S. senator and governor in Ohio whose successful 1998 campaign for Senate Hansen managed.",
    "In a statement, Moreno said that he and the former president “agreed this race has too many Trump candidates” and acknowledged that a split vote among them could cost the pro-Trump movement a Senate seat.",
    "“And I am the only one moving on.”\nAs tricky a path as it may be, Dolan’s strategy so far has shown him to be a disruptive enough force that Trump and the other candidates are now scrambling to stop him.",
    "“He’s increased his vote share, and there’s still a sizable chunk that’s undecided.”\n“He’s actually able to talk intelligently on issues as opposed to just emotional dog whistles,” the strategist added.",
    "An endorsement from the Franklin County GOP in Columbus signaled inroads with the same establishment forces who helped John Kasich, then governor, beat Trump in Ohio’s 2016 presidential primary.",
    "Along the way, Dolan took flak whenever his family’s baseball team was losing or failing to land better players, such as a right-handed power hitter — a longstanding gripe among Guardians fans.",
    "Such complaints have resurfaced since he announced how heavily he would self-fund his campaign and his parents gave at least $2 million to a super PAC airing radio ads to promote his candidacy.",
    "But the timing coincided with Dolan’s ascent, his eagerness to present himself as a Portman-like candidate and his efforts to coax past Portman donors off the sidelines and over to his camp.",
    "Dolan drew a salary of about $14,000 from the Guardians last year, according to a financial disclosure, but he said his involvement has been limited to budget work and charitable efforts.",
    "His father, in a 2010 interview with The Plain Dealer in Cleveland, recalled cracking jokes at his expense when Dolan’s sister scored higher on the Law School Aptitude Test.",
    "CLEVELAND — In Ohio’s crowded Republican Senate primary, every candidate would do just about anything to grab former President Donald Trump’s attention — except one.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nTrump spokesperson Taylor Budowich rejected the idea that Dolan has a plausible path.",
    "Dolan’s campaign leans more into his legislative record, highlighting tax cuts and his recent work passing a state budget as chair of the Senate Finance Committee.",
    "After committing more than $10 million of his own money and airing his first TV ads, Dolan has risen in polling, according to internal and public surveys.",
    "“Dolan can’t win it without President Trump’s endorsement, and you have a better chance of getting the endorsement than he does,” Budowich told NBC News.",
    "His 2010 run for Cuyahoga County executive — at the time a powerful new position in an overwhelmingly Democratic area — ended with a double-digit loss.",
    "Another focuses on border security and opens with Dolan pointing to a sharpened pencil tip he says is big enough to hold a fatal dose of fentanyl.",
    "As the fourth of six children growing up in a prominent family from Cleveland’s wealthy suburbs, he was thrown into competition at an early age.",
    "But several of his closest advisers, including former campaign manager Beth Hansen and longtime strategist Doug Preisse, are backing Dolan.",
    "Portman and Timken are friends — his wife had already been raising money for her campaign, and his endorsement had been anticipated.",
    "“I think the Republican Party, the Republican voter, wants to move on,” Dolan said in an interview this week with NBC News.",
    "“I’ll let others decide whether or not this is a vote on the Republican Party,” Dolan said of his Senate primary contest.",
    "One wild card is that the May 3 primary could be pushed back because of delays in drawing new congressional districts.",
    "Dolan, whose self-funding trails only Gibbons, said he would have no problem keeping ads on the air if that happens.",
    "He received a secured line of credit against personal investments to free up the campaign funds, an adviser said.",
    "With an eye on the state House speaker’s gavel in 2008, he controlled the GOP caucus campaign funds that year.",
    "In the 2000s, Dolan mostly blended in with his conservative colleagues in the Ohio House of Representatives.",
    "Among the GOP candidates, Dolan is the only one who holds elected office and one of only two who ever has.",
    "“That is not always, politically, the right move.”\nDolan stumbled a few times on the political ladder.",
    "And the one who wouldn’t — Matt Dolan — had Trump's attention within hours of launching his campaign.",
    "Timken, former state Treasurer Josh Mandel, investment banker Mike Gibbons and author J.D.",
    "“The others are just trying to out-Trump one another — ‘No, I know him better than you do.",
    "“We’ve got five candidates, none of whom in my opinion is doing a bad job,” Hansen said.",
    "And his messaging in some instances overlaps with issues important to Trump’s base.",
    "But Republicans lost the majority, and Dolan resigned before his next term expired.",
    "No, I’ve been to more rallies than you have.’”\nDolan is not outwardly anti-Trump.",
    "He has said he would vote for him if he’s the GOP nominee for president in 2024.",
    "Dolan, a state senator, is running a unique campaign for a Republican in 2022.",
    "“I think that will have appeal.”\nRecent moves by his rivals are also telling.",
    "Through his super PAC, Trump could choose to unleash TV ads attacking Dolan.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "He rounded out his extracurriculars with sports and school plays.",
    "Businessman Bernie Moreno dropped out after huddling with Trump.",
    "Rob Portman, R-Ohio, who is not seeking re-election this year.",
    "If everyone took a fifth of the vote, that’s 20 percent.",
    "It hasn’t always been this easy for Dolan to stand out.",
    "“They’ve all got endorsements, they’ve all got money.",
    "One of his ads warns of a “cold war” with China.",
    "Timken collected an endorsement from Sen.",
    "Vance are all independently wealthy, too.",
    "But so could any of Dolan’s four rivals.",
    "At this point it’s largely tactical.",
    "The guy who takes 22 wins.”",
    "It’s numerical.",
    "“Can it work?"
  ]
}