{
  "id": 4341,
  "mediaId": 2629,
  "date": "2022-03-01",
  "headline": "As Putin Sinks Into Infamy, He's Taking Down Trump Republicans Too",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjgyMDI1OC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY4OTM0Nzk5M30.6Uix9Z5i_4SUbsw2t__jbG8axFSZYmL2mOPOWqMZb2E/img.jpg?width=1200&coordinates=0%2C56%2C0%2C57&height=600",
  "link": "https://www.nationalmemo.com/volodymyr-zelensky",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Eric Boehlert points out that on Fox News, whose commentators are regularly featured on Russian state TV, a smirking “Laura Ingraham mocked…Zelensky’s passionate plea for peace as a ‘pathetic display’ from a ‘defeated man.’ Tucker Carlson announced, ‘No one on this show is…rooting for the Ukrainians for that matter,’ insisting Putin ‘just wants to keep his western borders secure.’” Celebrity author and Ohio GOP Senate candidate J.D Vance said, “I don’t really care what happens to Ukraine one way or the other.”\nAfter the political winds shifted, Vance did too.",
    "Furthermore, even if Putin’s forces were to capture or kill Ukrainian President Volodymyr Zelensky, they will have first succeeded in transforming him into a heroic avatar: A living symbol of freedom who has used his skills as a TV performer to rally his people against Kremlin brutality.",
    "TheWashington Post reports that “[m]ultiple videos from around the country have portrayed scenes of burned Russian tanks, dead Russian soldiers and captured Russians, some barely out of their teens, making plaintive calls home to their parents.”\nThey’re mainly draftees, you know.",
    "Closer to home, Trump Republicans are having trouble remembering which side they’re on, much less recalling that their hero was impeached for trying to blackmail President Zelensky into conjuring a phony investigation of Joe Biden.",
    "Vladimir Putin’s forces can besiege the Ukrainian capital and demolish its monuments—albeit at a fearful cost to Russia’s conscript army--but overcoming the patriotic determination of its people appears beyond his capacity.",
    "“He’s taken over a country for $2 worth of sanctions,” Trump said, “taking over a country — really a vast, vast location, a great piece of land with a lot of people — and just walking right in.”\nThe man is a moral imbecile.",
    "As I write, a 40-mile long convoy of Russian “peacekeepers” — i.e., tanks, armored personnel carriers and mobile artillery — is approaching Kiev with the clear intent of bludgeoning the Ukrainian people into surrender.",
    "\"When dictators rule for decades,” former US Ambassador to Russia Michael McFaul has said “they (1) stop listening to advisors, (2) become disconnected from reality, (3) spend a lot of time alone, and (4) overreach.",
    "Today’s white nationalists are the spiritual (and sometimes literal) descendants of the 1930s “America First” movement, which held pro-Nazi rallies at Madison Square Garden right up until Pearl Harbor.",
    "Already, the reputation of Russia’s vaunted army has been tarnished in a display of logistical incompetence that’s left its forces out of fuel, stranded, and at the mercy of Ukrainian irregulars.",
    "Even as the tanks rolled, Donald J. Trump called Vladimir Putin “savvy,” and a “genius.” Speaking at a Florida fund-raiser, he portrayed the Russian invasion as a clever real estate transaction.",
    "Meanwhile, over on the moron wing of the Republican Party, the inimitable Marjorie Taylor Greene spoke at a white supremacist rally in Orlando whose organizers led cheers for Russia.",
    "McFaul also tweeted that he’s “confident in predicting that Putin's evil invasion of Ukraine marks the beginning of the end of Putin's dictatorship and Putinism in Russia.",
    "So far, Putin’s invasion has accomplished two things: making Ukraine an international symbol of democracy and the Russian gangster state an international pariah.",
    "Trump also froze military aid to Ukraine, and even echoed Kremlin propaganda that Ukraine, not Russia, interfered in the 2016 American election.",
    "Nevertheless, should the tyrant’s rage and paranoia make him order a nuclear strike, I suspect that patriotic Russian officers would refuse.",
    "Vance, who once called Trump an “idiot” and compared his fan base to opioid addicts, declared himself “honored” to accept her endorsement.",
    "Chances are he’s just bluffing about Russia’s nuclear arsenal, like a barroom brawler demanding his friends restrain him.",
    "Now he says that if he were president Russia wouldn’t have dared, this guy who all but sent Putin an engraved invitation.",
    "Putin’s political rivals keep falling out of tall buildings and finding deadly toxins in their underwear.",
    "Frankly, it’s hard to imagine how Putin’s rule survives the consequences of his enormous blunder.",
    "There are millions of moral people in Russia.”\nFrankly, it’s good to be reminded.",
    "All across Europe, athletes are refusing to play against Russian teams.",
    "The dead-eyed little killer in the Kremlin is too fearful to back down.",
    "Evidently, many had no idea they were being ordered to invade.",
    "Greene later feigned ignorance of the group’s views.",
    "In Moscow, however, the costs of dissent are high.",
    "Putin has little regard for Russian lives either.",
    "So, yes, America, we’ve seen this movie before.",
    "No moral person can support this heinous war.",
    "This is exactly what has happened to Putin.\"",
    "“Putin, Putin, Putin!” chanted the crowd.",
    "And that could indeed be the end of him.",
    "It hasn’t been but a month since J.D.",
    "Then there’s the great man himself.",
    "Even so, it’s not going to happen.",
    "This is who they are, America.",
    "And a bankrupt pariah at that.",
    "Remember them.",
    "vladimir putin"
  ]
}