{
  "id": 4396,
  "mediaId": 2676,
  "date": "2022-02-28",
  "headline": "Right's desperate Putin pivot: CPAC derailed by Ukraine invasion, struggles to blame \"wokeness\"",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/02/vance-gabbard-farage-0228221.jpg",
  "link": "https://www.salon.com/2022/02/28/rights-desperate-putin-pivot-cpac-derailed-by-ukraine-invasion-struggles-to-wokeness/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kathryn Joyce",
  "authorUrl": "https://www.salon.com/writer/kathryn_joyce",
  "termIds": [
    0
  ],
  "sentences": [
    "While that would certainly be alarming, you couldn't possibly have gathered from Blackburn's speech that she's actually referring to a February memo from the agency that described multiple factors of \"a heightened threat environment\" in the U.S., including online disinformation and conspiracy theories that have sparked calls for violence against immigrants, inspired threats against historically Black colleges and universities, and are part of continuing racially- and religiously-inspired violence like the hostage situation at a Texas synagogue last month.",
    "Echoing the repeated proclamation of speakers that they, or perhaps everyone in the room, had been labeled a \"domestic terrorist\" by the Biden administration, Tennessee Sen. Marsha Blackburn claimed that the Department of Homeland Security has called on the public to begin informing on their neighbors, \"saying, if you hear anyone who's speaking out against COVID policies, school policies, let us know.\"",
    "This is an impressive feat of projection: Vindman's actual lawsuit charges that Trump's aides spread lies meant to intimidate him (including the claim that he was a Ukrainian spy) and got both him and his twin brother fired from government posts, but Hagerty cast the suit as a Democratic effort to use legal harassment to \"cancel\" young conservatives and bar them from working in government.",
    "Gabbard, in a high-profile speaking slot during the conference's Saturday night Ronald Reagan dinner, opened with a call to send prayers to Ukraine, before charging the Biden administration with hypocrisy, for wanting to \"go to war to spread democracy and freedom while they actively work to undermine our democratic republic and our freedoms right here at home.\"",
    "Ron DeSantis, basking in the ubiquitous praise of the Sunshine State for having fended off \"some Faucian dystopia,\" hinted at antisemitic conspiracy theory with his vague but ominous claim that \"Wokeness is a form of cultural Marxism\" aimed at \"tearing at the fabric of our society and trying to replace it with something that will be much, much more sinister.\"",
    "In much the same spirit as Boebert's claim that Canadian and American democracies are in dire need of intervention and salvation, Gabbard referred to Canadian Prime Minister Justin Trudeau as \"the autocratic leader in Canada who's resorted to genuinely authoritarian and tyrannical means to suppress a peaceful mass protest against the power elites there.\"",
    "This meant, first and foremost, Republican staffers on Capitol Hill who have been summoned before the House Jan. 6 committee, along with a former Trump employee now included in a lawsuit brought by Lt. Col. Alexander Vindman against Donald Trump Jr., Rudy Giuliani and other Trump aides, for retaliating against him after his 2019 testimony to Congress.",
    "Some of it was bizarre, like \"Blexit\" founder Candace Owens' discourse on the origins of the term \"mama bear\" to call for continued parental crusades against public schools, or her suggestion that critical race theory is an intentional ploy to prevent Black children from learning how to read, as during slavery, so they can more easily be controlled.",
    "Right-wing social media influencer Rogan O'Handley warned that GOP hawks from the \"establishment, military-industrial complex\" wing of the party would try to convince the crowd that defending Ukraine was in America's interests, when really, he said, there was no reason to send U.S. troops \"to cover up the Biden crime family's corruption.\"",
    "Also unsurprisingly, the conference featured a good deal of COVID skepticism, with numerous calls to \"lock\" Anthony Fauci \"up,\" and a contingent of doctors who have become celebrities in the anti-vaccination world, including Peter McCullough, Robert Malone and TV celebrity turned Pennsylvania Senate candidate Dr. Mehmet Oz.",
    "Vance still complained that he'd unfairly gotten \"flack\" for suggesting Americans should care more about the opioid crisis than \"people 6,000 miles away,\" but also released a statement calling the attack a tragedy and charging that \"Russia is always at its most bellicose when a globalist sits in the Oval Office.\"",
    "In response, Scott proposed an 11-point plan \"to save America,\" including a requirement that all school children \"learn that America is the greatest country in this world,\" forbidding the government from collecting any demographic information about race or ethnicity and declaring socialism \"a foreign adversary.\"",
    "Former Trump HUD Secretary Ben Carson said that masking children might lead to \"a generation of psychopaths,\" while Rep. Matt Gaetz, the embattled Florida Republican surrounded by rumors of illicit sexual conduct, said it would create \"a generation of little sociopaths who will act like the Menendez brothers.\"",
    "Conference organizer Mercedes Schlapp, of the American Conservative Union, introduced one panel by coming on stage wearing a mask and saying, \"It's not Mercedes Schlapp, it's Joy Behar from 'The View,' and I wear my mask everywhere,\" before theatrically tearing it off and tossing it toward the crowd.",
    "There were a few isolated calls for moderation, as when Farage gingerly suggested that Republicans stop focusing on the \"negative, backward-looking message\" of a stolen election, or when COVID conspiracy theorist Alex Berenson pleaded with CPAC attendees to \"Stop trying to ban books.",
    "As the most significant annual gathering of American conservatives got underway Thursday, organizers were faced with the unhappy coincidence of their domestic grievance agenda with a history-making foreign threat, as Russia launched its long-anticipated invasion of Ukraine.",
    "In her Saturday night speech, Gabbard matched the tone of her conservative fellow speakers, stressing God-given freedoms, shouting out to parents \"in the trenches\" of school board fights, and demonstrating a very Republican understanding of what tyranny might be.",
    "Farage backpedaled furiously in his Saturday speech, admitting that while he'd always thought Putin was a \"reasonable\" nationalist, it was just possible that wasn't the case; in any case, the invasion was still Biden's fault, for giving Putin \"nothing to fear.\"",
    "Turning Point USA founder Charlie Kirk agreed, saying he wasn't \"defending dictators,\" but adding, \"when your own country is falling apart, I don't want to hear lectures about why we have to send our troops halfway around the world when we are being invaded!\"",
    "Throughout the conference, there was a steady theme of purported conservative victimization at the hands of Democrats, the \"deep state,\" liberals or \"wokeness,\" though sometimes the complaints required some research and translation to be intelligible.",
    "But those arguments were drowned out by declarations, delivered like a loyalty oath, that the election was rigged; that \"radical librarians\" are \"grooming\" children; and that the most vicious threat Americans face, once again, is right next door.",
    "As Ian Prior, an architect of Loudoun County, Virginia's school board recall campaign, told the crowd, \"We're looking at a moment where we have the potential to build the biggest bloc of single-issue voters in the history of American politics.\"",
    "Or, as Nevada Senate candidate Adam Laxalt said, \"If you attack your country, if your elites do not believe in our nation and they tell the rest of the world that we are flawed, and we are damaged, what do you think that tells Vladimir Putin?",
    "Sen. John Kennedy, R-La., argued that \"weakness invites the wolves,\" and Donald Trump himself, in his Saturday-night stem-winder, protested that \"none of this ever would have happened if the election was not rigged and I was the president.\"",
    "The four-day Conservative Political Action Conference (CPAC) that concluded Sunday afternoon presented a rare opportunity to watch that transformation take place in real time, as if in an exceedingly awkward time-lapse video.",
    "That theme was repeated throughout the conference: \"Muscular diplomacy\" was required to secure peace, but Biden \"radiated provocative weakness,\" as former Trump acting director of national intelligence Richard Grenell said.",
    "CPAC speakers' commitment to the culture wars, however, sparked no such ambivalence, and the conference featured an extensive array of McCarthyite descriptions of Democrats, liberals and progressives as the enemy within.",
    "Kathryn Joyce is an investigative reporter at Salon, and the author of two books: \"The Child Catchers: Rescue, Trafficking and the New Gospel of Adoption\" and \"Quiverfull: Inside the Christian Patriarchy Movement.\"",
    "Right-wing U.K. broadcaster and Brexit booster Nigel Farage, who has long expressed admiration for Russian President Vladimir Putin, blamed the European Union's \"territorial expansionism\" for provoking the attack.",
    "(As for teaching children about slavery, Sen. Kennedy used a peculiarly passive construction: \"Like every other culture in the history of humanity, America caught the disease of slavery, but we beat it back.\")",
    "Former Democratic Rep. Tulsi Gabbard, in an appearance on Tucker Carlson's Fox News show, blamed President Biden and NATO for not taking Ukraine's potential membership in the defense alliance off the table.",
    "(Carlson's and Gabbard's comments in particular proved such a useful echo of Putin's own justifications for the invasion that Russian state TV repeatedly broadcast them, with dubbed translation, last week.)",
    "In a Saturday session, conference organizer Matt Schlapp spoke with Tennessee Sen. Bill Hagerty about their work to create a new \"First Amendment Fund\" to provide funds and legal support to \"the canceled.\"",
    "To this was added another through-line that became a dominant focus of the conference: Biden's abandonment of Trump's oil and gas drilling had so enriched Russia that Putin could afford to start a war.",
    "Much of the CPAC discourse, though, was tactical, with lengthy panel discussions featuring activists from Virginia and Texas who had waged war on their local school boards or taken them over outright.",
    "Political narratives shift constantly, but in more normal times it requires a bit of distance to see the subtle course corrections that politicians and pundits make en route to a new position.",
    "The call to contact authorities was nothing more than the by-now-familiar \"see something, say something\" language that referenced threats of violence, not expressions of political opinion.",
    "Conservative commentator Eric Bolling suggested that the Biden administration's concern with \"being woke\" over being \"powerful and effective\" was responsible for the situation in Ukraine.",
    "government' with the word 'church,' we can see how those in power see themselves as the high priest in a secular theocracy,\" under which anyone who disagrees with them are \"heretics.\"",
    "\"It is coming from power elites here at home and their co-conspirators in the mainstream media and the security state who are working to undermine our freedoms from within.\"",
    "Eric Greitens (now a Senate candidate) came a warning: \"The left is actively trying to destroy our country,\" and conservatives must \"recognize the nature\" of their enemy.",
    "Sen. Rick Scott of Florida used the language explicitly: \"We survived the war of 1812, the Civil War, World War I and World War II, Korea, Vietnam and the Cold War.",
    "\"Those who ride the tiger of tyranny, they keep progressing to more and more oppression, because they know that if they step off, the tiger will eat them as well.\"",
    "Other speakers seemed to retrofit speeches written before the invasion, focused on the conference theme of \"Awake Not Woke,\" to account for the fast-changing news.",
    "But by the time those three speakers reached the CPAC stage on Friday and Saturday, events on the ground in Ukraine had forced them to change their tune.",
    "Unsurprisingly, the education wars dominated the conference, meriting multiple dedicated panels as well as mention in almost every major speech.",
    "McCullough told the roughly 70 percent of the CPAC audience who said they'd had COVID that, \"for you, this pandemic is effectively over with.\"",
    "Gabbard raised the same Homeland Security memo Blackburn had, arguing that it represented an effort to label all dissent as disinformation.",
    "In response, Sen. Josh Hawley, R-Mo., vowed in his address to introduce legislation to \"reopen America's energy production\" this Monday.",
    "But today we face the greatest danger we have ever faced: the militant left wing in our country has become the enemy within.\"",
    "said Josh Mandel, Vance's rival in the Ohio Republican Senate race — and to ban both early voting and most mail-in voting.",
    "Vance told Steve Bannon the previous Friday, \"I gotta be honest with you, I don't really care what happens to Ukraine.\"",
    "Rep. Lauren Boebert, R-Colo., succinctly argued that Canada and the U.S. need to be liberated from tyranny as well.",
    "… If you stand for free speech, you have to stand for free speech no matter if you don't like what's being said.\"",
    "\"Who would have thought in America it's become illegal to be a Republican supporting a Republican president?\"",
    "Farage contended that universities have become \"madrassas of Marxism,\" creating more \"enemies inside.\"",
    "Another recurring focus was the call to restrict voting to a single day — \"It's called Election Day!\"",
    "\"The biggest threat to our country is not coming from some foreign country,\" she said.",
    "At the outset, a handful of speakers struck a stridently isolationist stance.",
    "Other scheduled CPAC speakers had made similar arguments earlier in the week.",
    "MORE FROM Kathryn Joyce • FOLLOW kathrynajoyce\nTrending Articles from Salon",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "\"The nature of leftism is that it never stops,\" Greitens said.",
    "Mark Robinson, we heard that Democrats are \"the real virus.\"",
    "Bestselling author turned Ohio GOP Senate candidate J.D.",
    "Subscribe to our morning newsletter, Crash Course.",
    "From scandal-plagued former Missouri Gov.",
    "It tells him it's the time to march.\"",
    "\"If you replace the word 'U.S.",
    "From North Carolina Lt. Gov.",
    "Schlapp responded.",
    "There was more.",
    "Florida Gov."
  ]
}