{
  "id": 4442,
  "mediaId": 2532,
  "date": "2022-02-27",
  "headline": "Transcript: Representative Liz Cheney on \"Face the Nation,\" February 27, 2022",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/02/27/5f26f79a-644c-40c5-8066-0bda11e61704/thumbnail/1200x630g2/bdc06b6a28af46c5f6f761e0654b712f/screen-shot-2022-02-27-at-10-48-46-am.png",
  "link": "https://www.cbsnews.com/news/transcript-liz-cheney-face-the-nation-02-27-2022/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "War in Ukraine\n More\n Antony Blinken and Lloyd Austin headed to Kyiv, Zelenskyy says\n Why Russia keeps losing armored vehicles: \"It's finders keepers\"\n Mariupol evacuation \"thwarted\" by Russian forces as death toll mounts\n Russia claims Mariupol win as Ukrainian forces hold on\n Koch Industries says it will stop doing business in Russia\n More",
    "And anyone who thinks that U.S. freedom and security is going to be maintained if we take a step back and don't lead, you simply need to look at what's happening in Ukraine to recognize that- that those who fill the void when the U.S. steps away are people like the Russians, like the Chinese, like the Iranians.",
    "I think that it's very important, you'll see with the January six committee, we have a very aggressive litigation strategy, and I think that there were a number of instances in the first impeachment where it would have been important and decisive to have witnesses testify who did not come in and testify.",
    "REP. CHENEY: I don't regret my vote, I think any impeachment vote has got to be one that is based very clearly on- on the evidence, and I think that we certainly have learned a lot from that first impeachment trial that we are using as we move forward in the January six committee.",
    "MARGARET BRENNAN: The first- first impeachment trial of President Trump was triggered from a complaint by U.S. intelligence official, who said that the president was withholding aid or threatening to- to Ukraine, to President Zelensky, in order to win political favors.",
    "One thing that President Trump got right was increased spending for the military, and it's very important for us, especially as we look at the challenges now, as we look at Putin's nuclear threat, we cannot adopt policies like a no-first-use nuclear policy.",
    "I think though, it's very clear, if you- if you look at some of the challenges that we're dealing with now, President Trump spent a large part of his presidency, for example, attacking NATO, saying that NATO was obsolete, attacking our allies.",
    "And as- as you look at things like Vladimir Putin's threat, for example, this morning about his nuclear forces, you know, that's something that we need to take seriously, but we also need to be clear that we're not going to be intimidated.",
    "And one of our former U.S. ambassadors to Ukraine, John Herbst, has pointed out that it cost Putin nothing to make that threat, but it would cost him everything were he to follow through, certainly with any- any use of nuclear force.",
    "We ought to be sanctioning not just Putin, not just Lavrov, not just the oligarchs, but all of their families that this- this behavior, this aggression against Ukraine is something that- that the- the world simply cannot tolerate.",
    "MARGARET BRENNAN: But do you agree with President Biden's strategy here that rather than go nose to nose with the Russian military, U.S. force should be completely off the table and that it should all be dependent on sanctions.",
    "I'd like to see very clear that- you know- the United States ought to be looking at ourselves, frankly, as an arsenal of energy for the world in a way that in World War Two, we were an arsenal of democracy.",
    "REP. CHENEY: I think there are several things we need to be doing, we need to certainly be increasing the sanctions, as I've said, and I would have sequenced the sanctions differently.",
    "REP. CHENEY: Look, we've- we've been down that road before, we've seen isolationism in both parties, and it's always been wrong and it's always been dangerous.",
    "And- and I think it's- it's indefensible for people to abandon those or suggest that we are- we have no- no view as between Russia and Ukraine in this battle.",
    "The following is a transcript of an interview with GOP Representative Liz Cheney of Wyoming that aired Sunday, February 27, 2022, on \"Face the Nation.\"",
    "America cannot defend and maintain our own freedom and security if we think that we're going to simply withdraw from the world and not lead.",
    "And so the idea that- that the world will be safe and that America will be able to be safe and free with an isolationist approach is wrong.",
    "I think the fact that we've had the European countries and NATO united with the United States as we go forward is a very positive thing.",
    "Vance, an Ohio candidate for Senate, said on a podcast recently, 'I don't really care what happens to Ukraine one way or the other.'",
    "I think we need to make sure that we get the Supplemental Assistance Package that should be on the floor of the House this week.",
    "Senator Josh Hawley of Missouri told CBS the U.S. should not send troops to any NATO country since the U.S. can't afford it.",
    "So there is this non-interventionist, isolationist movement that President Trump himself really endorsed with America First.",
    "So I think there are a number of things we need to be doing that make very clear that the United States stands with Ukraine.",
    "You know, we are watching today the brutality of Vladimir Putin as he attempts to invade a democratic sovereign nation.",
    "We ought to be an arsenal of energy, so we ought to be unleashing our own energy resources, our own energy production.",
    "We have to make sure that we are recognizing here at home, what's- what's important and necessary to defend ourselves.",
    "I was very pleased to see that Germany has announced that they will be raising their defense spending to two percent.",
    "MARGARET BRENNAN: Well, I think that picture looks a lot different now that we see a city being bombed by Russia.",
    "And we are certainly seeing today how crucially important NATO is, how crucially important our allies are.",
    "I think we need to make sure that we're rushing additional javelin and stinger missiles to the Ukrainians.",
    "MARGARET BRENNAN: I want to ask you about where the conservative movement is these days with Russia.",
    "REP. CHENEY: We certainly haven't reached the limit, I think that we have seen impressive progress.",
    "MARGARET BRENNAN: We go now to Representative Liz Cheney of Wyoming, who joins us from Casper.",
    "MARGARET BRENNAN: Have we reached the limit of what is possible to do here with sanctions?",
    "We need to make sure that we are moving to deploy forces as we are in Eastern Europe.",
    "We need to make sure that we're continuing to encourage our allies to do the same.",
    "I would like to see us move with respect to the Russian central bank completely.",
    "I mean, how do you explain to voters why that view- Republican view- is wrong?",
    "We can't accept defense spending that is insufficient to defend our interests.",
    "We ought to stop the imports of Russian oil to the United States.",
    "I'd like to see swift sanctions that don't leave any carve outs.",
    "So the United States has got to be absolutely clear about that.",
    "Or is there something more you think would make a difference?",
    "America was founded on fundamental principles of freedom.",
    "We're going to talk about some of that ahead with H.R.",
    "Do you view what happened then differently now?",
    "So there's- there's certainly more we can do.",
    "Thank you so much Liz Cheney for joining us.",
    "As I said, we've made good progress so far.",
    "I'd like to see the oil industry affected.",
    "REP. LIZ CHENEY: Good morning, Margaret.",
    "So the sanctions ought to go further.",
    "You know, America stands for freedom.",
    "Good morning to you, Congresswoman.",
    "We did not enforce the subpoenas.",
    "Do you regret your no vote then?",
    "I would have done more early on.",
    "I do think we need to do more.",
    "We need to get that moving.",
    "It's also wrong morally.",
    "Good to be with you.",
    "We'll be right back.",
    "McMaster.",
    "J.D."
  ]
}