{
  "id": 4491,
  "mediaId": 2894,
  "date": "2022-03-02",
  "headline": "Editorial: Troubling emergence of support for Putin",
  "image": "https://wwwcache.wral.com/presentation/v3/images/content/social/open_graph/wral_newcom_1920x1080.jpg",
  "link": "https://www.wral.com/editorial-troubling-emergence-of-support-for-putin/20166013/",
  "mediaOutlet": "wral.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Former President Donald Trump reiterated his praise of the Russian dictator’s “genius.” Just a few days earlier Michael Pompeo, Trump’s former Secretary of State, complimented Putin as “very shrewd” and “very capable.”\nHow far this now fringe branch of the Republican party has fallen from the days when late President Ronald Reagan addressed them in 1981.",
    "Mark Robinson made mention of the need of people in Australia and Canada to be able to arm themselves against “terrible things.” He didn’t say a word during his 12-minute address of the immediate massive Russian threat to under-armed Ukrainians.",
    "What has happened to so many of those in a political party who’s revered conservative spirit once confronted Russia with a demand to “tear down this wall” in support of freedom for those suffering under that nation’s dictatorial oppression?",
    "Vance, one of the GOP’s most significant emerging voices, declared: ““I gotta be honest with you, I don’t really care what happens to Ukraine.”\nEurope is in the midst of the most violent act of aggression since World War II.",
    "Updated March 6, 2022 11:48 a.m. EST\nCBC Editorial: Wednesday, March 2, 2022; Editorial #8741\nThe following is the opinion of Capitol Broadcasting Company\nThere was lots of rhetoric about freedom last weekend in Orlando.",
    "Conservatives at the annual CPAC event and up the road at the America First gathering, praised China’s totalitarian regime for its values and boosted Vladimir Putin amid his armed attack on the Ukraine.",
    "It is no small matter and our nation – regardless of political identity, should be responding in a strong and united voice on behalf of freedom, the rule of law and self-destiny.",
    "North Carolina Republican congressman Madison Cawthorn praised China for instilling “great patriotic and masculine values” in that dictatorship’s youth.",
    "Standing with the Ukraine – a nation that offered no threat -- against the unwarranted attack of a global bully – is the right and moral stand to take.",
    "“We've heard in our century far too much of the sounds of anguish from those who live under totalitarian rule,” Reagan said.",
    "Today, those who claim to have inherited Reagan’s legacy are deaf to those “sounds of anguish.”\nNorth Carolina’s Lt. Gov.",
    "Nick Fuentes, one of the leaders, urged the support for Putin’s unprovoked armed efforts against the Ukraine.",
    "Capitol Broadcasting Company's Opinion Section seeks a broad range of comments and letters to the editor.",
    "Our Comments beside each opinion column offer the opportunity to engage in a dialogue about this article.",
    "In addition, we invite you to write a letter to the editor about this or any other opinion articles.",
    "Unfortunately, there was little support for those whose lives are on the line defending it.",
    "He, also, made no mention of Putin’s unprovoked violence toward the Ukrainian people.",
    "Putin!”\nIs the Trump wing of the Republican Party being morphed into the Putin wing?",
    "Eight miles from the CPAC event, America First was holding its national conference.",
    "Those who can’t truly stand up for liberty need to get out of the way.",
    "The crowed cheered and then responded with rhythmic chants of “Putin!",
    "Here are some tips on submissions >> SUBMIT A LETTER TO THE EDITOR",
    "Failing to do otherwise is aiding and abetting a totalitarian.",
    "““Can we get a round of applause for Russia?” he asked.",
    "Vladimir Putin’s deadly aggression is wrong.",
    "That is unAmerican.",
    "J.D."
  ]
}