{
  "id": 4521,
  "mediaId": 2779,
  "date": "2022-02-25",
  "headline": "Will the GOP’s Trumpist Wing Persist in Its Embrace of Putin?",
  "image": "https://theintercept.imgix.net/wp-uploads/sites/1/2022/02/GettyImages-1152460534-putin-trump-GOP-support.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800",
  "link": "https://theintercept.com/2022/02/25/russia-ukraine-vladimir-putin-trump/",
  "mediaOutlet": "Intercept",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Vance, the onetime author and now pro-Trump Senate candidate in Ohio, said: “I think it’s ridiculous that we are focused on this border in Ukraine.” (Like Carlson, he was forced to walk back his previous statements Thursday, calling the invasion a “tragedy,” but he still blamed “elites” for “isolating Russia” and “driving Putin directly into the arms of the Chinese Communists.”) And Sen. Josh Hawley, a pro-Trump Missouri Republican who voted against certifying Biden’s win in the 2020 election, has refused to sponsor a Senate Republican proposal calling for tough sanctions on Russia over its invasion of Ukraine.",
    "He used the word ‘independent’ and ‘we’re going to go out and we’re going to go in and we’re going to help keep peace.’”\nMike Pompeo, Trump’s former CIA director and secretary of state, last week called Putin “savvy” and “very talented,” adding, “I have enormous respect for him.” Last month, Pompeo told Fox News, “He knows how to use power.",
    "“I identify more with Putin’s Christian values than I do with Joe Biden.”\nNow many on the right wing are parroting Moscow’s lies about the Russian invasion of Ukraine, claiming that Russia has legitimate national security interests there or that Ukraine’s government is so corrupt it doesn’t deserve U.S. support.",
    "… I actually support Putin’s right to protect his people and always put his people first but also protect their Christian values,” Lauren Witzke, the right-wing Republican nominee for Senate from Delaware in 2020, said this week in an interview that was picked up by Right Wing Watch.",
    "First, there was the Trump-Russia investigation, conducted by special counsel Robert Mueller, into evidence of Russian interference in the 2016 presidential election in order to help Trump win, and into allegations that Trump or his aides sought to collaborate with the Russians.",
    "In the process, Carlson is becoming the modern media successor to Walter Duranty, the New York Times Moscow bureau chief in the 1930s who became infamous as an apologist for Joseph Stalin when the Soviet dictator engineered a massive famine in Ukraine that killed millions.",
    "Michael Flynn, the former general and, very briefly, Trump’s national security adviser, issued a statement criticizing President Joe Biden because he “ignored and laughed at Putin’s legitimate security concerns, and legitimate ethnic problems in the Ukraine.”\nJ.D.",
    "In 1991, following a failed revanchist coup by Soviet hard-liners against Gorbachev, Bush and other Republican leaders worked with Moscow again as the Soviet Union itself was dissolved and former Soviet republics like Ukraine split off into independent nations.",
    "One of the most famous and oft-repeated stories about Putin’s life comes from December 1989, when crowds of demonstrators stormed the Dresden offices of the Stasi, the East German secret police, and the local offices of the KGB, the Russian intelligence agency.",
    "That was followed by Trump’s first impeachment, which centered around charges that he sought to pressure Ukraine to interfere in the 2020 election on his behalf, by trying to convince Ukraine to fabricate an investigation into his political rival, Joe Biden.",
    "After Putin succeeded Boris Yeltsin as Russian president in 2000, it took him years to gain control over Russia’s chaotic post-Soviet political and economic system, which had been dominated by a network of oligarchs and Russian organized crime.",
    "“Trump’s interests don’t seem to align with the interests of the United States of America.”\nBut while other Republicans in Congress denounced Putin’s invasion, they refused to criticize Trump or other Putin sympathizers in their party.",
    "In the same interview, he reiterated his belief that the collapse of the Soviet Union was a major geopolitical tragedy, conflating the Soviet Union with the Russian empire that preceded it, and omitting references to Soviet Communism.",
    "Photo: Aris Messinis/AFP via Getty Images\nRussia’s invasion of Ukraine comes at the end of a six-year period in which American politics has been preoccupied with the two countries in ways that have often seemed opaque and confusing.",
    "In the United States, meanwhile, perhaps the biggest political question in the aftermath of Russia’s invasion of Ukraine is whether the Trumpist wing of the Republican Party will continue its sympathy for and appeasement of Putin.",
    "Photo: Mario Tama/Getty Images\nAs with everything else on the right today, the support for Putin starts with Donald Trump, who has developed a long track record as an apologist for Putin and Russian aggression.",
    "And what had been built up over 1,000 years was largely lost.”\nHis brutal invasion of Ukraine is just the latest move in his long-running strategy to rebuild the Russian empire by any means necessary.",
    "Photo: Brendan Smialowski/AFP via Getty Images\nVladimir Putin was a young KGB officer serving in Dresden, East Germany, in 1989, when the Berlin Wall fell and the Soviet empire began to collapse.",
    "Rep. Liz Cheney, the Wyoming conservative who has been ostracized by the Republican Party for being anti-Trump, was one of the only Republicans to criticize Trump for his statements on Ukraine.",
    "But while Putin hasn’t strayed from his obsessions of 30-plus years ago, the U.S. Republican Party has been comprehensively altered into something that would have been unrecognizable in 1989.",
    "That might have emboldened Putin to move further — most likely against the Baltic states of Lithuania, Latvia, and Estonia, which, like Ukraine, were all previously part of the Soviet Union.",
    "Russia began to engage in sophisticated cyber warfare and disinformation campaigns, using social media and the publication of hacked material against its political opponents in the West.",
    "And we should respect that.”\nFox News anchor Tucker Carlson echoes Trump’s pro-Russian stance, as do the right-wing minions and other fringe characters who appear on his show regularly.",
    "In an interview with Russian state television that aired in December, he claimed that in the immediate aftermath of the Soviet collapse, he had to drive a taxi to make ends meet.",
    "For now, it seems likely that pro-Putin Republicans will continue to allow their hatred for progressives and adherence to white nationalism to blind them to what Putin really is.",
    "Throughout his time in office, Trump talked about withdrawing the United States from NATO, the military alliance that guarantees the defense of Western Europe against Moscow.",
    "Georgia and Ukraine, former Soviet republics that had shown signs of independence from Moscow after the collapse of the Soviet Union, have been two of his biggest targets.",
    "That follows the usual pattern within the GOP, in which establishment politicians try to ignore Trump — only to be overshadowed and eventually overwhelmed by him.",
    "He reportedly confided to aides that he would wait until his second term to pull out of the alliance, to avoid any political blowback during the 2020 election.",
    "On Thursday, in the wake of Russia’s invasion of Ukraine, Lithuania President Gitanas Nauseda declared a state of emergency and ordered troops to its borders.",
    "Today, much of the American right is in thrall to Putin and other autocrats, and a segment of the extreme right now harbors a hatred for Western democracy.",
    "After consolidating his power, Putin turned to rebuilding the Russian empire by forcing former Soviet republics back into political alignment with Russia.",
    "He cracked down on the fledgling democratic system that had begun under Yeltsin, silenced dissent, and imprisoned or murdered his political opponents.",
    "After the Berlin Wall fell, Bush worked with Soviet leader Mikhail Gorbachev to dismantle the Soviet empire in Eastern Europe while avoiding war.",
    "To be sure, even if Trump had been reelected, it would have been extremely difficult for him to win congressional approval to withdraw from NATO.",
    "But given his statements and his track record, Trump would almost certainly not have been willing to aggressively confront Putin over Ukraine.",
    "In order to achieve his strategic objective of rebuilding Moscow’s empire, Putin also sought to weaken the United States and Western Europe.",
    "Putin did not move to invade Ukraine while Trump was president, and it is unclear why he waited until now, with Biden in the White House.",
    "“And Moscow is silent.”\nHalf a world away in the United States, the hawkish, anti-Soviet internationalism of President George H.W.",
    "In 2014, Russia invaded and annexed Crimea from Ukraine, and backed pro-Russian rebels in the Donbas region of eastern Ukraine.",
    "The new American right somehow sees Putin as a guardian of white nationalism who will stand up to the “woke” left in the West.",
    "“Former President Trump’s adulation of Putin today — including calling him a ‘genius’ — aids our enemies,” Cheney tweeted.",
    "The Russian invasion of Ukraine may help explain the constant presence of these two countries in recent U.S. politics.",
    "He said this week that Putin’s move into Ukraine was “genius,” adding that he admired the Russian leader’s strategy.",
    "“It was a disintegration of historical Russia under the name of the Soviet Union,” Putin said in the interview.",
    "Lithuania seems to believe that it would be next on Putin’s target list if it weren’t now a member of NATO.",
    "They don’t seem to care that he is a murderous dictator who has launched a war in the middle of Europe.",
    "“I don’t think anybody approves of what Putin did yesterday,” Carlson said on his show Thursday night.)",
    "Russian intervention in the 2016 U.S. presidential campaign was part of this broader strategy.",
    "(Carlson has received so much criticism that he was forced to back pedal after the invasion.",
    "“It is unpleasant to talk about this, but, unfortunately, this also took place,” Putin said.",
    "In 2008, Putin staged a war against Georgia, backing two pro-Russian breakaway regions.",
    "Russian oligarchs who didn’t pay fealty to Putin found themselves in prison as well.",
    "But it seems possible that he held off to see if Trump would be reelected in 2020.",
    "But others in Trump world have joined the slavish adulation for Putin.",
    "“We cannot do anything without orders from Moscow,” he was told.",
    "Putin called for backup from a nearby unit of the Soviet Army.",
    "“Putin declares a big portion of the Ukraine … as independent.",
    "Bush typified the Republican Party’s foreign policy outlook.",
    "The humiliation Putin felt in 1989 has never left him.",
    "“We turned into a completely different country.",
    "“Russia is a Christian nationalist nation.",
    "Oh, that’s wonderful."
  ]
}