{
  "id": 4525,
  "mediaId": 2803,
  "date": "2022-02-25",
  "headline": "At CPAC, “Wokeness” Is a More Dangerous Enemy Than Putin",
  "image": "https://compote.slate.com/images/b7357723-1825-474a-b937-b8f315418aa2.jpeg?width=780&height=520&rect=2976x1984&offset=21x0",
  "link": "https://slate.com/news-and-politics/2022/02/cpac-russia-woke-desantis-putin.html?via=rss",
  "mediaOutlet": "Slate.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Newell",
  "authorUrl": "https://slate.com/author/jim-newell",
  "termIds": [
    0
  ],
  "sentences": [
    "“What I’m saying, though, is that when your own country is falling apart,” he said, “I don’t want to hear lectures about why we need to send our troops halfway across the world when we are being invaded.”\nTo the extent it otherwise came up, amid a litany of more passionate gripes about “wokeness,” cancel culture, vaccine and mask mandates, and the cable news channel CNN, the Russia-Ukraine war was, first and foremost, an opportunity to call for lifting restrictions on all domestic energy production.",
    "“Every single person in this room,” Florida Sen. Marco Rubio said Friday morning, “and the overwhelming majority of people that, you know, are one word away—and it doesn’t matter if you were 13 years old when you said it—you’re one word, you’re one statement, you’re one retweet, you’re one ‘like’ away, from destroying your life.”\nAs Thursday’s agenda went on and into Friday morning, and the gravity and brutality of the Russian assault became clear, the tone became less dismissive.",
    "Instead, he made jokes about House Speaker Nancy Pelosi flying on a broom and Joe Biden being senile, and called White House press secretary Jen Psaki “Peppermint Patty.” He received a standing ovation when he mocked nosy left-wingers badgering people to get vaccinated, screaming, “Shut the hell up!”\nWhile Cruz chose to ignore the Russia-Ukraine crisis altogether, Turning Point USA founder Charlie Kirk foregrounded why it was of little interest to him.",
    "“No matter where you stand on this Ukraine-Russia situation—what we should have done beforehand, what we should do now,” Rubio said, cautiously, “the one thing I think everyone can agree upon is that the people of Ukraine are inspiring to the world.” He cited the clip of the Ukrainians defending Snake Island against a Russian warship who said, when threatened, “Russian warship, go fuck yourself.” All were killed.",
    "Josh Hawley, for example, used his speech to announce that when the Senate returned to session on Monday, he would “introduce legislation to open back up American energy production in this country 100 percent.”\nThe criticisms that Biden’s weakness created an opening for Putin to make his move weren’t just grounded in descriptions of lackluster economic and military deterrence, though.",
    "While Americans are encouraged to “learn some silly dance or to do something that’s completely mindless and meaningless” to go viral, China is encouraging its young people to go viral by “building something incredible through STEM, or through engineering, or being able to go out and speak incredibly fluently and well, or having great patriotic and masculine values,” he said.",
    "“I’m more worried about how the cartels are deliberately trying to infiltrate our country than a dispute 5,000 miles away, cities we can’t pronounce, places that most Americans can’t find on a map.”\nHe clarified that he wasn’t defending the “actions of dictators halfway across the world.” But?",
    "Ron DeSantis, addressing a crowd at the Conservative Political Action Conference in his home state Friday afternoon, observed that people are “chafing under authoritarian rule around the world.” It was the day after Russian President Vladimir Putin had ordered an invasion of Ukraine.",
    "But the onset of the most aggressive test of the West since the end of the Cold War—something that, under previous incarnations of the conservative movement, would have been the issue around which CPAC was organized—has been a back burner issue.",
    "The message, then, is that what Russia is doing to Ukraine is no big deal—or that what China may do next to Taiwan is no big surprise—given the cultural damage the left has done to America and other major Western countries.",
    "Scott Walker said, “and what you’re seeing around the world.”\nWalker was on a panel with North Carolina Rep. Madison Cawthorn, who explained how China is using TikTok to make Americans look like a bunch of nincompoops.",
    "“And I think they understand what the stakes are, and they look to us [for] what protecting freedom means.”\nThe speakers at CPAC, the annual megaconference of conservatives, have not gone full Tucker Carlson.",
    "Thank you for standing up for us.”\nThe evidence was clear: The entire West, under the jackboot of “woke” speech codes and mask and vaccine mandates, was looking to the “free state of Florida” for liberation.",
    "Vance, who previously said he didn’t “really care what happens to Ukraine one way or another,” insisted that he did care, and furthermore, what was happening there was elites’ fault.",
    "He’s issued statement after statement against Russian aggression, and was more than game to discuss the matter with reporters at the conference.",
    "He is not a Putin admirer, and has made sanctions against the Nord Stream 2 pipeline his signature policy issue in Congress over the last year.",
    "And the threat to Ukraine’s freedom is a secondary issue compared with the threat conservatives feel toward their own freedom.",
    "“And he said, ‘There isn’t much hope right now here, and many of us are fearful of what our leaders have in store for us.",
    "“I recently got a letter from Samuel from Australia,” DeSantis said, referring by first name to a fan from Down Under.",
    "But Cruz is well attuned to what a roomful of devoted right-wingers want to hear, and what’s going to fall flat.",
    "“The U.S. Southern border matters a lot more than the Ukrainian border,” Kirk told the crowd Thursday morning.",
    "The motivating concerns, instead, are with the perceived creeping tyranny afflicting the free world.",
    "That weakness, as some speakers explained, is itself a symptom of the American cultural softness.",
    "“Woke weakness leads to things like we’re seeing in the White House,” former Wisconsin Gov.",
    "More and more speakers spoke to the horror of “Russian aggression” and to pray for Ukraine.",
    "Tucker Carlson began backpedaling from his defense of Putin on his Thursday night show.",
    "And in his speech Thursday afternoon, Cruz didn’t say a single word about the war.",
    "DeSantis’ example of authoritarianism on the march, however, was about Australia.",
    "I look to you, and your great state of Florida, for hope during this dark time.",
    "They’re not expressing sympathy for Putin or celebrating his lust for conquest.",
    "“Canadians are writing in, Australia, Europe, you name it,” DeSantis said.",
    "There was an appreciation, specifically, for Ukraine’s courageous defense.",
    "This was reflected in the larger conservative mediasphere as well.",
    "Those were the patriotic, masculine values CPAC could respect.",
    "Consider Texas Sen. Ted Cruz.",
    "Ohio Senate candidate J.D.",
    "(With occasional lapses.)",
    "ORLANDO, Florida—Gov."
  ]
}