{
  "id": 453,
  "mediaId": 2742,
  "date": "2022-04-10",
  "headline": "Ohio GOP Hopefuls Vance, Mandel, Gibbons Show Different Ways To Handle The “Racist” Smear",
  "image": "https://vdare.com/public_upload/publication/featured_image/57329/VDARE-vance.jpg",
  "link": "https://vdare.com/articles/ohio-gop-hopefuls-vance-mandel-gibbons-show-different-ways-to-handle-the-racist-smear",
  "mediaOutlet": "VDARE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1268,
    1804,
    2131,
    2201,
    2917,
    3242,
    3466,
    764
  ],
  "sentences": [
    "disparaging desperate immigrants as “dirty” drug traffickers threatening to overrun Ohio, dismissing critical race theory as “crap” parents don’t want in their schools, defending a white supremacist banned from Twitter for inciting violence and, of course, discounting life-saving measures during a surging pandemic as nefarious “efforts to control our lives.”\n[Candidate version of J.D.",
    "Twitter temporarily suspended Mandel’s account last year after he tweeted a poll that asked followers if more crimes will be committed by “Mexican Gangbangers” or “Muslim Terrorists” coming across the border [Twitter Temporarily Restricts Ohio Politician Josh Mandel's Account for Breaking 'Hateful Conduct' Rules, by Allison Babka, City Beat, March 19, 2021].",
    "And then right below them was basically everybody in China, India and, you know, throughout the Asian countries.”\n[Republican in Ohio Senate Primary Spoke Offensively About Asians, by Blake Hounshell and Leah Askarinam, March 15, 2022]\nAsian classmates in graduate school, he added, had trouble with critical thinking and stuck to the formulaic.",
    "In his new ad on Critical Race Theory, Mandel walks across Selma, Alabama’s Edmund Pettus Bridge and declares: “Martin Luther King marched right here so skin color wouldn’t matter.” Mandel then adds: “I didn’t do two tours in Anbar province, fighting alongside soldiers of every color, to come home to be called a racist.",
    "“I’ve often thought that when I’ve run into Asians, they’re all — you know, if you’ve ever read ‘The Bell Curve,’ it’s a book, a very controversial book, I can’t even remember who wrote, I think his name is Murray wrote this book.”\n“And it said that the smartest people in the world as far as measurable I.Q.",
    "Writing in the Ohio Capitol Journal, Leftist scribe Marilou Johanek called the new Vance an “alt right grievance peddler.”\nThis character jumped right into the smarmy attack mode of the extreme right, owning the “degenerate leftists,” deriding the “party of childless people,” (what??)",
    "Vance (@JDVance1) April 5, 2022\nUnsurprisingly, that response, one of the best to unhinged attacks from the Left, drew more accusations from the media [JD Vance accused of racism over new campaign ad, by Gustaf Kilander, The Independent, April 6, 2022].",
    "But instead talking about how much he loves Martin Luther King or showing off his mixed-race family (his wife is Indian), Vance makes a broader point about how the Left uses the smear to suppress regular Americans and silence debate about immigration.",
    "“Mike was discussing the difference in educational structure and attainment that he experienced in both business and graduate school in relation to China,” a spokesman for the campaign matter-of-factly told NYT’s Hounshell and Askarinam.",
    "“Defining an entire continent of billions of individuals by a singular characteristic is the definition of racism,” said California Rep. Judy Chu [Tweet her], chairwoman of the Congressional Asian Pacific American Caucus.",
    "But how Vance, and two of his opponents—Josh Mandel and Mike Gibbons—have handled the ridiculous accusation explains much about the current state of the GOP, and shows how not to respond; i.e., with a groveling apology.",
    "He hopes the immigration issue will give his campaign a boost ahead of the May 3 primary election date [JD Vance bets Ohio GOP Senate bid on illegal immigration, by David Drucker, Washington Examiner, April 8, 2022].",
    "“Stop AAPI Hate” [Tweet them] said the comments were “part of the dehumanizing rhetoric around AAPIs that has contributed to the surge in racism that harms us today.”\nTo his credit, Gibbons didn’t apologize.",
    "Maybe it would’ve been better for Mandel to just laugh off the accusations [MLK's Daughter Schools Senate Candidate Josh Mandel on Her Father's Legacy, by Jake Thomas, Newsweek, April 5, 2022].",
    "Rather than reframe the accusations to point out that they’re designed to silence dissent, Mandel appeals to Leftist tropes to prove his colorblind, equalitarian bona fides.",
    "Despite condemning Donald Trump as a bigot in 2016, the best-selling Hillbilly Elegy author has turned into a full-fledged immigration patriot to run for office in 2022.",
    "By adopting the usual “I-Love-MLK” reply, cooked up by Conservatism Inc.’s crack sales team, Mandel implicitly accepts that “racist” is a credible accusation.",
    "The Vance option makes the most sense if the candidate wants to get attention and attract sympathizers, while aggravating Leftist journalists.",
    "But he also understands that the Leftist Mainstream Media will smear anyone who discusses it, and why firing back is the best counterattack.",
    "Drugs nearly killed his mother, a sad chapter in his life depicted in stark, searing honesty in the film based on his best-selling memoir.",
    "Vance using same dog whistles he once derided as a ‘moral disaster,’ August 18, 2021]\nVance sees this vitriol every day on social media.",
    "The New York Times discovered that he dared to discuss The Bell Curve to explain group differences in intelligence on a 2013 podcast.",
    "There’s nothing racist about stopping Critical Race Theory and loving America.” The ad features pictures of him with black soldiers.",
    "MLK’s daughter attacked him over it, which led the Senate candidate to say she doesn’t know what the real MLK would’ve thought.",
    "Vance argues that the Leftist media smears ordinary Americans patriots for wanting a wall and sensible controls on immigration.",
    "Mandel is solid on illegal immigration—a topic he regularly discusses—and supports mass deportation rather than Amnesty.",
    "To summarize, a candidate can handle the racism charge three ways: 1) He can turn it on its head, like Vance.",
    "Vance supports reducing legal immigration and cracking down on the incentives that drive illegal immigration.",
    "The ad was meant to gain attention and demonstrate he’s on the side of Trump voters who oppose Open Borders.",
    "“Equality.”\nOf course, the unintentionally hilarious ad has done nothing to appease the Leftist Smear Bund.",
    "Vance adds a personal note by highlighting the devastating toll drugs from Mexico have on rural America.",
    "Gibbons leads the RealClearPolitics poll average, with Mandel close behind and Vance a distant third.",
    "It persuaded none of his critics, reaffirmed Leftist narratives, and made him look like a goofball.",
    "That’s an odd opening, but it’s one of the sharpest political statements yet seen in the 2022 race.",
    "He also opposes tech censorship and criticized the bans of Nick Fuentes and other Wrong Thinkers.",
    "Like his rival’s, Mandel’s immigration position has invited the same accusation: You’re a racist.",
    "The other two only discuss illegal immigration, while Vance hits legal and illegal immigration.",
    "Treason Lobbyists have repeatedly called Vance a racist, as have some of his primary opponents.",
    "Businessman Mike Gibbons, the race’s frontrunner, also faced racism accusations last month.",
    "Vance is a racist, Leftists say, because he opposes Open Borders and mass immigration.",
    "He fearlessly discusses the problems with immigration and how we should address them.",
    "One primary rival, former Ohio Treasurer Josh Mandel, took a different approach.",
    "If dismissing them doesn’t put out the fire, it certainly dampens the flames.",
    "2) He can appeal to Martin Luther King and his black friends, like Mandel.",
    "Asian leaders and grievance groups denounced him as racist, of course.",
    "In other words, he’s far better than the usual Stupid Party candidate.",
    "Even if he doesn’t win, fighters like Vance are what the party needs.",
    "Gibbons ignored the controversy and it died out after a few days.",
    "Lesson: Apologies only inflame the accusations and invite more.",
    "Washington Watcher II [Email him] is an anonymous DC insider.",
    "Vance has suffered primarily from his past attacks on Trump.",
    "He loves MLK, the Civil Rights movement, and black Marines.",
    "This is the customary tactic of terrified conservatives.",
    "But, unlike Vance, he never addresses legal immigration.",
    "Vance’s sober, fact-based arguments aim not to offend.",
    "“Are you a racist?” Ohio Senate primary candidate J.D.",
    "The ad even led to an embarrassing moment for Mandel.",
    "Yet look at how Mandel answered his Leftist critics.",
    "But this too invited deranged attacks from the Left.",
    "Mandel loves bombastic rhetoric and giving offense.",
    "It was not intended to placate his Leftist critics.",
    "Gibbons’ tactic is the best way to kill the story.",
    "But not every candidate has Vance’s mettle.",
    "The title of this hymn to racial harmony?",
    "Or, 3) He can ignore it, like Gibbons.",
    "The worst choice is clearly Mandel’s.",
    "Vance asks in his latest campaign ad.",
    "The two have very different styles.",
    "Vance is the best on immigration.",
    "Take note, Republicans.",
    "How could he be racist?",
    "Vance was unperturbed.",
    "Mission accomplished.",
    "were Ashkenazi Jews.",
    "And that was that.",
    "— J.D."
  ]
}