{
  "id": 4565,
  "mediaId": 2641,
  "date": "2022-02-20",
  "headline": "JD Vance to Biden: I 'Don't Really Care' About Ukraine's Border, Protect Ours",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=9ffc509a-7b96-42b5-b943-d0ddf9bba351&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/jdvance-southernborder-ohio-senate/2022/02/20/id/1057629/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Mack",
  "authorUrl": "",
  "termIds": [
    1804,
    3466,
    3500,
    3709,
    3975,
    1166,
    1171,
    5212,
    5287,
    5366
  ],
  "sentences": [
    "A Marine Corps veteran running for Senate in Ohio's GOP primary does not \"really care what happens to Ukraine\" and is \"sick\" of President Joe Biden focusing on defending Ukraine's border and not our own.",
    "Vance lamented the Biden administration's State Department is trumpeting Russia's stance on \"transgender rights\" as \"a major problem with Russia\" and a reason to oppose Putin's aggressions in Ukraine.",
    "Ohio is traditionally a bellwether state in presidential elections and Trump won the state by more than 8 points in 2020, despite losing to President Joe Biden in the Electoral College.",
    "\"I do care about the fact that, in my community right now, the leading cause of death among 18- to 45-year-olds is Mexican fentanyl that's coming across the southern border.",
    "Vance, author of \"Hillbilly Elegy: A Memoir of a Family and Culture in Crisis,\" is one of the GOP primary's top candidates for Ohio's Senate seat in the 2022 midterms.",
    "\"I'm sick of Joe Biden focusing on the border of a country I don't care about while he lets the border of his own country become a total war zone.\"",
    "\"At the end of the day, we served to defend our own country, and I think it’s ridiculous that we’re focused on this border in Ukraine,\" Vance said.",
    "Vance told host Steve Bannon he signed up for the Marines in 2003 to protect America and not \"to go and fight Vladimir Putin.\"",
    "Josh Mandel is leading by a handful of points, while Vance has been a second or third choice, according to RealClearPolitics.",
    "\"I've got to be honest with you, I don't really care what happens to Ukraine one way or another,\" GOP Senate candidate J.D.",
    "Vance told Saturday's \"War Room\"."
  ]
}