{
  "id": 4566,
  "mediaId": 2658,
  "date": "2022-02-23",
  "headline": "Tucker Carlson Goes It Alone on Putin",
  "image": "https://static.politico.com/f6/8b/f38812e5485497ab28ea4823a7ca/mag-50752283491-b64b6c1d95-o-1.jpg",
  "link": "https://www.politico.com/news/magazine/2022/02/23/tucker-carlson-goes-it-alone-putin-00011141",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1328,
    2923,
    3095,
    3313,
    3709,
    3975,
    4608,
    684,
    5366,
    5393
  ],
  "sentences": [
    "The pasteurization goes on, as Carlson claims Ukraine is not worth standing up for because it’s not, in his opinion, a democracy, and he literally reduces President Joe Biden’s position to “Putin bad, war good.”\nWhile Carlson deserves points for having an original point of view on Ukraine, his originality has not produced much in the way of imitators.",
    "It might be wise for us to keep out of the “border dispute” and let Russia make a 24-province meal of Ukraine — or Lithuania, Latvia, Estonia or any of the other former chattel states of the Soviet Union that might stir Putin’s appetite — because Putin never did anything bad to Carlson or to you.",
    "As Vladimir Putin commenced his slow-walking invasion of Ukraine under the guise of recognizing the “independence“ of Donetsk and Luhansk, only one major media commentator provided intellectual cover for the Russian leader’s adventure: Fox News Channel’s preeminent star, Tucker Carlson.",
    "As my POLITICO colleagues reported today, the Republican Party has yet to unify around one Ukraine position, but most have lined up with South Carolina Republican Sen. Lindsey Graham, with only Missouri Republican Sen. Josh Hawley and Ohio Senate candidate J.D.",
    "In the civilized world, aggrieved nations usually present their border disputes before the United Nations for relief and adjudication and don’t surround their dispute partners with more than 150,000 well-armed troops.",
    "Most high-profile conservative outlets, such as the National Review, the Dispatch, Commentary, the Washington Examiner, George F. Will and Washington Times have failed to second Carlson’s affection for Putin.",
    "When Carlson catches flak from the Washington Post or Insider for mouthing Putin talking points — as he did this morning — he probably views it as confirmation of the rightness of his anti-anti-Putinism.",
    "Donald Trump, a Putinphile of longstanding, the nominal leader of the Republican Party, and usually the biggest mouth on any hot news topic has offered only subdued commentaries, compared to Carlson.",
    "Carlson’s performance prompted Bulwark writer William Saletan to compare him today to Father Charles Coughlin, the radio demagogue who vilified Jews and defended Adolf Hitler before World War II.",
    "It almost suggests a return to politics-as-normal with the right-wing media returning to its hawkish pre-Trump roots, aided by an eagerness to slam a Democratic president.",
    "In a podcast released Tuesday, Trump did engage in some predictable praise of Putin but as always his response seemed mostly rooted in his fury over his loss to Biden.",
    "A third speaker, Carlson regular Victor Davis Hanson of the Hoover Institution, gave a 500-word monologue on the conflict that was neither pro-Putin nor anti-Putin.",
    "With this single head-juke, Carlson pasteurizes the abscessing conflict to the point that you could pour it down the gullet of a newborn with no ill effect.",
    "The general unanimity expressed on the program made Putin’s own Monday meeting with his pliant security council look like a riotous debate in comparison.",
    "Gabbard agreed completely with him, as did commentator Candace Owens in another segment, and she sprayed her enthusiastic dittos into the ether.",
    "The closest he came last night to exposing his ideas to outside scrutiny was enlisting former Hawaii Democratic Rep. Tulsi Gabbard in chitchat.",
    "As Carlson continued, the Putin-haters hate Putin because of the “border dispute” he has going “with a nation called Ukraine.” Border dispute?!",
    "But finding him innocent of charges that nobody has leveled against him is an asinine way of demonstrating his guiltlessness.",
    "| Gage Skidmore/Flickr\nOpinion by Jack Shafer\n 02/23/2022 06:18 PM EST\nJack Shafer is Politico’s senior media writer.",
    "Like Coughlin, Carlson has little interest in engaging the outside world or persuading outsiders of his correctness.",
    "In his Tuesday evening broadcast, Carlson didn’t strike a pro-Putin pose as much as an anti-anti-Putin one.",
    "Sure, Putin has avoided doing a lot of naughty and retrograde things other people and nations have done.",
    "Carlson’s show, the biggest on Fox, doesn’t need to convert or enlist new viewers to remain successful.",
    "Everybody should sample the program every couple of weeks if only to marvel at Carlson’s demagoguery.",
    "Fox News and OAN appear to be doing more monitoring of the clash than Carlson-style editorializing.",
    "They largely support Ukraine while damning Biden for not having done more to nullify the crisis.",
    "Never taught his children critical race theory or made fentanyl or attacked Christianity.",
    "Putin, Carlson explained, has never done him — and by extension — the viewer, any wrong.",
    "Like Trump, he depends on his base, and that lets him say almost anything he desires.",
    "My email alerts admired Carlson’s work as a print journalist at the Weekly Standard.",
    "Tucker Carlson speaks at the 2020 Student Action Summit in West Palm Beach, Florida.",
    "My Twitter feed digs this Father Coughlin appearance on The March of Time newsreel.",
    "******\nFox should give Barry Manilow a show to test the soundness of the concept.",
    "He’s speaking for the “common man,” the citizen-victims who never catch a break.",
    "It was a weird tack for Carlson, who is much smarter than this, to take.",
    "Like a Barry Manilow concert, the show is designed for fans only.",
    "My RSS feed wishes Carlson would come back to the magazine raft.",
    "So why does the Washington, D.C. establishment hate him so much?",
    "Vance adopting anything close to Carlson’s Putin stance.",
    "I’ve never beaten a kitten to death with my bare hands.",
    "Nor did it address the host’s don’t-hate-Putin opener.",
    "As a personal assessment, this is pretty strong meat.",
    "Send programming ideas to Shafer.Politico@gmail.com.",
    "Never manufactured a lockdown-inducing pandemic.",
    "But don’t blame yourself if you tune it out.",
    "But Carlson never really tests his thesis.",
    "But it does hold up on several levels.",
    "Putin’s never called Carlson racist.",
    "Does virtuousness come with that?",
    "Threatened to have him sacked.",
    "Now, Carlson might be right."
  ]
}