{
  "id": 462,
  "mediaId": 2752,
  "date": "2022-04-18",
  "headline": "Trump Pretty Sure J.D. Vance F*ckable Enough To Endorse",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTM5MDEyMC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY2NzkwMjgwNH0.DggbgAp-9bwPr5AJseNCkFQKV-FH6504D2aGp5Xc8qo/img.png?width=1200&coordinates=0%2C24%2C0%2C24&height=600",
  "link": "https://www.wonkette.com/trump-pretty-sure-j-d-vance-f-kable-enough-to-endorse",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    0
  ],
  "sentences": [
    "After all, pollster Tony Fabrizio found that what’s “driving [Vance’s] negatives is the perception that he is anti-Trump.” His study revealed that Vance’s campaign was “underwater with strong Trump” supporters “and very conservative voters, groups needed to win a GOP primary.”\nThe Club for Growth, which backs Mandel, has aired TV ads reminding voters of Vance’s previous anti-Trump rhetoric.",
    "Trump famously called Mandel a “charisma-free weirdo and dork.”\nLast week, when it looked like Trump was close to a decision, Mandel’s campaign desperately circulated a memo to top Republicans arguing that Trump’s endorsement wouldn’t save Vance’s candidacy.",
    "Vance has also spent the bulk of his candidacy groveling and apologizing for having once spoke heresies about the mad MAGA king: He’d called Trump an “idiot” and “offensive,” but in fairness, that was when Trump was Candidate Idiot and not President Idiot.",
    "I look forward to earning his endorsement in the general election and working with him to defeat Tim Ryan in November.”\nBoth Vance and Mandel would stand out as a terrible senator in a freshman class that could include Herschel Walker and Dr. Oz.",
    "“This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race — they’ve said great things about ‘Trump’ and, like me, they love Ohio and love our country,” Trump said in a statement.",
    "Vance may have said some not so great things about me in the past,” Trump said in his statement, “but he gets it now, and I have seen that in spades.”\nIn other words, Trump took Vance’s pride for a ride and he let him.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent — dangerous because they will have so much money to spend,” Trump added, referring to the expected Democratic nominee, Rep. Tim Ryan.",
    "Some prominent Vance supporters also lobbied Trump on his behalf, including Tucker Carlson, Charlie Kirk, GOP Senator Josh Hawley, and Donald Trump Jr., whose calls Trump apparently takes on occasion.",
    "But Trump can counter that, we guess, with speeches at sparsely attended rallies where he whines the whole time about the 2020 election and briefly mentions the candidate he’s endorsed.",
    "He traveled to the mothership Mar-A-Lago with some other contenders in March for an “Apprentice” style boardroom spectacle where the craven candidates “auditioned” for Trump’s favor.",
    "While she can rant with the best of them about inflation, illegal immigration, and the “indoctrination of our children,” she might have a shred of human dignity left, though.",
    "Donald Trump has finally decided which asshole to endorse in the Ohio Senate race, and it’s not Josh Mandel, who almost beat up an old man at last month’s GOP debate.",
    "Considering Trump’s massive ego, that was probably a dumb move, but Mandel’s the same asshole who whitesplained Dr. Martin Luther King Jr. to his own daughter.",
    "Vance has yet to lead a single poll in this race, and he experienced no measurable bump after MAGA herald Marjorie Taylor Greene endorsed him in January.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Once the endorsement was official, Mandel tweeted pathetically, \"I continue to be a proud supporter of President Trump and the America First agenda.",
    "That was certainly an asshole move, but ultimately, Mandel just couldn’t compare to Hillbilly Elegy author and Twitter troll J.D.",
    "Vance’s own internal polls revealed that no one likes him and this condition only exacerbates once people get to know him.",
    "Trump is reportedly impressed with how “good\" Vance looks on TV, even though the guy is a giant pimple with a beard.",
    "He’d considered endorsing former Ohio GOP Chair Jane Timken, who has the support of retiring Senator Rob Portman.",
    "Trump didn’t like that she defended Republican Rep. Anthony Gonzalez, who voted to impeach him in 2021.",
    "Vance, however, has adequately convinced Trump that he lacks even a single scruple.",
    "He does present as slightly more human than Mandel, but that’s not saying much.",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "This should prove a true test of Trump’s king-making prowess.",
    "He's also on the board of the Portland Playhouse theatre.",
    "Maybe Trump’s endorsement could change all this.",
    "“I’ve studied this race closely and I think J.D.",
    "His son describes him as a “play typer guy.\"",
    "Please click the clickie, if you are able.",
    "Vance worked hard for this endorsement.",
    "How much is America supposed to suffer?",
    "Let’s hope neither wins the primary.",
    "How often would you like to donate?",
    "He writes reviews for the A.V.",
    "“Like some others, J.D.",
    "That's you!",
    "Vance."
  ]
}