{
  "id": 4776,
  "mediaId": 2752,
  "date": "2022-02-24",
  "headline": "Four Idiots Pretty Sure Greta Thunberg Made Putin Invade Ukraine",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTQxODE3MC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3MDgwMjM2NX0.1_nBt1KULAkidrZsKaPx6ZrbvAR6HapMu8rJ1FuhSEg/img.jpg?width=1200&coordinates=0%2C0%2C0%2C28&height=600",
  "link": "https://www.wonkette.com/environmentalists-to-blame-for-russia-ukraine",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Evan Hurst",
  "authorUrl": "https://www.wonkette.com/u/evan_hurst",
  "termIds": [
    0
  ],
  "sentences": [
    "Even as it's absolutely clear because Putin has been saying it out loud for years that this is happening because Putin wants to be remembered as the modern tsar who put the empire back together, these sage dipshits are saying it's happening because \"environmentalists\" and \"Greta Thunberg\" and uhhhhh whatever South Dakota GOP Gov.",
    "In an excellent piece that aptly compares Tucker Carlson to Father Coughlin, The Bulwark notes that Tucker, on top of his shilling for the Kremlin, found some time this week to introduce some conspiracy theories about maybe American only supports Ukraine because Joe Biden and his Democratic pals want expensive energy prices.",
    "in [an] interview with former Rep. Tulsi Gabbard, Carlson promoted the slander—often featured in Russian state propaganda—that when American politicians talk about defending freedom or democracy, they’re really just serving their own commercial interests.",
    "Kristi Noem is saying right here:\nJoe Biden stopped the Keystone Pipeline, which awoke in Vladimir Putin an ancient desire to stick his dick into Eurasia and steal all the land he thinks rightfully belong to mother Russia.",
    "A lot of voices on Fox News are desperately trying to rewrite history and convince us Donald Trump was the one who was tough on Russia — as if he didn't contradict them on that loudly and clearly this week.",
    "In the interview with Gabbard, Carlson nodded along—“Right,” he interjected—as Gabbard accused the American “power elite” of betraying both “the American people” and “the Russian people.”\nYikes, just yikes.",
    "Knowing that the wind doesn’t always blow and the sun doesn’t always shine, the rest of the world thought they could rely on Russia for relatively cheap oil and natural gas to fill the gaps.",
    "As we've been watching this unfold over the last week, it's been interesting to chronicle the bizarre fake reasons Republicans and other Trump idiots have been giving for what is happening.",
    "“One of the reasons why Vladimir Putin is able to do this in the first place — one of the reasons why he feels emboldened is because of a set of energy policies that Joe Biden put forward.",
    "He offered two explanations for the U.S. government’s support of Ukraine: corrupt financial ties between Ukraine and President Joe Biden and a secret plot to drive up energy prices.",
    "We are sure we'll delve into these and many more rightwing and pro-Kremlin conspiracy theories in the coming days, because we're going to be covering this for a long time, kids.",
    "“Maybe expensive energy would be good for the many renewable deals their friends and donors are invested in,” he speculated—the “they” referring to Biden and other Democrats.",
    "But there are other genres of bullshit forming, and one we've noticed in the past 24 hours is that this is apparently all happening in some way because \"environmentalists.\"",
    "Environmentalists pushed the U.S. and Europe to drastically cut their carbon footprint by divesting in fossil fuels and heavily relying on solar and wind power.",
    "The more we worry about the carbon footprint of our military instead of its capability to kill the bad guys, the better it is for Russia and China.",
    "Speaking of mental wonder wizards, here is Erick Erickson, explaining that this happened because \"environmentalists are oftentimes the bad guys.\"",
    "According to MSNBC, Vladimir Putin gave the order at about 3 a.m. his time, and surprise, the attacks went straight for the capital of Kyiv.",
    "Could it be that Greta Thunberg and Leonardo DiCaprio actually might be to blame for what Vladimir Putin is doing?",
    "Guess it's a good thing Europe is right now about to unveil a strategy to get off Russian energy for good.",
    "[Erick Erickson / JoeMyGod / The Bulwark]\nWonkette is funded ENTIRELY by a few thousand people like you.",
    "Thanks to this dependency, Russia officially holds all of the cards as they move to take over Ukraine.",
    "“Cheap oil is a deterrent from tyrannical Third World dictators from invading other countries.",
    "So much for this being about \"peacekeeping\" or \"NATO\" or \"breakaway territories.\"",
    "If you're not already, would you pls consider being the few thousandth and one?",
    "The news chyrons say \"Russia invades Ukraine,\" and that's what has happened.",
    "Speaking of carbon footprints, is this ... is it all Greta Thunberg's fault?",
    "“That’s a take you will not hear anywhere else.”\nYeah, we reckon.",
    "These takes all came right before the big huge invasion started.",
    "Let’s be honest, environmentalists are oftentimes the bad guys.",
    "Vance, are just doing straight-up pro-Russian propaganda.",
    "Others, like Tucker Carlson, Tulsi Gabbard and J.D.",
    "The situation in Ukraine is the perfect example.",
    "That is what Charlie Kirk is just asking.",
    "The bad thing has happened.",
    "The big one has happened.",
    "Dammit, Greta Thunberg!",
    "Stay in school, kids.",
    "Sure why not.",
    "Make sense?",
    "OK."
  ]
}