{
  "id": 4837,
  "mediaId": 2512,
  "date": "2022-02-20",
  "headline": "How Putin built the ideological template for the GOP",
  "image": "https://www.alternet.org/media-library/image.jpg?id=26728912&width=1200&coordinates=0%2C75%2C0%2C75&height=600",
  "link": "https://www.alternet.org/2022/02/putin-2656748326/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Lofgren",
  "authorUrl": "https://www.alternet.org/author/mike-lofgren",
  "termIds": [
    1587,
    1814,
    2201,
    3222,
    3267,
    3434,
    3709,
    878,
    5287,
    5371
  ],
  "sentences": [
    "Corey Robin, in The Reactionary Mind, talks of the Right’s “narrative of loss and promised restoration.” This is true of Putin, the KGB colonel who saw the Soviet empire collapse and called its demise “the greatest geopolitical catastrophe of the century.” The threats over Ukraine are a consequence of this attitude.",
    "It is enough that their party tells them they are salt-of-the-earth Americans and harasses groups they don’t like: all very much like Russian citizens who vote for Putin’s Russia United Party and despise Alexei Navalny for the unpatriotic crime of promising to prevent the oligarchs from ripping them off.",
    "Since the Tea Party hysteria of around 2010 at the latest, the GOP has ceased offering policies (beyond the very narrow one of protecting the finances of America’s own oligarchs) and is now solely dedicated to obstruction, publicity stunts, trolling, and clawing into power and staying there forever.",
    "Although one can find several examples Republican-connected groups, like the Religious Right or the NRA, eagerly becoming fellow travelers of the Kremlin, the affinities are mostly unconscious and demonstrate a decades-long convergent evolution of beliefs within the GOP and ruling circles in Russia.",
    "Even if the Kremlin directly influenced a few screwballs like Dana Rohrabacher and a handful of party operatives, why is this behavior deeply embedded in so many Republicans, to the point where it is now quite popular in the conservative media-entertainment complex ?",
    "Just as pointing out unpleasant truths about the Nazi-Soviet Pact gets you prosecuted in Russia, GOP legislators now want to make it illegal for any teacher to \"teach or incorporate into any course or class any 'divisive concept.'\"",
    "Their “policies” are a catalogue of complaints, publicity-seeking, and trolling on issues like COVID, vaccines or abortion, signaling the base, and obstruction (or effective prohibition) of any political opposition.",
    "An outbreak in self-government to benefit the people in any one country might threaten the others by example\nThey have a common destiny: they will succeed as long as the people of their countries are made to fail.",
    "One could go on with these comparisons: the false machismo of the Russian leader posing bare-chested like Mussolini, playing hockey games with professional teams who obligingly let him pile up goals, and so on.",
    "If we substitute the oligarchs for the nomenklatura, polonium 210 for ice picks, and military threats against Ukraine for the Ukrainian famine, we find that Russia is much like the old Soviet Union.",
    "Weirdly, the reaction of GOP politicians to their own constituents’ die-off is to double down on what is killing them, as we have seen with Florida’s Ron DeSantis and South Dakota’s Kristi Noem.",
    "Most of its population loss since the beginning of the pandemic is suspected to be considerably underreported COVID deaths on top of the traditional deaths by suicide, misadventure, and vodka.",
    "In my state of Virginia, the first act of the new governor, whose electoral stronghold is the rural parts of the Commonwealth, was to ban urban northern Virginia’s mask and vaccine mandates.",
    "That the bill illustrates what should be taught by citing the debate between Abraham Lincoln and Frederick Douglass when Lincoln’s opponent was Stephen Douglas only adds to the surrealism.",
    "The media also plays its role: they would rather cover him like an ESPN announcer extolling Tom Brady than filling airtime with colorless androids like Mitch McConnell or Kevin McCarthy.",
    "Demographics explain why, despite the machismo and the fascination with dominance, the deeper note is one of bleating victimhood among Putin and his followers, and the GOP and its base.",
    "Vance running for US Senate in Ohio, or the intentional crudeness of politicians who claim to speak for the trailer parks while groveling to their donors at $1500-a-plate fundraisers.",
    "In the same manner, Republicans whitewash bloody insurrection on behalf of slavery as being about “heritage,” and seek to preserve statues honoring slaveholders and traitors.",
    "Despite their endless bellicosity, leaders like Putin, Trump, Jair Bolsonaro, or Viktor Orban are rarely bellicose towards one another; they usually get along famously.",
    "In like fashion, The Republican Party is in a protracted war with the empirical reality, leaving only endless conspiratorial possibilities known as alternative facts.",
    "Calling out these actions merely elicits denials, accusations that the targets of the attacks did it to themselves, and cries of being an innocent victim of smears.",
    "This play-acting dovetails with the tough-guy affectation of Republican politicians: the supposed hillbilly cred of a Yale graduate and Wall Streeter named J.D.",
    "Once upon a time, the Republican Party actually enacted policies – damaging they may have been, but at least they were policies in traditional political terms.",
    "Putin uses his tame courts to disqualify inconvenient candidates like Navalny; in America, the GOP prevents supporters for opposition candidates from voting.",
    "This strongly resembles Trump’s whining assertion of injustice: \"We don't want other leaders and other countries laughing at us anymore, and they won't be.\"",
    "His action did nothing to help the former mining towns of southwest Virginia that voted for him, but it was a thumb in the eye of the godless city folk.",
    "Who controls the present controls the past.” Putin has rehabilitated Stalin as a great patriot, and those who document Stalin’s crimes are persecuted.",
    "It is therefore instructive to cut out the middleman, or stooge, and focus on the prime mover when considering the GOP’s ideological inspiration.",
    "Despite losing the last election by seven million votes, it is conventional wisdom that Donald Trump remains the leader of the Republican Party.",
    "The development of the Russian Federation from the rubble of the USSR has mostly been a case of the new boss being the same as the old boss.",
    "The 2020 census shows the trend has accelerated, with 90 percent of US counties that lost population in the last decade supporting Trump.",
    "Such laws as it enacts in the states bear no relation to solving any public problem, be it health, safety, transportation, or education.",
    "In case the election result still might be too close, the Russian leader creates bogus candidates he controls to divide the opposition.",
    "True communism wasn’t there yet, but the Soviet people were working to achieve a state where there was no exploitation or alienation.",
    "His propaganda apparatus, as extensive as the USSR’s and more sophisticated, does not aim to make the world’s people into communists.",
    "They seek to rule polities that are socially or economically damaged, and to do that they attract aggrieved and nihilistic followers.",
    "Russia’s disinformation campaign against Western vaccines has backfired on its own population, making it mistrustful of vaccination.",
    "The country’s own vaccine, Sputnik, is only a little more effective than Republicans’ own cure-alls like horse de-wormer or Clorox.",
    "Just to look at how Putin and Trump interacted when they met speaks volumes about the body languages of dominance and supplication.",
    "This was mostly the result of outmigration due to the lack of good jobs, adequate health care, or educational opportunities.",
    "However miserable circumstances were, the USSR labored to represent itself as working towards a better future for humanity.",
    "The heart of the Republican base lives in counties that for many years have suffered population decline, such as in Iowa.",
    "among the white working class, a phenomenon that Anne Case and Angus Deaton discovered even before the COVID pandemic.",
    "The Kremlin’s current line is that Navalny is an agent of the West, or even poisoned himself to make Russia look bad.",
    "Airbrushing the facts extends to history books; as George Orwell said, “Who controls the past controls the future.",
    "It echoes Republicans’ claim that the January 6th insurrectionists were tourists, or FBI provocateurs, or antifa.",
    "Russia’s foreign policy seeks less to influence foreign audiences positively than simply to create chaos abroad.",
    "There was another, formidable, force putting its thumb on the scale in the 2016 election campaign on his behalf.",
    "In the past year, Russia experienced a population loss of nearly one million, following many years of decrease.",
    "The trend is further exacerbated by failure to take sensible social distancing precautions or get vaccinated.",
    "As for foreign reporting about actual conditions in Russia, they’re all just fake news from the lying media.",
    "They remain on top by continuing to inflame existing wounds as they steal everything that isn’t nailed down.",
    "The throngs who cheerfully vote GOP are not going to benefit materially from this – nor do they expect to.",
    "That force’s minions even built his pre-presidential business model, helping him out of bankruptcy.",
    "While it is occurring all over the country, it is most severe in rural states like West Virginia.",
    "It has often been noted that there is probably human chemistry among authoritarian personalities.",
    "Its population is now smaller than Bangladesh and its per capita income lower than the Maldives.",
    "We should bear in mind that it is occurring against a backdrop of sharp demographic decline.",
    "Under Putin, Russia is said to be a place where nothing is true and everything is possible.",
    "The GOP, like Putin and his United Russia Party, are both deeply authoritarian, but why?",
    "They have taken it to the point where we simply must tell them: ‘Stop!’” says Putin.",
    "The outmigration is now accompanied by “deaths of despair” (suicide, drugs, etc.)",
    "The shortcomings of today were the sacrifices necessary to reach utopia.",
    "At this point we should ask, where did these similarities come from?",
    "McCarthy distances himself from Trump by condemning Putin’s actions.",
    "Owsley County, KY, has a life expectancy similar to that of Russia.",
    "Hacking, online trolling, and ransomware are part of this strategy.",
    "Its enemies – Ukraine, the European Union – became trump’s enemies.",
    "Never mind that the protocols were already in effect and working.",
    "Rural Americans are dying at twice the rate of urban dwellers.",
    "Does this sound familiar in the context of domestic politics?",
    "There’s even an ex-KGB guy running the place: shades of 1982.",
    "But they also have a solid community of political interest.",
    "In America, there is the GOP’s manipulation of Kanye West.",
    "Trump did not achieve this status purely on his own merit.",
    "You’re no better, just more hypocritical,” is the theme.",
    "Male life expectancy is also below that of Bangladesh.",
    "Given prevailing global attitudes, it’s a wise move.",
    "The economy has also steadily dropped since 2014.",
    "Here’s why its already too late - Alternet.org ›",
    "Of course, we are talking about Vladimir Putin.",
    "The differences in technique are mere details.",
    "Partly this reflects the Republican base.",
    "Russia under Putin makes no such claims.",
    "But there is one crucial difference.",
    "It seeks to make them cynical.",
    "\"We have nowhere to retreat.",
    "Does this sound familiar?",
    "This parallels Russia.",
    "“You think we’re bad?"
  ]
}