{
  "id": 485,
  "mediaId": 2522,
  "date": "2022-04-16",
  "headline": "Bygones! Trump backs J.D. Vance, tells rally-goers ‘he’s said some not so great things about me’",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/04/SG-SG-Donald-Trump-J.D.-Vance-split.jpg",
  "link": "https://www.bizpacreview.com/2022/04/16/trump-backs-j-d-vance-tells-rally-goers-hes-said-some-not-so-great-things-about-me-1226506/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "https://www.bizpacreview.com/author/terresa-monroe-hamilton/",
  "termIds": [
    2201,
    2653,
    3016,
    3196,
    3466,
    1171,
    5212
  ],
  "sentences": [
    "The former president called Vance “strong on the Border,” “tough on Crime,” and willing to “hold China accountable.”\n“It is time for the entire MAGA movement, the greatest in the history of our Country, to unite behind J.D.’s campaign because, unlike so many other pretenders and wannabes, he will put America First,” Trump asserted.",
    "Now everyone needs to rally behind him and go on to a Republican victory in November\n— Ryan James Girdusky (@RyanGirdusky) April 15, 2022\nVance, a former US Marine, has stated that he regrets his previous comments about Trump.",
    "“And I ask folks not to judge me based on what I said in 2016, because I’ve been very open that I did say those critical things and I regret them, and I regret being wrong about the guy.",
    "The Democrats will be spending many millions of dollars, but the good news is that they have a defective candidate who ran for President and garnered exactly zero percent in the polls.",
    "Trump endorsed Dr. Mehmet Oz in Pennsylvania who has taken a number of non-conservative stances over the years involving the border, abortion, guns, and climate change.",
    "Vance (@JDVance1) April 15, 2022\nTrump acknowledged that endorsing Vance was not “easy.” He said he genuinely likes and respects other candidates in the crowded race.",
    "He was an incredible fighter for hard working Americans in the White House, he will be again, and I'll fight for the America First Agenda in the Senate.",
    "The bottom line is, we must have a Republican victory in Ohio,” Trump said, letting bygones be bygones in favor of securing a Republican win for Ohio.",
    "(@realchrisrufo) April 15, 2022\nThe endorsement is likely to anger a number of top Republicans in the state as well as many conservative voters.",
    "Trump chose Vance, who was a Never-Trumper in the beginning, over other candidates who have been loyal to the former president from the get-go.",
    "Vance on Friday in a statement that openly admitted the Ohio Senate candidate has said “some not so great things about me” in the past.",
    "I think he was a good president, I think he made a lot of good decisions for people, and I think he took a lot of flak.”\nCongrats, J.D.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent—dangerous because they will have so much money to spend.",
    "(Video Credit: WBNS 10TV)\nFormer President Donald Trump officially endorsed “Hillbilly Elegy” author and venture capitalist J.D.",
    "Vance has my Complete and Total Endorsement.”\nPresident Trump knows that JD Vance is the best candidate in the US senate race.",
    "Vance may have said some not-so-great things about me in the past, but he gets it now, and I have seen that in spades.",
    "will destroy him in the debates and will fight for the MAGA Movement in the Senate,” Trump’s statement contended.",
    "Vance once reportedly called Trump’s supporters “racists” and that hasn’t sat well with many in the red state.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "“In the Great State of Ohio, the candidate most qualified and ready to win in November is J.D.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "The endorsement came despite massive pushback from Republican leadership in the state.",
    "“Like a lot of people, I criticized Trump back in 2016,” he told Politico in 2021.",
    "He is our best chance for victory in what could be a very tough race.",
    "It also comes on the heels of another controversial endorsement.",
    "Vance,” Trump declared in an email announcing his endorsement.",
    "I'm incredibly honored to have President Trump's support.",
    "Vance is said to have voted for Evan McMullin in 2016.",
    "The public will not see it and we do not share it.",
    "It is all about winning!”\n“Like some others, J.D.",
    "“I’ve studied this race closely and I think J.D.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "https://t.co/s3d3JhTgBC\n— J.D.",
    "Rooting for your success.",
    "— Christopher F. Rufo ??",
    "“We cannot play games.",
    "“In other words, J.D.",
    "This is a big moment.",
    "However, J.D."
  ]
}