{
  "id": 4898,
  "mediaId": 2728,
  "date": "2022-02-24",
  "headline": "Russia conflict separates GOP traditionalists from newcomers",
  "image": "https://images.thestar.com/45oh4sbWvWw5TpQjxYxRCO-PAog=/1280x1024/smart/filters:cb(1645750007347)/https://www.thestar.com/content/dam/thestar/news/world/us/2022/02/24/russia-conflict-separates-gop-traditionalists-from-newcomers/20220224000212-6217144227af09575656f551jpeg.jpg",
  "link": "https://www.thestar.com/news/world/us/2022/02/24/russia-conflict-separates-gop-traditionalists-from-newcomers.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jill Colvin",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“It’s a very sad thing for the world, for the country, and it’s certainly very sad for a lot of people that are going to be needlessly killed.“\nIt was a departure from his initial public response to Putin’s escalation, in which he offered no clear condemnation and repeatedly praised the Russian leader’s savvy in an interview on “The Clay Travis & Buck Sexton Show.”\nCritics see that mindset as symptomatic of the party’s larger drift toward authoritarianism and embrace of anti-democratic action after Trump’s repeated efforts to overturn the results of the 2020 election to remain in power.",
    "Rob Portman of Ohio blasted President Vladimir Putin’s provocations as a “clear violation of international law.”\nThe co-chair of the Senate’s Ukraine Caucus urged the Biden administration to work with allies to “ensure a coordinated response to this unwarranted continued incursion on sovereign territory of Ukraine.”\nBut one of the Republicans running to replace the retiring Portman had a very different message.",
    "Congressional Republicans, especially those in the Senate, have been largely united in speaking out against Russian aggression, with some like Sen. Tom Cotton of Arkansas advocating a more aggressive posture and calling Biden’s response “timid” and “wholly unequal to this moment.”\nAlmost all have become increasingly critical of Biden as tensions ramp up during a crucial midterm election year.",
    "Republicans were also somewhat less likely than Democrats to say they’re very or extremely concerned that Russia’s influence around the world poses a direct threat to the U.S.\nAdam Geller, a Republican political strategist and pollster, warned that while domestic issues have generally played a more decisive role than foreign policy in recent elections, that could change.",
    "“I’m sick of Joe Biden focusing on the border of a country I don’t care about while he lets the border of his own country become a total war zone.”\nThe divergent responses to Europe’s most significant foreign policy crisis in generations reflects a divided — and rapidly changing — Republican Party.",
    "His lifelong objective has been to dismantle NATO, to separate the United States from Europe and to recreate the Soviet Union.”\nFor now, those questioning why the U.S. should care about Ukrainian security remain a small, if highly influential and vocal segment of the conservative movement.",
    "“They’re basically declaring their support for authoritarians and dictators and they don’t seem to have a problem with that type of ruling coming to America,” said Olivia Troye, a national security expert who advised Vice President Mike Pence in the Trump White House.",
    "The annual Conservative Political Action Conference that got underway in Florida on Thursday offered a preview of what’s to come as leaders focused their ire on both President Joe Biden’s handling of foreign policy and Putin’s norm-breaking aggression.",
    "Fox News host Tucker Carlson, the network’s biggest star, who reaches several million viewers each night, has repeatedly questioned why defending Ukraine is important and even asked why the U.S. should side with them and not Putin.",
    "An old guard, largely centered in Washington, that has long warned of Russian aggression is confronting an ascendant generation of conservatives who openly question why the U.S. should care about Russia’s moves at all.",
    "But Douglas Brinkley, a professor of history at Rice University, said there were larger issues at play, calling it unprecedented for Republicans to be questioning the need to stand with Ukraine and, ultimately, NATO.",
    "He won in 2016, in part, by running against the “forever wars” in Iraq and Afghanistan, arguing the country had gained little from the interventionism and nation-building of the neoconservative George W. Bush era.",
    "On Wednesday night, as the sound of explosions rang out through Kyiv, Kharkiv and other areas of Ukraine, Trump called the scene a “terrible situation“ and insisted Putin never would have moved on his watch.",
    "”It shows how our politics have gotten wayward over the last few years.”\nThe GOP’s approach to foreign policy took on new urgency after Putin on Thursday launched a military operation in Ukraine.",
    "The former president remains the most popular figure among the GOP base and is already wielding his influence in the midterm primaries that begin next week as he teases another presidential run.",
    "A new poll by The Associated Press-NORC Center for Public Affairs Research found only 22% of Republicans think the U.S. should play a major role in the conflict, compared with 32% of Democrats.",
    "The embrace was so baffling to Russia watchers that some grew convinced the only plausible explanation was that Putin had some kind of dirt on him, speculation that has never been verified.",
    "“That used to be the thing.”\nFrom the early days of his first presidential campaign, Trump has overseen a dramatic overhaul of the GOP’s traditional foreign policy stance.",
    "That would spell bad news for Biden, he said, energizing both Republicans as well as independents who voted for Biden because he’d promised a return to pre-Trump normalcy.",
    "“This isn’t a squabble about foreign policy.”\n___ Associated Press writers Emily Swanson in Washington and Steve Peoples in Orlando, Florida, contributed to this report.",
    "Gallup found the percentage of Republicans who called Russia a friend or ally rose sharply during Trump’s presidency, increasing from 22% in 2014 to 40% in 2018.",
    "“All of these people came up in a party where standing up tough against Russia was a prime directive,“ Doug Heye, a longtime GOP strategist, said of the divide.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "At the same time, Trump embraced Putin, complimenting him and denigrating NATO, the cornerstone of U.S. foreign policy since it was founded to counter Russia.",
    "In the runup to that action, the party’s division was a reminder of Donald Trump’s enduring impact on the GOP long after his departure from the White House.",
    "Those races could yield similarly minded Republicans who will head into the fall campaign positioned to succeed foreign policy traditionalists like Portman.",
    "He adopted an inward-looking “America First” doctrine that sought to use a combination of tough talk and unpredictability to scare off would-be aggressors.",
    "“They are unable to stop what Vladimir Putin is doing.”\nWhile slapping at the American president, she raised more serious concerns about Russia’s leader.",
    "“I suggest every American who wants to know what’s (asterisk)actually(asterisk) going on in Russia and Ukraine, read this transcript of Putin’s address.",
    "He repeatedly sided with Putin over U.S. intelligence agencies’ conclusions about Russia’s meddling in the 2016 U.S. presidential election.",
    "Rob Portman, R-Ohio, right, before Vice President Kamala Harris speaks during the Munich Security Conference, on Feb. 19, 2022, in Munich.",
    "Trump was impeached the first time for pressuring Ukraine to investigate Biden ahead of the 2020 election while withholding military aid.",
    "“NATO is the heart and soul of all American foreign policy.”\n“You undermine NATO, there is no American presence in the world,” he added.",
    "Today, there is little support among Americans for a major U.S. role in the Russia-Ukraine conflict, and even less among Republicans.",
    "“If there’s going to be a major war in Europe, it’s going to quickly rise up in the issue matrix in the minds of voters,“ he said.",
    "But we should be a united front in support of freedom and democracy.”\n“What happened to Republicans being anti-Russia?“ she added.",
    "As I’ve said for month — NATO (under direction from the United States) is violating previous agreements and expanding eastward.",
    "Candace Owens, a prominent conservative commentator, has gone even further, openly parroting Putin’s talking points.",
    "And as an American I’m angry about it and I’m saddened by it,” he said, calling into Laura Ingraham’s Fox News show.",
    "NEW YORK (AP) — As Russia intensified its aggression toward neighboring Ukraine earlier this week, Republican Sen.",
    "“We have a national leadership that I think at a certain point is probably criminally incompetent,“ said K.T.",
    "In 2016, his allies worked to strip language from the GOP platform that supported giving weapons to Ukraine.",
    "SHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "“I gotta be honest with you, I don’t really care what happens to Ukraine one way or another,” J.D.",
    "“He sees the weakness and the incompetence and the stupidity of this administration.",
    "His tenure overlapped with a corresponding change in public opinion.",
    "McFarland, the former deputy national security adviser under Trump.",
    "But those dismissing American involvement have powerful platforms.",
    "“It goes against generations of foreign policy making,“ he said.",
    "Democrats’ views of the relationship remained largely the same.",
    "“I think Americans can disagree about how best to proceed.",
    "Secretary of State Antony Blinken, left, speaks with Sen.",
    "“My concern is it doesn’t just stop with Ukraine.",
    "The Star does not endorse these opinions.",
    "WE are at fault,” she tweeted Tuesday.",
    "Vance said in a podcast interview.",
    "It goes on,” McFarland said.",
    "“Will he next threaten NATO?"
  ]
}