{
  "id": 4916,
  "mediaId": 2636,
  "date": "2022-02-22",
  "headline": "Trump, again cozying up to Putin, praises Russian aggression as ‘genius.’",
  "image": "https://static01.nyt.com/images/2022/02/22/world/22ukraine-briefing-trump-response1/22ukraine-briefing-trump-response1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/22/world/europe/trump-putin-russia-ukraine.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "On Tuesday, Mr. Trump also ridiculed President Biden and accused him of failing to address Mr. Putin’s recognition late Monday of two Russia-backed separatist territories in Ukraine as independent republics, saying, “There was no response,” and calling this “very sad.”\nMr. Trump’s remarks were broadcast on a conservative talk radio show hosted by Clay Travis and Buck Sexton around the same time that Mr. Biden addressed the nation and announced a first set of sanctions against Russia.",
    "“What, you think our country’s so innocent?”\nIn 2018, Mr. Trump stood alongside Mr. Putin at the end of a summit meeting in Helsinki, Finland, and publicly challenged the conclusion of his own intelligence agencies that Moscow had interfered in the 2016 election, an enormous demonstration of trust in a leader accused of attacking American democracy.",
    "As President Biden announced sanctions against Russia and warned of more if President Vladimir V. Putin did not withdraw his forces from Ukraine, former President Donald J. Trump on Tuesday praised Mr. Putin’s aggression as “genius” and called the Russian leader “very savvy” for describing the troops aligned on the Ukrainian border as peacekeepers.",
    "In July 2016, Mr. Trump directly appealed to the Russians to hack the emails of his Democratic opponent, Hillary Clinton, and make them public, the same day that the Russians made their first effort to break into the servers used by Mrs. Clinton’s personal office.",
    "Mr. Trump’s praise for a foreign adversary in a geopolitical confrontation with a sitting United States president was extraordinary for any former president, even one with a long history of cozying up to Mr. Putin, dating to his first presidential campaign.",
    "Mr. Trump made no mention on the radio show of his impeachment in 2019 for a pressure campaign on Ukraine to incriminate Mr. Biden and aid his own re-election campaign, a charge he was acquitted of in the Republican-controlled Senate.",
    "Once elected, Mr. Trump broke with decades of American precedent and repeatedly showed unusual deference toward Russia and expressed admiration for Mr. Putin, among other strongman leaders.",
    "Senator Lindsey Graham of South Carolina and others have called for harsh sanctions against Russia, while Trump supporters such as the Fox News host Tucker Carlson and J.D.",
    "Weeks after taking office, Mr. Trump brushed aside Mr. Putin’s human rights transgressions during an interview with Bill O’Reilly, then of Fox News.",
    "In a statement released Tuesday morning, Mr. Trump said the Russian aggression toward Ukraine would not have happened if he were still president.",
    "During the radio interview, Mr. Trump said he and Mr. Putin had discussed a potential invasion of Ukraine when Mr. Trump was in the White House.",
    "Here’s a guy who’s very savvy.”\nSince Mr. Trump left office, Republicans have split on how to respond to Russian aggression.",
    "Vance, a Senate candidate in Ohio, have argued that the United States should not punish Russia.",
    "I said, ‘How smart is that?’ And he’s going to go in and be a peacekeeper,” Mr. Trump said.",
    "“Putin is now saying, ‘It’s independent,’ a large section of Ukraine.",
    "You’re not going to do it.’ But I could see that he wanted it.",
    "“That’s the strongest peace force I’ve ever seen.",
    "I used to talk to him about it,” Mr. Trump said.",
    "There were more army tanks than I’ve ever seen.",
    "They’re going to keep peace, all right.",
    "“I knew that he always wanted Ukraine.",
    "We used to talk about it at length.”",
    "“You got a lot of killers,” he said.",
    "“I said, ‘You can’t do it.",
    "No, but think of it.",
    "I used to ask him."
  ]
}