{
  "id": 4924,
  "mediaId": 2745,
  "date": "2022-02-22",
  "headline": "The Trailer: In South Texas primaries, Republicans find Hispanic candidates — and votes",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PTWDZIBEHEI6ZBZZLS3KXIYKGA.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/02/22/trailer-south-texas-primaries-republicans-find-hispanic-candidates-votes/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3800,
    4474,
    878,
    5061,
    5134,
    5295
  ],
  "sentences": [
    "He kicked off the campaign by identifying the problems liberals had pushed on the rest of the country: “open borders, abortion, gender fluidity and defunding the police.”\n“I have come to realize that the radical secularists are not satisfied with merely promoting their ideas, rather they are using ridicule and intimidation to silence any voice opposed to their agenda,” said Bryant, who if successful would be the first Black Republican elected to Congress from the state.",
    "Timken doesn't have to compensate, she says: She was always “MAGA” and will fight for “stronger borders, American jobs and parents' rights.”\nCongressional Leadership Fund, “Morgan Luttrell.” Allied with House GOP leadership, the CLF is spending during Texas's early voting period to boost Luttrell in an 11-way race where his friendship with Rep. Adam Kinzinger (R-Ill.) has become the focus of attacks from another candidate, Christian Collins.",
    "Governor (D)\nMike Collier: 21%\nMichelle Beckley: 18%\nCarla Brailey: 15%\nDon't know: 40%\nAttorney General (D)\nRochelle Garza: 22%\nJoe Jaworski: 13%\nLee Merritt: 9%\nOthers: 15%\nDon't know: 38%\nFour years ago, after he zipped across Texas to build his Senate campaign and his name recognition, Beto O'Rourke lost most counties in the Rio Grande Valley, and places in East Texas and the panhandle where Democrats are scarce.",
    "The new thinking has stuck with Republicans, and the critics of the Democratic Party who saw Trump's approach as a break from the bipartisan military establishment, those who'd advocated for what former congresswoman Tulsi Gabbard of Hawaii called “regime change wars.” (Gabbard, who won four terms in Congress as a Democrat, will speak at the Conservative Political Action Conference this weekend.)",
    "“Nothing can accurately prepare you for the unimaginable pain, intense sorrow, suffocating grief and seemingly never-ending emptiness that engulfs the entire body, soul and spirit when your forever love passes away,” wrote Carnahan, who'd married Hagedorn in 2018, after he'd won the 1st Congressional District on his fourth try, and while she was chair of the Minnesota Republican Party.",
    "Nearly 2 out of every 5 Democratic primary voters opted for someone other than O'Rourke, mostly Sema Hernandez, who ran to O'Rourke's left and would tell him to address his “White privilege.” O'Rourke has broader support this year, with no challenger polling higher than in single digits, but Democratic voters don't know much about their other statewide candidates.",
    "Trump carried Jim Wells and seven other traditionally Democratic counties in South Texas and the greater Rio Grande Valley, breaking Republican turnout records, with flag-flying “Trump trains” that grew from small caravans to a 4,000-car Fourth of July parade to a convoy between Laredo and San Antonio that forced a Democratic campaign bus off the road.",
    "Governor (R)\nDan Patrick: 54%\nOthers: 14%\nDon't know: 31%\nAttorney General (R)\nKen Paxton: 39%\nGeorge P. Bush: 25%\nEva Guzman: 13%\nLouie Gohmert: 7%\nDon't know: 16%\nTexas is the biggest of eight states where candidates must crack 50 percent of the vote to win a primary; any less, and they head to a runoff with the second-place finishers.",
    "So, that was a misconception, and if you look at the other values each party has, this community is more aligned with the Republican Party.”\nFor Democrats here, being able to break with the party was part of the deal; the Democrats currently holding those House seats that Republicans are targeting, Rep. Vicente Gonzalez (D-Tex.)",
    "But Republicans are running against the Democratic Party as it exists; in interviews, voters who'd made the switch described their old loyalty to the party as traditional and convenient, melting away when they heard O'Rourke talk about gun confiscation or the Democrats on television talk about transitioning from fossil fuels.",
    "The idea that we're going to spend all this time focusing on Ukraine and that border and we do nothing with our southern border is shameful.”\nWhen he won the GOP nomination in 2016, Trump wiped out the interventionists and neoconservatives who had been associated with Republican foreign policy since 2001.",
    "“What changed for me was the way they were running against what an American citizen should be.”\nOver the weekend, all of the candidates for the new and competitive 15th House district campaigned for early votes in the valley, testing what Democrats had in place and what Republicans were building.",
    "The Ukraine crisis has yet to ripple through congressional campaigns or primaries, with Democrats saying little and Republicans generally citing it as a sequel to last year’s withdrawal from Afghanistan, and a story of the Biden administration’s weakness, but offering few solutions of their own.",
    "I'm sick of Joe Biden focusing on the border of a country I don't care about while he lets the border of his own country become a total war zone.”\nThat comment led to a multiday argument with the sort of people Vance enjoys arguing with, like Republican establishment veteran William Kristol.",
    "Collier, who ran and lost by 5 points to Dan Patrick four years ago, has far less name recognition than O'Rourke; for a few weeks last year, media attention for the campaign focused on Republican-turned-Democrat Matthew Dowd, who quit the race after more “diverse” alternatives jumped in.",
    "Gohmert, who has represented a deep red swath of East Texas for 18 years, is taking votes from Paxton, who has run ads attacking him; Bush has begun to run ads against Guzman, raising her profile as a Paxton alternative, while trying to keep her from rising into second place.",
    "“After years of voting to protect the Second Amendment, after years of voting to protect the unborn, after years of voting against tax increases and to secure the border, I look forward to not having to break with my party,” Guillen says in ads for his March 1 primary.",
    "The candidates could include Carnahan, who last year was forced out of the party's leadership after a fast-moving scandal that started when a GOP donor was indicted on sex-trafficking charges and expanded when ex-staffers accused her of running a hostile workplace.",
    "“We have young kids living in neighborhoods without running water, and we are a law-abiding society.” The Biden administration's immigration policy “conflicted” with what South Texas Hispanics wanted, he said, and the president himself was not a political asset.",
    "It’s cynicism and gridlock.” She also promised to bring “new energy” to the race as a member of a new generation, easy to read as a comment on the age of Rep. Peter Welch (D-Vt.), who largely cleared the field after announcing for the Democratic nomination.",
    "In a pre-primary poll released by the Dallas Morning News this week, 44 percent of Texas Hispanics said they were comfortable with Roe v. Wade being overturned, vs. 48 percent who weren't, numbers out of sync with the rest of the Democratic Party's base.",
    "For House seats that Republicans never bothered competing for, including the McAllen-based 15th Congressional District and the Laredo-based 28th Congressional District, the party has recruited serious candidates running as pro-Trump conservatives.",
    "“One of these days, and maybe not too far in the future, there will be the first Hispanic governor of Texas, and that governor must be a Republican.”\nHOUSTON — “What are we hearing out of Washington?” asked Rep. Marjorie Taylor Greene (R-Ga.).",
    "That compounded a problem that was well underway: The Democratic Party, while growing more competitive in suburban Texas, adopted positions on abortion, gun rights and immigration completely out of sync with the conservatism of border voters.",
    "That theme continues here, saying that “criminals are free to walk our streets and it's harder for police to do our jobs” in Democratic-led Nevada, then adding that the state is ranked last for “election integrity” by the Heritage Foundation.",
    "The final UT poll on the GOP's primaries finds no serious threat to Greg Abbott, who's seeking a third term as governor, and diffuse opposition to Dan Patrick, who's also running for the third time, but attracted no well-known opponents.",
    "“The U.S. and our allies must take immediate actions to cripple his regime.”\n“This Administration is a joke,” tweeted Bo Hines, a Republican candidate for Congress from North Carolina who is supported by Rep. Madison Cawthorn (R-N.C.).",
    "“Our culture is starting to wake up and realize that, hey, you know, you're not born with a Democratic affiliation.”\nFour years ago, Republicans recruited just 54 candidates for county races across South Texas and the border counties.",
    "“We have a president in the White House that caused 13 military members to needlessly get killed, because they had the intel, and they understood there was going to be an attack there,” Greene said, referring to deaths in Afghanistan.",
    "When Ted Cruz was staying at the Ritz-Carlton in Cancún during the winter freeze, we came down here to the Rio Grande Valley.”\nThere was some tension around the rally, masked when a mariachi band played O'Rourke onto the stage.",
    "Barack Obama carried it narrowly, Hillary Clinton lost it by 15 points and Joe Biden lost it by 10, with most of his improvement coming from the cities and from 2016 third-party voters switching back to the Democratic ticket.",
    "“Putin is a thug who has violated the sovereignty of a free country, and Biden’s weak standing on the world stage is inviting further aggressions,” Mehmet Oz said in a statement from his U.S. Senate campaign in Pennsylvania.",
    "No Republican had held office in Jim Wells County in her lifetime, or her parents' lifetime; no Republican candidate for president had won the tiny county, halfway between San Antonio and the U.S.-Mexico border, since 1956.",
    "When the governor took the stage, he warned of Democrats in Los Angeles and Austin ruining their cities by “defunding the police,” and got cheers for passing “the strongest ban on critical race theory” anywhere in America.",
    "“It is unfortunate that the mob mentality has come out in this way to defame, tarnish and attempt to ruin my personal and professional reputation,” Carnahan said then, calling for a “full investigation” of the accusations.",
    "Gonzalez, who'd just endorsed an Afghanistan veteran named Ruben Ramirez for the 15th District, wanted to advertise that endorsement, and wasn't happy when Michelle Vallejo, a more liberal candidate, wanted time onstage.",
    "Across South Texas and the Rio Grande Valley, Republicans are hoping to build on their 2020 gains with a wave of new candidates like Friedeck — candidates who'd never run before, seeking offices the party has never held.",
    "In November, Republican John Lujan flipped a Democratic state legislative seat near San Antonio; two weeks later, state Rep. Ryan Guillen, a conservative Democrat representing a Trump-won district, switched to the GOP.",
    "I don't think so.”\nJane Timken for Ohio, “Overcompensate.” The former chair of the Ohio GOP is the only woman running for the party's U.S. Senate nomination, and she starts this spot by mocking her rivals' manhood.",
    "Hagedorn's death reduces the GOP conference in the House to 211 members, with two vacancies — here and in California's Central Valley, where the all-party primary to replace Devin Nunes will take place on April 5.",
    "“When they complain about ‘children in cages’ — you know, that does not resonate here in South Texas,” said Eronini, wearing a shirt with a “thin blue line” flag and colors to show his support for law enforcement.",
    "“Joe Biden is an all talk, no action politician.” His evidence was a 2020 video of Biden saying that Putin’s “days of tyranny and trying to intimidate the United States” would be over if Biden won the presidency.",
    "In 2018, Democrats avoided runoffs for the other major statewide offices, but the party's near-miss performances that year led to a larger field this year, and no candidates are even close to a majority.",
    "Better Nevada PAC, “Safe and Secure.” Formed to support Clark County Sheriff Joe Lombardo in his Republican campaign for governor, Better Nevada's first ads portrayed him as the man to stop rising crime.",
    "Vance told former Trump adviser Stephen K. Bannon on his “War Room” podcast last week, before Russia recognized the Ukrainian enclaves of Donetsk and Luhansk as independent as a precursor to moving in.",
    "“And I think that as a progressive Democrat.”\nBut there was no static when Republicans gathered the next night, in McAllen, as food trucks fed hundreds of voters and a band warmed them up for Abbott.",
    "… I can't tell you how many doors I've knocked in Laredo, and it's never the lead issue.”\nO'Rourke had been criticized for not paying enough attention to the region in 2018, and wouldn't do it again.",
    "Former U.S. attorney Christina Nolan joined the state's U.S. Senate race Tuesday, giving Republicans their first credible candidate in the state since 2006, the last time one of its seats was open.",
    "All of that grew from a years-long campaign to convince conservative Hispanics that the Democratic Party has abandoned them, and from copious Trump-era investments in recruiting and voter contact.",
    "That issue opened doors for Republicans; the party's other positions, and angst about the economy under President Biden, were creating more problems for the Democrats in newly competitive races.",
    "This spot puts a swaggering rock soundtrack behind images of Luttrell serving as a Navy SEAL, and promises voters that he'll “back the blue” and “crush the woke mob” if he gets to Congress.",
    "“We are going to work not just to ensure that we have more Hispanics in the RGV voting than ever before, but we are going to elect more Hispanics in the RGV than ever before,” said Abbott.",
    "Other candidates asked why any American should be paying attention to Ukraine at all — frequently, like Nehls, saying that focusing on any border but the U.S.-Mexico border was pointless.",
    "Hagedorn won two close races, trailing the GOP ticket, against Democrat Dan Feehan, who hasn't said whether he'll run; Republicans have a deep bench in the district, including state Sens.",
    "Patrick Eronini, who took over the Hidalgo County Democratic Party last year, said in an interview that Republicans had taken advantage of the party's caution about campaigning in 2020.",
    "In 2020, they say, their party's caution about campaigning during the pandemic gave Republicans a once-in-a-lifetime opening to organize voters without a sustained Democratic response.",
    "If you're Hispanic, you're a Catholic and you're a Democrat,” said Andrew Infante, a 28-year-old gym owner from Port Isabel, who is running for justice of the peace in Cameron County.",
    "The 1st District, which covers the southernmost parts of Minnesota and the cities of Rochester and Mankato, moved right after 2012 as rural White voters began voting more Republican.",
    "With his wife Angela, Bryant wrote a book titled “Let’s Start Again: A Biracial Couple's View on Race, Racial Ignorance and Racial Insensitivity,” and he has hosted a weekly podcast.",
    "Voters and newly elected Hispanic Republicans sometimes cited abortion as an issue that got them to move, and frequently cited the migrant surge that began after Biden took office.",
    "But Democrats have lost ground since 2020, and the state's just-approved maps add more Republican precincts to the district, making it easier for the party to hold in November.",
    "It also suggests that George P. Bush's strategy in the attorney general primary — to push Paxton into a runoff, and get another chance at him 10 weeks later — could pay off.",
    "“I do care about the fact that, in my community right now, the leading cause of death among 18-to-45-year-olds is Mexican fentanyl that's coming across the southern border.",
    "The fact that Russia had not taken territory during the Trump years, but was set to take it during the Obama and Biden presidencies, was seen as proof that Trump was right.",
    "Garza, an ACLU attorney who dropped a run for Congress and switched to this race, leads in the first multi-candidate attorney general primary the party has had in ages.",
    "“Democrats literally didn't show up at all,” former congressman Beto O'Rourke, the Democratic favorite for the party's gubernatorial nomination, said in an interview.",
    "This year, they're running 135 candidates — many of them the first in their party to seek these offices, most of them facing no competition in the March 1 primaries.",
    "In this edition: A surge of Republican candidates in South Texas, how candidates are talking about Ukraine, and a TV ad that asks some questions about manhood.",
    "“This typically happens with national Democrats: We go to majority Mexican American communities and lead with immigration, as this uniformly positive thing.",
    "Hagedorn's wife, Jennifer Carnahan, announced the news on Facebook, and did not mention covid-19, for which the congressman had tested positive last month.",
    "But that, he said, was in the past; the party in 2022 needed to distinguish itself from more left-wing voices and ideas that didn't play in South Texas.",
    "“Last week, we were here in the Rio Grande Valley,” O'Rourke said at a Saturday evening rally with Tejano Democrats in Donna, not far from McAllen.",
    "She was one of just two speakers that night to mention the crisis in Ukraine, and she was portraying it, foremost, as chatter out of Washington.",
    "Democrats, they said, had continued to offer a far-reaching economic agenda to voters who had done well for themselves when Trump was president.",
    "“I think it's important for all candidates and all representatives of our community to be much more inclusive,” Vallejo said in an interview.",
    "Under President Trump, we didn't have that.”\nIt was Saturday evening in the Woodlands, a conservative retirement community north of Houston.",
    "The state set a May 24 primary for the seat, with the nominees going to an Aug. 9 special election, the same day as the state's primaries.",
    "Two-term Minnesota Rep. Jim Hagedorn (R) died Thursday, after a battle with kidney cancer he had fought for most of his time in Congress.",
    "“Somebody said to me: Do you want to influence the local election, or do you want to influence the federal election?” said Friedeck, 37.",
    "I was new to politics.”\nFriedeck would go on to lead the Republican Party in Jim Wells County, helping Donald Trump carry it in 2020.",
    "Pastor Alex Bryant entered the GOP primary in the 7th Congressional District, a safely Republican seat that Rep. Billy Long (R-Mo.)",
    "It's a one-two combo of an issue that general and primary election voters care about, and one that only primary voters care about.",
    "Candidates calling for action, if they were Republicans, did not miss the chance to blame the president for getting to this point.",
    "He wore a black T-shirt that read, “I identify as American,” a slogan that mocked the way Democrats campaigned for Hispanic votes.",
    "“I've got to be honest with you, I don't really care what happens to Ukraine one way or another,” Ohio U.S. Senate candidate J.D.",
    "Last June, a former Republican county chairman won the nonpartisan race for mayor of McAllen, one of the region's largest cities.",
    "“We all know guys who overcompensate for their inadequacies,” she says, walking up to photos of “Hillbilly Elegy” author J.D.",
    "Greene was one of the stars of a rally for Christian Collins, a Republican candidate in Texas’s 8th Congressional District.",
    "After five days, 3,760 votes had been cast in Republican primaries, double the total from the same period four years ago.",
    "She left that role to run for county judge this year, a job no Republican had ever won, because none had ever run for it.",
    "— Amanda Sue Friedeck remembers the choice she was given when she cast her first vote, because it wasn't a choice at all.",
    "So Friedeck, a conservative who opposed legal abortion, took a Democratic ballot and voted for local candidates.",
    "Governor (R)\nGreg Abbott: 60%\nAllen West: 7%\nRick Perry: 6%\nDon Huffines: 3%\nOthers: 8%\nDon't Know: 15%\nLt.",
    "He's thinking, ‘I'm not toying with that man.’”\n“But he sees weakness in this president,” Nehls continued.",
    "“Donald Trump stood eyeball-to-eyeball [with Putin], and I think Putin likes a good, strong adversary.",
    "My grandfather was a World War II veteran,” said Orlando Pena, Jr., 50, as he headed to see Texas Gov.",
    "“The Democrats were seen as the party of the poor,” said Javier Villalobos, the new mayor of McAllen.",
    "“And now we're supposed to trust this guy when it comes to dealing with Russia and Putin in Ukraine?",
    "Democrats had cast 13,680 votes, down 24 percent from what they'd turned out in the 2018 primary.",
    "(Gonzalez has switched to a more Democratic seat, creating an open primary in his old district.)",
    "In McAllen's Hidalgo County, Democrats dominated the first days of voting, as they always had.",
    "But the details of the Ukraine crisis weren't really breaking through in individual races.",
    "Yet when Democrats returned to traditional campaigning last year, the losses didn't stop.",
    "“Leaders in Washington of both parties have lost their way,” she said in a statement.",
    "Greg Abbott (R) speak at a pachanga celebration at a McAllen auto shop last weekend.",
    "“They are more interested in fighting with each other and beating the other party.",
    "Vance, former state treasurer Josh Mandel and business executive Mike Gibbons.",
    "Republicans opened outreach centers in Laredo and McAllen, and kept them open.",
    "Democrats know they have a problem, and only argue a little about the answer.",
    "“Was anybody toying with Ukraine when Donald Trump was in office?” asked Rep.",
    "), are among the only House Democrats who still identify as antiabortion.",
    "The idea of a president who'd bumbled his way into it was much stickier.",
    "“A couple of months before that, we were in the Rio Grande Valley.",
    "It's much more complicated than that, especially on the border.",
    "Governor (D)\nBeto O'Rourke: 68%\nOthers: 17%\nDon't know: 14%\nLt.",
    "We're hearing the drums of war for Ukraine with Russia.",
    "“The Democrats had such a strong hold here for so long.",
    "“Our country is in the midst of a culture war.”",
    "We own more businesses than we had before.",
    "That's what we're hearing, over and over.",
    "“Our position is that we're not poor.",
    "“What are we hearing from the media?",
    "But their advantage was narrowing.",
    "“I was green,” Friedeck explained.",
    "and Rep. Henry Cuellar (D-Tex.",
    "is leaving to run for Senate.",
    "Julie Rosen and David Senjem.",
    "Troy E. Nehls (R-Tex.).",
    "“I grew up Democrat.",
    "We're more educated.",
    "“I wasn't educated.",
    "“He sees weakness.",
    "ALICE, Tex.",
    "Missouri.",
    "Vermont."
  ]
}