{
  "id": 5046,
  "mediaId": 2590,
  "date": "2022-02-23",
  "headline": "'Who Cares?': Trump Allies Question U.S. Support For Ukraine",
  "image": "https://img.huffingtonpost.com/asset/62164b6c2700007f63458ce4.jpeg?cache=bqJuuuE8X4&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/trump-ukraine-carlson-putin_n_621649cae4b0afc668b95257",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Bobic",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "As bipartisan support grows for severe sanctions on Russia over its deployment of troops into Ukraine - with some lawmakers drawing comparisons to Germany’s aggression in pre-World War II Europe - prominent Donald Trump supporters are questioning America’s interests in the region, echoing Kremlin talking points about Ukraine, and heaping praise on Russian President Vladimir Putin.",
    "pic.twitter.com/0jlXfS0PYy\n— Acyn (@Acyn) February 23, 2022\nRight-wing author and commentator Candace Owens, another Trump acolyte, agreed, tweeting: “WE are at fault.” She urged her followers to read Putin’s remarks from earlier this week, in which he painted a distorted picture of Western aggression.",
    "Carlson claimed President Joe Biden is actually the aggressor, and that he’s secretly setting up a conflict with Russia to “make a play against fossil fuels.”\nAdvertisement\nTucker: It may be worth asking yourself… why do I hate Putin.. Has Putin ever called me a racist?",
    "Advertisement\nNot to be outdone, Trump himself appeared in awe of Putin during an interview on Tuesday, calling his deployment of troops into Ukraine “genius.”\n“I said, ‘How smart is that?’ And he’s going to go in and be a peacekeeper.",
    "Advertisement\n“President Biden is the president of the United States, and to the extent that I can help him push back against Putin and bring stability to the world, I will gladly do so,” Graham said Tuesday in South Carolina.",
    "But with the GOP’s response to Ukraine fractured, and Trump unwilling to condemn Putin directly, widespread Republican support for tougher U.S. measures in response to Russian aggression may prove hard to find.",
    "Former Secretary of State Mike Pompeo, who is widely thought to be preparing a run for president in 2024, heaped praise on Putin as “very shrewd,” adding that he has “enormous respect” for the Russian leader.",
    "Vance has argued the U.S. border with Mexico is more important to voters, drawing attacks from Jane Timken, another candidate in the race who has strongly condemned Putin’s aggression.",
    "and Marco Rubio (Fla.), are urging Biden to go even further by imposing harsher sanctions directly on Putin and his allies, and faulting the president for not doing so earlier.",
    "Fox News host Tucker Carlson, the most influential voice on the network, suggested Tuesday that maybe Putin isn’t actually as bad a guy as the West makes him out to be.",
    "Meanwhile, Charlie Kirk, a conservative activist and radio host, dismissed the crisis as a “family dispute between two countries.”\n“Who cares?” Kirk asked on his show.",
    "“I will not be part of an appeasement movement that will lead to further conflict,” he said, in an apparent reference to Republicans who have declined to oppose Putin.",
    "“This is the Republican mainstream,” Sen. Chris Murphy (D-Conn.) tweeted on Wednesday, referring to GOP candidates downplaying Putin’s sending of troops into Ukraine.",
    "Throughout his four years in office, the former president repeatedly praised Putin and other autocrats across the world for being “tough,” unlike leaders in America.",
    "Establishment voices within the GOP - what’s left of them, anyway - are responding to the situation in Ukraine very differently.",
    "Republican senators, including Minority Leader Mitch McConnell (Ky.), Lindsey Graham (S.C.), Ben Sasse (Neb.)",
    "Some observers saw the speech as an effort to sell a further invasion of Ukraine to the Russian public.",
    "Trump and his allies complimenting Putin is nothing new, of course.",
    "Has he threatened to get me fired for disagreeing with him?",
    "It’s not just media figures downplaying the Ukraine crisis.",
    "“People like Graham and McConnell are the outliers.”",
    "That’s the strongest peace force,” Trump said.",
    "Ohio GOP Senate candidate J.D."
  ]
}