{
  "id": 5048,
  "mediaId": 2658,
  "date": "2022-02-16",
  "headline": "Portman backs Timken in crowded Ohio GOP primary",
  "image": "https://static.politico.com/bd/d4/73be9be94b31842d52958c2603f4/https-delivery.gettyimages.com/downloads/1238116595",
  "link": "https://www.politico.com/news/2022/02/16/portman-timken-ohio-gop-primary-00009470",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1804,
    2131,
    2177,
    3466,
    3920,
    4526,
    764,
    878,
    1171,
    5212
  ],
  "sentences": [
    "“This seat in the Senate belongs to the people of Ohio, and as their next Senator I will work every day to put their needs and interests first.”\nA poll of likely GOP primary voters conducted Feb. 8-10 by the Trafalgar Group shows Timken in fourth place, with 9.8 those polled saying they would vote for her if the primary happened today.",
    "“I am confident in her ability to win both the primary and the general elections, ensuring that this Senate seat remains Republican with a 50-50 Senate, and so much at stake.”\nPortman’s endorsement comes after he announced last year that he would not be seeking reelection for a third term.",
    "I respect Rob’s service, but each day more and more Ohio Republicans recognize the fact I am the only candidate with a record of conservative leadership that gets results for Ohio,” Dolan said.",
    "Dolan, who had been vocal about wanting Portman’s endorsement, said in a statement that he spoke with Portman Wednesday morning about him backing Timken.",
    "Rob Portman on Wednesday endorsed Jane Timken in the GOP Senate primary to replace him, backing the former Ohio Republican Party chair in a crowded race.",
    "The race for the GOP nomination to replace him has grown into one of 2022’s most crowded, featuring Timken, “Hillbilly Elegy” author J.D.",
    "Rob Portman (R-Ohio) said in a statement that Timken is the “best candidate” to advance GOP policies.",
    "Vance, former state treasurer Josh Mandel, state Sen. Matt Dolan and investment banker Mike Gibbons.",
    "Portman (R-Ohio) said in a statement that Timken is the “best candidate” to advance GOP policies.",
    "Mandel leads the primary with 21 percent, Gibbons 16.4 percent, Vance 14.3 and Dolan 10.2.",
    "“He made clear that his support for Jane Timken was predicated on personal friendship.",
    "“Jane is smart and hard working, and understands the needs of Ohioans,” he also said.",
    "| Cash-Pool/Getty Images\nBy Mackenzie Wilkes\n 02/16/2022 01:25 PM EST\nRetiring Sen.",
    "Twenty-five percent of respondents said they were undecided.",
    "Sen."
  ]
}