{
  "id": 5197,
  "mediaId": 2877,
  "date": "2022-02-16",
  "headline": "The Gun Registry That Isn’t — At Least Not Yet",
  "image": "https://img.patriotpost.us/01FVZENRAYKNSRR68A9G2G8XNT.jpeg?w=1200&h=600",
  "link": "https://patriotpost.us/articles/86274-the-gun-registry-that-isnt-at-least-not-yet-2022-02-16",
  "mediaOutlet": "patriot post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Swartz",
  "authorUrl": "https://patriotpost.us/contributors/360",
  "termIds": [
    1866,
    3466,
    3975,
    163,
    450,
    1067,
    5351,
    5395
  ],
  "sentences": [
    "PolitiFact claims that, from Vance’s point of view, “The argument is that it would be a short hop from simply holding the records to converting them into a comprehensive database.” With that motive and opportunity alluded to above, Vance is making a reasonable assumption, as there’s no reason to change the law allowing gun dealers to destroy their records after 20 years unless you wanted to start a registry — people aren’t going to wait two decades to commit crimes with a gun just so the records will be destroyed (assuming the gun dealer doesn’t go out of business and turn the data over to the feds in the meantime).",
    "The bureau’s response revealed the vast expanse of the database, but insisted, “ATF is confident that it does not violate any laws.” While current federal law allows gun sellers to purge records that are more than 20 years old, the Biden administration wishes to eliminate that ability to purge those records, requiring gun sellers to keep the records in perpetuity until they go out of business — at which point they are required to turn over their records to the ATF under current law.",
    "The practice has contributed to the fears of gun advocacy groups and Second Amendment champions in Congress that the federal government is creating a national database of gun owners, which violates longstanding federal statutes.”\nAdd to that the recent remarks from Joe Biden in the wake of the Texas synagogue hostage situation that he needed to do more to get guns off the streets and, well, people can add two plus two.",
    "Thus, it doesn’t matter that USA Today “expert” Kristin Goss, a professor of public policy at Duke University, says that she has “seen no credible information that ATF is using the out-of-business records except for the intended, legal purpose of aiding in specific gun-trace requests associated with specific criminal investigations” because she’s not at the agency or even an employee of the federal government.",
    "We don’t have to rehash the litany here, but there’s plenty of motive and opportunity here for mischief in an area that would be vital information for the government to have just on the off chance it would like to disarm a population.",
    "“The ATF disclosed to lawmakers that it manages a database of 920,664,765 firearm purchase records, including both digital and hard copy versions of these transactions,” The Washington Free Beacon recently reported.",
    "All this controversy started thanks to an earlier Free Beacon story that led to an inquiry by Texas Representative Michael Cloud regarding what are known as “out of business records” maintained by the ATF.",
    "Both the GOA and Vance were extrapolating from information revealing that the federal government is in possession of nearly one billion separate gun ownership records, much more than previously believed.",
    "While the “fact-checkers” have the data on their side for the time being, the government has a well-established track record — especially under Democrats — of overstepping its bounds until it’s stopped.",
    "“When a licensed gun store goes out of business, its private records detailing gun transactions become ATF property and are stored at a federal site in West Virginia.",
    "Who knows how much closer the ATF would be to having an illegal registry database without Michael Cloud and the Free Beacon shining some light on its practices?",
    "When roughly 20 million guns were sold last year, it prompts a big question: How far back does the ATF have to go to reach nearly one billion records?",
    "While the ATF protests its innocence, the last few years have seen several federal agencies go rogue in overstepping their legal boundaries.",
    "In fact, aside from a pair of ATF employees who work in PR and public affairs, none of the “experts” cited by USA Today work for them.",
    "By the same token, when Vance says he’ll “fight to end Biden’s illegal gun database,” he may be just a little ahead of the game.",
    "Separate gun-related claims from Gun Owners of America and Ohio U.S. Senate candidate (and Hillbilly Elegy author) J.D.",
    "The GOA claim was rated as “missing context,” while Vance’s was simply “false.” So what were the facts in contention?",
    "(Also worth noting: PolitiFact uses two of the same “experts” that USA Today did to come up with its ruling.)",
    "Should Vance win this November, he may need to fight the fight before the Democrats leave office.",
    "Hers is an assertion obviously subject to change with any new revelation in the story.",
    "Vance drew “fact-checks” from USA Today and PolitiFact, respectively.",
    "Most are in academia."
  ]
}