{
  "id": 5214,
  "mediaId": 6443,
  "date": "2022-02-20",
  "headline": "House Dem retirements hit 30-year high",
  "image": "http://s9953.pcdn.co/wp-content/uploads/2022/02/hypatia-h_1361be145db37108fafe0dc5f04f09a9-h_9855c54813256f001963b36b0b48d3d9-300-scaled-1.jpg",
  "link": "http://conservativeintel.com/2022/02/21/the-briefing-vol-x-issue-8/",
  "mediaOutlet": "conservativeintel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "This week: The Briefing, Vol X, Issue 8\nMore Democrats keep bailing out\nState-by-state polling is even more alarming for them\nTop two fading in Ohio Senate race\nOutlook\nDemocratic terror: With the announced retirement of Rep Kathleen Rice D-N.Y., Democrats now have 30 of their own House members retiring.",
    "A new series of polls from Civiqs\nLooking at the states where Democrats are defending key Senate seats this year, Biden is minus-20 net approval in Nevada, minus-27 in Georgia, minus-28 in Arizona,, minus-15 in Colorado, minus-9 in New Hampshire, and minus-6 in Washington and Illinois.",
    "On immigration, they have endorsed and embraced a full open borders policy, which has resulted not only in an increase in trafficking of fentanyl, but also a completely lawless situation in which illegal crossers are simply being released into the interior of the country.",
    "These poll numbers don’t suggest that has already happened or that it will happen this year, but they do point to an alarming loss of support by Democrats among minority voters — at least enough to cause some serious pain in 2022.",
    "As for states where Republicans are defending vulnerable seats, Biden is minus-37 in Missouri, minus-24 in Florida, minus-20 in Pennsylvania, minus-24 in North Carolina, minus-31 in Iowa, minus-32 in Ohio, and minus-35 in Alaska.",
    "He is even nine points underwater in New York — not to say that Majority Leader Chuck Schumer is in trouble, but he’d better take his campaign seriously this year, because it’s not going to be an easy year for Democrats anywhere.",
    "The Biden administration has turned immigration enforcement into a farce, with 2021 featuring a record number of border crossers precisely because, both explicitly and implicitly, he has invited them.",
    "Finally, voters are so angry about Democrats’ continued COVID restrictions, that their own internal polling is convincing multiple Democratic office holders to abandon those restrictions willy-nilly.",
    "Without any scientific justification, based entirely on the outcome of highly negative focus groups, Democrats have decided that their restrictions are so toxic they can no longer maintain them.",
    "The Civiqs poll — a massive poll with more than 160,000 respondents in the last month, puts the racial category of “other” at 51 percent disapproval of Biden, compared to 38 percent approval.",
    "So what happens if Chinatown’s angry reaction to the San Francisco leftists can be extrapolated to a reaction to their defensive systematic discrimination against Asian college applicants?",
    "Democrats cannot win elections with their tiny, wealthy slice of white voters — the woke urban gentry — if they don’t rack up enormous majorities among black, Hispanic, and Asian voters.",
    "Greg Abbott, facing a candidate as woke and out-of-touch as Beto O’Rourke does what he had hoped to do in 2014 and 2018 — that is, win the heavily Hispanic counties of South Texas.",
    "Vance fades away to nothing and Mandel’s numbers remain decidedly unimpressive, considering his name recognition as a former statewide officeholder and nominee.",
    "Those counties’ support for Trump surged in 2016 and there is every reason to believe that they are headed in a Republican direction over the next decade.",
    "Non-white voters: There is one additional troubling trend for Democrats — namely, historically reliable demographic groups appear to be abandoning them.",
    "Senate 2022\nOhio: As if out of nowhere, Cleveland banker Mike Gibbons has suddenly emerged as the top or second-place candidate in recent polls.",
    "That makes it the most retirements leading to an open seat race since 1992, when 40 Democrats departed in the wake of the House banking scandal.",
    "But last week’s overwhelming vote in San Francisco to throw out three ultra-woke school board members has beneath it another grim possibility.",
    "On education, their culture war against parents has backfired so badly that this traditionally Democratic issue has been turned against them.",
    "The only four states where Biden has a positive rating, according to Civiqs, are Hawaii, Maryland (just barely), Massachusetts, and Vermont.",
    "This may not be the of any enormous breakthrough, but Republicans would do practically anything to make progress in this direction.",
    "This is most true so far of Hispanic voters, whose approval of Biden is just 45 percent versus 44 percent disapproval, per Civiqs.",
    "They inherited an extremely tenuous grip on power at a moment when their leadership was poised to produce all the wrong answers.",
    "The big surprise is that he is suddenly competing effectively with the early frontrunner, former State Treasurer Josh Mandel.",
    "The latest Quinnipiac Poll has him all the way down to 37 percent approval, and all the way up to 56 percent disapproval.",
    "Meanwhile, American workers are seeing their paychecks eroded by inflation that has reached a frightening 40-year high.",
    "On crime, Democrats jumped on the wokeness bandwagon and demanded defunding of the police, almost as if with one voice.",
    "Ron DeSantis has a double-digit lead over both Agricultural Commissioner Nikki Fried and state Sen. Annette Taddeo.",
    "Gibbons is attempting to frame himself as the Trump candidate, even as erstwhile insurgent candidate J.D.",
    "That’s a pretty lousy 19-point underwater rating, but the national numbers really understate the case.",
    "Texas: With Biden 33 points underwater in the Lone Star State, this could be the year that Gov.",
    "If Democrats do as expected and write off Florida this year, that will be the main reason why.",
    "But what’s most impressive is that DeSantis clocks in above 50 percent against all comers.",
    "If their unbalanced support from these groups wavers, then their entire party is doomed.",
    "Asians have recently become the fastest-growing demographic group of voters in America.",
    "What if Asian American voters start to drift toward a more even split in their voting?",
    "In fact, their leader, Joe Biden, keeps begging Congress to make the problem worse.",
    "Now they are regretting it as a crime wave overwhelms the cities they govern.",
    "Swing state blues: In this context, Biden’s polling continues to worsen.",
    "Governor 2022\nFlorida: According to the newest Mason Dixon poll, Gov.",
    "To put it bluntly, Biden is the turd in every Democrat’s punch bowl.",
    "Education, it turns out, is about more than just levels of funding.",
    "This is the first indication that Gibbons might have a real chance.",
    "Governor’s all over the country are abandoning masking mandates.",
    "A bevy of kitchen table issues have turned against their party.",
    "We have gone over some of the reasons in recent weeks.",
    "Biden is doing even worse in all the important states.",
    "Charlie Crist trails him by eight points.",
    "On inflation, Democrats have no answers.",
    "Why are they running scared?",
    "Former Gov."
  ]
}