{
  "id": 5221,
  "mediaId": 2713,
  "date": "2022-02-14",
  "headline": "Peter Thiel: the tech billionaire funding a Trump-friendly GOP",
  "image": "https://static.ffx.io/images/$zoom_0.39991567897606684%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_199%2C$y_83/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/bc32c430ea25138d2018fd1fb1cca6b3b3f88161",
  "link": "https://www.smh.com.au/world/north-america/peter-thiel-the-tech-billionaire-funding-a-trump-friendly-gop-20220215-p59wgc.html?ref=rss&utm_medium=rss&utm_source=rss_world",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Mac",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Tech investor and conservative provocateur Peter Thiel has reemerged as a key financier of the Make America Great Again movement.Credit:Bloomberg\nCheney, one of several Republicans who had voted to impeach President Donald Trump on charges of inciting the January 6 storming of the US Capitol, was the face of “the traitorous 10,” Thiel said, according to two people with knowledge of the event, who were not authorised to speak publicly.",
    "Entrepreneur Peter Thiel speaks during the final day of the Republican National Convention in Cleveland in 2016. Credit:AP\nWhat sets Thiel’s spending apart, though, is its focus on hard-right candidates who traffic in the conspiracy theories espoused by Trump and who cast themselves as rebels determined to overthrow the Republican establishment and even the broader American political order.",
    "Peter Thiel, a supporter of Donald Trump, has a deep interest in challenging conventional thinking.Credit:Evan Vucci\nAt an October dinner at Stanford University for the Federalist Society, he spoke about the “deranged society” that “a completely deranged government” had created, according to a recording of the event obtained by The New York Times.",
    "In one 2009 piece, Thiel, who called himself a libertarian, wrote that he had come to “no longer believe that freedom and democracy are compatible,” arguing that American politics would always be hostile to free-market ideals, and that politics was about interfering with other people’s lives without their consent.",
    "“I think Peter wants to change the direction of the country.”\n“I will take QAnon and Pizzagate conspiracy theories any day over a Ministry of Truth.”\nPeter Thiel\nThiel’s giving is expected to make up just a small fraction of the hundreds of millions of dollars that are likely to flow through campaigns this cycle.",
    "Masters offered the same opportunity for a meal with Thiel and raised $US550,000 by selling nonfungible tokens, or NFTs, of Zero to One digital art that would give holders “access to parties with me and Peter.”\nThiel’s backing has prompted other tech investors to support the two candidates.",
    "“When you have a funder who is actively elevating candidates who are denying the legitimacy of elections, that is a direct assault on the foundation of democracy,” said Lee Drutman, a senior fellow at the left-leaning group New America, who studies campaign finance and hyperpartisanship.",
    "Unlike traditional Republican donors who have focused on their party’s winning control of Congress and the White House, Thiel has set his sights on reshaping the Republican agenda with his brand of anti-establishment contrarianism, said Steve Bannon, Trump’s former chief strategist.",
    "While the investor has been something of a cipher, he is currently driven by a worldview that the establishment and globalisation have failed, that current immigration policy pillages the middle class and that the country must dismantle federal institutions.",
    "At a meeting with tech leaders at Trump Tower in Manhattan in December 2016, Trump told Thiel, “You’re a very special guy.”\nA month later, Thiel, a naturalised American, was revealed to have also obtained citizenship in New Zealand.",
    "Thiel has started articulating his thinking publicly, recently headlining at least six conservative and libertarian gatherings where he criticised the Chinese Communist Party and big tech companies and questioned climate science.",
    "That essentially puts him and Kenneth Griffin, CEO of the hedge fund Citadel, in a tie as the largest individual donors to Republican politics this election cycle, according to the nonpartisan research organisation OpenSecrets.",
    "No payment required\nRead more\nContinue with GoogleContinue with Apple\nor\nEmail addressContinue\nBy continuing, you agree to your personal information being collected under our privacy policy and accept our terms of use.",
    "These campaigns have raised millions in small-dollar donations, but Thiel’s wealth could accelerate the shift of views once considered fringe to the mainstream — while making himself a new power broker on the right.",
    "Both candidates have repeated the Trumpian lie of election fraud, with Masters stating in a November campaign ad, “I think Trump won in 2020.” They have also made Thiel a selling point in their campaigns.",
    "Thiel, who had donated to Cruz’s 2012 campaign, replied, “It’s relatively safe to support Cruz (for me) because he threatens the Republican establishment.”\nThiel used his money to fund other causes.",
    "The fundraiser at Thiel’s Miami Beach compound last month was for a conservative candidate challenging Representative Liz Cheney of Wyoming for a spot on the ballot in November’s midterm elections.",
    "In addition to Harriet Hageman, the challenger to Cheney, he is backing Joe Kent and Loren Culp, both of whom are running against House Republicans in Washington state who voted to impeach Trump.",
    "Vance, the venture capitalist who wrote the best-selling memoir Hillbilly Elegy, met Thiel a decade ago when the billionaire delivered a lecture at Yale Law School, where Vance was a student.",
    "That prompted a furor, especially after Trump had urged people to pledge “total allegiance to the United States.”\nDuring Trump’s presidency, Thiel became frustrated with the administration.",
    "Thiel, who declined to comment for this article, announced last week that he would leave the board of Meta, the parent company of Facebook, which conservatives have accused of censorship.",
    "At an October event held by a conservative tech group in Miami, he alluded to his frustration with Facebook, which was increasingly removing certain kinds of speech and had barred Trump.",
    "Thiel has also made smaller donations to Trump loyalists, including in September to Hageman and Patrick Witt, a former Trump administration official running for a House seat in Georgia.",
    "After sitting out the 2020 presidential race, the venture capitalist this year is backing 16 Senate and House candidates, many of whom have embraced the lie that Trump won the election.",
    "This year, they have clamoured for invitations to Thiel’s Los Angeles and Miami Beach homes, or debated how to at least get on the phone with him, political strategists said.",
    "Thiel, who became known in 2016 as one of the biggest donors to Trump’s presidential campaign, has reemerged as a key financier of the Make America Great Again movement.",
    "A Moneyman’s Evolution\nBorn in West Germany and raised in South Africa and the San Francisco Bay Area, Thiel showed his provocative side at Stanford in the late 1980s.",
    "Thiel reduced his business commitments and started pondering leaving Meta’s board, which he had joined in 2005, two of the people with knowledge of his thinking said.",
    "In a 20-minute speech at the National Conservatism Conference in October, he said nationalism was “a corrective” to the “brain-dead, one-world state” of globalism.",
    "Some Republicans worry that Thiel is arming candidates who are too extreme with financial firepower, fuelling what could be politically detrimental primary races.",
    "His only notable federal election donation was to Kris Kobach, a Trump ally and former secretary of state of Kansas known for his hard-line views on immigration.",
    "In the email, which The Times obtained, Yarvin argued that it didn’t matter if those candidates lost general elections or cost the party control in Congress.",
    "He donated lavishly to Ron Paul’s 2008 and 2012 presidential campaigns before turning to candidates who were more extreme than the Republican establishment.",
    "Vance later worked at Mithril Capital, one of Thiel’s investment funds, before opening his own fund in Ohio, Narya Capital, in which Thiel is an investor.",
    "Thiel also helped found The Stanford Review, a conservative campus paper that sought to provide “alternative views” to what he deemed left-wing orthodoxy.",
    "“You have to nominate candidates who can win in the fall and not just damage everyone on the way,” said Scott Reed, a longtime Republican strategist.",
    "Masters, the chief operating officer of Thiel Capital, the investor’s family office, has promised to leave that job before Arizona’s August primary.",
    "But the amounts he is pouring into individual races and the early nature of his primary donations have put him on the radar of Republican hopefuls.",
    "In 2013, Curtis Yarvin, an entrepreneur who has voiced racist beliefs and said democracy was a destructive system of government, emailed Thiel.",
    "Rape, he and his co-author, David Sacks, wrote, sometimes included “seductions that are later regretted.” (Thiel has apologised for the book.)",
    "In 1995, he co-wrote a book, The Diversity Myth, arguing that “the extreme focus on racism” had caused greater societal tension and acrimony.",
    "He has taken issue with what he calls the “extreme dogmatism” within establishment institutions, which he said had sent the country backward.",
    "He also gave to a political action committee associated with Senator Ted Cruz, the Texas Republican, who is not up for reelection this year.",
    "In July 2016, Thiel appeared at the Republican National Convention to proclaim that he was proud to be a gay Republican supporting Trump.",
    "In November, Vance wrote on Twitter that anyone who donated $10,800 to his campaign could attend a small group dinner with him and Thiel.",
    "Thiel personally vets the candidates he gives to, said three Republican strategists, who declined to be named for fear of retaliation.",
    "Like Thiel, the men are tech investors with pedigrees from elite universities who cast themselves as antagonists to the establishment.",
    "The sums were his biggest and the largest ever one-time contributions to a PAC backing a single candidate, according to OpenSecrets.",
    "Vance took home more than $US400,000 in salary from Narya in 2020 and the first half of 2021, according to financial disclosures.",
    "And Peter Thiel, the tech billionaire and host of the event, had a message for the well-heeled crowd: It was time to clean house.",
    "Thiel also funded an app company run by John McEntee, one of Trump’s closest aides, two people with knowledge of the deal said.",
    "“My somewhat apocalyptic, somewhat hopeful thought is that we are finally at a point where things are breaking,” Thiel said.",
    "Thiel has attracted the most attention for two $10 million donations to Senate candidates Blake Masters in Arizona and J.D.",
    "Since the 2020 election, they have met at least three times in New York and at Mar-a-Lago, sometimes with Masters or Vance.",
    "Classmates recalled Thiel, who studied philosophy and law, describing South Africa’s apartheid as a sound economic system.",
    "He became Facebook’s first outside investor in 2004 and established the venture capital firm Founders Fund a year later.",
    "By Ryan Mac and Lisa Lerer\n February 15, 2022 — 6.14am\n Save\nLog in, register or subscribe to save articles for later.",
    "Yarvin wrote that Cruz, then a newly elected senator, “needs to purge every single traitor” from the Republican Party.",
    "In 2016, he was revealed as the secret funder of a lawsuit that targeted Gawker Media, which had reported he was gay.",
    "In October, he spoke at the event for the Federalist Society at Stanford and at the National Conservatism Conference.",
    "Thiel’s political giving ramped up last spring with his $US10 million checks to PACs supporting Vance and Masters.",
    "And Thiel invested in McEntee’s company, which is building a dating app for conservatives called the RightStuff.",
    "He published philosophical essays, often dark musings on politics, technology, Christianity and globalization.",
    "But in Trump, he sees a vessel to push through his ideological goals, three people close to the investor said.",
    "The two men met recently in New York and at the former president’s Mar-a-Lago club in Palm Beach, Florida.",
    "Masters met Thiel when he was a Stanford law student in 2012 and the investor taught a class on startups.",
    "In August, he bought a $US13 million mansion in Washington from Wilbur Ross, Trump’s commerce secretary.",
    "In the past, many courted the billionaire Koch brothers or Sheldon Adelson, the late casino magnate.",
    "In 2020, Masters reported more than $US1.1 million in salary from Thiel Capital and book royalties.",
    "“We need dissident voices more than ever.”\nThis article originally appeared in The New York Times.",
    "“I don’t think it’s just about flipping the Senate,” said Bannon, who has known Thiel since 2016.",
    "Get a note directly from our foreign correspondents on what’s making headlines around the world.",
    "“I will take QAnon and Pizzagate conspiracy theories any day over a Ministry of Truth,” he said.",
    "To get these candidates into office, Thiel has given more than $US20.4 million ($28.6 million).",
    "Sacks, the co-author of The Diversity Myth and now an investor, hosted a fundraiser for Vance.",
    "All of them had to be replaced, he declared, by conservatives loyal to the former president.",
    "Since then, he has hosted and attended events with white nationalists and alt-right figures.",
    "A Meta spokesperson said the company valued and had benefited from Thiel’s contributions.",
    "The next year, he married a longtime boyfriend, Matt Danzeisen; they have two children.",
    "In Ohio, Vance trails in polling, partly hampered by a previous denunciation of Trump.",
    "Share\nNormal text sizeLarger text sizeVery large text size\nNew York: The wine flowed.",
    "After Trump won, Thiel was named to the president-elect’s executive transition team.",
    "“There are all these ways that things have fallen short,” he told The Times in 2018.",
    "In 1998, Thiel helped create what would become the digital payments company PayPal.",
    "They have also worked for the billionaire and been financially dependent on him.",
    "“We have the zombie retreads just busy rearranging the deck chairs,” he said.",
    "Vance, Masters and their campaigns did not respond to requests for comment.",
    "In 2016, he announced that he was moving from San Francisco to Los Angeles.",
    "Gawker declared bankruptcy, partly from the costs of fighting the lawsuit.",
    "Thiel, 54, has not publicly said what he believes about the 2020 election.",
    "Register or log in now to read more articles and unlock extra benefits.",
    "The United States was on the verge of a momentous correction, he said.",
    "(A spokesperson for Thiel has denied that he supported apartheid.)",
    "Like Trump in 2016, Vance and Masters lack experience in politics.",
    "The candidates Thiel has funded offer a window into his ideology.",
    "The two later co-wrote a bestselling business book, Zero to One.",
    "As a venture capitalist, Thiel branded himself as a contrarian.",
    "One reason for the change: He plans to focus more on politics.",
    "Joe Lonsdale, a venture capitalist, held one for Masters.",
    "Sign up for the weekly What in the World newsletter here.",
    "In Arizona, Masters is competing in a crowded field.",
    "He later donated $1.25 million to the candidate.",
    "His political giving evolved with those views.",
    "(Kobach lost his primary bid for the Senate.)",
    "Thiel rebuilt his relationship with Trump.",
    "Forbes puts his fortune at $US2.6 billion.",
    "Donald Trump jnr mingled with the guests.",
    "Thiel’s personal priorities also changed.",
    "But Thiel appears ready to press forward.",
    "He also blasted the Biden administration.",
    "Thiel reappeared in political circles.",
    "In 2020, he stayed on the sidelines.",
    "Thank you for reading the Herald.",
    "This article is complimentary.",
    "His backing may not be enough.",
    "Vance in Ohio.",
    "Hide content"
  ]
}