{
  "id": 5226,
  "mediaId": 2742,
  "date": "2022-02-13",
  "headline": "MSM Frets That GOP/GAP Is Embracing “White Identity” Politics. But That’s What The Base Wants",
  "image": "https://vdare.com/public_upload/publication/featured_image/56907/E5F772E2-4C72-405B-A45F-F81BFAD22C7A.jpeg",
  "link": "https://vdare.com/articles/msm-frets-that-gop-gap-is-embracing-white-identity-politics-but-that-s-what-the-base-wants",
  "mediaOutlet": "VDARE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The administration’s recommendation that race and ethnicity be considered when deciding who gets the limited supply of new Covid drugs is the latest political talking points with which Republicans are hammering Democrats, looking to energize their base ahead of the midterm elections” [Republicans see political gold in Democrats' race-sensitive Covid drug guidance, by Alice Miranda Ollstein and Megan Messerly, January 25, 2022].",
    "The comments carry the echoes of racist messages that have proliferated in recent years—that Black people and other minorities are taking power, and that they will exact revenge on white people, or at the very least treat white people as they have been treated” [Trump tirade on ‘racist’ DAs echoes other racist tropes, by Bobby Caina Calvin, February 6, 2022].",
    "A 2020 think tank study of Trump voters found that they were primarily defined by their opposition to immigration and political correctness and their affinity for white identity [The National Populist Illusion: Why Culture, Not Economics, Drives American Politics, by George Hawley and Richard Hanania, CSPI, November 30, 2020].",
    "The former president seeded racial resentments in remarks that twisted the facts on public-health policy and exaggerated the effects of racially conscious antiviral treatment guidelines in New York” [AP FACT CHECK: Trump Seeds Race Animus With COVID Falsehood, by Calvin Woodward and David Klepper, January 16, 2022].",
    "Republicans are prioritizing Critical Race Theory as one of their prime midterm issues, and some have had the courage to say it’s nothing more than anti-white racism [Blake Masters: You Have To Be Able To Say “Critical Race Theory Is Anti-White Racism,” by Tim Hains, RealClearPolitics, January 23, 2022].",
    "This is well-known, and when not denying, the MSM either justifies it or encourages it—see a partial list of our coverage below:\nThe third bemoans Trump’s attack on progressive prosecutors—many of whom are black—who spend more time on his business dealings than on crime.",
    "A sample of what the Lügenpresse thinks is a fire bell in the night:\nThe Associated Press: “Donald Trump falsely declared in a weekend rally that public health authorities are denying the COVID-19 vaccine to white people because of their race.",
    "Whatever history shows, they insist, White people today represent its victims at least as much as Blacks and other minorities” [Led by Trump, GOP increasingly casts White people as racism's victims, by John Harwood, February 6, 2022].",
    "And they really don’t like complaints about President Biden’s crass promise that his first nominee for the U.S. Supreme Court must be a black woman, especially embarrassing because Affirmative Action is now on SCOTUS’ docket.",
    "Only 38 percent of Trump voters care about the much-hyped discrimination claims of non-whites [84 percent of Trump voters are worried about discrimination against whites, by Maureen Breslin, The Hill, October 8, 2021].",
    "So in just four or five years, Republican voters have awakened to reality [More than half of Republicans think minorities are favored over Whites in the United States, by Philip Bump, Washington Post, June 29, 2021].",
    "pic.twitter.com/ebaKIycQW5\n— Joshua Tait (@Joshua_A_Tait) February 7, 2022\nWhile the Leftist MSM mock the idea of anti-white discrimination, the vast majority of Republicans surveyed believe it’s a real problem.",
    "Only 20 percent of voters support it, while a third aren’t quite sure what it is [Poll: Nearly Half of Registered Voters Oppose Teaching of Critical Race Theory, by Susan Berry, Breitbart, November 16, 2021].",
    "They want white kids to learn to hate themselves, to put whites at the back of the line for health treatment, to discriminate against them in employment, and to open the borders to replace them.",
    "AP, again: “Trump’s diatribe left the clear impression that Trump, who rode the politics of white grievance into the White House, thinks he can’t possibly be treated fairly by Black officials.",
    "CNN: “[W]hat’s striking now, nine months before midterm elections, is how explicitly Trump and his GOP followers have embraced a theme that inverts the onus of racism in America.",
    "In every sector of policy—education, immigration, health care, even foreign affairs—Democrats emphasize that their policies will shaft whitey in favor of the great POC coalition.",
    "Several states have already done so, to the acclaim of voters [GOP sees ‘huge red wave’ potential by targeting critical race theory, by Liz Crampton, Politico, January 5, 2022].",
    "They publish Dem Talking Point “fact checks” about truthful claims that Democrat states discriminate against whites in distributing treatment for the China Virus.",
    "They must adopt and champion an immigration moratorium, an end to birthright citizenship, and more forcefully, challenge the erasure of American heritage.",
    "It’s all justified in the name of racial “equity.” But it’s nothing more than a nice way of saying they want to destroy the Historic American Nation.",
    "Here's a larger version of that chart above:\nEight-four percent of Trump voters say discrimination against whites is real and will greatly increase.",
    "The first two articles attacked Republicans for bringing attention to the various states that prioritize non-whites for virus treatment.",
    "Cucky pundits claimed non-whites made Youngkin governor, but the Republican candidate received unprecedented support from rural whites.",
    "The fourth focused on Republican criticism of Biden’s excluding whites from the pool of candidates to replace Justice Stephen Breyer.",
    "On nearly every issue dealing with immigration, voters were more likely to vote for Vance knowing that he is an immigration patriot.",
    "The GOP must do much more to show it’s the party of white Americans aka the party of the Historic American Nation.",
    "But Biden’s FDA recommended it, and according to Politico above, Biden’s CDC head Rochelle Walensky defended it.",
    "Republicans can hope for big victories if they oppose anti-white racism in the classroom and in public policy.",
    "Vance’s pollster found that the issues that most animate GOP primary voters deal with race and culture [J.D.",
    "“If you're a white guy, tough luck,” Texas Sen. Ted Cruz said of Biden’s message on his Supreme Court pick.",
    "At a rally in January, Trump said that whites face discrimination that puts them in the back of the line.",
    "A November poll found that nearly half of American voters want the CRT anti-white curricula banned.",
    "Anti-white identity politics is the glue that holds together the Democrat Party’s fringe coalition.",
    "Vance pollster issues warning on Ohio Senate race, by Alex Isenstadt, Politico, February 7, 2022].",
    "They wring their hands about Republican candidates and lawmakers who mention anti-white racism.",
    "The “Sailer Strategy,” named for VDARE.com’s great Steve Sailer, is a proven political winner.",
    "In contrast, in 2017 fewer than half of Republicans said minorities are favored over whites.",
    "Politico: “Republicans are accusing the Biden administration of racism—against white people.",
    "A strong majority of Trump voters also believe that non-whites are favored over whites.",
    "But the MSM does have a point about GOP rhetoric finally targeting anti-white racism.",
    "The MSM is right to fear that white identity politics will play well for Republicans.",
    "At least a dozen GOP-controlled state legislatures are aiming to ban CRT in schools.",
    "The GOP is reluctantly embracing White Identity politics—because it wins elections.",
    "The Leftist Mainstream Media is worried about a GOP/GAP wave this election cycle.",
    "These issues include punishing Sanctuary Cities and increasing deportations.",
    "Some on the Right spin Trumpism as Moynihanian ends by Buchananite means.",
    "Anti-CRT rhetoric won the Virginia gubernatorial race for Glenn Youngkin.",
    "They fret that Republicans are—gasp—embracing White Identity Politics.",
    "The plain fact is that the GOP base wants white identity politics.",
    "Campaigning against anti-white discrimination is a good sign.",
    "Washington Watcher II [Email him] is an anonymous DC insider.",
    "It must explicitly act for the benefit of white Americans.",
    "The anti-CRT messaging turned them out in record numbers.",
    "Apparently, you’re simply expected to accept all this.",
    "They shriek over attempts to ban Critical Race Theory.",
    "Anti-white hatred defines the Democratic coalition.",
    "Funny thing: the MSM is at least partly right.",
    "But here's what it looks like in practice.",
    "It’s the smart and natural thing to do.",
    "But the party must do more than talk.",
    "But it needs to go much further.",
    "Ohio Senate candidate J.D.",
    "The surveys show it."
  ]
}