{
  "id": 5316,
  "mediaId": 5308,
  "date": "2022-02-23",
  "headline": "Trump Thinks Putin Is a ‘Genius’ for Invading Ukraine",
  "image": "https://video-images.vice.com/articles/62164d3c2a2d7d0096693ee0/lede/1645628921509-putin-trump-ukraine-invasion.jpeg?image-resize-opts=Y3JvcD0xeHc6MC44NDI4eGg7MHh3LDAuMDUwM3hoJnJlc2l6ZT0xMjAwOiomcmVzaXplPTEyMDA6Kg",
  "link": "https://www.vice.com/en/article/m7vxqn/trump-putin-genius-ukraine-invasion",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Blest",
  "authorUrl": "https://www.vice.com/en/contributor/paul-blest",
  "termIds": [
    0
  ],
  "sentences": [
    "Minority Leader Kevin McCarthy and other House GOP leaders said in a statement that Biden “chose appeasement” with Russia and that “the U.S. and our allies must now make the Putin regime pay for this aggression.”\nThe official House Republican Twitter account also bewilderingly chose a photo of Biden leaving a press conference to depict “what weakness on the world stage looks like.”\n“Can’t believe Biden broke with presidential traditions by not moonwalking away from the lectern,” historian Kevin Kruse tweeted.",
    "It is not a pretty thing to watch!”\nGOP Rep. Liz Cheney, who’s been stripped of her institutional support from the party over her criticisms of Trump, claimed in a Wednesday tweet that Trump’s praise for Putin “aids our enemies.”\nTrump’s response to Putin invading Ukraine was echoed by Carlson Tuesday night, who suggested that, rather than hating Putin, his viewers should hate American liberals.",
    "Vance—the Harvard-educated venture capitalist, bestselling memorist, and subject of a Ron Howard movie who’s running as an anti-elitist, said last week that he doesn’t “really care what happens to Ukraine one way or the other.” Vance criticized “the obsession with Ukraine from our idiot leaders” which “serves no function except to distract us from our actual problems” in a Tuesday statement.",
    "Oh, that’s wonderful.”\nThe former president, never passing up an opportunity to contrast himself with President Joe Biden, the man who defeated him in 2020, claimed that Putin’s invasion of Ukraine was “not even thinkable” if he’d won the 2020 election.",
    "Russian President Vladimir Putin might have been hit with U.S. sanctions for sending troops to Ukraine, but he has at least a few allies left in the U.S.—namely, former President Donald Trump and Fox News host Tucker Carlson.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "Trump called Putin’s scheme to invade Ukraine “genius” in an interview with conservative talk radio hosts Clay Travis and Buck Sexton, a transcript for which was published Tuesday.",
    "Rep. Adam Kinzinger, another frequent critic of Trump and Carlson after he voted to impeach Trump twice, summarized Carlson’s monologue as: “Putin isn't your enemy.",
    "House Republicans, meanwhile, are taking the position—for now, anyway—that Putin is wrong to invade Ukraine and it’s wholly Biden’s fault that he did.",
    "“I mean, you know, he’s a tough cookie, got a lot of the great charm and a lot of pride… I think he sees this opportunity.",
    "But Trump also spoke warmly of his former counterpart in global politics, even going so far as to call Putin charming.",
    "“Before [the U.S. enters a conflict in Eastern Europe] it might be worth asking yourself… what is this really about?",
    "We used to talk about it at length.”\nTrump added in a Wednesday statement: “Putin is playing Biden like a drum.",
    "Your fellow American is.” Kinzinger called this line of thinking “beyond dangerous.”\nOhio Senate candidate J.D.",
    "Did he manufacture a worldwide pandemic that wrecked my business and kept me indoors for two years?”\nGOP.",
    "“I went in yesterday and there was a television screen, and I said, ‘This is genius,’” Trump said.",
    "“Putin declares a big portion of Ukraine, Putin declares it as independent.",
    "You’re not gonna do it.’ But I could see that he wanted it.",
    "Has he threatened to get me fired for disagreeing with him?",
    "Has he shipped every middle class job in my town to Russia?",
    "Want the best of VICE News straight to your inbox?",
    "Why do I hate Putin so much?” Carlson said.",
    "I knew that he always wanted Ukraine.",
    "“Has Putin ever called me a racist?",
    "I used to talk to him about it.",
    "I got along with him great.",
    "I said, ‘You can’t do it.",
    "I liked him,” Trump said.",
    "“I knew Putin very well.",
    "I used to ask him.",
    "Sign up here.",
    "He liked me."
  ]
}