{
  "id": 5327,
  "mediaId": 2886,
  "date": "2022-02-23",
  "headline": "On Borders Worth Defending",
  "image": "https://www.theamericanconservative.com/wp-content/uploads/2022/02/GettyImages-1372166456-scaled-e1645566731992.jpg",
  "link": "https://www.theamericanconservative.com/articles/only-ukrainians-are-ukrainians-still/",
  "mediaOutlet": "The American Conservative",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "I have wanted to join the military, perhaps even more often and more ardently than most American boys who never do, but I will not pretend it is high school tours of the service academies or books about special operations borrowed from the local library that license me to write this column.",
    "Vance, author of Hillbilly Elegy and a candidate for Senate in Ohio, made many of the usual suspects mad over the weekend when, asked why the Beltway establishment cares so much about Ukraine’s eastern border and so little about America’s southern border, he made the above clear.",
    "But such childishness should come as no surprise, since it is pudding-like statements referring to the Sudetenland and Chamberlain and (the big one) “appeasement” that, passed about with smug self-satisfaction, raise the prospect of war in the first place.",
    "With this love for the place there goes a love for the way of life; for beer and tea and open fires, trains with compartments in them and an unarmed police force and all the rest of it; for the local dialect and (a shade less) for our native language.",
    "Lewis writes,\nFirst, there is love of home, of the place we grew up in or the places, perhaps many, which have been our homes; and of all places fairly near these and fairly like them; love of old acquaintances, of familiar sights, sounds and smells.",
    "And soon after, to conclude an already meandering column with the suggestion that you read this with the Russian view in mind and not only the western Ukrainian, Lewis writes:\nOf course patriotism of this kind is not in the least aggressive.",
    "There is no inconsistency to wanting the free movement of people and money—national sovereignty, domestic security, and per capita productivity and real wages be damned—and seeing authoritarian Putin’s probing of the hinterland as a threat.",
    "But globalism has made a joke and a catastrophe of the Rio Grande, and nothing in our recent record as a nation inspires confidence that we can give appropriate care to both that crisis and one an ocean and continent away.",
    "I read the same section as suggesting very nearly the opposite, that though of course we may sympathize with and have compassion for Ukrainians in the midst of war, indeed our focus should remain on the local first of all.",
    "Russian recognition of independent republics in disputed territory is a cunning reversal of the American-led international community’s playbook, and like everyone else I wait with bated breath to see what will come next.",
    "While he demands to negotiate with us directly, because for now the Europeans still fall in line, Putin is not testing the United States of America here, but arrangements we presided over only decades old.",
    "David French joined the pile-on contra Vance with an essay claiming “We’re All Ukrainians Now.” A healthy patriotism, he alleges, “helps us extend our compassion and concern” all the way to the Donbas.",
    "Rather than parse French I’ll let Lewis speak for me and for himself in a few sections, though of course you ought to read the whole thing and consider him in his own context.",
    "It is not just that we are wrong to think the Biden Administration and the Washington establishment want a war, it is unpatriotic to think it would be a bad thing if they did.",
    "It has all been dismissed out of hand by historical myopics, and Russia presumed an enemy, not a great power rival with its own national interests and sphere of influence.",
    "Here we see the unselfconscious Schmittianism at the heart of the liberal project on full display, like the titular honesty of Karl Popper’s Open Society and Its Enemies.",
    "Russia is a security threat to America because it is a nuclear power with control of vital natural resources and its own national agenda, not because it is illiberal.",
    "We paleocons or right-wingers or—gasp—American nationalists are tilting at windmills, burning strawmen, boxing with shadows when we say the war party is back at it.",
    "But those who do not love the fellow-villagers or fellow-townsmen whom they have seen are not likely to have got very far towards loving “Man” whom they have not.",
    "When we hear drums, we are only revealing our paranoia, and any drum beats that might really be hanging in the air, undeniable, are actually Putin’s anyway.",
    "This is a childish sophistry, which suggests that since Simon didn’t say “America must go to war with Putin,” in so many words then it hasn’t been said.",
    "Priorities must be made, and Vance is right that American leaders have a responsibility first of all to their fellow citizens here at home.",
    "Havoc is seen in each pointed dismissal of Russian attempts at diplomacy and repeated White House claims of imminent full scale invasion.",
    "Putin is surely a threat to the liberal international order, and his meddling in Ukraine is a direct confrontation of global liberalism.",
    "Once you have realised that the Frenchmen like cafe complet just as we like bacon and eggs why, good luck to them and let them have it.",
    "Before joining TAC he served as White House Liaison at the U.S. Environmental Protection Agency, and assisted in speechwriting there.",
    "Only foreigners and politicians talk about “Britain.” Kipling’s “I do not love my empire’s foes” strikes a ludicrously false note.",
    "Of course it is not pure charity; it involves love of our neighbours in the local, not of our Neighbour, in the Dominical, sense.",
    "In a saner United States, immigration would be orderly, the movement of people restricted according to the law—the law enforced.",
    "A funny bit of casuistry has begun to pop up here and there, especially among self-described conservatives of a globalist tinge.",
    "Putin has given his red lines—a NATO member Ukraine, missiles too close to Moscow, et al.—and made his civilizational case.",
    "And only a little later:\nIt would be hard to find any legitimate point of view from which this feeling could be condemned.",
    "As Vance said, he and working class white men like him did not join the Marines to fight for transgender rights in Russia.",
    "It is not our border that is under dispute, and it is, crucially, not a NATO member state that has been intervened in.",
    "As the family offers us the first step beyond self-love, so this offers us the first step beyond family selfishness.",
    "I am not so naive as to think the Swamp intends to cry to me directly when it decides to let slip the well-fed dogs.",
    "Micah hails from the Pacific Northwest, and like Odysseus hopes to return home someday after long exile in the East.",
    "That means right now the border he cares about is in Texas, because Mexican fentanyl is killing his neighbors.",
    "I just write as an American citizen, and since we do have civilian oversight of the military, that’s allowed.",
    "He holds an MA in social science from the University of Chicago, where he wrote on political theory.",
    "This is his second stint at TAC, as not so long ago he was an editorial assistant for the magazine.",
    "This choice between borders shouldn’t be necessary, but liberal internationalists force us to pick.",
    "In any mind which has a pennyworth of imagination it produces a good attitude towards foreigners.",
    "Then we might consider the significance of Ukraine’s national sovereignty, confident in our own.",
    "To buttress that conclusion French selectively contorts a typically excellent passage from C.S.",
    "I open with that admission because it is not entirely irrelevant to a discussion such as this.",
    "How can I love my home without coming to realise that other men, no less rightly, love theirs?",
    "But while Putin and Russia are illiberal, as of yet none of these actions are anti-American.",
    "Note that at its largest this is, for us, a love of England, Wales, Scotland, or Ulster.",
    "That is, obviously, both what Ukrainian separatists and Russian leaders are up to, too.",
    "He is also a 2021-22 Robert Novak journalism fellow for the Fund for American Studies.",
    "about the author\nMicah Meadowcroft is managing editor of The American Conservative.",
    "His BA is in history from Hillsdale College, where he also minored in journalism.",
    "The last thing we want is to make everywhere else just like our own home.",
    "“At the end of the day, we served to defend our own country,” Vance said.",
    "Previously, he worked as associate editor of the Washington Free Beacon.",
    "Don't believe the lies told by those who beat the drums of war.",
    "Ethos is, after all, a core piece of classical rhetoric.",
    "No one, we are told, is advocating for war with Russia.",
    "It becomes militant only to protect what it loves.",
    "It would not be home unless it were different.",
    "Putin, you see, is a very bad man.",
    "But it is not American patriotism.",
    "I’m not a soldier, never was.",
    "It asks only to be let alone.",
    "This is liberal empire.",
    "Lewis’s The Four Loves.",
    "I didn’t serve.",
    "Not a whit.",
    "My empire!",
    "J.D."
  ]
}