{
  "id": 5336,
  "mediaId": 3987,
  "date": "2022-02-23",
  "headline": "The Ohio GOP Senate Primary has Turned into One Expensive, Nasty Slugfest Filled with Dangerous Xenophobic Lies",
  "image": "http://americasvoice.org/wp-content/uploads/2022/01/GOP-1200x800.png",
  "link": "https://americasvoice.org/blog/the-ohio-gop-senate-primary-has-turned-into-one-expensive-nasty-slugfest-filled-with-dangerous-xenophobic-lies/?utm_source=rss&utm_medium=rss&utm_campaign=the-ohio-gop-senate-primary-has-turned-into-one-expensive-nasty-slugfest-filled-with-dangerous-xenophobic-lies",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Mueller",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In one tweet, Timken falsely asserted that Democrats are “allowing a border invasion of epic proportion to continue unmitigated and unresolved.” Timken has also made it a point to appear on Steven Bannon and Seb Gorka’s radio shows, both of whom have a long, public history flirting with white nationalism and the “replacement theory.”\nMatt Dolan is an independently wealthy candidate, who loaned his campaign $10.5 million of his own money.",
    "His most recent TV ad focuses solely on the spurious connection between fentanyl and the “border crises.” In the ad Dolan falsely asserts “because of Joe Biden, fentanyl, cartels, pour across our border, our national sovereignty is at risk.” Contrary to Dolan’s suggestion, almost none of the Fentanyl or other drugs that enter the U.S. are on the bodies of asylum seekers or others entering the country between ports of entry.",
    "This is an out-of-control invasion at our border.” Gibbons also made a more subtle pass the “great replacement” in one of his TV ads where he falsely claims “this year 2 million illegal immigrants will enter America bringing drugs, crime, COVID, and what Democrats want most, their votes.” Images from that temporary refugee encampment appear as the visual backdrop for this part of the political ad.",
    "https://t.co/mLcxqsvFdN\n— Veronica Escobar (@vgescobar) February 16, 2022\nAnd as Rep. Joaquin Castro reminded us that the problem is not contained to Ohio but a much deeper problem running throughout the party and rearing its ugly head in the politics in other states as well, writing:\nReplacement theory, invasion rhetoric has gotten people killed.",
    "The invasion he’s allowing to happen at the border is about power for democrats and nothing more.” This nearly full recitation of the “great replacement” and the shared commitment to this racist delusion should raise concerns across the board for what this says about the Republican party and what it means for our county.",
    "The following month, Mandel appeared on OAN, the far-right wing network, to push the same racist conspiracy theory, falsely claiming: “This is a coordinated…strategic invasion of our country to take our jobs, to change demographics, for voting purposes, and to bring down America.” He hasn’t backed off this line.",
    "This is a Biden-backed, Soros-funded, Obama-coordinated invasion of America.” It should be noted that almost all those migrants in this so-called “invasion” were swiftly deported to Haiti without being able to ask for asylum, one of the most shameful chapters during the Biden administration so far.",
    "On January 27, 2022, he again repeated this false but dangerous conspiracy theory saying: “this is an invasion, and I think when history is told we told it was funded by Soros, orchestrated by Obama, and the Obama alumni association, and enabled by Joe Biden.”\nMandel isn’t alone.",
    "From Charlottesville, Virginia in 2017 to Pittsburgh, Pennsylvania in 2018 to El Paso, Texas in 2019 to the United States Capital in 2021, we have seen the deadly effects of letting conspiracy theories and racist lies go unchallenged.",
    "In late September 2021, as refugees from Haiti fleeing sought safety in the US after a presidential assassination and back-to-back natural disasters that killed thousands, Mandel tweeted: “This is not a Biden failure.",
    "While Dolan is the only candidate who to our knowledge hasn’t employed “invasion” rhetoric, it is still early and Dolan is still running on xenophobic dog-whistles about the border that are divorced from reality.",
    "Before the shooting, which left eleven people dead and six injured, the shooter wrote on social media, “HIAS [a Jewish organization that provides aid to refugees] likes to bring invaders in that kill our people.",
    "Vance even suggested the need for military violence tweeting: “Send in the Marines.”\nJane Timken, the former party chair for the state party, received the endorsement of retiring Senator Rob Portman last week.",
    "It’s a race to the bottom, and there are too many Republican candidates across the country spewing this vile and xenophobic language without any concerns for ramifications beyond appealing to their base.",
    "Without a clear frontrunner for the May primary, several well-financed Republican Senate candidates are in a race to see who can spew the most xenophobic-based venom to generate fear and misinformation.",
    "Unfortunately, instead of rejecting dangerous and violence-inspiring rhetoric, this year Republican candidates up and down the ballot have adopted that “invasion” message into their campaigns.",
    "Vance, tweeted later that same day “Biden has looked at his approval ratings and realizes that the only way to win in ‘24 is to replace the citizens of his own country with illegal foreigners.",
    "The embrace of the “great replacement” and “invasion” rhetoric isn’t an issue anyone should wave off as an all too predictable bombastic language of a Republican primary in a Trumpian party.",
    "Screw your optics, I’m going in.” A similar racist conspiracy theory about an “invasion” was the motivation of another shooter in El Paso, Texas in August of 2019 that left 23 people dead.",
    "One MILLION illegal border crossings isn’t a “challenge.” It’s an INVASION.” Moreno also took to Twitter to applaud both Timken, Mandel, and Vance for using “invasion” language.",
    "When Republicans suggest otherwise, it displays a striking ignorance of the sophistication of the illicit drug trade and reveals they are only trying to score political points.",
    "In October of 2018, a gunman who believed an invasion of immigrants was underway opened fire at a synagogue in Pittsburgh, which is just a short drive from the Ohio border.",
    "Last Thursday, Timken tweeted “Joe Biden is in Ohio trying to distract from his disastrous agenda, but he should be addressing this invasion at the Southern Border.",
    "Then there is Bernie Moreno, who has already dropped out of the race but not before spending millions of dollars peddling the “great replacement” to Ohioans.",
    "Words have powerful consequences, deadly even, and those who serve in public office (or seek it) should have the decency to run on policies instead of hate.",
    "“Stop the invasion,” Josh Mandel, the former state treasurer and one of the leading candidates in the Ohio Republican Senate primary tweeted on February 16.",
    "This theory absurdly believes there is a coordinated effort of non-white migrants currently invading the southern border that will replace white America.",
    "In one ad Moreno claimed “illegals come for the freebies, free money from Biden, take your job, free passes for crime because Democrats want their vote.",
    "As Rep. Veronica Escobar, who represents El Paso, wrote on Twitter last week:\nThe replacement theory isn’t just hateful and xenophobic— it’s dangerous.",
    "Mike Gibbons, an investment banker, also adopted the “invasion” language back in September around the temporary influx of Haitian refugees.",
    "No stranger to this language, Timken started employing it last September and repeatedly fretted about the “invasion” on Twitter.",
    "In past weeks, America’s Voice has documented the dangerous rhetoric being pushed by Republican candidates in Arizona and Texas.",
    "62,573 migrants were released into the U.S. just last month alone.” That is equivalent to the population of Youngstown, Ohio!",
    "No doubt, the GOP Senate candidates know full well that their rhetoric is dangerous and has the potential to incite violence.",
    "Dolan has used his wealth to flood the media markets with ads to boost his name recognition throughout the state.",
    "Of note, Mandel is the grandson of Holocaust survivors who were aided by resettlement organizations like HIAS.",
    "But Vance, like his other primary challenges, has been peddling this racist conspiracy since last September.",
    "It makes American society more dangerous for historically-targeted groups — Latinos, blacks, Jews, Muslims.",
    "https://t.co/td9nnuIQ4m\n— Joaquin Castro (@JoaquinCastrotx) February 16, 2022\nEscobar and Castro are right.",
    "They are changing our nation, let’s stop them.” He also ran Facebook ads reading “Kamala Harris is wrong!",
    "This vile and dangerous rhetoric is on full display in the Ohio GOP Senate primary being held on May 3rd.",
    "There is, however, a real danger here, it just comes from the amplification of this conspiracy theory.",
    "Not wanting to be outdone when it comes to racist rhetoric, one of Mandel’s primary opponents, J.D.",
    "Timken, however, is also courting the nativist base and is amplifying “great replacement” rhetoric.",
    "Gibbons suggested the need for military force, tweeting: “Time to send in the National Guard.",
    "And no one in the Republican party stands up to them because this is what their party is.",
    "The “invasion” Mandel evoked is more of a racist fever dream than any real threat.",
    "In this report, we examine the messages that have dominated the Ohio Senate race.",
    "They are bringing drugs and god-knows-what else into your neighborhood.",
    "Yet Texas Republicans are shamelessly scapegoating immigrants.",
    "And Mandel has made it a central part of his campaign.",
    "I can’t sit by and watch my people get slaughtered.",
    "But, none of that matters in today’s GOP.",
    "That’s what happened in El Paso in 2019."
  ]
}