{
  "id": 5372,
  "mediaId": 2651,
  "date": "2022-02-15",
  "headline": "CBS 60 Minutes: Lesley Stahl Slammed For Lying In Unearthed Trump Interview After Durham Report",
  "image": "https://gellerreport.com/wp-content/themes/pamela-geller/assets/img/samples/ground-zero-mosque.jpg",
  "link": "https://gellerreport.com/2022/02/cbs-60-minutes-lesley-stahl-slammed-for-lying-in-unearthed-trump-interview-after-durham-report.html/",
  "mediaOutlet": "pamelageller.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Geller Report Staff",
  "authorUrl": "https://gellerreport.com/author/geller-report-staff/",
  "termIds": [
    1395,
    1902,
    2040,
    2201,
    2434,
    3975,
    4609,
    189
  ],
  "sentences": [
    "pic.twitter.com/1i4mW2YcQk\n— Donald Trump Jr. (@DonaldJTrumpJr) February 13, 2022\nLesley Stahl Slammed for Unearthed Trump Interview After Durham Report\nBy Newsmax, February 15, 2022\nLesley Stahl, a correspondent for CBS’ “60 Minutes,” is receiving backlash over an unearthed interview with Donald Trump in which she dismissed claims that the former president was spied on during his 2016 campaign.",
    "It’s all over the place,” Trump said as Stahl quickly shot back with a defiant “No.”\nThe back and forth continued until Stahl reiterated once more that she disapproved of Trump’s comments and “didn’t know” if what he said was true.",
    "They refused to report on Hilary Clinton spying, Hunter Biden’s laptop, Tara Reade’s sexual assault claims against Joe Biden, Joe Biden’s mental decline, and many other material stories.",
    "The backlash comes after new allegations by special counsel John Durham in the inquiry into the origins of the Russia investigation gjzg support the former president’s suspicions.",
    "In the October 2020 interview, Trump declared that “the biggest scandal was when they spied on my campaign.”\n“There is no real evidence of that,” Stahl responded.",
    "I say all the time: Trump’s greatest accomplishment is not any particular policy, but revealing the corruption at the heart of our institutions,” said J.D.",
    "“As a matter of fact, I don’t know that.”\n“Lesley Stahl should apologize to Donald Trump,” Trump’s son Eric Trump said Sunday on Twitter.",
    "Do you guys ever wonder what else they are lying to you about or pretending that there is “no evidence to come to that conclusion” about?",
    "And you will see that, Lesley, and you know that, but you just don’t want-,” Trump said before Stahl interjected.",
    "That is because the media’s objective is to help the Democrats defeat and destroy their opposition.",
    "The mainstream media aided the Democrat Party in 2020 to take down President Trump.",
    "“Her first response is ‘there’s no real evidence of that.’ Incredible.",
    "“Then they went much further than that, and they got caught.",
    "Vance, a Republican candidate for U.S. Senate in Ohio.",
    "When will Lesley Stahl apologize to President Trump?",
    "Presenting the facts meant nothing to them.",
    "“Of course there is.",
    "The answer is never.",
    "Or to her viewers?",
    "“No,” she said."
  ]
}