{
  "id": 5407,
  "mediaId": 2650,
  "date": "2022-02-17",
  "headline": "Sen. Portman Endorses Jane Timken in Ohio Senate Race",
  "image": "https://media.townhall.com/townhall/reu/o/2021/49/f47e875b-f148-4ff6-a658-51c7a9a0447c-1110x740.jpg",
  "link": "https://pjmedia.com/news-and-politics/rick-moran/2022/02/17/sen-portman-endorses-jane-timken-in-ohio-senate-race-n1559965",
  "mediaOutlet": "Pajamas Media ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rick Moran",
  "authorUrl": "https://pjmedia.com/columnist/rick-moran",
  "termIds": [
    0
  ],
  "sentences": [
    "“I am confident in her ability to win both the primary and the general elections, ensuring that this Senate seat remains Republican with a 50-50 Senate, and so much at stake.”\nPortman’s endorsement comes after he announced last year that he would not be seeking reelection for a third term.",
    "Dolan accused the former president of “perpetuat[ing] lies about the outcome” of the 2020 election and called the pro-Trump Jan. 6 Capitol riot “a failure of leadership.”\nBut Trump is treading cautiously.",
    "With so many MAGA candidates, the pro-Trump vote will undoubtedly splinter, giving a mega-wealthy candidate like Dolan a possible avenue to victory.",
    "Trump convinced Cleveland businessman Bernie Mareno to drop out of the race earlier this month; there were already too many MAGA candidates.",
    "Rob Portman just gave a much-needed boost to the candidacy of former state Republican Party chair Jane Timken by endorsing her primary bid.",
    "Timken has been languishing in fifth place, polling just 9.8% of the vote, while former state treasurer Josh Mandel leads the field at 21%.",
    "The former prosecutor, whose family owns Major League Baseball’s Cleveland Indians … er, “Guardians” — has irked Trump with his criticisms.",
    "The race for the GOP nomination to replace him has grown into one of 2022’s most crowded, featuring Timken, “Hillbilly Elegy” author J.D.",
    "He shouldn’t hold his breath; Mandel, Gibbons, and Vance are all extremely well funded and would have no reason to drop out.",
    "Perhaps later in the spring, the situation on the ground in Ohio will clear up enough that Trump can make his endorsement.",
    "He’s sitting comfortably on the sidelines waiting for the situation to clarify itself in advance of the May 3 primary.",
    "Indeed, all but one of the major candidates remaining have been doing a mating dance, trying to get Trump’s blessing.",
    "Meanwhile, the pro-Trump candidates continue their mating dances, hoping to get Trump’s election-winning endorsement.",
    "So, for the moment, Trump is biding his time, hoping the situation resolves itself as some MAGA candidates drop out.",
    "Donald Trump is not going to make an endorsement in the crowded Ohio Republican Senate primary — at least not yet.",
    "Politico:\n“Jane is smart and hard working, and understands the needs of Ohioans,” [Portman] also said.",
    "Vance, former state treasurer Josh Mandel, state Sen. Matt Dolan and investment banker Mike Gibbons.",
    "Trump is a good enough politician to know you don’t get in the middle of a food fight.",
    "Dolan is the only candidate who hasn’t actively sought Trump’s endorsement.",
    "Investment banker Mike Gibbons is at 16.4%, Hillbilly Elegy author J.D.",
    "And Timken just got a shot in the arm with the Portman endorsement.",
    "Vance stands at 14.3%, and state senator Matt Dolan is at 10%.",
    "Others aren’t as reluctant to enter the fray.",
    "But he is influencing the race nonetheless.",
    "Retiring Sen."
  ]
}