{
  "id": 5425,
  "mediaId": 2818,
  "date": "2022-02-23",
  "headline": "From ‘America First’ To ‘Blame America First’ | David Thornton",
  "image": "https://tf-a1.azureedge.net/uploads/2022/02/hat-600x315.jpg",
  "link": "https://www.thefirsttv.com/from-america-first-to-blame-america-first-david-thornton/",
  "mediaOutlet": "theresurgent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Thornton",
  "authorUrl": "https://www.thefirsttv.com/author/dthornton/",
  "termIds": [
    0
  ],
  "sentences": [
    "Trump’s comments came in a radio interview with Clay and Buck (for full disclosure, Buck Sexton is also carried by The First) :\nI went in yesterday and there was a television screen, and I said, “This is genius.” Putin declares a big portion of the Ukraine — of Ukraine.",
    "Vance claimed that Biden’s conflict with Putin was over “transgender rights,” rather than an invasion and made the honest admission that he doesn’t “really care what happens in Ukraine one way or the other.” This is MAGA isolationism put into practice.",
    "But here’s a guy that says, you know, “I’m gonna declare a big portion of Ukraine independent,” he used the word “independent,” “and we’re gonna go out and we’re gonna go in and we’re gonna help keep peace.” You gotta say that’s pretty savvy.",
    "Few people outside Putin’s circle believe that the Ukrainian provinces want their independence which, mark my words, will be very brief and quickly followed by domination by Russia, if not outright annexation.",
    "Does he eat dogs?”\nTucker provides that the answer to these questions is no but fails to mention that the answer is also a no to most of these questions for most other people in the world as well.",
    "The Biden Administration was involved in Germany’s cancellation of the Nord Stream 2 pipeline after Biden warned weeks ago that the pipeline would be brought “to an end” if Russia invaded.",
    "Still, the quote seems apropos for the right-wing MAGA pundits who taking up their microphones and keyboards to defend Vladimir Putin from the consequences of his actions.",
    "That’s why he doesn’t want Ukraine to join NATO, and that makes sense.”\nPutin wants to secure his borders at the expense of making Ukrainian and NATO borders insecure.",
    "If you read the text of his comments, the tone could be taken in different ways but listening to the clip makes it clear that Trump was really admiring Putin’s style.",
    "A third possibility, that Trump would use military force to patrol the border is illegal under US laws that prohibit using the military for civilian law enforcement.",
    "As I pointed out yesterday, that was always a dubious proposition at best and by last night, Trump was praising Putin for his “genius” in launching the invasion.",
    "On Tuesday morning, Twitter was aflame with Republicans claiming that Putin would not have dared to invade Ukraine if The Former Guy was the current guy.",
    "To someone like Trump, Putin may seem like a genius, but the idea of “declaring a big portion of Ukraine independent” isn’t exactly rocket science.",
    "To the MAGA crowd, Biden is the Worst Person in the World and the enemy of my enemy is my friend, even if my enemy’s enemy is a murderous dictator.",
    "It was his way of criticizing leftists who ignored the failings and problems of various regimes to point out flaws in American policy and allies.",
    "It is the antithesis of making America great to have it withdraw from the world stage and bear the blame for a dictator’s unilateral aggression.",
    "This one was believed to have been coined by Marx or Lenin, but actually seems to have originated with Bogdan Raditsa, a Yugoslav communist.",
    "As Russian tanks roll across the border of a sovereign nation, Tucker asks the hard questions such as, “Has Putin ever called me a racist?",
    "The other is that he’d like to follow Putin’s example and declare Mexican border areas independent so he could send in American soldiers.",
    "There’s a saying that “to find out who rules over you, simply find out who you are not allowed to criticize.” Voltaire did not say this.",
    "Fresh from the Afghanistan debacle, MAGA would have us make the same error in abandoning our ally and ignoring our treaty commitments.",
    "Few isn’t to say no one, however, because yesterday Candace Owens was seen on Twitter retweeting literal Russian propaganda as truth.",
    "It isn’t clear what Trump meant by “We could use that on our southern border,” but there are two possibilities and they are both bad.",
    "Over the last few days, that invasion has kicked off and domestic Republicans have been given their MAGA talking points on the issue.",
    "I don’t think it fits the definition of the word “genius.” A better description would be devious or sly or even transparently false.",
    "But that makes it all the more ironic when MAGA Republicans start siding with Putin’s Russia to blame America for Ukraine’s woes.",
    "We shouldn’t hate Putin, he says, but he seems to suggest that we should hate other Americans who hold different political views.",
    "Putin didn’t call me a racist so Putin must therefore be okay, his aggressive invasion of a peaceful country notwithstanding.",
    "That could set the stage for a much wider conflict in which Tucker Carlson did have to concern himself with Belgium’s fate.",
    "The satirical account, Darth Putin, succinctly skewers Owens deflates her argument, which relies entirely on Putin’s word.",
    "The Biden Administration also moved quickly to label Russia’s “peacekeepers” as invaders and to slap sanctions on Russia.",
    "The MAGA support for Putin may be both economic and ideological, but I think it is political expedience in large part.",
    "As I’ve pointed out in the past, few prominent Republicans have spoken out against the impending invasion of Ukraine.",
    "As a result, I think we are going to see fewer and fewer members of the GOP actively opposing Putin’s aggression.",
    "The laundry list of alarmist claims is largely fabricated and nonexistent although there are traces of truth.",
    "Some people do eat dogs and employers in at-will states can fire people who disagree with them, for example.",
    "Only this time, abandoning Ukraine would put Putin’s armies on the border of NATO allies and Western Europe.",
    "The phrase is “useful idiots.”\nThe First TV contributor network is a place for vibrant thought and ideas.",
    "For those of us who used to listen to Rush Limbaugh, the term Blame America First is a familiar one.",
    "Get the best news and videos delivered directly to your inbox every morning with the Up First email!",
    "Did he manufacture a worldwide pandemic that wrecked my business and kept me indoors for two years?",
    "It often seems that Donald Trump makes fools of his defenders and that was the case yesterday.",
    "She completely skips blaming Ukraine for being invaded by Russia and says the US is at fault.",
    "Tucker’s rant is another version of the Blame America First mentality on the modern right.",
    "In fact, I recently learned that the quote is attributed to a neo-Nazi named Kevin Strom.",
    "Republicans who eschew the mainstream media might never hear of these actions, however.",
    "One is that he’d like to have Russian “peacekeepers” patrolling our border with Mexico.",
    "Opinions expressed here do not necessarily reflect those of The First or The First TV.",
    "Vladimir Putin is on the march and Republicans have received their marching orders.",
    "As I pointed out last week, Tucker is okay with Putin invading just a little bit.",
    "In four short years, Owens went from “America First” to Blame America First.",
    "To me, Trump sounds almost wistful in a “wish I could do that” sort of way.",
    "I don’t know if Rush coined the term, but he did make frequent use of it.",
    "So, Putin is now saying, “It’s independent,” a large section of Ukraine.",
    "I said, “How smart is that?” And he’s gonna go in and be a peacekeeper.",
    "That’s strongest peace force… We could use that on our southern border.",
    "You can’t simultaneously make America great and make it a scapegoat.",
    "We want to foster dialogue, create conversation, and debate ideas.",
    "Finally, Trump was wrong that there was no response from Biden.",
    "Is he teaching my children to embrace racial discrimination?",
    "Has he threatened to get me fired for disagreeing with him?",
    "Has he shipped every middle-class job in my town to Russia?",
    "He “does not want Belgium,” Carlson opined a few weeks ago.",
    "Some will argue that Trump wasn’t actually praising Putin.",
    "Reach out to the author or to us at ideas@thefirsttv.com.",
    "Here’s a guy who’s very savvy… I know him very well.",
    "By the way, this never would have happened with us.",
    "Never miss an important story or a must-see moment.",
    "Another misattributed phrase comes to mind as well.",
    "“He just wants to keep his western borders secure.",
    "The implication of Tucker’s words is even worse.",
    "Especially if the dictator is half a world away.",
    "That’s the strongest peace force I’ve ever seen.",
    "There were more army tanks than I’ve ever seen.",
    "Some definitely seem to have sold out to Putin.",
    "Meanwhile, in the Ohio Republican primary, J.D.",
    "And you know what the response was from Biden?",
    "Nothing wrong with that according to Tucker!",
    "Many of his criticisms were richly deserved.",
    "Had I been in office, not even thinkable.",
    "Is he trying to snuff out Christianity?",
    "See something you like or don’t like?",
    "Let’s worry about Canadian tyranny!",
    "They’re gonna keep peace all right.",
    "Putin declares it as independent.",
    "That’s another shaky proposition.",
    "And maybe those who eat dogs too.",
    "And then there’s Tucker Carlson.",
    "This would never have happened.",
    "They didn’t have one for that.",
    "There was no response.",
    "Is he making fentanyl?",
    "Oh, that’s wonderful.",
    "No, but think of it.",
    "Nothing to see here.",
    "No, it’s very sad.",
    "Very, very well.",
    "Move along.",
    "Very sad."
  ]
}