{
  "id": 5553,
  "mediaId": 2572,
  "date": "2022-02-03",
  "headline": "Biden repeats debunked Second Amendment cannon claim, says 'no amendment is absolute'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/Joe-Biden-Police-Funding.jpg",
  "link": "https://www.foxnews.com/politics/biden-repeats-debunked-second-amendment-claim-says-no-amendment-absolute",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3560,
    3975,
    877,
    1094
  ],
  "sentences": [
    "BIDEN, AHEAD OF NYC VISIT, ROLLS OUT STRATEGY TO STOP FLOW OF GUNS, BOLSTER LAW ENFORCEMENT\nBiden has been criticized for using the same cannon example in the past and earned \"Four Pinocchios\" from the Washington Post in 2021 over the claim and also a \"False\" label from Politifact in 2020.",
    "#2A\"\n\"Someone didn't read the Second Amendment,\" Fox News contributor Dan Bongino’s website, the Bongino Report, posted along with an article stating that Biden’s comments should \"terrify\" gun owners.",
    "President Joe Biden said Thursday that \"no amendment is absolute\" while discussing the Second Amendment and repeated a debunked claim that cannons were prohibited when the amendment was passed.",
    "\"There’s no violation of the Second Amendment right,\" Biden said in New York City while discussing background checks and other ways to address gun crime.",
    "Additionally, Biden received backlash on Twitter from gun rights advocates who took issue with his claim that the Second Amendment is not \"absolute.\"",
    "\"Biden targets law-abiding gun owners, saying ‘there's NO amendment that's absolute!’\" a Republican National Committee Twitter account posted.",
    "Despite being fact checked by PolitiFact and WaPo, Biden keeps lying to the American people as he attempts to undermine the Second Amendment.\"",
    "You couldn’t buy a cannon when this amendment was passed so there’s no reason why you should be able to buy certain assault weapons.",
    "\"I stand ready to defend Texas against any infringement of our Second Amendment his failed administration will throw at us.",
    "In Biden’s speech, he also drew ire from conservatives by claiming that a \"Glock with 40 rounds\" is a \"weapon of war.\"",
    "When the amendment was passed it didn’t say anybody can own a gun, any kind of gun, and any kind of weapon.",
    "\"Actually, @JoeBiden, the 2nd Amendment is absolute,\" oil executive and author Dan K. Eberhart tweeted.",
    "\"Joe Biden is saying the quiet part out loud,\" Texas Attorney General Ken Paxton tweeted.",
    "\"Between this and the illegal ATF database, he’s declared war on the Second Amendment.\"",
    "The White House did not immediately respond to a request for comment from Fox News.",
    "Vance, who is running for Senate in Ohio as a Republican, tweeted.",
    "\"It's part of the Constitution, whether you like it or not.\"",
    "\"It was a lie in 2020,\" Townhall’s Spencer Brown tweeted.",
    "\"Biden is the worst gun grabber in decades,\" author J.D.",
    "There’s no amendment that’s absolute.",
    "But that’s another issue.\"",
    "It's still a lie today.",
    "\"It was a lie in 2021.",
    "\"We talk like."
  ]
}