{
  "id": 5615,
  "mediaId": 2553,
  "date": "2022-02-10",
  "headline": "Silicon Valley Mega Investor Leaving Meta’s Board For GOP Politics: Report",
  "image": "https://dw-wp-production.imgix.net/2022/02/Peter-Thiel.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/silicon-valley-mega-investor-leaving-metas-board-for-gop-politics-report",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Pearce",
  "authorUrl": "https://www.dailywire.com/author/tim-pearce",
  "termIds": [
    2979,
    3466,
    4595,
    364,
    878,
    1171
  ],
  "sentences": [
    "“Peter has been a valuable member of our board and I’m deeply grateful for everything he has done for our company – from believing in us when few others would, to teaching me so many lessons about business, economics, and the world,” Meta founder and CEO Mark Zuckerberg said in a statement.",
    "Narya was co-founded by Vance and Colin Greenspon, and by Thiel, who is also a Narya investor, “in a personal capacity.”\nThe amount of money in the deal was not shared, but a source familiar with the deal told the Journal that the investment was significant.",
    "I’m grateful he’s served on our board for as long as he has, and I wish him the best in his journey ahead.”\nThiel said: “It has been a privilege to work with one of the great entrepreneurs of our time.",
    "As The New York Times reports:\nMr. Thiel, 54, wants to focus on influencing November’s midterm elections, said a person with knowledge of Mr. Thiel’s thinking who declined to be identified.",
    "Mr. Thiel sees the midterms as crucial to changing the direction of the country, this person said, and he is backing candidates who support the agenda of former president Donald J. Trump.",
    "His talents will serve Meta well as he leads the company into a new era.”\nThiel has also reportedly been investing in tech startups committed to free speech and free expression.",
    "His departure from the board comes as he has ramped up involvement in politics ahead of the 2022 midterms, backing a number of Republican candidates.",
    "Billionaire investor Peter Thiel is giving up his spot on the board of Meta, formerly known as Facebook, the social media giant announced this week.",
    "Over the last year, Mr. Thiel, who has a net worth estimated at $2.6 billion by Forbes, has become one of the Republican’s Party’s largest donors.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "Thiel was the most prominent conservative voice on Facebook’s board and is one of the most prominent conservative voices in Silicon Valley.",
    "He gave $10 million each last year to the campaigns of two protégés, Blake Masters, who is running for a Senate seat in Arizona, and J.D.",
    "He has served on our board for almost two decades, and we’ve always known that at some point he would devote his time to other interests.",
    "The wealthy tech investor has often championed free speech and fought against censorship on tech platforms such as Facebook and Twitter.",
    "Vance, author of “Hillbilly Elegy,” are reportedly investing in Rumble, an alternative to YouTube that is popular among conservatives.",
    "His departure from Facebook’s board comes as he seeks to put his energy and wealth instead into backing select GOP politicians.",
    "As The Wall Street Journal reported, Narya Capital is the Cincinnati-based venture capital fund leading the investment.",
    "Vance, who Thiel is backing in Vance’s Ohio race for U.S. Senate, reportedly put money into the video platform Rumble.",
    "Thiel’s official departure from the board is expected to come after Meta’s annual shareholder meeting later this year.",
    "He was the first outside investor to back Facebook in 2004 and has served on the tech giant’s board since 2005.",
    "“Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions.",
    "In total, Thiel is backing four Senate candidates and 12 House candidates ahead of the 2022 election.",
    "Thiel has made a fortune as a venture capitalist investing in Silicon Valley startups.",
    "As The Daily Wire reported at the time:\nVenture capitalists Peter Thiel and J.D.",
    "Mark Zuckerberg’s intelligence, energy, and conscientiousness are tremendous.",
    "Others close to the matter said it values Rumble at about $500 million.",
    "Get inside access to The Daily Wire by becoming a member.",
    "Meta announced Thiel’s departure in a statement.",
    "Create a free account to join the conversation!",
    "Vance, who is running for Senate in Ohio.",
    "Thiel and fellow investor J.D."
  ]
}