{
  "id": 5651,
  "mediaId": 2550,
  "date": "2022-02-03",
  "headline": "Morning Digest: Remembering the 'born again pagan' mayor who transformed Portland, Oregon",
  "image": "https://images.dailykos.com/images/1033368/story_image/2744154779_b3555064ee_o.jpeg?1643845869",
  "link": "https://www.dailykos.com/stories/2078291",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2090,
    2573,
    2716,
    2948,
    3325,
    3481,
    4144,
    4548,
    5258
  ],
  "sentences": [
    "The Republicans are below:\nformer state Sen. Scott Jensen: $1.2 million raised, $805,000 cash-on-hand\nformer state Senate Majority Leader Paul Gazelka: $545,000 raised, $460,000 cash-on-hand\nDermatologist Neil Shah: $230,000 raised, $25,000 cash-on-hand\nState Sen. Michelle Benson: $215,000 raised, $120,000 cash-on-hand\nTwo other Republicans, healthcare executive Kendall Qualls and former Hennepin County Sheriff Rich Stanek, launched their campaigns in the new year.",
    "While the Rose City had certainly had labor-backed progressive mayors before, the sudden appearance of Clark, who served from 1985 to 1992, coincided with, and helped nurture, its turn away from being a rather gritty industrial city to more of how it's typically viewed in the media today, a modern, knowledge-sector-oriented city that's a popular hipster destination thanks in part to its focus on the arts and keeping itself weird.",
    "NV-Sen: The nonpartisan Nevada Independent has released numbers from OH Predictive Insights, a Republican firm that often works on behalf of media outlets in its home state of Arizona, that give Democratic Sen. Catherine Cortez Masto a 44-35 lead over former Republican Attorney General Adam Laxalt.",
    "NM-02: Democrats passed a new congressional map that transforms freshman Republican Rep. Yvette Herrell's 2nd District in the southern part of the state from a 55-43 Trump constituency into a district that Joe Biden would have carried 52-46, and two Democrats are competing to take her on.",
    "While Ivancie attacked Clark's well-known poster appearance and his self-identified \"born again pagan\" status as evidence that he wasn't a serious candidate, Clark had enough of a popular groundswell behind him to beat Ivancie 54-42 in the May nonpartisan primary.",
    "Former Portland Mayor Bud Clark\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "NM-03: While some Democrats feared that freshman Rep. Teresa Leger Fernandez could face a serious opponent after redistricting dropped Joe Biden's margin in her northern New Mexico seat from 58-40 to 54-44, she appears to have avoided any major opposition.",
    "SC-07: State House Speaker Jay Lucas, whom the Post and Courier's Andy Shain calls \"one of the state's most powerful pols,\" has joined Donald Trump in backing state Rep. Russell Fry's bid to deny Rep. Tom Rice renomination in the June Republican primary.",
    "Clark was also notable as one of the few known examples anywhere of an outgoing but slightly eccentric outsider being elected to a major political position as something of a protest vote, and then actually turning out to be good at the job.",
    "PA Redistricting: Pennsylvania's Supreme Court issued an order Wednesday assuming jurisdiction over pending litigation regarding the state's congressional map, citing the \"impact that protracted appeals will have on the election calendar.\"",
    "OH-Sen: Mike Gibbons, a wealthy businessman who lost the 2018 Republican primary for Ohio's other Senate seat, has released a Cygnal poll showing him with the edge ahead of the May contest where a 44% plurality remain undecided.",
    "The firm released numbers for the general election for governor as well, but, unlike in the Senate contest, it did not allow respondents to select undecided as an option-which is also something we require for any poll.",
    "Opt in to email updates from Daily Kos Elections\nSponsored by: Daily Kos Elections\nClark, an ardent bicyclist, focused on development of mass transit in Portland, as well as redevelopment of its neglected downtown.",
    "Gen. Greg Zanetti, an investment advisor who has regularly appeared on local radio to offer financial advice; Sandoval County Commissioner Jay Brock; state Rep. Rebecca Dow; and anti-abortion activist Ethel Maharg.",
    "The only other survey we've seen from a reliable firm was a September poll from the Democratic pollster The Mellman Group, which was also working for the Independent, and it gave Cortez Masto a smaller 46-41 edge.",
    "Las Cruces City Councilor Gabe Vasquez raised $155,000 during the final quarter of 2021 and ended the year with $150,000 to spend, while physician Darshan Patel does not appear to have filed with the FEC.",
    "Gibbons dropped these new numbers shortly after Moreno, Timken, and Mandel's allies at the Club for Growth each publicized their own polls showing their side either ahead or within striking distance.",
    "GA-10, GA-06, GA-Gov: CNN reported Tuesday that Donald Trump has offered former state Rep. Vernon Jones his endorsement if he runs for an open House seat instead of continuing his bid for governor.",
    "Under state law, any candidate who wins the support of at least 20% of the convention delegates will advance to the primary, and the person who takes first earns the top spot on the June ballot.",
    "However, it turned out that Ivancie—a conservative Democrat who went on to be a leader in the \"Democrats for Reagan\" movement—wasn't all that well liked outside the city's business community.",
    "Portland's mayor in 1984, Frank Ivancie, was presumed to be a local powerhouse, having served for decades previously on the City Commission, and was expected to easily win a second term.",
    "In fact, he was best known as the model for a well-known poster in the 1970s, Expose Yourself to Art, featuring a trenchcoat-clad Clark (seen from behind) flashing a statue of a woman.",
    "Perhaps the best-known contender is 2020 Senate nominee Mark Ronchetti, a longtime TV meteorologist who lost to Democrat Ben Ray Lujan 52-46 in a race that was closer than expected.",
    "However, the Land of Enchantment has an unusual convention process that often winnows the field in statewide and congressional races for both major parties well before the primary.",
    "Gibbons is also out with a new commercial starring Kentucky Sen. Rand Paul, who tells the audience, \"I've stood strong against the mandates of Dr. [Anthony] Fauci, but I need help.",
    "NY Redistricting: Both chambers in New York's legislature passed the Democrats' proposed new congressional map with minor tweaks on Wednesday, sending it to Democratic Gov.",
    "Jones tweeted the following day, \"My priority is - and has been since Day One - is to do whatever it takes to defeat Brian Kemp who's cowardice nearly cost us our country.",
    "State Rep. Steve Haugaard, who announced in mid-November that he would challenge the governor for renomination, took in $56,000 and reported having just $36,000 to spend.",
    "Instead, McCullough will now serve as a special master to the Supreme Court, which directed her to file a final report and redistricting plan with the justices by Feb. 7.",
    "The two Republicans to file were oil and gas engineer Alexis Martinez Johnson and farmer Jerald Steve McFall, and neither of them have reported raising any money so far.",
    "Vance and former state party chair Jane Timken at 10% and 8%, respectively; businessman Bernie Moreno takes 6%, while state Sen. Matt Dolan brings up the rear with 3%.",
    "RI-02: Former Rhode Island Department of Health Director Nicole Alexander-Scott said Wednesday that she would not run in the Democratic primary for this open seat.",
    "NE-Gov: University of Nebraska Regent Jim Pillen on Tuesday earned an endorsement from the influential Nebraska Farm Bureau ahead of the May Republican primary.",
    "Brian Kemp, and Jones' departure from the primary would likely give Perdue a better chance to win the majority in the May primary he'd need to avert a runoff.",
    "An unnamed source close to Jones said that he prefers the 10th District over the 6th, but that he hadn't yet decided if he'd abandon his statewide campaign.",
    "Deaths: One of the most memorable if not iconic figures in the political history of Portland, Oregon—former Mayor Bud Clark—died on Monday at the age of 90.",
    "United StatesUnited States\nAttribution: Stephen Wolf / Daniel Donner\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "However, Clark's tavern was a popular haunt for local progressives and he was well-connected in activist circles, giving him a large below-the-radar base.",
    "Contenders who fail to clear the convention can still make it to the primary, though, if they turn in the requisite number of signatures by March 8.",
    "Redistricting\nStay on top of the map-making process in all 50 states by bookmarking our invaluable redistricting timeline tracker, updated daily.",
    "The case had been before Judge Patricia McCullough of the Commonwealth Court, a Republican who was set to choose a new map after Democratic Gov.",
    "The most recent fundraising reports are from early October, before Ronchetti was running, and the next ones aren't due until mid-April.",
    "The plan is aimed at transforming the 19-8 advantage Democrats currently enjoy in the state's congressional delegation to a 22-4 edge.",
    "New Mexico: Candidate filing closed Tuesday for New Mexico's June 7 primaries, and the state has a list of contenders available here.",
    "NY-23: Former state Sen. Cathy Young said Wednesday that she would not seek the Republican nod for any seat in Congress this cycle.",
    "Noem herself only won 51-48, and we've seen no recent polling looking at her popularity in what is usually an extremely red state.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "MA-Gov: Former U.S. Attorney Andrew Lelling told Politico this week that he won't seek the Republican nod for this open seat.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "What each survey agrees on, though, is that a significant number of respondents are undecided months ahead of the primary.",
    "OH also polled the Senate primary, but the sample is below the 300-person minimum we require for inclusion in the Digest.",
    "After completion of his second term, he retired from public life and resumed the leadership of his Goose Hollow Tavern.",
    "Kristi Noem, which makes him the first notable Democrat to kick off a bid for an office his party last won in 1974.",
    "Tim Walz far outpaced his many GOP foes by bringing in $3.6 million and ended the year with that amount available.",
    "Republicans are scheduled to hold their event on Feb. 26, while Democrats will gather a week later on March 5.\n?",
    "SD-Gov: State House Minority Leader Jamie Smith announced Tuesday that he would challenge Republican Gov.",
    "MN-Gov: The Minnesota Post has rounded up every candidate's fundraising for 2021, and Democratic Gov.",
    "Michelle Lujan Grisham, who faces no intra-party opposition in a state that Joe Biden carried 54-44.",
    "Before running for mayor, Clark, an owner of several local taverns, had never run for office before.",
    "With better-known progressive opponents all passing on the race, Clark volunteered as tribute.",
    "Trump is backing former Sen. David Perdue's campaign to deny renomination to Republican Gov.",
    "Noem raised $11.8 million during 2021, and she ended the year with $7.3 million on-hand.",
    "Gibbons leads former state Treasurer Josh Mandel 16-13, with venture capitalist J.D.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "He was re-elected in 1988, defeating former Police Chief Ron Still 58-41.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "What we do know, though, is that the incumbent will be very well-funded.",
    "NM-Gov: Five Republicans are competing to take on Democratic Gov.",
    "Tom Wolf vetoed a plan passed by the state's GOP-run legislature.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Get the Daily Kos Elections Morning Digest over email\n Sign up!",
    "I will always stand with President Trump in anywhere I serve.\"",
    "Herrell herself took in $300,000 and had $1.1 million on-hand.",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "Also in the running are retired Army National Guard Brig.",
    "That's why I'm endorsing Mike Gibbons for Senate.\"",
    "This is a short blurb about Daily Kos.",
    "You may unsubscribe at any time.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Here's our privacy policy.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it.",
    "Kathy Hochul.",
    "Leading Off\n?",
    "Governors\n?",
    "Sign up!",
    "Senate\n?",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}