{
  "id": 5813,
  "mediaId": 2716,
  "date": "2022-02-05",
  "headline": "J.D. Vance pledges to 'defund' Fauci",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1644090291/GettyImages-1237662785.jpg",
  "link": "https://theweek.com/anthony-fauci/1009830/jd-vance-signs-pledge-to-defund-dr-fauci",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grayson Quay",
  "authorUrl": "https://theweek.com/authors/grayson-quay",
  "termIds": [
    0
  ],
  "sentences": [
    "Signatories promise to investigate Fauci, longtime head of the National Institute of Allergy and Infectious Diseases and President Biden's top medical adviser, and reduce his federal salary to zero.",
    "The \"Michael Knowles Federal Public Health Protection Pledge\" is the brainchild of conservative commentator Michael Knowles, who co-hosts the podcast The Verdict with Sen. Ted Cruz (R-Texas).",
    "Vance tweeted Saturday that he had signed a pledge stating that, if elected, he would support legislation targeting White House medical adviser Dr. Anthony Fauci.",
    "Last month, he was caught muttering into a hot mic that Sen. Roger Marshall (R-Kan.), who falsely suggested Fauci's personal finances were secret, was a \"moron.\"",
    "Other Republican signatories include Alabama Senate candidate Katie Britt, North Carolina House candidate Bo Hines, and Arizona House candidate Walt Blackman.",
    "Earlier that day, Fauci accused Sen. Rand Paul (R-Ky.) of \"distorting everything about me\" and engaging in \"personal attacks.\"",
    "According to Forbes, Fauci earned $434,312 in 2020 and is the highest paid employee in the entire federal government.",
    "Fauci has been accused, including by The Week's Ryan Cooper, of making misleading statements about COVID.",
    "The signed document, of which Vance included an image in his tweet, is dated Feb. 4.",
    "Fauci has repeatedly expressed frustration with the partisan rancor he attracts.",
    "Ohio Republican Senate candidate and Hillbilly Elegy author J.D."
  ]
}