{
  "id": 5924,
  "mediaId": 2528,
  "date": "2022-02-07",
  "headline": "Conservative-leaning YouTube rival Rumble offers Joe Rogan $100 million to leave Spotify",
  "image": "https://i.insider.com/62015e7bbd504100191904b8?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/what-is-rumble-conservative-video-youtube-competitor-joe-rogan-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Canales",
  "authorUrl": "https://www.businessinsider.com/author/katie-canales",
  "termIds": [
    1291,
    2896,
    903,
    963,
    1260
  ],
  "sentences": [
    "In the nearly two years since, Rogan has used his show to promote the horse drug ivermectin — which is disproven as an effective medicine against the disease — as a COVID-19 cure, said Americans were \"hypnotized\" into wearing masks, and has advised young, healthy people that they don't need to get vaccinated against COVID-19 (while claiming to be pro-vaccine.)",
    "The unsolicited offer is the latest development in the Rogan-Spotify saga that's resulted in the platform planning content advisories for any podcasts that discuss COVID-19 and Rogan acknowledging he could do more research before hosting controversial guests, like the ones who first brought the show under fire for airing anti-vaccine views.",
    "Rumble contributors include Fox News host Dan Bongino, who was banned from YouTube in January for misinformation, James O'Keefe's Project Veritas, Dave Rubin, and other popular conservatives.",
    "Rumble, a YouTube-like video-sharing site with looser moderation rules that has become popular with conservatives, wants podcaster Joe Rogan to leave Spotify for a cool $100 million.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Many conservatives have the moderation choices of larger social networks like Facebook and Twitter, which they say \"silence\" conservatives voices to serve a liberal agenda.",
    "Critics have long pushed back on that condemnation, saying that conservatives' social posts are moderated because they contain politically-motivated misinformation.",
    "Rumble has risen in popularity alongside other social platforms , like Parler and Gab, by aligning against what they see as censorship on mainstream tech platforms.",
    "Those episodes invited criticism from Spotify employees and caused multiple artists, including Neil Young and Joni Mitchell, to pull their music from the platform.",
    "Shares of CF Acquisition IV SPAC, which agreed to merge with Rumble in 2021 to take the company public, surged as much as 43% on Monday following its offer.",
    "Ek has maintained that while many may disagree with Rogan's comments, and while he himself condemns what Rogan has said, \"silencing\" him is not the answer.",
    "\"We should have clear lines around content and take action when they are crossed, but canceling voices is a slippery slope,\" Ek told employees Sunday.",
    "Jeff Bottari/Zuffa LLC via Getty Images\nRumble, a conservative-leaning YouTube competitor, is offering Joe Rogan $100 million to leave Spotify.",
    "However, Rumble has received funding from notable backers including Narya Capital, a fund backed in part by \"Hillbilly Elegy\" author J.D.",
    "—Rumble (@rumblevideo) February 7, 2022\nSpotify and Rogan first inked a \"multiyear\" deal for the wildly popular podcast in May 2020.",
    "The company tweeted at Rogan on Monday that it's \"ready to fight alongside\" him should he decide to leave the streaming giant.",
    "The Wall Street Journal reported a May funding round to be \"around $500 million,\" more than plenty to back up Monday's offer.",
    "\"How about you bring all your shows to Rumble, both old and new, with no censorship, for 100 million bucks over four years?",
    "The announcement was scant on financial or logistical details, though the price tag was reported to be $100 million.",
    "Rogan's podcast pushed Spotify to the forefront of debates about how to handle misinformation online.",
    "It's unclear when that exclusivity expires or if Rogan could immediately move the podcast elsewhere.",
    "The 9-year-old company said last week that it reached 39 million active users in January.",
    "And yes, this is totally legit,\" CEO Chris Pavlovski said in a letter posted to Twitter.",
    "Spotify signed a multi-year deal for exclusive Joe Rogan Experience rights in 2020.",
    "The company and its CEO, Daniel Ek, have stood behind Rogan through the upheaval.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Get the latest tech news & scoops — delivered daily to your inbox.",
    "For comparison, Google-owned YouTube has over 2 billion MAUs.",
    "All three remain relatively small in terms of user count.",
    "Vance, and billionaire Trump supporter Peter Thiel.",
    "Rumble did not respond to a request for comment.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "This is our chance to save the world.",
    "Loading Something is loading.",
    "What is Rumble?",
    "Joe Rogan."
  ]
}