{
  "id": 5964,
  "mediaId": 2643,
  "date": "2022-02-09",
  "headline": "How Peter Thiel's Money Could Shape the Midterms for Donald Trump",
  "image": "",
  "link": "https://www.newsweek.com/peter-thiel-trump-midterms-meta-facebook-1677536",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    2201,
    2298,
    2394,
    3466,
    3854,
    4192,
    4595,
    1171,
    1185,
    5212
  ],
  "sentences": [
    "However, while the inclusion of another billionaire who can bring money to the table for Trump candidates can be considered \"meaningful,\" Thiel's impact on the midterm results \"may be more muted than expected,\" according to Sean Freeder, an assistant professor of political science at the University of North Florida.",
    "The news of Thiel's political ambitions arrived shortly after it was revealed that Trump entered 2022 with an unprecedented war chest of $122 million raised via donations to his political committees, hundreds of thousands of which have already been given to candidates endorsed by the former president.",
    "In a statement announcing his departure, Meta CEO Mark Zuckerberg said: \"Peter has been a valuable member of our board and I'm deeply grateful for everything he has done for our company—from believing in us when few others would, to teaching me so many lessons about business, economics, and the world.",
    "Despite his billions, tech entrepreneur Peter Thiel's influence on the upcoming midterms may be \"muted\" after he announced he is leaving Meta, the parent of Facebook, in an apparent bid to throw his support to congressional candidates who align with Donald Trump, according to an expert.",
    "In January, Thiel hosted a fundraiser his Florida home for Hageman during which he called Cheney the \"ringleader\" of the \"Treasonous Ten,\" referring to the House Republicans who voted to impeach Trump over the January 6 attack, reported Politico's Alex Isenstadt.",
    "\"For one, while having a money advantage matters, the value of each additional dollar at some point diminishes quite a bit, and to the extent these candidates will receive support from other Trump-associated PACs, and even Trump himself,\" Freeder told Newsweek.",
    "Freeder suggested one such election that Thiel may influence away from Trump is the gubernatorial race in Georgia, where GOP incumbent Brain Kemp is facing challenges from Democrat Stacey Abrams and Trump-endorsed former senator David Purdue.",
    "According to The New York Times, Thiel is leaving the company in order to focus on backing candidates with similar views and policies to Trump ahead of November's elections, including Arizona Senate candidate Blake Masters, and J.D.",
    "Freeder suggested that Thiel's donations may become more significant in primaries where Trump-backed candidates lose as it seems likely the former president may pull his money and endorsements from the Republican Party in general.",
    "Bloomberg News also reported that Thiel plans on supporting Masters, Vance and other Trump-esque candidates such as Harriet Hageman, the attorney who the former president has endorsed to unseat Wyoming rep. Liz Cheney.",
    "Thiel, one of the early investors in Facebook and co-founder of PayPay, confirmed on Monday that he will not stand for re-election to the Board of Directors where he has sat since 2005 at the next stockholders meeting.",
    "He contributed around $1.5 million to pro-Trump groups in 2016 and has already donated a reported $10 million each to Masters and Vance's campaigns last year, reported Bloomberg.",
    "\"In such a case, it's doubtful Trump would provide support to Kemp, but I think Thiel might, and that could make the difference in what will be an extremely close election.\"",
    "\"Moreover, most of the effect of Trump's support will be in the endorsement itself, not necessarily the money, and Thiel's name alone won't carry much weight with voters.\"",
    "\"It may be that Thiel would be willing to intervene in such cases and fill any financial gaps for the sake of Republicans gaining influence,\" Freeder said.",
    "\"Current polls have Kemp barely leading in this match-up, and Kemp may very well be the one to face Stacey Abrams in the general,\" Freeder said.",
    "The desire from Thiel, who is estimated by Forbes to be worth $2.6 billion, to pump money in political campaigns is also not a new one.",
    "\"Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions.\"",
    "\"They may already have most of the money they'll need to run 24/7 advertising.",
    "Vance, who is running for Senate in Ohio."
  ]
}