{
  "id": 607,
  "mediaId": 2643,
  "date": "2022-04-15",
  "headline": "Coveted Donald Trump Endorsement Goes to J.D. Vance in Ohio Senate Race",
  "image": "",
  "link": "https://www.newsweek.com/coveted-donald-trump-endorsement-goes-jd-vance-ohio-senate-race-1698374",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia McKnight",
  "authorUrl": "https://www.newsweek.com/authors/patricia-mcknight",
  "termIds": [
    2201,
    3196,
    3466,
    764,
    767,
    878,
    1171,
    5212
  ],
  "sentences": [
    "The Senate race in the swing state has several candidates who've announced their allegiance to Trump, but the former president finally chose Vance in a much-anticipated decision.",
    "Trump's announcement arrived just hours after three dozen county GOP chairs and committee members sent a letter to the former president urging him to not endorse Vance.",
    "\"With only a few short weeks until Election Day, an endorsement that cuts against your support and legacy in Ohio will only serve to confuse or upset voters.\"",
    "\"He was an incredible fighter for hard working Americans in the White House, he will be again, and I'll fight for the America First Agenda in the Senate.\"",
    "\"While we were working hard in Ohio to support you and Make America Great Again, JD Vance was actively working against your candidacy,\" the letter read.",
    "\"I can't stomach Trump, I think that he is noxious and is leading the white working class to a very dark place,\" the letter claims Vance said.",
    "About 25 percent said they'd less likely vote for a Trump-endorsed candidate and nearly 20 percent said it wouldn't affect their vote at all.",
    "\"To have someone who has not voted in a Republican primary carrying the mantel[sic] for the party is troubling,\" the letter stated.",
    "A study of more than 1,000 Ohio GOP voters found that 54.9 percent would be more likely to vote for a candidate endorsed by Trump.",
    "The letter claims Vance referred to Trump supporters as \"racists\" and that he \"proudly\" voted for Evan McMullin in 2016.",
    "A new survey released by the Trafalgar Group revealed that a Trump-endorsed candidate would likely get more votes.",
    "The endorsement comes ahead of a Trump rally in Ohio next weekend on April 23 at the Delaware County Fairgrounds.",
    "Despite the backlash against Vance, Trump offered his endorsement with just over two weeks until the primary.",
    "'s campaign because, unlike so many other pretenders and wannabes, he will put America First,\" Trump wrote.",
    "\"It is time for the entire MAGA movement, the greatest in the history of our Country, to unite behind J.D.",
    "The letter listed a number of comments Vance made against the ex-president, to showcase his opposition.",
    "\"In the Great State of Ohio, the candidate most qualified and ready to win in November is J.D.",
    "\"I'm incredibly honored to have President Trump's support,\" Vance wrote.",
    "Vance took to Twitter, saying he was honored to have Trump's support.",
    "The GOP members also said that Vance isn't a registered Republican.",
    "Former President Donald Trump has endorsed conservative J.D.",
    "Newsweek reached out to Vance and Trump for comment.",
    "Vance for the Republican Senate primary in Ohio.",
    "Vance,\" Trump wrote in a statement.",
    "It is all about winning!\"",
    "\"We cannot play games."
  ]
}