{
  "id": 6159,
  "mediaId": 2574,
  "date": "2022-02-03",
  "headline": "Tim Ryan Took Thousands From Manchin Days After Attacking Him",
  "image": "https://freebeacon.com/wp-content/uploads/2022/02/pjimage-34.jpg",
  "link": "https://freebeacon.com/democrats/tim-ryan-took-thousands-from-manchin-days-after-attacking-him/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Collin Anderson",
  "authorUrl": "https://freebeacon.com/author/collin-anderson/",
  "termIds": [
    0
  ],
  "sentences": [
    "One day later, Ryan sent another fundraising email calling it \"BS\" that Manchin \"killed Build Back Better, which would have put money back in the pockets of the middle class by lowering the cost of medicine, childcare, and health care.\"",
    "Ohio congressman Tim Ryan (D.) accepted thousands of dollars in campaign cash from Sen. Joe Manchin's PAC just days after he launched an onslaught of digital fundraising ads that attack the West Virginia Democrat.",
    "Ryan's working-class image is also impaired by his decision to vote for a massive tax break for coastal millionaires—a policy he once called \"bullshit\"—through President Joe Biden's $2 trillion spending package.",
    "Ryan campaign spokeswoman Izzi Levy told the Washington Free Beacon Ryan \"isn't afraid to stand up to anyone he believes isn't doing right by Ohio\" but did not address his decision to accept Manchin's money.",
    "In another, Ryan called Manchin \"the sole person standing in the way of lower prescription drug costs\" before asking viewers to \"chip in $5 or whatever you can to help us win this Senate seat.\"",
    "Manchin's Country Roads PAC has accepted hundreds of thousands of dollars from large corporations, including Capital One, American Express, JPMorgan Chase, and Lockheed Martin.",
    "Ryan's willingness to back the policy came even as one of his Democratic colleagues refused to vote for the bill because of its \"$280 billion tax giveaway to millionaires.\"",
    "In a fundraising email sent Jan. 19, Ryan accused Manchin of \"hold[ing] the Senate hostage\" and \"standing in the way of passing legislation and making progress.\"",
    "And while Ryan touts Biden's legislation on the campaign trail, the bill would give a millionaire nearly 20 times more money than a low-income family.",
    "His chief primary opponent is Morgan Harper, a far-left challenger who attempted to unseat Rep. Joyce Beatty (D., Ohio) in 2020 but lost by 36 points.",
    "Vance, former state party chairwoman Jane Timken, investment banker Mike Gibbons, and businessman Bernie Moreno headline a crowded primary field.",
    "Ryan has attempted to fashion himself as a champion of the working class in his bid to succeed outgoing Republican senator Rob Portman.",
    "On Dec. 22, Ryan's Senate campaign began running dozens of Facebook ads that lambasted Manchin and asked for campaign contributions.",
    "Just six days after Ryan began running the ads, however, his campaign accepted $5,000 from Manchin's leadership PAC, Country Roads.",
    "On the same day, Ryan also accepted $10,000 from the \"ModSquad,\" a PAC founded by Manchin and nine other Senate Democrats.",
    "that \"Joe Manchin just said he can't support the Build Back Better Act after MONTHS of stringing along negotiations.\"",
    "On the Republican side, state senator Matt Dolan, former state treasurer Josh Mandel, author J.D.",
    "Ryan has accused Republicans of prioritizing \"donors and super PACs\" over \"hardworking people.\"",
    "Ryan continued his criticism of Manchin in the weeks following the launch of his ad campaign.",
    "But his decision to accept Manchin's PAC money may undermine his blue-collar bonafides.",
    "Manchin did not return a request for comment on his PAC's contribution and Ryan's ads.",
    "Ryan is not the only Democrat running to replace Portman.",
    "In one digital spot, Ryan said he was \"PISSED!\""
  ]
}