{
  "id": 622,
  "mediaId": 2656,
  "date": "2022-04-20",
  "headline": "Ohio GOP: Trump's J.D. Vance Endorsement a Betrayal",
  "image": "https://media.townhall.com/townhall/reu/o/2021/182/de870b44-1c4e-41bd-913e-4316da881cc1-1110x740.jpg",
  "link": "https://pjmedia.com/news-and-politics/gwendolynsims/2022/04/20/ohio-gop-trumps-j-d-vance-endorsement-a-betrayal-n1591436",
  "mediaOutlet": "PJMedia",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gwendolyn Sims",
  "authorUrl": "https://pjmedia.com/columnist/gwendolynsims",
  "termIds": [
    2141,
    2201,
    2434,
    3016,
    3466,
    3565,
    4625,
    764,
    878,
    5212
  ],
  "sentences": [
    "Vance was in Silicon Valley and cable news studios calling President Trump ‘America’s Hitler’ and bashing the MAGA movement as ‘racist,’ Jane Timken was traveling 150,000 miles across Ohio doing the important work to dismantle the Kasich establishment and turn Ohio into a pro-Trump, conservative stronghold.",
    "That’s exactly what many across the Buckeye state have conveyed throughout this primary and that’s exactly what they will make known loud and clear on May 3rd.”\nBiden's out-of-touch leadership caters more to the wants and needs of rich coastal elites than everyday Americans.",
    "pic.twitter.com/mGl0UkFSiq\n— Jane Timken (@JaneTimkenOH) April 18, 2022\nMike Gibbons — “Ohioans want a real leader that will fight for them, put America first, and will help get our country back on track in the U.S. Senate,” candidate Mike Gibbons told PJ Media.",
    "pic.twitter.com/y3hs9028q7\n— Andrew Tobias (@AndrewJTobias) April 20, 2022\nIn the letter, the delegates made clear to Trump that they “are not your typical Republicans in Ohio” but are “the original and proud ‘Trumpers'” who supported him from the beginning.",
    "pic.twitter.com/NeL44exvVR\n— Matt Dolan (@dolan4ohio) April 20, 2022\nNeil Patel — “I am disappointed that President Trump did not let our Senate race play out as our grassroots folks vote,” said candidate Neil Patel in a statement to PJ Media.",
    "Indeed, as Republicans were poised to vote on replacing Obamacare with their own American Health Care Act, Vance bashed the legislation, fearing cuts to Medicaid entitlements.” That doesn’t sound very Republican now, does it?",
    "Vance wasted no time capitalizing on Trump’s endorsement by slapping an obnoxiously yuge “Trump Endorsed” logo on his social media platforms and holding a town hall with Donald J. Trump, Jr. on Wednesday afternoon.",
    "Vance in the Ohio Senate race, more than 30 Ohio delegates who represented Trump in 2016 at the Republican National Convention (RNC) have penned an open letter urging him to withdraw his support for Vance.",
    "While I am disappointed, I am still very much a supporter of our former President.”\nThe campaigns of Mark Pukita and Josh Mandel did not reach PJ Media with a statement in time for publication.",
    "As PJ Media’s Paula Bolyard reported, not only does Vance have Kasich cronies working for his campaign, but Vance is also “a big proponent of Kasich’s failed Medicaid expansion in the state.",
    "“That it really was about the We the People, America First and Making America Great Again not supporting a political chameleon and snake oil salesman like J.D.",
    "Vance to show your supporters in Ohio and across our great states why we first believed in you back in 2016,” reads the letter that was released on Wednesday.",
    "For all the talk about @JDVance1's attacks on Donald Trump from years ago, it's his shameful contempt for Ukraine that Ohio voters find truly disqualifying.",
    "https://t.co/1BK3nLlyr5\n— Mike Gibbons (@MikeGibbonsOH) April 20, 2022\nMatt Dolan — “80,000 Ohioans have ties to Ukraine,” candidate Matt Dolan tweeted.",
    "We need new leaders who put hard-working Americans first and will get our country back on track, which is exactly what I’ll do in the U.S. Senate.",
    "“They want real, authentic conservative leadership that will take on the failures of the Biden Administration and help make America great again.",
    "In other words, Vance just accused the delegates of being establishment when he is the one who has Kasich establishment-cronies on his campaign.",
    "Thirty three 2016 Ohio Trump delegates have signed a letter urging the former president to reconsider his endorsement of JD Vance for Senate.",
    "Will Trump’s usefulness as the GOP Kingmaker be coming to a close with yet another unpopular but pragmatic endorsement to win at all cost?",
    "Vance!”\nMeanwhile, PJ Media reached out to each of the additional Ohio Republican candidates in the primary race for U.S. Senate.",
    "Vance will always be fought by the Republican establishment and party insiders,” said Vance campaign spokesman Taylor Van Kirk.",
    "Ohioans firmly believe that Mr. Vance is not supportive of former President Trump and that has caused upset across the state.",
    "Vance had his way, Hillary Clinton would have been President,” Timken spokeswoman Mandi Merritt told PJ Media on Wednesday.",
    "\"This endorsement of JD Vance is a betrayal to not only your Ohio supporters but Trump supporters across our great nation!\"",
    "Instead of emboldening authoritarian thugs like Putin and Xi, our next Senator must understand Ohio and #StandWithUkraine.",
    "Vance, who has former Team Kasich members serving on his campaign.”\nIt doesn’t get any swampier in Ohio than Team Kasich.",
    "Vance (@JDVance1) April 20, 2022\nOhio’s primary election is May 3, 2022, and will replace retiring Republican Sen.",
    "As the Ohio race remains any candidate’s to win (or lose), one thing is clear: it’s certainly one to watch.",
    "Some of the candidates gave statements regarding Trump’s endorsement of Vance and Vance’s record.",
    "As I’ve said, we can be secure at home and defend freedom in the world.” Watch the video below.",
    "In the wake of former President Donald J. Trump’s ill-advised questionable endorsement of J.D.",
    "According to The Washington Times, the Vance campaign flatly dismissed the delegates’ letter.",
    "Trump is set to hold a MAGA rally deep in the heart of Ohio on April 23 in Delaware, Ohio.",
    "Or will Ohio’s voters see Vance as the left-leaning tool of the establishment that he is?",
    "Vance was not.”\nThis race is about who you can trust to advance the America First agenda.",
    "“We are the ones you trusted to stand and deliver for you in 2016!” the delegates wrote.",
    "“We look forward to winning them over like President Trump did.” Did you notice that?",
    "It certainly doesn’t sound as if JD Vance understands everyday Ohioans, now does it?",
    "Ohio voters know who was there and who wasn’t — Jane Timken was there and J.D.",
    "Once again things are heating up in the politically crucial state of Ohio.",
    "“Unfortunately the grassroots as well as the establishment, are very sad.",
    "Putin’s war crimes are both horrific and intensely personal for Ohioans.",
    "Ohio conservatives can trust me because I've been there and delivered.",
    "“We would respectfully request you reconsider your endorsement of J.D.",
    "The left accuses its adversaries of being what the left actually is.",
    "“And we did it against the Ohio Swamp and many in the establishment!",
    "Jane Timken — “Ohio’s base is rightfully upset because if J.D.",
    "“Conservative outsiders like Donald Trump and J.D.",
    "We did it in the face of ‘NeverTrumpers’ like J.D.",
    "“Parma [Ohio] is a sister city to Lviv [Ukraine].",
    "Rob Portman, who has held the office since 2010.",
    "Cincinnati is a sister city to Kharkiv.",
    "In fact, it sounds downright leftist.",
    "That’s the same tactic the left uses.",
    "Will Trump’s endorsement help Vance?",
    "Fired up crowd here in Independence.",
    "Fantastic to have ?@DonaldJTrumpJr?",
    "pic.twitter.com/IjfB4jOFXu\n— J.D.",
    "The delegates see through Vance.",
    "For his part, J.D.",
    "We’ll be watching.",
    "“While J.D.",
    "in Ohio!"
  ]
}