{
  "id": 624,
  "mediaId": 6602,
  "date": "2022-04-18",
  "headline": "Mar-a-Lago machine: Trump as a modern-day party boss",
  "image": "https://www.sun-sentinel.com/resizer/pPoFrQxjD-Ov4T-AkF381D096H4=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/VCIRWAQN7JLNPASVBGI2F2GFYY.jpg",
  "link": "https://www.sun-sentinel.com/news/nationworld/ct-aud-nw-nyt-trump-mar-a-lago-20220418-vkf63vuosnhdfl2fig2eagn56u-story.html#ed=rss_www.sun-sentinel.com/arcio/rss/category/news/",
  "mediaOutlet": "South Florida Sun-Sentinel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Shane Goldmacher",
  "authorUrl": "",
  "termIds": [
    1843,
    2201,
    2292,
    3267,
    3466,
    3920,
    583,
    877,
    5234
  ],
  "sentences": [
    "“Because he can — and he’s not bound by the conventional rules of politics.”\nThis portrait of Trump as a modern-day party boss is drawn from more than 50 interviews with Trump advisers past and present, political rivals, Republicans who have sought his support, and GOP officials and strategists who are grappling with his influence.",
    "And while other past presidents have ceded the political stage, Trump has done the opposite, aggressively pursuing an agenda of vengeance against Republicans who have wronged him, endorsing more than 140 candidates nationwide and turning the 2022 primaries into a stress test of his continued sway.",
    "The episode encapsulates the peculiarities of Trump’s style as a party boss: receptiveness to intensive wooing, haphazard decision-making, the potential for him to overplay his hand and the requirement that his false claims of election fraud be amplified.",
    "‘A developing Tammany situation’\nAn entire political economy now surrounds Trump, with Trump properties reaping huge fees: Federal candidates and committees alone have paid nearly $1.3 million to hold events at Mar-a-Lago, records show.",
    "Perhaps nowhere has Trump delved more deeply into local politics than in Michigan, guided in part by the party’s co-chair, Meshawn Maddock, a close ally who arranged for buses to carry protesters to Washington on Jan. 6, 2021.",
    "PALM BEACH, Fla. — On any given night, Donald Trump will stroll onto the patio at Mar-a-Lago and say a few words from a lectern, welcoming whatever favored candidate is paying him for the privilege of fundraising there.",
    "“He’s not a real big digital guy, so we had printouts,” said Joe Kent, who has since won Trump’s backing for his effort to unseat Rep. Jaime Herrera Beutler, R-Wash., one of the 10 Republican impeachment votes.",
    "No inside track exists.”\nYet while Tammany Hall, a New York City political machine that endured for nearly two centuries, owed its longevity to its spreading around of patronage, Trump can be downright stingy.",
    "A day after McCarthy reprimanded Rep. Madison Cawthorn, R-N.C., for saying that colleagues in Washington had held orgies and used cocaine, Trump awarded Cawthorn a coveted speaking slot at his next rally.",
    "In November 2020, after Trump summoned Michigan lawmakers to the White House for an extraordinary meeting as he sought to overturn the election, the state’s two GOP legislative leaders rebuffed him.",
    "Inspiring fear, hoarding cash, doling out favors and seeking to crush rivals, Trump is behaving not merely as a power broker but as something closer to the head of a 19th-century political machine.",
    "Taylor Budowich, a spokesperson for Trump, said focusing only on direct spending does not fully account for the value of the Trump imprimatur for voters and the “free media coverage” it generates.",
    "Trump has transformed Mar-a-Lago’s old bridal suite into a shadow GOP headquarters, amassing more than $120 million — a war chest more than double that of the Republican National Committee.",
    "A phalanx of Trump whisperers has emerged with candidates paying them in hopes of lining up meetings, even as Trump alumni warn that it is always buyer beware in the Trump influence game.",
    "At a debate before the endorsement, Matt Dolan, the only leading Republican contender not aggressively vying for a Trump endorsement, suggested his rivals were putting Ohio voters second.",
    "But strategists in both parties say Trump’s big public profile presents a risk for Republicans, as private surveys and focus groups show he remains a potent turnoff for swing voters.",
    "“If someone is out there selling their ability to make endorsements happen, they’re selling a bridge they don’t own,” said Michael Caputo, a former adviser who still speaks to Trump.",
    "Not unlike past political bosses, Trump has focused heavily on the mechanics of elections while ceaselessly sowing distrust in the system through false claims of vote rigging.",
    "“Party leaders have never played the role that Trump is playing,” said Roger Stone, an on-and-off adviser to Trump since the 1980s who has been spotted at Mar-a-Lago of late.",
    "In North Carolina, Trump tried to get an ally, Rep. Mark Walker, to abandon his Senate campaign and clear the field for Trump’s choice, Rep. Ted Budd, to take on former Gov.",
    "Trump has already rescinded one endorsement, Rep. Mo Brooks for Senate in Alabama, after Brooks had slumped in the polls, and he could backtrack on others who are trailing.",
    "In one oft-recounted scene, Trump pulled several Ohio Senate candidates into a room last year at Mar-a-Lago, where they began verbally attacking one another as he watched.",
    "A heavy hand\nWith an eye to his win-loss record on endorsements, Trump is increasingly treating Republican candidates like game pieces to be moved, swapped or abandoned.",
    "Now, Trump has endorsed more than a half-dozen Michigan legislative candidates to elevate Maddock’s husband, state Rep. Matt Maddock, as the next state House speaker.",
    "When Trump was staying at his Bedminster, New Jersey, golf course in the summer, Jim Lamon, a Senate candidate in Arizona, paid for an ad on Fox News in New Jersey.",
    "Soon, Trump formally endorsed her — though he had only praise for Little, who had attended a Mar-a-Lago fundraiser for a Trump-aligned nonprofit just days before.",
    "But after courts threw the state’s political maps into turmoil, Walker refused, threatening to split the pro-Trump vote, though polls show Budd leading anyway.",
    "“The power of your support cannot be underestimated,” Ronna McDaniel, the party chair, had told Trump, adding, “We need you.”\nc.2022 The New York Times Company",
    "“What appears to be a developing Tammany situation is really the coalescence of many consultants who pretend they have an inside track toward the endorsement.",
    "This is the place where everybody wants to be.”\nFor 15 months, a parade of supplicants have made the trek to pledge their loyalty and pitch their candidacies.",
    "Wielding power over the party and selling the fiction of a stolen election also serve to distract from Trump’s unhappy exit from the White House as a loser.",
    "But as he hints repeatedly about a third White House bid, the looming question is whether he can remain a kingmaker if he doesn’t actually seek the crown.",
    "‘Like crabs in a bucket’\nNothing reveals Trump’s hold on the party quite like the genuflections and contortions of those seeking his political approval.",
    "A recent appearance on the Republican National Committee’s podcast captured both the draws and drawbacks of the party’s unyielding attachment to Trump.",
    "Michael D’Antonio, a Trump biographer, drew a parallel between this period and an earlier crisis in Trump’s career: his bankruptcy in the early 1990s.",
    "“There are people up on this stage who are literally fighting for one vote,” he said, “and that person doesn’t vote in Ohio.”\nDolan is an exception.",
    "He will listen to the lobbying of senior Republicans, like Rep. Kevin McCarthy, the House GOP leader, and then turn on them with little warning.",
    "Some candidates pay to attend Mar-a-Lago fundraisers for others — clamoring for a fleeting moment of Trump’s attention, or better yet, a photo.",
    "Precision television\nTelevision is a popular way to lobby Trump, and some candidates try by running ads far away from their voters.",
    "“What was ‘The Apprentice’ but a sad scramble of people behaving like crabs in a bucket to be lifted out by him?” D’Antonio said.",
    "It was, by far, the podcast’s most-watched episode on YouTube — until the site removed it for spreading misinformation.",
    "Although he holds rallies for some candidates, for many his support goes no further than an email and a $5,000 check.",
    "When he likes what he sees, Trump will mail words of encouragement, scrawled on news clippings with a Sharpie.",
    "Few see an expiration date on his dominance until and unless he declines to run again in 2024 or is defeated.",
    "But the fact remains that many of those he is opposing in primaries are still running as Trump Republicans.",
    "Janice McGeachin of Idaho appeared on Tucker Carlson’s Fox News program in June and sang Trump’s praises.",
    "“It was the coolest thing,” she said, adding she “slipped it in” that she planned to challenge Gov.",
    "In many ways, the endorsement chase is a real-life reprisal of Trump’s old reality-television role.",
    "McGeachin said she told Trump that Little hadn’t fought hard enough to overturn the 2020 election.",
    "The races in which Trump has endorsed a candidate will be studied for any dimming of his power.",
    "“I used to say ‘ground zero,’ but after the World Trade Center we don’t use that term anymore.",
    "“This is a special place,” Trump said on one such evening in February at his private club.",
    "And he never accepted these were really losses.”\nDemocrats are bracing for losses in 2022.",
    "He has spoken in private, for instance, about softening his stance behind McGeachin.",
    "Those close to Trump say he draws gratification from the raw exercise of his power.",
    "“But for Trump it just marked a turn in his method and his pursuit of power.",
    "Brad Little, the incumbent Republican, and asked for Trump’s support.",
    "Soon, she was on a plane to New York for a meeting in Trump Tower.",
    "But insiders say bringing compelling visual material matters, too.",
    "Almost everyone parrots his lie that the 2020 election was stolen.",
    "“These would have been ruinous events for someone else,” he said.",
    "As a rule, an audience with Trump can make or break a candidacy.",
    "Some catch Trump’s eye on television in between the commercials.",
    "Trump did not endorse any of them, instead backing author J.D.",
    "Trump enjoys flattery and is not above rewarding sycophants.",
    "Trump declined to be interviewed for this article.",
    "In the fall, she pressed her case at Mar-a-Lago.",
    "Some bear gifts; others dish dirt.",
    "Trump plainly relishes the power.",
    "Some have hired Trump’s advisers.",
    "So candidates strategize heavily.",
    "Pat McCrory in May’s primary.",
    "The next day, he called her.",
    "With photos and graphics.",
    "Results have been mixed.",
    "Big fonts are crucial.",
    "In color.",
    "Lt. Gov.",
    "Vance."
  ]
}