{
  "id": 6307,
  "mediaId": 2589,
  "date": "2022-02-07",
  "headline": "Barney Frank: Liz Cheney should go independent and Wyoming Democrats should back her in her House race",
  "image": "https://media.townhall.com/townhall/reu/o/2021/132/b0406acc-dccd-400f-8d19-e28b990ac129-1110x740.jpg",
  "link": "https://hotair.com/allahpundit/2022/02/07/barney-frank-liz-cheney-should-go-independent-and-wyoming-democrats-should-back-her-in-her-house-race-n446985",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allahpundit",
  "authorUrl": "https://hotair.com/author/allahpundit",
  "termIds": [
    0
  ],
  "sentences": [
    "But if pro-democracy conservatives are given the chance to support a candidate with whom they agree ideologically, and if Democrats and independents in the state are able to cast their ballots solely on their assessment of Trump’s response to the election regardless on their views on every other policy question, the outcome will be a better indicator of public opinion than any Republican primary or a partisan general election.",
    "A general election between two conservatives who differ mainly on the importance of electoral integrity, on the other hand, would offer what social scientists call a natural experiment: a situation in which reality approximates what we would create in a laboratory if we could isolate a particular factor.",
    "That means Democrats should take what might be an unpalatable course: In states and districts where the party stands little chance of winning in the general election, Democrats should endorse and enthusiastically support anti-Trump Republicans who run as independents.",
    "Even if Wyoming’s sore-loser law didn’t legally prohibit that, the perception that she’s a sore loser by insisting on running in the general election after a primary defeat would likely alienate some of the centrist Republicans she’d need to win in November.",
    "A coalition of Democrats and the center-right should first target members of Congress who narrowly won election in red districts and are among the most virulent in perpetuating the election fraud myths…\nIs this a strategy that will eradicate Trumpism?",
    "If I were Trump, I’d head off Frank’s gambit by helping some pro-Trump Dem in the state get the signatures he needs to run as an independent and then pay for some cursory advertising to promote that candidate’s Democratic affiliation.",
    "George W. Bush and Mitt Romney and of course Dick Cheney and other leaders of the pre-Trump Republican establishment will try to get her that third by hitting the trail for her, but they’re all but guaranteed to fail.",
    "But even then, her strategy of relying on Democrats to put her over the top will be so obvious to Wyoming Republicans that many will view her as a de facto Democrat anyway.",
    "What he wants to do is to turn the general election in Wyoming into as much of a pure referendum on January 6 and Trump’s bid to overturn the election as possible.",
    "And these newly elected, nominal independents would likely caucus with Democrats and might even make the difference in deciding which party controls Capitol Hill.",
    "“This is also the perfect strategy to keep Rep. Liz Cheney in Congress if she loses her primary in August and must run as an independent,” Glover goes on to say.",
    "Could she get to 51 percent against Trump-backed Harriet Hageman with unanimous Democratic support plus a rump faction of anti-Trump and/or centrist Republicans?",
    "In Georgia, meanwhile, Brian Kemp is running ads targeting his Trump-endorsed primary opponent, David Perdue, as a sellout to Trumpism by sending jobs overseas.",
    "That means taking normal partisan politics out of the equation and giving voters a choice between Trump’s proxy candidate and the anti-insurrectionist Cheney.",
    "When Cheney loses badly, that’s something Democrats will be able to point to in 2024: The Wyoming results prove that Republicans are now openly pro-coup.",
    "And then he wants the Democratic Party in Wyoming to field no candidate in the general election since any nominee would be destined to be crushed anyway.",
    "Even if she took the same 27 percent of the electorate that Joe Biden got there, she’d still need a third of the Republican vote to put her over the top.",
    "What Frank wants is for Cheney to retain her conservative Republican identity but to bypass the primary by declaring herself nominally an independent.",
    "Wyoming is the state that gave Trump his largest percentage in 2020, and I have seen no poll on the electoral-integrity question of Wyoming voters.",
    "But it is a strategic, targeted push against the worst perpetrators of the election lies and would create new incentives for others in the GOP.",
    "Because what’s really on the ballot isn’t one party or another, it’s democracy itself…\nThis strategy should also be evaluated for House races.",
    "Trump has attacked Kemp relentlessly over the past 14 months — yet here Kemp is, insisting that he’s the real MAGA candidate in the race.",
    "His opponents in the primary have attacked him for it and those attacks seem to be sticking despite Vance’s desperate attempt to atone.",
    "And given the national interest this will generate, both sides will have more than enough money and media coverage to make their cases.",
    "Her best play is to do what Frank recommends by declaring independence beforehand and skipping the primary altogether.",
    "Still, Frank’s strategy is probably the only chance anti-Trump candidates have of winning in red jurisdictions.",
    "Other strategists have also called for a Never Trump/Democratic alliance in heavily MAGA states or districts.",
    "Cheney happens to represent the most pro-Trump state in America as measured by his margin of victory in 2020.",
    "I don’t think it would work for Cheney to lose a Republican primary and then run as an independent, though.",
    "Just one question: How would Wyoming Democrats ensure that no one from their party ends up on the ballot?",
    "If Cheney shocks everyone and wins, that’s a shot in the arm for Trump-skeptics on the right nationwide.",
    "What Frank’s really after here, I think, isn’t so much a Cheney victory, which he knows is out of reach.",
    "I might be overly optimistic in thinking that this could produce a positive result for political sanity.",
    "Cheney wouldn’t do that since her policy preferences are almost totally misaligned with the other party.",
    "If Cheney loses, says Frank, then it’s proof that Republicans are who anti-Trumpers thought they were.",
    "Versus a zero percent chance of being reelected if she follows through on running in the GOP primary.",
    "Because, prior to becoming a Trump ass-kisser and phony MAGA fan, Vance was a Never Trumper in 2016.",
    "Politico has the results of a new internal poll conducted by the Super PAC that’s supporting J.D.",
    "Under those circumstances, the state’s small Democratic minority would gravitate towards Cheney.",
    "She’s anti-coup and pro-gay-marriage (belatedly) and that’s about where the common ground ends.",
    "Many Wyoming Democrats will vote reflexively for an independent Democrat on Election Day.",
    "There’s no market for a Never Trumper in a Republican primary, though, needless to say.",
    "That piece was co-written by Juleanna Glover, who used to work for … Dick Cheney.",
    "I’d give her a one percent chance of being reelected if she takes Frank’s advice.",
    "We can’t risk returning Trump to the White House under circumstances like that.",
    "Vance in Ohio that found Vance is in big trouble with Republican voters.",
    "Maybe the Barney Frank strategy is already in play in LizWorld.",
    "To be clear, he’s not recommending that she become a Democrat.",
    "Cheney’s base of support on the left would evaporate.",
    "It’d be really, really hard to pull off a win.",
    "So I guess his logic is sound.",
    "Although a boy can dream.",
    "Uh, probably not, no.",
    "What a world.",
    "Hmmmm.",
    "Why?",
    "No."
  ]
}