{
  "id": 6407,
  "mediaId": 2550,
  "date": "2022-01-21",
  "headline": "It's starting to occur to Trump that some of his endorsements have proven subpar",
  "image": "https://images.dailykos.com/images/1002620/story_image/GettyImages-1235504857.jpg?1635519867",
  "link": "https://www.dailykos.com/stories/2076058",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1684,
    2201,
    2202,
    2869,
    4021,
    4595,
    4654,
    4762,
    1171
  ],
  "sentences": [
    "In fact, Trump started getting cold feet after he endorsed alleged wife beater Sean Parnell for the open Pennsylvania Senate seat at the urging of his son, Don Jr. Parnell finally bowed out of the race last November after he lost custody rights over his kids.",
    "“He’s been asking who is paying who.”\nLet's stop for a second and give Trump some credit for at least briefly visiting the universe the rest of us inhabit—the one in which everyone willing to associate with him, including his kids, are users and grifters.",
    "So like, if there's a three-way primary with two Trumpers and one relatively sane Republican, then Trump will entirely dilute his influence, confuse his cultists, and an anti-Trumper might actually emerge victorious.",
    "Trump also has doubts about backing Rep. Ted Budd (pushed by Mark Meadows) for the North Carolina Senate seat and Rep. Mo Brooks (pushed by Stephen Miller) for the Alabama Senate seat.",
    "Trump is both worried that he's \"picking the wrong horse\" and that his aides might simply be pushing him to endorse candidates with whom they have personal or financials ties (!).",
    "His Senate picks for Georgia (Herschel Walker), Pennsylvania (Sean Parnell), and North Carolina (Ted Budd) have already muddled GOP chances in three of the most important races.",
    "Trump's other option is to sit out some of these races, but his allies fear that could give Senate Minority Leader Mitch McConnell the upper hand on Senate picks.",
    "Trump is a tad late to the game with this revelation, but his solution to the problem is even more daft than the languishing pace of his faculties.",
    "— In the Pennsylvania Senate race, former White House aide DINA POWELL is pushing Trump to endorse her husband, hedge fund magnate DAVID MCCORMICK.",
    "“He’s at times suspicious of the recommendations that people give him when he knows they’re being paid,” a former Trump adviser told Playbook.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "But back to Trump's simply brilliant idea to hedge his bets by potentially endorsing two candidates in a single GOP primary.",
    "Donald Trump has reportedly caught on to the fact that the cadre of hangers-on around him may not, in fact, be \"the best.\"",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "— In Arizona, Thiel and Trump’s top political aide SUSIE WILES have been pushing BLAKE MASTERS in the GOP Senate primary.",
    "Trump's keen insights came to the fore due to endorsements he's been making in a series of races across the country.",
    "Senate candidate Herschel Walker, right, speaks at a rally with Donald Trump on Sept. 25, 2021 in Perry, Georgia.",
    "I mean, what are the chances that the ultimate con man has surrounded himself with a bunch of snake oil peddlers?",
    "Most people, instead of diluting their endorsements, actually vet candidates before backing their campaigns.",
    "Playbook cites several high-profile races where Trump aides are gunning for conflicting endorsements.",
    "From a Democratic standpoint, we highly encourage Trump to get involved in as many races as possible.",
    "Trump has apparently grown suspicious that some of his advisers are giving him bad advice (!)",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "VANCE for Senate, while [Kellyanne] Conway works for BERNIE MORENO’s campaign.",
    "That wouldn't happen in all cases, but it certainly could in some situations.",
    "— In Ohio, tech billionaire PETER THIEL has been lobbying Trump to pick J.D.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "But SEAN HANNITY is urging him to back celebrity doctor MEHMET OZ.",
    "“I get two chances to win,\" Trump explained to one of his allies.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "But former Trump ambassador RIC GRENELL has endorsed JIM LAMON.",
    "and just might be doing so for their own benefit (!",
    "Neither candidate is a clear frontrunner.",
    "This is a short blurb about Daily Kos.",
    "Wiles works for Masters’ super PAC.",
    "), according to Politico Playbook.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "But that would be a lot of work.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Why stop now, Trump?",
    "Donate $5 monthly",
    "Please read it.",
    "Genius!"
  ]
}