{
  "id": 6462,
  "mediaId": 2590,
  "date": "2022-01-24",
  "headline": "Not All Georgia Republicans Want More Marjorie Taylor Greene",
  "image": "https://img.huffingtonpost.com/asset/61ef10f13600004f0024d42d.jpeg?cache=xEh2riiZpG&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/marjorie-taylor-greene-georgia-primary_n_61ef0afbe4b03add23fd0f32",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    1435,
    1726,
    2201,
    3466,
    3975,
    305,
    878,
    1124,
    4984
  ],
  "sentences": [
    "Lutin, whose campaign site features an X-ed out photo of Greene on its home page, told the Atlanta Jewish Times that being Jewish is what propelled him to run as a “moderate” against Greene, whom he said has a “well-deserved reputation as an anti-Semite.” Greene has likened mask and vaccine mandates to Nazi Germany and suggested that California wildfires were caused by a space laser controlled by the Jewish Rothschild family.",
    "We need a serious representative who actually wants to do the work, wants to go to committee hearings, wants to serve constituents, wants to work with colleagues to craft meaningful policy — and frankly we don’t have that today,” one of her challengers, 35-year-old Jennifer Strahan, told HuffPost.",
    "They just love her to pieces,” said Tom Pounds, who quit the Dade County GOP over frustration with Greene and the political climate in Georgia, which has been charged since Donald Trump blamed his 2020 election loss on fraud and the state’s two Senate seats flipped to Democrats a year ago.",
    "I’m going to stand up for the people.’ But she can’t stand up for the people because she can’t get anything passed.”\nHer most active opponents in the GOP primary include Strahan, a small-business owner and health care executive, and Charles Lutin, a retired physician, both newcomers.",
    "A business owner and fitness trainer who rode Trump’s coattails into office in 2020, Greene achieved notoriety almost instantly as the so-called QAnon congresswoman for her adherence to the bonkers conspiracy theory about a secret cabal of Democratic pedophiles.",
    "Carolyn Kaster/Associated Press\nGreene beat neurosurgeon John Cowan by 14 percentage points in the 2020 Republican primary, then went on to sweep up 75% of the vote in the general election in a deep-red bastion, making her tough to beat now as an incumbent.",
    "Census data from 2019 shows the district is overwhelmingly white and lags the nation in both its high school graduation rate and median household income — which at $56,000 is less than what Greene is giving up for refusing to wear a mask at her job.",
    "She has drafted articles of impeachment against Joe Biden, promoted baseless voter fraud conspiracies, championed those accused in the Jan. 6 Capitol riot and forfeited much of her paycheck over fines for refusing to wear a mask on the House floor.",
    "Advertisement\nDuring a telephone town hall in November, Greene showed she doesn’t change her tone when addressing her constituents, whom she asked to weigh in on topical issues such as vaccine mandates, election audits and the infrastructure law.",
    "To Democrats, Greene is the face of an increasingly extreme and polarizing Republican Party, while the GOP has lately made her into a martyr for spreading bad information about COVID-19, which got her banned from Twitter and Facebook.",
    "Advertisement\n“Part of my motivation, to be frank, is that I am Jewish myself and cannot abide the thought of [Greene] serving indefinitely and representing our state in such an intolerable fashion,” Lutin, 68, told the Jewish Times.",
    "Rep. Marjorie Taylor Greene won’t return to Congress for a second term without confronting some opposition from Republicans in her Georgia district, where several challengers are trying to knock her out in the GOP primary.",
    "“And that’s what she’s doing a very good job of out there in front of the cameras.”\nIncumbents who win in a landslide generally don’t face staunch opposition from within their parties, but Greene isn’t a typical incumbent.",
    "“If people really started looking under the hood at how she’s acting, I think they’d realize that maybe Trump can get away with some of that, but our representative doesn’t need to go around the country acting the fool.”",
    "“Our district doesn’t have a seat at the table, and, by way of that, we don’t have an opportunity to push back on these very liberal and progressive policies that don’t bring value back to our constituents,” she said.",
    "“Do you support Congresswoman Greene’s stance that the 13 House Republicans who voted for Biden’s communist infrastructure bill betrayed their party?” she asked the callers, telling them to “press one” if they agreed.",
    "The biggest complaint from anti-Greene Republicans is that she can’t effectively represent her constituents without sitting on any committees, which help representatives steer money and resources to their districts.",
    "Four Democrats — including an Army veteran, Marcus Flowers, who has already raised more than $3 million — and one libertarian are also running in the 14th District, which covers a swath of northwest Georgia.",
    "Greene is still highly favored to win a second term, but her opponents underscore the frustration some in the party have with the congresswoman’s relentless focus on extreme rhetoric over actual legislating.",
    "“When the Silicon Valley monopolists silenced Donald Trump and kicked him off social media, when they did the same thing to Marjorie Taylor Greene, that should raise an alarm bell for all of us,” J.D.",
    "Strahan, who is “very conservative,” said the district doesn’t need a representative who is concerned more about being a celebrity than pushing back against Biden’s agenda.",
    "They spend five minutes once a week looking at what Marjorie’s doing, and they must get the impression she’s fighting for us because she’s in the news a lot,” he said.",
    "“I think her effectiveness as a member of Congress is her biggest Achilles’ heel,” said Jason Shepherd, who used to run the Republican Party in Cobb County, Georgia.",
    "”[Lawmakers] work for you.”\nReps. Marjorie Taylor Greene (R-Ga.) and Matt Gaetz (R-Fla.) speak at the anniversary of the Jan. 6, 2021, attack at the U.S. Capitol.",
    "“I think she acts in very self-serving, grifting sort of way, playing on people’s fears,” said Cowan, who isn’t running again this year but might in the future.",
    "Greene’s GOP detractors say her antics may have established her nationally, but they’re embarrassing her constituents in Georgia’s 14th Congressional District.",
    "Redistricting isn’t expected to change Greene’s election outcome significantly, even though she’s picking up more Democratic votes in the Atlanta suburbs.",
    "Rep. Steve King (R-Iowa) was stripped of his committee assignments in 2019 for making comments about white supremacy that were condemned by both parties.",
    "A recent poll obtained by Jewish Insider showed that although 60% of GOP primary voters would choose Greene, Strahan managed to pull 30% of the vote.",
    "Booting a member off committees is a rare move generally wielded as punishment for convicted criminals or members who go against leadership.",
    "“I can’t speak for every county in the 14th District, but I can speak for three or four of them that I go regularly to their meetings.",
    "Advertisement\nEven her critics say that, despite concentrated opposition, most people in the district think she’s great.",
    "With more than $6 million in the bank as of the last campaign filing deadline, Greene will be nearly impossible to beat.",
    "Greene has already forfeited $90,000 of her $174,000 annual congressional salary over the mask fines, The Hill reported.",
    "“It’s one thing to be able to go to Washington, D.C., and pound your fist and say, ‘We’re not going to take it.",
    "A year into her term, Greene has already been removed from committees for promoting violence toward Democrats.",
    "“I’ll be in the room with decision-makers, not running around the country on a media tour,” Strahan said.",
    "John Cowan, Greene’s former neurosurgeon opponent, said Greene sets a bad example for all conservatives.",
    "“She got all her committees stripped forever, so all she can do now is make her name,” Pounds said.",
    "Vance, a Republican running for U.S. Senate in Ohio, said at a town hall last week.",
    "Greene’s campaign didn’t respond to a request for comment for this article.",
    "Advertisement\n“Not everyone is plugged into Twitter or the national news.",
    "He lost in Iowa’s 2020 Republican primary, ending his political career.",
    "Greene’s detractors think she’s ultimately headed for the same fate.",
    "Advertisement\n“I’m very concerned with the direction of our country.",
    "But her opponents are clinging to hope it can be done.",
    "“I work for you,” Greene later told them.",
    "She’s loved."
  ]
}