{
  "id": 6489,
  "mediaId": 2572,
  "date": "2022-01-25",
  "headline": "Trump ally Marjorie Taylor Greene endorses JD Vance in Ohio GOP Senate showdown",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/04/greene.jpg",
  "link": "https://www.foxnews.com/politics/trump-ally-marjorie-taylor-greene-endorses-jd-vance-ohio",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    1726,
    2201,
    3466,
    4077,
    764,
    878,
    1171,
    4906,
    5212
  ],
  "sentences": [
    "The field also includes former Ohio treasurer and former two-time Senate candidate Josh Mandel; former Ohio GOP Chair Jane Timken; Cleveland businessman and luxury auto dealership giant Bernie Moreno; 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer and investment banker; and Matt Dolan, a longtime state lawmaker whose family owns Major League Baseball’s Cleveland Guardians, who until last year were known for more than a century as the Cleveland Indians.",
    "Greene, a first-term conservative congresswoman who has repeatedly sparked controversies with incendiary comments but who’s also a top Trump supporter and loyalist in the House, emphasized in a statement shared first with Fox News Digital that \"JD Vance is the conservative warrior that the entire America First movement needs fighting for us in the U.S. Senate, and that's why I'm proud to endorse him.\"",
    "Greene has become popular with many Trump supporters and other far-right Republican voters, and her endorsement of Vance comes as venture capitalist and bestselling author, along with and nearly all the other top contenders in Ohio's GOP Senate primary, have tried to outdo each other to showcase their unwavering support of the former president.",
    "Greene – who last year was stripped of her committee assignments in a disciplinary action in the Democrat-led House, following uproar over her past online posts advocating the execution of Democratic members of Congress and embracing elements of the QAnon conspiracy – isn’t the first well-known conservative member of Congress to endorse Vance.",
    "This as they vie for the endorsement of Trump, who one year removed from the White House remains very popular and influential with Republican voters as he continues to play a kingmaker’s role in GOP politics and repeatedly flirts with making another White House run in 2024.",
    "A source close to Trump world told Fox News that Greene \"is beloved by the conservative grassroots across the country, but that her biggest fan might just reside in Mar-a-Lago,\" which is the Palm Beach, Florida, winter residence of the former president.",
    "Ryan is considered the favorite for the Democratic nomination in small primary field that also includes progressive Morgan Harper, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "The Vance team told Fox News that Greene will travel to Ohio on Sunday to join the Senate candidate on the campaign trail in Loveland, a city in the southwestern part of the Buckeye State that’s located near Cincinnati.",
    "Vance, who grew up in Middletown, Ohio, and currently lives in Cincinnati, grabbed national attention after his memoir \"Hillbilly Elegy\" became a New York Times bestseller and was made into a Netflix film.",
    "THE FRENZY TO LAND TRUMP'S ENDORSEMENT IN THE INCREASINGLY COMBUSTIBLE OHIO GOP SENATE PRIMARY\nBut Greene, in her statement, emphasized that \"JD is 100% pro-life, pro-2nd Amendment and pro-Trump.\"",
    "As Vance launched his campaign, he was the target of anonymous texts sent to Republican voters in Ohio as well as political reporters covering the race that slammed him as a \"Never-Trumper.\"",
    "Among the others are Sen. Josh Hawley of Missouri and Rep Jim Banks of Indiana, the chair of the decades-old caucus of House conservative lawmakers known as Republican Study Committee.",
    "And the conservative outside group Club for Growth, which is backing a rival candidate in the primary battle, accused Vance of \"tearing down President Trump and mocking Trump voters.\"",
    "\"If you agree with me that Washington desperately needs more America First fighters in the mold of President Trump, then it’s vital to support JD's campaign in Ohio,\" she stressed.",
    "And Vance also enjoys the backing of some top Trump allies, including Turning Point USA founder Charlie Kirk and PayPal co-founder and billionaire venture capitalist Peter Thiel.",
    "But as he announced his Senate candidacy last summer, he made headlines once again as his past public comments critical of Trump were thrust back into the spotlight.",
    "Vance in Ohio's crowded, combustible and expensive 2022 GOP Senate primary, in a political move that's possibly directed toward an audience of one.",
    "Thiel, Vance’s former boss, last year contributed $10 million of his own money to a super PAC supporting Vance’s Senate campaign.",
    "The winner of May’s Republican primary may face off against longtime Democratic Rep. Tim Ryan of northeastern Ohio.",
    "And some former Trump White House and campaign aides and advisers are also helping or working on Vance’s campaign.",
    "Vance publicly opposed Trump’s 2016 presidential push before supporting Trump's 2020 re-election.",
    "EXCLUSIVE: Republican Rep. Marjorie Taylor Greene of Georgia on Tuesday endorsed J.D.",
    "Vance is one of 11 GOP candidates running to succeed retiring Republican Sen.",
    "And that one person is former President Donald Trump.",
    "Rob Portman."
  ]
}