{
  "id": 6547,
  "mediaId": 2716,
  "date": "2022-01-24",
  "headline": "Senate candidate J.D. Vance defends caustic jokes because 'our country's kind of a joke'",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1643050528/jdvance screenshot.jpg",
  "link": "https://theweek.com/2022-elections/1009340/senate-candidate-jd-vance-defends-caustic-jokes-because-our-countrys-kind-of",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grayson Quay",
  "authorUrl": "https://theweek.com/authors/grayson-quay",
  "termIds": [
    2177,
    2201,
    3466,
    4085,
    4452,
    4784,
    1094,
    1171
  ],
  "sentences": [
    "Vance rose to prominence in the aftermath of the 2016 election as his memoir, Hillbilly Elegy, was widely cited as a sympathetic and insightful look at the white working class that helped explain Trump's victory in Rust Belt states like Ohio and Wisconsin.",
    "In a September appearance on Tucker Carlson Tonight, Vance said the government should \"seize the assets of the Ford Foundation\" to punish the nonprofit for its support of increased immigration.",
    "\"Fedposting\" refers to trollish, often anti-government social media activity that might attract the attention of federal agents or that federal agents might use to entrap people.",
    "Other candidates vying with Vance for the GOP nomination have also engaged in bombastic rhetoric, including former State Treasurer Josh Mandel and IT executive Mark Pukita.",
    "According to Mediaite, Vance made the statement when journalist Taylor Popielarz questioned Vance about a joke he made after the Alec Baldwin film set shooting.",
    "One Twitter user quipped in November that \"the GOP primary in Ohio\" had devolved into \"a contest to see which candidate can fedpost the hardest.\"",
    "Vance has even adopted Trump's tactic of using controversial — and probably unrealistic — policy proposals to gain media attention.",
    "Rob Portman (R-Ohio) last year, Vance has retracted his criticisms of the former president and moved hard to the right.",
    "We need Alec Baldwin tweets,\" Vance wrote on Twitter in October, tagging then-Twitter CEO Jack Dorsey.",
    "Former President Donald Trump frequently criticized Baldwin's portrayal of him on Saturday Night Live.",
    "Vance argued in a recent interview with Spectrum News that \"our country's kind of a joke.",
    "And we should be able to tell jokes about it,\" the Ohio-based news network reported.",
    "Since announcing his bid for the Senate seat currently occupied by retiring Sen.",
    "At the time, Vance cast himself as an anti-Trump Republican.",
    "Republican Senate candidate J.D.",
    "\"Dear @jack let Trump back on."
  ]
}