{
  "id": 6727,
  "mediaId": 2592,
  "date": "2022-01-27",
  "headline": "Ukraine Crisis Reveals Growing Republican Rift On Russia",
  "image": "https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2022/01/27/fox-news-host-tucker-carlson-pictured-in-2019.jpg",
  "link": "https://www.ibtimes.com/ukraine-crisis-reveals-growing-republican-rift-russia-3385083?utm_source=Public&utm_medium=Feed&utm_campaign=Distribution",
  "mediaOutlet": "IBTimes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Frankie TAGGART",
  "authorUrl": "",
  "termIds": [
    1328,
    3709,
    878,
    4930,
    5077,
    5287,
    5366,
    5390
  ],
  "sentences": [
    "As Washington rallies the international community against Russian aggression in Ukraine, conflict has broken out back home between traditional Republicans determined to defend democracy overseas and an isolationist base asking why America should take sides at all.",
    "Tensions between the United States and Russia have escalated as Moscow has amassed an estimated 100,000 troops near its border with Ukraine, leading to fears that it is preparing a new military assault after its invasion of Crimea in 2014.",
    "The anchor has suggested that the United States should be supporting energy-rich Russia over its pro-Western neighbor, ignoring the security assurances that Washington gave Kyiv when the former Soviet republic gave up its nuclear arsenal.",
    "But other polls show a trend in the opposite direction, including a Yahoo News/YouGov survey released this week in which 40 percent of Republicans said the United States has no duty to protect Ukraine, against 36 percent who said it does.",
    "\"Trump has had a large influence on generating these sentiments as he had been generally warmer toward Russia, and so has Tucker Carlson, who has gone to great lengths to advocate the pro-Russia position on his show.\"",
    "The usual conservative voices advocating a tough US response have come as expected, but a pro-Russian stance taken by a large section of former president Donald Trump's support base has unsettled many observers.",
    "Carly Cooperman, a Democratic pollster who has written a book on divisions in US politics, said a significant section of Republican voters now see Putin's Russia as an ally in right-wing nationalism.",
    "Congressman Adam Kinzinger told The Washington Post he saw evidence of the shift in a text message chain with fellow House Republicans who were asking why Biden was being allowed to \"provoke Russia.\"",
    "The post was among more than a dozen public statements identified by news website Axios from House Republicans challenging the notion that America has any business getting involved in the standoff.",
    "But it also reflects a pro-Russia sentiment that took root under Trump, who lionized Vladimir Putin as a \"highly respected\" leader and publicly sided with the former KGB spy over the US government.",
    "Republicans in the House of Representatives and on the campaign trail have been breaking with conservative orthodoxy to complain loudly that the United States should have no role in the crisis.",
    "But it is a different story among the grassroots, where hopefuls in the upcoming midterm elections are rejecting the internationalist rhetoric that once defined Reagan-Bush Republicanism.",
    "Tom Malinowski, a Democratic congressman from New Jersey, tweeted that he had seen an uptick in calls to his office from Carlson viewers \"upset that we're not siding with Russia.\"",
    "The right also appears to have been moved by the steady stream of rhetoric echoing Kremlin talking points that has been served up by top-rated Fox News host Tucker Carlson.",
    "A survey by the Chicago Council on Global Affairs last July showed 51 percent backing among the party faithful for military intervention in the event of an invasion.",
    "Russia doesn't want Ukraine to join NATO either, as doing so would make it much more difficult for Russia to act aggressively towards Ukraine,\" Cooperman told AFP.",
    "Vance and his opponent Bernie Moreno have accused the Biden administration of being more concerned about Ukraine's borders than America's southern frontier.",
    "High-profile Washington Republicans -- including the party's Senate leadership -- have backed the country's longstanding support for Kyiv's sovereignty.",
    "They won't send troops to stop the invasion of the US because they're the ones facilitating it,\" Trump's spokeswoman Liz Harrington said on Thursday.",
    "Analysts believe the party's internal conflict has been fueled in part by the unpopular war in Iraq and botched withdrawal from Afghanistan.",
    "\"What is new is we have at least one talk show host with a huge captive audience that is not exposed to any counter-programming elsewhere.\"",
    "One of the most influential voices in right-wing media, Carlson's provocative screeds have been broadcast approvingly by Russian state TV.",
    "Dangerous drugs and violent crime are crossing my constituents' backyards,\" Arizona's far right lawmaker Paul Gosar tweeted this week.",
    "That is not to say that Republicans on the whole are unsupportive of a tough stance against Moscow's expansionism.",
    "\"You hate America unless you want to send our best to die in a war that has nothing to do with this country?",
    "\"As strong nationalists, these Republicans are anti-NATO and not supportive of Ukraine joining NATO.",
    "The talking point has been tried out in Ohio's Senate race, where Republican primary candidate J.D.",
    "\"People get their opinions by watching the news, that's nothing new,\" Malinowski told The Hill.",
    "Give me a break,\" Vance, a venture capitalist and bestselling author, tweeted Wednesday.",
    "\"They're both foreign countries that don't care anything about the United States.",
    "\"Why is it disloyal to side with Russia but loyal to side with Ukraine?\"",
    "Fox News did not immediately respond to a request for comment.",
    "\"The Swamp will send troops to fight an invasion of Ukraine.",
    "Carlson asked his viewers on Monday.",
    "\"Ukraine is over 5,000 miles away.",
    "Kind of strange.\""
  ]
}