{
  "id": 6763,
  "mediaId": 2621,
  "date": "2022-01-24",
  "headline": "J.D. Vance Defends Bombastic Rhetoric: ‘Our Country is Kind of a Joke’",
  "image": "https://www.mediaite.com/wp-content/uploads/2021/07/JD-Vance-7-1.jpg",
  "link": "https://www.mediaite.com/politics/j-d-vance-defends-bombastic-rhetoric-our-country-is-kind-of-a-joke/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Griffing",
  "authorUrl": "https://www.mediaite.com/author/alex-griffing/",
  "termIds": [
    2177,
    2201,
    3466,
    4085,
    878,
    1094
  ],
  "sentences": [
    "Vance gave a surprising answer to a local Ohio reporter last week when asked how he justifies some of his more bombastic rhetoric, saying that “our country is kind of a joke.”\nVance, the former venture capitalist and author of Hillbilly Elegy, gave an in-depth interview to Spectrum News’ Taylor Popielarz last week, which was published on Monday.",
    "Maybe it turns some people off, but I think the realness turns more people on.”\nVance is running against five other major candidates in the GOP primary, including Josh Mandel – who has become known for his caustic rhetoric on social media.",
    "When Alec Baldwin fired a gun on a movie set last fall that led to the death of a cinematographer, #OHSen candidate @JDVance1 tagged Twitter’s CEO in a tweet and asked him to “let Trump back on.",
    "We need Alec Baldwin tweets.”\nI asked Vance how he justifies that type of rhetoric: pic.twitter.com/vWCbthK4oz\n— Taylor Popielarz (@TaylorPopielarz) January 24, 2022",
    "So I think the idea that we can’t have somewhat offensive humor sometimes from our politicians is basically just asking us to have fake politicians all the time.",
    "And they say, does that really — you had said, ‘Dear Jack, let Trump back on, we need Alec Baldwin tweets’ — as this, you know, deadly shooting was playing out.",
    "During the interview, Popielarz asked Vance:\nYou obviously have a big following on social media, people see you on all your media interviews that you do.",
    "Rob Portman, responded, “I’d say like, look, people may not always agree with my rhetoric, but I think, unfortunately, our country’s kind of a joke.",
    "When they look at something like, I think it was back in October, the tweet you sent out about the Alec Baldwin film shooting incident.",
    "If a voter sees that as they’re plugging into this race, and they say, is that the type of rhetoric I want a U.S. senator to have?",
    "“Every single person that I knew was joking about what would Donald Trump say if he was on Twitter.",
    "Vance, who is duking it out on a competitive Republican primary to replace retiring Sen.",
    "Right?”\n“I think it’s important for our politicians to have a sense of humor.",
    "I think it’s important for us to be real people,” Vance continued.",
    "And we should be able to tell jokes about it.",
    "Republican U.S. Senate candidate J.D.",
    "That’s not what I’m going to be.",
    "How do you explain that?",
    "Right?"
  ]
}