{
  "id": 6801,
  "mediaId": 2745,
  "date": "2022-01-31",
  "headline": "Of all the arguments for impeaching President Biden, this is not the strongest",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DIXIVOUCHYI6ZFI4DYGMG4R6KM.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/01/31/all-arguments-impeaching-president-biden-this-is-not-strongest/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2338,
    3020,
    3466,
    3975,
    1094,
    1171
  ],
  "sentences": [
    "Then he cut to the chase: “The thing that I think Biden has done that is genuinely unprecedented in the history of this country is to sanction, encourage and pay for an invasion of this country.”\n“A lot of negative things I could say about Bill Clinton, but Bill Clinton did not allow an invasion on this scale,” Vance continued, “or actively encourage people to do it, even while the leading cause of death for communities, among young people, is the fentanyl they’re bringing in from Mexico.",
    "As I explained last week, the pandemic policy that quickly deports migrants from the country has contributed to an increase of repeat apprehensions, people stopped at the border more than once in the same month.",
    "I wish I’d asked The Washington Post’s Dave Weigel a few years ago if he ever expected to attend an event in which a QAnon-sympathizing member of Congress endorsed the Senate bid of a ferociously pro-Trump J.D.",
    "The invocation of fentanyl is particularly strange, because it’s a reminder that apprehension numbers, like drug-seizure numbers, are numbers about things being prevented from moving freely into the country.",
    "Immigration is a hot-button issue for the Republican base (not without precedent), and Vance is echoing others on the right in claiming that what’s happening at the border is a unique indictment of Biden.",
    "His point was to combine “traitorous” and “fentanyl” and “sanction, encourage and pay for an invasion of this country” in a series of responses to prove his newly acquired hard-right bona fides.",
    "I offer all of this primarily as an exploration of the intricacies of border apprehension numbers and because Vance’s comparison raised eyebrows, given what I knew about Clinton’s numbers.",
    "As he does, Weigel shared snippets of what he was observing on Twitter, including the point at which Vance was asked whether he joined Greene in advocating President Biden’s impeachment.",
    "The government only began releasing those numbers in the past few months, but you can see below that a significant number of monthly apprehensions aren’t unique stops.",
    "In this case, it would be as though a large percentage of Germans had swept into Poland — and then turned themselves in to be processed as potential future residents.",
    "And now a point against it: Many of the apprehensions in recent years have been voluntary, migrants turning themselves in to seek asylum in the United States.",
    "There are people detained and people released and people quickly removed from the country under pandemic rules introduced under President Donald Trump.",
    "The number of apprehensions in fiscal 2021 was 1.1 percent higher than the number of apprehensions in 2000, the highest year of Clinton’s two terms.",
    "The government’s fiscal years begin in October, so more than 200,000 of the apprehensions in that fiscal year cannot be attributed to Biden.",
    "So Biden’s totals are inflated by repeat offenders, but at a border that’s better protected than it was during Clinton’s administration.",
    "But we can look at one consistent metric: the U.S. Border Patrol’s figures for apprehensions, data that extends back nearly a century.",
    "If we then adjust for the country’s population, the first nine months of Biden’s term (even giving him full credit for January 2021!)",
    "If we extract the Trump-era portion of those apprehensions, Biden’s numbers are lower than four years of Clinton’s administration.",
    "This is ridiculous, it’s traitorous conduct, and we need to do something about it.”\nI get what Vance is going for here, of course.",
    "One of the reasons that apprehensions fell a decade ago was that Congress passed legislation expanding barriers at the border.",
    "(Maybe seven — we don’t have monthly splits on 1993, when Clinton would have been divvying up apprehensions with George H.W.",
    "Last June, Customs and Border Protection reported that 14 percent of apprehensions were repeat offenders from 2014 to 2019.",
    "And I understand why Vance wanted to compare Biden to Clinton, the most recent Democrat to be impeached by the House.",
    "I mean, he probably would have, since it’s Dave Weigel, but I suspect he might have placed the odds fairly low.",
    "It was less two polar opposites meeting halfway than one polar opposite making the long trek to the other.",
    "Since those rules depend somewhat on legal changes, comparing Biden to past presidents is a little tricky.",
    "There are people detained upon entering the country and people prevented from entering in the first place.",
    "Yet there he was this weekend, watching Rep. Marjorie Taylor Greene (R-Ga.) embrace a triumphant Vance.",
    "Vance is “Tough on the Border” and “Views Biden Negatively,” two important boxes he needed to check.",
    "saw fewer apprehensions relative to the country’s population than six of Clinton’s eight years.",
    "Those numbers of apprehensions are often misunderstood, which I’ll come back to in a second.",
    "Trump compared the situation at the border to the erosion of borders during a war.",
    "That’s about 20 percent higher than the equivalent totals for calendar year 2000.",
    "But to compare Biden to Clinton on this metric was perhaps not a perfect choice.",
    "There’s a one problem, though: Biden wasn’t president for all of fiscal 2021.",
    "Over the calendar year of 2021, there were about 2 million apprehensions.",
    "There are a variety of factors that contribute to apprehension numbers.",
    "What do you focus on?”\n“I know you’ve got a couple,” Vance continued.",
    "Even taking out January’s numbers still has Biden above Clinton.",
    "“Look, I’m absolutely for articles of impeachment,” Vance said.",
    "Vance’s argument in support of doing so caught my eye.",
    "A different strain on the Polish military, certainly.",
    "Anyway, Greene and those at the event got the point.",
    "People turning themselves in count toward the total.",
    "(More recent data, though, are compiled monthly.)",
    "There are multiple borders and stops at airports.",
    "“The question is: What do you impeach him for?",
    "There are stops made by different agencies.",
    "Again, though, those numbers carry caveats.",
    "In the past seven months, 28 percent were.",
    "But now turning back to Vance’s argument.",
    "None of this was Vance’s point, though.",
    "So how does Biden compare to Clinton?",
    "We can draw one direct comparison.",
    "There’s so much, right?",
    "Vance.",
    "Bush.)"
  ]
}