{
  "id": 686,
  "mediaId": 3987,
  "date": "2022-04-15",
  "headline": "Immigration Reform News April 15, 2022 / Qué Pasa En Inmigración",
  "image": "http://americasvoice.org/wp-content/uploads/2018/09/Immigration_News.jpg",
  "link": "https://americasvoice.org/blog/immigration-reform-news-aprl-15-2022/?utm_source=rss&utm_medium=rss&utm_campaign=immigration-reform-news-aprl-15-2022",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Agencia EFE",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "By Bernard Goldberg\nApril 14, 2022\nEl Diario de El Paso (TX) Llaman congresistas ‘dañina’ inspección de camiones que ingresan a EU\nBy Ivanna Leos\nApril 14, 2022\nYahoo Noticias Reino Unido llevará a migrantes a Ruanda para combatir el tráfico ilegal\nBy Agencia EFE\nApril 14, 2022\nEl Mundo Indocumentados serían rastreados por aplicación\nApril 14, 2022\nEl Nuevo Herald (FL) Los ocho tipos de ‘parole’, el permiso de admisión que sirve de puerta de entrada legal a EEUU\nBy Isabel Olmos\nApril 14, 2022\nTelemundo 51 Inmigrantes enfrentan retrasos en casos de asilo (Video)\nApril 14, 2022\nPeriódico Cubano Alertan sobre estafas a cubanos en la compra de pasajes a Guyana y Nicaragua\nApril 14, 2022\nLa Opinión (CA) Cuáles son los inmigrantes indocumentados que son prioridad de deportación tras ajuste de tribunal\nApril 14, 2022\nEl Diario-La Prensa (NY) Tribunal apoya prioridades de deportación de inmigrantes de ICE\nBy Jesús García\nApril 14, 2022\nDiario Las Américas DeSantis alerta a inmigrantes ‘sin papeles’: “No vengan a Florida”\nBy Jesús Hernández\nApril 14, 2022\nYahoo Noticias Revisiones a transporte: Greg Abbott pone en riesgo la economía de Texas por su pelea con Joe Biden\nBy Soledad Villa\nApril 14, 2022\nEl Latino San Diego Descubren masivo fraude de matrimonios falsos por green card\nBy Manuel Ocaño\nApril 14, 2022\nUnivision “Váyase a Ruanda”: el país que decidió enviar a solicitantes de asilo a más de 4,000 millas de distancia\nApril 14, 2022\nUnivision Los coloca “en la mira de ICE”: qué pasa ahora con los inmigrantes que Texas envió a Washington\nBy Jorge Cancino\nApril 14, 2022\nEl Diario-La Prensa (NY) Denuncian maltrato y discriminación contra afroamericanos en centro de inmigrantes de GEO en Colorado\nBy Agencia EFE\nApril 14, 2022\nLa Conexión USA (NC) Periodista asilado pide “escuchar el clamor de la gente” sobre inmigración\nBy Agencia EFE\nApril 14, 2022\nNoticias Telemundo Lo que debe saber sobre la renovación de permisos en línea para beneficiarios de DACA (Video)\nApril 14, 2022\nMississippi Catholic Disuasión abruma frontera antes de levantamiento de restricción sanitaria\nBy Rhina Guidos\nApril 14, 2022\nNoticia El Correo Activistas y defensores: ‘Presupuesto estatal da la espalda a familias inmigrantes’\nApril 14, 2022\nTampa Hoy DeSantis les dice a los migrantes en autobús que llegó a DC de Texas: “No vengan a Florida”\nApril 14, 2022\nNoticias Telemundo ¿Hay probabilidad de que me den el asilo si lo presento tres años después de que entré como turista?",
    "Vance endorsement in crowded Ohio senate race, sources say\nBy Marc Caputo and Vaughn Hillyard\nApril 14, 2022\nDaily Kos Facing international blowback over unnecessary checks, Abbott stages photo-op with Mexican governor\nBy Gabe Ortiz\nApril 14, 2022\nNPR Welcome.US helps refugees, such as Afghans and Ukrainians, settle in the U.S.\nBy Morning Edition\nApril 14, 2022\nBlomberg Short-Handed Farm Groups See Path to Bipartisan Immigration Deal\nBy Ellen M. Gilmer\nApril 14, 2022\nLaw 360 US Judge Inclined To Make Texas File New Title 42 Suit\nBy Katie Buehler\nApril 13, 2022\nNew York Times Democrats Face Tough Questions as a Border Saga Enters a New Chapter\nBy Leah Askarinam\nApril 14, 2022\nNew York Times Texas Governor Offers Deal to End Snarled Traffic at Border\nBy J. David Goodman\nApril 14, 2022\nNew York Times Ukrainians Face New Hurdle at U.S. Border: No Dogs\nBy Miriam Jordan\nApril 14, 2022\nWashington Post Economic toll in Texas worsens as trucks remain stopped at Mexico border\nBy Laura Reiley\nApril 14, 2022\nTexas Tribune Gov.",
    "(Video)\nApril 14, 2022\nUnivision Fiscal general de Florida anuncia acciones legales “para prevenir la entrada masiva de migrantes”\nApril 14, 2022\nLa Opinión (CA) Veinte fiscales de EEUU reclaman mantener deportación rápida de indocumentados\nApril 14, 2022\nPeriódico Cubano Migrantes cubanos ingresaron a EEUU tras pasar a un costado de un puente internacional\nApril 14, 2022\nCNN en Español Videos muestran un fatal tiroteo policial contra Patrick Lyoya, en Michigan, tras de pelea en una parada de tráfico\nBy Omar Jiménez, Elizabeth Joseph y Steve Almasy\nApril 14, 2022\nLa Opinión (CA) ¿Hay discriminación contra refugiados latinos en la frontera?",
    "NC Policy Watch The tragicomedy of the U.S. immigration debate\nBy Maribel Hastings and David Torres\nApril 15, 2022\nThe Hill Vulnerable Democrats buck Biden on Trump-era immigration fight\nBy Jordain Carney\nApril 14, 2022\nThe Hill Second bus drops off migrants near Capitol\nBy Rafael Bernal\nApril 14, 2022\nNBC News Young Latino men may be ‘easy targets’ for disinformation on immigration, report says\nBy Nicole Acevedo\nApril 14, 2022\nNBC News Trump plans J.D.",
    "By Isabella Grullón Paz\nApril 14, 2022\nWashington Post More Immigration Will Do Little to Slow U.S. Inflation\nBy Ramesh Ponnuru\nApril 14, 2022\nWashington Post Greg Abbott’s border stunts show the GOP doesn’t want to fix immigration\nBy Paul Waldman\nApril 14, 2022\nWashington Post Greg Abbott is starving his own voters to own the libs\nBy Catherine Rampell\nApril 14, 2022\nThe Hill Do Democrats really understand why that red wave is coming?",
    "Greg Abbott announces deals with two more Mexican governors to halt Texas’ vehicle inspections at the border\nBy Uriel J. Garcia\nApril 13, 2022\nWMUR Latino activists, lawmakers express outrage toward Sen. Hassan’s southern border visit\nBy Adam Sexton\nApril 14, 2022\nNew York Times ‘Thank you, Zach!’: New York has a new hero.",
    "By Manuel Ocaño / Especial\nApril 13, 2022\nLa Opinión (CA) Cuáles son los inmigrantes indocumentados que son prioridad de deportación tras ajuste de tribunal\nApril 14, 2022",
    "(Video)\nApril 14, 2022\nNoticias Telemundo Mi amiga está detenida por inmigración, el juez le negó la fianza y está enferma.",
    "There may be more.",
    "¿Cómo la ayudo?"
  ]
}