{
  "id": 6893,
  "mediaId": 2752,
  "date": "2022-01-24",
  "headline": "JD Vance Pretty Sure America Needs To Laugh More At People’s Tragic Deaths",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTA1MzE4Ny9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY1MzU0MzExMn0.60sPycxuZoD7AJmvxvih7b8jXJoCAJgQD6TneChI9mQ/img.png?width=1200&coordinates=88%2C0%2C0%2C0&height=600",
  "link": "https://www.wonkette.com/jd-vance-pretty-sure-america-needs-to-laugh-more-at-peoples-tragic-deaths",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    0
  ],
  "sentences": [
    "The joke here is that Vance doesn’t know how the First Amendment works: Private companies can’t “censor” anyone, and the government can’t force private companies to offer their platforms to politicians or even random bigots who want to spread bigoted lies and promote violence.",
    "Hillbilly Effigy author JD Vance is running for the vacant Senate seat from Ohio, and he’s apparently decided the best way to distinguish himself from his Republican primary opponents is to act like an unrepentant asshole.",
    "Vance said that people are wary of the vaccine because it’s so “new” but he also blamed the Biden administration for not providing enough monoclonal antibodies — a treatment that is just as new as the vaccine.",
    "Spectrum News reporter Taylor Popielarz interviewed Vance for an article that described him as one of “six serious candidates” for the GOP nomination, but Vance insists that he’s not serious.",
    "Unlike Mandel, who is nuttier than a king-sized Snickers, Vance won’t outright embrace Donald Trump’s Big Lie about the 2020 election, but he’ll imply it was fixed with Jewish Big Tech money.",
    "Vaccines don’t just keep yourself from dying but others, as well, because you’re less likely to spread COVID-19 and clog up the hospital system while scarfing down monoclonal antibodies.",
    "VANCE: Well, because I think with vaccines, you're talking about your own medical decisions for your own body, whereas abortion you're talking about discarding another human life, right?",
    "Popielarz asked Vance why Ohioans should vote for a callous creep who cracked jokes about a fatal shooting on the set of an Alec Baldwin movie — you know, when a human being died.",
    "POPIELARZ: And they say, does that really — you had said, \"Dear Jack, let Trump back on, we need Alec Baldwin tweets\" — as this, you know, deadly shooting was playing out.",
    "Vance claims we “have bad censorship problems in this country because of social media” and vowed to break up the big technology companies, which you can do as a senator.",
    "VANCE: So I think the idea that we can't have somewhat offensive humor sometimes from our politicians is basically just asking us to have fake politicians all the time.",
    "This awful person who’ll probably lose the GOP primary to Josh Mandel, who’s worse, seems to think the key to political authenticity is jerkass behavior.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Here are some more excerpts from Vance's standup act:\nPOPIELARZ: On the pandemic, you've said publicly that you were vaccinated against COVID-19.",
    "Zuckerberg donated more than $400 million to help local elections offices prepare for the November election, which took place during a pandemic.",
    "That half hour at CVS might cut into Vance's mocking the dead on Twitter time, but you should get boosted even after having had COVID-19.",
    "Do we really think it's okay for one of the most powerful social media companies in the world to go up and buy local boards of elections?",
    "VANCE: I'd say like, look, people may not always agree with my rhetoric, but I think unfortunately, our country's kind of a joke.",
    "If a voter sees that as they're plugging into this race, and they say, is that the type of rhetoric I want a US senator to have?",
    "JD VANCE, ASSHOLE: We Saw JD Vance And WaPo In A Closet Making Babies\nVance opposes vaccine mandates but supports abortion bans.",
    "Halyna Hutchins was a real person who probably enjoyed a good joke, as long as it wasn’t the “Ha, Ha, this person’s dead” kind.",
    "During his Senate campaign, Vance sacrificed every last shred of dignity and human decency he might’ve possessed.",
    "Most mammals were glad Trump wasn’t on Twitter so he couldn’t make a public mockery of a woman’s tragic death.",
    "VANCE: I mean, the thing that I talk the most about, of course, is the $420 million Zuck [Zuckerberg] bucks.",
    "Also, I don’t have a medical degree, but I think most abortions occur inside someone’s \"own body.\"",
    "Every single person that I knew was joking about what would Donald Trump say if he was on Twitter.",
    "This is the sort of blatant disinformation that would get an average person's account suspended.",
    "It worked for Ted Cruz, and that’s certainly a man who’s made some solid life choices.",
    "Maybe it turns some people off, but I think the realness turns more people on.",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "[yeah, he said that — SER] And we should be able to tell jokes about it.",
    "I think it's important for our politicians to have a sense of humor.",
    "And I think if you do, you don't want to live in a real democracy.",
    "He’s modeling himself after noted populist hero Andrew Dice Clay.",
    "This is not the same as “buying” local boards of elections.",
    "You know, so not planning on getting boosted anytime soon.",
    "He's also on the board of the Portland Playhouse theatre.",
    "No wonder Vance wants to crack down on social media.",
    "There was no attempt to alter or suppress the vote.",
    "I think it's important for us to be real people.",
    "That to me is the big and obvious difference.",
    "His son describes him as a “play typer guy.\"",
    "Please click the clickie, if you are able.",
    "Nothing about JD Vance turns anyone on.",
    "That’s the whole problem with America.",
    "How often would you like to donate?",
    "Follow Stephen Robinson on Twitter.",
    "That's not what I'm going to be.",
    "(He phrased this more politely.)",
    "He’s a joke with no punchline.",
    "He writes reviews for the A.V.",
    "His explanation is hilarious!",
    "We all got COVID in December.",
    "It’s nice to have standards.",
    "I didn't have any symptoms.",
    "How do you explain that?",
    "Did you get boosted?",
    "VANCE: I've not.",
    "Vance has jokes.",
    "No, I've not.",
    "OPEN THREAD.",
    "That's you!",
    "I don't.",
    "No, J.D.",
    "Right?",
    "Right?"
  ]
}