{
  "id": 697,
  "mediaId": 2664,
  "date": "2022-04-11",
  "headline": "Conservative white men are on a rampage",
  "image": "https://www.rawstory.com/media-library/angry-man.jpg?id=25744884&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/conservative-white-men-are-on-a-rampage-of-rage/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Diane Roberts",
  "authorUrl": "https://www.rawstory.com/u/dianeroberts-floridaphoenix",
  "termIds": [
    2144,
    2485,
    2943,
    3466,
    4051,
    4372,
    878,
    1171
  ],
  "sentences": [
    "‘Not our fight’\nOne of Vance’s campaign ads intones, “Biden’s open border is killing Ohioans, with more illegal drugs and more Democrat voters pouring into this country.”\nUkraine, he says, is “not our fight.”\nHospitals bombed, civilians executed, children shot, women raped, Western democracy under siege, but hey, who cares?",
    "Now he wants to join Lindsey Graham, Ted Cruz, Tom Cotton, and the rest of the mentally-deformed white boys in the United States Senate, and can be found stomping around Ohio declaring the desperate asylum-seekers at our southern border constitute a way worse problem than genocidal Russians in Ukraine.",
    "If a high schooler’s future is destroyed by having an unwanted child, or a girl falls deeper into poverty because of a baby she can’t afford to raise, or if women die from backstreet abortions just like in the Good Old Days pre-Roe when men were men and women were ladies, well, that’s the wages of sin.",
    "NOW WATCH: Repair shop owner knows of 'multiple attempts' to 'insert questionable material' into Hunter Biden's laptop\nShop owner says 'multiple attempts' to 'insert questionable material' into Hunter Biden's laptop",
    "They hate the idea that children might read books by Toni Morrison or James Baldwin or Nikole Hannah-Jones or Ibram X. Kendi, causing white parents to feel a trifle itchy about America’s foundational racism.",
    "He was practically foaming at the mouth, demanding she rate her faith and shouting about Brett Kavanaugh, child molesters, and how Jackson is a Black woman, fine, but she is the wrong kind of Black woman.",
    "Fine pledges to introduce legislation hitting doctors with a “felony child abuse” charge if they provide gender-affirming care and suggests maybe they could lose their medical license to boot.",
    "Republicans, too frightened to confront reality, use the parade of xenophobic, homophobic, transphobic, misogynistic, anti-intellectual yahoos provided on Fox “News” to comfort them.",
    "When the Supreme Court rules later this year, she’ll almost certainly vote to destroy reproductive rights in the United States, the dearest wish of the fundamentalist minority.",
    "Some Republicans detest brown people even more than they love white people, but Black people remain the most loathed object of their racist obsessions.",
    "Ron DeSantis’ attempts to destroy two “Black opportunity” congressional districts and pushing bills to make it harder for people of color to vote.",
    "Deranged White Man Syndrome has not yet been listed in the Diagnostic and Statistical Manual of Mental Disorders, but it’s just a matter of time.",
    "Florida Phoenix is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "You are a rodent-like mammal covered in sharp points, but porcupines are intelligent creatures whereas you are a hate-filled, irascible idiot.",
    "I suspect that somewhere in the deep recesses of their brains, they know that while they may hold power at the moment, the world is changing.",
    "Fine has called schools “cesspools” of “leftist leftism,” Muslims “monsters” and “terrorists,” and called for Palestinians to be annihilated.",
    "Gay sex freaks them out and the thought that gay kids even exist infuriates them so much they’re going the extra mile to be cruel.",
    "Seriously, these dudes (and they are mostly male-gendered persons) are on a rampage of rage and loathing which cannot be healthy.",
    "Randy Fine recently tweeted his views on gender: “I can say I’m a porcupine, but that doesn’t make it so.”\nToo true, Rep. Fine.",
    "Thinking about how they’ll soon have to address a Black woman as “Justice” probably has them hitting the Coors extra hard.",
    "If Oklahoma’s governor signs a new bill (as is likely) doctors performing an abortion will be charged with a felony.",
    "They hate having to ever hear about slavery or Jim Crow or the Rosewood Massacre or all those lynchings in Florida.",
    "Tucker Carlson leads them in the liturgy of Orwell’s “two minutes hate” and, for a little while, they feel better.",
    "U.S. Sen. Lindsey Graham stormed out of Judge Ketanji Brown Jackson’s Supreme Court confirmation hearings twice.",
    "We have these terrifying impoverished brown people yearning to be free and constantly bugging us about it.",
    "The crucial social and moral issue of our time is clearly that trans girls be banned from women’s sports.",
    "So, no puberty-blocking drugs for a kid wrestling with their gender; no counseling for gender dysphoria.",
    "Evidently the high rate of depression and suicide among trans kids is of no interest to Randy Fine.",
    "In Florida, abortion after 15 weeks likely will be verboten, with no exceptions for rape or incest.",
    "Republicans can’t stand seeing Black folks in positions of power (unless it’s Clarence Thomas).",
    "Beware of Karma: You may one day have a gay child, a trans niece, a brown daughter-in-law.",
    "Vance, author of “Hillbilly Elegy,” used to do a decent imitation of a sane conservative.",
    "She’s the Republican pin-up, white, pretty, a wife, a mother, a religious fanatic.",
    "Then they can go back out in the scary world and do what bullies do: punch down.",
    "Let’s hope they get serious therapy: This is a sick, sick, sick bunch of people.",
    "Fundamentalist minority\nRepublicans don’t just hate Black women, though.",
    "Democrats are “human feces.”\nHarvard, his alma mater, must be so proud.",
    "Tormenting trans kids\nNow he’s on a mission to torment trans kids.",
    "Contact Editor Diane Rado for questions: info@floridaphoenix.com.",
    "Living in a constant tantrum must be exhausting for Republicans.",
    "Almost no one should be having sex, except straight white men.",
    "Republicans shrug: If you’re raped or trafficked, too bad.",
    "Meanwhile, in Texas, abortion is banned after six weeks.",
    "You shouldn’t have been having sex in the first place.",
    "Florida Phoenix maintains editorial independence.",
    "Follow Florida Phoenix on Facebook and Twitter.",
    "If the contraceptives fail, that’s your fault.",
    "Which brings us to Rep. Randy Fine, R-Hell.",
    "Or civilization as we know it will crumble.",
    "Not Justice Amy Coney Barrett, of course.",
    "To which I say: Get help, son.",
    "And they can’t stand it.",
    "Republicans are angry.",
    "They hate most women.",
    "So very, very angry.",
    "Witness Gov.",
    "Good girl!",
    "J.D."
  ]
}