{
  "id": 7205,
  "mediaId": 2575,
  "date": "2022-01-31",
  "headline": "J.D. VANCE: 'Just get rid of the ATF'",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-chat/4034214/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "by 11 posted onby Georgia Girl 2 (The only purpose of a pistol is to fight your way back to the rifle you should never have dropped)\n\nTo: RandFan\n\nGet rid of the BATFe an brand every single person who works for the agency with hot iron on their forehead.",
    "To: RandFan\n\nTangent:\n\nI’m wondering why nobody (AFAIK) has filed a Form 4 or 1, then immediately filed suit against BATFE over “rights delayed are rights denied”, using the case itself, reaching court before NFA stamp approval as proof of delay.",
    "by 4 posted onby READINABLUESTATE ( ‘When tyranny becomes law, resistance becomes duty.’)\n\nTo: JimRed\n\nI think it was\n\n\n\nTo: RandFan\n\nAnd take the FBI, CIA and the rest of the woke alphabet with you.",
    "TOPICS:\n\nChit/Chat\n\nKEYWORDS:\n\nbanglist\n\nHe sounds good here...\n\n\n\nTo: RandFan\n\nIn before “It should be a convenience store”....\n\n\n\nby 2 posted onby JimRed (TERM LIMITS, NOW!",
    "Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "To: DarrellZero\n\nATF, FIB, CIA, FJB\n\n\n\nby 7 posted onby MtnClimber (For photos of Colorado scenery and wildlife, click on my screen name for my FR home page.)",
    "VANCE: 'Just get rid of the ATF'\n\ntwitter ^ | Jan 31 | JD Vance\n\nPosted on by RandFan\n\n@JDVance1\n\nWhy does the Biden administration need this info?",
    "by 10 posted onby SoConPubbie (Mitt and Obama: They're the same poison, just a different potency)\n\nTo: RandFan\n\nI’ll second that emotion.",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "To: algore\n\nThat’s what’s great about small towns everybody has quiet nerves when taking night walks and sleep better.",
    "by 9 posted onby freedomjusticeruleoflaw (Strange that a man with his wealth would have to resort to prostitution.)",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "by 12 posted onby zeugma (Stop deluding yourself that America is still a free country.)",
    "To: RandFan\n\nClassify as something a politician will say to appear to be on your side.",
    "If you're a cartel running drugs and guns on our southern border, Biden doesn't care.",
    "It already is...\n\n\n\nby 8 posted onby Yo-Yo (Is the /sarc tag really necessary?)",
    "by 13 posted onby ctdonath2 (Statistics don't matter when they happen to you.)",
    "To: JimRed\n\n\n\n\n\nby 3 posted onby budj (Combat vet, 2nd of three generations.)",
    "To: RandFan\n\nThat’s a start, hopefully more alphabet bureaus would follow.",
    "To: JimRed\n\nAlcohol, Tobacco, Firearms....who’s bringing the chips?",
    "[records of gun sales]\n\nRelatedly, why does the ATF actually exist?",
    "To: JimRed\n\nIn before “It should be a convenience store”....",
    "Or just toss them all over the sides of the Grand Canyon.",
    "But if you buy a gun legally you get tracked by the ATF?",
    "(Excerpt) Read more at twitter.com ...",
    "To: RandFan\n\nHe has my support.",
    "TRUTH is the new HATE SPEECH.)",
    "Militia to the border!",
    "Just get rid of it.",
    "Either way works.",
    "Skip to comments.",
    "J.D."
  ]
}