{
  "id": 747,
  "mediaId": 2659,
  "date": "2022-04-15",
  "headline": "Trump Helps Democrats Flip Ohio Senate Seat Blue By Endorsing J.D. Vance",
  "image": "https://www.politicususa.com/wp-content/uploads/2021/08/JD-Vance.jpg",
  "link": "https://www.politicususa.com/2022/04/15/trump-helps-democrats-flip-senate-seat-blue-by-endorsing-j-d-vance.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Easley",
  "authorUrl": "",
  "termIds": [
    2201,
    3466,
    305,
    767,
    878,
    1171,
    5212,
    5239
  ],
  "sentences": [
    "Republicans in Ohio begged Trump not to endorse Vance, but as usual, Trump didn’t listen and has helped Democrats immensely by endorsing a celebrity candidate who if gets the nomination will have a difficult time with his opponent Democratic Rep. Tim Ryan.",
    "Vance pic.twitter.com/KVLpipj1bg\n— Liz Harrington (@realLizUSA) April 15, 2022\nTrump claimed to be endorsing Vance, because “he gets it now,” which is Trump code for Vance has sufficiently sucked up to please Trump.",
    "Trump keeps meddling in Senate races, and just like in 2020, it appears that his goal is to make sure that Mitch McConnell never becomes Majority Leader again.",
    "Donald Trump also completely mucked up the US Senate primary in neighboring Pennsylvania by endorsing Dr. Oz over the Republican Party’s preferred choice.",
    "Unlike in Pennsylvania, where Oz could win, Vance is in third place in Ohio and has seen his campaign struggle to get off of the ground.",
    "The failed former president also suggested that he studied the race in Ohio carefully (which means Sean Hannity filled him in).",
    "Donald Trump and his ability to pick Senate candidates that help Democrats has struck again with his endorsement of J.D.",
    "For Democrats, Donald Trump is the gift that keeps on giving.",
    "President Donald J. Trump announces his endorsement of J.D.",
    "Here is the endorsement:\nNEW!",
    "Vance in Ohio."
  ]
}