{
  "id": 774,
  "mediaId": 6403,
  "date": "2022-04-18",
  "headline": "Hillbilly Eulogy",
  "image": "https://prospect.org/downloads/17841/download/vance%2004182022.jpg?cb=11d426ff1d9520ae9e4e4e28fd3b1af4&w=1200",
  "link": "https://prospect.org/blogs-and-newsletters/tap/hillbilly-eulogy/",
  "mediaOutlet": "American Prospect",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Kuttner",
  "authorUrl": "https://prospect.org/topics/robert-kuttner/",
  "termIds": [
    1684,
    2201,
    3430,
    3466,
    4762,
    878,
    1171,
    4984,
    5212
  ],
  "sentences": [
    "In a Senate race between a fake populist who became a hedge fund exec and a real populist—most likely Tim Ryan—who correctly blames structural factors rather than bad personal behavior for disappearing jobs, the real populist has the advantage.",
    "The winning formula for papering over schisms between the MAGA base and the GOP establishment was displayed last year in Virginia, where Wall Street Republican Glenn Youngkin postured moderate but won over the Trump base with winks and nods.",
    "In this review of Hillbilly Elegy and several other books, I referred to Vance as “Charles Murray with a shit-eating grin.”\nMeanwhile, Trump’s endorsement further splits the Republican electorate.",
    "His best-selling book supposedly celebrated the grit of hillbillies, but the subtext was that people dealt a bad hand have only themselves to blame for their dysfunctional behavior.",
    "You will stay engaged with the best and brightest political and public policy reporting and analyses, and help keep this website free from paywalls and open for all to read.",
    "Trump endorsed Oz in the Pennsylvania primary over an establishment candidate, David McCormick, a former hedge fund CEO, who is a far stronger candidate.",
    "Trump has an unfortunate habit of moving impulsively, failing to exercise due diligence, blowing off old allies, and endorsing losers.",
    "Consider the fellow showman-shaman with the perfectly Dickensian name Dr. Oz (pay no attention to the man behind the curtain).",
    "In the race for governor, Trump nemesis Brian Kemp, the incumbent, is well ahead of Trump’s branded candidate, David Perdue.",
    "Join the Prospect today\nSupport The American Prospect's independent, nonprofit journalism by becoming a member today.",
    "In Georgia, Trump candidate Herschel Walker, with a faked résumé, is barely ahead of Raphael Warnock in the polls.",
    "Vance also downplayed the fact that the grandparents who rescued him from a ruined life were New Deal Democrats.",
    "Our membership levels offer a range of perks including an opt-in to receive the print magazine by mail.",
    "But elsewhere, Trump’s hapless efforts to play kingmaker could be the Democrats’ secret weapon.",
    "Vance answers a question during Ohio’s U.S. Senate Republican primary debate on March 28, 2022.",
    "It’s not clear whether Trump’s seal of approval is a benediction or the kiss of death.",
    "Trump was unable to screw that up because he didn’t have a viable surrogate.",
    "More often, they either blow up, or clear the field of stronger candidates.",
    "In Ohio, Vance, like Trump, keeps reinventing himself and his positions.",
    "At this writing, Vance is running fourth among Republicans in the polls.",
    "More from Robert Kuttner\nTrump is attracted to TV fakes like himself.",
    "In Alabama, Trump dumped his endorsed Senate candidate, Mo Brooks.",
    "Vance is in a primary battle for the Republican Senate nomination.",
    "Trump’s endorsements, one after another, have been accident-prone.",
    "Trump hoped that his endorsements would clear the field.",
    "If Vance were to be nominated, advantage Democrats.",
    "Author and financier J.D.",
    "Fortify your mind!",
    "J.D."
  ]
}