{
  "id": 813,
  "mediaId": 2663,
  "date": "2022-04-22",
  "headline": "Adult child Don Jr. is freaking out about not getting his way. It’s not going well for him.",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/04/donald-trump-jr-bed-video-670x503-1.webp?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/adult-child-don-jr-freaking-not-getting-way-not-going-well-20220422",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan Tracer",
  "authorUrl": "https://www.queerty.com/author/dan-tracer",
  "termIds": [
    1586,
    1804,
    1902,
    2201,
    3466,
    4086,
    232,
    4830,
    5212
  ],
  "sentences": [
    "Trump’s eldest son, who has championed Vance, jabbed McIntosh without naming him this week https://t.co/TkV0qtriDb\n— Maggie Haberman (@maggieNYT) April 21, 2022\nRelated: Don Jr.’s ‘Don’t Say Gay’ rant is batsh*t crazy even by his standards\nTrump, Jr. escalated the conservative rift by posting a video attacking Vance’s primary opponent Josh Mandel, whom McIntosh endorsed.",
    "While the organization was “vehemently” opposed to Donald Trump’s own presidential campaign, Club for Growth has been described as “one of the biggest backers” of Republicans who later voted to overturn the results of the 2020 United States presidential election, having spent around $20 million on their campaigns in 2018 and 2020.",
    "According to New York Times reporter Maggie Haberman, Donald Trump responded by instructing an assistant to text McIntosh “Go f**k yourself.” Then, Trump, Jr. tweeted a video of himself campaigning for Vance while blasting “the RINO frauds attacking” the candidate.",
    "A person close to Don Jr says that If the Club continues running these ads, Don Jr is considering opposing all newly endorsed Club candidates unless/until David McIntosh is removed by the board.",
    "Trump, Jr. is furious with the conservative organization Club for Growth for breaking ranks with Trumpworld on primary candidate endorsements, and he’s reportedly thrown an all-out fit.",
    "In addition to the Ohio Senate primary, Trump and Club for Growth also back different candidates in the Alabama Senate primary and the Arizona gubernatorial primary.",
    "According to Washington Post investigative reporter Jack Dawsey, Club for Growth plans to increase their spending on Vance attack ads.",
    "The eldest Trump offspring then threatened to attack other Club for Growth candidates unless McIntosh is removed by the board.",
    "Donald Trump, Jr. put his political influence to the test this week, and it is not going well for him.",
    "It began when Club for Growth chief David McIntosh ran ads against Trump-endorsed J.D.",
    "— Maggie Haberman (@maggieNYT) April 21, 2022\nSo how’d that work out for Jr.?",
    "Don Jr is likely to make at least one more appearance for Vance.",
    "Vance in Ohio’s GOP Senate primary."
  ]
}