{
  "id": 828,
  "mediaId": 2527,
  "date": "2022-04-15",
  "headline": "Trump endorsements—no slam dunk so far",
  "image": "https://www.brookings.edu/wp-content/uploads/2022/04/2022-01-30T043003Z_1072861570_RC2C9S924G2C_RTRMADP_3_USA-TRUMP.jpg?w=1200&h=630&crop=1",
  "link": "https://www.brookings.edu/blog/fixgov/2022/04/15/trump-endorsements-no-slam-dunk-so-far/",
  "mediaOutlet": "brookings.edu",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elaine Kamarck",
  "authorUrl": "https://www.brookings.edu/experts/elaine-kamarck/",
  "termIds": [
    2201,
    3103,
    3466,
    4192,
    349,
    372,
    878,
    4984,
    5239
  ],
  "sentences": [
    "There’s an old saying in politics, which became the moniker of EMILY’s List, an organization founded to raise money for women candidates—“Early Money is like yeast.” It was a clever play on Emily, but its message is profound, not just for women but for all candidates at any time.",
    "Nonetheless, in order to get an early look at Trump’s endorsement clout, we calculated the total cash on hand among all the candidates who filed with the FEC and then calculated the percentage of that cash that was held by the person Trump endorsed.",
    "Some weeks ago, I looked at Trump’s political hold on the Republican Party and speculated that he could turn out to be “the little man behind the curtain in The Wizard of Oz,” (and in the case of the Pennsylvania Senate race, quite literally).",
    "It should come as no surprise to observers of Donald Trump’s political career, that his endorsements in the 2022 midterms are chaotic and controversial, but they are also not nearly as decisive as he would like them to be.",
    "So far, there are fifteen Trump candidates who do not have more than 50% of the cash on hand in their races, although four of those candidates are in multi-candidate races and have more money than their opponents.",
    "It does not include Trump-endorsed incumbents for one reason, incumbent re-election rates in primaries are extremely high (98%) so endorsements of incumbents don’t really test the endorser’s political impact.",
    "Of course, these are subject to change in the future—some of these primaries don’t happen till the summer and Trump has barely begun to open his war chest for his favorite candidates.",
    "Recently, the Republican establishment in Pennsylvania was shocked and disappointed by Trump’s endorsement of Dr. Mehmet Oz in the Republican primary race for the U.S. Senate.",
    "In these high-profile primaries and in other less publicized primaries, the Trump magic is not nearly as powerful as conventional wisdom (and Trump himself) would have it.",
    "And yet, as Trump’s emergency infusion of money into his Georgia candidate shows, his endorsement doesn’t result in easy money.",
    "Early money helps a candidate hire professional staff, lock in ad time on radio and TV and, importantly, raise more money.",
    "The chart looks at the money candidates have on hand for their primaries according to their first quarter FEC reports.",
    "There are only six Trump candidates who have substantially more cash on hand at this point than their opponents.",
    "And in Georgia, Trump has given David Purdue, the former senator who is challenging one of Trump’s nemeses Gov.",
    "Take a look at the following chart which is a snapshot in time of how Trump candidates are doing financially.",
    "Vance, who, like Dr. Oz, has a less than stellar track record when it comes to conservative issues.",
    "For instance, Trump endorsed Dr. Oz in Pennsylvania after the first quarter FEC filings were in.",
    "In the race for campaign cash, most Trump endorsees are having to fight for money.",
    "So far, most of Trump’s non-incumbent candidates are behind in the money primary.",
    "Brian Kemp, a large influx of cash in an effort to help his sagging campaign.",
    "In Ohio, some Republicans are trying to prevent a Trump endorsement of J.D.",
    "A man whose roar is greater than his actual strength.",
    "This is subject to change, of course."
  ]
}