{
  "id": 838,
  "mediaId": 2716,
  "date": "2022-04-18",
  "headline": "J.D. Vance said Trump might be 'America's Hitler' in 2016 text message",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1650318129/GettyImages-1239921963.jpg",
  "link": "https://theweek.com/2022-election/1012706/jd-vance-said-trump-might-be-americas-hitler-in-2016-text-message",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grayson Quay",
  "authorUrl": "https://theweek.com/authors/grayson-quay",
  "termIds": [
    1768,
    2201,
    3466,
    3833,
    4555,
    422,
    1171,
    5371
  ],
  "sentences": [
    "The screenshot below is @JDVance1’s unfiltered explanation from 2016 of the breakdown in Republican politics that he now personally is trying to exploit.The “America’s Hitler” bit is at the end.The public deserves to know the magnitude of this guy’s bad faith.",
    "Vance's former roommate on Monday released a purported screenshot of a 2016 conversation between him and Vance in which the now pro-Trump Senate candidate wrote that the former president might be \"America's Hitler.\"",
    "Josh McLaurin, who attended Yale Law School with Vance and has served in the Georgia House of Representatives since 2019, previously alluded to the conversation with Vance in a tweet posted Thursday.",
    "Former President Donald Trump endorsed Vance in Ohio's competitive GOP Senate primary on Friday, writing that although Vance \"said some not-so-great things about me in the past,\" he \"gets it now.\"",
    "pic.twitter.com/79Z0qSWFWF\n— Josh McLaurin (@JoshforGeorgia) April 18, 2022\n\"The public deserves to know the magnitude of this guy's bad faith,\" McLaurin tweeted alongside the screenshot.",
    "Trump, Vance continued, \"is the leader of this movement, and if I actually care about these people and the things I say I care about, I need to just suck it up and support him.\"",
    "\"I go back and forth between thinking Trump is a cynical a--hole like Nixon who wouldn't be that bad (and might even prove useful) or that he's America's Hitler,\" Vance wrote.",
    "In the message, Vance wrote that Republicans had neglected \"lower-income, lower-education white people,\" leaving an opening for a \"demagogue\" like Trump.",
    "In 2016, Vance called himself a \"Never Trump guy\" and referred to Trump as an \"idiot,\" Politico reported.",
    "In a 2021 interview with Time magazine, Vance explained how he came around to Trump.",
    "\"I sort of got Trump's issues from the beginning,\" Vance said.",
    "\"I just thought that this guy was not serious.\"",
    "J.D."
  ]
}