{
  "id": 959,
  "mediaId": 2512,
  "date": "2022-04-08",
  "headline": "'The jackboot fits': Columnist torches GOP over perplexing response to DNC chair’s 'fraud, fear and fascism' claim about the party",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29479610&width=1200&coordinates=0%2C127%2C0%2C128&height=600",
  "link": "https://www.alternet.org/2022/04/wapo-op-ed-torches-gop/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meaghan Ellis",
  "authorUrl": "https://www.alternet.org/author/meaghanellis",
  "termIds": [
    1672,
    3190,
    4628,
    4776,
    304,
    305,
    877,
    878
  ],
  "sentences": [
    "\"The 'big lie' about a rigged election, accepted by two-thirds of Republican voters, has spawned new frauds about the dangers of coronavirus vaccines (leading to sharply higher death rates in heavily Republican counties) and the promise, touted by Sen. Ron Johnson (R-Wis.) of the deworming drug ivermectin to treat covid-19; an exhaustive new study finds the drug useless,\" he wrote.",
    "In a recent ad, he said, “Biden’s open border is killing Ohioans, with more illegal drugs and more Democrat voters pouring into this country.”\nAssessing Republican lawmakers' opposition to a resolution in support of the North Atlantic Treaty Organization (NATO), Milbank explained how their perspective aligns with fascism.",
    "Harrison described Cotton as a “maggot, infested man” while collectively calling out the Republican Party and labeling it a political party “built on fraud, fear, and fascism.”\nAlmost immediately after Harrison made the remarks, the Republican National Committee (RNC) fired back with a response.",
    "On another note, he added, \"A Republican National Committee resolution, never rescinded, refers to the Capitol insurrection not as an authoritarian attempt to overthrow democracy and keep the defeated Trump in power but as legitimate political discourse.'",
    "In reference to fraud, Milbank highlighted the irony Republicans' claims of fraud as he noted the evidence of fraud that has been uncovered actually proves it was likely committed by members of their own party.",
    "\"Sixty-three House Republicans — 30 percent of the caucus — voted against a resolution this week affirming unequivocal support for NATO as authoritarian Russia attacks democratic Ukraine,\" he wrote.",
    "As Democratic lawmakers worked to finalize the confirmation of US Supreme Court Justice Ketanji Brown Jackson, a number perplexing events took place in national political theater this week.",
    "But too many others are subverting democracy, cavorting with white nationalists, spreading racist fears and fantasizing about extrajudicial punishment for political opponents and the media.",
    "\"Interestingly, a statement from the Republican National Committee taking offense at the 'maggot-infested' charge did not dispute the “fraud, fear and fascism” formulation,\" Milbank wrote.",
    "But instead of criticizing the Democratic official for his charge about the party, the RNC focused more on his remarks targeting Cotton.",
    "),\" Milbank highlighted, \"said people like Ketanji Brown Jackson become public defenders because 'their heart is with the murderers.'",
    "One of the most pivotal moments centered on Democratic National Committee Chair Jaime Harrison’s attack on Sen. Tom Cotton (R-Ark.)",
    "Cotton said Justice Robert H. Jackson 'left the Supreme Court to go to Nuremberg and prosecute the case against the Nazis.",
    "So, Milbank decided to discuss those three keypoints as he highlighted how they factually relate to the Republican Party.",
    "In a newly published op-ed, The Washington Post's Dana Milbank highlighted the seemingly odd argument from the party.",
    "following the Republican senator's suggestion that Jackson is a Nazi sympathizer, per The Washington Post.",
    "He went on to offer an example of the type of fearmongering Republicans are responsible for invoking.",
    "\"As your self-appointed fact-checker, I have therefore examined the merits of the accusation.\"",
    "And Trump expresses regret he didn’t march to the Capitol with the insurrectionists.\"",
    "'”\nMilbank also noted recent remarks made by Ohio Senate Republican candidate J.D.",
    "He concluded, \"Is the GOP 'a party built on fraud, fear, and fascism'?",
    "This Judge Jackson might have gone there to defend them.",
    "Certainly, not all Republicans think this way.",
    "For them, the jackboot fits.\"",
    "\"Sen. Ted Cruz (R-Tex.",
    "Vance."
  ]
}