{
  "id": 10810,
  "mediaId": 2685,
  "date": "2022-03-15",
  "headline": "Vikings agree to deal with ex-Bills defensive tackle Harrison Phillips, release Michael Pierce",
  "image": "https://chorus.stimg.co/23316512/AP22004805641757.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces",
  "link": "https://www.startribune.com/vikings-harrison-phillips-buffalo-defensive-tackle-release-michael-pierce-nfl-free-agency/600155855/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Krammer",
  "authorUrl": "https://www.startribune.com/andrew-krammer/6370577/",
  "termIds": [
    5706,
    4023,
    4179,
    4304,
    4348,
    4608,
    2084,
    2849,
    197,
    813
  ],
  "sentences": [
    "The rest of the Vikings' internal free agents are cornerback Mackensie Alexander, linebacker Nick Vigil, tackle Rashod Hill, punter Jordan Berry, quarterback Sean Mannion, receivers Chad Beebe and Dede Westbrook, defensive ends Everson Griffen and Tashawn Bower, guard Dakota Dozier, tight ends Luke Stocker and Chris Herndon and running back Wayne Gallman.",
    "A handful of high-priced veterans could be means to that end, whether through cuts, restructures or trades, including defensive end Danielle Hunter, who has an $18 million roster bonus due March 20, receiver Adam Thielen and linebacker Eric Kendricks.",
    "According to reports, 49ers guard Laken Tomlinson can earn up to $40 million on a three-year deal with the Jets, while the Panthers agreed to terms with former Rams guard Austin Corbett on a three-year deal worth up to nearly $30 million.",
    "As part of a deep Bills defensive line last year, the 26-year-old Phillips set career highs in run stops and quarterback pressures, according to Pro Football Focus, in eight starts that included both of Buffalo's playoff games.",
    "Phillips' addition is the first under new defensive coordinator Ed Donatell, and means a shakeup as the Vikings informed nose tackle Michael Pierce on Monday that he will be released, according to a league source.",
    "He earned his first full-time job on his sixth team in Minnesota, where he beat undrafted rookie Riley Patterson for the job last summer before making 33 of 38 field goals (86.8%) and 36 of 40 extra points (90%).",
    "Now the Vikings also need to fit in the 307-pound Phillips, who ascended in a larger role for the Bills' top-ranked defense last season — his last on a rookie contract as a 2018 third-round pick out of Stanford.",
    "Joseph made 21 consecutive kicks to end a roller-coaster season, in which the NFL journeyman made game-winning kicks against the Lions and Packers and missed a potential game winner in a close loss at Arizona.",
    "Cole is expected to sign a three-year, $15.75 million deal with the Pittsburgh Steelers, according to ESPN, after starting seven games — four at center, three at right guard — for the Vikings last season.",
    "But Woods found a bigger payday in a three-year agreement with the Panthers on Monday worth up to $15.75 million, a source said, after he was the NFL's only defender to play every snap last season.",
    "The Jaguars were the biggest spenders out of the gate, led by adding former Commanders guard Brandon Scherff, an All-Pro in 2020, on a three-year deal worth up to $49.5 million.",
    "Many experienced corners remain available, including veterans with ties to new Vikings coaches such as the Broncos' Bryce Callahan and Kyle Fuller and the Packers' Kevin King.",
    "Jacksonville also reportedly agreed to deals with receiver Christian Kirk, linebacker Foye Oluokun, tight end Evan Engram, receiver Zay Jones and nose tackle Foley Fatukasi.",
    "Linebacker Anthony Barr, cornerback Patrick Peterson, defensive tackle Sheldon Richardson and tight end Tyler Conklin, among others, are free to negotiate with other teams.",
    "The Vikings agreed to terms with former Bills defensive tackle Harrison Phillips on Monday night on a three-year deal worth up to $19.5 million, a league source confirmed.",
    "Two top free-agent cornerbacks, the Patriots' J.C. Jackson and the Buccaneers' Carlton Davis, reportedly agreed to deals worth at least $15 million per season.",
    "Hill, the longtime swing tackle, intends to gauge his value in free agency, according to his agent Brett Tessler, who said a return to Minnesota is \"possible.\"",
    "Coach Kevin O'Connell's former team, the Rams, locked up two offensive linemen with three-year extensions for center Brian Allen and tackle Joseph Noteboom.",
    "The Vikings also moved to retain kicker Greg Joseph, a restricted free agent, with a right-of-first refusal tender worth $2.344 million for next season.",
    "The Vikings might need an upgrade at right guard or at least add more depth after Mason Cole became their first free agent to agree to terms elsewhere.",
    "Pierce's release is the second move by Vikings General Manager Kwesi Adofo-Mensah to get the Vikings under the $208.2 million salary cap by Wednesday.",
    "There's no draft pick compensation if another team signs him, unlike first-round (about $5.5 million) and second-round tenders (about $4 million).",
    "The Vikings expressed interest in retaining some of their free agents, including safety Xavier Woods and Conklin, according to league sources.",
    "Pierce was the Vikings' top free-agent signing in 2020, but had played only eight of 33 games because of a torn triceps and COVID opt-out.",
    "Hill, 30, has started at least one game in each of the past five years — 22 starts overall — including five at left tackle last season.",
    "Meanwhile, the Vikings' 19 unrestricted free agents hit the open market Monday during the start of the NFL's negotiating window.",
    "The Vikings' current commitments have them tight against the cap, which could lead to further moves on a top-heavy roster.",
    "The interior offensive line market still includes Ravens center/guard Bradley Bozeman and Jaguars guard Andrew Norwell.",
    "The team also saved nearly $14 million in cap space with quarterback Kirk Cousins' one-year extension on Sunday night.",
    "He was the Bills' Walter Payton Man of the Year nominee for charitable work that includes the Playmakers Organization.",
    "His release will save the team nearly $6.3 million in cap space, while leaving $4 million on the books.",
    "For the third consecutive offseason, the Vikings' initial free-agent acquisition is a defensive tackle.",
    "The Vikings had tried to restructure Pierce's deal, a source said, but couldn't come to an agreement.",
    "Joseph's restricted free agency means he can still field offers from other NFL teams before signing.",
    "Two other centers, the Buccaneers' Ryan Jensen and Titans' Ben Jones, also agreed to extensions.",
    "The deal can't become official until Wednesday afternoon, when the 2022 league year begins.",
    "In the Vikings' other areas of need, top free agents saw quick paydays on Monday.",
    "Star Tribune staff writer Ben Goessling contributed reporting to this story.",
    "Jackson will join the Chargers, while Davis is staying in Tampa Bay.",
    "Vikings extend Cousins' contract through 2023, gain cap space",
    "The Vikings have the right to match another offer.",
    "The team announced the move Tuesday morning."
  ]
}