{
  "id": 11237,
  "mediaId": 2605,
  "date": "2022-03-15",
  "headline": "Rams left tackle Andrew Whitworth to retire after 16 seasons",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/4ae7010/2147483647/strip/true/crop/7043x3698+0+22/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2c%2F69%2F659382e34ae7b44edc8a507d323e%2F914165-sp-0213-super-bowl-338-wjs.jpg",
  "link": "https://www.latimes.com/sports/rams/story/2022-03-15/rams-andrew-whitworth-retire-super-bowl-champion-after-16-seasons",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/iXoWdwuklI\n— Los Angeles Rams (@RamsNFL) March 15, 2022\nWhitworth was due to carry a salary-cap number of $17.6 million in the final year of a contract that included $12 million in guarantees and lucrative incentives, according to overthecap.com.",
    "In his first season, Whitworth protected quarterback Jared Goff and blocked for running back Todd Gurley — the NFL’s offensive player of year — and helped the Rams make the playoffs for the first time since 2004.",
    "“The first couple times you get in there, you’re just hoping you get a chance to survive in the NFL,” he said in December, adding, “To be here and to think of all the things I’ve been through — it’s pretty wild.”",
    "A few days before the game, he was named the winner of the Walter Payton NFL Man of the Year award, presented annually to a player for his outstanding achievement on the field and in the community.",
    "Andrew Whitworth, the Rams’ left tackle for the last five seasons and a pillar of the Super Bowl championship team, will retire after a 16-year NFL career, the team announced Tuesday.",
    "The Rams also might also have to replace tackle Joe Noteboom, center Brian Allen and guard Austin Corbett, all of whom are pending unrestricted free agents.",
    "Whitworth grew up in Louisiana and played at Louisiana State before the Bengals selected him in the second round of the 2006 NFL draft, 55th overall.",
    "The 6-foot-7, 330-pound Whitworth capped his career in February by helping the Rams defeat the Cincinnati Bengals in Super Bowl LVI at SoFi Stadium.",
    "In 2021, Whitworth suffered a midseason knee injury, but he returned by the end of the season and helped the Rams advance to the divisional round.",
    "After pondering whether to retire, he agreed to restructure his contract and returned for what turned out to be his final season.",
    "In 2017, a few months after the Rams hired then-30-year-old coach Sean McVay, Whitworth signed a free agent contract.",
    "Whitworth was a mainstay for Bengals teams that made the playoffs six times but never won a postseason game.",
    "He is one of only five NFL offensive linemen to play into their 40s and the oldest to start at left tackle.",
    "In 2018, he anchored an offensive line that helped the Rams make a run to Super Bowl LIII.",
    "Whitworth, 40, was a four-time Pro Bowl selection and two-time All-Pro.",
    "Congratulations on an incredible football career, Andrew Whitworth.",
    "The epitome of a leader."
  ]
}