{
  "id": 11250,
  "mediaId": 2605,
  "date": "2022-03-12",
  "headline": "If Aaron Donald ‘runs it back’ with Rams, who will join him?",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/b59b5e9/2147483647/strip/true/crop/4522x2374+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fcb%2Fa4%2F53f2b5474671872789cb152475fc%2F914166-sp-0212-super-bowl-rcg-jpg12759.jpg",
  "link": "https://www.latimes.com/sports/rams/story/2022-03-12/rams-free-agency-aaron-donald-odell-beckham-von-miller",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“There’s a lot of guys that are really important, but I think when you look at those two in particular, those guys are foundational pieces on both sides of the ball,” McVay said, adding that Stafford and Donald, “deserve and want to be rewarded accordingly.”\nMiller, who turns 33 this month, thrived while playing alongside Donald and Leonard Floyd late last season and through the playoffs.",
    "Center Brian Allen and guard Austin Corbett also are pending free agents, along with cornerbacks Darious Williams and Donte Deayon, defensive lineman Sebastian Joseph-Day, linebacker Obo Okoronkwo, running backs Sony Michel and Buddy Howell, tight end Johnny Mundt and kick returner Brandon Powell.",
    "Last month, on a raucous stage following the Rams’ Super Bowl victory parade, coach Sean McVay implored the emcee to ask star defensive lineman Aaron Donald if he was interested in “running it back,” slang for repeating another Super Bowl run.",
    "Given Snead’s track record, and the Rams’ proven boom-or-bust formula, things could change before the NFL’s so-called legal tampering begins Monday ahead of the official start of free agency on Wednesday.",
    "“If we can bring the super team back, why not run it back?”\nThose loud and bold pronouncements belied what has been a short and unusually quiet offseason for the Rams and general manager Les Snead.",
    "Noteboom played well when Whitworth was injured, and his marketability probably increased after starting and excelling in the Rams’ dramatic divisional-round victory over the Tampa Bay Buccaneers.",
    "On the same day they traded quarterback Russell Wilson to the Denver Broncos, the Seattle Seahawks released seven-time Pro Bowl linebacker Bobby Wagner, who grew up in the Inland Empire.",
    "The only question is whether the 34-year-old Stafford will attempt to break the bank or structure a deal a la Tom Brady’s to provide the Rams with more money to surround him with talent.",
    "The Las Vegas Raiders released linebacker Cory Littleton, who began his career with the Rams as an undrafted free agent and parlayed his performance into a big free-agent contract.",
    "“So, you still have to take the similar approach to, ‘Hey, is there a tweak in the model that helps us?’”\nThe Rams’ main priorities are retaining three of their star players.",
    "Linebackers Troy Reeder and Travin Howard and kicker Matt Gay are among restricted free agents, and backup quarterback John Wolford is among exclusive right free agents.",
    "Rams vice president Tony Pastoors has in the last six years proven masterful at finding creative ways to provide Snead and McVay with virtually any player they desire.",
    "Beckham, 29, signed a one-year, incentive-laden contract at midseason and provided solid production before suffering a major knee injury in the Super Bowl.",
    "Veteran left tackle Andrew Whitworth, who won a Super Bowl and the Walter Payton NFL man of the year award at age 40, is almost certainly set to retire.",
    "That will surely affect his market value, and the opportunity to rehabilitate in Los Angeles with the Rams training staff will work in the Rams’ favor.",
    "So, the Rams must decide whether Noteboom will succeed Whitworth, as they envisioned when they selected Noteboom in the third round of the 2018 draft.",
    "Quarterback Matthew Stafford, entering the final year of his contract, will receive a huge extension before the start of next season.",
    "No Rams pending free agents or suddenly-on-the-market players waived by other teams signing on for the 2022 season and beyond.",
    "“Even if you are the world champion, it doesn’t mean you’re perfect, and not close to perfect,” Snead said a few weeks ago.",
    "Donald has three years remaining on his contract but has not publicly disputed reports that he is considering retirement.",
    "Recent playful social media posts by Miller were interpreted by some as hints that he would not mind returning to Denver.",
    "The Rams have 13 other pending unrestricted free agents, and among the most intriguing is offensive lineman Joe Noteboom.",
    "Donald also is in line for a new contract, the six-year, $135-million deal he signed in 2018 now out of date.",
    "If Snead goes shopping outside the organization, some high-profile players have recently become available.",
    "Noteboom has started at tackle and guard while he also played tight end in heavy formations.",
    "The Rams are currently about $21 million over the cap, according to overthecap.com.",
    "Receiver Odell Beckham Jr. and linebacker Von Miller are pending free agents.",
    "The salary cap for 2022 has been set at $208.2 million.",
    "“We built a super team,” Donald told the crowd.",
    "“Run it back!” McVay shouted five times.",
    "Then the shirtless Donald weighed in.",
    "No high-profile players cut loose.",
    "No blockbuster trades."
  ]
}