{
  "id": 1145,
  "mediaId": 2523,
  "date": "2022-02-16",
  "headline": "Every NFL Team's Biggest Need to Fill in 2022 Offseason",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/501/724/hi-res-b320beade33f386166dff74068ae754e_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2953240-every-nfl-teams-biggest-need-to-fill-in-2022-offseason",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maurice Moton",
  "authorUrl": "https://bleacherreport.com/users/4cb5ecd3-8950-4cfa-9f2d-559fbbcd282e",
  "termIds": [
    0
  ],
  "sentences": [
    "Despite losing his top two running backs (Javonte Williams and Michael Carter) and top two receivers (Dyami Brown and Dazz Newsome), he posted respectable passing numbers in 2021 (3,056 yards, 24 touchdowns and nine interceptions), which says a lot about his ability to adapt and adjust to the talent around him.",
    "Las Vegas Raiders: Right Tackle\nBetween the possible loss of five defensive tackles (Johnathan Hankins, Quinton Jefferson, Solomon Thomas, Gerald McCoy and Darius Philon) in free agency and a big question mark at right tackle, you can go in either direction when it comes to the Raiders' biggest weakness.",
    "Ridder would have a solid offensive line set to retain four of its five starters, a versatile running back in Javonte Williams, who racked up 1,219 yards from scrimmage last year, and a talented pass-catching group that includes Courtland Sutton, Jerry Jeudy, Tim Patrick and Noah Fant.",
    "On film, Hamilton looks like the total package because he can make plays on the ball, line up in the box to supplement the run, shadow a pass-catcher in man coverage down the seam and plays with a high football IQ, which allows him to read the quarterback from center field.",
    "General manager Chris Grier can open the checkbook to lure top-tier free-agents or up-and-coming offensive linemen to Miami such as three-time Pro Bowl left tackle Terron Armstead, five-time Pro Bowler and All-Pro guard Brandon Scherff or 24-year-old guard Connor Williams.",
    "Left guard Andrew Norwell may not have played up to his massive five-year, $66.5 million deal he signed with the Jacksonville Jaguars four years ago, but he would be an upgrade over Quinton Spain, who allowed five sacks through 995 snaps last year, per Pro Football Focus.",
    "Like most quarterback-needy teams, the Commanders should inquire about San Francisco 49ers signal-caller Jimmy Garoppolo, as well as the Indianapolis Colts' Carson Wentz, who will \"probably\" be available, per ESPN's Chris Mortensen (h/t Pro Football Focus' Ari Meirov).",
    "Indianapolis Colts: Wide Receiver\nThough ESPN's Chris Mortensen reported that the Indianapolis Colts will \"probably\" trade or release Carson Wentz in the offseason (h/t Pro Football Focus' Ari Meirov), he's still currently on the roster and isn't their biggest issue.",
    "Los Angeles Rams: Interior Offensive Line\nComing off a Super Bowl win, the Los Angeles Rams can push back their offseason plans a bit to celebrate, but when general manager Les Snead gets back to business, he must address the interior of his offensive line.",
    "New York Jets: Defensive End\nAs the defensive coordinator for the San Francisco 49ers, Robert Saleh had a stout front line that constantly put the quarterback under duress, but he couldn't bring Nick Bosa and Arik Armstead to the New York Jets with him.",
    "Based on production from the 2021 season, the potential loss of impending free agents and the outlook of every position on the roster, we've pinpointed each team's biggest void and how each club should strengthen its weakest position this offseason.",
    "The Texans' talent evaluators will probably spend countless hours on this class of edge-rushers, starting with Michigan's Aidan Hutchinson and Oregon's Kayvon Thibodeaux since they're in contention for the top spot among players at the position.",
    "The 6'3\", 303-pounder must work on his functional strength at the point of attack, but he has impressive quickness and ball-tracking skills, recording 11 tackles for loss, 5.5 sacks and two quarterback hurries in his final year at Oklahoma.",
    "He logged just 14.5 sacks and 13 quarterback hurries through three collegiate terms—including a shortened 2020 campaign—but the 6'4\", 275-pounder has great upside with his combination of power, length and explosiveness off the edge.",
    "With the 18th pick in the upcoming draft, the Saints will likely have the opportunity to take Ole Miss' Matt Corral, who's a mobile quarterback (1,338 rushing yards and 18 touchdowns) with an accurate arm (67.6 completion rate).",
    "Unless the Broncos pull off a trade for Green Bay Packers quarterback Aaron Rodgers, who is contemplating his future, the front office might want to think about a high-ceiling prospect in the first or second round of the draft.",
    "With free agency coming in about a month and the NFL Scouting Combine only weeks away, general managers have to compile a list of veterans to target in March while team scouts grind the tape and assemble a big board for April.",
    "If his stock continues to rise after the NFL Scouting Combine, Pittsburgh can consider an early move similar to what the San Francisco 49ers did last year, though Colbert wouldn't have to shoot up to the third overall spot.",
    "Buffalo Bills: Boundary Cornerback\nBarring an extension for cornerback Levi Wallace—not a bad idea—the Buffalo Bills have to find a boundary cornerback to start opposite Tre'Davious White once he recovers from a torn ACL.",
    "Coming off a standout season with 4,319 passing yards, 42 touchdown passes and seven interceptions, Kenny Pickett may be ready to play immediately if called upon, though he wouldn't have to behind an experienced veteran.",
    "Sure, Mayfield and wide receiver Odell Beckham Jr. didn't work out, and the latter went on to rejuvenate his career with the Los Angeles Rams, but the Browns quarterback did play through a torn labrum this past season.",
    "Minnesota Vikings: Cornerback\nThe Minnesota Vikings can get younger at linebacker to replace Anthony Barr, who's set to become a free agent ahead of his age-30 season after missing 20 games over the past two campaigns.",
    "The best pass-catching tight end in the class, McBride won't slip past the second round, so the Titans would have to make the call with the 26th pick or attempt to trade back into an early spot on Day 2 to snag him.",
    "With so much depth at the edge-rusher position in the draft, the Cowboys can target a pass-rushing specialist on Day 2 in Myjai Sanders, who's sleek at 6'4\", 242 pounds but still finds his way to the quarterback.",
    "Detroit Lions: Safety\nWhile some mock drafts will link the Detroit Lions to a pass-rusher, perhaps Oregon's Kayvon Thibodeaux, general manager Brad Holmes can go in another direction that deserves his attention.",
    "Cameron Dantzler had a solid 2021 campaign, permitting a 54.1 percent completion rate and a 74.7 passer rating in coverage, but the Vikings need another starting-caliber cover man on the boundary or in the slot.",
    "If the star quarterback stays in Green Bay, his go-to receiver will likely want to remain in Titletown as well, though the front office would have to cut or restructure multiple contracts to make that happen.",
    "Robert Alford has an expiring contract, and Marco Wilson gave up too much real estate in coverage through his rookie term, allowing six touchdowns, a 70.3 percent completion rate and a 120.8 passer rating.",
    "The Chargers will likely allow impending free-agent defensive linemen Linval Joseph, Justin Jones and Christian Covington to pursue deals elsewhere after the team's abysmal performances against the run.",
    "Though the Packers selected wideout Amari Rodgers in the third round of last year's draft, they'll need more to satisfy Rodgers or help Jordan Love develop in his first year as a full-time starter.",
    "Cleveland Browns: Wide Receiver\nBefore general manager Andrew Berry decides whether to give Baker Mayfield an extension or not, he should bolster the fourth-year quarterback's pass-catching group.",
    "Los Angeles Chargers: Defensive Tackle\nThis past season, the Los Angeles Chargers gave up too much ground in run defense, ceding the third-most rushing yards and 4.6 yards per carry (ranked 28th).",
    "If the Eagles stay patient, they would likely have a shot at David Ojabo, who's \"the other\" Michigan defensive end—not Aidan Hutchinson—but offers intriguing upside because of his physical traits.",
    "Barring significant roster cuts or a trade involving wideout Calvin Ridley, who has an uncertain future with the club, Atlanta doesn't have much cap flexibility ($6.6 million over the cap limit).",
    "Though left tackle Cam Robinson had a decent 2021 campaign, allowing one sack through 856 offensive snaps, per Pro Football Focus, he's gone through an inconsistent five-year run in Jacksonville.",
    "Dallas can re-sign edge-rusher Randy Gregory, but he'll probably garner interest from other suitors in free agency after recording 29 quarterback pressures and tying a career high in sacks (six).",
    "DeMarcus Lawrence, who turns 30 years old in April, has seen a decline in quarterback pressures over the past three years with a significant dip in sack totals after his 2018 Pro Bowl campaign.",
    "Instead of handing the starting job to Ryan Izzo, who played 26 offensive snaps between the 2021 regular season and the playoffs, Tennessee can add a playmaker in Colorado State's Trey McBride.",
    "Baltimore Ravens: Interior Defensive Line\nWhile the Baltimore Ravens need to re-sign or replace center Bradley Bozeman, they have a much bigger problem on the interior of their defensive line.",
    "Depending on the flow of quarterbacks coming off the board, the Commanders may be able to move back and still pick up Sam Howell, who has three years of starting experience at North Carolina.",
    "Though Burrow can do a better job of getting rid of the ball at times, the front office has to upgrade the offensive line, which allowed pressures on 24.2 percent of dropbacks (ranked 12th).",
    "Coming out of the collegiate ranks at 6'2\", 320 pounds, Salyer will likely settle into a role at guard, but he can serve as a utility lineman because of his experience at multiple positions.",
    "Houston Texans: Edge-Rusher\nWhile Davis Mills showed he has the potential to take over under center, the Houston Texans must figure out who's going to rush the opposing team's quarterback.",
    "In the pocket, the Cincinnati product shows poise and makes pre-snap checks based on what he sees in the defensive coverage, which likely stems from his experience as a four-year starter.",
    "If the Bears plan to build around quarterback Justin Fields, whom they traded up for in last year's draft, new general manager Ryan Poles must surround him with more offensive playmakers.",
    "While the Steelers can attempt to acquire a veteran via trade for a quick fix, general manager Kevin Colbert, who will step down from his position after the draft, can go out with a bang.",
    "In 2021, Taylor Heinicke had some decent moments, but he's a solid placeholder at best, throwing for 3,419 yards, 20 touchdowns and 15 interceptions in 16 games, which included 15 starts.",
    "Even if the Buccaneers feel optimistic about Trask's future, the front office should acquire a veteran signal-caller who can start if needed or help the younger passer develop into a pro.",
    "If Winston makes a speedy recovery, he may draw competitive offers on the free-agent market, and the Saints won't win a bidding battle while they're about $76 million over the cap limit.",
    "When you consider all those qualities and Hamilton's 6'4\", 220-pound frame, he's arguably the best prospect in the 2022 class despite a knee injury that limited him to seven games.",
    "We haven't seen a safety in a top-five draft spot since Eric Berry went fifth to the Kansas City Chiefs in 2010, but the Lions should buck the trend for Notre Dame's Kyle Hamilton.",
    "As a former run-game coordinator for the San Francisco 49ers from 2017-2020, McDaniel may place an emphasis on winning in the trenches, which starts with a strong offensive line.",
    "1 defense in points and yards allowed as the Los Angeles Rams' coordinator in 2020, head coach Brandon Staley must find a solution to a glaring weakness within his Chargers unit.",
    "Assuming wide receiver Allen Robinson II moves on after playing through a down year on the franchise tag, Purdue's David Bell could replace him opposite Mooney on the perimeter.",
    "Cincinnati Bengals: Offensive Line\nTalked about ad nauseam during the Cincinnati Bengals' run to Super Bowl 56, quarterback Joe Burrow endured a ton of punishment in the pocket.",
    "Washington Commanders: Quarterback\nWith only one quarterback under team control in 2022, the Washington Commanders will weigh multiple options at the most important position.",
    "Chicago Bears: Wide Receiver\nWhen the Chicago Bears look at their depth chart at wide receiver, they'll see a little production and a lack of experience among the holdovers.",
    "Philadelphia Eagles: Defensive End\nThe Philadelphia Eagles will likely allow 2017 first-rounder Derek Barnett to test free agency after he logged 21.5 sacks in five seasons.",
    "If Snead wants to upgrade quarterback Matthew Stafford's pass protection on the interior, the Rams should consider Georgia's Jamaree Salyer in the third round of the draft.",
    "At 6'0\", 200 pounds, he's a long cornerback who uses physicality to disrupt a receiver's routes or shadows pass-catchers with his foot speed, length and field awareness.",
    "Kansas City Chiefs: Cornerback\nThe Kansas City Chiefs could lose a starter and depth at cornerback in free agency with Charvarius Ward and Mike Hughes on expiring deals.",
    "The Steelers could make an aggressive move for Willis, who threw for 5,117 yards, 47 touchdowns and 18 interceptions and rushed for 1,822 yards and 27 scores at Liberty.",
    "The 6'5\", 258-pounder must add counters to his move set on the pro level, but his quick step off the line of scrimmage and flexibility should grab the Texans' attention.",
    "The fourth-year wideout can also line up on the perimeter or in the slot, which gives head coach and offensive play-caller Frank Reich some flexibility in the game plan.",
    "On the downside of his career, Newton will become a free agent, and Darnold hasn't proved he's a capable long-term starter in four years (three with the New York Jets).",
    "The 6'2\", 205-pounder can make plays on the outside or in the slot with the physicality to outmuscle cornerbacks while positioning himself to haul in contested targets.",
    "On the flip side, the star quarterback \"expects\" to be in Seattle and has been in constant communication with head coach Pete Carroll, per NFL Network's Mike Garafolo.",
    "Through the 2021 campaign, Calais Campbell, Brandon Williams and Justin Ellis played 1,447 defensive snaps combined, and they're all set to hit the free-agent market.",
    "It sounds like the Seattle Seahawks might have to please Wilson and convince him that he's part of a team that's headed in the right direction after a 7-10 campaign.",
    "Last season, Anthony Firkser, Geoff Swaim and MyCole Pruitt logged the bulk of the snaps at tight end for the Titans, and they may all suit up for new teams in 2022.",
    "If general manager Joe Schoen wants to provide a strong supporting cast for quarterback Daniel Jones, he can help the signal-caller by strengthening the run game.",
    "Instead of hoping the edge-rusher makes a full recovery and bounces back to pre-injury form, the Jets would be better off adding pass-rushing help in the draft.",
    "Ojabo isn't close to a finished product, but he has the tools to become a double-digit sack artist with some growth and technical development in his hand usage.",
    "On the boundary of the secondary, the Cardinals don't have a reliable defender other than Byron Murphy Jr., who plays a significant number of snaps in the slot.",
    "Arizona Cardinals: Cornerback\nAssuming Chandler Jones tests the free-agent market, the Arizona Cardinals can prioritize the edge-rusher position this offseason.",
    "Wallace had a solid 2021 term, logging 10 pass breakups and two interceptions while allowing a 58 percent completion rate and a 72.6 passer rating in coverage.",
    "Bryant isn't a sound tackler, but he'll draw interest from teams because of his size (6'1\", 191 lbs), competitiveness on contested targets and ball production.",
    "Pittsburgh Steelers: Quarterback\nBen Roethlisberger's retirement puts the Pittsburgh Steelers in unfamiliar territory without a long-term plan at quarterback.",
    "The Bills are projected at $4.8 million over the cap threshold, so they're more likely to address their biggest need during the draft rather than free agency.",
    "At 6'2\", 196 pounds, Elam has great size and offers a physical presence in addition to his solid coverage (20 pass breakups and six interceptions at Florida).",
    "Denver Broncos: Quarterback\nIn a division with Patrick Mahomes, Justin Herbert and Derek Carr, the Denver Broncos have to swing for a home run at quarterback.",
    "The Ravens can offer contracts to Austin Johnson, Jarran Reed and even Akiem Hicks if he's over the nagging injuries that cost him several games last season.",
    "The Saints promoted Dennis Allen from defensive coordinator to head coach, so he fully understands the issues this team faces at the most important position.",
    "Atlanta Falcons: Edge-Rusher\nThe Atlanta Falcons recorded the lowest quarterback pressure rate (16.7 percent) and fewest sacks (18) during the 2021 season.",
    "If Brady doesn't come out of retirement, Tampa Bay can attempt to land Carson Wentz, whose strong arm suits head coach Bruce Arians' aggressive philosophy.",
    "Before his injury, the USC product played like the best receiver in the country, hauling in 88 passes for 1,084 yards and seven touchdowns in eight games.",
    "While the Eagles have a strong defensive interior with Fletcher Cox and Javon Hargrave, they could add another pass-rusher to help Josh Sweat on the edge.",
    "Though he may start the offseason on the mend, he's worth the wait because of his nuanced route running and ability to separate from defenders downfield.",
    "Green Bay Packers: Wide Receiver\nWhether quarterback Aaron Rodgers sticks around or not, the Green Bay Packers cannot ignore the wide receiver position.",
    "If Drake London doesn't suffer any setbacks while healing from a broken ankle, the 6'5\", 210-pounder might be the first wideout off the board in April.",
    "Schoen wants more \"at-bats\" in this year's draft, which may indicate his willingness to move back into the teens, making Linderbaum a possible target.",
    "According to NBC Sports' Thor Nystrom, the Steelers have a preference at quarterback, favoring Liberty's Malik Willis over Pittsburgh's Kenny Pickett.",
    "The former was a rookie fifth-rounder last year, and the latter has started 13 games since the team drafted him in the third round of the 2018 draft.",
    "Along with his raw power and strength, Neal shoots his hands in a timely fashion and reroutes defenders using leverage and drive from his lower body.",
    "This past season, the former started in all 17 games and allowed a 73.4 percent completion rate, five touchdowns and a 123 passer rating in coverage.",
    "With a projected $36.4 million in cap space, Seattle has the money to pursue a big-time free-agent tackle in three-time Pro Bowler Terron Armstead.",
    "In 2019, under Arians and offensive coordinator Byron Leftwich, Winston threw for a league-leading 5,109 yards, 33 touchdowns and 30 interceptions.",
    "Kendrick has great footwork and quickness when he's on the hip of a receiver downfield—not many wasted steps while matched up with his assignment.",
    "Regardless of the team's plan at quarterback, general manager Chris Ballard must infuse the receiver room with more talent to balance the offense.",
    "Carolina Panthers: Quarterback\nThe Carolina Panthers showed little confidence in their quarterbacks through the 2021 campaign, and rightfully so.",
    "The 49ers can attempt to re-sign Jaquiski Tartt, but he's had issues with availability because of injuries as well and turns 30 years old Friday.",
    "Jalen Mills played 90 percent of the defensive snaps, mostly on the outside, but allowed seven touchdowns and a 111.4 passer rating in coverage.",
    "The Chiefs finished the 2021 season with the 27th-ranked pass defense, so expect general manager Brett Veach to add some talent on the back end.",
    "Pair him with Georgia's Jordan Davis, a 6'6\", 340-pound interior defender, and the Chargers would have much fewer interior leaks on early downs.",
    "After the Los Angeles Rams finish their victory laps with the Lombardi Trophy, they'll get back to work in hopes of defending the title in 2022.",
    "The Vikings may prefer to move back some spots for Booth, but he's a potential long-term starter who would address one of their pressing needs.",
    "The club needs a young defender to shore up the position for the long-term future—preferably a center fielder with above-average ball skills.",
    "While battling a foot injury, Thibodeaux amassed 49 tackles, 12 for loss, seven sacks and eight quarterback hurries through 11 games in 2021.",
    "Their top three wideouts (in yards from this past season), Davante Adams, Marquez Valdes-Scantling and Allen Lazard have expiring contracts.",
    "The front office can bundle a couple of those picks for a move into the top 10 or wait and see who might be available halfway through Day 1.",
    "Bryant won the 2021 Jim Thorpe Award, which goes to the top defensive back in the country, logging 11 pass breakups and three interceptions.",
    "Miami Dolphins: Offensive Line\nAs Mike McDaniel takes over the Miami Dolphins' head-coaching job, he needs to focus on the offensive line.",
    "Not to excuse Wentz from his up-and-down performances late in the previous season, but he only had one viable target in the passing game.",
    "Slightly over the cap threshold ($813,256), per Over the Cap, Arizona should target Florida's Kaiir Elam in the first round of the draft.",
    "Because of several expiring contracts, safety, defensive end and linebacker stand out most, but this unit could use another edge-rusher.",
    "He struggled mightily at both positions, allowing eight sacks and committing 14 penalties through the campaign, per Pro Football Focus.",
    "The Raiders need to strengthen the right side of their offensive line, which is imperative following Leatherwood's shaky rookie season.",
    "With a couple of top-10 picks, the Giants could trade back and pick up Iowa's Tyler Linderbaum, who can stabilize their offensive line.",
    "Tampa Bay Buccaneers: Quarterback\nWith Tom Brady's retirement announcement, the Tampa Bay Buccaneers have a major issue at quarterback.",
    "Other than Ward, Talanoa Hufanga and Tarvarius Moore list as the only safeties on the books beyond the 2021 campaign in San Francisco.",
    "However, the Vikings have a bigger issue in the secondary with cornerbacks Patrick Peterson and Mackensie Alexander on expiring deals.",
    "Versatile linebacker Micah Parsons can boost the Cowboys pass rush, though the front office must provide additional help in that area.",
    "Dante Fowler Jr. tied with defensive tackle Grady Jarrett for a team-leading 17 quarterback pressures and led the club in sacks (4.5).",
    "Both linemen will turn 27 years old at the beginning of the 2022 campaign, so the Rams might re-sign them for the sake of continuity.",
    "Before the 2021 trade deadline, the Patriots sent Stephon Gilmore to the Carolina Panthers, opening up his position on the boundary.",
    "In defensive coordinator Dan Quinn's scheme, Sanders would line up outside the tackle and use his speed to generate pocket pressure.",
    "Desmond Ridder struggled with ball placement in the rain during Senior Bowl week, but that doesn't overshadow his recent production.",
    "Jonathan Greenard led the team in sacks (eight) with 19 quarterback pressures, but he only played 52 percent of the defensive snaps.",
    "The Texans finished the 2021 season tied for the fifth-fewest sacks (32) and fifth-lowest quarterback pressure rate (20.7 percent).",
    "If Jacksonville picks the right player, Lawrence won't have to worry about much pressure from his blind side for at least a decade.",
    "Jacksonville Jaguars: Offensive Tackle\nThe Jacksonville Jaguars dumped Urban Meyer for Super Bowl-winning head coach Doug Pederson.",
    "Before the draft in April, Baltimore should add a solid veteran defensive lineman in order to maintain its top-ranked run defense.",
    "Within a talented class of wide receivers, he could slip into the second round, which gives the Bears a chance to pick him at No.",
    "Starting tackles Duane Brown, who gave up eight sacks last season, per Pro Football Focus, and Brandon Shell will be free agents.",
    "The Jets should have their eyes on Jermaine Johnson II, whose stock rose after his standout performances during Senior Bowl week.",
    "Though he's only missed six contests since 2019, the San Francisco 49ers need a starter alongside him and depth at the position.",
    "Despite limited starting experience, he boosted his draft stock with five interceptions through his senior campaign at Illinois.",
    "Assuming Jonathan Jones makes a return from a season-ending shoulder injury, he'll likely fill his natural position in the slot.",
    "With a projected $56.3 million in cap space, general manager Tom Telesco can spend big money on an impact player in free agency.",
    "Walker (one start) all finished the season with more interceptions than touchdown passes and completion rates below 60 percent.",
    "Their defensive front needs an established veteran alongside Justin Madubuike, who's going into his third year with 14 starts.",
    "Perhaps a stronger interior across the front line keeps running back Saquon Barkley healthy and opens up bigger lanes for him.",
    "Hill has had mediocre passing performances, throwing for eight touchdowns and eight interceptions over the past two seasons.",
    "If he's not ready to play as a rookie, Pittsburgh has a serviceable low-end starter in Mason Rudolph as a bridge-gap option.",
    "With that said, the Las Vegas Raiders moved Alex Leatherwood from right tackle to right guard after Week 4 this past season.",
    "On the flip side, they gave up eight sacks combined this past season (Allen five and Corbett three), per Pro Football Focus.",
    "Kirk doesn't bring a lot of flash, but he's coming off a season with career highs in catches (77) and receiving yards (982).",
    "Michael Pittman Jr. finished the 2021 campaign as the only Colts wideout with more than 38 catches and 384 receiving yards.",
    "Not only do the Falcons have to replace Fowler, but they also must find someone who's more effective than him off the edge.",
    "To move in the right direction, all 32 teams must find weaknesses across the depth chart and highlight their biggest needs.",
    "He's under contract through the 2025 campaign, but New Orleans can bring in a rookie to push him in a training camp battle.",
    "Washington can retain Kyle Allen, who's a restricted free agent, though he's similar to Heinicke—more of a high-end backup.",
    "Perhaps the front office targets Perrion Winfrey in the draft following his standout performances during Senior Bowl week.",
    "Tom Silverstein of the Milwaukee Journal Sentinel (h/t NESN.com) expects Green Bay to release wide receiver Randall Cobb.",
    "Though they selected Kyle Trask in the second round of the 2021 draft, he hasn't played a snap during the regular season.",
    "This past season, Matt Skura played most of his snaps at left guard, but he's not a foundational player on the interior.",
    "New York Giants: Interior Offensive Line\nThe New York Giants have to reshape their offensive line between the tackles.",
    "According to NFL Network's Ian Rapoport, Wilson will \"explore his options,\" and the insider wouldn't rule out a trade.",
    "Over his final two years at Clemson, he found the ball in coverage, logging five interceptions and nine pass breakups.",
    "Dallas Cowboys: Defensive End\nThe Dallas Cowboys can pick one of three positions as their biggest need—all on defense.",
    "While Denzelle Good has the ability to play right tackle, he's coming off a torn ACL and turns 31 years old in March.",
    "To make matters worse in the secondary, Tyrann Mathieu, one of the league's best coverage safeties, needs a new deal.",
    "Blaine Gabbert's contract will expire in March, leaving the Florida product alone on the depth chart at his position.",
    "With that said, if he's ready to play in September, the 28-year-old wouldn't need to learn the Buccaneers' system.",
    "According to Pro Football Focus, tackles Liam Eichenberg (nine) and Jesse Davis (eight) gave up 17 sacks combined.",
    "As a fourth-rounder from last year's class, Wilson is far from a guarantee to make a significant second-year leap.",
    "He's an athletic cover man out of Auburn who can match up with physical receivers and quick-twitch pass-catchers.",
    "The former should be able to keep the team competitive as head coach Matt Rhule goes into a crucial third season.",
    "With experience at both tackle positions, the 6'6\", 330-pounder can slide into a starting role on the right side.",
    "The speedy edge-rusher had a breakout 2021 term with 12 tackles for loss, 11 sacks and eight quarterback hurries.",
    "Per NFL Network's Tom Pelissero, the club could consider moves for quarterbacks Deshaun Watson or Russell Wilson.",
    "According to John Romano of the Tampa Bay Times, Jameis Winston makes a good fit in a return to his former team.",
    "4 and 10) to help Saleh build another top-level defensive line, which would take pressure off a young secondary.",
    "New England Patriots: Boundary Cornerback\nThe New England Patriots have a void on the boundary of the secondary.",
    "In 2022, Anthony Schwartz and Donovan Peoples-Jones will go into their second and third campaigns, respectively.",
    "The versatile safety had 34 tackles, two for loss, three interceptions and four pass breakups this past season.",
    "Currently $15.3 million over the cap threshold, the new regime should stock up on cornerbacks during the draft.",
    "Saleh doesn't know if Carl Lawson will lose some of his explosiveness after rupturing his Achilles last summer.",
    "At 6'4\", 259 pounds, Johnson has length and power with a good balance of pass-rushing and run-stopping ability.",
    "San Francisco 49ers: Safety\nSafety Jimmie Ward missed significant time early in his career because of injuries.",
    "Seattle Seahawks: Offensive Tackle\nOnce again, quarterback Russell Wilson may not be happy with his situation.",
    "At 6'7\", 350 pounds, he's a massive brick wall with smooth footwork, which is a terrifying sight on the field.",
    "Secondly, coming off a Super Bowl appearance, Cincinnati will likely draw the interest of quality free agents.",
    "With a combination of Adams and Metchie, whoever starts at quarterback would have a playmaking perimeter duo.",
    "Adams will likely command top dollar after five straight Pro Bowl seasons and consecutive All-Pro campaigns.",
    "Both tore their ACLs late in the 2021 season and may have to settle for short-term deals while on the mend.",
    "6 selection in the draft, Carolina could have the pick of the litter in an underwhelming quarterback class.",
    "The Jaguars won't have to overthink their options if they want to find Lawrence's new blind-side bodyguard.",
    "New Orleans Saints: Quarterback\nIn all likelihood, the New Orleans Saints will draft a quarterback in 2022.",
    "The 49ers don't have a first-round pick because of their trade with the Miami Dolphins for last year's No.",
    "The 5'11\", 189-pounder plays bigger than his size and does a good job locating the ball while in coverage.",
    "It worth noting, though, that Markus Golden, who had 11 sacks in 2021, is under contract for another term.",
    "Compared to Hutchinson, Thibodeaux seems like the prospect with more upside because of his physical gifts.",
    "The 6'3\", 249-pounder recorded 90 receptions for 1,121 yards and a touchdown in his final collegiate term.",
    "With 37.4 million in projected cap space, Ballard can add some speed and versatility with Christian Kirk.",
    "At a projected $50.8 million over the cap threshold, the Packers won't be able to keep all four wideouts.",
    "39 since they don't have a first-rounder because of last year's draft-day trade with the New York Giants.",
    "If he learns to go through his progressions in full-field reads, the Saints would have a capable starter.",
    "In the 2021 season finale, Taysom Hill suffered a Lisfranc injury, which will require offseason surgery.",
    "Because of a weak free-agent class of tackles, the front office should shift its attention to the draft.",
    "Over the past three seasons, he's played a key role in the Tampa Bay Buccaneers' top-three run defenses.",
    "Robert Hunt had a decent 2021 season, but the Dolphins can still upgrade at his position (right guard).",
    "Don't expect Vegas to re-sign Brandon Parker, who didn't play well when he had starting opportunities.",
    "However, based on snap count, the Tennessee Titans could lose their top three players at the position.",
    "The Chiefs may see a ball hawk and viable perimeter defender in Bryant, who looks and plays the part.",
    "At about $11.3 million over the cap limit, Big Blue should look for a potential starter in the draft.",
    "In 2021, he logged 70 tackles, 17.5 for loss, 11.5 sacks and 12 quarterback hurries at Florida State.",
    "During the draft, the Packers should keep tabs on John Metchie III, who's recovering from a torn ACL.",
    "Jameis Winston, who tore his ACL and damaged his MCL in October, has a contract that voids in March.",
    "During Senior Bowl week, Northern Iowa's Trevor Penning brought a lunch-pail mentality to practices.",
    "He bullied his competition and put defenders on the ground in individual drills and team sessions.",
    "Regardless, they need to target tackles to protect Wilson or whoever starts under center in 2022.",
    "Tennessee Titans: Tight End\nWhen circling offseason needs, we rarely pay attention to tight ends.",
    "Howell isn't flashy, but he knows how to run an offense and sees the entire field after the snap.",
    "Other than wideout Jarvis Landry, the Browns don't have established playmakers on the perimeter.",
    "The Panthers should target Marcus Mariota in free agency and select a quarterback in the draft.",
    "In 2021, the Seahawks allowed the fifth-most quarterback pressures per dropback (27.1 percent).",
    "Over his past three collegiate campaigns, he's recorded 13.5 sacks and 25 quarterback hurries.",
    "Aside from Kirk, the Colts can take a swing at Chris Godwin or Michael Gallup in free agency.",
    "Winston would come with a question mark since he's recovering from a torn ACL and MCL injury.",
    "Indianapolis fielded the 26th-ranked aerial attack along with its second-ranked ground game.",
    "Even if the Patriots re-sign J.C. Jackson, they'll need an upgrade over Mills and Williams.",
    "3 pick from the 2020 class, cornerback Jeff Okudah hasn't played up to his draft pedigree.",
    "The Jaguars guard gave up just three sacks in 1,078 snaps in 2021, per Pro Football Focus.",
    "The latter played 14 defensive snaps for the Lions after the Tennessee Titans waived him.",
    "The Alabama product racked up 96 receptions for 1,142 yards and eight touchdowns in 2021.",
    "The analytics site ticketed versatile offensive lineman Austin Jackson with 12 penalties.",
    "1 pick in the 2022 draft, the Jaguars can land an elite prospect with tremendous upside.",
    "He's arguably the best interior lineman in the class with a ton of experience at center.",
    "The Bengals should pursue the former because of his solid pass-blocking on the interior.",
    "Through the 2021 season, playoffs included, he took 70 sacks—third-most in NFL history.",
    "In 2021, he broke out, throwing for 3,334 yards, 30 touchdowns and eight interceptions.",
    "In one start, rookie fourth-rounder Ian Book threw for 135 yards and two interceptions.",
    "New England can target a cornerstone of Georgia's stifling defense in Derion Kendrick.",
    "The former Bulldog boosted his stock this past campaign, recording four interceptions.",
    "Hilton, who's missed 14 outings since 2019 and is set to become a free agent in March.",
    "In his final term at Purdue, Bell caught 93 passes for 1,286 yards and six touchdowns.",
    "McBride boosted his draft stock during Senior Bowl week, catching everything in sight.",
    "In 2021, Suh recorded six sacks, 19 quarterback pressures and seven tackles for loss.",
    "Center Billy Price and right guard Will Hernandez will hit the open market in March.",
    "Brandon Graham, who missed all but two games last year, turns 34 years old in April.",
    "20 into the top 10 for Willis, who made a strong impression during Senior Bowl week.",
    "Over each of the past two years, Ridder completed at least 64 percent of his passes.",
    "He hauled in contested targets, shrugged off defenders and made it all look routine.",
    "With a focus on the tackle spot, Alabama's Evan Neal seems like the obvious choice.",
    "He's a speedy pass-rusher, who's nimble with solid strength at the point of attack.",
    "Will Harris and Brady Breeze are the only safeties under team control in 2022.",
    "According to Pro Football Focus, he allowed just one sack since the 2020 term.",
    "The Dolphins will have the most projected cap space in 2022 at $63.8 million.",
    "Andrew Booth Jr. can patch up holes in the Vikings' 28th-ranked pass defense.",
    "The Bills can land Roger McCreary at the end of the first round of the draft.",
    "If Ndamukong Suh continues to play, he's a potential fit on a one-year deal.",
    "With him on the outside, Mayfield would have a reliable, big-bodied target.",
    "The Packers should franchise tag Adams if Rodgers wants to play elsewhere.",
    "But the Steelers will probably have to move up in the draft order from No.",
    "Corral can make something out of nothing with his ability to extend plays.",
    "If not for Metchie's injury, he would have been a surefire first-rounder.",
    "Now, the team can work on quarterback Trevor Lawrence's supporting cast.",
    "Walker has two touchdowns passes and eight interceptions for his career.",
    "With those numbers, he'll probably garner competitive offers elsewhere.",
    "Teddy Bridgewater and Drew Lock aren't going to cut it in the AFC West.",
    "General manager John Schneider will need to rebuild the offensive line.",
    "Nsimba Webster and Isaiah Coulter have zero regular-season receptions.",
    "The Seahawks may allow Brown to walk as he goes into his age-37 term.",
    "Center Brian Allen and guard Austin Corbett have expiring contracts.",
    "Aside from Darnell Mooney, the Bears can't say much about the group.",
    "Dazz Newsome, a rookie sixth-rounder, has two catches for 23 yards.",
    "8 pick, general manager Terry Fontenot can potentially strike gold.",
    "3 overall selection, but they can target Joseph in the third round.",
    "Perhaps he bounces back with a high-end prospect out of the draft.",
    "With Burrow on his rookie deal, the Bengals can splurge in March.",
    "The Falcons have to address their biggest needs during the draft.",
    "Since 2019, he's recorded 31 pass breakups and six interceptions.",
    "Right tackle Morgan Moses could land on the club's radar as well.",
    "The Jets can pair him with Lawson to bookend a solid front line.",
    "He's recorded eight pass breakups in 505 career defensive snaps.",
    "As a collegian, he threw for 92 touchdowns and 23 interceptions.",
    "For a rookie signal-caller, that's a recipe for early progress.",
    "Ryan Fitzpatrick will go into his age-40 term as a free agent.",
    "Team salary-cap projections for 2022 provided by Over the Cap.",
    "Purdue's George Karlaftis should draw the Falcons' attention.",
    "He can match up with big athletic wideouts on the perimeter.",
    "The Lions don't have a top-notch playmaker in the secondary.",
    "The Colts need to find an upgrade over starting wideout T.Y.",
    "Furthermore, the club released Bashaud Breeland in December.",
    "He would bring a nastiness the Raiders need in the trenches.",
    "On film, you can see his burst and lower-body explosiveness.",
    "They should also look to the draft for a long-term solution.",
    "Penning finishes on every down (frequently with a pancake).",
    "The 35-year-old hasn't missed a game since the 2011 season.",
    "Joejuan Williams, a 2019 second-rounder, hasn't panned out.",
    "Kerby Joseph could move up big boards in the coming weeks.",
    "Sam Darnold (11 starts), Cam Newton (five starts) and P.J.",
    "Team contracts beyond the 2021 season provided by Spotrac.",
    "Ryan Kerrigan heads into his age-34 term as a free agent.",
    "Over the past two years, he recorded seven interceptions.",
    "The Patriots can use him in man coverage on the outside.",
    "He started in 13 games on the boundary this past season.",
    "Center Michael Deiter has one year left on his contract.",
    "The Eagles have three mid-first round selections at Nos.",
    "Chicago can acquire a big-bodied target in the draft.",
    "He can change their defense with his coverage skills.",
    "The unit doesn't feature a single untouchable asset.",
    "Every club will have a plan to improve next season.",
    "Like Norwell, Spain has an expiring contract.",
    "If so, Coby Bryant could be a viable target.",
    "Gang Green has a pair of top-10 picks (Nos.",
    "A rookie can provide hope for the future.",
    "Rashard Higgins will test free agency.",
    "He's set to become a free agent.",
    "After leading the No.",
    "15, 16 and 19.",
    "B/R Recommends",
    "With the No.",
    "With the No.",
    "With the No.",
    "As the No."
  ]
}