{
  "id": 12731,
  "mediaId": 2605,
  "date": "2022-02-28",
  "headline": "Rams’ braintrust won’t attend combine, but roster is very much on their minds",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/977846e/2147483647/strip/true/crop/4518x2372+0+320/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F97%2F8e%2F9e24b8e3421bbb9306153504ad43%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1171776856.jpg",
  "link": "https://www.latimes.com/sports/rams/story/2022-02-28/rams-coach-gm-no-nfl-combine",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gary Klein",
  "authorUrl": "https://www.latimes.com/people/gary-klein",
  "termIds": [
    0
  ],
  "sentences": [
    "The Rams have seven other picks, including a possible fourth-round selection as compensation for the loss of free-agent safety John Johnson, and possible sixth-round picks as compensation for the departures of free agent linebacker Samson Ebukam, tight end Gerald Everett and defensive back Troy Hill.",
    "Defensive linemen Greg Gaines (fourth round) and Sebastian Joseph-Day (sixth), safeties Jordan Fuller (sixth) and Nick Scott (seventh) and linebacker Travin Howard (seventh) were among lower-round selections from the last few years who helped the Rams during the season and playoffs.",
    "With left tackle Andrew Whitworth contemplating retirement and tackle Joe Noteboom, center Brian Allen and guard Austin Corbett set to become unrestricted free agents, the Rams’ will be evaluating offensive linemen ahead of free agency and the draft.",
    "The Rams’ task will be to mine the middle and lower rounds of the draft for players that can contribute to a team that will attempt to become the first since the New England Patriots in the 2003 and 2004 seasons to win two Super Bowl titles in a row.",
    "As he addressed the crowd at a Super Bowl victory rally, Rams general manager Les Snead referenced the meme on his shirt, an expletive-tinged homage to the team’s willingness to give up draft picks in the pursuit of star players.",
    "Snead and coach Sean McVay had been scheduled to participate in news conferences in Indianapolis on Wednesday, but they pulled out and will address reporters in virtual sessions from Los Angeles.",
    "What would have been their first-round pick this year belongs to the Detroit Lions, courtesy of the 2021 trade that brought quarterback Matthew Stafford to the Rams in exchange for Goff.",
    "Given Snead’s penchant to deal before, during and after the start of free agency in mid-March, the Rams’ landscape could change by the time the draft is held April 28-30 in Las Vegas.",
    "Those trades proved vital for a team that won the NFC West and made a dramatic run through the playoffs before defeating the Cincinnati Bengals in Super Bowl LVI at SoFi Stadium.",
    "The Rams’ first pick is currently a compensatory pick after the third round for former college scouting director Brad Holmes being hired last year as the Lions general manager.",
    "What would have been their second- and third-round picks belong to the Denver Broncos, part of the price the Rams paid last October to acquire outside linebacker Von Miller.",
    "Members of the training staff are on site in Indianapolis to conduct physicals and a few assistants and scouts also will attend, a Rams spokesperson said.",
    "“We’ll use ‘em to go win more Super Bowls.”\nThe start of the unofficial draft season begins Tuesday when the NFL scouting combine opens in Indianapolis.",
    "Prospects can be evaluated in person at their school’s pro day workouts, and pre-draft prospect interviews can be conducted in-person or virtually.",
    "The Rams have not had a first-round pick since 2016, when they traded up to select quarterback Jared Goff with the No.",
    "And the Rams — who are without picks in the first, second and third rounds — once again will have a limited presence.",
    "It’s a continuation of their pullback from fully staffing scouting events such as the Senior Bowl and the combine.",
    "But the Rams appear content to continue operating the way they have since returning to Los Angeles in 2016.",
    "The Rams’ ability to develop mid- to lower-round picks was evident during their Super Bowl run.",
    "Cornerback, safety, linebacker, and defensive line are other positions of potential need.",
    "All combine workouts are available to general managers and scouts on video.",
    "“In honor of the shirt, F them picks,” Snead shouted.",
    "1 pick."
  ]
}