{
  "id": 12780,
  "mediaId": 2523,
  "date": "2022-03-02",
  "headline": "1 Prospect Each Team Should Be Watching at the 2022 NFL Scouting Combine",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/504/674/7b0255672c40195806eb904f105ecc3a_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2953849-1-prospect-each-team-should-be-watching-at-the-2022-nfl-scouting-combine",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brent Sobleski",
  "authorUrl": "https://bleacherreport.com/users/277cd64e-f8fa-4f29-a313-51cdadaf484e",
  "termIds": [
    0
  ],
  "sentences": [
    "After their blowout loss to the Los Angeles Rams in the Wild Card Round, head coach Kliff Kingsbury told reporters that Hopkins' absence contributed to their struggles down the stretch:\n\"He's a guy, you got to know where he's at as a defense each and every snap and got to do things to try and take him away.",
    "Atlanta Falcons: WR Drake London, USC\nThe Atlanta Falcons still don't know whether wide receiver Calvin Ridley will play for them again, owner and chairman Arthur Blank told Scott Bair of the team website last month:\n\"We'd love him to stay in Atlanta.",
    "Karlaftis could easily go in the top 10, but he also might slide a bit depending on how teams view him compared to fellow edge-rushers like Oregon's Kayvon Thibodeaux and Michigan's Aidan Hutchinson as well as top prospects at other positions.",
    "He set the Wolverines' program record with 14 sacks during his final season on campus, earned the Ted Hendricks and Lombardi Awards and led all incoming edge-rushers in grades on first, second and third down, per Pro Football Focus.",
    "The process will continue in Indianapolis, where the new Giants brass will get to see his movement skills in position-specific drills and how he's improved his technique while working both sides of his pass set.",
    "Meanwhile, the roster is littered with free agents, including Leonard Fournette, Rob Gronkowski, Chris Godwin, Ryan Jensen, Alex Cappa, Ndamukong Suh, Jason Pierre-Paul, Jordan Whitehead and Carlton Davis III.",
    "Seattle could look at multiple different positions of higher value, particularly left tackle depending on pending free agent Duane Brown's status, but the best value could very well be at running back.",
    "Carolina Panthers: OT Charles Cross, Mississippi State\nThe Carolina Panthers need to address quarterback at some point this offseason, but the sixth overall pick isn't necessarily the spot to do so.",
    "They'll only do so with a compensation pick because the Detroit Lions hired Brad Holmes, the Rams' former director of college scouting, as their general manager during the previous offseason cycle.",
    "Davis is ninth on the latest B/R Scouting Department big board, but his limited reps at questions about whether he can develop into a three-down defender could cause him to slide on draft night.",
    "A standout performance in Indianapolis could firmly place Cross in the same conversation as the class' top two tackle prospects and give the Panthers plenty to think about early in the draft.",
    "Instead, Neal can put a stamp on being the most sensible choice with this year's top selection with a favorable impression on Jaguars brass by showing up in great shape and interviewing well.",
    "Mississippi State's Charles Cross has the skill set to be in the conversation with Alabama's Evan Neal and North Carolina State's Ikem Ekwonu as the top offensive line prospect in the draft.",
    "The Broncos already have plenty of skill-position talent in place with running back Javonte Williams, wide receivers Courtland Sutton, Jerry Jeudy and Tim Patrick and tight end Noah Fant.",
    "The team elevated defensive coordinator Dennis Allen to head coach as Sean Payton's replacement, and the front office reworked Michael Thomas' deal in a sign the two sides mended fences.",
    "Tennessee Titans: CB Trent McDuffie, Washington\nWashington's Trent McDuffie is the antithesis of Caleb Farley, which is exactly why the Tennessee Titans should closely watch the former.",
    "Dallas Cowboys: C Tyler Linderbaum\nThere's somewhat of a disconnect between the caliber of prospect that Iowa center Tyler Linderbaum is and where he could ultimately land in the draft.",
    "While the Panthers should thoroughly explore all of their options at quarterback, they'd likely be better off drafting a long-term solution at left tackle with the sixth overall pick.",
    "After averaging 28.2 points per game over their first 13 games—including 30.2 points in the 10 games with Hopkins—the Cardinals mustered only 20.8 in the final four games without him.",
    "A solid effort in the 40-yard dash and in position-specific drills could establish London as the clear WR1 and make him a strong possibility for Atlanta with the eighth overall pick.",
    "Lindberbaum might be long gone by the time they're on the clock, but they should keep an eye on how he measures and performs in Indianapolis in case he starts to slip on draft night.",
    "Philadelphia Eagles: LB Nakobe Dean, Georgia\nThe Philadelphia Eagles haven't drafted an off-ball linebacker in the first two rounds since they picked Mychal Kendricks 10 years ago.",
    "Chicago Bears: WR Alec Pierce, Cincinnati\nThe Chicago Bears took the first step to rebuilding their roster last offseason when they traded up to select quarterback Justin Fields.",
    "Pittsburgh Steelers: QB Desmond Ridder, Cincinnati\nThe Pittsburgh Steelers seem to be set on Liberty quarterback Malik Willis, according to Pro Football Network's Tony Pauline.",
    "But they can meet Willis and break down film with him, which should provide a better picture of where the organization stands in addressing the game's most important position.",
    "Burrow had to play through an MCL sprain during the biggest game of his life because the offensive line floundered, which says everything about the Bengals' current situation.",
    "New York Giants: OL Ikem Ekwonu, North Carolina State\nThe best-case scenario for the New York Giants involves Alabama's Evan Neal or North Carolina State's Ikem Ekwonu at No.",
    "4 overall pick last year..\nLike Pitts, USC's Drake London is another young, massive (6'5\", 210 pounds) target who could make life easier on veteran quarterback Matt Ryan.",
    "Things didn't go as planned as the Colts failed to make the playoffs, and the team is \"actively looking\" for a new quarterback, according to NFL Network's Ian Rapoport.",
    "Detroit Lions: Edge Kayvon Thibodeaux, Oregon\nMichigan edge-rusher Aidan Hutchinson seems to be the obvious choice for the Detroit Lions with the second overall pick.",
    "Buffalo Bills: NT Jordan Davis, Georgia\nGeorgia nose tackle Jordan Davis proved to be a difference-maker when he was on the field for the reigning national champions.",
    "Ridder helped elevate a Group of Five program into uncharted territory, showed the capability to make NFL throws from the pocket and displayed excellent athleticism.",
    "The consensus All-American and reigning AAC Defensive Player of the Year never surrendered a touchdown during his collegiate career, either, per Pro Football Focus.",
    "Instead of selecting 15th overall thanks to the Jaylen Waddle trade, the Dolphins own this year's 29th pick after surrendering last year's third overall selection.",
    "During Andrew Berry's two-year tenure as Browns general manager, he's spent first-round picks on underclassmen from Power Five programs who play premium positions.",
    "Georgia's Devonte Wyatt is an ideal fit for the Chiefs because he's a true three-down interior defender with the versatility to play all along the defensive front.",
    "As long as the Lions don't have blinders on, general manager Brad Holmes and head coach Dan Campbell should realize that Hutchinson isn't their only option at No.",
    "Denver Broncos: QB Kenny Pickett, Pittsburgh\nThe Denver Broncos sit in the pole position among teams looking to potentially address quarterback through the draft.",
    "Although the Carolina Panthers own the sixth pick—three ahead of Denver—they'd have to pass up better value at other positions to take a quarterback at that spot.",
    "Baltimore has issues along its offensive line, and Penning could be the long-term answer at right tackle as long as left tackle Ronnie Stanley comes back healthy.",
    "Besides, the unit must get stronger after the Cincinnati Bengals' defensive front dominated the middle of the line of scrimmage throughout most of the Super Bowl.",
    "According to Pro Football Focus, Lloyd posted the highest overall grade, the highest run-defense grade and the most pressures by any Pac-12 linebacker since 2019.",
    "Wilson probably won't post the fastest 40-yard-dash time, but he's explosive, and the 21-year-old can be the perfect complement to fellow former Buckeye Thomas.",
    "Arizona Cardinals: WR Jahan Dotson, Penn State\nThe Arizona Cardinals offense started to fall apart after wide receiver DeAndre Hopkins tore his ACL in December.",
    "There's more depth at wide receiver in this year's class, particularly near the top of the second round when the Bears will be on the clock for the first time.",
    "How a previously injured knee checks out during medical evaluations is another sticking point, which is why he might be available with the 47th overall pick.",
    "And that opens up other aspects of your offense, and so he's got a big value when it comes to being on the field, and unfortunately, we didn't have him some.",
    "Houston Texans: S Kyle Hamilton, Notre Dame\nSean Taylor and Eric Berry are the only two safety prospects this century drafted among the top five selections.",
    "The 21-year-old's upside may drive him up boards much further than expected depending on how he performs compared with other elite athletes at the position.",
    "The B/R Scouting Department doesn't have a quarterback ranked among its top 15 prospects, while NFL Media's Daniel Jeremiah doesn't have one in his top 25.",
    "Neal simply needs to show the caliber of athlete he's already considered to be since he entered this year as college football's premier athletic standout.",
    "Baltimore Ravens: OT Trevor Penning, Northern Iowa\nFew prospects would fit the Baltimore Ravens better than Northern Iowa offensive tackle Trevor Penning.",
    "The incoming class will be defined by its defensive line prospects, though defensive tackle isn't nearly as deep or top-heavy as the crop of edge-rushers.",
    "They could lose significant experience at linebacker since Dont'a Hightower, Jamie Collins Sr., Ja'Whaun Bentley and Harvey Langi are pending free agents.",
    "The defensive lineman's skill set may be perfect for Brandon Staley's scheme, but he's far from a polished prospect, particularly with his hand usage.",
    "The Colts seemed like a soft landing spot for Wentz since multiple coaches on staff had previous experience working with the 2016 second overall pick.",
    "New Orleans Saints: WR Garrett Wilson, Ohio State\nTwo major stumbling blocks ahead of the New Orleans Saints' 2022 campaign have already been solved.",
    "The 6'6\", 304-pound left tackle came to the United States as an Austrian foreign exchange student and didn't start playing the game until he was 14.",
    "Las Vegas Raiders: OT Bernhard Raimann, Central Michigan\nCentral Michigan's Bernhard Raimann is an overaged prospect yet brings significant upside.",
    "Even though wide receiver is a far bigger concern for them, the Browns might be in a position where Karlaftis is the best available prospect at No.",
    "They didn't do enough last offseason to properly protect second-year quarterback Joe Burrow, and it cost them their first-ever Super Bowl victory.",
    "But the 2020 fourth-round pick hasn't been a consistent performer, and Linderbaum would be a significant upgrade if he were to slide on draft day.",
    "The consensus All-American is a 6'4\", 220-pound safety with unbelievable range and capabilities of contributing at all three levels of a defense.",
    "Lloyd fits the Patriots mold as a versatile defender capable of playing multiple roles, but he'll have to remain available until the 21st pick.",
    "The biggest difference between these prospects is that Neal is built like a traditional left tackle and is a more polished pass pass protector.",
    "Green's performance in Indianapolis could solidify the versatile blocker as a first-round option and indicate where he'll best fit in the NFL.",
    "He has an opportunity at the combine to decisively overtake Stingley as the top cornerback prospect and stake his claim as a top-10 prospect.",
    "However, Pitt's Kenny Pickett is perhaps the safest possible selection among the incoming crop, which makes him an intriguing fit for Denver.",
    "The Cardinals need to find a contingency plan this offseason to make sure their offense remains on track whenever Hopkins isn't on the field.",
    "Ohio State's Garrett Wilson is a fascinating prospect because he falls somewhere between the class' top-rated and fifth-best wide receiver.",
    "Yet scouts should drool over what Willis can do, which is exactly why the combine is a great opportunity for him to stake his claim as QB1.",
    "McDuffie may not be the ideal corner, but he could bring exactly what Tennessee needs, even if cornerback isn't considered a primary need.",
    "The Eagles should be interested in how Dean performs during drills and interviews and how he measures since a lack of length is a concern.",
    "Los Angeles Rams: OL Dylan Parham, Memphis\nThe Los Angeles Rams sacrificed first-round draft picks in their quest to claim a championship.",
    "The B/R NFL Scouting Department had Penning ranked as a late-first/early-second-rounder on its latest big board, but he has room to climb.",
    "With his future in Atlanta still uncertain, the Falcons need to find another receiving threat to complement tight end Kyle Pitts, the No.",
    "As the game continues to evolve, a safety's skill set has as well, and Hamilton is the perfect representation of a modern defensive back.",
    "Los Angeles Chargers: DL Travon Walker, Georgia\nThe Los Angeles Chargers lack a certain brand of physicality along their defensive front.",
    "Considering this unlikely story, Raimann's growth potential is immense, particularly since he's one of the class' more physical blockers.",
    "The Las Vegas Raiders invested in Alex Leatherwood a year ago and immediately inserted him at right tackle, where he looked out of place.",
    "Seattle Seahawks: RB Breece Hall, Iowa State\nThe Seattle Seahawks have a problem if they still plan to feature a physical rushing attack.",
    "The Titans chose Farley with last year's 22nd pick despite his lengthy injury history, which included a torn ACL and two back surgeries.",
    "Texas A&M's Kenyon Green is the most intriguing among the second-tier options because he never found a home along the Aggies front five.",
    "The reigning Rimington Trophy winner is one of the class' best run-blockers, and he has impressive lateral agility, toughness and drive.",
    "How he tests in Indianapolis could help show whether he's just raw in certain areas or is too stiff to be considered a premium prospect.",
    "\"We've been totally supportive in every way that we can be, both emotionally and financially in working with him as well as his agent.",
    "Penn State's Jahan Dotson is largely being overlooked among the projected first-round receivers because of his 5'11\", 184-pound frame.",
    "Pierce is a 6'2¾\", 208-pound outside target with the ability to stretch the field, but that's only part of what should intrigue teams.",
    "However, he needs to show he is comfortable with coverage drops and has yet to decide whether he'll participate in on-field workouts.",
    "How he tests at the combine could help determine whether his explosiveness translates to his becoming more than just a run defender.",
    "The 6'4\", 205-pound wide receiver required congenital fusion surgery for his neck, which cost him the entirety of the 2020 campaign.",
    "But Hamilton can be found in the same tier as those edge-rushers and provide a team with a unique talent as a defensive centerpiece.",
    "General manager Chris Ballard made a bold move when he acquired Carson Wentz, which cost the franchise this year's first-round pick.",
    "Kansas City Chiefs: DT Devonte Wyatt, Georgia\nThe Kansas City Chiefs' defensive front could look drastically different next season.",
    "Minnesota Vikings: CB Ahmad Gardner, Cincinnati\nThe sky seems to be the limit for Ahmad Gardner's rise in this year's draft class.",
    "The offensive interior is a great starting point since center Brian Allen and right guard Austin Corbett are pending free agents.",
    "Upon arriving to campus, Stingley established himself as an elite cover corner during the Tigers' 2019 national championship run.",
    "Sanders may not come into the league as an every-down defender, but he can be an explosive sub-package defender from the get-go.",
    "As long as the potential red flags are quelled, Stingley should be in consideration for either of the team's top-10 selections.",
    "The group will go from suspect to the league's worst if they decide to release Jarvis Landry to add $14.9 million in cap space.",
    "Considering the team doesn't have a solid option behind center and owns the 27th pick, Tampa Bay can build a new-look offense.",
    "The 6'5\", 275-pound underclassman is powerful at the point either working as a base end or reducing inside to the interior.",
    "The 21-year-old is a more natural pass protector than both of them, even though they're more highly regarded at the moment.",
    "He also underwent offseason foot surgery and won't do the on-field portion of the combine, per NFL Network's Mike Garafolo.",
    "Green Bay Packers: WR Justyn Ross, Clemson\nWill the Green Bay Packers finally spend a first-round pick on a wide receiver?",
    "In fact, his grade during that campaign was the highest among SEC cornerbacks since 2015, according to Pro Football Focus.",
    "His tenacious and nasty on-field presence should appeal to any coach, as he tries to bury every opponent across from him.",
    "The Texans should look long and hard at Oregon's Kayvon Thibodeaux and Michigan's Aidan Hutchinson if they're available.",
    "Also, the Bucs can become a run-heavy team with Walker leading the way as they figure out a long-term quarterback plan.",
    "New England Patriots: LB Devin Lloyd, Utah\nUtah's Devin Lloyd appears to be made to play for the New England Patriots.",
    "The NFL universe gathers in Indianapolis this week for the annual opportunity to get a closer look at the draft class.",
    "Regardless of what happens with star quarterback Aaron Rodgers and wideout Davante Adams this offseason, they should.",
    "Given the questions surrounding this year's quarterback class, that still might be too early to target that position.",
    "San Francisco 49ers: Edge Myjai Sanders, Cincinnati\nTrey Lance is the San Francisco 49ers' de facto first-round pick.",
    "A team without a first-round pick can take advantage of a perceived market inefficiency and nab a top-notch prospect.",
    "Along with the Denver Broncos in the ninth slot, they are considered the most likely spots for a quarterback to land.",
    "Michigan State's Kenneth Walker III can provide excellent value at the bottom of the first round as the class' RB1.",
    "But the Bengals should quietly observe and hope he's available when they're on the board toward the end of Round 1.",
    "Cincinnati Bengals: OG Zion Johnson, Boston College\nThe Cincinnati Bengals' offensive line issues are not a secret.",
    "Jadeveon Clowney is about to become a free agent, and it's unclear whether he'll be back in Cleveland next season.",
    "Even so, Sanders is lightning quick off the snap and much stronger at the point of attack than his size indicates.",
    "However, questions about Stingley's ability to be \"locked in\" arose among scouts, according to ESPN's Matt Miller.",
    "Still, Ridder would be a solid value, particularly for a team such as the Steelers with a strong supporting cast.",
    "With the 18th pick and the possibility of Jameis Winston's return, though, quarterback shouldn't be the priority.",
    "The confirmation Jacksonville is searching for should come in the form of a 6'7\", 350-pound left tackle prospect.",
    "Thibodeaux is more flexible and explosive than Hutchinson, which could give him an edge in head-to-head debates.",
    "London is only 20 years old and has massive potential to pair well with Pitts as an inside-out receiving threat.",
    "Memphis' Dylan Parham is as good of an option as any because he projects to any of the three interior positions.",
    "He still could be, but how things check out in Indianapolis will go a long way in determining his actual value.",
    "The Minnesota Vikings have invested plenty in cornerbacks over the years but still haven't solved the position.",
    "Tampa Bay Buccaneers: RB Kenneth Walker III, Michigan State\nThe Tampa Bay Buccaneers are in a transitory phase.",
    "But based on positional needs heading into the offseason, here's who each team should be eyeing at the combine.",
    "His weight at the combine could go a long way toward easing any concerns teams might have about his skill set.",
    "Aside from Farley's recovery, the Titans continued to rely on Jackrabbit Jenkins, who will turn 34 in October.",
    "During his collegiate career, Parham started 11 games at right guard, 11 at right tackle and 28 at left guard.",
    "\"A fresh start isn't a new place, it's a mindset,\" Thomas tweeted after news of his restructure became public.",
    "The Saints can build a short-term bridge and sink a significant asset into making the supporting cast better.",
    "The most teams will get from Stingley—and the most important part of his evaluation—will be his medical exam.",
    "Miami Dolphins: OL Kenyon Green, Texas A&M\nThe Miami Dolphins must address the league's worst offensive line.",
    "At the same time, he's much further behind other incoming quarterbacks in NFL passing concepts and coverages.",
    "A surprisingly impressive or disappointing performance shouldn't completely derail any prospect's evaluation.",
    "While Hutchinson deserves to be selected near the top of the class, Oregon's Kayvon Thibodeaux does as well.",
    "If Rodgers and Adams return, the Packers need to find a secondary target who can threaten opposing defenses.",
    "Others should consider how quickly he can grow into a starting role based on his non-traditional background.",
    "New York Jets: CB Derek Stingley Jr., LSU\nLSU's Derek Stingley Jr. is an enigma in this year's draft class.",
    "Once the organization is finally on the board in the second round, it can address another premium position.",
    "However, Ross played in 38 games during his other three seasons and showed flashes of becoming a future No.",
    "A lack of a first-round selection decreases options, but Nevada's Carson Strong may fit Indianapolis' mold.",
    "Cleveland Browns: DE George Karlaftis, Purdue\nThe Cleveland Browns have a glaring problem at wide receiver.",
    "He figures to win over multiple teams during the combine process, and the Bears should be chief among them.",
    "He understands NFL concepts and where to go with the ball after three years under Mark Whipple's tutelage.",
    "Along with Wentz's acquisition, Ballard previously drafted Jacob Eason, who's a traditional pocket passer.",
    "A near-half-round disparity could make all the difference in which offensive line prospects are available.",
    "Wyatt has a chance to establish himself as the best in his position class, but it's not a stellar group.",
    "As a result, the 20-year-old won't participate in drills at the combine, per NFL Network's Ian Rapoport.",
    "Whether or not it's Willis, Pittsburgh must find a quality option to be Ben Roethlisberger's successor.",
    "Los Angeles should concentrate on positions that hold lesser value but still fill potential need areas.",
    "The organization does have some financial wiggle room with $21.3 million in projected salary-cap space.",
    "The combine should serve as confirmation of who they want to select once the draft begins in Las Vegas.",
    "If one or both of them leave, they'll need to provide more help for third-year quarterback Jordan Love.",
    "With the 31st overall pick, Cincinnati won't be in position to take an elite offensive tackle prospect.",
    "The 6'6¾\", 330-pound blocker's overall pad level and inconsistency with hand placement are problematic.",
    "Indianapolis Colts: QB Carson Strong, Nevada\nThe Indianapolis Colts organization sits at a crossroads.",
    "Depending on how those drills go, the perfect Patriots prospect may not make it to New England's slot.",
    "Georgia's Nakobe Dean, Utah's Devin Lloyd and Alabama's Christian Harris are all in the conversation.",
    "The Chargers ranked among the league's bottom 10 in yards per carry allowed during the 2021 campaign.",
    "Washington Commanders: QB Malik Willis, Liberty\nMalik Willis' combine experience will be fascinating.",
    "They now need to build around Fields to enhance the young signal-caller's chance of being successful.",
    "Star Lotulelei started to decline last season, and Harrison Phillips is about to become a free agent.",
    "But medical testing and interview sessions can change how a scouting department looks at a prospect.",
    "The biggest questions surrounding him continue to center on long speed and whether he can separate.",
    "The 20-year-old shouldered the Cyclones offense over the last three years with 3,941 rushing yards.",
    "The consensus first-team All-American led the Utes with 22 tackles for loss and four interceptions.",
    "The entire package could make him the first Round 1 linebacker drafted by Philadelphia in 43 years.",
    "First, he may be the fastest linebacker in the class and has excellent sideline-to-sideline range.",
    "Upon finishing his high school career, he had to return home and serve a mandatory military stint.",
    "He would fill a need at a premium position by replacing Cam Robinson, who is a pending free agent.",
    "The organization could also release Frank Clark and save $13.4 million toward the 2022 salary cap.",
    "That's OK, particularly if he plays behind a strong offensive line and in a run-dominant offense.",
    "While other teams might not value Davis highly, the Bills are in desperate need of a 1-technique.",
    "Chicago traded its first-round pick to the New York Giants in the Fields deal, but it has the No.",
    "Instead, he played multiple positions with questions about whether he's a future guard or tackle.",
    "Georgia's Travon Walker is one of the most physical players at any position in the draft class.",
    "Ekwonu could easily move to guard or possibly right tackle depending on how New York views him.",
    "The entire complexion of the draft could turn based on what happens over the next several days.",
    "Even without added bulk, Linderbaum should be considered a top-10 talent in this year's class.",
    "The defensive tackle class remains in flux, and Wyatt's eventual standing will be interesting.",
    "The Denver Broncos, Washington Commanders and New Orleans Saints all select before Pittsburgh.",
    "Philadelphia owns three first-round selections and could land the class' top-rated linebacker.",
    "Fellow Georgia defender Travon Walker and Houston's Logan Hall provide inside-out versatility.",
    "The Niners have needs at both spots, and this year's class of pass-rushers is extremely deep.",
    "In fact, Jerry Robinson in 1979 is the last linebacker the Eagles chose in the opening frame.",
    "As problematic as that position is for the Browns, defensive end is far from settled as well.",
    "Ridley stepped away after only five games last season to \"focus on [his] mental well-being.\"",
    "Whether or not he wants to do that—he may decide that he wants a fresh start someplace else.",
    "And they could need more than just a running mate for Hopkins since Christian Kirk and A.J.",
    "Obviously, the organization doesn't believe in spending significant assets on the position.",
    "Stingley didn't play as well the following year and suffered a Lisfranc injury last season.",
    "It would be arguably the best attack plan for a team that won't choose until the 61st pick.",
    "In his three seasons at Washington, McDuffie missed one game and started 26 of 29 contests.",
    "But it never hurts to keep someone in mind when he's the ideal solution to a problem area.",
    "The front office invested multiple assets into the position group only to see it flounder.",
    "Unfortunately, he doesn't plan to work out at the combine, per NFL Network's Ian Rapoport.",
    "1 overall pick, the Jaguars are the only franchise that holds its draft fate in its hands.",
    "The first-team All-Pac-12 performer might be a little undersized at 5'11\" and 195 pounds.",
    "Connecticut's Travis Jones and Oklahoma's Perrion Winfrey impressed at the Senior Bowl.",
    "He converted to center during Senior Bowl week and excelled as one of the best players.",
    "Johnson won't be the most athletic player on the field at Lucas Oil Stadium this week.",
    "He helped the Bengals overcome problems along their front five for most of the season.",
    "But he plays much bigger than his size, and he's a dynamic threat in the passing game.",
    "Basically, the draft is an opportunity to lay the groundwork for a different identity.",
    "Last year's Outland Trophy winner appeared far more comfortable upon moving to guard.",
    "His draft status will likely just come down to how he projects in certain situations.",
    "As owners of the 20th pick, the franchise may not be in a position to select Willis.",
    "The combine will provide him with an opportunity to show his fluidity in his drops.",
    "The best thing to do is reset under the leadership of new head coach Mike McDaniel.",
    "Furthermore, the Seahawks don't own a first-round pick after the Jamal Adams trade.",
    "Cincinnati wideout Alec Pierce could be a welcome addition near the start of Day 2.",
    "Taylor and Berry lived up to expectations despite playing a less valuable position.",
    "Former Bulldogs teammate Jordan Davis is the best prospect at the point of attack.",
    "The Cowboys already have center Tyler Biadasz under contract for two more seasons.",
    "The Washington Commanders own this year's 11th pick and have a need behind center.",
    "For most of the year, LSU's Derek Stingley Jr. held the honor of being called CB1.",
    "The Saints should hope other organizations aren't quite as high on the playmaker.",
    "The combine will help dot the I's and cross the T's for the Jacksonville Jaguars.",
    "At the 2022 NFL scouting combine, teams will be watching these prospects closely.",
    "Their performances could affect their standing on draft boards around the league.",
    "But he can't continue to take the same beating he has over the last two seasons.",
    "Wide receiver and offensive line are both significant areas of need for Chicago.",
    "Cincinnati's Myjai Sanders is a highly disruptive defender with a slender frame.",
    "The quarterback position remains the key to everything else the franchise does.",
    "If Penning tests well, the Ravens would be an ideal landing spot for him at No.",
    "And we got to learn from that and be better the next time he has to miss time.",
    "If he passes medical evaluations, he could be a steal in the late first round.",
    "Clemson's Justyn Ross may be the most intriguing option for the Packers at No.",
    "How he can add mass over time will be an interesting aspect to his evaluation.",
    "Chris Carson projects as the starter with one more year remaining on his deal.",
    "Iowa State's Breece Hall has the best vision of any running back in the class.",
    "Uncertainty about the incoming class makes those possible selections suspect.",
    "Of the two, Ekwonu seems more likely since Neal is the favorite to be the No.",
    "Willis may be the Steelers' target, but the franchise should look at Ridder.",
    "He's exactly what a team wants in a long, physical, reliable defensive back.",
    "The Liberty offense did its signal-caller no favors in what it asked of him.",
    "In this year's class, Hamilton is the unicorn and should be treated as such.",
    "As such, he could blow teams away with his readiness to lead an NFL offense.",
    "I don't have information to indicate that, but we'll see how that plays out.",
    "A 290-pound center who excels in a zone-blocking scheme isn't for everyone.",
    "He's a statuesque pocket passer who loves to drive the ball down the field.",
    "Jacksonville Jaguars: OT Evan Neal, Alabama\nIn-season scouting is complete.",
    "NFL scouting departments have attended multiple collegiate all-star events.",
    "The first-team All-ACC performer may also be the better fit for the Giants.",
    "He finished second on the squad with eight sacks and six broken-up passes.",
    "The real question is whether Walker will make it to the 17th overall pick.",
    "For some organizations, his age will be a non-starter in the first round.",
    "Ekwonu provides inside-out versatility and dominated in the running game.",
    "But the 27-year-old required disk fusion surgery on his neck last season.",
    "Farley's rookie campaign ended on injured reserve with a second torn ACL.",
    "Alabama's Evan Neal is considered an elite prospect in this year's class.",
    "Melvin Ingram III, Derrick Nnadi and Jarran Reed are pending free agents.",
    "9, the Broncos may be the first team willing to select a signal-caller.",
    "That diminutive frame might make him available for the Cardinals at No.",
    "Cincinnati's Desmond Ridder is QB1 in Bleacher Report's draft rankings.",
    "Cameron Dantzler gives the team one option to work outside the numbers.",
    "And Pierce got his degree in mechanical engineering in only 3.5 years.",
    "In other words, Pierce is a capable target, athletic, tough and smart.",
    "The reasons behind that ranking should become apparent at the combine.",
    "The fact Hutchinson is a Michigan native seems like icing on the cake.",
    "Pickett likely won't test as well as other prospects in Indianapolis.",
    "Teams typically don't value space-eaters the same way they once did.",
    "He was also the leader of the defense for national champion Georgia.",
    "However, Green is a former 5-star recruit and an excellent athlete.",
    "Adams led the team with 169 targets during the 2021 regular season.",
    "Now, it's time to build it back up, starting with an elite talent.",
    "Boston College's Zion Johnson is a plug-and-play starter at guard.",
    "Aside from Joey Bosa, the group isn't good at the point of attack.",
    "If he is cleared, he should vault back among the top 10 prospects.",
    "The Rams won't select until the third round in this year's draft.",
    "Patrick Peterson and Mackensie Alexander are pending free agents.",
    "Not owning their original first-round pick is a hang-up, though.",
    "The Giants already have a top-five pick in place at left tackle.",
    "We'll see, but I'm mostly concerned about him as a human being.\"",
    "He fits prototypical standards as a 6'3\", 200-pound cornerback.",
    "It would be a boon if Gardner is available with the 12th pick.",
    "However, one of the top interior prospects could be available.",
    "B/R's Scouting Department currently has Thibodeaux as the No.",
    "The class is considered weak compared to previous iterations.",
    "Still, the 6'2\", 197-pound cornerback presented elite traits.",
    "The team will open its draft weekend with the 41st selection.",
    "Andrew Thomas showed tremendous growth in his second season.",
    "Strong will never be mistaken for a dual-threat quarterback.",
    "If he does, he could be the obvious choice for Denver at No.",
    "Gardner, on the other hand, doesn't have the same concerns.",
    "At that time, Raimann played wide receiver and cornerback.",
    "Despite limited playing time as a rookie, last year's No.",
    "Quarterback Tom Brady and guard Ali Marpet have retired.",
    "25 overall, so they still may be out of range for Davis.",
    "However, his floor is much higher than any other option.",
    "The Bearcats tried him at linebacker for a short stint.",
    "The Dallas Cowboys currently own the 24th overall pick.",
    "Rashaad Penny and Alex Collins are pending free agents.",
    "The defensive lineman explodes into and through blocks.",
    "Then he went to the Senior Bowl and excelled at center.",
    "The Houston Texans sit in stage two of their rebuild.",
    "They just need a quarterback to tie it all together.",
    "At the Senior Bowl, he measured 6'4\" and 242 pounds.",
    "A running back should be near the top of their list.",
    "As a prospect, McDuffie brings what Farley couldn't.",
    "He's a standout athlete with exceptional arm talent.",
    "It's a perfect setting for the quarterback to excel.",
    "The approach worked as the Rams won Super Bowl LVI.",
    "But they can sit back and watch whether he tumbles.",
    "Purdue edge-rusher George Karlaftis fits the bill.",
    "General manager Nick Caserio tore down the roster.",
    "No one would blame the Lions for going that route.",
    "Generally, Lloyd is better when he plays downhill.",
    "His interviews with teams will be crucial as well.",
    "The Steelers can't become blind to other options.",
    "Arik Armstead found a home inside with the 49ers.",
    "But he's reliable, physical and ultracompetitive.",
    "The Buffalo Bills won't be on the clock until No.",
    "Ordinarily, cornerbacks are considered premium.",
    "Whatever occurs, reinforcements are necessary.",
    "Davis could be a defensive anchor for Buffalo.",
    "The devaluation of ball-carriers is no secret.",
    "Dean is most intriguing on a couple of levels.",
    "Raimann will turn 25 during his rookie season.",
    "Notre Dame's Kyle Hamilton could be the next.",
    "He was a four-sport standout in high school.",
    "First-round picks weren't the only casualty.",
    "3 pick will be the future of the franchise.",
    "The defensive line class is loaded, though.",
    "No other player finished with more than 65.",
    "His skill set transcends positional value.",
    "Circumstances are different in this case.",
    "Right tackle remains a significant issue.",
    "The Commanders may prefer a \"safer\" pick.",
    "That could be cornerback or edge-rusher.",
    "The New York Jets need secondary help.",
    "The rest of the front five is a wreck.",
    "This year should be different, though.",
    "The Chargers need more dawgs up front.",
    "Where better to find one than Georgia?",
    "Green are about to become free agents.",
    "Those two traits don't usually mix.",
    "Willis is a traits-based prospect.",
    "Penning's technique isn't perfect.",
    "Hopefully, it's not very often.\"",
    "1 overall prospect in the class.",
    "But there is little depth.",
    "Why wouldn't he, though?",
    "As owners of the No.",
    "That's unacceptable.",
    "1 overall selection.",
    "We don't know that.",
    "I don't know that.",
    "Burrow is special.",
    "39 overall pick.",
    "1 wide receiver.",
    "B/R Recommends",
    "28 overall.",
    "13 overall.",
    "14 overall.",
    "At No.",
    "23.",
    "9.",
    "2.",
    "5."
  ]
}