{
  "id": 13914,
  "mediaId": 8412,
  "date": "2022-03-15",
  "headline": "Los Angeles Rams left tackle Andrew Whitworth retires after 16 NFL seasons, goes out on top",
  "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0214%2Fr974199_1296x729_16%2D9.jpg",
  "link": "https://www.espn.com/nfl/story/_/id/33510042/los-angeles-rams-left-tackle-andrew-whitworth-retires-16-nfl-seasons",
  "mediaOutlet": "Pocono News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brady Henderson\n\nESPN",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Whitworth was quoted in December as saying that the only way he'd retire was if the Rams couldn't afford him \"or there's just some other way where it doesn't work out for both of us for me to be back.\"",
    "Whitworth's backup, Joe Noteboom, agreed to re-sign with the Rams on Monday for a three-year contract worth up to $47.5 million, including $25 million guaranteed, a source told ESPN's Lindsey Thiry.",
    "But two days before Super Bowl LVI, Whitworth sounded as though he was prepared to call it a career if the Rams beat the Cincinnati Bengals, the team with which he spent his first 11 seasons.",
    "We may not have found a way to win a playoff game or win a championship, but we won a lot of freakin' games and we won a bunch of division championships, and I'm proud of those moments.",
    "I just felt like right now, I felt like I'm at a time in my life where maybe chasing the best dad I can be, the best husband, best friend are things to me that are important to me.\"",
    "\"There is nobody that has had a bigger impact than Andrew Whitworth on establishing the foundation, the culture of 'We Not Me,' and being a part of something bigger than yourself.",
    "The Los Angeles Rams' 40-year-old left tackle announced his retirement Tuesday, ending a 16-year NFL career that he capped with a Super Bowl victory against his former team.",
    "Andrew is at the heart of our success in Los Angeles these past five years, both for how he wraps his arms around this region and how he lifts up our entire organization.\"",
    "That point was on display after the Rams' Super Bowl victory as the NFL released a video Tuesday of Whitworth telling his kids, \"That was daddy's last football game.\"",
    "According to Elias Sports Bureau research, he became the only player to start at left tackle in an NFL game at 40 years old after turning that age in December.",
    "Over his five seasons with the Rams, Whitworth started 71 games and ranked second in ESPN's pass block win rate among offensive tackles.",
    "The Rams made him one of their first free-agent additions under McVay when they signed him to a three-year, $33.75 million deal in 2017.",
    "His hard work to perform at the highest levels on the field is only surpassed by his commitment to making his communities better.",
    "Center Brian Allen also is returning, with his three-year deal worth $24 million, a source told ESPN's Adam Schefter on Monday.",
    "Whitworth's résumé includes four Pro Bowl selections (2012, 2015-17) and two first-team All-Pro selections (2015 and 2017).",
    "Helping influence and affect people in the right way, through the good -- but I think even more importantly, in the bad.",
    "A second-round pick out of LSU in 2006, Whitworth started 168 games for the Bengals over his 11 seasons in Cincinnati.",
    "Whitworth's retirement will save the Rams $15.5 million in cap space, according to Roster Management System data.",
    "I had some unbelievable teammates and coaches in that time,\" Whitworth said of his time with the Bengals.",
    "But as driven as I am, I still get up every morning at 5 or so and get in my sauna and try to get moving.",
    "He had gone back and forth in public comments about whether the 2021 season would be his last.",
    "Whitworth said the \"warrior\" in him wants to continue playing, but his \"body just doesn't.\"",
    "Whitworth had one year left on the three-year, $30 million agreement he signed in 2020.",
    "Los Angeles was roughly $19 million over the 2022 salary cap as of Sunday, per RMS.",
    "I don't know how five years from now he's not putting a gold jacket on in Canton.\"",
    "Added Rams owner Stan Kroenke: \"Andrew Whitworth epitomizes the best of people.",
    "There's just still been some days where my body doesn't want to move with me.",
    "But I'm somebody, if you know me well enough, I'm always chasing something.",
    "\"And then when I look at my time here with the Rams, it's no different ...",
    "That's when he was at his best,\" Rams coach Sean McVay said Tuesday.",
    "I know that we created a culture that was about winning.",
    "He was named the 2021 Walter Payton NFL Man of the Year.",
    "He made the announcement in a video posted to Instagram.",
    "I know we made a lot of differences in that community.",
    "It's been probably one of the toughest months for me.",
    "Walter Payton Man of the Year, Super Bowl LVI champ.",
    "I feel great about my time here and what I've done.",
    "It's just time,\" he said during a news conference.",
    "Obviously it was a long season and everything.",
    "\"I gave my heart and soul to that place.",
    "McVay added: \"Can't write it any better.",
    "Andrew Whitworth is going out on top.",
    "\"The body is tired."
  ]
}