{
  "id": 1601,
  "mediaId": 2586,
  "date": "2022-02-18",
  "headline": "Rams Urged to ‘Upgrade’ Help for Matthew Stafford in 2022",
  "image": "https://heavy.com/wp-content/uploads/2022/02/9-1-e1645214101365.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/los-angeles-rams/upgrade-for-stafford-needed/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lorenzo Reyna",
  "authorUrl": "https://heavy.com/author/lorenzoreyna714/",
  "termIds": [
    2032,
    3708,
    3446,
    3085,
    2188,
    2257,
    2832,
    4564,
    731
  ],
  "sentences": [
    "He managed to play surprisingly well at tackle over the last two seasons despite having a guard’s body and foot quickness.”\nWhy the Upgrade is a Possibility\nHere’s why the need for upgraded help is on the table for the Rams: Starting guard Austin Corbett and center Brian Allen.",
    "Weapon wise, Stafford and the Rams offense are in superior shape: Cooper Kupp is at the top of his game, Robert Woods and Tyler Higbee will both be healthy, Van Jefferson will return, Cam Akers is healthier and there’s the added chance of luring back Odell Beckham.",
    "(@jamareesalyer69) February 17, 2022\n‘Built Like a Refrigerator’\nThe All-Southeastern Conference performer has bounced between guard and tackle, which bodes well for a line that had linemen needing to play multiple spots on the line.",
    "“According to Pro Football Focus, he allowed just one sack since the 2020 term.”\nThe 6-foot-2, 320-pounder isn’t just stout as a pass blocker and national title winner, but is a fellow Georgia Bulldog like Stafford (and Michel).",
    "“If (general manager Les) Snead wants to upgrade quarterback Matthew Stafford’s pass protection on the interior, the Rams should consider Georgia’s Jamaree Salyer in the third round of the draft,” Moton writes.",
    "Noteboom took over the blindside duties when Whitworth was absent, but he’s also a pending free agent with a base salary of $920,000 per Spotrac and could he a target for teams seeking pass protection help.",
    "1 pick Aidan Hutchinson of Michigan:\nBrandon Thorn of Bleacher Report wrote that Sayler “is built like a refrigerator with very good arm length and solid initial quickness out of his stance.",
    "All the more reason why Snead, even with the expletive on his shirt and all, will likely need to turn to the draft for upgrades for Stafford as the Rams face a complete line makeover.",
    "Both men did surrender a combined eight sacks their side this past season, although both Allen and Corbett didn’t allow a sack during the postseason including the Super Bowl.",
    "The Rams also have a key decision to make with Joe Noteboom — who could be the successor for Andrew Whitworth at left tackle should “Whit” officially decide to retire.",
    "But an upgrade is still needed, as noted by Bleacher Report’s Maurice Moton in his Wednesday, February 16 article detailing every NFL’s team’s biggest need to fill.",
    "‘Biggest Need’ Hails From a Place Stafford Knows\nThe need for the Rams involves protecting Stafford moving forward — by adding to the interior.",
    "Both are free agents come March 16, are young at 27 and stayed healthy for most of the year (Allen started in 16 of 17 regular season games).",
    "But overall, keeping Stafford protected with the bevy of weapons surrounding him is considered the highest need for the champs.",
    "Here’s what could win over Stafford: The proposed help comes from a place he thrived at years ago…the University of Georgia.",
    "As crazy as it sounds I think it’s just really starting to hit me that we won a National Championship.. God is Good ??",
    "Per Ian Rapoport of the NFL Network, the Rams are still projected to have $21.2 million in cap space to work with.",
    "Even the Super Bowl champion Los Angeles Rams will need help for 2022 — especially pertaining to Matthew Stafford.",
    "The Rams, however, still face the tough decision on who to keep in their 2022 free agency class.",
    "And here’s what could win over Snead, Stafford, Sean McVay and company: He pummels potential No.",
    "Sayler, again, kept his quarterback’s uniform clean when called upon for front line protection.",
    "But he’s also a violent finisher, with 10 “knockdown” blocks according to his UGA bio.",
    "Signs are currently pointing to Miller resigning with the team along with Beckham.",
    "Matthew Stafford throws a pass during Super Bowl 56 on Sunday, February 13.",
    "And where does the biggest need lie for the Super Bowl 56 winner?",
    "Moton believes an upgrade is needed on offense for Stafford.",
    "#GoDawgs pic.twitter.com/rHyK4WtZwd\n— Jamaree Salyer ??"
  ]
}