{
  "id": 1717,
  "mediaId": 2740,
  "date": "2022-02-14",
  "headline": "56 things we learned from Super Bowl 56: How Rams scored crowning achievement vs. Bengals",
  "image": "https://www.gannett-cdn.com/presto/2022/02/14/USAT/6b863836-956c-42a2-aec8-3f1d23f82061-USP_NFL__Super_Bowl_LVI-Los_Angeles_Rams_at_Cincin_7.jpg?crop=2839,1597,x0,y137&width=2839&height=1597&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2022/02/14/super-bowl-56-things-we-learned-rams-bengals/6757838001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatodaycomnfl-topstories",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nate Davis",
  "authorUrl": "https://www.usatoday.com/staff/2646715001/nate-davis/",
  "termIds": [
    0
  ],
  "sentences": [
    "25: Burrow's Bengals seem to stand a better chance of keeping their core together for a while, especially if Joe Shiesty keeps dressing like this ...\n26: The Bengals' 6-25-1 mark (.203) in the previous two seasons is the worst ever for a team that advanced to the Super Bowl the following year.",
    "50: If the Rams' Aaron Donald retires, which he indicated was a possibility if Los Angeles won the crown, he will almost surely go down in history as the greatest interior defensive lineman in league history ... and arguably the greatest defender period.",
    "Ten Rams players had previous Super Bowl experience, though some – Miller (Super Bowl 50 MVP for the Denver Broncos) and Michel (the former Patriot scored the decisive TD against the Rams in Super Bowl 53) – enjoyed it with other teams.",
    "Though the folks in Baton Rouge hated to see that famed duo from the 2019 national championship team suffer a defeat, at least they got to see former Bayou Bengals Odell Beckham Jr. and Andrew Whitworth get their first Super Bowl rings.",
    "44: Burrow, who was sacked 51 times in the regular season and 19 more in the playoffs – including seven times by the Rams – became the first quarterback to be the most sacked in the regular season yet still advance to the Super Bowl.",
    "51: Rough Super Sunday debut for All-Pro Rams CB Jalen Ramsey, who was beaten for a 46-yard catch by Chase in the first quarter and a 75-yard TD by Higgins, who got away with a facemask penalty on Ramsey, to open the second half.",
    "Pretty impressive pre-game flyover, the five-plane mix including a World War II era P-51 leading the pack and flanked by a state-of-the-art F-22 and F-35 and Cold War-era – but still active and lethal – A-10 and F-16.",
    "Entering Sunday's game, the Los Angeles Rams and Cincinnati Bengals had combined for one Super Bowl win, the fewest going into a Super Sunday since Super Bowl 38 between the Carolina Panthers and New England Patriots.",
    "Rams coach Sean McVay, 36, and Bengals counterpart Zac Taylor, 38 – he was McVay's quarterbacks coach when LA reached Super Bowl 53 – combined for the lowest combined age of two Super Sunday coaching adversaries.",
    "A year after former Lions (and Rams) DT Ndamukong Suh won his first Super Bowl ring with the Bucs, Stafford also earned his Lombardi legacy – almost exactly one year after Detroit agreed to trade him to the Rams.",
    "52: Stafford is the third starting quarterback to win a Super Bowl in his first season with a team, joining Brady (2020 Tampa Bay Buccaneers) and Trent Dilfer (2000 Baltimore Ravens).",
    "Prior to Sunday, Super Bowl 27 – Dallas Cowboys 52, Buffalo Bills 17 on Jan 31, 1993 in Pasadena's Rose Bowl – was the last time the game had been played in the Los Angeles market.",
    "Per ESPN, Kupp became the first wideout to win the receiving triple crown (receptions, yards, TDs), Offensive Player of the Year honors and Super Bowl MVP in the same season.",
    "53: Bengals WR Tyler Boyd dropped his first ball of the 2021 season ... killing Cincinnati's penultimate drive with little more than six minutes left in the fourth quarter.",
    "34: The Bengals were the first team to reach the Super Bowl after posting a losing record in the previous five seasons since ... the 1999 St. Louis Rams won Super Bowl 34.",
    "McVay became the youngest head coach to win a Super Bowl at 36 years and 20 days, making him 303 days younger than Mike Tomlin was when the Steelers won Super Bowl 43.",
    "48: Congrats to Rams S Eric Weddle, who will return to retirement, torn pectoral and all, after collecting the first Super Bowl title of his decorated 14-year career.",
    "Mixon's TD pass was the first by a running back in the Super Bowl since the Rams' Lawrence McCutcheon connected in Super Bowl 14, a loss to the Pittsburgh Steelers.",
    "30: The very first Super Bowl – originally called the AFL-NFL World Championship Game – was played at the Los Angeles Memorial Coliseum on Jan. 15, 1967.",
    "24: Beckham, OLB Von Miller, RB Sony Michel, CB Darious Williams, G Austin Corbett, T Joe Noteboom and C Brian Allen are among LA's pending free agents.",
    "But the last two have, the Rams and Tampa Bay Buccaneers both winning in their own buildings even though the game is considered a neutral site affair.",
    "Whitworth, the oldest starting left tackle in NFL history, joined Rice and Brady as the only players in their forties to participate in a Super Bowl.",
    "Miller's pair of sacks gave him 4½ in two Super Bowl appearances, tied for the most on Super Sunday since sacks became an official statistic in 1982.",
    "11.Super Bowl 56 MVP Cooper Kupp had eight catches Sunday, bringing his 2021 playoff total to 33 – most ever by one player in a single postseason.",
    "Bengals rookie Evan McPherson didn't get to attempt a game-winning kick Sunday, but he did collect more cool points by watching the halftime show.",
    "1 draft picks, the Bengals' Joe Burrow coming off the board first in 2020, 11 years after Matthew Stafford was the top pick of the Detroit Lions.",
    "Stafford's 49,995 career passing yards and 323 TD passes in the regular season were the most for a quarterback making his Super Bowl debut.",
    "3: The Rams scored three points, tied for a Super Bowl-record low, in their first appearance under coach Sean McVay three years ago.",
    "Burrow and teammate Ja'Marr Chase had been 7-0 in postseason games going back to their time together at LSU prior to Sunday's loss.",
    "31: Prior to Sunday, Los Angeles' only Super Bowl champions were the 1983 Raiders, who thumped Washington 38-9 in Super Bowl 18.",
    "45: Those seven Super Sunday sacks Burrow absorbed were tied for the most ever by a QB since sacks became official in 1982.",
    "How the Giants found secrets to winning, and competing with Dodgers Can USC meet sky-high expectations under Lincoln Riley?",
    "Sure looked for a while like that hold Rams P Johnny Hekker botched, leading to a missed PAT, might come back to haunt LA.",
    "Super Bowl 56 was the 10th started by a \"Joe,\" Burrow joining Joes Namath, Kapp, Montana (4), Theismann (2) and Flacco.",
    "28: That was also the year Michael Jackson ushered in the mega-halftime show that has become a staple of Super Sunday.",
    "Morrall relieved Hall of Famer Johnny Unitas, leading the Baltimore Colts to victory over the Cowboys in Super Bowl 5.",
    "55: Stafford and Earl Morrall are the only quarterbacks to play for the Lions but later go on to win the Super Bowl.",
    "29: Beckham, who scored Sunday's first TD on a 17-yard hookup with Stafford, did a nice moonwalk tribute to Jackson.",
    "Kupp and Larry Fitzgerald in 2008 are the only players to score a touchdown in four games in a single postseason.",
    "McPherson's 14-for-14 ledger on field-goal attempts is a record for most makes in one postseason without a miss.",
    "5: Cincinnati RB Joe Mixon threw his first NFL pass Sunday, a 6-yard TD on a halfback option to WR Tee Higgins.",
    "He started and had seven tackles in the Atlanta Falcons' infamous Super Bowl 51 collapse against the Patriots.",
    "INGLEWOOD, Calif. – The 56 things we learned from Super Bowl LVI as the 2021 NFL season comes to a close:\n1.",
    "This marked the first Super Bowl since postseason slotting began in 1975 when there wasn't at least one No.",
    "49: After losing his first three playoff starts with Detroit, Stafford now owns a 4-3 postseason record.",
    "46: Those 19 playoff sacks absorbed by Burrow are five clear of the previous record (Wade Wilson, 1987).",
    "Players want transparency NFL draft 2022: Baker Mayfield among 12 veterans who could be on the move\n35.",
    "The teams combined for the fewest kickoff returns (1) and kickoff return yards (17) in a Super Bowl.",
    "McPherson's 14 converted FGs tied Adam Vinatieri's mark (2006) for most makes in one postseason.",
    "22: Rams WR Van Jefferson's wife went into labor during the game and had to leave the stadium.",
    "23: OBJ's partner, model Lauren Wood, expects to give birth to their first child at any time.",
    "The Joes' 10 Super Bowl starts match the 10 started by a \"Tom\" (Brady), who is 7-3 himself.",
    "The Bengals dropped to 0-3 on Super Sunday, and the Cleveland Browns have still never been.",
    "Hall of Famer Jerry Rice is the only other receiver to accomplish all of that in a career.",
    "S Ricardo Allen was the only Bengals player with Super Bowl experience prior to Sunday.",
    "The NFL's Green Bay Packers pulled away to beat the AFL's Kansas City Chiefs 35-10.",
    "The Rams drove for the game-winning score on their ensuing 15-play, 79-yard march.",
    "2: None of the first 54 Super Bowls featured a team playing on its home field.",
    "This was the second Super Bowl to pair starting quarterbacks who were both No.",
    "Cincinnati has lost its three Super Bowl appearances by a total of 12 points.",
    "Super Bowl 50 (Peyton Manning, Cam Newton) is the only other instance of No.",
    "21: Cincinnati remains one of 12 NFL franchises to never win the Super Bowl.",
    "Teams wearing white jerseys have now won 15 of the past 18 Super Bowls.",
    "47: The attendance for the first Super Bowl at SoFi Stadium was 70,048.",
    "NFL draft 2022 top 50 rankings: Aidan Hutchinson or Kayvon Thibodeaux?",
    "Mixon also attempted one pass in college for Oklahoma, also for a TD.",
    "But one of the best specialists in league history can rest easy.",
    "56: Super Bowl 57/LVII will be staged next year in Arizona.",
    "33: The Los Angeles area has now hosted eight Super Bowls.",
    "32: While LA now has two Lombardi Trophies, Ohio has none.",
    "Only Miami (11) and New Orleans (10) have more.",
    "54: The Curse of Bobby Layne is alive and well.",
    "Much better output in Sunday's 23-20 triumph.",
    "They are a collective 7-3 on Super Sunday.",
    "Is MLB using two different baseballs?",
    "The Bengals and Rams were both No.",
    "She successfully delivered a son.",
    "4 seeds entering the playoffs.",
    "1-selected QBs facing off.",
    "1 or 2 seed in the game.",
    "See you then.",
    "***",
    "36.",
    "37.",
    "38.",
    "39.",
    "41.",
    "40.",
    "43.",
    "42.",
    "10.",
    "13.",
    "12.",
    "27.",
    "15.",
    "14.",
    "17.",
    "16.",
    "20.",
    "18.",
    "19.",
    "8.",
    "9.",
    "6.",
    "7.",
    "4."
  ]
}