{
  "id": 2084,
  "mediaId": 2937,
  "date": "2022-02-10",
  "headline": "Rams rookie OT from Canada ‘totally killed it’ in first big NFL moment",
  "image": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2022/02/11ALARIC.JACKSON-hedshot.jpg?quality=100&strip=all",
  "link": "https://torontosun.com/sports/rams-rookie-ot-from-canada-totally-killed-it-in-first-big-nfl-moment",
  "mediaOutlet": "torontosun.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Kryk",
  "authorUrl": "https://torontosun.com/author/jokrykpostmediacom/",
  "termIds": [
    0
  ],
  "sentences": [
    "I’m really happy for him, and I reached out to him after the game and told him so.”\nArticle content\nFor his part, Jackson said Whitworth, Havenstein and Rams offensive line coach Kevin Carberry have been fantastic, patient mentors — helping him to slowly gain the confidence and knowledge required to succeed at this much higher level of play.",
    "Shelton slid over to centre, and Edwards returned to his normal spot at left guard and Jackson grabbed his helmet and ran in — for his first career snaps at the most important position on any offensive line, left tackle — as the guy who protects the quarterback’s blind side when he drops to throw in the pocket.",
    "After playing in 42 games all at left offensive tackle on head coach Kirk Ferentz’s University of Iowa Hawkeyes from 2017-20 — and being named a second-team all-American as a senior — Jackson was hoping — well actually, expecting — to be selected in the NFL draft last spring.",
    "They and a slew of other family and friends all inundated Jackson’s cellphone with congratulatory messages once the Rams beat San Francisco in the NFC championship game two Sunday ago — a game Jackson dressed for, and got in for five special-teams plays.",
    "Article content\nBe ready, mentally, in the event he dressed that week and a starter went down during the game — leaving Rams coaches no choice but to suddenly rush him into his first important, non-pre-season, non-garbage-time NFL action.",
    "A week later, on Christmas Day, starting left tackle Andrew Whitworth — the 40-year-old wonder — came down with the coronavirus, joining his ostensible LT backup, Joe Noteboom, on the reserve/COVID-19 list.",
    "“And I got my opportunity that day.”\nWith both Whitworth and Noteboom out, starting left guard David Edwards slid over to left tackle, and backup guard/centre Coleman Shelton filled in for Edwards at LG.",
    "Von Miller, Aaron Donald — they’ve got some (expert pass-rush moves) in their bags, for sure.”\nArticle content\nThe Rams expect their regular starting five O-linemen to play against the Bengals on Sunday.",
    "But Whitworth’s backup at left tackle, Noteboom, is rehabbing a strained pectoral muscle, Rams head coach Sean McVay said Wednesday, and might not be able to serve as OT backup insurance on the sideline.",
    "A small percentage of such rookie signees typically survive an NFL team’s cut-downs from 90-man training-camp roster to 53-man active roster, come the start of the regular season in early September.",
    "Until his biggest career break to date at Minnesota on Boxing Day, Jackson had been primarily understudying as active-roster understudy to starting Rams right tackle Rob Havenstein.",
    "Whitworth, watching in quarantine on TV back home, said a few days later: “Alaric is a guy that Rob Havenstein and I have poured into all year, and really think a lot of.",
    "But that dude is like a teacher, honestly.”\nGoing against arguably the best NFL defensive front all season in practices sure has helped him, too, Jackson said.",
    "It was a whole new program, organization.”\nJackson officially measured 6-foot-5½ late last winter, and weighed 321 pounds just a couple weeks before the draft.",
    "Article content\nOnly 46 players of the 53 on any NFL team’s active roster may dress for a game, and Jackson had to wait until Week 8 to get his first chance.",
    "You can have it automatically dropped into your email inbox on Wednesdays simply by signing up — for free — at https://torontosun.com/newsletters/\n@JohnKryk",
    "Reports said he also had several key blocks in the run game, as the Rams piled up 159 yards on the ground, their second most prolific output of the season.",
    "Article content\nA fellow backup on the Los Angeles Rams offensive line kept telling undrafted Canadian rookie Alaric Jackson, all season long, to be ready.",
    "Article content\nFirst, let’s rewind a bit, to explain why Jackson has had his hopes and emotions tugged all over the place over the past calendar year.",
    "Jackson said he won’t despair:\n“I’m definitely blessed, and I’m thankful for this moment.”\nJohn Kryk now writes a weekly newsletter on NFL matters.",
    "“I totally killed it,” said the rookie offensive tackle, who was born and raised in Windsor, Ont., before moving to Detroit for high school.",
    "The 23-year-old could find himself in the same situation again on Sunday, when the Rams face the Cincinnati Bengals in Super Bowl LVI.",
    "Jackson dressed in back-to-back weeks — in wins at Arizona and vs. Seattle — but getting in only for 10 combined special-teams plays.",
    "“To be this far along, in my rookie season, it’s amazing and crazy,” Jackson said this week in a phone interview from Los Angeles.",
    "Article content\n“One of my closest friends here, (backup right guard) Bobby Evans, always tells me to stay ready,” Jackson said.",
    "“If (Noteboom can’t play) we’ll go with Alaric Jackson.”\nJackson has plenty of family still back in the Windsor/Detroit area.",
    "Early in the second quarter, though, starting Rams centre Brian Allen went down with a knee injury and would not return.",
    "We think he can be a really good football player, so it was awesome for me to see him go out there and execute.",
    "The Rams, though, happily scooped him up immediately following the draft’s conclusion as a priority free agent.",
    "He took his first NFL regular-season snaps on offence (nine) late in that week’s win at Houston on Halloween.",
    "“It was a big relief for me because obviously I’m in the NFL, but I hadn’t really played in a real game yet.",
    "Jackson did not allow a sack in 52 snaps (74% of the Rams offensive plays on the day) against the Vikings.",
    "Specifically on the day after Christmas, early in a late-season matchup against the Vikings in Minnesota.",
    "So I went in there and killed it, and we won the game.”\nRight, 30-23 — to clinch an NFC playoff berth.",
    "Article content\nAnd that’s where he has been all season, which concludes Sunday in the Super Bowl.",
    "Come mid-to-late December, injuries plus a small outbreak of COVID-19 hit the Rams O-line unit.",
    "Article content\nIn the Rams’ case, that meant protecting quarterback Matthew Stafford.",
    "So am I. I’m just taking the opportunity to just take it in and enjoy it, honestly.",
    "“Because, to be real with you, I was for sure bummed out by not getting drafted.",
    "You would maybe think a guy of his stature wouldn’t be as helpful as he is.",
    "But Jackson, rather oddly, is listed by the Rams at 6-foot-4, 285 pounds.",
    "But I’m definitely blessed, and I’m thankful for what has happened since.",
    "“We’ll see, all the way up to (game day),” McVay told a pool reporter.",
    "This could be a one-in-a-lifetime kind of thing.”\nJackson wears No.",
    "Article content\nJackson was ready for the meaningful opportunity.",
    "I was nervous, honestly, because you don’t know what to expect.",
    "“They tell me things that I wouldn’t see from my perspective.",
    "You learn every day, and I’m developing right now.",
    "Both teams were fighting for their playoff lives.",
    "Lots of things that they’re helping me out with.",
    "You may well see him out there at some point.",
    "Andrew’s probably helped me out the most.",
    "“And I totally killed it,” Jackson said.",
    "Content is exclusive to that platform.",
    "Jackson dressed for the Vikings game.",
    "Some are coming to the big game.",
    "So of course, it happened.",
    "It’s just me being human.",
    "“It was rough at first.",
    "Just small details.",
    "“They’re so happy.",
    "But Jackson did.",
    "“I’m still raw.",
    "Technique, too.",
    "Didn’t happen.",
    "Honestly.",
    "If not?",
    "68."
  ]
}