{
  "id": 3041,
  "mediaId": 2707,
  "date": "2022-01-29",
  "headline": "Higbee goes from fourth-round hopeful to long-term fixture with Rams",
  "image": "https://www.ocregister.com/wp-content/uploads/2022/01/LDN-L-RAMS-1206-KB77.jpg?w=1024&h=712",
  "link": "https://www.ocregister.com/2022/01/29/higbee-goes-from-fourth-round-hopeful-to-long-term-fixture-with-rams/",
  "mediaOutlet": "The Orange County Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Whicker",
  "authorUrl": "https://www.ocregister.com/author/cfowlerscng-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "“That game in New Orleans was the loudest I’ve ever played in.”\nIf the Rams break their Six-Game Losing Streak in the San Francisco series and then win the Super Bowl two weeks hence, Higbee will be the first WKU alum with a championship ring.",
    "All had experience in Washington with the elder Shanahan, who won two Super Bowls in Denver with linemen running, backs attacking the edges, receivers blocking, lots of folks in motion, and tight ends beating coverages.",
    "Other than the quarterback, we probably have to know more stuff than anybody on offense.”\nMark Andrews, Travis Kelce and Zach Ertz all caught 90 balls or more from the tight end spot.",
    "The last time Higbee was in an NFC championship game, he took a touchdown pass from Jared Goff, and put a finger to his lips to shush the New Orleans crowd.",
    "It’s not new, but it’s proliferating because the Shanahan School of offense doesn’t feature as many throws to running backs as the West Coast offenses do.",
    "Higbee’s ankle kept him out of the Senior Bowl, and he was arrested 18 days before the draft for attacking a student from Saudi Arabia, outside a bar.",
    "You have to know the protections, know the defensive fronts, know the pass concepts that we’re doing and then know everything the secondary is doing.",
    "What I remember most is coming back from practice at UC Irvine and it was 98 degrees on the thermostat, and they didn’t have the AC working yet.",
    "Because he can catch, run and anticipate, Higbee has made a nice living against linebackers who are slower and safeties who are smaller.",
    "In the Super Bowl season of 2018 he caught 24, splitting time with Gerald Everett, but two-thirds of those went for first downs.",
    "Now he has a second NFC championship game, watched by tens of millions, including some who were a little bit faster and bigger.",
    "That year Higbee “came in for power, when it was fourth and one on the goal line” but had no assurances of more as a rookie.",
    "Mike Shanahan’s son Kyle coaches the 49ers, Sean McVay the Rams, Zac Taylor the Bengals and Matt LaFleur the Packers.",
    "He learned a lot of diverse football from three different head coaches and offensive coordinator Tyson Helton.",
    "Among that draft class, Higbee ranks eighth in catches, seventh in receiving yards and seventh in touchdowns.",
    "and Higbee, Andrew Whitworth, Rob Havenstein and the injured Robert Woods are the only holdovers on offense.",
    "The Rams eventually became the first team, out of 10, to lose a coin flip and win an overtime playoff game.",
    "It’s kinda tough sleeping on those sheets.”\nThe Rams took Higbee with the 110th pick in the 2016 draft.",
    "It’s startling to notice the extent of the Rams’ makeover since that Super Bowl loss to New England.",
    "He was found guilty but avoided jail through community service and restitution to the victim.",
    "The only receiver with better stats who was drafted behind him is Kansas City’s Tyreek Hill.",
    "“I played for Willie Taggart, Bobby Petrino and Jeff Brohm in four years,” Higbee said.",
    "“The last two guys, their offenses were similar but their terminology was different.",
    "Tyler Higbee came from Tarpon Springs, Fla. and developed at Western Kentucky.",
    "“I was always the guy who was a little too small, a little too slow,” he said.",
    "Brian Allen, Ogbonnia Okoronkwo and the injured Johnny Mundt were there, too.",
    "Only Donald was on that prodigal team that returned from St. Louis in 2016.",
    "But he also finds himself in the Roaring 20s, the jazz age of tight ends.",
    "I had to learn a lot of things, different nuances, different details.",
    "He spent all those years chasing a game he feared he’d never catch.",
    "Higbee is signed for the next two seasons, at $6.25 million per.",
    "It’s like the old joke about the two guys who encounter a bear.",
    "One of them worries that they aren’t fast enough to escape.",
    "“It was different, coming across the country,” Higbee said.",
    "The other says he doesn’t have to be faster than the bear.",
    "The Rams let Everett become a free agent and kept Higbee.",
    "Aaron Donald is the only surviving defensive starter.",
    "Higbee caught 61, which ranked 10th among TEs.",
    "“I’m glad this one is at home,” Higbee said.",
    "“It’s all about creating those matchups.",
    "Higbee has 234 catches in six years.",
    "“I hadn’t been past Mississippi.",
    "There has been no trouble since.",
    "That helped me coming into this.",
    "“Just faster than you,” he said.",
    "Andrews, in Baltimore, had 107.",
    "The NFL took care of that.",
    "It was an act of faith.",
    "It’s a tough position."
  ]
}