{
  "id": 3353,
  "mediaId": 2632,
  "date": "2022-01-31",
  "headline": "Everything to Know About NFL Free Agency and Top Available Players",
  "image": "https://media.nbcbayarea.com/2022/03/lr-split.jpg?quality=85&strip=all&fit=1200%2C675",
  "link": "https://www.nbcbayarea.com/news/sports/nfl-free-agency-tracker-start-date-cap-space-top-available-players/2795537/",
  "mediaOutlet": "nbcbayarea.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "ET, here’s a look at the 10 teams with the most top-51 salary cap space (per Spotrac):\nCarolina Panthers: $50,439,040\nNew Orleans Saints: $26,412,758\nIndianapolis Colts: $22,044,847\nMiami Dolphins: $21,820,337\nCleveland Browns: $21,029,751\nHouston Texans: $20,912,612\nLos Angeles Chargers: $18,827,843\nDetroit Lions: $18,308,648\nCincinnati Bengals: $18,147,266\nPhiladelphia Eagles: $15,825,547\nPlenty of teams aren’t in a good position to begin the new league year.",
    "Kyle Van Noy, Patriots\nJamie Collins, Patriots\nKwon Alexander, Saints\nBobby Wagner, Seahawks: Wagner inked a five-year, $50 million deal with the Rams\nRashaan Evans, Titans: Evans reportedly reached an agreement with the Falcons on a one-year deal\nJon Bostic, Commanders\nCornerbacks\nLevi Wallace, Bills: Wallace is joining the Steelers on a two-year deal worth up to $8 million.",
    "ET:\nNew England Patriots: $-334,097\nSan Francisco 49ers: $1,716,895\nTennessee Titans: $2,190,722\nBuffalo Bills: $3,698,532\nAtlanta Falcons: $4,477,473\nArizona Cardinals: $6,582,562\nLas Vegas Raiders: $6,596,736\nNew York Giants: 6,754,475\nBaltimore Ravens: $7,048,465\nJacksonville Jaguars: $7,413,220\nWho are the best NFL free agents for 2022?",
    "Rob Gronkowski, Buccaneers\nAnthony Firkser, Titans\nRicky Seals-Jones, Commanders: Seals-Jones signed a one-year deal worth $1,187,500 deal with the Giants\nOffensive tackles\nRiley Reiff, Bengals\nEric Fisher, Colts\nCam Robinson, Jaguars: The Jaguars used the franchise tag on Robinson for one year, $16.662 million.",
    "Ndamukong Suh, Buccaneers\nArden Key, 49ers: Key reportedly signed a one-year, $7 million deal with the Jaguars\nLinebackers\nFoyesade Oluokun, Falcons: The former Falcon reportedly is headed to Jacksonville on a three-year, $45 million deal with $28 million guaranteed.",
    "Melvin Gordon, Broncos\nDavid Johnson, Texans\nMarlon Mack, Colts\nDarrel Williams, Chiefs\nSony Michel, Rams\nBrandon Bolden, Patriots: Bolden reportedly is joining his former offensive coordinator, Josh McDaniels, in Las Vegas with the Raiders.",
    "Everything you need to know before 2022 NFL free agency originally appeared on NBC Sports Chicago\nThe offseason can be nearly as exciting as the on-field action, with trades, free agency and the draft consuming the spring and summer months.",
    "Patrick Peterson, Vikings: Peterson returned to the Vikings on a one-year, $4 million deal\nJ.C. Jackson, Patriots: Jackson reportedly agreed to a five-year, $82.5 million deal with the Chargers that invoices $40 million guaranteed.",
    "Here’s a position-by-position look at the best players set to hit free agency:\nQuarterbacks\nJameis Winston, Saints: Winston reportedly re-signed a two-year deal worth $28 million, including $21 million guaranteed with the Saints.",
    "Dante Fowler Jr., Falcons\nJustin Houston, Ravens\nPernell McPhee, Ravens\nJerry Hughes, Bills\nHasson Reddick, Panthers: Reddick reportedly is heading to Philadelphia on a three-year, $45 million deal with $30 million guaranteed.",
    "Rodney McLeod, Eagles\nAnthony Harris, Eagles: Harris returned to the Eagles on a one-year deal worth $2.5 million\nQuandre Diggs, Seahawks: Diggs and the Seahawks reportedly agreed on a three-year, $40 million deal.",
    "Ryan Kerrigan, Eagles\nRasheem Green, Seahawks\nJason Pierre-Paul, Buccaneers\nHarold Landry, Titans: Landry reportedly plans to re-sign with the Titans for five years, $87.5 million with $52.5 million guaranteed.",
    "Tom Brady retired (and then unretired), Aaron Rodgers re-signed with the Packers, Russell Wilson was traded from the Seahawks to the Broncos and Carson Wentz was traded from the Colts to the Commanders.",
    "Adam Humphries, Commanders\nTight ends\nZach Ertz, Cardinals: After being traded from Philly to Arizona midseason, Ertz reportedly is sticking with the Cardinals on a three-year, $31.65 million contract.",
    "James Conner, Cardinals: Cardinals reportedly plan to re-sign Conner on a three-year, $21 million deal that could grow to a maximum of $25.5 million and includes $13.5 million fully guaranteed.",
    "Sheldon Richardson, Vikings\nDanny Shelton, Giants\nFolorunso Fatukasi, Jets: Fatukasi reportedly agreed to a three-year, $30 million deal with the Jaguars that includes $20 million guaranteed.",
    "Larry Ogunjobi, Bengals: Ogunjobi initially agreed to join the Bears on a three-year, $40.5 million deal with $26.35 million guaranteed but failed his physical and remains a free agent.",
    "Robert Tonyan, Packers: Tonyan returned to Green Bay on a one-year deal worth $3.75 million\nMo Alie-Cox, Colts: The Colts reportedly re-signed Cox on a three-year, $18 million deal.",
    "Defensive linemen\nBrandon Williams, Ravens\nCalais Campbell, Ravens: Campbell is reportedly staying in Baltimore on a two-year deal worth $12.5 million that can reach $16.5 million.",
    "Marquez Valdes-Scantling, Packers: The Kansas City Chiefs are reportedly signing Valdes-Scantling to a three-year, $30 million deal that can go up to $36 million with incentives.",
    "Kareem Jackson, Broncos\nJustin Reid, Texans: Reid reportedly will go from Houston to Kansas City after agreeing to a three-year, $31.5 million deal with $20 million guaranteed.",
    "Antonio Brown, Buccaneers\nChris Godwin, Buccaneers: Godwin reportedly agreed to a three-year, $60 million deal to return to the Bucs after they used the franchise tag on him.",
    "Jeff Wilson, 49ers: Wilson returned to the Bay on a one-year deal worth $1.085 million\nRaheem Mostert, 49ers: Mostert reportedly is headed to the Dolphins on a one-year deal.",
    "Bryce Callahan, Broncos\nKyle Fuller, Broncos\nRasul Douglas, Packers: The Packers re-signed Douglas to a three-year, $21 million deal that could be worth up to $25.5 million.",
    "How many of them actually reach the open market remains to be seen, as teams can use the franchise tag or negotiate a new deal before the legal tampering period in March.",
    "Xavier Rhodes, Colts\nCharvarius Ward, Chiefs: The former Chief reportedly agreed to a three-year, $42 million deal with the 49ers that includes $26.7 million guaranteed.",
    "Wright, Raiders\nDont’a Hightower, Patriots\nJa’Whaun Bentley, Patriots: The Patriots reportedly will bring back Bentley on a two-year deal worth a maximum of $9 million.",
    "Ryan Fitzpatrick, Commanders\nCam Newton, Panthers\nMarcus Mariota, Raiders: The Falcons signed Mariota to a two-year, $18.75 million deal with $6.75 million guaranteed.",
    "Davante Adams, Packers: Adams reportedly agreed to a five-year, $141.25 million deal with the Raiders after the Packers traded him for a first- and second-round pick.",
    "Alex Okafor, Chiefs\nMelvin Ingram, Chiefs\nUchenna Nwosu, Chargers: Nwosu agreed to a two-year, $20 million deal, including $10.5 million guaranteed with the Seahawks.",
    "Linval Joseph, Chargers\nSebastian Joseph-Day, Rams: Joseph-Day reportedly agreed with the Chargers on a three-year, $24 million contract with $15 million guaranteed.",
    "Marcus Williams, Saints: Williams reportedly is headed to Baltimore on a five-year deal worth $70 million including $37 million guaranteed and $31 million next year.",
    "Jadeveon Clowney, Browns\nTakkarist McKinley, Browns\nRandy Gregory, Cowboys: Gregory reportedly signed with the Denver Broncos on a five-year deal worth $70 million.",
    "Alec Ogletree, Bears\nKeanu Neal, Cowboys\nLeighton Vander Esch, Cowboys: Vander Esch is returning to the Cowboys on a one-year deal with a max value of $3 million.",
    "Evan Engram, Giants: Engram reportedly agreed on a one-year, fully-guaranteed $9 million deal that could go up to $10 million with incentives with the Jaguars.",
    "Chris Harris Jr., Chargers\nDarious Williams, Rams: Williams and the Jaguars reportedly agreed on a three-year, $30 million deal with $18 million guaranteed.",
    "Giovani Bernard, Buccaneers\nLeonard Fournette, Buccaneers: Fournette re-signed with the Bucs on a three-year, $21 million deal with $12 million guaranteed.",
    "Brandon Scherff, Commanders: Scherff reportedly is headed south to the Jaguars on a three-year deal worth up to $52.5 million with $30 million guaranteed.",
    "Marcus Maye, Jets: The Saints are replacing Williams with Maye, signing the former Jet to a three-year, $28.5 million deal with $15 million guaranteed.",
    "Running backs\nChase Edmonds, Cardinals: Edmonds reportedly is headed to Miami on a two-year, $12.6 million deal that includes $6.1 million guaranteed.",
    "Here’s a full look at NFL free agency, including information on the salary cap and some of the top available players:\nWhen does NFL free agency start?",
    "Tyrann Mathieu, Chiefs\nDevin McCourty, Patriots: McCourty is back for at least one more year with the Pats, returning for a $9 million deal in 2022.",
    "Brian Hoyer, Patriots: Hoyer reportedly agreed with the Patriots on a two-year, $4 million deal that includes $3 million guaranteed and incentives.",
    "Connor Williams, Cowboys: Williams reportedly agreed to a two-year, $14 million deal that includes $7.5 million fully guaranteed with the Dolphins.",
    "Braxton Berrios, Jets: New York reportedly agreed to bring Berrios back on a two-year, $12 million deal that includes $7 million fully guaranteed.",
    "Trai Turner, Steelers\nLaken Tomlinson, 49ers: Tomlinson agreed to a three-year deal worth up to $41.2 million with the Jets, according to reports.",
    "Allen Robinson, Bears: Robinson reportedly agreed to a three-year, $46.5 million deal that includes $30.7 million fully guaranteed with the Rams.",
    "Cedrick Wilson, Cowboys: Wilson reportedly agreed to a three-year, $22.8 million deal that includes $12.75 million guaranteed with the Dolphins.",
    "Richard Sherman, Buccaneers\nK’Waun Williams, 49ers: Williams joined the Broncos on a two-year, $5.2 million deal with $2.5 million guaranteed.",
    "Kenny Young, Broncos\nDe’Vondre Campbell, Saints: De'Vondre Campbell and the Packers reportedly agreed on a five-year deal worth $50 million.",
    "Terron Armstead, Saints: Armstead has reportedly reached an agreement on a five-year deal with the Miami Dolphins worth up to $87.5 million.",
    "Jordan Howard, Eagles\nAlex Collins, Seahawks\nRashaad Penny, Seahawks: Penny is returning to Seattle on a one-year deal worth $5.75 million.",
    "EDGE rushers\nChandler Jones, Cardinals: The Raiders reportedly agreed to a three-year deal worth $52.5 million with $34 million guaranteed.",
    "Michael Schofield, Chargers\nAustin Corbett, Rams: Corbett reportedly will sign with the Panthers on a three-year, $29.25 million contract.",
    "Jabrill Peppers, Giants: Peppers will rejoin his former head coach Joe Judge in New England, signing a one-year deal with the Patriots.",
    "Stephon Gilmore, Panthers: Gilmore reportedly agreed to a two-year, $23 million deal with the Colts, including $14 million guaranteed.",
    "Will Fuller, Dolphins\nTre’Quan Smith, Saints: Smith is staying in New Orleans on a two-year contract with a base value of $6 million.",
    "Al Woods, Seahawks: Woods reportedly will return to Seattle on a two-year deal worth up to $9 million with $4.75 million guaranteed.",
    "Jamison Crowder, Jets\nJuJu Smith-Schuster, Steelers: The Kansas City Chiefs added Smith-Schuster to a one-year, $3.25 million deal.",
    "Chark, Jaguars: Chark reportedly will join the Lions on a one-year deal worth up to $12 million with $10 million fully guaranteed.",
    "Byron Pringle, Chiefs: Pringle reportedly agreed to a one-year deal worth $4 million guaranteed and $2 million more in incentives.",
    "Tyrod Taylor, Texans: Taylor reportedly agreed to a two-year, $11 million deal, including $8.5 million guaranteed with the Giants.",
    "Billy Price, Giants\nEthan Pocic, Seahawks\nRyan Jensen, Buccaneers: Jensen is staying in Tampa on a three-year, $39 million deal.",
    "Emmanuel Ogbah, Dolphins: Ogbah is reportedly returning to Miami on a four-year, $65 million deal with $32 million guaranteed.",
    "Sports\nTeams were able to begin speaking with free agents two days before free agency began during the legal tampering period.",
    "ET, clubs were permitted to contact and negotiate with players who were set to become unrestricted free agents two days later.",
    "McKissic, Commanders: McKissic reportedly agreed to a two-year, $7 million deal with upside to $8 million with the Commanders.",
    "Andrew Norwell, Jaguars: Norwell signed with the Commanders on a two-year deal worth $10 million with $4.7 million guaranteed.",
    "Demarcus Robinson, Chiefs: Robinson signed with the Raiders on a one-year minimum deal worth $1.137 million fully guaranteed.",
    "Christian Kirksey, Texans: Kirksey is returning to Houston, securing a two-year, $10 million deal with $4 million guaranteed.",
    "Everson Griffen, Vikings\nDerek Barnett, Eagles: The Philadelphia Eagles will reportedly re-sign Barnett to a two-year deal.",
    "Tashaun Gipson, Bears\nJessie Bates III, Bengals: The Bengals used the franchise tag on Bates for one year, $12.911 million.",
    "Mitchell Trubisky, Bills: Trubisky reportedly agreed to a two-year deal to become the Steelers’ new starting quarterback.",
    "Alex Cappa, Buccaneers: Cappa is leaving Tom Brady for Joe Burrow, reportedly agreeing to a four-year, $40 million deal.",
    "Odell Beckham Jr., Rams\nZay Jones, Raiders: Jones reportedly agreed to a three-year, $30 million deal with the Jaguars.",
    "Hill, Bengals: Hill reportedly agreed to a three-year, $30 million with $15 million in year one deal with the Bengals.",
    "Emmanuel Sanders, Bills\nIsaiah McKenzie, Bills: McKenzie reportedly agreed to a two-year deal to remain with Buffalo.",
    "Jacoby Brissett, Dolphins: Brissett is joining the Browns on a one-year contract to serve as Deshaun Watson’s backup.",
    "Teddy Bridgewater, Broncos: Bridgewater reportedly agreed to a one-year deal to be the Dolphins’ backup quarterback.",
    "Howard, Buccaneers: Howard reportedly agreed to a one-year, $3.5 million deal worth up to $5 million with the Bills.",
    "Jones, 49ers: Jones and the Broncos reportedly agreed to a three-year, $30 million deal with $20 million guaranteed.",
    "Carlton Davis, Buccaneers: Davis reportedly agreed to re-sign with the Buccaneers on a three-year, $45 million deal.",
    "Malik Jackson, Browns\nJarran Reed, Chiefs: Reed and the Packers agreed to a one-year deal worth up to $4.5 million.",
    "Joseph Noteboom, Rams: Noteboom reportedly agreed to re-sign with Los Angeles on a three-year, $40 million deal.",
    "Mike Williams, Chargers: Williams reportedly agreed to a deal with the Chargers for three years and $60 million.",
    "That excitement, of course, has only been heightened in 2022 with several high-profile quarterbacks in the news.",
    "Christian Kirk, Cardinals: Kirk reportedly agreed to a four-year deal with the Jaguars worth up to $84 million.",
    "Devonta Freeman, Ravens\nDamien Williams, Bears: Williams reportedly agreed to a one-year deal with the Falcons.",
    "Jordan Whitehead, Buccaneers: Whitehead reportedly agreed to a two-year deal worth $14.5 million with the Jets.",
    "D’Onta Foreman, Titans: Foreman signed a one-year deal with the Panthers after playing for the Titans in 2021.",
    "Michael Gallup, Cowboys: Gallup reportedly agreed to a deal with the Cowboys for five years and $62.5 million.",
    "Jared Cook, Chargers\nMike Gesicki, Dolphins: The Dolphins placed the $10.93 million franchise tag on Gesicki.",
    "Duane Brown, Seahawks\nOffensive guards\nMax Garcia, Cardinals: Garcia signed a one-year deal with the Giants.",
    "Between bonuses, incentives and void years, there are plenty of loopholes that teams use to clear cap space.",
    "Players and teams were able to agree to deals, but they couldn’t be signed until the new league year began.",
    "Centers\nBradley Bozeman, Ravens: Bozeman signed a one-year deal with the Panthers worth up to $2.8 million.",
    "Matt Paradis, Panthers\nAustin Blythe, Chiefs: The Seahawks added Blythe on a one-year, $4 million contract.",
    "Sammy Watkins, Ravens: Watkins signed with the Packers for a reported one-year deal worth up to $4 million.",
    "Jayron Kearse, Cowboys: Kearse re-signed with Dallas for two years, $10 million with $5 million guaranteed.",
    "Ben Jones, Titans: Jones reportedly agreed to re-sign with the Titans on a two-year deal worth $14 million.",
    "James White, Patriots: White reportedly agreed to a two-year, $2.5 million deal to return to the Patriots.",
    "Trent Brown, Patriots: The Pats retained Brown on a two-year, $13 million deal with $4 million guaranteed.",
    "Kamu Grugier-Hill, Texans: Grugier-Hill re-signed with Houston on a one-year deal worth up to $4 million.",
    "Cordarrelle Patterson, Falcons: Patterson will return to Atlanta on a two-year deal worth $10.5 million.",
    "Andrew Wylie, Chiefs: Wylie is returning to the Chiefs on a one-year deal with $2.5 million guaranteed.",
    "James Daniels, Bears: Daniels reportedly agrees to a three-year, $26.5 million deal with the Steelers.",
    "Sidney Jones, Seahawks: Jones reportedly will return to Seattle on a one-year deal worth $3.6 million.",
    "Bobby McCain, Commanders: McCain reportedly re-signed with Washington on a two-year, $11 million deal.",
    "Justin Coleman, Dolphins: Coleman, a former Seahawk, rejoined Seattle on a one-year minimum contract.",
    "Dalton Schultz, Cowboys: The Cowboys used the franchise tag on Schultz for one year, $10.93 million.",
    "Gerald Everett, Seahawks: Everett reportedly signed a two-year, $12 million deal with the Chargers.",
    "Will Dissly, Seahawks: The Seahawks and Dissly reportedly agreed to a three-year, $24 million deal.",
    "Brian Allen, Rams: Allen reportedly agreed to return to the Rams on a three-year, $24 million deal.",
    "Ted Karras, Patriots: The former Patriot agreed to a three-year, $18 million deal with the Bengals.",
    "Casey Hayward, Raiders: Hayward reportedly agreed to a two-year, $11 million deal with the Falcons.",
    "Von Miller, Rams: Von Miller reportedly agreed to a six-year deal for $120 million with the Bills.",
    "Maxx Williams, Cardinals: The Cardinals reportedly are bringing back Williams on a one-year deal.",
    "Orlando Brown, Chiefs: The Chiefs used the franchise tag on Brown for one year, $16.662 million.",
    "Andy Dalton, Bears: Dalton signed a one-year deal with the Saints to play behind Jameis Winston.",
    "Gerald McCoy, Raiders\nSolomon Thomas, Raiders: Thomas reportedly agreed to a deal with the Jets.",
    "Kyzir White, Chargers: The Eagles signed White to a one-year contract worth up to $5 million.",
    "David Njoku, Browns: The Browns used the franchise tag on Njoku for one year, $10.93 million.",
    "Ronald Jones, Buccaneers: Jones joined the Chiefs on a one-year deal worth up to $5 million.",
    "Uzomah, Bengals: Uzomah reportedly agreed to a three-year, $24 million deal with the Jets.",
    "In the first month following the Super Bowl, four major quarterback dominos have fallen.",
    "Safeties\nDuron Harmon, Falcons: Harmon reportedly agreed to a contract with the Raiders.",
    "Here are the 10 teams with the least amount of top-51 cap space as of April 4 at 7 p.m.",
    "Tyler Conklin, Vikings: The Jets signed Conklin to a three-year, $21 million contract.",
    "Morgan Moses, Jets: The Ravens signed Moses to a three-year, $15 million contract.",
    "It will also include an incentive package that can result in another $7.5 million.",
    "Trevor Siemian, Saints: Siemian signed a two-year, $4 million deal with the Bears.",
    "Reed, Seahawks: Reed signed a three-year, $33 million deal with the New York Jets.",
    "Will Hernandez, Giants: Hernandez signed a one-year deal with the Cardinals.",
    "Ike Boettger, Bills: Boettger is staying in Buffalo on a one-year contract.",
    "Free agency in the NFL began immediately when the new league year began.",
    "Unlike the NBA, football players do not have fully guaranteed salaries.",
    "Hayden Hurst, Ravens: Hurst agreed to a one-year deal with the Bengals.",
    "Like every year, there are a number of difference-making free agents.",
    "Green, Cardinals: Green is staying in Arizona on a one-year deal.",
    "This year, that fell on March 16, 2022, at 4 p.m.",
    "Beginning on Monday, March 14, 2022, at 12 p.m.",
    "The deal includes over $51 million guaranteed.",
    "The salary cap is a tricky thing in the NFL.",
    "Which NFL teams have the most cap space?",
    "Danny Amendola, Texans\nT.Y.",
    "Jimmy Graham, Bears\nC.J.",
    "Joe Haden, Steelers\nD.J.",
    "Akiem Hicks, Bears\nB.J.",
    "As of April 4 at 7 p.m.",
    "Wide receivers\nA.J.",
    "Hilton, Colts\nD.J.",
    "J.D.",
    "O.J.",
    "D.J.",
    "K.J.",
    "ET."
  ]
}