{
  "id": 3741,
  "mediaId": 8469,
  "date": "2022-01-24",
  "headline": "Rams on brink of Super Bowl despite struggling to close wins",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2022/01/128133282_web1_128133282-9679be99d94941eabce18e95ef089e6d.jpg.webp",
  "link": "https://www.timesleader.com/sports/1536381/rams-on-brink-of-super-bowl-despite-struggling-to-close-wins",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Beacham AP Sports Writer",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“It’s just we have to go in there and play our best game.”\nThe remainder of the Rams’ path to a championship does not leave Inglewood: They’ll become the first team to host a conference title game in that year’s Super Bowl stadium when the 49ers visit on Sunday, and the big game is Feb. 13.",
    "Their biggest remaining issue is closing out wins: They’ve allowed 18.7 points per game in the second halves of their past three games, with the offense’s turnovers and the defense’s slippage playing roughly equivalent roles.",
    "That’s what a great team does.”\nBut two weeks before that, the Rams paid for their profligacy in yet another loss to the San Francisco 49ers, who just happen to be their opponent in the NFC championship game this weekend.",
    "The Rams (14-5) got away with it in the divisional playoff round in Tampa Bay, thanks to Matthew Stafford and Cooper Kupp impressively setting up Matt Gay’s winning field goal as time expired on their 30-27 victory.",
    "Their four giveaways in Tampa are a worrying aberration, but no sign of a significant trend yet, even though Cam Akers and Kupp both lost the ball at crucial moments and helped to give away that big early lead.",
    "Los Angeles hopes the drama of its experience in Tampa Bay and against the Niners earlier this month will be motivation to avoid all that excitement in the Rams’ second conference title game in four years.",
    "After a near-perfect performance in the wild-card round against Arizona, Stafford put on a clinic in clutch football in Tampa highlighted by his majestic 44-yard completion to Kupp in the waning seconds.",
    "Safety Nick Scott came up with a huge interception, but the Rams’ pass rush deserves ample credit for Brady’s 24 incompletions — and Jimmy Garoppolo is likely to be much harder to pressure than Brady.",
    "“All the adversity and all of the things that we did or, give them credit, they forced some of those plays to get back in the game, (but) I never sensed any sort of panic,” coach Sean McVay said.",
    "The Rams are on the brink of a Super Bowl berth in their home stadium because they’ve won seven of their past eight games with a comprehensively strong offense and a rapidly improving defense.",
    "Noteboom might have played his way out of the Rams’ price range as a free agent this spring after he filled in for injured Andrew Whitworth and gave a dominant performance at left tackle.",
    "The Rams’ season comes down to a showdown with a division rival that has beaten them six straight times and seven of 10 in their head coaches’ concurrent careers.",
    "“If we play our best game, we feel like we can go in there and win any game we play,” said left tackle Joseph Noteboom, who was excellent against the Buccaneers.",
    "He was short on a 47-yard field-goal attempt that left him puzzled, but he attributed it to a particularly gusty crosswind at exactly the wrong time.",
    "The Rams were up 27-3 with four minutes left in the third quarter, and they were up 27-13 and had the ball with four minutes left in the fourth.",
    "Tom Brady passed for 329 yards, with 135 yards of that coming on nine completions to receivers guarded by cornerback Darious Williams.",
    "What needs help\nThe Rams were not a fumble-prone team in 2021, with their five lost fumbles tied for the second fewest in the NFL.",
    "Ball security — and synchronization between Stafford and center Brian Allen — will be an emphasis in practice yet again.",
    "Stafford has completed 74.5% of his passes in the postseason for 568 yards and four touchdowns without an interception.",
    "Noteboom and right tackle Rob Havenstein allowed one pressure apiece while blocking Jason Pierre-Paul and Shaq Barrett.",
    "Key number\n1 — The number of teams in NFL history to win a game after losing four fumbles and blowing a 20-point lead.",
    "… Gay said he didn’t injure himself during pregame warmups, contrary to a suggestion on the NBC television broadcast.",
    "What’s working\nStafford is the upgrade that the Rams sought when they traded Jared Goff to get him nearly a year ago.",
    "If the Rams can figure out how to play 60 minutes of solid ball, they could have a chance against the 49ers.",
    "… Whitworth (knee) and S Taylor Rapp (concussion) are on track to play this week, McVay said.",
    "If Whitworth isn’t ready to return from his knee injury Sunday, the Rams won’t be worried.",
    "LOS ANGELES — For the third straight week, the Los Angeles Rams took a huge early lead.",
    "… Rookie LB Ernest Jones has a chance to return from injury this week, McVay said.",
    "Stock down\nThe Rams’ depleted secondary continues to hang on by its fingernails.",
    "For the second time in those three weeks, they subsequently gave it all away.",
    "Next steps\nBreaking the hex held by the Niners and Kyle Shanahan over McVay.",
    "Injured\nNoteboom injured his pectoral muscle in the Rams’ final drive.",
    "His passer rating is 131.5, nearly even with Patrick Mahomes’ 131.7.",
    "“I think there was some frustration, which was understandable.",
    "Subscribers enjoy a distraction-free reading experience.",
    "Stock up\nThe Rams’ offensive tackles were outstanding.",
    "But I thought the guys just kept playing.",
    "Click here to subscribe today or Login.",
    "Jones injured his ankle in Week 16.",
    "He will be monitored this week.",
    "They kept battling.",
    "Tired of ads?"
  ]
}