{
  "id": 4081,
  "mediaId": 2679,
  "date": "2022-01-27",
  "headline": "NFC Matchup: Old West rivals meet for Super Bowl berth",
  "image": "",
  "link": "https://www.seattletimes.com/sports/nfc-matchup-old-west-rivals-meet-for-super-bowl-berth/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "BARRY WILNER",
  "authorUrl": "https://www.seattletimes.com/author/barry-wilner/",
  "termIds": [
    0
  ],
  "sentences": [
    "Kupp, another unanimous All-Pro, pulled off the hat trick of leading the NFL in receptions, yards and touchdown catches; made the biggest play last week after Tampa Bay stormed back to nearly steal the game; and has a unique connection with QB Matthew Stafford (9).",
    "All-Pro Trent Williams (71), dealing with ankle issues, is the best left tackle in the game, though the keys could be center Alex Mack (50) and guards Laken Tomlinson (75) and Daniel Brunskill (60), who get the pleasure of dealing with Donald all day.",
    "Odell Beckham Jr. (3), Van Jefferson (12) and TE Tyler Higbee (89) can’t be given minimal attention by safeties Jaquiski Tartt (3) and Jimmie Ward (1), CBs K’Waun Williams (24) and, if healthy, Ambry Thomas (20).",
    "Samuel will test everyone on LA’s defense, from fellow All-Pro Jalen Ramsey (5) at cornerback, yet another All-Pro — unanimous, no less — DT Aaron Donald (99) — or some of the other studs on that unit.",
    "The 40-year-old placekicker made two field goals, including a 45-yarder in the snow as time expired to beat Green Bay, making him 20 for 20 in his career on field-goal attempts in the playoffs.",
    "And they must avoid the likes of DEs Nick Bosa (97) and Samson Ebukam (56), DT Arik Armstead (91), plus standout linebacker Fred Warner (54), who has been battling a balky ankle.",
    "That said, the Rams are playing at home — SoFi Stadium will stage the Super Bowl, and the five-plus decade run of teams not hosting the big game ended in Tampa last year.",
    "Until Sunday, only one of all those confrontations was in the postseason — the Niners won that one, too, 30-3 in 1989 on the way to the most lopsided Super Bowl victory.",
    "Advertising\n Skip AdSkip AdSkip Ad\nNiners TE George Kittle (85) hasn’t been his usual brilliant self, but LA is weak at safety and the LBs don’t do much in coverage.",
    "Most Read Sports Stories\nLos Angeles added stars in Stafford, Miller and Beckham with one thing in mind: returning to the Super Bowl the Rams lost three years back.",
    "DeMeco Ryans is much more a newbie to the position in San Francisco, but his unit has been stellar for all but one period against Dallas in these playoffs.",
    "Each team comes off last-second victories on field goals, the Niners on the Lambeau Field tundra, the Rams in balmy Tampa against Tom Brady and the Bucs.",
    "A true flex player, for all your fantasy gurus, the All-Pro receiver turned running back on occasion has become as dynamic as any NFL player.",
    "But the Niners have minimized him this season: Donald has only three pressures and zero sacks in the two games during the regular season.",
    "Gay is no slouch, though, and the way three of last weekend’s four games came down to last-season field goals, his role could be vital.",
    "The Rams could have a difficult time protecting the revitalized Stafford if LT Andrew Whitworth (77) remains sidelined by knee issues.",
    "INTANGIBLES:\nSan Francisco’s mastery of its longtime rival has to raise the confidence level of the 49ers, while ticking off the Rams.",
    "Advertising\n Skip AdSkip AdSkip Ad\nLA’s Raheem Morris is a respected defensive coordinator in the mix for a second head coaching job.",
    "Not to be overlooked is how the 49ers rallied to beat the Rams in the season finale, which SF needed to qualify for the playoffs.",
    "And the Niners, with many of the same players still on hand, lost their chance for the NFL title two years ago to Kansas City.",
    "WHEN THE RAMS HAVE THE BALL:\nAs Samuel should be the focal point for San Francisco, so too must WR Cooper Kupp (10) for LA.",
    "___\nMore AP NFL: https://apnews.com/hub/nfl and https://apnews.com/hub/pro-32 and https://twitter.com/AP_NFL\n BARRY WILNER",
    "Here’s how the 49ers and Rams match up:\nWHEN THE 49ERS HAVE THE BALL:\nJust give it to Deebo Samuel (19) in some manner.",
    "He also must feed the ball often to RB Elijah Mitchell (25), a real find, and keep versatile FB Kyle Juszczyk involved.",
    "Where both have struggled is late in games — see Rams at Bucs last weekend, 49ers at Cowboys in the wild-card round.",
    "But the Rams have another potential offense wrecker in LB Leonard Floyd (54), plus the revitalized Von Miller (40).",
    "QB Jimmy Garoppolo (10) needs to avoid forcing passes; he tends to be good, make that bad, for one turnover a game.",
    "The 49ers have owned the Rams in the past six meetings, and have a 75-67-3 mark against their California rivals.",
    "Now, San Francisco goes for a three-game sweep of Los Angeles, though the Rams will be at home and favored.",
    "P Johnny Hekker (6) has been one of the league’s best punters for a decade, also is a threat on fake punts.",
    "COACHING:\nKyle Shanahan simply doesn’t lose to the Rams, who have dropped the past six games to the Niners.",
    "They’re aggressive to a fault, highly popular with their players, and have a deep trust in their schemes.",
    "Advertising\n Skip Ad\nSPECIAL TEAMS:\nRobbie Gould (9) has been spectacular in his, uh, Goulden years.",
    "They know one another so well their coaches probably could swap sides and be comfortable.",
    "His range doesn’t match that of the Rams’ Matt Gay (8), but Gould is extremely reliable.",
    "The first four, though, came without Stafford, an immeasurable upgrade from Jared Goff.",
    "Shanahan and Sean McVay are leaders of the youth wave among offense-minded coaches.",
    "___\nAP Pro Football Writer Josh Dubow and Sports Writer Greg Beacham contributed.",
    "Center Brian Allen (55) could have his hands full with defenders in the middle.",
    "LA has a two-pronged running game with Sony Michel (25) and Cam Akers (23).",
    "How well the 49ers hold up on the offensive line might be critical.",
    "His counterpart, Mitch Wishnowsky (18), has had a mediocre season.",
    "They must avoid turnovers; the Rams fumbled four times at Tampa.",
    "Kupp is far from the only playmakers 49ers DBs must account for.",
    "Neither team is particularly dangerous on kick returns.",
    "Samuel could be the wild card the Rams can’t match.",
    "His sub, Joseph Noteboom (70) is a level down.",
    "So both teams have a nasty taste to remove.",
    "They have gone at each other 145 times.",
    "He also can’t be a one-man gang."
  ]
}