{
  "id": 4668,
  "mediaId": 4045,
  "date": "2022-04-22",
  "headline": "Super Bowl champion Rams don't pick until 3rd round of draft",
  "image": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/f/61/f61c9048-eeaf-5e5d-ab97-9664fcae44a2/6262d4b75bd03.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
  "link": "https://www.stltoday.com/sports/football/super-bowl-champion-rams-dont-pick-until-3rd-round-of-draft/article_9f4d14be-d71e-555a-b4cd-4679f177cfda.html",
  "mediaOutlet": "St. Louis Post Dispatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Hayes, who will appear in concert in Las Vegas on Saturday night, five days before the draft kicks off in town, had the megahit of 2021 with “Fancy Like.” The song not only crushed it on the charts and through every music medium, it also launched a dance craze thanks to a TikTok he and daughter Lela concocted.",
    "Aidan Joseph Bernardi Hutchinson is an impressive reflection of his parents and his middle names honor a great-grandfather who was part of the World War II jungle fighting unit known as “Merrill’s Marauders.” Jacksonville is expected to select Hutchinson with the No.",
    "Carolina Panthers owner David Tepper's real estate company announced they’ve terminated their previous agreement with the City of Rock Hill, South Carolina, leaving the future of the team’s planned $800 million headquarters and practice facility up in the air.",
    "One year after taking Clemson star quarterback Trevor Lawrence, the Jaguars will open the NFL draft on Thursday night with eyes on Michigan pass rusher Aidan Hutchinson, Georgia's Travon Walker or a pair of offensive tackles.",
    "The announcement comes after the Panthers announced last month they were pausing construction on the project after failing to receive bonds from the city to pay for public infrastructure.",
    "Scouts who searched for more about his background found out Chris and Melissa raised a well-rounded son, uniquely shaped by a close-knit family that includes two older sisters.",
    "No longer part of Cleveland’s future, Mayfield is not participating in the team’s voluntary offseason program as the team tries to work out a trade to get rid of the 2018 No.",
    "New Chicago Bears general manager Ryan Poles and coach Matt Eberflus have plenty of work to do as they try to turn around a struggling franchise.",
    "On his unique path, he has gone from walking on at Texas Tech and Oklahoma to winning the 2017 Heisman Trophy at Oklahoma and becoming and No.",
    "The Tennessee Titans have taken a step closer to financing a new, enclosed stadium estimated to cost between $1.9 billion and $2.2 billion.",
    "The Atlanta Falcons will be in the NFL draft spotlight as one of the teams who might draft a quarterback among the top 10 picks.",
    "Last week, Mayfield said he felt disrespected by the team, which sent six draft picks to Houston for Deshaun Watson.",
    "The city disagrees, saying in a statement it has met all financial obligations and was trying to protect taxpayers.",
    "The Panthers say the city of Rock Hill became delinquent on their obligation to fund the public infrastructure.",
    "Already at odds with Baker Mayfield, the Cleveland Browns have chosen not to get into a bigger fight with him.",
    "It’s easy to see why the Jaguars would want him after watching what Hutchinson did last year at Michigan.",
    "Jacksonville is the fourth franchise in the modern NFL era with the top draft pick in consecutive years.",
    "The fact that the Browns are barely acknowledging Mayfield underscores his stunning fall with the team.",
    "No matter the first-round decision, wide receiver and edge rusher are expected to be draft priorities.",
    "Mayfield believes his days in Cleveland will be over soon, and he looks forward to a new opportunity.",
    "The Tennessee legislature approved $500 million in bonds late Thursday night for an enclosed stadium.",
    "While it hasn’t quite worked out that way for the country music singer/songwriter, he’s found the No.",
    "Like most any boy growing up in Mobile, Walker Hayes’ early goal in his sporting career was obvious.",
    "Even with all he’s accomplished, he faces uncertainty again as he looks to maintain his NFL career.",
    "The Falcons have the eighth overall pick and are looking for a new long-term answer at quarterback.",
    "Atlanta signed Marcus Mariota as the probable 2022 starter after trading Matt Ryan to Indianapolis.",
    "The Titans are talking with Nashville officials who own the current stadium for local assistance.",
    "Hayes’ mention of Applebee’s restaurant in the lyrics basically made his song part of the menu.",
    "Chicago has six picks, including one each in the third and sixth rounds and two in the fifth.",
    "Poles and Eberflus were hired after the Bears fired former GM Ryan Pace and coach Matt Nagy.",
    "Liberty's Malik Willis and Pitt's Kenny Pickett are the top-rated quarterbacks in the draft.",
    "The Cleveland Browns have signed Deshaun Watson to a record-setting $230 million contract.",
    "The Jaguars are looking to become the first to be able to say they nailed both selections.",
    "On Wednesday, coach Kevin Stefanski was reluctant to address the polarizing QB at all.",
    "Their first draft is the next big step, starting with the 39th and 48th overall picks.",
    "Ohio State wide receiver Garrett Wilson could be another option in the first round.",
    "Baker Mayfield has overcome adversity many times and expects to do it again.",
    "1 selections — Tampa Bay, Cincinnati and Cleveland — fared previously.",
    "They also could use another cornerback to go with Jaylon Johnson.",
    "The AP takes a look at how other NFL teams with back-to-back No.",
    "The Bears need help at wide receiver and on the offensive line.",
    "The Titans' owners are committing an estimated $700 million.",
    "He called the vote by the state legislature a huge step.",
    "The Republican is expected to sign off on the deal.",
    "Star at Alabama and then be drafted into the NFL.",
    "Burke Nihill is president and CEO of the Titans.",
    "Nihill says there's still much work to do.",
    "1 overall draft pick of his profession.",
    "1 pick in the NFL draft on April 28.",
    "The proposal now goes to Gov.",
    "1 overall draft pick.",
    "1 overall draft pick.",
    "Bill Lee’s desk."
  ]
}