{
  "id": 4961,
  "mediaId": 2523,
  "date": "2022-04-24",
  "headline": "Rams could have a lot on the line in NFL draft",
  "image": "https://www.dailynews.com/wp-content/uploads/2022/04/AP22064214173637.jpg?w=1024&h=682",
  "link": "https://www.dailynews.com/2022/04/24/rams-could-have-a-lot-on-the-line-in-nfl-draft/",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Modesti",
  "authorUrl": "https://www.dailynews.com/author/kevin-modesti/",
  "termIds": [
    3938,
    5054,
    1719,
    3218,
    3577,
    2188,
    2562,
    859,
    731,
    232
  ],
  "sentences": [
    "Here are some of the interesting prospects at the offensive line positions who could be available when the Rams pick:\nPlayers to watch: Rasheed Walker, Penn State; Vederian Lowe, Illinois; Dare Rosenthal, Kentucky; Kellen Diesch, Arizona State; Max Mitchell, Louisiana\nNote: Most of them have shown the ability to play left or right tackle or guard, and the Rams prize versatility on the line.",
    "This year, the Rams have no first-round pick for the sixth draft in a row, having sent it to the Lions in the 2021 trade for quarterback Matthew Stafford, and no second-rounder, the result of last year’s trade with the Broncos for outside linebacker Von Miller.",
    "Even if the Rams are confident they can fill Whitworth’s starting spot with recently re-signed Joe Noteboom and replace Corbett with either Coleman Shelton or Tremayne Anchrum, they must restore depth along the line and anticipate departures a year from now.",
    "I think everybody in the room’s going to keep being themselves, and that’ll be enough.”\nA year ago, with then-center Austin Blythe gone as a free agent and Whitworth coming to the end, the Rams were expected to draft a center and tackle but did neither.",
    "One thing the Rams can’t add in the draft is someone to fully take the place of Whitworth, who retired at 40 after being voted the NFL’s Walter Payton Man of the Year Award and, oh, by the way, helping the Rams to a Super Bowl victory a few days later.",
    "Players to watch: Cole Strange, Tennessee-Chattanooga; Sean Rhyan, UCLA; Darian Kinnard, Kentucky; Logan Bruss, Wisconsin; Spencer Burford, Texas-San Antonio\nNote: Strange, who might be a center in the NFL, could be out of reach.",
    "CENTER\nPlayers to watch: Cam Jurgens, Nebraska; Alec Lindstrom, Boston College; Dohnovan West, Arizona State\nNote: West, who is from Bishop Alemany High in Mission Hills, has played all three interior offensive-line positions.",
    "Judging by the 2021 draft and 2022 projections, by the time the Rams start making selections, the top 10 to 14 offensive tackles, four or five guards, and three to five centers will have been taken.",
    "I’m not going to be him, Dave’s not going to be him, Brian’s not going to be him, Joe’s not going to be him.”\nSaid Allen on Thursday: “You can’t fake leadership, you can’t fake stepping into a role.",
    "The Rams got away with rejecting calls for them to pick offensive linemen in the past two NFL drafts, taking only a seventh-rounder in 2020 and completely ignoring the line in 2021.",
    "With Whitworth gone after 16 years in the league, Havenstein (seven years) is the dean of the line, followed by Noteboom and center Brian Allen (four).",
    "Barring a trade up in the order, the Rams’ first pick will be in the third round with the 104th overall, and they’ll have seven more in rounds 4 to 7.",
    "That worked out because Allen completed his recovery from a 2019 knee injury and reclaimed the center job, and Whitworth had a great final year.",
    "Other offensive linemen on the roster are tackle/guard Bobby Evans, tackle Alaric Jackson and guard Jamil Demby.",
    "Right tackle Rob Havenstein and left guard David Edwards are going into the final year of their contracts.",
    "Kinnard was All-America and, like Rosenthal, played at UK for new Rams offensive coordinator Liam Coen.",
    "But they can’t overlook offensive linemen in the three-day draft starting Thursday in Las Vegas.",
    "The line was ranked seventh in the league by Pro Football Focus.",
    "“Whit was such an important part,” Havenstein said Wednesday.",
    "Brian Allen, also re-signed, will start at center again.",
    "Right guard Austin Corbett signed with the Panthers.",
    "Guys don’t buy into that if it’s not authentic.",
    "Left tackle Andrew Whitworth retired.",
    "Rhyan was All-Pac-12 at left tackle.",
    "“He was just him."
  ]
}