{
  "id": 5050,
  "mediaId": 8322,
  "date": "2022-04-23",
  "headline": "Stallions' defense sets the tone in 33-28 victory over Gamblers",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/04/GettyImages-1393223531.jpg",
  "link": "https://www.foxnews.com/sports/stallions-defense-sets-tone-victory-gamblers",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paulina Dedaj",
  "authorUrl": "https://www.foxnews.com/person/d/paulina-dedaj",
  "termIds": [
    2188,
    3368,
    3519,
    5679,
    734,
    1066,
    1278,
    1102,
    6226
  ],
  "sentences": [
    "Quarterback J’Mar Smith, who reunited with former Louisiana Tech head coach Skip Hltz, led the Stallions to their second win of the season, completing 20 of 30 passes for 221 yards and two touchdowns, but it was the Stallions defense that stole the show.",
    "Houston would respond with a 49-yard field goal on a day when kickers seemed to struggle with the USFL’s new ball and cornerback Will Likely had a pick-six of his own just minutes later to give the Gamblers a 10-9 lead.",
    "With less than two minutes on the clock, he secured a first down on fourth-and-10 with an 11-yard run, but Lorenzo Burns would intercept the ball with 1:13 left to end Houston’s chances of scoring.",
    "The Birmingham Stallions capitalized on a number of critical turnovers Saturday night to defeat the Houston Gamblers 33-28 in the USFL’s highest-scoring game of the season.",
    "The Stallions began to pull ahead early in the second half but, despite struggling in their passing game, Houston climbed back to 26-21 by the fourth quarter.",
    "Week 2 of the inaugural USFL season will conclude with a matchup between the Tampa Bay Bandits and the New Orleans Breakers on Sunday at 3 p.m. E.T.",
    "Cornerback Brian Allen, a former 5th-round NFL Draft pick, had a pick-six on the third play of the game to give Birmingham the earlier lead.",
    "He replaced injured quarterback Alex McGough to lead the Stallions to a 28-4 victory over the New Jersey Generals in Week 1.",
    "Smith’s strong performance improved his odds of winning back-to-back Player of the Week honors.",
    "Quarterback Clayton Thorson managed to get the Gamblers within five points of the Stallions."
  ]
}