{
  "id": 5835,
  "mediaId": 2586,
  "date": "2022-04-11",
  "headline": "NFL Draft Analyst Identifies ‘Perfect Fit’ for Rams’ Scheme in 2022",
  "image": "https://heavy.com/wp-content/uploads/2022/04/GettyImages-526181136-e1649704591899.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/los-angeles-rams/perfect-fit-picked-to-rams/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lorenzo Reyna",
  "authorUrl": "https://heavy.com/author/lorenzoreyna714/",
  "termIds": [
    3938,
    4055,
    2188,
    2257,
    2307,
    232,
    731,
    859
  ],
  "sentences": [
    "Facing another Southeastern Conference (SEC) foe in Kentucky, the left guard Strange was able to swing his hips and create a wide lane during this strongly executed running play:\nThat Kentucky game from the 2021 season barely won by the Wildcats 28-23 turned out to be one of Strange’s best outings — as the Mocs averaged 6.1 yards per carry with the powerful 6-foot-5, 307-pounder helping clear the path.",
    "And via Chase Goodbread of the Tuscaloosa News, Strange made highly touted versatile lineman Logan Hall of Houston work:\nThere’s one team with Rams representation that’s taken a closer look at Strange: The Minnesota Vikings, who now has former Rams offensive coordinator Kevin O’Connell as head coach and Wes Phillips taking the offensive coordinator reins.",
    "His strength at the point of attack is underrated, and he has the quick feet to develop into a starter.”\nSounds like the ideal replacement for key offseason loss Austin Corbett, who put together one of his best seasons of his five-season career during the Rams’ run to the title.",
    "Here’s what Reid wrote in his evaluation of Strange:\n“A perfect fit in the Rams’ zone scheme, Strange played mostly guard during his career but looked good during his first stint at center during the week of practices at the Senior Bowl.",
    "But along with drafting a prospect who looks like the “perfect fit” for the Rams’ zone schemes, Reid also believed on March 30 that Strange can bring this added element to the L.A. offense: Replacing Andrew Whitworth at left tackle.",
    "How Strange Has Drawn Heavy Interest\nStrange is starting to fit the narrative of draft sleeper — considering his rise up the draft boards as a prospect who played outside of both the Power Five and Group of Five realms.",
    "This is the time of year when we hear the term “scheme fit” regarding NFL teams seeking to fill their rosters — which includes the Super Bowl champion Los Angeles Rams searching out players who can fit what they do.",
    "Jim Nagy, executive director of the Reese’s Senior Bowl, captured Strange on film keeping Oklahoma’s Perrion Winfrey in check — the same Winfrey projected to go between the late first round or No.",
    "— Mike Garafolo (@MikeGarafolo) March 15, 2022\nStrange can also come in as insurance and provide a valuable backup for the resigned Brian Allen at center.",
    "He was probably about 285 pounds but that joker was getting after it against Javon Kinlaw, who was a lot bigger and stronger,” the director said.",
    "This scheme fit pick is from the Football Championship Subdivision (FCS) realm who has had an ascent heading toward draft day.",
    "One scouting director for an NFC team told nfl.com’s Lance Zierlein that Strange was “getting after” the more stout prospect.",
    "Via Jordan Reid of ESPN, he calls Cole Strange of Tennessee-Chattanooga the 104th overall pick of the NFL Draft to the Rams.",
    "Nagy also caught Strange violently finishing his plays in the fashion NFL teams want to see from future trench protectors.",
    "The Gamecocks rolled to the 49-9 romp on that November 17 evening, but Kinlaw was bottled to just one tackle that game.",
    "One NFL insider and NFL Draft expert has found the “perfect fit” for the Rams on the morning of Monday, April 11.",
    "While at UT Chattanooga, he once crossed paths with a future NFL first-rounder for the San Francisco 49ers.",
    "But it’s more than his performance against Kinlaw that has gotten Strange to rise up in mock boards.",
    "But Corbett, 26, has since joined the Carolina Panthers to bolster their offensive line.",
    "New #Panthers G Austin Corbett gets a three-year deal for $29.25 million, source says.",
    "This player can come in and help fill an area vacated by a prominent free agent loss.",
    "But he’s tangled with Power Five talent before — notably a future first-rounder.",
    "Strange could give the champs that positional versatility if he falls to No.",
    "“If you can find the tape, go watch him against South Carolina in 2018.",
    "But it’s not Von Miller, nor Darious Williams or even Robert Woods.",
    "Former #Rams second-rounder cashes in and heads east.",
    "Who Is the Perfect Fit?",
    "44 overall by Reid.",
    "104."
  ]
}