{
  "id": 7025,
  "mediaId": 2523,
  "date": "2022-04-15",
  "headline": "FCF 2021 Week 1 Rosters, Schedule, Live Stream and Format",
  "image": "https://img.bleacherreport.net/img/slides/photos/004/513/891/0bc1b9a8fa1f27f5591bdc5b5901970a_crop_exact.jpg?w=1200&h=1200&q=75",
  "link": "https://bleacherreport.com/articles/2955377-fcf-2021-week-1-rosters-schedule-live-stream-and-format",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristopher Knox",
  "authorUrl": "https://bleacherreport.com/users/6e186227-f9b2-4450-af0d-8f62243323ee",
  "termIds": [
    0
  ],
  "sentences": [
    "ET\nShoulda Been Stars vs. Zappers\n8oki vs. Kingpins\nTeams and Week 1 Rosters\nHere's a look at all eight teams for Week 1, including their team owners and starting lineups—according to the FCF official website:\nGlacier Boys - Quavo Hunco, Adin Ross, Richard Sherman and Deestroying\nQB: Dalton Oliver, Vidal Woodruff\nRB: Brycen Alleyne\nWR: Keyon Thomas, Ismail Brooks, Tony Dixon\nSR: Kevin Felder\nOL: Force Field\nDEF: Shut Down Squad\nBeasts - Marshawn Lynch, Renee Montgomery and Miro\nQB: Alphonso Howard, Jason Stewart\nWR: Tra Chandler, LaMarcus Caradine, Jordus Smith\nSR: Harrison Dreher\nOL: The Wall\nDEF: Heavy Hitters\nShoulda Been Stars - Rachel Lindsay, Austin Ekeler, Altered State Machines and Druski\nQB: D'Vonn Gibbons, Slade Jarman\nRB: Malcolm Ballard\nWR: Patrick Smith, Jacoby Herring, Just'N Thymes\nSR: Drake Wells\nOL: Force Field\nDEF: The Hitmen\nZappers - Bob Menery, Ronnie Singh, Trevor May and Dalvin Cook\nQB: Danny Southwick, Laquan Horton\nRB: Shun'Cee Thomas\nWR: Tyis Boykin, Antonio Turner, Vance Leonard\nSR: James Harden\nOL: The Wall\nDEF: Heavy Hitters\nKingpins - NFT Kingpins\nQB: Dentarrius Yon, Tirri Jones\nRB: Daryl Virgies\nWR: Keyston Fuller, Tracy Gaston\nSR: Elijah Rogers, Eterrious Giles\nOL: The Trenchmen\nDEF: The Hitmen\nBored Ape FC - Bored Ape NFT\nQB: Deondre Francois, Chris Barrett\nRB: Jakobie Baker\nWR: Collin Andrews, Isaiah King\nSR: Maurice Thomas, RJ Mays\nOL: The Trenchmen\nDEF: Shut Down Squad\nKnights of Degen - Knights of Degen\nQB: Ed Crouch, Brian Allen\nRB: Terelle West\nWR: Travalle Calvin, Yedidiah Louis, Terrance Williams\nOL: Block Party\nDEF: The D-Block\n8oki - 8oki\nQB: Mitch Kidd, Brandon Pearson\nRB: Josh Robinson\nWR: Joseph Boykin\nSL: Malik Elion, Cedric Byrd\nOL: Block Party\nDEF: The D-Block\n*A full list of FCF players can be found here.",
    "The full season schedule, which can also be found at DAZN, is as follows:\nWeek 1 - Saturday, April 16\nWeek 2 - Saturday, April 23\nWeek 3 - Saturday, April 30\nWeek 4 - Saturday, May 7\nWeek 5 - Saturday, May 14\nWeek 6 - Saturday, May 21\nWeek 7 - Saturday, May 28\nPlayoffs - Saturday, June 4\nChampionship - Saturday, June 11\nWeek 1 Schedule\nFCF will hold four games weekly during the regular season with two windows separating the action.",
    "\"If it's Johnny Football, it doesn't matter if it's Pee-Wee Herman, as long as they throw the ball where it needs to be and ... put it in my catch radius, I'm going to do my best to make some stuff happen with it.\"",
    "Extra points (two-point conversions) are decided by a one-vs.-one battle between a wide receiver and defensive back from the five-yard line—with the quarterback having just four seconds to deliver a pass.",
    "Offensive lines and defenses are drafted as units, while quarterbacks and offensive skill players—wide receivers, slot receivers and running backs—are drafted individually.",
    "This year, FCF will feature two divisions—the OGs and the Ballerz—with each team playing its divisional opponents twice in the season along with one non-divisional game.",
    "Rules and Format\nThe FCF rules were voted on by fans before the inaugural season and feature quite a few departures from traditional American football.",
    "Backup quarterbacks will also be involved, with each team's signal-callers having to play at least one out of three possessions (barring injury).",
    "Games are played with a running clock, except in the last 30 seconds of the half and overtime, and are expected to fit within a one-hour window.",
    "This year's top stars include former Texas A&M and Cleveland Browns quarterback Johnny Manziel and NFL Hall of Famer Terrell Owens.",
    "The defending champion Wild Aces are back—now known as the Shoulda Been Stars—along with the Zappers, Beasts and Glacier Boyz.",
    "That's right, FCF has expanded from its original four-team format to feature eight squads all vying for the championship.",
    "Rosters will be redrafted throughout the season, with the exception of two \"franchise players\" designated for each squad.",
    "\"I'm looking forward to throwing with Johnny or whomever the quarterback may be,\" Owens said, per ESPN's Tim McManus.",
    "With Week 1 on the proverbial doorstep, let's dive into the rules, format, schedule and roster for the opening slate.",
    "Games are played on a 50-yard indoor field with rounds of rock, paper, scissors replacing the opening coin toss.",
    "FCF is set to kick off its second season—Season v2.0—on Saturday with all eight teams in action.",
    "There will be a seven-week regular season, followed by the playoffs and the championship game.",
    "As was the case last year, fans will pick the rosters and vote on plays via the FCF App.",
    "Offenses begin on their own 10-yard line and must drive 40 yards to the end zone.",
    "Games will be live-streamed on DAZN, Twitch, NBCLX, Peacock and the FCF App.",
    "They'll be joined by the Knights of Degen, 8oki, Kingpins and Bored Ape FC.",
    "It's seven-on-seven football with three offensive linemen per team.",
    "For one, there's no kicking in FCF, no special teams and no punts.",
    "All games will be available for streaming on multiple platforms.",
    "The Week 1 schedule is as follows:\nSession 1 - 1 p.m.",
    "ET\nGlacier Boyz vs. Beasts\nKnights of Degen vs.",
    "Fan Controlled Football is back!",
    "Bored Ape FC\nSession 2 - 7 p.m."
  ]
}