{
  "id": 7911,
  "mediaId": 5329,
  "date": "2022-04-06",
  "headline": "Chicago Bears Q&A: Is 2024 when we can expect this team to compete again? Could Nick Foles wind up being released?",
  "image": "https://www.twincities.com/wp-content/uploads/2022/04/202204060724TMS_____MNGTRPUB_SPORTS-CHICAGO-BEARS-QA-IS-2024-WHEN-99-TB5.jpg?w=1024&h=683",
  "link": "https://www.twincities.com/2022/04/06/chicago-bears-qa-is-2024-when-we-can-expect-this-team-to-compete-again-could-nick-foles-wind-up-being-released/",
  "mediaOutlet": "St.Paul Pioneer-Press ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tribune News Service",
  "authorUrl": "https://www.twincities.com/author/tribune-news-service/",
  "termIds": [
    0
  ],
  "sentences": [
    "For the Sam position, we really want that guy to be able to swing into the inside backer spots at a Mike or Will spot, so that guy will be a dual-position guy.”\nI don’t know if the Bears will hit 85% this season, but with Eberflus as the defensive coordinator in Indianapolis last season, the Colts were in their nickel package 79% of the time, second-most in the league.",
    "They need help at a bunch of positions, and the list isn’t limited to cornerback, strong safety, wide receiver, guard, strong-side linebacker, return specialist, tight end …\nIf the Bears can’t trade Nick Foles, should they cut him to create a roster spot for a contributing free agent or rookie?",
    "— @_rightonq_\nYou’re looking at a combination of six draft picks (unless Poles trades down to add more capital), a lot of free agents signed to one-year contracts (the vast majority for the minimum) and a healthy collection of undrafted rookie free agents for the Bears to add 33 players.",
    "The Bears will have a full complement of draft picks next year, and depending on how they advance on offense this season — assuming they do — they could be considerably improved in 2023, when Poles will have a ton of salary-cap flexibility to be more aggressive in free agency.",
    "Fast forward to the spring of 2024, and no one will look at his draft picks from this year and say, “Hey, they got these two guys and they plugged holes in 2022.” We will look at the 2022 class and ask how many of those players are in a position to help the team win in 2024.",
    "Do you think Ryan Poles’ lack of urgency in free agency, specifically on offense with the line and wide receiver, is an indication that he is not concerned with Justin Fields’ development this year and intends to trade him next year and draft his own guy?",
    "The Bears could have interest in Ogunjobi in the future or for less money, but after they pulled the three-year, $40.5 million contract off the table, I have a difficult time believing Ogunjobi would be interested in joining them.",
    "The good news is the contract has offset so if the Bears were to release Foles and he signed with another team, they no longer would be on the hook for that guarantee once he received his first $1 million from the new team.",
    "— @illini8208\nThere’s no question the Bears are in the beginning stages of a rebuild, and with so many players being added to the roster this year on one-year contracts, there will be considerable overhaul again in 2023.",
    "— @mosconml\nThere was unwarranted celebration among Bears fans when Leno was released after the draft last year, and it turned out the Bears would have been significantly better off keeping him on a modest contract.",
    "— @joe_vizo\nI will be as direct as I can: It’s way more important for Poles to find players who can be contributors than it is for him to fill specific roster “needs” that you and I can identity right now.",
    "They really don’t have “the same personnel.” We’re talking about an adjustment in scheme for the front seven, and only two starters there remain — linebacker Roquan Smith and defensive end Robert Quinn.",
    "A veteran who is confident he can learn the offense quickly and compete for a starting job is happier to spend the offseason training on his own and then commit to a team in time for training camp.",
    "I don’t think the Bears will be great in 2022 by any stretch, but they’ll have to be especially poor — with what appears to be a much easier schedule than the 2021 slate — to have a top-three pick.",
    "Sometimes veteran players like James aren’t interested in giving away their spring and committing to an offseason program, OTAs, minicamp and all of that when they won’t be paid above the minimum.",
    "— Mike, Geneva\nThe Bears are looking to replace veteran Pat O’Donnell, who departed for the Green Bay Packers via free agency, and they have one punter under contract — 27-year-old Ryan Winslow.",
    "Sure, the Bears could have been more aggressive pursuing wide receivers, but we’ve seen a lot of receivers come and go that the team overpaid for in free agency and got little production from.",
    "Poles expressed optimism at the owners meetings that one of them could handle the position, but the team hasn’t gotten on the field yet and linemen won’t be in full pads until training camp.",
    "— Tom S., Chicago\nEberflus talked about using the nickel defense for the vast majority of snaps when he was asked at the owners meetings about a strong-side linebacker for the base defense.",
    "Angelo Blackson also should fit in on the defensive line, and Trevis Gipson will get a chance to play with his hand in the dirt again, which is what he was accustomed to doing at Tulsa.",
    "The Bears stink and Justin Fields plays poorly and they get a top-three pick or Fields does great, the Bears win six to eight games and a first-round pick next year between 15 and 17?",
    "I think the best plan with a guy like Raimann would be to start him on the right side and let him adjust to the pro game, but he would be worthy of a discussion at Halas Hall.",
    "Why do so many people think if the Bears draft a tackle in the second or third round this year he will be better than the second-round tackle that was drafted last year?",
    "— Dennis G., Evergreen, Colo.\nPoles was asked last week at the owners meetings about Ogunjobi and the possibility of revisiting a contract, and he didn’t rule that out.",
    "— @joshkezer\nFoles already has earned a $4 million roster bonus for this season, and his base salary is an additional $4 million with $1 million fully guaranteed.",
    "Mario Edwards Jr. wasn’t a starter last season but was a regular in the defensive line rotation, and I imagine he will fit just fine as a three-technique tackle.",
    "Still, they seemingly overpaid at every turn and inherited a whopper of a contract with Foles when they acquired him via trade from the Jacksonville Jaguars.",
    "Poles said the team believes a new system and new coaching will greatly benefit Fields, and keep in mind they aren’t done shaping the roster by a long shot.",
    "Leno didn’t play to his ability in 2020, but he bounced back and had a better season in Washington last year, earning a new contract from the Commanders.",
    "Since then he has bounced around with the Arizona Cardinals (three stops), Packers, Carolina Panthers, Washington Commanders and San Francisco 49ers.",
    "It seems to me if you are going to do that, you need to be reasonably confident that you can stop the run with the extra defensive back in the game.",
    "He has been good enough to be on teams’ emergency list and he got extra opportunities during COVID-19 when teams wanted to have a reserve available.",
    "If they’re that bad, quarterback play will be a major problem, the defense will be significantly worse and injuries likely will be a huge issue.",
    "In fairness, the Bears pursued most of these veterans because they were deemed good fits for the offense and/or had experience in the system.",
    "Central Michigan’s Bernhard Raimann is potentially an interesting prospect if he’s on the board in Round 2 when the Bears are on the clock.",
    "That’s the biggest issue they face, and there are a lot of questions for Fields and the offense in 2022 because he struggled as a rookie.",
    "So it’s possible the Bears will be seeking a bridge option at the position, even if it means plugging in Jenkins or Borom for a season.",
    "It’s unlikely a quality left tackle would be cut, but you can’t rule out the possibility that a decent bridge option becomes available.",
    "A bigger question is how the team will fill vacant spots on the roster than how it will get current players to adjust to a new scheme.",
    "Do you think that this means we will see more big nickel, where the extra defensive back is a safety, than we have seen in the past?",
    "I expect Winslow to have an opportunity to compete for the job with a veteran on a minimum-salary deal or an undrafted free agent.",
    "Evaluate the players on the roster in Year 1 and gut it again and fill out the roster with a bunch of one-year free-agent deals.",
    "Do you know enough about Larry Ogunjobi’s failed physical to say if he might eventually be able to play with more time to heal?",
    "It won’t be hard to reach the 90-man limit, and they ought to be able to find a few players who emerge as pleasant surprises.",
    "You might recognize his name as the Pitt product who got his first shot in the NFL during the 2018 offseason with the Bears.",
    "The Bears made a play for center Brian Allen in free agency, and when they didn’t land him, they pivoted to Lucas Patrick.",
    "Siemian signed a two-year, $4 million contract, and the Bears could be trending toward paying veteran backups less money.",
    "They’ve sunk a ton of money into veterans — some projected as starters at the beginning of the season — for a while now.",
    "You will see a good handful of veterans cut loose after the draft, but more times than not, they’re descending players.",
    "He’s relatively new to the position but has great power and might have the athleticism to play left tackle in the NFL.",
    "I don’t know if that’s the case with James in this situation, but I do know that was a factor for him last offseason.",
    "I guess your sweet spot is Fields plays well and the Bears have a lousy record and get a high pick in the 2023 draft.",
    "What’s most important is finding players who can stick and be part of the future — no matter what position they play.",
    "It beats the alternative of Fields playing poorly and quarterback being a huge issue again at this time next year.",
    "After the draft, every team reassesses its depth chart and needs, and that’s when you see some veterans cut loose.",
    "No, I don’t believe the Bears, with a shortage of draft picks, would strongly consider investing one on a punter.",
    "If the Bears have solid players, they will be able to play solid defense against the run in their nickel package.",
    "I think drafting depth O-linemen would be good but don’t believe anything before the fourth round would be wise.",
    "It’s possible they will sign a few more veterans in the next two weeks before completely focusing on the draft.",
    "— @kenty_00\nJames was a decent contributor to the offense last season and surely will get signed at some point.",
    "They were optimistic they would land Ryan Bates as a restricted free agent, and that didn’t come to fruition.",
    "The hope, of course, is that a handful of players they have added will emerge as good fits and be re-signed.",
    "Thinking out loud and wondering if the Bears can find a version of Charles Leno after the draft is complete.",
    "That would mean the Bears have taken a massive step toward solving their long-standing quarterback dilemma.",
    "If so, perhaps the Bears could offer him a conditional contract based on number of games or snaps he plays.",
    "With the NFL draft only three weeks away, Brad Biggs takes a spin through the weekly Chicago Bears mailbag.",
    "2 quarterback in Trevor Siemian, and if a team does have interest in Foles, it might not be at $4 million.",
    "The biggest question right now is if the Bears believe Teven Jenkins or Larry Borom can play left tackle.",
    "The key will be seeing what kind of roots the team can put down on offense and defense in the year ahead.",
    "The Bears recruited him a year ago and he signed just before training camp for basically a minimum deal.",
    "I suppose that Ryan Poles has already thought of that, but just an idea I wanted to toss out to you.",
    "I was struck by Matt Eberflus’ statement that he wanted to play the nickel defense 85% of the time.",
    "Poles has shown some urgency for the offensive line; it’s just that the plans didn’t come through.",
    "Generally, top left tackles are drafted in Round 1 and often in the first half of the first round.",
    "Smith should adapt well in any scheme, and Quinn has much more experience in a 4-3 than in a 3-4.",
    "That’s jumping from Point A to Point T — for trade — and skipping a lot of stops along the way.",
    "Just how difficult is it for a team to switch defensive schemes with almost the same personnel?",
    "Through it all, Winslow has appeared in six regular-season NFL games with a total of 22 punts.",
    "Winslow’s last opportunity came in January when the 49ers signed him to their practice squad.",
    "If you’re rooting for the team, you have to want the quarterback to play as well as he can.",
    "Lower in the list of concerns for the roster right now, but what is the plan at punter?",
    "So that gave new Bears special teams coordinator Richard Hightower a close look at him.",
    "He also was signed by the San Diego Fleet and Memphis Express in the now-defunct AAF.",
    "— @nieldan20112581\nNo one said digging out of the current predicament would be easy.",
    "With so many needs going into the draft, will Ryan Poles double up on any position?",
    "It’s difficult to evaluate linemen if they’re not actually hitting in live drills.",
    "“You play almost 85% nickel during the course of a season, so that’s a big piece.",
    "The Bears could benefit by adding veterans at a couple of positions post-draft.",
    "The Colts had one of the best nickel cornerbacks in the league in Kenny Moore.",
    "They can’t overpay for players who won’t perform to the level of the contract.",
    "It should be noted the Bears were in dime personnel nearly 16% of the time.",
    "You learn never to say never in the NFL, but this seems like a long shot.",
    "I imagine the Bears will take a close look at the personnel notices then.",
    "If Fields “does great,” there’s no way that’s a lose/lose for the team.",
    "The Bears don’t have any leverage right now in efforts to trade Foles.",
    "How can the current roster adjust to the switch from a 3-4 to a 4-3?",
    "Then Foles arrived, and he has cashed $20 million from the Bears.",
    "After him, Chase Daniel signed a two-year, $10 million contract.",
    "This is certainly a glass-half-empty outlook at the near future.",
    "I think they currently only have 57 players signed to contracts.",
    "How often do we see starting-quality vets cut after the draft?",
    "— @sawbukjames\nI don’t think it’s as challenging as you think.",
    "I’m thinking of Eddie Royal and Taylor Gabriel among others.",
    "The Bears were in nickel 55% of the time, which ranked 23rd.",
    "I’d be more concerned about the personnel than the packages.",
    "Add it up and that’s $56.5 million for six combined seasons.",
    "Are there positions where they need two or more players?",
    "If that means a middle-of-the-pack pick in 2023, great.",
    "Those four combined for 21 starts with an 8-13 record.",
    "Eberflus’ Colts played only six snaps of dime defense.",
    "Is 2024 when we can expect the Bears to compete again?",
    "Finally Andy Dalton was paid $10 million last season.",
    "What is the plan for filling the roster out for camp?",
    "It seems highly unlikely to me that would happen.",
    "Only the Buffalo Bills (90%) played more nickel.",
    "Figure they’ll sign 10 to 15 undrafted rookies.",
    "Mike Glennon made $16.5 million from the Bears.",
    "I could see the Bears eventually releasing him.",
    "I see this season and next as being a rebuild.",
    "Any reason Jesse James hasn’t been re-signed?",
    "I don’t see this as a problem for the Bears.",
    "The Bears likely need multiple cornerbacks.",
    "Could they double up on certain positions?",
    "“We play with a lot of nickel,” he said.",
    "Did well in small showings last season.",
    "— @stewart_errol\nYou make a fair point.",
    "What’s worse for the next two years?",
    "They’ve already signed a new No.",
    "I feel like both are lose/lose.",
    "I know … it’s a reach.",
    "Recommended For You",
    "— @dxwilson1\nWow.",
    "No question.",
    "Sure."
  ]
}