{
  "id": 879,
  "mediaId": 2573,
  "date": "2022-02-14",
  "headline": "Rams bask in Super Bowl win, hope Sean McVay, Aaron Donald want another",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/AP22045648626255.jpg",
  "link": "https://www.foxnews.com/sports/rams-bask-in-super-bowl-win-hope-sean-mcvay-aaron-donald-want-another",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2032,
    2120,
    2307,
    3383,
    5267,
    4186,
    4366,
    731,
    275,
    6328
  ],
  "sentences": [
    "Not even a Super Bowl championship affected Rams owner Stan Kroenke's career-long reluctance to speak publicly about his many sports teams, but Demoff said the billionaire who built SoFi Stadium was \"happier than I’ve ever seen him\" after raising his first Lombardi Trophy.",
    "Free agency is only four weeks away, and the Rams must make decisions on several key players: Miller, receiver Odell Beckham Jr., starting cornerback Darious Williams, offensive linemen Brian Allen and Austin Corbett, and defensive lineman Sebastian Joseph-Day.",
    "(AP Photo/Marcio Jose Sanchez)\nRams chief operating officer Kevin Demoff says the team will wait until its celebrations die down to figure out how serious McVay and Donald are about starting life after football, but he is optimistic they’ll both be back.",
    "Sean McVay looked and sounded very much like somebody who had been up all night celebrating his first Super Bowl victory when the coach showed up early Monday morning to discuss his Los Angeles Rams' hometown coronation.",
    "Aaron Donald also hit his career's peak by making the decisive defensive play on Cincinnati's final snap, harassing Joe Burrow into a fourth-down incompletion to finish a Super Bowl performance that included two sacks.",
    "\"There were so many guys on this team that have just respected this game, have put in the work and the time,\" said Kupp, who looked less annoyed than his boss to be awake shortly after sunrise.",
    "With the Rams' 23-20 victory over the Cincinnati Bengals, McVay has finally reached the culmination of a journey he began in early 2017 as the youngest head coach in modern NFL history.",
    "Landing in a glamorous town that had largely forgotten them, the Rams got everybody's attention again by developing an appetite for risks and stocking their roster with veteran stars.",
    "The three-time AP Defensive Player of the Year finally has his first ring — and the 30-year-old star also sidestepped questions about early retirement immediately after the victory.",
    "The Rams’ offense managed just three points from seven consecutive possessions before its final drive — a 15-play, 79-yard imperfect masterpiece ending in Kupp’s 1-yard TD catch.",
    "\"When you get around great players, great coaches that are all committed and working in the same direction, pulling that rope in the same direction, good things can happen.",
    "\"Buying land to build a stadium, hoping to get the opportunity to become the Los Angeles Rams again, and hiring a 30-year-old head coach when everybody wanted a major name.",
    "McVay said nothing Monday about the possibility of walking away from football soon, as the burnout-prone coach has suggested when asked about it over the years.",
    "I think that’s daunting to some degree when you wake up this morning and realize you’ve got to go do it all over again, and you don’t have the energy.",
    "It happened one last time in the Super Bowl when Cincinnati scored 17 consecutive points to take a 20-13 lead several minutes into the third quarter.",
    "Just over five years later, the 36-year-old is also the youngest coach to win a Super Bowl — and the trip left him exhausted, but thrilled.",
    "From Donald and Von Miller to Matthew Stafford and Super Bowl MVP Cooper Kupp, Los Angeles' big names loomed large in the grand finale.",
    "But Kupp had a confident answer when asked if he thought the Rams could become the first NFL team in nearly two decades to repeat.",
    "\"It's also torturous to have a team win a championship and then make you come the next morning to a press conference this early.\"",
    "\"If you're going into a season and didn't think you could win it all, it would be a pretty depressing place to play from.\"",
    "When you have the right foundational pieces ... because of those guys’ success, other people get opportunities to grow.\"",
    "The Rams kept the party going at Disneyland later Monday, and they’ll get a victory parade in Los Angeles on Wednesday.",
    "The Rams have done everything big since Kroenke relocated them to Los Angeles from his native Missouri six years ago.",
    "I don’t think Sean’s current pace is sustainable in terms of how much work he puts in if you want to have a family.",
    "\"We went through a little bit of a lull there leading into halftime and through that third quarter.",
    "\"He took the two biggest risks in the NFL that I can think of in the last decade,\" Demoff said.",
    "\"It's an incredible honor to be here,\" McVay said, his sandpaper rasp accentuating his sarcasm.",
    "\"When you get to this point, the gas tank is empty and you’re sitting there holding a trophy.",
    "But he didn’t sound like he was finished with his work on a team he built into a champion.",
    "A month away, two months away from everybody, and I think things will feel a lot better.\"",
    "So many guys just said, ‘Hey, we've got guys here that deserve a Super Bowl.",
    "We just needed to keep pushing and keep trusting in the details of things.\"",
    "Many of those stars played key roles in the Rams' 16th and final victory.",
    "These are all natural questions that are hard to answer in the moment.",
    "They're also waiting for Andrew Whitworth's decision on retirement.",
    "\"We talk a lot about just being able to do your job,\" Kupp said.",
    "Those two risks culminated last night with unbelievable reward.\"",
    "But I think the one thing, these guys all love football.",
    "\"I think all of these guys are wiped,\" Demoff said.",
    "\"I’ve been surrounded by great people,\" McVay said.",
    "So I think the talk is actually natural.",
    "\"That was a huge thing coming into this.",
    "They love being around each other.",
    "We've got to win this for them.'\"",
    "\"Certainly,\" he said.",
    "\"And I would agree.",
    "..."
  ]
}