{
  "id": 9554,
  "mediaId": 2617,
  "date": "2022-03-19",
  "headline": "Rams face new questions after first week of moves",
  "image": "https://www.dailynews.com/wp-content/uploads/2022/03/imageedit_21_2717091-16x9-1.jpg?w=1024&h=579",
  "link": "https://www.dailynews.com/2022/03/19/signs-point-to-more-moves-after-rams-free-agent-losses/",
  "mediaOutlet": "Los Angeles Daily News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Modesti",
  "authorUrl": "https://www.dailynews.com/author/kevin-modesti/",
  "termIds": [
    2032,
    1784,
    3708,
    3577,
    3383,
    2125,
    2307,
    1295,
    859,
    731
  ],
  "sentences": [
    "Namely, after adding Robinson to Cooper Kupp, Robert Woods, Van Jefferson and maybe Odell Beckham Jr., would they keep all of those receivers for Matthew Stafford – the quarterback on Saturday agreed to a four-year contract extension worth a reported $160 million – or spend a little of the apparent surplus in a trade for other necessities?",
    "Beckham was the Rams’ top remaining free agent after five days of NFL transactions this week saw the departures of six free agents as well as the retirement of left tackle Andrew Whitworth, the release of punter Johnny Hekker and the non-tendering of inside linebacker Troy Reeder.",
    "With backup Ogbo Okoronkwo gone to the Houston Texans, Miller’s replacement won’t come from within the Rams’ ranks unless Justin Hollins earns a lot more snaps or 2021 seventh-round pick Chris Garrett earns a chance after a COVID-19-ravaged rookie year.",
    "Now that they don’t have a glut of starting-caliber wide receivers, the Rams’ next task at the position is to re-sign Beckham, a free agent who is likely to miss the first half of the season after tearing an ACL in the Super Bowl victory.",
    "Whether Shelton should be penciled in at right guard after starter Austin Corbett signed with the Carolina Panthers is another question for the offense going into the second wave of free-agent signings and the NFL draft April 28-30.",
    "Aaron Donald, the three-time NFL Defensive Player of the Year, hinted before the Super Bowl that he could retire if the Rams won it, and indicated the following week that he wanted to see the team bring back Miller and Beckham.",
    "But more important, they got $7.1 million in salary-cap relief, according to the sports payroll tracker Spotrac.com, by dropping the 2022 portion of the four-year, $65 million contract extension Woods signed 18 months ago.",
    "In 2022, the Rams are prepared with acceptable successors at most of the positions hit by free agency, but they could upgrade with signings, trades or draft picks at some of those spots, and definitely need a new punter.",
    "It’s worth remembering that a year ago, Rams fans were worried about the defense after lineman Michael Brockers was traded and safety John Johnson and cornerback Troy Hill both signed with the Cleveland Browns.",
    "Parting with the soon to be 30-year-old Woods, a popular player from Serra High (Gardena) and USC, was the kind of unsentimental decision a championship-winning team sometimes must make to keep moving forward.",
    "There’s a hole again at outside linebacker after Von Miller, who will be 33 on March 26, signed with the Buffalo Bills for a whopping $120 million over an even more whopping six years.",
    "General Manager Les Snead said earlier this month the Rams were “in discussions with Aaron” about a new contract, a top off-season priority along with the extension for Stafford.",
    "As of Sunday, they were $15.8 million under the $208.2 million cap, the league’s 19th-best cushion, after going into the first week of free agency in the league’s deepest hole.",
    "They moved to prevent a mass exodus from the offensive line by re-signing starting center Brian Allen as well as new left tackle Joe Noteboom and guard/center Coleman Shelton.",
    "It did so without any veteran acquisitions before the 2021 season and with only a little help from the draft in the person of fourth-round defensive back Robert Rochell.",
    "Even the addition of wide receiver Allen Robinson, in the Rams’ first and so far only signing as Super Bowl champions, created a question.",
    "The past few days left the Rams with more question marks than they had in the glow of the Super Bowl — or even a week ago.",
    "The answer to that question came dramatically Saturday evening, when the Rams traded Woods to the Tennessee Titans.",
    "2 tight end behind Tyler Higbee after the Minnesota Vikings signed Rams free agent Johnny Mundt.",
    "The first wave of NFL free agency brought the Rams one new player and a bunch of new questions.",
    "In return for Woods, the Rams got Tennessee’s sixth-round pick in the 2023 NFL draft.",
    "Kendall Blanton and Brycen Hopkins had big moments in the playoffs and Super Bowl.",
    "If the Rams are lucky, that’s the biggest issue raised by Miller leaving.",
    "Rams executives have sounded confident Donald will keep playing.",
    "But that was before Miller, his pass-rush partner, walked away.",
    "Another question on offense is who should step in as the No.",
    "Free-agent week left bigger questions to answer on defense.",
    "The remaining defense pulled through, to say the least.",
    "It’s all part of life after winning a Super Bowl.",
    "Still, it’s not time yet to fret.",
    "Opening week is 5½ months away."
  ]
}