[
  {
    "id": 2734,
    "mediaId": 2662,
    "date": "2022-01-31",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "Cassandra Fairbanks",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 1635,
    "mediaId": 2522,
    "date": "2022-02-13",
    "sentence": "",
    "author": "Joshua Nybo",
    "title": "Penn. Senate candidate to run ‘Let’s Go Brandon’ ad during Super Bowl to highlight Biden failings"
  },
  {
    "id": 11276,
    "mediaId": 6570,
    "date": "2022-03-14",
    "sentence": "",
    "author": "Jonathan Tamari",
    "title": "Dave McCormick has dropped millions into Pa.'s U.S. Senate race, but it's hard to trace where it's coming from"
  },
  {
    "id": 9216,
    "mediaId": 2732,
    "date": "2022-03-19",
    "sentence": "He had just spent about an hour listening to Republican U.S. Senate candidate <span class='selected-term'>Dave McCormick</span> as he addressed several dozen people in a private room, talking about his qualifications and what separates him from the rest of the crowded primary field.",
    "author": "Paula Reed Ward",
    "title": "Republican U.S. Senate candidate Dave McCormick greets potential voters in Murrysville"
  },
  {
    "id": 7623,
    "mediaId": 2744,
    "date": "2022-04-03",
    "sentence": "Just In...\nPINE TOWNSHIP, Pennsylvania — When Sarah Sanders took center stage Wednesday night at an event for <span class='selected-term'>Dave McCormick</span>, a Republican primary candidate for the U.S. Senate, her entrance into the packed event space didn’t go as planned.",
    "author": "Salena Zito",
    "title": "Sarah Sanders emerges as a formidable advocate for Republican candidates on the campaign trail"
  },
  {
    "id": 5838,
    "mediaId": 2522,
    "date": "2022-04-11",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he’s the farthest thing from America First & he’d be very bad for PA https://t.co/kuTo4pp53U\n— Sean Parnell (@SeanParnellUSA) April 9, 2022\n<span class='selected-term'>Dave McCormick</span>, who is a former George W. Bush administration official and is married to Dina Powell, a former deputy national security adviser to Trump, was also in the running for his endorsement but did not get it even though he leads Oz, according to recent polls.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Conservatives react very badly to Donald Trump’s endorsement of Dr. Oz"
  }
]