[
  {
    "id": 1789,
    "mediaId": 2572,
    "date": "2022-02-04",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> said that the state's working families \"are being terribly damaged by the policies of the Biden administration\" Friday on \"The Story with Martha MacCallum.\"",
    "author": "",
    "title": "Working families 'being terribly damaged' by the Biden administration: Dave McCormick"
  },
  {
    "id": 1806,
    "mediaId": 2658,
    "date": "2022-02-05",
    "sentence": "Sarah Huckabee Sandersshowed up to support Pennsylvania Senate hopeful <span class='selected-term'>Dave McCormick</span> at the Keystone State’s Republican State Central Committee meeting.",
    "author": "",
    "title": "POLITICO Playbook: RNC does Trump’s bidding, frustrating its members"
  },
  {
    "id": 1635,
    "mediaId": 2522,
    "date": "2022-02-13",
    "sentence": "",
    "author": "Joshua Nybo",
    "title": "Penn. Senate candidate to run ‘Let’s Go Brandon’ ad during Super Bowl to highlight Biden failings"
  },
  {
    "id": 12476,
    "mediaId": 8322,
    "date": "2022-03-01",
    "sentence": "The state’s GOP primary is one of the most hotly contested and most-watched of the cycle, as Oz faces off against a crowded field of Republicans, including former hedge fund CEO and veteran <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brooke Singman",
    "title": "Dr. Oz says COVID-19 'steeled' him to run for office, calls on Fauci to resign"
  },
  {
    "id": 15522,
    "mediaId": 8254,
    "date": "2022-03-09",
    "sentence": "(WHTM) – A new Fox News poll shows former hedge fund CEO <span class='selected-term'>Dave McCormick</span> taking a nine point lead in the race to represent Pennsylvania in the United States Senate.",
    "author": "George Stockburger",
    "title": "McCormick, Oz lead Fox News Poll of Pa. Senate race"
  },
  {
    "id": 11276,
    "mediaId": 6570,
    "date": "2022-03-14",
    "sentence": "",
    "author": "Jonathan Tamari",
    "title": "Dave McCormick has dropped millions into Pa.'s U.S. Senate race, but it's hard to trace where it's coming from"
  },
  {
    "id": 10834,
    "mediaId": 2553,
    "date": "2022-03-16",
    "sentence": "And my failing RINO opponent <span class='selected-term'>Dave McCormick</span> is lying about me leaving the race after being exposed by Philly Inquirer.https://t.co/L0DgP6WMGC\n— Dr. Mehmet Oz (@DrOz) March 16, 2022\nOz’s linked a Philadelphia Inquirer article that claimed some of the donors helping McCormick to attack him are past donors of liberal Democrats, including Hillary Clinton’s 2016 presidential campaign.",
    "author": "Dillon Burroughs",
    "title": "‘I’m In To Win’: Dr. Oz Responds To Report Of TV Show Talks"
  },
  {
    "id": 11719,
    "mediaId": 8254,
    "date": "2022-03-24",
    "sentence": "A Fox News poll released in early March showed Oz second in the Senate race behind former hedge fund CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "George Stockburger",
    "title": "Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 9842,
    "mediaId": 8254,
    "date": "2022-03-31",
    "sentence": "According to the Pittsburgh Post-Gazette, Parnell endorsed Senate candidate <span class='selected-term'>Dave McCormick</span> and appeared with him at a March 15 event in Homestead, Pa.",
    "author": "George Stockburger",
    "title": "Sean Parnell, former Senate candidate, endorses McSwain for Governor"
  },
  {
    "id": 7623,
    "mediaId": 2744,
    "date": "2022-04-03",
    "sentence": "Just In...\nPINE TOWNSHIP, Pennsylvania — When Sarah Sanders took center stage Wednesday night at an event for <span class='selected-term'>Dave McCormick</span>, a Republican primary candidate for the U.S. Senate, her entrance into the packed event space didn’t go as planned.",
    "author": "Salena Zito",
    "title": "Sarah Sanders emerges as a formidable advocate for Republican candidates on the campaign trail"
  },
  {
    "id": 7633,
    "mediaId": 6570,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Julian Routh",
    "title": "GOP Senate candidate Dave McCormick sees Pennsylvania's natural gas as driver of state's economy"
  },
  {
    "id": 7085,
    "mediaId": 8322,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Trump suggests he’ll decide on Pennsylvania GOP Senate endorsement in ‘about a week’"
  },
  {
    "id": 5438,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Trump’s endorsement comes two days after a The Hill/Emerson College poll found Oz and hedge fund manager <span class='selected-term'>Dave McCormick</span> to be neck-and-neck ahead of the May 17 primary.",
    "author": "Katherine Huggins",
    "title": "Trump Backs Dr. Oz’s Pennsylvania Senate Bid, Cites Doc’s Diagnosis That He’s in ‘Extraordinary Health’ in Glowing Endorsement"
  },
  {
    "id": 5741,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "The endorsement came after months of behind-the-scenes jockeying by Oz and another leading candidate in Pennsylvania, <span class='selected-term'>Dave McCormick</span>, a hedge fund executive.",
    "author": "Sarah Fortinsky",
    "title": "Trump endorses Mehmet Oz in Pennsylvania Senate race"
  },
  {
    "id": 8431,
    "mediaId": 8483,
    "date": "2022-04-09",
    "sentence": "Ad Watch: Fact-checking ad attacking Republican US Senate candidate <span class='selected-term'>Dave McCormick</span>\nRecommended",
    "author": "Matt Barcaro",
    "title": "Ad Watch: Fact-checking ad claiming Republican US Senate candidate Dave McCormick paid for attacks on Donald Trump"
  },
  {
    "id": 5518,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "Sunday morning, the campaign of billionaire <span class='selected-term'>Dave McCormick</span> released a statement from Santorum who stated, \"I know Pennsylvania and I know conservatives.",
    "author": "Tom Boggioni",
    "title": "Rick Santorum bucks Trump over Pennsylvania Senate seat endorsement: report"
  },
  {
    "id": 5425,
    "mediaId": 2578,
    "date": "2022-04-10",
    "sentence": "Dr. Oz is currently in a tight primary race with <span class='selected-term'>Dave McCormick</span> a former hedge fund manager.",
    "author": "Jim Hoft",
    "title": "President Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 5312,
    "mediaId": 2621,
    "date": "2022-04-10",
    "sentence": "But that’s good enough for a close second place in a crowded Republican primary field, behind current frontrunner <span class='selected-term'>Dave McCormick</span> at 18 percent.",
    "author": "Joe DePaolo",
    "title": "Trump Beams About His Dr. Oz Endorsement at Rally: When You’re in TV for 18 Years, ‘That’s Like a Poll, That Means People Like You’"
  },
  {
    "id": 6065,
    "mediaId": 2873,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration officials Hope Hicks and Stephen Miller by his side.",
    "author": "",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 5777,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration official Hope Hicks by his side.",
    "author": "Zachary Petrizzo",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 5838,
    "mediaId": 2522,
    "date": "2022-04-11",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he’s the farthest thing from America First & he’d be very bad for PA https://t.co/kuTo4pp53U\n— Sean Parnell (@SeanParnellUSA) April 9, 2022\n<span class='selected-term'>Dave McCormick</span>, who is a former George W. Bush administration official and is married to Dina Powell, a former deputy national security adviser to Trump, was also in the running for his endorsement but did not get it even though he leads Oz, according to recent polls.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Conservatives react very badly to Donald Trump’s endorsement of Dr. Oz"
  },
  {
    "id": 6116,
    "mediaId": 2629,
    "date": "2022-04-11",
    "sentence": "And Petrizzo notes that Trump, by endorsing Oz, has “ignited fury and ridicule among some of the loudest voices in Trumpworld.”\n“At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy’ America First’ Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump Administration official Hope Hicks by his side,” Petrizzo explains.",
    "author": "Alex Henderson",
    "title": "Trump Endorsement Of Dr Oz Enrages ‘MAGA’ Followers"
  },
  {
    "id": 5846,
    "mediaId": 2522,
    "date": "2022-04-13",
    "sentence": "Ingraham was critical of the endorsement, calling it a “mistake.” She asked Conway, who endorsed Republican <span class='selected-term'>Dave McCormick</span> in Pennsylvania, if it was an error by Trump and Hannity to endorse Oz several times.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Laura Ingraham unafraid to hit Trump and Hannity for endorsing Dr. Oz: ‘I’ll say it…it was a mistake’"
  },
  {
    "id": 5435,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "why haven't some of these people realized that it is futile to second guess our duly elected President, Donald J. Trump because ... he is right, has always been right and will continue to be right on anything and everything he ever says and / or does - wake up you foolish people and recognize we are privileged to live at a time when such a human being is amongst us - he will lead us to greatness for everybody even those who denied him and made foolish remarks and statements about him\nFTA: \"But everyone needs to take a deep breath and understand that Oz is 10 times better than former hedgefund CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Ned Ryun",
    "title": "Trump Had Every Reason to Endorse Dr. Oz"
  },
  {
    "id": 6214,
    "mediaId": 8254,
    "date": "2022-04-14",
    "sentence": "In the Republican primary field, there is no clear front-runner at the moment with Mehmet Oz sitting at 16% and <span class='selected-term'>Dave McCormick</span> coming in with 15%.",
    "author": "Lauren Rude",
    "title": "Nearly half of voters say they will vote for Republican Congress candidate: Franklin & Marshall poll"
  },
  {
    "id": 6026,
    "mediaId": 2934,
    "date": "2022-04-15",
    "sentence": "Amid nationwide protests after George Floyd’s murder in 2020, <span class='selected-term'>Dave McCormick</span>, then CEO of a hedge fund, emailed his colleagues, calling on them to “be agents of change” and to show “solidarity by denouncing and eradicating structural bigotry around us.”\nA new ad from a super PAC supporting McCormick’s chief rival in the Republican primary for U.S. Senate in Pennsylvania cites that email as evidence that “McCormick’s woke Connecticut hedge fund supported Black Lives Matter.” But the letter did not mention Black Lives Matter, and it expressed concern not only about racial discrimination and bigotry, but also about “rioting and destruction on city streets across the country.”\nMcCormick campaign spokesperson Jess Szymanski told us that “like President Trump and others,” McCormick was merely “a leader who provided reflections following the death of George Floyd,” and that “Dave never supported BLM and has always stood with law enforcement as a strong law and order candidate.”\nThere’s little mystery why McCormick’s opponents would want to tie him to the Black Lives Matter movement.",
    "author": "Robert Farley",
    "title": "McCormick’s Denouncement of ‘Structural Bigotry’ Not an Endorsement of BLM"
  },
  {
    "id": 5752,
    "mediaId": 2539,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania’s Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz has close ties to the wealthy du Pont family heirs, and they’re backing his GOP bid for Pennsylvania’s Senate seat"
  },
  {
    "id": 5274,
    "mediaId": 6571,
    "date": "2022-04-19",
    "sentence": "Donald Trump or <span class='selected-term'>Dave McCormick</span>?",
    "author": "Jon Delano",
    "title": "David McCormick reacts to Trump's endorsement of Mehmet Oz and denies shipping jobs to China"
  },
  {
    "id": 4701,
    "mediaId": 8380,
    "date": "2022-04-22",
    "sentence": "Other Republicans running for Senate are Kathy Barnette, Jeff Bartos, George Bochetto, Sean Gale, <span class='selected-term'>Dave McCormick</span> and Carla Sands.",
    "author": "Lauren Mayk",
    "title": "Will Trump's Endorsement Push Voters to Oz in Pa. Senate Race? Here's What They Say"
  },
  {
    "id": 4649,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  },
  {
    "id": 5145,
    "mediaId": 8404,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "Lauren Rude",
    "title": "Pennsylvania GOP Senate Debate turns ugly as candidates throw jabs"
  },
  {
    "id": 5107,
    "mediaId": 8504,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  }
]