[
  {
    "id": 2861,
    "mediaId": 6571,
    "date": "2022-01-31",
    "sentence": "In her race for the Senate, Barnette calls her three fellow Republicans who recently moved into the state to run – <span class='selected-term'>Dave McCormick</span>, Carla Sands and Mehmet Oz – \"carpetbaggers,\" and then she adds, \"We don't need to send another rich person to D.C. to represent our interests.",
    "author": "",
    "title": "Kathy Barnette Hopes To Become US Senate's First Black Republican Woman"
  },
  {
    "id": 931,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "Watch us stand up to Joe Biden below: #PASen https://t.co/vMqEcQEAqX\n— <span class='selected-term'>Dave McCormick</span> (@DaveMcCormickPA) February 14, 2022",
    "author": "Valerie Richardson",
    "title": "‘Let’s Go, Brandon’ ad airs during Super Bowl in Pennsylvania"
  },
  {
    "id": 15311,
    "mediaId": 8254,
    "date": "2022-03-10",
    "sentence": "A recent Fox News poll found Bartos with 9% support from Pennsylvanian Republican voters, tying him with Kathy Barnette for third behind <span class='selected-term'>Dave McCormick</span> and Dr. Mehmet Oz.",
    "author": "George Stockburger",
    "title": "Pa. Senate candidate Jeff Bartos reaches petition requirement"
  },
  {
    "id": 9193,
    "mediaId": 2630,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "GOP rivals pile on 'Dr. Oz' during forum for Pennsylvania Senate candidates"
  },
  {
    "id": 7633,
    "mediaId": 6570,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Julian Routh",
    "title": "GOP Senate candidate Dave McCormick sees Pennsylvania's natural gas as driver of state's economy"
  },
  {
    "id": 5438,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Trump’s endorsement comes two days after a The Hill/Emerson College poll found Oz and hedge fund manager <span class='selected-term'>Dave McCormick</span> to be neck-and-neck ahead of the May 17 primary.",
    "author": "Katherine Huggins",
    "title": "Trump Backs Dr. Oz’s Pennsylvania Senate Bid, Cites Doc’s Diagnosis That He’s in ‘Extraordinary Health’ in Glowing Endorsement"
  },
  {
    "id": 5023,
    "mediaId": 8393,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "George Stockburger",
    "title": "Pennsylvania Senate Race Debate: Republican candidates face-off"
  },
  {
    "id": 5107,
    "mediaId": 8504,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  },
  {
    "id": 5145,
    "mediaId": 8404,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "Lauren Rude",
    "title": "Pennsylvania GOP Senate Debate turns ugly as candidates throw jabs"
  },
  {
    "id": 4629,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "In a race for a seat that could help determine the balance of power in the Senate, Oz and former hedge fund CEO <span class='selected-term'>Dave McCormick</span> are at the top of the GOP primary polls.",
    "author": "Austin Kellerman",
    "title": "What to watch for in Dr. Oz’s first televised Senate debate"
  }
]