[
  {
    "id": 2691,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "Ron DeSantis’ PAC and into Honor Pennsylvania, a super PAC backing fellow hedge funder <span class='selected-term'>Dave McCormick</span> — and opposing celebrity physician Mehmet Oz — in Pennsylvania’s GOP Senate primary, making Griffin the biggest individual donor to those two groups so far.",
    "author": "",
    "title": "The Republican megadonor funding the party’s 2022 hopes"
  },
  {
    "id": 991,
    "mediaId": 2590,
    "date": "2022-02-17",
    "sentence": "Advertisement\nIn the contest for the GOP nomination, Oz has several rivals: Kathy Barnette, a conservative commentator; Jeff Bartos, a real estate developer who ran unsuccessfully for lieutenant governor; <span class='selected-term'>Dave McCormick</span>, a former hedge fund CEO; and Carla Sands, Donald Trump’s ambassador to Denmark.",
    "author": "Liz Skalka",
    "title": "Inside Dr. Oz's Campaign Road Show"
  },
  {
    "id": 936,
    "mediaId": 8254,
    "date": "2022-02-18",
    "sentence": "Candidates Jeff Bartos and Kathy Barnette had the opportunity to reach the voters who have been bombarded by TV ads from their opponents Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>.",
    "author": "Jordan Tracy",
    "title": "Four GOP candidates for US Senate meet in Blair County"
  },
  {
    "id": 884,
    "mediaId": 2572,
    "date": "2022-02-18",
    "sentence": "And the Oz campaign added that they were \"not aware of why <span class='selected-term'>Dave McCormick</span> decided to back out after committing\"\nNEW PUNCHES THROWN IN CHINA FISTFIGHT BETWEEN DR. OZ AND DAVID MCCORMICK\nThe McCormick campaign told Fox News that the former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official who entered the race last month \"is looking forward to debating.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania GOP Senate clash: Bartos takes aim at Oz, McCormick for skipping debate"
  },
  {
    "id": 1122,
    "mediaId": 2730,
    "date": "2022-02-18",
    "sentence": "— Holly Otterbein (@hollyotterbein) February 17, 2022\nPOLITICO's Holly Otterbein tweeted on Thursday that Senatorial candidate <span class='selected-term'>Dave McCormick</span> pulled out of a GOP debate for Monday, February 21, after he learned Dr. Mehmet Oz would not be attending.",
    "author": "Rebecca Downs",
    "title": "Out of State Candidates Refuse to Show Up for Senate GOP Debate in Key Battleground State"
  },
  {
    "id": 50,
    "mediaId": 2590,
    "date": "2022-02-26",
    "sentence": "Advertisement\nIn this 2022 photo combination shown are Republican Pennsylvania U.S. Senate candidates, <span class='selected-term'>Dave McCormick</span>, left and Mehmet Oz.",
    "author": "Jeff McMillan and Marc Levy",
    "title": "In Trans People, GOP Candidates Find Latest 'Wedge Issue'"
  },
  {
    "id": 17,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "Oz is in a crowded GOP race that also includes top rivals such as <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Jeff Bartos, a real estate developer, philanthropist and the 2018 Republican nominee for lieutenant governor; and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump.",
    "author": "Paul Steinhauser",
    "title": "Dr. Oz says his celebrity 'a huge advantage' as he runs for Senate; says he's 'aligned' with GOP voters"
  },
  {
    "id": 12496,
    "mediaId": 2573,
    "date": "2022-02-27",
    "sentence": "Among his top rivals in the GOP Senate primary are Mehmet Oz, the well-known celebrity physician, cardiac surgeon, author and former longtime host of TV’s popular \"Dr. Oz Show;\" <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump; and veteran and conservative political commentator Kathy Barnette.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania Senate clash: Bartos showcases ‘strongest grassroots army’ in GOP primary race"
  },
  {
    "id": 12476,
    "mediaId": 8322,
    "date": "2022-03-01",
    "sentence": "The state’s GOP primary is one of the most hotly contested and most-watched of the cycle, as Oz faces off against a crowded field of Republicans, including former hedge fund CEO and veteran <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brooke Singman",
    "title": "Dr. Oz says COVID-19 'steeled' him to run for office, calls on Fauci to resign"
  },
  {
    "id": 10834,
    "mediaId": 2553,
    "date": "2022-03-16",
    "sentence": "And my failing RINO opponent <span class='selected-term'>Dave McCormick</span> is lying about me leaving the race after being exposed by Philly Inquirer.https://t.co/L0DgP6WMGC\n— Dr. Mehmet Oz (@DrOz) March 16, 2022\nOz’s linked a Philadelphia Inquirer article that claimed some of the donors helping McCormick to attack him are past donors of liberal Democrats, including Hillary Clinton’s 2016 presidential campaign.",
    "author": "Dillon Burroughs",
    "title": "‘I’m In To Win’: Dr. Oz Responds To Report Of TV Show Talks"
  },
  {
    "id": 10719,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "Dr Oz had been under fire from a primary opponent, <span class='selected-term'>Dave McCormick</span>, who charged that he could not serve in the upper chamber of the US legislature if he held “dual loyalties”.",
    "author": "Andrew Feinberg",
    "title": "Dr Oz reverses course on keeping Turkish citizenship if elected to Senate"
  },
  {
    "id": 11113,
    "mediaId": 2590,
    "date": "2022-03-16",
    "sentence": "In a heated campaign for an open Senate seat, Oz’s opponent, <span class='selected-term'>Dave McCormick</span>, called on Oz to renounce his dual citizenship and questioned why Oz didn’t serve in the U.S. military.",
    "author": "Liz Skalka",
    "title": "Mehmet Oz Says He'll Give Up Dual Citizenship If Elected To Senate"
  },
  {
    "id": 11555,
    "mediaId": 2540,
    "date": "2022-03-16",
    "sentence": "\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz said.",
    "author": "Alex Rogers and Michael Warren",
    "title": "Dr. Oz vows to renounce Turkish citizenship if elected to Senate"
  },
  {
    "id": 10699,
    "mediaId": 2572,
    "date": "2022-03-16",
    "sentence": "(McCormick Senate campaign)\n\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz told Fox News.",
    "author": "Brooke Singman",
    "title": "Dr. Oz will renounce his Turkish citizenship if elected to Senate: 'I will only be a U.S. citizen'"
  },
  {
    "id": 10857,
    "mediaId": 2748,
    "date": "2022-03-17",
    "sentence": "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S. senator for Pennsylvania I will only be a U.S. citizen.”\nOz called the attacks from his primary opponent, <span class='selected-term'>Dave McCormick</span>, “bigoted,” likening it to a time when Americans rejected Jews and Catholics.",
    "author": "Blarp Blog",
    "title": "Dr. Oz Flip Flops on Turkish Citizenship, Now Says He Will Renounce It if Elected"
  },
  {
    "id": 10698,
    "mediaId": 8322,
    "date": "2022-03-18",
    "sentence": "The campaign for <span class='selected-term'>Dave McCormick</span>, a Republican running against Oz, argued to Fox News Digital that the columns reflect a larger trend of anti-gun rhetoric from the Oz camp.",
    "author": "",
    "title": "Dr. Oz denies writing gun control advocacy columns, business partner claims authorship"
  },
  {
    "id": 9025,
    "mediaId": 2553,
    "date": "2022-03-21",
    "sentence": "“No one actually believes that he was so offended by the content of these columns that he waited until he was running for senate in a Republican primary to disown them.”\n<span class='selected-term'>Dave McCormick</span>, the leading Republican candidate in the race, slammed Oz, saying in a statement that Oz “has a long public record and history of being enthusiastically anti-Second Amendment.”\n“He has supported red flag laws and sided with extreme left gun grabbers to try to take away guns from Americans,” McCormick’s campaign continued.",
    "author": "Ryan Saavedra",
    "title": "Articles Surface Featuring Dr. Oz’s Name On Byline That Cheer Clamping Down On Second Amendment Rights"
  },
  {
    "id": 9077,
    "mediaId": 8484,
    "date": "2022-03-24",
    "sentence": "+16\nView gallery\n+16\nView gallery\nDr. Mehmet Oz (left) launched a new attack ad against Pennsylvania Senate rival <span class='selected-term'>Dave McCormick</span> (right) that calls him out for being a 'finance bro,' a carpetbagger and too cozy with China\n+16\nView gallery\nThe ad debuted Wednesday and featured two vest-wearing, hard seltzer-drinking 'bros' named Tad and Chad, who called McCormick - a former hedge fund manager - their 'hero'\n+16\nView gallery\n'He's the wolf of Westport, Connecticut,' Chad says of McCormick, who was born in Pennsylvania, but has lived in the ritzy New York City exurb since 2009\n+16\nView gallery\nTWINNING: Chad and Tad have a picture of Republican Pennsylvania Senate hopeful Dave McCormick next to them - and they're all wearing the same outfit\n+16\nView gallery\nThe ad uses imagery connecting Dave McCormick (left) with Chinese President Xi Jinping (right)\n+16\nView gallery\nThe 'bros' pound hard seltzer in the ad and ask if Dave McCormick is forced to drink Yuengling, a Pennsylvania-made beer\n+16\nView gallery\nThe ad wraps up with more images of Chinese President Xi Jinping (left) and Pennsylvania Senate hopeful Dave McCormick (right)\nChad laughs that McCormick is 'pitching the locals he's one of them,' while Tad chimes in that, 'Pennsylvanians are fools.'",
    "author": "Nikki Schwab",
    "title": "Dr Oz. releases bizarre attack ad on opponent David McCormick mocking hard seltzer, vests and 'finance bros' - claiming he puts China over voters in Pennsylvania"
  },
  {
    "id": 11719,
    "mediaId": 8254,
    "date": "2022-03-24",
    "sentence": "A Fox News poll released in early March showed Oz second in the Senate race behind former hedge fund CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "George Stockburger",
    "title": "Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 8931,
    "mediaId": 2526,
    "date": "2022-03-25",
    "sentence": "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S. senator for Pennsylvania I will only be a U.S. citizen.”\nOz called the attacks from his primary opponent, <span class='selected-term'>Dave McCormick</span>, “bigoted,” likening it to when Americans rejected Jews and Catholics.",
    "author": "Paul Bois",
    "title": "Enes Kanter Freedom: Dr. Oz Works for Turkish ‘Dictator’ Erdogan"
  },
  {
    "id": 8955,
    "mediaId": 2526,
    "date": "2022-03-30",
    "sentence": "During the Pennsylvania Republican Senate primary debate forum, frontrunner <span class='selected-term'>Dave McCormick</span>, saying that everyone should be held accountable for their past statements, confronted the celebrity doctor about his anti-fracking history over the years on his shows and in columns he has written.",
    "author": "Jacob Bliss",
    "title": "Mehmet Oz Has Meltdown During Live Debate When Confronted With Record, Called ‘Liberal’"
  },
  {
    "id": 9116,
    "mediaId": 2590,
    "date": "2022-03-30",
    "sentence": "Advertisement\nAt Wednesday’s forum, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> brought up Oz’s past columns that caution against fracking, which Oz’s campaign claims were actually authored by someone else.",
    "author": "Liz Skalka",
    "title": "Mehmet Oz Goes Full Climate Denial, Says Carbon Dioxide Isn't A Problem"
  },
  {
    "id": 9193,
    "mediaId": 2630,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "GOP rivals pile on 'Dr. Oz' during forum for Pennsylvania Senate candidates"
  },
  {
    "id": 7274,
    "mediaId": 2572,
    "date": "2022-04-02",
    "sentence": "Celebrity physician-turned Senate candidate Dr. Mehmet Oz and several others at the conservative Pennsylvania Leadership Conference forum Saturday did not debate each other, but many took turns jabbing at <span class='selected-term'>Dave McCormick</span> over his wealth and alleged ties to China.",
    "author": "Thomas Phippen",
    "title": "Pennsylvania GOP Senate primary: Dr. Oz, other candidates swipe at absent McCormick during forum"
  },
  {
    "id": 5438,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Trump’s endorsement comes two days after a The Hill/Emerson College poll found Oz and hedge fund manager <span class='selected-term'>Dave McCormick</span> to be neck-and-neck ahead of the May 17 primary.",
    "author": "Katherine Huggins",
    "title": "Trump Backs Dr. Oz’s Pennsylvania Senate Bid, Cites Doc’s Diagnosis That He’s in ‘Extraordinary Health’ in Glowing Endorsement"
  },
  {
    "id": 5741,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "The endorsement came after months of behind-the-scenes jockeying by Oz and another leading candidate in Pennsylvania, <span class='selected-term'>Dave McCormick</span>, a hedge fund executive.",
    "author": "Sarah Fortinsky",
    "title": "Trump endorses Mehmet Oz in Pennsylvania Senate race"
  },
  {
    "id": 5518,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "Sunday morning, the campaign of billionaire <span class='selected-term'>Dave McCormick</span> released a statement from Santorum who stated, \"I know Pennsylvania and I know conservatives.",
    "author": "Tom Boggioni",
    "title": "Rick Santorum bucks Trump over Pennsylvania Senate seat endorsement: report"
  },
  {
    "id": 5312,
    "mediaId": 2621,
    "date": "2022-04-10",
    "sentence": "But that’s good enough for a close second place in a crowded Republican primary field, behind current frontrunner <span class='selected-term'>Dave McCormick</span> at 18 percent.",
    "author": "Joe DePaolo",
    "title": "Trump Beams About His Dr. Oz Endorsement at Rally: When You’re in TV for 18 Years, ‘That’s Like a Poll, That Means People Like You’"
  },
  {
    "id": 5425,
    "mediaId": 2578,
    "date": "2022-04-10",
    "sentence": "Dr. Oz is currently in a tight primary race with <span class='selected-term'>Dave McCormick</span> a former hedge fund manager.",
    "author": "Jim Hoft",
    "title": "President Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 5777,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration official Hope Hicks by his side.",
    "author": "Zachary Petrizzo",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 6065,
    "mediaId": 2873,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration officials Hope Hicks and Stephen Miller by his side.",
    "author": "",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 6116,
    "mediaId": 2629,
    "date": "2022-04-11",
    "sentence": "And Petrizzo notes that Trump, by endorsing Oz, has “ignited fury and ridicule among some of the loudest voices in Trumpworld.”\n“At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy’ America First’ Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump Administration official Hope Hicks by his side,” Petrizzo explains.",
    "author": "Alex Henderson",
    "title": "Trump Endorsement Of Dr Oz Enrages ‘MAGA’ Followers"
  },
  {
    "id": 5838,
    "mediaId": 2522,
    "date": "2022-04-11",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he’s the farthest thing from America First & he’d be very bad for PA https://t.co/kuTo4pp53U\n— Sean Parnell (@SeanParnellUSA) April 9, 2022\n<span class='selected-term'>Dave McCormick</span>, who is a former George W. Bush administration official and is married to Dina Powell, a former deputy national security adviser to Trump, was also in the running for his endorsement but did not get it even though he leads Oz, according to recent polls.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Conservatives react very badly to Donald Trump’s endorsement of Dr. Oz"
  },
  {
    "id": 5846,
    "mediaId": 2522,
    "date": "2022-04-13",
    "sentence": "Ingraham was critical of the endorsement, calling it a “mistake.” She asked Conway, who endorsed Republican <span class='selected-term'>Dave McCormick</span> in Pennsylvania, if it was an error by Trump and Hannity to endorse Oz several times.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Laura Ingraham unafraid to hit Trump and Hannity for endorsing Dr. Oz: ‘I’ll say it…it was a mistake’"
  },
  {
    "id": 5435,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "why haven't some of these people realized that it is futile to second guess our duly elected President, Donald J. Trump because ... he is right, has always been right and will continue to be right on anything and everything he ever says and / or does - wake up you foolish people and recognize we are privileged to live at a time when such a human being is amongst us - he will lead us to greatness for everybody even those who denied him and made foolish remarks and statements about him\nFTA: \"But everyone needs to take a deep breath and understand that Oz is 10 times better than former hedgefund CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Ned Ryun",
    "title": "Trump Had Every Reason to Endorse Dr. Oz"
  },
  {
    "id": 6214,
    "mediaId": 8254,
    "date": "2022-04-14",
    "sentence": "In the Republican primary field, there is no clear front-runner at the moment with Mehmet Oz sitting at 16% and <span class='selected-term'>Dave McCormick</span> coming in with 15%.",
    "author": "Lauren Rude",
    "title": "Nearly half of voters say they will vote for Republican Congress candidate: Franklin & Marshall poll"
  },
  {
    "id": 5844,
    "mediaId": 2801,
    "date": "2022-04-18",
    "sentence": "",
    "author": "MICHAEL RUBINKAM",
    "title": "Pa. Senate candidate McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 5925,
    "mediaId": 2680,
    "date": "2022-04-18",
    "sentence": "",
    "author": "MICHAEL RUBINKAM",
    "title": "Pa. Senate candidate McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 5879,
    "mediaId": 2732,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Associated Press",
    "title": "Pa. Senate candidate Dave McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 5110,
    "mediaId": 8469,
    "date": "2022-04-18",
    "sentence": "",
    "author": "MICHAEL RUBINKAM",
    "title": "Pa. Senate candidate McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 5582,
    "mediaId": 2632,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania's Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz Has Close Ties to the Wealthy Du Pont Family Heirs, and They're Backing His GOP Bid for Pennsylvania's Senate Seat"
  },
  {
    "id": 5274,
    "mediaId": 6571,
    "date": "2022-04-19",
    "sentence": "Donald Trump or <span class='selected-term'>Dave McCormick</span>?",
    "author": "Jon Delano",
    "title": "David McCormick reacts to Trump's endorsement of Mehmet Oz and denies shipping jobs to China"
  },
  {
    "id": 5752,
    "mediaId": 2539,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania’s Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz has close ties to the wealthy du Pont family heirs, and they’re backing his GOP bid for Pennsylvania’s Senate seat"
  },
  {
    "id": 5145,
    "mediaId": 8404,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "Lauren Rude",
    "title": "Pennsylvania GOP Senate Debate turns ugly as candidates throw jabs"
  },
  {
    "id": 5107,
    "mediaId": 8504,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  },
  {
    "id": 5023,
    "mediaId": 8393,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "George Stockburger",
    "title": "Pennsylvania Senate Race Debate: Republican candidates face-off"
  },
  {
    "id": 4649,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  },
  {
    "id": 4629,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "In a race for a seat that could help determine the balance of power in the Senate, Oz and former hedge fund CEO <span class='selected-term'>Dave McCormick</span> are at the top of the GOP primary polls.",
    "author": "Austin Kellerman",
    "title": "What to watch for in Dr. Oz’s first televised Senate debate"
  },
  {
    "id": 5011,
    "mediaId": 8481,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  },
  {
    "id": 4628,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "George Stockburger",
    "title": "Pennsylvania Senate Race Debate: Republican candidates face-off"
  }
]