[
  {
    "id": 118,
    "mediaId": 2572,
    "date": "2022-02-24",
    "sentence": "The latter, <span class='selected-term'>Dave McCormick</span>, joins me now.",
    "author": "",
    "title": "'The Ingraham Angle' on Biden admin on the ropes"
  },
  {
    "id": 15305,
    "mediaId": 8481,
    "date": "2022-03-04",
    "sentence": "SOMERSET COUNTY, Pa (WTAJ)– U.S Republican Senate Candidate <span class='selected-term'>Dave McCormick</span> made a pit stop at Guy Chemical Company in Somerset Friday to hear more from Pennsylvanian voters.",
    "author": "Courtney Murphy",
    "title": "Dave McCormick makes stop in Somerset to hear voters"
  },
  {
    "id": 9077,
    "mediaId": 8484,
    "date": "2022-03-24",
    "sentence": "+16\nView gallery\n+16\nView gallery\nDr. Mehmet Oz (left) launched a new attack ad against Pennsylvania Senate rival <span class='selected-term'>Dave McCormick</span> (right) that calls him out for being a 'finance bro,' a carpetbagger and too cozy with China\n+16\nView gallery\nThe ad debuted Wednesday and featured two vest-wearing, hard seltzer-drinking 'bros' named Tad and Chad, who called McCormick - a former hedge fund manager - their 'hero'\n+16\nView gallery\n'He's the wolf of Westport, Connecticut,' Chad says of McCormick, who was born in Pennsylvania, but has lived in the ritzy New York City exurb since 2009\n+16\nView gallery\nTWINNING: Chad and Tad have a picture of Republican Pennsylvania Senate hopeful Dave McCormick next to them - and they're all wearing the same outfit\n+16\nView gallery\nThe ad uses imagery connecting Dave McCormick (left) with Chinese President Xi Jinping (right)\n+16\nView gallery\nThe 'bros' pound hard seltzer in the ad and ask if Dave McCormick is forced to drink Yuengling, a Pennsylvania-made beer\n+16\nView gallery\nThe ad wraps up with more images of Chinese President Xi Jinping (left) and Pennsylvania Senate hopeful Dave McCormick (right)\nChad laughs that McCormick is 'pitching the locals he's one of them,' while Tad chimes in that, 'Pennsylvanians are fools.'",
    "author": "Nikki Schwab",
    "title": "Dr Oz. releases bizarre attack ad on opponent David McCormick mocking hard seltzer, vests and 'finance bros' - claiming he puts China over voters in Pennsylvania"
  },
  {
    "id": 5274,
    "mediaId": 6571,
    "date": "2022-04-19",
    "sentence": "Donald Trump or <span class='selected-term'>Dave McCormick</span>?",
    "author": "Jon Delano",
    "title": "David McCormick reacts to Trump's endorsement of Mehmet Oz and denies shipping jobs to China"
  },
  {
    "id": 4905,
    "mediaId": 8493,
    "date": "2022-04-20",
    "sentence": "The nation is watching us work to reclaim the greatness of our country, and sending someone, someone like <span class='selected-term'>Dave McCormick</span>, to Washington, D.C. is something you can be proud of.",
    "author": "WKOK Staff",
    "title": "McCormick Rally with Sec. Pompeo: America Headed ‘Wrong Direction’"
  }
]