[
  {
    "id": 3561,
    "mediaId": 2658,
    "date": "2022-01-18",
    "sentence": "In the crowded race to replace retiring Sen. Pat Toomey (R-Pa.), conservative commentator Kathy Barnette came in second place, while the poll showed hedge fund executive <span class='selected-term'>Dave McCormick</span> in third place.",
    "author": "",
    "title": "Governors get in on redistricting"
  },
  {
    "id": 2861,
    "mediaId": 6571,
    "date": "2022-01-31",
    "sentence": "In her race for the Senate, Barnette calls her three fellow Republicans who recently moved into the state to run – <span class='selected-term'>Dave McCormick</span>, Carla Sands and Mehmet Oz – \"carpetbaggers,\" and then she adds, \"We don't need to send another rich person to D.C. to represent our interests.",
    "author": "",
    "title": "Kathy Barnette Hopes To Become US Senate's First Black Republican Woman"
  },
  {
    "id": 2734,
    "mediaId": 2662,
    "date": "2022-01-31",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "Cassandra Fairbanks",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 3066,
    "mediaId": 2748,
    "date": "2022-02-01",
    "sentence": "“<span class='selected-term'>Dave McCormick</span> has been quoted bashing populism, celebrating skilled immigration and even warning about the potential drawbacks of an ‘America First’ mindset.",
    "author": "STATION GOSSIP",
    "title": "Establishment GOP PA Senate Candidate David McCormick Hosts Fundraiser With Dominion PR Rep"
  },
  {
    "id": 2865,
    "mediaId": 2918,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Natalie Winters",
    "title": "A Dominion Voting Systems Rep is Sponsoring a Republican Senate Campaign Fundraiser."
  },
  {
    "id": 1686,
    "mediaId": 8254,
    "date": "2022-02-11",
    "sentence": "MIDSTATE, Pa. (WHTM) — <span class='selected-term'>Dave McCormick</span>, Senate candidate for Pennsylvania’s open seat, made several campaign stops in the Midstate Friday, kicking it off at the U.S. Army Heritage and Education Center in Carlisle.",
    "author": "Lauren Rude",
    "title": "Senate candidate McCormick makes campaign stops in the Midstate"
  },
  {
    "id": 1635,
    "mediaId": 2522,
    "date": "2022-02-13",
    "sentence": "",
    "author": "Joshua Nybo",
    "title": "Penn. Senate candidate to run ‘Let’s Go Brandon’ ad during Super Bowl to highlight Biden failings"
  },
  {
    "id": 1022,
    "mediaId": 2781,
    "date": "2022-02-14",
    "sentence": "Republican candidate for U.S. Senate in Pennsylvania <span class='selected-term'>Dave McCormick</span> is running a “Let’s go Brandon” Super Bowl ad Sunday, highlighting the “self-inflicted” problems facing President Biden and his administration.",
    "author": "Fox News",
    "title": "WATCH: Senate Hopeful Torches Biden’s Super Bowl-Sized Fails in ‘Let’s Go Brandon’ Ad"
  },
  {
    "id": 1122,
    "mediaId": 2730,
    "date": "2022-02-18",
    "sentence": "— Holly Otterbein (@hollyotterbein) February 17, 2022\nPOLITICO's Holly Otterbein tweeted on Thursday that Senatorial candidate <span class='selected-term'>Dave McCormick</span> pulled out of a GOP debate for Monday, February 21, after he learned Dr. Mehmet Oz would not be attending.",
    "author": "Rebecca Downs",
    "title": "Out of State Candidates Refuse to Show Up for Senate GOP Debate in Key Battleground State"
  },
  {
    "id": 936,
    "mediaId": 8254,
    "date": "2022-02-18",
    "sentence": "Candidates Jeff Bartos and Kathy Barnette had the opportunity to reach the voters who have been bombarded by TV ads from their opponents Dr. Mehmet Oz and <span class='selected-term'>Dave McCormick</span>.",
    "author": "Jordan Tracy",
    "title": "Four GOP candidates for US Senate meet in Blair County"
  },
  {
    "id": 884,
    "mediaId": 2572,
    "date": "2022-02-18",
    "sentence": "And the Oz campaign added that they were \"not aware of why <span class='selected-term'>Dave McCormick</span> decided to back out after committing\"\nNEW PUNCHES THROWN IN CHINA FISTFIGHT BETWEEN DR. OZ AND DAVID MCCORMICK\nThe McCormick campaign told Fox News that the former hedge fund executive, West Point graduate, Gulf War combat veteran and Treasury Department official who entered the race last month \"is looking forward to debating.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania GOP Senate clash: Bartos takes aim at Oz, McCormick for skipping debate"
  },
  {
    "id": 16,
    "mediaId": 2572,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "PA Republican Senate candidate McCormick calls Putin 'tyrant' who 'needs to be kept in check'"
  },
  {
    "id": 17,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "Oz is in a crowded GOP race that also includes top rivals such as <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Jeff Bartos, a real estate developer, philanthropist and the 2018 Republican nominee for lieutenant governor; and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump.",
    "author": "Paul Steinhauser",
    "title": "Dr. Oz says his celebrity 'a huge advantage' as he runs for Senate; says he's 'aligned' with GOP voters"
  },
  {
    "id": 12496,
    "mediaId": 2573,
    "date": "2022-02-27",
    "sentence": "Among his top rivals in the GOP Senate primary are Mehmet Oz, the well-known celebrity physician, cardiac surgeon, author and former longtime host of TV’s popular \"Dr. Oz Show;\" <span class='selected-term'>Dave McCormick</span>, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump; and veteran and conservative political commentator Kathy Barnette.",
    "author": "Paul Steinhauser",
    "title": "Pennsylvania Senate clash: Bartos showcases ‘strongest grassroots army’ in GOP primary race"
  },
  {
    "id": 17194,
    "mediaId": 8254,
    "date": "2022-02-28",
    "sentence": "(WHTM) — <span class='selected-term'>Dave McCormick</span>, who is running for United States Senate in Pennsylvania, continues his campaign in York and Lancaster on Monday, Feb. 28.",
    "author": "",
    "title": "U.S. Senate candidate Dave McCormick to visit the Midstate"
  },
  {
    "id": 15522,
    "mediaId": 8254,
    "date": "2022-03-09",
    "sentence": "(WHTM) – A new Fox News poll shows former hedge fund CEO <span class='selected-term'>Dave McCormick</span> taking a nine point lead in the race to represent Pennsylvania in the United States Senate.",
    "author": "George Stockburger",
    "title": "McCormick, Oz lead Fox News Poll of Pa. Senate race"
  },
  {
    "id": 15220,
    "mediaId": 8254,
    "date": "2022-03-10",
    "sentence": "DAUPHIN COUNTY, Pa. (WHTM) — <span class='selected-term'>Dave McCormick</span>, candidate for Pennsylvania’s open seat in the United States Senate, is making his way to campaign in Dauphin County on Friday, March 11.",
    "author": "Lauren Rude",
    "title": "Senate candidate Dave McCormick to visit Dauphin County"
  },
  {
    "id": 15311,
    "mediaId": 8254,
    "date": "2022-03-10",
    "sentence": "A recent Fox News poll found Bartos with 9% support from Pennsylvanian Republican voters, tying him with Kathy Barnette for third behind <span class='selected-term'>Dave McCormick</span> and Dr. Mehmet Oz.",
    "author": "George Stockburger",
    "title": "Pa. Senate candidate Jeff Bartos reaches petition requirement"
  },
  {
    "id": 15278,
    "mediaId": 8254,
    "date": "2022-03-12",
    "sentence": "HUMMELSTOWN, Pa. (WHTM) — Republican Senate Candidate <span class='selected-term'>Dave McCormick</span> made a local campaign stop on Friday, March 11.",
    "author": "James Wesser",
    "title": "Senate candidate Dave McCormick stops in Hummelstown"
  },
  {
    "id": 10969,
    "mediaId": 2664,
    "date": "2022-03-14",
    "sentence": "Republicans have spent a record $35 million on TV ads in Pennsylvania, where frontrunners Mehmet Oz and <span class='selected-term'>Dave McCormick</span> are bashing one another as a “liberal RINO” and “Wall Street insider,” respectively, in attacks that could be used against them again in a general election.",
    "author": "Travis Gettys",
    "title": "Republicans 'kick the crap out of each other' in brutal primaries as Democrats sit back and watch"
  },
  {
    "id": 11276,
    "mediaId": 6570,
    "date": "2022-03-14",
    "sentence": "",
    "author": "Jonathan Tamari",
    "title": "Dave McCormick has dropped millions into Pa.'s U.S. Senate race, but it's hard to trace where it's coming from"
  },
  {
    "id": 11555,
    "mediaId": 2540,
    "date": "2022-03-16",
    "sentence": "\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz said.",
    "author": "Alex Rogers and Michael Warren",
    "title": "Dr. Oz vows to renounce Turkish citizenship if elected to Senate"
  },
  {
    "id": 11113,
    "mediaId": 2590,
    "date": "2022-03-16",
    "sentence": "In a heated campaign for an open Senate seat, Oz’s opponent, <span class='selected-term'>Dave McCormick</span>, called on Oz to renounce his dual citizenship and questioned why Oz didn’t serve in the U.S. military.",
    "author": "Liz Skalka",
    "title": "Mehmet Oz Says He'll Give Up Dual Citizenship If Elected To Senate"
  },
  {
    "id": 10719,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "Dr Oz had been under fire from a primary opponent, <span class='selected-term'>Dave McCormick</span>, who charged that he could not serve in the upper chamber of the US legislature if he held “dual loyalties”.",
    "author": "Andrew Feinberg",
    "title": "Dr Oz reverses course on keeping Turkish citizenship if elected to Senate"
  },
  {
    "id": 10699,
    "mediaId": 2572,
    "date": "2022-03-16",
    "sentence": "(McCormick Senate campaign)\n\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz told Fox News.",
    "author": "Brooke Singman",
    "title": "Dr. Oz will renounce his Turkish citizenship if elected to Senate: 'I will only be a U.S. citizen'"
  },
  {
    "id": 10857,
    "mediaId": 2748,
    "date": "2022-03-17",
    "sentence": "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S. senator for Pennsylvania I will only be a U.S. citizen.”\nOz called the attacks from his primary opponent, <span class='selected-term'>Dave McCormick</span>, “bigoted,” likening it to a time when Americans rejected Jews and Catholics.",
    "author": "Blarp Blog",
    "title": "Dr. Oz Flip Flops on Turkish Citizenship, Now Says He Will Renounce It if Elected"
  },
  {
    "id": 9216,
    "mediaId": 2732,
    "date": "2022-03-19",
    "sentence": "He had just spent about an hour listening to Republican U.S. Senate candidate <span class='selected-term'>Dave McCormick</span> as he addressed several dozen people in a private room, talking about his qualifications and what separates him from the rest of the crowded primary field.",
    "author": "Paula Reed Ward",
    "title": "Republican U.S. Senate candidate Dave McCormick greets potential voters in Murrysville"
  },
  {
    "id": 12260,
    "mediaId": 8483,
    "date": "2022-03-21",
    "sentence": "",
    "author": "Matt Barcaro",
    "title": "Ad Watch: Fact-checking ad attacking Republican US Senate candidate Dave McCormick"
  },
  {
    "id": 8931,
    "mediaId": 2526,
    "date": "2022-03-25",
    "sentence": "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S. senator for Pennsylvania I will only be a U.S. citizen.”\nOz called the attacks from his primary opponent, <span class='selected-term'>Dave McCormick</span>, “bigoted,” likening it to when Americans rejected Jews and Catholics.",
    "author": "Paul Bois",
    "title": "Enes Kanter Freedom: Dr. Oz Works for Turkish ‘Dictator’ Erdogan"
  },
  {
    "id": 9193,
    "mediaId": 2630,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "GOP rivals pile on 'Dr. Oz' during forum for Pennsylvania Senate candidates"
  },
  {
    "id": 9116,
    "mediaId": 2590,
    "date": "2022-03-30",
    "sentence": "Advertisement\nAt Wednesday’s forum, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> brought up Oz’s past columns that caution against fracking, which Oz’s campaign claims were actually authored by someone else.",
    "author": "Liz Skalka",
    "title": "Mehmet Oz Goes Full Climate Denial, Says Carbon Dioxide Isn't A Problem"
  },
  {
    "id": 9974,
    "mediaId": 8254,
    "date": "2022-03-30",
    "sentence": "The four candidates — Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span> and Dr. Mehmet Oz — took part in the live forum from 9 to 10 a.m. on Wednesday, March 30.",
    "author": "Anna Ashcraft",
    "title": "GOP Senate candidates take part in live forum"
  },
  {
    "id": 9842,
    "mediaId": 8254,
    "date": "2022-03-31",
    "sentence": "According to the Pittsburgh Post-Gazette, Parnell endorsed Senate candidate <span class='selected-term'>Dave McCormick</span> and appeared with him at a March 15 event in Homestead, Pa.",
    "author": "George Stockburger",
    "title": "Sean Parnell, former Senate candidate, endorses McSwain for Governor"
  },
  {
    "id": 7274,
    "mediaId": 2572,
    "date": "2022-04-02",
    "sentence": "Celebrity physician-turned Senate candidate Dr. Mehmet Oz and several others at the conservative Pennsylvania Leadership Conference forum Saturday did not debate each other, but many took turns jabbing at <span class='selected-term'>Dave McCormick</span> over his wealth and alleged ties to China.",
    "author": "Thomas Phippen",
    "title": "Pennsylvania GOP Senate primary: Dr. Oz, other candidates swipe at absent McCormick during forum"
  },
  {
    "id": 7626,
    "mediaId": 2629,
    "date": "2022-04-05",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> opposes increasing the federal minimum wage and wants to keep it at its current level of $7.25 an hour, set in 2009, when it was raised from $6.55.",
    "author": "Josh Israel",
    "title": "Super-Rich GOP Senate Candidate Says Keep Minimum Wage At $7.25"
  },
  {
    "id": 7633,
    "mediaId": 6570,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Julian Routh",
    "title": "GOP Senate candidate Dave McCormick sees Pennsylvania's natural gas as driver of state's economy"
  },
  {
    "id": 7085,
    "mediaId": 8322,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Trump suggests he’ll decide on Pennsylvania GOP Senate endorsement in ‘about a week’"
  },
  {
    "id": 5741,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "The endorsement came after months of behind-the-scenes jockeying by Oz and another leading candidate in Pennsylvania, <span class='selected-term'>Dave McCormick</span>, a hedge fund executive.",
    "author": "Sarah Fortinsky",
    "title": "Trump endorses Mehmet Oz in Pennsylvania Senate race"
  },
  {
    "id": 5438,
    "mediaId": 2621,
    "date": "2022-04-09",
    "sentence": "Trump’s endorsement comes two days after a The Hill/Emerson College poll found Oz and hedge fund manager <span class='selected-term'>Dave McCormick</span> to be neck-and-neck ahead of the May 17 primary.",
    "author": "Katherine Huggins",
    "title": "Trump Backs Dr. Oz’s Pennsylvania Senate Bid, Cites Doc’s Diagnosis That He’s in ‘Extraordinary Health’ in Glowing Endorsement"
  },
  {
    "id": 8431,
    "mediaId": 8483,
    "date": "2022-04-09",
    "sentence": "Ad Watch: Fact-checking ad attacking Republican US Senate candidate <span class='selected-term'>Dave McCormick</span>\nRecommended",
    "author": "Matt Barcaro",
    "title": "Ad Watch: Fact-checking ad claiming Republican US Senate candidate Dave McCormick paid for attacks on Donald Trump"
  },
  {
    "id": 5518,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "Sunday morning, the campaign of billionaire <span class='selected-term'>Dave McCormick</span> released a statement from Santorum who stated, \"I know Pennsylvania and I know conservatives.",
    "author": "Tom Boggioni",
    "title": "Rick Santorum bucks Trump over Pennsylvania Senate seat endorsement: report"
  },
  {
    "id": 5425,
    "mediaId": 2578,
    "date": "2022-04-10",
    "sentence": "Dr. Oz is currently in a tight primary race with <span class='selected-term'>Dave McCormick</span> a former hedge fund manager.",
    "author": "Jim Hoft",
    "title": "President Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 6065,
    "mediaId": 2873,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration officials Hope Hicks and Stephen Miller by his side.",
    "author": "",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 5777,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy “America First” Republican candidate, compared to fellow candidate <span class='selected-term'>Dave McCormick</span>, who has ex-Trump administration official Hope Hicks by his side.",
    "author": "Zachary Petrizzo",
    "title": "Trumpworld Goes Into Meltdown After Trump Endorses Dr. Oz"
  },
  {
    "id": 5846,
    "mediaId": 2522,
    "date": "2022-04-13",
    "sentence": "Ingraham was critical of the endorsement, calling it a “mistake.” She asked Conway, who endorsed Republican <span class='selected-term'>Dave McCormick</span> in Pennsylvania, if it was an error by Trump and Hannity to endorse Oz several times.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Laura Ingraham unafraid to hit Trump and Hannity for endorsing Dr. Oz: ‘I’ll say it…it was a mistake’"
  },
  {
    "id": 5844,
    "mediaId": 2801,
    "date": "2022-04-18",
    "sentence": "",
    "author": "MICHAEL RUBINKAM",
    "title": "Pa. Senate candidate McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 5879,
    "mediaId": 2732,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Associated Press",
    "title": "Pa. Senate candidate Dave McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 5925,
    "mediaId": 2680,
    "date": "2022-04-18",
    "sentence": "",
    "author": "MICHAEL RUBINKAM",
    "title": "Pa. Senate candidate McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 5110,
    "mediaId": 8469,
    "date": "2022-04-18",
    "sentence": "",
    "author": "MICHAEL RUBINKAM",
    "title": "Pa. Senate candidate McCormick earned $22M as hedge fund CEO"
  },
  {
    "id": 5582,
    "mediaId": 2632,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania's Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz Has Close Ties to the Wealthy Du Pont Family Heirs, and They're Backing His GOP Bid for Pennsylvania's Senate Seat"
  },
  {
    "id": 5752,
    "mediaId": 2539,
    "date": "2022-04-19",
    "sentence": "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania’s Senate seat with former Bridgewater CEO <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brian Schwartz",
    "title": "Dr. Oz has close ties to the wealthy du Pont family heirs, and they’re backing his GOP bid for Pennsylvania’s Senate seat"
  },
  {
    "id": 5735,
    "mediaId": 2539,
    "date": "2022-04-22",
    "sentence": "AP Photos\nWall Street executives are pouring millions of dollars into the Republican primary race for Pennsylvania’s open U.S. Senate seat — where veteran physician Dr. Mehmet Oz and former Bridgewater CEO <span class='selected-term'>Dave McCormick</span> lead in the polls — making the primary one of the most expensive in the 2022 midterm elections.",
    "author": "Brian Schwartz",
    "title": "Pennsylvania’s GOP Senate primary draws backing from some of Wall Street’s biggest billionaires, making it one of the most expensive midterm races"
  },
  {
    "id": 4701,
    "mediaId": 8380,
    "date": "2022-04-22",
    "sentence": "Other Republicans running for Senate are Kathy Barnette, Jeff Bartos, George Bochetto, Sean Gale, <span class='selected-term'>Dave McCormick</span> and Carla Sands.",
    "author": "Lauren Mayk",
    "title": "Will Trump's Endorsement Push Voters to Oz in Pa. Senate Race? Here's What They Say"
  },
  {
    "id": 5011,
    "mediaId": 8481,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  },
  {
    "id": 4649,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  },
  {
    "id": 4629,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "In a race for a seat that could help determine the balance of power in the Senate, Oz and former hedge fund CEO <span class='selected-term'>Dave McCormick</span> are at the top of the GOP primary polls.",
    "author": "Austin Kellerman",
    "title": "What to watch for in Dr. Oz’s first televised Senate debate"
  },
  {
    "id": 4628,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "George Stockburger",
    "title": "Pennsylvania Senate Race Debate: Republican candidates face-off"
  },
  {
    "id": 5107,
    "mediaId": 8504,
    "date": "2022-04-24",
    "sentence": "In a race expected to help determine the balance of power in the Senate, former hedge fund CEO <span class='selected-term'>Dave McCormick</span> and celebrity physician Mehmet Oz are at the top of the polls.",
    "author": "Austin Kellerman",
    "title": "4 things to watch for in the Pennsylvania GOP Senate Debate"
  },
  {
    "id": 5145,
    "mediaId": 8404,
    "date": "2022-04-24",
    "sentence": "Kathy Barnette, Jeff Bartos, <span class='selected-term'>Dave McCormick</span>, Mehmet Oz, and Carla Sands will appear in the Pennsylvania Republican U.S. Senate debate on April 25 at 8 p.m. in a one-hour prime-time event airing in every market in the commonwealth.",
    "author": "Lauren Rude",
    "title": "Pennsylvania GOP Senate Debate turns ugly as candidates throw jabs"
  }
]