[
  {
    "id": 2861,
    "mediaId": 6571,
    "date": "2022-01-31",
    "sentence": "In her race for the Senate, Barnette calls her three fellow Republicans who recently moved into the state to run – <span class='selected-term'>Dave McCormick</span>, Carla Sands and Mehmet Oz – \"carpetbaggers,\" and then she adds, \"We don't need to send another rich person to D.C. to represent our interests.",
    "author": "",
    "title": "Kathy Barnette Hopes To Become US Senate's First Black Republican Woman"
  },
  {
    "id": 1789,
    "mediaId": 2572,
    "date": "2022-02-04",
    "sentence": "Pennsylvania Republican Senate candidate <span class='selected-term'>Dave McCormick</span> said that the state's working families \"are being terribly damaged by the policies of the Biden administration\" Friday on \"The Story with Martha MacCallum.\"",
    "author": "",
    "title": "Working families 'being terribly damaged' by the Biden administration: Dave McCormick"
  },
  {
    "id": 12476,
    "mediaId": 8322,
    "date": "2022-03-01",
    "sentence": "The state’s GOP primary is one of the most hotly contested and most-watched of the cycle, as Oz faces off against a crowded field of Republicans, including former hedge fund CEO and veteran <span class='selected-term'>Dave McCormick</span>.",
    "author": "Brooke Singman",
    "title": "Dr. Oz says COVID-19 'steeled' him to run for office, calls on Fauci to resign"
  },
  {
    "id": 11276,
    "mediaId": 6570,
    "date": "2022-03-14",
    "sentence": "",
    "author": "Jonathan Tamari",
    "title": "Dave McCormick has dropped millions into Pa.'s U.S. Senate race, but it's hard to trace where it's coming from"
  },
  {
    "id": 11555,
    "mediaId": 2540,
    "date": "2022-03-16",
    "sentence": "\"The bigoted attacks my opponent <span class='selected-term'>Dave McCormick</span> has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,\" Oz said.",
    "author": "Alex Rogers and Michael Warren",
    "title": "Dr. Oz vows to renounce Turkish citizenship if elected to Senate"
  },
  {
    "id": 11113,
    "mediaId": 2590,
    "date": "2022-03-16",
    "sentence": "In a heated campaign for an open Senate seat, Oz’s opponent, <span class='selected-term'>Dave McCormick</span>, called on Oz to renounce his dual citizenship and questioned why Oz didn’t serve in the U.S. military.",
    "author": "Liz Skalka",
    "title": "Mehmet Oz Says He'll Give Up Dual Citizenship If Elected To Senate"
  },
  {
    "id": 10719,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "Dr Oz had been under fire from a primary opponent, <span class='selected-term'>Dave McCormick</span>, who charged that he could not serve in the upper chamber of the US legislature if he held “dual loyalties”.",
    "author": "Andrew Feinberg",
    "title": "Dr Oz reverses course on keeping Turkish citizenship if elected to Senate"
  },
  {
    "id": 10857,
    "mediaId": 2748,
    "date": "2022-03-17",
    "sentence": "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S. senator for Pennsylvania I will only be a U.S. citizen.”\nOz called the attacks from his primary opponent, <span class='selected-term'>Dave McCormick</span>, “bigoted,” likening it to a time when Americans rejected Jews and Catholics.",
    "author": "Blarp Blog",
    "title": "Dr. Oz Flip Flops on Turkish Citizenship, Now Says He Will Renounce It if Elected"
  },
  {
    "id": 9025,
    "mediaId": 2553,
    "date": "2022-03-21",
    "sentence": "“No one actually believes that he was so offended by the content of these columns that he waited until he was running for senate in a Republican primary to disown them.”\n<span class='selected-term'>Dave McCormick</span>, the leading Republican candidate in the race, slammed Oz, saying in a statement that Oz “has a long public record and history of being enthusiastically anti-Second Amendment.”\n“He has supported red flag laws and sided with extreme left gun grabbers to try to take away guns from Americans,” McCormick’s campaign continued.",
    "author": "Ryan Saavedra",
    "title": "Articles Surface Featuring Dr. Oz’s Name On Byline That Cheer Clamping Down On Second Amendment Rights"
  },
  {
    "id": 8955,
    "mediaId": 2526,
    "date": "2022-03-30",
    "sentence": "During the Pennsylvania Republican Senate primary debate forum, frontrunner <span class='selected-term'>Dave McCormick</span>, saying that everyone should be held accountable for their past statements, confronted the celebrity doctor about his anti-fracking history over the years on his shows and in columns he has written.",
    "author": "Jacob Bliss",
    "title": "Mehmet Oz Has Meltdown During Live Debate When Confronted With Record, Called ‘Liberal’"
  }
]