{
  "id": 3208,
  "mediaId": 6570,
  "date": "2022-03-17",
  "headline": "GOP governor candidate Lou Barletta says Pennsylvania could lead the way for U.S. energy independence",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/20181017JWLouBarletta04-3-1647558638.jpg",
  "link": "https://www.post-gazette.com/news/politics-state/2022/03/17/gop-governor-candidate-lou-barletta-pennsylvania-lead-energy-independence/stories/202203170157",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julian Routh",
  "authorUrl": "",
  "termIds": [
    2317,
    3975,
    878,
    4939,
    5239,
    5287,
    5371
  ],
  "sentences": [
    "With his comments, Mr. Barletta — the same candidate who’s repeatedly said that Pennsylvania, specifically, can be the “Saudi Arabia of the United States” if the government moves out of the way — joins a chorus of Republicans who say the U.S. should do more to increase domestic energy production as a way to help wean allies off Russian oil.",
    "“We’re going to unleash the natural gas to the market through green-lighting pipelines so that we can create not only good jobs here, but attract manufacturing jobs to Pennsylvania so that our children and grandchildren do not have to leave Pennsylvania to find a job,” Mr. Barletta said.",
    "Speaking to the Post-Gazette by phone on Thursday amid a four-day swing through Pittsburgh, Mr. Barletta blamed Democrats and President Joe Biden’s administration for weakening America’s energy exportation worldwide — a vacuum that Russian energy was able to fill, he claims.",
    "Former U.S. Rep. Lou Barletta, a leading contender for the GOP nomination in the Pennsylvania governor’s race, is hoisting up the economic impacts of Russia’s invasion into Ukraine as a portrait of why American energy independence is so important.",
    "“Our allies are now dependent on Russia instead of the United States … when we could be cutting off the source of Russia’s funding — mainly through energy — and it was, at one time, United States energy,” Mr. Barletta said.",
    "His energy platform consists of reforming the Department of Environmental Protection to speed up permitting and withdraw Pennsylvania from the Regional Greenhouse Gas Initiative, a multistate consortium.",
    "Delaware County businessman Dave White was in third in the poll at 14%, followed by former U.S. Attorney Bill McSwain at 11% and state Senate President Pro Tempore Jake Corman at 6%.",
    "To those who are undecided, Mr. Barletta said his message is that if Republicans want to beat Democrat Josh Shapiro in November, he’s the one with the record to do it.",
    "In 2021, natural gas production grew 2%, and in late January of this year, oil production was up slightly compared to the same time a year ago.",
    "A poll last week by Fox News put Mr. Barletta in the lead at 19% among GOP voters, with State Sen. Doug Mastriano a point behind.",
    "Despite criticism from GOP officials, oil and gas drilling in the U.S. has actually increased since Mr. Biden took office.",
    "“That will be the difference that will separate me from the others.”\nThe Associated Press contributed reporting.",
    "The voters, meanwhile, are still mostly undecided about who to support in a crowded Republican primary.",
    "Mr. Barletta said energy is one of the biggest issues that voters are concerned about in Pennsylvania.",
    "He was mayor of Hazleton for 11 years, served in the U.S. House and ran for U.S. Senate in 2018.",
    "Pennsylvania could be at the forefront of that effort, Mr. Barletta said.",
    "“I believe I check every box,” Mr. Barletta said.",
    "A quarter of the voters said they are undecided.",
    "First Published March 17, 2022, 4:00pm"
  ]
}