{
  "id": 3709,
  "mediaId": 2572,
  "date": "2022-02-26",
  "headline": "Pennsylvania gubernatorial candidate gets private sit-down with Trump at CPAC; will seek endorsement",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/Screen-Shot-2022-02-26-at-1.11.12-PM.png",
  "link": "https://www.foxnews.com/politics/pennsylvania-gubernatorial-candidate-dave-white-trump-cpac",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Leach",
  "authorUrl": "https://www.foxnews.com/person/l/matt-leach",
  "termIds": [
    2201,
    3279,
    3669,
    275,
    878,
    5225,
    5239
  ],
  "sentences": [
    "ORLANDO – Dave White, a Republican candidate for Pennsylvania governor, revealed exclusively to Fox News that he will sit down with former President Trump at the Conservative Political Action Conference (CPAC) to ask for his endorsement.",
    "Another candidate in the primary is Doug Mastriano, a state senator who’s been subpoenaed by the January 6th committee over his possible role in working to change the results of the 2020 presidential election.",
    "White, a former steamfitter who went on to make millions of dollars as the owner of an HVAC company, has already dropped $4 million of his own money into the race, according to a campaign official.",
    "TRUMP, DESANTIS AMONG SPEAKERS ANNOUNCED FOR CPAC IN ORLANDO\n\"Debbie and I, my wife, started a business 20 years ago, built it to an $85 million-a- year business.",
    "He put America first, similar to what I'm trying to do in Pennsylvania, putting Pennsylvania first, getting people back to work, getting good jobs,\" said White.",
    "White is sitting in a crowded primary field that includes former U.S. Rep. Lou Barletta and William McSwain, a former U.S. attorney.",
    "And I'm going to bring a business-type attitude similar to what Donald Trump did in Washington,\" said White.",
    "\"I'm a pipe fitter and I started a business again 20 years ago and grew it to a very successful business.",
    "\"I'm running for governor because I was one of those businesses 20 months ago that was shut down by Gov.",
    "White said he’s the best in the field because he can bring many of Trump’s ideas to Pennsylvania.",
    "For someone from the government to come and say you need to shut your doors is a mistake.",
    "Mastriano has denied any involvement in the January 6th riot at the U.S. Capitol.",
    "\"I want to bring that to Pennsylvania, so we can get things done.\"",
    "It should never have happened in Pennsylvania.\"",
    "He has done great things for the United States.",
    "\"I'm looking forward to meeting the president.",
    "Wolf with no plans,\" said White."
  ]
}