{
  "id": 46,
  "mediaId": 2550,
  "date": "2022-04-20",
  "headline": "Morning Digest: Two Georgia Democrats focus on voting rights in",
  "image": "https://images.dailykos.com/images/1061096/story_image/GA-07.jpg?1650411976",
  "link": "https://www.dailykos.com/stories/2022/4/20/2092904/-Morning-Digest-Two-Georgia-Democrats-focus-on-voting-rights-in-incumbent-vs-incumbent-primary?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Steve Sisolak with sizable leads of 9-14 points over several of his potential GOP foes, though with a large share of voters still undecided in each matchup:\n44-35 vs. Clark County Sheriff Joe Lombardo\n46-33 vs. former Sen. Dean Heller\n46-33 vs. North Las Vegas Mayor John Lee\n45-31 vs. attorney Joey Gilbert\nJust as they did with the Senate portion of the poll earlier this week, OH Predictive Insights noted how these results were considerably more favorable to Sisolak than a recent Suffolk University poll that found the governor variously ahead or behind by a small margin in large part because it surveyed registered voters while Suffolk queried likely voters.",
    "McBath and Bourdeaux have another good reason to focus on Republican attacks on democracy, since they are only facing each other in a primary because GOP gerrymandering drastically reshaped their seats and made McBath's old 6th District unwinnably red, a gerrymander that would have been illegal if Republicans hadn't blocked Democrats from passing their reforms in Congress.",
    "The supporter takes aim at the \"billionaires and Washington insiders\" who he says are lying about Fetterman, a reference to how a super PAC supporting rival Rep. Conor Lamb recently saw its first ad removed from TV for falsely calling Fetterman a \"self-described socialist\" on the basis of an erroneous news article that was later corrected.",
    "Voting rights is not a typical subject of ads, but it has become increasingly salient for Democrats this cycle as Republicans have passed a wave of voting restrictions in state after state in reaction to their 2020 election defeats, making diverse communities such as Atlanta the epicenter of their voter suppression efforts.",
    "CA-Sen: Wealthy businessman Dan O'Dowd, who's nominally running for Senate as a Democrat but is actually using his platform to settle scores with Elon Musk, has released his first TV ad, a minute-long spot featuring a series of clips that show troubling failures on the part of Tesla's \"self-driving\" software.",
    "Georgia Democratic Reps. Lucy McBath (left) and Carolyn Bourdeaux\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Kathy Hochul has gone up with her first TV ad in advance of the June Democratic primary as part of what her campaign called an \"eight figure media buy,\" though Politico reports via AdImpact that the governor has only spent a relatively modest $931,000 on TV ads so far through April 25.",
    "OR-06: State Rep. Andrea Salinas' second ad ahead of the May 17 Democratic primary focuses on how the Supreme Court is poised to overturn Roe v. Wade and how she strengthened abortion rights legislation in Oregon so that choice will be protected \"no matter what happens in D.C.\"\n?",
    "PA-Gov: Former Rep. Lou Barletta has put $750,000 behind his first TV ad for the May 17 Republican primary, which promotes how he was among the first in Congress to endorse Trump, led the way on anti-immigrant policies, and \"fought the liberals\" on energy policy.",
    "GA-07: Democratic Reps. Lucy McBath and Carolyn Bourdeaux are facing off against each other in the June primary for this safely blue seat in the Atlanta suburbs, and both incumbents have launched new ads this week that put voting rights front and center.",
    "(While that isn't entirely right—Democrats did flip two other seats in North Carolina after litigation replaced the GOP's gerrymander with a fairer map—Bourdeaux was indeed the only Democrat to flip a GOP-held seat without an assist from redistricting.)",
    "Meanwhile, Democratic Rep. Tom Suozzi, who has spent roughly $3 million on ads so far, has launched his first joint spot with former New York City Councilwoman Diana Reyna, who is running in the separate primary for lieutenant governor as Suozzi's ally.",
    "In McBath's ad, the congresswoman relays how her father brought her to the 1963 March on Washington as a toddler, and she calls the right to vote \"sacred\" in a democracy before warning how it's \"under assault by Republicans right here in Georgia.\"",
    "IA-Sen: Retired Navy Vice Adm. Michael Franken, who unsuccessfully ran for Senate in 2020, has unveiled his first ad for the June Democratic primary, and it's a minute-long spot that highlights his rural Iowa roots and his military experience.",
    "VA-05: Former Henry County Supervisor Andy Parker has ended his campaign for the Democratic nomination after party officials said last week that he had failed to turn in enough valid signatures to make the ballot for the June primary.",
    "NV-Sen: Reporting from the Hill indicates that Senate Majority PAC, the main outside group on the Democratic side, has upped its TV ad fall reservation in Nevada to $21 million from a previously reported $14 million.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nNerding out on redistricting, with Nathaniel Rakich\nThe Downballot\nFollowShare\n0:0059:53\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n?",
    "Meanwhile, venture capitalist Guy Nohra has debuted a TV spot ahead of the June Republican primary blaming Democrats for inflation as part of what his campaign announced was a $2 million buy for TV and digital ads.",
    "MA-Gov: On behalf of UMass Lowell, YouGov has surveyed the September Democratic primary for governor and finds state Attorney General Maura Healey cruising to a 62-17 lead over state Sen. Sonia Chang-Díaz.",
    "NV-Gov: The nonpartisan Nevada Independent has publicized the gubernatorial portion of its poll conducted by the GOP firm OH Predictive Insights earlier this month, and the survey finds Democratic Gov.",
    "Their 15-second segment shows the duo arguing that Hochul represents \"the same old Albany corruption\" by highlighting the recent indictment (and resignation soon thereafter) of former Lt. Gov.",
    "While a third candidate, state Rep. Donna McLeod, is also running, she raised a mere $22,000 and had only $15,000 on hand, which is far below what is needed to effectively get her message out.",
    "The spot portrays Hochul as hardworking and touts her passage of over 400 bills covering topics such as promoting gun safety, improving public schools, and cutting taxes on the middle class.",
    "AZ-Sen: Retired Air Force Maj. Gen. Mick McGuire's first ad ahead of the August Republican primary plays up his military record and likens the candidate to former GOP Sen. Barry Goldwater.",
    "Recounting how her team \"sued the state\" to make sure every vote counted, Bourdeaux says she was \"the only Democrat in the country\" to flip a Republican-held House seat in 2020.",
    "McBath touts how she has fought in Congress to pass a new Voting Rights Act named after the late civil rights leader John Lewis, who represented a neighboring Atlanta seat.",
    "The only other publicly available poll of the race so far was a MassInc poll taken in January that found Healey with a slightly smaller but still dominant 48-12 advantage.",
    "Bordeaux's spot has a slightly different emphasis, detailing how she overcame the naysayers who said she couldn't win in a historically red district.",
    "John Fetterman's newest ad in the May 17 Democratic primary features testimony from a supporter who praises him as a \"salt of the earth\" guy.",
    "Politico reports that O'Dowd's initial buy is for $2 million, but as befits his bizarre un-campaign, he's airing the spot in 36 states.",
    "We can expect a whole lot more advertising from both candidates, though, judging by their recent first quarter fundraising reports.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Brian Benjamin, whom Hochul had appointed to replace herself after she ascended to the governor's office last year.",
    "McBath hauled in $797,000 during the first three months of 2022 and had $2.9 million in the bank as of April 1.",
    "Divided among so many media markets, what would be a sizable outlay in a normal race is in fact a pittance.",
    "Bourdeaux then argues that we can prove the naysayers wrong again if we stand together to pass a new VRA.",
    "Bourdeaux, meanwhile, raised $591,000 and had $2.1 million in cash-on-hand at the start of April.",
    "Franken argues that GOP Sen. Chuck Grassley's 47-year tenure in Congress is too long.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "NY-Gov, NY-LG: Gov.",
    "PA-Sen: Lt. Gov.",
    "Please read it.",
    "Governors\n?",
    "Senate\n?",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}