{
  "id": 4697,
  "mediaId": 2592,
  "date": "2022-02-18",
  "headline": "Governors' Races In 'Blue Wall' States Carry High Stakes For Voting Rights",
  "image": "https://s1.ibtimes.com/sites/www.ibtimes.com/files/styles/full/public/2022/02/18/lieutenant-governor-rebecca-kleefisch-announces-that-republican-governor.jpg",
  "link": "https://www.ibtimes.com/governors-races-blue-wall-states-carry-high-stakes-voting-rights-3405245?utm_source=Public&utm_medium=Feed&utm_campaign=Distribution",
  "mediaOutlet": "IBTimes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Oliphant",
  "authorUrl": "",
  "termIds": [
    1640,
    2828,
    3669,
    3770,
    4034,
    5145,
    5402
  ],
  "sentences": [
    "A voting-rights group in Michigan, Voters Not Politicians, is recruiting volunteers to go into their communities to argue that the election system is not broken, that the 2020 election was free of fraud and that the sweeping measures advocated by Republicans in the state aren't necessary.",
    "A Democratic super PAC, American Bridge, said on Wednesday it would spend $10 million in a new effort to target Republican candidates in races for governor, secretary of state and other local offices who it believes will undermine the fair administration of elections.",
    "The governors' contests, like lower-ticket races involving everything from secretaries of state to county clerks, have taken on increased significance given Republican efforts to roll back voting rights and oversee election administration ahead of 2024.",
    "Democrats are in jeopardy of losing their long-time firewall against new voting restrictions in Michigan, Pennsylvania and Wisconsin should Republicans who support such curbs win competitive governors' races in those states in November.",
    "Like other governors, Evers has dealt with a surfeit of challenges, including the COVID-19 pandemic, economic upheaval, supply chain woes, school closings and a spike in violent crime, all of which have taken a toll on his popularity.",
    "VOTING RIGHTS FIGHT\nOn Tuesday, days after launching a bid for Wisconsin's governorship, Republican state Representative Timothy Ramthun staged a rally at the state capitol that called for the 2020 election to be overturned.",
    "A poll conducted this month by the Trafalgar Group showed former U.S. Representative Lou Barletta, an ardent Trump supporter, leading the pack of more than a dozen Republican gubernatorial candidates, followed by Mastriano.",
    "This week, the select congressional committee investigating the Capitol siege subpoenaed Mastriano, asking for details about a plan to submit an alternate slate of electors from his home state.",
    "Nicknamed the \"blue wall\" after helping President Joe Biden defeat Donald Trump in 2020, they also were home to challenges from Republican officials trying to overturn the election's results.",
    "Election analysts say it may be difficult to craft a resonant voting-rights message in a year where Americans likely are preoccupied with other issues such as inflation and education.",
    "The nominal favorite in the Republican primary for governor, former lieutenant governor Kleefisch, recently asked the state Supreme Court to invalidate the use of ballot drop boxes.",
    "That evening, Evers, who analysts say may be most at risk in the three governor's races, warned in an address to the state that \"we must not take for granted\" the right to vote.",
    "With Evers and Whitmer now facing tough re-election fights and Wolf unable to run again due to term limits, voting rights advocates are scrambling to warn voters of the stakes.",
    "\"It really has to be articulated to the electorate that we are at extraordinary time,\" said Rachel Bitecofer, co-founder of StrikePAC, a Democratic voting-rights super PAC.",
    "In an environment where Democrats are vulnerable, analysts said too tight a focus on claims of election irregularities could alienate swing voters in the general election.",
    "Kenner's group is advocating to keep the widespread mail-in voting Pennsylvanians enjoyed during the pandemic, as well as seeking to register 50,000 new voters this year.",
    "\"It is highly unlikely these problems altered the outcome of the 2020 election, but improved election procedures would greatly increase public confidence in the results.\"",
    "After the November 2020 election, Mastriano convened what he called a field hearing featuring Trump lawyer Rudy Giuliani to examine whether there was widespread fraud.",
    "Since Trump's defeat, the three states' Republican-controlled legislatures have been dedicated to passing limits on absentee and mail-in voting, among other things.",
    "Rebecca Kleefisch, the top Republican contender for Wisconsin's governor, filed a lawsuit seeking to prevent the use of drop boxes in upcoming elections.",
    "Well, this one is,\" said Kadida Kenner, executive director of the non-partisan New Pennsylvania Project, a group that works to register new voters.",
    "\"These elections bills are necessary to fix loopholes, ambiguities and weaknesses in Wisconsin's election law,\" said Stroebel, a Republican.",
    "Last year, Evers vetoed a Republican package that included provisions that would make it more difficult to cast absentee ballots.",
    "Doug Mastriano, a state senator running for governor in Pennsylvania, worked with Trump's lawyers to challenge the 2020 outcome.",
    "Democratic governors Tony Evers of Wisconsin, Gretchen Whitmer of Michigan and Tom Wolf of Pennsylvania stood in their way.",
    "James Craig, a leading Republican gubernatorial candidate in Michigan, has called for an audit of the election results.",
    "The lead sponsor, Senator Duey Stroebel, said the legislature's review of the 2020 election justified the changes.",
    "\"This is something Republicans care about,\" Jacob Rubashkin, an analyst in Washington who tracks governor's races.",
    "Her message to voters: \"A Democratic governor is the only thing standing between a free and fair 2024 election.\"",
    "Republican victories in the three states could have profound implications for the 2024 presidential election.",
    "Later, he traveled to Washington for the Jan. 6 rally and took part in protests outside the U.S Capitol.",
    "The state's governor appoints the secretary of state, who oversees election administration.",
    "Another gubernatorial candidate, businessman Kevin Nicholson, has said they are illegal.",
    "Republicans in the state Senate last week introduced a new version of the measure.",
    "Biden's sinking approval rating has also become a drag on Democratic governors.",
    "Pennsylvania's governor's race holds extra consequence for future elections.",
    "Attorney General Josh Shapiro is replacing Wolf on the Democratic ticket.",
    "\"They say every election is the most important of our lifetime.",
    "Political analysts consider all three races to be toss-ups.",
    "Some in the crowd carried banners that said, \"Trump Won.\"",
    "The \"blue wall\" states will be part of the push.",
    "\"This is not a winning issue writ large.\""
  ]
}