{
  "id": 5524,
  "mediaId": 2748,
  "date": "2022-02-03",
  "headline": "House Republicans Seek to Bankrupt Corporate-Funded NGOs Aiding Biden’s ‘Mass Invasion’",
  "image": "",
  "link": "https://www.breitbart.com/politics/2022/02/02/house-republicans-seek-to-bankrupt-corporate-funded-ngos-aiding-bidens-mass-invasion/",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    3975,
    4234,
    381,
    472,
    878,
    4977,
    5371
  ],
  "sentences": [
    "The legislation comes as a network of corporate-funded NGOs and private contractors working with President Joe Biden’s administration funnel hundreds of thousands of border crossers and illegal aliens into the U.S. interior via commercial and charter flights and bus services.",
    "On Wednesday, Gooden filed the “Stop Federal Funding for Human Trafficking and Smuggling Act” that would ban federal contracts and grants from going to NGOs unless they can prove that they are not involved in human trafficking and illegal alien smuggling.",
    "“The Biden Administration is working with non-profits, U.S. corporations, and international agencies to operate an illegal immigration network that spans from South America to every community in the United States,” Gooden said in a statement.",
    "Federation for American Immigration Reform (FAIR) president Dan Stein said a number of NGOs “have profited off of exploiting our immigration laws for too long” and that it was “long past time to hold them accountable.”\nFlorida Gov.",
    "House Republicans, led by Rep. Lance Gooden (R-TX), have issued a plan that seeks to bankrupt non-governmental organizations (NGOs) — often funded by corporations — who facilitate illegal immigration into the United States.",
    "Former Rep. Lou Barletta (R-PA), running for governor in Pennsylvania, has vowed to take similar action to ensure that NGOs and private contractors are not doing business with the state while aiding in illegal immigration.",
    "As Breitbart News noted, top MVM, Inc. executives — who scored a $136 million federal contract from Biden — have donated tens of thousands of dollars to Democrats including Sen. Tim Kaine (D-VA) and Bob Menendez (D-NJ).",
    "Should an NGO be found to have trafficked or smuggled border crossers and illegal aliens into the U.S. interior, the federal government would be required to revoke their 501(c)3 tax-exempt status.",
    "Ron DeSantis (R) has issued an executive order to prevent state licenses from going to NGOs and private contractors who facilitate illegal immigration to the state.",
    "In addition, DeSantis has laid out six legislative proposals to blacklist companies working with the Biden administration to resettle illegal aliens across Florida.",
    "“Taxpayer dollars should not be subsidizing a mass invasion of our country and it is time to put a stop to this corrupt operation,” he continued.",
    "Most recently, video footage showed private contractor MVM, Inc. helping fly and bus border crossers and illegal aliens to New York suburbs.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here."
  ]
}