{
  "id": 598,
  "mediaId": 2629,
  "date": "2022-04-13",
  "headline": "Trump Bashes GOP Candidate In Pennsylvania For Failing To Overturn 2020 Election",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY3NDk3OC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY4OTYxOTkxNX0.ERSQ08aQxg-jlxeeUADzrKUGUGVJrBNSR0JJ1cCQ2m0/img.png?width=1200&coordinates=0%2C69%2C0%2C173&height=600",
  "link": "https://www.nationalmemo.com/trump-bashes-gop-candidate-in-pennsylvania-for-failing-to-overturn-2020-election",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Singer",
  "authorUrl": "https://www.nationalmemo.com/u/emily-singer",
  "termIds": [
    2201,
    2317,
    3279,
    3669,
    3896,
    3975,
    4009,
    305,
    878,
    5239
  ],
  "sentences": [
    "In the aftermath of the 2020 presidential election, Barletta signed on to be an \"alternate elector\" to the Electoral College — one of the attempts made by Trump's allies in the Republican Party to simply ignore President Joe Biden's victory and install Trump as the victor.",
    "In June 2021, McSwain wrote a letter to Trump seeking his endorsement in which he defended his decision not to try to overturn the election when he served as the chief law enforcement officer for the federal district that includes the city of Philadelphia.",
    "Former President Donald Trump on Tuesday criticized former U.S. Attorney Bill McSwain — one of eight GOP candidates running for Pennsylvania governor — saying McSwain didn't work hard enough to overturn Trump's 2020 loss in the Keystone State.",
    "Mastriano has been subpoenaed by the U.S. House of Representatives select committee investigating the January 6 attacks, after he reportedly organized a busload of people to attend the \"Stop the Steal\" rally that preceded the violent riot.",
    "Sen. Chris Murphy (D-CT) warned that Trump's latest statement saying that McSwain didn't work hard enough to overturn the election is proof that the former president and his allies are working to erode the democratic process.",
    "\"The writing is just so clearly on the wall that Trump's movement is — at its core — designed to end elections and install Trump and his crowd in power permanently,\" Murphy tweeted on Tuesday.",
    "\"Reminder that the Republican Party leader who is crying 'voter fraud' is the same person who suggested we use bleach to combat a pandemic,\" Sen. Bob Casey (D-PA) tweeted on Tuesday.",
    "The \"audit\" is similar to what Republicans did in Arizona, where Trump supporters tried to use the shoddy recounting of votes to legitimize the GOP lies of a stolen election.",
    "While Mastriano has said he did not cross police barriers at the Capitol, photographic evidence shows he was on the Capitol grounds after police barriers had been breached.",
    "Attorney General Barr, however, instructed me not to make any public statements or put out any press releases regarding possible election irregularities.\"",
    "Like Barletta, Charlie Gerow, another gubernatorial hopeful, was also one of the \"alternate electors\" Pennsylvania Republicans wanted to put forward.",
    "\"On Election Day and afterwards, our Office received various allegations of voter fraud and election irregularities,\" McSwain wrote at the time.",
    "\"As part of my responsibilities as U.S. Attorney, I wanted to be transparent with the public and, of course, investigate fully any allegations.",
    "Former Rep. Lou Barletta (R-PA) is the current front-runner in the crowded field of Republicans running to become Pennsylvania's next governor.",
    "Nearly all of the GOP hopefuls either supported the effort to overturn the 2020 presidential election or took part in the efforts themselves.",
    "State Sen. Doug Mastriano, one of the primary race's leading candidates, was present at the January 6, 2021, U.S. Capitol insurrection.",
    "Trump has yet to endorse any of the GOP candidates in the crucial gubernatorial race, which is an open seat as Democratic Gov.",
    "And state Senate President Pro Tempore Jake Corman is helping lead an audit of the state's election results.",
    "\"Do not vote for Bill McSwain, a coward, who let our country down,\" Trump said in a statement.",
    "Published with permission of The American Independent Foundation.",
    "Democrats slammed Trump's statement criticizing McSwain.",
    "It was there for the taking and he failed so badly.\"",
    "\"He knew what was happening and let it go.",
    "Tom Wolf is term-limited."
  ]
}