{
  "id": 623,
  "mediaId": 2732,
  "date": "2022-04-20",
  "headline": "5 takeaways from Spotlight PA’s Republican gubernatorial debate",
  "image": "",
  "link": "https://triblive.com/news/pennsylvania/5-takeaways-from-spotlight-pas-republican-gubernatorial-debate/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1285,
    2105,
    3150,
    3279,
    3669,
    4009,
    878,
    964,
    4868,
    5239
  ],
  "sentences": [
    "Senate President Pro Tempore Jake Corman of Centre County, Montgomery County Commissioner Joe Gale, political strategist Charlie Gerow of Mechanicsburg, former U.S. Rep. Melissa Hart of Bradford Woods and surgeon Nche Zama of Stroudsburg answered questions on issues including no-excuse mail voting, infrastructure, education, energy, and abortion.",
    "More drilling, natural gas production\nAll candidates showed unfettered enthusiasm for the energy industry and said they want to reinvigorate and invest in Pennsylvania’s fossil fuel producers, arguing the state should expand natural gas drilling, loosen regulations, and bring more manufacturing to Pennsylvania.",
    "HARRISBURG — Five of the nine Republican candidates running to be Pennsylvania’s next governor participated in a debate hosted by Spotlight PA and its founding members Tuesday, aiming to differentiate themselves in a crowded field and make an impression on a largely undecided electorate.",
    "Zama said he would grow Pennsylvania’s economy, specifically citing the agriculture and energy industries, and use that revenue to offset any lack of education funding and relieve “the burden of property taxes,” the primary funder of the state’s public schools.",
    "The state is currently in the midst of a lawsuit — filed on behalf of seven school districts, parents, and several educational organizations — that alleges Pennsylvania fails to fulfill its constitutional requirement of providing high-quality public education.",
    "Corman criticized Wolf’s desire to join the Regional Greenhouse Gas Initiative — an interstate program to reduce carbon dioxide emissions — and said the state will rely on natural gas for “decades to come.” Gale advocated for additional natural gas drilling.",
    "Gerow said he would sign a pending “heartbeat bill” — which would ban abortion at around six weeks of pregnancy when an embryo’s cardiac activity can first be detected — as well as legislation that would ban abortion if a fetus has Down syndrome.",
    "Here are the key takeaways from the debate, which can be viewed here:\nVoting\nAct 77, a bill passed with bipartisan support in 2019 that instituted no-excuse mail voting, was unanimously condemned by the candidates at the debate.",
    "Public vs. private schools\nAll five candidates said they support “school choice,” which allows parents to choose alternatives such as homeschooling or private schools through access to state-provided tax credits or vouchers.",
    "Gerow echoed those sentiments, stating Pennsylvania needs to “drill baby, drill.” Hart and Zama felt similarly but said the state needs to make home energy bills more affordable and grow its clean energy industry.",
    "Better roads and bridges, but different paths\nAll of the candidates stressed the importance of improving the conditions of Pennsylvania’s roads and bridges, but they disagreed on how to accomplish that task.",
    "The other four candidates — including poll front-runners state Sen. Doug Mastriano of Franklin County and ex-U.S. Rep. Lou Barletta of Hazleton — demanded a partisan moderator and did not participate.",
    "Gale argued that if parents were able to freely choose different schooling options, public school systems would be forced to “shape up and get it right” as they compete with alternative schooling.",
    "Spotlight PA is an independent, nonpartisan newsroom powered by The Philadelphia Inquirer in partnership with PennLive/The Patriot-News, TribLIVE/Pittsburgh Tribune-Review, and WITF Public Media.",
    "Gerow said he wants to get rid of the property taxes that fund schools and introduce a “specific package” to the legislature to replace the system, though he did not specify what would be in it.",
    "Hart and Gale targeted unions and said they would get rid of prevailing wage rules, which require contractors to pay their employees based on minimum wages set by the state department of labor.",
    "Corman said Pennsylvania should use more general fund dollars for the State Police budget rather than take money from the Motor License Fund, which is intended for road and bridge repairs.",
    "While that is illegal under current law except for voters with disabilities or in the case of an emergency absentee ballot, it does not mean the ballot itself was invalid or fraudulent.",
    "Hart previously sidestepped the question, saying she would need to conduct more research before committing to a position, but confirmed during the debate that she would repeal the law.",
    "WHILE YOU’RE HERE … If you learned something from this story, pay it forward and become a member of Spotlight PA so someone else can in the future at spotlightpa.org/donate.",
    "A vow to limit abortion access\nAll five candidates oppose abortion and would sign legislation to curtail it, but they disagreed on the extent to which it should be banned.",
    "Corman, Gale, and Zama said they believe life begins at conception, but Corman was the only person to explicitly support exceptions for maternal health, rape, or incest.",
    "All nine will appear on the May 17 primary ballots, as will Pennsylvania Attorney General Josh Shapiro, who is the only Democrat running for his party’s nomination.",
    "They also cast aspersions about the use of ballot drop boxes, pointing out two instances in which ballots were dropped off by someone other than the voter.",
    "Corman, who voted for the bill in 2019, now says he would repeal it because Wolf and the courts interpreted it in ways with which he disagrees.",
    "Hart emphasized her legislative experience with bills that protect mothers, but didn’t specify the extent of her views against abortion access.",
    "Gerow said he would use COVID-19 relief money to lower the gas tax, while Zama claimed the problem lies in efficient management of funds.",
    "Hart suggested funding schools with the sales tax rather than property taxes, but said enough money is spent on the public school system.",
    "Corman and Gale both contended that the problem with the education system is parents’ lack of choice rather than a funding gap.",
    "Spotlight PA is funded by foundations and readers like you who are committed to accountability journalism that gets results.",
    "If successful, the suit could force the state to significantly increase funding for public schools.",
    "Critics say school choice depletes funding for the public school system over time.",
    "Hart also said she would use COVID-19 relief money to improve infrastructure.",
    "Gale and Zama argued there should be no exceptions to a ban on abortion.",
    "However, most candidates said that Pennsylvania already spends enough.",
    "Categories: News | Pennsylvania | Politics Election | Top Stories",
    "Tom Wolf is prevented by statute from seeking another term.",
    "They said it enabled fraudulent voting, a debunked claim.",
    "Wolf has either vetoed or vowed to veto such bills.",
    "Sign up for our free newsletters.",
    "Democratic Gov."
  ]
}