{
  "id": 6472,
  "mediaId": 2590,
  "date": "2022-01-27",
  "headline": "Pennsylvania Republican Lou Barletta’s PAC Spent Most Of Its Money On Overhead",
  "image": "https://img.huffingtonpost.com/asset/61f2ed4d2c0000bb0bdf5a4e.jpeg?cache=JxD1hvyYDo&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/lou-barletta-pac-wasted-money_n_61f2e84fe4b067cbfa1a3fe1",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Marans",
  "authorUrl": "",
  "termIds": [
    2201,
    2317,
    3150,
    4783,
    221,
    305,
    789,
    878,
    1171,
    5239
  ],
  "sentences": [
    "The PAC gave just $22,500 in contributions to political candidates or other PACs — 11% of its total spending — and spent $20,740 on unspecified “other disbursements.”\nAdvertisement\nSeveral political strategists told HuffPost that LOU PAC’s ratio of overhead costs to actual political spending suggests that it was an ethically questionable venture designed to benefit Barletta personally.",
    "Among the more than 490 members of the House and Senate who had leadership PACs in the 2020 election cycle, 120 of those members had PACs that dedicated less than 50% of their spending to political candidates or groups, according to a report by the good government groups Issue One and the Campaign Legal Center.",
    "Matt Rourke/Associated Press\nA Republican candidate for Pennsylvania governor’s political action committee spent the vast majority of its money in the 2020 election cycle on administrative costs, rather than contributions to political candidates, according to an analysis of official campaign-finance data.",
    "Advertisement\nAnnouncing his decision to transform what had been a “leadership PAC” for members of Congress into an ordinary federal PAC, Barletta explained that LOU PAC would focus on supporting political candidates committed to combating undocumented immigration.",
    "“This PAC very clearly did not do any kind of real work with so much overhead and is just another example of why he’s not going to be the next Governor of Pennsylvania,” said Eric Koch, a Democratic political consultant based in New York City.",
    "In all likelihood though, the payments were for an office property on Rocky Road in Hazleton that Barletta jointly owns with his wife and from which Barletta reported earning up to $50,000 in rental income in 2019.",
    "Barletta, an early and outspoken backer of former President Donald Trump, has hired two former Trump campaign hands and appears to be angling for Trump’s endorsement in the May 17 Republican primary.",
    "He faces competition from, among other contenders, conservative Pennsylvania state Sen. Doug Mastriano, former federal prosecutor Bill McSwain, and Pennsylvania state Senate President Jake Corman.",
    "The PAC paid Mary Grace Barletta $4,400 to rent the office space for the first month, $2,220 a month for the next six months, and $1,100 a month for the remainder of the 2020 election cycle.",
    "The candidate, former U.S. Rep. Lou Barletta, who ran unsuccessfully for Senate in 2018, continued to maintain the Leaders Only Unite PAC, or LOU PAC, after leaving the House in 2019.",
    "The PAC’s rent payments to Mary Grace Barletta also varied dramatically over the course of the 2020 election cycle, raising questions about how the rent was calculated and why.",
    "But during the 2020 election cycle, LOU PAC spent nearly $165,000 on “operating expenditures” that made up 79% of the nearly $208,000 it spent that cycle.",
    "Shapiro is the only Democrat running for governor, all but officially assuring him his party’s nomination to succeed termed-out incumbent Gov.",
    "But just 43% of those members had PACs that dedicated less than 25% of their spending to political candidates or groups, the report found.",
    "It is not altogether uncommon for members of Congress to use leadership PACs as de facto expense accounts with limited political utility.",
    "Those overhead costs included $33,000 in rent payments for an unspecified office property owned by Barletta’s wife, Mary Grace Barletta.",
    "The couple sold a Rocky Road commercial property in November 2020 for $800,000, according to the Luzerne County Recorder of Deeds.",
    "What’s more, all available evidence suggests that the Barlettas owned this property for the duration of the 2020 election cycle.",
    "Although Barletta was no longer in Congress during the 2020 election cycle, his PAC’s practices fit a pattern on Capitol Hill.",
    "Then-President Donald Trump, right, campaigns for then-Rep. Lou Barletta (R-Pa.) during Barletta's failed 2018 Senate run.",
    "Barletta has been a staunch opponent of undocumented immigration since his days as mayor of Hazleton, Pennsylvania.",
    "LOU PAC spent money on a number of items that might raise skepticism about his PAC’s stewardship of donor money.",
    "Barletta’s gubernatorial campaign did not respond to requests for comment on his PAC’s overhead spending.",
    "The winner of that primary will face Pennsylvania Attorney General Josh Shapiro in the general election.",
    "He also reported using a Rocky Road property to secure a loan for between $500,001 and $1 million.",
    "Even among this group though, Barletta’s overhead spending puts him in rarefied company.",
    "Advertisement\nIt is illegal for a politician to use campaign funds for personal profit.",
    "And Barletta funded his PAC with some money left over from his Senate campaign.",
    "It is not illegal for someone to use federal PAC funds for personal profit.",
    "The PAC doesn’t state which property it rented from Mary Grace Barletta.",
    "For example, LOU PAC spent more than $13,000 to charter a coach bus.",
    "Barletta is now running for governor of Pennsylvania.",
    "But current law makes violations hard to confirm.",
    "But LOU PAC’s rental payments stand out.",
    "Tom Wolf (D)."
  ]
}