{
  "id": 6804,
  "mediaId": 2732,
  "date": "2022-01-20",
  "headline": "Former Pa. House Speaker Mike Turzai declares he is not running for governor",
  "image": "",
  "link": "https://triblive.com/news/pennsylvania/former-pa-house-speaker-mike-turzai-declares-he-is-not-running-for-governor/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1385,
    3652,
    878,
    1163,
    1171,
    5239,
    5249,
    5397
  ],
  "sentences": [
    "His announcement now reduces the field vying for GOP nomination in the May 17 primary to: Lou Barletta of Luzerne County, Shawn Berger of Carbon County, Guy Ciarrocchi of Chester County, Senate President Pro Tempore Jake Corman of Centre County, Montgomery County Commissioner Joe Gale, Charlie Gerow of Cumberland County, Melissa Hart of Allegheny County, Sen. Scott Martin of Lancaster County, Sen. Doug Mastriano of Franklin County, William McSwain of Chester County, Jason Richey of Allegheny County, John Ventre of Westmoreland County, Dave White, and Dr. Nche Zama of Northampton County.",
    "In a statement, Turzai said, “While I did not formally announce my candidacy for governor, I was encouraged by friends and supporters to consider running this year.”\nHe went on: “I was honored to serve the commonwealth as speaker making a positive difference advancing school choice, energy independence, renewed manufacturing, and the protection of the unborn.",
    "Although I will always be grateful for the many kind messages and well-wishes I received, for now focusing on family and work is what matters most.”\nTurzai resigned his House seat in June 2020 to take a job as general counsel for Peoples, the Pittsburgh-based natural gas division of Essential Utilities, Inc., a Bryn Mawr-based company.",
    "He ran for that office in a much smaller field of GOP candidates in 2018 before pulling out to focus on ensuring the GOP held the majority in the House of Representatives when it became apparent he was not going to win the party’s endorsement.",
    "But when a straw poll was taken at the end of that meeting on a ballot that omitted Turzai’s name due to his last-minute request to speak to the GOP committee people, Turzai received no write-in votes.",
    "For weeks, there was talk that former Pennsylvania House Speaker Mike Turzai was toying with the idea of jumping into the crowded field of Republicans competing to be the party’s gubernatorial nominee.",
    "Turzai helped to fan the speculation about his possible run when he showed up at a Jan. 5 gubernatorial debate at Dickinson College, making people wonder if he was there to size up the competition.",
    "Then on Saturday, he showed up to speak to more than 100 Republican state committee people from 24 central Pennsylvania counties, along with 12 declared gubernatorial candidates.",
    "But in the weeks and months leading up to this gubernatorial election year, rumors swirled that Turzai might once again pursue the governor’s office.",
    "Categories: News | Pennsylvania | Politics Election",
    "This week, he declared he is not a candidate."
  ]
}