{
  "id": 7005,
  "mediaId": 2603,
  "date": "2022-01-24",
  "headline": "Pennsylvania Governor Candidate Pledges to ‘Protect Girls’ and Women’s Sports from Biological Male Competitors’",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/1330f95342411a52c21009f27892a5fc.jpg",
  "link": "https://jezebel.com/pennsylvania-governor-candidate-pledges-to-protect-gir-1848410997",
  "mediaOutlet": "Jezebel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Leibert",
  "authorUrl": "https://jezebel.com/author/emilyleibert",
  "termIds": [
    2317,
    3156,
    480,
    5239
  ],
  "sentences": [
    "“We should celebrate the differences between men and women, and we should not limit the hard-won opportunities for female athletes by ignoring the obvious unfairness of putting biological males onto girls’ and women’s sports teams.”\nAs governor, Barletta would introduce legislation that mimics State Rep. Barbara Gleim’s “Save Women’s Sports Act,” which requires high school and college athletes to compete according to their biological sex as recorded on their birth certificates, citing hormonal and physiological differences.",
    "On top of a flood of new anti-trans legislation, former congressman Lou Barletta, currently running as the Republican candidate for governor in Pennsylvania, is making a campaign issue out of pledging “to protect girls’ and women’s sports from biological male competitors.”\n“Women fought for a level playing field in sports for a long time, and now the ‘woke’ crowd is taking it away from them again by forcing girls and women to compete against biological males who have physical advantages,” Barletta said in the release.",
    "The beliefs underlying these bills deny the very existence of trans individuals, by forcing them into archaic binary structures under the guise of “safety” and “fairness.”\nBarletta’s announcement also comes on the heels of a contentious debate regarding UPenn swimmer Lia Thomas, a trans woman who recently broke records and put up astonishing times in the women’s 200-yard, 500-yard, and 1,650-yard freestyle events, qualifying for the NCAA swimming and diving championships in each event.",
    "Trans athletes have long been sidelined and discriminated against in the name of fairness, but that fairness is one-sided, leaving trans athletes two horribly offensive options: to compete in a category that erases and ignores their identity, or to be denied the opportunity to participate in organized sport altogether.",
    "Candidates and elected officials like him need to stop fanning the flames of anti-trans hate, and focus on what students truly need: safe, gun-free schools, a better funding formula for education and school repairs, and a commitment to the safety and inclusion of every student in the classroom and on the field.",
    "Politicians, hoping to gain political advantage, are giving people permission to discriminate against trans kids, who are just trying to live their lives as themselves,” Rodrigo Heng-Lehtinen, the executive director for the National Center for Transgender Equality, told Jezebel on Monday morning.",
    "Then, last week, the NCAA revised its generally inclusive blanket policy, which allows transgender women to compete in women’s events after one year of testosterone suppression treatment, in place of a policy that permits each sports’ governing body to set its own requirements for trans athletes.",
    "Everything else is just a distraction that comes at the expense of young LGBTQ students’ success, and even their lives.”\nThe ongoing discourse on young trans athletes, of course, relies on that misleading ideal of “fair competition.” But the real question is fair for whom?",
    "Barletta repeatedly refers to trans women as “an ongoing threat to female athletes,” while simultaneously refusing to call them “trans women” in favor of “biological male competitors”—akin to repeatedly and hazardously misgendering them.",
    "Only they—not birth certificates—get to decide their identity and where they feel most appropriate to play sports in our Commonwealth,” added Jonathan Lovitz, a ccandidate for PA House District 182 and an LGBTQ public policy expert.",
    "The audacity of running on this issue, while deplorable to those of us with brain cells, reflects a much more ominous concern: that running on an anti-trans platform is not only popular, but assumed a winning strategy.",
    "These attacks are putting young people in jeopardy, and it’s critical that schools, businesses and individuals stand up against them.”\n“In Pennsylvania and across America, trans women are women; trans men are men.",
    "Critics and TERFs, as expected, lost their shit over Thomas’ participation in the women’s events, citing an “unfair” advantage over cis women swimmers due to natural testosterone levels.",
    "Seemingly bending to pressure from critics and advocates looking to protect the alleged purity of cis athletes, the NCAA opened the floodgates for institutionalized discrimination.",
    "According to a study released by the Human Rights Campaign, 2021 saw 147 anti-trans proposals including bathroom bills—nearly double the 79 anti-trans measures introduced in 2020.",
    "A few days later, along comes Barletta, more than happy to capitalize on the media frenzy by denouncing trans women everywhere with needless fear-mongering.",
    "“What fear-mongers like Lou Barletta call being ‘woke’ and ‘politically correct,’ I call standing up for decency, dignity, and inclusion for all.",
    "In the first week of 2022 alone, at least seven states introduced bills that would directly harm young trans and nonbinary Americans.",
    "“Children deserve to be loved and supported by their families and their communities, not attacked by people who wish to hold power.",
    "“There is a coordinated campaign being carried out by politicians around the country targeting transgender youth.",
    "Not even one month into 2022, and it’s already looking to be yet another abysmal year for trans rights.",
    "In Arizona, the Senate approved a ban on trans girls in school sports just last week."
  ]
}