[
  {
    "id": 3675,
    "mediaId": 8475,
    "date": "2022-01-25",
    "sentence": "Sen. <span class='selected-term'>Michelle Ugenti-Rita</span>, R-Scottsdale, who introduced the bill and worked on it with Ducey's support, said that passing it was imperative, given that it was impossible to predict who could become governor next.",
    "author": "Gloria Gomez",
    "title": "Bill to limit Arizona governor's emergency powers was sparked by Ducey's COVID orders"
  },
  {
    "id": 1940,
    "mediaId": 8350,
    "date": "2022-02-09",
    "sentence": "The progressive initiative announced Tuesday aims to go around the Legislature, which is elected by the people to represent their interests, said Sen. <span class='selected-term'>Michelle Ugenti-Rita</span>, a Scottsdale Republican and a leading sponsor of GOP election bills.",
    "author": "ASSOCIATED PRESS",
    "title": "Sweeping Arizona ballot initiative aims to protect voting rights"
  },
  {
    "id": 961,
    "mediaId": 8345,
    "date": "2022-02-12",
    "sentence": "Republican U.S. Senate candidate Jim Lamon and GOP Secretary of State hopeful <span class='selected-term'>Michelle Ugenti-Rita</span> will address the Conservative Republican Club of Kingman at 11 a.m. on Monday, Feb. 14.",
    "author": "",
    "title": "Lamon, Ugenti-Rita to speak to Conservative Republican Club of Kingman"
  },
  {
    "id": 114,
    "mediaId": 2664,
    "date": "2022-02-22",
    "sentence": "He noted that Republican state Sen. <span class='selected-term'>Michelle Ugenti-Rita</span> called teachers “educational terrorists\" and Republican gubernatorial candidate Matt Salmon said they are \"a scourge on our society.\"",
    "author": "Bob Brigham",
    "title": "Arizona Republicans call teachers ‘educational terrorists’ and ‘a scourge on our society’: report"
  },
  {
    "id": 10905,
    "mediaId": 2641,
    "date": "2022-03-09",
    "sentence": "Paul Boyer of Glendale and <span class='selected-term'>Michelle Ugenti-Rita</span> of Scottsdale.",
    "author": "",
    "title": "Arizona Senate Votes Down Bill to Audit Every Election"
  },
  {
    "id": 10890,
    "mediaId": 2520,
    "date": "2022-03-10",
    "sentence": "Sen. Paul Boyer, R-Glendale, is joining with Democrats (and on occasion, Sen. <span class='selected-term'>Michelle Ugenti-Rita</span>, R-Scottsdale) to vote no on a raft of election bills — by my count at least six this week alone.",
    "author": "Laurie Roberts",
    "title": "Enough with the election bills. When will our leaders fix problems that actually exist?"
  },
  {
    "id": 13557,
    "mediaId": 8475,
    "date": "2022-03-17",
    "sentence": "Sen. <span class='selected-term'>Michelle Ugenti-Rita</span>, R-Scottsdale, has advocated for the legislature to restore PC elections in a special session as a workaround for the lack of Democratic votes.",
    "author": "Jeremy Duda",
    "title": "Counties: retroactivity clause won’t put party activists back on Arizona ballot"
  }
]