{
  "id": 1736,
  "mediaId": 2569,
  "date": "2022-04-01",
  "headline": "Delegation for 4.1.22: Map mania — China watch — Senate spotlight — hunting Hunter — traffic control",
  "image": "https://floridapolitics.com/wp-content/uploads/2021/12/capitol-green-scaled.jpeg",
  "link": "https://floridapolitics.com/archives/513409-delegation-for-4-1-22-map-mania-china-watch-senate-spotlight-hunting-hunter-traffic-control/",
  "mediaOutlet": "floridapolitics.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "51min\nAbraham Lincoln\nAl Lawson\nBill Posey\nBrian Mast\nByron Donalds\nCharlie Crist\nDarren Soto\nDebbie Wasserman Schultz\nDelegation\nFeatured Post\nFlorida Delegation\nFrederica Wilson\nGeorge Washington\nGreg Steube\nGus Bilirakis\nJoe Biden\njohn rutherford\nKathy Castor\nKetanji Brown Jackson\nLois Frankel\nMarco Rubio\nMaria Elvira Salazar\nMario Diaz-Balart\nMark Foley\nMartin Luther King\nMatt Bryza\nMatt Gaetz\nMichael Waltz\nNancy Pelosi\nNicolas Maduro\nRick Scott\nRon DeSantis\nScott franklin\nSheila Cherfilus-McCormick\nStephanie Murphy\nStephen Breyer\nTed Deutch\nVal Demings\nVern Buchanan\nVeterans Affairs Department\nVladimir Putin\nVolodymyr Zelenskiy\nThe mythic map\nAs April begins, Florida still has no congressional map for candidates in 2022.",
    "Since 2020, Taiwan and the United States have engaged in the U.S.-Taiwan Economic Prosperity Partnership Dialogue, covering a broad range of economic issues, including digital commerce, 5G networks, telecommunications security, supply chains, infrastructure cooperation, renewable energy, global health, and science and technology — many of the same issues to be addressed by the IPEF.”\nChange of heart\nCarlos Giménez promised that he will soon file a bill that lifts every COVID-19-related restriction in the country.",
    "“We are also concerned that reducing the unserved threshold from 90% to 50% for funding as required by the Infrastructure Investment and Jobs Act (IIJA) will once again shift dollars away from the rural areas that are most in need of broadband.”\nAir traffic\nOrlando’s Val Demings, Winter Park’s Murphy, and Darren Soto of Kissimmee pushed Tuesday for $60 million in federal money to replace an air traffic control facility at Orlando International Airport.",
    "“For months before the 2020 election, everyone from the President of the United States, members of Congress, and conservative media organizations sounded the alarm on Hunter Biden, resulting in Big Tech censoring any mention of this damaging story.”\nThat references social media platforms blocking the sharing of a New York Post article about the computer, questioning if the laptop was, in fact, Hunter Biden’s.",
    "“We are troubled by the Round 3 ReConnect guidelines that could allow a new broadband provider to obtain funding to build a broadband network to serve the very same area awarded to another provider that has received funding from other programs like the Federal Communication Commission’s (FCC) Rural Digital Opportunity Fund (RDOF),” the letter states.",
    "The trio of Democratic members wrote to Billy Nolen, acting administrator of the Federal Aviation Administration, urging him to grab some of the money from the federal infrastructure bill approved last fall and use it to replace what they say is an outdated Central Florida Terminal Radar Approach Control at the nation’s seventh busiest airport.",
    "… A single emergency or catastrophic incident would be devastating to the passengers, crew, controllers, safety specialists, and their families.”\nThey pointed out the facility was built in 1983, and that Orlando International Airport’s growth since has included the opening of two more airside terminals and tens of millions of passengers.",
    "“Scott — the top Republican in charge of electing Senate Republicans — will hold an event at the Heritage Foundation to highlight the Republican agenda to sunset Social Security and Medicare in five years and raise taxes on half of Americans, including seniors and retirees,” read the advisory from the DNC War Room.",
    "Semper Paratus!”\nThe Don Young Coast Guard Authorization Act of 2022 (HR 6865), named for recently deceased Alaska Rep. Don Young, authorizes record funding of $12.8 billion for the Fiscal Year 2022 and $13.9 billion for FY 2023 to modernize the Guard, improve shore infrastructure and take care of Guard families.",
    "Department of Transportation opens for business” via the Eno Center for Transportation — The Department did not yet have its own building — instead, it would begin its existence using three floors of the new Federal Aviation Administration building that had opened in 1963 (along with scattered other facilities).",
    "Tampa Bay goes from two Democratic seats to one, but that means Rep. Gus Bilirakis, a Pinellas Republican, goes from living in a district Trump won with more than 58% of the vote to one Trump won with over 54%, and which is now primarily represented by retiring Democratic Rep. Charlie Crist of St. Petersburg.",
    "Through incredible persistence, dedication, and courage, they left their marks on history, and I look forward to seeing their statues in the Capitol, where they will continue to inspire elected officials, visitors, and our children for future generations.”\nFrankel introduced the House bill (HR 4814) in July.",
    "As arguably the chamber’s most vocal critic of the superpower’s influence — and as Senator for a state with one of the highest concentrations of constituents with Latin American heritage — he said it’s important the threat of the communist nation is not forgotten amid other foreign policy challenges.",
    "Territorial Taiwan\nMiami Republican Mario Díaz-Balart and other leaders of the Congressional Taiwan Caucus led a letter to Commerce Secretary Gina Raimondo and U.S. Trade Rep. Katherine Tai calling for the nation’s inclusion in the Biden administration’s Indo-Pacific Economic Framework (IPEF).",
    "But in truth, the Legislature during the Special Session never took up any of the submissions from the public for consideration, and most observers suggest doing so could put the state at risk of the same mistakes that led to a congressional map approved in 2012 being thrown out in 2015.",
    "April 1, 1970 — “Richard Nixon signs legislation banning cigarette ads on TV and radio” via History.com — President Nixon, who was an avid pipe smoker indulging in as many as eight bowls a day, supported the legislation at the increasing insistence of public health advocates.",
    "To witness on the House Floor, Republican votes change in disapproval of the bill during the final seconds of roll call, was abhorrent.”\nAides for some of the Representatives who voted “no” on the renaming say late-breaking questions about Hatchett’s record prompted concerns.",
    "China is a 100-year problem, both in the region and internationally.”\nDSCC attention\nWhile Sen. Rick Scott released his 11-point Rescue America plan as an agenda for Senate Republicans in the midterms, it continues to be Democrats far more willing to spotlight the document.",
    "“I am also in the process of introducing legislation, the America Reopens Act, intended to end all scrupulous and unnecessary COVID-19 restrictions mandated by the federal government, including the current mandates placed on U.S. airlines,” Miami Republican wrote.",
    "“How are Americans supposed to trust that you can protect us from the next Colonial pipeline if it seems you can’t locate a laptop that was given to you three years ago from the First Family, potentially creating vulnerabilities for our country?” Gaetz responded.",
    "The last thing we need is more funding that does not meet the needs of those it aims to serve.”\nThe letter suggests trouble ahead for the rural broadband program but asks Vilsack to act and ensure the effort continues to serve communities with limited access.",
    "“Jones’ firsthand look at the inequities in education and society at large propelled him to enter public service, and since 2013, he has served in the Florida Legislature, championing meaningful bipartisan legislation.”\nOn this day\nApril 1, 1967 — “U.S.",
    "“Clearly, Mr. Navarro is eager to tell his story, as he sees it, so long as he can do so on his own terms.”\nThat includes writing a book detailing how he organized an effort to convince Vice President Mike Pence to single-handedly overturn the election.",
    "According to a Washington Post article the following day, first Transportation Secretary Alan Boyd spent much of the afternoon “wandering around the Mall riding in things,” which included a hot-air balloon flown by famous balloonist Don Piccard.",
    "Voters in many of the nations, amid economic anxiety worsened by the COVID-19 pandemic, he said, have turned to the “hollow promises of change” in countries like Argentina, Peru, Chile and Honduras and voted in leaders sympathetic to socialism.",
    "State Sen. Ray Rodrigues and state Rep. Tom Leek, respective redistricting leaders in the upper and lower chamber of the Legislature, agree the best outcome remains maps crafted and approved by the Legislature and that the Governor will sign.",
    "Most obviously, Rep. Al Lawson, a Tallahassee Democrat, would have his district completely deconstructed, and there would be no district in north Florida where Republicans didn’t win at least 53% of the vote in the last presidential election.",
    "A battleground district currently represented by Rep. Stephanie Murphy, a Winter Park Democrat, would morph from one Democratic President Joe Biden won with 55% of the vote to one Republican Donald Trump won with nearly 53% of the vote.",
    "In Southwest Florida, Rep. Vern Buchanan’s Sarasota-Bradenton area seat gets split in half, and it’s unclear whether he would run in a Manatee County seat where most of his constituents live or a Sarasota seat where his home lies.",
    "At that time, the Florida Supreme Court ruled that partisan interests had inappropriately planted maps, and the Legislature allowed undue influence in a process that resulted in maps that illegally benefited the Republican Party.",
    "She and California Democrat Jim Costa expressly supported the continuation of the ReConnect Pilot Program, which directs funding to underserved rural areas, a description that applies to much of Cammack’s North Florida district.",
    "She noted that Trump hasn’t even tried to claim executive privilege, yet the former assistant to the President (who grew up in Trump’s now hometown community of Palm Beach, incidentally) has refused to comply with a subpoena.",
    "Alarming health studies emerged as early as 1939 that linked cigarette smoking to higher incidences of cancer and heart disease and, by the end of the 1950s, all states had laws prohibiting the sale of cigarettes to minors.",
    "“The DSCC has been irrelevant for years, so we couldn’t care less what they waste their money on.”\nMeanwhile, the Democratic National Committee took the unusual step of sending out a press advisory for the Scott speech.",
    "The political jurisdictions of North Florida Reps. Kat Cammack, John Rutherford and Mike Waltz get carved up in various ways apparently to create these two new GOP-leaning seats in Jacksonville and south Volusia County.",
    "Murphy said Navarro’s testimony is “central to our committee’s inquiry.” Navarro, meanwhile, has started to limit press appearances after so much of his public commentary informed the recommendation he face charges.",
    "“Access to affordable, reliable, high-speed internet in North Central and Northeast Florida remains a challenge, and ReConnect — designed to reach the communities most in need — is pivotal in achieving this goal.",
    "The Democratic Senatorial Campaign Committee (DSCC) expanded a targeted ad buy with a spot bashing Scott in Washington, ahead of a Scott speech to the right-of-center Heritage Foundation on Thursday afternoon.",
    "Ahead of the hearing, he told The Associated Press that it’s a more pressing matter in key ways than even the Russian invasion of Ukraine, which rightly has taken up much of the federal government’s attention.",
    "Hatchett job\nRubio and Scott last year introduced legislation in October to rename a federal courthouse in Tallahassee after Joseph Woodrow Hatchett, the first Black justice on the Florida Supreme Court.",
    "He pressed FBI Assistant Director for the Cyber Division Bryan Vorndran on whether the agency had Hunter Biden’s laptop, which he infamously dropped off at a Delaware repair shop and never picked up.",
    "White House treatment\nThis week, the White House tapped Miami Democratic state Sen. Shevrin Jones to take a seat on the President’s Board of Advisers on Historically Black Colleges and Universities.",
    "“Jones recognized from a young age the power of education as the great equalizer, a foundation that drove Shevrin into teaching to help students reach their full potential,” the news release reads.",
    "Ron DeSantis this week vetoed congressional cartography approved by the Florida Legislature — actually, two of them, as state lawmakers attached a backup plan if courts didn’t like the primary map.",
    "Roberts raised the prospect of the plan raising taxes on lower-income Americans and setting the stage for a potential sunset of safety-net programs, namely Medicare, Medicaid and Social Security.",
    "His path from Florida A&M University graduate to public high school chemistry teacher and founder of a nonprofit dedicated to boost youth leadership and entrepreneurial spirit was also detailed.",
    "In between those hill gigs, Lewis also worked on the Democratic National Convention Committee and briefly served as director of public policy for Credit Suisse Group before working for Waters.",
    "Beyond a “foundational flaw in Mr. Navarro’s privilege claim, since the election, he has written and spoken widely about the precise subjects that are the focus of our subpoena,” Murphy said.",
    "The Miami Republican serves as the ranking GOP member on the Subcommittee on Western Hemisphere, Transnational Crime, Civilian Security, Democracy, Human Rights, and Global Women’s Issues.",
    "Chair Gerald Nadler, a New York Democrat, objected and said the drive would need further review for authenticity to become part of the record, but said it could end up there in the future.",
    "In 1964, the Federal Trade Commission and the Federal Communications Commission agreed that advertisers had a responsibility to warn the public of the health hazards of cigarette smoking.",
    "What was labeled as ‘Russian disinfo’ by (White House press secretary) Jen Psaki and the national press to protect then-candidate Biden is coincidently coming to light now,” he said.",
    "It also serves Kissimmee Gateway Airport, Orlando Sanford International Airport and six other airports, as well as NASA’s Kennedy Space Center and Cape Canaveral Space Force Station.",
    "“It’s in the plan,” the new video from the DSCC, spotlights a Scott interview on Fox News Sunday, where host John Roberts grilled the Senator about aspects of his 11-point plan.",
    "He went on to call pandemic restrictions “unscientific” and “nonsensical.”\nOf note, that’s a significant departure from the position Giménez held during his last elected job.",
    "Right here in Pinellas County, we are honored to count over 1,000 Coasties and their families as our neighbors, and we can sleep well at night knowing they have our backs.",
    "The caucus, which boasts more than 200 members, is led by Díaz-Balart, Ohio Republican Steve Chabot, Virginia Democrat Gerry Connolly and New Jersey Democrat Albio Sires.",
    "One shared a 1999 report of a controversial majority opinion written by Hatchett that said Florida schools could not have student-led prayers at graduation ceremonies.",
    "“The companion bill, which was led by Sen. Rubio, received bipartisan support and conservative members of the Florida delegation signed onto the bill as co-sponsors.",
    "He was the Mayor of Miami-Dade County in 2020 when the pandemic hit, and in that capacity, he issued a mask mandate for all public spaces, both indoors and outside.",
    "In a letter to airline executives, who recently came out in favor of lifting mask mandates on U.S. flights, the Congressman said he would seek that change and more.",
    "Chasseny Lewis, the former Chief of Staff to Rep. Frederica Wilson, started in Feb. as director of federal affairs for Shipt, a delivery company owned by Target.",
    "Coasting\nCrist cheered the passage of legislation providing new resources to the U.S. Coast Guard, something that will benefit many military families in Florida.",
    "“I am extremely disappointed in my Republican colleagues who voted against the measure, especially since the bill passed unanimously in the Senate,” Lawson said.",
    "Republicans voted against the measure, including Bilirakis, Buchanan, Cammack, Donalds, Dunn, Scott Franklin, Matt Gaetz, Brian Mast, Rutherford and Greg Steube.",
    "If the Legislature fails to pass a map, attorneys for the body have already started to argue that the case should end up in state court instead of federal court.",
    "In doing so, the Senator asserted they also turn a blind eye to suffering and human rights violations in Cuba, Venezuela and other nations embracing socialism.",
    "That would involve the Coast Guard, National Oceanic and Atmospheric Administration and academic figures, who together will address protecting marine habitats.",
    "But Legistorm, which first reported the move, notes she spent two and a half years as Chief of Staff for Wilson’s Office from October 2017 through March 2020.",
    "A news release’s rundown stood Jones’ career up next to the biographies of other board members, including university presidents and national industry leaders.",
    "It cited his role as the state’s first openly LGBTQ Senator and champion of laws to help the downtrodden such as imprisoned pregnant women and drug addicts.",
    "Justices O’Connor and Ginsburg faced undeniable gender discrimination throughout their entire academic and professional careers, yet they never backed down.",
    "“Hunter Biden is and has been a national security risk, and it is time for Democrats and the media to stop covering for him and allow the truth to come out.",
    "Service outage\nGainesville Republican Cammack co-led a bipartisan letter to Agriculture Secretary Tom Vilsack pushing for more support for rural broadband.",
    "Taiwan has long been an important trading partner of the United States and was its 8th largest in 2021 with $114 billion in total trade,” the letter reads.",
    "Since Florida picked up a congressional seat this cycle, old lines cannot be used without leaving a seat in Congress vacant for an entire election cycle.",
    "“It has served a critical role in diversifying the U.S. supply chain, which has become increasingly dependent on the People’s Republic of China (PRC).",
    "“The U.S. Capitol is the symbol of our democracy, and millions of tourists from around the country and the world have passed through these halls.",
    "Moreover, his administration then threatened businesses with shutdowns for failing to comply with capacity restrictions and stay-at-home orders.",
    "But now (Senate Majority Leader) Chuck Schumer and the other Democrats are faking outrage about his plan,” asserted spokesperson McKinley Lewis.",
    "He did accept when Gaetz asked that a receipt from Mac’s Computer Repair, where the computer was dropped off in 2019, be included in the record.",
    "A day later, as a member of the House Oversight Committee, Donalds said Democrats were covering for Biden and creating a national security risk.",
    "Indeed, the lockdown order DeSantis issued statewide early in the pandemic was modeled off one crafted by Giménez’s team in Miami-Dade County.",
    "If signed, the legislation calls for statues of the justices Sandra Day O’Connor and Ruth Bader Ginsburg to be erected on the Capitol grounds.",
    "SCOTUS women\nCongress passed legislation penned by West Palm Beach Democrat Lois Frankel that honors the first female Supreme Court justices.",
    "Delegation is published by Peter Schorsch and compiled by Jacob Ogles, with contributions by A.G. Gancarski, Anne Geggis and Scott Powers.",
    "“Unfortunately, some of these newer leaders in the region have expressed admiration for the Communist Party and China’s model,” he said.",
    "This week, the panel recommended criminal contempt charges for Peter Navarro, a Trump assistant at the time of the Jan. 6 Capitol riot.",
    "Ultimately, the Senate bill (S 3294), sponsored by Minnesota Democratic Sen. Amy Klobuchar, passed and will be sent to the White House.",
    "“As Taiwan is a major economy in the Indo-Pacific region, we strongly believe that Taiwan should be invited to participate in the IPEF.",
    "But DeSantis on Thursday hinted the Legislature might want to consider a couple of public submissions — the ones sent in by his office.",
    "Naples Republican Byron Donalds, one of two Black Republicans in the House, also voted “no.”\nThe bill isn’t completely dead, though.",
    "Fort Walton Beach Republican Gaetz brought some theatrical flair to a House Judiciary Committee meeting with officials from the FBI.",
    "“Our Coasties work tirelessly to protect our shores from disasters, both natural and human-made.” the St. Petersburg Democrat said.",
    "There’s a lot of arguing ahead, but 11 weeks from today, there will be new maps and a candidate roster for the midterms in place.",
    "He cut taxes more than 100 times as Governor of Florida and he’ll put his record of cutting taxes up against anyone in Congress.",
    "To watch the ad, click on the image below:\nScott was emphatic in saying he doesn’t want to sunset the entitlement programs.",
    "Yet, those bring significant political consequences, including for the 23 incumbent delegation members seeking re-election.",
    "Crist also authored a provision of the bill that would establish a Center of Expertise for Marine Environmental Response.",
    "Seven Republicans from Florida were among the “no” votes: Cammack, Donalds, Franklin, Gaetz, Mast, Bill Posey and Steube.",
    "Ginsburg, nominated by former Democratic President Bill Clinton, sat on the bench from 1993 until her death in September.",
    "“As we celebrate the end of Women’s History Month, today is an exciting day to honor two history-making American women.",
    "Hunted\nMultiple Republicans in the delegation are piling onto a family member of the President: his son, Hunter Biden.",
    "The bipartisan group said it was essential to include the nation when China has tried to impose rule over the island.",
    "O’Connor, an appointee of former Republican President Ronald Reagan, served on the high court from 1981 until 2006.",
    "“I am proud to support this bipartisan bill to provide the Coast Guard with what they need to keep Floridians safe.",
    "April 1 fell on a Saturday, and DOT and the Smithsonian hosted a daylong celebration of transportation on the Mall.",
    "The three lawmakers noted in the letter that they recently toured the facility and were “alarmed by the conditions.",
    "China eye\nSen. Marco Rubio on Thursday co-chaired a special meeting on China’s growing influence in Latin America.",
    "“It became clear that the facility poses a safety threat to passengers and staff,” Soto said,\nCharging Navarro?",
    "The program was launched in 2018 and focused on areas where at least 90% of residents lack internet access.",
    "The Wednesday vote was on suspending the rules and fast-tracking passage, which requires a two-thirds vote.",
    "Yet, shockingly, only 14 of 266 of the statues that line the halls of Congress are of women,” Frankel said.",
    "Copies of the hard drive have since been shared with conservative activists — and potentially with Gaetz.",
    "“Who has it?” Gaetz wanted to know, suggesting foreign powers could use the contents to blackmail Biden.",
    "But a vote on the bill in the House on Wednesday failed, with several Florida members voting against it.",
    "He soon called a Special Session to address redistricting that will take place from April 19 through 22.",
    "After a stint in a similar role for California Democratic Rep. Maxine Waters, Lewis made the jump.",
    "On Thursday, the state reopened the ability to submit proposals on the FloridaRedistricting.gov.",
    "But then there’s also a high probability redistricting is resolved in different ways altogether.",
    "“The Western Hemisphere is in a period of extraordinary upheaval,” Rubio said at the hearing.",
    "At the time, the dense county had been the epicenter for new COVID-19 infections in Florida.",
    "That has independently been verified since by media outlets, including The Washington Post.",
    "“I’m pleased to join Rep. Costa in leading this letter with my colleagues,” Cammack said.",
    "“Nay” votes included Panama City Republican Neal Dunn, whose district covers Tallahassee.",
    "Lawson, who also represents part of Tallahassee, slammed the resistance to the renaming.",
    "Pence declined and has heavily criticized Trump’s assertion such a move was possible.",
    "He tackled the topic alongside Subcommittee Chair Tim Kaine, a Virginia Democrat.",
    "He said the long-term economic power of China must be taken seriously by the U.S.",
    "“Russia is an acute problem and it’s a present-day challenge,” Rubio told the AP.",
    "He tried to have a copy of the drive submitted into the Congressional Record.",
    "Shipt shape\nA former delegation staffer has left The Hill for a lobbying gig.",
    "What’s more, the air traffic control radar there doesn’t just serve Orlando.",
    "Murphy, a member of the high-profile committee, said the step was necessary.",
    "I think we ought to figure out how we preserve those programs,” Scott said.",
    "Taiwan has already expressed an interest in participating in the IPEF.",
    "“No one that I know of wants to sunset Medicare and Social Security.",
    "“The Orlando facility is outdated and in disrepair,” Murphy stated.",
    "“I found that the building was nearly falling apart,” Demings said.",
    "The work of the Jan. 6 Committee continues to become more pointed.",
    "The Senate passed the bill through unanimous consent in December.",
    "Scott’s office is decrying the political attacks from Democrats.",
    "A new state-of-the-art terminal is set to open later this year.",
    "The reasons in favor of Taiwan’s participation are compelling.",
    "The tally came in with 238 “yea” votes and 187 “nay” votes.",
    "But there are also consequences for Republican incumbents.",
    "Candidates for Congress must qualify by noon on June 17.",
    "Scott is a tax cutter — always has been, always will be.",
    "But what we’re doing is, we don’t even talk about it.",
    "The only clear data point right now is the endpoint.",
    "And complete clarity won’t come until after Easter.",
    "The House voted 349-63 on Sunday for the bill.",
    "Now, the legislation heads to Biden’s desk.",
    "Social Security goes bankrupt in 12 years.",
    "“But it’s a five-year or 10-year problem.",
    "“I don’t know who has it,” Vorndran said.",
    "Medicare goes bankrupt in four years.",
    "That means the vote failed.",
    "Hatchett died last April.",
    "“Sen.",
    "Gov."
  ]
}