{
  "id": 2959,
  "mediaId": 2537,
  "date": "2022-03-08",
  "headline": "Letters: Pray for peace in Ukraine",
  "image": "https://www.gannett-cdn.com/presto/2022/03/02/PREN/98468976-28f0-4a7c-b9cb-3130cf5ec42c-Stand_with_Ukraine_5.JPG?crop=3192,1796,x0,y1053&width=3192&height=1796&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/03/08/letters-pray-peace-ukraine/6981417001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2396,
    3350,
    3709,
    3975,
    5217,
    5287,
    5366
  ],
  "sentences": [
    "President Biden has been strong and deliberate in his application of sanctions against Russia in ways that will hurt the wealthy oligarchs, and prudent in responding to NATO's responsibility to protect its European neighbors while not engaging directly in the Putin war against Ukraine.",
    "Thomas Fester, Bridgetown\nTime for the silent majority to rise again\nIf you were forced to name the most significant difference between progressive Democrats and moderate Democrats, you would have to say that progressives see everything through the prism of race and gender.",
    "The rise in atmospheric CO2 has led to the all-too-familiar variety of threatening consequences: more severe droughts, deadlier heat waves, longer and more intense fire seasons, heavier rainfalls and increased flooding and the list goes on.",
    "It is shocking to me that our own former president, Donald J. Trump, has been publicly praising Putin for this move and even more shocking that the Republicans in elected office are largely silent about these outrageous statements.",
    "We have seen the ruthlessness that Putin has unleashed on any political opponents, stopping at nothing to get rid of them, whether it be by jailing those who would run for his office, or by poisoning those who oppose him.",
    "In his continual quest for greater profits, man has either ignored or dismissed the by-products, waste products and accompanying pollution from his commercial and industrial enterprises as just a part of doing business.",
    "Julie M Murray, Clifton Heights\nRape of Mother Nature has consequences\nIn regards to the March 1 article \"UN panel's climate report grim\": Man, for too long, has believed that he could fool Mother Nature.",
    "The invasion has been ordered by an authoritarian leader who seems to be trying to repeat the power-grabbing, land-stealing tactics that have been proven to create nothing but misery for the world.",
    "Kevin Bertke, Wilder\nMLB labor dispute is dark side of capitalism\nMajor League Baseball players in the starting lineup easily earn in a few days much more than the average American earns in a year!",
    "As the players and management squabble, unable to reach any kind of agreement on matters great and small, the fans are facing the real likelihood that baseball may be delayed for a long time!",
    "Rick Rotundo, Loveland\nChabot's criticism of Supreme Court nominee unfair\nI heard Congressman Steve Chabot on the radio attempting to ridicule President Biden's nominee to the Supreme Court.",
    "Let us not forget that Russia is a nuclear power, and Putin, the man in charge of the nuclear codes, is the very man who is slaughtering Ukrainian citizens as they sleep in their homes.",
    "It creates a carbon credit system that incentivizes farmers to use better growing practices, including sequestration, thereby greatly reducing carbon emissions in U.S. agriculture.",
    "Stephen Druffel, Clifton\nDon't mess up Newport's skyline\nI recently saw the artist rendition of the new skyline we will see in Newport on the riverfront and was very disappointed.",
    "That is why we need a wall or fence to protect the other 300 million who live here as much as the 600 or so in the White House, who all have walls or fences for their protection.",
    "It is too late to undo the damage we have already done, but it is not too late to correct the foolish and reckless behavior that has led to this time of environmental reckoning.",
    "And let us each practice our own non-violence in our words and thoughts even toward Vladimir Putin, who bears such a heavy responsibility for this loss of life and bloodshed.",
    "The Great Pacific Garbage Patch is a floating mass of plastic debris that covers an estimated surface area of 1.6 million square kilometers, an area twice the size of Texas.",
    "President Biden has been doing an excellent job for weeks of sharing the intelligence that saw this coming and warning Russia of the severe consequences if Putin proceeded.",
    "People coming through without mental and physical evaluation so they won't be a burden on us, background checks on criminals, disease control, etc., should all be checked.",
    "It's the reason that they're so far out of the mainstream, but they're so vocal that, at times (and with the help of the media), they appear to be speaking for all of us.",
    "Industry incentives will accelerate transition to clean energy\nThe March 1 article, \"UN panel's climate report grim,\" comes in the shadow of Russia's invasion of Ukraine.",
    "I always think of the missed opportunity that Covington had to make a statement and give its citizens and the city of Cincinnati a skyline that we could be proud of.",
    "Chabot did not seem to approve of her past representation of an abortion rights group and a Gitmo terrorist detainee (as if she would ally herself with a terrorist).",
    "The real shame of it is that they've recruited Joe Biden, once a moderate, to go on that radical journey with them and, in the process, they're dividing our country.",
    "Prayers for peace and fasting are being called for from many spiritual traditions Let us join together with so many around the world who want this violence to cease.",
    "Bipartisan support like this will show that Republicans and Democrats are ready to incentivize the economy as a whole, accelerating our transition to clean energy.",
    "No one is against someone trying to attain a better life for themselves and their family, but we have a right way to do it, it's called legal immigration.",
    "Prior to the Industrial Revolution, which began in the mid-1700s, the average amount of carbon dioxide in the atmosphere was 280 parts per million (ppm).",
    "Economists say the best tools we have for reducing emissions and responsibly accelerating a transition toward clean energy is incentives for industry.",
    "A faster transition away from our dependence on these fuels will blunt the threat of climate change and the aggressive plunder of resources.",
    "Oil and gas production techniques used in Oklahoma (and in sites around the world) often use hydraulic fracturing, also known as fracking.",
    "I always look at the brown/red buildings on Covington's riverfront and it reminds me of something you would see in a communist country.",
    "Chris Heckman, Over-the-Rhine\nA fence around the White House but not southern border\nAgain, we erected a fence around our White House.",
    "I have been in terror for the last week since we have witnessed the unfolding of the violent invasion of Ukraine by Russian troops.",
    "I'm not sure if it is to keep people who voted for them or ones who didn't from getting to our president and elected officials.",
    "One of the worst consequences of this abuse is that our children and grandchildren will pay the price for our folly.",
    "I would like each and every one of them to tell us why we don't need a fence at our southern border to protect us?",
    "This debacle is yet another dark side of American capitalism that is rife with greed and confrontational energies!",
    "Congressman, as an attorney yourself, you know attorneys are advocates, or did you miss that class in law school?",
    "Anyway, they are used to fences, because they all have a fence around their house or live in a gated community.",
    "Scientists have tied this wastewater disposal to a 900-fold increase in earthquakes in Oklahoma since 2008.",
    "Last year, the Farm Bureau applauded passage of the Growing Climate Solutions Act in the Senate 92-8!",
    "We must demand that our federal government become involved in the fight against the climate crisis.",
    "Newport, please don't miss this amazing opportunity to give all of us something spectacular.",
    "Renowned lawyer Alan Brown represented the Ku Klux Klan all the way to the Supreme Court.",
    "Reps. Steve Chabot, Brad Wenstrup and Thomas Massie should support HR 2820 in the House.",
    "Now this same developer is going to do the same thing in Newport, only in off-white.",
    "The UN report, however, reminds us that the climate is changing faster than we are.",
    "Man has fooled himself in thinking his rape of Mother Nature has no consequences.",
    "What difference does a little more fracking-fluid make at a drilling site?",
    "What difference does a little more carbon dioxide make in our atmosphere?",
    "A recent measurement in April 2021 showed an increase of CO2 to 416 ppm.",
    "A lawyer advocate represents parties, or groups as the case may be.",
    "What difference does a little more plastic make in our waterways?",
    "Fracking leads to large-scale underground wastewater disposal.",
    "She does not have to believe in a person or groups' cause.",
    "Oil and gas are funding and fueling Russia's ambitions.",
    "Same style, color and look, with no creativity at all.",
    "It's time for the \"silent majority\" to rise up again!",
    "Elected officials, please tell us the difference.",
    "Do you think he agreed with their views?",
    "What can we do to help the Ukraine?",
    "Richard Goldberg, Symmes Twp.",
    "Janice Wilson Mason",
    "Now."
  ]
}