{
  "id": 3181,
  "mediaId": 2746,
  "date": "2022-03-10",
  "headline": "House Democrats unveil districts they hope to flip from red to blue",
  "image": "https://twt-thumbs.washtimes.com/media/dupe--image/2019/11/15/Trump_Impeachment_87480.jpg-ba48d.jpg_2021.11.19-2021.i.1637383623.5_c0-99-3872-2357_s1200x700.jpg?56d3936c46301507a082230bc3f26fac129d51c9",
  "link": "https://www.washingtontimes.com/news/2022/mar/10/house-democrats-unveil-districts-they-hope-to-flip/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ramsey Touchberry",
  "authorUrl": "https://www.washingtontimes.com/staff/ramsey-touchberry/",
  "termIds": [
    2503,
    3159,
    4246,
    4780,
    300,
    302,
    878,
    5371
  ],
  "sentences": [
    "“Our candidates and members are veterans, teachers, doctors and public servants who know the struggles of working families, are committed to service, and are building the kinds of campaigns that will send Democrats back to Washington with the majority needed to deliver for the people,” Mr. Maloney said.",
    "The Democratic Congressional Campaign Committee, the campaign arm of House Democrats, is featuring a dozen candidates on its Red-to-Blue list who it says will receive additional organizational and fundraising support, strategic guidance, staff resources and candidate training, among other things.",
    "Emilia was the first Black female lawmaker under the age of 30 to serve in the Ohio state legislature, and as a state representative she has fought for tax cuts, higher wages, funding for high-speed internet, and safer working conditions.",
    "• IA-01: Christina Bohannan has spent her time in public office fighting for working families, looking out for seniors, pushing for more investment in public schools, and helping Iowa families and small businesses recover from COVID-19.",
    "This is how the DCCC described the 12 additions to its Red-to-Blue list (by congressional districts):\n• CA-22: Rudy Salas worked his way from laboring in the fields of the Central Valley with his father to the California State Assembly.",
    "When elected to this district — once safely red and now a major pick-up opportunity — Nikki will continue fighting to bring more good-paying manufacturing jobs back to Illinois and our country and ensure no family is left behind.",
    "Greg has fought for legislation on issues like eviction prevention, comprehensive childcare, domestic violence prevention, support for small businesses, and even helped raise wages for city workers and empower local labor unions.",
    "While in Congress, Max passed a law to lower prescription drug prices, increased funding to combat the opioid epidemic, and voluntarily deployed with the National Guard on Staten Island to help set up a COVID-19-only hospital.",
    "Liz is a lifelong Iowan and as a state Senator, she has been a champion for families struggling with the state’s Medicaid program and created numerous measures that focused on children, Iowa’s economy and educational growth.",
    "“Across the country, voters are going to fire House Republicans because their dangerous agenda for our families is rotten at the core and will ruin America,” said Rep. Sean Patrick Maloney of New York, chairman of the DCCC.",
    "Jay is running a fact-based, honest campaign and holding Michelle Steel accountable for putting deep-pocketed special interest backers ahead of constituents and opposing funding for needed infrastructure projects back home.",
    "House Democrats are setting their sights on several GOP-held districts they believe they can flip, even as the party faces a tough midterm election environment in which it is widely anticipated to lose the majority.",
    "• IA-02: Liz Mathis has represented Iowans in the State Senate for over a decade, and now she’s stepping up to take on vulnerable GOP freshman incumbent, Ashley Hinson, who is out of touch with the district.",
    "• CA-45: Jay Chen has dedicated his life to public service, from his leadership on Operation Inherent Resolve to bring justice to ISIS, to his role on a local school board expanding access to education.",
    "Republicans will spend heavily to claim this seat for one of their extreme candidates, but Brittany is mounting an impressive grassroots campaign and is already securing major endorsements.",
    "• CO-07: Brittany Pettersen has spent nearly a decade fighting for Coloradans in the state legislature, and now she’s stepping up to run for CO-07 to ensure Democrats win this open seat.",
    "• OH-01: Greg Landsman has dedicated his career to making life better for children and families, and is running to make sure the residents of OH-01 are well-represented in Washington.",
    "Republican incumbent Yvette Herrell has consistently voted against her district’s best interests and even endangered New Mexicans by spewing false medical advice to treat COVID-19.",
    "• MI-03: Hillary Scholten is a West Michigan native who has dedicated her life to helping people and will bring solution-oriented leadership to Congress when she flips MI-03.",
    "She’s running for Congress to unseat Republican incumbent Mariannette Miller-Meeks — who won by just six votes in 2020 — and expand opportunities for all Iowans.",
    "Steel won in 2020 by a slim two-point margin, and Jay has an outstanding opportunity to win this district and restore integrity and accountability to this seat.",
    "His record of results is a stark contrast from David Valadao, who opposed the Bipartisan Infrastructure Law and voted for cuts to Social Security and Medicare.",
    "As a member of the Army Reserve, a dedicated guidance counselor, and a member of the Babylon Town Council, Jackie has served her community and country proudly.",
    "• NM-02: Gabe Vasquez is a first-generation American who is running in NM-02 to be a champion for working families and build an economy that benefits everyone.",
    "Gabe has promoted policies that created thousands of jobs, and helped craft a comprehensive development plan that focused on lifting families out of poverty.",
    "• NY-01: Jackie Gordon is an immigrant, Army veteran, educator, and public servant running a strong campaign to flip this Long Island seat from Red to Blue.",
    "NY-01 is an open district President Biden won by 11 points in 2020, making it one of the best pick-up opportunities for Democrats in the entire country.",
    "The Republican primary is in disarray as vulnerable incumbent Peter Meijer faces an extreme, Trump-endorsed candidate opposing him from the far right.",
    "Liz has built a strong grassroots campaign and is neck-and-neck with Hinson in the polls after Hinson won by less than three points in 2020.",
    "Nikki has traveled the country fighting for workers’ rights and helping them get the pay and workplace safety conditions Americans deserve.",
    "Republican incumbent Nicole Malliotakis has tied herself to extremists and has gone out of her way to advance the GOP’s reckless agenda.",
    "The GOP is eager to attack Emilia’s successful record and her extremist Republican opponents are gearing up to run far to the right.",
    "She is no stranger to winning important races — her double-digit win in 2018 helped the party take the majority in the state Senate.",
    "• OH-13: Emilia Sykes has been working to level the playing field for the people of Ohio as a state representative since 2014.",
    "Hillary would be the first Democrat to represent Grand Rapids in 45 years and the first woman ever elected to this seat.",
    "His GOP opponent, Steve Chabot, has spent his entire career voting against the interests of his constituents.",
    "He’s spent his career fighting for more public safety funding, workers, veterans, and small business owners.",
    "• NY-11: Max Rose knows what it takes to flip this Staten Island and Brooklyn-based seat back to Democrats.",
    "Due to redistricting, there are 100,000 new voters in this district who have never voted for Chabot.",
    "Max is a proven leader and has what it takes to beat Malliotakis in this top pick-up opportunity.",
    "When elected, Rudy will be the first Latino to represent California’s Central Valley.",
    "• IL-13: Nikki Budzinski is a proven leader and a champion for Illinois families."
  ]
}