{
  "id": 6197,
  "mediaId": 2511,
  "date": "2022-02-01",
  "headline": "House Democrats press for vote on US-China competition bill",
  "image": "https://www.aljazeera.com/wp-content/uploads/2021/03/2021-03-08T213031Z_1551164589_RC297M9MPDZT_RTRMADP_3_HEALTH-CORONAVIRUS-USA-AID.jpg?resize=1200%2C630",
  "link": "https://www.aljazeera.com/economy/2022/2/2/bb-house-democrats-press-for-vote-on-us-china-competition-bill",
  "mediaOutlet": "Al Jazeera",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Billy House and Daniel Flatley",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "‘Look tough on China’\nRepresentative Michael McCaul, a Texas Republican, who sponsored the provision to provide $52 billion in assistance to the chip industry, said the House bill doesn’t include any meaningful curbs on intellectual property theft attempts or address China’s record on human rights.",
    "While Democrats have the votes to push the legislation through the House, Republican opposition will increase the difficulty of negotiations ahead to find a compromise with the Senate, which passed a similar $250 billion measure with bipartisan support last June.",
    "“I’ve spoken to a number of my former colleagues in the House and though they are publicly — and I think privately — disappointed in the House’s work product, they understand that the reason it was done in that fashion was to expedite its completion,” he said.",
    "Provisions in the legislation include $52 billion to support domestic chip research and production amid a global semiconductor shortage, as well as authority for $45 billion to improve the nation’s supply chains to prevent shortages of critical goods.",
    "If a deal is struck between the House and Senate, the resulting legislation would mark a significant victory for President Joe Biden as his party is facing the potential of losing control of Congress in the November midterm elections.",
    "Senator Todd Young, an Indiana Republican, who was a main sponsor of the Senate bill with Majority Leader Chuck Schumer, said he had “qualified optimism” that the issues could be worked out in negotiations between the two chambers.",
    "House Republicans criticized a Democratic-led bill intended to make the U.S. economy more competitive as filled with concessions to China, throwing up obstacles to a measure that would also aid the domestic semiconductor industry.",
    "Her message to Republicans has been, while they may not like every part of the bill, it’s important to pass it and get to negotiations with the Senate, where they can make changes.",
    "Democrats are aiming for a House vote this week on their version of legislation envisioned as a vehicle for bolstering U.S. manufacturing and research and development.",
    "“This is a desperate political ploy in anticipation of the mid-terms.”\nThey and other Republicans also oppose some of the climate spending that is in the legislation.",
    "While the Senate bill has GOP support, Republican leaders in the House were urging their members to vote against it when it comes to the floor.",
    "The bill set for a procedural vote on the House floor on Wednesday with a vote on passage likely on Friday, according to a Democratic aide.",
    "“This bill is an attempt to look tough on China without taking any real action,” said GOP Representative Steve Chabot of Ohio.",
    "It also would set up programs to increase science, technology, engineering, and mathematics education and training.",
    "The House bill has some significant differences with the Senate version, including provisions on trade.",
    "Americas Coverage Newsletter\nCommerce Secretary Gina Raimondo has been lobbying GOP lawmakers.",
    "“And they’re hopeful that we can produce something they can vote for in the end.”",
    "The Biden administration backs passage of the House legislation."
  ]
}