{
  "id": 6281,
  "mediaId": 2649,
  "date": "2022-02-10",
  "headline": "Rams and Bengals team owners pour money into political giving",
  "image": "https://cdn1.opensecrets.org/news/wp-content/uploads/2022/02/11181204/gettyimages-1369238780-594x594-1.jpg",
  "link": "https://www.opensecrets.org/news/2022/02/rams-and-bengals-team-owners-pour-money-into-political-giving",
  "mediaOutlet": "opensecrets.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Massoglia",
  "authorUrl": "https://www.opensecrets.org/news/author/amassoglia/",
  "termIds": [
    0
  ],
  "sentences": [
    "Los Angeles Rams owner Stan Kroenke and Cincinnati Bengals owner Mike Brown, along with their wives, have given more than $1.9 million in political contributions with beneficiaries ranging from candidates at the state and federal level to inaugural funds.",
    "The Kroenkes have given to groups across the political spectrum at the federal level while Brown has poured money into state races and his political giving has been more focused on boosting Republican candidates.",
    "Rams owner Stan Kroenke and his wife, Wal-Mart heiress Ann Walton Kroenke, have given more than $469,000 to campaigns and political groups, federal and state campaign finance records show.",
    "The Cincinnati Bengals are preparing to play the Los Angeles Rams in the Super Bowl LVI on Sunday, and the owners of both teams have also used their deep pockets to play politics.",
    "Brown and his wife also directed contributions to Army veteran Sam Brown, who is vying against former Attorney General Adam Laxalt for the GOP nomination in Nevada’s Senate race.",
    "The Bengals owner gave to Ohio Republican Party Chair Jane Timken, a contender in Ohio’s crowded May 3 Republican primary vying for the seat held by Sen.",
    "?Kroenke gave $1 million to Trump’s inauguration committee after his 2016 election, as noted by NBC LX’s analysis of the team owners’ campaign finances.",
    "The Kroenkes’ top beneficiary of political giving since 1992 has been the Republican National Committee with about $225,000 in total contributions.",
    "Since the 2016 election cycle, Kroenke and his wife dished out $33,400 to the DNC Services Corp and the National Republican Senatorial Committee.",
    "During the 2022 election cycle, Brown and his wife have given primarily to candidates in Ohio, including incumbent GOP Reps.",
    "During the 2020 election, Brown made a $30,000 contribution to Trump Victory, Trump’s ?",
    "But both team owners have steered money to former President Donald Trump.",
    "Rob Portman (R-Ohio), who is not seeking reelection.",
    "?big-dollar joint fundraising committee.",
    "?Steve Chabot and Brad Wenstrup.",
    "?",
    "?"
  ]
}