{
  "id": 7079,
  "mediaId": 2574,
  "date": "2022-01-26",
  "headline": "Top Dem Recruit in Ohio Swing District Wrote Proposal To Defund Police Amid Homicide Spike",
  "image": "https://freebeacon.com/wp-content/uploads/2022/01/Screen-Shot-2022-01-25-at-1.54.09-PM-e1643136906164.png",
  "link": "https://freebeacon.com/democrats/top-dem-recruit-in-ohio-swing-district-wrote-proposal-to-defund-police-amid-homicide-spike/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Collin Anderson",
  "authorUrl": "https://freebeacon.com/author/collin-anderson/",
  "termIds": [
    0
  ],
  "sentences": [
    "Landsman confirmed to the Cincinnati Enquirer in December that national Democrats asked him to run against Chabot in the state's First Congressional District—a swing seat that the DCCC has identified as a top target—and announced his campaign weeks later.",
    "As a Cincinnati city councilman in the summer of 2020, Democrat Greg Landsman penned a motion to pull $200,000 from the city's police budget to help fund the Citizen Complaint Authority, an independent group that investigates law enforcement officers.",
    "The Republican secured reelection by 7 points in 2020, but it's unclear how his district will change between now and November—the Ohio Supreme Court has yet to sign off on the Ohio Redistricting Commission's latest map.",
    "\"Under Democrat leadership, Cincinnati is experiencing record-high homicides, violent crime rates three times Ohio's and double the nation's, and a 64 percent increase in murders in April 2021,\" McLaughlin said.",
    "Landsman's proposal to defund police did not deter the Democratic Congressional Campaign Committee (DCCC) from recruiting the councilman to challenge Ohio Republican congressman Steve Chabot this November.",
    "Committee chief of staff Kristin Slevin, meanwhile, encouraged activists to keep \"raising hell\" after the Minneapolis City Council announced its intention to disband the city's police department.",
    "The proposal came as Cincinnati experienced an unprecedented number of homicides—the city saw an all-time record high of 94 killings in 2020, six more than its previous high of 88 in 2006.",
    "DCCC digital strategist Nijeria Boone, for example, labeled police a \"terrorist group\" and called to \"abolish the police\" because \"they were created to capture runaway slaves.\"",
    "Committee chairman Sean Patrick Maloney asserted last year that Democrats do not support defunding the police, an accusation that he dismissed as a \"Republican talking point.\"",
    "A top Democratic Party recruit to run for Congress in an Ohio swing district wrote a proposal to defund Cincinnati police as the city experienced a spike in murders.",
    "\"I believe the changes that are absolutely public safety-related—which these are—should come from the public safety budget, should come from the police budget.\"",
    "\"The question that I think we're all going to have to wrestle with is, ‘What does public safety look like now, and what does it need to look like?'\"",
    "Landsman and his liberal buddies are not the ones hurt from these disturbing policies, it's the poor and disadvantaged who will suffer.\"",
    "Landsman defended his controversial motion, which came during the height of the defund movement, during a June 2020 interview with WLWT.",
    "According to a 2020 Quinnipiac poll, 82 percent of Ohio voters \"approve of the way police in their community are doing their job.\"",
    "\"Instead of prioritizing law and order, Democrat elites like Greg Landsman advocate for defunding Cincinnati's police.",
    "In addition to Landsman, Maloney has elevated other defund the police activists during his tenure as committee chair.",
    "Ohio Republican Party spokeswoman Tricia McLaughlin, a Cincinnati native, called Landsman's proposal \"disturbing.\"",
    "Nationally, just 18 percent of Americans support the movement to defund police, a 2021 USA Today poll shows.",
    "The local NBC affiliate noted that the Democrat's proposal is \"basically the definition of defunding.\"",
    "Landsman's past support for the defund movement is unlikely to impress local voters.",
    "One fatal shooting occurred just two days before Landsman unveiled his motion.",
    "Just weeks later, the city suffered its fourth double homicide of the year.",
    "Landsman is thus far the only Democrat to launch a campaign against Chabot.",
    "Neither the DCCC nor Landsman returned requests for comment.",
    "Landsman said."
  ]
}