{
  "id": 10362,
  "mediaId": 8346,
  "date": "2022-04-02",
  "headline": "Kenyon alum Mike Gibbons leads United States Senate race in Ohio",
  "image": "https://kenyoncollegian.com/wp-content/uploads/2017/07/logo-placeholder.jpg",
  "link": "https://kenyoncollegian.com/features/2022/04/kenyon-alum-mike-gibbons-leads-united-states-senate-race-in-ohio/",
  "mediaOutlet": "kenyoncollegian.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charlie Stutz",
  "authorUrl": "",
  "termIds": [
    2290,
    2684,
    5581,
    1489,
    1126,
    195,
    694,
    6474,
    6067
  ],
  "sentences": [
    "… The idea that everyone should live off the government is completely wrong and that is what I stand for as a conservative.” Gibbons also discussed his belief that climate change is not caused by humans and condemned the Green New Deal.",
    "With a plurality (34.3%) of Ohio Republican voters still undecided, according to Real Clear Politics, and the coveted Trump endorsement still up for grabs, this primary will continue to be cutthroat and aggressive.",
    "Mandel has maintained much of his supporter base throughout the primary campaign and has big-name endorsements like Sen. Mike Lee of Utah, Sen. Cynthia Lummis of Wyoming and radio personality Mark Levin.",
    "Despite his firm competition, Gibbons shot up in the polls and is now ahead of Mandel by a little over one percentage point, according to Real Clear Politics (20% Gibbons, 18.7% Mandel).",
    "Gibbons started out in the Senate race with virtually no name recognition in a crowded field of well-known Republicans like Jane Timken, former chair of the Ohio Republican Party, J.D.",
    "I’m there to point those consequences out.” He further believes that a reduction in spending by the government can lead to lower taxes, which help fuel job growth through businesses.",
    "“I have done it, and I want my kids to have the same opportunity.”\nGibbons believes the opportunity to achieve the American dream comes through businesses rather than government.",
    "After graduating in 1974, Gibbons went on to obtain a master’s in management from Case Western Reserve University and a law degree from the Cleveland-Marshall College of Law.",
    "During his time at Kenyon, Gibbons studied economics and political science, while also playing on the football team, and was a member of the Beta Theta Pi fraternity.",
    "According to Inside Elections, this Ohio election is “solid Republican,” meaning that whoever wins the Republican primary will most likely win the general election.",
    "Gibbons and Mandel will fight tirelessly in the next two weeks in order to edge ahead of each other, with Timken, Moreno and Vance trying to remain in contention.",
    "At the beginning of spring break, I had the opportunity to speak with Mike Gibbons ’74, leading Republican candidate for an Ohio seat in the United States Senate.",
    "In these ads, he frequently uses football analogies and calls himself “Trump Tough” and his Republican opponents “RINOs” (Republican in Name Only).",
    "He later founded Brown Gibbons Lang & Company in 1989, which has grown to become one of the largest middle market investment banks in the country.",
    "But I do believe that civil society is where most of the aid for the poor and for the people who aren’t in a good position should come from.",
    "Vance, author of Hillbilly Elegy, and Josh Mandel, former treasurer of Ohio and the previous Republican frontrunner in the polls.",
    "The investment banker sees himself as an example of the American dream and wants every American to believe in this ethos.",
    "Gibbons has also received the endorsement of Kentucky Sen. Rand Paul, as well as a few other Ohio state legislators.",
    "Gibbons often points to his meager upbringing in Cleveland as a primary motivation behind his career in politics.",
    "Part of Gibbons’ success in the polls can be attributed to his attack ads smearing his Republican opponents.",
    "“If you work hard in America, put in the time and the effort, you can achieve the American dream,” he said.",
    "“I believe strongly that the Republican agenda is the agenda that helps people get ahead,” he said.",
    "He credits a former Kenyon political science professor with helping him find his direction in life.",
    "“Every dollar spent in the public sector, it’s a dollar taken out of the private sector,” he said.",
    "The success of Gibbons’ campaign seems promising to his supporters, but he has work ahead of him.",
    "Additionally, he expressed concerns that the current high inflation hurts working-class Ohioans.",
    "“I believe in negotiating bills when we take into account all the consequences of those bills.",
    "… If it wasn’t for this great country I live in, I wouldn’t be where I am now,” he told me.",
    "“I believe we should help the people who can’t help themselves.",
    "“I pretty much started out with nothing."
  ]
}