{
  "id": 10738,
  "mediaId": 2526,
  "date": "2022-03-07",
  "headline": "Russians, Ukrainians Increasingly Using Southern Border to Get into U.S.",
  "image": "https://media.breitbart.com/media/2022/03/GettyImages-1309857815-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/07/russians-ukrainians-increasingly-using-southern-border-to-get-into-u-s/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    1708,
    4905,
    3909,
    1126,
    1397,
    6672,
    6678,
    6569
  ],
  "sentences": [
    "“And if we did that, then I think our citizens would feel like their own leaders were actually looking out for them.”\nRepublican primary voters who attended the Conservative Political Action Conference (CPAC) in recent weeks said, overwhelmingly, they are far more concerned with illegal immigration at the southern border than the borders of Ukraine.",
    "As Republican and Democrat lawmakers focus their attention on the borders of Ukraine amidst Russia’s invasion, U.S. Customs and Border Protection (CBP) data reveals that a growing number of Russians and Ukrainians are using the southern border to get released into the U.S. interior.",
    "Aside from granting quasi-amnesty known as Temporary Protected Status (TPS) to about 75,000 Ukrainians in the U.S., Biden’s State Department is making it easier for Ukrainians to apply for tourist visas and work permits to enter the U.S.\nJohn Binder is a reporter for Breitbart News.",
    "The data comes as many Republicans and Democrats urge President Joe Biden to further involve the U.S. in the Russia-Ukraine conflict, even as 72 percent of Americans said the U.S. should play only a “minor role” or “no role at all,” including 76 percent of Republicans.",
    "[Emphasis added]\nLast week, Rep. Lou Correa (D-CA) said during congressional testimony that he witnessed a number of Russian and Ukrainian border crossers arriving via car at the San Ysidro, California Port of Entry (POE) when he visited the region in February.",
    "@JDVance1: “If we’re going to send $10 Billion of aid to the Ukrainians…What Republicans should do to look out for our own voters is to say that for every $1 that goes to the Ukrainians we should send $3 to the American southern border.",
    "Finish President Trump’s border wall…\" pic.twitter.com/LMhzkw6hKG\n— JD Vance for U.S. Senate Press (@JDVancePress) March 4, 2022\n“Get some more Border Patrol agents to control that crisis at our own border,” Vance continued.",
    "[Emphasis added]\n…\nYet almost all the Russians and Ukrainians have been allowed to remain while they pursue asylum claims, and their presence has been notable at border-area shelters aimed at helping newcomers.",
    "In one instance, Correa said Department of Homeland Security (DHS) officials noted that 20 vehicles had recently been pulled over by Border Patrol at the POE — all packed with Russian and Ukrainian nationals.",
    "“What Republicans should do to look out for our own voters is to say that for every $1 that goes to the Ukrainians we should send $3 to the American southern border,” Ohio Republican Senate candidate J.D.",
    "Reuters reports:\nU.S. border officials encountered about 6,400 Russians in the four months between October 2021 and January of this year, Customs and Border Protection (CBP) data show.",
    "Russian and Ukrainian nationals are increasingly arriving at the United States-Mexico border in the hopes of being released into the nation’s interior, newly released data shows.",
    "The jump is similar for Ukrainians, with a little more than 1,000 apprehended since October 2021 through January, compared to about 680 for all of the last fiscal year.",
    "Only 16 percent said the Russia-Ukraine conflict was a larger threat to the U.S.\nBiden, in recent days, has opened a number of migration pipelines for Ukrainians.",
    "Overall, 81 percent of CPAC attendees said illegal immigration is a larger threat to the U.S. than the ongoing Russia-Ukraine conflict.",
    "That’s more than the roughly 4,100 apprehended during the entire 2021 fiscal year, which ended Sept. 30.",
    "Vance told Fox News’ Tucker Carlson last week.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here.",
    "."
  ]
}