{
  "id": 10755,
  "mediaId": 2664,
  "date": "2022-03-18",
  "headline": "JD Vance's hapless senate campaign destroyed after ‘electorally stupid’ Ukraine comment: conservative",
  "image": "https://www.rawstory.com/media-library/j-d-vance.png?id=27950485&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/dont-care-about-jd-vance/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    5660,
    1701,
    1790,
    2844,
    4325,
    4306,
    1128,
    980,
    6396,
    6672
  ],
  "sentences": [
    "— Michael Brodkorb (@Michael Brodkorb) 1645750979\n“Michael Brodkorb, former deputy chair of the Minnesota Republican Party, observed that ‘numerous Republican operatives’ were ‘fuming’ about the selection of Vance as the keynote speaker, highlighting Vance’s ill-informed and callous — not to mention electorally stupid — comments about Russia’s invasion of Ukraine as a primary reason for their ire.",
    "pic.twitter.com/nBEqVJWFjD\n— Brian McClung (@Brian McClung) 1646163936\nAs it turns out, McClung wasn't the only GOP operative to say they weren't interested in giving a donation of any kind to see Vance speak.",
    "\"Scheduled on April Fool’s Day with no apparent sense of irony, the invite went out in late February and almost immediately, Minnesota Republicans pushed back against Vance’s selection,\" wrote Swift.",
    "NOW WATCH: Missouri Republican faces backlash after grilling 14-year-old trans girl about getting ‘the procedure’\nMissouri Republican faces backlash after grilling 14-year-old trans teen",
    "Though maybe the objection is really about Vance being Vance.”\nVance is already so far right that he is retweeting conspiracy theories about \"camps\" where sick Americans would be sent.",
    "NEW: I\\u2019m starting a new about the controversy surrounding the @MNGOP scheduling @JDVance1 as the keynote speaker at the upcoming #MNGOP Lincoln Reagan Dinner on April 1, 2022.",
    "The guy who said \\u201cI gotta be honest I don\\u2019t really care what happens to Ukraine one way or another.\\u201d Seems appropriate the dinner is on April Fools Day.",
    "Writing for the Bulwark, Jim Swift explained that the far-right candidate isn't doing well in his efforts to become the next famous Republican politician.",
    "As it turns out, he's only polling in third place in the race and he's been nixed from speaking at the Minnesota GOP’s annual Lincoln-Reagan dinner.",
    "After weeks of bombs falling on civilians all over social media and U.S. news, the support for those fighting Vladimir Putin is soaring.",
    "It's clear he made a miscalculation about where the American people were on the issue, and more specifically, his own voters.",
    "He was already controversial, but after his statements about the war, his political career appears to be collapsing.",
    "Vance made it clear last month that he doesn't \"really care\" about the invasion thousands of miles away in Europe.",
    "I\\u2019ve spoken with numerous Republican operatives today who are fuming with the selection of Vance.",
    "While Vance half-walked back his comments, he then appeared on Fox's Tucker Carlson and doubled down.",
    "Swift also remembered Vance is \"under fire for investing in the platform Rumble with Peter Thiel.\"",
    "A Yahoo poll and Pew survey show support for the people of Ukraine is over 70 percent.",
    "Then he was honored with the endorsement by toxic Rep. Marjorie Taylor Greene (R-GA).",
    "Rumble has become the new home for Russia's English propaganda channel, RT.",
    "Tim Pawlenty made it clear the party had made a big mistake.",
    "When the event was announced, the former spokesman for Gov.",
    "Got my invite to @mngop Lincoln Reagan Dinner feat.",
    "Now it appears voters don't much care about J.D.",
    "\"Poor guy can’t catch a break,\" Swift closed.",
    "Cancel it & raise $ for Ukraine instead.",
    "Putin apologist @JDVance1.",
    "Ohio Senate candidate J.D.",
    "Vance."
  ]
}