{
  "id": 10915,
  "mediaId": 2590,
  "date": "2022-03-18",
  "headline": "Ohio Senate Candidate Appears To Call Opponent 'Pussy' At Forum",
  "image": "https://img.huffingtonpost.com/asset/6235266724000093a196d148.jpeg?cache=PmwXUu6LNM&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/josh-mandel-mike-gibbons-ohio-senate-republican-heated-exchange_n_623511dae4b0d39357c7faaa",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    5581,
    2290,
    1489,
    980,
    6474,
    6172
  ],
  "sentences": [
    "PREVIOUSLY:\nAdvertisement\nRepublican Senate primary candidates Mike Gibbons and Josh Mandel stunned Ohio audiences Friday night when the two got in each other’s faces at a forum and Mandel appeared to call Gibbons a “pussy.”\n“You’re dealing with the wrong guy,” Mandel, the race’s evangelical-backed candidate, appeared to say after a heated exchange about Gibbons’ business interests in China, seemingly mumbling under his breath: “You watch what happens.",
    "pic.twitter.com/fQuqfHxXHT\n— Heartland Signal (@HeartlandSignal) March 18, 2022\nGibbons, an investment banker who’s self-funding his campaign, accused Mandel, a former Ohio treasurer, of not understanding how business works because “you’ve never been in the private sector in your life.”\nAdvertisement\n“You don’t know squat!” Gibbons said.",
    "(The former president was famously caught on tape saying that as a celebrity he could he do anything he wanted with women, including “grab ’em by the pussy.”)\nThe entire Republican Senate field participated in the forum hosted by FreedomWorks, a conservative advocacy organization, in Gahanna, Ohio.",
    "The Ohio Democratic Party released a short statement after the forum:\n“We encourage every voter to watch this forum and see for themselves why these Republicans do not deserve to be in the United States Senate.”\nThis article has been updated with comments from the campaigns of Mandel and Gibbons.",
    "In a press release after the forum, Gibbons denounced Mandel as “unhinged, unfit and flailing — because he’s losing.”\nAdvertisement\nMaking the incident all the more disturbing, the two men are the current front-runners in the primary to replace Republican Sen.",
    "Jeff Dean/Associated Press\nGibbons has become a new target since a recent poll showed him dueling with Mandel for front-runner status, especially for his comments on outsourcing and doing business with China.",
    "Jay LaPrete/Associated Press\nUPDATE: March 20 — A new slowed-down video released by Mandel’s campaign casts doubt on which candidate may have said the offending word, showing Gibbons appearing to mouth it.",
    "It underscores just how intense Ohio’s primary has gotten and the extreme plays the candidates are willing to make to get Donald Trump’s attention.",
    "Pussy.”\nMandel’s campaign denied it was Mandel who used the slur, citing a different video purporting to show Gibbons uttering the word.",
    "Mandel, meanwhile, has been running his campaign through evangelical churches and has the endorsement of 114 Ohio pastors.",
    "He catapulted to the top of the field after spending $12 million on an aggressive ad blitz to introduce him to voters.",
    "This is ridiculous.”\nInvestment banker Mike Gibbons is spending millions of his own money on his U.S. Senate bid.",
    "As Gibbons and Mandel tangled, two other candidates, former Ohio Republican chair Jane Timken and author J.D.",
    "Mike Gibbons and Josh Mandel get in each other’s faces at tonight’s GOP #OHSen forum hosted by FreedomWorks.",
    "Vance, sat quietly in the background, appearing to suppress laughter as the two men nearly came to blows.",
    "Meanwhile, Gibbons’ campaign spokeswoman Samantha Cotton said, “It was Mandel” who said the word.",
    "Don’t tell me I haven’t worked!” Mandel responded, getting close to Gibbons’ face.",
    "Josh Mandel appeared to lose his cool with a rival at a Senate forum.",
    "The moderator intervened just as Vance urged them: “Guys, sit down.",
    "Both campaigns continue to deny that it was their candidate.",
    "“You watch what happens,” Mandel says.",
    "Rob Portman, who is retiring.",
    "“Two tours in Iraq.",
    "God damn.",
    "C’mon."
  ]
}