{
  "id": 112,
  "mediaId": 2550,
  "date": "2022-02-26",
  "headline": "Abbreviated Pundit Roundup: A moment of moral clarity",
  "image": "https://images.dailykos.com/images/1041847/story_image/GettyImages-1238750286.jpg?1645817052",
  "link": "https://www.dailykos.com/stories/2022/2/26/2082436/-Abbreviated-Pundit-Roundup-A-moment-of-moral-clarity?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5507,
    2611,
    2683,
    4905,
    4591,
    2885,
    3522,
    3838,
    3853,
    6569,
    6672
  ],
  "sentences": [
    "x\nFormer US presidents on Russia’s invasion of Ukraine:\nClinton: “Brazen violation”\nGWB: “The gravest security crisis on the European continent since World War II”\nObama: “A brazen attack on the people of Ukraine, in violation of international law”\nTrump: “That’s pretty smart”\n— Josh Campbell (@joshscampbell) February 24, 2022\nDavid A Graham/Atlantic:\nPutin’s Useful Idiots\nToo many Republicans who know better are serving as mouthpieces for the Kremlin.",
    "In the primary campaign for Texas’ 28th district, it is Mr. Cuellar’s experience versus Ms. Cisneros’s storytelling: the powerful and connected versus the underdogs, the community, the “pueblo.”\nThere have been many changes here since Ms. Cisneros first challenged Mr. Cuellar, but the most significant may have been the shock for both parties of seeing Hispanic voters lurch toward Mr. Trump in 2020.",
    "— James Surowiecki (@JamesSurowiecki) February 26, 2022\nBloomberg:\nEU Set to Freeze Assets of Russia’s Putin, Lavrov Over Ukraine\nEuropean Union diplomats approved a plan to sanction Russian President Vladimir Putin and Foreign Minister Sergei Lavrov over the invasion of Ukraine, a move that would freeze their overseas assets, according to two senior officials.",
    "A full-scale diplomatic response to Russia’s invasion of Ukraine could include:\nSuspending Russia from international organizations, like the SWIFT network of banks (as Representative Adam Schiff, a California Democrat, suggested yesterday) and the Interpol network of law enforcement (as Garry Kasparov, the Russian opposition figure, has called for).",
    "Abraham notes that “many of the most illustrious members of the court were judicially inexperienced,” among them eight of the 16 chief justices (leaving the interim chief John Rutledge out of it): John Marshall, Salmon P. Chase, Morrison R. Waite, Melville W. Fuller, Charles Evans Hughes, Harlan F. Stone, Earl Warren and William H. Rehnquist.",
    "Some financial analysts have likened ousting Russia from SWIFT, which would be an unprecedented move against one of the world's largest economies, as a “nuclear option.”\nThe Society for Worldwide Interbank Financial Telecommunication, or SWIFT, is a cooperative of financial institutions formed in 1973 with headquarters in Belgium.",
    "https://t.co/mQHAX7ZSOs\n— Matthew Yglesias (@mattyglesias) February 25, 2022\nNY Times:\nAfter Trump Surge, a Liberal Democrat in South Texas Shifts Tactics\nIn her second run for Congress, Jessica Cisneros has moved from pitching progressive policies to attacking the incumbent Democrat, Representative Henry Cuellar.",
    "pic.twitter.com/0azqpni1hp\n— Nick Martin (@nickmartin) February 25, 2022\nJamelle Bouie/NY Times:\nLet’s Bring the Supreme Court Back Down to Earth\nIf significant experience as a judge is what it means to be qualified for the Supreme Court, however, then most iterations of the court have been patently unqualified.",
    "Although an old tradition held that “politics stops at the water’s edge”—in other words, everyone should back the president in foreign policy—the Trump administration showed the folly and futility of that view: Many people criticized his handling of world affairs, and often rightly so.",
    "What is galling about these comments from Pompeo and Trump is not their break with the White House but their insistence on heaping praise on Putin, a habit that springs from Trump’s personal affection for Putin as well as his admiration for authoritarian politics.",
    "Soon, Russian missiles were blasting practically every city in Ukraine, Russian tanks were rolling into Ukrainian cities, and Ukrainian children were huddling in bomb shelters...\nx\nSo many Putin-friendlies in US live by performative bullshit.",
    "x\nOne of Trump's closest evangelical allies, Robert Jeffress, today in his newsletter describes Russia's invasion of Ukraine as \"lawless\" and \"an awful display of needless aggression by a glory-hungry dictator\" (but does not mention Trump).",
    "x\nAfter some considerable hand ringing among some over \"picking a qualified person regardless of race\" it sure seems like Biden picked a person who meets or exceeds the typical qualifications of the historically white and male SC nominees.",
    "Of the 108 men (and two women) to have served on the court before 2007, according to the legal historian Henry J. Abraham in his history of Supreme Court appointments, 26 had 10 or more years of experience on any court, state or federal.",
    "85% now view it unfavorably -- the highest since the end of the Cold War.https://t.co/FC6bhfEnAD pic.twitter.com/ibOQc3bm0S\n— Aaron Blake (@AaronBlake) February 25, 2022\nNBC:\nSWIFT banking system could be used as sanction against Russia.",
    "The asset freeze, which comes in addition to a broader package of sanctions that the EU approved early Friday, does not affect the ability of Putin or Lavrov to travel, the officials said, as the EU seeks to keep diplomatic avenues open.",
    "— David Frum (@davidfrum) February 25, 2022\nx\nRepublican lawmaker who refused to impeach Trump for using US weapons supplies to try to blackmail Zelenskiy into providing \"dirt\" on Biden to use against him in the 2016 election.",
    "Ukraine wasn’t threatening Russia in any way; Ukraine never fired a shot into their neighbor, even though that neighbor had already carved off pieces of their country in 2014 and subjected them to a grinding eight-year war.",
    "In South Texas, another test is developing over the power of identity politics and whether liberals can answer the fears that conservatives are stoking about “open borders,” “critical race theory” and rising crime.",
    "You have to read this:\nx\nIf media reports are accurate, and Judge Jackson has been chosen as the Supreme Court nominee to replace Justice Breyer, it means the radical Left has won President Biden over yet again.",
    "It’s the backdrop or the driving conflict of so many of our stories — Star Wars, Casablanca, Lord of the Rings, The Sound of Music — precisely because it creates heroes and villains so easily and automatically.",
    "Cracking down on Vladimir Putin’s propaganda tools in the West, including the RT television network, and on people like Gerhard Schröder, the former German chancellor who now works for a Russian oil company.",
    "On one side, the haughty, iron-fisted dictator with his legions of destruction — on the other side, children hiding underground while their parents make a desperate stand to protect their homeland.",
    "It is overseen by the National Bank of Belgium in partnership with other major central banks, including the U.S. Federal Reserve System, the Bank of England and the European Central Bank.",
    "Rather, it acts as a secure messaging system that links more than 11,000 financial institutions in over 200 countries and territories, alerting banks when transactions are going to occur.",
    "https://t.co/azll38wkcr\n— Jonathan Landay (@JonathanLanday) February 25, 2022\nDavid Leonhardt/NY Times:\nPartial Measures\nWhy aren’t the U.S. and its allies imposing tougher sanctions?",
    "— Sarah Posner (@sarahposner) February 25, 2022\nWhen you lose Cronkite…\nBy the way, many Republican officials and figures are scrambling to retrofit their opinion to the invasion.",
    "Seizing apartments, yachts and other assets owned by many members of the Russian elite in London, Miami and elsewhere, as Anne Applebaum of The Atlantic has suggested.",
    "SWIFT said it recorded an average of 42 million messages per day last year, an 11 percent increase from 2020, when Russia accounted for 1.5 percent of transactions.",
    "Not so long ago, Pompeo was the house hawk in the isolationist-leaning Trump administration, which was led by a man who preferred pulling back from the world.",
    "Zapata County, just south of here, is heavily Latino; Hillary Clinton won it by more than 30 points in 2016, then it went to Mr. Trump by about five points.",
    "Pretty common sentiment around the world, not excluding Russia,\nNoah Smith/Substack:\nA moment of clarity\nThe Russian invasion of Ukraine should wake us up.",
    "There’s nothing wrong (despite what some commentators might have you believe) with criticizing the Biden administration’s approach to Ukraine and Russia.",
    "It's that Tucker is a racist troll who spends an enormous amount of time catering to and fanning the racial prejudices and anxieties of his audience.",
    "Now reality has erupted, and the Putin-friendlies are stunned to discover that the dictator they stanned for is something more than a fellow troll.",
    "She still favors Medicare for All, a $15 minimum wage, more liberal immigration policies and abortion rights, but those have not been her focus.",
    "Doug Ducey was asked today how he feels about state lawmaker Wendy Rogers in light of her recent embrace of the white nationalist movement.",
    "Thirty-eight justices had no judicial experience, and the remaining 46 had only token experience adjudicating disputes from the bench.",
    "In response, Ms. Cisneros is running a campaign against the 17-year incumbent that could easily have been engineered by a Republican.",
    "But it’s also worth taking a look at the potential sanctions that the U.S., Britain and the European Union have chosen not to impose.",
    "Perhaps most significant, sharply reduce purchases of Russian oil and natural gas, by far the country’s largest source of revenue.",
    "Ms. Clinton’s 60-point margin in Starr County, which is 96 percent Latino, shriveled to a five-point advantage for Mr. Biden.",
    "Few events create as much moral clarity as the unprovoked, brutal invasion of a peaceful nation by a militaristic empire.",
    "(For instance, U.S. banks have unique SWIFT codes that customers use for incoming wire transfers in U.S.",
    "Some just flat out lie (Mike Pompeo, whoi simply blames Biden for everything) or do a 180 like J.D.",
    "He also knows that his presidential ambitions probably cannot withstand a sharp break with Trump.",
    "Putin simply declared that Ukraine is historically part of Russia and sent in his troops.",
    "— Lindsey Graham (@LindseyGrahamSC) February 25, 2022\ntogether with this:\nx\nArizona Gov.",
    "(Some of the present criticism of Biden is inane, but other parts are substantive.)",
    "x\nImagine voluntarily deciding the brand you want is as a pro-Putin fifth column.",
    "The attacks by the Left on Judge Childs from South Carolina apparently worked.",
    "But most are simply trying not to get steam rollered by Trump’s love of Putin.",
    "They are almost certainly more severe than the sanctions going into effect.",
    "https://t.co/PemuBBzF65\n— Mileah Kromer (@MileahKromer) February 25, 2022",
    "The story of Russia’s invasion of Ukraine fits that archetype perfectly.",
    "They assumed that Putin himself lived by performative bullshit too.",
    "It's not just that Barrett is conservative and Jackson is liberal.",
    "Ducey told reporters it's better than having a Democrat in office.",
    "Vance (I don’t care last week/I care more than anyone this week).",
    "But SWIFT isn’t a traditional bank and doesn’t transfer funds.",
    "Some like Tucker carlson are doubling down on loathsome.",
    "A West Point grad and Army veteran, Pompeo knows better.",
    "See:\nx\nViews of Russia are tanking.",
    "x\nWhy the difference?",
    "What is it?",
    "dollars.)"
  ]
}