{
  "id": 1125,
  "mediaId": 2589,
  "date": "2022-02-18",
  "headline": "Ohio GOP Senate candidate: My male competitors are overcompensating for their tiny weiners",
  "image": "https://hotair.com/wp-content/uploads/2022/02/t-3-1110x740.jpg",
  "link": "https://hotair.com/allahpundit/2022/02/18/ohio-gop-senate-candidate-my-male-competitors-are-overcompensating-for-their-tiny-weiners-n449608",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allahpundit",
  "authorUrl": "https://hotair.com/author/allahpundit",
  "termIds": [
    0
  ],
  "sentences": [
    "During meetings, phone calls and impromptu chats, Trump has been peppering top aides and allies with questions about Matt Dolan, a wealthy Ohio Republican who accused the former president of “perpetuat[ing] lies about the outcome” of the 2020 election and called the pro-Trump Jan. 6 Capitol riot “a failure of leadership.”\nWhile other contenders in the crowded GOP Senate primary are auditioning for Trump’s support, Dolan is funding a battery of TV ads that don’t even mention the former president.",
    "And in a barely veiled jab at his rivals who are making pilgrimages to Trump’s Mar-a-Lago estate, Dolan has declared that his campaign “is about one thing, and one thing only: Ohio.”…\n“The other candidates have been so obsessed with appeasing interests outside Ohio, they forgot what they are supposed to be fighting for in Ohio,” said Chris Maloney, a Dolan strategist.",
    "I didn’t think this year’s Ohio Senate primary could get any more embarrassing for the GOP, but life is full of surprises:\nWe all know guys who overcompensate for their inadequacies, and that description fits the guys in the Senate race to a T.\nI’m different.",
    "As cringy as it is to have a Harvard-educated professional from the GOP country-club set calling herself a “MAGA conservative with a backbone” and making dick jokes about her male opponents, name recognition has become hugely important in this race.",
    "But his longshot strategy is clever: He’s betting that Mandel, Vance, Timken, and Gibbons will tear each other apart for the MAGA vote, splitting it four ways and leaving Dolan with the centrist, less Trumpy vote all to himself.",
    "Mandel campaigned alongside Mitt Romney when he ran for Senate in 2012, urging voters to reject “hyperpartisanship” and elect leaders who would “rise above it all to do the right thing.” Gibbons is a mega-rich investment banker.",
    "It makes me wonder if she’s trying a variation on Dolan’s strategy: Instead of letting her opponents fight over the MAGA vote, Timken might be aiming to consolidate Republican women and let the rest of the field fight over men.",
    "If, say, a third of Ohio Republican primary voters are looking for someone more moderate, it’s possible that Dolan can win the primary with that third provided that the rest of the vote splinters relatively equally.",
    "Trafalgar’s latest poll looks like this:\nFor four of those five, the campaign is essentially a contest to see which establishment Republican can position him- or herself as the biggest Trump sycophant.",
    "WATCH my new ad below: pic.twitter.com/EEzqaYToPa\n— Jane Timken (@JaneTimkenOH) February 18, 2022\nJane Timken has many commendable qualities, no doubt, but “good on camera” isn’t one of them.",
    "If she can get women behind her — and the endorsements from Stefanik and Conway suggest that she’s straining to do so — then she’s got an obvious path to victory with the male vote divided.",
    "Despite her own wealth and her many connections in the party, which now includes endorsements from Elise Stefanik and Kellyanne Conway, Timken has also struggled to gain traction.",
    "“We like that contrast.”\nDolan is careful not to seem too anti-Trump, claiming that he voted for the former president in 2016 and 2020 and opposed impeachment.",
    "Fast-forward 11 months and the Ohio Senate primary is one of the most muddled of the entire 2022 cycle, with no fewer than five candidates in contention.",
    "With the top candidates polling at only 20 percent or so, anything Timken can do to make an impression on voters is apt to pull her closer to the lead.",
    "Another thing she *almost* had last year was the endorsement of Donald Trump, which might have cleared the field for her if he had followed through.",
    "But if Trump does endorse, he risks pissing off the different camps of MAGA voters who have already aligned behind the other candidates.",
    "Waaaay back in March 2021, Trump was reportedly prepared to back Timken, someone who’d raised big bucks for his presidential campaign.",
    "He was talked out of doing that, urged to keep his powder dry until he had a better sense of what the field would look like.",
    "Mandel has no funding, is shunned by the GOP establishment, and is reportedly viewed as “f***ing weird” by Trump himself.",
    "Vance has underperformed, polling middle-of-the-pack despite lots of MAGA media attention and big money behind him.",
    "Four phonies, each willing to posture insincerely as a Trumpy populist, and only one can be the Republican nominee.",
    "Timken is a former head of the Ohio Republican Party who donated to John Kasich when he ran against Trump in 2016.",
    "If he ends up endorsing someone, that person will consolidate most of the MAGA vote and win the primary easily.",
    "Trump doesn’t want to give his blessing to a lackluster candidate and then watch them lose.",
    "I used to spell it “ie” but the prominence of a certain someone has forever changed that.",
    "Vance is an Ivy League law grad, hedge-fund employee, and former Never Trumper.",
    "And reportedly the one whom Trump has his eye on — but not for an endorsement.",
    "And Gibbons, as a lesser-known businessman, is a risky political investment.",
    "But does Trump want to endorse with the polls as unsettled as they are?",
    "No wonder Ohio Republicans are having trouble settling on a candidate.",
    "All of which points to a cynical cunning behind Timken’s new ad.",
    "The fifth candidate, Matt Dolan, is the interesting one.",
    "If he declines to endorse, suddenly Dolan has a shot.",
    "By the way, is it spelled “wiener” or “weiner”?",
    "It’d be a blow to his prestige as a kingmaker.",
    "The flaw in that strategy is Trump himself.",
    "I’m the MAGA conservative with a backbone.",
    "J.D."
  ]
}