{
  "id": 11736,
  "mediaId": 8480,
  "date": "2022-03-28",
  "headline": "Republican U.S. Senate candidates gearing up for Ohio primary",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/1-3.png?w=1280",
  "link": "https://www.wdtn.com/news/your-local-election-hq/republican-u-s-senate-candidates-gearing-up-for-ohio-primary/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Morse",
  "authorUrl": "https://www.wdtn.com/author/caroline-morse/",
  "termIds": [
    2290,
    2694,
    2736,
    5581,
    4839,
    1489,
    1126,
    392
  ],
  "sentences": [
    "All seven Republican candidates packed the stage in hopes of succeeding Rob Portman and answered questions on topics that ranged from the war in Ukraine to addressing voter fraud.",
    "As we enter the fifth week of the war in Ukraine, some candidates say they approve of sending military equipment to Ukraine, but never want to see American boots on European soil.",
    "“I caught a Democrat operative and a congressional candidate pushing ballot harvesting and I referred that person to the attorney general,” said Senate candidate Jane Timken.",
    "“We can not move on or move forward from the 2020 election until it’s fully investigated and everyone who cheated in 2020 is prosecuted,” said Senate candidate Josh Mandel.",
    "“We need to look forward as Republicans and stop the Biden Administration but most of all, we need to prepare for the 2024 election,” said Senate candidate Matt Dolan.",
    "“I want to go to Washington and eradicate the type of radical left thinking, personality and lack of ethics there,” said Senate candidate Mark Pukita.",
    "“We should not be doing a no fly zone, we should not be getting involved with Russia at all, it’s not our problem,” said Senate candidate J.D.",
    "“I don’t think any boots should be on the ground in Ukraine or American pilots flying over Ukraine,” said Senate candidate Mike Gibbons.",
    "Moderators engaged in real-time fact checking, cutting off multiple candidates and claiming their statements were factually incorrect.",
    "“We don’t need to put our boys and girls in Ukraine right now but we can support them financially,” said Senate candidate Neil Patel.",
    "Tonight, Republican U.S. Senate candidates took the debate stage at Central State University.",
    "None of the Democratic Senate candidates who spoke in the earlier debate were fact checked.",
    "Matt Dolan, Mike Gibbons, Josh Mandel, Neil Patel, Mark Pukita, Jane Timken and J.D.",
    "Most of all, candidates promised to bring change in leadership to Washington.",
    "WILBERFORCE, Ohio (WDTN) – The race to the Ohio primary is heating up.",
    "One of the early topics was the 2020 election.",
    "Vance were onstage at Central State.",
    "Vance."
  ]
}