{
  "id": 1216,
  "mediaId": 8496,
  "date": "2022-02-14",
  "headline": "Poll: 60% of Ohio GOP primary voters say election was stolen",
  "image": "https://media.wkyc.com/assets/WBNS/images/419e0145-8105-424a-b6e2-c4999b9c7e6b/419e0145-8105-424a-b6e2-c4999b9c7e6b_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/politics/elections/majority-ohio-gop-primary-voters-say-election-was-stolen/530-c769a552-eab0-4b7e-8d4d-2c94ca8b7ef0",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“While every single message tests well, the best of the bunch are cutting federal aid to localities that allow non-citizens to vote, requiring proof of citizenship to get public assistance, and allowing border states to complete the border wall with Mexico,” the polling states, in advice to Vance.",
    "Only Sen. Matt Dolan, R-Chagrin Falls, has unequivocally rejected the election fraud theory and called out leaders who “perpetuated lies.” The recent polling shows 15% of his likely voters believe the election was stolen.",
    "COLUMBUS, Ohio — Nearly two in three Ohio Republicans likely to vote in the upcoming primary election believe the election was “stolen” from President Donald Trump, according to polling conducted late last month.",
    "Vance, included “border security and immigration” (16%), followed by “election and voting security” (13%) and several economic areas like inflation, taxes, government spending and jobs (all around 11%).",
    "Only 8% indicated Biden won with “no fraud.”\nTop issues from voters in the poll, conducted by the firm Fabrizio Lee on behalf of a PAC supporting U.S. Senate Candidate J.D.",
    "Of 800 “likely” voters sampled in late January, 62% said they believed the election was stolen and 29% believed there was “some fraud” but President Joe Biden won.",
    "Rob Portman, nearly all the leading candidates — Josh Mandel, Vance, Mike Gibbons, and Jane Timken — have embraced Trump’s claim that the election was stolen.",
    "Fabrizio Lee earned a “B/C” grade from FiveThirtyEight, a data-driven politics blog that rates pollsters based on their methodology and historical accuracy.",
    "Trump’s administration officials have said there was no fraud at enough scale to sway the election, as have state audits and media investigations.",
    "“Dolan voters differ greatly from the rest of the electorate, but they are only 3% of the vote,” the polling states.",
    "However, Trump and his allies in politics and media have insisted the 2020 election was fraudulent regardless.",
    "In the U.S. Senate GOP primary for the open seat to be abdicated by incumbent Sen.",
    "The polling was first reported and obtained by Politico last week.",
    "There’s no evidence to suggest the election was stolen."
  ]
}