{
  "id": 12468,
  "mediaId": 2573,
  "date": "2022-03-01",
  "headline": "House Republicans in lockstep calling for more action on Ukraine, even as some on right oppose doing more",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Victoria-Spartz4a.jpg",
  "link": "https://www.foxnews.com/politics/house-republicans-ukraine-russia-putin-aid-biden",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    4905,
    4850,
    4591,
    4266,
    5074,
    2974,
    4214,
    1126,
    1477,
    6672,
    6569
  ],
  "sentences": [
    "(Gaelen Morse/Bloomberg via Getty Images)\n\"We got a lot of flack in the last week that because I had the audacity to suggest that before our leaders obsess over a Ukrainian and Russian border 6,000 miles away maybe they better guarantee the sovereignty of their own country and their own border first,\" Vance said at CPAC.",
    "FEENSTRA, ERNST PRAISE REYNOLDS AS LEADER WITH ‘MOXIE,’ AHEAD OF STATE OF THE UNION RESPONSE\nKeller also called for the U.S. to increase domestic oil production \"so that our adversaries do not have… the resources to wage war on anyone around globe. \"",
    "STATE OF THE UNION: BIDEN'S PRESIDENCY FACES SLEW OF SETBACKS, CLAIMS SOME MAJOR VICTORIES\n\"There is a leadership in this country that is constantly focused on stuff that has nothing to do with the citizens of our country,\" Vance added.",
    "Senate Minority Leader Mitch McConnell, R-Ky., and House Minority Leader Kevin McCarthy each came out forcefully against Russia in recent days – even if they would criticize Biden for being too weak on Putin in the same breath.",
    "House Republicans are railing against Russian President Vladimir Putin's war against Ukraine, calling for increased sanctions on Russia and slamming President Biden for not doing enough.",
    "\"Right now he has all the tools he needs to destroy our country unless we come to the aid of Ukraine,\" Issa said, lamenting that Biden didn't institute sanctions against Russia sooner.",
    "\"Number one would be let's stop Russian gas sales,\" Rep. Don Bacon, R-Neb., told Fox News Digital Tuesday when asked what message he hopes Biden delivers in his State of the Union.",
    "Rep. Victoria Spartz, R-Ind., is from Ukraine and made an emotional plea at a House GOP press conference for western assistance for Ukraine as Putin's forces bombard the country.",
    "PUTIN'S 40 MILES OF KILLING MACHINES TAUNT UKRAINE'S CAPITAL: LIVE UPDATES\nRep. Darrell Issa, R-Calif., handed out small ribbons with the colors of Ukraine's flag on them.",
    "\"The problem is the president hasn't led… My colleague Victoria Spartz, she said it better than anybody… We have a responsibility to the world to lead.",
    "Vance, that opposes such international involvement by the U.S. especially while domestic problems like the opioid crisis and border crisis persist.",
    "But at times the event resembled a rally for Ukraine as much it did a forum for lawmakers to attack Biden ahead of his State of the Union speech.",
    "\"He could have sold the Ukrainians surface-to-air missiles a long time ago… and he didn't,\" Rep. Fred Keller, R-Pa., said of Biden and Ukraine.",
    "\"I'm sick of being told that we have to care more about people 6,000 miles away than we do about my mom and my grandparents.\"",
    "\"I think they should,\" increase the United States' response to the Russia-Ukraine war Rep. Scott Fitzgerald, R-Wis., said.",
    "There is, however, a small faction in the GOP, most visibly led in recent weeks by Ohio Senate candidate J.D.",
    "But I know he's afraid of raising American gas prices while he's also cut our own oil production.\"",
    "Will you change your posture and bring the kind of aid to those freedom fighters that they need?",
    "There's a reason why the president of the United States is called the leader of the free world.\"",
    "\"It should be… multi-pronged, which is the sanctions themselves… and then the weaponry.\"",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "Republicans did not take their eye off the political ball during a Tuesday press event.",
    "I think there is risk of genocide and in the Ukraine,\" Rep. John Rose, R-Tenn., said.",
    "They attacked Biden and Democrats over inflation and COVID policies and schools.",
    "\"There's a lot more we can do,\" Rep. Byron Donalds, R-Fla., said Tuesday.",
    "\"We're paying $70 million per day, Americans are, to Russia for fuel.",
    "Their members were in near lockstep on their hawkish approach, too.",
    "That means real weapons, getting in there in a timely fashion.\"",
    "If he could attack that I would give him huge kudos for that.",
    "\"Ukraine needs to have the ability to defend themselves.\"",
    "Fox News' Marisa Schultz contributed to this report.",
    "But few other Republicans are making the same case.",
    "\"I think we should definitely consider doing more.",
    "\"That's the question that will be with us tonight.",
    "Tyler Olson covers politics for Fox News Digital.",
    "She warned \"millions\" could die otherwise.",
    "He said his staff made about 300 of them."
  ]
}