{
  "id": 12659,
  "mediaId": 2746,
  "date": "2022-03-01",
  "headline": "GOP candidates go all out to capture electoral energy awakened by Trump",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/26/CPAC_Trump_30036.jpg-acebb_c0-222-5330-3331_s1200x700.jpg?647f584f6e32bef860846b3a8e56b5e0179c0812",
  "link": "https://www.washingtontimes.com/news/2022/mar/1/gop-candidates-go-all-out-capture-electoral-energy/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    4957,
    2765,
    2684,
    2290,
    5843,
    5465,
    5581,
    1126
  ],
  "sentences": [
    "On his campaign website, Missouri Attorney General Eric Schmitt says he “defended President Trump at every turn and fought for justice for Missourians against the radical left, Big Tech, and even the Communist Party of China.”\nRep. Vicky Hartzler features a photo on her campaign website of Mr. Trump standing with her and flashing a thumbs up on Air Force One.",
    "Mr. Long’s campaign website also includes a video touting a Trump tweet praising him for “fully” backing “our America First Agenda!”\n“We need to stop the insanity of destroying what President Trump made great,” Mr. Long said, next to a video of a locomotive with a photo of Mr. Trump and Mr. Long superimposed on top of it.",
    "The former state treasurer sent a fundraising email to supporters this week with the subject line: “Trump first, God first, America first.”\n“My question is simple: can I count on you to get candidates to Washington who will put Trump’s agenda first, put God first, and put America first?” Mr. Mandel said in the email.",
    "“Everyone sees it as loyalty to Trump and maybe in a simplistic way you could think of it that way, but what has happened in a state like Ohio, which used to be blue or purple, and is now deep red, is that President Trump awakened something in voters that these candidates are trying to tap into,” Mr. Burns said.",
    "“These candidates want others to believe in them as the voters believed in Trump.”\nMr. Trump showcased his lasting grip on the GOP over the weekend at the annual Conservative Political Action Conference in Orlando, Florida, where he was the biggest draw and won the presidential straw poll in a landslide.",
    "Eric Greitens, a former governor who resigned amid allegations of sexual abuse, has leaned into Mr. Trump’s stolen election claims and echoed Mr. Trump’s calls for replacing Senate Minority Leader Mitch McConnell as the chamber’s GOP leader.",
    "Candidates are boasting about donations they have received from top Trump donors, highlighting endorsements from pro-Trump members of Congress, and claiming to have been among the first to have jumped aboard the Trump train in 2016.",
    "Shannon Burns, president of the Strongsville GOP, said candidates recognize that Mr. Trump‘s style and message resonated with a broad swath of voters — including those who felt alienated by the political system.",
    "Vance has campaigned with Rep. Marjorie Taylor Greene, the far-right firebrand from Georgia who endorsed his bid and is one of Mr. Trump’s most vocal supporters on Capitol Hill.",
    "“I was the first person in the country who said that when I’m in the Senate, I’m voting for new leadership,” Mr. Greitens said in a post highlighted on his Twitter account.",
    "Mr. Mandel is among a herd of GOP candidates running in primary races across the country that are scrambling to showcase their fealty to Mr. Trump and his MAGA movement.",
    "He also has the support of Trump lawyer and former New York City Mayor Rudy Giuliani, and former Trump White House National Security Adviser Michael Flynn.",
    "“Mike Gibbons has the momentum in the Ohio Senate race and is committed to the America First agenda and MAGA movement,” Mr. Stepien said in a statement.",
    "Mr. Trump’s decision to stay out of races — including in Ohio and Missouri — has intensified the battle between candidates to claim the Trump mantle.",
    "I’m not voting for Mitch McConnell.”\nMr. Greitens also has touted the support of Kimberly Guilfoyle, the purported secret fiance of Donald Trump Jr.",
    "“You had all these individuals who were awakened to what is wrong with America and finally believed there was someone who could fix it,” he said.",
    "It is a different story in Missouri, where the race to replace retiring GOP Sen. Roy Blunt has attracted a field of Trump-inspired candidates.",
    "Republican candidates have been falling over themselves in the hopes of winning Mr. Trump’s endorsement and tapping into his star power.",
    "Jane Timken, a former Ohio GOP chair, announced Tuesday that she has the support of Trump alumni: Corey Lewandowski and Dave Bossie.",
    "Rob Portman seems at times mostly about capturing the attention of Mr. Trump and trying to channel his mojo for their campaigns.",
    "Rep. Billy Long’s campaign website also features a snapshot of him flashing a thumbs up alongside Mr. Trump on Air Force One.",
    "Businessman Mike Gibbons, meanwhile, announced last month that former Trump campaign chief Bill Stepien joined his campaign.",
    "Campaign websites and email blasts are littered with snapshots of candidates standing shoulder to shoulder with Mr. Trump.",
    "Josh Mandel is talking about former President Donald Trump in the same breath as God in his bid for the Senate.",
    "Nowhere is it more evident than in Ohio where the contest to replace retiring Republican Sen.",
    "Mr. Trump won a 97% approval rating from CPAC attendees and took 59% of the vote.",
    "The exception to the rule in the Ohio GOP Senate race is state Sen. Matt Dolan.",
    "He has focused his message on the failures of the Biden administration.",
    "“I was on the Trump train early and never got off.”",
    "The runner-up, Florida Gov.",
    "Ron DeSantis, garnered 28%.",
    "“No More RINOs.",
    "J.D."
  ]
}