{
  "id": 12843,
  "mediaId": 2745,
  "date": "2022-03-04",
  "headline": "Opinion: Tucker Carlson and J.D. Vance suffer a moment of self-doubt over Putin",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BXAZTQRIYFB7VKE22R4CBR7BUU.bmp&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/03/04/tucker-carlson-jd-vance-self-doubt-putin-ukraine/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“What about our sovereignty?” Vance said, proposing further militarizing our border by finishing the wall and beefing up Border Patrol: “For every dollar that goes to the Ukrainians, we should send three dollars to the American southern border.”\nTranslation: I find it deeply disorienting that so many people in the United States and elsewhere care so much about a place so far from their own nation.",
    "“For right-wing nationalists, America’s weakness under a Democratic president, and the worthlessness of international coalitions, are core to their worldview,” Nicholas Grossman, a professor of international relations at the University of Illinois, told me.",
    "This crisis has also badly shaken those of us who still hope for a rehabilitated liberal international order that’s less reflexively militaristic and more focused on global problems such as climate change, forced migration, pandemics and inequality.",
    "He noted that the usual demagoguery is faltering in the face of world-historical events: “Some things are too big to lie about, even for professional liars.”\nLook, we all have tremendous introspection to do about our various worldviews right now.",
    "Vance are both highly successful demagogues operating in the “conservative populist nationalist” space, so watching them grapple with the Russian invasion of Ukraine, and the determined international response to it, has been illuminating indeed.",
    "You might recall that officials engaged in protracted and patient diplomacy that ended up mounting a broad sanctions response with our allies that’s far more robust and coordinated than observers expected.",
    "The Fox News host blithely suggested those sounding the alarm were warmongering globalists manipulating the masses into hating Russian President Vladimir Putin.",
    "It reflects an underlying worldview that genuinely envisions immigration to the United States as an invasion on a par with the one Ukraine is experiencing.",
    "“Obviously there’s something tragic happening in Ukraine right now, and I’m fine with sending aid,” Vance said in a segment flagged by Media Matters.",
    "They seemed uncertain how to proceed, and the resulting spectacle exposed the vacuity of their ideological double act in all its performative chintz.",
    "It’s all so deeply confused: The invasion poses a profound threat to global stability, and Biden’s weakness and cluelessness are to blame.",
    "But seeing real virtue in the coordinated international approach being attempted is apparently inadmissible in the Carlsonian worldview.",
    "After previously saying he doesn’t “care what happens to Ukraine,” he went on Carlson’s program and grudgingly admitted Ukraine matters.",
    "U.S. intelligence got a lot right about the threat Putin posed, and officials found various novel ways to keep the world alert to it.",
    "Carlson then launched into a creepily obsessive segment of cherry-picked clips meant to portray Harris as stupid and unprepared.",
    "But on Thursday night, Carlson and Vance addressed the ongoing horrors of the invasion with a bit less of their usual glibness.",
    "But wait, globalism is also bad and globalist elites have been wrong about everything for decades, so let’s not listen to them.",
    "Americans, hurry up and go back to feeling as though your own sovereignty is the one facing the emergency that truly matters!",
    "His logic: If the Russian threat were all that dire, President Biden wouldn’t have sent Harris abroad to handle diplomacy!",
    "And at any rate, Biden has kept many of Trump’s policies, and most arrivals are getting expelled without any hearing.",
    "Treating this as an emergency threat to our sovereignty — let alone whatabouting it along with Ukraine — is nonsense.",
    "More notably, Carlson has little to say about what the administration actually did do in the run-up to the invasion.",
    "We don’t know what options the United States and its allies will have if Putin expands his conquest beyond Ukraine.",
    "“The invasion of Ukraine already is a legitimate disaster for Europe and the world,” Carlson told his viewers.",
    "“Russia’s invasion and the strong, unified Western reaction to it have upended that view,” Grossman continued.",
    "But he seemed to dismiss the international response, insisting our leaders are “obsessing” over Ukraine.",
    "Carlson blames it all on Harris and titillates his viewers with a ghoulishly denigrating video display.",
    "The “Hillbilly Elegy” author smarmily told us to care more about our own border than that of Ukraine.",
    "But we’re willing to admit it.”\nCarlson is right in one sense: We are all shocked and disoriented.",
    "But the cheap demagogic hustle we’re seeing from Carlson and Vance isn’t genuine introspection.",
    "Ultimately, what’s being exposed is the hollowness of Carlson-Vance populist play-acting.",
    "At first, both adopted simple-minded nationalist tropes about the gathering threat.",
    "But it’s better than Trump’s approach, which produced humanitarian catastrophe.",
    "In all seriousness, Vance’s formulation isn’t just frivolous whataboutism.",
    "So does that mean we should not be attempting this international response?",
    "That has created immense logistical challenges without easy answers.",
    "It might unduly hurt the Russian people without influencing Putin.",
    "Does it mean we should be attempting this international response?",
    "Yes, Biden has reversed a few of Donald Trump’s border policies.",
    "But then Carlson blamed Vice President Harris for his mistake.",
    "Then there’s Vance, a Republican Senate candidate in Ohio.",
    "And admittedly, vast unknowns loom about this approach.",
    "It might provoke Putin to lash out more aggressively.",
    "So does this mean we need to respond with “strength”?",
    "“We’ve been taken by surprise by the whole thing.",
    "What then is the “nationalist” solution?",
    "None of this was enough, of course.",
    "We’re not the only ones who were.",
    "But never mind that garbage.",
    "Tucker Carlson and J.D.",
    "It’s rank evasion.",
    "A stronger one?",
    "Get a grip."
  ]
}