{
  "id": 134,
  "mediaId": 2745,
  "date": "2022-02-25",
  "headline": "How Republicans moved from Reagan’s ‘evil empire’ to Trump’s praise for Putin",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/D7YTNBUVVYI6ZOZROT6ANQFDUU.jpg&w=1440",
  "link": "https://www.washingtonpost.com/nation/2022/02/25/how-republicans-moved-reagans-evil-empire-trumps-praise-putin/?utm_source=rss&utm_medium=referral&utm_campaign=wp_national",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "They don’t share his consistent internationalist philosophy.”\nThe evolution of attitudes toward Russia in the Republican base has been driven not only by Trump’s popularity and the struggles of the U.S. economy, but also by a years-long effort by Russia to influence how Americans of all political stripes view the world, according to disinformation researchers who have traced Russia’s hacks, deceptive Internet posts and fake accounts on social media.",
    "Anti-communism and love of freedom used to be the glue that held the party together, but now the attitudes toward Russia have gotten all mixed up with domestic politics.”\nIn Congress, across conservative media and on the social media battlegrounds where so much of right-leaning America thrashes out its differences, Russia’s invasion of Ukraine seemed to open a gap between Trump and some of his erstwhile loyal supporters.",
    "Republican leaders campaigned for decades on reining in Russia, from Eisenhower’s statement that the Soviet Union represented “godless depravity in government” to GOP presidential nominee Mitt Romney’s 2012 characterization of Russia as “our number one geopolitical foe.”\nThe country’s establishment politicians and policymakers have generally leaned toward America playing an active role in international affairs.",
    "Thomas Rid, a professor of strategic studies at Johns Hopkins University’s School of Advanced International Studies and author of “Active Measures,” a history of disinformation, said the role of Russian meddling may not be as powerful as some other domestic forces that have pushed Americans toward views so polarized that members of one party almost automatically take a position opposed to the other party’s.",
    "“The party is searching for meaning beyond just anti-Bidenism, and there’s no one position.”\nA chief cause of the Republican splintering on Putin and his invasion of Ukraine is the dramatic shift in rhetoric and policy that Trump introduced into the party’s messaging, starting in his 2016 campaign and continuing through his term in the White House and his embittered post-presidency.",
    "The United States must stand with the Ukrainian people by immediately providing additional assistance, including military equipment and lethal aid.”\nBut other Republicans hewed closer to Trump, who on Fox News touted his “good relationship” with Putin and suggested that the Russian president had attacked Ukraine only because of the “weakness” of the Biden administration.",
    "In 2016, Russia interfered in the U.S. election by hacking and disseminating sensitive Democratic Party emails, and the Internet Research Agency, run privately by a Putin ally, flooded Facebook, Twitter and other platforms with faked social media posts that helped drive Americans to polarized political positions while also supporting Trump’s presidential bid.",
    "It was, in Reagan’s famous formulation, the “evil empire.”\nThis week, while many Republicans blasted Russian leader Vladimir Putin’s all-out assault on Ukraine, former president Donald Trump and some of his allies urged the United States to stay out of the conflict and praised Putin, even presenting him as a “peacekeeper,” as Trump put it.",
    "In 2013, for example, with U.S. forces seemingly bogged down in Syria, Iraq and Afghanistan, the percentage of Americans telling pollsters that the country should “mind its own business internationally” jumped to 52 percent — the first time a majority expressed that view in half a century, according to a Pew Research Center poll.",
    "A day earlier, on a conservative podcast, Trump called Putin a “genius” for declaring two regions of Ukraine to be independent countries and said “he’s going to go in and be a peacekeeper.”\nTrump defended casting Putin as “smart” during a speech at the Conservative Political Action Conference in Orlando on Saturday night.",
    "Vance said on a podcast that “I don’t really care what happens to Ukraine one way or another,” and tweeted that “our leaders care more about Ukraine’s border than they do our own.”\nFox’s most popular host, Tucker Carlson, pooh-poohed the idea that Putin is an enemy: “Why do I hate Putin so much?” he said.",
    "Now the party’s populist base has been radicalized and it’s metastasized beyond Trump himself.”\nWalsh, now a podcaster who considers himself a man without a party, said the old Republican attitudes toward Russia still exist in the hearts “of many of my former colleagues in the House.",
    "That attitude traces back to the founders; Thomas Jefferson warned against “entangling alliances.”\nTo varying degrees, that allergy to diving into foreign crises has surged periodically in U.S. history, especially in times of economic disarray and technological dislocation.",
    "“I have always been a Republican because of the party’s stands for freedom, free markets, limited government and strong defense,” said Joe Walsh, a former GOP congressman from Illinois who supported Trump in 2016 but then became sharply critical of him as president.",
    "For decades, the Republican Party’s stance on Russia’s dictators and expansionist tactics was rock-solid: From Dwight D. Eisenhower to Richard Nixon to Ronald Reagan, Russia — then the Soviet Union — was America’s chief enemy, untrustworthy, anti-freedom.",
    "Russia has sought to shape American attitudes toward political issues “through a subtle, sophisticated, very long game of influence,” said Camille François, a disinformation researcher at Columbia University’s School of International and Public Affairs.",
    "Walsh argues that when he and other young Republicans were attracted to Reagan’s candidacies in the 1980s, they were wowed by “the overall idea of strength after the weakness of Jimmy Carter and by his promise to get government out of your lives.",
    "But why did so much of the Republican political leadership and the party’s voter base so easily flip from traditional anti-communism and suspicion of Russian motives to an acceptance or even an embrace of Putin and his authoritarian ways?",
    "“What saddens me most is that I did not sufficiently see this embrace of authoritarianism coming.”\nBut others see the shift in the definition of Republicanism less driven by stances on issues than simply by the power of personalities.",
    "With his “America First” rhetoric and his policies of stepping back from NATO and other U.S. alliances with Western democracies, Trump tapped into a long-standing American discomfort with getting involved in other countries’ troubles.",
    "“President Biden has now taken positive steps,” Cruz said, adding that “much more still needs to be done to deter and counter the threat that Putin poses to our allies in Ukraine and across Europe.”\nSen. Todd C. Young (R-Ind.)",
    "“It’s a full-spectrum campaign with covert and overt elements.”\nOther experts on disinformation, in contrast, argue that the impact of Russia’s efforts to alter Americans’ political perspectives is not so clear.",
    "The United States is, as Madeleine Albright, Bill Clinton’s secretary of state, said, “the indispensable nation,” on trade, certainly, but also on securing peace, curbing extremism and spreading democracy.",
    "On Capitol Hill, GOP senators usually quick to agree with most anything Trump says issued statements that aligned with Republican reactions to Russian aggression through the past seven decades.",
    "Reagan’s strong stance against the Soviet Union was never the real draw.”\n“I voted for Trump in 2016 in part because he was a noninterventionist, f--- the rest of the world guy,” Walsh said.",
    "similarly praised Biden’s sanctions and said “Putin is attacking the democratic, rules-based order that has benefited countless Americans and millions around the globe since World War II.",
    "“There’s always been an ebb and flow between isolationism and internationalism in the party,” said Shirley, who is also the author of “April 1945,” a history of World War II’s endgame.",
    "The former president condemned the attack on Ukraine, calling it “an atrocity that should never have been allowed to occur,” but he did not directly criticize the Russian president.",
    "But during periods of populist politics — and especially when foreign wars crop up — many Americans embrace politicians who preach a strong, if not total, focus on domestic matters.",
    "“Your hatred of your own political opponent is so deep that you side with Vladimir Putin as he attacks major population centers in Ukraine, which is extraordinary,” Rid said.",
    "“But they don’t say anything because they know where the base is: with Trump and Tucker Carlson, saying, ‘Putin good, Biden bad, and I don’t want my gas prices to go up.'\"",
    "From the civil war in Syria to the separatist battles in eastern Ukraine, Russia’s intelligence services have sought to shape American views of Putin and his government.",
    "“But then came Trump and his authoritarian approach, which connected with voters who really wanted a strongman to build a wall, keep Brown people out and shut down CNN.",
    "And it has remained an occasionally recurring bug in both parties, often wrapping in antagonism toward immigrants, minority groups, Wall Street and academia.",
    "Especially after the trauma of World War I — another time when a deadly pandemic deeply disrupted American life — isolationism became persistently popular.",
    "“The problem is not that Putin is smart — which, of course he’s smart — but the real problem is that our leaders are dumb,” Trump said to applause.",
    "So dumb.”\nTrump’s aversion to portraying Russia and Putin as America’s enemies was evident from the start of his late-life political career.",
    "“Don’t look for consistency in Republican policy,” said Craig Shirley, a Reagan biographer and longtime Republican political consultant.",
    "During the 2016 campaign, he moved to erase from the Republican platform any mention of protecting Ukraine from Putin’s designs.",
    "The party’s division was evident as Russian missiles landed in several Ukrainian cities and Trump defended the Russian leader.",
    "“It’s really based on the personalities of our presidents and the Russian leaders more than on any principles.",
    "Has he threatened to get me fired for disagreeing with him?”\n“Makes your head spin, doesn’t it?” Shirley said.",
    "The current crop of Republicans still says they like Reagan, but they just like his personality.",
    "They still believe in a Reagan internationalism, in being tough on Russia,” he said.",
    "“I don’t believe he wanted to do this initially,” Trump said of Putin on Fox News.",
    "), praised the sanctions that Trump’s successor levied against Putin.",
    "And he repeatedly praised Putin throughout his presidency.",
    "“The Republican Party right now is a little schizophrenic.",
    "One of Trump’s most vocal allies, Sen. Ted Cruz (R-Tex.",
    "In Ohio, Senate candidate and Trump loyalist J.D.",
    "“Has Putin ever called me a racist?",
    "“Dumb."
  ]
}