{
  "id": 13822,
  "mediaId": 8379,
  "date": "2022-03-18",
  "headline": "Five GOP U.S. Senate candidates debated in Gahanna",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2021/10/YLEH-WEB.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/gahanna/five-gop-u-s-senate-candidates-to-debate-in-gahanna/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maeve Walsh",
  "authorUrl": "https://www.nbc4i.com/author/maeve-walsh/",
  "termIds": [
    0
  ],
  "sentences": [
    "Although a Feb. 8-10 poll conducted by the Trafalgar group had former Ohio treasurer Mandel leading the GOP pack with 21% of the vote, Gibbons surpassed the “pro-God, pro-gun, pro-Trump” candidate nearly three weeks later, according to a an Emerson College survey in partnership with NBC4 and The Hill.",
    "In a campaign where Republican candidates attempt to score an endorsement from former President Donald Trump, support from other elected officials who have distanced themselves from the firebrand commander in chief may hurt, rather than help, those seeking a seat on the U.S. Senate.",
    "Rob Portman endorsed Ohio Republican Party Chair Timken in February, the Emerson College poll found that 38.2% of respondents were less likely to vote for Timken — with only 19% of voters claiming that they were more likely to vote for the only female candidate in the race.",
    "The U.S. Senate forum, moderated by 610 WTVN radio host Brandon Boxer, took place Friday at the Creekside Conference and Event Center in Gahanna with five congressional candidates on the roster: Matt Dolan, Mike Gibbons, Josh Mandel, Jane Timken and J.D.",
    "The five candidates will reconvene for a second GOP primary debate in Cleveland at 7 p.m. Monday, which will be livestreamed on NBC4.",
    "However, the plurality of voters polled, 39.4%, indicated that they were still undecided, the Emerson College poll found.",
    "The Emerson College poll has the following breakdowns for candidates: Mike Gibbons (22.4%), Josh Mandel (14.9%), J.D.",
    "Vance (7.7%), Matt Dolan (6.2%), Jane Timken (5.7), Bill Graham (2.5%), Neil Patel (0.8%), Mark Pukita (0.4%).",
    "Gibbons, a Cleveland banker, raked in 22% of the vote, with Mandel close behind at 15%.",
    "Senator took the stage Friday in this election cycle’s first GOP primary debate.",
    "GAHANNA, Ohio (WCMH) — Five Republicans competing to be Ohio’s next U.S.",
    "The remaining respondents, 39.4%, said they were still undecided.",
    "Vance, according to the debate’s host FreedomWorks.",
    "After Sen."
  ]
}