{
  "id": 1459,
  "mediaId": 2695,
  "date": "2022-02-14",
  "headline": "ATF encourages people to celebrate Valentine's Day by turning in their exes",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTMzNDE3NC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY4NDM2MzUzNH0.eKF2iHP0VCiUv_6AfLZJ__vxHcH6jGY75r_02RfHegU/img.jpg?width=1200&coordinates=0%2C84%2C0%2C85&height=600",
  "link": "https://www.theblaze.com/news/atf-encourages-people-to-celebrate-valentines-day-by-turning-in-their-exes",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Samuel Mangold-Lenett",
  "authorUrl": "https://www.theblaze.com/u/samuelmangold-lenett",
  "termIds": [
    0
  ],
  "sentences": [
    "Matt Walsh of the Daily Wire called the ATF’s post “psychotic.”\nIn September of 2021, the Biden administration withdrew David Chipman’s nomination to run the ATF after he refused to answer questions posed by members of the United States Senate leading to concerns that if he were to become the director of the ATF he would implement draconian regulations on firearms thus restricting access to rifles commonly used for hunting and self-defense.",
    "The ATF urged people to provide information detailing their exes’ involvements in “illegal gun activity.”\n“Valentine’s Day can still be fun even if you broke up,” the federal agency wrote on its official Twitter, “Do you have information about a former (or current) partner involved in illegal gun activity?”\nValentine's Day can still be fun even if you broke up.",
    "Conservative political pundit Dana Loesch criticized the ATF for hypocritically seeking to arrest American citizens for gun crimes when the agency also played a critical role in the \"Fast and Furious\" gun-running operation.",
    "Chipman told Redditors participating in the thread that the Branch Davidians were using 0.50 caliber Barrett rifles to shoot down helicopters belonging to the Texas Air National Guard.",
    "While serving in the ATF, Chipman was stationed in Waco, Texas, and worked as a “case agent in [the] Branch Davidian trial.” The Branch Davidians were a cult that lived in Waco.",
    "Call 1-888-ATF-TIPS or email ATFTips@atf.gov.pic.twitter.com/OdDIPdIzkr\n— ATF HQ (@ATF HQ) 1644843698\nThe ATF’s comment was met with online ridicule and condemnation.",
    "Vance, a conservative-populist candidate for the U.S. Senate in Ohio, reprimanded the ATF for not prioritizing bringing the Mexican drug cartels to justice.",
    "Weren\\u2019t you guys involved in that?https://twitter.com/ATFHQ/status/1493208813670965248\\u00a0\\u2026\n— Dana Loesch (@Dana Loesch) 1644854519\nJ.D.",
    "In 1993, the federal government served the group with a search warrant leading to a violent shootout that resulted in the death of 76 cult members.",
    "The Bureau of Alcohol, Tobacco, Firearms, and Explosives encouraged people to celebrate Valentine’s Day by turning in their criminal ex-lovers.",
    "Vance) 1644863507\nJustin Amash, the former lone congressional libertarian turned podcaster, called for the ATF’s abolishment in response.",
    "Why don\\u2019t you guys focus on Mexican drug cartelshttps://twitter.com/atfhq/status/1493208813670965248\\u00a0\\u2026\n— J.D.",
    "While participating in a Reddit “ask me anything” thread, Chipman lied about the events of the 1993 massacre.",
    "Chipman is a former ATF agent who currently serves as a policy adviser for gun control advocacy groups.",
    "Do you have information about a former (or current) partner involved in illegal gun activity?",
    "Carlson said, “No one aboard a federal helicopter was shot down or injured that day.",
    "What if it\\u2019s your own government for a gun-running op called Fast and Furious?",
    "Chipman told the Senate that he supported an outright ban on AR-15 style rifles.",
    "Let us know, and we will make sure it's a Valentine's Day to remember!",
    "On his show, Fox News’ Tucker Carlson addressed Chipman’s lies.",
    "The helicopters didn’t crash.”",
    "Vance (@J.D."
  ]
}