{
  "id": 1483,
  "mediaId": 3993,
  "date": "2022-02-18",
  "headline": "GOP Senate hopeful J.D. Vance calls for abolishing ATF",
  "image": "https://media.townhall.com/townhall/reu/o/2021/183/fea40eb4-314b-40f9-be1a-6439c7760dd9-1110x740.jpeg",
  "link": "https://bearingarms.com/camedwards/2022/02/18/gop-senate-hopeful-calls-for-abolishing-atf-n55636",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cam Edwards",
  "authorUrl": "https://bearingarms.com/author/camedwards",
  "termIds": [
    0
  ],
  "sentences": [
    "Vance goes on to say that the establishment of this database, incomplete as it might be, is a clear sign that the Biden administration is focusing on legal gun owners when it should be going after cartel traffickers who are fueling both violent crime and record-high drug overdose rates in Ohio.",
    "It’s one thing to call for abolishing the ATF as an applause line in a campaign speech, but if Vance is serious about his proposal he needs to both flesh out the details and let gun owners know what can be done to hold the agency to account until the votes are there to axe it entirely.",
    "Vance, the author of the book Hillbilly Elegy who has been dogged throughout the campaign by his past comments bashing Donald Trump and current doubts about the sincerity of his supposed metamorphosis into a pro-Trump Republican.",
    "In a new op-ed at the Cincinnati Enquirer, Vance decided to wade into into the controversy surrounding the ATF’s digitized database of nearly one-billion firearms transaction records, which the candidate says is clearly illegal.",
    "For instance, what agencies in particular should start doing the ATF’s job, and what would stop those agencies who take over the ATF’s responsibilities from engaging in the same type of backdoor gun registration schemes?",
    "More importantly, given that there’s going to be virtually no chance of abolishing the ATF as long as a Democrat is in the White House, what’s Vance’s plan to deal with the agency’s overreach in the meantime?",
    "Heck, I’m all in favor of getting rid of the ATF (and the National Firearms Act, and the Gun Control Act, and the Hughes Amendment…), but I would also like to hear some additional details from Vance.",
    "While former state representative and state treasurer Josh Mandel has been leading in polls, the crowded field is still close enough that any number of candidates could end up with the nomination.",
    "On Thursday, Portman announced his endorsement of Jane Timkin, the former chair of the state Republican Party who’s been getting about 10% of the vote in pre-primary polling.",
    "I want an ATF that prevents Mexican drug cartels from getting access to the most dangerous weapons in the world, while protecting my rights and those of my fellow citizens.",
    "Portman’s endorsement will likely give Timkin at least a bit of a bump in polling, but other candidates are hoping to make some news of their own this week, including J.D.",
    "Federal law explicitly prevents the creation of a federal firearms database, for the simple reason that such a database is a direct affront to the Second Amendment.",
    "We’re just a couple of months away from the Republican primaries in the battleground state of Ohio, where the fight to replace the retiring Rob Portman as U.S.",
    "As we’ve seen in other nations, specifically Australia and multiple countries in Europe, a firearms database is a backdoor way of disarming the citizenry.",
    "Some may wonder who will do the important work of ensuring criminal gangs and international terrorist organizations aren’t equipped with powerful weapons.",
    "There needs to be some substance behind these statements if Vance is hoping to get Ohio gun owners excited to give him their votes a few months from now.",
    "When we strip funding from a bureaucracy that has failed to do its job, and we can redirect resources to groups that are actually keeping us safe.",
    "If the last two years has taught us anything, it should caution against giving broad, unconstitutional powers to unelected bureaucrats.",
    "Does he have one, or is this just campaign rhetoric designed to boost his standing with gun owners ahead of the May primary?",
    "Yes, the ATF could serve an important and valuable function, all while safeguarding the rights of citizens.",
    "It’s an important point, but this concern is actually well served by abolishing the ATF.",
    "Rather than try to reform the agency, Vance says it’s time to shut it down.",
    "As campaign fodder, this is some juicy red meat for the GOP base.",
    "The ATF is doing the opposite, so it’s time to get rid of it.",
    "Yet this is exactly what the ATF’s new database does.",
    "The ATF’s focus suggests radical change is needed.",
    "But it doesn’t, so it’s time to start anew.",
    "Senator is getting interesting."
  ]
}