{
  "id": 15110,
  "mediaId": 2819,
  "date": "2022-02-23",
  "headline": "Donald Trump Softened the GOP on Russia—At Least for Now",
  "image": "https://api.time.com/wp-content/uploads/2022/02/donald-trump-vladamir-putin.jpg?quality=85&w=1200&h=628&crop=1",
  "link": "https://time.com/6150495/republicans-russia-putin-trump/",
  "mediaOutlet": "Time",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philip Elliott",
  "authorUrl": "",
  "termIds": [
    2440,
    2369,
    2765,
    3254,
    4591,
    1312,
    1126,
    6672,
    6569,
    6411
  ],
  "sentences": [
    "Dwight D. Eisenhower in 1950 described the former Allied powers in Moscow as “those people, behind and beyond the Iron Curtain, [who] have seen so much political wickedness and cold blooded betrayal, such Godless depravity in government.” Then-Vice President Richard Nixon faced off in a mocked-up American home against Nikita Khrushchev in 1959 in what has come to be called The Kitchen Debate.",
    "And if he doesn’t, plenty of his heirs are ready to adopt his stance: former Secretary of State Mike Pompeo, who has his own presidential ambitions, has praised Putin in some interviews, calling him at turns “a credible, capable statesman” in one interview and proclaiming “enormous respect” for the former KGB agent.",
    "More Must-Read Stories From TIME\nAs Putin Threatens Nuclear Disaster, Europe Learns to Embrace Nuclear Energy Again\n‘We Knew It Was Coming.’ Police-Reform Advocates in Grand Rapids, Mich., Had Been Bracing for a Death Like Patrick Lyoya’s\nAmerican Companies Have Always Been More Anti-Union Than International Ones.",
    "For Ronald Reagan, the Soviet Union was the unquestioned “evil empire.” When Mitt Romney was the Republican nominee for President in 2012, he had no pause: “Russia, this is, without question, our number one geopolitical foe.”\nBut then in the next election cycle, the Republican Party made a dramatic pivot.",
    "McCain liked to turn that premise on its head: “I looked into Mr. Putin’s eyes and I saw three things: a K, a G, and a B.” It always drew a chuckle from the crowds and a begrudging groan from those of us who were hearing it for the hundredth time.",
    "But She May Well Be Innocent\nThe First COVID-19 Breathalyzer Test Is Coming to the U.S.\n14 Book-to-Screen Adaptations to Catch in 2022\nColumn: America Gave Up on Overtime—and It’s Costing Workers $35,451 a Year\nSHARE THIS STORY",
    "By the time Election Day 2008 arrived, John McCain’s traveling press corps had often heard a famous line that set the Arizona Republican apart from the deeply unpopular incumbent Republican President he was looking to follow.",
    "That’s why even in criticizing Putin, the House Republicans’ Leadership team accused Biden of adopting a policy of “appeasement” and cast the true perpetrator as the team in the White House and not the Kremlin.",
    "Most joke that they’re playing a game of bingo among themselves, racing to complete their card first as the equally exhausted candidate rushes to hit as many swing states and donor dinners as is possible.",
    "Vance essentially blew it off: “I don’t really care what happens to Ukraine one way or another.”\nIt might be the politically smart stance, at least in the current GOP still taking its cues from Trump.",
    "But as Russia’s interference came to Trump’s benefit in the 2016 election, the script flipped, with just one-in-three Republicans now seeing Russia as a threat in the Gallup numbers.",
    "For years, it went on faith that Republicans would be tough on Russia and Democrats would treat it as an overblown relic, as Obama himself did during one 2012 debate with Romney.",
    "Not all Republicans have adopted Trump’s zeal for Kremlin-led autocracy, but they also know they can ill-afford a cranky Trump as they try to take back control of the House.",
    "(One such host even suggested the Biden Administration was hyping Ukraine to protect Hillary Clinton from a court filing that conservative media outlets have obsessed over.)",
    "While Republicans for years had been seen as the pro-military, hawkish half of the country, two decades of wars in Afghanistan and elsewhere have left the base weary.",
    "For every presidential campaign’s press corps, there comes a point when the weary road warriors have the candidate’s go-to jokes, cadences and pet peeves down cold.",
    "For Republicans chasing power, it would be tempting to trade-in McCainism for Trumpism, especially if the party’s base would rather see MAGA hats than KGB spooks.",
    "The steady messaging coming from Fox News—especially its opinion hosts—is that Ukraine is of little U.S. interest and Russia might be justified in its invasion.",
    "Hence, Trump’s assessment of Putin’s latest moves towards Ukraine as “genius” and “savvy” this week sent the foreign policy establishment into Did He Say That?",
    "Republican voters tell pollsters they’re less eager than Democrats to dispatch forces to fight Russia—a 15-point difference in YouGov’s latest polling.",
    "Others point out that the invasion of eastern Ukraine and Crimea by Russia occurred under President Barack Obama and then-Vice President Biden in 2014.",
    "Then-President George W. Bush described his meeting with Russian President Vladimir Putin as looking into his counterpart’s eyes and seeing his soul.",
    "For most of the post-World War II era, such a critical posture against the failed Soviet Union and its successor, Russia, was Republican doctrine.",
    "Rather than treat Putin’s Russia as a rival worthy of caution and distrust, many in the GOP followed the lead of the party’s biggest new voice?",
    "But even the most hardened lines against Moscow can get whittled down over the years, especially if someone like Trump is given a drum sander.",
    "Here's Why\nA Foreign Fighter on What It Was Like on Ukraine's Front Line\nColumn: Texas Is About to Execute a Woman for Her Daughter's Death.",
    "And from that repositioned ground, many Republicans in Congress are trying to navigate this week’s start to a Russian invasion of Ukraine.",
    "The quake may be temporary or it may harden, but there’s no denying that the GOP has had its core shaken since 2016 in still untold ways.",
    "YouGov polling from January finds 62% of Republicans and independents who lean that way find Putin a stronger leader than Joe Biden.",
    "Gone are the days of McCain’s reliable zingers, replaced by a party whose members are embracing “America First” isolationism.",
    "Graham is now pushing for “a sanctions regime from hell” against Putin—a package that lawmakers last week couldn’t pass.",
    "The base seems to be responding favorably to the slide toward Russian apologia already in motion for the last six years.",
    "This is an election year and every utterance and vote is fodder, especially for Republicans facing primary opponents.",
    "Trump certainly didn’t recognize Putin’s looming threat to Eastern Europe, which is now manifesting into reality.",
    "If polling holds, Trump is positioned as the GOP’s favored candidate to win the presidential nomination in 2024.",
    "It’s an early test of where lawmakers and those who hope to become them in the Republican Party need to be.",
    "According to Gallup, Republicans for years tended to have a more skeptical view of Russia than Democrats.",
    "The former reality-show host seemed not to understand Russia’s attempts to meddle in the 2016 election.",
    "That doesn’t make Putin any less of a threat to the United States’ strategic alliance with the West.",
    "Trump saw strength and ruthlessness in Putin, qualities the New York real estate mogul appreciated.",
    "Some, like Sen. Lindsey Graham, remember traveling the globe at McCain’s side provoking Moscow.",
    "Specifically on Russia, Trump’s rhetoric has helped usher a seismic shift.",
    "mode, but didn’t wreck his chances in another potential presidential run.",
    "This article is part of the The DC Brief, TIME’s politics newsletter.",
    "Trump’s respect for Putin isn’t outside the mainstream any longer.",
    "The footing on Russia has shifted among Republicans, though.",
    "Sign up here to get stories like this sent to your inbox.",
    "Trump understood that before the rest of the party did.",
    "Not all Republicans have been subsumed by Trumpism.",
    "In Ohio, for instance, Senate candidate J.D.",
    "Make sense of what matters in Washington.",
    "Sign up for the D.C. Brief newsletter.",
    "?, Donald Trump."
  ]
}