{
  "id": 1537,
  "mediaId": 2553,
  "date": "2022-02-11",
  "headline": "Three-Star General: Teaching Critical Race Theory Leads To Military Failure",
  "image": "https://dw-wp-production.imgix.net/2022/02/A84F8BE3-AFB0-47AF-90B6-E684B4806B79_1_201_a.jpeg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/three-star-general-teaching-critical-race-theory-leads-to-military-failure",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Johnson",
  "authorUrl": "https://www.dailywire.com/author/ben-johnson",
  "termIds": [
    2750,
    4091,
    4905,
    4952,
    4306,
    1282,
    355,
    681
  ],
  "sentences": [
    "Vance, the author of “Hillbilly Elegy” and Republican primary candidate for U.S. Senate from Ohio, replied, “I personally would like American generals to read less about ‘white rage’ (whatever that is) and more about ‘not losing wars.’”\nCRT, which author and commentator Richard Delgado said was created at an academic conference by “a bunch of Marxists,” became a national controversy as parents raised concerns over materials in their children’s curriculum.",
    "“The tenets of Critical Race Theory – a cross-disciplinary intellectual and social movement that seeks to examine the intersection of race and law in the United States, but which has the unfortunate effect of dividing people along racial lines – undermine our military’s unity and diminish our warfighting capabilities,” wrote Newbold in the military publication Task & Purpose on Thursday.",
    "Failure results.”\nNewbold, the former director of operations for the Joint Chiefs of Staff, said the military requires conformity and unity; “group identity is corrosive and … antithetical to the traits that deter a potential enemy and win the wars.”\n“Those officeholders who dilute this core truth with civil society’s often appropriate priorities (diversity, gender focus, etc.)",
    "“Combat is the harshest meritocracy that exists,” he added, calling for “ruthless adherence to this principle.” Military leaders risk the nation’s safety when they “dilute requirements based purely on merit in favor of predetermined outcomes to favor social engineering goals.” He said the desire to place women in combat positions was one such example.",
    "When enemies read of male soldiers wearing pregnancy suits and high heels, required “sensitivity” training, “Emma and her two moms” recruiting videos, “safe spaces” from the pressures of introductory training, the dilution of our ground combat forces, and transgender special treatment, they judge these actions not by our standards, but by their own.",
    "The condition is exacerbated and enabled when the most senior military leaders — those who ought to know better — defer to the idealistic judgments of those whose credentials are either nonexistent or formed entirely by ideology,” he wrote.",
    "“Will Russian President Vladimir Putin conclude that our forces are not as tough as Russian soldiers[…]?”\nNewbold has attacked politicians of both parties when they pursued policies he believed risked American lives unnecessarily.",
    "Newbold sounded similar alarms last July, when he wrote in The Federalist:\nOur adversaries observe how social engineering has become deeply embedded in our military, and they conclude that we are weak, built on feet of clay.",
    "A three-star general has warned that teaching Critical Race Theory (CRT) in the military divides soldiers by race, diminishes our “warfighting capabilities,” and increases the likelihood of “failure” on the battlefield.",
    "Combat units must reflect “the highest levels of discipline, fitness, cohesion, esprit, and just plain grit.”\nNewbold obliquely criticized both President Joe Biden and Chairman of the Joint Chief of Staff Mark Milley.",
    "“The commitment of our forces to this fight was done with a casualness and swagger that are the special province of those who have never had to execute these missions — or bury the results,” he wrote in 2006.",
    "Milley testified before Congress last year that U.S. soldiers should study CRT, because “I want to understand white rage,” which he alleged fueled the D.C. riot last January 6.",
    "Newbold went on to denounce all social or political causes that did not contribute to the military’s two key goals: to deter aggression or defeat the enemy in war.",
    "“We signal a dangerous shift in priorities (as just one example) when global warming, not preparedness to defeat aggressive global competitors,” he wrote.",
    "strongly criticized military leaders — and civilian commanders — who “favor social engineering goals” over “meritocracy” and military preparedness.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "He received glowing coverage when he became an outspoken critic of the U.S. invasion of Iraq after retiring from the Marine Corps in 2002.",
    "He also publicly called for then-Defense Secretary Donald Rumsfeld to resign over setbacks encountered during that conflict.",
    "America’s leaders suffering from “warfare dementia” forget the high casualties of war “most assuredly will be paid in blood.",
    "His article contrasted CRT with “the tenets of Critical Military Theory,” the philosophy necessary to win, or prevent, wars.",
    "“Will China be more or less emboldened to seize Taiwan if they misjudge the strength and grit of our military?” he asked.",
    "With prescience, he asked whether apparent U.S. weakness would trigger future Chinese and Russian military aggression.",
    "The views expressed in this piece are the author’s own and do not necessarily represent those of The Daily Wire.",
    "The same year, he endorsed Democrat Jim Webb, who went on to win Virginia’s U.S. Senate race.",
    "“[W]hen we highlight differences or group identity, we undermine cohesion and morale.",
    "They lampoon and deride our silliness (and so do many of our troops).",
    "Reduced chances for success mean more casualties,” he wrote.",
    "Get inside access to The Daily Wire by becoming a member.",
    "undermine the military’s chances of success in combat.",
    "Create a free account to join the conversation!",
    "Lieutenant General Greg Newbold (USMC, Ret.)",
    "His remarks drew instant backlash.",
    "J.D."
  ]
}