{
  "id": 1730,
  "mediaId": 238,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Opinion Why J.D. Vance's crude nationalism still might not be the GOP's future",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/05/jd-vance-crude-nationalism-not-republican-future/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "In a chilling investigation of the new right? ecosystem in which Mr. Vance circulates, James Pogue notes in Vanity Fair that Mr. Vance wants Mr. Trump to retake the White House in 2024, fire the entire federal civil service and ignore courts when they deem these moves illegal  essentially, to execute a coup.",
    "The irony of a Yale Law School graduate, New York Times bestselling author, Netflix producer and wealthy venture capitalist running a campaign against elites was apparently lost on Mr. Trump, who endorsed Mr. Vance, and large numbers of Ohio Republican primary voters.",
    "In his recent campaigning, Mr. Vance has railed against aiding Ukraine in its struggle against a Russian invasion, which would commit the United States to the same sort of blinkered isolationism that proved calamitous in the run-up to World War II.",
    "But voters tend to be more complex than politicians and political analysts assume, and uninterested in the sorts of grandiose ideological projects that people such as Mr. Vance and his fringy followers propose.",
    "Over the coming election season, Republicans could validate the fears that their party has gone completely around the bend  or show that they are better than their worst impulses.",
    "It is far from clear that Mr. Trump's favored candidate in the Pennsylvania U.S. Senate primary, TV celebrity and purveyor of medical quackery Mehmet Oz, will prevail in his bid.",
    "Ohio's primary was also just the first in a series of tests that will clarify how tightly the Republican Party is bound to Mr. Trump and the illiberal forces he is mustering.",
    "Either way, the radical philosophy he now espouses amounts to an outburst against reality and reason that, if acted upon, would have dire consequences for the country.",
    "Vance won the Ohio GOP Senate primary on Tuesday, in what many deemed confirmation that former president Donald Trump holds an iron grip on the Republican Party.",
    "One of those other candidates, Cleveland Guardians part-owner Matt Dolan, performed well despite refusing to pander to Mr. Trump.",
    "Georgia Secretary of State Brad Raffensperger (R), whom Mr. Trump has attacked viciously, might survive a primary challenge.",
    "Mike DeWine, a traditional Republican who has a tense relationship with Mr. Trump, handily won his primary race.",
    "Polls indicate that Mr. Trump's campaign against Georgia's incumbent governor, Brian Kemp (R), is failing.",
    "As Post columnist James Hohmann noted, a supermajority of Republican primary voters picked someone else.",
    "It is hard to decide whether it would be worse if Mr. Vance's ideological turn was cynical or sincere.",
    "Frequent Trump punching bag Sen. Lisa Murkowski (R) also has a good shot of holding on in Alaska.",
    "But it is too early to tell whether his brand of apocalyptic nationalism is truly ascendant.",
    "He calls universities the enemy? and favors confiscating their endowments.",
    "Yet the manner of Mr. Vance's victory Tuesday also offers room for hope.",
    "Mr. Vance's rise is, indeed, an ominous sign for the GOP and the nation.",
    "Mr. Trump clearly still holds substantial sway among Republicans.",
    "Trump skeptic-turned-sycophant J.D.",
    "And incumbent Gov."
  ]
}