{
  "id": 1768,
  "mediaId": 63,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Ohio Senate Primary: Trump-Backed J.D. Vance Wins GOP Nomination In Crowded Field",
  "image": "https://imageio.forbes.com/specials-images/imageserve/6271c47659df7c1050f7f491/Former-President-Trump-Holds-Rally-In-Ohio-Ahead-Of-State-s-Primary/0x0.jpg?fit=crop&format=jpg&crop=4151,2336,x0,y211,safe",
  "link": "https://www.forbes.com/sites/nicholasreimann/2022/05/03/ohio-senate-primary-trump-backed-jd-vance-wins-gop-nomination-in-crowded-field/",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicholas Reimann",
  "authorUrl": "https://www.forbes.com/sites/nicholasreimann/",
  "termIds": [
    946,
    1147,
    1801,
    2027,
    2095,
    3103,
    428,
    571,
    2609,
    2614,
    2623,
    2845
  ],
  "sentences": [
    "Vance, a former Trump critic who has since become an outspoken supporter of the former president, jumped from around 10% support to become the favorite after landing Trump's coveted endorsement in mid-April, according to the RealClearPolitics polling averagemuch to the chagrin of several other pro-Trump candidates.",
    "Vance may have said some not-so-great things about me in the past, but he gets it now, and I have seen that in spades.?\nMany consider Vance's 2016 memoir Hillbilly Elegy an explainer on how Trump won significant support from white, working-class voters who had traditionally supported Democrats.",
    "Trump in March withdrew his endorsement of Rep. Mo Brooks (R-Ala.) for Alabama's open Senate seat amid slumping poll numbers, while his most high-profile endorseeformer Sen. David Perdue (R-Ga.), a Georgia gubernatorial candidateseems at risk of losing in a landslide to incumbent Gov.",
    "Key Facts\nThe AP called the race at 9:34 p.m. Eastern time with 53.7% of precincts reporting, with Vance sitting at 31.7% of the vote, followed by fellow hard-right candidate Josh Mandel at 24.5% and more moderate state Sen. Matt Dolan at 22%.",
    "Many pundits are looking to the performance of Trump's endorsements as a key indicator of the future of the party, and a sign of whether Trump still wields the power he's long held over the GOP as figures like Florida Gov.",
    "Vance has won Ohio's Republican Senate primary, the Associated Press projected Tuesday evening, signaling former President Donald Trump's backing remains a major factor in shaping the results of GOP contests.",
    "Vance had significant financial backing from billionaire tech mogul and Trump donor Peter Thiel, who bankrolled a group called Protect Ohio Values that spent around $10 million on pro-Vance advertising.",
    "This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race,? Trump said in an April 15 statement, before adding: I think J.D.",
    "The ex-president endorsed Sean Parnell early in the campaign, but Parnell wound up dropping out after losing custody of his three children following abuse claims from his ex-wife.",
    "The book, in part, attributed the shift in Appalachia and Rust Belt areas to the belief among poorer white voters that social welfare programs eroded personal responsibility.",
    "Unofficial results released Tuesday night showed Vance and Mandel largely split rural parts of the state, while Dolan held large leads in Columbus and the Cleveland area.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent.?\nVance will face Rep. Tim Ryan (D-Ohio) in the November 8 general election.",
    "Trump has since endorsed television personality Dr. Mehmet Oz, who's trailing in polls to former Treasury Department official David McCormick.",
    "Vance evolved from a Trump critic in 2016 to become a staunch supporter, ultimately saying he regretted his earlier comments about Trump.",
    "Brian Kemp (R-Ga.), despite Trump repeatedly attacking the governor for not trying to overturn the 2020 election results.",
    "Trump also fumbled on his initial endorsement in the open Pennsylvania Senate race, another closely watched contest.",
    "'Unprecedented' Ohio Senate race spending hits record $66 million ahead of Tuesday primary (Columbus Dispatch)",
    "Trump's longstanding status as a deciding factor in GOP races had been called into question recently.",
    "The ex-president recognized the change when making his endorsement, saying: Like some others, J.D.",
    "Ron DeSantis (R) become more popular among the party's conservative base.",
    "That's how much money was reportedly spent in Ohio's Senate contest.",
    "Vance narrowly led Cincinnati's Hamilton County, where he lives.",
    "Ryan handily won the Democratic nomination Tuesday.",
    "Topline\nTrump-endorsed Hillbilly Elegy author J.D.",
    "The seat is open due to the retirement of Sen.",
    "Rob Portman (R).",
    "$66 million."
  ]
}