{
  "id": 1811,
  "mediaId": 2658,
  "date": "2022-02-07",
  "headline": "'Precipitous decline': J.D. Vance pollster issues warning on Ohio Senate race",
  "image": "https://static.politico.com/65/82/0d39d241444eaa9b2188047ba3c6/election-2022-senate-ohio-54337.jpg",
  "link": "https://www.politico.com/news/2022/02/07/jd-vance-warning-ohio-senate-race-00006310",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5581,
    5660,
    2290,
    2765,
    2939,
    2806,
    4306,
    1489,
    980,
    1126,
    6474
  ],
  "sentences": [
    "But Fabrizio, who is also a longtime Trump pollster, wrote in the presentation that Vance is “now underwater with strong Trump” supporters “and very conservative voters, groups needed to win a GOP primary.” He added that Vance’s “association as a Never Trumper has only grown since November” and that “being anti-Trump is the #1 reason voters do not like Vance.”\nSeveral months out from the May 3 primary, the presentation says that “consideration of Vance has fallen most dramatically with those on the right: conservatives and strong approvers of Trump,” and that the “perception” of Vance “as a moderate or even as a liberal continues to steadily grow.”\n“The groups where Vance has improved are those we don’t want him doing better with: Trump disapprovers and moderate/liberals,” Fabrizio wrote.",
    "The polling memo contends that Vance has an opening to make further inroads with conservatives by stressing messages such as “cutting federal aid to localities that allow non-citizens to vote,” and requiring proof of citizenship to get public assistance.”\nThe report’s conclusion: “Vance needs a course correction ASAP that will resolidify him as a true conservative.",
    "The presentation includes a six-page section devoted to exploring the impact of a Trump endorsement and concludes that, in the event he received the former president’s support, Vance’s vote share would jump from 9 percent to 35 percent, the polling suggested, more than tripling the support held by his nearest rival in that scenario.",
    "Fabrizio also pointed to the changes in the race since the poll was taken and said that, with his endorsement from Greene, Vance was “shoring up his credentials as the conservative outsider in the race.”\nYet it’s another, as-yet-undelivered endorsement that hangs over the race: Trump’s.",
    "Vance, a venture capitalist and the author of “Hillbilly Elegy,” has been working to make inroads with both Trump supporters and Trump himself: Last year, Vance and his main financial benefactor, tech billionaire Peter Thiel, at his Mar-a-Lago estate in South Florida.",
    "According to the slide deck, Vance has seen a “precipitous decline” in Ohio’s GOP Senate primary since last fall, when a pair of outside groups backing a rival began a using five-year-old footage of Vance attacking former President Donald Trump.",
    "Vance has had the most money spent against him and virtually none on his behalf.”\nThat could change quickly: The super PAC went into 2022 with more than $6 million in its bank account, according to recent campaign finance disclosures.",
    "Fabrizio also noted that since the poll was taken, Vance won the endorsement of Georgia Rep. Marjorie Taylor Greene, the conservative firebrand popular among Republican grassroots activists, and held a campaign event with her in Ohio.",
    "He is followed closely in the results by self-funding investment banker Mike Gibbons, with 14 percent, former state GOP Chair Jane Timken with 13 percent, business owner Bernie Moreno with 11 percent, and Vance at 9 percent.",
    "Vance allies downplayed the memo, noting that the poll is nearly three weeks old and that several major developments have taken place in the race in the last few weeks, including the withdrawal of one of Vance’s rivals.",
    "Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival Josh Mandel, which have portrayed Vance as an anti-Trump figure.",
    "Meanwhile, Republican candidates are welding themselves to the former president and aggressively seeking out his endorsement; last spring, a handful of the Ohio Republican candidates met with Trump for an .",
    "The Senate race in Ohio is a high-profile example of how Trump is dominating Republican down-ballot primaries, and how his support is seen as make-or-break for those seeking the party’s nomination.",
    "According to the slide deck, “anti-Trump is by far the top thing the 50% of voters who have seen an ad about Vance remember.”\nStill, the polling paints the picture of a close, crowded race.",
    "In addition to Moreno’s departure, the Club for Growth has begun an advertising offensive targeting Timken, and another candidate, wealthy state Sen. Matt Dolan, has begun spending heavily.",
    "The commercials, which use footage from 2016, show Vance describing himself as a “Never Trump guy” and calling Trump an “idiot,” “noxious” and “offensive,” appear to have made a dent.",
    "A produced by Tony Fabrizio, who has been polling for the pro-Vance Protect Ohio Values super PAC since last year, paints a dire picture of the candidate’s prospects.",
    "In a statement to POLITICO, Fabrizio pointed out that the race has taken several turns since the January survey was conducted that make the results outdated.",
    "Fabrizio, who last week transitioned from working for the super PAC to working for Vance’s official campaign, noted in a statement that “to date, J.D.",
    "He has a ton of strong messaging to make that happen and he should push it hard.”\nA representative for the pro-Vance super PAC declined to comment.",
    "This has only grown since” November, said the presentation, which is based on polling data of 800 likely primary voters conducted Jan. 18-20.",
    "A polling presentation for the pro-Vance super PAC shows the candidate suffering from attacks on his past comments about Trump.",
    "The survey shows Mandel, a former state treasurer who unsuccessfully ran for Senate in 2012, out ahead with 15 percent.",
    "Vance “needs a course correction ASAP” — and that’s according to the well-funded super PAC supporting him.",
    "Vance refashioned himself as a Trump supporter long ago, but his past comments are sticking to him.",
    "(Moreno dropped out of the primary last week, several weeks after the poll was taken.)",
    "Fabrizio’s slide deck suggests that is the one that could really propel Vance.",
    "Vance also recently embarked on a 20-stop, town hall tour through the state.",
    "“Driving his negatives is the perception that he is anti-Trump.",
    "Thiel seeded the group with $10 million last year.",
    "Republican Senate candidate J.D."
  ]
}