{
  "id": 1909,
  "mediaId": 2564,
  "date": "2022-02-07",
  "headline": "Facebook angel investor Peter Thiel steps down from the social media giant's board after 17 years to back GOP candidates JD Vance and Blake Masters for US Senate: Follows disastrous day for Meta which saw stocks plunge by 26%",
  "image": "https://i.dailymail.co.uk/1s/2022/02/08/00/53899427-0-image-a-35_1644279642851.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10486959/Peter-Thiel-step-Meta-Platforms-board.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Drudge Report",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Manno For Dailymail.Com",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Adam+Manno+For+Dailymail.Com",
  "termIds": [
    2638,
    3005,
    3706,
    4306,
    5660,
    1489,
    468
  ],
  "sentences": [
    "The aim of the protest is for all medical tattoo artists and breast cancer survivors to be able to freely post images without being blocked and subsequently losing their account\n+32\nView gallery\nSenior campaigner Flora Rebello Arduini with a 4-metre-high installation, depicting Mark Zuckerberg surfing on a wave of cash and surrounded by teenagers, outside the Houses of Parliament in London in October\n+32\nView gallery\nFacebook whistleblower Frances Haugen, center, poses during a visual protest, organised by campaign group SumOfUs, prior to her testimony at the European Parliament in Brussels in November\nMeanwhile, Zuckerberg drew mockery with a cringeworthy Fourth of July video showing him riding an electric surfboard while holding an American flag as John Denver's Take Me Home, Country Roads plays.",
    "+32\nView gallery\nFacebook reported its first ever decline in daily users, with the greatest loss in Africa and Latin America, which analysts allege may suggest the product is globally saturated\n+32\nView gallery\nZuckerberg said the drop was due to a weak revenue forecast as the company faces an 'unprecedented level of competition' from TikTok, owned by Chinese company ByteDance\nZuckerberg told his employees that the drop was due to a weak revenue forecast as the company faces an 'unprecedented level of competition' from TikTok, owned by Chinese company ByteDance.",
    "+32\nView gallery\nFacebook CEO Mark Zuckerberg speaks to an avatar of himself in the 'Metaverse' during a live-streamed virtual and augmented reality conference to announce the rebrand of Facebook as Meta in October\n+32\nView gallery\nA handout photo made available by Meta showing a framegrab from the keynote speech about the new company brand announced by Facebook CEO Mark Zuckerberg during the virtual Connect 2021 Conference in Menlo Park\nMeta is betting heavily on its belief that the metaverse is the next major evolution of how humans live with the internet.",
    "+32\nView gallery\nFacebook CEO Mark Zuckerberg (seen in October) suffered a rough year in 2021, culminating in a devastating decline in users in the final quarter following a number of controversies\n+32\nView gallery\nFormer Facebook employee Frances Haugen testifies before Senate Subcommittee on Consumer Protection, Product Safety and Data Security during a hearing about Facebook File: Protecting Kids Online in October\n+32\nView gallery\nFacebook CEO Mark Zuckerberg announces the company's new name, Meta, during a virtual event in October.",
    "+32\nView gallery\nUsers around the world reported problems with Facebook, Instagram and WhatsApp on Downdetector\nA Facebook staff member reportedly accidentally deleted large sections of the code (pictured) which keeps the website online\nRamesh Srinivasan, a professor at UCLA's Department of Information Studies and expert on the relationship between technology and society, told DailyMail.com that both Facebook's outage and the damaging whistleblower revelations only served to underline the need for heightened government regulations.",
    "+32\nView gallery\nMark Zuckerberg impersonator 'Zach Mossbergsson' made a tourism campaign video for the company Inspired by Iceland, spoofing the Facebook founder's Meta announcement\nThe impersonator copied Zuckerberg's stiff tone while donning his black sweater and sporting his short combed haircut in the video\nMossbergsson then introduces the name of this 'product' which he dubs the 'Icelandverse' which is an 'enhanced actual reality without silly looking headsets.'",
    "+32\nView gallery\n+32\nView gallery\nZuckerberg V Biden: Facebook hit back at President Biden after he accused the company of 'killing people' by allowing misinformation about the COVID-19 vaccine to circulate on its platform\nIn an interview with CBS This Morning host Gayle King, Zuckerberg rejected the notion that Facebook plays a significant role in discouraging vaccine uptake, insisting that 'political leaders' and the media are responsible.",
    "Above, Trump and Thiel at a meeting in Trump Tower in December 2016\n+32\nView gallery\nFacebook CEO Mark Zuckerberg said Monday that Thiel has been a 'valuable member' of the board and that he was 'deeply grateful for everything he has done' for the company\nIn recent years, Thiel's position on the board has been in the spotlight, given his conservative views, as the company has been caught up in political controversies and backlash.",
    "Mark Zuckerberg's terrible year: Facebook's devastating decline in users caps off turbulent 2021 in which the company was rocked by whistleblower allegations, major service outages, and constant controversy\nFacebook's devastating earnings report marked the end of a difficult year for the company, which has been battered by whistleblower allegations, a major global service outage, and protests and controversy over its policies.",
    "Vance in Ohio (left) and Blake Masters in Arizona (right)\n+32\nView gallery\nFacebook parent Meta's stock ended Friday's session at $237.09, roughly even on the day but down 21 percent from the start of the week\nThiel became a Facebook investor in 2004, when he provided $500,000 in capital at a $5 million valuation for a 10 percent stake in the company and a seat on its board of directors.",
    "Kieron Harding, an IT Infrastructure Engineer at GRC International Group, told DailyMail.com: 'The nature of the problem meant Facebook would have needed network engineers to physically access their BGP routers – and due to the pandemic, some of the data centers quite possibly don't have an engineer based on site, or someone who could have immediately started to work on the problem.'",
    "'One of the reasons why the outage lasted for as long as it did was because the misconfiguration of the BGP also affected Facebook's physical door access systems – which shut down; meaning engineers couldn't get into the buildings, or secure rooms, to start fixing the issues straightaway,' said Harding.",
    "+32\nView gallery\nVenture capitalist Peter Thiel is leaving Facebook's board of directors this year to focus on supporting Republican candidates in the 2022 midterm elections\nLast year, the billionaire donated $10 million each to two separate super PACs supporting Republican Senate candidates J.D.",
    "Zuckerberg promises that the virtual-reality 'metaverse' he's planning to build will 'let you do almost anything'\nAmong the allegations were that Facebook is aware of the negative impact that Instagram has on teen girls, and that the company contributes to violence in developing countries.",
    "'I think there's something unique in our ecosystem here, whether it's some of the political leaders or some of the media figures which I think is different than what we're seeing across a lot of Europe or across a lot of other countries that are leading to higher levels of this.",
    "The so-called FAANG group of Facebook, Amazon, Apple , Netflix and Google's Alphabet has seen around $400 billion in market capitalization wiped off in the opening weeks of 2022 as cheaper segments of the markets become more attractive while central banks taper stimulus.",
    "+32\nView gallery\nA few social media users photoshopped Jaws into the image as he is about to devour 'the Zuck'\n+32\nView gallery\nZuckerberg is seen above photoshopped into the poster for the movie Jaws\nAnother Twitter user wondered: 'Where's Jaws when you need him?'",
    "The global outage - which hit Facebook, Instagram, WhatsApp and Messenger on Monday - was caused when the faulty configuration disconnected its servers from the internet, meaning engineers had to travel to its Santa Clara data center to fix the glitch in-person.",
    "Zuckerberg responded to a question about burnout by saying that the company is considering offering long weekends, but he added that a four-day workweek would not be productive, according to a someone who was not authorized to speak about the meeting.",
    "Above, Masters and Trump at a rally in Arizona last month\nHe's also looking at Army veteran Joe Kent, who is running in Washington state to replace Rep. Jaime Herrera Beutler, who backed Trump's impeachment after the Capitol riot on January 6, 2021.",
    "+32\nView gallery\nMark Zuckerberg's Fourth of July social media post in which he is seen riding an electric surfboard while holding an American flag as John Denver's Take Me Home, Country Roads plays in the background is getting the meme treatment.",
    "Jeff Bezos accuses Elon Musk of being in pocket of CHINESE government and woke actress Jameela Jamil claims she'll never tweet again as showbiz stars whine about tycoon's $44bn purchase of Twitter, and other top stories from April 26, 2022.",
    "Facebook parent Meta's stock ended Friday's session at $237.09, roughly even on the day but down 21 percent from the start of the week following a disastrous earnings report and the company's worst-ever trading session on Thursday.",
    "Biden accused Facebook of 'killing people' with misinformation\nIn July, President Joe Biden said that Facebook is 'killing people' with misinformation about COVID-19 and vaccines, drawing a furious response from Facebook execs.",
    "Wednesday's earnings report was the first quarterly result released since the company's name change in late October, which was both a turn toward the metaverse vision and a turn away from its scandal-prone social media empire.",
    "Facebook's devastating earnings report marked the end of a difficult year for the company, which has been battered by whistleblower allegations, a major global service outage, and protests and controversy over its policies.",
    "It is believed that a faulty update to Facebook's Border Gateway Protocol (BGP), which routes traffic between large private networks and the public Internet, left apps and browsers unable to locate the company's services.",
    "Meta stock had plunged 26 percent on Thursday after the company reported its first-ever decline in daily active users, wiping $237 billion from its market capitalization in the company's biggest-ever single day loss.",
    "It sent Facebook shares plunging 26 percent as of Thursday when the markets closed, wiping more than $230 billion off the company's market cap and erasing at least $29 billion from CEO Mark Zuckerberg's net worth.",
    "But the repair was delayed, according a purported insider, because of 'lower staffing in data centers due to pandemic measures', along with outages in physical access card systems and internal messaging services.",
    "'People use Facebook and social media all across the world so if this was primarily a question about social media I think you would see that being the effect in all the countries that use it,' said Zuckerberg.",
    "Zuckerberg attempts to shift focus to metaverse by rebranding as Meta\nIn October, Facebook changed its name to Meta Platforms Inc, or simply Meta, as it tries to shift focus to its virtual-reality metaverse.",
    "Facebook reported on Wednesday that daily logins to its services dropped nearly 500,000 during the last three months of 2021, the first time in the company's 18-year history that user activity has declined.",
    "Zuckerberg blamed the dismal performance on Apple's privacy changes and increased competition from services such as Tik Tok, but the decline in user activity follows a year of notably bad PR for Facebook.",
    "The video starts off with Mossbergsson being introduced as the 'Chief Visionary Officer' awkwardly addressing the camera while wearing Zuckerberg's black sweater and sporting short-combed haircut.",
    "A source told the Wall Street Journal that Thiel intends to focus his efforts on helping Republican candidates supporting the agenda of former President Donald Trump in the 2022 midterm elections.",
    "Another person familiar with the company's plans told AdAge that employee shares vest on February 15, meaning that employees are able to earn shares of the company if they stay through that date.",
    "Meta reported a decline in daily active users from the previous quarter for the first time as competition with rivals like TikTok, the video sharing platform owned by China's ByteDance, heats up.",
    "Meta said about 3 percent of worldwide monthly active users in the fourth quarter consisted solely of violating accounts while duplicate accounts may have represented about 11 percent of usage.",
    "Perhaps most significantly, former Facebook employee Frances Haugen leaked thousands of internal documents and embarked on a world tour testifying with damaging allegations against the company.",
    "Facebook's first big investor, billionaire investor Peter Thiel, is leaving the board after almost 17 years following a disastrous week for the social media giant and its parent company Meta.",
    "The 54-year-old German-born entrepreneur will serve on the board until Meta's annual shareholder meeting but will not to stand for re-election, Facebook's parent company said in a statement.",
    "'Because Facebook knows they operate in the dark - they don't have to tell the truth about anything - they continue to underinvest because they can get away with the bare minimum,' she said.",
    "The remarks drew fury at Facebook, and Biden later walked back his comments, saying that he was referring to the people who spread misinformation on social media, and not the company itself.",
    "He said that companies like Facebook 'extract our attention, our outrage, our negative sentiments into trillion dollar valuations,' calling it 'a mechanism of tearing us apart at the seams.'",
    "CEO Mark Zuckerberg's net worth has plunged roughly $30 billion since Facebook's quarterly report last week, pushing him off the top-10 list of Forbes billionaires, which ranked him at No.",
    "The protesters argued that medical tattoo artists and breast cancer survivors should be able to freely post images without being blocked and subsequently losing access to their accounts.",
    "'There's a lot of uncertainty about Meta's investments in the metaverse and if or when they will have a positive impact on the company's bottom line,' said analyst Debra Aho Williamson.",
    "Haugen has kept up the pressure, appearing on Thursday before a parliamentary committee in Australia to claim that Facebook underinvests in safety measures on its platforms Down Under.",
    "Protesters targeted Facebook as Zuckerberg was mocked by Iceland\nProtests against Facebook spread around the globe in 2021, regarding a number of the company's policies and practices.",
    "Scathing news reports based on internal documents leaked by ex-employee Frances Haugen rekindled long-deadlocked regulation efforts, but US lawmakers have made little progress since.",
    "The video features Zuckerberg lookalike 'Zack Mossbergsson' introducing the 'Icelandverse', a parody of Metaverse, as part of a travel campaign for the campaign Inspired by Iceland.",
    "Massive global outage of Facebook services damaged company's reputation\nFacebook's reputation was also damaged by a massive global outage lasting more than five hours on October 4.",
    "Another creative social media user photoshopped Zuckerberg onto the Gulf of Mexico, where an oil pipeline operated by Mexico's state-owned firm Pemex burst, causing a gas leak.",
    "'Peter has been a valuable member of our board and I'm deeply grateful for everything he has done for our company,' Zuckerberg said in a statement announcing Thiel's departure.",
    "Thiel has generally backed libertarian politicians in the past, such as Utah Sen. Mike Lee, Kentucky Sen. Rand Paul, and former Michigan Rep. Justin Amash, Politico reports.",
    "Meanwhile, Thiel, who co-founded Paypal in 1998, will turn his attention to candidates supporting the agenda of former President Donald Trump in the 2022 midterm elections.",
    "Pause\n0:00 / 0:00\nVoltax\nFull-screen\nThe news of Thiel's departure comes days after Facebook shares suffered a devastating stock market plunge of 26 percent on Thursday.",
    "Last spring, he took Vance to meet Trump at the Mar-A-Lago resort, where the former-president-turned-Republican-kingmaker allegedly gave Vance a 'good-natured ribbing.'",
    "He is known as the most prominent conservative voice in Silicon Valley and a strong voice on Facebook's board, which is still largely beholden to CEO Mark Zuckerberg.",
    "+32\nView gallery\nProtesters wearing inflatable breasts protest outside Facebook headquarters about the social media giant's images algorithm in London in September.",
    "Zuckerberg's July Fourth image also was superimposed on photos of recent disasters at sea, including the massive explosion of a mud volcano beneath the Caspian Sea.",
    "'Just as Facebook is opaque about its internal practices, it's also pretty opaque when it comes to how its underlying server architecture works,' said Srinivasan.",
    "The Silicon Valley giant's whistleblower crisis last year highlighted accusations that executives prioritized growth over keeping their billions of users safe.",
    "In this future that evokes science fiction, the public will use augmented reality glasses and virtual reality headsets to find their way around, work or play.",
    "According to research firm Vanda, purchases from retail investors in late 2020 and early 2021 were focused on expensive tech, EVs and so-called 'meme' stocks.",
    "In November, an Icelandic tourism campaign poked fun at Facebook founder Mark Zuckerberg in a video mocking the social media giant's name change announcement.",
    "'Look at how incredibly dependent we are as a country, as a world...on Facebook, and more largely on corporate, private, self-serving technology,' he added.",
    "+32\nView gallery\nMasters, 35, is the president of the Thiel Foundation, a charity focused on 'science, technology, and long-term thinking about the future.'",
    "At a company-wide virtual meeting on Thursday, Zuckerberg told his employees to focus on video products and warned that he might cry from a scratched eye.",
    "'Look at the blind dependence we have given, and the unjustified faith we have put in, some of the wealthiest companies in the history of the world.'",
    "Masters, 35, is the president of the Thiel Foundation, Thiel's charity focused on 'science, technology, and long-term thinking about the future.'",
    "But its construction means tens of billions of dollars of investment in the Facebook Reality Labs branch, without any benefits for a long time.",
    "The patriotic tech mogul is seen on a board in the flooded hallways of the doomed ship while Kate Winslet's character, Rose, wanders nearby.",
    "'If you look around the world in different countries - different countries are doing better or worse on getting their citizens vaccinated.",
    "'He has served on our board for almost two decades, and we've always known that at some point he would devote his time to other interests.",
    "He was a founding investor at Facebook in 2004, when he provided $500,000 to the company\nVance, 37, is an author and venture capitalist.",
    "She said Facebook disproportionately spends its safety budget in the United States and as a result the rest of the world misses out.",
    "'Facebook appears to now be feeling the impact on ad revenues from Apple's new privacy first approach,' the group's statement said.",
    "Demonstrations also followed Haugen as she testified around the world, including in Washington DC, London, Brussels and Canberra.",
    "Zuckerberg allegedly told his employees that he might tear up because he scratched his eye, and not because of the share drop.",
    "Thiel plans to focus on backing Republican candidates JD Vance and Blake Masters for Senate in the upcoming midterm elections.",
    "In September, demonstrators dressed as giant inflatable breasts protested outside Facebook's headquarters in central London.",
    "+32\nView gallery\nThiel donated $1.5 million in support of Trump's campaign in 2016 and later served on his transition team.",
    "In 2016, Thiel gave $1.5 million to pro-Trump political action committees and spoke at the Republican National Convention.",
    "The disappointment over Meta's earnings and the subsequent stock fall raised memories of the bursting tech bubble in 2000.",
    "Other social media stocks were also hit hard in pre-market trading on Thursday, including Twitter, Pinterest and Spotify.",
    "An activist group calling itself The Real Facebook Oversight Board seized on the results to warn of what may come next.",
    "He met Thiel while he was studying at Yale Law School, Politico reports, and went on to work for him in Silicon Valley.",
    "Also, conversations about raises and bonuses happen in March, potentially factoring into workers' decisions to leave.",
    "In the past week purchases of large-cap tech have skyrocketed while speculative assets have seen very little demand.",
    "Social media users photoshopped Jaws into the image, depicting the massive killer shark about to devour 'the Zuck.'",
    "Other claims based on the leaked documents relate to Facebook's role in spreading false or divisive information.",
    "Spotify has been beset by a row over COVID vaccination misinformation and also released disappointing results.",
    "In 2016, he revealed to the New York Times that he funded former wrestler Hulk Hogan's lawsuit against Gawker.",
    "Last year, he donated $10 million each to two separate super PACs supporting Republican Senate candidates J.D.",
    "Biden's remarks came in response to a reporter, who had asked about his message to 'platforms like Facebook'.",
    "The 37-year-old billionaire wore glasses and looked red-eyed, a person who attended the meeting told AdAge.",
    "Look, it's right here,' the Zuckerberg look-alike adds as he shows off Iceland's landscape from his window.",
    "I'm grateful he's served on our board for as long as he has, and I wish him the best in his journey ahead.'",
    "Thiel is backing his bid for US Senate\n+32\nView gallery\nMasters studied under Thiel at Stanford University.",
    "Thiel has given $20 million in total to separate political action committees supporting Vance and Masters.",
    "'Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions.",
    "Investors seem to be becoming highly selective after the sector's record-breaking run in recent months.",
    "'In our open world experience, everything is real,' he says as he fumbles to open a locked glass door.",
    "'Today I want to talk about a revolutionary approach to connect our world without being super weird.'",
    "'This will no doubt make them more desperate to drive ad revenue by any means necessary,' it added.",
    "The blog had published a sex tape of Hogan and the wife of radio personality Bubba the Love Sponge.",
    "Vance in Ohio and Blake Masters in Arizona, who reportedly share his anti-globalization worldview.",
    "Ron DeSantis, who has emerged as a conservative darling amid disputes over COVID-19 restrictions.",
    "Hogan, whose lawyers were paid for by Thiel, eventually won a $31 million settlement from Gawker.",
    "Meanwhile, it's crisis mode at Meta, Facebook's parent company, where shares plunged last week.",
    "Thiel added: 'It has been a privilege to work with one of the great entrepreneurs of our time.",
    "'And has been for millions of years,' he adds, awkwardly folding his arms in silence.",
    "Several of his aides got senior roles in the administration, according to Politico.",
    "So I don't think pinning this on social media primarily is accurate,' he added.",
    "+32\nView gallery\nThiel, 54, was born in Germany and co-founded Paypal in 1998.",
    "Mark Zuckerberg's intelligence, energy, and conscientiousness are tremendous.",
    "Thiel gave $1.5 million to pro-Trump organizations during the 2016 election.",
    "Before, Zuckerberg had ranked as the eighth wealthiest person in the world.",
    "His talents will serve Meta well as he leads the company into a new era.'",
    "Thiel is also said to be keeping his eye on candidates like Florida Gov.",
    "Vance in Ohio and Blake Masters in Arizona, according to Politico.",
    "Mimicking Zuckerberg's stiff tone, Mossbergsson promotes Iceland.",
    "Another Twitter user wondered: 'Where's Jaws when you need him?'",
    "Thiel seems to be focusing most of his midterm efforts on J.D.",
    "Thiel has become more interested in politics in recent years.",
    "Others added Zuckerberg with the flag into the film Titanic.",
    "And the US has a specific issue on this,' Zuckerberg argued.",
    "'Hello and welcome to this very natural setting,' he says.",
    "Thiel also invested in Vance's own venture capital firm.",
    "'The only pandemic we have is among the un-vaccinated.",
    "12 with $85 billion after the closing bell on Friday.",
    "The outlet had also outed Thiel as gay back in 2007.",
    "He encouraged employees to use their vacation days.",
    "Thiel is worth $2.6 billion, according to Forbes.",
    "The verdict forced Gawker to declare bankruptcy.",
    "He went on to serve on Trump's transition team.",
    "Both of them have worked for Thiel in the past.",
    "He studied under Thiel at Stanford University.",
    "'They're killing people,' he said.",
    "To them, we say it's already here.",
    "'Some said it's not possible.",
    "Some said it's out of reach.",
    "And they're killing people.'",
    "Advertisement",
    "Seriously."
  ]
}