{
  "id": 2068,
  "mediaId": 2712,
  "date": "2022-02-07",
  "headline": "What is the Rumble app?",
  "image": "https://www.thesun.co.uk/wp-content/uploads/2022/02/AB-RUMBLE-OP.jpg?strip=all&quality=100&w=1500&h=1000&crop=1",
  "link": "https://www.thesun.co.uk/tech/15857804/what-rumble-app-chris-pavlovski/",
  "mediaOutlet": "The Sun | The Best for News, Sport, Showbiz, Celebrities & TV | The Sun| The Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patrick Knox",
  "authorUrl": "https://www.thesun.co.uk/author/patrick-knox/",
  "termIds": [
    2379,
    4980,
    5660,
    1156,
    6661
  ],
  "sentences": [
    "Most read in Tech\nSOUND OFF\nAcast warns podcast app is shutting down for millions of users after 8 years\nSAM DUNK\nApple 'plots HUGE change' that could affect iPhone users everywhere\nFLIPPING THE BIRD\nTwitter accepts Elon Musk’s offer making billionaire ‘new owner’ of app\nSPACE DODGE\nSatellite blown up by Russia forces Nasa to SWERVE the ISS to avoid debris\nWhat is Rumble valued at?",
    "Rumble partnered with Trump Media & Technology Group in December of 2021, the latter announcing in a statement at the time that they had entered \"wide-ranging technology and cloud services agreement.\"",
    "The website began to lean into politics more heavily throughout 2020 after YouTube was accused of being \"overly censorious\" by former Rep. Devin Nunes of California.",
    "Founder and CEO of Rumble, Chris Pavlovski, is also recognized for founding Cosmic Development - an IT outsourcing and consultancy firm with around 100 employees.",
    "A former board member for Next Giant Leap, the tech mogul was selected as a finalist for the Ernst & Young Entrepreneur of the Year Awards in 2010.",
    "While an exact net worth for Pavlovski is unknown, Bloomberg estimated his personal value at around $77million in 2019.",
    "Like us on Facebook at www.facebook.com/TheSunUS and follow us from our main Twitter account at @TheSunUS",
    "According to The Wall Street Journal, with investments from venture capitalists Peter Thiel and J.D.",
    "Headquartered in Toronto, Rumble is an online video-sharing platform founded by Chris Pavlovski.",
    "After studying at the University of Toronto, Pavlovski worked for the Microsoft Corporation.",
    "From 2013 until 2020, Rumble mainly pushed viral videos from mainstream media sources.",
    "Prominent channels active on Rumble include America's Funniest Home Videos, E.W.",
    "He also sits on the board of Every Day Child, a non-profit charity.",
    "FOUNDED in 2013, Rumble is a Canadian-based online video platform.",
    "Scripps Company, Hodgetwins, Newsmax, OANN, and Reuters.",
    "Email us at exclusive@the-sun.com or call 212 416 4552.",
    "Over 32million users are active on Rumble each month.",
    "Rumble is a video sharing platform\nWhat is Rumble?",
    "Vance, Rumble is valued at around $500million.",
    "Do you have a story for The US Sun team?",
    "Who is Rumble CEO Chris Pavlovski?",
    "We pay for your stories!"
  ]
}