{
  "id": 2089,
  "mediaId": 8363,
  "date": "2022-02-08",
  "headline": "Republican candidate for U.S. Senate addresses local party",
  "image": "https://www.gannett-cdn.com/presto/2022/02/07/PMAN/4f048a3a-1935-42a0-8f13-517d6b41ba08-Gibbons_2.jpg?crop=4511,2537,x1,y399&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/02/08/richland-county-republicans-host-candidate-u-s-senate/6676777001/",
  "mediaOutlet": "mansfieldnewsjournal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Caudill",
  "authorUrl": "https://www.mansfieldnewsjournal.com/staff/4395513002/mark-caudill/",
  "termIds": [
    0
  ],
  "sentences": [
    "The candidate and father of five offered quick hits on a number of other topics, including the following:\n• Gibbons said he listened to a speech by U.S. Sen. Sherrod Brown, D-Ohio, in Cleveland and did not agree with the longtime politician.",
    "More:'Pastors over politicians:' Senate candidate Josh Mandel visits Mansfield church\nMore:'I'm not the kind of person who sits on the sidelines:' Jane Timken visits Mansfield\nGibbons touts himself as a businessman, not a politician.",
    "In an industry dominated by prominent New York and Chicago firms, BGL used its Ohio roots to help dozens of homegrown companies expand and add jobs, providing strategic and financial advice and much-needed capital.",
    "Gibbons played football at St. Ignatius High School and Kenyon College and went to work early — first with a paper route, then as a landscaper, later on construction crews and the factory floor.",
    "Gibbons has been honored with numerous awards for his business successes, including Entrepreneur of the Year for northeastern Ohio from Ernst & Young in 2002.",
    "Gibbons believes vaccination is a personal decision\nIn a question-and-answer session, he said getting vaccinated against COVID-19 is a personal decision.",
    "When Gibbons returned home for Christmas break, he found his father working at a car wash.\n\"This was a seminal happening in my life,\" Gibbons said.",
    "After earning degrees from Kenyon, Case Western and the Cleveland-Marshall College of Law, Gibbons went into the world of business.",
    "Gibbons served as Ohio finance co-chair for Trump in 2016 and gave even more money to the Trump re-election campaign in 2020.",
    "Other candidates include former Ohio treasurer Josh Mandel, former Ohio Republican Party leader Jane Timken and author J.D.",
    "Gibbons said he learned personal responsibility from his father, who lost his job while his son was a freshman in college.",
    "Gibbons said his job entails getting people to follow his ideas, which he claims would translate well to being a senator.",
    "Gibbons added he doesn't care about reelection or making friends in Washington, noting he has plenty of friends in Ohio.",
    "Starting with zero name identification, he went on to win 38 counties and 32% of the vote in the Republican primary.",
    "Gibbons said he got the vaccination because his mother-in-law is 94, and his wife is one of her primary caregivers.",
    "• Gibbons said he does not believe in public unions, claiming teachers' unions fund many Democratic candidates.",
    "\"The focus of our family was sports,\" he said, adding his father worked a second job to support those pursuits.",
    "Gibbons started his own business at age 37\nIn 1989, at the age of 37, Gibbons launched his own company.",
    "Mike Gibbons is trying to stand out in a crowded field of Republican candidates to replace Rob Portman.",
    "The Cleveland native is one of 10 people from the party running to represent Ohio in the U.S. Senate.",
    "\"It is a local and state duty,\" he said, adding school board races are as important as Senate races.",
    "He made his case Monday at the local Republican party's luncheon, held in the Kobacker Room at DLX.",
    "\"We need someone who's going to call them out on it every time they tell that lie,\" Gibbons said.",
    "Gibbons ran once before, in 2017\nIn June of 2017, Gibbons launched a campaign for U.S. Senate.",
    "Gibbons comes from working-class family\nGibbons grew up in the working-class suburb of Parma.",
    "He said the country is in \"jeopardy\" and promised six years of relentlessly defending it.",
    "\"I didn't think I'd ever run again, but then Rob Portman decided to retire,\" he said.",
    "Gibbons said his tour bus is blue and yellow, not for Michigan but for St. Ignatius.",
    "He said he decided to run because he didn't see any other candidates like himself.",
    "\"I guess I'm just the guy who's tired of throwing stuff at my TV,\" Gibbons said.",
    "• Gibbons said he would like to \"shut down\" the U.S. Department of Education.",
    "\"I have no problem with immigration, but we came here legally,\" he said.",
    "His father, Gene Gibbons, was a high school teacher and wrestling coach.",
    "\"I'm the candidate that didn't have to delete my tweets,\" Gibbons said.",
    "\"He's searching for some sort of socialist utopia that doesn't exist.\"",
    "\"My father didn't care what he had to do to take care of his family.\"",
    "Gibbons remembers his tearful mother calling to tell him the news.",
    "He said he became a conservative while attending Kenyon College.",
    "\"I listened to a man who was totally delusional,\" Gibbons said.",
    "It's making sure we don't have an authoritarian government.\"",
    "• On the 2nd Amendment, he said, \"It's isn't about hunting.",
    "He also aligns himself with former President Donald Trump.",
    "\"Don't tell me the American dream doesn't exist,\" he said.",
    "\"I knew who I was, and I never looked back,\" Gibbon said.",
    "He accused Democrats of spreading \"false narratives.\"",
    "We're going to hit every small town in the state.\"",
    "\"We are now officially in the lead in the race.",
    "\"I supported Donald Trump from the beginning.\"",
    "That company became Brown Gibbons Lang & Co.",
    "Gibbons said he is leading in the polls.",
    "• Gibbons would protect our borders.",
    "mcaudill@gannett.com\n419-521-7219",
    "Nobody is going to outwork me.",
    "Vance."
  ]
}