{
  "id": 2383,
  "mediaId": 6658,
  "date": "2022-02-07",
  "headline": "Billionaire Peter Thiel Is Exiting Facebook Parent’s Board, Reportedly to Focus on Electing Pro-Trump Candidates",
  "image": "https://variety.com/wp-content/uploads/2022/02/Peter-Thiel-Meta-board.jpg?w=1024",
  "link": "https://variety.com/2022/digital/news/peter-thiel-meta-board-pro-trump-1235174116/",
  "mediaOutlet": "variety.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Todd Spangler",
  "authorUrl": "https://variety.com/author/todd-spangler/",
  "termIds": [
    0
  ],
  "sentences": [
    "Thiel sees the midterms as crucial to changing the direction of the country, this person said, and he is backing candidates who support the agenda of former president Donald J. Trump.”\nMark Zuckerberg, Meta co-founder and CEO, said in a statement: “Peter has been a valuable member of our board and I’m deeply grateful for everything he has done for our company — from believing in us when few others would, to teaching me so many lessons about business, economics, and the world.",
    "Meta’s other current board members, in addition to Zuckerberg (who serves as chairman) are: Robert M. Kimmitt, senior international counsel at WilmerHale LLP; Peggy Alford, EVP global sales at PayPal; Marc Andreessen of VC firm Andreessen Horowitz; Drew Houston, CEO of Dropbox; Nancy Killefer, former senior partner at McKinsey & Co.; Meta COO Sheryl Sandberg; Tracey Travis, CFO of the Estée Lauder Cos.; and Tony Xu, CEO of DoorDash.",
    "The Thiel-backed litigation included Hulk Hogan’s invasion-of-privacy suit against Gawker over a video the website posted showing the wrestler having sex with his ex-friend’s wife; a jury awarded Hogan $140 million in damages in the case.",
    "Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions.”\nIn 2016, Thiel was Silicon Valley’s biggest backer of Trump, having donated $1.25 million to the presidential campaign.",
    "Thiel also is notorious for pushing Gawker Media into bankruptcy in 2016 after the company lost lawsuits funded by Thiel, who was angry about an old Gawker story that reported he was gay.",
    "Tech venture capitalist and right-wing booster Peter Thiel, after 17 years on the board of Facebook — now Meta Platforms — will step down as director of the internet giant.",
    "Last year, Thiel gave $10 million each to the campaigns of two conservative Senate hopefuls: Blake Masters, who is running in Arizona, and J.D.",
    "Thiel is leaving Meta in order to “focus on influencing November’s midterm elections,” the New York Times reported, citing an anonymous source.",
    "He co-founded Palantir Technologies, a data-analytics and antifraud software company that has received funding from the CIA’s In-Q-Tel arm.",
    "Thiel joined Meta’s board in April 2005, after he had invested $500,000 in the then-fledgling Facebook startup.",
    "Thiel, who is a partner at VC firm Founders Fund, has a net worth of $8.28 billion, per Bloomberg.",
    "He first amassed his wealth as co-founder of PayPal, which eBay acquired for $1.5 billion in 2002.",
    "He’ll continue to serve as a director until Meta’s annual meeting of stockholders.",
    "Vance, who is running in Ohio.",
    "“Mr."
  ]
}