{
  "id": 2695,
  "mediaId": 2658,
  "date": "2022-02-04",
  "headline": "POLITICO Playbook: What keeps a Supreme Court sherpa up at night",
  "image": "https://static.politico.com/0a/1b/288bd4ab4a80984dfdb14f9f80a0/gettyimages-185729511.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/02/04/what-keeps-a-supreme-court-sherpa-up-at-night-00005625",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5702,
    5802,
    1900,
    2228,
    5237,
    3887,
    4196,
    3050,
    1063,
    1269
  ],
  "sentences": [
    "Ambassador to India nominee Eric Garcetti … John Czwartacki … Vox’s Sean Illing … Matt McDonald … DOD’s Ilan Goldenberg … Nissa Koerner … former VA Secretary Jim Nicholson … Robert Buckley … White House’s Susanna Billings … John LaBombard … Shantanu Tata … Eli Woerpel … E&E’s Mike Soraghan … Thad Inge of Van Scoyoc Associates … Blair Bender … CTV’s Will Dugan … Jessica Byrd … Zachary Mitchiner of Rep. Eddie Bernice Johnson’s (D-Texas) office (26) … Ashley (Huggins) Laryea … Seth Michaels of the Union of Concerned Scientists (43) … Dan Berger … Justin Meservie … Morgan Rako … Sara Himeles … Joe Thompson … Ann Liston … Taimoor Shah … retired Adm. Dennis Blair … Amelia Chassé Alcivar … Stan Settles of Sen. Bill Hagerty’s (R-Tenn.) office … Jovanni Ortiz (3-0)\nDid someone forward this email to you?",
    "AMERICA AND THE WORLD\nOVERNIGHT AT THE OLYMPICS —Via WSJ’s Chao Deng and Ann Simmons: “Chinese leader XI JINPING and Russian President VLADIMIR PUTIN met in Beijing in a summit just ahead of the Winter Games, showcasing a united front amid a tense standoff with the West over the buildup of Russian troops near Ukraine.”\nMEDIAWATCH\nCUOMO-ZUCKER CAGE MATCH — Slate’s Noreen Malone with quite the take on JEFF ZUCKER’s shock resignation from CNN and the belief it was connected to the CHRIS CUOMO firing: “[T]he whole scandal has the whiff of classic corporate ratfuckery, with a modern twist: All the feminist lessons of the past several years have been scooped up, melted down, and welded into a sharp, sharp shiv.",
    "In a similarly relatable problem, Bloomberg reports that “the enormity of the yacht’s sails will make it unsafe to land a helicopter onboard, so Bezos has commissioned a support yacht equipped with a helipad to trail alongside.”\nFIRST IN PLAYBOOK — Sen. Bill Hagerty’s (R-Tenn.) office is announcing several staff changes: Luke Pettit has joined as senior policy adviser from Senate Banking, Natalie McIntyre is moving up to legislative director, Clark Milner is adding the duties of senior adviser, Lucas Da Pieve is moving up to deputy legislative director, and Audrey Traynor is moving up to deputy press secretary and digital director.",
    "“Since March 2020, the Trump and Biden administrations have expelled migrants over 1.5 million times without affording them the opportunity to request U.S. asylum, citing a series of CDC orders that argue the expulsions are needed to reduce the transmission of COVID-19 in border processing facilities.”\nCONGRESS\nSANCTIONS BILL UPDATE — Although a bipartisan group of senators are close to an agreement on a sanctions bill targeting Russia, lawmakers Thursday “emerged from a classified briefing … with fresh doubts about whether a legislative response could come together in time to deter an invasion,” our Andrew Desiderio reports.",
    "A final agreement remains up in the air, however, amid some debate over the sanctions’ scope and the amount of flexibility to give Biden.”\nSPECIAL PANDEMIC COMMISSION IN THE WORKS — “A broad and bipartisan group of senators is coalescing around legislation to create a high-level independent commission, modeled after the one that examined the Sept. 11 attacks, with broad powers to investigate the origins of the coronavirus pandemic and the response across the Trump and Biden administrations,” NYT’s Sheryl Gay Stolberg reports.",
    "THE WHITE HOUSE\nBIDEN’S THURSDAY WHIRLWIND — Laura Barrón-López and Christopher Cadelago have the readout on a “triumphant, if not frenetic, 24 hours for the White House — perhaps the most dizzying of his presidency,” which included a U.S. raid that resulted in the death of ISIS’ top leader, Biden’s appearance at the National Prayer Breakfast and a subsequent swing up to NYC to meet with Mayor ERIC ADAMS, speak with law enforcement and reassert his crime bona fides.",
    "— Related reading: WaPo’s Catherine Rampell argues that the American Rescue Plan had too much “extra flab” that contributed to inflation and made Build Back Better harder to pass because “the bill ultimately crowded out political support for much more important and fiscally responsible items on Biden’s agenda, such as universal pre-K and efforts to fight climate change” — which is what Summers argued was the big danger early last year.",
    "Still, “Clyburn remains optimistic that Mr. Biden will choose Judge Childs and that he will have had a hand in the selection of a groundbreaking Supreme Court nominee.”\nPOLICY CORNER\nWHAT PROGRESSIVES ARE READING (AND FUMING OVER) — The Biden administration is set to “maintain a pandemic-era order put in place under Trump that authorizes the rapid deportation of migrants from the U.S.-Mexico border,” CBS’ Camilo Montoya-Galvez reports.",
    "Zucker may be the most recent example, but he’s certainly not alone.”\n— Also: “Jeff Zucker’s legacy is defined by his promotion of Donald Trump,” by WaPo’s media columnist Margaret Sullivan: For Zucker, there was “nothing nobler than TV ratings, which always were Zucker’s guiding light, his be-all and end-all and, ultimately, his fatal flaw.”\nTV TONIGHT — PBS’ “Washington Week”: Peter Baker, Seung Min Kim, Manu Raju and Nancy Youssef.",
    "VANCE and JANE TIMKEN — “could cost the MAGA movement a conservative seat.” Our Myah Ward notes that “Moreno gave $3.75 million of his own money to his campaign and launched a $4 million television ad spree in December.”\nREDISTRICTING ROUNDUP — FiveThirtyEight’s Nathaniel Rakich delves into the implications of a federal court striking down Alabama’s congressional map for insufficient Black representation.",
    "Yet in interviews, party officials showed little appetite for organizing the GOP around Trump’s grievances.”\nNO MORE MORENO — Republican businessman BERNIE MORENO ended his Ohio Senate campaign Thursday, citing a recent conversation with Trump in which the two “agreed this race has too many Trump candidates” and that dividing up support among them — other candidates include JOSH MANDEL, J.D.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "’No decision has been made,’ she said.”\n— Cheney responded by going straight at DONALD TRUMP: “The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy,” she said in a statement Thursday night.",
    "— But it’s more serious than censure: WaPo’s Josh Dawsey reports that a deal brokered by Chair RONNA MCDANIEL will allow the RNC to financially support HARRIET HAGEMAN in her bid to oust Cheney, potentially paving the way for the national party to “send money, volunteers, data and other things to the Wyoming GOP … which could then send the resources to use against Cheney.",
    "The same worlds where abuse was likely to have been taken seriously and codified during the rise of Me Too — cloistered, rivalrous, impossibly competitive, liberal-leaning zones like television networks, academia, and Democratic politics — are now the worlds in which the accusations are most easily weaponized by power players seeking an advantage.",
    "But it’s expanded beyond that to become a go-to hub where anonymous staffers name and shame bad bosses and colleagues, and complain about absurdly long workdays, gender discrimination allegations, salaries so low they rely on food stamps to eat, generally toxic workplace behavior and an endemic lack of diversity.",
    "THE INSTAGRAM ACCOUNT THAT HAS CAPITOL HILL RIVETED — If you work on Capitol Hill, you’ve probably heard about it: “Dear White Staffers.” It’s an Instagram account that started as a place where aides of color on the Hill — which is dominated by white lawmakers and staff — could express their frustrations.",
    "“It also seemed to provide a sense of relief, and a feeling inside and out of the White House — however fleeting it may turn out to be — that progress was being made.”\nTOP-ED — When former Treasury Secretary LARRY SUMMERS warned of inflation early last year, his view was outside the mainstream consensus.",
    "POLITICO Playbook: What keeps a Supreme Court sherpa up at night\nBy RYAN LIZZA and RACHAEL BADE\n02/04/2022 06:08 AM EST\n Updated 02/04/2022 11:13 AM EST\n 2022-02-04T11:13-0500\nPresented by\nDRIVING THE DAY\nTHE PLAYBOOK INTERVIEW: STEPHANIE CUTTER — The latest Playbook Deep Dive podcast is now live.",
    "It’s just cordial.”\n— The potential political upside for Biden: “Some Republicans could overshoot this, and you already see some senators talking about how this is a ‘quota pick’ or an ‘affirmative action pick.’ … And that’s not going to sit well with people, particularly when they meet her.",
    "— What Jayapal’s doing: According to more than a dozen lawmakers, Jayapal has been working the phones to lay the groundwork for a potential leadership run — and has left some with the impression that she could challenge a fellow progressive, Assistant Speaker KATHERINE CLARK (D-Mass.",
    "Speaking of Hill employment issues …\nPELOSI BACKS HILL UNIONIZATION EFFORTS — After Pelosi dodged a question about a potential unionization push by Hill staffers during her weekly press conference, her deputy chief of staff DREW HAMMILL said Pelosi would support such an effort.",
    "This week, we sat down with the longtime Democratic strategist at the Silver Brasserie diner in Cathedral Heights (her choice) and discussed what it’s like to be a Supreme Court nominee’s “sherpa” — a role she played in the Obama administration for now-Justice SONIA SOTOMAYOR.",
    "“The account’s unfiltered, unvetted and seemingly endless content has become a must-read for aides in a town always hungry for rumor and gossip — for two very different reasons,” our colleagues Katherine Tully-McManus, Nancy Vu, Eleanor Mueller and Ximena Bustillo write.",
    "No matter what.”\n— Reporting from the RNC’s meeting in Utah, NBC’s Peter Nicholas and Allan Smith write that “a distinct chasm is emerging between Trump’s obsessions and the issues many GOP operatives consider crucial to winning the midterm elections in November.",
    "— Quite the role reversal: The Cook Political Report now forecasts that House Democrats are on track for a narrow net gain of seats from redistricting nationwide, amid a cycle that has proven far more favorable to Dems than many expected.",
    "Cutter, who might be the Forrest Gump of the modern Democratic Party, also shares her insider experiences working for MARIO CUOMO, BILL CLINTON, TED KENNEDY, JOHN KERRY, HARRY REID, BARACK and MICHELLE OBAMA, and JOE and JILL BIDEN.",
    "Others monitor it defensively, worried their office or boss is being anonymously maligned and they’ll have a mess to clean up.”\nIt’s a reminder of the lack of a strong, centralized human resources department on Capitol Hill.",
    "JUDICIARY SQUARE\nTESTING THE CLYBURN-BIDEN RELATIONSHIP — When it comes to selecting a successor for Justice STEPHEN BREYER, Clyburn has made no secret that he wants Biden to select South Carolina native J. MICHELLE CHILDS.",
    "“Negotiators have settled on a plan that punishes Russia for the destabilizing actions it has already taken, including cyberattacks targeting Ukraine as well as false-flag operations to create a pretext for an invasion.",
    "Staffers are routinely asked to work long hours with no overtime and menial salaries — and though it’s long been considered something of a rite of passage, attitudes are changing and expectations have evolved.",
    "This person is not going to come off as an ‘affirmative action pick’; this person is going to come across as the most qualified person for the court, if you just look at the women on the proverbial short list.",
    "— 2 p.m.: Biden will deliver remarks and sign an executive order on project labor agreements at Ironworkers Local 5 in Upper Marlboro, Md., with VP KAMALA HARRIS and Labor Secretary MARTY WALSH also speaking.",
    "— How that’s different from other Dems: As Sarah and Nicholas write, Jayapal’s move stands in stark contrast to the almost-frozen postures of others expected to make plays up the ladder after the midterms.",
    "He’s said as much in countless media appearances in recent days, amounting to what NYT’s Annie Karni describes as “the kind of pressure campaign that longtime Biden aides say can sometimes backfire.”\n“Mr.",
    "As the case goes to the Supreme Court, a wide range of outcomes are possible: If the high court agrees, that could open up similar court challenges to force redrawn maps in Louisiana and South Carolina.",
    "“That rapid succession of wildly different events seemed to jolt an administration that has spent most of its time in its first year grappling with a pandemic and its vast impacts,” the authors write.",
    "And there is sensitivity among some of his allies and former aides that his selection must look like the president’s own historic pick, not like a political chit he owes to Mr. Clyburn,” she writes.",
    "Now, Summers is out with a WaPo op-ed warning that today’s consensus view “that inflation will fall below 3 percent by the end of the year … is likely a repeat of last year’s wishful thinking.” Why?",
    "Matt Lee, AP’s longtime State Department reporter, had what C-SPAN called “a heated exchange” with State spokesman Ned Price over the administration’s intelligence findings about Russia and Ukraine.",
    "But I think most people are not going to have the stomach for it, and it will turn around and bite them.”\n— On what keeps her awake at night about this process: “Something that we don’t know.",
    "“But President Obama had made the decision that he didn’t want to … put some of these women up because if it wasn’t successful, it would mean they’d never be elevated to the Supreme Court.",
    "The measure — which originally called for their expulsion from the House GOP Conference — is expected to get the full approval of the RNC today, report David Siders and Natalie Allison.",
    "But I always think the worst about everything.”\n— On which of the potential Biden nominees Cutter thinks she could sell without any problems: “I could sell any of them.”\nHappy Friday.",
    "And, you know, he wanted to preserve that for them.”\n— On the work that goes into vetting a SCOTUS nominee: “Find out … who their childhood classmates were, who was their first boss.",
    "Technically, Speaker NANCY PELOSI, Majority Leader STENY HOYER and Majority Whip JIM CLYBURN (D-S.C.) have yet to announce whether they plan to stay or vacate their posts next year.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nALL POLITICS\nRNC DECLARES WAR ON CHENEY — On Thursday, an RNC resolution committee unanimously approved a formal censure of Reps. LIZ CHENEY (R-Wyo.)",
    "Todd Young called a reporter for Military.com and apologized after coldly dismissing her questions because her publication wasn’t widely read in his home state (or so he thought).",
    "PLAYBOOKERS\nJoe Biden turned to Mitch McConnell at the National Prayer Breakfast and said, “Thank you for being my friend,” a (presumably) unintentional “Golden Girls” reference.",
    "— Why that’s grating on other Dems: Indeed, Jayapal’s moves have peeved some of her colleagues, who say it’s premature to jockey for leadership while the majority is in jeopardy.",
    "She previously spent 20 years at the ACLU, most recently as director of program and strategy and deputy director of the affiliate support and nationwide initiatives department.",
    "… Movement Voter Project is adding Causten Rodriguez-Wollerman as VP of programs, Elizabeth Gramling as VP of operations and COO, and Darrell Tucci as VP of development.",
    "That said, we have to wonder how this would play out in a Republican-controlled Congress — and how it would even work, given that each office operates as its own entity.",
    "Chuck Schumer incorrectly claimed that “until 1981 … the Supreme Court was all white men,” apparently erasing Thurgood Marshall, who was sworn in as a justice in 1967.",
    "WHITE HOUSE DEPARTURE LOUNGE — Kate Childs Graham at the end of the month will leave the VP’s office, where she’s director of speechwriting, per NYT’s Annie Karni.",
    "HAPPY BIRTHDAY: Hunter Biden … Adrienne Arsht (8-0) … Fed Chair Jerome Powell … Reps. Claudia Tenney (R-N.Y.), Sanford Bishop (D-Ga.) and Michael Guest (R-Miss.)",
    "Know where to organize on the outside.”\n— Her advice for a nominee when meeting with senators: “You’re not supposed to say anything in the meeting on substance.",
    "In retrospect, his prediction proved prescient: High inflation has come to be one of the defining issues — economic or otherwise — of the Biden presidency.",
    "“Some devour the messages as a form of therapy that helps them feel understood while also providing relevant information on offices and bosses to avoid.",
    "KATHY HOCHUL signed new congressional maps into law Thursday, likely increasing the Dem majority in New York’s House delegation from 19-8 to 22-4.",
    "You know, there’s an incredibly competent team running the vetting in the White House, and I’m confident if there is something, they’ll find it.",
    "JAYAPAL MAKES MOVE TOWARD LEADERSHIP BID — Hill watchers have known for months that Rep. PRAMILA JAYAPAL (D-Wash.) wants to move up the ladder.",
    "— 5:30 p.m.: Biden will leave the White House for Wilmington, Del., arriving at 6:25 p.m.\nPress secretary JEN PSAKI will brief at 11:45 a.m.",
    "But the news is another reminder of the leadership vacuum that likely awaits Democrats next winter if the top three retire, as many expect.",
    "And we get into the weeds on why she believes Biden should ditch the Obama model of SCOTUS nominations and adopt the MITCH MCCONNELL model.",
    "“I’m a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "LAURA KELLY vetoed state Republicans’ congressional map Thursday over their attempt to break up Democratic Rep. SHARICE DAVIDS’ seat.",
    "Because of that, most Democrats fear overt leadership campaigning would undermine their authority and be considered overstepping.",
    "Speaking of Bezos: His new superyacht is so large that an iconic Dutch bridge must be dismantled to allow it to pass through.",
    "Republicans vowed to override her veto, but it’s unclear whether they have enough votes, writes the KC Star’s Katie Bernard.",
    "She’s tapped two allies — Reps. VERONICA ESCOBAR (D-Texas) and DAVID SCOTT (D-Ga.) — to help make calls on her behalf.",
    "But I honestly don’t think that these incredible women would be in the positions that they are if there was something.",
    "(Of course, they’ll need to boost their popularity among voters significantly to hold onto the chamber in November.)",
    "… former VP Dan Quayle … CNN’s Shimon Prokupecz … POLITICO’s Annie Rees … Nicolle Wallace (5-0) … L.A. Mayor/U.S.",
    "On the other hand, the conservative majority could take the opportunity to further weaken the Voting Rights Act.",
    "… Art Motta is now national director of policy and legislation at the League of United Latin American Citizens.",
    "… Sondra Goldschein is now the first executive director of the Campaign for a Family Friendly Economy.",
    "That’s not always been to the benefit of staff, who have few places to turn when they have problems.",
    "SUNDAY SO FAR …\nFOX “Fox News Sunday,” guest-anchored by Martha MacCallum: Sen. Ben Cardin (D-Md.)",
    "TRANSITIONS — Nate Adams will be campaign manager for Sen. Lisa Murkowski’s (R-Alaska) reelect.",
    "He most recently was a director at National Victory Action Fund, and is a Dan Sullivan alum.",
    "Rather, each office operates as its own mini-fiefdom, setting pay and employment standards.",
    "Some highlights:\n— Several of the judges on Biden’s SCOTUS short list were also on Obama’s.",
    "… [T]hey are loath to antagonize Trump and possibly drive off his hard-core followers.",
    "Mark Zuckerberg’s net worth dropped by $29 billion Thursday as Meta’s stock fell 26%.",
    "NBC “Meet the Press”: Panel: Al Cardenas, Helene Cooper, Jeh Johnson and Amy Walter.",
    "BIDEN’S FRIDAY:\n— 9:30 a.m.: The president will receive the President’s Daily Brief.",
    "and ADAM KINZINGER (R-Ill.), who serve on the House committee investigating Jan. 6.",
    "McDaniel also declined to say whether she would campaign personally against Cheney.",
    "One note to Hill staffers with a story: You can always call us here at Playbook.",
    "(Anthony Adragna and Katherine Tully-McManus have more on Congress Minutes.)",
    "Panel: Laura Barrón-López, Tamara Keith, Jeremy Diamond and Meridith McGraw.",
    "CBS “Face the Nation”: Sen. Marco Rubio (R-Fla.) … retired Lt. Gen. H.R.",
    "MSNBC “The Sunday Show”: Steve Schmidt … Rep. Katherine Clark (D-Mass.)",
    "He most recently was policy adviser for Rep. Eric Swalwell (D-Calif.).",
    "They wouldn’t be chosen again — or [were] unlikely to be chosen again.",
    "… Be able to tell their life story, know what the vulnerabilities are.",
    "— 10:45 a.m.: Biden will deliver remarks on the January jobs report.",
    "Build a plan that inoculates against those vulnerabilities quickly.",
    "Gray TV “Full Court Press”: Sen. Mark Warner (D-Va.) … Jon Decker.",
    "Panel: Jonathan Karl, Mary Bruce, Susan Glasser and Jane Coaston.",
    "Jeff Bezos gained $20 billion in personal valuation the same day.",
    "She previously was senior adviser to Sen. Chris Murphy (D-Conn.).",
    "“We just unionized at the DCCC, and I supported that,” she said.",
    "…\n… Kaylie Hanson is now chief comms officer for Michigan Gov.",
    "Monica Lewinsky wrote about the joy of Wordle for Vanity Fair.",
    "A unionization push on Capitol Hill would be quite something.",
    "This morning, our Sarah Ferris and Nicholas Wu have the dish.",
    "She most recently was executive director of Long Live Go Go.",
    "I will never stop fighting for our constitutional republic.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "THE HOUSE will meet at 9 a.m., with last votes at 3 p.m.",
    "Stay tuned, because this conversation is just starting.",
    "Biden recoils at being lobbied through the television.",
    "They can … continue their racist dog whistles on this.",
    "Panel: Juan Williams, Gillian Turner and Josh Holmes.",
    "(Schumer later corrected the record and apologized.)",
    "… Kelsye Adams is now a program director at DC Vote.",
    "Send Playbookers tips to playbook@politico.com.",
    "… Alphonso David … Jazz Lewis … Clarence Jones.",
    "ABC “This Week”: Rep. Michael McCaul (R-Texas).",
    "CNN “Inside Politics”: Leana Wen.",
    "That’s what keeps me up at night.",
    "Labor costs and housing costs.",
    "… Sen. John Barrasso (R-Wyo.)",
    "Thanks for reading Playbook.",
    "We’ll protect your identity.",
    "History will be their judge.",
    "McMaster … Scott Gottlieb.",
    "And these are real stars.",
    "— Democratic Kansas Gov.",
    "They’re the future.",
    "THE SENATE is out.",
    "(Which one’s Rose?",
    "Gretchen Whitmer.",
    "— New York Gov.",
    "), for a job.",
    "Sign up here.",
    "… Neil Sean.",
    "Blanche?)"
  ]
}