{
  "id": 2784,
  "mediaId": 2664,
  "date": "2022-02-03",
  "headline": "Trump convinces Ohio GOP Senate hopeful to drop out because there are already 'too many Trump candidates'",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29233832&width=1200&coordinates=0%2C0%2C0%2C55&height=600",
  "link": "https://www.rawstory.com/ohio-republican-senate-primary-2656550467/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    2694,
    2290,
    4306,
    2765,
    1489,
    1126,
    976,
    6474
  ],
  "sentences": [
    "Although Pukita has had trouble garnering the same level of press attention, he has tried to pull his weight by running ads that slam Mandel for talking up the importance of maintaining Christian supremacy in the United States despite the fact that he's Jewish.",
    "Mandel, for instance, has claimed that there should be no separation between church and state, while Vance has made jokes about a tragic movie-set shooting and has also touted the support of conspiracy theorist Rep. Marjorie Taylor Greene (R-GA).",
    "The race so far has seen the candidates all try to outflank one another in their fealty to the twice-impeached one-term president, and they have all made increasingly extreme statements to garner the support of loyal Trump supporters.",
    "NBC News' Henry Gomez reports that one-time Senate candidate Bernie Moreno has dropped out of the race -- and he says that a conversation with former President Donald Trump convinced him to end his campaign.",
    "\"After talking to President Trump we both agreed this race has too many Trump candidates and could cost the MAGA movement a conservative seat,\" Moreno said.",
    "Moreno's exit still leaves three hardcore pro-Trump candidates who have all been feverishly vying for his support: Josh Mandel, J.D.",
    "I will focus my efforts on supporting the candidate that wins President Trump’s endorsement.\"",
    "\"Therefore, today I am ending my U.S. Senate campaign and will return to the private sector.",
    "The crowded Ohio Republican Senate primary now has one less challenger.",
    "Vance, and Mark Pukita.",
    "Stories Chosen For You"
  ]
}