{
  "id": 2814,
  "mediaId": 2590,
  "date": "2022-01-29",
  "headline": "Cincinnati Rally With Marjorie Taylor Greene Booted After Reported Flood Of Complaints",
  "image": "https://img.huffingtonpost.com/asset/61f5d35b270000c109456f6b.jpeg?cache=xyGC67NFqt&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/rally-booted-marjorie-taylor-greene-jd-vance-complaints-cincinnati_n_61f5cc4de4b067cbfa1de0ed",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Papenfuss",
  "authorUrl": "",
  "termIds": [
    4306,
    980,
    1320,
    6060,
    6175,
    6333
  ],
  "sentences": [
    "We didn’t know there would be a guest.”\nThe Landing Event Center posted a politically neutral statement on Facebook, announcing the relocation of the event “due to tremendous interest,” and adding: “We appreciate everyone’s interest and concerns.” Taylor explained to the Enquirer: “It doesn’t matter what we do; we have both sides upset.”\nVance’s campaign claimed in a statement to the newspaper that the event was moved to the Cincinnati Marriott Northeast in Mason due to a large number of RSVPs.",
    "@imaginemason @madechamber @CinciMarriottNE @Marriott @GregLandsman @TimRyan @mh4oh @OPSU_PAC @WarrenCoDemsOH @nanwhaley @DavidPepperhttps://t.co/RTai87r3OU\n— Mason-Deerfield Twp Democrats Club (@masondfdems) January 29, 2022\nThe dust-up follows an awkward call-in show on a Georgia cable access station earlier this week when several people let Greene have it.",
    "pic.twitter.com/EJozpGrrGy\n— The Republican Accountability Project (@AccountableGOP) January 27, 2022\nAs for Vance, he has pulled off a transformation, morphing into an avid supporter of Trump, whom he once bashed as “noxious,” “reprehensible” and an “idiot.”",
    "A Cincinnati-area venue has booted a scheduled rally featuring far-right Rep. Marjorie Taylor Greene (R-Ga.) following a surge of complaints, The Cincinnati Enquirer reported Saturday.",
    "Advertisement\nBut the event was ejected from the Landing Event Center in suburban Loveland, Ohio, after a storm of complaints, venue general manager Jodi Taylor told the newspaper.",
    "pic.twitter.com/oLDU3Ej34n\n— Right Wing Watch (@RightWingWatch) January 26, 2022\nMTG gets dressed down by one of her constituents.",
    "Greene was promoted as a “special guest” at a gathering Sunday with Ohio Senate candidate and “Hillbilly Elegy” author J.D.",
    "Please help by sending a message that Greene & Vance’s racism, bigotry, hatred, and division have no place here in Mason!",
    "The controversial lawmaker has endorsed Vance in his bid for the Republican nomination to replace retiring GOP Sen.",
    "Taylor said she had no idea the event would include Greene — and Vance was instructed to find another location.",
    "One participant called Greene an “embarrassment to the state of Georgia” — and that was just the start.",
    "“We just chose to respect it was a very emotional topic,” Taylor told the Enquirer.",
    "Advertisement\nGreene foes are now organizing against the event in Mason.",
    "We were wrapping our heads around what was going on.",
    "“People are passionate about what they believe.",
    "Not all heroes wear capes.",
    "Very cathartic.",
    "Rob Portman.",
    "Vance."
  ]
}