{
  "id": 3326,
  "mediaId": 157,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Another extreme wing of the Republican Party is emerging  and it's not all Trump",
  "image": "https://www.rawstory.com/media-library/new-jersey-road-project-that-enraged-trump-supporters-has-been-completed-ahead-of-schedule.jpg?id=27666031&width=1200&coordinates=0%2C81%2C0%2C82&height=600",
  "link": "https://www.rawstory.com/another-extreme-wing-of-the-republican-party-is-emerging-and-it-s-not-all-trump/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1729,
    1801,
    1990,
    2303,
    2435,
    3102,
    3103,
    4068,
    4233,
    428,
    571,
    2862
  ],
  "sentences": [
    "As the Inquirer wrote on May 4, he often invokes Esther, the biblical Jewish queen who saved her people from slaughter by Persians, casting himself and his followers as God's chosen people who have arrived at a crossroadsand who must now defend their country, their very lives.?\nIt is the season of Purim,? Mastriano said, according to the paper's report of a March [campaign] event in Lancaster, referring to the Jewish holiday celebrated in the Book of Esther.? The gubernatorial candidate continued, And God has turned the tables on the Democrats and those who stand against what is good in America.",
    "The Philadelphia Inquirer characterized his unbending religiosity as belonging to the charismatic strand of Christianity.? The New Yorker's Griswold concluded that Mastriano's rise embodies the spread of a movement centered on the belief that God intended America to be a Christian nation.?\nThis political type is not new, wrote Kevin Phillips, a former Republican strategist and historian, in 2006 in American Theocracy: The Peril and Politics of Radical Religion, Oil, and Borrowed Money in the 21st Century, which detailed how George W. Bush's evangelism tainted his presidency.",
    "Although he was leading in a crowded field, there are other candidates for governor who have been falsely proclaiming that Democrats stole their state's 2020 election and the presidency, and even forged Electoral College documents sent to Washington, D.C.\nIf you thought Donald Trump's endorsement of Dr. Mehmet Oz for Senate was the worst development in Pennsylvania's 2022 GOP primaries, wait until you hear about the Republicans running for governor,? wrote Amanda Carpenter, a political columnist for the Bulwark, an anti-Trump Republican news and opinion website.",
    "But the GOP's frontrunner for governor in Pennsylvania's crowded May 17 primary field, state Sen. Doug Mastriano, is an entirely different Republican: a man of deep religious and political convictions who, if he wins the nomination and the general election, could be problematic for Americans who do not want elected officials to impose their personal beliefs on the wider public, whether the topic is abortion, vaccines, denying election results, or calling on God's help to seize political power.",
    "Pennsylvania has been at the forefront of recent litigation over this power grab, the so-called independent state legislature doctrine.? If elected governor, Mastriano could hasten a constitutional crisis, because under the Electoral Count Act of 1887, which was designed to say how competing slates of presidential electors are to be resolved, the governornot the state legislaturehas the final say, according to Edward B. Foley, a widely respected election law scholar.",
    "Vance, the Ohioan who grew up poor, joined the Marines, got a Yale law degree, wrote a bestseller about his hardscrabble upbringing, became a venture capitalist, and panned Donald Trump before becoming a convert to Trumpism and winning Ohio's GOP primary for U.S. Senate, is one brand of 2022's Republican candidatesa shapeshifter, as the New York Times' conservative columnist Bret Stephens noted.",
    "He's just another example of an increasingly common type: the opportunistic, self-abasing, intellectually dishonest, morally situational former NeverTrumper who saw Trump for exactly what he was until he won and then traded principles and clarity for a shot at gaining power,? Stephens said in a conversation with New York Times liberal columnist Gail Collins that was published on May 9.",
    "The commercial's closing pitch: Is that what we want in Pennsylvania?'?\nThe answer, for far too many people in a state where the wife-cheating, private-part-grabbing xenophobe won by 44,292 votes in 2016, would, unfortunately, be yes.'?\nBut a Mastriano primary victory would be more than the latest affirmation of the ex-president's sway over swaths of today's GOP.",
    "Mastriano, Shapiro's new TV spot says, would effectively ban abortion in the Keystone State and, the narrator continues, he led the fight to audit the 2020 election,'? Bunch wrote on May 8. If Mastriano wins, it's a win for what Donald Trump stands for.' Cue the Satanic music, maybe the only clue that the Shapiro campaign thinks these are bad things.",
    "But under Trump, the enemies list has grown to include not just the media (Mastriano has barred reporters from rallies and abruptly ended interviews), but America's secular democracy? (as Kristin Kobes Du Mez, a professor of history at Calvin University and the author of Jesus and John Wayne, put it in Griswold's piece for the New Yorker).",
    "While sermons and rhetoric propounding American exceptionalism proclaim religiosity an asset, a sober array of historical precedentsthe pitfalls of imperial Christian overreach from Rome to Britaintip the scales toward liability.?\nThis article was produced by Voting Booth, a project of the Independent Media Institute.",
    "A key provision of the act says that if the [U.S.] House and Senate are split [on ratifying a state's Electoral College slate], the governor of the state in dispute becomes the tiebreaker,? Foley wrote in 2016, when scholars were gaming post-Election Day scenarios in Trump's race against Hillary Clinton.",
    "It remains to be seen if voters' allegiances will shift as May 17 approaches, especially as the Democrats' likely nominee, Pennsylvania Attorney General Josh Shapiro, has signaled that Mastriano is the Republican he would most like to run against in the general election by launching TV attack ads.",
    "Mastriano's prospects, and his chances in the upcoming general election in the fall as another breed of 2022's GOP mavericks, suggest that wider currents are roiling American politics, including, in this national battleground state, a mainstreaming of white Christian nativism.",
    "That authority could include rejecting the popular vote in presidential elections and appointing an Electoral College slate favoring the candidate backed by a legislative majority, which, in Pennsylvania, has been Republican since 2011's extreme gerrymander.",
    "But after 2020's election, he emerged from local ranks as an early and fervent member of Trump's Stop the Steal? cavalry who sought to subvert the certification of its winner, Pennsylvania native Joe Biden, who officially beat Trump by 80,000 votes.",
    "In the wake of the 2020 election, as Trump and his allies filed and lost more than 60 election challenge suits, one of their arguments was the U.S. Constitution decrees that state legislatures set the time, place and manner? of elections.",
    "A New Yorker profile by Eliza Griswold on May 9 characterizes Mastriano as a white Christian nationalista term he rejectswho, before the January 6 Capitol riot, exhorted his followers to do what George Washington asked us to do in 1775.",
    "With days to go before the primary, Josh Shapiro, the Democrats' likely nominee for governor (he is running unopposed in the party primary) is already running anti-Mastriano TV ads seeking to tie the Republican candidate to Trump.",
    "Shapiro's strategy to elevate Mastriano is dangerous,? according to Inquirer columnist Will Bunch, as it affirms Mastriano's credentials to voters and could backfire in the fallin a replay of Trump's 2016 victory in the state.",
    "Few questions will be more important to the 21st-century United States than whether renascent religion and its accompanying political hubris will be carried on the nation's books as an asset or as a liability,? Phillips wrote.",
    "He also has pledged to sign legislation to curtail voting with mailed-out ballots, which was how 2.6 million Pennsylvaniansabout 38 percent of voters, including nearly 600,000 Trump voterscast 2020's presidential ballots.",
    "Some message has always had to be preached, punched, or proselytized.?\nAdd in Mastriano's embrace of Trumpian authoritarianism, and the Keystone State's leading GOP candidate for governor is proudly part of this pantheon.",
    "He has reported for National Public Radio, Marketplace, and Christian Science Monitor Radio, as well as a wide range of progressive publications including Salon, AlterNet, the American Prospect, and many others.",
    "Mastriano is a retired Army military intelligence officer and Army War College historian (whose error-filled 2014 biography of a World War I heroic Christian soldier embarrassed its university press).",
    "It heralds the rise of radicalized religion,? as Phillips wrote in American Theocracy about fundamentalists and George W. Bush's presidency, merged with more recent Trumpian authoritarianism.",
    "But unlike Arizona's effort, led by the Cyber Ninjas' Doug Logan, another deeply observant but more private Christian, Mastriano is vocal about how much his religion influences his politics.",
    "After the 2020 election, 84 people in seven battleground states that Biden won, including Pennsylvania, sent lists of unauthorized Trump electors to the National Archives in Washington.",
    "However, Mastriano's ascension, coupled with a Trump-fortified U.S. Supreme Court that's poised to void a woman's right to abortion, affirms today's reemergence of a radical right.",
    "Christianity in the United States, especially Protestantism, has always had an evangelicalwhich is to say, missionaryand frequently a radical or combative streak,? wrote Phillips.",
    "(In 2018, less than one-fifth of Pennsylvania's voters turned outsuggesting that 2022's winner may be nominated by as little as 5 percent of its state electorate.)",
    "And, there's an excellent chance the nuttiest bunny of them all, Doug Mastriano, is going to win the primary.?\nBut Mastriano is not a mere Trump imitator.",
    "When it comes to election administration, if elected governor, Mastriano gets to appoint the secretary of state, the state's top election regulator.",
    "Or, if Pennsylvania's GOP were more firmly in control of its nomination process, Mastriano's support might pale next to the establishment's pick.",
    "On January 6, 2021, he bussed Trump supporters to the U.S. Capitol, and newly surfaced videos show that he followed them past police barriers.",
    "He opposed COVID-19 mandates, and in mid-2021 started calling for an Arizona-style audit? of the state's 2020 presidential election results.",
    "He is cut from an older, more gothic American political cloth: mixing a nativist piety, conspiratorial mindset, and authoritarian reflexes.",
    "Mastriano, if elected, could also play an outsized role should the presidency in 2024 hinge on Pennsylvania's 19 presidential electors.",
    "He could be an extremist, like Trump in 2016, who won because too many contenders split the mainstream vote in a low-turnout primary.",
    "This targeting includes the government civil servants who administer elections and the technology used to cast and count votes.",
    "Two of Mastriano's primary opponents, ex-congressman Lou Barletta and Charlie Gerow, signed the fake Electoral College slates.",
    "Steven Rosenfeld is the editor and chief correspondent of Voting Booth, a project of the Independent Media Institute.",
    "His career in elected office started in a predictable rightward fashion: proposing a bill to ban abortion.",
    "Centrist Republicans also are attacking Mastriano, but the Philadelphia Inquirer reports it's not working.",
    "Challengers worry about Madison Cawthorn and feel he'd be 'relieved' to lose\nStories Chosen For You",
    "Mastriano's current lead among nine candidates, with nearly 28 percent, could be taken two ways.",
    "Such a policy shift, if enacted, would deeply inconvenience, if not discourage, voter turnout.",
    "(As of May 10, nearly 900,000 voters had applied for a mailed-out ballot for 2022's primary.)",
    "Mastriano invited Big Lie propagandist Rudy Giuliani and others to legislative hearings.",
    "We need an intervention.'?\nOn the 2020 election denial front, Mastriano is not alone.",
    "In uniform, he served overseas in Eastern Europe, Kuwait, Iraq, and Afghanistan.",
    "The only thing differentiating them is how far down the rabbit hole they go.",
    "While speculating about 2024 is premature, there's some precedent to heed.",
    "Tom Wolf, a Democrat, faces term limits and cannot seek reelection.)",
    "It's hardly new for Republicans to demonize Democrats.",
    "They're all election conspiracists.? she continued.",
    "This article was paid for by Raw Story subscribers.",
    "Prefer to give a one-time tip?",
    "Try us and go ad-free for $1.",
    "Mastriano, however, did not.",
    "It's true.?\nA Heavy Hand?",
    "Appeal to Heaven.",
    "Not a subscriber?",
    "(Incumbent Gov.",
    "Pray to God.",
    "Click here.",
    "A Gov.",
    "J.D."
  ]
}