{
  "id": 3350,
  "mediaId": 129,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Buffalo Shooting Live Updates: Biden Arrives in City to Mourn Shooting Victims",
  "image": "https://static01.nyt.com/images/2019/12/13/reader-center/author-zolan-kanno-youngs/author-zolan-kanno-youngs-thumbLarge.png",
  "link": "https://www.nytimes.com/live/2022/05/17/nyregion/buffalo-shooting",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    1325,
    1341,
    2087,
    3094,
    3103,
    4153,
    2959,
    4938
  ],
  "sentences": [
    "In remarks on his show on Monday night, Mr. Carlson denied responsibility for the Buffalo suspect and distanced himself from his rhetoric, dismissing the document as a rambling pastiche of slogans and internet memes.?\nWASHINGTON  President Biden will travel to Buffalo on Tuesday to denounce the racist massacre in a predominantly Black neighborhood as terrorism motivated by a hateful and perverse ideology,? according to a White House official, who said Mr. Biden would also call for stricter gun control measures.",
    "They hope to import an entirely new electorate and they call you a racist and a bigot.?\nPolitical scientists and historians say the harsher, more dehumanizing language stirring fear of demographic change has became more pervasive and salient among Republican voters as pro-business Republicans who were once vocally in favor of immigration have become fewer among their ranks and Republican leaders have declined to push back against the more extreme political language.",
    "2 Senate Republican, said on Monday that it's unfortunate that there are sites out there where these people go and get these crazy ideas in their head and act on it.? When asked about his colleagues who have repeated elements of replacement theory, he added: Nobody should be giving voice to or support in any way to some of these things.?\nReporting was contributed by Azi Paybarah, Karen Yourish, Jennifer Medina, Jazmine Ulloa and Charles Homans.",
    "It would be wrong to act otherwise.?\nKarine Jean-Pierre, the White House press secretary, said Mr. Biden would call out domestic terrorism during his visit to Buffalo, even if the trip will be focused on comforting the families of the 10 people whose lives were so senselessly taken in this horrific shooting.?\nBut Ms. Jean-Pierre stopped short of identifying by name Mr. Carlson or other members of Congress who have espoused the fringe views.",
    "The reality in this country right now, is that anyone who wants to cause harm to themselves, or do someone else harm, can easily acquire the means to do so  legally,? said Fred Guttenberg, whose 14-year-old daughter, Jaime, was killed in the school shooting in Parkland, Fla., in 2018.\nBased on what we know about Buffalo, the system seems to have been followed, but the problem is with the system itself,? he added.",
    "Republican leaders like Representative Elise Stefanik of New York and Fox News hosts like Tucker Carlson have employed the kind of provocative language that encourages racial resentment and served to inject fringe ideas like replacement theory  the idea that Western elites, sometimes manipulated by Jews, want to replace and disempower white Americans  into the mainstream on the political right.",
    "Is it really,? he postulated, they want to remake the demographics of America to insure their  that they stay in power forever?? (On Monday evening, he tweeted: Pushing the lie that criticizing this admin's policies in any way supports replacement theory' is another example of the corporate media working overtime to cover up the Biden admin's failures.?)\nAnd in Ohio, the Senate candidate J.D.",
    "Whenever Mr. Biden does speak out more assertively about divisive politics, such as on the anniversary of the Jan. 6 attack on the Capitol, he finds himself accused of violating his own promise to bring harmony to the country, leaving him in something of a political box, trapped by his desire to be a unifier while feeling compelled to take on the forces rending the country apart.",
    "The president will be confronting the violent white extremism displayed when neo-Nazis and right-wing militias marched into Charlottesville, Va., a moment Mr. Biden has often said drove him to run for president to undertake a battle for the soul of America.?\nBut the challenge for a president who came to office preaching unity may be how to take on those preaching hate.",
    "The Biden administration last June unveiled a national strategy to combat violent extremism, calling for additional hiring of intelligence analysts, improving collaboration with social media companies to take down violent videos and increased funding for digital literacy programs to train the public to identify hateful content and resist recruitment by extremists.",
    "The biggest threat to gun control looms just over the horizon: Over the next month or two, the Supreme Court is expected to strike down all or part of a New York State law that curtails the concealed possession of a gun without a special permit, a case seen as a potential landmark decision that could invalidate dozens of similar laws in liberal-leaning states.",
    "Many of those dark voices still exist today, and the president is determined as he was back then and he is determined today to make sure that we fight back against those forces of hate and evil and violence.?\nMr. Biden and the first lady, Jill Biden, will also visit the Tops market memorial to pay respects to victims of the mass shooting, the official said.",
    "Mr. Schumer cited a recent Times investigation showing that Mr. Carlson has for years used his show to relentlessly promote replacement,? which is the belief, rooted in racist conspiracy theories, that an elite cabal is seeking to replace native-born populations in the United States and Europe with immigrants from Africa, the Middle East and Latin America.",
    "The president and the first lady, Jill Biden, visited the Tops Friendly Market where Payton S. Gendron, 18, is accused of opening fire on Saturday, days after posting a racist screed littered with anti-Black and white supremacist sentiments, including mentions of replacement theory, a right-wing ideology that posits a plan to replace? white people.",
    "Later in the spot, he spoke about how loose border policies were there to ensure more Democrat voters pouring into this country.?\nThis strategy reclaiming the racist label  and recasting oneself as the victim  has also been used by Blake Masters, a Senate candidate in Arizona, who is backed by the same billionaire, Peter Thiel, as Mr. Vance.",
    "In February, when Representatives Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona participated in a conference organized by Nick Fuentes, a white supremacist, Representative Kevin McCarthy, Republican of California and the minority leader, called their actions appalling and wrong,? but he did not formally rebuke or punish them.",
    "The reality of life in America, the big problem, is that these people don't have to jump through enough hurdles to get a gun.?\nThe Biden administration renewed its calls to ban semiautomatic weapons and expand national background checks in the wake of the attack in Buffalo on Saturday, as it has done time and again after mass shootings.",
    "Senator Chuck Schumer, Democrat of New York and the majority leader, urged Fox News owner Rupert Murdoch and the network's top executives in a letter on Tuesday to immediately cease the reckless amplification of the so-called Great Replacement' theory on your network's broadcasts? in the wake of a deadly racist rampage in Buffalo.",
    "While aides made clear that Mr. Biden would denounce the white supremacy and hate speech that appeared to animate the man who opened fire on mostly Black grocery store shoppers last weekend, killing 10 people, it remained unclear how directly the president would link such violence to the political statements of his opponents.",
    "Last year, far-right Republican members of Congress circulated plans to create an America First Caucus,? where the section on immigration talked about the importance of uniquely Anglo-Saxon political traditions.? The idea was scrapped but those involved continued to make waves for their flirtation with white nationalism.",
    "Last year, in the wake of the Jan. 6 riot at the Capitol, the NAACP took aim at the Murdochs' valuable football broadcasting business, urging the National Football League to consider Fox News' criticism of Black players protesting for civil rights when negotiating for broadcast rights with the Murdoch-owned Fox Sports.",
    "The legal bar is high.?\nThe 19-year-old attacker who killed Jaime Guttenberg and 16 others in Parkland bought his Smith & Wesson M&P15, another AR-15 clone, from a licensed dealer after passing an instant background check, even though school officials warned local law enforcement he had made violent, racist threats.",
    "The Trump administration slashed funding for grants issued to nonprofits and law enforcement agencies that focus on domestic terrorism, cutting a budget in the Homeland Security Department from $20 million during the Obama administration to less than $3 million before much of the funding was restored in 2020.",
    "A 180-page document posted online by the accused Buffalo killer is laden with racist images and references the most extreme versions of replacement theory, holding that not only immigrants but also Black Americans are replacers? seeking to drive white people out from their rightful place in the United States.",
    "In upstate New York a few months ago, the 18-year-old suspect in the Buffalo shooting walked into Vintage Firearms in sleepy Endicott, passed an instant background check without a glitch and bought a used Bushmaster XM-15 semiautomatic rifle, a copy of the ubiquitous AR-15 used in many other mass shootings.",
    "From 1966 to 2019, 77 percent of mass shooters obtained the weapons they used in their crimes through legal purchases, according to a comprehensive survey of law enforcement data, academic papers and news accounts compiled by the National Institute of Justice, the research wing of the Justice Department.",
    "Mr. Biden said he thought Ms. Napolitano was prescient in talking about right-wing extremism and violence in America and motivated by white supremacists.?\nBut the United States has at times struggled to directly acknowledge, let alone develop an effective response to, the threat of domestic extremism.",
    "The massacre at the grocery store on Saturday trained a harsh light on the great replacement theory,? which the authorities say he used to justify an act of racist violence  and on how that theory has migrated from the far-right fringes of American discourse toward the center of Republican politics.",
    "3 House Republican, ran an online ad last fall about how amnesty? to the undocumented would overthrow our current electorate.?\nHer office put out a statement on Monday accusing the news media of disgraceful, dishonest and dangerous? smears in linking her rhetoric to the Buffalo attack in any way.",
    "While mass shootings, defined by many experts as episodes involving four or more fatalities, represent a relatively small percentage of overall gun crimes, they have risen drastically in recent years, with at least eight of the 20 deadliest mass shootings in U.S. history taking place since 2014.",
    "In Missouri, Attorney General Eric Schmitt, a Senate candidate, said on Glenn Beck's program last month that Democrats were fundamentally trying to change this country through their illegal immigration policy.?\nOther Republicans have been more specific, suggesting Democrats have political aims.",
    "WASHINGTON  Of all the wrenching similarities between the massacres at Marjory Stoneman Douglas High School in Parkland, the Tree of Life synagogue in Pittsburgh, the Walmart in El Paso and the Tops supermarket in Buffalo, one stands out most starkly: Each gun used was purchased legally.",
    "One by one, Republican-controlled state legislatures have enacted laws to undo existing gun regulations that place restrictions on the purchase and carrying of firearms, while some states, like Missouri, are challenging the federal government's right to impose any regulation on firearms.",
    "Family members of one of the dead, 86-year-old Ruth Whitfield, spoke publicly about the pain they have endured and their outrage that the suspect, who had been held for a mental-health evaluation last year after making threatening remarks at his high school, was able to obtain a weapon.",
    "I think the bully pulpit is the president's strongest role.?\nSenator Chuck Schumer, Democrat of New York and the majority leader, directly called out hard-right Republicans and Mr. Carlson for amplifying themes that are at the heart of the white supremacist replacement theory.",
    "The suspect, Payton Gendron, had recently been required to undergo psychological evaluation after making menacing, violent comments to high school classmates, but the episode was not enough to set off the state's red flag? law, which bars the mentally ill from buying weapons.",
    "That a majority of these criminals have made their gateway purchases though legal means reflects the profound inadequacy of local, state and federal statutes to detect or deter mass shooters, say law enforcement officials, researchers and the families of people they killed.",
    "BUFFALO  With investigators digging through new details of a gunman's preparations, President Biden arrived in Buffalo on Tuesday morning to pay his respects and speak to a largely Black community still reeling from a mass shooting at a supermarket that left 10 people dead.",
    "According to authorities and statements made in his online writings, he chose the East Buffalo neighborhood specifically because of the many Black residents who live there, going so far as to scout the location at least twice, in early March and the day before the shooting.",
    "These conspiracies are at the core of the Republican Party right now and I don't think it's partisan to say that,? said Amy Spitalnick, the executive director of Integrity First for America, which won a lawsuit against the organizers of the 2017 Charlottesville rally.",
    "Resentment and anger can get you short-term victories but it won't build a governing coalition to build long-term policy change.?\nMainstream Republicans have repeatedly suggested that lax enforcement of the border is somehow part of a longer-term Democratic strategy.",
    "Mr. Biden, who has decried the accused gunman's actions as a racially motivated hate crime,? is also expected to meet privately with victims' families and emergency medical workers and make public remarks at a community center before returning to Washington.",
    "In a conversation in 2019 with Janet Napolitano, a former homeland security secretary, Mr. Biden recalled the Obama administration's decision in 2009 to rescind a report warning that U.S. military veterans were vulnerable to recruitment by extremist groups.",
    "And many of those accused of these crimes, like the suspect in the Buffalo shooting, see their killings as public performance, making them inclined to stealthily plan their attacks until they take action, in hopes of maximizing the attention paid to them.",
    "On Monday, a new cache of online postings believed to be written by Mr. Gendron were found, suggesting months of preparation and practice for the massacre, as well as an account of how he evaded a state law that could have prevented him from owning a gun.",
    "Mr. Camus chiefly argued that demographic shifts in majority white, Christian countries in Europe threaten ethnic and civilizational substitution.?\nBy 2017, white supremacist groups embraced Mr. Camus' ideas, employing antisemitic conspiracy theories.",
    "They adopted a new slogan  alternately Jews will not replace us? or You will not replace us?  chanted at rallies, most infamously at the Unite the Right rally in Charlottesville, Va., that August, where a white nationalist killed a counterprotester.",
    "Now, much of the Republican Party and the conservative media apparatus are speaking with the same nationalistic voice, from Tucker Carlson on Fox News in prime time to even more hard-right alternatives like Newsmax and One America News Network.",
    "Last year, Mr. Biden called gun violence in the United States an international embarrassment? and took some steps to address the problem, starting with a crackdown on the proliferation of so-called ghost guns, or firearms assembled from kits.",
    "As a senator, Mr. Biden helped pass a 10-year assault weapons ban in the 1990s and as vice president he helped develop a reform package after the massacre of 26 children and adults at Sandy Hook Elementary School in Newtown, Conn., in 2012.",
    "However, this pernicious theory, which has no basis in fact, has been injected into the mainstream thanks in large part to a dangerous level of amplification by your network and its anchors.?\nThe Murdochs have staunchly backed Mr. Carlson.",
    "The shooting was an act of evil,? said her spokesman, Alex DeGrasse, who added in a statement about illegals? that she has never advocated for any racist position or made a racist statement.?\nSenator John Thune of South Dakota, the No.",
    "T. Christian Heyne, the vice president of the gun control group Brady, said the only way to stop mass killings was to enact strengthened universal federal background checks, to compensate for the wide variation in state and local laws.",
    "But the gun lobby's hold on the Republican Party is unshaken and action on key gun issues, such as universal background checks and a ban on assault weapons, remains stalled in part because of the narrow partisan divide in the Senate.",
    "Biden has.?\nBut she said even with the president's willingness to describe the threat of deadly white supremacy, the federal government has not made enough progress in working with the authorities to prevent violent extremism.",
    "Transgender sports: toast.?\nRepublicans have pushed back aggressively against accusations that their language and actions have perpetuated the kind of racism and xenophobia that appeared to be behind the massacre in Buffalo.",
    "While White House officials have taken some executive actions  such as nominating a permanent director to lead the Bureau of Alcohol, Tobacco, Firearms and Explosives  their legislative efforts have little chance of success.",
    "Democrats and liberal groups have sought for years to pressure Fox News, urging cable providers  whose fees provide much of the network's revenue  to take action and pressuring advertisers to disassociate themselves from it.",
    "In a lot of cases, you can't really stop people from buying a gun, unless they are disqualified because they have committed a felony, or because they have been involuntary committed to a mental hospital,? Mr. Densley added.",
    "Mr. Biden, while denouncing domestic extremism, has mostly shied away from a sustained effort to tie it to leading conservatives despite pressure from some on the progressive left to offer a more full-throated condemnation.",
    "The letter, which followed remarks Mr. Schumer gave on the Senate floor Monday, may signal a new effort by Democrats and others to raise pressure on the cable network and its top-rated host and moneymaker, Tucker Carlson.",
    "The infuriating part is that we seem to be going backward,? said James Densley, a co-founder of the Violence Project, a nonpartisan research center that compiled the data used in the National Institute of Justice report.",
    "The poll also found that people who mostly watched right-wing media outlets like Fox News, One America News Network and Newsmax were more likely to believe in replacement theory than those who watched CNN or MSNBC.",
    "But Mr. Schumer criticized Fox and Mr. Carlson for promoting related ideas about Democrats and immigration policy, which he said had helped to popularize replacement ideology among a broader swath of Americans.",
    "Ms. Napolitano, who serves on Mr. Biden's intelligence advisory board, said it was clear the United States had not made enough progress in preventing extremist attacks since the deadly Charlottesville riots.",
    "This is replacement theory in a nutshell.?\nHe is expected to travel to Buffalo on Tuesday with the president and the first lady to meet with the families of the victims, law enforcement and local officials.",
    "Marc Morial, the president of the National Urban League, a civil rights organization, said truly uniting the country required directly calling out those amplifying theories influencing domestic extremism.",
    "About one in three American adults now believe that an effort is under way to replace native-born Americans with immigrants for electoral gains,? according to an Associated Press poll released this month.",
    "They are trying to destroy our country.?\nUnfortunately, the party is becoming one of resentment and anger as opposed to solutions and common ground,? said Mike DuHaime, a longtime Republican strategist.",
    "Mr. Gendron, who was been charged with first-degree murder and pleaded not guilty, is believed to have traveled to the scene of the shooting from his home in Conklin, N.Y., some 200 miles from Buffalo.",
    "If you connect the dots as a candidate for office and say, look, obviously the Democrats, they hope to just change the demographics of our country,? Mr. Masters said in a podcast interview last month.",
    "A quarter-century earlier, Pat Buchanan fashioned himself as an America first? candidate in his right-wing challenge to former President George Bush in 1992, a tagline that Mr. Trump would repurpose.",
    "Are we really this desensitized??\nRobert Donald, the owner of the store in Endicott who sold Mr. Gendron his gun, was stunned when federal law enforcement officials contacted him about the purchase.",
    "About half of it is devoted to a matter-of-fact discussion of the ideal gear  guns, ammunition, pistol grips, body armor, helmets  to buy, online or at flea markets, when planning a mass shooting.",
    "But Mr. Buchanan, who lost the Republican presidential nomination in 1992 and again in 1996, was largely shunned by his party for writing about immigrant invasions? eroding Western society.",
    "But fewer party leaders appeared willing to break with the politics of nativism and fear the party has embraced to retain the loyalties of right-wing voters inspired by Donald J. Trump.",
    "But the official also acknowledged the difficulty of policing extremist language on online platforms or amplified by commentators while the government is abiding by the First Amendment.",
    "But he told The New York Times on Sunday that any gun can be easily modified if you really want to do it,? when asked about the illegal modifications Mr. Gendron made to the Bushmaster.",
    "If he strays anywhere beyond thoughts and prayers, predictably people will scream that he's politicizing this,? said Michael Waldman, who was a speechwriter for President Bill Clinton.",
    "In another, Ms. Ivey held up her conservative state as a bastion of disappearing values: When I taught school, we said a prayer, pledged allegiance, and taught the basics,? she said.",
    "At a rally in western Pennsylvania this month, he railed against the illegal aliens? he said were pouring into our homeland.?\nOur country is full, we can't take it anymore,? he said.",
    "In Wisconsin, Senator Ron Johnson, who is up for re-election this fall, said last year that you have to ask yourself why? the Biden administration wanted, as he put it, open borders.",
    "You have to know who your enemy is and the threat is,? said Elizabeth Neumann, the assistant homeland security secretary for counterterrorism and threat prevention under Mr. Trump.",
    "Mr. Biden has taken steps to focus government resources on preventing domestic extremist attacks after the country spent decades prioritizing the threat of foreign terrorism.",
    "That modification allowed him to load multiple 30-round magazines, making it easier for him to hunt, target and kill Black people, according to a manifesto he posted online.",
    "Thirteen people were shot Saturday, almost all of them Black, with fatalities including several elderly shoppers and a security guard who exchanged gunfire with Mr. Gendron.",
    "They will then meet with law enforcement officials and relatives of the victims before the president delivers a speech that will call out the racist violence? on Saturday.",
    "Some White House officials also sought to suppress the phrase domestic terrorism? as President Donald J. Trump's Justice Department shifted federal prosecutors and F.B.I.",
    "@GOP leaders must renounce and reject these views and those who hold them.?\nHouse Republican leaders have at times tolerated the extremist views from some in their ranks.",
    "Lachlan Murdoch, Mr. Murdoch's son, last year personally defended Mr. Carlson when a civil rights group called for the host to be fired for espousing replacement theory.",
    "The great replacement theory has its origins in France, where it was popularized by a book of the same title published in 2012 by the novelist and critic Renaud Camus.",
    "More than a dozen candidates and outside groups have run ads warning of an immigrant invasion? in the country or otherwise diluting the power of native-born citizens.",
    "White supremacists who committed mass killings in Christchurch, New Zealand, and El Paso, Tex., in 2019 both referred to the theory in their respective manifestoes.",
    "He ordered his AK-47 clone online, from Romania, and later picked up the gun and ammunition at a Dallas-area gun shop after passing the requisite background checks.",
    "The 21-year-old man who murdered more than 20 people at a Walmart in El Paso in 2019 targeted Latinos and espoused many of the same racist theories as Mr. Gendron.",
    "Ahead of November's midterm elections, Republican candidates have ramped up warnings about the threats being posed to what is cast as real or traditional America.",
    "For years, these types of beliefs have existed at the fringes of American life,? Mr. Schumer wrote in his letter, which was also copied to Mr. Carlson personally.",
    "While it is hard to make broad generalizations, Mr. Densley and his partner, Jillian Peterson, discerned several patterns among gunmen in recent mass shootings.",
    "Then he went home, borrowed his father's electric drill, and removed a restraining bolt, required by state law, that limited its capacity to a 10-round clip.",
    "One Republican, Representative Liz Cheney of Wyoming, on Monday called out her colleagues for not doing enough to squash the extremist wing of her own party.",
    "You don't unite people for the sake of being united.?\nThe mass shooting in Buffalo was the work of a lone gunman but not the product of an isolated ideology.",
    "These hard-right MAGA Republicans argue that people of color and minority communities are somehow posing a threat  a threat  to the American way of life.",
    "Mr. Trump opened his 2016 presidential campaign by calling Mexican immigrants rapists and soon after he promoted a ban on Muslims entering the country.",
    "issued three times as many domestic terrorism assessments for local authorities in 2021 as it did the previous year, according to a senior official.",
    "Issue after issue has been recast as a reason for Republican voters to fear for their culture and values: Transgender rights threaten girls sports.",
    "Semiautomatic rifles account for fewer than 1 percent of overall shootings in the United States, they found  but 25 percent of mass shootings.",
    "Representative Elise Stefanik of New York, who represents a district in Northern New York and who replaced Ms. Cheney last year as the No.",
    "If they are underage or young adults, they often obtain guns as gifts from the parents  or borrow or steal weapons from their house.",
    "The bloodshed is certain to renew the national debate over gun control, which is a prime example of Washington's paralyzed politics.",
    "Critical race theory is portrayed as rewriting American history  and overhauling how it is taught  to emphasize episodes of racism.",
    "For his part, Mr. Gendron boasted of his handiwork, complete with painstakingly composed how-to pictures, in his online manifesto.",
    "Even the recent baby formula shortage has been falsely reimagined as so acute because of giveaways to feed undocumented children.",
    "Watching what happened in Charlottesville was a major factor in the president deciding to run,? Ms. Jean-Pierre said on Monday.",
    "Several candidates have falsely said that Democrats are opening the border specifically to let undocumented people in to vote.",
    "Since then, Republicans have used rhetoric that suggests a tacit willingness to try to appeal to elements of the far right.",
    "The removal of statues threatens to expunge Confederate history in the South and other white historical figures elsewhere.",
    "The antisemitic extremist who killed 11 Jews at the Tree of Life synagogue in 2018 also legally bought the weapon he used.",
    "We stand here wondering why,? said Garnell Whitfield Jr., a former Buffalo fire commissioner, at a local church on Monday.",
    "He did not predict it would hamper Republicans in elections this year but said it would pose a challenge eventually.",
    "House GOP leadership has enabled white nationalism, white supremacy, and anti-Semitism,? Ms. Cheney, the former No.",
    "If Joe Biden keeps shipping illegal immigrants into our states, we're all going to have to learn Spanish,? Gov.",
    "Treat it almost like a disease instead of crime so we can better diagnose ahead of time,? Ms. Napolitano said.",
    "The Obama administration issued nearly two dozen modest executive actions but failed to pass legislation.",
    "Often unsaid is what that bygone era looks like: white, male-dominated, Judeo-Christian and heterosexual.",
    "The stoking of fear and grievances was a hallmark of Mr. Trump's rise, though its roots far predate him.",
    "3 House Republican who was removed from that role over her criticism of Mr. Trump, wrote on Twitter.",
    "agents from investigations into violent white supremacists to cases involving rioters or anarchists.",
    "Mr. Trump no longer seems to be driving the conversation on the right so much as keeping up with it.",
    "He said nothing about the young man raised any suspicions; in fact, he hardly remembered him at all.",
    "The gunman wore body armor and used an assault-style rifle, according to law enforcement officials.",
    "He is also expected to call for stricter gun control measures, according to a White House official.",
    "That makes them harder to detect, even in a state with relatively strong gun laws, like New York.",
    "In a manifesto, the suspect detailed how he viewed Black people as replacers? of white Americans.",
    "A White House spokesman said on Monday that the issue remained a top priority for the president.",
    "We have just had a report showing gun violence is at historic levels, and now his happens.",
    "But that proposal has stalled in the Senate despite enjoying overwhelming public support.",
    "Kay Ivey, Republican of Alabama, said in one television ad ahead of her May 24 primary.",
    "Some people say when you do this you're promoting division,? Mr. Morial said.",
    "The Biden administration has also struggled to pass gun control legislation.",
    "There is no indication that the killer adopted his ideas from cable news.",
    "Do you hate Mexicans?? he asked in his campaign's opening television ad.",
    "At the state level, hopes for new gun control measures are even bleaker.",
    "Republicans across the spectrum were quick to denounce the killings.",
    "History has taught us that what begins with words ends in far worse.",
    "Biden's critical race theory: racist, wrong and dead as a doornail.",
    "Without a federal baseline, we can't achieve anything,? he said.",
    "At the time, many top party officials reacted with outrage.",
    "But it was a political crime, ugly political violence.",
    "But such claims amount to a diversion,? he added.",
    "Many have clean records and can buy guns legally.",
    "Vance pre-empted potential accusations of racism.",
    "What are we going to do about it as a country?",
    "Many favor long guns, like AR-15s and AK-47s.",
    "It doesn't matter if the red flags are there.",
    "Today, the left teaches kids to hate America.",
    "Trump was never willing to acknowledge that.",
    "You unite people around purpose,? he said.",
    "The subtext is clear,? Mr. Schumer said.",
    "About half of it is a racial screed.",
    "The document is 180 pages.",
    "Are you a racist?",
    "But not here.",
    "The F.B.I."
  ]
}