{
  "id": 36,
  "mediaId": 2590,
  "date": "2022-02-18",
  "headline": "Female GOP Candidate Says Her Male Rivals Are Trying To 'Overcompensate'",
  "image": "https://img.huffingtonpost.com/asset/62100b7e360000dc5324f385.jpeg?ops=1778_1000",
  "link": "https://www.huffpost.com/entry/jane-timken-ohio-senate_n_621004dae4b08ed7cf6fcae8",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    5581,
    2290,
    2576,
    4306,
    2765,
    1489,
    1126,
    976,
    6474
  ],
  "sentences": [
    "“I’m the MAGA conservative with a backbone.”\nAdvertisement\nHer opponents haven’t responded to her allegations about their “inadequacies.”\nTrump, whose favorite nickname for Rubio was “Little Marco,” said after the “small hands” remark that there was “no problem” down there.",
    "This week, Jane Timken, a Senate candidate in Ohio, did the same thing, implying that her GOP rivals have small penises - and that they’re trying to make up for it by running for office as phony Republicans, who say they love Trump but don’t walk the walk.",
    "Timken was Trump’s pick to run the Ohio Republican Party, but the former chairwoman hasn’t been able to score his endorsement for the Senate race, where candidates are falling over themselves to prove they’re the most like the former president.",
    "Advertisement\n“We all know guys who overcompensate for their inadequacies, and that description fits the guys in the Senate race to a T,” Timken says in a new ad, pointing to photos of Republicans Josh Mandel and J.D.",
    "Aaron Doster/Associated Press\nIn 2016, Sen. Marco Rubio (R-Fla.) mocked Donald Trump for having “small hands” and, unfortunately, everyone knew what he was getting at.",
    "Watch Timken’s ad here:\nWe all know guys who overcompensate for their inadequacies, and that description fits the guys in the Senate race to a T.\nI’m different.",
    "Timken is leaning into her position as the only woman on the GOP side in Ohio’s weird Senate contest.",
    "WATCH my new ad below: pic.twitter.com/EEzqaYToPa\n— Jane Timken (@JaneTimkenOH) February 18, 2022",
    "The ad pivots quickly from Timken alluding to her opponents’ manhood to a photo of her and Trump.",
    "Jane Timken is the only woman on the Republican side in Ohio's Senate race.",
    "She had a message for her GOP opponents about their \"inadequacies.\"",
    "I’m the MAGA conservative with a backbone.",
    "“I’m different,” Timken says in the ad.",
    "Her four main rivals are all men.",
    "Vance."
  ]
}