{
  "id": 3756,
  "mediaId": 8311,
  "date": "2022-01-24",
  "headline": "Republican Primary Candidates for U.S. Senate Speak to Ross GOP Women",
  "image": "https://i.iheart.com/v3/re/new_assets/61ee44e0c800591fb563ef28?ops=gravity(%22north%22),fit(740,416),quality(65)",
  "link": "https://easy1350.iheart.com/content/2022-01-24-republican-primary-candidates-for-us-senate-speak-to-ross-gop-women/",
  "mediaOutlet": "easy1350.iheart.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Dolan explained he would vote for the Infrastructure Bill in Congress because he would not want to stand before Ohioans and admit he didn't vote for funding going to Ohio jobs, and that is read properly, it will not raise the U.S. debt.",
    "Four Republican primary candidates for the U.S. Senate spoke at the this year's annual dinner of the Republican Women of Ross County.",
    "An Ohio Senator since 2017, Matt Dolan from Cleveland pointed out his experience and track record as a conservative Ohio legislator.",
    "Bernie Moreno is also a businessman, but focused on the fact that he was proud of being a childhood legal immigrant from Columbia.",
    "Gibbons joked that he could be only senator who could finish your driveway, after his experience in a college job.",
    "Vance was critical of Trump at first, but says he changed his mind like many Republicans after seeing his actions.",
    "He said he has visited the south border because he didn't want to talk about it without seeing it firsthand.",
    "Kevin Coleman asked each one the question they addressed to the audience: \"Why Should You Vote for Me.\"",
    "He says he is not a career politician, has spent his life in business, and understands economics.",
    "He said it was nothing like the civilized patriotic ceremony he worked hard to complete.",
    "As a businessman, Mike Gibbons describes himself as living the American dream.",
    "He has written a book, \"Hilbilly Elegy,\" a success a few years ago.",
    "He also flatly decries bipartisan corruption and bad decisions.",
    "They are seeking to fill the seat of term-limited Rob Portman.",
    "He compared the situation to the fictional \"Hunger Games.\"",
    "But he speaks mainly as a businessman.",
    "Vance has been portrayed as an author.",
    "Hear each interview below.",
    "J.D."
  ]
}