{
  "id": 3898,
  "mediaId": 2658,
  "date": "2022-01-24",
  "headline": "Army of millionaires fuel Senate primary spending spree",
  "image": "https://static.politico.com/bc/5a/64b4142d4afeabaf2ef05ecdad7f/election-2022-senate-ohio-07004.jpg",
  "link": "https://www.politico.com/news/2022/01/24/millionaires-flood-senate-cash-00000895",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Most of these candidates, depending on the state, probably think that if they get the nomination they’re very likely to win, or they’re going to be in a competitive race where they have a good chance to win.”\nAmong his firm’s clients this year are Jane Timken in Ohio, Carla Sands in Pennsylvania and Eric Schmitt in Missouri, all of whom are vying for the GOP nomination in open races marked by crowded primary fields.",
    "One of the outside groups unleashed by the ruling, Club for Growth Action, a campaign arm of the conservative organization focused on cutting taxes and government spending, has emerged as the top ad buyer across Senate races this cycle, spending $15.4 million so far on cable, broadcast, satellite and radio ads, according to AdImpact.",
    "The avalanche of spending comes against the backdrop of a key date in campaign finance history — Friday marked a dozen years since the Supreme Court’s Citizens United decision, a ruling that expanded the influence of special interest groups in politics by allowing them to spend unlimited amounts of money on elections.",
    "In neighboring Pennsylvania, a political strategist involved in the open Senate race anticipates $110 to $130 million in spending on TV advertisements in the Republican primary alone — nearly as much as both parties combined spent on ads during the state’s entire 2016 Senate election.",
    "“Going for broke in these nominations, in this election year, is the right decision to make,” said Terry Nelson, a Republican strategist and ad maker who noted that favorable political conditions for the GOP have attracted competitive fields of candidates across the country.",
    "This year, however, at least two Republicans in Ohio have already done so: Matt Dolan, a state senator and part owner of the Cleveland Guardians baseball team, has contributed $10.5 million to his campaign while Mike Gibbons has loaned himself $11.4 million.",
    "That may be why we are seeing so many wealthy candidates paying their own way in the primaries.”\nWith $24 million in Senate campaign advertisements already booked so far this cycle, Republicans in Ohio are currently leading the nation in ad spending.",
    "But it’s also a reflection of a map that features open seats in some of the most competitive states in the nation, and a glut of Republican self-funders who are digging deep into their own pockets to finance their campaigns.",
    "Noting that Trump proudly proclaimed during the 2016 primary that his wealth meant he wasn’t beholden to outside interests, Burns said, “Trump proved the point that self-funding does not have to be a political liability.",
    "Vance is one of two 2022 Senate candidates whom billionaire entrepreneur Peter Thiel has pledged to help with $10 million super PAC donations — the other is Blake Masters, running in Arizona’s Republican Senate primary.",
    "While the Club is backing Mandel in Ohio and Rep. Mo Brooks, the Trump-endorsed Senate candidate in Alabama, they’ve concentrated their resources on one candidate in particular: Rep. Ted Budd in North Carolina.",
    "Moreno, who had loaned his campaign $3 million as of September, said last week that number has since increased by a “substantial” amount — and that he has not set a limit for how much he may spend on the race.",
    "Thiel’s contributions are the highest ever to super PACs supporting individual Senate candidates, according to the Center for Responsive Politics, a nonpartisan organization that tracks political giving.",
    "“Self-funders have always been around, but they often came with the political baggage of appearing to buy their elections,” said Caleb Burns, a partner at Wiley Rein who specializes in campaign finance.",
    "Bernie Moreno, a car dealer turned blockchain businessman, has spent $2.5 million on television advertisements in just the past six weeks, more than any other Ohio candidate during that time.",
    "In Ohio, where a handful of millionaires are chasing the GOP nomination, two Senate hopefuls have each already plowed $10 million into their campaigns — and the primary isn’t until May.",
    "Budd received an unexpected endorsement from Trump shortly after launching his Senate campaign last summer and has benefited from the Club’s record-setting involvement in the race.",
    "“I’m not someone who has been in the political arena my whole life,” he added, noting the high cost of boosting his name recognition and favorability among primary voters.",
    "To date, the spending is more muted in Democratic primaries, where several candidates and incumbents are amassing fortunes, but not yet spending as freely on television.",
    "David McCormick, a former hedge fund executive, has dropped $3.7 million on ads — much of which his campaign purchased before he formally entered the race last week.",
    "That’s more than double what was spent on Senate races at this point in 2020 or 2018, according to a POLITICO analysis of data from AdImpact, an ad tracking service.",
    "David McIntosh, Club for Growth Action president, said the group is committed to “spending at least $10 million on the primary” to defeat former Republican Gov.",
    "Mehmet Oz, the celebrity doctor and television host who launched his campaign Nov. 30, has spent $5.4 million on advertisements in less than two months.",
    "But other places, including swing states like Arizona, Pennsylvania, Wisconsin, Nevada and North Carolina, are also seeing unprecedented early ad buys.",
    "The pursuit of his endorsement — and the need to establish pro-Trump bona fides — has fueled an arms race among candidates in Republican primaries.",
    "It’s a sign of the fierce trench warfare ahead in an election year where the loss of a single seat could cost Democrats their Senate majority.",
    "Months before the first Senate primary vote will be cast this year, there’s a spending spree unrivaled by any election cycle in history.",
    "“There has been nothing in Pennsylvania in recent memory that would be on this scale,” said a strategist who is involved in the race.",
    "“This will likely be the most we spend on a single congressional race in recent history,” McIntosh said in a statement this week.",
    "Trump may have also played a role in changing the stigma that often surrounds wealthy candidates who spend freely to win office.",
    "Over the last decade, just seven Senate candidates nationwide have put $10 million or more of their own funds into their races.",
    "Gibbons, an investment banker, has touted his purchase of more than $10 million in television ad time in the coming months.",
    "Together, Senate candidates from both parties have already bought $131 million worth of television advertisements.",
    "Mandel, who is backed by the Club for Growth, had close to $6 million cash on hand at the end of September.",
    "Timken, a former Ohio Republican Party chair, kicked off her bid with an initial $2 million personal loan.",
    "A spokesperson for Timken declined to say if she has put any more in the race since that investment.",
    "Then there is the case of former Ohio state treasurer Josh Mandel and “Hillbilly Elegy” author J.D.",
    "In Pennsylvania, the top ad spenders are two Republicans who have only recently joined the race.",
    "He declined to disclose what his next campaign finance filing will reveal at the end of January.",
    "Gibbons and Dolan aren’t the only millionaires throwing cash at the contest to replace GOP Sen.",
    "That’s quadruple what Gibbons put into his unsuccessful Republican Senate primary bid in 2018.",
    "Some see former President Donald Trump as one of the forces driving the surge in GOP spending.",
    "“I do wish I didn’t have to fund as much of the campaign as I’m doing,” Moreno said.",
    "Budd, however, has yet to command a decisive lead in the Senate race.",
    "Vance, both of whom are boosted by super PACs.",
    "Rob Portman, who is retiring.",
    "Pat McCrory."
  ]
}