{
  "id": 3914,
  "mediaId": 2752,
  "date": "2022-01-21",
  "headline": "Confused Grandpa Trump Just Gonna Endorse Every GOP Candidate Who Gives Him A Diet Coke And A Sponge Bath",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xOTYzMzA4Ny9vcmlnaW4uZ2lmIiwiZXhwaXJlc19hdCI6MTY2NjM4OTM0M30.YM1y-F_yxcp_JMmXB3rrLI9tyh2fE4cYpuwYIpVcvRU/img.gif?width=1200&coordinates=0%2C125%2C0%2C125&height=600",
  "link": "https://www.wonkette.com/trump-reportedly-weighs-endorsing-multiple-candidates-in-same-race-sure-you-bet",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Dye",
  "authorUrl": "https://www.wonkette.com/u/five_dollar_feminist",
  "termIds": [
    0
  ],
  "sentences": [
    "The GOP kingmaker-in-chief has grown so distrustful of all the advice he’s getting from various aides — and so wary of being lured into picking the wrong horse — that he’s floated an idea that would essentially dilute his endorsement.",
    "Meanwhile, Rep. Mo Brooks isn't exactly setting the world on fire in the Alabama Senate race, which, yeah, no shit, this is a guy who ran in 2018 against a man accused of molesting several teenage girls and came in third place.",
    "“He feels like he’s being penned in,” said a person close to the former president, explaining that Trump’s logic is that dual endorsements would mean, “I get two chances to win.”\nOr maybe he will not do MULTI-DORSEMENTS!",
    "Left unsaid — by Politico, anyway — is that in normal times the state party, which is presumably in the best position to determine who will appeal to its own voters, would have a major say in choosing the candidate.",
    "More likely is that he will shower praise on multiple candidates or offer them some other form of acknowledgement, such as granting each a visit to Mar-a-Lago to pose for a picture with him.",
    "He saddled Georgia with Herschel Walker to take on Sen. Raphael Warnock, and his chosen favorite in the Arizona gubernatorial race, Kari Lake, is a wacko who gets photographed with Nazis.",
    "Don Jr. already convinced his old man to endorse Sean Parnell in the Pennsylvania Senate race, only to see that candidacy implode in a hail of domestic violence allegations.",
    "Politico Playbook gets its giggle on this Friday morning with a fun story about an indecisive Florida man who orders one of everything off the breakfast menu at Denny's.",
    "Politico reports this as if it is totally normal that a national party's fate hangs on an aging egomaniac's petty grievances against the nominal party leader.",
    "And Arizona AG Mark Brnovich, who has already proven he can win statewide, is on Trump's enemies list because he failed to overturn the election in 2020.",
    "Like Peter Thiel, the billionaire seeking to buy Senate seats in Ohio and Arizona, the better to ratfuck America's tax laws for his own benefit.",
    "He will do many photo ops, until one of his suitors manages to perform an act of sycophancy so debasing that the other hopefuls are left agape.",
    "Take the Missouri senate race where \"PAM BONDI, who heads Trump’s super PAC, has advocated for her longtime friend, state A.G. ERIC SCHMITT.",
    "Trump has apparently considered un-endorsing Brooks for the unpardonable sin of saying 2024 matters more than nursing grievances from 2020.",
    "See, Donald Trump can't figure out which candidates to endorse, since his only metric is how enthusiastically a politician kisses his ass.",
    "Another person close to the former president said he does not expect that Trump will ultimately endorse two candidates in the same race.",
    "“He’s at times suspicious of the recommendations that people give him when he knows they’re being paid,” one Trumplander told Politico.",
    "The problem is his advisers are a pack of grifters trying to monetize their relationship with him, so he doesn't know what to think.",
    "Or should he give the nod to his former advisor Dina Powell's choice, who happens to be her gazillionaire husband David McCormick?",
    "Kay Ivey because she hurt his feelings once, and it didn't even rate a mention in this article because there is so much crazy.",
    "But KELLYANNE CONWAY is advising Rep. BILLY LONG’s campaign, and KIMBERLY GUILFOYLE serves as national chair of former Gov.",
    "And it's not like he's going to, like, read policy papers to figure out whose political vision matches his.",
    "Come on, this is a guy whose daily briefing had to be reduced to a comic book that cast him as the hero.",
    "But apparently Ohio shitposter Josh Mandel was too busy burning his mask to hire the \"right\" consultant.",
    "Vance look charismatic, is facing off against Jim Lamon, who is backed by Trump troll Ric Grenell.",
    "And not for nothing, but it's not like Trump's instincts are that great when he goes it alone.",
    "But he fancies himself a kingmaker, so he has to anoint someone with the sacred self-tanner.",
    "Trump actually talked someone into mounting a primary challenge against popular Alabama Gov.",
    "And he can't not endorse, because that would \"cede power to his nemesis, MITCH MCCONNELL.\"",
    "So Trump has to rely on his advisers to tell him which candidate he \"likes.\"",
    "In Arizona Thiel's avatar Blake Masters, who somehow manages to make J.D.",
    "Plus there's the annoying problem that Trump's advisers are often wrong.",
    "Or if they're not getting \"paid,\" it's because they're the customers.",
    "“He’s been asking who is paying who.”\nOh, he worked that out, did he?",
    "[Politico]\nClick the widget to keep your Wonkette ad-free and feisty.",
    "Vance happen in Ohio, where Kellyanne is shilling for Bernie Moreno.",
    "And if you're ordering from Amazon, use this link, because reasons.",
    "These assholes could screw up a three-car funeral procession.",
    "Don't let anyone tell you the midterms are a done deal.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "Should he take Hannity's advice and go with Dr. Oz?",
    "And then that candidate will get the rose.",
    "How often would you like to donate?",
    "Maybe he will do MULTI-DORSEMENTS!",
    "ERIC GREITENS’ campaign.\"",
    "He's trying to make J.D.",
    "Well, more or less.",
    "Gold star, Poppy!",
    "Errrrr, \"think.\""
  ]
}