{
  "id": 4162,
  "mediaId": 5153,
  "date": "2022-01-25",
  "headline": "Rep. Marjorie Taylor Greene endorses ‘Hillbilly Elegy’ author J.D. Vance in GOP Ohio Senate race",
  "image": "https://www.nydailynews.com/resizer/ZqON2uL3-f7wqJO_Z_do8F3bP0Q=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/V6JHL5XQTNFX7EPJWDXTDQENEE.jpg",
  "link": "https://www.nydailynews.com/news/politics/us-elections-government/ny-election-2022-rep-marjorie-taylor-greene-jd-vance-endorsement-ohio-senate-20220125-gvabu2biczep5csco2dtibxfuu-story.html#ed=rss_www.nydailynews.com/arcio/rss/category/news/",
  "mediaOutlet": "Daily News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Goldiner",
  "authorUrl": "https://www.nydailynews.com/ny-dave-goldiner-staff.html#nt=byline",
  "termIds": [
    5581,
    2290,
    3746,
    4306,
    1126,
    980,
    1489,
    6474
  ],
  "sentences": [
    "All the candidates are portraying themselves as strong Trump supporters, even though Vance and others have had to explain away previous harsh criticism of the former president.",
    "“And that’s why I’m proud to endorse him.”\nVance, a former Marine and author of the acclaimed heartland memoir, is a rising conservative star and a prolific fundraiser.",
    "With the GOP primary electorate firmly in Trump’s corner, the endorsement of MTG is a coveted win for Vance as will help strengthen his MAGA bona fides.",
    "“JD Vance is the conservative warrior that the entire America First movement needs fighting for us in the U.S. Senate,” said Greene, in a statement.",
    "Ex-GOP state party chair Jane Timken is also a frontrunner along with businessman Bernie Moreno and investment banker Mike Gibbons.",
    "The firebrand supporter of former President Trump called Vance a “conservative warrior” who would bring MAGA values to the Senate.",
    "Josh Mandel, a former state treasurer and failed 2012 Senate candidate, has led in some polls.",
    "But he has struggled to gain traction in the crowded Republican primary to succeed Sen.",
    "Rep. Marjorie Taylor Greene (R-Ga.) has endorsed “Hillbilly Elegy” author J.D.",
    "Vance in the crowded Ohio Republican Senate primary race.",
    "Rob Portman (R-Ohio) in the red-trending Buckeye state."
  ]
}