{
  "id": 4643,
  "mediaId": 2641,
  "date": "2022-04-21",
  "headline": "Mike Gibbons: 'I Can't Get Over' JD Vance's Backing Hillary Clinton in 2016",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=92a06231-6593-4633-bab9-f6e0fbece15f&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/gibbons-trump-ohio-senate/2022/04/21/id/1066740/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jay Clemons",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "On Newsmax, Gilbbons told \"American Agenda\" co-hosts Bob Sellers and Heather Childers on Thursday that he questioned Vance's recent transformation into an America First candidate — for reasons dating back six years.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\n© 2022 Newsmax.",
    "The Ohio businessman understands the 45th president's recommendations carry weight in Ohio, especially after winning the state for both the 2016 and 2020 presidential elections.",
    "According to RealClearPolitics, a site that monitors tracking polls for the November midterms, Gibbons holds a slim lead in two of the three prominent Ohio Senate polls.",
    "He was also Ohio finance co-chair for Trump's campaign in 2016, while reportedly donating more than $100,000 to Trump's campaigns for 2016 and 2020.",
    "The latest Fabrizio, Lee & Associates poll, released Thursday, shows that Vance holds a 7-point lead over Mandel and a 12-point lead over Gibbons.",
    "When asked what distinguishes him from the other GOP primary candidates, Gibbons offered a simple response: \"I'm a businessman, not a politician.",
    "But Gibbons finds it difficult to believe that any GOP voter would favor a candidate who once aligned philosophically with the Democratic Party.",
    "Certain tracking polls have U.S. Senate hopeful Mike Gibbons as a possible front-runner in the Ohio Republican primary set for May 3.",
    "Gibbons then added, when pressed on the U.S. dealing with supply chain problems and inflation at 40-year highs: \"I studied economics.",
    "The problem I had, and still have, is that [Vance] talked about voting for Hillary Clinton'' in 2016, Gibbons said.",
    "\"How can anybody with even a modicum of conservative belief actually contemplate voting for Hillary Clinton?",
    "I understand why inflation's going [up] right now, and it rests at the feet of the Biden administration.\"",
    "Everybody else is either a politician or a celebrity; and I think there's a great distinction there.\"",
    "\"The problem I [have with Vance] is not that he didn't support Donald Trump [in previous elections].",
    "She's the embodiment of the transformation that the Democratic Party wants to impose on America.\"",
    "But that hasn't stopped Gibbons from going on the offensive, particularly when asked about J.D.",
    "I question how flexible is this guy, if he can truly consider voting for Hillary Clinton?",
    "GOP candidate Josh Mandel — not Vance — leads the other tracking poll, according to RCP.",
    "Gibbons once served as managing partner of the Cleveland Crunch pro soccer franchise.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "Gibbons' background has some Trump elements in it, minus being a reality-TV star.",
    "Vance, who recently garnered an endorsement from former President Donald Trump.",
    "He was president or chief executive officer of a handful of Ohio companies.",
    "\"I question [Vance's] judgment, his true conservative ideology.",
    "He stopped short of knocking Trump's endorsement of Vance.",
    "Gibbons then added, \"I can't get over that.\"",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "All rights reserved.",
    "I taught economics.",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "It's amazing.\"",
    "1220, FiOS Ch.",
    "Special Links:"
  ]
}