{
  "id": 4690,
  "mediaId": 2672,
  "date": "2022-04-23",
  "headline": "J.D. Vance Promises Voters That He Really Means It — This Time",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/GettyImages-1239922215.jpg",
  "link": "https://www.rollingstone.com/politics/politics-features/j-d-vance-has-money-and-trumps-endorsement-why-isnt-he-doing-better-1342155/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Crosbie",
  "authorUrl": "",
  "termIds": [
    4306,
    2290,
    5660,
    836,
    6474,
    6533,
    6678
  ],
  "sentences": [
    "Political rallies on a weekday in rural Ohio in mid-April are not exactly the hottest ticket event of the season (that’s the Trade Days swap meet 13 miles north of Portsmouth at the fairgrounds, where for $800 you can get either a purebred pug puppy, vaccine record included, or a Remington shotgun).",
    "But on the stump, he speaks like a lawyer (which he is) making opening arguments to a case: ramming through his points in a torrent of words; or like a venture capitalist (which he is), steamrollering through prepared remarks before anyone has time to catch up and ask him where the money came from.",
    "Vance works it into his speech in Portsmouth, coupled with an anecdote about hecklers at his town hall with Newsmax earlier in the week (he immediately noticed them because they were “double masked with blue or purple hair,” Vance says, which scores him a rare genuine laugh from the crowd.)",
    "Now he’s playing a very different role, saying he was “glad to be wrong” about Donald Trump in 2016 —and playing it well enough to convince the man himself (though the fact that he and Trump share an astronomically wealthy benefactor in Thiel probably didn’t hurt).",
    "Vance’s task is simple: he needs to convince Ohio’s GOP primary voters that there is no zeal like that of a convert, and that only he can channel the God of MAGA well enough to save Ohio from its lurking fate, despite his past years of heresy.",
    "The only aberration, really, was when the comedy duo The Good Liars interrupted Vance’s speech on Thursday night to loudly ask for a refund on his book and were quickly escorted away by Team Vance’s fresh-faced fleece guys.",
    "The Trump bump will help — Vance is scheduled to speak at Trump’s rally in Columbus tonight — but, absent impartial polling, it’s hard to tell whether the man who has it all has managed to convince voters that he’s legit.",
    "But he still manages to play up his key issue as a Threat to America’s Children, railing about the danger of kids growing up around drug cartels and dropping a vague anecdote about young boys being sex trafficked to Ohio.",
    "800 was a venture capitalist who rubbed elite elbows as he condemned the Donald by suggesting he could be an “American Hitler.”\nEven before he got to Gatti’s Pizza, Vance faced the big question at a Friday morning town.",
    "(This may be some riff on the 2016 Trillium farms case, where six teens from Guatemala were lured to Ohio with the promises of schooling and then forced to work on an egg farm, but anyway, all that is beside the point.",
    "Vance isn’t stupid — he surely understands that McConnell is the best strategist the GOP has had in decades, and that defying him in the Senate is a great way to have a short career, which is clearly not the point.",
    "Vance’s team is busy setting up chairs and with the Terminator, which they defeat easily, flagging down a manager who unplugs the game, as well as a few others near the broken door, and that is that.",
    "And that machine is just absolutely blasting action-movie orchestra BWAAAAs and gunfire sounds right through that broken door and into the room where Vance himself is about to give his stump speech.",
    "The arcade has pop-a-shot, a cool Jurassic Park machine that you sit inside, and, crucially, a giant TERMINATOR SALVATION game with two surprisingly realistic plastic M4 rifles.",
    "Historically, he’s pretty good at this: for several years, he had basically every liberal in America convinced he was their moral ambassador to the middle-American masses.",
    "You can also grease some palms (literally) — the crowd in Portsmouth is small enough that Team Vance puts all their meals at Mr. Gatti’s pizza buffet on its tab.",
    "At one event a man asks him if he will commit to not voting for McConnell as Senate Majority leader; Vance replies that it depends on who runs against him.",
    "Vance has changed before, and there’s an argument to be made that, even if he’s not held office before, he’s been building a career in politics for years.",
    "Vance leans on the Southern Border (which, we must remember, is 1,185 miles from Cincinnati as the crow flies) more than Mandel’s School Gender Wars.",
    "“If he’s legit, he’ll be the best Senator in D.C.,” says Ben Kennedy, an 18-year-old who came to see Vance in Loveland on Friday with his dad, Mike.",
    "But one of the perks of having it (Thiel money) all is you can really pound the pavement — Vance has done over 60 events on his “NO BS” tour.",
    "After all, he’s lived in the world of rhetoric and TV spots for years, swapping a book tour and CNN slots for the campaign trail and Newsmax.",
    "Vance for Ohio” fleeces, they have 3.5 million of Peter Theil’s dollars, they have the big fancy pop-up backdrop thing that says “J.D.",
    "The most recent impartial polling, conducted before Trump’s endorsement, had Vance trailing frontrunner Josh Mandel by five points.",
    "Mr. Gatti’s is pretty quiet, and Vance isn’t there yet, which is too bad because I sort of wanted to challenge him to pop-a-shot.",
    "Everywhere else, it’s Vance and a small group mostly comprised of retirees and small business owners who set their own hours.",
    "Like his primary opponent Josh Mandel, Vance is saying what they want to hear, no matter how brusquely he says it.",
    "They have fresh-faced staffers with degrees from good midwestern schools and D.C. resumes, they have custom “J.D.",
    "He tells everyone about all the RINOs he’ll go after: Mitt Romney, Mitch McConnell, Kevin McCarthy, you name it.",
    "“In my gut I feel like the man’s sincere,” says Tim Knauff, owner of the Gatti’s franchise in Portsmouth.",
    "VANCE” on it, there is a broken sliding door that leads to Mr. Gatti’s honestly pretty impressive arcade.",
    "PORTSMOUTH, Ohio — It is just after noon on Friday at Mr. Gatti’s Pizza, and the campaign to elect J.D.",
    "Vance has to convince Ohio’s voters that he is the Trump-loving MAGA-outsider they’ve always wanted.",
    "On the 2022 campaign trail in our post-fact, one stump speech story is just as true as any other.)",
    "Polling conducted by Thiel’s pro-Vance Protect Ohio Values PAC now shows Vance seven points ahead.",
    "Vance does not give any room for applause lines, which means he doesn’t really get much applause.",
    "They don’t like Mandel because he’s a career politician, and they don’t have much faith in those.",
    "His main opponent, former State Treasurer Josh Mandel, is also running on the gospel of MAGA.",
    "“How are you going to counter his “America First” with your “America First,” a woman asks.",
    "That’s more than enough time to become somebody completely different all over again.",
    "But Vance also understands that Senators get six whole years once they’re in.",
    "I pray that if he is elected he’ll keep his word.”\nAnd that, for J.D.",
    "The question now is whether or not that is going to be enough.",
    "The problem is that, next to the big backdrop that says “J.D.",
    "Nobody is actually playing Terminator Salvation, of course.",
    "Free food or not, Vance’s crowds seem to be leaving happy.",
    "If it’s Romney, say, well then he’ll stick with Mitch.",
    "Vance’s pitch is slick enough that it just might sell.",
    "If he’s elected, Vance will actually have to do stuff.",
    "Until now, that message hadn’t seemed to be selling.",
    "Vance has realized they need to kill the Terminator.",
    "“Well, mine is real and his is fake,” Vance says.",
    "1000 — is a right-wing populist and MAGA acolyte.",
    "“We’ll find out in a year from now,” he remarks.",
    "Nothing can stop him now, except maybe J.D.",
    "They have the endorsement of Donald Trump.",
    "On the trail, Vance is a big game hunter.",
    "But it’s still an interesting dilemma.",
    "His current version — call it the J.D.",
    "“I’ve been burned before,” Mike adds.",
    "Some of the others haven’t even been.",
    "Vance, is going to be the real test.",
    "That’s what the people want to hear.",
    "It’s not that Vance isn’t confident.",
    "See, the Vance campaign has it all.",
    "“He’s been down here twice already.",
    "The field has been cleared for J.D.",
    "Some RINOs are bigger than others.",
    "To be fair, the pickings are slim.",
    "In order to win the primary, J.D.",
    "The BWAAs and gunshots stop.",
    "But back in 2016, the J.D.",
    "The crowd laughs.",
    "VANCE” on it.",
    "Vance.",
    "He is.",
    "Vance.",
    "J.D.",
    "V.C."
  ]
}