{
  "id": 4767,
  "mediaId": 2512,
  "date": "2022-04-23",
  "headline": "JD Vance rakes in more cash after receiving Trump endorsement: report",
  "image": "https://www.alternet.org/media-library/j-d-vance-is-railing-against-the-elite-while-his-party-supports-their-efforts-to-dodge-taxes-journalist.jpg?id=26932784&width=1200&coordinates=0%2C106%2C0%2C107&height=600",
  "link": "https://www.alternet.org/2022/04/jd-vance/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meaghan Ellis",
  "authorUrl": "https://www.alternet.org/author/meaghanellis",
  "termIds": [
    5660,
    5613,
    2802,
    4306,
    2765,
    1489,
    1126,
    6234,
    6474,
    6506
  ],
  "sentences": [
    "While allies concede Trump's announcement at 5 p.m. on Good Friday, less than three weeks before the May 3 primary election, may not have been the most desirable timing, the campaign nonetheless reports a 300% increase in online donations — a majority from new donors — including $20,000 raised online and $30,000 by bundlers that Friday alone.\"",
    "According to ABC News, in addition to endorsing Vance, Trump also announced his endorsement of television host Dr. Mehmet Oz, who is a Republican Senate candidate in Pennsylvania.",
    "Vance, “Hillbilly Elegy” author and Republican candidate for the Ohio Senate, has seen a sharp uptick in donations since former President Donald Trump officially endorsed him.",
    "J. D. Vance speaking with attendees at the 2021 Southwest Regional Conference, hosted by Turning Point USA at the Arizona Biltmore in Phoenix, Arizona, Gage Skidmore\nJ.D.",
    "“For him to endorse JD Vance really seemed like President Trump was out of touch with what’s going on in Ohio and what his supporters here want,” said Zawistowski.",
    "In Pennsylvania, Arnold McClure, who serves as the chair for Huntingdon County's Republican Party, noted that Trump's influence appears to have waned in his state.",
    "While most of Trump's endorsements have gotten major backing from his supporters, there is one candidate that hasn't seen the same impact as Vance: Dr. Oz.",
    "Per ABC News: \"In Ohio, Trump's endorsement has been a major boon to Vance, who had been trailing in the polls before Trump’s intervention.",
    "Since the Trump endorsement, Protect Ohio Values, confirmed it \"has brought in $5 million since Trump's endorsement.",
    "Tom Zawistowski, leader of Ohio's Tea Party, also weighed in with his perspective of Trump's endorsement of Vance.",
    "That includes a $3.5 million check from venture capitalist Peter Thiel, who had previously given $10 million.\"",
    "“The conservative Trumpers are very upset over his endorsement, and they cannot understand it,” said McClure.",
    "Vance is railing against ‘the elite’ — while his party supports their efforts to dodge taxes: journalist\nJ.D.",
    "In fact, Trump is facing backlash for his support of Vance and TV’s Dr. Mehmet Oz in Pennsylvania.",
    "But for Vance, the endorsement has led to a distinct increase in campaign funding.",
    "“The Trump era is over in Pennsylvania because of his endorsement of Dr. Oz.”",
    "Although the increase is great for Vance, some Republicans are not pleased.",
    "Politico also offered insight into the shift in support for Vance.",
    "And we’re going to go all out on that,\" said Luke Thompson.",
    "“We want to make sure 100% of people know about it."
  ]
}