{
  "id": 4769,
  "mediaId": 8494,
  "date": "2022-04-24",
  "headline": "Ohio's Republican U.S. Senate candidates not endorsed by Trump are still likely to show him support",
  "image": "https://npr.brightspotcdn.com/dims4/default/1b18524/2147483647/strip/true/crop/7688x4036+0+539/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Fab%2F80%2F58e2222e4c8c82cb300ff91f4a53%2Feln-sen-rep-debates-jb-37.JPG",
  "link": "https://www.wksu.org/government-politics/2022-04-24/ohios-republican-u-s-senate-candidates-not-endorsed-by-trump-are-still-likely-to-show-him-support",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2290,
    4306,
    5581,
    2765,
    3282,
    1489,
    1126,
    6474
  ],
  "sentences": [
    "“If these candidates are not talking about support for Trump, many voters may very well assume that the candidates don't support him, which is, that could be damaging in the Republican primary.",
    "But with some Republicans saying they’re angry that Trump has endorsed Vance, who opposed Trump before he launched his U.S. Senate campaign last year, Newhouse said the race could be wide open.",
    "I press down the pedal a little bit harder.”\nNewhouse says there are ways for non-endorsed candidates to promote their support of Trump without implying he’s endorsed them.",
    "Former President Donald Trump was at the Delaware County Fairgrounds this weekend with his newly endorsed candidate in Ohio’s Republican U.S. Senate race, J.D.",
    "Given you've got five candidates in this race that are all getting at least 9% or so of the vote, you've got a third of the voters basically undecided here.",
    "But what does that do to the campaigns of three other leading candidates in that race who had been marketing themselves as strong Trump followers?",
    "But Republican pollster Neil Newhouse said he doesn’t think Gibbons, Timken, or Mandel should change their ads or approach.",
    "Last year Trump told Republicans to stop using the former president's name and likeness to raise funds.",
    "So does Jane Timken, who also calls herself a \"MAGA conservative.\"",
    "While Josh Mandel's tag line is \"pro-God, pro-gun, pro-Trump.\"",
    "“If anything, I would probably double down on it right now.",
    "In his ads, Mike Gibbons said he's \"Trump tough.\"",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "So I would not take my foot off the gas.",
    "Confusion reigns,\" Newhouse said.",
    "Vance."
  ]
}