{
  "id": 4789,
  "mediaId": 2522,
  "date": "2022-04-24",
  "headline": "‘They all come back’: Trump explains endorsement after J.D. Vance said ‘some bad sh*t’ about him",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/04/Getty-Trump-Vance.jpg",
  "link": "https://www.bizpacreview.com/2022/04/24/they-all-come-back-trump-explains-endorsement-after-j-d-vance-said-some-bad-sht-about-him-1229501/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Haggerty",
  "authorUrl": "https://www.bizpacreview.com/author/kevin-haggerty/",
  "termIds": [
    5613,
    2240,
    4306,
    2765,
    3982,
    6107,
    6474,
    6678
  ],
  "sentences": [
    "Citing a vote for third-party candidate Evan McMullin in 2016 and references to Trump supporters as “racists” Ohio GOP chairs wrote, “We do not support JD Vance for the aforementioned reasons and would urge you not to endorse anyone in this race.”\nGeorgia State Rep. Josh McLaurin (D), Vance’s college roommate, recently tried to spur further division among supporters when he posted an excerpt of comments allegedly made in 2016 referring to Trump as a “cynical a**hole like [President Richard] Nixon…or that he’s America’s Hitler.”\nThe screenshot below is @JDVance1’s unfiltered explanation from 2016 of the breakdown in Republican politics that he now personally is trying to exploit.",
    "Former President Donald Trump headlined a rally in Ohio Saturday night where he confronted head-on what some argue may be one of his most controversial endorsements to date stating plainly, “He’s a guy that said some bad sh*t about me…but they all came back.”\nDuring a “Save America” event in Delaware, OH, Trump made an overture toward the future when he invited one of his latest endorsements, U.S. Marine Corps veteran and bestselling author of “Hillbilly Elegy,” J.D.",
    "I think he was a good president, I think he made a lot of good decisions for people and I think he took a lot of flak.”\nThat seemed like more than enough for Trump who focused on his reasoning for endorsing Vance, “But I will tell you, he was tough, and, but the others were tough, and they all, a lot of them said some very bad things and, ultimately, I put that aside.",
    "Come on up, J.D.”\nDuring his remarks, Vance offered the president and Ohio voters a mea culpa stating, “The president is right – I wasn’t always nice, but the simple fact is he’s the best president of my lifetime and he revealed the corruption in this country like nobody else.”\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "We are, whether we like it or not, the party of lower-income, lower-education white people, and I have been saying for a long time that we need to offer those people SOMETHING (and hell, maybe even expand our appeal to working class black people in the process) or a demagogue would.",
    "“I’m very pleased to introduce the man with by far the best chance to defeat the radical Democrat nominee for the U.S. Senate this November.”\n“And you know what, you know what?” Trump rhetorically asked the rally-goers, cutting right to the heart of the matter.",
    "By the way, he’s been like, incredible the last period of time, long period of time, and so have the others for the most part, I guess in all cases, the others.”\n“But, I have to do what I have to do,” he emphasized.",
    "Trump is the fruit of the party’s collective neglect.”\nThe Senate hopeful had already begun making amends for comments he had made in the past stating, “Like a lot of people, I criticized Trump back in 2016.",
    "pic.twitter.com/79Z0qSWFWF\n— Josh McLaurin (@JoshforGeorgia) April 18, 2022\nVance reportedly wrote, “But I’m not surprised by Trump’s rise, and I think the entire party has only itself to blame.",
    "And I ask folks not to judge me based on what I said in 2016, because I’ve been very open that I did say those critical things and I regret them, and I regret being wrong about the guy.",
    "They all said bad, but they all came back,” he elaborated in a potential nod to Ohio Republicans who had cautioned against the endorsement over Vance’s past comments.",
    "Every one of the others did also.”\n“In fact, if I went by that standard, I don’t think I would have ever endorsed anybody in the country.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "Vance, come forward, I wanna pick somebody that’s going to win and this man is going to win.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "Vance, on stage with him ahead of the state’s May 3 primary election.",
    "“We have to pick somebody that can win and this guy is, he’s tough.",
    "The public deserves to know the magnitude of this guy’s bad faith.",
    "A great student, you know, went to Yale, got a law degree.",
    "“He’s a guy that said some bad sh*t about me, he did.",
    "The public will not see it and we do not share it.",
    "The “America’s Hitler” bit is at the end.",
    "He fights like crazy and he loves Ohio.",
    "And he, frankly, he’s a great Buckeye.",
    "So, what I’d like to do is ask J.D.",
    "He’s a fearless MAGA fighter.",
    "He’s a Yale educated lawyer.",
    "He’s a great student.",
    "He’s a former Marine.",
    "But you know what?",
    "He’s smart."
  ]
}