{
  "id": 4865,
  "mediaId": 2618,
  "date": "2022-04-24",
  "headline": "Search resumes for Texas National Guard soldier, 22, who disappeared while attempting to save two migrants suspected of narcotics trafficking who were crossing the Rio Grande river",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/24/search_resumes_for_texas_national_guard_soldier_22_who_disappeared_while_attempting_to_save_two_migrants_suspected_of_narcotics_trafficking_who_were_crossing_the_rio_grande_river_83848.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Natasha Anderson",
  "authorUrl": "",
  "termIds": [
    5891,
    4905,
    4794,
    1298,
    1307
  ],
  "sentences": [
    "They’ve blocked doors to counting rooms and forcefully prevented\nWhite House press secretary Jen Psaki dodged a question Monday about The Post’s reporting on Hunter Biden business associate Eric Schwerin’s 19 visits to the White House complex and vice president’s residence while Joe Biden was vice president.“On Hunter Biden, the New York Post is reporting, looking at White House visitor logs, that there were 19 visits to the White House while the president was vice president by Hunter Biden’s business partner, including one with the vice president,” PBS reporter Lisa Desjardins said at Psaki’s regular briefing.“Can you help us understand why that business partner had access and what those meetings were about?”\nWhite House press secretary Jen Psaki blasted former President Donald Trump on Monday for spending time building a border wall instead of pursuing immigration reform.",
    "WASHINGTON — President Biden on Tuesday issued three pardons and 75 prison sentence commutations in his first grants of clemency since taking office.All of the commutations and two of the three pardons went to people convicted of federal drug offenses.“Today, I am pardoning three people who have demonstrated their commitment to rehabilitation and are striving every day to give back and contribute to their communities,” Biden said in a statement.“I am also commuting the sentences of 75 people who are serving long sentences for non-violent drug offenses,\nThe progressive left’s worst nightmare became a reality when billionaire Elon Musk bought Twitter, a day that will live in infamy for Democrats and their shock troops and the idea that free speech will be restored appears to be of major concern to the White House.",
    "The Democrats then expect to grant tens of millions of illegal aliens, both the illegal aliens now unlawfully entering the USA, and illegal aliens who have unlawfully entered in past years a “path to citizenship” amnesty contained in a Democrat designed comprehensive immigration reform legislative package leading to granting them future U.S. voting rights, public actions that the Democrats believe will permanently change the US electorate and general population, with the vast percentage of new American foreign born voters bound to be socialist Democrat supporters, keeping the leftist Democrats in permanent political control in DC and around the country indefinitely, thus able to transform the USA into some sort of a socialist utopia.",
    "The illegal aliens who are now traveling to the US Borderline from countries around the world or who are already there believe that Biden and the leftist Democrats have encouraged and invited them to make the journey from their home countries to the USA through public statements made by them during the run up to the 2020 election and thereafter when Biden instituted his “open borders” agenda and set out a policy stopping the US immigration authorities from arresting and deporting illegal aliens from the interior of the USA from then on.",
    "Authorities are searching for a Texas National Guard soldier who went missing after jumping into the Rio Grande river to save a pair of drowning migrants from Mexico.The 22-year-old soldier, whose name has not been released, went into the water near Eagle Pass, Texas on Friday and has not been seen since, according to a Texas Military Department press release.Multiple agencies searched for the soldier on Saturday and 'will continue until we have exhausted all available resources,' the department said.",
    "Brian Kemp (R-Ga.), he wasted no time in asserting his views that the 2020 election “was rigged and stolen” and that Kemp is partially responsible.In the first of three scheduled debates leading up to the May 24 primary, the challenger, endorsed by former President Donald Trump, had been granted the opportunity to lead off the introductions Sunday.",
    "Carlson was suspended from the platform last month after Twitter determined he violated its rules by referring to Assistant Secretary of Health Dr. Rachel Levine, who is a transgender woman, as a man.He tweeted in support of satirical conservative news website The Babylon Bee, whose account was suspended for a similar infraction.",
    "(Video) During Monday’s press briefing, White House Press Secretary Jen Psaki reacted to Musk’s takeover of the social media giant with her answer suggesting that there could be political moves coming to counter Musk’s relaxing of the censorship of conservatives, an alarming prospect for her party’s control over the narrative.",
    "In that respect the leftist Democrats would allow all of Black Africa and South America into the USA, to permanently change the current U.S. population to a new minority-majority coalition population throughout the USA, designed to diminish the current European origin White majority population into just another minority.",
    "Perdue capitalized on his chance to set the stage and made his belief clear that Kemp is as much to blame for the woes Georgia voters are feeling from\nFox News host Tucker Carlson returned to Twitter just hours after it was announced that billionaire Elon Musk bought the social media platform for $44billion.",
    "Federal policy could instead return each \"migrant\" to the most distant point in Mexico right away, whether apprehended trying to sneak in or having lived here for years, but federal policy is to destroy the nation through mass immigration, so our hands are tied and another American has died.",
    "China is Tesla's second largest market,\nThe United States Supreme Court (SCOTUS) is scheduled to hear a case on Tuesday that will decide whether President Joe Biden illegally terminated the Migration Protection Protocols, known as former President Trump’s “Remain in Mexico” program.",
    "'If we just dial it back a few years to kind of what we inherited here, the former president invested billions of dollars in a border wall that was never going to work or be effective instead of working toward comprehensive immigration reform,' Psaki said at the press briefing.",
    "Shame on this President and his deceitful Administration for not enforcing existing Immigration Law and instead placing the lives of America's law enforcement as well as those of the drug smuggling illegal aliens in senseless perilous positions such as this.",
    "Among them is Meathead, also known as Rob Reiner, who whined, “the question for all of us is: Will he allow a Criminal who used this platform to lie and spread disinformation to try to overthrow the US Government to return and continue his Criminal activity?",
    "The high court did not explain its order Monday that allows the Thomas Jefferson High School for Science & Technology to continue using its admissions policy, while the Fairfax County School Board appeals the lower court's February ruling.",
    "“Calm down Rob, I’m sure he’ll let Hillary stay on.”\nThe one question that all politicians running for US Senate should be asked is – whether they stand with President Trump or Mitch McConnell.Mitch McConnell has shown his true colors.",
    "Obviously the Biden and leftist Democrat political agenda is to flood the USA with as many poor and uneducated illegal aliens as possible, who would fit within the ethnic or racial categories of Democrat identity politics.",
    "Rather than apprehending and releasing border crossers into the U.S. interior, the program required officials to return border crossers to Mexico while awaiting their asylum and immigration hearings in U.S. courts.",
    "Jeff Bezos on Monday questioned whether his fellow billionaire Elon Musk could be making Twitter vulnerable to pressure from China, as a result of Musk's extensive business liabilities in the Asian nation.",
    "The bedwetters on the Left have been worried that their favorite villain, Donald Trump, will be allowed back on Twitter now that Elon Musk has control over the social media platform.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "They’re not pretty.According to a new book, “This Will Not Pass,” by Jonathan Martin, back on Jan 6 McConnell wasn’t concerned about the well-being of Trump supporters.",
    "Former Sen. David Perdue (R-Ga.) has remained unrelenting over his concerns about voter integrity and, in the first formal gubernatorial debate against incumbent Gov.",
    "Supreme Court justices have temporarily reinstated a woke admissions policy at one of America's top schools despite a federal judge previously ruling it was racist.",
    "Earlier, Psaki had been asked about the death of Texas Army National Guard member Bishop Evans, who went missing Friday after attempting to rescue two migrants",
    "'We're back,' the @TuckerCarlson account tweeted Monday night, shortly after the Tesla CEO successfully completed his takeover of the social media platform.",
    "Fairfax County School Board changed its admissions policy in the wake of the killing of George Floyd in May 2020 to boost 'equity' at the school.",
    "In 2019, Trump instated the Remain in Mexico program that helped effectively eliminate the policy of Catch and Release at the U.S.-Mexico border.",
    "This along with their other actions indicates obvious guilt.We’ve seen Democrats attack any legitimate efforts to uncover 2020 Election fraud.",
    "A few months ago I remember seeing the Border Patrol holding the invaders' hands, pulling them up the bank out of the river and onto our land.",
    "Coyotes have their customers wade halfway across the river, and the Stupid Americans bring them the rest of the way and place them on welfare.",
    "'Interesting question,' mused Bezos, who in 2013 bought The Washington Post with a view to protecting free speech and supporting journalism.",
    "In fact, all the Democrats have done is block and attack anyone who brings up election fraud and then play the victim when they get caught.",
    "'He commented atop a retweet from a New York Times journalist, noting that Musk's Tesla was extremely exposed to China.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "It does not matter what Biden and his leftist crew does regarding the longevity of Title 42 a pubic health measure.",
    "And if he does, how do we combat it?” To which musician John Rich attempted to talk him off the ledge.",
    "Biden has no respect for human life period, whether they are American citizens or illegal aliens.",
    "Democrats from the beginning have not had one material complaint about the 2020 Election.",
    "But with all the theft, not one single complaint came from one party – the Democrats.",
    "One day I foresee citizens taking the problem and its solution into their own hands.",
    "McConnell wasn’t concerned about the well-being of President Trump or his family.",
    "'Did the Chinese government just gain a bit of leverage over the town square?",
    "McConnell wasn’t concerned about the well-being of the Capitol police.",
    "Your donation helps keep our discussions going and our voices heard.",
    "'Our thoughts and prayers remain with the family of the soldier.'",
    "It made my blood boil and it still does, just thinking about it.",
    "Those illegal aliens will continue to unlawfully enter the USA.",
    "The 2020 Election was the largest election steal in US history.",
    "Some are even seen wearing pro Biden t-shirts.",
    "It was a mess.",
    "Thank you."
  ]
}