{
  "id": 4913,
  "mediaId": 2562,
  "date": "2022-04-23",
  "headline": "Trump: JD Vance ‘a Guy That Said Some Bad Sh** About Me’",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid30DA7CA7-CB26-4721-AF0A-D86F0C9AD6F0.jpg",
  "link": "https://donaldjtrumppolls.com/trump-jd-vance-a-guy-that-said-some-bad-sh-about-me/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    2765,
    4306,
    976,
    1489,
    6474,
    6678
  ],
  "sentences": [
    "\"I'm very pleased to introduce the man with by far the best chance to defeat the radical Democrat nominee for the U.S. Senate this November,\" Trump told his Save America rally Saturday night in Delaware, Ohio, as he introduced Vance to his supporters.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nOriginal Article",
    "Vance, former President Donald Trump explained his controversial decision to back a candidate — \"a fearless MAGA fighter\" — that once was critical of Trump's presidential campaign in 2016.",
    "But Trump has long maintained those former critics who get on board with his America first, Make American Great Again campaign can become his staunchest political allies.",
    "The other top candidates in the Ohio Senate Republican primary had asked Trump to not take a side in the race, while all were vying for votes from Trump's supporters.",
    "Trump: JD Vance 'a Guy That Said Some Bad S**t About Me'\nBy Eric Mack | Saturday, 23 April 2022 08:14 PM\nStumping for Ohio GOP Senate primary candidate J.D.",
    "\"A lot of them said some really bad things, and ultimately I put that aside,\" Trump continued in the rally that aired live on Newsmax.",
    "In fact, if I went by that standard, I don't think I would have ever endorsed anybody in the country.\"",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "\"By the way, he's been like incredible … and so have the others, for the most part.",
    "\"He fights like crazy, and he loves Ohio; and he frankly, he's a great Buckeye.\"",
    "I guess, in all cases, the others have, but I have to do what I have to do.",
    "\"We have to pick somebody that could win, and this guy is he's tough.",
    "He's the guy that said some bad s**t about me.",
    "Every one of the others did also.",
    "102, Cox cable, Suddenlink Ch.",
    "He's a Yale-educated lawyer.\"",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "He's a former marine.",
    "But you know what?",
    "102, Mediacom Ch.",
    "615, Frontier Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "\"You know what?",
    "1220, FiOS Ch.",
    "He's smart."
  ]
}