{
  "id": 5071,
  "mediaId": 2596,
  "date": "2022-04-24",
  "headline": "Donald Trump brags about being ‘much smarter than radical left maniacs’ in bizarre speech",
  "image": "https://www.indy100.com/media-library/trump-brags-about-being-much-smarter-than-radical-left-maniacs-during-speech.jpg?id=29717537&width=1200&coordinates=0%2C1140%2C0%2C-3&height=600",
  "link": "https://www.indy100.com/politics/donald-trump-brags-smarter-radical-left-speech",
  "mediaOutlet": "indy100.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Trump brags about being ‘much smarter than radical left maniacs’ during speech\nRSBN\nDonald Trump took the opportunity to mention once again how he aced a cognitive test back in 2018 in his latest speech which he took to prove to he's \"much smarter\" than the \"radical left maniacs\", while revealing he doesn't like people calling him \"stupid.\"",
    "It\\u2019s called an X test\\u201dpic.twitter.com/JGVklls9ci\n— Acyn (@Acyn) 1650756758\nThe test which Trump took in the end was called Montreal Cognitive Assessment (MoCA), which didn't measure the former president's IQ, instead it looks for memory problems as well as any early signs of dementia.",
    "This appeared to irk Trump as he told Wallace he \"bet\" that he couldn't answer the last five questions as \"they get very hard\" and took a jab at his political opponent, the now-president Joe Biden who he thought \"could not answer these questions.\"",
    "It's not the first time Trump has blown his own trumpet when it comes to his test result, at a press conference in Florida on Thursday gave them a mention where he bizarrely said he'd rather be a dictator than a dumb person.",
    "Since then, Trump has been repeatedly bragging about his test score but in 2020 Fox News anchor Chris Wallace interviewed Trump and challenged him about the test's difficulty and told him it was \"not the hardest test.\"",
    "He then claimed he had a conversation with Republican Rep. Ronny Jackson - who was the White House physician when both Trump and former president Barack Obama were in office - about wanting to prove his intelligence.",
    "In November last year, 79-year-old Biden underwent his annual physical where his doctor, Dr. Kevin O'Connor said he remains \"fit for duty,\" CNN reported at the time.",
    "But of course, like in any speech he gives, Trump went on a tangent about himself when he told the audience: \"I don't like being called stupid.\"",
    "The former US president was on stage at a rally in Delaware, Ohio, to support and endorse his preferred Republican congressional candidate J.D.",
    "\"Is there a test or something I can take to prove to these radical left maniacs that are much smarter than them?\"",
    "Jackson who administered the test and revealed the then 71-year-old aced the test, scoring 100 per cent.",
    "Is there a test I can take to prove to these radical left maniacs that I\\u2019m much smarter than them?",
    "Click the upvote icon at the top of the page to help raise this article through the indy100 rankings.",
    "In his Saturday speech, Trump referenced the dictator comment he made.",
    "\"They say he's a dictator, he wants to take over the world.\"",
    "\"And you know, now, they don't call me stupid,\" Trump said.",
    "\"Perhaps a dictator would be better,\" he said at the time.",
    "Trump: I said.., I don\\u2019t like being called stupid.",
    "And he said \\u201cSir, there is a test.",
    "Trump said he asked the congressman.",
    "Have your say in our news democracy.",
    "\"I don't want to be a dumb person.\"",
    "Vance who is running for Senate."
  ]
}