{
  "id": 5074,
  "mediaId": 8455,
  "date": "2022-04-21",
  "headline": "J.D. Vance paid $70K by colleges he bashes as Senate candidate",
  "image": "https://www.toledoblade.com/image/2022/04/21/600x_q90_a4-3_cTCjpg/Election-2022-Senate-Ohio-38.jpg",
  "link": "https://www.toledoblade.com/local/politics/2022/04/21/jd-vance-paid-55k-by-colleges-he-bashes-as-senate-candidate/stories/20220421109",
  "mediaOutlet": "The Toledo Blade",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "",
  "termIds": [
    2765,
    3054,
    4306,
    1489,
    983,
    1126
  ],
  "sentences": [
    "During an appearance on CBS' “Sunday Morning\" in 2017, he complimented universities on providing “high-quality talent” and “intellectual property necessary for folks to get their businesses off the ground.” In his book, he recalled watching an episode of “The West Wing” about \"education in America, which the majority of people rightfully believe is the key to opportunity.”\nBut his rhetoric has hardened before the state’s May 3 primary as he courts conservative voters in a crowded GOP field.",
    "Vance's contract required “first-class private ground transportation” and “first-class hotel accommodations and meals.”\nTaylor Van Kirk, his campaign spokesperson, said the visits gave Vance “the opportunity to see first-hand how college campuses often punish free speech and diversity of thought in favor of a culture that is hostile towards American ideals.”\n“Thinking it’s hypocritical to speak on college campuses just because college professors are biased leftists is absurd,” she said.",
    "Although higher education was instrumental in his own success, Vance now accuses universities of pursuing “deceit and lies.” The shift underscores the extent to which Republicans are increasingly embracing anti-elite populism as they try to appeal to blue-collar voters who view institutions and intellectualism with skepticism.",
    "COLUMBUS — Before Republican JD Vance began targeting universities as the enemy of the conservative movement, the Donald Trump-endorsed U.S. Senate candidate in Ohio leveraged a network of higher education institutions across the country to promote his book — and he made money doing it.",
    "In endorsing him, Trump praised Vance's educational background, noting he is a Marine veteran of the Iraq War, \"a graduate of The Ohio State University, and earned a Law Degree from Yale — a great student.”\nTwo colleges refused to provide details about any payment to Vance.",
    "Ohio’s Marietta College hosted him a year later, but spokesperson Tom Perry declined to provide details to the AP, saying, “We are not going to share any of the contractual information.”\nSome colleges did not respond to records requests, including Pepperdine University.",
    "In the two years after the 2016 release of “Hillbilly Elegy,” his bestselling memoir of growing up in Appalachia, Vance visited at least 18 universities to give graduation speeches, lectures or political talks.",
    "“I think if any of us want to do the things that we want to do for our country and for the people who live in it, we have to honestly and aggressively attack the universities in this country,” he said.",
    "They’ll determine the direction of this country and they deserve better.”\nVance's largest payment was for a 2017 visit to Millikin University, a small private college in Decatur, Illinois.",
    "As he seeks the Senate seat, it’s another example of Vance’s transformation, from once entertaining the idea of supporting Hillary Clinton to now portraying himself as a loyal Trump ally.",
    "In November, shortly after entering the race, Vance laid out his line of attack during a 30-minute speech, “The Universities are the Enemy,” at the National Conservatism Conference.",
    "He ended his remarks with a quote by former President Richard Nixon: “The professors are the enemy.”\nAs he promoted his book, though, Vance was collecting checks from universities.",
    "Most of Vance’s college travels were for lectures, but he was honored as the keynote graduation speaker at Centre College in Kentucky and Zane State College in Ohio, both in 2017.",
    "His past anti-Trump statements have even prompted one conservative group, Ohio Value Voters, to urge a boycott of Trump's planned rally for Vance and others in Ohio on Saturday.",
    "That evolution has worried some Ohio Republicans, who urged Trump not to endorse Vance out of fear that the candidate would not connect with the party's core supporters.",
    "Records show that Vance flew in from Columbus a few hours before the event, was treated to dinner with students and faculty, gave his remarks and then flew back to Ohio.",
    "A foundation for Zane State College issued Vance a $7,000 check as an honorarium for the speech, but he never cashed it, college officials said.",
    "Two other schools — Bowling Green State University and West Virginia University — paid Vance a speaker fee of $15,500 each, the records showed.",
    "Many of them were in the Midwest and in conservative states, but some were Ivy League schools in liberal states, including Yale and Columbia.",
    "He was booked for an hourlong event that included a speech and brief discussion as part of a week of events exploring race and poverty.",
    "For those visits, Vance was paid more than $70,000, according to records provided to The Associated Press by the colleges.",
    "Monmouth College in Illinois, which hosted him in 2016, said it does not release financial details about campus speakers.",
    "Ohio State, Vance's undergraduate alma mater, hosted him in 2016 but says it has no record of a contract or payment.",
    "At the time, Vance, a graduate of Ohio State University and Yale Law School, spoke glowingly of education.",
    "During that visit, he gave a lecture, took questions and stayed for dinner and a reception, records show.",
    "A Millikin spokesperson said the college paid $10,000, while other local groups covered the remainder.",
    "For a 2017 political discussion at Purdue University, he received $800 for travel but no other fee.",
    "Records of any financial compensation Vance received for that were not immediately available.",
    "\"Engaging young people in these important discussions is exactly what we should be doing.",
    "Vance’s contract required a $20,000 fee and $1,000 in airfare, records show.",
    "Three days later, Vance was hosted by the University of Arkansas.",
    "The school also brought him on as a scholar in residence in 2017.",
    "His contract included a $13,000 fee and $850 in travel costs.",
    "Not all of his campus visits included speaker fees.",
    "First Published April 21, 2022, 9:01am"
  ]
}