{
  "id": 5127,
  "mediaId": 2862,
  "date": "2022-04-24",
  "headline": "Trump Mocks Gaffe-Riddled Biden: 'Shaking Hands With The Air, Taking Orders From Easter Bunny'",
  "image": "https://cdnn1.img.sputniknews.com/images/sharing/article/eng/1095005708.jpg?10950060661650798542",
  "link": "https://sputniknews.com/20220424/trump-mocks-gaffe-riddled-biden-shaking-hands-with-the-air-taking-orders-from-easter-bunny-1095005708.html",
  "mediaOutlet": "en.ria.ru",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Svetlana Ekimenko",
  "authorUrl": "",
  "termIds": [
    2765,
    4306,
    4905,
    5070,
    1234,
    6456,
    6474,
    6108,
    5925
  ],
  "sentences": [
    "Ex-POTUS Donald Trump visited Delaware County, Ohio for a rally 10 days ahead of the primary elections in the state, where he unleashed a tirade against Joe... 24.04.2022, Sputnik International\nhttps://cdnn1.img.sputniknews.com/img/07e6/04/18/1095006070_0:0:3073:1728_1920x0_80_0_0_91f64a4ac423ed50981edc9415a83b30.jpg.webp\nDonald Trump didn’t mince his words when he brought up several viral moments involving Joe Biden, recently captured on video, as he addressed an Ohio rally on Saturday.The former president, who was in the state to endorse a number of candidates before the primary election on 3 May, including Senate primary candidate JD Vance, questioned the 79-year-old president’s ability to lead the country, saying: Trump appeared to be referencing one of the latest apparent gaffe’s from the 46th POTUS, such as the one where a person dressed in an Easter Bunny costume seemed to direct a “confused” Biden who “wandered off” to take selfies with children at the White House Easter Egg Roll last week.Indeed, the commander-in-chief who, last November, underwent a medical examination that concluded his health did not impede his duties, often finds himself in awkward situations.",
    "Netizens weighed in on the tirade Trump unleashed against Biden at the Ohio rally on Saturday, with many yet again suggesting that “whoever is leading Biden around” should be charged with “elder abuse”.These remarks come in the wake of a recent incident when, after wrapping up his speech in the city of Seattle, Washington, on Friday, Biden said goodbye to his audience and turned around, appearing to extend his hand for a handshake to nowhere, in a bizarre repeat of what happened a week earlier.",
    "Biden even referred to himself on one occasion as a “gaffe machine”.A person in an Easter Bunny outfit interrupted Joe Biden’s comments at the White House's Easter egg roll on Monday.Biden, filmed speaking with reporters and guests, had begun discussing Afghanistan when Meghan Hays - a White House press official and director of message planning who was reportedly wearing the costume - broke in to usher him away, seemingly steering him away from another awkward moment.",
    "On 21 April, Joe Biden turned his own gaffe into a joke in an attempt to save face, as he seemed to struggle with pronouncing the surname of Earl Blumenauer, the Democrat representative of Oregon's third congressional district.",
    "After finishing his speech in the state of North Carolina on infrastructure reform, Joe Biden turned his back on the stage and held out his hand for an alleged handshake, although there was no one standing near him.",
    "Matt Whitlock, a former aide to Utah senator Orrin Hatch, tweeted about how the WH sent in the Easter Bunny to “interrupt whatever he was about to say on Afghanistan”.",
    "After the blunder, the president joked that the press may mispronounce his own name as well, saying that he could be called “Beedn” in response.",
    "Looking somewhat confused, Biden took a few steps near the podium, seemingly looking for a way to leave the stage.",
    "The video of the incident set off a Twitter typhoon among Republican supporters.",
    "."
  ]
}