{
  "id": 5157,
  "mediaId": 2621,
  "date": "2022-04-24",
  "headline": "Trump Crows About Acing ‘Quite Tough’ Cognitive Test in 2018: ‘I Don’t Like Being Called Stupid’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-24-at-9.44.58-AM.jpg",
  "link": "https://www.mediaite.com/trump/trump-crows-about-acing-quite-tough-cognitive-test-in-2018-i-dont-like-being-called-stupid/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Meyer",
  "authorUrl": "https://www.mediaite.com/author/ken-meyer/",
  "termIds": [
    4992,
    4905,
    4306,
    2765,
    6107
  ],
  "sentences": [
    "'”\nTrump described the test as “the first questions are easy, the middle of the test gets tough, and the end of the test is quite tough.”\nSince 2020, Trump has repeatedly boasted that he took the Montreal Cognitive Assessment (MOCA).",
    "At another point in the rally, Trump complained about people who call him “stupid,” so he recalled a conversation he had with former White House Chief Medical Adviser-turned-Congressman Ronny Jackson (R-TX).",
    "It should be noted, however, that the exam doesn’t measure a person’s IQ, but tests them for signs of dementia with very simple questions for people with full cognitive ability.",
    "Subscribe to\nFormer President Donald Trump took time to brag (once again) that he passed a test meant to evaluate whether a person is in cognitive decline.",
    "Chris Wallace asked him about the test during a 2020 interview, and the former Fox News host pointed out its “not the hardest test” to pass.",
    "Trump held a rally in Delaware, OH on Saturday, where he defended his endorsement of Ohio Senate candidate and his one-time critic, J.D.",
    "Is there a test I can take to prove to these radical Left maniacs that I’m much smarter than them?” Trump said.",
    "This led to Trump taking swipes at the mental capacity of his future-successor: President Joe Biden.",
    "“I don’t like when people call me stupid.",
    "“And he said ‘Sir, there is a test.",
    "Have a tip we should know?",
    "Want to avoid video ads?",
    "Watch above, via RSBN.",
    "It’s called an X test.",
    "tips@mediaite.com",
    "Vance."
  ]
}