{
  "id": 5166,
  "mediaId": 2664,
  "date": "2022-04-24",
  "headline": "Evangelicals and 'Christian righteousness' power Trump's delusions of election fraud: NYT",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=24979352&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/trump-evangelicals-2657206788/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    2765,
    2969,
    4905,
    1339
  ],
  "sentences": [
    "\"Mr. Locke — whose congregation is relatively small, but who claims a social media audience in the millions — is one of more than a dozen pastors who have appeared onstage at the ReAwaken America Tour: a traveling roadshow that has featured far-right Republican politicians, anti-vaccine activists, election conspiracists and Trumpworld personalities, including Lt. Gen. Michael Flynn, a central figure in the effort to overturn the election in late 2020.\"",
    "A poll released in November by the Public Religion Research Institute found that 60 percent of white evangelical respondents continued to believe that the election was stolen — a far higher share than other Christian groups of any race,\" the newspaper reported.",
    "Thousands of Christian nationalists gathered at Oral Roberts University Thursday night for an special \"Flashpoint\" broadcast that featured multiple rants about how the 2020 election was supposedly stolen from Trump, such as this one from host Gene Bailey.",
    "\"Shortly after the election was called for Mr. Biden, Paula White, a Florida televangelist who served as the White House faith adviser during Mr. Trump’s presidency, led a prayer service in which she and others called upon God to overturn the election.\"",
    "\"They have opened their church doors to speakers promoting discredited theories about overturning President Joe Biden’s victory and lent a veneer of spiritual authority to activists who often wrap themselves in the language of Christian righteousness.",
    "Mr. Locke offered a prayer for the Proud Boys, the violent far-right group, and for Enrique Tarrio, the organization’s leader who has since been indicted on charges of conspiracy for his role in the Capitol insurrection,\" the newspaper reported.",
    "\"Greg Locke, a preacher who leads the Global Vision Bible Church in Mount Juliet, Tenn., spoke alongside Alex Jones of Infowars at a 'Rally for Revival' demonstration in Washington the night before the Jan. 6 attack.",
    "At a rally earlier this month in Michigan, the opening prayer was given by a preacher claiming, \"Father in heaven, we firmly believe that Donald J. Trump is current and true president of the United States.\"",
    "As Donald Trump continues to lie about the 2020 election he lost, his conspiracy theories are finding a home in some white, Evangelical churches, The New York Times reported Sunday.",
    "\"Evangelical churches have long been powerful vehicles for grass-roots activism and influence on the American right, mobilized around issues like abortion and gay marriage.",
    "\"Still, surveys show that the belief in a fraudulent election retains a firm hold on white evangelical churchgoers overall, Mr. Trump’s most loyal constituency in 2020.",
    "Now, some of those churches have embraced a new cause: promoting Donald J. Trump’s false claim that the 2020 election was stolen,\" the newspaper reported.",
    "For these church leaders, Trump’s narrative of the 2020 election has become a prominent strain in an apocalyptic vision of the left running amok.\"",
    "https://bit.ly/3L49yp0\\u00a0pic.twitter.com/CiaNbDvNVH\n— Right Wing Watch (@Right Wing Watch) 1650654048",
    "Trump repeatedly pushed his \"big lie\" of election fraud at a Saturday rally with J.D.",
    "One prominent evangelical pastor has ties to Jan. 6.",
    "Vance in Ohio."
  ]
}