{
  "id": 5212,
  "mediaId": 2618,
  "date": "2022-04-19",
  "headline": "J.D. Vance, You’re Hired",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/19/jd_vance_youre_hired_83530.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sohrab Ahmari",
  "authorUrl": "",
  "termIds": [
    2765,
    3387,
    4187,
    4267,
    5148,
    4306,
    4794,
    2736,
    1489
  ],
  "sentences": [
    "In an effort to “honestly and respectfully” express how he feels about what is going on with the Disney company’s management, one dad’s hand-made T-shirt caused quite a stir at “the happiest place on earth.” (Snip) On the back, Geffers wrote “Hello Boys and Girls, Ladies and Gentlemen.” On the front, he wrote, “Walt Not Woke.” While he wasn’t sure how people were going to respond, Geffers said he needed to do something to express how he felt about what was going on at “the happiest place on earth.” On the first day, Geffers and the rest of his entourage went to Disney’s Magic Kingdom.",
    "(Snip) Horowitz takes us to the Sixties, as it were, by way of the Nineties, thereby shedding light on the process by which many of the intellectuals, rabble-rousers, and outright gangsters\nWhen the Soviet communists’ hammer-and-sickle flag was lowered at the Kremlin for the last time on Dec. 25, 1991, some said that the last refuge of Marxism was in the academic institutions of the West.",
    "In that He's like who he hopes to replace, Rob Portman, and for that matter a number of the GOPe members of the Senate (McConnell, Graham, etc) who suddenly turn right 12-18 months before the end of their current terms in order to show that they've \"felt the heat and seen the light\" (hat tip to the late Everett Dirksen) and fool some of the people some of the time.",
    "Vance really is, read his book, it's an excellent portrayal of American life in Appalachia with nothing held back - the guy is real, flesh and blood American and he deserves to be a Senator from Ohio - everything he got in life, he worked for and deserves, especially a win for a Senate seat representing Ohio\nThanks, #2.",
    "In response to my latest whistleblower request, I received the following message from a doctor which I wanted to share with you: I have had some contact with people who would fit your search - however, it appears they are unwilling to share information because of the danger of offering the information.",
    "As the Biden White House rushes to enable Iran's nuclear program and the modern day pharaonic mullahs plotting, like the original, to wipe out the Jews, it put on a \"People's Seder\" to distract American Jews\nThe CDC just decided to continue the transportation mask mandate for another two weeks.",
    "These are criminals we’re faced with:\nTucker Carlson opened his show on Monday night with the story of the mass lockdown in Shanghai, with more than 24 million people turned into starving prisoners in their homes, as the government adds in the singular cruelty of slaughtering their pets.",
    "\"Job posting: The Washington Post is looking for an enterprising reporter based in Texas to document life in red state America and develop a new beat mapping the culture, public policies and politics in a region shaped by conservative ideology,\" the Washington Post PR tweeted.",
    "That’s the story behind what investigations of Election 2020 are documenting—the coup against Trump was enabled in no small part not only by DC Establishment GOPers\nHave you ever wondered why the corruption in the CDC hasn’t been exposed by whistleblowers?",
    "To return to this book today is to recognize that it could’ve been published yesterday, for the issues it addresses are now even more urgent, and the bizarre ideological tendencies now even more extreme than they were then.",
    "A third, Clemson University, narrowly escaped getting hit with a similar type of judgment\nFormer President Donald Trump made the most courageous decision of his post-presidency so far by endorsing J.D.",
    "That totalitarian ideology has infected American colleges and universities and other institutions that are purveying cancel culture, wokeism, censorship, and gender dogma that rejects reality.",
    "And two colleges—Oberlin College and Shawnee State University—recently got exactly what they deserve: large legal judgments against them for defamatory and discriminatory misbehavior.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "The GOP-E preference, we’ve been told, based on fairly indisputable evidence, is to manage the devolution of America into a Social Democrat utopia—managers of the Revolution.",
    "opinion\nWe wrote previously about the Swedish study (University of Malmo) that concluded that Pfizer’s mRNA injections do, in fact, alter human DNA—reverse transcription.",
    "The sign language interpreter on the small box next to him spread her arms in what was either an attempt to 'sign' Passover or a gesture of disbelief and contempt.",
    "Instead, it proves that the CDC, Wachter, and most mainstream scientists (who claim masks work) are incapable of differentiating solid science from a sloppy study.",
    "\"Good evening to the thousands of you who are joining us from around the country,\" Doug Emhoff, the Hollywood lawyer serving as Kamala's husband, intoned.",
    "But unfortunately, there are still a number of bills and regulatory policies pending that could change the very nature of a pandemic response worldwide.",
    "the Bushies have people everywhere, beholden to them because of political employment to get running for those incumbent RINO seats like Portman’s.",
    "There have been only two randomized trials to test whether public policy using masks to mitigate the spread of SARS-CoV-2 can reduce the spread.",
    "The Washington Post PR team posted a link to a job listing site to advertise for a reporter in Texas to track and document conservative culture.",
    "For the discontent that propelled Trump to the White House in 2016 to be addressed, Vance must find his way into the halls of the Senate.",
    "For the discontent that propelled Trump to the White House in 2016 to be addressed, Vance must find his way into the halls of the Senate.",
    "The real goal is to bring the citizens of Shanghai to heel lest they start to pose a threat to Xi Jinping’s and the Party’s dominance.",
    "What could be very interesting about this is that it seems these results are caused by the injections, rather than the virus itself.",
    "For a couple of years toward the end of the last century, David Horowitz contributed a regular column to the online magazine Salon.",
    "And they’ve been paid well to take on that role, so it’s small wonder that so much of the GOP-E were frankly appalled at winning.",
    "Could we expect lock downs, masks, mandatory vaccination, censorship, propaganda and social distancing as seasonal events?",
    "Vance is an authentic representative of America’s populist tradition, contending against a field of establishment phonies.",
    "(Snip) The Vance I’ve gotten to know over the past few years has something few politicians possess: namely, depth of soul.",
    "(Snip) The Vance I’ve gotten to know over the past few years has something few politicians possess: namely, depth of soul.",
    "Vance is an authentic representative of America’s populist tradition, contending against a field of establishment phonies.",
    "He's smart enough to realize that he has to distance himself from the GOPe if he ever hopes to advance a political career.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "We have started to be wary when they all of a sudden awaken to appreciating Trump WHEN they lust for a Senate seat.",
    "(Snip) However, here’s a video embedded in a tweet that features Dr. Peter McCullough discussing the implications.",
    "I read Vance's book and noted that he was especially in awe of several Bushie people (Mitch Daniels is his bero).",
    "We have a client whose daughter had worked for the CDC but refused to sign an agreement to withhold information.",
    "Conservatives called out the post for appearing to treat Texas as a different country for its conservative lean.",
    "Former President Donald Trump made the most courageous decision of his post-presidency so far by endorsing J.D.",
    "I am voting for Josh Mandel, because when he was Ohio Treasurer he opposed John Kasich on Medicaid expansion.",
    "The \"People's Seder\" was about to begin with its apostrophe in the right place and heart in the wrong place.",
    "Policy that would allow public health to easily gain control of government during a bio-threat emergency.",
    "Comments:\nThe last time I posted about Vance, there were a lot of comments about his being anti-Trump.",
    "I've seen Vance's name in various stories for quite a while, but never bothered to pay much attention.",
    "The Washington Post faced backlash on Tuesday for what many saw as a bizarre job posting on Twitter.",
    "What happens when emergency powers are written so that they can be granted for a severe flu season?",
    "Vance is a political chameleon, able to change color as necessary to match the political zeitgeist.",
    "I believe he has more integrity, courage, and smarts than most politicians and I hope he makes it.",
    "We challenged Yale Professor Jason Abaluck, the first author of that study, to defend their study.",
    "In 1999 he gathered those columns in a book entitled Hating Whitey and Other Progressive Causes.",
    "Dr. Bob Wachter, Chair of the Department of Medicine at UCSF, concurs with the CDC decision.",
    "Can any of Vance’s supporters point us to WHEN Vance publicly came out supporting Trump?",
    "The video is only two minutes long, but it’s couched in readily understandable language.",
    "I admire his overcoming his background, but that doesn't mean he is senatorial material.",
    "The GOP-E is notoriously skittish about the Culture War that’s been raging in America.",
    "It wasn’t just Trump—it was all the deplorables coming out, getting involved, voting.",
    "I'm glad I don't have to make the decision to vote for him because it would be tough.",
    "He was against Trump until he realized that would work against him in his quest (for?",
    "PDT's endorsement certainly requires a close look, but I don't know where to start!",
    "I wish I had done so because now I'm having a heck of a time sorting it all out.",
    "But he paid attention to reality, turned his opinion around, and *apologized*.",
    "This is ostensibly in the name of a “Zero COVID” policy, but that’s nonsense.",
    "We’ve learned a lot about COVID since China released it to the world in 2019.",
    "Policy that might allow public health to be weaponized for other purposes.",
    "There has been some good news on the legislative front in the past week.",
    "That meant he was hanging around with elitists, and I think he loves it.",
    "Being on Tucker's show all the time must boost his ego something fierce.",
    "It’s most dangerous to the very elderly and those with comorbidities.",
    "(Snip) But the second one, in Bangladesh, claimed that masks worked.",
    "Your donation helps keep our discussions going and our voices heard.",
    "He has said all along he believes the 2020 election was stolen.",
    "Was it when he was about to announce his run or after he did?",
    "What happens when there is civil unrest and these measures",
    "She left her job and fled to an undisclosed location in .",
    "Because it's difficult to get rid once they're in there.",
    "(Snip) She feared for her life and her family's lives.",
    "He seems like the best option, but I do not trust him.",
    "But students, parents, and others are fighting back.",
    "), and so he changed his mind and said (pretended?)",
    "He's a Fox contributor and I imagine he will win.",
    "He works for a hedge fund in Columbus, or did.",
    "Vance for the GOP Senate Primary in Ohio.",
    "Vance for the GOP Senate Primary in Ohio.",
    "And thanks to Don’s nod, he likely will.",
    "And thanks to Don’s nod, he likely will.",
    "And it is stunning in its implications.",
    "A disclosure: Vance and I are friends.",
    "A disclosure: Vance and I are friends.",
    "This seems to be recurrent theme here.",
    "This doesn’t prove that masks work.",
    "One Rob Portman was enough.",
    "Its happening with Oz too.",
    "It's all so discouraging.",
    "So tired of being fooled.",
    "Indeed he was, at first.",
    "for an idea who J.D.",
    "\"Oh, he's changed!",
    "He gets it now!.\"",
    "he was for Trump.",
    "\"Is this a joke?\"",
    "The whole thing.",
    "They were right.",
    "No, he doesn't.",
    "Thank you."
  ]
}