{
  "id": 5238,
  "mediaId": 2618,
  "date": "2022-04-22",
  "headline": "J.D. Vance takes center stage ahead of Trump visit",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/22/jd_vance_takes_center_stage_ahead_of_trump_visit_83768.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Evans",
  "authorUrl": "",
  "termIds": [
    5613,
    2765,
    4306,
    483
  ],
  "sentences": [
    "“The idea that my son can engage in conversations that are that mature, is really ridiculous.” ~~~ This article was posted as “informational” for Ohio voters who are, understandably, skeptical of J. D. Vance’s about-face regarding his support for President Trump—for which only time will tell; however, J. D. Vance grasps the seriousness of indoctrinating children with the sexual perversions of Leftists and, therefore, offers a glimmer of hope that he would stand firm in supporting measures to protect children from such a dangerous and immoral agenda.",
    "“and they’ll be the first to tell you it’s unsafe, and it’s unreasonable to expect our young girls to participate against people who have been through puberty.” Vance also addressed so-called “don’t say gay” legislation, zeroing in on the provision that teacher can’t address gender or sexual identity at all for grades K-3.",
    "In his own words: “I am 100 percent pro-life, and believe that abortion has turned our society into a place where we see children as an inconvenience to be thrown away rather than a blessing to be nurtured.",
    "Eliminating abortion is first and foremost about protecting the unborn, but it's also about making our society more pro-child and pro-family.”",
    "But instead of dismissing the idea that people can be trans, he offered the first glimpse of a potential bid to win over more moderate voters.",
    "Simply as “informational” and not to be misconstrued as an endorsement for J. D. Vance, it should be noted that “J.",
    "“Look, I’ve got friends of mine who have kids who are going through gender identity problems,” Vance said.",
    "FTA: On the issue of transgender participation in sports Vance took the party line in opposition.",
    "D. Vance is 100% pro-life” and has the endorsement of the Ohio Right to Life Society.",
    "Right?” Vance went on to explain that his son will be in kindergarten next year.",
    "“My son wakes up and thinks that he’s a dinosaur, right?” Vance asked.",
    "“We’re talking about 5, 6, 7, 8-year-old kids,” he said.",
    "“That seems like a pretty good idea."
  ]
}