{
  "id": 5253,
  "mediaId": 2562,
  "date": "2022-04-19",
  "headline": "JD Vance to Newsmax: Trump Wants Candidates With an America First Plan",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid5BC3D291-C0CF-44F9-BB97-114E817D5361-1.jpg",
  "link": "https://donaldjtrumppolls.com/jd-vance-to-newsmax-trump-wants-candidates-with-an-america-first-plan-2/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "Trump endorsed Vance over several other powerful Republicans vying for the party nomination to replace Republican Rob Portman, including Mike Gibbons, a Cleveland entrepreneur, real estate developer, and investment banker who co-chaired the fundraising for Trump's 2016 Ohio campaign; former Ohio treasurer Josh Mandel; and former Ohio Republican Party Chair Jane Timken.",
    "\"I think because they feel like the debates haven't been that good for them, and they've been good for me … but we've done 55 town halls across the state of Ohio in just the last 2½ months, so I don't think you have to prepare for it other than by being your honest self and actually saying, look, this is how I think about the issues.",
    "However, the \"Hillbilly Elegy\" writer said on Newsmax's \"Wake Up America\" that such endorsements don't mean Trump is looking for someone who just repeats his slogans, but that he \"cares about substance\" and wants \"somebody with a plan to put America first.\"",
    "Vance, who former President Donald Trump has endorsed in Ohio's GOP primary race for the Senate, said Tuesday on Newsmax that the backing is very important, as people still \"really love\" Trump and see his endorsement as a \"mark of approval.\"",
    "\"Because we actually had substance, because we actually had ideas, we were able to earn the president's support,\" said Vance, who on Monday began a statewide ad campaign featuring the much-coveted Trump endorsement.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nOriginal Article",
    "The statewide primary election is on May 3, and Wednesday night, Newsmax host Rob Schmitt will host a candidates' town hall in Independence, Ohio, which Trump's son, Donald Trump Jr., is expected to attend.",
    "Vance said he's excited about Schmitt being at the event, \"because, you know, we do these town halls and sometimes you get 15 people, but with Newsmax there, we're going to have a lot of people.",
    "\"I think because of it, we're going to win this race … President Trump said that you're 'our best chance for victory' in what could be a very tough race.\"",
    "Vance also calls himself a \"conservative outsider,\" and noted that \"we've had some conservative outsiders in the past deliver big on promises.\"",
    "\"I think a lot of conservatives actually saw the president in action and importantly, solving the incredible corruption that came against him.",
    "I've never seen a political leader in my life where so many powerful people tried to destroy him and tried to destroy his family.\"",
    "\"We were going to do this as a debate, of course, but none of the other candidates wanted to do it,\" Vance said Tuesday.",
    "Vance of Ohio (Getty Images)\nBy Sandy Fitzgerald | Tuesday, 19 April 2022 11:00 AM\nAuthor and venture capitalist J.D.",
    "Since then, Vance said he's become a \"great advocate\" of what Trump talks about and what he's trying to accomplish.",
    "I think people will hopefully come away impressed with what I think I can accomplish in the U.S. Senate for them.\"",
    "Some of the other candidates in the race tried to stop the endorsement based on Vance's past anti-Trump stance.",
    "Vance admitted that he \"wasn't a big Trump guy\" in 2016, as he didn't expect him to deliver on his promises.",
    "JD Vance to Newsmax: Trump Wants Candidates With an America First Plan Senate Republican candidate J.D.",
    "State Sen. Matt Dolan, a former state assistant attorney general, did not seek Trump's endorsement.",
    "\"I think one of the things our politics needs is somebody with a fresh set of eyes,\" he said.",
    "Meanwhile, the former president will also be in Ohio for a rally Saturday, Vance noted.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "It's going to be a packed house tomorrow night.\"",
    "\"I was very proud to be proven wrong,\" he said.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "102, Mediacom Ch.",
    "615, Frontier Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}