{
  "id": 5304,
  "mediaId": 2621,
  "date": "2022-04-21",
  "headline": "Conservative Group Asks Ohio Republicans to Boycott Trump Rally Over ‘Wrong’ Endorsement",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/02/Screen-Shot-2022-02-27-at-8.30.46-AM-e1650587779839.jpg",
  "link": "https://www.mediaite.com/politics/conservative-group-asks-ohio-republicans-to-boycott-trump-rally-over-wrong-endorsement/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kipp Jones",
  "authorUrl": "https://www.mediaite.com/author/kipp-jones/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Booing is entirely appropriate!”\nThe nonprofit, which has endorsed Mandel in the race, called Trump’s endorsement of Vance “terrible.”\n“This can only be attributed to very poor advice from people around the former President,” the group said.",
    "However, no one at that time, used the vile and derogatory comments against Donald Trump as JD Vance.”\nThe group concluded by sharing comments Vance made about Trump in 2016 and 2017.",
    "A conservative non-profit in Ohio has asked Republicans in the state to boycott a rally to be hosted by former President Donald Trump this weekend over his endorsement of J.D.",
    "However, it you decide to attend, when President Trump introduces JD Vance, make your voices heard by letting Trump know, JD Vance is Wrong for Ohio,” the group stated.",
    "On Thursday, the group Ohio Value Voters was so incensed by Trump’s endorsement of Vance that it asked Republicans to “boycott” his Saturday rally.",
    "Trump will appear in Delaware, Ohio on Saturday, just ahead of the May 3 GOP primary to choose a nominee who will try to replace outgoing Sen.",
    "Ohio Republicans asked Trump to stay out of the race, but he endorsed Vance last week to the chagrin of many conservatives across the state.",
    "“At the start of the primary, there were many of us in 2016, which supported another candidate for President and not Donald Trump.",
    "The primary has seen candidates Josh Mandel, Mike Gibbons, Jane Timken, Vance and others face off in a contentious race.",
    "The former president acknowledged that prior to his Senate campaign, Vance had made negative comments about him.",
    "“Ohio Value Voters urges Ohioans to boycott the Trump Rally in Delaware County this Saturday, April 23rd.",
    "Vance previously called Trump everything from an “idiot” to a “racist.”\nHave a tip we should know?",
    "With voting to take place next month, Trump’s endorsement has been a source for division.",
    "Nonetheless, he said Vance offers the GOP the best chance to retain Portman’s seat.",
    "Rob Portman (R-OH).",
    "tips@mediaite.com",
    "Vance."
  ]
}