{
  "id": 5412,
  "mediaId": 2621,
  "date": "2022-04-18",
  "headline": "Trump Backed Candidate J.D. Vance Reportedly Suggested Former President is ‘America’s Hitler’ in Newly Leaked Texts",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/04/GettyImages-1239921867-scaled-e1650311749681.jpg",
  "link": "https://www.mediaite.com/politics/trump-backed-candidate-j-d-vance-reportedly-suggested-former-president-is-americas-hitler-in-newly-leaked-texts/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Leia Idliby",
  "authorUrl": "https://www.mediaite.com/author/leia-idliby/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We are, whether we like it or not, the party of lower-income, lower-education white people, and I have been saying for a long time that we need to offer those people SOMETHING (and hell, maybe even expand our appeal to working class black people in the process) or a demagogue would.”\nVance went on to call Trump “the fruit of the party’s collective neglect,” referring to the GOP, adding, “I go back and forth between thinking Trump is a cynical asshole like Nixon who wouldn’t be that bad (and might even prove useful) or that he’s America’s Hitler.",
    "How’s that for discouraging?”\nIt’s not news that Vance was once a Trump critic — a fact that has been hunting him throughout his Senate campaign — but comparing him to Adolf Hitler is a recent development.",
    "pic.twitter.com/79Z0qSWFWF\n— Josh McLaurin (@JoshforGeorgia) April 18, 2022\n“But I’m not surprised by Trump’s rise, and I think the entire party has only itself to blame,” Vance reportedly wrote.",
    "The screenshot below is @JDVance1’s unfiltered explanation from 2016 of the breakdown in Republican politics that he now personally is trying to exploit.",
    "Vance, who received a recent endorsement from Donald Trump, reportedly suggested the former president could be “America’s Hitler” in newly leaked texts.",
    "Vance’s former college roommate and Georgia politician Josh McLaurin (D) shared a screenshot of a supposed conversation the two had in 2016.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,” Trump said.",
    "“He is our best chance for victory in what could be a very tough race.”\nHave a tip we should know?",
    "Trump even took note of Vance’s past critiques while endorsing the Ohio Senate candidate.",
    "The public deserves to know the magnitude of this guy’s bad faith.",
    "Senate candidate and Hillbilly Elegy author J.D.",
    "The “America’s Hitler” bit is at the end.",
    "“Like some others, J.D.",
    "tips@mediaite.com"
  ]
}