{
  "id": 5456,
  "mediaId": 881,
  "date": "d2022-05-19T14:17",
  "headline": "Trumps Big Lie Made It Easier for Racists to Sell Great Replacement Theory",
  "image": "https://video-images.vice.com/articles/62864aa3e00d0400942a9730/lede/1652969811747-gettyimages-1239538456.jpeg?crop=1xw:0.8425xh;0xw,0.0711xh&resize=20:*",
  "link": "https://www.vice.com/en_us/article/xgdnk7/great-replacement-theory-the-big-lie",
  "sentiment": "0",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron Joseph",
  "authorUrl": "https://www.vice.com/en/contributor/cameron-joseph",
  "termIds": [
    1147,
    1341,
    2087,
    3103,
    146,
    428,
    571,
    2945,
    4938
  ],
  "sentences": [
    "Their plan to grant amnesty to 11 MILLION illegal immigrants will overthrow our current electorate and create a permanent liberal majority in Washington.?\nShe didnt back down in the wake of the Buffalo shooting, tweeting earlier this week that it is a FACT that DEMOCRATS have been explicitly pushing for amnesty for years  specifically for political and electoral purposes.?\nTexas GOP Rep. Ronny Jackson, Trumps former White House physician, tweeted earlier this year that In 2022, illegal immigrants will have MORE FREEDOMS and easier access to healthcare and ballot boxes than most Americans.?\nHouse GOP Reps. Scott Perry of Pennsylvania and Matt Gaetz of Florida, two of the loudest defenders of the big lie,? have also loudly pushed great replacement rhetoric.",
    "Every time MAGA Republicans or pundits vilify, wrongly, immigrants and call them invaders, every time they falsely claim that millions of undocumented people cast ballots in our elections, every time loud, bigoted voices bemoan the disintegration of an imagined classic America, the subtext is clear.?\nFormer President Donald Trump, of course, has played a key role in mainstreaming these ideas.",
    "Many of the same Republicans who are pushing the falsehood that Democrats want an immigrant invasion to overwhelm traditional? voters and take over the countrytheir version of the great replacement theory? that seemingly inspired the Buffalo shooter to kill 10 people last weekendhave been leading proponents of conspiracy theories about the 2020 election.",
    "In terms of the 2020 election and the big lie, it's partially based on the idea that there were possibly undocumented immigrants who voted in the election.?\nThis claim also patches over a logical gap in the great replacement theory? which ignores the reality that neither legal nor undocumented immigrants can vote in federal and state elections.",
    "Arizona state Sen. Wendy Rogers, who played a key role in her states sham election audit,? last year, tweeted last summer that we are being replaced and invaded.?\nArizona GOP Senate candidate Blake Masters has pushed great replacement theory claims for monthsand doubled down on his rhetoric in the wake of the Buffalo massacre.",
    "With each passing year, it seems harder and harder to ignore that the echoes of replacement theory and other racially motivated views are increasingly coming out into the open and giving purported legitimacy by some MAGA Republicans and cable news pundits,? Schumer warned in a Monday Senate floor speech.",
    "While big lie? proponents have pushed a variety of false claims about how the last election was supposedly stolen, one key claim pushed by Trumps team and other top GOP officials is that scores of undocumented immigrants illegally voted in the 2020 election, swinging the election to President Biden.",
    "Many also believe in central tenets of the GOPs version of the great replacement theory.? According to a recently released AP-NORC poll, one-third of Americans and almost half of Republicans believe that immigrants are being brought to the country by a group of people for political gains.",
    "Thats what this is about,? Vance told Fox News Tucker Carlson in mid-March, calling it evil.?\nCarlson, who played a central role both in popularizing conspiracy theories about the 2020 election and mainstreaming great replacement? rhetoric for conservatives, seemed pleased.",
    "Theres evidence that both this theory and a belief that the 2020 election was stolen from Trump have become entrenched in the minds of the hard-right GOP baseand that people who believe in the great replacement theory are much more likely to buy lies about the election.",
    "Trump campaign attorney and former New York City Mayor Rudy Giuliani claimed at a Stop the Steal? meeting in Phoenix in late November that there were 5 million illegal aliens? living in Arizona (thats almost the whole state population, and 20 times the real estimate).",
    "They vote many times, not just twice, not just three times.?\nTrump and his allies largely have pivoted to other false voter-fraud claims for 2020, focusing more on false claims of vote machine tampering and mail ballot stuffing.",
    "The original white supremacist theory claims that a wave of non-white immigrants are trying to replace white, native-born citizens in the U.S. and Europe by flooding into those countries and outbreeding the native population.",
    "And fully two-thirds of the Republicans who believe the election system is rigged against white voters also believe in the great replacement theory, according to previous poll crosstabs AP-NORC pulled for VICE News.",
    "In their eyes, its not just that Democrats want a flood of new immigrants to change the demographics of the country and eventually help their electoral chances down the line; they claim that its already happened.",
    "The conservative think tank? Just Facts Daily published a piece shortly after the 2020 election claiming, with no actual evidence, that nearly a quarter-million undocumented immigrants voted in the swing states.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "And in recent months, numerous Republicans have moved more explicitly into great replacement theory? claims to say Democrats are aiming for an immediate power grab by importing undocumented immigrants.",
    "Shortly after he was sworn into office, he falsely claimed to lawmakers that between 3 million and 5 million undocumented immigrants had illegally voted, costing him a majority in the popular vote.",
    "The mainstreamed version of the great replacement theory? isnt exactly the same as the one pushed by avowed white supremacists and neo-Nazis that the Buffalo shooter cited as inspiration.",
    "Those allegations make the claims pushed by those Republicans and conservatives who are pushing great replacement theory? all the more potentand fills in a gap in their reasoning.",
    "The more-mainstream Republican version swaps out Jews for Democrats, and instead of arguing their aim is total societal replacement, they say its all about political domination.",
    "After 18 months of work pushing the idea that widespread voter fraud may have occurred in 2016, the commission quietly disbanded without producing any evidence of such fraud.",
    "There is a connection between the great replacement theory and the big lie,? said Marilyn Mayo, a senior research fellow at the Anti-Defamation Leagues Center on Extremism.",
    "Democrat politicians who have decided that they cant win reelection in 2022 unless they bring in a large number of new voters to replace the voters that are already here.",
    "In the wake of the Buffalo massacre, Senate Majority Leader Chuck Schumer made the connection between the two conspiracy theories and how theyve been mainstreamed.",
    "New York Republican Rep. Elise Stefanik, the third-ranking House Republican, drew a straight line between the two conspiracy theories in a Facebook ad last fall.",
    "A years-old meme went viral once again on Facebook and Instagram last summer that claimed that 22 million illegal aliens living in America? had illegally voted.",
    "The Democrats want open borders so they can bring in and amnesty tens of millions of illegal aliensthats their electoral strategy,? Masters tweeted on Sunday.",
    "Its worth noting that when Republicans singled out areas where they claimed vote-rigging was happening, they were almost always minority-heavy cities.",
    "Vance recently claimed Democrats couldnt win in this falls election unless they encourage an invasion? of immigrants and have them immediately vote.",
    "The poll also shows how Americans who watch conservative TV like Fox News, Newsmax, and OANN are much more likely to believe these theories.",
    "They attacked Milwaukee, home of a large Black population, more often than mostly white Madison, Democrats largest trove of votes.",
    "But the idea that undocumented immigrants had swung the election against him has continued to percolate within the GOP base.",
    "Polls have consistently shown that nearly 60 percent of Republican voters think the 2020 election was stolen from Trump.",
    "Dont kid yourself,? he said in April 2019. Those numbers in California and numerous other states, theyre rigged.",
    "Radical Democrats are planning their most aggressive move yet: a PERMANENT ELECTION INSURRECTION,? read her ad.",
    "Trump was so obsessed with this idea that he created a voter fraud commission to find the widespread fraud.",
    "Masters is just one of a half-dozen GOP Senate candidates who have been pushing this conspiracy theory.",
    "Trump spent years alleging that undocumented immigrants voted in huge numbers, hurting Republicans.",
    "Half of Republicans also believe the U.S. election system discriminates against white Americans.",
    "Many versions of the theory say its orchestrated by a secret cabal of wealthy elitesoften Jews.",
    "If you claim huge numbers of them are already voting illegally, those facts dont matter.",
    "And the Americans who believe the former claim are much likelier to believe the latter.",
    "Leading members of the Grand Old Party are weaving a grand unified conspiracy theory.",
    "It is beyond credulity that a few hundred thousand didnt vote,? he insisted.",
    "That shows how closely the two groups of conspiracy theorists overlap.",
    "Those illegals get out and vote, because they vote anyway.",
    "Theres a direct line between the two conspiracy theories.",
    "But that didnt stop Trump from pushing this conspiracy.",
    "Theyve got people voting that shouldnt be voting.",
    "They went after minority-majority Philadelphia.",
    "I couldnt agree with you more,? Carlson said.",
    "They attacked Black-majority Detroit.",
    "Republican Ohio Senate nominee J.D."
  ]
}