{
  "id": 5463,
  "mediaId": 136,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Steve Schmidt Discusses Violent Extremism, the GOP and John McCain",
  "image": "https://d.newsweek.com/en/full/2040387/steve-schmidt-john-mccain-gop.webp?w=790&f=655ff48590842adfb731af5a8f158e60",
  "link": "https://www.newsweek.com/steve-schmidt-gop-violent-extremism-john-mccain-1707898",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maura Currie",
  "authorUrl": "https://www.newsweek.com/authors/maura-currie",
  "termIds": [
    3103
  ],
  "sentences": [
    "And that the fetishizing of Putin and Russia that takes place with Tucker Carlson, with Laura Ingraham, with CPAC, who is doing their convention in Budapest...really speaks to a reawakening of a political tradition in the country that's always been therehas manifested itself over time and a lot of different ways.",
    "I want to talk about time in the sweep of history, and just to set something as a waypoint before we go deeper in the conversation, which is this remarkable fact: the 10th president of the United States, John Tyler, who went on to betray the country and serve in the Confederate House of Representatives?",
    "And so by the time you get to 1945, 90 years after [the concept of an Aryan race] is invented, 90 years after it's been mainstreamed as the dominant thought across all of European societyMargaret Sanger, Teddy Roosevelt, the eugenics movement, all of it, it's killed 100 million people.",
    "And so if the 16 million American men and women who wore the uniform of the United States in the Second World War were still with us, they would recognize what plays out on Tucker Carlson and Laura Ingraham every single night, because it's what they fought.",
    "And when I think today about how many people are still viscerally angry about Obama, a Black man, being our president...for all the faults that John McCain has, and I know you've been very vocal about them, was that a genuine moment?",
    "Where she does have some cunning, he has a real, legitimate malice; a real, legitimate chip on his shoulder; a real understanding and mastery of American media, all of its hypocrisy, and how to ride the cesspool wave.",
    "In this instance, it was me: the evil political adviser who betrayed this American eagle, who, if she just could have flown unencumbered and free, would have lighted the world with all of the good and noble things.",
    "That ideology quickly metastasizes from some type of stupid populism to a real lethal type of populism, where \"replacement theory,\" which is foundational, as we said at the beginning, to things like Hitlerism.",
    "By pushing her forward, do you think that [McCain] pushed what we see todaya sort of Tea Party metamorphosis to whatever we're gonna call the Matt Gaetzes and Marjorie Taylor Greenes, that cast of characters?",
    "And John McCain went out and delivered one of the most graceful and beautiful concession speeches that [spoke] to the magnificence of this country and a tradition that George Washington set in motion.",
    "Political strategist Steve Schmidt has made headlines recently over new revelations about his professionaland personalrelationship with the late Senator John McCain, as well as with the McCain family.",
    "And so when we see Elise Stefanik, when we see these people talking about \"replacement theory,\" this was all core to Hitlerism: the idea that there is a group of people that are more than and above.",
    "It's espoused on Fox News unrelentingly, on the eight o'clock and the nine o'clock and the Tucker Carlson and Laura Ingraham hours in a way that will trigger mentally ill, disaffected loners.",
    "And here's the thing: How do we cover this guy [who committed the mass shooting in Buffalo] if he's an 18-year-old jihadi named Muhammad as opposed to an 18-year-old Nazi named whatever.",
    "It was very, very clear in the White House I worked in, [between the] president and vice president, who was in the advice-giving business and who was in the decision-making business.",
    "Schmidt joined Declassified With Naveed Jamali to discuss his frustration with McCain's choice of running mate in 2008 and the trajectory of the party he very publicly left in 2018.",
    "There's a juxtaposition of this really remarkable John McCain, who didn't want to be associated with the nastiness that was coming after Obamabut then he also chose Sarah Palin.",
    "And he was very conscious of what his obligation was in a moment where things were starting to get out of control, in part because of the irresponsibility of his running mate.",
    "I remember very vividly this moment during John McCain's 2008 presidential campaign, where this older woman comes up, and she says she doesn't like Obama because he's Muslim.",
    "I think that the overwhelming majority of Americans...recognize that Russia is a geopolitical adversary, and a great threat to the stability of the world and world peace.",
    "And Sarah Palin's victimization is rewarded with a million-dollar contract on Fox News, where she goes and sits down with the Chris Wallaces of the world on Sunday.",
    "Vance has been open and on the record talking about a desire for the rise of an American Caesar, who can stop the great threat to freedom...which is democracy.",
    "McCain understood this completely, that we couldn't say Obama's name out loud [and] we've got to start preparing for a dignified, peaceful transition of power.",
    "When I had my first conversation with her, a substantive discussion speaking to how the world functions, that was on the bus getting ready to leave St. Paul.",
    "The national media doesn't pick up and doesn't pay attention to the meaning of the word \"regime\" that Tucker Carlson and Laura Ingraham use every night.",
    "I reject the politics of exculpation, because it immunizes and infantizes broader responsibilities by saying this one thing caused everything else.",
    "A couple of things had happened around that period of time; one of them was that a hero of John McCain's, John Lewis, had condemned the campaign.",
    "Not one time ever does anybody ever ask Sarah Palin a serious question aimed at determining her fitness, her qualifications, so on and so forth.",
    "[Most Americans stand] ready to accept the foundational premise of the country as a moral proposition: that freedom means freedom for everybody.",
    "And democracy is poisonous, because democracy allows the people who are less than, the brown, the Black, the Jews, an equal say, an equal vote.",
    "And the reality is, the first person in the country who mattered that addressed Senator Obama on that historic night as \"Mr. President-elect\"?",
    "As you got closer to the finish line, the anger grew, because there was an inevitability that Barack Obama was going to be elected president.",
    "I think Barack Obama would be the first person to tell people that he wants to live in a country where people can vote against Barack Obama.",
    "The Republican Party in an instant goes from the personal responsibility party to the great American political grievance and victim party.",
    "There's essentially a Palin truther movement, which [contends] that, in fact, she is not ignorant, she is not a clown; she was betrayed.",
    "Schmidt, to hear him tell it, has nothing to sell or promote with this discussion of a campaign that took place a decade and a half ago.",
    "That's one of the greatest American inventions, if not the greatest American invention, that's been exported all around the world.",
    "One of them is this idea of how you cover something like that, without making it feel like this is the first case of racism.",
    "He's merely setting the record straight, and drawing a throughline from our nation's infancy to Sarah Palin to the present.",
    "If you say his name out loud, what will happen is people are going to scream the N-word more, which is what we're hearing.",
    "For the full conversation, listen to the latest episode of Declassified With Naveed Jamali wherever you get your podcasts.",
    "And after about three minutes, I realized, \"Yeah, she doesn't have a clue we fought the Germans in the Second World War.\"",
    "But there's connective tissue back to Jim Crow and George Wallace and a whole cast that preceded this in the early years.",
    "And McCain understood the consequence of that, and not too long after you had the woman who [made the \"Muslim\" comment].",
    "When I think about the Republican Party, I think about Reagan, and calling Russia and the Soviets \"godless communists.\"",
    "You had this media scrutiny of her that piled on and there were all of these facts that were just missing from the vet.",
    "He'd have been the first to be appalled at being deified, and so in that moment, he understood what his obligation is.",
    "And so you have a movement that comes to life with the conservative media, conservative magazines, conservative blogs.",
    "So the power vacuum was filled, but not by elected officials, and not by party officials, but by media personalities.",
    "He knew the politics of going out and saying the fundamentals of the economy were strong when it was blowing up.",
    "And Donald Trump becomes the avatar of this movement, and ultimately, Donald Trump finds a way to an ideology.",
    "I was the guy who placed the phone call to Senator Obama at that moment that he became President-elect Obama.",
    "That they're entitled to life, liberty and the pursuit of happiness, without intrusion from the government.",
    "And so when we look at this event that played in Buffalo, there is direct causality between the rhetoric.",
    "And after the Lehman Brothers and all of that, [Representative Lewis' comment] is what broke his back.",
    "On big things, small things, medium things, you could not get a straight answer out of this person.",
    "And the threat is a rising tide of political extremism and fascism with violence attached to it.",
    "And we've seen over the last several years this complete shift of almost embracing the Russians.",
    "What follows is a lightly edited transcript of parts of Schmidt's appearance on Declassified.",
    "He had looked into these crowds and saw something and said it reminded him of the Deep South.",
    "And I would say to her: \"I'm not trying to understand any other detail other than the facts.",
    "What I would put forward is we cover them differently in this country, and we ought not to.",
    "What happens on January 20th of 2009 is the first Black president takes the oath of office.",
    "But I have the membership card, and I'm showing it to you, and you keep lying about it.\"",
    "The important role that we play in the legitimacy of the election was all front of mind.",
    "And everybody is created equally, regardless of color, creed, religion, gender, right?",
    "I have a hard time in this space, because yes, of course, there's connective tissue.",
    "In a political campaign, you have to be able to say your opponent's name out loud.",
    "This past weekend, there was a horrible massacre, a terrorist attack, in Buffalo.",
    "I had never heard the word shouted out loud at any type of political rally ever.",
    "And so we went to McCain, right around this time, and we had this conversation.",
    "Was your husband a member of a secessionist Alaska Independence Party or not?",
    "It wasn't anyone on his team or anyone on his staff, or anyone in the media.",
    "And you started to hear the N-word in the crowd when McCain said his name.",
    "A lot of the things that we've seen, in your opinion, started before now.",
    "I have no idea what [he and Palin talked about] in their first meeting.",
    "Trump...took this whole thing to the next level, because he's smarter.",
    "In democracy, you and I will stand equally, we will each have a vote.",
    "And he was a full-on American hero of the first and highest caliber.",
    "And at the time, McCain was broken by this, he was shattered by it.",
    "But we were all in that moment like, \"Oh, my God, this is awful.\"",
    "And you have Democratic majorities, Republicans are out of power.",
    "It was absolutely the most pissed off I've ever been in my life.",
    "I think at a core level as a candidate, he knew he was losing.",
    "Which, by the way, even if he was, it shouldn't be a big deal.",
    "And McCain corrects her, says, \"No ma'am, he's not Muslim.\"",
    "As has been pointed out many times, nature abhors a vacuum.",
    "I was with McCain, as her car rolled down to the compound.",
    "And that when we say all men, we mean all men and women.",
    "It was absolutely jarring to hear it in October of 2008.",
    "The \"regime\" as they use it is the people's government.",
    "It was the moment that kind of killed [his candidacy].",
    "And I have a different perspective on all of this now.",
    "The press is hearing it, and they're picking up on it.",
    "I had never met anybody who just couldn't stop lying.",
    "This had intent, it had purpose, it had an ideology.",
    "If you say his name out loud, we get what we get.\"",
    "That was my concern coming out of the convention.",
    "And that's how it's understood in the new Right.",
    "And so we said to McCain, \"You just can't do it.",
    "The campaign makes no sense if you can't, right?",
    "\"Look, John, you're not gonna win this election.",
    "But on our list of threats, they're very low.",
    "Is there connective tissue between the two?",
    "Maybe he liked the barbecue, I don't know.",
    "And John McCain understood that, you know?",
    "Barack Obama is going to be the president.",
    "The whole rise of total nuttiness, right?",
    "And John McCain was the decision maker.",
    "How do you reconcile those two things?",
    "I mean, I couldn't f****** believe it.",
    "We have a real threat in this country.",
    "And that was a very authentic moment.",
    "Listen, John McCain lived a big life.",
    "But his grandfather was born in 1790.",
    "She's betrayed by the establishment.",
    "At the time, this was unprecedented.",
    "This was an act of war in Buffalo.",
    "And you're the guy on the stage.\"",
    "I had worked in the White House.",
    "The real John McCain was enough.",
    "We played a small role in that.",
    "He says Obama is a good man.",
    "It brings so many questions.",
    "This has always been there.",
    "Let me tell you this story.",
    "Deeply, deeply upset by it.",
    "Yes, jihadis are a threat.",
    "This was a political act.",
    "He was a magnificent guy.",
    "This is what the line is.",
    "That's the fighting line.",
    "He was a complicated guy.",
    "He has a living grandson.",
    "Think about that, right?",
    "Who's the establishment?",
    "She was betrayed by who?",
    "That guy is in his 90s.",
    "I was enraged over it.",
    "That's where we stand.",
    "It's been reawakened.",
    "He was born in 1790.",
    "How did we get here?",
    "He was a flawed guy.",
    "That's a fairy tale.",
    "It was John McCain.",
    "Michelle Bachmann.",
    "We have no chance.",
    "This was new.",
    "Herman Cain.",
    "Of course.",
    "J.D."
  ]
}