{
  "id": 5472,
  "mediaId": 302,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "In wake of the Buffalo mass shooting, lets pity the poor white people ... again | Column",
  "image": "https://www.tampabay.com/resizer//AbgBZ5uLh8DTzONUdm8dEahPlqU=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/AUXRIHTQ4VG2BC7ECNSJGLXDAA.jpeg",
  "link": "https://www.tampabay.com/opinion/2022/05/18/in-wake-of-the-buffalo-mass-shooting-lets-pity-the-poor-white-people-again-column/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    1095,
    1577,
    1801,
    3103,
    3796,
    4143,
    199,
    3590,
    2945,
    4938
  ],
  "sentences": [
    "They are being overrun by caravans when not murdered by illegals or terrorized by Muslims or tyrannized by masks or oppressed by vaccinations or canceled by culture or lied to by media or lied upon by media or cheated by elections or blamed by Blacks or vexed by Press 1 for English.?\nOr replaced  evicted from their God-ordained pre-eminence by others? who will be obedient voters for the liberal left.",
    "While the people we elect and trust in offices around this country do their best not to protect us, not to consider us equal, not to love us back.?\nAnd suddenly, you knew he was speaking out of a bereft exhaustion that encompassed not just him and his family but all of us who have been betrayed by America and its dream.",
    "Thus, it was shocking and painful, but also predictable, that a stupid white boy with a stated belief in the replacement theory allegedly walked into a supermarket in Buffalo, New York, on Saturday and shot 10 Black people to death.",
    "Speaking of which, he addressed the shooting Monday on his show, somehow managing to blame professional Democrats? without once mentioning the racist theory that he and the alleged shooter both happen to believe.",
    "Indeed, this was no more surprising than last years massacre of Asians in Atlanta, 2019s massacre of Latinos in El Paso or 2015s massacre of African Americans at a church in Charleston.",
    "So says the so-called Great Replacement Theory,? which originated in the fever swamps of white supremacy and now has a regular megaphone on Fox, courtesy of Tucker Carlson.",
    "Vance, of conservatism as a whole, in response to a demographic shift first forecast years ago: that by 2050, people of color will constitute a majority of the population.",
    "What are we supposed to do with all of this anger,? he pleaded, with all of this pain??\nThe question resonated, as it has for years unending.",
    "Thats how you get a country where Critical Race Theory is banned by law, but you can learn Great Replacement Theory by turning on Fox.",
    "What a country, a place where critical race theory can be banned by law, but you can learn Great Replacement Theory by turning on Fox.",
    "In a grief-tattered voice, he spoke of his familys anguish at the loss of his 86-year-old mother, Ruth, who died in the shooting.",
    "That, in essence, is the battle cry thats powered much of American politics for the last 30 years, the last 15 in particular.",
    "Where some of us saw in that prediction change and challenge, they saw the gains to be made by fomenting white panic.",
    "It has echoed from the halls of government to the set of Fox News? to the far-flung strands of the world wide web.",
    "Its also been the message of New York Rep. Elise Stefanik, Florida Rep. Matt Gaetz, would-be Ohio Sen. J.D.",
    "Leonard Pitts Jr. is a columnist for the Miami Herald, 3511 NW 91st Ave., Miami, Fla., 33172.",
    "And, as for years unending, no answer immediately presented itself.",
    "And you expect us to keep doing this over and over and over again.",
    "Readers may contact him via e-mail at lpitts@miamiherald.com.",
    "Where voting keeps getting harder and gun ownership easier.",
    "We treat people with decency and we love even our enemies.",
    "Where Colin Kaepernick is unemployed, and Carlson is not.",
    "We do our best to be good citizens, to be good people.",
    "Garnell Whitfield Jr. was also on television that day.",
    "Lets never forget who the real victims are.",
    "Distributed by Tribune Content Agency, LLC.",
    "But yes, come and let us pity white people.",
    "But yeah, sure, lets pity white people.",
    "But that hasnt been his message alone.",
    "Panicked people do terrible things.",
    "But were not just hurtin,? he said.",
    "Come and let us pity white people.",
    "They are the real victims here.",
    "Many certainly pity themselves.",
    "This shouldnt have happened.",
    "Forgive and forget.",
    " 2022 Miami Herald.",
    "We believe in God.",
    "Poor white people.",
    "We trust Him.",
    "Were angry."
  ]
}