{
  "id": 5479,
  "mediaId": 98,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Latinx Files: Replacement theorys fatal aftermath",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/3f4cea4/2147483647/strip/true/crop/3000x2000+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2a%2Fda%2F9b068c6d445e9750eb4e534ecc09%2Flatinx-files-replacement-theory-buffalo-copy.jpg",
  "link": "https://www.latimes.com/world-nation/newsletter/2022-05-18/latinx-files-replacement-theory-buffalo-el-paso-shooting-white-supremacy-latinx-files",
  "sentiment": "0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fidel Martinez",
  "authorUrl": "https://www.latimes.com/people/fidel-martinez",
  "termIds": [
    3103
  ],
  "sentences": [
    "This thing right here from her story:\nJust as French filmmaker Jean-Luc Godard immortalized the swinging postwar zeitgeist of 1960s Paris, or Kanye West bottled the lightning of his Chicago and alchemized it into his own dark, twisted multiverse, Bad Bunny now paints from the palette of Puerto Rico in the 2020s, devising a new modern-day lore for his people  and, with help from visionary Puerto Rican producers Tainy, MAG and La Paciencia, he realizes future-forward sounds for his peers and fans to take in.?\nWant to read more about Bad Bunnys new album?",
    " Congratulations to Maria Hinojosa and the rest of the Futuro Media crew for winning the Pulitzer Prize in Audio Reporting alongside PRX for the podcast Suave.? The production house has co-produced a lot of great podcasts that focus/center Latinx stories, including ?dolo: The Ballad of Chalino Snchez? (made with Sonoro) and The Battle of 187? (co-produced by the Los Angeles Times), so the award is very well deserved!",
    "According to a recent poll conducted by the Associated Press and NORC Center for Public Affairs Research, a third of U.S. adults think an effort is underway to replace U.S.-born Americans with immigrants for electoral gains.?\nThats a lot of people, a fact not lost on politicians and pundits who have used this ideology of fear for their personal gain.",
    "For more Times voices on the Buffalo mass shooting:\nThings we read this week that we think you should read\n Andrea Castillo and Jie Jenny Zou report that Johana Medina Leon, a woman from El Salvador, was quickly released by Immigration and Customs Enforcement as her health took a turn for the worse, according to emails reviewed by The Times.",
    "Its so ingrained in American culture that its mocked in The Great Gatsby?  a view espoused by the buffoonish blue blood Tom Buchanan  and was a central theme of The Forever Purge,? a movie in which **spoiler alert** El Paso is overtaken by white supremacists.",
    "As Santos explains, the Austin FC supporter group has become one of the citys few celebrations of Latinidad.? Dont get me wrong, I still think their team is corny (THEY HAD A CHANT TO CELEBRATE THE CITY COUNCIL VOTE THAT APPROVED THE STADIUM!)",
    "Like in El Paso, a white supremacist armed to the teeth allegedly traveled hundreds of miles to kill as many of those who didnt look like him as possible, only instead of Mexicans it was Black people who were slain for simply existing.",
    "(Kent Nishimura / Los Angeles Times; Mark Ralston/ AFP / Getty Images; Gene J. Puskar / Associated Press)\nWhen I first read the news about the act of terror in Buffalo, N.Y., that left 10 people dead, I immediately thought of El Paso.",
    " For El Faro, Ricardo Valencia wrote about El Salvadors brewing default crisis.? Nayib Bukele, the countrys president, has doubled down on bitcoin even as the cryptocurrency has shed nearly half of its value in the last six months.",
    " Capital & Main has put out a four-story series that looks at overtime pay, the efforts of big business to not pay workers for the extra work that they do, and what is being done by the White House to address this issue.",
    "The talk show host has become the most influential employee? at Fox News by creating what may be the most racist show in the history of cable news,? according to the New York Times.",
    "But then you read essays like the one written by Richard Z. Santos for Texas Monthly about Los Verdes, and then you remember why you became friends with the guy in the first place.",
    "And like in El Paso, the racist suspect left behind a long diatribe explaining that his actions were rooted in the belief that nonwhite people are taking over the country.",
    "who spent his formative adulthood years living there, it feels like watching your broke film nerd friend who worked at Vulcan Video turn into a crypto bro over the years.",
    "For Gizmodo, Angely Mercado wrote about El Apagn? and Puerto Ricos power grid crisis, and Jenny Mota Valdez wrote one of the better reviews of the album for Pitchfork.",
    " The homie Suzy Exposito wrote about Bad Bunnys new album, Un Verano Sin T, and how el Conejo Malo draws inspiration and is influenced by Puerto Rico.",
    "Its nothing but inane thoughts, Mexican memes and sports rants punctuated with a lmao.?) then you know I have a tendency to poke fun at Austin, Texas.",
    "This so-called replacement theory,? which also fueled the hatred behind the 2018 mass shooting at a Pittsburgh synagogue, isnt new.",
    "Greg Abbott, who has been employing the fear of the undocumented immigrant? tactic in his reelection campaign to great success.",
    "It took six weeks for Medina Leon to get medical treatment while under custody, but only six hours to expedite her release.",
    "And when it does, people of color will be made keenly aware of the precarity that exists in their otherness.",
    "And speaking of podcasting, National Public Radio and LAist are launching an incubator for Latinx creators.",
    "and Im hoping my childhood club LAFC beat them last night, but its genuinely nice that they have this.",
    "The city makes itself a target, and as a former resident (RIP La Mexicana Bakery and Las Manitas!)",
    "I wish there were some silver lining in all this that I could point to, but Im at a loss.",
    "Vance and Ted Cruz and Donald Trump, who used white grievance to win the White House.",
    "Unsurprisingly, Carlson has drawn from the replacement theory well with regularity.",
    "Medina Leon died four days later, and her death didnt count toward ICEs tally.",
    "You may occasionally receive promotional content from the Los Angeles Times.",
    "I dont know what to say other than its probably going to happen again.",
    "He currently leads opponent Beto ORourke by seven points.",
    " If you follow me on Twitter (Honestly, why would you?",
    "This hateful rhetoric isnt fringe, either.",
    "If interested, you can apply here.",
    "And who can forget Tucker Carlson?",
    "He isnt a liability for Fox.",
    "Its not just Abbott.",
    "Theres also J.D.",
    "Hes its future.",
    "Take Texas Gov.",
    "I cant help it!"
  ]
}