{
  "id": 5482,
  "mediaId": 238,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Opinion Democrats are crafting a response to Buffalo. What will the right do?",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/17/democrats-response-buffalo/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Sargent",
  "authorUrl": "https://www.washingtonpost.com/people/greg-sargent/",
  "termIds": [
    683,
    1130,
    1507,
    2087,
    2398,
    3103,
    28,
    146,
    549,
    3122,
    4938
  ],
  "sentences": [
    "The bill does include a provision to create an interagency task force to analyze and combat White supremacist and neo-Nazi infiltration of the uniformed services.? But thats because this is a serious and specific problem; there does not appear to be any organized effort by left-wing extremists to recruit within the military.",
    "For instance, when an earlier version was introduced after the insurrection attempt, Fox News host Tucker Carlson railed that Democrats are rushing to embrace a new surveillance state? and using that as a pretext for creating a new secret police force.?\nBut this has been the pattern since President Biden took office.",
    "This is not an ideological definition of domestic terrorism.? It could refer to white-supremacist terrorism or leftist terrorism, so theoretically a future right-wing president could try to apply this to Black Lives Matter or some other group on the left.",
    "Vance regularly refer to those charged with crimes on Jan. 6 as political prisoners.?\nIn other words, some on the right prefer to turn any discussion of domestic terrorism into a story of their own victimhood and a reason to oppose any government action.",
    "So Republicans could see this moment as an opportunity for bipartisanship: Everyone is supposedly against domestic terrorism, and both liberals and conservatives want to prevent the government from trampling civil liberties in fighting it.",
    "The language strengthens the requirement that in carrying out their mission, the offices wont violate the First Amendment, or the right to protest and assemble, or any applicable civil rights and civil liberties regulations and laws.",
    "In a weird twist, it might be that the Squad  who are regularly treated as terrorists themselves by right-wing media figures  end up being among the best allies that right-wingers who fear law enforcement overreach could want.",
    "The bill relies on an existing statutory definition of the term: It refers to acts that threaten human life with the intention of intimidating or coercing a civilian population or influencing government policy.",
    "After he called on Americans to reject extremism in his inauguration speech, Sen. Rand Paul (R-Ky.) screamed that Biden had called conservatives racists? and white supremacists.? Republicans such as J.D.",
    "Thats because at least in the short run, any effort to track and combat domestic terrorism will necessarily focus in part on the right, because thats where most domestic terrorism comes from.",
    "Yet if the right demagogues the issue  treating it as another occasion to warn that jackbooted federal thugs are out to oppress them  the whole debate could turn into yet another crap show.",
    "But now, Omar and Bush are close to getting House Democratic leaders to build in protections to prevent abuses of this law, whether toward political activity on the left or right.",
    "In considering it, Democrats are having an actual, substantive debate about how the federal government should respond to what is clearly a serious and ongoing threat.",
    "Indeed, it was out of concern that the new offices could target communities they represent that Squad members Omar and Bush worked to put the brakes on the bill.",
    "The Anti-Defamation League documented that from 2012 to 2021, domestic extremists killed 443 Americans, 75 percent of whom were killed by right-wing extremists.",
    "As sometimes happens in Washington, a terrible event  in this case the mass shooting in Buffalo  has given new life to an old piece of legislation.",
    "The bill would create new offices focused on domestic terrorism within the Justice Department, Department of Homeland Security and the FBI.",
    "People of different perspectives are debating and negotiating as they try to find a solution that balances security and civil liberties.",
    "At the same time, you could understand the safeguards secured by the Squad as protecting people Republicans are more sympathetic to.",
    "For instance, drafters are adding language underscoring limits on the power of the new offices to analyze and monitor targets.",
    "Its unclear where Republicans will ultimately come down on the bill, but if they engage in good faith, it could be valuable.",
    "Because weve already seen a furious right-wing media response to efforts to combat domestic terrorism, including this bill.",
    "So Congress is considering anew the Domestic Terrorism Prevention Act, which has bounced around the Hill for a few years.",
    "Members of the Squad? of progressive lawmakers  including Reps. Ilhan Omar (D-Minn.) and Cori Bush (D-Mo.)",
    "Were told the changes they want are getting into the bill, and that theyre close to supporting it.",
    "They were echoing objections raised to past versions by the American Civil Liberties Union.",
    "Theyll likely be too busy demagoguing to engage in any such subtleties.",
    "The bill would create a new department for tackling violent extremism.",
    " are demanding new changes to strengthen civil liberties protections.",
    "In theory, Republicans should be able to support such a compromise.",
    "But dont expect those media types to appreciate this irony.",
    "Which raises a question: How will the right respond?",
    "They tend to support aggressive law enforcement.",
    "The debate among Democrats is producing results.",
    "And they appear to be getting somewhere.",
    "What is domestic terrorism??",
    "Maybe not.",
    "Right?"
  ]
}