{
  "id": 5492,
  "mediaId": 169,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "What \"great replacement\"? Right wants us to shut up about Buffalo shooter's ideology",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/05/stefanik-carlson-gaetz-0516221.jpg",
  "link": "https://www.salon.com/2022/05/17/what-great-replacement-right-wants-us-to-shut-up-about-buffalo-shooters-ideology/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eoin Higgins",
  "authorUrl": "https://www.salon.com/writer/eoin-higgins",
  "termIds": [
    3094,
    3103
  ],
  "sentences": [
    " whom Stefanik replaced in the GOP House leadership after Cheney was ousted for her criticism of Donald Trump  tried to distance herself and her party from the racism she has supported for years, claiming that \"House GOP leadership has enabled white nationalism, white supremacy, and anti-semitism\" while conveniently ignoring her own support for the racist birther movement, her career of Islamophobic hate speech and her hardline anti-immigration rhetoric  all of which is functionally little different from the more explicit conspiracy theories being repeated by Stefanik, et al.",
    "RELATED: Doubling down on \"great replacement\" paranoia: How the right is reacting to the Buffalo shooting\nThe manifesto included a nearly word-for-word repeat of Fox News host Tucker Carlson's interpretation of the racist \"Great Replacement\" narrative, a far-right conspiracy theory that claims Democrats and/or Jews are trying to dilute the white American electorate by importing immigrants of color.",
    "Breitbart's Joel Pollack protested that inquiring into the shooter's obvious ideological links to other right-wingers was a \"predictable attempt to exploit the shooting to censor debate and opposition\"  even as he reiterated his support for the \"Great Replacement\" theory.",
    "\"There is no racial hierarchy in Carlson's view of American citizenship and to claim that there is is nothing short of a defamatory lie,\" Greenwald wrote, conveniently ignoring  as usual  the fact that Carlson's entire worldview is based on racial hierarchy and bigotry.",
    "Yet rather than reflect on the similarity between the ideological conspiracy theory they're pushing and the motivations of the Buffalo shooter, many conservatives are crying foul at the suggestion they might have some culpability for spreading hate.",
    "Social media influencer and frequent Carlson guest Glenn Greenwald (a former Salon columnist), writing on his Substack blog, argued that those seeking to look into the ideological ties between the Fox News host and the shooter were being unfair.",
    "The document, which includes multiple antisemitic references and makes clear he was expressly targeting the store, and that particular Buffalo neighborhood, because of the area's large Black population, leaves little to the imagination.",
    "Wailing about persecution and unfairness is the right's go-to move whenever its leading voices are forced to actually answer for the reality of their belief system, and the fallout from Saturday's shooting is no different.",
    "Daily Wire writer Megan Basham pretended to take the high road, calling on critics \"not to pit racial groups against one another,\" a principle that, if applied, would erase the majority of her boss Ben Shapiro's output.",
    "Stefanik, in a statement, expressed her sympathies for the victims of the shooting  and then turned things over to senior advisor Alex DeGrasse for a doubling down on anti-immigrant sentiments.",
    "But instead of rethinking how they talk about immigrants and people of color, conservatives have gone on the offensive, playing aggrieved to drown their critics in crocodile tears.",
    "Commentator Kmele Foster complained, \"When a lunatic goes on a deadly rampage, maybe wait 24-48 hrs before co-opting the tragedy to malice your political enemies.\"",
    "The TV-dinner heir and child of total privilege who claims to speak for the common man has long had an affinity for the most racist of conspiracy theories.",
    "Rep. Matt Gaetz, R-Fla., used the term directly in a tweet praising Carlson, and candidates such as Ohio Republican U.S. Senate nominee J.D.",
    "The more noise they make to distract you, the more worried they are that people are beginning to pay attention to what they actually say.",
    "Last Saturday, as the entire world now knows, an 18-year-old man named Payton Gendron killed 10 people in a Tops supermarket in Buffalo.",
    "GOP rising star Rep. Elise Stefanik, R-N.Y., one of the biggest proponents of the conspiracy, used it in a September 2021 campaign ad.",
    "Of the 13 people Gendron shot, 11 were Black  in his livestream of the shooting, he's heard saying \"sorry\" to a white man he shoots.",
    "This should come as no surprise to anyone who's paid even the slightest attention to Carlson over the past few years.",
    "Other media figures also leapt at the opportunity to play defense, whining about fairness and respect for the dead.",
    "His allies and followers in the Republican Party have been parroting the \"replacement\" line for years.",
    "Gendron's motivations for the shooting were made clear in a 180-page manifesto he published online.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "The other victims seem to have hardly even been spared a thought.",
    "Read more on the Buffalo shooting, and what led to it:",
    "Subscribe to our morning newsletter, Crash Course.",
    "Vance have also embraced the language.",
    "Judd Legum has a good overview here.",
    "Meanwhile, Rep. Liz Cheney, R-Wyo.",
    "Carlson is hardly alone."
  ]
}