{
  "id": 5494,
  "mediaId": 238,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "The Orbanization of America: The U.S. right walks in Hungarys path",
  "image": "",
  "link": "https://www.washingtonpost.com/world/2022/05/17/viktor-orban-american-right-illiberal-orbanization/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ishaan Tharoor",
  "authorUrl": "https://www.washingtonpost.com/people/ishaan-tharoor/",
  "termIds": [
    3103
  ],
  "sentences": [
    "We need like a de-Baathification program, a de-woke-ification program.?\nHe added: I think that what Trump should do, if I was giving him one piece of advice: Fire every single mid-level bureaucrat, every civil servant in the administrative state, replace them with our people.?\nThat sort of dismantling seems fanciful, but analysts see in the admiration for Orban among the American right the intensifying of a political project that carries all the venom of Orbans war on the 1968 elite.?\nI worry that Orban is the complete package,? Kim Lane Scheppele, a professor of sociology at Princeton University and expert on Hungarian politics, told the New Yorker last year.",
    "Instead of promising the nations wealth to every illegal immigrant from the Third World, theyre using tax dollars to uplift their own people.?\nCarlson was trial-ballooning a line of rhetoric that has become all the more mainstream in recent years  that of the racist great replacement? theory, which posits that arrivals of immigrants are part of political project to undermine or even wipe out native-born populations.",
    "Despite Hungarys negligible population of Muslims and Arabs, he treated the prospect of resettling a little more than a thousand Syrian refugees in 2015 as an existential threat  and arguably solidified domestic support in doing so and boosted his profile among the European far right.",
    "To Orban, the political unrest and student uprisings that took place in parts of Europe a half century prior were the progenitors of the current social-cultural orthodoxy  marked by ascendant feminism, atheism and leftist cosmopolitanism  that he wanted to overthrow.",
    "There are political forces in Europe who want a replacement of population for ideological or other reasons.?\nChief among these supposed forces was Hungarian-American financier George Soros, who has a long history of civil society outreach to the land of his birth.",
    "In European politics, it is the turn of the anti-communist generation, which has Christian convictions and commitment to the nation.?\nThe next year, mainstream political parties did suffer at the polls when Europeans voted for their continental Parliament.",
    "Stephen K. Bannon, former adviser to President Donald Trump, described Orbans nationalist agenda and rule as that of a Trump before Trump.? A steady stream of conservative U.S. intellectuals have made their way to Budapest on sabbaticals and fellowships.",
    "If Europe is not going to be populated by Europeans in the future and we take this as given, then we are speaking about an exchange of populations, to replace the population of Europeans,? Orban said at a 2019 conference on demography hosted in Budapest.",
    "Hungarys leaders actually care about making sure their own people thrive,? Carlson said in 2019, gesturing both to Orbans hostility to immigration and multiculturalism, as well as his efforts to incentivize Hungarian families to have more children.",
    "The theory was once prevalent on the fringes of Western politics, but now has moved to the right-wing mainstream, thanks to the incessant fearmongering of people like Carlson as well as its propagation by politicians on both sides of the Atlantic.",
    "Vance, also known for cheering Orbans brand of nationalism, suggested in an interview with Vanity Fair that a Trump reelection in 2024 should prompt the start of a forced takeover of U.S. institutions, including universities.",
    "But Orban turned to the right as he navigated the currents of Hungarys post-Cold War democratic transition and has since set about undermining, and in some instances, capturing civic institutions that could stymie his rule.",
    "The space for the independent press in Hungary has been squeezed, with Orban-allied business executives tactically taking over major outlets and the government tracking investigative journalists with spyware.",
    "That includes a virtual appearance from Tucker Carlson, the far-right prime-time Fox News anchor who has lionized Orban for years and journeyed to Budapest in the past to interview the Hungarian premier.",
    "It animated the deranged world views of a series of mass shooters in the past decade, including a white supremacist teenager who authorities say killed 10 people in a Buffalo grocery store this weekend.",
    "But the far right  to which Orban bears a great deal of affinity  was not the only beneficiary, with parties further to the left, including a growing vanguard of Green factions, also coming to the fore.",
    "The irony is that, in an earlier era, a Soros-funded organization in the 1980s helped provide support to the fledgling liberal youth group led by Orban that would become the Fidesz political party.",
    "Orban and a number of his lieutenants will address the meeting, along with a cast of Republican lawmakers, European far-right leaders and key figures from the U.S. right-wing media ecosystem.",
    "For Orban and his allies, Soros served as a kind of catchall enemy, a wealthy Jewish elitist who bankrolls cosmopolitan projects like universities and educational and aid organizations.",
    "Later this week, a major event of the Conservative Political Action Conference  the premier convening organization of the American political right  is slated to take place in Budapest.",
    "Vance, the Republican Partys nominee for this years Ohio Senate election who has advocated seizing the assets of the Ford Foundation, an organization that promotes social justice.",
    "Orban and his right-wing nationalist allies had not achieved much in their stated goal of planting the flag of a newfangled Christian democracy? across the continent.",
    "He foresaw a wave of right-wing, nationalist parties supplanting the European Unions liberal establishment in European Parliamentary elections the following year.",
    "He had spent the years since coming to power in 2010 transforming his nation of 10 million people into a kind of petri dish for illiberal democracy.",
    "To right-wingers in the United States, steeped in anti-liberal grievance, Hungary offers a glimpse of culture war victory and a template for action.",
    "A recent poll found that 3 out of 10 Americans believe more immigration is forcing native-born Americans to lose political and cultural influence.",
    "The generation of the 90s is arriving to replace the generation of 68,? Orban said, addressing a gathering of ethnic Hungarians in Romania.",
    "Sign up to get the rest, including news from around the globe, interesting ideas, and opinions to know sent to your inbox every weekday.",
    "The Hungarian prime minister and his ruling Fidesz party has become a prominent source of inspiration for American conservatives.",
    "This is the first part of a three-part Todays WorldView series looking at the shadow cast by Hungarys leader over U.S. politics.",
    "He uses the rhetoric that appeals to the right, the way that Trumps rhetoric appealed to the right wing of U.S. politics.",
    "We are facing a big moment: We are saying goodbye not simply to liberal democracy  but to the 1968 elite,? Orban said.",
    "By invoking the 1968 elite,? Orban was deploying a loaded shorthand for the prevailing status quo on the continent.",
    "No elected leader in the West grandstands more over the specter of demographic peril than Orban.",
    "In the summer of 2018, Hungarian Prime Minister Viktor Orban declared war on a generation.",
    "Swaths of bureaucrats were laid off as Orban took control of the machinery of state.",
    "Im concerned that vision is whats actually appealing to the American right.?",
    "I tend to think that we should seize the institutions of the left,? he said.",
    "But underneath it there is a dictator who is running things by himself.",
    "World\nYoure reading an excerpt from the Todays WorldView newsletter.",
    "But Orbans influence and vision are not just restricted to Europe.",
    "A Soros-founded university was forced to relocate to Vienna.",
    "And now it was time for the Hungarian model to get exported.",
    "And turn them against the left.",
    "Consider the words of J.D."
  ]
}