{
  "id": 5504,
  "mediaId": 129,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "The Slaughter in Buffalo Hasnt Quieted the Great Replacement Caucus",
  "image": "https://static01.nyt.com/images/2022/05/17/opinion/17bouie-02/17bouie-02-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/17/opinion/buffalo-great-replacement-republicans.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    1095,
    1119,
    1801,
    2087,
    2213,
    3103,
    146,
    428,
    2945,
    4938
  ],
  "sentences": [
    "3 Republican in the House of Representatives, Elise Stefanik of New York, declared that it was a FACT that DEMOCRATS have been explicitly pushing for amnesty for years  specifically for political and electoral purposes.?\nRepublican politicians aside, theres also Tucker Carlson, whose Fox News program is a direct conduit for white nationalist ideas, including the idea of the great replacement.? There are more than 400 episodes of his show, according to a recent Times investigation, in which Carlson has either amplified or promoted the theory that Democrats and other members of the liberal elite (like the billionaire philanthropist George Soros) are using immigration to replace the native-born majority with a new, foreign-born electorate.",
    "The reason Joe Biden has not ended illegal immigration to the United States, Carlson charged in a monologue last year, is because he wants to change the racial mix of the country? and reduce the political power of people whose ancestors lived here, and dramatically increase the proportion of Americans newly arrived from the third world.? This policy, Carlson continued, is sometimes called the great replacement  the replacement of legacy Americans, with more obedient people from faraway countries.?\nThe point of making the connection between this rhetoric and that of the accused shooter is not to say that Carlson or Republican politicians are directly responsible for the ideas in his manifesto or for the slaughter itself.",
    "Joe Bidens open border is killing Ohioans, with more illegal drugs and more Democrat voters pouring into this country.?\nHours after the shooting, a Republican Senate candidate in Arizona, Blake Masters, said on Twitter that The Democrats want open borders so they can bring in and amnesty tens of millions of illegal aliens  thats their electoral strategy.? And on Monday, the No.",
    "Make no mistake: The idea that apparently inspired a white supremacist who is accused of killing and injuring more than a dozen people at a supermarket in Buffalo  that nefarious elites are using immigration to replace? white Americans with pliant foreigners  is virtually indistinguishable from mainstream Republican rhetoric.",
    "One way to try to foreclose the most expansive and progressive possibilities  to secure capital and hierarchy against equality and democracy  is to weaponize divisions and anxieties and received prejudices; to play to the fear of loss in hopes of overcoming a call for solidarity.",
    "But in American politics, this rhetoric is not just a signal for politicians who want the support of Trump or a way for television hosts to find viewers and make money for themselves and the corporations that employ them.",
    "They have chosen to swim in the same ideological waters as the people responsible for these shootings and have chosen to amplify the great replacement? theory to the world even as it poisoned minds and produced violence.",
    "In the United States, there have been at least two others: the 2018 Tree of Life synagogue shooting in Pittsburgh that killed 11 people and the 2019 shooting in El Paso, Texas that killed 23 people.",
    "Is it really [that] they want to remake the demographics of America to ensure that they stay in power forever??\nThe media calls us racist for wanting to build Trumps wall,? said J.D.",
    "The Republican politicians and conservative media personalities who traffic in this rhetoric did not create the idea of the great replacement,? but they have adopted it.",
    "It would not be the first time in this countrys history that reactionaries fanned violence in order to win a favorable settlement for themselves.",
    "But he cannot fix what ails them, and one day theyll realize it.? When Trump appeared to be a threat to their ambition, they stood against him.",
    "Stefanik condemned his rhetoric  I think he was insulting to women,? she said in 2015  while Vance once analogized Trumpism to a narcotic.",
    "But the shooting in Buffalo is only the latest in a series of mass shootings inspired by this particular racist conspiracy theory.",
    "And abroad, there was the shooting in Christchurch, New Zealand, in 2019 where a gunman attacked a mosque, killing 51 people.",
    "It is clear that some of these politicians have made a cynical decision to adopt this rhetoric for the sake of gaining power.",
    "Our society is more than a little unsettled, and as a result there are many new opportunities for change and transformation.",
    "When it was became clear that they could not reach their goals without his assistance, they fell in line and bent the knee.",
    "This administration wants complete open borders,? said Senator Ron Johnson of Wisconsin in an interview last month.",
    "Six or seven years ago, Vance and Stefanik were critics of Donald Trump and the movement that put him in office.",
    "(The accused killer in Buffalo singled out the Christchurch shooter for praise in his manifesto.)",
    "Trump is cultural heroin,? he wrote in 2016, He makes some feel better for a bit.",
    "Vance, the Republican nominee for the U.S. Senate in Ohio, in a campaign ad.",
    "We are living through a moment of social and political tumult.",
    "They censor us, but it doesnt change the truth.",
    "Its not as if this comes out of nowhere.",
    "And you have to ask yourself, why?",
    "It serves a purpose."
  ]
}