{
  "id": 5511,
  "mediaId": 238,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Opinion Republicans are bringing extremism to the mainstream",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/16/republicans-far-right-group-statistics/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dana Milbank",
  "authorUrl": "https://www.washingtonpost.com/people/dana-milbank/",
  "termIds": [
    3103
  ],
  "sentences": [
    "She accused Democrats of a PERMANENT ELECTION INSURRECTION? in the form of an immigration amnesty plan that would overthrow our current electorate.?\nVariations of this have been heard from Republicans such as: Rep. Scott Perry (Pa.), chairman of the House Freedom Caucus (were replacing  native-born Americans to permanently transform the political landscape?); Sen. Ron Johnson of Wisconsin (Democrats want to remake the demographics of America to ensure ... that they stay in power forever?); Rep. Gaetz of Florida (Carlson is CORRECT about Replacement Theory?); Vance, the partys Senate nominee for Ohio (Bidens open border is killing Ohioans, with  more Democrat voters pouring into this country?); and Gingrich, former Republican House speaker (the anti-American left would love to drown traditional, classic Americans  to get rid of the rest of us?).",
    "The ideas of the far right have moved pretty substantially into the mainstream,? Devin Burghart, IREHRs executive director, told me on Monday, not only as the basis for acts of violence but as the basis for public policy.?\nThe far-right groups range from new iterations of the tea party and certain antiabortion and Second Amendment groups to white nationalists, neo-Confederates and sovereign citizen entities that claim to be exempt from U.S. law.",
    "The IREHR (which conducted a similar study with the NAACP in 2010 on racism within the tea party) cross-referenced the personal, campaign and official Facebook profiles of all 7,383 state legislators in the United States during the 2021-22 legislative period with thousands of far-right Facebook groups.",
    "The IREHR largely excluded from its list membership in historically mainstream conservative groups such as the National Rifle Association and in pro-Trump and MAGA groups, focusing instead on more radical groups defined by nationalism or antidemocratic purposes.",
    "The study, released on Friday by the Institute for Research and Education on Human Rights, a decades-old group that tracks right-wing extremism, found that more than 1 in 5 Republican state legislators in the United States were affiliated with far-right groups.",
    "Three-quarters of the far-right legislators are men, and they are distributed across all 50 states, with the highest percentages of memberships found in Alaska, Arkansas, Idaho, Montana, Washington, Minnesota, Maine and Missouri.",
    "Though based in actual demographic trends  Americans of color will gradually become a majority in coming decades  Great Replacement? holds that Democrats and the left are conspiring by nefarious means to supplant White people.",
    "The IREHR report identifies more obscure figures: posse comitatus adherents in New Hampshire and Florida, paramilitary enthusiasts in Idaho and Arizona, as well as covid-denial and voter suppression activists everywhere.",
    "Her remarks to the gathering (which Reps. Marjorie Taylor Greene (R-Ga.) and Paul Gosar (R-Ariz.) also addressed) earned her a rebuke by her fellow GOP state senators but proved to be a fundraising bonanza.",
    "ProPublica last fall identified 48 Republican state and local government officials  including 10 sitting state lawmakers  on the membership roster of the Oath Keepers, a militant extremist group.",
    "Burghart said proponents of replacement theory? come from all categories of the far right and have been growing in number since Fox Newss Carlson has been championing their conspiracy claims.",
    "During this time, Facebook was trying to shut down white-nationalist, QAnon, Three Percenter and Stop the Steal? groups and their like, which reconstituted or migrated to other platforms.",
    "One Arizona state senator, Wendy Rogers, gained national attention for a speech to a white-nationalist conference in February during which she called for violence.",
    "This idea, expressed by the alleged Buffalo killer (11 of the gunmans 13 victims were Black), has found support from Stefanik (N.Y.), the No.",
    "The researchers found that 875 legislators  all but three of them Republicans  were members of one or more of 789 far-right Facebook groups.",
    "This past weekends massacre in Buffalo has put a deserved spotlight on Elise Stefanik, Tucker Carlson, Newt Gingrich, Matt Gaetz, J.D.",
    "But they, like the 1 in 5 Republican state legislators trafficking in far-right groups, have mainstreamed the extreme.",
    "But Burghart says the study understates the true overlap between the legislators and the far right.",
    "But the problem goes well beyond the rhetoric of a few Republican officials and opinion leaders.",
    "Vance and others trafficking in the racist Great Replacement? conspiracy theory.",
    "Another who attended the white-nationalist conference, Idaho Lt. Gov.",
    "Are these people directly responsible for the massacre in Buffalo?",
    "The consequences have been, and will continue to be, catastrophic.",
    "That works out to 22 percent of all Republican state legislators.",
    "Elected Republicans havent merely inspired far-right extremists.",
    "Some of these far-right figures already have high profiles.",
    "Many others kept their members identities protected.",
    "Some might call the IREHRs list overly broad.",
    "Brad Little in Tuesdays Republican primary.",
    "They have become far-right extremists.",
    "Janice McGeachin, is challenging Gov.",
    "3 House Republican.",
    "Of course not."
  ]
}