{
  "id": 5519,
  "mediaId": 151,
  "date": "d2022-05-16T14:00",
  "headline": "Student loan fight heats up as Biden weighs decision",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-education/2022/05/16/student-loan-fight-heats-up-as-biden-weighs-decision-00032601",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    704,
    922,
    1136,
    1341,
    2087,
    3103,
    3670,
    146,
    2945
  ],
  "sentences": [
    " The House Education and Labor Committees civil rights subcommittee holds a hearing Tuesday on ways to improve the juvenile justice system and support Americas young people.?\nK-12\nCARDONA WEIGHS FLEXIBILITY FOR SCHOOLS ON COVID RELIEF SPENDING: The Biden administration will consider giving schools up to 18 months of extra time  and perhaps even longer  to spend their federal Covid-19 relief aid on upgraded air-circulation systems or other infrastructure, a top Education Department official told an advocacy group Friday.",
    "Canceling student loan debt would set a bad precedent and do nothing to change the fact that future students will graduate with yet more debt  along with the blind hope of another, future amnesty,? the NYT editorial board wrote, calling the idea legally dubious, economically unsound, politically fraught and educationally problematic.?\n The column follows other prominent voices on the left such as Paul Begala and Bill Maher who in recent weeks have pushed back against the idea of Biden canceling student loans.",
    "Student loan fight heats up as Biden weighs decision\nBy MICHAEL STRATFORD\n05/16/2022 10:00 AM EDT\nPresented by Educators for Excellence\nSTUDENT LOAN FIGHT HEATS UP AS BIDEN WEIGHS DECISION: The debate over canceling student loan debt has ebbed and flowed in Democratic politics since progressives seized on it as a go-to issue in the 2020 presidential campaign trail.",
    "Driving the Day\nSUSPECT IN BUFFALO SHOOTING WAS INVESTIGATED OVER SCHOOL THREATS: Police on Sunday said the 18-year-old white man accused of killing 10 people at a grocery store in Buffalo, New York, was previously investigated for threatening to carry out a shooting at his high school last year.",
    "SENATE DEMOCRATS ARE TRYING TO INFLUENCE BIDEN AHEAD OF ANY DECISION: Senate Democrats are pushing for one last chance to press Biden to go as big as possible on canceling student debt as the White House deliberates over a final decision in the coming weeks, POLITICOs Burgess Everett reports.",
    "Student Loans\nCOMMONBOND EXITS STUDENT LOAN REFI BUSINESS: CommonBond plans to wind down its student loan refinancing business over the next month and will instead focus on financing products in the solar energy market, the company announced on Friday.",
    "But Roberto Rodrguez, assistant secretary of education, wrote in a letter to AASA that the administration would consider approving requests for schools to have additional time to use the money it has committed to spend on those projects.",
    "CommonBond was among the private student lenders who in recent months had been lobbying to end the federal governments pandemic-related freeze on student loan payments, which has significantly weakened demand for refinance loans.",
    " On Sunday, Warnock addressed new graduates at his alma mater, Morehouse College, where a billionaire famously paid off the loans for the entire class of 2019: Look, I work for the government and a little church up the street.",
    "Vance, the GOP Senate candidate in Ohio, has railed against loan forgiveness as a bailout for corrupt? university administrators and urged the party to fight this with every ounce of our energy and power.?\nITS MONDAY, MAY 16.",
    " AASA, the School Superintendents Association, and other education groups have pressed Education Secretary Miguel Cardona since January for added flexibility to spend American Rescue Plan Funds on construction projects.",
    "and Raphael Warnock (D-Ga.), have communicated to the White House that they want Biden to hold tight on any executive action until they can press him one last time, according to two people familiar with the matter.",
    " Officials said the shooter, Payton Gendron, targeted the supermarket in a predominantly Black neighborhood for the express purpose? of killing as many Black people as possible, according to The Associated Press.",
    "Please send tips and feedback to your host at mstratford@politico.com or to my colleagues: Juan Perez Jr. at jperez@politico.com and Bianca Quilantan at bquilantan@politico.com.",
    "Report Roundup\n The Federal Reserve Bank of Philadelphias Consumer Finance Institute examines consumer expectations around student loan repayment, forbearance and cancellation.",
    "The Justice Department is investigating the shooting as a hate crime and an act of racially-motivated violent extremism,? Attorney General Merrick Garland said in a statement.",
    "But I am pushing President Biden to cancel student loan debt.?\n Republicans, meanwhile, are pushing back forcefully against the idea in Washington and on the campaign trail.",
    "After all that we have endured in the wake of the COVID-19 pandemic, we cannot ask working people to make further sacrifices,? president Liz Shuler said in a statement.",
    "Theyve said that pandemic-related supply-chain problems, worker shortages and other logistical issues have delayed school districts in signing or finalizing contracts.",
    " Delaware State University plans to file a federal civil rights complaint after its womens lacrosse team was stopped and searched by police in Georgia: POLITICO Pro.",
    " The latest salvo was fired over the weekend from the liberal New York Times editorial board, which came out stridently against widespread student loan forgiveness.",
    "But now that its a front-burner issue for the White House  President Joe Biden has teased a decision in the coming weeks  the issue is once again roiling the left.",
    "On the Hill\nTHIS WEEK ON THE HILL  The House Rules Committee will meet today to tee up Democrats overhaul of federal workforce training programs for a floor vote.",
    "Now is the time to cancel, not collect, student debt.? The NAACP held its latest rally in front of the White House to call for debt forgiveness last week.",
    "On Friday, a group of House Republicans reiterated to the White House they believe Biden lacks the legal power to cancel large amounts of student debt.",
    "The three senators met last week to plot student loan strategy and are seeking a meeting with Biden as soon as he will do it, one of the people said.",
    "Follow us on Twitter\nDelece Smith-Barrow @DeleceWrites\nMichael Stratford @mstratford\nBianca Quilantan @biancaquilan\nJuan Perez Jr. @PerezJr\nFollow Us",
    "The reauthorization of the Workforce Innovation and Opportunity Act cleared a House committee earlier this year on a party-line vote.",
    " Brad Middleton is joining the Education Departments Office of Federal Student Aid enforcement unit as senior adviser for strategy.",
    " Key context: Schools must still commit to spending plans for their share of $122 billion in Covid relief money by September 2024.",
    "Movers and Shakers\n Kota Mizutani is the new deputy communications director for the House Education and Labor Committee.",
    "Youll also receive daily policy news and other intelligence you need to act on the days biggest stories.",
    "Some Democratic economists, such as Larry Summers, have long been skeptics of student debt cancellation.",
    " New Biden administration rules for charter schools spur bipartisan backlash: The New York Times.",
    " But other key constituencies of the Democratic Party are mobilizing in the other direction.",
    "Middleton previously served as education policy director for Sen. Dick Durbin (D-Ill.).",
    "Syllabus\n Biden plunges into the risky politics of student loans: The Washington Post.",
    "The AFL-CIO, for example, last week came out in favor of student loan forgiveness.",
    "Follow us on Twitter: @Morning_Edu and @POLITICOPro.",
    " Majority Leader Chuck Schumer, as well as Sens.",
    "He was formerly the committees press secretary.",
    "Want to receive this newsletter every weekday?",
    "I can't pay off your loans, brothers.",
    "Juan Perez Jr. has more details here.",
    "(Bianca Quilantan has more here.)",
    "WELCOME TO WEEKLY EDUCATION.",
    "Subscribe to POLITICO Pro.",
    "Elizabeth Warren (D-Mass.)",
    "NPR has more.",
    "J.D."
  ]
}