{
  "id": 5522,
  "mediaId": 195,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Juan Williams: The GOPs fake concern on immigration",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/trump.border.wall_.1003.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/opinion/3489377-juan-williams-the-gops-fake-concern-on-immigration/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Juan Williams",
  "authorUrl": "",
  "termIds": [
    790,
    2182,
    2341,
    3103,
    4697,
    146,
    428,
    539,
    571
  ],
  "sentences": [
    "Vance, who won the Republican nomination for Senate, has falsely charged Biden with calling for an open border.? Adam Laxalt, running for the GOP Senate nomination in Nevada, has a radio ad that promises he will stop attempts to grant amnesty to millions of illegal immigrants.?\nThat brand of polarized politics is a sink hole for honest attempts to fix the problem at the border.",
    "I dont think Title 42 has anything to do with COVID.?\nSenate Majority Whip Dick Durbin (D-Ill.) has said Democrats may have no choice but to give the Republicans a vote on the amendment to get critically needed money for more vaccines.",
    "Fifty-six percent of Americans favor allowing migrants from Central American countries to seek asylum in the United States, a modest downtick from 63 percent in April 2021,? according to a CNN report on its recent poll.",
    "It does nothing to deal with the 11 million already in the country illegally and the young people, Dreamers,? who were brought across the border as children and grew up here without citizenship.",
    "For two years, Title 42 has been used to expel immigrants who cross our border,? Durbin, who is also chair of the Senate Judiciary Committee, wrote on Twitter earlier this year.",
    "But beginning next week, TV cameras will be rushing to the border as the far-right inflames anti-immigrant fear to stir up votes for the upcoming midterm elections.",
    "Another round of alarmist Republican shouting about the border will begin next week when the Biden administration plans to end the use of Title 42.",
    "Now, with the danger from COVID-19 past its peak and most mandates lifted, there is little justification for the use of Title 42 at the border.",
    "On the other hand, 64 percent of Democrats want to stop the inappropriate use of Title 42 at the border, according to a recent CNN/SSRS poll.",
    "In 2020, as the pandemic hit, the Trump administration used Title 42 as a flimsy patch to slow the flow of migrants crossing the border.",
    "With Republicans potentially taking control of the House and Senate after the midterms, the only foreseeable opening for reform is now.",
    "Democrats are paralyzed with fear that in midterm campaigns, Republicans will once again blame them for the latest immigration crisis.",
    "And in 2018 there was another deal, including $25 billion for Trumps wall, but Republican hardliners got the president to back away.",
    "They come here from all over the world, carrying legal visas, land at airports and then overstay the time allotted by the visa.",
    "Thom Tillis (R-N.C.) and John Cornyn (R-Texas) to see if any parts of immigration reform can currently get bipartisan support.",
    "They have no plan to deal with young people who grew up here, went to school here, after being brought here by their parents.",
    "Senate Republicans are currently threatening to withhold votes for funds that would aid COVID-19 prevention and treatment.",
    "What is clear as the years go by is that the GOP hardliners on immigration dont have better ideas for immigration reform.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "He once worked with the recently deceased Sen. Orrin Hatch (R-Utah), a strong conservative, on a bill to help Dreamers.",
    "Republicans are gambling with the health security of the nation,? Sen. Robert Menendez (D-N.J.) said last week.",
    "They have no inspired thoughts about border security beyond the wall that Trump promised and never fully built.",
    "Also, most of the illegal immigrants in the U.S. no longer get here by traveling across the Mexican border.",
    "Instead, they are happy to use it to falsely accuse President Biden and Democrats of wanting open borders.",
    "Heres the new Big Lie?  Republicans in Congress care about illegal immigration at the U.S.-Mexico border.",
    "Title 42 became law in 1944, aimed at preventing the spread of diseases like tuberculosis and malaria.",
    "This public health law has been used to stop migrants from legally seeking asylum in the U.S.",
    "But more than 80 percent of Trump-led Republicans say it should be kept, at least for now.",
    "Durbin knows Republicans in the Senate are avoiding work on real immigration reform.",
    "They are demanding a vote on an amendment to continue using Title 42 at the border.",
    "Durbin has seen previous political storms derail substantive immigration reform.",
    "It is not a humane or effective solution to securing our border,? he wrote.",
    "It is easy to dismiss any new effort on immigration as a lost cause.",
    "You know about the old Big Lie?  that the 2020 election was stolen.",
    "But there is reason to hope that Durbin can succeed this time.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Most Americans want those Dreamers,? to have legal status.",
    "Manyhave been unjustly returned to the danger they fled.",
    "But the GOP majority in the House would not vote on it.",
    "Good luck facing down the new Big Lie, Sen. Durbin.",
    "There was a deal with Senate Republicans in 2013.",
    "If they really cared, theyd fix the problem.",
    "Durbin is talking with Sens.",
    "It did not pass.",
    "In Ohio, J.D."
  ]
}