{
  "id": 5524,
  "mediaId": 234,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Republicans Are Furious People Remember Theyve Been Pushing the Racist Great Replacement Rhetoric for Years",
  "image": "https://media.vanityfair.com/photos/60bcefdb7464958c61354fb2/master/w_2240,c_limit/Elise-Stefanik.jpg",
  "link": "https://www.vanityfair.com/news/2022/05/buffalo-shooting-great-replacement-theory-republicans",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bess Levin",
  "authorUrl": "https://www.vanityfair.com/contributor/bess-levin",
  "termIds": [
    683,
    1095,
    1147,
    1925,
    2087,
    2214,
    3103,
    428,
    525
  ],
  "sentences": [
    "Their plan to grant amnesty to 11 MILLION illegal immigrants will overthrow our current electorate and create a permanent liberal majority in Washington.? At the time they ran, Albanys Times Union, the congresswomans hometown paper, called the ads ?despicable,? and blasted her in an editorial, writing that she isnt so brazen as to use [Nazi-inspired] slogans themselves; rather, she couches the hate in alarmist anti-immigrant rhetoric thats become standard fare for the party of Donald Trump.? As The New York Times reported over the weekend, Payton Gendron, the 18-year-old white suspect in the Buffalo shooting, had posted a hate-filled manifesto online,? in which he wrote of his plan to shoot Black shoppers and went on racist, anti-immigrant? rants arguing that white Americans are at risk of being replaced by people of color.? Kind of like the ads run by one Elise Stefanik!",
    "As the Post notes, Pennsylvania Republican representative Scott Perry, current chairman of the conservative House Freedom Caucus, said during a subcommittee hearing concerning migration from Central America last year that many Americans believe were replacing national-born Americannative-born Americansto permanently transform the political landscape of this very nation.? Senator Ron Johnson has suggested that Democrats want to remake the demographics of America to ensure theirthat they stay in power forever.? Texas lieutenant governor Dan Patrick has declared that the revolution has begun? and Democrats are trying to take over our country without firing a shot? by allowing immigrants to enter the country who will vote for Democrats to thank the Democrats and Biden for bringing them here.? Ohio Senate candidate J.D.",
    "Vance has claimed Democrats want to let in 15 million immigrants into the U.S. to shiftthe democratic makeup of this country? so Republicans [will] never win a national election in this country ever again.?\nAnd, of course, we cant forget the fear-mongering, hateful commentary that appears on Fox News on a daily basis, which has included Laura Ingrahams claim that Democrats want to replace you, the American voters, with newly amnestied citizens and an ever-increasing number of chain migrants?; Jeanine Pirros that Democrats immigration policies are a plot to remake America, to replace American citizens with illegals who will vote for the Democrats?; and basically everything that comes out of Tucker Carlsons mouth\nOur bad!",
    "Senator Dick Durbin suggests theres an outside possibility Tucker Carlson has a soul\nYoull never believe it but Republicans dont think the latest mass shooting should lead to stricter gun control\nFauci: If Donald Trump wins in 2024, Ill have my desk cleaned out within the hour\nWhile it probably should have been pretty clear when he used his first press briefing of the Biden era to declare it was liberating to no longer have to work for an ignorant moron who lies about everything all the time, just in case anyone was holding out hope for a reunion, Anthony Fauci has said no, he will not stay on if Donald Trump ran for reelection in 2024 and won.",
    "Whether its the leader of the free world telling four congresswomen of color to go back? to the totally broken and crime-infested places from which they came,? a U.S. senator saying he wasnt afraid of the January 6 rioters but would have been worried if they were Black Lives Matter protesters, a U.S. congresswoman speaking at event put on by a white nationalist, the complete and total hysteria over the idea of children being taught about systemic racism, or a prime-time conservative hosts regular white-power hour, this hateful little ecosystem just loves to appeal to the lowest common denominator by demonizing anyone who isnt white.",
    "Cases Proliferate as U.S. Death Toll Nears One Million (NYT)\nRussias threats arent scaring Finland or Sweden away from their NATO bids (CBS)\nNew dad Pete Buttigieg says baby formula shortage is very personal? (Washington Post)\nBiden starts conceding that the bygone era of D.C. may, indeed, be gone (Politico)\nMcDonalds to leave Russia for good after 30 years (BBC)\nGoldman Sachs says senior staff can take as much time off as they want (FT)\nFox execs say absolutely no regrets? in casting Rudy Giuliani on The Masked Singer (NBC)",
    "Following the horrifying mass shooting in a Buffalo grocery store that left 10 dead after a gunman allegedly targeted Black people, The Washington Post and other outlets thought it was important to note that Stefanik, the third-ranking House Republican, among other conservatives, had previously echoed the great replacement? rhetoric (the conspiracy theory that liberal politicians are trying to replace white Americans with nonwhite immigrants).",
    "The congresswoman, though, did not appreciate any insinuation whatsoever that someone might have actually taken her words to heart, and in a statement released on Sunday, a senior adviser, Alex deGrasse, insisted that the implication or attempt to blame the heinous shooting in Buffalo on the congresswoman is a new disgusting low for the Left, their Never Trump allies, and the sycophant stenographers in the media.",
    "...which got a shoutout from Senate majority leader Chuck Schumer on Monday:\nWhile we dont have an inside line to Carlsons production meetings, its probably a pretty good guess that his monologue tonight will be something about how he (and his viewers) are now being silenced for just asking questions?the kind that lead to nearly a dozen people being killed.",
    "The shooting was an act of evil and the criminal should be prosecuted to the fullest extent of the law.? He added, Despite sickening and false reporting, [the] congresswoman has never advocated for any racist position or made a racist statement,? a claim that is obviously not true at all.",
    "In a series of Facebook ads highlighted in a tweet Saturday by Representative Adam Kinzinger, Stefaniks campaign claimed in September 2021 that Democrats were letting undocumented immigrants into the country in an attempt to ultimately silence Republican (read: white) voters.",
    "Radical Democrats are planning their most aggressive move yet: a PERMANENT ELECTION INSURRECTION,? reads one of the ads, with an accompanying image of migrants reflected in Joe Bidens sunglasses.",
    "On Monday, Team Stefanik followed that up with a press release accusing the media of disgraceful, dishonest, and dangerous? smears.",
    "Stefanik, of course, is far from the only member of her party to push racist rhetoric intended to rile up the base.",
    "In the era of Donald Trump, a major plank of the modern Republican Party platform is outright racism.",
    "And people have the audacity to suggest theyre part of the problem?",
    "Take, for instance, New York representative Elise Stefanik.",
    "But when their actions actually have consequences?",
    "It looks like we're experiencing playback issues.",
    "Well, they really get their noses out of joint.",
    "And it turns out their hate speech matters?",
    "Elsewhere!"
  ]
}