{
  "id": 5525,
  "mediaId": 129,
  "date": "d2022-05-16T00:00",
  "headline": "The Little Red Boxes Making a Mockery of Campaign Finance Laws",
  "image": "https://static01.nyt.com/images/2022/05/11/lens/00pol-redbox-schrader-negative/00pol-redbox-schrader-negative-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/05/16/us/politics/red-boxes-campaign-finance-democrats.html",
  "sentiment": "0.633",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    999,
    1459,
    1801,
    1809,
    2232,
    3103,
    562,
    2650,
    2721,
    2834,
    2850
  ],
  "sentences": [
    "His opponent, Ms. McLeod-Skinner, said in a statement, How can our party credibly argue that we will get big money out of politics in November with candidates like Schrader on the ballot??\nShe has her own red box, seeking television ads in Portland about Mr. Schraders contributions and votes, along with mailers targeting women especially? in Multnomah, Clackamas and Deschutes counties.?\nBut so far, the pro-Schrader side has vastly outspent Ms. McLeod-Skinners allies: nearly $2.1 million to around $275,000, as of Friday.",
    "In Texas, Mr. Cuellar updated his red box in April to request that his backers tell voters in the Harlingen and Laredo media markets? that Cisneros would defund the police and border patrol which would make us less safe and wreck our local economy.?\nOn April 28, a new television ad from a pro-Cuellar group began making exactly that case, exclusively in the Harlingen and Laredo media markets, at a cost of roughly $150,000, according to AdImpact, the ad-tracking firm.",
    "Ms. Foushee is running against, among others, Nida Allam, a Durham County commissioner who promotes herself as the first Muslim woman elected in North Carolina, and who has been critical of U.S. military aid to Israel being used to oppress the Palestinian people.?\nThe super PAC that Mr. Bankman-Fried is bankrolling, Protect Our Future, has spent more than $11 million in another open Oregon House race  an astounding sum to lift a political newcomer, Carrick Flynn.",
    "Red boxes are typically hidden in plain sight in Media Center? or Media Resources? sections of campaign websites that operatives know how to find, and often use thinly veiled terms to convey their instructions: Saying voters need to hear? something is a request for radio ads, see? means television, read? means direct mail, and see while on the go? usually means digital ads.",
    "On April 29, Mr. Schrader issued a not-quite-private directive inside a red-bordered box on an obscure corner of his website, sketching out a three-pronged takedown of what he called his toxic? challenger, Jamie McLeod-Skinner  helpfully including a link to a two-page, opposition-research document about her tenure as a city manager.",
    "Ms. Allam used on the go? in an April 20 red box update to request online ads telling voters  especially women, Democrats under 50 and progressives?  that she would be an unapologetic progressive.?\nThe Working Families Party used those exact words  along with other verbatim phrases  in a Facebook ad that began running on May 5.",
    "Mr. Fetterman was not above providing guidance: His site asked only for positive ads and included some biographical bullet points.Sure enough, a super PAC ran a positive ad employing some of those arguments  like the fact that he had refused to live in a state mansion to save taxpayers money.",
    "Red-boxing spans the ideological spectrum of the Democratic Party, from Blue Dog Democrats like Mr. Schrader to progressives like his challenger and Ms. Cisneros, who has the backing of the Working Families Party and Justice Democrats as she tries to unseat Representative Henry Cuellar.",
    "But the explosion of red boxes and their unabashed specificity is the latest example of how Americas system of financing political campaigns  and the restrictions put in place to curb the power of the wealthy in the wake of Watergate a half-century ago  is teetering toward collapse.",
    "The coordination of super PACs and candidates is the primary mechanism for corruption of federal campaigns in 2022.?\nIn Democratic primaries, the biggest money is often aligned with the more moderate wing of the party, and sometimes with very specific interest groups.",
    "From Oregon to Texas, North Carolina to Pennsylvania, Democratic candidates nationwide are using such red boxes to pioneer new frontiers in soliciting and directing money from friendly super PACs financed by multimillionaires, billionaires and special-interest groups.",
    "And while the tactic is not new to 2022, it is becoming so widespread that a New York Times survey of candidate websites found at least 19 Democrats deploying some version of a red box in four of the states holding contested congressional primaries on Tuesday.",
    "On May 3, a super PAC that has received all its money from a secret-money group with ties to the pharmaceutical industry began running television ads that did little more than copy, paste and reorder the precise three lines of attack Mr. Schrader had outlined.",
    "Then, they add instructions that can be extremely detailed: Steering advertising spending to particular cities or counties, asking for different types of advertising and even slicing who should be targeted by age, gender and ethnicity.",
    "The Pharmaceutical Research and Manufacturers of America, according to its most recent tax filings, reported $6.9 million in contributions to Center Forward from 2017 to 2020, accounting for nearly 25 percent of the groups revenues.",
    "While political reformers question the legality of these wink-and-nod arrangements, past complaints to the Federal Election Commission about illegal coordination involving public materials posted online have mostly gone nowhere.",
    "Adav Noti, the legal director of the watchdog group the Campaign Legal Center, said that red boxes were erasing the very barriers that were erected to make politicians feel less indebted to their biggest financial benefactors.",
    "Campaign watchdogs complain that the practice further blurs the lines meant to keep big-money interests from influencing people running for office, effectively evading the strict donation limits imposed on federal candidates.",
    "His allied super PAC, funded by $15 million from the Silicon Valley investor Peter Thiel, posted troves of internal and polling data on an unpublicized Medium page that campaign officials used to guide decisions.",
    "Black voters ages 45+ in Durham and white women ages 45+ in Orange? was the recent directive from Valerie Foushee, a Democratic House candidate in North Carolina locked in a competitive primary for an open seat.",
    "The Vance super PAC was so central to the campaign that when Mr. Vance walked onstage at a rally with Donald J. Trump, the cameraman filming him from behind worked for the super PAC, not the Vance campaign.",
    "To work around the prohibition on directly coordinating with super PACs, candidates are posting their instructions to them inside the red boxes on public pages that super PACs continuously monitor.",
    "In the House, both political parties have entire websites that are the equivalent of red boxes, with searchable databases of guidance for races across the country that will be updated by the fall.",
    "Mr. Fettermans leading rival, Representative Conor Lamb, used his own red box earlier this year to outline the attacks he hoped his supportive super PAC would broadcast against Mr. Fetterman.",
    "Liberals, voters under 50 and women  across only San Antonio, Guadalupe and Atascosa counties,? reads the targeting guidance from Jessica Cisneros, a Democratic challenger in South Texas.",
    "Facing a threat from his left flank, Representative Kurt Schrader of Oregon wanted to send an urgent message to allies ahead of his upcoming primary: It was time to go on the attack.",
    "In her race in North Carolina, Ms. Foushee, a state legislator, has been aided by more than $3 million in spending from two of the bigger new players in Democratic House races.",
    "One is a super PAC funded by an arm of the American Israel Public Affairs Committee, the pro-Israel lobbying group (a separate pro-Israel group has spent nearly $300,000 more).",
    "In short order, a television ad appeared warning Democrats that Mr. Fetterman had once been called a Silver Spoon Socialist? and that Republicans think they could crush? him.",
    "End runs around campaign limits are themselves nothing new: For years, candidates have posted flattering pictures and videos of themselves for super PACs to download and use.",
    "The challenge: Campaign finance rules bar candidates from directly coordinating with the very outside groups that Mr. Schrader, a top moderate in Congress, needed to alert.",
    "A complaint about a top adviser to Pete Buttigiegs 2020 campaign tweeting a request for specific television ads, which a super PAC then produced, was recently dismissed.",
    "The boxes highlight the aspects of candidates biographies that they want amplified and the skeletons in their opponents closets that they want exposed.",
    "The National Republican Congressional Committee posts at democratfacts.org; the Democratic Congressional Campaign Committee uses dccc.org/races.",
    "Center Forward Committees funds this year have come exclusively from an affiliated nonprofit, Center Forward, that does not disclose its donors.",
    "John Fetterman of Pennsylvania, a leading candidate in Tuesdays Democratic Senate primary, posted this year to make suggestions to super PACs.",
    "Federal candidates can legally raise only $2,900 for a primary per donor; super PACs can receive donations of $1 million  or even more.",
    "The commission has given wide leeway to publicly available internet materials,? saying they do not constitute illegal coordination.",
    "It is not clear why Democratic candidates have so thoroughly embraced the red box tactic in primaries while Republicans have not.",
    "In 2014, some Republican groups tried using anonymous Twitter accounts to share internal polling data through coded tweets.",
    "Earlier in his race in Oregon, Mr. Schrader posted his congressional vote ratings by a number of different interest groups.",
    "Mr. Schrader was one of three House Democrats to vote down a Democratic plan to control prescription drug prices last year.",
    "The super PAC that also leveled the attacks he wanted, Center Forward Committee, ran an ad playing up those very ratings.",
    "Candidates update their messaging guidance, essentially scripting super PAC ads for different stages of the campaign.",
    "The lax enforcement has emboldened candidates and parties to publish more and more specific instructions.",
    "And the other is a super PAC financed chiefly by the 30-year-old crypto billionaire Sam Bankman-Fried.",
    "This page only exists because of our broken campaign finance system,? reads a web page that Lt. Gov.",
    "Facebook records show that 95 percent of the ads impressions were with women and people under 54.",
    "At least one of the many ads run in the race echoes the language in Mr. Flynns red box.",
    "It also echoed verbatim the recommended talking points about Mr. Lambs background.",
    "Republicans work hand in glove with their super PACs, too, but in different ways.",
    "Mr. Schraders campaign and Center Forward declined to comment on his red box.",
    "Vance outsourced some of his Ohio Senate campaigns most basic operations.",
    "(Like some others, he did not surround his instructions in a red box.)",
    "The measure was heavily opposed by the pharmaceutical industry.",
    "Mr. Schrader said he preferred an alternative measure.",
    "The practice is both brazen and breathtakingly simple.",
    "So instead, he used a little red box.",
    "Aishvarya Kavi contributed reporting.",
    "Were keeping score,? the ad began.",
    "The message was received.",
    "Red boxes arent static.",
    "Its a joke,? he said.",
    "More recently, J.D."
  ]
}