{
  "id": 5529,
  "mediaId": 238,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Opinion The Buffalo shooters views are mainstream on the right",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/15/buffalo-shooter-hate-tucker-carlson/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Boot",
  "authorUrl": "https://www.washingtonpost.com/people/max-boot/",
  "termIds": [
    683,
    2087,
    2213,
    2524,
    3103,
    4153,
    199,
    428,
    4938
  ],
  "sentences": [
    "Like many on the right, he is enraged by what he imagines to be mass immigration? and is convinced that it will destroy our cultures, destroy our peoples.?\nHe believes there is a plot to replace White Americans with people of color; he even referred to his victims as replacers.? He is also violently antisemitic and blames the Jews [for]  spreading ideas such as Critical Race Theory and white shame/guilt to brainwash Whites into hating themselves and their people.? He condemns elitists and globalists? and singles out George Soros  a favorite target of the right  for his funding for the radical left.?\nThe young man wrote that he got his beliefs mostly from the Internet,? specifically from the 4chan bulletin board where white supremacists congregate.",
    "Vance, the GOP Senate nominee in Ohio (who, like Masters, is bankrolled by billionaire Peter Thiel), offers an even sicker twist on this demented theory: He says that Democrats are not only opening the borders to create a shift in the democratic makeup of this country? but that President Biden is deliberating letting fentanyl into the country to kill a bunch of MAGA voters in the middle of the heartland.?\nLittle wonder that a poll taken in December found that nearly half of all Republicans believe that there is a plot to replace? native-born Americans with immigrants.",
    "Can you think, for example, of other institutions such as, I dont know, marriage or military units in which the less people have in common, the more cohesive they are??\nIn 2021, Carlson went even further and openly embraced the great replacement? theory that inspired the Buffalo shooting as well as the earlier white-supremacist attacks in Pittsburgh, El Paso and Christchurch.",
    "In his manifesto, he expressed concern that, after his attack, gun control policies will be brought forth to the state and federal government,? including Calls to ban high-capacity magazines, assault weapons including AR-15s, and even items such as body armor.? He need not worry: Republicans will never permit these sensible reforms to pass.",
    "It was a conservative writer who coined the phrase ideas have consequences.? The mass shooting at a Buffalo supermarket on Saturday, which left 10 people dead, shows the consequences of two of the horrific ideas that have taken root on the American right: support for the great replacement? theory and opposition to gun control.",
    "A few hours after the Buffalo shooting, Arizona Senate candidate Blake Masters (R) posted a video saying: The Democrats want open borders so they can bring in and amnesty **tens of millions** of illegal aliens  thats their electoral strategy.? J.D.",
    "He suggested that the Democratic Party is trying to replace the current electorate, the voters now casting ballots, with new people, more obedient voters from the Third World.? (His Fox News colleague Laura Ingraham has said the same thing.)",
    "And how does diversity increase that strength??\nThis is close to what Tucker Carlson, the most popular host on the Fox News? Channel, said in 2018 and has often repeated: How, precisely, is diversity our strength?",
    "A number of Republican politicians, including Rep. Matt Gaetz (Fla.), Rep. Scott Perry (Pa.) and Sen. Ron Johnson (Wis.), have openly espoused the great replacement? theory too.",
    "Republicans, of course, will insist that they never intend for anyone to commit murder, but a growing number of GOP politicians have engaged in violent rhetoric.",
    "This theory was tested in Buffalo and found wanting: A retired cop working as a security guard was killed trying to stop the gunman, who was wearing body armor.",
    "After the Buffalo attack, Biden issued a statement: Hate must have no safe harbor.? Unfortunately hate continues to enjoy a safe harbor on the American right.",
    "Instead, they will offer thoughts and prayers? and claim that the way to stop mass shootings is to make guns more widely available to law-abiding citizens.",
    "Echoing the Christchurch, New Zealand, shooter, who killed 51 people at two mosques in 2019, the Buffalo gunman attacked ethnic diversity.",
    "The 18-year-old arrested for the mass shooting posted a lengthy manifesto explaining his reasons for wanting to murder African Americans.",
    "But Foxs chief executive, Lachlan Murdoch, stood by him, allowing his network to continue spewing racist vitriol.",
    "Even those who dont advocate violence have made it easier to carry out by eviscerating the gun laws.",
    "Fox talking heads and Republican politicians have mainstreamed white supremacist ideology.",
    "Since youve made this our new national motto, please be specific as you explain it.",
    "The Buffalo terrorist, like so many other mass shooters, used an assault weapon.",
    "But his repugnant views are not confined to an obscure corner of the Internet.",
    "Said throughout the media, spoken by politicians, educators and celebrities.",
    "Why is diversity said to be our greatest strength?? his manifesto demanded.",
    "(I will not use his name or link to his twisted explanation.)",
    "The Anti-Defamation League demanded that Fox fire Carlson.",
    "They have become mainstream within the Republican Party.",
    "But no one ever seems to give a reason why.",
    "What gives a nation strength?",
    "And the casualties pile up."
  ]
}