{
  "id": 5530,
  "mediaId": 151,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "McConnell takes on MAGA with Ukraine visit",
  "image": "https://www.politico.com/dims4/default/b97f229/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F83%2F4f%2Fbe929ff94153a22627973e2c4b69%2F20220515-mcconnellukraine-ap-773.jpg",
  "link": "https://www.politico.com/news/2022/05/15/mcconnell-maga-ukraine-visit-00032572",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    991,
    1341,
    1501,
    1765,
    3103,
    562,
    571,
    2744,
    2888,
    2942
  ],
  "sentences": [
    "And the first place to stop him is in Ukraine.?\nMcConnell didnt stop there: He said the United States should be first in line? to ratify potential new NATO members Finland and Sweden, wants President Joe Biden to designate Russia as a state sponsor of terror and said its his hope that not many members of my party will choose to politicize this issue.?\nMcConnell and Senate Majority Leader Chuck Schumer made a rare joint request for a quick vote on the $40 billion aid legislation on Thursday, but Paul said no, pushing the legislation into this week.",
    "Sen. Bill Hagerty (R-Tenn.) explained the view of the Senate conservatives toward Ukraine on Fox News on Friday: We dont want to see them fail, but we have problems right here at home.?\nIts not clear when congressional leaders believe they will need to approve another request for Ukraine  the last $14 billion in aid was sent over in March.",
    "McConnell conceded the war could drag on? and said Zelenskyys goal is to secure Ukrainian borders and obviously, that would mean the Russians need to go back to Russia.?\nThe politics are playing out even more acutely in the Senate races that could make McConnell majority leader.",
    "Vance hit Democratic opponent Rep. Tim Ryan for pushing billions in foreign aid while the communities he serves in Congress have been decimated.?\nYet for a Republican leader trying to make sure his party doesnt turn away from the rest of the world, supporting it is a no-brainer.",
    "The GOP leader argues the United States will be there for Ukraine as long as it takes and that theres broad bipartisan support for helping them? despite 57 no votes in the House on the package and Sen. Rand Pauls (R-Ky.) unilateral delay of the legislation in the Senate.",
    "The Senate minority leaders secret visit to Kyiv this weekend to meet with Ukrainian President Volodymyr Zelenskyy, along with McConnells staunch advocacy for the $40 billion Ukraine aid bill in Congress, is putting him at odds with his partys non-interventionist wing.",
    "Pennsylvania Republican Senate candidate Kathy Barnette challenged McConnell directly: Why is Leader McConnell visiting Ukraine in the midst of the various crises right here in America?? But McConnell is unbowed.",
    "Nevada GOP candidate Adam Laxalt attacked Democratic Sen. Catherine Cortez Masto of Nevada for not rejecting this shockingly abhorrent proposal? and Ohio GOP Senate nominee J.D.",
    "A growing number of GOP lawmakers, candidates and former President Donald Trump are hitting the effort to send billions to Ukraine as misguided given domestic problems at home.",
    "He predicted it will pass relatively easily, signally that an overwhelming majority? of Republicans support sending billions and billions more to Ukraine  for now at least.",
    "Paul is seeking to amend the legislation to beef up oversight, but McConnell said Congress has already addressed that issue in previous legislation: Its a good idea.",
    "McConnell addressed his disagreement with Paul, whose blockade prevented McConnell from traveling to Ukraine with a fresh congressional victory in hand.",
    "| Ukrainian Presidential Press Office via AP\nBy Burgess Everett\n 05/15/2022 12:15 PM EDT\nIts Mitch McConnell vs. MAGA when it comes to Ukraine.",
    "Weve already done it.?\nAt least a half-dozen Republican senators are expected to oppose the aid bill, according to one Republican senator.",
    "Ukrainian President Volodymyr Zelenskyy, left, shakes hands with Senate Minority Leader Mitch McConnell in Kyiv, Ukraine, on May 14, 2022.",
    "Perhaps most important, McConnell is directly rejecting the notion that helping Ukraine comes at the expense of the United States.",
    "And in private meetings an increasing number of GOP senators have questioned various aspects of the request.",
    "So this is not some handout,? McConnell told reporters on Sunday in a call after his visit with Zelenskyy.",
    "This is to prevent this ruthless thug [Vladimir Putin] from beginning a march through Europe.",
    "Rand and I have a different world view of the importance of Americans role around the world.",
    "Its in our interests to help Ukrainians just like its in the interest of NATO countries.",
    "And obviously, there will be others who have a different point of view.",
    "Its important and in Americas best interest to pass it.",
    "Well get the job done by Wednesday,? McConnell said.",
    "Susan Collins (R-Maine), John Barrasso (R-Wyo.)",
    "Thats the way democracy works,? McConnell said.",
    "This is not a charity were involved in here.",
    "Bipartisan support doesnt imply unanimity.",
    "He was accompanied on his trip by Sens.",
    "Its in Americas interest to do this.",
    "And it wont create a problem.",
    "So that was not surprising.",
    "and John Cornyn (R-Texas).",
    "Well, its no secret."
  ]
}