{
  "id": 5531,
  "mediaId": 169,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Mass shooting in Buffalo: Tucker Carlson and other right-wing conspiracy theorists share the blame",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/05/gettyimages-1240669575.jpg",
  "link": "https://www.salon.com/2022/05/15/mass-in-buffalo-tucker-carlson-and-other-right-wing-conspiracy-theorists-share-the/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Marcotte",
  "authorUrl": "https://www.salon.com/writer/amanda_marcotte",
  "termIds": [
    3103
  ],
  "sentences": [
    "As has become far too common with these kinds of mass murders, Gendron reportedly live-streamed the massacre on video, and apparently also published a manifesto that echoes many of the paranoid right-wing talking points one can hear every day streaming from the mouths of Fox News hosts and Republican politicians: a series of scurrilous lies about \"critical race theory,\" George Soros and the \"great replacement.\"",
    "Indeed, as the shooting was unfolding in Buffalo, there was an overt call for right-wing violence at Trump's rally in Austin, Texas, where oock geezer turned gun advocate Ted Nugent told the crowd of 8,000 that he'd \"love\" it if they all \"went out and just went berserk on the skulls of the Democrats and the Marxists and the communists.\"",
    "As Media Matters researcher Nikki McCann Ramirez has documented, Carlson is obsessed with this idea that the people he calls \"legacy Americans\"  a not-so-veiled euphemism for white Christians of European ancestry  are under siege from shadowy forces flying the banner of diversity.",
    "The \"great replacement\" theory fits in with the larger pattern of right-wing Republicans (especially our former president and his allies) and Fox News pundits encouraging not just right-wing paranoia, but the inevitable acts of violence that flow from it.",
    "Over this past winter, Fox News, Trump and other GOP leaders made another big push towards political violence, hyping outrageous conspiracy theories about COVID vaccines and encouraging their audiences toward aggressive acts of so-called resistance.",
    "Just this week, the conspiracy theory got another round of hype as Republican pundits and politicians pretended to believe that President Biden was stealing baby formula from Americans to feed \"illegals,\" their slur for refugees applying for asylum.",
    "Like many of the far-right Republicans in Congress, Trump has also made a martyr out of Ashli Babbitt, the QAnon believer who was shot during the Capitol riot when she tried to break into a secure area and quite likely attack members of Congress.",
    "Carlson, meanwhile, has been at the forefront of popularizing various often contradictory conspiracy theories, mostly intended to portray the Jan. 6 insurrectionists as noble patriots and lambaste any Republican who dares say otherwise.",
    "In the 16 months since Jan. 6, 2021, Donald Trump and the hosts Fox News hosts  especially its top-rated personality, Tucker Carlson  haven't exactly been subtle in approving of what happened and longing to see more right-wing violence.",
    "Carlson has also explicitly linked this conspiracy theory to the threat of violence, repeatedly \"warning\" that America faces a new civil war unless these fictional conspirators stop trying to \"replace\" his cherished \"legacy Americans.\"",
    "After all, this is just the latest in a series of mass shootings inspired by the \"great replacement\" theory, including the Walmart shooting in El Paso that left 23 dead and the synagogue shooting in Pittsburgh in which 11 people died.",
    "Other Jan. 6 defendants have also become more confrontational, including pulling a gun on probation officers, acquiring new guns in defiance of a court order, or claiming that their actions on that day amounted to \"self-defense.\"",
    "He uses anodyne terms like \"demographic change\" to make the point, but has gotten bolder more recently, using the word \"replacement\" to make it even clearer that he's borrowing his ideas from the white-supremacist fringe.",
    "The point of this fake outrage will be to make it too emotionally exhausting to hold them accountable, and to reinforce the ridiculous victim complex that fuels the American right as it increasingly slides into fascism.",
    "When called out for stoking a conspiracy theory that is likely to inspire violence, Carlson inevitably plays the victim, accusing liberals of being \"hysterical\" and characterizing these criticisms as \"cancel culture.\"",
    "And all of the above doesn't even touch on the way Republican politicians and right-wing media have mainstreamed the QAnon conspiracy theory by regularly slurring Democrats, LGBTQ folks and their allies as \"groomers.\"",
    "The alleged shooter who killed 10 people and injured three others in a Buffalo supermarket is 18-year-old Payton Gendron, who appears to have target a busy location in a predominantly Black neighborhood.",
    "As with Carlson, these threats are often packaged as \"warnings,\" as when Trump declared on Fox News in February, \"You can push people so far and our country is a tinderbox too, don't kid yourself.\"",
    "A poll conducted in December showed that nearly half of Republican respondents buy into the idea that there's a conspiracy to \"replace\" white Christians with different racial and ethnic groups.",
    "While these GOP leaders and media personalities are generally careful to avoid direct calls for violence, their overall message of sympathy and support for right-wing terrorism is undeniable.",
    "According to a New York Times analysis, in fact, Carlson has invoked the \"great replacement\" theory in over 400 episodes of his show, one of the most popular cable news shows in the country.",
    "Around the same time, Carlson, Sean Hannity, Carlson and Glenn Beck all started pushed the idea that anti-vaccination fanatics were potentially justified in using violence as \"self-defense.\"",
    "Last week, one of the most prominent ringleaders on the insurrection, Tim \"Baked Alaska\" Gionet, a troll to the very end, dramatically declared at a hearing that he was changing his plea.",
    "This only encourage his viewers to embrace the conspiracy theory even more, telling themselves that they (and he) are bold truth-tellers fighting against the forces of liberal oppression.",
    "Republican leaders in Congress voted down Trump's impeachment only weeks after the riot and have tried to block congressional efforts to uncover exactly how the attempted coup went down.",
    "A cabal of rich Jewish people, the theory holds, has conspired to \"replace\" white Christian Americans with other races and ethnic groups in order to gain political and social control.",
    "He had agreed to plead guilty to a lesser offense, but now wants to plead not guilty, even though he filming himself inside the Capitol during the riot and put the evidence online.",
    "Carlson doesn't actually say \"Jews,\" and generally blames the sinister plan on Democrats, socialists or unspecified \"elites,\" but otherwise has kept the conspiracy theory intact.",
    "The most straightforward example of this, of course, is the relentless rewriting of the history of Jan. 6, which began in the immediate aftermath and continues to this day.",
    "It also serves to inspire or encourage potential acts of violence, by dehumanizing their targets and creating a delusional narrative that makes such attacks seem justified.",
    "Those who would support deliberately starving babies for racist and xenophobic reasons aren't likely to feel any real empathy for the victims and their families in Buffalo.",
    "Many of the people arrested for their actions on Jan. 6 , 2021, have stopped being apologetic about what they did, and are now portraying themselves as martyrs and heroes.",
    "Since those massacres, the \"great replacement\" theory has only become more popular with Republican voters, largely thanks to Carlson and similar figures on the right.",
    "We cannot legitimately hope that they will be chastened by this latest round of violence, but we can make clear that their hateful rhetoric helped to unleash it.",
    "But let's understand this feigned outrage for what it is: an attempt to leverage an act of terrorism in a way that leads people to accept it or even condone it.",
    "Most Republican voters, along with the party's leadership, are more interested in making excuses for Trump's coup than holding anyone accountable for it.",
    "they will proclaim, in almost hysterical terms, acting shocked, shocked, that anyone would suggest that their words have had horrible consequences.",
    "Perhaps the horror unleashed in Buffalo on Saturday will cause Carlson and his allies to rethink their paranoid, racist and inflammatory rhetoric.",
    "Trump has publicly mused about issuing pardons to the Capitol insurrectionists if he wins back  or rather steals back  the White House in 2024.",
    "That's why the how-dare-they posturing we will almost certainly see from Carlson and other right-wing pundits in coming days so predictable.",
    "Unsurprisingly, there has been a concurrent rise in hate crimes, of which this Buffalo shooting is merely the most dramatic recent example.",
    "This article, for instance, will quite likely be characterized as hysterical name-calling or an attempt to censor bold political speech.",
    "That proportion has probably risen since then, as Carlson's deluge has further mainstreamed this delusional and dangerous notion.",
    "Demonizing political opponents with false allegations of pedophilia is unbelievably slimy, even by Republican standards.",
    "(Antisemitism remains the mix by singling out individual Jewish people especially Soros, as the alleged ringleaders.)",
    "No doubt we will be hear a great deal of umbrage in the coming days from Republican leaders and right-wing pundits.",
    "This particular paranoid hypothesis is deeply rooted in neo-Nazi and other white nationalist circles.",
    "Greg Abbott and Attorney General Ken Paxton, who have slavishly proven their loyalty to him.",
    "In his speech afterward, Trump praised Republican politicians in Texas, including Gov.",
    "The \"great replacement\" theory has been a favorite of Carlson's for some time now.",
    "So Saturday's mass shooting in Buffalo, while horrifying, is really no surprise.",
    "They have been encouraging violence, and violence is what they got.",
    "It's not like Carlson only invokes this narrative on occasion.",
    "It has also become popular with Republicans, including J.D.",
    "But let's not mince words: These folks share the blame.",
    "Vance, the Republican nominee in Ohio's Senate race.",
    "In fairness, why shouldn't they feel emboldened?",
    "Subscribe to her newsletter Standing Room Only.",
    "The GOP base has been getting the message.",
    "Want more Amanda Marcotte on politics?",
    "Now a familiar refrain will commence.",
    "That is doubtful, however.",
    "\"How dare you blame us?\""
  ]
}