{
  "id": 5532,
  "mediaId": 238,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Opinion Sorry, Democrats, there is no Supreme Court legitimacy crisis",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/15/supreme-court-dobbs-legitimacy/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Willick",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "Breyer observed that Chief Justice John Marshall in Marbury v. Madison strengthened the norm of judicial review? by ruling in a way strategically designed to avoid the risk that the president would ignore what the Court ordered.? Overturning Roe would also be a high-profile use of judicial power that the elected branches couldnt readily resist or nullify.",
    "The delay in striking down bans on interracial marriage until 1967s Loving v. Virginia, according to Breyer, was a calculated part of the Courts enforcement strategy.?\nIf Justice Samuel A. Alito Jr.s leaked opinion overturning Roe is the judgment of the court, it may be unpopular; we dont know yet.",
    "Justices Sonia Sotomayor and Elena Kagan both objected at the Dobbs oral argument that the courts abortion jurisprudence was swinging rightward due solely to changes in its membership; Sotomayor questioned whether the court would survive the stench.? But what is the alternative?",
    "Alexander Hamilton famously foresaw that the judiciary would have no influence over either the sword or the purse.? It cant threaten violence or control public funds and so is in continual jeopardy of being overpowered? by elected officials.",
    "Progressive commentary on Dobbs v. Jackson Womens Health Organization, the abortion rights case, tends to assume that a popular decision would enhance the courts legitimacy, while a less-popular decision would erode it.",
    "Vance, the Trump-endorsed favorite to be Ohios next senator, was quoted in Vanity Fair last month saying he would tell Donald Trump in a second term to imitate President Andrew Jacksons defiance of the Supreme Court.",
    "The court would not be wise in those delicate cases either to blindly follow opinion polling or to adopt interpretations of the law so disconnected from political reality that they could be ignored.",
    "Democratic rhetoric about an illegitimate? or stolen? conservative court majority may create the conditions for progressive elected officials to try defying the law in the future.",
    "The political storm bearing down on the Supreme Court because it seems poised to overturn Roe v. Wade shows that the institution is losing legitimacy,? or so its critics insist.",
    "But one reason partisans work so hard to control the courts membership and influence the justices is their belief that rulings will be widely respected and difficult to defy.",
    "Instead, the court must practice a kind of realpolitik  selecting areas where it can have influence, and boxing the elected branches into compliance until it becomes a habit.",
    "Modern conservatives are more likely to believe that the court is legitimate when it interprets the law strictly according to its text, irrespective of public opinion.",
    "Rhetorical assaults on the court will continue, but progressives will be disappointed if they expect its authority to simply dissolve in the crucible of partisan fury.",
    "But those efforts could only succeed in narrow circumstances  say, in an ultra-blue state inflamed by a ruling expanding gun rights or limiting racial preferences.",
    "His 2021 Harvard lecture, The Authority of the Court and the Peril of Politics,? challenges both progressive and conservative views of judicial legitimacy.",
    "That meant the court, lacking a sword? of its own, had to weigh the public response to its rulings if it wanted them to amount to more than legal advice.",
    "Besides Chief Justice John G. Roberts Jr., the justice who has thought most deeply about this question may be the retiring Justice Stephen G. Breyer.",
    "It did, but it won with the cooperation of the President of the United States.?\nThe presidents intervention in such situations was not assured.",
    "Yet the courts enhanced standing among conservatives, thanks partly to decisions like Dobbs, might make such a maneuver less likely to succeed.",
    "Brown v. Board of Education (1954), which ordered the end of Jim Crow educational segregation, put the courts legitimacy directly to the test.",
    "President Dwight D. Eisenhower ultimately ordered the Armys 101st Airborne to force Faubus and the Arkansas National Guard to stand down.",
    "For the court to change direction without a change in membership  as the New Deal-era court did under political pressure in 1937?",
    "The parachutists took the nine brave black students by the hand and walked them into the formerly white school,? Breyer wrote.",
    "Norms around the Supreme Court  broad Senate support for nominees, and now the secrecy of deliberations  have lost currency.",
    "The courts legitimacy is tested most, Breyers examples show, when it orders elected officials to take actions they oppose.",
    "The attorney general and president, unlike Eisenhower, would need to be complicit with the state-level radicals.",
    "This approach might not always make the court popular, but it yields decisions that are intellectually honest.",
    "Progressives and conservatives increasingly disagree about how that legitimacy has been built and maintained.",
    "But the coming decision could have the opposite effect and strengthen the courts public standing.",
    "One theory, seductive in an age of ubiquitous polling, is that legitimacy equals popularity.",
    "The Supreme Courts defense is its legitimacy  the general acceptance of its rulings.",
    "Orval Faubus (D) blocked the Little Rock Nine from integrating Central High.",
    "After all, abortion policy would be decided by political majorities.",
    "Breyers most poignant examples come from the civil rights era.",
    "But that controversy need not damage the courts authority.",
    "That hardly suggests an independent or apolitical body.",
    "So the court won this confrontation, did it not?",
    "Congress would need to be quiescent.",
    "What is judicial legitimacy, anyway?",
    "It will certainly be controversial.",
    "Three years later, Arkansas Gov.",
    "Whos right?",
    "J.D."
  ]
}