{
  "id": 5534,
  "mediaId": 19,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Exclusive  Katie Britt: Congress Should Finish Building the Wall Before Sending Ukraine $40 Billion",
  "image": "https://media.breitbart.com/media/2022/05/KB-pond-DSC_7385-scaled-e1623670193159-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/05/15/exclusive-katie-britt-congress-should-finish-building-wall-before-sending-ukraine-40-billion/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    3103
  ],
  "sentences": [
    "Unfortunately, we have way too many people in D.C. that the last time they had to feed a child was you know, a solid 62 years ago.?\nBritt added that the best thing America could do for Ukraine is restarting American energy.?\nWhat we should be doing right now is investing in onshoring our manufacturers, you know, you look at the semiconductors, you look at medicines, 90% of our antibiotics are made in China,? she continued.",
    "You end the chain migration system, you create a merit based system, like you see in Canada and Australia, so that America is accepting immigrants that will actually raise our average wage base, not reduce it.?\nBritt also called out big tech companies for displacing our workers? by replacing American-educated workers with foreign ones.",
    "She also called on the Senate to have companion legislation to Rep. Jim Banks (R-IN) American Tech Workforce Act, which would amend the Immigration and Nationality Act to reform the H1B visa program that big tech companies use to maintain their foreign-born workforce.",
    "We have too many Yes men and women and politicians in D.C. that just do what theyre told instead of asking tough questions.?\nShe applauded Sen. Rand Paul (R-KY) for being one of the lone congressmen to stand up against this massive Ukrainian aid package.",
    "Katie Britt, former Business Council of Alabama CEO and president, condemned Congress $40 billion Ukrainian aid package and told Breitbart News that Congress should finish building the wall? or handle the baby formula shortage? before helping Ukraine.",
    "And so youve got to rewind all the way back to Ted Kennedys 1965 Immigration and Naturalization Act, that is the point in which you can watch American wages go down, you can watch the composition of what is happening to our nation change right there.",
    "And I continue to say, the best thing we could do for Ukraine, the best aid we could give to the world is restarting American energy.?\nBoyle asked Britt what she would do to get the Senate moving in the right direction if she were in office.",
    "And we see this, particularly in the STEM area where big tech is displacing our workers, our American educated workers, with foreign workers, paying them less and driving the wages that our American workers should get down,? Britt said.",
    "Britt called for reinstituting former President Donald Trumps immigration policies and explained that former Sen. Ted Kennedys Immigration and Naturalization Act started the increase in mass migration into the United States.",
    "Well, first off, we need people that are willing to stand up and fight, you know, youve got to create the conversations, youve got to ask the questions, you cannot be afraid, you cannot go along to get along,? she said.",
    "And look at medical equipment and other things, but unfortunately our leaders are not taking time to take a look and say, how can we best help Ukraine? Yes, lets get them the resources they need.",
    "And we continue to not put on our mask first.?\nThe conversation switched gears towards immigration when Britt explained the impact unfettered immigration has on the American economy.",
    "We have to continue to look for ways to put America first.?\nBritt compared putting America first to being on an airplane and putting your mask on first before helping others.",
    "LISTEN:\nHost Matthew Boyle opened the interview talking about Britts recent surge in the polls, which she attributed to her energy? and passion? for the America first agenda.",
    "If we dont take a look at our immigration system, we are never going to be able to drive up American wages and send Americans and their families into prosperity,? she said.",
    "I mean, we saw it under President Trump, we saw, you know, the importance of building the wall and having the right type of immigration policy, taking a look at the courts.",
    "It also created chain migration, which I believe we have to end.?\nBritt pointed to Sen. Tom Cottons (R-AR) RAISE Act as a good example of America first immigration policy.",
    "They want new blood, they want fresh blood, they want someone who will shake things up in Washington, they want somebody who will really advance the America first agenda.",
    "I think somebody said it best to me the other day, they said, the Democrats are woke, but the Republicans are finally awake. And we see what is in front of us.",
    "She identified many ways immigration harmed the economy and called out her opponent, Mike Durant, for saying that more immigration is an America first? policy.",
    "First and foremost, you would handle the baby formula shortage so that were not in crisis that moms and dads across this nation are not in crisis,? Britt said.",
    "And let me tell you, I am all about helping and supporting the Ukrainian people against Russia, but we have to be smart about this,? Britt said.",
    "Britt, former chief of staff of retiring Alabama Sen. Richard Shelby (R), said:\nIt is clear on the campaign trail that people want new blood.",
    "Britt said Congress should have acted on the ongoing baby formula shortage or finished building the wall before sending money to Ukraine.",
    "Were going to actually get something done.?\nBreitbart News Saturday airs on SiriusXM Patriot 125 from 10:00 a.m. to 1:00 p.m. Eastern.",
    "The two discussed Congresss recent $40 billion relief package sent to Ukraine and highlighted better ways to spend taxpayer dollars.",
    "I mean, and making sure we had good conservative judges on the courts and understand that you dont make law you interpret law.",
    "And so its that energy, that passion, that is getting people excited, and it has pushed us forward in this race,? she added.",
    "And they want someone with the passion, the energy, the fire, and the intelligence to go really move our country forward.",
    "Britt concluded the interview by emphasizing the importance of an America first agenda and its impact on the country.",
    "They are sick of people talking about it, and saying the right things but not actually getting anything done.",
    "And Im going to take that same work ethic, that same passion, the same energy to the United States Senate.",
    "And they say if something goes wrong, put your mask on first before you put on someone elses, right?",
    "And that busted, as you know, the cap on the number of immigrants that were able to come here.",
    "You have got to remember you are here to serve our nation and serve the people of your state.",
    "Vance are the only two candidates discussing the various visas big tech companies exploit.",
    "You look at reducing the number of immigrants allowed into the country by 50%,? she said.",
    "And we were talking, you know, when youre on the airplane, right?,? Britt said.",
    "You know, were working hard across the state for the grassroots candidate.",
    "Britt said she and Vance are the new blood? voters want to see in office.",
    "So if you take a look at Senator Tom cottons RAISE act, it is spot on.",
    "And now we are seeing the effects of that firsthand,? she continued.",
    "Boyle noted that Britt and Ohio Republican Senate nominee J.D.",
    "And so I am thrilled to to be building this coalition.",
    "We know the America and America first agenda works.",
    "Nobody is going to work harder,? Britt concluded.",
    "If youve got $40 billion, what would you do?",
    "I mean, who thinks thats a good idea, Matt?",
    "Literally, we are everywhere in this state.",
    "You know, someone was saying America first.",
    "And they were kind of in my face about it.",
    "But lets do it smart and strategically.",
    "You would finish building the wall.",
    "And I said I stand firm on it.",
    "This is pretty simple, right?"
  ]
}