{
  "id": 5535,
  "mediaId": 129,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "How Hollywood and the Media Fueled the Political Rise of J.D. Vance",
  "image": "https://static01.nyt.com/images/2022/05/16/arts/00vance-book-film/merlin_180254025_6940814b-3185-4909-83eb-cb8bcf6f594c-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/05/15/arts/jd-vance-trump-hollywood.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Tracy",
  "authorUrl": "https://www.nytimes.com/by/marc-tracy",
  "termIds": [
    683,
    1147,
    1793,
    2227,
    2524,
    3103,
    3847,
    4109,
    4188,
    2700,
    2945
  ],
  "sentences": [
    "An ad last month for Josh Mandel, a Republican who ran against Mr. Vance in the primary, said Mr. Vance wrote a book trashing Ohioans as hillbillies, then sold his story to Hollywood.? And Elizabeth Walters, the chairwoman of the Ohio Democratic Party, charged that Mr. Vance had landed a New York City book deal to cash in on Ohioans pain? and made untold millions from a Netflix Hollywood movie.?\nAccepting the nomination, Mr. Vance attacked a Democrat party that bends the knee to major American corporations and their woke values, because the Democrats actually agree with those ridiculous values, you know, 42 genders and all the other insanity.?\nThe fact that a rising star in the Republican Party, which has recently emphasized cultural grievances with the likes of Twitter, CNN and Disney, came to prominence through elite media institutions is not surprising to scholars and cultural critics who have long understood the symbiotic relationship between those ostensible antagonists: the conservative movement and the media-entertainment complex.",
    "Where would Trump be without NBC Universal, Mark Burnett, the whole showbiz world??\nKathryn Cramer Brownell, an associate professor of history at Purdue University, situated Mr. Vance in a lineage of figures from the entertainment world who became Republican politicians, including George Murphy, an actor turned senator from California; Ronald Reagan, whose success as a film actor helped him become California governor and president; Arnold Schwarzenegger, another movie star and California governor; and Mr. Trump, a longtime tabloid fixture who gained newfound celebrity during the 2000s as host of the NBC reality competition show The Apprentice,? created by Mr. Burnett.",
    "Frank Rich, an essayist, television producer, and former New York Times critic and columnist, said that some of the contemporary Republican Partys biggest stars  including Mr. Vance, Mr. Trump and Senator Josh Hawley of Missouri  are the products of elite institutions? whose constant railing against the elites is just odd, because its so disingenuous.?\nWhere would Vance be if it hadnt been for mainstream publishing and book promotion, if it hadnt been for Ron Howard  an important person in show business who identifies as liberal  and Glenn Close and Netflix?? Mr. Rich asked.",
    "Many of the entities in publishing and Hollywood who helped fuel Mr. Vances rise  including HarperCollins, which published his book; Mr. Howard and his co-producer, Brian Grazer; and Netflix, which financed and distributed the film  declined to comment on his reinvention as a Trumpist who rails against elites and who campaigned with polarizing far-right figures, including Representatives Marjorie Taylor Greene of Georgia and Matt Gaetz of Florida.",
    "Hillbilly Elegy,? which came out as Donald J. Trump was overcoming long odds to win the presidency, became a phenomenon, and Mr. Vance  a conservative who reassured Charlie Rose that fall that he was a Never Trump guy? and never liked him,? and later said he voted for a third-party candidate that year  became widely sought out for his views on what drove white working-class Trump supporters, particularly in the Rust Belt.",
    "Though Hillbilly Elegy was read widely across the political spectrum, my impression was that the book helped liberals to understand the causes of what had happened to them in the election of 2016,? said Adrian Zackheim, the publisher of several Penguin Random House imprints, including Sentinel, which focuses on conservative books.",
    "Mr. Vance, who once called Mr. Trump reprehensible,? thanked Mr. Trump for giving us an example of what could be in this country.?\nMr. Trumps endorsement proved critical in the race, along with the financial support of Peter Thiel, the conservative Silicon Valley billionaire, and favorable coverage by Tucker Carlson on Fox News.",
    "They wouldnt have touched Vance with a 10-foot pole if they thought he was part of this Trump, xenophobic, bigot-fueled zeitgeist.?\nMr. Howard, who has said that he sought to downplay the political implications of Hillbilly Elegy? in directing the film, describing it as a family drama, declined to comment for this article.",
    "Members of New Yorks smart set gathered on a warm Thursday evening in the early summer of 2016 at the ornately wallpapered apartment of two Yale Law School professors in the elegant Ansonia building on Manhattans Upper West Side to toast a Marine Corps veteran, venture capitalist and first-time author named J.D.",
    "But Mr. Vances political rise was also made possible by the worlds of publishing, media and Hollywood, fields long seen as liberal bastions, which had embraced him as a credible geographer of a swath of America that coastal elites knew little about, believing that he shared their objections to Mr. Trump.",
    "In an afterword added to the paperback edition, Mr. Vance wrote that despite his reservations about Mr. Trump, there were parts of his candidacy that really spoke to me,? citing his disdain for the elites? and his insight that Republicans had done too little for working- and middle-class voters.",
    "Hillbilly Elegy? tried to explain some of those voters concerns, and in appearances on CNN (where he was named a contributor) and National Public Radio, as well as in opinion essays in The New York Times in 2016 and 2017, Mr. Vance tried to connect those concerns to their support for Mr. Trump.",
    "The reason Hillbilly Elegy was such a high-octane book was academics, professors, cultural arbitrators  liberals  embraced it as explaining a forgotten part of America,? said Douglas Brinkley, a professor of history at Rice University who once introduced Mr. Vance at an event.",
    "He owes nearly everything to having become a Trump whisperer phenomenon,? Rod Dreher, whose interview with Mr. Vance for The American Conservative in July 2016 was so popular it briefly crashed the magazines website, said in an email.",
    "They were celebrating Mr. Vances new memoir, Hillbilly Elegy,? which chronicled his working-class upbringing in southwestern Ohio and an ascent that brought him to Yale, where his mentors included Amy Chua, one of the partys hosts.",
    "In the run-up to the 2020 election, Ms. Close, who played Mr. Vances grandmother, put up a series of social media posts urging voters to support Joseph R. Biden Jr. Ms. Closes representatives did not respond to inquiries.",
    "He deleted some old tweets, including one that had called Mr. Trump reprehensible.? Last month, Mr. Trump embraced Mr. Vance as a prodigal son who said some bad? stuff about him, using a stronger word than stuff.",
    "But he told The Hollywood Reporter that he was surprised by some of the positions? Mr. Vance has taken and the statements hes made.? He has not spoken with Mr. Vance since the films release, he said.",
    "The former Never Trump guy? went on to embrace Mr. Trump last year, and eagerly accepted his endorsement in the Republican primary for an open U.S. Senate seat in Ohio that he won earlier this month.",
    "became celebrated because he really had something important to say, and said it in a way that was comprehensible to a wide audience.?\nBut he also found a particular audience among liberals.",
    "Hillbilly Elegy? was published by a subsidiary of News Corp., which is controlled by the conservative Murdoch family, but through a flagship imprint that puts out broadly appealing books.",
    "To establish populist bona fides  since they represent economic elites  cultural elites are the ones they can rally against,? said Neil Gross, a professor of sociology at Colby College.",
    "As a Republican candidate in a Republican-leaning Midwestern state, Mr. Vance did not appear eager to tout the central role the publishing, media and film industries played in his rise.",
    "Mr. Vance seemed modest, self-effacing and a bit of a fish out of water among guests drawn from the worlds of publishing and journalism, a half-dozen attendees later recalled.",
    "ABC, for instance, decided to make a reboot of the sitcom Roseanne,? a lighthearted prime-time portrayal of people who supported Mr. Trump, including Roseanne Conner herself.",
    "Mr. Vances work was embraced at a moment when Mr. Trumps surprising election prompted many media executives to consider what audiences they had been overlooking.",
    "The book, which had a modest initial print run of 10,000 copies, went on to sell more than three million, according to its publisher, HarperCollins.",
    "It was made into a 2020 feature film by Hollywood A-listers including the director Ron Howard and the actresses Amy Adams and Glenn Close.",
    "This is something they are really quick to criticize the left for  relying too much on Hollywood for support and glamour,? Brownell said.",
    "But,? she added, the Republican Party has been more successful at turning entertainers into successful candidates than Democrats.?",
    "It received poor reviews, but was reportedly among Netflixs most-streamed films the week of its release in November of 2020.",
    "Both Mr. Howard and Mr. Grazer have been generous Democratic donors, according to Federal Election Commission filings.",
    "In 2019, Netflix won a bidding war and pledged a reported $45 million to finance the Hillbilly Elegy? film.",
    "It was almost stupid how disarmed the people were by that,? said one of them, the novelist Joshua Cohen.",
    "Last year, as Mr. Vance began his Senate run, he renounced his earlier criticism of Mr. Trump.",
    "(The show was later canceled after its star, Roseanne Barr, posted a racist tweet.)",
    "But his political opponents have been more than happy to draw the connection.",
    "(Mr. Vances campaign declined to comment for this article.)",
    "It did not originally mention Mr. Trump.",
    "The thing is, he didnt seek this out.",
    "Vance story did not end there.",
    "But the J.D.",
    "Vance.",
    "J.D."
  ]
}