{
  "id": 5536,
  "mediaId": 157,
  "date": "d2022-05-15T00:00",
  "headline": "Conservative warns Buffalo shooter's ideology is mainstream to right-wing  while Fox dodges their role",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29806936&width=980",
  "link": "https://www.rawstory.com/republican-great-replacement-shooter-fox/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    828,
    1095,
    2524,
    3103,
    199,
    428,
    525,
    4938
  ],
  "sentences": [
    "Vance, who is running as the GOP's Ohio Senate nominee and is bankrolled by billionaire Peter Thiel, explained that Democrats are not only opening the borders to create a shift in the democratic makeup of this country.? He went on to claim that President Joe Biden is intentionally letting fentanyl into the U.S. to kill a bunch of MAGA voters in the middle of the heartland.?\nA December 2021 poll showed nearly half of all Republicans believe that there is a plot afoot to \"replace\" white so-called \"native-born\" Americans with immigrants.",
    "Can you think, for example, of other institutions such as, I dont know, marriage or military units in which the less people have in common, the more cohesive they are??\nFox has spent most of the time after the shooting refusing to even use the words \"great replacement.\"",
    "Writing Sunday, Boot recalled the conservative writer who coined the phrase ideas have consequences.?\nAlready some are blaming Rep. Elise Stefanik (R-NY) for promoting the theory to New York residents in interviews and online.",
    "It's the same brand of racism that the Christchurch shooter espoused when he killed 51 people at two mosques in 2019.\nWhy is diversity said to be our greatest strength?? the Buffalo shooter's manifesto asked.",
    "The Buffalo, New York shooter has been exposed as a racist man who believes in the conspiracy theory that Democratic leaders are attempting to replace white people with people of color.",
    "Boot cited Republican politicians like Rep. Matt Gaetz (FL), Rep. Scott Perry (PA) and Sen. Ron Johnson (WI), who have all openly promoted the so-called great replacement? theory.",
    "Washington Post columnist Max Boot, a conservative, explained that this kind of ideology has become mainstream not just on the Fox network but also in the Republican Party.",
    "\"The young man wrote that he got his beliefs 'mostly from the Internet,' specifically from the 4chan bulletin board where white supremacists congregate,\" Boot noted.",
    "Native-born Americans are not to be confused with Native Americans, who trace their lineage to the first residents of the U.S. before being invaded by Europeans.",
    "The Democrats want open borders so they can bring in and amnesty **tens of millions** of illegal aliens  thats their electoral strategy.?\nRepublican J.D.",
    "And how does diversity increase that strength??\nIt's what Fox host Tucker Carlson asked in 2018.\nHow, precisely, is diversity our strength?\"",
    "He anticipates the GOP will respond not with a policing of their own extremist leaders, but with nothing more than \"thoughts and prayers.\"",
    "Known as \"great replacement\" theory, the Fox network has been responsible for elevating the idea to its millions of viewers many times.",
    "Instead, they're trying to dodge accountability by parroting the NRA line that guns aren't the problem, mental health is.",
    "He went on to cite Arizona Senate candidate Black Masterson, who tweeted after the shooting.",
    "Yet, gun advocates have opposed any rules that would regulate guns among the mentally ill.",
    "\"Since youve made this our new national motto, please be specific as you explain it.",
    "The current law stands that no person who has been institutionalized to buy a gun.",
    "\"But his repugnant views are not confined to an obscure corner of the Internet.",
    "Said throughout the media, spoken by politicians, educators and celebrities.",
    "They have become mainstream within the Republican Party.\"",
    "But no one ever seems to give a reason why.",
    "Carlson asked of his audience.",
    "What gives a nation strength?",
    "Stories Chosen For You"
  ]
}