{
  "id": 5540,
  "mediaId": 238,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Dr. Ozs Trump-infused Senate run is coming down to the wire",
  "image": "",
  "link": "https://www.washingtonpost.com/lifestyle/2022/05/13/dr-oz-senate-pennsylvania-trump/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Heller",
  "authorUrl": "https://www.washingtonpost.com/people/karen-heller/",
  "termIds": [
    3103
  ],
  "sentences": [
    "On Fox News, he suggested that reopening schools, based on what he read in a medical journal, may only cost us 2 to 3 percent in terms of total mortality.? That death rate, he said, might be a trade-off some folks would consider.? He later apologized and said he misspoke.?\nBefore the pandemic, Ozs promotion of controversial treatments products earned him scorn from medical colleagues, and a complaint to Columbia Universitys medical school and health system where he long practiced.",
    "Thats not about Trump: The Far Lefts mandates and lockdowns took away our freedom and cost us too many lives, jobs, and opportunities.? He wants to fight censorship and refocus American health care on empowering patients? and lowering costs, and proposes an Operation Warp Speed for domestic energy production.? The campaign suggested friends and colleagues to interview but did not make the candidate available in person or by phone.",
    "A Teddy Roosevelt Republican? is how Oz described himself in a 2008 interview with a Canadian medical journal, where he praised Hillary Clinton, universal health care and declared Im not socially conservative.? In his extended reign of constant media exposure, Oz has left a huge swath of television and radio interviews espousing more temperate positions on abortion and gun control for opponents to harvest.",
    "But on this long night of punishing rain and boot-enveloping mud last Friday, Oz is fired up, a Republican warrior running for the U.S. Senate, delivering a fusillade of hits from the Trump playbook: America first, gun rights, keeping our borders clean,? fighting China, fighting Washington, fighting far-left, liberal-woke ideology? and firing the nations other most-famed physician, Anthony Fauci.",
    "Barnettes surprising surge prompted Trump to release a statement Thursday, claiming that she will never be able to win the General Election? and that Oz is the only one who will be able to easily defeat the Crazed, Lunatic Democrat in Pennsylvania.?\nPennsylvanias GOP politics were long genteel and respectful, more country club than WWE.",
    "At age 61, Oz is a national brand who has enjoyed three distinct acts: eminent cardiothoracic surgeon and inventor of lifesaving devices; best-selling author, television celebrity, promoter of alternative health remedies and controversial get-fit-fast supplements; and now neophyte political candidate.",
    "Says a Republican party insider, who spoke on the condition of anonymity to remain publicly neutral in the primary, When I heard Oz was running, I thought it was a joke.?\nMost of the GOP races lucre has been spent by Oz and McCormick, two immensely wealthy individuals.",
    "Oz, who hosted several shows on gun violence, is running as a proud gun owner,? appears in a gun rights spot and made an April pilgrimage to Texas to obtain the blessing of firearms evangelist Ted Nugent, appearing on five installments of The Nightly Nuge? podcast.",
    "During 13 seasons and 2,231 episodes of The Dr. Oz Show? through its Jan. 14 finale, two former associates say, he was compassionate, enthusiastic, driven and never once shared his political views off-camera, perhaps because he knew their views might differ.",
    "The former president spends as much time trashing the un-MAGAness of exiting Republican Sen. Pat Toomey and Ozs chief rival, former hedge fund CEO David McCormick (liberal Wall Street Republican?), as he does praising his pick.",
    "He recalls Oz saying of his lengthy television career, first on the Discovery Channel, then five years guesting in blue scrubs on Winfreys show and finally with his own syndicated program, I get to reach a really big audience.",
    "Their first day of medical school, Janik recalls, he greeted classmates by saying Hi, Im Mehmet Oz, and I want to be your class president.? He won handily and ultimately became president of the entire student body.",
    "In late 2020, Oz and his wife moved into a house owned by his wealthy in-laws in suburban Philadelphia, which he is renting while a nearby $3.1 million home they purchased earlier this year undergoes renovations.",
    "In this race, There seems to be an air of entitlement, of great wealth and celebrity.?\nRather than traditional bread-and-butter issues  inflation, taxes, jobs  the GOP primary has feasted on red-meat ones.",
    "Just like I didnt have to be here tonight in this horrible rainstorm.? Yet here he is in Pennsylvania, the battleground state that ultimately put President Biden over the top in the 2020 election.",
    "Born in Cleveland and raised in Delaware by immigrant parents from Turkey, Oz has long been tenaciously competitive,? says Billy Campbell, his roommate when they were Harvard undergrads.",
    "Since the Nov. 30 announcement of his candidacy, Oz has had 26 weekday appearances on Fox News, 20 of them with his early booster Sean Hannity, according to Media Matters for America.",
    "I began seriously considering politics after witnessing the inadequate response of our public health leaders and government to covid,? Oz wrote in an email shared by his spokeswoman.",
    "And if they should win, you will never see them again.? This week, the pro-business Club for Growth endorsed her and committed $2 million in ads during the final days of the primary.",
    "and folk icon John Fetterman holding a dominating lead among the three Democratic candidates, Pennsylvania is primed to produce something it has rarely enjoyed: a celebrity senator.",
    "His endorsement of Oz came as a surprise to many, especially McCormick, whose wife, Dina Powell McCormick, served as a deputy national security adviser in the Trump administration.",
    "I was more surprised by his foray into Oprah Winfrey and promoting supplements than his foray into politics,? says Dale Janik, his cadaver partner in their Penn anatomy class.",
    "Its also been the least likely of Pennsylvania races: national in tone, dominated by multi-millionaires who until recently lived elsewhere, and featuring a national celebrity.",
    "According to his financial disclosure report, Oz is worth more than $100 million and as much as $422 million, the range due to minimum and maximum investment valuations.",
    "A Fox News poll released Tuesday shows Oz at 22 percent with McCormick at 20 and former political commentator Kathy Barnette at 19, and 18 percent of voters undecided.",
    "Barnette is a Black woman running in the most populous state to never elect a female U.S. senator or governor, and has landed zingers at her opponents during debates.",
    "And I can effect change.? Politics is an arena where he can do both, Pennsylvanias Senate seat presenting a combination of right time, right place,? Campbell says.",
    "Ads sponsored by a pro-McCormick super PAC include The Californians,? with Oz kissing his Hollywood star, and another featuring him dancing with Michelle Obama.",
    "Depending on whom you speak to, Oz is a wealthy carpetbagger, another recovering moderate who made a Trumpian deal to win a Senate seat (like Ohios J.D.",
    "Oz is the only individual to be endorsed by Oprah Winfrey as Americas doctor? for television audiences and Trump for a U.S. Senate seat in Pennsylvania.",
    "What, precisely, is he doing in Pennsylvania, touring diners, attending ice-fishing dinners, toting rifles and getting drenched at a county fairground?",
    "Later, Oz received his medical degree and MBA at the University of Pennsylvania, the only time he resided in the commonwealth before his Senate bid.",
    "Despite the incessant barrage of political ads in the state, interviews with a dozen rally attendees found them unsure of who would win their vote.",
    "If we have someone as talented as him as our candidate, I think a lot of voters are going to switch parties.?\nOz is heckled repeatedly last Friday.",
    "When he first appears onstage, two rows of Trump supporters turn their backs to the candidate and point their thumbs downward toward the muck.",
    "The opening of deer season the Monday following Thanksgiving is an equally hallowed holiday, with many schools and offices shuttered.",
    "Trumps original pick, Sean Parnell, exited the race in November after domestic abuse allegations surfaced during a custody battle.",
    "To fulfill his dual citizenship in Turkey, Oz served 60 days in the military during a summer when he was in medical school.",
    "These includes sizable stock holdings in big pharma? and big tech,? which he rails about going to war against? in speeches.",
    "The house offers spectacular views of Manhattan, where Oz long practiced medicine and preached health on television.",
    "The Oz campaign fired back with Chinas Bro Dave McCormick.? Several ads question the Pennsylvania-ness of the other.",
    "Culture-war knife fights? is one of Ozs catchphrases, which he repeats in Greensburg, that nourish the Trump base.",
    "Former Secretary of State and McCormick supporter Mike Pompeo branded him as a potential national security threat.",
    "This state tends to elect workhorses, not candidates who have discussed healthy urine on air with Jennifer Lopez.",
    "For two decades, Ozs primary residence was a six-bedroom North Jersey home with an indoor basketball half court.",
    "Until recently, they both resided in the more Democratic environs of New Jersey and Connecticut, respectively.",
    "Thats like a poll, that means people like you,? Trump said in his April endorsement at a North Carolina rally.",
    "They are here for Trump, and their loathing of Biden (many sporting apparel that suggests an unprintable act).",
    "By the end of the programs run, ratings had plummeted and Oz had curiously pivoted from health to true crime.",
    "Were not used to carpetbaggers,? says former seven-term GOP Rep. Charlie Dent, now a commentator on CNN.",
    "During the pandemic, Oz advocated the use of hydroxychloroquine, though its benefits remain unproven.",
    "When he attended an event with Oz, the women started going crazy.? Oz is fit, tall, trim, telegenic.",
    "My dual citizenship has become a distraction in this campaign,? he announced in a March statement.",
    "Hes in the bedrooms of all those women telling them good and bad  and they love him,? Trump says.",
    "GREENSBURG, Pa.  Dr. Mehmet Oz wooed millions of viewers by remaining mostly politically neutral.",
    "The stakes are so high, the money is so huge,? says longtime political observer Larry Ceisler.",
    "McCormicks campaign is brimming with Trump acolytes, including Hope Hicks and Stephen Miller.",
    "McCormick, who was raised in Pennsylvania, hadnt lived here for some years prior to his run.",
    "Oz is the future of the Republican Party,? says Reschenthaler, the Pennsylvania congressman.",
    "Neither has a U.S. Senate seat being vacated, so theyre in Pennsylvania fracking for votes.",
    "You dont dominate daytime television for more than a decade by offending half the audience.",
    "Vance who is also here tonight), the future of the Republican Party  or all of the above.",
    "Last week, a photo surfaced of Oz casting a ballot in Turkeys 2018 presidential election.",
    "The campaign has been nasty and costly, crowned among the most expensive in the nation.",
    "Trump sees in him a kindred television celebrity wading into Republican politics.",
    "If anybody was within 200 miles of me, he hired them,? Trump says at the rally.",
    "When these carpetbaggers lose, you will never see them again,? Barnette said.",
    "He declared that if he were elected, he would forgo his Turkish citizenship.",
    "Transgender athletes competing in womens sports has been a recurring issue.",
    "His interest in politics dates from long before the pandemic, friends say.",
    "If elected, Oz would become the first Muslim to serve in the U.S. Senate.",
    "People are suspicious of anyone who comes from entertainment,? says Rep.",
    "In many of Pennsylvanias 67 counties, hunting is an article of faith.",
    "Ultimately, hes going to bring a lot of attention back to the state.?",
    "Oz is the focal point of Tuesdays doozy of a Republican primary.",
    "He likes to fix things,? says Campbell, a television executive.",
    "Whoever comes out of this one is going to be a national star.",
    "He didnt need this,? Trump says from the fairgrounds stage.",
    "It takes him 45 minutes to get around the task at hand.",
    "McCormick used Ozs service as fodder in an attack ad.",
    "In 2014, he was pummeled in a congressional hearing.",
    "The rally is a whole lot of Trump with a dash of Oz.",
    "He likens Ozs talk-show longevity to electability.",
    "(His wife and four grown children are Christian.)",
    "Guy Reschenthaler (R-Pa.) of Oz and Trump.",
    "But this is the modern state of politics.",
    "Some residents remain incredulous.",
    "The Senate race is the undercard.",
    "(Parnell vigorously denied them.)",
    "Oz is an expert communicator.",
    "The parallels are uncanny.",
    "With towering Lt. Gov.",
    "This is not New York.",
    "Still, Dr.",
    "Dr."
  ]
}