{
  "id": 5546,
  "mediaId": 136,
  "date": "d2022-05-13T01:50",
  "headline": "Biden Reaches Out to Trump Country Voters While Ramping Up MAGA Criticism",
  "image": "https://d.newsweek.com/en/full/2036871/biden-portman-ohio.webp?w=790&f=3b59a274dfc7c16889fa69c97392ab34",
  "link": "https://www.newsweek.com/biden-reaches-out-trump-country-voters-while-ramping-maga-criticism-1706243",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Bush",
  "authorUrl": "https://www.newsweek.com/authors/daniel-bush",
  "termIds": [
    1147,
    2087,
    3103,
    4830,
    146,
    428,
    2537,
    2715,
    2834
  ],
  "sentences": [
    "Some allies outside the White House said they viewed Biden's new rhetoric in the wake of the Supreme Court draft leak, combined with his travel outside Democratic strongholds, as an effort to court independent voters while drawing a sharper contrast with his political opponents.",
    "The recent travel to Trump country suggests Biden remains confident he can connect with Americans across the political spectrum, including the independents and moderate Republicans who helped elect him, despite his low approval rating in national and state polls.",
    "But it's an open question among Democrats whether Biden's message can resonate in red states in a moment of polarization over abortion rights and other issues, or whether his time would be better spent on more friendly terrain helping energize the party's base.",
    "However, there is optimism among Democrats that a decision by the Supreme Court to overturn Roe v. Wade would alienate moderate Republicans who support abortion rights, possibly fueling them to cross party lines and vote against GOP candidates in the fall.",
    "\"He's speaking to independent voters, and there's a whole lot of people out there especially after this Supreme Court leak, who think the Republicans are maybe a little too far right,\" said Nancy Mills, the chair of the Pennsylvania Democratic Party.",
    "Earlier this week, White House Press Secretary Jen Psaki said the president would continue to speak out forcefully against MAGA Republicans, and said the criticism would not undercut Biden's effort to reach voters outside the Democratic Party's base.",
    "Biden also traveled earlier this year to Texas, a state that remains deeply conservative outside of a handful of major cities like Austin, despite recent efforts by Democrats to make inroads with Latino voters and other left-leaning groups.",
    "In February, Biden visited Lorain in northeast Ohio to highlight the infrastructure law, promising that rebuilding the region's roads and bridges and making other improvements would help grow the local economy and produce good-paying jobs.",
    "And on Wednesday, the president traveled to Illinois, safe territory for Democrats for years, to tour a farm and speak at a convention for the International Brotherhood of Electrical Workers in Chicago, as well as attend a DNC fundraiser.",
    "Republicans have largely gone along with the president's requests for assistance to Ukraine, but the latest for a $33 billion aid package faces some resistance from Republicans who do not want it tied to a new round of Covid funding.",
    "Biden spoke about the economy and lowering energy costs during a visit last month to a biofuels facility in Iowa, another state like Ohio that was long considered a swing state but has recently drifted into the Republican column.",
    "Trump won Ohio by eight percentage points in 2016 and 2020, in large part by arguing the Democratic Party had forgotten blue collar voters in places like Lorain that have lost manufacturing and industrial jobs in recent decades.",
    "President Joe Biden is deeply unpopular with Republican voters, but that hasn't stopped him from venturing to red and right-leaning states he lost in the 2020 election to tout his first-term record ahead of the midterm election.",
    "He pledged in his inaugural address to \"fight as hard for those who did not support me as those who did,\" and has frequently repeated the message in office while seeking bipartisan support for his administration's agenda.",
    "A March poll by the Pew Research Center found 61 percent of Americans believe abortion should be legal in all or most cases, while only 37 percent of Americans believe abortion should be illegal in all or most cases..",
    "Democrats tried to capitalize Wednesday on the anger on the left by holding a vote to move forward with a bill that would guarantee the right to an abortion in the U.S. even if Roe is ultimately overturned.",
    "Trump won in the state by appealing to Democratic voters who were disillusioned with the party's shift to the left and didn't hold liberal views on issues like abortion, said Scheffler, the Iowa RNC member.",
    "After former President Barack Obama narrowly won North Carolina in 2008  becoming the first Democrat to carry the state since 1976  Democrats had hopes of turning it into a battleground in future elections.",
    "Yet Biden's travel to red states comes as he also ratchets up criticism of Trump's Make America Great Again movement and Republicans more broadly for supporting a conservative agenda he labeled \"extreme.\"",
    "Vance, a Trump-backed candidate, won the GOP Senate primary, setting up a general election against Ohio Democratic Rep. Tim Ryan that will be one of the most closely watched Senate contests this fall.",
    "The comments came two days after Politico published a leaked draft of a Supreme Court opinion signaling the court plans to overturn Roe v. Wade, the 1973 decision that legalized abortion nationwide.",
    "\"We love having him [visit],\" Ben Wikler, the chairman of the Wisconsin Democratic Party, said of Biden, but \"it's great to see him out on the trail making the case\" in red states as well.",
    "Two days after the trip to Iowa, Biden was back on the road talking about infrastructure in North Carolina, another conservative state with a closely-watched Senate election this fall.",
    "In the past four months alone, the president has traveled to Ohio, Texas, Iowa, North Carolina and Alabama  all states former President Donald Trump won in the past two elections.",
    "By paying attention to often-overlooked areas outside major cities that vote reliably Democratic, Biden could help Ryan pick up some Republican votes in the fall, Pepper said.",
    "Despite the focused attention on red states, Biden has still made stops in states like Nevada, Virginia and Colorado  former swing states that have recently moved to the left.",
    "Earlier this week, Biden went to Potomac, Maryland, a suburb of Washington, D.C., to attend a Democratic National Committee fundraising event at the home of Rep. David Trone.",
    "But despite pouring resources into North Carolina, both Clinton and Biden lost the state to Trump, though his margin of victory there was much narrower than in Iowa or Ohio.",
    "The United States has sent Ukraine billions of dollars in security assistance, including Javelins and other weapons systems, since Russia invaded the country in February.",
    "Most of Biden's trips to red or right-leaning states this year have focused on jobs and the economy  issues that will play a central role in the 2022 midterms.",
    "He has also gone to battleground states that lean blue like Minnesota, Pennsylvania and New Hampshire, and made stops in liberal strongholds such as New York.",
    "\"This MAGA crowd is really the most extreme political organization that's existed in American history, in recent American history,\" Biden said last week.",
    "But the political undercurrents have been hard to ignore in an election year where Democrats are in danger of losing control of the House and Senate.",
    "National Democrats descend on Selma, Alabama, each year to mark the anniversary of \"Bloody Sunday,\" a pivotal moment in the Civil Rights movement.",
    "Nevertheless, the trip to Alabama gave Biden the chance to spotlight his support for Ukraine, an area of rare bipartisan agreement in Washington.",
    "\"In these big states that have a lot of cities but also a lot of red areas, it's the margin of loss in those red areas that matter,\" Pepper said.",
    "\"Cutting through the noise by traveling to a place and explaining [his policies] is the best way to slice through the Republican noise machine.\"",
    "The same week Biden went to Ohio, he also visited deep-red Alabama to speak at a Lockheed Martin assembly plant for Javelin anti-tank missiles.",
    "The worst thing [Biden] could do is only go to places that feel very blue,\" said David Pepper, a former chairman of the Ohio Democratic Party.",
    "But Republicans said Biden can't criticize Trump and then expect to help Democrats in the midterms by visiting states where he isn't popular.",
    "\"Biden is seen as pro-abortion\" and that won't help if he continues trying to reach Republicans who oppose abortion rights, Scheffler said.",
    "But the Senate vote on Wednesday signaled that Democrats plan to make the political battle over abortion central to their midterm message.",
    "\"If he thinks he's going to have bipartisan support he's delusional,\" said Steve Scheffler, the Republican National Committeeman for Iowa.",
    "It was a largely symbolic vote because Senate Majority Leader Chuck Schumer knew that the bill wouldn't get the 60 votes needed to pass.",
    "Biden returned to Ohio to discuss infrastructure and manufacturing jobs again last week, just days before the state's primary election.",
    "But they otherwise tend to stay away from a state that hasn't backed a Democratic presidential candidate since Jimmy Carter in 1976.",
    "The president's willingness to go to parts of the country where people may not support him is a departure from his predecessor.",
    "The White House did not respond to a request for comment on the thinking behind some of the president's trips to red states.",
    "Before that, Democratic presidential candidates had won six of the previous seven elections in Iowa going back to 1988.",
    "The measure failed, with Democratic Senator Joe Manchin of West Virginia joining all Republicans in voting against it.",
    "The president lost Iowa by 8.2 percentage points, and Trump defeated Hillary Clinton in Iowa by 9.6 points in 2016.",
    "Trump preferred visiting places where he was very popular and rarely went to areas dominated by Democratic voters.",
    "\"We need to be energizing our base,\" said Keith Williams, the head of the Michigan Democratic Party Black Caucus.",
    "Biden's travel to red states this year has ostensibly served to highlight his domestic and foreign policy goals.",
    "So far, Biden's trips to red states have focused on issues such as health care, jobs and the infrastructure law.",
    "\"You want to run up your numbers where you have good numbers, and narrow your losses\" everywhere else, he added.",
    "Ohio was a longtime swing state but has trended away from Democrats in the past two presidential elections.",
    "Others argued Biden needs to focus more of his attention on Democratic strongholds ahead of the midterms.",
    "\"The biggest problem is when people get their news about Democrats from Republicans,\" he said.",
    "It remains to be seen how much Biden will focus on the issue in the run-up to the midterms.",
    "A majority of Americans support abortion rights, according to public opinion surveys.",
    "Biden signaled a different approach from the start of his presidency.",
    "The focus on foreign policy in Alabama was an exception, however.",
    "Biden lost Alabama to Trump by 25.5 percentage points.",
    "\"I think he's very wise to go to all these places.",
    "\"Republicans are not going to vote for us.",
    "I don't care what he does.\"",
    "J.D."
  ]
}