{
  "id": 5547,
  "mediaId": 151,
  "date": "d2022-05-13T01:11",
  "headline": "GOP launches Operation Stop Barnette",
  "image": "https://www.politico.com/dims4/default/94b24c2/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F8d%2F72%2Fa10057a2439f9008c77148afb35c%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1396765002",
  "link": "https://www.politico.com/news/2022/05/12/gop-launches-operation-stop-barnette-00032303",
  "sentiment": "-0.526",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1148,
    1653,
    1801,
    2429,
    2475,
    2491,
    3103,
    428,
    2862,
    2865
  ],
  "sentences": [
    "This is really kind of shocking.?\nThe adviser noted Oz still has a decent shot of pulling off a victory, but conceded it was clearly possible for Barnette to win, given she has the most room to grow, with under a week left? after months of seeing these guys nuke each other.?\nWhile casting doubts about Barnettes electability in the fall, Trump also appeared to suggest Thursday that she has a shot at winning the primary and has proven her MAGA bona fides.",
    "In a statement, he cast doubt on her electability in the critical battleground state that could determine party control of the Senate: Kathy Barnette will never be able to win the General Election against the Radical Left Democrats.?\nI think whats happened is neither Oz nor McCormick have excited anybody,? said John Brabender, a Republican strategist who is a veteran of Pennsylvania campaigns and is not working for a candidate in the Senate primary.",
    "American Leadership Action, a pro-Oz super PAC, released a video calling Barnette Pennsylvanias wackiest Senate candidate? and aiming to paint her as both out of touch with Republicans and unhinged: It featured clips of her talking about white racism? and how Black Americans feel disenfranchised.?\nTexts have also gone out labeling Barnette a BLM radical? and linking to CrazyKathy.com, which redirects to American Leadership Actions website.",
    "She was tested 18 months ago in the congressional election, and lost by 20 points, but more than that, shes being supported by the Club for Growth, which is the establishment.?\nHonor Pennsylvania, a pro-McCormick super PAC, is expected to go on TV with an ad criticizing Barnette over publicly available information? about her, said a person familiar with the groups plans.",
    "Barnette, who has been described by former Trump aides as ultra-MAGA,? received a massive boost this week when the conservative Club for Growth super PAC  one of the top outside spending groups in Republican Senate primaries this cycle  endorsed her and revealed it would spend $2 million on TV ads supporting her.",
    "But Kathys going to focus on the campaign and her policies and push forward.?\nTrump is set to host a tele-rally with Oz Thursday night, a call that will go out to more than 100,000 Republican primary voters in Pennsylvania, according to a person familiar with the plans.",
    "Conservative, America First voters have to question anyone who would take the endorsement of Pat Toomeys Club for Growth, who clearly dont support an America First agenda and have attacked President Trump,? said a prominent Pennsylvania Republican supporting McCormick.",
    "And USA Freedom Fund, a super PAC that attacked Oz in a digital ad last week, pivoted and is blasting Barnette in a new TV ad as a woke Republican? and accused her of wanting to build a statue of Barack Obama.? It placed a $723,000 ad buy on Thursday.",
    "She has many things in her past which have not been properly explained or vetted, but if she is able to do so, she will have a wonderful future in the Republican Party  and I will be behind her all the way,? Trump said in the statement.",
    "As part of the eleventh-hour effort to stop a Barnette nomination, operatives and allies supporting Oz and McCormick have circulated opposition research on Barnette  including highlighting the general lack of vetting shes received.",
    "In a sign of how seriously they take her rise, both men have gone on the attack against Barnette on conservative media outlets, while their allies have scrambled to disseminate opposition research and prepare anti-Barnette ads.",
    "Despite panic about Barnette among some top Republicans, officials at the National Republican Senatorial Committee, which has declined to get involved in any open-seat primaries this cycle, are publicly keeping their cool.",
    "Theyve spent a lot of money and people viewed it as millionaires behaving badly  they were looking for any alternative that they could find.?\nOz and McCormick werent the only ones caught off-guard by Barnettes late surge.",
    "Formerly led by Sen. Pat Toomey (R-Pa.)  whose retirement sparked the open Senate seat battle  the group has recently found itself at odds with Trump after continuing to run ads in Ohio slamming J.D.",
    "The Club backed Vances rival, Josh Mandel, in that election, and has continued to support Rep. Mo Brooks in Alabamas GOP Senate primary even after Trump withdrew his endorsement of Brooks in March.",
    "Though she had been slowly rising in the polls in recent weeks, the release of a Fox News survey Tuesday, showing her in a tight race with Oz and McCormick, confirmed her momentum was undeniable.",
    "| Michael M. Santiago/Getty Images\nBy Holly Otterbein and Natalie Allison\n 05/12/2022 09:11 PM EDT\nPHILADELPHIA  For months, Mehmet Oz and David McCormick barely laid a glove on Kathy Barnette.",
    "When you get momentum this late in a campaign and people probably arent going to hear much new about you because theres not much time, I think its hard to stop that momentum,? Brabender said.",
    "I dont think anyone can say right now shes unelectable in the general election, but certainly shes unvetted, and there are a lot of unknowns,? said a person familiar with the NRSCs strategy.",
    "For months, the conservative commentator flew under the radar as the two leading candidates and outside groups dropped tens of millions of dollars on television ads attacking each other.",
    "Were not setting our hair on fire.?\nSome Republican strategists think it may be too late to sink Barnette with negative commercials, given that she hasnt faced any attack ads until now.",
    "The attacks are pretty vicious and way out of context and pieced together in an arrangement that totally distorts the truth,? said Bob Gillies, Barnettes campaign manager.",
    "But in the last 48 hours, the Oz and McCormick campaigns and their allies have been suddenly forced to recalibrate as Barnette has surged to the front of the pack.",
    "Pennsylvania U.S. Senate candidate Kathy Barnette speaks during a Republican leadership forum at Newtown Athletic Club on May 11, 2022 in Newtown, Pennsylvania.",
    "In a political environment favorable to Republicans this year, the group argued there is still no clear evidence Barnette would lose to the Democratic nominee.",
    "Were going to make sure people are aware the more you learn about her, the scarier it gets,? said a person involved with Ozs campaign.",
    "Oz joined Hannity on the program and said Barnette is a mystery? and it will be a gift to Chuck Schumer? if she wins the nomination.",
    "A spokesperson for Trump declined to comment on the Club for Growths decision to get involved in the Pennsylvania Senate primary.",
    "On his first appearance on Steve Bannons podcast War Room: Pandemic? on Thursday, McCormick questioned Barnettes electability.",
    "While Kathy claims to be a MAGA conservative, she has a very troubling history of attacking Donald J. Trump,? Hannity said.",
    "Fox News host Sean Hannity, a top Oz ally, laced into Barnette on his show Wednesday, detailing a litany of critiques.",
    "Even former President Donald Trump, who has endorsed Oz, decided Thursday that it was time to throw up a roadblock.",
    "I really think it is a bit of a fuck you to Trump, to do this in the last week,? said one Trumpworld adviser.",
    "Theyd made the calculation that Pennsylvanias closely watched GOP Senate primary was a two-man race.",
    "He also pointed out that she lost a House race in the Philadelphia suburbs in 2020 by a wide margin.",
    "Some of McCormicks allies have also sought to use her endorsement from Club for Growth against her.",
    "He said she has never been vetted? and failed to answer reporters questions about her background.",
    "Many Republican political consultants at the state and national levels also didnt see it coming.",
    "McCormick, meanwhile, is taking a less aggressive approach in his efforts to cut down Barnette.",
    "After all, they had the most money, the highest name ID, and a dominant position in the polls.",
    "In Kathy Barnettes case, shes already been tested,? McCormick told Bannon.",
    "Vance as a Never Trumper, even after Trump endorsed Vance.",
    "There was no point."
  ]
}