{
  "id": 5556,
  "mediaId": 19,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Report: George P. Bush Floundering Due to Family Name",
  "image": "https://media.breitbart.com/media/2020/06/Texas-Land-Commissioner-George-P-Bush-filephoto14-Getty-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/12/report-george-p-bush-floundering-family-name/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Bois",
  "authorUrl": "https://www.breitbart.com/author/pbois/",
  "termIds": [
    3103
  ],
  "sentences": [
    "What drives me crazy about people like George P. Bush and the establishment is that they just want to focus on slogans like Keep Texas red and they dont seem to understand that in order to do that, we have to really fight hard,? said Texas voter Christin Bentley.",
    "Vance, he has also completely reversed some of his past centrist policy proposals on issues like immigration and border security, but no matter how authentic the turnaround, Bush may not be able to escape his own name.",
    "Up against incumbent Ken Paxton, Bush cannot seem to find a rhythm with voters who either view him as an untrustworthy RINO or an opportunist spouting Trumpian slogans to win MAGA support.",
    "In fairness to George P. Bush, he endorsed Trump both times he ran for president and has courted his endorsement during the attorney general race (Trump endorsed Ken Paxton early on).",
    "The compassionate conservatism that George W. Bush embodied when he was governor is no longer that something that people that vote in Republican primaries are looking for,? he said.",
    "Right now, we need people who are not afraid of controversy and be very aggressive in protecting the rights of Texans and not politically correct kind of people,? added Bentley.",
    "In decades past, there were few political dynasties in Texas as unstoppable as the Bush family name with a solid legacy stretching all the way back to the 1960s.",
    "Some of the top reasons Republican voters are reluctant about him are his ties to his familys center-right political leanings and his own past policy positions.",
    "George P. Bush may be floundering in his race for Texas attorney general due to the political toxicity of his family name, according to all available data.",
    "His cousin, Pierce Bush, finished third in the 2020 race for a Houston congressional seat and there is virtually no national Bush brand to speak of.",
    "Jason Villalba, chair of the Texas Hispanic Policy Foundation, said that the days of Bushs compassionate conservatism may finally be at an end.",
    "The sitting attorney generals ads against Bush focus on labeling him a RINO  Republican in name only  and linking him to his famous family.",
    "In the age of Trump, the names staying power appears to have waned, and George P. Bush may be the latest casualty.",
    "Per the Texas Tribune:\nHis ubiquitous name recognition is emerging as a liability in the Republican party.",
    "Bush said those attacks are led by Paxton and dont reflect the support he has seen on the campaign trail.",
    "George P. Bush, who currently serves as the states land commissioner, is trailing Paxton in polls.",
    "Beyond the attorney general race, the Bush name has floundered in other areas as well.",
    "Whats popular is the far-right, strident wing of Trump in the Republican party.",
    "Similar to Ohio Senate candidate J.D.",
    "Thats not popular today.",
    "And thats not him.?"
  ]
}