{
  "id": 5559,
  "mediaId": 19,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "ExclusiveJ.D. Vance: Ruling Class Hellbent on Keeping U.S. in Managed Decline by Weakening China Tariffs",
  "image": "https://media.breitbart.com/media/2022/05/GettyImages-1240386646-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/12/exclusive-j-d-vance-ruling-class-hellbent-on-keeping-u-s-in-managed-decline-by-weakening-china-tariffs/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    781,
    1147,
    1801,
    2087,
    3103,
    428,
    2979,
    2845,
    2863,
    2945
  ],
  "sentences": [
    "Were finding out the hard way with China  they make way too much of our stuff  when they shut down their entire economy, when they shut down the country as theyre doing right now, we become affected by that.?\nThis is the problem with allowing other people, people who dont really like you that much, to make all your stuff is they actually have you by the you-know-what when they decide to shut down their economy,? he said.",
    "That is the issue and unfortunately far too many Republicans and of course the entire Democrat party thats gotten rich off the way we do business with China, this is one of the things  you know managed decline is bad for normal Americans but its actually pretty good if youre one of the people whove profited from the decline,? Vance said.",
    "Were being led by people, many of whom have gotten rich by doing business with our biggest geopolitical foe, and theyre  not as worried about the lack of baby formula, theyre not worried about the fact that things are getting more and more expensive, of course, because theyve profited greatly from whats gone on,? Vance said.",
    "It feels sometimes like our leaders are just slowly allowing the country to slip into decline and sometimes its hard to see and I think right now its very obvious.?\nThis highlights one of the reasons why we need an America First trade policy, an America First supply chain policy,? Vance continued.",
    "Biden and a lot of Republicans have talked about weakening the tariffs on China which is one of the reasons why you started to see under President Trump some of those companies, some of that manufacturing, some of that supplies, moving back closer to home,? Vance said.",
    "This to me is the economic question for the next 30 years of our country: Are we going to commit to being self-sufficient and making our own things or are we going to continue to allow our entire prosperity to be held hostage by countries like China?? he continued.",
    "During an exclusive interview with SiriusXM Patriots Breitbart News Daily, Vance detailed how Washington, DC, lawmakers, bureaucrats, and corporate special interests have kept the U.S. in a managed decline? for decades while profiting for themselves.",
    "As Breitbart News reported this week, the U.S. Chamber of Commerce has called on the Biden administration to cut U.S. tariffs on China and return to the decades-long GOP-Democrat consensus on free trade that persisted before Trump took office.",
    " this highlights why we have to make our own stuff in this country.?\nVance also called out President Joe Biden for suggesting that he may cut U.S. tariffs on China as well as the Republicans who have lobbied the president to do so.",
    "Vance, running against Rep. Tim Ryan (D-OH), says the nations ruling class is interested in preserving its managed decline? of the United States by weakening former President Trumps tariffs on China.",
    "Weve got to reverse course.?\nFrom 2001 to 2018, U.S. free trade with China has eliminated 3.7 million American jobs from the economy  2.8 million of which were lost in American manufacturing.",
    "Vance has been endorsed by Trump, Sen. Josh Hawley (R-MO), Rep. Marjorie Taylor Greene (R-GA), and former U.S. Trade Representative Robert Lighthizer, among others.",
    "In Ohio, alone, at least 136,700 American jobs have been eliminated from 2001 to 2018 as a result of U.S. free trade with China.",
    "LISTEN:\nI use this phrase a lot on the campaign trail, managed decline,? Vance said.",
    "During that same period, at least 50,000 American manufacturing plants closed down.",
    "Already, Biden has eliminated U.S. tariffs on more than 350 China-made products.",
    "In particular, Vance said, Republicans have to wake up? on the trade issue.",
    "Nearly 10,000 of those jobs were outsourced in Ryans district.",
    "John Binder is a reporter for Breitbart News.",
    "Ohio Republican Senate candidate J.D.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here."
  ]
}