{
  "id": 5567,
  "mediaId": 233,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Who is Dave McCormick? Former hedge fund executive running for Senate in Pennsylvania",
  "image": "https://www.gannett-cdn.com/presto/2022/03/09/PPLD/b79a79a6-e4f0-4103-9174-a8b2a753e56e-McCormick2.jpg?crop=5567,3132,x0,y283&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/05/11/dave-mccormick-pennsylvania-senate-gop/9710413002/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Orlando Mayorquin",
  "authorUrl": "https://www.usatoday.com/staff/6610183001/orlando-mayorquin/",
  "termIds": [
    1078,
    1147,
    1622,
    1770,
    3103,
    428,
    562,
    571,
    2862
  ],
  "sentences": [
    "A millionaire former hedge fund executive and George W. Bush administration official is running for Senate in the Pennsylvania Republican primary against Donald Trump-backed celebrity surgeon Mehmet Oz and conservative commentator Kathy Barnette.",
    "McCormick served in various roles in the Bush administration, according to White House archives, including as the Under Secretary for International Affairs in the Department of Treasury in the last two years of Bush's second term.",
    "His platform includes a suite of proposals to combat Chinas growing economic and military influence,? increase domestic fossil fuel energy production, finish Trumps southern border wall and implement voter ID laws.",
    "Here's where it might matter most\n2022 midterm elections:The most interesting Senate races to watch, from Georgia, to Pennsylvania and Florida\nOhio GOP Senate nominee:What to know about J.D.",
    "He appeals to his business background in his economic plan, which, according to his campaign site, includes cutting taxes for the working-class and restoring manufacturing jobs.",
    "Prior to his roles at the White House, McCormick headed two technology companies after a stint at consulting firm Mckinsey and Company, according to his LinkedIn.",
    "The self-described battle-tested fighter? graduated from West Point and served in the Persian Gulf War in 1991 as a paratrooper with the 82nd Airborne Division.",
    "Pompeo held a press conference on behalf of the campaign, expressing national security concerns? over Ozs participation in a recent Turkish election.",
    "Dave McCormick is running on the America First? agenda and employs Trump-style rhetoric despite the former presidents backing of his opponent.",
    "If McCormick becomes the Republican nominee he will take on the winner of a Democratic Senate primary that includes Pennsylvania Lt. Gov.",
    "Like many midterm GOP candidates, McCormick is running on the America First? platform and advocating for policies started under Trump.",
    "He was born in Pittsburgh and grew up in a small town called Bloomsburg in Eastern Pennsylvania, according to his campaign website.",
    "According to his Senate Financial Disclosure report, McCormick bagged a nearly $22.5 million salary in his final year at the firm.",
    "He is married to Dina Powell, a Goldman Sachs executive who served as a national security adviser in the Trump administration.",
    "He also calls for congressional term limits, which both Democratic and GOP candidates have advocated for this election cycle.",
    "He had worked there since 2009, before leaving to pursue the vacant Senate seat left by outgoing Republican Sen. Pat Toomey.",
    "Republican Texas Sen. Ted Cruz and former Trump Secretary of State Mike Pompeo are some of McCormicks top endorsers.",
    "McCormick was a longtime executive at Bridgewater Associates, which is considered the worlds largest hedge fund.",
    "Other endorsements include former Republican presidential candidates Rick Santorum and Mike Huckabee.",
    "Roe's midterms impact:The Roe v. Wade decision could upend the midterms.",
    "McCormick blames Joe Biden and the extreme left,? for record inflation.",
    "John Fetterman and Pennsylvania Congressman Conor Lamb.",
    "What is McCormicks policy platform?",
    "Who has endorsed Dave McCormick?",
    "Vance\nWho is Dave McCormick?",
    "How old is Dave McCormick?",
    "McCormick is 56 years old."
  ]
}