{
  "id": 5568,
  "mediaId": 238,
  "date": "d2022-05-11T16:27",
  "headline": "The MAGA vs. GOP divide in the Republican primaries",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/11/maga-vs-gop-divide-republican-primaries/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1631,
    2272,
    2510,
    3103,
    146,
    428,
    2816,
    2969,
    5067
  ],
  "sentences": [
    "Were dealing with small sample sizes here, given how few primaries have been conducted and that they attract only a fraction of voters, but it seems safe to say that there is something structurally distinct between Nebraska and West Virginia that might have influenced the mixed results Trump saw Tuesday night.",
    "The natural assumption for Donald Trumps endorsed candidate losing the Nebraska gubernatorial primary on Tuesday night is that business executive Charles Herbsters reputational problems kneecapped his chances.",
    "But Trump also attacked the winner of the Republican nomination for the states 2nd Congressional District, incumbent Rep. Don Bacon, whod criticized the president after the riot at the Capitol in 2021.",
    "Trump wants Ken Paxton reelected as Texas attorney general, but Paxtons various ethical challenges likely helped keep him from an outright victory in the state primary earlier this year.",
    "West Virginia grew more Republican following a trajectory similar to Trumps own, going from blue-collar blue to Fox-News red over the span of the past decade or two.",
    "But its hard not to notice how this correlates: state leadership thats loyal to Trump, reflecting a base loyalty to Trump that manifests in primary votes.",
    "Its a state in which Republicans have built a different sort of power structure with new people over a short period of time  not over the past 80 years.",
    "In other words, even when Nebraska voted Democratic, it did so by a margin that was about 17 points more Republican than the nation on the whole.",
    "From 1996 to 2012, West Virginia when from voting more Democratic than the nation to voting more Republican at about the same margin as Nebraska.",
    "If we extend that measure  vote relative to the national vote  back a century, we see how consistent Nebraska has been in its Republican voting.",
    "Trump wanted Roy Moore to win election to the Senate from Alabama in 2017, but allegations that Moore had molested a teenager spurred his loss.",
    "By the time Trump took office, Timken had assumed control of the state party  having earned that seat by pledging her loyalty to Trumps agenda.",
    "Theres always some explanation, of course, and Herbsters loss can be waved away as a function of the candidate, not the former president.",
    "The last time it did so was in 1964, when nearly every state backed Lyndon B. Johnson 12 months after John F. Kennedys assassination.",
    "Traditional Republican infrastructure, candidates and power versus a more Trump-inflected iteration that reflects Trumpian outcomes.",
    "Herbster is accused of sexually assaulting multiple women, the sort of ethical stain that has hobbled Trump endorsees in the past.",
    "Particularly since candidates in Nebraska, like Republicans everywhere else, have not been shy to embrace the former president.",
    "But even then, Nebraska only barely preferred Johnson: He won by about 23 points nationally but by only 5 points in Nebraska.",
    "It is somewhat unusual in its evolution, flipping from consistently blue to consistently red over a short period of time.",
    "From about 1960 to 2012, it was a purple state that tended to vote slightly more Republican than the country overall.",
    "For Trump, who sees his endorsement track record as a point of personal validation, these explanations are useful.",
    "Vance over other Republican candidates  including ones like Jane Timken, the former chair of the state party.",
    "His campaign in the state publicly broke with the Republican Party chairman shortly before the 2016 election.",
    "Since about 1940, the state has been consistently about 25 points more Republican than the country overall.",
    "Meanwhile, in West Virginia, Trumps candidate in another House primary rolled to an easy win.",
    "Again, we are dealing with a small sample size and its easy to over-interpret the tea leaves.",
    "Rep. Alex Mooney (R) is an incumbent as was his opponent  but Mooney had Trumps backing.",
    "It has been a long time since Nebraska voted for a Democratic presidential candidate.",
    "In Ohio, Trump made his riskiest endorsement bet yet, picking venture capitalist J.D.",
    "Trumps success in Ohio in 2016 actually overlapped with disruption within the party.",
    "Consider what this suggests (as Eric DeBellis pointed out on Tuesday night).",
    "Or perhaps a pattern that will persist over the rest of the years primaries.",
    "Nebraska is a traditional Republican state with traditional infrastructure.",
    "Then, with Trump on the ballot in 2016 and 2020, it got much darker red.",
    "(West Virginias governor was a Democrat until Trump took office.)",
    "Perhaps a fluke based on the voting to date.",
    "This is overly simple, certainly.",
    "Call it the GOP vs. MAGA divide.",
    "The state party was overhauled.",
    "And theres something to that.",
    "Now consider West Virginia.",
    "It went from GOP to MAGA.",
    "But it echoes elsewhere.",
    "Whats happened in Ohio?",
    "Then Trump arrived.",
    "It paid off."
  ]
}