{
  "id": 5569,
  "mediaId": 233,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Trump is backing 'Dr. Oz' in the Pennsylvania Senate race. What to know about the ex-TV show host",
  "image": "https://www.gannett-cdn.com/presto/2022/02/16/NBCT/1ee2e822-b777-42c6-9b5b-a47b2222346c-thumbnail_PABEA-021522-Dr-Oz-NewCastle-13.jpg?crop=1279,720,x0,y58&width=1279&height=720&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/05/11/dr-oz-senate-pennsylvania-trump/9703579002/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Orlando Mayorquin",
  "authorUrl": "https://www.usatoday.com/staff/6610183001/orlando-mayorquin/",
  "termIds": [
    1147,
    1653,
    3103,
    4415,
    4894,
    380,
    428,
    571,
    3451,
    2845,
    2862
  ],
  "sentences": [
    "Now, Mehmet Oz, better known as Dr. Oz, hopes thatTrumps influence will come to bear in Pennsylvanias Republican Senate primary, where he holds a thin lead in the polls, according to RealClearPolitics.",
    "Election security,? cancel culture,? and get tough on China,? are all focuses of the campaign along with more classic Republican positions on gun rights, the economy, immigration and abortions.",
    "Ozs celebrity status has made him the subject of intense scrutiny by his opponents, who have questioned his loyalty to the country because he holds dual U.S. and Turkish citizenship.",
    "Here's where it might matter most\n2022 midterm elections:The most interesting Senate races to watch, from Georgia, to Pennsylvania and Florida\nOhio GOP Senate nominee:Who is J.D.",
    "In the Ohio Senate race, former President Donald Trumps endorsement lifted a media personality and outsider candidate to the GOP nomination over a crammed Republican field.",
    "Aside from Oz, the main contenders in the Republican primary are Dave McCormick, a former hedge fund manager, and conservative political commentator Kathy Barnette.",
    "On Twitter, Oz weighed in on the leaked majority opinion draft written by Supreme Court Associate Justice Samuel Alito, agreeing with Alitos rebuke of Roe v. Wade.",
    "Ozs ascent to fame began with frequent appearances on the Oprah Winfrey show, where he appeared as a health expert, before finally getting his own show in 2009.",
    "He also has an undergraduate degree from Harvard University and a Master of Business Administration from the University of Pennsylvanias Wharton School.",
    "Some doctors have gone as far as to publicly call for Columbia University, where Oz taught, to cut its ties with the now Senate candidate, Vox reported.",
    "Vance, the Ohio GOP Senate nominee, and former Republican presidential candidate and Housing and Urban Development ecretary Ben Carson also support Oz.",
    "On Politics newsletter:Keep up with the latest breaking politics news\nRoe's midterms impact:The Roe v. Wade decision could upend the midterms.",
    "Without making us safer.?\nHis campaign site notes Ozs opposition to business shutdowns and support for keeping children in schools.",
    "Another focus of the Oz campaign is energy independence,? which was one of many issues highlighted in Trumps endorsement statement.",
    "One of Ozs children is his daughter Daphne Oz, a chef and TV personality, who hosts a cooking show that replaced her fathers show.",
    "He had worked as a heart surgeon at the New York Presbyterian Hospital, according to his biography on the Dr. Oz Show website.",
    "The university removed Ozs profile from its website, the Daily Beast and others reported, following his Senate race entrance.",
    "Oz is best known for his nationally syndicated television program the Dr. Oz Show, which came to an end with his Senate run.",
    "His campaign site says Oz supports slashing regulations on the fossil fuel industry to increase domestic energy production.",
    "Aside from Trump, Oz is backed by former Republican Texas governor Rick Perry and Fox News Sean Hannity.",
    "In the medical community, Ozs promotion of alternative medicines has made him a controversial figure.",
    "In his first campaign ad, Oz appealed to his medical background and addressed the COVID-19 pandemic.",
    "The rest of Ozs platform runs the gamut on the GOP's defining issues during Joe Biden's presidency.",
    "Trump endorsed Oz last month in his bid to replace retiring Republican Sen. Pat Toomey.",
    "The celebrity heart surgeon is best known for his TV program \"The Dr. Oz Show.\"",
    "Oz earned his doctor of medicine from the University of Pennsylvaniain 1986.",
    "In 1985, Oz married his wife Lisa, with whom he has four children.",
    "He also told Fox News he was opposed to vaccine mandates.",
    "Ozs campaign website lists more than a dozen issue areas.",
    "Oz is the race's frontrunner, but not by a wide margin.",
    "Oz was born on June 11, 1960 in Cleveland, Ohio.",
    "Oz's parents immigrated to the U.S. from Turkey.",
    "They took away our freedom,? Oz said in the ad.",
    "His father, Mustafa, had also been a surgeon.",
    "What is Dr. Ozs policy platform?",
    "Trump endorsed Oz in April.",
    "Who is endorsing Dr. Oz?",
    "Who is Dr. Ozs daughter?",
    "He is 61 years old.",
    "How old is Dr. Oz?",
    "Who is Dr. Oz?",
    "Vance?",
    "J.D."
  ]
}