{
  "id": 5579,
  "mediaId": 136,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Donald Trump's 55-0 Primary Winning Streak Finally Ends",
  "image": "https://d.newsweek.com/en/full/2034719/trump-charles-herbster.webp?w=790&f=b2360c52ff6b8489c9e479f12ec14a0e",
  "link": "https://www.newsweek.com/donald-trump-charles-herbster-primary-endorsements-nebraska-1705267",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    1147,
    2136,
    2250,
    3103,
    43,
    428,
    571,
    2710,
    2816
  ],
  "sentences": [
    "A WPA Intelligence survey conducted between April 30 and May 2 and published the Friday before the polls opened showed that Herbster's lead had completely vanished, with Pillen above him at 31 percent compared to Herbster's 26 percent.",
    "Charles Herbster, the longtime Trump ally the former president appointed as chair of his agricultural committee in 2016, lost to Jim Pillen, a University of Nebraska regent endorsed by outgoing term-limited Governor Pete Ricketts.",
    "However, it should be noted that especially in Texas, a number of these candidates were already the overwhelming favorite to win their election before they were endorsed by Trump, such as with Republican Governor Greg Abbott.",
    "Herbster's loss in Nebraska means that Trump's 55-0 streak of choosing winners in the GOP primaries has ended, with 22 of his picks in Ohio and Indiana and 33 in Texas previously winning their respective races.",
    "On the morning that the polls opened, political analysis group RacetotheWH gave Pillen just a 0.2 percent better chance of winning the election over Herbster, whose own chances stood at 30.5 percent.",
    "Pillen was projected to win with more than 33.5 percent of the GOP vote when the election was called by the Associated Press just under two and a half hours after polls closed.",
    "Vance went from being third in the polls to achieving a clear victory after Trump announced the Hillbilly Elegy author as his pick just a few weeks before the polls opened.",
    "Trump, who has been accused by several woman of sexual assault in the past, did not shy away from the allegations against his longtime ally who he endorsed back in October.",
    "Soon after the allegations emerged, Trump held a campaign rally for Herbster in Greenwood, Nebraska, where he declared the candidate \"innocent of these despicable charges.\"",
    "\"My model has this race as what might be the most competitive race I have information on,\" Logan Phillips, national political analyst at RacetotheWH, told the Examiner.",
    "However, it appears that voters in Nebraska could not look past the sexual assault allegations which emerged against Herbster and torpedoed his chances.",
    "Herbster denied the claims, described them as \"libelous fake news\" and a political hit piece orchestrated by Ricketts and Pillen, which both men denied.",
    "Donald Trump's run of endorsing the eventual winners in the GOP primaries has come to an end after his pick in the Nebraska gubernatorial primary lost.",
    "With no clear leader emerging over the past few weeks, the closely fought GOP gubernatorial primary in Nebraska was projected to go down to the wire.",
    "Herbster was leading in a number of surveys which were released in March before the Examiner report detailing the woman's claim came out.",
    "The allegations, first reported by the Nebraska Examiner, alleged that Herbster assaulted and groped eight women between 2017 and 2022.",
    "The power of Trump's endorsement could better be seen in the Senate primary in Ohio, where his preferred candidate J.D.",
    "The polls had already indicated that the claims against Herbster may have damaged his chances.",
    "\"He's the last person to do any of this stuff,\" Trump said at the May 1 rally.",
    "Herbster came second with 28.6 percent of the vote at that time.",
    "\"Trump's influence has been less than I expected.\""
  ]
}