{
  "id": 5580,
  "mediaId": 195,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Mooney wins West Virginia primary, handing Trump another win",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/mooneyalex_040122gn_lead.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3483371-mooney-wins-west-virginia-primary-handing-trump-another-win/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod/",
  "termIds": [
    3103
  ],
  "sentences": [
    "Mooney has also called the infrastructure bill Biden and Speaker Nancy Pelosis [D-Calif.] spending masterplan.?\nMcKinley, meanwhile, made the infrastructure vote a core part of his campaign, touting the $6 billion that will be sent to West Virginia, one of the nations poorest states.",
    "Looking beyond the midterms, Mooney is thought to be mulling a challenge in 2024 to Sen. Joe Manchin, one of the few Democrats who remains popular in Trump country and who backed McKinley in the House primary in a rare cross-party endorsement.",
    "In a statement, Republican National Committee Chairwoman Ronna McDaniel congratulated Mooney and Rep. Carol Miller, who coasted to the nomination in West Virginias 1st Congressional District, without mentioning McKinley.",
    "Mooney and Trump often called McKinley a RINO,? or Republican in name only, and castigated him over his infrastructure vote and vote to create a bipartisan panel to investigate the Jan. 6, 2021, attack on the Capitol.",
    "The result of this bellwether race is a clear sign that Republicans want their Members of Congress to be real conservatives as opposed to moderate RINOS,? said Club For Growth President David McIntosh.",
    "Trump in one ad for Mooney said McKinley supported the fake infrastructure bill that wasted hundreds of billions of dollars on the Green New Deal? and promoted a phony narrative? on Jan. 6.",
    "Rep. Alex Mooney on Tuesday was projected to win the GOP primary in West Virginias 2nd Congressional District, defeating Rep. David McKinley and handing former President Trump another win.",
    "McKinley, meanwhile, is more associated with the establishment wing of the GOP and ran a campaign focused largely on his vote for last years bipartisan infrastructure bill.",
    "Vance won the Ohio GOP Senate primary, though he now enters a tougher stretch in places such as Georgia and Idaho, where some of his candidates are trailing incumbents.",
    "Mooney sought throughout the primary to make the race a contrast between him and someone whose conservative credentials he and Trump frequently threw into question.",
    "Still, McKinley was on his back foot in the sparse polling that was conducted, including one survey showing him 15 points behind just days before the election.",
    "I am honored the voters of West Virginias new 2nd congressional district have chosen me to carry the conservative banner as we begin the sprint to November.",
    "Americans reject Bidens historic inflation, gas hike, and crisis at our southern border, and will vote for Republicans up-and-down the ballot,? she said.",
    "Mooney, a hard-line member of the House Freedom Caucus, ran largely on his firebrand conservatism and Trumps endorsement, which he won in November.",
    "West Virginians are in good hands with Congresswomen Carol Miller and Congressman Alex Mooney as we work to take back the House in November.",
    "Other conservatives, meanwhile, were exultant, with the anti-tax Club For Growth touting Mooneys victory after endorsing him over McKinley.",
    "Tonight is a monumental night for West Virginians & I look forward to being their trusted conservative voice in Congress,? Mooney tweeted.",
    "The two House members have served alongside each other but were lumped into the same district after the decennial redistricting process.",
    "Mooneys win marks a boost to Trump, who is leveraging some of his popularity with a spree of endorsements in the midterms.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "He also labeled Mooney a carpetbagger, noting his time in Maryland as a state senator and chairman of the state GOP.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The former president scored a win last week when J.D.",
    "The Associated Press called the race at 9:12 p.m.",
    "ET."
  ]
}