{
  "id": 5581,
  "mediaId": 157,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Conservatives are waging war against Trump -- by spending millions to beat his candidates",
  "image": "https://www.rawstory.com/media-library/donald-trump-point.jpg?id=29786642&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/donald-trump-2657301317/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    943,
    946,
    1053,
    1147,
    1710,
    1801,
    2491,
    3103,
    4771,
    428
  ],
  "sentences": [
    "Former Rep. Charlie Dent (R-PA) wrote in 2019 that he was shocked to see the club's president, David McIntosh call Trump a free-market conservative.?\n\"Their rigid, inflexible views sometimes resulted in the election of Democrats in districts or states that should easily have gone Republican.",
    "By endorsing Trump as 'a free-market conservative,' the Club for Growth, like too many others, has sacrificed whatever principles they once espoused for the shameful embrace of a man who has very few fixed policy positions,\" he also said.",
    "Take Sharron Angle, who, with Club For Growth support, emerged from relative obscurity as the Republican nominee for Senate in Nevada and then lost miserably to Democratic Sen. Harry Reid,\" wrote Dent for CNN.",
    "While the club may have once been a huge GOP power player, the more important influencer in the GOP is Trump, who has waged his own war against at least 130 Republican candidates for opposing him.",
    "\"And Mr. Vance made clear he was still bitter about all the attacks, calling out the Club by name in his victory speech even as he praised his rivals for their efforts.\"",
    "\"Its continued assault on Mr. Vance angered both Mr. Trump and his son, Donald Trump Jr., who attacked the Club for Growth on the campaign trail,\" the Times reported.",
    "The New York Times reported that the group is dropping $2 million for little-known Republican Kathy Barnette instead of supporting Dr. Mehmet Oz or David McCormick.",
    "At a time that the Republican Party has gone full-Trump, the Club for Growth appears to be unwilling to back the two men ingratiating themselves to Trump.",
    "Theres nothing conservative about supporting socialized single-payer health care,? the Club for Growth said in a typical 2016 TV spot.",
    "Roll Call wrote at the time that club vice president Andy Roth told them, Everybodys just in this surreal honeymoon phase right now.",
    "Theres nothing conservative about Donald Trump.?\nJust after Trump was inaugurated, the group thought they could work with him.",
    "The conservative group Club for Growth has a mixed record on former President Donald Trump, but it didn't start out that way.",
    "\"If the Club for Growth had a motto back then, it would have been this: Purity over victory.\"",
    "Everybody is excited, but kind of wary of what may come down the pike next.\"",
    "The two began their feud in the early days of the 2016 GOP primary race.",
    "They also backed Josh Mandel in Ohio, against Trump's hand-picked J.D.",
    "Theres nothing conservative about giving money to the Clintons.",
    "Two years later, it's unclear where the Club stands on Trump.",
    "The group supported Sen. Ted Cruz (R-TX) in 2016.",
    "Now they're betting against him in Pennsylvania.",
    "The two are allied in North Carolina, however.",
    "\"Fast forward to today.",
    "Vance."
  ]
}