{
  "id": 5587,
  "mediaId": 6443,
  "date": "2022-04-18",
  "headline": "Democrats keep falling farther behind",
  "image": "http://s9953.pcdn.co/wp-content/uploads/2022/04/Latinos_for_Trump_2016_RNC.jpg",
  "link": "http://conservativeintel.com/2022/04/18/the-briefing-vol-x-issue-16/",
  "mediaOutlet": "conservativeintel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5802,
    2034,
    2678,
    5280,
    5356,
    4905,
    1489,
    392,
    1104,
    6569
  ],
  "sentences": [
    "For example, in Nevada, Biden is so toxic (35% approval) that Sen. Catherine Cortez-Masto is now trailing not only her marquee Republican opponent, former attorney general Adam Laxalt, but also his obscure primary opponent, Army veteran and fervent Trump supporter Sam Brown.",
    "Cutting straight past humanitarian concerns to the politics of the thing, the public is sufficiently invested in this conflict (more than half are following news of it closely) that a negative outcome could make Biden’s situation even worse than it is now.",
    "Raffensperger, who was the more high-profile Republican critic of Trump’s post-election conduct, has only 29 percent support in a new poll and is almost certain to go to a runoff that he will lose, probably against conservative U.S. Rep. Jody Hice.",
    "X, Issue 16\nBiden’s presidency is poisoning the Democratic Party\nRepublicans lead in key Senate races\nTrump’s endorsement still very valuable in Senate races\nOutlook\nNo bounce for Biden: Quinnipiac’s poll in March bore terrible news for Joe Biden.",
    "Depending on the measure you take, it hasn’t been worse than this for any president and his party since George W. Bush’s post-Katrina era — indeed, Bush never polled this poorly before Katrina hit New Orleans, according to Gallup.",
    "Also annoying even to many fans of Trump was Trump’s stated rationale for the endorsement, which included the fact that Oz is a celebrity and would therefore automatically make a good candidate in his own image and likeness.",
    "Democrats failed to capture the governorships of Florida and Georgia in the strong Democratic year of 2018, and it seems highly unlikely that they will be able to knock off those or any other Republican incumbents.",
    "Although he does not lead in the polls, Vance now has a serious chance of overtaking and defeating former Secretary of State Josh Mandel and defending the Senate seat being vacated by the retiring Sen.",
    "Still, the new Republican frontrunner, the Trump-endorsed Rep. Ted Budd, has opened up a five-point lead against the likely Democratic nominee, former state Supreme Court chief justice Cheri Beasley.",
    "And although this may simply be an artifact of small subsample sizes, it is the youngest voters, age 18 to 34, who disapprove of Biden most strongly (21 percent approve and 58 percent disapprove).",
    "Senate 2022\nIowa: The state Supreme Court just saved former Rep. Abby Finkenauer from getting tossed off the ballot due to her campaign’s gross negligence in gathering petition signatures.",
    "Unfortunately, this majority is probably correct, given Russia’s evident lack of concern for civilian life and its current repositioning for a second offensive in the Donbas region.",
    "First, this means that aside from white non-Hispanics with four-year college degrees, who support him marginally at 52% to 42%, Black voters are Biden’s only positive constituency.",
    "For the second month in a row, Quinnipiac shows that Biden’s approval rating among Hispanics (26 percent) is substantially worse than his rating among whites (31 percent).",
    "The Biden presidency is about to do something Karl Rove always wanted to do but failed at — to bring about one of the biggest political realignments of the last 50 years.",
    "There is also considerable anxiety that Biden is not doing enough or giving sufficiently advanced weaponry to help Ukraine win a clear victory, as it still could do now..",
    "But conservative supporters of Trump are circulating videos online of Oz making excuses for gender-transitioning of children and supporting Jussie Smollett on his show.",
    "As we noted last week, Oz is now running on a platform every bit as conservative as that of his chief opponent, Army Ranger vet and hedge fund manager David McCormick.",
    "It seems possible that Palin and Republican Nick Begich might split the vote in the second round and give the advantage to the Democrat-backed independent Al Gross.",
    "In Georgia, where Biden’s approval is at 42%, likely GOP Senate nominee Herschel Walker has already opened up a one to four-point lead against Sen. Raphael Warnock.",
    "It is widely perceived and understood at this point that this war could have been prevented with tougher action against Russia before the conflict started.",
    "Democrats have tried to test the patience of the American people by taking their extremely narrow election mandate and stretching it to the maximum.",
    "With Trump’s endorsement, it appears that Oz has a real shot in a close and crowded race, whereas previously McCormick seemed the clear favorite.",
    "Sarah Palin is guaranteed to finish in the top four and advance to the general election under Alaska’s new and strange system of voting.",
    "His support for celebrity doctor Mehmet Oz in this Republican open-seat race has caused considerable consternation among conservatives.",
    "And we remain convinced, based on the numbers for Hispanic voters, that their moment is here to graduate into the Republican coalition.",
    "Governor 2022\nGeorgia: Although he incurred President Trump’s ire for failing to do more to contest the 2022 election results, Gov.",
    "And with 82 percent of voters believing that Vladimir Putin is a war criminal, this clearly isn’t because they support Russia.",
    "Meanwhile, as we anticipated, a large majority (74 percent) believes that the conflict is going to get worse.",
    "If the election results among blacks looks anything like that, Democrats will barely stand a chance anywhere.",
    "Election 2022: In this environment, there is no gerrymander that can save Democrats from losing the House.",
    "For example, Biden is seven points lower in Gallup’s polling than Barack Obama was at this point in 2010.",
    "At 33% approval and 54% disapproval, Biden has the lowest national rating of his presidency so far.",
    "In terms of “strong” approval and disapproval, the margin against Biden is a staggering 25 points.",
    "This won’t help her defeat Sen. Chuck Grassley, but it does spare her some measure of humiliation.",
    "The same cannot be said, however, for Kemp’s successor as secretary of state, Brad Raffensperger.",
    "At one point, banker Mike Gibbons had gained an upper hand and Vance seemed dead in the water.",
    "Brian Kemp seems likely to survive next month’s primary against the Trump-backed David Perdue.",
    "In the Quinnipiac poll, Biden isn’t even catching a break in the areas where you might expect.",
    "Hispanic realignment: There’s another wrinkle here that continues to come up in each new poll.",
    "Needless to say, for an incumbent to trail at this point in a Senate race is a very bad sign.",
    "House 2022\nAlaska: Having entered the race to replace the late Rep. Don Young, former Gov.",
    "Still, 2022 will be a very difficult year for Democrats to catch such an unlikely break.",
    "They will have to defend very difficult governorships in Nevada, Wisconsin, and Kansas.",
    "We will soon see how little patience the electorate has for this kind of governance.",
    "Only 39 percent approve of his handling of the Russo-Ukrainian War, for example.",
    "Pennsylvania: This may be President Trump’s most controversial endorsement.",
    "As the media said so often during the Trump era, the walls are closing in.",
    "In North Carolina, Biden’s job approval is slightly less terrible at 44%.",
    "But even they only approve of him by a 38-point margin, at 63% to 25%.",
    "It is also likely that he will manage to win without a runoff.",
    "But this month’s update, completed April 11, is even worse.",
    "This is some truly foul polling, and it isn’t an outlier.",
    "The picture for governors looks very difficult as well.",
    "Biden is an anchor around the necks of all Democrats.",
    "Rather, it is for the very reasons we predicted.",
    "Ohio: President Trump’s late endorsement of J.D.",
    "In the Senate, the picture is even more bleak.",
    "But Trump’s touch is apparently still good.",
    "Independents disapprove, 56 to 26 percent.",
    "Vance for Senate has upended this race.",
    "Beyond that, it is hard to say.",
    "This week: The Briefing, Vol.",
    "Fully 48 percent disapprove.",
    "Rob Portman."
  ]
}