{
  "id": 5590,
  "mediaId": 238,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Opinion How the GOP strategy to paint Democrats as extreme really works",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/10/how-republicans-paint-democrats-as-extreme/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    827,
    1070,
    2087,
    3103,
    146,
    414,
    428,
    2945
  ],
  "sentences": [
    "Then when some people protested outside the homes of Chief Justice John G. Roberts and Justice Brett M. Kavanaugh, right-wing media treated it like it was the crime of the century, evidence of the violence and extremism of that radical left.?\nWe could debate whether protesting outside political figures homes is an effective political strategy, but thats not the point.",
    "What matters is that rather than defending the potentially catastrophic effects their actions will have on millions of peoples lives, Republicans want to debate whether Kavanaugh had to put up with some shouting on his street for a night or two.",
    "Democrats are arguing for the maintenance of a half-century-old status quo, while Republicans are about to achieve a drastic change  and intensify it with a rolling series of state laws that are truly shocking.",
    "So the next time you hear Republicans ranting about the radical left? and describing some preposterous thing they claim Democrats believe, ask yourself: What is it theyre trying to get me not to think about?",
    "Yet this is the situation confronting us today: The Republican Party has gone to places never before seen in modern American politics, yet the public is just as likely to say Democrats are the extreme ones.",
    "That can be QAnon rantings about satanic pedophile conspiracies, but even supposedly mainstream GOP figures offer only slightly less unhinged versions, as when Ohio GOP Senate nominee J.D.",
    "When this issue was being debated in Virginia, for instance, government data revealed that exactly two third-trimester abortions had been performed in the state over the past two decades.",
    "I could make a case that eliminating the estate tax (a Republican idea) is more radical than raising the minimum wage (a Democratic idea), but a conservative could reasonably disagree.",
    "Recent polling shows that the number of people calling each party extreme is now roughly the same, though for the last decade they were more likely to say that about Republicans.",
    "The radical left,? they said, had leaked the draft opinion, and thats what we should talk about (even if its more likely that it was leaked by someone on the conservative side).",
    "So Republicans have now concocted a fantasy world in which babies are being aborted up until the moment of birth and even, horrifically, after that,? as Sen. Ted Cruz (R-Tex.)",
    "The purpose is to convince people that Democratic policies are absolutely beyond the pale, and by comparison even Republican policies you dont like are more reasonable.",
    "They started with not just a distraction, but a distraction meant to characterize the news of Roes upcoming demise as a story of Democratic extremism.",
    "Even when a party shifts its ideas over time, as both parties have, one can argue that one change is perfectly justified while another is outrageous.",
    "The next step is to invent positions Democrats dont actually hold or blame them for things that dont actually happen to show how extreme? they are.",
    "Both parties would like voters to believe that they are sensible and reasonable, while their opponents have bizarre and dangerous ideas.",
    "Then layer on top of that a story about sinister Democratic motivations that offer a way to understand even more ludicrous accusations.",
    "And of course, establishment liberals, who are deeply concerned about manners and propriety and civility, fall right into the trap.",
    "And there are no abortions performed after birth.? Thats called homicide, not abortion, and you dont need another law outlawing it.",
    "Whats happening right now with the Supreme Courts imminent overturning of Roe v. Wade shows the Republican strategy in action.",
    "There are checkpoints and inspections and patrols, and thousands of people getting arrested as they try to cross illegally.",
    "Vance blamed the opioid crisis on Biden intentionally allowing fentanyl into the United States to kill Republican voters.",
    "There are incredibly rare cases in which an abortion has to be performed late in a pregnancy to save a womans life.",
    "Okay, so building a wall around the United States is stupid, a voter might say, but compared to open borders?",
    "Pretty much all Republicans will say President Bidens immigration policy is open borders.? This is a lie.",
    "They talk about it and write articles about it and even pass emergency legislation in response to it.",
    "Lets first acknowledge that theres no perfect measure of extremism, at least as it relates to policy.",
    "Its as if Democrats said, Why dont Republicans support a law outlawing bestiality committed on Mars?",
    "This is all happening while the Republican Party nominates QAnon conspiracists for national office.",
    "While it downplays and excuses a violent insurrection against the U.S. government.",
    "Yet everything Republicans are saying is about how Democrats are out of control.",
    "But if the borders were actually open, that would be extreme, wouldnt it?",
    "But there arent abortions being performed moments before birth.",
    "The word lie? doesnt capture how insane that charge is.",
    "While it propagates insane lies about stolen elections.",
    "To any objective observer, that is absolutely bonkers.",
    "My god, Republicans are pro-bestiality!!",
    "While it is led by Donald Trump.",
    "!?\nOr take immigration.",
    "Its just not a thing.",
    "And it worked!",
    "puts it."
  ]
}