{
  "id": 5600,
  "mediaId": 195,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "State laws muddle national GOPs abortion messaging",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/abortion-rights_021721ap-jeffrey-collins.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/house/3482436-state-laws-muddle-national-gops-abortion-messaging/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Brooks",
  "authorUrl": "https://thehill.com/author/emily-brooks/",
  "termIds": [
    3103
  ],
  "sentences": [
    "In the wake of the leak, the National Republican Senatorial Committee (NRSC) similarly asserted that Democrats oppose restricting abortions for gender selection purposes.? It went further to counter Democratic depictions of Republicans as extremists on the abortion issue, saying that Republicans DO NOT want to throw doctors and women in jail.?\nBut state laws on the books and pending bills undermine some of those NRSC talking points.",
    "These draconian measures could even criminalize contraceptive care, in vitro fertilization and post-miscarriage care, dragging our nation back to a dark time decades into the past.?\nThe question on whether to allow exceptions to abortion bans in cases of rape and incest could be a growing issue for Republicans if Roe is overturned, particularly if anti-abortion groups pivot to advocating for nationwide abortion restrictions.",
    "Vance, the GOP nominee for Senate in Ohio, responded to a question last year about whether he supports exceptions abortion in cases of rape and incest by saying that two wrongs dont make a right.?\nOn the other side, Rep. Nancy Mace (R-S.C.), who has revealed that she was sexually assaulted as a teenager, has presented allowing these exceptions as critical for advancing restrictions for other abortions.",
    "Republican state legislators across the country are already advancing extreme new laws, seeking to arrest doctors for offering reproductive care, ban abortion entirely with no exceptions, and even charge women with murder who exercise their right to choose,? House Speaker Nancy Pelosi (D-Calif.) said in a letter to colleagues Monday.",
    "I know that South Carolinas fetal heartbeat bill would not have passed without exceptions for rape, incest and life of the mother,? Mace said on CBS Sunday, referencing her states six-week abortion ban that was signed into law last year but has been blocked by the courts from taking effect.",
    "Senate Majority Leader Mitch McConnell (R-Ky.) told USA Today over the weekend that a federal ban was possible.?\nIf the leaked opinion became the final opinion, legislative bodies  not only at the state level but at the federal level  certainly could legislate in that area,? McConnell said.",
    "A Louisiana bill that advanced 7-2 in a committee last month would recognize full rights starting from the moment of fertilization? and classify abortion as a homicide, which could subject women and doctors who perform abortions to murder charges.",
    "The myriad of state-level abortion laws and proposals are complicating national Republicans strategy of turning the issue back on Democrats rather than getting into the details of how far they would go in restricting the procedure.",
    "NRSC talking points said that states should have the flexibility to implement reasonable restrictions.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Former President Trump famously said in an MSNBC interview during the 2016 presidential race that women who get an abortion should face some sort of punishment,? also prompting swift pushback from anti-abortion groups.",
    "A number of state anti-abortion laws, including Texass new six-week abortion ban and Arizonas 15-week ban signed into law earlier this year, also lack widely popular exceptions for cases of rape and incest.",
    "A proposed bill in one state could open the door to charging people who get abortions with murder, and several other anti-abortion laws would subject doctors who perform abortions to jail time.",
    "GOP message crafters suggest that the potential end of Roe, which would leave a patchwork of abortion laws in states across the country, is a win for democracy and federalism.",
    "The American people could have their voices restored  rightfully heard through elected officials, not silenced by unelected judges,? the Republican Study Committee memo said.",
    "In November, Mace and Rep. Marjorie Taylor Greene (R-Ga.) got into a spat on Twitter over abortion, with Greene describing Mace as pro-abort? for supporting those exceptions.",
    "The conservative Republican Study Committee redistributed a messaging memo from earlier this year that put the focus on Democrats lack of support for abortion restrictions.",
    "While polls show wide popularity for some exceptions to abortion bans, several states would ban or severely restrict abortions without any exceptions for rape or incest.",
    "Top Republicans in the House and Senate have largely avoided saying what kind of national abortion restrictions, if any, they would pursue in a Republican majority.",
    "Todays Left believes in a position even more extreme than Roe: taxpayer funded abortion, on demand, until birth,? said the Republican Study Committee memo.",
    "Republicans have long been preparing for the possibility of the Supreme Court overturning Roe v. Wade with its decision in Dobbs v. Jackson Womens Health.",
    "Our position has always been women should not be treated as criminals,? Louisiana Right to Life Executive Director Benjamin Clapper told USA Today.",
    "And theyve left Republicans in Washington facing questions that threaten to expose divisions within the party on how far restrictions should go.",
    "Mace added that she would support federal legislation to enshrine those protections, but that is bound to face pushback from other Republicans.",
    "Kansas and Oklahoma, for instance, have trigger? laws that would go into effect if Roe overturned that would make providing abortions a felony.",
    "For Republicans asked about states with restrictions that are too much for their liking, national talking points provide room for defection.",
    "Last weeks leaked draft of a Dobbs opinion that would overturn the landmark 1973 abortion rights decision put that into overdrive.",
    "An April 24-28 ABC News-Washington Post poll found 79 percent support for allowing abortions in such cases.",
    "The language was so stark that the anti-abortion Louisiana Right to Life announced opposition to the bill.",
    "More than 20 states also have laws that would subject doctors who perform abortions to prison time.",
    "Many of the states proposals contradict overall GOP messaging.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Those laws and proposals are fueling Democratic arguments.",
    "J.D."
  ]
}