{
  "id": 5604,
  "mediaId": 98,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Trump-backed U.S. Rep. Alex Mooney wins West Virginia GOP primary",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/4f9dec7/2147483647/strip/true/crop/4830x3220+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F68%2Faa%2F4dd9a9efa1daf94ec9f1af26918e%2Fb083313c881f4af8bacb390f39885378",
  "link": "https://www.latimes.com/politics/story/2022-05-10/alex-mooney-wins-west-virginia-gop-primary",
  "sentiment": "0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "LEAH WILLINGHAM",
  "authorUrl": "",
  "termIds": [
    1147,
    2087,
    2510,
    3103,
    4335,
    4438,
    428,
    562,
    2999,
    2945,
    2969
  ],
  "sentences": [
    "The groundwork we have laid over the last 12 years has paved the way for a more prosperous and diverse West Virginia economy.?\nMooney, who has served in West Virginias House delegation since 2015, gave his victory speech surrounded by supporters at a hotel watch party in Charles Town in West Virginias eastern panhandle, where he lives.",
    "West Virginia did not need the money from this un-infrastructure bill.?\nIn the general election, Mooney will face Barry Wendell, an openly gay former Morgantown City Council member who bested security operations manager Angela Dwyer during Tuesdays Democratic primary.",
    "CHARLESTON, W.Va. \nIn an early victory for a candidate endorsed by former President Trump at the start of midterm season, Rep. Alex Mooney on Tuesday beat fellow incumbent Rep. David B. McKinley in West Virginias 2nd Congressional District Republican primary.",
    "Earlier Tuesday night, Trump-endorsed incumbent U.S. Rep. Carol Miller breezed to the Republican nomination in West Virginias 1st Congressional District, defeating four little-known candidates and setting herself on a clear path to reelection.",
    "In Nebraskas 2nd Congressional District, in the Omaha area, three-term Republican Rep. Don Bacon won the primary over long-shot candidate Steve Kuehl, a consultant who got a shoutout from Trump when the former president visited this month.",
    "The two incumbents, who have taken dramatically different approaches to their time in office, were pitted against each other in the states 2nd Congressional District after population losses cost West Virginia a U.S. House seat.",
    "McKinley, who has represented the state in the House since 2011, said in a statement Tuesday night that serving the people of West Virginia had been the honor of his life  and made a subtle reference to the infrastructure vote.",
    "Flood wants to fill the seat abandoned by Jeff Fortenberry, a Republican who resigned from office and ended his reelection bid after he was convicted of lying to federal authorities about an illegal campaign contribution.",
    "When Mr. McKinley started voting with the Democrats and the current administration, thats when things changed,? said Smith, who cited McKinleys vote for Bidens infrastructure bill and the Jan. 6 commission.",
    "McKinley was sharply criticized by the former president when he broke with his party as one of 13 Republicans to vote with Democrats to support President Bidens $1.2-trillion infrastructure bill.",
    "Good luck, Steve, whoever the hell you are.?\nSen. Mike Flood, a former speaker of the Nebraska Legislature, won in the states 1st Congressional District over five other Republican candidates.",
    "Trump blasted Bacon as a bad guy? during a recent rally in the state and had criticized him previously for his support of a federal infrastructure bill that most GOP lawmakers opposed.",
    "Vance, author of the bestselling memoir Hillbilly Elegy,? who last week defeated six other candidates to win the Ohio Republican primary for U.S. Senate.",
    "In Nebraskas rural, vast 3rd Congressional District, Republican U.S. Rep. Adrian Smith faced a challenger but was expected to win his partys nomination.",
    "Bacon has been mildly critical of Trump in the past, saying the former president bore some responsibility for the Jan. 6 riot at the U.S. Capitol.",
    "Fortenberrys name still appeared on the ballot for the 1st Congressional District because he withdrew after a deadline to certify the ballot.",
    "Miller will vie for her third term in the House in the fall against Lacy Watson, who was unopposed in the Democratic primary.",
    "Trump called McKinley a RINO, or Republican in name only,? and endorsed Mooney the day Biden signed the infrastructure law.",
    "In West Virginias 2nd Congressional District, McKinleys decision to support the infrastructure bill was on voters minds.",
    "Susan Smith, a small-business owner in Valley Grove, voted for Mooney on Tuesday morning at a local elementary school.",
    "Im proud that I have always stood up for whats right for West Virginia  even when it hurt me politically,? he said.",
    "West Virginias was the first of five primaries with two incumbent U.S. House members competing against each other.",
    "Two Democrats were vying for their partys nomination within the district, which is overwhelmingly Republican.",
    "Donald Trump loves West Virginia, and West Virginia loves Donald Trump,? Mooney said in his victory speech.",
    "Im sorry to be losing a congressman, but we cannot have a Republican congressman voting with the Democrats.",
    "Trump stopped far short of officially endorsing Kuehl, however, saying, I think Steve will do well.",
    "Watson, of Bluefield, lost in the 2020 Democratic primary in the former 3rd Congressional District.",
    "It will be followed by similar contests in Georgia and Michigan and in two Illinois districts.",
    "She lives in McKinleys former district and said she always voted for him in the past.",
    "The primary came on the heels of a victory by Trump-endorsed conservative J.D.",
    "Associated Press writer Grant Schulte in Omaha contributed to this report.",
    "McKinley was watching the results come in at home with his family.",
    "West Virginia hasnt elected a Democrat to the House since 2008.",
    "Mooney enters the general election as a heavy favorite to win.",
    "The race was one of the most watched on the days ballots.",
    "But not in this election."
  ]
}