{
  "id": 5607,
  "mediaId": 19,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Pennsylvania Senate Poll: Mehmet Oz Holding onto Lead in Three-Way Statistical Tie",
  "image": "https://media.breitbart.com/media/2022/05/mccormick-mehmet-oz-dr-oz-kathy-barnette-ap-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/10/pennsylvania-senate-poll-mehmet-oz-holding-onto-lead-in-three-way-statistical-tie/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    3103
  ],
  "sentences": [
    "Trumps former Secretary of State and CIA Director Mike Pompeo said Ozs decision to vote in Turkeys most recent presidential election instead of voting in Americas election raises judgments about his priorities.?\nTrumps former national security adviser, Robert OBrien, feels similarly about Ozs Turkish ties, noting that it would be problematic? if Oz were elected to the Senate and received security clearances.",
    "Barnettes popularity has also consistently increased after the candidates first debate, which was held on April 25.\nAt this point it is fair to say that Oz leads the race, Barnette enjoys a shift in momentum, and that McCormick has the resources and a level of support to stage a comeback,? Towery added.",
    "On the other hand, with abortion rights at the forefront of national politics, Barnette has seen an increase in popularity after releasing a powerful video where she condemned abortion by discussing her life as a child conceived in rape when her mother was 11-years-old.",
    "A recent poll conducted by InsiderAdvantage and FOX 29 Philadelphia found that 22.5 percent of likely GOP primary voters support Oz, with Barnette and McCormick right behind at 20.9 and 18.5 percent, respectively.",
    "Celebrity doctor Mehmet Oz holds on to a slight lead in the Pennsylvania Republican U.S. Senate primary that is virtually tied between Oz, Kathy Barnette, and Dave McCormick.",
    "For example, two high-level officials from the Trump administration have concerns about the potential national security implications if Oz is elected to the U.S. Senate.",
    "Towery said that Oz, who received former President Donald Trumps endorsement, stands to benefit from the Trump Bump,? which pushed Ohio Republican Senate nominee J.D.",
    "InsiderAdvantage chairman Matt Towery said the polls results mean that the top three candidates have an equal chance of winning Pennsylvanias GOP Senate primary.",
    "At the bottom of the pack is Jeff Bartos, who polled at 4.9 percent, and Carla Sands, who received 4.7 percent support.",
    "However, since Trumps endorsement, Ozs campaign has faced scrutiny over his ties to Turkey, where he holds citizenship.",
    "Dave McCormick is in a very close third, with all three candidates being close to or within the polls margin of error.",
    "In addition, all three candidates polled within the surveys margin of error, bringing the race to a statistical tie.",
    "Towery said:\nMehmet Oz leads, with Kathy Barnette moving into second place following the most recent debate.",
    "And McCormick has shown an ability to move votes with the sheer volume of his paid advertising.",
    "It remains to be seen if Barnettes move into second place will have continued momentum.",
    "InsiderAdvantage and FOX 29 Philadelphia polled 750 likely Republican primary voters.",
    "However, 25.9 percent of voters have not decided what candidate to support.",
    "At this point, I would not write any of the three top candidates off.",
    "Vance over the top in his election."
  ]
}