{
  "id": 5610,
  "mediaId": 18,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Lucas: Biden could use some love from Massachusetts Democrats",
  "image": "https://www.bostonherald.com/wp-content/uploads/2022/05/AP22126862292996.jpg?w=1024",
  "link": "https://www.bostonherald.com/2022/05/09/bhr-l-lucas-col-0510/",
  "sentiment": "0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Lucas",
  "authorUrl": "https://www.bostonherald.com/author/peter-lucas/",
  "termIds": [
    3103
  ],
  "sentences": [
    "And to add insult to injury, Rochelle Walensky, the director of the Centers for Disease Control will give the commencement speech at Worcester Polytechnic Institution May 23, a week before the Democratic convention in Worcester.",
    "In the face of a national election disaster, Massachusetts Democrats can show the rest of the country and indeed the world, what it means to be a true progressive Democrat by inviting Biden to Massachusetts.",
    "They can do for Joe Biden what they did for Sen. George McGovern back in 1972 when the beloved Democratic liberal from South Dakota ran against the hated Republican conservative Richard Nixon.",
    "Just because the Democrats are facing a wipeout come the November 2022 Congressional elections is no reason for Massachusetts, a Democratic stronghold, to give up the ghost.",
    "So, a visit and speech by Biden at the Dems June 3-4 state convention in would go a long way toward boosting Bidens sprits as well as the morale of the Democratic Party.",
    "And he would get a warm reception from the diminishing number of Massachusetts Democrats who, despite his train wreck of an administration, say they still support him.",
    "But dont look for Attorney General Maura Healey, the leading Democratic candidate for governor, who will be endorsed at the convention, to issue an invitation.",
    "Even Boston Mayor Michelle Wu, with less than a year in office, will deliver commencement speeches at both UMass Boston and Bunker Hill Community College.",
    "He has never been to the southern border, despite unverified rumors that grateful illegal immigrants wading the Rio Grande have renamed it the Rio Joe.",
    "As things stand now, the only places Biden has been invited to  Ukraine and the Texas southern border  are places he wants to avoid, with good reason.",
    "Because Massachusetts is the Democratic and progressive state that it is, all nine members of the U.S. House are expected to be re-elected.",
    "Vance, a MAGA supporter, who won the Republican Senate primary, but only after he was endorsed by former President Donald Trump.",
    "Biden has not even been asked to give a commencement speech at any of the states famed institutions of higher learning, either.",
    "The Massachusetts Democratic Party ought to invite President Biden to give the keynote speech at its June convention.",
    "Even U.S. Rep. Tim Ryan of Ohio is signaling Biden not to come to the Buckeye state to campaign for him.",
    "He has plummeted so far down in the polls that it would take the coal miners daughter to find him.",
    "That was when Biden humiliated Warren by defeating her in the Massachusetts presidential primary.",
    "While Vance embraced Trump, Ryan gave Biden the cold shoulder, like everybody else is doing.",
    "Warren, who would run for president in 2024 if Biden does not, still remembers 2020.",
    "But Biden has at least in the past visited Ukraine when he was vice president.",
    "U.S. Attorney General Merrick Garland will speak at the Harvard commencement.",
    "Warren came in third in her home state behind Biden and Sen. Bernie Sanders.",
    "If she searched, that is, because she is probably a MAGA supporter by now.",
    "Warren and Eddie Markey are safe by not being up for re-election in 2022.",
    "Peter Lucas is a veteran Massachusetts political reporter and columnist.",
    "Ryan on Tuesday won the Democratic primary for the U.S. Senate.",
    "And dont expect Sen. Elizabeth Warren to invite Biden either.",
    "Now she is not so subtly nudging old Joe out of the way.",
    "He just happened to lose in all the other 49 states.",
    "They stood strong and voted for McGovern.",
    "He will run against Republican J.D.",
    "McGovern carried Massachusetts.",
    "It can be lonely at the top.",
    "He has nowhere else to go.",
    "Things are bad for Biden.",
    "Nobody wants him around.",
    "Both are too dangerous.",
    "And both Democrat Sens.",
    "He is bound to accept."
  ]
}