{
  "id": 5617,
  "mediaId": 25,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Nebraska's governor's primary race pits Trump-backed candidate accused of sexual misconduct against two other Republicans",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/05/09/63499dfa-5a8a-4175-a477-5ac865601ce1/thumbnail/620x413/dd5d0f98f58e726e08d21befe5af54b8/gettyimages-1394820412.jpg",
  "link": "https://www.cbsnews.com/news/nebraska-governor-primary-republicans-donald-trump-charles-herbster-jim-pillen-brett-lindstrom/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Brewster, Sarah Ewall-Wice",
  "authorUrl": "",
  "termIds": [
    1147,
    1909,
    2136,
    3103,
    428,
    2816,
    2969
  ],
  "sentences": [
    "Fortenberry seat\nNebraskans on Tuesday will also vote in a primary election to fill a congressional seat vacated by former Representative Jeff Fortenberry, who resigned in March after he was convicted of lying to federal authorities about an illegal campaign donation from a foreign national.",
    "While McKinley and Mooney have little daylight between them on most issues, the bipartisan infrastructure law that will bring billions in funding to the state for roads, bridges, broadband and clean water has driven a wedge between them.",
    "Trump has endorsed candidates in several races, including the highest-profile contests to be the GOP nominee in the race to be Nebraska's next governor and a matchup between two incumbents for a West Virginia congressional seat.",
    "Campaign posters supporting Nebraska candidate for governor Charles Herbster decorate the grounds of the I-80 Speedway prior to the start of a rally with former President Donald Trump on May 01, 2022 in Greenwood, Nebraska.",
    "2022 Midterm Elections\n More\n Trump-backed candidate in Nebraska governor's primary accused of sexual misconduct\n States vying to hold first presidential Democratic primary contests\n Ohio primary results: Trump-backed J.D.",
    "Vance wins Republican Senate race\n Ohio Democratic rematch draws last-minute endorsements\n Leaked Supreme Court draft opinion on abortion could set stage for midterms\n More\n Adam Brewster\nCBS News political reporter.",
    "The total number of registered voters increased by only about 400 people, while the number of registered Democrats decreased by about 4,000 voters and non-partisan registrants decreased by about 2,000 people.",
    "Voters in Nebraska and West Virginia head to the polls on Tuesday, to cast ballots in primary elections that will once again test former President Donald Trump's influence over Republican primary voters.",
    "In West Virginia's first congressional district, incumbent Republican Carol Miller, who previously represented the third congressional district, is in a primary against four other Republicans.",
    "Trump, who won every single county in the state in 2020, is backing Mooney, a four-term congressman who previously served in the Maryland state senate before moving to West Virginia.",
    "Trump has endorsed businessman and longtime ally Charles Herbster, who has been accused of groping by multiple women, including two who have spoken of their experiences openly.",
    "Even without the coveted Trump endorsement, McKinley knows how important his role is in the race, arguing he's got \"a better voting record with Donald Trump than my opponent.\"",
    "Here are the key races to watch on Tuesday night:\nNebraska governor\nThe top race to watch on Tuesday night will be the Republican gubernatorial primary in Nebraska.",
    "His campaign manager told The Nebraska Examiner, which first reported the allegations, that it was \"a political hit-piece built on 100% false and baseless claims.\"",
    "That means incumbent Republican Congressmen David McKinley and Alex Mooney are in a unique situation: running against each other in the 2nd district GOP primary.",
    "Scott Olson / Getty Images\nLike other candidates who received Trump's endorsement, Herbster prominently features the former president in his campaign messaging.",
    "Herbster fiercely denieds those allegations and released an ad accusing his opponent of conspiring with one of the women making a claim against him.",
    "Pillen has received influential endorsements from Governor Pete Ricketts, the Nebraska Farm Bureau and longtime Nebraska football coach Tom Osborne.",
    "Fortenberry's name is still on the ballot Tuesday because he withdrew after the deadline to certify candidates, according to the Associated Press.",
    "According to the Nebraska secretary of state's office, there were roughly 6,400 more registered Republicans at the beginning of May than April.",
    "Trump traveled to Nebraska on May 1 to hold a campaign rally for Herbster, telling the crowd that he thinks Herbster is \"a very good man.\"",
    "Herbster is in a tough primary fight against businessman and University of Nebraska Regent Jim Pillen and state Senator Brett Lindstrom.",
    "Separately, Flood and Pansing Brooks will also be running in a June 28 special election to serve the rest of Fortenberry's current term.",
    "Ricketts and former Nebraska governor Dave Heineman are among those who have endorsed state Senator Mike Flood in the primary election.",
    "One development to watch on Tuesday night will be the role of Democrats and independents who recently switched their party affiliation.",
    "On the Democratic side, state Senator Patty Pansing Brooks is running against University of Nebraska student Jazari Kual Zakaria.",
    "But there's one looming figure who's endorsement he does not have, and it could cost him the race: former President Donald Trump.",
    "McKinley, a six-term Republican Congressman and seventh-generation West Virginian, is backed by popular Governor Jim Justice.",
    "They held a tele-rally together, and Mooney traveled to Pennsylvania on Friday to appear in person at a Trump rally.",
    "\"At some point, Republicans have to start saying no to more debt in America,\" Mooney told CBS News of his no vote.",
    "A poll released Friday by MetroNews West Virginia shows Mooney leading McKinley by 15 points among likely voters.",
    "Three other Republicans, Susan Buchser-Lochocki, Rhonda Hercules and Mike Seckman, are also running for the seat.",
    "Mooney's campaign has been prominently touting his Trump endorsement  displaying it on campaign signs and in ads.",
    "West Virginia\nDue to reapportionment with the 2020 U.S. census, West Virginia is losing a congressional seat.",
    "\"We have a chance to get on a level playing field with the rest of the country on our infrastructure.\"",
    "Whichever candidate prevails is expected to face Democratic state Senator Carol Blood in November.",
    "Several other candidates are vying for the chance to represent the party in November.",
    "Herbster donated hundreds of thousands of dollars to Trump's presidential campaigns.",
    "\"The question is, should we vote for party, or should we vote for West Virginia?",
    "To me, it's all about West Virginia,\" said McKinley, defending his yes vote.",
    "\"He's been badly maligned, and it's a shame,\" Trump said at the rally.",
    "Lindstrom has campaigned as a more moderate alternative in the race.",
    "Democratic Senator Joe Manchin even cut an ad for him.",
    "McKinley voted for the bill while Mooney did not.",
    "But his fate in the GOP primary may be sealed.",
    "\"I defend people when I know they're good.\"",
    "Fin Gomez contributed to this report.",
    "Twitter"
  ]
}