{
  "id": 5630,
  "mediaId": 136,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Trump Mocked for Seemingly Mistaking Office Mehmet Oz Is Running For",
  "image": "https://d.newsweek.com/en/full/2033283/trump-seemingly-mistakes-office-oz-running.webp?w=790&f=28c1bdba41d7d720a744794f82a7dc83",
  "link": "https://www.newsweek.com/trump-mocked-seemingly-mistaking-office-mehmet-oz-running-1704516",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    946,
    1147,
    1625,
    1653,
    2087,
    3103,
    4820,
    539,
    571,
    2845,
    2862
  ],
  "sentences": [
    "The remark came in the same rally where Trump attacked President Joe Biden's cognitive abilitya longtime attack used by the former presidentand demanded that he take a cognitive test \"to put the question to rest,\" adding that \"I don't think we really need to know the answer.\"",
    "The former president endorsed Oz in April, praising him as a candidate who will do well in Democratic strongholds of Philadelphia and Pittsburgh, while angering some Republicans who do not believe Oz to be conservative enough.",
    "Trump endorsed Oz's Senate run ahead of the May 17 primary and held a rally in Greensburg, Pennsylvania, to support him and other candidates he has endorsed in the key swing state.",
    "However, during the rally, the former president appeared to mistake the office Oz was running for, praising his wife, Lisa Oz, as Pennsylvania's future \"great\" first lady.",
    "He also accused Biden of having \"no idea what's happening,\" and mocked him for stuttering, a condition that has nothing to do with the president's cognitive abilities.",
    "Former President Donald Trump was mocked on social media after seemingly mistaking the office GOP Senate candidate Dr. Mehmet Oz is running for on Friday night.",
    "A video of the gaffe amassed more than 125,000 views on Twitter by Saturday morning, prompting some to make fun of Trump for mistaking the two offices.",
    "The celebrity physician, who is known for The Dr. Oz Show, is running to replace retiring Pennsylvania Senator Pat Toomey, who is a Republican.",
    "Currently, Frances Wolf, who is the wife of Democratic Governor Tom Wolf, holds the title of the first lady of Pennsylvania.",
    "Last week, many viewers also noticed another gaffe Trump made during his rally in Ohio, where he said he endorsed \"J.D.",
    "\"You're going to get a great first lady in the Commonwealth of Pennsylvania, you're going to get a first lady.",
    "Twitter user @whyknotmeagain2 wrote: \"He doesn't even know what the guy he endorsed is running for does he?",
    "The title of \"first lady\" refers to the wife of a state's governor, not the wife of a senator.",
    "I know her well and she's incredibleand does she love her family, her husband and her family?",
    "\"Wow, Oz is going to be both the Senator from and the Governor of PA at the same time.",
    "Guess that's how you make government smaller,\" wrote Twitter user @Brucethegolfer.",
    "So thank you very much for being here and standing, especially the first lady.\"",
    "He actually endorsed Vance, who won the GOP primary last week.",
    "Mandel,\" combining the names of Ohio Senate candidates J.D.",
    "\"By the way, your wife is so incredible,\" Trump said.",
    "Newsweek reached out to Trump's office for comment.",
    "This is the man they think their god chose.\"",
    "Vance and Josh Mandel."
  ]
}