{
  "id": 5632,
  "mediaId": 2562,
  "date": "2022-04-18",
  "headline": "JD Vance to Newsmax: Trump Revealed US Bureaucratic Corruption",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid8FF6B9AC-A1C2-4C54-8B9D-86D4079E8415.jpg",
  "link": "https://donaldjtrumppolls.com/jd-vance-to-newsmax-trump-revealed-us-bureaucratic-corruption/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    5676,
    5613,
    5858,
    2765,
    3054,
    4306,
    910,
    6678
  ],
  "sentences": [
    "Vance told \"The Chris Salcedo Show\" that when he \"saw the forces arrayed against Donald Trump, and … [how they] were desperate to destroy him, made me think, 'maybe there's something about this guy; he's doing something that needs to be done given how many people are going after him.'\"",
    "The passage comes from a Sunday article by Jonathan Turley, highlighting that \"at least five of the former Clinton campaign contractors/researchers have invoked the Fifth Amendment and refused to cooperate in fear that they might incriminate themselves in criminal conduct.\"",
    "Earlier it was revealed by The New York Times, that the \"Justice Department has conceded to a secretive intelligence court that the available evidence about Carter Page, a former Trump campaign adviser wiretapped by the F.B.I.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV’s including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nOriginal Article",
    "JD Vance to Newsmax: Trump Revealed US Bureaucratic Corruption (Newsmax/\"The Chris Salcedo Show\")\nBy Nick Koutsobinas | Monday, 18 April 2022 08:35 PM\nJ.D.",
    "Vance, running in Ohio's 2022 Senate race, told Newsmax he was shocked to discover the level of corruption revealed by Donald Trump's presidency.",
    "\"But thanks to Trump's presidency,\" Vance continues, \"it's sort of revealed that a lot of these institutions that we rely on really are corrupt.\"",
    "The wild goose chase mentioned was spurred on after the lawyer for the 2016 Hillary Clinton campaign, Michael Sussmann, provided the F.B.I.",
    "during the Russia investigation, was legally insufficient to justify the last several months of his continued surveillance in 2017.\"",
    "with false information that Trump had been involved in backdoor deals with Russia by proxy of a Russian bank, known as Alfa Bank.",
    "He notes that the government found the allegations to be manufactured and not even technically possible.\"",
    "Vance notes that Trump's presidency \"revealed the corruption in our country and in our bureaucracy.",
    "would get an illegal wiretap on a U.S. president, I would have said, 'that's crazy.'\"",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "were sent on an effective wild goose chase by the Clinton campaign.",
    "Special Counsel John Durham \"notes that both the C.I.A.",
    "If you had told me five years ago that the F.B.I.",
    "'\"No way would that happen in this country.'\"",
    "Sussmann's trial is scheduled for May 16.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch.",
    "and F.B.I."
  ]
}