{
  "id": 5632,
  "mediaId": 136,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Trump Defied by Rally-Goers Booing, Turning Backs on Mehmet Oz",
  "image": "https://d.newsweek.com/en/full/2033278/dr-oz-trump.webp?w=790&f=65e4506362a3e6ea535c2cc79353a7fc",
  "link": "https://www.newsweek.com/trump-defied-rally-goers-booing-turning-backs-mehmet-oz-1704511",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    718,
    1147,
    1237,
    1653,
    1801,
    2409,
    2491,
    3103,
    571,
    2845,
    2862
  ],
  "sentences": [
    "\"The conservative Trumpers are very upset over his endorsement, and they cannot understand it,\" Arnold McClure, the GOP chair in rural Huntingdon County, where Trump won about 75 percent of the vote in the last presidential election, told the Associated Press last month.",
    "Some attendees of former President Donald Trump's Pennsylvania rally booed when he introduced Republican Senate candidate Dr. Mehmet Oz, while a group also protested the GOP contender by turning their backs to the stage as he spoke.",
    "Pompeo, who initially served as the CIA director at the beginning of Trump's White House term, criticized Oz for voting in the 2018 Turkish election and suggested he may have inappropriately close ties to Turkey's government.",
    "Trump's former Secretary of State Mike Pompeo, who endorsed McCormick back in February, raised what he described as \"national security concerns\" about Oz in a Friday press briefing organized by McCormick's campaign.",
    "Trump's endorsement of Oz, a physician and popular television personality, has drawn substantial backlash from some Pennsylvania Republicans as well as prominent right-wing allies of the former president.",
    "There is no security issue whatsoever, and David McCormick knows that Dr. Oz has maintained his dual citizenship to make it easier to help care for his mother who has Alzheimer's and lives there.\"",
    "After Trump endorsed Oz in early April, many prominent conservatives on the national stage as well as within Pennsylvania's Republican politics came out against the former president's decision.",
    "Notably, despite some tensions between Ankara and Washington, Turkey is part of the NATO alliancemeaning it is militarily aligned with the U.S., Canada and Western European nations.",
    "Critics of Trump's decision to back Oz question the celebrity doctor's conservative credentials, with many preferring Republican Senate candidates David McCormick or Kathy Barnette.",
    "As the former president addressed supporters at the Westmoreland Fairgrounds in Greensburg Friday evening, he announced Oz ahead of the GOP contender's remarks to the crowd.",
    "She wrote, \"Now that he lost President Trump's endorsement, he's resorted to sad and desperate attacks that are no different than the tropes used against Catholics and Jews.",
    "Survey data released by Franklin & Marshall College on Thursday showed Oz just 2 points in the lead, with less than one-fifth of GOP voters backing his candidacy.",
    "Fox News host Laura Ingraham called the decision \"a mistake,\" and right-wing Trump ally Roger Stone questioned the former president's judgment.",
    "His support for Vance drew significant criticism in Ohio as well, but in the end, it managed to push the GOP candidate across the finish line.",
    "Later, as Oz addressed the Trump supporters, a group near the front of the stage turned their backs in an apparent protest against him.",
    "Stone shared an image to his Telegram channel of Oz posing for a photo with former first lady Michelle Obama, a prominent Democrat.",
    "The New York Times reported that it asked 20 rally-goers for their opinions on Oz, with only two voicing support for his candidacy.",
    "Oz campaign spokesperson Brittany Yanick slammed such assessments as \"pathetic and xenophobic\" in an email to Newsweek on Friday.",
    "The Trump-endorsed contender was supported by 18 percent of Republicans, while McCormick came in second with just 16 percent.",
    "Although Oz was born in Ohio, he maintains his Turkish citizenship and served in the country's military as a young man.",
    "But when it came time for ballots to be cast, Vance beat out his closest opponent by a margin of about 8 points.",
    "Trump has repeatedly touted Oz's celebrity status as he's explained his support for the Republican candidate.",
    "While Oz may only be narrowly ahead, Trump's endorsement proved to be key for Ohio GOP Senate candidate J.D.",
    "When the former president endorsed Vance on April 15, he was polling at third place in the contest.",
    "While many cheered, audible boos and groans could be heard in a livestream of the event on Newsmax.",
    "Whether Trump's endorsement will have the same influence in Pennsylvania remains to be seen.",
    "Dr. Oz has already said when elected to the Senate he would renounce his citizenship.",
    "Yanick did not mention Pompeo in her response, instead blaming McCormick directly.",
    "\"The Trump era is over in Pennsylvania because of his endorsement of Dr.",
    "He's in the bedrooms of all those women telling them good and bad.\"",
    "\"My friend Dr. Mehmet Oz, he's a great man,\" Trump told the crowd.",
    "Recent polling shows a close race in the Republican primary.",
    "\"His show is great,\" the former president told the crowd.",
    "Newsweek reached out to Trump's press office for comment.",
    "In third place was Army veteran Barnette at 12 percent.",
    "He leaned into those comments during his rally speech.",
    "The other GOP candidates polled in the single digits.",
    "Pennsylvania's primary will take place on May 17.",
    "\"He's on that screen.",
    "Vance on Tuesday.",
    "Oz.\""
  ]
}