{
  "id": 5638,
  "mediaId": 558,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Trump avoids talking abortion ruling, pitches Oz endorsement at Pennsylvania rally",
  "image": "https://s.yimg.com/uu/api/res/1.2/CjU0RMz0Msy68I6OARHIzg--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/wpxi_cox_videos_320/0c838b628d66346c6ab8a38d8b50b9fa",
  "link": "https://sg.news.yahoo.com/trump-oz-rally-pennsylvania-senate-primary-abortion-endorsement-141746886.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Wilson",
  "authorUrl": "https://www.yahoo.com/author/christopher-wilson",
  "termIds": [
    3103
  ],
  "sentences": [
    "Those who arrived early in the afternoon were able to watch a screening of the new movie by the conservative Dinesh DSouza, which claims to prove there was election fraud in the 2020 election based on what the Associated Press called a flawed analysis of cellphone location data and ballot drop box surveillance footage.? Both DSouza and Mike Lindell, CEO of MyPillow, who is facing lawsuits for defamation associated with his efforts to overturn the election results, spoke at the rally.",
    "While Trump told stories about the legendary golfer Arnold Palmer, mused on Oscar ratings and inspired a Lock Her Up? chant as he took credit for coining the moniker Crooked Hillary,? he did not mention , which made it seem likely that the Supreme Court is going to overturn Roe v. Wade and cut off abortion access for millions.",
    "He came into a place where we had a lot of women sitting there waiting for something unrelated, they started going crazy, Is that Dr. Oz??\nThe crowd gave Oz a mixed reaction when Trump mentioned him during his remarks, but the Senate candidate had received an even cooler reception earlier in the day.",
    "He used it more sparingly earlier this week in the second forum, eventually raising it when discussing a series of ads that McCormick has been running calling him a fake conservative, or a RINO  Republican In Name Only.? Both men have spent millions of their own money on the race.",
    "A consistent, all-day rain turned the Westmoreland Fairgrounds outside Pittsburgh into a muddy pit, but many braved the weather for the event with Trump and Dr. Mehmet Oz, whom he has endorsed in a competitive Senate primary to fill the seat of Sen. Pat Toomey, who is retiring.",
    "Hours before Trump took the stage, the attendees waiting in line at security booed an Oz video package, with some breaking into a McCormick? chant, a reference to David McCormick, a former hedge fund CEO who is Ozs chief competitor for the GOP nomination.",
    "GREENSBURG, Pa.  Former President Donald Trump spent a soggy Friday evening rally avoiding mentioning the topic of abortion, and instead promoting election conspiracy theories and pitching a skeptical crowd on his pick for Pennsylvanias Senate race.",
    "A running theme of the evening from Trump and from many of the speakers who preceded him was falsely stating that the 2020 presidential election was stolen in Pennsylvania, a state that Joe Biden won by 80,000 votes.",
    "Are we going to have a Republican Party for the donors, for the special interests, or are we going to have a Republican Party for the people?? said Vance, in his remarks urging the crowd to support Oz.",
    "Oz has been criticized for changing his position on abortion, his opponents pointing to saying that he had big-time concern? about strict laws limiting when women can receive the procedure.",
    "Ozs campaign has called the attacks pathetic and xenophobic.?\nWhoever prevails in the Republican primary , who has consistently maintained a double-digit lead in the Democratic primary.",
    "Oz has said that he has never been involved in Turkish politics, but earlier this week that included a photo of him casting a ballot in the 2018 Turkish presidential election.",
    "Pompeo, who endorsed McCormick in February, laid out his significant national security concerns? about Oz and called for further information about his ties to the country.",
    "Vance, the venture capitalist and author who won the Republican Senate primary in Ohio earlier this week.why Vance emerged from a crowded field in a hotly contested race.",
    "On Friday morning, hours before Oz took the stage with the former president, McCormicks campaign , who served as Trumps CIA director and secretary of state.",
    "McCormick has also focused on Ozs dual citizenship with Turkey and the military service he served in Turkey, calling him ? at Wednesdays debate.",
    "In March, that he maintained the dual citizenship in order to care for his mother and would renounce it if he were to be elected to the Senate.",
    "A number of Trump supporters said they were still deciding whom to vote for in the May 17 primary and questioning why Trump had gone with Oz.",
    "Trump had originally endorsed Sean Parnell in the race, after allegations of domestic abuse against him by his wife arose in a custody case.",
    "In the leaked draft, those three justices, Neil Gorsuch, Brett Kavanaugh and Amy Coney Barrett, all voted to roll back abortion access.",
    "They also said they were wondering why he hadnt made an endorsement in the crowded field for Pennsylvania's gubernatorial race.",
    "The race is considered a toss-up and the Democrats best chance at picking up a Republican seat in the 50-50 Senate this fall.",
    "His only allusion to the subject was in saying that the three justices he nominated to the bench had a big decision pending.",
    "(Oz moved across the border from New Jersey, and has been accused of carpetbagging by other Republicans in the race.)",
    "Ozs main rival in polling and fundraising thus far is McCormick, who moved to Pennsylvania to run for the seat.",
    "Nearly all of the merchandise available outside the gates was for Trump, with one tent offering Oz yard signs.",
    "Hes on that screen, hes in the bedrooms of all those women telling them good and bad, and they love him.",
    "Oz, Ive known him a long time,? Trump said of the cardiothoracic surgeon and former daytime TV host.",
    "Oz and McCormick have met in a formal debate setting twice since Trump endorsed him.",
    "McCormick also courted Trumps endorsement and was backed by Parnell.",
    "Vance's own campaign received over $10 million in support.",
    "Among the speakers at Fridays rally was J.D.",
    "Ladies and gentlemen, we have a choice.",
    "At their first matchup last week,.",
    "Trumps decision to go with Oz.",
    "His show is great.",
    "Dr."
  ]
}