{
  "id": 5641,
  "mediaId": 136,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Donald Trump Mocks Biden's Stutter, Demands Cognitive Test at PA Rally",
  "image": "https://d.newsweek.com/en/full/2033224/donald-trump-cognitive-test-joe-biden-stuttering.webp?w=790&f=cfeec4d54082fc114b451be97bbfa871",
  "link": "https://www.newsweek.com/donald-trump-mocks-bidens-stutter-demands-cognitive-test-pa-rally-1704487",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aila Slisco",
  "authorUrl": "https://www.newsweek.com/authors/aila-slisco",
  "termIds": [
    1147,
    1148,
    1653,
    2087,
    3103,
    571,
    2682,
    2862
  ],
  "sentences": [
    "In addition to Biden's speech patterns and alleged cognitive issues, Trump took aim at the entire Democratic Party on Friday, saying it was \"the party of crime, chaos and death,\" while the Republican Party was \"the party of law, order and life.\"",
    "Trump said that Biden \"has no idea what's happening\" and was \"shaking hands with thin air while [Russian President Vladimir] Putin talks about nuclear weapons all the time,\" according to a stream of the speech broadcast by C-SPAN.",
    "Trump denounced Biden's record since taking office before taking aim at his speech patterns and mental acuity during a rain-soaked Save America Rally on Friday in Greensburg, Pennsylvania, at the muddied Westmoreland Fairgrounds.",
    "Last November, Trump told Fox News host Sean Hannity that Biden should be forced to take a \"mandated\" cognitive test after reports emerged that the president had not been tested for cognitive decline during a physical exam.",
    "Columbia University psychiatrist Dr. Paul Appelbaum told Newsweek in 2018 that while the test can detect \"changes in cognitive function associated with early signs of dementia,\" nothing else can be inferred from it.",
    "The test consists of questions that appear simplesuch as asking the person to draw a clock showing 11:10but they test for problems that might occur in the early stages of dementia, according to The New York Times.",
    "\"Joe Biden should put the question to rest, I don't think we really need to know the answer, because we already do, by taking a cognitive test and releasing the results for all the world to see.",
    "Trump previously touted his test results during an interview with Hannity in July 2020, saying he \"proved I was all there because I aced it\" and claiming that his doctors \"were very surprised.\"",
    "The event was billed as a show of support to the candidates Trump has endorsed, including GOP Senate candidate Mehmet Oz of Pennsylvania, who spoke earlier at the rally.",
    "Former President Donald Trump mocked President Joe Biden's stutter by playing a \"sad\" video at a rally, while demanding that the president submit to a \"cognitive test.\"",
    "It included several edited clips of the president stuttering alongside captions that described him as \"weak,\" \"unprepared,\" \"incapable\" and \"unstable.\"",
    "The former president said that the short Biden video was \"incredible\" and \"very sad to watch\" before sharing it with the crowd.",
    "Biden has had a lifelong struggle with stuttering, a condition that has nothing to do with cognitive abilities.",
    "\"I got tired of these fake stories from these fake reporters, then I took the test ... he should take the test.",
    "Mandel,\" shortly after demanding that Biden take a cognitive test and saying that he \"aced\" a test of his own.",
    "The former president was referring to the Montreal Cognitive Assessment, or MOCA test, which he took in 2018.",
    "Trump reportedly scored 30 out of 30 on the test, which does not measure intelligence.",
    "And by the way, everybody running for president should be forced to take this test.\"",
    "During a rally on May 1, Trump bungled the name of Ohio GOP Senate candidate J.D.",
    "\"It's sad,\" Trump said after the roughly 1-minute video played.",
    "\"They said, that's an unbelievable thing,\" Trump said.",
    "Newsweek reached out to the White House for comment.",
    "Vance, calling the candidate he endorsed \"J.D.",
    "\"Rarely does anybody do what you just did.\"",
    "\"Just like I did, I did it,\" he added."
  ]
}