{
  "id": 5643,
  "mediaId": 136,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Mehmet Oz Touts 'America-First Agenda' at Rain-Soaked Rally in Pennsylvania",
  "image": "https://d.newsweek.com/en/full/2033216/mehmet-oz-save-america-rally.webp?w=790&f=b027241118bdebec8a607cca9baf7757",
  "link": "https://www.newsweek.com/donald-trump-set-speak-rain-soaked-rally-candidate-dr-mehmet-oz-1704482",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Margaret Weaver",
  "authorUrl": "https://www.newsweek.com/authors/margaret-weaver",
  "termIds": [
    3103
  ],
  "sentences": [
    "A Save America Rally at which former President Donald Trump spoke Friday appeared early on to be suffering from poor attendance amid a soaking rainstorm as Trump tries to garner support for Dr. Mehmet Oz, who shared his \"America-first agenda,\" but is characterized by some Republicans as an \"unpopular\" candidate.",
    "Oz said he and other Trump-endorsed candidates are hated by \"the establishment\" for caring about America first, and that cowards need to speak up on issues such as transgender athletes.",
    "He blamed \"the Chinese and Mexicans\" for \"devastating\" communities like his own in Ohio, taking American jobs and manufacturing \"cheap plastic garbage\" in return.",
    "More than an inch had fallen in the region by evening, and it was expected to continue through Saturday, according to the National Weather Service in Pittsburgh.",
    "Oz, endorsed by Trump on April 9, has come under fire by members of the Republican Party for being a \"RINO,\" the abbreviation for \"Republican in Name Only.\"",
    "He claims more than 2,000 \"mules,\" or \"paid political operatives hired by left-wing organizers,\" were deployed by Democrats in key states to rig the vote.",
    "Filmmaker Dinesh D'Souza spoke on his recently released \"2000 Mules\" documentary, telling the crowd that \"Democrats on the left rigged the 2020 election.\"",
    "When the heart surgeon running for the Senate nomination took the stage ahead of Trump's expected appearance, he spoke of his values.",
    "His other key values were the Second Amendment, which is \"there to protect the First Amendment,\" and the \"pursuit of happiness.\"",
    "The rally follows Trump-endorsed candidates winning primaries in Indiana, as well as in Ohio, where J.D.",
    "Bad weather and Oz is very unpopular with MAGA base,\" tweeted Republican lawyer Ron Filipkowski.",
    "Vance was in attendance Friday, where he focused on similarities between Ohio and Pennsylvania.",
    "\"Each of you has the right to determine how your life's going to be lived,\" Oz told the crowd.",
    "\"So much of what happened to Ohio ... happened right here in Pennsylvania,\" Vance said.",
    "Like a herd of pigs in a pen & rightfully so,\" Twitter user Kyla in the Burgh wrote.",
    "\"Our idiot leaders decided we didn't need to make things in the country anymore.\"",
    "\"PA Trump rally tonight for Mehmet Oz one of the lowest attended I've ever seen.",
    "\"I'm sick of the Chinese buying up American farmland and single-family homes.\"",
    "Statistics on the attendance for Friday's rally were not available.",
    "The rain in western Pennsylvania was relentless ahead of the rally.",
    "Newsweek reached out to Trump's media office for comment.",
    "\"Biological men should not play women's sports,\" Oz said.",
    "Life starts at conception,\" Oz said, addressing abortion.",
    "\"The Trump & OZ rally is literally a mud pit right now.",
    "\"I'm sick of it and I think you are, too,\" he said.",
    "\"The truth is on our side,\" D'Souza said.",
    "Vance secured the GOP Senate nomination.",
    "I'm so proud of my state.",
    "Thank you, Pennsylvania.",
    "I can't stop laughing.",
    "\"I'm a heart surgeon.",
    "I value it.\"",
    "\"Life."
  ]
}