{
  "id": 5646,
  "mediaId": 43,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Well, That Woke Everyone the &$#@ Up: Saturday's GNR",
  "image": "https://images.dailykos.com/images/1052552/story_image/snow-drops.jpg?1648257497",
  "link": "https://www.dailykos.com/story/2022/5/7/2096295/-Well-That-Woke-Everyone-the-amp-Up-Saturday-s-GNR",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    827,
    2087,
    3103,
    4423,
    571
  ],
  "sentences": [
    "Specifically, the Biden administration wants to make it easier for top-tier Russians with experience with semiconductors, space technology, cybersecurity, advanced manufacturing, advanced computing, nuclear engineering, artificial intelligence, missile propulsion technologies and other specialized scientific areas to move to the U.S.\nx\nToday @POTUS signed a disaster declaration request to provide much-needed resources to Nuevo Mexicanos affected by the fires.",
    " Rep. Teresa Leger Fernndez (@RepTeresaLF) May 5, 2022\nJob openings hit new records, while 4.5 million Americans quit or changed jobs in March, reflecting labor market strength\nU.S. employers posted a record 11.5 million job openings in March, and some 4.5 million Americans quit or changed positions, matching previous highs, reflecting continued strength in the rapidly growing labor market, where workers continue to have the upper hand.",
    "Glanvilles win, combined with Jeff Peppers special election win in the solidly blue 15th district, gives the Democrats 53 House seats  the most since 2010.\nand\nx\nTo recap:\n Carol Glanville won a seat Trump won by 16 points\n Democrats outperformed Biden 2020 in all four special House elections\n The State House will have 53 Democrats (most since 2010)\n The Leelanau County Commission went blue\nGreat day to be a Michigan Democrat!",
    "By the same token, 69% of Americans say they would oppose Congress passing a law that bans abortion nationwide.? The Washington Post reported this week that conservative groups have already met with their congressional allies about a possible nationwide ban on the procedure if Republicans retake power in Washington,? and several GOP senators have started sketching out policy details.",
    "New poll reveals warning signs for GOP on abortion ahead of midterms\nA new Yahoo News/YouGov poll, one of the first to be conducted entirely after the leak of Justice Samuel Alitos controversial draft opinion, suggests that Republicans risk overplaying their hand on abortion ahead of the 2022 midterms  and that Democrats could benefit if the hot-button issue is on the ballot.",
    " Scott Urbanowski (@ScottyUrb) May 4, 2022\nA decision to overturn Roe v. Wade might upend the midterms\nSupporters of abortion rights and their Democratic allies predicted that the thunderclap heard Monday night with Politicos publication of a leaked draft opinion by Justice Samuel A. Alito Jr. would reverberate through to the fall campaign and possibly beyond.",
    "This brings it to the fore and it will be dramatically different than what weve seen for a long time.?\nPotential political drawbacks for Republicans of overturning Roe\nRepublicans have spent decades railing against Roe while running on antiabortion platforms and promising to appoint judges who would overturn the landmark 1973 decision.",
    "Its time to end the filibuster and fight like hell to make sure all Ohio families are free to make these critical decisions without interference from politicians in Columbus or Washington.?\nThe northeast Ohio native faces an uphill climb to win this increasingly conservative state amid a tough political environment for Democrats.",
    "Democrats are Doing Great Things\nBiden Seeks to Rob Putin of His Top Scientists With Visa Lure\nThe Biden administration has a plan to rob Vladimir Putin of some of his best innovators by waiving some visa requirements for highly educated Russians who want to come to the U.S., according to people familiar with the strategy.",
    "The survey of 1,577 U.S. adults, which was conducted from May 3 to May 6, found that registered voters initially preferred a generic Democrat (44%) over a generic Republican (39%) by 5 percentage points when asked how they would vote in their district if the congressional election were being held today.",
    " The White House (@WhiteHouse) May 6, 2022\nGood News from Ukraine\nHow Zelensky Gave the World a Jewish Hero\nAs the Ukrainian president captivates the world with his bravery, he offers a reminder of the inroads Eastern and Central European Jews have made in overcoming their status as perpetual outsiders.",
    "Demand Progress, a nongovernmental organization that has pushed for higher staffer pay, celebrated the action by Pelosi on Friday, calling it a proud moment in congressional history.?\nx\nThis year, were on track to cut the federal deficit by over $1.5 trillion  the biggest decline in a single year ever.",
    "That, they said, could make an election that so far has largely appeared to be a referendum on President Biden and his party into a choice between Democratic and Republican governance that could narrow an enthusiasm gap that currently favors the Republicans and ultimately hold down expected GOP gains.",
    "Not only does widespread VPN use help millions reach material laying out the true extent of Russian military losses and countering the official portrayal of the war as a fight against fascists, say Russian Internet experts, but it also limits government surveillance of activists.",
    "And after a leaked Supreme Court draft opinion suggested the greatest liberal defeat of the modern era is looming  the abolition of the constitutional right to an abortion  Biden questioned which basic rights the right-wing high court majority fashioned by Trump will strip next.",
    "Even though weve almost recovered all of the jobs lost in the pandemic, the labor market just keeps getting tighter and tighter.?\nAmerica added 428,000 jobs in April\nAfter an electric economic recovery from the pandemic, the job market is showing signs of returning to normal.",
    "As of this week, downloads were continuing at a rate of nearly 300,000 a day, according to data compiled for the Washington Post by the analytics firm Apptopia, which relies on information from apps, publicly available data and an algorithm to come up with estimates.",
    "Other Good News\nOne of the ugliest right-wing lies about Jan. 6 is imploding\nOf all the lies that the right has pushed about the insurrection attempt, one of the ugliest is that it was a false-flag operation designed to victimize virtuous Donald Trump supporters.",
    "And even though abortion still isnt exactly a comfortable issue for Ryanhis progressive primary opponent, Morgan Harper, focused her attacks on his past opposition to abortion rightsa leaked draft of a decision to overturn Roe v. Wade changed that overnight.",
    "The hesitancy by top GOP officials Tuesday to herald the news that what they have long sought they could soon obtain suggested a concern, or at least some initial uncertainty, about whether Roes demise could have some political drawbacks for the party.",
    "But Ryans populist focus on workers interests and economic threats from China had impressed Democrats who saw him sketching out a path to a competitive race against whichever staunchly MAGA candidate emerged from the GOP primarythe Trump-endorsed J.D.",
    "A spokesman for the National Security Council confirmed that the effort is meant to weaken Putins high-tech resources in the near term and undercut Russias innovation base over the long run -- as well as benefit the U.S. economy and national security.",
    "But when voters were asked to choose instead between a pro-choice Democrat? and a pro-life Republican,? GOP support fell to 31% while Democratic support held steady  more than doubling the gap between the two candidates, to 13 percentage points.",
    " President Biden (@POTUS) May 6, 2022\nPelosi announces $45,000 minimum salary for House staffers\nSpeaker Nancy Pelosi (D-Calif.) on Friday announced that the House will now require staffers to get paid a minimum salary of $45,000.",
    "In sharpening his midterm message and his assault on Trumpism, the President is doing exactly what party leaders must going into elections  offer their candidates a rationale for power and a counter to their opponents attacks.",
    "Women are a little more likely than men to favor keeping abortion legal; 62 percent of women say abortion should be legal in all or most cases, according to the Pew Research Center, while 56 percent of men say the same.",
    "The 52-year-old company manager in Moscow tore a hole in the Digital Iron Curtain, which had been erected to control the narrative of the Ukraine war, with a tool that lets him surf blocked sites and eyeball taboo news.",
    "The 44-year-old former comedian turned president has exhibited great patriotism and bravery, joining his fate with that of his countrymen on the streets of Kyiv, refusing to leave despite Western offers of an airlift.",
    "Biden comes out fighting in pre-election reboot\nIn recent days, Biden has switched on a rhetorical blowtorch and blasted Republicans as followers of ex-President Donald Trumps Make America Great Again? demagoguery.",
    "Democrats win huge upset in Michigan\n@caglanville just FLIPPED Michigans HD-74, defeating a GOP extremist who made rape jokes, defended Russias invasion of Ukraine, & advocated for decertifying the 2020 election.",
    "But this saga also exposes the falsity of a larger right-wing deception campaign: that Jan. 6 actually reveals the profound corruption of our legal and political institutions, from law enforcement to Congress.",
    "It may have been this aspect of his Jewishness and the way it came to dovetail with those Ukrainian anxieties that made him such a suddenly popular figure, winning 73 percent of the vote in his 2019 election.",
    "One proposal, which the White House included in its latest supplemental request to Congress, is to drop the rule that Russian professionals applying for an employment-based visa must have a current employer.",
    "proposes ban on Russian oil imports by end of year\nThe European Commission has proposed a plan to phase out Russian oil imports, ratcheting up its efforts to cut off a key source of funding for the Kremlin.",
    "Now, as he runs for Senate in an increasingly red Ohio, a nationwide reckoning over abortion rights is reshaping the political landscape in this years electionsand could propel Ryans underdog campaign.",
    "The right wants to take this to a place  and I think this will be a problem for the right  to a very dark place that I dont think Americans are prepared for,? said Democratic pollster Anna Greenberg.",
    "In this case, what Ukrainians saw in this lonely figure banging on the window was themselves, embattled, trying to hold on to their national identity amid growing threats to their independence.",
    "Russia is losing on the electronic battlefield\nAmong Russias most costly mistakes when it invaded Ukraine was the expectation that it would dominate the electronic warfare part of the battle.",
    "And as evil as it is, and as much as I wish that it did not exist, I feel like I just welcomed millions and millions of Americans to the fight to keep power out of more Republican hands.",
    "Along with all that seems to be recurringthe military aggression, the assault on freedomthere is also something new: inclusion and acceptance in a place where it once seemed impossible.",
    "In the Soviet world that shaped Zelensky and his parents, Jews were perceived as the eternal outsiders, possible fifth columnists, the rootless cosmopolitans? of Stalins imagination.",
    "Putin must pay a price, a high price, for his brutal aggression,? European Commission President Ursula von der Leyen told the European Parliament in Strasbourg, France, on Wednesday.",
    "And the fact that 5 justices voted to abolish Roe is out there for all of us to see as well as the logical chain which could lead to the destruction of so many other rights.",
    "Instead, Russia has stumbled and lost its way in the little-known realm of intercepting and jamming communications, an increasingly essential element of military success.",
    "4532, the House will for the first time ever set the minimum annual pay for staff at $45,000,? Pelosi wrote in a Dear Colleague? letter, first reported by Punchbowl News.",
    "And what is remarkable, truly mind-blowing in the long sweep of history, is that his Jewishness has not stood in the way of his being embraced as a symbol of the nation.",
    "How millions of Russians are tearing holes in the Digital Iron Curtain\n When Russian authorities blocked hundreds of Internet sites in March, Konstantin decided to act.",
    "Thats undeniably good news: America remains 1.2 million jobs in the hole from the early days of Covid, when nearly 22 million jobs vanished over the span of two months.",
    "On Monday night, Ryan reaffirmed he would vote to end the Senates 60-vote threshold in order to re-establish abortion rights should the Supreme Court follow through.",
    "This of course came on top of living in a place where a particularly virulent strain of anti-Semitism had always existed, a legacy of pogroms and Nazi collaboration.",
    "In early April, Russian telecom operator Yota reported that the number of VPN users was 53.5 times as high as in January, according to the Tass state news service.",
    "Its still growing at a remarkably strong pace\nAmericas employers added 428,000 jobs in April, the same as in March, the Bureau of Labor Statistics reported Friday.",
    "Now, whether Ryan gains traction in Ohio could depend on how well this one-time abortion foe can capitalize on the public backlash to the end of abortion access.",
    "Abortion Is the Five-Alarm Fire That Could Save Some Democrats\nWhen Tim Ryan first ran for Congress two decades ago, he campaigned as an anti-abortion Democrat.",
    "We've run the numbers and all but two of the 35 House Democratic frontline members outraised their Republican opponents during the most recent quarter.",
    "It was the 16th straight month of job growth and the 12th straight month that more than 400,000 jobs were added, but gains have started to moderate.",
    "The League of Women Voters work year-round to combat voter suppression through advocacy, grassroots organizing, legal action and public education.",
    "The League of Women Voters work year-round to combat voter suppression through advocacy, grassroots organizing, legal action and public education.",
    "x\nToday, we learned that the economy created 428,000 jobs in April  bringing the total number of jobs created since I took office to 8.3 million.",
    "The district includes the cities of Cedar Springs, Grandville, Rockford, and Walker (where Glanville is a city commissioner), plus six townships.",
    "Russias unexpected failure on the electronic battlefield offers a case study in what has gone wrong for Moscow since the invasion began Feb. 24.",
    "Overnight, however, Democrats have become increasingly eager to make the 2022 midterms a referendum on the GOPs long quest to outlaw abortion.",
    "In these days of war and uncertainty, the fact that a Jew has come to represent the fighting spirit of Ukraine provides its own kind of hope.",
    "The Russians overestimated their own capabilities, underestimated Ukraines  and didnt reckon on the power of NATO military support for Kyiv.",
    "Central to this is Ray Epps, a man widely depicted as an FBI informant who deviously manipulated Trump supporters into storming the Capitol.",
    "Ryan himself had an evolution? on abortion, announcing in 2015 that he had changed his mind and embraced the mainstream Democratic position.",
    "This undercuts a key right-wing propaganda trope about the Jan. 6, 2021, assault on the Capitol that the right has pushed for nearly a year.",
    "Meanwhile, the number of new hires  6.7 million  remained steady, according to a report released Tuesday by the Bureau of Labor Statistics.",
    "the oil ban represents a dramatic shift for the E.U., which in March told the United States it couldnt join a Russian energy embargo.",
    "They are taking buses around Florida to empower returning citizens, remove financial barriers to voting, and increase public safety.",
    "They are taking buses around Florida to empower returning citizens, remove financial barriers to voting, and increase public safety.",
    "Daily downloads in Russia of the 10 most popular VPNs jumped from below 15,000 just before the war to as many as 475,000 in March.",
    "They have on the ground work in 10 states and people from other states can write postcards, phone bank, fundraise, and text.",
    "They have on the ground work in 10 states and people from other states can write postcards, phone bank, fundraise, and text.",
    "Zelensky grabbed the attention of Ukrainians by playing out what has traditionally been the part of the Jew: the outsider.",
    "For Republicans, an overturn of Roe v. Wade could add to the partys challenges in courting suburban women, in particular.",
    "I set up a place where we can donate and the funds will be distributed evenly between the tossup House and Senate races.",
    "I set up a place where we can donate and the funds will be distributed evenly between the tossup House and Senate races.",
    "This spectacular up-is-down agitprop has been central to the whole story that the right tells about the post-Trump era.",
    "Sign up at Democracy Docket to stay informed about the fight against voter suppression and the fight for voter rights.",
    "Sign up at Democracy Docket to stay informed about the fight against voter suppression and the fight for voter rights.",
    "Even if Roberts bends one of the evil 5 to his path for this decision, we are still seeing the end of abortion rights.",
    "We cannot sit back and allow the Supreme Court to gut Ohioans most fundamental rights,? Ryan said in a statement.",
    "Here it is:\nWith Hard Work, We Can Win in November\nIt is not going to be easy, but we CAN win in November.",
    "The previous Republican incumbent, now-Sen. Mark Huizenga, won his three races with over 60% of the vote.",
    "Russian clients typically download multiple VPNs, but the data suggests millions of new users per month.",
    "They are really amazing\nThe ACLU plays a key role in filing lawsuits that often stop voter suppression.",
    "They are really amazing\nThe ACLU plays a key role in filing lawsuits that often stop voter suppression.",
    "Thats just a tick above the pre-pandemic level of 3.5%, which matched a 50-year low first set in 2019.",
    "Nearly all Democratic frontliners in the House outraised their opponents in the most recent quarter.",
    "The unemployment rate, which had been expected to fall to a pandemic-era low, held steady at 3.6%.",
    "I am pleased to announce that, pursuant to the statutory authority of the Speaker in 2 U.S.C.",
    "These failures left Russias forces  and even some of its top generals  vulnerable to attack.",
    "You can get involved with them at this link\nVolunteer with Black Votes Matter at this link.",
    "You can get involved with them at this link\nVolunteer with Black Votes Matter at this link.",
    "No more pretending to uphold basic rights while chipping at them from the shadows (docket).",
    "Demand for workers remains white-hot,? said Julia Pollak, chief economist at ZipRecruiter.",
    "I am not glad this is happening  but I am glad that people are actually seeing it happen.",
    "That money may not be enough in a hostile political environment but certainly can't hurt.",
    "Carol will be a great advocate for education, jobs, & the environment in the legislature!",
    "I saw women (and allies) fired up in ways I havent seen since the womens march in 2016.",
    "First, remember who the real enemy is here: Republican elected officials did this.",
    "I dont know about the rest of you, but the leaked Supreme Court draft gutted me.",
    "It is really hard to wrap my head around the fact that we are going backwards.",
    "Here are some other things you can do:\nGet involved with the Democratic party.",
    "Here are some other things you can do:\nGet involved with the Democratic party.",
    "Here is the link:\nDonate for House and Senate Races\nDid you already donate?",
    "I am so lucky and so proud to be in this with you g?g?g?g???g'g'g'gg?g?g?g?",
    "Here is the link:\nDonate for House and Senate Races\nDid you already donate?",
    "It may feel good for a moment, but it hurts us in the long (and near) term.",
    "If it cant be avoided, lets see their evil plans right out in the open.",
    "Now the New York Times has obtained new evidence debunking this claim.",
    "Think of it as a one stop shop for using your $$$ to save democracy.",
    "Think of it as a one stop shop for using your $$$ to save democracy.",
    "Thats record setting job creation in my first 15 months in office.",
    "Influence voters in key areas from the comfort of your own home!",
    "Influence voters in key areas from the comfort of your own home!",
    "Start blaming Democrats on the left, right, or center for this.",
    "We CAN keep the House and Senate and even improve our margins.",
    "Spread The Vote works to get voters IDs before voting begins.",
    "Spread The Vote works to get voters IDs before voting begins.",
    "I saw people who never post about politics post about this.",
    "Donate to Planned Parenthood\nGet involved with Swing Left.",
    "Donate to Planned Parenthood\nGet involved with Swing Left.",
    "On the Lighter Side\nFeeling energized and ready to fight?",
    "Need some good news to keep you energized for the fight?",
    "Gender politics has been relatively muted for some time.",
    "1 target? for the Russians, it is because he is the No.",
    "I am glad that the battle is laid out for all to see.",
    "Listen, anyone paying attention knew this was coming.",
    "And, at first, having it here felt like a gut punch.",
    "This will unlock funding and support for our gente.",
    "This has been a truly terrible no good awful week.",
    "I am hopeful  HOPEFUL  with all the passion I see.",
    "More Democrats is the only solution to fight this.",
    "Here it is  out in the open for all of us to see.",
    "Donate to the AMAZING Florida Rights Restoration!",
    "I saw passion and anger and dedication to change.",
    "Donate to the AMAZING Florida Rights Restoration!",
    "Here is a reminder of things you can do:\n DONATE!",
    "But now I am glad that the truth is finally out.",
    "What we need to do is mobilize for the midterms.",
    "Any other focus is only benefiting Republicans.",
    "Donald Trump got 57% in the district in 2020.",
    "We arent perfect, but they are fucking evil.",
    "We arent perfect, but they are fucking evil.",
    "You can volunteer with them at this link.",
    "You can volunteer with them at this link.",
    "What can you do to fight for our rights?",
    "Out in the open for all of us to FIGHT.",
    "Get involved with Postcards to voters!",
    "Get involved with Postcards to voters!",
    "That draft woke the left the ^&%$ up.",
    "Then, something interesting happened.",
    "I saw people waking up all around me.",
    "I felt upset, furious, and hopeless.",
    "They are working on races right now!",
    "Get involved with them at this link.",
    "They are working on races right now!",
    "Get involved with them at this link.",
    "This is very broad, enormous growth.",
    "If he is now, as he put it, the No.",
    "Do it again (f you can afford it).",
    "If you can afford it, donate more.",
    "This was done by the Republicans.",
    "This was done by Republicans.",
    "They nominated these judges.",
    "You knew this was coming.",
    "I knew this was coming.",
    "Vance, as it turns out.",
    "THIS IS WHO THEY ARE.",
    "THIS IS WHAT THEY DO.",
    "What shouldnt you do?",
    "Republicans did this.",
    "Turn on one another.",
    "They installed them.",
    "Turn that to action.",
    "Are you furious?",
    "What can you do?",
    "They did this.",
    "Do it again.",
    "1 Ukrainian.",
    "Hard stop.",
    "Hard stop.",
    "DONATE!",
    "Great.",
    "Great.",
    "Good!",
    "Good.",
    "E.U."
  ]
}