{
  "id": 5649,
  "mediaId": 157,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Future growing 'bleaker' for mainstream Republicans as Trump refuses to go away: report",
  "image": "https://www.rawstory.com/media-library/donald-trump-at-rally.jpg?id=29773003&width=1200&coordinates=0%2C0%2C0%2C54&height=600",
  "link": "https://www.rawstory.com/donald-trump-republicans/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1147,
    1801,
    2027,
    3103,
    4493,
    403,
    428,
    2845
  ],
  "sentences": [
    "But as we get further and further away from 2020, the fever may start breaking.?\nThe report adds, \"An adviser to one establishment Republican considering running for president in 2024 said that for a non-MAGA candidate, the 'best case is that Trump doesnt run.?'If he doesnt  and if an establishment candidate can raise money  'theres a clear lane out there for somebody whos going to be a, Take us back to the basics of the Republican Party candidate'.?",
    "\"For anti-Trump Republicans, the unlikely, best-case scenario for 2024 had always been that Trump would fade or not run for president again and a raft of MAGA hardliners would rush in to claim his mantle, splitting up the base and allowing one establishment-oriented Republican to slip past them in the early nominating states,\" Siders wrote before adding, \"But Ohio was Exhibit A in how difficult that will be in 2024.\"",
    "I think you can be successful without embracing Trump, but it remains very challenging to get through a Republican primary when you are openly anti-Trump.?\nAnother GOP strategist tried to paint a brighter picture by looking at the number of voters who turned out for Dolan and explaining, \"Is that going to be enough [in 2024]?",
    "According to a report from Politico's David Siders, mainstream conservatives should feel disheartened after an extremist Republican candidate for the U.S. Senate -- who was opposed by state GOP officials -- won a surprising victory in a primary earlier this week.",
    "\"The landscape is even bleaker for a Trump-critical Republican today, even if Trump is no longer the incumbent,\" Siders continued with GOP adviser Jeff Sadosky lamenting the future of the party when a Trump-aligned candidate is also in the race for a nomination.",
    "As the Politico report states, Trump's success in Ohio is bad news for mainstream Republicans who were hoping that he would go away and they could get out from under his toxic cloud after his four years in office highlighted by two impeachments.",
    "The difference, Siders notes, was the endorsement of Donald Trump which boosted Vance's floundering campaign and subsequently swept away his opponents.",
    "Vance landed the nomination over wealthy Matt Dolan who has been serving as a Republican Ohio state senator since 2017.",
    "The report notes that GOP leaders are taking stock after \"Hillbilly Elegy\" author J.D.",
    "The party has changed,? Sadosky explained.",
    "As of Tuesday, it wasnt enough.",
    "I really dont know."
  ]
}