{
  "id": 5651,
  "mediaId": 237,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "'Totally controlled': Trump rips McCormick while lauding Dr. Oz in Pennsylvania rally",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/413964e/2147483647/strip/true/crop/5016x2633+0+355/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F30%2Fa6%2Fed452dea48baa86478f78ba07bd2%2Fap22127058975894.jpg",
  "link": "https://www.washingtonexaminer.com/news/campaigns/totally-controlled-trump-rips-mccormick-while-lauding-dr-oz-in-pennsylvania-rally",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan King",
  "authorUrl": "https://www.washingtonexaminer.com/author/ryan-king",
  "termIds": [
    3103
  ],
  "sentences": [
    "McCormick served as undersecretary of the treasury for international affairs during the Bush administration and turned down an offer from Trump to serve as the U.S. deputy secretary of defense when he was CEO of Bridgewater Associates, which has investments in China.",
    "Standing in the rain at a rally in Greensburg, Pennsylvania, to bolster TV celebrity Dr. Mehmet Oz, who is locked in a tight race with McCormick, the former president panned McCormick for not being \"MAGA\" enough.",
    "Behind the scenes, McCormick told friends he sought Trump's support in his bid for Senate but would draw a line at parroting Trump's 2020 election fraud claims, the Bulwark reported.",
    "Former President Donald Trump chastised Pennsylvania Republican Senate contender David McCormick over his ties to China and Senate Minority Leader Mitch McConnell on Friday.",
    "Trump hailed Oz as a true believer in the \"Make America Great Again\" movement and touted his \"enormously successful\" career during the rally.",
    "Vance had been lagging behind in the polls until Trump issued his widely coveted endorsement, catapulting him to the forefront.",
    "With his endorsement of Oz, Trump hopes to maintain his undefeated endorsement record in the 2022 Republican primary season.",
    "But Trump was steadfast in his support of Oz during the rally, arguing that he was much more of a fighter than McCormick.",
    "\"[McCormick] will quickly fold to the fake news, and he's going to fold immediately to the radical left Democrats.",
    "And he is absolutely the candidate of special interests and globalists and the Washington establishment,\" he said.",
    "This was before he was going to run, and then all of a sudden he said, 'Boy, I like this guy a lot.'\"",
    "\"We can always count on Dr. Oz to stand up for the United States and against Communist China.",
    "He came into a place where there were a lot of women sitting there for something unrelated.",
    "This is the opponent backed by Mitch McConnell, the old crow, the old broken-down crow.",
    "Even Trump appeared to draw some boos at one point in the rally when he mentioned Oz.",
    "Hes in the bedrooms of all those women telling them good and bad, and they love him.",
    "Trump's endorsement of the TV celebrity has been controversial in the MAGA world.",
    "He will fight till the end, and he will always have your back,\" Trump declared.",
    "\"I do know that he was with a company that managed money for Communist China.",
    "Earlier in the event, portions of the crowd booed when organizers praised Oz.",
    "Vance, who won the Republican primary Senate seat in Ohio earlier this week.",
    "And if you don't mind, I'd like to have Dr. Oz come up and say a few words.\"",
    "Mitch McConnell is the least popular politician in the country,\" Trump said.",
    "Trump has gone 55-0 so far in 2022  something he touted during the rally.",
    "Oz has insisted that the party \"cannot move on\" from the 2020 election.",
    "\"David came out very strongly against me on numerous occasions.",
    "The primary election in the race is set to take place May 17.",
    "That's the way he is, and that's the way he will be.",
    "Trump also ripped McCormick's connections to China.",
    "Standing near Trump at the event was J.D.",
    "They started going crazy: 'Is that Dr.",
    "\"David is totally controlled.",
    "Oz will never do that.",
    "\"Hes on that screen.",
    "Trump crowed.",
    "Oz?'\""
  ]
}