{
  "id": 5653,
  "mediaId": 129,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Inflation concerns are at the center of an Ohio Senate contest.",
  "image": "https://static01.nyt.com/images/2022/05/06/business/06economy-jobs-voters-inflation/merlin_206358606_b3adfa4c-65cd-4c6f-81f3-0d134b872a16-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/06/business/inflation-concerns-are-at-the-center-of-an-ohio-senate-contest.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "At an election night event for former State Treasurer Josh Mandel, who came in a close second to Mr. Vance in the Republican primary, Matthew Kearney, 32, a partner at a law firm, said he supported Mr. Mandel because of his stances opposing abortion and critical race theory,? the catchall conservative term for public school curriculums that focus on the functions of race and racism in American society.",
    "Im sick of the president, Joe Biden, who will buy oil and gas from every single person in the world except for a middle-class southeastern Ohioan whos trying to earn a living to support his family,? Mr. Vance said, to cheers, at an April rally with former President Donald J. Trump outside Columbus.",
    "But Mr. Vances stump speeches and ads have also included heavy appeals to social conservatives, with hard-right attacks on immigrants and transgender people, as well as digs at President Biden, whose low approval ratings are expected to hurt Democrats.",
    "Inflation and high gas, food and energy prices were among the top issues animating voters in this weeks primary contests in Ohio, where an intense general election battle for a Senate seat is now unfolding between Representative Tim Ryan and J.D.",
    "In Ohio, that worry was echoed at candidate events and forums, where voters often pointed to gas prices that had risen above $4 a gallon, despite other economic markers that have improved.",
    "The unemployment rate in the state was a low 4.1 percent in March, and Help Wanted signs have become commonplace outside storefronts, restaurants and gas stations across the state.",
    "Mr. Ryan, a Democrat, and Mr. Vance, a Republican, have both pledged to bring back jobs, rebuild Ohios manufacturing industry and withstand competition from China.",
    "Polls show that Americans, and Republicans in particular, are more concerned about inflation than at any other time since the 1980s.",
    "The race is expected to largely center on winning over establishment Republicans and working-class voters.",
    "I think people are motivated to vote based on how that is impacting them.?",
    "Inflation at the grocery store, gas prices,? Mr. Kearney said.",
    "He also pointed to his pocketbook.",
    "Vance, the author and investor."
  ]
}