{
  "id": 5654,
  "mediaId": 32,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Pass the damn bill: Biden demands chips legislation to counter China tech rise",
  "image": "https://image.cnbcfm.com/api/v1/image/107057473-16518654432022-05-06t192629z_901819114_rc2v1u92ueqk_rtrmadp_0_usa-biden.jpeg?v=1651865500&w=740&h=416&ffmt=webp",
  "link": "https://www.cnbc.com/2022/05/06/biden-demands-congress-pass-chips-innovation-bill-to-counter-china.html",
  "sentiment": "0",
  "mediaOutlet": "CNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thomas Franck",
  "authorUrl": "",
  "termIds": [
    1147,
    1223,
    2087,
    3103,
    4746,
    571,
    2996,
    2609,
    2845,
    2863
  ],
  "sentences": [
    "Elizabeth Frantz | Reuters\nPresident Joe Biden on Friday demanded Congress swiftly pass the Bipartisan Innovation Act, a multibillion-dollar investment in the U.S. semiconductor industry that both Republican and Democrat say will help insulate the country from future supply chain disruptions in Asia.",
    "If we do, its going to help bring down prices, bring home jobs and power Americas manufacturing comeback.?\nWhile the Bipartisan Innovation Act is popular with members of both parties, House and Senate lawmakers are about to begin work on rectifying differences in their two legislative versions.",
    "The GOP and its candidates have attacked the president and the Democratic Congress for their management of the U.S. economy, noting that inflation is at a 40-year high, oil prices are still above $100 per barrel and the national average price of a gallon of regular gasoline is $4.28.",
    "Its no wonder the Chinese Communist Party is literally lobbying  paying lobbyists  against this bill passing.?\nBidens trip to Ohio also comes as the president attempts to help fellow Democrats in the upcoming 2022 midterm elections and prevent a Republican takeover of Congress.",
    "Follow our live updates\nHeres where the jobs are  in one chart\nKarine Jean-Pierre to replace Jen Psaki as White House press secretary\nAmong its many provisions, the Bipartisan Innovation Act includes $52 billion in government subsidies to ramp up U.S. semiconductor production.",
    "Biden said Friday that the sum will encourage semiconductor companies to build facilities in the U.S. and help prevent the types of chip shortages that currently undermine the automotive and electronics industries.",
    "But the president stressed the thrust of the bill appeals to American lawmakers because it seeks to bolster U.S. technology and innovation and keep pace with China, a key geopolitical rival.",
    "Former President Donald Trump won Ohio in 2016 and 2020, thanks in part to Rust Belt frustrations over seeing manufacturers relocate jobs to countries where labor costs are lower.",
    "Negotiators for both chambers, including Brown, will hold their first formal meeting on the bill on Thursday, a person familiar with the matter told Reuters.",
    "CNBC Politics\nRead more of CNBCs politics coverage:\nRussia renews assault on Azovstal steel plant ahead of Victory Day; Ukraine says evacuations underway.",
    "Biden applauded the two men for their collaboration on the legislation as part of the broader bipartisan effort to bulk up domestic manufacturing.",
    "In his remarks, Biden highlighted the Labor Departments April employment report, which showed U.S. employers added 428,000 jobs last month.",
    "U.S. President Joe Biden arrives to deliver remarks during a visit at United Performance Metals in Hamilton, Ohio, May 6, 2022.",
    "Senators Brown and Portman are working hard to get it done.?\nPass the damn bill and send it to me,? the president continued.",
    "Sherrod Brown and Rob Portman, a Democrat and Republican, respectively, from Ohio, joined the president.",
    "Vance or Democratic Rep. Tim Ryan will replace the retiring Portman in the Senate.",
    "Biden spoke at United Performance Metals, a metal manufacturer near Cincinnati.",
    "Its going to help strengthen our economic and national security,? Biden said.",
    "Voters will decide in November whether Trump-backed Republican author J.D.",
    "The April report was the 12th straight month of gains over 400,000.",
    "This is a bipartisan bill,? Biden told workers at the plant.",
    "Sens."
  ]
}