{
  "id": 5656,
  "mediaId": 112,
  "date": "d2022-05-06T19:40",
  "headline": "Tim Ryan, Democrats Senate nominee in Ohio, skips Bidens events in the Cincinnati area",
  "image": "https://images.mktw.net/im-539719/horizontal?width=700&size=1.778975741239892&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/tim-ryan-democrats-senate-nominee-in-ohio-skips-bidens-events-in-the-cincinnati-area-11651866054",
  "sentiment": "0",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Victor Reklaitis",
  "authorUrl": "https://www.marketwatch.com/topics/journalists/victor-reklaitis",
  "termIds": [
    781,
    1115,
    1147,
    1223,
    1801,
    2087,
    3103,
    571,
    2996,
    2689,
    2845
  ],
  "sentences": [
    "If we do, its going to help bring down prices, bring home jobs and power Americas manufacturing comeback.?\nRelated: Biden talks up domestic manufacturings role in fighting inflation, but some economists arent buying it\nThe president also touted a new 3-D printing initiative that involves GE Aviation GE, -0.46%, Honeywell HON, -1.23%, Lockheed Martin LMT, +1.42% and other big companies.",
    "AM Forward will help lower costs for American families by improving the competitiveness of Americas small and medium-sized manufacturers, creating and sustaining high-paying manufacturing jobs, and improving supply-chain resilience through adoption of additive manufacturing,? the White House said in a news release.",
    "From the archives (April 2022): Formerly anti-Trump author of Hillbilly Elegy wins long-running battle for ex-presidents endorsement in GOP Senate primary in Ohio\nIn a speech at United Performance Metals in Hamilton, Biden repeated his call for Congress to pass a bipartisan innovation and competition bill.",
    "The president remains in close touch with him and is obviously very supportive of him, and hes looking forward to having both senators from Ohio there today.?\nA Republican win is forecast in Ohios Senate race, with betting market PredictIt giving an 84% chance of victory for the GOP.",
    "White House press secretary Jen Psaki played down the lawmakers absence and noted the involvement of Ohios two senators in the days events  Democrat Sherrod Brown and Republican Rob Portman, whose upcoming retirement has led to the race between Ryan and GOP nominee J.D.",
    "U.S. stocks finished in the red Friday, with the S&P 500 SPX, -0.57% notching its lowest close in a year, a day after the Dow Jones Industrial Average DJIA, -0.30% endured its biggest one-day drop since 2020.",
    "Such legislation is expected to include more than $50 billion in subsidies for chip makers SMH, -1.03% SOXX, -0.89%, along with billions more for other industries to build out U.S. manufacturing capacity.",
    "Vance, the author of Hillbilly Elegy,? won the GOP primary on Tuesday, buoyed by Donald Trumps endorsement in a race that was viewed as an early test of the former presidents influence in the party.",
    "My understanding is Congressman Ryan has to attend a funeral and had other events he needed to attend,? Psaki told reporters on Air Force One on Friday.",
    "Its called AM Forward, with AM standing for additive manufacturing.",
    "Pass the damn bill and send it to me,? Biden said.",
    "Vance."
  ]
}