{
  "id": 5658,
  "mediaId": 136,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Trump Poised to Re-create J.D. Vance Magic in Pennsylvania With Dr. Oz",
  "image": "https://d.newsweek.com/en/full/2032872/former-president-donald-trump.webp?w=790&f=4b9b79e8d388a2481bcff89a304d74bf",
  "link": "https://www.newsweek.com/donald-trump-jd-vance-dr-oz-pennsylvania-republican-primary-1704243",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Staten",
  "authorUrl": "https://www.newsweek.com/authors/adam-staten",
  "termIds": [
    3103
  ],
  "sentences": [
    "Data from Real Clear Politics on the race in Pennsylvania showed Dr. Mehmet Oz, whom Trump endorsed on April 9 in a move that was met with criticism from some conservatives, in first place among GOP candidates with support from 20.5 percent of likely voters.",
    "Vance, a Republican candidate endorsed by the former president, won a GOP Senate primary on Tuesday with a little more than 32 percent of the vote while his next closest competitor, Josh Mandel, received just under 24 percent, according to Politico.",
    "In the week prior to Trump's endorsement, business David McCormick, who is currently in second place with 18 percent of total support, had a 1 point advantage over Oz, according to a poll from Emerson College Polling/The Hill.",
    "Fox News host Laura Ingraham, former Trump adviser Kellyanne Conway and Sean Parnell, a Pennsylvania Republican Trump previously endorsed in the Senate primary before he dropped out of the race, all criticized the move.",
    "Former President Donald Trump's endorsement of a candidate in Pennsylvania's GOP primary for a U.S. Senate seat appears to be having the same effect as it did in Ohio, according to recent polling.",
    "A poll last month from Morning Consult showed that approximately eight in 10 Republican voters in states with high-profile races in 2022 viewed the former president in a favorable light.",
    "Other notable people who are scheduled to be in attendance at the Westmoreland Fairgrounds include MyPillow CEO Mike Lindell and author and political commentator Dinesh D'Souza.",
    "Trump, as evidenced by the results in Ohio and the trend in Pennsylvania, appears to be a powerful figure in the Republican party more than a year after leaving office.",
    "Sean Parnell posted on social media that he was \"disappointed\" and said that \"Oz is the antithesis of everything that made Trump the best president of my lifetime.\"",
    "Before Trump threw his support behind Vance, Mandel had been up by more than 5 points in the race, according to a poll from The Trafalgar Group.",
    "The video showed McCormick attacking Oz for reportedly flip-flopping on issues, claiming that \"there is no miracle cure for flip-flopping.\"",
    "On Ingraham's show, Conway said the former president's endorsement of Oz \"confused many Republicans and conservatives in Pennsylvania.\"",
    "In announcing his selection of Oz in the race, Trump said in a statement that the doctor was \"popular,\" \"respected\" and \"smart.\"",
    "After Trump announced his support of Oz in April, a number of conservatives, even some close to him, criticized the move.",
    "Newsweek reached out to a representative for Trump and to the Oz and Vance campaigns for comment.",
    "A clip of Oz in a debate with the Pennsylvania primary candidates recently went viral.",
    "On Friday evening, Oz and Vance will appear together at a Trump rally in Pennsylvania.",
    "The polls could be indicating a possible outcome like that in Ohio, where J.D.",
    "Ingraham referred to the Oz endorsement as a \"mistake.\""
  ]
}