{
  "id": 5661,
  "mediaId": 65,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Hours before Trumps PA rally with Oz, Pompeo questions about Senate candidates Turkish election vote",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/53a6802f-a5c6-4219-b999-a7441fe5a6c1/31a4aa52-22ea-4a2b-a3e0-a4832fc95ad7/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/trump-pennsylvania-rally-mehmet-oz-pompeo-questions-turkish-election-vote",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    1147,
    2409,
    2491,
    3103,
    428,
    571,
    2868,
    2940
  ],
  "sentences": [
    "The rally comes after Secretary of State Mike Pompeo  a Trump ally who served as CIA director and Americas top diplomat during the former presidents administration, but whos endorsed and campaigned for fellow West Point graduate David McCormick, Ozs top rival for the nomination  raised national security clearance questions over Ozs multiple Turkish connections.",
    "TRUMP A BIG WINNER IN VANCE'S OHIP PRIMARY VICTORY, BUT HIS GOP CLOUT FACES MORE TESTS AHEAD\nMore than 15 months removed from the White House, Trump remains the most popular and influential politician in the GOP, as he continues to endorse Republican candidates up and down the ballot and hold rallies across the country for some of the top contenders hes backed.",
    "Pompeo, a Fox News contributor, repeatedly emphasized on a call with reporters that there are \"things that we dont know about his connection to the Turkish government,\" and that Oz \"owes the people of Pennsylvania an explanation,\" because voters \"need to understand the scope and depth of his relationship with the Turkish government.\"",
    "CLICK HERE FOR THE LATEST FOX NEWS POWER RANKINGS IN THE MIDTERMS\nOz, the cardiac surgeon, author and well-known celebrity physician who until the launch of his Senate campaign late last year was host of TVs popular \"Dr. Oz Show,\" has faced questions over his dual citizenship with Turkey since declaring his candidacy.",
    "Trumps visit comes with the latest public opinion poll indicating Oz holding a razor-thin edge over two of his top primary rivals in the GOP battle to succeed retiring Republican Sen. Pat Toomey in a race that could ultimately decide if Republicans win back the Senate majority in Novembers midterm elections.",
    "Former President Donald Trump teams up Friday evening in Pennsylvania with Mehmet Oz, the GOP Senate candidate he recently endorsed in the key battleground states crowded, combative and extremely expensive Republican Senate contest with a week and a half to go until primary day in the Keystone State.",
    "ABORTION TAKES CENTER STAGE IN HIGH PROFILE PENNSYLVANIA GOP SENATE CLASH\nBut hours before the rally at the Westmoreland County Fairgrounds in the small city of Greensburg, southeast of Pittsburgh, the issue of Ozs ties to Turkey were firmly back in the political spotlight.",
    "Oz, who also has an endorsement deal with Turkeys half-government owned national airline, came under attack by McCormick at a debate on Wednesday, which is likely the last showdown between the two top contenders for the GOP nomination ahead of the May 17 primary.",
    "And the questions, in my judgment, have not been answered satisfactorily I want to make sure that I do everything I can to get the information in the hands of the voters that they can use to make a truly informed judgment about the people that they're voting for.",
    "Pompeo noted that American politicians are often criticized for failing to vote, but that Oz \"chose to vote in a Turkish presidential election, but not in an American election That raises in my mind lots of judgments about his priorities.",
    "FIRST ON FOX NEWS: OZ TO RENOUNCE TURKISH CITIZENSHIP IF ELECTED\nPointing to comments Oz first made to Fox News in March, Yannick noted that \"Dr. Oz has already said when elected to the Senate he would renounce his citizenship.",
    "McCormick, a former hedge fund executive, Gulf War combat veteran and Treasury Department official in former President George W. Bush's administration, asserted that Oz was \"compromised\" for serving in the Turkish military.",
    "\"It's why this matter needs to be clarified, brought to a conclusion so that Pennsylvania voters can know what it is that they're doing and so that the American people can have confidence that every one of their leaders.",
    "Parker, a retired senior U.S. Navy officer and former president and CEO of the East West Institute, stressed, \"I have watched him [Oz] protect the health and welfare of countless Americans and others in need.",
    "Trump took plenty of credit earlier this week when another candidate he recently backed in another jam-packed and divisive GOP Senate primary  former hedge fund executive and best-selling author J.D.",
    "There is no security issue whatsoever, and David McCormick knows that Dr. Oz has maintained his dual citizenship to make it easier to help care for his mother who has Alzheimers and lives there.\"",
    "Hes also noted numerous times during his Senate campaign that his service in the Turkish military  for 60 days during the 1980s  was done in order to maintain his dual citizenship.",
    "This is about making sure that the voters have the opportunity to know all of the things, the good characteristics and the shortcomings, of candidates who are running.",
    "In response, Oz spokesperson Brittany Yannick stated that \"these are pathetic and xenophobic attacks on Dr. Oz by David McCormick, who should be ashamed of himself.",
    "CLICK HERE TO GET THE FOX NEWS APP\nMooney, whos being backed by Trump, is facing off on Tuesday in a GOP congressional primary with Republican Rep. David McKinley.",
    "Now that he lost President Trumps endorsement, hes resorted to sad and desperate attacks that are no different than the tropes used against Catholics and Jews.\"",
    "The state lost a congressional seat during the once-in-a-decade congressional reapportionment and both Republican incumbents were drawn into the same district.",
    "The Oz campaign provided a quote from national security expert William Jr. Parker III, who noted that Oz \"is a first generation American who was born on U.S.",
    "Hes repeatedly explained that hes maintained his dual citizenship in order to take care of his mother, who lives in Istanbul and suffers from Alzheimers.",
    "The photo, first reported by ABC News, comes from Turkeys New York City consulates Facebook page, where the Oz campaign confirms their candidate voted.",
    "And we need to get him and his team to explain why he had time and energy and focus to vote in a Turkish election, but not in an American election.\"",
    "[is] fit for duty as a member of the House of Representatives, in this case, the United States Senate from Pennsylvania,\" he emphasized.",
    "MAY MADNESS: PRIMARY SEASON IGNITES IN EARNEST\nThe latest flashpoint is a photograph of Oz voting in Turkeys 2018 presidential election.",
    "The showdown, as with the Ohio and Pennsylvania GOP Senate primaries, has partially turned into a test of the former presidents clout.",
    "Trump has also invited Rep. Alex Mooney of West Virginia, from another neighboring state, to speak at the rally.",
    "Dr. Oz is an America-First candidate and we would be fortunate to have him representing us in the U.S.",
    "Pompeo also noted that \"elected officials get clearances as a result of them having been elected.\"",
    "But Ozs team denied that his casting of a ballot amounted to \"political involvement\" with Turkey.",
    "But Pompeo told Fox News on Friday, \"I don't view this as political.",
    "Vance will also speak at Friday nights rally in Pennsylvania.",
    "That's the reason for me jumping on this call this morning.\"",
    "Fox News' Courtney De George contributed to this story",
    "Vance  won the Senate nomination in neighboring Ohio.",
    "This is separate and apart from politics.",
    "Senate.\"",
    "soil.\""
  ]
}