{
  "id": 5665,
  "mediaId": 136,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Trump Pennsylvania Rally for Dr. Oz the Latest Battle in GOP Civil War",
  "image": "https://d.newsweek.com/en/full/2032096/oz-speak-trump-rally.webp?w=790&f=c7ecf91128b855a702cdd20b5100762a",
  "link": "https://www.newsweek.com/trump-pennsylvania-rally-dr-oz-latest-battle-gop-civil-war-1704237",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    3103
  ],
  "sentences": [
    "Polls consistently show that he's the dominant force within the GOP, and Vance's victoryhe was polling in third place before Trump's endorsementis being touted by many in the \"Make America Great Again\" (or MAGA) movement as a sign of Trump's enduring influence.",
    "\"The conservative Trumpers are very upset over his endorsement, and they cannot understand it,\" Arnold McClure, the GOP chair in rural Huntingdon County, where Trump won three-quarters of the vote in 2020, told the Associated Press last month.",
    "Doors for the rally will open at 3 p.m., with the guest speakers starting at 5 p.m. As with all recent Trump rallies, the event will be streamed live on Right Side Broadcasting Network's (RSBN) YouTube channel and other social media platforms.",
    "The former president's backing of Oz, a prominent TV personality and physician, has drawn strong backlash from Republicansas many question his conservative credentials, a knock against the president's endorsement.",
    "\"I don't delude myself into thinking I have a big swath of the Republican Party,\" Senator Mitt Romney, a Utah Republican who voted twice to convict Trump in his impeachment trials, told Politico on Wednesday.",
    "\"I can't say he's a RINO, but I certainly can't say he's a conservative either,\" Sam DeMarco, chair of Allegheny County's Republican committee, told the Pittsburgh Post-Gazette when speaking about Oz.",
    "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate,\" Trump said in the statement.",
    "Former President Donald Trump is set to rally supporters in Pennsylvania on Friday night, fresh off big wins for candidates he endorsed in Ohio's and Indiana's GOP primaries this week.",
    "Meanwhile, regardless of how Republican voters respond to individual endorsements, polls have consistently shown that Trump is viewed favorably by a significant majority of GOP voters.",
    "How the GOP civil war plays out in Pennsylvania and other state primaries across the country will be seen by analysts and Republicans as a test of Trump's control over the party.",
    "McCormick sought Trump's endorsement, but the former president ultimately chose Oz, appearing to prefer his celebrity status over his GOP rival's more establishment credentials.",
    "On Friday morning, Pompeo sent out a press release to announce a press conference raising what he described as \"national security concerns\" regarding the Trump-backed candidate.",
    "David McCormick, a businessman who served as the undersecretary of the treasury for international affairs, is the preferred candidate of many Pennsylvania Republicans.",
    "Trump's Pennsylvania rally will be held at Westmoreland Fairgrounds in Greensburg on Friday night, with the former president scheduled to take the stage around 8 p.m.",
    "Survey data released by Franklin & Marshall College on Thursday showed Oz just 2 points in the lead, with less than one-fifth of GOP voters backing his candidacy.",
    "The Trump ally included an image of Oz on his TV show flexing his bicep, as former first lady Michelle Obama, a Democrat, did the same as she stood next to him.",
    "I'll say it, I'm not afraid to say it,\" Fox News host Laura Ingraham said on her TV program days after Trump made the announcement.",
    "Trump endorsed Oz in an April 9 statement, later touting his support for the candidate at a North Carolina rally that evening.",
    "The Trump-endorsed contender was supported by 18 percent of Republicans, while McCormick came in second with just 16 percent.",
    "Vance in Ohio, Trump's support for Dr. Mehmet Oz in the Pennsylvania Senate primary has inflamed internal party tensions.",
    "Just 29 percent said they had a favorable view of the TV personality, while 41 percent said their view was unfavorable.",
    "As the Republican civil war continues in this primary season, Trump appears to have a clear advantage so far.",
    "Even Trump's former secretary of state Mike Pompeo has come out strongly against Oz and is backing McCormick.",
    "McCormick had 31 percent of GOP voters viewing him favorably and only 17 percent perceiving him unfavorably.",
    "In another bad sign for Oz, more Republican voters view him negatively than those with a favorable opinion.",
    "Even Trump's critics within the party have admitted he remains a driving force within Republican politics.",
    "So if he wants to become the [presidential] nominee in '24, I think he's very likely to achieve that.\"",
    "right-wing strategist Roger Stone wrote in a Telegram post the day after the endorsement came out.",
    "At the rally, he said of Oz, \"You know when you're in television for 18 years, that's like a poll.",
    "Even some prominent Trump allies on the national stage have criticized the decision publicly.",
    "Whether the same Trump effect will play out in Pennsylvania and other races is not certain.",
    "\"I think that's up for debate, and that's why people are still having questions.\"",
    "Pompeo pointed to Oz's connections to Turkey, where his parents emigrated from.",
    "\"The Trump era is over in Pennsylvania because of his endorsement of Dr.",
    "\"It's hard to imagine anything that would derail his support.",
    "In third place was Army veteran Kathy Barnette at 12 percent.",
    "Recent polling shows a close race in the Republican primary.",
    "Newsweek reached out to Trump's press office for comment.",
    "Several other candidates polled in the single digits.",
    "As was the case with Republican Senate candidate J.D.",
    "The physician also served in the Turkish military.",
    "\"I think it was a mistake for Trump to endorse Oz.",
    "(RINO is an acronym for Republican in name only.)",
    "President endoresd [sic] this guy?\"",
    "That means people like you.\"",
    "\"Wait?",
    "Oz.\"",
    "ET."
  ]
}