{
  "id": 5667,
  "mediaId": 238,
  "date": "d2022-05-06T15:13",
  "headline": "Opinion One of the ugliest right-wing lies about Jan. 6 is imploding",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/06/jan-6-ray-epps-tucker-carlson-right-wing-lie/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    1147,
    3103,
    4318,
    4340,
    182,
    545,
    2862
  ],
  "sentences": [
    "Vance tells us the Jan. 6 rioters are political prisoners.? The same House Minority Leader Kevin McCarthy (R-Calif.) who seriously considered urging Trump to resign over Jan. 6 now insists the Jan. 6 committee examination of it is illegitimate.?\nSimilarly, numerous Trump cronies have falsely argued that the Jan. 6 committee lacks a legitimate legislative purpose, shielding their own corrupt conduct from view by hiding behind the lie that its abusing its powers.",
    "You cannot overstate how central this bundle of charges has been to the project of muddying up the truth: that Trump supporters tried to thwart the transfer of power through mob violence, after being incited by Trump, amid his effort to accomplish the same through appalling procedural corruption and possibly even crimes.",
    "But this saga also exposes the falsity of a larger right-wing deception campaign: that Jan. 6 actually reveals the profound corruption of our legal and political institutions, from law enforcement to Congress.",
    "Ultimately the right-wing goal is to wield all those lies to erase a big truth: that the whole Jan. 6 saga is actually a story about how our institutions mostly held up under an extraordinary assault.",
    "Of all the lies that the right has pushed about the insurrection attempt, one of the ugliest is that it was a false-flag operation designed to victimize virtuous Donald Trump supporters.",
    "The courts slogged through months of despicable legal actions deliberately designed to invalidate the votes of millions based on lies, ultimately confirming his loss.",
    "The tale of Epps and the alleged false-flag operation started circulating after video surfaced showing him seeming to mobilize Trump supporters to enter the Capitol.",
    "A conspiracy theory took hold: Epps was not subsequently arrested, meaning he might have been an FBI agent planted to stir up Trump supporters into breaking the law.",
    "But it turns out that the Pennsylvania man actually informed FBI investigators that Epps told him to relax,? not to attack, according to audio the Times obtained.",
    "Its important to stress that Republicans and right-wing media have constructed a whole superstructure of other wild allegations on top of this Epps tale.",
    "But right now, the truly bad actors are the ones wielding lurid agitprop about our institutions in order to undermine the full Jan. 6 reckoning we need.",
    "This notion has been relentlessly pushed by Tucker Carlson and other right-wing media luminaries, Republican members of Congress, and Trump himself.",
    "This undercuts a key right-wing propaganda trope about the Jan. 6, 2021, assault on the Capitol that the right has pushed for nearly a year.",
    "Central to this is Ray Epps, a man widely depicted as a federal agent who deviously manipulated Trump supporters into storming the Capitol.",
    "So lets hope that, along with the collapsing false-flag tale, in the public mind the larger story theyre trying to tell also implodes.",
    "At bottom, many on the right have tried to turn Jan. 6 into a story about the deep rot of corruption eating away at our institutions.",
    "It concerns video that shows Epps at the Jan. 6 barricades whispering in the ear of a Pennsylvania man, who then confronts police.",
    "This has been held up by Republicans as more evidence of false-flag incitement by Epps, a small-business owner from Arizona.",
    "And Epps himself separately told the FBI the same thing, the Times reports, once again undermining the conspiracy theory.",
    "That positive story doesnt mean we should ignore the possibility of abuses by law enforcement and the Jan. 6 committee.",
    "This spectacular up-is-down agitprop has been central to the whole story that the right tells about the post-Trump era.",
    "Theres a lot more to this theory,? all of which has been comprehensively debunked by Post fact checker Glenn Kessler.",
    "And our democratic institutions are decaying in important ways (though not how the right says they are).",
    "These include claims that the Jan. 6 House committee is covering up important evidence of Eppss role.",
    "Republican officials rebuffed intense pressure to violate their official duty on his behalf.",
    "This country has a long history of law enforcement targeting legitimate political activity.",
    "Vote counters performed heroically despite threats from mobs whipped up by the president.",
    "And that the Jan. 6 mob might have been seeded with many more FBI false-flag operators.",
    "Congress affirmed that loss after literally coming under violent assault.",
    "That the Justice Department is withholding such evidence from Congress.",
    "Now the New York Times has obtained new evidence debunking this claim.",
    "He personally told this to the House committee examining Jan. 6.",
    "He was interviewed by the FBI like others present on Jan. 6.",
    "Now the Times has delivered another big blow to this story.",
    "Naturally, none of this slowed down the right-wing machine.",
    "But theres an even broader deception effort at work here.",
    "And then theres the imploding false flag? nonsense.",
    "That the FBI itself has suppressed this evidence.",
    "His lawyer flatly declares he isnt an FBI agent.",
    "The short version: Epps never urged violence.",
    "This mythology involves all kinds of claims.",
    "And theres zero evidence to the contrary.",
    "Ohio GOP Senate candidate J.D."
  ]
}