{
  "id": 5670,
  "mediaId": 237,
  "date": "d2022-05-06T14:08",
  "headline": "On Trump's Oz rally day, Pompeo raises concerns about Oz voting in Turkish elections",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/6952aa0/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F5f%2F69%2F03961f6249dba8699bf4ab5c831c%2Ffea.Oz.jpg",
  "link": "https://www.washingtonexaminer.com/opinion/columnists/on-trumps-oz-rally-day-pompeo-raises-concerns-about-oz-voting-in-turkish-elections",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Salena Zito",
  "authorUrl": "https://www.washingtonexaminer.com/opinion/author/salena-zito",
  "termIds": [
    1147,
    1653,
    2409,
    2491,
    3103,
    2862,
    2940,
    5159
  ],
  "sentences": [
    "Just In...\nGREENSBURG, Pennsylvania  Hours ahead of former President Donald Trumps rally to support Mehmet Ozs bid for the Republican nomination for the U.S. Senate seat in Pennsylvania, former CIA Director and Secretary of State Mike Pompeo held a press conference with reporters raising security concerns about Oz's ties to Turkey.",
    "It is about who is best suited to be the next United States senator from Pennsylvania thats been represented by a patriotic American conservative for an awfully long time.?\nThe Oz campaign put out a statement slamming McCormick, but not Pompeo, for his pathetic and xenophobic attacks,? stating that he should be ashamed of himself.",
    "Pompeo said that perhaps it is all innocent but that it is imperative to know the scope and depth of his relationship with the Turkish government.?\nPompeo said he wanted to be clear that his concerns are not whether Oz has done something unlawful.",
    "His endorsement lifted Oz a month ago out of the cellar; the Oz team is confident that Trumps hand in this race will have the same effect it had in Ohio for Republican primary winner J.D.",
    "Trump will hold a rally for Oz in Westmoreland County on Friday at the county fairgrounds; it marks the former president's first visit to the state since leaving office in January 2021.",
    "In that report, an Oz campaign spokesperson confirmed the allegation but denied that voting in the Turkish elections was considered being involved in Turkish politics.",
    "The longtime New Jersey resident and celebrity doctor holds dual citizenship; on Wednesday, ABC News reported Oz voted in Turkeys 2018 election.",
    "The former secretary of state, CIA director, and Kansas congressman endorsed David McCormick, a fellow West Point graduate, months ago.",
    "He said he had maintained that citizenship until now to make it easier to care for his mother, who has Alzheimers and lives in Turkey.",
    "Oz issued a statement a few weeks ago saying that if he is elected to the Senate, he will renounce his Turkish citizenship.",
    "Not only did he not engage in the American [process], but he engaged in the Turkish political process.",
    "Pompeo said that in politics, we criticize candidates all the time because they didnt vote.",
    "Oz previously said he was never involved in any capacity? in Turkish politics.",
    "Two weeks ago, Pompeo headlined a rally for McCormick in Danville.",
    "That raises in my mind a lot of judgments about his priority.\"",
    "Vance, who is also scheduled to attend the event.",
    "This is different from that,? he said bluntly."
  ]
}