{
  "id": 5672,
  "mediaId": 151,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "An America we've never seen before",
  "image": "https://static.politico.com/5d/81/1bf6ead744839b3c7b4f908baf0f/states.Schaffer.jpg",
  "link": "https://www.politico.com/newsletters/politico-weekend/2022/05/06/an-america-weve-never-seen-before-00030447",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2243,
    2429,
    3103,
    3721,
    3779,
    3801,
    4380,
    4743,
    2834,
    2945
  ],
  "sentences": [
    "Today, as Hatch is laid to rest in Utah, William Doyle, author of a biography of Hatch, takes us back to 1990 to witness what he calls the senators finest hour, when the conservative lawmaker saved the Americans With Disabilities Act from a legislation-killing move by former segregationist Jesse Helms of North Carolina that would have discriminated against people with HIV/AIDS.",
    "What Gay Marriage Taught Joe Biden  This week marks 10 years since the perennially off-script Joe Biden, then vice president, went on Meet the Press and proclaimed that he supported gay marriage, even though President Obama hadnt yet endorsed the idea.",
    "Vance became a polarizing, Trump-style conservative, winning the Republican Senate primary in Ohio this week, he charmed both liberals and conservatives with his bestselling rags-to-riches memoir, Hillbilly Elegy.",
    "Today, your location within the United States has less impact on your broad legal rights than it did in the 1850s, including your ability to carry a gun, read radical newspapers or marry whomever you want.",
    "But if the Court does overturn Roe, as an initial draft majority opinion suggests it will, that would create an enormous and immediate practical difference between living in a red state or a blue state.",
    "An America we've never seen before\nBy POLITICO MAGAZINE\n05/06/2022 09:03 AM EDT\nIts become almost a clich to say that the United States is more polarized than at any time since the 1850s.",
    "SCOTUS has an old-school elevator with a metal accordion door that has to be closed by hand by an elevator operator who waits on a little stool just in case anyone needs to go up or down.",
    "In pre-Roe Chicago, a group of women formed a clandestine network known simply as Jane,? organizing thousands of illegal abortions  and even learning to do the procedure themselves.",
    "Once slow to engage in sexual politics, Biden now confronts the end of Roe v. Wade just as the American right rediscovers a wide-ranging strain of anti-LGBTQ politics.",
    "answer: The famously witty former Governor of Texas, Ann Richards, who was the Texas state treasurer at the time, said this at the 1988 Democratic National Convention.",
    "But where others saw a heartwarming story, Kentucky author and Appalachian expert Silas House saw a dangerous? collection of dog-whistles and stereotypes.",
    "Michael Kruse interviewed House about what Hillbilly Elegy gets wrong about Appalachia, and how it foreshadowed the politician Vance has become.",
    "In 1976, Congress passed the Hyde Amendment  named after its chief sponsor  barring federal funding for abortions in most circumstances.",
    "The looming abortion landscape will be about the hard borders of jurisdiction, not the soft ones of cultural affinity, Schaffer writes.",
    "How he responds will be determined by what he learned a decade ago from a single television interview, and the worlds reaction to it.",
    "Which means more aggrieved fellow citizens, more contention over national political power, and more fear of states unlike our own.",
    "Clarence Thomas doesnt have a middle name, though, so hes just CT. And dont mess up by calling Kavanaugh BMK; he just goes by BK.",
    "When Orrin Hatch Fought Jesse Helms  Orrin Hatch, the longest-serving Republican senator in history, died last month at age 88.",
    "We all use the same Netflix accounts, have access to the same news and live in the same post-industrial service economy.",
    "Dylon Jones talked to Laura Kaplan, a former member of Jane, about the reality of criminalized abortion in America.",
    "In fact, reports Sasha Issenberg in The Friday Read, Obama himself was only weeks away from making such a reversal.",
    "Every week, The Weekend inserts a question in a POLITICO/Morning Consult poll and see what the crosstabs yield.",
    "But a visitor from the real 1850s would be baffled by that idea, writes Michael Schaffer in his latest column.",
    "42 percent  of Gen Zers think Roe v. Wade should not be overturned, compared to 56 percent of voters over 65.",
    "Thats one reason the imminent Supreme Court decision on Roe v. Wade represents such a significant milestone.",
    "Not even clerks are allowed in, which means the junior-most justice has to open the door if someone knocks.",
    "I've noticed that everybody that is for abortion has already been born,? he famously noted during a debate.",
    "Rather than a clean break, there will be plenty of partisans trapped behind the lines  on both sides.",
    "He was born with a silver foot in his mouth.?\nCan you guess who said this about George H.W.",
    "And 39 percent of Gen Zers have no opinion on the issue, vs. 13 percent of voters over 65.",
    "To hear Biden tell it, he set in motion a chain of events that would change the country.",
    "In 1980, anti-abortion messaging was a central pillar of Reagan's presidential campaign.",
    "President Ronald Reagan and Rep. Henry Hyde meet in the Oval Office on Aug. 5, 1983.",
    "Right now that's Amy Coney Barrett, but its soon to be Ketanji Brown Jackson.",
    "But the vice presidents announcement did change something: Biden himself.",
    "The country is far more homogeneous than the one that fought a civil war.",
    "Compared to that era, regional distinctions have been hugely sanded down.",
    "After oral arguments, the justices meet in a private conference room.",
    "Clerks and court insiders refer to justices by their three initials.",
    "On one side of the line, youll have a right; on the other, you wont.",
    "This is a version of America we really havent seen in living memory.",
    "Thanks to the Ronald Reagan Library for providing this image.",
    "It is someones job to provide each chambers with firewood.",
    "The justices have working fireplaces in chambers.",
    "Email us at politicoweekend@email.politico.com.",
    "This week, everyones a Supreme Court expert.",
    "Scroll to the bottom for the answer.",
    "Kennedy is AMK, Gorsuch is NMG, etc.",
    "For 11 years, it was Stephen Breyer.",
    "The 1970s Abortion Underground ...",
    "Hillbilly Reckoning  Before J.D.",
    "Drop one of these tidbits.",
    "Got any suggestions?",
    "Wanna one-up them?",
    "Bush in 1988?",
    "*Who Dissed?",
    "Follow Us"
  ]
}