{
  "id": 5674,
  "mediaId": 238,
  "date": "d2022-05-06T11:16",
  "headline": "On our radar: Trump to rally with Oz in Pennsylvania",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/06/abortion-trump-rally-oz/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1459,
    1653,
    1916,
    2087,
    3103,
    4494,
    141,
    2710,
    2845,
    2862
  ],
  "sentences": [
    "Tyler Pager: What Jill Biden is doing near a war zone  First lady Jill Bidens trip to Eastern Europe marks her highest-profile diplomatic engagement since her husband became president, visiting a region on edge from Russias ongoing war in Ukraine.Over the course of her trip, she will meet with a head of state, U.S. and NATO military leaders, Romanian and Slovak educators and Ukrainian refugees, seeking to reassure them of the United States ongoing support against those facing or at risk of Russian aggression.On Sunday, Jill Biden will visit the Slovakia-Ukraine border crossing in Vysne Nemecke, Slovakia, bringing her closer to the conflict zone than the president has been.",
    "I think restoring the Voting Rights Act is a much weightier issue than this.?\nReturn to menu\nAs expected, President Biden on Friday touted the latest Labor Department report showing the economy created 428,000 jobs in April, saying that our plans and policies have produced the strongest job creation economy in modern times.?\nTheres no question that inflation and high prices are a challenge for families across the country, and fighting inflation is a top priority for me,? Biden said.",
    "I encourage Congressional Republicans to join us in our efforts to lower prices for families across the country, by making more in America, strengthening our supply chains, and cutting the energy and prescription drug costs.?\nReturn to menu\nGordon Sondland, the former U.S. ambassador to the European Union, was a key witness in President Donald Trumps first impeachment trial, the one that focused on Trumps efforts to get dirt from Ukraine on Hunter Biden.",
    "From a Democrat: Rep. Alexandria Ocasio-Cortez (N.Y.) claimed in a tweet that Republicans in Texas passed a law allowing rapists to sue their victims for getting an abortion.?\nFrom a Republican: Sen. Rick Scott (Fla.) claimed in a memo on how to talk about abortion that Republicans DO NOT want to throw doctors and women in jail.?\nSometimes we come across potential fact checks that are so easily reviewed that it hardly seems worth the trouble.",
    "This is also an issue of fairness, as many of the youngest staffers working the longest hours often earn the lowest salaries.?\nIn 2020, roughly 1-in-8 Washington-based congressional staffers made less than the $42,610 that MIT says is a living wage for an adult with no children in the nations capital, according to a study by the advocacy group Issue One.",
    "And we have to have a pro-choice Senate and a pro-choice House if we want to protect womens rights.?\nReturn to menu\nA new jobs report will give President Biden more positive numbers to highlight at a time when he is continuing to get low marks from the public on his stewardship of the economy, largely because of inflation woes.",
    "Return to menu\nIn campaigns across the country, Democrats are wielding the draft Supreme Court opinion that would overturn Roe v. Wade like a weapon, while Republicans are criticizing the leak of the opinion and contemplating abortion bans that, for the first time in decades, could survive constitutional scrutiny.",
    "Its working title is The Envoy: Mastering the Art of Diplomacy with Trump and the World.?\nAnalysis: The symbolism behind a doomed abortion vote in the Senate\nReturn to menu\nBut writing in The Health 202, The Posts Rachel Roubein relays that, to Democrats, the largely symbolic vote still has significance.",
    "I say with the lives of 62 million unborn boys and girls ended in abortion since 1973, generations of mothers enduring heartbreaking and loss that can last a lifetime: Madame Vice President, how dare you?? Pence said at an annual gala for Carolina Pregnancy Center in Spartanburg, S.C.",
    "The continued strength of our job market and the savings that families have built up over the last year means that our economy faces the challenges of COVID-19, Putins unprovoked invasion of Ukraine, and global inflation from a position of strength.?\nHe added: Theres more work to do.",
    "The Posts Abha Bhattarai reports that the labor market has added more than 6.5 million jobs during the past year and is on pace to return to pre-pandemic levels this summer, though economists say there are signs that this record streak of employment gains is beginning to moderate.",
    "Abortion rights activists had been predicting the end of Roe since the 2016 election, and the death of Justice Ruth Bader Ginsburg nearly four years later made many of them more fearful that would come to pass and that a new 6-to-3 conservative majority was going to overturn Roe.",
    "Return to menu\nFormer president Donald Trump is scheduled to hold a rally Friday night in Greensburg, Pa., with Pennsylvania GOP Senate hopeful Mehmet Oz, who is running in a primary that will provide another signal about how strong Trumps sway is within the Republican Party.",
    "I mean, the Republicans keep saying, Oh, well this should be a state issue?  as if that is any solace to women who live in parts of the country where they already have so little access to health care, to support for their families, support for the children that they have.",
    "Among the aspects of the visit still making the rounds on social media are comments by Clyburn to the San Antonio Report about the relative importance of abortion and voting rights, another issue on which Democrats have not made much headway in Congress this term.",
    "In a letter to lawmakers, she announced a new minimum annual salary for House staffers of $45,000, effective Sept. 1.\nWith a competitive minimum salary, the House will better be able to retain and recruit excellent, diverse talent,? Pelosi said in the letter.",
    "Abha writes:\nThe job markets rapid rebound has been a cornerstone of the pandemic recovery and a major political asset for the Biden administration, even though the workforce has remained depressed by a number of factors, including retirement and caretaking.",
    "When the Lebanon, Ind., couple got into a domestic dispute in late March, Wilhoite allegedly struck her in the head? with a cement, gallon-sized flower pot, placed her in his car and dumped her body in a nearby creek, according to the Indiana State Police.",
    "How dare they!?\nReturn to menu\nIf the Supreme Court overturns Roe v. Wade, one of the looming questions is what action Congress might pursue, particularly if Republicans take control of both the House and Senate and win back the White House in 2024.",
    "Return to menu\nOn Thursday night, former vice president Mike Pence, speaking to an antiabortion group, offered a retort to remarks Vice President Harris offered on Tuesday night to a group that supports women in politics.",
    "In an era where the line seems to be moving, The Posts Timothy Bella brings us this: An Indiana man accused of killing his cancer-stricken wife as she was seeking a divorce won his GOP primary this week while in jail.",
    "In polling from The Washington Post and ABC News, most voters in six states where new abortion limitations have been passed  Arizona, Florida, Idaho, Kentucky, Texas and Wyoming  were completely unaware of them.",
    "Rachel writes:\nIn the wake of the leaked Supreme Court draft, the party wants to put senators on record and use lawmakers positions to galvanize the base  even though a similar vote was held a few months back.",
    "Last month, a poll conducted by YouGov for The Economist found just 20 percent of Americans believing that it was likely? or certain that Roe would fall, compared with 34 percent who said it was unlikely.",
    "She had completed her last chemotherapy treatment for her breast cancer diagnosis and was seeking a divorce after she found out her husband had been having an affair, according to the Lebanon Reporter.",
    "Return to menu\nCapitol Hill staffers, particularly those at the start of their careers, have historically have been overworked and underpaid, and live in a city where the cost of living isnt cheap.",
    "In her appearance two nights earlier, Harris highlighted the 13 states with so-called trigger? laws that would immediately outlaw most abortions if the Supreme Court overturns Roe v. Wade.",
    "And Gordon Sondland  who courted and championed Volodymyr Zelensky long before the Ukrainian leader became a wartime legend  thinks that he looks, in retrospect, not at all like a doofus.",
    "Employers posted a record 11.5 million openings in March  nearly double the number of jobseekers, according to a Labor Department report released earlier this week.",
    "The U.S. unemployment rate remained steady at 3.6 percent in April, as employers added 428,000 jobs to an already robust recovery, the Labor Department said Friday.",
    "Trump, who appointed three of the conservative Supreme Court justices who appear on the verge of overturning Roe v. Wade, has been largely silent on the subject.",
    "President Biden is heading to Ohio, where he plans to pitch legislation known as the Bipartisan Innovation Act, which seeks to boost domestic manufacturing.",
    "Oz, the celebrity doctor endorsed by Trump last month, is in a competitive race that also includes GOP hopeful David McCormick, a former hedge fund manager.",
    "His turn in the spotlight happened two impeachments and one insurrection ago, which felt like another lifetime until Russia invaded Ukraine in February.",
    "But I fully expect that if the Republicans gain control of Congress as early as this November, that House Bill 1 will be some form of abortion ban.",
    "Writing in The Fact Checker, The Posts Glenn Kessler examines two claims  one by a Democrat and one by a Republican  that dont stand up at all.",
    "Tim notes that Andrew Wilhoite will appear on the ballot in November for the Clinton Township Board if he has not been convicted before then.",
    "Today, former president Donald Trump is scheduled to hold a rally in Pennsylvania with celebrity doctor and GOP Senate hopeful Mehmet Oz.",
    "Because this clearly is going to be about people making a choice in a few months about whos representing them and speaking for them.",
    "Suddenly, in retrospect, the bumbling and angling revealed during Trumps first impeachment proceedings took on a sheen of portent.",
    "A Washington Post-ABC poll released this week showed that 38 percent of U.S. adults approve of Bidens handling of the economy.",
    "Return to menu\nThe trip this week by House Majority Whip James E. Clyburn (D-S.C.) to campaign for Rep. Henry Cuellar (D-Tex.)",
    "Return to menu\nIn recent days, amid heated arguments about the future of abortion, much has been said that simply isnt true.",
    "One person who is one hundred percent? certain theyll try is Cecile Richards, the former president of Planned Parenthood.",
    "Doing so will open the doors to public service for those who may not have been able to afford to do so in the past.",
    "Meanwhile, Senate Democrats are planning a vote next week on a bill that would write abortion protections into law.",
    "Tim writes:\nWilhoite was charged in March in connection to the killing of his wife, Elizabeth Nikki? Wilhoite, 41.",
    "Those Republican leaders who are trying to weaponize the use of the law against women, well we say, How dare they!",
    "Vance, another Trump-endorsed candidate, who emerged from a crowded field to claim his partys nomination.",
    "Return to menu\nIt used to be that certain things were considered disqualifying for holding public office.",
    "His ratings on job creation are better but still at a net negative overall, with 41 percent approving.",
    "Some GOP lawmakers have already signaled theyre interested in imposing federal abortion restrictions.",
    "Women in almost half the country could see their access to abortion severely limited,? Harris said.",
    "Pelosi said in her letter that will increase to $203,700 to match a recent increase by the Senate.",
    "The event Friday night is scheduled to be held outdoors at the Westmoreland County Fairgrounds.",
    "Speaking to The Posts Dan Zak, Sondland acknowledged he didnt come off so well to the public.",
    "At 3 p.m. weekdays, return to this space and well address whats on the mind of readers.",
    "Among the things well be watching: What, if anything, Trump has to say about abortion.",
    "In 13 of those states, women would lose access to abortion immediately and outright.",
    "Does this issue carry more weight than voting [rights]?? Clyburn said of abortion.",
    "Fridays rally follows the victory Tuesday in the Ohio GOP Senate primary of J.D.",
    "She is now a co-chair of the Democratic nonprofit American Bridge 21st Century.",
    "In March, he visited Rzeszow, Poland, about 60 miles from the Ukrainian border.",
    "How dare they tell a woman what she can do and cannot do with her own body!",
    "House Speaker Nancy Pelosi (D-Calif.) took a step Friday to address that.",
    "Why is this important?? Sen. Patty Murray (D-Wash.) said in an interview.",
    "They are seeking to succeed retiring Sen. Patrick J. Toomey (R-Pa.).",
    "Sondland, it should be noted, has a new book due out in October.",
    "But at the same time, its important to set the record straight.",
    "The current maximum pay for House staffers is $199,300.",
    " an abortion opponent  is continuing to draw scrutiny.",
    "Voters are confused, which helps Democrats right now.",
    "You can read the full interview with Richards here.",
    "And that goes for politicians from both parties.",
    "The forecast calls for rain for much of the day.",
    "But were voters paying attention?",
    "Got a question about politics?",
    "It seems certain to fail.",
    "Where do people stand?",
    "I dont think so.",
    "Submit it here.",
    "No, not really."
  ]
}