{
  "id": 5680,
  "mediaId": 169,
  "date": "d2022-05-06T06:31",
  "headline": "You laughed at Trump for screwing up J.D. Vance's name. Did that save Roe v. Wade?",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/05/donald-trump-0505221.jpg",
  "link": "https://www.salon.com/2022/05/06/you-laughed-at-for-screwing-up-jd-vances-name-did-that-save-roe-v-wade/",
  "sentiment": "-0.743",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chauncey DeVega",
  "authorUrl": "https://www.salon.com/writer/chauncey_de_vega",
  "termIds": [
    946,
    1147,
    1801,
    3103,
    146,
    428,
    571,
    2710,
    2816,
    2945
  ],
  "sentences": [
    "That failure would loom large 24 hours later with the revelation that a Supreme Court majority  including the three justices appointed by Trump  was prepared to overturn the 1973 Roe v. Wade decision..\nTrump's endorsement of Charles Herbster, who has been accused of groping several women, is more than a punchline: It speaks to the psychological dynamic of fascism.",
    "The historic reversal of Roe v. Wade is one more step in the neofascist anti-democratic revolutionary project, in which the rights of women, Black and brown people, gays and lesbians, immigrants, people with disabilities and others deemed to not be \"real Americans\" will be severely curtailed if not eliminated.",
    "Herbster's campaign manager claimed the accusations are the work of a \"political establishment\" that is \"smearing and trying to destroy\" him with lies, and were supposedly coordinated in part by current Nebraska governor Pete Ricketts, whom Herbster's campaign has suggested wants to take him down.",
    "Such behavior continues a larger pattern of defensive contempt where for many people it is easier to laugh at Donald Trump, his followers and the larger fascist movement than to confront all of the harm they have done  and will do in the future  to American democracy and society.",
    "The basic premise of a humane and truly democratic and pluralistic society  that women should be equal to men in all political, social and economic realms of life and society  is anathema to the fascist project, and to many \"conservatives\" and \"traditionalists\" more broadly.",
    "To that end, political scientists and other experts have repeatedly shown that what is known as \"hostile sexism\" and a desire to return to \"traditional values\" plays a critical role in support for Donald Trump, the American neofascists and the larger global right.",
    "He largely stuck with his greatest hits: Lying about the results of the 2020 election, endlessly repeating the Big Lie, and claiming that the Democrats are enemies of the country  with all the implied or actual threats of violence that come with such assertions.",
    "Six women told the Nebraska Examiner that Herbster had \"touched them inappropriately when they were saying hello or goodbye to him, or when they were posing for a photograph by his side,\" while another woman said Herbster had forcibly kissed her in private.",
    "Politico reports that after being informed of the allegations, Trump insisted Herbster needed to fight back harder and \"back[ed] plans for [the candidate] to hold a press conference aggressively denying the allegations and pushing back at his adversaries.\"",
    "Instead of engaging in obsessive, infantile and distracting discussions about Donald Trump's inability to get an acolyte's name right, the mainstream news media and the high priests of the commentariat should focus on Donald Trump the political criminal.",
    "The power to hurt or subjugate other people  what social psychologists describe as \"social dominance behavior\"  is a principal reason why certain people are attracted to fascism and other anti-human and antisocial political movements and beliefs.",
    "The two men would seem to have a natural affinity: Herbster has been credibly accused of groping eight women, which admittedly makes him only a journeyman compared to Donald Trump, who has been accused of sexual assault by dozens of women.",
    "Herbster also reportedly retained the services of a law firm Trump has used to defend himself, and has filed a lawsuit against state senator Julie Slama, who alleged Herbster put his hand up her skirt without her consent, for defamation.",
    "The yearning for \"tradition,\" a return to a \"golden age\" and the \"traditional family\" translates in a quotidian way into women (along with LGBTQ people, nonwhites and other marginalized groups) \"knowing their place.\"",
    "Women by the hundreds of thousands, likely the millions, will see their lives changed and their futures reshaped because they will be denied access to legal and safe abortions and other reproductive health services.",
    "He committed multiple offenses against American democracy, including a coup attempt, and is continuing to plot his return to office through any means necessary, including political violence and terrorism.",
    "As it has consistently done for at least the last seven years, the mainstream news media refuses to understand the real power and appeal of Trump and Trumpism, which is far greater than any one person.",
    "In just one area of his life, the profoundly untrustworthy Donald Trump has been true to his word: He kept his bargain with the Christian fascists, giving them right-wing judges in exchange for votes.",
    "In that one area of his life, Donald Trump, a profoundly untrustworthy man, was true to his word: He kept his bargain with the Christian fascists, giving them right-wing judges in exchange for votes.",
    "In keeping with the larger pattern I have already referenced, the mainstream news media declined to help the American people understand the meaning and context behind Trump's endorsement of Herbster.",
    "Throughout his presidency, and well before that, Donald Trump has repeatedly made those kinds of errors  forgetting people's names or basic facts, and frequently appearing incoherent or confused.",
    "When Roe v. Wade is overturned, Trump's Supreme Court appointees will have fulfilled their primary mission as emissaries of the Christian fascist movement and door-kickers for American theocracy.",
    "As with other cult movements, Donald Trump the human being is secondary to the idea of Trump as a virile, masculine, immortal, all-knowing, all-powerful and godlike leader for the MAGA faithful.",
    "One day after Trump's rally in Nebraska, Politico reported that the Supreme Court has already decided to reverse Roe v. Wade, ending women's right to reproductive freedom and bodily autonomy.",
    "At Vanity Fair, Bess Levin writes:\n[I]n a turn of events that should shock literally no one, the former president has not only stood by the guy, but doubled down in his support of him.",
    "...\nHerbster sang Trump's praises in an interview with Politico, calling him \"a man of his word\" for not ditching the Nebraskan even in light of the many sexual assault allegations.",
    "Instead of consistently sounding the alarm, America's mainstream news media and the larger political class insist on depicting him as a buffoon, a dotard or a harmless curiosity.",
    "They are a means to an end: In this case, ego gratification, fundraising and Trump's project to retake the White House and consolidate the MAGA movement's power over America.",
    "Last Sunday, Donald Trump held another of his political rallies (or freak shows, or cult gatherings depending on one's preferred language), this time in Greenwood, Nebraska.",
    "Such bodies, people and groups are to be \"disciplined,\" and used for the pleasure and at the whims of the in-group, the powerful, the MAGA-elect and other \"real Americans.\"",
    "During his speech in Nebraska, Trump joked about the \"N-word,\" titillating his followers by alluding to the familiar racial slur used against Black people:\nThe N-word.",
    "During his term in office, too many people continued to laugh at Trump as he and his Republican-fascist movement began to demolish American democracy in earnest.",
    "(In response, Ricketts told Politico that it was \"ridiculous to think that somebody could coordinate eight different people to talk to a reporter about this.\")",
    "There is another basic fact largely ignored by the news media and the chattering classes: Donald Trump is such a narcissist that he does not care about J.D.",
    "Vance's name became the shiny object of the day  but Trumpism is bigger than any one person, and besides that, his cult members and followers do not care.",
    "Too many Americans continued to laugh at Trump as he plotted and carried out a coup attempt in January of 2021, which came perilously close to succeeding.",
    "Unfortunately, it appears that the Democratic leadership have largely forgotten the 6-P principle: Proper Preparation Prevents Piss-Poor Performance.",
    "The decision to take away the rights previously guaranteed by Roe V. Wade is not the end of an American nightmare but just an opening chapter in it.",
    "While the mainstream American news media has largely decided to ignore these rallies, Trump's mishandling of Vance's name captured their attention.",
    "But as we found out the very next day, the hilarity turned sour and empty, like the shrill laughter of a condemned man looking up at the gallows.",
    "In all fascism draws it power from the loins and the fists, the irrational heart and the deep subconscious; it is primal, if not primordial.",
    "At the core of the authoritarian impulse is a need to control the bodies of women, and those of other groups deemed to be inferior.",
    "In the Republican-fascist-conservative-authoritarian imaginary, women are deemed to be a type of chattel and the property of men.",
    "In the long battle to save American democracy from the neofascist movement, underestimating the enemy is a grave miscalculation.",
    "But that, of course, is a more difficult and troubling story than Donald Trump's all-too-human failures of speech and memory.",
    "At this point, if Donald Trump literally disappeared tomorrow the MAGA neofascist movement would continue on without him.",
    "Read more on our 45th president and his enduring \"movement\":\nChauncey DeVega is a senior politics writer for Salon.",
    "During Tuesday's Republican primaries in Ohio and Indiana, all of Trump's endorsed candidates  all 22 of them  won.",
    "That is the single biggest reason why white Christian evangelicals remain loyal to such a profane and unholy man.",
    "It embraces, encourages and endorses violence and views compromise, intellect and reason as \"feminine\" weakness.",
    "In essence, the Republican-controlled Supreme Court is now willing to endorse forced pregnancy and childbirth.",
    "As such, Trump's admittedly ambiguous mental health has been the subject of public discussion for some time.",
    "For the fascist, care, concern and empathy are signs of weakness and vulnerability, to be erased or denied.",
    "The Democrats and America's other pro-democracy forces should prepare for the worst and plan accordingly.",
    "It is \"masculine\" in the most crude, negative, regressive, destructive and dangerous sense of that word.",
    "The Republicans will in all likelihood win control of the House in November, and perhaps the Senate.",
    "This is not \"doom porn,\" as some nave optimists and hope-peddlers might claim: It is the raw truth.",
    "That became the schadenfreude distraction or shiny Trump object of the day for the 24/7 news cycle.",
    "MORE FROM Chauncey DeVega  FOLLOW chaunceydevega  LIKE Chauncey DeVega\nTrending Articles from Salon",
    "During his speech in Nebraska, Trump endorsed Republican gubernatorial candidate Charles Herbster.",
    "\"It's easy to be someone's friend and be around someone when something's perfect,\" Herbster said.",
    "At this point, there can be no lingering doubt about whether Donald Trump is a white supremacist.",
    "And of course, Trump sucked up as much narcissistic fuel as possible from his adoring fans.",
    "The Republican Party remains firmly under Trump's control and the MAGA cult remains intact.",
    "During his speech Donald Trump would also appear to forget Senate Republican candidate J.D.",
    "What good did it do you in the struggle to protect American democracy from final collapse?",
    "In this cosmology, women's bodies are viewed as walking wombs and human pleasure robots.",
    "Too many people laughed at Donald Trump  and then he won the 2016 presidential election.",
    "\"But when something is imperfect, many people  flee, and he's not that type of person.\"",
    "On Twitter and elsewhere, Trump was endlessly mocked for apparently forgetting J.D.",
    "It's important to grasp that his cult members and followers simply do not care.",
    "He's throwing it around all the time because he doesn't respect our leadership.",
    "[Josh Mandel was another Republican in that race, whom Trump did not endorse.]",
    "There was much speculation about Trump's mental health and \"obvious\" decline.",
    "In all, Donald Trump remains the most dangerous person in the United States.",
    "Whatever they make of his personal morality, Trump is a tool of their God.",
    "I just spent, so many people backstage, \"Thank you, sir, for being here.\"",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Donald Trump's odds of winning the White House in 2024 are increasing.",
    "The Republican Party and the larger white right mostly does not care.",
    "The right-wing disinformation machine and echo chamber does not care.",
    "Will he use his health as an excuse to not run for president in 2024?",
    "It would have been easier if I would have said I'm not going to come.",
    "In his speech, Trump had this to say about Herbster:\nGood man.",
    "Vance or anyone else he has endorsed (or inveighed against).",
    "Indeed, those values and behavior are central to his appeal.",
    "He also hosts a weekly podcast, The Chauncey DeVega Show.",
    "MAGA is a movement and an idea; it is power in action.",
    "I come out, I defend people when I know they're good.",
    "His essays can also be found at Chaunceydevega.com.",
    "Too many people laughed at Trump for fumbling J.D.",
    "Subscribe to our morning newsletter, Crash Course.",
    "Chauncey can be followed on Twitter and Facebook.",
    "I've used the word, I used the term the N-word.",
    "Vance's name, instead referring to him as \"J.D.",
    "He's the last person to do any of this stuff.",
    "And even the stuff they're accusing him of.",
    "He's been badly maligned, and it's a shame.",
    "Such laughter may feel good in the moment.",
    "I have to defend people that are good.",
    "It's too devastating to talk about it.",
    "You don't talk about the nuclear word.",
    "Trump's befuddled mishandling of J.D.",
    "Fascism thrives on oppressing others.",
    "Fascism is an anti-human philosophy.",
    "The fascist tide is rising unabated.",
    "He's the most innocent human being.",
    "(Slama filed a countersuit Monday.)",
    "It's a disgrace what they've done.",
    "He was with us from the beginning.",
    "He's been my friend for 30 years.",
    "The Trump train keeps on rolling.",
    "I said, \"Yeah, the nuclear word.\"",
    "Let's talk about the laughter.",
    "You just don't talk about it.",
    "I have to defend my friends.",
    "And that's why I'm with you.",
    "That's why I came out here.",
    "Trump's war chest is huge.",
    "Does that seem funny now?",
    "He talked to somebody?",
    "Does he have dementia?",
    "He said the N-word.",
    "He's been maligned.",
    "He's been maligned.",
    "It channels death.",
    "It's a disgrace.",
    "What'd they say?",
    "He's a good man.",
    "They went crazy.",
    "I get nothing.",
    "Vance's name.",
    "Vance's name.",
    "Is he senile?",
    "He talked.",
    "Mandel.\""
  ]
}