{
  "id": 5688,
  "mediaId": 19,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Turning Point USA Establishes Super PAC to Aggressively Promote America First Movement",
  "image": "https://media.breitbart.com/media/2021/12/Lead-Photo-TPUSA-Charlie-Kirk-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/06/turning-point-usa-establishes-super-pac-to-aggressively-promote-america-first-movement/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    652,
    1925,
    2006,
    3103,
    122,
    3593,
    2845,
    2932
  ],
  "sentences": [
    "Turning Point Pac will issue endorsements of candidates on the local and national level who fit their criteria in seven major policy areas, including election integrity, school choice and parental rights, big tech censorship, onshoring of American jobs, border security, pro-life issues, and gun rights.",
    "Turning Point PAC will aggressively fight back against the influences of Big Tech, woke corporations, the trans agenda, CRT ideologues, the teachers unions, and open-borders lobbyists that have too-often reduced the GOP to a party of controlled opposition.",
    "Turning Point PAC has been created to fix that problem.?\nWe will work to elect candidates who will courageously defend the values of grassroots voters, and we will work to replace the frauds who consistently betray us,? Kirk added.",
    "According to a press release:\nTPPAC plans to harness the power of the America First movement to identifying conservative candidates that are willing to unapologetically fight for the interests of the American people.",
    "Kirks TPPAC will work closely with sister organization Turning Point Action to recruit young millennial and Gen Z political newcomers and help rising-star? candidates who are at the grassroots local level.",
    "TPPAC intends to develop candidates to combat the consultant class and the globalist chamber of commerce establishment that has taken advantage of conservatives for too long.",
    "Turning Point USA recently established its political action committee, Turning Point PAC (TPPAC), to aggressively fight back? against anti-American ideologies.",
    "Turning Point PAC has an unprecedented opportunity to tip the ideological balance of the conservative movement,? Turning Point PAC Founder Charlie Kirk said.",
    "Ron Johnson (R-WI), Mike Lee (R-UT), and Reps. Madison Cawthron (R-NC), Marjorie Taylor Greene (R-GA), and Matt Gaetz (R-FL).",
    "TPPAC will deploy its multi-million dollar war chest? ahead of the 2022 midterms to support the candidates it endorses.",
    "So far, TPPAC has endorsed over thirty candidates, including incumbents and newcomers like Ohios J.D.",
    "Conservatives often wonder why their elected officials stab them in the back once they take office.",
    "Vance, Tennessee congressional hopeful Robby Starbuck, Washingtons Joe Kent, Sens."
  ]
}