{
  "id": 5690,
  "mediaId": 157,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "MAGA boos Dr. Oz as rain turns Trump rally into muddy mess",
  "image": "https://www.rawstory.com/media-library/trump-jinxed-the-launch-president-slammed-for-bringing-bad-luck-to-spacex.jpg?id=24733831&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/maga-boos-dr-oz-trump-rally/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    3103
  ],
  "sentences": [
    "Vance, the Trump-backed Senate candidate who just won a hard-fought GOP primary in Ohio; election conspiracist and My Pillow CEO Mike Lindell; and Dinesh DSouza, who just released a new movie claiming massive wrongdoing in the 2020 presidential election, despite numerous independent reviews that have affirmed the legitimacy of the results,\" Jonathan Tamari reported for The Philadelphia Inquirer.",
    "A soggy setting for Trumps rally in Greensburg Pa tonight >>> \\n(Insert Swamp joke here)https://twitter.com/sbcmw/status/1522678648767238156\\u00a0\\u2026\n Jonathan Tamari (@Jonathan Tamari) 1651871314\nThe weather wasn't the only problem for Trump, his audience didn't seem content with the endorsement of Dr. Oz.",
    "Four are anti-Oz (2 for Barnette, 2 undecided)\"\nFormer federal prosecutor Ron Filipkowski reported, \"every time Ozs face comes on the screen the crowd at the Trump rally boos.\"",
    "On Twitter, Tamari described it as a \"soggy setting\" with a link to photos taken by his colleague Sean Walsh, who warned it is \"gonna be a messy one.\"",
    "\"Ive interviewed 6 attendees at the Trump-Oz rally so far, and it is striking how little support there is for Oz,\" Walsh reported.\"",
    "Donald Trump was set to rally for Dr. Mehmet Oz Friday evening, ahead of Pennsylvania's May 17 Republican primary for U.S. Senate.",
    "HuffPost correspondent Daniel Marans reported, \"I have yet to meet anyone here who is a firm supporter of Dr. Oz.",
    "The weather was not cooperating with the plans, as rain turned the Westmoreland Fairgrounds into a muddy mess.",
    "Posobiec also drew attention to a straw poll being conducted at the rally asking, \"Is Dr. Oz America first?\"",
    "\"New precipitation amounts between a half and three-quarters of an inch possible,\" it warned.",
    "In fact, theres a whole section of people that boos every time he appears on screen.\"",
    "The National Weather Service forecast for the evening is a 100% chance of rain.",
    "The poll had five \"yes\" votes, fifteen \"no\" votes, and three \"f*ck no\" votes.",
    "\"The event will be packed with celebrities of the right, including J.D.",
    "One said shell vote for Oz (was planning to before Trump endorsed).",
    "Filipkowski wasn't the only person to notice the dynamic.",
    "Far-right activist Jack Posobiec also noted the booing.",
    "One said he doesnt trust Oz, but will hear Trump out."
  ]
}