{
  "id": 5696,
  "mediaId": 129,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Dr. Oz rallies with Trump and Vance on a rainy night in Pennsylvania, and meets a damp reception.",
  "image": "https://static01.nyt.com/images/2022/05/06/us/06midterms-penna-trump-vance/06midterms-penna-trump-vance-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.onenewspage.com/news.php?nid=131356233-159",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1653,
    1801,
    2087,
    2491,
    3103,
    4658,
    571,
    2845,
    2862,
    5064
  ],
  "sentences": [
    "I dont know that I can trust him,? said Robin McDougal, an occupational therapist from Moon Township, Pa. I like that Trump is endorsing him because I trust Trump  but Ill tell you the truth, it took me eight years to come to like Trump,? said Ms. McDougal, who said she voted for Hillary Clinton in 2016.",
    "Hes in the bedrooms of all those women telling them good and bad.?\nMr. Trumps visit to Pennsylvania, a state where his re-election ambitions crumbled in 2020, came days after a leaked draft ruling from the Supreme Court signaled that it could strike down the landmark Roe v. Wade case.",
    "Vance and Dr. Mehmet Oz rallied on Friday night in Pennsylvania with former President Donald J. Trump, seeking to replicate the endorsement boost that lifted Mr. Vance to a primary victory in Ohio  but enthusiasm for the celebrity doctor was middling at a wet and muddy rally.",
    "nomination in another Northern industrial state, Mr. Trump descended on western Pennsylvania to campaign in a rainstorm for a slate of MAGA candidates led by Dr. Oz, one of the front-runners in a race that could determine control of the Senate.",
    "I value it.?\nIn his speech, Mr. Trump aired a fresh round of grievances about the 2020 election and taunts for his political enemies, directing several at Dr. Ozs chief rival in the Senate race, the former hedge fund executive David McCormick.",
    "Dr. Oz, 61, presented himself as an early accepter of medical therapies promoted by Mr. Trump for the treatment of Covid-19, several of which were discredited by medical authorities as lacking efficacy and fraught with potential risk.",
    "And because they hated him so much, they were rooting against America in order to hurt him.?\nMr. Trump said that Dr. Oz, like Mr. Vance in Ohio, had been the victim of an onslaught of expensive television attack ads by his opponents.",
    "nomination  after the former president endorsed him last month, accused those whom he characterized as establishment Republicans of being feeble in their opposition to the Democrats agenda.",
    "She said she supported Dr. Oz because of his position on Covid, and because hes pro-life.? It did not bother her that he had only recently adopted a firm anti-abortion stance.",
    "Mr. Majewski has drawn attention for traveling to Washington on Jan. 6, 2021, though he told a right-wing radio host in January that he did not participate in the violence.",
    "But Mr. Trump never referred to abortion, exemplifying how many Republican leaders have been quiet on the issue for fear of repercussions in the midterm elections.",
    "A Modern-Day Party Boss: Hoarding cash, doling out favors and seeking to crush rivals, Mr. Trump is behaving like the head of a 19th-century political machine.",
    "He has also expressed sympathy for believers of the QAnon conspiracy theory movement and floated doubts that the Capitol riot was driven by Trump supporters.",
    "When Guy Reschenthaler, the Republican congressman who represents Greensburg, announced his own endorsement of Dr. Oz, a large segment of the crowd booed.",
    "There is a war for the soul of the Republican Party,? said Mr. Vance, whose reception at the rally appeared to be more energetic than that for Dr. Oz.",
    "Even with Mr. Trumps endorsement, the reception for Dr. Oz was mixed, and boos had erupted earlier in the rally when the doctors name was mentioned.",
    "Along with Mr. Vance, Mr. Trump praised J.R. Majewski, the surprise winner of a Republican House primary election on Tuesday in northern Ohio.",
    "Just the Beginning: For many Trump supporters who marched on Jan. 6, the day was not a disgraced insurrection but the start of a movement.",
    "The former presidents other targets included the actor Alec Baldwin; Mitch McConnell, the Senate Republican leader; and President Biden.",
    "But Ms. McDougal allowed that she had perhaps been swayed by the negative ads that have blanketed the state throughout the primary.",
    "The Senate candidate sought to burnish his Trump bona fides ahead of the May 17 primary, and the former president vouched for him.",
    "Power Struggle: Led by Senator Mitch McConnell, a band of anti-Trump Republicans is maneuvering to thwart the ex-president.",
    "His show is great,? Mr. Trump said in his hourlong speech at the rally in Greensburg, southeast of Pittsburgh.",
    "The rest were nearly evenly divided between disliking him and saying they knew little about his candidacy.",
    "When an ad for Dr. Oz that attacked Mr. McCormick was played earlier in the event, there were more boos.",
    "Post-Presidency Profits: Mr. Trump is melding business with politics, capitalizing for personal gain.",
    "Mr. Vance, 37, a Trump convert who catapulted to a lead in the polls in Ohio  and to the G.O.P.",
    "Hes not MAGA,? Mr. Trump said, referring to Mr. McCormick as a liberal Wall Street Republican.",
    "Out of 20 rally attendees asked for their opinions on Dr. Oz, two said they supported him.",
    "The skepticism of the Trump faithful toward Dr. Oz was palpable at the Pennsylvania rally.",
    "When President Trump would talk about these treatments, the press hated it,? Dr. Oz said.",
    "Mr. Trump played a video of Mr. Bidens verbal miscues on several large screens.",
    "Is some of it true??\nTeri Flati, Ms. McDougals sister, was a bigger fan.",
    "Dr. Oz mentioned the issue briefly, saying: Life starts at conception.",
    ": Mr. Trump remains the most powerful figure in the Republican Party.",
    "I hear the stuff in the attack ads  is none of it true?",
    "Three days after helping Mr. Vance capture the G.O.P.",
    "However, there are signs his control is loosening.",
    "How Donald J. Trump Still Looms\nGrip on G.O.P.",
    "The Republican Senate candidates J.D.",
    "Hes on that screen.",
    "Im a heart surgeon."
  ]
}