{
  "id": 5702,
  "mediaId": 238,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Opinion Ohios U.S. Senate race pits a fake populist against a real one",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/04/ohio-senate-contest-democrat-tim-ryan-uphill-battle/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "E.J. Dionne Jr.",
  "authorUrl": "https://www.washingtonpost.com/people/ej-dionne-jr/",
  "termIds": [
    781,
    1147,
    1801,
    2027,
    3103,
    428,
    571,
    2623,
    2845,
    5102
  ],
  "sentences": [
    "Theyre talking about: How do we get investment in our communities? How do we get broadband in our communities? How do we get jobs in our communities??\nSo, if you walk into Gallipolis or Steubenville or Portsmouth and youre only talking about  defunding the police and critical race theory  you get laughed out of the room.? Voters, Ryan said, conclude that this person does not understand how stressed out I am.?\nAs for Vance, his victory has been widely, and correctly, interpreted as a big win for Trump.",
    "Ryan sees Dolan voters as ready to cross over to him: Republicans who dont want anything to do with the whole craziness thats going on.? After Dolans defeat Tuesday night, Ryan said, My phone was ringing off the hook? with Republicans here in Ohio who want to help  businesspeople and all the rest because they dont want to go down this road of  undermining democracy.?\nSuch voters, Ryan argues, would also recoil from a Supreme Court decision overturning Roe v. Wade.",
    "In an interview on Wednesday, Ryan previewed his approach, calling Vance a candidate who will do and say anything he needs to do to gain power,? has flip-flopped all over the place on Trump and every other issue,? has no core convictions,? is not interested in helping working-class people? and has said that quite clearly he thinks Americas a joke.?\nOnce-swingy Ohio has given Democrats nightmares in recent years.",
    "Ryan, who shifted in 2015 from opposition to support for abortion rights, predicts that women and suburban Republicans who are very, very concerned? about Roe will find Vances past statements extreme.? Among them: Vance has argued against exceptions for rape and incest in abortion bans.",
    "Vance, a pro-Trump turncoat best known for his book, Hillbilly Elegy.? Vance preaches cultural populism as a former corporate lawyer and venture capitalist whose old boss, pro-Trump billionaire Peter Thiel, advanced $15 million to boost this supposed tribune of the people.",
    "But if Democrats hope to expand their political map, they would be foolish to ignore a state where Trump has placed himself squarely on Novembers ballot with his embrace of Vance  and where their nominee is willing to trust his fate to working-class voters of all races.",
    "Although Ryan got about 15,000 more votes on Tuesday than Vance did, its a measure of the challenge facing Democrats that turnout in the far more contested GOP primaries was roughly double Democratic turnout  a far bigger gap than in the 2018 primaries.",
    "Never mind that Vance had to atone for past declarations that Trump was reprehensible? and cultural heroin.? If Trump is now the political drug of choice among Republican primary voters, Vance proved himself happy to share in the habit.",
    "But Ryan sings from the populist, tough-on-trade, pro-union songbook written by that Democrat, Sen. Sherrod Brown, who has prevailed in contest after contest, most recently in 2018.\nI went to all 88 counties,? Ryan told me.",
    "It will also gauge whether a steadfastly pro-labor Democrat who speaks often and proudly of the working class? can push aside Republican culture-war extremism and encourage voters to cast ballots on their economic future.",
    "Highlighting the divide between Republicans in big metro areas and those from small-town and rural Ohio, Dolan ran first in the Cleveland and Columbus areas and just behind Vance in Hamilton County, home of Cincinnati.",
    "Rob Portman (R) is poised to measure whether a Republican who prostrates himself before Donald Trump by repudiating his sharp criticisms of the former president can convince a majority of his authenticity.",
    "State Sen. Matt Dolan rose from single digits in early April to win 23 percent of the vote and finish a strong third, behind Vance and former state treasurer Josh Mandel.",
    "Ohio voters have set up a U.S. Senate race that will test what happens when a real economic populist runs against a fake one in an increasingly red state.",
    "Rep. Tim Ryan, who won the Democratic nomination in a landslide on Tuesday, is certainly the underdog in a state that Trump twice carried comfortably.",
    "Dolan became the voice of non-Trump and anti-Trump Republicans by speaking out against Trumps election denial nonsense.",
    "While Barack Obama carried it in 2008 and 2012, only one Democrat has won a non-judicial statewide race since 2008.",
    "Vance was running behind multiple GOP competitors before Trump belatedly embraced him.",
    "He believes he can bring many of them back to the party they once called home.",
    "People there arent talking a lot about, you know, critical race theory.",
    "But Ryan is relishing a battle against Republican J.D.",
    "But another Republican also surged late.",
    "The contest to replace retiring Sen."
  ]
}