{
  "id": 5703,
  "mediaId": 65,
  "date": "d2022-05-05T20:28",
  "headline": "Democrat Tim Ryan's Ohio Senate campaign doesn't want disgraced Lincoln Project's help: 'Pls no'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/d77a1f40-1c06-46ff-b343-c1df1a36b82c/9411109c-d6a6-4a89-9cad-aa144d025fac/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/democrat-tim-ryans-ohio-senate-campaign-lincoln-project",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nikolas Lanum",
  "authorUrl": "https://www.foxnews.com/person/l/nikolas-lanum",
  "termIds": [
    781,
    1615,
    1801,
    3103,
    4735,
    146,
    380,
    428,
    515,
    571,
    2845
  ],
  "sentences": [
    "THE LINCOLN PROJECT ROASTED AS DERANGED HACKS FOR ORCHESTRATING VIRAL HOAX TO SMEAR YOUNGKIN\nIn its largest contribution, The Lincoln Project spent nearly $4.3 million in an attempt to unseat Republican Alaska Sen. Dan Sullivan.",
    "Founded by disgruntled former and anti-Trump Republicans, the left-wing political action committee has been rocked by scandals and embarrassment for the past year, as well as support for failed Democratic candidates.",
    "In one of its more recent forays into political campaigns, the group admitted it was behind a stunt that attempted to link Virginia Republican gubernatorial candidate Glenn Youngkin to Tiki-torch carrying racists.",
    "CLICK HERE TO GET THE FOX NEWS APP\nThe 19th reported several of the group's higher-ups knew of the allegations as early as March 2020, and still wanted to partner with Weaver on a joint media venture afterwards.",
    "The group was also panned for publishing the private messages of co-founder Jennifer Horn and a reporter investigating the group, and it has also faced reports of self-dealing and a toxic work environment.",
    "It was quickly discovered that these were not White supremacists at all, but rather people hired by The Lincoln Project to stand outside of one of Youngkins campaign stops and smear his supporters.",
    "Last year, it was revealed another co-founder John Weaver, had harassed dozens of men online, dangling employment opportunities and social media clout in exchange for suggested sexual favors.",
    "Twitter users seemed amused that the communications director for a prominent Democrat had attempted to maintain the distance between her candidates campaign and the disgraced PAC.",
    "The race hoax was widely panned on both sides of the political aisle, including the campaign of Democrat Terry McAuliffe and Lincoln Project co-founder Steve Schmidt.",
    "In races where the most money was spent, the PACs favored candidates lost by significant margins, according to the Federal Election Commission.",
    "Vance as one of the \"top races critical to American democracy's survival,\" Ryan's communications director simply tweeted, \"Pls no.\"",
    "Responding to news that the Lincoln Project has marked this year's Senate race between Democrat Tim Ryan and Republican J.D.",
    "So Ohio's Democratic U.S. Senate candidate appears to want nothing to do with the disgraced organization.",
    "The Lincoln Project's last foray into a closely watched statewide election was a debacle.",
    "Enjoy it!,\" The Spectator contributing editor Stephen L. Miller reacted.",
    "\"HELP IS ON THE WAY, @TimRyan,\" added Twitchy editor Greg Pollowitz.",
    "Ryan's campaign didn't respond to a request for comment.",
    "In 2020, the group spent six figures on 10 Senate races.",
    "The next week, Youngkin won the hotly contested race.",
    "Fox News' David Rutz contributed to this report.",
    "He won the race by more than 12 points.",
    "\"They're your problem now."
  ]
}