{
  "id": 5712,
  "mediaId": 238,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Opinion Why a secretive tech billionaire is bankrolling J.D. Vance",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/05/peter-thiel-bankrolling-jd-vance-reactionary-nationalism/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "Writer John Ganz suggests that this sort of reactionary tech-utopianism posits a world entirely beyond politics and the messy proceduralism and contestation it requires, replaced by one in which the benevolent (or not) entrepreneurial genius sets the tone from above:\nIn short, its a model of the kind of corporate society they wish to secure and reproduce on a larger scale: big bosses, middle-management, workers, all happily coordinated and cooperating.",
    "Hysterical anti-nationalists aim to suppress dissent from that view, in service of their goal of what Thiel calls globalist totalitarianism.?\nIn reality, many mainstream liberal democratic thinkers who worry about nationalisms well-documented destructive tendencies do agree that the nation-state should and will remain the primary vehicle for political self-determination.",
    "Indeed, Thiel is something of a hater of liberal democracy: He has written that freedom and democracy are not compatible,? and that politics is inevitably about interfering with other peoples lives without their consent.?\nThis disdain for democracy and politics is central to Thiels worldview, according to journalist Max Chafkin, the author of a Thiel biography.",
    "In a speech last year, Thiel hailed nationalism as a corrective? to globalizations failures, while also absurdly suggesting critics of nationalism secretly want to impose a brain-dead, one-world state.?\nWhat makes Thiel complicated is that hes also seemingly a radical libertarian.",
    "Whether you think democracy itself is illegitimate (as Thiel seems to) or that our institutions are so corrupted that emergency measures are required (as Vance does), its a short step to believing electoral losses can be treated as inherently illegitimate and nonbinding.",
    "As Chafkin notes, Thiel seems to see the individual entrepreneur and capitalist, and his capacity for innovation, as the potential long-term savior of humankind, provided he is not constrained by politics, government or mob groupthink.",
    "But those thinkers also think that, given the global nature of the long-term problems humanity faces, international institutions and multilateral cooperation will have to play an essential role in securing future human progress.",
    "Vance appeared on Carlsons show 15 times, according to Media Matters: The combined cash and airtime helped enable Vance to withstand a barrage of negative ads from rivals funded by traditional GOP-aligned plutocratic interests.",
    "Thiels involvement has unleashed much snickering about the absurdity of Vance, the self-styled scourge of globalist elites and Big Tech, being backed by an obscenely wealthy venture capitalist and globetrotting tech oligarch.",
    "Chafkin says Thiel might be defined as a reactionary capitalist.?\nThe overlap might lie in the belief that our institutions, particularly our political and governing institutions, are irredeemably corrupt to their very core.",
    "And this sheds light on the broader political project that Vance and some of his right-wing nationalist fellow travelers are pursuing  revealing something thats much uglier than even the mockery suggests.",
    "I do not know whether Thiel has explained anywhere how we can have nations without politics and without governments chosen in elections that the national populace fundamentally accepts as legitimate.",
    "Vance recently told Vanity Fair that these institutions are on the verge of total collapse and should be purged of all liberal elements in a de-Baathification program.?\nThe synergy is plain.",
    "No unions, no pesky social movements, no restive professional managerial-classes with their moral pretensions, no federal bureaucracy meddling and gumming up the works with regulations.",
    "In an interview, Chafkin characterized Thiels views this way: If we just got out of the way and let our civilization be run by people like him, the world would be a better place.\"",
    "Similarly, becoming a full-fledged MAGA candidate required Vance to migrate from affirming the integrity of our elections to declaring the 2020 outcome corrupt and rigged.",
    "Its the nationalists who truly value individual self-determination, because the nation is the primary protector of individual freedom and self-determination.",
    "Thiel bankrolled a pro-Vance super PAC with $15 million and brokered a meeting with Donald Trump that helped secure his endorsement, which proved decisive.",
    "Vance has won the GOP nomination for Senate in Ohio, heightened scrutiny will fall on his chief financial backer, billionaire tech investor Peter Thiel.",
    "Another possibility, of course, is that Thiel genuinely believes popular majorities will simply have to be overridden in the future.",
    "Small wonder, then, that many candidates Thiel has endorsed have pledged fealty to this notion, via loyalty to Trumps 2020 lies.",
    "Hes backing well over a dozen Senate and House candidates, many of whom have embraced Trumps lies about the 2020 election.",
    "Vance has suggested that Trump providentially led him to grasp this truth, almost as divine inspiration.",
    "Thiel agrees with Vances preoccupations about things such as mass immigration and globalization.",
    "Taken together, a sympathetic reading of Thiels views might look something like this.",
    "But in reality, the politics of Vance and Thiel overlap in a discernible fashion.",
    "The New York Times has new reporting on Thiels importance to Vances victory.",
    "Wed still have politics and government, but dictated by minority rule.",
    "But perhaps hell figure that one out when Vance gets to the Senate.",
    "Thiels support interlocked with Tucker Carlsons Fox News megaphone.",
    "Thiel has emerged as a major financial backer of the MAGA movement.",
    "How to square Thiels libertarianism with his nationalism?",
    "What does Thiel envision in place of liberal democracy?",
    "Thiel apparently has little time for such nuances.",
    "That does seem bizarrely incongruent.",
    "Now that J.D."
  ]
}