{
  "id": 5713,
  "mediaId": 195,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "The big story from Ohio is not about Donald Trumps power",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/trumpdonald_vancejd_050222ap-joe-maiorana_split_ohio-gop.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/opinion/campaign/3478156-the-big-story-from-ohio-is-not-about-donald-trumps-power/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin R. Kosar",
  "authorUrl": "",
  "termIds": [
    946,
    1147,
    1365,
    1801,
    2283,
    2524,
    3103,
    4163,
    296,
    571,
    2845
  ],
  "sentences": [
    "My Mom is a Democrat but I think that shes going to request a Republican ballot so she can vote for me, and thats something Im proud of her doing.? Independents also may participate  unlike in some states, such as New York, where they are barred from voting in primaries.",
    "Mencken once sneered that [d]emocracy is the theory that the common people know what they want, and deserve to get it good and hard.? Yet looking at Ohios Senate primaries, can anyone say that the voters are getting the candidates they want?",
    "Andrew Hall, a professor at Stanford, conducted a deep dive into the data and found that despite the average American voters preference for moderate candidates, the general elections tend to give them one or two extremists to pick among.",
    "The aspirant for office must put himself in hock to extreme primary voters and uber-rich donors with hobby horse policy demands, all while enduring the slanders of political hatchet men paid by dark money.",
    "You are supposed to uphold the U.S. Constitution, represent the interests of all your diverse constituents regardless of party, enact policies to benefit the nation, and oversee the executive branch.",
    "Which is why moderates and level-headed people in Congress are growing increasingly few and the chambers are being swamped by radicals and reactionaries who behave like reality television stars.",
    "Vances come-from-behind victory in the Ohio Republican primary was the first test of Donald Trumps influence in the 2022 election cycle as well as the future of the Republican Party.",
    "Also noteworthy is that Vances chief opponent, Mandel, was a twice-failed candidate for Senate who turned off voters with his toxic tweets and often unserious behavior.",
    "Vance was lagging in the polls behind Josh Mandel and neck and neck with Matt Dolan and Mike Gibbons  despite hefty financial support from billionaire Peter Thiel.",
    "The tendency of Ohio voters to be willing to elect Democrats or Republicans to the Senate goes back to the 1850s when they selected Benjamin Wade and George Pugh.",
    "This is due to two reasons: Very few people vote in primaries and those who do vote tend to be very ideological, so they support intensely ideological candidates.",
    "With a very exciting GOP race, a close one to replace an important and effective senator (Rob Portman), we might expect to see voters turn out in droves, right?",
    "Vances total vote count of 340,991 also was lower than the 355,764 votes garnered by Tim Ryan, the Democrat he will face in Novembers general election.",
    "Ohio has split its two Senate offices between Republicans and Democrats since 2007, when Democrat Sherrod Brown succeeded Republican Mike DeWine.",
    "Naturally, the outcome of last weeks Ohio GOP Senate primary elicited plenty of hot takes run through the interpretive prism of Trump.",
    "He is the coeditor of Congress Overwhelmed: Congressional Capacity and Prospects for Reform? (University of Chicago Press, 2020).",
    "Some 77 percent of Ohio voters are independents  people who did not register with either the Democratic or Republican parties.",
    "The state uses a semi-open primary, meaning that any voter can cast a ballot in either the Democratic or Republican primaries.",
    "But if we can get past the Ohio as Trump referendum? framework, we can see a bigger story in the May 3 election in Ohio.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Vance  one of whom will be the next senator from Ohio  got the support of a mere 8 percent of registered voters.",
    "Primaries, it is worth mentioning, also tend to attract candidates who are willing to endure their indignities.",
    "So, he is presumably more than happy when media people interpret everything through the framework of Trump.",
    "Additionally, Trump, like most people in politics, loves to claim credit for making good things happen.",
    "That means nearly 68 percent of Ohios GOP voters chose a candidate other than the one Trump preferred.",
    "And it is anything but how much benefit Trumps endorsement will provide in Novembers general election.",
    "Spoiler alert: Hes influential.?\nAnd these two writers, mind you, are no fans of the former president.",
    "Then the Man from Mar-a-Lago put his chips on Vance a couple of weeks before the election, and J.D.",
    "Score one for Donald Trump,? wrote Jonathan Bernstein of Bloomberg, noting that winner J.D.",
    "And to do this you have to bargain with other legislators who come from around the nation.",
    "Kevin R. Kosar (@kevinrkosar) is a senior fellow at the American Enterprise Institute.",
    "Put bluntly, primaries increasingly are shabby ways to choose competent legislators.",
    "Vance has more than shown himself willing to prostrate himself before The Donald.",
    "Yet, valuable as Trumps endorsement was, its potency should not be overstated.",
    "Had Mike Gibbons dropped out and endorsed Matt Dolan, Vance might have lost.",
    "Low turnout in Ohios primary elections, and Americas generally, is the norm.",
    "Only 1.7 million voters (21 percent) participated in the Senate primaries.",
    "Moreover, any Trump effect on Vances success will be difficult to parse.",
    "With Brown still in office, then, history would suggest Vance will win.",
    "Yet primaries are ill-structured to attract and elect such candidates.",
    "Ill give you an example,? explains Secretary of State Frank LaRose.",
    "Vance won a mere 32.2 percent of the votes cast for GOP candidates.",
    "Politically, the Buckeye State rarely has been a one-party state.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Talk about a lack of enthusiasm for what was being offered.",
    "Over at the New York Times, Sarah Longwell declared, J.D.",
    "The state has more than 7.9 million registered voters.",
    "Both have written critically about him numerous times.",
    "Vance lagged in the polls until Trump endorsed him.",
    "In off years like this one, it is even lower.",
    "They are not wrong on a particular point.",
    "Being a lawmaker is a serious job.",
    "That story is the primary problem.",
    "subsequently surged to victory.",
    "Which brings us back to Ohio.",
    "Altogether, Tim Ryan and J.D.",
    "Trump no doubt is delighted.",
    "That did not happen.",
    "This was no fluke.",
    "H.L."
  ]
}