{
  "id": 5716,
  "mediaId": 195,
  "date": "d2022-05-05T14:08",
  "headline": "Romney: Trump very likely to be 2024 Republican nominee if he runs again",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2020/02/romneymitt_trumpdonald_020620getty.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/3478176-romney-trump-very-likely-to-be-2024-republican-nominee-if-he-runs-again/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dominick Mastrangelo",
  "authorUrl": "https://thehill.com/author/dominick-mastrangelo/",
  "termIds": [
    1147,
    1801,
    2465,
    3103,
    403,
    428,
    571,
    2845
  ],
  "sentences": [
    "But I think if you look at the numbers and look at the pickup that Republicans had in statehouses across the country and Congress and holding the Senate so far, versus our loss in the presidency, youd suggest that the presidential race was more a matter of a referendum on a person.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Sen. Mitt Romney (R-Utah), who was the Republican nominee for president in 2012, this week said that former President Trump would very likely? be the GOPs nominee if he seeks another White House term in 2024.\nI dont delude myself into thinking I have a big swath of the Republican Party,? Romney, who has been a frequent critic of Trump, said during an interview with Politico.",
    "Romney has been a vocal of critic of Trump dating back to the 2016 presidential race, during which he called the real estate mogul and then-GOP hopeful a fraud.?\nThe senator was the lone Republican to vote to convict Trump during his first impeachment and has since lamented the former presidents influence over voters in the Republican Party.",
    "So, if he wants to become the nominee in 24, I think hes very likely to achieve that.?\nTrump has teased a potential run for president in 2024 but has not publicly announced his plans beyond this years midterm elections.",
    "I believe the great majority of people who voted for Donald Trump want to make sure that his principles and his policies are pursued,? Romney said after the 2020 election.",
    "I think were going to win a lot of races with great candidates who are going to go on to big numbers in the fall,? Trump said this week following Vances victory.",
    "He has instead used his influence over the partys base to boost candidates in Republican primaries who have pledged support from him, most notably J.D.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "He will have an enormous impact on our party going forward.",
    "Its hard to imagine anything that would derail his support.",
    "Vance in the Ohio Republican Senate primary on Tuesday.",
    "I think were going to have a tremendous season."
  ]
}