{
  "id": 5720,
  "mediaId": 238,
  "date": "d2022-05-05T12:59",
  "headline": "Live updates Abortion becomes central issue as Democrats draw contrast with GOP",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/05/abortion-contrasts-democrats-republicans/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1148,
    2087,
    2305,
    3103,
    3763,
    146,
    571,
    2831
  ],
  "sentences": [
    "He touted an interagency task force that the administration set up in January to mark Roes 49th anniversary, but vowed to work with all of our partners throughout the federal government to make sure every woman has the legal right to access to care that shes entitled to.?\nReturn to menu\nFollowing the leak of a draft Supreme Court opinion that would overturn Roe v. Wade, President Biden and other Democrats have stepped up calls to write abortion rights protections into law.",
    "The League of Conservation Voters Action Fund, the Natural Resources Defense Council Action Fund and Climate Hawks Vote have lined up behind Casten, while Friends of the Earth Action is backing Newman\nReturn to menu\nSen. Mitt Romney (R-Utah), hardly a cheerleader for Donald Trump, conceded in an interview published Thursday that the former president is very likely? to become the GOP White House nominee in 2024 if he decides to run.",
    "I think we have to bring as many people into the party as we possibly can.?\nDuring the rally, Clyburn, the third-ranking House Democrat, touted Cuellars work as a chief deputy whip, saying together they have been very effective in getting Joe Bidens [agenda] across the finish line.?\nIn his primary race, Cuellar faces a challenger, Jessica Cisneros, who supports abortion rights.",
    "Writing in The Fact Checker, The Posts Glenn Kessler notes that among those taking issue with Mayorkass claim was former Trump immigration guru Stephen Miller, who wrote on Twitter that Mayorkas was repeating one of his most appalling and galling lies.? Glenn writes:\nThe operative word in Mayorkass comment is promptly.? Thats certainly open to interpretation.",
    "As Paul notes, comedian Trevor Noah, the featured entertainer at the dinner, joked on Saturday that the event would be the worlds most distinguished superspreader event.?\nReturn to menu\nIf the Supreme Court overturns Roe v. Wade, it will do away with a long-standing precedent that polling has shown Americans support by a margin of roughly 2-to-1.",
    "Scott echoed that sentiment during an appearance Tuesday night on Fox News, claiming almost everything [Biden] said was a complete lie.?\nTheres a complete difference between my view of the world and his view of the world,? Scott said, calling himself the biggest tax-cutter in the Senate? and citing his record as Floridas governor.",
    "Return to menu\nWith the midterms approaching, Biden and his allies have tried to draw a sharper contrast with Republicans in recent weeks, and abortion rights are likely to become a central part of that argument, as they warn that giving power to the GOP would result in additional far-reaching actions on a range of issues.",
    "Return to menu\nFaced with the reality they dont have the votes to codify Roe v. Wade, congressional Democrats are pursuing another strategy following Mondays revelation that the Supreme Court is poised to strike down the landmark 1973 ruling: press President Biden to take executive action to protect abortion access.",
    "As The Posts Mike DeBonis notes, many GOP lawmakers  including Senate Minority Leader Mitch McConnell of Kentucky, an architect of a conservative revolution in the federal courts  said they were more concerned about the leak of a draft Supreme Court opinion and its implications than the substance of the opinion.",
    "Return to menu\nHomeland Security Secretary Alejandro Mayorkas, during an appearance Sunday on Fox News Sunday,? drew swift criticism from conservatives for claiming that migrants who entered the United States illegally and are subject to enforcement proceedings are promptly removed? if their claims dont prevail.",
    "Weve protected womens rights with the filibuster.? Sinema called the filibuster and other Senate rules more important now than ever.?\nMoreover, Amber notes, Manchin doesnt support codifying Roe v. Wade into law anyway; he is one of the few remaining Democrats in Congress who doesnt support abortion rights.",
    "Experts say the bill could also restrict in vitro fertilization and emergency contraception because it would grant constitutional rights to a person from the moment of fertilization.?\nReturn to menu\nAfter the Gridiron Club dinner on April 3, at least 85 of 630 attendees tested positive.",
    "Return to menu\nBiden on Thursday doubled down on his attempt to make former president Donald Trump part of the midterm conversation, tweeting a video from the day before in which Biden disparaged the ultra-MAGA agenda? and took aim at a tax plan put forward by Sen. Rick Scott (R-Fla.).",
    "Return to menu\nWhile the antiabortion movement has traditionally embraced policies that are claimed to protect both the woman and the fetus  and avoided laws that criminalize those seeking abortions  abortion rights advocates worry that could change if Roe v. Wade is overturned.",
    "Maxine writes:\nThe race pits Rep. Sean Casten, a moderate who sits on the Select Committee on the Climate Crisis and previously ran an energy efficiency company, against Rep. Marie Newman, a progressive and self-described climate activist who supports the Green New Deal.",
    "Republicans in the Louisiana House advanced a bill Wednesday that would classify abortion as homicide and allow prosecutors to criminally charge patients, with supporters citing a draft opinion leaked this week showing the Supreme Court ready to overturn Roe v. Wade.",
    "Unintended pregnancies are at a 30-year low around the world, while abortion rates are rising in both countries where access is legalized as well as in those where abortion is restricted, according to a recent study co-led by the World Health Organization.",
    "The legislation, which passed through a committee on a 7-to-2 vote, goes one step further than other antiabortion bans that have gained momentum in recent years, which focus on punishing abortion providers and others who help facilitate the procedure.",
    "So if he wants to become the nominee in 24, I think hes very likely to achieve that.?\nRomney voted twice to convict Trump in impeachment trials and was far more willing to criticize his actions while in the White House than most of his GOP colleagues.",
    "But the climate crisis is taking center stage in a key House race in Illinois, where the two Democratic incumbents in a redrawn district are criticizing each others records on global warming, The Posts Maxine Joselow writes in The Climate 202.",
    "In his remarks Tuesday, Biden repeatedly used the term MAGA?  an acronym for Trumps slogan Make America Great Again?  to describe what he called an extreme? plan by Scott, who serves as chairman of the Senate Republicans campaign organization.",
    "With the midterm elections approaching, Democrats see support of abortion rights as a central issue on which to draw contrasts with Republicans, whose reaction to their probable success on this issue has been noticeably muted to this point.",
    "For months, the GOP has been on the rhetorical offensive against Biden and fellow Democrats  hammering them on the Afghanistan withdrawal, on increasing homicide rates, on a chaotic southern border and on seemingly ever-rising inflation.",
    "And early indications are that plenty of Republicans will go quite a bit further on this issue than the vast majority of Americans are comfortable with, including by banning exceptions for rape, incest and even the life of the mother.",
    "Sen. Patty Murray (D-Wash.) pressed Health and Human Services Secretary Xavier Becerra in a hearing on the administrations plan for a whole-of-government response to defend the right to abortion.?\nBecerra didnt have an answer.",
    "We have a big-tent party, and if were gonna be a big-tent party, we got to be a big-tent party,? Clyburn told reporters after an evening rally at an outdoor barbecue joint in San Antonio, according to the Texas Tribune.",
    "Scotts plan calls for all Americans to pay some federal income taxes to have skin in the game.? Taken literally, that would raise taxes on about half of Americans whose income is currently too low to be federally taxed.",
    "The Posts Yasmeen Abutaleb and Tyler Pager note that Biden offered a preview of whats likely to come on Wednesday as he took aim at Donald Trump and the former presidents mantra of Make America Great Again.? They write:",
    "But this is a little more unusual: a congressional candidate touting the backing of former House speaker Newt Gingrich (R-Ga.), who left Congress more than two decades ago, and Fox News personality Sean Hannity.",
    "Ishaan reports:\nIn the last 28 years, over 30 countries have expanded national abortion access, while only three countries  Nicaragua, Poland and El Salvador  have pushed through new national restrictions.",
    "The Posts Paul Farhi writes that the dinner appears to be connected to an outbreak of coronavirus infections, validating concerns that the virus might spread among guests at an event attended by Biden.",
    "Return to menu\nThe campaign appearances in Texas by House Majority Whip Rep. James E. Clyburn (D-S.C.) were announced before the leak of a draft Supreme Court opinion that would overturn Roe v. Wade.",
    "The spot is from Jake Evans, a self-described constitutional warrior? and one of the better-funded contenders in a nine-candidate Republican primary for Georgias new 6th Congressional District.",
    "But behind the scenes, Biden and fellow Democrats are far less celebratory as they scramble to respond to the expected demise of Roe v. Wade from both policy and political perspectives.",
    "Return to menu\nWhile Republicans appear on the verge of a long-sought win on abortion with the probable Supreme Court overturn of Roe v. Wade, the celebration this week has been muted.",
    "But, unlike with those issues, public opinion runs sharply against the GOP on abortion, suggesting the party could pay a significant political price if Roe is overturned.",
    "Aaron writes:\nMuch depends on what might happen after Roe presumably falls  specifically, what those with newfound power to restrict and ban abortion do with that power.",
    "Writing in The Early 202, The Posts Leigh Ann Caldwell and Theodoric Meyer take a look at the effort, including an exchange that took place Wednesday on Capitol Hill.",
    "Return to menu\nDuring this election cycle, Republicans with the endorsements of former president Donald Trump have trumpeted them in their television ads.",
    "Paul writes:\nAmong those testing positive: ABC News correspondent Jonathan Karl, ABC News President Kim Godwin and Secretary of State Antony Blinken.",
    "Under the chambers rules, Democrats would either need to find 60 votes to advance the legislation or a majority vote to do away with the filibuster.",
    "Could another elite Washington gathering  last Saturdays White House Correspondents Association dinner  also be destined for superspreader status?",
    "Return to menu\nIf Roe v. Wade is overturned, theres all but certain to be a wave of state-level abortion restrictions in the United States.",
    "Return to menu\nSome of the biggest priorities for voters in the midterm elections are the economy, inflation, Ukraine and, now, abortion.",
    "The Posts Aaron Blake says that the political fallout will depend in part of what Republicans do next and how far they go in responding.",
    "Joe Manchin III (W.Va.) and Kyrsten Sinema (Ariz.) explicitly said this week that they opposed changing the filibuster for abortion.",
    "Today, the only public event on President Bidens schedule is a Cinco de Mayo reception in the Rose Garden at the White House.",
    "Its hard to imagine anything that would derail his support,? Romney, the partys presidential nominee in 2012, told Politico.",
    "Scott later narrowed his definition of who would be impacted after other Republicans distanced themselves from the plan.",
    "His trip on Wednesday to aid Rep. Henry Cuellar, an abortion opponent, took on added significance, following that news.",
    "That would largely buck the worldwide trend, The Posts Ishaan Tharoor notes, writing in the WorldView newsletter.",
    "The two blocked Democrats effort a few months ago to eliminate the filibuster to pass voting rights legislation.",
    "One reason: Polls show a majority of Americans think Roe v. Wade should be upheld by a roughly 2-to-1 margin.",
    "The State Department said Blinken, who is vaccinated, is experiencing mild symptoms and quarantining at home.",
    "The back-and-forth illustrates how the issue has become an increasingly important one for Democratic voters.",
    "On Wednesday she called  unsuccessfully  for House Democratic leadership to rescind its support for Cuellar.",
    "But as The Posts Amber Phillips notes, thats not likely to happen with the current makeup of the Senate.",
    "Amber writes:\nDemocrats dont have 50 votes among themselves to change the filibuster for abortion.",
    "The filibuster is the only protection we have in democracy,? Manchin told reporters this week.",
    "At 3 p.m. weekdays, return to this space and well address whats on the mind of readers.",
    "Vance, a Trump-backed candidate, in the crowded GOP Senate primary in Ohio on Tuesday.",
    "I dont believe we ought to have a litmus test in the Democratic Party.",
    "His comments came in the wake of the victory of J.D.",
    "The primary has split major environmental groups.",
    "Got a question about politics?",
    "Watch until the end.",
    "Democratic Sens.",
    "Submit it here."
  ]
}