{
  "id": 5723,
  "mediaId": 558,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Is hard-right Arizona Senate hopeful Blake Masters the next J.D. Vance?",
  "image": "https://s.yimg.com/ny/api/res/1.2/LoEyqS3Kvm8yCiFswfsVdg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2022-05/b9001c50-cc8d-11ec-bff6-6eb3c35e69b9",
  "link": "https://ca.news.yahoo.com/is-hard-right-arizona-senate-hopeful-blake-masters-the-next-jd-vance-182640600.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Romano",
  "authorUrl": "https://www.yahoo.com/author/andrew-romano",
  "termIds": [
    1119,
    1127,
    1801,
    2524,
    3103,
    4684,
    428,
    571,
    3138,
    2550,
    2845
  ],
  "sentences": [
    "He has because we do not need hundreds of thousands of people from India and China to come in every year to take coding jobs.?\nAnd Masters has Lee Kuan Yew  the founder of modern Singapore who used ? to create a wealthy nation in a struggling corner of the world  as one of his favorite historical figures, citing him as an example of what one committed person can do to change things? in a way that is more conservative than libertarian.?\nWith Masters, as with Vance, its unclear how much of this is principle and how much is posturing  an attempt to earn Trumps endorsement and corner the MAGA base.",
    "He found all sorts of things, but he didnt want to do anything about it,? said Trump, who Brnovich of being too politically correct? to go after the people [who] committed these election crimes.?\nThe son of a libertarian who steered him toward Ayn Rand, Ron Paul and the Austrian economist Ludwig von Mises, Masters grew up in Tucson but left for college at Stanford.",
    "Like the Yale Law-educated Vance  who in 2016 compared Donald Trump to cultural heroin? and predicted he would lea[d] the white working class to a very dark place?  the Stanford-bred Masters (BA, JD) experienced his own change of heart as Trump rose to power, eschewing the libertarianism of his youth and embracing Trumps Make America Great Again? rhetoric instead.",
    "hasnt been involved in a just war in over 140 years.? (Responding to about that essay, written in opposition to the Iraq War and published on the website of radical libertarian Lew Rockwell, Masters admitted he went too far.?)\nAt Stanford Law, Masters took a course on startups taught by Thiel, then a libertarian himself  and a Silicon Valley outlier.",
    "Like Vance, Masters is a proud protg of billionaire tech investor Peter Thiel, who has single-handedly bankrolled both candidates by pledging at least $10 million to their respective super-PACs  while encouraging them to align with a budding national conservative? movement that embraces big government as a vehicle to fight the culture wars.",
    "With the national mood turning so strongly against the Biden administration and Democratic control of Congress, a Republican candidate should have a relatively easy time recapturing the seat in Arizona this cycle,? says Robert Robb, a and former GOP political consultant.",
    "Last Saturday the former president dialed into a Masters election integrity? rally to praise the candidate for echoing his false claims of widespread 2020 election fraud  and to trash Brnovich for overseeing of the election but refusing to overturn the results.",
    "On Tuesday night, he from far-right Human Events host Jack Posobiec touting Vances win and declaring that The biggest question now is: Who should Trump endorse in AZ primary?? A few hours later, Masters , herself a former U.S. Senate candidate.",
    "I think sounding different and looking different is how you break through.?\nTo that end, Masters a short-barreled rifle in one ad while declaring that it wasnt designed for hunting.? This,? he said, is designed to kill people.",
    "If Republicans win both of these Senate contests by holding the open seat of retiring GOP moderate Rob Portman in Ohio and defeating Democratic incumbent Mark Kelly in Arizona, they will likely win back control of the Senate.",
    "In the Arizona Republican primary, Masters is : Attorney General Mark Brnovich, the early frontrunner, and wealthy solar power executive Jim Lamon, who has spent more on advertisements ($3.8 million) than anyone else.",
    "Whatever this new right thing is, I dont think that it necessarily fits Arizona.?\nMasters and Vance of top Fox News host Tucker Carlson, who trumpets to more than 3 million viewers every weeknight on cable TV.",
    "There are signs that Trump  who said last month that he will be making an [Arizona] endorsement in the not too distant future?  is leaning toward Masters, who Donald Trump Jr. also reportedly favors.",
    "Previously a toss-up, Ohio has been moving rightward in recent elections, while Arizona  the state that launched John McCain and Barry Goldwater to the national stage  has been trending to the left.",
    "Its about protecting your family and your country.?\nHe the Democrats who are running the country?  Biden, Pelosi, Schumer, Mark Kelly?  as psychopaths.? He has claimed that Trump won in 2020,? .",
    "Because more than any other politician in America, Masters, a 35-year-old rookie candidate vying for Arizonas Republican Senate nomination, hopes to be the next J.D.",
    "He followed up a few hours later with a photo of himself and Vance smiling in front of Trump International Hotel in Washington, D.C.\nWhy was Masters so delighted?",
    "Were living through a period of American decline, as well as a massive consolidation of power in both government and corporations,? Masters last September.",
    "Vance had come from behind to win Ohios Republican Senate primary, perhaps no other politician in America was as giddy as Blake Masters.",
    "The similarities between Vance and Masters are legion, but mostly they boil down to the three Ts?: Thiel, Tucker and Trump.",
    "In 2016, Thiel backed Trump, and Masters followed him to Trump Tower to help with the transition after the election.",
    "But in their , at least, both candidates are embracing elements of right-wing thought that go beyond Trumpism.",
    "Galvanized by Thiels contrarian thinking, Masters posted his detailed class notes on Tumblr; David Brooks .",
    "Then Thiel and Masters spun those same notes into a book called .? Masters spent the next eight years .",
    "As the 2022 midterm elections approach, Ohio and Arizona are emerging as two key Senate races to watch.",
    "But then again, Vance was in before Trump   came off the sidelines and endorsed him on April 15.",
    "Who do you want President Trump to endorse in the AZ Senate primary?? Ward asked.",
    "At 19, he wrote an essay that Nazi leader Hermann Goering to argue that the U.S.",
    "When the news broke Tuesday night that Hillbilly Elegy? author J.D.",
    "But if youre not a bad guy, I support your right to own one.",
    "Nearly 90% of the 3,000-plus respondents picked Masters.",
    "And Vances victory could be just the boost he needs.",
    "The Second Amendment is not about duck hunting.",
    "But these candidates are weak candidates.",
    "(Vance was during his primary campaign.)",
    "Masters is certainly counting on it.",
    "Vance!? Masters tweeted.",
    "Senator J.D.",
    "Vance won .",
    "Vance."
  ]
}