{
  "id": 5728,
  "mediaId": 237,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Midterm Memo: Financier Peter Thiel and pollster Tony Fabrizio boosted by Vance win",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/fb58f4b/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Ffe%2F93%2Fe468d64f4bc7b891f131d8ebda36%2Fpeter-thiel.jpg",
  "link": "https://www.washingtonexaminer.com/news/midterm-memo-financier-peter-thiel-and-pollster-tony-fabrizio-boosted-by-vance-win",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-m-drucker",
  "termIds": [
    3103
  ],
  "sentences": [
    "But the on-again, off-again Trump pollster and his business partner Lee absorbed jabs from competitors after a March 3031 survey their firm conducted for Protect Ohio Values revealed Vance to be in a surprising three-way tie for first at a time when most of the other available data showed the eventual winner stagnating in the middle of a crowded pack of candidates.",
    "But after receiving a fundraising email from CAVPAC, the former secretary of states political action committee, I was reminded that he has quietly become a ubiquitous presence on the 2024 shadow campaign trail, traveling steadily across the country to support endorsed candidates and contribute to GOP efforts to win control of Congress in the midterm elections.",
    "Fabrizio also has to be smiling after Vance advanced  and not simply because he polled for Vances campaign, or because his business partner David Lee does the survey work for the nominees Thiel-funded super PAC, Protect Ohio Values, or because his firm now appears to be guaranteed another six months of robust billings.",
    "Indeed, in an unusual move, campaign operatives for two of Vances competitors, businessman Mike Gibbons and former state Treasurer Josh Mandel, both bitter rivals, collaborated with each other in an attempt to make the case that Lee purposely manipulated that poll.",
    "According to the Gibbons and Mandel campaigns, Lee was being overly optimistic with his turnout models to convince Trump that Vance was viable so that the former president would feel comfortable bestowing the endorsement they so coveted (for obvious reasons.)",
    "While all eyes were focused on Vances win in Ohios Republican Senate primary, Rep. Shontel Brown (D-OH), the pragmatic incumbent in the states Democratic-leaning 11th District, soundly defeated liberal challenger Nina Turner.",
    "But the outcome of the open GOP Senate primary in the Buckeye State marked a moment to celebrate for two other Republicans rather prominent in the party of late: Megadonor Peter Thiel and veteran pollster Tony Fabrizio.",
    "Still, it was a good reminder that one of Trumps most trusted confidants, at least during his term in office, is plotting a presidential campaign of his own  and that he has not ruled out running against his old boss.",
    "Republicans are dominating Ohio politics, and the midterm election cycle is shaping up as a nationwide GOP wave, making Vance the favorite in November against Rep. Tim Ryan, the Democratic Senate nominee.",
    "Thiel, the venture capitalist who is on an apparent mission to elevate conservative populists, invested at least $10 million in a super PAC that supported Vance (his former employee) in the primary.",
    "That means Thiel is on track to see a major political ally, who happens to be a rising Republican star, take his place on Capitol Hill (and in every Sunday show studio) come January of next year.",
    "Meanwhile, another former Thiel employee on whom the financier has staked another $10 million, Blake Masters, is running competitively in the open primary to pick a GOP Senate nominee in Arizona.",
    "Mike Pompeo might not have the largest political operation among the Republican Partys presumed 2024 contenders, nor the flashiest, nor the one with the deepest pockets, etc.",
    "Former state Attorney General Adam Laxalt enjoys roughly double the support of Republican primary opponent Sam Brown in a new poll for the Hill conducted by Emerson College.",
    "Turner is a fiery populist who would, in style and substance, appear to channel the party's liberal wing  the wing most likely to show up to vote in Democratic primaries.",
    "Yes, Vances victory Tuesday evening was a big win for the former president, whose endorsement proved crucial for the former venture capitalist and bestselling author.",
    "Just like King James, LeBron James, decided to take his skills to South Beach, what Sister Turner is gonna do is continue taking my skills all over this nation.",
    "Neither his reputation, nor his firm, was likely to rise or fall because of the success or failure of one client in one primary contest in one election cycle.",
    "The former Nevada attorney general did not crack 50% of the vote in his lone statewide victory in 2014, a GOP wave year, and was ousted after just one term.",
    "Other than calling President Joe Biden radical? and asking for help to retire? House Speaker Nancy Pelosi (D-CA), Pompeo sounded practically civil.",
    "But if these poll numbers end up predictive, it will also be a win for Senate Minority Leader Mitch McConnell (R-KY), who is also backing Laxalt.",
    "And she enjoyed the support of Sen. Bernie Sanders (I-VT), a socialist who caucuses with the Democrats and a two-time presidential candidate.",
    "The tone and tenor of the CAVPAC fundraising request was tame by comparison to the rhetoric typically employed to encourage online donations.",
    "Note: Despite the favorable political environment, Republicans in Nevada are not yet ready to predict a Laxalt victory in November.",
    "Vance captured the Republican nomination for Senate in Ohio, and neither of them is named Donald Trump.",
    "Next up for the former state attorney general would be Sen. Catherine Cortez Masto (D-NV).",
    "Turner promised in her defiant concession speech that voters havent seen the last of her.",
    "Perhaps more importantly, Laxalt topped 50% in this survey, compared to Browns 27%.",
    "There were two other big winners in the Republican Party after J.D.",
    "Yes, as the former president has endorsed Laxalt.",
    "Sister Turner aint going nowhere,? she said.",
    "But it simply wasnt enough  not nearly.",
    "Another victory lap on tap for Trump?",
    "Fabrizio has been around a long time.",
    "And Im gonna see some folks in 2024.\"",
    "Ohios 11th Congressional District.",
    "And it paid off  handsomely.",
    "Dont fret, however.",
    "Nevada Senate race.",
    "Now, to the field.",
    "Why, supposedly?",
    "Well  #oops.",
    "2024 Watch.",
    "Just In..."
  ]
}