{
  "id": 5729,
  "mediaId": 136,
  "date": "d2022-05-05T01:57",
  "headline": "Donald Trump Posts Graph Showing J.D. Vance's Ohio Success Was Due to Him",
  "image": "https://d.newsweek.com/en/full/2031564/jd-vance-shakes-hands-donald-trump.webp?w=790&f=7bb232dff78828fc6e423cd74d383632",
  "link": "https://www.newsweek.com/donald-trump-posts-graph-showing-jd-vances-ohio-success-was-due-him-1703641",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Thomas",
  "authorUrl": "https://www.newsweek.com/authors/jake-thomas",
  "termIds": [
    946,
    1115,
    1147,
    2027,
    2259,
    3103,
    417,
    428,
    571,
    2845
  ],
  "sentences": [
    "David Niven, a political science professor at the University of Cincinnati, told Newsweek in an earlier story that the primary results signals that Ohio Republicans are receptive to confrontational candidates in the mold of Trump, rather than the more staid Rob Portman, who is retiring from representing the state in the Senate.",
    "\"Ohio Republicans have spoken and now it's time to look forward, united in our conservative convictions to make our state and nation a better place to live, work, and raise a family,\" Dolan said in a statement Tuesday.",
    "Trump spokeswoman Liz Harrington on Wednesday tweeted a graph showing Vance rising in polls after the former president endorsed him and getting another boost after the two campaigned together at a rally.",
    "Notably, the Real Clear Politics poll average shows state Senator Matt Dolan, a GOP candidate who did not seek Trump's endorsement, experiencing a smaller surge that tracked Vance's.",
    "The screenshot shows Vance shooting up to nearly 15 percent the day of the endorsement and to 17 percent days later, but still behind then-frontrunner Josh Mandel's 24 percent.",
    "Previously, Trump disparaged polls in the run-up to the 2020 presidential election, insisting he was ahead of Democrat Joe Biden and calling some poll results \"fake.\"",
    "The image shows Vance at around 10 percent in the polls before Trump, on April 15, gave his coveted endorsement to the venture capitalist and author.",
    "The tweet is the latest boast from Trump's camp of his continued dominance of the Republican Party following Tuesday's closely watched primary.",
    "A day later, Vance was tied with former state treasurer Mandel at 23 percent, according to a poll average from Real Clear Politics.",
    "As of Wednesday, Vance currently has 32.2 percent of ballots cast to Mandel's 23.9 percent with 95 percent of the vote counted.",
    "Harrington's tweet included a screenshot of Real Clear Politics' poll average for the Ohio Republican primary for Senate.",
    "Donald Trump Jr. proclaimed in a tweet Tuesday, using the shorthand for his father's slogan \"Make America Great Again.\"",
    "\"But even with Trump's endorsement, the vast majority of Ohio Republicans voted for someone else.\"",
    "Vance propelled the Senate candidate to victory in this week's Ohio Republican primary.",
    "House candidates endorsed by Trump also prevailed in their primary races on Tuesday.",
    "Vance pulled ahead of Mandel in the polls leading up to Tuesday's primary.",
    "Former President Donald Trump says polling data shows his support for J.D.",
    "Dolan came in third with 23.3 percent and has since endorsed Vance.",
    "Trump held a rally for Vance on Saturday, April 23.",
    "Newsweek has reached out to Trump for comment.",
    "Vance to the head of the pack,\" said Niven.",
    "\"Trump's endorsement elevated J.D.",
    "\"The GOP is now the MAGA party!\""
  ]
}