{
  "id": 5730,
  "mediaId": 239,
  "date": "d2022-05-05T00:04:03",
  "headline": "Oz, Trumps candidate, stuck in neck-and-neck GOP race for U.S. Senate in Pennsylvania",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/27/Election_2022_Trump_Operatives_43704.jpg-a9c7a_c0-0-6000-3498_s885x516.jpg?07e2d73ee1d8ba24d8f7f1c26fc6214eaf70cc44",
  "link": "https://www.washingtontimes.com/news/2022/may/5/mehmet-oz-endorsed-by-donald-trump-in-tight-gop-ra/",
  "sentiment": "0",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Ferrechio",
  "authorUrl": "https://www.washingtontimes.com/staff/susan-ferrechio/",
  "termIds": [
    1147,
    1653,
    2491,
    3103,
    3707,
    428,
    571,
    2845,
    2862
  ],
  "sentences": [
    "The results show the two men in a statistical tie nearly three weeks after Mr. Trumps endorsement, with almost no upward movement for Mr. Oz since the last Franklin and Marshall Poll was conducted between March 30 and April 10.",
    "His television program, The Dr. Oz Show,? ran from 2009 until 2022.\nI have known Dr. Oz for many years, as have many others, even if only through his very successful television show,? Mr. Trump said.",
    "Mr. Oz, a celebrity physician who hosted a television show, is edging out investment consultant David McCormick by 18% to 16%, according to a Franklin and Marshall University Poll released Thursday.",
    "But Mr. Trumps endorsement hasnt done much to budge Mr. Oz, who faces skepticism from the states conservative, rural residents who will make up the bulk of primary voters, according to Mr. Yost.",
    "Mr. Oz, a former heart surgeon, has voiced support for abortion and some restrictions on gun ownership, although he now says he is a pro-life candidate who backs gun rights.",
    "The polling data follows big wins for Mr. Trump in Ohio and Indiana, where all 22 of his endorsements won in GOP primaries, although most were unopposed or incumbents.",
    "His popularity drastically trails the former presidents among the states registered Republicans, a signal that his past views may be clashing with GOP primary voters.",
    "Its like Donald Trumps staff is sabotaging Trump by convincing him to make the worst possible endorsements,? conservative radio talk show host Erik Erickson tweeted.",
    "A new Pennsylvania poll shows Trump-endorsed Senate candidate Mehmet Oz stalled in a dead heat against top challenger David McCormick.",
    "Vance in Ohios Senate primary bolstered the candidate from the middle of a pack of GOP candidates to a 9-point victory on Tuesday.",
    "The poll found that 48% of Republicans held a strongly favorable opinion of Mr. Trump, while 22% viewed him somewhat favorably.",
    "The poll shows Republican Kathy Barnette trailing Mr. Oz and Mr. McCormick with 12% of the vote, an increase from 7% in April.",
    "Mr. McCormick is a former Army Ranger who served in the Treasury Department during the George W. Bush administration.",
    "The Republican senate primary field has no clear frontrunner at the moment,? poll director Berwood Yost wrote.",
    "Republican voters list conservative credentials as the third most important issue when choosing a candidate.",
    "In April, 43% of Republican voters said they didnt know who they would vote for in the upcoming primary.",
    "In his statement endorsing Mr. Oz, the former president cited his electability and likable TV persona.",
    "Among Republican voters, 38% said they knew too little about Mr. McCormick to determine favorably.",
    "Mr. Trumps endorsement has not pushed the undecided into backing Mr. Oz, or any other candidate.",
    "He has lived with us through the screen and has always been popular, respected, and smart.?",
    "Only 9% held a strongly favorable view of Mr. Oz and 20% held a somewhat favorable view.",
    "The two lead a crowded field of candidates who will face off in the May 17 GOP primary.",
    "Among those voters, 21% said they didnt know enough about Mr. Oz to make a judgment.",
    "The economy was listed first, followed by immigration and border security.",
    "Oz is not particularly popular among Republican voters,? Mr. Yost said.",
    "He served as the CEO of Bridgewater Associates, a large hedge fund.",
    "Mr. McCormicks favorability rating was about the same as Mr. Ozs.",
    "Mr. Trumps decision to endorse Mr. Oz stunned conservatives.",
    "In that survey, Mr. Oz led Mr. McCormick 16% to 15%.",
    "His last-minute endorsement of Republican J.D.",
    "Candidate Carla Sands remained stalled at 5%.",
    "A month later, 39% remained undecided.",
    "Dr."
  ]
}