{
  "id": 5732,
  "mediaId": 19,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "J.D. Vance on Kamala Harris Stooge Tim Ryans Late-Term Abortion Stance: Barbaric Anywhere in the World",
  "image": "https://media.breitbart.com/media/2022/05/Election-2022-Ohio-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/05/j-d-vance-on-kamala-harris-stooge-tim-ryans-late-term-abortion-stance-barbaric-anywhere-in-the-world/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Hamilton",
  "authorUrl": "https://www.breitbart.com/author/khamilton/",
  "termIds": [
    781,
    895,
    1801,
    2013,
    2058,
    3103,
    146,
    428,
    2845
  ],
  "sentences": [
    "In the interview, Baier asked Ryan, As senator, would you have any limits on abortion??\nLook, you gotta leave it up to the woman, because you and I sitting here are a bunch of  well you and I sitting here cant account for all of the different scenarios that a woman dealing with the complexities of a pregnancy are going through.",
    "If we move away from that, youre going to get states like Ohio that have some of the most extreme laws in the whole country, where if youre a young girl and youve been raped or theres been incestthe state, the government is going to force you to bring that baby to term, and I just dont think thats a fundamental value,? he said.",
    "Ever since the leak, radical left Democrats have pushed to end the filibuster, pack the Supreme Court, and pass the Womens Health Protection Act, legislation which would enshrine abortion on demand and up-to-birth in federal law as well as void all state laws aimed at protecting the lives of the unborn.",
    "On Monday night, Politico released a draft opinion, seemingly written by Justice Samuel Alito, which would overturn the Courts 1973 Roe v. Wade decision declaring abortion to be protected by the U.S. Constitution.",
    "In the same interview, Ryan called Roe v. Wade an issue of freedom,? and warned that if the Supreme Court does end up overruling Roe, states like Ohio will roll out extreme? laws.",
    "https://t.co/ObtePxlUHH\nThe segment was about the influence the leak of the Supreme Courts potential decision to overrule Roe v. Wade could have on midterm elections.",
    "But its an especially radical position in Ohio,? Vance tweeted in response to a clip of Tim Ryan talking to Fox News Special Report host Bret Baier on Wednesday.",
    "Vance slammed his Democrat competitor Rep. Tim Ryan (D-OH) for stating that women should be able to abort their unborn children at any point in pregnancy.",
    "This is a barbaric position anywhere in the world (even European nations typically dont allow abortion after 12 weeks).",
    "This is a barbaric position anywhere in the world (even European nations typically dont allow abortion after 12 weeks).",
    "Heres Kamala Harris stooge Tim Ryan defending abortion through 40 weeks.",
    "Heres Kamala Harris stooge Tim Ryan defending abortion through 40 weeks.",
    "Republican candidate for U.S. Senate in Ohio J.D.",
    "But its an especially radical position in Ohio.",
    "How can I figure that out?? Ryan replied."
  ]
}