{
  "id": 5740,
  "mediaId": 43,
  "date": "d2022-05-05T00:00",
  "headline": "Super PAC Backing J.D. Vance (R) Opposition Book On Their Own Candidate Has Been Made Public",
  "image": "https://images.dailykos.com/images/1066349/story_image/00pol-vance-profile-photo01-videoSixteenByNine3000.jpeg?1651776712",
  "link": "https://www.dailykos.com/story/2022/5/5/2095933/-OH-Sen-Super-PAC-Backing-J-D-Vance-R-Opposition-Book-On-Their-Own-Candidate-Has-Been-Made-Public",
  "sentiment": "0.399",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1801,
    2490,
    2524,
    3103,
    101,
    428,
    571,
    2845
  ],
  "sentences": [
    "Click it, and it actually takes you to a Dropbox folder with dozens of campaign strategy documents, including PDFs of two versions of a JD Vance vulnerability analysis.?\nHere are just highlights provided by Brad Reed at Raw Story:\nx\nJD Vance-backing super PAC wrote a brutal oppo book on their own candidate -- and it's public for all to seehttps://t.co/2uIn8y4j72\n Raw Story (@RawStory) May 5, 2022\nAmong other things, the oppo book found that Vance's career has been financed by the titans of big tech whom he regularly criticizes, including Amazon CEO Jeff Bezos and former Google boss Eric Schmidt.",
    "pic.twitter.com/UM7A5nL3al\n Tim Ryan (@TimRyan) May 4, 2022\nIn an interview on Wednesday, Ryan previewed his approach, calling Vance a candidate who will do and say anything he needs to do to gain power,? has flip-flopped all over the place on Trump and every other issue,? has no core convictions,? is not interested in helping working-class people? and has said that quite clearly he thinks Americas a joke.?\nYes, Vance said in a January interview that unfortunately our countrys kind of a joke.?\nOnce-swingy Ohio has given Democrats nightmares in recent years.",
    "Theyre talking about: How do we get investment in our communities? How do we get broadband in our communities? How do we get jobs in our communities??\nSo, if you walk into Gallipolis or Steubenville or Portsmouth and youre only talking about  defunding the police and critical race theory  you get laughed out of the room.? Voters, Ryan said, conclude that this person does not understand how stressed out I am.?\nIm representing the exhausted majority who are just tired of the fight,? he said.",
    "Vance has transitioned from Pelosi-district art-gallery hopper to hard-hitting MAGA partisan, more than ready to feed his former neighbors the very same cultural opioids of lost virility and victimhood that have made Trump such a hit in locales such as Middletown, Ohio, where Vance grew up, which he chronicled in his bestselling memoir turned movie, Hillbilly Elegy.",
    "Click below to donate and get involved with Ryan and his fellow Ohio Democrats campaigns:\nU.S. Senate\nTim Ryan\nGovernor\nNan Whaley\nOhio Supreme Court\nJennifer Brunner for Chief Justice\nAttorney General\nJeff Crossman\nAuditor of State\nTaylor Sappington\nSecretary of State\nChelsea Clark\nTreasurer\nScott Schertzer\nCongress\nMarcy Kaptur\nState Party\nOhio Democratic Party",
    "It was a perfectly normal day, by San Francisco standards.?\nOr, slightly different, you could say, from an afternoon out at my local Skyline diner slurping down a coney with chili, cheese, and sliced onions while rooting for Bengals QB Joe Burrow as if Cincinnatis entire future hangs in the balance.",
    "Trumps endorsement put him over the top in a crowded primary, while Thiels support  funneled through a super PAC called Protect Ohio Values (aka POV)  enabled Vance to outsource many traditional campaign operations, including polling, advertising, GOTV and, it turns out, opposition research.",
    "He had transformed himself from writing odes in The Atlantic to the brunches and wine country of San Francisco: A few Saturdays ago, my wife and I spent the morning volunteering at a community garden in our San Francisco neighborhood.",
    "As Alex Isenstadt detailed Tuesday in a fascinating tick-tock of the Ohio race, POV set up an unadvertised-but-public Medium account, where it posted a trove of sensitive documents, polling reports, audio and video for Vance to use.",
    "Vance appeared on Carlsons show 15 times, according to Media Matters: The combined cash and airtime helped enable Vance to withstand a barrage of negative ads from rivals funded by traditional GOP-aligned plutocratic interests.",
    "Thiels involvement has unleashed much snickering about the absurdity of Vance, the self-styled scourge of globalist elites and Big Tech, being backed by an obscenely wealthy venture capitalist and globetrotting tech oligarch.",
    "But Ryan sings from the populist, tough-on-trade, pro-union songbook written by that Democrat, Sen. Sherrod Brown, who has prevailed in contest after contest, most recently in 2018.\nI went to all 88 counties,? Ryan told me.",
    "What's more, the book says that a firm where Vance previously worked did lobbying work for Purdue Pharma, the pharmaceutical company that's widely blamed for getting millions of Americans addicted to opioids.",
    "And this sheds light on the broader political project that Vance and some of his right-wing nationalist fellow travelers are pursuing  revealing something thats much uglier than even the mockery suggests.",
    "And that's not all: The researchers also zeroed in on Vance's $1.4 million mansion in the suburbs of Cincinnati as a potential vulnerability to his attempts to project himself as a midwestern populist.",
    "But Vance hadnt moved back to Ohio hat in handunless youre including a large San Francisco Giants cap stuffed with $10 million from his former and current patron, tech billionaire Peter Thiel.",
    "And it helps Rep. Tim Ryan (D. OH-13) make the case that he is the real populist going up against a fake populist:\nx\nJD Vance doesnt care about Ohioans and he thinks our country is a joke.",
    "It is essentially a how to? guide for attacking Vance, which anyone  including the campaign of general-election opponent Rep. TIM RYAN (D-Ohio)  could access as of early Thursday morning.",
    "Ryan said he will also be reaching out to voters who supported State Senator Matt Dolan (R. OH) in the GOP primary who refused to push Trumps Big Lie and came in third place.",
    "One big problem with letting a super PAC do everything: Campaign finance law prohibits communication between a candidates own committee and a super PAC supporting them.",
    "After a few hours of casual labor, we and the other volunteers dispersed to our respective destinations: tasty brunches, day trips to wine country, art-gallery tours.",
    "As if all that weren't enough, the researchers found major issues with the nonprofit Vance founded called Our Ohio Renewal that was aimed at curbing opioid addiction.",
    "The book notes that the house \"sits on six parcels of land and includes a carriage house, pool, and pool house  all of which sits on an arboretum-like 3 acres.'\"",
    "Thiel bankrolled a pro-Vance super PAC with $15 million and brokered a meeting with Donald Trump that helped secure his endorsement, which proved decisive.",
    "Vance has won the GOP nomination for Senate in Ohio, heightened scrutiny will fall on his chief financial backer, billionaire tech investor Peter Thiel.",
    "pic.twitter.com/lMFcfSeV7J\n Tim Ryan (@TimRyan) May 5, 2022\nHealth and Democracy are on the ballot this year and we need to get ready to flip Ohio Blue.",
    "Not only did they write a whole opposition book on how Vance would be attacked, they made it public for everyone to see:\nTHE OPPO BOOK ON VANCE  J.D.",
    "Some 1,200 words into a 1,700-word Feb. 6 post on POVs Medium account, theres a link suggesting it will take you to some polling.",
    "He says rape is inconvenient.?\nWe need to abolish the filibuster and pass the Womens Health Protection Act to codify Roe ASAP.",
    "While Trumps endorsement did help, a certain Big Tech Billionaire helped keep Vances candidacy afloat:\nNow that J.D.",
    "While Barack Obama carried it in 2008 and 2012, only one Democrat has won a non-judicial statewide race since 2008.",
    "But the group also posted extensive opposition research reports  on both his primary opponents and Vance himself.",
    "Some of the files are boring, such as b-roll footage the Vance camp could include in ads.",
    "VANCE owes his GOP Senate primary victory in Ohio to two people: Trump and PETER THIEL.",
    "This further proves that Vance is full of shit:\nYet Vance had come back from all that.",
    "Among the documents, as Alex noted, was a lengthy study of Vances vulnerabilities.",
    "But in reality, the politics of Vance and Thiel overlap in a discernible fashion.",
    "Vance (R. OH) won the Republican primary for the open U.S. Senate race in Ohio.",
    "The New York Times has new reporting on Thiels importance to Vances victory.",
    "Vance wants to eliminate abortion with no exceptions for rape or incest.",
    "People there arent talking a lot about, you know, critical race theory.",
    "Thiels support interlocked with Tucker Carlsons Fox News megaphone.",
    "Now he wants to represent us in the Senate?",
    "Thiels Super PAC also made a huge blunder.",
    "But there are ways around that obstacle.",
    "That does seem bizarrely incongruent.",
    "They didnt make it easy to find.",
    "Vance (R. OH)\nOn Tuesday, J.D.",
    "Youve got to be kidding.",
    "The full book is here.",
    "Also, FYI:\nx\nJ.D.",
    "J.D."
  ]
}