{
  "id": 5742,
  "mediaId": 188,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Ohio Senate candidate Tim Ryan on late-term abortion: 'Leave it up to the woman'",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTc2NDM2Mi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2OTg2NzU1MX0.sFOPz5Uuum12NP_K41_DitmL1GeoHDZF_pMIvu1fieE/img.jpg?width=1245&quality=85&coordinates=0%2C8%2C0%2C99&height=700",
  "link": "https://www.theblaze.com/news/ohio-senate-tim-ryan-abortion",
  "sentiment": "0",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Pandolfo",
  "authorUrl": "https://www.theblaze.com/u/christopherpandolfo",
  "termIds": [
    3103
  ],
  "sentences": [
    "Late term, anything?\\u201d\\n\\nRyan: \\u201cLook, you gotta leave it up to the woman.\\u201dpic.twitter.com/JKf2IUqLhs\n Jerry Dunleavy (@Jerry Dunleavy) 1651707378\nAfter draft Supreme Court opinion on Dobbs was leaked, Ryan issued a statement saying, \"Overturning Roe v. Wade would be absolutely wrong, not to mention catastrophic for Ohio, where Republicans have passed one extreme and dangerous proposal after another to ban abortionwithout exceptions even for rape, incest, or medical emergenciesbefore most people even know theyre pregnant.\"",
    "On Monday, Politico published a leaked draft court majority opinion by Justice Samuel Alito that called the 1973 decision legalizing abortion \"egregiously wrong\" and \"exceptionally weak,\" ruling in favor of Mississippi's right to enact a 15-week abortion ban.",
    "In an interview on Fox News' \"Special Report,\" Ryan discussed the upcoming Supreme Court decision in Dobbs v. Jackson Women's Health Organization, a case on Mississippi's 15-week abortion ban that is widely expected to overturn Roe v. Wade.",
    "Where if you are a young girl, and you have been raped or there has been incest that you cant  you have to  the state, the government is going to force you to bring that baby to term and I dont think thats a fundamental value,\" he added.",
    "Ryan, who unsuccessfully challenged House Speaker Nancy Pelosi (D-Calif.) for her job in 2018 and is positioning himself as a moderate Democrat, criticized the draft opinion for overruling established precedent.",
    "Rep. Tim Ryan, the Democratic nominee for U.S. Senate in Ohio, suggested Wednesday that there should be no limits on abortion at all, staking a radically pro-choice position ahead of the election in November.",
    "Tim Ryan, Dem candidate for Senate in Ohio vs. JD Vance, suggests abortion should have no limits thru all 9 months.\\n\\nBaier: \\u201cMy question was about any limits to abortion at any point.",
    "\"But then again, if you get rid of what was established law, which in many ways was conservative, to keep that to appreciate stare decisis and make sure we appreciate the law.\"",
    "He called on the Senate to \"end the filibuster\"  a 60-vote threshold to end debate and pass major legislation  and take up a bill that would codify Roe into federal law.",
    "\"Look, I think what we had established in Roe is something that we can continue to work with, and I think those can be the parameters,\" he told Fox News host Bret Baier.",
    "But Baier pressed him on whether there should be \"any limits to abortion at any point,\" including late-term abortions where a baby is viable outside the womb.",
    "\"You and I sitting here cant account for all of the different scenarios that a woman, dealing with the complexities of a pregnancy, are going through.",
    "He suggested there should not be, that the choice to kill an unborn child in the womb must be left up to the mother seeking an abortion.",
    "This is a barbaric position anywhere in the world (even European nations typically dont allow abortion after 12 weeks),\" said Vance.",
    "\"If we move away from that, you will get states like Ohio that have some of the most extreme laws in the whole country.",
    "Vance, Ryan's Republican opponent for Senate, blasted his comments as a \"radical position in Ohio.\"",
    "\"Heres Kamala Harris stooge Tim Ryan defending abortion through 40 weeks.",
    "\"Look, you got to leave it up to the woman,\" Ryan said.",
    "How can you and I figure that out?\"",
    "J.D."
  ]
}