{
  "id": 5743,
  "mediaId": 157,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "JD Vance-backing super PAC wrote a brutal oppo book on their own candidate -- and it's public for all to see",
  "image": "https://www.rawstory.com/media-library/jd-vance.jpg?id=27686010&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/jd-vance-2657269289/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    1013,
    1801,
    2490,
    2524,
    3103,
    101
  ],
  "sentences": [
    "As part of that research, however, the PAC put together an opposition research file on Vance's potential vulnerabilities -- and as Politico's Playbook reports, they made it public for all the world to see on a Medium page that was intended to be accessed by the Vance campaign.",
    "What's more, the book says that a firm where Vance previously worked did lobbying work for Purdue Pharma, the pharmaceutical company that's widely blamed for getting millions of Americans addicted to opioids.",
    "Among other things, the oppo book found that Vance's career has been financed by the titans of big tech whom he regularly criticizes, including Amazon CEO Jeff Bezos and former Google boss Eric Schmidt.",
    "And that's not all: The researchers also zeroed in on Vance's $1.4 million mansion in the suburbs of Cincinnati as a potential vulnerability to his attempts to project himself as a midwestern populist.",
    "\"Despite its stated goals, Our Ohio Renewal spent more than 95 percent of its 2017 fundraising on staff salaries and overhead, and $0 on charitable activities or grants,\" they write.",
    "Vance won his race thanks in large part to the money of billionaire Peter Thiel, who backed a super PAC called Protect Ohio Values that did research on the candidate's behalf.",
    "As if all that weren't enough, the researchers found major issues with the nonprofit Vance founded called Our Ohio Renewal that was aimed at curbing opioid addiction.",
    "The book notes that the house \"sits on six parcels of land and includes a carriage house, pool, and pool house  all of which sits on an arboretum-like 3 acres.'\"",
    "MAGA Ohio Senate candidate J.D."
  ]
}