{
  "id": 5745,
  "mediaId": 129,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "In Arizona, a Swing State Swings to the Far Right",
  "image": "https://static01.nyt.com/images/2022/04/08/us/politics/00pol-arizona-Kari/merlin_205043214_4a5b2cc5-6954-483b-93b1-6133a902debb-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/05/us/politics/arizona-midterms-swing.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "We need some people with a backbone to stand up for this country  we had our election stolen,? Ms. Lake said in an interview after the Cochise County event in March, adding, I dont know if its a winning issue, but its a winning issue when it comes to saving this country.?\nRepublicans in many states have grown increasingly tired of the Stop the Steal movement and the push by Mr. Trump to reward election deniers and punish those who accept President Bidens victory.",
    "I think people at home have caught on, and I dont think a lot of our candidates have caught on.?\nTwo forces have helped ensure election denialism remains a core issue in Arizona: the Republican-sponsored and widely derided review of the presidential vote in the states largest county, and Mr. Trumps continued attacks on the Republican governor, Doug Ducey, for rebuffing his efforts to block election certification.",
    "Minutes into her pitch at the Cochise County Republican headquarters in the suburbs of southern Arizona, Ms. Lake zeroed in on the presidential election 18 months ago, calling it crooked? and corrupt.? She claimed nearly a dozen times in a single hour that the 2020 election was stolen from Donald J. Trump, a falsehood that the audience  some of whom wore red hats reading Trump Won?  was eager to hear.",
    "Ms. Taylor Robson has not made the 2020 election the major focus of her campaign, but when asked whether she considered Mr. Biden the fairly elected president, she responded in a statement, Joe Biden may be the president, but the election definitely wasnt fair.?\nMs. Lake says Arizona should finish the border wall that Mr. Trump began building.",
    "Ms. Lake, who quit her job as an anchor for the local Fox News station because of what she called its bias and dishonesty, frequently blasts the media as brainwashed,? immoral? and the enemy of the people.? And her widespread name recognition has helped give her an early lead in the polls.",
    "More than three dozen Republicans running for office in Arizona  including six candidates for statewide posts  have made denying the 2020 results a centerpiece of their campaigns, according to two groups tracking candidates, States United Action and Pro-Democracy Republicans.",
    "Ms. Davis, a medical aide, said she recently moved from the Phoenix suburbs to Cochise Countys Sierra Vista, a rural section of southern Arizona, to be with more like-minded people.?\nNumerous courts and reviews have found no evidence of widespread fraud in the 2020 election.",
    "Even Mr. Ducey, who was formally censured by the state Republican Party last year for his handling of the coronavirus pandemic, has acknowledged the energy on the states hard-right, signing a bill that will require proof of citizenship to vote in federal elections.",
    "Mark Brnovich, the Arizona attorney general who is now running for U.S. Senate, has faced repeated criticism from other Republicans, including Ms. Lake and Mr. Trump, and accusations that he is dragging out the investigation into the presidential election.",
    "Representative Paul Gosar and State Senator Wendy Rogers both spoke at the America First Political Action Conference, a group with strong ties to white nationalists, and both were censured by their legislative bodies for their violent rhetoric and antics.",
    "Some Republicans believe that while focusing on 2020 is both irresponsible and politically unwise, it may not matter in Arizona, where the presidents approval rating is now at its lowest since he took office, a dive largely driven by independent voters.",
    "The former Maricopa County sheriff, Joe Arpaio, made national headlines in the early 2000s for his anti-immigrant policies, and in 2010 the Legislature passed what became known as the show me your papers? law, effectively legalizing racial profiling.",
    "But in the last four years, voters have elected two Democratic senators and chosen a Democrat for president for the first time in more than two decades, though Republicans remain in control of the State Legislature and the governors mansion.",
    "Because they wont even cover the biggest story out there: the rigged election of 2020.? She also touts her endorsement from the chief executive of MyPillow, Mike Lindell, a key financier of right-wing efforts to discredit the 2020 election.",
    "But 12 weeks before its Republican primary in August, Arizona shows just how firm of a grasp Mr. Trump and his election conspiracy theories still have at every level of the party, from local activists to top statewide candidates.",
    "The Republican-ordered review by Cyber Ninjas, a now-defunct company with no previous experience in elections, concluded that there had actually been even more votes for Mr. Biden and even fewer for Mr. Trump in Maricopa County.",
    "In interviews with more than a dozen voters at Ms. Lakes campaign events, nearly all said election integrity? was their top issue, and none believed that Mr. Biden was the legitimate winner of the presidential election.",
    "She has emphasized her ties to the former president, appearing with him at his rally in the state earlier this year, fund-raising with him at his Mar-a-Lago club in Florida and including his name on her campaign signs.",
    "Ms. Lake and other candidates like her may have already hit a ceiling even among primary voters, as polls show many voters remain undecided, and there is evidence of growing support for other candidates.",
    "Vance, the Hillbilly Elegy? author who received the former presidents endorsement in the Republican primary for an Ohio Senate seat, shows that loyalty to Trumpism goes a long way in battleground states.",
    "We need strong Republicans to get rid of the RINOs who arent willing to do anything, like our governor,? said Claribeth Davis, 62, using the acronym for Republicans in name only? to refer to Mr. Ducey.",
    "Anybody who is still re-litigating 2020 will lose the general election,? said Kathy Petsas, a Republican who has served as a precinct captain and collected signatures for several candidates this year.",
    "Theres nothing but elitists in charge,? said Suzanne Jenkins, a 75-year-old retiree who described herself as a Tea Party Republican and who drove about an hour to Sierra Vista to hear Ms. Lake speak.",
    "Even as Senator John McCain fashioned himself into a moderate maverick, the state was a hotbed of conservative anti-immigration politics that helped give rise to Mr. Trumps candidacy and presidency.",
    "Ms. Lake, a former local Fox News anchor who won Mr. Trumps endorsement as she campaigns to become Arizonas next governor, calls the 2020 election a key motivation in her decision to enter the race.",
    "Ms. Lake has made conspiracy theories a centerpiece of her campaign  releasing a television ad that told viewers that if they were watching the ad, they were in the middle of a fake news? program.",
    "I dont know who has the stature to say, Lets bring this party back, bring the establishment base back into power. Now were a purple state and we dont have a John McCain to try to crack the whip.?",
    "Already, the race to replace Mr. Ducey, who cannot run again because of term limits, has become among the most expensive governors races in state history, with $13.6 million in spending so far.",
    "When reporters asked about his support for Ms. Rogers, Mr. Ducey said that shes still better than her opponent,? a Democrat, though he later applauded the Legislatures vote to censure her.",
    "Ron Watkins, who is widely believed to have played a major role in writing the anonymous posts that helped spur the pro-Trump conspiracy theory known as QAnon, is running for Congress.",
    "I am concerned that if these people get elected it will make another decade of craziness,? said Bob Worsley, a former state senator who describes himself as a moderate Republican.",
    "From first-time candidates to incumbents in Congress and the State Legislature, many Republicans in Arizona have increasingly embraced an extremist brand of right-wing politics.",
    "At a time when Mr. Bidens approval ratings are sinking, leaders in the party are urging candidates to focus instead on the economy, inflation and other kitchen-table issues.",
    "Still, some establishment Republicans worry that party leaders have gone too far and are effectively handing the closely divided swing state to Democrats in November.",
    "Bill Gates, the Republican chairman of the Maricopa County Board of Supervisors, who has repeatedly defended the states 2020 election, has received death threats.",
    "Ms. Rogers and State Representative Mark Finchem, a Republican who is running for secretary of state, have acknowledged ties to the Oath Keepers militia group.",
    "Ms. Lake faces especially fierce opposition from Karrin Taylor Robson, a Phoenix-based business owner who has contributed millions to her own campaign.",
    "Vances Rise: The author of Hillbilly Elegy? owes his ascendant political career in large part to Donald J. Trump, whose style he has tried to emulate.",
    "Because independent and third-party voters make up roughly 34 percent of the electorate, it is impossible to win the state with Republicans alone.",
    "There has been little political upside for moderate and more establishment Republicans in Arizona to speak out against the partys far-right wing.",
    "States United Action is nonpartisan; Maricopa Countys top elections official, a Republican, began Pro-Democracy Republicans earlier this year.",
    "But none of that has tamped down the fervent belief among many Republicans that control of the country has been snatched away from them.",
    "Winners and Losers: A progressive challenger was defeated (again) in Ohio, and a Trump-endorsed Pence (not that one) won in Indiana.",
    "Instead, the handful of them who have done so have faced protests, censure from local Republican organizations and harassment.",
    "Senate primary was a strong affirmation of the former president's continued dominance of the Republican Party.",
    "Theres not enough pushback,? said State Senator Paul Boyer, a Republican who is not running for re-election.",
    "Jim Lamon, a Republican running for U.S. Senate, falsely claimed to be an elector for Arizona last year.",
    "But even among those candidates, almost none have offered a full-throated defense of the 2020 election.",
    "A few Republican candidates have made the economy and immigration the focus of their campaign.",
    "Mr. McCains name is now invoked as an insult by conservative Republicans, including Ms. Lake.",
    "Because everyone is afraid of a primary.?\nFor generations, Arizona was a reliably red state.",
    "It was later struck down, and Mr. Arpaio is now running for mayor in a Phoenix suburb.",
    "Ohio Takeaways: It was a good night for Mr. Trump, and not just because of Mr. Vance.",
    "Arizona has long been a source of right-wing enthusiasm for the national party.",
    "The countys board of supervisors rebutted nearly all of the groups claims.",
    "SIERRA VISTA, Ariz.  Kari Lake has a strategy to get elected in 2022.",
    "But winning the crowded Republican primary is far from certain.",
    "You know how to know its fake?? she says to the camera.",
    "These were some of the key results.",
    "And this weeks victory for J.D.",
    "Vances win in Ohios G.O.P.",
    "Keep talking about 2020.",
    "Trumps Grip: J.D.",
    "Heres why."
  ]
}