{
  "id": 5748,
  "mediaId": 43,
  "date": "d2022-05-05T00:00",
  "headline": "The Downballot: Why progressives must build state power (transcript)",
  "image": "https://images.dailykos.com/images/1065283/story_image/GettyImages-1228670485.jpeg?1651539078",
  "link": "https://www.dailykos.com/story/2022/5/5/2096055/-The-Downballot-Why-progressives-must-build-state-power-transcript",
  "sentiment": "0.606",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    648,
    781,
    946,
    1801,
    2027,
    2186,
    2524,
    3103,
    4766,
    571
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWhy progressives must build state power, with Gaby Goldstein\nThe Downballot\nFollowShare\n0:0055:29\n15301xMay 05, 2022\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nThis week's dreadful news that the Supreme Court is poised to strike down Roe v. Wade underscores more than ever why progressives must build power at the state level.",
    "The Downballot hosts Gaby Goldstein, the co-founder of Sister District, to discuss what Democrats in the states are doing to protect abortion rights; how her organization helps connect volunteers with worthy legislative candidates across the country; and the advice she's giving campaigns on how to succeed in a difficult political environment.",
    "In order for us to move past this aversion to state power that progressives have, we can instead understand that state and federal power are interdependent... they're both important... and embrace state power, state power building, as a really important part of the progressive project, which is not something that we have done in the past.",
    "We help set up the phone bank links and we work with the campaigns on setting up canvassing launches and all of that so that it's really turnkey for both the candidates who just have one point of contact with us for the most part and for our teams who also just have primarily one point of contact with their Sister District organizer.",
    "The new map has not come out, but given how the nonpartisan maps that have been looked at from different folks as possibilities, there's a good chance that his seat will be anywhere from a tough race to an almost impossible race, depending on where exactly his district, which sort of straddles north of New York City into upstate...",
    "Again, we're not flipping those chambers this year, but critically important, especially in Wisconsin, given what's happened with the Supreme Court shenanigans and the terrible, devastating maps that we've ended up with in the legislature, where going to be teetering on the precipice of a super-minority for the foreseeable future.",
    "That changed this week though because Hochul succeeded in pressuring the legislature into passing a law midstream in the middle of his election that is really designed to benefit her that adds a new category of candidates who can remove themselves from the ballot and that, whoa, lo and behold, is anyone is charged with a crime.",
    "David Nir:\nOne final story we would like to talk about this week does not concern Tuesday's primaries, but rather involves the state of New York, which has been without a lieutenant governor ever since the previous incumbent, Democrat Brian Benjamin, resigned after prosecutors charged him with bribery last month.",
    "For folks who haven't been following along with bated breath every machination of politics in Virginia, Democrats went into the election last year with control of all threetrifecta controlof the governor's mansion and both chambers, and we came out with control of just one of those three, the one that wasn't up.",
    "They're they know how important they are as a critical firewall against so much regressive policy and also, as I said before, that they are the gatekeepers of a resonant, positive future for their constituents in ways in which their constituent's lives can be better and will be better when they're in office.",
    "So you can have awkward situations where candidates who don't particularly like one another wind up winning separate primaries and then get stuck together in what's often been called a shotgun wedding.? Hochul faces a couple of opponents herself in the Democratic primary and polls show her handedly winning.",
    "The dirtier your list is, the lower your effectiveness of your postcard writing campaign because you're going to reach... You're either going to get a lot of postcards that end up nowhere because there's literally no one home or you're reaching people who are not going to agree with us in the first place.",
    "We've very proud to say that we've won numerous Analyst Institute research awards for our work and many of them have involved just this type of voter or volunteer engagement research, where we run randomized control trials to see what tactics work and, importantly, in what context those tactics may work.",
    "Obviously, it was already looking like a difficult year, but when a young, rising up-and-comer like Antonio Delgado, who really was one of the most talented candidates of 2018, decides that he would rather be anywhere but the House... and being lieutenant governor New York is a notoriously weak position.",
    "You can have a state legislative candidate come to your volunteer phone bank or come to your fundraiser.... Zoom in or even, in many cases, come to New York City for a fundraiser, et cetera... in a way that you wouldn't be able to for a Senate candidate or a presidential candidate, something like that.",
    "Her previously pretty safe Democratic seat was turned into a 51-48 Trump district thanks to the Ohio GOP'salmost certainly unconstitutional per their own state constitutiongerrymander that they're going to use anyway because they just sort of ran out the clock on using the map for 2022.",
    "So I think he looked at that, saw this opportunity, and was like, I can definitely just sit around as the lieutenant governor and then figure out where to go next from there. But I totally agree with you that there is a real risk that he loses the primary and then he's out of luck.",
    "His decision to leave the House may have a lot more to do with the very uncertain future of his individual district as opposed to Democrat's fortunes overall, but it really is still a bummer either way to see one of these leading lights of 2018 decide to call it quits.",
    "Gaby Goldstein:\nOnce we get through that first cut, which is, what are the chambers that we're interested in for the year... and I know we'll talk about this year's chambers a little later... then it comes down to, okay, well, what are the seats that are competitive?",
    "It concerns what I think is one of the most beloved activities particularly by online folks who may be a little bit more introverted, don't necessarily want to knock doors or cold call people, and that is sending postcards to potential voters in targeted races.",
    "And so when you're working with these campaigns, when the organizers on staff are advising these campaigns, how are you talking to them about how to run in a campaign in this sort of cycle that's expected to have that out party enthusiasm problem?",
    "I often have thought that it's crazy how New York's ballot works and is so incredibly restrictive in terms of letting people take their names off the ballot months before they would appear, so I think reforming that is a reasonable thing to do.",
    "Ryan already has released an attack ad going after Vance for leaving Ohio and getting rich from companies who benefit globalization as well as having this celebrity figure who wrote a book and has attended a lot of Washington cocktail parties.",
    "The idea was what if we were able to sister up teams of volunteers somewhere to direct some of the energy and resources that they have toward strategic, winnable, state legislative races somewhere else where we could really make a big impact?",
    "Gaby Goldstein:\nSo this year, the chambers that we think Democrats have an opportunity to compete for a majority... that's not to say we're going to be flipping all these chambers, but we have the chance to compete... includes Pennsylvania.",
    "I'm talking, of course, about the leak of the Supreme Court opinion indicating that the court is almost certainly going to do away with the right to an abortion by overturning Roe v. Wade and how that is going to impact elections in 2022.",
    "David Beard:\nThe most revealing thing that I saw about this race was that Representative Alexandria Ocasio-Cortez waited until Monday evening, literally just before polls opened, to put out an email and officially endorse Turner.",
    "But in a race where there was never really a clear frontrunner, Trump's late endorsement that took place a couple of weeks ago was enough to sort of launch Vance into the lead, which the lead ended up being, of course, just 31%.",
    "We tend to see larger effects for postcarding in primaries and in special elections, which are quieter political environments where voters are not getting hit by thousands of ads and hundreds of phone calls and all the things.",
    "We hatched this idea: God, wouldn't it be great if we could redirect some of the energy and the resources from here in the Bay Area to another place in the country or even in the state where we could have a really big impact?",
    "Eviscerating federal civil rights and regressing us back to an era of forced birth are the culmination of a literal century of strategic power building on the right, which has at its very core the expansion of state power.",
    "It's very much a \"don't call us, we'll call you\" approach, where we do a lot of our research in advance and then we only reach out to candidates who we are interested in speaking with to initiate the endorsement process.",
    "It's pretty clear, by the way that this happened, that she was not a believer in Turner winning this race and really only endorsed her because she felt like she had to and did it in the really least helpful way possible.",
    "David Nir:\nSo Benjamin was actually stuck on the ballot because New York law makes it almost impossible for candidates to get off the ballot unless they die or move out of state or are nominated for some other office.",
    "The goal or the hope there being that it's an introductory point to a ladder of engagement where the volunteer will then do some phone banking and maybe then go canvassing and get more embedded into the idea of field.",
    "I know one thing that you have done is you've put together a number of research studies on the effectiveness of various campaign activities that either campaigns themselves or volunteers or outsiders might engage in.",
    "David Nir:\nComing up in just a moment, we are going to be talking with Gaby Goldstein, a co-founder and senior vice president of Sister District, an organization devoted to increasing progressive power in the states.",
    "The Reproductive Freedom Defense Act that expands the number of medical professionals that can perform abortion services and has a claw back provision to protect Connecticut doctors from lawsuits in other states.",
    "David Nir:\nNow, let me preface this by explaining that, in New York, candidates for governor and lieutenant governor run in separate primaries, but on a single ticket together in the November general election.",
    "How have these campaigns reacted to the news in the early going and do Democratic candidates have any thoughts yet about how they really want to address this and bring this up on the campaign trail this year?",
    "We're also really interested in states where there have been redistricting commissions or courts or legislatures have produced maps that are, frankly, fairer for Democrats, where we have a better opportunity.",
    "The Sister District Action Network, where we run programs in political research, civic engagement, legislator support, where we work directly with legislators, and other ways to be useful in the ecosystem.",
    "Vance's come-from-behind victory in the GOP Senate race, Nina Turner's fizzled rematch with Rep. Shontel Brown, and a shock win by an openly QAnon rando in a House district Republicans are hoping to flip.",
    "So those are some of the ways that we, this year and every year, encourage our candidates to run those values forward, positive campaigns wherever possible that also have significant field components.",
    "If we see real blow back to the way that Delgado was added to the ballot, it's certainly possible that Archila, who is definitely the most progressive candidate running for LG, could wind up winning.",
    "Obviously, Ohio has become quite Republican leaning of late, so it's going to be a very tough road for Ryan to beat Vance, but he's going to obviously really go after Vance between now and November.",
    "On communicating not just in the negative, in contrast to the terrible things that are being pushed by Republicans, but, also have that positive shared values frame in communicating what we're for.",
    "We'll see that our postcard performed.... People who received our postcards voted more or had a higher likelihood to vote than people in our control condition, people who didn't receive postcards.",
    "David Nir:\nSo it was easy to imagine that this transformation due to redistricting in this safely blue district was going to give Turner a boost, but that's exactly the opposite of what happened.",
    "David Nir:\nWe are very excited to talk about Sister District's work today, but before we do, it really feels incumbent on us to address what is this week's... really, this year's... biggest news.",
    "David Beard:\nWe could talk about this for a long time, but we do want to get to the important work that Sister District does and all of the work that you all have been doing across the country.",
    "Meaning that, even in a good year like 2018 or 2020, we almost always see Democrats at the bottom of the ticket underperforming, getting fewer votes, than the Democrat at the top of the ticket.",
    "Yes, a Republican is in this plus 25 DPI district, but it turns out their dad and their dad's dad and their dad's dad's dad has been the mayor forever and there's no way to unseat this person.",
    "What I want to start by asking you, Gaby, is how does this upcoming decision that so many of us have dreaded for so long... How does it really interface with your mission at Sister District?",
    "David Beard:\nVance did well pretty much across the state, but particularly in the southern and eastern portions of the state, a lot of which swung sharply to the right during the Trump era.",
    "We have to have a vision of the future that is resonant, that communicates to voters how people's lives will be better when we have political power, and that are rooted in shared values.",
    "Honestly, we've run studies looking at whether sending a postcard from in the state with a local postmark increases turnout more than mailing a postcard with an out-of-state postmark.",
    "On our side, progressives have over-invested in federal strategies and power building to the exclusion of focusing, really, any significant attention on building power in our states.",
    "Again, similar to the Senate race, where it was pretty tightly packed between three candidates but one had a notable enough lead that it didn't end up being super narrow in the end.",
    "From abortion access to free and fair elections, states are growing in power and progressives are, in my mind, structurally and rhetorically, frankly, unprepared for this moment.",
    "And then we have organizing staff at our organization that essentially runs interference with the campaigns so that their main point of contact is us rather than our volunteers.",
    "Dolan, who took a bit more moderate direction... more of an anti-Trump direction than real moderation... but he did well in the urban areas, particularly Columbus and Cleveland.",
    "For instance, we've run postcarding experiments to increase voter registration, which is a different type of outcome than looking to use a postcard to increase voter turnout.",
    "So, on the one hand, maybe that looks like Trump's influence is not so great, but really with the exception of Dolan, every single candidate had courted Trump's endorsement.",
    "I guess you could call it a concession speech... started rattling off a list of familiar early primary states as if to suggest that she's going to primary Joe Biden in 2024.",
    "Sister District was created in the wake of the 2016 elections as so many of us were looking for a way to respond to Trump's election and everything that happened that year.",
    "But Hochul was his lieutenant governor and she faced a challenge from Williams that year and she only won by about a 54-46 margin despite the fact that Cuomo was cruising.",
    "If it is published as drafted, really, puts on the chopping block a number of other individual rights that we should all be very concerned about, including contraception.",
    "And then we are talking to Gaby Goldstein, a co-founder of Sister District, an organization devoted to increasing progressive power at the state level across the country.",
    "But one of the first things to go right for her is having Majewski instead of a state rep or state senator, who she can really paint as very far outside the mainstream.",
    "David Nir:\nThough, of course, we have said this before and we will say it again, winding up with a totally loony tunes opponent is by no means a guarantee of success.",
    "It is the thing that will help you the most over anything else that you can get because, overwhelmingly, most Republican primary voters still like and support Trump.",
    "And, oh, this legislation also allows a special committee of Democratic party leaders to name a replacement candidate for someone who drops off the ballot this way.",
    "Gaby Goldstein:\nWhile we started the organization with this political goal of electing Dems to state legislatures, over time, the organization has grown to do more.",
    "I once referred to it as a little bit like the Harry Potter sorting hat and that, of course, was the one quote that ended up in the Wired article after all of that.",
    "Last year, there was a special election for this seat where Shontel Brown defeated former state senator Nina Turner by about five points in what was a huge upset.",
    "In the early years, it worked manually, where my co-founders and I would manually code new signups into their local teams and introduce them to the team leaders.",
    "We're looking for chambers, state legislative chambers, that we think we could flip or that give Democrats the opportunity to compete for a legislative majority.",
    "Sister District is a grassroots organization that aims to build enduring progressive power in state legislatures across the country in some very innovative ways.",
    "Getting folks to vote all the way to the bottom of the ballot where we focus, requires engaging people in actual conversations about things that matter to them.",
    "Because we treated this in brief on that previous episode, but I think that this is such a popular activity and I'd love to hear what you have to say about it.",
    "David Nir:\nGaby, speaking about field and campaign activities, you mentioned earlier about Sister District's work on other areas in the progressive ecosystem.",
    "That's often misunderstood as a referendum on the president, but it's more accurate to understand midterm performance as a reflection of out party enthusiasm.",
    "The reverse is often true, where Republicans at the bottom of the ballot, they often get just as many votes, if not more votes, than their top of the ticket.",
    "It fluctuates based on what is necessary and what our capacity is and what we see the broader political opportunities and context as being in any given year.",
    "I think that, to talk about this year, we should first take a minute to talk about the political context and the environment that we're going into this year.",
    "He doesn't really want to run for office while he's fighting off these corruption charges, so he said that he would take his name off the ballot as a result.",
    "I mean, California is one of a very small number of states in the country where Medicaid will pay for abortion at all, but California just got rid of copays.",
    "Because we hear so much about red states curbing and restricting and eliminating the right to abortion, but that's not the whole story that's going on here.",
    "Each year, we choose a set of state legislative candidates and we sister up our teams to a couple of them for hard side field and fund fundraising support.",
    "Gaby Goldstein:\nIt started as an idea, as I said, on a Facebook thread and it's grown now to an organization of over 55,000 volunteers across the country.",
    "Bought and paid for by a very strategic and focused conservative project that has always centered the idea of state power as consistent with its ideology.",
    "AOC is really the person that I see as having by far the best political instincts of folks on the left and really, really being smart about these things.",
    "That folks who thought all this money in the Biden endorsement signaled that Brown was potentially in trouble... that really wasn't the right read here.",
    "David Beard:\nTrump's endorsement is not determinative in any election, but it is definitely the single best thing you can get in any Republican primary.",
    "The way we can start building towards that narrative vision, that resonance with state power, is to lift up the great things that blue states are doing.",
    "So, really, it does feel to me that almost 80% of the vote in this primary was in fact pro-Trump, but ultimately voters had to pick just one candidate.",
    "That's a very normal thing for a president to do for members of their own party, but typically it's something only done when you face a difficult race.",
    "It's a really... We've found that, at the state legislative level, volunteers have a really high return on investment for their time and their energy.",
    "David Nir:\nObviously, this news is so fresh and we're digesting it in so many ways, but Sister District works with a lot of campaigns and candidates.",
    "David Beard:\nSecondly, my intuition is that the ruling striking down New York's congressional districts also had a big effect on Delgado's thinking.",
    "A great example of this is in Virginia last year, where the Democratic nominee for governor got 60,000 more votes than Dems running for state leg.",
    "I think it was about three or four thousand more people voted for Republicans running for state leg, than voted for their gubernatorial candidate.",
    "David Nir:\nSo, on Tuesday night, we had primaries in Ohio and Indiana and there are a few results that we are looking to recap in our weekly hits.",
    "It is pretty rare to see dissent, but it only passed the state Senate by a 33-29 vote even though Democrats have a super majority in this Senate.",
    "She's very, very likely to be the nominee, but those two opponents for governor have candidates who are running for LG that they are allied with.",
    "They're actually considering a bill to create a state abortion fund that would help people pay for abortions, including people from out of state.",
    "It doesn't portend devastation, but it's important to remember what happened in Virginia particularly as an indication of Republican enthusiasm.",
    "We're looking for chambers where Democrats have a fragile majority, where we have to hold onto that majority and not let that chamber flip red.",
    "And Mandel won a few small counties in the western part of the state and then the center of the state, but they were very small rural counties.",
    "Yes, of course, Joe Biden's ratings matter and all of that, but Republican enthusiasm will be a really critical factor in midterm performance.",
    "In what was, for a long time, a five-way race for most of the primary, it turned into a three-way race late between Vance, Mandel, and Dolan.",
    "The result is a small number of very strategic, winnable districts in very important chambers that are strategically relevant for Democrats.",
    "It is necessary for Democratic candidates to talk about this issue because it really matters to voters and it will be a motivator this year.",
    "Governor Kathy Hochul named a new lieutenant governor to that empty spot and it was, at least to me, quite a surprise, the person she named.",
    "Places where there are competitive up ballot races that have critical implications for, frankly, the future of our democracy in '22 and '24.",
    "David Beard:\nThis is a really complicated story where there's a lot of different things going on, so I want to just address a few of them.",
    "Then, of course, we go through that process and, at the very end, is the Harry Potter sorting hat between the candidates and the teams.",
    "Vance spent most of the primary behind, lagging the leaders, and he was really propped up by a super PAC from mega donor, Peter Thiel.",
    "Gaby Goldstein:\nA beloved progressive messaging strategist, who, if you don't know her, highly recommend having her come on your show.",
    "We would be extremely grateful if you would subscribe to The Downballot on Apple Podcasts and leave us a five star rating and review.",
    "So it really requires both the data and the conversations with people on the ground to really understand where our opportunities are.",
    "In the gerrymandered map, he had a pretty safe seat and was a good bet to be able to hold it probably for the decade if he wanted to.",
    "In fact, I would say we are averse.... Progressives are averse to the idea of state power, which is really unnecessary and crippling.",
    "So now, when you go to sisterdistrict.com and you sign up based on your zip code, you'll be automatically routed to your local team.",
    "That are reflected in the policies that we're interested in but that, again, go to the fabric of who we are and what we care about.",
    "And so what she always says is that we... progressives... We can't just be against the terrible things that Republicans are doing.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Take the time, figure out what's a smart way to let people take their names off the ballot, and then pass new laws around that.",
    "After Benjamin was arrested, a number of progressive leaders decided to rally around another candidate for lieutenant governor.",
    "We always try to endorse only as many candidates as we feel we can provide a relatively even level of support among our teams.",
    "I'm very worried that Nevada is this year's Virginia if we think that Nevada is safe, which many people thought Virginia was.",
    "So important to remember at the outset that there are two outcomes that we care about if you care about volunteer engagement.",
    "She is, I think, just an absolutely brilliant mind when it comes to breaking down how to think about messaging and strategy.",
    "And they really take the charge in terms of organizing events, fundraisers, phone banks, all the rest, for their candidates.",
    "And then, in even years, when the majority of state legislative chambers are up for election, we'll endorse larger classes.",
    "So it's going to be really, really critical for state legislative candidates to communicate that to constituents this year.",
    "She argued that the outcome would be different this time in part because the district had changed a bunch in redistricting.",
    "Gaby Goldstein:\nAnother thing is field, right, is making sure that candidates are running good, substantive field programs.",
    "It's easier for us to detect in effect of receiving a handwritten postcard from a volunteer encouraging the voter to vote.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Conservatives have been just ruthless and consistent in building power at different levels of government and we have not.",
    "I also want to know if you could talk a bit about what blue states are doing to expand and protect the right to abortion.",
    "David Beard:\nThis is, really, a pretty unique concept among national political organizations and how they typically work.",
    "We need to have a resonant vision of the future where everyone's life is better when Democrats are in charge of states.",
    "That really just did not make me feel good about what Democrats in the House are thinking about our chances this year.",
    "Sister District endorses and supports candidates running in winnable races in flippable chambers from coast to coast.",
    "But we also are going to discuss with Gaby the enormous news and, really, shocking news that broke earlier this week.",
    "2022 is going to be a really critical year for state legislative elections and we'd love to welcome you to our work.",
    "We'll welcome you for our phone banking and canvassing, text banking, postcarding, and fundraising and all the rest.",
    "And that's one of the ways that we can fight against our seemingly natural problem or whatever with ballot roll off.",
    "Anyhow, Shontel Brown can feel pretty good about this week's results and her spot in Congress looks pretty secure.",
    "So we have a tremendous number of examples, shining lights, about the positive power of states and that's where...",
    "Gaby Goldstein:\nBut to get back to your question of what the blue states are doing, this is very, very important.",
    "But he is potentially giving up a seat in the House for what could be a very brief tenure as lieutenant governor.",
    "David Nir:\nSpeaking of the candidates, how do you decide at Sister District which candidates you want to support?",
    "David Beard:\nVance now faces Representative Tim Ryan, who easily won the Democratic nomination on the same night.",
    "Nina Turner closely associated with the Bernie Sanders campaign and raised enormous sums of money for that race.",
    "David Nir:\nThere's one Democratic primary that we want to talk about in Ohio's 11th district based in Cleveland.",
    "So there was a bit of separation between Vance and the other two, but in the scheme of things, all pretty close.",
    "David Beard:\nWhere can listeners find you and Sister District and potentially learn more about getting involved?",
    "If you haven't already, please like and subscribe to The Downballot and leave us a five star rating and review.",
    "If you havent already, please subscribe to The Downballot on Apple Podcasts or wherever you listen to podcasts.",
    "David Nir:\nOne thing I would add with Trump... You noted that Vance, who, by the way, is a venture capitalist.",
    "Though I think, as you said, Kaptur, if she could have picked her opponents, she has to pick the QAnon maniac.",
    "The chambers that we've chosen this year... We're really focused on places where we have nested opportunities.",
    "If and when you sign up, you'll be added automatically to your local teams list as well as our national list.",
    "It's a bit of an art and science in terms of how we assign candidates to teams, but there's a process there.",
    "In 2018, Andrew Cuomo faced a challenge from the left from actor Cynthia Nixon and he dispatched her easily.",
    "David Nir:\nThis legislation was actually pretty unpopular with a lot of Democrats in New York's legislature.",
    "And there's really quite a few examples that we can point to and really build towards that narrative vision.",
    "But then in an interview afterwards, she said she was considering running for a president as an independent.",
    "You've looked into this a lot and so I would just love to hear your full summary of what these findings are.",
    "I'm not saying it's going to be a terrible year, but it's not going to be 2018 in terms of our performance.",
    "Historically, that would indicate that Republicans... Now, if we all remember how Democrats felt in 2018.",
    "Often, it's just our friends in Virginia and, every four years, our friends in Louisiana and Mississippi.",
    "But Brown really came from behind by presenting herself, in many respects, as a much more loyal Democrat.",
    "But the other is that it's often, not always but at least sometimes, a nice entry point for volunteering.",
    "Co-hosts David Nir and David Beard also recap Tuesday's primaries in Ohio, including Trump-endorsed J.D.",
    "The Downballot is a weekly podcast dedicated to the many elections that take place below the presidency.",
    "Some districts look really great on paper and then you talk to people on the ground and you're like, oh.",
    "I think doing it in a specific instance because it's politically helpful to you is not the way to do it.",
    "David Nir:\nWith us today is Gaby Goldstein, the co-founder and senior vice president of Sister District.",
    "Gaby Goldstein:\nThen of course, it's a matter of who's running and understanding the candidate quality.",
    "One is of course the, I think, primary intended benefit, which is, does it help turn out the vote more?",
    "Gaby Goldstein:\nThe other thing I'd say is that sometimes we'll see statistically significant effects.",
    "So all of those sorts of factors may and do influence how effective a postcard program is going to be.",
    "I mean, just a year before, Biden had carried those... We lost four districts that were Biden plus 10.",
    "And then, on our side, we kind of don't have that deeply-rooted connection to the idea of state power.",
    "We also cast a gimlet eye at last-minute ballot shenanigans in New York State designed to benefit Gov.",
    "And in the end, Vance got 31% of the vote, Mandel got 24% of the vote, and Dolan got 23% of the vote.",
    "We need to build towards that narrative of progressive federalism that is simply lacking on our side.",
    "One thing I should note is that Delgado will not require any sort of confirmation by the legislature.",
    "Do you want to maybe highlight one or two of them as examples of the Sister District thought process?",
    "We're also going to talk about the machinations regarding New York's vacant lieutenant governorship.",
    "We really need to keep our stake in the ground in those states and invest in them for the long term.",
    "We've collaborated with a number of academics on our research and partners in progressive politics.",
    "David Nir:\nAlso, one other thing to note is that there was a lot of money spent on behalf of Brown.",
    "Certainly, historically, the party in office tends to do worse than the out party in midterm years.",
    "The odds of Kaptur winning went up, but also the odds of having a QAnon maniac in Congress went up.",
    "Congressman Antonio Delgado, who was first elected in the 2018 blue wave flipping a GOP held seat.",
    "Again, it's not a formal ticket, but they're hoping that their allied candidate will also advance.",
    "So, in Ohio, in the Senate race that we've talked about a bit before, on the Republican side, J.D.",
    "The second is does it help embed the volunteer into the organization and the idea of volunteering.",
    "And then in that sort of no chamber left behind, we have Wisconsin, Georgia, and North Carolina.",
    "How do they function, come together, work with both Sister District and their assigned campaign?",
    "We have to put a stake in the ground and build on a longer timeline towards the ability to flip.",
    "But this is something we'll have to contend with this year as well, which won't be a good year.",
    "And that of course is the leak of the expected Supreme Court ruling striking down Roe v. Wade.",
    "The legislature has passed a law that eliminates copays for abortion for Medicaid recipients.",
    "So we're always looking for these three types of chambers, but in any given year those shift.",
    "There was a real sense going into Election Day that folks were not sure who was going to win.",
    "The easiest way to do that is to just go to dailykos.com/thedownballot and click on the link.",
    "We're interested this year not just on electoral battlegrounds, but democracy battlegrounds.",
    "David Nir:\nWe are going to recap several key races that went down in Ohio on Tuesday night.",
    "Often not even coming in the top three and coming in fourth or fifth in these rural areas.",
    "I'm trained as a mixed-method social scientist, so it's both quantitative and qualitative.",
    "So we find really deep engagement between our teams and the candidates that they support.",
    "The rubber hits the road on so many issues that affect our daily life at the state level.",
    "Communicating in that values-based frame to voters about the issues that they care about.",
    "Gaby Goldstein:\nThe bottom line of it as a tactic to increase turnout is that it depends.",
    "David Beard:\nThis is definitely something that we've talked about a lot on this podcast.",
    "Certainly, will repro be the top issue for every single district all across the country?",
    "Ever since Donald Trump, progressives always have to be careful what they wish for here.",
    "Vance won the Republican primary to fill retiring Republican Senator Rob Portman's seat.",
    "The other candidates for lieutenant governor have vociferously spoken out against this.",
    "I should also add that his decision to change roles like this and to leave the House...",
    "We need to keep replicating, keep iterating the experiments that we run, and so forth.",
    "We actually talked about some of your research on a previous episode on this podcast.",
    "David Beard:\nSo now that he's won, he faces long-serving representative Marcy Kaptur.",
    "We're always looking for candidates who, who are deeply rooted in their communities.",
    "Gaby Goldstein:\nThe quality of the message can impact how effective the postcard is.",
    "They include a lot of people who have moved or have died or are not even Democrats.",
    "David Nir:\nGaby Goldstein, co-founder and senior vice president of Sister District.",
    "If there's anyone who knows the risks of this situation, well, it's Hochul herself.",
    "Activist Ana Maria Archila, who is allied with a different candidate for governor.",
    "This is, as I said, a 51-48 Trump seat, so it's going to be very tough for Kaptur.",
    "In that Republican primary, a far-right QAnon-aligned activist won the nomination.",
    "And we want to talk about it because it really turned out to be a total non-event.",
    "He won over former Ohio state treasurer, Josh Mandel and state senator Matt Dolan.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "He was largely just second best to Vance pretty much everywhere across the state.",
    "So, in the odd years, we may endorse between 15 and... 12 to 18 or 20 candidates.",
    "It is a small but mighty crew of organizations that focus on state legislatures.",
    "Not exactly a dominating victory, but there's no runoff, so that doesn't matter.",
    "It in fact now covers the entire city of Cleveland, which is Turner's hometown.",
    "He's been connected to the QAnon movement online in a number of different ways.",
    "Mostly on mail and radio ads promoting him and bashing the two state lawmakers.",
    "But the real issue here is who's going to appear on the ballot in the primary.",
    "The places where the Republicans have been literally coming for our democracy.",
    "Interestingly, the average Biden performance in those districts was over 54%.",
    "When you sign up, as I said earlier, you will be routed to your closest team.",
    "And so we have this moment where the court is poised to overturn Roe v. Wade.",
    "Gaby Goldstein:\nWhen you sign up at Sister District... Well, let me just say.",
    "Gaby Goldstein:\nEven in a good year, Democrats struggle with ballot roll off.",
    "We're heading into a pretty challenging political environment for Democrats.",
    "David Beard, I know you live in D.C. David Nir, I know you live in New York.",
    "Depending on where it ends up, it could become really, really tough to hold.",
    "The outcome that you're looking to influence may impact how effective it is.",
    "How can we be a good team player on this little but mighty state lege team?",
    "Of course, the odd years, there are many fewer state legislative elections.",
    "That's very concerning, but he benefited from outside support in this race.",
    "So I don't really understand what that list of states was supposed to mean.",
    "That's something else that we need to look at going into this environment.",
    "Anything not, quote, rooted in tradition puts a lot on the chopping block.",
    "The performance in midterms is often a reflection of out party enthusiasm.",
    "You're not going to win your state leg election by sending 35 mail pieces.",
    "The Downballot comes out every Thursday everywhere you listen to podcasts.",
    "Have a conversation and some cheese and wine over writing some postcards.",
    "No issue is the top issue in every single district in every single state.",
    "He won with about 36% of the vote versus Riedel's 31% and Gavarone's 29%.",
    "What really will drive a lot of the outcomes that we see this year is...",
    "The devil is very much in the details on when post carding is effective.",
    "Having that positive vision of the future, not just a negative contrast.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Gaby Goldstein:\nThere's some incredible work that should be celebrated.",
    "Folks who have experiences that will be beneficial to the legislature.",
    "We look at the data, historical voting information, demographic trend.",
    "Connecticut passing the strongest abortion protection in the country.",
    "And so the name Sister District comes from the idea of a sister city.",
    "She's actually the longest serving woman in the history of the House.",
    "Not normally the profile we associate with winning elections in Ohio.",
    "I think there's two ways to think about the benefits of post carding.",
    "The Drain the D.C. Swamp? PAC spent close to $400,000 on his behalf.",
    "That is Ohio's 9th district and specifically the Republican primary.",
    "Gaby Goldstein:\nAbortion access is a motivating issue for Democrats.",
    "Gaby Goldstein:\nThe number of endorsements varies from year to year.",
    "I've written about it and you've read my op-eds and given me notes.",
    "Depending on the schedule of races and the composition of chambers.",
    "Both important and both can have positive outcomes for postcarding.",
    "Also, how many do you typically support in a given election cycle?",
    "So there's one more race we want to talk about from Tuesday night.",
    "They very badly wanted to present themselves as Trumpy candidates.",
    "David Beard:\nThat's a lot to cover, so let's go ahead and dive in.",
    "We have about 150 active teams and affiliates across the country.",
    "David Nir:\nSo this is really feels like a risky move for Delgado.",
    "I'm not a huge fan of over-analyzing the results from last year.",
    "Is she planning to run in the independent primary for president?",
    "We have to be connecting the policies back to our shared values.",
    "The place that we're really focused on as a blue hold is Nevada.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Let's dig into a little bit into how these teams actually work.",
    "It's certainly possible that Delgado might not win the primary.",
    "And so, now, we're in this moment of ascendancy of state power.",
    "Our meet cute is on a Facebook thread for progressive lawyers.",
    "The inroads chambers where we don't have a one-cycle solution.",
    "There's a lot of districts... David Nir, I know you know this.",
    "It takes quite a bit of time each year, but it ends up with...",
    "David Nir:\nAnd I'm David Nir, political director of Daily Kos.",
    "Thanks to our producer, Cara Zelaya, and editor, Tim Einenkel.",
    "I'm David Beard, contributing editor for Daily Kos Elections.",
    "We saw that there was more that we could do in the ecosystem.",
    "But the beauties of technology have shined their light on us.",
    "Tell us how Sister District came to be and your role in that.",
    "And then you have one of these shotgun marriages with Hochul.",
    "David Nir:\nYou make a really good point about redistricting.",
    "Talking about all the terrible things Republicans are doing.",
    "To join a Sister District team and do something lightweight.",
    "Because of some of the factors that I mentioned and others.",
    "And then we have a lot of conversations with stakeholders.",
    "Looking at all the spreadsheets all the time on the data.",
    "And so we have a vetting process and endorsement process.",
    "We were motivated that's many Republicans feel right now.",
    "We have Colorado with the Reproductive Health Equity Act.",
    "Gaby Goldstein:\nSo we are at this moment not by accident.",
    "Thank you so much for joining us on The Downballot today.",
    "You can reach us by email at thedownballot@dailykos.com.",
    "Gaby Goldstein:\nWe at HQ make the endorsement decisions.",
    "She's going to need a lot of things to go right for her.",
    "Our first and last question is always, how can we help?",
    "And how does the Sister District staff manage all this?",
    "I can't believe we've been at this for many cycles now.",
    "So we work directly with the candidates who we support.",
    "We also provide our candidates with general consulting.",
    "And candidates who are running for state leg know that.",
    "That is New York City Public Advocate Jumaane Williams.",
    "Gaby Goldstein:\nI always it's a postmodern love story.",
    "But the decision and its reasoning are not a surprise.",
    "All of that good stuff to the extent that it's needed.",
    "Gaby Goldstein:\nSo it works pretty well on both sides.",
    "Folks who are building towards a reflective democracy.",
    "But he wasn't really able to translate that statewide.",
    "But sometimes we don't observe any detectable effects.",
    "It's a lightweight way for a volunteer to get started.",
    "So candidates really need to be focused on doing that.",
    "That's all to say it's going to be a challenging year.",
    "And so what we do a lot of is working on field plans.",
    "So in 2020, I think we endorsed around 40 candidates.",
    "That's political environment that we're heading into.",
    "We're not going to flip, but we have to make inroads.",
    "It depressed me about Democrats chances for November.",
    "We are, as you say, often in the defensive position.",
    "Gaby Goldstein:\nSo, it's a Harry Potter sorting hat.",
    "But that's how our teams get set up with candidates.",
    "David Nir:\nWhich states are you targeting this year?",
    "Democrats lost seven seats in the House in Virginia.",
    "We can't just be talking about policy all the time.",
    "Brian Benjamin, of course, played the good soldier.",
    "So even in a good year, we struggle with roll off.",
    "Majewski attended the notorious January 6th rally.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Who you're targeting can impact the effectiveness.",
    "But the reality was this wasn't a difficult race.",
    "This year, we'll probably end up around 25 or so.",
    "I actually run our (c)(4), our affiliated (c)(4).",
    "I like to think of it as no chamber left behind.",
    "The difficult climate that's expected this year.",
    "It's important to realize it was not a drumming.",
    "But there was very clear Republican enthusiasm.",
    "We can't win if we don't talk to enough voters.",
    "Every year, our political strategy is the same.",
    "Gaby Goldstein:\nOne other thing about Virginia.",
    "One cut is it depends on the type of election.",
    "As a wise woman once said, it takes a village.",
    "We don't get involved in New Jersey politics.",
    "What are your plans in that regard for 2022?",
    "David Beard:\nWe're back into primary season.",
    "What's going on in this week's episode, Nir?",
    "Gaby Goldstein:\nVolunteers love postcarding.",
    "How many lawyers do we have on this podcast?",
    "And I'm very proud of our research program.",
    "The question of efficacy is never answered.",
    "We'll be back next week with a new episode.",
    "The 9th district is centered around Toledo.",
    "Brown completely crushed Turner two to one.",
    "And then we have a third category called...",
    "So it's high-risk, high-reward in that way.",
    "Where state power is growing exponentially.",
    "Let's take a quick step back for a second.",
    "I know David Nir, we've talked about this.",
    "So we'll see if that's able to dent Vance.",
    "David Beard:\nThat's all from us this week.",
    "That's one piece is focusing on messaging.",
    "That field piece is critically important.",
    "We lost the House by less than 800 votes.",
    "We found that it did matter a little bit.",
    "Making sure that the targeting is right.",
    "Thanks to Gaby Goldstein for joining us.",
    "He did really poorly in the rural areas.",
    "We don't have any friends in New Jersey.",
    "Because my co-founders and I met online.",
    "We lost the House and the governorship.",
    "A lot of voter lists are, quote, dirty.",
    "You can find us at sisterdistrict.com.",
    "This is a short blurb about Daily Kos.",
    "They're running for state legislature.",
    "On the Republican, several thousand...",
    "The midterms when Trump was in office.",
    "I just want to give a huge shout out.",
    "Thank you for joining us today, Gaby.",
    "He won less than a third of the vote.",
    "She served on the city council there.",
    "Joe Biden specifically endorsed her.",
    "Beard, why don't you get us started?",
    "Hochul can appoint him unilaterally.",
    "Again, qualitative and quantitative.",
    "Of course, you start with the data.",
    "It's not what do you expect to see.",
    "I think this decision goes farther.",
    "Help them cut turf if they need it.",
    "It's just something to think about.",
    "Those seats might have looked safe.",
    "This has been totally fascinating.",
    "Frankly, that really depressed me.",
    "It ended up sounding very strange.",
    "Has that number changed over time?",
    "Who did they say they would name?",
    "So we help them with field plans.",
    "Places like Michigan and Arizona.",
    "Her name is Anat Shenker-Osorio.",
    "But what do lawyers like to say?",
    "And that requires conversations.",
    "It's like the Poltergeist movie.",
    "We need to go towards the light.",
    "Thank you so much for having me.",
    "Gaby Goldstein:\nYes, absolutely.",
    "First off, with the legislation.",
    "But this is a motivating issue.",
    "They all passed laws this year.",
    "How do the teams get developed?",
    "That will be an enthusiasm gap.",
    "No, actually, the Republican...",
    "So it varies from year to year.",
    "David Beard:\nHello and welcome.",
    "Does it help turn out the vote?",
    "Gaby Goldstein:\nPlease join us.",
    "Gaby Goldstein:\nThanks so much.",
    "Donate $25\n'\nDonate $10 monthly",
    "And so that's one piece of it.",
    "Equality, dignity, prosperity.",
    "But it's useful in a few ways.",
    "We had a 60,000 vote roll off.",
    "We have neglected state power.",
    "Give them advice on messaging.",
    "He beat her about two to one.",
    "It might not be a great year.",
    "So it's quite a long process.",
    "I know David Nir is a lawyer.",
    "Gaby Goldstein:\nMy pleasure.",
    "From Senate to city council.",
    "Turner decided to run again.",
    "David Beard:\nYeah, exactly.",
    "Afterward, Turner in her...",
    "Of course, Antonio Delgado.",
    "We have local team leaders.",
    "That's not going to cut it.",
    "You have to talk to people.",
    "Both chambers in Michigan.",
    "Science is always ongoing.",
    "California, my home state.",
    "His name is J.R. Majewski.",
    "So we have to watch that.",
    "For a variety of reasons.",
    "I don't know David Beard.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "One of course is voting.",
    "For some of the factors.",
    "The values that root us.",
    "Because again, remember.",
    "Wisconsin, Pennsylvania.",
    "At least we haven't yet.",
    "We'll see how things go.",
    "Let's not hide the ball.",
    "It's a different state.",
    "New Jersey, Washington.",
    "This is not accidental.",
    "Perhaps he will cruise.",
    "Gaby Goldstein:\nAnyway.",
    "We're excited about it.",
    "The Pennsylvania House.",
    "That's the bottom line.",
    "Arizona, both chambers.",
    "Daily Kos is different.",
    "The state legislature.",
    "So this is a question.",
    "David Beard:\nFor sure.",
    "Decades in the making.",
    "It's a different year.",
    "Sort of this alchemy.",
    "How can we fill them?",
    "And here's the thing.",
    "We lost all of those.",
    "We lost seven seats.",
    "Please stay with us.",
    "Let's just be clear.",
    "Shocking, of course.",
    "Gaby Goldstein:\nYes.",
    "Where are the gaps?",
    "And that's science.",
    "We've only got two.",
    "It takes a village.",
    "Our eyes are open.",
    "All of that stuff.",
    "Different context.",
    "Perhaps I'm wrong.",
    "David Beard:\nYeah.",
    "David Beard:\nSure.",
    "We were fired up.",
    "And that's great.",
    "No, I'm kidding.",
    "It's unexpected.",
    "This leak is...",
    "Media training.",
    "Not the Senate.",
    "Happy to be on.",
    "Please read it.",
    "Of course not.",
    "We were angry.",
    "She won 66-34.",
    "Kathy Hochul.",
    "Fairly small.",
    "I'm a lawyer.",
    "We're ready.",
    "All of that.",
    "We see this.",
    "All of that.",
    "Blue flips.",
    "The Senate.",
    "It depends.",
    "Michigan.",
    "It's not.",
    "Quieter.",
    "Results.",
    "Nope?",
    "Darn.",
    "No."
  ]
}