{
  "id": 5749,
  "mediaId": 323,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Powell Puts Volcker on Hold",
  "image": "https://images.wsj.net/im-538039?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/jerome-powell-puts-paul-volcker-on-hold-federal-reserve-interest-rates-inflation-11651702723",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Editorial Board",
  "authorUrl": "https://www.wsj.com/news/author/editorial-board",
  "termIds": [
    781,
    886,
    1147,
    1801,
    3103,
    4219,
    4396,
    156,
    187,
    3669,
    2845
  ],
  "sentences": [
    "Plus, as the rhetoric around Roe v. Wade heats up, should the Supreme Court expedite its official ruling, instead of doing business as usual?Read Transcript\nAD\nLoading advertisement...\n00:00\n1x\nSubscribe\nApple Podcasts\nGoogle Podcasts\nSpotify\niHeartRadio\nTuneIn\nStitcher\nAmazon Alexa\nRSS\nThe Federal Open Market Committee raised its target fed funds rate by 50 basis points, as expected.",
    "Photo: Liu Jie/Zuma Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (3 minutes)\nAD\nLoading advertisement...\n00:00 / 02:43\n1x\nThis article is in your queue.",
    "Open Queue\nFederal Reserve Chairman Jerome Powell has taken of late to praising legendary Chairman Paul Volcker, as a signal of his new inflation-fighting determination.",
    "Mr. Powell further contributed to the good cheer by saying the economy remains strong, blowing past the first quarter decline in gross domestic product.",
    "Paul Volcker was a subtle central banker, but one lesson from his career is that when the Fed decides to break inflation, better to go ahead and do it.",
    "But Mr. Powell put Tall Paul on hold on Wednesday as he walked back some of the hawkishness that he and his colleagues have exhibited in recent weeks.",
    "Yet Democratic candidate Rep. Tim Ryan, in contrast to others in his party, doesn't seem to think that running against Trumpism is a winning strategy.",
    "Vance wins the Republican nomination for U.S. Senate in Ohio, showing that President Trump's endorsement still has weight for GOP voters.",
    "The history of rapid inflation is that it takes a fed funds rate that is higher than the pace of price increases to break inflation.",
    "If Mr. Powell is right that inflation is about to head downward, and perhaps rapidly, then his slow pace of tightening may pay off.",
    "Even if the Fed follows with a pair of 50 basis point increases at its next two meetings, real interest rates will remain negative.",
    "WSJ Opinion: Will the Democrats Do a Deal With Joe Manchin?Play video: WSJ Opinion: Will the Democrats Do a Deal With Joe Manchin?",
    "But the news is that Mr. Powell signaled the Fed may not need to be as aggressive to counter inflation as markets had thought.",
    "And he signaled a slower pace of decline in the Feds bond portfolioaka, quantitative tighteningcompared to previous hints.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nOpinion: Potomac Watch\nDoes Ohio Show Trump's Midterm Power?",
    "Images: Shutterstock/Zuma Press Composite: Mark Kelly\nCopyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "The question is whether this leisurely pace of monetary tightening is sufficient to reduce inflation.",
    "But if inflation stays doggedly high, he is storing up tougher tightening decisions down the road.",
    "Mr. Powell also continued to put the blame for inflation on other factors than monetary policy.",
    "The one thing he and the Fed dont want to concede is that the central bank is largely to blame.",
    "He said he doesnt see signs of a wage-price spiral? that would embed inflation expectations.",
    "Federal Reserve Chair Jerome Powell attends a press conference in Washington, D.C., May 4.",
    "0:00 / 6:06\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "He said there are signs that inflation in the Feds favorite price index has peaked.",
    "Monetary policy remains remarkably loose, with a fed funds rate pegged to 0.75%-1%.",
    "Journal Editorial Report: The party starts its long uphill climb to the midterms.",
    "He all but took a 75-basis-point increase at a future meeting off the table.",
    "At least for a day, investors were discounting fears of recession.",
    "The markets loved what they heard and bid up equities and bonds.",
    "Skip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Not long ago the culprit was the pandemic and supply chains.",
    "WSJ Opinion: Will the Democrats Do a Deal With Joe Manchin?",
    "Now its the war in Ukraine and Chinas Covid lockdowns.",
    "Your browser does not support HTML5 video.",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Stock indexes rose by about 3%.",
    "There is reason to wonder.",
    "Waiting makes it worse.",
    "J.D."
  ]
}