{
  "id": 5753,
  "mediaId": 233,
  "date": "d2022-05-04T22:18",
  "headline": "Trickle-down creeponomics: Gaetz calls women protesting Roe draft opinion over-educated",
  "image": "https://www.gannett-cdn.com/presto/2021/07/07/USAT/10541de0-a8aa-433c-8715-6672c2ba1cd8-GettyImages-1311711120.jpg?crop=2999,1687,x0,y186&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/opinion/columnist/2022/05/04/matt-gaetz-roe-twitter-over-educated-women/9646231002/",
  "sentiment": "0.415",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rex Huppke",
  "authorUrl": "https://www.usatoday.com/staff/6878775001/rex-huppke/",
  "termIds": [
    1147,
    1527,
    1577,
    1801,
    3103,
    415,
    428,
    482,
    2661,
    2945
  ],
  "sentences": [
    "On Tuesday, U.S. Rep. Matt Gaetz of Florida, a far-right marionette who dreams of one day becoming a real boy, posted one perfectly horrible tweet that answered that question: How many of the women rallying against overturning Roe are over-educated, under-loved millennials who sadly return from protests to a lonely microwave dinner with their cats, and no bumble matches??\nIf you used artificial intelligence (something Gaetz has plenty of) to create the singularly worst, most sexist, misogynistic, dated, dumb and disgusting tweet imaginable, it wouldnt come close to topping that.",
    "Just last year, Vance went on a sexist rant about Democratic women, name-checking Vice President Kamala Harris and Rep. Alexandria Ocasio-Cortez, and saying on Fox News: Were effectively run in this country, via the Democrats, via our corporate oligarchs, by a bunch of childless cat ladies who are miserable at their own lives and the choices that theyve made.?\n'Stench' at the Supreme Court:Politically motivated leak over abortion shatters innocence\nWhats with oafish Republicans and cats?",
    "When supporters of former one-term, twice-impeached President Donald Trump attack the U.S. Capitol building because their guy lost the election, its legitimate political discourse.? When a powerful woman speaks out about women having a right to bodily autonomy, its unhinged? and petulant.?\n'Grab 'em by the ...'\nThis all makes sense when you consider that Trump remains the head of the Republican Party.",
    "Trump's divisiveness was worth the price to secure what may be the end of Roe v. Wade\nTrumps ability to write those comments off as locker room talk? paved the way for people like Gaetz to tweet about over-educated? women using language like under-loved millennials who sadly return from protests to a lonely microwave dinner with their cats, and no bumble matches.?\nIts trickle-down creeponomics.",
    "Its the kind of misogyny behind a potential decision to destroy the reproductive rights of American women, a decision that will come from a court tilted to the far right by three justices picked by the aforementioned grab 'em by the? you-know guy and a coterie of stern-faced men in Congress who wouldnt bristle at Gaetzs tweet because, to them, it probably sounds about right.",
    "There are some of us here in the previously United States of America who read the leaked Supreme Court decision draft that could signal the end of abortion rights and thought, angrily: Why do so many powerful men feel entitled to decide what rights women have over their own bodies?",
    "Im glad he spoke his feeble mind, because it shows us whats driving the push to overturn Roe v. Wade and, in many Republican-controlled states, eviscerate womens reproductive rights: sexism, plain and simple.",
    "The attempt to end a constitutional right in place for decades, a law still supported by strong majorities of Americans  by men and women of both parties  will be cloaked in morality, some of it sincere.",
    "'Toxic masculinity' comes to life\nGaetzs tweet is a turducken of tired tropes served up by a beloved-in-MAGA-circles congressman who is what you get when the term toxic masculinity? comes to life.",
    "Im glad Matt Gaetz spoke his feeble mind because it shows whats driving the push to overturn Roe v. Wade and, in many Republican-controlled states, end womens reproductive rights: sexism.",
    "Columnist Rex Huppke:Marjorie Taylor Greene's Bible must be a lot different from my version filled with compassion\nWomen, to people like Gaetz, are objects to be subjugated.",
    "Reading between the lines of his tweet, these overeducated gals (Im assuming he likes to use words like gals,? maybe occasionally broads?) are simply pining for a good man.",
    "But if you want to know whats really driving this bus off the cliff, look no further than the congressman from Floridas derpy yet strikingly revelatory tweet.",
    "A new Politico/Morning Consult poll found that 57% of voters want the Supreme Court to uphold abortion rights and that only 28% hope it strikes Roe down.",
    "(The congressman is being investigated by the Department of Justice over allegations he engaged in sex trafficking and had sex with an underage girl.",
    "When leftists don't get their way, they howl at the moon, let go primal screams, threaten & arrogantly take umbrage at not getting their way.",
    "Mike Huckabee retweeted a video of Democratic Sen. Elizabeth Warren speaking passionately about the possibility of Roe being overturned.",
    "A 2021 Quinnipiac poll showed that even 39% of Republican voters say abortion should be legal in all or most cases.",
    "Gaetz sees women, at least those who disagree with his worldview, as having too much education for their own good.",
    "Columnist Suzette Hackney:If you truly value life, you'll ensure a healthy future for all 'saved' babies, right?",
    "The guy who was caught on tape saying: Im automatically attracted to beautiful  I just start kissing them.",
    "Subscribe now to make sure you're able to read more columns from him and other USA TODAY columnists.",
    "Loutishness, for many in the Republican Party, has become a feature, not a bug.",
    "It's how petulant spoiled brats act who never learned to play well w/ others.",
    "Gaetz hasnt been charged with a crime and denies any wrongdoing.)",
    "On Wednesday, Fox News contributor and former Arkansas Gov.",
    "Grab em by the ? You know how the rest goes.",
    "This column from Rex Huppke is free to read.",
    "And when youre a star, they let you do it.",
    "Vance won the GOP senate primary in Ohio.",
    "Other right-wing oafs\nOn Tuesday, J.D.",
    "Still, Im glad he posted that tweet.",
    "He added this comment: Unhinged.",
    "The hysterical woman? groaner.",
    "Its sexism, plain and simple.",
    "#lizblowsgasket?\nAh, yes.",
    "Gaetz campaigned for him.",
    "You can do anything.",
    "Legacy of abortion?",
    "Overeducated women?",
    "Its like a magnet.",
    "Lonely for a man?",
    "I dont even wait.",
    "Just kiss.",
    "Cats?"
  ]
}