{
  "id": 5757,
  "mediaId": 65,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Media pushes narrative that leaked Roe v. Wade draft could be midterm game-changer",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/c6c1306a-a4aa-4f8a-957f-14a2bbe27441/a9f11c25-9432-4c2a-934b-23f214cbfb14/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/abortion-roe-wade-midterms-media",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Rutz",
  "authorUrl": "https://www.foxnews.com/person/r/david-rutz",
  "termIds": [
    3103
  ],
  "sentences": [
    "Other headlines included Bloomberg's \"Abortion Rights Could Rewire U.S. Midterms,\" CBS News' \"Democrats call for action, Republicans voice support as leaked Supreme Court draft opinion on Roe v. Wade sets stage for 2022 midterms,\" and The Guardian's \"Abortion to become key fight in US midterms after stunning court leak,\" which reported, \"now abortion rights promises to reshape the dynamics of the coming midterm elections.\"",
    "\"The disclosure of a draft majority opinion that indicates the Supreme Court has voted to overturn Roe v. Wade instantly jolted Democrats from a bout of political malaise Monday night  and many hope it could change the tide of the midterm elections,\" reported Politico, the same outlet that reported on the bombshell leak of the Supreme Court's draft opinion.",
    "AP REPORTER MOCKS FOUNDING FATHERS OVER POSSIBLE END TO ROE V. WADE: WISH WE HAD SOME FOUNDING MOTHERS\nOn MSNBC, host Katy Tur railed against the news at the top of her dayside news show Tuesday and asked MSNBC host and former Kamala Harris staffer Symone Sanders if \"this animates voters in the midterms.\"",
    "The prevailing narrative for months has been that Democrats face an uphill battle to maintain control of the House and Senate in 2022, citing record inflation, President Biden's underwater approval rating, and the historical headwinds against an incumbent president's party in most midterms.",
    "But that changed this week as the leaked draft of a majority opinion that would overturn the landmark Roe v. Wade Supreme Court stoked hopes among Democrats they could motivate an unenthusiastic base, with numerous headlines and TV segments also pushing that line.",
    "NEW MSNBC HOST GETS DEFENSIVE WHEN REPORTER SUGGESTS SHE MIGHT GIVE JILL BIDEN SOFTBALL INTERVIEW\n\"The draft opinion from the Supreme Court that would overturn the right to an abortion is a massive story with a myriad of implications for the American public.",
    "President George W. Bush bucked the trend when Republicans rolled in 2002, although it was while he had high approval in the aftermath of the 9/11 attacks; in the 2006 midterms during Bush's second term, Democrats wrested back control of Congress.",
    "It also may be exactly what Democrats need to solve their passion problem heading into the 2022 midterm elections,\" Cillizza wrote, citing some polls showing a third of voters would be \"angry\" over the court overturning Roe v. Wade.",
    "\"Some Democrats argued overturning Roe would energize the party's base of voters as well as some independent voters who until this point were less enthusiastic than Republicans about turning out to vote this year.\"",
    "MSNBC's Nicolle Wallace declared much of the Democratic Party's base to be \"enraged\" and \"energized\" by the potential decision during a blistering segment Wednesday about Ohio Republican Senate nominee J.D.",
    "An ex-Senate Republican aide threw cold water on that notion, however, telling the Post it was hard to believe it would still be that galvanizing months from now and supersede voters' economic concerns.",
    "\"The news and political conversation immediately changed  from Ukraine, inflation and Bidens standing, to abortion and what happens in a post-Roe world,\" NBC News reported.",
    "\"The draft opinion threatens to upend the midterms in unpredictable ways,\" the Washington Post reported, quoting several Democratic lawmakers and aides pushing the line.",
    "Vance, and MSNBC's Stephanie Ruhle told guest Jennifer Palmieri on Tuesday, \"Four days ago, the question was how do you get Democrats energized for the midterms.",
    "Presidents Bill Clinton, Barack Obama, and Donald Trump all saw their parties suffer bruising losses in the first midterms of their presidencies.",
    "\"The Supreme Court may have just fundamentally altered the 2022 election,\" read a CNN headline Tuesday from political writer Chris Cillizza.",
    "MSNBC'S THE RACHEL MADDOW SHOW REPLACED BY MSNBC PRIME FOUR NIGHTS A WEEK\n\"This is an animating issue,\" Sanders said.",
    "The former Ohio Republican governor, who supported Biden in 2020, said he felt it would cost Republicans House seats.",
    "\"There are very few issues that can make a claim to upend or fundamentally alter the trajectory of an election.",
    "Another piece from the outlet: \"Democrats energized after leaked abortion decision jolts midterms.\"",
    "\"Draft abortion decision already begins scrambling the midterms,\" another NBC News headline said.",
    "It is any woman or any person who needs this health care  Abortion is a constitutional right.\"",
    "\"Overnight, Midterms Get a White-Hot New Focus: Abortion,\" read a New York Times headline.",
    "\"Gutting abortion rights might not boost the GOP in the midterms,\" Vox reported.",
    "CNN's Victor Blackwell asked commentator John Kasich on Tuesday.",
    "But overturning Roe may well be one of them,\" he wrote.",
    "\"It's all women  It's any woman.",
    "\"Is this going to move votes?\"",
    "They clearly are.\""
  ]
}