{
  "id": 5759,
  "mediaId": 124,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Inside the GOP effort to scrub a Trump-backed candidate from Tennessee's ballot",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-05/220504-Morgan-Ortagus-al-0900-3eb52e.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/gop-effort-scrub-trump-backed-candidate-tennessees-ballot-rcna27257",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allan Smith",
  "authorUrl": "https://www.nbcnews.com/author/allan-smith-ncpn925861",
  "termIds": [
    1147,
    1653,
    1801,
    1816,
    3103,
    428,
    492,
    571,
    2813,
    2932
  ],
  "sentences": [
    "Sen. Lindsey Graham, R-S.C., tweeted it was Exhibit A of political corruption and good ol' boy politics? while Trumps eldest son Donald Trump Jr. posted, voters should decide elections, NOT politicians making backroom deals.? Starbuck himself called the SEC a tiny group of establishment RINO hacks,? shorthand for the pejorative Republicans in name only.?\nIn a statement, Ortagus said that while she wont be in Congress, she will continue to fight for my country and for Tennessee conservative values,? calling the state officials responsible for her removal establishment party insiders.?\nAt a heated meeting of the Davidson County GOP last week, which featured SEC members answering questions from dismayed local Republicans, activists pressed the voting members on the decision, questioning why the state party wants to say goodbye to all the voters, all this momentum? and thinks that youre better than the voter,? according to video of the meeting obtained by NBC News.",
    "In a statement, Republican National Committee senior adviser Richard Walters said the committee had no involvement with the recent action taken by the Tennessee Republican Party.?\nIn the Nashville-area district, insiders said the decision to boot Ortagus had less to do with any rebuke of Trump as it was to send a message to anyone who thinks they can move to the fast-growing city and immediately launch a congressional bid.",
    "I was simultaneously surprised and not surprised because Ive definitely seen how some party figures have been very cold towards me,? he said in an interview, adding, Its still shocking because Ive never seen a congressional race where the state party throws out a leading candidate for Congress, let alone two.",
    "National GOP figures and local activists upset by the outcome have criticized the process as underhanded and corrupt, while state party officials and Tennessee Republicans have defended the move  the strongest pushback to one of Trumps primary picks thus far  as simply following its own rules.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nStill, fearful of potential threats to their safety, committee members cast their final ballots upholding the candidates removal from the primary race in secret at a secure location in mid-April.",
    "A Republican operative in the state, who requested anonymity to speak candidly on the effort, said the plan initially centered on pursuing a residency requirement bill that could have, if enacted before the April 7 filing deadline, stopped her candidacy in its tracks.",
    "The legislation, which passed both branches of the statehouse with overwhelming support, was for messaging purposes, this Republican said, adding that its advancing through the statehouse helped drive conversation about how Ortagus only recently moved to the state.",
    "Members also pushed back on charges of being a RINO? or establishment? politicians, arguing that committee seats are elected positions and often filled by unpaid activists who, in many cases, previously served as delegates for Trump at the past two conventions.",
    "This group is to the right of Attila the Hun.?\nWhile Ortagus has ended her candidacy and will not challenge the decision, thats not the case for Starbuck, who moved to the 5th District in 2019 and is backed by pro-Trump influencers and some prominent lawmakers.",
    "Trump has been eager to cement his continued influence over the party by endorsing early and often, though some Republicans have indicated they wish the former president would stay out of contested primaries or feel he has received bad advice on his picks.",
    "I heard this over and over: Well, Im all for Trump, but he doesnt need to be telling us who the hell to vote for,? said one member of the state partys executive committee, who requested anonymity because he was not authorized to speak on the vote.",
    "State Sen. Frank Niceley, who spearheaded the legislation, suggested in an interview with NBC News that only Jewish members of Trumps family cared for Ortagus bid, since she is Jewish  earning condemnation from Ortagus and others.",
    "They reviewed documentation provided by each of the three challenged candidates  Ortagus, right-wing influencer Robby Starbuck, and local Republican Baxter Lee  to back up their case for why they should be allowed on the ballot.",
    "It wasnt long after former President Donald Trump announced his endorsement for Morgan Ortagus in Tennessees newly drawn 5th Congressional District that a number of local Republicans began plotting how to nuke her candidacy.",
    "In Pennsylvania, Trump allies and local GOP officials have questioned his endorsement of Mehmet Oz in the Senate primary, pointing to Ozs limited history in the state and what they see as a lack of conservative bona fides.",
    "That bill, now law, requires congressional candidates to live in the state for three years to qualify for primary ballots, but would not have had an effect on this years ballot, according to the secretary of states office.",
    "Chase Montgomery, a member of the SEC who voted on the decision, told NBC News candidates were well aware they risked removal through the process if their records failed to meet the requirements of the partys bylaws.",
    "Members of the Tennessee Republican Partys executive committee argued it was simply enforcing its rules, which include a requirement that candidates cast ballots in at least three of four Republican primaries.",
    "Interviews with more than a dozen stakeholders, officials and candidates reveal a party nearly fully united in opposition to Trumps choice  even as many professed their full support for the former president.",
    "Three months later, a group of Tennessee GOP officials voted in secret at a secure location to do just that, blocking the former State Department spokeswoman and two others from the August primary ballot.",
    "This is Tennessee  Dont tell me what the hell I gotta do.?\nScores of Trumps other endorsements in GOP primaries across the country have come under scrutiny as primaries kick off in earnest this month.",
    "Why piss off your own voters??\nHowever, Tennessee Republicans said they view a legal challenge as unlikely to overturn the decision because courts have deferred to political parties in such disputes.",
    "The existing 5th District is held by longtime Rep. Jim Cooper, a Democrat who announced his retirement after the Republican-held Legislature drew a district much more favorable to Republicans.",
    "Im seeing a growing sense among people, not just in this situation, of wishing Trump would just leave a lot of these races alone,? the state executive committee member said.",
    "At the same time, rumors swirled in local GOP circles that Trump would not care if Ortagus bid was thwarted before voters had the chance to weigh in on her candidacy.",
    "The nationalization of our politics is extremely dangerous,? Luke Elliott, a local Republican activist, said in a statement, adding, You will show us more respect.",
    "In Ohio, more than 30 Republicans who served as Trump delegates in 2016 called on the former president to reconsider? his endorsement of GOP Senate candidate J.D.",
    "Moreover, they said, had they not voted to keep these candidates off the ballot, they risked lawsuits from past candidates theyve booted under those same rules.",
    "Some of the people who feel this way are die-hard pro-Trump people.?\nA representative for Trump did not respond to a request for comment.",
    "Its just a very, very rare case where the party had to flex and they flexed,? Thomsen Smith, a local Republican fundraiser, said.",
    "The state GOP has removed dozens of candidates in recent years upon their candidacies being challenged by local Republicans.",
    "The SEC voted 13-3 to keep Ortagus and Starbuck off the ballot, and 10-6 against Lee, the SEC voting member told NBC News.",
    "There were certain people in there [for whom the decision] was cut and dry from the beginning,? the SEC member said.",
    "Meanwhile, Republicans pursued the ultimately successful challenge to her candidacy through the state partys bylaws.",
    "Vance, calling that endorsement a betrayal.? (Vance won that primary Tuesday by more than eight points.)",
    "On Monday, he sued both the Tennessee GOP and the state in hopes of having his candidacy reinstated.",
    "But nowhere have Republicans gone farther in pushing back on Trumps endorsement than in Tennessee.",
    "More than one group has called us a bunch of RINOs and establishment,? the first SEC member said.",
    "Mr. President: I am pulling for you, but we did not ask for the help of your sly agents.?",
    "Maybe that was so cut and dry that these people didnt deserve it.?\nBacklash was swift.",
    "State executive committee members defended the decision as being totally by the book.",
    "Im not sure if they gave everybody  how can I put this  much [of] a fair evaluation.",
    "As it stands, the GOP primary for the U.S. House seat features nine candidates.",
    "Let me be very clear: if you move to Nashville, you will follow our rules.",
    "Just go learn.?\nAccording to Smith, donors are pleased by the removals.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Most werent swayed, and the decision was quick and overwhelming.",
    "And everyones like, You cant do that. And Im like, Oh, yeah.",
    "They dont see how thats benefitting him or the party.",
    "We will not be dictated upon by Washington, D.C.",
    "It just seems like crazy town.",
    "Maybe they were right.",
    "Its just crazy."
  ]
}