{
  "id": 5762,
  "mediaId": 238,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Opinion Why the J.D. Vance victory wasnt all about Trump",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/04/vance-ohio-win-not-all-about-trump/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    647,
    683,
    781,
    1147,
    1801,
    2524,
    3103,
    428,
    571,
    2845
  ],
  "sentences": [
    "Weve turned a gilded corner onto a shiny street where the wealthy (and their even wealthier friends) can buy name recognition and avoid the kind of scrutiny of character and policy that comes with running for and achieving local offices before running statewide.",
    "Country-club Republicans who drink fine wine, drive expensive cars and resent tax increases find themselves in political alliance with country-music Republicans who drink domestic beer, drive work trucks and resent government mucking up their lives.",
    "Donald Trumps endorsement in hand, Vance bested six other Republicans on Tuesday and Cleveland Plain Dealer politics reporter Seth A. Richardson judged him clearly the favorite? to win in the fall against his Democratic opponent, Rep. Tim Ryan.",
    "Endorsements can help a candidate, but they are most effective when made by a popular endorser (as here) on behalf of an unknown or undefined candidate  which, by the time the endorsement was bestowed  doesnt describe Vance.",
    "And the endorsement wasnt exactly a ringing one: Speaking about the GOP Senate field on Tuesday, Trump said, theyre all very good.? Nearly 70 percent of voters in the primary didnt vote for the Trump-endorsed candidate.",
    "Also, by the time Trump finally backed Vance on April 15, tens of thousands of Republican voters  including red MAGA hat owners  had already cast early ballots for other candidates or had settled on their choices.",
    "What probably contributed little to Vances success was his best-selling memoir, Hillbilly Elegy.? The book was more popular with the NPR and Whole Foods crowd, who typically vote in Democratic primaries.",
    "Trump has endorsed about 130 candidates this cycle  many of them incumbents in safe seats  and well know in November whether his seemingly newfound political shrewdness is taking hold.",
    "As important to the Vance victory was the assist from an ally who was earlier to the barricades  Peter Thiel, who weighed in with $15 million in rather savvy super-PAC support.",
    "Mike Gibbons, who spent about $14 million of his own money, seemed especially unprepared for such a steep endeavor and would have been a liability in the general election.",
    "One other takeaway: Remember that the Trump stamp of approval might have hurricane strength in some Republican primaries but dwindles to a drizzle in a general election.",
    "With several self-funding candidates in the race, it was difficult for anyone to sustain a lead  creating the most wide-open primary Election Day in decades.",
    "But independents  who will likely lean heavily toward the GOP this cycle and dictate many results  dont care much about what Trump recommends.",
    "People with money to burn will eagerly light it afire if consultants make even a halfway convincing case that it could result in a Senate win.",
    "Consider this: Of all the Ohio U.S. Senate wannabes Trump couldve endorsed, he chose the one who had said the harshest things about him.",
    "He would have gotten more traction with many likely Republican voters from his repeated appearances on Tucker Carlsons Fox News show.",
    "Too many incorrectly ascribe every good outcome to Trumps purported brilliance or blame every bad thing on his supposed malevolence.",
    "I have advised campaigns all around the United States, but Ive never seen so much money expended on a single statewide primary.",
    "Second, populism is now an oak-hard structural beam in the party that Abraham Lincoln built and that Trump now dominates.",
    "Vance may be the midterms favorite, but hes smart enough to know that he cant coast to victory on Trumps backing alone.",
    "Trump, in a nonstrategic revenge mode, might have embraced any of the other candidates groveling for his approval.",
    "All told, 21 issue groups and 10 campaigns spent in the neighborhood of $100 million on this one.",
    "Vance was also aided by competitors who either peaked too early or brought subpar efforts.",
    "Instead, he wisely overlooked Vances past barbs and chose with head rather than heart.",
    "First, the former president might be more prudently spending his political capital.",
    "Neither voters nor Trump himself are so one dimensional or easily analyzed.",
    "Trumps late timing might well have blunted the full effect of his support.",
    "An open Senate seat is as rare as a loyal cat and much more valuable.",
    "The next senator from Ohio  a reddening state  will likely be J.D.",
    "Yes, Trumps endorsement boosted Vance from a distant third place.",
    "By November, partisans will support fellow partisans.",
    "Free speech has never been so expensive.",
    "For starters, it wasnt all about Trump.",
    "Third, money matters as never before.",
    "How did it happen?",
    "Vance."
  ]
}