{
  "id": 5766,
  "mediaId": 195,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Campaign Report  Trump shows his strength in Ohio",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/8c262f4efa3644e18695f205bb160015.jpg?w=2560&h=1440&crop=1",
  "link": "https://thehill.com/news/campaign/3477203-campaign-report-trump-shows-his-strength-in-ohio/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    648,
    781,
    1147,
    1154,
    1378,
    1801,
    2087,
    3103,
    4746,
    2818,
    2845
  ],
  "sentences": [
    "Within hours of Politico publishing its report on the leaked draft, activists had taken to the steps of the Supreme Court in protest while operatives flooded inboxes seeking to position the potential ruling as a choice on how to vote in November.?\nIN THE POLLS\nPolling out Wednesday showed Nevadas former Attorney General Adam Laxalt leading the states GOP Senate primary and Clark County Sheriff Joe Lombardo ahead in Nevadas Republican gubernatorial primary, Tal reports.",
    "In fact, she said she doesnt even believe there is a crisis and she refuses to oppose Bidens open-border policy, which will cause an unprecedented surge at our border over the next few months.?\nCampaigning across the aisle: Sen. Joe Manchin (D-W.Va.) appeared in a new campaign ad for GOP Rep. David McKinley (W.Va.), doubling down on his opposition to Build Back Better.",
    "Julia and The Hills Hanna Trudo have more here:\nLiberals at the state and federal level are rushing to harness the anger and energy of abortion rights supporters, while candidates across the spectrum are retooling their messaging that until Monday night was expected to focus on economic issues such as inflation.",
    "The leak of a Supreme Court draft opinion overturning Roe v. Wade shook up the national political landscape this week, giving Democrats a potential opportunity to shift the political conversation away from the rising prices and economic uncertainty that have so far hampered them this year.",
    "Kingmaker for a day: That began to change quickly after Trump endorsed him last month and his win in the primary adds to the former presidents reputation as a Republican kingmaker  a reputation hes eager to build out as he weighs a potential comeback campaign for the White House in 2024.",
    "Both Brown and Turner had racked up key endorsements ahead of the primary, with President Biden throwing his support behind Brown and Rep. Alexandria Ocasio-Cortez (D-N.Y.) backing Turner, a former adviser to Sen. Bernie Sanders (I-Vt.) presidential campaign.",
    "Roe bombshell shakes up midterms\nRepublicans had planned to make the 2022 midterm elections about inflation, border security and crime, hoping to capitalize off of voters malaise with the Biden administration and a Democratically controlled Congress.",
    "In another key race, Rep. Shontel Brown (D-Ohio) scored a roughly 33-point victory over her progressive challenger, former state Sen. Nina Turner, putting her on a glide path to keep her seat in Ohios 11th congressional district.",
    "But West Virginians know David McKinley is all about us.?\nIntra-party distancing: Meanwhile, Democratic Sen. Maggie Hassan (N.H.) took an opposite approach in her first campaign ad of the year, distancing herself from Biden.",
    "Email us tips and feedback: Max Greenwood (mgreenwood@thehill.com), Julia Manchester (jmanchester@thehill.com), Tal Axelrod (taxelrod@thehill.com), Caroline Vakil (cvakil@thehill.com) and Monique Beals (mbeals@thehill.com).",
    "Vance came out on top in Ohios hotly contested GOP Senate primary, defeating his main rival, former state Treasurer Josh Mandel, by a roughly 8-point margin and handing a win to Trump who endorsed him just last month.",
    "Ad spending ramps up\nThe Democratic Governors Association is spending some $75 million on initial ad buys for the fall as it looks to provide air cover for some of the countrys most vulnerable Democratic incumbents.",
    "The Ohio congressman and former presidential candidate was the heavy favorite to win heading into the primary, but his staggering margin of victory only added to the disappointments for progressives on Tuesday.",
    "For Alex Mooney and his out-of-state supporters to suggest David McKinley supported Build Back Better is an outright lie,? Manchin added, saying Alex Mooney has proven hes all about Alex Mooney.",
    "Before winning Trumps support, Vance had struggled to break through with many voters and earlier polling showed him trailing both Mandel and businessman Mike Gibbons for the nomination.",
    "Instead of sending reinforcements to stop this humanitarian crisis, Lujan Grisham actually pulled National Guard troops away from the border,? a narrator says in the minute-long spot.",
    "A surprise to no one: Rep. Tim Ryan (D-Ohio) easily won the Democratic Senate primary in Ohio, beating out attorney and community organizer Morgan Harper by a whopping 52 points.",
    "In the race for the governors office Lombardo had 33 percent support followed by former boxer Joey Gilbert with 14 percent and former Sen. Dean Heller (R) with 11 percent.",
    "In the ad for McKinley, who also opposed the legislation, Manchin said if he cant go home and explain it, I cant vote for it, and thats why I opposed Build Back Better.",
    "Im taking on members of my own party to push a gas tax holiday,? Hassan said in the ad, appealing to voters concerned about spiking gas prices across the country.",
    "Trump also has a stake in several other primaries happening this month, and it remains to be seen whether hell keep his winning streak alive.",
    "The DGA is also spending $5 million in both Colorado and Maine, another $4.5 million in Minnesota and $2.5 million in New Mexico.",
    "Army vet Sam Brown was the only other candidate to receive double digit support, trailing behind Laxalt with 27 percent support.",
    "Vances victory on Tuesday night gave the former president a concrete example of his endorsements ability to lift up candidates.",
    "GOP targets Grisham: Meanwhile, the Republican Governors Association is out with a six-figure ad buy attacking New Mexico Gov.",
    "The Hill/Emerson College poll showed Trump-endorsed Laxalt had a bit more than 50 percent support among likely primary voters.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "If youre looking for more on the Ohio primaries, Julia and Tal have you covered with these takeaways.",
    "Welcome to The Hills Campaign Report, tracking all things related to the 2022 midterm elections.",
    "Thanks for reading and check out The Hills Campaign page for the latest news and coverage.",
    "You can expect this newsletter in your inbox each week leading up to Novembers election.",
    "Michelle Lujan Grisham, accusing her of denying the crisis? at the U.S.-Mexico border.",
    "Gretchen Whitmer is facing reelection, $21 million in Wisconsin to protect Gov.",
    "Thats how we lower costs and get through these times.?\nThats it for today.",
    "The initial reservations include $23 million in Michigan, where Gov.",
    "Its still Trumps party\nTuesday was a good day to be Donald Trump.",
    "And Im pushing Joe Biden to release more of our oil reserves.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Laura Kelly is staring down a difficult reelection campaign.",
    "Tony Evers, and $10 million in Nevada in support of Gov.",
    "But a quarter of voters said they were still undecided.",
    "The buy also includes $4 million in Kansas, where Gov.",
    "But for now, Trump World is in celebration mode.",
    "Author and venture capitalist J.D.",
    "That is, until now.",
    "See you next week.",
    "Steve Sissolak."
  ]
}