{
  "id": 5781,
  "mediaId": 238,
  "date": "d2022-05-04T15:17",
  "headline": "Live updates Political parties plot next moves on terrain shaken by leaked draft abortion opinion",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/04/supreme-court-roe-v-wade-live/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    648,
    781,
    1796,
    2087,
    3014,
    3103,
    4766,
    482,
    2590
  ],
  "sentences": [
    "Maxine Joselow: What overturning Roe could mean for a ruling on the environment  The leaked draft Supreme Court opinion overturning Roe v. Wade has sparked fear not only among abortion activists, but also among environmental lawyers who say the federal government should have expansive legal authority to tackle the climate crisis.The draft opinion signals the conservative majority is willing to scuttle long-standing precedent to achieve conservative objectives, these environmental lawyers told me for The Climate 202, my daily climate change newsletter for The Washington Post.That doesnt bode well for the courts forthcoming decision in West Virginia v. EPA, a challenge to the Environmental Protection Agencys ability to curb climate-warming emissions from power plants.",
    "Michael writes:\nBut since the release this week of a draft Supreme Court opinion that would overturn the long-standing constitutional right to abortion, Democrats have been the ones embracing that complaint, flipping the script as the party vents its frustration with elements of the U.S. system that have empowered a minority of the countrys voters to elect lawmakers who have successfully reshaped the high court.",
    "Return to menu\nSpeaking at a fundraiser for female Democratic candidates, Vice President Harris put the stakes of the abortion rights debate in stark terms, saying: Womens rights in America are under attack.?\nThe Posts Vanessa Williams reports that Harris, during her remarks Tuesday night, denounced as an assault on democracy the possibility that the Supreme Court is preparing to overturn Roe v. Wade.",
    "Soon afterward, the young lawmaker, a practicing Catholic, told an interviewer that he disagreed with the decision and that he had views on such matters that made him about as liberal as your grandmother.?\nThe Posts Matt Viser writes that nearly a half-century later, Biden again declared the court was moving too far on abortion rights  but this time, he argued, in the opposite direction.",
    "Rep. Tim Ryan (D) carried all 88 counties to beat former consumer rights attorney Morgan Harper by more than 50 points, while Rep. Shontel Brown (D) defeated former state senator Nina Turner in a 2-to-1 landslide.Browns victory, aided by millions of dollars in PAC advertising, came after an endorsement from Biden, and Ryan won with the endorsement of the Ohio Democratic Party.",
    "That view has started to resonate among some Democrats, who note that, in the draft opinion, Justice Samuel A. Alito Jr. offered a narrow interpretation of what constitutes a fundamental right and made repeated references to the idea that any right not mentioned in the Constitution must be deeply rooted in this Nations history and tradition? to be recognized.",
    "Return to menu\nWith the Supreme Court seemingly poised to overturn Roe v. Wade, Democrats are advancing an argument about what they see as a major flaw in American politics: structural advantages have created an uneven political playing field and helped Republicans install a conservative majority that is out of step with the public will.",
    "Ohio is an open primary state, and significantly fewer voters pulled a Democratic ballot in Tuesdays elections than voted in the partys 2018 primaries.In the Cleveland-based 11th Congressional District, turnout fell dramatically from last summer, when Brown and Turner first faced off in a special primary election.",
    "Return to menu\nAnother aspect of the fallout from the leaked draft opinion that showed the Supreme Court is prepared to strike down federal protections for abortion rights: Republican lawmakers are facing renewed internal pressure to support child-benefit programs for parents.",
    "Return to menu\nThirteen states have trigger laws that would immediately or after swift state action ban all or nearly all abortions if the U.S. Supreme Court overturns Roe v. Wade, according to the Guttmacher Institute, a research organization that supports abortion rights.",
    "The Posts Annie Linskey and David Weigel report that with most of the vote tallied, Vance was projected as the winner, according to the Associated Press, leading a field that included four other major candidates  all but one of whom sought to model themselves after Trump.",
    "Matt takes a look at Bidens evolution, writing:\nThroughout his career, Bidens views on abortion  at least as a political matter  have steadily shifted in a way that has in recent years placed him in line with his party but at uncomfortable odds with his church.",
    "The Posts Michael Scherer explores the dynamic, noting that for nearly half a century, Republicans have railed against unelected judges? making rulings that they claim disenfranchise voters from deciding for themselves what laws should govern hot-button issues.",
    "Let us fight for our country and for the principles upon which it was founded and let us fight with everything we have got.?\nHarris, who a week ago tested positive for the coronavirus, drew applause throughout her remarks, which lasted about 10 minutes.",
    "The hesitancy by top GOP officials Tuesday to herald the news that what they have long sought they could soon obtain suggested a concern, or at least some initial uncertainty, about whether Roes demise could have some political drawbacks for the party.",
    "A popular two-term Republican governor from a deeply Democratic state, Hogan has kept the door open to a presidential bid while raising his national profile, meeting with donors and raising cash for his political advocacy group, An America United.",
    "Some say the draft opinion in the abortion case provides a road map for the court to hold that same-sex marriage is not a fundamental right, while others argue that there is no public appetite for putting that issue before the court.",
    "Vance, an author and venture capitalist, won the Republican primary for U.S. Senate in Ohio, affirming the influence over GOP voters of former president Donald Trump, whose endorsement boosted Vance over rivals with similar views.",
    "Not a leaked draft but the fact that a draft was leaked.?\nRepublicans have spent decades railing against Roe while running on antiabortion platforms and promising to appoint judges who would overturn the landmark 1973 decision.",
    "Return to menu\nFollowing the leak of the Supreme Court draft opinion on abortion, Republicans, for the most part, have seemed more eager to talk about the leak than the substance and implications of the potential ruling.",
    "Women are a little more likely than men to favor keeping abortion legal; 62 percent of women say abortion should be legal in all or most cases, according to the Pew Research Center, while 56 percent of men say the same.",
    "Writing in The Early 202, Leigh Ann Caldwell and Theodoric Meyer take note of the advice that Senate Minority Leader Mitch McConnell (R-Ky.) gave reporters on Tuesday: You need to concentrate on what the news is today.",
    "Democracies cannot be strong if the rights of women are under attack,? Harris said during remarks at the national conference and gala for Emilys List, which works to elect Democratic women who support abortion rights.",
    "Senate Democrats are aiming to hold a vote next week to write abortion rights into law  but it seems destined to fail given the filibuster rule in the chamber and the lack of support for changing it from key senators.",
    "Return to menu\nIn the wake of the Supreme Courts leaked draft opinion on abortion rights, Rep. Alexandria Ocasio-Cortez (D-N.Y.) warned in a tweet that such a ruling could be a sign of other ominous things to come.",
    "The Posts Annys Shin and Dan Keating report that in 2019, the latest year for which data from the Centers for Disease Control and Prevention is available, about 97,000 abortions were performed in those states.",
    "There are also a handful of states, including Michigan and North Carolina, that have pre-Roe bans on their books that are not enforced but could be revived if the decision is overturned, Guttmacher notes.",
    "And now that he has become the second Catholic president in U.S. history, he suddenly finds himself the countrys highest-ranking champion of abortion rights as it faces its greatest challenge since Roe.",
    "They also point out that Alito, who was appointed by President George W. Bush, explicitly stated in the draft opinion that his reasoning was not meant to apply to any rights besides abortion.",
    "But he argued in a sharply worded speech that Republicans are desperately in need of a course correction? and a more hopeful leader, positioning himself as that potential contender in 2024.",
    "Larry Hogan (R) used a marquee address at the Reagan Presidential Library in California to chart a broader vision for Republicans, pitching cross-party appeal as the only way forward.",
    "The GOP has adamantly opposed Bidens proposals to provide cash payments for parents, universal prekindergarten and other family benefit programs such as expanded child-care subsidies.",
    "But with the Supreme Court appearing poised to overturn Roe v. Wade, even some Republican senators are acknowledging that the party may need to do more to provide support for parents.",
    "As weve warned, SCOTUS isnt just coming for abortion  theyre coming for the right to privacy Roe rests on, which includes gay marriage + civil rights,? she tweeted.",
    "Although she did not call for congressional action to codify Roe during her remarks, she said the work of Emilys List was now more important than ever.",
    "The ruling is the culmination of a decades-long Republican project but could also put a spotlight on the partys resistance to efforts to aid parents.",
    "Today, both political parties are seeking to navigate the fallout from the Supreme Courts leaked draft opinion that would overturn Roe v. Wade.",
    "A court decision overturning Roe would lead about half the states to make abortion illegal immediately or soon after the Supreme Court acted.",
    "Those are signs of lagging enthusiasm for left-wing candidates and lower enthusiasm by Ohio Democrats, in general, about this election year.",
    "He easily won his partys nomination over Morgan Harper, a former attorney at the Consumer Financial Protection Bureau who ran to Ryans left.",
    "President Biden plans to focus Wednesday on the economy  previously the dominant issue by far  with an address from the White House.",
    "Meanwhile, Republicans and Democrats alike are considering how much of a role abortion will play in their midterm messaging.",
    "The Posts Marisa Iati explores the wave of conjecture about what that could mean for same-sex marriage, in particular.",
    "Return to menu\nPresident Biden became a senator in 1973, just 17 days before the Supreme Court decided Roe v. Wade.",
    "The Posts Erin Cox reports that Hogan stopped short of declaring plans to shape the GOP by running for president.",
    "As she took the stage, Harris was masked and bumped elbows with Laphonza Butler, president of Emilys List.",
    "She writes:\nLegal experts are divided on whether the right to same-sex marriage is actually in danger.",
    "A former union organizer, Butler was a senior adviser to Harriss unsuccessful presidential campaign.",
    "David Weigel: Turnout could be an issue  There was no progressive revolution in Ohio last night.",
    "Return to menu\nWhile much of the political class was focused on abortion Tuesday, Maryland Gov.",
    "With only a few precincts still uncounted, just 66,326 ballots had been cast in Tuesdays race.",
    "At 3 p.m. weekdays, return to this space and well address whats on the mind of readers.",
    "Brown won more votes than she had last year, but Turner won nearly 10,000 fewer votes.",
    "Republicans have signaled they will continue to emphasize other issues as well.",
    "In 2019, about 77,000 abortions were performed in those states, CDC data shows.",
    "Harris was named the administrations point person on abortion rights last fall.",
    "In Novembers general election, Vance will face Democratic Rep. Tim Ryan.",
    "But the states Democratic establishment didnt have much to celebrate.",
    "Theyll vie for the seat now held by retiring Sen.",
    "Got a question about the politics of abortion?",
    "Voters cast 75,064 ballots in that race.",
    "Return to menu\nMost prominently, J.D.",
    "Rob Portman, a moderate Republican.",
    "Later, hell host Olympic athletes.",
    "Submit it here."
  ]
}