{
  "id": 5783,
  "mediaId": 136,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "J.D. Vance Expected to Crush Tim Ryan and Win Ohio Senate Race",
  "image": "https://d.newsweek.com/en/full/2031271/jd-vance.webp?w=790&f=888f435c27580a55555d5590c13aa4ad",
  "link": "https://www.newsweek.com/jd-vance-ohio-primary-trump-senate-1703445",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    717,
    781,
    946,
    1147,
    2027,
    3103,
    146,
    380,
    428,
    571,
    2845
  ],
  "sentences": [
    "\"It's little surprise to see the Republicans as strong 1/7 favorites to retain their Senate seat in Ohio later this year given they have held the position since 1998,\" Betfair spokesperson Sam Rosbottom told Newsweek, adding Vance will \"fancy his chances\" against Ryan.",
    "Vance also praised his rival Dolan, the only main GOP candidate who did not actively seek Trump's backing or attempted to appeal to the former president's base by parroting his policies and false cries of 2020 election fraud.",
    "With more than 95 percent of the votes accounted for, Vance leads with 32.2 percent, with former State Treasurer Josh Mandel coming in second with 23.9 percent and state Senator Matt Dolan placing third with 23.3 percent.",
    "In his victory speech, Vance thanked Trump for the endorsement, which arrived late in the campaign when the candidate was behind in the polls, despite previously describing the former president as \"America's Hitler.\"",
    "Vance, who managed to obtain the much sought-after endorsement from former President Donald Trump in the highly competitive field, was declared the winner of Tuesday's election about two hours after the polls opened.",
    "Rachael Kane, a representative for Paddy Power, said Vance having the \"Trump card\" will go in his favor come November, given that Trump defeated President Joe Biden in Ohio by eight points in the 2020 election.",
    "The bookmakers noted that Ryan was always going to face an uphill battle to take the seat, which has been won by a Republican in the last four elections dating back nearly 25 years.",
    "Ryan, a 2020 presidential candidate, beat his nearest challenger Morgan Harper by more than 52-percentage points on Tuesday, with 86 percent of the ballots reported.",
    "Vance is the overwhelming favorite to take the Ohio Senate seat being vacated by Republican Rob Portman following the author's GOP primary election victory.",
    "Betting companies Paddy Power and Betfair both stated Vance is 1/7 favorite to win the midterm election, with Ryan being offered as 4/1.",
    "While Ryan was shown to be the clear choice for the Democratic candidate, bookmakers said Vance is still the one to beat come November.",
    "Vance will now face Democratic Congressman Tim Ryan in November's midterms after he comprehensively won his respective primary.",
    "The odds mean there is an 87.5 percent probability that the Republican will win the upcoming election in Ohio.",
    "\"He has been a great public servant for this country and I think our party was better for the campaign.\"",
    "\"He could have ran an ugly campaign, but instead he ran a campaign about issues, about substance.",
    "\"Matt Dolan had a very professional, very well-resourced campaign,\" Vance said.",
    "Bookmakers have declared that J.D."
  ]
}