{
  "id": 5785,
  "mediaId": 98,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Biden previews midterm offensive as he attacks extreme MAGA Republicans in deficit speech",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/53e95d4/2147483647/strip/true/crop/5738x3993+0+0/resize/840x585!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2f%2Fc6%2F2b155fd7458b8320328326049365%2Fbiden-38411.jpg",
  "link": "https://www.latimes.com/politics/story/2022-05-04/biden-previews-midterm-offensive-as-he-attacks-extreme-maga-republicans-in-deficit-speech",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    2087,
    2305,
    3103,
    4601,
    146,
    428,
    571,
    2959
  ],
  "sentences": [
    "Because this MAGA crowd is really the most extreme political organization that exists in American history.?\nThe speech marked a deliberate shift in tone for Biden, who has been reluctant to attack Republicans during his first 15 months in office as he pursued a more bipartisan approach to politicking and messaging on issues like Russias invasion of Ukraine and an infrastructure.",
    "With mounting concerns about inflation, the White House has tried to shift the focus of its stalled domestic agenda to spotlight deficit reduction in an effort to win favor with West Virginia Sen. Joe Manchin, a key Democrat who all but killed Bidens climate and social spending package in December.",
    "In a prepared remarks touting his administrations deficit reduction efforts, Biden excoriated Republicans for pursuing policies in line with President Trumps political movement and seized on an unpopular economic blueprint put forward by National Republican Senatorial Committee Chair Rick Scott.",
    "I want to hear about helping ordinary people.?\nAsked about the Supreme Court draft opinion that would end nearly 50 years of federal abortion protections, Biden warned it portends threats on other issues including LBGTQ+ rights in GOP-controlled states.",
    "Now is the appropriate time to start hitting that message on a sustained basis.?\nA Washington Post-ABC News poll last month found Americans trust Republicans over Democrats by nearly 20 points to boost the economy and tame inflation.",
    "WASHINGTON \nWith an eye clearly on Novembers midterm elections, President Biden on Wednesday sharpened his attack on Republicans as he sought to contrast his administrations policies with what he described as an extreme? GOP agenda.",
    "Hes gotten out of Republicans on Capitol Hill basically what he can get at this point and its time to pass the remaining parts of his agenda through Congress, which will happen by and large through Democrats,? LaBolt said.",
    "The White House has tried to contrast its economic message with GOP proposals by highlighting Scotts plan, which has been notably rebuffed by Senate Minority Leader Mitch McConnell of Kentucky and other Republicans.",
    "The White House, meanwhile, has increasingly tried to reframe the midterms as a choice between Democrats and a MAGA agenda that rescinds abortion rights, favors the rich and promotes divisive cultural politics.",
    "Elections are about choices and choices that require the president to make that contrast in the run-up to the election,? said Ben LaBolt, a Democratic strategist who remains close to the White House.",
    "The plan proposes a sunset on all federal laws every five years unless reauthorized by Congress, which could potentially eliminate entitlement programs like Medicare and Social Security.",
    "The party is struggling to overcome spiking inflation rates, low approval ratings for Biden and historical headwinds that usually spell trouble for the party in the White House.",
    "Manchin has said any revised part of Bidens economic plan  including climate change measures, drug-pricing reform or raising corporate taxes  would need to cut the deficit.",
    "The escalation in rhetoric comes as the White House begins to take a tougher line on Republicans in an effort to stave off Democratic losses in Novembers midterms.",
    "I dont want to hear Republicans talking about deficits and their ultra-MAGA agenda,? he said, referring to Trumps Make America Great Again campaign slogan.",
    "The same poll found only 28% of Americans approve of how Biden is handling inflation compared with 68% who disapprove of his stewardship on the issue.",
    "Following Bidens remarks, Scott accused Biden of mischaracterizing his plan and slammed the president for not mentioning inflation.",
    "In a tweet early Wednesday, the GOP bashed Biden over soaring gas prices and record inflation as well as immigration and crime.",
    "Biden said Wednesday that his administration was on track to cut the national deficit by more than $1.5 trillion this year.",
    "In his most pointed attack yet on the Republican Party, Biden said, What are the next things that are going to be attacked?",
    "Vance won Ohios tightly contested GOP Senate primary, reaffirming the former presidents grip on the Republican Party.",
    "Bidens remarks, which included 11 mentions of MAGA, also came a day after Trump-backed candidate J.D.",
    "Republicans have been talking about inflation and crime and their message every day for months.",
    "Its time for the president to get out there and present his contrast and his vision.?",
    "Republicans have sought to turn the midterm elections into a referendum on Biden.",
    "Biden said the plan would raise taxes on millions of Americans.",
    "Almost every sentence was a complete lie,? he told Fox News.",
    "Its extreme, as most MAGA things are,? Biden said.",
    "I want to hear about fairness.",
    "I want to hear about decency."
  ]
}