{
  "id": 5788,
  "mediaId": 129,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "A bitter general election battle between Tim Ryan and J.D. Vance for Senate is quickly taking shape.",
  "image": "https://static01.nyt.com/images/2022/05/04/multimedia/04primary-live-ads-ryan/04primary-live-ads-ryan-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/live/2022/05/04/us/ohio-primary-election-midterms",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "Beyond Mr. Vance, Mr. Dolan and Mr. Mandel, the crowded race included a single female candidate, Jane Timken, a former Ohio Republican Party chair, who was backed by the retiring incumbent, Senator Rob Portman, as well as Mike Gibbons, a businessman who poured millions of his own money into the race and at one point had climbed to the top of the polls.",
    "J.R. Majewski will be the Republican to challenge Kaptur this fall\nJ.R. Majewski, a self-styled political outsider, won the Republican nomination in Ohios Ninth Congressional District and will face Representative Marcy Kaptur, a Democrat who, if elected to her 21st term in November, would become the longest-serving female member of Congress.",
    "Mr. Majewski sought to tap into Mr. Trumps Make America Great Again energy, showing himself in television ads holding a gun as he told viewers, Im willing to do whatever it takes to return this country back to its former glory.?\nHe defeated Craig Riedel and Theresa Gavarone, state legislators who also ran as Trump-style conservatives.",
    "And thats going to be me.?\nMr. Vance is an unlikely champion of the Trumpian mantle, after calling the former president reprehensible? in 2016 and even cultural heroin.? But he had changed his tune entirely by 2022, and Mr. Trump called to congratulate him on his victory on Tuesday evening, according to a person briefed on the call.",
    "Tim Ryan, who says Americans first, won the Democratic Senate primary\nThe victory by Representative Tim Ryan, a Democrat, means the November contest to replace Senator Rob Portman, a Republican who is retiring, will be a race between a seasoned politician on the left and a first-time candidate for office, Mr. Vance, on the right.",
    "Mike DeWine of Ohio, a more traditional Republican who has held offices in the state for more than 40 years, finished far ahead of his multiple primary rivals after a strong right-wing challenge never gained traction despite some conservative backlash to Mr. DeWines early and assertive response to the coronavirus pandemic.",
    "From the very start, Mr. Vance did have a crucial financial benefactor: His former boss, Peter Thiel, the Silicon Valley investor who pledged $10 million to Mr. Vance even before he formally joined the contest and who added millions more in the final stretch to trumpet Mr. Trumps endorsement in the last weeks.",
    "Vance called Donald J. Trump cultural heroin? and a demagogue who was leading the white working class to a very dark place.?\nOn Tuesday, Mr. Vances triumph in a crowded Republican field for Senate in Ohio was thanks largely to an endorsement, late in the race, from the former president he once denounced.",
    "He denounced Mr. Vance for showing up with a multimillion-dollar check from a Silicon Valley investor and wanting to pretend like he is an Ohio guy.?\nNational Republicans have fired back with their own attacks, portraying Mr. Ryan as a career politician who is out of touch with the people he represents.",
    "Vance, the best-selling author whose Hillbilly Elegy? about life in Appalachia illuminated a slice of the country that felt left behind, decisively won the Ohio Senate primary on Tuesday after a late endorsement by Donald J. Trump helped him surge past his rivals in a crowded field.",
    "Mandel.?\nMr. Trumps endorsement set off a frenzy among Ohio Republicans who questioned Mr. Vances Republican credentials, with rivals circulating fliers online and at a Trump rally accusing him of being a Democrat in disguise and resurrecting his past comments against Mr. Trump.",
    "In the Democratic primary, Mr. Ryan, who briefly ran for president in 2020, easily turned back a primary challenge from Morgan Harper, 38, a former adviser at the Consumer Financial Protection Bureau who ran as a progressive, banking $5 million for the general election.",
    "Mr. Ryan has already run an anti-China ad that focuses on Ohio jobs and his opening ad of the general election has him tossing darts inside a bar and seeking to separate himself from the broader Democratic brand, lamenting those who have called for defunding the police.",
    "About 16 percent of the ballots counted in Ohio were cast early by mail or in person for Tuesdays primaries, which were highlighted by a fiercely contested Republican primary for an open seat in the U.S. Senate and several intriguing primary contests for the U.S. House.",
    "Max Miller, a Trump White House aide, won his House primary\nMax Miller, whom the former president endorsed, clinched the Republican nomination in Ohios Seventh Congressional District  another deep-red district where Mr. Trumps influence over the party was on display.",
    "Cheers went up at Mr. Vances Cincinnati election party when The Associated Press called the race shortly after 9:30 p.m.\nThe people who are caught between the corrupt political class of the left and the right, they need a voice,? Mr. Vance said in his victory speech.",
    "Similar to their bitter 2021 matchup, Ms. Turner  who rose to national prominence as a surrogate for Senator Bernie Sanders  was the subject of attack ads funded by several outside groups that described her as too far afield from the Democratic base to be effective.",
    "Casting himself as a fighter against the nations elites, Mr. Vance ran as a Trump-style pugilist and outsider who railed against the threats of drugs, Democrats and illegal immigration, while thoroughly backpedaling from his past criticisms of the former president.",
    "When Mr. Vance moved his family, which now includes three children, back to Ohio, he raised money from Mr. Thiel for a venture capital fund of his own  and followed the Thiel tradition by naming the business, Narya Capital, with a Lord of the Rings? reference.",
    "If Mr. Vance prevails in the fall, the 37-year-old graduate of Yale Law School and investor would become the second-youngest member of the Senate, the chambers youngest Republican and a rare freshman who would arrive in Washington with a national profile.",
    "Vance, the author of Hillbilly Elegy? and a venture capitalist who trailed in the polls until he was endorsed by former President Donald J. Trump, won the Republican nomination for Senate, giving Mr. Trump an early victory in the midterm election season.",
    "In the Senate race, Mr. Vance will now face Representative Tim Ryan, a 48-year-old Democrat from the Youngstown area who has positioned himself as a champion of blue-collar values and has not aligned with some of his partys more progressive positions.",
    "Mike DeWine, a Republican who eschewed the combative and conspiratorial tones of Mr. Trump, easily dispatched the field of primary challengers that was led by Jim Renacci, who presented himself as a more Trump-aligned alternative to the governor.",
    "Today, Mr. Vance, who graduated summa cum laude from Ohio State University and went on to Yale Law School, has found a political home with the movement known as national conservatism, an effort to add an intellectual framework to Trumpism.",
    "The contest was nasty and lengthy, with nothing capturing the intensity more than a near-physical confrontation between Mr. Gibbons and Mr. Mandel at one March debate, where they bumped bellies as they lobbed verbal threats at one another.",
    "Only minutes had passed after Mr. Vance was declared the victor in his primary when Mr. Ryan, a 10-term House representative from northeastern Ohio who has long sought to appeal to blue-collar workers, released an ad attacking Mr. Vance.",
    "The conversion of Mr. Vance, an author and venture capitalist, from Trump skeptic to full-on Trump ally might fill a second memoir, a sequel to his best-selling Hillbilly Elegy,? Mr. Vances story of growing up poor in Kentucky and Ohio.",
    "Mr. Vance, an author and venture capitalist, rose to fame after the release of his best-selling memoir Hillbilly Elegy,? which he based on his ascent from his poor upbringing in Ohio and Kentucky to the vaunted classrooms of Yale Law.",
    "Opponents spent millions on attack ads to remind voters that Mr. Vance had once called himself a Never Trump guy? and had said some voters backed Mr. Trump for racist reasons.?\nMr. Vance, on a slog across Ohio he called the No B.S.",
    "His book had achieved best seller status not just from conservatives but liberals, who in the wake of the 2016 election had used it as something of a decryption key to understand Mr. Trumps appeal in rural reaches of the country.",
    "Some Republicans see Mr. Ryan as formidable  Mr. Trump among them  but the general election is not seen by either party as among the half-dozen closest contests that will determine control of the Senate, now divided evenly 50-50.",
    "Republicans have moved closer and closer to the former presidents hard-line policy positions on issues like trade and immigration, and to his combative posture with Democrats and on cultural issues that divide the two parties.",
    "I was like, Man, you know, when Trump says the elites are fundamentally corrupt, they dont care about the country that has made them who they are, he was actually telling the truth,? he told a conservative podcaster last year.",
    "Mr. Vance had been trailing in most polls behind Josh Mandel, a former Ohio state treasurer who had also aggressively pursued Mr. Trumps backing, until the former presidents mid-April endorsement helped vault Mr. Vance ahead.",
    "Two-faced phony career politician Tim Ryan is too radical for the Buckeye State, and Ohio voters know it,? Rick Scott, the chairman of the National Republican Senate Committee, said in a statement congratulating Mr. Vance.",
    "As of noon on Wednesday in Indiana, 176,043 votes had been counted, a turnout of about 15 percent in a state with 4,738,187 registered voters, according to the secretary of states office, compared with 20 percent in 2018.",
    "He rejected the notion that Ohio was a red state and said he planned to aggressively pursue voters who supported Matt Dolan, the least Trump-focused of the Republican candidates, who took more than 23 percent of the vote.",
    "But he tapped into his own fortune to fund more than $11 million in television ads as he cut a path separate from the rest of the Trump-focused field by refusing to amplify the falsehood that the 2020 election was rigged.",
    "Vance was born in 1984, the city hollowed out as blue-collar jobs left, opioids arrived, marriages dissolved and much of the industrial Midwest became a hub of misery? for the white working class, he wrote in his memoir.",
    "Turnout in both states on Tuesday slightly lagged behind the percentage of people who voted in the 2018 midterm contests in those Republican-controlled states, according to unofficial totals released by Ohio and Indiana.",
    "Midterms 2022 Daily Briefing\nThe contours of what is expected to be an intense and closely watched Ohio Senate contest have begun to emerge, with Representative Tim Ryan, the Democrat in the race, and the Republican J.D.",
    "A Trump-endorsed Pence (not that one) won his primary in Indiana\nRepresentative Greg Pence, a Republican and an older brother of former Vice President Mike Pence, easily beat his nominal primary opponent, James Alspach.",
    "Republicans have sharply run up their margins among working-class white voters and in more rural areas, offsetting the losses that the party has suffered in the states suburbs around cities like Columbus and Cleveland.",
    "This is ridiculous.?\nMuch of the race was shaped by huge sums spent on television  nearly $80 million, according to the ad-tracking firm AdImpact, with a lot of it coming from outside groups and out-of-state donors.",
    "The contest, which saw nearly $80 million in television advertising, was one of the most anticipated of the 2022 primary season for its potential to provide an early signal of the direction of the Republican Party.",
    "In the fall, he will be running against Nan Whaley, the former mayor of Dayton, who won the Democratic nomination on Tuesday, becoming the first woman in Ohio history to be nominated by a major party for governor.",
    "Mr. Ryan echoed some of Mr. Trumps rhetoric, if with a slight tweak: Right now, we have to be Americans first,? Mr. Ryan said in a TV ad, the last two words sounding similar to Mr. Trumps America First? agenda.",
    "But the results also captured some of the tensions and demographic trade-offs of a Republican Party pulled in different directions as Mr. Dolan was strongest in the voter-rich cities of Cleveland and Columbus.",
    "Ohios Republican Senate primary, a grueling test of fealty to former President Donald J. Trump, may have set a record for primary spending in the state, but that did not translate to a surge in voter turnout.",
    "Shontel Brown defeated her progressive challenger, Nina Turner, again\nRepresentative Shontel Brown, a Democrat, last defeated Nina Turner in a special election for this Ohio House seat just nine months ago.",
    "Mr. Ryan, who ran for president in 2020 complaining that the party had abandoned working-class voters, easily defeated two lesser-known, lesser-funded primary challengers: Morgan Harper and Traci Johnson.",
    "Mr. DeWine, a low-key career politician who has been in elected office since the mid-1970s, won bipartisan praise for his handling of the pandemic  though not from Mr. Renacci, who wielded it against him.",
    "Mr. Vances metamorphosis from an outspoken Never Trump? Republican in 2016 to a full-throated Make America Great Again warrior in 2022 echoes the ideological journey of much of the party in recent years.",
    "For some Republican voters, the primary was animated by fears that traditional family values and a white American culture were under attack by far-left Democrats, establishment Republicans and elites.",
    "At a restaurant in the Cleveland suburb of Beachwood on Tuesday, more than a dozen Mandel supporters and campaign volunteers struck an optimistic tone at the start of the night, expressing confidence.",
    "A third candidate, State Senator Matt Dolan, ran as a more traditional Republican, sometimes mocking his rivals for their unrelenting focus on the former president instead of Ohio issues and voters.",
    "Once the quintessential presidential swing state, Ohio broke for Mr. Trump by 8 percentage points in both 2016 and 2020, ending a half-century streak of the state backing the national winner.",
    "The elder Mr. Pence joined more than 140 other Republicans in the House in voting to overturn the presidential election results after a mob of Trump supporters attacked the Capitol on Jan. 6.",
    "He was raised largely by his maternal grandparents, particularly the grandmother he called Mamaw, who loved the Lord,? loved the F-word? and owned 19 handguns, he said on the campaign trail.",
    "The newly drawn district in the northern part of the state now tilts Republican, and attracted three well-funded Republican candidates, as well as spending from outside interest groups.",
    "On Morning Joe? on Wednesday, the hosts quizzed Mr. Ryan on his chances of victory in November in a state that has become far more Republican and conservative in the past eight years.",
    "In Florida, there was the battle for Mr. Trumps approval at Mar-a-Lago, the former presidents private club, with public shows of fealty, lobbying by surrogates and shuttle diplomacy.",
    "If the whole issue in the campaign is who is most Trump-like, expect it to work against you when you dont get the endorsement,? said Rex Elsass, an Ohio-based Republican strategist.",
    "Vance may have said some not so great things about me in the past,? Mr. Trump said in announcing his choice, but he gets it now, and I have seen that in spades.?\nCINCINNATI  J.D.",
    "But a fuller assessment of Mr. Trumps sway will come through a series of primaries in the next four weeks  in West Virginia, North Carolina, Idaho, Pennsylvania and Georgia.",
    "Mr. Ryan has pitched himself as the best alternative for Republicans and independents who are sick of the mudslinging, conspiracy theories and extreme language on the right.",
    "Democrats fierce opposition to Mr. Trumps nomination of Judge Kavanaugh to the Supreme Court in 2018 appeared to be a turning point in Mr. Vances political transformation.",
    "The younger Mr. Pence, whom some in the mob had targeted, angered Mr. Trump and his supporters by saying he did not have the constitutional power to overturn the results.",
    "National conservatives lean right on issues like diversity and immigration restrictions but lean left on economics, opposing unfettered free trade, especially with China.",
    "When that book was published in 2016, it was devoured by the coastal elites? he now rails against as a means for them to decode white working-class support for Mr. Trump.",
    "Two Democratic heavyweights offered their endorsements late in the race: President Biden, for Ms. Brown, and Representative Alexandria Ocasio-Cortez, for Ms. Turner.",
    "Rob Nichols, a spokesman for the Ohio secretary of state, said in an email on Wednesday that the total would increase slightly once an official canvass is completed.",
    "Ive been talking about this and fighting for these things for 20 years,? Mr. Ryan said, referring to his track record of building industry jobs and taking on China.",
    "In Ohio, about 1.6 million of 8 million registered voters, or just under 21 percent, cast ballots in the primaries, according to the secretary of states office.",
    "The second, Representative Bob Gibbs, was aligned with Mr. Trump but was forced into the race against Mr. Miller late in his campaign, because of redistricting.",
    "Mr. Vances book pointed inward to explain the woes of his community: He blamed a personal lack of agency? for drug abuse, welfare dependency and chaotic lives.",
    "On the campaign trail, Mr. Vance blamed corporations for shipping jobs to China and accused liberals of opening borders to cheap labor and opioid traffickers.",
    "But Mr. Ryan faces an uphill race in a state that has trended Republican and in a year when his party is saddled with President Bidens low approval ratings.",
    "Vances Rise: The author of Hillbilly Elegy? owes his ascendant political career in large part to Donald J. Trump, whose style he has tried to emulate.",
    "Mr. Mandel told the crowd that he called Mr. Vance to congratulate him on a hard-fought victory? and would do what he could to help get him elected.",
    "Mr. Thiel, the Silicon Valley investor, seeded a pro-Vance super PAC with $10 million in early 2021  months before Mr. Vance even entered the race.",
    "Town Hall Tour,? explained to modest crowds that he had undergone a political evolution, recognizing that Mr. Trump was right on issue after issue.",
    "Mr. Vance is one of two former Thiel employees  the other is Blake Masters in Arizona  running for Senate with Mr. Thiels hefty financial backing.",
    "Mr. Vance went to work as a venture capitalist in San Francisco for Peter Thiel, a billionaire founder of PayPal, whom he had heard speak at Yale.",
    "In a verbal flub that seemed almost fitting to how the candidates ran, Mr. Trump accidentally conjoined the names of two rivals over the weekend.",
    "In one episode last year, multiple Ohio candidates vied for Mr. Trumps support in front of one another at an impromptu meeting at Mar-a-Lago.",
    "His critics, including Republican rivals in Ohio, said he had turned himself inside-out to mimic Mr. Trumps bellicosity in pursuit of votes.",
    "Ohios consequential Republican Senate primary dominated much of the attention on Tuesday evening, but it was far from the only race decided.",
    "At one debate, Mr. Dolan was the lone candidate to raise his hand to say the former president should stop talking about the 2020 election.",
    "As a candidate, Mr. Vance had struggled to translate celebrity as an author into broad recognition and support from the Republican base.",
    "Mr. Thiel, a Silicon Valley conservative, also influenced Mr. Vances politics, especially his opposition to China and to immigration.",
    "At Yale, he met a fellow student he would marry, Usha Chilukuri, who went on to clerk for an appeals court judge, Brett M. Kavanaugh.",
    "Many had tried to position themselves in the mold of Mr. Trump, but it appears that the former presidents backing mattered the most.",
    "Winners and Losers: A progressive challenger was defeated (again) in Ohio, and a Trump-endorsed Pence (not that one) won in Indiana.",
    "Mr. Trump carried Ohio in the past two presidential elections, winning more than 3.1 million votes in 2020  a record in the state.",
    "Additional absentee ballots, including those from members of the military and people overseas, were still being counted, he said.",
    "The conservative Club for Growth spent more than $12 million on television ads aimed to boost Mr. Mandel or tear down his rivals.",
    "Mr. Thiel had served as a key link between Mr. Vance and Mr. Trump, attending an introductory meeting between them in early 2021.",
    "The stakes are too high for this country to not support the nominee,? Mr. Mandel said to a round of applause in the room.",
    "He accused Mr. Vance of leaving the state for San Francisco to become a celebrity and to make millions in Silicon Valley.",
    "He has the backing of the billionaire Peter Thiel, and he won with a boost from Mr. Trumps late endorsement in the race.",
    "The states election results website showed that more than 25 percent of precincts still had not reported their totals.",
    "Mr. Dolan had toiled for most of the contest far behind the polling leaders, avoiding direct attacks from his rivals.",
    "Mr. Mandel had been the front-runner for much of the race, casting himself as the true pro-Trump candidate (Pro-God.",
    "But that became an all-but-impossible argument to prosecute in the final weeks after Mr. Trump picked Mr. Vance.",
    "Trumps popularity in the Vance household went up substantially during the Kavanaugh fight,? he recalled in 2019.",
    "Mr. Vance had transformed himself from a Never-Trumper in 2016 into a grateful recipient of Mr. Trumps support.",
    "He defeated a crowded field of candidates  most notably, Josh Mandel, Mike Gibbons, Matt Dolan and Jane Timken.",
    "Mr. Miller was accused of assault by an ex-girlfriend, Stephanie Grisham, a former White House press secretary.",
    "Senate primary was a strong affirmation of the former president's continued dominance of the Republican Party.",
    "Mr. DeWine mainly stuck to bread-and-butter issues on the campaign trail, like cutting taxes and adding jobs.",
    "Mr. Vance, 37, grew up in Middletown, Ohio, where a grandfather had moved from Kentucky for a steel mill job.",
    "The first was Representative Anthony Gonzalez, who called Mr. Trump a cancer? and retired after two terms.",
    "Allen Carter, a spokesman for the secretary of state, emphasized that the totals were still preliminary.",
    "In Ohio, there was the typical fevered competition for votes, in town halls, debates and television ads.",
    "Most of the Republican field had aggressively auditioned for the former presidents seal of approval.",
    "With more than 90 percent of the vote counted, Mr. Vance was leading across almost the entire state.",
    "Out of high school, Mr. Vance enlisted in the Marines and served in Iraq doing public affairs work.",
    "But as a politician, he has pointed the finger outward, at external enemies, just as Mr. Trump did.",
    "He was perpetually running behind his rivals in polling, and Mr. Thiels millions were nearly gone.",
    "Mr. DeWine had almost double the votes of his closest rival, Jim Renacci, a former House member.",
    "Mr. Thiel poured $13.5 million into a political action committee to support Mr. Vances race.",
    "The result delivered a strong affirmation of Mr. Trumps continued grip on his partys base.",
    "And in Indiana, the lack of a contested statewide primary appears to have stunted turnout.",
    "Here is a rundown of the winners and losers in some of the most important contests:\nJ.D.",
    "Ohio Takeaways: It was a good night for Mr. Trump, and not just because of Mr. Vance.",
    "The Senate primary was unusual in the extent that it unfolded in two places at once.",
    "Mr. Vance first pitched Mr. Trump at a meeting at Mar-a-Lago brokered by Mr. Thiel.",
    "Mike DeWine, a Republican who doesnt sound like Trump, easily won his primary\nGov.",
    "Donald Trump Jr. and the Fox News host Tucker Carlson also lobbied for Mr. Vance.",
    "He returned home a man in a hurry, sailing through Ohio State in under two years.",
    "And this time around, the Congressional Progressive Caucus PAC backed Ms. Brown.",
    "Vance embarking on their first moves since clinching their parties nominations.",
    "But it was not too long before Mr. Mandel took the podium to deliver the news.",
    "The intimate voice of Hillbilly Elegy? yielded to a darker tone and language.",
    "Trump-style Republicans did not prevail in the other top contest on Tuesday.",
    "He opted to retire, which more or less cleared the field for Mr. Miller.",
    "He castigated idiots? in Washington and scumbags? in the news media.",
    "The turnout was just under half-a-percent less than it was in 2018.",
    "But all that turned around with Mr. Trumps endorsement on April 15.",
    "Weve endorsed J.P., right?? Mr. Trump said at a rally in Nebraska.",
    "On Morning Joe? Wednesday, he doubled down on this line of attack.",
    "Vance won Ohios marquee race, the Republican Senate primary\nJ.D.",
    "The politics of Ohio have changed drastically in the Trump era.",
    "Mr. Miller has denied the accusation and has sued Ms. Grisham.",
    "Those voters are going to be Tim Ryan voters,? Mr. Ryan said.",
    "The older Mr. Pence has said he stands by his brother.",
    "Mr. Vances mother, Bev, struggled with drug addiction.",
    "Two incumbents in the district declined to run.",
    "Jazmine Ulloa reported from Beachwood, Ohio.",
    "Shane Goldmacher reported from Cincinnati.",
    "Pro-Trump? was the tagline in his TV ads).",
    "These were some of the key results.",
    "Before the 2016 election, J.D.",
    "Mr. Vance scolded them both.",
    "They need a representative.",
    "Vances win in Ohios G.O.P.",
    "Now she has done it again.",
    "In the years after J.D.",
    "Come on,? he said.",
    "Trumps Grip: J.D.",
    "Heres why.",
    "Sit down.",
    "Pro-Guns.",
    "J.D.",
    "Gov.",
    "J.D.",
    "Gov."
  ]
}