{
  "id": 5798,
  "mediaId": 195,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "The Hills Morning Report  Roe, Ohio primary dominate",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/supremecourtabortion2_050322ap.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/morning-report/3476659-the-hills-morning-report-roe-ohio-primary-dominate/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    3103
  ],
  "sentences": [
    "Roberts, who has publicly lamented an era in which the Supreme Court is increasingly perceived by Americans as a black-robed arm of American politics, suggested the draft opinion, which would leave abortion law to states, does not represent a decision by the court or the final position of any member on the issues in the case.?\nPresident Biden and Democratic lawmakers believe the courts majority is intent on overturning Roe, which is not exactly a surprising assessment among court watchers who have listened to oral arguments in the pending Mississippi case and sized up the justices.",
    "Senate Minority Leader Mitch McConnell (R-Ky.) assailed the leak to the news media and complained about liberals? who he said want to rip the blindfold off lady justice.? Sen. Susan Collins (R-Maine), who supports Roe and would like to codify the landmark ruling in law, said Justices Brett Kavanaugh and Neil Gorsuch were inconsistent? when they told her that they viewed the 1973 abortion decision as settled law (The Hill).",
    "If you have the Trump endorsement and money to tell voters that you have the endorsement, you should not lose, whether youre running for city council or Senate.?\nElsewhere in the Buckeye State, Rep. Shontel Brown (D-Ohio) won her second consecutive House contest in as many years over Nina Turner, a progressive favorite of Sen. Bernie Sanders (I-Vt.), toppling her with 66.3 percent to 33.7 percent.",
    "Rocket Lab, a New Zealand company founded by Peter Beck, attempted to do just that on Tuesday and was partially successful in its quest that he likened to a supersonic ballet.? After briefly snagging the it, the helicopter was shortly after forced to drop it  the company was hoping to make it reusable  into the Pacific Ocean.",
    "We know that the United States is leading our allies and partners and the world to make sure the Ukrainians who are fighting for the future of the nation have the weapons and the capacity, ammunition and equipment to defend themselves against Putins brutal war,? Biden said at the plant (The New York Times).",
    "On Tuesday, the president initially sidestepped legalese references to the Constitution and in a written reaction spoke instead about a need to preserve basic fairness and the stability of our law.? He called on voters to elect more officials who support abortion rights at the federal level (The Hill).",
    "U.S. cases of COVID-19 infection are rising, but most cities and localities are doing nothing new to encourage masking, social distancing or indoor precautions to mitigate transmission during a pandemic phase that largely leaves decision making up to individuals and businesses (The Associated Press).",
    "? INTERNATIONAL\nNorth Korea earlier today launched a ballistic missile, according to South Korean and Japanese officials, a swift action only days after leader Kim Jong Un announced plans to ramp up the development of nuclear weapons at the fastest possible pace? with the intention of using them.",
    "Woulda, Coulda, Shoulda Flashback: In 2007, then-Sen. Barack Obama (D-Ill.), at a time when Democrats had a large Senate majority, promised Planned Parenthood that the first thing Id do as president? would be to sign the Freedom of Choice Act, which would have effectively codified Roe v. Wade.",
    "ELSEWHERE\n? DISTRICT WATCH\nTrumps businesses and inaugural committee and Washington, D.C., Attorney General Karl Racine (D) settled a lawsuit on Tuesday over allegations that they overpaid to hold events at Trump International Hotel and unnecessarily stuffed the 45th familys coffers.",
    "As The Hills John Kruzel notes in his analysis, the next fight could be in state courts, and if a majority of Supreme Court justices decides after 49 years that privacy protection for rights involving reproduction is a myth in the Constitution, what other rights are at risk?",
    "The shocking medical mistake was caught before she was incinerated, but it also resulted in the firing of several officials and the revocation of the license of one attending physician, according to confirmation of the incident in China (The Wall Street Journal).",
    "Theres a reason why everyone in this race wanted his endorsement  Anyone who would have gotten it would have won,? another GOP operative with Ohio ties said, adding that internal polling showed Vance hovering around 10 to 11 percent before Trumps announcement.",
    "This morning, official Washington is poring over headlines about the Supreme Court and the uncertain future of reproductive rights in America as well as a separate barometer of former President Trumps sway drawn from Tuesdays primary victories in key states.",
    "In addition, the Biden administration continued to promote its aid efforts for Ukraine as Biden visited a Lockheed Martin facility in Troy, Ala., that manufactures Javelin anti-tank missiles the U.S. is sending to Ukraine to back them against Moscow.",
    "In total, 101 individuals  mostly elderly people, women, and young children  emerged from Azovstal steelworks after roughly two months and were moved elsewhere, including to Zaporizhzhia, a Ukrainian-controlled city to the northwest of Mariupol.",
    "Elsewhere in the conflict, Pope Francis said in an interview on Tuesday that he offered to travel to Moscow to meet with Russian President Vladimir Putin in an attempt to end the war in mid-March but never heard back from the ex-KGB officer.",
    "One thing was clear on Tuesday: The leaked opinion threw fuel on a political fire that will impact candidates and mobilize voters, no matter how the justices ultimately rule on this terms abortion case, reports The Hills Alexander Bolton.",
    "Moderate Republican voters, many of them women, may personally oppose abortion but also oppose overturning womens right to make such decisions with their physicians, according to recent interviews with two former House GOP members.",
    "He and first lady Jill Biden will welcome Team USA athletes to the South Lawn at 11:30 a.m. to celebrate their achievements in the Tokyo 2020 Summer Olympic and Paralympic Games and Beijing 2022 Winter Olympic and Paralympic Games.",
    " The Associated Press: Most pregnancy terminations in the United States occur before 13 weeks, are sought by women in their 20s and by women who have at least one child, and result from a pill rather than a medical procedure.",
    "A draft opinion written by Justice Samuel Alito on behalf of a Supreme Court majority supportive of overturning a constitutional right to abortion was leaked to Politico by someone assumed to be close to one of the justices.",
    "However, the move has implications on the midterm scene, as Delgados district, which encompasses the northernmost New York City district and stretches north to the area south of Albany, was a top GOP target in November.",
    "A study suggests that some COVID-19 mutations detected in South Africa and the United Kingdom (and detected in the United States at low levels) may evade patient immunity acquired from previous infections (The Hill).",
    "But theres a hitch: There are not enough Senate votes to change the 60-vote Senate filibuster rule to make that possible and at least one Democrat, Sen. Joe Manchin (W.Va.), is an abortion rights opponent (The Hill).",
    "In Indiana, the only other state holding primary races, Erin Houchin took home the GOP nomination in the states 9th Congressional District, topping a nine-candidate field that included former Rep. Mike Sodrel (R-Ind.",
    "The Hillbilly Elegy? author, who initially trailed in the race before Trumps endorsement (The Hill), In November will take on Rep. Tim Ryan (D-Ohio), who cruised to the Democratic nomination (The Hill).",
    "Russian forces took another step to taking over Mariupol on Tuesday as they launched rockets at a steel mill containing the citys last line of defense after civilians were evacuated from the locale.",
    "Vance, buoyed by Trumpsendorsement, took home the Ohio GOP Senate primary on Tuesday night, handing the ex-president a big win amid questions about Trumps role as kingmaker in the Republican Party.",
    "According to Mariupol Mayor Vadym Boichenko, more than 200 civilians are still at the steel mill, and 100,000 civilians remain in the city that has been under siege for weeks by Moscow (Reuters).",
    "Delgado is the 33rd House Democrat to leave the chamber this cycle due to retirement or a run for another office ahead of what is expected to be a rough-and-tumble year for the party (The Hill).",
    "LEADING THE DAY\n? UKRAINE CRISIS\nRussian forces stormed the Mariupol steel plant on Tuesday following the escape by some civilians from the stronghold defended by Ukrainian forces for months.",
    " Adam Liptak, The New York Times: The leak of a draft majority opinion overruling Roe v. Wade raises questions about motives, methods and whether Supreme Court defections are still possible.",
    "Delgados absence is a major boon to the GOP and Dutchess County Executive Marc Molinaro, the Republican primary front-runner barring any changes to the state lines during redistricting.",
    "The company launched the Electron rocket, which sent 34 satellites into space, in the morning from the Mahia Peninsula in New Zealand before its attempt at catching it on descent.",
    "The president will speak at 2 p.m. in the Roosevelt Room about the economy, jobs and deficit reduction.? Biden and Harris will receive a weekly economic briefing at 3:30 p.m.",
    "You cant imagine how scary it is when you sit in the shelter, in a wet and damp basement which is bouncing, shaking,? Elina Tsybulchenko, 54, said after arriving in the city.",
    " The Smithsonian National Zoo said Tuesday that a wild fox broke onto its premises and killed 25 flamingos and a duck on Monday and zookeepers are devastated? (The Hill).",
    "IN FOCUS/SHARP TAKES\n? MORE CONGRESS\nThe House Democratic Caucus saw another lawmaker bolt their ranks as Rep. Antonio Delgado (D-N.Y.) was tapped by New York Gov.",
    "? CORONAVIRUS\nFor children under age 5, Pfizer is still testing three extra-small doses of its COVID-19 vaccine after two shots were too weak in research trials.",
    "As of this morning, Vance won 32.2 percent of the vote over 23.9 percent for former Ohio Treasurer Josh Mandel and 23.3 percent for Ohio state Sen. Matt Dolan.",
    "In Shanghai on Sunday, an elderly woman suffering from COVID-19 was enclosed in a yellow body bag and was headed for cremation when she was discovered alive.",
    "The vice president and second gentleman Doug Emhoff will attend the South Lawn event hosting U.S. Olympic and Paralympic athletes, coaches and supporters.",
    "https://politi.co/3LCm13w\n The Supreme Court is about to politically enrage a generation of young women, by Sara Guillermo, opinion contributor, The Hill.",
    "Biden and abortion rights advocates in the Senate, including at least two Republicans, have talked about giving Roe v. Wade the protection of federal law.",
    "The indictment stemmed from Benjamins alleged work to send a $50,000 state-funded grant to an organization in exchange for campaign contributions.",
    "The Federal Reserve will issue a policy statement at 2 p.m. concluding a two-day meeting, and Chairman Jerome Powell will hold a news conference.",
    "The White House daily press briefing is scheduled at 2:30 p.m.\n Associated Press / Evan Vucci | President Biden speaks to reporters on Tuesday.",
    "Vice President Harris delivered a forceful speech about womens rights Tuesday night to an EMILYs List pro-choice political audience (The Hill).",
    " The Smithsonian Institution rolled out a new policy on Tuesday allowing its museums to return items that were looted or acquired unethically.",
    "Delgado replaces Brian Benjamin, who resigned from the post in April after he was arrested on charges related to campaign finance fraud.",
    "By 2009, he told reporters as president that such legislation was not his highest legislative priority.?\n? POLITICS & PRIMARIES\nJ.D.",
    "Young voters have never experienced life in which half the states might make abortion illegal, punishable with criminal penalties.",
    "The answer is in November,? Senate Majority Whip and Judiciary Committee Chairman Dick Durbin (D-Ill.) told reporters (Politico).",
    "Chief Justice John Roberts, who was not grouped among the conservative majority in Alitos brief, promised a leak investigation.",
    "Treasury Secretary Janet Yellen will participate in a conversation at the Wall Street Journals CEO Council Summit at 11:30 a.m.",
    "g Hill.TVs Rising? program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    "Senate Majority Leader Charles Schumer (D-N.Y.) and Speaker Nancy Pelosi (D-Calif.) on Tuesday condemned Alitos draft opinion.",
    "Mike DeWine (R) easily surmounted a challenge by former Rep. Jim Renacci (R-Ohio) by a 20-percentage point margin (The Hill).",
    "The people who are caught between the corrupt political class of the left and the right, they need a voice,? Vance continued.",
    "Kevin Stitt signed into law an abortion ban after about six weeks of pregnancy, modeled on the restrictions of a Texas law.",
    "It was slowed by a parachute at the time the helicopter made its semi-oops catch-and-drop maneuver (The Associated Press).",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Secretary of State Antony Blinken meets virtually at 9 a.m. with ASEAN Civil Society representatives at the department.",
    " The Associated Press: If the high court overturns Roe v. Wade, the abortion fight heads to the states (and to voters).",
    " Associated Press / Screenshot from video | Smoke rises from the Metallurgical Combine Azovstal in Mariupol on Tuesday.",
    "The first lady will also deliver remarks at the Kuwait-America Foundation Gala Dinner in Washington, D.C. at 7:15 p.m.",
    "One evacuee told The Associated Press that she slept every night worried that she would not wake up the next day.",
    "Trump still matters,? one Ohio GOP operative simply told the Morning Report overnight when pressed for takeaways.",
    "Current average U.S. COVID-19 daily deaths are 318, according to the Centers for Disease Control and Prevention.",
    "The company hopes to have a just-right formula to show federal regulators by early June (The Associated Press).",
    "Related Articles\n Politico: A mole hunt, a secret website and Peter Thiels big risk: How Vance won his primary.",
    "According to Racines office, Trump will pay the district $750,000 to resolve a lawsuit (The Associated Press).",
    " The Wall Street Journal: Could the unknown leaker of the Supreme Court draft opinion face criminal charges?",
    "But first, heres a look at where the high court and its landmark 1973 Roe v. Wade stand as of this morning.",
    "Total U.S. coronavirus deaths reported as of this morning, according to Johns Hopkins University: 994,748.",
    "The democratic neighbor to the south has labeled such launches as a grave threat? (The Associated Press).",
    "OPINION\n Alito wants a brawl and looks likely to get one, by John F. Harris, founding editor, Politico.",
    "The Ohio race was the first Senate contest this month where Trumps blessing went under the microscope.",
    " Politico Europe: German Chancellor Olaf Scholz holds off on Ukraine visit, citing diplomatic snub.",
    " ESPN: U.S. reclassifies WNBA star Brittney Griner as wrongfully detained? by Russia, sources say.",
    "https://bit.ly/3KHkhEI\nWHERE AND WHEN\nThe House meets for a pro forma session on Friday at 10 a.m.",
    " James Hohmann, The Washington Post: Vances win cannot mask the GOP counterstrikes against Trump.",
    "Under the new rules, various museums will give back some items in their collections (The Hill).",
    "And thats going to be me.?\nThe victory is significant for Vance and perhaps bigger for Trump.",
    "The launch into the Sea of Japan marked North Koreas 14th round of weapons firing this year.",
    "She is the favored candidate to win in November and replace Rep. Trey Hollingsworth (R-Ind.",
    "Follow us on Twitter (@alweaver22 & @asimendinger) and suggest this newsletter to friends!",
    "It also took place only days before Yoon Suk-yeol takes over the South Korean presidency.",
    "The secretary will speak at 8 p.m. at the Kuwait-America Foundation dinner in Washington.",
    " Associated Press / Rocket Lab via AP | Electron rocket blasts off May 3 in New Zealand.",
    " The Associated Press: Defense leaders say Russia is learning from mistakes in Ukraine.",
    " The Hill: NASA chief denies reports Russia is exiting the International Space Station.",
    "More Black women than white women get abortions, according to the Guttmacher Institute.",
    " And were going to be the party that does it,? Vance said at his victory night event.",
    "THE CLOSER\nAnd finally  Catching a falling rocket with a helicopter is no easy task.",
    "She will contribute to a weekly economic briefing for Biden and Harris at 3:30 p.m.",
    " Salena Zito, Washington Examiner: Appalachia gets a voice with Vances win in Ohio.",
    "g? Introducing NotedDC, The Hills curated commentary on the beat of the Beltway.",
    " The Hill: U.S. defense industry strained by Ukraine weapons deliveries.",
    "also coasted to renomination, with neither facing tough primary fights.",
    "Kathy Hochul (D) to serve as the Empire States lieutenant governor.",
    "The president will receive the Presidents Daily Brief at 10:15 a.m.",
    "He added that he still wants to make a meeting happen (Reuters).",
    "We invite you to join the discussion on Facebook and Twitter.",
    "He meets at 11 a.m. with Swedish Foreign Minister Ann Linde.",
    " The New York Times: On Tuesday, Oklahoma Republican Gov.",
    "In August, Brown defeated her by 6 percentage points.",
    "The Hill: Momentum builds for major cannabis bill.",
    "Click here to subscribe to our latest newsletter.",
    "Ladies and gentlemen, Tim Ryan needs to go down.",
    "Well get to the GOP primary battles in a moment.",
    "), who was backed by the House Freedom Caucus.",
    "), who is retiring (The Associated Press).",
    "Also, check out the Rising? podcast here.",
    "Email: Alexis Simendinger and Al Weaver.",
    "Stay Engaged\nWe want to hear from you!",
    "Rob Portman (R-Ohio), who is retiring.",
    "It was subsequently retrieved.",
    "The Senate convenes at 10 a.m.",
    "and Rep. Greg Pence (R-Ind.)",
    "The winner will succeed Sen.",
    "They need a representative.",
    "Sen. Todd Young (R-Ind.)",
    "Legal experts weigh in.",
    "Others agreed.",
    "See all Video",
    "Ohio Gov.",
    "ET.",
    "ET."
  ]
}