{
  "id": 5811,
  "mediaId": 187,
  "date": "d2022-05-04T04:13",
  "headline": "The Art of the Dealer",
  "image": "https://cdn.theatlantic.com/thumbor/6-qft-m3e_xD2GRwlruQ0NjaoSs=/0x261:6317x3814/1952x1098/media/img/mt/2022/05/GettyImages_1240386646/original.jpg",
  "link": "https://www.theatlantic.com/ideas/archive/2022/05/jd-vance-ohio-senate-trump-cultural-heroin/629754/",
  "sentiment": "0",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David A. Graham",
  "authorUrl": "https://www.theatlantic.com/author/david-a-graham/",
  "termIds": [
    781,
    946,
    1147,
    1506,
    2027,
    2465,
    3103,
    4000,
    4168,
    4405,
    4658
  ],
  "sentences": [
    "The charitable interpretation of Vances pivot is that Trumps unexpected success in 2016 demonstrated that contrary to Vances prior assumptions, there was a way to talk about the issues they both cared about and win electionsand after all, the best way to solve the problems is to hold power.",
    "Vance has tried, sloppily, to convey this: If I actually care about these people and the things I say I care about, I need to just suck it up and support him.? (He can cast aspersions on The Atlantic all he wants, but he was much more articulate when he was writing here.)",
    "He has blamed Mark Zuckerberg for Trumps loss in 2020, flirted with election-fraud conspiracies, charged into culture-war attacks on Alec Baldwin and LeBron James, and found a steadfast ally in Marjorie Taylor Greene.",
    "Forcing the man who once called him cultural heroin? and Americas Hitler? to debase himself with lavish displays of fealtyand then carrying him to victoryis both more entertaining and a greater show of force.",
    "After winning the former presidents endorsement last month, Vance overcame a ham-fisted campaign and rose from the middle of the pack to triumph in Tuesdays GOP primary for U.S. Senate in Ohio.",
    "Vance defeated a field that included Josh Mandel, a former state treasurer who also desperately sought Trumps backing, and Matt Dolan, who tested whether a counter-Trump message could prevail.",
    "As the conservative pundit Christopher Caldwell noted this weekend, Vance and Trumps diagnoses of what had gone wrong were never that far apart; where they differed was in their prescriptions.",
    "Neither Mandel nor Vance was an original Trump backer, but Mandel jumped on the bandwagon sooner and never lambasted Trump the same way Vance did, and he led the race for months.",
    "Reflecting on how heroin and prescription opioids had ravaged his home state of Ohio, Vance worried that a certain Republican candidate for president would have a similar effect.",
    "The Republican lean of both the Buckeye State and the midterm elections mean hes in a strong position to defeat Democrat Tim Ryan and become a senator next January.",
    "When he wanted to sell books to cosmopolitans, he marketed himself as a bold truth-teller; when he wanted to win a Senate seat, he boldly discarded his old ideas.",
    "Instead, its Vance who has had a realization: Hes decided that Trumps cultural heroin is too powerful to resist, so he might as well become a dealer.",
    "Trump delights in humiliating former critics, but not since Mitt Romney winced over his frog-leg dinner has Trump delivered such an exquisite flex.",
    "Even if the men agreed on the problems facing America, Trumps term in office showedjust as Vance predictedthat he was unable to address them.",
    "They may or may not realize it; many may be cynical about their futures but happy to just have someone sticking it to their cultural enemies.",
    "Expect a race as full of ostentatious displays of masculinity and earthiness as a Yale Law-educated venture capitalist and a yogi can summon.",
    "He never offers details for how these plans will work, because he cant.?\nTrump didnt produce the manufacturing bounce-back he promised.",
    "Vance once decried Trump as cultural heroin.? Now, hes won the Republican nomination for Senate in Ohio by peddling Trumpism.",
    "Vance started doing his best to sound like every other MAGA candidate in the country, he had an ear for a metaphor.",
    "That may be understandable, but its the sort of nihilist scapegoating 2016-era Vance would probably have rejected.",
    "And he botched the response to a pandemic that has disproportionately killed people in places that voted for him.",
    "The standard view among progressives and never-Trump conservatives is that Vances choices are purely craven.",
    "But he cannot fix what ails them, and one day theyll realize it,? he wrote in The Atlantic in July 2016.",
    "Vance\nIf Vances Trump-fueled victory tells us little new about Trump, what does it say about Vance?",
    "Mandel? at a weekend rallydemonstrates once again that he has a sense of humor, if a warped one.",
    "Vances late surge is the latest demonstration of Trumps enduring hold over the Republican Party.",
    "Trumps promises are the needle in Americas collective vein,? Vance wrote back then.",
    "Trumps decision to endorse Vanceinsofar as he remembered it, referring to J.D.",
    "His economic policies mostly favored the wealthy, not the working class.",
    "But the best rejoinder to this interpretation comes from Vance himself.",
    "To every complex problem, he promises a simple solution,? Vance wrote.",
    "On the campaign trail, however, Vance has adopted Trumps stump style.",
    "In the crudest electoral terms, Vances epiphany proved right.",
    "He then ended his term by fomenting a violent insurrection.",
    "He would have been the obvious choice for an endorsement.",
    "None of this will help left-behind Ohioans, as he knows.",
    "He didnt build the wall, and it didnt stop overdoses.",
    "What Trump offers is an easy escape from the pain.",
    "But its worth considering the alternative.",
    "Tom Nichols: The moral collapse of J.D.",
    "Today, hes happy to help you get a fix.",
    "He makes some feel better for a bit.",
    "[Donald] Trump is cultural heroin.",
    "But wheres the fun in that?",
    "It was a catastrophe.",
    "Long ago, before J.D.",
    "(It couldnt.)",
    "J.D."
  ]
}