{
  "id": 5812,
  "mediaId": 195,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Five takeaways from the Ohio primaries",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/VanceJD.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3476558-five-takeaways-from-the-ohio-primaries/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    781,
    946,
    1801,
    2027,
    2495,
    3103,
    428,
    2614,
    2623,
    2845
  ],
  "sentences": [
    "LaRose, who oversees Ohios elections, previously said in November 2020 that it was irresponsible when Republicans say an election was stolen and dont have evidence.? However, in order to put his primary race away and get Trumps backing, he pivoted to say in February that the former president is right to say voter fraud is a serious problem.?\nIn Indiana, meanwhile, Sen. Todd Young won the GOP primary unopposed.",
    "Most polls leading up to the primary showed Dolan trailing Mandel, Vance and Gibbons, but early results from The Associated Press showed Dolan coming in third behind Vance and Mandel  notable, since Dolan has criticized Trump in the past and refused to embrace him during his campaign.",
    "Shortly after Vances nomination was announced, Ryans campaign blasted out an ad touting him as the true blue collar champion  a speed indicating that his argument was crafted in advance and ready to go as soon as the primaries were over.",
    "General election messaging takes shape\nRep. Tim Ryan (D-Ohio), who handily won the Democratic nomination Tuesday, was quick to preview his general election message, which appears to center around an appeal to working class voters.",
    "What a joke.?\nRyan, who represents a working-class district in the House, has spent years cultivating an image as a blue-collar champion, and the ad indicates that portrayal will be a cornerstone of his general election bid.",
    "Former Ohio Treasurer Josh Mandel, businessman Mike GIbbons and former Ohio GOP Chair Jane Timken all styled themselves as Trump acolytes, showing how embracing the former president is still seen as politically necessary.",
    "Now the party that we need to unify to fight Tim Ryan, its our Republican Party, ladies and gentlemen, it is the party of working people all across the state of Ohio, and it needs to fight and it needs to win,? he said.",
    "DeWine, who Trump had criticized, failed to get 50 percent of the vote, and two populist challengers combined got roughly half of primary voters support  indicating that DeWine was aided heavily by a crowded field.",
    "Trump has a good night\nFormer President Trump scored key victories on Tuesday, pulling Vance in the Senate GOP primary over the finish line and seeing a former aide clinch the nomination in a House race.",
    "The victories, especially Browns, cement the candidates ability to unify both wings of the Democratic Party at a time when the progressive and establishment flanks have been rattled by divisions.",
    "Lower down on the ballot, Max Miller, a former aide in the Trump administration, won the GOP primary for Ohios 7th Congressional District on Tuesday against three other Republicans.",
    "The loss comes less than a year after Brown defeated Turner during their first race against each other in the Democratic primary to replace former Rep. Marcia Fudge (D-Ohio).",
    "Millers campaign got an early boost with an endorsement from Trump, and the former presidents backing is largely credited with setting Miller apart in the crowded field.",
    "Polls leading up to the primary saw Vances support rising, but also suggested a possible late surge from rival Matt Dolan, who has been critical of the former president.",
    "Meanwhile, on the Democratic side, Rep. Shontel Brown faced a rematch against progressive Nina Turner in a race seen as a bellwether of the lefts power within the party.",
    "Voters headed to the polls on Tuesday for primaries in Indiana and Ohio, with the latter seen as a major test of Trumps political power ahead of the November midterms.",
    "State Sen. Matt Dolan, the only candidate not to bend the knee to Trump, came in third place, trailing Vance by over 9 points and earning about 23 percent of the vote.",
    "Mike DeWine (R) fended off a small handful of populist challengers by a wide margin, a victory after he faced grassroots pushback over early coronavirus restrictions.",
    "Dolan also performed well in the Columbus area, leading Vance by 10 points in Franklin County and narrowly leading him by less than a point in Licking County.",
    "But those voters largely abandoned the party in recent years to vote en masse for Trump  and winning them back is key to any hope Ryan will have in November.",
    "Among a crowded field of candidates in the Buckeye States Republican Senate primary, Trump chose to back venture capitalist and Hillbilly Elegy? author J.D.",
    "Progressives fail to deliver\nProgressive candidates running in Ohios Democratic primaries on Tuesday were easily defeated by their establishment opponents.",
    "Meanwhile, in the states 11th district primary, incumbent Rep. Shontel Brown (D-Ohio) defeated former state Sen. Nina Turner by roughly 30 percent.",
    "He became a celebrity, CNN analyst and a big hit at Washington cocktail parties,? Ryan said, knocking Vances past career as a venture capitalist.",
    "Still, Dolans performance in some of the states biggest population centers points to an ongoing challenge for Trump in urban and suburban areas.",
    "The authors late surge and ultimate win in a crowded primary field underscores the former presidents lingering power over the GOP grassroots.",
    "At the same time, all four former GOP Senate candidates were quick to concede to Vance and called for unity ahead of the general election.",
    "The tactic makes sense in Ohio, an erstwhile swing state packed with white voters without college degrees who historically voted Democrat.",
    "Primary exposes some signs of GOP divisions\nWhile Dolan did not come out on top in the primary, his performance defied expectations.",
    "Young has been cool on Trump, going so far as to say that he bore responsibility for the Jan. 6, 2021, attack on the Capitol.",
    "In the Democratic Senate primary, progressive Morgan Harper won just 17 percent of the vote, while Ryan won with 70 percent.",
    "JD Vance left Ohio for San Francisco to make millions and invest in companies that profit from globalization and free trade.",
    "Tuesdays primary also follows months of infighting and competition among Republicans, most for the sake of Trumps backing.",
    "The Democratic Senate Majority PAC highlights what it called the nasty, divisive GOP primary? in a statement on Tuesday.",
    "Incumbents hold on\nIncumbents had a good night Tuesday as well, with no major office holder getting ousted in a primary.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Still, his running unopposed and not drawing a Trump-aligned challenger marks an exception in this years midterm cycle.",
    "Ryan and Brown boasted establishment support from inside and outside of Ohio including Ohio Sen. Sherrod Brown (D-Oh.)",
    "The wins also raise questions for progressives going forward this cycle after endorsing a series of losses last year.",
    "Beyond Vances victory, Trumps influence was put in stark relief by the campaigns run by many of the other candidates.",
    "Ryan consistently led Harper in the polls going into the primary and was widely perceived as the races frontrunner.",
    "In the Cleveland area, Dolan carried 33 percent of the vote in Cuyahoga County, while Vance trailed at 25 percent.",
    "Vance, in his own victory speech, spoke on similar themes and directly appealed to that same swath of voters.",
    "Dolans performance can largely be attributed to his performance in the Cleveland and Columbus areas.",
    "However, Vance led Dolan in the greater Cincinnati region, which is not far from where he grew up.",
    "Ohio Secretary of State Frank LaRose also beat back his nearest primary challenger by 30 points.",
    "In nearby Geagua County, where Dolan lives, the state senator racked up 41 percent of the vote.",
    "Mike DeWine sought to beat back populist challengers critical of his coronavirus response.",
    "Now Vance says he feels out of place in Ohio, and he wants to represent you in the Senate?",
    "At the same time, the Club for Growth angered Trump and his allies by backing Josh Mandel.",
    "Still, those races also underscored how much the GOP has moved in Trumps direction.",
    "Trump was largely credited with providing a late jolt to Vances campaign.",
    "Here are five takeaways from the first major primary night of the season.",
    "GOP fissures were apparent in another high-profile race in Ohio, as Gov.",
    "Fudge retired to become Bidens Housing and Urban Development secretary.",
    "Brown also won the endorsement of Biden going into Tuesdays primary.",
    "And Democrats are already taking advantage of those divisions.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Vance, on the other hand, trailed at 25 percent.",
    "and Rep. Joyce Beatty (D-Ohio).",
    "See all Video",
    "Ohio Gov.",
    "Vance."
  ]
}