{
  "id": 5815,
  "mediaId": 65,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Vance calls for GOP unity after major comeback in Ohio Senate primary",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/6514ada2-cc90-49ff-b070-02e64e69bcd3/4c963aeb-d89e-4071-a54c-19c0b62a5ede/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/vance-campaign-speech-republican-party-unity",
  "sentiment": "0.703",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    781,
    946,
    1801,
    2027,
    2466,
    3103,
    380,
    428,
    571,
    2609,
    2845
  ],
  "sentences": [
    "\"We're going to do battle against an establishment left that thinks that people's jobs, that thinks that people's values, that thinks that people's basic livelihoods and sense of dignity in their own country is not something worth protecting,\" Vance told supporters in his victory speech at the Duke Energy Convention Center in downtown Cincinnati.",
    "CLICK HERE FOR THE LATEST PRIMARY ELECTION RESULTS FROM FOX NEWS\n\"I have absolutely got to thank the 45th, the president United States,\" Vance said early in his remarks, referring to Trump, whose endorsement is likely largely responsible for Vance's win.",
    "He praised all four of his major primary opponents, including former Ohio GOP Chair Jane Timken, state Sen. Matt Dolan, investment banker Mike Gibbons and former state Treasurer Josh Mandel.",
    "VANCE PROJECTED WINNER IN TUMULTUOUS SENATE GOP PRIMARY SHOWDOWN IN OHIO\nThe mood at the event was lively, with attendees dancing and chatting while a DJ played primarily 80s hits.",
    "Vance continued to call for party unity after what was an extremely expensive and contentious primary campaign that cost more than $63 million, according to Medium Buying.",
    "Vance asked for Republican unity in a speech to supporters following his comeback primary win Tuesday, as he prepares to take on Democratic nominee.",
    "MAY MADNESS: PRIMARY SEASON IGNITES IN EARNEST\nVance, who would be the second-youngest senator if elected, closed his speech on a lighthearted note.",
    "The Associated Press called the race shortly after 9:30 p.m., with Vance maintaining about a 30% share of votes in the seven-way primary.",
    "When Vance officially won, cheers reverberated through the convention center, well beyond the room Vance's event was staged in.",
    "Vance, who trailed other candidates for much of the campaign, surged late after former President Donald Trump endorsed him.",
    "\"But he refuses to fight his own party when they have flooded the state of Ohio with illegal drugs and sex traffickers.",
    "He praised Mandel as a \"longtime and dedicated public servant from the Marine Corps to the state treasurer's office.\"",
    "Vance's supporters started to boo Mandel when the nominee mentioned him, but Vance told them to settle down.",
    "When Vance eventually took the stage, he did so alongside his wife and shot the crowd a big thumbs up.",
    "Vance then turned to Ryan, D-Ohio, and Democrats, who he said are a threat to Americans' way of life.",
    "\"So tonight we're gonna celebrate, maybe a little too much,\" Vance quipped at the end of his speech.",
    "\"I'm 37-years-old, I've got my celebration packet, a pack of Gatorade, a couple Advil and some Tums.",
    "Ladies and gentlemen, Tim Ryan needs to go down, and we're going to be the party that does that.\"",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "Supporters also chanted \"J.D., J.D.,\" as they waited for him to speak.",
    "\"He says that he cares about us here in Ohio,\" Vance said of Ryan.",
    "Tyler Olson covers politics for Fox News Digital.",
    "I'm not the same man I was 10 years ago.\"",
    "CINCINNATI  Ohio GOP Senate nominee J.D.",
    "There is no runoff.",
    "TRUMP-BACKED J.D."
  ]
}