{
  "id": 5828,
  "mediaId": 195,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Vance wins Ohio Senate primary, handing Trump key victory",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/15fb8ecc25334e21ae8644d17c1375f8.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3473848-vance-wins-ohio-senate-primary-handing-trump-key-victory/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod/",
  "termIds": [
    3103
  ],
  "sentences": [
    "And were going to be the party that does it.?\nVance had cast himself as a stalwart supporter of Trump but struggled for much of the race to break out of the middle of the primary pack, an effort made more difficult by the fact that several of the candidates were running on largely similar platforms.",
    "Vance and his team made full use of the endorsement in their short runway, carpet bombing the airways with news of the imprimatur and having Vance appear at a rally Trump held in Ohio  a joint appearance coveted by almost any Republican running in a competitive statewide primary.",
    "Vance, the author of Hillbilly Elegy,? won over a crowded field packed with Trump allies, including former state Treasurer Josh Mandel, investment banker Mike Gibbons and former Ohio GOP Chairwoman Jane Timken.",
    "However, Vance scored a major coup in mid-April when the former president endorsed him, providing an eleventh-hour jolt on Good Friday and the first night of Passover less than three weeks before election day.",
    "Ohio Republicans have spoken and now its time to look forward, united in our conservative convictions to make our state and nation a better place to live, work, and raise a family,? he said in a statement.",
    "On top of that, Donald Trump Jr., the former presidents eldest son, toured the Buckeye State and held a fundraiser for Vance, whom he had previously pushed his father to endorse.",
    "Vance was projected to win Ohios GOP Senate primary Tuesday, scoring the nomination after a brutal race and handing former President Trump a key victory after a late endorsement.",
    "A public relations blitz by his opponents highlighting his criticism of Trump in 2016 is also believed to have kept Vances numbers stagnant for much of the race.",
    "Mandel, Gibbons and Timken all tried to walk a tightrope by continuing to cast themselves as Trump supporters while claiming his endorsement was misplaced.",
    "At the same time, other heavy hitters were also entering the fray, with Sen. Ted Cruz (R-Texas) and the Club for Growth coming out in support of Mandel.",
    "Kellyanne Conway, Trumps 2016 campaign manager and a former White House adviser, backed Timken, and Sen. Rand Paul (R-Ky.) endorsed Gibbons.",
    "Following Vances victory, state Sen. Matt Dolan (R), another primary rival, congratulated him on the nomination and offered his endorsement.",
    "Besides providing a key lifeline to Vance, the Trump endorsement also put the rest of the top primary candidates in a difficult position.",
    "Just as I will never quit fighting for Ohio, I pledge to unite our party and endorse JD Vance to be our next U.S. Senator,? he added.",
    "In his victory speech, Vance praised each of his main primary rivals by name and looked to pivot toward the general election.",
    "It is the party of working people all across the state of Ohio, and it needs to fight, and it needs to win,? Vance said.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades.",
    "Trump conceded that Vance had said negative things about him but in a statement noted that many others had as well.",
    "I know we share a love for our country because its not just a place, but an idea, and a cause worth fighting for.",
    "That endorsement was seen as a key test of Trumps strength within the GOP and of his ability to play kingmaker.",
    "Now, the party that we need to unify to fight Tim Ryan, its our Republican Party, ladies and gentlemen.",
    "He will go on to face Rep. Tim Ryan (D) in the November general election to replace retiring Sen.",
    "JD Vance and I have debated our differences, and in this hard fought campaign he was successful.",
    "Their efforts to highlight Vances past criticism, however, fell flatter after the endorsement.",
    "He is our best chance for victory in what could be a very tough race,? Trump said on April 15.",
    "The Associated Press called the race at shortly after 9:30 p.m.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Other Trump allies also stumped with Vance across the state.",
    "Ladies and gentlemen, Tim Ryan needs to go down,? he added.",
    "He said he believed that the Ohio author had come around.",
    "Like some others, J.D.",
    "Rob Portman (R).",
    "J.D.",
    "ET."
  ]
}