{
  "id": 5845,
  "mediaId": 2659,
  "date": "2022-04-18",
  "headline": "The Ugliest, Most Toxic Journey: NYT and Joe Scarborough Rip GOP Candidate Trips to Mar-a-Lago",
  "image": "https://www.politicususa.com/wp-content/uploads/2019/12/2019-12-24T190819Z_2140354417_RC2V1E9BWTUZ_RTRMADP_3_USA-TRUMP-scaled.jpg",
  "link": "https://www.politicususa.com/2022/04/18/the-ugliest-most-toxic-journey-nyt-and-joe-scarborough-rip-gop-candidate-trips-to-mar-a-lago.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Miciak",
  "authorUrl": "",
  "termIds": [
    2312,
    4905,
    2765,
    748,
    1126
  ],
  "sentences": [
    "“The reality that still exists is that if Donald Trump can help you win a Republican primary and help you lose a general election, especially in statewide races, his name — and this story talks about it,\n“We have seen after [Glen] Youngkin won, we have even time and time again people that voted for [Joe] Biden and Youngkin all upset with Biden top to bottom, then you ask them, last question, do you regret your vote for Joe Biden over Donald Trump?",
    "Nationally, we’ve seen kingmakers, plural, a group that would decide upon picks for certain positions, the proverbial “smoke-filled room.” The idea that one man controls an entire party at the national level, including who will and will not “win” (yet to be seen) is new, and certainly not healthy.",
    "There was a scene where he flew down all of the Senate candidates in Ohio, put him in a room while he was there and just let them fight and scream, yell at each other so he would give them the endorsement.”\nVideo of Scarborough:\nHow dignified.",
    "From the New York Times:\nFor 15 months, a parade of supplicants — senators, governors, congressional leaders and Republican strivers of all stripes — have made the trek to pledge their loyalty and pitch their candidacies.",
    "It is easy to imagine, as the Joe-crew did, that what takes place behind closed doors is indiscernible from “The Apprentice,” and it doesn’t serve the Republicans well nationally, nor us as a nation.",
    "It is also a theme that has pounded through McConnell’s head for two years, which is ironic, given that McConnell very much has the self-awareness to understand he’s humiliating himself.",
    "But Joe saved his strongest words for what Trump is doing to the party nationally, a topic I continue to cover, whether Trump is burying the party’s chances for a November rout.",
    "Which candidate is most devoted to Donald Trump?”\nIt is certainly toxic to the Republican Party, which has ceded much of its power or even the basis for its existence to Trump.",
    "It is the fact that Trump makes his picks based solely upon one criterion, “Which candidate would do the most for me, personally and politically, whether I run again or not.",
    "The article goes on to say that candidates should bring big poster boards full of pictures, multi-colored graphs, large fonts, and anything but reading material.",
    "This morning, the group on Morning Joe ripped the process and the fact that the process exists as described in the Times Sunday deep dive as is appropriate.",
    "Vance, and others all win their primaries) that he will doom the party on the national level, as Joe described, a theme we’ve pounded for two weeks.",
    "The king sits on his throne while the candidate surely feels like the joker, assuming the candidate has any self-awareness along with self-respect.",
    "As Joe said:\nOne of Trump’s aides says people will go there and just beg, people will go there and try to get his support and his endorsement.",
    "Not since the days of “Kremlinology” has so much attention been paid to who is coming and going where, who appears in what picture.",
    "American history is replete with kingmakers in both parties, but the word and the power were generally limited to a state.",
    "He’s still toxic in north Atlanta, still toxic in the Philly suburbs, he’s still toxic in all of these swing districts.",
    "It’s every bit as pathetic as “The Apprentice,” where people were like crabs in a bucket, wanting him to pick them up.",
    "In other words, McConnell’s very much aware of the dynamic and his lack of power to change it.",
    "It is possible that if Trump is successful in playing kingmaker (If Walker, Dr. Oz, J.D.",
    "Some have hired Mr. Trump’s advisers, hoping to gain an edge in seeking his endorsement.",
    "But McConnell waived off self-respect whenever it got in the way of power long ago.",
    "The process is powerfully toxic and Trump is the real joker, the wild card.",
    "They are there to sell themselves to a man who doesn’t like to read.",
    "Almost everyone parrots his lie that the 2020 election was stolen.",
    "It is perhaps one of the few times McConnell would agree with Joe.",
    "Some have bought ads that ran only on Fox News in South Florida.",
    "Whether it is toxic to the nation remains to be seen.",
    "That’s not changing in the general election.”\nTrue.",
    "These people call themselves conservatives.",
    "But it’s not just Trump’s toxicity.",
    "Some bear gifts; others dish dirt.",
    "Every one of them — no.",
    "He’s still toxic."
  ]
}