{
  "id": 5846,
  "mediaId": 234,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "J.D. Vance Played The Trumpiest Version of Himself He Could and It Totally Worked",
  "image": "https://media.vanityfair.com/photos/6272aaf5a967ced50697031f/master/w_2240,c_limit/1240431840",
  "link": "https://www.vanityfair.com/news/2022/05/jd-vance-wins-ohio-primary-embraces-trump",
  "sentiment": "0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Lutz",
  "authorUrl": "https://www.vanityfair.com/contributor/eric-lutz",
  "termIds": [
    3103
  ],
  "sentences": [
    "He accused Biden of purposely getting conservatives addicted to fentanyl out of a desire to punish people who didnt vote for him.? He shrugged at Russias hostility to Ukraine, telling former Trump strategist Steve Bannon in an interview before the war broke out that he didnt really care what happens to Ukraine one way or another? and suggesting that Biden only cared because Vladimir Putin didnt believe in transgender rights.? And he more or less suggested Trump declare himself dictator if he wins reelection in 2024, saying in an interview on a far-right podcast that he should fire every single mid-level bureaucrat, every civil servant in the administrative state, replace them with our people.",
    "For giving us an example of what could be in this countryand endorsing me.?\n Inside the Virus-Hunting Nonprofit at the Center of the Lab-Leak Controversy\n Jared Kushner and Donald Trump Probably Wont Be Splitting a Milkshake Anytime Soon\n CNN Leaves the Drama Behind With Focus on War in Ukraine\n Trumps Truth Social Is an Even Bigger Humiliation Than Previous Business Failures\n The Clock Is Ticking on the January 6 Investigation\n The Washington Post Checks In, Finds Trump Is Still a Lying Sociopath\n A Ukrainian Woman Explains the War to Europes Skeptics\n From the Archive: How Playboy Imran Khan Became the Prime Minister of Pakistan\n Not a subscriber?",
    "Vance has not only fully embraced Trump in the intervening years  he has banked his own political ambitions on the precise kind of Trumpian demagoguery he once suggested to a friend was an indictment of the GOPs collective neglect.? It paid off: In April, he won Trumps coveted endorsement  thanks to powerful right-wing allies like tech billionaire Peter Thiel and TV pundit Tucker Carlson  and on Tuesday, he won the GOP primary to face off against Democrat Tim Ryan for the seat Republican Rob Portman is vacating.",
    "Vance won the Republican primary in Ohios Senate race Tuesday  and all it took was sacrificing whatever integrity he had at the altar of a man he once suggested was Americas Hitler.? During the onset of Donald Trumps political ascendence, Vance presented himself as a kind of conduit between two Americas  Trump country and those horrified by Trump country.",
    "His chief rival, Josh Mandel, was fully committed to the Trump act  staking out the most extreme positions possible, parroting Trumps stolen election? conspiracy theories, and cutting surreal videos of himself, in a dark field of corn, likening Joe Bidens campaign to vaccine Americans against COVID-19 to the Holocaust.",
    "There is, of course, no such thing, and what Trump was selling wasnt a real plan to rescue the forgotten men and women? Vance wrote about in his memoir; it was an addiction to what Vance described in the Atlantic back in 2016 as cultural heroin.? Vance disapproved of it then.",
    "The people who are caught between the corrupt political class of the left and the right, they need a voice,? Vance said in a victory speech Tuesday, thanking Trump and acolytes like Marjorie Taylor Greene and Matt Gaetz for their support.",
    "Then again, so is Trump, a wealthy television star who somehow managed to convince a sizable chunk of America that he was just like them  a blue collar billionaire,? as his son, Donald Trump Jr., once dubbed him.",
    "The Hillbilly Elegy author was horrified, too, back then  or at least he said as much, even as he called on liberals to show compassion and understanding for the put-upon, middle American Trump voter.",
    "Carlson, the face of Fox News, also made Vances case to Trump  possibly by spreading lurid rumors about Mandels top backer, David McIntosh, the president of the conservative Club for Growth.",
    "But for now, hes sitting at the top of the MAGA heap, having traded on the very empty outrage he used to say was a blight on the Republican party and a danger to the nation.",
    "And thats going to be me.?\nIn many respects, Vance  a Yale-educated venture capitalist  is an unlikely torch-bearer for Trumps populist war against so-called elites.",
    "But Vance was also more successful at cozying up to MAGA figures, including the former presidents eldest son, who helped him land his old mans endorsement.",
    "But he gets it now, and I have seen that in spades.?\nHow far will all this get Vance in November, in a general election against moderate Democrat Tim Ryan?",
    "With the assistance of Thiel, who helped bankroll his campaign with a Super PAC, Vance took some headline grabbing swings.",
    "Vance may have said some not so great things about me in the past,? Trump said in his endorsement in April.",
    "And when the courts stop you, stand before the country, and saythe chief justice has made his ruling.",
    "I have got to absolutely thank the 45th president, Donald Trump,? Vance told supporters Tuesday.",
    "Im a Never Trump guy,? Vance told Charlie Rose in 2016. I never liked him.?\nBut that was then.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "Now let him enforce it.?\nStanding out as the Trumpiest candidate was no easy task.",
    "But in his campaign for Portmans seat, he began pushing the same product.",
    "It looks like we're experiencing playback issues.",
    "Trump was ultimately convinced.",
    "They need a representative.",
    "That remains to be seen.",
    "Our bad!",
    "J.D.",
    "J.D."
  ]
}