{
  "id": 5847,
  "mediaId": 157,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Morning Joe keeps focus on insurrection-backing Ginni Thomas as GOP obsesses about Supreme Court Roe leak",
  "image": "https://www.rawstory.com/media-library/clarence-thomas-wife-is-helping-trump-purge-snakes-from-the-white-house-and-replace-them-with-fox-news-regulars.jpg?id=24724874&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/supreme-court-corruption-conservative-leak/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    812,
    827,
    967,
    1300,
    2406,
    3103,
    428,
    482
  ],
  "sentences": [
    "Addressing the leak, Scarborough said that whoever gave the draft to reporters should be disbarred and prosecuted, though he also dismissed the absurdity of some of the conservative comments blaming liberals on the court for the leak.",
    "It would be so much better, instead of making this story about the leak, making the story actually about a 50-year precedent, a 50-year Constitutional right being overturned in the most radical of ways in the harshest of language.",
    "Joe Scarborough Wednesday morning called out conservatives for obsessing over the leak of a draft Supreme Court ruling, when the real story is that the ruling itself would take away rights from tens of millions of American women.",
    "\"This may be why Chief Justice Roberts' statements started with a declaration that the leaked document 'does not represent a decision by the court or the final position of any member on the issues in the case.'\"",
    "\"Isn't it quaint that Ginni Thomas' ideological brothers and sisters are questioning you on how the left-wing has radicalized the court, suggesting they would be far more likely to leak the draft opinion?\"",
    "The MSNBC host closed by explaining that it's more likely that a far-right clerk wanted to publish Justice Samuel Alito's decision because it was about to be watered-down by Chief Justice John Roberts.",
    "Ginni Thomas, who would write the president's chief of staff, and they would both talk about how Jesus wanted an insurrection against the United States, wanted to undermine Madisonian democracy.",
    "The conservative Wall Street Journal editorial page, for instance, suggested that it was a liberal who leaked the document in an effort to influence November's congressional elections.",
    "He mockingly wished that if only liberal law schools could produce graduates with \"the restraint of Ginni and Clarence Thomas or Lindsey Graham or the rest of the Senate GOP.\"",
    "Who are glib, at best, about Ukraine, and again, who want us all to forget that they took part in an attempt to overthrow a peaceful election and presidential campaign.\"",
    "Vance, like the guy who said that the Ford Foundation's assets should be seized, and they should be seized because they're not sufficiently pro-Trump.",
    "\"You know, other right-wing law professors bemoaned the crazy radicals that are being produced from elite, ivy league schools,\" Scarborough continued.",
    "He went on to call the argument against liberal clerks \"weak\" for trying to paint Democrats as the ones who have become radical.",
    "See the full commentary below:\nKeeping the focus on insurrection-backing Ginni Thomas as right-wing obsesses over Court Roe leak",
    "Or maybe Clarence Thomas, a guy who didn't recuse himself from case after case that had to deal with his wife's involvement.\"",
    "Meanwhile, the wife of a Supreme Court justice is participating in the attempted overthrow of the United States government.",
    "Or maybe the insurrectionists who actually led an insurrection against the United States government on Jan. 6.",
    "It would be much better if you just let that happen in July because that's closer to the election.",
    "Following the conservative framing, it would mean a liberal sat on the news for two months.",
    "It will cause far more outrage, and it's a much cleaner argument.\"",
    "Or maybe all of those ivy leaguers who spew conspiracy theories.",
    "That is such a plodding, nonsensical argument on so many levels.",
    "\"Yeah, yeah, Ginni Thomas, who supported the insurrection.",
    "The document is also dated February 2022.",
    "\"You've got to do better than that.",
    "\"Come on,\" said Scarborough.",
    "asked Scarborough.",
    "\"Oh, really?",
    "Like J.D."
  ]
}