{
  "id": 5851,
  "mediaId": 157,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Far-right takes a victory lap as JD Vance begins grueling general election battle against Tim Ryan",
  "image": "https://www.rawstory.com/media-library/one-time-never-trumper-jd-vance-now-gladly-accepts-former-president-s-endorsement.jpg?id=29720595&width=1200&coordinates=0%2C66%2C0%2C67&height=600",
  "link": "https://www.rawstory.com/ohio-jd-vance-tim-ryan/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    3103
  ],
  "sentences": [
    "Vance, who was endorsed by Donald Trump, beat out state Sen. Matt Dolan, former Treasurer Josh Mandal, businessman Mike Gibbons, former GOP chairwoman Jane Timken, Mike Pukita, and Neil Patel.",
    "He did not mention Rep. Matt Gaetz (R-FL), who teamed up with Vance and Greene at recent rallies and who is under federal investigation for sex crimes,\" The Beast reported.",
    "\"RINOs are now on the endangered species list,\" said the former president's eldest son, who admitted to literally killing an elephant while on safari.",
    "\"Vance, who doubtlessly owes his victory to Trump, also extended his graces to several MAGA allies who came to his side in the campaigns final weeks.",
    "They included Rep. Marjorie Taylor Greene (R-GA), Fox News talk show host Tucker Carlson, conspiracy theorist Charlie Kirk, and Donald Trump Jr.",
    "But Vance's victory could allow an opening for Rep. Tim Ryan, who secured the Democratic Party nomination on Tuesday.",
    "So any Ohio voter who supports democracy has an easy vote in Nov: Tim Ryan,\" Walsh tweeted, tagging both candidates.",
    "He also posted of photo of him talking to Fox News with Green and Vance, writing, \"not tired of winning.\"",
    "\"Tens of millions of RINO dollars spent to stop my man [Vance] in Ohio and they call it before 9 oclock.",
    "But Gaetz addressed the election on Twitter, calling it a \"big win\" for Greene's campaign team.",
    "Vance's victory in the Ohio Senate primary resulted in celebrations by many on the far-right.",
    "Bestselling author Don Winslow urged his followers to donate to Ryan, \"because if J.D.",
    "Trump, Jr. signaled the GOP civil war will continue.",
    "The America First movement is alive and well people.",
    "The Daily Beast reported on Vance's victory party.",
    "Vance gets elected it's going to be terrible.\"",
    "\"Im not a Democrat, but I support democracy.",
    "Congrats JD, well done,\" Trump, Jr. said.",
    "He described Vance as \"worse\" than Sens.",
    "Ted Cruz (R-TX) and Josh Hawley (R-MO).",
    "Trump Jr. also celebrated.",
    "Venture capitalist J.D.",
    "JD Vance doesnt."
  ]
}