{
  "id": 5852,
  "mediaId": 157,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Trump thought GOP candidate Josh Mandel was 'weird' -- and 'no amount of sucking up' would win his endorsement: report",
  "image": "https://www.rawstory.com/media-library/donald-trump-josh-mandel.jpg?id=29272273&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/jd-vance-trump-2657261510/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    3103
  ],
  "sentences": [
    "Vance fell to single digits in the polls, but he slowly recovered and Trump noticed -- and appreciated that comeback -- and then he picked up key support from Donald Trump Jr., GOP megadonor Peter Thiel, and Fox News host Tucker Carlson, who trumpeted Vance's public indifference to the situation in Ukraine.",
    "\"The power of President Trump's endorsement is undeniable, his dominance over the Republican powerbrokers in D.C. cannot be overstated and the promise of this MAGA movement will not just define the midterms, but it will win for years to come,\" Trump spokesman Taylor Budowich told the website.",
    "The venture capitalist and \"Hillbilly Elegy\" author picked up the former president's endorsement despite criticizing him in 2016, and that backing is seen as crucial in pulling Vance out of a tightly contested pack of Trump-loving conservatives vying for the GOP nomination, reported Axios.",
    "GOP Senate leadership hoped Vance would lose and believed he would, and the establishment Club for Growth spent millions on TV ads pointing out his past criticism of Trump, who also saw him as a long shot to win the Republican primary.",
    "Reps. Marjorie Taylor Greene (R-GA) and Matt Gaetz (R-FL) shared Trump's disdain for Mandel, and they went all in for Vance, who got more effort out Trump than most of the other candidates he endorsed in the primaries.",
    "But ultimately the former president's support came down to aesthetics, and he decided that Vance seemed tough and smart while his leading opponent, former state treasurer Josh Mandel, struck Trump as weird.",
    "Vance would become one of the strongest Donald Trump allies in the U.S. Senate if he wins in November, after picking up a win in the Ohio Republican primary.",
    "\"I really like J.D., but I just hear he's totally dead,\" Trump told associates last fall at Mar-A-Lago, according to a source who was there.",
    "\"He privately mocked Mandel for verging on picking a physical fight with an elderly man  Mike Gibbons  on stage in the Ohio primary debate.\"",
    "as a fighter by the base and some of the most important media voices on the right,\" a source said about Vance's foreign policy views.",
    "\"I hear those Club [for Growth] ads are killing him, totally killing him.",
    "\"No amount of sucking up from Mandel worked on Trump,\" Axios reported.",
    "\"It was a pivotal moment in solidifying the view of J.D.",
    "They did a number on him.\"",
    "Stories Chosen For You",
    "J.D."
  ]
}