{
  "id": 5856,
  "mediaId": 395,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "J.D. Vance Wins GOP Senate Primary in Ohio with Help from Trump & Peter Thiel",
  "image": "https://www.democracynow.org/images/headlines/29/62629/quarter_hd/HL14-VanceWins.jpg",
  "link": "https://www.democracynow.org/2022/5/4/headlines/jd_vance_wins_gop_senate_primary_in_ohio_with_help_from_trump_peter_thiel",
  "sentiment": "0.821",
  "mediaOutlet": "Democracy Now!",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1801,
    2524,
    3103,
    146,
    428,
    571,
    2710,
    2845
  ],
  "sentences": [
    "And Ive got to say, a lot of the fake news media out there  and there are some good ones in the back there; there are some bad ones, too, lets be honest  but they wanted to write a story that this campaign would be the death of Donald Trumps 'America First' agenda.",
    "Politico reports Thiel spent more than $15 million to back Vance, who will face Democratic Congressmember Tim Ryan in Novembers election to fill the seat currently held by Republican Senator Rob Portman.",
    "In another closely watched race, Democratic Congressmember Shontel Brown has defeated challenger Nina Turner, the former co-chair of Bernie Sanderss 2020 presidential campaign.",
    "Vance is a venture capitalist and author of the best-selling book Hillbilly Elegy.? He was heavily backed by the right-wing tech billionaire Peter Thiel.",
    "Voters in Ohio and Indiana went to the polls Tuesday for two of the first primaries of this midterm election cycle.",
    "Vance won the Republican Senate primary after securing the backing of Donald Trump.",
    "It was a rematch of last years special election that brought Brown to Congress.",
    "Ladies and gentlemen, it aint the death of the 'America First' agenda.?\nJ.D.",
    "Vance praised the former president during his victory rally Tuesday night.",
    "Vance: Thanks to the president for everything, for endorsing me.",
    "We will have more on the Ohio election later in the program.",
    "In Ohio, J.D.",
    "J.D."
  ]
}