{
  "id": 5861,
  "mediaId": 209,
  "date": "d2022-05-04T00:00",
  "headline": "10 things you need to know today: May 4, 2022",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-desktop@1/v1651659810/GettyImages-1395260141.jpg",
  "link": "https://theweek.com/briefing/daily-briefing/1013227/10-things-you-need-to-know-today-may-4-2022",
  "sentiment": "0",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Harold Maass",
  "authorUrl": "https://theweek.com/authors/harold-maass",
  "termIds": [
    827,
    1341,
    1801,
    2034,
    2058,
    2087,
    2195,
    3103,
    3726,
    482,
    2888
  ],
  "sentences": [
    "Chief justice says leaked abortion opinion authentic but not final, Biden says overturning Roe v. Wade would be \"radical,\" and more\nChief justice confirms leaked draft opinion is authentic\nSupreme Court Chief Justice John Roberts on Tuesday confirmed that a leaked draft opinion indicating the court was poised to overturn the landmark 1973 Roe v. Wade decision is authentic, but he said it doesn't necessarily represent the case's resolution.",
    "\"You can't imagine how scary it is when you sit in the shelter, in a wet and damp basement which is bouncing, shaking,\" 54-year-old Elina Tsybulchenko said after the convoy of buses and ambulances carrying her and other evacuated civilians arrived in the Ukrainian-controlled city of Zaporizhzhia, 140 miles northwest of Mariupol.",
    "The Wall Street JournalCNBC\nFormer President Donald Trump's company and his 2017 inaugural committee will pay the District of Columbia $750,000 to settle allegations they misspent money raised by the nonprofit inaugural committee, and used it to enrich Trump's family, D.C. Attorney General Karl Racine said Tuesday.",
    "Fifty-four percent of the survey's participants said the Supreme Court, which a leaked opinion suggests is poised to overturn Roe, should uphold the landmark ruling, compared to 28 percent who said it should be struck down  roughly a 2-to-1 margin.",
    "The designation signals a likely intensification of efforts by the Biden administration to bring Griner home, as it opens the door for the government to actively negotiate her return instead of waiting for her case to be decided in court.",
    "CNBC\nEuropean Commission President Ursula von der Leyen on Wednesday proposed banning imports of Russian crude oil over six months in what could be the European Union's costliest measure yet to punish Russia for invading Ukraine.",
    "Former President Barack Obama and former first lady Michelle Obama said the conservative majority's draft decision would \"relegate the most intensely personal decision someone can make to the whims of politicians and ideologues.\"",
    "ReutersThe Hill\nA majority of Americans said in a Washington Post-ABC News poll conducted last week that the Supreme Court should uphold Roe v. Wade, the 1973 decision that established a constitutional right to abortion.",
    "The announcement came hours after Politico published a leaked draft opinion suggesting the Supreme Court could soon overturn the landmark 1973 Roe v. Wade decision that established the constitutional right to abortion.",
    "Alito's opinion, marked as a first draft, said the court's conservative majority had determined that Roe, which established the constitutional right to abortion nationwide, was \"egregiously wrong and deeply damaging.\"",
    "The Associated PressThe New York Times\nSenate Democrats soon will hold a vote on legislation seeking to codify abortion rights into federal law, Senate Majority Leader Chuck Schumer (D-N.Y.) said Tuesday.",
    "A vote would likely be symbolic, as Democrats lack the 60 votes they would need to get the proposal past a Republican filibuster, and they don't have enough support to weaken the filibuster, either.",
    "The New York TimesThe Associated Press\nThe U.S. has classified WNBA star Brittney Griner as \"wrongfully detained\" in Russia, State Department officials confirmed to ESPN and Yahoo Sports on Tuesday.",
    "The Supreme Court's leaked decision, if it becomes official, would uphold a Mississippi law banning abortion after 15 weeks of pregnancy and trigger automatic bans in a dozen other red states.",
    "Trump said in a statement that the case was \"yet another example of weaponizing Law Enforcement against the Republican Party and, in particular, the former President of the United States.",
    "Roberts vowed to investigate the leak of the draft, written by Justice Samuel Alito and published by Politico, and condemned it as a \"singular and egregious breach\" of trust.",
    "The Wall Street Journal\nThe leaked draft of a Supreme Court ruling suggesting the conservative majority had voted to overturn Roe v. Wade touched off a political firestorm.",
    "Ryan, whose campaign calls Vance a \"phony\" and an \"elitist,\" easily won his primary against Morgan Harper, a former attorney at the Consumer Financial Protection Bureau.",
    "The Washington Post\nRussian forces started storming a Mariupol steel plant complex where the last Ukrainian defenders of the port city have been holding out for weeks.",
    "Food services, arts and entertainment, and other consumer-facing industries had the highest rate of openings, with health-care openings also near record levels.",
    "Vance, a Never Trumper turned Trump loyalist, tried to unify the party after a tough primary, saying the GOP stood for \"working people all across the state.\"",
    "The assault came as more than 150 civilians who had been trapped in bunkers under the heavily bombed plant reached safety after a weekend evacuation effort.",
    "President Biden said it would be a \"radical decision\" for the court strike down Roe, the case that legalized abortion and has stood for nearly 50 years.",
    "Cleveland.comThe Washington Post\nJob openings and the number of people quitting jobs hit record highs in March, the Labor Department reported Tuesday.",
    "Alito wrote that the 1992 Planned Parenthood v. Casey decision, which limited abortion rights without eliminating them, prolonged the court's error.",
    "Kyrsten Sinema (D-Ariz.), Susan Collins (R-Maine), and Lisa Murkowski (R-Alaska), expressed disappointment with the draft Supreme Court opinion.",
    "\"Our expectation is that the White House do whatever is necessary to bring her home,\" Griner's agent, Lindsay Kagawa Colas, said in a statement.",
    "The high court's precedents currently guarantee abortion rights up to the point of fetal viability, roughly 24 weeks into a pregnancy.",
    "The contest was widely seen as a test of the influence of former President Donald Trump, who boosted Vance with a late endorsement.",
    "The two countries said they were too dependent on Russian oil and natural gas, and would not be able to replace the lost supply.",
    "\"It's a victory for the most basic right there is  the right to life,\" tweeted former United Nations ambassador Nikki Haley.",
    "Antiabortion activists and Republican politicians celebrated the opinion, written by conservative Justice Samuel Alito.",
    "The new data showed that the hiring market remains tight as employers continue to face a shortage of available workers.",
    "The case involved more than $1 million in alleged improper payments to the Trump International Hotel in Washington.",
    "ZipRecruiter said openings at businesses with more than 5,000 workers had more than doubled since February 2020.",
    "The civilians, including elderly people and at least 17 children, reached territory controlled by Ukraine.",
    "There were a seasonally adjusted 11.5 million job openings, up from 11.3 million the previous month.",
    "Griner was arrested at a Moscow area airport, and accused of carrying hashish oil in her luggage.",
    "The trading bloc's 27 members are expected to start discussing the embargo, part of a sixth E.U.",
    "The plan also calls for halting purchases of refined oil products by the end of the year.",
    "Neither the Trump Organization nor the committee admitted any wrongdoing.",
    "Vance will face Democratic nominee Rep. Tim Ryan in the general election.",
    "Vance won Ohio's Republican primary in the race to fill retiring GOP Sen.",
    "Rob Portman's seat, beating several other candidates with similar views.",
    "Job openings exceeded the number of available workers by 5.6 million.",
    "Biden called for Congress to cement abortion protections in law.",
    "\"No one is above the law  not even a president,\" Racine said.",
    "Slovakia and Hungary said Tuesday they would not back an E.U.",
    "Quits hit 4.5 million, an increase of 152,000 from February.",
    "The Washington Post\nAuthor and venture capitalist J.D.",
    "Several Senate swing votes, including Sens.",
    "sanctions package, on Wednesday.",
    "So bad for our Country!\"",
    "ESPNYahoo Sports",
    "embargo."
  ]
}