{
  "id": 5869,
  "mediaId": 34,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "JD Vance, Backed by Trump and Billionaire Cash, Wins GOP Senate Primary in Ohio",
  "image": "https://www.commondreams.org/sites/default/files/styles/social_share_image/public/2022-05/GettyImages-1240190803-vance_0.jpg?h=5c543fc3&itok=JVJeUz-f",
  "link": "https://www.commondreams.org/news/2022/05/04/jd-vance-backed-trump-and-billionaire-cash-wins-gop-senate-primary-ohio",
  "mediaOutlet": "Common Dreams",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Johnson",
  "authorUrl": "https://www.commondreams.org/author/jake-johnson",
  "termIds": [
    781,
    946,
    1147,
    1801,
    3103,
    4030,
    4321,
    428,
    571,
    2845
  ],
  "sentences": [
    "Days ahead of the Ohio primary contests, The American Prospect's Robert Kuttner slammed Vance as a \"fake populist\" and wrote that \"Democrats nationally have a shot at defeating Trumpism and incipient fascism only if they succeed in refocusing debate on the downward slide that is behind so much of the voter anger, and demanding bold measures to reverse it.\"",
    "Before launching his political career, Vancewho was often portrayed by corporate media outlets as an authority on Appalachian life and the white working class more broadlypilloried Trump as \"cultural heroin\" and warned that he was \"leading the white working class to a very dark place.\"",
    "Vance, a venture capitalist who garnered national acclaim with his book Hillbilly Elegy, won the Republican U.S. Senate primary in Ohio on Tuesday, riding an endorsement from former President Donald Trump and a large infusion of campaign cash from billionaire Peter Thiel.",
    "Having decisively beaten Republican rival Josh Mandel, a fervent Trump loyalist who vied unsuccessfully for the former president's backing, Vance will face off against Rep. Tim Ryan (D-Ohio) in November, a key race in the fight for control of the closely divided Senate.",
    "\"Vance is an out-of-touch millionaire who's made a career of bashing the working class and is the worst possible choice to represent Ohio,\" Ryan tweeted late Tuesday after handily winning the Democratic Senate primary over progressive candidate Morgan Harper.",
    "In his victory speech late Tuesday, Vance painted himself as the \"voice\" of \"people who are caught between the corrupt political class of the left and the right,\" comments reminiscent of Trump's acceptance speech at the 2016 Republican National Convention.",
    "But Vance has since changed his tune, hailing Trump as \"the best president of my lifetime\" and putting to work what critics have denounced as overtly \"fascist rhetoric\" to advance his political career in an increasingly authoritarian GOP.",
    "New York magazine's Sarah Jones, who has tracked Vance's rise since the publication of Hillbilly Elegy, argued in a recent column that \"Vance and Trump always had more in common than the author's long-ago public statements implied.\"",
    "\"Vance is an out-of-touch millionaire who's made a career of bashing the working class and is the worst possible choice to represent Ohio,\" said Rep. Tim Ryan, who will face off against Vance in November.",
    "\"If we're going to push back against it, we're going to have to get pretty wild, and pretty far out there, and go in directions that a lot of conservatives right now are uncomfortable with.\"",
    "\"They need a representative,\" Vance continued, neglectingfor obvious reasonsto mention that his campaign was bolstered by $15 million in donations from Thiel, a co-founder of PayPal.",
    "\"He rose to fame on a tale of white culture in crisis and moved further rightward along with the rest of the GOP after Trump gave them permission to do so,\" Jones added.",
    "\"He rose to fame on a tale of white culture in crisis and moved further rightward along with the rest of the GOP after Trump gave them permission.\"",
    "\"We are in a late republican period,\" Vance told Vanity Fair, remarks that went to press days after Trump endorsed his Senate campaign last month.",
    "But since Vance branded himself as a graduate of the working-class Appalachian experience, liberals graded his commentary on a sliding scale.\"",
    "Speaking at a rally in Nebraska over the weekend, Trump confused Vance with his rival Mandel, declaring: \"We've endorsedJ.P., right?",
    "\"Vance's characterizations of the poor only repackaged myths about welfare queens and the terminal laziness of the disadvantaged.",
    "Such passages, wrote Jones, \"should have raised the alarm for any reader who is interested in lifting Americans out of poverty.\"",
    "\"Customers would 'buy two-dozen packs of soda with food stamps and then sell them at a discount for cash,' he asserts.\"",
    "They are doing everything they can to defend the status quo, squash dissent and protect the wealthy and the powerful.",
    "If that shocks liberals, they can ask themselves what they once found so compelling about Vance and Hillbilly Elegy.",
    "\"Scratch lightly at the surface of Hillbilly Elegy and right-wing themes become apparent,\" Jones continued.",
    "At a high-school job, Vance writes, he learned 'how people game the welfare system,'\" Jones noted.",
    "\"That will not be accomplished by private equity guys wielding cultural hates,\" Kuttner wrote.",
    "\"The proof is in Hillbilly Elegy, a fundamentally conservative, even reactionary work.",
    "Thousands of small donations fund our newsroom and allow us to continue publishing.",
    "\"We're currently beating him in the polls and need your help to widen the gap.\"",
    "Our work is licensed under Creative Commons (CC BY-NC-ND 3.0).",
    "\"Trump has now rewarded him for his dedication.",
    "The Common Dreams media model is different.",
    "The 1% own and operate the corporate media.",
    "We cover the news that matters to the 99%.",
    "Feel free to republish and share widely.",
    "The signs were present from the start.\"",
    "To ignite change for the common good.",
    "Vance is who he's always been.",
    "Mandel, and he's doing great.",
    "And let's see what happens.\"",
    "We can't do it without you.",
    "No selling of your data.",
    "They're all doing good.",
    "They're all doing good.",
    "With no advertising.",
    "Free to republish.",
    "Reader-supported.",
    "We've had enough.",
    "Can you chip in?",
    "Free to share.",
    "Free to read.",
    "No paywalls.",
    "Independent.",
    "Our mission?",
    "To inspire.",
    "Nonprofit.",
    "Thank you.",
    "To inform.",
    "J.D.",
    "How?",
    "J.D.",
    "J.D."
  ]
}