{
  "id": 5870,
  "mediaId": 19,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Breitbart News Daily Podcast Ep. 128: Vance Wins in OH, Biden Gets Ghoulish on Abortion, Guest: Sen. Tom Cotton on SCOTUS, Ministry of Truth, Our Open Border",
  "image": "https://www.breitbart.com/t/assets/i/podcast/google_podcasts.png",
  "link": "https://www.breitbart.com/podcast/2022/05/04/breitbart-news-daily-podcast-ep-128-vance-wins-in-oh-biden-gets-ghoulish-on-abortion-guest-sen-tom-cotton-on-scotus-ministry-of-truth-our-open-border/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Breitbart News",
  "authorUrl": "https://www.breitbart.com/author/breitbart-news/",
  "termIds": [
    3103
  ],
  "sentences": [
    "Sen. Dianne Feinstein (D-CA) appears to have lost her marbles (at least according to the New York Times), Columbia Medical Center is canceling Dr. Oz, Dave Chappelle was apparently attacked on stage during a Netflix event (no, it wasnt Will Smith, at least, we think it wasnt), and much more in the opening.",
    "Hosted by Breitbart Editor-in-Chief Alex Marlow, youll hear Alexs take on the big political stories, interviews with various newsmakers, and the Patriot Caller of the Day.?\nSUBSCRIBE for free by clicking your preferred podcast platform below.",
    "Then, Alex gets his take on the whacky Nina Jankowicz and the Department of Homeland Securitys Ministry of Truth, the chaos at our open southern border, and the increasing likelihood of a global food shortage crisis.",
    "Our guest today is Sen. Tom Cotton (R-AR) who gives some recommendations to the Supreme Court on how to deal with the leak of Justice Sam Alitos draft majority opinion overturning Roe v. Wade.",
    "Host Alex Marlow reports all that we know about the shocking Supreme Court leak and the state of abortion rights in America.",
    "Vance won the Republican Senate primary in Ohio; Alex breaks that down and gives more details on yesterdays primary races.",
    "The Breitbart News Daily Podcast runs Monday through Friday as a Directors Cut? of the SXM Patriot radio show.",
    "President Joe Biden gave a disturbing statement on the matter, which Alex plays and analyzes.",
    "And then finally, of course, we have our caller of the day.",
    "J.D."
  ]
}