{
  "id": 5871,
  "mediaId": 157,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Biden signals campaign strategy against 'extreme' Republicans",
  "image": "https://www.rawstory.com/media-library/landslide-biden-wins-white-house-with-306-electoral-votes-trump-at-232.jpg?id=24497769&width=1200&coordinates=0%2C301%2C0%2C301&height=600",
  "link": "https://www.rawstory.com/biden-signals-campaign-strategy-against-extreme-republicans-2657265521/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Agence France-Presse",
  "authorUrl": "https://www.rawstory.com/u/agence_france-presse",
  "termIds": [
    1147,
    1158,
    1801,
    2087,
    3103,
    428,
    562,
    2945
  ],
  "sentences": [
    "Because however much he may have disappointed some Americans -- on the chaotic withdrawal from Afghanistan, for example, or the highest inflation in four decades, or anything else -- he wants them to remember that Trump is in the wings.",
    "Biden's moderate brand prevailed in the Democrat's primary win, with Tim Ryan, a politician who like Biden stresses his working class background and middle-of-the-road ideology, getting the nod to run against Vance in November.",
    "And if Republicans win the House or Senate, or both, as polls show is entirely possible, he'll face two years of grinding obstruction and made-for-TV investigations by a Republican party still largely loyal to Trump.",
    "US President Joe Biden has found his message for the midterm congressional elections: you're either with him, or you're with predecessor Donald Trump's \"MAGA crowd\" -- the \"most extreme\" group in American history.",
    "The right-wing publication The Federalist compared Biden's \"extreme\" remarks to Hillary Clinton's ill-fated statement during her campaign against Trump that his supporters were \"deplorables.\"",
    "Not only are Democrats expected to get fired up in defense of abortion rights, but Biden hopes he can tie the coming restrictions into a broader picture of an extreme right running wild.",
    "In Ohio's closely watched primary contests to see who will represent the Democrats and Republicans in November, both leaders found signs that their brands are in good health.",
    "So the bombshell leak this week of a Supreme Court ruling on the apparently imminent end to national abortion rights may ironically have done Biden a political favor.",
    "For many Americans, what he calls \"extreme\" -- including the looming rollback of abortion rights -- is exactly what they elected Trump to bring about back in 2016.",
    "But heading into the November midterms, where Democrats face losing control of Congress and even his own reelection in 2024, Biden has changed his tune.",
    "- Phony war -\nBiden presides over a strong economy and has restored Washington's global leadership in responding to the Russian invasion of Ukraine.",
    "\"This MAGA crowd is really the most extreme political organization that's existed in American history, in recent American history,\" Biden said.",
    "Even as Trump kept fuming and lying about his election loss, Biden and his aides ignored him, long refusing so much as to mention his name.",
    "An author and venture capitalist, Vance once called Trump \"America's Hitler,\" but turned to embrace the former president and was rewarded.",
    "However, sky-high inflation hits every voter, while issues such as illegal immigration and Covid vaccines are inflaming the right.",
    "The 79-year-old president won the White House in 2020 promising to turn a page on the breathless, for many terrifying, Trump era.",
    "At the White House on Wednesday, Biden doubled down, lashing out at Trump's Make America Great Again, or MAGA, movement.",
    "Another relative moderate, Shontel Brown, won in a tough primary for a House seat race, after she was endorsed by Biden.",
    "\"Don't compare me to the Almighty, compare me to the alternative,\" Biden said last month on a trip to Washington state.",
    "For now, there is a phony war ahead of the midterms and even what could end up as a 2024 Biden-Trump rematch.",
    "Trump flexed his muscles by endorsing the ultimate winner of the Republican primary for the US Senate, J.D.",
    "Whether Biden's attempt to define the election on such stark terms will work is open to question.",
    "\"A desperate Joe Biden is following her failed playbook,\" The Federalist said.",
    "\"What are the next things that are going to be attacked?\"",
    "\"The former guy,\" they called him.",
    "Stories Chosen For You",
    "he asked Wednesday.",
    "Vance.",
    "Why?"
  ]
}