{
  "id": 5872,
  "mediaId": 157,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Matt Gaetz lashes out at the media after JD Vance leaves him out of victory speech",
  "image": "https://www.rawstory.com/media-library/matt-gaetz.jpg?id=29759852&width=1200&coordinates=0%2C20%2C0%2C30&height=600",
  "link": "https://www.rawstory.com/matt-gaetz-2657263490/",
  "sentiment": "-0.634",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sky Palma",
  "authorUrl": "https://www.rawstory.com/u/sky_palma",
  "termIds": [
    883,
    1380,
    1577,
    1801,
    3103,
    4192,
    428,
    2661,
    2845
  ],
  "sentences": [
    "Matt Gaetz, who is under federal investigation for sex trafficking a teenager he appears to have paid through his former best friend when she was literally half his age, owes me and my publication a correction\\n\\nhttps://m.youtube.com/watch?v=UET6MsTkZXg\\u00a0\\u2026https://twitter.com/mattgaetz/status/1521789474782552067\\u00a0\\u2026\n Roger Sollenberger found true love, suckers (@Roger Sollenberger found true love, suckers) 1651672245\nWATCH | J.D.",
    "\"Matt Gaetz, who is under federal investigation for sex trafficking a teenager he appears to have paid through his former best friend when she was literally half his age, owes me and my publication a correction,\" Solleberger wrote.",
    "In a tweet posted on Tuesday evening, The Daily Beast's Roger Sollenberger pointed out that, during a speech celebrating his win to garner the Republican nomination for the U.S. Senate in Ohio, candidate J.D.",
    "But Sollenberger fired back with a video of Vance's speech, which he says proves that the Florida lawmaker was indeed left out.",
    "Vance wins Republican nomination for US Senate in Ohio\nMarjorie Taylor Greene gets confronted by a veteran for her 'craziness'",
    "Tonight, Vance thanked a slew of public figures who backed him, including MTG, but he didnt thank Gaetz,\" Sollenberger wrote.",
    "Citing a tweet from NBC News' Vaughn Hillyard, Gaetz accused Sollenberger and The Daily Beast of lying.",
    "\"Gaetz did events with JD Vance and Marjorie Taylor Greene this weekend.",
    "Vance failed to thank Florida GOP Rep. Matt Gaetz."
  ]
}