{
  "id": 5875,
  "mediaId": 43,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Morning Digest: Trump's guy won the Ohio Senate",
  "image": "https://images.dailykos.com/images/1065555/story_image/GettyImages-1239921867.jpeg?1651604693",
  "link": "https://www.dailykos.com/story/2022/5/4/2095597/-Morning-Digest-Trump-s-guy-won-the-Ohio-Senate-primary-and-no-it-wasn-t-J-P-Mandel",
  "sentiment": "-0.246",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    837,
    946,
    1147,
    1299,
    1801,
    2524,
    3103,
    380,
    571,
    2845
  ],
  "sentences": [
    "Hinchey is the daughter of the late Rep. Maurice Hinchey, who represented a sizable portion of this district from 1993 to 2013.\n? OR-05: Journalists at Sludge report that Mainstream Democrats PAC, a new group with the stated purpose of thwarting \"far-left organizations\" that want to take over the Democratic Party, will spend $800,000 in ads to help moderate Rep. Kurt Schrader fend off attorney Jamie McLeod-Skinner in the May 17 primary.",
    "Delgado, a moderate representing the swingy 19th District in Upstate's Hudson Valley, was facing a difficult re-election campaign that was likely about to get more so: While his fellow Democrats had sought to make his seat bluer in redistricting, that map was recently thrown out by the state's highest court, so the next iteration of the 19thwhich will be drawn by an independent expertcould well be tougher.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nBig, big May primary preview, with Jeff Singer\nThe Downballot\nFollowShare\n0:0053:14\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? OH-Sen: The Republican primary for Ohio's open Senate seatwhich weighed in at nearly $75 millionfinally concluded on Tuesday with a win for Trump's endorsed candidate, venture capitalist J.D.",
    "Dan McKee: $427,000 raised, $1.1 million cash-on-hand\nSecretary of State Nellie Gorbea: $378,000 raised, $896,000 cash-on-hand\nformer Secretary of State Matt Brown: $110,000 raised, $79,000 cash-on-hand\nBusinesswoman Ashley Kalus, who is the only major Republican contender, took in a mere $13,000 from donors but self-funded another $500,000, which left her with $410,000 available at the end of March.",
    "Ad Roundup\nGA-Sen: Raphael Warnock (D-inc)\nOH-Sen: Tim Ryan (D)\nWI-Sen: Ron Johnson (R-inc)\nCA-Gov: Gavin Newsom (D-inc)\nMD-Gov: Rushern Baker (D)\nKY-03: Protect Our Future PAC - pro-Morgan McGarvey (D)\nMN-01: Jeff Ettinger (D)\nNC-04: Protect Our Future PAC - pro-Valerie Foushee (D)\nGA-AG: Chris Carr (R-inc)\nThis is a short blurb about Daily Kos.",
    "Recent trends had been favorable for Democrats in the 19th: Joe Biden flipped the district in 2020, carrying it by a slender 50-48 margin four years after Donald Trump won it 51-44; Delgado, meanwhile, unseated one-term Republican Rep. John Faso 51-46 in 2018 and then defeated an unheralded GOP foe 54-43 two years later.",
    "The legislation also allowed a seven-member committee of Democratic leaders to swap Delgado in for Benjamin, who prior to the new law's enactment could only have been taken off the ballot had he died, moved to another state, or been nominated for another office; now, anyone charged with a crime can be removed as well.",
    "Governors\n? NY-Gov: The state Board of Elections ruled Monday that both 2014 nominee Rob Astorino and former Trump White House staffer Andrew Giuliani had submitted enough valid signatures to appear on the June Republican primary ballot despite a challenge by one of their intra-party rivals, Rep. Lee Zeldin.",
    "Delgado will benefit from Hochul's powerful perch and massive war chest, but he may be hurt by accusations that the governor sought to change the rules mid-stream in order to benefit herselfa concern that led a sizable number of Democratic senators to oppose the bill in a rare show of dissent.",
    "That system typically prompts pairs of candidates to forge alliances in the hopes of avoiding an unwelcome \"shotgun wedding\" for the general election, but even if Hochul defeats her two opponents on June 28 (as all polls have indicated she will), there's no guarantee Delgado will do the same.",
    "Prosecutors\n? Baltimore, MD State's Attorney: Prosecutor Thiru Vignarajah last month released a mid-April GQR poll that shows him trailing incumbent Marilyn Mosby 35-32 in the July Democratic primary to serve as Baltimore's top prosecutor, with defense attorney Ivan Bates at 13%.",
    "Carlson reportedly not only made the case that Vance's anti-Trump days were long behind him, he also argued that Mandel's main benefactor, Club president David McIntosh, was untrustworthy because of what the story calls an \"an embarrassing and 'chronic' personal sexual habit.\"",
    "The party's leadership also threw its support behind attorney Joey Gilbert, who has bragged that he was \"definitely on the Capitol steps\" on Jan. 6, in the primary for governor; the decision came days after Trump endorsed another candidate, Clark County Sheriff Joe Lombardo.",
    "? RI-Gov: Campaign finance reports are in covering the first quarter of 2022, and WPRI has rounded up the totals for all the notable Democratic contenders:\nformer CVS executive Helena Foulkes: $900,000 raised, additional $400,000 self-funded, $1.5 million cash-on-hand\nGov.",
    "The group highlighted the previous falls assault by the Club for Growth, which supported Mandel and had run a barrage of ads using 2016 footage of Vance saying, \"I'm a Never Trump guy,\" an offensive that persuaded many voters that Vance could not be trusted.",
    "The first spot from the super PAC, which is funded in part by LinkedIn co-founder Reid Hoffman, uses footage of the Jan. 6 attack and warnings about Team Blue's prospects in the midterms to argue, \"We need proven leaders who can beat Trump Republicans.\"",
    "Once Delgado is sworn in to his new postno legislative confirmation is requiredHochul will have 10 days to call a special election under a law passed last year requiring such elections be held in a much timelier manner than they had been in the past.",
    "Vance\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "We'll be recapping all of Tuesday's results in Ohio and Indiana in the next Morning Digest, though if you don't want to wait that long, join us on Wednesday at Daily Kos Elections and follow along as we provide updates in our Live Digest.",
    "Collins had been running against Democratic Rep. Kathy Castor in the neighboring 14th District, which remains safely blue turf under the GOP's new gerrymander, and he ended March with $339,000 on hand that he can use for his new campaign.",
    "The narrator goes on to declare that McLeod-Skinner, who lost both the 2018 general election for the safely red 2nd District and 2020 primary for secretary of state, \"just can't do it,\" while Schrader \"beats every Republican every time.\"",
    "? TN-05: Music video producer Robby Starbuck has filed a lawsuit in federal court challenging the state GOP's decision to keep him off the August primary ballot for failing to meet the party's definition of a \"bona fide\" Republican.",
    "Ulster County Executive Pat Ryan, who took second place to Delgado in the 2018 primary, said he was considering, while an unnamed source told the New York Times that state Sen. Michelle Hinchey is looking at the contest as well.",
    "Senate\n? NV-Sen, NV-Gov, NV-04: Former state Attorney General Adam Laxalt has publicized an internal from WPA Intelligence that gives him a 57-20 lead over Army veteran Sam Brown ahead of the June 14 Republican primary.",
    "Starbuck, who moved to the state three years ago, was rejected because he had not voted in three of the last four statewide primaries, which his suit dubbed an unconstitutional \"camouflaged residency requirement.\"",
    "Andrew Cuomo romped to an easy 66-34 victory over actor and activist Cynthia Nixon, Hochul only narrowly defeated the little-known Williams, at the time a member of the City Council, by just a 53-47 margin.",
    "Vance will take on Democratic Rep. Tim Ryan, who won his own primary 70-18 against former Treasury official Morgan Harper, in a longtime swing state that has lurched hard to the right in recent years.",
    "Vance, the Hillbilly Elegy author and one-time vociferous Trump critic, reinvented himself as a MAGA diehard and defeated former state Treasurer Josh Mandel 32-24 for the nod to succeed retiring Sen.",
    "Former State Department spokesperson Morgan Ortagus, who was Trump's endorsed candidate, also failed to pass the bona fide test for the same reasons, but she says she will not challenge the decision.",
    "Dutchess County Executive Marc Molinaro has been running for the 19th since September without any serious intra-party opposition, and he quickly confirmed he would campaign in this summer's contest.",
    "In fact, after Benjamin's arrest on bribery charges, a number of progressive leaders had rallied around activist Ana Maria Archila, who's allied with New York City Public Advocate Jumaane Williams.",
    "The magazine refused to provide any details about this salacious claim, but it relayed that Trump \"spent a notable amount of time gossiping and laughing about the prominent Republican's penis.\"",
    "On the Democratic side, Alan Cohn, who was the party's 2020 nominee against now-Rep. Scott Franklin in the old 15th, says he's also \"seriously considering\" running for the open seat.",
    "House\n? FL-15, FL-14: Jay Collins, who lost a leg as a combat medic in Afghanistan, announced Tuesday that he would seek the Republican nomination for the new and open 15th District.",
    "Just a few months ago, Vance's allies at Protect Ohio Values, a super PAC funded by megadonor Peter Thiel, warned that the candidate's poll numbers were in \"precipitous decline.\"",
    "(Cuomo had been notorious for repeatedly dragging his feet on calling specials when it didn't suit him to do so, thanks to a huge gap in state law that gave him wide discretion.)",
    "Vance was also able to keep going because none of his four major rivals were able to establish a meaningful leadeither in the polls or in the contest to win Trump's endorsement.",
    "The Club hoped that voters wouldn't be so forgiving, and it even ran a commercial questioning Trump's judgmenta shocking gambit given the GOP's obeisance to its supreme master.",
    "Kathy Hochul named Rep. Antonio Delgado as her new lieutenant governor on Tuesday, the day after state legislators passed a new law at Hochul's behest allowing former Lt. Gov.",
    "In New York, local party committees, rather than primary voters, pick nominees for special elections, but there isn't much suspense as to whom Republicans will choose.",
    "The commercial continues by arguing that the incumbent shares \"our Democratic values\" and reminding the audience that he's President Joe Biden's endorsed candidate.",
    "Trump excused Vance's past disloyalty at a recent rally, saying that while his new favorite had indeed \"said some bad shit about me,\" each of his rivals \"did also.\"",
    "(The only other alternative, former New York City Councilwoman Diana Reyna, is running alongside Rep. Tom Suozzi, who's positioned himself well to Hochul's right.)",
    "It may not matter, though, as NBC notes that \"courts, including those in Tennessee, have given broad deference to political parties in such disputes\" as this one.",
    "Even Trump himself managed to give Vance a humiliating round of headlines just two days before Election Day when he told an audience, \"We've endorsedJP, right?",
    "The financier also had a powerful ally in Fox News host Tucker Carlson, whom Rolling Stone reported played a key role in winning Trump over to Vance's side.",
    "In New York, candidates run in separate primaries for governor and lieutenant governor, with the winners merged onto a single ticket on the November ballot.",
    "Thiel's group responded with new advertisements that rebranded Vance as a Trump loyalist, a maneuver that seems to have at least kept him in contention.",
    "No matter what ultimately convinced Trump, though, he went on to give his stamp of approval to Vance less than three weeks ahead of the primary.",
    "The central committee of the Nevada Republican Party, though, spurned the Trump-backed frontrunner over the weekend by voting to endorse Brown.",
    "Additionally, the state GOP went for Air Force veteran Sam Peters in the GOP contest to face 4th District Democratic Rep. Steven Horsford.",
    "And no one knows better that being linked with a powerful, deep-pocketed governor is no guarantee of victory than Hochul herself.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Back in mid-March, WPA's survey for Laxalt's allies at the Club for Growth found him ahead by an almost-identical 57-20 margin.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "It takes only a simple plurality to secure the Democratic nod, which is tantamount to election in this reliably blue city.",
    "Businessman Baxter Lee, the third candidate kicked off the ballot, does not appear to have said what he'll do.",
    "The field also includes wealthy businessman Harry Wilson, whose petitions were not contested by anyone.",
    "Things are far more uncertain on the Democratic side, though a couple of names have already surfaced.",
    "While redistricting is still up in the air, the special will take place under the old lines.",
    "(Only state Sen. Matt Dolan, who criticized Trump as recently as last year, didn't seek it.)",
    "Brian Benjamin's name to be removed from the ballot following his resignation last month.",
    "But while Trump couldn't remember Vance's name, enough Republican primary voters could.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "(Franklin himself is running for the renumbered 18th District.)",
    "The election must then be held within 70 to 80 days.",
    "Donate $5\nDonate $25\nDonate $15\n'\nDonate $5 monthly",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "(Can't believe you just had to read that sentence?",
    "We can't believe we had to write it, either.)",
    "Subscribe to our podcast, The Downballot!",
    "But Delgado's new path is still fraught.",
    "In 2018, on the same day that then-Gov.",
    "JD Mandel, and he's doing great.\"",
    "Ohio Senate GOP nominee J.D.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "? NY-LG, NY-19: Gov.",
    "Please read it.",
    "Rob Portman.",
    "Vance."
  ]
}