{
  "id": 5887,
  "mediaId": 234,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "J.D. Vances Victory in Ohio Is a Huge Win for Peter Thiels Political Movement",
  "image": "https://media.vanityfair.com/photos/6272ecd97a6295258c437c0d/master/w_2240,c_limit/GettyImages-1240433455.jpg",
  "link": "https://www.vanityfair.com/news/2022/05/jd-vances-victory-peter-thiels-movement",
  "sentiment": "0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caleb Ecarma",
  "authorUrl": "https://www.vanityfair.com/contributor/caleb-ecarma",
  "termIds": [
    3103
  ],
  "sentences": [
    " Inside the Virus-Hunting Nonprofit at the Center of the Lab-Leak Controversy\n Jared Kushner and Donald Trump Probably Wont Be Splitting a Milkshake Anytime Soon\n CNN Leaves the Drama Behind With Focus on War in Ukraine\n Trumps Truth Social Is an Even Bigger Humiliation Than Previous Business Failures\n The Clock Is Ticking on the January 6 Investigation\n The Washington Post Checks In, Finds Trump Is Still a Lying Sociopath\n A Ukrainian Woman Explains the War to Europes Skeptics\n From the Archive: How Playboy Imran Khan Became the Prime Minister of Pakistan\n Not a subscriber?",
    "Its a movement not without idiosyncrasies (Thiel himself helped fuel Silicon Valleys rise to power as an early investor in Facebook and longtime member of Metas board, which he decided to step down from earlier this year) but one that a cadre of young politicians seems to be heeding; perhaps best captured in Congress by Josh Hawley, the 42-year-old Missouri Republican who, as it turns out, has also been a recipient of Thiels philanthropy and is the only sitting senator to have endorsed Vance.",
    "If Vance wins the general election (a likely outcome, as Donald Trump won Ohio comfortably in 2016 and 2020), he will give more political capital to the New Right, a movement made up of young nationalists with a disdain for a dystopian world created by the Big Tech, free trade, and hawkish foreign policies that defined the pre-Trump Republican Party.",
    "(As my colleague Eric Lutz reported, Vance once labeled himself a Never Trump guy? and worried the former president could be Americas Hitler.?) But Vance and Thiel have history; Vance worked for Thiels venture capital firm, and more recently the tech billionaire backed Vances venture capital firm in 2020.",
    "Masters, a 35-year-old who previously served as COO of Thiels venture capital firm and has received $10 million from the billionaire via a PAC, is currently polling in third place, but the primary is still months away, with a recent survey showing that 31% of voters remain undecided.",
    "Vance, a Yale graduate who grew up in the Rust Belt, became a darling of liberal commentators in the early years of Trumps presidency, thanks to his best-selling memoir, Hillbilly Elegy, which sought to understand the ideology of Trump supporters.",
    "And in Vances Thiel-fueled rebrand as a Trump-loving right-winger, he has thrown away his cosmopolitan credentials in favor of a beard, red meat politics, and endorsements from representatives Marjorie Taylor Greene and Matt Gaetz.",
    "Thiel, the billionaire cofounder of PayPal who pumped $15 million into a super PAC backing Vance, has said hes devoting his political activism, and donations, toward politicians who fit his MAGA-loving, Big Techlibertarian mold.",
    "Last weekend the former president thanked the candidate for supporting his voter-fraud conspiracy theories while giving a remote address at an election integrity event? that Masters organized in Chandler, Arizona.",
    "In the end, Vance became the outsider candidate; Josh Mandel, Vances biggest rival, won the support of senators Ted Cruz and Mike Leeand the backing of the traditional conservative group Club for Growth.",
    "Vances ability to eke out a win shows not only the power Trumps endorsement still has in the party, but also the rise of this new post-Trump ideology that Vance and his backers appear to be building.",
    "Silicon Valley billionaire Peter Thiels endeavor to become the kingmaker of the so-called New Right had a big electoral victory Tuesday night, when J.D.",
    "Even with Thiels financial backing and a Tucker Carlson endorsement, Vances campaign was stuck in second gear as recently as early April.",
    "But his polling numbers quickly spiked after he received a coveted Trump endorsement a little less than three weeks ago.",
    "The New Rights next test is in Arizona, where another Thiel protg, Blake Masters, is running in the GOP Senate primary.",
    "Vance, a 37-year-old Ivy League academic turned populist firebrand, won the GOP primary in Ohios U.S. Senate race.",
    "If he finds similar success, it wouldnt be far-fetched to expect the rise of a New Right Caucus in Congress.",
    "On his face, Vance may sound like a strange beneficiary of support from a Trump-loving magnate like Thiel.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "Vance proved to be a big risk for Thiel, but one that paid off.",
    "Donald Trump Jr. also joined Vance on the campaign trail.",
    "And Trump has already shown interest in Masters.",
    "He, too, has received Hawleys endorsement."
  ]
}