{
  "id": 5896,
  "mediaId": 65,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Polls now closed in Ohio, where the GOP Senate primary is seen a key test of Trump's GOP clout",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/881ee4e4-ded6-4082-bef2-a566461ef3c1/5b1ce8b4-63b8-4b0b-8a18-85966e326552/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/polls-now-closed-in-ohio-where-the-gop-senate-primary-is-seen-a-key-test-of-trumps-gop-clout",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    781,
    819,
    1147,
    2087,
    3103,
    428,
    571,
    2609,
    2614,
    2845
  ],
  "sentences": [
    "CLICK HERE FOR THE LATEST PRIMARY ELECTION RESULTS FROM FOX NEWS\nThe race for well over a year had been a battle among the major contenders to land the endorsement of Trump, who more than 15 months removed from the White House remains the most popular and influential politician in the GOP.",
    "Things got so heated that two leading contenders - 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer and investment banker, and former Ohio treasurer and former two-time Senate candidate Josh Mandel - nearly came to blows at a debate.",
    "Also among the leading contenders for the Republican nomination were state Sen. Matt Dolan, a former county prosecutor and state assistant attorney general and one of the co-owners of Major League Baseballs Cleveland Guardians, and former Ohio GOP chair Jane Timken.",
    "CINCINNATI - Polls have closed in Ohio, where a crowded, combustible, and expensive race for the GOP Senate nomination has grabbed national attention and is seen as test of former President Donald Trump's continued grip over the Republican Party.",
    "While the former presidents backing  and an ensuing Trump/Vance rally in Ohio a week and a half ago  helped Vance surge in the polls, the race remained competitive, with plenty of voters undecided as primary day neared.",
    "DeWine, a former two-term senator who later served eight years as state attorney general before winning the governorship in 2018, faced multiple primary challenges from the right as he seeks a second term steering Ohio.",
    "There won't be any primary runoffs, because in Ohio the candidate grabbing the highest number of votes wins the contest even if that candidate does not secure an outright majority of the votes cast.",
    "Voters in Ohio and the neighboring Midwestern state of Indiana are holding primary elections on Tuesday, kicking off a frenetic schedule this month, with a total of 13 states holding primaries.",
    "The president is backing now-Rep. Shontel Brown, who last August defeated former state Sen. Nina Turner by five points in special election Democratic primary to fill the vacant deep-blue seat.",
    "Ryan's promoted populist policies popular with working class voters during his years in Congress and during an unsuccessful bid for the 2020 Democratic presidential nomination.",
    "Less than half an hour after the polls closed in Ohio, the Associated Press projected that longtime Democratic Rep. Tim Ryan would win the Democratic nomination.",
    "As the leading candidates tried to one-up each other in showcasing their support and loyalty to Trump, the nomination battle turned increasingly antagonistic.",
    "But the Democratic primary in Ohios 11th Congressional Districts grabbing national attention, thanks to a rare and last-minute endorsement by President Biden.",
    "MAY MADNESS: PRIMARY SEASON IGNITES IN EARNEST\nWhile Trump has criticized DeWine in the past, he did not make an endorsement in the gubernatorial primary.",
    "CLICK HERE TO GET THE FOX NEWS APP\nThis years primary is a rematch  and is once again a test of the Democratic Partys moderate and progressive wings.",
    "DeWine is fairly popular in the state but angered many on the right over the restrictions he implemented at the onset of the coronavirus pandemic.",
    "The winner of the GOP primary will face off in Novembers general election against Ryan, who's long represented a district in northeastern Ohio.",
    "The Democratic gubernatorial primary was a battle of former mayors - John Cranley of Cincinnati and Nan Whaley of Dayton.",
    "Up for grabs in Ohio - the Democratic and Republican nominations for Senate, governor, and key congressional districts.",
    "There are also a handful of consequential congressional primaries, with most of the action on the Republican side.",
    "Trump stayed neutral until a few weeks ago, when he endorsed venture capitalist and bestselling author J.D.",
    "But the GOP primary in the showdown to succeed retiring Republican Sen.",
    "A few minutes later the AP projected that Republican Gov.",
    "The AP projected Whaley would win her party's nomination.",
    "Rob Portman is the contest in the spotlight.",
    "He is widely expected to win, though.",
    "Mike DeWine would win renomination.",
    "Vance."
  ]
}