{
  "id": 5906,
  "mediaId": 238,
  "date": "d2022-05-03T21:11",
  "headline": "The Trailer: What to watch tonight in Ohio and Indiana",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/03/trailer-what-watch-tonight-ohio-indiana/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    648,
    946,
    1801,
    2027,
    2466,
    3103,
    3913,
    2614,
    2623,
    2710,
    2845
  ],
  "sentences": [
    "We should be doing all we can to preserve the House majority right now.?\n seven days until primaries in Nebraska and West Virginia\n 14 days until primaries in Idaho, Kentucky, Oregon, North Carolina and Pennsylvania\n 21 days until Texas runoffs, primaries in Arkansas, Alabama, and Georgia, and the special primary in Minnesota's 1st Congressional District\n 39 days until the special House primary in Alaska\n 56 days until the special election in Nebraska's 1st Congressional District\n 72 days until the special election in Texas's 34th Congressional District\n 183 days until the midterm elections",
    "Ryan plays darts in a bar as he explains that he's fought his party, singling out the campaign to defund the police? and saying we need more cops, not less.?\nMaggie for N.H., Relief.? Expect to see a lot of this in Democratic ads this year: I'm taking on members of my own party.? Ryan's ad called out specific left-wing ideas he can't stand, while Sen. Maggie Hassan (D-N.H.)'s highlights her campaign to eliminate the federal gas tax until 2023.",
    "Manchin, whose approval rating with Republican voters has jumped up since he killed the Democrats' social spending and climate plan last year, goes after Alex Mooney and his out-of-state supporters? for blurring the lines and pretending that McKinley's vote for the bipartisan infrastructure bill was a vote for Build Back Better.? Manchin should know: As he says, he voted for the first and opposed the second.",
    "If the election for governor were held today, who would you vote for?? (Suffolk University/Boston Globe, April 24-28, 800 adults)\nMaura Healey (D): 54%\nGeoff Diehl (R): 27%\nUndecided: 17%\nCharlie Baker (I): 37%\nMaura Healey (D): 28%\nGeoff Diehl (R): 17%\nUndecided: 17%\nRepublican chances of holding onto the governor's office in Massachusetts practically vanished when Gov.",
    "Harper's challenge to Rep. Tim Ryan (D-Ohio), the party establishment-endorsed U.S. Senate candidate, hasn't attracted as much outside money, with no one rushing in to help Harper make her argument; essentially, that her inspiring personal story and support for policies like Medicare-for-all can change the electorate by getting the Democratic base to turn out.",
    "Vance and Dolan spent the last days of the campaign throwing rocks at each other over issues such as whether the Hillbilly Elegy? author should have accepted Rep. Matt Gaetz's (R-Fla.) endorsement, and why Dolan's family opted to rename the Cleveland Indians baseball team to the Cleveland Guardians; Mandel campaigned with Sen. Ted Cruz (R-Tex.).",
    "You can read more about the Turner-Brown rematch in the 11th Congressional later in this newsletter, but the short version is that the congresswoman took full advantage of her six-month incumbency, denying Turner some of the endorsements she'd won when the seat was vacant  and benefiting when anti-Turner PACs returned for another round of ads.",
    "That includes 75 percent of Democrats, 53 percent of independents, and 36 percent of Republicans, and the last number there tells you why liberals, who have been speculating about the end of Roe since 2016, believe that there are moderate voters who simply never considered that the pre-1973 status quo on abortion could return.",
    "At the house party, Smith had the same take on Brown's messaging: There's no way she could have gone to Washington and done the things she's claimed that she's done.?\nTurner and Brown never got a traditional face-to-face debate ahead of May 3, meeting only when Cleveland.com conducted its endorsement interviews.",
    "Were deeply concerned about the implications for the House seat, especially in the wake of Roe,? said Ravi Mangla, a spokesman for the New York Working Families Party, which has endorsed Jumaane Williams and his running mate over Hochul in the June gubernatorial primary.",
    "I knock doors, and I hear health care and about inflation and jobs, and being able to make a living wage.? And since then, she said, Democratic voters who believed that she had been too hard on Biden  she was co-chair of the 2020 Bernie Sanders campaign  were listening.",
    "State Sen. Theresa Gavarone already represents most of the district, but she committed the sort of sin that has sunk Republicans in primaries since 2016  when the Access Hollywood? tape was published by The Washington Post, she criticized Trump for what he said on it.",
    "Maybe we'll get our normal life back.?\nFormer state GOP chair Jane Timken also faded in the stretch, deprived of a Trump endorsement that could have confirmed the case she made on the stump and in paid advertising: No one running had done more for the 45th president.",
    "Turner campaigned around the district, saying she'd provide more muscular representation for Cleveland, and asking voters if they really wanted to validate the way these campaigns had been conducted, with pressure groups dropping ads at the last minute to sway them.",
    "And Democrats were expecting a court-appointed mapmaker to make the 19th district harder for their party to win, potentially breaking up the lines their party drew north of Westchester and east of Rochester, which packed Republicans into as few seats as possible.",
    "Ohio's new 13th Congressional District, which includes all of Akron's Summit County and most of Canton's Stark County, narrowly voted for Trump in 2020; Trump has endorsed Madison Gesiotto Gilbert, a former Miss Ohio, in the seven-way race for the GOP nomination.",
    "Tom Kean, Are You Ready?? After losing a 2006 U.S. Senate bid and (more narrowly) a 2020 House bid in New Jersey, Kean, the namesake son of the popular ex-governor, is running in a friendlier district against a Democrat embroiled in a stock trading controversy.",
    "Lindy Blanchard for Governor, Education, Not Indoctrination.? The Magic City Acceptance Academy, which promotes an LGBTQ-affirming learning environment,? has been condemned by multiple Republicans running for governor, all of them asking why Alabama Gov.",
    "Todays election will be the first test of an endorsement from Biden in a contested House primary (he supports Brown), and Turner believes that an electorate that rejected her over her criticism of Biden last August has changed over six cruel months.",
    "Nobody created Trump folk art in Indiana's 1st Congressional District, but Republicans, encouraged by how the state's northwest corner has shifted right, have piled into a primary for the chance to challenge freshman Rep. Frank J. Mrvan (D-Ind.).",
    "Democrats, who've only held the job for eight years since 1991, have lost under all kinds of conditions, but voters have never elected a conservative Republican governor  Diehl's momentum in a primary with Baker was one reason Baker packed it in.",
    "He dont know me!?\nThe rematch between Turner and Brown hasnt gotten the same national attention as last years special election, which became a brawl between the Democratic Partys left and party leaders who wanted to keep Turner out of Congress.",
    "Two counties to watch for trends: Mahoning, the former Democratic stronghold where every Republican rallied in the final days, and Shelby, a deep red county in northwest Ohio where the local Republican Party was outright hostile to Vance.",
    "That's what Sen. Joe Manchin III (D-W.Va.) does here, urging Republican primary voters to pick Rep. David B. McKinley (R-W.Va.) over Rep. Alex Mooney (R-W.Va.) in a race (which we've covered) that puts the two men in the same district.",
    "Last night, Whaley was one of the first Democratic candidates to react to a leak of a potential Supreme Court opinion overturning Roe v. Wade, saying that Democrats had a chance to elect a genuinely pro-choice candidate?  hint, hint.",
    "But in the short term, Democrats now risk losing two special elections ahead of the midterm election  and, if that happens, heading into the final months of this Congress with just 220 seats, down from the 222 they held in January.",
    "Antonio Delgado was smart and got a jump on the job market before he and the rest of his House Democrat colleagues lose this fall,? National Republican Congressional Committee regional spokeswoman Samantha Bullock said on Tuesday.",
    "As of mid-April, Ryan had raised $13 million to $1.2 million for Harper, who largely relied on earned media for exposure, even joining Mandel for two debates  one getting so nasty that she declined to shake the Republican's hand.",
    "Now, what does that say??\nThe Democratic Majority for Israel, which spent more than $2 million to beat Turner last year, has spent more than $1 million this time, hoping to finally end the 54-year old Democrats political career.",
    "Brown is congenial and pleasant, but often leaves the impression shes speaking talking points, not convictions,? Cleveland.com's editorial board wrote, explaining why they were once again urging voters to support somebody else.",
    "Internal GOP polling shared with Politico this week found Mayra Flores, the Republican nominee in both the special election and general election, up by single digits over Dan Sanchez (D), who won't be the nominee in November.",
    "He will also leave Congress to start serving in the new role, which will prompt a special election in New York's 19th Congressional District, which Biden carried by 1.6 points in 2020 after Hillary Clinton lost it in 2016.",
    "After months of fighting with the state Supreme Court, Ohio Republicans stuck with new congressional maps that kept their advantage in the state while replacing two historically Democratic districts into swing seats.",
    "State Rep. Craig S. Riedel has run as an unapologetic Trump supporter, and veteran J.R. Majewski has literally reconstructed Trump's image on his lawn, earning him a call-out at the ex-president's rally last week.",
    "There's a decent win record for Ohio Democrats who started their careers as abortion rights foes, then evolved toward the party's mainstream position  Ryan and Rep. Marcy Kaptur (D-Ohio) both went on that journey.",
    "Tim Ryan for Ohio, Bullseye.? Three ads from Rep. Tim Ryan (D-Ohio), three different attacks on China  though the country he blames for sucking manufacturing out of the United States gets one quick mention here.",
    "Conservative activist Mark Pukita never got much traction in a race where there was little policy disagreement until Russia invaded Ukraine, and perennial candidate Neil Patel never made an impression at all.",
    "If this state didn't want to elect me to the U.S. Senate, that's fine, I accept that,? said Gibbons, who has spent more than $10 million of his own money on the race, at a roundtable near Cleveland last week.",
    "Protect Our Future, the PAC funded by a cryptocurrency billionaire, has spent $1 million to help Brown, while the American-Israel Public Affairs Committees new super PAC has spent a bit less than $300,000.",
    "It wasn't true  Sen. Sherrod Brown (D-Ohio) had pushed for the new spending  and it was a factor when Cleveland.com, the district's biggest news source, endorsed Turner for the second consecutive time.",
    "That didn't happen last year.?\nThere is no public polling on the race, and Turners defeat last year, powered by a surge of PAC money in its final weeks, has kept some of her old endorsers on the bench.",
    "Both now have challengers who accuse them, respectively, of enforcing unnecessary covid-19 restrictions, and of not working hard enough to secure the 2020 election for former president Donald Trump.",
    "Cranley's personal views didn't become a defining issue in the race, despite Whaley's emphasis and despite some of her endorsers, like Emily's List, citing it as a reason they backed her over him.",
    "Most of the runtime is spent on rosy economic figures from the past few months, and Evers, like a lot of Democratic incumbents this year, talks about rock-bottom unemployment and a budget surplus.",
    "She took office the week that the bipartisan infrastructure package passed the House, but in campaign ads, she credited her work with millions of dollars in projects earmarked for the district.",
    "His newer Rebellion PAC has spent more than $200,000 to run digital ads, which highlight Turners agenda  a $15 minimum wage, Medicare-for-all  and say that Brown will not fight? for any of it.",
    "Thanks to a quickly-passed law in Albany, which loosened the state's restriction on replacing candidates on primary ballots, Delgado will run in the June primary with Hochul's endorsement.",
    "Second, they hadn't run an efficient field operation, and didn't take advantage when supporters barnstormed the district  most notably, Sanders and Rep. Alexandria Ocasio-Cortez (D-N.Y.).",
    "One of the Democrats who lost to Delgado that year, Pat Ryan, went on to get elected Ulster County executive; according to City & State New York, he was looking at a run in the special.",
    "Turner, who became Sanders's most visible supporter in both of his runs, entered the special election as a juggernaut, piling up money and leading in her campaign's internal polls.",
    "There are few significant policy differences between Whaley, who briefly sought the office in 2018, and Cranley, who's said he'd retire after one term if he doesn't meet his goals.",
    "(He was lured to run because Rep. Vicente Gonzalez (D), who is relocating from a more competitive district, can't run for the special election and serve in two districts at once.)",
    "And we want to make sure that message doesnt get lost.?\nLast year, Turner got backup from the CPC and other liberal groups, like the Working Families Party and Justice Democrats.",
    "Greater Cleveland ain't for sale.?\nMcKinley for Congress, Right Choice.? It's rare, but not unheard of, for a politician of one party to cut an ad for someone in the other party.",
    "The new 9th Congressional District, based in Toledo, replaced a gerrymandered seat that scooped up part of Cleveland with one that is based in northwest Ohio and trending right.",
    "Our campaign's incredible momentum pushed Delgado to run scared and ultimately take the easy way out.?\nDemocrats have a bench in the upstate district, as that 2018 race proved.",
    "The ad from Blanchard, a Republican business executive, starts with a recent video of Trump condemning transgender? education, then suggests Ivy is not following Trump's lead.",
    "DeWine's never trailed in polls, and but the Republican Governors Association, which as a rule supports its incumbents, threw more than $1 million into a PAC supporting him.",
    "His state health director, Amy Acton, during the worst of the covid-19 pandemic was so popular that Democrats tried to woo her into the U.S. Senate race, as their candidate.",
    "And last year, a wave of PAC money helped Rep. Shontel Brown (D-Ohio) beat Nina Turner, who had been favored to win a special election and join the squad? in Washington.",
    "Republicans were targeting him anyway, with Marc J. Molinaro, the Dutchess County executive who lost that year's race for governor, unchallenged for the GOP nomination.",
    "Now, Molinaro is the all-but-certain GOP nominee in a special election that will likely be scheduled sometime in July, a dead zone when no other elections will be held.",
    "A barrage of TV ads put him in first place, briefly; another barrage, from the Club for Growth, helped drive him down, along with some unsteady debate performances.",
    "Both parties see the June 14 election in Texas's 34th Congressional District, where a Democrat quit early to become a lobbyist, as highly winnable for Republicans.",
    "We're saying: No, its not good enough.?\nPart of that effort is about reversing the damage from Turner's defeat last year, which rippled through other House races.",
    "In 2020, former Consumer Finance Protection Bureau attorney Morgan Harper got crushed in the first primary challenge to be held during the covid-19 pandemic.",
    "They believe they can manipulate the community into picking the person they want,? Turner told an audience at the home of former state Sen. Shirley Smith.",
    "It solves a problem Hochul created for herself  her first lieutenant governor, Brian Benjamin, resigned after being indicted on federal bribery charges.",
    "When voters are asked if they'd want Baker, if he ran as an independent, he dominated with no-party-preference voters and a small number of Democrats.",
    "Do they think overturning it means banning all abortion or, when they learn that states can enact their own policies, will they adjust their opinions?",
    "In this edition: Primary day in Ohio and Indiana, on the trail for the day's biggest rematch, and Republicans get another House pick-up opportunity.",
    "In the final poll on the issue taken before Politico obtained a leak draft of the Dobbs decision, most voters remain supportive of Roe staying put.",
    "He's running his most conservative-coded campaign yet, summing himself up here as a pro-cop, pro-border security, inflation-fighting? Republican.",
    "But Turner plowed ahead, hopeful that a redrawn district  parts of Akron replaced with more of Cleveland  would give her a chance to win again.",
    "Two female veterans have raised roughly the same amount of money  Air Force reservist Jennifer-Ruth Green and former LaPorte Mayor Blair Milo.",
    "The governor is favored to win, thanks to ex-Rep. James B. Renacci and activist Joe Blystone going after the same anti-establishment voters.",
    "doesn't accuse challenger Jake Bequette, a veteran and former professional football player, of any particular sin against the ex-president.",
    "Terms like gender-affirming care? and gender fluidity? are more applicable to the schools debate, but Blanchard is quoting Trump verbatim.",
    "Theyve ignored this race, which baffled Cenk Uygur, the Young Turks video network founder and host, who also co-founded Justice Democrats.",
    "SOUTH EUCLID, Ohio  It was Thursday evening, a few days before the May 3 primary that would determine whether shed win a seat in Congress.",
    "On the trail last week, we heard plenty of GOP candidates urging their voters to vote on Tuesday, and plenty of voters agreeing with them.",
    "That helped Brown and outside groups scramble the race, running more ads during the early voting period, and knocking Turner off message.",
    "Boozman for Arkansas, America First Fighter.? Plenty of Republicans in tough primaries accuse their opponents of being disloyal to Trump.",
    "Delgados decision to resign midway through the election cycle shows that he knows he would lose in November,? Molinaro said on Tuesday.",
    "Ohio's GOP electorate has evolved since the last competitive primary, with thousands more ex-Democrats in rural areas switching over.",
    "And Maura Healey, the attorney general who'd be the state's first female governor, has scared off most of her potential challengers.",
    "It's not only this administration's top foreign policy priority; it was President Obama's top foreign policy priority,? said Turner.",
    "And first-term Secretary of State Frank LaRose presided over one of the smoothest 2020 elections in any presidential battleground.",
    "This 60-second reintroduction spot has Evers saying there's too much division in politics today,? but he doesn't get specific.",
    "First, they had spent money early, long before ballots went out, on ads that built up her name ID but did not lock in votes.",
    "Turnout has also been low, which could help Turner, but cuts against Harper's theory that she could excite tuned-out voters.",
    "But we had an election in 2020  perhaps you remember it  and Republican paranoia about early and absentee voting blossomed.",
    "The Cleveland area still represents around a fifth of the primary vote; both Dolan and Mandel have political bases there.",
    "Democrats have two choices for governor today: Former Dayton mayor Nan Whaley, and former Cincinnati mayor John Cranley.",
    "There'll be another special House election in a swing seat that Democrats can hardly afford to lose, after New York Gov.",
    "There's no reference to the Democrats who oppose this, and opposition has been muted, but she's establishing a theme.",
    "That leaves three candidates who, in the final round of polls, were bunched up in the 20s: Trump-endorsed author J.D.",
    "It wasn't Mike Gibbons, the investment banker who's 0 for 2 in Trump endorsements across his two U.S. Senate races.",
    "COLUMBUS  It's primary day again in America, with polls closing in Indiana at 6 p.m. and in Ohio 90 minutes later.",
    "The result: Biden endorsed her anyway and pro-Israel groups put new money into the campaign on her behalf.",
    "Turner is well-known in the district where she is running, and few people statewide have heard of Harper.",
    "Don't leak documents unless you want the Marshal of the Supreme Court to use his dark magic against you.",
    "Tony Evers (D) from doing much of what Democrats would have liked with control of the governor's office.",
    "And it also sets up a second summer special election where Republicans start out with a clear advantage.",
    "Blanchard's action plan: Ban transgender education? altogether and don't fund schools that encourage it.",
    "Delgado, who won a crowded race to first take the seat four years ago, usually ran ahead of the ticket.",
    "Even the Congressional Progressive Caucus, which endorsed her in 2021, has backed Brown for reelection.",
    "Brown had broken with the Biden administration over its attempt to craft a new nuclear deal with Iran.",
    "So if we beat her with the message that Democrats need to do more, the lesson will be crystal clear.",
    "I think people are more open to discussing how much they're suffering,? Turner said in an interview.",
    "In both states, early and absentee voting lagged behind 2018, with fewer Democrats pulling ballots.",
    "Brown, meanwhile, relied on incumbency for this rematch, even when she got criticized for doing so.",
    "The country is about to answer hypothetical questions that have been kicked around since the 1970s.",
    "It could have been a competitive race,? said Mark Mellman, the Democratic pollster who leads DMFI.",
    "If the author can win in those places, he's probably built the coalition that can win the primary.",
    "But last year, we showed that being pro-Israel is not just wise policy but also smart politics.",
    "In 2016, Sen. Bernie Sanders (I-Vt.) did worse here than he did in any other Midwest primary.",
    "Tony for Wisconsin, Tony.? Republican control of Wisconsin's legislature has blocked Gov.",
    "Turner, who raised nearly $5 million for that campaign, hasnt pulled in the same money.",
    "Turner was marveling at how much money had been spent to stop her, and reelect Brown.",
    "Rather, it says Bequette opposes President Trump and his America First fighter,? i.e.",
    "Part of the district is new, and those parts looked better for Turner than for Brown.",
    "Here's what to watch, as Republicans and Democrats line up at the voting booths.",
    "Republicans have even blocked him from making some appointments to his cabinet.",
    "(Trump won Ohio easily, but that hasn't smothered the calls for a vote audit.)",
    "Ohio is a political graveyard for the Democratic Party's resurgent left-wing.",
    "(Most of Indiana observes Eastern time, but 12 counties are on Central time.)",
    "Because the challenger is going against Trump's endorsement, he's anti-Trump.",
    "But a small number of conservative Democrats were under the same impression.",
    "This is bad for representative democracy,? Turner said at the house party.",
    "(A fourth candidate is on the ballot but has not run a competitive race.)",
    "When she lost, the candidate and her allies identified two key mistakes.",
    "Kathy Hochul (D) tapped Rep. Antonio Delgado to be lieutenant governor.",
    "Republicans now have two chances to flip Democratic seats this summer.",
    "Cranley, a Catholic, has been personally antiabortion; Whaley has not.",
    "The biggest disagreement between the candidates happened in the past.",
    "Do Ohio Democrats care if a candidate used to oppose legal abortion?",
    "There, four Republicans are battling for the right to face Kaptur.",
    "In 2018, ex-Rep. Dennis Kucinich lost a comeback bid for governor.",
    "Two of those candidates, Harper and Brown, are on today's ballot.",
    "Vance, state Sen. Matt Dolan, and ex-state Treasurer Josh Mandel.",
    "Which Republican will grab the U.S. Senate nomination in Ohio?",
    "The question here is which candidate peaked at the right time.",
    "We know which races will have the biggest impact on November.",
    "Brown spent much of the campaign's final week in Washington.",
    "Who'll win the GOP nominations in newly competitive seats?",
    "How many conservatives will reject Republican incumbents?",
    "People are being sold a bill of goods on the status quo.",
    "Charlie Baker (R) announced that he wouldn't run again.",
    "Can progressives upset the Democratic establishment?",
    "She has all the endorsements,? Uygur said of Brown.",
    "Kay Ivey (R) wasn't able to stop it from opening.",
    "They doing U-turns in the street,? Turner added.",
    "The oligarchs should not be able to buy races.",
    "We should be able to have dialogue and debate.",
    "What would voters do if Roe v. Wade was gone?",
    "People are stopping me in the grocery store.",
    "Youve got a crypto billionaire coming in.",
    "Either could make the seat competitive.",
    "This ad from Sen. John Boozman (R-Ark.)",
    "Mike DeWine's  approval rating soared.",
    "What we don't know is who'll turn out.",
    "For a little while in 2020, Gov.",
    "It hasnt quieted her opponents.",
    "She has a lot more money.",
    "We hear it on the doors.",
    "This is The Trailer.",
    "He dont know her!",
    "Boozman."
  ]
}