{
  "id": 5909,
  "mediaId": 237,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Live Blog: Ohio and Indiana Midterm primaries",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/82c6802/2147483647/strip/true/crop/1200x630+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fc6%2F74%2F32c3b98142419647b75359446dea%2Fwex-logo-1200x630-04-2020.png",
  "link": "https://www.washingtonexaminer.com/campaign/live-blog/ohio-indiana-midterm-primaries",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Maiorana/AP",
  "authorUrl": "",
  "termIds": [
    781,
    819,
    946,
    1147,
    1801,
    3103,
    571,
    3465,
    2710,
    2845
  ],
  "sentences": [
    "The top candidates in a crowded race for Ohio's open Senate seat affirmed their positions on abortion as voters headed to the polls on Tuesday, following the leak of the Supreme Court opinion that could overturn Roe v. Wade on Monday night.",
    "With days remaining before the states May 3 primary, polling shows DeWine leading a Republican field that also includes former Rep. Jim Renacci, businessman and farmer Joe Blystone, and former state Rep. Ron Hood.",
    "DeWines primary opponents said that his approach to the pandemic hurt business and cost jobs, while the governor has defended his approach as pragmatic in response to a public health crisis.",
    "Rep. Tim Ryan (D-OH), who is running for the Democratic senatorial nomination, promised Tuesday afternoon that he would work to codify abortion access at the federal level.",
    "Vance (@JDVance1) May 3, 2022\nJosh Mandel, another top GOP contender, also blasted the leak, calling it \"an attempt at mob rule\" while celebrating the decision.",
    "Bad weather in some of Ohio's largest counties may have contributed to low voter turnout, though early voter turnout was higher across the state than in 2018.",
    "Donald Trump Jr. did his part on Twitter earlier today, calling on fans of JD Vance (and his father) to get out there and vote for the Ohio Senate candidate.",
    "Republican Mike Gibbons promised to work for anti-abortion policies if elected, and said the issue was personal to him since his mother was adopted.",
    "While the day been taken over somewhat by the extraordinary events in the Supreme Court, there are still two important primaries tonight.",
    "The fact that things like this are leaking suggests the elites of the left dont care about norms or anything else besides winning.",
    "\"We still have to make sure we elect candidates that will continue to defend the unborn, which is exactly what I'll do in the U.S.",
    "\"Fighting for the right to choose includes passing the Womens Health Protection Act, which would codify Roe v. Wade,\" he tweeted.",
    "The main event will be the Ohio Senate race and whether former President Trump's endorsement of JD Vance proves a successful one.",
    "Vance said the ruling \"would be an amazing victory for the pro-life movement and, most importantly, the innocents we fight for.\"",
    "\"Huge [pro-life] victory and great to see the Court recognize all life is protected under the Constitution,\" he said on Twitter.",
    "If the eventual decision is the same as the leaked opinion, states will have greater power to regulate, and even ban, abortion.",
    "We need MAGA to turn out in full force to vote today for the only Trump endorsed conservative running for US Senate, @JDVance1.",
    "Mike DeWine appears poised to stave off a primary challenge and win renomination from his party, writes Kate Scanlon.",
    "Ohio was one of the first states to implement these restrictions but also one of the first states to lift them.",
    "Let's send a message to the corrupt RINO establishment and send JD to the Senate to put America First!!!",
    "#OHSen pic.twitter.com/O56STvuPpH\n Donald Trump Jr. (@DonaldJTrumpJr) May 3, 2022\nRepublican Gov.",
    "A RealClearPolitics average of polls showed DeWine leading the Republican primary field by 16.5%.",
    "For a guide on what to expect this evening, click here to read Sarah Westwood's handy guide.",
    "The outcome of the Dobbs v. Jackson decision will weigh heavy over the upcoming midterms.",
    "He added that the leak was a worrying sign of institutional breakdown driven by the left.",
    "Were there one anti-DeWine challenger, polls indicate it would be a much closer race.",
    "Good evening and welcome to our live coverage of the Ohio and Indiana primaries.",
    "Republican frontrunner and former President Donald Trump-endorsed J.D.",
    "He also took a jab at Vance's past unsupport of President Trump.",
    "Polls have closed in Indiana and Ohio, and the waiting begins.",
    "They have declared full scale culture war on multiple fronts.",
    "The overall turnout rate for the 2018 primary was 20%.",
    "Conservatives should wake up to this new reality.",
    "Votes are now being counted in Ohio and Indiana.",
    "\"I was proud to support the [WHPA] in the House.",
    "DeWine, 75, recently recovered from COVID-19.",
    "Ohio friends - The day is finally here.",
    "Now its time for the Senate to act.\"",
    "Senate.\"",
    " J.D."
  ]
}