{
  "id": 5912,
  "mediaId": 312,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "A Leaked Supreme Court Draft Threatens to Make Every Race About Abortion",
  "image": "https://api.time.com/wp-content/uploads/2022/05/pro-life-nations-01.jpg?w=600&h=276&quality=85",
  "link": "https://time.com/6173203/supreme-court-roe-midterms/",
  "mediaOutlet": "Time",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philip Elliott",
  "authorUrl": "",
  "termIds": [
    827,
    1300,
    2027,
    2058,
    3103,
    4864,
    482,
    2945
  ],
  "sentences": [
    "The leaking of a draft of a ruling that would overturn two landmark cases that in effect made access to abortion a constitutional right in the United States landed like a grenade, blowing up both the ongoing midterm elections and the agendas of both parties in Washington.",
    "The end of Roe would force every state to work out far more granular positions on abortion rights for their constituents, which could take the conversation from one largely seen as defined by Washington and turn it into a fight in every voters backyard.",
    "But the Democrats lacked a unified answer to a post-Roe world, lacking 60 votes in the Senate to codify protections for abortion rights and seemingly unwilling to change the rules so they could govern with just a majority of 51 votes in the Senate.",
    "Assuming Politico has its leak dead-to-rights that a majority of the justices is willing to rip a Band-Aid from the skin of American politics, such a ruling would do more than lead to the outright banning of abortion in more than a dozen states.",
    "(The notable exceptions, of course, come when candidates stray beyond the staid mainline postures, as was the case in 2012, when Republicans candidates like Rep. Todd Akin drew widespread scorn for rhetoric on legitimate rape? and pregnancy.)",
    "The GOP has fully embraced a return to the culture wars as a way to poke their own base, fanning discontent over what schools are teaching children and laying the foundation for anti-LGBTQ policies and narrower crackdowns on abortion access.",
    "But, perhaps instructively, American opinion on same-sex marriage swung rapidly and wildly when the Supreme Court legalized such unions  and could find a corresponding shift if a long-assumed right to abortion was suddenly stripped.",
    "Without the sense of distance, everyone from local elected officials to governors may suddenly be forced into defining exactly when pregnant individuals can have access to abortion and under what circumstances.",
    "Strategists who had been worried about anemic interest in a cycle without a presidential race on the ballot saw opportunities to engage unreliable voters and perhaps stave off the anticipated Democratic losses.",
    "But it also could spark widespread liberal outrage  not only among those who view abortion access as a leading issue, but a broader group of voters wary of what could come next from the 6-3 conservative court.",
    "In Gallup polling, moderate voters who describe themselves as pro-choice? enjoy an 18-point advantage over those who say theyre pro-life.?\nThe numbers, by and large, have remained consistent over the years.",
    "But those candidates are also contending with a late insurgent rise of Matt Dolan, a state senator whose family owns the Cleveland Guardians, and who has openly questioned the GOPs fealty to Trump.",
    "In that ambiguity and with a sliding abacus of nuance, both political parties wrestled with their responses to the fallout and calculations about the impact this would have on the electorate.",
    "For every hardcore anti-abortion activist, there are two moderate moms who have long assumed their reproductive rights were walled-off from the outrage churn over critical race theory.",
    "The initial 98-page ruling leaves little room for nuance: We hold that Roe and Casey must be overruled,? Justice Samuel Alito wrote of the nearly 50-year-old ruling and its follow-up.",
    "But the partisan divide remains pronounced in the poll, with 75% of Democrats telling ABC-Post pollsters that Roe should stand and 44% of Republicans saying it should be overturned.",
    "It could also upend the broader landscape of individual rights, potentially leading to changes in the national rules around contraception, marriage, and private sexual activity.",
    "The Middle Class is Mad\nThe Ukraine Food Price Crisis is Just a Preview of What Could Happen as Climate Change Worsens\nThe U.S. Is in a 'Controlled Pandemic' Phase of COVID-19.",
    "The first test case may be playing out in real time in Ohio, where Republicans face a fierce primary contest on Tuesday to decide the nominee in a race to follow retiring Sen.",
    "Admittedly, both parties were bracing for a potentially seismic shift in the election season whenever the courts ruling on the Mississippi abortion law came down this summer.",
    "The states powerful Ohio Right to Life lined-up with Vance but also offered praise for the other three candidates who each scored a 100% rating on the groups scorecard.",
    "By a roughly 2-to-1 margin, Americans want to see Roe upheld, according to an ABC News-Washington Post poll last week, and a majority broadly support abortion rights.",
    "Roughly seven in 10 Americans say the decision should be made by the pregnant person and doctors, with only one in four saying the law should regulate that decision.",
    "John Kasichs veto of a bill that could have banned abortion as early as eight weeks  may play a stronger-than-expected role in the Republican primarys final hours.",
    "Chief Justice John Roberts on Tuesday confirmed the authenticity of the draft, a move that spoke volumes to just how much the leak has rocked Washington.",
    "Column: Elon Musk and the Tech Bro Obsession With 'Free Speech'\nThe Best (and Most Outrageous) Fashion Moments From the 2022 Met Gala\nSHARE THIS STORY",
    "And in the suburbs, where the margins for party control often lie, many voters could be alienated by such a raw return to the culture wars.",
    "Focus groups for years have consistently told pollsters that abortion is an animating factor for a relatively small sliver of both parties.",
    "But a full-blown reversal of a federal protection for abortion rights may be a swing too far for some and provoke a reactionary spasm.",
    "Republicans, meanwhile, looked to balance their latent glee with the risks of contending with a newly animated Democratic opposition.",
    "Even then, Democratic Sen. Joe Manchin has been open about his opposition to abortion and could still drag his party on the topic.",
    "Bombshell is a word that gets thrown around Washington a lot, but the report published Monday evening by Politico merits its use.",
    "A federal judge struck part of that law down and abortion is now legal in Ohio up until roughly the 20th week of pregnancy.)",
    "Its not as if voters are just now discovering the medical and ethical issues embedded in the conversation around abortion.",
    "(Kasich, however, signed a law that banned most abortions as early as 12 weeks and had no exception for rape or incest.",
    "Their outrage machine rightly kicked into overdrive and fundraising emails flooded the inboxes of activists and donors.",
    "Almost $70 million has been spent on ads in the GOP primary alone, making it the most expensive race so far this year.",
    "The intensity gap is one that has allowed both parties to offer up predictable rhetoric without any real consequences.",
    "But among the biggest bloc of voters  the 40% who identify as independents  53% say Roe should be left in place.",
    "An overturned Roe could energize abortion foes, who have been clamoring for this moment since the 1970s.",
    "Vote Now\nWhat to Know About the Leaked Roe v. Wade Supreme Court Draft Opinion\nThe Economy is Great.",
    "Vance and seemed to deflate the hopes of rivals Josh Mandel, Mike Gibbons, and Jane Timken.",
    "Democrats immediately rushed to cast Republicans as the party of anti-abortion extremists.",
    "Former President Donald Trumps endorsement buoyed support for author and investor J.D.",
    "Which is why even local and state parties should note the teed-up Supreme Court draft.",
    "That is, all of that would happen if the ruling is where the court is actually headed.",
    "The Supreme Court has traditionally finished its docket by late June or early July.",
    "Dolans relative moderation on abortion rights  he sided with Republican Gov.",
    "More Must-Read Stories From TIME\nWho Should Be on the 2022 TIME100?",
    "But Politicos leak shocked many into action earlier than expected.",
    "This article is part of The D.C. Brief, TIMEs politics newsletter.",
    "But he added that it did not represent the courts final decision.",
    "The debate, meanwhile, would not simply end in Washington.",
    "Sign up here to get stories like this sent to your inbox.",
    "Rob Portman, a member of the Republican establishment.",
    "It could turn the nations politics into chaos.",
    "Make sense of what matters in Washington.",
    "Sign up for the D.C. Brief newsletter.",
    "But What Does That Mean?"
  ]
}