{
  "id": 5927,
  "mediaId": 163,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Factbox: Four races to watch in Ohio's primaries for U.S. Congress, governor",
  "image": "https://www.reuters.com/resizer/eupXpZn3u05XGJCICyoECtySbH8=/1200x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/47A43Q4HGFKZDERYUJO3CFR3AI.jpg",
  "link": "https://www.reuters.com/world/us/four-races-watch-ohios-primaries-us-congress-governor-2022-05-03/",
  "sentiment": "0",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reuters",
  "authorUrl": "https://www.reuters.com/authors/reuters/",
  "termIds": [
    3103
  ],
  "sentences": [
    "May 3 (Reuters) - The Republican-leaning states of Ohio and Indiana hold nominating primaries on Tuesday where voters will pick their parties' candidates for the U.S. Congress and other offices, helping to shape the field for the Nov. 8 midterm elections.",
    "DEMOCRATIC DUEL: BROWN V. TURNER\nThe Democratic primary in the state's Cleveland-based 11th congressional district features a rematch between incumbent Representative Shontel Brown and progressive Nina Turner, who lost in a special election last year.",
    "VANCE V. JOSH MANDEL\nThis contest to succeed retiring Republican Senator Rob Portman is shaping up as a high-profile test of former President Donald Trump's ability to shape the Republican field to his liking as he ponders another White House bid.",
    "Other candidates include: Jane Timken, a former chair of the state Republican Party; banker Mike Gibbons, and Matt Dolan, a wealthy state senator who is the only candidate to acknowledge that Biden was elected legitimately.",
    "GOVERNOR MIKE DEWINE FACES CHALLENGERS\nIncumbent Republican Governor Mike DeWine faces two challengers: former Rep. Jim Renacci, who fell short in a U.S. Senate bid in 2018, and farmer Joe Blystone.",
    "TIM RYAN'S SENATE BID\nU.S. Representative Tim Ryan is considered the favorite to win the Democratic endorsement over Morgan Harper, a progressive attorney and tech executive Traci Johnson.",
    "The winner of this contest will likely face an uphill fight against the Republican nominee in a state that has drifted steadily to the right over the past decade.",
    "That race was seen as a proxy battle between the Democratic Party's progressive wing, which backed Turner, and establishment figures, which lined up behind Brown.",
    "Vance's most prominent rival is Josh Mandel, an ex-U.S. Marine and former state treasurer, who had been considered the front-runner prior to Trump's endorsement.",
    "Ryan has represented the Youngstown area in Congress since 2002, carving out a reputation as a centrist on social issues and a liberal on economic issues.",
    "Ohio Republicans have argued that Vance's past criticism of Trump could hurt the party's chances of holding the seat in November.",
    "Vance, the \"Hillbilly Elegy\" author and venture capitalist, a newcomer to politics who had been trailing other candidates.",
    "If DeWine wins the primary as expected, he is favored to win re-election in the fall.",
    "Like Vance, Mandel has endorsed Trump's false claims of election fraud.",
    "The victor of this primary will be heavily favored to win in November.",
    "read more\nTrump upended the crowded race when he endorsed J.D.",
    "Here are four contests to watch in Ohio:\nJ.D."
  ]
}