{
  "id": 5931,
  "mediaId": 65,
  "date": "d2022-05-03T09:51",
  "headline": "Ohio GOP Senate race: Voters weigh Trump support for Vance against 2016 comments critical of former president",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/20e69c5b-6b0d-43f6-aac6-514222c0993c/0208d0eb-3b8e-4b1a-8dfc-e82d6aa6ccfb/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/vance-trump-endorsement-ohio-gop-voters",
  "sentiment": "0.382",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    946,
    1053,
    1147,
    1801,
    3103,
    379,
    428,
    571,
    2609,
    2845
  ],
  "sentences": [
    "OHIO GOP SENATE PRIMARY WIDE OPEN AS VOTERS WAIT UNTIL LAST MOMENT TO DECIDE AFTER BRUISING RACE\nBut Ohio GOP voters, who have a menu of five major Republican candidates for their Senate primary  four of whom fought hard for Trump's support  are split on whether they believe Vance's change of heart.",
    "HOUSE FIREBRANDS GAETZ, GREEN SAY VANCE IS THE SENATE ALLY THEY NEED IN ROWDY CAMPAIGN STOP\nBut Vance supporter Julie Goletz said at a Saturday rally for Vance that meeting him speak in person convinced her to go with Trump's choice in the primary.",
    "\"Vance, I just don't like how he was a Judas,\" Claudia Jewett, an undecided voter, told Fox News at a rally for former state Treasurer Josh Mandel, another GOP candidate who sought Trump's support.",
    "WITH CRUZ BACKING, MANDEL BRUSHES OFF RINO ATTACKS AFTER BOOK ALLEGES DISHONESTY\n\"I needed to hear his thinking, his thought, as to why he switched,\" Vance supporter Patty Parker said.",
    "The candidate also touts endorsements not only from Trump himself, but also from Donald Trump Jr., Reps. Marjorie Taylor Greene, R-Ga., and Matt Gaetz, R-Fla., and others.",
    "DOLAN SURGES LATE IN OHIO GOP SENATE PRIMARY, SAYS VOTERS LEAVING SOME OTHER CANDIDATES TO BACK HIS CAMPAIGN'\n\"I was real disappointed to be quite honest, because J.D.",
    "CINCINNATI, Ohio  The result of Ohio's Republican Senate primary Tuesday could hinge on whether supporters of former President Donald Trump believe GOP candidate J.D.",
    "In addition to Mandel and Gibbons, Vance is competing with former Ohio GOP Chair Jane Timken and state Sen. Matt Dolan to make it onto the November ballot.",
    "GIBBONS TOUTS BUS TOUR THROUGH 88 OHIO COUNTIES IN GOP SENATE PRIMARY, AS HE ATTACKS VANCE'S MAGA CREDENTIALS\n\"I just think you have to tell the truth.",
    "Vance has said about him,\" Shelley Pryka, who's undecided, told Fox News at an Ottawa County Republican Women's Club event in Port Clinton.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,\" Trump said.",
    "Vance never promoted Trump, so I don't know what happened there,\" Mike Gibbons supporter Sis Bush said the same event.",
    "(AP Photo/Joe Maiorana, File)\n\"You hear the campaign of the other guy saying that he didn't like Trump,\" she said.",
    "The former president endorsed Vance, a former venture capitalist and the author of \"Hillbilly Elegy,\" last month.",
    "The winner of the GOP primary will likely face Rep. Tim Ryan, D-Ohio, the Democratic front-runner, in November.",
    "\"But he saw the man, President Trump, and could be, what he stood for and how great he did for our country.\"",
    "A lot of people change their mind on Donald Trump, and I'm one of them,\" Vance told Fox News on Saturday.",
    "\"He admitted to saying some of the things that was said on TV,\" Vickie Boychan, a Vance supporter, said.",
    "But some voters are still suspicious that Vance is simply behaving like another politician.",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "Vance honestly changed his mind about Trump after being highly critical of him in 2016.",
    "\"I think that was a mistake,\" Mandel supporter Bob Eggers said at the same rally.",
    "\"It's good to hear that he said, Well, that was true, but its not true anymore.'\"",
    "Vance on the campaign trail is forward about his past comments about Trump.",
    "But sometimes I'm afraid that they say that so that you'll vote for them.\"",
    "\"A lot of our voters don't mind so long as you're just honest with them.\"",
    "\"He is our best chance for victory in what could be a very tough race.\"",
    "He acknowledges them and says he's genuinely reconsidered his stance.",
    "\"I was a little confused because I mean I've seen all the things J.D.",
    "\"He said, well, he's changed his mind and liked what Trump did.",
    "\"I was very disappointed in Trump, and I am a Trumpster, okay.",
    "But then, he doesn't always get it right either, does he?\"",
    "Tyler Olson covers politics for Fox News Digital.",
    "\"He admitted to it and was sorry for it.",
    "\"But you know what, no one's perfect.",
    "And that's all well and good.",
    "I'll still vote for Trump.\"",
    "Trump himself thinks so.",
    "\"Like some others, J.D.",
    "That was enough.\"",
    "Right?"
  ]
}