{
  "id": 5933,
  "mediaId": 195,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Busy month of primaries to set stage for midterms",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/indianamayvoting_050222_ap-Michael-Conroy_may-preview.jpeg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3474049-busy-month-of-primaries-to-set-stage-for-midterms/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reid Wilson",
  "authorUrl": "https://thehill.com/author/reid-wilson/",
  "termIds": [
    815,
    3102,
    3103
  ],
  "sentences": [
    "Together, those contests represent the first large-scale opportunities to chart a direction for a Democratic Party mired in the doldrums of weak poll numbers and electoral challenges, and the first chance to test former President Donald Trumps hold on a Republican Party finding its way back to power after losing the House, the Senate and the White House.",
    "To the extent that these kinds of competitive primaries are energizing and force candidates to build infrastructure early in the cycle, they can be a positive.?\nNone of those races have been more expensive than U.S. Senate elections in Ohio, which votes on Tuesday, and Pennsylvania, where voters go to the polls May 17.",
    "Voters in about a quarter of the country will nominate candidates running in critical races in the next month as primary election season kicks into high gear, setting the stage for midterm elections in which Democrats are defending narrow majorities and both parties are fighting over governors mansions in key states.",
    "Contentious Republican primaries in North Carolina on May 17, and Alabama and Arkansas on May 24 will conclude this month, while Republican incumbents in Indiana on Tuesday, Idaho and Kentucky and a Democratic incumbent in Oregon, all of which hold May 17 contests, appear set to cruise to renomination.",
    "Pennsylvania Republicans will have to wade through a massive field of contenders, apparently led by state Sen. Doug Mastriano (R), an election denialist who was in Washington during the Jan. 6 insurrection, and former Rep. Lou Barletta (R).",
    "The 13 states that will hold primary elections or nominating conventions will collectively choose candidates running for ten seats in the United States Senate, 107 seats in the House of Representatives and nine governorships this month.",
    "In Nebraska, Trump appeared Sunday at a rally for businessman Charles Herbster (R), who is running for governor and who has been credibly accused of sexual harassment by several women; he denies the charges.",
    "Campaign fundamentals still matter, even with candidates who represent diverse segments of the Republican primary electorate.?\nElsewhere, Trumps endorsement has pitted him against his own allies.",
    "This month will also feature the first round of U.S. House races featuring incumbents drawn into the same districts after the decennial reapportionment and redistricting process.",
    "Were all heading in the same general direction, even if we dont necessarily agree on the best way to get there,? said Mark Nevins, a Philadelphia-area Democratic strategist.",
    "Vance (R) pulling ahead, along with state Sen. Matt Dolan (R), though investment banker Mike Gibbons (R) and former state Treasurer Josh Mandel (R) are still in the running.",
    "In Pennsylvania, hedge fund manager Dave McCormack (R) and celebrity doctor Mehmet Oz (R) appear to lead the GOP field; in Ohio, late polling shows author and investor J.D.",
    "Former state House Speaker Tina Kotek (D) and state Treasurer Tobias Read (D) lead the Democratic field in a state that hasnt elected a Republican governor since 1982.",
    "They will also offer an early preview of the preparations each side has made ahead of a midterm election, when turnout typically lags that of a presidential contest.",
    "In both cases, Republicans running to replace retiring members of their own party are vying for bare pluralities that would secure them a spot on Novembers ballot.",
    "Former President Donald Trump has sought to maintain his influence on the Republican Party by issuing endorsements in many of those contests, with mixed results.",
    "Mooney has Trumps support, but McKinley over the weekend rolled out a new advertisement featuring the states most popular politician, Sen. Joe Manchin (D).",
    "He has backed Oz in Pennsylvania and Vance in Ohio, though he rescinded an endorsement of Rep. Mo Brooks (R) in Alabama after Brookss campaign flagged.",
    "There is plenty of room in the tent for lots of different ideas, candidates and approaches,? said Brent Buchanan, an Alabama-based Republican pollster.",
    "On May 24, Georgia voters are likely to make formal a fall matchup between Sen. Raphael Warnock (D) and former NFL running back Herschel Walker (R).",
    "Sarah Huckabee Sanders (R), Trumps second press secretary, appears poised to skate to the Republican nomination in her home state of Arkansas.",
    "In Georgia, Republicans redrew a suburban Atlanta district that now includes both Reps. Carolyn Bourdeaux (D) and Lucy McBath (D).",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Tom Wolf (D) in a state where the party in power rarely keeps the governors mansion between successive administrations.",
    "John Fetterman (D) is running ahead of Rep. Conor Lamb (D) in the race to replace retiring Sen. Pat Toomey (R).",
    "Brad Little (R) all look set to win renomination in the face of challenges from more conservative candidates.",
    "Voters in Oregon, Pennsylvania and Arkansas will also nominate candidates to replace retiring governors.",
    "Trump appears likelier to get his way in North Carolina, where he backed Rep. Ted Budd (R) over ex-Gov.",
    "In both states, wealthy candidates have poured tens of millions of dollars into early airtime already.",
    "In West Virginia, the remaps will pit Reps. Alex Mooney (R) and David McKinley (R) against each other.",
    "Oregon voters will choose between a record number of candidates running to replace term-limited Gov.",
    "Attorney General Josh Shapiro (D) is the lone Democrat in the race to replace term-limited Gov.",
    "As a party, were energized even if were squabbling a bit about which candidate we like best.",
    "State Senate President Jake Corman (R) and former Rep. Melissa Hart (R) are also running.",
    "Democrats in Ohio appear set to choose Rep. Tim Ryan (D) as their partys nominee.",
    "Pete Ricketts (R) backs Jim Pillen (R), a former University of Nebraska regent.",
    "They face state Rep. Donna McLeod (D) in the race for a safely Democratic seat.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Pat McCrory; Budd leads McCrory in recent polls.",
    "Mike DeWine (R) and Idaho Gov.",
    "Kay Ivey (R), Ohio Gov.",
    "Pennsylvania Lt. Gov.",
    "Kate Brown (D).",
    "Alabama Gov.",
    "Gov."
  ]
}