{
  "id": 5940,
  "mediaId": 124,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "How J.D. Vance has written Appalachians like me out of his Ohio Senate campaign",
  "image": "https://iframe.nbcnews.com/sxLWhCq/thumbnail",
  "link": "https://www.nbcnews.com/think/opinion/jd-vance-written-appalachians-ohio-senate-campaign-rcna26933",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1801,
    3103,
    4245,
    4363,
    380,
    571,
    2709,
    2738,
    2845
  ],
  "sentences": [
    "Vance campaign for the Republican nomination in Ohios Senate race ahead of Tuesdays primaries, reading his book Hillbilly Elegy? or watching the memoirs Netflix adaptation, you might not think it was possible for someone like me to exist  someone who was born and raised in the hills of West Virginia as the daughter of Indian immigrant parents, who is queer and who deeply identifies as Appalachian.",
    "And outside Ohio  in every one of the other 12 states that make up Appalachia  we cant give a platform to leaders who use xenophobia and fear-mongering in order to get elected, or line their pockets with money from Big Tech, or prioritize conservative legislation inspired by the American Legislative Exchange Council over lawmaking grounded in the very clear needs of the people who elected them.",
    "Ohio has 32 counties that are part of Appalachia, but Vance is certainly not courting the vote of anyone like me with his Are you a racist?? campaign ad, in which he first mocks people who take issue with the bigotry directed at Mexican immigrants by many Republicans, then goes on to tout Donald Trumps border wall as the solution to Ohios problems.",
    "My Appalachia has always been home to Black folks: Prominent educator and leader Booker T. Washington was raised less than 20 minutes from where I grew up, author and scholar bell hooks took her first and last breaths in Kentucky, and NASA research mathematician Katherine Johnson went to college at the same place where my mom later got her degree.",
    "I urge Appalachians in Ohio to truly think about whether the narrative offered by Trump and Vance aligns with the values of community and acceptance that allowed my immigrant family to make a home in Appalachia, and to consider how their votes can help move the region forward in a way that does not reject those values.",
    "He has painted the region as one rife with stereotypes: of people struggling with joblessness, poverty and addiction; of people whose downfall is their fault, or the fault of the immigrants who take their jobs, but certainly not the responsibility of the corporations or politicians who have abandoned them.",
    "People in Appalachia deserve so much more than they are getting from a mainstream narrative that reduces them to stereotypes, politicians who prioritize grandstanding over good governance and corporations that take their resources and leave them with poisoned air and water.",
    "They want the world to see them more clearly: to understand that Appalachia is populated with people who are white and people of color, people who identify as straight and queer and trans, people who locate themselves as right and center and left on the political spectrum.",
    "Reducing people to stereotypes, pushing them further and further away from one another, is how Trump was elected president in 2016, when Hillbilly Elegy? was a bestseller and frequently referenced as one of the books to read to help understand the election results.",
    "We need to seek out different stories, challenge dominant narratives and acknowledge how the exploitation of Appalachian natural resources and Appalachian people has been used to make a tremendous profit for the wealthy elite.",
    "My father worked for Union Carbide, and our family was supported by close to 100 other Indian families who lived in the region, as well as hundreds of white and Black West Virginians who embraced us as friends and neighbors.",
    "I urge Appalachians in Ohio to truly think about whether the narrative offered by Trump and Vance aligns with the values of community and acceptance that allowed my immigrant family to make a home in Appalachia.",
    "People in Appalachia have known ever since 2016, when Hillbilly Elegy? was published, that Vance will say what he needs to say in order to advance his own agenda, no matter who suffers as a result.",
    "Because the people of Appalachia overwhelmingly voted for Trump in the 2020 election, you might conclude that my assessment is false or that I no longer understand the place where I grew up.",
    "My Appalachia was home to the Battle of Blair Mountain, the nations largest labor uprising, in which Black and white miners joined forces to improve working conditions in the mines.",
    "Humiliating: See Trump candidate demolished by his own words on TV\nApril 28, 202210:56\nBut we live in a time when nuance doesnt get people elected; playing on polarization does.",
    "Please let us know what you THINK by submitting a letter to the editor\nNBC Newsnbcnews.com/Jul 17, 2019\nThat said, countering all of this cant just come from within Appalachia.",
    "Ultimately, I believe that what people want even more than simplistic explanations are leaders who seek to understand, and concretely respond to, their lived struggles.",
    "Now, Vance has used his celebrity to make a bid to be a politician in Trumps mold  and the former president rewarded him for his efforts with an endorsement.",
    "And when I was growing up in the 80s and 90s, Indian, Filipino and Chinese immigrants came to work in the chemical industry and health care professions.",
    "To know that Appalachians whose families have lived in the region for 10 generations live alongside Appalachians who only arrived a generation ago.",
    "Subscribe to the THINK newsletter\nReTHINK the news cycle with timely op-eds, in-depth analyses and personal essays delivered weekly to your inbox.",
    "Politicians like Trump and Vance offer a narrative to make sense of the decline, but it is one grounded in exclusion and hatred.",
    "My Appalachia is home to gay folks and trans folks, to people who are Jewish, Hindu, Muslim, Zoroastrian, agnostic and atheist.",
    "The people I spoke with in Appalachia are exhausted by the narrow vision of their community that Vance offers to the world.",
    "And I understand that people in the region are grasping for a narrative to make sense of the why behind that decline.",
    "Vances rendering of Appalachia  a region that includes 13 states and 423 counties  does not include people like me.",
    "As one of my uncles put it at dinner on the night I read in Charleston, West Virginia, Vance is an opportunist.",
    "First, the Welsh and the Scots Irish; later Hungarian, Polish, Italian, Lebanese and Syrian folks.",
    "To see this part of the country, like every other part of the country, is complex and deserving.",
    "Politicians are not going to abandon their strategy of polarization unless we demand it of them.",
    "I am not confused about the fact that Appalachia has experienced an intense economic decline.",
    "I visited with friends and family, none of whom were surprised by Trumps endorsement.",
    "Recently on my book tour, I drove through Appalachia for the first time since 2019.",
    "It has to come from all of us  those within the region and those outside of it.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "Thats how my parents ended up in the Kanawha Valley in the early 1970s.",
    "My Appalachia has been home to immigrants from all over the world.",
    "It is human nature to seek an explanation when we are grieving.",
    "If your understanding of Appalachia is rooted in watching J.D.",
    "That is not the Appalachia I know or the one I grew up in.",
    "It deserves leaders who reject stereotypes.",
    "Please submit a letter to the editor.",
    "Its effects are impossible to ignore.",
    "QUICK VOTE35 VOTES\nDo you think J.D.",
    "My Appalachia defies stereotypes.",
    "We want to hear what you THINK.",
    "My Appalachia is complicated.",
    "Vance will win in Ohio?",
    "Yes, definitely.",
    "No, not at all.",
    "It is nuanced.",
    "It is messy."
  ]
}