{
  "id": 5945,
  "mediaId": 2526,
  "date": "2022-04-09",
  "headline": "Pinkerton: David vs. Goliath – Five Takeaways from the Amazon Workers’ Victory Over Union-Busting Billionaire Bezos",
  "image": "https://media.breitbart.com/media/2022/04/bezos-union-amazon-workers-getty-640x335.jpg",
  "link": "https://www.breitbart.com/economy/2022/04/09/pinkerton-david-vs-goliath-five-takeaways-from-the-amazon-workers-victory-over-union-busting-billionaire-bezos/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James P. Pinkerton",
  "authorUrl": "https://www.breitbart.com/author/james-p-pinkerton/",
  "termIds": [
    0
  ],
  "sentences": [
    "Here’s the redoubtable Smalls on the poseur AOC: “Hell no, she don’t deserve this moment!”\n\"Hell No, she don't deserve this moment,\" @Shut_downAmazon responds to whether he has a message for AOC who workers told @statuscoup flaked on them and wouldn't show support for their union drive pic.twitter.com/W6RtkGbA6G\n— Status Coup News (@StatusCoup) April 1, 2022\nFor their part, Republicans are still thinking through the proper role of labor, including organized labor.",
    "Regarding another union election in Bessemer, Alabama, last year — which Amazon won — the head of the union effort decried “Amazon’s intimidation and interference [which] prevented workers from having a fair say in whether they wanted a union in their workplace.” And the feds agreed, and so the election was rerun, with Uncle Sam more closely overseeing.",
    "According to two fair-minded academics, Matt Grossman and David Hopkins, “Today’s liberal activists are both more comfortable working within ‘establishment’ networks and more likely to prioritize cultural over economic objectives.” So sure, hire white-collar diversitarians, and they’ll provide cover while a company outsources its production.",
    "“What he was not doing is sending a message that he or the U.S. government would be,” she insisted, “directly involved in any of these efforts.”\nDid we mention that Amazon has many powerful lobbyists and influencers on its payroll, including Jay Carney, who a decade ago was Vice President Biden’s communications director?",
    "The AFL-CIO exultantly highlighted Biden’s comments, and the Washington Post added the headline, “President Biden appears to back broadening union push at Amazon.”\nThe Post’s coverage is especially interesting to watch because the newspaper is, of course, owned by Jeff Bezos, the billionaire founder of Amazon.",
    "— Christian Smalls (@Shut_downAmazon) April 1, 2022\nAs Smalls explained in an interview with Breitbart News in May 2020, Amazon fired him from his job as a supervisor at the Staten Island warehouse after he blew the whistle on unsafe working conditions and organized a walkout of his fellow workers in protest.",
    "Reacting to the mismatch between giant Amazon and the upstart Amazon Labor Union (ALU), John Logan, a professor of labor studies at San Francisco State University, exclaimed, “This is an astounding result.” He added, “With ALU, it also does seem to turn all of the conventional organizing wisdom on its head.",
    "In fact, Amazon was awarded a $10 billion contract last summer, months after the president promised on the campaign trail to “ensure federal contracts only go to employers who sign neutrality agreements committing not to run anti-union campaigns.”\nSo maybe Biden was ad-libbing before that labor audience.",
    "On April 6, speaking before the North American Building Trades Unions in Washington, D.C., the president stated his labor credentials and added, “By the way, Amazon, here we come.” To listen to the roar of the crowd is to be reminded that the labor movement was once a true movement and could be again.",
    "Yes, from a rhetorical point of view, Bill Clinton and Barack Obama claimed to be friends of unionism, but in terms of actual policy — from Clinton’s support of the North American Free Trade Agreement and the opening to China to Obama’s support for Big Tech gig-work platforms—they were foes.",
    "And that explains why, for example, Smalls dismissed the role of Rep. Alexandria Ocasio-Cortez (D-NY) — who represents many Amazon blue collars, even as she herself is cruising the country touting hipper causes than higher wages — when she tried to share credit for the Amazon union victory.",
    "(ANDREA RENAULT/AFP via Getty Images)\nAccording to the New York Times, in response to Smalls’ initial organizing effort two years ago:\nAmazon formed a reaction team involving 10 departments, including its Global Intelligence Program, a security group staffed by many military veterans.",
    "To put this new relationship another way, big business is happy to fund, and perhaps even lead, whatever trendy cultural cause comes along, and it asks only one not-so-small thing in return: Democrats de-emphasize, or even abandon, their traditional class-based politics.",
    "Vance, running for the Republican nomination for the U.S. Senate from Ohio, saying that the old GOP model had, in its decadent late stage, led to many ills, including “the rise of China” and “the decimation of the American family.”\nOhio Republican Senate candidate J.D.",
    "As Chris Smalls said, “We want to thank Jeff Bezos for going to space because while he was up there we were organizing a union.” (The fact that Bezos is no longer the CEO of the company means little; for as long as he’s alive, he’ll likely be the face of the company.)",
    "For its part, the Post is substantially unionized, and the author of the article cheekily described the Staten Island victory over Amazon management as “stunning.”\nYet it is also possible that Biden’s pro-union comment was just another one of his random ad libs.",
    "This is a familiar enough point to Breitbart News readers, and yet now the Mainstream Media are catching on; hence this April 4 headline in Bloomberg News: “Big Business and Conservatives Are Headed for Divorce.” The piece quoted Marine-turned-author J.D.",
    "Joe Biden’s appointees to the National Labor Relations Board (NLRB, the body that oversees union elections) have been notably determined in their support of unionization, and that helped the Amazon vote and will surely help on future union votes.",
    "Indeed, on April 7, a pro-labor website, The Lever, accused the Biden administration of pulling its punches on Amazon:\nBiden has also declined to use his executive authority to halt federal contracts to Amazon amid its union-busting campaign.",
    "And as for the role that unions play in capturing higher wages, it’s not a complicated point: Employees in labor unions have greater bargaining power relative to their employers, and so they typically get paid more and get treated better.",
    "This was the argument made by, for example, Franklin D. Roosevelt, who took America to the apex of its global power in 1945, as we won World War II: a strong workforce and factories translates into a strong military and a strong country.",
    "Meanwhile, the think-tank American Compass has published an e-book, A Seat at the Table: A Conservative Future for the American Labor Movement, in which 10 right-of-center authors make the case for including workers in organized labor.",
    "According to the St. Louis Federal Reserve, the share of the gross domestic product (GDP) absorbed by compensation to labor has fallen in the past half-century, from a high of almost 65 percent in 1970 to less than 60 percent today.",
    "(Although a key to the success of unions as bargainers are America First trade and immigration policies, so that the company can’t be flooded with cheap imports or cheap workers, and/or can’t simply pack up and move overseas.)",
    "It also works as a key pressure point to force the enemy into concessions.”\nJeff Bezos laughs as he speaks about his flight on Blue Origin’s New Shepard into space during a press conference on July 20, 2021 in Van Horn, Texas.",
    "[emphasis added]\nGoliath-Amazon made the problem worse for itself by clumsily smearing Smalls as “not smart, or articulate,” and expressing the hope that Smalls would become “the face” of the organizing movement.",
    "And while this has meant that many corporations have lurched to the left on cultural issues, it has meant that many Democrats have been pulled to the right on economic issues, in keeping with corporate wishes.",
    "As an aside, there’s much to be said for the gig-work model, in terms of flexibility and opportunity, and yet at the same time, there’s a lot to be said for making sure that everyone can earn a fair wage.",
    "Such companies include Uber, Lyft, DoorDash, Postmates, and Fiverr; collectively all gig-working outfits, they engage an astonishing 59 million Americans, more than a third of the national workforce.",
    "After all, it’s only workers with some surplus who have the time and resources to pay attention to what’s happening in their kids’ schools — and to show up at school board meetings and raise hell.",
    "The company named an “incident commander” and relied on a “Protest Response Playbook” and “Labor Activity Playbook” to ward off “business disruptions,” according to newly released court documents.",
    "One person who put this into practice was Saul Alinsky, the left-wing activist from the 20th century (who should be studied today by the right, as we take on, for example, Critical Race Theory).",
    "For instance, Donald Trump won the election in 2016 largely on the basis of trade and immigration concerns, in which Trump championed the interests of workers much better than did union chiefs.",
    "(Joe Raedle/Getty Images)\nSo back to Bezos, the woke libertarian tycoon now spending his time hanging out with his post-marriage girlfriend and flying around in his Blue Origin space capsule.",
    "“We want to thank Jeff Bezos for going to space because while he was up there we were organizing a union” pic.twitter.com/V6WGjQJ7Id\n— Lauren Kaori Gurley (@LaurenKGurley) April 1, 2022\n4.",
    "And the ploy has succeeded: Woke corporate bosses work smoothly with woke corporate employees and allies — mostly at the white-collar level — to advance, for example, Critical Race Theory.",
    "And that’s actually a new development because, while the Democratic Party has historically been the party of organized labor, the previous two Democratic presidents were rather anti-labor.",
    "One needn’t be any kind of redistributionist or socialist to see that something is out of kilter here — and things that are out of kilter often adjust back to their more familiar norm.",
    "Indeed, the Wall Street Journal reports that Amazon plans to appeal the pro-union result — and Amazon can afford to hire the best lawyers, as well as Grade-A lobbyists and schmoozers.",
    "In fact, if one thinks about other “tech companies,” we realize that while, yes, they boast plenty of high tech, at the same time, they depend on old-fashioned low-paid gig labor.",
    "They did it without a huge union or experienced organizers.”\nChristian Smalls, aged 33, the driving force behind the Amazon Labor Union, is the the latest Young Man with a Sling.",
    "Union organizer Christian Smalls (left) celebrates with Amazon workers following the April 1, 2022, vote for the unionization of the Amazon Staten Island warehouse in New York.",
    "And yet, now that the Democrats have alienated so many workers on cultural issues, the GOP is stepping forward to represent them better, including on economic issues.",
    "For all its high tech, in crucial ways, Amazon doesn’t look that different from a mass-employer of the past, and they were unionized too, albeit not without a fight.",
    "It is a simple fact, according to 2020 data from the Bureau of Labor Statistics, that unionized workers were paid about 19 percent more than non-unionized workers.",
    "As we have seen, the Democrats were the historic home of organized labor, even if Republicans usually held their share of working people, including blue collars.",
    "It cost me my career, but I have no regrets.”\nIn response to Smalls’ grassroots union organizing, Goliath-Amazon used every union-busting tactic in the book.",
    "These men and women work out of 305 U.S. “fulfillment centers” (that’s spun-up corporate-speak for “warehouse”) and more than 1,100 distribution centers.",
    "Despite all the union-busting odds stacked against them, they voted to unionize — thus creating the e-commerce giant’s first union in the United States.",
    "A fall of five percentage points (from 65 to 60) might not seem that much, but measured against a GDP of $21 trillion, that’s about a trillion dollars.",
    "The drama of Amazon (total market capitalization $1.6 trillion) vs. its own workers (median employee salary $29,000) will be irresistible to onlookers.",
    "Yet, still, union activism is on the rise, and so, as we wait to see what comes next out of the president’s mouth, here are five things to watch:\n1.",
    "In fact, Amazon’s heavy-handed tactics against unions have brought not only criticism from organizers but also official chastisement from the NLRB.",
    "Union organizer Christian Smalls (left) holds up the results of the Amazon workers unionization vote in Staten Island, New York, on April 1, 2022.",
    "In fact, according to the same St. Louis Fed, corporate profits have been hitting record highs — up about a trillion dollars in the last decade.",
    "For companies, it’s a lot cheaper to hire a few flashy diversity “experts” than it is to pay higher wages to the people who do the actual work.",
    "In the end, there were more executives — including 11 vice presidents — who were alerted about the protest than workers who attended it.",
    "To put that another way, a trillion dollars went from the paychecks of workers to, well, a lot of places, including corporate profits.",
    "So that should be our goal today: a strong workforce, making things — including all the energy we need — right here in the USA.",
    "Bezos’ e-commerce colossus retains a fervently anti-union stance (with the help of, interestingly enough, many Democrats).",
    "So now today, Amazon has an estimated 1.6 million employees, as well as an unknown number of gig-workers and contractors.",
    "As this author has argued, unions have a place in building up the middle class, making it a bulwark against wokeism.",
    "Fortunately, FDR-type Democrats never worried about political correctness, and today, Republicans shouldn’t either.",
    "By historical standards, American wages have been low, and profits have been high—and so a recalibration is likely.",
    "That is, from a political point of view, it’s better to have the fat cats on the other side — advantage, underdogs.",
    "For its part, the Biden administration seems to have been cautiously supportive of the Amazon unionization effort.",
    "As a result, during those two Democratic presidencies, private-sector union membership continued its long decline.",
    "Back on December 30, 1936, some 7,000 General Motors workers staged a sit-down strike at the Fisher Body Plant No.",
    "As has been noted here at Breitbart News, the rich have, more often than not in U.S. history, been great targets.",
    "As Smalls tweeted on April 1, “@amazon wanted to make me the face of the whole unionizing efforts against them….",
    "Indeed, within hours of Biden’s mention of Amazon, White House Press Secretary Jen Psaki was — you guessed it!",
    "“I was a loyal, dedicated employee — nothing more than just a father of three with a retirement date of 2053.",
    "You know, like his past throwaways about Corn Pop, or dog-faced pony soldiers, or regime change in Russia.",
    "1 in Flint, Michigan — and were soon joined by more than 100,000 more GM workers, spread across 17 plants.",
    "In any case, nationwide, in places that are friendlier to unions than Alabama, the fight will continue.",
    "welp there you go!”\n@amazon wanted to make me the face of the whole unionizing efforts against them….",
    "Such a vision is an obvious political winner, even if it is now deemed to be politically incorrect.",
    "(ANDREA RENAULT/AFP via Getty Images)\nAnd Biden himself likes to talk the talk on being pro-union.",
    "Yet inevitably, workers will notice who truly walks with them and who only talks a good game.",
    "(AP Photo/Jeff Dean, File)\nIn the meantime, many Democrats, as we know, have gone woke.",
    "But when they dropped the ball on our health and safety, I put my career on the line.",
    "And, while it appears that Amazon won again, the final tally is still in dispute.",
    "At the same time, the GOP’s relationship with business has hit a rough patch.",
    "Because the party that best speaks for the working majority will never lose.",
    "One can foresee many flashpoints and epic struggles all across the nation.",
    "On April 1, 2022, Amazon workers in Staten Island, New York, made history.",
    "#ALU # ALUfortheWin welcome the 1st union in America for Amazon ????????",
    "Yet it is possible that some Democrats are changing their minds again.",
    "The answer is as clear as the thoughts in the 46th president’s head.",
    "More recently, Sen. Marco Rubio (R-FL) has endorsed Amazon unionism.",
    "“I’d been with the company since 2015,” Smalls told Breitbart News.",
    "It took two months, but the GM workers won; they had their union.",
    "Alinsky always counseled, “Ridicule is man’s most potent weapon.",
    "Or, the labor-union version of Biden’s doomed Build Back Better?",
    "(Labor’s percentage hit its rock bottom during the Obama years.)",
    "Vance speaks at a rally in Mason, Ohio, on Jan. 30, 2022.",
    "And at the same time, strong families and communities.",
    "@amazonlabor We worked had fun and made History ?????",
    "The most epic unionization push since the 1930s?",
    "@JeffBezos @DavidZapolsky CONGRATULATIONS ??",
    "The politics of unionization are changing.",
    "Americans love a David-and-Goliath story.",
    "And Amazon is … well, you be the judge.",
    "Careful what you wish for, Goliath!",
    "Jeff Bezos makes a great bogeyman.",
    "So what’s coming next?",
    "There is no defense.",
    "welp there you go!",
    "— walking it back.",
    "It’s infuriating.",
    "It’s irrational.",
    "Why?",
    "5.",
    "3.",
    "2."
  ]
}