{
  "id": 5951,
  "mediaId": 129,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "This Supreme Court Is Out of Step With Most Americans",
  "image": "https://static01.nyt.com/images/2022/05/04/opinion/03wegman1/merlin_198741090_958dbc30-ff86-4ae6-8e0b-d0af1e67855b-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/03/opinion/supreme-court-roe-wade.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "Remember that one of Donald Trumps major selling points in the 2016 campaign was his vow that if elected, he would ensure Roe was overturned automatically.? It hasnt been automatic, but if the holding in the draft opinion stands, it will mark an astonishing moment in our history: the elimination of an existing constitutional right, one that millions of American women (not to mention the men who impregnated them) have relied on for nearly half a century.",
    "Vance, the Trump-endorsed Senate candidate in Ohio, recently said he believes Mr. Trump will run again in 2024 and offered him a piece of advice: Fire every single midlevel bureaucrat, every civil servant in the administrative state, replace them with our people.? When the Supreme Court calls that illegal, he suggested, Mr. Trump can pull an Andrew Jackson  that is, defy the courts ruling and dare the justices to enforce it.",
    "Senate Republicans have worked overtime in recent years to politicize and polarize the justices, first by stealing a seat from President Barack Obama with nearly a year left in his term and then hustling Justice Barrett through to her seat even as millions of Americans had already cast ballots in the election that would oust her disgraced patron, Mr. Trump.",
    "A breach of such magnitude suggests a breakdown of internal norms that tracks with the broader erosion of American institutions in recent years and the further conversion of the court into a hyperpartisan political body not meaningfully different from Congress.",
    "A journalist recently pointed out that in the corners of what constitutes intellectual Trumpism, far-right writers are being open about the need for an American Caesar? who will take power and smash? dissent using all force available.? Sounds crazy, right?",
    "Over two centuries, the nation has rejected the worst of the founders beliefs and values and sought to respond to the needs of a growing and changing society, either through constitutional amendments or modern interpretations of the text they created.",
    "Roe v. Wade is one of those interpretations, an effort to bring Americans expanding concept of rights and freedoms into line with the Constitutions broadly worded guarantees, to connect the past with the present and the future.",
    "Roe v. Wade must be overturned, Justice Alito reasoned, because the Constitution says nothing about a right to abortion and because such a right was entirely unknown in American law? until the latter part of the 20th century.",
    "The leaked opinion is a work in progress; it is dated Feb. 10, and its possible that one or more of the justices have since changed their minds, as sometimes happens in the course of circulating draft rulings and dissents.",
    "But it might counsel at least a modicum of moderation and humility when approaching hot-button social and political issues that divide the country, as Justice Alito acknowledges is the case with abortion.",
    "It is time to heed the Constitution and return the issue of abortion to the peoples elected representatives.?\nOf course the original Constitution says nothing about abortion, or about women at all.",
    "No one expected that the news of Roe v. Wades imminent demise would come as it did  in an extraordinary late-night leak of a draft opinion two months before the end of the Supreme Courts session.",
    "The draft opinion has the support of at least four other justices, according to Politico: Clarence Thomas, Neil Gorsuch, Brett Kavanaugh and Ms. Barrett, the only woman in the majority.",
    "The right-wing justices may be feeling on top of the world right now, but they would do well to remember that when absolute power is the objective, even the rule of law is no match.",
    "But whatever the final outcome, two immediate takeaways are clear:\nFirst, the leak illustrates, in shocking fashion, the accelerating collapse of another American institution.",
    "This didnt happen by accident: Republicans have spent the past several years twisting the court into an aggressive right-wing supermajority for precisely this purpose.",
    "It is not perfect  no Supreme Court ruling is  but it was an essential step on the path to achieving full equality for more than half of the nations population.",
    "For decades, the court has been chipping away at a womans right to choose what happens to her own body, but the core holding of Roe always managed to survive.",
    "While abortion is one of the most hotly contested issues in American society, the court has ruled on hundreds if not thousands of similarly fraught cases.",
    "So did the idea that a sitting president would incite a deadly insurrection at the U.S. Capitol to try to block the certification of an election he lost.",
    "In the process, they are running roughshod over decades of Supreme Court standards regarding the conditions for overturning longstanding precedent.",
    "Thats older than most Americans, but its not old enough for Justice Samuel Alito, who wrote the draft opinion that Politico published Monday night.",
    "Keep in mind that five of the six justices in the right-wing majority were appointed by presidents who took office after losing the popular vote.",
    "If presidents, senators and nominees act as if anything is fair game in the quest for power, why shouldnt others involved with the institution?",
    "Then came 2020, when Justice Ruth Bader Ginsburg died and was replaced by Justice Amy Coney Barrett only days before the presidential election.",
    "It was written in the late 18th century by a conclave of a few dozen men: all white and most wealthy, including more than a few slaveholders.",
    "Any talk about the reproductive rights of women, who could not vote or play any meaningful role in politics, would have been foreign to them.",
    "Recall that when Roe was decided in 1973, the vote was 7 to 2, with five justices appointed by Republican presidents joining in the majority.",
    "An overwhelming majority of Americans still support a womans right to terminate her pregnancy in at least some circumstances, so no.",
    "For an outsider to get advance notice of a ruling, much less a fully footnoted 98-page draft opinion, is almost unheard-of.",
    "Nothing except the makeup of the courts majority itself, the most nakedly partisan crop of justices in memory.",
    "Republicans have been saying for decades that they planned to overturn Roe v. Wade the first chance they got.",
    "It brims with the swaggering confidence of a bloc that knows it has the votes to do whatever it wants.",
    "Suddenly, the court had a solid majority of justices prepared to overturn Roe outright.",
    "Instead the justices are grabbing everything off the shelves while they can.",
    "For example, has the world changed significantly since the original ruling?",
    "The Times is committed to publishing a diversity of letters to the editor.",
    "Now that they finally have the chance, they appear to be running with it.",
    "This doesnt mean they are less legitimate than the other four justices.",
    "That Republican Party, as it turns out, was not long for this world.",
    "The Supreme Court is fanatically secretive about its deliberations.",
    "But everyone should have expected that it would, eventually, come.",
    "Wed like to hear what you think about this or any of our articles.",
    "Leaks have happened very rarely, but never quite like this.",
    "Roe was egregiously wrong from the start,? the draft says.",
    "Its successors are also telling us what they plan to do.",
    "The second takeaway from Mondays leak: Listen to them.",
    "Its not hard to see how that could have happened.",
    "And heres our email: letters@nytimes.com.",
    "Here are some tips.",
    "What has changed?",
    "J.D."
  ]
}