{
  "id": 5952,
  "mediaId": 209,
  "date": "d2022-05-03T00:00",
  "headline": "Ohio's GOP Senate primary offers a choice of Trump-lite or the full deal",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-desktop@1/v1651510393/trump%20capitol%20eyes.jpg",
  "link": "https://theweek.com/politics/1013171/ohios-gop-senate-primary-offers-a-choice-of-trump-lite-or-the-full-deal",
  "sentiment": "0.688",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Damon Linker",
  "authorUrl": "https://theweek.com/authors/damon-linker",
  "termIds": [
    946,
    971,
    1147,
    1710,
    1801,
    3103,
    4168,
    4580,
    428,
    571,
    2845
  ],
  "sentences": [
    "What to watch for in the Ohio and Indiana primaries\nThe pros and cons of a Trump endorsement\nEnding Roe may be used to erode 'other privacy-based rights,' Politico's Gerstein says\nGrand jury members selected for Georgia criminal probe into Trump\nTexas border inspections prompt Mexico to move trade link to New Mexico\nUkraine says it destroyed Russia's Izyum command center, missed top general\n5 toons about Marjorie Taylor Greene's Jan. 6 amnesia",
    "Under the \"Issues\" tab, Dolan informs visitors that, in addition to \"Empowering Job Creators & Small Businesses\" (a tip of the hat to Mitt Romney's 2012 presidential campaign), he wants to secure the border and stop illegal immigration, stand with the police, end abortion, protect gun rights, confront China, fight cancel culture, ensure election integrity, and stop schools from teaching critical race theory.",
    "On his \"Issues\" page, we find a familiar list of priorities, including protecting conservative values (complete with denunciations of critical race theory and gender ideology), restoring manufacturing jobs, defending small businesses, conserving traditional values, ending abortion, solving the border crisis, protecting gun rights, and ensuring \"election integrity.\"",
    "A recent article in Vanity Fair quotes Vance from an interview on a far-right podcast talking about what Trump should do if he wins the presidency again in 2024: \"I think that what Trump should do, if I was giving him one piece of advice: Fire every single midlevel bureaucrat, every civil servant in the administrative state, replace them with our people.",
    "They support many of the same policies, but two of them have placed combative rage at the center of their campaigns, and one  the frontrunner  has promised to follow through on that anger and resentment, even if it involves (as Trump himself did in the aftermath of the 2020 election) directly challenging the constitutional order of the United States.",
    "But in addition to claiming that Vance, who has leapt into the polling lead since the former president's endorsement, is the Trumpiest candidate, Douthat also insists that the divisions in the GOP that marked the rancorous 2016 presidential primaries have reappeared more broadly in Ohio this spring.",
    "While Vance is dominating the populist-nationalist lane, former Ohio treasurer Josh Mandel, currently in second place, has staked out the position Texas Sen. Ted Cruz cultivated in his presidential campaign six years ago by portraying himself as the True Conservative in the race.",
    "There's a whole statement in favor of \"Trump's America First Agenda,\" along with promises to combat abortion, protect \"the Judeo-Christian Bedrock of America,\" defend the Second Amendment, take on the \"radical left,\" and fight back against \"CRT, Wokeism, and Cancel Culture.\"",
    "Sometimes those eruptions of vituperation go quite far  not quite down the byzantine conspiratorial byways of Trump's election-related paranoia, but definitely into dangerous territory where resentment curdles into acts of outright defiance against the rule of law.",
    "To judge by recent commentary, when Ohio Republicans go to the polls on Tuesday to decide which of seven candidates on the ballot will face off against a Democratic opponent in November, the GOP will be making a portentous choice about the direction of the party.",
    "That list of items would also fit perfectly on a Trump 2024 campaign site, as would some details not found on Dolan's  like a vow to resist \"squishy establishment RINOS\" (illustrated by a picture of Trump-scourge Rep. Adam Kinzinger [R-Ill.]).",
    "If we begin by looking at Dolan, the man supposedly following the playbook of a pre-Trump Republican, we notice that he does indeed sound most comfortable talking about tax cuts and making things easier for businesses to grow and create jobs.",
    "Where they differ has less to do with what they want to accomplish than it does with how much damage they're willing to do to American institutions in order to ensure their agenda prevails in Washington.",
    "He's also the candidate who has been most effective at crafting a message intended to expand on Trump's populist message, which has transformed politics in Ohio (and across the country) since 2016.",
    "In case voters fail to get the point, the words appear over a photo of the candidate in desert camo, presumably from his time serving in Iraq as a member of the U.S. Marine Corp Reserve.",
    "On the contrary, what really stands out when looking at the substance and style of all three of the polling leaders is how fully they have embraced the Trumpian revolution in the GOP.",
    "It comes through more clearly when the candidate speaks, often in angry stump-speech denunciations of Democrats, universities, and other bastions of elite progressivism.",
    "And when the courts stop you, stand before the country, and say,\" here Vance quotes Andrew Jackson defying the Supreme Court, \"the chief justice has made his ruling.",
    "Two issues that stand out on Vance's site are explicit promises to \"dismantle big tech oligarchy\" and pursue a \"foreign policy that puts American first.\"",
    "Similar priorities show up on Vance's website, where the first thing that greets visitors is a pop-up announcing that Vance is \"Trump endorsed.\"",
    "The second places Vance somewhat closer to Trump than the competition, while the first is a plausible development of Trump's populist themes.",
    "Vance, the 37-year-old memoirist and venture capitalist, has not only received Donald Trump's highly coveted endorsement in the race.",
    "Where the candidates really diverge is in tone  and in what that difference likely reveals about how each would behave in office.",
    "Why Republicans cheered a GDP drop\nThe 1 thing Biden got exactly right\nMusk, Twitter, and digital power\nFrance's center holds.",
    "And then there's Ohio state Sen. Matt Dolan, whose campaign has surged into third place over the past few weeks.",
    "Mandel, by contrast, greets visitors with the alliterative vow (in all caps) to \"FIGHT FOR FAITH AND FREEDOM.\"",
    "For Douthat, Dolan is the candidate of the GOP establishment, like Jeb Bush and Marco Rubio before him.",
    "Ninety percent of what's on any one of them is interchangeable with what you'll find on the others.",
    "The same could be said of what visitors will find under the \"Issues\" tab at Josh Mandel's website.",
    "But that doesn't mean the other leading candidates aren't making their own efforts to do the same.",
    "Meanwhile, four out of the 10 issues highlighted on Mandel's website deploy the word \"fighting.\"",
    "That's the real difference between the leading Republican Senate candidates in Ohio.",
    "Dolan comes off like an amiable businessman devoted to his family and his country.",
    "In listing issues, he uses the words \"fighting\" and \"combating\" just once each.",
    "But only one of them appears willing to fully follow in his father's footsteps.",
    "That list could appear on the website of Trump's 2024 presidential campaign.",
    "Yet a visit to his campaign's website reveals somewhat different priorities.",
    "Vance is clearly the candidate most fully following Trump's populist lead.",
    "But other than that, the websites are close to identical in substance.",
    "According to a New York Times column by Christopher Caldwell, J.D.",
    "There is some truth to Caldwell's and Douthat's analysis.",
    "All the leading candidates are children of Donald Trump.",
    "Vance's bellicosity is less obvious from his website.",
    "Ross Douthat, also writing in the Times, agrees.",
    "(Cruz endorsed Mandel a month ago.)",
    "Now let him enforce it.\"",
    "Can it last?"
  ]
}