{
  "id": 5954,
  "mediaId": 19,
  "date": "d2022-05-03T00:00",
  "headline": "Ohio Chamber of Commerce Issues Last Ditch Veiled Attack on Trump-Endorsed J.D. Vance: Beware of Populism",
  "image": "https://media.breitbart.com/media/2022/05/AP22122673106721-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/03/ohio-chamber-of-commerce-issues-last-ditch-veiled-attack-trump-endorsed-j-d-vance-beware-populism/",
  "sentiment": "-0.198",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    946,
    1054,
    1147,
    1801,
    2027,
    3103,
    3741,
    380,
    544
  ],
  "sentences": [
    "The ruling class that instead of investing in this country  building institutions, making the people who live here wealthier, happier, more prosperous  it actually enjoys plundering the greatest country in the world because it doesnt see that it owes anything to the people who live here, to the previous generations that actually built this country,? Vance told Breitbart News in August.",
    "Vance, who has been endorsed by Angel Mom Maureen Maloney, has laid out a series of policy solutions for stopping illegal immigration, including banning welfare for illegal aliens, mandating E-Verify, declaring the Mexican drug cartels a terrorist organization, and cutting off federal funds to states that give foreign nationals the right to vote.",
    "On trade, Vance has opposed the Chambers preferred free trade-at-all-costs agenda and instead has advocated for fiercer U.S. tariffs on foreign imports and China-made products to reshore American manufacturing jobs, as well as punishing multinational corporations that outsource American jobs to foreign countries.",
    "Vance, who has also been endorsed by Ohio Right to Life and has been leading a number of recent polls ahead of Tuesdays primary election, has campaigned as a social conservative and economic populist at the front of the midterm elections swath of GOP candidates running on nationalist-populist platforms.",
    "Vance has also campaigned on reducing overall legal immigration levels to the United States  a position that puts him squarely at odds with the U.S. Chamber of Commerce, which has demanded a doubling of legal immigration, more foreign visa workers to take American jobs, and amnesty for illegal aliens.",
    "In a last-minute veiled attack on Vance, Ohio Chamber of Commerce CEO Steve Stivers wrote in a post that voters ought to beware of populism? and to vote all populists out today!?\nBeware of populism,? Stivers wrote.",
    "The Club for Growth, which typically opposes tariffs, and political action committees linked to the Republican National Committee (RNC) are some of the outside groups funding attacks on Vance.",
    "It is not an ideology it is a worldview used to manipulate the masses into giving more power to government to save us from some scapegoat group.?\nPopulists get power by dividing people.",
    "The attack on Vance is only the latest from the donor class and the Washington, D.C., beltway political establishment who have swooped into the state to try to block his nomination.",
    "Vote all populists out today!?\nAs Breitbart News reported, Vance was the only Republican candidate in the Ohio Senate primary race who snubbed the Ohio Chamber of Commerce.",
    "Vance has also been vocal in his support of breaking up the nations largest billion-dollar tech conglomerates, a position opposed by the Chamber.",
    "Vance, an unapologetic populist, has campaigned on a number of issues but most prominently immigration, infrastructure, trade, and foreign wars.",
    "Vance, the Ohio Senate Republican primary frontrunner who has been endorsed by former President Trump, as voters head to the polls.",
    "They divide is [sic] into the elite oppressors and the poor oppressed masses,? he continued.",
    "The others, including Josh Mandel, Mike Gibbons, and Matt Dolan, met with the Chamber.",
    "Follow Breitbart News Ohio Senate Republican primary election coverage here.",
    "The CEO of the Ohio Chamber of Commerce issued a veiled attack against J.D.",
    "They say only they can save us by making government and them more powerful.",
    "But Goverment [sic] is more often the oppressor.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here."
  ]
}