{
  "id": 5956,
  "mediaId": 19,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Democrats Credit Trumps Impact on Ohios GOP Primary: JD Vance Is a Trumpist Nut Job",
  "image": "https://media.breitbart.com/media/2022/05/Trump-Backs-JD-Vance-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/05/03/democrats-credit-trumps-impact-on-ohios-gop-primary-jd-vance-is-a-trumpist-nut-job/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    946,
    1147,
    1402,
    1801,
    3103,
    4000,
    4273,
    146,
    428,
    2845
  ],
  "sentences": [
    "Alas, that's the story of the Trump GOP\n Tyler Buchanan (@Tylerjoelb) May 4, 2022\nRepublicans also celebrated Vances win, while crediting the America First movement:\nThank you to President Trump for endorsing @JDVance1 https://t.co/IkaUUt4CxA pic.twitter.com/AABa4shz3n\nTens of millions of RINO dollars spent to stop my man @JDVance1 in Ohio and they call it before 9 oclock.",
    "If they don't want to criminalize all abortions, want people who respect election results and actually think govt is there to solve problems he might be their guy.. cause JD Vance is a Trumpist nut job\n Jennifer 'I stand with Ukraine' Rubin gg (@JRubinBlogger) May 4, 2022\nLeft-wing pundit Ron Filipkowski explained how Trumps endorsement played out in polling data.",
    "I am torn by Schadenfreude about Vance vs Mandel; two truly terrible people who both stuck their heads deep into Donald Trumps colon, and only one of them could win, so I was gonna hate it no matter who won, but my God, both souls went for bargain basement rates,? he said.",
    "I am torn by Schadenfreude about Vance vs Mandel; two truly terrible people who both stuck their heads deep into Donald Trump's colon, and only one of them could win, so I was gonna hate it no matter who won, but my God, both souls went for bargain basement rates.",
    " Ron Filipkowski g (@RonFilipkowski) May 4, 2022\nBill Kristol, editor at large at the Bulwark, said, When Trump talks, Republicans listen.?\nWhen Trump endorsed Vance, on April 15, Vance was third at about 10%, behind Mandel and Gibbons each at 21%.",
    "If they dont want to criminalize all abortions, want people who respect election results and actually think govt is there to solve problems he might be their guy.. cause JD Vance is a Trumpist nut job,? she stated.",
    " Tom Nichols (@RadioFreeTom) May 4, 2022\nWashington Post opinion writer Jennifer Rubin said Vance won because he is a Trumpist nut job.?\nAll those Dolan voters should get to know Tim Ryan.",
    "One wonders if the others wish they could have a do-over & at least run a year-long campaign on their own terms, telling their own story, highlighting their own plans.",
    "One wonders if the others wish they could have a do-over & at least run a year-long campaign on their own terms, telling their own story, highlighting their own plans.",
    "@JDVance1 will be the next Senator from Ohio https://t.co/Jqxkef7xjC\n Ryan James Girdusky (@RyanGirdusky) May 4, 2022\nIve seen enough: Congratulations @JDVance1!",
    " Bill Kristol (@BillKristol) May 4, 2022\nTyler Buchanan, who is affiliated with Axios, said Vance got lucky with Trumps endorsement.",
    "Tom Nichols, a contributing writer for the Atlantic, gave Trump the credit for Vances win in the hotly contested primary.",
    "Democrats and media personalities on Tuesday acknowledged Donald Trumps impact on Ohio Senate candidate J.D.",
    "When Trump endorsed Vance, on April 15, Vance was third at about 10%, behind Mandel and Gibbons each at 21%.",
    "Trump is the only reason he won the primary  something he will remind Vance of every single day.",
    "Trump is the only reason he won the primary  something he will remind Vance of every single day.",
    "Without Trump's endorsement, Vance almost certainly stalls out at 10%, and finishes fourth.",
    "Without Trumps endorsement, Vance almost certainly stalls out at 10%, and finishes fourth.",
    "https://t.co/DFnkOYiDjE #LongForSenate 417.88FEDUP https://t.co/NzwsDAWgA8\nCorrection.",
    "Polling showed Trumps immediate impact on the race, and Vance never looked back.",
    "pic.twitter.com/Yhu3LEHjQF\nI think you mean the #Trump endorsed candidate J.D.",
    "Vance was in 4th with 9% in the polls when he received the Trump endorsement.",
    "Vance was in 4th with 9% in the polls when he received the Trump endorsement.",
    "The America First movement is alive and well people.",
    "All those Dolan voters should get to know Tim Ryan.",
    "Alas, thats the story of the Trump GOP,? he said.",
    "When Trump talks, Republicans listen,? he said.",
    "It was a high risk, high reward strategy.",
    "It was a high risk, high reward strategy.",
    " Darrell Issa (@DarrellIssa) May 4, 2022",
    "When Trump talks, Republicans listen.",
    "We need him in the U.S. Senate.",
    "In April, Trump endorsed Vance.",
    "Vance got lucky, they didn't.",
    "Vance got lucky, they didnt.",
    "Trump owns Vance,? he said.",
    "Vances GOP primary win.",
    "Congrats JD, well done.",
    "Vance will advance!",
    "Trump owns Vance."
  ]
}