{
  "id": 5974,
  "mediaId": 25,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Ohio primary voters head to polls in first test of Trump's influence in GOP midterms",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/05/02/be823a03-0963-4008-ad73-08a596292c3f/thumbnail/620x413/9b9d81779d13b3d93521805a35010c55/gettyimages-1240191184.jpg",
  "link": "https://www.cbsnews.com/news/ohio-primary-election-republican-senate-governor-donald-trump-jd-vance-josh-mandel/",
  "sentiment": "0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Brewster",
  "authorUrl": "",
  "termIds": [
    648,
    1147,
    1839,
    2087,
    3103,
    428,
    571,
    2710,
    2845
  ],
  "sentences": [
    "2022 Midterm Elections\n More\n Ohio primary voters head to polls in first test of Trump's influence in GOP midterms\n New York court throws out congressional maps favoring Democrats\n Anita Dunn returning to White House\n Warren urges Biden to cancel student loan debt ahead of midterms\n A test for Trump as Michigan GOP gathers\n More\nIn:\nDonald Trump\nOhio\n Adam Brewster\nCBS News political reporter.",
    "Trump allies stepped up their criticism against Mandel when excerpts from the book \"This Will Not Pass,\" claimed that Mandel told Republicans in Washington \"that he was parroting absurd rhetoric in the primary campaign out of a desire to court Trump and his supporters - but that was simply what he believed it would take to win.\"",
    "Governor Mike DeWine is in a similar position to many of his Republican colleagues: He has to first defeat a primary challenge before he can fully focus on November, a similar position toTexas Governor Greg Abbott, who easily won his primary in March.",
    "DeWine has also trumpeted Intel's decision to build semiconductors in Ohio, along with conservative victories in the legislature like abortion restritctions, a stand-your-ground law and a law allowing people to carry a weapon without a permit.",
    "U.S. Rep. Tim Ryan (D-OH), Democratic candidate for U.S. Senate in Ohio, speaks during a rally in support of the Bartlett Maritime project, a proposal to build a submarine service facility for the U.S. Navy, on May 2, 2022 in Lorain, Ohio.",
    "Here are the key races to watch:\nOhio Republican Senate primary: A test For Trump\nFormer President Donald Trump's influence in the GOP will be tested in several primaries this month, and the first will come in the Ohio Senate primary.",
    "Ohio voters will also decide who the Senate Democratic nominee will be, whether incumbent Republican Governor Mike DeWine will get a shot at a second term and which former southwest Ohio mayor will earn the Democratic nomination.",
    "\"Anybody who changes the name of the 'storied' Cleveland Indians (from 1916), an original baseball franchise, to the Cleveland Guardians, is not fit to serve in the United States Senate,\" Trump said in a statement last week.",
    "Vance, a Republican candidate for U.S. Senate in Ohio, shakes hands with former President Donald Trump during a rally hosted by the former president at the Delaware County Fairgrounds on April 23, 2022 in Delaware, Ohio.",
    "The candidates agree on several issues, including legalizing marijuana, although Cranley emphasizes it more, keeping qualified immunity for police officers and opposing the concealed carry legislation that DeWine signed.",
    "The 2022 primaries kick into high gear Tuesday when Ohio and Indiana voters head to the polls, initiating a month of elections that will preview where the parties could be heading in November's midterm elections.",
    "Paul Vernon / AP\nRenacci, in a meeting with the Cleveland Plain Dealer's editorial board last week, said DeWine \"did not listen to the people\" when he closed businesses and set other unilateral rules in 2020.",
    "The brightest spotlight Tuesday is shining on Ohio's Republican Senate primary, featuring a crowded field of candidates vying to represent the party in the race to replace retiring GOP Senator Rob Portman.",
    "The state also features a slew of interesting House primaries, including a rematch between Democratic Representative Shontel Brown and Nina Turner, and a former Trump aide trying to win a spot in Congress.",
    "What Vladimir Putin did was wrong in invading a sovereign country, but we have our own problems in the United States to focus on,\" Vance said at a debate in March, echoing Trump's \"America first\" rhetoric.",
    "DeWine said during that meeting that he believes he took a \"middle-of-the-road position\" on COVID and is \"proud of what we did,\" including pushing to open schools earlier than some planned last spring.",
    "The pro-Mandel Club For Growth released an ad last week spotlighting Vance's Trump criticisms and Trump's previous endorsement of Mitt Romney, who Mandel spent a lot of time campaigning for in 2012.",
    "Indiana, which also has a Senate race this fall, already has its candidates, since Republican Todd Young, who will be a heavy favorite, and Democrat Thomas McDermott Jr. are both running unopposed.",
    "While every race is critical with a 50-50 split Senate, Democrats are expecting to dedicate more resources to trying to flip Republican-held seats in North Carolina, Pennsylvania and Wisconsin.",
    "Turner's loss was seen as a setback for the progressive movement in challenging incumbent or more moderate Democrats, especially since Turner had high name recognition and strong fundraising.",
    "Former Congressman Jim Renacci and farmer Joe Blystone are hoping that lingering conservative anger over DeWine's handling of the COVID-19 pandemic may spur voters in a different direction.",
    "Sen. Ted Cruz (R-TX) shakes hands with Josh Mandel, a Republican candidate for U.S. Senate in Ohio, during a campaign event at Victory Christian Church on April 29, 2022 in Kettering, Ohio.",
    "Democrats, meanwhile, are hanging their hopes on a pair of former mayors from southwest Ohio: John Cranley, the former mayor of Cincinnati, and Nan Whaley, the former mayor of Dayton.",
    "He only recently announced that he supported aborition rights before he entered the primary, saying he changed his mind after he and his wife had to make their own fertility decision.",
    "Some Democrats are hopeful that his past success with working class white voters can give the party a chance in a state that Republicans have otherwise dominated in recent elections.",
    "Brown is backed by House Speaker Nancy Pelosi, Majority Whip Jim Clyburn, the Congressional Black Caucus, Senator Sherrod Brown and former Secretary of State Hillary Clinton.",
    "While DeWine doesn't have Trump's endorsement, he has incredibly high name recognition in Ohio given his years as governor, attorney general, U.S. senator and congressman.",
    "That poll also showed that 42% of Republican primary voters said Trump's endorsement made them more inclined to support Vance, while 23% said it diminished their support.",
    "Unlike his rivals, he did not seek Trump's endorsement, leaving a potential lane open for him if the Trump-aligned candidates divide that slice of the electorate enough.",
    "Representative Shontel Brown is facing another race against Nina Turner, a former Ohio state senator who was the campaign co-chair for Senator Bernie Sanders' 2020 run.",
    "Ryan has a pair of challengers in his race, including Morgan Harper, a lawyer and former Consumer Financial Protection Bureau official during the Obama administration.",
    "Congressman Tim Ryan of northeast Ohio entered the race in April 2021 and has raised millions of dollars as he appears set to cruise to victory on Tuesday night.",
    "Vance lamented that \"Congressional Republicans refused to give Donald Trump $4 billion for a border wall,\" but gave \"Joe Biden $14 billion for Ukrainian aid.\"",
    "Vance's opponents have tried to use those words against him, but Trump told Ohio Republicans during a rally in late April to forget about those comments.",
    "The state Democratic Party did not endorse a candidate in the primary, but the state's top elected Democrat, Senator Sherrod Brown, is supporting Whaley.",
    "In addition to the Senate and Governor races, Trump's team will be watching to see how Max Miller does in this open Republican primary in northeast Ohio.",
    "A Fox News poll released last week, conducted after Trump's endorsement, showed Vance leading with 23%, up from 11% in a Fox News poll from early March.",
    "On Monday, he told CBS News that if Mandel or Vance win, \"they're going to have to do some explaining\" about their baseless claims of a stolen election.",
    "Vance and these opponents have all either falsely claimed that the 2020 election was stolen or raised unsubstantiated questions about widespread fraud.",
    "Dolan, whose family owns the Cleveland Guardians, is the only leading candidate to assert that President Joe Biden legitimately won the 2020 election.",
    "T Drew Angerer / Getty Images\nOhio was long considered a key battleground state, but Republicans have dominated most statewide races in recent years.",
    "Drew Angerer / Getty Images\nThe Republican candidates largely agree on issues, but Vance distanced himself from his opponents on the war in Ukraine.",
    "DeWine's opponents have also tried to link him to an energy bribery scandal that took down top Ohio Republicans, including the former House speaker.",
    "He's been railing against the migration crisis at the southern border, demanding that big tech companies be broken up and slamming old trade deals.",
    "But despite the GOP's strength in the Buckeye State, the state's other senator is a Democrat, , Sherrod Brown, who easily won reelection in 2018.",
    "Vance even released a statement last week saying, \"Josh Mandel and his allies have declared war on President Trump and the entire MAGA movement.\"",
    "One other incident drew significant attention between those Fox News polls: Mandel physically confronted Gibbons at a forum in March.",
    "A Fox News poll released last week showed DeWine in a relatively safe position, leading his opponents with 43% of the vote.",
    "Trump will also be watching the crowded GOP primary in Ohio's 13th District, left open by Democratic Congressman Tim Ryan.",
    "Drew Angerer / Getty Images\nVance and Mandel supporters have been locked in a bitter feud in the campaign's closing days.",
    "Mandel accused Gibbons of dismissing his military service, though Gibbons insisted he did not make such an insinuation.",
    "DeWine has denied having any knowledge about any alleged improper actions by the person at the center of that scandal.",
    "An Emerson College poll released Saturday showed Vance (26%) just ahead of Mandel (24%) and Dolan (21%).",
    "In fact, if I went by that standard, I don't think I would have ever endorsed anybody in the country.\"",
    "Ryan has focused his campaign on economic issues, including outsourcing, trade deals and minimum wage.",
    "The rematch is again a battle between the establishment and progressive wings of the Democratic party.",
    "He told Steve Bannon in February, \"I don't really care what happens to Ukraine one way or the other.\"",
    "Billionaire Peter Thiel has given at least $10 million to a super PAC supporting Vance's campaign.",
    "Vance was followed by Mandel (18%), Gibbons (13%), state Senator Matt Dolan (11%) and Timken (6%).",
    "Former Ohio GOP Chair Jane Timken bragged about the work she did campaigning for Trump in 2020.",
    "Harper has embraced progressive ideas like \"Medicare for All\" and expanding the Supreme Court.",
    "While campaigning with Vance, Donald Trump Jr. slammed the group's continued attacks on Vance.",
    "Turner is backed by Senator Bernie Sanders, Black Lives Matter and the Working Families Party.",
    "Investment banker Mike Gibbons often touted his financial commitments to Trump's campaigns.",
    "Representatives Marjorie Taylor Greene and Matt Gaetz hit the trail for Vance on Saturday.",
    "Vance in mid-April, giving a jolt to Vance's campaign in the closing stretch of the race.",
    "Club For Growth President David McIntosh has been a close Trump adviser in recent years.",
    "You're going to have to ask them why they chose to ignore Ohioans and go after his vote.",
    "Former Ohio Treasurer Josh Mandel campaigned on being \"pro-God, pro-gun and pro-Trump.\"",
    "Trump endorsed former campaign advisory board member Madison Gesiotto Gilbert in March.",
    "Republican Senator Tim Scott of South Carolina is backing former staffer Shay Hawkins.",
    "Senator Josh Hawley campaigned with Vance on Sunday and has events with him on Monday.",
    "Whichever Republican emerges from the primary is likely to have significant resources.",
    "The closing days of the campaign brought a host of top surrogates to the state.",
    "Vance has embraced Trump's populist, nationalist, right-wing brand of politics.",
    "Ultimately, Trump's endorsement went to Vance, formerly a fierce Trump critic.",
    "\"He's a guy who said some bad (expletive) about me,\" Trump said at the rally.",
    "The seat was left open by Republican Congressman Bob Gibbs, who is retiring.",
    "The House\nThere are a few interesting House primaries to monitor on Tuesday.",
    "DeWine won high marks early in the pandemic with his stay-at-home mandates.",
    "He has built his campaign around a desire to \"cut workers in on the deal.\"",
    "The Democrats\nThe Democratic Senate primary has been far less competitive.",
    "Texas Senator Ted Cruz spent Friday and Saturday campaigning with Mandel.",
    "He said aid to Ukraine should be conditioned on \"support for our border.\"",
    "Whaley has touted her support for abortion rights throughout her career.",
    "Three of Vance's main rivals were also vying for Trump's endorsement.",
    "He endorsed venture capitalist and \"Hillbilly Elegy\" author J.D.",
    "They have both said they'd veto new abortion restrictions.",
    "Trump, meanwhile, has told supporters not to back Dolan.",
    "Notably, 25% of voters said they were still undecided.",
    "Mike DeWine speaks Jan. 21, 2022, in Newark, Ohio.",
    "Brown defeated Turner in a 2021 special election.",
    "\"President Trump was a good Republican president.",
    "Tech executive Traci Johnson is also in the race.",
    "Portman is campaigning with Timken on Monday.",
    "Whaley has criticized Cranley over abortion.",
    "Renacci was at 24%, while Blystone had 19%.",
    "Gibbons was at 17%, while Timken was at 8%.",
    "That's what I was focused on,\" Dolan said.",
    "Trump won the state by 8 points in 2020.",
    "Can anybody beat Mike DeWine?",
    "All the others did, also.",
    "I went after Ohioans.",
    "\"But you know what?",
    "It's terrible.",
    "\"It's tragic.",
    "Ohio Gov.",
    "Twitter",
    "J.D."
  ]
}