{
  "id": 5981,
  "mediaId": 19,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Clean Sweep: All 22 Trump-Backed Candidates Win Primaries in Ohio, Indiana",
  "image": "https://media.breitbart.com/media/2021/11/GettyImages-1350320667-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/03/22-trump-backed-candidates-win-primaries-ohio-indiana/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Gilbertson",
  "authorUrl": "https://www.breitbart.com/author/ngilbertson/",
  "termIds": [
    1120,
    1147,
    1801,
    2005,
    3103,
    3981,
    4099,
    428,
    2710,
    2845
  ],
  "sentences": [
    "The 13 other Trump-endorsed candidates who brought home primary victories in Ohio on Tuesday night include:\nSecretary of State Frank Larose  Republican nominee for Secretary of State\nAttorney General David Yost  Republican nominee for Attorney General\nTreasurer Robert Sprague  Republican nominee for Treasurer\nAuditor Keith Faber  Republican nominee for Auditor\nRep. Steve Chabot  Republican nominee for the 1st Congressional District\nRep. Ben Wesntrup  Republican nominee for the 2nd Congressional District\nRep. Jim Jordan  Republican nominee for the 4th Congressional District\nRep. Bob Latta  Republican nominee for the 5th Congressional District\nRep. Bill Johnson  Republican nominee for the 6th Congressional District\nRep. Warren Davidson  Republican nominee for the 8th Congressional District\nRep. Mike Turner  Republican nominee for the 10th Congressional District\nRep.",
    "Trump spokeman Taylor Budowich tells Breitbart News:\nJD Vance put in tremendous work and has immense political talentwhich put him in the position to earn the support of President Trumpbut it was the endorsement of President Donald J. Trump that took a candidate who many insiders said was in 4th and at single digits in the polls, and in only two weeks, propelled him into a commanding first place finish.",
    "He did however back out of the race in 2021.\nRINO Congressman Anthony Gonzalez, who has poorly represented his district in the Great State of Ohio, has decided to quit after enduring a tremendous loss of popularity, of which he had little, since his ill-informed and otherwise very stupid impeachment vote,? Trump said at the time.",
    "Troy Balderson  Republican nominee for the 12th Congressional District\nRep. Mike Carey  Republican Nominee for the 15th Congressional District\nAll Donald Trump-endorsed candidates swept in Indiana as well, securing nominations in six districts.",
    "The power of President Trumps endorsement is undeniable, his dominance over the Republican powerbrokers in D.C. cannot be overstated, and the promise of this MAGA Movement will not just define the Midterms, but it will win for years to come.",
    "Making Vances victory all the more impressive was his ability to stave off the crowded senate field with three other candidates who sought Trumps endorsement, in addition to being targeted by the Republican establishment and donor class.",
    "Former White House political director Brian Jack exclusively tells Breitbart News:\nWhat we saw in Texas earlier this year was confirmed yet again tonight: President Trumps endorsement is the most important endorsement in politics.",
    "All 22 candidates in Ohio and Indiana endorsed by former President Donald J. Trump completed a clean sweep of Tuesdays primaries, indicating the strength of a Trump endorsement is as mighty as it has ever been.",
    "The candidates, Reps. Jackie Walorski, Jim Banks, Jim Baird, Victoria Spartz, Greg Pence, and Larry Bucshon, are all incumbents currently serving in the United States House of Representatives.",
    "The committee said their demand was in opposition to the unconstitutional, politically motivated impeachment proceeding against President Donald J. Trump,'? Breitbart News previously reported.",
    "Vance, who authored the best-selling book Hillbilly Elegy, received Trumps endorsement on April 15 and enjoyed a substantial boost in the polls following the 45th Presidents nod.",
    "Vances win in the crowded Ohio Senate primary is welcome news to other Trump-endorsed candidates and is a potential harbinger of things to come in upcoming races in other states.",
    "His endorsed candidates are a combined 55-0 in 2022 primaries, a continuation of the historic endorsement streak of success that started during his time at The White House.",
    "The enormous night for Trump-backed candidates follows sweeping wins in Texas on March 1, which saw candidates who garnered Trumps nod win all 32 of their races.",
    "Republican candidate Madison Gesiotto Gilbert won the Republican nomination for Ohios 13th District, beating out six other candidates vying for the nomination.",
    "The seat is currently held by outgoing Democrat Congressman Tim Ryan, who secured the Democratic Senate nomination Tuesday and will face J.D.",
    "Miller challenged incumbent candidate Rep. Anthony Gonzalez in the primary, one of ten Republicans who voted to impeach Trump.",
    "Trump-backed Republican candidate Max Miller secured the Republican nomination for the 7th Congressional District.",
    "Trumps team tells Breitbart News that Vance was polling around ten percent in fifth place before Trumps backing.",
    "Gonzalez, in turn, refused the Ohio Republican Partys calls to resign his seat.",
    "She will square off against Democrat nominee Emilia Sykes come November.",
    "He took home 32 percent of the vote Tuesday.",
    "Vance in Novembers election.",
    "Populist candidate J.D."
  ]
}