{
  "id": 5983,
  "mediaId": 43,
  "date": "d2022-05-03T00:00",
  "headline": "I Got Your Democratic Messaging Right Here",
  "image": "https://images.dailykos.com/images/794536/story_image/bluepath.jpg?1587383935",
  "link": "https://www.dailykos.com/story/2022/5/3/2094839/-I-Got-Your-Democratic-Messaging-Right-Here-GNR-for-Bluesday-May-3rd",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1147,
    1801,
    3103,
    4780,
    146,
    3469,
    2816,
    2845,
    2942
  ],
  "sentences": [
    "Shes a global fellow at the Wilson Institute; shes the author of How To Lose the Information War: Russia, Fake News, and the Future of Conflict and How to Be a Woman Online: Surviving Abuse and Harassment, and How to Fight Back; shes written numerous articles for among others, The Washington Post and New York Times; shes been an advisor to the Ukrainian Government; and she managed democracy assistance programs for Russia and Belarus at the National Democratic Institute for International Affairs.",
    "-- Railing against the political establishment in front of a crowd of more than 3,000 people on Sunday, Charles Herbster cast himself as an outsider running with the blessing of former President Donald Trump.?\nEight women, including a sitting state senator and former legislative staff member, have accused Herbster of groping them or forcing himself onto them at political events going back to 2019.?\n\"It's a shame,\" Trump said.",
    "Slava Ukraini\nIn John Olivers intro segment this past Sunday, he had a few words to spare for the bad political theater stunts perpetrated by Ron DeathSentence and Greg IsAButt [4:12]\nx\nx\nAll the News That Fits\nThe elephant in the room is the leaked, Alito authored, opinion overturning Roe v. Wade.",
    "x\nx\nOn the Lighter Side\nx\nThis cartoon made me laugh so hard as a Canadian watching whats going on down south #ScottMetzgerCartoons #Elections2020 #DogHumour pic.twitter.com/7bW6lDPu5K\n Tanelle Nash (@NashTanelle) October 20, 2020\nApparently someone has been watching my instructional video.",
    "More on the shit show that is the Ohio republican primary for US Senate  Slate: Jim Newell: The Dumbest, Most Soul- Sucking Primary Race of the Year Is Finally About to End\nThe Republican primary for Ohios open Senate seat has had an unsettling effect on the nature of time in 2022.",
    "RoJo, the Russian clown\n Putin's Puppet (aka tfg)\n Leningrad Lindsey\n Moscow Mitch\n Rand 'Politburo' Paul\n Tuckems\n The Putin Caucus (formerly the Freedumb Caucus)\n All of them (and a bunch more (R) fellow travelers)\n You neglected to mention one of the worst offenders.",
    "x\nYou can just call me the Mary Poppins of disinformation g'?g??? https://t.co/eGV9lpctYn pic.twitter.com/WVQFA2bPmq\n Nina Jankowicz gggg (@wiczipedia) February 17, 2021\nSome People Are Addicted to Opioids  For Me, Its Borowitz\nAnd Im willing to share my fix.",
    "While she was doing running commentary during the final 2020 presidential debate, Jankowicz tweeted: \"Back on the 'laptop from hell,' apparently- Biden notes 50 former natsec officials and 5 former CIA heads that believe the laptop is a Russian influence op.",
    "\": Trump can't seem to remember who he endorsed in Ohio's GOP Senate primary\nShortly after boasting about his cognitive abilities at a rally this past weekend, Donald Trump appeared to confuse the names of two candidates from Ohio running for U.S. Senate.",
    "New Yorker: Satire from the Borowitz Report: Musk Deletes Every Twitter Account but His\nAUSTIN (The Borowitz Report)In his first official act since acquiring the social-media company, Elon Musk has deleted every Twitter account but his.",
    "Good News Network: Texas Scientists Have Created a Protein That Breaks Down Plastic Bottles\nA Pac-Man protein that gobbles up plastic and breaks it down could open the door to eliminating billions of tons of landfill waste.",
    "Every one of these woke? republicans reading their soggy tea leaves and telling us its time to move on from tfg were all lined up behind his saggy ass, lips pursed and kissing away with wild abandon just a few months ago.",
    "The wheel is turning and you can't slow down,\nx\nx\n Poll\n 350 votes Show Results\n Which of these treasonous shitweasels is the most scared of the potential release of their kompromat files in the event of Putin's passing?",
    "Minutes after the acquisition was announced, the two hundred million people who had Twitter accounts found that they could no longer tweet, and that the Tesla C.E.O.s tweets were the only ones that appeared on the site.",
    "https://t.co/NVhkcUicZ2\n George Conwaygg (@gtconway3d) May 1, 2022\nFighting Back Against the Lies\nJoe Biden picked Nina Jankowicz to serve as executive director of Homeland Securitys new Disinformation Governance Board.",
    "1 problem plaguing Twitter: the relentless flood of voices inferior to mine.?\nTaking a Bite Out of Plastic Pollution\nIt looks like science might be able to help bail us out of some of the mess weve made of the planet.",
    "Closing Notes\nThe wheel is turning and you can't slow down,\n You can't let go and you can't hold on,\n You can't go back and you can't stand still,\n If the thunder don't get you then the lightning will.",
    "The brief slip-up was made on Sunday, during an event at the I-80 Speedway in Greenwood, Nebraska, where the former president failed to distinguish between conservative candidates Josh Mandel and J.D.",
    "If you dont feel comfortable calling BS on republican lies or making the case for the republicans being a failed party without an actual platform or a morally defensible reason for existing, thats ok.",
    "Their current set of media darlings  DeSantis, Abbott, Cawthorn, Gaetz, Greene, Boebert, Biggs, Gosar, Carlson, Hannity, Ingraham, et al  belong in a soap scum opera titled, As the Stomach Churns.",
    "After each new embarrassment to emerge from the melee, when you would look to see how many days were left until voting day, there always somehow seemed to be more than the last time you checked.",
    "It should make anyone else who votes republican think as many times as it takes to figure out being Nazi/KKK adjacent is not a morally valid position for anyone who purports to be a Christian.",
    "Messaging\nPlease fell free to fill up your republican acquaintances inboxes with these handy examples of democratic messaging (you know, the stuff we arent supposed to be able to produce).",
    "Apparently, Josh Mandel (R-Goon) and JD Vance (R-Whackjob) were Osterized into a mashed up worst of both campaigns Drumpfenstein monster in that squishy rotten space in between tfgs ears.",
    "Round, round robin run round, got to get back to where you belong,\n Little bit harder, just a little bit more,\n A little bit further than you gone before.",
    "\"In the great state of Ohio, the candidate most qualified and ready to win in November is JD Vance,\" the president said in a statement at the time.",
    "Next time youre talking to a fence sitter, dont hesitate to point out the republican penchant for ignoring abhorrent behavior in their candidates.",
    "Mischaracterizing the allegations as Herbster simply talking to women, Trump said Herbster asked that he appear in Nebraska after the story broke.",
    "The enzyme destroys PET (polyethylene terephthalate), which is ubiquitous in food and drink packaging, textiles, and polyester carpet fibers.",
    "Feeble-minded Dampnut Cant Remember His Endorsees Name\nBreaking: JD Mandel Is the brand new tfg endorsed candidate for US Senate from Ohio.",
    "Which of these treasonous shitweasels is the most scared of the potential release of their kompromat files in the event of Putin's passing?",
    "4%\n13 votes\nAll of them (and a bunch more (R) fellow travelers)\n 73%\n256 votes\nYou neglected to mention one of the worst offenders.",
    "I wonder if we could get every click-bait whore to volunteer to embed themselves with the Russian army in the Donbas region?",
    "Its not just the epic stupidity, the nonsensical lying, the constant gaslighting, or the personal lack of integrity.",
    "In a related story, the Abuser-and-Cheat has chosen to support a fellow sexual assaulter for governor of Nebraska.",
    "You dont get to scurry around in the dark with the political cockroaches and call yourself an upstanding citizen.",
    "Omaha World Herald: Chris Dunker: Trump defends, endorses Herbster at rescheduled Nebraska rally\nGREENWOOD, Neb.",
    "And they all knew he was an out and out traitor and insurrectionist when they voted the second time to acquit.",
    "There are a lot of good things that the democrats have done, are doing and will continue to do to talk about.",
    "Music from Ukraine\nOk, Im definitely a fan of the music thats originated out of the Dakh theatre in Kyiv.",
    "Between the outrage over that and continuing Ukraine war porn, todays news feeds are a bit overwhelmed.",
    "If the Court goes ahead and releases their flawed opinion, they are flying into a substantial headwind.",
    "To date, no formal proof has emerged to support verify the claim that the laptop is of Russian origin.",
    "I guess telling it like it is? means normalizing criminal behavior to excuse ones own transgressions.",
    "You asked for a decision and then gave poll voters an easy choice asking for no effort on their part.",
    "You asked for a decision and then gave poll voters an easy choice asking for no effort on their part.",
    "Neither are misogyny, homophobia, xenophobia, racism, religious fanaticism, or plain old misanthropy.",
    "Interestingly, no substantive evidence has emerged to support that the laptop is authentic either.",
    "People who vote for republican candidates get to own all these sterling characteristics and more.",
    "What we dont have is a bullhorn like Faux News and Hate Radio to make sure our message is heard.",
    "They all knew he was deep in Putins pocket when they did their best to bury the Mueller Report.",
    "They all knew his perfect phone call? was an outrageous criminal act when they voted to acquit.",
    "it will hopefully inspire republican losses in November and possibly an expansion of the court.",
    "They all knew he was a feckless lump of greed and selfishness when they supported him in 2016.",
    "In an official statement, Musk said that he deleted everyone elses accounts to address the No.",
    "A lot of these sick bastards are actually rooting for Putins genocide in Ukraine to succeed.",
    "It offers hope for solving global pollution by supercharging recycling on a large scale.",
    "The putin bots (Tuckems, Rand Paul, Empty Greene, et al) are screaming like stuck pigs.",
    "One of the things they are doing is accusing Nina of spreading disinformation herself.",
    "As usual, the media (cf Newsweek for example) is regurgitating the republican framing.",
    "Major industries would be able to recover and reuse products at the molecular level.",
    "Its the open cruelty, the appetite for violence and the full on embrace of hatred.",
    "Won't you try just a little bit harder,\n Couldn't you try just a little bit more?",
    "Won't you try just a little bit harder,\n Couldn't you try just a little bit more?",
    "\"It's a disgrace what they've done and that's why I'm with you,\" Trump said.",
    "In fact, Trump has only backed Vance, an endorsement that came last month.",
    "1%\n2 votes\nThat all of the above option is a total cop out on your part.",
    "Yet these are all foundational cornerstones of todays republican base.",
    "He was with us from the beginning ... he's an innocent human being.\"",
    "This performance piece asks why there is so much evil in the world.",
    "Theres a reason actual swastika tattooed neo-Nazis vote republican.",
    "Theyve gone a long way toward delegitimizing their legacy already.",
    "We hear a lot of complaints about a lack of Democratic messaging.",
    "1%\n4 votes\nThe Putin Caucus (formerly the Freedumb Caucus)\n .",
    "That all of the above option is a total cop out on your part.",
    "Republicans are working hard to normalize depravity.",
    "Theres a reason members of the KKK vote republican.",
    "I'll fix that for you in my brilliant comment.",
    "I'll fix that for you in my brilliant comment.",
    "The Supreme Court decision is one we expected.",
    "\"I could have got out of this one really easy.",
    "George Conway weighed in:\nx\nHis mind is shot.",
    "And we have a lot of individual amplifiers.",
    "This just opens them up to needed reforms.",
    "I defend people when I know they're good.",
    "Why dont we let Nina speak for herself.",
    "2%\n6 votes\nPutin's Puppet (aka tfg)\n .",
    "So yeah, weve got plenty of messaging.",
    "Trump says 'Russia, Russia, Russia.'\"",
    "Can't imagine what Stormy did to him.",
    "I think that makes me an Andy pusher?",
    "They're all doing good,\" Trump said.",
    "But thats a topic for another intro.",
    "2%\n6 votes\nRand 'Politburo' Paul\n .",
    "Bigotry is not an admirable trait.",
    "9%\n31 votes\nLeningrad Lindsey\n .",
    "JD Mandel, and he's doing great.",
    "Salon: Jon Skolnik: \"JP, right?",
    "Must have been really horrible.",
    "I'm here with you, Charles W.",
    "\"That's why I came out here.",
    "2%\n7 votes\nMoscow Mitch\n .",
    "RoJo, the Russian clown\n .",
    "We have lots of messaging.",
    "I could have played golf.",
    "We've endorsed JP, right?",
    "It is all about winning!\"",
    "Dont let it depress you.",
    "\"We've endorsed Dr. Oz.",
    "\"We cannot play games.",
    "What we do have is us.",
    "We are the messengers.",
    "Lets get the word out.",
    "1%\n4 votes\nTuckems\n .",
    "350 votes Vote Now!",
    "He's a good man.",
    "I wonder why?",
    "Who is Nina?",
    "6%\n21 votes",
    "Herbster.\"",
    "JD Mandel?",
    "Vance.",
    "Sad!",
    ".",
    "."
  ]
}