{
  "id": 5988,
  "mediaId": 147,
  "date": "d2022-05-02T22:45",
  "headline": "Trump pushes Republican candidates in the Ohio Senate primary further to the right",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2022/05/FullEpisode-1-768x526.jpg",
  "link": "https://www.pbs.org/newshour/show/trump-pushes-republican-candidates-in-the-ohio-senate-primary-further-to-the-right",
  "sentiment": "0",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Yang",
  "authorUrl": "https://www.pbs.org/newshour/author/john-yang",
  "termIds": [
    1147,
    1710,
    2466,
    3103,
    380,
    428,
    571,
    2623,
    2845,
    4962
  ],
  "sentences": [
    "Read the Full Transcript\nJudy Woodruff:\nFormer President Trump's influence in this year's midterm elections gets its first big test in tomorrow's Republican primary for Ohio's U.S. Senate seat.",
    "In an interview that year about his bestselling memoir, \"Hillbilly Elegy,\" Judy Woodruff asked Vance about Hillary Clinton's description of Trump supporters as a basket of deplorables.",
    "In his third run for the U.S. Senate, Mandel has been a steadfast crusader for Trump's agenda, though, in Nebraska yesterday, Trump seemed confused about just who he endorsed.",
    "Jane Timken:\nA lot of the candidates in this race, all of a sudden, they have seen the light and they're fighting for those America first policies, but I'm the true fighter.",
    "John Yang:\nThe crowded Republican contest is getting far more attention than the Democratic primary, where Representative Tim Ryan is the heavy favorite.",
    "John Yang:\nFriday morning, at Nana's and Papa's diner in Thornville, Ohio, about 40 miles east of Columbus, time for this group's weekly breakfast.",
    "John Yang:\nFor most of the five major candidates, and polls show no clear front-runner, it has been contest who could seem the most like Trump.",
    "Former President Trumps influence in this years midterm elections gets its first big test in Tuesday's Ohio Senate Republican primary.",
    "Vance:\nEven when I didn't like Trump personally, I liked a lot of what Trump talked about and I liked a lot of what Trump stood for.",
    "On the menu, eggs, French toast, biscuits and gravy, and on this last Friday before the primary election, a large side of politics.",
    "John Yang:\nThat includes the man whose Senate seat is at stake, Rob Portman, a free trade, free market champion who's retiring.",
    "John Yang:\nFirst some voters, like finance analyst Bob Beisel, who was at a Vance event near Columbus, that's a litmus test.",
    "There are definitely  there is definitely an element of Donald Trump's support that has its basis in racism or xenophobia.",
    "John Yang:\nMandel, who often campaigns in evangelical churches, met reporters with Cruz before an appearance near Dayton.",
    "As John Yang reports, Trump's surprise endorsement of a one-time self-proclaimed never-Trumper has shaken up the race.",
    "As John Yang reports, Trumps surprise endorsement of a one-time self-proclaimed never-Trumper? has shaken up the race.",
    "The name that comes up again and again isn't even on the ballot, Donald Trump, who is backing Senate candidate J.D.",
    "Joab Scott, Ohio Voter:\nI think there was 15 people on the stage at one time, and I think he was my 15th choice.",
    "I think if you have seen what I was saying at the time, you would see the full spectrum of how I felt about it.",
    "Jane Timken (R) Ohio Senatorial Candidate: Who is the candidate that's the true America first candidate?",
    "Last year, he helped negotiate the bipartisan $1 trillion infrastructure deal signed by President Biden.",
    "John Yang:\nMuch of Ohio, especially here in the rural areas, still seems to be very much Trump country.",
    "And at places like Nana's and Papa's, there's no doubt about Trump's influence on the primary election.",
    "(CROSSTALK)\nJohn Yang:\nThat surprised many since, in 2016, Vance was a self-proclaimed never-Trumper.",
    "John Yang:\nMany observers expected former state treasurer Josh Mandel to get the Trump endorsement.",
    "Matt Dolan (R), Ohio Senatorial Candidate: I'm the one in the race who is talking about executing.",
    "John Yang:\nOf the leading candidates, only state Senator Matt Dolan did not seek Trump's support.",
    "But for Joab Scott, an autoworker from Southern Ohio, Vance's change of heart mirrors his own.",
    "Mike Gibbons, a millionaire investment banker, touts a Trump-like personal history.",
    "Judy Woodruff:\nIs there something to what she said, or is she completely off-base?",
    "Josh Mandel (R), Ohio Senatorial Candidate: It is not enough to elect Republicans.",
    "Mike Gibbons:\nWhen I get to Washington, I will not know owe anything to anybody.",
    "Donald Trump, Former President of the United States: This man is going to win.",
    "Mike Gibbons (R) Ohio Senatorial Candidate: President Trump fought for you.",
    "I want to talk to you about the Senate race, the Senate primary on Tuesday.",
    "We're the same hardworking, Christian, Constitution, American, patriotic.",
    "President Joe Biden:\nSenator Rob Portman is a really hell of a good guy.",
    "(LAUGHTER)\nJoab Scott:\nThe Ronald Reagan Republican wasn't so divisive.",
    "(APPLAUSE)\nJane Timken:\nThere is no doubt in my mind there was fraud.",
    "I'm not hurting you, Rob, because I know you're not running again.",
    "And at the end of the day, we're going to win the race afterwards.",
    "I like that he came from poverty, a lot of adversity in his life.",
    "Sen. Ted Cruz:\nIt's easy for a candidate to say the right things.",
    "Vance (R), Ohio Senatorial Candidate: Stealing the 2020 election.",
    "What do you see in Josh Mandel that President Trump didn't see?",
    "I mean, the Trump endorsement was just kind of an added bonus.",
    "Lisa Boucher:\nYou can only sell yourself to a certain degree.",
    "For the \"PBS NewsHour,\" I'm John Yang in Thornville, Ohio.",
    "Vance of not supporting Trump, in the very beginning.",
    "What I look for is, what is the candidate's record?",
    "We have got to elect the right kind of Republicans.",
    "I know who I'm fighting for, what I'm fighting for.",
    "And I think Trump Republican has to be divisive.",
    "Kevin Black:\nI'm going to say complete opposite.",
    "He didn't do anything to make anyone divisive.",
    "And then, for me, I'm going to go with my gut.",
    "Everyone else is talking about making noise.",
    "I'm going to say the voters haven't changed.",
    "I have already achieved my American dream.",
    "Vance:\nI think some people are skeptical.",
    "When had they stood and fought and bled?",
    "That's the base of the Republican Party.",
    "Afterwards, Boucher seemed unconvinced.",
    "Joab Scott:\nI liked where he came from.",
    "These guys just want to create fights.",
    "So I had already made the decision.",
    "For Black, it helped seal the deal.",
    "Vance I think it is probably both.",
    "That's the only reason I say it.",
    "I'm just guilty as J.D.",
    "Some people aren't.",
    "I cannot be bought.",
    "I will do the same.",
    "I haven't changed.",
    "Come up, J.D.",
    "Vance.",
    "J.D.",
    "J.D.",
    "J.D.",
    "J.D."
  ]
}