{
  "id": 5989,
  "mediaId": 147,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Amy Walter and Annie Linskey on primary election season, Tucker Carlsons role in the GOP",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/assets/images/placeholder.jpg",
  "link": "https://www.pbs.org/newshour/show/amy-walter-and-annie-linskey-on-tucker-carlsons-influence-and-the-primary-election-season",
  "sentiment": "0",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "Annie Linskey:\nI think that was one of the most stunning takeaways, for me at least, from the New York Times reporting, which was just so incredible, is just the extent to which they really documented the ways in which Carlson is normalizing discussions of race that I think would not be considered  are not considered appropriate in many parts of the country.",
    "Amy Walter:\nIt says they do not want  Democrats do not want this election to be what midterms traditionally are, which is a referendum on the sitting president and the party in charge, not when the president is underwater in terms of his job approval rating, people feeling anxious about the state of the economy.",
    "Amy Walter of the Cook Political Report with Amy Walter and Annie Linskey of The Washington Post join Judy Woodruff to discuss the latest political news, including Tucker Carlson's role in the Republican Party, a closely watched primary election in Ohio and Democrats consider revamping their midterm strategy.",
    "And it's also really remarkable to think that it wasn't that long ago, in 2016, that John Kasich easily won the primary in Ohio over Donald Trump, that somebody like a Rob Portman could win  and, in fact, he went he ran seven points ahead of Donald Trump in 2016 in the general election.",
    "But what Democrats are really hoping is, in these individual races, whether it's Pennsylvania, Arizona, those candidates who have the Trump support, have embraced Trump, have embraced many of his policies, that's going to be a bigger liability than the big picture conversation.",
    "Annie Linskey, The Washington Post:\nWell, I think one of the parts of nick's reporting that resonated the most with me is this idea that Carlson is really sort of at the nexus of both media and influence, but also kind of a quieter influence with candidates in particular.",
    "Judy Woodruff:\nI do quickly want to turn both of you to a story in Politico today, inside reporting that the White House is looking at structuring their midterm strategy around going against, who else, Donald Trump and his wing of the Republican Party.",
    "Amy Walter, The Cook Political Report:\nI mean, I think that Nick Confessore put it really well when he said that he's filling the void that had been left by Donald Trump's voice being off of social media.",
    "And I think that is what The Times is reporting is kind of showing us, really the danger that Tucker Carlson and his show presents, is making it more OK to have those kinds of grievances voiced out loud.",
    "I mean, he's gone after, much like Donald Trump has, people who he sees are out of step or out of line with his overall philosophy or have done things that have gone against whatever Tucker doesn't like.",
    "But it  and I find that to be a particular role of  he's using both his voice as a  his platform to sort of put out new ideas, but also just to bolster candidates.",
    "And there are reports that Democrats are considering revamping their midterm strategy to draw a stronger contrast between themselves and the Trump wing of the GOP.",
    "Judy Woodruff:\nIs it  I mean, Amy, is it a matter of saying, if you don't get Tucker Carlson's blessing, then it's a problem for you as a Republican?",
    "Amy Walter:\nI mean, when I was reporting on this race earlier, I was watching all the ads that the candidates were putting up on air.",
    "So Joe Biden had tacked away from that strategy and had to  and had presented himself as more of a unifier in the State of the Union.",
    "Well, Amy, let's start with what we just heard Amna talking to Nick Confessore about, this three-part mega-report on Tucker Carlson.",
    "Judy Woodruff:\nAnd in just a few seconds, Annie, we don't know that they're going to do this, but it wouldn't be shocking, I think.",
    "Judy Woodruff:\n and about the role of the threat that many white Americans feel, what does that say about our politics right now?",
    "We should also mention that Democrats just tried to do this in Virginia, and tried to make Glenn Youngkin into Donald Trump.",
    "I think his name will be very seriously floated, and we may see more to come of a Tucker Carlson trial balloon in 2024.",
    "What's more remarkable, I think, is what John alluded to, was the really diminished role of the senator who's leaving.",
    "And so he kind of in almost  you don't want to say kingmaker role, but his influence is extreme  is out there.",
    "Read the Full Transcript\nJudy Woodruff:\nRepublicans will be closely watching Ohio's primary election tomorrow.",
    "Judy Woodruff:\nAnnie Linskey, what about  I mean, how do you see this Tucker Carlson phenomenon right now?",
    "I don't think anyone expects to see, if Republicans take the House, that he's not going to be the speaker.",
    "That's Amy Walter of The Cook Political Report With Amy Walter and Annie Linskey of The Washington Post.",
    "Vance was sort of lagging behind in this campaign until Donald Trump went in and endorsed him.",
    "One person he's been really consistently against, at least recently, has been Kevin McCarthy.",
    "They ran more ads, Republicans did, about Nancy Pelosi than Democrats ran about Donald Trump.",
    "Clarify for us, what is Tucker Carlson's role in the Republican Party, in American politics?",
    "But Carlson's show is moving through the window to where they're becoming more appropriate.",
    "But, of course, people are saying, so is this going to happen in every Republican primary?",
    "To discuss all that and more, it's a good time to check in with our Politics Monday team.",
    "So the White House is clearly scrambling around for a message that they think could work.",
    "Rob Portman, senator who has been there since 2010, has also endorsed a candidate.",
    "But now we're talking again to being a little bit more Democrats vs. Republicans.",
    "He's also being talked about as a potential 2024 candidate for president.",
    "And you saw a FOX News poll that came out shortly after the endorsement.",
    "So it's very difficult to change the trajectory away from a referendum.",
    "But you definitely saw that Trump had an impact and really pushed J.D.",
    "So he's not they're every minute every day in the way that he used to.",
    "And I think that's what many groups on the left worry about.",
    "And it was basically a noun, a verb and Donald Trump, right?",
    "Amy Walter, Annie Linskey, thank you both, Politics Monday.",
    "But his influence, the conversation about it is important.",
    "Judy Woodruff:\nSo we will see what happens in Ohio, Annie.",
    "So I do think, ultimately, none of us have a crystal ball.",
    "Vance, at least into a pole position where he could win.",
    "Republicans still lost 40 seats in the House that year.",
    "Vance in Ohio, which I know we will talk about later.",
    "But his candidate has gotten absolutely no traction.",
    "The polling has kind of been difficult to follow.",
    "They want to turn it to, let's make it a choice.",
    "And he's not in the White House, obviously.",
    "She's sitting in tonight for Tamara Keith.",
    "Those folks, they no longer exist in Ohio.",
    "Judy Woodruff:\nLots of primaries to watch.",
    "Republicans tried the same thing in 2018.",
    "I mean, it was just an incredible jump.",
    "Everything had to involve Donald Trump.",
    "We don't know what's going to happen.",
    "And that to me is what the worry is.",
    "And he has been a promoter of a J.D.",
    "Amy Walter:\nShe was the centerpiece.",
    "And that was not a winning strategy.",
    "Many of them were still successful.",
    "So good to see you on this Monday.",
    "His support was, I think, double.",
    "And that's not idle discussion.",
    "Annie Linskey:\nOh, absolutely.",
    "Amy Walter:\nWell, we will see.",
    "Annie Linskey:\nOh, absolutely.",
    "Time to talk about politics.",
    "What does that say to you?",
    "Now, this isn't unique.",
    "Hello to both of you.",
    "This isn't new.",
    "I mean, J.D.",
    "Thank you."
  ]
}