{
  "id": 5990,
  "mediaId": 65,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Ohio Dem Senate candidate Ryan rips Trump's 'J.D. Mandel' comment, says GOP treating race as a 'game'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/ecfd5edf-8405-4098-a5f9-a7d052e1939a/c2a27977-1380-497f-93b6-59ba2678d2d7/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/tim-ryan-ohio-senate-race-trump-jp-mandel-vance",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    781,
    946,
    1147,
    3103,
    4746,
    428,
    571,
    2763,
    2845
  ],
  "sentences": [
    "GIBBONS TOUTS BUS TOUR THROUGH 88 OHIO COUNTIES IN GOP SENATE PRIMARY, AS HE ATTACKS VANCE'S MAGA CREDENTIALS\nA few hundred attendees, many wearing union garb or city worker gear, gathered underneath a pavilion and held signs pushing to \"Build the Marine Highway,\" a project that would reportedly create up to 4,000 jobs to build a submarine dry dock.",
    "DOLAN SURGES LATE IN OHIO GOP SENATE PRIMARY, SAYS VOTERS LEAVING SOME OTHER CANDIDATES TO BACK HIS CAMPAIGN'\n\"Clearly this is a big game to everybody over there... Everybody was going after the endorsement hard.",
    "OHIO GOP SENATE PRIMARY: TIMKEN PLANS GROUND GAME BLITZ TO GET UNDECIDED VOTERS ON HER SIDE\nRyan is widely considered to be the front-runner for the Democratic nomination for the seat to replace retiring Sen.",
    "WITH CRUZ BACKING, MANDEL BRUSHES OFF RINO ATTACKS AFTER BOOK ALLEGES DISHONESTY\n\"He had a good job,\" Ryan continued, which allowed his grandfather to attend ballgames and volunteer in the community.",
    "LORAIN, Ohio  Rep. Tim Ryan Monday accused Republicans of treating Ohio's Senate race as a \"game\" as he appeared at a rally with union members on the eve of the state's primary elections.",
    "HOUSE FIREBRANDS GAETZ, GREEN SAY VANCE IS THE SENATE ALLY THEY NEED IN ROWDY CAMPAIGN STOP\nDuring his address, Ryan told a story about his grandfather, who was a union worker.",
    "The congressman said his favorite photo of his grandfather is one of him, as a volunteer, building the school Ryan later attended as a child.",
    "The first midterm of a president's term is usually bad for his party, and President Biden's low approval ratings are unlikely to help Ryan.",
    "Vance, the Ohio GOP Senate candidate he endorsed, mixing him up with former Ohio State Treasurer Josh Mandel, another GOP primary hopeful.",
    "A drum line framed with Ohio and American flags played before the event, and stood in the background during it as Ryan and others spoke.",
    "\"It's time we have policies in the United States that take on China, rebuild the middle class and reinvest into these communities.\"",
    "The congressman, however, says he believes he'll be moving to the upper chamber next year thanks to his rapport with Ohio voters.",
    "\"I think J.P. Mandel would be a hell of a candidate to run against,\" Ryan, D-Ohio, told Fox News in a Monday interview in Lorain.",
    "I come from a community that's a lot of job loss for the last 30 or 40 years,\" Ryan added of his focus on union jobs.",
    "Sen. Sherrod Brown, D-Ohio, Rep. Marcy Kaptur, D-Ohio, attended, and Lorain Mayor Jack Bradley hosted the event.",
    "\"I mean that just shows you that it's a game -- it's not a game for me, it's not a game for the families here.\"",
    "He was referring to former President Donald Trump's Sunday night rally in which Trump botched the name of J.D.",
    "Ryan was joined by several Ohio Democratic headliners at the chilly rally near the banks of Lake Erie Monday.",
    "\"He didnt have to work 60-70 hours a week, 12-15 hours a day,\" Ryan said in the stump speech.",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "No matter who wins the GOP race, Ryan is likely to face an uphill battle to the Senate.",
    "I'm not running as a Democrat or a Republican, I'm running as an American,\" Ryan said.",
    "Then the guy gets it, Trump doesn't even remember his name,\" Ryan added.",
    "After his speech, Ryan mingled with union workers in hard hats.",
    "But the expensive and contentious GOP race is wide open.",
    "Tyler Olson covers politics for Fox News Digital.",
    "Mandel,\" Trump said of his endorsement.",
    "\"It's who I am and where I come from.",
    "\"We're gonna win this race.",
    "The people of Ohio know me.",
    "Rob Portman, R-Ohio.",
    "\"J.P., right?",
    "J.D."
  ]
}