{
  "id": 5991,
  "mediaId": 124,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Vance works to lock up Ohio GOP Senate race as Trump-averse candidate rises",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-05/220502-vance-trump-mn-1435-5f1c90.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/vance-works-lock-ohio-gop-senate-race-trump-averse-candidate-rises-rcna26974",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1147,
    1577,
    1801,
    2027,
    3103,
    379,
    428,
    571,
    2845
  ],
  "sentences": [
    "I think in some ways, the media is trying to spin a narrative about Matt Dolans momentum because they want it to be a rejection of Donald Trump.?\nVance over the weekend had relied on Rep. Matt Gaetz, R-Fla., and Rep. Marjorie Taylor Greene, R-Ga.  both of whom are celebrities on the far right for their antagonistic personalities and incendiary rhetoric  to lead attacks on his top rivals.",
    "I mean, frankly, if I didnt know the whole story, Id go, This guy didnt win the race and put a lot of dough into it.?\nTimken, who found herself vastly outspent by other self-funding candidates and their super PACs, spent Saturday with Portman rallying a small group of supporters in Columbus.",
    "At a campaign event Monday afternoon in the Columbus suburb of Dublin, Vance took an indirect shot by referencing how his family rebranded the baseball team formerly known as the Indians amid concerns that the name was offensive to Native Americans.",
    "Many people may see it as stupid,? Mike Gibbons, an investment banker who has loaned his campaign more than $16 million, said of his investment Friday in an interview on his massive campaign bus, parked at a big-box shopping center near Cleveland.",
    "DUBLIN, Ohio  From the start, Ohios Republican Senate primary has been largely about former President Donald Trump  from the auditions for his endorsement to the test of its influence once he bestowed it upon Hillbilly Elegy? author J.D.",
    "I think this is all going to be about who shows up on Election Day,? Timken told reporters at her campaign headquarters, where a giant flag depicting Trump standing atop a tank with a rifle in hand hangs on a wall.",
    "It just doesnt feel right.?\nLeaning into the new competitive dynamics of the race, Dolan on Monday attacked Vance for campaigning with Gaetz, who is being investigated for sex trafficking, NBC News has reported.",
    "Mandel, whose right-wing rise in Ohio foreshadowed Trumps nationally, spent the final weekend campaigning with Sen. Ted Cruz, R-Texas, and insisting that he remained the true Trump conservative in the race.",
    "Mandel kind of looks like if the great Jim Jordan wrote a script for Matt Dolan to read,? Gaetz said Saturday at a stop in East Canton, referencing Jordan, the staunch Trump ally and congressman from Ohio.",
    "But with recent polls showing Timken in single digits, Sullivan over the weekend sent a text message to more than 50 of his friends and family members and encouraged them to join him in voting for Dolan.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nIm not worried about whos going to come in second or third,? Vance said afterward when asked if Dolan's rise concerned him.",
    "Dolan, whose family owns the Cleveland Guardians, has put more than $10 million of his money in his campaign and used it to air ads that focus on Trump-friendly policy issues such as border security.",
    "Frank Sullivan, a Cleveland-area business executive and the brother of Sen. Dan Sullivan, R-Alaska, had been a top contributor to and fundraiser for candidate Jane Timken, a former state GOP chair.",
    "When asked about the case Saturday, Vance suggested, according to The Columbus Dispatch, that criminal accusations are very often more about corrupt law enforcement?  a defense that Dolan blasted.",
    "Cruz, who famously told delegates to the 2016 Republican convention in Cleveland to vote your conscience? after losing the presidential nomination to Trump, offered similar sentiments Friday.",
    "For Dolan, the only major candidate who didnt seek Trumps endorsement, victory has always rested on a number of factors, including a split vote among those who appeal to similar voters.",
    "But I also have confidence that the voters of Ohio will make their own choice.?\nMeanwhile, two Republicans who have fallen in the polls spent the final days in more reflective moods.",
    "What youre seeing with Dolan is a natural surge that has been going on for a while, where people who didnt want Vance or Mandel are moving to Dolan as the alternative,? Hartley said.",
    "In a Trafalgar Group poll released Monday, 26 percent of likely GOP primary voters said they planned to vote for Vance, followed by 22 percent for Dolan and 21 percent for Mandel.",
    "Michael Hartley, a veteran GOP strategist in Ohio who is not affiliated with any of the campaigns, said he believes Trumps endorsement will be enough to carry Vance to a win.",
    "Sullivan, in an interview with NBC News, described Vance and Mandel as unprincipled? and said he remains a fan of Timken, who he believes would make a great? senator.",
    "Matts not the loudest guy out there, but maybe this country needs to get away from the loudest guy out there for a little bit.?\nDolan is no longer avoiding notice.",
    "We have the greatest ground game in this race.?\nPortman, who stood alongside Timken, paused for a beat when asked if he thinks Vance could win in November.",
    "Mandel?? Trump said while highlighting the contest Sunday night in Nebraska, confusing Vance with a top GOP rival, former state Treasurer Josh Mandel.",
    "But Dolans rivals, including other self-funders and candidates backed by big-spending super PACs, never deemed him worth their attention or money.",
    "Rob Portman, a Republican who decided against seeking a third term, is the first big test of Trumps clout in this years midterm elections.",
    "For Mandel, who once was the clear front-runner, it has been a scramble to stave off a loss that would jeopardize his political future.",
    "Dolan, Vance said, was bending the knee to the woke mob in this country.? (Dolan has said he had no involvement in the name change.)",
    "Look, everyone makes their own choices,? Cruz told reporters before he rallied with Mandel in the Cleveland suburb of Westlake.",
    "And the most recent polls suggest that a third candidate, state Sen. Matt Dolan, has emerged late as a threat to both.",
    "He's also the only GOP hopeful who has unequivocally rejected the lie that the 2020 election was stolen from Trump.",
    "For Vance, the home stretch has been a push to maximize Trumps endorsement and solidify a lead.",
    "The winner is likely to face Rep. Tim Ryan, the heavy front-runner in the Democratic primary.",
    "The flub compounded the heightened uncertainty that has clouded the race in its closing days.",
    "But Dolans strong finish? has shown a consolidation of more mainstream Republican voters.",
    "This country gave me everything I have, and if some people are saying, What an idiot ...",
    "So, naturally, Trump injected one last jolt of confusion ahead of Tuesday's primary.",
    "Im worried about whos going to come in first, and thats definitely going to be me.",
    "The results followed several polls last week that showed Dolan gaining ground.",
    "All the words are right, but theres just something wrong with the energy.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Gaetz has denied all accusations and not been charged with a crime.",
    "Polling suggests, unfortunately, shes not going to win,? he said.",
    "As they attacked each other, Dolan escaped any real attacks.",
    "That shift is evident among some prominent donors in Ohio.",
    "I think it was an honorable thing to do,? Gibbons added.",
    "I dont know why [Trump endorsed Vance].",
    "Weve seen that the turnout is low.",
    "Weve got an army of volunteers.",
    "Weve endorsed J.P., right  J.D.",
    "The race to succeed Sen.",
    "I dont know,? he said.",
    "I really dont know.\"",
    "Vance."
  ]
}