{
  "id": 5995,
  "mediaId": 237,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Trump critic Matt Dolan catapults to second in eleventh-hour Ohio GOP Senate poll",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/b6261b9/2147483647/strip/true/crop/3000x1575+0+212/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F20%2F4d%2Ff5be1f3d4b09b10198a09614ba7c%2Fap22077086538000.jpg",
  "link": "https://www.washingtonexaminer.com/news/trump-critic-matt-dolan-catapults-to-second-in-11th-hour-ohio-gop-senate-poll",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan King",
  "authorUrl": "https://www.washingtonexaminer.com/author/ryan-king",
  "termIds": [
    3103
  ],
  "sentences": [
    "New polling from the conservative Trafalgar Group released one day before the primary pegs Dolan in second place with 22%, marking a striking ascension for a candidate who has polled in fourth and fifth place for much of a race that has been long dominated by rivals embracing former President Donald Trump.",
    "Many people dont care who out-of-state people think should represent Ohio, but that Ohioans should decide for themselves who speaks for them in Washington,\" former state Sen. Mark Wagoner said in a tweet retweeted by Dolan.",
    "Such is the case for Matt Dolan, who I dont know, have never met, and may be a very nice guy, but the team will always remain the Cleveland Indians to me,\" Trump declared in a message posted by his Save America PAC.",
    "Trump's endorsement of Vance came late, just weeks ago, but it has propelled the Hillbilly Elegy author to the forefront of the crowded Republican field, which had been dominated by Mandel and Gibbons.",
    "\"Anybody who changes the name of the 'storied' Cleveland Indians (from 1916), an original baseball franchise, to the Cleveland Guardians, is not fit to serve in the United States Senate.",
    "Even though Trump endorsed Vance, many of his high-profile allies, including Sen. Ted Cruz (R-TX) and retired Lt. Gen. Michael Flynn, have been steadfast in their support of Mandel.",
    "Still, Dolan has been supportive of many Trump-style conservative policies, even sporting a #OhioFirst hashtag on his Twitter account, similar to Trump's famous catchphrase.",
    "Unabashed Trump critic Matt Dolan appears to be gaining last-minute steam in his bid to clinch the Republican nod to fill the Ohio Senate seat being vacated by Rob Portman.",
    "Im the only one trying to act on the Republican agenda.?\nHis surge in the last-minute poll appears to be fueled in part by undecided voters flocking to him.",
    "Additionally, Dolan seemingly benefits from a splintering effect within the MAGA base of voters that have to choose between several Trump-style contenders.",
    "Dolan was the only candidate on the March 21 debate stage who raised his hand when asked by a moderator if Trump should stop dredging up the 2020 election.",
    "The gain is welcome news for Dolan, who has long sat near the bottom of the pack, but it may come too late for him as voters head to the polls Tuesday.",
    "What they're missing is they're all trying to emulate President Trump's style but not just focus on the substance of what President Trump did.",
    "The poll was conducted between April 29 and May 1 among 1,081 likely Republican voters, with a margin of error of about 3 percentage points.",
    "They were all running for President Trumps endorsement,? Dolan told the Washington Examiner last month about his GOP primary rivals.",
    "Vance leading the pack at 26%, followed by Dolan, Josh Mandel at 21%, Mike Gibbons at 13%, undecided at 9%, and Jane Timken at 6%.",
    "But he has been critical of the former president's antics and refrained from embracing the man behind the \"MAGA\" movement.",
    "In early March, a Fox News poll that surveyed 918 primary voters found that 24% of primary voters were undecided.",
    "Dolan, who is serving in the state Senate, has been undeterred from levying criticism against Trump.",
    "The former president said last fall that Dolan is \"the one person in the race I won't be endorsing.\"",
    "Tuesday will mark the first of many tests of the former president's clout in the midterm cycle.",
    "Taking note of Dolan's apparent rise, Trump swiped at him in a statement last Tuesday.",
    "Vance currently touts a 3.5% lead in the RealClearPolitics aggregate of polls.",
    "On the Democratic side, Rep. Tim Ryan is poised to emerge the victor.",
    "\"Seeing a big momentum shift for Matt Dolan in the last 72 hours.",
    "Getting a lot [of] text messages and phone calls.",
    "I think they ran a campaign for one person.",
    "The poll found Trump-backed J.D.",
    "The feeling is mutual."
  ]
}