{
  "id": 5997,
  "mediaId": 169,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Marjorie Taylor Greene jumps in the middle of heated Ohio GOP primary race",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/05/josh-mandel-marjorie-taylor-greene-0502221.jpg",
  "link": "https://www.salon.com/2022/05/02/marjorie-taylor-greene-jumps-in-the-middle-of-heated-ohio-primary-race/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.salon.com/writer/jon-skolnik",
  "termIds": [
    3103
  ],
  "sentences": [
    "Vance says Big Tech data collection should be \"illegal\"  but set to profit from it\nhttps://twitter.com/JDVancePress/status/1520738181251010562\nAccording to an Emerson poll, the author and venture capitalist has the support of 26% of Ohio's primary voters, with Josh Mandel (24%), Matt Dolan (21%), and Mike Gibbons (17%) trailing behind.",
    "Vance has not always been MAGA-friendly despite winning the president's imprimatur  a point that was brought into sharp relief last month when Vance's former roommate, Georgia state Rep. Josh McLaurin, who published an online exchange between the two of them from 2016.",
    "https://twitter.com/JDVancePress/status/1520454334626283520\nThe event comes just weeks after Donald Trump gave Vance his formal endorsement, putting to rest months of anticipation over who the former president would support in the state's primary.",
    "\"I go back and forth between thinking Trump is a cynical asshole like Nixon who wouldn't be that bad (and might even prove useful) or that he's America's Hitler,\" Vance wrote to McLaurin at the time.",
    "Rep. Marjorie Taylor Greene, R-Ga., on Saturday said that she was tired of Republicans like U.S. Senate candidate Josh Mandel, who \"learned to speak MAGA and just repeat it over.\"",
    "\"I watched the debates and Josh Mandel sort of looks like if you asked Matt Dolan to read talking points written by Jim Jordan,\" Gaetz said.",
    "Vance, one of Mandel's opponents from Ohio, and was attended by Vance himself and Rep. Matt Gaetz, R-Fla., who echoed Greene's remarks.",
    "That same year, Vance wrote in a USA Today column that \"Trump's actual policy proposals\" are \"immoral to absurd.\"",
    "We don't want those people serving in Congress,\" she said during a rally in Newark, Ohio.",
    "He has also called the former president \"reprehensible\" in since-deleted tweets.",
    "I just saw someone that learned to speak MAGA and just repeat it over and over.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "\"All the words are right, but something just doesn't look correct.\"",
    "The event was organized as an endorsement of Senate candidate J.D.",
    "He will be conservative,\" Trump said in a statement last month.",
    "\"He will do what you want and he's not going to let you down.",
    "\"It was my great honor and distinction to endorse J.D.",
    "He loves your state, and that's why I went for him.",
    "\"For Josh Mandel, I didn't see the sincerity there.",
    "Subscribe to our morning newsletter, Crash Course.",
    "\"We don't want those people in Washington.",
    "So on May 3rd, go out and vote for J.D.",
    "And so that's why I endorsed J.D.",
    "I didn't see the authenticity.",
    "I'm tired of those candidates.",
    "\"How's that for discouraging?\"",
    "He's going to be terrific.\"",
    "Vance for the U.S. Senate.",
    "He was a great student.",
    "RELATED: Trump pal J.D.",
    "He will be strong.",
    "He was a warrior.",
    "[Vance].\"",
    "Vance.",
    "."
  ]
}