{
  "id": 6009,
  "mediaId": 195,
  "date": "d2022-05-02T12:55",
  "headline": "Trump fumbles JD Vances name at rally",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/MR_trumpdonald-vancejd_042422_ap-joe-maiorana.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/blogs/blog-briefing-room/news/campaigns/3473563-trump-fumbles-jd-vances-name-at-rally/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Dress",
  "authorUrl": "https://thehill.com/author/brad-dress/",
  "termIds": [
    946,
    1054,
    1147,
    2027,
    2466,
    2495,
    3103,
    428,
    2845
  ],
  "sentences": [
    "And lets see what happens.?\nAfter Trump endorsed him last month, Vance enjoyed a large bump in the U.S. Senate primary, leading the pack against Mandel, investment banker Mike Gibbons, Ohio state Sen. Matt Dolan (R) and former Ohio Republican Party Chairwoman Jane Timken.",
    "He is our best chance for victory in what could be a very tough race.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,? Trump said in a statement after he endorsed him.",
    "A number of Republicans had opposed Vance, the author of the book Hillbilly Elegy,? for his comments criticizing Trump ahead of his 2016 bid for the White House.",
    "Vance, the Republican candidate he endorsed in Ohios U.S. Senate race, during a rally on Sunday, a gaffe one of Vances primary opponents quickly seized upon.",
    "Gibbons released an email shortly after the rally, calling Trumps mistake an indication the former president does not hold Vance in high esteem.",
    "Even after his endorsement, JD Vance is clearly irrelevant to President Trump, so much so he botched Vances name at his rally today in Nebraska.",
    "When he mentioned the candidates hes endorsed, Trump confused Vance with Josh Mandel, another candidate in Ohios Republican primary.",
    "Trump spoke at Greenwood, Nebraska, in support of Republican gubernatorial candidate Charles Herbster.",
    "Theyre all doing good,? the former president told thousands of rallygoers.",
    "Trump, however, was willing to put those comments behind him.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Quite the ringing endorsement, eh?? Gibbons asked.",
    "Former President Trump fumbled the name of J.D.",
    "Mandel, and hes doing great.",
    "Weve endorsed J.P.  right?",
    "Like some others, J.D.",
    "J.D."
  ]
}