{
  "id": 6010,
  "mediaId": 558,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "What to know about Tuesday's big Republican primary in Ohio",
  "image": "https://s.yimg.com/ny/api/res/1.2/bRRyPR6glQnnz4trIKDKCQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTM5NztjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2022-05/29b17560-ca46-11ec-afff-1c339e833947",
  "link": "https://news.yahoo.com/what-to-know-about-tuesday-big-republican-primary-in-ohio-192837293.html",
  "sentiment": "0.403",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom LoBianco",
  "authorUrl": "https://www.yahoo.com/author/tom-lobianco",
  "termIds": [
    781,
    946,
    1054,
    1147,
    1710,
    1801,
    2027,
    3103,
    428,
    2845
  ],
  "sentences": [
    "The battle for the Republican nomination for U.S. Senate in Ohio, which will conclude with Tuesdays primary there, is one of this years marquee political contests  in part because it will serve as a key test of former President Donald Trumps influence over the GOP.",
    "Its a race where none of the candidates ever really separated from the field, or articulated a message that resonated,? said former Ohio Republican Party Chairman Matt Borges, who is not currently backing any particular candidate.",
    "He gave it, ultimately, and that may make the difference with an otherwise unremarkable primary election.?\nThe winning Republican on Tuesday is likely to face Rep. Tim Ryan, a moderate Democrat, in Novembers general election.",
    "Dolan hopes to benefit from a late surge of interest from voters repelled by Mandel and Vance, two erstwhile moderates who have moved well to the right in an effort to court Trump supporters.",
    "Meanwhile, the lone candidate in the primary to openly break with Trump is state Sen. Matt Dolan, who has repeatedly pushed back against the former presidents lies about the 2020 election.",
    "A series of polls taken over the last few weeks, following Trumps endorsement of Vance, have found Vance jumping to the front of the pack, but not breaking away from it.",
    "But Vance and his top opponent, former state Treasurer Josh Mandel, have been running neck and neck for so long that Trump appeared to confuse the two over the weekend.",
    "Dolan, whos garnered more national interest since pulling close with Mandel and Vance, spent the weekend knocking on doors with campaign volunteers, according to .",
    "Cruz, during a separate stop in support of Mandel, mocked Republicans who invoke Trumps name in an effort to win voters.",
    "Rob Portman is one of a handful of contests across the country that will determine which party controls the Senate.",
    "Instead, Vance, Mandel and Dolan appear to be effectively tied, with businessman Mike Gibbons right behind them.",
    "And Mandel spent his closing weekend in the race touring the state with Republican Texas Sen. Ted Cruz.",
    "Vance, a venture capitalist and author of the bestselling memoir Hillbilly Elegy,? three weeks ago.",
    "I have Donald Trump tattooed on my rear end!? , to scattered laughs from a crowd in Dayton.",
    "Every candidate says, I love Donald Trump. No, no, no, I love Donald Trump more! No, no!",
    "So in the end it came down to Trumps approbation, which is always a one-way street.",
    "Cruz and Mandel visited a church in Toledo and in a small arcade-style game.",
    "Vance, meanwhile, with and during his final leg of the primary campaign.",
    "Theyre all doing good,? Trump said Saturday at a rally in Nebraska.",
    "The race to replace retiring Republican Sen.",
    "Mandel, and hes doing great.",
    "Weve endorsed J.P., right?",
    "Trump endorsed J.D.",
    "J.D."
  ]
}