{
  "id": 6011,
  "mediaId": 169,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "\"JP, right? JD Mandel?\": Trump can't seem to remember who he endorsed in Ohio's GOP Senate primary",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/05/jd-vance-donald-trump-0502221.jpg",
  "link": "https://www.salon.com/2022/05/02/jp-right-jd-mandel-cant-seem-to-remember-he-endorsed-in-ohios-senate-primary/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.salon.com/writer/jon-skolnik",
  "termIds": [
    3103
  ],
  "sentences": [
    "RELATED: \"Go f**k yourself\": Trump and Don Jr. war with top GOP donor who bought ads opposing his candidate\nDays before that endorsement, a Georgia House lawmaker revealed that, in 2016, Vance had regarded Trump \"America's Hitler.\"",
    "The brief slip-up was made on Sunday, during an event at the I-80 Speedway in Greenwood, Nebraska, where the former president failed to distinguish between conservative candidates Josh Mandel and J.D.",
    "Shortly after boasting about his cognitive abilities at a rally this past weekend, Donald Trump appeared to confuse the names of two candidates from Ohio running for U.S. Senate.",
    "\"Once and for all, Joe Biden should put the question to rest by taking a cognitive test ... releasing the results for the entire world to see,\" the former president said.",
    "This past weekend, Trump fell back into this pattern, calling himself \"perfect specimen\" and repeatedly casting doubt over President Biden's mental faculties.",
    "\"In the great state of Ohio, the candidate most qualified and ready to win in November is JD Vance,\" the president said in a statement at the time.",
    "\"We have a president who has no idea what's happening, who is shaking hands with the air, while Putin talks about nuclear weapons all the time.\"",
    "The rally was organized in support of a Nebraska gubernatorial candidate Charles Herbester, who has been accused of groping by multiple women.",
    "Vance also boasts endorsements from Rep. Marjorie Taylor Greene, R-Ga., Rep. Jim Banks, R-India., and Sen. Josh Hawley, R-Missouri.",
    "Throughout the years, Trump has constantly touted his supposed intelligence, at one point calling himself a \"very stable genius.\"",
    "Vance was previously a strong opponent of Trump during the former president's first presidential campaign.",
    "In fact if I went by that standard I don't think I would have ever endorsed anybody in the country.\"",
    "During his campaign event, Trump acknowledged Vance's past remarks but ultimately downplayed them.",
    "In fact, Trump has only backed Vance, an endorsement that came last month.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "\"He's a guy that said some bad shit about me,\" Trump said.",
    "Subscribe to our morning newsletter, Crash Course.",
    "They're all doing good,\" Trump said.",
    "Every one of the others did also.",
    "JD Mandel, and he's doing great.",
    "We've endorsed JP, right?",
    "It is all about winning!\"",
    "\"We've endorsed Dr. Oz.",
    "\"We cannot play games.",
    "But you know what?",
    "\"He did.",
    "He did.",
    "Vance."
  ]
}