{
  "id": 6015,
  "mediaId": 195,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "The Hills Morning Report  Congress seeks Ukraine aid deal, but how?",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/MR_capitol_022122_ap-patrick-semansky-.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/morning-report/3473515-the-hills-morning-report-congress-seeks-ukraine-aid-deal-but-how/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    1335,
    1341,
    1501,
    1938,
    2087,
    3103,
    3692,
    511,
    3624,
    2744,
    2942
  ],
  "sentences": [
    "The former president has called the Kentucky conservative Old Crow? and in a written statement on Sunday said, Mitch McConnell and his RINO friends would rather see a Democrat like Biden be president than a Republican like me.? McCarthy has been a conspicuous flip-flopper, initially critical of the former presidents role in the Jan. 6 attack on the Capitol but subsequently eager to enlist Trumps help to try to gain the House majority.",
    "However, pairing the two legislative packages together would undoubtedly be a more time consuming process if the goal is to pass Ukraine aid right away as Republicans have promised a fight over the $10 billion COVID-19 proposal without a vote on an amendment vote related to Title 42.\nIn order to get the 60 votes they need, I think the strategy for the Democrats should be to split them.",
    "Our delegation traveled to Kyiv to send an unmistakable and resounding message to the entire world: America stands firmly with Ukraine,? Pelosi and the six other House members said in a statement following their meeting, adding that Zelensky told the delegation of the clear need? for military and humanitarian aid in order to combat Russian President Vladimir Putins continued push.",
    "THE CLOSER\nAnd finally  g?g?g? Heres a positive trend that expands equity, prepares young people for real life, and tackles subjects that can improve career ambitions, wealth creation and economic know-how: 13 states now require courses in personal financial literacy for high school students and Georgia is the latest state to embrace the benefits.",
    "There are many differences between Senate Minority Leader Mitch McConnell (R-Ky.) and House Minority Leader Kevin McCarthy (R-Calif.), but one of the biggest is how they approach Trump, the de facto leader of their party who lost the 2020 presidential election and falsely told his supporters he won.",
    "Rep. Michael McCaul (Texas), the top Republican on the House Foreign Affairs Committee, added that the new round of aid could allow Ukrainians to drive Russian forces out of eastern Ukraine, an area Putin has prioritized after shifting attention away from taking over Kyiv (The Wall Street Journal).",
    "Ukraine said on Sunday that Russia cut off all mobile connection and internet services in the Kherson region, According to Ukraines defense ministry, Russia has sought to legitimize its control of the city and surrounding areas through installing a pro-Russian administration? (Bloomberg News).",
    "IN FOCUS/SHARP TAKES\n? ADMINISTRATION\nHomeland Security Secretary Alejandro Mayorkas on Sunday defended the governments preparations since last year for this months planned lifting of immigration restrictions known as Title 42, adopted by the Trump administration during the pandemic.",
    "Only days earlier, Pelosi threw her support behind attaching the two packages, with an administration official telling reporters last week that the strategy certainly makes sense.?\nI dont think it does,? Kaine said when asked if the two priorities need to be paired together.",
    " The New York Times: European Union countries are likely to approve as early as this week a phased embargo on Russian oil, officials say, sealing a long-postponed measure that has divided the blocs members and highlighted their dependence on Russian energy sources.",
    "In the past 12 months, Florida, Nebraska, Ohio and Rhode Island have passed similar laws and are in the process of implementing them for all students, and Georgias move, more than 35 percent of students in the U.S. will have access to a financial literacy class.",
    "That there is no help from Ukraine, that Ukraine doesnt care about you,? Ukrainian dance instructor Nazar Shashkov said while describing trips he made into and out of Mariupol with his van to rescue his students and others trapped in the southern port city.",
    "Lawmakers say they will work this week to get bipartisan agreement to send billions of dollars in additional aid to Ukraine, underscored by Speaker Nancy Pelosis (D-Calif.) surprise Saturday visit to Kyiv to meet with Ukrainian President Volodymyr Zelensky.",
    " Fox 5 Atlanta: Grand jury selection begins today in Fulton County, Ga., to decide if Trump and others broke the law in trying to overturn 2020 election results, including pressuring Raffensperger (recording of Trump phone call on Jan. 2, 2021, is HERE).",
    "The percentage of Americans who have received third or booster doses is 29.9.\n? STATE WATCH\nWestern states are gearing up for another devastating wildfire season as blazes sweep through New Mexico and threaten Arizona, reports The Hills Reid Wilson.",
    "? POLITICS\nGOP primaries kick off Tuesday in Indiana and Ohio, setting the stage for fresh political forecasts for Novembers outcome and an actual gauge of whether candidate endorsements by former President Trump carry the punch he thinks they do.",
    "The Hills Jordain Carney reports that Republican senators, feeling optimistic about their chances of being in the majority next year but also wary of the known unknowns, worry the party could somehow wrest defeat from the jaws of victory.",
    "Another issue expected to be tackled in the upcoming aid package is the U.S.s ability to seize assets and money held by Russian oligarchs and redirect that money to Ukraine, according to Senate Majority Leader Charles Schumer (D-N.Y.).",
    "As of today, 76.8 percent of the U.S. population has received at least one dose of a COVID-19 vaccine and 65.5 percent is fully vaccinated,? according to the Bloomberg News global vaccine tracker and the governments definition.",
    "Heres what else were watching this week:\nThe Federal Reserve will launch a series of interest rate hikes on Wednesday to try to calm inflation, while the government on Friday will report still strong U.S. employment in April.",
    "As for the White Houses response, Biden on Tuesday will travel to Alabama to visit a Lockheed Martin facility producing Javelin anti-tank weapons systems the administration is sending to Ukraine to help their cause.",
    "OPINION\n The courage required to confront inflation, by The New York Times editorial board.https://nyti.ms/3y6Pdvu\n America must work harder for homegrown talent, by Adrian Wooldridge, Bloomberg Opinion contributor.",
    "In six states, unusual cases of pediatric hepatitis worry physicians, but there is (as yet) no known cause, although COVID-19 is unlikely the answer to the mystery, according to experts (Bloomberg News).",
    "And they are removed if they do not have a valid claim under our law to remain.?\nThe secretary said his agency is preparing for as many as 18,000 migrants daily after the lifting of Title 42 (The Hill).",
    "Ukraine needs all the help it can get and, at the same time, we need all the assets we can put together to give Ukraine the aid it needs,? Schumer told reporters on Sunday in New York City (Reuters).",
    "While Moscow has struggled to impose its will across Ukraine, one place it has succeeded in is Kherson, one of the first major cities to fall to Russian forces following the late-February invasion.",
    "Most of Bidens travel has been done to promote domestic issues or for campaign purposes, making Tuesdays trip an unusual move, as he will highlight the administrations foreign policy machinations.",
    "Congressional Republicans and some Democrats who recall past migrant surges at the U.S. southern border and have questioned Mayorkas and other administration officials say they are dubious.",
    "The White House daily press briefing is scheduled at 2:30 p.m.\ng Hill.TVs Rising? program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    "ELSEWHERE\n? CORONAVIRUS\nU.S. COVID-19 cases are on the rise, but the statistics likely reflect an undercount because of the use of at-home antigen tests, whose results may not be reported.",
    "The first lady will deliver remarks at 11 a.m. at the Metropolitan Museum of Arts press launch for In America: An Anthology of Fashion,? the museums spring Costume Institute exhibition.",
    " C-SPAN: An 11 a.m. debate takes place today among four Republicans vying for the partys nomination in the Georgia secretary of state contest, including incumbent Brad Raffensperger.",
    "Sen. Tim Kaine (D-Va.), a member of the Senate Armed Services Committee, told CBSs Face the Nation? that Ukraine aid and COVID-19 relief do not need to be combined in a single bill.",
    "? IN THE KNOW\nThe White House Correspondents Association Dinner came and went Saturday, marking the first time the annual event was held since 2019 because of COVID-19 precautions.",
    "The Hills team had all bases covered, from The Daily Show? host Trevor Noahs comedic set to all of the pre- and post- parties across Washington meant to honor the First Amendment.",
    "More Americans trust Republicans than Democrats when it comes to crime (47 percent) and immigration (43 percent), according to a Washington Post/ABC News poll released on Sunday.",
    "Republican candidates in this election year are making immigration, crime and border security key themes in outreach to voters, particularly in GOP-controlled border states.",
    "The president receives the Presidents Daily Brief at 10:15 a.m. Biden will present the Presidential Rank Awards to federal employees during a virtual ceremony at 1:45 p.m.",
    "Included in that request is $20 billion in proposed security and weaponry funding, $8.5 billion in economic aid, and an additional $3 billion in humanitarian assistance.",
    " The Hill: Pelosi after Zelensky meeting: Do not be bullied by bullies.?\n The Hill: Pelosi secret visit to Ukraine highlights expanse  and limitations  of U.S. support.",
    "Everything about Chinas zero-COVID? policy seems to be making news, in part because the nations efforts have been unsuccessful at stopping transmission in major cities.",
    "Trump has not lashed out at McCarthy, despite recent taped revelations in which the minority leader said just days after Jan. 6 that he thought Trump should resign.",
    " Associated Press / Ukrainian Presidential Press Office | Speaker Nancy Pelosi, Ukrainian President Volodymyr Zelensky and House members in Kyiv on Saturday.",
    "Mayorkas told Fox News Sunday? that his department is prepared and has worked effectively with Customs and Border Protection and other partners (The Hill).",
    "Approximately 100 people were taken from a steel plant in the besieged port city to Zaphorizhzhia, a Ukrainian-controlled location along the Dnipro River.",
    "According to some video posted by Ukrainian forces, the civilians, mostly elderly citizens, women and children, were evacuated from the Azovstal plant.",
    "McCarthy and other conservatives recently traveled to the border to underscore their misgivings about Biden administration management and policy.",
    "Pelosi, joined by six House Democrats, told Zelensky the U.S. will stand shoulder to shoulder with Ukrainians until they defeat Russian forces.",
    "Although the House is out of town this week, the Senate will work on President Bidens request for $33 billion in aid for the war-torn nation.",
    "The eleventh-hour involvement of GOP heavyweights  including Trump  raised plenty of tensions and forced the primary into volatile territory.",
    " What happens now is individuals are either expelled under the Title 42 authority or they are placed in immigration enforcement proceedings.",
    "The Senate convenes at 3 p.m. and resumes consideration of the nomination of Joshua Frost to be an assistant secretary of the Treasury.",
    "Today, for the first time in all the days of the war, this vitally needed (humanitarian) corridor has started working,? Zelensky said.",
    "Many have accused Russian forces of shelling routes that negotiators have agreed to serve for evacuations (The Associated Press).",
    "Do not come,? Mayorkas told CNN when asked for his message to migrants, which echoed a June warning by Vice President Harris.",
    "The tapes corroborate information in a new book by New York Times political reporters titled This Will Not Pass? (The Hill).",
    "Thats more than double the share of students with access to such coursework in 2018, according to Next Gen Personal Finance.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "On Sunday, Russia replaced the hryvnia (Ukraines national currency) with the ruble as the official currency in the city.",
    "For weeks, Ukrainian officials have had issues moving people from the ravaged city, where heavy fighting has raged on.",
    "McCarthy has said Mayorkas could become a target for impeachment if Republicans win control of the House next year.",
    "Hospitalizations have increased, but serious illness is less of a worry for most adults (The Wall Street Journal).",
    "Current average U.S. COVID-19 daily deaths are 308, according to the Centers for Disease Control and Prevention.",
    "Our delegation proudly delivered the message that additional American support is on the way,? Pelosi continued.",
    "President Xi Jinping admits no doubts about Chinas current approach to the coronavirus (The New York Times).",
    "Total U.S. coronavirus deaths reported as of this morning, according to Johns Hopkins University: 993,733.",
    "Bidens job approval is 42 percent, according to the survey, a slight improvement over the past two months.",
    " The New York Times: Biden received early warnings that immigration and inflation could erode his support.",
    " The Hill: Ex-NATO commander: Loss of top Russian officers amid invasion unprecedented in modern history.",
    " Bloomberg News: In response to sanctions, Russia is ending its work on the International Space Station.",
    " If they want to get 10 Republicans, the best way to do that is to separate them,? Sen. John Thune (S.D.",
    "The Mariupol City Council added that more evacuations will continue today from other parts of the city.",
    "Zelensky said in a pre-recorded address on Sunday that the evacuees will arrive in Zaphorizhzhia today.",
    "The president and first lady Jill Biden will host an Eid al-Fitr reception at the White House at 4 p.m.",
    "https://bloom.bg/3y5Vl7i\nWHERE AND WHEN\nThe House meets for a pro forma session at 10 a.m. on Tuesday.",
    "Recession is not out of the question amid the jumbled forecasts for the U.S. economy (Yahoo Finance).",
    "Similar legislation in South Carolina, Michigan, Minnesota and New Hampshire is percolating (CNBC).",
    " The Associated Press: Evidence mounts of GOP involvement in Trumps presidential election schemes.",
    "The procedure where you put bills together or separate them is quirky and sometimes unpredictable.",
    " Reuters: Trump faces the biggest test of his king-maker? clout since leaving the White House.",
    "Theres support within Schumers caucus for linking them, as The Hills Jordain Carney notes.",
    "Follow us on Twitter (@alweaver22 & @asimendinger) and suggest this newsletter to friends!",
    "LEADING THE DAY\n? UKRAINE CRISIS\nSome civilians were evacuated from Mariupol on Sunday.",
    " The Hill: Is the Justice Departments Jan. 6 investigation building toward Trumps role?",
    "Vance, the former state treasurer Josh Mandel and self-funded businessman Mike Gibbons.",
    " The Washington Post: Six months before crucial midterms, Biden faces many challenges.",
    "Related Articles\n The Hill: Housing investments at risk as Build Back Better withers.",
    " The Associated Press: Trumps bid to shape GOP faces test with voters in May races.",
    "We should do them together or separately, but we shouldnt wait around? (The Hill).",
    "g? Introducing NotedDC, The Hills curated commentary on the beat of the Beltway.",
    " The Wall Street Journal: Russia recasts fight in Ukraine as war with the West.",
    " The New York Times: Once soft-spoken, Ohio conservatives embrace the bombast.",
    "Rob Portman (R) has been brewing for months, writes The Hills Max Greenwood.",
    " The Hill: Russias cyber warfare against Ukraine more nuanced than expected.",
    "McConnell makes no moves to curry favor with Trump, publicly or privately.",
    "Shanghai residents are protesting the lockdowns (The Wall Street Journal).",
    "Asa Hutchinson (R), at odds with Trump, eyes 2024 U.S. presidential run.",
    "In Ohios GOP Senate race, a Republican slugfest to succeed retiring Sen.",
    "The main question centers on how the package will move through Congress.",
    "Beijing shuttered Universal Studios and banned restaurant dining (CNN).",
    " Axios: Mariupol steel plant evacuees recount dire scenes in bunkers.",
    "Travel is restricted, and lockdowns continue (The Associated Press).",
    "The Hill: Sen. Michael Bennet (D-Colo.) tests positive for COVID-19.",
    " Associated Press / Elise Amendola |$20 bills being counted, 2018.",
    " Associated Press / Joe Maiorana | Former President Trump and J.D.",
    "Infections among senators last week delayed some Senate business.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The Russian military tells them that Ukraine left them there.",
    "The secretary on Sunday shrugged off the threat (The Hill).",
    "The race features author-turned-venture capitalist J.D.",
    "He plans to quarantine in Denver and work virtually.",
    "Click here to subscribe to our latest newsletter.",
    "She will tour the exhibit with museum interns.",
    "Also, check out the Rising? podcast here.",
    "Email: Alexis Simendinger and Al Weaver.",
    "Stay Engaged\nWe want to hear from you!",
    "2 Senate Republican, said recently.",
    "Because our border is not open.",
    "I was terrified? (NBC News).",
    " Reuters:Arkansas Gov.",
    "We need Ukraine aid.",
    " We need COVID aid.",
    "Theres no buses.",
    "Vance, April 23.",
    "), the No.",
    "ET."
  ]
}