{
  "id": 6018,
  "mediaId": 376,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "What to watch in Tuesdays primaries in Ohio and Indiana",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/04/GettyImages-1240191090.jpg?fit=1240,698",
  "link": "https://www.rollcall.com/2022/05/02/what-to-watch-in-tuesdays-primaries-in-ohio-and-indiana/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephanie Akin\nJessica Wehrman",
  "authorUrl": "https://www.rollcall.com/author/stephanie-akin/",
  "termIds": [
    648,
    1147,
    1801,
    2524,
    3103,
    4169,
    4620,
    4766,
    571,
    2710,
    2845
  ],
  "sentences": [
    "Sodrel has the support of the far-right group House Freedom Action, which has spent $168,000 supporting him and $42,000 opposing Houchin, including in television ads attacking her as a career politician.?\nHouchin has benefited from $448,000 in support from American Dream Federal Action, a PAC launched this spring with a $4 million investment from bitcoin entrepreneur Ryan Salame, who said the PAC would have a broader focus on national and economic security, in addition to cryptocurrency, according to news reports.",
    "Both Barnes-Israel and Sodrel have been the subject of local news reports questioning whether they truly lived in the district after they changed the addresses on their voter registration shortly before launching their campaigns.That would not disqualify them from running but could open them to criticism that they do not have strong enough roots in the district.",
    "Democrats are hopeful that the seven-way GOP primary and the nasty nature of the race  Gibbons and Mandel nearly came to fisticuffs during one debate  will give an edge to Senate candidate Tim Ryan, a 10-term Democratic member of the House who ran for president in 2020 and has had repeatedly flirted with statewide candidacies.",
    "But that endorsement came at a price: Vance now has a target on him, and theres been some backlash from Republicans  especially the anti-tax Club for Growth, which is backing former state Treasurer Josh Mandel  who are filling the airwaves with ads highlighting Vances harsh 2016 criticism of Trump.",
    "Timken herself bankrolled $3.5 million of the $7.9 million her campaign has amassed so far, but that amount is paltry compared to the $16.7 million Cleveland-based businessman Mike Gibbons contributed to his own campaign, which has amassed $17.7 million in total.",
    "Most of that is aimed at Republican state Sen. Theresa Gavarone, who has received $100,000 of support from Defending Main Street SuperPAC Inc., while $353,000 was spent against Gavarone by Northwest Ohio Freedom Fund PAC and Drain the DC Swamp PAC.",
    "Rep. Bob Gibbs abrupt April 6 decision to drop his reelection bid because his district pitted him against former Trump aide and fellow Republican Max Miller is reflective of one of the fundamental truths of this election season: Its a giant mess.",
    "Barnes-Israel has benefited from $890,000 in outside support, most of it from a PAC called Hoosier Values, which has been running ads calling Barnes-Israel battle-tested? and a conservative outsider.? He is endorsed by Arkansas Sen. Tom Cotton.",
    "But seven Republicans are vying for the nomination, including Madison Gesiotto Gilbert, a former Miss Ohio USA who has received Trumps endorsement, former Sen. Tim Scott aide Shay Hawkins, Janet Floger Porter, Ryan Saylor and Gregory Wheeler.",
    "Theres a lot of mail and a lot of TV to get the attention of the people who are going to participate, but you certainly dont see a lot of folks trying to register voters, you dont see a lot of folks trying to bank early absentee applications.",
    "In a matter of a few years, Ohio has gone from a true swing state (Democrat Barack Obama won in 2012 with 50.7 percent of the vote) to a safe, Trump-allied red state (Trump won with 53 percent in 2020; he received only 52 percent in Texas).",
    "Sodrel almost exclusively funded his campaign with a $725,000 loan, allowing him to spend more than twice as much as the next highest fundraiser, Erin Houchin, a 46-year-old former state senator who was regional director for Sen. Dan Coats.",
    "Another competitive House primary is a rematch between Ohio state Sen. Nina Turner, a progressive firebrand who was one of Vermont Sen. Bernie Sanders key surrogates during his presidential runs, and Rep. Shontel Brown in the 11th District.",
    "Mike Sodrel, 77, a Republican trucking company owner who waged five congressional campaigns in Southern Indiana in the 2000s and won once, is trying again Tuesday in the race for the nomination to replace retiring Rep. Trey Hollingsworth.",
    "A series of weekly congressional primaries in May starts Tuesday in Ohio and Indiana, and the outcomes over the coming weeks will help settle or add fuel to the debate over how influential a kingmaker former President Donald Trump is.",
    "But a super PAC that spent an additional $11.8 million through April 25 supporting him, Protect Ohio Values, was mainly funded by Thiel, who donated $10 million in March 2021 and an additional $3.5 million after Trumps endorsement.",
    "May 3 will be the first of two primaries: Federal judges have set May 28 as the deadline for Ohio's leaders to resolve problems with voting district maps so the state could hold an Aug. 2 primary for state House and Senate races.",
    "In Ohio's 9th District, 20-term Democratic Rep. Marcy Kaptur faces what could be her most competitive race ever, and outside groups have spent a combined $1 million trying to sway voters on the GOP nominee.",
    "They'll also settle the matchups for races in the fall that will decide control of the House and Senate, even though in some cases  Ohio's especially  district maps are the subject of ongoing court battles.",
    "The Drain the Swamp fund, which backs Trump, has also spent $200,000 supporting Air Force veteran J.R. Majewski, who now works in the nuclear power industry, and $79,000 against state Rep. Craig Reidell.",
    "Each has spent the final weeks of the campaign attacking the others conservative credentials and commitment to Trump in television ads and other media, an indication the campaigns see the race as close.",
    "Theres just not a lot of energy.?\nVances campaign raised $2.52 million, but in the period from April 1 to 13, it took in just $911  a figure that likely jumped after he got the Trump nod on April 15.",
    "Paul Beck, an emeritus political science professor at The Ohio State University, said theres still a chance that federal courts could come back and say the districts are unconstitutionally drawn.",
    "Outside spending is also strongly running in Brown's favor, with more than $1 million alone spent to support her by Protect Our Future PAC, a group funded in part by a cryptocurrency billionaire.",
    "Vance drew boos as well as cheers during his first onstage appearance after the Trump endorsement, and Ohio Democratic consultant Dale Butland said Vance isnt necessarily beloved by the GOP base.",
    "But Republicans privately say that despite what has become an extraordinarily costly Senate race, GOP energy has lagged, and they expect turnout to be closer to the 17 percent level set in 2014.",
    "Mandel, who raised $2.6 million, and has received the endorsement of Club for Growths super PAC, Club for Growth Action, which spent $5 million attacking Vance and $1.7 million attacking Timken.",
    "Brown beat Turner by more than 5 percentage points in a 2021 special primary for the seat after Rep. Marcia Fudge became secretary of Housing and Urban Development in Bidens administration.",
    "She has an endorsement from E-PAC, the leadership PAC founded by House Republican Conference Chairwoman Elise Stefanik of New York to support Republican women running for Congress.",
    "Green, who was added last week to the National Republican Congressional Committee's \"On the Radar\" list for candidates who hit organizational and fundraising benchmarks, is Black.",
    "For the 13th District seat Ryan is giving up for his Senate run, Democrat Emilia Sykes, a state representative and former Ohio House minority leader, is running uncontested.",
    "By contrast, Portmans endorsement of former Ohio Republican Party Chair Jane Timken has meant virtually nothing,? said University of Akron political scientist David Cohen.",
    "The district, which includes the city of Gary and some of Chicagos southern suburbs, is largely white and working class, a population that has been moving toward the GOP.",
    "I could imagine whatever result comes out of the May 3 election could be null and void and the congressional races could go on in early August.?\nCan Sodrel come back?",
    "Under the new lines, the district would have voted for Trump by 28 points in 2020, so the top finisher in the winner-take-all primary is likely going to Congress.",
    "Stu Barnes-Israel, an Army combat veteran, was the only other Republican to raise more than six figures in the race, pulling in $402,000 and spending $184,000.",
    "Even with the May 3 primary days away, uncertainty remains about congressional and state house districts, with map after map tossed out by the courts.",
    "Republican strategists said either would be embraced by party leaders as the nominee in a district national Republicans are targeting in November.",
    "Vance, a venture capitalist who had billionaire Peter Thiel bankrolling a super PAC that through last week had spent $11.8 million promoting him.",
    "She has appeared on the Fox News Laura Ingraham show to offer her perspective on the GOPs opportunity to win Black voters during the midterms.",
    "If approved, it would give Republicans an advantage in at least 10 of 15 congressional districts, with only two districts safe for Democrats.",
    "Ryan has closely emulated Democratic Sen. Sherrod Brown in working to appeal to middle-class voters by focusing on labor and economic issues.",
    "Butland said though he anticipates Democratic losses in November, the Republican Senate primary could present a thread of hope for Democrats.",
    "As of April 15, early voting was down 27 percent compared to 2018 levels, though confusion over districts could be a contributing factor.",
    "The center of gravity has moved to the Jim Jordan wing,? Cohen said, referring to the conservative GOP congressman from western Ohio.",
    "Reidell, who has been endorsed by Rep. Jim Jordan, R-Ohio, is also the target of $268,000 in opposition spending by WFW Action Fund.",
    "But National Republicans see it as well within their target zone of districts that President Joe Biden carried by 10 points or less.",
    "Five Republicans are running for a chance to challenge freshman Democratic Rep. Frank Mrvan in Indianas northwestern 1st District.",
    "In Ohio, the most hotly contested race is the GOP Senate primary, where the battle for the nomination to succeed retiring Sen.",
    "And the more than 3.1 million votes cast for Trump in 2020 exceeded the former record of 2.9 million cast for Obama in 2008.",
    "It wouldn't be the first time theyve snatched defeat from the jaws of victory.?\nWho replaces Ryan, or challenges Kaptur?",
    "Houchin ran in 2016  the last time the seat was open  and came in second to Hollingsworth with 25 percent of the vote.",
    "That the two-term GOP senators endorsement meant so little, he said, speaks to where the Republican Party of 2022 is.",
    "Trumps endorsement catapulted the political novice to the forefront of the pack of five Republican contenders.",
    "Only $102,000 of the more than $2 million spent by outside groups went to support Turner or oppose Brown.",
    "He won his 2020 election by 16 points, and a Democrat has held some version of the seat since the 1920s.",
    "Heading into the campaign's final days, Brown had $757,000 in her campaign account to Turner's $143,000.",
    "She had pulled in $305,000 and spent $206,000 by April 13, ending the period with $98,000 cash on hand.",
    "But first he must clear a nine-way field in the Republican primary in a newly drawn 9th District.",
    "They think hes an elitist RINO,? but Trumps endorsement is probably enough to get J.D.",
    "Ryans district is a traditionally Democratic area that has largely defected to Trump.",
    "Milo was close behind, with $225,000 raised, $164,000 spent and $61,000 in the bank.",
    "The GOP has touted its success recruiting female candidates and candidates of color.",
    "Mrvan has more money than both of them, with $588,000 raised and $422,000 on hand.",
    "But only two of them  Jennifer-Ruth Green and Blair Milo  have raised any money.",
    "The race is rated Solid Democratic by Inside Elections with Nathan L. Gonzales.",
    "over the hump,? Butland said, using the acronym for \"Republican in name only.\"",
    "But Brown received only 50.2 percent of the vote in the 13-candidate field.",
    "But the U.S. House map is still being challenged in the Ohio Supreme Court.",
    "This electorate is just not engaged,? said one longtime Ohio Republican.",
    "Brown also has the backing of the Congressional Progressive Caucus.",
    "Rob Portman has focused on who can most closely emulate Trump.",
    "Green, 40, served in the Navy, and Milo, 39, the Air Force.",
    "Then the question becomes, Hello, what do we do?? he said.",
    "She had raised $440,000 and spent $257,000 as of April 13.",
    "Biden would have won there by 8 points under the new map.",
    "Trump in late April endorsed Hillbilly Elegy? author J.D.",
    "Republicans could nominate a bunch of crazies,? he said.",
    "Here are some things to watch for in this week's races.",
    "How much do kingmakers (mostly Trump) matter?",
    "Last year, the caucus backed Turner.",
    "This year, it's a two-person race.",
    "Do expenditures equal enthusiasm?",
    "Milo is also a former mayor.",
    "Green is the top fundraiser.",
    "Are these the right lines?",
    "Is there any Bernie bump?",
    "Is Ryan a beneficiary?",
    "Which vet gets IN-01?",
    "Both are veterans."
  ]
}