{
  "id": 6029,
  "mediaId": 157,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Trump headed for 'a couple of ugly nights' in May that will expose his weaknesses: adviser",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=29748121&width=1200&coordinates=0%2C59%2C0%2C17&height=600",
  "link": "https://www.rawstory.com/donald-trump-2657248068/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1147,
    1801,
    1867,
    3103,
    4845,
    403,
    428,
    2672,
    2816,
    2969
  ],
  "sentences": [
    " Not definitively.?\nOne Trump advisor conceded as much, telling Siders, \"The president could have a couple of ugly nights.?\nAccording to one GOP pollster, the results of the Georgia Republican primary, where Trump has expended so much political capital, looks like it will deliver a key blow to his reputation.",
    "\"In a four-week stretch of primaries running from Nebraska and West Virginia to Idaho, Pennsylvania and Georgia, Trump-endorsed candidates are slogging through difficult races where the former presidents blessing hasnt proved to be the rocket fuel some expected.",
    "Months before the 2022 midterms, a clue as to whether Donald Trump has a political future as a \"kingmaker\" will be put to the test as Republican voters decide if they want to embrace candidates whom he has endorsed -- or move on and leave him in the past.",
    "With key primaries kicking off this week, the month of May will be crucial to Trump's political viability if some of his riskier choices for office fail to make the cut that would allow them to be on November's ballot.",
    "According to a report from Politico's David Siders, one Trump advisor is privately admitting that May is not shaping up to be a month of unrivaled success for the former president if current polling is to be believed.",
    "In a few cases, his preferred candidates are running far behind,\" Siders wrote before noting that Trump himself was rejected by the voters in 2020 and Republicans lost control of the Senate and House on his watch.",
    "That is the biggest of the challenges where Trump has tried to force his will.?\nHe then added, \"If hes able to take out an incumbent Republican governor, thats a huge statement of his influence.",
    "But if hes unable to take out an incumbent Republican governor with a recent incumbent senator, its a huge statement of his lack of influence on Republican voters.?",
    "Although Vance has leapfrogged the field after Trump's controversial endorsement, Politico is reporting that the rest of the month looks like a minefield for Trump.",
    "The first test for Trump comes on Tuesday of this week as his surprise choice to be the GOP nominee representing Ohio in the Senate, J.D.",
    "According to GOP strategist John Thomas, a series of losses could expose Trump's diminishing influence over Republican Party.",
    "Trump took on an incumbent Republican governor and recruited a recent incumbent Republican senator to challenge him.",
    "But does he have the influence and weight in Republican primaries to be the decisive kingmaker?",
    "That has Trumpworld nervous and conservative activists looking on anxiously.",
    "He doesnt single-handedly control the electorate unless hes on the ballot.",
    "Is he still a very, very popular figure in the Republican Party?",
    "Itll be a blow to his perceived power,? he explained.",
    "Vance, faces his first test before the voters.",
    "Georgias the big one,? Whit Ayres stated.",
    "Absolutely, undeniably."
  ]
}