{
  "id": 6033,
  "mediaId": 43,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Watch The Previous Guy Forget The Name Of The Piece Of Sh*t He Endorsed In Ohio",
  "image": "https://images.dailykos.com/images/1065004/story_image/ScreenShot2022-05-02at8.45.17AM.png?1651506338",
  "link": "https://www.dailykos.com/story/2022/5/2/2095283/-OH-Sen-Watch-The-Previous-Guy-Forget-The-Name-Of-The-Piece-Of-Sh-t-He-Endorsed-In-Ohio",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    781,
    946,
    1054,
    1069,
    1158,
    1801,
    3103,
    4746,
    4809,
    2816,
    2845
  ],
  "sentences": [
    "Click below to donate and get involved with Ryan and his fellow Ohio Democrats campaigns:\nU.S. Senate\nTim Ryan\nGovernor\nNan Whaley\nOhio Supreme Court\nJennifer Brunner for Chief Justice\nAttorney General\nJeff Crossman\nAuditor of State\nTaylor Sappington\nSecretary of State\nChelsea Clark\nTreasurer\nScott Schertzer\nCongress\nDanny OConnor\nState Party\nOhio Democratic Party",
    "Some Democrats have suggested that Mandel, the 44-year-old former state treasurer who lost a 2012 Senate challenge to Brown, would be the best draw for Ryan, who could sharply contrast his willingness to challenge his own party on issues like trade with Mandels absolutism, particularly on cultural issues like teaching about race and sexual identity in schools.",
    "The Republican candidates in Ohio are producing the wildest primary in the country, deploying tens of millions of dollars against one another in a competition that has featured bitter insults, accusations of sexism, and a near-physical altercation between two candidatesJosh Mandel and Mike Gibbonsat a public forum in March.",
    "Ryan plans to devote considerable time to the rural Ohio counties where both Trump and Brown have succeeded, according to the aideeven if it means he just loses those counties gracefully, with 30 to 35 percent of the vote, instead of the 25 percent Biden and Hillary Clinton netted.",
    "Argue that the Republican Party is more consumed by the fate of Dr. Seuss books than job creation, and be prepared for the GOPs attempts to nationalize the race, accusing him of wanting to defund the police or contributing to inflation by supporting Bidens spending.",
    "Ryans strategy, according to the campaign aide, who would discuss it only on the condition of anonymity, will be similar regardless of who emerges from Tuesdays primary: Talk incessantly about creating a manufacturing policy designed to compete with China.",
    "Vance faces six other Republicans seeking the nomination: former state treasurer Josh Mandel, investment banker Mike Gibbons, former Ohio Republican Party chair Jane Timken, state Sen. Matt Dolan, and businessmen Mark Pukita and Neil Patel.",
    "https://t.co/zSwbL6txRB\n Julia Davis (@JuliaDavisNews) May 2, 2022\nTrumps endorsement  despite past remarks in which Vance called Trump Americas Hitler? and a moral disaster?  boosted Vance to the top of the polls in Ohio.",
    "Democrats have created this platform for themselves thats just untenable with independents and moderate voters,? McIntosh said, referring to issues like critical race theory, defunding the police, and government spending.",
    "No one knows who the real JD Vance is, as his views change faster than the weather in Ohio.?\nIn the same rally, Trump, 75, mocked Joe Biden, 79 and the president who beat him in 2020, for stumbling over his words.",
    "Most Democrats dont think Josh can win a statewide election, and theres a lot of Republicans who feel that way, too,? Gibbons, a businessman who was polling ahead of Mandel and Vance earlier in the race, told me.",
    "Amid widespread delight over Trumps Vance-Mandel slip, the columnist Julia Davis referred to a notorious interview in which Trump discussed passing a cognitive test which he insisted was difficult?.",
    "Oh hell.?\nTrumps rally on Sunday was in support of Charles Herbster, a candidate for governor in Nebraska who  like Trump  faces accusations of sexual assault and misconduct.",
    "But David McIntosh, the president of the Club for Growth, the biggest outside group supporting Mandel, assured me that Mandel would handily defeat Ryan in a general election.",
    "Maybe by the fall, polls will show a single-digit race, the thinking goes, and the national political environment will be ever so slightly improving for Biden and Democrats.",
    "Trumps surprise endorsement of the Hillbilly Elegy author J. D. Vance has created even more uncertainty and infighting in the race as the primary approaches.",
    "On Sunday, Mandel continued to hammer his opponent for such remarks, including saying in 2016 he might vote for Hillary Clinton if it seemed Trump might win.",
    "Mandels mask burning and call to eliminate public schools are the types of stunts that rev up partisan ideologues but risk alienating casual voters.",
    "A late investment by an outside spender could provide Ryan enough cover from national attacks to meet his goal of just over 2 million votes.",
    "Senator Sherrod Browns (D. OH) path to win in November:\nRealistically, for Ryan to succeed, he will have to run an error-free race.",
    "Stress his opponents wealthnearly all of the Republicans running are millionaires, and some have links to the off-shoring of jobs.",
    "Hes a real risk for the party if he ends up the nominee.?\nMandels campaign did not respond to requests for comment on the record.",
    "A lot of people, they look at you and say: You dont have to do it, sir. I defend my friends.?\nFigured we all could use that.",
    "Vance spent months fighting his U.S. Senate opponents for the chance to say he's endorsed by former President Donald Trump.",
    "Another candidate, Mike Gibbons, told donors in an email reported by Politico: To be fair, you really cant blame Trump.",
    "Hes doing great pic.twitter.com/wkP3KetanL\n Acyn (@Acyn) May 1, 2022\n\"Hillbilly Elegy\" author J.D.",
    "Health and Democracy are on the ballot this year and we need to get ready to flip Ohio Blue.",
    "Rob Portman, shaking up a race dominated by candidates who wanted Trump's support.",
    "Remind voters that Ryan agreed with Trumps more protectionist trade policy.",
    "On Sunday, Trump appeared to get him mixed up with another candidate.",
    "Trump endorsed Vance in the GOP primary to replace retiring Sen.",
    "Biden has often discussed his struggle to overcome a stutter.",
    "Meanwhile, Rep. Tim Ryan (D. OH-13) is going to follow U.S.",
    "Trump said of the Ohio race during a rally in Nebraska.",
    "I defend people when I know theyre good,? Trump said.",
    "He will also need to draw a deeply flawed opponent.",
    "We'll all see what happens at tomorrow's primary.",
    "Vance (R. OH), not J.P. Vance or J.D.",
    "LOL:\nx\nTrump: Weve endorsed Dr.Oz.",
    "\"We've endorsed...J.P., right?\"",
    "That seems distinctly possible.",
    "Weve endorsed JP right?",
    "And he's doing great.\"",
    "Davis wrote: Person.",
    "FYI:\nx\nPerson.",
    "JD Mandell.",
    "It's J.D.",
    "Oh hell.",
    "Mandel.",
    "Camera.",
    "Camera.",
    "Mandel.",
    "Mandel.",
    "Mandel.",
    "Woman.",
    "Woman.",
    "\"J.D.",
    "Man.",
    "Man.",
    "TV.",
    "JP.",
    "JD.",
    "TV.",
    "JP.",
    "JD."
  ]
}