{
  "id": 6036,
  "mediaId": 43,
  "date": "d2022-05-02T00:00",
  "headline": "Daily Kos Elections Live Digest: 5/2",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/5/2/2094853/-Daily-Kos-Elections-Live-Digest-5-2",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    648,
    1147,
    1253,
    1348,
    1878,
    2087,
    2277,
    3103,
    428,
    2710
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nBig, big May primary preview, with Jeff Singer\nThe Downballot\nFollowShare\n0:0053:14\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\n Monday, May 2, 2022  9:32:17 AM Pacific Daylight Time  Jeff Singer\nPrimary Night: Strictly Come Vancing: After a two-month break, the 2022 primary season picks are back with a vengeance Tuesday in Ohio and Indiana, and weve put together our preview of the night's key races in both states.",
    "Quarles only notable intra-party foe so far is state Auditor Mike Harmon, who has struggled to raise money so far, but considerably more Bluegrass State Republicans are eyeing the contest: Secretary of State Michael Adams, who himself hasnt quite ruled it out, mused, I think were going to need more paper for the ballots.?\nAnd while we hadnt previously heard state Sen. Ralph Alvarado mentioned as a possibility, the Associated Press reports that hes indeed considering.",
    "Monday, May 2, 2022  11:27:56 AM Pacific Daylight Time  Jeff Singer\nMA-Gov: Suffolk University, working on behalf of the Boston Globe, is out with the first survey weve seen of the general election to succeed retiring Republican incumbent Charlie Baker, and it finds Massachusetts Democrats well-positioned to retake the governorship after eight years.",
    "Monday, May 2, 2022  10:43:33 AM Pacific Daylight Time  Jeff Singer\nNH-Sen: Democratic Sen. Maggie Hassan is using her first TV ad of the campaign to tell the audience, I am taking on members of my own party to push a gas tax holiday, and I am pushing Joe Biden to release more of our oil reserves.",
    "Monday, May 2, 2022  11:03:38 AM Pacific Daylight Time  Jeff Singer\nID-Gov, ID-AG: Idaho Dispatch last month released a mid-April survey from Zoldak Research, a firm we havent previously encountered, that shows incumbent Brad Little turning back Lt. Gov.",
    "Over in Ohios 11th District, Rep. Shontel Brown faces a Democratic primary rematch against former state Sen. Nina Turner, a prominent Bernie Sanders supporter whom she defeated in last year's special election in an upset.",
    "Monday, May 2, 2022  11:19:00 AM Pacific Daylight Time  Jeff Singer\nKY-Gov: Commissioner of Agriculture Ryan Quarles said Saturday that he was entering next years Republican primary to take on Democratic Gov.",
    "Monday, May 2, 2022  10:41:27 AM Pacific Daylight Time  Jeff Singer\nNC-Sen: Rep. Ted Budds allies at the Club for Growth are out with a new survey from WPA Intelligence that shows him defeating former Gov.",
    "Attorney General Maura Healey leads both former state Rep. Geoff Diehl and wealthy businessman Chris Doughty 54-27 and 55-25, respectively, while state Sen. Sonia Chang-Daz outpaces them 45-29 and 43-27.",
    "The school also tests out an extremely hypothetical scenario where Baker runs for re-election as an independent and has him beating Healey 37-28, with 17% going to the Trump-endorsed Diehl.",
    "Vance is hoping that a late endorsement from Donald Trump will put him over the top (even if Trump himself hasnt bothered to remember Vances name), but its far from the only primary on tap.",
    "And in south-central Indianas 9th, former Rep. Mike Sodrel is hoping to return to the House 16 years after he was ejected from it, but he has to get past several fellow Republicans first.",
    "Buckeye State Republicans are also taking part in their race for governor, where a recent poll finds incumbent Mike DeWine beating former Rep. Jim Renacci with a plurality of the vote.",
    "Penn has declared that hell seek the Republican nomination to lead heavily Democratic Hawaii, an announcement the mask and vaccine mandate foe naturally made to podcaster Joe Rogan.",
    "Thats how we lower costs and get through these times.?\n Monday, May 2, 2022  10:55:25 AM Pacific Daylight Time  Jeff Singer\nHI-Gov: Former Ultimate Fighting Champion champion B.J.",
    "The Club For Growth, which is running commercials attacking Wasden, publicized an internal back in March that had Labrador ahead by a large 35-14 in the GOP nomination contest.",
    "In the Toledo-based 9th, meanwhile, two Republican state legislators are competing to go up against 20-term Democratic Rep. Marcy Kaptur in a newly-gerrymandered constituency.",
    "You can also follow us on Twitter for blow-by-blow updates, and youll want to bookmark our primary calendar, which includes the dates for primaries in all 50 states.",
    "Pat McCrory 43-23 in the May 17 Republican primary, which is an improvement from the congressmans 44-31 edge a little less than a month ago.",
    "But the news isnt good for five-term Attorney General Lawrence Wasden, as Zoldak shows former Rep. Ral Labrador narrowly leading him 36-33.",
    "We havent seen any other polls all year testing Littles prospects against McGeachin, a far-right favorite who sports Trumps endorsement.",
    "The UFC forbade Penn from fighting again in 2019 after videos showed him involved in a bar brawl, though he was not arrested or charged.",
    "Polls close at 6 PM ET in the portion of Indiana located in the Eastern Time Zone, while the rest of the state follows an hour later.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "The main event is Ohios massively expensive Republican primary for the state's open Senate seat, where venture capitalist J.D.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Voting concludes in Ohio at 7:30 PM ET, and our live coverage will begin then at Daily Kos Elections.",
    "Baker, though, has shown no obvious interest in abandoning either his party or his retirement plans.",
    "Alvarado became incumbent Matt Bevins running mate in 2019 after the then-governor ejected Lt. Gov.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Jenean Hampton from his ticket, but the duo narrowly lost to Beshear and Jacqueline Coleman.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "You can find details on these contests, as well as a whole lot more, in our preview.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "(Next week will bring us contests in Nebraska and West Virginia.)",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Janice McGeachin 60-29 in the May 17 Republican primary.",
    "Its also a place to discuss elections, not policy.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Theres also several big House contests to see.",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "New episodes every Thursday morning.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it.",
    "Andy Beshear."
  ]
}