{
  "id": 6045,
  "mediaId": 409,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Ohio GOP Senate Poll: Vance 26, Mandel 24, Dolan 21",
  "image": "https://www.nationalreview.com/wp-content/uploads/2018/08/polling-place-ohio-2012.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/ohio-gop-senate-poll-vance-26-mandel-24-dolan-21/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John McCormack",
  "authorUrl": "https://www.nationalreview.com/author/john-mccormack/",
  "termIds": [
    819,
    946,
    1801,
    2027,
    2466,
    3103,
    146,
    379,
    428,
    571,
    2845
  ],
  "sentences": [
    "President Trumps continued refusal to accept the results without producing credible evidence of a rigged election started a fire that threatens to burn down our democracy,? DeWine said on January 7, 2021. Yesterdays acts were shameful and all Americans must denounce them, even those Americans [who] feel, incorrectly, that Donald Trump won.?\nYet the most likely outcome in Ohio next Tuesday is a gubernatorial primary win for DeWine and a Senate primary win for Vance, who, according to Trumps endorsement, has been a warrior on the Rigged and Stolen Presidential Election.?\nThe likely split decision in Ohio may be explained by something as unexciting as name I.D.",
    "As I reported last Wednesday, Dolan has seen a spike in Google search interest in Ohio, and Trump attacked Dolan after a Democratic pollster found Dolan in first place, one point ahead of Vance:\nIf Vance or Mandel (or less likely, Gibbons) wins, then the ready-made narrative about the Ohio Republican Party will be that the party of traditional Republicans such as retiring senator Rob Portman is dead and gone, and an Ohio Republican must become (or at least pretend to be) a true Trumpist in order to win a statewide election.",
    "Vance at 26 percent, Josh Mandel at 24 percent, Matt Dolan at 21 percent, and Mike Gibbons at 17 percent:\nOhio GOP gubernatorial primary:\nDeWine 49%\nRenacci 35%\nBlystone 14% pic.twitter.com/T4SAX1BDnO\n John McCormack (@McCormackJohn) May 1, 2022\nTop Stories\nThis is the first public non-partisan poll of the Ohio GOP Senate primary that shows Dolan in serious contention for the nomination.",
    "Dolan said in a 2020 state senate debate: Im pro-life, so if Roe v. Wade got turned to the states, I would vote to ban abortion with the exception of rape and incest.?\nAnother inkling of increased support for Dolan: Google search trends in Ohio show that Dolan has overtaken Gibbons, Timken, and Mandel but is still generating less interest than Vance.",
    "Its also a statement that Putin and Chairman Xi in China must love, that we dont care anymore when dictators invade a sovereign nation.?\nDolans family owns the Cleveland Guardians (the Major League Baseball team formerly known as the Indians), and both Vance and Trump have gone after Dolan for the name change.",
    "Any of the top four candidates  Gibbons, Vance, Dolan, and Mandel  any of the four could win.?\nMiller says the firm isnt working on behalf of any candidate in Ohio and simply polled the race to test our mettle.?\nI sort of expected that Vance would have surged following the Trump endorsement,? Miller said.",
    "Hes got a slight lead among those who say theyre somewhat conservative.? The Blueprint poll found that among the third of the GOP electorate that are undecided, 40 percent describe themselves as very conservative, 36 percent as somewhat conservative, 18 percent as moderates, and 5 percent as liberals.",
    "That narrative is complicated, however, by the fact that incumbent Ohio GOP governor Mike DeWine, heralded by the Atlantic as one of The Last of the Establishment Republicans,? is in first place in his own primary (at 43 percent in the new Fox poll)  ahead of his closest opponent by nearly 20 points.",
    "Prior to the appointment of Amy Coney Barrett to the Supreme Court, Dolan did vote against a heartbeat bill? to ban most abortions on the grounds that it would be struck down in federal court, but thats a tactical dispute that has divided pro-life groups in Ohio over the years.",
    "Vance 17%\nMike Gibbons 13%\nJosh Mandel 12%\nJane Timken 7%\nUndecided 33%@blueprintpoll ~ 634 LV ~ 4/21-4/24https://t.co/1WZODO0gXi\n PollTracker (@PollTrackerUSA) April 26, 2022\nBlueprint Polling is the polling arm of Chism Strategies, a Democratic firm based in Texas.",
    "Later in the day on Tuesday, Trump issued a statement hitting Dolan on the matter:\nAnybody who changes the name of the storied? Cleveland Indians (from 1916), an original baseball franchise, to the Cleveland Guardians, is not fit to serve in the United States Senate.",
    "Dolan also knocked Mike Gibbons for suggesting that the middle class should pay more in taxes; hit Mandel for putting his finger in the air? in his various campaigns; and called Vances Ukraine comments a slap in the face to the Ukrainian Ohioans.",
    "The Trump-Republican policies are what we have to be focusing on, not anything else.? Dolan has said hed vote for Trump if hes the 2024 nominee, and he committed to backing any Republican nominee in the Senate race against Democrat Tim Ryan.",
    "Dolan got into the race late (in September), and while he has been steadily gaining in both Fox News and Trafalgar polls, Jane Timken, the Ohio state GOP chair who has been trying to straddle the MAGA-mainstream divide, has been slipping.",
    "When I asked him what it really means to move beyond Trump, he said: Weve got to focus on the crisis that the Biden administration has caused in our country, and the direction theyre taking our country, which is extremely scary.",
    "I come from a big family, and my family made a decision and Im going to stand by my familys decision,? Dolan told me, adding that it has nothing to do with important issues like inflation, the border, or drugs.",
    "Before Trump issued his broadside, a Democratic pollster released polling that showed a four-way race in the Ohio GOP Senate primary, with Dolan one point ahead of Vance.",
    "In the Senate race, by contrast, the only candidate with a statewide profile before 2022 is Josh Mandel (who held a relatively obscure office as state treasurer).",
    "The undecided voter is still the winner,? Dolan said of the polls when asked about the view that the Senate primary is a two-man race between Vance and Mandel.",
    "And if three out of four of DeWine voters backed Matt Dolan, the only Republican who hasnt embraced Trumps stolen-election narrative, then Dolan would win.",
    "Such is the case for Matt Dolan, who I dont know, have never met, and may be a very nice guy, but the team will always remain the Cleveland Indians to me!",
    "Dolan is drawing half of his support from self-described moderates, who make up less than a quarter of the Republican primary electorate.? says Miller.",
    ": DeWine has been a fixture of GOP politics for decades, serving in the U.S. House, the U.S. Senate, Ohio attorney generalship, and Ohio governorship.",
    "A new Emerson poll, conducted from April 28 to April 29, shows a very competitive race in this coming Tuesdays Ohio GOP Senate primary, with J.D.",
    "Was Trumps decision to attack Dolan on Tuesday evening a sign that Dolan might actually have a chance of pulling off an upset?",
    "Dolans backing among moderates likely has more to do with his disposition toward Trump than any particular policy issue.",
    "DeWine has earned Trumps wrath for his condemnation of the former presidents role in instigating the Capitol riot.",
    "He also thinks it is possible that Dolan could be closer to a ceiling because undecided voters skew conservative.",
    "While the outcome remains unlikely, I spoke to Dolan on Tuesday about his bid to pull off such a stunning upset.",
    "And DeWines likely victory would prove, even if Dolan loses, that Dolans theory of the race wasnt crazy at all.",
    "Weve got to return to being constitutional conservatives.?\nThe Trump policies are fine,? he added.",
    "If primary voters consolidated behind one of DeWines two challengers, DeWine could lose.",
    "Its really a four-way race at this point,? says Brannon Miller of Chism Strategies.",
    "Dolan has campaigned as the only candidate who wants to move beyond Trump.",
    "A split decision, of course, isnt the only possible outcome.",
    "2022 #OHSen Republican Primary Poll:\nMatt Dolan 18%\nJ.D.",
    "I call it searching for a message,? Dolan told me.",
    "But crazier things have happened in politics.",
    "What does Jane Timken stand for?",
    "She has yet to find a message.",
    "You call it straddling.",
    "Too little, too late?",
    "Probably."
  ]
}