{
  "id": 6051,
  "mediaId": 43,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "J.D. Vance (R) Is Now Claiming That Pres. Biden Is \"Trying To Kill A Bunch Of MAGA Voters\"",
  "image": "https://images.dailykos.com/images/1064750/story_image/ScreenShot2022-05-01at12.03.00PM.png?1651431808",
  "link": "https://www.dailykos.com/story/2022/5/1/2094498/-OH-Sen-J-D-Vance-R-Is-Now-Claiming-That-Pres-Biden-Is-Trying-To-Kill-A-Bunch-Of-MAGA-Voters",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "Jimmy Kimmel nails it:\nx\nx\nOn Wednesdays episode of Jimmy Kimmel Live, Kimmel called out Vance for his hypocrisy, telling his audience, All of a sudden, he decided not only isnt Trump noxious and reprehensible, hes now the greatest president of his lifetime and J.D.s previous opinions, he says, were stupid.?\nVance previously openly expressed disgust with Trump, telling NPR in 2016, I cant stomach Trump? and once tweeting that Trump was an idiot.? Kimmel said that Vances opinions changed, though, once he smelled which way the wind was blowing off the porta-potty that is todays Republican Party.?\nHe then played a clip of Vance speaking at a debate during his Senate run.",
    "Spencer Kimball, Executive Director of Emerson College Polling said, Trumps endorsement was a game changer for Vance: 63% of his supporters say the former presidents endorsement makes them more likely to support his candidacy.? Kimball continued, Among those who say Trumps endorsement makes them less likely to support a candidate, Dolan holds the majority, 56%, of support.?\nMandel leads among rural voters with a 30% plurality, whereas Vance holds a plurality among urban (25%) and suburban (26%) voters.",
    "https://t.co/9IpedLmGBm pic.twitter.com/yAj6bPiGRS\n John McCormack (@McCormackJohn) May 1, 2022\nA final Emerson College Poll of Ohio Republican Primary voters less than a week out from the May 3 primary election finds a tight race among the top four candidates: JD Vance leads the field at 24%, followed by Josh Mandel at 22%, Matt Dolan at 18%, and Mike Gibbons at 14%, with 11% undecided.",
    "Click below to donate and get involved with Ryan and his fellow Ohio Democrats campaigns:\nU.S. Senate\nTim Ryan\nGovernor\nNan Whaley\nOhio Supreme Court\nJennifer Brunner for Chief Justice\nAttorney General\nJeff Crossman\nAuditor of State\nTaylor Sappington\nSecretary of State\nChelsea Clark\nTreasurer\nScott Schertzer\nCongress\nDanny OConnor\nState Party\nOhio Democratic Party",
    "Once Trump lent his support to Vance, the contest became a microcosm of the fight for the Republican Party, with several outside groups drawing Trump's ire for backing former Ohio state treasurer Josh Mandel and a candidate in the form of state Sen. Matt Dolan accusing his opponents of debasing themselves to seek the former President's backing.",
    "And now the MAGA Shit Show continues:\nNot long after Donald J. Trump was elected president, the Club for Growth, a conservative anti-tax group that had opposed his 2016 campaign, reinvented itself as a reliable supporter, with the groups president, David McIntosh, providing frequent counsel to Mr. Trump on important races nationwide.",
    "But on Jan. 6, Mr. Dolan did not shy away from criticizing Mr. Trump for spreading lies about the results of the November 2020 election, writing on Twitter, Real leaders lead not manipulate.? Unlike the other leading Republican candidates in the race, he also acknowledges President Biden is the nations legitimate leader.",
    "If you wanted to kill a bunch of MAGA voters in the middle of the heartland, how better than to target them and their kids with this deadly fentanyl?? the controversial candidate pressed in an interview Friday with Jim Hoft, founder of the far-right news site Gateway Pundit.",
    "GOP Representative Matt Gaetz of Florida, who was also at the campaign to back Vance, jumped in after the congresswoman's remarks and said: \"I watched the debates and Josh Mandel sort of looks like if you asked Matt Dolan to read talking points written by Jim Jordan.",
    "The dispute broke into plain view days ago when in support of Josh Mandel, the former Ohio state treasurer, for the Republican Senate race, the Club for Growth ran a television commercial showing the candidate Mr. Trump has endorsed, the Hillbilly Elegy? author J.D.",
    "I think theres mounting evidence that hes in a scenario where hes running up the middle, unmolested, with a unique message and some things in his favor,? said Mike Murphy, a Republican strategist who lives out of state but donated $250 to Dolans campaign in October.",
    "Vance (R. OH) in the GOP U.S. Senate primary in Ohio:\nAfter promising Trump that Vance was with him on the issues despite the candidates past anti-Trump comments, Tucker  according to three sources familiar with the matter  turned to a lurid closing argument.",
    "Hes got the momentum, as of last week.?\nWe also have Peter Thiel to thank for Vances rise:\nMr. Trump has said he chose to bless Mr. Vance because we have to pick somebody that can win.? Why he decided Mr. Vance is that somebody has prompted head scratching.",
    "\"You know, the Columbus TV station doesn't just go to Republicans,\" Ryan said, joking that a range of voters, from moderate Republicans to Democrats, have been activated by what he called a \"divisive\" GOP primary that focused on \"very narrow issues.\"",
    "Trump had already displayed a long, abiding interest in Mandels own sex life, having already spent months privately regurgitating and spreading salacious, unverified rumors that hes heard about fucking weird? Mandels supposed debauched ongoings.",
    "In the clip, Vance admits, All of us say stupid things, and I happened to say stupid things very publicly.?\nKimmel joked that Vances admission was a really a great qualification for a future senator: Vote for meI say stupid things very publicly.",
    "But this spring, as Mr. Trump faces critical tests of the power of his endorsements, an ugly fight over the Ohio Senate primary is threatening what had been a significant alliance with one of the most influential groups in the country.",
    "Vance (R. OH)\nHe really is the fucking worst:\nx\nVance says Biden is trying to kill MAGA voters: If you wanted to kill a bunch of MAGA voters in the middle of the heartland, how better to target them and their kids with this fentanyl ..",
    "Certainly, there is nothing the former president enjoys as much as watching a former adversary grovel, and Mr. Vance has been happy to gush about how wrong he was in 2016 and what a great president Mr. Trump turned out to be.",
    "As the collective chortling wound down, the Fox News host told Trump that it is typically the most publicly straight-laced seeming individuals who end up being the most off-kilter, troubled, or sexually aberrant in private.",
    "That escalation drew an angry response from Donald Trump Jr., the former presidents eldest son, who had spent months urging his father to support Mr. Vance and has invested his own energy and influence on Mr. Vances behalf.",
    "But during that phone call, the twice-impeached former president spent a notable amount of time gossiping and laughing about the prominent Republicans penis and how fucking disgusting? and fucking gross? he allegedly was.",
    "And the MAGA clown cars are coming in to duke it out between Vance:\nRepublican Representative Marjorie Taylor Greene of Georgia criticized former state treasurer Josh Mandel Saturday while touting his opponent J.D.",
    "There is also slight education divide in the Republican Senate Primary: Mandel holds a 28% plurality of support of those without a college degree whereas Vance holds 28% plurality among those with a college degree.",
    "I nearly lost my mother to the poison coming across our border.?\nIts worth pointing out that Vance famously recounts in his memoir that his mom would steal her patients painkillers while working as a nurse.",
    "He said he voted for Mr. Trump in the last presidential election, opposed both impeachment cases against him and has said he would support the former president should he become the 2024 Republican nominee.",
    "Vance  who received Trumps endorsement last week  has surged into first place according to the most recent Fox News poll, Dolan was the only other top contender to gain ground in the poll since last month.",
    "Mr. Trump has held enormous sway despite being less visible since leaving office, but other power centers and G.O.P.-aligned groups over which he used to exert a stranglehold are asserting themselves more.",
    "Mandel has spent the last ten years trying to get deployed to the U.S. Senate, and has spent the past year trying to make the case that he was the MAGA-movements best hope to sweep the buckeye state.",
    "Mandel has spent the last ten years trying to get deployed to the U.S. Senate, and has spent the past year trying to make the case that he was the MAGA-movements best hope to sweep the buckeye state.",
    "They were trying to take the lives of  of little babies!? Josh Mandel is clapping as the man embraces General Mike Flynn and just absolutely hollers the last line, voice cracking with emotion.",
    "But last week, the Commander in Chiefs call went out to a different Marine, when former President Donald Trump endorsed author, venture capitalist and former public affairs officer J.D.",
    "But last week, the Commander in Chiefs call went out to a different Marine, when former President Donald Trump endorsed author, venture capitalist and former public affairs officer J.D.",
    "Heres a little background on Dolan:\nLike the other Republicans in the race, he said he wants to secure the border, cut the flow of fentanyl into the state and tackle inflation.",
    "Do you hate Mexicans?? he asks would-be voters with the same energy of a late-night infomercial trying to sell you a shoddily made product you certainly dont need or even want.",
    "No matter who emerges from the Republican primary, Ryan plans to run on the economic populist issues he believes can still win over voters who backed Trump just two years ago.",
    "'?\nBut we could also be in for a surprise on Tuesday:\nx\nEmerson Ohio GOP Senate poll: Vance 26%, Mandel 24%, Dolan 21% https://t.co/caTtgTIuKr\nPoll was conducted April 28-29.",
    "Rolling Stone has an insanely ridiculous article out that explains how Fox News host and Putin Puppet, Tucker Carlson, convinced the former one term loser to endorse J.D.",
    "The venture capitalist and Hillbilly Elegy? author, who was endorsed earlier this month by Donald Trump, did not explain how Biden could accomplish such a horrifying aim.",
    "Its like Biden wants to punish people who didnt vote for him.? pic.twitter.com/5Yoh0CA44z\n Ron Filipkowski gg (@RonFilipkowski) April 30, 2022\nOhio Senate candidate J.D.",
    "The event invited \"Trump warriors\" who believe in fighting for election integrity, Judeo-Christian values, protecting life, and a \"Trump America First\" agenda to attend.",
    "Also, this checks out:\nU.S. Sen. Ted Cruz was in Lebanon Saturday evening along with Senate candidate Josh Mandel as the latest stop in their \"Faith and Freedom\" rally.",
    "Before the former president and Mr. Vance appeared together at a rally in central Ohio a week ago Saturday, Mr. Stovers group called on supporters to boycott the event.",
    "Before Trump endorsed Vance, most of the candidates were openly gunning for the former President's backing, trading attacks over who best represented the MAGA agenda.",
    "Whatever momentum Dolan is riding, it was enough to prompt Trump to release a statement Tuesday suggesting that the state senator is not fit? to serve in the Senate.",
    "Vance has leveled a bizarre new accusation against Joe Biden, suggesting that the president is trying to kill? MAGA voters with fentanyl sold by drug traffickers.",
    "This is a significant shift from the February Emerson College Ohio Poll, where Gibbons was ahead at 22%, followed by Mandel at 15%, Vance at 8%, and Dolan at 6%.",
    "Now, after languishing at the bottom of the polls since joining the Republican field, Dolan is finding that his strategy is finally showing signs of paying off.",
    "The former president has a longstanding love affair with celebrities  and, perhaps better than anyone, grasps the value of celebrity in electoral politics.",
    "Rep. Tim Ryan (D. OH-13), the Democratic frontrunner in his primary, does see an opportunity with this MAGA shit show:\n\"I've got my own record,\" Ryan said.",
    "Also:\nThe field of candidates chasing Ohios GOP Senate nomination has pledged allegiance to former President Donald Trump and beaten a path to Mar-a-Lago.",
    "A separate poll released Tuesday by Blueprint Polling actually placed Dolan in first place with 18 percent of the vote, followed by Vance at 17 percent.",
    "The state senator has declined to kiss the ring, and instead run as a traditional conservative  pouring $10.6 million of his own money into the effort.",
    "Mr. Trump may have been swayed by Mr. Vances admirers, notably Don Jr., Tucker Carlson and Mr. Thiel, a megadonor to Mr. Trump as well as to Mr. Vance.",
    "Standing at his front door, Ryan, who considers himself a Democrat, said he planned to vote in the Republican primary this year because of Mr. Dolan.",
    "But he implied that drug traffickers crossing into the U.S. from Mexico were expressly not arrested so they could kill right-wing Republican voters.",
    "That path looks like this: Focus on economics, avoid culture wars that Republicans want to highlight and be prepared to stand up to your own party.",
    "Mr. Mandels supporters have taken it particularly hard, slagging Mr. Vance as an opportunist and Mr. Trumps endorsement as, at best, ill informed.",
    "You cant trust? David McIntosh, the president of the conservative Club for Growth and a top backer of Vances rival Josh Mandel, Carlson claimed.",
    "But he also said he could do more than his competitors to bring workers to the state and put together a unique economic development agenda.",
    "And Mandel:\nThe old man in the paratrooper beret is up at the front of the church with Ohio Senate Candidate Josh Mandel and he is yelling.",
    "The group, one of the few that actually spends heavily in primary races, responded by saying it would increase its spending on the ad.",
    "Whatever its roots, Mr. Trumps endorsement hit the Ohio race like the asteroid that killed the dinosaurs, spreading chaos and carnage.",
    "Mr. Trumps response was brutish: He had an assistant send Mr. McIntosh a short text message telling him off in the most vulgar terms.",
    "And his ability to influence the thinking of Republican voters on behalf of other candidates is about to be tested at the ballot box.",
    "I think we need more men and women in the U.S. Senate who have worn the uniform and carried a weapon in a foreign land,? Mandel says.",
    "I think we need more men and women in the U.S. Senate who have worn the uniform and carried a weapon in a foreign land,? Mandel says.",
    "Mr. Trump is said to have been put off by an ugly confrontation between Mr. Mandel and another candidate during a debate in March.",
    "Mr. Stover speculated to me recently: Who knows what exactly came up? during the billionaire money mans pilgrimages to Mar-a-Lago?",
    "\"I've been doing this a while, and so I'm not as tied to the Biden agenda only because I've got a 20-year record of doing things.",
    "Never mind that the southern border is more than 1,400 miles away or that the Buckeye States Latinx population is less than 5%.",
    "Trump stated he didnt want to talk to the pro-Mandel McIntosh anymore, two people familiar with the matter told Rolling Stone.",
    "With these voters allocated, Vance expands his support to 26%, Josh Mandel to 24%, Matt Dolan to 21% and Mike Gibbons to 17%.",
    "Ryan put this message in a recent television ad, in which he blamed \"both parties\" for \"wasting time on stupid fights.\"",
    "This is Vance doubling down on his racist, fear mongering strategy against immigrants:\nVance hasnt just apologized.",
    "The standoff over the Ohio primary encapsulates some of the critical open questions within the Republican Party.",
    "Carlsons comments about the proclivities of Mandels patron threw both Trump and his son into fits of laughter.",
    "John Stover, the head of Ohio Value Voters, firmly? believes the decision was heavily influenced by Mr. Thiel.",
    "(Carlson has spent the week following the endorsement expounding on the importance of male testicle tanning.)",
    "He did, however, promise that Carlson would likely be very happy? with Trumps ultimate choice on the matter.",
    "The reason, Carlson asserted, is that McIntosh has an embarrassing and chronic? personal sexual habit.",
    "Vance as a better Ohio Republican Senate candidate ahead of the state's primary election on Tuesday.",
    "Cruz and Mandel were in Dayton on Friday and continued Saturday, appearing in Toledo and Columbus.",
    "[Vance],\" Greene said as she stood next to Vance during a campaign rally for him in Newark, Ohio.",
    "Thats so true,? the ex-president concurred, according to two sources familiar with the meeting.",
    "Right before Trump hung up the phone, he did not explicitly relay a decision on an endorsement.",
    "The groups call to arms included a laundry list of the candidates past criticisms of Mr. Trump.",
    "Health and Democracy are on the ballot this year and we need to get ready to flip Ohio Blue.",
    "But in that brief window, Don Jr. and, particularly, Carlson seemed to have made an impact.",
    "McIntosh had just concluded his own phone call with Trump during that same midday meeting.",
    "Days before the May 3 primary, Dolan appears to be experiencing a late burst of momentum.",
    "In this house  Immaculate Conception Catholic Church in Norwood, Ohio  they love troops.",
    "In this house  Immaculate Conception Catholic Church in Norwood, Ohio  they love troops.",
    "The phone call with Carlson, which ended shortly thereafter, lasted roughly ten minutes.",
    "I've got a really good story to share with the Ohio voters that's not tied to Biden.",
    "Mr. Trump may also be taken with Mr. Vances quasi-fame and frequent TV appearances.",
    "In Laos, in Cambodia? Things get a bit indistinct here but it comes back around.",
    "It turns out, theres only one thing to do: double down and call in the General.",
    "I just saw someone that learned to speak MAGA and just repeat it over and over.",
    "It turns out, theres only one thing to do: double down and call in the General.",
    "Alternatively, attendees were encouraged to boo when Mr. Vance was introduced.",
    "So what do you do when the biggest name in Republican Politics snubs you?",
    "So what do you do when the biggest name in Republican Politics snubs you?",
    "On Tuesday his campaign unveiled an ad that doesnt bother with subtlety.",
    "I looked at all the candidates, and hes the most honest one,? he said.",
    "Several days later, Carlson, Don Jr., and Vance indeed got their way.",
    "Trump endorsed Vance, thanks in part to Carlsons sexual innuendos.",
    "All the words are right, but something just doesn't look correct.\"",
    "That, for Ryan, is where the Republican Senate primary comes in.",
    "Rolling Stone cannot confirm the claim and will not repeat it.",
    "Vance then goes on to blame immigrants for all of Ohios ills.",
    "The Lebanon rally was held at 6 p.m. at Solid Rock Church.",
    "Undecided voters were asked who they are leaning towards.",
    "It was a stance that Pat Ryan, 64, said he respected.",
    "\"For Josh Mandel, I didn't see the sincerity there.",
    "We don't want those people serving in Congress.",
    "Vance, repeatedly denouncing Mr. Trump in 2016.",
    "The back of his jacket says USAF Pararescue.",
    "Mandel is grinning and loving what he sees.",
    "Mandel is grinning and loving what he sees.",
    "But its a competitive race, and hes in it.",
    "We don't want those people in Washington.",
    "But sure, lets blame it on the Mexicans.",
    "Does it mean he has a lock on the race?",
    "His lawn signs say SEND IN THE MARINE.",
    "His lawn signs say SEND IN THE MARINE.",
    "This issue is personal,? Vance says.",
    "I fought the Communists!? he yells.",
    "And so that's why I endorsed J.D.",
    "Thats what the cabal was doing!",
    "Vance in Ohios crowded primary.",
    "Vance in Ohios crowded primary.",
    "I'm tired of those candidates.",
    "I didn't see the authenticity.",
    "That contest has been fierce.",
    "And so, I've got some room.\"",
    "Hes hardly a never Trumper.",
    "It does look intentional.",
    "Well find out on Tuesday.",
    "You know, thats so true.",
    "He has gone full Trump.",
    "(Best of his lifetime!)",
    "Dolan surge is real.",
    "But not Matt Dolan.",
    "Are you a racist?",
    "While J.D.",
    "No way.",
    "J.D.",
    "..."
  ]
}