{
  "id": 6055,
  "mediaId": 25,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Transcript: Rep. Adam Kinzinger on \"Face the Nation,\" May 1, 2022",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/05/01/b2a9fcbe-0760-441f-bb1a-296b05bd7a77/thumbnail/140x90/e3109320c81e2445f23c339dbcf650d8/0501-ftn-birx-987875-640x360.jpg",
  "link": "https://www.cbsnews.com/news/adam-kinzinger-transcript-face-the-nation-05-01-2022/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    883,
    1434,
    2017,
    2214,
    3103,
    428,
    545,
    562,
    2707
  ],
  "sentences": [
    "Trending News\n Transcript: Rep. Adam Kinzinger on \"Face the Nation\"\n Birx: U.S. should prepare for summer COVID surge in South\n Samantha Power urges Congress to address \"desperate need\" for Ukraine aid\n Fighting intensifies in eastern Ukraine as civilians flee\n Kinzinger says he \"would love\" for Pence to testify before January 6 committee",
    "So I have this organization, Country First, Country1st.com, and our focus is on playing in some of those primaries to bring at least reasonable people to the forefront and encouraging folks that are going to live, for instance, in a guaranteed Republican district, you know, vote in that primary.",
    "It's important for us to lay the whole story out in front of the American people from both what led to January 6th, the lies after the election, the fundraising, the 187 minutes the president basically sat in the Oval Office and- and everything since, including the response by DOD.",
    "These are decisions I think, that we're going to end up making from a tactical perspective in the next week or two as we basically pin down what this hearing schedule is going to look like, the content and as we go into the full narrative of this thing.",
    "You know, the Department of Justice will make decisions based on information, but the American people are going to be the ones that have to take the work we've done and decide what they want to do with it or what they want to believe after that.",
    "We've requested information from various members in terms of whether we move forward with a subpoena is going to be both a strategic, tactical decision and a question of whether or not, you know, we can do that and get the information in time.",
    "I mean, she assaulted, I think, a survivor's family from a school shooting at some point in D.C. She stood outside a congresswoman's office and yelled at her through a mail slot and said she was too scared to come out and confront her.",
    "But keep in mind, the president's- the former president's tactic here, if somebody starts falling behind in the polls, he always finds a reason to un-endorse them because he doesn't like having a losing track record.",
    "I just introduced an AUMF, an authorization for the use of military force, giving the president basically congressional leverage or permission to use it if WMDs, nuclear, biological or chemical are used in Ukraine.",
    "The chairman for the committee investigating the January 6th attack on the US Capitol announced a series of public hearings will be held in June with the very first one scheduled for the 9th.",
    "MARGARET BRENNAN: You know, we keep hearing from the committee, including the chairman, that there will be members of Congress requested to come and speak and answer your questions.",
    "REP. KINZINGER: Yeah, I think it would be a sign, and I think you know there's- that's going to be a big- this primary season is going to be a big moment to figure that out.",
    "Look, I mean, that can't for me as a Republican, that doesn't represent what I believe, and the party has to make the decision if they want to be that kind of party or not.",
    "But let me just say this for Marjorie Taylor Greene- Greene to say she's a victim, it's amazing how, you know, folks like her attack everybody for being a victim.",
    "And then when Marjorie Taylor Greene is confronted, she's all of a sudden a victim and a poor, helpless congresswoman that's just trying to do her job.",
    "The following is a transcript of an interview with Republican Rep. Adam Kinzinger of Illinois that aired Sunday, May 1, 2022, on \"Face the Nation.\"",
    "Vance, that's what May 3rd- When you say reasonable people, you don't think reasonable people are voting in the Ohio Republican primary for him?",
    "This is- World War- prior to World War II, there were moments nobody ever wanted to get involved and eventually came to realize they had to.",
    "If those hand-picked candidates end up winning, is this a sign that indeed Donald Trump is still the leader and kingmaker within the party?",
    "MARGARET BRENNAN: A lawyer for Congresswoman Marjorie Taylor Greene said this week she was not a participant in the January 6th violence.",
    "But I think the key is, regardless of even what some members of Congress are going to tell us, we know a lot of information around it.",
    "I would hope and think that the Vice President would want to come in and tell his story because he did do the right thing on that day.",
    "Congressman, do you expect this to be more of building a public narrative or will new information come to light in these hearings?",
    "And it's important for us to be able to put that in front of the American people, because ultimately they have to be the judge.",
    "MARGARET BRENNAN: Senator Kane was with us and he said it is too soon to begin talking about potential use of force in Ukraine.",
    "I know you're not a fan of the former president, but he is in some ways playing a very large role in some upcoming primaries.",
    "There were text messages revealed this week in which she was discussing martial law with Mark Meadows, then chief of staff.",
    "If he doesn't, then we'll look at the options we have available to us if there's information we don't already have.",
    "REP. KINZINGER: Well, you know, look, from what I've seen, there's one at least maybe reasonable candidate.",
    "That $33 billion is significantly less than what we would have to spend if we took Russia on directly.",
    "And I think right now what we're doing with supply and with Lend-Lease, with the financing is right.",
    "MARGARET BRENNAN: Vice President Mike Pence did the right thing in terms of certifying the election.",
    "MARGARET BRENNAN: Speaker Pelosi and top Democrats were in Ukraine overnight, as I'm sure you know.",
    "Congressman Adam Kinzinger of Illinois is a member of that committee and he joins us this morning.",
    "Do you see impediments to getting this $33 billion that the president has asked to be passed?",
    "Look, history is not going to judge her or people like her that are buying the big lie well.",
    "I mean, look, there's- we do have outliers of people that seem to show some Putin sympathy.",
    "It gives him, you know, a better flexibility, but also it is a deterrent to Vladimir Putin.",
    "MARGARET BRENNAN: All right, Congressman Adam Kinzinger, thank you for your time today.",
    "But for the most part, Congress is vastly and largely united on the issue of Ukraine.",
    "He's endorsed a number of other candidates: Pennsylvania, Herschel Walker, Georgia.",
    "REP. ADAM KINZINGER: Well, I think certainly new information will come to light.",
    "As a Republican, do you want to see him come forward and actually speak to you?",
    "This is a guy that said that he frankly doesn't care what happens in Ukraine.",
    "We're going deeper with richer and more detail to show the American people.",
    "You know, we've been talking about January 6th now for a year and a half.",
    "I hope we don't get to that point here, but we should be ready if we do.",
    "And so, yeah, I do think the primary season's going to- going to tell.",
    "I mean, I think ultimately whatever we can do to get that information.",
    "REP. KINZINGER: Well, I won't say who I think we need to talk to yet.",
    "We- right now, we're kind of not even building a broader narrative.",
    "But there may be a point that we have to recognize, you know, look.",
    "It's very similar to what people like Tucker Carlson have said.",
    "Vance two years ago, you know, you're a totally different J.D.",
    "I don't think we need to be using force in Ukraine right now.",
    "If Vladimir Putin wants to escalate with the West, he will.",
    "REP. KINZINGER: And those are decisions we make every day.",
    "I mean, I think everybody needs to come and talk to us.",
    "So I hope we don't have any impediments to that at all.",
    "I think if that takes a subpoena, it takes a subpoena.",
    "I won't confirm or deny the text messages, of course.",
    "MARGARET BRENNAN: Welcome back to FACE THE NATION.",
    "It just says if it is used, he has that leverage.",
    "We recognize Ukraine is fighting for all of us.",
    "I mean, I'd love to ask her a few questions.",
    "But no, I mean, look, if you- if you're J.D.",
    "And still none of them have come really.",
    "Are you in favor of subpoenaing members?",
    "Do you need to ask her a few questions?",
    "And if so, who do you need to talk to?",
    "Doesn't compel the president to do it.",
    "REP. KINZINGER: I certainly hope not.",
    "He is a central player in this story.",
    "MARGARET BRENNAN: Do you favor one?",
    "I hope he would do so voluntarily.",
    "In Ohio, in particular, J.D.",
    "MARGARET BRENNAN: All right.",
    "MARGARET BRENNAN: Well, J.D.",
    "REP. KINZINGER: No, I don't.",
    "It's easy for him to do it.",
    "Vance than you are today.",
    "I would love to see that.",
    "We want the information.",
    "Do you think he's right?",
    "I wouldn't expect we do.",
    "I think it's important.",
    "I firmly believe that.",
    "REP. KINZINGER: Yeah.",
    "We know some things.",
    "REP. KINZINGER: Yes.",
    "Good morning to you.",
    "We'll be right back.",
    "She was a victim.",
    "It's insane.",
    "It matters.",
    "Vance.",
    "Yeah."
  ]
}