{
  "id": 6056,
  "mediaId": 157,
  "date": "d2022-05-01T00:00",
  "headline": "Trump accidentally endorses JD Vance opponent Josh Mandel after bragging about his dementia test scores",
  "image": "https://www.rawstory.com/media-library/josh-mandel-and-j-d-vance.jpg?id=29187985&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/trump-jd-vance-josh-mandel/",
  "sentiment": "-0.226",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    882,
    946,
    1147,
    1801,
    2087,
    2131,
    3103,
    2725,
    2845
  ],
  "sentences": [
    "Just moments after bragging about his high scores on a dementia test and mocking President Joe Biden's stutter, former President Donald Trump accidentally endorsed the wrong Ohio candidate for the U.S. Senate.",
    "Speaking to the crowd to promote Charles Herbster, who has been accused of sexual misconduct by eight women, Trump also named other candidates he hopes to elevate to the U.S. Capitol.",
    "Vance may have said some not-so-great things about me in the past, but he gets it now, and I have seen that in spades,\" Trump said in his statement on April 15.",
    "Several of Trump's former staffers, including Hope Hicks, are working for Mandel and allies like Michael Flynn have appeared around the state with him.",
    "There is no candidate in this race more America First than me,? Mandel said, speaking to reporter Chelsea Sick in a Dayton 24/7 interview.",
    "Digital activist Matt Ortega responded by launching the campaign website for JP Mandel:\nTrump accidentally endorses Josh Mandel",
    "\"You know, in Texas, on endorsements, I was 33 and 0, and if I lost one race they'd say, 'Trump was humiliated,'\" said Trump.",
    "The person Trump said that he endorsed was JD Vance, the author of Hillbilly Elegy, and a close friend of Donald Trump Jr.",
    "In fact, Trump Jr has spent the past several weeks traveling with the candidate in an effort to get him elected.",
    "Josh Mandel has been a far-right candidate that desperately courted Trump's support ahead of the endorsement.",
    "Vance was a strong opponent of Trump in 2016 and has only come around to support him in the past few years.",
    "I'm looking forward to working with President Trump to beat the Democrats in November.",
    "\"He is our best chance for victory in what could be a very tough race.\"",
    "I'm confident we're going to win this primary on May 3.",
    "\"That's what they're waiting for one race.",
    "You know we've endorsed Dr. Oz.",
    "\"Like some others, J.D.",
    "We've endorsed JP?",
    "JD Mandel.\""
  ]
}