{
  "id": 6058,
  "mediaId": 157,
  "date": "d2022-05-01T00:00",
  "headline": "'Weak' JD Vance demoted to Don Trump Jr's 'sidekick' as primary vote looms: columnist",
  "image": "https://www.rawstory.com/media-library/don-trump-jr-jd-vance.jpg?id=29746216&width=1200&coordinates=0%2C13%2C0%2C37&height=600",
  "link": "https://www.rawstory.com/don-trump-jr-2657245382/",
  "sentiment": "-0.72",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1053,
    1147,
    1801,
    2087,
    3103,
    428,
    2845
  ],
  "sentences": [
    "According to her report, during an appearance just outside of Cincinnati, \"Pretending to be a befuddled, senile President Biden, Don Jr. staggers around the low stage, eyes unfocused, making confused gestures and blundering into the giant red-white-and-blue backdrop.",
    "Tall and burly, with carefully manicured facial hair, the candidate has already done his quick opening act and faded into the background like a good sidekick,\" she wrote before dryly adding, \"He takes out his phone to snap the occasional photo.",
    "As Cottle details, Vance is seen as a \"weak\" candidate in need of the showmanship Don Jr. is providing at meet and greets where the hopeful potential, candidate fades into the background with the realization no one is there to see him.",
    "As the columnist explains, Vance owes whatever momentum he has before the primary to Trump and his oldest son because he never caught fire with GOP voters until the former president -- to the dismay of Ohio Republicans -- endorsed him.",
    "Certainly, there is nothing the former president enjoys as much as watching a former adversary grovel, and Mr. Vance has been happy to gush about how wrong he was in 2016 and what a great president Mr. Trump turned out to be.\"",
    "Writing that, \"Don Jr. clearly inherited the family flair for showmanship,\" she notes that Vance -- who is seeking to represent these voters -- spoke to the crowd then shuffled off in deference to the main attraction.",
    "Vance owes whatever momentum he has as he seeks the Republican Party nomination for an Ohio's open Senate seat to former president Donald Trump with a boost from Don Trump Jr coming to his rescue in the state.",
    "The moment he got the much-coveted Trump tap on April 15, the election became about one thing only: whether the former president has the juice to propel an unexceptional candidate to victory,\" she wrote.",
    "Distinctly overshadowed, Mr. Vance is aware that, while his name may be on the yard signs and stickers spread around the bar, he is not who most folks have come to see.\"",
    "Vance roadshow that just concluded, Cottle wrote: \"Even Mr. Vance seems to understand that what is at stake here has little to do with him.\"",
    "According to Cottle, Trump Jr. is an expert at entertaining the crowd relegating Vance to a \"good sidekick\" standing off to the side.",
    "\"Mr. Vance is no longer the star of his own race to win Tuesdays Republican primary in Ohio for U.S. Senate.",
    "In an opinion piece for the New York Times, columnist Michelle Cottle reports \"Hillbilly Elegy\" author J.D.",
    "The crowd, a couple of hundred MAGA fans and local Republican players, laps up the wickedness.\"",
    "\"Off to the side, chuckling awkwardly, hands jammed into his jeans pockets, stands Mr. Vance.",
    "Once or twice, he shoots a glance at the audience, as if to see how this show is playing.",
    "\"Why he decided Mr. Vance is that somebody has prompted head scratching.",
    "Summing up the Don Jr./J.D.",
    "(Answer: very well.)"
  ]
}