{
  "id": 6063,
  "mediaId": 195,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "GOP proxy battle in Ohio Senate primary reaches fever pitch",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/vancejd_trumpdonald_mandeljosh_cruzted_042922ap-see-credits-gn_split_gop-proxy-war-ohio.jpeg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3471886-gop-proxy-battle-in-ohio-senate-primary-reaches-fever-pitch/",
  "sentiment": "0.266",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    906,
    946,
    1147,
    1692,
    1801,
    3103,
    380,
    428,
    571,
    2845
  ],
  "sentences": [
    "He wont because his record is not conservative, it is not MAGA, it is not America First, it is not pro-working class, it is not conservative, it is not Tea Party.?\nThe Republican Senate primary in Ohio is one of several nominating contests in May that are seen as key tests of Trumps reputation as a political kingmaker and ability to bend the GOP electorate to his will ahead of a potential 2024 comeback bid for the White House.",
    "That move ignited a furious response from Vance, who said that Mandel and his allies have declared war on President Trump and the entire MAGA movement,? using an acronym for Trumps political slogan make America great again.?\nMandel used to be a pro-China establishment hack, and then he was a Tea Party Patriot, and then he was America First,? Vance said in a statement.",
    "But I think theres definitely some frustration there right now.?\nIn the wake of Trumps endorsement, the Club for Growth aired a television ad splicing together clips of Vance repeatedly bashing the former president and declaring himself a never-Trump guy.? One man featured in the ad goes on to say that Trump is getting it wrong with J.D.",
    "Cruz, who is seen as a potential contender for the 2024 Republican presidential nomination, is set to stump for Mandel in Ohio over the weekend, while two of Trumps staunchest allies in Congress, Reps. Matt Gaetz (R-Fla.) and Marjorie Taylor Greene (R-Ga.), are making a series of campaign stops with Vance.",
    "Kellyanne Conway, Trumps 2016 campaign manager and a former White House adviser, is backing former Ohio state GOP Chair Jane Timken in the Senate primary, while Sen. Rand Paul (R-Ky.) has endorsed another candidate, businessman Mike Gibbons, and is set to appear at a tele-townhall for him on Monday.",
    "There is a war for the soul of the Republican Party, and Im proud to be on the side of President Trump.?\nMandels allies, meanwhile, are scrambling to cast Vance as an opportunist who only began courting Trumps support when it became politically convenient for him.",
    "But that endorsement also put Trump at odds with a handful of other Republican power players, including Sen. Ted Cruz (R-Texas) and the conservative Club for Growth, who are supporting Mandel and have shown no signs of backing away from the race.",
    "The voters will rally around a Republican candidate, because they connect better with the voters of Ohio than the Democrats.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "But the strategist also waved off the notion that the bitter nominating contest could play into the hands of Democrats, who are already facing a tough election year nationally and have seen only limited success in Ohio in recent years.",
    "But the primary in Ohio has become particularly bitter because of the crowded candidate field and the involvement of many of Trumps current and former allies who are eager for the opportunity to fill the seat of retiring Sen.",
    "A recent Fox News poll conducted after Trump announced his support for Vance showed the Hillbilly Elegy? author overtaking his top rival, former state Treasurer Josh Mandel, for first place in the primary.",
    "Now, having been rejected by Trump after begging for his endorsement, Mandel has returned to his roots: with millions of dollars from the pro-China Club for Growth propping up his failing campaign.",
    "One Ohio-based Republican strategist acknowledged that the divisive nature of the GOP Senate primary could leave the eventual nominee bloodied? before the general election campaign even begins.",
    "But the eleventh-hour involvement of GOP heavyweights  including former President Trump  has ratcheted up tensions in the race and forced the primary battle into even more volatile territory.",
    "The party has largely coalesced around the candidacy of Rep. Tim Ryan (D-Ohio), though he still faces a primary challenge from his left in attorney and community organizer Morgan Harper.",
    "Hes also endorsed celebrity physician Mehmet Oz in Pennsylvanias Republican Senate contest and Rep. Ted Budd (N.C.) in the GOP Senate primary in North Carolina.",
    "The Ohio race has shown some splits that have really rubbed the president the wrong way,? said one former Trump adviser who is unaligned in the Senate primary.",
    "The Fox News survey released this week found Vance leading Mandel 23 percent to 18 percent, with Gibbons trailing in third place with 13 percent support.",
    "Another poll conducted about a week earlier by the Republican Trafalgar Group showed Mandel in the top position with 28 percent to Vances 23 percent.",
    "Vance.?\nThe 30-second spot infuriated Trump, who had come to view the Club for Growth and its President David McIntosh as key political allies.",
    "While the Republican primary in Ohio has reached a fever pitch in its final days, the Democratic contest has been a much calmer affair.",
    "After months of waiting out the race, Trump weighed in on the primary this month, endorsing author and venture capitalist J.D.",
    "The Republican proxy war unfolding in Ohios GOP Senate race is reaching a boiling point in the final days before the primary.",
    "The signs of a tightening contest are driving an influx of surrogates into Ohio in the final days before the May 3 primary.",
    "One of the biggest things the Republicans have going in this state is the complete ineptitude of the Ohio Democratic Party.",
    "The most recent polling in the primary, however, suggests that it has become a two-way race between Vance and Mandel.",
    "Vance run on his own record?? conservative radio host Mark Levin, who supports Mandel in the primary, tweeted.",
    "Nevertheless, the group has only ramped up its spending on the ad in defiance of the former president.",
    "Vance, a onetime critic who has since sought to recast himself as an acolyte of the former president.",
    "In Georgia, Trump has endorsed former Sen. David Perdue (R-Ga.) in the May 24 gubernatorial primary.",
    "The nominating contest has been rife with personal attacks and litmus tests for months.",
    "), is slated to campaign alongside Vance on Sunday and Monday.",
    "I dont think its that much of a concern,? the strategist said.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Republicans are going to get behind whoever wins the primary.",
    "I dont think thats really going to matter in the long term.",
    "The Club for Growth is also backing Budd in that race.",
    "Likewise, another Trump ally, Sen. Josh Hawley (R-Mo.",
    "Rob Portman (R-Ohio).",
    "When will J.D."
  ]
}