{
  "id": 6064,
  "mediaId": 65,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "House firebrands Gaetz, Greene say Vance is the Senate ally they need in rowdy campaign stop",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/fa420c8b-cbde-420e-aa6b-1fff46adf2d8/2f937140-7fa8-46ab-b331-68b7cb1c6efd/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/greene-vance-gaetz-ohio-senate-gop-primary",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    946,
    1147,
    1577,
    1801,
    3103,
    200,
    380,
    428,
    571
  ],
  "sentences": [
    "This is the type of leadership that Marjorie and I seek in Washington, D.C.\"\nOHIO TRUMP RALLY: FORMER PRESIDENT'S BACKING MAY 'PROPEL VANCE TO VICTORY,' INDICATE POWER OF HIS ENDORSEMENT\nGaetz and Greene, R-Ga., stumped for Vance in front of a rowdy crowd in Newark, Ohio, ahead of Tuesday's GOP primary election.",
    "They slammed Democrats for allegedly pushing gender identity lessons in schools, claimed the Centers for Disease Control and Prevention overreached on masks and vaccines and decried RINO (Republican In Name Only) Republicans who they said regularly cave to Democrats and the \"corrupt\" political establishment.",
    "Several voters who talked to Fox News Friday at a rally for former Ohio Treasurer Josh Mandel, one of four other major candidates in the primary, said they were disappointed with Trump's endorsement of Vance.",
    "WITH CRUZ BACKING, MANDEL BRUSHES OFF RINO ATTACKS AFTER BOOK ALLEGES DISHONESTY\nVance has acknowledged the comments about the former president and says he's had a genuine change of heart.",
    "Multiple voters who spoke to Fox News after the Vance rally Saturday said they were previously undecided on whether they'd support the candidate because of his comments about Trump.",
    "But Vance, who's also endorsed by former President Donald Trump, praised them and told Fox News their support should show he won't cave on key issues if elected.",
    "Gaetz and Greene are two of the most controversial members of Congress, often landing in hot water even with GOP leadership over their public comments.",
    "OHIO SENATE CANDIDATE 'NOT LOOKING BACKWARDS' IN GOP PRIMARY DOMINATED BY TRUMP\nGreene and Gaetz said Vance would be an ally for them in Congress.",
    "That's been the subject of attack ads and letters from GOP activists and officials claiming voters can't trust Vance to be sufficiently pro-Trump.",
    "Vance at a rally Saturday, saying Vance is the right person to fight for conservative values and win Ohio's open Senate seat in November.",
    "\"He admitted to saying some of the things that were said on TV and he  admitted to it and was sorry for it and that was enough.\"",
    "Vance put on a clinic in the debates, in the primaries,\" Gaetz, R-Fla., told Fox News in an interview before the rally.",
    "\"This is the whole reason why I endorsed JD early on, because I know he's a business guy, he's a family guy.",
    "Vance's opponents often attack him over the fact he was highly critical of Trump during the 2016 election.",
    "He cares about traditional values that Americans want desperately Congress to care about,\" Greene said.",
    "And I think that sends a signal that I'm not going to stab our voters in the back,\" Vance said.",
    "Republican Reps. Marjorie Taylor Greene and Matt Gaetz backed Ohio GOP Senate candidate J.D.",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "\"After I heard him speak, that was good enough for me,\" Vickie Boychan told Fox News.",
    "A lot of people change their mind on Donald Trump, and I'm one of them,\" Vance said.",
    "Vance said, \"It's not really about what I said about Trump six years ago.\"",
    "\"A lot of our voters don't mind so long as you're just honest with them.\"",
    "was aggressive and assertive, and he had vision and energy.",
    "Fox News' Mark Meredith contributed to this report.",
    "Tyler Olson covers politics for Fox News Digital.",
    "\"People aren't focused on the past,\" he said.",
    "\"I just think you have to tell the truth.",
    " This is the type of leadership we need.",
    "\"Donald Trump saw those debates.",
    "\"These two people right here.",
    "One called Vance a \"Judas.\"",
    "He saw the way J.D.",
    "Gaetz agreed.",
    "Right?",
    "\"J.D."
  ]
}