{
  "id": 6067,
  "mediaId": 65,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "Dolan 'not looking backwards' in Ohio GOP Senate primary dominated by Trump, amid bump in polls down stretch",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/59f539ee-5d31-4c35-8b7d-47c022c3dd89/b0e566bc-ded0-4a55-a577-2630b6db9b62/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/dolan-event-ohio-senate-columbus",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    1147,
    1801,
    2027,
    3103,
    379,
    428,
    571,
    2623,
    2845
  ],
  "sentences": [
    "FOX NEWS POLL: VANCE MOVES INTO TOP SPOT IN OHIO GOP SENATE PRIMARY\nDolan separated himself from the four other top candidates competing in the GOP primary by not aggressively courting former President Donald Trump's endorsement.",
    "Republican Ohio Senate candidate Matt Dolan didn't attract as much media attention as other candidates for most of the GOP primary  but he thinks he'll pull off a win due to his focus on Ohio voters over national politicians.",
    "WITH CRUZ BACKING, MANDEL BRUSHES OFF RINO ATTACKS AFTER BOOK ALLEGES DISHONESTY\nIn an interview at the Delaware County Republican Party Lincoln Reagan Dinner, the state senator made clear that he supports Trump's policies.",
    "Lacking flashy endorsements from national Republicans like some of the other candidates in the GOP primary  while also largely avoiding mudslinging and attacks  Dolan's hasn't been a mainstay of national news coverage.",
    "\"And I have felt it for some time because Ohio Republicans want somebody who's talking about their financial security, their neighborhood security, their border security, international security.\"",
    "But that endorsement was seen as a major blow to fellow candidates Mike Gibbons, Josh Mandel and Jane Timken, all of whom pressed hard to demonstrate their loyalty to the former president.",
    "That doesn't seem to bother Dolan, who was the only candidate besides Vance to gain ground in the Fox News Poll since the last iteration, before the Trump endorsement.",
    "Dolan says he thinks his message may be enough to win Tuesday's primary and to beat likely Democratic nominee Rep. Tim Ryan, R-Ohio, in the general election.",
    "And he's used a $2 million TV ad buy down the stretch of the campaign to tell voters to \"forget all their nonsense,\" referring to the other candidates.",
    "\"I don't know what they can offer to Republicans that want someone to be positive for what Republicans stand for and execute on that.",
    "It costs more to put food on your table for your family, costs more to fill up your gas tank,\" Dolan said of Biden's economy.",
    "\"I do,\" Dolan, a state senator, said when asked if he's feeling momentum on the ground that's reflected in some recent polls.",
    "(AP Photo/Andrew Harnik)\n\"He told American workers, Ohio workers, 'we don't need you to create our energy,'\" Dolan added.",
    "I'm focusing on stopping the Biden agenda and preparing for tomorrow's opportunities where we set a Republican agenda.\"",
    "But he was recently endorsed by the editorial boards of the Cleveland Plain Dealer and the Elyria Chronicle-Telegram.",
    "That helped Vance surge in the polls  he commanded a 23% first place share in a Fox News Poll released last week.",
    "\"President Trump was a Republican president who did some Republican ideas and executed on them.",
    "You can contact him at tyler.olson@fox.com and follow him on Twitter at @TylerOlson1791.",
    "Dolan added of the candidates who fought so hard for Trump's backing but didn't get it.",
    "Trump recently endorsed former investment banker and \"Hillbilly Elegy\" author J.D.",
    "Dolan's also offering plenty of the standard GOP criticism of President Biden.",
    "But he argues Ohio's Senate election shouldn't be so centered on one man.",
    "Somebody who's going to go and execute and fight for Ohio,\" Dolan said.",
    "But the thing is with me, my message isn't going to have to change.",
    "Our economy was better,\" Dolan told Fox News Friday.",
    "\"I don't know what they can offer to Ohioans now.\"",
    "Tyler Olson covers politics for Fox News Digital.",
    "\"I believe my message resonates with all of Ohio.",
    "I've outperformed President Trump,\" Dolan added.",
    "He was down double-digits still, with just 11%.",
    "\"GDP goes down, but the inflation rate goes up.",
    "Other polls show Dolan running even higher.",
    "\"Voters want to look forward,\" Dolan said.",
    "My message has always been about Ohio.\"",
    "\"I can appeal to the suburban voters.",
    "\"Frankly, I've been on the ballot.",
    "We've got to move on from that.\"",
    "And our country was stronger.",
    "\"I'm not looking backwards.",
    "Vance in the GOP primary.",
    "I'm offering that.\"",
    "\"That is crazy.",
    "I have."
  ]
}