{
  "id": 6078,
  "mediaId": 237,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Mike drop: Trump endorses Pences brother without mentioning veep",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/659c17a/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F52%2F05%2F4ac65a8a43518e302842b0b45229%2Fwex-greg-pence-7.JPG",
  "link": "https://www.washingtonexaminer.com/politics/mike-drop-trump-endorses-pences-brother-without-mentioning-veep",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cami Mondeaux",
  "authorUrl": "https://www.washingtonexaminer.com/author/cami-mondeaux",
  "termIds": [
    3103
  ],
  "sentences": [
    "Greg Pence has my Complete and Total Endorsement!?\nThe endorsement comes as the relationship between Trump and Mike Pence appears to have frayed since the Capitol riot, a day in which the then vice president refused to try and overturn the 2020 election results as desired by Trump.",
    "Mike Pence, who may be considering his own presidential bid in 2024, has tried to maintain a positive spin on his White House tenure by touting Trump's \"leadership,\" though the former vice president has said he and Trump may never see \"eye to eye\" about Jan. 6.",
    "Trump praised Greg Pence, who is vying to be reelected to his seat representing Indianas 6th Congressional District, for his anti-abortion stances and support for strengthening Second Amendment rights.",
    "Former President Donald Trump endorsed Indiana Rep. Greg Pence for reelection, offering his coveted support without mentioning the congressmans relation to Trump's vice president, Mike Pence.",
    "Greg is working hard to reverse Joe Bidens disastrous record of out-of-control Inflation and restore the respect our Country deserves from abroad,? Trump said in a statement Friday.",
    "The primary elections will offer a glimpse into how much influence the former president still holds in the Republican Party and how effective his endorsements will be in November.",
    "I havent spoken to him in a long time.?\nTrump has made several high-profile endorsements in the 2022 midterm elections so far, offering support last week to J.D.",
    "He is Strong on the Border, Protects Life, Defends the Second Amendment, and Supports our brave Military and Vets.",
    "2 as his running mate should he mount another White House campaign in 2024 and win the Republican nomination.",
    "Mike and I had a great relationship except for the very important factor that took place at the end.",
    "I dont think the people would accept it,? Trump told the Washington Examiner in March.",
    "Trump has effectively ruled out tapping his former No.",
    "Vance, who is vying for an open Senate seat in Ohio.",
    "We had a very good relationship,? Trump said."
  ]
}