{
  "id": 6080,
  "mediaId": 237,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Jane Timken tries to stand out in crowded Ohio Republican Senate primary field",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/f74ea8c/2147483647/strip/true/crop/2520x1323+235+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F9a%2F24%2F713f23224070b2ca7df36509d8ef%2Fap22047690407886.jpg",
  "link": "https://www.washingtonexaminer.com/news/jane-timken-tries-to-avoid-also-ran-role-in-tense-ohio-gop-senate-primary-fight",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Scanlon",
  "authorUrl": "https://www.washingtonexaminer.com/author/kate-scanlon",
  "termIds": [
    946,
    1115,
    1147,
    1801,
    2027,
    2466,
    3103,
    428,
    571,
    2845
  ],
  "sentences": [
    "He's taken a look at this race and said, This is the person I want to keep the seat.? Timken also said she has been in the trenches fighting for those America First policies.?\nIn interviews with self-identified Ohio voters last week, many told the Washington Examiner that they were disgusted or disillusioned by the contentious Republican primary.",
    "Just In...\nCOLUMBUS, Ohio  With the states primary just days away, Ohio Republican Senate candidate Jane Timken, a former state party chairwoman, is hoping to cut through the confusion? of the contentious primary in a pitch to undecided voters, she told the Washington Examiner.",
    "The surge for Dolan surprised some political observers, as Dolan, also a part-owner of the Cleveland Guardians, has cast himself as a supporter of Trumps agenda but condemned his unfounded claims that the 2020 election was stolen.",
    "There's candidates in this race who are all about themselves and like to hear themselves talk, or want to wake up every morning and try to get themselves canceled on social media or say the most outrageous thing,? Timken said.",
    "As a candidate, Timken has sought to thread the needle between her support for Trump and her support from some quarters of Ohios Republican political establishment, including an endorsement from the states outgoing Sen.",
    "My voters are sticking with me.?\nTimken argued the race should be about who's best to defeat Tim Ryan,? the Ohio congressman and front-runner for the Democratic nomination.",
    "The race for the Republican nomination in Ohio, a state crucial to Republicans efforts to win a Senate majority in the midterm elections, is still fluid in its final days.",
    "That's not true leadership.?\nTimken said she was disappointed? by Trumps endorsement of Vance but argued, He supported me to become chair of the Republican Party? in Ohio.",
    "You've seen two of the candidates almost come into fistfights at the debate,? Timken said in reference to a moment at a recent debate in which Mandel got in Gibbonss face.",
    "I think there's a significant number of undecided voters, and I think at the end of the day, this is going to be about who turns their voters out,? she said.",
    "Vance, who has been endorsed by former President Donald Trump, former state Treasurer Josh Mandel, businessman Mike Gibbons, and state Sen. Matt Dolan.",
    "A recent Fox News poll showed Vance in the lead, but with a full quarter of respondents still undecided.",
    "But another recent poll by Blueprint Polling found Dolan in first place, followed closely by Vance.",
    "Asked how she would respond to those voters, Timken acknowledged it has been a nasty process.",
    "It doesn't change the fact that I delivered Ohio for President Trump,? she said.",
    "In an interview, Timken was optimistic about her chances.",
    "It's critically important to keep this seat,? she said.",
    "Portman has endorsed me,? Timken said.",
    "The field also includes author J.D.",
    "Rob Portman.",
    "Sen."
  ]
}