{
  "id": 6085,
  "mediaId": 151,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Republican who refuses to bend the knee to Trump surges in Ohio Senate race",
  "image": "https://www.politico.com/dims4/default/cae5bab/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F88%2F5a%2Ffe6272cf4c8eaf8e38ef8b41f102%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1239309619",
  "link": "https://www.politico.com/news/2022/04/29/trump-says-matt-dolan-is-not-fit-for-ohios-senate-seat-hes-gaining-ground-anyway-00028824",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1147,
    1801,
    2027,
    2131,
    2466,
    3103,
    380,
    428,
    571,
    2845
  ],
  "sentences": [
    "I think its playing out as I thought it was going to play out.?\nInternal Dolan polling shows him tracking to second place,? according to a person familiar with the data who said the campaign has a glide path to getting a plurality of the vote.?\nWidely viewed as a longshot, Dolan has avoided any real attacks from his opponents, who took turns going after one another for months in a cutthroat primary that has generated nearly $70 million in ad spending.",
    "Such is the case for Matt Dolan, who I dont know, have never met, and may be a very nice guy, but the team will always remain the Cleveland Indians to me!?\nA person close to Trump insisted there was no particular reason the former president released the Dolan statement Tuesday, and that it was unrelated to polling data circulating on Twitter that day placing Dolan in the lead or in second place.",
    "You can be for pro-Trump policies and not share his personality, and thats what is taking hold among Ohio Republicans.?\nIn contrast with Dolan, whose large investment in the race for months appeared futile as he failed to gain significant traction, Gibbons, a wealthy business owner, has taken a dive after peaking earlier this year and loaning his campaign more than $16 million.",
    "While his campaign events this week havent drawn high-profile supporters  such as Trump, who held a rally Saturday to support Vance, or Donald Trump Jr., who has visited the state twice in recent days to stump with Vance  Dolan has earned endorsements from three newspaper editorial boards and dozens of municipal office holders around the state.",
    "He called the Jan. 6 attack on the Capitol a failure of leadership? by Trump and an attack on democracy.? At a March 21 debate, Dolan was the only candidate to raise his hand when the moderator asked who believed it was time for Trump to stop talking about the 2020 election.",
    "I think theres mounting evidence that hes in a scenario where hes running up the middle, unmolested, with a unique message and some things in his favor,? said Mike Murphy, a Republican strategist who lives out of state but donated $250 to Dolans campaign in October.",
    "Dolans campaign and the Club for Growth are leading in television ads right now, followed by the pro-Vance super PAC Protect Ohio Values, an outside expenditure group that has received $13.5 million in donations from billionaire tech executive Peter Thiel.",
    "Its approach has been to thread the needle between support for Trumps agenda  Dolan joined other candidates in the primary in running an ad about closing the southern border  and his unapologetic denunciations of Trumps baseless election fraud crusade.",
    "The Club for Growth  a super PAC supporting former state Treasurer Josh Mandel, who has led in polls throughout most of the primary  took out ads targeting Vance, Jane Timken and Mike Gibbons as each saw gains in support in recent months.",
    "In addition to emerging unscathed after the other candidates spent months hurling insults at each other, Dolan fits the mold of pragmatic conservatives whom Ohio Republicans have traditionally chosen for Senate, including retiring Sen.",
    "On Tuesday, he attacked Dolan not as an opponent of his America First agenda, but because the Major League Baseball team Dolan and his family own, the Cleveland Guardians, changed its name from the Indians after the 2021 season.",
    "The person noted that the message was something Trump has been saying for months?  at least since Dolan entered the race in September  and that Trump just wanted to remind people? about the Dolans role in the team name change.",
    "Mandel, meanwhile, has kept a low profile after traveling to campaign stops last week with Michael Flynn, Trumps former national security adviser and a leading advocate for efforts to overturn the 2020 presidential election.",
    "| Andrew Spear/Getty Images\nBy Natalie Allison\n 04/29/2022 04:31 AM EDT\nThe field of candidates chasing Ohios GOP Senate nomination has pledged allegiance to former President Donald Trump and beaten a path to Mar-a-Lago.",
    "Vance  who received Trumps endorsement last week  has surged into first place according to the most recent Fox News poll, Dolan was the only other top contender to gain ground in the poll since last month.",
    "Throughout the campaign, Dolans staff has been dogged? about seeking corrections to any news reports that referred to Dolan as anti-Trump or a Never Trumper, according to a person working on the campaign.",
    "Anybody who changes the name of the storied Cleveland Indians (from 1916), an original baseball franchise, to the Cleveland Guardians, is not fit to serve in the United States Senate,? Trump wrote.",
    "But Timken has been dark on broadcast television and cable for weeks in several markets, and has been completely off broadcast statewide the past week, running only $15,000 worth of cable ads.",
    "Hes got the momentum, as of last week.?\nDolan likely has a low ceiling of support, given his dependence on Republican voters who are willing to move on from Trump  a minority of the party.",
    "Whatever momentum Dolan is riding, it was enough to prompt Trump to release a statement Tuesday suggesting that the state senator is not fit? to serve in the Senate.",
    "But they and other campaigns and outside interest groups never targeted Dolan, who has spent heavily on television ads with his own positive message since January.",
    "Now, after languishing at the bottom of the polls since joining the Republican field, Dolan is finding that his strategy is finally showing signs of paying off.",
    "They would explain to reporters that Dolan had twice voted for Trump  unlike Vance  and that Dolan has said he would do so again if Trump were the nominee.",
    "A separate poll released Tuesday by Blueprint Polling actually placed Dolan in first place with 18 percent of the vote, followed by Vance at 17 percent.",
    "The state senator has declined to kiss the ring, and instead run as a traditional conservative  pouring $10.6 million of his own money into the effort.",
    "When I made my decision to get into the race, I knew that it was going to be a tough slog, at least publicly, for a while,? Dolan said in an interview.",
    "What we sought to do from the outset was illustrate to folks that this race has to be about Ohio,? said Chris Maloney, Dolans campaign consultant.",
    "Dolan and Timken have had campaign staff out on foot for more than two months, allowing them to have an established ground campaign.",
    "Though Dolans campaign was once dismissed as a vanity project, Trump has long paid attention to a possible rise by the candidate.",
    "Dolans campaign is well aware that Trumps approval rating among Republican voters in the state is as high as 85 percent.",
    "Throughout the campaign, Dolan has said he was not part of the decision to change the name, but supports his family.",
    "Matt Dolan fits the mold of pragmatic conservatives whom Ohio Republicans have traditionally chosen for Senate.",
    "At a recent debate, Dolan was asked whether he could win the Republican nomination without Trumps support.",
    "Hes not an alien species at all to the normal comfort zone of the Ohio Republican Party,? Murphy said.",
    "He has accused the former president of perpetuat[ing] lies about the outcome? of the 2020 election.",
    "A super PAC supporting her, Winning for Women, now has only a small number of cable spots running.",
    "Local surrogates have also engaged in an aggressive letters-to-the-editor campaign on his behalf.",
    "The irony of this whole thing is Im the only one who has implemented Republican Trump ideas.?",
    "I knew that I would not be doing well in the polls until much, much later in the campaign.",
    "Dolan has also said that he would not have voted to convict Trump in an impeachment trial.",
    "Days before the May 3 primary, Dolan appears to be experiencing a late burst of momentum.",
    "Yet Dolan has been careful to highlight that he considers himself a Trump supporter.",
    "Of course I can win,? Dolan said, pivoting to his record in the Ohio Legislature.",
    "Murphy, the Republican strategist, noted several factors are helping Dolan now.",
    "This weekend, Mandel will appear at events with Sen. Ted Cruz (R-Texas).",
    "Dolan is the lone candidate who refuses to toe the Trump line.",
    "But in a splintered field of candidates, that could be enough.",
    "But its a competitive race, and hes in it.",
    "Does it mean he has a lock on the race?",
    "Rob Portman, former Sen. and Gov.",
    "George Voinovich and current Gov.",
    "But not Matt Dolan.",
    "Mike DeWine.",
    "While J.D.",
    "No way."
  ]
}