{
  "id": 6094,
  "mediaId": 43,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Good News Roundup for Friday, April 29, 2022: Hope vs. Hopelessness",
  "image": "https://images.dailykos.com/images/1022685/story_image/pansies.jpg?1641051327",
  "link": "https://www.dailykos.com/story/2022/4/29/2093853/-Good-News-Roundup-for-Friday-April-29-2022-Hope-vs-Hopelessness",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1223,
    1252,
    2087,
    3103,
    4399,
    3436,
    2888,
    2942,
    5019
  ],
  "sentences": [
    "Agencies Are Advancing the Human Rights of LGBTQI+ Persons Around the World\nThursday, April 28, 2022: FACT SHEET: President Bidens Comprehensive Proposal to Hold Russian Oligarchs and Elites Accountable\nThursday, April 28, 2022: Background Press Call by Senior Administration Officials on the Declaration for the Future of the Internet\nThursday, April 28, 2022: FACT SHEET: United States and 60 Global Partners Launch Declaration for the Future of the Internet\nThursday, April 28, 2022: FACT SHEET: The Small Business Boom Under the Biden-?Harris Administration\nWednesday, April 27, 2022: Remarks by President Biden at the 2022 National and State Teachers of the Year Event\nWednesday, April 27, 2022: Readout of White House Roundtable with Lesbian Leaders to Celebrate Lesbian Day of Visibility\nWednesday, April 27, 2022: Statement by Press Secretary Jen Psaki on the Presidents Travel to the Republic of Korea and Japan\nWednesday, April 27, 2022: Press Briefing by Press Secretary Jen Psaki, April 27, 2022\nWednesday, April 27, 2022: Remarks by First Lady Jill Biden at the 2022 National and State Teachers of the Year Event\nWednesday, April 27, 2022: Fact Sheet: Biden Administration Underscores Urgent Need for Additional COVID-?19 Response Funding and the Severe Consequences of Congressional Inaction\nWednesday, April 27, 2022: Remarks by President Biden at the Funeral of Secretary of State Madeleine Albright\nWednesday, April 27, 2022: A Proclamation on Workers Memorial Day, 2022\nWednesday, April 27, 2022: Statement by White House Press Secretary Jen Psaki on the Bilateral Meeting between President Joe Biden and Prime Minister Mario Draghi of Italy\nWednesday, April 27, 2022: President Biden Names Seventeenth Round of Judicial Nominees\nWednesday, April 27, 2022: Statement from President Joe Biden on the Return of Trevor Reed\nTuesday, April 26, 2022: Press Briefing by Press Secretary Jen Psaki and White House COVID-?19 Response Coordinator Dr. Ashish Jha\nTuesday, April 26, 2022: President Biden Announces Key Regional Appointments for HHS\nTuesday, April 26, 2022: Nomination Sent to the Senate\nTuesday, April 26, 2022: Statement from Press Secretary to the Vice President Kirsten Allen\nTuesday, April 26, 2022: Statement by White House Press Secretary Jen Psaki on the Bilateral Virtual Meeting Between President Joe Biden and President Andrs Manuel Lpez Obrador\nTuesday, April 26, 2022: FACT SHEET: Biden-?Harris Administration Expands Second Chance Opportunities for Formerly Incarcerated Persons\nTuesday, April 26, 2022: Clemency Recipient List\nTuesday, April 26, 2022: Statement by President Joe Biden on Clemency and Second Chance Month\nTuesday, April 26, 2022: FACT SHEET: Biden Administration Increases Access to COVID-?19 Treatments and Boosts Patient and Provider Awareness\nMonday, April 25, 2022: Readout of National Security Advisor Jake Sullivan call with South African National Security Advisor Sydney Mufamadi\nMonday, April 25, 2022: Readout of National Security Advisor Jake Sullivans Meeting with National Security Advisor Dr. Eyal Hulata of Israel\nMonday, April 25, 2022: Press Briefing by Press Secretary Jen Psaki, April 25, 2022\nMonday, April 25, 2022: Remarks by President Biden Welcoming the 2020 and 2021 Stanley Cup Champions Tampa Bay Lightning\nMonday, April 25, 2022: Nominations and Withdrawals Sent to the Senate\nMonday, April 25, 2022: Remarks by President Biden After Air Force One Arrival\nMonday, April 25, 2022: Readout of President Bidens Call with President Macron of France\nMonday, April 25, 2022: Readout of President Bidens Call with His Majesty King Abdullah II of Jordan\nMonday, April 25, 2022: Statement by President Joe Biden on World Malaria Day\nMonday, April 25, 2022: FACT SHEET: The Domestic Counter-Unmanned Aircraft Systems National Action Plan\nMonday, April 25, 2022: Statement by President Joe Biden on Keeping our Promise to Veterans Suffering from Toxic Environmental Exposures\nMonday, April 25, 2022: President Biden Announces Nominee for Ambassador to Ukraine\nSunday, April 24, 2022: Readout of President Bidens Call with Prime Minister Naftali Bennett of Israel\nSunday, April 24, 2022: Statement by President Joe Biden on the Passing of Former Senator Orrin Hatch\nSunday, April 24, 2022: Statement by President Joe Biden on Armenian Remembrance Day\nSaturday, April 23, 2022: Statement by President Joe Biden on Orthodox Easter\nFriday, April 22, 2022: Remarks by President Biden on Lowering Costs for American Families\nFriday, April 22, 2022: Statement by NSC Spokesperson Adrienne Watson on National Security Advisor Jake Sullivans meeting with Prime Minister Shmyhal of Ukraine\nFriday, April 22, 2022: Remarks By President Biden on Earth Day and at Signing of an Executive Order Strengthening the Nations Forests, Communities, and Local Economies\nFriday, April 22, 2022: Statement on National Security Advisor Jake Sullivan meeting with Secretary Gustavo Beliz of Argentina\nFriday, April 22, 2022: Executive Order on Strengthening the Nations Forests, Communities, and Local Economies\nFriday, April 22, 2022: A Proclamation on Days Of Remembrance Of Victims Of The Holocaust, 2022\nFriday, April 22, 2022: A Proclamation on National Crime Victims Rights Week, 2022\nFriday, April 22, 2022:President Biden Announces Appointments to Air Force and Military Academy Boards\nFriday, April 22, 2022: President Biden Announces Key Nominees\nFriday, April 22, 2022: President Biden Announces Five New Nominees to Serve as U.S.",
    "Thursday, April 28, 2022: Statement by NSC Spokesperson Adrienne Watson on National Security Advisor Jake Sullivans Meeting with Minister for Foreign Affairs and for Defense Simon Coveney of Ireland\nThursday, April 28, 2022: Press Briefing by Press Secretary Jen Psaki, April 28, 2022\nThursday, April 28, 2022: Remarks by President Biden Before Meeting with Small-Business Owners\nThursday, April 28, 2022: A Proclamation on Law Day, U.S.A., 2022\nThursday, April 28, 2022: Remarks by President Biden on the Request to Congress for Additional Funding to Support Ukraine\nThursday, April 28, 2022: Background Press Call by Senior Administration Officials on the Ukraine Supplemental Budget Request\nThursday, April 28, 2022: FACT SHEET: White House Calls on Congress to Provide Additional Support for Ukraine\nThursday, April 28, 2022: Letter to the Speaker of the House of Representatives on Fiscal Year 2022 Emergency Supplemental Funding\nThursday, April 28, 2022: Statement by President Joe Biden on Gross Domestic Product\nThursday, April 28, 2022: FACT SHEET: U.S.",
    "g'\nGlobal support for Ukraine Karen DeYoung and Annabelle Timsit Washington Post\nRAMSTEIN AIR BASE, Germany  Defense Secretary Lloyd Austin told a gathering of\n Lloyd Austin, but not in Germany\nmilitary leaders in Germany that Ukraines resistance has brought inspiration to the free world and even greater resolve to NATO?  and that Russian President Vladimir Putin never imagined that the world would rally behind Ukraine so swiftly and surely.?\nAustins remarks, as he opened a U.S.-organized gathering of more than 40 countries to discuss Ukrainian defense needs for the fight against Russia, came as the United States announced more military aid and plans to reopen its embassy in Ukraines capital, Poland said it would send tanks, and Germany planned to send armored antiaircraft vehicles.",
    "Attorneys\nFriday, April 22, 2022: FACT SHEET: Biden-?Harris Administration Releases Recommendations for Advancing Use of Equitable Data\nFriday, April 22, 2022: Readout of Senior Administration Travel to Hawaii, Fiji, Papua New Guinea, and Solomon Islands\nFriday, April 22, 2022: FACT SHEET: President Biden Signs Executive Order to Strengthen Americas Forests, Boost Wildfire Resilience, and Combat Global Deforestation\nAccording to the CDC, as of April 28, 2022, 89% of US adults have had at least one jab.",
    "But they did not point out the other forces that should give us hope: (1) Macron is the first French president to win re-election in twenty years, so he was breaking a trend; (2) This is a huge victory compared to places like the US; (3) We have to expect France has been subject to the same russian troll campaign that has taken place in the US; (4) Its a reverse of a trend of falling apart.",
    "g? Out with the Bad, In with the Good g?\nRussia cut off its oil and gas supplies to Bulgaria and Poland Alice TideyEuro News\nIf there was ever a time for Russia to cut off gas supplies to Poland and Bulgaria, spring was probably ideal as consumers are unlikely to feel the impact at home  but the race is now on to find alternatives for industry and before the cold returns.",
    " Occupy Democrats (@OccupyDemocrats) April 27, 2022\nMichigan GOP insider resigns, citing delusional lies Craig Mauger Detroit News\nLansing  Tony Daunt, a longtime Michigan Republican insider, resigned Tuesday night from the GOP's state committee, saying party leaders had made the coming election a test of \"who is most cravenly loyal\" to former President Donald Trump.",
    "The poll reports that, while young voters are largely frustrated about the lack of progress under Biden, 18-to-29-year-olds are on track to match 2018s record-breaking youth turnout in a midterm election this November and prefer Democratic control 55%-34%.? Thats essentially no different from how young people voted in 2020, as CNNs Harry Enten points out.",
    "?\nTchekmedyian's story detailed efforts by sheriff's department officials to cover up an incident in which a deputy kneeled on the head of a handcuffed inmate for three minutes in March 2021, less than two months after the California attorney general had announced an investigation into the sheriff's department over human rights violations.",
    "pic.twitter.com/6WmW9gPPiY\n Goodable (@Goodable) April 27, 2022\nInternships? for adults are bringing women back into the workforce MaryLou Costa Reasons to Be Cheerful\nAfter a 10-year career break to take care of her two young daughters, Rachael Grieve recalls jumping back into the job market in 2019 and finding nothing but despair.",
    "https://t.co/nwVOsZOTgI\n Euromaidan PR (@EuromaidanPR) April 25, 2022\nRoger Stone returns to Twitter but is immediately rebanned Zachary Petrizzo, The Daily Beast\nAfter Elon Musk purchased Twitter for $44 billion, veteran GOP operative Roger Stone thought he was safe to return to the platform after being permanently banned in 2017.",
    "Besides contacting your representatives at the state and federal level to do the right thing (depending on who they are), you can support and contact these organizations:\nACLU  American Civil Liberties Union\nDemocracy Docket  founded by Marc Elias, so important in fighting the challenges after the last election.",
    " Duty To Warn g (@duty2warn) April 28, 2022\ng? Washington State requires new buildings to be electric Paige Bennett EcoWatch\nThe first mandate in the U.S. to require all-electric heating has passed in Washington state, where newly constructed buildings will need to install electric heating and hot-water systems.",
    "Their contempt for a system that favors the elite and is overwhelmingly partisan is clear, but at the same time they see a role for government and are unlikely to abandon those most in need.? Moreover, Volpe said, they are as engaged, if not more, than they were in the recent midterms.",
    "Another stupid stunt (actually rescues DeSantis)\nx\nBREAKING: Disney hits back HARD at Ron DeSantis and the GOP  says that Florida can't legally dissolve its self-governing district unless the state pays off the district's $1 billion debts due to a pledge in the original 1967 law.",
    "Trump, Jr. went after Mandel on Thursday after journalist David Catanese published quotes about the former Ohio treasurer the forthcoming book This Will Not Pass: Trump, Biden, and the Battle for America's Future by New York Times journalists Jonathan Martin and Alexander Burns.",
    "We have shown once again that through hard work, Democrats, Republicans, and Independents can come together to do what is right for Maine people  and that we can do so without the rancor or bitter partisanship that has divided Augusta in the past,? said Governor Mills.",
    "You find yourself stuck as to where to go.?\nSoon after that, a chance conversation with a friend who still worked at her previous employer, financial services group Nomura, led to Grieve returning, and ultimately, setting up the companys Returners Program in 2019.",
    " Occupy Democrats (@OccupyDemocrats) April 28, 2022\ng' Republicans in Disarray g'\ntRump Jr lashes out at Cruz-backed candidate in OH Bob Brigham Raw Story\nOn Friday and Saturday, Cruz is scheduled to stump for Mandel in Dayton, Toledo, Columbus, and Cincinnati.",
    "Gazprom's decision, announced to the two interested EU member states on Tuesday evening, has been described as \"blackmail\" by Brussels chief Ursula von der Leyen and a \"stark reminder\" that the bloc needs \"reliable partners to build its energy independence.\"",
    "A few particular points that spurred recruitment this year:\nThe combination of the wins in Georgia on January 5th and the insurrection on January 6th were the 12 punch of hope + rage that inspired thousands to raise their hands\ng? Defund the seditionists.",
    "x\nBREAKING NEWS: The owner of the Las Vegas Raiders drops bombshell, announces that they will welcome? Colin Kaepernick to join the Raiders with open arms  & declares that Kaepernick deserves the chance? because he sacrificed? for an important? cause.",
    "Vanessa Romo NPR\nThe Los Angeles County sheriff now says the department is not pursuing criminal charges against a journalist at the Los Angeles Times over a report about the attempted cover-up of an inmate abuse incident by sheriff's deputies.",
    "The announcement is an apparent change of course after a striking Tuesday news conference in which Sheriff Alex Villanueva, asked directly about Times reporter Alene Tchekmedyian, responded that \"all parties\" were subject to investigation.",
    "Heres some stuff from their website:\nAs of the end of 2021: Weve recruited more than 90,000 people to consider running for office, endorsed more than 1800, and elected 637 all-stars to local office in nearly every single state!",
    "Why it matters: The bill is one of dozens being legislated across the country as Republican lawmakers move to prohibit trans women and girls from participating in school sports teams that align with their gender identity.",
    "Washington Post\nA new poll from the Institute of Politics (IOP) at Harvard Kennedy School is causing angst among Democrats for showing that President Bidens approval rating among young voters has dropped substantially.",
    "The mandate passed 11 to 3 in a vote by the State Building Code Council to restrict the use of natural gas in multifamily housing complexes and commercial buildings by requiring installation of electric heat pumps.",
    "More: Why Matt Maddock was expelled from the GOP caucus\nFor five years, Daunt has been one of about 100 members of the Republican Party's state committee, a panel that helps guide the party's decisions.",
    "Worth noting: The state House also voted to uphold Kelly's veto of legislation that would allow parents to challenge school material that \"impairs the parents firmly held beliefs, values or principles.\"",
    "Daunt, who is one of two Republican members of the Board of State Canvassers, made the comment in an email addressed to Judy Rapanos, chairwoman of the 4th Congressional District Republican Committee.",
    "In that video in g? Odds and Ends g?, we can see what regular folks have done to fight climate change, despite the apathy of governments, and despite the active pushback from the fossil fuel industry.",
    "It just felt like all these doors were closed.?\nI still remember that desperation and fear, especially after interviews that destroy your confidence like that, which was humiliating at the same time.",
    "You are our greatest asset  and this budget delivers for you.?\nContrast this with Abbott of Texas, whose stunt at the border with faux inspections found no contraband and cost just Texas $4 billion.",
    "You are our greatest asset  and this budget delivers for you.?\nOne day after winning the overwhelming support of the Legislature, Governor Janet Mills signed the supplemental budget into law today.",
    "Open to people whove taken a career break of 18 months or more, the program offers 12 weeks of induction, training and coaching, after which time candidates can apply for positions at the company.",
    "g\ng' Our history has been a constant struggle between the American ideal that we all are created equal and the harsh ugly reality that racism, nativism, fear, demonization have long torn us apart.",
    "Fulton County GA is closing roads Donesha Aldridge 11Alive\nSeveral lanes and roads will be closed near the Fulton County Justice Center Complex next week, the Fulton County Sheriff's Office said.",
    "g' What You Can Do to Rescue Democracy g'\nIt turns out that participation in democracy is not just an every-four-years event but requires active participation, like, whenever you can find time.",
    "We may not be able to control inflation or global markets, but we can make sure that Maine people have what they need to grapple with these rising costs  and that is what we are doing.",
    "Other stories, based on Jane Austen novels  including a new one for lovers of Pride & Prejudice, Mrs. Bennets Advice to Young Ladies  and others on Greek mythology, can be found here.",
    "Note that they dont report the reason for the road closures in the article (I heard it on TRMS) but if you live in the area and need to know where you can(not) drive, its a good link.",
    "And, something we have all been waiting for:\nx\nHERE WE GO - the WaPo reports that the Jan. 6 Committee is likely to commence its public hearings on June 9 (Thurs) - in Prime Time.",
    "Republicans last year removed the office from Evers proposed budget, but the Democrat up for re-election this November got around them by creating it through an executive order.",
    "The inclusion of non-NATO countries such as Kenya, Tunisia and Japan was part of an effort to extend substantive and symbolic support for Ukraine beyond Europe and the alliance.",
    "But we are here to read the efforts and the positive results of those (including us and our fellow gnus) who are working so hard to save our country from those very bad people.",
    "pic.twitter.com/urn3kOw0MW\n Goodable (@Goodable) April 24, 2022\ng?Odds & Ends g?\nThis has been included in other GNRS by several GNR authors (Jessie and nifty, at least).",
    "The Trump family has since been openly feuding with the Club for Growth, which bills its endorsements as \"the gold standard\" in identifying conservative candidates.",
    "You will recognize many of the corporations, and you probably have a relationship with some  either you are a customer, a shareholder, or maybe even an employee.",
    "John Della Volpe, director of the IOP poll, finds: While this is an off-year election, theres no evidence in this survey that young Americans are off the grid.",
    "When you believe that things can get better, when you believe that improvements stand a chance, then you have reason to fight to make the world a better place.",
    "The budget delivers $850 direct relief payments to Maine people to help with the high costs of inflation one of the strongest relief proposals in the country.",
    "A recent offering: Hunters of the Feather, a story about a thinker-linker crow who wants to save birdkind from extinction, and the sequel, Scavengers of Mind.",
    "In fact its a technique that is weaponized by those who want us to give up (theres an example in the climate video in the g? Odds and Ends g? section below).",
    "I dont know how to deprogram 75 million people, but some things have been written about, such as deep canvassing, and lots of people are talking about this.",
    "This is a list with companies that sometimes have donated to the seditionists, and their current approach to supporting or not supporting the seditionists.",
    "It provides tax relief to working Maine families and two years of free community college to pandemic-impacted students, among other important initiatives.",
    "Near unified support for Ukraine in the House:\nx\nBREAKING: The House passes a bill expanding the President's authority to arm Ukraine by a vote of 417-10.",
    "Laura Kelly's (D) veto of a transgender athlete ban on Thursday after the state House failed to secure the two-thirds majority needed to override it.",
    "?\nThat brought us to year five, 2021  which somehow, in spite of the odds and everything going on in the world, was Run for Somethings best year yet.",
    "But another, very important reason, is that they decided to fight, and that gave hope and inspiration to everyone else who has decided to help them.",
    "The idea that it can sell its supplies to India and China may not work so well, as the pipelines dont connect and as the ships cant carry that much.",
    "And another, at least for the Europeans, is the selfish (but quite understandable) reason that they want to stop Putin before he goes any further.",
    "But it also shows how weaponized hopelessness? is being used by the fossil fuel industry to keep us from doing as much as we can about the crisis.",
    "Wisconsin governor Evers created a new office of environmental justice (bypassing Rs) Associated Press, Milwaukee Sentinel Journal\nMADISON  Gov.",
    "Young people have been interested in running for office in order to make change, to stand up for their communities, and fight for their values.",
    "They also like money and volunteers to help those people who are running, so even if youre not in a position to stand for office, you can help.",
    "Some of us expected it: the cheating, the lying, the chaos, and yes, even the attempts to cling to power despite the clear will of the people.",
    "At least 50% of water will also need to be warmed via electric heat pumps, although the remaining amount can be heated through other methods.",
    "But his homecoming didnt last long, as the longtime ally of ex-president Donald Trump was re-banned within hours of creating his new account.",
    "Current projects:\nLook in the comments for Progressive Muses report on Postcards to Voters\nAnd some other ideas:\nYou can relax and recharge.",
    "Some nations, such as Israel and Qatar, had representatives at the table, although they were not included on the official list of attendees.",
    "Oh, and if you listened to Rachels show from Wednesday night, you know that Daunt replaced the guy who refused to not certify the 2020 vote.",
    " CALL TO ACTIVISM (@CalltoActivism) April 28, 2022\ng Lets Honor Truth ??\n? The Sandy Hook parents have slain monsters Tortmaster Daily Kos.",
    "\"Compassion wins today,\" Kansas state Rep. Brandon Woodard (D), one of the states first out gay legislators, tweeted after the House vote.",
    "Now, one reason for creating headlines that alarm is because the MSM wants clickbait; evolution has designed humans to be alert to danger.",
    "She also sought to downplay the consequences, stressing that neighbouring countries have stepped up to supply gas to Poland and Bulgaria.",
    "Villanueva's original comments suggesting that Tchekmedyian could face criminal investigation drew immediate condemnation from the Times.",
    "Governor Mills (Maine) signs off on checks for Maine citizens Press Release\nToday, I am here to say to Maine people: help is on the way.",
    "Yes, there are other reasons Europe and the US may be more interested in helping Ukraine than they have been in helping other countries.",
    "Yosef 52, Daily Kos I really like this one, because every person with a diabetic in the family will care; the issue crosses pary lines.",
    "Enten also notes that voters under 30 support Democrats on a generic congressional ballot much more than they support President Biden.",
    "Something to do with him recruiting folks to challenge incumbents, which naturally irritates the bleep out of the current incumbents.",
    "Then pundits said, hey, thats not so good, LePen has been gaining over the years; she did better than she did in previous elections.",
    "In 2008, he stayed at a hotel that was throwing away unused bars of soap  so he offered to recycle them into new bars from his home.",
    "Senior defense officials from NATO and non-NATO countries attended the meeting, part of the new Ukraine Defense Consultative Group.",
    "Tony Evers on Friday signed an executive order creating a new office of environmental justice, announcing the move on Earth Day.",
    "He learned that cats at his local animal shelter didn't have any toys to play with, so he started selling lemonade to help them.",
    "You get people ready to self-deport (by the way, although people are fleeing from Ukraine, many people are also fleeing Russia).",
    "x\nIn Kashmir, a husband and wife noticed how many injured stray animals were around them and wanted to find a way to help them.",
    "But the party as a whole doesnt need to panic about young voters  at least not more than it does about the broader electorate.",
    "The goal will be to facilitate collaboration across state agencies to promote environmentally just policies, his office said.",
    "So, take the time to recharge your batteries, but find ways to contribute to the well-being of our country and our world.",
    "For example, in the winter, heat pumps can pull heat from outside, even if the temperature is low, and move it indoors.",
    "In warmer months, the opposite happens  the heat pump moves the warm indoor air outside to cool the buildings interior.",
    "Today, hes distributed 68 million new bars of soap and prevented 23 million pounds of old bars from entering landfills.",
    "But that ended Tuesday with his immediate resignation, three days after a contentious GOP convention in Grand Rapids.",
    "The revised energy code will see that new buildings have heat pumps rather than HVAC systems powered by natural gas.",
    "Regular Scheduled Programming\nNo one here is nave; we are aware of the many who are fighting to destroy our country.",
    "Instead of trying to reason with them (logic is obviously not their strong point) distract them with something else.",
    "If we get more of the Rs to wear masks and to get vaccinated and to vote for Ds, the country will be a better place.",
    "Yet, despite the inaction of so many governments, the actions of so many individuals have made a huge difference.",
    "They have endured insult after injury, as they were accused of being crisis actors and of never having had kids.",
    "Hope is a powerful weapon as well, the weapon of the truly righteous, those with truth and love on their side.",
    "Come in and nourish your hope as we and our friends around the world work to make this planet a better place.",
    "This might feel surprising  but we know (and have been saying since day one) that its never been about Trump.",
    "Why not browse a little, spend a little more time here today and come up with something different you can do.",
    "g' Democrats Being Cool g'\n  A lot of hands are being wring re the midterms and especially the young people.",
    "All 10 \"no\" votes were from Republicans, including Gosar, Biggs, Gaetz, Massie, and Marjorie Taylor Greene.",
    "The yawning gap in her resum left her with few opportunities that suited her ideal schedule and experience.",
    "Kansas legislators fail to override Governor Kellys vetos Shawna Chen Axios\nKansas legislators upheld Gov.",
    "Cruz, like the Club for Growth, stuck with Mandel even after Donald Trump endorsed venture capitalist J.D.",
    "Its because the grand jury in tRumps attempt to tamper with the vote in Fulton County is under selection.",
    "The above is just one program, but its a brilliant idea, especially given that there is a labor shortage.",
    "The battle is perennial, and victory is never assured.? g'\nPresident Joseph R. Biden\ng g g\nTRUTH MATTERS.",
    "The new office will work with the existing Office of Sustainability and Clean Energy, Evers office said.",
    "Its actions as an unreliable supplier will only accelerate Europes push to stop its reliance on Russia.",
    "Maddow (4/27) has some interesting analysis, in that Russia is cutting off its nose to spite its face.",
    "Everyone sighed with relief at Macrons victory, as LePen would have put out the welcome mat for Putin.",
    "In total, the budget give back is expected to deliver $1,700 in relief to the average Maine household.",
    "Well, he was just captured by our forces near Izyum, and hopefully he will be charged with war crimes.",
    "g gggggggggggggggg g\nx\nIn Afghanistan, a young woman realized kids didn't have enough access to books.",
    "So she got some books, found a school bus, turned it into a library, and drove it to different towns.",
    "I went home and burst into tears, thinking, thats it, Im done,? says Grieve, who is based in London.",
    "pic.twitter.com/7Pko7zICbT\n Goodable (@Goodable) April 29, 2022\ng? The kids are more than all right!",
    "Our candidate pipeline grew from 67,000 to more than 90,0002021 was our best recruitment year yet.",
    "A similar mandate for smaller residential buildings will be considered within the next few months.",
    "pic.twitter.com/iwK8xJ7eni\n Goodable (@Goodable) April 25, 2022\nStop Food Waste Day was April 27.",
    "Nine out of the ten returners who have gone through the program are now working there full-time.",
    "They've saved more than 1,000 animals so far, and helped more than 400 animals find new homes.",
    "All of us have your back,? Austin told Ukraine, in remarks that follow his own trip to Kyiv.",
    "In todays GNR, there are many examples of people fighting to make the world a better place.",
    "If you want to run for something, but have no idea what to do, these people will help you.",
    "We need to coax some of them out of the rabbit holes and diffuse the anger and the crazy.",
    "x\nBREAKING: An Oath Keeper used a recorded prison phone to ask his wife to hide evidence.",
    " Brian Tyler Cohen (@briantylercohen) April 28, 2022\ng Actions You Can Take g\nHEY THERE!",
    "This article outlines some steps that can be taken (some via legislation) to reduce it.",
    "And, I included an update on Run for something in the g Actions You Can Take g section.",
    "g Biden as President!g\nBiden, Harris and their administration have been hard at work.",
    "An LA Times journalist, Alene Tchekmedyian, exposed a coverup in a police department.",
    "If you know someone (who did not storm the Capitol), then see if you can be pleasant.",
    "Biden and Harris can do the top-down stuff, but we have to support from the bottom.",
    "2022 will be a big year for Run for Something and more importantly, for democracy.",
    "After a failed interview for an office manager position, she was left despondent.",
    "Today, she's now launched six libraries and helped over 300,000 children to read.",
    "On the other hand, hopelessness can make us hide under the covers and do nothing.",
    "But to hope is to believe in the possibility of things actually getting better.",
    "(By the way, using hope to motivate you works in other parts of your life, too!",
    "We are furious with them for what they are doing and we are letting them know.",
    "Contact them and compliment or complain, but let them know you are watching.",
    "x\nRemember that enemy scumbag whose wife told him to rape Ukrainian women?",
    "They planned and trained, and their self-sacrifice has inspired the world.",
    "For example, Macrons victory over LePen on Sunday was 58.54% to 41.46%.",
    "But so many of them are awful, it makes sense that they dont get along.",
    "g?? Schadenfreude g\nThis creep wont get the full vengeance he deserves.",
    "We need to remove the sources of lies and to take down the temperature.",
    "?\nEvers earlier this week announced the states first clean energy plan.",
    "They work by taking in heat from one area and pumping it into another.",
    "You get leaders fleeing their countries, like they did in Afghanistan.",
    "Furthermore, Poland has been working to get alternatives for a while.",
    "The world has plenty of truly bad things and genuinely evil people.",
    "They have taken on gun manufacturers, the gun lobby and Alex Jones.",
    "This may be the biggest issue threatening our democracy right now.",
    "Of course, there are reasons for despair, for alarm, for concern.",
    "Here are the last weeks posts at the White House briefing room.",
    "Thats contrary to the gloom-and-doom mood among many Democrats.",
    "Climate change may be caused by humans, but its not that bad\n4.",
    "x\nx\nPhases of climate change fight by fossil fuel industry:\n1.",
    "Nourish your hope, let it blossom g, and share it with others.",
    "Let's Power Up Hope\nWelcome g to Fridays Roundup of Good News!",
    "He's already sold more than $1,100  all for animals in need.",
    "Today, I am here to say to Maine people: help is on the way.",
    "We can strive to hope or we can surrender to hopelessness.",
    "The headlines are often designed to make us feel that way.",
    "Remember:\ng' There are more of us than there are of them.",
    "Heat pumps are energy-efficient alternatives to furnaces.",
    "This is just a reminder that Daunt is a truly awful guy.",
    "Olivia Rosane, Ecowatch\ng? I do a lot of other writing.",
    "Hopelessness is great for the winners when it works.",
    "One is probably the fact that theyre mostly white.",
    "THERE IS LOTS OF EVIDENCE THAT THEY ARE TERRIFIED!",
    "Fair Fight  founded by Stacey Abrams\ngGrass roots.",
    "Our own mayor, GoodNewsRoundup, started this fund.",
    "Thanks to an outcry, the sheriff has backed down.",
    "We are doomed, and it does not matter what we do.",
    "The best way to keep up your spirits is to fight.",
    "Jennifer Rubin has some reasons not to lose hope.",
    "g Its not all politics and progressive issues.)",
    "He now faces charges of Obstruction of Justice.",
    "You can get out the vote for special elections.",
    "So they started Kashmir's first animal rescue.",
    "This area is not far from Underground Atlanta.",
    "The mandate will go into effect in July 2023.",
    "The message was obtained by The Detroit News.",
    "Cleaning up the world, in more ways than one!",
    "RT IF YOU STAND WITH DISNEY AGAINST THE GOP!",
    "And thats true, and we should not ignore it.",
    "Climate is real but not caused by humans\n3.",
    "And Hunters is also available on Audible!)",
    "She was threatened with criminal charges.",
    "g' The Good News Roundup Saves Democracy!",
    "g Lets Celebrate Love ??\nSaving animals!",
    "But another reason is to create despair.",
    "And that other story about Matt Maddock.",
    "Why am I reporting a traffic issue here?",
    "g' They are terrified when we organize.",
    "You can join protests and freeway blog.",
    "You can reach out to upset Republicans.",
    "Come on, donate, and make a difference!",
    "Climate change is no longer avoidable.",
    "Thats because its really, really good.",
    "Or DeSantis whose war with Disney (!)",
    "You get people not bothering to vote.",
    "Why has Ukraine been doing so well?",
    "could cost local citizens a bundle.",
    "Buy and review or rate positively!",
    "g' They want us to be demoralized.",
    "You can help register new voters.",
    "Great if youre a freeway blogger!",
    "g Do you skim over this section?",
    "All that is just the beginning.",
    "You can share your ideas below.",
    "Climate change is not real\n2.",
    "They, too, have been working.",
    "Well, they decided to fight.",
    "g? Check out the memes here!",
    "But hes out of the action.",
    "We need to win some back.",
    "Oh, and yeah, Macron won.",
    "RT TO THANK THE RAIDERS!",
    "x\nThis is Shawn Siepler.",
    "Not bothering to fight.",
    "x\nThis is Ben Miller.",
    "Forward it to others.",
    "g? Run for something.",
    "Its all on the line.",
    "(Theyre really good!",
    "Theyre really cheap!",
    "They have persisted.",
    "And the cost is low.",
    "Hope is contagious.",
    "They just give up.",
    "Such a nice story!",
    "The list is long.",
    "Heres an example.",
    "g? About time!",
    "Voting rights.",
    "You can smile.",
    "LOVE MATTERS.",
    "He's nine.",
    "g' Unity?",
    "Whoops!",
    "Vance."
  ]
}