{
  "id": 6095,
  "mediaId": 157,
  "date": "d2022-04-29T00:00",
  "headline": "JD Vance suggests Biden is deliberately letting fentanyl into America to kill rural Trump supporters",
  "image": "https://www.rawstory.com/media-library/jd-vance.jpg?id=27686010&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/jd-vance-fentanyl-ohio/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    1147,
    1237,
    1801,
    2087,
    3103,
    428
  ],
  "sentences": [
    "Vance offered up a new conspiracy theory: that President Joe Biden is deliberately letting fentanyl into the country to worsen the opioid epidemic and kill people in rural areas that support former President Donald Trump.",
    "\"If you wanted to kill a bunch of MAGA voters in the middle of the heartland, how better than to target them and their kids with this fentanyl,\" said Vance, a venture capitalist and the author of \"Hillbilly Elegy.\"",
    "Watch below:\nVance says Biden is trying to kill MAGA voters: \\u201cIf you wanted to kill a bunch of MAGA voters in the middle of the heartland, how better to target them and their kids with this fentanyl ..",
    "It\\u2019s like Biden wants to punish people who didn\\u2019t vote for him.\\u201dpic.twitter.com/5Yoh0CA44z\n Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1651279271",
    "A lot of grandparents, man, who are taking care of grandkids that they weren't expecting to take care of because fentanyl killed their children.\"",
    "I mean of course most of our voters are not people who are suffering from this addiction, but they know a lot of people who are, right?",
    "On Friday, in conversation with longtime Trump ally Roger Stone, Republican Ohio Senate candidate J.D.",
    "\"And the crazy thing is, it's not just drug addicts who are affected by this, right?",
    "\"It's like Biden wants to punish people who didn't vote for him.\"",
    "\"It does look intentional,\" added Vance.",
    "Their kids are affected by it.",
    "It does look intentional."
  ]
}