{
  "id": 6101,
  "mediaId": 237,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Larry Hogan to throw down 2024 marker with Reagan library speech",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/1002394_sd_1651174304.jpg",
  "link": "https://www.washingtonexaminer.com/news/larry-hogan-to-throw-down-2024-marker-with-reagan-library-speech",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-m-drucker",
  "termIds": [
    3103
  ],
  "sentences": [
    "Channeling a famous address by Reagan from decades ago, Hogan declared that the party had come to another crossroads and once again faced a time for choosing.?\nHogan framed the choice as between Trump, who presided over losing the White House and was on the verge of losing control of the Senate as well, and the tradition of Reagan, a president who won two landslides and laid the foundation for the Republican revolution of 1994, when the GOP won both chambers of Congress in a wave.",
    "Next week, while in California for his speech at the Reagan library, Hogan will speak at the Milken Institute in Santa Monica, California, adjacent to Los Angeles, and headline two fundraisers for Lanhee Chen, the Republican candidate for state controller who received a surprise endorsement from the Los Angeles Times.",
    "I think we'll be seeing even more of him in settings like this as his term as governor winds down and he becomes more focused on 2024.?\nHogan, 65, was reelected in deep blue Maryland in 2018, an otherwise sour year for Republicans nationally, and will leave office in late January of next year due to term limits.",
    "On the other side is Marylands governor delivering an address from the Ronald Reagan Presidential Library and Museum in Southern California in which he is expected to blitzkrieg the former president and recommend that the party pursue a more traditionally conservative future.",
    "This weekend, the governor is headed to Amelia Island, Florida, near Jacksonville, to speak to a gathering of the Republican Main Street Partnership, a group that supports pragmatic conservatives in congressional primaries and general elections.",
    "Hogan is the latest Republican politician to receive an invite to the Reagan library to participate in its Time for Choosing? speaker series, which aims to elevate future party leaders, with an emphasis on potential presidents.",
    "Reagan, in the White House from 19811989, was a broadly popular two-term president, and the Republican Party he led seems antithetical to the GOP lorded over by Trump, a polarizing figure ousted after a single term.",
    "Chris Christie; Arkansas Sen. Tom Cotton; former Ambassador Nikki Haley; former Vice President Mike Pence; former Secretary of State Mike Pompeo; former House Speaker Paul Ryan; and South Carolina Sen. Tim Scott.",
    "But the library and museum that exists to perpetuate Reagans legacy is not picking sides in this internal debate over the direction of the party and has included Trump allies and alumni in the speaking series.",
    "The title, Time for Choosing,? comes from a famous speech Reagan delivered on behalf of Republican Barry Goldwaters 1964 presidential campaign in which he discussed his views on the future of the GOP.",
    "As the countdown on Hogans administration in Annapolis unfolds, he is stepping up his political engagement with activity that is sure to stoke speculation that he is running for president in 2024.",
    "Indeed, soon after Trumps defeat at the hands of now-President Joe Biden in the 2020 election, the governor appeared at an event in Washington, D.C., sponsored by the institution.",
    "The governor rarely pulls his punches when discussing his differences with Trump, and his address at the Reagan library is expected to be delivered with usual blunt candor.",
    "On Tuesday, Hogan is expected to expand on this theme with more specifics about his vision for the direction of the party, according to sources familiar with the speech.",
    "Larry Hogan will be across the country delivering a blistering speech urging the GOP to shun the former president and choose new leadership.",
    "Just In...\nAs Donald Trump hopes to be celebrating the victory of his endorsed Senate candidate in Ohios Republican primary, Maryland Gov.",
    "Later this year, Hogan is expected to make additional trips, including to the early caucus and primary states of Iowa and New Hampshire.",
    "Vance, a conservative populist in the mold of Trump, possibly winning the GOP Senate nomination in Ohio.",
    "These speeches are well-known precursors for a presidential run,? Republican strategist Jim Dornan said.",
    "This split-screen scenario offers a preview of a 2024 White House primary that could include Hogan.",
    "Chen is known in Washington circles for his work on Mitt Romneys 2012 presidential campaign.",
    "Time for Choosing? speakers have included former New Jersey Gov.",
    "This is not Hogans first rodeo for the Reagan library.",
    "On one side is J.D."
  ]
}