{
  "id": 6102,
  "mediaId": 2634,
  "date": "2022-04-22",
  "headline": "Why Donald Trump Might Forgive Kevin McCarthy—and Why He Might Not",
  "image": "https://images.newrepublic.com/136cbb10e0662a9533ff1c452ec28f1bd7f32926.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/166181/kevin-mccarthy-january-6-resign",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Noah",
  "authorUrl": "https://newrepublic.com/authors/timothy-noah",
  "termIds": [
    5592,
    1803,
    4951,
    4306,
    3879,
    3702,
    4066,
    2765,
    2943,
    2887
  ],
  "sentences": [
    "A New York Times story drawn from Jonathan Martin and Alexander Burns’s new book This Will Not Pass: Trump, Biden, and the Battle for America’s Future explores this question on a metaphorical level, with Republican congressional leaders enslaved by the Trump cult daring to believe for a brief moment that Trump’s goading a mob into storming the Capitol has brought about his political death—and later discovering, to their horror, that it did not.",
    "In a statement posted on Twitter, McCarthy called the Times reporting “totally false and wrong” and said “the corporate media is more concerned with profiting from manufactured political intrigue from politically motivated sources” than in addressing “the real issues facing Americans.” The politically motivated sources in this instance being a tape recorder.",
    "It was, Brooks said, “disappointing” that “President Trump lets Mitch McConnell manipulate him again.” The comic richness in this episode (and a source of infinite schadenfreude for Democrats) lies in its Stalinesque demonstration that it isn’t enough to kiss Trump’s ass; you have to kiss it in precisely the way Trump wishes to have it kissed.",
    "Vance may have said some not so great things about me in the past,” Trump said in his endorsement statement, “but he gets it now, and I have seen that in spades.” Reading between the lines, one perceives Trump’s deep satisfaction in bringing to heel in Vance a darling of Yale Law School and the fake-news peddlers of the mainstream press.",
    "“I don’t think he’ll take it,” McCarthy said, “but I don’t know.” McCarthy also said Trump’s behavior on January 6 was “atrocious and totally wrong.” This was all much stronger language than the cautious phrasing McCarthy used publicly at the time, when he said Trump “bears responsibility” for the attack and left it at that.",
    "In effect, McCarthy has for the past year been screaming to the judges for the annual John F. Kennedy Profiles in Courage Award, “Don’t you dare give that prize to me!” Taking pity on the poor man, the Kennedy presidential library gave it instead this week to Liz Cheney, Volodymyr Zelensky, and three other suckers.",
    "In a statement, Trump said:\nMo Brooks of Alabama made a horrible mistake recently when he went ‘woke’ and stated, referring to the 2020 Presidential Election Scam, ‘Put that behind you, put that behind you,’ despite the fact that the Election was rife with fraud and irregularities.",
    "Then, contradicting himself, Trump said: “Well, Kevin, I guess these people are more upset about the election then you are.” We know these details because McCarthy told GOP Rep. Jaime Herrera Beutler, whom Trump punished for her candor by endorsing her primary opponent.",
    "Vance is the author of the 2016 best-selling memoir of growing up in Appalachian poverty, Hillbilly Elegy, which is really quite good (I even kind of liked the movie) and won Vance respectful attention from what McCarthy calls the corporate media.",
    "Armando Iannucci’s brilliant 2017 farce, The Death of Stalin, explores that question on a literal plane, with Stalin’s deputies frantically maneuvering for position while Stalin, not yet entirely dead, lies insensible and unattended on the floor.",
    "The rich comic vein here is McCarthy’s frantic after-the-fact attempt, after Trump recovered in Republican polls, to suppress evidence that he displayed any integrity at all on the day of the insurrection and during the days that followed.",
    "I think that he’s noxious and is leading the white working class to a very dark place.” Vance made many similar statements that year by way of demonstrating that although he was a political conservative, he was not insane.",
    "In true Death of Stalin fashion, Brooks blamed his execution on Senate Minority Leader Mitch McConnell’s unwholesome influence on the 45thpresident of the United States (never much in evidence, but let’s not quibble).",
    "Until the Times piece, the principal evidence of this was McCarthy’s after-the-fact reframing as unexceptional a January 6 telephonic shouting match with Trump in which he told Trump to call off the mob.",
    "“And so,” Stockton concludes his story, “I leave it with all of you: Which came out of the opened door—the lady, or the tiger?” Stockton’s readers are left in torment about what the outcome will be.",
    "The Death of Stalin was an ensemble piece, but the Times story, and the farcical response to it by affected parties, is turning out to be a star vehicle for House Minority Leader Kevin McCarthy.",
    "We now change our dramatic frame of reference from farce to that of Frank R. Stockton’s much-anthologized 19thcentury short story, “The Lady or the Tiger.”\nAllow me to jog your memory.",
    "Once the government dissolves into a cult of personality, the successful party apparatchik must exercise at all times the discipline necessary to suppress independent thought.",
    "Now the question is whether Trump can find it in his heart to forgive McCarthy again for that moment of weakness in which he flirted with possessing a spine.",
    "Like all Trump calculations, this decision will turn not on what’s good for McCarthy or what’s good for the Republican Party, but what’s good for himself.",
    "Now, to McCarthy’s extreme distress, comes news that in the immediate aftermath of January 6 he told colleagues, “I’ve had it with this guy.",
    "McCarthy’s response to the Times report was to follow the Lenny Bruce playbook (“Never tell them, deny it—they got pictures, deny it!”).",
    "We’re at that same delicious moment of suspense right now, except it’s Trump who’s the princess (a creepy mental image, I’ll grant you).",
    "On yet another hand, Vance has no real political power, whereas McCarthy, at least for the moment, remains the House Republican leader.",
    "Then Vance decided last year to run for Senate in Ohio in a competitive Republican primary filled to bursting with MAGA cultists.",
    "Rep. Mo Brooks, a six-term Republican from Missouri, is a faithful MAGA soldier running to succeed Sen. Richard Shelby.",
    "And this is the second time embarrassing details have trickled out about McCarthy’s disloyalty, however short-lived.",
    "The beautiful princess must decide whether to give him the lady, a despised rival for his affections, or the tiger.",
    "Readers of Martin and Burns’s scoop—those of us who are sane, anyway—can enjoy the suspense more dispassionately.",
    "As I noted at the time, the result was a nauseating spectacle in which Vance transformed into a Trump mini-me.",
    "Brooks’s offense was saying, in an August 2021 rally, that it was time to move on from the 2020 election.",
    "Nobody can defend it, and nobody should defend it.” McCarthy said he was going to advise Trump to resign.",
    "Trump answered that the insurrection was a false-flag Antifa operation, which McCarthy boldly disputed.",
    "He didn’t even tell him; the poor bastard had to find out about it by seeing a tweet from a reporter.",
    "Extending clemency to McCarthy will give Trump even more leverage over the House Republican caucus.",
    "Like Stalin, he must decide (metaphorically, in this case) whether McCarthy is to live or die.",
    "There’s no rooting interest either way because either choice will be hell on the Republicans.",
    "He isn’t like Vance, snatched out of the respectable world and brought gratifyingly to heel.",
    "Before the month was over McCarthy visited Trump at Mar-a-Lago to grovel for forgiveness.",
    "If we forget, the Radical Left Democrats will continue to Cheat and Steal Elections.",
    "In choosing which door, the accused will establish his guilt or his innocence.",
    "Yes, the former president is vain, and the House minority leader crossed him.",
    "The prisoner is the lover of the king’s ravishingly beautiful daughter.",
    "On the one hand, McCarthy’s a much more influential figure than Brooks.",
    "Brooks didn’t know how to gratify his master, and therefore was killed.",
    "A “semi-barbaric king” brings the accused into a room with two doors.",
    "While promoting his book, Vance said, “I can’t stomach Trump.",
    "In March Trump abruptly withdrew his endorsement of Brooks.",
    "Take that, Amy Chua and Ron Howard and the rest of you!",
    "But the briefly disloyal Republican may yet be spared.",
    "Behind the other is a tiger that will tear him apart.",
    "He led us into a place filled with wisdom and light.",
    "Even that spasm of integrity didn’t last long.",
    "Nobody particularly respects McCarthy anyway.",
    "But what happens when that personality dies?",
    "Trump endorsed the little weasel last week.",
    "He’s already got plenty of leverage anyway.",
    "He didn’t lead us into a very dark place.",
    "He was wrong about Trump, he said.",
    "He asks her which door to choose.",
    "Will it be the lady or the tiger?",
    "Either way, it’s a happy ending.",
    "Behind one is a beautiful lady.",
    "Lady, tiger, who gives a shit?",
    "Please join me in not caring.",
    "What he did is unacceptable.",
    "This is the Mo Brooks route.",
    "McCarthy will be his slave!",
    "I was blind, and now I see.",
    "Let’s examine each option.",
    "Let’s call this the J.D.",
    "But does Trump need it?",
    "It’s a very close call!",
    "The groveling worked.",
    "Mercy or vengeance?",
    "What will Trump do?",
    "Let him live.",
    "Vance route.",
    "Let him die.",
    "“J.D."
  ]
}