{
  "id": 6106,
  "mediaId": 195,
  "date": "d2022-04-28T10:29",
  "headline": "The Hills Morning Report  Biden, Congress mull mounting economic woes",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/mr_gas-prices_031022_ap-david-zalubowski.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/morning-report/3469840-the-hills-morning-report-biden-congress-mull-mounting-economic-woes/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    992,
    1609,
    1864,
    1914,
    2066,
    2087,
    3103,
    562,
    2674,
    2888
  ],
  "sentences": [
    " NBC News: Metropolitan Police Department cop testifies he struggled to breathe as former New York Police Department officer attacked him on Jan. 6.\n? ADMINISTRATION\nIn an unusual prisoner swap announced by the president on Wednesday, the U.S. exchanged former U.S. Marine Trevor Reed, 30, in custody in Russia since 2019, for Konstantin Yaroshenko, once a Russian pilot who was sentenced to a lengthy prison term in the U.S. on cocaine trafficking charges.",
    "The Food and Drug Administration wants to ban menthol in cigarettes and cigars, an action that could have a significant impact on the tobacco industry, promote healthier lifestyle goals  but also invite opposition from some of the 15 percent of African American adults who smoke cigarettes and often prefer menthol brands, report The Hills Julia Manchester and Alex Gangitano.",
    "ELSEWHERE\n? CORONAVIRUS\nThe Department of Health and Human Services this morning announced that more than 257 million Americans have received at least one dose of a COVID-19 vaccine, 100 million received a booster dose and of those, two-thirds are over the age of 65.\nWeve also closed the glaring gap in vaccine rates we usually see for communities often left behind.",
    "We cannot manage our way out of this crisis with more processing capability or increase the ability of nongovernmental organizations to address the near-term humanitarian needs.?\nDuring his appearance before the House Homeland Security Committee, a number of Republicans wanted Mayorkas to say the administration was doing a poor job at the border.",
    "LEADING THE DAY\n? CONGRESS\nThe House GOP conference is seemingly behind House Minority Leader Kevin McCarthy (R-Calif.) after he addressed the leaked recordings of his comments in the aftermath of the Jan. 6 attack on the Capitol, giving him a boost in his quest to become the Speaker of the House if the GOP retakes the chamber in November.",
    "Anthony Fauci, Bidens chief medical adviser from the National Institute of Allergy and Infectious Diseases, sought to clarify on Wednesday his comments from a night earlier that the U.S. was out of the pandemic phase,? telling The Associated Press that the U.S. is in a different moment? with the virus but that the pandemic is not over.",
    "Elsewhere on Capitol Hill, Homeland Security Secretary Alejandro Mayorkas shifted his game plan from offense to defense during hearings on Wednesday, saying the Department of Homeland Security is ready to handle rising migration levels and warned of tougher consequences for illegal border crossers who do so repeatedly.",
    "Biden said Albrights name was synonymous with the idea that America is a force for good in the world.? Former Secretary of State Hillary Clinton remembered Albright as a fearless diplomat who broke barriers and then counseled, cajoled and inspired women to follow in her footsteps (The Associated Press).",
    "A Trump attorney filed the appeal with the New York Supreme Court two days after Judge Arthur Engoron found the former president in contempt, having said that it was unacceptable for Trump to keep up the challenge to the subpoena weeks after the judge had rejected Trumps legal challenge against it.",
    "Gasoline, groceries, meat and housing prices, however, are sky high, leading the Federal Reserve to loudly signal it will launch a series of interest rate hikes beginning in earnest next week in an attempt to chill inflation while striving to avoid overkill, which would be recession (MarketWatch).",
    "We are definitely going to act to try to address the geopolitical issues that relate to gas prices being where they are [and] act in terms of some of the supply chain challenges,? said Rep. Hakeem Jeffries (D-N.Y.), who is seen as the odds on favorite to be the top House dem in a new Congress.",
    " The concept of cheap, easy money with no credit issues will change.?\nDemocrats say they want to try to lower gasoline pump prices (The Hill), but they arent sure what proposals can pass or would work, including the idea of a federal gas tax holiday, which has its share of detractors.",
    "Mayorkas incurred heavy criticism from GOP members on the panels  especially the House Homeland Security Committee  over the administrations decision to end the Title 42 policy, a Trump-era COVID-19 restriction that blocks migrants from being granted asylum at the U.S.-Mexico border.",
    "On Wednesday, Biden joined former President Clinton, former President Obama, and other current and former U.S. and global luminaries at the Washington funeral for Americas first female secretary of State, Madeleine Albright, who died last month of cancer at age 84.",
    "The Kremlins move on Wednesday to bar Poland and Bulgaria from plentiful, cheap natural gas sold by Russia may be a manageable problem for now in those two countries, but analysts say Moscows warning is meant for Germany as Russia tries to divide the West.",
    "Chinas National Health Commission said the flu variant was found in a 4-year-old child located in Henan province, adding that the child started to develop fever and other symptoms on April 5 and was admitted to a local medical facility five days later.",
    "Members and sources in the room told The Hill that McCarthy received a standing ovation during the party meeting after he said that the comments on the leadership calls were simply the leaders mentioning different potential hypothetical scenarios.",
    "It is in the interest of both the EU and Russia to work out a solution,? Goldman Sachs analysts told clients Tuesday, warning that a larger suspension of natural gas in Europe could lead to a significant economic toll? (The New York Times).",
    "Were going into some challenging times and there is a lot of sentiment out there that we could even be heading towards some sort of recession,? Frank Sorrentino, chairman and CEO of ConnectOne Bank, told Fox Business.Nobody knows for sure.",
    "On the political side, the Ohio Senate race has created trouble between Trump and David McIntosh, the head of the Club for Growth, over the latters continued support for former Ohio Treasurer Josh Mandel in the states GOP Senate primary.",
    "Chief Justice John Roberts paid tribute to Breyers time on the court following arguments, saying that justices have a deep appreciation for the privilege of sharing this bench with him.? He will retire this summer (The Hill).",
    "Calhoun, whose predecessor agreed to a fixed-price contract, told investors on Wednesday that Boeing shouldnt have agreed to a $3.9 billion price tag, which has experienced at least $660 million in cost overruns this year.",
    "Secretary of State Antony Blinken testifies at 10 a.m before the House Appropriations Subcommittee on State and Foreign Operations regarding his departments proposed budget for the fiscal year that begins in October.",
    "The administrations handling of this weekends White House Correspondents Dinner and the decision to appeal the striking down of the federal mask mandate for transportation have also played into the messaging issues.",
    "The retiring Breyer, 83, posed sharp questions as part of a clash between Oklahoma and tribal authorities over the ability to prosecute crimes between non-Native American defendants and Native American victims.",
    "IN FOCUS/SHARP TAKES\n? POLITICS\nTrump on Wednesday appealed a New York state judges ruling that holds him in contempt and fined him $10,000 for every day he doesnt comply with a state attorney general subpoena.",
    "It has paid dividends to surge resources, including tests and treatments, to our hardest-hit and highest-risk communities,? HHS Secretary Xavier Becerra said in a statement accompanying a new department video.",
    "ET to gain insights from Energy Secretary Jennifer Granholm, actress and activist Sigourney Weaver, White House Council on Environmental Quality Chairwoman Brenda Mallory, Rep. John Curtis (R-Utah), and more.",
    "Biden and first lady Jill Biden will use the Jacqueline Kennedy Garden as the location to gather guests for a 5 p.m. screening of HBOs The Survivor? in honor of Yom HaShoah and Holocaust Remembrance Week.",
    "Politico: Boeing CEO Dave Calhoun hinted there was some artlessness to a 2018 deal his company negotiated with the Trump administration and the former 45th president for two new Air Force One aircraft.",
    "Morning Report\nCongress returned to work this week, joining President Biden, central bankers and corporate leaders worldwide in uncertainty about how to fix what ails the U.S. and European economies.",
    "The Hills Sylvan Lane and The New York Times report that U.S. housing prices are so gargantuan that families eager to buy are shut out by cash-wielding investors (who put what they buy up for rent).",
    "Biden plans to travel to deep-red Alabama on Tuesday to tout made-in-America anti-tank weaponry at a Lockheed Martin facility that makes Javelin missile systems being shipped to Ukraine (The Hill).",
    "Computer game Blastar?\nPowered skateboard (the deck said Rocket Man?)\nRadio wave tracking device worn by his dog Einstein\nRecipe for glow-in-the-dark cereal\nMusks auto company is named after ____ ?",
    "Included in those is a new ad targeting the Hillbilly Elegy? author for his past criticism of Trump and highlighting the former presidents 2018 endorsement of Sen. Mitt Romneys (R-Utah) campaign.",
    "[Office of Attorney General] has satisfied its burden of demonstrating that Mr. Trump willfully disobeyed a lawful court order of which he had knowledge prejudicing OAG? Engoron wrote (The Hill).",
    "Those comments included him saying that he would suggest that former President Trump should resign if impeached and wondering if some GOP members should have their social media accounts revoked.",
    "We expect migration levels to increase as smugglers seek to take advantage of and profit from vulnerable migrants,? Mayorkas said in his testimony to the House appropriations subcommittee.",
    "The White House daily press briefing is scheduled at 3 p.m.\ng Hill.TVs Rising? program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    "The Centers for Disease Control and Prevention says tobacco use is a major contributor to the three leading causes of death among African Americans (heart disease, cancer and stroke).",
    "Related Articles\n The Associated Press:The United Nations says it is mobilizing an experienced team to coordinate the evacuation of civilians from Mariupols steel plant in Ukraine.",
    "Instead, a number of lawmakers blamed the media for the leaked comments and indicated that they are looking forward to the November midterms rather than in the rearview mirror.",
    " The Associated Press: McCarthy defends Jan. 6 audio, House GOP backs next Speaker.?\n The Washington Post: How McCarthy sought to contain the damage from leaked Jan. 6 audio.",
    "The president receives the Presidents Daily Brief at 9:30 a.m. Biden at 10:45 a.m. will ask Congress for massive? supplemental funding to help Ukraine, NBC News reports.",
    "The first lady at noon will deliver pre-recorded remarks at a virtual Global Child Care Infrastructure event sponsored by the U.S. Agency for International Development.",
    "By no means does that mean the pandemic is over.?\nAs The Hills Peter Sullivan writes, Faucis remarks have contributed to the mixed messages being directed at Americans.",
    "This is simply a distraction by the left trying to drive a wedge in a very unified Republican Party and a very unified conference,? said Rep. Barry Loudermilk (R-Ga.).",
    " The Associated Press: Germany has been the top buyer of Russian energy since Russias war began in February, according to an independent report released on Thursday.",
    "Menthol cigarette smokers, particularly Black or African American smokers, are less likely to successfully quit smoking than non-menthol smokers,? the FDA notes.",
    "His childrens school\nHis home in California\nA tattoo on his forearm\nInsignia on the SpaceX Dragon capsule\n Associated Press / Britta Pedersen |Elon Musk in 2020.",
    "? HEALTH\nChinese officials on Tuesday reported the first human infected with the H3N8 bird flu strain, which has been detected in horses, dogs and even seals.",
    "According to CNNs Gabby Orr, Trump became incensed over the Clubs decision to redouble its efforts to support Mandel after the former president endorsed J.D.",
    " The Associated Press and The Wall Street Journal: A federal judge on Wednesday ordered a two-week halt in preparations for an end of the U.S. asylum limit.",
    "Should Republicans win the House in November, they have promised to continue grilling Biden officials with responsibility for the border and immigration.",
    "Shanghai could finally be on the verge of easing its citywide lockdown after COVID-19 cases fell to the lowest level in three weeks in the Chinese city.",
    "John Sullivan, the U.S. ambassador to Russia, has said the alleged crime obviously did not occur? and called his trial a theater of the absurd? (WUNC).",
    "Republicans, with many at the hearing only days following a caucus trip to the border, argued that ending the policy would encourage more migration.",
    "? SUPREME COURT\nJustice Stephen Breyer on Wednesday took part in his last scheduled oral argument of his nearly 28-year tenure on the Supreme Court.",
    "Vice President Harris is in isolation at her official Naval Observatory residence in Washington after testing positive for COVID-19 on Tuesday.",
    "At this point, you know, I take his word for it.?\n Associated Press / Amanda Andrade-Rhoades | House Minority Leader Kevin McCarthy in January.",
    "German Chancellor Olaf Scholz today said Russia clings to the idea of a forced peace? in Ukraine, which he argued will not work (Reuters).",
    " The Philadelphia Inquirer: Pennsylvania GOP Senate primary up for grabs even after Trump backed Mehmet Oz, Monmouth University poll says.",
    "https://nyti.ms/3ETuJYx\n Amend the Constitution to bar senators from the presidency, by George F. Will, columnist, The Washington Post.",
    "If that tool goes away, it has the potential to profoundly impact border security operations,? Rep. Chuck Fleischmann (R-Tenn.) said.",
    "The Kremlin wants to pressure European countries to pay for Russian energy imports in rubles to work around international sanctions.",
    "In a statement, she said she is experiencing no symptoms, adding that she is fully vaccinated and has received two booster shots.",
    "U.N. Secretary-General Antnio Guterres and Russian President Vladimir Putin agreed in principle? on Tuesday to the evacuation.",
    "Because for Americans, homeownership historically has been a route to wealth creation and for many, a middle-class lifestyle.",
    "He will also testify at 1 p.m. about the departments budget request at a hearing of the House Committee on Foreign Affairs.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "https://on.wsj.com/3KoRYLp\n Elon Musk got Twitter because he gets Twitter, by Ezra Klein, columnist, The New York Times.",
    "Smoking also increases the risk of developing diabetes, which is the fourth leading cause of death in that population.",
    "Were always curious about billionaire influencers, so send us your best trivia guesses about headline-maker Elon Musk.",
    "The president will meet with small business owners at 2 p.m. in the Eisenhower Executive Office Building auditorium.",
    "Email your responses to asimendinger@thehill.com and/or aweaver@thehill.com, and please add Quiz? to subject lines.",
    "His father\nHis brother\nAn electrical engineer born in 1856\nA South African town\nIn Musks world, Ad Astra is ______?",
    "He just said that we were going to lay out different things of what could be,? said Rep. Robert Aderholt (R-Ala.).",
    "Among the top criticisms of the Club for Growth is that it isnt for the key tenets of the America First platform.",
    "Current average U.S. COVID-19 daily deaths are 299, according to the Centers for Disease Control and Prevention.",
    "Lefty Liz\nThe Scold\nWarrior Warren\nSenator Karen\nAt age 12, Musk created which of these and sold it for $500?",
    "THE CLOSER\nTake our Morning Report Quiz\nAnd finally  Its Thursday, which means its time for this weeks Quiz!",
    "Total U.S. coronavirus deaths reported as of this morning, according to Johns Hopkins University: 992,740.",
    "The New York Times: Shunned by the right, Sen. Lisa Murkowski (R-Alaska) bets big on the center in Alaska.",
    "Reed, who used hunger strikes to protest his treatment, was accused of attacking a Moscow police officer.",
    "The United States says it will work with allies to surge liquified natural gas to expand European supply.",
    "The pandemic hangover and upheaval created by Russias war with Ukraine are adding to already ample risks.",
    " Mychael Schnell, The Hill: Here are the GOP lawmakers targeted by McCarthy in new audio recordings.",
    "However, cases are rising in Beijing, although the number of new cases is below 50 (Bloomberg News).",
    " The New York Times: Democrats lose control of New York election maps, as top court rejects appeal.",
    "Rep. Maxine Waters (D-Calif.) announced on Wednesday that she has tested positive for COVID-19.",
    "U.S. economic growth is slowing this quarter, but consumers are not reining in their spending.",
    "Winners who submit correct answers will enjoy some richly deserved newsletter fame on Friday.",
    "Follow us on Twitter (@alweaver22 & @asimendinger) and suggest this newsletter to friends!",
    "Daily Beast: Grand jury with Trump Organizations fate in its hands will disband this week.",
    " The New York Times: Russia is making slower advances on the ground in eastern Ukraine.",
    "Russia is gambling, too, report The Hills Morgan Chalfant, Laura Kelly and Zack Budryk.",
    "They face a scarcity of affordable homes on the market and never-ending sticker shock.",
    "The Senate convenes at 10 a.m. and resumes consideration of the America COMPETES Act.",
    "McIntosh is a longtime friend of former Vice President Mike Pence, a fellow Hoosier.",
    "Weve now decelerated and transitioned into more of a controlled phase,? Fauci said.",
    "g? Introducing NotedDC, The Hills curated commentary on the beat of the Beltway.",
    " Alexander Bolton, The Hill: Democrats split over how hard to push Biden agenda.",
    "Biden has spoken about the effectiveness of the weapons against Russian forces.",
    "), Rep. Matt Gaetz (R-Fla.) meet privately after tension over leaked audio.",
    "Virtual Event Invite\nJoin TODAY, Sustainability Imperative? at 2 p.m.",
    "But Trump and the Club have had a complicated relationship for years.",
    "Musk on Twitter in 2021 tangled with Sen. Elizabeth Warren (D-Mass.)",
    "Experts say the risk of large-scale transmission is low (The Hill).",
    " The Hill: Democratic Senate primary tightening in Wisconsin: poll.",
    " Associated Press / Paul Sakuma | Newport menthol cigarettes, 2009.",
    "https://wapo.st/3vkJpNm\nWHERE AND WHEN\nThe House meets at 10 a.m.",
    "OPINION\n How badly will the Democrats lose the midterm elections?",
    " Associated Press / Rogelio V. Solis | Mississippi subdivision.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Speak softly and carry a large Javelin,? he said last week.",
    "The swap took place in Turkey (The New York Times).",
    " Politico: House Minority Whip Steve Scalise (R-La.",
    "The Club has long supported fiscal conservatives.",
    "by Karl Rove, columnist, The Wall Street Journal.",
    "Click here to subscribe to our latest newsletter.",
    "Also, check out the Rising? podcast here.",
    "Email: Alexis Simendinger and Al Weaver.",
    "Everyone plays a role in sustainability!",
    "(Bonus point: What does Ad Astra mean?)",
    "Stay Engaged\nWe want to hear from you!",
    "RSVP today to save your virtual spot.",
    "The job market and wages are strong.",
    "Some called him a liar (The Hill).",
    "over billionaire tax benefits.",
    "What name did he use for her?",
    "This is a distraction, folks.",
    "Why does this trend matter?",
    "Why would they?",
    "Come on.",
    "Vance.",
    "ET."
  ]
}