{
  "id": 6109,
  "mediaId": 169,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Trump's latest hate rally: A master class in cult mind control",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/04/donald-trump-0426221.jpg",
  "link": "https://www.salon.com/2022/04/28/latest-hate-rally-a-master-class-in-mind-control/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chauncey DeVega",
  "authorUrl": "https://www.salon.com/writer/chauncey_de_vega",
  "termIds": [
    3103
  ],
  "sentences": [
    "Trump has now fully mated the Big Lie claim that he is still the \"real\" president of the United States with white identity politics and grievance mongering:\nThe very same people who piously claimed to be defending democracy are the ones throwing open your borders, surrendering your sovereignty, defunding your police, prosecuting your politicians  like nobody's ever seen before, by the way desecrating your laws, crushing your wages, diluting your vote, and handing your country over millions and millions of illegal foreign nationals  illegal aliens, I would call them  all without your consent.",
    "Of course, Trump now claims that it was Biden, Dr. Anthony Fauci and other public health experts, and the \"liberals,\" \"socialist Democrats\" and \"the left\" who unleashed COVID upon the American people and that (somehow) he and his regime acted as saviors:\nThey created unyielding and unsustainable and totally horrific mandates and radical mask regulations  and we did just the opposite, and we had far better success in every single category.",
    "In a 2019 interview for Salon, Steven Hassan, one of the world's leading experts on cult psychology and deprogramming, explained Trump's power over his followers and the danger to society it represents:\nDestructive cults are authoritarian, pyramid-structured groups where there is often a charismatic or authoritarian leader at the top who commands total power and loyalty.",
    "Hassan observed in the same interview that Trump's supporters could be \"an easy target for another country, whether it's Russia or Iran or China or some other hostile country that wants to sow division in the United States,\" and concluded, \"Unfortunately, I think that Trump's supporters are going to be a great danger to the rest of us in this country for some time.\"",
    "This dangerous language echoes the eliminationist rhetoric that led to genocide in places like Nazi Germany, Rwanda, the former Yugoslavia and elsewhere:\nIn this moment together, we're standing up against some of the most menacing forces, entrenched interests, and vicious opponents our people have ever seen or fought against.",
    "Trump also tells his followers not to listen to other information if it is critical of him ... [and] tells his followers that if you don't follow him, terrible things are going to happen to you, the country and the world ... that the world will be overrun by evil people if they don't support him.",
    "At this point, many professional centrists, pundits and hope-peddlers in the American news media and larger political class have convinced themselves that attention is like oxygen for Donald Trump and his followers, and therefore that depriving them of attention will suffocate their movement.",
    "Social scientists and other researchers have shown that there are many millions of Trump's followers who support terrorism and other forms of political violence against the Democrats and their supporters in order to protect \"real America\" (meaning, of course, white America).",
    "Trump is also using Nazi propaganda minister Joseph Goebbels' technique of projection and the Big Lie, by literally accusing the Democrats and all others who disagree with him of the crimes against society and democracy that he and his movement have actually committed.",
    "There he continued to escalate his threats of violence, wallowed even more in the Big Lie and other conspiracy theories and distortions of reality, spouted his white supremacist and racist talking points, and stroked his own narcissism and other mental pathologies.",
    "I worked in the firearms industry as a sales executive for a long time and beginning during the Obama presidency, gun business leaders like me, who helped build the nation's top gun companies, noticed this disturbing chatter from gun owners at firearms trade shows.",
    "Trump continues to use the propaganda and radicalization technique known as \"stochastic terrorism\" to amplify his threats of political violence against Democrats, liberals and others deemed by his movement to be a poisonous \"enemy within\" and a threat to America.",
    "If the naysayers, hope peddlers and others mired in obsessive denial about the neofascist threat would like to force that number down even lower, it still implies a threat level that is likely to mean considerable pain, suffering, turmoil and destruction.",
    "As I have observed previously, mockery and laughter won't save America people from the hell that will be fully unleashed when Trump's Republican-fascist movement wins the 2022 midterms, and quite possibly the presidential election two years after that.",
    "During his Ohio speech, Trump amplified his white supremacist race-war fantasies, which are clearly derived from the \"Great Replacement\" conspiracy theory and fears that white people somehow face extinction at the hands of Black or brown invaders.",
    "That may be an attempt to correct for the wall-to-wall coverage Trump received the first time he ran for president, but it won't save the American people or American democracy  or the \"freedom of the press\"  from the neofascist assault.",
    "If only 10% of those voters are willing to obey his incitements to political violence, that's 7.4 million people, a potential force so large that it would throw American society into total chaos and destruction.",
    "And Kirk then qualified this by saying that \"we must exhaust every single peaceful means possible\"  which sure seems to leave open the question of what to do after all of the peaceful means have been exhausted.",
    "America's political class and leading figures in the mainstream media still want to pretend that we can somehow return to \"normal,\" and that denial or wish-casting will make the neofascist assault go away.",
    "Here is a thought experiment for those observers who have convinced themselves that by ignoring Donald Trump and his political hate rallies, the danger they represent to the country will somehow disappear.",
    "As should be obvious following the events of Jan. 6, 2021, many of Trump's followers and the other members of the neofascist right are ready to kill, and perhaps to die, for their cause and their leader.",
    "Most are exhausted and simply hoping to wait out the crisis, when they should be fervently battling against a reactionary-revolutionary movement that is fighting hard to win the present and future.",
    "More than 100 years later, these pseudo-scientific theories have become daily talking points among Republicans, the \"conservative\" movement and the right-wing echo chamber anchored by Fox News.",
    "Trump's white supremacist and nativist fictions echo the discredited \"scientific racism\" espoused by the likes of Madison Grant in the late 19th and early 20th centuries in America and Europe.",
    "Just look at the un-select committee of political hacks and what they're doing to our country while radical-left murderers, rapists, and insurrectionists roam free: Nothing happens to them.",
    "New research commissioned by The New Republic shows the extent of that danger: More than 50% percent of Republicans believe that the Jan. 6 attack on the Capitol was an act of \"patriotism.\"",
    "Everywhere it stops, Donald Trump unleashes a torrent of lies, hatred, ignorance, bigotry, racism, narcissism, authoritarianism, threats of violence and other antisocial and evil values.",
    "Perhaps the most tragic aspect of America's democracy crisis is that the vast majority of Americans do not even understand that they are in the middle of an existential struggle.",
    "Trump's rallies create an alternate reality or state of malignant normality, where humane values, reason and truth are rejected or inverted, to be replaced by their opposites.",
    "Trump's rally last weekend was a textbook example of how a cult leader keeps his followers in thrall by creating fantastical threats from evil forces in the outside world.",
    "Let's take that a step further: If only 1% percent of Trump's voters, or 740,000 people, venture into political violence, that would still be a massive national emergency.",
    "These techniques include behavior control, information control, thought control and emotional control to keep people dependent and obedient within that group's structure.",
    "RELATED: Crime novelist Don Winslow: Trump belongs behind bars  but that won't happen in this America\nMany other Americans, to be sure, are also ignoring Trump's rallies.",
    "Reporters, pundits and other professional smart people with a public platform should be consistently warning the American people about the grave danger this represents.",
    "In this type of psychological conditioning, the leader becomes a savior figure for the followers, who learn to accept that they must never challenge his or her word.",
    "They are doing this rather than responding to the danger with an appropriate mixture of fear, caution and then effective planning for how best to defeat the threat.",
    "The question, posed on October 25 during Charlie Kirk's Turning Point USA event in Idaho, made it clear that this man, and others like him, are hoping for a signal.",
    "In total, Trump's Ohio rally was a master class in cult behavior, mind control, right-wing propaganda and disinformation, and psychological warfare techniques.",
    "A cult leader keeps his followers in thrall by creating fantastical threats from evil outside forces  from which, of course, he is going to save them.",
    "Moreover, ignoring Trump's escalating threats at this point, given all we know, amounts to journalistic malpractice and betrayal of the public trust.",
    "Consider this excerpt from an essay by former gun industry executive Ryan Busse, published last November in the Bulwark:\n\"When can we use the guns?\"",
    "So the question then becomes, when Donald Trump is making these violent threats, what is going on in the minds of the people who are around him?",
    "If you reject that number as unrealistic, then let's take it to 0.1% of Trump's voters, or 74,000 right-wing terrorists and other extremists.",
    "He rejected the call to murder not because it was wrong but because it would \"play into all their plans\"  you can guess who \"they\" are here.",
    "Donald Trump is a stereotypical cult leader like Lyndon LaRouche, who's a political cult leader, or Sun Myung-moon, my former cult leader.",
    "The mainstream news media has made an obvious editorial decision to downplay or ignore Trump's political hate rallies and similar events.",
    "Democrats, liberals, progressives and other pro-democracy forces are in a literal fight for their lives -- and for the future of America.",
    "Most of those who are paying attention, it appears, are mostly doing so in order to mock Trump and his followers as ignorant or stupid.",
    "Despite great outside powers and dangers, our biggest threat remains the sick, sinister and evil people from within our own country.",
    "That metaphor is incorrect: This is more like ignoring a fire and allowing it to burn uncontrolled rather than extinguishing it.",
    "If 0.1% of Trump voters embrace political violence, that's 74,000 terrorists  an insurmountable problem for law enforcement.",
    "But no matter how big or powerful these corrupt radicals may be, you must never forget this nation does not belong to them.",
    "They laugh at \"Let's Go Brandon\" chants, drink Black Rifle Coffee, and wave \"Come and Take It\" flags at political rallies.",
    "Again, that would be huge and nearly insurmountable problem for law enforcement, the military and other security forces.",
    "And now we hear them from gun owners across the country who dream of deploying their arsenals to kill fellow citizens.",
    "Such behavior is an example of what psychologists call \"defensive contempt,\" a reaction born of deep existential fear.",
    "Many observers have convinced themselves that attention is like oxygen for Trump: Deprive him of it, and he will die.",
    "They are people who have fallen into a cult where it is normal to organize your entire culture around weapons of war.",
    "Trump's political rallies resemble George Orwell's \"two minutes of hate\" from \"1984,\" expanded to two hours or so.",
    "...\nTrump's violent threats are an example of fear indoctrination and phobia indoctrination for his supporters.",
    "Are Trump's inner circle, his followers and other supporters really willing to commit murder for Donald Trump?",
    "Trump and his regime are guilty of de facto democide for their negligent response to the coronavirus pandemic.",
    "Much of the manipulation, aside from telling the members, \"You're the chosen ones,\" is about guilt and fear.",
    "If you wanted to see the glass as half full, you could say that Charlie Kirk denounced the call to violence.",
    "America has a rapidly growing authoritarian army comprised of thousands of men like that fellow in Idaho.",
    "They have also been developed as avatar customers by the gun industry, meaning that they are well armed.",
    "But what non-gun owners may not understand is that these men are not your average gun-owning Americans.",
    "It is clear when you consider Trump's malignant narcissism and examine his speeches and writing.",
    "You become someone who is a tool of the leader, an instrument to be used or to be thrown away.",
    "Donald Trump received 74 million votes in 2020  roughly 11 million more than he did in 2016.",
    "Vance and various other Republicans as MAGA-approved surrogates in the midterm elections.",
    "It is actually a very unpleasant experience to be in one of these cult groups long-term.",
    "The question hung in the air just long enough for some in the crowd to begin cheering.",
    "In fact, ignoring Trump's rallies is more like allowing a fire to burn out of control.",
    "Some make it official by claiming membership in the Oath Keepers or Three Percenters.",
    "Destructive cults also use deceptive recruitment and specific control of techniques.",
    "In this age of ascendant American fascism, everything old seems to be new again.",
    "This is your heritage, and your great American liberty is your God-given right.",
    "Trump's most recent political rally took place last Saturday in Delaware, Ohio.",
    "Donald Trump's political circus and freak show is continuing its American tour.",
    "With a few admirable exceptions, they have refused to rise to the challenge.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "They have been groomed by Trump acolytes such as Kirk and Steve Bannon.",
    "\"How many elections are they gonna steal before we kill these people?\"",
    "It's a big country and there will always be malcontents and criminals.",
    "Though to be honest, Kirk's disavowal didn't inspire much confidence.",
    "Trump also used the event to anoint Ohio Senate candidate J.D.",
    "To this point, that movement faces little serious opposition.",
    "Some are just average suburban dads who've been radicalized.",
    "There is no threat as dangerous to democracy as they are.",
    "And the glass-half-empty view seems pretty convincing.",
    "Donald Trump is also like Jim Jones or David Koresh.",
    "Subscribe to our morning newsletter, Crash Course.",
    "Read more on our 45th president and his followers:",
    "It is not your real conscience or your real self.",
    "On top of that you, had a fake, phony election.",
    "Such warnings are to be heeded and not ignored.",
    "Many in the industry dismissed these threats.",
    "The group really demands a pseudo-identity.",
    "Will his followers go that far for him?...",
    "It's tempting to wish these people away.",
    "\"That's not a joke,\" the man added.",
    "Democracy is running out of time.",
    "I've met men like this before.",
    "You haven't consented to that.",
    "This nation belongs to you.",
    "This is your home.",
    "I didn't.",
    "It won't."
  ]
}