{
  "id": 6110,
  "mediaId": 237,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Midterm Memo: Power of Trump endorsement on display in Ohio",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/dfd8d48/2147483647/strip/true/crop/2518x1322+236+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fd8%2F4e%2F110ccf944786bca422a933428d86%2Fap21183827855401.jpg",
  "link": "https://www.washingtonexaminer.com/news/midterm-memo-power-of-trump-endorsement-on-display-in-ohio",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-m-drucker",
  "termIds": [
    1053,
    1147,
    1332,
    1801,
    2027,
    2524,
    3103,
    428,
    2590,
    2845
  ],
  "sentences": [
    "This goes to show the power of the 45th presidents seal of approval and the close relationship he continues to enjoy with grassroots Republicans  no matter how much trouble he might have later this spring in the GOP primaries in Georgia and Pennsylvania and what losses there by candidates he endorsed might reveal about the limits of his grip on the GOP ahead of a possible presidential bid in 2024.",
    "As my colleague Juliegrace Brufke reported in her dispatch from the Panhandle community of Shepherdstown, West Virginia, McKinley, during a town hall with voters, defended his decision to certify President Joe Bidens Electoral College victory on Jan. 6, 2021, while standing by his support for a bipartisan infrastructure deal that was spearheaded and negotiated by Trumps successor.",
    "The state legislator was effectively running to become the next speaker of the Michigan House of Representatives, the legislative body Trump looked to in the aftermath of his loss to Biden in 2020 to overturn his loss in the state by shifting its electoral votes from the president-elect to the defeated commander in chief.",
    "Vance, the venture capitalist and bestselling author who remade himself from bourgeois Trump critic to populist Trump cheerleader just in time to run for Senate, picked up the former presidents endorsement this month and immediately shot to the front of a crowded pack of Republican contenders.",
    "Just In...\nFor all the valid speculation that this years Republican primaries are poised to turn into a political disaster for Donald Trump that knocks him down a peg or two in the party, the former president is on track to score a rather consequential victory in Ohio.",
    "In case youre interested, the rest of that Fox News poll read like this: Previous front-runner and former state Treasurer Josh Mandel (23%), wealthy businessman Mike Gibbons (13%), state Sen. Matt Dolan (11%), and former Ohio GOP Chairwoman Jane Timken (6%.)",
    "Meanwhile, Maddocks wife is Meshawn Maddock, the vice chairwoman of the Michigan Republican Party and Trumps top consigliere in the state  its Meshawn Maddock who has had a hand in the several endorsements Trump has made in Republican primaries there.",
    "Since launching his campaign last May, until Trump endorsed him (and even with the support of millions Thiel donated to a pro-Vance super PAC) the first-time candidate was stuck in the pack of Republicans vying to replace the retiring GOP Sen.",
    "The former president, and especially his son Donald Trump Jr., have not been shy about hammering the Club for Growth for its apparent intransigence, even as the group is probably responsible for saving Trumps bacon in North Carolina.",
    "In a related matter, one less Trump acolyte in a position of power in Lansing could turn out to be a big deal in late 2024 or early 2025, depending on the outcome of the next presidential election and the name of the GOP nominee.",
    "But my Michigan sources say Republicans in the state house had grown tired of Maddock recruiting candidates to run against them and raising money to further those efforts as part of his plan to win control of the speakers gavel.",
    "In his most recent disclosure with the Federal Election Commission, Vance reported raising $2.5 million since the start of his campaign, with nearly one-third of that coming courtesy of a personal loan he made to his campaign.",
    "That McKinley is compelled to defend upholding the outcome of an election and explain his support for legislation that could be a boon to West Virginia says something about the state of the Republican Party in 2022.",
    "Vance winning the Republican nomination for Senate in the Buckeye State this coming Tuesday, when voters in this key Midwestern battleground head to the polls to pick their standard-bearers for the fall campaign.",
    "Rep. David McKinley, forced by redistricting into a Republican primary against fellow Rep. Alex Mooney, is refusing to back down amid opposition from former President Donald Trump, who endorsed his rival.",
    "Also, in case youre interested, the Club for Growth has not given up on Mandel, creating a very interesting subplot as the graybeard of conservative advocacy groups goes head-to-head against Trump.",
    "Especially if, like Chen, youre a Republican running for statewide office in California, the bluest of blue states, which has not elected a Republican to any such office in well over a decade.",
    "But thats the sort of permission structure many California voters are going to need if they are to consider voting for Chen and give the Republican any chance to win.",
    "He rose from dysfunctional family poverty in rural Ohio to serve in the Marines in the Iraq War and graduate from The Ohio State University and Yale Law School.",
    "But one way to restore some sanity to the GOP is to elevate Republicans, like Chen, who operate in the world of facts.? Scoff, laugh, dismiss, whatever.",
    "This action, taken despite Maddocks connection to Trump, reveals the limits of the former presidents influence, at least since leaving the White House.",
    "Officially, Maddock was defenestrated for sharing confidential information about his Republican colleagues, a violation of caucus rules.",
    "Pat McCrory in the GOP Senate primary on May 17 until the club, which also endorsed Budd, poured millions into the race on his behalf.",
    "Vance later became a wealthy financier working for Peter Thiel, a Republican megadonor and preeminent West Coast venture capitalist.",
    "The May 3 primary is his to lose,? conceded a Republican operative in Ohio who would have preferred a different candidate.",
    "But for Lanhee Chen, chief policy aide to Mitt Romney during his 2012 presidential campaign, every little bit helps.",
    "Many Californians will balk at the idea of voting for a Republican,? the editorial reads quite accurately.",
    "Republicans in the state House of Representatives in Lansing expelled a top Trump ally from their caucus.",
    "In California, the Republican candidate for state controller has been endorsed by the Los Angeles Times.",
    "And he wrote about it eloquently in his memoir, Hillbilly Elegy, which was made into a movie by Netflix.",
    "What happened prior to a Fox News poll conducted April 20-24 that showed Vance leading with 23%?",
    "That investment shows real commitment, and Vance was hardly the only self-funder in the primary.",
    "If McKinley holds off Mooney in a state where Trump is popular, that would say something, too.",
    "There, the Trump-endorsed Rep. Ted Budd looked on the verge of losing to former Gov.",
    "However, the paper goes on to say Chen is not your typical scary Republican.",
    "Yet none of this seemed to matter much to Republican primary voters in Ohio.",
    "Budd now leads the race by an average of more than 12 percentage points.",
    "Matt Maddock was not just somebody Trump happened to endorse.",
    "Public polling and private prognosticators point to J.D.",
    "Vance is a dynamic campaigner with an inspiring story.",
    "Newspaper endorsements arent what they used to be.",
    "Something curious happened in Michigan this week.",
    "But its not as if he was a grassroots sensation.",
    "West Virginias 2nd Congressional District.",
    "With that, to the field \nUpset Alert.",
    "Thats according to the Detroit News.",
    "Trumps endorsement, thats what.",
    "So, whats changed?",
    "Rob Portman.",
    "2024 Watch."
  ]
}