{
  "id": 6113,
  "mediaId": 19,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Donald Trump Endorses Sheriff Joe Lombardo for Nevada Governor",
  "image": "https://media.breitbart.com/media/2022/04/Joe-Lombardo-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/28/donald-trump-endorses-sheriff-joe-lombardo-for-nevada-governor/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Bois",
  "authorUrl": "https://www.breitbart.com/author/pbois/",
  "termIds": [
    1147,
    1233,
    1547,
    1837,
    3103,
    3898,
    3385,
    2818
  ],
  "sentences": [
    "President Donald J. Trump announces his endorsement of Joe Lombardo for Governor of Nevada pic.twitter.com/5tBkGNVM79\n Liz Harrington (@realLizUSA) April 28, 2022\nTrumps endorsement of Lombardo should provide some heavy sway in his favor.",
    "Former Nevada Attorney General and current Senate candidate Adam Laxalt has mounted a huge lead in Nevadas Republican primary race, a Wednesday WPA Intelligence poll revealed,? Breitbart News recently reported.",
    "A U.S. Army and Nevada National Guard veteran, Joe joined the Las Vegas Metropolitan Police Department in 1988 and has bravely served and protected the people of Nevada for the past 34 years,? Trump wrote.",
    "As Governor, Joe will fiercely Protect our under-siege Second Amendment, Oppose Sanctuary Cities, Support our Law Enforcement, Veto any Liberal Tax Increase, Protect Life, and Secure our Elections.",
    "Trump blamed the loss on Hellers initial opposition to his candidacy in 2016.\nWhat happened with Dean Heller is, I tried for him, but my base did not believe him,? Trump said.",
    "Opponents Sam Brown (19 percent), Bill Hockstedler (1 percent), and Sharelle Mendenhall (1 percent) polled substantially behind Laxalt, the Las Vegas Review-Journal reported.",
    "Former President Donald Trump endorsed Clark County Sheriff Joe Lombardo in the GOP primary race for Nevada governor on Wednesday.",
    "Trump chose Lombardo over former Nevada Sen. Dean Heller (R), who lost a reelection bid in 2018 despite Trumps support.",
    "Trump hailed Lombardo for his past military service and his devotion to populist issues in his enthusiastic backing.",
    "Joe Lombardo is the leader Nevada needs, and he has my Complete and Total Endorsement for Governor!? he added.",
    "In the senate race, the Trump-endorsed Adam Laxalt has polled way ahead of his competitors in the primary.",
    "Trump-endorsed Laxalt leads his opponents with 57 percent of the vote, according to the poll.",
    "They wouldnt go for him because Dean Heller was really hostile in my race.?\nNEW!",
    "Vance for the Ohio Senate primary also propelled him to the head of the pack.",
    "Sheriff Joe Lombardo is running for Governor of the Great State of Nevada.",
    "The former presidents recent endorsement of J.D.",
    "Eighteen percent were undecided,? it added."
  ]
}