{
  "id": 6124,
  "mediaId": 238,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Opinion Once the toast of liberal parties, J.D. Vance has gone full MAGA",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/26/jd-vance-trump-endorsement-rally-ohio/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1801,
    2027,
    2524,
    3103,
    571,
    2643,
    2845
  ],
  "sentences": [
    "Vance likened Trump to the opioids ravaging the Rust Belt (cultural heroin?), warned that he was leading the white working class to a very dark place? and described Trumps policies as ranging from immoral to absurd.?\nWhen he kicked off his own campaign for Senate last summer, Vance knew that this paper trail would probably mean he couldnt win Trumps endorsement.",
    "When Trump called Vance onstage at the Delaware County fairgrounds in Ohio on Saturday night, he paid him the highest possible compliment, pointing to negative coverage in The Post and the New York Times, as well as on CNN and MSNBC, as evidence that Vance must have great ideas.",
    "DELAWARE, Ohio  It is a measure of the sad state of our politics today that Donald Trump endorsed a Republican candidate for Senate in Ohio who just a few years ago described the former president as noxious and reprehensible.",
    "Vance, whose best-selling memoir, Hillbilly Elegy,? became a Netflix movie and made him a star, might now be on a path to win next Tuesdays Republican primary in Ohio and join the U.S. Senate next year.",
    "He embraces the big lie? about the 2020 election, describing Joe Biden as a fake president.?\nAlong the way, Vance turned out to be, by far, the most articulate advocate for Trumpism in Ohios GOP field.",
    "Desperate to break through at a debate in March, former state treasurer Josh Mandel nearly got in an altercation with businessman Mike Gibbons, who was leading in polls at the time.",
    "In those days, Vance was the toast of coastal cocktail parties, where liberals saw Hillbilly Elegy? as a Rosetta Stone to understand Trumps appeal in flyover country.",
    "I want to pick somebody thats going to win,? Trump said, and this man is going to win.?\nIf he does, Vance could plausibly be on vice-presidential shortlists in 2024.",
    "It certainly appeared unlikely three months ago when Vance pollster Tony Fabrizio, who also works for Trump, found him mired in the single digits in a six-way race.",
    "Sketching out a Vance win, Trump told the crowd, You have to imagine all of the liberal tears that will be cried.? At that moment, Vances transition was complete.",
    "Former state GOP chair Jane Timken, once a Trump favorite, has struggled to get traction despite hiring a number of the former presidents political advisers.",
    "But Vance has taken no chances and attacked Dolan over the team changing its name from the Indians, which he presents as caving to wokeness run amok.",
    "The former presidents eldest son stumped with Vance down Interstate 75  from Toledo to Cincinnati  the must-win corridor for Ohio Republicans.",
    "In any other era, the smart money would be on Dolan, the scion of the billionaire family that owns the Cleveland Guardians baseball team.",
    "Billionaire Peter Thiel poured money into Vances super PAC and later brokered a meeting at Mar-a-Lago for Vance to kiss Trumps ring.",
    "His goal was to instead convince the former president that he had changed and to dissuade him from endorsing any of his opponents.",
    "He enlisted Rep. Marjorie Taylor Greene (R-Ga.) as a surrogate and even defended her appearance at a white-nationalist gathering.",
    "That was partly because Vances opponents had spent millions sharing footage of him criticizing Trump during the 2016 campaign.",
    "Besides, its not as if Vances rivals have been pushing Trump away; instead, they mostly fought each other to curry his favor.",
    "He became a frequent guest on Fox News host Tucker Carlsons show, as well as other right-wing channels such as Newsmax.",
    "Polling from Fox News shows Vance taking the lead since he received Trumps endorsement, with 25 percent undecided.",
    "Hes a natural on TV and has been happy to espouse Trumpian views on immigration, trade and foreign policy.",
    "The stunt backfired on Mandel, while Gibbons has struggled to defend his investments in China.",
    "Since 2018, that candidate has gone out of his way to embrace everything Trump stands for.",
    "The only candidate who has not bent the knee for Trump is state Sen. Matt Dolan.",
    "Dolan is the only candidate in the race who acknowledges that Biden won in 2020.",
    "Vance overcompensated for his past apostasies by going full MAGA.",
    "Vance also hired Andy Surabian, an adviser to Donald Trump Jr.",
    "Trump watched the debates and could see that Vance easily won.",
    "Vance has good reason to think his U-turn has been worth it.",
    "The 37-year-old might even be Trumps running mate.",
    "And now, J.D."
  ]
}