{
  "id": 6140,
  "mediaId": 237,
  "date": "d2022-04-26T22:09",
  "headline": "JD Vance takes lead in GOP Senate primary after Trump endorsement: Poll",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/271777b/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Ff5%2Fb8%2Fa613381d48c7bd4ead54bbe9a0ec%2Fap22114026137231.jpg",
  "link": "https://www.washingtonexaminer.com/news/campaigns/jd-vance-takes-lead-in-gop-senate-primary-after-trump-endorsement",
  "sentiment": "0.581",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Sivak",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-sivak",
  "termIds": [
    683,
    946,
    1147,
    1801,
    2027,
    2524,
    3103,
    428,
    571,
    2845
  ],
  "sentences": [
    "Trump, who traveled to Ohio on Saturday to campaign for Vance, has brushed off the attacks, saying that if past criticisms of him were a disqualifier, I dont think I would've ever endorsed anybody in the country.?\n\"I studied this very closely,\" Trump told a crowd of rallygoers in central Ohio, arguing that Vance is the most electable candidate in the primary.",
    "Vance is fending off attacks from Club for Growth, a super PAC backing Mandel that has been airing ads highlighting pointed criticisms Vance made toward the former president during the 2016 presidential election.",
    "Vance has jumped to first place in the GOP primary for Senate in Ohio, according to a poll released Tuesday, doubling his support after former President Donald Trump endorsed him earlier this month.",
    "But support from influential Vance allies  including billionaire Peter Thiel, Fox News host Tucker Carlson, and the former presidents own son, Donald Trump Jr.  ultimately proved decisive.",
    "The endorsement has led to a cash windfall for the Hillbilly Elegy author, with Protect Ohio Values, a pro-Vance super PAC, reportedly raking in $5 million after Trumps announcement.",
    "\"With support spread out among five candidates who are pretty similar in policy terms, the bump that comes with Trumps blessing is enough to jump Vance to the head of the pack.\"",
    "With only a handful of weeks before the May 3 primary, his campaign released a 30-second spot titled Endorsed,? part of a $500,000 ad blitz across the state.",
    "With the exception of Dolan, the candidates spent months vying for the former presidents endorsement in a state that Trump carried by 8 points in 2020.",
    "\"The race is obviously close, and this is clearly a case in which an endorsement has made a difference,\" Republican pollster Daron Shaw told Fox News.",
    "The two other Republicans in the race, state Sen. Matt Dolan and former Ohio GOP chairwoman Jane Timken, received 11% and 6%, respectively.",
    "The winner of the primary will likely face off against Tim Ryan, a Democrat who represents Ohios 13th Congressional District in Congress.",
    "The venture capitalist may be eating into support for businessman Mike Gibbons, who received 13%, a 9-point drop.",
    "Thiel, Vances biggest patron, contributed $3.5 million to the political action committee.",
    "Numbers for former Ohio state Treasurer Josh Mandel were nearly unchanged at 18%.",
    "Vance received 23% support in a poll by Fox News, compared to 11% in March.",
    "The poll's margin of error is plus or minus 3 percentage points.",
    "Vance has wasted no time touting the endorsement.",
    "But we have to pick the one thats going to win.",
    "\"I like a lot of the other people in the race.",
    "This guy is tough as hell.",
    "I liked them a lot.",
    "Hes going to win.\"",
    "J.D."
  ]
}