{
  "id": 6141,
  "mediaId": 63,
  "date": "d2022-04-26T21:52",
  "headline": "Checks & Imbalances: Trumps D.C. Hotel By The Numbers",
  "image": "https://imageio.forbes.com/specials-images/imageserve/62630d4ad085f499f8c41f40/gettyimages-1235973539-594x594/0x0.jpg?fit=crop&format=jpg&crop=594,396,x0,y0,safe",
  "link": "https://www.forbes.com/sites/zacheverson/2022/04/26/checks--imbalances-trumps-dc-hotel-by-the-numbers/",
  "sentiment": "0",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zach Everson",
  "authorUrl": "https://www.forbes.com/sites/zacheverson/",
  "termIds": [
    871,
    1147,
    3103,
    182,
    522,
    549,
    3650,
    2959,
    4997,
    5070
  ],
  "sentences": [
    "$73 million\nHow much money the hotel lost between 2016 and 2020, according to an analysis by the House Oversight Committee\n$173 million\nForbes October 2021 estimate of the value of the hotel\n$370 million\nWhat the hotel reportedly sold for\n$100 million\nHow much its believed the Trumps will profit from selling the hotel lease\nIn Case You Missed It\nTracking Trump\n\"Judge Holds Trump In Contempt For Failing To Hand Over Records To New York AG\" (Forbes)\n\"Court Orders Cushman & Wakefield to Comply with Attorney General James Subpoenas Related to Trump Investigation\" (New York State Attorney General)\n\"Trumps Truth Social SPAC Down More Than 9% Following Reports Twitter Is Nearing A Deal With Musk\" (Forbes)\n\"Trump's company to rumble with Twitter from Sarasota County | Opinion\" (The Sarasota Herald-Tribune)\nEditor's Picks\n\"Two more ex-members register as first-time lobbyists\" (LegiStorm)\n\"Elon Musk's Twitter takeover could personally benefit these congressional lawmakers\" (Insider)\n\"Rep. Ronny Jacksons campaign paid for dues at private social club\" (The Hill)\n\"Attorney says feds subpoenaed Hunter Biden paternity documents, including tax returns: \"They wanted every record'\" (CBS News)\n\"J.D.",
    "Other top members of the Trump administration spotted at the hotel included Vice President Mike Pence, Secretaries of State Rex Tillerson and Mike Pompeo, Attorneys General Jeff Sessions and William Barr, Secretaries of the Interior Ryan Zinke and David Bernhardt, Secretary of Agriculture Sonny Perdue, Secretary of Commerce Wilbur Ross, Secretary of Labor Alex Acosta, Secretaries of Health and Human Services Tom Price and Alex Azar, Secretary of Housing and Urban Development Ben Carson, Secretary of Transportation Elaine Chao, Secretary of Energy Dan Brouillette, Secretaries of Veterans Affairs David Shulkin and Robert Wilkie, Secretary of Homeland Security John Kelly, Office of Management and Budget Director Mick Mulvaney, Environmental Protection Agency Administrators Scott Pruitt and Andrew Wheeler, Chiefs of Staff Reince Priebus and Mark Meadows and Director of National Intelligence John Ratcliffe.",
    "and Tommy Tuberville (R-Ala.)\n$3.21 million\nCampaign spending at the hotel since Trumps election\nRepublican National Committee: $845,000\nAmerica First Action, Inc. (a pro-Trump super PAC): $566,000\nTrump Victory (the joint fundraising committee for the Trump campaign and RNC): $254,000\nGreat American Committee (a super PAC affiliated with Pence): $237,000\nProtect the House (a joint fundraising committee for Rep. Kevin McCarthy (R-Calif.) and the National Republican Congressional Committee): $221,000\nSenate Leadership Fund (a PAC affiliated with Sen. Mitch McConnell (R-Ky.)): $94,000\nSorry, Omarosa, but the most-notable Trump underling to celebrate nuptials at the boss hotel was special assistant to the president Stephen Miller, who celebrated his wedding to Pences press secretary Katie Rose Waldman there in February 2020.",
    "Other Trump administration officials to celebrate their weddings at their patrons hotel include Conway staffer Sarah Trevor and trip director in the executive office of the president William Russell, White House policy advisor (and a later a prominent attorney in attempts to overturn the 2020 election) Emily Newman, and special assistant to the vice president Zach Bauer and senior policy advisor at the Federal Housing Finance Agency Meghan Patenaude.",
    "$3.75 million\nThe amount of the hotels revenue that House Democrats calculated came from foreign governments during the first three years of Trumps presidency\nBased on the average daily rate for a room at the Trump Hotel, this represents the cost of more than 7,400 room-nights purchased by foreign governments,? according to Rep. Carolyn Maloney (D-N.Y.), chair of the House Committee on Oversight and Reform, and Rep. Gerald E. Connolly (D-Va.).",
    "How many days it took T-Mobiles CEO to show up in the hotels lobby after his company announced a merger with Sprint that would need government approval\n$195,000\nApproximate amount T-Mobile admitted to spending at the hotel while the merger was pending\nThroughout much of Trumps presidency, one of the few snapshots the public had into his hotels finances were the annual disclosures the president is required to file.",
    "Other countries with government officials spotted at the hotel include Afghanistan, Albania, Bosnia and Herzegovina, Brazil, Bulgaria, Canada, Cyprus, Ecuador, Egypt, Georgia, Greece, India, Italy, Kosovo, Netherlands, Pakistan, Philippines, Qatar, Russia, Saudi Arabia, Serbia, South Korea, Sweden, Turkey, Ukraine, United Arab Emirates and the United Kingdom.",
    "Members of Trumps cabinet spotted at the hotel (out of a total of 38)\nIf there were any questions about how Trumps cabinet would respond to his innkeeper side-hustle, Treasury Secretary Steve Mnuchin and Small Business Administration head Linda McMahon answered them quickly by moving into the hotel, separately, while looking for permanent digs.",
    "$459,320\nThe profits from foreign governments the Trump Organization said it made from all its hotels, resorts and clubs during Trumps presidency\nIn an attempt to mollify its critics, the Trump Organization each year cut a check to the U.S. Treasury for what the company said were its profits from foreign governments.",
    "At the grand opening of the Trump International Hotel Washington, D.C. at 1100 Pennsylvania Ave. in October 2016, then-candidate Donald Trump called it the most coveted piece of real estate in the city  with the notable exception of 1600 Pennsylvania Ave.?\nWithin weeks, Trump controlled both addresses.",
    "Events hosted at the hotel by special interests, according to a government watchdog\nThis is driven in part by fly-in visits by special interests on lobbying trips to Washington,? according to Citizens for Responsibility of Ethics in Washington, which kept this tally.",
    "33\nForeign governments whose representatives were spotted at the hotel\nTrump was still president-elect when the Embassy of Kuwait torched longstanding plans to celebrate its National Day at the Four Seasons, opting instead for the Trump International.",
    "Hopefully, more spending details  like the $1,600 steak dinner Department of Homeland Security officials enjoyed with foreign guests  will be made public from government investigations and responses to Freedom of Information Act requests.",
    "Senators spotted at the hotel or whose campaigns spent money there (all Republicans except Joe Manchin)\nThirty-five of the 65 Republicans who served in the Senate while Donald Trump was president helped him profit from his hotel.",
    "Just weeks after the Trump administration declared the coronavirus a public-health emergency, Sarah Huckabee Sanders, Kellyanne Conway and Mark Meadows joined at least three members of Trumps cabinet to fte the newlyweds.",
    "Vance Won Trumps Blessing, Now Hes Cashing In\" (The Daily Beast)\n\"Toyota's second U-turn\" (Popular Information)\n\"Chippendales lobbies up\" (Politico)\n\"Okay let's do one for posterity\"Tom Waits, \"Closing Time\"",
    "But with the work of reporters and congressional investigators as well as social-media posts and, in a few instances, disclosures from the Trump Organization itself, we do know a lot about the hotel already.",
    "Trumps visits, as president, to Washington restaurants other than the steakhouse in his own hotel\nIn November 2017, Trump promised to start eating at Washington restaurants other than the one in his hotel.",
    "Candidates, foreign governments, underlings, members of the administration and wannabes of all stripes flocked to the venue for their meetings, their parties, their fundraisers and even their weddings.",
    "By this time next week, however, Trumps Washington hotel will be like the White House  a historic, government-owned building now occupied by a competitor (in this case Hiltons Waldorf Astoria).",
    "U.S. government spending at the hotel\nA full accounting of how much taxpayer money made its way to the former presidents pockets via his Washington hotel will probably never be revealed.",
    "Trumps critics said any money paid to him by foreign governments or their representatives while he was president was a violation of the emoluments clause of the U.S. Constitution.",
    "The Texas Trucking Association, State Chamber of Oklahoma and Seasonal Employment Alliance were among the business groups that kicked up some money to the president while in town.",
    "While the former presidents ownership of the buildings lease is ending, reporting on what happened there and discussion over what precedents it set will continue.",
    "In September 2020, the Washington Post reported at least $2.5 million in government payments were made to all Trump properties, citing documents it obtained.",
    "(Of course, most concerns around the hotel focus on how much it was taking in and from whom, rather than the Trumps ability to run a profitable business.)",
    "Members of the world's greatest deliberative body dined with the president, addressed hundreds of active-duty soldiers and posed by the Christmas tree.",
    "But doing so would free up its current location for redevelopment, possibly as a luxury hotel that would compete with the former presidents business.",
    "Today we take a longbut certainly not lastlook at former President Donald J. Trump's D.C. hotel, which is slated to close in a few days.",
    "Trump reported revenue figures that were similar for each of the first three years of his term  between $40.4 million and $40.8 million.",
    "And with top government officials lingering, drinking and making small talk, how much did foreign spies love hanging out in the lobby?",
    "Azerbaijan and Bahrain were just as quick to step up by holding events at Trumps hotel before hed even taken the oath of office.",
    "After that, business appeared to decline, even before Covid-19 restrictions kneecapped several of the hotels revenue streams.",
    "Malaysias prime minister, Romanias president and two different prime ministers and Nigerias vice president all paid tribute.",
    "In 2018, Democrats on the House Oversight committee alleged the president himself intervened in the decision-making process.",
    "), Joni Ernst (Iowa) and John Hoeven (N.D.) huddled in a back room with Pence as a lobbyist for Quicken Loans looked on.",
    "Education Secretary Betsy DeVos popped in as an honored guest to the Museum of the Bibles $2,500-a-person opening gala.",
    "Fifteen months after Trump left office, lawmakers reversed his reversal and the plans to relocate the FBI were back on.",
    "The president himself gave a toast, marking the third different Trump property he visited in a 27-hour span.",
    "Or they just ate dinner there, often, as was the custom of Secretary of Homeland Security Kirstjen Nielsen.",
    "The FBIs current headquarters are a two-minute walk across Pennsylvania Avenue from Trumps hotel.",
    "Moving the bureau out of the decrepit J. Edgar Hoover Building had been in the works for years.",
    "(The Trump International often promoted itself as downtown Washingtons only five-star hotel.)",
    "And the policy relied on foreign officials identifying themselves as such to Trump employees.",
    "It wasnt just lower-level apparatchiks or backbenchers popping up in the ballrooms and lobby.",
    "But in four years, the courts never came close to issuing a definitive ruling on the matter.",
    "Trumps top lieutenants also brought the hotel customers and publicity by headlining events.",
    "As with the Trump White House, itll take decades to unpack what took place at the hotel.",
    "The Trump administration reversed those longstanding plans to relocate FBI HQ.",
    "The whole exercise appears to have been a waste of time and taxpayers money.",
    "Secretary of Energy Rick Perry addressed the National Mining Association.",
    "One Democrat did likewise (why yes, it was West Virginias Joe Manchin).",
    "Other times, their visit was more of a private affair, like when Sens.",
    "There were plenty of loopholes too that allowed the Trumps to profit.",
    "), Jeff Sessions (R-Ala.), Dan Sullivan (RAlaska), John Thune (RS.D.)",
    "), Chuck Grassley (RIowa), Orrin Hatch (R-Utah), Josh Hawley (RMo.",
    "While that form asks for income, Trump reported revenue instead.",
    "), Mike Crapo (RIdaho), Ted Cruz (RTexas), Cory Gardner (RCol.",
    "(FBI and General Services Administration officials denied it.)",
    "Other senators spotted at the hotel: Marsha Blackburn (RTenn.",
    "In year four, Trumps revenue was down to just $15.1 million.",
    "These payments, however, were not independently audited.",
    "Did a foreign government book rooms but never use them?",
    "Who ordered the $100 martini with caviar and oysters?",
    "Welcome to the Checks & Imbalances newsletter.",
    "What secret deals were made in the backrooms?",
    "Theres no report of him ever having done so.",
    "), Lisa Murkowski (RAlaska), Rand Paul (RKy.",
    "), John Cornyn (RTexas), Tom Cotton (RArk.",
    "He teased the idea again two years later.",
    "Here are some of the key statistics.",
    "Much of it will remain unknown.",
    "Favor seekers caught on fast.",
    "), Cindy Hyde-Smith (RMiss.",
    "), Lindsey Graham (RS.C.",
    "), Mitch McConnell (RKy.",
    "), Kelly Loeffler (RGa.",
    "), James Inhofe (ROkla.",
    "), John Boozman (RArk.",
    "), Bill Cassidy (RLa.",
    "), Ron Johnson (RWis.",
    "), John Kennedy (RLa.",
    "), David Perdue (RGa.",
    "), Pat Roberts (RKan.",
    "), Mike Rounds (RS.D.",
    "), Marco Rubio (RFla.",
    "), Rick Scott (RFla.",
    "), Tim Scott (RS.C.",
    "), Ben Sasse (RNeb.",
    "), Roy Blunt (RMo.",
    "Tom Barasso (Wy.",
    "Hopefully.",
    "U.S.",
    "?"
  ]
}