{
  "id": 6148,
  "mediaId": 43,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Trumpists coalesce at megachurch rallies to create their own brand of",
  "image": "https://images.dailykos.com/images/1062837/story_image/GettyImages-1240140536.jpg?1650959368",
  "link": "https://www.dailykos.com/story/2022/4/26/2094096/-Trumpists-coalesce-at-megachurch-rallies-to-create-their-own-brand-of-a-far-right-extremism",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Neiwert\nDaily Kos Staff",
  "authorUrl": "/users/david neiwert",
  "termIds": [
    3103
  ],
  "sentences": [
    "Playing a central role in the coalescence of these three elements under Trumpism are evangelical megachurches and the rolling tent-revival-style political rallies that QAnon-loving Trumpists have organized as national tours, particularly the ReAwaken America Tour, a traveling roadshow that has featured far-right Republican politicians, anti-vaccine activists, election conspiracists and Trumpworld personalities,? not to mention megachurch pastors like Greg Locke, who has a social-media following in the millions.",
    "The rallies often operate under different names, but they seem to share a rotating cast of stolen-election celebrities, including Douglas Frank, a former Ohio math teacher whose second career as a (widely debunked) elections expert? has taken off; Seth Keshel, a former Army captain and military intelligence analyst who worked alongside Flynn spreading disinformation in the weeks immediately after the election; Lindell, Flynn, and various other QAnon-connected figures.",
    "Featuring Keshel and Frank as the headliners, its primarily a campaign booster for Trumpist Republicans like Mark Finchem, a state legislator who was present at the Jan. 6 insurrection in Washington running for Secretary of State; and Ron Watkins, the man closely associated with QAnon when he oversaw operations at the message board 8kun, who is running for the GOP nomination for a congressional seat.",
    "He went on: If youre involved in election fraud, you deserve to hang.?\nPeters, who first grabbed attention in January 2021 by claiming she had evidence that Dominion voting systems were producing fraudulent results, became a celebrity at Trumpist events last summer, appearing onstage with figures like Flynn and My Pillow CEO Mike Lindell, another Stop the Steal? conspiracy theorist.",
    "Locke, similarly, was present at the Capitol on Jan. 6speaking alongside Alex Jones of Infowars at a Rally for Revival? the night before, at which he offered a prayer for the Proud Boys and its imprisoned leader, Enrique Tarrio, who had been jailed two days before on charges related to his arson of a Black Lives Matter banner three weeks before.",
    "It cites one poll, released in November by the Public Religion Research Institute, which reported 60 percent of white evangelicals persist in believing that Trump was only beaten with fraud, compared to 40 percent of white Catholics, 19 percent of Hispanic Catholics and 18 percent of Black Protestants who believed the same.",
    "Finchem, for his part, filed a bill last September in the Arizona Legislature seeking to overturn the certification of the states 2020 presidential election counteven though the dubious audit? he based the legislation on established again that Joe Biden had defeated Trump in the state.",
    "Vigan told the audience (as he has done elsewhere) that the Russian military is actually preventing Deep State aggression and combating the globalist cabal.? He also claimed that the Ukrainian neo-Nazi Azov Battalion were present at the Jan. 6, 2021 Capitol insurrection.",
    "The rally was part of a nationwide tour by far-right alpha male? Clay Clark, featured leading QAnon figure Michael Flynn and other Trumpist media stars: Eric Trump, My Pillow? executive Mike Lindell, notorious homophobe Sean Feucht, and a large cast of others.",
    "Left Coast Right Watch reports that this was absolutely a QAnon event?:\nIt featured former QAnon promoters like Ann Vandersteel, Gene Ho, John Chambers, and cranks like Lori Gregory, who appeared on a QAnon show to promote antivaxx conspiracy theories.",
    "Julianne Jackson, founder of Black Joy Oregon, told the Salem Statesman-Journal that the rally made her feel unsafe in her own communityparticularly after social media postings advertised a post-rally celebration of \"Anglo American identity.\"",
    "The Proud Boys-evangelical connection has been building in the past year, notably when pastors organize political events at which the street-brawling neofascists can provide security.? There were two such events last year in Oregon.",
    "A recent New York Times piece about how evangelical churches are building an army of Trump fans who believe the 2020 election was stolen through fraud gives us a clear and disturbing portrait of the emerging shape of Trumpism.",
    "Flynn turned up most recently in Ohio, where he campaigned for MAGA candidate Josh Mandel, who is seeking the nomination for a U.S. Senate seat with a Trumpist agendaeven though Trump himself endorsed his rival J.D.",
    "The information is coming out.?\nThe rallies are readily adapted to strictly political settings as well, such as the Save the Vote? event (a Restoring Faith in Elections Rally?) planned in Payson, Arizona, on May 15.",
    "A central figure at the rallies has been Lt. Gen. Michael Flynn, Trumps onetime national-security chief who became a prominent QAnon promoter after being fired for lying to the FBI (and later pardoned by Trump).",
    "But its post-Jan. 6 metastasis, bringing these elements together, suggests it has become its own kind of extremism: wildly conspiracist, militantly if not fanatically religious, and fundamentally violent.",
    "United event featuring two major figures in the stolen-election narrative: Shawn Smith, a founder of U.S. Election Integrity Plan, and Tina Peters, the clerk and recorder of Mesa County.",
    "Rabe, a pastor of The House Ministry Center, a nondenominational church in Snohomish, Washington, told his congregation at an August worship service featuring a talk by Keshel.",
    "At one point, Flynn introduced a video appearance from Archbishop Carlo Maria Vigan, the onetime Apostolic Nuncio to the U.S., who launched into a pro-Putin, anti-Ukraine rant.",
    "Thielman, the former superintendent of schools in rural Alsea who stepped down after defying COVID-19 mask mandates, is scheduled to speak at an April 15 fundraiser for Tooze.",
    "Let me say it very clear: I believe this election was STOLEN, from Donald Trump,? Mandel told the audience, adding that even without the endorsement, hes got the grass-roots.",
    "The performances wrap the narrative of election fraud in a megachurch atmosphere, complete with worship music and prayer, and have drawn criticism from some Christian clergy.",
    "Peters was indicted last month on charges that she devised a scheme to copy voting-machine hard drives and share the data with prominent 2020 election conspiracists.",
    "Besides being present in the crowd, far-right candidate Marc Thielman was publicly endorsed onstage by speaker Kevin Jenkins, and happily acknowledged the plug.",
    "When the tour came to a church in San Marcos, Calif., this month, a local Methodist minister denounced it as an irreligious abomination? in an opinion essay.",
    "ReAwaken America, as the story notes, has attracted massive audiences numbering in the thousands to these megachurch venues, held in nine states this year.",
    "United (Founded on the Three Pillars of Society: Faith, Education, and Commerce?), organizes events at megachurches and similar venues around the country.",
    "It is framed by three key elements that are merging into a whole: Christian nationalists, the authoritarian QAnon conspiracist cult, and the Proud Boys.",
    "It was also a highly religious eventsix people on the list had Pastor? in front of their names with other evangelical figures speaking as well.",
    "Hes getting outspent heavily,? but is still winning because we have this army of Christian warriors.?\nThis is a short blurb about Daily Kos.",
    "All but one of the tours stops have been hosted by megachurches, and the tour is sponsored by a charismatic Christian media company.",
    "There were, in total, 38 featured speakers, at least ten of which were there specifically to promote antivaxx and COVID paranoia.",
    "Hell be joined by two local Republican candidates, Clackamas County Commissioner Mark Shull and commission candidate Steve Frost.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Also among the crowd: Dan Tooze, the Proud Boys organizer who is running for a state House seat from Oregon Citys District 40.",
    "Smith made headlines at the event when he accused Colorados Democratic secretary of state, Jena Griswold, of election fraud.",
    "Weve usually thought of Trumpism as being an essentially mainstream-conservative movement with expanding extremist elements.",
    "Among them is The Rock, a nondenominational evangelical church in Castle Rock, Colorado, which in February hosted an F.E.C.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The Times notes that white evangelical churchgoers are extremely prone to buy into the narrative of a stolen election.",
    "Both Flynn and Locke appeared at the ReAwaken America event earlier this month in Keizer, Oregon, a Salem suburb.",
    "This will be your opportunity to find out real information about what really happened at the polls,? D.J.",
    "Former National Security Adviser Michael Flynn campaigned for Ohio MAGA candidate Josh Mandel this week.",
    "The event drew about 4,000 attendees, with people arriving from around the Pacific Northwest.",
    "\"It's very important to read between the lines and know that means whiteness,\" Jackson said.",
    "Since then, Tarrio has been indicted on conspiracy charges for his role in the insurrection.",
    "That did not daunt Flynn (I think hes been poorly advised,? he told reporters) or Mandel.",
    "Heres what were going to find out: What everyone thinks happened didnt really happen.",
    "Flynn played a leading role in the QAnon-led campaign to overturn the 2020 election.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Thielman and Tooze have a well-documented relationship of mutual avid support.",
    "It was a nonstop circus of right-wing conspiracism and Christian nationalism.",
    "He took a selfie there with the Oregon Proud Boys vice president, Carl Todd.",
    "At the churches, pastors often step up and endorse the conspiracy theories.",
    "\"And that means danger for people like me and people that look like me.\"",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Donate $5\nDonate $25\nDonate $15\n'\nDonate $5 monthly",
    "Another Trumpist evangelical organization, F.E.C.",
    "Counterprotesters also turned out.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Please read it.",
    "Vance."
  ]
}