{
  "id": 6150,
  "mediaId": 19,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Poll: J.D. Vance Takes the Lead in Ohio Republican U.S. Senate Primary",
  "image": "https://media.breitbart.com/media/2022/04/AP21183828334156-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/26/poll-j-d-vance-takes-the-lead-in-ohio-republican-u-s-senate-primary/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    668,
    946,
    1801,
    2027,
    2466,
    3103,
    200,
    428,
    571,
    2845
  ],
  "sentences": [
    "With support spread out among five candidates who are pretty similar in policy terms, the bump that comes with Trumps blessing is enough to jump Vance to the head of the pack.?\nThe poll, which surveyed 906 Ohio GOP primary voters, was conducted between April 20 and April 24.",
    "Trump said Vance is the most likely to take out the weak, but dangerous, Democrat opponent.?\nThe race is obviously close, and this is clearly a case in which an endorsement has made a difference,? Fox News pollster Daron Shaw said.",
    "A Fox News survey found that 23 percent of Ohio Republican primary voters support Vance, which is five points ahead of the next leading candidate.",
    "Vance has a good chance of earning support from those undecided voters because they view him as the most likable candidate.",
    "Vance is the leading candidate in the Ohio Republican U.S. Senate primary, according to a recently released poll.",
    "Vances jump in the polls can likely be attributed to his recent endorsement by former President Donald Trump.",
    "Josh Mandel received 18 percent support in the latest poll, and Mike Gibbons earned 13 percent support.",
    "In fact, 42 percent of primary voters said Trumps endorsement made them more supportive of Vance.",
    "Ohio State Sen. Matt Dolan received 11 percent support, and Jane Timken received six percent.",
    "Since the last survey, Mandel lost two percent support, and Gibbons lost nine percent.",
    "The next closest favorable candidate is Dolan, who has a +21 percent favorable rating.",
    "Vances 23 percent support is up by 12 points since Fox Newss last survey in March.",
    "Of those voters who have chosen a candidate, Vance has a +29 favorable rating.",
    "Mandel follows closely behind him with a +12 percent net favorable rating.",
    "Vance has a +14 percent net favorable rating among undecided voters.",
    "An additional 27 percent said Trumps endorsement made no difference.",
    "However, 25 percent of GOP primary voters in Ohio remain undecided.",
    "However, 23 percent of voters said it made them less supportive.",
    "The polls margin of error is  three percent.",
    "J.D."
  ]
}