{
  "id": 6155,
  "mediaId": 237,
  "date": "d2022-04-25T13:18",
  "headline": "Biden thinks Democrats can gain Senate seats this year  with Trump's help",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/50aa127/2147483647/strip/true/crop/2798x1469+0+198/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F96%2Fef%2Fad76efab45a58d8c5d55a14e3fdd%2Fap22115566140390.jpg",
  "link": "https://www.washingtonexaminer.com/news/white-house/joe-biden-thinks-democrats-can-gain-senate-seats-in-2022-midterm-elections-with-donald-trumps-help",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christian Datoc",
  "authorUrl": "",
  "termIds": [
    815,
    895,
    1147,
    1653,
    1925,
    2087,
    3103,
    146,
    149,
    571,
    2672,
    2818
  ],
  "sentences": [
    "And he will fight against the Republican plan to raise taxes on middle-class families and to threaten the future of Social Security and Medicare while continuing giant handouts to the very top and the largest corporations.?\nRepublican campaign officials, however, have sought to tie vulnerable Democrats to Biden's approval rating, which, after a slight bump during the opening weeks of the war, has sunk back down to a term low in RealClearPolitics's polling average.",
    "A spokesperson for the DSCC told the Washington Examiner that the committee's primary goal heading into the midterm elections is \"working to defend our battleground incumbents\" in Arizona, Georgia, Nevada, and New Hampshire, but beyond that, the DSCC will take \"advantage of every opportunity\" Republicans give it.",
    "Biden visited Greensboro, North Carolina, in recent weeks to lobby support for his plan to boost manufacturing and tout the administration's outreach to historically black colleges and universities, but he has not stopped by Pennsylvania, Ohio, or Wisconsin at nearly the same clip set by his first year in office.",
    "Meanwhile, Florida Republican Sen. Marco Rubio is facing a challenge from sitting Democratic Rep. Val Demings, the first black woman to serve as Orlando's chief of police, and the race to replace retiring Republican Sen. Richard Burr in North Carolina remains wide open ahead of the primaries.",
    "Multiple senior Democratic officials told the Washington Examiner that, in addition to the Pennsylvania and Ohio races, they are optimistic about Florida, North Carolina, and Wisconsin, though the Democratic Senatorial Campaign Committee has yet to offer any endorsements.",
    "\"The president is going to continue fighting for middle-class tax relief and to make sure the richest Americans and largest corporations dont pay a lower rate than middle-class families,? the White House said in a Tax Day statement criticizing Scott's plan.",
    "Just In...\nPresident Joe Biden's declaration that Democrats will pick up two Senate seats this year has been amplified by party officials in recent days, with some suggesting that the number of seats gained could be even higher.",
    "The president opened 2022 by promising to hit the road more to interact with voters and campaign for vulnerable Democrats, but his ability to travel has been hindered by coordinating the West's response to the war in Ukraine.",
    "\"When Trump kind of interferes, they get even nastier, even more expensive, and even more chaotic, and so we're really feeling like these GOP primaries are messy and lead to a liability for the general election electorate.\"",
    "Polling averages have Georgia Democratic Sen. Raphael Warnock trailing Trump-endorsed Herschel Walker in Georgia, with Hassan, Sen. Mark Kelly of Arizona, and Sen. Catherine Cortez Masto of Nevada all in competitive races.",
    "\"We've seen across the battleground states this year, really, Trump creating more chaos in these GOP primaries that have already been, really, kind of nasty, expensive, and chaotic,\" a DSCC official said of the situation.",
    "Former President Donald Trump's endorsement could push them through to the general, though the DSCC expects the tone of the primaries, with Trump's expected close involvement, to turn off centrist Republican voters.",
    "DSCC Chairman Gary Peters previously stated he was \"confident\" Democrats will unseat Johnson and, like Biden, has predicted walking away from the midterm elections with two more seats in hand.",
    "Johnson is the only Wisconsin Republican to win a Senate race in four decades, and Democratic operatives have put a target on the seat after he announced his reelection campaign in January.",
    "Today, voters everywhere will be reminded that Maggie Hassan helped Joe Biden bring his failed agenda to life every step of the way,\" National Republican Senatorial Committee spokesman T.W.",
    "The president and allies did ramp up messaging in April around Florida Republican Sen. Rick Scott's 11-point proposal to \"tax poor people,\" according to one senior Democratic official.",
    "\"The wave of Republican retirements has created some opportunities in that space, as well as [Wisconsin Republican Sen.] Ron Johnson's poor approval rating,\" that person added.",
    "\"Republicans are putting their foot in their mouth and highlighting what a Republican majority would look like,\" the official told the Washington Examiner.",
    "Biden's agenda has frequently stalled in the Senate, with the least liberal members of the caucus able to block any bill that lacks bipartisan support.",
    "The Senate is currently split 50-50, with Democrats controlling the chamber due to Vice President Kamala Harris's tiebreaking vote.",
    "It will also make her panicked lurch to the right on immigration and drilling look as insincere as humanly possible.",
    "He cares deeply about the Senate,\" Peters told Politico of Biden's stated plan to campaign openly throughout 2022.",
    "\"I think that is going to be motivating for a lot of people as we get through the summer and you see more ads.",
    "[Democratic] voters will become much more enthusiastic as they tune into the election.\"",
    "Democratic wins in battleground elections could be wiped out by vulnerable incumbents.",
    "Vance are down in Republican primary polls in Pennsylvania and Ohio, respectively.",
    "Arrighi said in a statement during Biden's recent trip to New Hampshire. \"",
    "Hassan owns the Biden agenda and Granite Staters know it.\"",
    "\"What a great day to be a New Hampshire Republican.",
    "\"Well be working really closely with the president.",
    "To me, the presidents always an asset.\"",
    "Mehmet Oz and J.D."
  ]
}