{
  "id": 6165,
  "mediaId": 238,
  "date": "d2022-04-25T00:00",
  "headline": "On trip to border, McCarthy deflects questions about Trump and Jan. 6",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZPKBW4WE2MI6ZDH7GOYFT5GBW4.jpg&w=916",
  "link": "https://news.google.com/__i/rss/rd/articles/CBMiT2h0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDIyLzA0LzI1L21jY2FydGh5LWJvcmRlci10cnVtcC1iaWRlbi_SAQA?oc=5/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    821,
    1097,
    1147,
    1609,
    2087,
    2303,
    3103,
    4035,
    4212,
    4258,
    2882,
    2945
  ],
  "sentences": [
    "Edwards is just one of the seven Republicans whom Cawthorn will face in the GOP primary  a reelection effort thats proving to be challenging for the incumbent after he lost the support of establishment Republicans in the state following his allegations that older GOP lawmakers in Washington had invited him to an orgy.? The states two Republican senators have turned their backs on him, with retiring Sen. Richard Burr calling him an embarrassment.?\nAdvertisement\nThe latest: Greene brought up martial law in texts to Meadows\nRep. Marjorie Taylor Greene (R-Ga.) told White House chief of staff Mark Meadows that some members of Congress were suggesting that Donald Trump impose martial law to remain in office after losing the 2020 election.",
    "Congress is also waiting for Biden to ask for a supplemental package of military and humanitarian assistance for Ukraine, which the House hopes to pass this week.The Senate will be heavily focused on voting through several Federal Reserve and Federal Trade Commission nominees this week, as well as coordinating with the House on jump-starting conversations about domestic issues of importance, including the defunct social spending plan known as Build Back Better and a coronavirus relief package.It is also expected that both chambers will begin ironing out differences over the Bipartisan Innovation Act, a massive global competitiveness bill, as early as Tuesday.",
    "In texts provided to CNN by the House select committee investigating the deadly Jan. 6, 2021, insurrection, Greene raised the topic of martial law in a message to Meadows sent on Jan. 17, 2021, more than a week after the insurrection and three days before Bidens inauguration, Felicia Sonmez reports:\nIn our private chat with only Members, several are saying the only way to save our Republic is for Trump to call for Marshall law,? Greene texted Meadows, misspelling the word martial.? I dont know on those things.",
    "On Wednesday, the president and first lady are hosting the national and state teachers of the year at the White House.Biden is also eulogizing former secretary of state Madeleine Albright at her funeral Wednesday morning at the Washington National Cathedral.And on Saturday, he is planning to attend the White House Correspondents Association dinner, the first time a sitting president has attended the gathering since 2016 given that former president Donald Trump skipped it.",
    "Biden is also slated to meet with the Congressional Hispanic Caucus on Monday, when a key topic of discussion is likely to be Title 42 border restrictions, something the group wants repealed but some moderate Democrats want to continue.Biden this week also has several other items on the agenda, including welcoming the Tampa Bay Lightning to the White House on Monday to celebrate its 2020 and 2021 Stanley Cup championships.",
    "Today, House Minority Leader Kevin McCarthy led a group of fellow Republicans on a tour of the U.S.-Mexico border to highlight President Bidens border crisis.? Facing reporters, McCarthy (R-Calif.) deflected questions stemming from his dishonesty after the release of audio that captured him saying that President Donald Trump was to blame for the storming of the Capitol on Jan. 6, 2021, and should resign.",
    "Samantha Pell: Lightning coming to the White House lawn  The Tampa Bay Lightning hockey team is visiting the White House on Monday to celebrate its 2020 and 2021 Stanley Cup championships.The Lightning did not visit the White House the past two years because of coronavirus concerns  nor did the team visit after its 2004 Stanley Cup victory because of a National Hockey League lockout.",
    "The mixed response to lifting the mask mandate  some cities and transit authorities have said they will still require masks, while others completely got rid of them, and plenty of airlines quickly ditched them  shows how the patchwork policies that have abounded during this crisis can lead to a loss in confidence in the public health agency.",
    "Advertisement\nThe latest: McCarthy keeps dodging questions on Trump and Jan. 6\nHouse Minority Leader Kevin McCarthy (R-Calif.) continued dodging questions about a New York Times revelations that he told other Republicans he would urge Donald Trump to resign in the wake of the Jan. 6, 2021, insurrection, Felicia Sonmez reports.",
    "President Biden is expected to be in Washington all this week, with meetings scheduled with congressional leaders amid questions about key elements of his legislative priorities.Priorities for the White House include a covid aid funding bill, Ukraine aid legislation and trying to salvage parts of its Build Back Better agenda.",
    "On our radar: Blinken to testify on Russian invasion, Garland on DOJ budget\nCongresss spring recess is over, and the House is expected to hold its first votes Tuesday evening after a Republican cohort led by House Minority Leader Kevin McCarthy (R-Calif.) flies back to Washington from the U.S.-Mexico border.",
    "Advertisement\nThe latest: Top White House adviser slated to leave administration next month\nWhite House adviser Cedric L. Richmond, one of Bidens closest political allies, will likely leave his role sometime in May, a person familiar with the decision told The Posts Amy B Wang and Tyler Pager.",
    "And I dont think he has enough money to do that.?Trump said his own reach on Twitter had been reduced by the companys policies, affecting the echo chamber? where media debates and politics play out.I hope hes able to make some changes, but I dont think its that simple,? Trump said of Musk.",
    "Asked about the sale, both said they were excited to see how Musk could change the company and what it could mean for conservatives who felt censored.I think its good for Twitter,? Vance said, but at the end of the day, the Big Tech problem; Twitters a very small part of it.",
    "Advertisement\nTake a look: Cawthorns GOP challenger taunts him in new ad  but not by name\nRep. Madison Cawthorns (R-N.C.) Instagram presence is at the center of a new attack ad by one of the freshman congressmans primary challengers, state Sen. Chuck Edwards (R-N.C.).",
    "Amy and Tyler were told that Richmond will serve in a central role as a senior advisor at the DNC, taking on a similar role to what he had on the campaign in 2020.? In that role, Richmond will likely travel across the country to help fundraise ahead of the midterms.",
    "Please tell him to declassify as much as possible so we can go after Biden and anyone else!?\nAs Sonmez notes, news of the text comes just days after Greene testified in a separate case that she could not recall whether she had advocated for martial law at the time.",
    "As a refresher: In a preview of their upcoming book, Times reporters Jonathan Martin and Alexander Burns reported last week that McCarthy talked to fellow congressional Republicans after the insurrection and said hed demand that the former president step down.",
    "According to the Atlanta Journal Constitution, Cagle earned the NRAs endorsement after blocking a tax break that would have benefited Delta Air Lines  which at the time was feuding with the NRA after ending discounted rates for the organizations members.",
    "So you cant just say, Hey, were going to change things. Youve got to get everyone else to comply.?\nTake a look: Biden praises Tampa Bay Lightning effort to vaccinate fans\nAdvertisement\nYour questions, answered: Does order on masks signal a weaker CDC?",
    "McCarthy was at the center of national attention once again Monday after more texts between him and other Republicans sent in connection to the Jan. 6, 2021, insurrection were released by the House select committee investigating the deadly attack.",
    "Advertisement\nNoted: Republican senator expresses strong support for Biden nominee\nSen. Steve Daines, a Montana Republican, expressed strong support Monday for Bridget Brink, President Bidens nominee to serve as U.S. ambassador to Ukraine.",
    "The court is set to rule on the fate of Remain in Mexico?  the Trump administration-era policy also known as Migrant Protection Protocols, which forced many immigrants seeking asylum to stay in Mexico as they awaited their hearings.",
    " asks a reader from Washington, D.C.\nA decision by a federal judge in Florida last week to end a CDC mandate of masks for passengers aboard planes and public transit sent the Biden administration and the health agency scrambling.",
    "Brinks nomination came as Secretary of State Antony Blinken and Defense Secretary Lloyd Austin met with Ukrainian President Volodymyr Zelensky on Monday in the first high-level U.S. visit to Ukraine since Russias invasion began.",
    "White House press secretary Jen Psaki on Monday did not explicitly confirm reports that Richmond is leaving the Biden administration, Amy and Tyler report, but hinted that his next role was one sanctioned by the White House.",
    "Trump, I know you take your business seriously, and I take mine seriously,? Engoron said in issuing his order  appearing to address the former president directly even though Trump was not in the courtroom for the hearing.",
    "), a confidant of Bidens, raised some eyebrows for suggesting it was time for the administration to discuss under what circumstances the U.S. military might take a direct role in response to Russian aggression in Ukraine.",
    "Noted: Biden endorses incumbent in Ore. Democratic primary\nBidens backing of Schrader is notable given that the seven-term congressman has opposed some of the presidents priorities, including raising the minimum wage.",
    "Many in the states GOP establishment have backed the current governor, making the race a notable test of Trumps endurance in a state that became a major battlefield in his efforts to overturn the election.",
    "Many members are returning after traveling to Europe.The House, which returns Tuesday, is expected to pass a Senate-approved bill to strengthen and streamline the sharing of defense systems with Ukraine.",
    "There has been no indication that any Lightning players plan to skip this visit.The St. Louis Blues visited President Donald Trump in October 2019 after winning the Stanley Cup a few months before.",
    "The judge said he would hold Trump in contempt until Trump and his legal team fully detail the extent of their search and either submit the records or swear that no records being sought exist.",
    "And Trump was held in contempt and told by a judge in New York to pay $10,000 a day until he complies with an order to produce records that are part of a civil probe of his business practices.",
    "I was calling on Congress to have a conversation about where we are heading,? especially if Putin takes the dramatic step of invading one of Ukraines non-NATO neighbors, Coons said.",
    "He trusts him implicitly.?\nThe former Louisiana congressman co-chaired Bidens presidential campaign before joining the White House as director of its Office of Public Engagement.",
    "Noted: NRA endorses Kemp in Ga. gubernatorial primary\nKemp missed out on the NRAs endorsement during his last election, when the organization backed his opponent, then-Lt. Gov.",
    "The Washington Capitals took part in a private tour and met Trump in the Oval Office in March 2019 after winning the teams first franchise championship in the summer of 2018.",
    "Trump, for his part, has said he harbors no ill feelings toward McCarthy, proving, so far, the extent of the loyalty between the former president and the Republican leader.",
    "If confirmed by the Senate, Brink will fill a crucial position that has remained officially vacant for three years and as Russia continues its brutal assault on Ukraine.",
    "The two said U.S. diplomatic operations would resume this week in Ukraine, in a first step toward reopening the U.S. Embassy in Kyiv, The Posts Mara Luisa Pal reports.",
    "McCarthy vehemently denied this reporting, which spurred the Times to release audio of a Jan. 10, 2021, call in which McCarthy said of Trump: Ive had it with this guy.",
    "As Amy and Tyler note, Richmond  who also served once as chairman of the Congressional Black Caucus  is a trusted intermediary between the White House and Congress.",
    "Your daily dashboard\n2 p.m. Eastern: Biden welcomed the Tampa Bay Lightning to the White House and recognized the teams work on vaccinations and community service.",
    "Marianna Sotomayor: Whats ahead on the Hill this week  Congress is back after a two-week recess with a lot on its plate to address domestic and foreign priorities.",
    "Nobody can defend that, and nobody should defend it.?\nMcCarthy also claimed that the New York Times reporter had asked him whether he asked Trump to resign.",
    "Advertisement\nDavid Weigel: Vance, Trump Jr. still wary of Big Tech despite Musks major purchase  The news that Elon Musk had bought Twitter broke when J.D.",
    "I have been in many meetings with Cedric Richmond where the president goes to him and looks to him for his political sense, his assessment of Congress.",
    "Matt Viser: The week ahead at the White House  If last week was about getting outside the Beltway, this week is about tending to matters inside of it.",
    "Each weekday, well guide you through the news with assists from some of the best political reporters in the business providing insights and analysis.",
    "If youre answering  if youre asking now, Did I tell my members that were going to ask? Ask them if I told any of them that I said to President Trump.",
    "The latest: Sen. Coons says Congress should be prepared for Russian aggression beyond Ukraine\nEarlier this month, Sen. Christopher A. Coons (D-Del.",
    "While he voted for Bidens American Rescue Plan, one of the presidents most successful policy pushes, Schrader was initially against the measure.",
    "Attorney General Merrick Garland will testify before the Senate Appropriations subcommittee on commerce, justice, science and related agencies.",
    "Richmonds move to the DNC could help strengthen the committees ties with the White House as the focus shifts to this years midterm elections.",
    "Youve still got Facebook, you still got Google, so you still need a policy response to Big Tech unless Elons going to buy all three or four.",
    "Let me first say that Cedric Richmond has been [and] continues to be a vital, essential adviser to the president,? Psaki said.",
    "Welcome to Post Politics Now, a live experience from The Washington Post that puts the days political headlines into context.",
    "Dainess endorsement marks a rare note of Republican support for a Biden nominee, particularly one in such a key position.",
    "What do we do as a Western community of nations  if he [Putin] rolls into Moldova, if he rolls into Georgia?? Coons said.",
    "The Biden administration has attempted to strike down the policy twice, only to be overruled by a Trump-appointed judge.",
    "Meanwhile, Biden welcomed the Tampa Bay Lightning hockey team to the White House to celebrate back-to-back Stanley Cups.",
    "Vance and Donald Trump Jr. were onstage in Dayton, Ohio, talking to Republican voters about the threat of Big Tech.",
    "Is the new decision ending the mask mandate another sign of a weakening Centers for Disease Control and Prevention?",
    "According to the Willamette Week, McLeod-Skinner has accused Schrader of obstructing the presidents agenda.",
    "Meanwhile, Schrader challenger Jamie McLeod-Skinner has the endorsement of Sen. Elizabeth Warren (D-Mass.)",
    "Where are we heading with this thing?? What if Russia carries out a successful cyberattack on a NATO ally?",
    "Theres tens of thousands of people that work there that are all indoctrinated into that leftist thinking.",
    "The reporter came to me the night before he released the book,? McCarthy said Monday in Eagle Pass, Tex.",
    "Kemp has held the advantage over Perdue in polling, and the former senator is struggling to raise money.",
    "Richmond will likely take on a consultant role at the Democratic National Committee, the person said.",
    "No Blues players skipped their event, while a handful of Washington players declined the invitation.",
    "Biden has made clear hes not interested in going there, saying it could lead to World War III.",
    "Secretary of State Antony Blinken will testify before the Senate Foreign Relations Committee.",
    "endorsement, as well as the backing of liberal groups including the Working Families Party.",
    "And thats what I was answering.?\nAs McCarthy continued, his words became somewhat garbled.",
    "That story may continue leading the headlines this week as the House resumes its duties.",
    "Garland is expected to testify on Bidens 2023 budget request for his department.",
    "The nations top diplomat is expected to testify on Russias invasion of Ukraine.",
    "And my understanding was, he was saying, did I ask President Trump to resign?",
    "(The NATO charter pledges members to come to each others aid if attacked.)",
    "The newspaper made no such assertion in its story on the phone call.",
    "This just in: Trump told to pay $10,000 a day in contempt order\nMr.",
    "He chided reporters for asking him questions on the topic.",
    "The Supreme Court will hear arguments in Biden v. Texas.",
    "Advertisement\nAdvertisement\nAdvertisement\nAdvertisement",
    "What if a Russian rogue missile? strikes NATO soil?",
    "I was not calling for us to send American troops.",
    "Casey Cagle, during the states 2018 primary.",
    "I was not criticizing President Biden.",
    "They will destroy our country next.",
    "I just wanted you to tell him.",
    "What he did is unacceptable.",
    "The answer is no,? he said.",
    "They stole this election.",
    "Watch coverage here.",
    "No, I never did.",
    "We all know."
  ]
}