{
  "id": 6174,
  "mediaId": 136,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Ballot Chaos, Premature Kudos From Trump Mar Michigan GOP Endorsement Event",
  "image": "https://d.newsweek.com/en/full/2025088/trump-backed-candidates-win-during-marred-gop-convention.webp?w=790&f=9066688caa34f22e7737e5edf83daccb",
  "link": "https://www.newsweek.com/ballot-chaos-premature-kudos-trump-mar-michigan-gop-endorsement-event-1700384",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    712,
    1088,
    1147,
    1536,
    1819,
    1831,
    3103,
    308,
    428,
    2547,
    2791
  ],
  "sentences": [
    "During the second round of voting, races and candidates were meant to be shown on large screens in the convention hall at DeVos Place, but the order of the races on the screen did not match the order on the ballot, leading to some confusion, according to Michigan Live.",
    "The state's GOP ultimately backed Kristina Karamo for secretary of state and Matt DePerno for attorney generaltwo candidates who have denied the results of the 2020 presidential election and have earned the endorsement of Trump during the convention in Grand Rapids.",
    "Trump-backed candidates won the backing of the Michigan GOP Saturday night, but the party's endorsement convention was marred by ballot chaos and a premature congratulations from former President Donald Trump.",
    "Human error initially made it appear that Biden won the rural county, but the mistake was fixed before the election was certified, but DePerno pointed to fraud or hacking as possible culprits.",
    "Trump congratulated Karamo and DePerno, writing in a statement that he \"will back them strongly\" while claiming they will \"put an end\" to \"Election Fraud and corruption\" in the state.",
    "Karamo won 70 percent of the vote, while DePerno won about 55 percent of the vote in a tighter race against former state House Speaker Tom Leonard, according to the Michigan Advance.",
    "Vance in the Pennsylvania and Ohio Senate primaries, raising concern from some Trump-aligned Republicans that the candidates were insufficiently conservative.",
    "They are expected to face off against incumbent Democrats Secretary of State Jocelyn Benson and Attorney General Dana Nessel in the key battleground state.",
    "The secretary of state is the top election official in Michigan, and a Karamo victory could leave her with substantial power over the elections.",
    "The state's party endorsement could further bolster their campaigns, therefore representing Trump's continued grip on the Republican Party.",
    "Karamo has claimed she witnessed voter fraud and has called for a \"forensic audit\" of the election results, according to Bridge Michigan.",
    "Meanwhile, DePerno led a lawsuit attempting to challenge the results in Antrim County, a small northern Michigan county won by Trump.",
    "The victory for Trump comes after some of his high-profile endorsements have been met with criticism from some of his supporters.",
    "Both candidates have repeated claims that widespread voter fraud led to the 2020 presidential election being stolen from Trump.",
    "The party then consulted with legal counsel and the candidates, with everyone agreeing to fix the order of the screens.",
    "However, the statement was released hours before DePerno officially won, according to the Michigan Advance.",
    "The two races could have significant implications for the 2024 presidential election as well.",
    "The lawsuit, however, was rejected last week, according to The Detroit News.",
    "The two also won the endorsement of Michigan GOP Co-Chair Meshawn Maddock.",
    "In the past few weeks, he announced his support for Mehmet Oz and J.D.",
    "Newsweek reached out to the Michigan Republican Party for comment.",
    "Ultimately, the debacle set voting back about a half an hour.",
    "However, the GOP ran into a few issues during its convention."
  ]
}