{
  "id": 6177,
  "mediaId": 558,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Trump pushes Vance for Senate in Ohio, but supporters are more excited for cowboy governor candidate",
  "image": "https://s.yimg.com/uu/api/res/1.2/Jqe9s4jWAzkd73VbJDuS3g--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-04/895bfc20-c24d-11ec-baff-689092115226",
  "link": "https://nz.news.yahoo.com/trump-jd-vance-ohio-senate-rally-122515686.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom LoBianco",
  "authorUrl": "https://www.yahoo.com/author/tom-lobianco",
  "termIds": [
    3103
  ],
  "sentences": [
    "Jarrod Titus, a Whirlpool worker from Fletcher, Ohio, told Yahoo News he settled on Vance after the author received Trumps endorsement and he watched Hillbilly Elegy,? Vances 2016 memoir turned Netflix movie, but he sounded more excited about Republican candidate Blystone, an Ohio farmer and political newcomer.",
    "Ive seen a picture of him on a billboard, on my way home from work, and I was like, He looks like a badass from the Wild West,? Titus said Saturday afternoon at the Delaware County Fairgrounds while waiting for Trump to take the stage.",
    "She referred to Vances attacks and insults against Trump in 2016, when he called himself a Never Trump guy.?\nAt first I heard JD Vance was [a] Never-Trumper, and now I see Trump backing him, its so confusing,? Clark said.",
    "They just make you so confused.?\nVance, in his brief speech to the crowd before Trump took the stage, won some big applause when he talked about securing the border and recounted the attacks Trump endured in office.",
    "Vance in the upcoming Senate primary  but voters sounded more excited for Trump himself, as well as Joe Blystone, a gubernatorial candidate known for sporting a giant cowboy hat.",
    "Jennifer Geary, a polysomnographic technician from Delaware, said she was going to wait and see what Trump has to say? about Vance, but she was already sold on Blystone.",
    "I like that Blystone.?\nWhen asked who she liked in the Senate primary, Stella Clark, a longtime Kroger employee who also lives in Delaware, said she also liked Blystone.",
    "With the May 3 primary just a week and a half out, Vance is hoping that Trumps support can help lift him in a crowded primary to replace outgoing GOP Sen.",
    "DELAWARE, Ohio  Former President Donald Trump held his latest campaign rally Saturday night in Ohio to back venture capitalist J.D.",
    "Ohio news outlets have referred to Blystone, whose campaign logo is a cowboy hat, as the cowboy? candidate in the race.",
    "You know, youve got Ted Cruz backing Josh Mandel and now youve got Trump backing J.D.",
    "The crowd at Trumps rally wasnt fully sold on Vance, however.",
    "He obliquely to his past criticism of Trump.",
    "Rob Portman.",
    "Vance."
  ]
}