{
  "id": 6180,
  "mediaId": 21,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Trump said he took a cognitive test because he didn't 'like being called stupid'",
  "image": "https://i.insider.com/6264a3739f656600190660ee?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/trump-doesnt-like-being-called-stupid-ohio-rally-brain-test-2022-4",
  "sentiment": "0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Getahun",
  "authorUrl": "https://www.businessinsider.com/author/hannah-getahun",
  "termIds": [
    3103
  ],
  "sentences": [
    "He continued, referencing an apparent conversation with Republican Rep. Ronny Jackson: \"Is there a test or something I can take to prove to these radical left maniacs that are much smarter than them?\"",
    "Jackson, who represents Texas' 13th congressional district and served as White House physician under Trump and Former President Barack Obama, administered the test and said that Trump got 100% on it.",
    "Jackson, along with other Republicans, called on President Joe Biden in an open letter to take the same test, saying that he was not \"not physically or cognitively fit\" to lead the county.",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Trump said Thursday during a press conference in Florida that he would rather be called a dictator than a dumb person after boasting about the same test results.",
    "Former U.S. President Donald Trump speaks during a rally hosted by the former president at the Delaware County Fairgrounds on April 23, 2022 in Delaware, Ohio.",
    "Trump retorted by saying he \"bet\" that Wallace couldn't answer the last five questions and that \"Joe Biden could not answer those questions.\"",
    "Chris Wallace, who interviewed Trump in 2020, told the former president that he had also taken the exam, and it was \"not the hardest test.\"",
    "Drew Angerer/Getty Images\nFormer President Donald Trump said that he \"didn't like being called stupid\" during a rally in Ohio.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Trump asked Rep. Ronny Jackson if he could take a cognitive test, which Jackson later said he aced.",
    "Representatives for Trump and Jackson did not immediately respond to Insider's request for comment.",
    "Acyn (@Acyn) April 23, 2022\nThe test Trump referenced is called the Montreal Cognitive Assessment.",
    "During Saturday's rally in Ohio, Trump detailed once again that he aced a cognitive test in 2018.",
    "It is not an IQ test but rather a tool to spot early signs of dementia and other memory issues.",
    "Former President Trump apparently doesn't like his intelligence being called into question.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "The exam is not an IQ test, but rather an indicator of memory loss.",
    "Trump referenced the dictator comment during Saturday's rally.",
    "\"They say he's a dictator, he wants to take over the world.\"",
    "\"And you know, now, they don't call me stupid,\" Trump said.",
    "Last week, Trump announced his endorsement of J.D.",
    "\"I don't like being called stupid,\" Trump said.",
    "Vance in the Ohio Republican Senate primary.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}