{
  "id": 6181,
  "mediaId": 165,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Trump Rambles About Toilets Not Flushing During Ohio Rally  Oh, and Also: Hijacking Americas Election Systems",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/Donald-Trump-in-Ohio.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-news/donald-trump-rally-delaware-ohio-jd-vance-1342199/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Bort",
  "authorUrl": "https://www.rollingstone.com/author/ryan-bort/",
  "termIds": [
    1147,
    1801,
    2087,
    2482,
    3103,
    428,
    545,
    571,
    2643,
    2845,
    2945
  ],
  "sentences": [
    "Vance and the scores of other local and national candidates he has endorsed not because he thinks theyll go to bat for the people of Ohio or whichever state theyre vying to represent, but because he knows theyll go along with his push to cripple the democratic process and allow Republicans to overturn the results of elections they lose, which he and his administration, and sitting members of Congress, tried do to after his loss to President Biden in 2020.",
    "Trump: There was so little water that you couldnt wash your dishes pic.twitter.com/XKd6K3HaTF\n Acyn (@Acyn) April 23, 2022\nHe spoke at length about the aptitude test he aced? while he was in office, claiming he got tired of people calling him stupid so he went to Doc Ronny? (former White House doctor and current Texas Rep. Ronny Jackson) to ask if there was any way he could prove to America he wasnt a moron.",
    "He said some really bad shit about me,? Trump said, referencing Vances past criticism before calling him the partys best chance to beat the radical Democrat nominee.?\nIts a familiar routine for Trump, and on Saturday he seemed a little more bored than usual at whatever was scrolling across his teleprompter.",
    "He revived his years-long crusade against Americas water pressure, claiming people dont have enough water to run dishwashers, that water doesnt come out of the shower heads of new hotels, and that regarding the third element of bathrooms? people have to flush 10 times for anything to happen.",
    "I have great heritage,? Trump said, an uncle who was a great, great genius, a father who was a genius.? Jackson suggested an aptitude test, an X test,? but warned Trump that it could be embarrassing if he didnt pass it.",
    "His coif fluttering in a light breeze for the duration of his time onstage, the former president went on multiple extended, incredibly bizarre rants about topics that dont really have much to do with anything.",
    "He noted how he asks Melania how he looks on TV after rallies, particularly about the status of his hair, leading to one of several rants about how the TV cameras never show the size of his crowds.",
    "He talked about how state-level Republicans like Kari Lake in Arizona are trying to overturn the legitimate 2020 election results and working to do away with electronic voting in future elections.",
    "Its called an X test? pic.twitter.com/JGVklls9ci\n Acyn (@Acyn) April 23, 2022\nTrump at one point changed gears in the middle of making a point because he caught a glimpse of himself on a screen.",
    "This is the beginning of communism.?\n Acyn (@Acyn) April 23, 2022\nThe crowd laughed and cheered and applauded at all of Trumps nonsense on Saturday night, which is part of why hes so dangerous.",
    "He said Mark Zuckerberg shouldnt have been allowed to donate millions to strengthening election systems in areas where there arent enough resources to maintain them.",
    "Trump is talking about aptitude tests and crowd sizes, but hes also talking about the forceful takeover of the nations voting systems.",
    "Donald Trump has been holding rallies rallies to prop up his preferred 2022 congressional candidates for a while now.",
    "Trump says he was unfazed:\nGIMME THAT TEST, DOC RONNY!?\nTrump: I said.., I dont like being called stupid.",
    "Is there a test I can take to prove to these radical left maniacs that Im much smarter than them?",
    "Meanwhile, everyone is laughing about Trump saying he needs to flush the toilet a bunch of times.",
    "Theyre now in the midst of a very real effort to rig the system so they wont fail next time.",
    "He also claimed the cameras turn off whenever he starts talking about the 2020 election.",
    "He throws a few brief nods to the local Republican or Republicans hes supporting.",
    "He called for the end of all early voting, mail-in voting, and drop box voting.",
    "He touted a new documentary that falsely claims the 2020 election was stolen.",
    "Even now as I speak, two of the lights just went off,? he lied at one point.",
    "He rants about the 2020 election, claiming falsely that it was stolen.",
    "Trump says he fixed all of this, only for Biden to ruin everything.",
    "There isnt much that differentiates one from another.",
    "On Saturday night in Delaware, Ohio, it was J.D.",
    "He teases that hes going to run again in 2024.",
    "Vance, whom he recently endorsed for Senate.",
    "He bashes President Biden as incompetent.",
    "What a handsome president,? he said.",
    "Trump wants people to vote for J.D.",
    "He stirs up fear about immigrants.",
    "And he said Sir, there is a test.",
    "This is communism."
  ]
}