{
  "id": 6183,
  "mediaId": 233,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Donald Trump holds Ohio rally amid criticism of J.D. Vance endorsement for U.S. Senate",
  "image": "https://www.gannett-cdn.com/presto/2022/04/24/NCOD/ddd08d7f-2b2d-4d7c-be21-ab0c7228bb63-trump_rally_ac_27.jpg?crop=2999,1687,x0,y170&width=1320&height=744&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/04/23/trump-ohio-rally-jd-vance/7429246001/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    946,
    1115,
    1147,
    1801,
    2027,
    2466,
    3103,
    379,
    428,
    571,
    2845
  ],
  "sentences": [
    "Trump's decision was a blow to other candidates in the race who spent months clamoring for his support: former state treasurer Josh Mandel, investment banker Mike Gibbons and former Ohio Republican Party chair Jane Timken.",
    "Haley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "The MAGA Movement is strongly united behind my fathers endorsement of JD Vance, which you can see by the surge hes seen in the polls since the endorsement,\" Trump Jr. said in a statement Friday.",
    "The former president used the appearance to air grievances about his White House successor and criticized Democratic policies on the U.S.-Mexico border, inflation and law enforcement.",
    "Vance endorsement looms over rally\nTrump aimed to encourage supporters to rally behind Vance, even as some Ohio Republicans express frustration over the endorsement.",
    "Trump took the stage shortly before 7 p.m. at the Delaware County Fairgrounds, hours after people first arrived to hear him speak on an unseasonably warm April day.",
    "In his overture about Vance's candidacy  which came nearly an hour into the speech  Trump cast Vance as the best chance to keep the Senate seat in Republican hands.",
    "Multiple groups called on voters to protest at the fairgrounds, and 33 Trump delegates from 2016 penned a letter calling on the former president to reconsider.",
    "Vance, for his part, quickly acknowledged during his remarks that he was late to embrace Trump but heaped praise on him multiple times throughout the event.",
    "The former president's son, Donald Trump Jr., visited northeast Ohio this week to campaign with Vance, and the two will campaign together again on Monday.",
    "Former President Donald Trump visited Ohio on Saturday to rally supporters behind his chosen candidate for the states contentious U.S. Senate race.",
    "Vance and Trump Jr. had previously been spotted at fundraisers together, and Trump Jr. defended Vance's credentials before his father endorsed.",
    "Some attendees said they would support Vance based on Trump's endorsement, but others said they want to research the candidates themselves.",
    "Most recently, a former roommate of Vances published messages from that year in which Vance pondered whether Trump is \"Americas Hitler.\"",
    "\"Its unfortunate that career politician Josh Mandel is pushing his supporters, some of whom are on the dole, to boycott a Trump Rally.",
    "He also ticked through positions on technology companies, immigration and public health mandates in an effort to energize the crowd.",
    "Christy Bessey, of Lebanon, said she's been leaning toward Mandel and accused Vance of jumping on the Trump bandwagon.",
    "Only state Sen. Matt Dolan, who Trump empathically said he would not endorse, did not seek the former president's nod.",
    "The two said they would listen to both candidates speak at upcoming events and base their final decision on that.",
    "In fact, if I went by that standard, I dont think I would've ever endorsed anybody in the country,\" Trump said.",
    "\"I don't want anyone getting there on the coat tails of somebody else's name,\" Christy Bessey said.",
    "Very not MAGA of him!?\nUSA TODAY Network Ohio Bureau reporter Mary Jane Sanese contributed.",
    "No more politicians who wag their fingers at the corrupt Big Tech officials and the FBI.",
    "Vance's first appearance on stage Saturday was met with a mixture of boos and cheers.",
    "Vance's first appearance on stage Saturday was met with a mixture of boos and cheers.",
    "Peppered throughout his speech were references to author and venture capitalist J.D.",
    "Vance secured the nod despite his well-documented criticisms of Trump in 2016.",
    "Vance secured the nod despite his well-documented criticisms of Trump in 2016.",
    "Vance, who Trump is backing in the GOP primary to replace retiring Sen.",
    "\"When we get to the Senate, we're going to do something,\" Vance said.",
    "Trump acknowledged Vance's negative comments during his speech.",
    "It's time for consequences, and it's time for action.\"",
    "\"But you know what, every one of the others did also.",
    "Trump is backing JD Vance in the race to succeed Sen.",
    "None of Vance's opponents attended Saturday's rally.",
    "\"I studied this very closely,\" Trump told the crowd.",
    "But we have to pick the one thats going to win.",
    "\"I like a lot of the other people in the race.",
    "Her husband, Wals, is a Vance supporter.",
    "This guy is tough as hell.",
    "Rob Portman of Ohio.",
    "I liked them a lot.",
    "\"No more talking.",
    "No more slogans.",
    "Hes going win.\"",
    "Rob Portman.",
    "J.D."
  ]
}