{
  "id": 6184,
  "mediaId": 151,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Trump lays down marker for Vance in Ohio rally: 'This man is going to win'",
  "image": "https://www.politico.com/dims4/default/4537d75/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Ff3%2Fe7%2F4cda39a8406bbf2436ff47c8a9ce%2Ftrump-48434.jpg",
  "link": "https://www.politico.com/news/2022/04/23/trump-jd-vance-ohio-rally-00027356",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    946,
    1115,
    1147,
    1801,
    3103,
    146,
    428,
    571,
    2845
  ],
  "sentences": [
    "The thing that Trump revealed, more than any policy achievement, is that we are living in an incredibly corrupt country,? Vance added, before stating falsely that the 2020 election was stolen and declaring himself the American First candidate.?\nTrump for his part delivered a familiar red-meat diatribe against the presidential election he lost, undocumented immigrants, foreign heads of state, the media, critical race theory, Democrats and establishment Republicans  calling them, among other things, horrible human beings who are destroying our country.?\nTrump repeatedly called on the crowd to vote for Vance, slamming Republican groups who opposed the Ohioan.",
    "I felt pretty good about the race a week ago, but now I feel very good about it.?\nVance had previously rounded on Mandel following a conflagration during a primary debate on March 18 between Mandel and another candidate Mike Gibbons, where Mandel uttered an expletive at his rival.",
    "Ive studied this race closely and I think JD is the most likely to take out the weak, but dangerous, Democrat opponent  dangerous because they will have so much money to spend,? Trump said at the time of the endorsement, referring to the expected Democratic nominee, Rep. Tim Ryan.",
    "| Joe Maiorana/AP Photo\nBy Craig Howie\n 04/23/2022 08:42 PM EDT\nFormer President Donald Trump on Saturday evening dialed up the stakes in Ohios Senate Republican primary contest, holding a big rally with his endorsed candidate, Hillbilly Elegy? author J.D.",
    "In his own address ahead of Trumps speech, Vance referred to Trump as the big man,? adding that the former president embraced all the policies we loved? including on China, big-tech regulation and the building of the southern border wall.",
    "Vance, previously a venture capitalist, spent more than a year battling for Trumps endorsement alongside a handful of other candidates  including a March 2021 Apprentice?-style boardroom sit-down audition with the former reality TV star.",
    "In the latter state, Trump rescinded his earlier endorsement of Rep. Mo Brooks, after Brooks reneged on his previous full-throated backing of the former presidents spurious claims that the 2020 election was stolen from him.",
    "Ohio, do we love this guy?? Vance responded with an exuberant whoop, before repeatedly calling Trump the best president of my lifetime.?\nHes a guy who said some bad shit about me,? Trump said to laughs from the crowd.",
    "Trump reportedly sent Club for Growth president David McIntosh an obscenity-laced message when the group pledged to continue its support for former state Treasurer Josh Mandel following Trumps endorsement.",
    "Vance criticized Trump during the 2016 presidential campaign but has recently gained the former presidents grace and favor, following repeated public commitments to the America First? MAGA message.",
    "Reaction to Trumps endorsement of Vance was particularly acute among allies of Mandel, the races previous frontrunner, and Vance was reportedly the only candidate to attend the rally.",
    "It also represented a significant risk to the former presidents position as a Republican Party kingmaker ahead of his own potential White House run in 2024.",
    "And this man is going to win,? Trump said as he introduced Vance to the stage at the Delaware County Fairgrounds, just 10 days before the May 3 election.",
    "I would not have told you, you know, a week ago that we were in a position to win convincingly,? Vance said in an interview with POLITICO on Wednesday.",
    "However, Vance has surged to the head of the pack in the last week, with a pro-Vance super PAC receiving more than $5 million in new donations.",
    "Trumps son, Donald Trump Jr., has repeatedly visited the state to canvass for Vance, and Trump praised his efforts from the stage.",
    "He really is an American First warrior.?\nIt was the latest kinetic moment in the contentious race to replace retiring GOP Sen.",
    "Seeking to stave off a Trump endorsement of his rival, Mandel had argued the nod would have little effect on the race.",
    "Trumps endorsement of Vance sparked controversy within his movement, with some followers unhappy with the choice.",
    "Vance speaks at a rally at the Delaware County Fairgrounds on Saturday, April 23, 2022, in Delaware, Ohio.",
    "Mandel has also secured the backing of Trumps former national security adviser Mike Flynn, a MAGA icon.",
    "Vance later said Mandels actions were unbecoming of an Iraq combat veteran (Vance also served in Iraq).",
    "Fox News host Tucker Carlson has also urged Trump to back Vance, as did tech billionaire Peter Thiel.",
    "Trump has yet to endorse in Senate GOP primaries in Arizona, Missouri, New Hampshire and Alabama.",
    "Rob Portman, with the future of the Senate potentially hanging in the balance in November.",
    "Natalie Allison, Alex Isenstadt and Garrett Ross contributed to this report.",
    "I want to pick somebody whos going to win.",
    "Every one of the others did also.",
    "Republican Senate candidate J.D.",
    "Ultimately I put that aside.",
    "He did, but you know what?",
    " But they all came back.",
    " Hes tough.",
    "Hes smart.",
    "Vance."
  ]
}