{
  "id": 6185,
  "mediaId": 209,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "10 things you need to know today: April 24, 2022",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-desktop@1/v1650806140/GettyImages-1074332112.jpg",
  "link": "https://theweek.com/us/1012890/10-things-you-need-to-know-today-april-24-2022",
  "sentiment": "0",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grayson Quay",
  "authorUrl": "https://theweek.com/authors/grayson-quay",
  "termIds": [
    3103
  ],
  "sentences": [
    "Zelensky to meet with Secretaries Blinken and Austin in Kyiv, Orrin Hatch dies at 88, and more\nUkrainian President Volodymyr Zelensky will meet with U.S. Secretary of State Antony Blinken and U.S. Secretary of Defense Lloyd Austin in Kyiv on Sunday, marking the highest-level face-to-face meeting between Ukrainian and American officials since the war began.",
    "BuzzFeed NewsNPR\nFrench voters cast ballots on Sunday in a runoff election between centrist President Emmanuel Macron  who would be the first French president in 20 years to win a second term  and right-wing challenger Marine Le Pen, who trails Macron in the polls but could still score an upset victory.",
    "The WeekThe New York Times\nFirst-time candidate Kristina Karamo, a strong support of former President Donald Trump's baseless claims that widespread voter fraud cost him the 2020 election, won the endorsement of the Michigan Republican Party on Saturday.",
    "The Wall Street JournalThe New York Times\nAt least eight Ukrainian civilians were killed and 18 wounded in a Russian missile strike on the port city of Odessa on Saturday as Russian and Ukrainian Orthodox Christians celebrated their most sacred holiday.",
    "The Biden administration has reportedly faced pressure to send a high-level official to Ukraine after several European leaders  including United Kingdom Prime Minister Boris Johnson  traveled to Kyiv to meet with Zelensky.",
    "CNNThe Associated Press\nUtah Democrats declined to nominate a candidate for U.S. Senate at their nominating convention on Saturday in order to give independent Evan McMullin a better chance at defeating Sen. Mike Lee (R).",
    "In a recent presentation, Jim Kessler of the center-left think tank Third Way advised high-level Democrats not to consider any district \"safe\" unless President Biden won it by more than 12 percentage points in 2020.",
    "NBC4Rolling Stone\nAir Force Maj. Gen. William Cooley became the highest-ranking officer in Air Force history to be convicted of a crime when a military judge found him guilty of sexual misconduct on Saturday.",
    "During his seven terms, Hatch helped pass the Americans With Disabilities Act, co-wrote the Children's Health Insurance Program, and played a key role in passing former President Donald Trump's tax cuts.",
    "On Thursday, Russian President Vladimir Putin declared victory in Mariupol and ordered his defense minister to seal off the steel plant \"so that not even a fly comes through\" instead of storming it.",
    "Fox NewsAxios\nDemocratic insiders are feeling increasingly pessimistic about their party's chances of avoiding disaster in the November midterm elections, according to a report published Saturday.",
    "The WeekNPR\nFormer President Donald Trump appeared at a rally in Delaware County, Ohio, on Saturday night, where he urged voters to support Hillbilly Elegy author  and former Never-Trumper  J.D.",
    "Deseret NewsABC News\nRussian troops launched an attack on Mariupol's Azovstal steel plant on Saturday, aiming to eliminate the last pocket of Ukrainian resistance in the southern port city.",
    "It's like putting a bank robber in charge of a bank and giving them the keys to the vault,\" Benson said, casting the election as \"a choice between whether or not we'll have a democracy.\"",
    "Vance told the crowd it took him \"a little bit longer to come along to the president\" but credited Trump with helping him realize that \"we are living in an incredibly corrupt country.\"",
    "Around 67 percent of the approximately 2,000 delegates at the GOP nominating convention backed Karamo, who will challenge incumbent Democrat Jocelyn Benson in November.",
    "The leaders of Spain, Portugal, and Germany, fearful of Le Pen's Eurosceptic views, penned an op-ed earlier this week implicitly exhorting French voters to back Macron.",
    "Ahead of the meeting, Zelensky said at a news conference that he expects \"specific weapons\" from the visitors and that they \"should not come here with empty hands.\"",
    "After the vote, Weston said he wants Utah to have a \"healthy political marketplace, and that's not going to be possible if we don't have Democrats on the ballot.\"",
    "Ukrainian President Volodymyr Zelensky, who is Jewish, attended an Easter vigil service on Saturday night, where he urged Ukrainians not to be consumed by anger.",
    "Cooley was convicted of forcibly kissing a civilian Air Force employee and acquitted on two other charges stemming from alleged forcible touching incidents.",
    "McMullin, a center-right former CIA officer, ran for president in 2016 as a \"Never Trump\" candidate, receiving over 20 percent of the popular vote in Utah.",
    "Democrat Kael Weston sought the party's nomination but will not appear on the ballot after being out-voted by the pro-McMullin faction at the convention.",
    "The Washington PostThe New York Times\nFormer Sen. Orrin Hatch (R-Utah), who served in the U.S. Senate from 1977 to 2019, died Saturday at the age of 88.",
    "Odessa City Council Deputy Petro Obukhov referred to the missiles as \"Easter gifts from [Russian President Vladimir] Putin.\"",
    "Zelensky administration official Andriy Yermak said in a statement that among the dead was a three-month-old baby.",
    "Around 2,000 Ukrainian troops and 1,000 civilians reportedly remain holed up in the sprawling Azovstal facility.",
    "\"If you're a district that is Biden plus 12 or less, you need to run like you're losing,\" Kessler said.",
    "In fact, if I went by that standard, I don't think I would have ever endorsed anybody,\" Trump said.",
    "\"\"Hopefully, this will not be as difficult for the next survivor,\" the victim said in a statement.",
    "Cooley could face up to seven years in prison, as well as a loss of rank, benefits, or pay.",
    "The following year, Hatch retired from the Senate and was replaced by Sen. Mitt Romney (R).",
    "President Biden visited Eastern Europe last month but did not set foot in Ukraine.",
    "This renewed assault comes as a reversal of earlier Russian policy.",
    "He was the longest-serving Republican senator in U.S. history.",
    "Trump awarded Hatch the Presidential Medal of Freedom in 2018.",
    "\"It's like putting arsonists in charge of a fire department.",
    "Vance in the state's competitive Republican Senate primary.",
    "\"All of us believe our sunrise will come soon,\" he said.",
    "\"Are you calling to ask me about our impending doom?\"",
    "Polls opened at 8:00 a.m. and will close at 8:00 p.m.",
    "His sentencing hearing is set to begin Monday.",
    "\"He's a guy that said some bad s--t about me.",
    "one Democratic strategist asked a reporter.",
    "He also briefly ran for president in 2000.",
    "\"Evil will be punished,\" Yermak added.",
    "Every one of the others did also.",
    "The New York TimesReuters",
    "But you know what?"
  ]
}