{
  "id": 6194,
  "mediaId": 136,
  "date": "4/23/2022 12:00:00 AM",
  "headline": "Trump Ohio Rally to Inflame MAGA-World Civil War Over J.D. Vance Senate Bid",
  "image": "https://d.newsweek.com/en/full/2025016/donald-trump.webp?w=790&f=5435a8ecda943f9b960747d65a8d9b9b",
  "link": "https://www.newsweek.com/trump-ohio-rally-inflame-maga-world-civil-war-over-jd-vance-senate-bid-1700319",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    3103
  ],
  "sentences": [
    "Many conservatives in Ohio are supporting former state Treasurer Josh Mandel in the GOP primary, as well as several other contenders, in what's becoming a civil war among the Midwestern state's Republicans and the broader Make America Great Again (MAGA) movement.",
    "Doors open at 2 p.m\nMeanwhile, on the national stage, audio leaked this week of House Minority Leader Kevin McCarthy saying he would advise Trump to resign days after the U.S. Capitol attack carried out by the then-president's supporters on January 6, 2021.",
    "McCarthy told reporters on Friday evening that he made the comment on the leaked call as he \"just walked through different scenarios,\" according to a video shared to Twitter by CBS News reporter Musadiq Bidar.",
    "Tom Zawistowski, CEO and founder of the conservative group Committee for a Better Ohio, told the Associated Press that Trump's Vance endorsement appeared disconnected with voters in the Midwestern state.",
    "\"While we are aware of the blowback you are receiving from your supporters for your endorsement of Vanceplease understand we are not your typical Republicans in Ohio,\" the letter said, Fox News reported.",
    "Trump's \"got people around him that are advising him and I think they advised him poorly,\" Flynn, who briefly served as the former president's national security adviser, told the Dayton Daily News.",
    "Even Trump loyalist retired General Michael Flynn, who has endorsed Mandel, called the former president's decision to back Vance \"a huge mistake\" in comments to the Dayton Daily News on Thursday.",
    "The New York Times on Thursday reported that McCarthy told other GOP lawmakers after the pro-Trump Capitol riot that he planned to encourage Trump to step down days before the end of his term.",
    "The retired general received a pardon from Trump in November 2020 after he pleaded guilty to lying to the FBI about his contacts with Russia prior to officially starting his White House role.",
    "In 2016, when Trump ran for president, Vance was a \"never Trump\" conservative, even reportedly sending a private Facebook message to a friend warning that Trump could be \"America's Hitler.\"",
    "But even half of Trump's Ohio Republican delegates from the 2016 presidential election released a letter earlier this month calling the former president's endorsement of Vance a \"betrayal.\"",
    "Former President Donald Trump heads to Ohio for a rally on Saturday as he faces backlash and protests from some Republicans there over his endorsement of GOP Senate primary contender J.D.",
    "\"We would respectfully request you reconsider your endorsement of JD Vance to show your supporters in Ohio and across our great states why we first believed in you back in 2016.\"",
    "Regardless of the controversies, local news station WBNS 10 reported Friday that Trump supporters had traveled from across the country to attend the rally in Ohio.",
    "Vance's campaign has pushed back against the criticism from Trump supporters, sharing a statement from the ex-president's son with Newsweek on Friday.",
    "He later called the then-GOP presidential candidate \"noxious,\" \"reprehensible\" and an \"idiot\" in October of that election year, according to Vice.",
    "The top House Republican said that he \"never thought that he [Trump] should resign,\" insisting that he didn't tell the former president to do so.",
    "\"We are the original and proud 'Trumpers' who served as your delegates in Ohio when everybody was against you or supporting other candidates.\"",
    "Vance really seemed like President Trump was out of touch with what's going on in Ohio and what his supporters here want,\" Zawistowski said.",
    "The AP also reported that Ohio's right-wing tea party movement, which generally supports Trump, plans to stage a protest outside the rally.",
    "\"I'm seriously thinking of having that conversation with him tonight,\" the GOP House leader said in the brief clip from January 10, 2021.",
    "Many conservatives in Ohio take issue with Vance's previous criticism of Trump, despite the former president forgiving his past remarks.",
    "\"It's unfortunate that career politician Josh Mandel is pushing his supporters, some of whom are on the dole, to boycott a Trump Rally.",
    "Trump endorsed Vance on April 15, drawing quick criticism and pushback from Republicans who believed the decision could backfire.",
    "Trump has appeared undeterred by the blowback, plowing ahead with plans to campaign alongside Vance in Ohio this weekend.",
    "The conservative group Ohio Value Voters urged supporters to \"boycott\" Trump's Saturday rally in an email this past week.",
    "However, on Thursday evening, the Times published audio of him telling lawmakers what the newspaper had reported he said.",
    "The Washington Post and Fox News reported that McCarthy and Trump spoke after the audio leaked and remain on good terms.",
    "The event starts at 7 p.m. Eastern Time and will be live-streamed on YouTube by the Right Side Broadcasting Network.",
    "Vance, which you can see by the surge he's seen in the polls since the endorsement,\" Donald Trump Jr. said.",
    "\"It is time for the entire MAGA movement, the greatest in the history of our Country, to unite behind J.D.",
    "\"Ohio Value Voters urges Ohioans to boycott the Trump Rally in Delaware County this Saturday, April 23rd.",
    "'s campaign because, unlike so many other pretenders and wannabes, he will put America First.",
    "\"You trusted us in 2016 to do what was best for Ohio,\" the former Trump delegates continued.",
    "McCarthy later released a statement saying the reporting was \"totally false and wrong.\"",
    "The former president has publicly acknowledged that Vance criticized him in the past.",
    "He added that he would tell Trump \"it would be my recommendation you should resign.\"",
    "\"The MAGA Movement is strongly united behind my father's endorsement of J.D.",
    "The former president regularly draws thousands of attendees to his events.",
    "Newsweek reached out to spokespeople for Trump and McCarthy for comment.",
    "The Saturday rally will take place at the Delaware County Fairgrounds.",
    "However, it you decide to attend, when President Trump introduces J.D.",
    "However, he said that Vance \"gets it now\" in an April 15 statement.",
    "Vance has my Complete and Total Endorsement,\" Trump said.",
    "Vance, make your voices heard by letting Trump know, J.D.",
    "They urged him to \"reconsider\" the decision.",
    "Vance is Wrong for Ohio,\" the group stated.",
    "\"Booing is entirely appropriate!\"",
    "\"For him to endorse J.D.",
    "Very not MAGA of him!\"",
    "In other words, J.D.",
    "he added.",
    "Vance."
  ]
}