{
  "id": 6207,
  "mediaId": 19,
  "date": "d2022-04-23T00:00",
  "headline": "Exclusive  Trump Senior Adviser Lynne Patton: Trump Is Endorsing Candidates Who Can Beat Democrats in the General Election",
  "image": "https://media.breitbart.com/media/2022/03/GettyImages-1230427985-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/23/exclusive-trump-senior-adviser-lynne-patton-trump-is-endorsing-candidates-who-can-beat-democrats/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    1147,
    1609,
    1801,
    2087,
    3103,
    4293,
    146,
    428,
    571,
    2845
  ],
  "sentences": [
    "Americans were spending more and saving more, from five percent to eight percent, Patton continued, explaining that Ohio, specifically, benefited because Trump rolled back Obamas job killing regulations,? including the Waters of the U.S. rule, which she said literally crippled farmers across this country.?\nAmerica had the best economic optimism in decades as Trump continued to put America first, pulling the U.S. out of bad trade deals such as the Trans-Pacific Partnership (TPP), which Patton described as a huge deal.? Americans, she said, saw the benefits immediately as Trump continued to negotiate other deals, including pulling the U.S. out of the Paris Climate Accord.",
    "His tax incentives encouraged factories to stay in the U.S. instead of moving overseas, and more Americans were working under Trump, Patton explained, noting that when you earn more, you spend more.? Disposable income, she continued, grew by nearly? ten percent, and consumer confidence reached a record high.",
    "Americans are dealing with surging immigration, a supply chain crisis, rising crime, rampant inflation  all of which have single handedly lifted our party to the highest midterm election vote in the last 40 years,? Patton said, also noting the diversity of the GOP candidates running across the country.",
    "Joes Kung Fu Grip and remains unmatched as evidenced by the fact that Trump has raised more money than the RNC and DNC combined this quarter,? she continued, explaining that 98 percent of the donations have been less than $200, which confirms that Trumps grassroots support is growing.",
    "LISTEN:\nDemocrats dont have an agenda that delivers results, and they know it,? she said as she and host Matthew Boyle discussed the lefts latest attempts to drive a wedge between Trump and GOP party leaders, such as House Minority Leader Kevin McCarthy (R-CA).",
    "Yet, America became energy independent for the first time in decades, and the U.S. led the world in lowest carbon emissions without being part of the bad deal, she said, explaining that Trump showed that imbalanced deals never put America first.",
    "And hes taken the lead in this race for Senate for the first time since tossing his name in the ring,? she said, explaining that Vances positions are aligned with Trumps  from closing the border to tariffs on China.",
    "Its not that complicated, but evidently, in a world of politics and Democrats, they continually put other countries ahead of us,? she said, ultimately encouraging Ohio Republicans to get out and vote.",
    "Americans were safer, healthier, and richer under Trump, she continued, noting that Americans are now paying hundreds more per month on living expenses because of President Bidens leadership.",
    "Primaries are critical, but the general is even more important and Trump is endorsing people who can beat the Democrat candidate in Ohio, and nothing is more important,? Patton said.",
    "And as I stated last week, Trumps endorsement is the most sought-after prize in politics.?\nTrumps undeniable hold on the Republican Party and MAGA base is tighter than G.I.",
    "Vance, who can beat Democrats in the general election, Trump senior adviser Lynne Patton told Breitbart News Saturday ahead of Saturday nights rally in Delaware County.",
    "Trumps endorsement of Vance in Ohio is of particular interest, as Trump flipped the state by breaking through to working class communities.",
    "Vance, Patton continued, reaped the benefits immediately after Trumps endorsement, as nearly $5 million in new donations poured in.",
    "Former President Donald Trump is endorsing people, such as Republican Senate candidate for Ohio J.D.",
    "Vance, whom he endorsed this month, noting that Vance champions America First policies.",
    "And at the end of the day, thats what matters and the polls reflect it,? she said.",
    "Patton predicted that it is going to be an electric? event.",
    "Trump is holding a rally in Ohio Saturday with J.D.",
    "It boils down to common sense, Matt.",
    "Trump put America first."
  ]
}