{
  "id": 6213,
  "mediaId": 209,
  "date": "4/23/2022 12:00:00 AM",
  "headline": "Morality just isn't Republicans' thing anymore",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-desktop@1/v1650483955/gop%20sewer.jpg",
  "link": "https://theweek.com/politics/1012732/morality-just-isnt-republicans-thing-anymore",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Larkin",
  "authorUrl": "https://theweek.com/authors/steve-larkin",
  "termIds": [
    1147,
    1577,
    2303,
    2365,
    3103,
    3887,
    4230,
    4300,
    428,
    2799
  ],
  "sentences": [
    "Eric Greitens, who was forced to resign that post after accusations that he tried to use nude photos to blackmail a woman with whom he had an affair, has not let that stop him from running for the Senate; Rep. Madison Cawthorn has been accused of sexual harassment and other misconduct by women who were his classmates in college.",
    " Trump\nThe NBA belongs to the world now\nThe disappointing uselessness of expertise\nBaseball's owners are dooming the sport\nLeaked audio: McCarthy says Trump accepted 'some responsibility' for Jan. 6\nKevin McCarthy's anti-scandal\nTaking on Disney is just a first step for the new right\nWhat's wrong with the new right?",
    "And the disruption extends beyond mere absence; Schmitz also claims that people he knew in Nebraska, even those themselves from stable families, \"were more likely than [his] acquaintances in New York to know someone who had a child out of wedlock or is subject to a restraining order.\"",
    "These include the importance of religious belief and observance, the importance of strong and intact families, a notion that the leaders of any organization should be beyond reproach, a dislike for vulgarity, both profane and sexual, opposition to drug use, and things like that.",
    "Trump's presidency would seem to have vindicated the Southern Baptist Convention's claim that \"tolerance of serious wrong by leaders sears the conscience of the culture, spawns unrestrained immorality and lawlessness in the society, and surely results in God's judgment.\"",
    "Matthew Schmitz, now an editor at Compact, hit upon this a few years ago when trying to explain why elite conservatives he knew in New York City talked about Trump before the 2016 election very differently from people in Schmitz's hometown in Nebraska.",
    "Jerry Falwell Jr. was hardly unique in his combination of strongly professed evangelicalism while having little use for church, even if the specifics of the scandal that forced him to resign as president of Liberty probably aren't particularly common.",
    "But for the record, the man is a serial adulterer who brags about committing sexual assault with impunity, responsible for three cameo appearances in Playboy videos, dishonest in his business dealings, and needlessly callow and cruel.",
    "When I talk about morality here, I do not primarily have in mind the hot-button culture war issues of sex and gender that dominate the current discourse, but a broader set of what could be called socially conservative values.",
    "At first the charge of pedophilia was limited to the more fetid swamps of QAnon, but recent, more mainstream, GOP talking points are all about \"groomers\"  predators who make nice to their young victims before striking.",
    "He is a good father while many of us aren't... His wife tells us that we shouldn't feed our children certain foods, and we hate her for it  not because we think she's wrong but because we know she's right.\"",
    "And Trump seems to have set a kind of example for other stars of the MAGAverse: Rep. Matt Gaetz is under investigation for paying for sex with an underage girl and sex trafficking; former Missouri Gov.",
    "Why do Republicans thrill to Trump and tolerate misbehavior which previous generations  maybe even the very same people, a few decades ago  would have viewed as immediately disqualifying?",
    "Vance, now a ferocious Trumpist (past comments aside), identified this same phenomenon while writing Hillbilly Elegy: \"Barack Obama strikes at the heart of our deepest insecurities.",
    "Sure, they could try self-improvement, holding each other to account, and refusing to support candidates and media personalities who fail to meet those standards  but that's hard.",
    "To make themselves feel better, Republicans have gone far beyond the traditional accusations of loose living and government sponging to calling Democrats pedophiles as well.",
    "The party of \"traditional values\" seems to have lost track of what they are, and has decided to go about as low as you possibly can to retake the moral high ground.",
    "How can Republicans maintain their self-image as the moral majority while completely neglecting the standards that have traditionally defined moral behavior?",
    "A party which once claimed to be opposed to the coarsening of the public sphere is now infatuated with the illicit thrill of chanting \"Let's go Brandon.\"",
    "And, as long as they believe it makes the Democrats look like the bad guys, it will preserve the GOP's self-delusion of its own righteousness just fine.",
    "This is a party that sees itself as a moral majority, to steal the original Jerry Falwell's phrase, and will force all the facts to fit that narrative.",
    "Bill Murray movie suspends production after he's accused of 'inappropriate behavior'\nColin Kaepernick won't make it as a backup in the NFL\nMitch lied.",
    "Consider that Brandi Love, a \"MAGA porn star,\" was invited to an event by Turning Point USA before backlash forced them to retract the invitation.",
    "Those in New York \"stressed his infidelity while also objecting to his insults of women,\" while those in Nebraska \"glossed over his infidelities.\"",
    "In other words, Obama is simply \"better\" at family values than a large portion of the GOP base, and they hate the cognitive dissonance it causes.",
    "Democrats, of course, have their own fair share of scandals, criminals, and cads, and they see themselves as being on the moral side, too.",
    "The right-wing media apparatus responsible for disseminating pedophilia accusations is not staffed by a bunch of Humbert Humberts.",
    "And then, since they've set the bar so low, they can easily clear it and be the more moral side simply by not being pedophiles.",
    "(A long time ago, Ronald Reagan being divorced and remarried was a serious problem for a small but noticeable group of voters.)",
    "Evangelicals are attending church less often, even as evangelicalism becomes more and more the Republican Party at prayer.",
    "Former House Speaker Dennis Hastert and U.S. Rep. Mark Foley's pedophilia scandals are not representative of Republicans.",
    "Maybe it's because, while Trump is an extreme (and rich) example, in many ways he's not so different from his devotees.",
    "There is no understanding the Republican Party without understanding its leader and id, former President Donald Trump.",
    "I can't say that \"just don't be a pedophile\" is one of the more compelling accounts of human flourishing I've seen.",
    "The answer to this question is readily apparent when you look at Republican leadership and the base itself.",
    "But the failure even to try to live up to previous standards of morality extends beyond just those issues.",
    "I want to be clear that I am not suggesting the accusations of pedophilia are the result of projection.",
    "But it's the only one Republicans can agree on, and it's the only standard they wish to be judged by.",
    "What's happening here is another attempt to cope with the cognitive dissonance Vance diagnosed.",
    "There are other examples of the GOP base falling apart on issues of marriage, sex, and family.",
    "Now, tolerating this sort of behavior in a leader is par for the Republican Party course.",
    "Of course, that was about former President Bill Clinton and the Monica Lewinsky scandal.",
    "\"Unstable relationships are the norm, and fathers quickly end up out of the picture.\"",
    "And, finally, he claims that he has never asked God for forgiveness for any of this.",
    "Instead, they've chosen something much easier: calling their opponents pedophiles.",
    "Republicans have completely failed to uphold the standards they once championed.",
    "Because those Nebraskans live the same way Trump does, Schmitz argues.",
    "But they're not running around championing those \"traditional values.\"",
    "It strikes me now, as I write this list, how old-fashioned it seems.",
    "His sins and crimes have been enumerated many times.",
    "But why this particular attack, and why now?",
    "The impeachment died.",
    "The once  and future?",
    "Things have changed.",
    "And J.D.",
    "Why?"
  ]
}