{
  "id": 6215,
  "mediaId": 43,
  "date": "d2022-04-23T00:00",
  "headline": "Caravan with a dumb solo: previous guy (even) more deranged in OH rally",
  "image": "https://images.dailykos.com/images/1062258/story_image/FREPAzeXwAUgO9Y1?1650757184",
  "link": "https://www.dailykos.com/story/2022/4/23/2093662/-Caravan-with-a-dumb-solo-previous-guy-even-more-deranged-in-OH-rally",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    2087,
    2429,
    3103,
    4455,
    4526,
    3456,
    2845,
    5063,
    5084
  ],
  "sentences": [
    "Imagine what we couldve accomplished At the very least we wouldnt have Obamacare anymore? pic.twitter.com/XBqDBj1Jpo\n Acyn (@Acyn) April 23, 2022\nx\nWeve reached the I know Putin very well? part of the speech pic.twitter.com/IMU6SsMNHc\n Acyn (@Acyn) April 24, 2022\nx\nBiggest response from Trump crowd of the night is when he says teachers wont be able to teach transgenderisnt it amazing how this became a big subject??\nCrowd, on feet, now chanting: Save our kids.?\n Vaughn Hillyard (@VaughnHillyard) April 24, 2022\nx\nJD Vance endorses Trump for president in 2024: https://t.co/mMYvQXV1jd\n Josh Kraushaar (@HotlineJosh) April 23, 2022\nWhile Trump's rallies have generally been packed --although in decreasing numbers --with fans of the twice-impeached president who has been touting candidates and playing the hits of days gone past, this Saturday night rally could see a degree of chaos as Trump pushes the candidacy of \"Hillbilly Elegy\" author J.D.",
    "https://t.co/8W2o7kLx4C\n Daniel Goldman (@danielsgoldman) April 23, 2022\nx\nTrump: Caravan, I think I came up with that name pic.twitter.com/bAfcFvbxoJ\n Acyn (@Acyn) April 23, 2022\nx\nTrump: You know the Easter Bunny was a political operative pic.twitter.com/g3uFzTupEm\n Acyn (@Acyn) April 23, 2022\nx\nTrump: There was so little water that you couldnt wash your dishes pic.twitter.com/XKd6K3HaTF\n Acyn (@Acyn) April 23, 2022\nx\nHow to water pic.twitter.com/1wCzqAlvMq\n Sarah Cooper (@sarahcpr) June 13, 2020\nx\nTrump talking about his consideration as POTUS to send the military? into Democrat-run cities.?\nBut then I decided let the Democrats run in the citiesknew that they would yell, Hes a dictator!?\nWe were going to send them into Seattle.?\n Vaughn Hillyard (@VaughnHillyard) April 23, 2022\nx\nLie https://t.co/05seWeha4B\n Peter Strzok (@petestrzok) April 23, 2022\nx\nTrump: We want one day elections.",
    "https://t.co/M6qizj87pI\n Mia gg g #vaxxed #stillmasked (@mia_nj) April 23, 2022\nSaturday, Apr 23, 2022  6:05:07 PM Pacific Daylight Time  annieli\nx\nIn conversation, I have no doubt they would argue that Biden, Obama, the Clintons and other Democrats are just as bad, or at least also bad people.",
    "As the Politico Playbook reports, \"Theres been intense blowback to Trumps endorsement of Vance, who previously criticized the president and is viewed by some as a 'Never Trumper' whos now pandering to the ex-president.",
    "MOCA (Montreal Cognitive Assessment) doesnt assess or measure intelligence, it detects dementia/cognitive impairment\nTrump is going for an insanity defense if hes indicted: I named five things.",
    "And he needs to acknowledge that.?\nKevin McCarthy audio 1/11/21  #McCarthyTapespic.twitter.com/k94GcNjJLF https://t.co/uPM6I2xXZa\n Adam Rifkin g?g (@ifindkarma) April 23, 2022\nx\nOMFG.",
    "#TrumpRally pic.twitter.com/ZyXNaQYGiH\n PatriotTakes gg (@patriottakes) April 23, 2022\nx\nImagine if we had more of these people in Congress in 2017.",
    "www.rawstory.com/...\nx\nA republican member of Congress does \"not recall\" if she urged donald trump to impose a violent dictatorship (she did).",
    "https://t.co/rueoCjSLwA\n Bill Pascrell, Jr. gggg (@BillPascrell) April 22, 2022\nx\n[Trump] bears responsibility for his words and actions.",
    "As the Columbus Dispatch notes, 'thirty-three 2016 Trump delegates penned a letter calling on the former president to reconsider'.\"",
    "A light, a group of people, Ohio, a fake teleprompter, and the fake news.?\nx\nIs an X test the MAGA version of the IQ test?",
    "We want paper ballots and no mail in fake ballots.?\nThis proposal would disenfranchise millions of people.",
    "Vance who the former president has endorsed for the U.S. Senate -- and not to universal acclaim.",
    "I asked him personally today He told me he does have some responsibility for what happened.",
    "Among major political figures, Trump is uniquely appalling.",
    "I dont even know how these people dress themselves.",
    "We've never had such a vile bastard in office.",
    " Hussein Ibish (@Ibishblog) April 24, 2022",
    "Id love to see Trump take an IQ test.",
    "She should be expelled from office.",
    "But it's really not true.",
    "No ifs, ands, or buts."
  ]
}