{
  "id": 6216,
  "mediaId": 157,
  "date": "d2022-04-23T00:00",
  "headline": "'Booing is entirely appropriate!': Ohio conservative group urging disruption at Trump rally",
  "image": "https://www.rawstory.com/media-library/trump.jpg?id=27664725&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/donald-trump-2657202944/",
  "sentiment": "-0.874",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    946,
    1147,
    1801,
    3103,
    403,
    2643,
    2845,
    4965
  ],
  "sentences": [
    "The memo notes that the group is furious that Vance had criticized Trump in the past -- which the former president appears to have forgiven based on his endorsement -- and that Ohio Value Voters President John Stover cited the Bible when criticizing the author and hedge funder by reminding followers that James 1:8 instructs: A double minded man is unstable in all his ways.?\nThe memo adds that the group is endorsing former state treasurer Josh Mandel -- who has had a substantial lead over Vance prior to the endorsement -- instead.",
    "Vance is a betrayal to not only your Ohio supporters but Trump supporters across our great nation!? Politico adds that a group organized in 2007 and calling itself Ohio Value Voters is urging a boycott of the event or, for those who wish to attend, to make their displeasure known to Vance, who will be attending, and the former president.",
    "While Trump's rallies have generally been packed --although in decreasing numbers --with fans of the twice-impeached president who has been touting candidates and playing the hits of days gone past, this Saturday night rally could see a degree of chaos as Trump pushes the candidacy of \"Hillbilly Elegy\" author J.D.",
    "According to a report from Politico, Donald Trump's fairground rally in tiny Delaware, Ohio may not go off as smoothly as some of his other recent forays into small towns where he is the only game in town on a Saturday night.",
    "As the Politico Playbook reports, \"Theres been intense blowback to Trumps endorsement of Vance, who previously criticized the president and is viewed by some as a 'Never Trumper' whos now pandering to the ex-president.",
    "However, if you decide to attend, when President Trump introduces JD Vance, make your voices heard by letting Trump know, JD Vance is Wrong for Ohio.",
    "According to their website, \"Ohio Value Voters urges Ohioans to boycott the Trump Rally in Delaware County this Saturday, April 23rd.",
    "As the Columbus Dispatch notes, 'thirty-three 2016 Trump delegates penned a letter calling on the former president to reconsider'.\"",
    "Continuing in that vein, they added, \"On April 15, 2022, President Trump made a terrible decision and endorsed JD Vance for Senate.",
    "Vance who the former president has endorsed for the U.S. Senate -- and not to universal acclaim.",
    "This can only be attributed to very poor advice from people around the former President.\"",
    "With the letter stating, \"This endorsement of J.D.",
    "Booing is entirely appropriate! \""
  ]
}