{
  "id": 6228,
  "mediaId": 98,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "What the GOPs muted response on the McCarthy tapes means for the Republican Party",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/0847c84/2147483647/strip/true/crop/7053x4702+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F10%2F1c%2F9dce8b1d493fb56841295f5a0e69%2Fgettyimages-1239297807.jpg",
  "link": "https://www.latimes.com/politics/story/2022-04-22/what-the-gops-muted-response-on-the-mccarthy-tapes-means-for-the-republican-party",
  "sentiment": "0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nolan D. McCaskill",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "Neither he nor anyone on his team recorded or leaked private conversations among members.?\nThe rare House Republican to address the controversy was Rep. Ashley Hinson (R-Iowa), who predicted a red wave? this fall and insisted the House Republican Conference is united to get America back on track.?\nRepublicans are going to take back the majority in November and when we do, Kevin McCarthy will be our Speaker,? Hinson tweeted.",
    "And too cowardly to tell the truth.?\nAnd Rep. Jimmy Gomez (D-Los Angeles) lamented in a statement that McCarthy is so desperate to become Speaker that he chooses Trump over democracy, time and time again.?\nThe silence of House Republicans indicated most were waiting to take their cues from Trump, who has yet to release a statement or address the reporting publicly as of Friday afternoon.",
    "In another clip, released Friday morning on CNN, McCarthy had relayed to House Republicans that Trump admitted that he bore some responsibility for what happened.? The clips and reporting that coincided with their release emanate from the forthcoming book This Will Not Pass: Trump, Biden and the Battle for Americas Future,? by New York Times reporters Alexander Burns and Jonathan Martin.",
    "Millions of Americans are suffering right now under President Biden and Speaker [Nancy] Pelosis big-government socialist agenda that has given us record high inflation, with skyrocketing gas prices and a border crisis, yet the only thing the Democrat media continues to obsess over is January 6th,? a spokesperson for Minority Whip Steve Scalise (R-La.)",
    "WASHINGTON \nNewly revealed recordings of House Minority Leader Kevin McCarthy saying he would urge then-President Trump to resign from office in the initial aftermath of the Jan. 6 insurrection sparked much political heat but so far appears not to threaten the California Republicans hold on power nor his relationship with former president.",
    "He will say or do whatever he thinks is necessary at a particular moment to obtain or maintain power.?\nIn a series of tweets Thursday, retiring Rep. Adam Kinzinger (R-Ill.) said McCarthy ought to be ashamed? for lying and told fellow Republicans that your leaders think you are dumb.?\nHow can you honestly feel ok with the lies?",
    "And the people who know better are afraid to act correctly because they know theyll be primaried.?\nRep. Eric Swalwell (D-Dublin) suggested McCarthy should lose access to classified materials for lying and argued that hes a highly relevant? witness for the Jan. 6 committee.",
    "Id be surprised if Trump himself didnt just delight in this as an example of how strong his grip on the party is,? said Sarah Longwell, a GOP strategist and founder of the anti-Trump Republican Accountability Project, launched in the wake of the Jan. 6 attack.",
    "The call followed the New York Times release Thursday of an audio clip from days after the attack on the Capitol on Jan. 6, 2021, when McCarthy told House GOP leaders he would talk to Trump and recommend he resign before House Democrats impeached him.",
    "McCarthy originally panned the reporting as totally false and wrong,? and a spokesman told the New York Times that McCarthy never said hed call Trump to say he should resign.? The audio, however, confirmed the accuracy of the reporting.",
    "If Republican reaction to the recording remains muted, McCarthy looks to have good odds of maintaining a firm grip on winning the speakers gavel should the party retake control of the House after the November election, observers said.",
    "Thats a big question.?\nLongwell, the GOP strategist, said that pro-Trump acolytes such as Reps. Matt Gaetz of Florida and Marjorie Taylor Greene of Georgia might use the tapes to argue that McCarthy is insufficiently loyal.",
    "I met a lot of duplicitous people in Congress but none more conniving and fundamentally dishonest than Kevin McCarthy,? former Michigan Rep. Justin Amash, a Republican-turned-independent-turned-Libertarian, tweeted.",
    "Former Trump campaign advisor Boris Epshteyn said on an episode of Trump ally Stephen K. Bannons War Room? podcast Friday that McCarthys leaked comments are extremely hurtful? to his hopes of becoming speaker.",
    "The Los Angeles Times contacted nearly 20 GOP members offices Friday, including those of McCarthy and other Republican leaders, members of the conservative House Freedom Caucus and members who are retiring.",
    "Trump and McCarthy (R-Bakersfield) spoke Thursday night, according to a person familiar with the call, who said the ex-president wasnt mad about McCarthys comments.",
    "Democrats were much more eager to address an issue that could ultimately determine whether McCarthy would wield the speakers gavel in a Republican majority.",
    "But his private comments will probably come up in a conference meeting next week after members return from a recess and could inspire new challengers.",
    "Rep. Adam B. Schiff (D-Burbank) framed McCarthy as a man too weak to adhere to any principle? and too hungry for power to say or do whats right.",
    "Congressional Republicans nowadays are not like what I served with for so many years,? added Biden, who spent 36 years in the Senate.",
    "Vance, a former Trump critic who went on to win the former presidents endorsement this month in the crowded Ohio Senate GOP primary.",
    "Epshteyn said it was incumbent upon McCarthy to mend fences and prove himself to the former president and his supporters.",
    "Honestly Kevin, is it worth it??\nQuestion for Kevin McCarthy, @GOPLeader how can you honestly feel ok with the lies?",
    "A big test will come Saturday when McCarthy is due to speak at the California Republican Convention in Anaheim.",
    "Party insiders probably knew the GOP leader had briefly taken a more aggressive stance toward Trump, she said.",
    "Their lack of action allowed anti-Trump Republicans and former members of the party to fill the void.",
    "Whip Scalises sole focus is on working with his colleagues to stop the radical Democrat agenda.",
    "Yes, other people lie too, but you have claimed to fight for a higher purpose,? he tweeted.",
    "Yes, other people lie too, but you have claimed to fight for a higher purpose.",
    "pic.twitter.com/0x6lSgY11i\n Adam Kinzinger (@AdamKinzinger) April 22, 2022",
    "Only two offices responded, though one declined to do so on the record.",
    "These next several months are a test for Kevin McCarthy, Epshteyn said.",
    "You went from one day asking Trump to resign, a day later gg.",
    "President Biden referenced the audio in a speech Friday.",
    "He pointed to Hillbilly Elegy? author J.D.",
    "This is a MAGA party now,? he declared.",
    "Hes got a big problem,? he said.",
    "Do I think hes going to pass it?",
    "Honestly Kevin, is it worth it?",
    "said in a statement.",
    "I dont know."
  ]
}