{
  "id": 6238,
  "mediaId": 558,
  "date": "d2022-04-22T02:55",
  "headline": "The new right isn't conservative. They don't want to be.",
  "image": "https://s.yimg.com/ny/api/res/1.2/yFygiU.PjxOLHUEhGOfWuQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/KNg2xnIskcOAKxYONtLFhg--~B/aD00NzU7dz04NDU7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_week_574/e66f75df92666b46dd64f39fc417d565",
  "link": "https://ca.news.yahoo.com/isnt-conservative-dont-want-095511381.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Samuel Goldman",
  "authorUrl": "",
  "termIds": [
    1147,
    1840,
    3103,
    4611,
    539,
    2845,
    2851
  ],
  "sentences": [
    "In universities, media, and many big companies, there's nothing controversial about saying that white people are an essentially malign portion of the human race, that gender is independent of biological sex, or that people who voted for former President Donald Trump are an existential threat to democracy.",
    "Not so long ago, professional advancement, stable romantic relationships, and residential independence seemed like the birthright of young Americans industrious or lucky enough to graduate from college and make it to one of the metro areas heavily populated by others of their kind.",
    "A recurring theme in their conversation, in the piece as well as the blogposts, Twitter threads, and private chats where they develop their ideas, is the belief that some kind of revolution would be necessary for them to achieve goals that once would have seemed utterly mundane.",
    "In the after-parties and corridors of the National Conservatism conference held in Orlando last October, reporter James Pogue discovered a subterranean network of \"podcasters, bro-ish anonymous Twitter posters, online philosophers, artists, and amorphous scenesters.\"",
    "Drawing on his experiences as a young intellectual in the 1920s and early '30s, Strauss argued that opposition to the Weimar Republic among his educated contemporaries was essentially a protest against the formless boredom of modern life.",
    "In practice, they're more attentive to the anxieties of what George Orwell called the \"\"  in updated terms, the journalists, academics, and other \"knowledge workers\" whose expectations outstrip their income.",
    "Where others might see a threatened but legitimate constitutional order or a struggling yet still functional economy, they perceive a tyrannical yet incompetent \"regime\" collapsing under its own weight.",
    "Early in 1941, the German-Jewish political philosopher Leo Strauss delivered a of the generational appeal of the far-right to his colleagues on the faculty of the New School for Social Research.",
    "On the left, that encourages a fixation on symbolic diversity, student debt, radical police reform, and other issues that are distant from the actual concerns of the poor and racial minorities.",
    "On the right, it leads to otherwise perplexing obsessions with content moderation on social media, bodybuilding, and other displays of flamboyant manliness and obscure theological doctrines.",
    "Assured of survival without enjoying real security and lacking causes to inspire sacrifice, \"young nihilists\" turned not only against liberal democracy but against civilization itself.",
    "Vance and Blake Masters, both supported by their former employer Peter Thiel, have tried to bridge the gaps in for the GOP Senate nominations in Ohio and Arizona, respectively.",
    "But there's more to the \"new right,\" as it's somewhat anachronistically known (a succession of movements with similar names has emerged since the 1950s), than being based.",
    "To be clear, the revolutionary instincts of today's pseudonymous bloggers, underemployed graduate students, and freelance journalists have limited appeal at the moment.",
    "As the boundaries of acceptable opinion shift to the left, at least within major institutions, the opportunities for dissent have become concentrated on the right.",
    "That's the message from Vanity Fair, the May issue of which includes a report from a small but colorful corner of the intellectual and political landscape.",
    "Attracted to the right but far from conservative, these dissidents dream of overthrowing some of the basic premises of 21st-century American life.",
    "As Pogue emphasizes, this strand of the new right is somewhat distinct from the more populist and electorally consequential MAGA movement.",
    "Today, these markers of adulthood can be delayed by years or decades  and increasingly seem out of reach.",
    "But their efforts so far have relied more heavily on familiar than the found in online conversations.",
    "This motley crew is composed of people in their 20s and early 30s, largely though not entirely men.",
    "In that respect, the new right can be viewed as a negative image of the woke left.",
    "The shock value associated with these views is an important part of their appeal.",
    "With , they may best divided fields in the upcoming primaries (neither is ).",
    "If you aim to provoke, you'd better reject these claims, loudly and often.",
    "On social media, this countercultural quality is known as being \"based.\"",
    "Both movements invoke a favored cohort of the truly disadvantaged.",
    "The kids are not all alright.",
    "J.D."
  ]
}