{
  "id": 6239,
  "mediaId": 239,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Trump touts Vance at Ohio rally",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/23/Trump_47631.jpg-1f892_c0-151-3600-2249_s885x516.jpg?27d773053ef491d0ba12c3bdb38ffd359e94f779",
  "link": "https://www.washingtontimes.com/news/2022/apr/23/trump-touts-jd-vance-ohio-rally/",
  "sentiment": "0",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Clark",
  "authorUrl": "https://www.washingtontimes.com/staff/joseph-clark/",
  "termIds": [
    3103
  ],
  "sentences": [
    "This state loves the president and on May 3, vote JD Vance for US Senate ladies and gentlemen, because I am the American first candidate.?\nMr. Vance was a staunch critic of Mr. Trump in the lead-up to the 2016 election, slamming Mr. Trump as an idiot.? The Yale Law graduate floated the idea of voting for Democratic presidential candidate Hillary Clinton in the 2016 runoff against Mr. Trump.",
    "Were excited to see big man, the 45th President of the United States and the 47th President of the United States tonight.?\nMr. Vance also decried Washingtons corruption? which he said led to the FBI obtaining an illegal wiretap? on the Trump campaign and to protesters the Jan. 6, 2021 attack on the Capitol being detained unconstitutionally.",
    "He said it was all about winning.?\nThe endorsement by Trump, who continues to maintain significant pull within the Republican Party, came as a blow to the top Republican contenders in the field including former Ohio Republican Party Chair Jane Timken, former Ohio treasurer Josh Mandel and investment banker Mike Gibbs.",
    "Mr. Trumps recent endorsement of Mr. Vance, who in 2016 described himself as a Never Trump guy? has exposed fissures within the Ohio GOP with the Trump-aligned Club for Growth pledging to back former state treasurer Josh Mandel for the Ohio Senate seat.",
    "Past transgressions between Trump and Vance appeared to be long gone at Saturdays rally, with Mr. Vance praising the former presidents tough on China and pro-life policies ahead of Mr. Trumps keynote.",
    "Several Republican leaders in Ohio mounted a last-ditch effort to urge Mr. Trump against endorsing Mr. Vance, citing his past disparaging comments and for his threats to support Mrs. Clinton.",
    "But on Saturday, Mr. Trump stood firmly behind Mr. Vance and assured his audience that he would be part of a Republican wave elected to Congress in this years primaries.",
    "Joe Kildea, a Club for Growth spokesperson, said told the Associated Press that the group will increase its spending in the coming days to air even more anti-Vance ads.",
    "And by the way, hes been incredible the last long period of time.?\nMr. Trump said the final decision was not easy when he announced the endorsement last week.",
    "Mr. Trump shrugged it off Saturday, saying many of the candidates he has endorsed have, at one time or another, had less than flattering things to say.",
    "More recently, Mr. Vance has walked back the remarks during his prime-time cable news appearances and town halls as a Senate candidate.",
    "And with just weeks remaining until the primary, Mr. Trumps endorsement has added another level of contention in the field.",
    "Seven months from now the people of Ohio are going to vote to fire the radical left Democrats,? Mr. Trump told the crowd.",
    "Youre going to elect an incredible slate of true America first Republicans to Congress, and were going to send J.D.",
    "But said Mr. Vance was best positioned to take on the states Democratic front-runner, Rep. Tim Ryan, in the fall.",
    "Im honored, honored to have the endorsement of Donald J. Trump for my Senate candidacy in Ohio,? Mr. Vance said.",
    "Vance in a campaign-style rally in Ohio weeks ahead of the states highly competitive May 3 GOP primary.",
    "If I went by that standard, I dont think I would have endorsed anybody in the country,? he said.",
    "Another group backing Mr. Mandel, Ohio Value Voters, called for a boycott of Saturdays rally.",
    "Former President Donald Trump on Saturday touted Republican Senate candidate J.D.",
    "We have to pick somebody that can win.?\n- This story includes wire reporting.",
    "I have to do what I have to do,? Mr. Trump told the crowd Saturday.",
    "Im so honored to be here at this Trump rally,? Mr. Vance said.",
    "A lot of them said some really bad things.",
    "Vance to the United States Senate.",
    "But ultimately, I put that aside.",
    "The President loves this state."
  ]
}