{
  "id": 6257,
  "mediaId": 239,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "J.D. Vance gets Trump bounce in Ohio Senate race: poll",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/28/election_2022-senate-ohio-russia_deals_95247_c0-241-5760-3599_s885x516.jpg?e942c72aa26afc8104bfcfead01a46ac0f832101",
  "link": "https://www.washingtontimes.com/news/2022/apr/21/jd-vance-gets-trump-bounce-ohio-senate-race-poll/",
  "sentiment": "0",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    3103
  ],
  "sentences": [
    "Mr. Vance is the preferred pick of 25% of likely Republican primary voters, followed by former state treasurer Josh Mandel (18%), businessman Mike Gibbons (13%), former sate GOP Chair Jane Timken (11%) and state Sen. Matt Dolan (9%).",
    "Mr. Trumps decision, meanwhile, angered some of his earliest Ohio supporters who could not come to terms with how he could support someone who had been so critical of him during his political rise.",
    "Vance is the quickest and easiest way to build Vances lead even further, putting him into a nearly insurmountable position against his Republican primary opponents,? the poll analysis reads.",
    "Thats according to a statewide survey conducted by the pro-Vance Protect Ohio Values super PAC that shows Mr. Vance has sprinted into the lead in the high-profile GOP Senate primary race.",
    "The Protect Ohio Values super PAC also received a $3.5 million donation from billionaire entrepreneur Peter Thiel following the Trump endorsement, Politico reported this week.",
    "Mr. Trump endorsed Mr. Vance last week, saying the Yale University graduate and author of Hillbilly Elegy? is the partys best bet to win retiring Republican Sen.",
    "The endorsement has been viewed as a major victory for Mr. Vance, who had spent months wrestling Mr. Mandel, Mr. Gibbons and Ms. Timken for the Trump mantle.",
    "That marks a shift from three weeks ago, when a poll from the same super PAC showed Mr. Vanced locked in a three-way tie with Mr. Mandel and Mr. Gibbons.",
    "Mr. Vances net favorable rating also has ticked up since last month, climbing from +10 to +18 and making him the most likable candidate in the field.",
    "Mr. Trump is set to headline a rally Saturday in Ohio featuring Mr. Vance and other candidates for Congress who have received his blessing.",
    "Vances bid for a U.S. Senate seat from Ohio is gaining steam following former President Donald Trumps recent endorsement.",
    "The survey of 800 likely voters had a margin of error of plus or minus 3.46 percentage points.",
    "When voters were informed of the Trump endorsement, Mr. Vances support jumped to 37%.",
    "Under that scenario, Mr. Mandel received 14%, and Mr. Gibbons and Ms. Timken got 9%.",
    "Sharing the news far and wide that President Trump is fully behind J.D.",
    "The super PAC poll shows Mr. Vance is getting a bounce.",
    "Mr. Thiel has now donated $13.5 million to the group.",
    "Mr. Dolan garnered 8%.",
    "Rob Portmans seat.",
    "J.D."
  ]
}