{
  "id": 6261,
  "mediaId": 19,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Poll: J.D. Vance Takes Huge Lead in Ohios Senate Race",
  "image": "https://media.breitbart.com/media/2022/04/GettyImages-1239309885-640x480.jpg",
  "link": "https://www.breitbart.com/midterm-election/2022/04/21/poll-j-d-vance-takes-huge-lead-ohios-senate-race/",
  "sentiment": "0.222",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    946,
    1053,
    1147,
    1801,
    3103,
    379,
    571,
    3255,
    2845
  ],
  "sentences": [
    "Hes strong on the Border, tough on Crime, understands how to use Taxes and Tariffs to hold China accountable, will fight to break up Big Tech, and has been a warrior on the Rigged and Stolen Presidential Election.?\nBefore Trump made the official endorsement, the huge news leaked from a number of establishment Ohio Republican Party executives  closely linked to Ohio GOP Senate candidate Jane Timken,? who attempted to block Trumps endorsement of Vance, Breitbart News reported.",
    "Vance  25 (18 in March)\nMandel  18 (18)\nGibbons  13 (18)\nTimken  11 (9)\nDolan  9 (9) pic.twitter.com/hpRKog2aQ4\n Andrew Tobias (@AndrewJTobias) April 21, 2022\nThe poll suggests Trump has a high influence on midterm races.",
    "Vance has taken a huge lead in Ohios Senate race after receiving the endorsement of former President Donald Trump, a Fabrizio, Lee & Associates poll revealed Thursday.",
    "According to the survey, his polling number has not changed since March:\nJD Vances Super PAC finished its first #OhSen poll since Trump endorsed him last Friday.",
    "The endorsement clearly played a role in this improvement, as Vance leads by 19-points among those aware he was endorsed by Donald Trump? the pollers analyzed.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent  dangerous because they will have so much money to spend,? Trump said.",
    "Nearly half (47%) do not yet know of Trumps endorsement of Vance.?\nTrump endorsed Vance last week in a lengthy press release.",
    "After respondents were informed that Vance won Trumps endorsement, his vote share increased to 37 percent.",
    "will destroy him in the debates and will fight for the MAGA Movement in the Senate,? Trump continued.",
    "Only 11 percent of respondents said they had not heard of Vance, down 6 points from 17 percent.",
    "The poll also revealed that Vance became a more well-known candidate after Trumps endorsement.",
    "He endorsed Vance after Donald Trump Jr. publicly defended Vances record weeks earlier.",
    "It shows him pulling ahead, after its last one showed him in a three-way tie for first.",
    "In contrast, however, Mandels numbers decreased three percentage points (7-4 percent).",
    "Vances lead in the competitive primary race has reached seven percentage points.",
    "Josh Mandel, who was in a three-way tie with Vance, was marked at 18 percent.",
    "Vance polled 25 percent support among 800 Republican primary voters.",
    "Before Trumps endorsement in March, Vance held 18 percent.",
    "Follow Wendell Huseb on Twitter and Gettr @WendellHuseb.",
    "The Ohio Republican Senate primary election is May 3.",
    "Josh Mandel earned 14 percent, a 27-point difference.",
    "He is the author of Politics of Slave Morality.",
    "Ive studied this race closely and I think J.D.",
    "However, this only accounts for 53% of RPV.",
    "Trump, however, was not deterred.",
    "However, J.D.",
    "J.D."
  ]
}