{
  "id": 6263,
  "mediaId": 157,
  "date": "d2022-04-21T00:00",
  "headline": "Club for Growth rejects Trump Jrs ultimatum as GOP civil war intensifies",
  "image": "https://www.rawstory.com/media-library/donald-trump-jr-claims-generations-will-be-hurt-by-a-covid-19-lockdown-but-they-already-have-been.png?id=24499263&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/2657194626/",
  "sentiment": "-0.77",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    723,
    946,
    982,
    1053,
    1801,
    2215,
    3103,
    105,
    428,
    571
  ],
  "sentences": [
    "Trump\\u2019s eldest son, who has championed Vance, jabbed McIntosh without naming him this weekhttps://twitter.com/donaldjtrumpjr/status/1517221788052340738\\u00a0\\u2026\n Maggie Haberman (@Maggie Haberman) 1650569094\nTrump, Jr. responded with a video attacking Mandel.",
    "Club for Growth spokesman says they are going to up their spend.https://twitter.com/maggienyt/status/1517261551597768705\\u00a0\\u2026\n Josh Dawsey (@Josh Dawsey) 1650579993\nThe Ohio Senate primary is not the only race where Trump and the Club for Growth disagree.",
    "\"From the moment Trump announced his candidacy in the summer of 2015 until he clinched the Republican nomination a year later, the Club for Growth waged a nonstop, $7 million campaign against him.",
    "A person close to Don Jr says that If the Club continues running these ads, Don Jr is considering opposing all newly endorsed Club candidates unless/until David McIntosh is removed by the board.",
    " Maggie Haberman (@Maggie Haberman) 1650578317\nJosh Dawsey of The Washington Post reports that the Club for Growth is going to increase the spending on it's ad attacking Vance.",
    "Only one outside political organization spent more to advertise against Trump in the primariesa Super PAC formed explicitly to defeat him,\" Politico reported in 2016.",
    "Trump instructed an assistant to send a profane text message to McIntosh, New York Times correspondent Maggie Haberman reported.",
    "Tensions between the Trump family and the conservative powerhouse Club for Growth spilled into the open on Thursday.",
    "In the Alabama Senate primary, the organization is standing by Rep. Mo Brooks (R-AL) despite Trump un-endorsing him.",
    "And in Arizona, Trump is backing Kari Lake for governor while the group is backing former Rep. Matt Salmon (R-AZ).",
    "It started with the Trump family freaked out that the Club for Growth chief David McIntosh ran ads against J.D.",
    "She noted Donald Trump, Jr. had bashed McIntosh publicly for backing Josh Mandel in the primary.",
    "And then Trump, Jr. issued an ultimatum threatening to attack other Club for Growth candidates.",
    "NOW WATCH: George Conway busts McCarthy and McConnell's 'cowardice and corruption' after Jan. 6",
    "In 2016, Club for Growth was \"vehemently\" opposed to Trump's candidacy.",
    "Vance in Ohio's GOP Senate primary even after Trump endorsed him.",
    "Don Jr is likely to make at least one more appearance for Vance."
  ]
}