{
  "id": 6265,
  "mediaId": 19,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Watch  Ohios J.D. Vance Diagnoses How Americas Leaders Drained Working Class Jobs Overseas at Newsmax Town Hall",
  "image": "https://media.breitbart.com/media/2022/04/election-2022-senate-ohio-senate-republican-candidate-vance-answers-question-ohio-senate-republic-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/04/21/watch-ohios-j-d-vance-diagnoses-how-americas-leaders-drained-working-class-jobs-overseas-newsmax-town-hall/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Bois",
  "authorUrl": "https://www.breitbart.com/author/pbois/",
  "termIds": [
    1801,
    3103,
    380,
    428,
    3448,
    2661,
    2845,
    2935,
    4962,
    5059
  ],
  "sentences": [
    "What happened to Dayton and what happened to Toledo and Middletown, and so many states, is that our leaders decided we dont need to make stuff here anymore.?\nThe steel that we rely on in our buildings, the computer chips that are in everything now, from appliances to phones to cars, the pharmaceuticals that our kids take, all of this stuff is now mainly made overseas by people who dont like us,? he added.",
    "Vance received a huge bump last week when former President Donald Trump endorsed his candidacy, hailing him as our best chance for victory in what could be a very tough race.?\nThe Democrats will be spending many millions of dollars, but the good news is that they have a defective candidate who ran for President and garnered exactly zero percent in the polls.",
    " @JDVance1 #OHSen pic.twitter.com/dJyKVfNcqi\n JD Vance for U.S. Senate Press (@JDVancePress) April 21, 2022\nPerhaps Vances strongest moment of the town hall came when he addressed the so-called Dont Say Gay? bill being floated in Ohio, which essentially bars teachers from discussing gender or sexuality with children grades K-3.",
    "WATCH: @JDVance1 schools Woke College Student over anti-groomer legislation #OHSen\n\"The actual text of the Florida legislationwhat it says is you should not be able to talk about sexuality and gender identity with children who are K-3that seems like a pretty good idea.\"",
    "\"People prosper when they have good jobs that support families, not when they just sit at home and get a check from the governmentYou're never gonna write enough checks to make up for the fact that we used to be a proud country that made stuff.\"",
    " @JDVance1 #OHSen pic.twitter.com/VDzvx95t7S\n JD Vance for U.S. Senate Press (@JDVancePress) April 21, 2022\nIn another exchange, with a high school student, Vance explained why he stands above other candidates in the already crowded primary.",
    "On the issue of American jobs, a former Air Force veteran asked Vance how he would address struggling middle-class Americans who have become dependent on government welfare in the face of their jobs being shipped overseas.",
    "What happened is a lot of middle-class communities lost the good jobs that support families.?\nVance cited former President Trumps trade tariffs as an example of combating this epidemic.",
    "The actual text of the Florida legislation that people call Dont Say Gay, what it says is you should not be able to talk about sexuality and gender identity with children who are K-3.",
    "Vance appeared at a Newsmax town hall meeting Wednesday where he discussed a range of topics, from bringing back American jobs to protecting childrens innocence in the classroom.",
    "People prosper when they have good jobs that support families, not when they just sit at home and get a check from the government,? said Vance.",
    "Youre never gonna write enough checks to make up for the fact that we used to be a proud country that made stuff,? he concluded.",
    "I think its one of the great successes in the media: creating something when there wasnt anything before.",
    "One of the differences is I'm not afraid to talk to voters and I'm not afraid to answer tough questions.",
    "Vance noted the town hall was originally supposed to be a debate, but no other candidates showed up.",
    "pic.twitter.com/mVOgrHmRNF\n JD Vance for U.S. Senate Press (@JDVancePress) April 21, 2022\nJ.D.",
    "That seems like a pretty good idea,? Vance added, prompting applause from the audience.",
    "I think it's pretty cowardly, pretty pathetic that nobody else decided to show up.\"",
    "I think the media has called this thing a Dont Say Gay bill,? Vance asserted.",
    "The bottom line is, we must have a Republican victory in Ohio,? Trump said.",
    "I dont do talking points and I dont do slogans,? Vance said.",
    "Youre talking about five, six, seven, eight-year-old kids.",
    "Republican Ohio Senate candidate J.D.",
    "\"Every candidate was invited here.",
    "This was supposed to be a debate."
  ]
}