{
  "id": 6269,
  "mediaId": 65,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "Half of Trump's 2016 Ohio RNC delegates call Vance endorsement 'betrayal,' ask him to 'reconsider'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/485d771c-d755-4689-adc8-657c39624153/232b78e4-8200-43c0-9f39-8f573dcec65b/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/trump-rnc-delegates-vance-betrayal",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    3103
  ],
  "sentences": [
    "OHIO REPUBLICAN CENTRAL COMMITTEE, MANY COUNTY GOP CHAIRS URGE TRUMP NOT TO ENDORSE CANDIDATE IN SENATE RACE\nIn his endorsement released last week, however, Trump acknowledged Vance's past comments and says he believes the candidate's had a change of heart.",
    "While JD Vance may have apologized and now says nice things about you (as candidate Vance) - the fact is JD Vance never once apologized for working against our movement and most importantly calling us - your original supporters - racist,\" the letter says.",
    "A letter from the group with the request follows Trump's Friday endorsement of Vance, in which the former candidate called the investment banker and \"Hillbilly Elegy\" author \"the candidate most qualified and ready to win.\"",
    "FIRST ON FOX  Half of the Ohio delegates former President Donald Trump's campaign selected for the 2016 Republican National Convention (RNC) are asking Trump Wednesday to \"reconsider\" his endorsement of J.D.",
    "It also comes after a similar letter signed by a bevy of state and county GOP officials asked Trump not to endorse Vance, which Fox News first published shortly before the endorsement came down.",
    "\"While we are aware of the blowback you are receiving from your supporters for your endorsement of Vance- please understand we are not your typical Republicans in Ohio,\" the letter says.",
    "\"We would respectfully request you reconsider your endorsement of JD Vance to show your supporters in Ohio and across our great states why we first believed in you back in 2016.\"",
    "Among the other major candidates are former Ohio GOP Chair Jane Timken, investment banker Mike Gibbons, former Ohio state Treasurer Josh Mandel and state Sen. Mike Dolan.",
    "John Kasich won the state's GOP presidential primary in 2016, meaning those designated Trump delegates did not have the chance to represent him at the RNC.",
    "\"Unlike the other candidates in this race, JD Vance has not developed relationships with Republican voters and grassroots leaders that are crucial to win.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent  dangerous because they will have so much money to spend,\" Trump said.",
    "But the letter's signers still represent some of the former president's earliest supporters when much of the GOP was highly suspicious of him.",
    "\"We are the original and proud Trumpers who served as your delegates in Ohio when everybody was against you or supporting other candidates.\"",
    "The letter is signed by 33 of the total 66 delegates that were designated to represent Trump at the 2016 RNC if he won the Ohio primary.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,\" Trump said.",
    "The campaigns for Timken, Mandel and Gibbons fought particularly hard to convince Trump not to endorse a candidate in the race.",
    "This endorsement of JD Vance is a betrayal to not only your Ohio supporters but Trump supporters across our great nation!\"",
    "Some of those delegates have since died, meaning the signers of the Wednesday letter represent the majority of that group.",
    "CLICK HERE TO GET THE FOX NEWS APP\nVance is set to face off with a crowded GOP field in Ohio's May 3 primary.",
    "The winner of the Ohio GOP primary will likely face Rep. Tim Ryan, D-Ohio, in the general election.",
    "And they highlight that Vance was among the people who forcefully opposed Trump then.",
    "will destroy him in the debates and will fight for the MAGA Movement in the Senate.\"",
    "\"He is our best chance for victory in what could be a very tough race.\"",
    "\"You trusted us in 2016 to do what was best for Ohio,\" it continues.",
    "\"President Trump this movement is about America First.",
    "\"I've studied this race closely and I think J.D.",
    "\"Like some others, J.D.",
    "the letter continues.",
    "Vance for Senate.",
    "Former Ohio Gov.",
    "\"However, J.D."
  ]
}