{
  "id": 6280,
  "mediaId": 8379,
  "date": "2022-04-15",
  "headline": "Trump endorses J.D. Vance in Republican U.S. Senate race",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/04/Untitled-design-5-e1649959088545.png?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/trump-endorses-j-d-vance-in-republican-u-s-senate-race/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maeve Walsh",
  "authorUrl": "https://www.nbc4i.com/author/maeve-walsh/",
  "termIds": [
    0
  ],
  "sentences": [
    "“He was an incredible fighter for hard working Americans in the White House, he will be again, and I’ll fight for the America First Agenda in the Senate.”\nIn an independent poll commissioned by NBC4 in February, Vance garnered 7.7% of the vote, taking third place in the crowded sea of Republican candidates.",
    "Trump announced on Friday that Vance, a venture capitalist and “Hillbilly Elegy” author who’s competing to represent Ohio in the U.S. Senate, has the greatest chance to defeat the “weak, but dangerous, Democrat opponent” in the November general election, according to a social media post from Vance.",
    "Vance has my Complete and Total Endorsement.”\nTrump touted Vance’s commitment to strengthening U.S. border security, a tough-on-crime approach, holding China accountable, fighting to break up big tech companies — and supporting Trump’s baseless, false claims that the 2020 election was stolen.",
    "“It is time for the entire MAGA movement, the greatest in the history of our Country, to unite behind J.D.’s campaign because, unlike so many other pretenders and wannabes, he will put America First,” Trump said in a statement.",
    "Vance has officially secured the highly sought-after endorsement from former President Donald Trump.",
    "In front of him was Mike Gibbons with 22.4% of the vote and Josh Mandel with 14.9% of the vote.",
    "“I’m incredibly honored to have President Trump’s support,” Vance said in a Twitter post.",
    "COLUMBUS, Ohio (WCMH) — Republican U.S. Senate candidate J.D.",
    "“In other words, J.D."
  ]
}