{
  "id": 6280,
  "mediaId": 19,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "Donald Trump Jr. Sings Eric Greitens Praises: They Only Go After Guys that Will Actually Pose a Threat",
  "image": "https://media.breitbart.com/media/2019/11/donald-trump-jr-thumbs-up-AP-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/20/donald-trump-jr-sings-eric-greitens-praises-they-only-go-after-guys-will-actually-pose-threat/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    749,
    1147,
    1801,
    2213,
    2365,
    3103,
    4629,
    182,
    2799,
    5021
  ],
  "sentences": [
    "He then went on to talk about the Soros-linked prosecutor, Kim Gardner, who is under serious legal scrutiny for the way she handled her investigation into Greitens in 2018, which ultimately led to his resignation from Missouris governorship:\nI see the sort of sham stuff that theyve thrown at Greitens.",
    "As Breitbart News reported:\nGardner launched a politically charged investigation into Greitens in 2018 after the former governor was accused of having an affair and blackmailing the woman with compromising photos while in office.",
    "Donald Trump Jr., son of former President Donald Trump, praised Missouris Eric Greitens and said, they tend to only go after the guys that will actually pose a threat,? during an interview with a local radio station.",
    "The FBI guy admits that he lied under it and when you see those kinds of setups, it makes you wonder what theyre doing, and for a reason, because they tend to only go after the guys that will actually pose a threat.",
    "Last month, Tisaby pled guilty to evidence tampering and was sentenced to probation after facing six felony counts of perjury and one count of evidence tampering in connection with the Greitens investigation.",
    "Trump brought up the sham stuff that theyve thrown at Greitens? when local radio host Marc Cox asked him if he had any insight into who his father might endorse in the U.S. Senate race in Missouri.",
    "Instead of having the St. Louis Police Department investigate these allegations, Gardner hired former FBI agent William Tisaby to conduct the investigation.",
    "Gardner dropped an invasion of privacy charge against Greitens after a judge determined she would have to testify under oath as part of the case.",
    "We are hated and attacked by the fake news media and the RINOs because I am the only America First candidate running in Missouri!?",
    "We are hated and attacked by the fake news media and the RINOs because I am the only America First candidate running in Missouri!",
    "When CNN hates you, the Washington Post hates you, the New York Times hates you, it was was like, thats my guy.",
    "Thank you for the kind words, @DonaldJTrumpJr,? Greitens tweeted along with a clip of the interview.",
    "pic.twitter.com/DhKFCNBPUt\n Eric Greitens (@EricGreitens) April 19, 2022\nYeah, Im not sure.",
    "So well see what my father does in it, but you know, I certainly have my own opinions.",
    "Thats usually the guy I like.?\nBecause you know, its sort of like J.D.",
    "Obviously, its been a topic of conversation,? Trump said.",
    "Thank you for the kind words, @DonaldJTrumpJr.",
    "Now the prosecutor is getting in trouble.",
    "That makes a lot of sense,? said Trump.",
    "I see who the press hates the most.",
    "Vance In Ohio, you know.",
    "You know, well see."
  ]
}