{
  "id": 6288,
  "mediaId": 136,
  "date": "d2022-04-19T18:54",
  "headline": "Trump to Rally for Nebraska Candidate Accused of Sexual Assault",
  "image": "https://d.newsweek.com/en/full/2022515/trump-charles-herbster.webp?w=790&f=6c82955b886979b1365f8d44abba7877",
  "link": "https://www.newsweek.com/charles-herbster-donald-trump-rally-nebraska-governor-race-1699066",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Natalie Colarossi",
  "authorUrl": "https://www.newsweek.com/authors/natalie-colarossi",
  "termIds": [
    1147,
    1404,
    1902,
    2136,
    3103,
    428,
    2816,
    2845,
    4998
  ],
  "sentences": [
    "Herbster has also appeared at a recent campaign event alongside the former president's son, Donald Trump Jr.\nTrump's upcoming rally in Nebraska is just one of several events meant to boost support for his endorsed candidates ahead of the midterm elections.",
    "Former President Donald Trump is set to hold a rally next week alongside Charles Herbster, his candidate of choice for Nebraska's Republican gubernatorial race, who has been accused of assaulting at least eight women.",
    "In response, Pillen told Newsweek last week that sexually assaulting women should be \"disqualifying for anyone seeking to serve as a leader\" and said he and his wife are praying for the women \"targeted\" by Herbster.",
    "The gubernatorial candidate was one of just 13 people currently running for office who attended the former president's \"Stop the Steal\" rally before a violent mob attacked the U.S. Capitol on January 6, 2021.",
    "Trump's endorsement of Herbster last October preceded the latest sexual misconduct allegations, but his decision to rally with the GOP candidate suggests he is standing behind his support.",
    "Herbster's campaign has denied the allegations, dismissing them as a \"political hit piece\" carried out by Republican Governor Pete Ricketts and fellow GOP primary candidate Jim Pillen.",
    "The Republican state senator alleged that in 2019, Herbster reached up her skirt and touched her without her consent while she walked past him at a political event.",
    "Seven women, including Republican state Senator Julie Slama, told the Nebraska Examiner that Herbster sexually groped them at various events dating back to 2017.",
    "Specialists from the Rape, Abuse, and Incest National Network (RAINN) sexual assault hotline are available 24/7 via phone (1 (800) 656-4673) and online chat.",
    "So far, Herbster is the only guest speaker slated for the bill, according to an announcement posted to Trump's website on Tuesday.",
    "Herbster, a businessman who serves as CEO of a cattle breeding company, has long been a steadfast Trump supporter.",
    "\"This story is a ridiculous, unfounded dirty political trick being carried out by Pete Ricketts and Jim Pillen.\"",
    "Earlier this month, Trump appeared in North Carolina to show support for Republican Representative Ted Budd.",
    "Not once has my integrity EVER been challenged in this manner,\" Herbster said in a statement.",
    "He has also pledged to help Dr. Mehmet Oz in the GOP Senate primary in Pennsylvania and J.D.",
    "I've respected and empowered women to run my company, my farm, and now my campaign.",
    "Slama was the only woman who agreed to be named in the Nebraska Examiner report.",
    "The rally is scheduled to take place on April 29 in Greenwood, Nebraska.",
    "Additional support from the group is also accessible via the mobile app.",
    "Newsweek contacted Trump's office for additional comment.",
    "\"For thirty years, I've employed hundreds of people.",
    "Another woman alleged Herbster forcibly kissed her.",
    "Vance in Ohio's Republican Senate race."
  ]
}