{
  "id": 6295,
  "mediaId": 409,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "The Medias Dirty Secret about GOP Coverage",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/04/vanceoz1.jpg?w=1592",
  "link": "https://www.nationalreview.com/the-morning-jolt/the-medias-dirty-secret-about-gop-coverage/",
  "sentiment": "0.443",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Geraghty",
  "authorUrl": "",
  "termIds": [
    815,
    946,
    1069,
    1147,
    1801,
    3103,
    4233,
    428,
    517,
    571,
    2845,
    2862
  ],
  "sentences": [
    "Pennsylvanias GOP Senate primary is relatively crowded, too, with Oz; veteran, former Treasury Department official, and Bridgewater Associates CEO Dave McCormick; African-American conservative commentator and former Army reservist Kathy Barnette; President Trumps ambassador to Denmark and Greenland, Carla Sands; former GOP lieutenant-governor nominee Jeff Bartos; and former Pennsylvania State Boxing Commissioner and attorney George Bochetto and attorney Sean Gale seemingly well behind.",
    "Were going to win this thing and take the country back from the scumbags,?\nI gotta be honest with you, I dont really care what happens to Ukraine one way or another.?\nId like to hear zero about Afghan refugees until we get every single American out first.?\nVance looks and sounds like a man whos terrified of being attacked over his Ivy League education and Silicon Valley friends, so he is out to prove no one can ever out-populist him, going to absurd lengths.",
    "On the menu today: A liberal New York Times columnist laments that Republicans in Ohio and Pennsylvania can choose between the President Trump-endorsed J. D. Vance and Mehmet Oz or a half-dozen alternatives without reality-TV careers.? It seems like a particularly disingenuous complaint, since I figure if you were really troubled by celebrity candidates, you would bother to learn the names of at least one or two of the alternatives.",
    "Top Stories\nAnd these two states dont lack for other options: In Ohios GOP Senate primary, there are state senator Matt Dolan, businessman and Trump campaign state-finance co-chair Mike Gibbons, former state treasurer Josh Mandel, Ohio GOP chair Jane Timken, and two candidates running well behind, Mark Pukita and Neil Patel.",
    "But other GOP Senate candidates do exist in Georgia, in the form of state agriculture commissioner Gary Black, former state representative Josh Clark, U.S. Air Force captain and entrepreneur Kelvin King, and former U.S. Navy SEAL and director of Intelligence Programs on the National Security Council, Latham Saddler.",
    "The Democrats have a Senate primary that once looked like it might have been competitive among lieutenant governor John Fetterman, U.S. congressman Conor Lamb, state representative Malcolm Kenyatta, and progressive activist Alexandria Khalil, but Fetterman now appears to have a substantial lead in the polls.",
    "Yes, you and I know what he meant, but if youre going to argue about Bidens energy policy, youve got to flesh it out with details  the cancellation of the Keystone Pipeline, the limitations on drilling in federally controlled land, Bidens off-the-cuff campaign-trail pledges to end fracking, etc.",
    "The Medias Not-So-Secret Love for GOP Celebrity Candidates\nI think New York Times columnist Gail Collins said a lot more than she realized yesterday when she offered a recent summary of the Ohio and Pennsylvania Republican Senate primaries:\nI guess we should move on to politics for a bit.",
    "Lots of people in the left-of-center mainstream media fume about shallow, uninformed celebrity candidates and how these fame addicts arent truly committed to doing the work of being a legislator, and then give all their attention and airtime to shallow, uniformed celebrity candidates.",
    "Herschel Walker is an extremely likeable figure, but he needs to take some time to do his homework so he can avoid future statements like:\nOne of the first thing they did  and I think people need to know this  is they decided that they were going to give up our energy.",
    "Whens the last time anyone called your attention to candidates who have published a detailed and realistic series of policy white papers, spelling out their specific legislative agenda with clarity and an astute understanding of how the government works?",
    "Mehmet Oz has been a Republican for about 20 minutes, theres considerable evidence he is a quack, hes uncomfortably friendly with the current authoritarian government of Turkey, and he is not a conservative by any stretch of the imagination.",
    "But from where I sit, the Harvard-educated, Peter Thiel-backed J. D. Vance is chasing the populist/nationalist vote with all of the grace and precision of an ostrich on crack cocaine:\nHonored to have Marjorie [Taylor Greene]s endorsement.",
    "(When you are arguably the greatest college football player of all time, lead the University of Georgia Bulldogs to the national championship in 1980, and win the Heisman Trophy in 1982, a lot of Georgians will remain eternally grateful.)",
    "Vance of Hillbilly Elegy? fame and a bunch of noncelebrities  and Pennsylvania, where theyll have the option of selecting Trumps man, Dr. Oz of Oprah fame, or a half-dozen alternatives without reality-TV careers.",
    "Few Democrats or left-of-center media voices have any genuine preferences among competing Republicans; most left-of-center media voices just want every Republican primary to turn into a demolition derby.",
    "And no doubt about it, Walker is way ahead in polling of the primary and enjoys a small (within the margin of error) lead against incumbent Democrat Rafael Warnock in hypothetical head-to-head matchups.",
    "Maybe some of these candidates are genuine clowns who belong in a circus, or maybe theyre responding to the incentive structure of a media environment that prioritizes and celebrates circus clowns.",
    "According to RealClearPolitics, only the Trafalgar Group has released a poll this month, and it shows Mandel at 28 percent, Vance at 23 percent, Gibbons at 14 percent, and Dolan at 12 percent.",
    "She chuckles that the Republican Party is going to become the Home for Unwillingly Retired Entertainers? but doesnt bother to tell readers anything about any of the other options.",
    "Those non-celebrity, and non-reality-TV-star Republican senatorial candidates may be a lot better or more qualified, but Collins cant be bothered to learn any of their names.",
    "Yes, newspaper pages and television airtime are finite resources and not every polling-at-5-percent-or-less longshot candidate can get, or deserves, a lot of earned media.",
    "All these non-celebrity candidates have a story to tell, and a lot of them have some significant accomplishments outside of the world of politics and government.",
    "Vance is in the odd position of being the now-Trump-endorsed candidate in a crowded primary, after allegedly saying Trump might be Americas Hitler? back in 2016.",
    "As it stands, Im generally not a fan of celebrity candidates, because they tend to dramatically underestimate the difficulty of campaigning, governing, or both.",
    "Just two or three memorized bullet points on each of the top issues, at minimum, would make Walker a much stronger candidate, and someday a better U.S. senator.",
    "Collins didnt mention Georgia GOP senate candidate and football legend Herschel Walker, but she would probably lump him in with the other celebrity candidates.",
    "The Ohio Democratic Senate primary is not expected to be competitive, with congressman and short-lived presidential candidate Tim Ryan likely to win easily.",
    "Im sure there are a bunch of openly pro-choice Republicans still around, but the faction? has not been a major factor in GOP politics in a long, long time.)",
    "McCormick enjoyed a small but fairly consistent lead in the relatively sparse polling, but the latest Trafalgar Group survey put Oz ahead by three points.",
    "Note that Ohio has an open-primary system, so a voter does not have to register with the Ohio Republican Party beforehand to vote in that partys primary.",
    "Next month therell be big Senate primaries in places like Ohio  where Republicans will have to choose between the newly anointed Trump favorite J.D.",
    "I dont live in Ohio, Pennsylvania, or Georgia, and the decision of who to nominate in those states will be decided by Republicans who live there.",
    "Back in early March, Fox News showed Gibbons leading the pack at 28 percent, Mandel at 20 percent, Vance at 11 percent, and Timken at 9 percent.",
    "Right now, gas prices going out of the roof, you, know right now you see theres no food on the shelf, and I think people need to know that.",
    "(Notice that Im providing links to all the candidates campaign sites, so if you want to know more about them, Im enabling you to do that!)",
    "While Trumps endorsement is likely to help, Collins couldnt even be bothered to mention the polling frontrunner, at least for now.",
    "There is no threshold for a runoff; all a nominee must do is get the most votes when theyre all counted after the May 3 primary.",
    "If you want the job of representing your state, you must do the required work on what youll be voting to pass or reject.",
    "By him going out giving up our energy, and now were not energy-independent anymore, which started the whole downfall.",
    "ADDENDUM: Yesterday on the Three Martini Lunch podcast, Greg and I discussed a new study showing that  surprise!",
    "But this is why you see these longshot candidates making YouTube videos of themselves giving away AR-15 rifles.",
    "Maybe it wont matter; its a good year for Republicans, and Ohio leans heavily toward the GOP these days.",
    "In Pennsylvania, only registered party members can participate in a political partys primary election.",
    "For all her complaining about celebrity Republicans, she likes that their names are easy to remember.",
    "She isnt genuinely concerned that the Republican Party is too enamored with celebrity candidates.",
    "For more on all the GOP Senate candidates in Ohio, Pennsylvania, and Georgia as well, read on.",
    "She has just heard about Vance and Oz, and thats whats shaping her perception of the party.",
    "All of them are running against the better-known, and now Trump-endorsed, J. D. Vance.",
    "(Collins also refers to the the pro-choice faction of the Republican Party,? and .",
    "But Ryan is probably the best candidate the Democrats can run there this cycle.",
    "You dont see a lot of attempted robberies at coffee shops where cops hang out.",
    "Get Jim Geraghtys tour of the political news in your inbox every day.",
    "What policies do you support on energy?? is not a gotcha question.",
    " criminals steer clear of people they suspect may have guns.",
    "And theyre blaming everyone else except themselves.",
    "Collins sure as heck isnt going to do that.",
    "Too much effort!",
    "Too much work!",
    ".",
    "."
  ]
}