{
  "id": 6301,
  "mediaId": 19,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "J.D. Vance on Trump: Powerful People Tried to Destroy Him, His Family",
  "image": "https://media.breitbart.com/media/2022/04/jd-vance-filephoto-apr2021-skidmore-flickr-640x335.jpg",
  "link": "https://www.breitbart.com/clips/2022/04/19/j-d-vance-on-trump-powerful-people-tried-to-destroy-him-his-family/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Trent Baker",
  "authorUrl": "https://www.breitbart.com/author/trent-baker/",
  "termIds": [
    1147,
    1801,
    3103,
    428
  ],
  "sentences": [
    "Theres something important about what this guy is doing in the country. And I think the president realizes that Im actually a convert on this stuff, right??\nHe continued, I was not an early fan of his, but I came around, and I have been a great advocate of what hes been talking about and what hes been trying to accomplish in this country.",
    "Its very interesting because, like you said, I wasnt a big Trump guy in 2016,? Vance outlined on Newsmax TVs Wake Up America.? I did not expect him to deliver on a lot of the promises that he made, and I was very proud to be proven wrong.",
    "And so, [Im] very proud to have the presidents trust on this because youre absolutely right  [I] was not always on his side, but very proud to be on his side down now and proud to have him on my side of this race.?",
    "Ive never seen a political leader in my life where so many powerful people tried to destroy him, tried to destroy his family, and it made me think, Wow, there really is something important about this movement.",
    "I think a lot of conservatives actually saw the president and action and, importantly, solving incredible corruption that came against him.",
    "He touted Trumps fight against the powerful people? who tried to destroy him? and his family as playing a role in his conversion.",
    "Vance explained how he was converted from not believing in Trump in 2016 to being a supporter and now having his endorsement.",
    "Vance discussed former President Donald Trump endorsing his campaign in the race.",
    "On Tuesday, Ohio Republican senatorial candidate J.D."
  ]
}