{
  "id": 6305,
  "mediaId": 136,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "J.D. Vance Worried Trump Was 'America's Hitler' in Text Shared by Roommate",
  "image": "https://d.newsweek.com/en/full/2021913/jd-vance-questioned-trump-americas-hitler.webp?w=790&f=2a5e55d2fb064d48bb798b6bab9cea75",
  "link": "https://www.newsweek.com/jd-vance-worried-trump-was-americas-hitler-text-shared-roommate-1698739",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    3103
  ],
  "sentences": [
    "\"We are, whether we like it or not, the party of lower-income, lower-education white people, and I have been saying for a long time that we need to offer those people SOMETHING (and hell, maybe even expand our appeal to working class black people in the process) or a demagogue would,\" he allegedly wrote.",
    "During a 2016 interview with PBS, he said: \"There is definitely an element of Donald Trump's support that has its basis in racism or xenophobia,\" also adding that many of Trump's supporters \"are just really hardworking people who are struggling in really important ways.\"",
    "In a statement to Newsweek Monday afternoon, Jordan Wiggins, Vance's campaign manager wrote: \"It's laughable that the media treats JD not liking Trump 6 years ago as some sort of breaking news, when they've already covered it to death since this race began.\"",
    "Vance, the Hillbilly Elegy author, who was once a critic of former President Donald Trump, scored his endorsement in the GOP primary last week, potentially offering his campaign a boost in a crowded field to replace outgoing Republican Senator Rob Portman.",
    "\"Clearly, President Trump trusts that JD is a genuine convert, as out of all the Republican candidates running, he endorsed JD and concluded that he is the strongest America First conservative in the race,\" Wiggins wrote.",
    "\"Despite the leftwing media's obsession with this old news, JD is proud to have President Trump's support and will stand with him to fight back against the radical left and the establishment RINOs as Ohio's next Senator.\"",
    "Still, the former president endorsed his campaign last Friday, praising him as \"the candidate most qualified and ready to win in November\" while also acknowledging Vance's previous comments about him.",
    "Georgia Representative Josh McLaurin, a Democrat, who said he was Vance's roommate while at Yale University, shared the text message that was from 2016 on Twitter that he claimed to be from Vance.",
    "The text continues: \"I go back and forth between thinking Trump is a cynical a****** like Nixon who wouldn't be that bad (and might even prove useful) or that he's America's Hitler.",
    "\"So basically in 2016, when nobody knew how Trump'd turn out, and the Left was claiming he was Hitler reincarnate, some on the Right were wondering if maybe the Left was correct?",
    "Vance once reportedly worried the former president could be \"America's Hitler\" in a resurfaced text message, his former college roommate claimed Monday.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,\" Trump wrote.",
    "\"JD Vance is the embodiment of every fraud Republican who *knew* what trump was, but once they couldn't stop it, embraced it.",
    "Vance has also faced skepticism in the past from some Ohio Republican voters over some of his remarks he made about Trump.",
    "McLaurin wrote that the text stemmed from a discussion of \"the breakdown in Republican politics.\"",
    "In the message, Vance allegedly wrote that the GOP \"has only itself to blame\" for Trump's rise.",
    "In 2016, Vance called the former president an \"idiot\" and said he was a \"Never Trump\" person.",
    "The tweet went viral Monday afternoon, prompting \"America's Hitler\" to trend.",
    "Perhaps Vance learned,\" wrote Twitter user @MichaelJPartyka.",
    "The text message was met with criticism online soon after.",
    "Newsweek reached out to Trump's press office for comment.",
    "Soulless sycophantic sellouts,\" wrote @ArbiterofCool.",
    "We had 4 years to see Trump was nothing of the sort.",
    "Trump-backed Ohio Senate candidate J.D.",
    "Others, however, defended the message.",
    "How's that for discouraging?\"",
    "\"We are now at the point.\"",
    "\"Like some others, J.D."
  ]
}