{
  "id": 6307,
  "mediaId": 124,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Trump Jr. to campaign with J.D. Vance in Ohio following father's endorsement",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220418-donald-trump-jr-al-1312-b8086e.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/trump-jr-campaign-jd-vance-ohio-fathers-endorsement-rcna24852",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1053,
    1054,
    1147,
    3103,
    380,
    428,
    2614,
    2643,
    2845,
    5017
  ],
  "sentences": [
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nTrump Jr. signaled a preference for Vance last month with a series of supportive tweets after the first GOP Senate debates but stopped short of endorsing him in order not to get out in front of his father.",
    "But Vance recently began spending money on TV ads, and the wealthy Gibbons, who has spent millions of his own dollars on ads, has come under fire for a past comment that the middle-class doesn't pay a fair share in taxes.",
    "Donald Trump Jr. will headline a town hall-style forum with Vance on Wednesday afternoon in the Cleveland suburb of Independence, according to details the campaign shared with NBC News.",
    "A Trafalgar Group survey released last week showed Josh Mandel, a former state treasurer, leading the GOP field with 28 percent of the vote, followed by Vance at almost 23 percent.",
    "Vance against GOP advice\nApril 16, 202202:37\nThe elder Trump has a Saturday rally scheduled in Delaware, Ohio, where he's expected to talk more about his endorsement of Vance.",
    "But Vance, a Marine veteran and Yale Law School graduate, has impressed Trump with \"brains and brawn,\" according to the endorsement statement that the former president issued.",
    "By backing the venture capitalist and \"Hillbilly Elegy\" author, Trump has shaken up an already chaotic and crowded Republican Senate primary.",
    "Vance  fresh off an endorsement from Donald Trump  is scheduled to campaign this week with the former president's namesake son.",
    "On Monday, Vance's campaign released a new TV ad, backed by about $500,000 worth of airtime, promoting the Trump endorsement.",
    "is the right choice for Ohio, and I am looking forward to joining him on the campaign trail this week.?\nTrump endorses J.D.",
    "Other candidates had claimed more loyalty to the former president and called attention to Vance's past criticism of Trump.",
    "Earlier polls had shown a close race between Mandel and investment banker Mike Gibbons.",
    "Im proud to join my father in supporting my friend and America First champion J.D.",
    "Polls conducted before Trump's endorsement had shown Vance gaining ground.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Vance for U.S. Senate,? Trump Jr. said in an emailed statement.",
    "\"Trump fought back and so have I,\" Vance says in the ad.",
    "CLEVELAND  Ohio Senate candidate J.D.",
    "\"Now, Ill take our fight to the U.S.",
    "Senate.\"",
    "J.D."
  ]
}