{
  "id": 6309,
  "mediaId": 21,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Trump biographer compares GOP endorsements to 'The Apprentice' as 'a sad scramble of people behaving like crabs in a bucket to be lifted out by him'",
  "image": "https://i.insider.com/625d75423958c2001823dc1f?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/trump-biographer-compares-gop-endorsements-to-the-apprentice-2022-4",
  "sentiment": "0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Oma Seddiq",
  "authorUrl": "https://www.businessinsider.com/author/oma-seddiq",
  "termIds": [
    3103
  ],
  "sentences": [
    "Former President Donald Trump's endorsements for Republican candidates in the 2022 midterms bear a resemblance to his old reality TV show, \"The Apprentice,\" according to a Trump biographer.",
    "In Pennsylvania, Trump initially backed Sean Parnell, an Army veteran who later suspended his campaign after a judge awarded his wife sole legal custody of the couple's three children.",
    "His observation comes as Trump has held a slew of fundraisers and events for Republicans running in this year's midterm elections at his Mar-a-Lago resort in West Palm Beach, Florida.",
    "There have also been instances where Trump's endorsement has consolidated support behind a candidate in a GOP primary only for them to prove themselves a liability in the general.",
    "While Trump endorsements are highly coveted in GOP primaries, the former president has yet to prove that backing a candidate can tip the scales in a competitive general election.",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Trump's track record has been mixed, but candidates can see a double-digit polling bump in the aftermath of his endorsement, particularly in more local races.",
    "The show centered on people competing for a spot to become an \"apprentice\" at one of Trump's properties, and popularized his catchphrase, \"You're fired!\"",
    "Recently, Republicans had been vying for Trump's endorsement in contested, high-profile primary races for Ohio and Pennsylvania Senate seats.",
    "In late 2017, Trump endorsed Alabama Senate GOP candidate Roy Moore, who faced sexual misconduct allegations from multiple women.",
    "Allison Joyce/Getty Images\nA Trump biographer compared the former president's 2022 endorsements to his TV show \"The Apprentice.\"",
    "The former president has endorsed around 140 candidates for 2022, displaying his lasting influence in the Republican Party.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "\"What was 'The Apprentice' but a sad scramble of people behaving like crabs in a bucket to be lifted out by him?\"",
    "\"What was 'The Apprentice' but a sad scramble of people behaving like crabs in a bucket to be lifted out by him?\"",
    "Earlier this month, Trump threw his support behind Dr. Mehmet Oz, a TV personality and political newcomer.",
    "Trump, a real estate mogul, hosted his reality television show, \"The Apprentice,\" from 2004 to 2017.",
    "D'Antonio, a longtime journalist and author, wrote the 2015 biography \"The Truth About Trump.\"",
    "Vance, despite his advisors pushing for him to support other candidates in the race.",
    "biographer Michael D'Antonio told the New York Times in a report published Monday.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "\"How are these people anything other than contestants vying for his approval?\"",
    "Trump has endorsed around 140 candidates in the midterm elections this year.",
    "Parnell denied allegations of physical abuse against his wife and children.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "In Ohio, Trump endorsed \"Hillbilly Elegy\" author J.D.",
    "Parnell criticized Trump's decision on Twitter.",
    "Moore ended up losing to Democrat Doug Jones.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Former U.S. President Donald Trump.",
    "Loading Something is loading.",
    "D'Antonio added."
  ]
}