{
  "id": 6310,
  "mediaId": 238,
  "date": "d2022-04-18T15:46",
  "headline": "Ukraine is taking up less and less of the campaign conversation",
  "image": "https://newsletter-imgs.s3.amazonaws.com/prod/the-202s/primary/daily.svg",
  "link": "https://www.washingtonpost.com/politics/2022/04/18/ukraine-is-taking-up-less-less-campaign-conversation/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1054,
    1147,
    1404,
    1801,
    2087,
    3103,
    2744,
    2888,
    2942
  ],
  "sentences": [
    "Not like other former presidents: And while other past presidents have ceded the political stage, Mr. Trump has done the opposite, aggressively pursuing an agenda of vengeance against Republicans who have wronged him, endorsing more than 140 candidates nationwide and turning the 2022 primaries into a stress test of his continued sway.?\nInspiring fear, hoarding cash, doling out favors and seeking to crush rivals, Mr. Trump is behaving not merely as a power broker but as something closer to the head of a 19th-century political machine.?\nAs Americans send off their tax returns by Mondays deadline, they dont have to worry about their neighbors knowing how much they earned or paid.",
    "The shootings in South Carolina and one in Pittsburgh, in which two minors were killed early Sunday, also left at least 31 people wounded.?\nA barrage of missiles that hit Lviv on Monday killed at least 7 and injured 11, including a child, breaking a relative calm in the western city that has been largely unscathed by Russian strikes as Ukrainian forces clung on in the battered southern port city of Mariupol,? Hannah Allam, Loveday Morris, David L. Stern, Annabelle Timsit, Bryan Pietsch, Mara Luisa Pal and Jennifer Hassan report.",
    "It began in October 2005, when Perry traveled to the border city of Laredo and announced Operation Linebacker, a new initiative that he said (without providing evidence) would protect the states residents from terrorist groups such as al-Qaida.?\nOver the next 17 years, Perry Abbott persuaded the Texas Legislature to spend billions of dollars on border security measures that included at least nine operations and several smaller initiatives.",
    "Nearly two months into Vladimir Putins brutal assault on Ukraine, the Biden administration and its European allies have begun planning for a far different world, in which they no longer try to coexist and cooperate with Russia, but actively seek to isolate and weaken it as a matter of long-term strategy,? Karen DeYoung and Michael Birnbaum report.",
    "Each time, the governors promised that the state would do what the federal government had failed to: secure the border.?\nKids arent getting caught up on routine shots they missed during the pandemic, and many vaccination proponents are pointing to Covid-19 vaccine hesitancy as a big reason why,? Politico's Megan Messerly and Krista Mahr report.",
    "To put it bluntly: if we fail to use the months remaining before the elections to deliver on more of our agenda, Democrats are headed toward big losses in the midterms.?\nWorking from a large wooden desk reminiscent of the one he used in the Oval Office, Mr. Trump has transformed Mar-a-Lagos old bridal suite into a shadow G.O.P.",
    "Just 40 percent of voters approved of how the president was handling Americas response; 69 percent believed the country had a moral responsibility to do more to stop the killing of civilians in Ukraine.?\nSo why arent candidates who demand America do more in Ukraine talking more about it, or rising in the polls when they do?",
    "Rick Perry and Greg Abbott have launched a multitude of widely publicized and costly border initiatives, which usually kicked off during their reelection campaigns or while they were considering bids for higher office,? an investigation from ProPublica, the Texas Tribune, and the Marshall Project found.",
    "In a fact sheet? released early Monday morning to coincide with Tax Day, the White House sought to use Scotts proposal  which his GOP colleagues have hardly embraced  as a contrast with President Bidens plans for the middle class,? John Wagner and Mariana Alfaro write for Post Politics Now.",
    "Vance dismissed it all as a massive distraction,? a sideshow to distract from illegal immigration from the same people who told you that Hunter Biden had no corrupt business dealings in Ukraine.? The media, he said, spent 20 minutes on war coverage for every minute spent covering inflation.",
    "Midterm politics are endangering a key Biden nominee who would give Democrats a majority at the Federal Communications Commission  jeopardizing the administrations push to restore net neutrality and other tech regulations rolled back in the Trump era,? Politicos John Hendel reports.",
    "There may be a poll that says two-thirds of voters are in favor of sending MIGS to Ukraine, but show me the Republican outside of the Beltway who makes that his top issue and actually votes on it.?\nPublic interest in the war surged at the end of February, when the invasion began.",
    "The Biden administration is taking a key step toward ensuring that federal dollars will support U.S. manufacturing  issuing requirements for how projects funded by the $1 trillion bipartisan infrastructure package source their construction material,? the APs Josh Boak reports.",
    "And he doesnt care for freedom and democracy, which the people of Ukraine are fighting for right now.?\nBut Budd wasnt in the room; he had skipped the debate, as polls showed him rising with the May 17 getting closer and voters becoming aware that Trump had endorsed him.",
    "Last weeks Ipsos tracking poll found just 8 percent of voters believing that war and foreign conflicts? most important problem facing the country, down more than half since March; three times as many said that the economy? worried them the most.",
    "In France, which holds the second round of its presidential election this weekend, perennial right-wing candidate Marianne Le Pen had tumbled in polls after the Russian invasion, and after negative media coverage about her own praise of Putin.",
    "In North Carolina, former governor Pat McCrory went after Rep. Ted Budd (R-N.C.) on those grounds, saying in an ad that while Ukrainians bled and died,? Budd excused their killer,? because he had called Russian president Vladimir Putin smart.",
    "Republicans want to frame the upcoming elections to be about wokeness, cancel culture and the militant left wing.? Standing up for the inherent dignity of everyone is a core American value, and Democrats are proud to do that every day.",
    "While Republican politicians peddle lies, fear and division, we should use every single one of the next 200 days or so before the election to deliver meaningful improvements for working people,? Sen. Elizabeth Warren (D-Mass.)",
    "I wonder sometimes what else could go wrong, Ed said, as he looked over a hill toward the west end of their ranch, where an active U.S. government nuclear missile was buried just beneath the cow pasture,? Eli Saslow reports.",
    "White House Covid czar Ashish Jha said Sunday that onerous lockdown policies like those being instituted in China are unlikely to work and should not be a model for places like the U.S.,? Politicos Nick Niedzwiadek reports.",
    "In another one of the most recent polls that asked voters about Ukraine, from Quinnipiac University, most adults by far said that the worst? in the war was yet to come, but none were happy with the American response.",
    "Trumps own response to the invasion has made it safe for Republicans to take his approach: a combination of praise for Putin taking advantage of the situation and condemnation of how President Biden responded.",
    "The Interior Department will resume selling oil-and-gas leases on federal lands but raise the fees companies must pay on what they produce, the agency said Friday afternoon,? Axioss Ben Geman reports.",
    "Voters and news consumers have moved on to other topics, worries about inflation and crime have surpassed interest in the war, and neither Democrats nor Republicans have an interest in changing that.",
    "When people stop fearing that a war could escalate and put them at risk  and when they have plenty else to worry about  they might have strong opinions, but not let them determine their vote.",
    "Their land was parched by record-breaking drought, neglected by a pandemic work shortage, scarred by recent wildfires, and now also connected in its own unique way to a war across the world.",
    "The most frequent coverage topic was the sinking of a Russian missile cruiser; the most-covered story the rest of the week was the pursuit and capture of the New York City subway shooter.",
    "In Ohio, that was state Sen. Matt Dolan, a fellow Republican, going after Vance for saying that he didnt really care what happens to Ukraine? in an interview days before the invasion.",
    "Today, the White House is taking aim at a tax plan unveiled by Sen. Rick Scott (R-Fla.) that would result in an increase in federal income taxes for roughly half of Americans.",
    "More key updates:\nEd Butcher, 78, looked out the window at miles of open prairie, where the wind rattled against their barn and blew dust clouds across Butcher Road.",
    "headquarters, amassing more than $120 million  a war chest more than double that of the Republican National Committee itself,? the NYT's Shane Goldmacher reports.",
    "Democrats win elections when we show we understand the painful economic realities facing American families and convince voters we will deliver meaningful change.",
    "The point Vance was making, that the war was crowding out news with more relevance to ordinary Americans, was arguable in early March but not true by mid-April.",
    "A look at Google search terms sums it up  Ukraine was the most-searched-for topic in America from Feb. 23 to March 21, when it was surpassed by covid-19.",
    "Over two months, just a handful of candidates have centered Ukraine in their messaging, usually to criticize an opponent for sounding too warm to Russia.",
    "The strike last Wednesday marked a major boost for Ukraine.? Our colleagues explain how the strike shows strength of Ukraines homegrown weapons.",
    "In a new YouGov poll, 44 percent of them said that affairs in Ukraine matters a lot? to America; more said it mattered a little? or not at all.",
    "People want toughness and strength, but they dont want to be world policemen,? said Andy Surabian, a Republican strategist working with Vance.",
    "A debate moderator had asked about the Russian invasion, and two other Republican candidates had just talked about how to help Ukrainians.",
    "It was the second mass shooting in the state and the third in the nation during the Easter holiday weekend,? the Associated Press reports.",
    "Eds family had been on this land since his grandparents homesteaded here in 1913, but rarely had life on the ranch felt so precarious.",
    "The taxes paid amount to an effective tax rate of 24.6 percent on $610,702 of adjusted gross income,? Roll Calls David Lerman reports.",
    "President Joe Biden and his wife paid $150,439 in federal income taxes for 2021, according to their joint tax return released Friday.",
    "defense official said Ukrainian forces used Neptune missiles to strike and sink Russias flagship Moskva war vessel in the Black Sea.",
    "But two months after Russian forces crossed Ukraines border, the war has taken up less and less of the campaign conversation.",
    "Last week, the war was the lead story most of the time on the three traditional evening news broadcasts, on CBS, NBC and ABC.",
    "There are so many civilians that theyre training on the fly to be warfighters,? added former state Treasurer Josh Mandel.",
    "Authorities in South Carolina are investigating a shooting at a nightclub early Sunday that wounded at least nine people.",
    "Within a month, her numbers had recovered, securing her a spot in the competitive runoff with President Emmanuel Macron.",
    "I think what we need to do is arm em to the teeth,? said Mike Gibbons, an investment banker at the WLWT5 debate.",
    "The simplest explanation is that it has moved down their list of concerns, and theyre not alone in that.",
    "But for a while in the 1920s, everybodys tax payments were public records for all to see.",
    "And the richest Americans were not happy about it,? Ronald G. Shafer writes.",
    "The week before Donald Trump endorsed his U.S. Senate campaign in Ohio, J.D.",
    "It started to wane in mid-March, when Kyiv didnt fall to Russian invaders.",
    "He doesnt care about you,? McCrory said at a televised debate this week.",
    "(Days before the invasion, shed said that it probably wouldnt happen.)",
    "Campaigns have engaged even less with the matter than voters.",
    "Bidens soft approval ratings have helped with that argument.",
    "Voters, in the same period, were drifting to other topics.",
    "writes for the New York Times's opinion section.",
    "Not every candidate would put it like that.",
    "He doesnt care about North Carolina.",
    "Vance picked a fight about Ukraine.",
    "Since 2005, Texas Govs.",
    "U.S."
  ]
}