{
  "id": 6318,
  "mediaId": 65,
  "date": "d2022-04-18T10:30",
  "headline": "JD Vance highlights Trump endorsement with new TV ad in Ohios GOP Senate primary showdown",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/467ae1c2-5db3-4e21-bd1a-ac620757c241/101be32c-22d9-47e5-abbf-89d04e5623d2/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/vance-highlights-trump-endorsement-new-tv-ad-ohio-gop-senate-primary",
  "sentiment": "0.963",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    1054,
    1115,
    1147,
    1801,
    2087,
    3103,
    428,
    571,
    2845
  ],
  "sentences": [
    "FOLLOWING TRUMP ENDORSEMENT, OZ AND MCCORMICK TRADE JABS IN PENNSYLVANIA GOP SENATE PRIMARY BATTLE\nTrump endorsed Vance on Friday afternoon, saying in a statement that \"in the great state of Ohio, the candidate most qualified and ready to win is J.D.",
    "\"This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race  they've said some great things about Trump and, like me, they love Ohio and they love our Country,\" the former president added.",
    "The others were 2018 Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer and investment banker; former Ohio treasurer and former two-time Senate candidate Josh Mandel; and former Ohio GOP Chair Jane Timken.",
    "Rob Portman, on Monday will launch a new ad blitz across Ohio to make sure Republican voters know hes now backed by Trump, who 15 months removed from the White House remains the most popular and influential politician in the GOP.",
    "Vances campaign tells Fox News theyre spending half a million dollars to run the ad statewide on broadcast and cable TV, and that the spot is part of a new seven-figure ad buy for the final two weeks of the primary campaign.",
    "TRUMP TAKES SIDES IN OHIO'S COMUBSTIBLE REPUBLICAN SENATE PRIMARY\nThe ad, which was shared first with Fox News on Monday, touts Trumps endorsement right off the top.",
    "FIRST ON FOX: In a Republican Party still very much dominated by Donald Trump, candidates who land the former presidents endorsement almost immediately showcase it.",
    "Another major candidate, state Sen. Matt Dolan, a former county chief assistant prosecutor and state assistant attorney general, was not seeking Trumps backing.",
    "is the conservative outsider who will continue Trumps fight to secure our borders, protect the unborn, get rid of the corrupt politicians, and stop Joe Biden.\"",
    "Vance will team up in person with Trump in five days, as the former president holds a rally in Ohio at the Delaware County fairgrounds on Saturday, April 23.",
    "Vance is doing in Ohios crowded, contentious and expensive GOP Senate nomination race, with just 15 days to go until primary day in the Buckeye State.",
    "But he said that Vance was the candidate best equipped to defeat longtime Rep. Tim Ryan, whos likely to win the Democratic Senate nomination.",
    "And the nomination battle turned increasingly negative, with the candidates and outside groups backing them attacking each other.",
    "Vance, the venture capitalist and bestselling author whos one of the major contenders in the battle to succeed retiring GOP Sen.",
    "The leading candidates other than Dolan for months tried to one up each other in showcasing their support and loyalty to Trump.",
    "Vance  Marine, author of Hillbilly Elegy, President Trumps endorsed America First conservative,\" the narrator stresses.",
    "Vance was one of four major candidates who lobbied hard to land the former presidents endorsement.",
    "Things turned so heated that Gibbons and Mandel nearly came to blows at a recent debate.",
    "The spot ends by Vance saying to the camera, \"Trump fought back, and so have I.",
    "Thats followed by the narrator emphasizing that \"J.D.",
    "Now Ill take our fight to the U.S.",
    "And thats exactly what J.D.",
    "It is all about winning!\"",
    "We cannot play games.",
    "Senate.\"",
    "Vance.",
    "\"J.D."
  ]
}