{
  "id": 6319,
  "mediaId": 195,
  "date": "d2022-04-18T10:26",
  "headline": "The Hills Morning Report  Will Trumps Ohio gamble pay off?",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/04/mr_trumpdonald_022120ap-evan-vucci.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/morning-report/3271453-the-hills-morning-report-will-trumps-ohio-gamble-pay-off/",
  "sentiment": "-0.383",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    946,
    1147,
    1801,
    3103,
    4528,
    4773,
    571,
    2537,
    2834,
    2845,
    2862
  ],
  "sentences": [
    "But frankly, well negotiate what we have to in order to secure a chance to move forward and not waste the vital vaccines America has already purchased,? Coons told CBSs Face the Nation.?\ng Mask mandates are back on college and university campuses and today a mask requirement returns to Philadelphia (The Hill), although a new lawsuit filed on Saturday by businesses and residents seeks to overturn it in the City of Brotherly Love (The Associated Press).",
    "North Carolina pros enlisted by the White House needed two days of preparation to hard-boil 18,000 eggs, then five days of dyeing and decorating 14,000 of them (4,000 are left undyed so children can decorate them), according to Andrew McMillan, executive chef with Winston-Salem company Stocked Pot Fun Culinary Events, which partnered with the states Braswell Family Farms, donor of the eggs (Fox8).",
    "LEADING THE DAY\nUKRAINE CRISIS: The port city of Mariupol in eastern Ukraine is on the verge of falling to Russian forces after weeks of war, while the western city of Lviv saw six people killed and at least 11 injured today after a rare Russian missile strike on the outskirts of a train complex, which appeared to also hit Ukrainian military infrastructure (The New York Times).",
    "IN FOCUS/SHARP TAKES\nCORONAVIRUS:  The White House and Democrats are using the congressional spring break to publicly pressure GOP lawmakers to return to Washington after April 25 ready to holster partisan disagreements over approving more federal funding for COVID-19 vaccines, treatments and pandemic readiness at a time when infections are spiking again in some regions.",
    "Ukrainian Foreign Minister Dmytro Kuleba predicted during a CBS interview on Sunday that his country would likely see intensification of heavy fighting in eastern Ukraine, in Donbas, [a] large-scale offensive of Russia in that part of Ukraine and also desperate attempts of the Russian forces  to finish with Mariupol at any cost.",
    "? INTERNATIONAL: North Korea test-fired a new type of tactical guided weapon designed to boost its nuclear fighting capability, state media reported Sunday, a day before its chief rivals the United States and South Korea begin annual drills that the North views as an invasion rehearsal (The Associated Press).",
    "Capturing Mariupol would be a significant advance for Russian President Vladimir Putin, who has labored since February to control Ukraines southeastern coast, complete a land bridge to occupied Crimea and refocus more Russian forces toward a pivotal battle in the east (The New York Times).",
    "Nevertheless, Trump has made like Kenny Rogers and wagered his lot on the likes of Mehmet Oz, Rep. Ted Budd (R-N.C.) and Vance, with potential endorsements still to come in Missouri and Arizona, in a bid to further cement his title as the uncontested kingmaker in Republican politics.",
    "It would signal that Trump doesnt have an open door to the nomination in 2024 if that nomination has to run through Ohio,? Matt Dole, an Ohio-based GOP political consultant, told The Hill of the possibility the Hillbilly Elegy? author does not win the primary.",
    "President Biden returned to the White House Sunday from Camp David encouraged by some in Ukraine and elsewhere to travel to Ukraine, which has eagerly welcomed a collection of world leaders in-person, including British Prime Minister Boris Johnson (The Hill).",
    "During a Sunday night address, Zelensky warned that Russians in southern Ukraine abduct representatives of local governments and anyone deemed visible to local communities,? and use torture and terror as weapons of war in violation of international norms.",
    "I think hes taking a pretty big risk,? one Ohio GOP operative told the Morning Report, pointing to a recent internal poll that showed Vance trailing Mandel by 13 points (24 percent to 11 percent) and that 30 percent of the primary electorate is undecided.",
    " And of course, missile attacks on Kyiv and other cities across Ukraine.?\nRussias military announced that Mariupol today will be closed for entry and exit, warning that men remaining in the city would be filtered out,? according to Mariupols mayor.",
    "? TECH: Elon Musk, fresh off his purchase of 9 percent of Twitter, argued over the weekend that the economic interests of the companys board are not aligned with shareholders following the companys move to fight off his takeover attempt.",
    "The White House has information about todays ticketed event HERE (the lottery for tickets ended March 31), and the White House Historical Association offers background info and virtual games and activities tied to the event HERE.",
    "The president, first lady Jill Biden, Vice President Harris and second gentleman Doug Emhoff will participate during the White House Easter Egg Roll at 10:15 a.m. Biden will receive the Presidents Daily Brief at 1:45 p.m.",
    "Unlike Budd, who leads the North Carolina primary, and Oz, who is neck-and-neck with David McCormick in Pennsylvania, Vance has struggled to take off in the Buckeye State, though he has made headway in recent weeks.",
    "Before most votes are even cast, Trump has already shown a willingness to cut loose a candidate he deems to be not up to snuff as he remains ever-mindful of his successes and failures in wading into these races.",
    "g International: In Shanghai, the first signs of easing a weeks-long lockdown are expected on Wednesday as officials seek to halt the spread COVID-19 outside of quarantined areas with infected Chinese citizens.",
    "To be on the South Lawn of the White House and at a historic event that has been happening since 1879 with President Rutherford B. Hayes, its really really cool,? Hicks said, showing off his PR skills (WTOK).",
    "Russias use of nuclear weapons is not out of the question and Ukraine and its allies must be prepared, Zelensky said, adding that his countrys military casualties total at least 3,000 so far (The Hill).",
    "The billionaires comments came in response to a tweet about board members stock holdings, noting that Jack Dorseys departure means the board collectively owns almost no shares? (Bloomberg News).",
    "In recent months, the ex-president has already been burned by Rep. Mo Brooks (R-Ala.), who he unendorsed last month after a lackluster performance in polling, and Sean Parnell in Pennsylvania.",
    "Former President Trumps hold on the Republican Party will be under close examination in the coming weeks after his leap into key Senate GOP primary contests, including his endorsement of J.D.",
    "President Volodymyr Zelensky of Ukraine, interviewed by CNN and the BBC, said the situation in Mariupol is inhuman? and that additional Russian war crimes would make negotiations impossible.",
    "Those in quarantine and disease containment centers in Shanghai centers describe prison-like conditions where lights are never off and hot showers are hard to come by (The Associated Press).",
    "Reuters: Zelensky said Sunday he spoke with International Monetary Fund Managing Director Kristalina Georgieva about Ukraines financial stability and the countrys post-war reconstruction.",
    "ELSEWHERE\n? ABORTION: The Hills John Kruzel looks ahead at three big cases dealing with immigration, policing and prayer in schools as the Supreme Court wraps up oral arguments this term.",
    "The White House daily press briefing is scheduled at 4 p.m.\ng Hill.TVs Rising? program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    "Visitors will not be required to be vaccinated or wear a mask during todays event; the White House will provide masks when requested and hopes anyone who feels sick will remain at home.",
    " Advocates interested in banning all new uses of asbestos say the Environmental Protection Agencys limits on asbestos are not enough and still pose a legacy? human hazard (The Hill).",
    "Lending both hands to get the whole affair organized is Caleb Hicks, the communications director for the Alabama Poultry and Egg Association, who arrived in Washington on Thursday.",
    "The holiday gathering of some 30,000 adults and children would not be possible without help from egg-spert volunteers, who hail from various states, according to recent reporting.",
    " It all seems like a steep climb to me, but somehow, the president decided to do it.?\nThis could be the beginning of the end for the Trump endorsement magic,? the operative added.",
    "That may include a nuclear test in an effort to expand the countrys arsenal and increase pressure on Washington and Seoul while denuclearization talks remain stalled.",
    "Harris will get briefed at the Combined Space Operations Center on the base at 3:15 p.m. PDT and meet with service members and their families at 4:30 p.m. PDT.",
    " The Hills Hanna Trudo explores whether Democratic candidates in November could be politically rescued if the Supreme Court overturns Roe v. Wade this summer.",
    "How his choices turn out will gauge his own standing with GOP primary voters  who could determine whether Trump should be the partys nominee for a third time.",
    "THE CLOSER\nAnd finally  g? Today, the White House Easter Egg Roll is back after a two-year COVID-19 hiatus that sidelined the popular South Lawn tradition.",
    "A counter proposal for $15.6 billion to be included in the omnibus spending bill was cut out before the measure passed, leaving the issue up in the air.",
    "The rift between the parties is over whether to approve new funds that enlarge the deficit or reprogram previously appropriated but unspent dollars.",
    "The association, which raises money to help preserve the White House and its furnishings, also sells a commemorative 2022 wooden Easter egg HERE.",
    "The wounded included four people working for the chef Jos Andrss World Central Kitchen, which provides humanitarian meals in and around Ukraine.",
    "Dates to remember: Ohio GOP primary on May 3; Pennsylvania and North Carolina GOP primaries on May 17; Alabama and Georgia primaries on May 24.",
    "The Hills Alexander Bolton reports the former presidents endorsement of Vance is perhaps the riskiest bet if Trump is seeking to crown winners.",
    "Before Trumps announcement, former Ohio Treasurer Josh Mandel led with 28 percent to Vances 23 percent, according to a Trafalger Group survey.",
    "Harris will address a fundraiser hosted by the Democratic National Committee in L.A. at 8:10 p.m. PDT and remain overnight in California.",
    "The White House has been weighing for days whether to send a senior administration official to Ukraine, and, if so, whom it should be.",
    "Senate races in Pennsylvania, Ohio, North Carolina and Alabama all feature high-profile candidates who support the presidents agenda.",
    "https://bloom.bg/3vpkx5R\nDisney didnt leave the GOP behind  culture did, by Derek Robertson, opinion contributor, Politico Magazine.",
    "Ashish Jha, the new White House coronavirus coordinator, used his Sunday talk show appearances to spread that message (The Hill).",
    "The vice president will deliver remarks at 5:15 p.m. about establishing norms for space, then depart Vandenberg for Los Angeles.",
    "Morning Report journalists Alexis Simendinger and Al Weaver can be reached at asimendinger@thehill.com and aweaver@thehill.com.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Reuters: Ukraine asks the Group of Seven most developed nations to provide $50 billion to help staunch Ukraines red ink.",
    "All of this requires greater speed from Western countries in preparing a new, powerful package of sanctions,? he said.",
    "The International Monetary Fund and the World Bank convene their annual meeting in Washington, which ends on April 24.",
    "The masking message in other U.S. cities is all about individual choice and risk tolerance (The Wall Street Journal).",
    "Subscribe to The Hills latest newsletters: ?NotedDC, The Hills insider take on the heartbeat of politics and policy.",
    "Parnell, who has since endorsed McCormick, dropped out of the Keystone States Senate contest amid a custody battle.",
    "The president urged allied nations to tighten punishments against Moscow aimed at its energy industry, AP reported.",
    "Secretary of State Antony Blinken willmeet at 3:30 p.m. with Moldovan Foreign Minister Nicu Popescu in Washington.",
    "The 13th weapons test this year came amid concerns that North Korea may soon conduct an even larger provocation.",
    "Current average U.S. COVID-19 daily deaths are 399, according to the Centers for Disease Control and Prevention.",
    "A local Communist Party official said in a speech over the weekend that coronavirus testing must be accelerated.",
    "Russia warned on Sunday that Ukrainian fighters in Mariupol would be eliminated? if they do not first surrender.",
    "? ADMINISTRATION: IRS: ?Most Americans have until midnight tonight to file their 2021 tax returns (USA Today).",
    "did the same, arguing that millions of COVID-19 vaccine doses will expire without federal funding (The Hill).",
    "Biden initially asked lawmakers for another $22.5 billion, which did not pass muster with Senate Republicans.",
    "The country is running a $5 billion deficit per month, according to its prime minister (The Washington Post).",
    "OPINION\nChinas zero covid? has become Xi Jinpings nemesis, by Niall Ferguson, columnist, Bloomberg Opinion.",
    "Total U.S. coronavirus deaths reported as of this morning, according to Johns Hopkins University: 988,618.",
    "The vice president and Emhoff will fly to California to visit Vandenberg Space Force base this afternoon.",
    "Mandels supporters made a last-minute and unsuccessful effort to discourage Trumps thumbs-up for Vance.",
    "Most are confined to their homes and have been challenged for weeks to obtain food and prescriptions.",
    "Businessman Mike Gibbons and state Sen. Matt Dolan followed with 14 and 12 percent, respectively.",
    "The Hills Rebecca Beitsch and Axios report why Finland and Sweden suddenly want to join NATO.",
    "Trump is betting that he can move almost half the undecided vote to put Vance over the top.",
    "Reuters: Russia today claimed massive strikes overnight against Ukrainian military targets.",
    "https://politi.co/3JR9ibF\nWHERE AND WHEN\nThe House meets for a pro forma session at 1 p.m.",
    "The Associated Press: Wisconsin Democrats aim to beat Sen. Ron Johnson (R-Wis.), but how?",
    "Only in recent days have some supermarkets and mass transit stations reopened (Reuters).",
    "Reid Wilson, The Hill: Republican governors sprint right, eyeing reelection and 2024.",
    "Plus, gEvening Report, The Hills roundup of major news from morning, noon and night!",
    "The Associated Press: Mariupol teeters as Ukrainians defy surrender-or-die demand.",
    "The Hills Alexis Simendinger and Al Weaver are co-creators of the Morning Report.",
    "Niall Stanage: The Memo: RNCs break on debates nudges nation toward factionalism.",
    "In Kharkiv on Sunday, Russian forces fired on civilian areas for the second day.",
    "The Washington Post: Sarah Palin (also Trump-endorsed) is running for Congress.",
    "The Wall Street Journal: Russia has started a new phase of war against Ukraine.",
    "The Chinese lockdown has frustrated people in a city of 26 million residents.",
    "On Sunday, the citys remaining inhabitants refused (The Associated Press).",
    " State courts arethe battleground in the abortion access fight (The Hill).",
    "And many people, especially in southern Ohio, feel like Vance is a fraud.",
    "The New York Times: Mar-a-Lago machine: Trump as a modern-day party boss.",
    "Max Greenwood, The Hill: GOP shadow primary gains steam ahead of 2024.",
    "The Hill: Democrats prepare to take second run at Biden spending plan.",
    "Nevertheless, the former president is rolling the dice with Vance.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The Senate convenes for a pro forma session at 4 p.m.",
    "The Washington Post: Biden may hug the Easter Bunny.",
    " Associated Press / Patrick Sison | Tax filing day.",
    "I think we should treat this as emergency spending.",
    "Can Trump pick winners when not on the ballot?",
    "Votes are not scheduled until after April 26.",
    "Also, check out the Rising? podcast here.",
    "Senators are in recess until April 25.",
    "Many Alaskans say they are skeptical.",
    "Biden ally Sen. Chris Coons (D-Del.)",
    "Send us a message and/or SUBSCRIBE!",
    "Vance in Ohio late last week.",
    "g Good Monday morning!",
    "Schedule is HERE.",
    "SIGN-UP is here!",
    "ET."
  ]
}