{
  "id": 6322,
  "mediaId": 239,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Hillbilly to Capitol Hill? Author eyes Senate bid in Ohio",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/04/16/senate_ohio_vance_87465_c0-745-2236-2048_s885x516.jpg?e49c28e830c8e2b32f40874a110580fc68a9a5fd",
  "link": "https://www.washingtontimes.com/news/2021/apr/16/hillbilly-to-capitol-hill-author-eyes-senate-bid-i/",
  "sentiment": "0.433",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DAN SEWELL",
  "authorUrl": "",
  "termIds": [
    1115,
    1632,
    1801,
    3103,
    4889,
    571,
    2609,
    2845,
    4945,
    5059
  ],
  "sentences": [
    "His bestselling book told not only his own story but also highlighted the people of Appalachia and cities like his hometown that feel left behind, and it was embraced by small-government conservatives for depicting poverty as a cultural problem not easily fixed by government programs and aid.",
    "Muterspaw, 52, splashed some almond milk into his dark-roast coffee at Java Johnnys, among the trendy restaurants and retail shops that have been popping up along Central Avenue - where there still are some of the We Buy Gold? storefronts that sprang up during the Great Recession.",
    "At a forum on Desegregating Poverty,? hosted by veteran civil rights activist Robert Woodford, he argued that addressing the problem of fatherless families, regardless of race, and focusing on the kind of stable home life he lacked are crucial to socioeconomic progress.",
    "However, hundreds of thousands of more people in cities such as Columbus, Dayton and Middletown have Appalachian roots from parents and grandparents who migrated north for once-plentiful factory jobs available to workers without college degrees.",
    "I think that hes noxious and is leading the white working class to a very dark place.?\nHowever, Anirudh Ruhil, who teaches government analytics at Ohio University, nestled in Appalachian southeast Ohio, thinks Vance can overcome that.",
    "I just wish that we could actually look at people as people, and if we did that, I think wed have a much better sense of what their real problems are,? said Vance, who lives in Cincinnati with his wife, Usha, and their two sons.",
    "At Richies Pawn Central - in business since the early 1950s, though Vance mistakenly wrote it had long since closed? - sales employee Terry Stephens grumbled that the federal stimulus checks have slowed down the pawn business.",
    "This week he resigned from the board of a Kentucky company, AppHarvest, that uses green technology to produce food in Appalachia, but on Friday he denied it was because of fallout from the controversial tweets.",
    "A yearlong lockout of 2,700 workers that began in 2006 underscored that the companys patriarchal days of having a park, sports teams and a golf course for workers and their families here were long past.",
    "He joined the Marines, served in Iraq, worked his way through The Ohio State University and graduated from Yale Law School before heading to Silicon Valley in 2014, then returning to Ohio in 2017.",
    "But other Republicans are hardly clearing the field, and Vances success is likely to hinge on whether the states white working-class voters embrace him as a home-state hero or an opportunist.",
    "He became a popular TV political commentator, dubbed the Trump whisperer? for his ability to explain the Republicans rise to the presidency, and his book became a Ron Howard-directed movie.",
    "Vance rose out of a family beset by chaos from his mothers addictions; from a mill town that was in steep decline and ravaged by opioids as its major employers faltered amid globalization.",
    "Part of the Appalachian code warns against getting too big for your britches.? Some think Vance has, perpetuating backward regional stereotypes while making his millions in Silicon Valley.",
    "Thiel arranged and attended the meet-and-greet at Trumps Mar-a-Lago resort, according to a person familiar with the meeting who spoke on condition of anonymity because it was private.",
    "In the battle to win Trumps backing, GOP foes are likely to highlight Vances past criticisms of Trump, such as in a 2016 NPR interview in which he said: I cant stomach Trump.",
    "Vance, the Hillbilly Elegy? author and a fellow Middletown native, broke out of poverty and family chaos and never forgot his Appalachian roots on his way to success.",
    "Trump rode their support in two sweeping victories in Ohio, and you can still find Trump flags, banners and yard signs left in place by diehards around the region.",
    "Im a Democrat.?\nThe GOP field already includes two candidates with statewide networks - former state party chair Jane Timken and former Ohio Treasurer Josh Mandel.",
    "Hes a different kind of conservative who understands the Trump base and identifies with the Trump base, and hes positioned very uniquely to do that,? Forren said.",
    "Now a venture capitalist, he already has a billionaire backer supporting him and, despite previous criticism of Trump, has met with the former president.",
    "Former investment banker Mike Gibbons of Cleveland joined the race April 13, after Cleveland businessman Bernie Moreno announced his candidacy April 6.",
    "Billionaire entrepreneur Peter Thiel, an early mentor and employer of Vance, gave $10 million to a super PAC formed to encourage his Senate candidacy.",
    "A Republican with mixed feelings about Trump, Muterspaw thinks Vance has the Trump-like ability to connect with GOP voters and a relatable life story.",
    "Just before Easter, Vance posted a lengthy essay on his spiritual journey from Christian evangelical roots into atheism and then to becoming Catholic.",
    "They looked under Vance, which was his Papaws? family name he took for himself in adulthood, and also under Bowman, his biological fathers last name.",
    "A woman answering the door at the two-story home where he spent much of his childhood across from Miami Park had no idea Vance had ever lived there.",
    "Its just shameful,? Ted Strickland, a Democratic native of southern Ohio who served as governor and congressman, said in a recent radio interview.",
    "I think he can talk in a way that the average person can understand,? said the retired police chief, who, like Vance, has eastern Kentucky roots.",
    "His hillbilly roots, as he puts it, will certainly help him out.?\nAssociated Press writer Jill Colvin in Washington contributed to this report.",
    "Vance is someone that, I feel, has purposely used poor people and the people of Appalachia and even his own family to promote his own image.",
    "With his 2016 book, Vance helped explain to the nation Donald Trumps popularity among the white Appalachian working class of his upbringing.",
    "John Forren, a Miami University political scientist in Vances native Butler County, said he thinks Vance has a potentially winning appeal.",
    "Strickland supports Democratic U.S. Rep. Tim Ryan, who represents the northeastern part of Appalachian Ohio and is readying a Senate run.",
    "He stirred up Twitter last week with a defense of Fox News Tucker Carlson, accused of using white supremacist rhetoric about immigrants.",
    "Life in Middletown, with nearly 49,000 people, long revolved around the Armco Steel company that became AK Steel during Vances youth.",
    "The basic thinking was: Im going to keep speaking my mind, and Id rather do that unconstrained by the demands of a public board.",
    "Tucker Carlson is the only powerful figure who consistently challenges elite dogma - on both cultural and economic questions.",
    "Thirty-two of Ohios 88 counties are classified as Appalachian, with roughly 2 million residents in a state of 11.7 million.",
    "It was once known nationally for Jerry Lucas, a 1950s Middie? high school standout who went on to college and NBA stardom.",
    "Now at 36, the bestselling author is considering whether he can win the votes of the people he claims to know so well.",
    "Vance says hes thinking seriously? about running for the Senate seat that Republican Rob Portman is vacating in 2022.",
    "Im a hillbilly, and I understand him 100%.?\nMuterspaws view is at the heart of the fiercest political debate in Ohio.",
    "Lyndon B. Johnson in 1964 was the last Democratic presidential candidate to carry Butler County, home of Middletown.",
    "Among them is 10-term Rep. Mike Turner of Dayton, who shares Breathitt County, Kentucky, family roots with Vance.",
    "Vance has been active on Twitter, criticizing the ruling class,? immigration policy and Big Tech censorship.",
    "Among others, he quoted Saint Augustine and Jules, the Pulp Fiction? hit man played by Samuel L. Jackson.",
    "But in interviews and tweets, hes signaled his interest in the culture war issues popular in the GOP.",
    "Staffers at Middletown High School had trouble finding Vance in the 2003 yearbook, his senior year.",
    "He expects his Christian faith to help guide his policies for those who are struggling in life.",
    "Hes smart and hes done a lot of things, but Im a minority in this town,? Stephens said.",
    "Looming over the race is Trump - and his coveted, but not yet secured, endorsement.",
    "The former president has met with several of the Ohio contenders, including Vance.",
    "In December, Appalachian authors presented a program titled Dont Cry For Us, J.D.",
    "They finally found James Hamel, the last name of a stepfather who adopted J.D.",
    "While Vance is making up his mind, the GOP primary field continues to grow.",
    "And I thought the company would be better off too,? Vance said via Twitter.",
    "Vance is going to be the Trump in 2022 for Portmans seat,? he predicted.",
    "Vance didnt respond to an interview request from The Associated Press.",
    "Middletown is about 30 miles (48 kilometers) northeast of Cincinnati.",
    "Vance has already shown hes got what it takes to be a U.S. senator.",
    "Vance.?\nMeanwhile, political foes are skeptical about his motives.",
    "Vance has helped put Middletown back on the map,? Muterspaw said.",
    "But Vance is not expected to have trouble raising money.",
    "He said he didnt expect to vote for Vance to be senator.",
    "early in his mothers series of husbands and boyfriends.",
    "MIDDLETOWN, Ohio (AP) - Rodney Muterspaw figures J.D.",
    "?I think he has a good chance if he decides to run.",
    "That is why they try to destroy him,? Vance wrote.",
    "Several U.S. House members are considering a run.",
    "He said his decision predated them.",
    "Right now, J.D."
  ]
}