{
  "id": 6325,
  "mediaId": 19,
  "date": "d2022-04-18T00:00",
  "headline": "Ohio Republican J.D. Vance Highlights Trump Endorsement in Latest Ad",
  "image": "https://media.breitbart.com/media/2022/04/AP21183828334156-640x480.jpg",
  "link": "https://www.breitbart.com/midterm-election/2022/04/18/ohio-republican-j-d-vance-highlights-trump-endorsement-latest-ad/",
  "sentiment": "0.665",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    1147,
    1801,
    2027,
    2087,
    2466,
    3103,
    428,
    2845
  ],
  "sentences": [
    "Trump added, Hes strong on the Border, tough on Crime, understands how to use Taxes and Tariffs to hold China accountable, will fight to break up Big Tech, and has been a warrior on the Rigged and Stolen Presidential Election.?\nIn response to Trumps endorsement, during an appearance on Breitbart News Saturday this past week, Vance called it hugely important and powerful.? When explaining that his campaign was going very well? in the tight? race, he labeled the endorsement an incredible boost for us coming down the stretch.?\nSo I felt confident before we got the endorsement.",
    "Vance,? then cuts to a narrator who explains that Vance is the conservative outsider that will continue Trumps fight to sure our border, protect the unborn, get rid of the corrupt politicians, and stop Joe Biden?:\nWatch:\nJ.D.",
    "Vance will reportedly appear with Trump in person next weekend, on April 23, at the Delaware County fairgrounds, when the former president holds a rally ahead of the Republican primary on May 3.",
    "I think, frankly, if we were 20 points behind, we probably still win, but were going to win this thing now,? Vance said, discussing how he will win in November against the Democrat candidate.",
    "Now, Ill take our fight to the U.S. Senate.?\nTrump endorsed Vance Friday, beating out the rest of the Republican primary field: Mike Gibbons, Josh Mandel, Jane Timken, and Matt Dolan.",
    "Vances campaign has put half a million dollars behind the ad to run statewide on broadcast and cable television, with the primary election only 15 days away, according to Fox News.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent  dangerous because they will have so much money to spend,? Trump wrote in his endorsement last week.",
    "The ad starts by touting the endorsement, as a news anchor says, Donald Trump has officially endorsed U.S. Senate candidate J.D.",
    "Rob Portman in a crowded Republican primary and has now released an ad touting Trumps endorsement, which he received last week.",
    "Vance: Marine, author of Hillbilly Elegy, President Trumps endorsed America First conservative,? the narrator stresses.",
    "Vance, the venture capitalist and bestselling author of Hillbilly Elegy, is running to replace outgoing Republican Sen.",
    "Vance, whom former President Donald Trump endorsed Friday, released an ad highlighting the endorsement.",
    "Write to him at jbliss@breitbart.com or follow him on Twitter @JacobMBliss.",
    "Ive studied this race closely, and I think J.D.",
    "Vance added, Trump fought back, and so have I.",
    "Jacob Bliss is a reporter for Breitbart News.",
    "Ohio Republican U.S. Senate candidate J.D.",
    "Man, I feel very confident now."
  ]
}