{
  "id": 6327,
  "mediaId": 157,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Ukraines nightmare asserts itself in Ohios bitter US Senate race",
  "image": "https://www.rawstory.com/media-library/jd-vance.jpg?id=27686010&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/ukraines-nightmare-asserts-itself-in-ohios-bitter-us-senate-race/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.rawstory.com/u/alex_henderson_alternet",
  "termIds": [
    3103
  ],
  "sentences": [
    "Im concerned about Russias presence in the world.?\nOhio State Sen. Matt Dolan, another Republican who is running against Vance in Ohios GOP U.S. Senate primary, has been vehemently critical of Vances comments about Ukraine  saying, I asked him to apologize on a human level because theres so many Ukrainians who live in the state.?\nVance, Mandel, Dolan, Timken and Gibbons are competing for the U.S. Senate seat presently held by Sen.",
    "Ohio Senate candidate JD Vance in February: \\u201cI gotta be honest with you, I don\\u2019t really care what happens to Ukraine one way or the other.\\u201d #ohsen #ohlegpic.twitter.com/SpdqQKjKmJ\n Shannon Watts (@Shannon Watts) 1650059620\nVance, Jamerson notes, has described recent images of the violence in Ukraine as disgusting? but is also describing the crisis as a distraction.",
    "is not whats going on 6000 miles away.?\nThen, at a campaign stop in Troy, Ohio, Vance declared, I think it is a huge  a catastrophic  mistake for us to get more and more involved in whats going on in Russia and Ukraine, especially when we have our own problems right here at home.?\nRepublican voters in Ohio, however, arent necessarily indifferent to the war in Ukraine.",
    "When Vance was campaigning in Troy, Ohio, a voter asked him if he thought Ukraine was a smokescreen to cover the disasters? in the United States  and he responded, So, I do actually.? And in a Columbus suburb, the Hillbilly Elegy? author said, At the end of the day, the tragedies that we have to care most about as policy makers.",
    "In mid-February  prior to the invasion that Russia forces launched on February 24  Vance told War Room? host Steve Bannon, I got to be honest with you, I dont really care what happens to Ukraine one way or the other.? Since then, thousands of people have been killed in that war; millions of Ukrainians have fled their country.",
    "North Canton, Ohio resident Dee Braden, who is supporting Timken in the primary, told the Journal, America has to continue to be a leader in supporting democracy and freedom.? And Shannon Wannemacher, a Republican voter in Lima, Ohio who is undecided in the primary, told the Journal, Of course we need to be involved.",
    "Vance has been drawing a great deal of criticism for his comments about Ukraine, and journalist Joshua Jamerson  in an article published by the Wall Street Journal on April 16  reports that Russias invasion of Ukraine continues to be a topic in the Ohio U.S. Senate race.",
    "Vance, Mandel, former Ohio GOP Chair Jane Timken and businessman Mike Gibbons have been engaged in a bitter, mudslinging battle to show who is the most MAGA, and the tensions between Vance and Mandel have been especially ugly.",
    "Vance in Ohios 2022 GOP U.S. primary  much to the chagrin of former State Treasurer Josh Mandel and his supporters, who had been imploring Trump not to make that endorsement.",
    "And Vance, according to Jamerson, has tweaked his messaging on Ukraine a bit by trying to sound more sympathetic to Ukrainians while maintaining an America First? tone.",
    "Vance was vehemently critical of Trump during the 2016 election, calling him a racist and warning that he would be terrible for the U.S. if elected president.",
    "The fact that Trump has endorsed Vance over Mandel and the other candidates is ironic in light of how critical Vance was of him in 2016.",
    "On Friday, April 15, former President Donald Trump endorsed Hillbilly Elegy? author J.D.",
    "But Vance has since flip-flopped and now fully embraces the MAGA movement.",
    "The GOP primary election will be held on May 3.",
    "Rob Portman, who is not seeking reelection.",
    "I wish we were seen as more of a leader.",
    "I wish we would do more."
  ]
}