{
  "id": 6329,
  "mediaId": 19,
  "date": "d2022-04-18T00:00",
  "headline": "Breitbart News Daily Podcast Ep. 116: Happy Easter! The Pope Thinks Youre Racist; Guest: Emma-Jo Morris on Dr. Oz, the Trans Agenda, The Big Guy",
  "image": "https://media.breitbart.com/media/2021/11/new_episode_960x540-640x335.gif",
  "link": "https://www.breitbart.com/podcast/2022/04/18/breitbart-news-daily-podcast-ep-116-happy-easter-the-pope-thinks-youre-racist-guest-emma-jo-morris-on-dr-oz-the-trans-agenda-the-big-guy/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Breitbart News",
  "authorUrl": "https://www.breitbart.com/author/breitbart-news/",
  "termIds": [
    1147,
    1653,
    2087,
    3103,
    3760,
    4664,
    571,
    2979,
    2826
  ],
  "sentences": [
    "Vance in the Republican primary for the Ohio U.S. Senate race, Volodymyr Zelensky is trying a new approach to talk the U.S. into war on his behalf, New York City Mayor Eric Adams is blaming everyone but himself for his citys shocking crime wave, and much more is discussed in Alexs opening monologue.",
    "Hosted by Breitbart Editor-in-Chief Alex Marlow, youll hear Alexs take on the big political stories, interviews with various newsmakers, and the Patriot Caller of the Day.?\nSUBSCRIBE for free by clicking your preferred podcast platform below.",
    "Host Alex Marlow begins the show by sharing war stories of his Easter Sunday with three small children before segueing to a breakdown of Pope Francis schizophrenic Holy Week messaging.",
    "Then, while you were enjoying your family, Joe Biden was taking more strides to dismantle our country by ramping up night flights of illegal aliens into your communities.",
    "And finally, Alex and Emma-Jo discuss whether or not The Big Guy? is hiding some dirty Hunter Biden money from the IRS.",
    "The Breitbart News Daily Podcast runs Monday through Friday as a Directors Cut? of the SXM Patriot radio show.",
    "Then, Breitbart News Politics Editor Emma-Jo Morris breaks down the fascinating Pennsylvania Senate race.",
    "Then, she discusses her editorial on a growing rift between the LG? and TQ+? communities.",
    "No wonder his polling is at historic lows, including with Hispanic voters.",
    "Donald Trump endorsed J.D.",
    "Happy Easter!"
  ]
}