{
  "id": 6334,
  "mediaId": 409,
  "date": "4/17/2022 12:00:00 AM",
  "headline": "Thank You for Not Killing Us",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/04/russian-ukraine-war-041522-12.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/thank-you-for-not-killing-us/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jay Nordlinger",
  "authorUrl": "https://www.nationalreview.com/author/jay-nordlinger/",
  "termIds": [
    2030,
    3103,
    3727,
    4460,
    4719,
    4815,
    2744,
    2888,
    2914,
    2942,
    4930
  ],
  "sentences": [
    "If I were to go back to Russia, I would have to completely change my opinion, the way I felt about the war,? Ms. Smirnova said in a recent interview in Amsterdam, adding that returning would be, quite frankly, dangerous.?\nSo she left the Bolshoi, the storied company whose name is synonymous with ballet, with its gilded theaters just blocks from the Kremlin, uprooted her life and moved to Amsterdam, where she joined the Dutch National Ballet.",
    "He immediately got a flight back home to New York, where he is artist in residence at American Ballet Theater, saying he was unlikely to return to Russia if Putin is still president.?\n Mikhail Khodorkovsky noted some Russian journalists and others who have now been branded foreign agents? by the Kremlin.",
    " Euan MacDonald, editor-at-large at The New Voice of Ukraine, circulates a photo and describes it as follows: Hundreds of fresh graves in Irpin, a suburban town near Kyiv that was under occupation for a month by invading Russian forces.?\nA reality, like other realities, to be stared in the face.",
    "Some more from Marshalls report:\nWere going back to the Cold War,? said Ted Brandsen, the artistic director of Dutch National Ballet and Ms. Smirnovas new boss, invoking a time notable for the defections of Soviet dance stars including Rudolf Nureyev, Mikhail Baryshnikov and Natalia Makarova.",
    "To understand the horrors? of the Bucha massacre, Sovsun said, you need to look at his face.?\n Zinaida Makishaiva lives in the aforementioned Borodianka (alternatively spelled Borodyanka?), about 15 miles northwest of Bucha.",
    "One of the Democrats asked him, How can you serve in an administration whose president calls the Soviet Union an evil empire?? Nitze answered, Did you ever consider the possibility that its true??\nYes, it was true.",
    " Julia Davis, the creator of the Russian Media Monitor, circulates a video and comments:\nMore genocidal talk on Russian state TV: pundit agrees that Putins goal is to erase the very idea of being a Ukrainian.",
    "I never thought I would be ashamed of Russia,? she added, but now I feel that a line has been drawn that separates the before and the after.?\nThats certainly been true for Ms. Smirnova, 30.",
    "A lot of people are invested in Putin: as a great, strong leader; a protector of Christian civilization; a manly man; a bulwark against the woke? hordes; a scourge of globalism.? All that.",
    "As the war got worse, and dissent in Russia was ruthlessly quashed, Ms. Smirnova, who had gone to Dubai to recover from a knee injury, realized that she could no longer return home.",
    "Garry Kasparov commented, As is the natural progression of every paranoid dictatorship, anyone with a functioning brain and free will becomes an enemy of the state.?\nVery well put.",
    "They jumped from their Jeeps, combat boots hitting the pavement hard, and ordered the 500 patients and staff of Borodiankas special care home into the courtyard, at gunpoint.",
    "Just days after the invasion of Ukraine, Olga Smirnova, one of Russias most important ballerinas, posted an emotional statement on Telegram, the messaging app.",
    " Inna Sovsun, a member of Ukraines parliament, has circulated a photo of a young man who volunteered for a gruesome task: exhuming corpses from a mass grave.",
    "On the day war began, Alexei Ratmansky, ballets pre-eminent choreographer and a former artistic director of the Bolshoi, was in Moscow rehearsing a new work.",
    "He said to Steve Bannon, I gotta be honest with you, I dont really care what happens to Ukraine one way or another.?\nWell, one can appreciate the honesty.",
    "The subheading is, An ordeal at a mental health facility in Ukraine illuminated the horrors of the Russian occupation in the areas around Kyiv.?\nYes.",
    "He finds even the name, Ukrainians,? to be an insult and sees no reason for that entire nation or nationality to exist outside of Russian? identity.",
    "They will not feel the victory, even when our territories are liberated.?\nI think Zelensky has provided a splendid, inspiring example of leadership.",
    "Is there anyone today  any senator, any other U.S. political leader  who is a champion of Russian democrats, dissidents, and political prisoners?",
    "Top Stories\nI asked him, Were you surprised by the end of the Cold War and the collapse of the Soviet Union?? Yes,? he said forthrightly.",
    "Her daily routines, established since early childhood when she started rural work?, were soon punctured by shelling and missile attacks.",
    "Look at China: The Communist Party maintains tight political control  including over the press  while allowing economic development.",
    "She would never thank Russias president, whom she had called a liar? and a killer.?\nBut she didnt want the soldiers to hurt anyone.",
    "From his prison cell, Vladimir Kara-Murza, the Russian dissident, managed to send a column to the Washington Post via his lawyer.",
    "Russia and ballet go together like America and baseball (or maybe I should say, at this point, the Americas and baseball).",
    "There will be no complete victory for people who lost their children, relatives, husbands, wives, parents,? Zelensky says.",
    "I felt dead, senseless.?\nA bit more:\nThe Russian troops came in three waves, she said, the first being the most violent.",
    " There have been many articles on the question of genocide, where Russias onslaught against the Ukrainians is concerned.",
    "I suppose my bottom line is this: Call it genocide, call it mass murder, call it terrorization, call it a ham sandwich.",
    "Mr. Brandsen said Russian dancers were contacting him daily saying, I cant be myself as an artist in this country.?\nNo.",
    "Zelensky and Ukraine are putting up an old-fashioned fight for freedom and independence  for their very right to life.",
    "We command you to say to the camera, Thank you, Vladimir Vladimirovich Putin, the soldiers demanded of Ms. Hanitska.",
    "One more excerpt, concerning the great Ratmansky:\nMs. Smirnova is not the only high-profile artist to leave Russia.",
    " Anne Applebaum and Jeffrey Goldberg traveled to Kyiv to interview Volodymyr Zelensky, the president of Ukraine.",
    "We thought we were going to be executed,? Maryna Hanitska, the homes director, said in an interview this week.",
    "We have also gone through these discussions where the Syrians, Uyghurs, Rohingyas, and others are concerned.",
    "The report begins,\nThe first sign of trouble was when a squad of Chechen soldiers burst through the gate.",
    "The 82-year-old was not too shaken when Russian tanks first showed up in early March in Borodyanka .",
    "The soldiers pulled out a camera, Ms. Hanitska said, and then barked at her to make everyone smile.",
    "And look what Vladimir Putin, that product of the Soviet Union  indeed, of the KGB  is doing today.",
    "McCain had also been a champion of Boris Nemtsov  murdered within sight of the Kremlin in 2015.",
    "Here is his final paragraph:\nAs Boris Nemtsov liked to say: We can do it.? Russia will be free.",
    "Russians were once told that political development and economic development went hand in hand.",
    " For the New York Times, Alex Marshall has written a fascinating report on Russia and ballet.",
    " Thank You for Not Killing Us.? That is the headline over a report in the New York Times.",
    "Just stop the killing, stop the rape, stop the terror, if you can  and repel the invader.",
    " The head of RT, the big Kremlin propaganda outlet, has been interesting in recent weeks.",
    "One day, Shultz recalled, the great diplomat was testifying before a Senate committee.",
    "One day several soldiers entered her house, demanding that she stay in the cellar.",
    "It is from Borodianka, Ukraine, and is by Jeffrey Gettleman and Oleksandr Chubko.",
    "Two reporters from Reuters, Zohra Bensemra and Joseph Campbell, talked with her.",
    "With several guns in her face, she said, she quickly ran through her options.",
    "So she managed to utter, Thank you for not killing us.?\nAnd then she fainted.",
    "Anyone willing to be loud, for example, about the imprisonment of Kara-Murza?",
    "but then Grad missiles smashed into her home, destroying her chicken coop.",
    "No big nation can exist without control over information,? Simonyan says.",
    "It would be more convenient, for many, if he would just die, or give up.",
    "Remarks such as these occasion a great deal of skepticism, of course.",
    "Some years later, I was talking with George Shultz, in an interview.",
    "But I remember a conversation with Paul Nitze, in the early 1990s.",
    "(Bernard Levin, the great British journalist, was one of the few.)",
    "Antoine has been engaged in the effort to help Ukrainian refugees.",
    "Okay, a question for you: How many Westerners have worked for RT?",
    "Get in the cellar, you old bitch! (the Russian troops said).",
    "I am against war with all the fibers of my soul,? she wrote.",
    "The Cold War had ended and the Soviet Union had collapsed.",
    "More onUkraine\nIn whom do the Reaganite juices still flow?",
    "He wrote an account of this effort  one slice of it  here.",
    "There are good people in this world, doing what they can.",
    "The senator asked Kara-Murza to be among his pallbearers.",
    "Nitze was one of the greatest diplomats in U.S. history.",
    "Obviously, many people resent him, throughout the world.",
    "Here she is, talking about the dangers of a free press.",
    "I told them: Kill me, but I wont go,? said Makishaiva.",
    " John McCain was a champion of Vladimir Kara-Murza.",
    "Vance, the Trump-endorsed Senate candidate in Ohio.",
    "He is a French-born entrepreneur and music critic.",
    "And then Russian troops began to visit every day.",
    "Then he elaborated, in most interesting fashion.",
    "He had particular expertise on the Soviet Union.",
    "Most Americans, I gather, are on Ukraines side.",
    "A neighbour next door was killed by shelling.",
    "He is a graduate of Harvard Business School.",
    "But a free press was disastrous for Russia.",
    "Ive never been so sure of it as I am today.",
    "That doesnt sit well with a lot of people.",
    "He insists on surviving  even prevailing.",
    "Scared doesnt fully describe how I felt.",
    "I hear this echoed in the West as well.",
    " I have a friend named Antoine Leboyer.",
    "Kill me, but I wont go  extraordinary.",
    "She is Margarita Simonyan, notorious.",
    "Some say yes, this rises (descends?)",
    "It is a very interesting interview.",
    "Im proud to know Antoine Leboyer.",
    "Most of the patients were crying.",
    "Will that continue indefinitely?",
    "And some are neutral, like J.D.",
    "Very few had predicted this.",
    "to genocide; others say no.",
    "Same with Ukraine at large.",
    "(This is Simonyan talking.)",
    "I dont particularly care.",
    "He now lives in Munich.",
    "He brought up Nitze.",
    "He refuses to die.",
    "Appeared on RT?",
    "Well, too bad.",
    "Many are not.",
    "Defended RT?",
    "Yup.",
    ".",
    "."
  ]
}