{
  "id": 6336,
  "mediaId": 195,
  "date": "4/17/2022 12:00:00 AM",
  "headline": "Ohio politics: A cesspool of GOP corruption and craziness",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2021/10/jordanjim_102121gn_lead.jpg?strip=1&w=640",
  "link": "https://thehill.com/opinion/campaign/3270977-ohio-politics-a-cesspool-of-gop-corruption-and-craziness/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Albert Hunt",
  "authorUrl": "",
  "termIds": [
    799,
    1126,
    2221,
    3103,
    3833,
    4004,
    428,
    2623,
    2845
  ],
  "sentences": [
    "This case is in a league of its own.?\nWhile a number of Republican officials and lobbyists were charged  one of the lobbyists died by suicide  the central figure is the former GOP Speaker Larry Householder, who allegedly got most of the dark money, undisclosed, and  while taking some for personal use  parceled it out to Republican legislative candidates who won and voted for the bill that bailed out the energy companys nuclear but mainly coal operations and gutted efficiency standards.",
    "Jim Petro, who was a Republican legislator, state auditor and Ohio attorney general says: When I look at these Senate candidates, its not my party.? On corruption he worries that an abundance of power makes the party overconfident.? Gary Abernathy, an influential conservative columnist who lives in Ohio, writes simply that the States Republican party is in absolute chaos.?\nAl Hunt is the former executive editor of Bloomberg News.",
    "Vance, author of the best-selling book Hillbilly Elegy,? about the cultural and social challenges facing poorer working-class whites, was anti-Trump  but flipped and ingratiated himself with claims such as that support for Ukraine is a massive distraction? from the real peril of drug peddlers and prospective Democratic voters illegally coming across the Southern border.",
    "The state supreme sourt, with a Republican chief justice, has repeatedly rejected the current redistricting as in violation of the states constitution; thus, the state legislative primaries wont be held May 3, but later  when the redistricting is resolved.",
    "The most important Ohio Republican in Congress is Rep. Jim Jordan, whom former House Speaker Boehner calls a political terrorist,? and who has been accused of helping to cover up a sex abuse scandal when he was a wrestling coach at Ohio State.",
    "Perennial candidate Josh Mandel likened President Bidens vaccine mandates to the Gestapo.? Mike Gibbons, a wealthy banker gaining in the polls, said the middle class doesnt pay enough taxes, suggesting the rich bear too big a burden.",
    "Its worse in Columbus, where charges in a $61 million bribery case claim a large troubled company, First Energy, paid state legislators to get a sweetheart deal that bailed out the company at the expense of Ohio consumers.",
    "Dark money from special interests is funneled to politicians whose districts are so gerrymandered they are less likely to be held accountable for scandals like First Energy.",
    "Mike DeWine won general praise for his handling of the pandemic, but mandates and shutdowns generated two right-wing challengers; theyll probably split the anti-DeWine vote.",
    "Jordan, with no real opposition, likely will be chairman of the Judiciary Committee  if he doesnt run for Speaker  should the GOP take control of the House.",
    "For almost a quarter century he wrote a column on politics for The Wall Street Journal, then The International New York Times and Bloomberg View.",
    "The leading federal and state elected Republicans have been centrist conservatives  George Voinovich, John Boehner, John Kasich and current Sen.",
    "Going into the May 3 Republican primary to succeed Portman, whos retiring, the top candidates tried to out-Trump one another, with author J.D.",
    "Jordan was an Ohio State wrestling coach when many athletes  including a number of wrestlers  were sexually assaulted by a university doctor.",
    "In the Republican Senate primary, the leading candidates all embrace the lie that the 2020 presidential election was stolen? from Trump.",
    "Recently the university successfully lobbied the Republican legislature against extending the statute of limitations on these offenses.",
    "Jordan still may face an embarrassment: a docuseries, funded by George Clooney, is in the works about the Ohio State sex abuse scandal.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Some longtime conservative and former Republican office holders shake their heads at the corruption and craziness.",
    "Ohio has been a swing state that tilts to moderately conservative Republicans with relatively clean politics.",
    "Today, Ohio politics is a cesspool of corruption, dominated by shady entrenched Republican politicians.",
    "Four years ago, Cliff Rosenberger resigned when under federal investigation for public corruption.",
    "Vance winning the pandering contest Friday with the endorsement of the defeated former president.",
    "He previously served as reporter, bureau chief and Washington editor for The Wall Street Journal.",
    "An independent investigation found that Ohio State officials knew for years and did nothing.",
    "Householder has pleaded not guilty, as has former Ohio Republican party chair Matt Borges.",
    "Ohio Republicans have enhanced this advantage by a series of voter suppression measures.",
    "I havent seen anything like it,? a top FBI investigator told the Columbus Dispatch.",
    "Much of Ohios corruption is fueled by egregiously gerrymandered legislative seats.",
    "At least six wrestlers say Jordan knew about the abuse and didnt do anything.",
    "This is the second Republican House Speaker forced out under a cloud.",
    "Rob Portman, until he lost his political soul to Donald Trump.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "He hosts Politics War Room with James Carville.",
    "Thats the Buckeye State of yesteryear.",
    "The Republican lawmaker denies this.",
    "That investigation is still open.",
    "The cost is more than $1 billion.",
    "Follow him on Twitter @AlHuntDC.",
    "The others tried.",
    "GOP Gov.",
    "J.D."
  ]
}