{
  "id": 6340,
  "mediaId": 157,
  "date": "4/17/2022 12:00:00 AM",
  "headline": "'A sad scramble': GOP hopefuls are paying 'Trump whisperers' for access to him at Mar-a-Lago",
  "image": "https://www.rawstory.com/media-library/trump-s-mar-a-lago-lost-3-million-in-revenue-last-year-report.jpg?id=24734172&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/donald-trump-2657167499/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    1147,
    1609,
    3103,
    3720,
    296,
    428,
    2826
  ],
  "sentences": [
    "With some observers saying Trump is turning his luxury Florida resort into a modern-day Tammany Hall (described by Goldmacher as \"a New York City political machine that endured for nearly two centuries, owed its longevity to its spreading around of patronage\"), the report goes to state that Trump seems satisfied with holding court at his resort and playing kingmaker although there are some concerns he may be betting on the wrong horses.",
    "\"A phalanx of Trump whisperers has emerged with candidates paying them in hopes of lining up meetings, ensuring that he sees damaging research on their rivals or strategically slipping him a survey showing a surge in the polls, even as Trump alumni warn that it is always buyer-beware in the Trump influence game,\" the Times reported.",
    "headquarters,\" the New York Times' Shane Goldmacher reveals that aspiring lawmakers are paying people purporting to be close to the former president for help in getting his endorsement which they hope will boost their candidacies.",
    "According the report, Trump and those around him are profiting from the flood of those seeking access, with Mar-a-Lago having taken in nearly $1.3 million for political events in the hopes of catching the president's eye.",
    "Mr. Moreno has since dropped out, not wanting to divide the pro-Trump vote,\" the Times reported before adding that Trump only got around to making his endorsement for author J.D.",
    "\"How are these people anything other than contestants vying for his approval??\nThe report also notes that meetings with Trump, when they are arranged, don't always go smoothly.",
    "\"In one oft-recounted scene, Mr. Trump pulled several Ohio Senate candidates into a room last year at Mar-a-Lago, where they began verbally attacking one another as he watched.",
    "What was The Apprentice but a sad scramble of people behaving like crabs in a bucket to be lifted out by him?? pointed out Trump biographer Michael DAntonio.",
    "But as he hints repeatedly about a third White House bid, the looming question is whether he can remain a kingmaker if he doesnt actually seek the crown.\"",
    "leader, and then turn on them with little warning,\" the Times is reporting before adding, \"Mr. Trump can be downright stingy.",
    "'Things went off the rails,' said one candidate, Bernie Moreno, who blamed his rivals, not Mr. Trump, for the mayhem.",
    "Though he holds rallies for some candidates, for many his support goes no farther than an email and a $5,000 check.\"",
    "He will listen to the lobbying of senior Republicans, like Representative Kevin McCarthy, the House G.O.P.",
    "\"In many ways, the endorsement chase is a real-life reprisal of Mr. Trumps old reality-television role.\"",
    "In a deep dive into how Donald Trump has turned a Mar-a-Lago bridal suite into a virtual \"shadow G.O.P.",
    "\"Those close to Mr. Trump say he draws gratification from the raw exercise of his power.",
    "Add to that, GOP hopefuls are willing to pay for more direct access, the report claims.",
    "officials and strategists who are grappling with his influence,\" Goldmacher wrote.",
    "\"Republicans who have sought his support and G.O.P.",
    "\"Mr. Trump plainly relishes the power.",
    "Stories Chosen For You",
    "Vance just this week."
  ]
}