{
  "id": 6342,
  "mediaId": 239,
  "date": "4/17/2022 12:00:00 AM",
  "headline": "NRA plans its major national meeting in Houston in May",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/17/BELTWAY_nra_los_angeles_47970_c0-111-3000-1860_s885x516.jpg?2c89c70e4db63767188f0991f2c3f005b1b230e5",
  "link": "https://www.washingtontimes.com/news/2022/apr/17/inside-beltway-nra-plans-major-meeting-may/",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Harper",
  "authorUrl": "https://www.washingtontimes.com/staff/jennifer-harper/",
  "termIds": [
    781,
    1236,
    1801,
    2087,
    3103,
    4461,
    4630,
    4893,
    341,
    2703
  ],
  "sentences": [
    "A headline in the Financial Times announced, Biden signals return to normality on first day as president. Then CNN political analyst Chris Cillizza opined that the single most radical thing that Biden has done in his first 48 hours of being president is act totally and completely normally,? Mr. Lowry continued in a column.",
    "Thousands of dues-paying members and many more law-abiding Americans will gather for the family-friendly event featuring a bigger-than-ever exhibit hall boasting approximately 800 exhibitors, events, receptions and demonstrations,? the organization said in a statement shared with Inside the Beltway.",
    "Yeah, well, a funny thing happened on the way to renewed normality  President Biden has engaged in one bizarre escapade after another as hes crashed his presidency into the rocks of incompetence, tone-deafness, and stubbornly misplaced priorities,? Mr. Lowry said.",
    "Bidens long pedigree, conventional politics, and contrast with Donald Trump suggested that hed bring predictability and calm to the highest reaches of the nations politics,? wrote Rich Lowry, editor-in-chief of National Review.",
    "They can also book the hunt of a lifetime, purchase shooting and hunting accessories, view priceless gun collections and hear some of the most influential, pro-Second Amendment experts in the nation,? the group said.",
    "But there can be happy endings in marriage and family, even in this troubled world where all of our kids  not only do they have to be masked, they have to have guards to guard against guns and drugs in school.",
    "NEWS AND OPINION:\nThe big traditional meeting is on: The National Rifle Association has revealed that its annual gathering will take place May 27 through 29 at a 1.9-million-square-foot venue in Houston.",
    "Teachers no longer want to teach morality, they dont even want to teach patriotism,? Mr. Boone told Terence P. Jeffrey, editor in chief of CNSNews.com, a conservative news organization.",
    "And, now, the casting directors in Hollywood  I think the word is out  if you have a role for an 80-year-old who can still remember his lines, get Pat Boone,? he said.",
    "POLL DU JOUR\n 43% of U.S. adults say there will be a higher rate of inflation six months from now; 60% of Republicans, 49% of independents and 26% of Democrats agree.",
    " 24% overall say there will be the same rate of inflation six months from now; 24% of Republicans, 24% of independents and 26% of Democrats agree.",
    "Wayne LaPierre, CEO and executive vice president of the NRA, calls the gathering an opportunity to celebrate our rights and freedoms.?\nCurious?",
    "He named the business Seven Weeks Coffee? after discovering that at seven weeks gestation, an unborn child is about the size of a coffee bean.",
    "But Ive been speaking out about this a long time, writing 250 articles for WorldNetDaily, NewsMax  but so far Im still here in Beverly Hills.",
    "Its titled The Mulligan: A Parable of Second Chances?  which recounts the story of a man who manages to make a moral comeback in his life.",
    " 14% overall say there will be a lower rate of inflation at that time; 6% of Republicans, 10% of independents and 25% of Democrats agree.",
    " 18% overall are not sure what the rate of inflation will be then; 10% of Republicans, 17% of independents and 22% of Democrats agree.",
    "PRO-LIFE COFFEE\nSeven Weeks Coffee, a Virginia-based e-commerce business, is indeed open for business  and they have distinct calling.",
    "The winner of the May 3 primary is likely to face Rep. Tim Ryan, a Democrat, in November for the seat being vacated by Republican Sen.",
    "Ten percent of each bag of coffee sold  about $1.69  goes directly to pro-life pregnancy centers, according to founder Anton Krecic.",
    "MidwayUSA  a privately held American retailer of hunting and outdoor-related products  will be the official sponsor of the event.",
    "SOURCE: An Economist/YouGov poll of 1,500 U.S. adults conducted April 9-12.\n Follow Jennifer Harper on Twitter @HarperBulletin.",
    "So far, he has donated $3,500 to pregnancy resource centers around the country since founding his business five months ago.",
    "It is a social cause and a values-based business,? Mr. Krecic told Gayle M. Irwin, a contributor to PregnancyHelpNews.com.",
    "Joe Biden is falling down on his promise to bring normality back to the presidency for a basic reason  hes not normal.",
    "The 151st Annual Meetings & Exhibits will be held at the George R. Brown Convention Center over Memorial Day weekend.",
    "Attendees will get a look at the latest guns, knives, optics, ammo and accessories available on the market today.",
    "PAT BOONE HAS A NEW MOVIE\nLegendary singer, actor and conservative stalwart Pat Boone has a new movie arriving.",
    "Mr. Boone, incidentally, has sold 45 million records and starred in 15 movies; find his story at PatBoone.com.",
    "Trump, who puts a ton of stock in debates, was impressed with J.D.s performances,? the analysis said.",
    "Our society is poisoned in many ways and, of course, I am a member of the entertainment community.",
    "Between the lines: Trump thinks Ryan will be a very strong candidate in November, and that J.D.",
    "He believes churches  many known for their cordial coffee hours  could join in the endeavor.",
    "Trump watched a recent debate and thought all the GOP hopefuls were terrible except Vance.",
    "is the only Republican likely to win,? advises a close study of the situation by Axios.",
    "NOT NORMAL\nA veteran political writer has a thought or two about President Biden.",
    "The movie arrives in select theaters Monday; find details at Fathomevents.com.",
    "We dont sugarcoat the real problems or the reasons for those real problems.",
    "Mr. Lowry then went on to cite 10 clear examples of not normal? behavior.",
    "In years past, this bodacious event has attracted up to 80,000 attendees.",
    "HE HAS THE LOOK\nSo why did former President Donald Trump endorse J.D.",
    "Vance in his quest to represent Ohio in the Senate?",
    "Ive been able to share this coffee and mission.",
    "Trump says Vance has the look,? Axios noted.",
    "The press touted this impending shift.",
    "Consult Nraam.org for information.",
    "Rob Portman."
  ]
}