{
  "id": 6347,
  "mediaId": 233,
  "date": "4/16/2022 12:00:00 AM",
  "headline": "J.D. Vance lands Donald Trump endorsement in crowded Ohio GOP Senate primary",
  "image": "https://www.gannett-cdn.com/-mm-/7a63f2419cdf4dba4faee5af6709502f927095cb/c=0-507-5001-3332/local/-/media/2017/06/21/USATODAY/USATODAY/636336666124079096-JD-Vance-Partner-Revolution-left-align.jpg?width=1320&height=746&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/04/15/trump-endorses-vance-ohio-senate-primary/7337845001/",
  "sentiment": "0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Jackson",
  "authorUrl": "https://www.usatoday.com/staff/2647924001/david-jackson/",
  "termIds": [
    3103
  ],
  "sentences": [
    "After the 2016 publication of his book \"Hillbilly Elegy,\" a memoir about the problems in the Appalachian area where he grew up, Vance described Trump as \"cultural heroin\" and a demagogue who was leading \"the white working class to a very dark place.?\nVance later became a fan of Trump and said Friday he is \"incredibly honored\" to have the ex-president's endorsement.",
    "Predicting Trump would reclaim the presidency in 2024, Vance said on Twitter that \"he was an incredible fighter for hard working Americans in the White House, he will be again, and I'll fight for the America First Agenda in the Senate.\"",
    "Vance's opponents include three prominent party members who also sought Trump's support: Josh Mandel, former legislator and state treasurer; Mike Gibbons, a businessman; and Jane Timken, former state GOP party chair.",
    "Saying he studied the race \"closely,\" Trump said he believes Vance would be the best debater among the GOP candidates, while supporting his positions on issues like immigration, policing, trade, and China.",
    "Trump made his choice even though numerous Ohio Republicans publicly urged him not to support Vance, citing his low poll numbers and the fact that he opposed Trump during his 2016 presidential campaign.",
    "Trump alluded to the fracas over his Ohio endorsement in his written statement, saying this was not an easy selection to make \"because I like and respect some of the other candidates in the race.\"",
    "The crowded Ohio Senate primary features five Republicans who are bunched within 15 percentage points of each other, according to an average of polls compiled by the RealClearPolitics website.",
    "His candidates are competing in a series of Republican primaries to be held in May, including such pivotal states as Pennsylvania, North Carolina and Georgia, as well as Ohio.",
    "But he hasn't found a winner\nThe state of Ohio: 'Rough and tumble politics': Senate primary in Ohio shows shifting tone among GOP candidates\nCalifornia at a crossroads?",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,\" Trump said in a statement endorsing Vance.",
    "As Trump announced his endorsement, Vance placed third in the RealClearPolitics averaging of recent polls at 14%, trailing Mandel (21%) and Gibbons (19.3%).",
    "While we were working hard in Ohio to support you and Make America Great Again, JD Vance was actively working against your candidacy,\" the letter said.",
    "After hearing that Trump was planning to endorse Vance, dozens of Ohio Republican officials put together a letter urging Trump not to take such a step.",
    "Vance in a Republican Senate primary in Ohio, despite objections from other GOP members that Vance is a turncoat who could lose the fall election.",
    "WASHINGTON  After a day of push and pull, former President Donald Trump on Friday endorsed writer and venture capitalist J.D.",
    "The endorsement sets up an interesting test of Trump's influence: Vance has not led any major polls in the Ohio race.",
    "They and others referenced Vance's low standing in pre-election polls and past attacks on Trump and his supporters.",
    "The winner of the Ohio Republican primary on May 3 will likely face U.S. Rep. Tim Ryan, D-Ohio, in the fall.",
    "\"Unlike so many other pretenders and wannabes,\" Trump said of Vance, \"he will put America First.\"",
    "Trump's announcement capped more than 24 hours of uncertainty surrounding his Ohio intentions.",
    ":Is one of the bluest states in the US, at a turning point over crime, homelessness?",
    "Uncertainty in Ohio: Donald Trump doesn't want to back a loser in Ohio Senate race.",
    "The fifth candidate, businessman Matt Dolan, is running as an anti-Trump candidate.",
    "\"He is our best chance for victory in what could be a very tough race.\"",
    "The impact of a Trump endorsement will be felt soon.",
    "\"Like some others, J.D."
  ]
}