{
  "id": 6355,
  "mediaId": 188,
  "date": "4/16/2022 12:00:00 AM",
  "headline": "JD Vance secures Donald Trump's endorsement in Ohio's crowded Republican Senate primary",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY4OTA5MS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3ODU1NzE1N30.hEyzbyfndfQ1Zgd5Ae3hHczSuwSt3_I_6-uzKbQy20I/img.jpg?width=1245&quality=85&coordinates=0%2C0%2C0%2C107&height=700",
  "link": "https://www.theblaze.com/news/jd-vance-secures-donald-trump-s-endorsement-in-ohio-s-crowded-republican-senate-primary",
  "sentiment": "0",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Samuel Mangold-Lenett",
  "authorUrl": "https://www.theblaze.com/u/samuelmangold-lenett",
  "termIds": [
    3103
  ],
  "sentences": [
    "Donald Trump Jr. said that he has gotten to know Vance personally over the past year and that he was certain Vance is \"100% America First? He went on to say that the leftwing media, the Dems & the weak RINOs all HATE him because he stands with #MAGA.?\nOther notable conservative figures such as Missouris Republican Senator Josh Hawley and conservative journalist Chris Rufo celebrated Trumps endorsement of Vance.",
    "He is our best chance for victory in what could be a very tough race.?\nHe went on to lambast the current Democratic primary frontrunner  former U.S. Representative Tim Ryan  as a defective candidate.?\nTrump said, The Democrats will be spending many millions of dollars, but the good news is that they have a defective candidate who ran for President and garnered exactly zero percent in the polls.",
    "State Senator Matt Dolan said, Rather than focusing on Ohio, Jane Timken, Josh Mandel, Mike Gibbons, & JD Vance embraced lies & undermined the Constitution to go all-on for one endorsement.?\nJane Timken, the former chair of the Ohio Republican Party, released a statement that said, This race is about who can defeat Tim Ryan and retake the Republican Senate majority in November.",
    "Vance  the Middletown, Ohio native turned venture capitalist and author of the New York Times bestseller Hillbilly Elegy.?\nIn a statement released on Friday, Trump emphasized his belief that Vance is the best candidate in the Republican primary to help in the upcoming devastating rebuke? to the Democratic agenda.",
    "Im honored and thrilled to have his support.?\nTo many following the race, Trumps endorsement of Vance might come as a surprise considering past comments made by the author-turned political candidate that were critical of Trump during his 2016 bid for the White House.",
    "The bottom line is, we must have a Republican victory in Ohio.?\nIn a statement to TheBlaze, Vance said, Donald Trump is the best president of my lifetime for the simple reason that he never bent to the mob and fought consistently for hardworking Americans.",
    "I am that candidate and I look forward to having President Trumps endorsement in the General Election.?\nJosh Mandel, Ohios former State Treasurer, said, I continue to be a proud supporter of President Trump and the America First agenda.",
    "Trump said, MAGA patriots from across the nation are set to deliver an election landslide for Republicans that will serve as a devastating rebuke of the failures of Joe Biden and the Radical Left Democrats.",
    "Politico reported that the political action groups Club for Growth Action and USA Freedom Fund combined spent nearly one million dollars on political ads touting Vances past statements.",
    "Despite Trumps endorsement likely boosting Vances candidacy, the other candidates seeking the Republican Partys nomination appeared unphased.",
    "On Friday, former President Donald Trump issued his long-awaited endorsement in Ohios hotly contested and crowded Republican Senate primary.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,? Trump continued.",
    "I look forward to earning his endorsement in the general election and working with him to defeat Tim Ryan in November.?",
    "In the Great State of Ohio, the candidate most quailed and ready to win in November is J.D.",
    "Hawley proclaimed, On to victory!? And Rufo said that he was rooting? for Vances success.",
    "With just over two weeks until the election, Trump declared his support for J.D.",
    "He set an example in the White House that Ill follow in the Senate.",
    "It is all about winning!?\n\"Like some others, J.D.",
    "Together, were going to take this country back.",
    "We cannot play games.",
    "Vance."
  ]
}