{
  "id": 6361,
  "mediaId": 19,
  "date": "d2022-04-16T00:00",
  "headline": "Exclusive  J.D. Vance on Trump Endorsement: Were Going to Win This Thing",
  "image": "https://media.breitbart.com/media/2022/04/J.D.-Vance-Laughter-ap-640x480.jpg",
  "link": "https://www.breitbart.com/radio/2022/04/16/j-d-vance-trump-endorsement-were-going-win-thing/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    781,
    946,
    1147,
    3103,
    3673,
    428,
    2845,
    2863,
    2888,
    2945
  ],
  "sentences": [
    "I think frankly if we were 20 points behind we probably still win, but were going to win this thing now,? he said, speaking of how he will ultimately win the general election as well and bring a different perspective to the Senate.?\nVance briefly acknowledged that he was not an early Trump supporter, but he had a conversation? after seeing how viciously the swamp and establishment tried to destroy the president.",
    "He said there is a difference between someone who knows the issues and politicians with their consultant approved lines.?\nIm actually going to tell you what I think,? Vance said, adding that Trump recognizes him as someone who can go toe to toe with Tim Ryan.?\nOnly in politics can you fail for 20 years, as Tim Ryan has done in Congress, and try to get a promotion to the U.S. Senate.",
    "I dont think that Twitter and Facebook should be able to discriminate against Donald Trump because they dont like what he says, or a conservative middle class Ohioan because they dont like what that person says,? he stated, adding that he is also willing to talk about making it illegal for Big Tech to steal an individuals data.",
    "On the issue of China, Vance blasted the many politicians who say they want to hold China accountable, adding that he is the only one who said, We need Trumps tariffs, we need to bolster them.?\nThe U.S. is not going to fight China by doing the same thing weve been doing for the last 30 years, Vance said.",
    "LISTEN:\nAmerica First, Vance continued, is more than just slogans and talking points.? He mentioned his GOP challenger, Josh Mandel, whom he said endorsed a European no-fly zone in Russia and on the flip side called those who pushed against escalation Russia First? Republicans.",
    "He also said wage competition for middle class and working class is a major issue, adding that the U.S. cannot let multinational corporations import a servant class from Central America every time they need workers.?\nThey need to train their own people,? he said.",
    "Vance, who secured former President Donald Trumps endorsement for U.S. Senate in Ohio on Friday, walked through why he believes Trump is backing him in the tight race, telling Breitbart News Saturday that Trump knows Vance will carry on the America First agenda.",
    "And finally, Vance said he continues to stand as a proponent of election integrity, making it clear that the country must get rid of election season? and go back to Election Day.? He also said voter ID is essential, and ballot harvesting must be stopped.",
    "Vance spoke about each issue, telling Breitbart News Saturday that the border crisis, specifically, could spell the end of the country as we know it.? He personally has been affected by the drug epidemic in his family and identified it as a top problem.",
    "Hes strong on the Border, tough on Crime, understands how to use Taxes and Tariffs to hold China accountable, will fight to break up Big Tech, and has been a warrior on the Rigged and Stolen Presidential Election,? Trumps endorsement reads in part.",
    "The border crisis is the major crisis that we face as a country right now,? he said before also speaking of the crime wave, making it clear that law enforcement needs to feel protected and Soros-backed prosecutors? need to be addressed.",
    "While Vance said the campaign is going very well,? he said the race is definitely tight.? However, the Trump endorsement serves as an incredible boost for us coming down the stretch.?\nSo I felt confident before we got the endorsement.",
    "I dont think its going to work, but the only way its not going to work is if we actually send the right guy to fight back against the Democrats in the general election, of course, and thats going to be me,? Vance said.",
    "Vance said Trump called him and walked him through why he endorsed him, and they discussed his potential Democrat challenger, Tim Ryan, whom Trump believes is a stronger candidate than people give him credit for.",
    "And it made me realize, you know, if all these corrupt people? were going after him, he must be doing something special and doing something right.?\nAnd really think thats ultimately what this is about.",
    "Calling the endorsement hugely important and powerful,? Vance gave Trump great credit for getting involved in the primary races and openly supporting those he believes will benefit the country.",
    "He also blasted Democrats who are very open? about giving illegal immigrants the right to vote, which he said will result in never having a Republican win a national election again.",
    "Trump sees me as a guy who actually carries on his agenda,? Vance said, adding that Trump recognizes that he will be an ally in the Senate as well.",
    "Democrats, he said, want to transform the electorate with people who broke our laws, but this is why we need people like me? to speak out.",
    "And I just think on the substantive agenda, Im more with Trump than anybody else, and thats ultimately why he endorsed me,? Vance said.",
    "On Big Tech, Vance said politicians must update the antitrust framework and work on declaring those massive companies common carriers.",
    "He pretends to be a Trump Democrat in certain ways, Vance explained, before speaking of his own success in the GOP primary debates.",
    "Trump, if anything, is a rejection of the idea that we should give more money to the establishment to fight in stupid wars.",
    "Well, part of looking forward is making sure we have safe and secure elections for the next time we go to the ballot box.",
    "Its about ensuring we have a real country.?\nOhios Election Day is in less than three weeks, on May 3.",
    "In the endorsement, Trump listed a series of specific reasons he is supporting Vance.",
    "The more we learn about 2020, the more we realize there were significant issues.",
    "Everybody always says you got to look forward; you cant look past.",
    "Its not about looking in the past,? Vance said.",
    "We cannot give up on the issue.",
    "Man, I feel very confident now.",
    "Trump is just right on this.",
    "Republican candidate J.D."
  ]
}