{
  "id": 6362,
  "mediaId": 112,
  "date": "d2022-04-15T22:43",
  "headline": "Formerly anti-Trump author of Hillbilly Elegy wins long-running battle for ex-presidents endorsement in GOP Senate primary in Ohio",
  "image": "https://images.mktw.net/im-526127/vertical?width=639&size=0.5621212121212121&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/formerly-anti-trump-author-of-hillbilly-elegy-wins-long-running-battle-for-ex-presidents-endorsement-in-gop-senate-primary-in-ohio-01650062641",
  "sentiment": "-0.462",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.marketwatch.com/column/associated-press",
  "termIds": [
    781,
    946,
    1054,
    1147,
    1801,
    3103,
    428,
    571,
    2623,
    2845
  ],
  "sentences": [
    "In addition to pilgrimages to, and paid fund-raising events at, the Trump-owned private club Mar-a-Lago in Palm Beach, Fla., the candidates and their affiliated super PACs have spent millions trying to paint one another as insufficiently loyal to the former president, who remains deeply popular with the GOP base, despite being impeached twice, and won the state in both 2016 and 2020.",
    "The decision is a major blow for former state treasurer Josh Mandel, investment banker Mike Gibbons and former Ohio Republican Party chair Jane Timken, who have been locked in a heated and contentious race for more than a year over both the nomination and Trumps backing in a primary that is now less than three weeks away.",
    "In an interview earlier this week, Vance told talk radio host Hugh Hewitt that he wasnt sure whether Trump would end up endorsing in the race, but thought if he did it would come before Trump returns to the state for a rally on April 23.\nI think that he will.",
    "While Gibbons and Mandel had been leading in recent polls, officials backing various candidates had long conceded that Trumps coveted support would likely push his pick to the front of the pack in a race that has revolved, in large part, around him.",
    "Vance, in particular, has come under fire for old audio and since-deleted tweets in which he called himself a never-Trump guy,? called Trump an idiot, and said he might have to hold his nose and vote for Democrat Hillary Clinton in 2016.",
    "It is all about winning!?\nThe winner of the May 3 primary is likely to face Democratic frontrunner Tim Ryan, a House member since 2013 representing northeastern Ohio, in November for the seat being vacated by retiring Republican Sen.",
    "He has closely aligned himself with the former president, making frequent appearances on Fox News and former Trump strategist Steve Bannons podcast, where he has echoed Trumps rhetoric on issues including immigration.",
    "On Thursday night, dozens of Republican leaders in Ohio mounted a last-minute effort to urge Trump not to endorse Vance following a news report that said Trump was planning to do just that.",
    "He also wants to endorse a winner.?\nRead on (December 2021): Former far-right Austrian chancellor Kurz, who left office amid corruption allegations, set to join Peter Thiel investment firm",
    "In a statement, Trump described Vance as the candidate most qualified and ready to win in November.?\nWe cannot play games,? he wrote.",
    "Vance in Ohios competitive Republican Senate primary, ending months of jockeying in a race where his backing could be pivotal.",
    "COLUMBUS, Ohio (AP)  Former President Donald Trump is endorsing Hillbilly Elegy? author J.D.",
    "But Vance has since changed his tune, saying he regrets his past comments.",
    "Wall Street Journal (October 2021): How tight is Trumps grip on the GOP?",
    "He wants to endorse the person he thinks can beat Tim Ryan.",
    "Take a look at the Ohio Senate primary.",
    "Im not sure that he will,? said Vance.",
    "Rob Portman."
  ]
}