{
  "id": 6374,
  "mediaId": 195,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Trump endorses Vance in Ohio GOP Senate primary",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/43ad84884bb54f58bf7b2b5fbc97cba8.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3270147-trump-endorses-vance-in-ohio-gop-senate-primary/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    3103
  ],
  "sentences": [
    "without directly naming him, saying Vance will destroy him in the debates.?\nRyan hit back at Trumps endorsement in a statement, calling Vance a multi-millionaire elitist who left Ohio behind for Silicon Valley.?\nThe endorsement puts an end to months of speculation about who the former president would back in the crowded primary, which has turned increasingly bitter as candidates competed for his endorsement.",
    "It gives Vance hope, but it doesnt deliver him a win unless hes got both serious money driving the endorsement on TV, and serious money deflecting the onslaught of ads reminding voters how Vance has badmouthed Trump for years,? said one Ohio Republican strategist.",
    "He is our best chance for victory in what could be a very tough race.?\nA source familiar with the endorsement said Trump called Vance shortly before the press release announcing the endorsement was released.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,? Trump said in a statement, referring to Vances past criticism of him.",
    "Additionally, the source said that Trump has referred to Mandel as weird? throughout the course of the primary and was most impressed with Vance during the primary debates.",
    "I like and respect some of the other candidates in the racetheyve said great things about Trump and, like me, they love Ohio and love our Country,? Trump said.",
    "The report prompted over 30 Ohio Republican leaders to sign onto a letter to the former president calling on him not to endorse the Hillbilly Elegy? author.",
    "A survey released on Friday from the right-leaning firm the Trafalgar Group shows Vance with 22 percent support, behind former state Treasurer Josh Mandel.",
    "The source added that Trump was turned off by clips of GOP candidates Josh Mandel and Mike Gibbons getting in eachothers faces at candidate forums.",
    "The former president acknowledged that intraparty battle in the same statement on Friday, saying his decision was not an easy one to make.",
    "A source said that conservative figures including Tucker Carlson, Charlie Kirk, Donald Trump Jr., and Sen. Josh Hawley (R-Mo.)",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The former presidents backing stands to give Vance a boost in the Buckeye State, which Trump won in 2016 and 2020.",
    "Vance in Ohios Republican Senate primary on Friday, calling Vance the most qualified? candidate in the GOP field.",
    "Trump made headlines when he endorsed Dr. Mehmet Oz in Pennsylvanias GOP Senate primary.",
    "This is a a half court heave for the win at best,? the Ohio Republican strategist said.",
    "However, it also poses a test for his political brand two years after his presidency.",
    "The biggest question is who the hell is giving Trump such awful political advice.",
    "NBC News reported Thursday that Trump was asking donors about endorsing Vance.",
    "Trump also referred to Democratic primary frontrunner Rep. Tim Ryan (D-Oh.)",
    "had been advocating for Trump to endorse Vance behind the scenes.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The move divided Republicans including Trump loyalists.",
    "Trump is slated to hold a rally in Delaware, Oh.",
    "Former President Trump endorsed author J.D.",
    "Like some others, J.D.",
    "Updated: 5:55 p.m.",
    "on April 23."
  ]
}