{
  "id": 6380,
  "mediaId": 409,
  "date": "d2022-04-15T17:47",
  "headline": "Trump Endorses J. D. Vance in Ohio Senate Race",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/04/DonaldTrump-JDVance.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/donald-trump-endorses-j-d-vance-as-gop-candidate-in-ohio-senate-race/",
  "sentiment": "0.804",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Downey",
  "authorUrl": "https://www.nationalreview.com/author/caroline-downey/",
  "termIds": [
    946,
    1054,
    1147,
    1801,
    3103,
    146,
    380,
    428,
    571,
    2845,
    2942
  ],
  "sentences": [
    "His primary opponents Mandel and Gibbons, on the other hand, revealed in a recent debate that they would be amenable to a no-fly zone, which would commit the U.S. to shoot down Russian aircraft over Ukraine, potentially escalating the conflict to one of an international scale.",
    "The author of Hillbilly Elegy: A Memoir of a Family and Culture in Crisis, Vance has championed a conservatism that highlights cultural decline and how the old Rights emphasis on individual liberty and free markets has neglected the nuclear family and traditional values.",
    "He has urged a restoration of the American dream? for citizens, which he loosely defines as a good life in their own country,? marked not by extreme material wealth but by sufficient means to provide for ones family.",
    "The Democrats will be spending many millions of dollars, but the good news is that they have a defective candidate who ran for President and garnered exactly zero percent in the polls.",
    "Once a vocal critic of Trump during his first presidential bid, Vance declared his support for Trump in 2020 and has since carried his mantle with a populist platform.",
    "A GOP primary poll released Friday showed Vance in second place, at 22.6 percent, to Republican Josh Mandel, at 28.0 percent, according to the Trafalgar Group.",
    "In accordance with America First messaging, Vance has opposed sending Americans to fight in the war in Ukraine, an increasingly popular position domestically.",
    "The bottom line is, we must have a Republican victory in Ohio,? Trump wrote in a statement announcing the endorsement.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades.",
    "The survey showed millionaire investment banker and longtime GOP donor Mike Gibbons polling in third at 14.3 percent.",
    "Former president Trump endorsed GOP candidate J. D. Vance in Ohios Senate race on Friday.",
    "He is our best chance for victory in what could be a very tough race.",
    "Like many others, J.D."
  ]
}