{
  "id": 6381,
  "mediaId": 237,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Donald Trump endorses JD Vance for Ohio Senate",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/0d10165/2147483647/strip/true/crop/4429x2325+0+314/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fd5%2Ff5%2Fecd7df3d4dd49269b381945400cf%2Fap22031091354337.jpg",
  "link": "https://www.washingtonexaminer.com/news/senate/donald-trump-endorses-jd-vance-for-ohio-senate",
  "sentiment": "0.361",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Irvine",
  "authorUrl": "https://www.washingtonexaminer.com/author/chris-irvine",
  "termIds": [
    1147,
    1766,
    1801,
    3103,
    379,
    380,
    428,
    2845
  ],
  "sentences": [
    "Mandel and Gibbons both openly courted Trump's seal of approval and tried to smear Vance as anti-Trump to an electorate that voted heavily in favor of the former president in both elections.",
    "Trump declared Vance to be the \"most qualified\" candidate to win in November, saying in a Friday evening statement that Vance's past criticism of him was water under the bridge.",
    "A Trafalgar poll of more than 1,000 likely Republican primary voters this week showed Vance in second place with over 22% support and a margin of error of 3 percentage points.",
    "Nearly 55% of respondents said a Trump endorsement would make them more likely to vote for a candidate, so Vance could gain more ground ahead of the May 3 primary.",
    "\"While we were working hard in Ohio to support you and Make America Great Again, JD Vance was actively working against your candidacy,\" the letter says.",
    "After Trump's plan to endorse Vance leaked Thursday, nearly three dozen members of the Ohio GOP released a letter asking Trump to reconsider.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades,\" he said.",
    "Vance ahead of the Ohio Senate Republican primary, quashing opponents' efforts to paint him as an anti-Trump candidate.",
    "Vance has made illegal immigration one of the primary concerns of his campaign, forging common ground with Trump.",
    "Josh Mandel still led the poll with 28% support, and Mike Gibbons was in third with 14.3%.",
    "\"He referred to your supporters as 'racists' and proudly voted for Evan McMullin in 2016.\"",
    "\"He is our best chance for victory in what could be a very tough race.\"",
    "Former President Donald Trump endorsed author J.D.",
    "\"Like some others, J.D."
  ]
}