{
  "id": 6394,
  "mediaId": 129,
  "date": "d2022-04-15T00:00",
  "headline": "SEARCH",
  "image": "https://static01.nyt.com/images/2022/04/15/us/politics/15onpolitics-pm-newsletter-Corrine/15onpolitics-pm-newsletter-Corrine-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/04/15/us/politics/valerie-biden-owens-tell-all-books.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    723,
    1147,
    1321,
    2087,
    2429,
    3103,
    3676,
    4109,
    3628,
    2845
  ],
  "sentences": [
    "But sometimes writers, whether its the presidents themselves or their family members, need a nudge to tell us a little bit more of what we want to know.?\nIn the 1980s, there was a major shift in the publishing industry, as book stores popped up in shopping malls and celebrities wrote their own best sellers (including Trumps The Art of the Deal,? published in 1987).",
    "I had no problem telling any of my brothers when I thought they were being jerks,? Owens writes in Growing Up Biden: A Memoir.?\nAll of these accounts  Donald Trumps oldest sister didnt write a book but was a central figure in a critical one written by his niece  lead to a more personalized understanding of the historical figures who have defined the country.",
    "Heres what Cheriss May told us about capturing the image above on Tuesday:\nWhen the White House cautioned members of the news media to wear flat, close-toed shoes that are fine getting a little dusty? during President Bidens visit to POET Bioprocessing in Menlo, Iowa, we knew to expect an adventure.",
    "And so if a president can write a good book, lets see about a presidential sibling.?\nCorrine Roosevelt Robinson certainly looked up to her brother Theodore, even if she had a way of subverting his projection of unyielding strength.",
    "In it, his sister, Valerie Biden Owens, recalls dozens of anecdotes about her brother, ranging from the time he left her alone at a picnic so that he could go kiss a girl, to the moment he won the presidency.",
    "That kind of correction might have gone against the Victorian sense of manhood,? said Kathleen Dalton, the author of Theodore Roosevelt: A Strenuous Life,? but it probably only made Roosevelt look better.",
    "Oh, Brother: The Not-Quite-Tell-All Books by Presidential Sisters\nValerie Biden Owens is one of a handful of presidential sisters who have taken the opportunity to dish on their brothers.",
    "The House committee investigating the Jan. 6 attack on the Capitol pressed Stephen Miller, a top adviser to Donald Trump, about the former presidents rhetoric in rallying the crowd.",
    "In her 1921 biography about her brother Theodore Roosevelt, Corrine Roosevelt Robinson saw no harm in sharing almost confidential personal recollections? about the late president.",
    "If youre looking for sisters as influence makers of POTUS, I think its very thin gruel,? Brinkley said, adding that Corrine Roosevelt Robinson was one of a couple exceptions.",
    "But over the last few administrations, more sisters of presidents have spoken up and have publicly aired their views about their brothers, whether influence-shaping or not.",
    "She would tell biographers, for example, that Roosevelt had never gotten over his asthma, although Roosevelt boasted that he had conquered the ailment through exercise.",
    "Part of that trend is a result of the explosion of political literature in general, combined with the easing of sexism in politics and publishing in recent decades.",
    "And even now, the historian Douglas Brinkley said, the books written by two of Barack Obamas sisters havent exactly transformed the way we see the former president.",
    "Vance in the Republican primary for a Senate seat in Ohio, which Maggie Haberman and Jazmine Ulloa report amounts to a major bet on Trumps influence in the party.",
    "They probably added to his following.?\nDavid Welky is a University of Central Arkansas professor who is writing a book about Roosevelts other sister, Anna.",
    "Instead, presidents in those autobiographies would justify the political decisions they had made while in office, naming the advisers who had guided them.",
    "The women in his family were very protective of his legacy, wanted him remembered in glowing terms,? Welky said, adding: But I dont think its dishonest.",
    "This trend coincided with the presidency of Ronald Reagan, a celebrity himself before his political career, who had written a popular book in the 1960s.",
    "That slowly changed over time, under pressure from publishers and editors, who would really have to beg them to write personal material,? Fehrman said.",
    "Even in those books, personal anecdotes were scarce, said Craig Fehrman, who wrote Author in Chief,? a book about the books written by presidents.",
    "Russian state news is echoing Fox News coverage of the invasion of Ukraine to criticize the Biden administrations handling of foreign policy.",
    "During the remarks, I crossed to the other side of the room to place Biden in front of the cornmeal, showing just how enormous the mound was.",
    "When I first saw the mound that reached toward the ceiling, I thought about the sci-fi movie Dune? and almost expected a sandworm to emerge.",
    "Corrine was the writer of the family, but Roosevelts wife and Anna were also protective of him, with roles that were more behind the scenes.",
    "As grain fell from the ceiling onto the indoor mountain, I thought of an hourglass, ticking down this difficult, consequential time.",
    "In fact, presidents wrote their autobiographies with the expectation that the material would be published only after they had died.",
    "If I published almost confidential personal recollections? about my brothers in a book, they would not be amused, to say the least.",
    "In Nebraska, a state senator accused a leading candidate in the Republican primary for governor of groping her three years ago.",
    "There is no sacrilege in sharing such memories, with the people who have loved him, and whom he loved so well,? she wrote.",
    "The celebrity factor\nIn early American history, decorum precluded presidents from writing about their personal histories.",
    "Siblings offer a perspective less doting than a parents, less reverent than a childs and more thorough than a friends.",
    "There are more than 20 memoirs written by members of Reagans family and officials who served in his administration.",
    "But they also say something larger about our appetite for intimate behind-the-curtain details about politicians.",
    "I knew I wanted to show how imposing the cornmeal looked in that space  how it consumed the room and all in it.",
    "As Biden spoke, I could see more grain falling from an opening in the ceiling onto the already sizable pile.",
    "The president gave remarks in a barnlike structure surrounded by hay, tractors and a huge mound of cornmeal.",
    "There was little risk that Corrine would write anything that would harm her brother, whom she idolized.",
    "With that change came a surge in books about presidents, even those still sitting in the White House.",
    "So I think that was coming from a genuine place.?\nWhat to read\nDonald Trump endorsed J.D.",
    "The presidency became even more of a celebrity phenomenon with the advent of cable news.",
    "She liked to tell those stories because she thought they were endearing,? Dalton said.",
    "The entire time, there was a fine mist of cornmeal blowing around that got in my hair.",
    "But accounts from the sisters of presidents have been rare, until the last decade.",
    "A cornmeal mountain\nOn Politics regularly features work by Times photographers.",
    " Leah (Blake is on vacation)\nIs there anything you think were missing?",
    "A memoir by President Bidens younger sister was released this week.",
    "Publishers like to find hits and formulas that work,? Fehrman said.",
    "Once I got home, I found it underneath my clothes, as well.",
    "They really viewed their brother in glowing terms.",
    "Readers love personal information,? Fehrman added.",
    "We dont just want to know how the policy is made.",
    "We want to know how the person is made, too.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "Wed love to hear from you.",
    "And you know, they are."
  ]
}