{
  "id": 6396,
  "mediaId": 19,
  "date": "d2022-04-15T00:00",
  "headline": "Nolte: Ohio Senate Poll Shows Trump Nod Could Put J.D. Vance over the Top",
  "image": "https://media.breitbart.com/media/2022/04/AP21183828334156-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/15/nolte-ohio-senate-poll-shows-trump-nod-could-put-j-d-vance-over-the-top/",
  "sentiment": "0.302",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Nolte",
  "authorUrl": "https://www.breitbart.com/author/john-nolte/",
  "termIds": [
    946,
    1069,
    1147,
    1801,
    2027,
    2208,
    2466,
    3103,
    380,
    571,
    2845
  ],
  "sentences": [
    "When Trafalgar asked Republican primary voters if a Trump endorsement would make them more or less likely to support that candidate,? 54.9 percent said more likely.? Only 25.7 percent said less likely.?\nRumors abound that Trump is preparing to endorse Vance, and those rumors are likely a trial balloon from Team Trump.",
    "New @trafalgar_group#OHSen 22 #GOP primary #poll shows tight 2 way & 55% likely to back if #Trump endorses #OHpol\nReport:https://t.co/PXtrNujEx4 pic.twitter.com/Evx1R0wM8P\n Robert C. Cahaly (@RobertCahaly) April 15, 2022\nThe potential game-changer in this poll is the highly-coveted Trump endorsement.",
    "As far as the no-fly zone insanity, if a media-manufactured moral panic can manipulate Gibbons (and Mandel) into stating its time for America to shoot down Russian planes, how will they stand up to the media onslaught during a general election?",
    "Vance, an insurgent candidate whos run an impressive campaign on an unapologetic America-first platform, is now, according to the excellent pollster at Trafalgar, in second place and could surge to first if the rumored endorsement arrives.",
    "https://t.co/PKf8AO8UKD\n Breitbart News (@BreitbartNews) February 28, 2022\nI can think of nothing Democrats would like more than to run to the right of a Republican on the issue of middle-class taxes.",
    "Raising taxes on the middle class and going to war with Russia are not only two of the worst ideas in the history of worst ideas, but it also reveals a candidate who might not be ready for primetime.",
    "But no one who claims they're \"America First\" should be repeating the same conventional wisdom that has destroyed our country's wealth and lost a generation's worth of wars.",
    "In late March, Gibbons (along with Mandel) also said he supports a no-fly zone over Ukraine, which would effectively mean America declaring war against Russia.",
    "Nevertheless, because it was such a phenomenon, and long before I knew anything about Vances politics, I read Hillbilly Elegy and found it superb.",
    "His empathy and understanding of what plagues the American working class and poor was right there on every page, and none of it was condescending.",
    "Best of all, although media elites embraced the memoir (at least until Vance went the full-America first), it was not written to impress them.",
    "Vance declared that Democrats care more about illegal aliens and Ukraines shared border with Russia than working-class Americans at the CPAC.",
    "Vance blasted that lunacy in a couple of tweets:\nIt's insane how little Republican politicians have learned from the last 20 years.",
    "Just last week, the millionaire investment banker said the middle class is not really paying any kind of a fair share? of taxes.",
    "This means that the former president could burnish his image all the more as a kingmaker with a timely nod in Vances direction.",
    "As far as Vances surge, earlier this month, a Fox News poll showed him languishing in third place with just 11 percent support.",
    "As far as Gibbons outrageous claim that the middle class is not taxed enough, Democrats must be salivating over that beauty.",
    "Per Trafalgar, heres the rundown\nFormer Ohio Treasurer Josh Mandel leads the crowded field with 28 percent support.",
    "Polling shows a nod from former President Donald Trump could put Ohio Republican U.S. Senate primary candidate J.D.",
    "If we shoot down a Russian plane, which is the only way to enforce a no-fly zone, thats an outright act of war.",
    "Matt Dolan, Jane Timken, Mark Pukita, and Neil Patel respectively sit at 11.6, 7.5, 2.1, and 0.8 percent.",
    "Widely seen as the frontrunner, his campaign has been plagued by a couple of serious missteps.",
    "And lets not forget that Trafalgar blows the imbecile pollsters at Fox News out of the water.",
    "Ohios Republican primary is just a couple of weeks away on May 3, and its winner-take-all.",
    "By the way, Im not a big fan of memoirs, most especially memoirs written by young people.",
    "In late February, a previous poll from the Hill/Emerson showed him at eight points.",
    "Jumping to second place is Hillbilly Elegy author Vance with 22.6 percent support.",
    "Languishing in third is former frontrunner Mike Gibbons with just 14.3 percent.",
    "As Ill explain below, Vance is surging and doing so at the right time.",
    "Whats notable, though, is Vances improvement with Trafalgar.",
    "So, in this same poll, hes improved almost nine points.",
    "Endorsing Vance would be a smart move on Trumps part.",
    "Steadiness and competence are what win elections.",
    "Almost all of them are narcissistic and shallow.",
    "Last month Vance sat at just 14 percent.",
    "Gibbons slide is also notable.",
    "Vance in the lead.",
    "J.D."
  ]
}