{
  "id": 6397,
  "mediaId": 1164,
  "date": "d2022-04-15T00:00",
  "headline": "Trump endorses J.D. Vance for Ohio senate seat",
  "image": "https://cdnph.upi.com/svc/sv/i/5381650077673/2022/1/16500780977838/Trump-endorses-JD-Vance-for-Ohio-senate-seat.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/04/15/trump-endorses-jd-vance-ohio-senate-seat/5381650077673/",
  "sentiment": "0.678",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Schrader",
  "authorUrl": "",
  "termIds": [
    781,
    946,
    1147,
    1801,
    2466,
    3103,
    4227,
    379,
    428,
    571,
    2845
  ],
  "sentences": [
    "The news comes amid a race crowded with Republicans, including former state treasurer Josh Mandel and former Ohio Republican Party chair Jane Timken, who have spent more than a year vying for the coveted endorsement.",
    "Before Trump announced his endorsement, Gibbons and Mandel were engaged in a heated confrontation during a debate in which they seemed to just avoid coming to blows.",
    "\"I continue to be a proud supporter of President Trump and the America First agenda,\" Mendel tweeted after it was revealed Vance had received the endorsement.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent -- dangerous because they will have so much money to spend,\" Trump said.",
    "Vance, the author of Hillbilly Elegy, previously told Charlie Rose in an interview in 2016 that he was a \"never Trump guy\" and \"never liked him.\"",
    "Trump said that his endorsement decision was difficult because others in the race had previously said great things about the former president.",
    "An Emerson poll from February found that Ryan held a double-digit lead over fellow Morgan Harper and Traci Johnson in the Democratic primary.",
    "The same poll had found that businessman Mike Gibbons held the most support among Republican voters, followed by Mandel and then Vance.",
    "Just three Democrats are in the race to flip the seat, including Rep. Tim Ryan who is taking the chance to move into the upper chamber.",
    "\"I look forward to earning his endorsement in the general election and working with him to defeat Tim Ryan in November.\"",
    "Vance may have said some not-so-great things about me in the past, but he gets it now, and I have seen that in spades.",
    "Trump's endorsement was revealed Friday evening in a statement posted to Twitter by his spokeswoman Liz Harrington.",
    "\"In the Great State of Ohio, the candidate most qualified and ready to win in November is J.D.",
    "April 15 (UPI) -- Former President Donald Trump on Friday endorsed venture capitalist J.D.",
    "Vance in the Republican primary for a U.S. Senate seat in Ohio vacated by retiring Sen.",
    "He is our best chance for victory in what could be a very tough race,\" Trump said.",
    "\"I've studied this race closely and I think J.D.",
    "Trump said in the statement.",
    "It is all about winning!\"",
    "\"Like some others, J.D.",
    "We cannot play games.",
    "Rob Portman.",
    "Vance."
  ]
}