{
  "id": 6400,
  "mediaId": 25,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "J.D. Vance lands Donald Trump's endorsement for Ohio Senate GOP race",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/04/15/f42000e9-4ccd-4846-9c72-29b7a7b201d0/thumbnail/620x413/7beefcf42e0e90aff80f430e58d3d4b2/gettyimages-1239922215.jpg",
  "link": "https://www.cbsnews.com/news/j-d-vance-trump-endorsement-for-ohio-senate-gop-race/",
  "sentiment": "0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron Navarro",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "Trending News\n Russia warns U.S. against further arming Ukraine\n Here's what Biden, Harris and their spouses paid in 2021 taxes\n Tennessee lawmaker invokes Hitler in message to homeless people\n Canceling student loan debt \"still on the table\" for Biden administration\n Biden administration protects Cameroonians in the U.S. from deportation\nIn:\nJ.D.",
    "Vance\nDonald Trump\nDonald Trump Jr\nOhio\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "In debates, Vance has echoed Trump's baseless claims that the 2020 presidential election was stolen and has taken up Trump's stances on the U.S.-Mexico border and relationship with China.",
    "One rival campaign staffer had thought the endorsement for Vance may not happen, after a letter was sent Thursday by Ohio GOP central committee chairs that urged Trump not to back him.",
    "In his endorsement, Trump said Vance has the best chance of winning in the general election against Democratic Congressman Tim Ryan, the front-runner in the Democratic primary.",
    "Vance is facing a crowded field in the Republican primary, including former Ohio GOP chair Jane Timken, former Ohio State Treasurer Josh Mandel and businessman Mike Gibbons.",
    "He was an incredible fighter for hard working Americans in the White House, he will be again, and I'll fight for the America First Agenda in the Senate,\" Vance tweeted.",
    "Trump had been holding out on wading into the race, but ultimately decided to back Vance, a venture capitalist and author of the memoir \"Hillbilly Elegy.\"",
    "But Trump had been calling donors and trusted Republican operatives in his orbit to gauge their opinion on Vance, a Trump advisor told CBS News.",
    "is the most likely to take out the weak, but dangerous, Democrat opponentdangerous because they will have so much money to spend.",
    "Gaelen Morse / Getty Images\nVance is backed by billionaire and GOP megadonor Peter Thiel, who also donated to Trump in 2016.",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades.\"",
    "U.S. Senate candidate JD Vance speaks with prospective voters on the campaign trail on April 11, 2022 in Troy, Ohio.",
    "Vance had previously been critical of Trump and voted for independent Evan McMullin in 2016's presidential race.",
    "Kellyanne Conway, Trump's former 2016 campaign manager and senior White House adviser, now works for Timkin.",
    "Earlier this month he backed Dr. Mehmet Oz in Pennsylvania's Senate race against rival David McCormick.",
    "Trump's pick will be another test of the power of his endorsement in contentious Republican primaries.",
    "Vance described Trump as \"cultural heroin\" and also called him \"unfit\" for the presidency in 2016.",
    "will destroy him in the debates and will fight for the MAGA Movement in the Senate,\" Trump wrote.",
    "In both races, Trump has former senior advisors working for his chosen candidate's opponents.",
    "Vance for Ohio's Republican Senate primary, weeks away from the May 3 election.",
    "Trump acknowledged this in his endorsement, saying, \"like some others, J.D.",
    "Trump is holding a rally in the state on Saturday, April 23.",
    "\"I'm incredibly honored to have President Trump's support.",
    "Fin Gomez and Caitlin Huey-Burns contributed reporting.",
    "Early voting began on April 5 and runs until May 2.",
    "Trump's son, Donald Trump Jr., also supports Vance.",
    "\"I've studied this race closely and I think J.D.",
    "Former President Donald Trump has endorsed J.D.",
    "This was first reported by Fox News.",
    "However, J.D.",
    "Twitter"
  ]
}