{
  "id": 6408,
  "mediaId": 223,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Trump Looks to Be About to Make a Major Endorsement in Key Senate Race",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/336/913039ea-72aa-493b-bf08-ee37f7d42ac0.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/04/14/trump-looks-to-be-about-to-make-a-major-endorsement-in-key-senate-race-n2605914",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    3103
  ],
  "sentences": [
    "Other concerns include potential polling issues for Vance:\nThough Trump's press shop had already written up an endorsement of Vance, a source close to Mandels campaign said Thursday that it threw up a last-minute obstacle for the former president to consider: an internal Republican poll conducted by his campaign showing Mandel in front with 33 percent of the vote, followed by Matt Dolan and Mike Gibbons tied at 15 percent.",
    "The report also indicates that Trump had been calling others to get their opinion on him endorsing Vance, though other Republican figures have been hoping he'd endorse other candidates, such as Josh Mandel, who formerly served in the Ohio House of Representatives and as the Ohio State Treasurer.",
    "Similarly, Republican-turned-CNN wunderkind Alyssa Farah recently lamented that she cant believe we are losing Rob Portman for potentially this guy.? Farah does not realize that in Ohio, where Trump won both 2016 and 2020 by eight points, her disavowal of Vance is akin to a glowing endorsement.",
    "In a piece for American Greatness, Cortes addressed why he supports Vance, also acknowledging that the candidate was wary of Trump in 2016, but has since warmed up to him:\nLike any advocate of bold reforms, Vance has drawn the scorn of plenty of effete elites.",
    "From the report:\nIn recent days, Trump began calling donors and advisers to get their opinion endorsing on the Hillbilly Elegy? author, but he held off under intense pressure from the rival Republican campaigns of Josh Mandel and Jane Timken, the sources said.",
    "The poll showed that, even with Trump's endorsement, Vance rose to 15 percent support but was still in a three-way tie for second with Mandel marginally in the lead at 19 percent  a sign that Trump's endorsement had weight but was not determinative.",
    "https://t.co/2CqGmkxTlP\n Steve Cortes (@CortesSteve) April 14, 2022\nRep. Matt Gaetz (R-FL) also tweeted about Vance earlier on Thursday, sharing a tweet from last August that included a clip of Vance appearing on Fox News' \"Tucker Carlson Tonight.\"",
    "\"The Mandel people hit the roof,\" one Republican with knowledge of the discussions told NBC News, noting that Ohio Republican Rep. Jim Jordan tried to dissuade Trump on behalf of Mandel, whom the congressman supports.",
    "https://t.co/8x0gb9uCHt\n Matt Gaetz (@mattgaetz) April 14, 2022\nIt's worth noting, however, that the endorsement has not yet come, and it may not come after all, though Trump would likely not endorse anyone, then.",
    "The battle for the U.S. Senate, which Democrats currently only control because Vice President Kamala Harris serves as a tie-breaking vote, could come down to Ohio's Senate seat with the retirement of Sen.",
    "The Washington Post, owned by oligarch Jeff Bezos, recently ran a lengthy piece on Vances radicalization,? going so far as to ridicule his beard as a prop to appeal to laborers.",
    "Vance.? Neither Vance nor his supporters should worry about the condemnation of a former Harvard professor, MSNBC pundit, and associate of the scandal-plagued Lincoln Project.",
    "Whats more, his embrace of the 45th president and Trumps agenda cost him dearlyhe immediately lost the adoration of the elites who had formerly welcomed him.",
    "And those who have spoken to Trump or his advisers in recent days say he sees the most growth opportunity with Vance and a chance to make a real difference.",
    "Cook Political Report has it at \"Lean Republican,\" while Sabato's Crystal Ball is at \"Likely Republican\" and Inside Elections is \"Solid Republican.\"",
    "They seem particularly annoyed that this person they considered to be part of their privileged club? publicly advocates against their corruption.",
    "Vance also finds detractors among GOP skeptics claiming that he is insufficiently MAGA because of his prior criticisms of President Trump.",
    "Former President Donald Trump may soon be wading in, with an NBC News report indicating he plans to endorse \"Hillbilly Elegy\" author J.D.",
    " Not a biologist (@MichaelRCaputo) April 14, 2022\nVance already has support from Steve Cortes as well, who also formerly advised Trump.",
    "Should Trump do so, it will come after he endorsed Dr. Mehmet Oz last weekend, though not all were happy with that endorsement either.",
    "Michael Caputo, who formerly advised Trump, indicated over Twitter in a reply to the report that he is encouraging support for Vance.",
    "Reporting today that Pres Trump will endorse @JDVance1\nWould be the right move for 45 and a big boost for Vance in Ohio!",
    "In pursuit of higher goals for Americas citizens, Vance passed up on a comfortable path of accolades and rewards.",
    "Republicans are already predicted to win back control of the House, and may win control of the Senate as well.",
    "@JDVance1 and I disagree on Russia-Ukraine but I was encouraged by his thoughtful approach to our discussion.",
    "Warmonger Tom Nichols penned his own hit piece on Vance for The Atlantic, titled The Moral Collapse of J.D.",
    "This Ohio seat has been included in several lists of what to watch for in the upcoming midterm elections.",
    "The piece was from February, but Cortes tweeted it once more in light of Trump's expected endorsement.",
    "And its only nobody if somehow the other campaigns can get him to hold off,\" the source continued.",
    "Trump won Ohio in 2016 with 51.7 percent of the vote and in 2020 with 53.3 percent of the vote.",
    "Like millions of Americansmyself includedVance was indeed suspicious at first of Donald Trump.",
    "The Republican field is a particularly crowded field, with some memorable contentious moments.",
    "In public poling, Mandel and Gibbons lead the pack with roughly 20 percent of the vote each.",
    "But, once won over by President Trumps policy successes, Vance quickly reversed himself.",
    "So Trump can always change his mind,\" the NBC News report cited one source as saying.",
    "The predictions for this particularly seat look good for Republicans as well.",
    "\"But he already kicked the tires on everyone and hes ready to go with Vance.",
    "This conversion represents an authentic example of Vances thoughtfulness.",
    "But Vance isnt so far behind in the public polling that he cant catch up.",
    "Not everyone is thrilled with the possibility of such an endorsement.",
    "JD looks like a guy who would disrupt the establishment, not join it.",
    "I encouraged all my family in Ohio to support JD in the primary.",
    "The report cites \"three sources with knowledge of his decision.\"",
    "Vance and Jane Timken were tied at 9 percent in the Mandel poll.",
    "Vance, leading \"Vance\" to trend over Twitter on Thursday.",
    "He is a leader willing to reconsider issues and people.",
    "The primary is less than a month away, on May 3rd.",
    "It speaks well of his characterand his candidacy.",
    "I dont have to agree 100% with any candidate.",
    "This is consistent with my conversations.",
    "My article explaining my support for JD.",
    "\"He's the guy,\" Caputo in part tweeted.",
    "\"Nothing is final until its final.",
    "Its either Vance or nobody.",
    "Rob Portman, a Republican.",
    "Hes the guy.",
    "..."
  ]
}