{
  "id": 6410,
  "mediaId": 409,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Report: Trump Plans to Endorse J. D. Vance in the Ohio GOP Senate Primary",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/04/jdvance.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/report-trump-plans-to-endorse-j-d-vance-in-the-ohio-gop-senate-primary/",
  "sentiment": "0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nate Hochman",
  "authorUrl": "https://www.nationalreview.com/author/nate-hochman/",
  "termIds": [
    3103
  ],
  "sentences": [
    "But by all accounts, Mandels efforts have fallen on deaf ears: A February Daily Beast story reported that Trump has for months told people close to him that he thinks Mandel is a charisma-free weirdo and dork, according to three sources whove spoken to Trump about Mandel and the Ohio contest since last year.?\nWhile Vances standing in the polls remains uncertain, a Trump endorsement would likely bolster his chances in the GOP primary in a state that went for the former president by upwards of eight points in 2020.",
    "And its only nobody if somehow the other campaigns can get him to hold off.?\nPolling has continued to show Vance in third place, behind Josh Mandel and Mike Gibbons (per NBC, another source of doubt for Trump, who doesnt want his endorsement wasted), although a new April 5 poll from a pro-Vance super PAC showed Vance surging to a three-way tie with Mandel and Gibbons.",
    "(Campaign operatives for Mandel and Gibbons have been raising questions about the veracity of that poll, with both the Gibbons and Mandel campaigns agreeing to publicize portions of their internal polling in a bid to undermine the credulity of the .",
    "In recent days, Trump began calling donors and advisers to get their opinion endorsing on the Hillbilly Elegy? author, but he held off under intense pressure from the rival Republican campaigns of Josh Mandel and Jane Timken, the sources said.",
    "The Mandel people hit the roof,? one Republican with knowledge of the discussions told NBC News, noting that Ohio Republican Rep. Jim Jordan tried to dissuade Trump on behalf of Mandel, whom the congressman supports.",
    "Its an open question as to whether the endorsement will be enough to push Vance over the finish line  particularly as it comes just a few weeks before the primary is set to take place on May 3.",
    "According to an NBC News report, Trump is planning to make a late-stage endorsement of Hillbilly Elegy author J. D. Vance in the GOP primary for Ohios U.S. Senate race.",
    "Both Vance and Mandel (the latter the races presumptive front-runner until recently) have vied for Trumps favor.",
    "So Trump can always change his mind,? said one source who had spoken recently to Trump about the Ohio race.",
    "The story also claims that Vances anti-Trump past had been a source of hesitation for the former president.",
    "Vance in Ohios crowded senate GOP primary, according to three sources with knowledge of his decision.",
    "And there is still a bit of uncertainty hanging over the decision:\nNothing is final until its final.",
    "But he already kicked the tires on everyone and hes ready to go with Vance.",
    "Per Marc Caputo:\nFormer President Trump is planning to endorse J.D.",
    "survey,? the Washington Examiner reported earlier this week.)",
    "Its either Vance or nobody.",
    "But it certainly cant hurt.",
    ".",
    "."
  ]
}