{
  "id": 6411,
  "mediaId": 209,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Trump reportedly expected to endorse J.D. Vance in Ohio Senate race",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-continuous-scroll-mobile@1/v1649960584/GettyImages-1238574761.jpg",
  "link": "https://theweek.com/donald-trump/1012582/trump-reportedly-expected-to-endorse-jd-vance-in-ohio-senate-race",
  "sentiment": "0",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    3103
  ],
  "sentences": [
    "According to three individuals familiar with the matter, Trump has, in recent days, begun calling \"donors and advisers\" to get their opinion on a Vance endorsement, but \"intense pressure\" from other GOP campaigns has kept him at bay, NBC News writes.",
    "But those who've spoken to him or his advisers recently say the ex-president nonetheless sees a lot of potential for growth in the Hillbilly Elegy author.",
    "For example, Republican candidate Josh Mandel's campaign reportedly \"hit the roof\" upon hearing the news of Trump's expected decisions.",
    "Trump is also concerned, however, he might \"waste his endorsement\" on Vance, who is running in about third place, NBC News writes.",
    "In January, staunch Trump devotee and Georgia Rep. Marjorie Taylor Greene (R) gave the candidate her seal of approval.",
    "But the former president \"already kicked the tires on everyone and he's ready to go with Vance.",
    "And it's only nobody if somehow the other campaigns can get him to hold off,\" the source said.",
    "Former President Donald Trump is reportedly planning to endorse Senate candidate J.D.",
    "Trump's support also wouldn't be the first high-profile endorsement for Vance.",
    "Vance in the crowded and contentious Ohio primary race, NBC News reports.",
    "Of course, \"Trump can always change his mind,\" a source told NBC News.",
    "\"Nothing is final until it's final.\"",
    "It's either Vance or nobody."
  ]
}