{
  "id": 6418,
  "mediaId": 65,
  "date": "d2022-04-13T10:53",
  "headline": "Ohio GOP Senate contender Timken takes aim at Biden's 'runaway inflation' in new ad",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/051ed548-2cb4-4522-a23f-1fe5cfd29690/643c17d5-97cb-4476-8121-7636f8f6847e/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/ohio-gop-senate-contender-timken-biden-runaway-inflation-ad",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    1147,
    2027,
    2087,
    2466,
    3103,
    379,
    428,
    571,
    2594,
    2845
  ],
  "sentences": [
    "Inflations been front and center in dozens and dozens of ads by Republican candidates, committees and outside groups during the 2022 election cycle, as the party believes the issue will hurt Democrats as they try to hang on to their razor-thin majorities in the House of Representatives and Senate in Novembers midterm elections.",
    "Other than Dolan, the other major contenders have been showcasing their support for former President Donald Trump, who remains the most popular and influential politician in the GOP as he endeavors to play a kingmaker role in the partys 2022 primaries and repeatedly teases another White House run in 2024.",
    "The other major Republican candidates in the race are 2018 Ohio GOP Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer and investment banker; former Ohio treasurer and former two-time Senate candidate Josh Mandel; venture capitalist and best-selling author J.D.",
    "In a primary race in which all nearly all the major contenders have plenty of personal wealth or are backed by well financed outside groups, ad spending is soaring in Ohios Senate race, with nearly all the spending coming in the GOP primary.",
    "RETIRING GOP SENATE PORTMAN BACKS JANE TIMKEN IN COMBUSTIBLE RACE TO SUCCEED HIM\nRepublicans have hammered the Biden administration and congressional Democrats over the dramatic rise in consumer prices since last summer.",
    "The Timken campaign tells Fox News the commercial, which launched with just under three weeks to go until Ohios May 3 primary, is the latest in a seven-figure ad blitz in major media markets across the Buckeye State.",
    "Ryan is considered the favorite for the Democratic nomination in race that also includes progressive Morgan Harper, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "FIRST ON FOX: Jane Timken is taking aim at President Biden over \"runaway inflation\" as part of a statewide ad blitz in her bid for the Republican Senate nomination in Ohios crowded and competitive GOP primary.",
    "THE LATEST FOX NEWS POLL IN OHIO'S CROWDED AND COMPETITIVE GOP SENATE PRIMARY\nTimken vows in the spot that if elected shell \"stop\" what she calls \"Bidens socialist agenda and runaway inflation.\"",
    "Timken launched her new commercial the day after the Labor Department reported that the consumer price index, which tracks inflation, jumped by 1.2% in March and soared 8.5% over the past year.",
    "Timken, whose husband is the former chairman, CEO and president of his familys steel manufacturing corporation, is one of eight candidates in the GOP primary race to succeed retiring GOP Sen.",
    "Now everything from groceries to gas and meals with our families cost more,\" the former Ohio GOP chair charges in the ad, which was shared first with Fox News on Wednesday.",
    "But throughout her 14-month-long campaign for the Senate, Timken has showcased her grassroots appeal and her campaigns organizational strength in gaining supporters.",
    "Vance; and state Sen. Matt Dolan, a former county and state prosecutor whose family owns Major League Baseballs Cleveland Guardians.",
    "According to the government figures, food prices rose 8.8% over the past year, with gasoline prices skyrocketing up 48%.",
    "The winner of the Republican primary may face off against longtime Democratic Rep. Tim Ryan of northeastern Ohio.",
    "No Balanced Budget, no Paycheck,\" she says in the ad as she sits at a table in a diner in Canton, Ohio.",
    "Timken tweeted that her team knocked on over 12,000 doors in Ohio on Saturday.",
    "\"It's time for Congress to Balance the Budget, just like families in Ohio do.",
    "If the politicians don't Balance the Budget, they shouldn't get paid.",
    "Timken describes herself as a \"Trump conservative\" in the commercial.",
    "So far, Trump has remained neutral in the Ohio GOP primary.",
    "\"Joe Bidens wasteful spending has sent prices skyrocketing.",
    "Rob Portman, who endorsed Timken in the race."
  ]
}