{
  "id": 6425,
  "mediaId": 233,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Who is Tim Ryan? What to know about the congressman running for senate in Ohio",
  "image": "https://www.gannett-cdn.com/presto/2019/07/31/USAT/85cacadd-7904-4ba4-bae6-82cb0fde4bfa-AP_Election_2020_Debate.JPG?crop=2626,1478,x0,y17&width=2626&height=1478&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/03/30/tim-ryan-ohio-senate-race-2022/7197062001/",
  "sentiment": "0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Orlando Mayorquin",
  "authorUrl": "https://www.usatoday.com/staff/6610183001/orlando-mayorquin/",
  "termIds": [
    3103
  ],
  "sentences": [
    "The states Republican-led redistricting commission recently redrew the 13th and other congressional districts, but the changes were struck down by the Ohio Supreme Court for unfairly advantaging Republicans.",
    "Ryan voted to pass the PRO Act in 2021, which expands protections for workers attempting to unionize, and has pledged to continue his support for raising the federal minimum wage to $15 an hour.",
    "Part of Ryans plan for revitalizing the states working class includes creating new jobs by investing in infrastructure and funding more apprenticeship and skills training programs.",
    "He will face off against progressive candidate and attorney Morgan Harper and tech executive Traci Johnson in the Democratic primary on May 3.",
    "Ryans campaign focuses on Ohioan workers, promising to revitalize the states once thriving manufacturing sector and to push for higher wages.",
    "2022 midterm Senate races: Pennsylvania, Arizona, Alabama; the Senate primary races to watch in 2022\nTrump Ohio endorsement?",
    "Ryan qualified for the first couple Democratic debates in summer 2019, but failed to crack 1% in the national polls.",
    "Ryans career in politics began in 1994 when he worked as an intern for Democratic Ohio congressman James Traficant.",
    "Ryan also won the endorsement of a number of Ohio labor unions, including the AFL-CIO and the United Auto Workers.",
    "In the crowded Ohio senate race, House member Tim Ryan is the frontrunner on the Democratic side of the ticket.",
    "His longshot bid for the presidency ended in Oct. 2019, when he announced his withdrawal from the race.",
    "In 1995, Ryan got a bachelors degree in political science from Bowling Green State University in Ohio.",
    "Ryan is basing his campaign on 14 key issues, but the thrust of his pitch centers Ohios working class.",
    "Ryan launched his campaign to replace retiring Republican Senator Rob Portman in April of last year.",
    "The Ohio Democratic party endorsed Ryan in February, as did Democratic Senator Sherrod Brown.",
    "Ryan was born and grew up in Niles, a northeastern Ohio town near Cleveland and Youngstown.",
    "They live in Howland, Ohio and have three kids together, two from Zetts previous marriage.",
    ":What to know about the ex-Ohio state treasurer in his third senate run\nWho is Tim Ryan?",
    "He represents the 13th congressional district, which encompasses Youngstown and Warren.",
    "Ryan is a Democrat who represents Ohios 13th district in the House of Representatives.",
    "Fellow democratic Ohio congresswomen Joyce Beatty and Marcy Kaptur also endorsed Ryan.",
    ":What to know about venture capitalist running for senate in Ohio\nWho is Josh Mandel?",
    "He then got a law degree from the University of New Hampshire Law School in 2000.",
    "Ryan's campaign focuses on Ohio's working class\nIn 2019, Ryan ran for president.",
    "Ryan hoped to win the democratic nomination for the 2020 presidential election.",
    "Before Ryan was elected to Congress, he served as an Ohio state senator.",
    "Ryan's major endorsements come from the Ohio Democratic party and Ohio.",
    "Ryan represents northeastern Ohio in U.S. House of Representatives.",
    "Ryan has served in the House of Representatives since 2003.",
    ":Trump doesn't want to back a loser in Ohio Senate race.",
    "He announced his candidacy for president in April 2019.",
    "Here is what to know about Ohio senate candidate Ryan.",
    "He is also a former Democratic presidential candidate.",
    "He has represented Ohio in the Congress since 2003.",
    "Ryan married his wife Andrea Zetts in 2013.",
    "What part of Ohio does Tim Ryan represent?",
    "But he hasn't found a winner\nWho is J.D.",
    "Ryan is in his 10th term in the house.",
    "Zetts is an elementary school teacher.",
    "When did Tim Ryan run for president?",
    "Where did Tim Ryan go to college?",
    "Does Tim Ryan have a family?",
    "What is Tim Ryans platform?",
    "Who has endorsed Tim Ryan?",
    "Where is Tim Ryan from?",
    "How old is Tim Ryan?",
    "Sen. Brown.",
    "Vance?"
  ]
}