{
  "id": 6429,
  "mediaId": 43,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Like where are the dads?: Tucker Carlson calls for violence against teachers who talk identity",
  "image": "https://images.dailykos.com/images/1058257/story_image/ScreenShot2022-04-11at5.18.54PM.png?1649711959",
  "link": "https://www.dailykos.com/story/2022/4/12/2091388/-Tucker-Carlson-encourages-parents-to-thrash-teachers-says-they-are-grooming-children",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    1480,
    1801,
    2497,
    3103,
    4171,
    2661
  ],
  "sentences": [
    "x\ngthe right, led by Tucker Carlson, has been explicitly calling on LGBTQ and ally teachers to be beaten up, fired in order to prevent \"pedophilia\"ghttps://t.co/lF8CFX1ORf pic.twitter.com/E3I7qCIPvx\n Brennan Sueng?gg (@brennansuen) April 11, 2022\nMultiple people associated with Fox News have made comments condemning teachers who not only teach about gender but LGBTQ issues and critical race theory.",
    "\"All we're telling them is you can't groom young children and to them it's Armageddon, and that's because they know they have to indoctrinate the kids into this madness very, very young.?\nCarlson agreed at the time, responding: \"You can't commit sexual abuse against my kindergartners, and that's what this is.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nHow Democrats are fighting to hold the House, with Ali Lapp\nThe Downballot\nFollowShare\n0:0050:44\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nIf you dont want to be called a groomer, dont try to sexualize 6-, 7-year-old children.",
    "The comment came as he defended new legislation in Florida, coined the \"Don't Say Gay? bill, that blocks teachers from discussing issues of gender identity and sexual orientation with children in kindergarten through third grade.",
    "In a segment of Tucker Carlson Tonight that aired Friday, Carlson said anyone talking about sex to kindergartners 'should be beaten up.\nCalling for parents to resort to violence, he said: ?I don't understand where the men are.",
    "What kind of country do you want to live inwhere families control what values their children grow up in, or where Joe Biden and the pharmaceutical companies get to do that??\nThe comments made are not a surprise.",
    "Listen and subscribe to Daily Kos Elections The Downballot podcast with David Nir and David Beard\nx\nx\nYou need to enable JavaScript to run this app.",
    "Carlson has been targeting teachers for some time and has always encouraged violence on his show toward those who dont agree with his views.",
    "The March comment came out in conversation with Matt Walsh, a political commentator for the conservative news site The Daily Wire.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Like this is an agent of the government pushing someone else's values on your kid about sex, like where's the pushback?\"",
    "They both referred to the topic of gender identity in schools as \"madness,\" and accused teachers of grooming children.",
    "Vance, like other GOP officials, took to accusing Democrats of sexualizing? children by discussing issues of gender.",
    "Some have even gone as far as making social media content that spreads false information to evoke violence.",
    "\"You shouldn't be talking to kindergartners about gender identity, especially if you're not their parents.",
    "From hating on women to hating on the homeless, hes now targeting teachers who discuss gender identity.",
    "\"Look, there's a reason why Democrats are treating this bill like it's the apocalypse,\" Walsh said.",
    "Conservatives seem to have no boundaries and will stop at nothing to spread hate in the country.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "You talk to a normal person's kids about sex in kindergarten, you get beaten up.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "You're not allowed to commit it, and if you do, there are consequences.",
    "At the end of the day, like you said, this is about parental rights.",
    "Vance were discussing the bill and gender topics in the classroom.",
    "You know, some teacher's pushing sex values on your third grader.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "But Carlson is not the only one advocating harm to teachers.",
    "Both Carslon and Republican Ohio Senate candidate J.D.",
    "He made similar comments in a March segment.",
    "Why don't you go in and thrash the teacher?",
    "\"You should be arrested for that, in fact.",
    "This is a short blurb about Daily Kos.",
    "Its really that simple,? Vance said.",
    "There should be real consequences.",
    "You should be beaten up, please.\"",
    "Tucker Carlson is at it again.",
    "That's creepy,\" Carlson said.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Like where are the dads?",
    "Like for real, I think.\"",
    "Daily Kos is different.",
    "It's sexual abuse.",
    "Please read it."
  ]
}