{
  "id": 6432,
  "mediaId": 195,
  "date": "d2022-04-10T12:00",
  "headline": "Democrats seek to win over Ukrainian Americans by portraying GOP as soft on Russia",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/04/ukraine-protest-miami_030522_getty_ukraine-voters.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/campaign/3262822-democrats-seek-to-win-over-ukrainian-americans-by-portraying-gop-as-soft-on-russia/",
  "sentiment": "-0.313",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    1801,
    2303,
    3103,
    142,
    146,
    428,
    3457,
    2888,
    2942
  ],
  "sentences": [
    "After six House Republicans voted against a bill directing the government to collect evidence related to war crimes and other atrocities committed during the full-scale Russian invasion of Ukraine,? the Democratic Congressional Campaign Commission (DCCC) tweeted that The GOPs Pro-Putin faction is anti-democratic.?\nPrior to that, Rep. Madison Cawthorn (R-N.C.) faced backlash for calling Ukrainian President Volodymyr Zelensky a thug.? Democrats and his Republican colleagues immediately slammed the remarks.",
    "I know that the ones who do know will think thats unfair but the fact is that the former president is badly, badly misguided if not outright delusional about who Putin is, and he has been followed down that dangerous path by, not just members of Congress but leading commentators like Tucker Carlson and others.?\nMaloney went on to praise Bidens performance in handling the war in Ukraine as extraordinary,? but the views of Ukrainian Americans are more nuanced.",
    "Vance found himself in hot water for saying a few days before Russia invaded, but after Putin had amassed troops on the border, that he doesnt really care what happens to Ukraine one way or another.? He later issued a statement calling the situation in Ukraine an unquestionable tragedy.?\nStrategists on both sides of the aisle say Vances initial comments made him sound unfamiliar with northeastern Ohios rich Ukrainian communities.",
    "If you had a Republican-leaning Ukrainian in those areas and they cared about abortion and a candidate said Im pro-life, I think the Ukrainian might say Ill factor that in, but if that same candidate came out and said I dont understand why were siding with Ukraine, I think theyre such single-issue voters that they would say I dont care, Im voting you out of office,? Nynka added.",
    "I dont think there are many people in the community that are arguing the U.S. should send in troops, but I think they very much are saying provide Ukraine with what it needs.?\nLast month, 27 foreign policy experts signed an open letter in Politico urging the Biden administration to implement a humanitarian no-fly zone over Ukraine.",
    "Theres a recent poll by Pew that said that only six percent of American adults are expressing confidence in Putin, and as far as we can tell, all six percent of them are either Republican candidates or elected officials.?\nTo be sure, Republicans are largely united in favor of Ukraine and against Russian President Vladimir Putin.",
    "Orest Deychakiwsky, a former policy adviser for the U.S. Helsinki Commission and member of the Ukrainian Americans for Biden steering committee, said approval of the presidents job handling the war in Ukraine has been mixed among the community.",
    "You will see Ukrainian church tops for the next couple miles.?\nThose who serve the Ukrainian community say that comments questioning U.S. involvement with Ukraine do nothing to help candidates with Ukrainian Americans at the ballot box.",
    "While polling has shown that the president has received high marks for his handling of the conflict, he still faces pressure to implement a no-fly zone, an action that many Ukrainians and Ukrainian Americans would like him to take.",
    "Its probably worth mentioning that the other party had a little trouble figuring out who the good guys and the bad guys are in Ukraine,? Democratic Congressional Campaign Committee Chair Sean Patrick Maloney (D-N.Y.) told The Hill.",
    "This week, Floridas Democratic Party touted an op-ed by Ukrainian Floridians criticizing Sen. Marco Rubio (R-Fla.) for missing past hearings for the Helsinki Commission, a European security group of which he is a member.",
    "Meanwhile, the Democratic super PAC, American Bridge, rolled out a five-figure, partial Ukrainian-language print ad earlier this month, hitting Republican figures for past comments on the Russian invasion of Ukraine.",
    "The party is aiming to portray Republicans as weak on Russia in messaging directed at Ukrainian Americans, who, while not monolithic, have in recent history leaned conservative when it comes to foreign policy issues.",
    "We can handle many different issues at the same time.?\nFormer President Trump also faced backlash for calling Putin savvy? and a genius? after the start of the invasion but has since walked back the comments.",
    "Its that recent history and the latest statements some Democrats are pointing to in their attempts to flip the script that since former President Reagan has painted the GOP as the party thats tough on Russia.",
    "Hes gone off the deep end for me and for most Ukrainians.?\nDemocrats have used comments from Carlson, as well as GOP lawmakers and candidates, to hit their Republican opponents over the issue of Ukraine.",
    "Were looking for someone whos sophisticated [and] can address foreign relations and domestic needs at the same time,? said Marta Kelleher, president of the United Ukrainian Organizations of Ohio.",
    "Including, I might add, not only Republicans but a lot of Democrats.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "But its been conservative Fox News host Tucker Carlson who has received much of the ire of the Ukrainian American community for his rhetoric, which they say is overly sympathetic to Putin.",
    "The administration has done a lot, obviously in terms of sanctions, obviously in terms of the weapons that have been provided, but yes, everybody wants more,? Deychakiwsky said.",
    "It would infuriate them,? said Andrew Nynka, the editor-in-chief of the Ukrainian Weekly, a publication that was initially established to serve the Ukrainian American community.",
    "Three years ago Trump himself got himself in hot water when he delayed security aid to Ukraine as part of an effort to get that countrys leaders to investigate Biden.",
    "A group of Ukrainian American protesters made headlines on Saturday when they held a silent demonstration outside of a San Diego church Carlson was speaking at.",
    "Campaign\nDemocrats are pointing to the war in Ukraine as part of their effort to undercut Republicans with Ukrainian American voters ahead of the midterms.",
    "But a small number of lawmakers or candidates have questioned the U.S.s stance on the invasion  and Democrats were quick to highlight those remarks.",
    "Ukrainian Americans make up a small percentage of voters, but many reside in key midterm states like Ohio, Pennsylvania, Michigan and Florida.",
    "I was a big fan of Tucker Carlson,? said Myron Kuropas, a Ukrainian American and former professor at Northern Illinois University.",
    "The DCCC then sent out a blast tying Karoline Leavitt, a New Hampshire GOP House candidate endorsed by Cawthorn to the comments.",
    "Vance faced criticism last month for arguing that U.S. domestic policies should take precedence over the war in Ukraine.",
    "The spot ran in in cities with large Ukrainian American populations including Cleveland, Detroit and Philadelphia.",
    "This is an issue that is uniting Americans across the U.S.,? said Jessica Floyd, the president of American Bridge.",
    "The ad took aim at Reps. Ted Budd (R-N.C.) and Paul Gosar (R-Ariz.), Ohio Senate candidates Josh Mandel and J.D.",
    "Carlsons comments have drawn backlash from Democratic and Republican Ukrainian American voters alike.",
    "I think the entire community said no-fly zone, close the skies, give them more weapons,? Nynka said.",
    "Of course, Ukrainian Americans also have an eye on candidates domestic agendas.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "And Ohio Republican Senate candidates Josh Mandel and J.D.",
    "Drive Interstate 71 north into Cleveland and look east.",
    "Has he ever been into the Slavic villages of Cleveland?",
    "Obviously not,? said one Ohio Republican strategist.",
    "Vance, and former Secretary of State Mike Pompeo.",
    "The move resulted in Trumps first impeachment.",
    "These are not mutually exclusive.",
    "Were America."
  ]
}