{
  "id": 6434,
  "mediaId": 19,
  "date": "d2022-04-10T00:00",
  "headline": "Ohio GOP Senate Candidate Mike Gibbons: Middle Class Not Really Paying  Fair Share in Taxes",
  "image": "https://media.breitbart.com/media/2022/04/AP22088062628110-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/10/ohio-gop-senate-candidate-mike-gibbons-middle-class-not-really-paying-fair-share-taxes/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    1054,
    1801,
    3103,
    379,
    428,
    571,
    3412,
    2845
  ],
  "sentences": [
    "Ohio GOP Senate candidate Mike Gibbons on a Crains Cleveland Business podcast:\nThe top 20% of earners in the U.S. pay 82% of federal income tax  and, you do the math, and 45% to 50% dont pay any income tax The middle class is not really paying any kind of a fair share.? pic.twitter.com/VUYzPTlqmX\n Heartland Signal (@HeartlandSignal) April 8, 2022\nNow the problem is, you need the middle class to win an election.",
    " @JDVance1 #OHSen pic.twitter.com/Ldexv2Sy2j\n JD Vance for U.S. Senate Press (@JDVancePress) April 9, 2022\n[Gibbons] has proposed raising taxes on middle class Americans  and you sort of look at whats going on in our country and you recognize that Amazon, Facebook, Google, Apple they pay a lower tax rate than every middle class Ohioan,? Vance said.",
    "Data from the Federal Reserve shows that the middle class  defined as 60 percent of U.S. households in the middle of all income brackets  has seen its share of national wealth plummet to just 26.6 percent while the top one percent of households have seen their share rise to 27 percent.",
    "The top 20 percent of earners in the U.S. pay 82 percent of federal income tax  and, you do the math, and 45 percent to 50 percent dont pay any income tax, you can see the middle class is not really paying any kind of a fair share depending on how you want to define it,? Gibbons said.",
    "Mike Gibbons, the millionaire investment banker running for the United States Senate in Ohios Republican primary, says middle class Americans are not really paying any kind of a fair share? in federal income taxes, a newly surfaced video reveals.",
    "That data came as the nations richest billionaires grew their overall wealth by more than $340 billion in 2021  much thanks to economic lockdowns that gutted working and middle class income earners, as well as small and medium-sized businesses.",
    "Why arent we cutting the taxes of businesses that are creating jobs in our state and actually fixing the real problems that exist with some of these multinational corporations that are in bed with the communist Chinese?",
    "In actuality, economists at the University of California, Berkeley have found that Americas wealthiest income earners now pay an overall lower tax rate than all other Americans.",
    "\"@MikeGibbonsOH proposed raising taxes on middle-class AmericansYou recognize that Amazon, Google, Facebook, Apple, they pay a lower tax rate than any middle-class Ohioan.",
    "The economists found that, in 2018, the nations top economic elite are paying lower federal, state, and local tax rates than the nations working and middle class.",
    "It just shows a total distortion of priorities when were talking about hurting middle class Ohioans while we let all these companies off the hook,? Vance said.",
    "Overall, these top 400 wealthy Americans paid just a 23 percent tax rate  a 47 percentage point reduction compared to what they paid, 70 percent, in 1950.",
    "In a podcast interview from September 2021, Gibbons suggested that federal income taxes ought to be raised on middle class Americans.",
    "So the narrative is, the middle class is getting screwed and the wealthy, the elite  are cheating everybody,? he continued.",
    "Vance, also running for the Ohio Senate seat in the GOP primary, blasted Gibbons for the remarks.",
    "Meanwhile, American middle class wealth has dropped to a historic low.",
    "Why are we raising tax rates on any middle class Ohioan?",
    "Why are we raising taxes on middle-class Ohioans?",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Why aren't we cutting their taxes?\"",
    "Why arent we cutting their taxes?",
    "Follow him on Twitter here.",
    "Best-selling author J.D."
  ]
}