{
  "id": 6435,
  "mediaId": 195,
  "date": "d2022-04-09T21:00",
  "headline": "Bottleneck: The border problems left behind by Title 42",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/04/shelter_juarez-mx_032922ap-christian-chavez_title-42.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/policy/national-security/3262913-bottleneck-the-border-problems-left-behind-by-title-42/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Beitsch",
  "authorUrl": "https://thehill.com/author/rebecca-beitsch/",
  "termIds": [
    2087,
    3103,
    314,
    3125,
    2701,
    2787,
    2945,
    4999
  ],
  "sentences": [
    "The Biden administration has reimplemented the policy due to court order, but officials acknowledged its use could swell after the lifting of Title 42.\nIts very concerning to us because Remain in Mexico returns asylum-seekers to the very same dangerous threats that asylum-seekers expelled under Title 42 faced, so from a human rights perspective, its just as concerning as Title 42,? said Kennji Kizuka with Human Rights First.",
    "Encounters of migrants are likely to spike because there are thousands of people that have been expelled over the past two years who may still want to migrate  and we know from past instances of restrictive policies being lifted that smugglers do take advantages of those changes to migration saying that now is your best opportunity to make it to the U.S.,? said Jessica Bolter with the Migration Policy Institute.",
    "Vance this week released an ad claiming that Joe Bidens open border is killing Ohioans with more illegal drugs and more Democrat voters pouring into this country.?\nImmigration advocates say 2016-style anti-immigrant rhetoric will feature in the 2022 midterms no matter what and caution Democrats would be better off leaning into positive changes in immigration policy.",
    "If that were the case, if we were seeing 18,000 migrant crossings per day, and if that were sustained for a month, that would be a higher level of migration than weve seen in at least the past two decades, which is as far back as we have good data,? Bolter said.",
    "Particularly for single adults, simply being turned back to Mexico under Title 42 is a less severe consequence than they would have experienced pre-Title 42, when they would undergo formal removal proceedings or even been criminally prosecuted,? Bolter said.",
    "So the fact that there have been people blocked from getting into the U.S. who still want to get in and the fact that this narrative of a new opportunity to get into the U.S. is likely to spread, both mean we will likely see a rise in crossings,? Bolter.",
    "Experts contend Title 42 did not create the closed? border Republicans claim, but instead contributed to chaos because it made it easier for Mexican and Central American nationals to reattempt unauthorized border crossings after being expelled.",
    "But the numbers may not be as high as some are predicting, and the Biden administration has vowed to swiftly remove those without a legal right to remain in the U.S., a stance that could lead them to further rely on other Trump-era policies.",
    "The Department of Homeland Security (DHS) is already preparing for such a surge, a move they said could result from Title 42 as well as a preference by some to migrate in the spring, when milder weather can aid a still dangerous journey.",
    "But while the department is bracing for figures as high as 18,000 crossings a day  a steep jump from current migration levels of around 7,000 a day  experts say such a total may not be able to be sustained over the long run.",
    "One thing to consider here is how many migrants are already at the U.S.-Mexico border,? said Cris Ramn, a migration consultant, pointing to estimates of anywhere from 30,000 to 60,000 migrants near the southern border.",
    "All Republicans have to offer are ugly attack ads, open borders falsehoods, and the same cruel and chaotic policies that Trump and Stephen Miller advanced,? said Frank Sharry, executive director of Americas Voice.",
    "While that could help vulnerable Democrats appeal to some independent voters who are tired of the chaos, many Republicans are already adjusting their message to strike at high immigration numbers, orderly or not.",
    "National Security\nThe lifting of Title 42 means the Biden administration now must contend with a bottleneck at the border created over two years as the U.S. denied migrants their legal avenue for seeking asylum.",
    "The issue is already turning into a major political fight, with Republicans seeking to target the administration as soft on immigration by lifting a rule they see as a commonsense? border control measure.",
    "Title 42, crafted under the Trump administration in the early days of the pandemic, used a public health authority to quickly expel foreign nationals without giving them the chance to seek asylum.",
    "I think this is where people are missing the bigger point, which is the Mexican government is working really closely with the U.S. to control migration into Mexico and at the U.S.-Mexico border.",
    "I am here today with one clear message: Title 42 has failed,? Aaron Reichlin-Melnick, policy counsel at the American Immigration Council, told the House Homeland Security Committee this week.",
    "Mexico recently required citizens of Ecuador, Venezuela and Brazil to secure visas before arriving in Mexico, a step likely to block nationals seeking to make their way to the U.S. border.",
    "The interest of speed could push the administration to further rely on the Trump-era Remain in Mexico? program, which requires asylum-seekers to wait in Mexico for their U.S. court date.",
    "And new asylum cases are sure to pile up in the immigration court system regardless, even as Immigration and Customs Enforcement has directly its lawyers to clear low priority cases.",
    "Since Title 42 went into effect, the Border Patrol expelled a staggering 94 percent of single adult migrants it encountered who were from Mexico, Guatemala, Honduras or El Salvador.",
    "DHS has had over a year now to prepare for the end of Title 42, so [theres] no excuse to not be prepared to process asylum-seekers at ports of entry and along the border,? he said.",
    "Many say Title 42 itself will now be a key factor contributing to pressure on the border, creating a bottleneck after years of denying immigrants a legal right to seek asylum.",
    "The tools at the Biden administrations disposal wont work as quickly as Title 42, but they could have, over time, a greater deterrent effect than the Trump-era policy.",
    "Lets be who we are as a party and a nation, rather than emboldening a party that seeks to dehumanize immigrants and refugees to score political points,? added Sharry.",
    "And its end is likely to be publicized as a relaxation of U.S. border controls by human smugglers who could find a broad clientele with global migration on the rise.",
    "If Title 42 were a successful deterrent, we would expect such a near total shutdown of the border to lead to declining apprehension numbers,? added Reichlin-Melnick.",
    "And because with Title 42 theres no formal mark on their record, its much less costly to try again and again and get caught again and again,? Bolter added.",
    "But if DHS succeeds in streamlining the asylum process, images of chaos at the border could be replaced by processing lines and buses to the U.S. interior.",
    "And some Democrats in tough elections are seeking to distance themselves from the Biden administrations decision, joining in alarm over a migrant surge.",
    "Citizenship and Immigration Services officers will first review asylum applications, a move to alleviate pressure on the immigration court system.",
    "Designed to be rolled out in phases, it may only have a limited impact, especially if Congress does not approve funding for additional officers.",
    "While Title 42 was used 2.5 million times, at least 27 percent of those included in that figure attempted to cross the border at least twice.",
    "One thing to consider is that Mexico might continue to adopt hard-line policies making it harder to reach the U.S.-Mexico border,? Ramn said.",
    "Most will be placed in what is known as Title 8 proceedings, which Bolter said will take weeks, not hours? but are thoroughly documented.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The reality, however, of Title 42 and what lifting it means for the border is much more nuanced and complicated.",
    "Its a policy that directly contravenes asylum law, which grants the right to a hearing for asylum claims.",
    "And those who do try to cross the border will now face steeper consequences for doing so.",
    "We can have a secure border and a fair and functional asylum system.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "One statistic most obviously demonstrates Title 42s failure.",
    "The administration recently rolled out a program where U.S.",
    "For instance, Trump-aligned Ohio Senate candidate J.D.",
    "For the GOP, the border is all politics, no solutions.",
    "Democrats can walk and chew gum at the same time.",
    "Experts say an initial wave could subside.",
    "We can be humane and orderly."
  ]
}