{
  "id": 6438,
  "mediaId": 43,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "In a World This Mercilessly Stupid, How Could Sarah Palin NOT Come Back?",
  "image": "https://images.dailykos.com/images/1057427/story_image/73A36FC2-1D52-4A56-A091-A837078E01CF.jpeg?1649469909",
  "link": "https://www.dailykos.com/story/2022/4/8/2090954/-In-a-World-This-Mercilessly-Stupid-How-Could-Sarah-Palin-NOT-Come-Back",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "Well, Ketanji Brown Jackson has been successfully confirmed to the Supreme Court, despite the Senate GOPs demented smear campaign, (shes only soft on pedophiles, not a pedophile herself, at least she wasnt the last time I checked the fever swamps, though Im sure Hillary Clinton has plans to invite her over to partake of the traditional Democratic congratulatory child face buffet) though not without one final infantile conniption from the likes of Rand Paul and Lindsey Graham.",
    "Its working about as well as any of his recent schemes, I suppose; Russian diplomats?are getting expelled by the score, (enjoy the job market back home, kids) and invites to the United Nations Human Rights Councils Xmas party have been rescinded, which really stings, because Ban Ki-moon usually busts out his absolutely legendary karaoke version of Fox on the Run after an appletini or two.",
    "Frankly, the institutional GOP is kicking itself for not embracing QAnon sooner; turns out, you dont need any platform whatsoever, you can even embrace lunatic policies that kill tens of thousands of your constituents, so long as you train a sufficiently large base of credulous dirtbags to reflexively believe that anyone who disagrees with them about anything is a child molester.",
    "Yknow, youd think itd be obvious by now that theres nothing less fruitful than trying to piece some sort of consistent, coherent ethical system together from the hypocritical drivel Mitch McConnell offers up to excuse his ruthless, amoral pursuit of power, but damned if the feckless, autofellating pundit class doesnt insist upon wasting everyones time trying*.",
    "(Visit this blog posts historic birthplace here: showercapblog.com/...)\nThe Russian military has certainly had a tough time of it in Ukraine, (the murdering dolts cant even retreat competently) but after week upon week of catastrophic blundering, theyve finally stumbled onto one thing theyre actually halfway decent at: slaughtering civilians.",
    "I see Off-Brand Orbn wants us to believe it was only the Secret Service that prevented him from joining his loser hate mob in their march to the Capitol last January 6th, as though the whole world doesnt remember what happened the last time he was called upon to Walk a Short Distance in Public.",
    "Future war-mongering autocrats take note: its prudent to save the really major war crimes for securely held territory, because when youre forced to flee the field in defeat, residual evidence of your inhuman savagery can really turbocharge the worlds will to thwart your bloody ambitions.",
    "To just once click over to Ye Olde Shower Cappe Blog, braced for the expected litany of horrors, only to encounter a brief, Well whaddya know, the shitbuckets actually left us alone for a few days, I finally got around to that last season of Deadwood!? A boy can dream, cant he?",
    "Like an overmatched game show host trying to gaslight his way out of a global pandemic, Vlad the Miscalculators latest master plan involves claiming each freshly unearthed atrocity is in fact a dastardly Ukrainian false flag designed to make him look like a big ol meanie.",
    "Pretty standard Republican electoral politics here, by which I mean, juvenile performance art, designed to elicit malicious cackling from the shittiest people alive.?\n(The real outliers in this clown car full of bleeding rectums are, of course, Kinzinger and Cheney.)",
    "Well, for the low, low price of $2,500, you can secure your favorite cultist their very own spot on the faux grand jury? staged by a disgraced Elvis impersonator with a history of sexual assault, where everybody will play dress-up and pretend to indict Anthony Fauci.",
    "Now, outside of the generally undesirable spectacle of a federal legislator CELEBRATING HITLERS BIRTHDAY, Im afraid I must insist upon registering a complaint here; a satirists job is tough enough without all this unfair competition from reality.",
    "By the way, Taylor Greene made history this week, as the very first batshit-gargling conspiracy theorist to get mercilessly owned on both the floor of the U.S. House of Representatives and a late night talk show within a two-day span.",
    "Okay, okay, Gosar AND Vance are outliers, let us rather focus on Texas Governor Greg Abbott, who, trailing in the pivotal Racist Idiot primary, announced a moronic plan? to bus migrants from the border to Washington, D.C.",
    "While I understand and accept the bleak inevitability of the headline, Trump endorses Palin,? reading it still made me curl up in the fetal position on my kitchen floor, weeping tears of vomit, for several hours.",
    "Anyway, it seems like a particularly inappropriate time to be scrawling taunting little notes on the missiles youre launching at noncombatants, but maybe Vladward is just excited he got Pink Floyd back together.",
    "Im actually quite sympathetic to MAGA nations plight; it must be challenging, maintaining fanaticism in a cult of personality, when the personality in question is such an inveterate loser as Donald John Trump.",
    "Shit, they neglected to even mention Ruben Verastigui, the latest in a long, long, long, long, LONG fuckin line of prominent conservatives to earn an actual, real-life conviction for sexually abusing children.",
    "I finally gathered the strength to stand up and start cleaning the mess, but then along came Bin Ladens niece praises Marjorie Taylor Greene, Matt Gaetz for backing Capitol rioters? to knock me back on my ass.",
    "Oddly, in their fervor to incite a few theme park mass shootings, none of the shrieking heads of the right-wing rageosphere found time to condemn Tennessee Republicans proposed legalization of child marriage.",
    "Im talkin about TRUTH SOCIAL, which flopped so hard and fast youd think the man in charge was some sort of world-class shitwit who couldnt even figure out how to make money in the casino industry.",
    "Vance baking cupcakes for Adolf; no, hes far too busy cutting mega-racist campaign ads, and parroting the white nationalist great replacement? theoryon reflection, probably not the best example.",
    "Shopping for your slush-brained conservative relatives can be frustrating; theres room for just so many made-in-China red ballcaps amidst the doomsday prep kits and meth paraphernalia.",
    "Of course you have to concoct fake accomplishments to justify your blind fealty, otherwise youd have to face the reality that you worship a serial fuckup who cant even dress himself.",
    "And I know yall are redeploying and resupplying and all, but I, uh, wouldnt expect great things from the remnants of the force that oh-so-cleverly occupied Chernobyl.",
    "Just as a little palate cleanser, please enjoy this video of Senator Brian Schatz taint-punting insurrectionist shitweasel Josh Hawley into another goddamn galaxy.",
    "Keep it up, Pootie Tang, I think there are still six or seven Stinger missiles left in a garage somewhere that arent currently aimed at your butchering buffoons.",
    "Newly uncovered text messages reveal Don Juniors hilarious certainty that the Attempted Assclown Autogolpe would swiftly prove to be both easy and peasy.",
    "So, Paul Gosar, sitting United States Congressperson, is headed to yet another white nationalist shindig, this one in celebration of Hitlers birthday.",
    "Look, when you take a brain built from Trump family DNA and relentlessly batter it with cheap cocaine, you have to expect results like this.",
    "Oh, and if you pledged to my most recent comic book Kickstarter, your rewards are IN THE MAIL, so youve got that goin for ya.",
    "Now Lauren Boebert furiously demands Mickey Mouses cancellation, on the grounds that his name is just too darn hard to spell.",
    "Because Disneys content deviates from Laura Ingrahams grisliest gay-bashing fantasies, theyre grooming? children, you see.",
    "Golly, now even John Roberts is bemoaning his power-mad, wingnut colleagues abuse of the SCOTUS shadow docket process.",
    "Speaking of Donnie Dotards seven decades of incessant faceplanting, theres a brand-new fiasco for the fridge, Ma!",
    "Anyhoo, surely the glorious restoration of the Soviet Empire is just one more bombed-out maternity hospital away.",
    "Anyway, he didnt kill Bin Laden, Congresswoman McClain; you are now cordially invited to resign in shame.",
    "Its all so fucking exhausting, and I dont even have a declining dictator lobbing bombs at my house.",
    "I probably shouldnt fixate on Congressman Szell, excuse me, Gosar,? hes an outlier, right?",
    "Here at home, Republicans continue their extremely Putinesque assault on LGBTQ rights.",
    "Yeah, ol Doc Frankenstein was sure he could control the monster he made, too.",
    "A week without malignantly insane, world-wrecking assholesthats all I want.",
    "Congratulations, Marj; your prize is an all-expenses paid tripto Guam.",
    "*Remember, kids, Friends Dont Let Friends Share Chris Cillizza Posts!",
    "We should pay more attention to the GOPs fine, upstanding moderates!",
    "Sign up for updates at scenic showercapblog.com, btw!",
    "Its like the Dunning-Kruger effect, only for dignity.",
    "(There should be a song to help with that, yknow?)",
    "Stay safe out there if youre able, my lovelies.",
    "You wont catch wannabe Senator J.D.",
    "Wouldnt that be nice?",
    "God, I needed that.",
    "One little week.",
    "Lordy."
  ]
}