{
  "id": 6439,
  "mediaId": 558,
  "date": "4/8/2022 12:00:00 AM",
  "headline": "Ohio GOP Senate hopeful: Middle class doesn't pay fair share",
  "image": "https://s.yimg.com/ny/api/res/1.2/b_8ZOAzjh3bJoLBLL9vLyg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/Y.HLFa539_lVaBKtSkbt8A--~B/aD00MzM7dz02NTA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/cp.org/29e127972db281e82d2c8416adb0a13b",
  "link": "https://ca.news.yahoo.com/ohio-gop-senate-hopeful-middle-220617471.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1069,
    2305,
    3103,
    379,
    428,
    571,
    2614,
    2623,
    2845,
    2945
  ],
  "sentences": [
    "One opponent, Republican Mark Pukita, has had it posted on his YouTube page for the last three weeks with the caption \"Tax Hike Mike Gibbons.?\nAsked about the Scott plan during a Republican Senate debate last week, former Ohio Republican chair Jane Timken said she opposes his proposal to raise taxes on the middle class, while Hillbilly Elegy? author J.D.",
    "But they could take on new resonance after Republican Sen. Rick Scott of Florida, a potential 2024 presidential candidate, introduced a governing plan in February that has divided the party over its call to raise taxes on millions of Americans who dont earn enough to pay federal income taxes.",
    "The top 20% of earners in the United States pay 82% of federal income tax  and, if you do the math, and 45% to 50% dont pay any income tax, you can see the middle class is not really paying any kind of a fair share, depending on how you want to define it,? Gibbons said.",
    "Other leading Republicans, including Senate Minority Leader Mitch McConnell, have distanced themselves from Scott's proposal, worried that the prospect of raising taxes on lower income Americans could prompt election-year attacks from Democrats.",
    "Scott, who leads the Senate Republicans campaign arm, has said that paying even a small tax would give poor people skin in the game? to boost their interest and involvement in how tax dollars are spent.",
    "COLUMBUS, Ohio (AP)  Mike Gibbons, a leading Republican Senate candidate from Ohio, said at a media event last fall that middle-class Americans don't pay any kind of a fair share? of income taxes.",
    "Vance said the GOP needs to stand for middle-class people being able to raise a family and do it on a single income.?\nPresident Joe Biden included a in his 2023 budget proposal.",
    "The comments by Gibbons, a millionaire investment banker from Cleveland, were made in a September episode of The Landscape? podcast by Crain's Cleveland Business.",
    "In announcing the tax proposal, the Democrat asserted that a firefighter and a teacher pay more than double? the tax rate that a billionaire pays.",
    "Campaign spokesperson Samantha Cotten said Friday that Gibbons does not support raising taxes on businesses or individuals.",
    "Yet, ahead of the May 3 primary, Republican rivals are looking to use the comments against Gibbons.",
    "Hes not for raising taxes on the middle class.",
    "He signed a no-tax pledge,? she said."
  ]
}