{
  "id": 6442,
  "mediaId": 237,
  "date": "d2022-04-08T06:00",
  "headline": "JD Vance bets Ohio GOP Senate bid on illegal immigration",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/dc1162d/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F79%2F83%2F531f566d440caf58c25aad45234f%2Fpjimage-12.jpg",
  "link": "https://www.washingtonexaminer.com/news/j-d-vance-bets-ohio-gop-senate-bid-on-illegal-immigration",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-m-drucker",
  "termIds": [
    1147,
    1801,
    2524,
    3103,
    379,
    380,
    428,
    571,
    2845
  ],
  "sentences": [
    "The Republican, a venture capitalist who worked for GOP megadonor (and his super PACs chief financial patron) Peter Thiel, became a prominent national figure when sales of his bestselling memoir, Hillbilly Elegy, took off amid the focus on white, working-class voters who flocked to Trump in the 2016 presidential election.",
    "A Republican operative supporting Vances Senate bid said illegal immigration is the perfect issue for the first-time candidate to focus on because it fits neatly with his populist messaging and harnesses the deep opposition to Bidens agenda that has developed among stalwart Republicans.",
    "With Ohio impacted by an epidemic of fentanyl overdoses, connecting illegal immigration to the scourge of the criminal drug trade could resonate with GOP voters in a primary lately dominated by wealthy businessman Mike Gibbons and former state Treasurer Josh Mandel.",
    "In the 30-second ad, Vance preemptively dismisses accusations of racism for proposing that the federal government finish construction of a security barrier along the Southern border initiated by former President Donald Trump and halted by President Joe Biden.",
    "is standing out from the pack because he isn't just repeating talking points.?\nOn Thursday, Vance received a boost on another key issue, abortion, with a much sought-after endorsement from Ohio Right to Life, an influential conservative anti-abortion group.",
    "The biographical touch comes toward the spots conclusion, when Vance declares the wall vitally necessary to stopping illegal immigration and the illicit drug trade from Mexico that it facilitates, which is destroying Ohio families just like his.",
    "To vault ahead of the competition in the final weeks before the May 3 primary, Vance is streamlining his pitch to GOP voters and focusing almost exclusively on illegal immigration at the Southern border, with a biographical touch.",
    "Vance has been stuck in the middle of the pack in a crowded field of Republican contenders, although recent polling commissioned for his super PAC showed the 37-year-old conservative populist in a three-way tie for first.",
    "Nearly every poll in Ohio, as well as nationally, consistently shows immigration as one of the two top issues that Republican voters care about,? Vance campaign senior adviser Andy Surabian said, explaining the strategy.",
    "On that front, the timing of the presidents decision to eliminate Title 42 immigration restrictions implemented by Trump in response to the coronavirus pandemic could not have worked out better for Vance.",
    "But he hasnt gotten it solidified in voters minds that hes the one to fix it  and part of that is because voters dont know who he is,? a GOP operative said, requesting anonymity to speak candidly.",
    "Vance, a Trump critic at the outset of the former presidents administration, has long since become an enthusiastic supporter  a transformation his Republican opponents have hoped would derail him.",
    "Vance is turning to illegal immigration to rescue his uneven Ohio Senate campaign and come from behind to win the Republican nomination in this key red state primary.",
    "Vances messaging shift in the closing month of the campaign also was a tacit concession that his attempt to run a biography-centric campaign wasnt working.",
    "Trump, whose endorsement could tip the race, has yet to back a candidate in the primary but recently told the Washington Examiner he plans to do so.",
    "No child should grow up an orphan.? This message is being bolstered by television ads aired by Vances super PAC, Protect Ohio Values.",
    "Vances immigration strategy emerged this week with the broadcast of a new, politically charged television spot.",
    "In particular, they question the Republicans decision to personalize the pitch with his familys history.",
    "The media calls us racist for wanting to build Trumps wall,? Vance says, speaking straight to camera.",
    "Earlier this year, the group recommended Vance pivot to illegal immigration to salvage his campaign.",
    "Incredibly honored to be the only Senate candidate endorsed by Ohio Right to Life!",
    "Rob Portman, who is retiring, endorsed former Ohio GOP Chairwoman Jane Timken.",
    "To say my mother, 30 years ago, was victim because of immigration today?",
    "Hes trying to get himself back in the race with an issue we know works.",
    "But some Republican insiders in Ohio remain unimpressed with Vance.",
    "I nearly lost my mother to the poison coming across our border.",
    "Lets go win this thing!? Vance responded in a Twitter post.",
    "Hes on life support,? this operative said.",
    "Early voting in Ohio is already underway.",
    "This issue is personal.",
    "Do you hate Mexicans?",
    "Its a good issue.",
    "Republican Sen.",
    "Just In...\nJ.D.",
    "Its a stretch.",
    "J.D."
  ]
}