{
  "id": 6449,
  "mediaId": 65,
  "date": "4/7/2022 12:00:00 AM",
  "headline": "As Ohio senate hopefuls vie for Trump's support, one contender says he's the only one focused on the issues",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1ccbaeae-b725-40cd-8bd3-e14087b7a401/e2f7f23a-fb7b-46cc-a117-d3c401d2b3e5/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/as-ohio-senate-hopefuls-vie-for-trumps-support-one-contender-says-hes-the-only-one-focused-on-the-issues",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lisa Bennatan",
  "authorUrl": "https://www.foxnews.com/person/b/lisa-bennatan",
  "termIds": [
    3103
  ],
  "sentences": [
    "(Photo by Andrew Spear/Getty Images)\nThe poll had the next tier including author Vance, Timken, and Dolan, and showed an unsettled race with one-quarter of voters undecided and about two-thirds of Gibbons', Mandel's, and Vance's supporters saying they may change their mind.",
    "DAYTON, Ohio  One candidate in the Ohio Senate race who's sought to separate himself from a field of opponents seeking Donald Trump's approval, told Fox News he's \"not anti-Trump,\" and that he is the only candidate focused on the issues.",
    "During a recent debate, Ohio GOP Senate candidates were asked to raise their hand if they believed Donald Trump should stop talking about the 2020 election and move on for the betterment of the Republican Party.",
    "\"Anybody that changes the name of the once storied Cleveland Indians to the Cleveland Guardians should not be running for the United States Senate representing the Great People of Ohio,\" Trump wrote.",
    "Matt Dolan, a 57-year-old state senator and part owner of the Cleveland Guardians Major League Baseball team finds himself in the middle of a bruising primary that includes investor J.D.",
    "A Fox News poll conducted early last month showed Gibbons and Mandel leading the pack among Ohio Republican primary voters in the race to replace retiring U.S. Sen.",
    "Vance, perennial candidate and former Ohio Treasurer Josh Mandel, businessman Mike Gibbons, and former Ohio Republican Party chair, Jane Timken.",
    "The two candidates, Gibbons and Mandel, shared a heated exchange eventually broken up by a moderator, at a FreedomWorks Forum in mid-March.",
    "Ohio voters who attended a forum Dolan hosted in Dayton, Ohio, were largely unsure how they felt about Dolan's position on Trump.",
    "But another Ohio voter named Brian seemed to value Trump's opinion more when asked about Dolan's stance on the former President.",
    "\"I would say I probably lean more towards people who kind of move away from Trump\" one voter named Joe told Fox News.",
    "I think President Trump has done a very good job putting America first,\" Brian told Fox News.",
    "Voters will head to the polls May 3 to determine who will advance to the general election.",
    "(Photo by Andrew Spear/Getty Images)\nDolan was the only candidate who raised his hand.",
    "Lisa Bennatan is an associate producer/writer for Fox News Digital Originals.",
    "\"If you look at the campaign, I'm the only one focusing on issues in Ohio.\"",
    "He is also the only candidate Trump has said he would not be endorsing.",
    "Follow her on Twitter @LisaBennatan and Instagram @Lisa_Bennatan",
    "\"I'm not anti-Trump,\" U.S. Senate candidate Matt Dolan said.",
    "\"Being a Trump supporter, definitely supporting Trump.",
    "\"The Republican Party has too many RINOs!\"",
    "the former President added.",
    "Rob Portman."
  ]
}