{
  "id": 6452,
  "mediaId": 238,
  "date": "d2022-04-06T15:31",
  "headline": "Opinion: As vile as it gets: J.D. Vance goes full great replacement theory",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/06/jd-vance-immigration-ukraine-great-replacement/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    2087,
    3103,
    4444,
    4636,
    2845,
    2942
  ],
  "sentences": [
    "He insisted Ukraine is a massive distraction? from domestic problems, ranting that the U.S. media spends way more time on Ukraine than it does on the southern border.?\nWhat maters more than Ukraine, Vance suggested, is Bidens lifting of the Title 42 health rule barring entry to most migrants, which will make our ongoing border invasion? worse.",
    "What Vance fears more than anything else is that Americans might decide that the threat posed to them by immigration is not the single greatest global emergency of the moment, and that Ukrainians  and the future of the international order  just might have as much or even more of a claim on our attention.",
    "The unifying idea is that the U.S. can and should shrug off international obligations, whether theyre to maintaining some semblance of a liberal international order in which authoritarian strongmen cannot violently annex democratic self-determining nations, or to allowing migrants to seek refuge here.",
    "Vances formulation is in line with Carlsons, albeit with a twist: He suggests Democrat voters? in the form of migrants are one factor killing Ohioans.? Thats partly a reference to drugs crossing the border, but the hint at an apocalyptic demographic threat is obvious.",
    "Another version is more overtly partisan: It posits that immigration is really a plot by liberal and Democratic elites to replace conservative voters with more obedient voters from the Third World,? as Fox Newss Tucker Carlson heinously puts it.",
    "Bidens open border is killing Ohioans,? says the ad, with more illegal drugs and more Democrat voters pouring into this country.?\nThe claim that migrants represent Democrat voters? is a form of great replacement theory? rhetoric.",
    "Title 42 encouraged excluded migrants to keep attempting entry, making it a boon to smugglers; human rights groups strongly criticized the policy; and it denied asylum seekers a hearing that is their legal right.",
    "So why does Vance go beyond opposing more migration as a policy matter to the point of assuming all new arrivals (presuming they become citizens) and their descendants will ultimately vote Democratic?",
    "As William Saletan details in the Bulwark, many Republicans in Vances ideological space employ variations on this formulation, and they tend to see little occasion for alarm in the Russian invasion.",
    "That aside, what makes all this truly vile is the through line from this great replacement rhetoric to the idea that the Ukraine horrors are a distraction? from the invasion? of our own border.",
    "But he goes further: He suggests we must view the lifting of Title 42 as a threat to our sovereignty on a par with the threat to Ukraines sovereignty posed by the Russian invasion.",
    "Hes clearly saying migrants will vote Democratic and will be the functional equivalent of toxic drugs,? David Neiwert, author of numerous books about the right, told me.",
    "This idea, which posits a nefarious elite scheme to replace native-born Americans with outsiders via migration-enhanced demographic change, comes in various forms.",
    "You see, President Biden is permitting desperate adult migrants to apply for refuge again, after using a bogus public health rationale to keep them out.",
    "To top that off, this comes after Vance released a new ad this week fleshing out what he really means when he declares our border an emergency.",
    "Its not the invasion of Ukraine, where war crimes are mounting and were seeing horrifying imagery of murdered civilians littering the streets.",
    "Thats a particularly lurid rendition of a cherished Vance talking point: That we should care more about our own border than that of Ukraine.",
    "One hallmark of the conservative populist nationalism that Vance adheres to is its supposed appeal to working class voters of all races.",
    "Vance declared opposition to a no-fly zone over Ukraine, which hes correct about, but then sank into some absurdly tendentious claims.",
    "This is fundamentally the same thing that White nationalists pushing the great replacement theory have argued,? Neiwert continued.",
    "This is meant to be in part because Latino Americans also oppose more immigration from Central and South America.",
    "Vance introduced a new version of this idea at a debate among Ohio Republican Senate candidates on Tuesday night.",
    "One version is explicitly race based, envisioning white genocide,? which Vance isnt necessarily employing.",
    "This is not just whataboutism.? Its a genuine conception of what the international order should look like.",
    "Vance wants you to know that only one invasion should overwhelmingly preoccupy your attention right now.",
    "However tragic we find these images of whats going on in Ukraine, this is not our fight,? Vance said.",
    "Vance lamented that were sending more aid to Ukraine than weve spent on a border wall.",
    "Vance clearly is now regurgitating this theory.?\nIts strange that Vance would go here.",
    "No, you must not get distracted by that distant skirmish between foreigners.",
    "Yes, lifting Title 42 will create very difficult logistical challenges.",
    "I say theyre worth trying to solve, because the alternative is worse.",
    "Vance is decrying the lifting of Title 42 as a full-blown emergency.",
    "The invasion that truly matters is occurring at our southern border.",
    "Theres a reason these Republicans keep conflating the two borders.",
    "Doesnt he have faith in the power of conservative populist ideas?",
    "Vance is of course free to disagree with that.",
    "As a substantive matter, this is absurd.",
    "But it reverses a major policy failure.",
    "Thats the real emergency.",
    "J.D."
  ]
}