{
  "id": 6455,
  "mediaId": 43,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Morning Digest: Longtime congressman will retire rather than face",
  "image": "https://images.dailykos.com/images/1056246/story_image/GettyImages-1177972602.jpg?1649202535",
  "link": "https://www.dailykos.com/story/2022/4/6/2090308/-Morning-Digest-Longtime-congressman-will-retire-rather-than-face-Trump-backed-colleague-in-primary",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3103
  ],
  "sentences": [
    "1Q Fundraising\nPA-Sen: John Fetterman (D): $3.1 million raised, $4.1 million cash-on-hand\nNH-Sen: Kevin Smith (R): $410,000 raised (in nine weeks)\nFL-07: Rusty Roberts (R): $173,000 raised (in 10 days)\nMI-12: Janice Winfrey (D): $200,000 raised (in six weeks)\nOH-13: Emilia Sykes (D): $350,000 raised\nRI-02: Joy Fox (D): $175,000 raised (in two months)\nSC-01: Nancy Mace (R-inc): $1.2 million raised, $2.3 million cash-on-hand\nSenate\n? AZ-Sen: Monday was the deadline for candidates to file for Arizona's Aug. 2 primary, and the state has a list of contenders here.",
    "? Ad Reservations: Last week we got preliminary information about the first fall TV bookings from the Democratic group Senate Majority PAC, and AdImpact now has full details about how much money is going into each reservation:\nArizona: $22.4 million\nGeorgia: $24.6 million\nNevada: $14.1 million\nPennsylvania: $25.8 million\nWisconsin: $11.7 million\nArizona, Georgia, and Nevada are Democratic-held, while SMP is going on the offensive in Pennsylvania and Wisconsin.",
    "It's impossible to know which of the 48 candidates competing in the June top-four primary might advance to the general, but we know the final matchup will be different than the one Change polled because one of the candidates it included, Republican state Sen. Lora Reinbold, did not end up running; the survey was also conducted days before either Palin or the final Republican candidate tested, state Sen. Josh Revak, announced they were in.",
    "Upton got some surprising help during that campaign when Joe Biden delivered a speech in his district that was paid in part by an Upton family foundation; Biden, who was apparently motivated to praise Upton because of the congressman's work on a bill called the 21st Century Cures Act, declared the congressman was \"one of the finest guys I've ever worked with\" and \"the reason we're going to beat cancer.\"",
    "Upton easily prevailed in the general election and had no trouble winning for decades; Siljander, for his part, was last in the news in late 2020 when Trump pardoned what an angry Upton described as \"a series of federal crimes including obstruction of justice, money laundering and lobbying for an international terrorist group with ties to Osama bin Laden, al-Qaida and the Taliban.\"",
    "Harper describes her local roots and service in the Obama administration before trying to contrast herself with Rep. Tim Ryan, the frontrunner for the nod, by declaring, \"I'm the only Democrat for Senate who's always supported Medicare for All and a $15 living wage, who's always been pro-choice, and supports expanding the Supreme Court to protect women's rights.\"",
    "Prosecutors\n? Maricopa County, AZ Prosecutor: Republican incumbent Alistair Adel resigned late last month as the top prosecutor of America's fourth-largest county over serious questions about her ability to manage her office, and one Democrat and three Republicans quickly collected the requisite signatures needed to compete in the special election to succeed her.",
    "Siljander was an ardent social conservative well to the right of even Reagan: Among other things, he'd unsuccessfully tried to torpedo Sandra Day O'Connor's nomination to the Supreme Court in 1981 because he didn't feel she was sufficiently conservative, and he even threatened to vote against the White House's priorities in an attempt to thwart O'Connor.",
    "Upton, by contrast, spent months keeping the political world guessing as to whether he'd go up against Huizenga in the primary or retire, though until Tuesday, it seemed that he had one more race in him: In February, Upton launched a $400,000 ad campaign in which he told viewers, \"If you want a rubber stamp as your congressman, I'm the wrong guy.",
    "? SD-Sen: Candidate filing closed March 29 for South Dakota's June 7 primaries, and we'll be taking a look at the fields for any notable 2022 contests now that the Secretary of State's office has had a week to receive \"the official certification(s) from county central committees or state political parties\"; you can find a list of contenders here.",
    "? AZ-01: Republican Rep. David Schweikert is running for re-election in the revamped 1st District, a seat in eastern Phoenix and its eastern suburbs that's changed quite a bit from the 6th District he currently represents: While Trump would have carried his existing constituency 51-47, its Biden who would have taken the new 1st 50-49.",
    "Team Red's field also includes state Rep. Shawnna Bolick, who championed a bill that would have allowed the state legislature to decertify the state's presidential results at any point before Inauguration Day, and state Sen. Michelle Ugenti-Rita, who has sponsored some of the most aggressive new voting restrictions in Arizona.",
    "The race took a dark turn late in the campaign when audio leaked of Siljander telling local clergy members to aid him in order to \"break the back of Satan,\" arguing that his loss \"would send a shock wave across America that Christians can be defeated in Congress by impugning their integrity and smear tactics.\"",
    "Norton has been attacking the ethics of the incumbent, who in 2020 agreed to pay a $50,000 fine, accept a formal reprimand, and admit to 11 different violations of congressional rules and campaign finance laws in a deal with the bipartisan House Ethics Committee to conclude a two-year investigation.",
    "In 2002, Upton easily turned back a primary campaign from state Sen. Dale Shugars 66-32 in what was now numbered the 6th District, but when the burgeoning tea party turned its wrath on establishment figures in 2010, the longtime congressman had become much more vulnerable to intra-party challenges.",
    "314 Action hasn't made an endorsement yet, but the organization made it clear it wanted Gross to win in its release, saying, \"Dr. Al Gross has dedicated his life to improving health outcomes for Alaskans, and if elected to Congress he'll have a platform to craft policy that will do just that.\"",
    "? AZ-06: Democratic Rep. Ann Kirkpatrick announced her retirement last year before Arizona's Independent Redistricting Commission drew up a new 6th District in the Tucson area that Biden would have carried by a tiny 49.3-49.2 margina sizable drop from Bidens 55-44 win in the old 2nd District.",
    "? TX-AG: YouGov surveys the May 24 Republican primary runoff for the Texas Hispanic Policy Foundation and shows incumbent Ken Paxton fending off Land Commissioner George P. Bush 65-23, which is even larger than the 59-30 lead that CWS Research found in its recent poll for a pro-Paxton group.",
    "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? MI-04: Michigan Rep. Fred Upton, who was one of 10 Republicans to vote to impeach Donald Trump last year, announced Tuesday that he would not seek a 19th term this fall.",
    "That was the last time he faced a serious primary challenge at the ballot box, but in 2014 he went through his first expensive general election campaign when law professor Larry Lessig directed his Mayday PAC, which he called his \"super PAC to end super PACs,\" to target Upton.",
    "However, it was Huizenga who, at least on paper, was more disadvantaged by the new map: While about two-thirds of the residents of the new 4th are currently Upton's constituents, Huizenga represents only about a quarter of the seat he's now the frontrunner to claim.",
    "Donald Trump, unsurprisingly, has taken a strong interest in this contest and endorsed state Rep. Mark Finchem, a QAnon supporter who led the failed effort to overturn Joe Biden's 2020 victory and attended the Jan. 6 rally just ahead of the attack on the Capitol.",
    "The field consists of Jevin Hodge, who lost a tight 2020 race for the Maricopa County Board of Supervisors; former Phoenix Suns employee Adam Metzendorf; and environmental consultant Ginger Sykes Torres, who has the backing of southern Arizona Rep. Ral Grijalva.",
    "The Democratic contest pits former state Rep. Daniel Hernndez, who as an intern helped save then-Rep. Gabby Giffords after she was shot in 2011, against state Sen. Kirsten Engel; a third candidate, engineer Avery Anderson, hasn't earned much attention so far.",
    "However, while the anti-tax Club for Growth ran commercials this time against Upton, who by now was chair of the Energy and Commerce Committee, the incumbent worked hard to emphasize his opposition to the Obama administration and won by a larger 67-33 margin.",
    "In an email to supporters, Upton said he believed \"it is time to pass the torch,\" though the person who will most likely be claiming that beacon in the new 4th Congressional District is his colleague and would-be primary foe, Trump-backed Rep. Bill Huizenga.",
    "Michigan Rep. Fred Upton (R)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Upton's decision ends a long career in politics that began in the late 1970s when he started working for local Rep. David Stockman, and he remained on his staff when Stockman became Ronald Reagan's first director of the Office of Management and Budget.",
    "? NH-01: The Associated Press reports that former Trump administration official Matt Mowers, one of the leading GOP candidates for New Hampshire's 1st Congressional District, voted twice in the 2016 primaries, which would be a violation of federal law.",
    "Mayday spent over $2 million to aid a previously unheralded Democrat named Paul Clements, and while Upton didn't come close to losing in that red wave year, Democrats hoped his 56-40 showing meant he could be beaten in a better political climate.",
    "Another 2020 loser is Rodney Glassman, who narrowly failed to unseat the Maricopa County assessor in the primary; Glassman was the 2010 Democratic nominee against Sen. John McCain, but he now sports an endorsement from far-right Rep. Paul Gosar.",
    "House\n? AK-AL: 314 Action Fund, a group that supported independent Al Gross in his 2020 Senate race, has released a survey from the Democratic pollster Change Research that finds him locked in a close special election against former GOP Gov.",
    "Only two little-known Republicans, Oglala Sioux tribal administrator Bruce Whalen and rancher Mark Mowry, ended up filing to take him on, despite Thune's long dalliance with retirement, and there's no indication that either poses a threat.",
    "The field also includes self-funding businessman Jim Lamon; former Thiel Capital chief operating officer Blake Masters, whose former boss is heavily financing a super PAC to boost him; and retired Air Force Maj. Gen. Michael McGuire.",
    "Attorneys General\n? AZ-AG: Republicans have a six-way primary to succeed termed-out Attorney General Mark Brnovich, who is seeking Team Red's nod for U.S. Senate, and this is another nominating contest without an obvious frontrunner.",
    "Democrats, meanwhile, have a duel between state House Minority Leader Reginald Bolding and Adrian Fontes, who narrowly lost re-election in 2020 as Maricopa County clerk, the post responsible for election administration in the county.",
    "Doug Ducey's general counsel; City of Goodyear Prosecutor Gina Godbehere; and prosecutor Rachel Mitchell, whom Senate Republicans hired in 2018 as a \"female assistant\" to question Brett Kavanaugh and accuser Christine Blasey Ford.",
    "? GA-07: NBC reports that Rep. Lucy McBath is spending $74,000 on her first TV ad for the May 24 Democratic primary, which features her visiting the grave of her son, Jordan Davis, as she describes how he was murdered by a gunman.",
    "? AZ-02: Democratic Rep. Tom O'Halleran is defending a seat in northern and eastern rural Arizona that would have backed Trump 53-45, which is a significant shift from Biden's 50-48 win in the 1st District that he currently holds.",
    "Another name to watch is former Rep. Matt Salmon, who narrowly lost the 2002 general election to Democrat Janet Napolitano; his second bid has the support of the Club for Growth as well as Reps. Andy Biggs and David Schweikert.",
    "The ad goes on to tout Block's conservative ideas, including his desire to \"finish the border wall\" and \"block the COVID mandates,\" though at times the narrator's message almost gets drowned out by the commercial's loud music.",
    "Penn Progress responded by pointing to other news articles that have also called Fetterman a \"self-described democratic socialist,\" but no one seems to have found a quote from Fetterman actually referring to himself this way.",
    "A runoff would be required on Aug. 16 in the races for U.S. Senate, U.S. House, and governor if no candidate wins at least 35% of the vote, but there aren't enough contenders in any of those races to make this a possibility.",
    "Dusty Johnson faces a Republican primary challenge from state Rep. Taffy Howard, a Big Lie supporter who launched her bid last year insisting, \"I believe there was fraud in the last election that needs to be investigated.",
    "In their letter, Fetterman's lawyers say the candidate \"has never described himself as a 'democratic socialist'\" and link to a 2016 interview in which Fetterman says, \"No, I don't label myself a democratic socialist.\"",
    "? NM-Gov: Former Sandoval County Commissioner Jay Block uses his first spot for the June Republican primary to proclaim that he was \"a day-one supporter of President Donald J. Trump,\" who badly lost New Mexico twice.",
    "The Hillbilly Elegy author continues by accusing the media of censorship before proclaiming, \"Joe Biden's open border is killing Ohioans with more illegal drugs and more Democrat voters pouring into this country.\"",
    "Businesswoman Paola Tulliani Zen, who founded a biscotti company, also attracted attention earlier this year when politicos learned she'd self-funded $1.2 million, but she hasn't otherwise generated much press.",
    "Secretaries of State\n? AZ-SoS: Democratic Secretary of State Katie Hobbs is running for governor, and four Republicans and two Democrats are running to replace her as this swing state's chief elections officer.",
    "The ad cites an NPR segment from 2020 for that claim about Fetterman, but at the bottom of the piece are not one but two correction notices that both read, \"This story wrongly states that Pennsylvania Lt. Gov.",
    "Vance and former state Treasurer Josh Mandel are each running commercials for the May 3 Republican primary espousing ultra-conservative ideas as they attack the very idea that their beliefs could be racist.",
    "In 1986, Upton decided to seek elected office himself when he launched a primary challenge to Rep. Mark Siljander, who had succeeded Stockman in the House in 1981, in an earlier version of the 4th District.",
    "While it's possible that Upton's departure will entice someone else to run against Huizenga in the August GOP primary, they'd need to collect at least 1,000 valid signatures by the April 19 filing deadline.",
    "McBath's longtime allies at Everytown for Gun Safety are also spending $1 million to help her, which the Atlanta Journal-Constitution says will come in the form of digital and radio ads and a mail campaign.",
    "Heather Mizeur says she'll continue her campaign for the Democratic nod to take on Republican Rep. Andy Harris even though Trump would have carried the newest version of this seat by a tough 56-42 margin.",
    "His opponent that year was former state Rep. Jack Hoogendyk, who had badly failed in his quest to unseat Democratic Sen. Carl Levin two years earlier but argued that Upton was insufficiently conservative.",
    "Huizenga announced back in December, right after the state's new congressional maps were completed, that he'd be seeking re-election in the new 4th, and he earned an endorsement from Trump last month.",
    "Separately, a new poll of the GOP primary from Public Opinion Strategies for Honor Pennsylvania finds hedge funder David McCormick (whom the group is backing) leading TV personality Mehmet Oz 22-16.",
    "? PA-Sen: Allies of Rep. Conor Lamb at a super PAC called Penn Progress just dropped the first negative TV ad of Pennsylvania's Democratic Senate primary, but there's a huge problem with the spot.",
    "Secretary of State Katie Hobbs has long looked like the frontrunner on the Democratic side, and she picked up an endorsement Tuesday from the state branch of the American Federation of Teachers.",
    "Mowers then voted in the June primary in his home state of New Jersey, a month after Donald Trump became the GOP's de facto nominee, though there were other races on the ballot that day as well.",
    "McBath has already benefited from $1 million in advertising from another group, Protect Our Future PAC, while fellow incumbent Carolyn Bourdeaux has not yet received any major outside support.",
    "Vance is pushing that message in what the GOP firm Medium Buying says is his first-ever TV ad, though his allies at Protect Ohio Values PAC have already spent over $6 million promoting him.",
    "? AZ-04: Democratic Rep. Greg Stanton is defending the 4th District in the southern Phoenix suburbs that, at 54-44 Biden, is considerably less safe than the 9th District it replaces.",
    "The partisan primary and general elections will take place on the same days as the state's regularly scheduled statewide contests, and the winner will be up for a full term in 2024.",
    "Kristi Noem faces a Republican primary challenge from state Rep. Steve Haugaard, a former state House speaker who, believe it or not, is trying to run to the incumbent's right.",
    "Aside from the factual blunder, Lamb's supporters may be making a political mistake as well: Attacking a rival as too liberal in a Democratic primary is rarely a winning move.",
    "Upton, by contrast, insisted that he'd work better with the party's leadership and seek committee assignments that would allow him to direct his energies to domestic concerns.",
    "The most prominent contender may be state Attorney General Mark Brnovich, though he attracted heaps of abuse last year from Trump for not doing enough to advance the Big Lie.",
    "Democratic Sen. Mark Kelly won a tight 2020 election for the final two years of the late John McCain's term, and he'll be a top GOP target this fall as he seeks re-election.",
    "Two months later, Upton responded to the Jan. 6 attack by voting for impeachment, a vote that arguably did more than anything else to close out his lengthy time in Congress.",
    "Fetterman's team is seeking to have this advertisement bumped from the airwaves because TV and radio stations can be held liable for defamatory content in third-party ads.",
    "In a previously unreleased POS poll from January, Oz enjoyed a 31-13 advantage, but both sidesand other candidates as wellhave unleashed millions in attack ads since then.",
    "\"The fake news, big tech, and blue state liberals stole the election from President Trump,\" says the governor, \"but here in Alabama, we are making sure that never happens.",
    "Any statute of limitations has long run out, so Mowerswho has a page devoted to \"election integrity\" on his campaign websitewould be able to evade any legal ramifications.",
    "The field also consists of two former prosecutors, Lacy Cooper and Abe Hamadeh; former Arizona Supreme Court Justice Andrew Gould; and manufacturing executive Dawn Grove.",
    "One spot focuses entirely on attacking the governor, including a clip of her saying last year, \"It's time to start blaming the unvaccinated folks, not the regular folks.\"",
    "On Tuesday, he insisted that redistricting mattered more to him than any backlash from his impeachment vote, saying, \"My district was cut like Zorrothree different ways.\"",
    "Democrats hoped they could finally take Upton down in 2020, but Upton returned to form and beat state Rep. Jon Hoadley 56-40 as Trump was carrying his district 51-47.",
    "Six Republicans are competing to take him on, including Tanya Wheeless, who served as a staffer to then-Sen. Martha McSally, and Chandler City Councilman Rene Lopez.",
    "? FL-13: 2020 nominee Anna Paulina Luna, who has Trump's endorsement, has released a Spry Strategies poll that shows her again winning the August Republican primary.",
    "Doug Ducey, to the frustration of Senate Minority Leader Mitch McConnell, is not one of them), and polls show that a large plurality of primary voters is undecided.",
    "Upton's team, while denying that the outcome represented a loss for the religious right, predicted, \"Fred's tactics will be much more moderate and more reasonable.\"",
    "Donald Trump used the last days of his time on Twitter to rant in late 2020 that Republican Sen. John Thune \"will be primaried in 2022, political career over!!!\"",
    "Citing those corrections, attorneys for Fetterman's campaign sent a letter to TV stations demanding they take down the spot, calling it \"false and defamatory.\"",
    "On the Democratic side, former Consumer Financial Protection Bureau official Morgan Harper has launched what her campaign says is a six-figure opening ad buy.",
    "Upton argued that, while both he and Siljander were \"conservative Republican[s],\" the incumbent had ignored his constituents to focus on international issues.",
    "Greg Abbott has scheduled the special all-party primary to succeed former Democratic Rep. Filemon Vela for June 14, with the filing deadline set for April 13.",
    "In 2018, though, the congressman faced a considerably tougher battle against physician Matt Longjohn at a time when the GOP was on the defensive nationwide.",
    "(Because they're obligated under federal law to run candidate ads so long as they're paid for, broadcasters aren't liable for the content of such spots.)",
    "Siljander, though, had taken just 58% of the vote in his 1984 primary, which suggested that a significant number of primary voters were unhappy with him.",
    "One familiar GOP contender is Tiffany Shedd, who lost a close general election last cycle in the 1st Congressional District against Rep. Tom O'Halleran.",
    "(The commercial features surveillance footage from the gas station where Davis was killed, with someone responding to the sounds of gunfire, \"Oh my God.",
    "No notable Democrats have entered the race so far for the new version of the 4th, a southwestern Michigan seat Trump would have carried 51-47 in 2020.",
    "Note also that the parties hold nominating conventions (typically later in June) instead of primaries for several offices, including attorney general.",
    "Politically, though, it's a different story, as his rivals for the nomination to take on Democratic Rep. Chris Pappas immediately went on the attack.",
    "Noem, though, has a massive financial edge over the challenger, as well as Trump's endorsement, and there's no indication yet that she's vulnerable.",
    "Her two intra-party foes are former state Rep. Aaron Lieberman and former Homeland Security official Marco Lpez, who is a one-time mayor of Nogales.",
    "According to the AP, Mowers cast a ballot in New Hampshire's primary in February, when he was working for Chris Christie's presidential campaign.",
    "The attorney general leads Garza and Jaworski 48-42 and 48-41, respectively, while Jaworski edges out Bush 39-38 and Garza ties him at 39-all.",
    "Navajo Nation Vice President Myron Lizer had announced he was running last month, but his name was not on the states final list of candidates.",
    "The other commercial tries to use the Big Lie against Ivey, with the narrator proclaiming, \"Lindy believes the election was stolen from Trump.",
    "Governors\n? AL-Gov: Former Ambassador to Slovenia Lindy Blanchard is running more ads ahead of the May 24 Republican primary arguing that Gov.",
    "Upton, though, said at the time that he was still undecided about 2022, and his retirement announcement proves he wasn't just playing coy.",
    "The firm initially finds Gross leading Palin 33-30 in a hypothetical general election, with Revak and Reinbold at 9% and 8%, respectively.",
    "The firm gives Luna the lead with 35%, while prosecutor Kevin Hayslett and 2020 candidate Amanda Makki are tied for second with 9% each.",
    "Also in the running are Navy SEAL veteran Eli Crane; Ron Watkins, the reputed founder of the QAnon conspiracy cult; and three others.",
    "YouGov tests hypothetical general election scenarios as well and finds that, despite his myriad of scandals, Paxton outperforms Bush.",
    "The two elected officials in the running are state Rep. Walt Blackman and John Moore, the mayor of the tiny community of Williams.",
    "The field also includes Josh Barnett, who badly lost to Democratic Rep. Ruben Gallego last cycle in the safely blue 7th District.",
    "After the instant runoff process is simulated, not much changes, as Gross and Palin tie with 35% apiece, while 30% are undecided.",
    "There's also self-funding businessman Steve Gaynor, who narrowly lost the open-seat race for secretary of state to Hobbs in 2018.",
    "The only other current elected official is state Corporation Commissioner Justin Olson, but he's struggled to attract attention.",
    "The congressman outspent Hoogendyk by an 18-to-1 margin but prevailed only 57-43, which enticed Hoogendyk to try again in 2012.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "The only current elected official, by contrast, is Board of Regents member Karrin Taylor Robson, who is backed by former Govs.",
    "YouGov also has former ACLU attorney Rochelle Garza beating former Galveston Mayor Joe Jaworski 46-31 for the Democratic nod.",
    "? TX-15: EMILY's List has endorsed businesswoman Michelle Vallejo in the May 24 Democratic primary runoff for this open seat.",
    "Foreign policy strategist Dave Harden, who is the underdog in the July primary, also made it clear he'd remain in the race.",
    "Before he can focus on the general election, though, Schweikert needs to get past self-funder Elijah Norton in the primary.",
    "Upton ended up dispatching the congressman 55-45, a convincing thumping that both sides attributed to Siljander's comments.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Vallejo will face Army veteran Ruben Ramirez, who led her 28-20 last month in the first round of the nomination contest.",
    "But if you want someone committed to solving problems, putting policy over politics, then I'm asking for your support.\"",
    "On Tuesday evening, the Fetterman campaign said that one station, WPVI in Philadelphia, had complied with its request.",
    "We run down all the major contests in their respective sections of the Morning Digest, starting with the Senate race.",
    "Trump has thrown his endorsement behind Kari Lake, a former local TV anchor turned conservative conspiracy theorist.",
    "Afterwards, Longjohns campaign manager said Bidens involvement was \"brutal at the time and stings even more today.\"",
    "In Congress, I'm fighting to protect voting rights, to lower prescription drug costs, and to prevent gun violence.\"",
    "The winner will take on state House Minority Leader Jamie Smith, who faces no opposition in the Democratic primary.",
    "These are the first general election reservations we've seen from any major outside groups on the Senate side.",
    "Mandel, meanwhile, exclaims, \"There's nothing racist about stopping critical race theory and loving America.\"",
    "Schweikert, though, has made it clear he'll focus on Norton's turbulent departure from his insurance company.",
    "Doug Ducey, though it remains to be seen if any of his four intra-party rivals can give him a serious fight.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWe open our mailbag and answer your questions!",
    "Seven Republicans are competing to take him on, and there's no obvious frontrunner at this point.",
    "A runoff date would only be scheduled if no one earns a majority of the vote in the first round.",
    "The only Democrat in the race is 2020 nominee Julie Gunnigle, who lost to Adel by a close 51-49.",
    "If Penn Progress' ad gets bounced, it may actually be a blessing in disguise for the super PAC.",
    "Ultimately, the congressman prevailed 50-46 in what was by far the closest race of his career.",
    "The only Democrat, by contrast, is former Arizona Corporation Commission Chair Kris Mayes.",
    "? TX-Gov: YouGov's new poll for the Texas Hispanic Policy Foundation shows Republican Gov.",
    "In a separate question pitting the two head-to-head, however, Palin edges out Gross 42-40.",
    "but the Senate minority whip's political career seems like it will continue just fine.",
    "Attorney Brian Bengs has the Democratic primary to himself in this very red state.",
    "(Christie finished sixth with just 7% of the vote and quit the race the next day.)",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Ivey, meanwhile, is running her own ads playing up her own far-right credentials.",
    "We have not, and will not, send absentee ballots to everyone and their brother.\"",
    "The narrator begins by asking, \"Who can Democrats trust in the race for Senate?\"",
    "A fourth Republican, attorney James Austin Woods, does not appear to have filed.",
    "? AZ-Gov: Both sides have competitive primaries to succeed termed-out GOP Gov.",
    "Our current congressman is not willing to admit that there was an issue.\"",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Mowers' campaign has so far declined to respond directly to the story.",
    "The GOP frontrunner is Juan Ciscomani, a former senior advisor to Gov.",
    "Greg Abbott leading Democrat Beto O'Rourke 50-42 among likely voters.",
    "Vance begins as he points right at the camera, \"Do you hate Mexicans?",
    "Clements sought a rematch in 2016, but Upton won by a 59-36 spread.",
    "No Democrat ended up filing to run for the state's only House seat.",
    "The final Republican contender is advertising executive Beau Lane.",
    "(We explain the many changes to Arizona's congressional map here.)",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "That's because, according to his campaign, no such quote exists.",
    "and contrasts Lamb\"a former prosecutor and Marine\"with Lt. Gov.",
    "The media calls us racist for wanting to build Trump's wall.\"",
    "Sarah Palin in the instant-runoff general election in August.",
    "Three Democrats are also competing for this competitive seat.",
    "John Fetterman is a 'self-described democratic socialist.'",
    "McBath tells the audience, \"My tragedy turned to purpose.",
    "John Fetterman, \"a self-described democratic socialist.\"",
    "Five Republicans are running to take him on (though Gov.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "The GOP field consists of Anni Foster, who is Gov.",
    "Neither has the sixth GOP candidate, Scott Neely.",
    "Kay Ivey thinks Biden's victory was legitimate.\"",
    "Republicans, meanwhile, have six contenders.",
    "Subscribe to our podcast, The Downballot!",
    "Kay Ivey is insufficiently conservative.",
    "This is a short blurb about Daily Kos.",
    "? TX-34 (special): Republican Gov.",
    "? OH-Sen: Venture capitalist J.D.",
    "Jan Brewer and Fyfe Simington.",
    "Doug Ducey in swingy Arizona.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Somebody's shooting!\")",
    "? MD-01: Former Del.",
    "\"Are you a racist?\"",
    "Please read it.",
    "? SD-Gov: Gov.",
    "? SD-AL: Rep.",
    "He is not.\""
  ]
}