{
  "id": 6575,
  "mediaId": 129,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Its Trumps Party, and Hell Lie if He Wants To",
  "image": "https://static01.nyt.com/images/2022/05/20/opinion/20bouie_1/20bouie_1-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/20/opinion/republicans-trump-elections.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    704,
    1147,
    1404,
    2087,
    2095,
    3102,
    3103,
    4269,
    4325,
    4447,
    4825,
    2945
  ],
  "sentences": [
    "Elizabeth Warren explains her priorities and writes, if we fail to use the months remaining before the elections to deliver on more of our agenda, Democrats are headed toward big losses.?\nMark Penn writes that without a U-turn by the Biden administration,? voters increasingly motivated by fear over a variety of issues will generate a wave election like those in 1994 and 2010.?\nThomas B. Edsall asks, as the midterms approach, to what degree are Democratic difficulties inevitable,? and which challenges stem from the partys strategic choices?",
    "Yes, the Republican Partys present-day election denialism is much more extreme than the rhetoric surrounding voter fraud or the idea that there is a real America.? But the difference is ultimately one of degree, not kind: Republicans have been trying to write Democrats out of the political community in one way or another for decades.",
    "In addition to winning the Electoral College in a landslide,? he said, I won the popular vote if you deduct the millions of people who voted illegally.?\nIn 2001, for example, Attorney General John Ashcroft announced a crackdown on voter fraud, accusing unnamed actors (presumably Democrats) of manipulating elections.",
    "You are the majority.?\nMitt Romneys infamous claim that there are 47 percent of the people? who are dependent upon government,? believe they are victims? and are unable to take personal responsibility and care for their lives? was condemned as classist and prejudiced during the 2012 presidential election.",
    "Sarah Palins rhetoric about the real America,? very much in evidence during the 2008 presidential campaign  We believe that the best of America is in these small towns that we get to visit, and in these wonderful little pockets of what I call the real America?  was one of these ways.",
    "The Republican nominee for governor in Pennsylvania, Doug Mastriano, won his race on the strength of his enthusiastic support for Donald Trumps effort to subvert and overturn the results of the 2020 presidential election.",
    "And the residents of cemeteries have infamously shown up at the polls on Election Day.?\nAfter the 2008 election, Republicans went into a frenzy over the group ACORN, accusing it of perpetrating fraud on a national scale.",
    "Its not sufficient  David Perdue, a former senator, looks like hes going to lose to the incumbent governor of Georgia, Brian Kemp, in next weeks primary, despite his support for the big lie?  but it makes a difference.",
    "But, you know, I think at a basic level we already know mostly what happened.?\nOverall, there are hundreds of Republican candidates in races across the country who have embraced Trumps false claims about his defeat.",
    "So was the Tea Party movement, whose members understood themselves as a disenfranchised majority, under siege by a Democratic Party of burdensome illegal immigrants, ungrateful minorities and entitled young people.",
    "But you can also read it as an expression of the belief that there are some Americans who count  the makers,? in the language of his vice-presidential nominee, Paul Ryan  and some Americans who dont.",
    "Mastriano has not commented on the 2024 election, but he has let it be known that he supports the view that state legislatures can assign electoral votes against the will of the voting public.",
    "For many Republicans, theirs is the only legitimate political party and their voters, irrespective of their actual numbers, are the only legitimate voters  and the only legitimate majority.",
    "The extent to which election denialism and pro-insurrectionism are now litmus tests for Republican politicians is clearly attributable to Trumps huge influence over the Republican Party.",
    "Democrats, from this vantage point, are presumptively illegitimate, their victories suspect, their policies un-American, even when they have the support of most people in the country.",
    "Vance, the Republican nominee for the Senate in Ohio, has not endorsed the claim that Biden stole the election from Trump, but he did play footsie with the idea during his campaign.",
    "But even if that were not true  if, instead of the boss, Trump were only one influential figure among many  there would still be reason for Republicans to embrace this view.",
    "Thats because Republican election denialism is simply the strongest form of a belief that has defined the Republican Party since at least the Newt Gingrich era in the 1990s.",
    "How else, after all, could you explain Barack Obamas unexpected victories in traditionally Republican states like Virginia, Indiana and North Carolina?",
    "You see this in the years of voter fraud hysteria that preceded Trumps claim, after the 2016 election, that he had been cheated of millions of votes.",
    "But there were other ways that Republicans expressed their belief that they were the only legitimate members of the political community.",
    "The Republican nominee for the Senate in North Carolina, Ted Budd, was similarly committed to Trumps effort to keep himself in office.",
    "Ezra Klein speaks to David Shor, who discusses his fear that Democrats face electoral catastrophe unless they shift their messaging.",
    "It was only a matter of time before this escalated to denying that Democrats and Democratic voters can win elections at all.",
    "Votes have been bought, voters intimidated and ballot boxes stuffed,? he said at a news conference that year.",
    "Voters have been duped into signing absentee ballots believing they were applications for public relief.",
    "He was among the 139 House members who objected to certifying the presidential election in Bidens favor.",
    "He attended the stop the steal? rally on Jan. 6 and has continued to accuse Democrats of fraud.",
    "I think weve got to investigate as much as possible,? Vance said of the 2020 election results.",
    "As a state senator, Mastriano demanded that lawmakers invalidate Joe Bidens electoral votes.",
    "The Fox News commentator Glenn Beck captured some of this feeling during a 2010 broadcast.",
    "Some, like Mastriano, attended the stop the steal? protest in Washington on Jan. 6.",
    "To win a Republican primary in 2022, youll probably need to support a coup attempt.",
    "The Times is committed to publishing a diversity of letters to the editor.",
    "And others signed legal briefs or resolutions challenging Bidens victory.",
    "Wed like to hear what you think about this or any of our articles.",
    "Many, like Budd, voted against Bidens Electoral College victory.",
    "The obsession with nonexistent voter fraud is hard to ignore.",
    "Opinion Debate Will the Democrats face a midterm wipeout?",
    "The polling process has been disrupted or not completed.",
    "And were going to learn a lot about what happened.",
    "I believe sunshine is the best disinfectant.",
    "Despite his defeat, he is still the leader.",
    "And here's our email: letters@nytimes.com.",
    "This is you and me,? he said.",
    "You are not alone, America.",
    "This is the Tea Party.",
    "Here are some tips.",
    "J.D."
  ]
}