{
  "id": 6583,
  "mediaId": 195,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Party primaries test power of Trumps backing and progressive platform",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/7d92f48c87c34f6a84a9c7583e9a7fd4.jpg?w=2560&h=1440&crop=1",
  "link": "https://thehill.com/opinion/campaign/3494579-party-primaries-test-power-of-trumps-backing-and-progressive-platform/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Bannon",
  "authorUrl": "",
  "termIds": [
    1147,
    1903,
    1951,
    2087,
    2095,
    2303,
    3102,
    3103,
    4325,
    428,
    2672,
    2834
  ],
  "sentences": [
    "Pennsylvania primary\nAlong with Michigan and Wisconsin in the industrial Midwest, Pennsylvania is a battleground state that plays an important role in presidential politics and occupies vital terrain in the midterm election battles.",
    "The open seats in the races for governor and U.S. senator will present a crystal-clear and compelling contrast between Democratic and Republican candidates on the grounds of abortion rights.",
    "The possible Supreme Court reversal of the right to reproductive freedom guaranteed in Roe v. Wade will likely weigh heavily in a state where are majority of voters support abortion rights.",
    "These primary battles could be a preview of the ideological fight for the Democratic presidential nomination between progressive and moderates in 2024, if Biden does not run for reelection.",
    "But the former presidents hit or miss record in the early primaries is unlikely to scare off his own challengers  other GOP presidential hopefuls like Texas Sen. Ted Cruz and Florida Gov.",
    "These primaries are just the beginning of a long marathon thru 2022, so stay tuned for further developments in the many months ahead on the long and winding road to November.",
    "Trump report card\nFormer President Donald Trump still has some sway over GOP primary voters, but he clearly doesnt have enough juice to turn fetid water into fine wine.",
    "If Fetterman and McLeod-Skinner win their election battles in the fall, there may be an increased progressive presence in diminished Democratic caucuses in Congress.",
    "The battle for this open seat has national implications because the outcome may determine whether Democrats can retain control of the upper house of Congress.",
    "If Mastriano wins the gubernatorial race, he will be able to appoint the secretary of State who will oversee elections  including the 2024 presidential race.",
    "Hes not the only one: In Oregon, liberal challenger Janice McLeod-Skinner leads the moderate Democratic Rep. Kurt Schrader who had the endorsement of Biden.",
    "Follow him on Twitter: @BradBannon\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The contest for governor will feature the Democratic Attorney General Ben Shapiro and GOP State Sen. Doug Mastriano, another Republican endorsed by Trump.",
    "Like Mastriano, Perdue is an election denier, and Trump is not fond of the incumbent, Kemp, who certified Bidens victory in this swing state in 2020.",
    "They probably will not look kindly at the candidacy of the man who endorsed their primary opponents in heated contests for governors mansions.",
    "Trump won big Tuesday in the GOP U.S. Senate fight in North Carolina where he supported the winner, Rep. Ted Budd, who beat former Gov.",
    "The state, which President Joe Biden won narrowly, will be a hotly contested key to the outcome of the 2024 presidential election.",
    "Little and Pillen will likely be the governors of these bedrock GOP states when Trump likely makes another bid for the presidency.",
    "Perdue trails in the race and if Kemp holds on, he still faces a difficult challenge from Democratic candidate Stacey Abrams.",
    "Its set to be another purple state contest that has vital ramifications for this November and the presidential race of 2024.",
    "Trump backed Oz, the celebrity surgeon, for U.S. Senate and currently leads his opponent, McCormick, by a slim margin.",
    "A runoff in Texas offers another battle between a moderate Democratic House incumbent and a progressive challenger.",
    "He could become the next  and not the last  member of Congress to bite the dust in this contentious campaign cycle.",
    "His endorsement and the votes of his supporters may have helped boost candidates Mehmet Oz in Pennsylvania and J.D.",
    "But Trumps backing was not powerful enough to save Madison Cawthorn in North Carolina or Janice McGeachin in Idaho.",
    "Trump may have put Budd, Vance and Oz (pending a recount) over the top, but hes also may have made enemies of Gov.",
    "Both progressives were able to tie their opponents to moderate Democratic U.S. Sen. Joe Manchin of West Virginia.",
    "of Idaho, who has ties to the right-wing extremist groups, lost her primary campaign against the incumbent Gov.",
    "Tuesday, there were shocking developments in primaries in Pennsylvania, Oregon, North Carolina and Idaho.",
    "May 24th primaries\nPrimary battles in Texas and Georgia are next up on the campaign calendar on May 24.",
    "His podcast, Deadline D.C. with Brad Bannon,? airs on Periscope TV and the Progressive Voices Network.",
    "Trumps power of endorsement faces another key primary test in Georgia, where he backed former U.S.",
    "Cuellar is anti-abortion and his home was recently raided in connection to an FBI investigation.",
    "The 2022 midterm election campaign season will be full of political thrills, chills and spills.",
    "Mastriano gained a following advocating to overturn Bidens presidential win in favor of Trump.",
    "Progressive progress\nFettermans big win was a significant victory for progressive Democrats.",
    "Fetterman won a decisive victory in the Democratic Pennsylvania primary for U.S. Senate.",
    "Brad Bannon is a Democratic pollster and CEO of Bannon Communications Research.",
    "Rep. Henry Cuellar is in a tight race with a liberal candidate Linda Cisneros.",
    "Next week, primary contests in Texas and Georgia will heighten the drama.",
    "Cawthorn, the scandal-ridden congressman, lost his quest for reelection.",
    "Brad Little of Idaho and Jim Pillen of Nebraska this primary season.",
    "Voters are not kind to incumbents when they are in a fulsome mood.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "He roundly defeated Rep. Conor Lamb, a moderate Democrat.",
    "However, the pending recount will determine the victor.",
    "DeSantis who may run for the GOP nomination in 2024.",
    "He is a strong backer of Sen. Bernie Sander (I-Vt.).",
    "Senator David Perdue in his race against Gov.",
    "Brian Kemp in the race for governor.",
    "Also on May 24: Battles in Georgia.",
    "Vance in Ohio in wide-open races.",
    "McGeachin, the Lt. Gov.",
    "Brad Little.",
    "Pat McCrory."
  ]
}