{
  "id": 7018,
  "mediaId": 124,
  "date": "2/16/2022 12:00:00 AM",
  "headline": "In Ukraine, Biden faces a crisis with little political benefit back home",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_07/3535419/220216-joe-biden-jm-0824.jpg",
  "link": "https://www.nbcnews.com/politics/meet-the-press/ukraine-biden-faces-crisis-little-political-benefit-back-home-n1289206",
  "sentiment": "0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    971,
    1147,
    1158,
    1253,
    2087,
    2429,
    3102,
    3103,
    2888,
    2942,
    2959
  ],
  "sentences": [
    "A Russian invasion of Ukraine  would be likely to drive up gas prices amid the highest inflation in decades, wipe out significant gains in the stock market and give Republicans a new line of attack to argue against Bidens foreign policy acumen  putting an already unpopular presidency on even shakier ground with voters heading into the fall midterm elections, Democratic strategists and pollsters said,? NBCs Shannon Pettypiece, Scott Wong and Peter Nicholas write.",
    "RECALL ELECTION:\nSan Francisco voters overwhelmingly supported the ouster of three school board members Tuesday in the citys first recall election in nearly 40 years.https://t.co/p5FW6NHT93\n San Francisco Chronicle (@sfchronicle) February 16, 2022\nWith gas prices on the rise, the White House and some Democrats are reportedly considering an old break-glass response: suspending the 18.4-cent gas tax.",
    "The last time a gas tax holiday was under serious discussion was in 2008, when then-candidate Barack Obama distinguished himself from rivals Hillary Clinton and John McCain by opposing the idea, which he called an election-year gimmick? that would save pennies a day\" while defunding an already stressed Highway Trust Fund, which finances maintenance and repairs.",
    "The Jan. 6 committee has issued six new subpoenas related to the push to appoint alternate electors,? including Arizona Republican Party Chair Kelli Ward, Pennsylvania Republican State Sen. Doug Mastriano, who is running for governor, and Arizona GOP Secretary of State candidate Mark FInchem.",
    "Theres a lot of uncertainty in the market right now.?\nThe number of senators who caucus with the Democrats (four Dems and Independent Sen. Bernie Sanders) who voted against the administrations pick to helm the Food and Drug Administration, who was narrowly confirmed Tuesday.",
    "More progressive groups are coming to the aid of Texas Democrat Jessica Cisneros in her tight 28th District primary race against Rep. Henry Cuellar  J Street Action Fund announced Tuesday its dropping $100,00 on digital ads in English and Spanish on her behalf.",
    "Other numbers you need to know today:\n61 percent: The decrease in hospitalization rate from Covid for a baby 6 months or younger if its mother was vaccinated for Covid (two shots, either Moderna or Pfizer) while pregnant, per a new CDC study.",
    "A Georgia judge is done hearing arguments about the states redistricting and could issue a decision as soon as next week to throw out the new maps and delay the states primary election, the Atlanta Journal-Constitution reports.",
    "Biden on Russia-Ukraine crisis: 'An invasion remains distinctly possible\nFeb. 16, 202202:40\nBut say Russia invades (either fully or partially), war breaks out, blood spills and the West retaliates with economic sanctions.",
    "A panel of judges charged with drawing Minnesotas new congressional boundaries released the new map Tuesday, leaving the political dynamics in each district largely unchanged, per the Star Tribune.",
    "$11.7 million: How much former California Republican Rep. Devin Nunes, who left to run Trumps social media company, had left in his campaign account and leadership committee as of the end of 2021.",
    "The story dropped the same day President Biden warned Americans that gas prices could shoot up further if Russia invades Ukraine and said hed take action to help customers if that happened.",
    "Under that best-case scenario, its highly unlikely that Biden gets credit from American voters, who are more focused on the nations direction, Covid, inflation and the state of the economy.",
    "Confirmed by the slimmest of margins (50 votes, but without the need for a tiebreaker), Dr. Robert Califf takes charge of the agency thats playing a big role in the U.S. pandemic response.",
    "$600,000: The amount of money two West Virginia GOP House members, Alex Mooney and David McKinley, have spent on ads as they face each other in West Virginias 2nd District.",
    "Sen. Marco Rubio, R-Fla., is leading Democrat Val Demings by 7 points among Florida voters, 49 percent to 42 percent, with 9 percent undecided, per a new Mason-Dixon poll.",
    "Notably, the ad only attacks two of Gibbons competitors, leaving two other candidates, former state treasurer Josh Mandel and state Sen. Matt Dolan, unscathed.",
    "The proposal has gained traction, according to the Washington Post, as the Biden administration looks for concrete steps to show they are on top of inflation.",
    "Ellen Wald, president of energy research firm Transversal Consulting, told NBC News it was unclear how much a gas tax holiday might achieve its own goals.",
    "Thats the highest number of House Democratic retirements since 1996 when 28 lawmakers headed for the exits, per Brookings Vital Statistics on Congress.",
    "The group considered raising the gas tax last year, last done in 1993, and expanding it to cover electric vehicles to make up for shrinking revenue.",
    "Politico reports theres a new super PAC backing two top Republican women running for Senate  Missouri Rep. Vicky Hartzler and Alabamas Katie Britt.",
    "Inflation hawks, like Larry Summers, worry a new tax cut will pump more cash into the economy right as the Fed is trying to cool off hot spending.",
    "Mike Gibbons, an investment banker running for Senate in Ohio, is blasting his fellow contenders for the Republican nomination in a new ad.",
    "Mark Kelly, D-Ariz., Ralph Warnock, D-Ga., Catherine Cortez-Masto, D-Nev., and Maggie Hassan, D-N.H., are all in tight re-election fights.",
    "A lot has changed since 2008, but the reaction from wonks across the political spectrum has been, if anything, more hostile than Obama's.",
    "Climate activists, fresh off a Super Bowl packed with ads for electric vehicles, worry about slowing the transition from fossil fuels.",
    "Several Democrats and Republicans who worked on the bipartisan infrastructure bill also came out against the concept on Tuesday.",
    "WASHINGTON  If its Wednesday ... President Biden warns that U.S. hasnt verified Russian troops withdrawing from Ukraine border.",
    "Clearly the price rise into the nineties [a barrel] has a lot to do with the geopolitical situation in Russia,? Wald said.",
    "78,208,662: The number of confirmed Covid cases in the U.S., per the most recent data from NBC News and health officials.",
    "Rep. Kathleen Rice, D-N.Y., became the 30th House Democrat to announce that she is not running for re-election.",
    "It might be a very short-term reprieve, but by the time we hit summer, its going to be exacerbated,? Wald said.",
    "The poll also found that 40 percent approved of Bidens performance in office, while 55 percent disapproved.",
    "The same political considerations that killed their effort could make it hard to undo a temporary tax cut.",
    "They're no different than Democrats because they're weak,? the ads narrator says about Vance and Timken.",
    "At the heart of the problem, Wald said, was reduced investment in drilling after years of weak profits.",
    "Say everything goes as well as the White House hopes  Russia pulls back its forces and war is averted.",
    "... A new poll shows Marco Rubio ahead in Florida's Senate race, though by a smaller margin than Gov.",
    "A decline in gas prices could cause consumers to drive more, which would then send prices back up.",
    "Vance called Donald Trump an idiot and smeared his America-first policies as immoral and absurd.",
    "... Biden orders National Archives to turn over Trump visitor logs to the Jan. 6 committee.",
    "Jane Timken defended a RINO congressman after he impeached Trump,? the narrator continues.",
    "Vance to President Joe Biden and Speaker of the House Nancy Pelosi in the new commercial.",
    "And the goal is just to avoid bigger political downsides ahead of the November elections.",
    "Notably, senators who recently backed a bill pushing for a gas tax holiday, such as Sens.",
    "... And San Francisco voters successfully recall those three school board officials.",
    "The CDC is expected to loosen its guidelines on indoor masking as soon as next week.",
    "They propose plugging the hole in the trust fund with general tax revenue instead.",
    "Well, that could have negative domestic political consequences for the president.",
    "But first: For Biden, the situation in Ukraine provides little political upside.",
    "Arizona moves one step closer to banning abortions after 15 weeks of pregnancy.",
    "Former New York City Mayor Bill de Blasio isnt running for Congress after all.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "... NBCs Benjy Sarlin looks at the cold reaction so far to a gas-tax holiday.",
    "He compares former Ohio Republican Party Chair Jane Timken and author J.D.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Especially if war gets in the way of the White Houses other plans.",
    "Richard Blumenthal, Conn.; Maggie Hassan, N.H.; Joe Manchin, W.V.",
    "929,004: The number of deaths from the virus so far.",
    "(Thats 117,918 more since yesterday morning.)",
    "(Thats 2,747 more since yesterday morning.)",
    "Joining Sanders were Democratic Sens.",
    "The best hope for immediate relief?",
    "But there may not be great options.",
    "Big potential downsides.",
    "; and Ed Markey, Mass.",
    "Ron DeSantis lead.",
    "Peace on Earth.",
    "Little upside.",
    "J.D."
  ]
}