{
  "id": 712,
  "mediaId": 2525,
  "date": "2022-02-21",
  "headline": "Robbins: Putin betting the West will wobble over Ukraine",
  "image": "https://www.bostonherald.com/wp-content/uploads/2022/02/AP22052565551334.jpg?w=1024&h=682",
  "link": "https://www.bostonherald.com/2022/02/21/robbins-putin-betting-the-west-will-wobble-over-ukraine/",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Robbins",
  "authorUrl": "https://www.bostonherald.com/author/jeff-robbins/",
  "termIds": [
    5648,
    5802,
    3322,
    2765,
    4591,
    4905,
    6569,
    6620,
    6643,
    6672
  ],
  "sentences": [
    "“Sending thousands more U.S. troops to Europe in response to Russia’s threats against Ukraine only fans the flames of war.”\nPutin has misjudged Biden, who has painstakingly constructed a program to expose, isolate and punish Putin for his aggression against Ukraine that seems likely to inflict economic and political consequences on Russia costlier than Putin had expected.",
    "Asked in 2012 what would lead him to use military force to stop Syria’s regime from slaughtering Syrians, President Obama replied that using chemical weapons would constitute a “red line.” When Syria murdered hundreds of its civilians with chemical weapons in 2013, the West melted.",
    "If Americans are too weak-kneed and too susceptible to conspiracy theories to don masks and vaccinate themselves against a deadly virus, Putin must figure, they won’t give much of a hoot if he forcibly subjugates 40 million Ukrainians and won’t be willing to do anything about it.",
    "“I really don’t care what happens to Ukraine one way or the other.”\nThen there’s the Ben & Jerry wing of the Democratic Party, which occupies its own ozone layer, believing that the way to stop tyrants and murderers around the world is to sing “Imagine” by John Lennon.",
    "In 2016, Putin allegedly directed a sophisticated cyber campaign against American institutions to tilt the outcome of the presidential election in order to install Donald Trump, whom he has said he wanted in the White House.",
    "And if Biden is under political pressure because Americans’ gas prices are at $4 a gallon, Putin calculates, Biden will never impose the sanctions on Russia which, while hurting Russians badly, will turn that $4 into $5.",
    "And it calls to mind the methodical diplomatic spadework done by President George H. W. Bush in 1991, assembling a complex coalition of states in response to Saddam Hussein’s invasion of Kuwait.",
    "This put a smile on Putin’s face, as he raged about the former Warsaw Pact countries and former Soviet republics that had joined NATO seeking refuge from Russia and protection against it.",
    "On the American right, Putin can count on his very own amen corner to belittle America’s president for trying to prevent Europe from becoming a free-fire zone for well-armed bullies.",
    "Despite his success leading Americans through the pandemic he inherited and bringing their economy back from the brink, President Biden’s approval ratings have gone south.",
    "“We call on President Biden to de-escalate tensions and work for peace rather than prepare for war,” tweeted the Chunky Monkey Mavens mindlessly, ignoring reality.",
    "Putin has had cause to believe that the United States was too feeble, too riven to organize a united international response to the moves he is making on Ukraine.",
    "For the next four years Trump did his best to undermine NATO, which has successfully constrained Soviet aggression in Europe since 1949.",
    "When Russia invaded Crimea in 2014, the Obama administration and Congressional Republicans alike signaled that it wasn’t our business.",
    "The West was bailed out by Russia, whose removal of its client state’s chemical weapons permitted America to save a measure of face.",
    "Obama punted to Congress, which made clear that it would not support anything more than mere words in response to Syrian war crimes.",
    "Vance, a Republican candidate for Senate in Ohio, exemplified the useful idiots in the pro-Putin wing of the GOP.",
    "Jeff Robbins is a Boston lawyer and former U.S. delegate to the United Nations Human Rights Commission.",
    "It is a program that serves America’s national interests, and does honor to its name.",
    "Vladimir Putin has been feeling his oats in recent years, and with reason.",
    "And he is doing the job that Americans elected him to do.",
    "Hussein and Putin have more than a little in common.",
    "“I got to be honest with you,” Vance said last week.",
    "As for Joe Biden, Moscow has underestimated him.",
    "The American people were similarly unsupportive.",
    "Our allies jumped ship.",
    "J.D."
  ]
}