{
  "id": 7155,
  "mediaId": 136,
  "date": "d2022-05-21T15:12",
  "headline": "Elise Stefanik, J.D. Vance 'Talking Like Nazis': Bill Maher",
  "image": "https://d.newsweek.com/en/full/2042609/maher-says-stefanik-vance-talking-like-nazis.webp?w=790&f=4275e3779bdbab15045858b7c19189f3",
  "link": "https://www.newsweek.com/elise-stefanik-jd-vance-talking-like-nazis-bill-maher-1708842",
  "sentiment": "-0.918",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    922,
    1095,
    1801,
    3103,
    428,
    562,
    571,
    2791,
    2945,
    2959
  ],
  "sentences": [
    "Politics is failing https://t.co/j4Cc07llZQ\n Adam Kinzinger (@AdamKinzinger) May 14, 2022\n\"Usual pedo grifters\" is straight-up QAnon rhetoric that led a gunman to open fire in a DC pizza place believing there were children trapped in a non-existent basement,\" wrote Michigan state Senator Mallory McMorrow, who is a Democrat.",
    "\"The White House, House Dems, & usual pedo grifters are so out of touch with the American people that rather than present ANY PLAN or urgency to address the nationwide baby formula crisis, they double down on sending pallets of formula to the southern border,\" Stefanik wrote.",
    "Some of the GOP's rhetoric has come under increased scrutiny in the past week as they face accusations of promoting racist or far-right ideas including the \"Great Replacement\" theory, a racist conspiracy claiming that white people are being replaced by people of color.",
    "\"Evoking Nazi rhetoric shows that the mainstream media and the Democrats will stoop as low as possible to continue their smear campaign against Republicans, which is not only dishonest but at this point just incredibly disgusting,\" she wrote.",
    "\"I know we're not supposed to make the Nazi comparison, but when you're pedophiles, and when you're scum, when you're the enemies of the America, when people are trying to replace you, this is Nazi kind of talk.\"",
    "JD has called out Democrats for policies that allow illegal immigrants the right to vote, which has happened in communities around the nation like New York City and even Yellow Springs, Ohio.\"",
    "He specifically pointed to remarks from Vance, who is the GOP nominee in Ohio's Senate race, and Stefanik, a New York congresswoman who serves as chair of the House Republican Conference.",
    "\"usual pedo grifters\" is straight-up QAnon rhetoric that led a gunman to open fire in a DC pizza place believing there were children trapped in a non-existent basement.",
    "During a conversation on The Bill Maher Show, Maher took aim at some Republicans for promoting theories he believed to be similar to those espoused by Nazis.",
    "He criticized a statement made by Vance last month about the opioid epidemic, which has killed hundreds of thousands of people across the United States.",
    "\"If you wanted to kill a bunch of MAGA voters in the middle of the heartland, how better than to target them and their kids with this deadly fentanyl?\"",
    "The talk show host slammed the comment, accusing the Senate hopeful of \"saying that Democrats are intentionally poisoning people with fentanyl.\"",
    "The theory was parroted by the Buffalo mass shooter, Payton Gendron, who killed 10 Black people inside a Tops Friendly Market last Saturday.",
    "Representative Adam Kinzinger, an Illinois Republican, responded to Stefanik, writing her tweet is indicative that \"politics is failing.\"",
    "He also called out \"former normal person\" Stefanik, who accused Democrats of being \"pedo grifters\" in a tweet earlier this month.",
    "https://t.co/cl1IkYEkMs\n Mallory McMorrow (@MalloryMcMorrow) May 13, 2022\nNewsweek reached out to Stefanik's office for comment.",
    "\"It is a stone cold fact that JD Vance has never supported the great replacement theory and any insinuation otherwise is a lie.",
    "In a statement to Newsweek on Saturday, Vance's spokesperson Taylor Van Kirk criticized Maher for comparing Vance to Nazis.",
    "Vance said the deaths seem \"intentional\" and \"like [President Joe] Biden wants to punish people who didn't vote for him.\"",
    "Maher, noting Stefanik's position in GOP leadership, criticized the attack as being \"routine\" among some Republicans.",
    "Anyone claiming to legitimately care about children should stop using rhetoric that will get people killed.",
    "Some on the right have attacked Democrats using the same rhetoric, which has also been used by QAnon.",
    "\"You used to be the bridge builder in politics, now you are calling people PEDOPHILES,\" he wrote.",
    "Other media figures and politicians have also condemned the GOP's rhetoric in recent weeks.",
    "You used to be the bridge builder in politics, now you are calling people PEDOPHILES.",
    "Bill Maher accused Republicans, including Representatives Elise Stefanik and J.D.",
    "Vance, who received the endorsement of former President Donald Trump, said.",
    "\"I'm sorry, but the Republicans are talking like Nazis,\" Maher said.",
    "ET: This article was updated with a statement from Vance's campaign.",
    "Vance, of \"talking like Nazis\" during his show on Friday.",
    "\"America, you deserve better than this.\"",
    "America, you deserve better than this.",
    "We deserve leaders that inspire.",
    "Update 05/21/22, 11:33 a.m.",
    "Ok. What?"
  ]
}