{
  "id": 7157,
  "mediaId": 238,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Opinion After Buffalo massacre, Republicans double down on great replacement'",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/20/after-buffalo-republicans-double-down-great-replacement/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Waldman",
  "authorUrl": "https://www.washingtonpost.com/people/paul-waldman/",
  "termIds": [
    683,
    1119,
    2390,
    3103,
    5451,
    345,
    428,
    2787,
    4938
  ],
  "sentences": [
    "We've seen versions of this exchange many times before: There's an act of right-wing domestic terrorism; it turns out that the terrorist was motivated by ideas heard commonly from conservative media figures and Republican politicians; Democrats say You helped this happen; and Republicans reply How dare you say that, we're the real victims here.\nBut if this time feels a little different, it might be because few if any members in the Republican Party are saying Maybe we ought to turn down the volume a bit. There is no self-reflection, and no one in a position of influence is willing to discourage fellow Republicans from continuing to inject this noxious poison into the national bloodstream.",
    "If you're worried about this quote-unquote replacement,\" he said, we should \"start with allowing our own people to live.\nArizona Senate candidate Blake Masters recorded a video in which he said, The Democrats want to bring in millions of people and grant them amnesty,\" and then anticipated that this would get him labeled a white supremacist.\nSome Republicans who have promoted versions of the great replacement, such as Ohio Senate candidate J.D.",
    "Dan Patrick went on Fox News to say that Democrats want to bring in millions of people into this country illegally to turn them into \"voters so they can control the country.\nAt this year's Conservative Political Action Conference (held in Budapest as a tribute to Hungarian dictator Viktor Orban), CPAC chair Matt Schlapp told reporters that overturning Roe v. Wade would help tip the balance against immigrants.",
    "The idea has roots that go back a long way, but in its contemporary form, the theory holds that Democrats, sometimes in cooperation with a conspiracy of powerful Jews, are scheming to import huge numbers of non-White immigrants to overwhelm legacy Americans,\" as Fox News host Tucker Carlson puts it.",
    "That's the question many conservatives faced in the wake of the massacre in a Buffalo supermarket, when we learned that the accused killer wrote a manifesto echoing the great replacement theory that has become so prominent in conservative circles of late.",
    "The underlying presumptions are that every immigrant is a threat to White people, and that the growing diversification of America is both terrifying and the product of a conspiracy to oppress Whites and destroy the country.",
    "insisted that the United States is the victim of an invasion from the south, comparing it with Russia's invasion of Ukraine, as though Mexican farmworkers were bombing U.S. cities and killing Americans by the thousands.",
    "They might have reacted in any number of ways: Reconsidering the implications of their rhetoric, toning things down, perhaps actively dissuading those who might see in that rhetoric as a rationale for violence.",
    "These immigrants will be granted citizenship to vote out Republicans and turn the United States into a dystopian nightmare in which White people will be hounded and oppressed.",
    "Carlson, who has touted ideas echoing the great replacement on no fewer than 400 episodes of his show, said bizarrely that we're still not sure exactly what it is.\"",
    "It's now deep in the heart of the Republican Party and the conservative movement, promoted by TV hosts and high-ranking GOP officeholders and candidates.",
    "What distinguishes the current moment is that talk of replacement is not just for torch-bearing neo-Nazis chanting Jews will not replace us anymore.",
    "The man who killed 11 people in 2018 in a Pittsburgh synagogue did so because he believed Jews were responsible for importing non-White immigrants.",
    "Which means that the result of the Buffalo massacre will be a Republican Party more, not less, committed to the great replacement idea.",
    "If someone used an idea you had been espousing as justification for a horrific act of mass murder, how would you react?",
    "He then echoed it again, insisting that Democrats want to import non-natives to \"change the electorate.\nTexas Lt. Gov.",
    "As a result of the horror in Buffalo, this rancid idea might become even more central to Republican ideology.",
    "Instead, many on the right are doing the opposite: They're doubling down on the great replacement.",
    "The man who killed 23 people at an El Paso Walmart in 2019 wanted to kill immigrants from Mexico.",
    "You're not a racist for wanting an immigration system that protects our citizens, Vance tweeted.",
    "All we hear from the right is more anger, more venom and a ratcheting up of the rhetoric.",
    "Some form of great replacement theory has apparently inspired numerous mass shootings.",
    "Vance, have chosen to focus on their own alleged oppression.",
    "Accusations of racism are often about silencing dissent.",
    "Sen. Ted Cruz (R-Tex.)"
  ]
}