{
  "id": 7161,
  "mediaId": 147,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Gov. Kay Ivey, challengers race to the right in Alabama GOP primary",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2022/05/2022-03-16T011707Z_78584434_RC243T9SSDLG_RTRMADP_3_AUTOS-MERCEDES-ALABAMA-1200x800.jpg",
  "link": "https://www.pbs.org/newshour/politics/gov-kay-ivey-challengers-race-to-the-right-in-alabama-gop-primary",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kim Chandler",
  "authorUrl": "https://www.pbs.org/newshour/author/kim-chandler-associated-press",
  "termIds": [
    834,
    1147,
    2529,
    3103,
    4098,
    4592,
    11,
    428,
    2537
  ],
  "sentences": [
    "Governor Ivey has done what other people are only talking about doing.\nAmong other actions, the campaign cited her record on job creation and her signing of legislation to try to ban abortion at any stage of pregnancy, forbid transgender girls from playing on girls' sports teams at schools and outlawing the use of puberty-blockers and hormones to treat transgender minors.",
    "The race was supposed to be a cake walk for Ivey  who still remains favored to win a second full term  but right flank opponents are trying to make it a referendum on conservative credentials as they seek to push the Alabama governor into a runoff.",
    "David Mowery, an Alabama-based political consultant, said right now there is a lot of sound and fury and we'll see what it signifies on Election Day.\nIvey still has the upper hand and at least a solid shot of winning without a runoff, he said.",
    "State Rep. Mike Ball, who is retiring after 20 years in the Alabama Legislature, said the candidates all have staunchly conservative positions and are in a race amongst themselves to be the most conservative of all.",
    "It was there that a cantankerous crowd jeered U.S. Rep. Mo Brooks for suggesting that voters focus energy on the next election since they couldn't change the outcome of the most recent presidential contest.",
    "LIVE: 2022 Pennsylvania Primary Election Results\nAlabama's Republican primary has become a race to the right, with candidates staking out extreme positions on abortion, immigration and LGBTQ issues.",
    "James in other ads called transgender swimmer Lia Thomas, a man in a woman's bathing suit and criticized a first of its kind charter school in Homewood that was created to welcome LGBTQ students.",
    "But a competing ad by former Trump ambassador Lindy Blanchard calls Ivey a tax-hiking Fauci-loving liberal, swiping at her for actions during the COVID-19 pandemic and a gas tax increase.",
    "Former Morgan County Commissioner Stacy Lee George, Opelika pastor Dean Odle, businessman Dean Young, Donald Trent Jones and Springville Mayor Dave Thomas are also challenging Ivey.",
    "James has also criticized past mask mandates and the gas tax increase that includes a provision for automatic increases based on the National Highway Construction Cost Index.",
    "They instead are placing hopes that they can collectively garner enough primary votes and keep Ivey below 50% of the vote to spark a runoff and a new political ballgame.",
    "WATCH: Breaking down the primary results and what they mean for midterm elections\nAn Ivey campaign spokesman said the governor is confident she will win without runoff.",
    "Vance, the author of Hillbilly Elegy, won the Republican primary for an Ohio Senate seat in a race where contenders competed to be the most Trump-like candidate.",
    "Blanchard, who left the U.S. Senate race to run for governor, said there are GOP voters who are not happy with Ivey's leadership on a number of issues.",
    "Kay Ivey falsely declares the election was stolen from Donald Trump and accuses the federal government of shipping illegal immigrants to the state.",
    "She particularly cited Ivey's support for the gas tax increase and mask mandate and business closures during the peak of the coronavirus pandemic.",
    "Blanchard, who was Trump's ambassador to Slovenia, ran an ad that questioned why Ivey didn't appear on stage with Trump at a Cullman rally.",
    "Governor Ivey and the political crowd found a way to raise taxes forever without having to vote on them, James said in the ad.",
    "Fob James  and Lew Burdette, who runs King's Home, a Christian-based nonprofit with group homes throughout the state.",
    "Ivey faces a total of eight primary challengers, including Blanchard, businessman Tim James  the son of former Gov.",
    "She has always been a fighter for conservative values and that will never change, Heartsill said.",
    "I don't want the government anywhere near my health care telling me what to do, Blanchard said.",
    "It is historically difficult for a primary challenger to defeat an incumbent governor.",
    "Ivey greeted Trump at the airport and her office distributed photos of the meeting.",
    "Spokesman William Heartsill said the governor's record speaks for itself.",
    "None of the primary challengers have the footprint to defeat Ivey alone.",
    "Blanchard, she said referencing the Florida and South Dakota governors.",
    "Kay Ivey is the most conservative governor our state has ever had.",
    "In a pair of campaign ads this GOP primary season, Alabama Gov.",
    "There are some extreme positions being taken in this primary.",
    "I want the people of Alabama to know that if you like Gov.",
    "Look at the ads on these hot button issues, he said.",
    "DeSantis and Kristi Noem, then you'll like Gov.",
    "Trump has not weighed in on the Alabama race.",
    "My message to Biden: No way, Jose, she says.",
    "The dynamic is playing out in other states.",
    "J.D."
  ]
}