{
  "id": 7164,
  "mediaId": 129,
  "date": "d2022-05-20T00:00",
  "headline": "A Renowned Gullah Geechee Cook Gets Her Own Book and More: The Week in Narrated Articles",
  "image": "https://static01.nyt.com/images/2022/05/11/dining/20narrated-2/09Gullah-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/20/podcasts/gullah-geechee-cook-narrated-articles.html",
  "sentiment": "0.462",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1801,
    2524,
    3103,
    4109,
    5401,
    2834,
    2945
  ],
  "sentences": [
    "They wouldn't have touched Vance with a 10-foot pole if they thought he was part of this Trump, xenophobic, bigot-fueled zeitgeist.\nA spouse who commits mariticide will almost certainly become a prime suspect, the romance novelist Nancy Brophy said in a 2011 blog post titled How to Murder Your Husband. The wife, she said, must be organized, ruthless and very clever.\nAfter all, if the murder is supposed to set me free, I certainly don't want to spend any time in jail, Ms. Brophy wrote.",
    "But Mr. Vance's political rise was also made possible by the worlds of publishing, media and Hollywood, fields long seen as liberal bastions, which had embraced him, through his memoir Hillbilly Elegy, as a credible geographer of a swath of America that coastal elites knew little about, believing that he shared their objections to Mr. Trump.",
    "She was born on Edisto Island in the heart of the South Carolina Lowcountry, as were her parents and their parents, in a line that connects back to the enslaved Africans who were forced to work in what is now known as the Gullah Geechee corridor, a string of coastal communities from North Carolina to Florida.",
    "And let me say clearly for the record, I don't like jumpsuits and orange isn't my color.\nSeven years later, Ms. Brophy's husband, Daniel, was brutally murdered, shot twice inside the kitchen of a Portland, Ore., culinary institute where he was arriving for work on a sunny June morning.",
    "Five years ago, the Ringling Brothers and Barnum & Bailey Circus packed up its proverbial big top for what it said was for good, ending a 146-year run in the face of slumping sales and a growing public distaste for the lion, tiger and elephant acts once synonymous with this circus.",
    "The reason Hillbilly Elegy' was such a high-octane book was academics, professors, cultural arbitrators  liberals  embraced it as explaining a forgotten part of America, said Douglas Brinkley, a professor of history at Rice University who once introduced Mr. Vance at an event.",
    "Two weeks ago, Mrs. Meggett, who has never used a cookbook during her 78 years in the kitchen, published her own: Gullah Geechee Home Cooking: Recipes From the Matriarch of Edisto Island.\nFormer President Donald J. Trump's endorsement of J.D.",
    "Now, prosecutors are trying to build a follow-the-string criminal case to prove that Ms. Brophy, 71, killed her husband with the same type of brutal cunning she once speculated would be necessary to evade conviction and reap the rewards.",
    "But especially now, at the milestone of one million deaths in the United States, the nations that did a better job of keeping people alive show what Americans could have done differently and what might still need to change.",
    "Ringling has always evolved: Logically, in order to be successful for 146 years, you constantly have to change, said Kenneth Feld, the chief executive officer of Feld Entertainment, which purchased the circus in 1967.",
    "Yet Australia's Covid death rate sits at one-tenth of America's, putting the nation of 25 million people (with around 7,500 deaths) near the top of global rankings in the protection of life.",
    "On Wednesday, the company announced that it would officially return, with its first show on Sept. 28, 2023, and a tour of more than 50 cities, but without any animals.",
    "Feld is betting big on a revamped show that is centered not on things like elephants standing on their hind legs, but on narrative story lines and human feats.",
    "But over the past year, in places like Las Vegas, Ethiopia and Mongolia, the circus has quietly been evaluating talent and ramping up for a comeback.",
    "So did the financial support of Peter Thiel, the conservative Silicon Valley billionaire, and favorable coverage by Tucker Carlson on Fox News.",
    "Vance proved critical in the Republican primary for an open U.S. Senate seat in Ohio that Mr. Vance won this month.",
    "At 89, Emily Meggett is considered by many to be the most important Gullah Geechee cook alive.",
    "Through centuries of slavery, they managed to hold on to some traditions and forge new ones.",
    "They created their own Creole language called Gullah and a culture known as Gullah Geechee.",
    "But Australia offers perhaps the sharpest comparisons with the American experience.",
    "Both countries are English-speaking democracies with similar demographic profiles.",
    "For many Americans, imagining what might have been will be painful.",
    "Many places provide insight.",
    "Norway.",
    "Japan.",
    "Kenya."
  ]
}