{
  "id": 7371,
  "mediaId": 2562,
  "date": "2022-04-05",
  "headline": "JD Vance Ad Blasts Dems for Race-Baiting on Border Politics",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguidFBB8870E-DD28-46C9-8D0F-0A0D9F4F715A.jpg",
  "link": "https://donaldjtrumppolls.com/jd-vance-ad-blasts-dems-for-race-baiting-on-border-politics/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    4306,
    976,
    542,
    392,
    1126,
    1489
  ],
  "sentences": [
    "Republicans note fentanyl from Mexican drug cartels has been killing record numbers of Americans in recent years, blaming Biden's unwinding former President Donald Trump's secure border policies, which has led to emboldened drug and human traffickers at the southern border.",
    "JD Vance Ad Blasts Dems for Race-Baiting on Border Politics JD Vance speaks at the FreedomWorks Forum for Ohio's Republican Senate Candidates on March 18, 2022 .",
    "Vance released his first campaign television ad Tuesday, attacking Democrats for their race-baiting on border politics instead of his Republican primary rivals.",
    "The ad will begin running Wednesday, April 6 as part of a $1 million buy running statewide on broadcast and cable, according to Vance's Senate campaign.",
    "Drug addiction and drug-related overdose deaths have heavily impacted Ohio and remain a key issue in the 2022 midterm elections.",
    "Joe Biden's open border is killing Ohioans – with more illegal drugs and more Democrat voters pouring into this country.\"",
    "(Andrew Spear/Getty Images)\nBy Eric Mack | Tuesday, 05 April 2022 08:02 PM\nOhio GOP Senate primary candidate J.D.",
    "Vance called the issue \"personal,\" saying, \"I nearly lost my mother to the poison coming across our border.\"",
    "\"The media calls us racists for wanting to build Trump's wall.",
    "\"No child should grow up an orphan,\" he continued.",
    "They censor us, but it doesn't change the truth.",
    "Vance asked in the 30-second ad.",
    "\"Do you hate Mexicans?",
    "\"Are you a racist?\"",
    "Original Article"
  ]
}