{
  "id": 786,
  "mediaId": 2547,
  "date": "2022-02-19",
  "headline": "Vance Claims US Is Fighting With Putin Because Of Transgender Rights",
  "image": "https://crooksandliars.com/files/mediaposters/2022/02/49589.jpg",
  "link": "https://crooksandliars.com/2022/02/jd-vance-shocklingly-claims-us",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Amato",
  "authorUrl": "https://crooksandliars.com/team/john-amato",
  "termIds": [
    0
  ],
  "sentences": [
    "Now, for the first time since, the U.S. has a political party in the Republicans who parrot Russian propaganda, and support Putin's invading a neighboring country — and one that's our ally, no less.",
    "NATO was established in 1949 between 27 European countries, two North American countries, and one Eurasian country to defend against foreign attacks, especially by Russia.",
    "Vance told \"not-yet-in-prison\" Steve Bannon that America is fighting with Russia's Vladimir Putin because the Russian president doesn't believe in transgender rights.",
    "As with all MAGA troglodytes, he only focuses on immigration and the southern border, which he claims is the root of all problems in America.",
    "Vance, the fool from Ohio, claims elites don't like what Vladimir Putin stands for, but are fine with an \"invasion\" here.",
    "\"We did not serve in the Marine Corps to go and fight Putin because he didn't believe in transgender rights.",
    "Bannon attacks elitists in this country, but he's about as elitist as a person can get.",
    "Vance continued, \"I think it's ridiculous we're focused on this border in Ukraine.",
    "Bill Kristol tweeted, \"No hillbilly would believe any of this demagoguery.\"",
    "Which the State Department is saying is a major problem,\" Vance said.",
    "I don't really care what happens to Ukraine one way or the other.\"",
    "Once again, I say this is sick and twisted.",
    "I'm sot so sure of that these days, Bill.",
    "Obviously, Vance loves Putin very much.",
    "The Traitor Trump-lover J.D.",
    "I gotta be honest with you.",
    "This is sick and twisted.",
    "J.D."
  ]
}