{
  "id": 838,
  "mediaId": 3987,
  "date": "2022-02-23",
  "headline": "New America’s Voice Analysis: the Xenophobic Lies and Anti-Immigrant Race to the Bottom in Ohio Senate GOP Primary",
  "image": "http://americasvoice.org/wp-content/uploads/2022/01/GOP-1200x800.png",
  "link": "https://americasvoice.org/press_releases/new-americas-voice-analysis-the-xenophobic-lies-and-anti-immigrant-race-to-the-bottom-in-ohio-senate-gop-primary/?utm_source=rss&utm_medium=rss&utm_campaign=new-americas-voice-analysis-the-xenophobic-lies-and-anti-immigrant-race-to-the-bottom-in-ohio-senate-gop-primary",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AV Press Releases",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In so doing, the ‘Hillbilly Elegy’ author is testing the potency of a larger argument — that we should dramatically retreat from international commitments and obligations, and essentially shrug about democratic allies abroad — as a central tenet of the populist nationalism that Vance and others hope to make viable in the post-Donald Trump era.",
    "According to Zachary Mueller, Senior Political Manager for America’s Voice and lead author of the analysis,\nWithout a clear frontrunner for the Ohio Senate GOP primary in May, several well-financed candidates are in a race to see who can spew the most xenophobic venom to generate fear and misinformation.",
    "Read the new America’s Voice report: “The Ohio GOP Senate Primary has Turned into One Expensive, Nasty Slugfest Filled with Dangerous Xenophobic Lies”\nCheck out ongoing examples of Republicans’ anti-immigrant ads at the America’s Voice GOP Ad Tracker: http://gopadtracker.com/",
    "From Charlottesville, Virginia in 2017 to Pittsburgh, Pennsylvania in 2018 to El Paso, Texas in 2019 to the United States Capital in 2021, we have seen the deadly effects of letting conspiracy theories and racist lies go unchallenged.",
    "Titled, “The Ohio GOP Senate Primary has Turned into One Expensive, Nasty Slugfest Filled with Dangerous Xenophobic Lies,” the new analysis finds that well-funded candidates in the competitive primary, such as Josh Mandel, J.D.",
    "As the report notes:\nThe embrace of the ‘great replacement’ and ‘invasion’ rhetoric isn’t an issue anyone should wave off as an all too predictable bombastic language of a Republican primary in a Trumpian party.",
    "The fact that the leading GOP Senate candidates in Ohio are enthusiastically echoing similar conspiracy theories that inspired mass murder in neighboring Pennsylvania, is a reality we should not ignore.",
    "Vance’s favorite lines about Russian troops massing around Ukraine is this formulation, which he evidently thinks is dazzlingly clever: We should care far more about our own border than that of Ukraine!",
    "It’s a race to the bottom in Ohio and across the country as candidates spew this vile and xenophobic language without any concerns for ramifications beyond appealing to their base.",
    "Washington, DC – New analysis from America’s Voice examines the role of xenophobia and dangerous anti-immigrant conspiracies in Ohio’s Republican Senate primary.",
    "These are the conspiracy theories that the U.S. is being invaded by hostile migrants and that Democrats back these migrants to replace white voters and workers.",
    "Despite the demonstrated real world consequences of such language, all of the candidates have embraced it and have been running on the “open borders” falsehood.",
    "Notably, the dominance of anti-immigrant rhetoric in the Ohio Senate primary seems to course through candidates’ answers on a whole range of subjects.",
    "No doubt, the candidates know full well that their rhetoric is dangerous and has the potential to incite violence.",
    "Vance, and Jane Timken have embraced dangerous anti-immigrant “invasion” and “replacement” rhetoric.",
    "For example, as Greg Sargent wrote in the Washington Post this week:\nOne of J.D.",
    "But, none of that matters in today’s GOP.",
    "Vance says this regularly."
  ]
}