{
  "id": 8563,
  "mediaId": 136,
  "date": "d2022-05-29T10:00",
  "headline": "McConnell's Win on Ukraine Aid Isn't the End of GOP Foreign Policy Debate | Opinion",
  "image": "https://d.newsweek.com/en/full/2047246/senate-minority-leader-mitch-mcconnell-r-ky-speaks.webp?w=790&f=4d1ace1262ae1d2d578f6d94e1c5b12c",
  "link": "https://www.newsweek.com/mcconnells-win-ukraine-aid-isnt-end-gop-foreign-policy-debate-opinion-1710970",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Tobin",
  "authorUrl": "https://www.newsweek.com/authors/jonathan-tobin",
  "termIds": [
    1147,
    1341,
    1501,
    1765,
    2030,
    3103,
    6175,
    428,
    571,
    2888,
    2942
  ],
  "sentences": [
    "The imagery of Republicans supporting such a large amount being sent abroad at a time of domestic woes such as inflation, supply chain shortages such as that affecting baby formula and a crisis at the southern border that has created a flood of illegal immigrants heading into the country, goes against the GOP's midterm strategy of holding Biden accountable for the deplorable state of the country.",
    "From that perspective, though the $40 billion is more than the United States sends to any allyIsrael is routinely bashed for receiving $3.8 billion in annual military assistance even though almost all of it is subsequently spent back in the United Statesit would be money well spent if it helped degrade the Russian military and sent a deterrent message to China.",
    "But in 2022, McConnell is still the enemy in the eyes of the mainstream media, and skepticism about the puzzling way in which much of the Washington establishment from both parties has decided the territorial integrity of Ukraine is the main objective of American foreign policy is likely to only grow among conservatives.",
    "But McConnell, who had helped orchestrate the victory with a quick trip to Ukraine the previous weekend, was still satisfied, claiming that the vote represented a reaffirmation of his party's traditional support for the U.S.-Europe alliance over the views of a group he dismissed as \"isolationists.\"",
    "Given that he can take credit for the likely impending overturning of Roe v. Wade by conservative Supreme Court justices whose confirmations were largely his doing, McConnell can be forgiven for thinking that despite his low polling numbers, his party's base should acknowledge his achievements.",
    "That dissent, as well as the efforts of GOP dissidents like Sen. Rand Paul (R-KY) to slow down the Biden administration's rush to pass the bill, was enough for Senate Majority Leader Chuck Schumer (D-NY), whose caucus was unanimous in its support, to slam Republicans for being \"soft on Putin.\"",
    "Moreover, even though many on the Right see the obsession with Russia as a distraction from the more dangerous threat from Communist China, Sen. Ted Cruz (R-TX) backed McConnell on the aid package because of a belief that it would help deter Beijing from a possible invasion of Taiwan.",
    "Anyone who has been listening to the rhetoric on the campaign trail in contested Republican primaries around the country knows that it's Trump's skepticism about Ukraine, rather than McConnell's internationalism, that is motivating GOP voters to turn out this year.",
    "If much of what is being sent to Kyiv winds up in the pockets of friendly oligarchs or officials, McConnell may regret choosing not to insist on accountability for the aid process while buying into Biden's talking points about saving democracy in Eastern Europe.",
    "The emergence of Trump and others who buck the foreign policy establishment's conventional wisdom on a number of issues should have already made it clear to McConnell and his Senate cronies that their period of dominance of the party is nearing an end.",
    "And he can also point to a Pew Research Center poll that not only shows most Americans support aid to Ukraine, but also that a plurality of conservatives actually think President Joe Biden hasn't done enough to help resist the Russian invasion.",
    "Though Trump's rhetoric about NATO and foreign entanglements in general sounded isolationist at times, in practice, it was anything but, as his efforts strengthened the alliance while taking aggressive stands against ISIS and Iran.",
    "McConnell's willingness to agree with Biden about rushing aid to Ukraine because of the urgency of its wartime needs may eventually come back to bite him if a GOP Congress elected this fall pursues oversight for the spending.",
    "Those voters do so primarily because he understands that in the current atmosphere of total culture war in which the Left demonizes all conservatives, bipartisanship only helps foes who would never return the favor.",
    "In that sense, McConnell is channeling Sen. Arthur Vandenberg (R-MI), who chaired the Senate Committee on Foreign Relations in the late 1940s and supported President Harry Truman's Cold War policies in Europe.",
    "Both made the point that although former President Donald Trump had been critical of the massive package, only 11 out of the 50 Republicans in the Senate had followed his lead on the issue.",
    "After getting his way on a $40 billion Ukraine aid bill, Senate Minority Leader Mitch McConnell (R-KY) took a victory lap in the form of a fawning New York Times interview.",
    "The Kentucky senator had to be particularly pleased with the headline on the piece that read, \"On Ukraine, McConnell Tries to Show the World This Isn't Trump's GOP.\"",
    "And in a less partisan era than the one he is now living in, McConnell playing Vandenberg to Biden's Truman might have won him points even within his own party.",
    "Despite Ukrainian President Volodymyr Zelensky being given the Churchill treatment by the international press, his government is well known for corruption.",
    "With most of his caucus sticking with him over the complaints of Trump and many of the former president's supporters, McConnell had cause to celebrate.",
    "Should he work with Biden to try to pass a similar Ukraine aid package next year, McConnell is probably setting himself up for defeat.",
    "The same day, Politico chimed in with a similar article that took its readers \"Inside McConnell's bid to quash GOP 'isolationists.'\"",
    "Vandenberg's bipartisan cooperation with Democrats was summed up by his famous quip about \"politics stopping at the water's edge.\"",
    "Jonathan S. Tobin is editor-in-chief of JNS.org, a senior contributor to The Federalist and a columnist for the New York Post.",
    "Still, a willingness to play ball with the Democrats on Ukraine isn't likely to endear McConnell to voters who love Trump.",
    "One of the main GOP criticisms of Biden is that his weakness in Afghanistan and elsewhere encouraged Russia's aggression.",
    "The GOP Senate caucus that convenes next January is likely to have several more Ukraine skeptics, such as J.D.",
    "McConnell's boasts are not in sync with the message most Republican primary voters are sending.",
    "That will be even truer for what is likely to be a new Republican majority in the House.",
    "Indeed, the lack of transparency in the aid bill is a real problem.",
    "The Left likes the idea of anyone putting Trump in his place.",
    "The views expressed in this article are the writer's own.",
    "Follow him on Twitter: @jonathans_tobin.",
    "Vance in Ohio."
  ]
}