{
  "id": 8571,
  "mediaId": 151,
  "date": "5/26/2022 12:00:00 AM",
  "headline": "'Trump picked this fight': Why heavyweight Republicans no longer fear Trump",
  "image": "https://www.politico.com/dims4/default/7fd189d/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F1d%2F8f%2Fc0415f744a62aa2b1e13d2deae56%2Faptopix-election-2022-georgia-governor-kemp-52529.jpg",
  "link": "https://www.politico.com/news/2022/05/26/republicans-not-afraid-of-trump-00035311",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    3103
  ],
  "sentences": [
    "I think that observers believe that that would be a very bad decision for the Republican Party in this situation, and I think it's important to have people like Sen. Cruz who are willing to come in and say, I don't know what the president is going to do, but there are some other good conservatives running in this race.'",
    "After the Brooks event in Alabama on Monday, Cruz said he was pleased when Trump had initially put his support behind Brooks, but that he was ultimately endorsing the congressman because he believed Brooks was the most conservative candidate in the race  and one who could win, regardless of Trump's endorsement.",
    "The Club also stood firm in its Senate endorsement of Brooks in Alabama after Trump rescinded his support in March, continuing to buy television ads on Brooks' behalf and releasing a statement in which McIntosh called Brooks the only principled, pro-growth conservative in the race.",
    "After Trump's decision to yank his endorsement of Brooks  a move the former president made as Brooks was floundering in the polls, but blamed on the congressman going woke for wanting to move on from the 2020 election  other prominent Republicans stepped in to lend their support.",
    "I think the former president has been poorly advised because he's made a lot of endorsements in an effort to showcase his formidability, a Pence adviser said, and that has the counter-effect that actually shows the endorsement doesn't carry the same weight it once did.",
    "GOP strategists say this post-primary moment following Trump's bitter defeat in Georgia isn't a low-water mark of Trump's influence, but rather an acknowledgment that he is not the alpha and omega of every political calculation that will unfold from now until 2024.",
    "Never was it more obvious than in Georgia, where Trump was the proximate cause of the loss of Republican-held Senate seats in 2021 and then ignited a civil war within the party, all because top state officials refused to overturn the 2020 election results there.",
    "But to many, Trump's habit of rolling grenades into Republican primaries is getting old, and fears that he might damage the party's promising prospects for gains this fall appear to be opening a new chapter in the GOP's relationship with him.",
    "Ted Cruz (R-Texas) and Rand Paul (R-Ky.) bucked the former president by stumping this week for Rep. Mo Brooks in his bid for Alabama's GOP Senate nomination  the same congressman that Trump unceremoniously ditched after initially endorsing.",
    "It shows that while people realize Donald Trump is virtually, in every way, still the leader of the Republican Party, people are willing to stick their necks out and support good candidates opposite of Trump when they see them, Keller said.",
    "The Club for Growth, the anti-tax organization headed by David McIntosh, whose super PAC has been one of the top outside spending groups on Senate races this cycle, doubled down on its support for Mandel after Trump endorsed Vance.",
    "Earlier this month, the National Rifle Association endorsed Brooks  support the congressman promptly announced in a television ad that ran across the deep-red state, where Second Amendment rights remain a top priority for voters.",
    "In some of the most contentious Senate primaries this year, top Republicans have found themselves supporting a different candidate than Trump because he waited months to get involved  after allegiances had already been pledged.",
    "Channeling growing fatigue among rank-and-file Republicans, some of the GOP's best-known heavyweights are increasingly defying former President Donald Trump in the wake of internecine conflicts from Georgia to Pennsylvania.",
    "Gregg Keller, a Missouri-based Republican strategist, said it's essential for an ideologically and culturally diverse party to have politically countervailing forces against some of Trump's ill-advised endorsement picks.",
    "In the months leading up to Trump's endorsement of Oz, McCormick had assembled a team of former Trump advisers and officials like Kellyanne Conway, Hope Hicks, Mike Pompeo, Larry Kudlow, and Sarah Huckabee Sanders.",
    "Its endorsement of Kathy Barnette the week before the primary election  including spending more than $2 million on ads supporting her  could be interpreted as a clear sign of rebuke to Trump's endorsement of Oz.",
    "I can't imagine that somebody's been running for office for a year, a whole bunch of people take positions on the race, then Trump decides to endorse somebody, and that means you can't be for them anymore?",
    "In both cases, national Republicans had already offered their support to other candidates months earlier: Cruz, for instance, had endorsed Josh Mandel in Ohio and David McCormick in Pennsylvania.",
    "The Club went so far as to increase its ad buy featuring old clips of Vance disparaging Trump, a decision that reportedly angered the former president and put Trump and McIntosh squarely at odds.",
    "If you get into the runoff, I'm looking at my calendar  I think I might want to come down to Alabama and help if you make it into the runoff, Paul said to Brooks at the end of the call Monday.",
    "On Monday, both Cruz and Paul stumped for Brooks, Cruz coming to Huntsville and Paul holding an election eve tele-town hall with 13,000 Republican voters.",
    "Now, GOP strategists are turning their attention to Missouri, where the next front in the battle between Republican heavyweights and Trump may unfold.",
    "I'm not sure he has a clipboard and says, Well, Tom Cotton didn't follow my endorsement here and here  he's banished,' the national strategist added.",
    "Cruz earlier this year endorsed Eric Schmitt, the state's attorney general who is using the same campaign consulting firm as Cruz, Axiom Strategies.",
    "Barnette's last-minute momentum likely ate into Oz's lead, leaving him and McCormick in a tight recount more than a week after the election.",
    "Brian Kemp pose for a photo with a supporter after a Get Out the Vote Rally, on the eve of gubernatorial and other primaries in the state.",
    "What Donald Trump has advocated is for us to be the party of me,' that everything has to be about him and about his grievances.'",
    "| Brynn Anderson/AP Photo\nBy Adam Wren and Natalie Allison\n 05/26/2022 04:30 AM EDT\nThey're weary of the incessant conflicts.",
    "We have to be the party of tomorrow, not the party of yesterday, Christie, who campaigned for Kemp in Georgia, told POLITICO.",
    "Kemp won by a landslide and Secretary of State Brad Raffensperger, another target of Trump's ire, also emerged victorious.",
    "Republican and Democratic polling has shown an uncomfortably close general election race if Greitens were on the ballot.",
    "Fuck that, said a national Republican strategist involved in Senate races, who was granted anonymity to speak candidly.",
    "A late surge took him to second place in Tuesday's primary and he will compete against Katie Britt in a June 21 runoff.",
    "Trump has yet to endorse in the primary, but some state and national Republicans fear he might weigh in for Greitens.",
    "Prominent interest groups in the Republican universe also appear to be increasingly comfortable stiff-arming Trump.",
    "An endorsement strategy seemingly driven by a bruised and restless ego, rather than the party's best interests.",
    "But more important than that, what we have to decide is: do we want to be the party of me or the party of us?",
    "In politics, there's no reward for leaning back  most are making the decision to lean in and try and win.",
    "Greitens resigned from office mid-term in 2018 amid a criminal case and allegations of sexual assault.",
    "Chris Sununu openly mocked him in front of a Washington dinner audience, joking about Trump's sanity.",
    "With an Aug. 2 primary, Missouri's safe GOP Senate seat could become more competitive if former Gov.",
    "And on the vast majority, President Trump and I have agreed and we've endorsed the same candidates.",
    "Paul, who, like Cruz, backed Brooks in the Alabama Senate primary, also reiterated his support.",
    "In Pennsylvania, he threw his support behind Mehmet Oz just over a month before the election.",
    "Former President George W. Bush, former Vice President Mike Pence, and former New Jersey Gov.",
    "Bold-face Republican names have never been so comfortable crossing Trump as in recent weeks.",
    "They acknowledge the former president's endorsement in primary contests remains influential.",
    "Listen, Donald Trump has made a lot of endorsements across the country, Cruz told reporters.",
    "Chris Christie were among those lending aid and comfort to one of Trump's top enemies, Gov.",
    "Mike Pompeo didn't do it here, so he's against me, and Ted Cruz didn't do it here.'",
    "The result was a thrashing at the polls for several Trump-endorsed candidates.",
    "Weeks later in Pennsylvania, the Club defied the former president once again.",
    "Brooks' campaign, it turns out, wasn't finished when Trump pulled the plug.",
    "Few in the party doubt that Trump still maintains an iron grip on his base.",
    "You have a decision to make, whether you want to lean in or lean back.",
    "Greitens, though, has long remained at or near the front of the pack.",
    "Christie didn't tiptoe around some of Trump's endorsement missteps.",
    "Eric Greitens becomes their nominee, party leaders have warned.",
    "The inability to get past the 2020 election results.",
    "Is President Trump going to endorse Eric Greitens?",
    "Former Vice President Mike Pence and Georgia Gov.",
    "When he's wrong, Christie said, he's wrong.",
    "Everyone's got to make their own choices.",
    "In Ohio, for example, Trump endorsed J.D.",
    "Vance two weeks before the May 3 primary.",
    "Brian Kemp, in Georgia's Tuesday primary.",
    "Christie added: Trump picked this fight.",
    "A lot of them have won, not all of them.",
    "Sometimes we haven't.",
    "New Hampshire Gov.",
    "Keller asked.",
    "Sens."
  ]
}