{
  "id": 8911,
  "mediaId": 136,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Trump Pushes Claim That Brian Kemp's 50-Point Victory Was Fraud",
  "image": "https://d.newsweek.com/en/full/2048825/donald-trumps-speaks-georgia.webp?w=790&f=83181544499a433c0f8462240d20a482",
  "link": "https://www.newsweek.com/donald-trump-pushes-claim-brian-kemp-victory-fraud-georgia-governor-1711793",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Jackson",
  "authorUrl": "https://www.newsweek.com/authors/jon-jackson",
  "termIds": [
    1147,
    1404,
    1434,
    2095,
    3103,
    4325,
    4330,
    101,
    6313,
    2945
  ],
  "sentences": [
    "Former President Donald Trump's \"Save America\" political action committee (PAC) on Tuesday sent an email to subscribers that linked to an article that claims Governor Brian Kemp's victory in last week's Republican gubernatorial primary was the result of voter fraud.",
    "Kemp was once a Trump ally, but the former president has since publicly bashed him multiple times after the governor refused to contest the 2020 presidential election results in Georgia, where Trump has falsely claimed there was voter fraud.",
    "On Tuesday, Trump seemingly questioned the results of last week's primary by including a link in his PAC's email to an article by conservative writer Emerald Robinson entitled \"Something Stinks in Georgia.\"",
    "In her story on Georgia's primary, Robinson cited polling aggregation from RealClearPolitics as showing the margin between Kemp and Perdue leading up to the primary was not as great as it turned out to be.",
    "Robinson was once a White House correspondent for Newsmax, but she was removed by the outlet last year after she posted a conspiracy theory about COVID-19 vaccines on Twitter.",
    "Newsmax announced in January that her contract was not being renewed, and she has since been hired by Lindell-TV, the online network founded by MyPillow CEO Mike Lindell.",
    "She said the former president's record of picking winners with his endorsements was part of what makes Georgia's primary results \"so curious and so suspect.\"",
    "His vote total was more than 50 percentage points higher than the count for David Perdue, a former U.S. senator who was endorsed by Trump.",
    "Kemp, the incumbent, scored a lopsided win in the primary with approximately 74 percent of the vote, according to the Associated Press.",
    "Meanwhile, former Vice President Mike Pence appeared at a Georgia rally for Kemp the day before the May 24 primary.",
    "However, RealClearPolitics' polling averages still found Kemp had a lead over the other candidates in the race.",
    "Perdue also said that he was supporting Kemp in November's election against Democrat Stacey Abrams.",
    "Instead, he announced during a concession speech that he had called Kemp and congratulated him.",
    "Robinson also wrote that Trump's endorsement helped secure primary victories for J.D.",
    "No credible evidence has been presented of widespread fraud in the May 24 primary.",
    "Obvious fraud,\" Robinson wrote in the article shared on her Substack page.",
    "Trump endorsed Perdue in December 2021 and campaigned on his behalf.",
    "For his part, Perdue has not objected to the results of the primary.",
    "\"On Primary Day in Georgia, Kemp gets 74% and Perdue gets 22%.",
    "Nobody in any election in America gets 74% of the votes.",
    "Vance in Ohio and for Ted Budd in North Carolina.",
    "Newsweek reached out to Trump for comment.",
    "It doesn't happen.",
    "Ever."
  ]
}