{
  "id": 8915,
  "mediaId": 19,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Exclusive  National Pro-Life Group Endorses J.D. Vance: He Has What It Takes' to Defeat Abortion Extremist Tim Ryan",
  "image": "https://media.breitbart.com/media/2022/05/GettyImages-1240356668-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/05/31/exclusive-national-pro-life-group-endorses-j-d-vance-he-has-what-it-takes-to-defeat-abortion-extremist-tim-ryan/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    3103
  ],
  "sentences": [
    "The vast majority of Americans REJECT his extremism:\n 65% support restrictions in 2nd trimester\n 80% support restrictions in 3rd trimester pic.twitter.com/sPFlXRg0FP\n Susan B. Anthony List #ModernizeOurLaw (@SBAList) May 5, 2022\nRyan refuses to name a single protection for unborn children he supports, claiming it's just too complex to figure out, Dannefelser said.",
    "Ryan was pressed by Fox News's Bret Baier on if he supported any limits to abortion at any point, and Ryan replied, Look, you gotta leave it up to the woman, and indicated he could not account for all of the different scenarios that a woman dealing with the complexities of a pregnancy are going through.",
    "The group praised Vance in a statement Tuesday for being a voice for the pro-life movement and blasted Ryan, who converted from a pro-life Democrat to pro-abortion in the midst of his 20-year tenure in Congress.",
    "Ryan, who used to break with his party to advocate for the unborn before he flip-flopped on the issue in 2015, recently made headlines for refusing to support any restrictions on abortion.",
    "Vance is a courageous and thoughtful pro-life advocate who has what it takes to defeat extremist Tim Ryan, Marjorie Dannenfelser, president of the SBA List's Candidate Fund, said.",
    "Vance, the Hillbilly Elegy author who won the Republican nomination for Senate this month, once said abortion was the first political issue he could ever remember caring about.",
    "I am honored to have their support and will continue to fight for our shared beliefs and efforts protecting the unborn, innocents and all life when I get to the U.S. Senate.",
    "At a townhall event during his Senate primary race, Vance criticized one of his opponents for describing himself as pro-people rather than pro-life.",
    "Vance knows the real-world struggles of hardworking families as well as the threats to innocent life coming from Washington, Dannenfelser continued.",
    "will bring creativity and common sense to the Senate and stand up to Biden and Schumer so every child has the chance to live the American dream.",
    "https://t.co/8FyiwZja8K\nIn response to the SBA List's endorsement, Vance affirmed he would vouch for the unborn if elected.",
    "Ohio Senate candidate @TimRyan couldn't tell @BretBaier a SINGLE restriction on abortion he would support.",
    "The Susan B. Anthony (SBA) List is weighing in on the Ohio Senate election and backing Republican J.D.",
    "If you're not willing to stand up to the left on abortion, you can't be trusted on anything else.",
    "SBA List has advocated for life and ending abortion in America for many years, Vance said.",
    "The pro-life position is the pro-people position and I'm proud to be 100% pro-life.",
    "Today's Democrat elites have forgotten their party once fought for the little guy.'",
    "Vance in his race against Democrat Rep. Tim Ryan, Breitbart News has learned.",
    "Vance told the crowd, Ladies and gentleman, pro-life is pro-people.",
    "After two decades in politics, Tim Ryan is no different.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "That's the whole point of our position there.",
    "Follow her on Twitter at @asholiver",
    "J.D.",
    "J.D."
  ]
}