{
  "id": 8980,
  "mediaId": 238,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Democrats aren't counting on Jan. 6 committee hearings to help them with voters",
  "image": "https://newsletter-imgs.s3.amazonaws.com/prod/the-202s/primary/early.svg",
  "link": "https://www.washingtonpost.com/politics/2022/06/06/democrats-arent-counting-jan-6-committee-hearings-help-them-with-voters/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Theodoric Meyer",
  "authorUrl": "https://www.washingtonpost.com/people/theodoric-meyer/",
  "termIds": [
    3102,
    3103
  ],
  "sentences": [
    "In todays edition  The Senate calendar doesn't leave much time for Democrats to get much more big things done ahead of the midterms  What were keeping our eye on  The Summit of the Americas in Los Angeles this week is a test for President Biden as U.S. influence wanes  but first \nThe House Jan. 6 committee this week will hold the first of at least six hearings, where the panel will lay out its findings concerning the attack of the Capitol and what led up to that deadly day.",
    "The limitations of the calendar could pose big problems for Democrats' long list of legislative desires that include gun control legislation, new covid funding and a stripped-down version of the no-longer-a-Build-Back-Better bill that revolves around Sen. Joe Manchin III's (D-W.Va.) priorities of addressing inflation, reducing budget deficits, energy production and prescription drug prices.",
    "Live from the City of Angels: When Biden and senior members of his administration explore the future of the Americas with other regional leaders this week, the United States will face a somewhat unusual experience: focusing on its neighbors to the south, our colleagues Missy Ryan, Cleve R. Wootson Jr., Mary Beth Sheridan and Karen DeYoung report.",
    "Our colleagues Jackie Alemany and Josh Dawsey have a breakdown on what to expect from the hearings, including the testimony of Cassidy Hutchinson, a top aide to then-White House Chief of Staff Mark Meadows, and the possible airing of video recordings of interviews with Trumps daughter Ivanka and her husband, Jared Kushner.",
    "The consultant, who was granted anonymity to detail his private advice to Democrats, said the issue of Jan. 6 can become a critical issue in a campaign if the Republican runs on a platform that the last election was stolen  such as in the case of Doug Mastriano, the Republican nominee for governor in Pennsylvania; J.D.",
    "In a March National Republican Congressional Committee survey of likely voters in 77 battleground House districts provided to The Early, just one percent of voters said investigating the attack is the most important issue on which President Biden and congressional Democrats should focus.",
    "That was hard to imagine in the days following the worst attack on the Capitol since the War of 1812, but its a reality many Democrats said they face despite their fears that threats to democracy remain as Trump continues to spread the election falsehoods that inspired the attack.",
    "We are focused on presenting the American people with the truth about this violent attack on our Democracy and ensuring nothing like it can ever happen again, Rep. Elaine Luria (D-Va.), who is a member of the committee and also in a swing district, said in a recent email.",
    "The Protecting Our Kids Act: A package of eight bills that would raise the legal age to buy some semiautomatic rifles to 21, address gun trafficking, institute gun storage requirements as well as ban high capacity magazines, ghost guns and bump stocks.",
    "Democrats are also hoping a conference committee of House and Senate Republicans and Democrats can iron out the differences over the America Competes Act, the bipartisan bill that addresses some supply chain shortfalls and microchip manufacturing.",
    "A progressive political consultant who has worked with focus groups and pollsters said that campaigning on Jan. 6 is a loser, but he argued the hearings will get attention and voters are paying attention to issues surrounding American democracy.",
    "Since Pelosi's message to her colleagues in that meeting in late April, a draft of a Supreme Court decision overturning Roe v. Wade was leaked and multiple mass shootings have occurred  two other issues that could play into voters' decisions.",
    "That view was articulated at a recent private meeting with House Democrats where Speaker Nancy Pelosi had a clear message for her conference: Voters will not cast their ballots based on Jan. 6 and the events that led up to that deadly day.",
    "The Summit of the Americas scheduled in Los Angeles with leaders of Latin American countries comes as the administration has spent months trying to help Ukraine defend itself against the Russian invasion that began in February.",
    "There is instead a recognition among many Democrats that to avoid defeat in this fall they will need to focus heavily on the type of economic and public safety issues that public opinion polls show concern voters most.",
    "The Biden administration was slow to match the vaccine diplomacy of Russia and China, although it did eventually provide 70 million doses to the hemisphere, per AP News Elliot Spagat, Joshua Goodman and Chris Megerian.",
    "Those recess days are a congressional tradition, especially in election years when members running for reelection want to be home campaigning, talking to constituents, attending ribbon cuttings and, yes, fundraising.",
    "Pelosis remarks, described by multiple Democrats who attended the closed-door meeting, underscored the growing belief in the party that views on the insurrection have hardened along party lines like so many issues.",
    "A small group of Democrats and Republicans are trying to figure out if they can come to an agreement on background check expansion, incentivizing red flag laws in states, school safety and mental health funding.",
    "But Democrats aren't counting on the panel's work and its focus on the attempt by former president Donald Trump and his allies to overturn the 2020 presidential election to help them much with voters this fall.",
    "Recent polling by The Washington Post found a slim majority of voters  52 percent  want former president Donald Trump charged with a crime for the attack on the Capitol, including 56 percent of independents.",
    "While it is the Democratic lawmakers job to serve as protectors of democracy, she told her members, voters will judge the party on the cost of food, gas prices and what the party is doing to help families.",
    "With the Senate back in town first the first time since before Memorial Day, we are watching what Republican senators who are not directly involved in the negotiations say about the gun talks.",
    "Through the summit, U.S. leaders and others from North, Central and South America and the Caribbean are supposed to explore economic relationships and general goals for the Western Hemisphere.",
    "Heres what to expect:\nIts official: The Biden administration has made a final decision against inviting the governments of Cuba, Venezuela and Nicaragua, Bloombergs Eric Martin scooped.",
    "Officials appear to be holding out hope that the Mexican leader, who said he wouldnt show up unless [the three countries] were invited, will be in Los Angeles for the summit.",
    "Each measure will be voted on individually to place Republicans on record on each issue, House Majority Leader Steny H. Hoyer wrote in a letter to his colleagues.",
    "Between now and Election Day, there are just 57 days the Senate is scheduled to be in Washington, but that includes Fridays, when the Senate is rarely in session.",
    "People are very concerned about those involved and who supported those involved on January 6, she said, based on polling she conducted for a consortium of groups.",
    "A bellwether of the summits success will be whether Mexicos leftist president, Andrs Manuel Lpez Obrador, decides to attend, our colleagues write.",
    "Still, Democrats insist the hearings to be held by the Jan. 6 panel, which begin Thursday at 8 p.m., will be critical regardless of the politics.",
    "A resolution by Rep. Jamaal Bowman (D-N.Y.) condemning the great replacement conspiracy theory, which the alleged shooter in Buffalo referenced.",
    "The Federal Extreme Risk Protection Order Act: A bill that incentivizes states to strengthen red flag laws and creates a national red flag law.",
    "Brooks is in a runoff against Katie Britt, a former chief of staff to Sen. Richard C. Shelby (R-Ala.)  and has said Trump was robbed in 2020.",
    "Vance, the Republican nominee for an open Senate seat in Ohio; and Rep. Mo Brooks (R-Ala.), whos running for an open Senate seat in Alabama.",
    "President Biden, meanwhile, is heading to Los Angeles on Wednesday to host the Summit of the Americas meeting with Latin American leaders.",
    "Discussions are expected to cover topics such as democracy, clean energy, politics, migration and recovery from the coronavirus pandemic.",
    "And that means that the number of legislative days between now and Nov. 8 are disappearing faster than a snowball in Washington's heat.",
    "This week will be all about whether Senate negotiators can strike a deal on a legislative response to the recent mass shootings.",
    "Promises made, promises broken: Latin American leaders are expected to scrutinize Bidens track record on covid and immigration.",
    "Biden also maintained the Trump-era restrictions on migration, reinforcing the view that it was neglecting its own neighbors.",
    "Families of victims will testify, including a 10-year-old girl who covered herself with her friend's blood and played dead.",
    "The summit has also been attempting to execute a long-delayed pivot to Asia, where China keeps pressing for more influence.",
    "Democratic pollster Celinda Lake said Jan. 6 could play much more of a role than people imagined in these instances.",
    "The choice is based on concerns about the lack of democracy and respect for human rights in the three countries.",
    "John Cornyn (Texas), Patrick J. Toomey (Pa.) Lindsey O. Graham (S.C.), Susan Collins (Maine), Bill Cassidy (La.)",
    "Republican interest in investigating the attack didn't last long and they turned on the idea early last year.",
    "But she's facing a primary challenge from an opponent backed by former president Donald Trump on Aug. 16.",
    "But It's hard to think of four or five more Republicans who would be inclined to get on board.",
    "On Wednesday, the House Oversight and Reform Committee will hold a hearing on Uvalde.",
    "He'll also tape an episode of Jimmy Kimmel Live that will air Wednesday evening.",
    "The investigation has never been about politics, and neither will the hearings.",
    "Mitt Romney (R-Utah), Rob Portman (R-Ohio), who have expressed openness.",
    "Sen. Marco Rubio (R-Fla.) has co-sponsored red flag laws in the past.",
    "Our out-of-the-box person to watch is Sen. Jerry Moran (R-Kan.).",
    "World War II's Operation Overlord began 78 years ago today.",
    "The Republicans involved in the negotiations are: Sens.",
    "Any agreement will almost certainly need 10 GOP votes.",
    "They now argue that Jan. 6 isnt an issue for voters.",
    "It's (unofficially) the summer of an election year.",
    "He's up for reelection and his primary has passed.",
    "Our colleague Mike DeBonis has more on that here.",
    "Maybe Sen. Lisa Murkowski (R-Alaska)?",
    "Take out Fridays and that's 44 days.",
    "It's an election year for him, too.",
    "Or Sen. Todd C. Young (R-Ind.)?",
    "Tips: earlytips@washpost.com.",
    "Thanks for waking up with us.",
    "Good morning, Early Birds.",
    "and Thom Tillis (N.C.).",
    "Will he, or wont he?",
    "Perhaps Sens.",
    "Early reeeads"
  ]
}