{
  "id": 9095,
  "mediaId": 136,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Being J.D. Vance: Few Understand Better How the Left Lost Rural America",
  "image": "https://d.newsweek.com/en/full/2052229/jd-vance-campaign-rally.webp?w=790&f=f248a165ce4f57529a840f7683250bbd",
  "link": "https://www.newsweek.com/being-jd-vance-few-understand-better-how-left-lost-rural-america-1713178",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lee Habeeb",
  "authorUrl": "https://www.newsweek.com/authors/lee-habeeb-0",
  "termIds": [
    3103
  ],
  "sentences": [
    "So he did what few people do in the prime of their investing careers do: He moved with his wife (Usha is the daughter of an immigrant from India whom he met at Yale) and children to Cincinnati to work on closing geographical gaps regarding access to venture capital.",
    "And not because they were racists but because Trump dared to challenge the U.S. Chamber of Commerce, which loves cheap labor, and the Democratic Party, which cared more about building a voting block than attending to the needs of struggling Ohioans.",
    "They cling to guns or religion or antipathy toward people who aren't like them or anti-immigrant sentiment or anti-trade sentiment as a way to explain their frustrations,\" he told donors at a San Francisco fundraiser.",
    "\"Howard noted that he was 'surprised by some of the positions [Vance has] taken and statements he's made' after working with him on the film,\" The Hollywood Reporter noted.",
    "I wrote this book because I've achieved something quite ordinary, which doesn't happen to most kids who grow up like me,\" Vance wrote in the prologue to Hillbilly Elegy.",
    "\"I love family stories, but I've never had one before that was a true story that dealt with characters from rural America, and that's my family's background,\" he said.",
    "When Trump challenged America's trade policiesespecially the way China used unfair trade practices to eviscerate the American steel industrythey loved him for it.",
    "Talking about the unemployed miners of Appalachia, he said this: \"Anybody who can go down 3,000 feet in a mine can sure as hell learn to program as well.",
    "After Yale, Vance moved to San Francisco to become a principal at a Silicon Valley venture capital fund run by billionaire tech investor Peter Thiel.",
    "After a detour at Yale, Silicon Valley and some Washington, D.C., think tankswhere he was praised for his literary insightshe came home again.",
    "\"You see, I grew up poor, in the Rust Belt, in an Ohio steel town that has been hemorrhaging jobs and hope for as long as I can remember.\"",
    "Born in a part of Ohio ravaged by a shuttered steel plant, unemployment, drugs and family breakdown, Vance was asked to introduce himself.",
    "Ohioans also loved Trump because he put their interests ahead of the United Nations, the World Health Organization and the Davos crowd.",
    "\"They were actually hillbilly royalty because my papa was related to the guy who started the Hatfield and McCoy feud,\" Vance said.",
    "Bill Gates blogged about the book's \"new insights into the multifaceted cultural and family dynamics that contribute to poverty.\"",
    "\"You know, to just be grossly generalistic, you could put half of Trump's supporters into what I call the basket of deplorables.",
    "In an early scene in Howard's film, Vance is sitting at a table with some law firm hiring partners visiting Yale Law School.",
    "\"Instead, I identify with the millions of working-class white Americans of Scots-Irish descent who have no college degree.\"",
    "He learned that rural Ohioans voted for Trump not because he was wealthy or famous but because he was fighting for them.",
    "America would soon know him as Opie, son of a sheriff in a fictional rural North Carolina town on TV called Mayberry.",
    "Hillbilly Elegy caught the attention of director Ron Howard, the man responsible for Apollo 13 and A Beautiful Mind.",
    "Like his fellow Ohioans, Vance came to understand not merely Trump's visceral appeal but his appeal on the merits.",
    "They have a problem with rural Ohioans who support himand the rural Americans who supported President Trump too.",
    "That scene spoke volumes about the chasm between the elites at the table and the friends and family Vance loved.",
    "\"No, my grandfather went north and worked in a steel plant, like a lot of people in Appalachia did,\" he replied.",
    "\"I was taken aback by the demeaning remarks Senator Obama made about people in small-town America,\" she said.",
    "They fly American flags in front of their houses, celebrate July Fourth and honor their dead on Memorial Day.",
    "Moreover, workers in those industries know American oil, natural gas and coal are the cleanest in the world.",
    "New York Times columnist David Brooks described the book as \"essential reading for this moment in history.\"",
    "It turns out President Barack Obama won Ohio by 4.6 percent in 2008, winning 22 of the state's 88 counties.",
    "A New York Times reviewer called his bestseller a \"civilized reference guide for an uncivilized election.\"",
    "The truth is, the Democratic Party and Republican elitesand Ron Howard toodon't have a problem with Vance.",
    "It started in 2008 when Senator Obama said something he really believed about rural and Rust Belt voters.",
    "If we don't export it, countries like Iran and Venezuela, which make dirtier energy, will export theirs.",
    "Democratic nominee Clinton abandoned her earlier critique of Obama and doubled down on his rhetoric.",
    "Brooks, the elites in the GOP and almost all of the Democratic Partyand their media enablersdid too.",
    "When Trump made illegal immigration a central part of his campaign, Ohioans loved him for that too.",
    "He ended his prologue with these words: \"Americans call them hillbillies, rednecks or white trash.",
    "He was a favorite of the elites in both parties thanks to his bestselling memoir, Hillbilly Elegy.",
    "I want people to know what it feels like to nearly give up on yourself and why you might do it.\"",
    "He talked about his life and his service in the Marine Corps, which included a tour in Iraq.",
    "Former President Donald Trump's endorsement of his Senate primary bid in Ohio changed that.",
    "He emerged not merely unscathed but more focused and dedicated to the plight of his people.",
    "Twelve years later, President Donald Trump won the state by 8 points, winning 81 counties.",
    "A look at elections in Ohio over the past 20 yearsand rural Americaprovides some insights.",
    "Vance tried some human interest to ease the discomfort of his dining partnersand his own.",
    "\"Whatever talents I have I almost squandered until a handful of loving people rescued me.",
    "Howard, who spent his early years in rural Oklahoma, moved to Los Angeles when he was 4.",
    "Three years later, Vice President Biden had his own moment at a rally in New Hampshire.",
    "They also know that when America drills, mines and fracks more, energy prices decline.",
    "Energy jobs are a lifeline to the middle class for Americans without college degrees.",
    "Anybody who can throw coal into a furnace can learn how to program, for God's sake!\"",
    "It was also the first election since 1976 in which Ohio voted to the right of Texas.",
    "Long before the appearance of Trump, the Democratic Party was losing rural voters.",
    "\"I may be white, but I do not identify with the WASPs of the Northeast,\" he wrote.",
    "In a New York minute, Senator Hillary Clinton, deep in a primary battle, pounced.",
    "Howard's movie version of Vance's book was released by Netflix in November 2020.",
    "When Trump challenged the climate change crowd, Ohioans loved him for that too.",
    "Vance, the elites were busier than a one-legged man in a butt-kicking contest.",
    "That number plunged in 2020 to 194 rural counties for Bidena mere 10 percent.",
    "\"I didn't write this book because I've accomplished something extraordinary.",
    "But Vance quickly came to understand Trump's appeal to voters in his state.",
    "No demographic in the nation serves its country in uniform at higher rates.",
    "\"You must feel like you're from another planet,\" a hiring partner joked.",
    "President Clinton won 1,117 rural counties in 1996, 50 percent of them.",
    "He was an early critic of Trump, as many in the Republican Party were.",
    "\"The racist, sexist, homophobic, xenophobic, Islamophobicyou name it.",
    "He entered the political arena to fight for them in the U.S. Senate.",
    "Fast-forward to an LGBT gala in New York City in the fall of 2016.",
    "And few benefit more from low energy prices than rural Americans.",
    "The messaging of the Democratic Party's stars didn't help.",
    "But the problem with the Democratic Party isn't messaging.",
    "Elite pundits reduced these moments to messaging gaffes.",
    "Or the elites, as well as most of the Democratic Party?",
    "By May 2022, he was singing from a different songbook.",
    "The fact is, Vance didn't change: He came full circle.",
    "And the understanding that can come when one does it.",
    "But a burning question lingered: Had Vance changed?",
    "And willing to do more than just write about them.",
    "The audience broke into laughter, then applause.",
    "\"We don't use that term,\" Vance replied coldly.",
    "Clinton continued with her gross generalities.",
    "And unfortunately there are people like that.",
    "In 2008, Barack Obama won 455, or 25 percent.",
    "\"I guess, like: Who are all those rednecks?\"",
    "Finally, rural Americans love their country.",
    "I call them neighbors, friends and family.\"",
    "He had left Ohio, but Ohio hadn't left him.",
    "\"His remarks are elitist and out of touch.\"",
    "\"It's not surprising that they get bitter.",
    "It wasn't just Howard who turned on Vance.",
    "Vance added a bit of his ethnic history.",
    "And on the issues Ohioans cared about.",
    "But the tug of home kept calling him.",
    "That's not a decline; it's an exodus.",
    "And he has lifted them up,\" she said.",
    "President Joe Biden won only seven.",
    "That is the real story of my life.",
    "The dinner quickly headed south.",
    "\"Yeah, I guess,\" replied Vance.",
    "So does Vance's book and life.",
    "There was an awkward silence.",
    "\"Is your family coal miners?\"",
    "the partner said, laughing.",
    "Vance wasn't finished.",
    "Until he wasn't.",
    "Turning on J.D.",
    "a lawyer asked.",
    "It's listening.",
    "What caused it?",
    "Right?\""
  ]
}