{
  "id": 9097,
  "mediaId": 157,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Trump ignites a fury from his MAGA base after endorsing Kevin McCarthy for re-election",
  "image": "https://www.rawstory.com/media-library/kevin-mccarthy-and-donald-trump.jpg?id=26151899&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/trump-ignites-a-fury-from-his-maga-base-after-endorsing-kevin-mccarthy-for-re-election/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.rawstory.com/u/jonskolnik",
  "termIds": [
    3103
  ],
  "sentences": [
    "\"Trump endorsing Frank Luntz bunk buddy Kevin McCarthy, instead of using his political capital to undermine bad GOP leadership, is a sign that Trump has not learned much after all this time about who is and is not America First,\" tweeted right-wing writer Pedro L. Gonzalez.",
    "Donald Trump threw his weight behind House Minority Leader Kevin McCarthy, R-Calif., on Saturday, calling the Republican lawmaker \"strong and fearless\" ahead of McCarthy's potential re-election.",
    "He is working incredibly hard to Stop Inflation, Deliver Water Solutions, and Hold Joe Biden and Nancy Pelosi Accountable for their catastrophic failures and dereliction of duty,\" Trump wrote.",
    "Shortly after a recording of that call was leaked, the former president expressed that he \"didn't like the call\" but ultimately dismissed it because McCarthy had apparently been loyal enough.",
    "Conservative radio host Leo Terrell casted strong doubt over McCarthy's true allegiances, claiming that the representative \"does not want President Trump to win re-election in 2024.\"",
    "Trump's endorsement came in a social media post over Truth Social, in which the former president said that McCarthy is an \"outstanding representative for the people of California.\"",
    "\"The only discussion I would have with him is that I think this will pass, and it would be my recommendation you should resign,\" he told a group of GOP lawmakers over the phone.",
    "Trump's imprimatur reportedly sparked ire from much of his base, in large part because McCarthy has not expressed total devotion to the former president in the past.",
    "Back in January 2021, just after the Capitol riot, the House Republican was reportedly considering asking Trump to resign, according to The New York Times.",
    "Back in April, Trump ignited a fury in the MAGA-verse after backing celebrity doctor Mehmet Oz in the U.S. Senate race in Pennsylvania.",
    "It isn't the first time that one of Trump's endorsements has been castigated by his own base, as Newsweek noted.",
    "\"In Congress, Kevin is a tireless advocate for the people of Bakersfield and the Central Valley.",
    "Vance, the conservative author and venture capitalist, for the U.S. Senate in Ohio.",
    "\"I think it's all a big compliment, frankly,\" Trump told The Wall Street Journal.",
    "The former president also struck a nerve for endorsing J.D.",
    "\"Kevin McCarthy has my Complete and Total Endorsement.\"",
    "Nobody can defend that and nobody should defend it.\"",
    "\"They realized they were wrong and supported me.\"",
    "\"What he did is unacceptable."
  ]
}