{
  "id": 9105,
  "mediaId": 195,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "Democrats weigh chances in Ohio Senate race",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/ryantim_042822gn_lead.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3511397-democrats-weigh-chances-in-ohio-senate-race/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    3103
  ],
  "sentences": [
    "Justin Barasky, who managed Browns 2018 election campaign and is advising Ryan on his Senate bid, dismissed the notion that national Democrats werent taking the Senate race seriously, saying theres more to the political dynamics in Ohio than the results of the last two presidential elections.",
    "Mike Hartley, a Columbus-based Republican consultant, waved off the idea that Vance is entering the general election damaged by a tough primary campaign, saying that the Hillbilly Elegy author stands to benefit from the coalition of voters that rallied behind Trump in both 2016 and 2020.",
    "Republicans, however, argue that Ohios political realignment toward the GOP in recent years, combined with rising inflation, a spike in crime and widespread malaise with Biden and the Democratic-controlled Congress, may prove too difficult for Democrats to overcome in November.",
    "And unlike Vance, who faced a long and bitter primary fight against several other Republicans, Ryan largely coasted to the Democratic nomination with only nominal opposition, effectively giving him a head start on his general election campaign.",
    "The party is defending vulnerable incumbents in Arizona, Georgia, New Hampshire and Nevada, and is also looking to flip Republican-held Senate seats in states like Pennsylvania and Wisconsin, both of which broke for Biden in the 2020 election.",
    "Ryan, a 10-term congressman who sought the Democratic presidential nod in 2020 only to suspend his campaign before the Iowa caucuses, clinched his partys Senate nomination last month by a staggering 52-point margin.",
    "Aaron Pickrell, a Democratic strategist and former top adviser to Obamas winning campaigns in Ohio, said that it would be a mistake for national Democrats to write the Ohio Senate race off as a foregone conclusion.",
    "Hes been a fundraising superstar, hes got exactly the right message, hes not falling prey to some of the partisan fights that go on in Washington and hes been relentlessly focused on fighting for workers.",
    "In 2016 and 2020, voters saw Trump as an authentic candidate, for better or worse, he said, adding that Ryans own message, while different from Trumps, carries a similar resonance among Ohio voters.",
    "In a new campaign ad released on Friday, Ryan boasted that he agreed with Trump on trade and voted against outsourcing every single time, while Vance made millions profiting from globalization.",
    "When Priorities USA, the largest Democratic super PAC, announced an initial $30 million digital advertising investment in January, Ohio wasnt among the seven states on the groups target list.",
    "Ryan has cast himself as an economic populist focused on reviving his states struggling manufacturing sector, cutting taxes for the middle class and countering Chinas economic rise.",
    "Likewise, Ohio was left out of a $106 million investment on ad reservations by Senate Majority PAC (SMP), a super PAC aligned with Senate Majority Leader Chuck Schumer (D-N.Y.).",
    "At the same time, the nation is grappling with the highest inflation in decades and rapidly rising gas prices that have put a financial squeeze on millions of Americans.",
    "Trump carried the state twice, in 2016 and 2020, and aside from former President Obama and Sen. Sherrod Brown (D-Ohio), no Democrat has won statewide in Ohio since 2006.",
    "Ohios not South Carolina, Barasky said, referring to two red states that Democrats spent heavily on in 2020 only to see their candidates lose by double-digit margins.",
    "Theres this self-fulfilling prophecy: were not going to win in Ohio because we didnt invest in Ohio and we didnt invest in Ohio because were not going to win Ohio.",
    "If the national Republicans are in 100 percent and the national Democrats are in 20 percent, that obviously makes it a really challenging ordeal, Pickrell said.",
    "As of April 13, he had nearly $5.2 million in his campaign coffers, while Vance had less than $700,000, according to their most recent federal filings.",
    "Democrats are fighting to hold onto their paper-thin Senate majority in a midterm election year that is already proving to be difficult for the party.",
    "If this race remains as close as it is now, and I have no reason to think that it wont be, national Democrats are going to continue to spend here.",
    "If Im advising Republican candidates right now, I would tell them to go on vacation for two or three months, one Ohio Republican strategist said.",
    "A Suffolk University/USA Today Network poll released this week found him and his Trump-endorsed rival statistically deadlocked in the race.",
    "Ryan has also taken an interesting tack toward Trump, siding with him on issues like free trade and echoing his tough-on-China rhetoric.",
    "The Democratic Senatorial Campaign Committee (DSCC) included it in an initial $30 million field organizing program announced last year.",
    "His allies are quick to dispute the notion that Ohios rightward shift in recent years has put it out of reach for Democrats.",
    "Ohio has a history of voting for a pro blue-collar working family oriented Senate candidate for the last couple of decades.",
    "Its center-right, but its still a very competitive state for Democrats who have the right message and run a good campaign.",
    "But Ryan is running in a very different political environment than Brown did in 2018, the last time he was on the ballot.",
    "Beyond anything else, beyond what the suburban voters were in the Republican coalition, they vote straight party ticket.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Theres also the historical maxim that the party in power almost always loses political ground in midterm elections.",
    "Ryan has the Sherrod Brown shot, David Niven, a political science professor at the University of Cincinnati, said.",
    "Democrats are grappling with a major strategic decision: how aggressively to pursue the open Senate seat in Ohio.",
    "Rob Portman (R-Ohio), is a prolific fundraiser with an adept ability to appeal to the states blue-collar voters.",
    "The Trump coalition  they vote straight party, Mike Hartley, a Columbus-based Republican consultant, said.",
    "But so far, other Democratic power players are taking a wait-and-see approach to the Senate race in Ohio.",
    "Democrats see him as a candidate in the same mold as Brown, the last Ohio Democrat to win statewide.",
    "One of the biggest questions for national Democrats is how much to invest in the Ohio Senate race.",
    "Vance, the author and venture capitalist who carries the endorsement of former President Trump.",
    "And Ryan has to do what Sherrod Brown has done in a year where the tide is running against it.",
    "Barasky said that the most important factor in the Senate race is candidate authenticity.",
    "If a Republican loses in Ohio this year, its their own damn fault, the strategist added.",
    "Im just not so sure its a swing state anymore, one national Democratic strategist said.",
    "Do no harm right now, just get the hell out of the way because the wave is coming.",
    "The two problems that Ryan faces in that equation: one is hes not Sherrod Brown.",
    "But Democrats are also acutely aware of Ohios rightward shift in recent years.",
    "President Bidens approval rating is deep underwater both nationally and Ohio.",
    "Recent polling shows him virtually deadlocked with his Republican rival J.D.",
    "On one hand, party leaders and strategists say theres reason to be hopeful.",
    "He doesnt have the statewide recognition of Sherrod Brown, Niven continued.",
    "And the other is Browns victories have all come in strong Democratic years.",
    "But when you take a look at where to put resources, Ohio is a tough call.",
    "Indeed, Ryan appears to be in a formidable position to take on Vance.",
    "I think the Republican coalition will circle the wagons, he added.",
    "Ohio hasnt been left out from early national spending entirely.",
    "Rep. Tim Ryan (D-Ohio), their nominee to succeed retiring Sen.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "And thats what youre going to see in all these races.",
    "This is not a red state by any means, Barasky said.",
    "Ryan also has a significant cash advantage.",
    "Thats the message  control the Senate.",
    "Tim Ryan is a solid, solid candidate.",
    "Its not a lost cause, by any means.",
    "Its not a blue state either.",
    "Ohios not a reach state.",
    "Ohios not Kentucky."
  ]
}