{
  "id": 9106,
  "mediaId": 157,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "White Christian nationalism is at the heart of 'the most radical fringe groups' working hand in hand with some GOPers: researchers",
  "image": "https://www.rawstory.com/media-library/marjorie-taylor-greene.jpg?id=29936866&width=1200&coordinates=0%2C32%2C0%2C52&height=600",
  "link": "https://www.rawstory.com/w-2657457851/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    3103
  ],
  "sentences": [
    "You can see Marjorie Taylor Greene's comments below:\n\\u201cMarjorie Taylor Greene has leaned fully into nationalism:\\n\\n\\u201cNationalism is a good thing.\\u201d\\n\\n\\u201cWe should be proud of an America First nationalism.\\u201d\\n\\n\\u201cChristian nationalism\\u201d is not \\u201csomething to be scared of.\\u201d\\u201d\n PatriotTakes \\ud83c\\uddfa\\ud83c\\uddf8 (@PatriotTakes \\ud83c\\uddfa\\ud83c\\uddf8) 1654256483",
    "\"I think because it identifies one of the deepest and most powerful currents in American political culture, one that has been invisible to most folks outside of that culture and even, in a way, to a lot of people inside of that culture because its the water they swim in and the air they breathe,\" Gorski explained with his co-author noting the connection to former president Donald Trump.",
    "In an interview with Intelligencer, sociologists Samuel L. Perry of the University of Oklahoma and Philip S. Gorski of Yale University, issued a warning that the belief is at the heart of \"some of the most radical fringe groups\" in the U.S. which are finding support from a smattering of elected Republican lawmakers and some hoping to be on the ballot in November.",
    "Hot on the heels of Rep. Marjorie Taylor Greene posting an extended video praising Christian nationalism (which can be seen below) and promising it is not something to be scared of,\" two researchers whose book \"The Flag and the Cross\" is just about to be published, disputed her claim and said the movement is highly dangerous and a \"threat to democracy.\"",
    "What weve tried to do is to steer away from that white Evangelical conversation to talk about the underlying ideology called white Christian nationalism that drives that support for Trumpism, his brand of politics, and all these other authoritarian and anti-democratic things.\"",
    "Asked who is pushing the belief that the authors wrote is entangled with the holy trinity of racial order, Christian freedom, and male violence, Perry immediately pointed to Donald Trump and those in his orbit.",
    "Speaking with Sarah Jones, the two academics explained that it is important that the term \"white Christian nationalism\" be used to put a name on the threat to get the attention of the public.",
    "Since Trump came into office, the narrative was constantly about white Evangelicals, white Evangelicals, white Evangelicals, and why they stick with Trump.",
    "The authors note that the movement has a view of history that is unsupported as they try to turn the U.S. into the country they believe it once was.",
    "\"If youre a white Christian, it doesnt matter when you showed up in the United States; you have a kind of a birthright,\" Gorski stated.",
    "But its also combined with a worship of gun culture, a worship of capitalism as opposed to woke leftists or a socialist agenda.\"",
    "As Perry explained, \"I think 'Christian right' is shorthand for people who hold the ideology that were talking about.",
    "\"I think anybody who subscribes to Trumpism and ultimately the political figures who advocate for it,\" he explained.",
    "I mean, sometimes you get it couched in vague language about returning to God.",
    "Anything that appeals to white Christian ethno-culture  not Christianity.",
    "\"You see this in Marjorie Taylor Greene; you see this in Wendy Rogers.",
    "Vance more and more.",
    "Elise Stefanik.",
    "Josh Mandel.",
    "I think J.D."
  ]
}