{
  "id": 9147,
  "mediaId": 2512,
  "date": "2022-03-24",
  "headline": "Political reporter explains how the Ohio GOP Senate primary is soaring to such 'stupid' heights",
  "image": "https://www.alternet.org/media-library/image.jpg?id=25551270&width=1200&coordinates=0%2C40%2C0%2C40&height=600",
  "link": "https://www.alternet.org/2022/03/ohio-senate-gop-candidates/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meaghan Ellis",
  "authorUrl": "https://www.alternet.org/author/meaghanellis",
  "termIds": [
    5581,
    2290,
    2684,
    2765,
    4306,
    4345,
    1126,
    1489,
    976,
    6474
  ],
  "sentences": [
    "Mike Gibbons and Josh Mandel get in each other\\u2019s faces at tonight\\u2019s GOP #OHSen forum hosted by FreedomWorks.\\n\\n\\u201cYou watch what happens,\\u201d Mandel says.pic.twitter.com/fQuqfHxXHT\n— Heartland Signal (@Heartland Signal) 1647644328\nAccording to Suebsaeng, the candidates' actions, as well as the overall intraparty fighting, have raised concerns for many leaders in TrumpWorld.",
    "\"The scene of two grown men on the debate stage yelling in the other’s face attracted the cringes and bad reviews of an array of Trumpworld and conservative luminaries, including Steve Bannon, a former top Trump adviser who is no stranger to fits of trash-talk,\" Suebsaeng wrote.",
    "The Beast reports: \"Two others familiar with his reaction to the near-brawl said Trump privately bashed the 2022 Ohio GOP frontrunners Josh Mandel and Mike Gibbons for—in Trump’s characterization—'acting like idiots,' following their public confrontation.\"",
    "With midterm elections right around the corner, Republican candidates in Ohio appear to be getting antsier as they continue their fight for former President Donald Trump's endorsement.",
    "According to The Daily Beast's Asawin Suebsaeng, an inside source has shared details about a recent altercation between top Ohio Republican candidates Josh Mandel and Mike Gibbons.",
    "However, Suebsaeng noted that the former president \"absolutely loved the four-way fight for his favor, relishing the lengths to which Mandel, Gibbons, J.D.",
    "\"Three longtime GOP operatives working on this Ohio race each independently described the debate footage as a “shitshow,” when asked by The Daily Beast.\"",
    "In fact, two Senate Republican candidates have gotten so anxious about the upcoming election that they almost ended up in a physical altercation.",
    "The candidates' exchange took a turn for the worse when Gibbons claimed Mandel \"didn’t know 'squat' about working in the private sector.",
    "Addressing the incident that occurred on Friday, Timken said, \"I would like to address the embarrassment of Friday evening.",
    "The disturbing scuffle, which took place on Friday, March 18, was reportedly so bizarre even Trump was \"baffled.\"",
    "Josh Mandel and Mike Gibbons acted like children and if I had been their mother, I’d have grounded them.”",
    "Vance, and Jane Timken have gone to impress him.\""
  ]
}