{
  "id": 9417,
  "mediaId": 2790,
  "date": "2022-03-27",
  "headline": "In Ohio's GOP Senate race, there are Trump wannabees — but no Trump endorsement",
  "image": "https://media.npr.org/assets/img/2022/03/25/gettyimages-1239309726_wide-cea47f23cb1f280d766169df8e0ea0932c0226a7.jpg?s=1400",
  "link": "https://www.npr.org/2022/03/27/1088206020/in-ohios-gop-senate-race-there-are-trump-wannabees-but-no-trump-endorsement",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Don Gonyea",
  "authorUrl": "",
  "termIds": [
    5581,
    5592,
    2684,
    2765,
    2290,
    4905,
    1489,
    1126,
    6067,
    6474
  ],
  "sentences": [
    "Meanwhile, Lisa Phillips says they considered switching their party affiliation to independent, but decided not to because they still believe in what she says are core Republican values — she's anti-abortion, pro-Second Amendment on guns, and wants tough border security.",
    "At a debate this month in suburban Columbus, sponsored by the conservative group FreedomWorks, Mandel said the GOP must choose a path between pro-China RINOs (Republicans in name only) \"like Liz Cheney, Adam Kinzinger, Mitt Romney,\" or fighters like Trump.",
    "On the topic of Trump and the future of the GOP, McVicker turns the question around, saying, \"I think you'd probably offend a lot of Democrats if you told them that we just need to move beyond Kennedy or Obama.\"",
    "On issue after issue, the candidates put Trump on the side of peace, prosperity, strength and freedom, while President Biden and the Democrats have, according to this viewfinder, made all of these things worse.",
    "He used a moment at a primary debate in Cleveland this week to explain his past comments, saying, \"Look, I mean, all of us say stupid things and I happened to say stupid things very publicly.\"",
    "On Ukraine and the 2020 election\nAt the first debate, when the question was about Ukraine, all blamed Biden for being weak and giving Russian President Vladimir Putin an opening to invade.",
    "Even with polls in the Ohio GOP Senate contest showing Gibbons emerging in the lead, those same surveys also indicate that more than a third of Republican voters are still undecided.",
    "The primary is May 3, but a battle in the courts over a GOP redistricting plan that establishes new legislative and congressional seats is currently being challenged in the courts.",
    "Another, for former state GOP Chair Jane Timken, makes the case by saying, \"There are pretenders in the Senate race — Jane Timken is the real Trump conservative.\"",
    "That lack of a Trump endorsement, though, hasn't stopped individual Republican candidates from selling themselves to voters as the most Trump-like in the race.",
    "Now, it could well be that Trump pulled his support because Brooks' campaign is struggling and the former president doesn't want to be seen as backing a loser.",
    "Deal is keeping track of other endorsements, including one from a favorite of Trump supporters, Georgia Rep. Marjorie Taylor Greene, who recently backed Vance.",
    "Looking to put his mark on the 2022 midterm elections, former President Donald Trump has made dozens of endorsements in congressional contests across the U.S.",
    "At the debate outside Columbus, Mandel started attacking Gibbons right from the start, accusing him of buying up Ohio companies and shipping jobs to China.",
    "Days later, in the Alabama GOP Senate primary, Trump rescinded an endorsement of Rep. Mo Brooks, who has opined that it's time to stop talking about 2020.",
    "Whoever gets the Republican nomination will likely be the favorite in the fall in a state Trump carried easily twice when his name was on the ballot.",
    "It's a state where Trump is popular — he carried Ohio easily both times he ran for president — but so far none of the contenders has gotten his nod.",
    "But the Brooks move also explains why most Ohio candidates kept their hands firmly at their sides when the debate moderator asked the question.",
    "There are several candidates, and if he can't be sure to pick the winner, then it may be better for the Trump brand to stay on the sidelines.",
    "Nose to nose in a candidate forum\nAt times the desire to be one of those \"fighters\" like Trump has led to some tense — if awkward — moments.",
    "She and her husband both voted for Trump twice, but now: \"Where we struggle was with how everything ended with President Trump with Jan. 6.",
    "And there's millionaire investment banker Mike Gibbons, who has far outspent his rivals on advertising, and who leads in the latest polls.",
    "Kathy Deal, who works at a church outside Columbus, says she's a loyal Republican who's still figuring out who deserves her support.",
    "\"What happened over there is very sad,\" he said, \"but ladies and gentlemen, it cannot be said enough: We have got our own problems.\"",
    "But Timken used the moment to make a pitch for civility — and for herself, the only woman among the top candidates in the contest.",
    "Back during the 2016 presidential race, Vance was a strong critic of Trump, calling him \"reprehensible,\" \"noxious\" and an \"idiot.\"",
    "The candidates were asked if it would be better for the Republican Party if the former president moved on from the 2020 election.",
    "As the campaign in Ohio has played out, it seems there is no issue that's been looked at without somehow connecting it to Trump.",
    "\"I'm looking for a man with integrity, who can stand up and speak truth and be responsible, accountable,\" Gordon Phillips said.",
    "\"Josh Mandel and Mike Gibbons acted like children,\" Timken said, \"and if I had been their mother, I would have grounded them.\"",
    "He says mainstream Republicans who go to Washington to continue with business as usual are what the GOP needs to move beyond.",
    "\"You don't know squat,\" he said to Mandel, adding, \"You've never been in the private sector in your entire life.\"",
    "She then added what's long been a tagline for her campaign: \"I'm a mom on a mission to take this country back.\"",
    "What Ohio voters say\nIt seems many Ohio voters are only now starting to pay attention to the Senate contest.",
    "At the second debate, in Cleveland, the moderator raised the topic of Trump's ongoing dominance of the GOP.",
    "Vance, author of the best-selling memoir Hillbilly Elegy, which has also been made into a motion picture.",
    "Here are three:\nIn one for former Ohio state Treasurer Josh Mandel, an announcer intones, \"Josh Mandel.",
    "But he has yet to pick a favorite candidate in one hotly contested race: the Ohio GOP Senate primary.",
    "He says he's a loyal Republican, but the Capitol attack on Jan. 6, 2021, was a turning point for him.",
    "\"In Ohio, we have very secure elections,\" said Dolan, who's not vied for the primary's Trump lane.",
    "No other candidate was willing to go there, to most certainly anger Trump with such a statement.",
    "But as the debate continued, Mandel kept returning to the topic, before Gibbons had had enough.",
    "He says he voted for Trump in 2020 and now calls Trump \"the greatest president in my lifetime.\"",
    "His ads highlight his business background: \"Trump and Gibbons are businessmen with a backbone.",
    "Days later, at the Cleveland debate, both candidates were asked about the previous clash.",
    "Mandel leapt out of his chair and got nose to nose, chest to chest with Gibbons.",
    "Dolan supporters Gordon and Lisa Phillips were at the suburban Columbus debate.",
    "But in this campaign, Vance has expressed his admiration and support for Trump.",
    "Don't tell me I haven't worked,\" Mandel shouted, as the two men bumped chests.",
    "And then the whole idea of the election being stolen, we don't buy into that.",
    "But Mandel also casts his primary opponents as being \"squishy\" on the issues.",
    "\"So I would like someone in there fighting for Ohio as hard as she fights.\"",
    "We both think the election was fair, especially after all the recounts.\"",
    "She admits she wishes Trump would weigh in to help her make up her mind.",
    "\"There has been two audits done and it showed there were no problems.\"",
    "Scott McVicker, a manager who works in manufacturing, is more typical.",
    "But Vance stood out from the pack with a more isolationist approach.",
    "After about a minute of this the moderator managed to restore calm.",
    "None praised Putin in the way Trump did before the invasion began.",
    "Ukraine, Russia, gas prices, inflation, education, guns, abortion.",
    "Trump saved our economy before, Gibbons knows how to do it again.\"",
    "\"You back off, buddy,\" Gibbons retorted, tossing in an obscenity.",
    "His point is that Trump is now an iconic figure for Republicans.",
    "I feel that there was some responsibility on his part for that.",
    "The spouses are both retired and had careers in the Air Force.",
    "In the Senate contest he's leaning toward businessman Gibbons.",
    "Most also supported military and financial aid of some kind.",
    "That's certainly a minority view within the GOP nationally.",
    "I think Trump did a lot of things that were very positive.",
    "Only one candidate raised his hand: state Sen. Matt Dolan.",
    "Dolan, meanwhile, is currently in single digits in polls.",
    "\"That would definitely seal it for sure,\" she told NPR.",
    "It went viral — the only moment of the debate to do so.",
    "And so from that aspect, no, we don't need to move on.",
    "Another high-profile candidate in the race is J.D.",
    "He says the party does need to move beyond Trump.",
    "In Ohio, that could also be part of his thinking.",
    "So the primary could be delayed into the summer.",
    "Gibbons responded that such claims are a lie.",
    "I think you try to build on what you have.",
    "We need to build on what he was doing.\"",
    "\"She's a fighter,\" Deal said of Greene.",
    "Neither offered an apology or regrets.",
    "\"So I don't think you ever move on.",
    "\"Don't tell me I haven't worked.\"",
    "The TV ads tell the story.",
    "\"Two tours in Iraq.",
    "Pro Trump.\"",
    "Pro God.",
    "Pro gun."
  ]
}