{
  "id": 972,
  "mediaId": 2641,
  "date": "2022-02-10",
  "headline": "JD Vance to Newsmax: Dems Working With Big Tech to Destroy America",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=471b84d5-eb8b-42c0-8d41-cd70fbc749da&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/newsmax-tv-jd-vance-bigt-ech-ohio-senate/2022/02/10/id/1056411/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luca Cacciatore",
  "authorUrl": "",
  "termIds": [
    4306,
    2939,
    910,
    1254
  ],
  "sentences": [
    "\"Instead of doing anything about that, a lot of weak-willed conservatives are unable to push back — either against the Democrats or against the corporations who control their agenda — and that's got to stop,\" Vance, a U.S. senate GOP candidate for Ohio, said during an appearance on \"Spicer & Co.\"\nVance, the author of \"Hillbilly Elegy,\" a memoir about his early life near Appalachia, stressed the need for sending those into Congress that \"actually come from our people.\"",
    "On Thursday, Vance said, \"I mean, look, I've been very honest with voters that I was not a Trump guy back in 2015, and $4 million of out-of-state money has come into this race to attack me for things that a lot of people said back in 2015 or 2016.",
    "Vance also addressed concerns about the state of his campaign as well as his past opinions on former President Donald Trump, indicating the recommendations of a course correction by pro-Vance pollster Tony Fabrizio were overstated.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV’s including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nSpecial Links:",
    "\"We've got to start sending people who actually ... know what it's like to grow up in a middle-class family in Ohio and actually have the will to fight for those voters once they get to Washington, D.C.",
    "I have been a strong supporter of the president for the past several years and frankly hopeful that he'll run again in 2024 because I think the country needs him.\"",
    "Vance also said he talks to the former president occasionally and believes there is a good chance Trump will not endorse anyone in the Senate race.",
    "Vance told Newsmax on Thursday that Democrats are trying to destroy the country with help from \"social media companies to censor conservatives.\"",
    "When asked about the state of donations to his campaign, Vance chalked it up to \"not being in the race as long\" as the other candidates.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "\"I want him to endorse me, or second best, I want him to stay neutral in the race.",
    "In an interview with Charlie Rose in 2016, Vance said, \"I’m a Never Trump guy.",
    "And I think there's a good chance that's going to happen,\" Vance said.",
    "I think that's me, and that's why we're going to win,\" Vance said.",
    "He referenced his fundraising successes in the last two quarters.",
    "I think we just need to tell our story,\" he said.",
    "\"I don't think that we need a course correction.",
    "Author and venture capitalist J.D.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "I never liked him.\"",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}