{
  "id": 9746,
  "mediaId": 2701,
  "date": "2022-03-23",
  "headline": "Why Does Ukraine’s Crisis Get More Attention From U.S. Elites Than Their Own Nation’s Border?",
  "image": "https://thefederalist.com/wp-content/uploads/2022/03/Overcrowded_Families_in_Weslaco_Station-11Jun2019-DHS_OIG.png",
  "link": "https://thefederalist.com/2022/03/23/why-does-ukraines-crisis-get-more-attention-from-u-s-elites-than-their-own-nations-border/?utm_source=rss&utm_medium=rss&utm_campaign=why-does-ukraines-crisis-get-more-attention-from-u-s-elites-than-their-own-nations-border",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Customs and Border Protection (CBP) reported a 1,066% increase in fentanyl seized at eight Southern Texas ports during Fiscal Year 2021.”\nWe rightfully empathize with innocent people caught in the crossfire in Ukraine and pray for peace, as Christians are obligated to do, but we should also ask: why does that crisis get more attention than one’s closer to home?",
    "Meanwhile, the lawless American border we now tolerate also facilitates a massive and regular flow of illegal drugs into America, including opioids and fentanyl, which poison many heartland communities and bring heartbreaking tragedy to emergency rooms and funeral homes nationwide.",
    "About a week ago, a story spread like wildfire, boosted by some in the Biden administration and in Europe: Russia had attacked nuclear reactors, the reactors had caught fire, and the resulting meltdown could be far worse than the famous Chernobyl power plant disaster.",
    "While the Russians brought tanks and other deadly weaponry, the crisis at our border has brought plenty of its own misery: fentanyl, sex trafficking, and gang violence that has driven the murder rate in American cities through the roof.",
    "Every argument offered for why we should care—Ukrainians are defensive, Russians aggressive; Ukraine is a democracy; Russia is not; Ukraine is liberal; Russia authoritarian—could apply to any number of conflicts over the last 20 years.",
    "It often originates in China, but the cartels know the easiest and fastest way to smuggle anything illegal into America—whether a trafficked child or narcotics—is our porous and lawless southern border, thanks to the American left.",
    "Incentives matter, and Biden and Vice President Kamala Harris, the alleged “border czar,” promise generous benefits and even the promise of eventual citizenship to anyone who can get here to trespass into our homeland.",
    "As I referenced in my Conservative Political Action Conference speech, I personally know the terrible toll illegal drugs take on American families, as my own mother suffered from addiction for years.",
    "Republicans should demand passage of an America First border protection plan, which would provide $4 of funding for border wall completion for every $1 of aid we send to Ukraine.",
    "Biden has been able to go on TV, act tough, and pretend to be presidential, ignoring that his weakness and policies are key reasons Russia invaded Ukraine in the first place.",
    "Amid the imagery of horrific war and carnage in Ukraine, Biden’s open borders have unleashed significant carnage in our own country that has received far less media coverage.",
    "The war in Ukraine has given Joe Biden political cover, taking focus away from inflation and his border policies, and too many Republicans have gone along.",
    "It’s insulting to our own citizens, and strategically stupid, to devote billions of resources to Ukraine while ignoring the problems in our own country.",
    "Predicate aid to Ukraine on solving America’s problems, and force Democrats (and many Republicans) to vote on whether they care for their own country.",
    "Already in Biden’s first year in office, Customs and Border Patrol reports an astounding 1.9 million illegal migrants encountered or arrested.",
    "The illegal and unfair labor market competition from these economic migrants depresses pay while Biden’s inflation surge crushes real wages.",
    "Why do we care so much about a foreign conflict 6,000 miles away while our own country suffers from a number of high-profile problems?",
    "Where’s the media empathy and compassion for the tens of thousands of Americans killed by fentanyl brought across our southern border?",
    "America has a border crisis, to be sure, and it’s not some shifting demarcation 6,000 miles away, it’s our very own southern border.",
    "America has a border crisis, to be sure, and it’s not some shifting demarcation 6,000 miles away, it’s our very own southern border.",
    "He can blame the conflict for driving inflation through the roof even though his own policies have done that for more than a year.",
    "He can blame Russia for high gas prices when the truth is, it’s his own energy policies that have made us dependent on Russia.",
    "For January 2022, 153,941 illegal migrants were intercepted crossing our border, the vast majority of them working-aged men.",
    "Yet U.S. media gobbled it up, and politicians gleefully used it as an excuse to further escalate an already tense situation.",
    "Some observers, including a number of my opponents in the Ohio Senate race, have suggested that we ought to focus on both.",
    "This, it turned out, was a preposterous lie on multiple fronts, especially the threats of a Chernobyl-style meltdown.",
    "Per Centers for Disease Control data, my state ranks as the third-worst in America for per-capita overdose deaths.",
    "We are now in the second week of around-the-clock obsession by U.S. media and political leaders about Ukraine.",
    "Let’s stop doing it, and force the American leadership to answer the question of who they actually care about.",
    "Comparatively, in January 2020, pre-Covid, under President Donald Trump the total crossing number was 36,585.",
    "The rhetoric has grown increasingly alarming, and the media reports are increasingly detached from reality.",
    "I’ve come under some fire for asking the simple question about Ukraine: why is this in our interest?",
    "Indeed, how we react as individuals to Ukraine is separate from how we ought to respond as a nation.",
    "Or for the inflationary crisis that has made many of our citizens unable to live prosperous lives?",
    "Nationwide, America hit a grim milestone in 2021, with more than 100,000 overdose deaths total.",
    "The simple answer is that Ukraine has given Joe Biden a political get out of jail free card.",
    "But if it’s so easy to focus on Ukraine’s border while fixing our own, why don’t we?",
    "Yet none of them have enjoyed the obsessive, bipartisan focus of American elites.",
    "Vance is a husband, father of two, and candidate for U.S. Senate in Ohio.",
    "That same number illegally pours across our southern border every month.",
    "To put it in context, 200,000 Russians invaded Ukraine, give or take.",
    "Or for the explosive sex trafficking increase in our own communities?",
    "What explains this nearly four-fold increase?",
    "According to New York Post reporting, “U.S.",
    "This fentanyl flows largely from Mexico.",
    "He is the author of \"Hillbilly Elegy.\"",
    "Ohio has been especially hard hit.",
    "American citizens be damned.",
    "J.D."
  ]
}