{
  "id": 2223,
  "mediaId": 151,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "POLITICO Playbook PM: What the March jobs report means for Biden",
  "image": "https://www.politico.com/dims4/default/825fc92/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fcf%2F3e%2F5b47039242debaaa9de0fad07cef%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1388973977",
  "link": "https://www.politico.com/newsletters/playbook-pm/2022/04/01/what-the-march-jobs-report-means-for-biden-00022358",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    682,
    732,
    895,
    1147,
    1248,
    1563,
    1609,
    2006,
    2087,
    2125,
    2128,
    2388,
    2436,
    2514,
    7,
    155,
    178,
    183,
    403,
    427,
    428,
    517,
    541,
    545,
    562,
    2538,
    2544,
    2550,
    2569,
    2590,
    2661,
    2672,
    2707,
    2807,
    2888,
    2942,
    2945
  ],
  "sentences": [
    "The state has long been a symbol of the Democratic Party's future by relying on a racially diverse coalition to win elections, but those past gains are now at risk.?\n Specifically of concern for Cortez Masto: Despite five years in the Senate and eight years as Nevada's attorney general, Ms. Cortez Masto remains unknown by a broad swath of the Nevada electorate, as a result of her longtime aversion to publicity, cautious political demeanor and Nevada's transient voters.?\n And a staggering statistic: Almost half the voters on Nevada's rolls have registered since Ms. Cortez Masto was last on the ballot in 2016, according to an analysis by TargetSmart, a Democratic data firm.?\nJAN. 6 AND ITS AFTERMATH\nUPPING THE ANTE  D.C. A.G. KARL RACINE is ratcheting up his lawsuit against members of the Jan. 6, 2021 mob.",
    "Psaki's deal is similar to that of SYMONE SANDERS, a former adviser and senior spokesperson for Vice President KAMALA HARRIS.?\nAFTERNOON READ  Michael Kruse has an incisive read from Tampa on Rep. CHARLIE CRIST, who, Kruse writes, with his fit build, his trim suits, his white hair and his tan face  has been one of the most durable and recognizable characters in Florida politics for parts of the last four decades.? But now, Crist is the front runner among the Democrats vying in the primary in August for the right come November to try to topple the colossus of [Florida Gov.",
    "The company, whose CEO, TIM COOK, is the nation's most visible gay executive, has deployed its lobbyists to oppose legislation that limits protections for trans and gay people or their families in Iowa, Florida, Texas and at least six other states.?\nAMERICA AND THE WORLD\nFOR YOUR RADAR  The Biden administration this morning secured the release of SAFI RAUF, 27, an Afghan-American Naval reservist who was doing humanitarian work in Kabul and who had been in captivity under the Taliban since December,? CNN's Jake Tapper reports.",
    "It's kind of OK to be on the wrong side of the consensus on trade, on immigration, but if you are on the wrong side of the foreign policy consensus, it is amazing how much this town will push back on you.?\nFormer Trump OMB Director Russ Vought also participated in a panel, and had some harsh words for the former president's national security advisers: It was a process preoccupied with tinkering and not zooming out to ask the paradigm-shifting questions, such as why are we still in Afghanistan?",
    "BONUS BIRTHDAY: The Spectator's Matt Purple\nFollow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nEli Okun @eliokun\nGarrett Ross @garrett_ross\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our politics and policy newsletters\nFollow Us",
    "At the same time, the survey found a majority of voters say abortion should be legal in all or most cases, underscoring the complicated views many Americans hold on the issue.?\nAPPLE ENTERS THE RING FOR LGBTQ RIGHTS  Apple is quietly mobilizing its vast resources to lobby against anti-LGBTQ legislation proliferating across the country  an unusual push by one of the world's most valuable companies into a consequential political debate,? Emily Birnbaum reports.",
    "Here's the breakdown, via AP's Paul Wiseman:\nThe overview: America's employers extended a streak of robust hiring in March, adding 431,000 jobs in a sign of the economy's resilience in the face of a still-destructive pandemic, Russia's war against Ukraine and the highest inflation in 40 years.?\nThe unemployment rate: The government's report Friday showed that last month's job growth helped shrink the unemployment rate to 3.6%.",
    "In its report, the government also sharply revised up its estimate of hiring in January and February by a combined 95,000 jobs.?\nHowever, CNBC notes that the numbers fell a bit short of expectations: Economists surveyed by Dow Jones had been looking for 490,000 on payrolls and 3.7% for the jobless level.?\nBut the reality is that one strong jobs report does not snap the administration out of its current circumstances.",
    "[Russian President VLADIMIR] PUTIN's invasion of Ukraine has driven up gas and food prices all over the world.?\nElsewhere, he painted the March figures as a strong sign that things are getting back on track: It means that our economy has gone from being on the mend to being on the move.?\nBut, of course, what really matters politically is whether the White House's message lands with voters in the midterms.",
    "The states that received the most money  California, Alabama, New York, South Carolina and Missouri  were either large and well-populated or had influential senators in leadership or on the committee that oversees spending.?\nPOLICY CORNER\nLEFT BY THE WAYSIDE  With surging gas prices and a stalled-out agenda in Congress, Biden is facing a harsh reality that his climate goals may be on the back burner now.",
    "The airstrike, which would be a first for Ukrainian forces since Russia's invasion began on Feb. 24, appeared to be an embarrassment for Moscow.?\nCONGRESS\nPULLING THE PORK  NYT's Luke Broadwater, Emily Cochrane and Alicia Parlapiano dig into the deets on the nearly 5,000 earmarks that made their way into last month's $1.5 trillion government spending bill.",
    "The American people, I think they're beginning to understand that this American Rescue Plan  and there's no reason why they should know the names of all of these pieces of legislation that got passed  but the American Rescue Plan, with it we were able to get Americans vaccinated, schools opened and businesses humming,? Biden said.",
    "That's the lowest rate since the pandemic erupted two years ago and just above the half-century low of 3.5% that was reached two years ago.?\nThe context: Despite the inflation surge, persistent supply bottlenecks, damage from COVID-19 and now a war in Europe, employers have added at least 400,000 jobs for 11 straight months.",
    "THE PANDEMIC\nHEADS UP  Global health organizations are considering changing their Covid-19 vaccination pledges  a move that could leave millions of people without first shots as countries reprioritize at-risk groups in the coming months, according to four people familiar with the matter,? Daniel Payne and Erin Banco report.",
    "WAR IN UKRAINE\n An evacuation effort from the port city of Mariupol was at least partly underway on Friday for civilians trapped for weeks by a Russian siege, according to an adviser to the mayor's office, who said buses with civilians had left the city,? NYT's Megan Specia and Matthew Mpoke Bigg report.",
    "With midterm elections approaching, the gush of federal stimulus spending will draw even greater scrutiny as Republicans accuse Democrats of wasting funds and fueling inflation, and demand a precise accounting of how the money has been spent,? NYT's Sheryl Gay Stolberg reports from Frankfort, Ky.",
    "Pic\nWELCOME TO THE WORLD  Anne Filipic, assistant to the president and director of management and administration of the White House, and Carlos Monje, undersecretary of Transportation for policy, recently welcomed Louisa Pilar Monje, who came in at 8 lbs, 6 oz and 20.5 inches.",
    "POLITICO Playbook PM: What the March jobs report means for Biden\nBy GARRETT ROSS\n04/01/2022 01:10 PM EDT\n Updated 04/01/2022 03:29 PM EDT\n 2022-04-01T03:29-0400\nPresented by\nThis morning, we wrote that President JOE BIDEN was facing a slump as the week of news came to a close.",
    "RON] DESANTIS, who routinely polls as the most popular GOP presidential candidate not named DONALD TRUMP.?\nBut the race isn't just about Florida: Beyond the high stakes in this cycle, and perhaps the next one, too, this ultra-important race could have yet broader implications.",
    "ABORTION FILES  More American voters favor the idea of a 15-week abortion ban than oppose it, according to the latest Wall Street Journal poll, as the Supreme Court prepares to issue a ruling that could alter the nation's abortion landscape,? WSJ's Catherine Lucey writes.",
    "With lawmakers in several states pushing forward with bills that would ban abortion after 15 weeks of pregnancy, 48% of voters said they would strongly or somewhat favor such restrictions, with exemptions to protect the life of the mother, while 43% were in opposition.",
    "More context: March Jobs Report Keeps Fed on Track for Larger Rate Rise in May,? WSJ\nPSAKI BOMB  White House press secretary JEN PSAKI is planning to leave her post this spring and is in exclusive talks with MSNBC to join the network,? Axios' Sara Fischer reports.",
    "And regulations that are now under development  strict limits on the pollution from cars and power plants that is dangerously heating the planet  could be curtailed or blocked by the conservative majority on the Supreme Court,? writes NYT's Coral Davenport.",
    "It is a system that assumes a president that asks these questions is wrong or does not mean what he says.?\nSPOTTED at a birthday party for Sen. Patrick Leahy (D-Vt.) hosted by Bono and ONE Campaign at Seven Reasons on Thursday night: Marcelle Leahy, Sens.",
    "ALL POLITICS\nWAKING UP IN VEGAS  NYT's Jennifer Medina and Reid Epstein have the download on Dems' growing concerns in Nevada (featuring perhaps our favorite headline of the day: Democrats Worry That What Happens in Nevada Won't Stay in Nevada?).",
    "PLAYBOOKERS\nCONSERVATIVES' FOREIGN POLICY CONFAB  On Thursday, the American Conservative and American Moment hosted Up from Chaos: Conserving American Security,? a foreign policy conference at the Marriott Marquis with about 200 attendees.",
    "And that almost all Democrats will vote for Crist and almost all Republicans will vote for DeSantis but that enough of the people somewhere in whatever's left of the middle will vote because of this for Crist.?\nHappy Friday afternoon.",
    "Vance, the Ohio GOP Senate candidate who as recently as Thursday stated his opposition to elevating the war in Ukraine over immigration in an op-ed for the Columbus Dispatch, said this: Foreign policy is uniquely dangerous.",
    "Racine this morning announced that he was adding six new high-profile figures to the district's lawsuit, which already featured more than 30 defendants connected to the Proud Boys and Oath Keepers,? Kyle Cheney writes.",
    "NOKO'S NO-NO  The U.S. leveled sanctions on five North Korean entities Friday in response to two ballistic missile tests the reclusive Asian country conducted in February and March,? AP's Fatima Hussein reports.",
    "She will also be a part of live programming on MSNBC's cable network as a voice on different shows, but she will not be hosting the 9 p.m. hour replacing RACHEL MADDOW, which has been speculated.",
    "On the military front, Ukrainian helicopters, flying low, crossed into Russian territory early Friday and fired on an oil depot in the city of Belgorod, according to a Russian regional governor.",
    "Even Mr. Biden's top aides and closest allies now concede that the legislative centerpiece of his climate plan is unlikely to become law in the face of steadfast Republican opposition.",
    "And she lacks the popularity and deep ties with Latino voters that Senator HARRY M. REID, who died in December, harnessed to help build the state's powerful Democratic machine.",
    "Since the outset of the pandemic, the Trump and Biden administrations have injected $5 trillion into the American economy, including the rescue plan.",
    "Young voters who fueled Senator BERNIE SANDERS' biggest victory in the 2020 Democratic presidential primary remain skeptical about President Biden.",
    "BEYOND THE BELTWAY\nFUNNELING THE FUNDING  Congress is stumbling to get a new round of pandemic aid unstuck from the bottom of its collective shoe.",
    "And Senator CATHERINE CORTEZ MASTO, a Nevada Democrat and the country's first Latina senator, is one of the party's most endangered incumbents.",
    "Delivering keynote addresses were: Sen. Rand Paul (R-Ky.), Reps. Thomas Massie (R-Ky.), Dan Bishop (R-N.C.) and Matt Rosendale (R-Mont.",
    "Democrats have long relied on working-class and Latino voters to win Nevada, but the loyalty of both groups is now in question.",
    "Overall, Democrats brought home considerably more money for their states than Republicans, some of whom boycotted the process.",
    "She must overcome the president's sagging approval ratings, dissatisfaction with the economy and her own relative anonymity.",
    "), Rep. Michael McCaul (R-Texas), Gayle Smith, Tom Hart,Andrea Mitchell, J.P Dowd, Alicia Leahy and Lawrence Jackson.",
    "Democrats secured more than $5 billion for their states, compared with less than $3.4 billion for Republicans.",
    "But, meanwhile, some states are awash with federal funds that they are still figuring out how to spend.",
    "The White House took umbrage at that claim, pointing to today's jobs report as a sign of progress.",
    "(See White House chief of staff RON KLAIN's Twitter feed this morning for more trumpeting.)",
    "And even Biden himself alluded to that fact in his remarks at the White House this morning.",
    "The deets: Psaki will host a show for MSNBC on NBCUniversal's streaming platform, Peacock.",
    "Just over $600 million of earmarks were bipartisan, secured by lawmakers in both parties.",
    "Louisa, which means renowned warrior? in Latin, joins big brothers Sebastian and Leo.",
    "And certainly, the March jobs report is a feather in the cap for the administration.",
    "(I'll be rooting for TAYLOR SWIFT to go back to back on Album of the Year.)",
    "That what they want really is to dial down the volume and the vitriol.",
    "That people are exhausted of the nonstop politics of conflict.",
    "The Grammys are this Sunday  my personal favorite awards show.",
    "Here's the official playlist for your pre-show listening.",
    "), Amy Klobuchar (D-Minn.) and Chris Van Hollen (D-Md.",
    "Shouldn't we prioritize China over everything else?",
    "Let me know your favorites on email or Twitter.",
    "We need to do more to get prices under control.",
    "Because the way Crist is running is a bet.",
    "This job is not finished,? he said.",
    "Vance, Joe Kent and David Sacks.",
    "Chris Coons (D-Del.",
    "), J.D."
  ]
}