{
  "id": 2238,
  "mediaId": 43,
  "date": "2/25/2022 12:00:00 AM",
  "headline": "America now has its own 'Fifth Column,' and its name is Fox News",
  "image": "https://images.dailykos.com/images/1041639/story_image/Screenshot2022-02-18at12-10-03TuckerCarlsonTonightFOXNEWSWFebruary172022500pm-600pmPSTFreeBorrowStreaming....png?1645752469",
  "link": "https://www.dailykos.com/story/2022/2/25/2081040/-America-now-has-its-own-Fifth-Column-and-its-name-is-Fox-News",
  "sentiment": "-0.373",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    826,
    944,
    1001,
    1064,
    1147,
    1248,
    1335,
    1544,
    1609,
    1613,
    2006,
    2030,
    2074,
    2087,
    2125,
    2436,
    146,
    190,
    200,
    428,
    562,
    2590,
    2707,
    2942,
    2945,
    2959,
    2976
  ],
  "sentences": [
    "That sophistry ignores the fact that Republican leaders themselves, notably Dick Cheney, deliberately falsified intelligence, cherry-picking fake threats? in order to propagandize Americans into believing that war was justified: the lie that Saddam Hussein possessed weapons of mass destruction,? that failure to stop him could result in a mushroom cloud;? and, above all, that Iraq was linked to the 9/11 attacks.",
    "They all date from Feb. 17five days before Putin launched his assault by inserting troops into the separatist? Ukrainian enclaves of Donetsk and Luhansk (immediately followed by the melodrama of Putin signing a decree falsely recognizing each of these regions as newly independent?), and one week before Putin launched a full-blown war.",
    "Instead, we're facing a corporate behemoth whose most visible focus over the past several weeks has been to diminish and ridicule the national security interests of the U.S., therebyimplicitly and explicitlylending support to a strategic enemy, one which currently has its nuclear missiles targeting American and European cities.",
    "The next chyron is even more direct in its approach:\nThe same theme was repeated in this chyron:\nLast week the Biden administration repeatedly warned of Putin's intentions, in an effort to prepare the American people for what was coming and also, not coincidentally, to demonstrate to Putin our full knowledge of his goals.",
    "The chortling tone of this particular chyron Gave A War And Nobody Came? directly impugns the administration's response by suggesting it is fumbling, thus serving the dual goals of undercutting Biden (remember, Fox News is essentially the voice of the Republican Party) and thus facilitating Putin's attack.",
    "The State Department may also be playing us, because this hysteria over the weekend was obviously an opportunity to take the conversation away from Hillary Clinton paying an outside technology company to spy on President Trump, which is an incredible national security issue in and of itself.",
    "Former Ku Klux Klan Grand Wizard David Duke once called Russia, a majority white, Slavic country that frequently opposes the increasingly diverse European Union, the key to white survival.? White supremacist leader Richard Spencer hailed Russia as the sole white power in the world? in 2016.",
    "A lower third? or chyron,? in news parlance, is a typed script appearing (usually) across the bottom of the screen, serving to grant immediate context for a viewer just tuning in, name the person speaking, orparticularly in right-wing mediato isolate and emphasize a single point or stance.",
    "Note the phrase state department propaganda.? The primary method of sophistry employed by Republicans in this instance is to backhandedly allude to the alleged intelligence failures? that preceded the run-up to the Iraq war in 2002-2003, a war which in fact they loudly cheered on.",
    "Putin and his enablers, Fox News, Carlson, and (now) many Republican lawmakers, know that this cynical analogy is misplaced both in context and in effect, but rely on Americans' political polarization (and general amnesia and outright ignorance) in order to further this tactic.",
    "From Tucker Carlson's Feb. 17th broadcast on Fox News\nRussia has now embarked on what is unquestionably a full-scale invasion of Ukraine, so it seems an appropriate time to revisit some of the media voices that spent the last month relentlessly mocking such a possibility.",
    "In other words, let's examine the voices of those who deliberately intensified their efforts in order to preemptively underminethrough mocking, disinformation or otherwiseany response by the Biden administration to the run-up and execution of Putin's plan of attack.",
    "Over the past month Fox News has been engaged in a deliberate effort to portray administration warnings about Ukraine as merely an effort to distract Americans from what Republicans (and Putin) would prefer to focus on: their manufactured lies about Hillary Clinton.",
    "https://t.co/FD9BevwbeB\n Ezra Klein (@ezraklein) March 19, 2021\nThere has never been another time in American history when the media arm of an U.S. political party has repeatedly demonstrated its intent to undermine U.S. interests in favor of a strategic enemy.",
    "Next chyron, same broadcast:\nAgain, this bit of psychological manipulation is intended to ridicule American efforts to anticipate Putin's actions as nothing but hysteria.? While it only mentions Ukraine, it is actually a political attack on President Biden.",
    "As pointed out by Ja'han Jone, writing for MSNBC, the right's love affair with Putin dates back for some time, but its real attachment to not only Putin himself but autocratic regimes as a whole became much more obvious during the Trump administration.",
    "Putin's Russia, Orban's Hungary and other autocratic regimes provide a ready model for the right to emulate and hold up as an example of its preferred worldview:\nNational security experts have warned about those dangerous connections for years now.",
    "These chyrons appeared during Carlson's show, accompanying Carlson's statements prior to and during his colloquy with his guest, Joe Kenta Donald Trump-endorsed zealot currently attempting to unseat Washington Rep. Jaime Herrera Butler.",
    "In reality, however, the entire Fox News network, under the control of the Murdoch family, has been engaged in obliquely or directly supporting Russian interests, and downplaying Russian efforts to subvert the U.S. for quite some time.",
    "The word hysteria? is also commonly used as a pejorative against women; its usage and subtext here is to imply that Biden is somehow effeminate,? a slur in keeping with Fox News' typical appeal to its straight, white and male audience.",
    " Rep. Carlos A. Gimenez (@RepCarlos) February 24, 2022\nIt seems -- at least to these Republican representatives -- that the past two weeks of the administration's incessant warnings about an impending attack never occurred.",
    "He is simply parroting propaganda which could not be parroted without the complicity and approval of the entire Fox News corporate leadership, and more broadly, without the assent and approval of the Republican party.",
    "These figures in effect supported Vladimir Putin, by minimizing the threat that Russia posed to Ukraine, Europe, the U.S., and Western democracies as a wholein particular those member countries of the NATO alliance.",
    "This panoply of deliberate lies reached its apotheosis in Colin Powell's false testimony before the U.N. as he sought to cajole the international community into assisting the U.S. in its effort to topple Hussein.",
    "This type of slander also serves Putin's goals of sowing doubts among Americans as to Biden's ability to respond to his planned attack: nothing to see here but weak (read effeminate) American pearl-clutching!",
    "Here, Fox News, via its approved spokesman, tries to ridicule those efforts, in keeping with Fox's goal to diminish the Biden administration and thereby facilitate Putin's assault when it actually occurred.",
    "Republican approval of Putin grew stronger after Russia was seen by many as having helped Donald Trump win the 2020 presidential election (in part by targeting Black voters with propaganda, I should add).",
    "As this 2021 Tweet by the New York Times Ezra Klein, illustrates:\nx\nWatching Fox News openly root for Putin is a really remarkable moment in what the American Right has become, captured for posterity.",
    "We can expect a similar rhetorical back-flip from Fox News now that Americans are being treated to a firsthand glimpse through their TV sets of what a murderous monster Vladimir Putin really is.",
    "It denotes an embedded base of support of ready sympathizers, usually in the civilian realm, intending to sabotage or undermine their home country's efforts to stop an attack by outside enemy.",
    "Most notably (and infamously), conservative Andrew Sullivan used the term to describe those who opposed the lie-based war on Iraq, though he later backpedaled and apologized for it.",
    "Carlson's chyron, above, draws upon this studied contempt for the American people as well as contempt for American national interests, and thus dovetails neatly with Putin's goals.",
    "As Jones points out, the Republican Party in its current form has embraced white, nationalist sentiments in its effort to maintain relevance in an increasingly diverse America.",
    "[*]\nAll of these instances show that where white nationalist and American conservative support for the Kremlin exists, it isn't just born out of political convenience.",
    "In essence, many white nationalists and American conservatives feel a kinship with Russia that largely stems from a shared opposition to multiracial democracy.",
    "x\nPOTUS and his administration keep claiming they are defenders of democracy, and yet, they just allowed a tyrant to steamroll over a democracy in Europe.",
    "Suddenly, when the true horror of Putin's intent has been made clear, he is now a tyrant? who must be stopped at all costs, preferably yesterday.",
    "The term has been used in the past by conservatives to describe alleged treachery by liberals who failed to support the country's war efforts.",
    "Much of the mocking and sarcasm has emanated from a single individual, who currently holds a prime perch as one of Fox News' primary faces.",
    "And several American white nationalists have reportedly attended multiple events sanctioned by Russian extremist groups.",
    "Republican lawmakers have also eagerly signed up as foot soldiers for these implicit efforts to undermine U.S strategy.",
    "Here, for example, is Rep. Lisa McClain, typing away on Twitter just hours after Putin launched his assault on Ukraine.",
    "Without delving too deeply into its precise lexicon, the term fifth column? dates back to the Spanish Civil War.",
    "It exists because these entities have similar beliefs about what kinds of people should be able to wield power.",
    "Take a good look at the following chyrons, each proudly emblazoned with Fox News' logo.",
    "But what we see today is not a tiny group of war dissenters challenging an unjust war.",
    "So in a sense Carlson himself need not be singled out; in fact he's beside the point.",
    " Representative Lisa McClain (@RepLisaMcClain) February 24, 2022\nx\nWhere's Biden?",
    "Here is Fox News propagandist Maria Bartiromo, doing exactly that last week.",
    "In their perception, U.S. security interests take a back seat to ideology.",
    "And when the two are in opposition, ideology always gets preference.",
    "Still, let's begin with that specific individual: Tucker Carlson.",
    "BARTIROMO: Yeah, well, I mean, he's playing us.",
    "We can take their words and actions as proof.",
    "But that Fifth Column exists here and now.",
    "It's just a click away, in fact."
  ]
}