[
  {
    "id": 2781,
    "mediaId": 2578,
    "date": "2022-01-29",
    "sentence": "Arizona Senate President Karen Fann told TGP that Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has spoken to numerous people for his criminal investigation.",
    "author": "Jordan Conradson",
    "title": "HUGE – AZ AUDIT: Special Master Names Computer Experts To Examine Maricopa County Routers And Splunk Logs – Questions from the Arizona State Senate to Special Master John Shadegg Released"
  },
  {
    "id": 2813,
    "mediaId": 8387,
    "date": "2022-02-01",
    "sentence": "Tracey Kay McKee, 64, entered a guilty plea to one felony count of attempted illegal voting for signing and casting her recently deceased mother's early ballot in the 2020 general election, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> reported.",
    "author": "Julie Luchetta",
    "title": "Scottsdale woman pleads guilty to casting dead mother's ballot in 2020 election"
  },
  {
    "id": 2693,
    "mediaId": 8322,
    "date": "2022-02-01",
    "sentence": "DESPITE DEMOCRACY FEARS, MORE AMERICANS ACCEPT BIDEN'S ELECTION THAN THEY DID TRUMP'S FOUR YEARS AGO\n\"Appearing before Judge Margaret LaBianca in Maricopa County Superior Court on January 26, 2022, McKee admitted signing Mary Arendt’s name to an early ballot envelope and mailing it to Maricopa County on or between October 7, 2020, and November 3, 2020,\" the office of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement, according to the report.",
    "author": "Lawrence Richard",
    "title": "Arizona woman pleads guilty to voter fraud after accused of forging dead mother's signature"
  },
  {
    "id": 1850,
    "mediaId": 2662,
    "date": "2022-02-04",
    "sentence": "HUGE – AZ AUDIT: Special Master Names Computer Experts To Examine Maricopa County Routers And Splunk Logs – Questions from the Arizona State Senate to Special Master John Shadegg Released\nWe The People AZ Alliance will deliver this evidence to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> for his ongoing criminal investigation.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Maricopa County FOIA Emails Reveal Gross Negligence, Missing Internet Connection Logs?"
  },
  {
    "id": 1831,
    "mediaId": 8350,
    "date": "2022-02-06",
    "sentence": "A woman from Cochise County was indicted for allegedly casting the early ballot of her dead mother during the 2020 election, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> announced on Wednesday.",
    "author": "KTAR.COM",
    "title": "Weekend wrap-up: Here are the biggest Arizona stories from Feb. 4-6"
  },
  {
    "id": 2516,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "“Evidence and testimony collected since November 3, 2020, has reached the point of clear and convincing and is now in the hands of the Arizona Attorney General for action.”\nThe only thing clear and convincing is the fact that Attorney General <span class='selected-term'>Mark Brnovich</span> is under tremendous pressure to indict someone (anyone?)",
    "author": "Laurie Roberts",
    "title": "Rep. Finchem's bill to decertify Arizona's election is more about 2022 than 2020"
  },
  {
    "id": 757,
    "mediaId": 4091,
    "date": "2022-02-25",
    "sentence": "He also said that the results were being provided to the Arizona Senate as well as GOP Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "JD Heyes",
    "title": "Bombshell study finds more than 200,000 ballots from 2020 election with “mismatched signatures” indicating widespread fraud"
  },
  {
    "id": 17225,
    "mediaId": 8350,
    "date": "2022-02-27",
    "sentence": "Settlement funds will be disbursed to the state and its subdivisions through the One Arizona Plan over an 18-year period to aid in treatment, preventative measures and for education, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in a press release.",
    "author": "KTAR.COM",
    "title": "Weekend wrap-up: Here are the biggest Arizona stories from Feb. 25-27"
  },
  {
    "id": 13410,
    "mediaId": 8450,
    "date": "2022-03-17",
    "sentence": "En una carta fechada el 17 de marzo, <span class='selected-term'>Mark Brnovich</span> citó una ley estatal que otorga a su oficina poderes de supervisión sobre los fiscales del condado.",
    "author": "",
    "title": "Brnovich exige a la fiscal Allister Adel respuestas de Adel sobre 180 casos desestimados"
  },
  {
    "id": 9074,
    "mediaId": 2618,
    "date": "2022-03-21",
    "sentence": "AZ Attorney General <span class='selected-term'>Mark Brnovich</span> certified the fraudulent election, and he is certifying the cover-up by allowing the County to continue withholding elections machines and data.Arizona Senate President Karen Fann asked what they’re hiding now in a recent tweet.",
    "author": "Jordan Conradson",
    "title": "Maricopa County Receives Renewed Request For Records Or Information In 2020 Election Investigation – What Are They Hiding Now?"
  },
  {
    "id": 9397,
    "mediaId": 8428,
    "date": "2022-03-22",
    "sentence": "What are they hiding now?”\nTrump’s lengthy statements echo the words of Fann and demand a response from Arizona’s Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Timothy Frudd",
    "title": "Trump says ‘the American people deserve answers’ on the election"
  },
  {
    "id": 9122,
    "mediaId": 2662,
    "date": "2022-03-22",
    "sentence": "President Trump released another statement yesterday blasting the Arizona Attorney General, <span class='selected-term'>Mark Brnovich</span>, on his failure to prosecute the Maricopa County Supervisors for the rigged 2020 election and their ongoing failure to comply with his criminal investigation.",
    "author": "Jordan Conradson",
    "title": "President Trump Tells Arizona Attorney General Mark Brnovich To Issue Warrants In 2020 Election Fraud Case: “The Supervisors Just Won’t Release The Information—It Must Really Be Bad!”"
  },
  {
    "id": 9399,
    "mediaId": 2912,
    "date": "2022-03-23",
    "sentence": "“The Board of Supervisors remains committed to free and fair elections that conform to federal and state laws.”\nDespite those findings, Republican Attorney General <span class='selected-term'>Mark Brnovich</span> is still reviewing questions the Senate’s “audit” raised about possible problems.",
    "author": "",
    "title": "Final Arizona election report finds no county data issues"
  },
  {
    "id": 9547,
    "mediaId": 2748,
    "date": "2022-03-28",
    "sentence": "Last week, President Trump released a statement saying, “now is finally the time for the Arizona Attorney General to issue warrants and take his investigation to the next level.”\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> has done nothing to hold these criminals accountable.",
    "author": "Women System",
    "title": "Maricopa County Supervisors Refuse To Attend Meeting After Arizona State Senate Issues New 2020 Election Subpoena"
  },
  {
    "id": 8005,
    "mediaId": 8326,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>’s probe of Maricopa County’s 2020 election thus far has found “serious vulnerabilities” in procedures but no crimes, according to an initial report released Wednesday on the monthslong investigation.",
    "author": "Mary Jo Pitzl",
    "title": "Attorney general's report on election in Maricopa County questions procedures, doesn't allege wrongdoing"
  },
  {
    "id": 7717,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Arizona attorney general <span class='selected-term'>Mark Brnovich</span> issued a report Wednesday that found no evidence of widespread voter fraud or irregularities in Maricopa County, despite Trump's persistent pressure campaign to justify his false claims about his election loss, and the \"Morning Joe\" host said he's had enough.",
    "author": "Travis Gettys",
    "title": "Morning Joe hammers GOP 'freaks' still clinging to Trump's election lies"
  },
  {
    "id": 7804,
    "mediaId": 2591,
    "date": "2022-04-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> released a report citing “serious vulnerabilities that must be addressed and raise questions about the 2020 election in Arizona.”\nIndeed, the report issued to the state Senate highlighted controversial management of the election in Maricopa County.",
    "author": "Human Events Staff",
    "title": "Arizona AG: ‘Serious Vulnerabilities’ in Maricopa County ‘Raise Questions’ About 2020 Election"
  },
  {
    "id": 7962,
    "mediaId": 2681,
    "date": "2022-04-08",
    "sentence": "“All branches of government in this state must come together to provide full assurance of the integrity of our elections and answer every outstanding question,” said a report from Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "",
    "title": "2020 ‘election fraud’ in Arizona ‘raises questions,’ AG reports"
  },
  {
    "id": 5353,
    "mediaId": 2557,
    "date": "2022-04-19",
    "sentence": "https://t.co/Pgogo9A7uO\n— <span class='selected-term'>Mark Brnovich</span> (@GeneralBrnovich) April 6, 2022\nBelow is Trump’s statement as he responded to the report:\nAttorney General Brnovich of Arizona was given massive information on the fraud and so-called ‘irregularities’ that took place in the 2020 Presidential Election.",
    "author": "DML News App",
    "title": "NEWS ALERT: AZ AG admits issues with 2020 election, Trump unleashes on him in scorching rebuke"
  }
]