[
  {
    "id": 3631,
    "mediaId": 2520,
    "date": "2022-01-24",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is no longer attorney general.",
    "author": "EJ Montini",
    "title": "Arizona Attorney General Mark Brnovich turns a blind eye to fake Trump electors"
  },
  {
    "id": 4387,
    "mediaId": 2522,
    "date": "2022-01-26",
    "sentence": "The lawsuit, filed by Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, alleged that Google used unfair and deceptive practices to obtain users’ location data, which it then exploits for targeted advertising.",
    "author": "BPR Wire",
    "title": "Google handed major defeat in state AG lawsuit over location tacking"
  },
  {
    "id": 2904,
    "mediaId": 2548,
    "date": "2022-01-31",
    "sentence": "Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> sent a letter to Department of Homeland Security (DHS) Secretary Alejandro Mayorkas on Jan. 27 demanding that he stop allowing illegal migrants to travel through U.S. airports over a TSA policy permitting them to use arrest warrants as identification.",
    "author": "",
    "title": "State AG Asks Mayorkas To Stop Letting Illegal Migrants Travel Through US Airports With Arrest Warrants"
  },
  {
    "id": 3420,
    "mediaId": 2688,
    "date": "2022-02-02",
    "sentence": "According to Politico, the Wards’ lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, the wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> — an ally of former President Donald Trump who is running for Senate.",
    "author": "Cristina Cabrera",
    "title": "Jan. 6 Committee Subpoenas Arizona GOP Chair And Her Husband’s Phone Records"
  },
  {
    "id": 2777,
    "mediaId": 8475,
    "date": "2022-02-03",
    "sentence": "In September, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> sued the Biden administration over the federal government's mandate to require the COVID vaccine for federal workers, calling them unconstitutional.",
    "author": "Michael McDaniel",
    "title": "Arizona Republicans seek sovereignty over federal COVID mandates"
  },
  {
    "id": 2516,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "“Evidence and testimony collected since November 3, 2020, has reached the point of clear and convincing and is now in the hands of the Arizona Attorney General for action.”\nThe only thing clear and convincing is the fact that Attorney General <span class='selected-term'>Mark Brnovich</span> is under tremendous pressure to indict someone (anyone?)",
    "author": "Laurie Roberts",
    "title": "Rep. Finchem's bill to decertify Arizona's election is more about 2022 than 2020"
  },
  {
    "id": 1826,
    "mediaId": 2564,
    "date": "2022-02-08",
    "sentence": "+5\nView gallery\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> released a legal opinion Monday calling the southern border crisis an 'invasion,' and claiming the U.S. Constitution gives states the power to defend and take action against such invasions\n STATE OF ARIZONA OFFICE OF THE ATTORNEY GENERAL\n ATTORNEY GENERAL OPINION By MARK BRNOVICH ATTORNEY GENERAL February 7, 2022 No.",
    "author": "Katelyn Caralle",
    "title": "Arizona's Republican Attorney General calls Biden's border crisis an 'INVASION': Mark Brnovich states in legal opinion the state can defend itself from the influx of migrants under the US Constitution"
  },
  {
    "id": 1967,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has officially ruled that the chaos on the Mexican border constitutes an “invasion” under the U.S. Constitution, clearing the way for the state’s governor to defend the boundary with police or troops of his own.",
    "author": "Stephen Dinan",
    "title": "Arizona AG rules states can deploy forces to fight border ‘invasion’"
  },
  {
    "id": 2380,
    "mediaId": 2520,
    "date": "2022-02-10",
    "sentence": "Arizona Republican Attorney General <span class='selected-term'>Mark Brnovich</span> this week issued a legal opinion effectively saying that Republican Gov.",
    "author": "Elvia Díaz",
    "title": "The Republican 'war' at the border is a bluff. They aren't about to take on the cartels"
  },
  {
    "id": 1637,
    "mediaId": 2550,
    "date": "2022-02-11",
    "sentence": "“In Arizona, <span class='selected-term'>Mark Brnovich</span>, the state Attorney General and a candidate for the GOP primary for U.S. Senate, called immigration into the state an ‘invasion’ in a legal opinion he issued this week justifying Arizona’s ability to send troops to the border,” America’s Voice continued.",
    "author": "",
    "title": "House Republican touts 'Dignity Act' bill claiming to make path to legalization, but don't be fooled"
  },
  {
    "id": 1787,
    "mediaId": 2520,
    "date": "2022-02-15",
    "sentence": "Republican Attorney General <span class='selected-term'>Mark Brnovich</span> – now using his office as a campaign tool for his U.S. Senate campaign – filed a legal brief with the Arizona Supreme Court arguing that the court didn’t have the authority to rule on the anti-mask mandate.",
    "author": "EJ Montini",
    "title": "Arizona, where masks in classrooms are bad, but guns in classrooms are ... good?"
  },
  {
    "id": 1397,
    "mediaId": 2540,
    "date": "2022-02-17",
    "sentence": "The nominal frontrunner is probably state Attorney General <span class='selected-term'>Mark Brnovich</span> but no one -- in Arizona or Washington -- sees him as a top tier challenger to Kelly.",
    "author": "Chris Cillizza",
    "title": "Donald Trump may be single-handedly costing Republicans a Senate seat"
  },
  {
    "id": 76,
    "mediaId": 2594,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "Via AP news wire",
    "title": "High court wades into clash between Biden, Republican states"
  },
  {
    "id": 491,
    "mediaId": 3987,
    "date": "2022-02-23",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 643,
    "mediaId": 2592,
    "date": "2022-02-23",
    "sentence": "The justices heard oral arguments in an appeal by 13 Republican state attorneys general led by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> of a lower court's ruling that rejected their bid to defend Trump's rule, which expanded the scope of those considered likely to become a \"public charge.\"",
    "author": "Andrew Chung",
    "title": "U.S. Supreme Court Mulls Republican Bid To Defend Trump Immigration Rule"
  },
  {
    "id": 115,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "More than a dozen Republican attorneys general, led by Arizona’s <span class='selected-term'>Mark Brnovich</span>, have sought to defend the 2019 public charge rule, which broadened the definition of \"public charge\" to include an immigrant who receives one or more designated public benefits for more than 12 months within a 36-month period -- and included a substantial number of benefits.",
    "author": "Adam Shaw",
    "title": "SCOTUS hears GOP push to defend Trump-era public charge rule; Arizona AG calls Biden moves ‘unprecedented’"
  },
  {
    "id": 13134,
    "mediaId": 2595,
    "date": "2022-02-28",
    "sentence": "“More than a dozen Republican attorneys general, led by Arizona’s <span class='selected-term'>Mark Brnovich</span>, have sought to defend the 2019 public charge rule, which broadened the definition of ‘public charge’ to include an immigrant who receives one or more designated public benefits for more than 12 months within a 36-month period — and included a substantial number of benefits,” Fox News reported on Saturday.",
    "author": "M Dowling",
    "title": "Admin Schemes After SCOTUS Hears the ‘Welfare for Illegal Aliens’ Case"
  },
  {
    "id": 9202,
    "mediaId": 2618,
    "date": "2022-03-21",
    "sentence": "",
    "author": "Cassandra Fairbanks",
    "title": "Watch: Sarah Palin Says She’s Considering Running for Late Rep. Don Young’s Seat"
  },
  {
    "id": 11675,
    "mediaId": 8345,
    "date": "2022-03-22",
    "sentence": "She said the county has not sufficiently cooperated with a request for records from Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "",
    "title": "Arizona Senate GOP revives election bill"
  },
  {
    "id": 8937,
    "mediaId": 2573,
    "date": "2022-03-22",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> hailed the decision as a victory: \"Our office has been at the forefront of the fights for the rule of law this past year.",
    "author": "Adam Shaw",
    "title": "Federal court partially blocks Biden admin's ICE enforcement restrictions in response to GOP lawsuit"
  },
  {
    "id": 9056,
    "mediaId": 2834,
    "date": "2022-03-28",
    "sentence": "Arizona attorney general <span class='selected-term'>Mark Brnovich</span> has launched an antitrust investigation into this collusion.",
    "author": "Michael G. Zey",
    "title": "What Happens When a GOP Majority Can Investigate the Jan. 6 Committee?"
  },
  {
    "id": 7554,
    "mediaId": 2591,
    "date": "2022-04-04",
    "sentence": "The attorneys general argue that the end of the order will result in a number of higher costs for the states, including higher health care costs for illegal migrants infected with COVID-19 and “the presence of much greater numbers of paroled aliens with non-meritorious asylum claims …”\n“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said.",
    "author": "Human Events Staff",
    "title": "Republican States Sue Biden to Stop End to Title 42"
  },
  {
    "id": 7191,
    "mediaId": 2664,
    "date": "2022-04-04",
    "sentence": "The fact remains that these right-wingers have been further enabled by the likes of Donald Trump and Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, both of whom spread the false gospel of Trump’s “Big Lie.”\nWith the U.S. Senate’s failure to pass voting rights legislation earlier this year, the voting rights fight has come to Arizona.",
    "author": "Anushka Sarkar",
    "title": "Arizona is leading the way on new anti-democratic laws fueled by Republican election lies"
  },
  {
    "id": 7317,
    "mediaId": 2557,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told Fox News on Monday.",
    "author": "",
    "title": "NEWS ALERT: Three GOP states sue over end of Title 42"
  },
  {
    "id": 7390,
    "mediaId": 2573,
    "date": "2022-04-04",
    "sentence": "\"We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,\" Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said Monday morning on \"FOX & Friends.\"",
    "author": "Adam Shaw",
    "title": "Republican states sue to stop Biden admin’s lifting of Title 42 border policy"
  },
  {
    "id": 7828,
    "mediaId": 6503,
    "date": "2022-04-05",
    "sentence": "“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” said Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Warner Todd Huston",
    "title": "GOP-Led States Sue to Prevent Biden from Canceling Immigration Rules and Pushing Wide Open Border Policy"
  },
  {
    "id": 7901,
    "mediaId": 6551,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said Monday morning on \"FOX & Friends:\"\nWe want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things.",
    "author": "",
    "title": "Several States Sue to Stop Biden's Ending of Title 42"
  },
  {
    "id": 7580,
    "mediaId": 2520,
    "date": "2022-04-06",
    "sentence": "Shortly after the 2020 presidential election Attorney General <span class='selected-term'>Mark Brnovich</span> appeared on Fox Business, where he was asked about unsubstantiated claims of election fraud in Arizona.",
    "author": "EJ Montini",
    "title": "Arizona Attorney General Mark Brnovich's election fraud investigation turns up bupkis"
  },
  {
    "id": 7091,
    "mediaId": 2573,
    "date": "2022-04-06",
    "sentence": "Arizona's AG <span class='selected-term'>Mark Brnovich</span> called the administration's decision to rescind Title 42: \"one of the most boneheaded decisions of this administration\" and pointed out the public safety concern of doing so:\n\"While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,\" Brnovich said in a statement.",
    "author": "Elizabeth Heckman",
    "title": "Rep. McCaul torches Biden admin over Title 42: 'I have never seen the border this bad'"
  },
  {
    "id": 7717,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Arizona attorney general <span class='selected-term'>Mark Brnovich</span> issued a report Wednesday that found no evidence of widespread voter fraud or irregularities in Maricopa County, despite Trump's persistent pressure campaign to justify his false claims about his election loss, and the \"Morning Joe\" host said he's had enough.",
    "author": "Travis Gettys",
    "title": "Morning Joe hammers GOP 'freaks' still clinging to Trump's election lies"
  },
  {
    "id": 7618,
    "mediaId": 2627,
    "date": "2022-04-07",
    "sentence": "“The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump added.",
    "author": "Steve Benen",
    "title": "Arizona AG fails to produce the election evidence Trump demanded"
  },
  {
    "id": 7334,
    "mediaId": 2658,
    "date": "2022-04-09",
    "sentence": "Both Missouri Attorney General Eric Schmitt and Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> are running for the Senate in November.",
    "author": "",
    "title": "Republicans see CDC’s policy change as ‘massive political loser for Democrats’"
  },
  {
    "id": 5831,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "opinion contributor\nEarlier this month, Arizona Republic columnist Bob Robb argued that GOP Attorney General <span class='selected-term'>Mark Brnovich</span> is failing to fulfill his basic duties by refusing to defend Arizona’s mail-in voting system and is using the AG’s Office to advance his own political ambitions.",
    "author": "Kris Mayes",
    "title": "Mark Brnovich refused to defend election law, but that's not his only sin"
  },
  {
    "id": 5196,
    "mediaId": 2553,
    "date": "2022-04-18",
    "sentence": "On behalf of the citizens of our states, we demand you immediately take the actions outlined above to reverse the damage you have done and provide relief for struggling families and businesses.”\nIn addition to Knudsen, signers include Steve Marshall of Alabama, Treg R. Taylor of Alaska, <span class='selected-term'>Mark Brnovich</span> of Arizona, Leslie Rutledge of Arkansas, Ashley Moody of Florida, Todd Rokita of Indiana, Jeff Landry of Louisiana, Lynn Fitch of Mississippi, Eric Schmitt of Missouri, John O’Connor of Oklahoma, Alan Wilson of South Carolina, Ken Paxton of Texas, Sean Reyes of Utah, Patrick Morrisey of West Virginia, and Bridget Hill of Wyoming.",
    "author": "Gabe Kaminsky",
    "title": "16 Republican States Demand Biden Reinstate Keystone XL Pipeline"
  },
  {
    "id": 5993,
    "mediaId": 2664,
    "date": "2022-04-18",
    "sentence": "\"The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump ranted in the 2021 statement.",
    "author": "Sarah K. Burris",
    "title": "Trump posts angry anti-endorsement for Arizona AG who refused to help change election results"
  },
  {
    "id": 5541,
    "mediaId": 2550,
    "date": "2022-04-21",
    "sentence": "State Attorney General <span class='selected-term'>Mark Brnovich</span> is perhaps the best known of the contenders for the Republican nomination, but Trump is passing him over as insufficiently nutty and disloyal.",
    "author": "",
    "title": "How Putting Voting Rights on the Arizona Ballot Will Help Keep Control of the U.S. House and Senate"
  },
  {
    "id": 5747,
    "mediaId": 2589,
    "date": "2022-04-22",
    "sentence": "As Arizona AG and Republican Senate candidate <span class='selected-term'>Mark Brnovich</span> pointed out in its challenge, the White House and DHS hasn’t followed the Administrative Procedure Act (APA) process for the rule change, and courts take the APA very seriously:\nThe Biden administration has a pattern of unlawfully circumventing correct processes required under the Administrative Procedure Act (APA).",
    "author": "Ed Morrissey",
    "title": "Biden to Dems: We're ending Title 42 no matter how much you complain"
  },
  {
    "id": 5937,
    "mediaId": 2692,
    "date": "2022-04-22",
    "sentence": "“It’s a completely unserious attempt to demand extraordinary, military-?style measures to stop completely mundane actions like walking around a closed port of entry to file asylum paperwork or violating international labor market regulations in order to fill one of the 10 million job openings in this country.”\nThe idea of a border “invasion” under the U.S. Constitution has already taken off in Arizona, where the Republican attorney general, <span class='selected-term'>Mark Brnovich</span>, issued a legal opinion in February that said the “violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an ‘invasion’ under the U.S. Constitution, and Arizona therefore has the power to defend itself” via its own executive branch.",
    "author": "Patrick Svitek",
    "title": "Some Texas Republicans push for Gov. Greg Abbott to use state personnel to deport migrants"
  }
]