[
  {
    "id": 2749,
    "mediaId": 8326,
    "date": "2022-02-02",
    "sentence": "The lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Senate candidate and ally of former President Donald Trump.",
    "author": "Chelsey Cox",
    "title": "Arizona GOP Chair Kelli Ward, spouse, sue to block Jan. 6 panel from accessing phone records"
  },
  {
    "id": 3420,
    "mediaId": 2688,
    "date": "2022-02-02",
    "sentence": "According to Politico, the Wards’ lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, the wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> — an ally of former President Donald Trump who is running for Senate.",
    "author": "Cristina Cabrera",
    "title": "Jan. 6 Committee Subpoenas Arizona GOP Chair And Her Husband’s Phone Records"
  },
  {
    "id": 3350,
    "mediaId": 2740,
    "date": "2022-02-03",
    "sentence": "The lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Senate candidate and ally of former President Donald Trump.",
    "author": "Chelsey Cox",
    "title": "Arizona GOP Chair Kelli Ward, spouse, sue to block Jan. 6 panel from accessing phone records"
  },
  {
    "id": 7580,
    "mediaId": 2520,
    "date": "2022-04-06",
    "sentence": "Shortly after the 2020 presidential election Attorney General <span class='selected-term'>Mark Brnovich</span> appeared on Fox Business, where he was asked about unsubstantiated claims of election fraud in Arizona.",
    "author": "EJ Montini",
    "title": "Arizona Attorney General Mark Brnovich's election fraud investigation turns up bupkis"
  },
  {
    "id": 7618,
    "mediaId": 2627,
    "date": "2022-04-07",
    "sentence": "“The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump added.",
    "author": "Steve Benen",
    "title": "Arizona AG fails to produce the election evidence Trump demanded"
  }
]