[
  {
    "id": 17225,
    "mediaId": 8350,
    "date": "2022-02-27",
    "sentence": "Settlement funds will be disbursed to the state and its subdivisions through the One Arizona Plan over an 18-year period to aid in treatment, preventative measures and for education, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in a press release.",
    "author": "KTAR.COM",
    "title": "Weekend wrap-up: Here are the biggest Arizona stories from Feb. 25-27"
  },
  {
    "id": 7711,
    "mediaId": 2520,
    "date": "2022-04-05",
    "sentence": "The Arizona Supreme Court has given Attorney General <span class='selected-term'>Mark Brnovich</span> another chance to argue some of his claims against a real estate deal between Arizona State University and Omni for a hotel and conference center in downtown Tempe.",
    "author": "Alison Steinbach",
    "title": "Arizona Supreme Court allows Brnovich to continue to challenge parts of ASU-Omni hotel deal"
  },
  {
    "id": 8011,
    "mediaId": 8345,
    "date": "2022-04-05",
    "sentence": "PHOENIX – The Arizona Supreme Court on Tuesday revived a lawsuit filed by Attorney General <span class='selected-term'>Mark Brnovich</span> against the board that oversees the state's three public universities over a hotel development agreement, giving him the right to try to prove the deal doesn't benefit taxpayers.",
    "author": "",
    "title": "AZ high court revives AG suit against ASU hotel"
  },
  {
    "id": 8742,
    "mediaId": 8347,
    "date": "2022-04-05",
    "sentence": "TUCSON, Ariz. (KGUN) — Attorney General (AG) <span class='selected-term'>Mark Brnovich</span> has announced the first execution warrant issued across Arizona in eight years.",
    "author": "Caleb J. Fernández",
    "title": "AG Brnovich announces first execution warrant issued across Arizona in eight years"
  },
  {
    "id": 7545,
    "mediaId": 2680,
    "date": "2022-04-05",
    "sentence": "PHOENIX (AP) — The Arizona Supreme Court on Tuesday revived a lawsuit filed by Attorney General <span class='selected-term'>Mark Brnovich</span> against the board that oversees the state's three public universities over a hotel development agreement, giving him the right to try to prove the deal doesn't benefit taxpayers.",
    "author": "BOB CHRISTIE",
    "title": "Arizona high court revives AG's suit against ASU hotel plan"
  }
]