[
  {
    "id": 913,
    "mediaId": 8475,
    "date": "2022-02-14",
    "sentence": "Opinion\nGuest opinion\nIt’s impossible to overstate just how lawless and dangerous Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> showed himself to be this month when he issued a flagrantly political legal opinion that all but dares Gov.",
    "author": "Jim Small",
    "title": "Arizona AG Brnovich’s radical, lawless border war opinion normalizes extremism - sets stage for violence"
  },
  {
    "id": 40,
    "mediaId": 2572,
    "date": "2022-02-21",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> asked the state's Supreme Court last month to set briefing schedules so that his office can file execution warrants for Frank Atwood and Clarence Dixon.",
    "author": "Paul Best",
    "title": "Arizona Jewish community leaders sue state over potential use of cyanide gas in executions"
  },
  {
    "id": 14011,
    "mediaId": 8347,
    "date": "2022-03-18",
    "sentence": "According to Attorney General <span class='selected-term'>Mark Brnovich</span>, Marie Dahlstrom is accused of gambling away the funds at casinos.",
    "author": "Phil Villarreal",
    "title": "Tucson woman indicted for allegedly embezzling $5.3 million"
  },
  {
    "id": 8742,
    "mediaId": 8347,
    "date": "2022-04-05",
    "sentence": "TUCSON, Ariz. (KGUN) — Attorney General (AG) <span class='selected-term'>Mark Brnovich</span> has announced the first execution warrant issued across Arizona in eight years.",
    "author": "Caleb J. Fernández",
    "title": "AG Brnovich announces first execution warrant issued across Arizona in eight years"
  },
  {
    "id": 5943,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "The Arizona Democratic Party on Monday asked Attorney General <span class='selected-term'>Mark Brnovich</span> to investigate how commissioners decided to move Rogers and two other Republican state legislators – Sens.",
    "author": "Laurie Roberts",
    "title": "Did Arizona illegally redraw voting districts just to help Sen. Wendy Rogers?"
  }
]