[
  {
    "id": 3631,
    "mediaId": 2520,
    "date": "2022-01-24",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is no longer attorney general.",
    "author": "EJ Montini",
    "title": "Arizona Attorney General Mark Brnovich turns a blind eye to fake Trump electors"
  },
  {
    "id": 1397,
    "mediaId": 2540,
    "date": "2022-02-17",
    "sentence": "The nominal frontrunner is probably state Attorney General <span class='selected-term'>Mark Brnovich</span> but no one -- in Arizona or Washington -- sees him as a top tier challenger to Kelly.",
    "author": "Chris Cillizza",
    "title": "Donald Trump may be single-handedly costing Republicans a Senate seat"
  },
  {
    "id": 14011,
    "mediaId": 8347,
    "date": "2022-03-18",
    "sentence": "According to Attorney General <span class='selected-term'>Mark Brnovich</span>, Marie Dahlstrom is accused of gambling away the funds at casinos.",
    "author": "Phil Villarreal",
    "title": "Tucson woman indicted for allegedly embezzling $5.3 million"
  },
  {
    "id": 11675,
    "mediaId": 8345,
    "date": "2022-03-22",
    "sentence": "She said the county has not sufficiently cooperated with a request for records from Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "",
    "title": "Arizona Senate GOP revives election bill"
  },
  {
    "id": 9547,
    "mediaId": 2748,
    "date": "2022-03-28",
    "sentence": "Last week, President Trump released a statement saying, “now is finally the time for the Arizona Attorney General to issue warrants and take his investigation to the next level.”\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> has done nothing to hold these criminals accountable.",
    "author": "Women System",
    "title": "Maricopa County Supervisors Refuse To Attend Meeting After Arizona State Senate Issues New 2020 Election Subpoena"
  },
  {
    "id": 9056,
    "mediaId": 2834,
    "date": "2022-03-28",
    "sentence": "Arizona attorney general <span class='selected-term'>Mark Brnovich</span> has launched an antitrust investigation into this collusion.",
    "author": "Michael G. Zey",
    "title": "What Happens When a GOP Majority Can Investigate the Jan. 6 Committee?"
  },
  {
    "id": 7441,
    "mediaId": 2520,
    "date": "2022-04-01",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> let his bid for U.S. Senate get in the way of his duty to defend Arizona election law, columnist Robert Robb says.",
    "author": "",
    "title": "Is AG Mark Brnovich ignoring his job just to appease Trump voters?"
  },
  {
    "id": 8005,
    "mediaId": 8326,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>’s probe of Maricopa County’s 2020 election thus far has found “serious vulnerabilities” in procedures but no crimes, according to an initial report released Wednesday on the monthslong investigation.",
    "author": "Mary Jo Pitzl",
    "title": "Attorney general's report on election in Maricopa County questions procedures, doesn't allege wrongdoing"
  },
  {
    "id": 7618,
    "mediaId": 2627,
    "date": "2022-04-07",
    "sentence": "“The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump added.",
    "author": "Steve Benen",
    "title": "Arizona AG fails to produce the election evidence Trump demanded"
  },
  {
    "id": 7334,
    "mediaId": 2658,
    "date": "2022-04-09",
    "sentence": "Both Missouri Attorney General Eric Schmitt and Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> are running for the Senate in November.",
    "author": "",
    "title": "Republicans see CDC’s policy change as ‘massive political loser for Democrats’"
  },
  {
    "id": 5943,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "The Arizona Democratic Party on Monday asked Attorney General <span class='selected-term'>Mark Brnovich</span> to investigate how commissioners decided to move Rogers and two other Republican state legislators – Sens.",
    "author": "Laurie Roberts",
    "title": "Did Arizona illegally redraw voting districts just to help Sen. Wendy Rogers?"
  },
  {
    "id": 5353,
    "mediaId": 2557,
    "date": "2022-04-19",
    "sentence": "https://t.co/Pgogo9A7uO\n— <span class='selected-term'>Mark Brnovich</span> (@GeneralBrnovich) April 6, 2022\nBelow is Trump’s statement as he responded to the report:\nAttorney General Brnovich of Arizona was given massive information on the fraud and so-called ‘irregularities’ that took place in the 2020 Presidential Election.",
    "author": "DML News App",
    "title": "NEWS ALERT: AZ AG admits issues with 2020 election, Trump unleashes on him in scorching rebuke"
  },
  {
    "id": 5541,
    "mediaId": 2550,
    "date": "2022-04-21",
    "sentence": "State Attorney General <span class='selected-term'>Mark Brnovich</span> is perhaps the best known of the contenders for the Republican nomination, but Trump is passing him over as insufficiently nutty and disloyal.",
    "author": "",
    "title": "How Putting Voting Rights on the Arizona Ballot Will Help Keep Control of the U.S. House and Senate"
  },
  {
    "id": 5106,
    "mediaId": 8268,
    "date": "2022-04-22",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> will have to soldier on in the race for the Republican nomination for U.S. Senate without Donald Trump's endorsement – and perhaps with the former president actively opposing his candidacy.",
    "author": "Nick Phillips",
    "title": "After Trump statement, a new reality for Brnovich"
  }
]