{
  "id": 11412,
  "mediaId": 8329,
  "date": "2022-03-11",
  "headline": "The ‘genius’ argument to BANNING ESG that America may need",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTUyNTQyMC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY5MzYwNDQ3OH0.YdgSpdogQsbQ4fRY7MEevcFPoX-5XDlEw927_X9AfHw/img.jpg?width=1200&coordinates=0%2C80%2C0%2C0&height=600",
  "link": "https://www.glennbeck.com/radio/the-genius-argument-to-banning-esg-that-america-may-need",
  "mediaOutlet": "glennbeck.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3401,
    1356,
    1115,
    458,
    454,
    5949,
    6509,
    6678
  ],
  "sentences": [
    "But I do think that if your 401(k), or your pension plans, your retirement savings are being used to facilitate a political agenda by big banks and big money managers, that very well could be a form of collusion, that's harming consumers.",
    "I know I've sued the universities over everything from giving tuition, to people who don't have legal status, to what they're doing with their sweetheart real estate deals.",
    "That, even though these climate activists -- the pointy-headed liberals think they know best, literally, we see what's going on in the world, and it proves more than ever.",
    "So, ultimately, this is the far left, that neo-Marxist goal of, I want to, but the Marxists are going to control the financial institutions and the woke money managers.",
    "And financial institutions are being pressured, not to invest or not to provide any sort of funding for oil, gas, things that essentially made us energy independent.",
    "By the way, did you know that that was -- another story I have to tell you -- did you know that that was a big deal, leading up to Abraham Lincoln, the Wide Awake?",
    "Incoming posts containing content related -- rated by a third party fact-checker, uh-huh, as false are declined before they're even seen in the group.",
    "Facebook's parent company, meta,has announced a new tool that will automatically delete posts containing misinformation, before they're published.",
    "The other updates, include the ability to suspend page members and automatically decline member requests from users via the admin assist page.",
    "Glenn’s warned you about the dangers of ESG for months now, and several states in the U.S. currently are trying to pass legislation to ban it.",
    "When, you know, they -- they just -- they call each other, and they say, boy, you're really putting yourself at reputational risk.",
    "So we -- meaning, people like you, people like me, need to help make sure our kids understand what's going on is crony capitalism.",
    "The suspension ability is an upgrade from Facebook's mute button, which can permanently prevent users from commenting on a page.",
    "MARK: Well, I think -- you know, once again, I've been a tried and trued principled conservative my entire life here in Arizona.",
    "But Arizona Attorney General Mark Brnovich may have a new argument to end ESG once and for all: it violates anti-law trust laws.",
    "And you're getting the neo-Marxist, socialist companies, that are feeding the alligator, and hoping that they eat them last.",
    "And no person worth their salt is ever going to say, what are they going to do, before they get all the facts and evidence?",
    "Brnovich explains to Glenn all the details…\nTranscript\nBelow is a rush transcript that may contain errors\nGLENN: All right.",
    "And you can -- I mean, the agreements that the banks have signed, have said, we're getting out of this kind of business.",
    "Ever take a minute just to stop and go through the list of companies that you do business with, every day, in your head?",
    "We know that, well, he's -- under third party agreements, either formal or informal, that are restraining competition.",
    "And basically, these are far left, progressive, woke liberals, that want to control your life and your livelihood.",
    "And like I said, we're seeing it with the money managers, the bankers, that actually have a lot of influence.",
    "GLENN: So tell me how you view ESG, and what it means to the people of Arizona, and the people of the world.",
    "Anti-trust law said that, you can't have agreements between competitors, artificially between competition.",
    "By design, this is to usher in a stakeholder from shareholder capitalism, to stakeholder capitalism.",
    "When I saw your op-ed in the Wall Street Journal, I thought, this is a great angle to attack from.",
    "GLENN: And it -- it is -- would you agree, it is going to trickle down to the average individual?",
    "And I think especially, Glenn, in light of the events that we've seen the last couple of weeks.",
    "They might even work better for us, than it does for those who support all the leftist causes.",
    "So they're working for you, and I'm sure this is going to work, you know, for conservatives.",
    "And they will probably end up in court somewhere, fighting over what we can get and not get.",
    "I'm sure your listeners know, stands for the environmental, social, and governance movement.",
    "And they will use that, as Lenin said, the proverbial, using our own rope to hang us with.",
    "And I think that very often, the left comes up, and is consistent at pushing their agenda.",
    "And honestly, a lot of capitalists, who think, I can't tell the free market, what to do.",
    "The United States and our security depends on being energy independent, and not woke.",
    "STU: Well, this relates pretty closely to Patriot Mobile and the stuff that they do.",
    "Which means, you're going to be put out of business, if you don't get on this side.",
    "And high energy costs, as we all know, ends up that we pay more for our groceries.",
    "They essentially have been organizing or, you know, the Wall Street Journal banks.",
    "But all of the companies, that we do business with, governor too -- do they align?",
    "These new tools will help administrators prevent the spread of misinformation.",
    "And we know, and I know, that this isn't going to stop in the energy industry.",
    "And are essentially inviting people to clued to advance their far left agenda.",
    "And unfortunately, I think that a lot of times, people see what's going on.",
    "And I think this one has a really good chance of making a huge difference.",
    "That every revolution will eventually eat itself because the -- the left.",
    "These banks, these money managers, are playing footsy with the far left.",
    "And we've already started to get some materials, and we're reviewing it.",
    "And our folks, us on the right, need to think sometimes outside the box.",
    "The oil companies are -- the gas and coal companies can't get financing.",
    "Though he’s still investigating the idea, this COULD be the key we need.",
    "And we saw part of it going on, with China, with the individual scores.",
    "Communities can only thrive, as places to connect, when they are safe.",
    "My book is full of footnotes, on all of the things that you're doing.",
    "Last night, I showed a chart of all the companies that are involved.",
    "And a lot of it is legally and ethically, we can't --\nGLENN: Yeah.",
    "We're no longer going to make loans, to these kinds of businesses.",
    "And you know that incremental life -- the left is very organized.",
    "This impact, that it will have, on every single person listening.",
    "We've already seen this with things like the firearms industries.",
    "Obviously, you know, when we're -- we're not drilling into Anwar.",
    "He wrote an op-ed, in the Wall Street Journal, a couple days ago.",
    "Now pages can temporarily suspend users for a set period of time.",
    "Is it like a week ago, there are no weapons of mass destruction?",
    "But I will tell you, do not dismiss the pushback from the right.",
    "Bite, this portion of the program, brought to you by Coca-Cola.",
    "STU: Now, you have gone to Disney approximately 115,000 times.",
    "And so what -- we don't, unfortunately, have that free market.",
    "Is it that kind of misinformation, that changes all the time?",
    "That will probably lead to more subpoenas, more discussions.",
    "And they're using that, basically to drive that woke agenda.",
    "But unfortunately, the left has some lawyers and lobbyists.",
    "And a lot of it, quite frankly, is confidential by statute.",
    "And they have the media on their side and everything else.",
    "How they're trying to get young people to aid our country.",
    "There's always going to be something else they need to do.",
    "And that's why I made that reference to crony capitalism.",
    "Pressures on banks, to be very woke and very progressive.",
    "GLENN: Well, I just think this is genius, quite honestly.",
    "It is -- it's like the mob, just a very buttoned up mob.",
    "And so now, the issue, Glenn, is what do we do about it?",
    "They have been holding things up in some states as well.",
    "So we'll do everything we can, to move quickly on this.",
    "Now, I would like to know, what that misinformation is.",
    "I mean, I won't be able to buy, perhaps the car I want.",
    "MARK: Well, hopefully we actually started the process.",
    "By the way, one more story kind of along these lines.",
    "We know the folks that identified this problem issue.",
    "MARK: Glenn, you hit the nail on the head, as always.",
    "Anyway, it's weird that it's coming back, around now.",
    "Are there third party agreements that were strained?",
    "We have to hit them from all fronts, quite honestly.",
    "I am sure, they will probably object to some stuff.",
    "What happens with the ESG movement is being pushed.",
    "And we've seen this manifest itself most recently.",
    "You know, if you have any sort of retirement plan.",
    "So why do you say this is an anti-trust violation?",
    "So be -- be very wary of the Republicans, as well.",
    "And what they do, they put pressure on companies.",
    "That result in collusion, that harmed consumers.",
    "Reminding you, if you're white, you're a racist.",
    "He was getting -- I'm getting a word in my ear.",
    "Any time, there's this type of stuff going on.",
    "It always affects us, in such a positive way.",
    "Living in the greatest country in the world.",
    "Your research does come back, and say, yeah.",
    "They will never be far left enough for them.",
    "And eventually, they will destroy this one.",
    "MARK: I assure you, we take this seriously.",
    "STU: That's the way it always works for us.",
    "By the way, I hate the Walt Disney company.",
    "There are a lot of these RINO Republicans.",
    "MARK: And so we've begun an investigation.",
    "Our standards on social justice are this.",
    "The sweetheart real estate insider deals.",
    "And they try to make it miserable for us.",
    "GLENN: Well, thank you, very much, Mark.",
    "And manage interactions, in their group.",
    "And it's slow and steady wins the race.",
    "You know, I'm playing with house money.",
    "He's the attorney general from Arizona.",
    "Did you see what the CEO did yesterday?",
    "GLENN: So when will you have an answer?",
    "What's going on in public universities.",
    "And I can't imagine, you can't find it.",
    "So everything from the price of energy.",
    "We'll see it with religious liberties.",
    "So I have certain tools in my toolbox.",
    "Incoming posts, according to Facebook.",
    "They are a company that is wide awake.",
    "The Wide Awakers, or Wide Awake Club?",
    "Patriot Mobile is not a woke company.",
    "I will tell you, almost none of them.",
    "Let me tell you about Patriot Mobile.",
    "Because my ESG score will be too low.",
    "You know, people like climate action.",
    "I'm not saying, for sure it's going.",
    "I can't think of any way to stop it.",
    "So I don't back down from the fight.",
    "Kind of looks like we are involved.",
    "So they'll play for time sometimes.",
    "ESG may be an anti-trust violation.",
    "He's the Arizona attorney general.",
    "People especially in this country.",
    "MARK: To the people of the world.",
    "And I know you talked about this.",
    "Who gets to run for what office.",
    "I'm a first generation American.",
    "We'll follow that story for you.",
    "And I said, well, wait a minute.",
    "And there's a cult on our right.",
    "I can guarantee you, it will be.",
    "I hate the Walt Disney company.",
    "And I have the biggest -- yes.",
    "Because they want to be green.",
    "And they're using your 401(k).",
    "That means high energy costs.",
    "Welcome to the program, Mark.",
    "And what they've been doing.",
    "Trillion with a T in assets.",
    "It's the fossil fuel haters.",
    "And you're absolutely right.",
    "I own a lot of Walt's stuff.",
    "Talk about this in a second.",
    "Please, keep us up to speed.",
    "And kind of pick and choose.",
    "This is not the free market.",
    "And we all know -- you know.",
    "And they're already on that.",
    "That's what I'm fighting on.",
    "This isn't the free market.",
    "Well, they love us so much.",
    "It's the woke, neo-Marxist.",
    "Or we're not doing permits.",
    "Thanks for all that you do.",
    "Let me go to Mark Brnovich.",
    "They want to be socialist.",
    "Please, do the commercial.",
    "So, Mark, I appreciate it.",
    "You do have certain leaps.",
    "My family fled communism.",
    "And all this other stuff.",
    "And they choose to do it.",
    "From a legal perspective.",
    "I think I can prove that.",
    "And I will keep fighting.",
    "We pay more for our milk.",
    "So we know this is wrong.",
    "MARK: Yeah, this really.",
    "Thanks for having me on.",
    "I'm a public school kid.",
    "And what does this path?",
    "And get the information.",
    "You know, we're hoping.",
    "MARK: Thank you, Glenn.",
    "Your investment funds.",
    "And I understand that.",
    "Critical Race Theory.",
    "Et cetera, et cetera.",
    "In the energy sector.",
    "The attorney general.",
    "I love this approach.",
    "And it is happening.",
    "Your listeners know.",
    "What does that mean?",
    "These are companies.",
    "GLENN: You know me.",
    "I love Walt Disney.",
    "What they're doing.",
    "And money managers.",
    "I understand that.",
    "MARK: Absolutely.",
    "I am the biggest.",
    "GLENN: Hate them.",
    "GLENN: Hate them.",
    "The social basis.",
    "The key to this.",
    "What's going on.",
    "GLENN: Correct.",
    "GLENN: It does.",
    "Mark Brnovich.",
    "Don't be woke.",
    "Be wide awake.",
    "I appreciate.",
    "To this week.",
    "1619 Project.",
    "The far left.",
    "So banks now.",
    "GLENN: Okay.",
    "GLENN: Yeah.",
    "Look, Glenn.",
    "GLENN: Yeah.",
    "No bio labs?",
    "65 million.",
    "All right.",
    "Hate them.",
    "Hate them.",
    "STU: What?",
    "STU: Why?",
    "Trillion.",
    "100-plus.",
    "Never.",
    "Yeah.",
    "Yeah.",
    "ESG."
  ]
}