{
  "id": 11744,
  "mediaId": 8475,
  "date": "2022-03-23",
  "headline": "Arizona judge tosses law that would have ended precinct committee elections",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/031022_elephant-donkey_2.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/032322_pc_elections/arizona-judge-tosses-law-that-would-have-ended-precinct-committee-elections/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The judge also said the abolition of elections for PCs “is not rationally related to a legitimate legislative purpose.”\n“The classification is not sufficiently general to encompass all members similarly situated because it only applies to persons seeking to run for election as party precinct committeepersons and the electors desiring to vote for them, but excludes all other candidates for elective office in federal and state elections and electors desiring to vote for them,” Napper ruled.",
    "Because some PC candidates would not be able to file their nominating petitions to qualify for the ballot until well into the period for submitting them to election officials, the counties proposed having political parties appoint them for the 2022 term instead.",
    "A Yavapai County judge struck down a controversial law eliminating elections this year political party activists known as precinct committeemen, an issue that many voted for without realizing it and which riled up the Republican base.",
    "When legislative vacancies occur, PCs from the district and party of the lawmaker who previously held the seat select three finalists for the position, with the county board of supervisors making the final decision.",
    "But they needed Democratic votes in order to pass the new law with an emergency clause that would allow the elections to be held this year, and the minority party was largely unwilling to support the proposals.",
    "The law temporarily converted PCs, as they’re usually called, into positions that are appointed by county political parties, rather than chosen by voters in the primary election.",
    "County election officials said the change was needed to deal with issues caused by delays in census data and redistricting, which prolonged the process for drawing new precincts.",
    "The issue was expected to be part of an upcoming special session, though Republicans didn’t have enough votes to enact the change in time for it to make a difference.",
    "Because the law passed with an emergency clause, which requires at least a two-thirds supermajority in both legislative chambers, it went into effect immediately.",
    "“WE THE PEOPLE ARE UNSTOPPABLE.”\nFew PC elections are actually contested, and those that don’t have more candidates than positions don’t appear on the ballot.",
    "Republican lawmakers, Attorney General Mark Brnovich and the Arizona Republican Party lauded the ruling and the reinstatement of PC elections for this year.",
    "Napper ruled that the legislature violated a provision of the state constitution prohibiting “local or special laws” pertaining to the conduct of elections.",
    "He noted that the law singled out one office, precinct committeemen, for discrimination apart from other local, state and federal candidates.",
    "They vote for leadership positions in their districts and for members of their parties’ state committees, who select state-level leadership.",
    "Judge John Napper ruled after hearing arguments on Tuesday that the disputed provision of House Bill 2839 violates the Arizona Constitution.",
    "The law was part of a larger bill related to signature requirements for legislative and congressional candidates to qualify for the ballot.",
    "Rather than defend the law scrapping PC elections, the Attorney General’s Office acknowledged that it violated the Arizona Constitution.",
    "Out of 748 precincts in Maricopa County, only 18 Republican PC races and three Democratic races were contested in 2020.",
    "The elimination of PC elections for 2022 enraged Republican activists and put GOP lawmakers under tremendous pressure.",
    "The Arizona Republican Party filed a lawsuit against the Yavapai County Elections Department challenging the law.",
    "PCs are the elected, voting members of political parties’ legislative district-level organizations.",
    "The deadline for precinct committeeman candidates to file their nominating petitions is April 4.",
    "The elections department was later removed as a defendant, replaced by the State of Arizona.",
    "Write-in candidates have until April 18 to file with their county elections departments.",
    "Though Democrats have PCs as well, Republicans view the position as far more important.",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "Republicans in both legislative chambers passed bills to restore the elections.",
    "In 2018, it was only nine Republican PC races and one Democratic race.",
    "Join Ehud Gavron, Marin Sardy, and Regina Parks and contribute today!",
    "Instead, the candidates are simply deemed elected under Arizona law.",
    "“PC ELECTIONS ARE GREAT AGAIN!” the AZGOP tweeted.",
    "- 30 -"
  ]
}