{
  "id": 12068,
  "mediaId": 8251,
  "date": "2022-03-25",
  "headline": "Allister Adel out as Maricopa County Attorney",
  "image": "https://media.12news.com/assets/KPNX/images/065be1cf-5fa9-4350-9221-e27652cbe8f8/065be1cf-5fa9-4350-9221-e27652cbe8f8_1140x641.jpg",
  "link": "https://www.12news.com/article/news/local/allister-adel-out-as-maricopa-county-attorney/75-e3f0d5b6-5328-46e5-89c8-eef9abe00412",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“There needs to be a plan put into place to say, ‘We’ve got to address these shortages.’ You cannot continue to have more and more crime in a larger and larger county with fewer and fewer people and expect the work to get done,” Mitchell said.",
    "“That’s where we’re at now and that needs to be restored.”\nA county spokesperson said Adel’s Chief Deputy, Ken Vick, is now in charge of the office until an interim county attorney is appointed by the Maricopa County Board of Supervisors.",
    "On Friday, Mass Liberation Arizona held a press conference in front of the Maricopa County Attorney’s Office celebrating Adel’s final day and called for additional people inside the office to resign because of the issues.",
    "“It happens when you have an office that is drastically low in staff and just overwhelmed by the numbers,” Rachel Mitchell, a top prosecutor at MCAO told Team 12’s, Brahm Resnik.",
    "The Maricopa County Attorney’s Office also has to turn a report into Attorney General Mark Brnovich on the 180 dropped misdemeanor cases from 2020 that were forgotten about.",
    "“We still had to retraumatize ourselves to tell these stories in order to even get a small amount of people to believe us, let alone make this happen,” Franks said.",
    "The spokesperson said that the Board of Supervisors has not yet discussed how appointing an interim county attorney will work yet.",
    "Kenneth Countryman is a defense attorney who represented one of the protestors who had the bogus charges dropped against them.",
    "Franks is a spokesperson with Mass Liberation Arizona and one of the people directly affected by being falsely charged.",
    "While Adel is off the job, there are issues from her tenure that are leaving an impact on the community and the office.",
    "Countryman said he’d like to see someone from outside the office come in and help take the office forward.",
    "Mitchell confirms there’s also a large backlog of felony cases that haven’t been reviewed by prosecutors.",
    "ARIZONA, USA — Allister Adel is officially no longer the head of the Maricopa County Attorney’s Office.",
    "“You just have a fundamental lack of trust and integrity in the justice system,” Countryman said.",
    "A spokesperson confirmed to 12 News there has not been a resolution in those investigations yet.",
    "Mitchell was also among the deputy chiefs at MCAO who called for Adel to resign in February.",
    "But, that person will take over until a new county attorney is elected in November.",
    "Adel resigned Monday after controversies and repeated calls for her resignation.",
    "“We didn't get here by just taking what they gave us,” Bruce Franks Jr. said.",
    "Among them, are bogus charges against protestors that were later dropped.",
    "Catch up on the latest news and stories on the 12 News YouTube channel.",
    "Adel is still facing investigations from The State Bar of Arizona.",
    "Mitchell is now running to replace Adel.",
    "Subscribe today."
  ]
}