{
  "id": 12308,
  "mediaId": 8295,
  "date": "2022-03-23",
  "headline": "Judge blocks DHS rule that would have limited deportation requirements",
  "image": "https://cronkitenews.azpbs.org/wp-content/uploads/2022/03/icevest-1024.jpg",
  "link": "https://cronkitenews.azpbs.org/2022/03/23/judge-blocks-dhs-rule-that-would-have-limited-deportation-requirements/",
  "mediaOutlet": "cronkitenewsonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camila Pedrosa",
  "authorUrl": "https://cronkitenews.azpbs.org/people/camila-pedrosa/",
  "termIds": [
    0
  ],
  "sentences": [
    "But a U.S. district judge in southern Ohio ruled Tuesday that the Department of Homeland Security cannot “displace clear congressional command in the name of resource allocation.”\nJudge Michael J. Newman said the DHS rules may have skirted federal laws that mandate deportation for noncitizens who reside in the U.S. illegally with final orders of removal, and he ordered the agency to temporarily halt enforcement of the policy that was enacted in November.",
    "But Brnovich hailed the ruling as a “tremendous victory for the rule of law and the safety of our communities.”\n“Since assuming office, the Biden administration has undermined our immigration laws and our law enforcement agencies, while empowering dangerous cartels and criminals on both sides of the border,” he said in a prepared statement.",
    "Besides overstepping its authority, the states argued that the DHS guidance imposed a financial burden on them by forcing states to spend funds on services for those who are allowed to stay in the U.S. Newman said in his ruling that DHS expelled 10 times more people in the first half of 2019 than it did in the first half of 2021.",
    "In that notice, Mayorkas said that the agency did not have the resources to deport every one of the estimated 11 million “undocumented or otherwise removable noncitizens” in the U.S.\n“Therefore, we need to exercise our discretion and determine whom to prioritize for immigration enforcement action,” his guidance said.",
    "It went on to say that agents would “prioritize for apprehension and removal noncitizens who are a threat to our national security, public safety, and border security.”\nUnder federal law, migrants who are subject to deportation for committing certain crimes must be detained pending expulsion proceedings.",
    "The new guidance would have limited that to cases of terrorism, espionage and unlawful entry – in all other cases, the agency would weigh factors, like the seriousness of the charge and criminal history, against the person’s age, time in the U.S., military service and any impact on the family.",
    "Immigration and Customs Enforcement)\nWASHINGTON – A federal court this week blocked a Biden administration regulation that would have given border officials more flexibility on deportations to let officers focus limited resources on deporting those who pose the greatest threat.",
    "“If you have executives, including appointed Cabinet secretaries, simply saying, ‘I don’t like the laws as they’re written, and I’m going to just refuse to enforce them,’ then what you’re getting into is dictatorship in four-year increments,” he said.",
    "“It’s complete subterfuge to say that we don’t have the resources to do more.”\nChishti said Newman’s ruling is likely to be appealed, and that this is not likely the last lawsuit filed by Republican-led states against the Biden administration.",
    "“To say that this administration is the first one to do it is obviously wrong and goes against every historical precedent on this,” said Muzaffar Chishti, a senior fellow and director of MPI’s office at New York University School of Law.",
    "But an expert with the Migration Policy Institute said that every administration going back to President Gerald Ford in the 1970s has had to prioritize action against certain categories of immigrants over others.",
    "Border-security advocates agreed with Brnovich, however, saying the Biden administration overstepped its executive authority to make decisions on immigration with this policy.",
    "“There’s more to every person than a mistake that they make,” said Jose Patiño, vice president of education and external affairs at Aliento, an Arizona-based advocacy group.",
    "But immigration advocates said the ruling would “create more trauma for children and the families” by mandating a harsh response to even the smallest of offenses.",
    "“The implications of this go actually go far beyond the immigration policy,” said Ira Mehlman, media director for the Federation for American Immigration Reform.",
    "A judge recently blocked a plan aimed at letting officers better allocate their time and resources by giving them greater discretion in deportation enforcement.",
    "Arizona was one of three states that challenged the policy, which Arizona Attorney General Mark Brnovich derided as “catastrophic lawlessness” in a statement.",
    "Arizona, joined by Montana and Ohio, sued to stop the policy that they said was unlawful, and Newman agreed, saying DHS overstepped its authority.",
    "At issue was the “permanent guidance” from Homeland Security Secretary Alejandro Mayorkas to Immigration and Customs Enforcement last fall.",
    "“Instead of private parties challenging, the state governments have stepped into the role as … the government in exile,” Chishti said.",
    "U.S. Immigration and Customs Enforcement officers detain an undocumented immigrant accused of a crime in this 2019 file photo.",
    "“Clearly, they have a lot more capacity,” Mehlman said of ICE, pointing to the 2019 numbers.",
    "“We can now expect almost every administrative action … should be challenged by states.”",
    "DHS did not immediately respond to a request for comment Wednesday.",
    "(Photo by Charles Reed/U.S."
  ]
}