{
  "id": 12385,
  "mediaId": 8251,
  "date": "2022-03-24",
  "headline": "Final Arizona election report finds no data issues from Maricopa County",
  "image": "https://media.12news.com/assets/KPNX/images/72b490d5-8afb-428c-af78-c39164e83c80/72b490d5-8afb-428c-af78-c39164e83c80_1140x641.jpg",
  "link": "https://www.12news.com/article/news/politics/final-arizona-election-report-no-data-issues-maricopa-county/75-32c96b01-eb52-4a3c-a4a7-f7e656a780eb",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "He also cast doubt on any analysis done by the Senate's “signature expert,” Shiva Ayyadurai, and said Sen. Kelly Townsend was “using the discredited work of Ayyadurai as a basis for this new subpoena.”\nArizona political news:\nSee the latest Arizona political news on the most recent segments of Sunday Square Off here.",
    "A report that was among the final items on the Arizona Senate's partisan review of the 2020 election prompted by former President Donald Trump's loss has found no evidence that ballot tabulation equipment used by the state's most populous county was connected to the internet.",
    "Republican Senate President Karen Fann had cut a deal with the county board last August for the outside report after pressing for months to access some equipment the county believed said was too sensitive to hand over to contractors the Senate hired to review the election.",
    "“The Board of Supervisors remains committed to free and fair elections that conform to federal and state laws.”\nDespite those findings, Republican Attorney General Mark Brnovich is still reviewing questions the Senate's “audit” raised about possible problems.",
    "Two weeks ago, he demanded the county turn over thousands of signatures and other records after an election conspiracy theorist said he compared signatures from public documents to those on mail-in election envelopes and said many did not match.",
    "One of the last items on the Arizona Senate’s partisan review of the 2020 election prompted by former President Donald Trump’s loss has found no evidence of problems\nPHOENIX — Editor's note: The above video aired during a previous broadcast.",
    "The report compiled by an outside special master and released by the Maricopa County Board of Supervisors on Wednesday “should be a final stake in the heart of the Senate’s so-called ‘audit,’” Board Chairman Bill Gates said in a statement.",
    "“Whenever impartial, independent, and competent people have examined the County’s election practices, they have found no reason to doubt the integrity of those practices,” said Gates, who is a Republican.",
    "In addition, there was no sign that any of the computer equipment in the county’s Office of Enterprise Technology, which provides computer support for all the huge county department's, was compromised.",
    "The county said they could not be handed over to the private firm the Senate hired last year to do a complete review of the county's 2020 election results and systems for security reasons.",
    "The Senate was responding to theories that hacking or the injection of ballots over an internet connection led to Trump's loss in the county and statewide to President Joe Biden.",
    "Republican former U.S. Rep. John Shadegg was hired to oversee the review of computer routers and logs that the board said contained information from across the county.",
    "In both cases, there was no evidence of “data deletion, data purging, data overwriting, or other destruction of evidence or obstruction of the audit,” the report said.",
    "Gates repeated that on Wednesday, and said the report from Shadegg was the latest in a long string of evidence that showed that the election was well run.",
    "A full hand-count of ballots and review of election equipment done by contractors hired by the Senate and released in September found no major problems.",
    "Gates said in a statement that the county had handed over thousands of records sought by the attorney general and would respond to the latest request.",
    "Their report said that the computers and ballot counting machines in the county's ballot tabulation center were never connected to the internet.",
    "The county has repeatedly said since the November 2020 election that it was free and fair and that its systems and equipment were secure.",
    "The report was the latest to find no evidence of any major problems with the election in Maricopa County.",
    "A state senator issued a new subpoena this week seeking the same records.",
    "Fann said she had not yet read the report and had no immediate comment.",
    "Shadegg then hired three computer experts to review the equipment."
  ]
}