{
  "id": 1450,
  "mediaId": 8475,
  "date": "2022-02-16",
  "headline": "Jewish community group sues Arizona over gas executions",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/prison_flag_100px_1.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/021622_az_execution_lawsuit/jewish-community-group-sues-arizona-over-gas-executions/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael McDaniel",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110078",
  "termIds": [
    0
  ],
  "sentences": [
    "Regardless of where people stand on the matter of capital punishment, it’s clear that use of this barbaric practice is cruel and must be abolished.”\nArizona's execution practices have been under heavy scrutiny since 2014, when it took almost two hours to execute convicted murderer Joseph Wood, who received an experimental cocktail of midazolam and hydromorphone because the preferred drug of lethal injections became unavailable following an export ban by the European Union in 2011.",
    "“It is appalling that Arizona has chosen to use the very same chemical compound that was used by the Nazis in Auschwitz to murder more than one million people.”\nThe suit, which names the Arizona Department of Corrections, Rehabilitation & Reentry, its Director David Shinn and Arizona Attorney General Mark Brnovich as defendants, also claims cyanide gas poisoning causes egregious pain and suffering.",
    "“This case does not challenge the State’s authority to impose capital punishment in certain cases; rather, Plaintiffs seek to prevent the grievous moral and constitutional injury of taxing Arizonans, including victims of the Holocaust, and effectively forcing them to subsidize and relive unnecessarily the same form of cruelty used in World War II atrocities,” the complaint states.",
    "“Approximately 80 Holocaust survivors currently call our state their home, and many of these survivors are horrified at being taxed to implement the same machinery of cruelty that was used to murder their loved ones,” said Tim Eckstein, chairman of the board of the Jewish Community Relations Council of Greater Phoenix, in a statement.",
    "The Arizona Department of Corrections has already spent thousands of dollars in taxpayer money to pay for the gas, inspect the gas chamber inside a prison in Florence, Arizona, and run tests, the complaint claims, adding that this process must happen every time the state seeks to execute one of the 17 people convicted before 1992.",
    "\"This process must be completed before anyone has even made an election on method, meaning that regardless of whether any of the remaining individuals eligible to elect lethal gas does so, additional Arizona taxpayer funds will be spent to further Defendants’ cyanide gas protocol,\" the complaint states.",
    "“Under no circumstances should the same method of execution used to murder over one million people, including Jews, during the Holocaust be used in the execution of people on death row,” Jared Keenan, senior staff attorney with the ACLU of Arizona, said in a statement.",
    "In a lawsuit filed Tuesday in Maricopa County Superior Court, the plaintiffs say using cyanide in executions, as the state once did and plans to do again, would be insulting to the Jewish community in Arizona, which includes Holocaust survivors.",
    "The Arizona Constitution was amended in 1992 to eliminate lethal gas as a method of execution, but Arizona prisoners condemned to death row prior to that have the option to choose between death by lethal injection or lethal gas.",
    "“Arizona has acknowledged the horrors of cyanide gas as a method of execution and eliminated it in all but a narrow set of cases — it’s time the court eliminates the use of cyanide gas for execution once and for all.",
    "“The witnessed horrors included strenuous convulsions, agonizing gasps, agonized shrieking and thrashing, and one individual in so much pain he repeatedly smashed his head into a metal pole,\" the complaint states.",
    "The Jewish Community Relations Council of Greater Phoenix is asking a state court to declare executions by cyanide gas — the same gas used to murder people during the Holocaust — unconstitutional.",
    "Federal courts across the country have previously struck down the use of gas in death row executions, determining it is cruel and unusual punishment under the Eighth and Fourteenth Amendments.",
    "The complaint cites the gas executions of Don Harding and Walter LaGrand in the 1990s, which witnesses described as drawn out and excruciating for the prisoners.",
    "Of the 115 prisoners on death row, 17 were convicted before 1992, and the state is now seeking warrants to execute two prisoners from that group.",
    "Spokespeople for the Arizona Attorney General's office and the Arizona Department of Corrections were not immediately available for comment.",
    "The complaint also describes the brutality of gas executions during their peak legal periods of the 1970s and 1980s.",
    "The plaintiffs are represented by attorneys with DLA Piper and the American Civil Liberties Union of Arizona.",
    "But Arizona is one of five states authorized to use the gas chamber as a secondary means of execution.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "Harding’s execution took 11 minutes to complete, and LaGrand’s took 18 minutes.",
    "Like what you're reading?",
    "- 30 -"
  ]
}