{
  "id": 15900,
  "mediaId": 8347,
  "date": "2022-03-10",
  "headline": "AG Brnovich's office securing $4.8M for Arizonans abused by loan lenders",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/c2726d1/2147483647/strip/true/crop/2048x1075+0+194/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Fab%2F6b%2F7280ecce4e24aee435a9f6222d8d%2Fmoney.jpg",
  "link": "https://www.kgun9.com/news/local-news/ag-brnovichs-office-securing-4-8m-for-arizonans-abused-by-loan-lenders",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caleb J. Fernández",
  "authorUrl": "https://www.kgun9.com/caleb-fernandez",
  "termIds": [
    0
  ],
  "sentences": [
    "TUCSON, Ariz. (KGUN) — Attorney General Mark Brnovich recently announced a proposed consent judgment requiring CashCall, Inc., its owner J. Paul Reddam, and a wholly-owned subsidiary WS Funding LLC to pay $4.8 million in restitution to Arizona consumers.",
    "Senior Litigation Counsel Laura Dilweg and Joshua Whitaker, Assistant Attorneys General Alyse Meislik and Syreeta Tyrell, Consumer Protection and Advocacy Section Chief Leslie Cooper, and Consumer Litigation Unit Chief Matthew du Mee handled this case.",
    "After earning his bachelor's degree from Pennsylvania State University in Advertising/Public Relations, Caleb went straight to New York City where he learned the necessities of production assistance, photography and art direction.",
    "If you need a complaint form physically sent, you may also contact the Attorney General's Office in Phoenix at (602) 542-5763, in Tucson at (520) 628-6648 or outside the Phoenix and Tucson metro areas at (800) 352-8431.",
    "\"It is always consumer protection week here, and this case is emblematic of our commitment to hold all companies accountable for any deceptive actions or predatory lending practices.\"",
    "He says CashCall allegedly took advantage of these Arizonans by charging them with interest rates as high as 169%, greatly exceeding that which is allowed under Arizona law.",
    "Share your story ideas and important issues with Caleb by emailing caleb.fernandez@kgun9.com or by connecting on LinkedIn, Instagram, and Twitter.",
    "Back in 2019, his office alleged that CashCall, its subsidiary, and its owner violated the Arizona Consumer Fraud Act by engaging in a scheme.",
    "The attorney general's office then amended the complaint in March 2020, alleging CashCall formed another high-interest loan conspiracy.",
    "Anyone who believes they're the victim of consumer fraud, you can file a consumer complaint by visiting the Attorney General’s website.",
    "\"Our office will not tolerate unscrupulous lenders preying on vulnerable Arizona consumers,\" shared Brnovich.",
    "Born and raised in Southern California, Caleb has always had an affinity for creative collaborations.",
    "This second deceptive scheme followed the first originating in 2016.",
    "——-\nCaleb Fernández is a digital content producer for KGUN 9.",
    "The consent judgment is currently pending court approval."
  ]
}