{
  "id": 1605,
  "mediaId": 8428,
  "date": "2022-02-11",
  "headline": "Judge permanently blocks vaccine mandate for federal workers in Arizona",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/02/az-e1644614817494.jpeg",
  "link": "https://www.rsbnetwork.com/news/judge-permanently-blocks-vaccine-mandate-for-federal-workers-in-arizona/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Frudd",
  "authorUrl": "https://www.rsbnetwork.com/author/timothy-frudd/",
  "termIds": [
    0
  ],
  "sentences": [
    "President Donald Trump responded, “The Supreme Court has spoken, confirming what we all knew: Biden’s disastrous mandates are unconstitutional.”\nAfter the Biden administration’s defeat at the Supreme Court, the Occupational Safety and Health Administration (OSHA) formally withdrew Biden’s private business vaccination mandates at the end of last month.",
    "P. 57, the Court declares that the vaccination requirement for federal contractors and subcontractors established pursuant to Executive Order 14042 (the ‘Contractor Mandate’) exceeds the scope of the President’s authority under the Federal Property and Administrative Services Act (the ‘Procurement Act’), 40 U.S.C.",
    "Arizona Attorney General Mark Brnovich tweeted, “A judge just signed a permanent injunction to block Biden’s unlawful Covid-19 vaccine mandate for federal contractors in AZ.”\nBrnovich also reminded Americans that Arizona was the first state to challenge Biden’s vaccine mandates.",
    "The judge issued the injunction, claiming that Biden’s vaccine mandate “exceeds the scope of the President’s authority.” This injunction will ensure that federal contractors in Arizona are not forced to choose between their job and their medical freedom.",
    "Arizona, along with Republican states such as Florida and Texas, helped lead the legal charge against the federal government’s attempt to force businesses to vaccinate their employees.",
    "While the Biden administration has continued to push vaccine mandates for federal employees and healthcare workers, Americans are beginning to see more victories for medical freedom.",
    "§ 101 et seq.”\nNews of Thursday’s massive blow to Biden’s vaccine mandates for federal contractors quickly made headlines as Americans celebrated another victory for freedom.",
    "“We filed the first challenge in the nation to these unconstitutional edicts, and we are proud of our efforts to defend individual liberties,” the attorney general said.",
    "A federal court judge signed a permanent injunction Thursday blocking the Biden administration’s Covid-19 vaccine mandate for federal contractors in Arizona.",
    "Furthermore, the U.S. Supreme Court blocked the Biden administration’s Covid-19 vaccine mandate for businesses with 100 or more employees in January.",
    "Arizona also led a multi-state effort to challenge the Biden administration’s Covid-19 vaccination requirement for healthcare workers in November.",
    "The permanent injunction against vaccine mandates in Arizona could lead to more across the nation.",
    "The injunction reads:\n“Pursuant to 28 U.S.C.",
    "§ 2201 and Fed.",
    "R. Civ."
  ]
}