{
  "id": 1787,
  "mediaId": 2520,
  "date": "2022-02-15",
  "headline": "Arizona, where masks in classrooms are bad, but guns in classrooms are ... good?",
  "image": "https://www.gannett-cdn.com/presto/2021/10/11/NPOR/2c863a63-e89c-4fe7-a90a-a676e08612af-IMG_0596.jpg?crop=2754,1550,x0,y140&width=2754&height=1550&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/ej-montini/2022/02/14/arizona-masks-classrooms-bad-guns-classrooms-good/6780242001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "EJ Montini",
  "authorUrl": "https://www.azcentral.com/staff/2646830001/ej-montini/",
  "termIds": [
    2915,
    1126,
    104,
    5949,
    6381
  ],
  "sentences": [
    "The other, Senate Bill 1123, prohibits “the governing board of any university, college or community college from prohibiting the possession of a concealed weapon by a concealed weapon permit holder.’’\nYeah, I know, the anti-mandate fanatics and gun nuts will say I’m comparing apples to oranges because in one instance I’m talking about all students and in the other I’m only talking about college students.",
    "Republican Attorney General Mark Brnovich – now using his office as a campaign tool for his U.S. Senate campaign – filed a legal brief with the Arizona Supreme Court arguing that the court didn’t have the authority to rule on the anti-mask mandate.",
    "Not long ago, retired Mesa police detective Bill Richardson, in an op-ed for The Arizona Republic, explained the dangers and potentially awful consequences if an amateur with good intentions were to actually take out and use a handgun.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "But because the prohibition was tucked into the state budget bill the court tossed the measure for violating language in the state constitution that says each bill can cover only one subject.",
    "The last thing we need is a tragic situation in which students attempting to learn the lessons required to succeed in life wind up teaching the rest of us an unnecessary lesson about death.",
    "Meantime, Republican lawmakers now are pushing bills through the Legislature that would allow firearms onto any of the state’s institutions of higher learning.",
    "A pistol instead of a pocket protector\nOne proposal, House Bill 2489, allows anyone over the age of 18 to obtain a concealed carry permit.",
    "Doug Ducey then staged an end around on a mask ban, offering federal COVID-19 relief money to schools that do NOT have mask requirements.",
    "According to the Centers for Disease Control and Prevention, 45,222 individuals died from gun-related injuries in 2020.",
    "And they’re doing it again in the Legislature with the bills aimed at allowing concealed weapons on campus.",
    "Welcome to Arizona, where Republican lawmakers would ban masks in classrooms but welcome firearms.",
    "Other studies demonstrate how each year roughly 500 individuals die from unintentional shootings.",
    "If it wasn’t for the Arizona Supreme Court, the Republicans who control the Legislature and Gov.",
    "These bills simply fill the irrational compulsion GOP lawmakers have to appease the gun lobby.",
    "Doug Ducey would have banned school mask mandates meant to mitigate the spread of COVID-19.",
    "When the feds threatened to take back that money over Ducey’s ploy, the governor sued.",
    "Whom the politicians running Arizona do not seem to hold in high regard.",
    "All this in order to prevent schools from trying to keep students safe.",
    "Although, perhaps, “aimed at” isn’t the best way to phrase that.",
    "There is no need for firearms to be allowed on campus grounds.",
    "Reach Montini at ed.montini@arizonarepublic.com.",
    "In each instance I’m talking about … students.",
    "For more opinions content, please subscribe.",
    "Acting to prevent kids from being safe\nGov.",
    "The court dismissed his lame argument.",
    "Learning lessons in life or in death?",
    "And for what?",
    "Or is it?",
    "Wrong.",
    "None.",
    "Yep."
  ]
}