{
  "id": 1796,
  "mediaId": 2573,
  "date": "2022-02-04",
  "headline": "'Your World' on Russia-Ukraine, Virginia schools and masks",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/63b126a8-b419-4278-931f-4633951b76bf/ff0b8507-b28e-44e9-bfda-3ac712e0b4da/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/transcript/your-world-on-virginia-schools",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1677,
    1726,
    3351,
    3639,
    4396,
    5789,
    6697,
    6672,
    6569,
    6526
  ],
  "sentences": [
    "Copyright 2022 VIQ Media Transcription, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of VIQ Media Transcription, Inc. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
    "(END VIDEO CLIP)\nGRIFFIN: Leaked U.S. documents published in Spain's \"El Pais\" newspaper revealed the U.S. offered to allow Russia to inspect two bases in Eastern Europe where Moscow suspects the U.S. has Tomahawk missiles in exchange for the U.S. being able to do the same at two Russian bases, an offer to return to arms control talks.",
    "The Americans that are being sent over by the administration, while I'm sorry that we didn't see sanctions put in place earlier directly on Putin, on his financial institutions that could have slowed this down, could have stopped it, the troops that are going over, they are going because of our commitment to NATO.",
    "I mean, is it that because there were -- we were sounding the alarm over 10 years ago about going off the cliff, and we didn't, I mean, have they been emboldened, or have they bought into things like modern monetary theory that says, you can print money forever, that you can -- why not print it forever?",
    "And as we look ahead at what we need to do to keep Europe stable, I think we need to be clear that troops are not going into Ukraine, but they're going into countries, our NATO partners, to show our commitment to NATO and our commitment to security and our commitment to stability of that region.",
    "(COMMERCIAL BREAK)\nPAYNE: The mother of slain New York City police officer Wilbert Mora receiving the flag draped on his casket as he's laid to rest, this coming the day before President Biden will be visiting New York City to meet with Mayor Eric Adams about the crime surge there.",
    "JENNIFER GRIFFIN, FOX NEWS NATIONAL SECURITY CORRESPONDENT: Charles, today's announcement is separate from the Pentagon's announcement last week that 8,500 U.S. troops have been given prepare-to-deploy orders in the event that NATO calls up its 40,000-strong NATO response force.",
    "(END VIDEO CLIP)\nGRIFFIN: One thousand troops from a Striker squadron based in Vilseck, Germany, will be moved to Romania to augment the 900 U.S. troops already there on rotation; 1,700 U.S. troops from the 82nd Airborne at Fort Bragg, a brigade combat, team will go to Poland.",
    "So you're looking here at a fairly wide area where you're looking at those pink colors, at the very least six inches of snow, but a lot of areas getting up to a foot of snow, and then a couple of spots where you see some of those purples where those snow bands really pile up.",
    "But, first, troops on the move, President Biden sending 3,000 troops to Eastern Europe, as Russia continues to build up forces on the Ukraine border; 2,000 U.S. forces will be sent to Poland, while another 1,000 American troops will be shifted from Germany to Romania.",
    "(END VIDEO CLIP)\nHARRIGAN: With Putin scheduled to attend the Opening Ceremonies of the Winter Olympics in Beijing this Friday, Kremlin watchers are thinking, at least for a couple of days, the threat of imminent invasion here is going down -- Charles, back to you.",
    "I think the state made a loud and resounding message not only to the folks there, but to the rest of the country, that parents want to be the ones who make the main decisions for what happens to their children, whether they wear masks or what they learn in school.",
    "(END VIDEO CLIP)\nSERRIE: Johns Hopkins University has published an analysis of data that they gathered from 24 studies and determined that early pandemic restrictions on travel and business and school closings only reduced COVID- related deaths by 0.2 percent.",
    "However, federal health officials did say they would welcome a Senate -- a proposal that's in the Senate to create a bipartisan task force that would look into the origins of COVID and the U.S. response, both by the Trump and Biden administrations.",
    "And, today, the images were just, quite frankly, gut-wrenching and heart- wrenching, as hundreds of NYPD officers lined Fifth Avenue to honor Officer Wilbert Mora and his family one last time as they made their way through the city that he loved.",
    "(BEGIN VIDEO CLIP)\nMARK BRNOVICH (R), ARIZONA ATTORNEY GENERAL: I think what these studies show is what some of us knew, is that, ultimately, there's economic and there's social costs to these lockdowns, and yet there's very little benefit.",
    "If you follow secretary -- the secretary of defense minister in the U.K., Ben Wallace, his comments that he had recently in Parliament, he wrote an op-ed, really highlighting that false narrative that Putin has put out there about NATO.",
    "That is not only what the origin of the virus and the origin of the outbreak is, but many other things that we could learn from in the future, so that we can prevent something like this happening or respond better if and when it does.",
    "So, what I'm really concerned about here, at least for right now, probably is some of these ice storm warnings that you're seeing stretching from Kentucky back down into the Ohio River Valley and then stretching down to Mississippi.",
    "But when you talk to people, even in bucolic settings, like ice fishermen on the frozen river, when you talk to them about how they feel, what they're thinking about, many are thinking about a potential war in the very near future.",
    "The decision, we're expecting probably tomorrow, and we're expecting that we will prevail and that the parents will be able to make the decision about where their -- about the masks that the children should wear or should not wear.",
    "STEVE HARRIGAN, FOX NEWS CORRESPONDENT: Charles, those new satellite images show just how the Russian position continues to grow along Ukraine's border to the south, to the east, and to the north, especially around Belarus.",
    "So, in that dirt, Charles, I found money from Venezuela, plane tickets from Amsterdam, Mexicali, Oaxaca, but also migrants from Russia and Ukraine, basically all over the world, Peru, Brazil, Haiti, you name it, Charles.",
    "But, for me, the big story going forward, we're at about 1.5 billion of taxpayer dollars each day going towards interest, not to roads and bridges and downtrodden, the elderly and children who need food, but to nothing.",
    "Mayor, we just heard from William La Jeunesse 45 percent of folks now coming from outside of Mexico and in the Northern Triangle, 2,100 from Russia, up from 73, 358, from Ukraine, 1,100 from India, 566 from Turkey.",
    "(END VIDEO CLIP)\nLA JEUNESSE: So, while many focus on the Border Patrol, per se, it's mostly policy decisions in Washington driving illegal immigration, pulling people here, along with a booming economy, right?",
    "They put beet juice literally into the salt that dissipates all of the ice on the roads\nAnd then we walk over here, Charles, and we see this is the way the salt came right out of the mine with this blue color.",
    "From what I understand, the law anyway that everybody is focusing on that says we do have to follow the law in Virginia, which was based on Senate Bill 1303, from what, I understand that expires in August.",
    "But the study's focus on limited reductions to COVID-related deaths against a backdrop of social, educational and even political disruption, is causing many early opponents of lockdowns to feel vindicated.",
    "It takes a whole lot less ice to do some major damage, and the ice still to come here, a very large area from Texas stretching up to the Ohio River Valley getting up to about a quarter-of-inch of ice.",
    "I think it's because he's going to test the resolve of the Biden administration, when you had President Obama sending MREs and blankets over to Ukraine, followed by President Trump, who sent Javelins.",
    "We saw the governor of Virginia, the newly elected governor, issued an executive order in January basically allowing students and parents to decide over the school system about the masking policies.",
    "NICHOLLS: Well, what we get routinely is, when migrants come across, and if you talk to them, they say they have been invited, that President Biden has invited them, he's got money waiting for them.",
    "The authors write: \"While this meta-analysis concludes that lockdowns have had little to no public health effects, they have imposed enormous economic and social costs where they have been adopted.",
    "PAYNE: Now, on the growing frustration, particularly for those who work this every day, there are reports that a Yuma agent turned his back on DHS Secretary Mayorkas, prompting this leaked video.",
    "(COMMERCIAL BREAK)\nPAYNE: A mega sell-off in Meta shares in after-hours trading, the parent company of Facebook missing earnings estimates for the latest quarter and gave disappointing guidance.",
    "And there's also a federal lawsuit that's been filed by the Virginia chapter of the ACLU, claiming the governor's order, Charles, is violating the Americans With Disabilities Act -- Charles.",
    "(END VIDEO CLIP)\nMEREDITH: But seven districts, including many in Northern Virginia, think the governor is going too far and also putting both students and staff's health at a disadvantage.",
    "(BEGIN VIDEO CLIP)\nKARINA MORA, SISTER OF WILBERT MORA (through translator): How many Wilberts, how many Jasons, how many more officers have to lose their lives before this system changes?",
    "So, I think having a work force that is happy, at least, or attempts to be satisfied with their daily work is a primary way to make sure that we have agents willing to secure our borders.",
    "Putin has tried to color it that he is taking all these belligerent moves in the region towards Ukraine because he is saying NATO is offensive in nature, it puts his country in danger.",
    "Lieutenant Governor, I want to change the topic here for a moment, because the suspect and that deadly shooting of two officers at Bridgewater College making a court appearance today.",
    "Agents are seeing the usual mix of Central Americans and Mexicans, but also an increase in Venezuelans and Nicaraguans, who many argue are exploiting asylum and other legal loopholes.",
    "(BEGIN VIDEO CLIP)\nJOHN CAFFERKY, ATTORNEY: But the case has to do with sort of structural issues about who is going to be making decisions and who's in charge and who's responsible.",
    "ROBERT RAY, FOX WEATHER MULTIMEDIA JOURNALIST: Yes, Charles, take a look at this massive pile of salt behind me and what Adam was saying about the ice that potentially could come in.",
    "and you see not a lot of movement there, because it moves so slow, if you're in the path of this, there's a lot of time for all of these different things to kind of add up for you.",
    "(END VIDEO CLIP)\nSERRIE: The study's authors say the focus should now shift from mandates to voluntary measures people can do to protect themselves against COVID -- Charles.",
    "SEARS: How difficult is it, Charles, to say, those parents who want to mask the children -- their children, mask your child, but if you don't want to mask, don't mask them?",
    "(BEGIN VIDEO CLIP)\nDR. ANTHONY FAUCI, CHIEF MEDICAL ADVISER TO PRESIDENT BIDEN: Well, I think it's important to look at every aspect of this outbreak for lessons learned.",
    "(END VIDEO CLIP)\nLLENAS: Mayor Eric Adams today promised the family inside that church that they will -- the city will provide the NYPD with the resources that they need.",
    "BRYAN LLENAS, FOX NEWS CORRESPONDENT: For the second time in less than a week, the NYPD and the city, Charles, are mourning the life of a fallen officer here in the city.",
    "Winter storm watches, warnings advisories do stretch from Texas all the way up to Vermont, where you are going to see some of the heaviest snow, and then up into Maine.",
    "The American people have a right to know on what is going on in Afghanistan now, what our posture is there, what we can do, what we should do, and the same for Ukraine.",
    "We are waiting to see if a judge will rule with Governor Glenn Youngkin or if he will decide that schools have the final say about when and wear masks should be used.",
    "By the way, to simplify things, this just simply means that politicians spend $30 trillion over and above what we already send them, which is just absolutely obscene.",
    "His commanding officer called him the ideal police officer, a rising star, someone who, with just four years on the job, was leading other officers under his wing.",
    "(END VIDEO CLIP)\nHARRIGAN: Here in Ukraine, officials are warning that, if diplomacy fails, there could be a much wider war, a war that could engulf all of Europe.",
    "Also, folks, new satellite images, meanwhile, continue to show Russia building up its forces along the Ukraine border backed by tanks, helicopters and warplanes.",
    "(COMMERCIAL BREAK)\nPAYNE: FOX on top of a massive winter storm bearing down ice, sleet and snow, threatening more than 100 million Americans from Texas to Maine.",
    "And another sea of blue in New York City, with thousands mourning the loss of Officer Wilbert Mora, emotions running high wondering when the violence will end.",
    "If you look at year ago at this time, we're up over 5000 percent of where we were a year ago today on the number of crossers just on the family units alone.",
    "And as things become a necessity, whether that's National Guard or FEMA-type resources, that opens the door for those resources potentially to come to you.",
    "WILLIAM LA JEUNESSE, FOX NEWS CORRESPONDENT: Well, Charles, regardless of where you are in the world, the word is, effectively, this border is wide open.",
    "Who will get the final say, Republican Governor Glenn Youngkin, who issued a mandate making masks optional, or several schools that want masks to stay?",
    "Lieutenant Governor, what's plan B, just in case this does not go the way of not only the governor, but let's also say the folks who put him in office?",
    "And it sounds like it won't be the last, if you go by the groundhog Punxsutawney Phil, Phil predicting at least six more weeks of winter this morning.",
    "Having that level of commitment to put yourself on the line to help other people that are essentially breaking the law, that is the American spirit.",
    "We have heard from a number of parents who have applauded the governor's efforts, saying universal masking is putting their kids at a disadvantage.",
    "(END VIDEO CLIP)\n(COMMERCIAL BREAK)\nPAYNE: The border crisis going global, more migrants now crossing our Southern border from faraway countries.",
    "I mean, is there -- do you feel like there's sort of this sign saying, if you make it to the border from anywhere in the world, you can come in?",
    "And then we follow with this administration, with President Biden, who looks weak, who looks like he gives him to Putin, and this is the result.",
    "And 300 members of the 18th Airborne Corps will set up a headquarters in Germany, the same unit used to oversee the evacuation from Afghanistan.",
    "I usually don't make a lot of comments when I leave briefings or I leave hearings, but this classified briefing did not need to be classified.",
    "And that's because so many flights have been canceled, across the country, more than 2,100 cancellations today, another 2,100 flights delayed.",
    "And we have a president, who voted for $29 trillion that $30 trillion trying to tell us that a $6 trillion spending bill will lower deficits.",
    "That's to say nothing of the roads across the Midwest, where conditions are just plain sloppy in some cases, downright dangerous in others.",
    "So when I read an infantry squadron sent to Romania on the eastern flank, it sounds more as an offensive, rather than a defensive movement.",
    "(BEGIN VIDEO CLIP)\nJOHN KIRBY, PENTAGON PRESS SECRETARY: The United States will soon move additional forces to Romania, Poland and Germany.",
    "KIRBY: Because it's important that we send a strong signal to Mr. Putin and, frankly, to the world that NATO matters to the United States.",
    "Well, that erases their name and any evidence really of where they came from, allowing the migrants to adopt a story to avoid deportation.",
    "In Detroit, about a quarter of all flights, and cancellations are mounting in Dallas-Fort Worth, Denver, Midway, Kansas City and Houston.",
    "In Columbus, Ohio, in the capital of this state, what we're going to experience is the trifecta of this weather -- winter weather storm.",
    "Mora and his partner officer, Jason Rivera, were shot and killed in an apartment by a criminal with a long rap sheet and an illegal gun.",
    "A lot of it goes -- this rhetoric is -- this war and police started as rhetoric more than a decade ago, and it's mushroomed into this.",
    "CHARLES PAYNE, FOX NEWS ANCHOR: We are live in Arlington, Virginia where a judge is set to rule in the dispute over masks in schools.",
    "This stuff is very effective and will be hopefully the answer to this terrible winter storm that's going to roll into here tomorrow.",
    "And, again, Charles, unfortunately, I don't hear anybody talking about it in Washington, D.C.\nPAYNE: I got less than a minute to go.",
    "Today, Laura's mom, who -- well, she just clenched the American flag as she said goodbye to her son, the youngest of four children.",
    "This was a hearing with the two secretaries, with the Armed Services Committee, as well as the Senate Foreign Relations Committee.",
    "And, of course, Charles, we will be watching it here over the next 48 hours as this all kind of rolls its way across the country.",
    "And if their truth, their truth is that policemen are bad, well, then they're going to do things to get rid of them, aren't they?",
    "And he instituted, when he was at Shenandoah University, so many safety features on campus, that he was given an award in 2017.",
    "It's a massive winter storm currently stretching its way across the country from as far south as Texas, everything in the blue.",
    "U.S. officials say, when it comes to dealing with Russia's President Vladimir Putin, they need to keep a range of options open.",
    "This is a separate deployment order that President Biden authorized to send 3,000 U.S. troops to bolster NATO's eastern flank.",
    "(BEGIN AUDIO CLIP)\nALEJANDRO MAYORKAS, U.S. SECRETARY OF HOMELAND SECURITY: The commitment remains that we will keep fighting.",
    "Missouri Republican Senator Josh Hawley, meanwhile, not happy with the president's decision to send troops to Eastern Europe.",
    "Well...\nSEARS: And we have to remember, when policemen are running, they run towards the violence, while we're running away.",
    "And we have our attorney general, Jason Miyares, who argued that very same case right now before the Virginia Supreme Court.",
    "At O'Hare alone, almost (AUDIO GAP) 50 flights have been canceled, about a third of all flights leaving this airport today.",
    "(COMMERCIAL BREAK)\nPAYNE: To Virginia, where a judge is set to make a decision who has the final say on masking in schools.",
    "If it's not, and it's a trend downside, that's not going to be good news at all for the economy, for profits of companies.",
    "SEARS: When we ran for office, we were running for a whole year, and we told the voters exactly what we were going to do.",
    "When you have President Biden showing weakness by granting Putin his wish for Nord Stream 2, that set the stage for this.",
    "And I think there's a darn good reason why we have a Central Bank pinning rates down to zero percent and printing money.",
    "PAYNE: So, a dramatic rescue of drowning migrants from a canal in Yuma, Arizona, by our border agents on the front line.",
    "To FOX Weather mobile multimedia journalist Robert Ray in Columbus, Missouri, where the snow is settling in -- Robert.",
    "However, it's unclear when this is all going to be solved, because we are already hearing from lawyers about appeals.",
    "And he decided he was going to retire and come to Bridgewater, a safe community, retirement, nice, a quiet community.",
    "To FOX's Bryan Llenas, who's outside of St. Patrick's Cathedral in New York City, right now with the latest -- Brian.",
    "This is the messaging that I talked to the secretary about when he visited here, is that the messaging has to change.",
    "Looking at the departures board here, you can see there's a lot more red and yellow than there are on-time flights.",
    "A judge will soon decide the fate of Republican Governor Glenn Youngkin's order making masks optional in schools.",
    "SEARS: Elections, as the president said to us not so long ago, President Obama, that elections have consequences.",
    "And so in order to make sure we had the right attention and the right resources, I declared that local emergency.",
    "PAYNE: Meanwhile, all of this COVID spending has the nation's debt surging, now topping $30 trillion in counting.",
    "Delaying a surge on the nation's health care system was one of the early goals of these public health measures.",
    "Now, you ask, well, what is the issue about them winning -- us winning elections, and now they're out of power?",
    "We heard from a lawyer representing those schools suing the governor shortly after today's hearing wrapped up.",
    "We will show you a live picture outside of the American terminal here, where you can see the snow has stopped.",
    "PAYNE: Snow and ice targeting a wide swathe of the U.S., in fact, more than 100 million Americans in its path.",
    "It's the cover the you-know- what of all this, because if rates ever got out of hand, it would go up markedly.",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE (through translator): If war comes, we will not run out of the country.",
    "Similar situation in St. Louis, where about three-quarters of all flights out of that airport were canceled.",
    "That's the same sector where President Biden's Homeland Security got an earful from those on the front line.",
    "We will get reaction from Nebraska Republican Deb Fischer, a member of the Senate Armed Services Committee.",
    "So they're disgruntled, but they go out there and put their lives on the line every single day, don't they?",
    "In consequence, lockdown policies are ill founded and should be rejected as a pandemic policy instrument.\"",
    "We're going to talk to Virginia's lieutenant governor, Winsome Sears, serious about this in just a moment.",
    "But everything in the pink is ice and then everything out in front of this, at times some very heavy rain.",
    "And, instead, they basically demanded that they would be there, but only for a closed, classified hearing.",
    "One firm, PNC, thinks we're going to have officially lost 400,000 when that number is reported on Friday.",
    "(BEGIN VIDEO CLIP)\nCHRIS CABRERA, VICE PRESIDENT, BORDER PATROL UNION: We know they're gaming the system.",
    "So, in Yuma on Monday, we found mounds of trash, ground littered with abandoned I.D.s and plane tickets.",
    "His commanding officer told the family today that Mora died fighting, firing back, even after being hit.",
    "We heard an offer was made to inspect bases on both -- at least our offer was made to inspect two bases.",
    "But is there anything, any sort of last-second reprieve possible to avoid armed conflict at this point?",
    "(BEGIN VIDEO CLIP)\nGRIFFIN: Do you have any evidence that Putin plans to move beyond Ukraine's borders?",
    "But, listen, I mean, it's just another foreign policy crisis that this administration's blundered into.",
    "Let's hope that everyone here is ready and stays off the roads starting tonight into tomorrow, Charles.",
    "Now, you received a briefing today on Afghanistan from Defense Secretary Austin and Secretary Blinken.",
    "We already made a huge mistake, to your point, with the main asset that we could have negotiated with.",
    "SEARS: But how can it be that we are losing our law enforcement in this manner, not just in Virginia?",
    "So, with migrants streaming across the border, new numbers showing more coming from across the world.",
    "And as for the rest, well, single adults, just 40 percent of those are being returned under Title 42.",
    "So, it became to a position where the Border Patrol was being overwhelmed for a short period of time.",
    "And let me just say, you can turn your back on me, but I will never turn your back -- my back on you.",
    "The analysis, led by three economists, did not look at the effect lockdowns had on hospitalizations.",
    "And now that we have won the election, imagine that you're trying to fulfill your campaign promises.",
    "So we're talking about from right now taking you all the way into the future until Friday morning.",
    "I mean, we all play armchair quarterback during football season and when things like this come up.",
    "What are your thoughts, particularly as we see just two more officers taking this sort of damage?",
    "They're not doing the mission and the job that they want to do, that they have the passion to do.",
    "NICHOLLS: ... because, just through Yuma, that's going to be over a $16- million-a-week business.",
    "I know there's a lot of people looking for ways out, whether that's retirement or lateral moves.",
    "GARY KALTBAUM, FOX BUSINESS CONTRIBUTOR: I thought 10 would be the wakeup call, then 20, now 30.",
    "(BEGIN VIDEO CLIP)\nQUESTION: Chief Ortiz, you admitted that morale is at an all-time low at CBP.",
    "I'm hoping it's a one- or two-off because the Omicron, and we get back to better going forward.",
    "This is an extraordinary time in the stock market, a lot of ups and downs, particularly Friday.",
    "The reason that they are not out there right now is because it's been raining all day, Charles.",
    "PAYNE: How much of this, though, is just really sort of a bitterness over losing the election?",
    "Plus, 30 trillion reasons why more D.C. spending may be dead, is that good news for inflation?",
    "But I think worse than the snow for folks are going to be the ones just to the south of this.",
    "We said that we were going to give the parents the option of choosing whether to mask or not.",
    "In the next few hours, Columbus will deploy literally dozens of snowplows and salt spreaders.",
    "And if we can't get anything through the legislature, then that's what we have to live with.",
    "That's going to take down power lines, take down branches, which will take down power lines.",
    "We will ask the state's Republican lieutenant governor, Winsome Sears, what she's expecting.",
    "And when you do go around the city here in Kyiv, you don't see visible preparations for war.",
    "Kirby said there are additional troops in the U.S. now that have been placed on high alert.",
    "The people that are making these decisions are not having to suffer in these circumstances.",
    "Doug, Mayor, your town under local emergency, I think this goes way back to early December.",
    "Because, Gary, will this be the wakeup call that Washington needs finally stopped spending?",
    "DOUGLAS NICHOLLS (R), MAYOR OF YUMA, ARIZONA: Well, it really comes down to basic numbers.",
    "WINSOME SEARS (R-VA): Well, what's going to happen is, we're just going to follow the law.",
    "I think this latest move is a direct result of the indecisiveness of this administration.",
    "We're going to abide by the decision that the Supreme Court of Virginia provides for us.",
    "And what happens is, the salt then goes and pushes aside, and it's not effective at all.",
    "But the culprit is still on the ground here, the culprit for all of those cancellations.",
    "(BEGIN VIDEO CLIP)\nABBIE PLATT, PARENT: She should not have to wear a mask all day long.",
    "Of course, you can catch me weekdays every day 2:00 p.m. on FOX Business \"Making Money.\"",
    "I already explained to you interest expense that could be going to so many great things.",
    "Otherwise, this doesn't get fixed any time without some real -- some real heavy effort.",
    "Also, new video showing border agents rescuing migrants from drowning in Yuma, Arizona.",
    "To FOX Weather meteorologist Adam Klotz on what he's predicting for this storm -- Adam.",
    "And the time stamps just back to your top left there, this is a very slow-moving storm.",
    "There was very little that would have been of a classified nature that was brought up.",
    "Putin has been very up front in rejecting what this administration is offering to him.",
    "Why are you bolstering these eastern flank allies if you do not have evidence of that?",
    "She immigrated to the U.S. from the Dominican Republic when Mora was just 7 years old.",
    "So, fingers crossed again this is an outlier because of the last COVID that came out.",
    "Because the governor has also declared an emergency, it piggybacks on that authority.",
    "They have to deal with immigration, instead of border security and national security.",
    "These are our citizens, our neighbors, our friends, our family here in the community.",
    "Nebraska Republican Senator Deb Fischer is a member of the Armed Services Committee.",
    "FOX Business' Grady Trimble is at Chicago's O'Hare Airport with the latest -- Grady.",
    "They could see the mix, like I said, the trifecta of all that this storm will bring.",
    "FOX News correspondent Mark Meredith is in Arlington with the very latest - - Mark.",
    "And the people who have offered it, at some point, we need to hold them to account.",
    "(END AUDIO CLIP)\nPAYNE: Mayor, do you blame these agents for being this frustrated?",
    "KALTBAUM: I think human nature says, well, we got to 20, and the world didn't then.",
    "SEARS: I was raised in the South Bronx, and I just can't believe what's happening.",
    "Imagine giving the parents the ability to make those decisions for their children.",
    "And they should think twice about attacking, because we will defend our homeland.",
    "We're going to talk to a mayor who just met with the homeland security secretary.",
    "And I think that's been effective in helping us address this on a national level.",
    "And we have had this wealth effect for the markets that have helped the economy.",
    "And you know that because the administration knows and they have telegraphed it.",
    "NICHOLLS: Well, it only ends permanently with a congressional change of the law.",
    "We need to have that in place, so that the correct policies can be put in place.",
    "(BEGIN VIDEO CLIP)\nKIRBY: We don't know exactly know what Mr. Putin has in mind.",
    "SEARS: So, one way or the other, this mask mandate will come to an end, finally.",
    "(END VIDEO CLIP)\nMEREDITH: The hearing lasted a little bit more than two hours.",
    "Why something that just said today could give us a clue in which way this goes.",
    "This is a rush transcript of \"Your World with Neil Cavuto\" on February 2, 2022.",
    "FISCHER: You know, you always hope that you can solve things through diplomacy.",
    "We're going to talk to the mayor of Yuma on the crisis that just keeps surging.",
    "(COMMERCIAL BREAK)\nPAYNE: A White House COVID Task Force briefing wrapping up.",
    "And they -- of course, who could blame anyone for not -- wanting to live here?",
    "In fact, I want to get your quick reaction to this video from the Yuma sector.",
    "You could be talking about 18 inches of snow before this is all said and done.",
    "We understand that our policemen need training, our policewomen need training.",
    "And so people are emboldened to do whatever they think is their idea of right.",
    "SEARS: And then he was, as you probably know, the best man to J.J. Jefferson.",
    "We are expecting a decision to be made either tomorrow or later on this week.",
    "Temperatures right now hovering about 38 degrees, but what's going to happen?",
    "Today, he was posthumously promoted to detective first grade for his heroism.",
    "The NYPD protects us, but who protects them and who looks after their lives?",
    "We want to help people, but we want to do it the right way and the safe way.",
    "Meanwhile, folks, more than 4,000 flights already canceled or delayed today.",
    "We have the gentlemen, John Painter, a former police chief of the Grottoes.",
    "First to Jennifer Griffin at the Pentagon with the very latest -- Jennifer.",
    "All right, folks, lawsuits piling up in Virginia's battle over masking up.",
    "We're already seeing more than 2,500 flights canceled tomorrow -- Charles.",
    "Yes, it's ironic that that's the overarching message with our jobs market.",
    "Now to the front lines of this crisis, Yuma, Arizona, Mayor Doug Nicholls.",
    "Our national debt, now topping $30 trillion -- that's with a T -- dollars.",
    "Did a bombshell study from Johns Hopkins university on lockdowns come up?",
    "So, what is the plan if the decision does not go Governor Youngkin's way?",
    "How many people are wearing a mask for seven to eight hours all day long?",
    "Not good, but someone else may -- well, something else may be from this.",
    "If this was a company for profit, we would have been bankrupt years ago.",
    "Now agents are asking Biden's team, what in the world are they thinking?",
    "You can see it in the way they just are, because they're so overwhelmed.",
    "And will a judge let masks continue to be optional in Virginia schools?",
    "PAYNE: The -- is there any chance, then, with respect to a resolution?",
    "Republican Senator Josh Hawley calling the troop movements a mistake.",
    "What does Virginia's lieutenant governor, Winsome Sears, have to say?",
    "And so what we're saying is, we're not going to allow that to happen.",
    "Lieutenant Governor, it's a pleasure, my first time interviewing you.",
    "Do you get extra -- do you get federal help with what that emergency?",
    "But that brought little comfort, though, to a mother who is grieving.",
    "The mayor will meet with President Biden here in the city tomorrow.",
    "PAYNE: Well, migrants streaming in, some agents lending it all out.",
    "It's a mistake to send more American troops to Europe at this time.",
    "But let's remember, Charles, that NATO is a defensive organization.",
    "So you're getting a little bit of all of bit here with this system.",
    "Steve Harrigan is in Kyiv, Ukraine, with the very latest -- Steve.",
    "It will likely go all the way to the Virginia state Supreme Court.",
    "And they will come into this silo and start bringing all this out.",
    "And, remember, Charles this is a one-two punch of winter weather.",
    "And that could mean a whole lot of power outages because of this.",
    "And, as for Detective Mora, well, he was a hero even after death.",
    "We saw it earlier today, with families walking up from the river.",
    "These border agents, I mean, they are true heroes in this crisis.",
    "NICHOLLS: We can't rely upon the cartels to fix it...\nPAYNE: Wow.",
    "PAYNE: Senator, thank you so much for your time and your wisdom.",
    "It's going to be reaching ultimately all the way up into Maine.",
    "We don't think -- we know Americans don't want us to go to war.",
    "MARK MEREDITH, FOX NEWS CORRESPONDENT: Charles, good afternoon.",
    "You must tune in, your portfolio, your retirement all at stake.",
    "In her eulogy, Mora's sister Karina slammed the justice system.",
    "We're going to talk to a border mayor on the front lines next.",
    "What's happened with this crisis that you have had to do this?",
    "Apprehensions of families and unaccompanied minors is way up.",
    "It's a loophole that has been here for, what, nine years now.",
    "Content and Programming Copyright 2022 Fox News Network, LLC.",
    "And crossing canals with your family isn't that way to do it.",
    "Well, that many people believe they're going to get through.",
    "To Virginia's Republican lieutenant governor, Winsome Sears.",
    "Charles, we're going to see a freezing rain, sleet and snow.",
    "And this is the color of brown, where they have beet juice.",
    "KALTBAUM: And then we get into somewhat of a vicious cycle.",
    "JONATHAN SERRIE, FOX NEWS CORRESPONDENT: Hi there, Charles.",
    "Jonathan Serrie is in Atlanta with the latest -- Jonathan.",
    "And it shouldn't be that our policemen aren't coming home.",
    "The problem is, this crowds out the economy going forward.",
    "And that will turn into that freezing rain/sleet tomorrow.",
    "And, by the way, Mr. Jefferson just celebrated a birthday.",
    "The influx of troops, as well as weapon systems continues.",
    "This copy may not be in its final form and may be updated.",
    "And so these are the consequences of winning an election.",
    "NICHOLLS: There can be federal help that comes with that.",
    "Imagine politicians are trying to live up to their word.",
    "I'm not sure whether Russia would agree to that or not.",
    "So let's counter that and be honest about what NATO is.",
    "ADAM KLOTZ, FOX NEWS METEOROLOGIST: Hey there, Charles.",
    "UNIDENTIFIED MALE: You did the day you were appointed.",
    "The study did not come up in the White House briefing.",
    "And we have seen a lot more activity in our community.",
    "He donated his organs and saved five total strangers.",
    "I mentioned to you earlier today one of the outcomes.",
    "Agents rescued two migrants from drowning in a canal.",
    "(END VIDEO CLIP)\nPAYNE: So, does my next guest Agree?",
    "(BEGIN VIDEO CLIP)\nSEN. JOSH HAWLEY (R-MO): Bad idea.",
    "Here we are reaping what some politicians have sown.",
    "GRADY TRIMBLE, FOX NEWS CORRESPONDENT: Hey, Charles.",
    "The law hasn't really been touched in over 20 years.",
    "Now hand it off to \"THE FIVE\" that starts right now.",
    "But it's not clear that is Putin's goal -- Charles.",
    "FISCHER: Well, of course, we never want to do that.",
    "So are we putting troops in harm's way needlessly?",
    "Those were defensive arms that he sent to Ukraine.",
    "Ice is going to be one of the real major concerns.",
    "SEN. DEB FISCHER (R-NE): Well, thank you, Charles.",
    "And, unfortunately, Charles, nobody seems to care.",
    "He saved their lives with that action -- Charles.",
    "Are President Biden's policies to blame for that?",
    "RAUL ORTIZ, U.S. BORDER PATROL CHIEF: No comment.",
    "They have vilified our law enforcement officials.",
    "This is a nationwide epidemic, the rise in crime.",
    "But if we don't, Charles, we're a nation of laws.",
    "If that heads south, I think trouble lies ahead.",
    "People from all over the world see this opening.",
    "And that's going to only exacerbate our problem.",
    "I don't understand how that impacts you at all.",
    "We don't want to have any armed conflict there.",
    "Law enforcement, they need some more training.",
    "And nobody has decided to close this loophole?",
    "You control the printing press, so why stop?",
    "They put a vest on and go to work every day.",
    "Senator, thank you very much for joining us.",
    "We don't exactly know what he's going to do.",
    "And we have ironclad Article 5 commitments.",
    "Not too busy here at the American terminal.",
    "We're going to hear from the mayor of Yuma.",
    "That's the only way that this fixes itself.",
    "They give it lip service for the most part.",
    "Each day, $3 billion is added to our debt.",
    "KALTBAUM: And I think markets would react.",
    "By the way, Spotify also getting hammered.",
    "More on the way tonight and into tomorrow.",
    "The parents are looking for us to do that.",
    "And, again, I will get back to this point.",
    "That's what the governor is trying to do.",
    "It's already wreaking havoc on travelers.",
    "PAYNE: So, what do you think, then, Gary?",
    "Both parties, of course, share the blame.",
    "How do you see this, the outcome of this?",
    "I mean, this has gone on for a long time.",
    "And then those policies can be executed.",
    "And it's a concern that I have for them.",
    "It's going to go to $2 billion each day.",
    "Let's go 21 and onward and upward we go.",
    "And, again, I just worry about a blowup.",
    "William La Jeunesse is following it all.",
    "I want to be very clear about something.",
    "PAYNE: Yes, and we will be watching you.",
    "You're not even safe there, apparently.",
    "SEARS: My God, what is happening to us?",
    "So we are hoping that we will prevail.",
    "I'm Charles Payne, in for Neil Cavuto.",
    "A decision is expected any minute now.",
    "Eleven million jobs are open, and wow.",
    "Is the Biden administration listening?",
    "PAYNE: What happens when you do that?",
    "PAYNE: Jonathan, thank you very much.",
    "They're not willing to shut that off.",
    "PAYNE: Folks, that will do it for me.",
    "An attack on one is an attack on all.",
    "PAYNE: Thank you very much, Jennifer.",
    "We are not aggressors, but defenders.",
    "And I'm sure it will not be the last.",
    "And many my colleagues were as well.",
    "The White House has been called out.",
    "KALTBAUM: It's not going to be good.",
    "We had a really shocking ADP number.",
    "They know they're gaming the system.",
    "NICHOLLS: You know, I really don't.",
    "PAYNE: And, Senator, to that point.",
    "We did not hide anything from them.",
    "Are their frustrations being heard?",
    "And that's what we're going to do.",
    "You saw what happened in New York.",
    "Your thoughts on this latest move?",
    "PAYNE: Steve, thank you very much.",
    "He has done it with them directly.",
    "PAYNE: Mayor, how do you see this?",
    "He's in La Joya, Texas -- William.",
    "And it should be front and center.",
    "PAYNE: It's really heartbreaking.",
    "PAYNE: Thank you very much, Mark.",
    "It's real demoralizing for them.",
    "That's the spirit here in Yuma.",
    "And we mourn with the families.",
    "PAYNE: Gary, thank you so much.",
    "FISCHER: I was very frustrated.",
    "These are not permanent moves.",
    "I have waited for this moment.",
    "That's all we're trying to do.",
    "We are a commonwealth of laws.",
    "You know what else is surging?",
    "I want to bring Gary Kaltbaum.",
    "And there's nobody to stop it.",
    "And we just talked about this.",
    "And good luck with everything.",
    "NICHOLLS: Thank you, Charles.",
    "Thank you very much, William.",
    "It's whatever their truth is.",
    "It will be a snowy mess here.",
    "You said you left frustrated.",
    "He has done it through NATO.",
    "You start to talk about ice.",
    "Here's your future forecast.",
    "Robert, thank you very much.",
    "SEARS: These are our heroes.",
    "It's almost like a footnote.",
    "It's audio from that moment.",
    "Mayor, I got to let you go.",
    "Mora was just 27 years old.",
    "PAYNE: Well, you know what?",
    "We get to fulfill our word.",
    "But you see this right now.",
    "We spoke about Afghanistan.",
    "Very ominous-looking maps.",
    "PAYNE: Yes, let's hope so.",
    "KALTBAUM: Thanks, Charles.",
    "PAYNE: Absolutely amazing.",
    "Hope you enjoyed the show.",
    "LA JEUNESSE: Back to you.",
    "And what does it tell us?",
    "They will drop overnight.",
    "This is one pile of salt.",
    "We're back in 60 seconds.",
    "Grady, thank you so much.",
    "But let's be honest here.",
    "It matters to our allies.",
    "And this is \"YOUR WORLD.\"",
    "We are a nation of laws.",
    "I mean, what a concept.",
    "We have no place to go.",
    "We spoke about Ukraine.",
    "Yes, well, you said it.",
    "And it grows every day.",
    "What are you expecting?",
    "SEARS: My God, my God.",
    "And I was frustrated.",
    "Here's one fisherman.",
    "We lost 301,000 jobs.",
    "Nobody seems to care.",
    "PAYNE: Brian, thanks.",
    "Really appreciate it.",
    "ALL RIGHTS RESERVED.",
    "But how does it end?",
    "Let's take a listen.",
    "And yet here we are.",
    "Thanks a lot, Brian.",
    "Thank you very much.",
    "And congratulations.",
    "Thank you very much.",
    "Again, what happens?",
    "And we are going to.",
    "PAYNE: What a mess.",
    "Thanks a lot, Adam.",
    "FISCHER: Thank you.",
    "SEARS: God help us.",
    "It's getting worse.",
    "Thank you so much.",
    "NICHOLLS: They do.",
    "PAYNE: Absolutely.",
    "Thank you so much.",
    "SERRIE: Certainly.",
    "NATO is defensive.",
    "That is not right.",
    "Welcome, everyone.",
    "PAYNE: Absolutely.",
    "Well, she's here.",
    "That is not true.",
    "SEARS: Thank you.",
    "We will explain.",
    "Feel better now?",
    "And we're on it.",
    "He will tell us.",
    "It's a mistake.",
    "Take a listen.",
    "It's an honor.",
    "Take a listen.",
    "Appreciate it.",
    "KALTBAUM: Yes.",
    "PAYNE: Right.",
    "PAYNE: Right.",
    "PAYNE: Right.",
    "PAYNE: Right.",
    "PAYNE: Right.",
    "PAYNE: Right.",
    "That is snow.",
    "PAYNE: Yes.",
    "PAYNE: Yes.",
    "PAYNE: Yes.",
    "PAYNE: Yes.",
    "PAYNE: Yes.",
    "PAYNE: Yes.",
    "PAYNE: Yes.",
    "PAYNE: Yes.",
    "PAYNE: Yes.",
    "PAYNE: Yes.",
    "PAYNE: Wow.",
    "Thank you.",
    "Why now?",
    "LT. GOV.",
    "Why?",
    "Why?",
    "Yes."
  ]
}