{
  "id": 1826,
  "mediaId": 2564,
  "date": "2022-02-08",
  "headline": "Arizona's Republican Attorney General calls Biden's border crisis an 'INVASION': Mark Brnovich states in legal opinion the state can defend itself from the influx of migrants under the US Constitution",
  "image": "https://i.dailymail.co.uk/1s/2022/02/08/13/53922067-0-image-a-9_1644327600943.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10489419/Arizonas-GOP-AG-calls-Bidens-border-crisis-INVASION-says-state-defend-itself.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Drudge Report",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katelyn Caralle",
  "authorUrl": "",
  "termIds": [
    3401,
    1126,
    392,
    94,
    5949
  ],
  "sentences": [
    "Further—while it is not necessary for the exercise of the State’s retained sovereign powers—state sovereignty to defend the integrity of the State from on-the-ground lawlessness at or near its border is bolstered by the unprecedented actions of the current presidential administration to destroy operational control of the border, including the illegal rescission of the Migrant Protection Protocols (“MPP”),\n 2\n illegal issuance of “interim guidance” (carried forward in “permanent guidance”) that prevents the U.S. Immigration and Customs Enforcement (“ICE”) and United States Customs and Border Protection (“CBP”) from executing federal laws,\n 3\n halting construction of the border wall,\n 4\n and closing highway inspection checkpoints.",
    "I22-001 (R21-015) Re: The Federal Government’s Duty To Protect the States And The States’ Sovereign Power Of Self Defense When Invaded To: Jake Hoffman, Representative Arizona House of Representatives\n Questions Presented\n The request seeks a formal legal opinion on whether “the federal government has failed—intentionally or unintentionally—to uphold its obligations to protect our state from invasion under Article IV, Section 4 of the U.S. Constitution.” To fully and properly answer this question from the perspective of the State of Arizona, this Opinion will address the below issues.",
    "A Border Patrol agent speaks with mothers from Haiti who crossed into Yuma from Mexico on December 10, 2021\n+5\nView gallery\nMigrant facilities in Yuma have become so overwhelmed, the asylum-seekers and illegal border jumper are forced outside into makeshift tents of mylar blankets, caution tape and sand bags\nVice President Kamala Harris had a phone call last month with Guatemala President Alejandro Giammattei after a barrage of criticism continues to hit the administration over its handling of the southern border crisis.",
    "The “Invasion Clause” and the “State Self-Defense Clause” Must Be Understood As Providing Dual Protection In The Context of The States’ Reserved Powers\n “When the original States declared their independence, they claimed the powers inherent in sovereignty—in the words of the Declaration of Independence, the authority ‘to do all ... Acts and Things which Independent States may of right do.’”\n Murphy v. Nat’l Collegiate Athletic Ass’n\n , 138 S. Ct. 1461, 1475 (2018) (quoting Declaration of Independence ¶ 32 (U.S. 1776)).",
    "Can the current situation at Arizona’s border with Mexico—where the federal government has lost or severely degraded its operational control of the border and in which cartels and gangs are smuggling unauthorized aliens and large quantities of drugs\n 2\n outside of authorized ports of entry and also engaging in acts of violence in pursuit of their objectives—satisfy the definitions of “actually invaded” and “invasion”?",
    "+5\nView gallery\nArizona Attorney General Mark Brnovich released a legal opinion Monday calling the southern border crisis an 'invasion,' and claiming the U.S. Constitution gives states the power to defend and take action against such invasions\n STATE OF ARIZONA OFFICE OF THE ATTORNEY GENERAL\n ATTORNEY GENERAL OPINION By MARK BRNOVICH ATTORNEY GENERAL February 7, 2022 No.",
    "In sum, both the power of self-defense against being “actually invaded” and the power to “execut[e] [their] inspection laws” are sovereign powers that were retained by the States under the U.S. Constitution to permit States to control on-the-ground conditions at their borders that are essential to public safety and security in a State.",
    "+5\nView gallery\nIn fiscal year 2021, 1.7 million migrant were apprehended by immigration enforcement, the numbers continued to spike in December with 178,840 encounters at the southern border\n+5\nView gallery\nMore than 65,000 non-citizens were caught illegally crossing into Yuma from Mexico between September and November 2021.",
    "Mark Brnovich wrote in his opinion: 'The violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an 'invasion' under the U.S. Constitution, and Arizona therefore has the power to defend itself from this invasion under the Governor's authority as Commander-in-Chief.'",
    "GOP state lawmakers in Arizona and Trump-era Office of Management and Budget Director Russ Vought and the former president's acting deputy DHS Secretary Ken Cuccinelli have all urged Arizona Republican Governor Doug Ducey to use war powers to quell the massive migration numbers over the last year.",
    "Pictured: An aerial view taken December 10, 2021 shows immigrants gathered along the U.S. border wall after crossing illegally through a gap in Yuma, Arizona\nBrnovich notes the definition of 'invasion' in the Constitution includes 'hostile non-state actors', and not just hostile foreign states.",
    "5\n There is nothing in federal constitutional or statutory law authorizing the federal executive to thwart States from ensuring on-the-ground safety and an orderly border within the\n 1\n While this duty exists, it has been held not enforceable in court due to the “political question” doctrine.",
    "This includes defending against actions by “foreign hostility [and] ambitious or vindictive enterprises of [a state’s] more powerful neighbors.” This encompasses defense against hostile non-state actors such as cartels and gangs operating at the border and entering into Arizona’s territory.",
    "The language Brnovich points to in Article I of the Constitution would in theory allow the Arizona police or National Guard to remove illegal immigrants back to Mexico – rather than relying on immigration enforcement agencies currently run by the Democrat administration.",
    "During the call, Harris 'reaffirmed the administration's commitment to working together with Guatemala on a broad agenda that includes the root causes of migration, trafficking, economic development, and anti-corruption,' according to a statement from her office.",
    "5\n See\n Adam Shaw & Peter Hasson,\n CBP shuts down highway checkpoints as overwhelmed agency struggles to handle border surge\n , Fox News (March 9, 2021), https://www.foxnews.com/politics/cbp-shuts-checkpoints-agency-border-surge\n 4\n State’s own territory.",
    "James Madison specifically cited Virginia using its militia to stop smugglers as an example of a valid exercise of the invasion power, and there is every basis to conclude this sovereign power was retained as reflected in the State Self-Defense Clause.",
    "Download this PDF\nof 25\nView on Scribd\n2.7 Brnovich Opinion on Bor... by Fox News\n+5\nView gallery\nUsing this provision in Article I of the Constitution would in theory allow the Arizona police or National Guard to remove illegal immigrants to Mexico.",
    "The State Self-Defense Clause in Article I, Section 10 provides that a State may defend itself when it has been “actually invaded, or in such imminent Danger as will not admit of delay,” and the State does not need the consent of Congress to do so.",
    "Aug. 19, 2021) (“The policy contained in the Memoranda effectively dispenses with these mandates by conferring discretion to the Government to independently decide who will be detained and when—if ever—detention of those individuals might occur.",
    "The surge and revelation of overcrowding came in the midst of a massive surge in infection rates for COVID-19 with the highly-contagious Omicron variant – leading to further questions on the holding conditions in the middle of the pandemic.",
    "The Import-Export Clause in Article I, Section 10 also recognizes that States retain sovereign authority to execute inspection laws, which requires operational control of the border to channel entry of goods to authorized ports of entry.",
    "Arizona's Republican attorney general issued a legal opinion Monday giving his state more power to take action against illegal immigration by deeming the southern border crisis an 'invasion' under the U.S. Constitution.",
    "The Invasion Clause in Article IV, Section 4 provides that “[t]he United States … shall protect each [state in this union] against invasion.” These clauses provide dual protection against invasion broadly defined.",
    "What constitutes “actually invaded” for purposes of Article I, Section 10 (“State Self-Defense Clause”) and “invasion” for purposes of Article IV, Section 4 (“Invasion Clause”) of the U.S. Constitution?",
    "The call came after Giammattei went public with his dissatisfaction regarding communication over the last several months with the vice president, who was named border czar shortly after inauguration.",
    "Disturbing images emerged last month showing dire conditions at Arizona border patrol facilities with tens of thousands of migrants packed together in overcrowded trailers and makeshift mylar tents.",
    "Rafa Rivera, regional president of the National Border Patrol Council, said that more than 1,500 migrants were in custody in Yuma at one point, according to a Washington Examiner report.",
    "More than 65,000 non-citizens were caught illegally crossing into Yuma from Mexico between September and November 2021, which is higher than the total encounters in a typical year.",
    "The Terms “Invasion” And “Actually Invaded” In The Invasion and State Self-Defense Clauses Are Broad And Apply To Invasion By Hostile Non-State Actors Such As Cartels and Gangs A.",
    "In December, Customs and Border Protection (CBP) encountered 178,840 migrants at the southern border, up slightly from the 173,620 encountered in November and 164,753 in October.",
    "The U.S. Constitution allows states to 'engage in War' when it has been 'actually invaded, or in such imminent Danger as will not admit of delay' without congressional approval.",
    "Do States retain constitutional power to defend themselves when “actually invaded” by hostile non-state actors such as armed cartels and gangs, or only by foreign powers?",
    "Yuma Mayor Douglas Nicholls declared a state of emergency on December 9 after 6,000 people were taken into custody by Border Patrol in the course of five days.",
    "“[B]oth the National and State Governments have elements of sovereignty the other is bound to respect.”\n Arizona v. United States\n , 567 U.S. 387, 398 (2012).",
    "“The Constitution limited but did not abolish the sovereign powers of the States, which retained ‘a residuary and inviolable sovereignty.’”\n Id.",
    "No State should be put in the position that Arizona and other border states have been put in through the federal government’s recent actions.",
    "The federal government is failing to fulfill its duty under Article IV, Section 4 of the Constitution to defend the States from invasion.",
    "The on-the-ground violence and lawlessness at Arizona’s border caused by cartels and gangs is extensive, well-documented, and persistent.",
    "The “Invasion Clause” of the U.S Constitution requires that the United States “shall protect each [State] against Invasion.” U.S. Const.",
    "1\n Second, Arizona retains the independent authority under the State Self-Defense Clause to defend itself when actually invaded.",
    "'An actual invasion permits the State to engage in defensive actions within its own territory at or near its border,' he added.",
    "The State Self-Defense Clause exists precisely for situations such as the present, to ensure that States are not left helpless.",
    "Dec. 13, 2021), as revised (Dec. 21, 2021) (“[T]he Termination Decision was arbitrary and capricious under the APA.",
    "The behemoth figure equates to the number of migrants intercepted in an average month over the past two decades.",
    "'Usually around this time through the holidays, it slows down, but here in Yuma, it was constant,' Rivera noted.",
    "Thus, the States have demonstrated a substantial likelihood of success on Counts I & II.”), appeal pending No.",
    "In the 1990s, states and counties, including Arizona, sued the federal government under the Invasion Clause.",
    "Nor is there any conflict with this and the orderly conduct of immigration policy by the federal executive.",
    "They argued that out-\nMillions of books, audiobooks, magazines, documents, sheet music, and more for free.",
    "It can satisfy the definition of “actually invaded” and “invasion” under the U.S. Constitution.",
    "Arizona's Yuma Sector of the border has been particularly overwhelmed by the migration surge.",
    "This is an aspect of the historical police power that is expressly preserved for the States.",
    "In fiscal year 2021 alone, 1.7 million migrant were apprehended by immigration enforcement.",
    "The numbers continued to spike in December with 178,840 encounters at the southern border.",
    "First, the federal government has a duty to protect Arizona under the Invasion Clause.",
    "Finally, the U.S. “Constitution … shall be the supreme law of the land….” U.S. Const.",
    "… The Termination Decision is independently unlawful because it violates 8 U.S.C.",
    "This guidance therefore is wholly contrary to Sections 1226(c) and 1231(a)(2).",
    "Article IV also states the U.S. 'shall protest each [state] against invasion.'",
    "This power is exercised under the Governor’s authority as Commander-in-Chief.",
    "Multiple states are also challenging the unlawful paroling of aliens.",
    "The issues addressed in this Opinion relate to border security.",
    "Subsequently, AG Brnovich released his opinion on the matter.",
    "21-10806, -- F.4th --, 2021 WL 5882670, at *2 (5th Cir.",
    "6:21-CV-00016, 2021 WL 3683913, at *42 (S.D.",
    "§ 1225.”), petition for certiorari filed No.",
    "39, at 245 (James Madison) (C. Rossiter ed.",
    "January figures have not yet been released.",
    "4\n Arizona is challenging this action.",
    "Usually only Congress can declare war.",
    "3\n See Texas v. United States\n , No.",
    "Two conclusions flow from this.",
    "See Arizona v. Mayorkas\n , No.",
    "2\n See\n Texas v. Biden\n , No.",
    ",\n Brnovich v. Biden\n , No.",
    "(quoting The Federalist No.",
    "2:21-cv-01568 (D. Ariz.).",
    "2:21-cv-00617 (D. Ariz.).",
    "21-954 (Dec. 29, 2021).",
    "21-40618 (5th Cir.).",
    "Summary Answers\n 1.",
    "See\n Ariz. Const.",
    "VI, paragraph 2.",
    "Analysis I.",
    "See, e.g.",
    "IV, § 4.",
    "1961)).",
    "V, § 3.",
    "3\n 2.",
    "art.",
    "Tex.",
    "art.",
    "art.",
    "2.",
    "1."
  ]
}