{
  "id": 2088,
  "mediaId": 8251,
  "date": "2022-02-10",
  "headline": "'Laughed out of court': Brnovich opinion gives Ducey green light to 'engage in war' at border. Experts say AG got it wrong",
  "image": "https://media.12news.com/assets/KPNX/images/08f88309-088f-4792-aff0-eddc8cbceed4/08f88309-088f-4792-aff0-eddc8cbceed4_1140x641.jpg",
  "link": "https://www.12news.com/article/news/local/arizona/ag-brnovich-opinion-gives-ducey-green-light-to-engage-in-war-at-border-experts-say-ag-got-it-wrong/75-10f61896-5b35-405e-a62e-f0078d76c196",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The \"invaders\" are undocumented immigrants and asylum seekers who have crossed the border in record numbers over the last year, and cartels exporting dangerous drugs to the U.S\n\"The State Self-Defense Clause of the Constitution establishes that States in our federal system retain the sovereign power to 'engage in War' when 'actually invaded,' and States do not require the 'Consent of Congress' to do so...\"\n\"Arizona therefore has the power to defend itself from this invasion under the Governor's authority as Commander-in-Chief.",
    "In fact, Brnovich's opinion does say the National Guard is the state's militia and the governor is \"commander-in-chief\":\n\"Only the Governor of the State of Arizona has the power to make a final determination that such exercise (of military self-defense) is justified.\"",
    "TODAY our office issued a legal opinion determining the current crisis at Arizona’s southern border, fueled by violence and lawlessness of cartels & gangs, legally qualifies as an “invasion” under the U.S. Constitution, & AZ has the power to defend itself.",
    "Here's what we know:\nBrnovich's legal opinion asserts that under the U.S. Constitution, the statements of the Founding Fathers and legal precedent, states like Arizona have a right to respond with force to what Brnovich labels an \"invasion.\"",
    "\"This is a back-of-the envelope opinion that would be thrown out of court in half a second,\" Bier said in an interview from Washington, D.C.\n\"The idea that he is representing the Founders' view on this issue is totally incorrect.",
    "After a detailed critique of what he called a \"stunningly sloppy\" opinion, longtime conservative columnist Robert Robb of the Arizona Republic wrote:\n\"Brnovich is cheating, and misserving, the people of Arizona in his day job.\"",
    "\"This is going to be laughed out of any court if they actually try to use the power,\" said David Bier, an immigration policy expert at the Libertarian Cato Institute who's worked for a Republican member of Congress.",
    "According to Tim Steller, columnist for the Arizona Daily Star, Brnovich is in an impossible position:\n\"If he doesn't bring an indictment, some Republican voters and interests will punish him.",
    "Republican Attorney General Mark Brnovich is being applauded on the right for putting his legal heft behind the \"invasion\" rhetoric that's simmered for years among immigration hard-liners.",
    "When asked again whether he'd deploy the Arizona National Guard, which Ducey commands, to repel an invasion, the governor responded: \"I think you ought to read the opinion in full...",
    "Greg Abbott, Ducey's frequent border ally in their fight against Democratic President Joe Biden, has deployed thousands of Guard troops to the Texas border.",
    "In every single instance, they said the invasion clause of the Constitution does not apply to civil violations or criminal violations of immigration law.\"",
    "Ducey initially dodged the question, citing steps he's taken to beef up border security, such as a \"Border Strike Force\" to stem the flow of drugs.",
    "(Brnovich has not investigated any of the documented cases of election interference by Republicans, dating back to the days after the 2020 vote.)",
    "David Bier of the Cato Institute reflects a widely-held view among analysts and attorneys: Brnovich's opinion gets the law and the history wrong.",
    "For the last five months he has investigated the results of Senate Republicans' partisan review of Maricopa County's 2020 presidential vote.",
    "Brnovich has come under intense pressure from Trump Republicans and Trump himself to file criminal charges based on the Cyber Ninjas report.",
    "Critics say the AG's office has become a legal mill for lawsuits and opinions drafted to appeal to the Trump base of the Republican Party.",
    "Ducey about the opinion on Wednesday, after he spoke to a tech investing conference at the WM Phoenix Open in North Scottsdale.",
    "The report, compiled by lead contractor Cyber Ninjas, has been thoroughly refuted by the Maricopa County Elections Department.",
    "\"It does have a toxic effect on society once people start believing these people are here to kill us or harm us in some way.\"",
    "\"When (the Founding Fathers) talk about 'invasion,' they're talking about a real invasion,\" Bender told the Arizona Mirror.",
    "But the attorney general is coming under fire from critics who say he's using law office to help U.S. Senate campaign.",
    "An actual invasion permits the State to engage in defensive actions within its own territory at or near its border.\"",
    "\"We're already seeing the Guard in Texas take part in civil arrests for misdemeanor, trespassing offenses,\" he said.",
    "The Founders were quite clear that the invasion clause is, as James Madison put it, an operation of the military.\"",
    "Brnovich has come under fire in recent weeks for using the attorney general's office as a campaign headquarters.",
    "\"It's normal criminal activity (that) can be prosecuted under normal criminal statutes,\" Bier said.",
    "\"There's nothing preventing Arizona from taking action against criminal enterprises in its state.\"",
    "Brnovich issued the opinion at the request of Republican State Rep. Jake Hoffman of Queen Creek.",
    "The two-term attorney general is running in the crowded Republican primary for the U.S. Senate.",
    "https://t.co/VqOCI9qGHk\n— Mark Brnovich (@GeneralBrnovich) February 7, 2022\n12 News asked Gov.",
    "Hoffman is embroiled in his own scandal as one of the \"phony electors\" for Donald Trump.",
    "Bier added: \"Courts have already considered the question of whether this is an invasion.",
    "It's a massive expenditure of state resources for little or no benefit to the state.\"",
    "They didn't use the word 'invasion' to talk about what Brnovich is talking about.\"",
    "\"I wish these people who use the language in this way would reconsider,\" he said.",
    "Paul Bender, a constitutional law professor at Arizona State University, agreed.",
    "\"It's a no-win situation that neither he, nor we as Arizonans, should be in.",
    "\"We'll continue to do everything we can on the state's behalf,\" Ducey said.",
    "Texas' massive Guard deployment shows what Arizona could do, Bier said.",
    "Catch up on the latest news and stories on the 12 News YouTube channel.",
    "But the Republican governor is apparently ignoring Brnovich's opinion.",
    "Bier said the state already had the tools to respond to drug cartels.",
    "Ducey has deployed Guard troops in support roles for law enforcement.",
    "If he does, any charges will appear to be political performance.",
    "PHOENIX — Arizona's top law enforcement officer has given Gov.",
    "Doug Ducey a green light to \"engage in a war\" at the border.",
    "But Bier warns that the \"invasion\" rhetoric comes at a cost.",
    "The candidates are competing for Donald Trump's endorsement.",
    "\"This is meant to be something other than criminal behavior.",
    "Brnovich greatest legal and political challenge lies ahead.",
    "Immigration policy and legal experts are shredding it.",
    "\"That's an option, if Arizona wants to pursue that.",
    "Critics have called the operation a \"disaster.\"",
    "It doesn't even mention the National Guard.\"",
    "Ducey is apparently ignoring the opinion.",
    "\"The solution is for Brnovich to resign.\"",
    "Subscribe today.",
    "Texas Gov.",
    "Gov."
  ]
}