{
  "id": 2121,
  "mediaId": 2600,
  "date": "2022-02-09",
  "headline": "States Sue Biden Over Min Wage Increase",
  "image": "https://www.investmentwatchblog.com/wp-content/uploads/2018/03/logo81-1-150x130.jpg",
  "link": "https://www.investmentwatchblog.com/states-sue-biden-over-min-wage-increase/",
  "mediaOutlet": "investmentwatchblog.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "IWB",
  "authorUrl": "",
  "termIds": [
    3226,
    4905,
    3401,
    1444,
    6678
  ],
  "sentences": [
    "Walsh previously said in November 2021 that implementing the measure “improves the economic security of these workers and their families, many of whom are women and people of color.”\nwww.theepochtimes.com/5-states-sue-biden-over-minimum-wage-increase-for-federal-contractors_4265676.html?utm_source=partner&utm_campaign=BonginoReport",
    "The attorneys general of Arizona, Idaho, Indiana, Nebraska, and South Carolina, led by Arizona Attorney General Mark Brnovich, mounted a federal lawsuit (pdf) arguing that President Joe Biden lacked statutory authority when he signed an executive order on April 27, 2021, to mandate the minimum wage.",
    "The five attorneys general noted in their lawsuit that the U.S. Senate had rejected the administration’s proposal to include a $15 per hour wage increase in the coronavirus relief package, in a vote of 42–58, but Biden was “undeterred” and decided to enact that measure via executive order.",
    "Defendants in the case are the U.S. Department of Labor and its Wage and Hour Division, President Joe Biden, U.S. Secretary of Labor Marty Walsh, and Acting Administrator of the Wage and Hour Division of the U.S. Department of Labor Jessica Looman.",
    "Five U.S. states are suing the Biden administration over its new minimum wage hike that requires federal agencies to pay contractors $15 per hour.",
    "As announced by the Department of Labor (DOL), the rule applies in all 50 states, the District of Columbia, and specified U.S. territories.",
    "It requires employers to pay a minimum of $15 per hour for employees working on or in connection with covered federal contracts.",
    "The change went into effect on Jan. 30, covering some 500,000 businesses that employ one-fifth of the entire U.S. labor force.",
    "The wage is subject to yearly increases, as determined by DOL, to account for inflation."
  ]
}