{
  "id": 214,
  "mediaId": 8262,
  "date": "2022-02-24",
  "headline": "San Francisco, Arizona set to square off in Supreme Court over Trump immigration rule",
  "image": "https://gray-kcrg-prod.cdn.arcpublishing.com/resizer/47ZKX_4KA81cOBiuTFEryMl3Qec=/980x0/filters:focal(826x310:836x300):quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/WBXU3QFUIBE5TNK7GH3CE7HNIM.jpg",
  "link": "https://www.kcrg.com/2022/02/22/san-francisco-arizona-set-square-off-supreme-court-over-trump-immigration-rule/",
  "mediaOutlet": "arizona.statenews.net",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Zampa",
  "authorUrl": "https://www.kcrg.com/authors/peter-zampa/",
  "termIds": [
    0
  ],
  "sentences": [
    "San Francisco was one of a number of jurisdictions that sued, arguing that the policy would make it too hard for immigrants to succeed in the U.S. San Francisco City Attorney David Chiu said the Biden Administration was right not to defend the rule.",
    "Trump’s “public charge rule” said immigrants could not become permanent U.S. citizens if they relied too heavily on government assistance by utilizing food stamps, Medicaid, and other social welfare benefits.",
    "The state of Arizona is squaring off with the city and County of San Francisco over a Trump-era immigration rule that would have made it more difficult for immigrants to get a green card.",
    "“People have argued that it encourages sometimes illegal immigration if you provide those benefits, so the states have an interest here,” said Brnovich.",
    "The Trump legal team was ready to take the case to the Supreme Court, but when he left office, the Biden administration stopped defending the rule.",
    "Chiu said with lower courts throwing out the Trump rule, and a new administration in office, there is no chance his policy will go into effect.",
    "“Intervention, which is the theory of law that we’re talking about here that allows a party to step in for another party, it’s not unheard of.",
    "The nation’s highest court will answer whether Arizona, and other states, can continue defending the rule where the Trump legal team left off.",
    "Oral arguments are set to begin Wednesday morning at 10 a.m. A ruling from the court is not expected until the spring or early summer.",
    "The question the court will have to answer is whether these states can pick up where the Trump team left off defending the rule.",
    "Chiu believes these states intervening in the legal defense are simply trying to revive a hateful policy.",
    "“Any administration, any president, must follow the law,” said Attorney General Mark Brnovich (R-Ariz.).",
    "WASHINGTON (Gray DC) - An immigration fight is making its way to the nation’s high court this week.",
    "“President Trump was proposing that we deny people benefits simply because they were immigrants.",
    "That is when the state of Arizona and others tried to step in to continue defending the policy.",
    "Brnovich will be in the court Wednesday making his case to the conservative majority bench.",
    "But we just don’t think in this circumstance that intervention is appropriate,” said Chiu.",
    "The rule was blocked in lower courts in 2020, months after its unveiling.",
    "He was proposing, effectively, a wealth test,” said Chiu.",
    "Copyright 2022 Gray DC.",
    "All rights reserved."
  ]
}