{
  "id": 2345,
  "mediaId": 2548,
  "date": "2022-02-07",
  "headline": "AG Says His State Is Under ‘Invasion’ From Illegal Migrants, Threatens To Defy Biden And Defend The Border",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/02/GettyImages-71267278-scaled-e1644275309233.jpg",
  "link": "https://dailycaller.com/2022/02/07/arizona-attorney-general-mark-brnovich-invasion-southern-border/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brianna Lyman",
  "authorUrl": "https://dailycaller.com/author/brianna@dailycaller.com",
  "termIds": [
    0
  ],
  "sentences": [
    "Republicans have pointed to Article 1 Section 10 of the Constitution to argue that “a State may defend itself when it has been ‘actually invaded, or in such imminent Danger as will not admit of delay,’ and the State does not need the consent of Congress to do so.”\nThe opinion mentions founder James Madison, who “cited Virginia using its militia to stop smugglers as an example of a valid exercise of the invasion power.” It further claims that under the Import-Export Clause, states have the right to inspect goods at the ports of entry, “this is an aspect of the historical police power that is expressly preserved for the States.”\nBrnovich said the “on-the-ground violence and lawlessness at Arizona’s border caused by cartels and gangs is extensive, well-documented, and persistent” and “can satisfy the definition of ‘actually invaded’ and ‘invasion’ under the U.S. Constitution.”\nIt is now up for Republican Arizona Gov.",
    "“The Founders foresaw that States might need to protect themselves from invasion and made clear in the Constitution that States retain the sovereign power to defend themselves within their own territory.”\nTODAY our office issued a legal opinion determining the current crisis at Arizona’s southern border, fueled by violence and lawlessness of cartels & gangs, legally qualifies as an “invasion” under the U.S. Constitution, & AZ has the power to defend itself.",
    "Republican Arizona Attorney General Mark Brnovich issued an opinion Monday calling the crisis at the border an “invasion,” claiming that by declaring it as such the state is allowed to take more action to defend itself against the “invasion.”\n“The federal government’s failure to secure the border and protect Arizona from invasion is dangerous and unprecedented,” Brnovich said in a statement.",
    "https://t.co/VqOCI9qGHk\n— Mark Brnovich (@GeneralBrnovich) February 7, 2022\n“The violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an ‘invasion’ under the U.S. Constitution, and Arizona therefore has the power to defend itself from this invasion under the Governor’s authority as Commander-in-Chief,” the statement continued.",
    "Republican Yuma Mayor Douglas Nicholls declared a local emergency in December due to “unprecedented numbers of migrants entering the city … resulting in a humanitarian and border crisis.”\nNicholls cited data showing a 2,647% increase in number of migrant encounters since Oct. 1.",
    "(RELATED: EXCLUSIVE: Videos Show Migrants Crossing Into Arizona With No Border Patrol In Sight)\nU.S. Customs and Border Protection ended 2021 with more than 2 million migrant encounters, according to data.",
    "“An actual invasion permits the State to engage in defensive actions within its own territory at or near its border,” the statement said.",
    "Doug Ducey to “make a final determination” as to whether or not to use defensive force, according to the opinion."
  ]
}