{
  "id": 2373,
  "mediaId": 8475,
  "date": "2022-02-07",
  "headline": "Brnovich: Ducey could send troops to border to defend Arizona from 'invasion' of cartels, smugglers",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/soldiers-border.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/020722_brnovich_border/brnovich-ducey-could-send-troops-border-defend-arizona-from-invasion-cartels-smugglers/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Small",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/37438",
  "termIds": [
    0
  ],
  "sentences": [
    "One critical error, Vladeck said, is that Brnovich's reading of the \"invasion clause\" recognizes the duty the federal government has to protect states from invasion, but \"it misses the importance of that provision — which is to leave to democratically elected representatives at the federal level the decision of how best to do that.\"",
    "He also noted that Brnovich relies heavily on a series of concurring and dissenting opinions from U.S. Supreme Court justices — but not opinions from the court itself — and a New York case about COVID-19 rules for landlords to support his view that governors can override federal immigration laws and policy choices.",
    "\"The violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an 'invasion' under the U.S. Constitution, and Arizona therefore has the power to defend itself from this invasion under the Governor's authority as Commander-in-Chief,\" Brnovich wrote.",
    "The opinion stemmed from questions posed by Rep. Jake Hoffman, R-Queen Creek, who asked whether the U.S. Constitution's authorization of military action for \"invasion\" refers only to foreign powers, or if hostile non-state actors — armed cartels and gangs — would satisfy the requirement.",
    "While war powers are granted to Congress, the state self-defense clause does allow for states to defend themselves, including \"engag(ing) in War,\" if they are \"actually invaded\" or are in such imminent danger that waiting for congressional action is impractical.",
    "\"The memo's attempt to align 'war' and 'invasion' with any criminal conduct by organized non-state groups — conduct that can be, and is, handled through ordinary law enforcement — suggests that the memo's analysis fails even on its own terms,\" he said.",
    "But while Brnovich is correct that the Constitution allows states to defend themselves in extreme circumstances, University of Texas law professor and constitutional scholar Steve Vladeck said the AG's analysis doesn't hold up to scrutiny.",
    "Last month, nativist GOP lawmakers and immigration activists called on Ducey to militarize the border and deploy the National Guard, citing the same constitutional provisions that Brnovich did in his legal opinion.",
    "He also wanted Brnovich to weigh in on whether the federal government's \"severely degraded… operational control of the border\" that is leading to increased drug- and human-smuggling would qualify as an invasion.",
    "Doug Ducey would be on solid constitutional ground if he invoked war powers and sent the Arizona National Guard to the U.S-Mexico border to stop what he says is an \"invasion\" of drug cartels and criminal gangs.",
    "In writing this opinion, Brnovich joins far-right immigration advocates who want to limit all immigration, both legal and illegal, and believe that military force is the best solution to combat the latter.",
    "For Attorney General Brnovich to imply the Guard is not on our border does them a serious disservice and shows that he fails to appreciate the commitment these men and women have to protecting Arizona.\"",
    "It has also been used by white supremacist terrorists like the El Paso shooter, who targeted Mexicans at a Walmart, and the Christchurch, gunman who killed Muslims at two mosques in New Zealand.",
    "And even though they aren't an invading foreign power, he said they satisfy the constitutional definition of an invasion and clear the way for Ducey to authorize military action at the border.",
    "A spokesman for Ducey took aim at the Biden administration for its immigration policies, and also criticized Brnovich for writing implying that the governor hadn't taken action on the border.",
    "Border security has been a central plank of Brnovich's campaign for the U.S. Senate, and he has sought to portray himself as an immigration hawk to separate himself from his GOP opponents.",
    "Madison, the AG noted, was clear that states have every right to respond with military force if they are invaded or are in imminent danger: \"When in such danger, they are not restrained.\"",
    "Arizona State University law professor Paul Bender said it's impossible to separate Brnovich's legal conclusion — and its \"completely wrong perspective — from his political aspirations.",
    "Brnovich, a Republican who is running for U.S. Senate, teed off on the Biden administration, accusing it of \"unprecedented actions…to destroy operational control of the border.\"",
    "Ducey has deployed about 150 members of the Arizona National Guard on a \"border security mission,\" but they are not there to actively defend the state in a military capacity.",
    "Rather, their mission is to support local and state law enforcement with camera maintenance and monitoring, and medical operations in detention centers, among other things.",
    "But more than that, Vladeck said that Brnovich's opinion is built on the premise that a military response is needed to respond to criminal conduct shows the faulty logic.",
    "\"The word 'invasion' here, after power had been given in the former clause to repel invasions, may be thought tautologous, but it has a different meaning from the other.",
    "The former restricts states from forming their own militaries and going to war, while the latter guarantees that the U.S. government will protect states from invasions.",
    "\"Acting as if they are above the law, Mexican and Central American cartels are engaging in brazen attacks on Arizona, trafficking in drugs and human beings,\" he wrote.",
    "Because courts have never directly said otherwise, Brnovich concluded that there is no reason to believe that an invasion can't also be carried out by criminal gangs.",
    "\"Arizona has and will continue to protect our communities with our National Guard, our Border Strike Force and in partnership with local law enforcement.",
    "\"The on-the-ground violence and lawlessness at Arizona's border caused by cartels and gangs is extensive, well-documented, and persistent,\" he wrote.",
    "In a legal opinion published Monday, Brnovich wrote that the state is being \"actually invaded\" by drug cartels, gangs and human-smuggling operations.",
    "\"The number of people and drugs we have seen come across our border this year is unprecedented… This administration needs to be held accountable.",
    "The result, he says, is record amounts of drugs being smuggled into the United States from Mexico, human smuggling, sex trafficking and violence.",
    "Rather, he told the delegates, the Constitution had already given the federal government the responsibility of defending against foreign powers.",
    "They have totally failed to address this very real public safety and humanitarian crisis,\" said CJ Karamargin, Ducey's communications director.",
    "\"No State should be put in the position that Arizona and other border states have been put in through the federal government's recent actions.\"",
    "Brnovich's legal opinion focused on two provisions in the U.S. Constitution: The state self-defense clause and the invasion clause.",
    "\"The State Self-Defense Clause exists precisely for situations such as the present, to ensure that States are not left helpless.\"",
    "In assessing whether Arizona is facing an \"invasion,\" Brnovich said the state faces an \"unprecedented crisis\" at the border.",
    "However, Madison's discussion of state militias and invasions wasn't about non-state actors — or even foreign nations.",
    "\"An actual invasion permits the State to engage in defensive actions within its own territory at or near its border.\"",
    "His analysis leans heavily on comments James Madison made at the Virginia Ratifying Convention in 1788.",
    "\"When (the Founding Fathers) talk about 'invasion,' they're talking about a real invasion,\" he said.",
    "Bender agreed: \"The intention wasn't to let a state AG fight a war over regular criminal activity.\"",
    "That includes deploying National Guard troops in April 2021 and extending their mission in August.",
    "The \"invasion\" terminology has long been used by the nativist movement in Arizona and elsewhere.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "The southern border is being flooded by cartels and gangs, trafficking people and drugs.",
    "They didn't use the word 'invasion' to talk about what Brnovich is talking about.\"",
    "It means that it shall be protected from invasion by other States,\" he said.",
    "This is an invasion and Arizona has the right to defend itself!\"",
    "\"This is meant to be something other than criminal behavior.",
    "The legal opinion Monday quickly became a campaign tool.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "Local\nArizona Attorney General Mark Brnovich says Gov.",
    "\"I'm declaring war on the southern border invasion.",
    "Brnovich declared on his campaign's Twitter page.",
    "This clause speaks of a particular State.",
    "Thanks for reading TucsonSentinel.com.",
    "Like what you're reading?",
    "- 30 -"
  ]
}