{
  "id": 2380,
  "mediaId": 2520,
  "date": "2022-02-10",
  "headline": "The Republican 'war' at the border is a bluff. They aren't about to take on the cartels",
  "image": "https://www.gannett-cdn.com/presto/2021/04/21/PPHX/a5acab08-bd6a-4e49-8242-4cca236ad335-DW1_0107.JPG?crop=3121,1756,x0,y0&width=3121&height=1756&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/elviadiaz/2022/02/10/republican-border-war-bluff-fight-drugs-opioid-fentanyl-overdoses-cartels/6714916001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elvia Díaz",
  "authorUrl": "https://www.azcentral.com/staff/2647952001/elvia-daz/",
  "termIds": [
    5268,
    3401,
    2915,
    1126,
    392,
    6383,
    6678
  ],
  "sentences": [
    "It’s clear who won – not just in Mexico but north of the border where cartel distribution networks reach all corners of the U.S.\nAmericans, gullible enough to believe politicians, are eating up the “border invasion” rhetoric while people are dying of overdoses courtesy of the cartels operating on America’s streets.",
    "If they were serious about going after the cartels, they would have done so already at the U.S.-Mexico border, and most importantly, in the heartland where traffickers are easily distributing drugs that killed more than 100,000 people just last year.",
    "America’s drug war, which President Richard Nixon started in 1971, has failed because it has primarily focused on the countries supplying the drugs, including Mexico, Colombia, China and Afghanistan.",
    "America isn't doing enough to curb demand\nMeanwhile, not enough attention and resources are given “to the demand side.”\nAnd now more than 100,000 people have lost their lives, mostly due to fentanyl.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "But it’s also too bad that he and others are distracting voters with a “border invasion” of mainly poor and desperate asylum seekers instead of joining forces with Democrats to fight the cartels.",
    "That deserves serious attention – not just sending a handful of National Guardsmen to the border to support law enforcement or setting up a mostly ineffective Border Strike Force.",
    "Fight real problems, don't offer distractions\nGovernors like Ducey can’t arbitrarily declare war – the Founding Fathers left that responsibility up to the federal government.",
    "For all their tough talk, they don’t really mean to crack down on transnational cartels that are blanketing the U.S. market with fentanyl and all sorts of other deadly drugs.",
    "But bluffing about waging an unconstitutional war at the southern border gets the public’s attention, which they need to win voters leading up to this year’s midterms.",
    "Mexicans have paid heavily for this drug war\nThe Mexican people have paid a heavy price in that country’s war on drugs – the body count surpassing more than 250,000.",
    "But synthetics can now “be manufactured almost anywhere, using easily obtainable chemicals,” according to extensive reporting by The Wall Street Journal.",
    "Opinion: Republicans talk tough on border security, but they're bluffing about going after the drug cartels and seriously addressing overdoses at home.",
    "A real and thoughtful war on drugs could help Mexicans desperate to end the cartel killings, and most importantly, curtail Americans’ demand for drugs.",
    "Republicans are good at staying on the “border invasion” message, which is to attack illegal immigration and blame the Democrats for it.",
    "“The U.S. has never taken the demand side of things seriously,” former Mexican President Felipe Calderón told The Wall Street Journal.",
    "The GOP is using that strategy nationally to win governorships and local races, and to take the U.S. Congress back from Democrats.",
    "Still, Ducey is peddling the notion that America is under attack at the southern border and that drug cartels must be reined in.",
    "Unfortunately, the death toll is likely to rise in part because potent drugs like fentanyl are readily available in the U.S.",
    "Arizona Republican Attorney General Mark Brnovich this week issued a legal opinion effectively saying that Republican Gov.",
    "But that’s inconsequential for Brnovich who doesn’t mind making a fool of himself in his quest to become a U.S. senator.",
    "Americans remain oblivious to the deadly war raging south of the border while our own people consume the narcotics.",
    "Ducey and other local leaders need to do more to curb drug trafficking and tackle the huge drug addiction problem.",
    "They aren’t going after the cartels operating freely and violently in Mexico and distributing the drugs here.",
    "Drug overdoses increased by 28% from last year, according to the Centers for Disease Control and Prevention.",
    "Calderón unleashed the Mexican war on cartels during his 2006-12 presidency that has left a trail of bodies.",
    "The CDC defines fentanyl as a synthetic opioid, which is 50 to 100 times more potent than morphine.",
    "The Republican war against drug cartels is all a bluff – and that’s most unfortunate.",
    "There’s no question that Mexican cartels are smuggling fentanyl to the U.S.",
    "Ducey is smart not to take Brnovich’s opinion to declare war seriously.",
    "It really is too bad the Republicans holding office are just bluffing.",
    "Elvia Díaz is an editorial columnist for The Republic and azcentral.",
    "Reach her at 602-444-8606 or elvia.diaz@arizonarepublic.com.",
    "That argument is highly disputed by constitutional lawyers.",
    "'Invasion' is a good soundbite for voters\nCase in point.",
    "Ducey is termed out and isn’t running for anything yet.",
    "Doug Ducey can send troops to the border.",
    "Follow her on Twitter, @elviadiaz1.",
    "But it’s all an illusion.",
    "Calderón is right."
  ]
}