{
  "id": 3009,
  "mediaId": 8475,
  "date": "2022-01-30",
  "headline": "Jan. 6 congressional panel subpoenas bogus pro-Trump electors from Arizona, 6 other states",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/013122_electoral-college-protest.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/013122_az_bogus_electors/jan-6-congressional-panel-subpoenas-bogus-pro-trump-electors-from-arizona-6-other-states/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Shutt",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110076",
  "termIds": [
    0
  ],
  "sentences": [
    "The select committee’s letters to the “alternate electors” said its members were not seeking information about political views or activities in the 2020 presidential campaign, but information about their “role and participation in the purported slate of electors casting votes for Donald Trump and, to the extent relevant, your role in the events of January 6, 2021.”\nSo far, the Justice Department has charged more than 725 people with crimes from their activities that day, with 165 of those people pleading guilty to a range of federal charges.",
    "The other alternate elector subpoenas went to Arizona chair Nancy Cottle, Arizona secretary Loraine B. Pellegrino, Georgia secretary Shawn Still, Michigan secretary Mayra Rodriguez, New Mexico chairperson Jewll Powdrell, New Mexico secretary Deborah W. Maestas, Nevada secretary James DeGraffenreid, Pennsylvania chairperson Bill Bachenberg, Pennsylvania secretary Lisa Patton, Wisconsin chairperson Andrew Hitt and Wisconsin secretary Kelly Ruh.",
    "“We believe the individuals we have subpoenaed today have information about how these so-called alternate electors met and who was behind that scheme.”\nThe list of individuals contains some high-ranking Republican officials, including Michigan National Committeewoman Kathy Berden, Chairman of the Nevada Republican Party Michael J. McDonald and Georgia Republican Party Chairman David Shafer.",
    "The Justice Department is also looking into the activities of the “alternate electors.”\nDeputy Attorney General Lisa Monaco told CNN earlier this week that investigators were scrutinizing the “fraudulent elector certifications.”\nThanks to our donors and sponsors for their support of local independent reporting.",
    "“The Select Committee is seeking information about attempts in multiple states to overturn the results of the 2020 election, including the planning and coordination of efforts to send false slates of electors to the National Archives,” Chairman Bennie G. Thompson, a Mississippi Democrat, said in a statement.",
    "The panel has subpoenaed several high-ranking Trump administration officials, and the House of Representatives held former White House Chief of Staff Mark Meadows and aide Steve Bannon in contempt of Congress for refusing to cooperate with those subpoenas.",
    "The subpoenas are part of the Jan. 6 select committee’s ongoing investigation into the attack on the Capitol building that temporarily delayed the certification of the presidential election after rioters attacked and entered the building.",
    "The subpoenas ask the individuals to provide before Feb. 11 various documents regarding their role in selecting the “alternate” electors and to appear for depositions before the committee at different dates in February.",
    "The groups had met in December 2020 to sign documents assigning their respective states’ Electoral College votes to former President Donald Trump — though their states actually voted to elect Joe Biden as president.",
    "The committee has requested information from House Minority Leader Kevin McCarthy, a California Republican whose refusal to cooperate has led to discussions about whether the panel should subpoena him as well.",
    "The congressional committee investigating the Jan. 6 attack on the U.S. Capitol subpoenaed on Friday 14 people from seven states who participated as fake electors following the 2020 presidential election.",
    "Various Republicans then urged the Trump administration to use the slates of bogus electors as a reason to block the certification of the election during a joint session of Congress on Jan. 6, 2021.",
    "“We are going to follow the facts and the law wherever they lead to address conduct of any kind and at any level that is part of an assault on our democracy,” Monaco said, according to The Guardian.",
    "The Select Committee to Investigate the January 6th Attack on the United States Capitol has subpoenaed the chairperson and secretary of each of the groups from the seven states.",
    "Groups from Arizona, Georgia, Michigan, New Mexico, Nevada, Pennsylvania and Wisconsin all allegedly sent in lists of so-called alternate electors to the National Archives.",
    "State officials throughout the country are also looking into potential charges against the individuals who signed the documents that approved false electors for Trump.",
    "Arizona Attorney General Mark Brnovich indicated to KTAR’s The Mike Broomhead Show on Friday that his office isn’t looking into matter.",
    "And so anybody that has any questions or concerns related to that should contact the Department of Justice,” Brnovich told Broomhead.",
    "Cottle and Pellegrino did not respond to requests for comment from the Arizona Mirror.",
    "“The U.S. Department of Justice is exercising its original jurisdiction in that case.",
    "Join Mark Baudendistel, Richard Ducote, and Jonathan Hoffman and contribute today!",
    "Jacob Fischler and Jeremy Duda contributed to this report.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "Thanks for reading TucsonSentinel.com.",
    "- 30 -"
  ]
}