{
  "id": 3046,
  "mediaId": 2514,
  "date": "2022-02-02",
  "headline": "Two 'alternate electors' sue Jan. 6 committee to block subpoena",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220202-kelli-ward-michael-ward-ew-617p-876a67.jpg",
  "link": "https://www.nbcnews.com/politics/donald-trump/two-alternate-electors-sue-jan-6-committee-block-subpoena-rcna14669",
  "mediaOutlet": "AOL",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5624,
    4905,
    3401,
    3332,
    2765,
    1458,
    1442,
    5949,
    6431,
    6729
  ],
  "sentences": [
    "The suit says that Kelli Ward “derives meaning and satisfaction from her work outside of politics as a doctor” and that since December 2019 she “has practiced medicine exclusively in the field of medical weight loss.”\nIt says that \"for many of Kelli Ward’s patients, the mere fact that they are seeing a doctor for medical weight loss is a sensitive issue, and some bring up other issues ... all of which are intensely personal and private medical concerns.\"",
    "The suit contends that if T-Mobile were to hand over their records to the committee, it would \"violate state and federal privileges of medical privacy and physician-client communications; and substantially infringe the right to privacy guaranteed under Arizona state law by invading the Plaintiffs’ seclusion.\"",
    "The case involving the lawsuit was initially assigned to U.S. District Judge Susan Brnovich, a Trump appointee whose husband, Arizona Attorney General Mark Brnovich, was criticized by Trump at a rally in the state last month for not doing more to investigate \"fraud\" in the 2020 election.",
    "Justice Department could pursue charges against states involved in fake electors scandal\nFeb. 2, 202204:10\nThe House panel issued subpoenas last week to 14 of the 84 so-called alternate electors who falsely claimed that then-President Donald Trump had won the election in their states.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nCertificates purporting to be from Trump electors were sent to Washington by Republicans in seven battleground states — Arizona, Georgia, Michigan, Nevada, New Mexico, Pennsylvania and Wisconsin.",
    "The lawsuit made many of the same arguments that have been raised by other Trump allies resisting the committee's subpoenas, including the assertion that the panel does not have enough Republicans and that its subpoenas lack a \"legislative purpose.\"",
    "Kelli Ward, the Arizona GOP chair, and her husband, Michael Ward, argued in papers filed Tuesday in federal court in Arizona that the congressional panel should be prevented from getting their phone records because they are doctors.",
    "The suit goes on to say the subpoena seeks \"the records of incoming and outgoing calls, their durations and associated phone numbers, and information about the callers commonly called 'metadata,' or call data records.\"",
    "The Wards were not among the 14 fake electors the House panel named last week, but the suit says the committee subpoenaed their phone records last month, focusing on the period from Nov. 1, 2020, to Jan. 31, 2021.",
    "Ward, an ardent Trump supporter who fought to overturn President Joe Biden's electoral victory in Arizona, and her husband were part of a bogus slate of electors, which she celebrated on YouTube at the time.",
    "Several experts on election law said the Justice Department could pursue criminal charges related to the filing of Electoral College votes for Trump from states that voted for Biden in 2020.",
    "A pair of so-called alternate electors sued this week to block the House committee investigating the Jan. 6 riot at the U.S. Capitol from getting their phone records.",
    "The lawsuit said the Wards found out about the subpoenas when T-Mobile notified them that the panel had requested their and their company's phone records.",
    "T-Mobile told them the records would be turned over by Feb. 4 unless they challenged the subpoena in court, according to the lawsuit.",
    "“We believe that we are the electors for the legally cast votes here in Arizona,” she said in a video posted Dec. 15, 2020.",
    "Brnovich on Wednesday recused herself from the case, which has since been assigned to another judge.",
    "A spokesperson for the Jan. 6 committee did not immediately respond to a request for comment.",
    "There is no indication that the panel is seeking information about the content of the calls.",
    "The argument that the subpoenas would violate doctor-patient privacy appears to be a first.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Kelli Ward spoke at the rally, the Arizona Capitol Times reported.",
    "Those arguments have not gained traction in court."
  ]
}