{
  "id": 3650,
  "mediaId": 8322,
  "date": "2022-01-24",
  "headline": "Why states are fighting Biden's vaccine mandates",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/bbaceef2-5e7d-4e4a-8bb2-19ad0582eeed/ed97c74d-8b2e-4c4e-a3f0-9bdc996ab2f9/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/opinion/why-states-fighting-bidens-vaccine-mandates-arizona-ag-mark-brnovich",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Brnovich",
  "authorUrl": "https://www.foxnews.com/person/b/mark-brnovich",
  "termIds": [
    4905,
    254,
    6678
  ],
  "sentences": [
    "After months of expressing his growing impatience with Americans who declined to take the experimental vaccines, President Biden unilaterally ordered sweeping COVID-19 vaccine mandates across the country for federal contractors, certain health care workers, and employees of businesses with 100 or more people.",
    "The fact that many of these workers who may now lose their jobs are the same heroic first responders who have been, and continue to, help our nation through this pandemic, makes the president’s actions even more reprehensible.",
    "That’s why my office and other attorneys general from across our country have taken legal action to stop these COVID-19 vaccine mandates before it’s too late, including winning at the U.S. Supreme Court with the OSHA mandate.",
    "Such ignorant comments support the widely held perception that many of our elected leaders are out of touch with the real-world lives of the people they are supposed to be serving.",
    "We will not stand by and allow a radical and overreaching federal government to ignore our nation’s Constitution and trample the livelihoods and civil rights of honest Americans.",
    "I’m proud to be the first attorney general to sue the president to block him from forcing federal employees and contractors to choose between their jobs and the vaccine.",
    "Under the Biden administration’s logic, the federal government could enact mandates on hot wings and cheeseburgers to \"save\" Americans from their \"bad\" eating habits.",
    "Nowhere in this timeless document does it confer the power for any sitting president to unilaterally decide what all American citizens must inject into their bodies.",
    "This is especially important during times of emergency because public fear can do strange things to people, resulting in significant jeopardy to our civil rights.",
    "Biden’s allies claim that is not an illegal mandate because people can simply choose to leave their jobs if they do not want to take the experimental vaccine.",
    "What makes the Constitution more than merely beautiful words on paper though, is our commitment to uphold and enforce it as the highest law of the land.",
    "It is our formal expression of who we are as a nation, and it has successfully served as a North Star through every challenge Americans have faced.",
    "Can you fathom asking someone to give up their job, medical coverage and retirement just to satisfy a frustrated and impulsive president?",
    "Another lawsuit took on the OSHA rule for private businesses with more than 100 employees, which the Supreme Court recently struck down.",
    "If left unchallenged, the unfettered power of the federal government could have been easily used in other hypothetical situations.",
    "Powers not enumerated are reserved to the states, which are to act as checks against a centralization of power in Washington, D.C.",
    "IT'S TIME TO PIVOT\nOur Constitution establishes the role for the federal government with authority that is clearly defined.",
    "As far as the COVID-19 pandemic goes, the decision to vaccinate or not must be left to individuals and their physicians.",
    "We must all stand together to preserve our Constitution and our individual liberties, especially in times of emergency.",
    "The president does not have the power to compel and enforce vaccinations on Americans.",
    "My colleagues and I challenged the CMS rule for health care workers and providers.",
    "Heart disease kills approximately 700,000 people in the United States each year.",
    "Three of these unlawful mandates have now been put on hold by our courts.",
    "The Constitution of the United States is the bedrock of our country.",
    "The federal government doesn’t get to be your nanny or your doctor.",
    "AMERICANS ARE BEING KEPT IN A PERPETUAL STATE OF COVID PANIC.",
    "Banning beer drinking and limiting our coffee intake?",
    "The latest example involves the COVID-19 vaccines.",
    "It is unconscionable.",
    "What’s next?"
  ]
}