{
  "id": 3937,
  "mediaId": 8347,
  "date": "2022-01-27",
  "headline": "Attorney General Brnovich co-leads 25 states in defending 2nd Amendment",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/589f651/2147483647/strip/true/crop/3000x1575+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F16%2Fb1%2F6fb032a24b6f84120cb03dcb69dc%2Fap-20007761223154.jpg",
  "link": "https://www.kgun9.com/news/state/attorney-general-brnovich-co-leads-25-states-in-defending-2nd-amendment",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caleb J. Fernández",
  "authorUrl": "https://www.kgun9.com/caleb-fernandez",
  "termIds": [
    0
  ],
  "sentences": [
    "Joining Arizona and West Virginia are the attorneys general from: Alabama, Alaska, Arkansas, Florida, Georgia, Idaho, Indiana, Kansas, Kentucky, Louisiana, Mississippi, Missouri, Montana, Nebraska, New Hampshire, Ohio, Oklahoma, South Carolina, South Dakota, Texas, Utah, Virginia and Wyoming.",
    "The coalition of 25 states is asking the Supreme Court of the United States (SCOTUS) to hear the case Bianchi v. Frosh, believing the justices should overturn the Fourth Circuit’s approval of a Maryland firearms ban.",
    "TUCSON, Ariz. — Arizona Attorney General Mark Brnovich and West Virginia Attorney General Patrick Morrisey are co-leading half of American states in protecting the right to bear arms.",
    "\"Americans do not require approval from a local jurisdiction to exercise their constitutional rights,\" said Brnovich.",
    "The Fourth Circuit Court of Appeals upheld this ban in violation of a SCOTUS precedent by creating its own standard.",
    "Arizona and forty-two other states allow the commonly-used firearms that Maryland has banned outright.",
    "This allows the prohibition of firearms if a court thinks the weapon is useful in military service.",
    "\"We must vigorously oppose this type of misguided overreach at all levels of government.\"",
    "Passed in 2013, the law restricts what firearms law-abiding citizens may possess."
  ]
}