{
  "id": 3941,
  "mediaId": 2715,
  "date": "2022-01-24",
  "headline": "Google sued by DC and three states for ‘deceptive’ Android location tracking",
  "image": "https://cdn.vox-cdn.com/thumbor/-JJq1AeSyNyOxZoMOv6-FQQbMeM=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13593177/acastro_181130_1777_google_bias_0001.0.jpg",
  "link": "https://www.theverge.com/2022/1/24/22898760/google-dc-washington-texas-indiana-attorneys-general-lawsuit-location-data-tracking",
  "mediaOutlet": "The Verge",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adi Robertson",
  "authorUrl": "https://www.theverge.com/authors/adi-robertson",
  "termIds": [
    0
  ],
  "sentences": [
    "But Google’s misleading, ambiguous, and incomplete descriptions of these settings all but guarantee that consumers will not understand when their location is collected and retained by Google or for what purposes.” Like the earlier lawsuit from Arizona Attorney General Mark Brnovich, the DC suit draws heavily on a 2018 Associated Press report that found “many Google services on Android devices and iPhones store your location data even if you’ve used a privacy setting that says it will prevent Google from doing so.”\nAn Arizona judge dealt a blow to the Arizona lawsuit last year by denying a request for summary judgment, saying there wasn’t strong enough evidence that Google had actually misled consumers.",
    "Furthermore, they allege Google pushed Android users with “repeated nudging, misleading pressure tactics, and evasive and deceptive descriptions” to share more information either “inadvertently or out of frustration.”\n“Google falsely led consumers to believe that changing their account and device settings would allow customers to protect their privacy and control what personal data the company could access,” said DC Attorney General Karl Racine in a statement.",
    "“We have always built privacy features into our products and provided robust controls for location data.”\nCorrection January 26th: A previous version of this article misstated the year an Arizona judge made a ruling against that state’s lawsuit; the ruling was made in 2021, not 2022.",
    "“The truth is that contrary to Google’s representations it continues to systematically surveil customers and profit from customer data.”\nRacine’s suit, filed today, accuses Google of violating DC’s Consumer Protection Procedures Act.",
    "The complaints, which build on a 2020 lawsuit filed by the Arizona Attorney General, allege that Google’s “complex web” of settings obfuscated whether users were sharing their location at a given moment.",
    "Illustration by Alex Castro\nThe attorneys general of three states and the District of Columbia are suing Google for the allegedly deceptive collection of location data on Android.",
    "“The attorneys general are bringing a case based on inaccurate claims and outdated assertions about our settings,” said Google policy spokesperson José Castañeda.",
    "The judge recommended the case move forward with a jury trial to resolve “a myriad of factual issues,” a path that Brnovich indicated he would pursue.",
    "Reached for comment, Google denied the claims in the suit, pointing to recent changes like the ability to auto-delete location history.",
    "The DC complaint claims that Google’s settings “purport to give consumers control over the location data Google collects and uses.",
    "State attorneys general from Washington, Texas, and Indiana are also filing similar suits in their own jurisdictions.",
    "We regret the error."
  ]
}