{
  "id": 4119,
  "mediaId": 2553,
  "date": "2022-01-21",
  "headline": "‘This President Needs A Lesson’: Arizona Will Sue Biden Admin For Holding School Funds Hostage Over Mask Mandates",
  "image": "https://dw-wp-production.imgix.net/2022/01/GettyImages-969368502.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/this-president-needs-a-lesson-arizona-will-sue-biden-admin-for-holding-school-funds-hostage-over-mask-mandates",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Virginia Kruta",
  "authorUrl": "https://www.dailywire.com/author/vkrutadailywire-com",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/14bwDVyxEa\n— Curtis Houck (@CurtisHouck) January 21, 2022\nMacCallum began with a letter, written by Republican Arizona Attorney General Mark Brnovich, to the U.S. Treasury:\n“It shouldn’t surprise anyone that the U.S. Department of Treasury … is again trying to overstep its Constitutional bounds and dictate Arizona how our state should run and fund our schools.”\nShe then introduced Ducey, noting that he planned to offer an update on the situation.",
    "This president needs a lesson in it.”\nDucey said that Arizona planned to offer summer programs to help students make up some of the learning deficits resulting from school closures and extended remote learning, saying that his goal was to make the funding portable so that parents could choose the school situation that best fit their children.",
    "Why doesn’t he stay in his federal lane and let us educate the children in the state of Arizona?”\nMacCallum noted that Biden only seemed interested in how the federal money was being spent in states like Arizona, where leadership had opted not to implement mask mandates in schools.",
    "Once we give it to them, it’s their money to spend the way they want.’ Why is it the only place that they’re watching where the money goes is Arizona?”\n“There’s been no accountability to the unions for the amount of money that they’ve been given.",
    "Republican Arizona Governor Doug Ducey announced Friday that his state would sue President Joe Biden’s administration over threats that the federal government could claw back federal education dollars unless he imposes a mask mandate for schools.",
    "Ducey joined Fox News host Martha MacCallum on “The Story,” and he argued that Arizona should be permitted to put the money toward efforts to help students — particularly those in lower income areas — get caught up academically.",
    "@DougDucey tells @MarthaMacCallum that his state will be suing the Biden administration for having threatened to pull their COVID-19 funds because they won’t implement a state-wide school mask mandate.",
    "“What I find fascinating about this is the $182 billion that went to school systems across the country and supposed to use it for testing and mitigation,” MacCallum continued.",
    "Arizona is going to file a lawsuit against the Biden administration, against this federal overreach and continued bullying and attacks on our state,” Ducey replied.",
    "If a school system will not work with us, we’re giving family flexible – families flexible dollars to go anywhere in the state to serve their child well,” he said.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "We want the dollars to go to the families that need to get their child inside a classroom, that is functioning, with the teacher in front.",
    "That’s what we’re trying to get our kids caught up along with American civics so they can understand federalism.",
    "“In Arizona, we’re getting them back in the classroom with a teacher at the head of the classroom.",
    "“We are going to use the dollars that Congress has appropriated to catch our kids up in school.",
    "“What is the next move with Arizona and the federal government on this fight?” she asked.",
    "“President Biden said, ‘We weren’t too happy with what happened to some of the money.",
    "Joe Biden needs to focus on the border or helping Ukraine or fixing Afghanistan.",
    "“For some reason, this president is obsessed with masks and with mandates.",
    "He has a very little focus on math or reading or writing.",
    "Get inside access to The Daily Wire by becoming a member.",
    "They continue to focus on Arizona,” Ducey agreed.",
    "Create a free account to join the conversation!",
    "“Good to see you, Martha.",
    "Thank you for having me.",
    "#BREAKING: Arizona Gov."
  ]
}