{
  "id": 4288,
  "mediaId": 8347,
  "date": "2022-01-20",
  "headline": "Brnovich battling to keep Feds from seizing $170 million in Arizona COVID relief funds",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/6ca23fb/2147483647/strip/true/crop/1862x978+0+158/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F61%2Fe0%2F4c9183e44c9ca34ed1631c4a6874%2Fscreen-shot-2020-02-12-at-5.20.26%20PM.png",
  "link": "https://www.kgun9.com/news/local-news/brnovich-battling-to-keep-feds-from-seizing-170-million-in-arizona-covid-relief-funds",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Craig Smith",
  "authorUrl": "https://www.kgun9.com/craig-smith",
  "termIds": [
    0
  ],
  "sentences": [
    "And so no administration, whether the republican or democrat can impose conditions that Congress didn't include.”\nBut the Treasury letter points to rules the Administration wrote to control where the COVID relief goes and those rules say the money can not be used to undermine efforts to stop the spread of COVID-19.",
    "And in this instance, the Biden administration is trying to unilaterally impose new conditions that Congress didn't include.”\nThe Treasury Department set about a two month deadline to comply or return the money.",
    "The Federal Government said Governor Doug Ducey had no business using about $170 million in COVID relief funds to work against government recommendations to reduce the spread of COVID.",
    "When the Treasury Department sent a letter threatening to take back that money, the Governor said, “Well, my message to the Biden Administration is number one, we’ll see you in court.",
    "Attorney General Mark Brnovich sent his own letter to Treasury Secretary Janet Yellin that basically said, back off, you’re claiming authority you don’t really have.",
    "The Governor created programs that send money to schools that do not enforce mask mandates, and to parents who may want to transfer their children to those schools.",
    "Brnovich concedes there are times when Federal money does include specific conditions on how to spend it but he contends this is not one of those times.",
    "TUCSON, Ariz. (KGUN-TV) — Arizona’s Attorney General says he’s prepping for another battle against the Federal Government.",
    "Number two fix the border.”\nBut actually going to court for the state is the Attorney General’s department.",
    "Congress allocates those funds, not only for a specific purpose, but attaches certain specific conditions.",
    "“The president cannot under the ninth and 10th amendment, impose any of these additional conditions.",
    "----\nSTAY IN TOUCH WITH US ANYTIME, ANYWHERE\nCopyright 2022 Scripps Media, Inc. All rights reserved.",
    "“Sometimes you may get a highway grant or, you know, there's other instances where that happens.",
    "And furthermore, when Congress passed the Recovery Act, they did not put these conditions in.",
    "This one is over a Federal threat to take back millions of dollars in COVID relief funds.",
    "It’s also threatening not to send other money down the COVID response pipeline.",
    "This material may not be published, broadcast, rewritten, or redistributed."
  ]
}