{
  "id": 4387,
  "mediaId": 2522,
  "date": "2022-01-26",
  "headline": "Google handed major defeat in state AG lawsuit over location tacking",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/01/Sundar-SG.jpg",
  "link": "https://www.bizpacreview.com/2022/01/26/google-handed-major-defeat-in-state-ag-lawsuit-over-location-tacking-1193259/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "BPR Wire",
  "authorUrl": "https://www.bizpacreview.com/author/bpr-wire/",
  "termIds": [
    3401,
    4758,
    554,
    1126,
    5949,
    6709
  ],
  "sentences": [
    "We will not stand by as Big Tech continues to invade Arizonans’ personal privacy.”\nThe decision comes just one day after state attorneys general led by Democratic Washington, D.C., Attorney General Karl Racine filed complaints against Google alleging the company engaged in similarly duplicitous and deceptive tactics to access user data.",
    "The tech giant defended itself from the allegations by claiming the complaint was “based on inaccurate claims and outdated assertions.”\nWhen reached for comment, Google spokesman Jose Castaneda told the Daily Caller News Foundation that Google viewed the court’s ruling as a win.",
    "In particular, the complaint pointed to several design features and privacy notices that Brnovich alleged deceived users into believing they had opted out of location tracking when Google was still collecting data on their location.",
    "Google sought a summary judgment to throw the case out, arguing that its behavior did not violate consumer fraud laws, but the company’s bid was denied and the tech giant will have to face trial, according to the ruling.",
    "The lawsuit, filed by Republican Arizona Attorney General Mark Brnovich, alleged that Google used unfair and deceptive practices to obtain users’ location data, which it then exploits for targeted advertising.",
    "“Unfortunately, just before today’s decision, four other state attorneys general rushed to file similar lawsuits making similarly inaccurate and outdated claims.”\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "“For too long, the company has used deceptive and unfair practices to allegedly obtain users’ location data to help fund its lucrative advertising business.",
    "Ailan Evans, DCNF\nGoogle’s bid to end a lawsuit alleging it deceived users in order to access their location data was denied by a judge Tuesday.",
    "“The AG is somehow claiming this as a big victory but in reality, a judge rejected his central argument,” Castaneda said.",
    "“Great win for Arizona consumers today,” Brnovich said in a statement to the Daily Caller News Foundation.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "The public will not see it and we do not share it."
  ]
}