{
  "id": 4507,
  "mediaId": 8475,
  "date": "2022-01-05",
  "headline": "GOP senator wants Arizona AG to investigate collusion to block ivermectin as COVID treatment",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/010521_Ivermectin_Tablet.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/010522_burges_brnovich_ivermectin/gop-senator-wants-arizona-ag-investigate-collusion-block-ivermectin-as-covid-treatment/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerod MacDonald-Evoy",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/65775",
  "termIds": [
    0
  ],
  "sentences": [
    "In a request for an attorney general’s opinion filed last month, Burges claimed that governmental agencies, pharmaceutical companies, “medical & health organizations” and others have worked to “suppress” treatments other than the “experimental, gene therapy-based mRNA vaccines.”\nThe vaccines approved for use in the United States are not gene therapy, have been thoroughly tested, and are both safe and effective at limiting the effects of COVID-19.",
    "“My greatest fear is that there are tragic stories of not only my (District 1) constituents, but others throughout Arizona, recounting incidences where they or loved ones were unable to obtain therapeutics in time, or never knew of therapeutic options, and suffered the consequences of COVID, or COVID (emergency use authorization) vaccines and boosters,” Burges says in her letter.",
    "“They risk harm from inadequate treatment as well as the possibility of getting a counterfeit or substandard drug.”\nThe Mirror found multiple online pharmacies alleging to be based in Canada — but that say they can’t deliver drugs to Canadians, for unexplained reasons — selling ivermectin without a prescription in both pill form and in paste or injectable forms meant for animals.",
    "Burges also wants to know if what she believes are “coordinated efforts and activities to suppress the ability of consumers to obtain COVID preventative treatment therapeutics” by the “FDA, CDC, HHS, BIG PHARMA, BIG MED, Hospitals, Insurance Companies, Medical Board of Examiners, Pharmacy Board, and/or others” violate the state’s antitrust and racketeering laws.",
    "And she wants the Republican AG to launch an investigation into what she says is a wide-ranging conspiracy by the the federal government, pharmaceutical companies, hospitals, state public health officials and regulators to block access to so-called therapeutic treatments for COVID-19.",
    "Nebraska’s Republican attorney general opined in October that if doctors and patients in that state both consented to the off-label treatments for COVID-19 and don’t engage in misconduct, then no disciplinary action can be taken and doctors can prescribe the medications.",
    "“For hydroxychloroquine, pharmacies are ensuring that they have it for patients with diseases where there is evidence that it works, such as arthritis and lupus.”\nThis has led many to turn to compounding pharmacies to get their prescriptions for ivermectin filled.",
    "Sun City West Republican Sen. Judy Burges wants Attorney General Mark Brnovich to weigh in on whether doctors and pharmacists can prescribe unproven COVID-19 treatments like ivermectin and hydroxychloroquine without being punished by state regulators.",
    "The American Medical Association, the American Pharmacists Association and the American Society of Health-System Pharmacists have all come out in opposition to prescribing ivermectin for COVID-19 outside of a clinical trial.",
    "“It’s a lose-lose situation for patients who seek unproven COVID-19 therapies online,” Ilisa Bernstein, the senior vice president of pharmacy practice and government affairs for the American Pharmacists Association, said.",
    "“If they receive a prescription for these or other products for off-label use, they can use their professional judgement in deciding whether to dispense it to a patient.”\nThanks for reading TucsonSentinel.com.",
    "Some sites required a prescription for hydroxychloroquine\nNone of the sites met the standards of LegitScript, a website that helps consumers determine if an online pharmacy is a legitimate pharmacy or not.",
    "In her letter to Brnovich, Burges wrote that many of her constituents have only been able to locate the alternative medications from pharmacies “located in other countries.”\nLike what you're reading?",
    "The Food and Drug Administration has fully approved the Pfizer-BioNTech vaccine, and it has granted emergency use authorization for vaccines developed by Moderna and Johnson & Johnson.",
    "In Burges’ letter, she is asking the AG to see if pharmacists in the state can be punished for prescribing or not prescribing the medication by the pharmacy board or the medical board.",
    "Compounding pharmacies came under fire in 2012 when one in Michigan was connected to a meningitis outbreak that killed more than 100 people and infected more than 750 across 23 states.",
    "The outbreak resulted in the passage of the Drug Quality and Security Act of 2013, which created “outsourcing facilities” for compounding pharmacies to get certain drugs in bulk.",
    "Arizona is one of only 22 states that conducts routine inspections of compounding pharmacies and requires certain sterile conditions in facilities where medications are made.",
    "There is largely no federal regulation on compound pharmacies and regulation is mostly left to state entities like the Arizona State Board of Pharmacy.",
    "In Arizona, the drug’s rise in popularity last year led to an increase in calls to poison control centers with one person even being hospitalized.",
    "Both ivermectin and hydroxychloroquine have been popular COVID-19 treatments among conservatives who refuse to take the free and safe vaccines.",
    "However, these online pharmacies have been a major issue for pharmacists and patients during the pandemic and for quite some time.",
    "One form of the medication that is approved by the FDA is used for treating people with intestinal diseases and roundworms.",
    "People refusing to take the safe and free vaccines even did desperate things to try to get their hands on ivermectin.",
    "In Texas, more than 60 people lost all or some of their eyesight due to a contaminated steroid injection.",
    "The lack of FDA approval means Arizona won’t authorize its use, state health officials have said.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "“In the case of ivermectin, not a lot of pharmacies carry this, anyway,” Bernstein said.",
    "Ivermectin has not been approved by the Food and Drug Administration to treat COVID-19.",
    "“Pharmacists cannot prescribe ivermectin or hydroxychloroquine,” Bernstein said.",
    "It is primarily used for treating parasitic worms and is not an antiviral drug.",
    "Burges did not respond to multiple requests for comment.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "However, both medications are hard to come by.",
    "However, certain problems still remain.",
    "- 30 -"
  ]
}