{
  "id": 4633,
  "mediaId": 2662,
  "date": "2022-04-23",
  "headline": "COVER-UP: Maricopa County Supervisors Asked Candidates On County Attorney Appointment Application “Did The Board Of Supervisors Err In Certifying The 2020 Election Results?”",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/014106E8-73A7-4FC8-BF09-0C0FF863CA35_4_5005_c.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/04/cover-maricopa-county-supervisors-asked-candidates-county-attorney-appointment-application-board-supervisors-err-certifying-2020-election-results/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Assistant Editor",
  "authorUrl": "https://www.thegatewaypundit.com/author/assistant-editor/",
  "termIds": [
    0
  ],
  "sentences": [
    "Rachel Mitchell’s answer to question #2 about the stolen 2020 Presidential Election falsely stated, “In the various ballot reviews, recounts, and completed and interim reports concerning the election, every outcome shows that Maricopa County administered a fair election with no evidence of tampering or fraud.”\nMitchell: The Board did not err and took appropriate action in certifying the 2020 election results.",
    "The report also stated, “The EIU’s review has uncovered instances of election fraud by individuals who have been or will be prosecuted for various elections crimes.”\nDr. Shiva’s extensive study of Maricopa County’s signature verification standards found an additional 200,000 signature discrepancies.",
    "The most recent interim report from the Arizona Attorney General showed that “between 100,000 and 200,000 ballots were transported without a proper chain of custody,” and signature verification standards were greatly decreased in the 2020 election.",
    "As someone who faced great national scrutiny regarding the handling of the Supreme Court appointment process of Brett Kavanaugh, I have a unique understanding of the dynamics that come with standing up for one’s personal beliefs of right and wrong.",
    "The Phoenix New Times reported,\nAll three Republican candidates — including Gina Godbehere and Anni Foster, who had initially avoided answering the question — said the board did not err in certifying the election results.",
    "(@marcoattorney) April 20, 2022\nAllister Adel was silent on the stolen 2020 election in Maricopa County, where the Arizona Senate’s full forensic audit uncovered massive fraud and law violations in the 2020 election.",
    "In the various ballot reviews, recounts, and completed and interim reports concerning the election, every outcome shows that Maricopa County administered a fair election with no evidence of tampering or fraud.",
    "I believe the actions taken by the Board have demonstrated the election results are accurate, and in doing so, created trust with the public that there is integrity in the election process in Maricopa County.",
    "— Christina Bobb (@christina_bobb) December 1, 2021\nMaricopa County released the following information on their website before choosing anti-election integrity Rachel Mitchell to cover up the County’s crimes.",
    "This question is extremely ironic since former Maricopa County Steve Chucri, who resigned in disgrace due to The Gateway Pundit, does not even believe that the 2020 election was free and fair.",
    "The three candidates are Anni Foster, Gina Godbehere, and Rachel Mitchell, all Republicans who submitted the minimum number of signatures required to get on the ballot in the August primary.",
    "The Maricopa County Attorney represents the citizens of the State of Arizona in criminal matters, but also the Board of Supervisors and every other county elected official in civil matters.",
    "If valid evidence is brought to me that demonstrates there was fraud or any other illegal improprieties with an election, I will act appropriately within my authority to enforce the law.",
    "The person chosen by the Board will serve through the 2022 General Election, when voters will choose a new County Attorney to serve out the remainder of the term through 2024.",
    "The Maricopa County Board of supervisors recently hand-selected a new County Attorney after the resignation of RINO Maricopa County Attorney Allister Adel on March 21st, 2022.",
    "How would you plan to address the staffing shortage in both the criminal and civil divisions to ensure criminal justice is served and county offices are properly represented?",
    "The Board is required by law to fill a vacancy in the office and must appoint someone of the same political party as the previous office holder, in this case a Republican.",
    "Based on your review of the allegations of fraud and the information made publicly available, did the Board of Supervisors err in certifying the 2020 election results?",
    "The Maricopa County Board of Supervisors has invited three candidates running for Maricopa County Attorney to apply for appointment to the position in the interim.",
    "Despite these horrible findings and promised prosecutions, Brnovich has done almost nothing but stall and pretend to take action against these criminals.",
    "A significant amount of information regarding the election process and the allegations of fraud have been distributed to the public and made available.",
    "If appointed County Attorney, the board will have a person who has demonstrated strength of character under tremendous public pressure and criticism.",
    "The application process included a questionnaire asking whether or not the candidate believes fraud occurred in the 2020 Presidential Election.",
    "“We can report that there are problematic system-wide issues that relate to early ballot handling and verification.”, tweeted Mark Brnovich.",
    "They Chose Mitchell, who immediately said the board ran a clean election, unlike the other two candidates, who had avoided the question.",
    "The Maricopa County full forensic and citizen-led door-to-door canvass of Maricopa County identified over 700,000 ballot discrepancies.",
    "This does not even include the 740,000 ballots that had no chain of custody documentation, according to Verity Vote’s report.",
    "In addition to in-person interviews with board members, the candidates have been asked to complete a brief questionnaire.",
    "TRENDING: HISTORIC HUMILIATION: Trump-Endorsed Candidates Sweep Establishment GOP Picks as Michigan Grassroots Rise Up...",
    "I will stand with the board in their continued efforts to ensure a person’s right to a free and fair election process.",
    "I take the protection of our democracy seriously and if appointed, will make this a priority as your legal counsel.",
    "Win Against All Odds\n@AllisterAdel why aren’t you vocal about the election fraud that occurred in your county?",
    "\"- @Rachel1Mitchell newly appointed Maricopa County Attorney pic.twitter.com/BpcpEhsc9E\n— MaricopaCounty Atty.",
    "The Board of Supervisors hand-picked their own County Attorney to help cover the stolen 2020 election.",
    "We expect a candidate applying for the job would become familiar with the allegations and evidence.",
    "As a voting citizen and a candidate, I want to ensure elections results are accurate and trusted.",
    "What would your top priorities for the office be if you were appointed Maricopa County Attorney?",
    "Former OANN host Christina Bobb called out Allister Adel on her silence back in December 2021.",
    "The Maricopa County Attorney is the legal representative of the board of supervisors.",
    "The Maricopa County Board of Supervisors certified the election results in 2020.",
    "We will provide more information on the appointment process on this page.",
    "State law does not dictate a specific process for filling the vacancy.",
    "Contact Arizona Attorney General Mark Brnovich to demand action!",
    "As a career prosecutor, I deal in evidence, truth, and facts.",
    "You’re the Republican District Attorney for Maricopa County.",
    "This is a major red flag for the 2022 elections.",
    "Improvement is coming to the county.",
    "Their responses are linked below.",
    "\"Change is coming to the county.",
    "Where are you?"
  ]
}