{
  "id": 5017,
  "mediaId": 8416,
  "date": "2022-04-22",
  "headline": "Attorney General Mark Brnovich Files Temporary Restraining Order Against Biden for Revoking Title 42 Ahead of Deadline",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/04/22/attorney-general-mark-brnovich-files-temporary-restraining-order-against-biden-for-revoking-title-42-ahead-of-deadline/?utm_source=rss&utm_medium=rss&utm_campaign=attorney-general-mark-brnovich-files-temporary-restraining-order-against-biden-for-revoking-title-42-ahead-of-deadline",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Conner",
  "authorUrl": "",
  "termIds": [
    4905,
    3401,
    1457,
    5930,
    6159,
    6195,
    6135,
    6225
  ],
  "sentences": [
    "The revocation of Title 42 was already unlawful as the Biden administration failed to follow the correct notice and comment procedure under the APA, and the pattern continues as DHS is unlawfully implementing the revocation early – more than a month ahead of time.",
    "General Brnovich is joined by the Attorneys General of Louisiana, Missouri, Alabama, Alaska, Arkansas, Florida, Georgia, Idaho, Kansas, Kentucky, Mississippi, Montana, Nebraska, Ohio, Oklahoma, South Carolina, Tennessee, Utah, West Virginia, and Wyoming.",
    "The brief filed today calls on the U.S. District Court for the Western District of Louisiana to issue a Temporary Restraining Order and to require DHS to provide proof or the lack thereof, that they have been enforcing Title 42 as required by law.",
    "However, news reports have indicated that the U.S. Department of Homeland Security (DHS) and its sub agencies are no longer utilizing Title 42 with migrants from the Northern Triangle countries of Guatemala, Honduras, and El Salvador.",
    "“It cannot be allowed to continue in this recklessness.”\nThe Biden administration has a pattern of unlawfully circumventing correct processes required under the Administrative Procedure Act (APA).",
    "Thursday, Arizona Attorney General Mark Brnovich asked the court for a Temporary Restraining Order to stop the Biden administration from implementing their Title 42 revocation prematurely.",
    "Attorney General Brnovich will not stand by and watch the Biden administration continue to flout applicable legal requirements and limitations on DHS’s authority.",
    "“Once again the Biden Administration is thumbing its nose at the American people and the rule of law,” said Arizona Attorney General Mark Brnovich.",
    "The Temporary Restraining Order would force DHS and its sub agencies to continue to implement Title 42 fully until the May 23rd effective date.",
    "This is a case revolving around the CDC’s revocation of Title 42, which was supposed to go into effect on May 23rd.",
    "General Brnovich is joined by 20 other Attorneys General.",
    "Copy of the Temporary Restraining Order here."
  ]
}