{
  "id": 5713,
  "mediaId": 2754,
  "date": "2022-04-20",
  "headline": "Border Patrol Union: Abbott Should \"Absolutely\" Use Constitutional \"Invasion\" Powers On Border",
  "image": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2022-04/Border-aliens-La-Joya-510A1264-600x400.jpg?itok=KKXR1u2k",
  "link": "https://www.zerohedge.com/political/border-patrol-union-abbott-should-absolutely-use-constitutional-invasion-powers-border",
  "mediaOutlet": "Zero Hedge",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Durden",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Article IV, Section 4 of the U.S. Constitution states, in part: “The United States shall guarantee to every State in this Union a Republican Form of Government, and shall protect each of them against Invasion.”\nArticle I, Section 10 of the U.S. Constitution states, in part: “No State shall, without the Consent of Congress … engage in War, unless actually invaded, or in such imminent Danger as will not admit of delay.”\nTexas is waiting for its Attorney General, Ken Paxton, to write an opinion in response to a query submitted by state Rep. Matt Krause on March 28.",
    "(Courtesy of Kinney County Sheriff’s Office)\nThe ‘Invasion’ Question\nArizona Attorney General Mark Brnovich provided an opinion following a query by state Rep. Jake Hoffman, who asked what constitutes an “invasion” with regard to Article IV, Section 4 of the U.S. Constitution, as well as “actually invaded” as articulated in Article I, Section 10 of the Constitution.",
    "“The Biden Administration has been so inept or apathetic to the plight of Texas and other border states, that it very well could rise to a violation of Article 4, Section 4 of the U.S. Constitution,” Krause wrote in a Facebook post that accompanied a copy of the official letter.",
    "Abbott announced in early April a multipronged plan to deal with the expected influx of illegal aliens following the Biden administration’s plan to end Title 42, a pandemic-era power that enabled the rapid expulsion of many who crossed the southern border illegally.",
    "Brnovich said the Biden administration has taken “unprecedented actions … to destroy operational control of the border.”\n“The federal government is failing to fulfill its duty under Article IV, Section 4 of the Constitution to defend the States from invasion.",
    "“When you’re dealing with over 200,000 illegal border crossings per month, I don’t know how you don’t call it anything but that.”\nBrandon Judd, president of the National Border Patrol Council, at a press conference in McAllen, Texas, on April 7, 2021.",
    "“So, today, I asked the Attorney General for an official opinion on whether that violation has occurred here in Texas.”\nPaxton’s office told The Epoch Times that it doesn’t have a timeline on when the opinion will be published.",
    "(Charlotte Cuthbertson/The Epoch Times)\nAbbott, a Republican, would have to declare the border crisis an invasion to invoke the state constitutional powers to protect itself if the federal government is derelict in that duty.",
    "If the Constitution allows it—which, apparently it does—why not exercise that authority?”\nBorder Patrol agents apprehend and transport illegal immigrants who have just crossed the river into La Joya, Texas, on Nov. 17, 2021.",
    "“The Biden Administration’s open-border policies have paved the way for dangerous cartels and deadly drugs to pour into the United States, and this crisis will only be made worse by ending Title 42 expulsions,” Abbott said.",
    "During one night last week, Border Patrol agents apprehended 16 illegal aliens from Kyrgyzstan, seven from Kazakhstan, and a Russian within a large group near Eagle Pass, Texas, according to Customs and Border Protection.",
    "Normal trade resumed late last week—after days of disruption—when Abbott dropped the state-run commercial truck inspections after garnering border security deals with his counterparts in four bordering Mexican states.",
    "(Brandon Bell/Getty Images)\nAbbott has been making headlines recently by busing illegal immigrants from Texas to Washington and jamming up trade flows between Mexico and Texas to force attention on the border crisis.",
    "However, experts are saying it’s unlikely the Mexican states will hold up their end of the bargain—which is to stop migrants from crossing illegally into Texas and to conduct their own truck inspections.",
    "We’ve got miles upon miles of border that just aren’t patrolled because we have to deal with, frankly, an invasion,” Brandon Judd, president of the National Border Patrol Council, told The Epoch Times.",
    "(Charlotte Cuthbertson/The Epoch Times)\nBorder Patrol apprehensions along the southern border have remained above 150,000 per month since March 2021, with the exception of this past January.",
    "“So if you were to declare that and bring the National Guard in, and the National Guard immediately expelled people that crossed the border illegally.",
    "Authored by Charlotte Cuthbertson via The Epoch Times,\nThe national Border Patrol union, which represents about 18,000 agents, said Texas Gov.",
    "Brnovich’s Feb. 7 opinion centers around those two definitions and whether the federal government has been derelict in its duty to protect.",
    "“The on-the-ground violence and lawlessness at Arizona’s border caused by cartels and gangs is extensive, well-documented, and persistent.",
    "The State Self-Defense Clause exists precisely for situations such as the present, to ensure that States are not left helpless,” he wrote.",
    "Greg Abbott should “absolutely” invoke his powers under the Constitution to call the border crisis an “invasion” and respond accordingly.",
    "“I mean, we’re dealing with countries all over the world, and a lot of these countries want to do the United States harm,” Judd said.",
    "Doug Ducey has the power to “engage in defensive actions within its own territory at or near its border,” according to Brnovich.",
    "?“publicity stunt,” while CBP Commissioner Chris Magnus accused Texas of not “adequately coordinating” with federal officials.",
    "It can satisfy the definition of ‘actually invaded’ and ‘invasion’ under the U.S. Constitution,” the opinion reads.",
    "A group of illegal aliens is apprehended by law enforcement on a ranch in Kinney County, Texas, on Jan. 14, 2022.",
    "So far, Texas has sent six buses with illegal immigrants to the capital since April 13.",
    "The governor has the authority to use the National Guard and militia forces.",
    "In March, numbers show more than 220,000 apprehensions were made.",
    "White House Press Secretary Jen Psaki called the bus plan a ?",
    "Greg Abbott at an event in Houston, Texas, on Feb. 23, 2022.",
    "As commander-in-chief for Arizona, Gov.",
    "“We’re at a breaking point.",
    "Texas Gov.",
    "Why not?"
  ]
}