{
  "id": 5878,
  "mediaId": 2701,
  "date": "2022-04-12",
  "headline": "Gov. Abbott’s D.C. Caravan Gimmick Won’t Secure The Border. Here’s What Will",
  "image": "https://thefederalist.com/wp-content/uploads/2022/04/48037490182_c11b3f9ffa_k.jpg",
  "link": "https://thefederalist.com/2022/04/12/gov-abbotts-d-c-caravan-gimmick-wont-secure-the-border-heres-what-will/?utm_source=rss&utm_medium=rss&utm_campaign=gov-abbotts-d-c-caravan-gimmick-wont-secure-the-border-heres-what-will",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Cuccinelli",
  "authorUrl": "https://thefederalist.com/author/kencuccinelli/",
  "termIds": [
    5078,
    3401,
    6383,
    6709
  ],
  "sentences": [
    "Something that we at the Center for Renewing America have been advocating to border states: declare that an invasion is taking place in Texas under Article I, Section 10, Clause 3 of the U.S. Constitution and that in light of the Biden administration’s willful negligence and dereliction of its duty to carry out its Article IV, Section 4 responsibilities to protect the states, Texas will physically apprehend and remove illegal border crossers back across the border into Mexico.",
    "In the context of 2021’s record illegal immigration levels, an astonishing 78 percent increase in year-over-year apprehensions so far in 2022 from last year’s record levels, and the pending termination of Title 42, Abbott’s actions fall far short of the measures needed to secure Texas, diminish cartel control along the border, and defend American communities overrun with crime, drugs, and violence.",
    "The governor is instructing the Texas Department of Public Safety to conduct “enhanced safety inspections” of vehicles crossing into Texas from Mexico, initiating “boat blockades” along the Rio Grande to deter crossings, and, to ensure more headlines: providing voluntary charter buses and flights to send illegal immigrants to Washington D.C.",
    "The extent to which the governor believes such road inspections will put pressure on Mexico to crack down on illegal border crossings due to the diminished flow of goods and services is wholly contingent on the duration, scope, and intensity of the inspections.",
    "Put another way, Abbott is using taxpayer dollars to pay for optional vacations 2,000 miles away — at a time of record gas prices — instead of turning these illegal migrants around and sending them two miles back across the border.",
    "Abbott must do more than just set up road inspections (which ironically would slow the legal flow), deploy water obstacles, and offer voluntary illegal immigrant transportation services to left-wing cities.",
    "In fact, the money Texas is spending on Operation Lone Star is effectively being wasted because the one thing that would give it “teeth” and deter potential illegal border crossers is not being done.",
    "After a year of Texas’ “Operation Lone Star,” it should be clear to all: Until illegal border crossers are returned to Mexico reliably and regularly, no other efforts will have any useful impact.",
    "That requires the governor to be absolutely clear about how much economic pressure he intends to put on Mexico and what metrics he and his team intend to achieve with regard to such inspections.",
    "Nothing Abbott announced will accomplish any reduction of the flow of illegal aliens across Texas’ border, but he indicated that he intended to announce other efforts this week.",
    "Americans do not have the luxury of withstanding another three years of the Biden administration’s intentionally destructive policies at the southern border.",
    "We have provided state legislators and governors a clear policy path for bringing an end to the security crisis playing out along the southern border.",
    "The first part of his plan, while lauded as aggressive, unfortunately falls short of unprecedented and won’t stop the invasion at the southern border.",
    "It’s true: the end of Title 42 will ensure a catastrophic surge of illegal immigration heading into the warmer spring and summer months.",
    "This plan has already been validated by Arizona Attorney General Mark Brnovich in a landmark legal opinion issued earlier this year.",
    "This is especially true of road inspections, because the overwhelming majority of illegal immigration occurs between ports of entry.",
    "It is up to states to use their inherent Article I authority to do what Washington refuses to do: secure their borders with Mexico.",
    "Abbott should use the power he has under the U.S. Constitution to repel the invasion crossing Texas’s border every single day.",
    "In light of President Biden’s announcement he’s ending Title 42 removal authority at the southern border, last week Texas Gov.",
    "These policy solutions on their own will have no impact on the numbers of illegal aliens crossing Texas’s border with Mexico.",
    "Abbott will use the power he has under the U.S. Constitution to repel the invasion crossing Texas’ border every single day.",
    "That he has not done so requires clear-eyed observers to be skeptical of the policy’s presumed effectiveness.",
    "It is up to states and those elected to govern them to step into the breach and restore order and security.",
    "Bussing illegals to D.C. is nice showmanship, but does nothing to change the illegal flow into Texas.",
    "Greg Abbott announced what he called “unprecedented” actions to stop the flow of illegal immigration.",
    "Previously, he was President Trump's Deputy Secretary of Homeland Security (DHS) and Director of U.S.",
    "For the sake of Texas and America, it is my most earnest hope that this week, finally, Gov.",
    "Abbott’s announced series of new measures are little more than window dressing.",
    "Ken Cuccinelli is a Senior Fellow at the Center for Renewing America.",
    "All that is required is the resolve to see it through.",
    "That will overwhelm an already battered Border Patrol.",
    "Citizenship and Immigration Services (USCIS).",
    "Texas has the ability to get this done.",
    "He was also Virginia Attorney General.",
    "What should Abbott do?",
    "None.",
    "Gov."
  ]
}