{
  "id": 665,
  "mediaId": 8295,
  "date": "2022-02-23",
  "headline": "Brnovich urges skeptical Supreme Court to let states step in if feds fail",
  "image": "https://cronkitenews.azpbs.org/wp-content/uploads/2022/02/brnostern-1024.jpg",
  "link": "https://cronkitenews.azpbs.org/2022/02/23/brnovich-urges-skeptical-supreme-court-to-let-states-step-in-if-feds-fail/",
  "mediaOutlet": "cronkitenewsonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reagan Priest/Cronkite News",
  "authorUrl": "https://cronkitenews.azpbs.org/people/reagan-priest/",
  "termIds": [
    0
  ],
  "sentences": [
    "Justice Brett Kavanaugh disagreed with Brnovich’s characterization of the case as unprecedented saying, “it’s very much not unprecedented, as Justice Thomas said, for the government to acquiesce in an adverse judgment invalidating a rule.”\nBesides challenging Brnovich’s claims on the economic impact of the rule change, Brian Fletcher, the principal deputy solicitor general who argued the case for the government, said the Justice Department has the right to decide what cases it will defend.",
    "Circuit Court of Appeals denied the states’ request – despite a dissenting judge who said the administration’s ploy of dropping legal challenges made the rule disappear “faster than toilet paper in a pandemic… without the messy public participation generally required to change a federal rule.”\nJustices Wednesday questioned Brnovich on why the state tried to intervene in the San Francisco case – which did not apply to Arizona.",
    "“So what’s different from this case in which the administration declines to appeal an adverse ruling?”\nThe adverse rulings were a series of court cases that were filed in 2019, after the Trump administration tightened the public charge rule, which has been on the books for more than a century.",
    "Brnovich argued that not only did the administration circumvent the Administrative Procedure Act by dropping its defense of the rule in court, but that states have a right to defend it because it has “saved the states collectively more than a billion dollars per year” in public support.",
    "“I congratulate whoever it is in the Justice Department or the executive branch who devised this strategy and was able to implement it with military precision to effect the removal of the issue from our docket and to sidestep notice-and-comment rulemaking,” Alito said.",
    "“So I think they probably are on thin ice.”\nWhile he was careful not to predict what the justices will do, Brnovich said after the hearing that he felt the arguments went well and that he looks forward to defending the rule if the court decides in his favor.",
    "“I’m not aware of a precedent where an incoming administration has done anything quite like this.”\nArizona led 12 states attempting to intervene in a case from San Francisco, in which the city and county successfully sued to block the public charge rule.",
    "But Chris Hajec, the director of litigation at the Immigration Reform Law Institute, which filed a brief in support of the states, said the government was “collusive” in the way it declined to defend the rule in order to avoid notice and comment.",
    "“So there’s nothing around that actually says anybody has to do anything in Arizona.”\nSeveral justices also asked Brnovich why he tried to intervene in the 9th Circuit when the Illinois case – which is in the 7th Circuit – has nationwide impact.",
    "“They made this very, very unusual argument that this was effectively a collusive arrangement between the blue states and the blue cities and the Biden administration … Now that’s a political argument, that’s not a legal argument,” Chishti said.",
    "WASHINGTON – Arizona Attorney General Mark Brnovich told the Supreme Court Wednesday that it would set a “dangerous precedent” if it let the Biden administration drop an immigration policy and refused to let the states step in to defend it.",
    "His comments came as Arizona and other states argued that they should be allowed to defend the Trump administration’s interpretation of the “public charge” rule, which the Biden administration has refused to defend in court.",
    "And justices appeared to grapple with the issue, questioning Brnovich repeatedly during 30 minutes of arguments on whether there were better avenues for the states to pursue if they wanted to defend the rule.",
    "Muzaffar Chishti, a senior fellow at the Migration Policy Institute, said the argument that the administration colluded to avoid notice-and-comment is a political one, which is not likely to sway the court.",
    "“Our intention is to defend this rule and we intend to intervene in the 9th Circuit and once the Supreme Court allows us to do that, we fully intend to intervene in the 7th Circuit as well,” Brnovich said.",
    "“When administrations change … the new administration often changes its position in cases,” said Justice Clarence Thomas, noting that he has been on the bench through five administration changes.",
    "But an attorney for the government disputed the impact, saying that just five of the more than 50,000 immigrants who were reviewed under the rule were found to be potential public charges.",
    "Brnovich said that effectively let the government skirt the APA and the “notice and comment” process it requires when making policy – an argument picked up by Justice Samuel Alito.",
    "Fletcher also noted that the Department of Homeland Security announced Feb. 17 that it plans to change the public charge rule, following the APA’s notice-and-comment requirements.",
    "That effectively blocked the policy nationwide, putting it back to its 1999 interpretation, without having to go through the normal complex process of federal rule-making.",
    "“The states have a financial interest that’s at stake here and the federal government’s no longer representing a true opponent to the plaintiff,” he said.",
    "Many of those cases went against the administration, including a U.S. District Court in Illinois that blocked imposition of the Trump rule nationwide.",
    "That rule allows the government to deny permanent resident status to immigrants who could become dependent on public assistance in the future.",
    "“I’m so totally confused about why the suit is here, and not either an APA suit, or simply a 7th Circuit suit,” said Justice Sonia Sotomayor.",
    "“I’ve seen how Los Angeles has spread, but I don’t think it’s yet spread to Arizona,” Justice Stephen Breyer said.",
    "The Trump administration moved to challenge those rulings, one of which had made its way to the Supreme Court.",
    "But when President Joe Biden took office in 2021, his administration dropped all those court challenges.",
    "Or why he simply did not file suit claiming the Biden administration violated the APA.",
    "A decision is expected before summer, when the court adjourns its 2021 session.",
    "-Cronkite News reporter Alexia Stanbridge contributed to this report.",
    "Or even whether states should be allowed to do it.",
    "But the 9th U.S."
  ]
}