{
  "id": 6660,
  "mediaId": 8408,
  "date": "2022-04-12",
  "headline": "Arizona's Clemency Board Is Unfairly Stacked With Cops, Lawyers Argue in Death Row Case",
  "image": "https://media2.phoenixnewtimes.com/phx/imager/u/slideshow/13416555/skidmore_-_ducey_2017.jpg",
  "link": "https://www.phoenixnewtimes.com/news/arizonas-clemency-board-is-stacked-with-cops-lawyers-argue-in-death-row-case-13415789",
  "mediaOutlet": "phoenixnewtimes.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katya Schwenk",
  "authorUrl": "https://www.phoenixnewtimes.com/author/katya-schwenk",
  "termIds": [
    0
  ],
  "sentences": [
    "Asking for clemency is often one of the final chances for being spared from a death sentence, and it's an important one, because the attorneys do not have to make a case solely based on legal arguments.",
    "But states have fairly broad latitude in determining mental incompetence, which has meant that many severely mentally ill people often remain on death row and, in some cases, receive the death penalty.",
    "They argue the Arizona Board of Executive Clemency — a body that has the power to recommend Dixon not be executed — is made up of too many cops and violates the law and Dixon's legal rights.",
    "It would be the first time Arizona has carried out the death penalty in eight years — after a badly botched execution drew heightened scrutiny and legal challenges to the program.",
    "Typically, commutation is given when a sentence is found to be \"clearly excessive,\" taking into account the facts of the case and testimony from victims and the convicted person.",
    "Quiñonez, meanwhile, worked for 27 years as a federal law enforcement officer, mostly as a special agent for the federal Bureau of Alcohol, Tobacco, Firearms and Explosives.",
    "This, Dixon's attorneys noted, meant she also had spent time working for \"a state prosecuting agency that supports and works in partnership with law enforcement agencies.\"",
    "The U.S. Supreme Court has set a higher standard of \"mental incompetence,\" which means the person lacks \"a rational understanding of the reason for the execution.\"",
    "Before his appointment, Freni had only ever worked at the Phoenix Police Department, spending 30 years with the department as an officer and later lieutenant.",
    "When Quiñonez was reappointed in March 2021, Arizona State Senator Martín Quezada spoke against his presence on the board at a Senate committee meeting.",
    "But Dixon's attorneys have launched a new challenge to the state's plans, in a special action suit filed Monday in Maricopa County Superior Court.",
    "Last week, attorneys filed a motion arguing that because Dixon is mentally incompetent, the death penalty would be unconstitutional in his case.",
    "But before that, Johnson worked for 21 years as an officer and detective with the Phoenix Police Department, then founded a security company.",
    "Arizona statute requires that \"no more than two members from the same professional discipline may be members of the Board at the same time.\"",
    "According to Senate nominating documents, the state says Johnson's professional discipline is that of \"public policy,\" not law enforcement.",
    "\"If the Board proceeds with three of its four members being law enforcement officers, it will violate Mr. Dixon's right to a fair hearing.\"",
    "In 2014, he departed to work for International Police Training and Consulting Services, a law enforcement-related firm, for several years.",
    "\"What we have here is a board as a whole that is extremely law enforcement heavy,\" said Quezada, a Democrat representing the West Valley.",
    "A spokesperson for Ducey did not return inquiries from New Times about the case or about law enforcement presence on the clemency board.",
    "As his attorneys emphasize in a recent filing, three of the four board members have a combined 85 years of experience in the profession.",
    "Dixon has a documented history of schizophrenia and, in one older case, was determined to be legally insane by court psychiatrists.",
    "He has spent more time out of law enforcement compared to the other two, serving for three terms as a Phoenix city councilmember.",
    "Dixon's fate is now in the hands of the Arizona courts — and, depending on the results of his clemency hearing, Ducey's office.",
    "The Arizona Board of Executive Clemency hears petitions from incarcerated people in Arizona seeking to commute their sentences.",
    "The clock is ticking for Clarence Dixon, a 66-year-old man the state of Arizona plans to put to death in less than a month.",
    "His bio credits the \"skills and knowledge he acquired from policing\" as key to the time Johnson has spent in public office.",
    "An elderly, disabled man who has been in prison for many years, Dixon could be a relatively strong candidate for clemency.",
    "It's also notable that the board chair, Mina Méndez, worked for years as an assistant attorney general for the state.",
    "Attorney General Mark Brnovich issued a death warrant for Dixon last week, setting his execution date as May 11.",
    "In capital cases like Dixon's, clemency hearings are scheduled, automatically, once a death warrant is issued.",
    "He's also a member of the Navajo Nation, which opposes the death penalty on cultural and spiritual grounds.",
    "His attorneys are requesting a hearing on the issue, but it's not clear yet how the suit will progress.",
    "More recently, he took a job as an instructor at Glendale Community College, teaching criminal justice.",
    "Dixon was sentenced to death in 2008 for the murder of Arizona State University student Deana Bowdoin.",
    "Dixon's attorney Joshua Spears said in a Monday statement it's a \"plain requirement of Arizona law.\"",
    "\"Mr. Dixon is entitled to a fair clemency hearing before an impartial Clemency Board,\" Spears said.",
    "In the years after Bowdoin died, Dixon had been convicted of raping another woman at knifepoint.",
    "He was already in prison for life when a jury handed down a death sentence in the Bowdoin case.",
    "Usually, there are five members of the clemency panel, but one seat was recently vacated.",
    "At the same time, Dixon's attorneys are looking for other ways to halt Dixon's execution.",
    "But Dixon will face a board made up almost entirely of former law enforcement officials.",
    "The remaining board members are Salvatore Freni, Louis Quiñonez, and Michael Johnson.",
    "Although only the governor has this power, the board's recommendations carry weight.",
    "Currently, the case is before Maricopa County Superior Court Judge Patricia Starr.",
    "Johnson and Quiñonez were appointed to the board by Governor Doug Ducey in 2017.",
    "His attorneys have called the state's decision to execute him \"unconscionable.\"",
    "She was found strangled and stabbed to death, alone in her Tempe apartment.",
    "DNA evidence connected Dixon, Bowdoin's neighbor at the time, to the crime.",
    "None of the board members returned Phoenix New Times' requests for comment.",
    "Bowdoin's family has voiced support for the death penalty in Dixon's case.",
    "All three worked as law enforcement officers for most of their career.",
    "Mental illness alone does not — legally — bar the death penalty.",
    "His attorneys have asked for mercy, given his current state.",
    "The Senate committee voted 4-2 to reappoint Quiñonez.",
    "Bowdoin was sexually assaulted and killed in 1978.",
    "He is one of 112 people on death row in Arizona.",
    "The state has not yet filed a response in court.",
    "For decades, no one had answered for her death.",
    "Freni was appointed more recently, in 2021.",
    "Dixon, they argue, is now frail and blind.",
    "He has a long history of mental illness.",
    "This issue has come up before.",
    "He suffered abuse as a child.",
    "Then there is Johnson."
  ]
}