{
  "id": 6912,
  "mediaId": 8416,
  "date": "2022-04-15",
  "headline": "Attorney General Mark Brnovich Expands Lawsuit Against President Biden Over Rescinding Title 42",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/04/15/attorney-general-mark-brnovich-expands-lawsuit-against-president-biden-over-rescinding-title-42/?utm_source=rss&utm_medium=rss&utm_campaign=attorney-general-mark-brnovich-expands-lawsuit-against-president-biden-over-rescinding-title-42",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Conner",
  "authorUrl": "https://azag.gov",
  "termIds": [
    4905,
    3401,
    2765,
    62,
    5949,
    6406,
    6684
  ],
  "sentences": [
    "“Biden is actively decriminalizing and incentivizing illegal immigration to bring in as many people as possible without any regard for the safety and well-being of Americans.”\nTitle 42 has been in effect since March 2020 and has been used by both the Trump and Biden administrations to try and keep communicable diseases, like COVID-19, out of the country, and has prevented over 1.7 million illegal entries into the U.S. As a border state, Arizona is directly impacted by the Title 42 rescission and will bear the burden of the wave of illegal immigration that will follow.",
    "Attorney General Brnovich filed the original complaint last week, and now is asking the court to move swiftly to protect Arizona and the other plaintiff states from the inevitable influx of illegal border crossings if Title 42 is rescinded on May 23rd.",
    "Attorney General Brnovich is joined by the AGs of Missouri, Louisiana, Alabama, Alaska, Arkansas, Florida, Georgia, Idaho, Kansas, Kentucky, Mississippi, Montana, Nebraska, Ohio, Oklahoma, South Carolina, Tennessee, Utah, West Virginia, and Wyoming.",
    "The Attorneys General argue that revoking Title 42 violates the Administrative Procedure Act (APA) because it is arbitrary and capricious and that the Biden administration did not conduct the statutorily required notice and comment process.",
    "Brnovich leads coalition of 21 states\nArizona Attorney General Mark Brnovich is leading a coalition of 21 states in filing a motion for a preliminary injunction against the federal government’s rescission of Title 42 in Arizona v. CDC.",
    "“What President Biden is doing by rescinding Title 42 is not humane; it is insane,” said Arizona Attorney General Mark Brnovich.",
    "Copy of preliminary injunction here.",
    "Copy of amended complaint here."
  ]
}