{
  "id": 7063,
  "mediaId": 2594,
  "date": "2022-04-06",
  "headline": "Ex-Trump officials pressure Texas Governor Greg Abbott to declare ‘invasion’ along Mexico border",
  "image": "https://static.independent.co.uk/2022/04/06/04/Border_War_Powers_23575.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/greg-abbott-texas-border-invasion-trump-b2052116.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Via AP news wire",
  "authorUrl": "https://www.independent.co.uk/author/via-ap-news-wire",
  "termIds": [
    2915,
    5078,
    5229,
    5763,
    1428,
    5949,
    6653,
    6579,
    6383
  ],
  "sentences": [
    "Former Trump administration officials are pressing Texas Gov Greg Abbott to declare an “invasion” along the US-Mexico border and give thousands of state troopers and National Guard members sweeping new authority to turn back migrants, essentially bestowing enforcement powers that have been a federal responsibility.",
    "Recommended\nTom Homan, the former acting director for Immigration and Customs Enforcement under former president Donald Trump, said at a border security conference in San Antonio last week he had spoken with Mr Abbott but gave no indication about whether the two-term governor supported the idea.",
    "\"Just because the state says that it is an invasion that doesn’t necessarily make it so, it is not clear to me what additional legal authority that conveys on them,” Ms Berman said, adding that state officials can enforce state laws, but the line is drawn at what the federal law allows.",
    "The urging comes as the Republican governor prepares to announce Wednesday “unprecedented actions” to deter migrants coming to Texas after the Biden administration announced last week it will end a public health law that has limited asylum to prevent the spread of Covid-19.",
    "It is unclear whether Mr Abbott, who is up for reelection in November and is already installing more border barrier and allowing troopers to arrest migrants on trespassing charges, supports the aggressive proposals former Trump officials are pushing.",
    "Ms Berman said she hasn't seen the constitutional clauses used since the 1990s, when the courts ruled that they did not have jurisdiction to decide what qualified an invasion, but believed that one could only be done by another governmental entity.",
    "Emily Berman, who teaches constitutional law at the University of Houston, said the “invasion clause” by proponents is tucked into a broader constitutional assurance that the US must defend states from invasion and domestic violence.",
    "Congress has to take action, just like Texas is taking action.”\nAsked if he considered what was happening on the Texas border “an invasion”, Mr Abbott did not use those words but said he would be discussing it Wednesday.",
    "Arizona Attorney General Mark Brnovich, a Republican, issued a legal opinion in February declaring that Mr Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "Their plan involves a novel interpretation of the US Constitution to have the National Guard or state police forcibly send migrants to Mexico, without regard to immigration laws and law enforcement procedures.",
    "While speaking Tuesday to a conservative talk radio station, Mr Abbott's remarks about constitutional authority were in relation to Congress, which he said had the only power to reduce the flow of migrants.",
    "Mr Cuccinelli said in practice, he envisions the plan would look similar to the enforcement of Title 42, which circumvented US obligations under American law and international treaty to provide asylum.",
    "He said he has not spoken with Mr Abbott and said the governor's current sweeping border mission, known as Operation Lone Star, has put little to dent in the number of people crossing the border.",
    "“We’ve had discussions with his attorneys in his office, 'Is there a way to use this clause within the constitution where it talks about invasion?” Mr Homan said during the Border Security Expo.",
    "For example, Ms Berman said, the invasion of Ukraine by Russia can be qualified as one because it is an outside government breaching another country’s boundaries with the use of military force.",
    "“I think it should be more of a partnership instead of saying, ‘Federal government, we don’t think you’re doing enough, and why don’t we go ahead and do our own border security?’” he said.",
    "In Arizona, Republican Gov Doug Ducey has also been under pressure within his party to declare that the state is being invaded and use extraordinary powers normally reserved for war.",
    "He argued that states are entitled to defend themselves from immediate danger or invasion, as it is defined by the “invasion clause”, under the “states self defense clause”.",
    "The mission has also drawn criticism from Guard members over long deployments and little to do, and some arrests have appeared to have no connection to border security.",
    "Mr Homan on Tuesday described the response from Mr Abbott's office, which he said took place about three months ago, as “non-committal but willing to listen”.",
    "US Rep Henry Cuellar, a Democrat whose district includes the Texas border, has criticized the Biden administration over border security and ending Title 42.",
    "Border Patrol officials say they are planning for as many as 18,000 arrivals daily once the health policy, known as the Title 42 authority, expires in May.",
    "But the way former Trump immigration officials see it, Texas and Arizona can pick up where the federal government leaves off once the policy ends.",
    "Driving the effort on the right is the Center for Renewing America, a conservative policy think tank led by former Trump administration officials.",
    "Additionally, she said, the “state self-defense clause” says states cannot engage in war-like actions or foreign policy unless invaded.",
    "But Mr Ducey, who is term-limited and not on the ballot in 2022, has not embraced the theory and has avoided commenting directly on it.",
    "Border enforcement has always been a federal responsibility, and in Texas, state leaders have not been pushing for such a move.",
    "“Congress has to stop talking about it, has to stop complaining about it, has to stop going to the border and looking at it.",
    "___\nAssociated Press reporter Jonathan J. Cooper in Phoenix and Nomaan Merchant in Washington contributed to this report.",
    "“Until you are actually returning people to Mexico, what you are doing will have no effect,” Mr Cuccinelli said.",
    "It includes Ken Cuccinelli, an immigration hardliner and former Homeland Security official under Mr Trump.",
    "Mr Brnovich is locked in a tough Republican US Senate primary in which border security is a top issue.",
    "But he does not support states trying to use new powers that would let them “do whatever they want.\"",
    "Last week, about 7,100 migrants were coming a day to the southern US border.",
    "“We’ll be taking unprecedented action,” Mr Abbott told radio station KCRS.",
    "Mr Abbott did not elaborate on what steps he will announce Wednesday."
  ]
}