{
  "id": 7090,
  "mediaId": 2512,
  "date": "2022-04-01",
  "headline": "How environmentalism and the far right are becoming an unlikely ‘ecofascist’ combination: report",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29624666&width=1200&coordinates=0%2C107%2C0%2C107&height=600",
  "link": "https://www.alternet.org/2022/04/how-environmentalism-and-the-far-right-are-offering-an-unlikely-ecofascist-combination/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    4742,
    4154,
    3390,
    2765,
    2473
  ],
  "sentences": [
    "It's a threat to natural habitats.”\nThe NPR reporters go on to note that in 1998 and 2004, “anti-immigrant factions tried to stage a hostile takeover of the Sierra Club's national board” but “failed.”\nAccording to Hampshire College’s Betsy Hartmann, fearing the destruction that climate change is causing fits in with the “doomsday” element of the far right.",
    "“If you have this apocalyptic doomsday view of climate change,” Hartmann told NPR, “the far right can use that doomsday view to its own strategic advantage.”\nShapiro, Ozug and Morell describe the intersection of far-right views and environmentalism as “ecofascism” and consider it a “problem” that will continue to grow.",
    "On the podcast ‘The People's Square,’ a musician who goes by Stormking described his vision for a far-right reclamation of environmentalism.”\nStormking argued, “Right-wing environmentalism in this country is mostly — especially in more modern times — an untried attack vector.",
    "The far right has a long history of attacking environmentalists as “tree huggers,” railing against green energy and denying that climate change exists — even though countless scientists have offered concrete proof that it does.",
    "Nonetheless, there are times when the far right and environmentalism intersect, and National Public Radio (NPR) journalists Ari Shapiro, Matt Ozug and Casey Morell discuss that unlikely combination in an early April report.",
    "Railing against illegal immigration, Brnovich argued, “We know that there's information out there that says that every time someone crosses the border, they're leaving between six and eight pounds of trash in the desert.",
    "Former President Donald Trump, a strident defender of fossil fuels, even made the ludicrous claim that coal is much cleaner than green energy and that wind turbines cause cancer.",
    "And it has legs, in my opinion.”\nShapiro, Ozug and Morell cite Arizona Attorney General Mark Brnovich as an example of a Republican who made a right-wing environmental argument.",
    "“Conservative leaders, from Rush Limbaugh to former President Donald Trump, have certainly denied climate change in the past,” the NPR reporters explain.",
    "But among far-right Republicans of the MAGA variety, hating environmentalists is a badge of honor.",
    "“But today, a different argument is becoming more common on the conservative political fringe….",
    "Being conservative doesn’t automatically mean being totally opposed to environmentalism.",
    "The Environmental Protection Agency (EPA) started under President Richard Nixon.",
    "“The problem is visible now, and there is time to address it,” they write.",
    "“But the longer people wait, the harder it's going to be.”",
    "That trash is a threat to wildlife."
  ]
}