{
  "id": 721,
  "mediaId": 6449,
  "date": "2022-02-24",
  "headline": "Arizona AG Mark Brnovich Fights for Trump’s Immigration Rule at Supreme Court",
  "image": "https://www.dailysignal.com/wp-content/uploads/220223-Immigrants.jpg",
  "link": "https://www.dailysignal.com/2022/02/24/arizona-ag-mark-brnovich-fights-for-trumps-immigration-rule-at-supreme-court/?utm_source=rss&utm_medium=rss&utm_campaign=arizona-ag-mark-brnovich-fights-for-trumps-immigration-rule-at-supreme-court",
  "mediaOutlet": "Daily Signal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Douglas Blair",
  "authorUrl": "https://www.dailysignal.com/author/douglas-blair/",
  "termIds": [
    0
  ],
  "sentences": [
    "Just hours ago, you argued in front of the Supreme Court on President [Donald] Trump’s “public charge” rule, which, for those of us who maybe aren’t aware of, it’s a rule that prevented immigrants from gaining citizenship if they were too reliant on social services, such as food stamps or Medicaid.",
    "When we think of what they’re doing with the 1619 Project and critical race theory, undermining our institutions, houses of worship, the family, undermining law enforcement, I think this is all part of a systematic effort by the far-left, progressive left to create this neo-Marxist paradise.",
    "I think that a big part of this is not only overwhelm the system, but they want to consolidate as much power, the progressive left does because they understand that once you take that power from the people, you take it away from the states, it’s really, really difficult to get it back.",
    "In Brnovich’s words, it’s only fair that hardworking Americans get priority over those “cutting the line.”\n“I just think that a lot of folks, hardworking, middle-class taxpayers in our country, not just in Arizona, all over, understand what’s fair is what’s fair,” Brnovich says.",
    "When I hear them talking about they don’t like what’s going on, they had to work two to three jobs and no one gave them anything—the most challenging question immigrants are getting now is do they want twin or a single bed in their hotel room that’s being paid by taxpayers.",
    "Brnovich: Well, the system, I mean, look, there is a lot of us that used to say that we thought the Biden administration wanted to abolish [Immigration and Customs Enforcement], but now we’re seeing firsthand that, essentially, they’re abolishing the whole southern border.",
    "“It’s not fair for someone to come in and basically cut in line and then get government benefits.”\nBrnovich, a Republican, joins “The Daily Signal Podcast” to discuss how the Supreme Court arguments went, and what the “public charge” rule means for our immigration system.",
    "What we don’t want to do, and what the public charge rule was designed to do, I mean, it’s literally a statute that’s been around for 100 years, is basically, we don’t want people coming to the United States to become dependent on government, to become wards of the state.",
    "[Vice President] Kamala Harris was an attorney general—I mean, she was one of my colleagues not that long ago—[Homeland Security Secretary Alejandro] Mayorkas, we’ve invited them to sit down and talk to us to get a firsthand look at what’s going on in the border.",
    "Just so you know, some of my thinking on this, there was a side of me that’s like, well, do we want to make it more likely the states intervene, but does this set a precedent for lefty states like California and New York now to do involvement with litigation?",
    "The commonsense rule of design that, look, we want to make sure that people that have paid into the system and that people that are citizens here, when there was an emergency, a crisis, or they’re in need, that they’re the ones getting those benefits.",
    "Brnovich: Look, a lot of what they were arguing was, look, there’s a change in administration and administrations could change policies and essentially that, because these cases have been dismissed, there’s nothing really Arizona can do at this time.",
    "The courts are going to let California and New York do that anyway.” Even in this case, they find an excuse for San Francisco to sue over a federal statute and … Illinois get a nationwide injunction out of—so it’s like, the left already does this.",
    "I think most people now understand that if you decriminalize something, like the Biden administration’s doing, it’s one of our lawsuits about the public charge rule, if you incentivize it, this is part of dealing with interim guidance—I’m sorry.",
    "But our point was, is that they had strategically and sneakily—if that’s a word, sneakily—they had withdrawn the rule, surrendered in these cases, withdrew their cert petition from the U.S. Supreme Court, all these unprecedented things.",
    "Now, the Biden administration, once again, tried to like minimize it, saying, “Oh, it doesn’t impact a lot of people.” Only here in Washington, D.C., do we start throwing around numbers like billions do they think that’s insignificant.",
    "Literally, you could have a first-generation American suing the president of the United States and arguing against his Department of Justice in front of the Supreme Court, I think speaks volumes about what an amazing country this is.",
    "The Trump administration had promulgated a rule that basically said if you are on government benefits or welfare for more than one year of your first three years here, that you were then not eligible for the path for legal status.",
    "Brnovich: Well, I will tell you, in fact, I think I made reference to seeing him in the courtroom, that I learned a long time ago not to predict what a judge is going to do, especially a federal judge with lifetime appointment.",
    "One of the things that we’ve also talked about in just not even the context of invasion, that the president has an obligation to take charge and make sure the laws are executed, which I believe President Biden’s failing to do.",
    "It is a dangerous precedent because, like I said, if you allow them to do this, then you could have other instances where the administration will essentially engage in strategic surrender to advance their policy goals.",
    "Like I said, I understand that when there’s a change administration, there could be a change in policy, but the Administrative Procedures Act, whether you like it or not, provides a process for withdrawing a rule.",
    "I mean, I think any reasonable person—whether they’re a Democrat, Republican, left or right—understands that you can’t have a system that gets overwhelmed and we basically cede control of our border to cartels.",
    "Chicago Mayor Lori Lightfoot announces that as of Feb. 28, the city for the most part no longer will mandate masking or require proof of vaccination against COVID-19 for restaurants and other indoor businesses.",
    "I think if people read that well-reasoned opinion, they will understand that what is going on here with the cartels and the gangs is that there is an unconventional war going on and we need to recognize that.",
    "When I was walking into the court today, I mean, it’s not lost on me that this is—I remember going there as a high school kid and being in awe of the statue of John Marshall and you seeing all the stuff.",
    "A lot of times the justices will ask questions because they may even have their mind made up, but they’re trying to influence their colleagues as well or maybe influence the way the opinion takes shape.",
    "The federal government just grows bigger and bigger and bigger because there’s not enough folks willing to stand up and say “no.”\nWhere in this Constitution does Congress have the power to do that?",
    "What’s the progressive left up to?” You asked, sometimes people ask me, and I can assume or think, based on my experience and what they’re doing, what I think they’re doing, but it really is crazy.",
    "When they don’t like the law, essentially a sue and surrender or sue and settle strategy where they get together with the other side and do something that they think is really cute and tricky.",
    "Therefore, it’s up to the governor, our governor or other governors, to then use all the resources available that they have in order to try to stem the tide and protect our Arizona citizens.",
    "I’m going to keep doing everything I can to try to bring some sanity, to try to bring some order into what’s going on in our southern border, because frankly, it’s overwhelming the system.",
    "But as to immigration, this is part of the big problem, is the U.S. Supreme Court, and actually in the Arizona case … they said that the states can’t use or can’t enforce immigration laws.",
    "My thing is, if you’re [President] Joe Biden and you don’t want to do federal law, then get the heck out of the way and let Arizona come in and do the job that you’re supposed to be doing.",
    "That means that the Biden administration doesn’t like the public charge rule, then they have to go through the notice and comment and go through the process that the statute requires.",
    "That rule, based on a concept that goes back to 1882, would prevent illegal immigrants from gaining citizenship if they use too many social services such as food stamps or Medicaid.",
    "Blair: One final question for you, if this is something that is better fought at the state level, should more states be involved in this fight and how should they be engaged in it?",
    "Look, I tell people all the time, you may not agree with me all the time, but you know where I stand, you know where my principles are, and they’re back to those first principles.",
    "We also cover these stories:\nThe United States warns that Russia’s aggression toward Ukraine could result in a massive refugee crisis as well as threaten international security.",
    "But I’ll tell you, as a public school kid and as an Arizona taxpayer, we shouldn’t have one dime go to subsidize people that, quite frankly, don’t have lawful or legal status.",
    "It’s part of one of the prongs of the progressive left with trying to … fundamentally shape and alter this country so they can bring about their version of a Marxist paradise.",
    "They fly over Arizona and the rest of our country, then they come to D.C. and they think they can solve all the problems, but they won’t even recognize the problems we have.",
    "This was an important case because if the Biden administration will not do their job, then states like Arizona are going to have to come, step up and defend the rule of law.",
    "But clearly the justices understood … especially when they’re asking the Biden administration, their lawyers questions about, for precedent, when has this happened before?",
    "Blair: One of the things that this brings to mind is this concept of sanctuary cities, where the immigration law sort of is preempted by the states in terms of enforcing.",
    "The states created the federal government.” Part of federalism means the states have to have that ability to protect their interests when the federal government won’t.",
    "Maybe that if the Biden administration wanted to do something and change this law, they have the capacity to do that, it’s just not through the way they’re doing it.",
    "The lefties want to talk about, the progressive left, about climate change or whatever, but make no mistake about it, this is the real man-made crisis and disaster.",
    "One of the arguments that, frankly, I made and I emphasized is that the states have to have the ability to intervene when the federal government won’t do its job.",
    "I remind folks that it’s the take care clause in the Constitution, not the “surrender to the left” clause, which is what the Biden administration essentially did.",
    "But if they aren’t going to do their job—one of the things the Biden administration did was oppose states like Arizona and other states that wanted to intervene.",
    "The president, when it comes to immigration, national security, foreign policy, foreign trade, that’s where the president, he or she, is the apex of their power.",
    "Even with this government, increases in size and scope and provides more outlays, people become more dependent, that’s why nothing ever changes in this town.",
    "Once again, we are a nation of immigrants, but we want to make sure those safety nets are there to protect and support people that have paid into the system.",
    "I don’t want to be on the front line and suing the president in court because he’s failing to secure our border, but I’m going to do it if no one else will.",
    "I just think that a lot of folks, hardworking, middle-class taxpayers in our country, not just in Arizona, all over, understand what’s fair is what’s fair.",
    "Brnovich: Well, we know, and this was part of our pleading today, is that more than a billion dollars just in financial costs of people receiving benefits.",
    "In Arizona, actually, I think it was two years ago that the city of Tucson, which is a progressive, left-leaning city, they even rejected sanctuary city.",
    "The justices, and even the Biden administration, recognized we kind of kept coming back to, even the liberal justices, that this is really unprecedented.",
    "If the president is not going to do his job, then we should be able to at least step in and defend the law as it is, if he’s not going to do his job.",
    "On Feb. 7, you released a legal brief, like you were saying, that was describing this as an “invasion.” What led you to use that word specifically?",
    "Then you throw the overlay of what’s going on with the cartels and violence and drug prices falling and the amount of meth and fentanyl coming in.",
    "Arizona Attorney General Mark Brnovich argued Wednesday before the nine justices in favor of former President Donald Trump’s “public charge” rule.",
    "Basically have folks that want to come here, that want to be self-sufficient, that don’t want to become reliant and dependent on the government.",
    "Frankly, one of the problems I have with the Biden administration is they won’t even recognize the problem they created at our southern border.",
    "I’m a big believer in federalism, that when government is left at the state level or more localized, it’s more responsive and more efficient.",
    "In fact, one of the points I made is that this very Supreme Court, the U.S. Supreme Court, has said the states can’t enforce immigration law.",
    "Then they try to say, “Oh, well, no one can do anything now because all these cases are settled now.”\nIt was really underhanded and sneaky.",
    "Part of our argument was, you have to let us into these cases so we can defend the public charge rule when the Biden administration won’t.",
    "The Biden administration tried to almost make it seem like, well, because we disagreed with them on policy, that’s why we were doing this.",
    "To sound off, please email letters@DailySignal.com and we’ll consider publishing your edited remarks in our regular “We Hear You” feature.",
    "Blair: You represent Arizona, which is one state out of 50, but how has this public charge rule at the federal level affected your state?",
    "The notion that, well, wait a minute, is this something that not only the federal government’s about to do, but should they be doing it?",
    "It is a strange time because sometimes, I don’t know, I take a step back and I think, “Well, what is the Biden administration up to?",
    "Brnovich: Well, depending on how broad or how narrow their decision is, I can just assure everyone that I’m going to keep fighting.",
    "I believe in the promises of the Declaration of Independence, that our rights are given to us by a creator, not by the government.",
    "Not only that, but I mean, at some point, they need to use the impeachment process in the Constitution and move forward on that.",
    "In fact, I can’t remember, one of the justices today alluded to the fact that this was kind of like a law school problem almost.",
    "Then they allowed a decision from the Northern District of Illinois that essentially said the rule is unconstitutional stand.",
    "Whoever is talking in Joe Biden’s earpiece or whatever, telling him that they essentially want to undermine our sovereignty.",
    "It may be the Biden administration now, but it could be another future administration that tries to do something like this.",
    "Brnovich: Yeah, if you look at—in fact I brought my, actually I didn’t bring it, I happened to snag one from your lobby.",
    "That means that we have to have the ability to go in and defend a federal law when the federal government won’t do it.",
    "Viewership ratings for the 2022 Beijing Olympics show it was the lowest-viewed in the televised history of the games.",
    "The Biden administration, frankly, in really an unprecedented move, withdrew their defense of the public charge rule.",
    "Brnovich: Well, I’m a big believer in federalism, just in the principles of limited government and enumerated powers.",
    "Immigration is the problem in this particular case, but there are wide-reaching consequences for other policy areas.",
    "Well, if you engage in strategic surrender and you won’t defend the law, well, can the states come in and defend it?",
    "You literally had the Biden administration colluding with the plaintiffs in order to undermine a duly-enacted rule.",
    "But I’ve also said that Secretary Mayorkas is probably the most incompetent of President Biden’s Cabinet officials.",
    "If you allow them to get away with this, you’ve essentially then provided a road map for future administrations.",
    "One of the things I pointed out, I even said this, it’s not just about what the Biden administration did here.",
    "I know as a prosecutor, we’re seeing record amount of fentanyl, methamphetamine, we’re seeing the prices drop.",
    "The system has to be overwhelmed and they have to get middle-class, public school kids to hate their country.",
    "I think that it’s sad that it’s come to this time and place where states are having to do this kind of stuff.",
    "If the courts aren’t going to let us do it, enforce it, then we have to use other tools in our toolboxes.",
    "Even going back to the invasion opinion, part of that is that, well, let’s use the criminal enforcement.",
    "Then we know in Article I, Section 10, there’s language in here that really sets forth the parameters.",
    "I recently issued an opinion, first AG in the country, first ever to call what’s going on an invasion.",
    "I remind folks all the time what Ronald Reagan said, “The federal government didn’t create the states.",
    "People’s hearts maybe are in the right places, but they have to understand it’s not fair to anyone.",
    "When you do that, when you decriminalize something, you incentivize something, you get more of it.",
    "Blair: Let’s say the justices rule in your favor, we get what we want here, and what happens next?",
    "We say that, based on all these facts, based on the language of the Constitution, this qualifies.",
    "Why should Arizona taxpayers be funding, subsidizing bridges to nowhere or bike paths in Vermont?",
    "Literally, we have a lawsuit trying to sue the Biden administration over failure to build a wall.",
    "I mean, if he’s not going to do his job—I actually had previously called for him to be replaced.",
    "It’s not fair for someone to come in and basically cut in line and then get government benefits.",
    "Then bam, they end up revoking the rule, relying on this Northern District of Illinois decision.",
    "We saw just last year, more than, what, 100,000 people died of fentanyl, opioid-related deaths.",
    "I had never run for office before I was AG, but I talked to my mom and her friends from church.",
    "Remember to include the URL or headline of the article plus your name and town and/or state.",
    "We’re not enforcing immigration law, but we’re allowed as a state to enforce criminal laws.",
    "Blair: While this rule makes its way through the courts, what is the reality on the ground?",
    "That’s why you know I’m a good lawyer, when I can, “Oh gosh, I might have the Constitution.",
    "Blair: It sounds like the crux of your argument is that part of the process was done wrong.",
    "Once again, we talked about this just a second ago, the rule of law has to mean something.",
    "Blair: It sounds like the implications for this case kind of umbrella out of immigration.",
    "They literally did it in a way that was so coordinated that they did all this on March 9.",
    "I really appreciate you giving us that info because some of this seems very complicated.",
    "People are dying in the United States as a result of the Biden administration policy.",
    "The reason why some people want to come here, once again, is because the rule of law.",
    "I think there’s not a lot of sympathy for people that aren’t doing it the right way.",
    "Her friends were born in Eastern Europe, in Poland and Romania, Hungary, Yugoslavia.",
    "Where does in Article I, the enumerated powers, where does it say they can do that?",
    "Blair: That was Attorney General Mark Brnovich who represents the state of Arizona.",
    "They can’t just unilaterally pick and choose which laws are going to apply to them.",
    "I think it’s important, if I can, indulge me—look, I’m a first-generation American.",
    "She was a state judge and then President Trump appointed her to the federal bench.",
    "The bottom line is that you can’t let the Biden administration get away with this.",
    "Now that we have that background, would you be able to place us in the courtroom?",
    "I mean, for full disclosure purposes, I’m actually married to a federal judge.",
    "It might come in handy here.”\nNo, we know that there’s language in Article IV.",
    "We know when there’s a change in administrations, there’s a change in policy.",
    "It’s almost like the first step to recovery is admitting you have a problem.",
    "Blair: If that’s your argument, what was the argument of the opposite side?",
    "Doug Blair: My guest today is Mark Brnovich, attorney general for Arizona.",
    "Is that a word that appears in the Constitution with a legal definition?",
    "I mean, that’s almost twice as many people that died in the Vietnam War.",
    "It’s not right that states like Arizona and Texas are having to do this.",
    "The U.S. Supreme Court, literally, had accepted certiorari on the case.",
    "If the Biden administration won’t call it what it is, somebody has to.",
    "I don’t know why there’s not more people calling for his impeachment.",
    "But my goodness, if I don’t step up and do something, then who will?",
    "We’re not trying to micromanage the federal government’s litigation.",
    "What the Biden administration has done is this is a man-made crisis.",
    "We, as attorneys general, I need to use every tool in my toolbox.",
    "Illegal immigration is taking the spotlight at the Supreme Court.",
    "Listen to the podcast below or read a lightly edited transcript.",
    "I mean, the state of Texas shouldn’t be having to build a wall.",
    "The Biden administration—there were multiple lawsuits on this.",
    "That’s what I kept coming back to, that this is unprecedented.",
    "I can’t even predict what my wife’s going to do all the time.",
    "The solicitor general can even decide to not take a position.",
    "What are the implications if the justices rule in your favor?",
    "Fundamentally, even immigrants understand this is not fair.",
    "I understand that language, some people are offended by it.",
    "You never know what’s going to happen with a federal judge.",
    "Brnovich: Well, first, once again, thank you for having me.",
    "It’s because the cartels have seized control of the border.",
    "That’s where the president’s kind of at his apex is power.",
    "But the public charge is the incentivization, we call it.",
    "Blair: It’s always wonderful to welcome some people home.",
    "Literally, we are paying people not to build a wall now.",
    "We are the land of the free, I understand that as well.",
    "These are, obviously, really, really important debates.",
    "More importantly, is there still a case or controversy?",
    "What did it seem like the atmosphere of the court was?",
    "Brnovich: Well, the Constitution, it talks about this.",
    "I mean, this is the whole far-left, progressive idea.",
    "I think people understand that, not just in Arizona.",
    "You know how the lefty elites are, the Californians.",
    "Honestly, I thought to myself, “Well, you know what?",
    "Brnovich: That wasn’t directly a part of this issue.",
    "I meant to say interim guidance, not public charge.",
    "The rule of law, once again, has to mean something.",
    "Then they used that as a basis to rescind the rule.",
    "It’s an amazing country because of the rule of law.",
    "The Biden administration didn’t follow it, period.",
    "Blair: How does the Constitution define invasion?",
    "There’s all these type of legal issues going on.",
    "That’s the federal government’s responsibility.",
    "I mean, these are strange and difficult times.",
    "You have to look at this in a broader context.",
    "This is something that we haven’t seen before.",
    "Fundamentally, we are a nation of immigrants.",
    "But we are not the land of the welfare state.",
    "Brnovich: Nice plug there, product placement.",
    "As I said, I think that words have meaning.",
    "I want to, actually, mention that phrasing.",
    "But it goes back to these first principles.",
    "I believe in the primacy of the individual.",
    "That’s part of the reason why we use that.",
    "The Trump administration was defending it.",
    "Brnovich: Yeah, that’s a big part of it.",
    "Some people can think it’s inflammatory.",
    "Blair: Heritage Foundation Constitution!",
    "I think sometimes we lose sight of that.",
    "Mark, thank you so much for joining us.",
    "It’s undermining our national security.",
    "That’s what we were trying to do today.",
    "They stopped us from defending the law.",
    "There’s a whole chicken and egg thing.",
    "My parents lived through World War II.",
    "I think they call for bold leadership.",
    "My mom was born in a foreign country.",
    "I want to make sure we’re on offense.",
    "How does that play into this debate?",
    "How did they justify their position?",
    "Mark Brnovich: Glad to be back here.",
    "Blair: That’s some great background.",
    "The system is not designed this way.",
    "I think this is part of that system.",
    "It’s going to affect every taxpayer.",
    "I’m going to keep going on offense.",
    "Have an opinion about this article?",
    "The system is getting overwhelmed.",
    "Our system is getting overwhelmed.",
    "That’s what they’re trying to do.",
    "I believe in limited government.",
    "It was really sneaky and tricky.",
    "What were the justices thinking?",
    "Is that what your argument was?",
    "I mean, that’s the bottom line.",
    "I tell you, I don’t do polling.",
    "I mean, this is a war going on.",
    "What does the Constitution say?",
    "They said the feds preempt us.",
    "What is at stake in this case?",
    "They lived through communism.",
    "I try to keep emphasizing it.",
    "That’s what I’m trying to do.",
    "I think that it’s important.",
    "Brnovich: Yeah, absolutely.",
    "This is such a great place.",
    "Language, I think, matters.",
    "Mark, welcome to the show.",
    "I mean, people are dying.",
    "Brnovich: On immigration?",
    "This is how crazy it is.",
    "A lot of fond memories.",
    "We’re not saying that.",
    "They get free flights.",
    "They game the system.",
    "Brnovich: Thank you.",
    "We did an analysis.",
    "Frankly, it hasn’t.",
    "I understand that.",
    "Blair: Absolutely.",
    "The money’s there.",
    "That says a lot.",
    "They opposed us.",
    "What happened?",
    "It’s not fair.",
    "It’s not fair.",
    "I never have.",
    "Is it moot?",
    "Blair: Yes.",
    "It’s IV."
  ]
}