{
  "id": 7285,
  "mediaId": 2746,
  "date": "2022-04-04",
  "headline": "States sue to halt Biden from ending border order stopping illegal immigrants",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/12/02/Asylum_Waiting_in_Mexico_35455.jpg-7423a_c0-0-3936-2296_s1200x700.jpg?9f33a2ddf67883f844e4384484d7e828f3a76359",
  "link": "https://www.washingtontimes.com/news/2022/apr/4/states-sue-halt-biden-ending-border-order-stopping/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Dinan",
  "authorUrl": "https://www.washingtontimes.com/staff/stephen-dinan/",
  "termIds": [
    2765,
    2652,
    4905,
    3401,
    3583,
    6401
  ],
  "sentences": [
    "Title 42 is the name of the authority the Centers for Disease Control and Prevention used in March 2022 to give Homeland Security the power to immediately expel illegal immigrants, without giving them a chance to make asylum claims or other demands that would lead to them being released.",
    "“The Title 42 Revocation thus stands as a radical outlier — seemingly the only COVID-19-based restriction the Administration sees fit to end,” said Arizona Attorney General Mark Brnovich, Louisiana Attorney General Jeff Landry and Missouri Attorney General Eric S. Schmitt.",
    "It was a rare get-tough policy begun under the Trump administration to survive into the Biden years, drawing rare praise from Republicans and fierce denunciations from immigrant-rights advocates within Mr. Biden’s own political camp.",
    "The states also said it’s illogical for Mr. Biden to decide that the pandemic has eased enough to end the COVID rules at the border, but at the same time to maintain vaccine mandates or masking requirements for airplane passengers.",
    "Three Republican-led states filed a lawsuit Monday seeking to stop President Biden from ending the pandemic border-emergency order that had helped block illegal immigrants’ path into the U.S., saying he moved too rashly.",
    "They say the rate of coronavirus infections has dropped enough that the border doesn’t represent a risk, and they point to taxpayer-funded vaccination efforts for border jumpers as a way of mitigating the risk further.",
    "Arizona, Louisiana and Missouri said that even the administration expects to see a massive surge of illegal immigrants rushing to take advantage of relaxed COVID-19 rules.",
    "Homeland Security has said it is anticipating up to 18,000 illegal immigrants a day will rush the border, more than double the current pace, already itself a record.",
    "The three states said the effects of that surge will hit communities at the border and the interior, as the administration catches and releases people.",
    "Legal experts had anticipated the states’ lawsuit, and say there’s a good chance judges will side with the states, at least in the near term.",
    "The states pointed out that the Trump administration did go through the correct regulatory process in implementing Title 42 in 2020.",
    "They said such a momentous decision should have gone through the usual regulatory process, with public notice and comment.",
    "But the administration took a shortcut and said the decision falls under “foreign affairs” and “good cause” exceptions.",
    "Border experts say Title 42 helped blunt the worst of the current wave of illegal immigrants.",
    "Administration officials say they are “following the science” in revoking Title 42 powers.",
    "That would mean a delay of the May 23 date for lifting Title 42 restrictions.",
    "The administration announced last week it would end the policy on May 23."
  ]
}