{
  "id": 7440,
  "mediaId": 6449,
  "date": "2022-04-04",
  "headline": "3 States Sue Biden Administration Over Ending COVID-19 Restrictions at Border",
  "image": "https://live-daily-signal.pantheonsite.io/wp-content/uploads/GettyImages-1387209651.jpg",
  "link": "https://www.dailysignal.com/2022/04/04/3-states-sue-biden-administration-over-ending-covid-19-restrictions-at-border/?utm_source=rss&utm_medium=rss&utm_campaign=3-states-sue-biden-administration-over-ending-covid-19-restrictions-at-border",
  "mediaOutlet": "Daily Signal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennie Taer",
  "authorUrl": "https://www.dailysignal.com/author/jennie-taer/",
  "termIds": [
    3401,
    4905,
    2652,
    253,
    6401,
    6331
  ],
  "sentences": [
    "On a call with reporters Friday following the CDC’s announcement, a DHS official stated that the administration is “concerned about the fact that, as is the case with any anticipated policy change, smugglers will spread misinformation to take advantage of vulnerable migrants.”\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "“The U.S. Department of Homeland Security, (DHS), estimates getting rid of Title 42 will result in as many as 18,000 migrants per day—which could mean 540,000 migrants in a single month.”\n— Daily Caller (@DailyCaller) April 1, 2022\nArizona Attorney General Mark Brnovich, the only border state official of the group, said his state will be at the forefront of the consequences of the decision.",
    "The group of Republican attorneys general argued that the decision to end the policy violates the Administrative Procedures Act “as it is arbitrary and capricious, and the Biden Administration did not conduct the statutorily required notice and comment process,” according to a press release shared with the Daily Caller News Foundation.",
    "“Based on recent statistics, approximately 56 out of every 1,000 unlawful aliens who enter the United States end up residing in Missouri … Missouri is also a destination state and hub for human-trafficking crimes within the United States, due to its situation at the confluence of several major interstate highways.",
    "The Centers for Disease Control and Prevention announced Friday that Title 42, the Trump-era policy that allows border authorities to quickly return migrants and has resulted in over 1.7 million migrant expulsions, will end May 23.",
    "National Border Patrol Council President Brandon Judd recently told the Daily Caller News Foundation that, in practice, the order allows for these migrants to be released because facilities don’t have the capacity for the surges.",
    "“While it’s difficult to identify President [Joe] Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” Brnovich said in a statement shared with the Daily Caller News Foundation.",
    "Such crimes disproportionately afflict illegal aliens, and these crimes (and other crimes committed by illegal aliens) impose irreparable law-enforcement and criminal-justice costs on Missouri,” the lawsuit states.",
    "The Biden administration has said it’s preparing contingencies to address an expected migrant influx, arguing that Title 8 will result in the expulsion of migrants who lack lawful claims to be in the country.",
    "“Revoking Title 42 will create an unprecedented surge at the southern border and it will overwhelm law enforcement agencies and nongovernmental organizations as well,” the attorneys general argued.",
    "Attorneys general for Arizona, Missouri, and Louisiana announced Monday they were suing the Biden administration over the decision to end Title 42, urging that the order be reinstated.",
    "“If the Biden administration won’t take proactive steps to secure our border and protect our citizenry, we certainly will,” Missouri Attorney General Eric Schmitt said in a statement.",
    "This administration’s reckless pandering to the far left and complete abdication of its responsibility to public safety cannot be allowed to continue,” Brnovich said.",
    "When Title 42 officially ends, migrants’ claims will be processed under what is known as Title 8, allowing them to await their court dates in the United States.",
    "To sound off, please email letters@DailySignal.com and we’ll consider publishing your edited remarks in our regular “We Hear You” feature.",
    "“It’s a ridiculously poor decision with a bad intention for border states and American communities across the country.",
    "For licensing opportunities of this original content, email licensing@dailycallernewsfoundation.org.",
    "Remember to include the url or headline of the article plus your name and town and/or state.",
    "The lawsuit also points to border issues affecting Schmitt’s state.",
    "Have an opinion about this article?"
  ]
}