{
  "id": 7584,
  "mediaId": 2562,
  "date": "2022-04-07",
  "headline": "Report: Arizona Attorney General Discovered ‘Vulnerabilities’ in 2020 Election",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguidDDD38A92-94D1-4724-BE74-7D2A9CEBAC80.jpg",
  "link": "https://donaldjtrumppolls.com/report-arizona-attorney-general-discovered-vulnerabilities-in-2020-election/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"The Attorney General's interim report about the 2020 election in Maricopa County includes no new evidence, nothing that would have changed the results, and nothing that should lead people to question the overall health of our electoral system,\" the two said in a joint statement.",
    "(AP/Bob Christie)\nBy Jeffrey Rodack | Thursday, 07 April 2022 01:43 PM\nArizona Attorney General Mark Brnovich's interim report on his probe of Maricopa County's 2020 election results, found \"serious vulnerabilities,\" but does not allege any mass fraud, The Hill is reporting.",
    "\"The AG's findings of failures, fraud, and potential misconduct during the 2020 election in Maricopa County are not surprising, given the lack of compliance and cooperation Maricopa County elections officials displayed from the start.\"",
    "The Hill noted that his letter also alleged that investigators had found \"instances of election fraud by individuals who have been or will be prosecuted for various election crimes.\"",
    "But the interim report was blasted by Maricopa County Board of Supervisors Chairman Bill Gates and Maricopa County Recorder Stephen Richer, according to The Hill.",
    "\"The bottom line: the AG has not identified even a single instance where a ballot was accepted with a non-matching signature (or signature that was later cured).\"",
    "According to The Associated Press, he said signatures and other information was missing from some of the forms documenting the transportation of ballots.",
    "\"We've wanted an entity with prosecutorial authority to validate the missteps our audit revealed, and this interim report does just that,\" she said.",
    "However, he said the review is ongoing, and \"we are therefore limited in what we can disclose about specific criminal and civil investigations.\"",
    "Brnovich, a Republican, highlighted his findings in a 12-page letter to Arizona Senate President Karen Fann, who is also a Republican.",
    "Report: Arizona Attorney General Discovered 'Vulnerabilities' in 2020 Election Arizona Attorney General Mark Brnovich.",
    "He said the vulnerabilities \"must be addressed and raise questions about the 2020 elections in Arizona.\"",
    "The Hill noted that Brnovich did not appear to provide proof that any massive wrongdoing had occurred.",
    "He also claimed that election officials worked too quickly to verify voter signatures on mail ballots.",
    "Fann hailed the report, calling it \"a historic day for voter integrity in Arizona.\"",
    "And he said county officials were slow in answering his requests for information.",
    "But he offered few details.",
    "Original Article"
  ]
}