{
  "id": 8309,
  "mediaId": 8408,
  "date": "2022-04-06",
  "headline": "Arizona Sets Date for First Execution in Eight Years",
  "image": "https://media2.phoenixnewtimes.com/phx/imager/u/slideshow/13377360/arizona_doc_building_phoenix.jpg",
  "link": "https://www.phoenixnewtimes.com/news/arizona-sets-date-for-first-execution-in-eight-years-13377064",
  "mediaOutlet": "phoenixnewtimes.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katya Schwenk",
  "authorUrl": "https://www.phoenixnewtimes.com/author/katya-schwenk",
  "termIds": [
    0
  ],
  "sentences": [
    "But concerns quickly emerged that the Department of Corrections had not correctly calculated the expiration date of the pentobarbital it planned to use to execute the two men.",
    "Wood's death was gruesome: The man, convicted of murdering his former girlfriend and her father, lay on the gurney alive for two hours as he was injected with lethal drugs.",
    "If the execution goes forward as intended on May 11, it will be the first time Arizona has put a man to death in the eight years since the botched execution of Joseph Wood.",
    "His attorneys did not immediately return Phoenix New Times' inquiries Wednesday, but told press that under these circumstances, Dixon's execution would be \"unconscionable.\"",
    "Some states have been accused of orchestrating secretive cash exchanges for them in parking lots, according to an investigation into Idaho's procurement of the drugs.",
    "The state conceded that, indeed, the drug would expire in half the time that it had originally thought — making its timeline for the executions impossible.",
    "Last May, the Arizona Supreme Court allowed Brnovich to go forward with a briefing schedule for the executions of Dixon and another prisoner, Frank Atwood.",
    "But Dixon also has a long history of serious mental illness and health conditions, which his attorneys have argued should spare him from the death penalty.",
    "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,\" Brnovich wrote in the announcement.",
    "Furthermore, the Navajo Nation opposes the use of the death penalty, and has historically fought against capital punishment for its citizens.",
    "The attorney general has promised to bring the death penalty back to Arizona during his time in office, though so far has been unsuccessful.",
    "The 2014 execution of Wood sparked a wave of litigation over Arizona's execution protocols, forcing the state to suspend capital punishment.",
    "Ultimately, the state was forced to adopt a new, \"one-drug\" policy to use either pentobarbital or sodium thiopental in executions.",
    "Dixon was convicted in 2002 of sexually assaulting and murdering Deana Bowdoin, a 21-year-old Arizona State University student.",
    "Arizona has set a date for the execution of Clarence Dixon, state Attorney General Mark Brnovich announced Tuesday.",
    "In this case, though, the tribe has little legal sway, given that the crime did not occur on tribal land.",
    "In most death penalty cases, however, legal challenges often continue up until the date of the execution.",
    "Now, with a warrant in hand, the state of Arizona is closer to an execution than it has been in years.",
    "This week's announcement fulfills one of Brnovich's central campaign pledges when he ran for office.",
    "In Arizona, the Department of Corrections still refuses to identify its pentobarbital supplier.",
    "A member of the Navajo Nation, Dixon grew up on the reservation, suffering abuse as a child.",
    "The crime had occurred more than two decades earlier, in 1978, and gone unsolved for years.",
    "Brnovich has been trying to set an execution date for Dixon for more than a year.",
    "But it took until 2019 for the state to figure out a way to obtain pentobarbital.",
    "At the time, he already was serving life in prison for raping another woman.",
    "A DNA match eventually led investigators to charge Dixon with the crime.",
    "During the course of the execution, he was injected 15 times.",
    "Lethal injection drugs are notoriously difficult to obtain.",
    "Jurors handed down a death sentence in the murder case.",
    "This move signaled that a death warrant was imminent.",
    "He had a heart condition at birth and now is blind.",
    "Dixon now has just 35 days."
  ]
}