{
  "id": 8379,
  "mediaId": 8251,
  "date": "2022-04-06",
  "headline": "Brnovich: 'Serious vulnerabilities' occurred during 2020 election",
  "image": "https://media.12news.com/assets/KPNX/images/9a791794-c540-4bce-940b-567ad2568708/9a791794-c540-4bce-940b-567ad2568708_1140x641.jpg",
  "link": "https://www.12news.com/article/news/politics/elections/brnovich-2020-election-had-serious-vulnerabilities/75-8ca6888c-e717-4bc1-8262-eabac101745e",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Mas Bivovicn OFFICE OF THE ATTORNEY GENERAL pb iy SATE OF ARizoNA April 6,2022 “The Honorable Karen Fann Arizona State Senate 1700 W. Washington St. Phoenix, Arizona 85007 RE: Interim Report - Maricopa County November 3, 2020 General Election Dear President Fann Six months ago the Arizona Attorney General's Office (the “Office”) received reports sent from the Arizona State Senate concerning its Maricopa County Forensic Election Audit, In addition, the Attomey General's Election Integrity Unit (EIU) has received and is reviewing additional complaints alleging election failures and potential misconduct that occurred in 2020.",
    "Following an extensive internal review of its election, the Maricopa County Elections Department turned over to Brnovich in January 38 cases of potential voter fraud it uncovered while reviewing its 2.1 million ballots from the 2020 general election.",
    "See Arizona Attorney General's Office~ Fraud & Special Prosecutions Section, Prosecutions Related to Voting or Elections Since 2010, available at hitps://vwwwazag govlsites/defaultfiles/docs/criminal/viwEIU_Prosceutions_February_2022-02- 02.pdf pdf.",
    "In response to Brnovich's letter, Maricopa County Supervisor Bill Gates and County Recorder Stephen Richer said in a statement that Brnovich had not identified even a single instance where a ballot was accepted with a non-matching signature.",
    "Death records are automatically sent to state and county election officials so their voter registrations can be canceled, but if they happen within two months of an election it is possible a relative can return their mail ballot envelope.",
    "Our team of EIU investigators and attomeys has now collectively spent thousands of hours reviewing the Senate’s audit reports and other complaints, conducting interviews, and analyzing Maricopa County's election system and processes.",
    "We can account for every ballot that was delivered to the Elections Department, whether it was returned in a dropbox, voted in-person early, mailed back to us, or voted on Election Day,\" the statement reads.",
    "The attorney general has acknowledged filing criminal charges against nine people across the state for voting crimes stemming from the 2020 general election, where more than 3.4 million ballots were cast.",
    "Brnovich told Fann his office's investigation is \"still developing\" but suggested the county may have allegedly not followed \"critical procedures\" while transporting ballots during the 2020 election.",
    "As our state’s chief law enforcement officer, I am very concerned by any potential vulnerabilities in our state’s election systems, including those that the audit and other complaints have alleged.",
    "We have reached the conclusion that the 2020 election in Maricopa County revealed serious vulnerabilities that must be addressed and raises questions abou the 2020 election in Arizona.",
    "Brnovich, who is running for the U.S. Senate this year, made several legislative suggestions to Fann, including passing a law that gives his office civil subpoena powers.",
    "In a letter to Arizona Senate President Karen Fann, Brnovich recently offered an update on his agency's review of the findings Fann delivered him back in September.",
    "PHOENIX — Arizona Attorney General Mark Brnovich believes Maricopa County demonstrated \"serious vulnerabilities\" in its handling of the 2020 presidential election.",
    "Of those cases, just two were in Maricopa County and both involve people who illegally completed the ballot of their parent, who died shortly before the election.",
    "The first case came to light after a citizens group scoured lists of recently deceased people who may have voted and handed it over to the attorney general.",
    "The Senate's partisan-led audit still determined Biden won more votes than Trump, yet Fann passed along the review to Brnovich for further investigation.",
    "One woman awaits sentencing on a reduced felony charge, and the other already has completed probation she received after pleading guilty in December.",
    "\"We can report that there are problematic system-wide issues that relate to early ballot handling and verification, Brnovich wrote in the letter.",
    "The attorney general accused the county of transporting thousands of ballots without showing proof that proper custodial measures were followed.",
    "Fann spearheaded a months-long review of the county's election results after President Joe Biden narrowly defeated Donald Trump in Arizona.",
    "The EIU’s review has uncovered instancesofelection fraud by individuals who have been or will be prosecuted for various election crimes.",
    "The EIU’s review is ongoing and we are therefore limited in what we can disclose about specific criminal and civil investigations.",
    "They included five people who may have voted in more than one county and six who may have voted twice in Maricopa County.",
    "Maricopa County has repeatedly defended its handling of the 2020 election and rejected suggestions of widespread fraud.",
    "‘We can report that there are problematic system-wide issues that relat to carly ballot handling and verification.",
    "Thus, this interim report will focus on what our office can presently share and the current status of our review.",
    "The carly ballot signature verification system in Maricopa County is insufficient to guard against abuse.",
    "Perhaps the most notable criticism Brnovich makes in his letter involves chain-of-custody procedures.",
    "At times lection workers conducting the verification process had only seconds to review a signature.",
    "The county also located 27 voters who may have died before their ballots were returned in the mail.",
    "That’s what happened in most of the cases The Associated Press has tracked from the 2020 election.",
    "Brnovich’s office revealed that case on Wednesday, but did not say how the crime was discovered.",
    "\"The Maricopa County Elections Department ensures ballots are tracked and security is upheld.",
    "2005 NosCentre Ave, Proies, Azori 85004 + Prov: 602.542.4266»Ex 602.542.4085»wnt a2.",
    "Our records confirm that tamper-evident seals were secured on every dropbox.",
    "Catch up on the latest news and stories on the 12 News YouTube channel.",
    "The other charges are from felons allegedly voting.",
    "For example, on November 4, 2020, the Maricopa !",
    "Subscribe today."
  ]
}