{
  "id": 8413,
  "mediaId": 4045,
  "date": "2022-04-05",
  "headline": "Arizona high court revives AG's suit against ASU hotel plan",
  "image": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/1/8a/18a96c56-d80f-5920-8f9a-1931f04614cc/624cc6a0801a8.image.jpg?crop=1666%2C875%2C0%2C184&resize=1200%2C630&order=crop%2Cresize",
  "link": "https://www.stltoday.com/news/national/govt-and-politics/arizona-high-court-revives-ags-suit-against-asu-hotel-plan/article_ed29c42d-7689-5d60-80cd-ebfe0590bd75.html",
  "mediaOutlet": "St. Louis Post Dispatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "BOB CHRISTIE - Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The article likened it to a scene in the 1992 thriller “Basic Instinct.” Rayner accused “Boris Johnson’s cheerleaders” of using “desperate, perverted smears.” Johnson condemned the article, saying he deplored \"the misogyny directed at her anonymously today.”\nNorth Dakota’s longest-serving state senator says he'll resign following a report that he had traded scores of text messages with a man jailed on child pornography charges.",
    "AP\nPHOENIX (AP) — The Arizona Supreme Court on Tuesday revived a lawsuit filed by Attorney General Mark Brnovich against the board that oversees the state's three public universities over a hotel development agreement, giving him the right to try to prove the deal doesn't benefit taxpayers.",
    "The U.S. Capitol was briefly evacuated Wednesday evening after police identified an aircraft that they said posed \"a probable threat.” But the plane was actually carrying members of the U.S. Army Golden Knights, who then parachuted into Nationals Park for a pregame demonstration.",
    "The incident suggested a stunning communications failure between the military and the Capitol Police, all the more remarkable because of Washington’s focus on improving security since the January 6, 2021, attack on the building by supporters of then-President Donald Trump.",
    "Republican Ray Holmberg already had stepped down as head of a powerful panel that oversees the Legislature’s business between sessions after a published report that he had exchanged scores of text messages with a man jailed on child pornography charges.",
    "Women from across British politics called Monday for action to tackle misogyny after a newspaper ran a story accusing the deputy opposition leader of trying to “distract” the prime minister during debates by crossing and uncrossing her legs.",
    "The Mail on Sunday quoted an anonymous Conservative lawmaker as saying Labour Party Deputy Leader Angela Rayner tried to throw Prime Minister Boris Johnson “off his stride” as she sat across from him in the House of Commons.",
    "House Republican leader Kevin McCarthy had a “positive” call with Donald Trump, despite the release of an audio recording critical of the former president shortly after the Capitol insurrection on Jan. 6, 2021.",
    "Prosecutors say that on Jan. 6, 2021, Gillespie engaged in a very different kind of battle, joining rioters as they tried to wrest control of the U.S. Capitol from the federal government.",
    "McCarthy is shoring up support from Republicans after The New York Times posted audio of a Jan. 10, 2021, conversation in which McCarthy told GOP leaders he'd urge Trump to resign.",
    "For years, Vincent Gillespie waged a legal battle to try to gain control of hundreds of paintings by his father, renowned postwar American artist Gregory Gillespie.",
    "Biden is providing clemency to a Kennedy-era Secret Service agent from Chicago convicted of federal bribery charges that he tried to sell a copy of an agency file.",
    "Trump says he has had \"a very good relationship\" with McCarthy, who is in line to become House speaker if Republicans win control in the fall’s election.",
    "Biden also has pardoned two people who were convicted on drug-related charges in Texas and Georgia but went on to become pillars in their communities.",
    "Two-term Republican Sen. John Boozman is known in Arkansas as a soft-spoken figure, but his reelection message seems to be taking a combative tone.",
    "The White House announced the clemencies as it launched a series of job training and reentry programs for those in prison or recently released.",
    "But DeSantis’ decision to use the levels of government to settle a political feud with Disney is a step further than he's gone before.",
    "The alert from the U.S. Capitol Police sent congressional staffers fleeing from the Capitol and legislative building around 6:30 p.m.",
    "Those who know DeSantis aren't surprised by his decision to punish the entertainment giant for challenging his political priorities.",
    "He says the ads aren’t inconsistent with his low-key style and that he’s just focusing on concerns he’s hearing from voters.",
    "Associated Press video showed Gillespie milling about outside the Capitol speaking defiantly about his role in the attack.",
    "Ron DeSantis is testing the limits of his combative leadership style while sending an unmistakable message to his rivals.",
    "Boozman faces at least two challengers in Arkansas' primary next month who are questioning his conservative credentials.",
    "The sharper tone highlights Boozman's effort to appeal to voters who are mad that Donald Trump is no longer in office.",
    "The Democratic president also has commuted the sentences of 75 others for nonviolent, drug-related convictions.",
    "Investigators say Gillespie was identified by half a dozen sources from photos and video taken that day.",
    "He had risen to become one of the state’s most powerful lawmakers in a career that spanned 46 years.",
    "And that message is that there's nothing or no one he won’t fight as he plots his political future.",
    "The 43-year-old Republican has repeatedly demonstrated a willingness to fight while in office.",
    "One Boozman TV ads features a sheriff saying that Boozman will fight liberals over gun rights.",
    "In another, fellow GOP Sen. Tom Cotton of Arkansas praises Boozman as a conservative fighter.",
    "This material may not be published, broadcast, rewritten or redistributed without permission.",
    "That's according to two people familiar with the call and granted anonymity to discuss it.",
    "Please subscribe to continue reading…\nCopyright 2022 The Associated Press.",
    "President Joe Biden has granted the first three pardons of his term.",
    "Gillespie has pleaded not guilty to federal charges.",
    "In taking on Disney, Florida’s Republican Gov.",
    "Holmberg's resignation is effective June 1.",
    "All rights reserved."
  ]
}