{
  "id": 9853,
  "mediaId": 8475,
  "date": "2022-04-04",
  "headline": "DOJ warns Arizona it will sue to void new anti-trans laws",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/040422_LGBTQ-SCOTUS-signs.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/040422_doj_anti_trans_laws/doj-warns-arizona-it-will-sue-void-new-anti-trans-laws/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gloria Gomez",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110050",
  "termIds": [
    0
  ],
  "sentences": [
    "Senate Bill 1138 prohibits doctors from providing minors with gender reassignment surgeries, including procedures to masculinize or feminize a patient’s chest, and Senate Bill 1165 bars trans students from joining girls sports teams in competitive school athletic programs all the way up to university.",
    "The letter states that legislation restricting transgender access to medical care violates the Equal Protection Clause of the Fourteenth Amendment because it necessarily discriminates against transgender people based on sex, which the clause prohibits.",
    "“All persons should be free to access the services, programs, and activities supported by federal financial assistance without fear that they might face unlawful discrimination,” wrote Kristen Clarke, the assistant attorney general.",
    "Yesterday, the department’s Civil Rights Division sent a letter to all state attorneys general warning of legal action against laws that potentially violate constitutional and federal non-discrimination protections.",
    "Proponents of the sports ban in Arizona have cited Title IX as justification for keeping trans girls out of teams designated for biological girls, but that argument is flawed, according to the DOJ.",
    "Another controversial bill, approved by Ducey on the same day as the anti trans bills, which requires proof of citizenship to register to vote was challenged in court the next day.",
    "“The Department of Justice is sending a clear message to states across the country: elected officials have a duty to protect trans kids and their rights,” it wrote in a tweet.",
    "LGBTQ advocacy group Human Rights Campaign, whose Arizona chapter held a press conference at the state Capitol yesterday denouncing Ducey’s actions, welcomed the letter.",
    "Opponents have criticized the bills as discriminatory because they single out and cause harm for one group of people, and the department’s analysis supports that.",
    "Bridget Sharpe, the campaign’s director in Arizona, previously indicated the organization was open to joining legal challenges against the bills.",
    "The UA School of Journalism started the fellowship in 1977 to honor Don Bolles, an Arizona Republic reporter killed in a 1976 car bombing.",
    "Title IX prohibits sex discrimination in education programs that receive federal funding — like interscholastic sports in public schools.",
    "The Due Process Clause is also infringed on since it guarantees the parental right to follow medical advice for their children’s health.",
    "The Arizona bills don’t go into effect until 90 days after the legislative session ends, but legal action could be taken before then.",
    "Blocking students from participating because they are transgender may constitute discrimination based on sex, Clarke wrote.",
    "Arizona could find itself the target of lawsuits from the U.S. Department of Justice over recent anti-trans legislation.",
    "Gloria Gomez is a senior at the University of Arizona and the 2022 UA School of Journalism’s Don Bolles Fellow.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "Doug Ducey signed into law controversial bills targeting trans Arizonans.",
    "Arizona Attorney General Mark Brnovich was unimpressed by the threat.",
    "“To Biden Administration: See you in court (again),” he tweeted.",
    "Like what you're reading?",
    "Just two days ago, Gov.",
    "- 30 -"
  ]
}