{
  "id": 10429,
  "mediaId": 2728,
  "date": "2022-03-31",
  "headline": "Arizona governor won’t say transgender people exist",
  "image": "https://images.thestar.com/OZLl-4k8V6LFVtrCmiOAojLSOo0=/1280x1024/smart/filters:cb(1648771961971)/https://www.thestar.com/content/dam/thestar/news/world/us/2022/03/31/arizona-governor-wont-say-transgender-people-exist/2022033120034-624641a1f5d0d75ac3b99363jpeg.jpg",
  "link": "https://www.thestar.com/news/world/us/2022/03/31/arizona-governor-wont-say-transgender-people-exist.html",
  "mediaOutlet": "TorontoStar",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Christie",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Thank you, Governor Ducey, for taking a bold stand for women athletes, vulnerable children, and the unborn by putting your signature on (the bills) in the face of intense opposition from activists,” Center for Arizona Policy president Cathi Herrod said in a news release she posted on Twitter.",
    "U.S. Supreme Court precedent currently says women have a constitutional right to abortion until about 24 weeks of pregnancy, although it is considering whether to uphold a 15-week ban enacted in Mississippi and may overturn Roe v. Wade, the 1973 decision enshrining a woman’s right to choose.",
    "“I’m going to ask you to read the legislation and to see that the legislation that we passed was in the spirit of fairness to protect girls sports in competitive situations,” Ducey said, referring to the new law that targets transgender girls who want to play on girls sports teams.",
    "Wednesday’s signing of the two transgender bills and a third that bars abortions after 15 weeks of pregnancy and is currently unconstitutional put Ducey right in the middle of two top issues national Republicans are highlighting in the runup to November’s midterm elections.",
    "She said the legislation protects the unborn, ensures a level playing field for female athletes and shows that “Arizona will do everything it can to protect vulnerable children struggling with gender confusion” by enacting the surgery ban.",
    "The Republican worked instead to defend his signatures on bills that bar transgender girls and women from playing on girls high school and women’s college sports teams and barring gender affirming surgery for anyone under age 18.",
    "Ducey also signed election legislation that minority Democrats said amounted to voter suppression by requiring longtime Arizonans to be thrown off the voter rolls if they did not prove their citizenship and residence location.",
    "“And today, he put in jeopardy pregnant people, transgender youth in danger and curtailed voting rights for people of color.”\nSocial conservative groups and the Arizona Republican Party praised Ducey’s action.",
    "The organization worked to ensure families and transgender young people came to the Capitol to testify against the bills as the Republican-led House and Senate considered them this session.",
    "Doug Ducey refused to say Thursday if transgender people actually exist, twice dodging direct questions on the subject just a day after he signed legislation limiting transgender rights.",
    "Governor Ducey signed a series of bills Wednesday, March 30, targeting abortion and transgender rights, joining a growing list of GOP-led states pursuing a conservative social agenda.",
    "The top Democrat in the state House, Rep. Reginald Bolding, called Wednesday “probably one of the darkest days we’ve seen in the history of Arizona.“\n“With the stroke of a pen, Gov.",
    "“That’s what the legislation is intended to do, and that’s what it does.”\nAsked again if he believed there are “actual transgender people,” he again answered slowly and carefully.",
    "Ducey’s response was “appalling,” according to the Arizona director of the Human Rights Campaign, a national civil rights group that advocates for equality for LGBTQ people.",
    "If you do not yet have a Torstar account, you can create one now (it is free)\nConversations are opinions of our readers and are subject to the Code of Conduct.",
    "The Center for Arizona Policy, whose president shepherded the abortion and women’s sports bills through the Legislature, called it a victory.",
    "When specifically asked if he believed that there “are really transgender people,” the governor paused for several seconds before answering.",
    "“These are permanent surgeries of reassignment that are irreversible, and those discussions can happen once adulthood is reached,” he said.",
    "Spencer Cox vetoed a transgender sports ban in his state, saying it would harm transgender girls, but the Legislature overrode the veto.",
    "The governor leads the Republican Governors Association, which is charged with helping elect GOP chief executives in U.S. states.",
    "“It’s quite shocking that he can’t even address trans people or even say that he thinks they exist,” Bridget Sharpe said.",
    "Arizona joins 13 other states in enacting laws preventing transgender girls and women from playing on girls teams.",
    "He in is the last year of his second term as Arizona governor and term limits bar him from seeking reelection.",
    "Doug Ducey gives his state of the state address at the Arizona Capitol, Monday, Jan. 10, 2022, in Phoenix.",
    "SHARE:\nAnyone can read Conversations, but to contribute, you should be registered Torstar account holder.",
    "Eric Holcomb also vetoed a sports bill, but lawmakers hope to override his action as well.",
    "Ducey has hurled Arizona backwards to its ugliest past,” Bolding said Wednesday.",
    "“I ... am going to respect everyone, and I’m going to respect everyone’s rights.",
    "The American Civil Liberties Association has vowed to sue over the surgery ban.",
    "Ducey said the surgery ban protects children from irreversible decisions.",
    "And that’s what the legislation does,” Ducey said.",
    "The Star does not endorse these opinions.",
    "And I’m going to protect female sports.",
    "PHOENIX (AP) — Arizona Gov.",
    "— Arizona Republican Gov.",
    "Indiana Gov.",
    "Utah Gov."
  ]
}