{
  "id": 1119,
  "mediaId": 2520,
  "date": "2022-02-17",
  "headline": "GOP election temper tantrum drags on, this time with a plan to split Maricopa County",
  "image": "https://www.gannett-cdn.com/presto/2022/02/10/PPHX/60a33cd7-ec8d-4081-8b9a-2e3ee0e9d2e5-working_proposal_county_split.png?crop=814,458,x0,y204&width=814&height=458&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/02/16/splitting-maricopa-county-payback-planning-hoffman-bill/6818034001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    0
  ],
  "sentences": [
    "The email, obtained by MSNBC’s Rachel Maddow, implored Pence to “delay the certification of the election results and instead seek clarification from the Arizona legislature as to which slate of Presidential Electors are proper and accurate.”\nAnd now he’s the guy who has proposed splitting up Maricopa County.",
    "Hoffman is the guy who ran an internet troll farm in the months leading up to the 2020 election, hiring teenagers to blanket the internet with fake posts on conservative talking points and baseless conspiracy theories aimed at getting Donald Trump reelected.",
    "Voting for the bill were Republican Reps. Judy Burges of Skull Valley, Frank Carroll of Sun City, John Fillmore of Apache Junction, Teresa Martinez of Casa Grande, Kevin Payne of Peoria, Jake Hoffman of Queen Creek and John Kavanagh of Fountain Hills.",
    "“Patriots like (Maricopa County Supervisors) Steve Gallardo, Bill Gates, Jack Sellers and Clint Hickman would not comply with the directive to decertify the Maricopa County election,” Rep. Lorenzo Sierra, D-Avondale said, in voting against the bill.",
    "With an actual straight face, Rep. Jake Hoffman said his bill – which would strip the Maricopa County Board of Supervisors of their power – has absolutely nothing to do with the fact that the supervisors refused to decertify the 2020 election.",
    "House Bill 2787 proposes to split the county four ways, gerrymandering the lines to cram Democrats into one county (Maricopa) while allowing Republicans to control the other three:\nMaricopa, comprised of much of Phoenix, Tempe and Tolleson.",
    "Certainly, it’s about being more expensive, what with having to pay three additional sets of county supervisors and sheriffs, treasurers, assessors, recorders, county attorneys and such – more than 40 new elected officials in all.",
    "The Republican-controlled Arizona Legislature continues its retribution tour, moving one step closer on Wednesday to dividing Maricopa County into four pieces and dividing you from your money in the form of increased taxes.",
    "“Any attempt to paint this as retaliation or retribution toward the county is pure conspiracy theory ... ,” Hoffman, R-Queen Creek, told the House Government and Elections Committee during Wednesday’s hearing on his bill.",
    "Voting against the bill were Democratic Reps. Reginald Bolding of Laveen, Alma Hernandez of Tucson, Jennifer Jermaine of Chandler, Sarah Liguori of Phoenix, Lorenzo Sierra of Avondale and Christian Solorio of Phoenix.",
    "He never bothered to ask the county, Phoenix\nAustin Smith, a Republican legislative candidate and one of the few people who Hoffman consulted with about the bill, was also one of the few to testify in support of it.",
    "If this was a serious idea born of a desire to make the government work better, it seems to me Hoffman would have consulted with county officials to understand both the benefits and the pitfalls of such a plan.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Opinion: The GOP-controlled Arizona Legislature continues its retribution tour, moving one step closer to dividing Maricopa County into four pieces and dividing you from the money in your wallet.",
    "But it’s not political, he assures us, and it’s not payback to the Republican-run Maricopa County Board of Supervisors who refused to go along with the canard that Trump was robbed.",
    "He is one of the state’s now-infamous fake electors, avowing in December 2020 that he had been duly elected by Arizona voters to cast one of Arizona’s 11 electoral votes for Trump.",
    "He’s the guy who on Jan. 5, 2021, sent an email to a White House staffer, containing an “urgent letter” to be passed along to then-Vice President Mike Pence.",
    "It'll likely be up to House Speaker Rusty Bowers to put the kibosh yet another bad bill born of his colleagues' continuing temper tantrum over the election.",
    "“Just because there’s a Republican in that position,” he replied, “doesn’t mean that we’re always going to agree with them.”\nLike, say, about an election?",
    "One of these three counties, I'm sure, would decertify this election in a heartbeat.”\nOK, so maybe Hoffman’s bill isn’t about payback.",
    "Instead, Hoffman acknowledged that he talked only to a handful of people in the East and West valleys and a few rural folks.",
    "So naturally, the bill passed on a party line 7-6 vote – with virtually no questions asked by Hoffman’s fellow Republicans.",
    "Until then, it was left to Democrats to wonder why the so-called party of small government is so hot to do this thing.",
    "He would have consulted with Phoenix officials to explore the consequences of splitting the city into two counties.",
    "It’s all about breaking up a growing county that already has too much power, with 65% of the state’s population.",
    "Or that the supervisors poked gaping holes in every conspiracy theory offered up by the Senate’s ninja auditors.",
    "That’s not counting new jails and courthouses to be built and existing county assets and debts to be divvied up.",
    "And to suggest that we should take anything Jake Hoffman says at face value is, as laughs goes, a belly buster.",
    "“To say that this has anything to do with the election is laughable and nothing more than a conspiracy theory.\"",
    "He would have brought in tax experts and public works experts to explain the ramifications of a four-way split.",
    "As for how to handle complexities like dividing up the county-owned hospital and the county-owned Chase Field?",
    "He was asked how it is that Republicans don’t feel represented in a county they control from top to bottom.",
    "The bill now goes to the Rules Committee then onto the full House, which Republicans control 31-29.",
    "Hoffman says it’s all about being more representative and accountable on issues like water.",
    "As for the tax implications of forcing each of the four new counties to pay their own way?",
    "Then he dropped the bill last week, on the last day that bills can be introduced.",
    "It’d all be worth the extra cost, Hoffman said, to ensure responsive government.",
    "This is about putting more chips on the roulette table so you can win your bet.",
    "You know, for next time he and his pals want to overturn an election.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "Mogollon, covering north Phoenix and Scottsdale.",
    "O’odham, which is now western Maricopa County.",
    "Hohokam, taking in Mesa, Chandler and Gilbert.",
    "Hoffman has no clue\nAs for what it would cost?",
    "It's all about being more representative?",
    "Maybe it’s, instead, about planning.",
    "Actually, they don’t wonder at all.",
    "How can we trust what Hoffman says?",
    "This is not about representation.",
    "“Folks, this is not about water.",
    "Hang onto your wallets, people.",
    "Who voted for HB 2787?",
    "What would it cost?",
    "He doesn’t know.",
    "He doesn’t know.",
    "He doesn’t know."
  ]
}