{
  "id": 16061,
  "mediaId": 8261,
  "date": "2022-03-10",
  "headline": "More Arizona Cities Add Juneteenth",
  "image": "https://azinformant.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-10-at-10.33.29-AM-1.png",
  "link": "https://azinformant.com/2022/03/10/more-arizona-cities-add-juneteenth/",
  "mediaOutlet": "Arizona Informant",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darnell Hill",
  "authorUrl": "https://azinformant.com/author/darnell/",
  "termIds": [
    0
  ],
  "sentences": [
    "“ By recognizing Juneteenth as an official holiday in Avondale, we are taking a significant step in our city’s history to show that we take pride in our diversity, and we are committed to the meaning and significance of the history surrounding Juneteenth.”\nIn 2016, Governor Doug Ducey signed HB2226, sponsored by Rep. Reginald Bolding, recognizing June 19 as Juneteenth Day in Arizona and making Arizona the 45th State to recognize Juneteenth as a State holiday.",
    "The Avondale City Council on Tuesday, Feb. 22, voted unanimously to amend the City’s holiday leave policy to make Juneteenth a paid holiday for City employees, and an observed City holiday\n“ Through the years, Juneteenth has been commemorated as a day that should be recognized by all as a celebration of freedom,” Avondale Mayor Kenn Weise said.",
    "“I appreciate both former Mayor Mark Mitchell’s leadership and that of the federal government in laying the groundwork for this.”\nFor the last two years, City of Tempe employees were granted a floating holiday to commemorate Juneteenth.",
    "Employees and residents alike were asked to take time to educate themselves about African-American heritage and honor the lives, sacrifices and contributions they made to build the American fabric.",
    "Several companies also are recognizing Juneteenth with holiday pay or time off, including Twitter, Nike, Lyft, Quicken Loans, Best Buy, Target, Starbucks, All- state, Google and others.",
    "Though the Emancipation Proclamation had been signed in 1863 by Abraham Lincoln, it took more than two years for the words of freedom to reach as far as Galveston, Texas.",
    "Juneteenth is the oldest nationally celebrated commemoration of the ending of slavery in the United States.",
    "“I’m excited to see the City of Tempe take this forward thinking step,” Tempe Mayor Corey Woods said.",
    "As Juneteenth falls on a Sunday this year, the holiday will be observed on Monday, June 20, 2022.",
    "It commemorates the1865 emancipation of those who had been enslaved in the United States.",
    "The Tempe City Council added Juneteenth as an official city holiday on Thursday, March 3.",
    "The federal government declared Juneteenth a holiday June 16, 2021."
  ]
}