{
  "id": 17115,
  "mediaId": 8405,
  "date": "2022-03-02",
  "headline": "Arizona House approves bill that bans close range recordings of police",
  "image": "https://www.gannett-cdn.com/-mm-/85db4cf4a9cb0e170ac2635b038fde31f8469bc1/c=0-124-2852-1728/local/-/media/2020/11/15/Rockford/ghows_gallery_ei-IR-200919931-18af0d96.jpg?width=2852&height=1604&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/legislature/2022/02/25/arizona-house-approved-bill-bans-close-range-recordings-police/6939060001/",
  "mediaOutlet": "Phoenix Arizona News: Breaking news, local headlines - azcentral.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chelsea Curtis",
  "authorUrl": "https://www.azcentral.com/staff/2648159001/chelsea-curtis/",
  "termIds": [
    5675,
    5458,
    4708,
    2099,
    2782,
    6161
  ],
  "sentences": [
    "Various news organizations including Gannett, the company that owns The Arizona Republic, also signed a letter from the National Press Photographers Association opposing the bill because it violated the free speech and press clauses of the First Amendment as well as \"the 'clearly established right' to photograph and record police officers performing their official duties in a public place.\"",
    "\"So once you add police to the context, there's always an interest in knowing how police are performing their function, even if you're pro-police and you're recording them to show that you think they're doing the right thing ... there's just a public interest in knowing how police are doing their job that is fundamentally important to people.\"",
    "\"As several federal courts have affirmed, people have the First Amendment right to record police officers while they carry out their duties — and the ability to record police interactions has become an important tool to ensure police accountability and transparency,\" said ACLU of Arizona Communications Director Marcela Taracena.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nBarr later added if HB 2319 is signed into law, it'd only a matter of time before it's challenged in court.",
    "\"The major changes are I went from 15 feet to 8 feet and that is based upon 8 feet being established by the U.S. Supreme Court as being a reasonable distance as they applied it to people entering and leaving abortion clinics when faced with protesters, they said that was a good balance,\" Kavanagh continued.",
    "Other amendments to the bill before passage included allowing any person at the center of police contact or any occupants of a vehicle stopped by police to record those interactions from a close distance as long as they don't interfere with police actions, like searches or field sobriety tests.",
    "The bill now also defines law enforcement activity as any instance in which police are questioning a suspicious person, arresting someone or interacting with \"an emotionally disturbed or disorderly person who is exhibiting abnormal behavior.\"",
    "\"Let's say you're observing the police and you're outside the 8-foot area but the police come at you and they say 'hey turn that camera off' and they come within 8 feet of you, are you now committing a crime?\"",
    "\"Based on comments made by people testifying in committee and by my working with our Rules attorneys and their intern, I received a lot of good input to make this bill conform with the Constitution,\" he said.",
    "Gregg Leslie, director of Arizona State University's First Amendment Clinic, also separately noted that police situations were too fluid to be able to apply limits like the 8-foot distance set by the bill.",
    "A bill passed by the Arizona House this week that would ban people from taking close-range recordings of police without permission has raised concerns of violating people's First Amendment rights.",
    "The measure proposed this legislative session was approved on Wednesday by the House on a 31-28 party-line vote, with Republicans in favor, and will next go to the Senate for consideration.",
    "\"I further believe that right now what we have to do as a state is make sure that we are standing up directly for our communities to ensure that they know that they are safe.\"",
    "It was later amended to 8 feet to address concerns it would be unconstitutional, bill sponsor Rep. John Kavanagh (R-Fountain Hills) said at a committee hearing on Monday.",
    "Bill raises constitutional issues\nDemocratic Minority Leader Reginald Bolding voted against the measure, stating it \"would make it less transparent for citizens.\"",
    "Aside from the First Amendment issues the bill poses, Arizona First Amendment Coalition Attorney Dan Barr pointed out that it'd be difficult for people to follow.",
    "However, offenders risk facing a misdemeanor if they fail to follow an officer's verbal warnings or had previously been convicted of violating the law.",
    "Phoenix's new Office of Accountability and Transparency director Roger Smith told The Republic earlier this month the law \"cuts against transparency.\"",
    "It was instrumental in the case against former Minneapolis police Officer Derek Chauvin who was ultimately convicted in the murder of George Floyd.",
    "Bystander videos of law enforcement activity have become increasingly common, and at times helpful at exposing instances of police misconduct.",
    "\"When you're in public, you just don't have the same kind of privacy that gives you control over other people's actions,\" Leslie said.",
    "Kavanagh, a former detective at the Port Authority in New York, proposed a similar bill in 2016 while he served as a state senator.",
    "House Bill 2319 initially restricted people within 15 feet of law enforcement activity from recording police without permission.",
    "He killed that bill himself before it was assigned a hearing because it was \"mired in controversy,\" he said at the time.",
    "Video captured by a bystander also recently showed 13-year-old Taylor Thomas being punched by a Phoenix police officer.",
    "HB 2319 would make it a petty offense — punishable with a fine — for anyone found in violation of the potential law.",
    "Some First Amendment experts say the bill poses a constitutional issue and grants police too much discretion.",
    "\"And for officers who are doing their jobs right, it's better to have more information than less.",
    "You'd be able to help those officers to present the fact that they did their jobs correctly.\"",
    "\"The more quality information you can get about these incidents, the better,\" he said.",
    "\"(It's) not the direction that we should be walking in as a state,\" he said.",
    "Subscribe to azcentral today.",
    "Support local journalism.",
    "Barr questioned."
  ]
}