{
  "id": 2085,
  "mediaId": 8350,
  "date": "2022-02-09",
  "headline": "Arizona House panel advance measures that would create hurdles for ballot initiatives",
  "image": "https://ktar.com/wp-content/uploads/2022/02/pexels-mikhail-nilov-6969850-scaled-e1644456977476.jpg",
  "link": "https://ktar.com/story/4880797/arizona-house-panel-advance-measures-that-would-create-hurdles-for-ballot-initiatives/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "PHOENIX (AP) — Qualifying initiatives for the ballot and getting them passed by voters would get harder under legislation advanced Wednesday in the Arizona House, the latest attempt by Republican lawmakers to rein in a procedure that’s created laws opposed by the GOP and business interests.",
    "“This would actually allow us to have greater citizen input and to ensure that it really is something that matches the will of the voters, not just the will of those that are paid for…by outside billionaires and activist groups,” said Rep. Jake Hoffman, a Queen Creek Republican.",
    "Rep. Reginald Bolding of Laveen, the top Democrat in the House, said the Republican lawmakers are looking to create new rules for citizen-driven lawmaking that wouldn’t apply to candidates collecting signatures to run for office.",
    "Republicans have been frustrated by a series of successful initiatives pushed by progressive groups that would not have passed the GOP-dominated Legislature, including a minimum wage increase and a tax hike to pay for education.",
    "The GOP has significantly tightened the rules in recent years to make it harder to get initiatives on the ballot and easier to kick them off, but 2022 will be the first time they have asked voters to change the rules themselves.",
    "Rep. Tim Dunn, a Yuma Republican who sponsored the proposed initiative changes, said require petition organizers to show they have broad support across the street and not just from populated areas of Maricopa and Pima counties.",
    "“How was that fair that Arizona voters have to now be held hostage to a Legislature that chooses one set of rules for themselves and another set of rules for Arizona voters?” Bolding said.",
    "Those would limit ballot measures to a single subject and water down the Voter Protection Act, which strictly limits the ability of lawmakers to alter initiatives approved by voters.",
    "And lawmakers voted to eliminate vote centers — centralized polling places allowing voters to cast a ballot anywhere in their county rather than an assigned precinct.",
    "They say it’s virtually impossible for the Legislature to change them because of the Voter Protection Act and they often are backed by money from outside the state.",
    "He said the 60% threshold to pass ballot measures ensures they are overwhelmingly popular since lawmakers are limited in how they can modify them down the road.",
    "The committee also voted to create new requirements for election officials to check voting rolls against various government databases and cancel registrations.",
    "If approved by the full House and Senate, the two measures would appear on the 2022 ballot alongside two others that lawmakers referred to voters last year.",
    "Democrats and progressive groups say the changes would increase the costs and complexity for grassroots organizers to get their ideas in front of voters.",
    "The other would allow the Legislature to hire an outside firm to analyze the list of voters who have not shown documentation to prove their citizenship.",
    "One would require petition signatures to come from all 30 legislative districts and the other would require support from 60% of voters to pass.",
    "Initiatives are often the only way to do things that are supported by a majority of voters but not a majority of lawmakers, they said.",
    "A state House committee approved two measures asking voters to change the rules for citizen initiatives.",
    "Both measures were approved in 7-6 party-line votes in the House Government and Elections Committee.",
    "Meanwhile, the Senate Republicans approved two election bills opposed by most Democrats.",
    "One would raise the threshold to trigger a recount in a close election.",
    "Both measures were approved by Republicans in party-line votes.",
    "Those voters can vote only in federal races.",
    "Pass it along to the KTAR News team here.",
    "We want to hear from you.",
    "Have a story idea or tip?",
    "Share\nComments"
  ]
}