{
  "id": 2208,
  "mediaId": 8347,
  "date": "2022-02-09",
  "headline": "AZ public schools need legislature to bail them out so they can spend money they have to pay bills",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/71f4293/2147483647/strip/true/crop/2518x1322+0+50/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F3c%2F74%2F1a0b25f74f718481c062beae8809%2Fclassroom.png",
  "link": "https://www.kgun9.com/news/local-news/az-public-schools-need-legislature-to-bail-them-out-so-they-can-spend-money-they-have-to-pay-bills",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Phillips",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“As the leader of the House Democratic Caucus there will be 29 Democrats that will vote for a measure to raise the limit of the K-12 aggregate expenditure to allow school districts to have the revenue they need,” said House Minority Leader Reginald Bolding.",
    "Superintendent for Public Instruction Kathy Hoffman said failure to act \"will have a devastating effect on our schools and the families they serve.”\nThe costs to districts will be in the millions of dollars.",
    "The Arizona Legislature could vote to override the constitutional limit on spending when it returns next session so districts can pay their bills.",
    "PHOENIX — Arizona public schools are finding out they may need to reduce spending for the remainder of the school year by more than $1.1 billion.",
    "Chairwoman Cobb supports a temporary suspension of the spending limit and would then like to see the measure put up to a public vote.",
    "In 1980, voters approved an initiative that set limits on how much the state spends on education — 50% of the budget.",
    "Any changes to spending limits require a two-thirds-majority vote in both the Arizona House and Senate.",
    "I’m just going to throw them in the budget,” House Appropriations Committee Chair Regina Cobb said.",
    "This year, public schools collectively spent over a billion dollars more than they should have.",
    "Now districts are being warned to reduce spending an average of $1,300 per student, a 17% cut.",
    "It’s not because they don’t have the money; They do, the districts just can't spend it.",
    "“We have to do something in March if we don’t want to them in limbo,” Cobb said.",
    "When districts plan their budgets, it’s based on state and local tax revenue.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "“That was probably not a great way to do budgeting,\" she said.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "“I think what they saw was these dollars were there.",
    "If that will happen is unclear."
  ]
}