{
  "id": 2436,
  "mediaId": 8345,
  "date": "2022-02-08",
  "headline": "Arizona Legislature bill would mandate outside probes of police shootings",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2022/02/08/Arizona_state_lawmakers_8_web_qxCQsKI.jpg",
  "link": "https://kdminer.com/news/2022/feb/08/arizona-legislature-bill-would-mandate-outside-pro/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://kdminer.com/staff/associated-press/",
  "termIds": [
    3813,
    2782,
    2308,
    102,
    5949,
    6515
  ],
  "sentences": [
    "So what this legislation will do is allow for the rest of the state to have the opportunity to have an independent investigation by another agency, whether it be a branch of DPS, a local task force or another agency.”\nThe law enforcement group partnered with the Morrison Institute at Arizona State University to conduct a public opinion survey.",
    "PHOENIX – Police shootings and any other use of deadly force by law enforcement officers in Arizona would be required to be investigated by a new division of the Arizona Department of Public Safety or an outside agency or regional task force under a measure unanimously approved by a House committee Monday.",
    "The proposal leaves it to the DPS director to choose staff and design policies for the new division, only specifying the new leader must have five years' law enforcement administration experience and that investigators be certified police officers with investigator training.",
    "The Republican-controlled Legislature blocked those boards last year as part of the state budget, but that provision was struck down because it was a policy proposal that did not meet the state constitution's bill single subject requirements.",
    "At a news conference before the Military Affairs and Public Safety Committee hearing, Bowers called the proposal “one of the largest reforms ever seen in Arizona relating to major use of force incidents involving our law enforcement.\"",
    "“That is critical, and it will also increase accountability across the state.”\nThe new bill comes after similar proposals from Democratic Minority Leader Reginald Bolding failed to advance over several legislative sessions.",
    "The proposal by Republican House Speaker Rusty Bowers was developed with input from major Arizona law enforcement agencies over the past year and applies to all uses of deadly force, regardless of whether someone dies.",
    "It found that only a third of survey respondents trusted local police agencies to investigate their own deadly force incidents, but half would trust a statewide agency specifically created to do so.",
    "Gilbert Police Chief Michael Soelberg opposed Bolding's legislation last year but said he promised to come back with a plan that would enable independent investigations across the state.",
    "The new version was crafted after extensive collaboration between Bowers and sheriff's and police departments, including Sheriff Paul Penzone of the Maricopa County Sheriff's office.",
    "“Because it is our belief collectively that if there’s going to be legislation written regarding law enforcement, that law enforcement leaders must be at the table,” Penzone said.",
    "It emerges after years of growing concern and public suspicion about police agencies investigating their own officers after a deadly encounter, both in Arizona and nationally.",
    "But it’s our expertise that must be heard.”\nPenzone said he was concerned about cost, and Bowers' bill contains $24 million in funding to set up the new DPS division.",
    "Bolding said he's happy to see the new proposal, which is actually more expansive than the one he proposed last year, but concerned the delays were political.",
    "“I would hate to think just because a Democrat’s name was on the bill that the Legislature chose to not move it forward, even though it was a good idea.",
    "“There are a few things I think need to be added to this, and my hope is through the process we can get those things added.”",
    "The deadly force reviews are criminal investigations, and the local agency will still do parallel internal policy reviews.",
    "“And so what you have before you now is a comprehensive plan, which if fully funded, will be successful,” Soelberg said.",
    "Bolding said he also wants prosecutors from another county to review the findings rather than the county attorney.",
    "“It is my hope that this legislation will affirm and reaffirm public trust in our law enforcement,\" Bowers said.",
    "“My goal is to really work with the speaker and anyone else who wants to make this bill better,” Bolding said.",
    "“The key aspect of the proposal has to be reform and (to) rebuild and restore community trust,” Bolding said.",
    "The bill also won't stop independent civilian review boards, like those the city of Phoenix has launched.",
    "“A lot of agencies already have independent investigations and task forces set up.",
    "“Not because we expect that it's our wishes that should be carried out.",
    "But it seems like that could be the case, looking at House Bill 2650.\""
  ]
}