{
  "id": 2740,
  "mediaId": 8475,
  "date": "2022-02-03",
  "headline": "Despite lingering claims, election officials hope to put 2020 in the past",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/02-richer-speaks-full.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/020322_az_election_officials/despite-lingering-claims-election-officials-hope-put-2020-past/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camila Pedrosa",
  "authorUrl": "",
  "termIds": [
    5622,
    5879,
    2246,
    1698,
    2414,
    102,
    750,
    6515,
    5949
  ],
  "sentences": [
    "“But … if politicians down at the Capitol want to do something, what they should be doing is looking at ways our elections were undermined and stopping them.”\nGulotta said there are currently about 70 bills in the Arizona Legislature aimed at restricting voting access, bills he thinks are “garbage” that “no serious person should put their name on.” They include bills that would eliminate mail-in voting, mandate hand counting of all ballots and allow the Legislature to nullify election results.",
    "Gulotta said it’s vital to work toward passing federal voting rights bills like the John Lewis Voting Rights Advancements Act of 2021 and the Freedom to Vote Act, to keep states from passing bills that would “do huge damage to all voters, not just Republicans or Democrats or young or old.”\n“They will do huge damage to large cross-sections of voters, but they (state Republicans) don’t care.",
    "Richer thinks that rather than passing federal legislation, lawmakers at all levels should focus on the public’s general distrust in the election process, calling claims of voter fraud and mass disenfranchisement in 2020 “unsubstantiated.” And he cautioned that politicians who keep pushing election fraud claims could see them backfire.",
    "Those bills, which would do everything from expanding mail-in voting to making Election Day a federal holiday, have stalled in the Senate where Republicans have filibustered the measures and two Democrats – including Sen. Kyrsten Sinema, D-Ariz. – have refused to join the rest of the party to get around the filibuster.",
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\n“There’s no greater sign of approval, that you’re willing to spend a year of your life, a lot of your own money … running for the system,” he said.",
    "“These people are revealing their true opinion that they don’t think that the system is wholly corrupt.”\nBut Richer also said Wednesday that one of the biggest threats to the voting system currently is elected officials refusing to accept the 2020 election results.",
    "It means they care enough to try to fix the system, said Richer, whose comments came as part of a bipartisan panel of officials from around the country talking about steps that need to be taken to restore voter confidence in the system before this fall’s elections.",
    "Gulotta and State Rep. Reginald Bolding Jr., D-Laveen, agreed with Richer that election deniers spreading conspiracy theories and winning government offices are threatening election integrity and breaking their constituents’ trust in the election system.",
    "“I think if you’re a voter, you have to say, ‘You’re saying that (there was fraud), but you also want me to donate to your campaign and you want me to vote for you, so you know … those are maybe a little inconsistent, help me out here,'” Richer said.",
    "Maricopa County Recorder Stephen Richer has blasted the “outlandish theories” of election deniers in the past, but on Wednesday he said he is “flattered” that far-right deniers of the 2020 election results are running for state office this year.",
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nCandidates then will have to say they have confidence in the 2022 elections, he said.",
    "And that information is that we have free and fair elections, and it (the 2020 election) is probably one of the most heavily scrutinized and transparent elections in our state’s history,” Bolding said.",
    "“We’re actually really excited to be moving into the 2022 general elections, just because we hope that that will shift the conversation, finally, away from 2020,” Richer said.",
    "to avoid accepting the reality: We lost the top two races in Arizona,” he said, referring to Democratic victories in the presidential and U.S. Senate races in the state.",
    "Sponsors on those bills include Reps. Shawnna Bolick, R-Phoenix, and Mark Finchem, R-Tucson, both of whom have called for overturning the 2020 presidential election.",
    "But while panelists preferred to look forward, other voting rights advocates said officials cannot afford to ignore the ongoing threat posed by election deniers.",
    "“As elected leaders, I believe we do have a responsibility, regardless of party affiliation, to ensure that we’re giving the public accurate information.",
    "Richer said he “welcomes” such candidates into the race, saying he feels “flattered” that they trust the election process enough to run for office.",
    "And both are running to be the next secretary of state, potentially making a 2020 election denier the state’s top elections official.",
    "“In our hearts, we should look beyond the 2020 election,” said Alex Gulotta, the Arizona state director at All Voting is Local.",
    "“I’m embarrassed listening to my party concoct the most outlandish theories (Chinese ballots!)",
    "But, you know, we’re glad that they have confidence in this 2022 election,” Richer said.",
    "He used even harsher language in an open letter to Arizona Republicans last August.",
    "They hope it’ll hurt someone else’s votes more than their votes,” he said.",
    "But neither was flattered by deniers seeking to run the election system.",
    "“I don’t know why it’s any different from 2020.",
    "- 30 -"
  ]
}