{
  "id": 3635,
  "mediaId": 8475,
  "date": "2022-01-27",
  "headline": "Newest Arizona GOP election proposal would allow lawmakers to reject election results",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/012722_stop-the-steal-election.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/012722_az_election_rejection_bill/newest-arizona-gop-election-proposal-would-allow-lawmakers-reject-election-results/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    1690,
    2782,
    1126,
    99,
    6667,
    5949,
    5943
  ],
  "sentences": [
    "“I don’t think, when you have 60 members down here, that we’re going to arbitrarily say, ‘Well we disagree.’”\nTammy Patrick, the former head of federal compliance at the Maricopa County Elections Department who is now the senior advisor for elections at the nonprofit Democracy Fund, said the proposal is part of a troubling trend in which “anti-democratic forces” in state legislatures across the country are sponsoring bills that would allow lawmakers to subvert the will of the people.",
    "Early or absentee voting would only be permitted for people who are genuinely unable to vote in person on Election Day, such as people serving in the armed forces, people who will be out of the state on the day of the election, people who are hospitalized or in nursing homes, or people who are visually impaired.",
    "Rep. John Fillmore’s House Bill 2596 would eliminate no-excuse early voting, which is used by the overwhelming majority of Arizona voters, and would require that all ballots not only be counted by hand, but that those tallies be completed within 24 hours of the polls closing on Election Day, among other changes.",
    "On a global level, Patrick said laws like these are reminiscent of dictatorships with “sham democracies.”\n“This type of activity, when you look at it all in one comprehensive way, it’s anti-democratic, it’s authoritarian, and it’s not the sort of activity and actions you see in a healthy democracy,” she said.",
    "Local\nIt would also do away with on-demand early voting and require ballots to be counted by hand — in 24 hours\nLawmakers would have the power to reject election results under a sweeping piece of legislation that would make seismic changes to the way elections are conducted in Arizona.",
    "Senate President Karen Fann ordered an audit of the 2020 general election results in Maricopa County, but hired unqualified and biased contractors who had participated in efforts to overturn the election and to prove that Trump was cheated out of his re-election.",
    "Ballot paper would also have to include security features, such as holograms or “identifiable sequence marking,” which has become a rallying cry for people who baselessly believe that counterfeit ballots were inserted into Maricopa County’s tally.",
    "Under the proposed law, the legislature would be required to call itself into session after an election to “review the ballot tabulating process.” Once that review is completed, lawmakers would decide whether to accept or reject the results.",
    "Democrats are staunchly opposed to the types of proposals he included in HB2596, and Republicans have only a one-vote majority in each legislative chamber, meaning they can’t afford to lose a single member on a party-line vote.",
    "“This has obviously never been run by an election official,” said Ryan Macias, a consultant at RSM Election Solutions and the former acting director of testing and certification at the U.S. Election Assistance Commission.",
    "In the Senate, Republican Paul Boyer has expressed skepticism about many of the changes his GOP colleagues want to make, especially proposals based on the findings of the so-called audit, of which he’s been critical.",
    "House Minority Leader Reginald Bolding, D-Phoenix, predicted that if his Republican colleagues got the power to reject election results, they’d do so based simply on which results they liked or didn’t like.",
    "See, now that restricts voting,” Sen. Sonny Borrelli, R-Lake Havasu City, told Patriot Party activist Daniel McCarthy in a video posted on Twitter on Jan. 10, the day the 2022 legislative session began.",
    "He noted that the “audit” recounted votes from the presidential and U.S. Senate races, which Democrats won, but didn’t question the results of legislative or other races in which Republicans prevailed.",
    "Some 80% of Arizona voters use the state’s early voting system, in which voters receive a ballot in the mail, with the option of mailing it back or dropping it off in person at a polling place.",
    "Those allegations largely revolve around Dominion Voting Systems, the vendor that provides machines for Maricopa County and many other jurisdictions where Biden defeated Trump.",
    "“Here’s my approach generally – I’m not going to vote for anything to legitimize the Cyber Ninjas audit,” Boyer told the Arizona Mirror before Fillmore introduced his bill.",
    "Numerous lawsuits were filed challenging the November 2020 election results in Arizona, but none were successful — and few alleged that the results were affected by fraud.",
    "Except in limited instances when people must vote using machines because they’re visually impaired, all ballots would have to be counted by hand, rather than by machines.",
    "It’s unclear if Arizona ever prosecuted someone for illegally voting with another person’s early ballot until last year, despite using no-excuse early voting for decades.",
    "But just because the majority of people do something doesn’t necessarily make it right, Fillmore argued, saying early voting opens the door to potential election fraud.",
    "I know that if you were the election officer and you held that election in your precinct, and those are the people that are going to be counting, I trust you,” he said.",
    "The “audit” team alleged that it found dozens of issues, including thousands of potentially illegal votes, but acknowledged that there might be legitimate explanations.",
    "Perhaps the biggest change, however, is that the legislature would be empowered to accept or reject election results in legislative, congressional and statewide races.",
    "And if a judge refused to order a new election, “then we’re just going to have to shut up and deal with it.”\nBut that’s not what the language of Fillmore’s bill says.",
    "Voters must sign the envelopes used to return their early ballots, and those signatures must be verified by trained election workers before the ballots are counted.",
    "“It’s terrifying,” said Jennifer Morrell, a former deputy of elections in Arapahoe County, Colo., who is now a partner at The Elections Group, a consulting outfit.",
    "“We’ve seen a legislature and members who argued that the top of the ballot was fraud, but the bottom of the ballot was accurate when it came to the 2020 election.",
    "If the bill is intended to only allow the legislature to reject election results if it finds fraud, then the bill needs to be explicit about that, Patrick said.",
    "The bill also doesn’t say what factors a judge must consider when weighing a request, or whether there would be a re-vote on all races or just specific ones.",
    "The movement arose in response to bogus claims made by former President Donald Trump and some of his allies that the 2020 election was rigged against him.",
    "Even some audit supporters who have pushed new election restrictions based on the findings have expressed skepticism about getting rid of early voting.",
    "Macias noted that Cyber Ninjas, the company that led Fann’s so-called audit, took several months to count only two races on about 2.1 million ballots.",
    "Instances of fraud in systems with early voting, even in states and other jurisdictions that conduct all of their elections by mail, are rare.",
    "Advocates of Trump’s bogus election fraud claims have promoted a number of conspiracy theories about the machines used to tabulate ballots.",
    "No more early voting or electronic ballot tabulators\nThe legislation makes a number of other major changes to Arizona’s election laws.",
    "Fillmore suggested that it wouldn’t be reasonable to stipulate all the potential reasons why lawmakers might reject election results.",
    "Fillmore’s bill also stipulates that the legislature may conduct an audit of election results for any primary or general election.",
    "But there are already remedies if fraud is suspected in an election: people can go to court if there’s evidence of malfeasance.",
    "Counting that many ballots by hand would take an extraordinarily long time, and would be nearly impossible to do in 24 hours.",
    "Counties would have to notify voters at least two years in advance if they want to change the location of polling places.",
    "And it doesn’t explicitly say what happens if the legislature rejects an election but the courts won’t order a new one.",
    "If the legislature found “obvious fraud” and rejected the election’s results, the courts would have to overturn them.",
    "If the legislature rejects the results, any qualified voter can go to court to ask a judge to order a new election.",
    "Counties would no longer be able to use vote centers where anyone can cast ballots, regardless of where they live.",
    "The measure doesn’t require the legislature to have a specific reason to reject an election’s results.",
    "All of those lawsuits, including those that did claim fraud, were dismissed for a lack of evidence.",
    "Patrick said the judicial retention elections that Arizonans vote in could add months to the tally.",
    "Their majority was OK, but President Trump and Mark Kelly’s races were inaccurate,” Bolding said.",
    "Elections experts also emphasized that hand counts are simply less accurate than machine counts.",
    "Fillmore, a Republican from Apache Junction, said the proposal is simply a matter of oversight.",
    "“Cyber Ninjas couldn’t do it in eight weeks in a single county with two races,” Macias said.",
    "In Maricopa County, nearly 92% of voters used early ballots in the 2020 general election.",
    "Instead, voters would have to go to a polling place in the precinct where they live.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson!",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson!",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "Elections experts say the hand-counting requirements are simply not realistic.",
    "That raises the question of what exactly must be done to demonstrate fraud.",
    "And the returns must be completed within 24 hours of when the polls close.",
    "Election officials and experts argue that early voting is highly secure.",
    "Counties would also be prohibited from using emergency voting locations.",
    "Human beings are simply bad at tedious, repetitive tasks, Morrell said.",
    "Arizona’s ballots, by comparison, have dozens of races and questions.",
    "It’s not the legislature that would overturn an election, he said.",
    "And he said the legislature would use that power with discretion.",
    "Election experts found that provision to be highly problematic.",
    "How much support Fillmore’s bill will get remains to be seen.",
    "“There’s a reason why we sort of moved to voter technology.",
    "“I don’t care what election officials are going to tell me.",
    "The county has mostly debunked the audit team’s findings.",
    "“Do you think we come down here just to create havoc?",
    "It’s both accuracy and efficiency,” she said.",
    "And he won’t vote to eliminate early voting.",
    "Fillmore was unpersuaded by such arguments.",
    "I’ll tell you what I know in my heart.",
    "That is likely to be a problem.",
    "No,” Fillmore said.",
    "“One day?",
    "- 30 -"
  ]
}