{
  "id": 3909,
  "mediaId": 8439,
  "date": "2022-01-20",
  "headline": "Still think voter suppression is a myth? This Republican bill proves otherwise",
  "image": "https://www.gannett-cdn.com/presto/2021/07/24/PPHX/415f7f58-e9d5-4d08-a62f-02fc038b589a-cent02-7gsqy81tzph1fhv5c837_original.jpg?crop=2799,1575,x0,y0&width=2799&height=1575&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/elviadiaz/2022/01/20/arizona-bill-requires-fingerprints-and-passport-vote/6599559001/",
  "mediaOutlet": "Southwest Valley Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elvia Díaz",
  "authorUrl": "https://www.azcentral.com/staff/2647952001/elvia-daz/",
  "termIds": [
    0
  ],
  "sentences": [
    "“History will remember those who chose to silence the voice of voters for their own political gains,” Bolding, who also is running for secretary of state, said in a statement about the U.S. Senate’s failed attempt to pass voting legislation.",
    "But even if we were to give them the benefit of the doubt and agree to extra layers of security, requiring fingerprints and a passport or naturalization papers is just over the top and nothing more than a hurdle to voting.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "This isn't about 'election integrity'\nBlackman’s legislation has nothing to do with “election integrity” and everything to do with keeping certain segments of the population from voting.",
    "There are a flurry of bills being introduced at the Arizona Legislature that Republicans say deal with “election integrity” but are just tools to make it a lot harder for people to vote.",
    "Republicans in Arizona and across the nation will keep invoking Trump’s “Big Lie” that the 2020 presidential election was stolen from him to push through restrictive election laws.",
    "Arizona already doesn’t issue driver’s licenses to undocumented immigrants, which means none of these people could vote illegally, as some Republicans have falsely claimed.",
    "It's a hurdle to keep people from voting\nDon’t tell me this isn’t a blatant hurdle to discourage people, especially minorities, the poor and Native Americans from voting.",
    "I give you Exhibit A.\nBlackman is proposing that early voting occur only by request, and that non-early voting must to take place in a polling place or a center.",
    "They’re free to do so after the U.S. Senate failed this week to approve sweeping federal legislation that would have overridden state voter suppression bills.",
    "Meanwhile, though, Republicans like Blackman are free to try anything to discourage people from casting a ballot – the cornerstone of any democracy.",
    "Unfortunately, too many minorities still need multiple jobs to make ends meet and are more likely to rely on public transportation to go anywhere.",
    "The proposed legislation, House Bill 2577, would replace existing voter ID requirements, including driver’s licenses and all forms of tribal IDs.",
    "Blackman also wants to require a new voter ID card, which would require a passport or citizenship certificate and other documents, to vote.",
    "We cannot tolerate the efforts by the Right to take away our most sacred American right, our freedom to vote.”\nThat sounds great.",
    "On top of that, anyone voting in person would also need either fingerprints or a “unique security code” issued to the voter.",
    "Democrats like Arizona House Minority Leader Reginald Bolding are vowing to keep fighting, but the near future is bleak.",
    "They joined the 50 Senate Republicans in opposing changing the filibuster to approve the federal voting legislation.",
    "Arizona has 22 tribes, many in remote areas where residents already have to travel long distances just to vote.",
    "Arizona state Rep. Walt Blackman is busting the Republican narrative that voter suppression is just a myth.",
    "They don’t have money to spare for a passport or may not even know how to navigate the system to get one.",
    "Opinion: HB 2577 would require fingerprints and a passport or naturalization papers to vote in Arizona.",
    "And now, Blackman is proposing to invalidate their tribal ID card for the purpose of voting.",
    "Rural voters and Native Americans are particularly vulnerable to these types of hurdles.",
    "Because so many people of color don’t have equal access to these types of ID.",
    "Kyrsten Sinema of Arizona and Joe Manchin of West Virginia for that.",
    "Elvia Díaz is an editorial columnist for The Republic and azcentral.",
    "Why is this voter suppression if the requirements apply to everyone?",
    "Reach her at 602-444-8606 or elvia.diaz@arizonarepublic.com.",
    "That's a blatant attempt at voter suppression.",
    "“But like those before us, we cannot give up.",
    "You don’t call that voter suppression?",
    "Follow her on Twitter, @elviadiaz1.",
    "Blame Democratic Sens.",
    "We cannot sit down.",
    "Don’t believe me?"
  ]
}