{
  "id": 4137,
  "mediaId": 8385,
  "date": "2022-01-18",
  "headline": "Navajo Nation leaders attend annual Arizona Indian Nations & Tribes Legislative Day Voting rights, infrastructure, ICWA and missing persons among discussions with state leaders",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2022/01/18/legislation02.jpg",
  "link": "https://www.nhonews.com/news/2022/jan/18/navajo-nation-leaders-attend-annual-arizona-indian/",
  "mediaOutlet": "nhonews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Meetings were planned other senior legislative leaders including Senate Minority Leader Reginald Bolding Jr., Senate President Karen Fann, Senate Majority Whip Sonny Borrelli and Chairwoman Leah Peterson of the Arizona Corporation Commission to discuss future tribal broadband initiatives.",
    "“Western Navajo Chapters are the tourism and commerce hub of the southwest to the Grand Canyon and we welcome millions of visitors each year to our tribal parks like Canyon De Chelly, Monument Valley, Horseshoe Bend, or Antelope Canyon,” said Council Delegate Paul Begay.",
    "That will allow us to thrive and live.”\nIn November, President Joe Biden signed a $1.2 trillion infrastructure bill that will provide around $8 billion to Arizona to upgrade outdated roads, bridges, transit systems, invest in broadband initiatives, and more.",
    "Meetings included a discussion with Speaker of the House Rusty Bowers, House Appropriations Committee Chairperson Regina Cobb, Senate Minority Leader Rebecca Rios, Senate Co-Minority Whip Martin Quezada and Co-Minority Whip Victoria Steele.",
    "In regards to the closure of the Navajo Generating Station and Kayenta Mine, Nez called on state leaders to submit letters to the Arizona Corporation Commission in support of Coal Community Transition funding for the Navajo Nation.",
    "The Naabik’íyáti’ (NABI) State Task Force members led multiple meetings with Arizona leaders to discuss education priorities, public safety facilities, tribal water rights issues and infrastructure projects for the Navajo Nation.",
    "Navajo Nation President Jonathan Nez and Vice President Myron Lizer were joined by members of the 24th Navajo Nation Council for the 27th Annual Indian Nations and Tribes Legislative Day hosted by the Arizona State Legislature.",
    "PHOENIX, Ariz. — Tribal leaders highlighted the contributions of Navajo people, voting rights, infrastructure, Indian Child Welfare ACT (ICWA), missing persons and other topics before the Arizona Legislature Jan. 12.",
    "He also urged state lawmakers to support the voting rights of Native American people and the ICWA, while highlighting the progress of infrastructure development and access to clean water on the Navajo Nation.",
    "“It is clear the lack of water resources and infrastructure development in many Navajo rural areas is limiting our ability to support businesses and construct new grocery stores, gas stations, or hotels.",
    "“Throughout this pandemic, just as our elders did long ago during times of adversity, our Navajo people continue to step up and demonstrate the strength and resilience of our ancestors.",
    "“The Navajo Nation continues to meet with Arizona state leaders to share the priorities of the Navajo people, especially during this pandemic,” said Council Delegate Carl Slater.",
    "With a projected state surplus for additional funding, the Navajo Nation Council advocated for various infrastructure opportunities available for the largest tribe in Arizona.",
    "He also requested the support of the State Legislature to pass an ICWA bill to support tribes in custody matters involving children who are enrolled members of our tribes.",
    "“It is important we maintain the government-to-government relationship when making decisions that will impact the future of Arizona’s 22 Tribal Nations.",
    "A personal meeting between Navajo leaders and Hatathlie was scheduled for Jan. 13, alongside Representative Jasmine Blackwater-Nygren (D-Dist.",
    "She replaces former Arizona Senator Jamescita Peshlakai, who resigned in December to take a position with the U.S. Department of Interior.",
    "Nez speaks at state legislatures\nOn Jan. 12, Nez addressed the Arizona State Legislature and tribal leaders at the Arizona State Capitol.",
    "Nez spoke about the contributions and resilience of Navajo people during the COVID-19 pandemic and throughout society.",
    "We continue to use our way of life teachings, the teachings of our elders, to push back on COVID-19,” he said.",
    "The pandemic with the closure of the Navajo Generating Station has hit the Navajo Nation hard economically.",
    "To recover, we must prepare for future water shortages and uphold the water rights of the Navajo people.",
    "7) from the Coal Mine Mesa Chapter was officially sworn into office by the Arizona Legislature.",
    "On Jan. 10, State Senator Theresa Hatathlie (D-Dist.",
    "7), and Rep. Myron Tsosie (D-Dist.",
    "7)."
  ]
}