{
  "id": 886,
  "mediaId": 43,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "'Trucker Randy' gives truckers a bad name with racist podcast claim",
  "image": "https://images.dailykos.com/images/1062677/story_image/Trucker_Randy.jpeg?1650912109",
  "link": "https://www.dailykos.com/story/2022/4/25/2093902/--Trucker-Randy-gives-truckers-a-bad-name-with-racist-podcast-claim",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2298,
    122,
    307,
    428,
    2748,
    2791,
    2863
  ],
  "sentences": [
    "He lost his facebook account for violating community standards in 2020 (see https://radio.wcmu.org/tags/randy-bishop)\nHere is what Randy said at a gun rights and militia rally in 2020 in Lansing as reported by Michigan Radio: https://www.michiganradio.org/.../anti-police-brutality...: Trucker Randy? Bishop, who has ties to the Republican Party in Michigan and two felony convictions, urged people to vote against Democrats in upcoming elections.",
    "pic.twitter.com/J0APSzaICX\n Heartland Signal (@HeartlandSignal) April 25, 2022\nBishop is running for a seat in the state's 37th Senate district, a position currently occupied by Republican Sen. Wayne Schmidt, but he announced in January that he is instead running to fill a newly created seat on the Grand Traverse County Commission, WWTV reported.",
    "According to The Detroit News, Randy Bishop, who also goes by \"Trucker Randy,\" said during his podcast episode on March 31 that the media was trying to destroy the \"nuclear family,\" with every commercial showing a \"biracial mom and dad.\"",
    "\"Can't even watch a college basketball tournament without commercials telling me I have to feel guilty because I think a family should be a White mom, a White dad and White kids,\" Bishop said.",
    "Instead, it distanced itself from Bishop with a statement posted on Facebook:\nViews such as the ones Trucker Randy Bishop espouses have no place in the Democratic Party.",
    "Because they own the public schools.?\nIt's a claim so ridiculous it's not even worth dignifying with a rebuttal, and the Michigan Democratic Party made no such attempt.",
    "https://www.freep.com/.../michigan-republican.../5820267001/\nHe has been convicted of felonies downstate, and runs a \"conservative\" radio show touting RIGHT WING ideas.",
    "A right-wing racist doubling as a Michigan radio host decided last week to throw his hat in the ring for a state Senate seatand get this: He's running as a Democrat.",
    "He shows nothing but disrespect to our system of government by using a run for elected office to promote his personal agenda, entirely based on lies, hate and fear.",
    "RELATED STORY: Watch what happens when you pick the wrong Democrat to lie about\nHe went on to claim that Black people wield too much power in American society.",
    "Randy Bishop is not a Democrat, he is a dishonest minor social media personality that enjoys getting attention from making outrageous statements.",
    "Conley, an oncologist, had this to say about Bishop in a Facebook post on Friday:\nAs you know, I have two other candidates for the primary Aug 2.",
    "Disgusting racist belief systems are not welcome in the Democratic Party and frankly should not be welcome in any political party or community.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We will not support his efforts to run for Senate and find it deeply insulting that he would dare to put a D next to his name.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "If they get back the majority in the (Michigan) House this November  Then God help us, you know what we'll be relying on?",
    "He was the former chair of the Antrim Republican Party and promotes the BIG LIE and is a supporter of Garrett Soldano!",
    "Mind you, just last month he was trying to make a case that TV commercials should only feature white families.",
    "The same one that's placating to Governor (Gretchen) Whitmer over the China virus (novel coronavirus).\"",
    "On his 3/31 show, he said:\n- The \"LGBTQXYZ\" community is \"confused\" about \"what's between their legs.\"",
    "Why are we allowing such a small percentage of our population to control our society,? he asked.",
    "Conservative radio host Randy Bishop addresses a Michigan committee on the election in 2020.",
    "Bishop is up against Democrats Barbara Conley and Jim Schmidt on the August primary ballot.",
    "x\nRandy Bishop, a Michigan right-wing radio host, just filed to run for state Senate.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "One of them is \"Trucker Randy\" Bishop, who runs a conservative radio talk show.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "While I don't know him, he doesn't seem to actually be a democrat.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "- A family should be \"a white mom, a white dad & white kids.\"",
    "And they're going to try to do it through politics this year.",
    "Candidates who say or believe these things are not welcome.",
    "The Republicans and Mike Shirkey in the Senate to stop it.",
    "Please vote in the August primary for true democrats!",
    "We have got to stop them, folks,? Bishop said.",
    "Your time and your donations are needed NOW!",
    "Well, we have got to be just as smart.\"",
    "This is a short blurb about Daily Kos.",
    "Because they own the politicians.",
    "\"They want us to die and go away.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "- VP Harris \"is not Black.\"",
    "Because they own the media.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}