{
  "id": 15874,
  "mediaId": 8465,
  "date": "2022-03-14",
  "headline": "New annex unveiled by NPAC officials",
  "image": "https://thevwindependent.com/news/wp-content/uploads/2022/03/Annex-Stakeholders.jpg",
  "link": "https://thevwindependent.com/news/2022/03/15/new-annex-unveiled-by-npac-officials/",
  "mediaOutlet": "thevwindependent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Van Wert Area Peforming Arts Foundation Board Chairman Kevin Laing, recognized the Central Annex naming rights donors that include Central Insurance ($200,000, annex naming rights); Leigh Eisenhauer ($100,000, NPAC permanent endowment fund); Kenneth and Marilyn Merkle ($50,000, star dressing rooms 1 and 2); Jim and Mary Pope ($25,000, laundry facility); Hallrich Inc.-Pizza Hut ($25,000, multi-purpose room); Tim and Karie Stoller ($15,000, multi-purpose room); Kent and Judy Bradford ($15,000, production office); Bruce and Julie Kennedy ($15,000, production office); Van Wert Federal Savings Bank ($25,000), and First Federal Bank Of Van Wert ($25,000).",
    "Senator Rob McColley and Representative Craig Riedel demonstrated their devotion to the arts economy in northwest Ohio by not only advocating for our support but by being present to celebrate this milestone.”\nCentral Insurance Regional Vice-President RJ Coleman addressed the audience with the community-minded intent behind Central’s continued investment in the live performing arts, and Van Wert County Foundation CEO Seth Baker provided the historical significance of contributions paving the way for progress today.",
    "The annex and the sound and lights project represent a $1.1 Million capital improvement into the Niswonger Performing Arts Center, which was a $10.1 Million project opening in 2007 as a result of a campaign funded by Scott M. Niswonger, the Van Wert County Foundation, business and personal donations.",
    "The program included remarks from Ohio Senator Rob McColley (R-Napoleon) and Ohio House Representative Craig Riedel (R-Defiance), both integral in securing $400,000 in Ohio Facilities Construction Commission funds for both the annex and sound and lights project.",
    "VW independent staff and submitted information\nThe Central Insurance Annex at The Niswonger Performing Arts Center was unveiled to donors, dignitaries and stakeholders in a celebration event held on Sunday.",
    "The annex construction took place during the pandemic, instilling hope for the future of the performing arts in Van Wert thanks to OFCC funding, naming rights contributors and personal donors.",
    "The Niswonger Performing Arts Center is recognized as a key component of economic development in northwest Ohio as well as a resource for enhancing the quality of life throughout the region.",
    "Following dinner, guests enjoyed tours through the Central Annex for a behind-the-scenes look at how the staff and artists use the space on show days.",
    "“State funds through the OFCC have been essential to our capital improvements,” Niswonger Performing Arts Center Executive Director Tafi Stober said.",
    "The festivities began with an appreciation dinner at Willow Bend Country Club with 105 annex contributors and stakeholders in attendance.",
    "A private concert by The Lee Warren Band began with a recognition presentation orchestrated by the Van Wert Live professional team.",
    "“We are fortunate to be represented by dedicated dignitaries working on our behalf to bring state budget dollars to Van Wert.",
    "Additionally, over forty personal donors were recognized for their contributions to the project.",
    "Future facility capital improvements are under consideration."
  ]
}