[
  {
    "id": 2157,
    "mediaId": 65,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "But the third debate is expected to also include two lesser known candidates  Catherine Davis and <span class='selected-term'>Kandiss Taylor</span>.",
    "author": "Paul Steinhauser",
    "title": "Georgia GOP gubernatorial clash: Gov. Kemp and Trump-backed challenger Perdue to face off at debates"
  },
  {
    "id": 2161,
    "mediaId": 195,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Catherine Davis (R), a frequent candidate for office, takes 5 percent of the vote; <span class='selected-term'>Kandiss Taylor</span> (R), a teacher who ran for a U.S. Senate seat in 2020, would claim 2 percent.",
    "author": "",
    "title": "Kemp, Raffensperger lead Trump-backed challengers in Georgia: poll"
  },
  {
    "id": 2109,
    "mediaId": 19,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Brian Kemp Has Wide Lead over David Perdue in Governor's Primary"
  },
  {
    "id": 1976,
    "mediaId": 178,
    "date": "4/24/2022 12:00:00 AM",
    "sentence": "Besides Kemp and Perdue, the primary includes Republicans Catherine Davis, <span class='selected-term'>Kandiss Taylor</span> and Tom Williams, who were excluded from Sunday's debate.",
    "author": "JEFF AMY Associated Press",
    "title": "Georgia's Kemp and Perdue clash over elections in debate"
  },
  {
    "id": 1955,
    "mediaId": 112,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Besides Kemp and Perdue, the primary includes Republicans Catherine Davis, <span class='selected-term'>Kandiss Taylor</span> and Tom Williams, who were excluded from Sunday's debate.",
    "author": "Associated Press",
    "title": "Sparks fly in Georgia GOP gubernatorial debate: Perdue adamant 2020 election was stolen"
  },
  {
    "id": 1841,
    "mediaId": 136,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "Georgia's Republican gubernatorial candidate <span class='selected-term'>Kandiss Taylor</span> said that she will launch a plan to take on the \"Satanic elites,\" which she previously described as a \"Luciferian regime.\"",
    "author": "Jason Lemon",
    "title": "GOP Governor Candidate Takes Aim at 'Luciferian Regime,' 'Satanic Elites'"
  },
  {
    "id": 1818,
    "mediaId": 129,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "First-time debaters included <span class='selected-term'>Kandiss Taylor</span>, an educator; Catherine Davis, a civil rights advocate; and Tom Williams, a former Robins Air Force Base employee.",
    "author": "",
    "title": "Ohio Republicans campaign in Trump's shadow ahead of Tuesday's primary."
  },
  {
    "id": 1821,
    "mediaId": 65,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "CLICK HERE TO GET THE FOX NEWS APP\nBesides Perdue, Kemp is also facing primary challenges from three lesser-known candidates - Catherine Davis, <span class='selected-term'>Kandiss Taylor</span>, and Tom Williams.",
    "author": "Paul Steinhauser",
    "title": "Georgia GOP gubernatorial clash: Kemp brings in big bucks as he faces Trump-backed challenge from Perdue"
  }
]