{
  "id": 2269,
  "mediaId": 157,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Insiders flagged credibility problems for 'key witness' in lawsuits filed to overturn 2020 election",
  "image": "https://www.rawstory.com/media-library/image.png?id=29729185&width=980",
  "link": "https://www.rawstory.com/tore-maras/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Green",
  "authorUrl": "https://www.rawstory.com/u/jordan_green_special_to_raw_story",
  "termIds": [
    3097
  ],
  "sentences": [
    "The core team of ShadowGate? promoters eventually expanded to include Scott Bennett, a former military contractor who had previously been convicted of making a false and fraudulent statement to the government and for the unauthorized wearing of a military uniform by a federal jury in Florida; Stephen Pidgeon, a Washington State attorney who represented Republican gubernatorial candidate Loren Culp in a lawsuit alleging widespread election fraud that was reportedly withdrawn after the state Attorney General warned it would ask a judge the impose sanctions; and Dennis Nathan Cain, a former FBI contractor who reportedly possessed documents said to have linked the Clinton Foundation to the 2013 sale of a Canadian-owned mining company to a Russian firm's subsidiary.",
    "They came back telling me: She knows some things and has been behind the curtain, but she also lies, exaggerates, deflects, changes subjects rapidly trying to through [sic] people off, and we cannot rely on her for anything factual because we caught her in too many lies and exaggerations over three hours' (precisely as I warned her they would do if she did not heed a little coaching from me).?\nMaras could not be reached for comment for this story, but wrote in a blog post about the episode: I made it no secret that I was knowingly attempting to deceive those asking me questions.",
    "The complaints filed by Powell included two pages of materials citing the anonymous declarant's claims, including an assertion that votes cast during the presidential election were routed into foreign countries,? and then mixed? through an algorithm? in a secretive process,? and quoted the declarant's conclusion that the Digital Fix' observed with an increased spike in VOTES for Joe Biden can be determined as evidence of a pivot.?\nThe anonymous declarant was Terpsechore Tore? Maras, host of the popular pro-Trump Tore Says? podcast.",
    "I'm not going to give you guys too much information on who it is because we're protecting their identity, but as soon as we get this video interview, we are gonna hop on a plane back to DC, and we're gonna get that to the Trump team's lawyers, and those who can do something with it.?\nThe interview, with the subject's voice altered and image scrambled, is featured in the documentary, but was not cited in any of the lawsuits filed by the president's legal team.",
    "Seth Keshel, a former Army military intelligence captain who assisted a team assembled at defamation attorney Lin Wood's Tomotley estate in South Carolina -- that included Powell and retired Lt. General Michael Flynn -- acknowledged that serious doubts were raised about Maras's credibility in a private Telegram message to another person involved in the continuing effort to uncover evidence of election fraud since President Biden took office.",
    "No one gets offered a spot to become an officer while they are in bootcamp.? Keshel added that unfortunately she wound up as a key witness in one of our cases.?\nIn an email to Raw Story on Tuesday, Keshel said, I can't speak for why various things were included or not, as it was not my call to what made it in, and I certainly can't speak for the attorneys and don't want to be construed that I tried to do so.",
    "I think they put something in the hand sanitizer.' She claimed that all her lies was because they drugged her.?\nBergy told Raw Story that Patrick Byrne covered the costs of lodging at the Westin Arlington Gateway Hotel in Virginia for himself, Weaver, Wince and Maras during the period they were assisting in the effort to uncover alleged election fraud on Trump's behalf.",
    "The judge also found that Maras created an entirely fake online persona,? including claiming to be a 22-year veteran of Naval intelligence and a Purple Heart recipient.?\nMaras' declaration was used in the Wisconsin and Arizona lawsuits filed by Powell despite concerns raised by several people involved in vetting her claims, new reporting from Raw Story has found.",
    "Also, with nearly a year and a half in the books since that time, more clarity is available on some topics that we didn't have in November/December 2020.?\nKeshel did not respond to a follow-up question as to whether the concerns about Maras' credibility were communicated to Powell or other lawyers who served as her co-counsel before the declaration was filed.",
    "The documentary intersperses unfounded assertions about election fraud with inspirational speeches by Flynn and others at a Dec. 12, 2020 pro-Trump rally, and includes calls to action by Weaver such as: Make sure that you also show up in DC on the 6th to have your voice heard.?\nBennett recounted Team America's efforts in a July 2021 interview with Bergy.",
    "Footage from the trip showing Weaver driving a Mercedes out of a parking garage and crossing a bridge into San Francisco was used in a documentary entitled Revenge of the Kraken!? that Weaver released on Dec. 26, 2020.\nWe are about to go interview a whistleblower pertaining to election fraud,? Weaver says in a reality TV-style narration in the film.",
    "A 37-page declaration from an anonymous person representing themself as a former electronic intelligence analyst under the 305th Military Intelligence [Battalion]? with extensive experience as a white hat hacker used by some of the top election specialists in the world,? was filed in Powell's lawsuits in Wisconsin and Arizona on Dec. 1, 2020.",
    "Keshel's account of the concerns flagged about Maras is corroborated by others, including Patrick Byrne, the former Overstock.com CEO who marshaled and financed a team of internet researchers, some with military and federal government backgrounds, to investigate alleged election fraud, working closely with Powell and Flynn.",
    "While insisting that he was there as a fly on the wall, as an observer,? he said that by the time he attended a Jan. 5 pro-Trump rally he had begun to conclude: This is a big freaking influence operation.?\nAsked to identify the desired outcome of the influence operation,? Bergy did not respond directly.",
    "Weaver claimed in her documentary that a small group of government contractors? was responsible for everything from framing the Trump campaign to set him up for the Russia collusion investigation to creating fake news in the mainstream media? and fomenting civil unrest during the George Floyd protests.",
    "A review by PolitiFact in August 2020 concluded that the claims were sweeping? and unfounded.?\nAround the time of the ShadowGate? documentary release, Weaver and her boyfriend, Gavin Wince, were arrested and charged with robbery, tampering with evidence, obstructing justice and domestic violence.",
    "In mid-November 2020, lawyer Sidney Powell turned to a provocative source in her quest to build a bogus case that votes had been electronically altered through foreign interference, with collusion from Deep State actors, to tip the presidential election from Donald Trump to Joe Biden.",
    "Introducing Bergy, Bennett said, He was back with me in Washington, DC along with the team doing election analytics under Joe Flynn [Michael Flynn's brother], Patrick Byrne, Sidney Powell, Rudy Giuliani, a whole host of team members that were back there.",
    "Bergy said he only stayed at the Westin for three nights, but that Byrne covered Weaver, Wince and Maras' hotel expenses from mid-November 2020 through about Jan. 18, 2021, and said that Byrne instructed them to submit their receipts to Weaver.",
    "Bergy told Raw Story that he, Maras, Weaver and Wince were there as guests of? Byrne; Rudy Giuliani, Trump's personal attorney; and Michael Trimarco, a Giuliani associate who initially rented the block rooms at the Westin after the election.",
    "Less than three months earlier, a North Dakota state judge had found that Maras raised funds for victims of an apartment fire and homeless shelters, and then used the funds for herself through purchases at McDonald's, Walmart and Target.",
    "When she approached Powell's legal team in November 2020, Maras was part of a crew that had been promoting the ShadowGate? conspiracy theory that was the subject of a documentary produced by former InfoWars correspondent Millie Weaver.",
    "It wasn't for influence.?\nBergy swore out a 70-page affidavit on Dec. 2, 2020 that detailed his experience as a military contractor and included multiple emails, letters, texts, social media posts and federal election campaign reports.",
    "Byrne was more involved with the efforts of the team promoting the ShadowGate? conspiracy theory, which came to be known as Team America? as it shifted into efforts to uncover election fraud than has been previously reported.",
    "In the same email in which Byrne confirmed that he belatedly arranged an interview to assess Maras' credibility, he told Bergy that his affidavit was read and absorbed,? although it was not used in any of the lawsuits.",
    "We have a mission attitude, which is advance, destroy the enemy, expose the spies and constantly be attacking, attacking, attacking.?\nBergy told Raw Story that he came to DC at the invitation of Weaver and Wince.",
    "Byrne, the former Overstock.com CEO and financier of much of the effort to overturn the election, confirmed in an August 2021 email to Bergy that he was aware of concerns about Maras' credibility.",
    "Tore was taken out an [sic] interviewed by some people I know in the intelligence community who are absolutely on kour [sic] side,? Byrne said in the email, which was also reported by ProPublica.",
    "You can certainly ask the question of why did Rudy Giuliani and Patrick Byrne secretly bring in Millie and Gavin into their inner circle to collect and disseminate information,? Bergy said.",
    "I will tell you that filing deadlines were very tight, and the team had hundreds upon hundreds of affidavits and statistical summaries to peruse before, some more actionable than others.",
    "Maybe it did.?\nSince the assault on the US Capitol, Bergy said he has come to question the motives of many of the people with him in DC from mid-November 2020 through Jan. 6, 2021.",
    "Maras was cited alongside Bergy as a primary source for the claims in ShadowGate.? By both of their accounts, they had a falling out during their time together in Washington, DC.",
    "Beyond paying for hotel rooms, Bergy said that Byrne also footed the bill for Weaver and Wince to fly to California to interview a supposed whistleblower from the AFL-CIO.",
    "I was brought there  at least I was told; I wonder now  I was brought there as a whistleblower to provide my formal affidavit,? Bergy told Raw Story.",
    "Corroborating statements reported by ProPublica that Byrne and Maras said the interview took place after her declaration was filed in federal court.",
    "Everything I saw was a tactically coordinated [Interactive Internet Activities] operation disseminating whatever narrative they needed at the time.",
    "Other than that, you wanted to put out information and control damage with people that had a background that is basically information warfare.?",
    "In a story published by the Washington Post in late December 2020 that exposed Maras' identity, Byrne denied funding her efforts in DC.",
    "Byrne did not respond to a request for comment submitted through his lawyer in time to meet the publication deadline for this story.",
    "Weaver, Wince and Maras showed up in Washington, DC in early November, and Bergy told Raw Story that he joined them around Nov. 15.",
    "But primarily, your information, while explaining the big picture, did not give us anything actionable to use in our battle.",
    "And Millie and her husband saw that, and Stephen Pidgeon, our attorney that was back there knew that in our character.",
    "Maras and a former military contractor named Patrick Bergy were both featured as whistleblowers? in the documentary.",
    "Bergy told Raw Story that, based on a text he exchanged with Maras, the interview took place on Dec. 14, 2020.",
    "Yes, the media says stuff about everyone, but there are many easily disprovable things in her history.",
    "I had NO IDEA who I was talking to.?\nBergy told Raw Story that he saw Maras after the interview.",
    "Bergy told Raw Story that he reviewed some of the claims that went into Maras' declaration.",
    "Because you came in with [Maras], you were painted with the same brush,? Byrne told Bergy.",
    "Why did they [involve] Phil Waldron; he's retired colonel with a background in psy-op.",
    "I was on the initial teams drafting lawsuits over the states with Sidney and Flynn.",
    "The charges were later dropped, but Weaver was fired by InfoWars owner Alex Jones.",
    "And we performed our mission like soldiers, Patrick Bergy and I, and Tore too.",
    "Tore, this stuff you're sending me is garbage,? he said he told Maras.",
    "Their relationship has only become more acrimonious since then.",
    "Tore is not credible,? Keshel said in the Aug. 17, 2021 text.",
    "She gets out of the car a little panicked,? Bergy recalled.",
    "Our teams researched her heavily and found many problems.",
    "This article was paid for by Raw Story subscribers.",
    "She's like, I think they drugged me.",
    "Prefer to give a one-time tip?",
    "Try us and go ad-free for $1.",
    "Not a subscriber?",
    "Just go search.",
    "Click here.",
    "Did it?"
  ]
}