{
  "id": 2286,
  "mediaId": 43,
  "date": "1/28/2022 12:00:00 AM",
  "headline": "Fanatical Republican Extremist of the Day: Loren Culp",
  "image": "https://images.dailykos.com/images/940336/story_image/GettyImages-1229001345.jpeg?1619210978",
  "link": "https://www.dailykos.com/story/2022/1/28/2077295/-Fanatical-Republican-Extremist-of-the-Day-Loren-Culp",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1316,
    1583,
    1935,
    2074,
    2213,
    3097,
    428,
    562,
    2959
  ],
  "sentences": [
    "?The problem with Democracy  you can look at quotes from famous Chinese leaders like Mao, Gorbachev  they loved Democracy because Democracy is a step toward socialism, which is a step towards communism.?\nWe will cross our fingers and hope that Loren Culp does not somehow emerge from the crowded GOP Primary to unseat Dan Newhouse as the nominee, because Washington's 4th Congressional District has a +13 Republican lean, and whomever comes out of it is almost guaranteed a win, regrettably.",
    "Click Here for Full FRED Archive\nOne Year Ago, January 28th, 2021: Cindy Pugh (MN)\n Two Years Ago, January 28th, 2020: Kent Lambert (CO)\n Three Years Ago, January 28th, 2019: Allen Quist (MN)\n Four Years Ago, January 28th, 2018: Rick Snyder (MI) 2018 Update\n Five Years Ago, January 28th, 2017: Rick Snyder (MI) Original Profile\n Six Years Ago, January 28th, 2016: Eric Turner (IN)\n Seven Years Ago, January 28th, 2015: Jack Whitely (MN)",
    "Welcome to what is the 1069th original profile here at Fanatical Republican Extremist of the Day?, where we'll be discussing Loren Culp, a law enforcement officer who was celebrated by Republicans for refusing to do his job and enforce gun laws, who wrote a book about his experiences that compared gun control to the Holocaust and features a lot of alternate history and quotes from the Founding Fathers that they never actually said.",
    "Culp parlayed that into a bid to as the 2020 Republican candidate for Governor of Washington and in 2022, is making a run for U.S. House of Representatives in Washington's 4th Congressional District, looking to challenge three term GOP Congressman for his seat for having the audacity for voting to impeach Donald Trump for staging a failed coup attempt on Jan. 6th, 2021.",
    "But alas, Loren Culp is not limited to just one conspiracy theory, as in the build-up to the gubernatorial lection, in September of 2020, Culp began spreading conspiracy theories that wildfires in his state were actually coordinated arson, and right-wing conspiracy nuts took the ball and ran with it, adding to Culp's theory to say it was being carried out by Antifa?.",
    "He lost the Governor's race in 2020 by over 545,000 votes, and responded by mimicking Donald Trump's false allegations of election irregularities and fraud, featuring Culp also peppering in some anti-Semitism by blaming George Soros, and later, seeing him file a lawsuit against the Washington Secretary of State, Kim Wyman.",
    "Mind you, he tucked his tail, and turned and fled from his own lawsuit when his realized, unlike Trump's Kraken? law team, that filing lawsuits based on flagrant lies can lead to legal sanctions against you as a lawyer.",
    "Culp's take on that betrayal? is framed as so:\nNewhouse voted with the socialists to impeach one of the greatest presidents of my lifetime.?\nSure he was.",
    "Failed Washington GOP gubernatorial candidate Loren Culp, who this year will challenge Republican Congressman Dan Newhouse in WA-4.",
    "Which, of course, there was never any proof of, and Culp never helped authorities by admitting he was talking out of his *ss.",
    "Jay Inslee took measures to stop the spread of Covid-19 that he began comparing the governor to famous communist leaders.",
    "His reason for running for governor in the first place was that he was so afraid when Gov.",
    "But keep in mind, Loren Culp is also consistently out of touch with reality.",
    "But Loren Culp always has deep-seated, irrational fears.",
    "Sure."
  ]
}