{
  "id": 2287,
  "mediaId": 169,
  "date": "1/14/2022 12:00:00 AM",
  "headline": "Florida Republican who lost special election by 59 points refuses to concede, files suit",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/01/florida-election-0114221.jpg",
  "link": "https://www.salon.com/2022/01/14/florida-lost-special-by-59-points-files-and-refuses-to-concede/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    1147,
    1458,
    2327,
    2333,
    3097,
    146,
    428,
    545,
    2582,
    2661,
    2859
  ],
  "sentences": [
    "Sheila Cherfilus-McCormick, a health care executive who supports progressive policies like Medicare for All, the Green New Deal and a $1,000-per-month universal basic income, earlier this week defeated Republican Jason Mariner to succeed the late Rep. Alcee Hastings, a Democrat who served more than 14 terms in Congress before his death last April.",
    "Democrats and their supporters have grown increasingly alarmed over the Republican Party's refusal to accept the will of the voters, as Republican lawmakers continue to cite doubts about \"election integrity\"  doubts they themselves have stoked  as a justification for impose draconian new voting restrictions across the country.",
    "RELATED: GOP keeps the Big Lie alive in New Jersey: Republican candidate refuses to concede race for governor\nCherfilus-McCormick, who faced a failed lawsuit from Democratic primary foe Dave Holness after defeating him by a mere five votes, shrugged off Mariner's refusal to accept his defeat.",
    "\"And we'll also have some stuff coming out that we've recently discovered,\" Mariner said, not specifying what kind of \"stuff\" could affect the outcome of a race he lost by almost 33,000 votes (out of the 54,000 cast).",
    "A Florida Republican took a page out of former Donald Trump's playbook this week, refusing to concede a congressional special election he lost by more than 59 points in one of the state's most Democratic districts.",
    "\"Well, this wouldn't be my first time running against an opponent who is refusing to concede, so it's not our first time, and at the end of the day nothing can stop the motion,\" she told CBS Miami.",
    "\"Now they called the race  I did not win, so they say, but that does not mean that they lost either, it does not mean that we lost,\" Mariner said after the race was called, according to CBS Miami.",
    "Supervisors of the election offices in Broward and Palm Beach told the outlet that it takes 14 days to certify the results after which Mariner has 10 days to challenge them.",
    "Larry Hogan helped her opponent after she lost by more than 40 points in a race to succeed the late Rep. Elijah Cummings in an overwhelmingly Democratic Baltimore district.",
    "But Trump's campaign of election lies has emboldened Republican candidates to follow suit and baselessly stoke doubts about election results even when they get blown out.",
    "Adam Laxalt, a Republican U.S. Senate candidate in Nevada, has threatened to file lawsuits to \"try to tighten up the election\" 14 months before any votes are cast.",
    "Following the 2020 elections, Trump-endorsed Maryland congressional candidate Kim Klacik claimed that her election was \"stolen\" and alleged that Republican Gov.",
    "Culp ultimately dropped the lawsuit last January after state Attorney General Bob Ferguson threatened him with sanctions over the frivolous challenge.",
    "Failed California recall candidate Larry Elder launched a website claiming voter fraud days before the votes were even counted.",
    "Similarly, Loren Culp, the Republican gubernatorial nominee in Washington state, refused to concede defeat to Democratic Gov.",
    "Candidates do not legally have to concede defeat, as evidenced by Trump's refusal to accept his loss for more than a year.",
    "Mariner filed a lawsuit before polls had even closed, alleging problems with ballots in Palm Beach and Broward counties.",
    "Culp filed a baseless lawsuit alleging fraud that was outright rejected by Republican Secretary of State Kim Wyman.",
    "Mariner, however, refused to concede defeat despite losing the race by an overwhelming margin, roughly 79% to 20%.",
    "\"Once truth vanishes,\" Harvard law professor Laurence Tribe warned after Mariner's lawsuit, \"all bets are off.\"",
    "Democrats, however, have been unable to pass new national voting rights legislation, largely because Sens.",
    "Joe Manchin, D-W.Va., and Kyrsten Sinema, D-Ariz., continue to vociferously defend the filibuster.",
    "A growing number of Trump-allied Republicans have been quick to embrace election denialism.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Read more on the ominous prelude to the 2022 midterms:",
    "Jay Inslee despite losing by more than 545,000 votes.",
    "Subscribe to our morning newsletter, Crash Course."
  ]
}