{
  "id": 529,
  "mediaId": 129,
  "date": "2/10/2022 12:00:00 AM",
  "headline": "How the G.O.P.'s Censure Fight Exposes the Party's Deeper Divide",
  "image": "https://static01.nyt.com/images/2022/02/09/us/politics/09pol-repub-image/09pol-repub-image-articleLarge-v3.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/02/10/us/politics/trump-election-lies-republicans.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3094,
    3097
  ],
  "sentences": [
    "Former Representative Barbara Comstock of Virginia, a Trump critic and former Republican National Committee official, likened the committee's relationship with Mr. Trump to a hostage situation? in which the former president would have no hesitation about demanding fealty even if it kills a Republican majority.?\nA Republican National Committee spokeswoman, Danielle Alvarez, said that the party represents grass-roots Americans? and that Republicans are united and are fighting to stop Democrats and Biden to take back the House and Senate in November.?\nThere are some Republicans walking gingerly between the two factions of the party  testing to see how far they can go.",
    "Mr. Frias said he did not think the party should censure a member unless that Republican has engaged in some kind of criminal or unethical conduct.? He also lamented the resolution's unforced error? declaring that Ms. Cheney and Mr. Kinzinger were participating in the persecution of ordinary citizens engaged in legitimate political discourse.?\nRonna McDaniel, the Republican National Committee chairwoman, quickly tried to clarify the phrase, saying that the party did not intend to include the rioters in that description  though such a distinction was not in the adopted text.",
    "The tension flared this week as Republicans were forced to either explain or denounce a party resolution characterizing the deadly events of Jan. 6 as legitimate political discourse.? But the episode was a only a preview of the battles ahead, with a series of upcoming primary contests pitting candidates loyal to Mr. Trump against those who, to varying degrees, resist his distortions about the election.",
    "If those in Washington try to move on, there is going to be even a greater disconnect and greater frustration with their leadership, resulting in more tension and arguments within the party.?\nThat prospect is alarming for some Republicans who worry about the long-term consequences of embedding Mr. Trump's false claims into the foundation of the party.",
    "WASHINGTON  More than a year after the 2020 election, Donald J. Trump's false claims of election fraud remain a destabilizing force for the Republican Party, dividing an activist base galvanized by a lie from elites in Washington who are hoping to hold the party together long enough to win back power in Congress in the upcoming midterm elections.",
    "But Republican voters' appetite for Trump-inspired talk of election audits and voting irregularities will be measured in contests throughout the spring and summer  in primaries for Senate in Alaska and North Carolina, for governor in Georgia and Arizona, as well as in dozens of congressional and state legislative races.",
    "Far more Republicans, however, expressed concern this week about the near-term consequences: With President Biden's approval ratings falling well below half of voters, many Republicans fear that debate will be a distraction ahead of a 2022 midterm election in which they are otherwise well positioned to take back power.",
    "Mr. Frias was among the estimated two dozen of 168 Republican National Committee members who voted last week against the party's resolution to censure Representatives Liz Cheney of Wyoming and Adam Kinzinger of Illinois, the two Republicans working with congressional Democrats to investigate the Jan. 6 riot.",
    "But every moment that is spent re-litigating a lost election or defending those who have been convicted of criminal behavior moves us further away from the goal of victory this fall.?\nMs. Collins, like Mr. McConnell, won re-election in 2020 and will not be on the ballot again until 2026.",
    "It was a violent insurrection.?\nThe Trump era has shown repeatedly how Republican leaders, including Mr. McConnell, will briefly confront the Trump wing of the party, before ultimately realigning themselves with their voters, especially as elections near.",
    "And because of those lies, people really believed it.?\nMs. Cheney is facing a Trump-endorsed primary challenger, making her contest among the most high-profile tests of whether Mr. Trump and his allies can oust Republicans who dispute his claims.",
    "Ms. Cheney, in an interview in Cheyenne, Wyo., the day after her censure, said she saw her rebuke as a symptom of a party that had accepted a lie  that the 2020 election was stolen  as a foundational and organizing truth.",
    "Republican strategists involved in this fall's races have said that the entire episode  from party resolution to recriminations to rebuke  has been a distraction from the goal of winning back congressional majorities.",
    "I've got to rally those individuals on both sides to vote for our local candidates.?\nSome of the strongest condemnations of the censure resolution came from senators who are farthest from needing to face the voters.",
    "But even that limited break from Mr. Trump was rare for a politician who allowed no political daylight between himself and the president, and seemed more about positioning for a potential 2024 run than the midterms.",
    "And the Pew Research Center found in a poll released Tuesday that 57 percent of Republicans believe Mr. Trump bears no responsibility for the Jan. 6 attack on the Capitol  a number 11 points higher than a year ago.",
    "Among those endorsed by Mr. Trump is Loren Culp, a former police chief of a one-officer department in rural Washington State who lost the 2020 governor's race by more than 540,000 votes, yet claimed fraud when Gov.",
    "In Washington, party strategists and senators have mostly been loath to discuss the growing election denialism in the party's ranks, either hoping it would fade with time or not wanting to challenge their voters.",
    "That debate will test the extent to which embracing Mr. Trump's falsehoods about the 2020 election  and attempts to downplay the violence that followed  has become a new litmus test for Republican voters.",
    "Those races, in Alaska, Georgia, North Carolina, Wyoming and elsewhere, promise to amplify calls for election audits, claims of fraud and a recasting of events surrounding the Jan. 6 riot at the Capitol.",
    "And in Wisconsin, Timothy Ramthun, a state assemblyman who has been one of the state's most aggressive promoters of election conspiracies, is expected to announce his campaign for governor on Saturday.",
    "Prosecutors have provided a revealing glimpse of their strategy for the first trial stemming from the attack on the Capitol, unveiling an inventory of the extensive evidence they intend to introduce.",
    "It still is a burning ember of passion for the base,? said Matt Batzel, the national executive director of American Majority, an organization that trains conservative grass-roots activists.",
    "Mike Pence, Mr. Trump's loyalist vice-president, pushed back against Trump in a speech last week, saying Trump is wrong? to have suggested Mr. Pence could have overturned the election.",
    "The Republican Party started this year with a decided advantage on the issues that will determine the outcome of the fall elections,? said Senator Susan Collins, Republican of Maine.",
    "False beliefs about the 2020 election were most intense among those who consume conservative media, according to a Public Religion Research Institute survey conducted in the fall.",
    "Some people are offended by what happened on Jan. 6,? said Jane Brady, the chairwoman of the state Republican Party in Delaware, who voted in favor of the censure resolution.",
    "The midterm election is about one thing and one thing only, a referendum on Joe Biden's abysmal performance,? said Corry Bliss, an adviser to several Republican candidates.",
    "Now, as midterm elections near, Republican leaders close to the activists, volunteers and local leaders who power the party say that this sentiment is impossible to ignore.",
    "Mitch McConnell does not speak for the Republican Party, and does not represent the views of the vast majority of its voters,? Mr. Trump said in a statement on Wednesday.",
    "On Wednesday night, he briefly published a website in which he pledged to conduct an independent full forensic physical cyber audit? of the 2022 election  win or lose.",
    "The poll found that 82 percent of Fox News viewers and 97 percent of those who consume far-right channels such as OAN and Newsmax believe the election was stolen.",
    "On Wednesday, the former president endorsed seven more Republicans running for Congress, including two against incumbents whom he views as insufficiently loyal.",
    "The more we talk about Jan. 6, the less we talk about how Biden hasn't been successful,? said Steven Frias, a Republican committeeman from Rhode Island.",
    "That explanation did not prevent a rare public fight between Republican elected officials in Washington and the leaders of their party apparatus.",
    "He is running against Representative Dan Newhouse, one of the 10 House Republicans who voted to impeach Mr. Trump for inciting the Jan. 6 attack.",
    "People across the country and people here in Wyoming were fundamentally lied to and continue to be lied to by Donald Trump,? Ms. Cheney said.",
    "In a July interview, Mr. Culp claimed it would be easier to identify and stop fraud in a congressional race than it was statewide.",
    "More than 70 percent of Republicans believe the 2020 election was illegitimate, according to a Washington Post poll last month.",
    "Senator Mitch McConnell of Kentucky, the minority leader, and other Republicans at the Capitol publicly denounced the censure.",
    "Those who do not  such as former Senators Jeff Flake of Arizona and Bob Corker of Tennessee  typically exit elected politics.",
    "Some people are very supportive of what happened on Jan. 6 and angry at the government's response.",
    "They were told, basically on Jan. 6, the election could go the other way.",
    "Key Developments in the Jan. 6 Investigation\nCard 1 of 3\nThe first trial.",
    "Mr. Pence did not confront Mr. Trump's other election falsehoods.",
    "We saw it happen,? Mr. McConnell said of the Jan. 6 riot.",
    "Jay Inslee, a Democrat, was declared the winner.",
    "We could overturn what happened.",
    "Nothing else matters.?"
  ]
}