[
  {
    "id": 6567,
    "mediaId": 2629,
    "date": "2022-01-27",
    "sentence": "Former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, who is seeking the GOP nomination for the Senate seat being vacated by retiring Ohio Republican Sen.",
    "author": "Josh Israel",
    "title": "GOP Already Attacking Unnamed SCOTUS Nominee With Racist Dog Whistles"
  },
  {
    "id": 6718,
    "mediaId": 4040,
    "date": "2022-01-31",
    "sentence": "John Fea @ Current: Ohio Senate candidate <span class='selected-term'>Josh Mandel</span> does not believe in the separation of church and state.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: That’s Not Voltaire You’re Quoting"
  },
  {
    "id": 6909,
    "mediaId": 2594,
    "date": "2022-02-01",
    "sentence": "Notable examples include Harriet Hageman, a Republican running to oust Rep Liz Cheney in Wyoming, as well as several candidates including <span class='selected-term'>Josh Mandel</span> in the Ohio Senate race.",
    "author": "John Bowden",
    "title": "Trump says war chest has more than $122m cash on hand after huge 2021 haul"
  },
  {
    "id": 6101,
    "mediaId": 2630,
    "date": "2022-02-04",
    "sentence": "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\n<span class='selected-term'>Josh Mandel</span>, Ohio state treasurer, at a campaign stop for Sen. Marco Rubio, then a Republican presidential candidate, in Cleveland in 2015.Aaron Josefczyk / Reuters file\n‘He seemed like a totally normal, regular Republican’\nAmbition drove Mandel more than ideology early in his career, and establishment Republicans who saw in him a young and polite Jewish veteran who clicked with swing voters were eager to accommodate his quick rise.",
    "author": "",
    "title": "Josh Mandel foreshadowed Trump’s rise. His Ohio Senate bid is a test of what’s next."
  },
  {
    "id": 6202,
    "mediaId": 2738,
    "date": "2022-02-05",
    "sentence": "Sources tell The Daily Beast that Trump, a lover of gossip, has “privately regurgitated, often in disgust, a wide range of unverified, often completely unvetted, and lurid rumors about the MAGA candidate.” One source told the publication that Trump “has used the term ‘f*cking weird’ to describe <span class='selected-term'>Josh Mandel</span> more than once,” and that he “has talked about [Mandel] and sex in the same sentence more times than I would have liked to hear.” (Reminder, by the way, that Trump has also been credibly accused of sexual misconduct by over two dozen women.)",
    "author": "Matt Prigge",
    "title": "A MAGA-fied Candidate Is Having Trouble Getting Trump’s Endorsement Due To Rumors Of His ‘F*cking Weird’ Sex Life"
  },
  {
    "id": 5932,
    "mediaId": 2664,
    "date": "2022-02-05",
    "sentence": "According to one source close to Trump, \"The [former] president has used the term ‘f*cking weird’ to describe <span class='selected-term'>Josh Mandel</span> more than once, when I have spoken to him about [Mandel].",
    "author": "Tom Boggioni",
    "title": "Trump holding up Senate endorsement as he obsesses over sex rumors about 'weirdo' candidate: report"
  },
  {
    "id": 6064,
    "mediaId": 2687,
    "date": "2022-02-05",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Why Trump Hasn’t Endorsed Josh Mandel"
  },
  {
    "id": 5515,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "\"Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival <span class='selected-term'>Josh Mandel</span>, which have portrayed Vance as an anti-Trump figure,\" writes Politico.",
    "author": "Brad Reed",
    "title": "JD Vance's campaign is going down in flames -- and his pollster warns he needs a 'course correction ASAP'"
  },
  {
    "id": 4795,
    "mediaId": 2664,
    "date": "2022-02-15",
    "sentence": "The <span class='selected-term'>Josh Mandel</span> of 2003 — of 2016, even — would not recognize the Josh Mandel of 2021,\" Zimmerman added before admitting, \"This has broken my heart.”\nRepublican donor Brad Kastan believes the aspiring senator has made a big mistake expressing a belief that Mandel is “painting himself into a corner so far out that he can’t win” come November if he gets through the primary.",
    "author": "Tom Boggioni",
    "title": "'This has broken my heart': Josh Mandel called out by former supporters for trying to become the new Trump"
  },
  {
    "id": 5094,
    "mediaId": 2699,
    "date": "2022-02-15",
    "sentence": "Along with Walker, they include Ohio Senate hopeful <span class='selected-term'>Josh Mandel</span>, Trump White House doctor turned Texas congressional candidate Ronny Jackson, Peter Thiel-backed Arizona Senate candidate Blake Masters, Alabama gubernatorial challenger and Trump’s former ambassador to Slovenia Lynda Blanchard, and Kelly Tshibaka, who is taking on Trump target Sen. Lisa Murkowski in the Alaska Republican primary.",
    "author": "Roger Sollenberger",
    "title": "Republicans Are Still Trying to Buy Trump’s Love"
  },
  {
    "id": 4675,
    "mediaId": 2699,
    "date": "2022-02-16",
    "sentence": "?I hope that there will not be some sort of global economic incident of note triggered by cryptocurrency,” says Roth, in a sentence that will surely seem prophetic in six months’ time), and how Ohio Senate primary candidate <span class='selected-term'>Josh Mandel</span>—the one whose alleged sex life Trump likes to gossip about—“looks like he just hatched out of something.”\nAnd finally, the hosts unpack how QAnon-loving Congresswoman Marjorie Taylor Greene has become a prime kingmaker in GOP political endorsements, and update us on what’s going on with MAGA election clerk Tina Peters, who tried to hide her iPad from the authorities, with violent results.",
    "author": "The Daily Beast",
    "title": "The Right-Wing Movements Inspired by Canadian Truckers Are Only ‘Picking Up Steam’"
  },
  {
    "id": 5365,
    "mediaId": 4040,
    "date": "2022-02-16",
    "sentence": "Jennifer Medina and Lisa Lerer @ The New York Times: How <span class='selected-term'>Josh Mandel</span>, Son of Suburban Ohio, Became a Right-Wing Warrior.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: Rise of a Right-Wing Warrior"
  },
  {
    "id": 5049,
    "mediaId": 2745,
    "date": "2022-02-18",
    "sentence": "Vance is trailing <span class='selected-term'>Josh Mandel</span>, who knows how to be emollient to Trump.",
    "author": "",
    "title": "Opinion: Behold the Republican somersaults for Trump"
  },
  {
    "id": 4862,
    "mediaId": 2564,
    "date": "2022-02-18",
    "sentence": "Vance is trailing <span class='selected-term'>Josh Mandel</span>, who knows how to be emollient to Trump.",
    "author": "",
    "title": "Opinion: Behold the Republican somersaults for Trump"
  },
  {
    "id": 4602,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "Hamas spokesman to deliver response to state of the union.https://twitter.com/hollyotterbein/status/1496455601416814598\\u00a0\\u2026\n— <span class='selected-term'>Josh Mandel</span> (@Josh Mandel) 1645658514\nTwitter was jolted into condemning Mandel's unprovoked post for being baselessly and unabashedly racist.",
    "author": "Brandon Gage",
    "title": "Josh Mandel tweets racist trope about Rashida Tlaib"
  },
  {
    "id": 4039,
    "mediaId": 2631,
    "date": "2022-02-26",
    "sentence": "At CPAC on Friday, <span class='selected-term'>Josh Mandel</span>, a contender in the wide-open Senate primary in Ohio, said \"I believe this election was stolen from Donald J. Trump,\" to loud cheers.",
    "author": "",
    "title": "There are signs Republicans want to move on from 2020. Trump may not allow it."
  },
  {
    "id": 4070,
    "mediaId": 2664,
    "date": "2022-02-26",
    "sentence": "The report notes that Freeman's belief of election fraud was amplified in a speech by <span class='selected-term'>Josh Mandel</span>, who is seeking Ohio's GOP U.S. Senate nomination, and told the crowd, \"We have Democrats who think it’s OK to cheat in elections, and I would submit to you that one of the most important fights of our day is to stop the cheating from the left...",
    "author": "Tom Boggioni",
    "title": "Trump supporters complain the Capitol riot gets 'bad press' at CPAC's 'parallel universe'"
  },
  {
    "id": 4100,
    "mediaId": 2699,
    "date": "2022-02-27",
    "sentence": "Also in this episode, Andy Levy makes his Sunday episode debut, just in time to listen to clips of <span class='selected-term'>Josh Mandel</span> sounding stupid and to unpack Texas Gov.",
    "author": "The Daily Beast",
    "title": "Ex-Prosecutor Says She Can Prove Trump Committed Two Crimes"
  },
  {
    "id": 4513,
    "mediaId": 2724,
    "date": "2022-02-28",
    "sentence": "— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) February 28, 2022\nTrump later froze $400 million in congressionally approved security assistance to Ukraine after a phone conversation with Ukrainian President Volodymyr Zelensky.",
    "author": "Rusty Weiss",
    "title": "Democrat Swalwell Claims If Trump Were President He’d Be ‘Sending Weapons To Russia’"
  },
  {
    "id": 4194,
    "mediaId": 2660,
    "date": "2022-03-03",
    "sentence": "In Ohio, a super PAC supporting Republican <span class='selected-term'>Josh Mandel</span> claimed in a TV ad that former state GOP chair Jane Timken’s family business moved jobs to China.",
    "author": "Tom Kertscher",
    "title": "2022 candidates use ads vowing to be tough on China, or attacking rivals as too soft on China"
  },
  {
    "id": 1985,
    "mediaId": 2658,
    "date": "2022-03-22",
    "sentence": "Mike Gibbons, the Ohio Senate hopeful who nearly came to blows with <span class='selected-term'>Josh Mandel</span>, urged voters to “choose your fighter” in the race.",
    "author": "",
    "title": "POLITICO Playbook: Friction between Harris and Biden camps revealed in new book"
  },
  {
    "id": 2185,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "Watch the original exchange below:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other\\u2019s faces at tonight\\u2019s GOP #OHSen forum hosted by FreedomWorks.\\n\\n\\u201cYou watch what happens,\\u201d Mandel says.pic.twitter.com/fQuqfHxXHT\n— Heartland Signal (@Heartland Signal) 1647644328",
    "author": "Matthew Chapman",
    "title": "Even Trump is 'baffled' as Ohio GOP candidates threaten each other over who deserves his endorsement: report"
  },
  {
    "id": 2336,
    "mediaId": 2660,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Amy Sherman",
    "title": "Georgia’s David Perdue said elections were stolen from him and Trump. Pants on Fire!"
  },
  {
    "id": 1380,
    "mediaId": 2540,
    "date": "2022-04-01",
    "sentence": "Washington (CNN)A new television ad from Ohio Republican Senate candidate <span class='selected-term'>Josh Mandel</span> is centered on a false claim that Republican primary rival Mike Gibbons, a businessman, said that military service isn't \"real work.\"",
    "author": "Daniel Dale",
    "title": "Fact check: Ad from Ohio Republican Josh Mandel falsely claims party rival Mike Gibbons said military service isn't real work"
  },
  {
    "id": 1570,
    "mediaId": 2627,
    "date": "2022-04-08",
    "sentence": "“There's nothing racist about stopping critical race theory and loving America.”\nThen a voiceover comes in: “<span class='selected-term'>Josh Mandel</span> — pro-God, pro-gun, pro-Trump.”\nIt dishonors the memories of Lewis and King to promote an agenda that will bring nothing but more harm to Black people at a site where they struggled for Black people’s advancement.",
    "author": "",
    "title": "Conservatives' appropriation of MLK just reached a shocking new low"
  },
  {
    "id": 475,
    "mediaId": 2512,
    "date": "2022-04-11",
    "sentence": "Although he has yet to endorse far-right candidates JD Vance or <span class='selected-term'>Josh Mandel</span>, who are duking it out for the Republican nomination for Senate in Ohio, Trump's vibe is very much alive.",
    "author": "Brandon Gage",
    "title": "Donald Trump's 'troublemaking' could end up benefitting Democrats: columnist"
  },
  {
    "id": 726,
    "mediaId": 2695,
    "date": "2022-04-13",
    "sentence": "Ohio: <span class='selected-term'>Josh Mandel</span> (R) and Mike Gibbons (R) are neck and neck in a packed Republican environment.",
    "author": "BlazeTV Staff",
    "title": "NPR predicts these 10 Senate seats might see a party FLIP"
  },
  {
    "id": 665,
    "mediaId": 6503,
    "date": "2022-04-14",
    "sentence": "Ohio: <span class='selected-term'>Josh Mandel</span> (R) and Mike Gibbons (R) are neck and neck in a packed Republican environment.",
    "author": "Warner Todd Huston",
    "title": "Even Left-Wing NPR is Predicting Ten Senate Seats Could go Red"
  },
  {
    "id": 389,
    "mediaId": 2596,
    "date": "2022-04-17",
    "sentence": "Former state treasurer <span class='selected-term'>Josh Mandel</span> had embraced Trump’s base during the battle, but apparently it wasn’t enough to swing Trump’s endorsement.",
    "author": "",
    "title": "Trump 'refused to endorse' Republican after this 'embarrassing' on-stage showdown"
  },
  {
    "id": 638,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "Around the same time, <span class='selected-term'>Josh Mandel</span>, the forty-four-year-old former Ohio state treasurer, who overtook Gibbons in one recent poll, released an ad that begins with an Ohio woman saying critical race theory is “crap.” It then cuts to Mandel on the Edmund Pettus Bridge, in Selma, saying, “Martin Luther King, Jr., marched right here so skin color wouldn’t matter.”\nx\nNEW: Christian Dominionists who envision a theocratic takeover of the U.S. government have long sought to remake the nation in their image.",
    "author": "",
    "title": "Abbreviated Pundit Roundup: The illuminated war in Ukraine is taking place in plain sight"
  },
  {
    "id": 494,
    "mediaId": 2664,
    "date": "2022-04-21",
    "sentence": "Donald Trump Jr. on Thursday upped his family's war with the right-wing Club for Growth, which reportedly angered former President Donald Trump by sticking with its endorsement of <span class='selected-term'>Josh Mandel</span> in the Ohio Senate race.",
    "author": "Brad Reed",
    "title": "Donald Trump Jr. shreds right-wing Club for Growth for standing by 'establishment candidate' Josh Mandel"
  },
  {
    "id": 715,
    "mediaId": 2671,
    "date": "2022-04-21",
    "sentence": "According to Maggie Haberman Trump expected that David McIntosh, president of Club for Growth, to drop their support for <span class='selected-term'>Josh Mandel</span> after his Vance endorsement.",
    "author": "The Right Scoop",
    "title": "REPORT: Trump unhappy with Club for Growth after Vance endorsement"
  }
]