[
  {
    "id": 5094,
    "mediaId": 2699,
    "date": "2022-02-15",
    "sentence": "Along with Walker, they include Ohio Senate hopeful <span class='selected-term'>Josh Mandel</span>, Trump White House doctor turned Texas congressional candidate Ronny Jackson, Peter Thiel-backed Arizona Senate candidate Blake Masters, Alabama gubernatorial challenger and Trump’s former ambassador to Slovenia Lynda Blanchard, and Kelly Tshibaka, who is taking on Trump target Sen. Lisa Murkowski in the Alaska Republican primary.",
    "author": "Roger Sollenberger",
    "title": "Republicans Are Still Trying to Buy Trump’s Love"
  },
  {
    "id": 1558,
    "mediaId": 2752,
    "date": "2022-04-07",
    "sentence": "PREVIOUSLY: All Fun And Games Until Ohio GOP Senate Candidate Starts Calling Opponent A 'Pussy'\nLast month, Republicans <span class='selected-term'>Josh Mandel</span> and Mike Gibbons almost came to blows at Ohio's Senate GOP primary debate.",
    "author": "Stephen Robinson",
    "title": "Maybe We Are Better Off Without Political Debates"
  },
  {
    "id": 475,
    "mediaId": 2512,
    "date": "2022-04-11",
    "sentence": "Although he has yet to endorse far-right candidates JD Vance or <span class='selected-term'>Josh Mandel</span>, who are duking it out for the Republican nomination for Senate in Ohio, Trump's vibe is very much alive.",
    "author": "Brandon Gage",
    "title": "Donald Trump's 'troublemaking' could end up benefitting Democrats: columnist"
  },
  {
    "id": 726,
    "mediaId": 2695,
    "date": "2022-04-13",
    "sentence": "Ohio: <span class='selected-term'>Josh Mandel</span> (R) and Mike Gibbons (R) are neck and neck in a packed Republican environment.",
    "author": "BlazeTV Staff",
    "title": "NPR predicts these 10 Senate seats might see a party FLIP"
  },
  {
    "id": 665,
    "mediaId": 6503,
    "date": "2022-04-14",
    "sentence": "Ohio: <span class='selected-term'>Josh Mandel</span> (R) and Mike Gibbons (R) are neck and neck in a packed Republican environment.",
    "author": "Warner Todd Huston",
    "title": "Even Left-Wing NPR is Predicting Ten Senate Seats Could go Red"
  }
]