[
  {
    "id": 1967,
    "mediaId": 2564,
    "date": "2022-03-19",
    "sentence": "Scroll down for video\n+6\nView gallery\nSenate hopefuls Mike Gibbons, 69, (left, standing) and <span class='selected-term'>Josh Mandel</span>, 44, (right) came toe-to-toe at the primary debate after Mandel attacked the father-of-five's financial assets in China, claiming he 'made millions' there\n+6\nView gallery\nMandel appeared irritated toward Gibbons - who's wealth ranges anywhere from $83milllion to $286million - said he didn't 'think I made millions off of anything'\nGibbons went on to say that former Marine 'didn't know squat' because he's never worked in private sector, to which Mandel replied that he had served two tours in Iraq and told the businessman: 'Don't tell me I haven't worked.'",
    "author": "",
    "title": "Should've been boring but... Republican Ohio Senate hopefuls and millionaires Mike Gibbons and Josh Mandel nearly come to blows during primary debate about Chinese petroleum"
  },
  {
    "id": 2563,
    "mediaId": 2640,
    "date": "2022-03-21",
    "sentence": "The debate became intense almost as soon as it began as former state treasurer <span class='selected-term'>Josh Mandel</span> attacked investment banker Mike Gibbons' business dealings in his opening remarks.",
    "author": "",
    "title": "Vets Demand Apology After Tense Clash in GOP Debate"
  },
  {
    "id": 1512,
    "mediaId": 5247,
    "date": "2022-04-06",
    "sentence": "In his most recent video spot, <span class='selected-term'>Josh Mandel</span> is seen walking across the Edmund Pettus Bridge in Selma, Alabama, where Rev.",
    "author": "Sarah Sicard",
    "title": "Marine veteran’s campaign ad for US Senate features a bad photoshop job"
  },
  {
    "id": 1483,
    "mediaId": 4044,
    "date": "2022-04-06",
    "sentence": "While there appears to be a significant color difference between Mandel’s face and his hands in the version that appeared in the campaign ad, this color difference is far less noticeable in the original photograph (at right in the tweet below):\nYou folks asked if <span class='selected-term'>Josh Mandel</span>’s campaign photoshopped his head onto a Black man, and I looked for answers.",
    "author": "Dan Evon",
    "title": "Did Mandel ‘Forget To Photoshop His Hands’ in Campaign Ad?"
  },
  {
    "id": 1505,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "Fact-checkers have pushed back on the accusation that Ohio Senate candidate <span class='selected-term'>Josh Mandel</span> photoshopped himself into an image included in one of his ads.",
    "author": "Gustaf Kilander",
    "title": "Photo filter blamed as Ohio Senate candidate accused of photoshop in ad"
  }
]