[
  {
    "id": 6404,
    "mediaId": 2594,
    "date": "2022-01-26",
    "sentence": "Mr Vance's pivot from folksy intellectual to belligerent “patriot” is likely a tactic employed to take on his primary rival, former Ohio State Treasurer <span class='selected-term'>Josh Mandel</span>.",
    "author": "Graig Graziosi",
    "title": "JD Vance mocked for celebrating Marjorie Taylor Greene endorsement as he vows to take US back from ‘scumbags’"
  },
  {
    "id": 6235,
    "mediaId": 4040,
    "date": "2022-02-03",
    "sentence": "Liz Skalka @ HuffPost: <span class='selected-term'>Josh Mandel</span> May Be Trolling The GOP.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: President Taylor Greene"
  },
  {
    "id": 4675,
    "mediaId": 2699,
    "date": "2022-02-16",
    "sentence": "?I hope that there will not be some sort of global economic incident of note triggered by cryptocurrency,” says Roth, in a sentence that will surely seem prophetic in six months’ time), and how Ohio Senate primary candidate <span class='selected-term'>Josh Mandel</span>—the one whose alleged sex life Trump likes to gossip about—“looks like he just hatched out of something.”\nAnd finally, the hosts unpack how QAnon-loving Congresswoman Marjorie Taylor Greene has become a prime kingmaker in GOP political endorsements, and update us on what’s going on with MAGA election clerk Tina Peters, who tried to hide her iPad from the authorities, with violent results.",
    "author": "The Daily Beast",
    "title": "The Right-Wing Movements Inspired by Canadian Truckers Are Only ‘Picking Up Steam’"
  },
  {
    "id": 1001,
    "mediaId": 2745,
    "date": "2022-03-31",
    "sentence": "It's almost like they're looking for their partisan cue.”\nUSA Freedom Fund, “Real Work.” It's been more than a week since Ohio GOP U.S. Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons got into a near-physical argument at a forum, after Gibbons correctly said that Mandel had never worked in the private sector.",
    "author": "",
    "title": "The Trailer: Could Madison Cawthorn lose? Primary challengers come for the party-crashers."
  }
]