[
  {
    "id": 6499,
    "mediaId": 2594,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican <span class='selected-term'>Josh Mandel</span> and Democrat Morgan Harper, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "Via AP news wire",
    "title": "Ryan, not onstage, takes central focus at Ohio Senate event"
  },
  {
    "id": 7009,
    "mediaId": 2728,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican <span class='selected-term'>Josh Mandel</span> and Democrat Morgan Harper, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "Julie Carr Smyth",
    "title": "Tim Ryan, not onstage, is early focus of Ohio Senate event"
  },
  {
    "id": 6925,
    "mediaId": 2679,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican <span class='selected-term'>Josh Mandel</span> and Democrat Morgan Harper, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "JULIE CARR SMYTH",
    "title": "Tim Ryan, not onstage, is early focus of Ohio Senate event"
  },
  {
    "id": 6101,
    "mediaId": 2630,
    "date": "2022-02-04",
    "sentence": "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\n<span class='selected-term'>Josh Mandel</span>, Ohio state treasurer, at a campaign stop for Sen. Marco Rubio, then a Republican presidential candidate, in Cleveland in 2015.Aaron Josefczyk / Reuters file\n‘He seemed like a totally normal, regular Republican’\nAmbition drove Mandel more than ideology early in his career, and establishment Republicans who saw in him a young and polite Jewish veteran who clicked with swing voters were eager to accommodate his quick rise.",
    "author": "",
    "title": "Josh Mandel foreshadowed Trump’s rise. His Ohio Senate bid is a test of what’s next."
  },
  {
    "id": 6202,
    "mediaId": 2738,
    "date": "2022-02-05",
    "sentence": "Sources tell The Daily Beast that Trump, a lover of gossip, has “privately regurgitated, often in disgust, a wide range of unverified, often completely unvetted, and lurid rumors about the MAGA candidate.” One source told the publication that Trump “has used the term ‘f*cking weird’ to describe <span class='selected-term'>Josh Mandel</span> more than once,” and that he “has talked about [Mandel] and sex in the same sentence more times than I would have liked to hear.” (Reminder, by the way, that Trump has also been credibly accused of sexual misconduct by over two dozen women.)",
    "author": "Matt Prigge",
    "title": "A MAGA-fied Candidate Is Having Trouble Getting Trump’s Endorsement Due To Rumors Of His ‘F*cking Weird’ Sex Life"
  },
  {
    "id": 4636,
    "mediaId": 2572,
    "date": "2022-02-23",
    "sentence": "An Ohio Senate debate went off the rails as the crowd interrupted the Republican candidate, <span class='selected-term'>Josh Mandel</span>, on race-based claims calling on him to leave the Black church where the event was being hosted.",
    "author": "",
    "title": "Ohio Senate candidate hits back at 'radical leftists,' BLM members who shouted him down during debate"
  },
  {
    "id": 3262,
    "mediaId": 2659,
    "date": "2022-03-18",
    "sentence": "He trails Mike Gibbons by 11 points and <span class='selected-term'>Josh Mandel</span> by 9 points.",
    "author": "Jason Easley",
    "title": "JD Vance Sided With Putin And Now He May Lose The Ohio Senate GOP Primary"
  },
  {
    "id": 2406,
    "mediaId": 5153,
    "date": "2022-03-19",
    "sentence": "Career politician <span class='selected-term'>Josh Mandel</span> called investment banker Mike Gibbons a “p---y” under his breath at the end of the heated exchange.",
    "author": "Joseph Wilkinson",
    "title": "Republican Ohio Senate candidate calls opponent ‘p---y’ in near-altercation at debate"
  },
  {
    "id": 1967,
    "mediaId": 2564,
    "date": "2022-03-19",
    "sentence": "Scroll down for video\n+6\nView gallery\nSenate hopefuls Mike Gibbons, 69, (left, standing) and <span class='selected-term'>Josh Mandel</span>, 44, (right) came toe-to-toe at the primary debate after Mandel attacked the father-of-five's financial assets in China, claiming he 'made millions' there\n+6\nView gallery\nMandel appeared irritated toward Gibbons - who's wealth ranges anywhere from $83milllion to $286million - said he didn't 'think I made millions off of anything'\nGibbons went on to say that former Marine 'didn't know squat' because he's never worked in private sector, to which Mandel replied that he had served two tours in Iraq and told the businessman: 'Don't tell me I haven't worked.'",
    "author": "",
    "title": "Should've been boring but... Republican Ohio Senate hopefuls and millionaires Mike Gibbons and Josh Mandel nearly come to blows during primary debate about Chinese petroleum"
  },
  {
    "id": 2185,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "Watch the original exchange below:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other\\u2019s faces at tonight\\u2019s GOP #OHSen forum hosted by FreedomWorks.\\n\\n\\u201cYou watch what happens,\\u201d Mandel says.pic.twitter.com/fQuqfHxXHT\n— Heartland Signal (@Heartland Signal) 1647644328",
    "author": "Matthew Chapman",
    "title": "Even Trump is 'baffled' as Ohio GOP candidates threaten each other over who deserves his endorsement: report"
  },
  {
    "id": 1505,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "Fact-checkers have pushed back on the accusation that Ohio Senate candidate <span class='selected-term'>Josh Mandel</span> photoshopped himself into an image included in one of his ads.",
    "author": "Gustaf Kilander",
    "title": "Photo filter blamed as Ohio Senate candidate accused of photoshop in ad"
  }
]