[
  {
    "id": 6412,
    "mediaId": 2636,
    "date": "2022-01-12",
    "sentence": "I had some fun yesterday with a tweet by <span class='selected-term'>Josh Mandel</span>, the would-be MAGA senator from Ohio, who has declared his allegiance to fundamental American values: God, family and Bitcoin.",
    "author": "",
    "title": "Site Information Navigation"
  },
  {
    "id": 6909,
    "mediaId": 2594,
    "date": "2022-02-01",
    "sentence": "Notable examples include Harriet Hageman, a Republican running to oust Rep Liz Cheney in Wyoming, as well as several candidates including <span class='selected-term'>Josh Mandel</span> in the Ohio Senate race.",
    "author": "John Bowden",
    "title": "Trump says war chest has more than $122m cash on hand after huge 2021 haul"
  },
  {
    "id": 6354,
    "mediaId": 2658,
    "date": "2022-02-01",
    "sentence": "In 2018, Ohio’s then-treasurer, Republican <span class='selected-term'>Josh Mandel</span>, unveiled a program to let businesses pay some taxes in Bitcoin, the most popular cryptocurrency.",
    "author": "",
    "title": "A crypto breakthrough? Western states consider taking digital currency"
  },
  {
    "id": 5571,
    "mediaId": 2664,
    "date": "2022-02-08",
    "sentence": "As Alex Eisenstadt writes for Politico about a freak-out internal memo from within the campaign of JD Vance, the wealthy investor challenging perennial GOP candidate <span class='selected-term'>Josh Mandel</span>:\n“Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival Josh Mandel, which have portrayed Vance as an anti-Trump figure.” (In reality, Vance has embraced Trump like a teenager mooning over a rock star.)",
    "author": "Thom Hartmann",
    "title": "Has America reached the 'tipping point' where most are sickened by the GOP?"
  },
  {
    "id": 4954,
    "mediaId": 2526,
    "date": "2022-02-21",
    "sentence": "pic.twitter.com/6zG0ubtqf1\n— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) February 21, 2022\nIn his post, Mandel included an image of a screenshot of the notice he received from Facebook, which read, “You can’t post or comment for 24 hours,” because, “you previously posted something that didn’t follow our Community Standards.”\n“This post goes against our standards on hate speech, so only you can see it,” the message from Facebook added.",
    "author": "Alana Mastrangelo",
    "title": "Facebook Drops ‘Hate Speech’ Suspension for OH GOP Candidate Josh Mandel"
  },
  {
    "id": 4912,
    "mediaId": 2643,
    "date": "2022-02-22",
    "sentence": "A Monday debate between U.S. Ohio Senate candidates <span class='selected-term'>Josh Mandel</span> and Morgan Harper became chaotic following interruptions from a woman in the audience.",
    "author": "Gerrard Kaonga",
    "title": "Josh Mandel Debate Descends into Chaos as Candidate Argues with Audience Member"
  },
  {
    "id": 4841,
    "mediaId": 2578,
    "date": "2022-02-22",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\n<span class='selected-term'>Josh Mandel</span>: You mean ‘put him out’ like kill him?",
    "author": "Jim Hoft",
    "title": "MANDEL BRINGS THE FIRE: GOP Candidate Josh Mandel SHREDS Vicious Audience Member During Senate Debate in Black Community – Then Destroys Dem Opponent (VIDEO)"
  },
  {
    "id": 3097,
    "mediaId": 2526,
    "date": "2022-03-07",
    "sentence": "pic.twitter.com/a335TivWh6\n— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) March 7, 2022\nHe urged political observers to read about Wisconsin’s investigation of Facebook CEO Mark Zuckerberg’s funding of election operations in 2020, ostensibly “to ensure voters could cast their ballots safely and securely.”\nWisconsin state Special Counsel Michael Gableman said $8.8 million worth of funding from Zuckerberg is considered election bribery in the Badger State.",
    "author": "Robert Kraychik",
    "title": "Exclusive— Josh Mandel: ‘Big Tech Oligarchs’ Like Mark Zuckerberg Must Be Criminally Investigated"
  },
  {
    "id": 2600,
    "mediaId": 2752,
    "date": "2022-03-21",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\nThis is all true, but we also imagine Cotten will twist herself into knots justifying Gibbons’s inevitable endorsement of Mandel if he wins the nomination.",
    "author": "Stephen Robinson",
    "title": "All Fun And Games Until Ohio GOP Senate Candidate Starts Calling Opponent A 'Pussy'"
  },
  {
    "id": 1328,
    "mediaId": 2524,
    "date": "2022-04-05",
    "sentence": "GOP Senate candidate <span class='selected-term'>Josh Mandel</span> is \"fighting to protect the Judeo-Christian bedrock of America\" one pixel at a time.",
    "author": "Mark Frauenfelder",
    "title": "\"Pro-God, Pro-Gun, Pro-Trump\" candidate seems to be Pro-Photoshop, too"
  },
  {
    "id": 1758,
    "mediaId": 2752,
    "date": "2022-04-05",
    "sentence": "Republican Senate candidate <span class='selected-term'>Josh Mandel</span> of Ohio just received Ted Cruz’s endorsement, which is highly coveted by at least a couple people who aren’t Ted Cruz.",
    "author": "Stephen Robinson",
    "title": "Ted Cruz Endorses GOP Senate Candidate Josh Mandel, Who’s Almost As Terrible As He Is"
  },
  {
    "id": 1751,
    "mediaId": 2728,
    "date": "2022-04-06",
    "sentence": "As early primary voting began in the Midwestern battleground state of Ohio on Tuesday, social media users questioned the authenticity of a photo used in a campaign ad by U.S. Senate candidate <span class='selected-term'>Josh Mandel</span>.",
    "author": "Sophia Tulp",
    "title": "FACT FOCUS: Josh Mandel Senate campaign ad scrutinized"
  },
  {
    "id": 1510,
    "mediaId": 2549,
    "date": "2022-04-06",
    "sentence": "Far-right candidate <span class='selected-term'>Josh Mandel</span> is running for the United States Senate in Ohio.",
    "author": "Claire Goforth",
    "title": "‘I encourage you to study my father’: MLK’s daughter blasts far-right Republican who invoked her father in pro-gun, anti-critical race theory campaign ad"
  },
  {
    "id": 1337,
    "mediaId": 2680,
    "date": "2022-04-06",
    "sentence": "As early primary voting began in the Midwestern battleground state of Ohio on Tuesday, social media users questioned the authenticity of a photo used in a campaign ad by U.S. Senate candidate <span class='selected-term'>Josh Mandel</span>.",
    "author": "SOPHIA TULP",
    "title": "FACT FOCUS: Josh Mandel Senate campaign ad scrutinized"
  },
  {
    "id": 1090,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "As early primary voting began in the Midwestern battleground state of Ohio on Tuesday, social media users questioned the authenticity of a photo used in a campaign ad by U.S. Senate candidate <span class='selected-term'>Josh Mandel</span>.",
    "author": "SOPHIA TULP - Associated Press",
    "title": "FACT FOCUS: Josh Mandel Senate campaign ad scrutinized"
  },
  {
    "id": 1131,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "As early primary voting began in the Midwestern battleground state of Ohio on Tuesday, social media users questioned the authenticity of a photo used in a campaign ad by U.S. Senate candidate <span class='selected-term'>Josh Mandel</span>.",
    "author": "Via AP news wire",
    "title": "FACT FOCUS: Josh Mandel Senate campaign ad scrutinized"
  },
  {
    "id": 1570,
    "mediaId": 2627,
    "date": "2022-04-08",
    "sentence": "“There's nothing racist about stopping critical race theory and loving America.”\nThen a voiceover comes in: “<span class='selected-term'>Josh Mandel</span> — pro-God, pro-gun, pro-Trump.”\nIt dishonors the memories of Lewis and King to promote an agenda that will bring nothing but more harm to Black people at a site where they struggled for Black people’s advancement.",
    "author": "",
    "title": "Conservatives' appropriation of MLK just reached a shocking new low"
  }
]