[
  {
    "id": 1026,
    "mediaId": 19,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "Conservative media personality <span class='selected-term'>Tudor Dixon</span> came in fourth with about 14 percent of respondents recognizing her name.",
    "author": "Ashley Oliver",
    "title": "Poll: Republicans Face Uphill Battle to Unseat Michigan Democrat Gov. Gretchen Whitmer",
    "sentiment": "0.0"
  },
  {
    "id": 65,
    "mediaId": 43,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Two other Republicans, chiropractor Garrett Soldano and conservative radio host <span class='selected-term'>Tudor Dixon</span>, took in $250,000 and $150,000, respectively, while Soldano led Dixon in cash-on-hand $315,000 to $96,000.",
    "author": "",
    "title": "Morning Digest: Democrat announces rematch against House Republican under fire for impeachment vote",
    "sentiment": "0.0"
  },
  {
    "id": 901,
    "mediaId": 157,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Mike Brown; businesswomen Donna Brandeburg and <span class='selected-term'>Tudor Dixon</span>; businessman Perry Johnson; real estate agent Ryan Kelley; financial advisor Michael Markey; pastor Ralph Rebandt, businessman Kevin Rinke; and chiropractor Garrett Soldano.",
    "author": "Bob Brigham",
    "title": "Meatgrinder' GOP Gov. primary in Michigan will leave nominee broke, bloodied, and disliked': expert",
    "sentiment": "0.0"
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Conservative radio host <span class='selected-term'>Tudor Dixon</span> doesn't have the same resources as her intra-party foes, but she sports endorsements from Reps. Bill Huizenga and Lisa McClain.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22",
    "sentiment": "0.0"
  },
  {
    "id": 877,
    "mediaId": 124,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "In a trio of complaints filed this week, attorneys working with the state Democratic Party said they found problems with the nominating petitions filed by former Detroit police chief James Craig, businessman Perry Johnson and conservative commentator <span class='selected-term'>Tudor Dixon</span>  enough to disqualify all three from the Aug. 2 primary, they argue.",
    "author": "",
    "title": "Michigan Democrats accuse GOP candidates of using forged signatures to get on ballot",
    "sentiment": "0.0"
  },
  {
    "id": 861,
    "mediaId": 19,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Craig is the current frontrunner in the Republican primary, but the primary field is packed with other candidates, including chiropractor Garrett Soldano, businessman Perry Johnson, real estate broker and activist Ryan Kelley, conservative commentator <span class='selected-term'>Tudor Dixon</span>, and former car dealership owner Kevin Rinke.",
    "author": "Ashley Oliver",
    "title": "Poll: Michigan Democrat Gretchen Whitmer Trails Republican on Generic Ballot for Governor's Race",
    "sentiment": "0.0"
  },
  {
    "id": 3296,
    "mediaId": 261,
    "date": "5/11/2022 12:00:00 AM",
    "sentence": "Craig's campaign faces two challenges  one from a Michigan resident represented by lawyer and former Michigan Democratic Party Chair Mark Brewer and another from Michigan Strong PAC, a conservative group supporting GOP gubernatorial candidate <span class='selected-term'>Tudor Dixon</span>'s campaign.",
    "author": "Paul Egan",
    "title": "James Craig acknowledges possible fraud in signature gathering for his petition",
    "sentiment": "0.0"
  },
  {
    "id": 3454,
    "mediaId": 261,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "That means that barring some change, Norton Shores businesswoman <span class='selected-term'>Tudor Dixon</span>, Michigan State Police Capt.",
    "author": "Paul Egan",
    "title": "GOP candidate for governor balks at Detroit Chamber debate over COVID-19 requirements",
    "sentiment": "0.0"
  },
  {
    "id": 7301,
    "mediaId": 98,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Another GOP candidate, <span class='selected-term'>Tudor Dixon</span>, had also contested Craig's voter signatures as fake.",
    "author": "DAVID EGGERT",
    "title": "Primary problem: Michigan GOP governor candidates short signatures",
    "sentiment": "0.0"
  }
]