{
  "id": 14057,
  "mediaId": 2605,
  "date": "2022-03-15",
  "headline": "Column: ‘It’s a calling.’ It’s also scary. That’s why so many election officials are quitting",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/14a9dfe/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F71%2F55%2F243748334f68a84fcca13f74d61c%2Fla-photo-jan-6-2021-009.JPG",
  "link": "https://www.latimes.com/politics/story/2022-03-15/trump-big-lie-election-officials-under-siege",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In California, Democratic state Sen. Josh Newman of Fullerton introduced similar legislation that would give election workers the option of enrolling in the privacy protection program available to judges, politicians and victims of domestic abuse, so they could keep their personal information private.",
    "He sees the threats against election workers as part of a deliberate strategy; Trump and his allies have made no secret of their attempt to hijack the voting system by taking over positions from secretary of state and attorney general down to the county and precinct levels.",
    "“These attacks have forced election officials across the country to take steps like hiring personal security, fleeing their homes and putting their children into counseling,” according to the center, a research and policy organization affiliated with New York University.",
    "Looking to November’s balloting and beyond, 60% of election officials expressed concern that harassment and safety concerns will make it more difficult to recruit and retain the workers vital to running the country’s election machinery and ensuring its integrity.",
    "It bears repeating that, despite Trump’s continued and incessant lies, U.S officials judged the Nov. 3, 2020, election — which saw record-high turnout amid the worst pandemic in a century — “the most secure” in the country’s history.",
    "A new survey by the Brennan Center for Justice found 1 in 6 election officials nationwide said they have been threatened, part of a dramatic rise in tensions as voting and elections have become an increasing political flashpoint.",
    "As Maricopa County recorder, Fontes oversaw the balloting in Phoenix and its sprawling suburbs, the swing portion of a swing state and one of the focal points of President Trump’s unhinged efforts to overturn Joe Biden’s victory.",
    "The Justice Department last year created a task force to prosecute people who threaten election workers and in January charged a Texas man who posted a message urging “patriots” on Craigslist to shoot three Georgia officials.",
    "“There is no evidence that any voting system deleted or lost votes, changed votes or was in any way compromised,” the Department of Homeland Security said in a statement co-signed by some of Trump’s own appointees.",
    "With tensions mounting, as armed demonstrators gathered outside his office and a SWAT team parked itself inside, Fontes packed “go bags” so his wife and children could quickly flee their home.",
    "That fact hasn’t stopped the continued assault on the country’s election systems and its front-line workers, who deserve more than the protective efforts undertaken so far by lawmakers.",
    "More than 3 in 4 also believe social media companies could do a better job stopping the spread of false information that has left so many of them under siege.",
    "In Oregon, the Legislature passed a bill upping the penalty for harassing election workers and helping prevent their home addresses from being made public.",
    "After losing his run for a second term, Fontes is seeking the Democratic nomination for secretary of state, the official in charge of Arizona’s elections.",
    "But that’s a fraction of what the Brennan Center estimates is needed over the next several years to update equipment and protect election integrity.",
    "Still, the overwhelming majority of election workers surveyed by the Brennan Center felt the federal government hasn’t done enough to protect them.",
    "More troubling, 30% said they knew of at least one election worker who had left the position in part because of intimidation or increased threats.",
    "In the combustible days and weeks following the November 2020 election, Adrian Fontes was threatened so many times he lost count.",
    "“It’s anti-American.”\nMore than 1 in 4 of those surveyed by the Brennan Center said they were concerned about being assaulted.",
    "That’s a void Trump acolytes are happy to fill, with an eye on gaming the presidential election if he runs again in 2024.",
    "The spending bill the Senate passed last week and sent to President Biden included $75 million for election security.",
    "Fontes, a former Marine, said many election officials take the job for the same reason people enlist in the military.",
    "All because election workers were doing their job and a bunch of sore-losing chuckleheads didn’t like the result.",
    "“It’s a duty.”\nNot one, however, that should carry the risk of physical danger or emotional abuse.",
    "“They’re intimidating good people out of these jobs so they can replace them with sycophants.",
    "“It’s insanity,” said Fontes, who narrowly lost his 2020 reelection bid.",
    "Over half said they worried about the safety of their colleagues.",
    "After one death threat, the family evacuated for several days.",
    "But the menace facing Fontes and his staff was not unusual.",
    "“This is horrific for our democracy,” Fontes said.",
    "Because it’s happening right under our noses.”",
    "It’s not complicated, and people should care.",
    "Here’s hoping more cases follow.",
    "All of which are a good start.",
    "“It’s a calling,” he said.",
    "Crazy stuff."
  ]
}