{
  "id": 1651,
  "mediaId": 2911,
  "date": "2022-02-16",
  "headline": "Democracy Is On The Ballot In These 11 Secretary Of State And Attorney General Elections",
  "image": "https://fivethirtyeight.com/wp-content/uploads/2022/02/GettyImages-1229437619-16x9-1.jpg?w=712",
  "link": "https://fivethirtyeight.com/features/democracy-is-on-the-ballot-in-these-11-secretary-of-state-and-attorney-general-elections/",
  "mediaOutlet": "FiveThirtyEight",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jean Yi",
  "authorUrl": "https://fivethirtyeight.com/contributors/jean-yi/",
  "termIds": [
    0
  ],
  "sentences": [
    "And given their discretion to interpret and implement election laws in ways that either make it easier or harder to vote, they’ve already drawn a lot of attention for 2022: Candidates for the office are raising record sums of money, Trump has personally pushed to install loyalists in three key states, and incumbents who otherwise might have sailed to an uncontroversial reelection are now facing rabid primary challenges.",
    "But despite the scandals Paxton finds himself in — he faces felony charges from a 2015 securities fraud case when he was a member of the Texas Legislature and is also the subject of a separate FBI investigation over allegations that he engaged in bribery and other crimes while attorney general — the most recent polling of the race shows Paxton leading the pack, with 47 percent of the vote.",
    "In total, we’ve identified five attorney general elections in which claims of election fraud have been a significant issue, ranging from Texas, whose attorney general led the charge to overturn election results, to Wisconsin, where neither Republican candidate has explicitly claimed that Trump won in 2020 but have nonetheless made election fraud a significant part of their platforms.",
    "Ed Packard, who worked in the secretary of state’s elections division for more than 24 years, maintains that there is no evidence of widespread voter fraud, whereas state Rep. Wes Allen supported Texas’s lawsuit to overturn the 2020 election and Alabama Auditor Jim Zeigler has said there is “preliminary information” to suggest there were “strange voting returns” in some counties.",
    "State Rep. Shawnna Bolick, for instance, signed onto a resolution that urged Congress to award Arizona’s Electoral College votes to Trump, and she also introduced a bill that would have allowed the legislature to revoke the certification of presidential elections in the state,1\nalthough she has argued that she wasn’t part of the “Stop the Steal” movement.",
    "Another state that Democrats are defending is Wisconsin, where incumbent Democrat Josh Kaul faces two Republican challengers, who haven’t backed the Big Lie but who have still made “election security” a big part of their platforms: Fond du Lac County District Attorney Eric Toney and former state Assemblymember Adam Jarchow.",
    "Attorney general\nThey may not be responsible for the administration of elections, but as their states’ “top lawyers,” state attorneys general provide legal advice and representation for government agencies and officials, investigate crimes and otherwise work to ensure that the state’s laws are being enforced.",
    "Trump himself has not yet weighed in on the GOP primary here, but if he does, he’ll probably back former state Assemblyman Jim Marchant, who wants to conduct an Arizona-style “audit” into Nevada’s results and attended an election-fraud conference put on by businessman and Trump ally Mike Lindell.",
    "Former Maricopa County Recorder Adrian Fontes (who used to oversee elections in Arizona’s most populous county) and state House Minority Leader Reginald Bolding are the two Democratic candidates and the only two candidates in the race who have acknowledged Biden’s victory as legitimate.",
    "Notorious for a controversial law he championed as secretary of state that required residents prove their citizenship before registering to vote, Kobach is now mounting his third bid for statewide office despite two previous unsuccessful attempts — he first lost to Democratic Gov.",
    "That, in turn, precipitated a primary challenge from attorney Art Macomber, who said he was inspired to run when Wasden didn’t join the suit; Dennis Boyles, another attorney in the state; and former Rep. Raúl Labrador, Wasden’s only challenger with any political experience.",
    "But state Sen. Mary Souza has pointed to “weaknesses” in Idaho’s election laws, while state Rep. Dorothy Moon last year signed a letter calling for an “audit” into the election results in all 50 states along with the decertification of the 2020 election if necessary.",
    "Another well-funded Republican candidate, former state Sen. Jesse Haw, says on his campaign website that Nevada’s liberal voting laws “have made it easier to cheat.” However, there is one pro-democracy Republican running: Sparks City Councilman Kristopher Dahir.",
    "She sponsored multiple voting restrictions that passed the legislature last year, and she initially supported an unfounded partisan audit into the 2020 election results in Maricopa County (although she later turned against it, complaining it had been “botched”).",
    "The aftermath of the 2020 presidential election was probably most Americans’ introduction to Brad Raffensperger, the Georgia secretary of state who rebuffed then-President Donald Trump’s entreaties to “find 11,780 votes” that would allow him to carry the state.",
    "Secretaries of state and state attorneys general have always been influential within their own states, but the attempted abuse of these offices to try to overturn the results of the 2020 election has finally awakened the rest of the country to their importance.",
    "Karamo became a right-wing celebrity when she claimed she witnessed fraud as a poll watcher in the 2020 election, and she has espoused conspiracy theories such as that Trump actually won Michigan and that the Jan. 6 rioters were actually members of antifa.",
    "It’s early yet, but at this point both Jarchow and Toney are behind Kaul’s fundraising; Kaul had over $1 million ready to spend in his campaign account at the end of December, while Jarchow and Toney have each raised between $80,000 and $100,000.",
    "In Kansas, meanwhile, the attorney general election is wide open after incumbent Derek Schmidt decided to run for governor, creating an opening for one of the GOP’s most vocal proponents of election fraud: former Secretary of State Kris Kobach.",
    "DePerno has also been a vocal proponent of the claim that Trump’s election loss was fraudulent, even filing a lawsuit in Antrim County alleging that the voting machines used in the election were compromised (the suit was ultimately dismissed).",
    "At this point, however, polling shows incumbent Democratic Attorney General Dana Nessel with a small lead over her two main Republican challengers, former Michigan Speaker of the House Tom Leonard and attorney Matt DePerno.",
    "And since the secretaries of state and attorneys general who are elected in 2022 will wield power in 2024, this year’s elections could plunge our democracy into further danger if would-be election subverters win them.",
    "There are two other Republican candidates in this race: George P. Bush, the Texas land commissioner and son of 2016 candidate (and frequent Trump critic) Jeb Bush, and former Texas Supreme Court Justice Eva Guzman.",
    "Republicans are also hoping to flip control of the Arizona secretary of state’s office, but there, Democratic incumbent Katie Hobbs isn’t running for reelection, leaving a crowded field of hopefuls to replace her.",
    "The two other GOP candidates, advertising executive Beau Lane and state Sen. Michelle Ugenti-Rita, have declined to say whether the 2020 election was illegitimate, but Ugenti-Rita has voted like she thinks it was.",
    "As we said at the outset, Texas was at the forefront of attempts to overturn the 2020 election result, in large part thanks to Paxton’s baseless lawsuit to block the results in four states Biden had won.",
    "Neither Mattivi nor Warren have spoken publicly about whether they dispute the results of the 2020 election, instead focusing more on challenging the Biden administration on issues like vaccine mandates.",
    "Finally, state Rep. Ryan Berman is also running as a Republican who backs the Big Lie — he signed onto a letter in late 2020 that raised allegations of election fraud and asked for an independent audit.",
    "As a result, campaigns for these offices that flew under the radar in 2014 (when Paxton was first elected) and 2018 (when Raffensperger was) have been thrust into the national spotlight here in 2022.",
    "Nevada’s secretary of state post is also open following the retirement of Republican Barbara Cegavske, who was censured by the state GOP for her insistence that the 2020 election was not fraudulent.",
    "So while it’s frighteningly difficult to know how likely it is that the 2024 election will actually get overturned, it’s definitely possible that, after 2022, the pieces will be in place to do so.",
    "While Raffensperger has made it clear there was no election fraud in Georgia and that Biden won the state, his challenger Hice voted against the certification of the 2020 election in the House.",
    "Lawrence broke with over a dozen Republican attorneys general when he announced in December 2020 that he wouldn’t be joining Texas’s effort to overturn the 2020 presidential election result.",
    "Bush is the only candidate to have rebuffed claims that the 2020 election was stolen from Trump; Guzman hasn’t said anything publicly about it but has said she would welcome Trump’s support.",
    "And a lot of the nuts and bolts of administering a free and fair election are hammered out on the county level, where there are countless more election officials getting elected this year.",
    "Through the end of January, he has raised $1.6 million to Raffensperger’s $597,000 and Belle Isle’s $376,000, and he has the golden ticket in any GOP nomination fight: Trump’s endorsement.",
    "Secretary of state\nAs the ones who oversee the administration of elections and the certification of results in most states, secretaries of state play a fundamental role in our democracy.",
    "Whichever Republican emerges from the primary will then face a tough general election against the well-funded ($1.1 million raised so far) Democratic state Rep. Bee Nguyen in November.",
    "Trump endorsed Paxton last July, but he’s also praised Rep. Louie Gohmert, who filed his own lawsuit to overturn the 2020 election and is now challenging Paxton for attorney general.",
    "There’s also a competitive primary on the Democratic side between Cisco Aguilar, a staffer for former Senate Majority Leader Harry Reid, and former state Assemblywoman Ellen Spiegel.",
    "And unlike in most states, her Republican challenger will be chosen at a party convention, not a primary, which could lead to a more radical nominee who appeals to party diehards.",
    "The most controversial state attorney general right now is likely Texas’s Ken Paxton, who is mired in election-related disputes as well as two different criminal investigations.",
    "Meanwhile, Jarchow has attacked Kaul for insufficiently investigating allegations of election fraud, although he hasn’t gone as far as to question the 2020 presidential result.",
    "But all of these challengers likely face a steep climb to the nomination — Wasden is the longest-serving attorney general in Idaho’s history, having served for nearly 20 years.",
    "Finchem, who has Trump’s endorsement, also has ties to the QAnon conspiracy theory and has identified as a member of the Oath Keepers, a far-right anti-government militia.",
    "The incumbent secretaries of state of both Idaho and Alabama are retiring, and the primaries to replace them have become referenda on the legitimacy of the 2020 election.",
    "Same with Ken Paxton, the Texas attorney general who filed a baseless lawsuit to get the Supreme Court to throw out 60 of then-President-elect Biden’s electoral votes.",
    "Hice isn’t the only election denier in the race, though: Former Alpharetta Mayor David Belle Isle has claimed there were “irregularities” in the 2020 election, too.",
    "Likewise, the candidates to succeed Alabama Secretary of State John Merrill include one experienced election administrator and multiple pro-Trump election deniers.",
    "Meanwhile, both state Sen. Kellie Warren, who launched her campaign with a thinly veiled dig at Kobach, and former prosecutor Tony Mattivi are running against him.",
    "This year, 27 secretaries of state and 30 attorneys general will be elected nationwide (other states either elect them in other years or don’t elect them at all).",
    "Since it’s still early in the campaign, races for secretary of state and attorney general in other states could become hotly contested over the next few months.",
    "But there are a couple of dark-red states where the Republican primary (as the de facto general election) could have huge consequences for democracy as well.",
    "(He hasn’t claimed the 2020 election was fraudulent, but he did write an op-ed in the conservative media outlet Breitbart in support of Paxton’s lawsuit.)",
    "In Idaho, it’s a question of whether Republican incumbent Lawrence Wasden, who has defended the 2020 election result, will survive a primary challenge.",
    "Toney, for instance, has tried to build a name for himself as the district attorney who has prosecuted the most cases of election fraud in the state.",
    "In the past year, this has meant a lot of wading through — and in some cases initiating — claims of election fraud in the 2020 presidential election.",
    "He also continued to baselessly claim that hundreds of thousands of potentially fraudulent votes were cast and that Trump, in fact, carried Georgia.",
    "The list of secretary of state elections to watch starts with Georgia, where Raffensperger first faces a tough primary from Rep. Jody Hice.",
    "As is true in Michigan’s secretary of state election, GOP convention-goers will ultimately decide who the nominee is, not primary voters.",
    "It’s likely Kobach’s failure to win these recent elections that has attracted competition in this primary, despite his Trump bona fides.",
    "Meanwhile, in Michigan, it’s another case of a pro-democracy Republican pitted against proponents of the Big Lie in the GOP primary.",
    "And if Leonard wins the nomination, the 2022 election will be a rematch of 2018, which Nessel won by just 3 percentage points.",
    "DePerno is polling worse against Nessel than Leonard, but it’s close, and his endorsement from Trump may sway some delegates.",
    "And with the exception of his first primary in 2002, he’s handily defeated all subsequent opponents by double-digit margins.",
    "But of course, these are only some of the highest-profile offices on the ballot in 2022 that could impact the 2024 election.",
    "Democratic secretaries of state who spent the 2020 election cycle expanding voting access are in the crosshairs, too.",
    "He is also the only Republican running who has said there isn’t any evidence that the election results were invalid.",
    "Laura Kelly in the 2018 gubernatorial race and then lost to then-Rep. Roger Marshall in the 2020 Senate GOP primary.",
    "Meanwhile, state Rep. Mark Finchem signed onto the same resolution as Bolick and attended the Jan. 6 insurrection.",
    "For instance, in Idaho, there are three candidates vying to replace outgoing Secretary of State Lawerence Denney.",
    "Phil McGrane, who runs elections in Idaho’s biggest county, has said that Idaho’s elections are generally secure.",
    "Other Republicans in the race have more conventional resumes for the state’s chief election official: state Rep.",
    "That said, both Labrador and Macomber have outraised Wasden, which is a favorable sign for their campaigns.",
    "Dahir has said he does not believe the 2020 election was stolen and has praised Cegavske’s leadership.",
    "Ugenti-Rita has other baggage as well: A lobbyist has accused her of making unwanted sexual advances.",
    "Of the four Republicans in the race, meanwhile, two have tried to overturn the 2020 election results.",
    "Beau LaFave, Chesterfield Township Clerk Cindy Berry and Plainfield Township Clerk Cathleen Postmus.",
    "These are four of the biggest secretary of state races in which democracy is on the line in 2022.",
    "But his path to the secretary of state’s office is not clear in this newly minted swing state.",
    "(Toney has prosecuted seven of 10 cases, the most of any Wisconsin district attorney.)",
    "That’s good news for college professor Kristina Karamo, who has Trump’s endorsement.",
    "Trump and his allies aren’t just targeting their fellow Republicans, though.",
    "What’s actually driving inflation | FiveThirtyEight Politics Podcast",
    "The most vulnerable Democrat is likely Jocelyn Benson of Michigan.",
    "It’s still early, but Hice looks like the primary front-runner.",
    "(He didn’t.)"
  ]
}