{
  "id": 1829,
  "mediaId": 2664,
  "date": "2022-02-07",
  "headline": "GOP ballot measure in Arizona would restrict early voting to speed up ballot counting",
  "image": "https://www.rawstory.com/media-library/no-counterfeit-ballots-found-by-georgia-election-investigators.jpg?id=27655723&width=1200&coordinates=0%2C133%2C0%2C134&height=600",
  "link": "https://www.rawstory.com/gop-ballot-measure-in-arizona-would-restrict-early-voting-to-speed-up-ballot-counting/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.rawstory.com/u/jeremyduda-arizonamirror",
  "termIds": [
    5760,
    3648,
    3768,
    4052,
    2406,
    1126,
    392,
    5949
  ],
  "sentences": [
    "“What we’re really trying to do here — and I will acknowledge the initiative doesn’t come right out here and say this — what we’re really trying to do is put the counties in a position where 99% of the votes cast in any particular general election are counted by the time the sun comes up on the Wednesday after the election,” said Miller, who served assistant secretary of state under Republican Secretary of State Michele Reagan from 2015-18.",
    "“I don’t see that as being legitimate, because Election Day is Election Day.”\nPinny Sheoran, state advocacy chair and president-elect of the League of Women Voters Arizona, said there’s no good reason to eliminate popular voting methods or to reject legitimately cast ballots that arrive at county election offices before the close of polling on Election Day.",
    "Distrust in elections, particularly among Republicans, has become a major issue in the wake of the 2020 election, when former President Donald Trump and many of his supporters have spread lies about the election being rigged against him in Arizona and other swing states where President Joe Biden defeated him.",
    "Maria Dadgar, executive director of the Inter Tribal Association of Arizona, worried that the provision would prohibit voter education efforts aimed at Native Americans, whom she said face greater hurdles and challenges than other Arizonans when it comes to registering to vote and casting ballots.",
    "It would also prohibit people from dropping off ballots for their spouses or other family members who live in their households, and it would do away with the ease of dropping off an early ballot by potentially requiring a long wait before the voter could cast their ballot.",
    "But for the vast majority of the population, when they went to bed Tuesday night, they thought Steve Gaynor was going to be the secretary of state or Martha McSally was going to be Arizona’s next senator,” Miller said, referring to two Republicans who lost in 2018.",
    "Democratic County Recorder Adrian Fontes led Republican challenger Stephen Richer for four days, falling behind over the weekend after the election, one of several countywide Democratic candidates who saw their leads evaporate in the days after the election.",
    "It would also prohibit the state and counties from disseminating voter registration or other election-related information in ways that intentionally targets people based on voters’ race, ethnicity, age, gender, geographic location or political affiliation.",
    "But rather than walk to the front of the line at a polling place and put their early ballot envelopes in a drop box, voters would have to wait in line and show ID to cast their ballots, like people who choose to cast their ballots in-person.",
    "Nail-biter elections that last two weeks after the polls close could be a thing of the past under a proposed measure that could be on the November ballot — with the trade-off that Arizonans will have fewer options for casting their votes.",
    "Under the Easier to Vote, Harder to Cheat Act, early voters would have four less days to cast their ballot: Only early ballots received in the mail or at drop-off locations by 7 p.m. on the Friday before the election would be counted.",
    "The notion that making Election Day a holiday will make it easier for people to vote is an increasingly popular one among Republicans, many of whom propose the idea as compensation for either restricting or eliminating early voting.",
    "In 2018, Republicans led several big statewide races on election night, only to see Democrats overtake them to win campaigns for U.S. Senate, secretary of state, superintendent of public instruction and Corporation Commission.",
    "Sean Morales-Doyle, the acting director for voting rights and elections at the Brennan Center for Justice, isn’t opposed to the idea of making Election Day a holiday, but warned that it’s far from a panacea.",
    "Democratic candidates have historically always gained ground after Election Day in Arizona, as election officials count early ballots that have been dropped off in person, which typically benefit Democrats.",
    "I would just be skeptical about whether or not that would happen.”\nPurcell also questioned why counties shouldn’t be able to count early ballots they receive after 7 p.m. on the Friday before the election.",
    "It would expand opportunities for county political parties to have observers for the processing of early ballots, verification of signatures, and tabulation, duplication and adjudication of early ballots.",
    "Several GOP lawmakers, primarily proponents of bogus claims about fraud in the 2020 election, have proposed legislation to create an Election Day holiday, often in conjunction with curbs on early voting.",
    "It hasn’t yet hired any paid petitioners for the campaign — effectively a must-have for any successful citizen initiative — but conversations about hiring signature-gatherers is underway, Miller said.",
    "A person who works in an office is a lot more likely to get the day off for such a holiday than a clerk at a Circle K, though the latter may have trouble getting out to vote on Election Day.",
    "State law currently gives election officials five days after the election to “cure” signatures that can’t be verified, but the proposed ballot measure would eliminate that curing period.",
    "“If you want to take advantage of the privilege of voting by mail, we ask you to exercise that privilege responsibly and get the ballot mailed back in a timely manner,” Miller said.",
    "And the 11 p.m. deadline for counting early ballots, she said, is based on an “untested time limit” that doesn’t take into consideration the time it takes to actually count ballots.",
    "“A catchy title that claims to make it easier to vote while ensuring the law will make it harder to vote is equivalent to ‘putting lipstick on a pig’ and will not fool the public.",
    "And the people who are having the hardest time finding time to go vote on Election Day are least likely to be helped by Election Day as a holiday,” Morales-Doyle said.",
    "The votes counted after Election Day are primarily early ballots that are dropped off at polling places on Election Day instead of being returned in the mail earlier.",
    "Miller said the goal is to give the counties several days to process the ballots and verify the signatures that election officials use to confirm voters’ identities.",
    "Miller would not say who is funding the measure, saying that information will come out when the campaign committee files its first campaign finance report in April.",
    "“How do you say that’s the arbitrary date that you’re going to count somebody’s ballot when you’ve actually received it by 7 o’clock on Election Day?” she said.",
    "Republican election attorney Lee Miller, who’s working on the campaign, said the act’s primary purpose is actually to make it easier to count ballots quickly.",
    "“The people who will benefit from Election Day as a holiday are often the people who aren’t struggling to find the time to go vote on Election Day anyway.",
    "Purcell, a Republican who held the office for 28 years, wasn’t convinced that it would actually result in final ballot counts as quickly as Miller said.",
    "Polling has consistently shown that a majority of Republicans believe Biden won through fraud, though there has been no evidence to back up that claim.",
    "The proposal seeks to speed up the ballot counts primarily by imposing new restrictions on early voting, which is used by some 80% of Arizona voters.",
    "Many people don’t get holidays off from work, such as those who work in retail, food service, health care, law enforcement, firefighters and others.",
    "The one provision in the ballot measure that could make it easier for people to vote is that Election Day would become an official state holiday.",
    "Republicans didn’t raise similar alarms when GOP candidates overtook their Democratic opponents more than a week after the polls closed in 2020.",
    "The campaign for the ballot measure must collect at least 237,645 valid signatures from voters by July 7 to put the act on the November ballot.",
    "Arizona Mirror is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "Some Republicans falsely portrayed the 2018 lead changes as suspicious, though there was never any evidence that the count wasn’t legitimate.",
    "But the law wouldn’t force them to do so, he acknowledged, and employees who couldn’t get the day off to go vote would have no recourse.",
    "In both 2018 and 2020, Democratic candidates won more votes among those voters, allowing them to turn narrow deficits into victories.",
    "He said the campaign believes many private sector employers will understand how important it is and give their workers the day off.",
    "While making Election Day a state holiday is laudable, everything else in this act would make it harder for voters,” Sheoran said.",
    "However, elections experts say Election Day holidays are nothing more than a fig leaf that will do little to benefit most voters.",
    "He confirmed that the committee received input from Republicans, but couldn’t say whether any Democrats worked on it.",
    "Some of its provisions would make it harder to vote, and appear to have little to do with making it harder to cheat.",
    "Democrat Jevin Hodge also led Republican county Supervisor Jack Sellers for more than a week before losing his race.",
    "That has certainly been true in the past two election cycles, at least when the leads change in favor of Democrats.",
    "This would eliminate the need to verify the signatures on those ballots, which can be a time-consuming process.",
    "The proposed ballot measure is called the Easier to Vote, Harder to Cheat Act, though the title is a misnomer.",
    "Within two days of an election, counties would have to post digital images of the ballots on their websites.",
    "One former election official, former Maricopa County Recorder Helen Purcell, took a dim view of the measure.",
    "Miller acknowledged that many people will still have to work on Election Day, even if it is a holiday.",
    "The only people who would be guaranteed a day off to go vote on Election Day are government workers.",
    "Arizona’s prolonged ballot-counting process generates distrust and suspicion in voters, Miller said.",
    "He said he’s not aware of any county election officials who were consulted in crafting the measure.",
    "Voters have 27 days to mail them, and can drop them off in person through the day of the election.",
    "Voters would still have the option of dropping off their early ballots in person on Election Day.",
    "Currently, election officials must receive early ballots by Election Day in order to count them.",
    "Miller said that would provide more opportunities for people to vote in-person on Election Day.",
    "How do you get them processed and make sure they’re all processed by that Tuesday?” she said.",
    "It doesn’t say what happens if any of those early ballots are still uncounted at that point.",
    "“Folks still work on Christmas, Easter and Thanksgiving, without a doubt,” Miller said.",
    "Those suspicions become magnified when leads change as the counts wear on, Miller said.",
    "The proposal would require those ballots to be counted by 11 p.m. on election night.",
    "It would also eliminate in-person emergency voting in the days before the election.",
    "(This wouldn’t apply to military and overseas ballots, because of federal law.)",
    "“Sure, if you’re an election professional, you understand why that happens.",
    "Contact Editor Jim Small for questions: info@azmirror.com.",
    "“What if you got in 100,000 ballots that (final) day?",
    "He also wouldn’t say who helped craft the measure.",
    "The measure includes a number of other provisions.",
    "“I’ve seen the volume that we’ve had in the past.",
    "Arizona Mirror maintains editorial independence.",
    "Follow Arizona Mirror on Facebook and Twitter.",
    "“That causes people to go, what happened?",
    "Stories Chosen For You"
  ]
}