{
  "id": 2650,
  "mediaId": 2520,
  "date": "2022-02-07",
  "headline": "The Easier to Vote, Harder to Cheat Act? Anonymous Republicans think we'd fall for that?",
  "image": "https://www.gannett-cdn.com/presto/2020/08/03/PPHX/36f575ac-b885-4308-b868-668f90793af7-cent02-7bq9yh48itzrla4hhle_original.jpg?crop=2999,1687,x0,y0&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/02/07/easier-vote-harder-cheat-act-opposite-its-name/6694331001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    1730,
    5879,
    3768,
    638,
    1489,
    1126,
    5967
  ],
  "sentences": [
    "“For purposes of this section, a communication is not impartial or neutral if it is distributed or directed to individuals based in whole or part on such individuals’ race, ethnicity, age, gender, geographic location or residence within the election jurisdiction or actual or presumed political party affiliation or preference.”\nIn other words, no longer could county elections officials go out and talk to people about the importance of voting or register voters at community events on Native American reservations or in low-income, minority areas.",
    "“What we’re really trying to do here – and I will acknowledge the initiative doesn’t come right out here and say this – what we’re really trying to do is put the counties in a position where 99% of the votes cast in any particular general election are counted by the time the sun comes up on the Wednesday after the election,” Lee Miller, a Republican election attorney and former assistant secretawho is representing the campaign committee, told the Arizona Mirror’s Jeremy Duda.",
    "In 2018, then-Maricopa County Recorder Adrian Fontes made it easier for such people to vote, opening emergency voting centers in Mesa, Scottsdale, Avondale and Tolleson, in addition to the usual emergency voting site at the Maricopa County Recorder’s Office in downtown Phoenix.",
    "Sen. Michelle Ugenti-Rita, R-Scottsdale, offered a similar proposal last year, implying there was a plot afoot by a certain county recorder who she would not name to go only to events where he (or she) would register voters of a certain political persuasion.",
    "The EVHC Act says no government employee “may expend or use public resources to prepare or disseminate any communication related to voter registration or voter processes, procedures or deadlines that is not impartial or neutral.”\nThat sounds reasonable.",
    "Since then, the Republican Legislature has tightened up the rules for emergency voting centers, requiring the county board of supervisors to decide where to put emergency voting centers and making it a felony to fake an emergency in order to vote.",
    "Under the EVHC Act, all early ballots – other than military and overseas ballots, which are governed by federal law – would have to be received by 7 p.m. on the Friday before the election to be counted.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Put another way, to make it less likely that you will go to bed on election night thinking Martha McSally won the Senate race only to wake up several days later to find out that Sinema won.",
    "Initiative would limit participation in elections\nIn fact, this proposal seems more about allowing a new legal sort of cheating, by limiting participation in Arizona’s elections.",
    "State law allows you to vote over the weekend or on the Monday before the election when “unforeseen circumstances” would prevent you from getting the polls on Election Day.",
    "Party officials were convinced that Democrat Fontes opened the emergency voting centers so liberal groups could drive more Democrats to the polls and steal the election.",
    "Under this plan, you’d go the back of the line, then show ID to cast your early ballot since there would presumably be no time before 11 p.m. to verify your signature.",
    "I’m going to take a wild guess here and assume she wasn’t upset that the recorder in question was setting up at too many Junior League meetings and gun shows.",
    "We potentially won’t know who is bankrolling this proposal until April 15, the deadline by which the group must file its first campaign finance report.",
    "As Duda notes, Democratic candidates have historically gained ground after Election Day, once the early ballots dropped off at the polls are counted.",
    "When a Democrat won a U.S. Senate seat – for the first time in 30 years – that year, Republican Party officials declared that the fix was in.",
    "No longer would you have five days after the election to prove you signed your early ballot, should there be questions about your signature.",
    "Opinion: A thus-far anonymous group of Republicans has proposed a ballot initiative called The Easier to Vote, Harder to Cheat Act.",
    "Miller told the Mirror’s Duda that EVHC Act is needed to promote confidence in our elections by more quickly tabulating the votes.",
    "Better to ensure a quick count, it seems, than to ensure that every qualified voter has a voice in who will represent them.",
    "The party even paid for an “independent audit,” only to discover that just 2,788 people voted at those emergency centers.",
    "County elections officials going to areas where they might find a fair number of citizens who aren't registered to vote.",
    "But one thing seems clear: this proposal has absolutely nothing to do with making it easier to vote or harder to cheat.",
    "Either way, don’t bother trying to drop off a family member’s early ballot, unless it, too, is bound for the garbage.",
    "Meet the latest assault on Arizona’s wildly popular early voting program:\nThe Easier to Vote, Harder to Cheat Act.",
    "Brought to you by … well, we don’t know who it is that is scheming to put this initiative on the November ballot.",
    "Meanwhile, the group will be collecting the 237,645 signatures needed to put its plan on the Nov. 8 ballot.",
    "Beware of people bearing clipboards asking if you want to make it easier to vote and harder to cheat.",
    "You still could bring your early ballot to a polling place on Election Day but you might not want to.",
    "This, in a county where Democrat Kyrsten Sinema beat Republican Martha McSally by 60,256 votes.",
    "No word on what happens to your ballot if elections officials don’t get to it until 11:01 p.m.",
    "A proposal to make major changes in our elections by people who won’t tell us who they are.",
    "No longer could you bypass the line at the polls and simply drop off your early ballot.",
    "Never mind that the only people guaranteed to get a day off are government workers.",
    "Meanwhile, all early ballots would have to be counted by 11 p.m. on election night.",
    "This is the bait to get people to buy into The Easier to Vote,Harder to Cheat Act.",
    "But read on to the anonymous authors’ definition of impartiality and neutrality.",
    "It does this by:\n… Shutting off opportunities for citizens to register to vote.",
    "… Eliminating in-person emergency voting in the days leading up to an election.",
    "Currently, all early ballots received by 7 p.m. on Election Day are counted.",
    "Or you could just look at the line and chuck your early ballot in the trash.",
    "… Making it more difficult for you to cast an early ballot on Election Day.",
    "In his interview with Duda, Miller declined to say who wrote the EVHC Act.",
    "Oh sure, they also couldn’t go into Paradise Valley or Scottsdale.",
    "That’s not suspicious to anyone who follows Arizona elections.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "… Cutting off early voting four days before the election.",
    "… Eliminating the “curing” period for early ballots.",
    "If you sign this petition, you’ll be doing neither.",
    "He also didn't require proof of said emergency.",
    "... Declaring Election Day a state holiday.",
    "But you know what is suspicious?",
    "Who is pushing this plan?",
    "More on that in a minute.",
    "Weirdly, it does neither.",
    "My advice to voters?",
    "Oh, the horror.",
    "Who knows?"
  ]
}