{
  "id": 4294,
  "mediaId": 2668,
  "date": "2022-01-24",
  "headline": "The Left Starts to Panic as 'Election Deniers' Begin to Dominate Critical Secretary of State Contests",
  "image": "https://media.townhall.com/townhall/reu/o/2018/123/598c9788-3bda-4d18-99eb-eef5415f33bb-1110x740.jpg",
  "link": "https://redstate.com/streiff/2022/01/24/the-left-starts-to-panic-as-election-deniers-begin-to-dominate-critical-secretary-of-state-contests-n511903",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "streiff",
  "authorUrl": "https://redstate.com/author/streiff",
  "termIds": [
    0
  ],
  "sentences": [
    "Finchem has said repeatedly, and without providing legitimate evidence, that the election was tainted by fraud, and he was a major backer of the GOP-led review of the vote in Maricopa County, which election experts and the county’s own Republican officials trashed as an unprofessional fishing expedition.",
    "Donald Trump’s pick to become Arizona’s top elections official raised more campaign cash in 2021 than his two potential Democratic opponents combined — a sign of MAGA-world’s deep engagement in taking over under-the-radar positions in charge of running battleground state elections.",
    "Increasingly, fights over school board positions look to be the line of contact between conservative parents concerned about the quality of education received by children in the school system and the progressive enablers of the various teachers’ unions.",
    "That’s more than the combined fundraising totals of the two leading Democrats, former Maricopa County Recorder Adrian Fontes and state House Minority Leader Reginald Bolding, who respectively raised about $385,000 and $200,000 for the year.",
    "Over the last two years, though, especially in light of the 2020 election fiasco, there have been encouraging signs that conservatives are rapidly comprehending the impact of not paying attention to elected officials at all levels.",
    "In my county, where I’ve been Chief Judge of an election precinct for over a decade, candidates for county commissioner, school board, county clerk, various judges, the recorder of deeds, etc., are very often left blank by voters.",
    "State Rep. Mark Finchem, whom Trump endorsed for Arizona secretary of state in September of last year, has made the former president’s lies about the 2020 election results a cornerstone of his campaign.",
    "If there is one overarching criticism I would make of conservative voters over the years is that there is too much focus on federal officeholders and far too little on local candidates.",
    "The end result is that a relatively small number of voters have an outsized influence on the people who run the county bureaucracy and who occupy what could be “farm team” positions.",
    "After what we saw play out in November 2020, it should be obvious that we need take-no-prisoners warriors filling the secretary of state position everywhere it is on the ballot.",
    "Populist-conservative voters, freed from the thrall of Conservative, Inc., have internalized the type of organizational skill that has so frequently eluded us in the past years.",
    "But the financial haul from Trump’s pick, which included thousands of donations under $100 that poured in from around the country, points to a broader trend across the states.",
    "I have to admit that the way conservatives have risen to the challenge of contesting–and often seizing–all available levers of power has been inspiring.",
    "Drafting off Trump’s endorsement, Finchem brought in more than $660,000 for his campaign in 2021, according to new campaign finance reports.",
    "Strong and visionary candidates are emerging, men and women who have a reason for seeking office far removed from whatever perks it brings.",
    "The nation is in grave peril, and the only way we will turn it around is by out-organizing and out-voting the people trying to destroy it.",
    "Two other Trump-endorsed candidates, Jody Hice in Georgia and Kristina Karamo in Michigan are also raking in money for their campaigns.",
    "Before the dust settles, there could be another dozen reliable secretary of state candidates on the ballot for this fall.",
    "In addition to the secretary of state position, the era of the school board being overlooked appears to be over.",
    "Another Republican with business ties actually raised even more than Finchem.",
    "Particularly those officials charged with maintaining election integrity.",
    "Arizona isn’t the only place where the ferment is taking place.",
    "Not clowns like the flaccid, stump-broke Brad Raffensperger.",
    "Right now, I’m very hopeful that we are on the right track.",
    "This is a very good thing."
  ]
}