{
  "id": 664,
  "mediaId": 2520,
  "date": "2022-02-23",
  "headline": "If Arizona Democrats blink in 2022 primaries, it could be a disaster in the fall",
  "image": "https://www.gannett-cdn.com/presto/2020/11/01/PPHX/d31ded4c-d5f1-42cb-8c2f-c599bb1e586c-IMG_1163.jpg?crop=4031,2268,x0,y373&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/2022/02/23/arizona-democrats-must-donate-get-behind-primary-candidates/6897184001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marlene Woods",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Arizona Democrats must choose now who can win\nI have seen firsthand that big donors are kicking their financial support down the road until after the primaries out of fear of being involved in wounding a fellow Democrat.",
    "By contrast, in the Democratic sphere, many donors and supporters fear the optics and personal guilt of spending and campaigning against fellow ideologues or crippling someone who could be an eventual front runner.",
    "The Republican Party, for all its inadequacies and anti-democratic fervor, has more disciplined donors and volunteers who understand that primaries set up their strongest candidates for general elections.",
    "Volunteer on campaigns in the primary, encourage friends and neighbors to get involved, register voters and get them to vote, and most importantly at this stage – give money to candidates in primaries.",
    "GOP has more disciplined donors, to their advantage\nCurrent hesitancy costs candidates vital resources – resources that could mean throwing a general election to a far-right extremist this November.",
    "Republicans will win, however, and our democracy will be lost unless Democrats get behind the candidate who has the best chance of winning in the general election.",
    "Marlene Woods serves as chair of the Adrian Fontes for Arizona Secretary of State Campaign and has over 20 years of experience as a broadcast journalist.",
    "Opinion: If Arizona Democrats' big donors refuse to get involved in primaries, they will starve candidates of the resources they need to win in November.",
    "And it is from that experience that I implore Democratic donors and volunteers to take a page from the Republican playbook:\nGet involved in primaries.",
    "We were moderate Republicans who became Democrats when our party abandoned its principles and drank from the poisoned well of authoritarianism.",
    "With democracy on the line in 2022 it is imperative to back a candidate who can win in the general for races up and down the ballot.",
    "In this theater of political warfare, funding and supporting a candidate in a primary is a means to an end: winning the general.",
    "It is time for passionate Democrats of means to reconsider the idea that actively supporting a candidate in a primary is sinful.",
    "It will be merciless and unforgiving to our democracy should we squander our opportunity to support our candidates effectively.",
    "Today’s far-right Republicans shamelessly and regularly violate the founding principles of our democracy and must be defeated.",
    "Our experience in Democratic politics doesn’t span decades but being involved in campaign fundraising and organizing does.",
    "Normally, midterms historically favor the party out of power and enthusiasm can wane for the incumbent party.",
    "If you believe in a candidate, don’t wait and hope that they will still be standing in six months.",
    "But these are not normal times and this election is arguably more consequential than 2020.",
    "Instead of battling Trump, we have dozens of Trumps up and down the ballot.",
    "I have seen volunteers opt for waiting until the summer to get involved.",
    "I can sympathize but the 2022 election will leave no room for error.",
    "If you believe in a candidate, the time to get involved is now.",
    "Neither was my husband, former Attorney General Grant Woods.",
    "opinion contributor\nI have not been a lifelong Democrat.",
    "It is time to get behind the candidates who can win.",
    "This mentality threatens Democrats across Arizona.",
    "If you believe in a candidate, support them now.",
    "She is the spouse of the late Grant Woods.",
    "The stakes are too great.",
    "We can’t afford that.",
    "We must get to work."
  ]
}