{
  "id": 784,
  "mediaId": 8344,
  "date": "2022-02-21",
  "headline": "Candidates descend on Graham County",
  "image": "https://gilavalleycentral.net/wp-content/uploads/2022/02/Political-Dinners-1-02-21-2.jpg",
  "link": "https://gilavalleycentral.net/candidates-descend-on-graham-county/?utm_source=rss&utm_medium=rss&utm_campaign=candidates-descend-on-graham-county",
  "mediaOutlet": "KATO",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Bell",
  "authorUrl": "https://gilavalleycentral.net/author/davidbell/",
  "termIds": [
    0
  ],
  "sentences": [
    "“If given the truth, they can be counted on to meet any national crisis.”\nA number of other candidates for state and national officer were on hand, including: Justin Olson and Mick McGuire, both running for U.S. Senate; Juan Ciscomani, Young Mayberry and Kathleen Wynn, all running for Congress; Nick Myers, Kevin Thompson and Kim Owens, all running for Corporation Commission; Lacy Cooper, who is running for Attorney General; Tom Horne, who is running for School Superintendent; and Karrin Robson, who is running for Governor.",
    "Also speaking was state Rep. Daniel Hernandez, who is running for Congress in the district that represents Graham and Greenlee counties; former Maricopa County Recorder Adrian Fontes, who is running for Secretary of State; and former state Rep. Aaron Lieberman, who is running for Governor.",
    "The featured speaker was U.S. Rep. Paul Gosar, who went head-first at the controversies surrounding him, including his recent censure, his effort to reject the certification of Arizona’s electoral votes in the 2020 presidential election and his family campaigning against him.",
    "Both the Democratic and Republican parties in Graham County staged gatherings, with the Democrats hosting the Rose Mofford Dinner on Saturday and the Republicans conducting the Lincoln Day Luncheon on Monday.",
    "Graham County Republican Party Chair Kip Kempton called on residents to get involved at the local level, and to support political candidates who will fight for Graham County.",
    "I feel that every single corner of the state, regardless if the numbers say that they’re more with the Republicans, we need to start showing up,” Teran said.",
    "She also talked about Project 1530, a Democratic outreach effort that focuses on all 15 of Arizona’s counties and its 30 legislative districts.",
    "In Safford, Thatcher we have 20,000 people; draw a 50-mile circle around the area and we have 75,000 people.",
    "SAFFORD — The weekend offered voters a chance for one-on-one time with candidates for upcoming elections.",
    "The featured speaker for the Democrats was state Sen. Raquel Teran, who also is the state party chair.",
    "We have to focus on what’s important to us and for us,” Kempton said.",
    "“We have to focus on what’s best for our county.",
    "“I’m a firm believer in the people,” he said.",
    "“We are now a battleground state.",
    "comments"
  ]
}