{
  "id": 8715,
  "mediaId": 8350,
  "date": "2022-04-08",
  "headline": "Maricopa County Recorder Richer ‘sick of’ ongoing election challenge",
  "image": "https://ktar.com/wp-content/uploads/2022/04/maricopa-county-recorder-glass-seal-twitter-16x9-1.jpg",
  "link": "https://ktar.com/story/4996780/maricopa-county-recorder-richer-sick-of-ongoing-election-challenge/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MARCIA HAMMOND",
  "authorUrl": "https://ktar.com/story/author/mhammond/",
  "termIds": [
    4905,
    3019,
    3221,
    3401,
    4623,
    2915,
    6360,
    6515
  ],
  "sentences": [
    "“Nothing in [Brnovich’s] report said anything about a stolen election, nothing in his interim report does anything to challenge the results that Biden won.”\nThe attorney general has acknowledged filing criminal charges against nine people across the state for voting crimes stemming from the 2020 general election, where more than 3.4 million ballots were cast.",
    "A letter on the interim report on the election review released this week by Arizona Attorney General Mark Brnovich to Arizona Senate President Karen Fann alleged that the investigation uncovered “serious vulnerabilities” regarding election procedures.",
    "“I agree that laws should be improved and I agree with his own record on election integrity, which is actually very telling because he’s been so strong on election integrity, so quick to file lawsuits.",
    "… I don’t have a dog in the fight other than the truth, and I’m sorry not everyone is adhering to the same standard,” Maricopa County Recorder Richer told KTAR News 92.3 FM’s The Mike Broomhead Show.",
    "PHOENIX – Maricopa County’s chief elections officer Stephen Richer said Friday while there are parts of a new report about the 2020 election he agreed with, he was “sick of this” ongoing challenge.",
    "Of those cases, just two were in Maricopa County and both involve people who illegally completed the ballot of their parent, who died shortly before the election.",
    "Voters preparing for the midterm elections, “Should stop listening to the people who are playing politics with this and ask election administrators,” Richer said.",
    "“We’re happy to explain to you everything that we do to ensure the accessibility and security of the election.”\nThe Associated Press contributed to this report.",
    "Brnovich, who is running for U.S. Senate, told the Broomhead Show earlier Friday that the final report would be produced before the midterms.",
    "Richer, a Republican who unseated Democrat Adrian Fontes in November 2020, said he was “100%” certain the election was handled properly.",
    "He didn’t allege any widespread fraud or widespread inaccuracy.”\nThe interim report, Richer said, is meant to stoke fear.",
    "Doug Ducey, both Republicans, and Secretary of State Katie Hobbs, a Democrat, signed off on the election’s certification.",
    "But the report didn’t provide evidence that the results from the state’s most populous county were altered by fraud.",
    "“I agree that there are some administrative things that should be cleaned up,” Richer said of the report.",
    "“We’re gearing up for 2022 midterms and we’re still dealing with this nonsense.",
    "“But he didn’t file a lawsuit regarding the 2020 election.",
    "The election has undergone several reviews and audits.",
    "The primaries are Aug. 2 and the general is Nov. 8.",
    "None have revealed evidence of far-reaching fraud.",
    "Brnovich and Gov.",
    "Share\nComments"
  ]
}