{
  "id": 10246,
  "mediaId": 2551,
  "date": "2022-04-02",
  "headline": "Daly Cherry Evans puts on a kicking masterclass with a VERY rare 20-40 in easy win over Canberra as Tom Trbojevic stars for rejuvenated Sea Eagles",
  "image": "https://i.dailymail.co.uk/1s/2022/04/02/10/56126543-0-image-a-18_1648892065744.jpg",
  "link": "https://www.dailymail.co.uk/sport/nrl/article-10678809/Dale-Cherry-Evans-puts-kicking-masterclass-rare-20-40-easy-win-Canberra.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Australian Associated Press",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Australian+Associated+Press",
  "termIds": [
    4239,
    3703,
    3987,
    2299,
    2724,
    2647,
    220,
    746,
    6031
  ],
  "sentences": [
    "+4\nView gallery\nTom Trbojevic finished with 26 runs for 289 metres and looked back to his best\n+4\nView gallery\nThe fullback was one of four different try scorers for the Sea Eagles on Saturday\nSo much for the pre-match commentary that Manly's slow start to the season could perhaps impact their finals run.",
    "+4\nView gallery\nThe Raiders fell to a disappointing defeat a week after an epic comeback against Gold Coast\nThe Raiders finally responded through a dummy and dash by their five-eighth Jack Wighton to be back in the contest 10-6 by halftime.",
    "His stats underlined what kind of influence the incumbent Test and Queensland Origin captain had on a Canberra outfit that had won two of their previous three matches: 21 kicks for 651 metres.",
    "It was Cherry-Evans at his conniving best with a field goal, two 40-20s, chip-kicks, grubbers, bombs and cross-field shots - setting up two of Manly's four tries along the way.",
    "A first-class kicking game by Manly captain Daly Cherry-Evans put Canberra in a world of pain as the Sea Eagles flew away to a 25-6 victory at Glen Willow Oval in Mudgee.",
    "Fullback Tom Trbojevic (26 runs for 289 metres) and prop Josh Aloiai with 14 runs, 146 metres - 81 of those post-contact metres - ably supported their skipper.",
    "As if Canberra's night could not have been more bleak, two players - Hudson Young and Corey Harawira-Naera - were placed on report for suspect tackles.",
    "+4\nView gallery\nDaly Cherry-Evans (right) delivered a dominant performance for Manly against Canberra\n'Look, it was just one of those nights.",
    "But another Cherry-Evans injection - this time a grubber - led to a Haumole Olakau'atu try before Tom Trbojevic put the result beyond doubt.",
    "But they had to hit back after Manly started quickly with two tries (Reuben Garrick, Morgan Harper) in six minutes to set up a 10-0 lead.",
    "Raiders fullback Charnze Nicoll-Klokstad certainly wasn't having a good time trying to retrieve the plethora of kicks - fumbling two.",
    "Garrick's penalty blew out the score to 24-6 before Cherry-Evans capped his day out with a field goal to seal the 19-point win.",
    "They defended us very well so it was nice to get some nice results off kicks,' Cherry-Evans told FoxSports.",
    "The second half went into a bit of a holding pattern early off the back of errors by both sides.",
    "It wasn't quite the comeback of a week ago when the Raiders overcame a 22-0 deficit.",
    "Now they find themselves at 2-2 so far in 2022 with all systems firing.",
    "They lost four on the trot last year and made the preliminary final."
  ]
}