{
  "id": 10305,
  "mediaId": 8455,
  "date": "2022-04-04",
  "headline": "Three candidates seek Democratic nomination for U.S. Senate",
  "image": "https://www.toledoblade.com/image/2022/04/04/600x_q90_a4-3_cTCjpg/Election-2022-Senate-Ohio-8.jpg",
  "link": "https://www.toledoblade.com/local/politics/2022/04/04/three-candidates-seek-democratic-nomination-for-u-s-senate/stories/20220402017",
  "mediaOutlet": "The Toledo Blade",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Trevor Hubert",
  "authorUrl": "",
  "termIds": [
    4822,
    2580,
    2736,
    1819,
    1489,
    392,
    6077,
    6474,
    6660
  ],
  "sentences": [
    "“I believe we need to assess the decisions that are coming out, make sure that we’re getting conservative, liberal, and Democratic opinions from the court.”\nIn her closing, she said that she wanted to run for Senate because through her work in the community, she has seen people at the lowest points of their life.",
    "“We have to get people back to work so they can put more money in their pockets, we have to defeat Trumpism, and we have to unify and uplift Ohio.”\nShe is bringing the message of wanting to unify Ohio and the campaign has cited reducing gun violence, ensuring election integrity, and fighting voter suppression.",
    "“The influence of special interests and money from lobbyists that has flooded [Washington] has made it more difficult to hold the institutions accountable.”\nMs. Harper has said that she supports Medicare for all, raising the minimum wage, protecting abortion access, and tackling climate change.",
    "“And that’s a scary proposition for American workers and American families.”\nDuring the campaign, he has focused on bringing jobs back to Ohio, standing up for workers, and making investments in infrastructure, manufacturing, and clean energy.",
    "Someone who’s stood shoulder-to-shoulder with Marcy Kaptur on trade, on taxes, on rebuilding the country.”\nTraci (TJ) Johnson\nMs. Johnson is a Toledo native and an information technology executive based out of the Columbus suburb of Dublin.",
    "“For the past 20 years, I’ve been a ward committeewoman, fighting for workers’ rights, a woman’s right to choose, and criminal justice reform…I know what’s at stake in this election,” she said at the recent Democratic debate.",
    "“I want to be your next United States Senator because you need somebody who cares about you.”\nThe primary winner will face one of seven candidates seeking the Republican Party nomination in the November general election.",
    "She went on to work as a senior adviser to former Ohio Attorney General Richard Cordray at the federal Consumer Financial Protection Bureau and has since been an advocate for taking corporate money out of politics.",
    "“Having that experience of mobilizing people, for us to be able to win in November and to make sure we have a strong representative in the seat…we’re going to need to mobilize people all over the state,” she said.",
    "“[Climate change] should be a high priority for all of us because it’s a major threat, if nothing else, to our economy, let alone our ability to be healthy and have the next generation succeed,” she said.",
    "Ms. Harper is also proud of her work as a community organizer, co-founding Columbus Stand Up in 2020, which helped bring coronavirus protective equipment and help those in need get to the polls to vote.",
    "At the debate, she also commended President Biden for nominating Judge Ketanji Brown Jackson to the U.S. Supreme Court, but said that Democrats should “tread lightly” when considering packing the court.",
    "“If we don’t hit the reset button in the United States, I think there’s a good chance the window would close and the China-Russia alliance would be the dominant force in the world,” he said.",
    "She said that her mother’s role as a public school teacher and the union that protected it allowed her to pursue higher education, including a law degree at Stanford University’s Law School.",
    "He added that he felt he would be a “great duo” with fellow Democrat, U.S. Sen. Sherrod Brown, and would look forward to continuing to work with U.S. Rep. Marcy Kaptur (D., Toledo).",
    "He said that he decided to run for Senate because he feels that the world is in a critical moment and that the country needs to make the right moves to remain a world superpower.",
    "Tim Ryan\nMr. Ryan, 48, has been a member of the U.S. House of Representatives since 2003 and currently represents Ohio’s 13th Congressional District from the Youngstown area.",
    "“I’ve worked for people, not because I’ve looked for something in return, but because they’ve needed something, they’ve needed help, assistance,” she said.",
    "It means we need to have more robust investments into our joint vocational schools, skills training, promoting unions, and union apprenticeship,” he said.",
    "“I grew up outside of Youngstown…what we’ve been through is no different than what the people of Toledo have been through in northwest Ohio,” he said.",
    "“If we expand the court as Democrats, then when Republicans come in, they’ll expand the court, then the court will lose its power,” she said.",
    "She added that she wants to increase federal incentives for the clean energy sector to help shift the country to support renewable energy.",
    "Vance, State Senator Matt Dolan (R., Chagrin Falls), investment banker Mike Gibbons, businessman Neil Patel, and businessman Mark Pukita.",
    "The GOP field includes former state treasurer Josh Mandel, former state party chairman Jane Timken, author and venture capitalist J.D.",
    "Overall, “74 percent of Ohioans don’t go to college, and we need to focus on bringing shop class back to our high schools.",
    "Her campaign has touted over 30 years of voluntary service to the Democratic party and 20 years of community activism.",
    "He also wants to bring education policies that will support good-paying jobs without the need for a college degree.",
    "Morgan Harper, Tim Ryan, and Traci (TJ) Johnson will all be on the Democratic ballot for the May 3 primary.",
    "Morgan Harper\nMs. Harper, 38, was born in Columbus and grew up in a foster home before she was adopted.",
    "Republican Rob Portman, who has held the seat since 2011, decided against running for re-election.",
    "Three Democrats are seeking the party nomination in Ohio’s 2022 contest for the U.S. Senate.",
    "“That’s who [voters] are going to put in the United States Senate.",
    "“We’ve had a lot of politicians that are bought off,” she said.",
    "First Published April 4, 2022, 7:00am"
  ]
}