{
  "id": 10697,
  "mediaId": 2573,
  "date": "2022-03-09",
  "headline": "Ohio GOP Senate showdown: Dolan spotlights law enforcement support in new massive ad buy",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/275f50e0-Matt-Dolan-headshot.jpg",
  "link": "https://www.foxnews.com/politics/ohio-gop-senate-showdown-dolan-ad-buy-law-enforcement-support",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    4839,
    3101,
    2290,
    1489,
    976,
    1126,
    6104,
    6067,
    6730,
    6474
  ],
  "sentences": [
    "Dolan, a state senator from Cleveland and a former county chief assistant prosecutor and state assistant attorney general before running for elected office, pledges in an accompanying statement that if elected to the Senate, he’ll \"oppose any effort by Democrats to restrain the ability for law enforcement to keep our communities safe.\"",
    "The primary field also includes 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer and investment banker; former Ohio treasurer and former two-time Senate candidate Josh Mandel; former Ohio GOP Chair Jane Timken; and venture capitalist and best-selling author J.D.",
    "FIRST ON FOX: Matt Dolan is touting his efforts to fund Ohio’s sheriffs and police departments as he launches his second straight seven-figure ad blitz in a month in his bid for the Republican Senate nomination in the state’s crowded and competitive GOP primary.",
    "NEW FOX NEWS POLL IN OHIO'S CROWDED AND COMPETITIVE GOP SENATE PRIMARY\nThe commercial then switches to Wood County Sheriff Mark Wasylyshyn and retired Macedonia police department sergeant Keith Olby saying that \"thankfully, Ohio has Matt Dolan.",
    "DOLAN SPOTLIGHTS BORDER SECURITY IN OHIO GOP SENATE PRIMARY AIR WARS\nDolan’s campaign tells Fox News that it will spend $2.5 million to run the commercial on broadcast and cable TV, as well as online and on radio across the Buckeye State.",
    "According to figures from the national ad tracking firm AdImpact, $26 million had been spent through early Tuesday by the campaigns and super PACs to run ads in the Ohio Senate race, with nearly all the spending coming in the GOP primary.",
    "According to AdImpact, the Ohio Senate race to date is the second most expensive in the country this cycle, behind the showdown in the neighboring battleground state of Pennsylvania for another GOP-held open seat.",
    "Dolan's massive new ad buy is the latest sign that in a primary race where all nearly all the major contenders have plenty of personal wealth, or are backed by well financed outside groups, ad spending is soaring.",
    "Ryan is considered the favorite for the Democratic nomination in race that also includes progressive Morgan Harper, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "\"Across the country, crime is surging, and liberals are demonizing and defunding our police,\" charges the narrator in the spot, with which was shared first with Fox News on Wednesday.",
    "And as part of the roll-out of his new ad, Dolan also announced that he landed the endorsement of Betty Montgomery, who in 1994 won election as Ohio’s first female attorney general.",
    "Dolan – whose family owns Major League Baseball’s Cleveland Guardians – is one of eight GOP candidates running in the race to succeed retiring Republican Sen.",
    "Dolan also showcased the endorsement of Deb Burchett, who is the first woman to be elected sheriff in Clark County, which is located northeast of Dayton.",
    "Nearly one-quarter of voters (24%) are undecided – and about two-thirds of Gibbons’ (62%) and Mandel’s (64%) supporters say they may change their mind.",
    "Fighting crime and beefing up funding for law enforcement are pressing issues with Republican voters in Ohio and across the country.",
    "Dolan currently stands in single digits in a new Fox News Poll on which candidate Ohio Republican primary voters would prefer.",
    "The two law enforcement veterans then emphasize that \"when Matt Dolan tells you he will protect Ohio….he will keep his word.\"",
    "The winner of the May 3 Republican primary may face off against longtime Democratic Rep. Tim Ryan of northeastern Ohio.",
    "Dolan has now shelled out roughly $5 million to run ads since going up with his first spot in mid-January.",
    "Gibbons and Mandel lead the pack\nBut the race is unsettled, according to the poll conducted March 2-4.",
    "In the legislature, Matt delivered for law enforcement.",
    "Fox News' Dana Blanton contributed to this report.",
    "Funding, training, equipment, you name it.",
    "So we can keep our communities safe.\"",
    "Rob Portman.",
    "Vance."
  ]
}