{
  "id": 1115,
  "mediaId": 2713,
  "date": "2022-02-14",
  "headline": "Suli: I still want to play for Australia and NSW before Tonga",
  "image": "https://static.ffx.io/images/$zoom_0.37245355941855%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_341%2C$y_29/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/7cb6c8863857aac4039bdc97a4aa8284ae99157a",
  "link": "https://www.smh.com.au/sport/nrl/suli-i-still-want-to-play-for-australia-and-nsw-before-tonga-20220214-p59wb5.html?ref=rss&utm_medium=rss&utm_source=rss_sport_nrl",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Pengilly",
  "authorUrl": "https://www.smh.com.au/by/adam-pengilly-11moxl",
  "termIds": [
    0
  ],
  "sentences": [
    "If I get the chance to play for the Kangaroos, I’ll play there, and if not I’ll play for Tonga.”\nThe Pacific powerhouse is shaping as a legitimate threat to Mal Meninga’s Australia at the end of year World Cup in the United Kingdom, but Suli sees a potential future in the green gold with regular game time under his belt in the NRL.",
    "The boys have been really welcoming and I’ve enjoyed every second of it so far.”\nDragons coach Anthony Griffin, known as a tough disciplinarian, has helped mould Suli into shape before St George Illawarra’s trials against the Eels and the Charity Shield match against the Rabbitohs.",
    "Share\nNormal text sizeLarger text sizeVery large text size\nSt George Illawarra recruit Moses Suli has set himself the ambitious goal of breaking into Brad Fittler’s NSW State of Origin team and declared his preference to play for Australia over Tonga in the World Cup.",
    "It would seem an improbable task for Suli to displace arguably the NRL’s best player, Tom Trbojevic, and Latrell Mitchell from Fittler’s Blues centre pairing, but the 23-year-old insists Origin football is not out of the equation.",
    "No payment required\nRead more\nContinue with GoogleContinue with Apple\nor\nEmail addressContinue\nBy continuing, you agree to your personal information being collected under our privacy policy and accept our terms of use.",
    "St George Illawarra Dragons recruit Moses Suli.Credit:St George Illawarra Dragons\nSurprisingly, he played second fiddle behind centres Brad Parker and Morgan Harper last year as Manly charged into a preliminary final.",
    "It was enough for the Dragons, who had long admired the powerful ball runner, to offer Suli a three-year deal at the Red V - forming a potentially lethal centre pairing with fellow Origin aspirant Zac Lomax.",
    "Suli, who debuted for Mate Ma’a back in 2017, has broached his potentially career-defining switch to the Dragons, which came after he was starved of game time under Des Hasler at Manly last year.",
    "Having already been in the systems of the Wests Tigers, Bulldogs, Sea Eagles and now Dragons before he has even turned 24, Suli knows this next phase will be crucial to his career.",
    "I thought I was getting too comfortable at Manly and as you could see, I wasn’t playing much footy\nMoses Suli\n“I’m dying to play [Manly] and can’t wait.",
    "Hopefully, I can play some finals footy here as well.”\nNews, results and expert analysis from the weekend of sport sent every Monday.",
    "“I thought I was getting too comfortable at Manly and as you could see, I wasn’t playing much footy last year.",
    "By Adam Pengilly\n February 14, 2022 — 6.00pm\n Save\nLog in, register or subscribe to save articles for later.",
    "Suli expects to strip off even more weight before the season opener against the Warriors in Queensland.",
    "As everyone knows, I went through a struggle in my first few years, but I’m a different person now.",
    "“I’ve always wanted to play Origin and I’m still eligible for that,” Suli said.",
    "Register or log in now to read more articles and unlock extra benefits.",
    "I got injured and then was struggling to get my way back into the team.",
    "“I’m about 109 [kilograms] and I want to lose a bit more,” Suli said.",
    "“When I debuted I was 103 and I want to see if I can get down there.",
    "But I just want to play any footy, I’m a bit sick of pre-season.",
    "The boys were playing well and that made it hard for me.",
    "I feel like this pre-season has been my best one so far.",
    "I haven’t finished a full year without getting injured.",
    "“To be honest, I just wanted a fresh start,” Suli said.",
    "“I reckon I’ve matured heaps from my past few years.",
    "This is the first full one I’ve done, though.",
    "Sign up for our Sport newsletter.",
    "Thank you for reading the Herald.",
    "This article is complimentary.",
    "“That’s been one of my goals.",
    "I wanted a fresh start.",
    "“It was tough.",
    "Hide content"
  ]
}