{
  "id": 1131,
  "mediaId": 2572,
  "date": "2022-02-17",
  "headline": "New Ohio Senate fireworks over Trump in one of the nation's most heated primaries",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/Donald-Trump-Arizona-Rally-5.jpg",
  "link": "https://www.foxnews.com/politics/ohio-senate-republican-primary-trump",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The commercial refers to Timken’s initial support for Rep. Anthony Gonzalez of Ohio, who was one of the 10 House Republicans who voted 13 months ago to impeach Trump for inciting the deadly Jan. 6, 2021, attack on the U.S. Capitol by right-wing extremists aiming to disrupt congressional certification of Joe Biden's 2020 election victory.",
    "A month later, Trump quizzed Mandel, Timken, Gibbons and Cleveland-based businessman and luxury auto dealership giant Bernie Moreno (who suspended his campaign earlier this month) about their support in a private meeting with the four candidates ahead of a fundraiser at his golf course in Palm Beach, Florida.",
    "It’s one of the most crowded and competitive Republican Senate primaries in the 2022 election cycle, and as all but one of the major candidates in Ohio's GOP showdown spotlight their support for Donald Trump in hopes of earning the former president’s endorsement, the race has turned increasingly combustible.",
    "Vance, whose political team includes some veterans of the Trump White House and presidential campaigns and who has showcased his support for the former president and his polices, came under attack after entering the race last summer for his past criticisms of Trump during the 2016 presidential campaign.",
    "This isn’t the first time Gibbons, a Cleveland entrepreneur, real estate developer and investment banker who’s making his second bid for the Senate GOP nomination, has targeted Vance, a hedge fund executive and the best-selling author of the memoir \"Hillbilly Elegy.\"",
    "Longtime Democratic Rep. Tim Ryan of northeastern Ohio is the front-runner in a very small field of contenders that also includes progressive Morgan Harper, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "TRUMP HELPS CLEAR THE FIELD IN OHIO'S CROWDED SENATE GOP PRIMARY\nAnd Vance has also taken incoming fire from commercials by two outside groups backing another leading contender – former Ohio treasurer and former two-time Senate candidate Josh Mandel.",
    "THE $20M AND $16M SLUGFESTS: AD SPENDING SOARS IN PENNSYLVANIA AND OHIO SENATE RACES\nThe latest shot in the firefight among the leading contenders came this week, as a new ad by Republican candidate Mike Gibbons attacked rivals J.D.",
    "The Ohio Democratic Party has been feasting on the GOP discord, and late last year started a weekly newsletter titled \"Buckeye Brawl\" to highlight \"just how nasty, chaotic and expensive this Republican Senate primary has become.\"",
    "The sniping among the candidates dates back to February of last year, when Mandel and Timken – the first two major contenders to enter the race – started trying to outdo one another in spotlighting their Trump credentials.",
    "Rob Portman not to make a full-court press to land Trump’s endorsement is state Sen. Matt Dolan, a former prosecutor whose family owns Major League Baseball’s Cleveland Guardians, formerly known as the Indians.",
    "Timken, at the time, described Gonzalez as \"an effective legislator, and he's a very good person,\" but weeks later she described his impeachment vote as a \"wrongful decision\" and urged him to resign.",
    "The Ohio Senate race has become the second most expensive in the country this cycle, behind the showdown in the neighboring battleground state of Pennsylvania for another GOP-held open seat.",
    "The \"Protect Ohio Values\" super PAC is financed by a massive $10 million contribution from Vance’s old boss, billionaire venture capitalist, PayPal co-founder and Trump ally Peter Thiel.",
    "Timken, like Gibbons, Vance and Mandel, has also touted her support for the former president, with an ad in December titled \"America First\" describing her as a \"Trump conservative.\"",
    "The Marine veteran and social media pundit, who’s running a populist campaign, has explained that \"I think like a lot of conservatives in 2016, I’d been let down too many times.",
    "This week Timken spotlighted the endorsement of Trump 2016 general election campaign manager and White House senior adviser Kellyanne Conway, who previously had backed Moreno.",
    "The Buckeye State was once a premiere battleground in presidential contests and was the deciding state in then President George W. Bush’s razor-thin 2004 re-election.",
    "The Gibbons campaign told Fox News that \"we’re trying to make sure Ohio voters know what these candidates have said and what their real record is.\"",
    "It’s resulted in more than $16 million being dished out to date on the ad wars, with two and a half months still to go until Ohio's May 3 primary.",
    "But Trump won the state by eight points in his 2016 election to the White House and by the same comfortable margin in his 2020 re-election defeat.",
    "A pro-Vance super PAC went up last week with a large seven-figure ad blitz spotlighting the candidate’s conservative and populist credentials.",
    "And he’s noted that what \"changed my mind about Donald Trump more than anything is that I saw the corruption in our institutions.\"",
    "The commercial then uses a clip of Vance arguing that \"the elites plunder this country and then blame us for it in the process.\"",
    "Gibbons last week highlighted that Trump 2020 presidential campaign manager Bill Stepien was joining his team as a top adviser.",
    "Helping to fuel the fireworks – a GOP field chock-full of wealthy contenders who are also backed by well-financed super PACs.",
    "Gibbons' ad also targets Timken, who last year stepped down as Ohio GOP chair to launch her Senate campaign.",
    "But the eventual Democratic nominee will likely face somewhat of an uphill climb in Ohio’s general election.",
    "\"Jane Timken defended a RINO congressman after he impeached Trump,\" the announcer in the spot emphasizes.",
    "I didn’t think that any politician would deliver on their promises and President Trump proved me wrong.\"",
    "Vance called Donald Trump an idiot,\" says the announcer in the spot, which is running statewide in Ohio.",
    "The Democratic Senate primary – in comparison to the GOP slugfest – has been a sedate affair.",
    "The only candidate among the leading contenders in the race to succeed retiring GOP Sen.",
    "Fast-forward to today and the campaigns are continuing to tout their Trump connections.",
    "A Gibbons ad in December charged that Vance was \"cheering for the wrong team.\"",
    "In both states, nearly all the ad spending is on the Republican side.",
    "And the announcer showcases that \"Mike Gibbons is Trump tough.\"",
    "Vance and Jane Timken.",
    "\"J.D."
  ]
}