{
  "id": 11655,
  "mediaId": 2919,
  "date": "2022-03-28",
  "headline": "Ohio Democrats face off in U.S. Senate Primary Debate",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/993b62d/2147483647/strip/true/crop/2659x1396+75+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F08%2F29%2F5f7f41694f78bb0c964bcb641b26%2Fscreen-shot-2022-03-28-at-4.57.18%20PM.png",
  "link": "https://www.news5cleveland.com/news/politics/ohio-politics/ohio-democrats-face-off-in-u-s-senate-primary-debate",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morgan Trau",
  "authorUrl": "https://www.news5cleveland.com/morgan-trau",
  "termIds": [
    0
  ],
  "sentences": [
    "Main points of what she said:\n- We need to actually help Ohioans, not just care about money from special interest groups\n- We need to stop pushing the “moderate” candidate — because clearly that doesn’t work (referencing Ryan)\n- Medicare for all, no filibuster pic.twitter.com/rMhXsvgEyk\n— Morgan Trau (@MorganTrau) March 28, 2022\nRyan said: He has the experience to make changes due to his work in D.C. Making life better for Ohioans and the country is more important than Republican buzzwords, he said.",
    "“I will create policies that pull guns off the street and make our communities safe.”\nRyan on guns:\n“I again supported in the House of Representatives background checks, universal background checks, closing the Charleston loophole, closing the gun show loophole.”\nHarper on Ryan on guns:\n“My opponent, a former member of the NRA, former A-rating of the NRA and has blocked the ability to hold gun manufacturers accountable when mass shootings occur.",
    "She also wants to make sure that Ohio doesn't repeat the mistakes of the past 20 with all of the student debt by ensuring “debt-free training and educational opportunities for people to pursue four-year college degrees, vocational training and other training that they might need to be part of this workforce so that every Ohioan has.”\nFor Johnson: How do we combat gun violence?",
    "“I’ve committed to not accept any money from any sector, including the defense contracting sector that my opponent here today has taken over $400,000 from over the course of his career while we have seen so many, so much harm to our economy and our people here at home,” the attorney and former advisor for the Consumer Financial Protection Bureau said.",
    "“It's not about picking your voters as elected officials, it's about allowing the voters to pick you.”\nJohnson referenced that the filibuster has been used “historically to deny African-Americans social justice and civil rights.” The Republicans want to deter communities of color, seniors, LGBTQ+ community and students from voting, she added.",
    "“It is the right thing to do and also the economically efficient thing to do and how we begin to make sure that we have the resources to do that is by closing the tax loopholes that have allowed the same large multinational corporations that fund my opponent's campaigns to not pay their fair share.”\nHarper then brought up the Manchin PAC.",
    "“I have fought the Department of Defense on wasteful spending, including if it was an Ohio company.”\nHarper then responded that Ryan doesn’t actually need to take that money, which she said is really just bribes from corporations that are only “enriching defense contractors,” in Washington, D.C.",
    "But instead, I observed that special interests have infiltrated that place and have sometimes slowed progress.”\nShe then brings up how Ryan blocked her ability to protect the Black community from being imposed with higher car loan interest rates.",
    "He said he was for a “very comprehensive way to solve this problem.”\n“I think one of the issues I'm pushing now is how do we allow people to renegotiate down the interest rate that we don't need the banks benefiting from,” he said.",
    "“I am for getting rid of the filibuster – I think that can solve 90% of the problems that we have by passing legislation that we've passed out of the House to codify Roe v. Wade, the Women's Health Protection Act,” he said.",
    "Republican-led state legislatures have passed unprecedented measures that many believe are tools of voter suppression that give more partisan control over elections, Curtis Jackson, Spectrum News anchor and moderator said.",
    "“In regards to stacking the court, I think we need to tread lightly because if we expand the court as Democrats, then when Republicans come in, they'll expand the court and then the court will lose its power,” she said.",
    "“You want to bring jobs to Ohio and to the United States, I'll be your biggest friend.”\nThe next question asked what the candidates have done for citizens that made them think they were qualified to run for office.",
    "“I do think if you took out a loan, you should pay it but put more money in your pocket and that'll help you buy a car, buy a house and be able to reinvest back into the economy.”\nHarper got the same question.",
    "And though my opponent said that he was doing what he could to be able to pass that he accepted money from Joe Manchin PAC.”\nFor Johnson: How does she plan to address the increasing cost of healthcare?",
    "Ryan first went back to the Harper confrontation, saying that average Ohioans are working in the defense industries and he will always go to “bat for them.” He doesn’t agree with stacking the court.",
    "Harper started off talking about her history working at the Consumer Financial Protection Bureau during the Obama administration, going after big banks that caused the foreclosure crisis.",
    "“We need to make it functional, affordable and accessible and then take a viable system and then transition it into Medicaid for all with it, which is health care for all,” she said.",
    "“I will take on the pharmaceutical companies to bring down these escalating drug prices, deductibles and co-pays.”\nRyan was now able to respond to Harper’s Manchin PAC comment.",
    "@WEWS @OHDebates pic.twitter.com/3g0TTxxkRB\n— Morgan Trau (@MorganTrau) March 28, 2022\nRAPID-FIRE ROUND:\nDISCLAIMER: The candidates didn’t always answer the question.",
    "He supported the Build Back Better, which among other things, would repeal the SALT camp, disproportionately affecting homeowners in high-income home value states.",
    "The Ohio Debate Commission hosted a debate between U.S. Representative Tim Ryan (D-Niles), attorney Morgan Harper and IT executive Traci “TJ” Johnson.",
    "The Brookings Institution and the nonpartisan Tax Policy Center concluded that SALT deductions heavily favored the rich, so why did Ryan support it?",
    "“Look, I'm for the top 1%, the wealthiest paying more.”\nDem candidates at the debate are Congressman Tim Ryan, Morgan Harper and Traci \"TJ\" Johnson.",
    "COLUMBUS, Ohio — For one hour, three U.S. Senate hopefuls tried to prove to the public that they are the ideal candidate for the Democratic Party.",
    "Getting people back to work, making sure there is money going back into Ohioans’ pockets and defeating “Trumpism” are some of her goals, she said.",
    "It is a “real misunderstanding of what leadership should be and what it takes to have good economic development for the state of Ohio,” she said.",
    "Harper, acknowledging her history of being in the foster care system, worked her way up to Princeton University and then law school at Stanford.",
    "She wants every Ohioan to get a “fair shot.” Her beliefs are Medicare for all, an increase in minimum wage and protection of fundamental rights.",
    "“We need to balance it in, especially when we see what's happening right now with abortion access and their radical approach there,” she said.",
    "“Well, it also helped middle-class people,” he said, going into other aspects of the bill he supported – like paid family and medical leave.",
    "I call it Ohio Opportunity Guarantee.”\nShe wants to invest in creating up to 600,000 jobs in the clean energy sector over the next 10 years.",
    "In the opening remarks, Ryan emphasized the need to “shift the national perspective” on how the country and Ohio are going to move forward.",
    "“But I also witnessed that we could have been doing even more if we had members of Congress who were always on the side of working people.",
    "The state needs to lead the way in bringing the supply chain back, taking on China and building “the things that will build our future.\"",
    "With the war in Ukraine getting more severe, the first question to candidates asked if military action should be taken against Russia.",
    "The John R. Lewis Voting Rights Advancement Act of 2021 failed due to the Democrats being unable to overcome a Republican filibuster.",
    "She worked for the Office of Budget and Management and worked for the Ohio Attorney General’s Office Consumer Protection Division.",
    "“We need to create economic opportunity for people all over Ohio and make sure that we can be a state of the future,” she said.",
    "We have to move boldly to be able to protect our communities and keep them safe harbor.”\nEach candidate did a brief press Q&A.",
    "“We need to do what every other developing country on this planet has done and provide health care for everyone,” she said.",
    "We need to codify Roe v. Wade into law, and we need to make sure that we get rid of the filibuster to make that possible.\"",
    "Ryan said he was proud of fighting against every trade agreement that came down the pipe except for renegotiating NAFTA.",
    "He fought tax cuts for the wealthiest people on numerous occasions and helped pass the Affordable Care Act, he said.",
    "She then went on to talk about the Supreme Court, while also mentioning corporate money is not a necessity to Ryan.",
    "“I welcome support from anybody who wants to support my campaign, and I think she made the case there,” he said.",
    "Harper said: She believes in actually helping Ohioans, not just caring about money from special interest groups.",
    "“One additional thing on Build Back Better, which, you know, I would have supported, but why did that not pass?",
    "“I don't think we need to waste money, but I don't think we should immediately be pulling the plug,” he said.",
    "She also worked for the Environmental Protection Agency, among other committees dedicated to LGBTQ+ rights.",
    "She wants to stop pushing the “moderate” candidate — because clearly, that doesn’t work (referencing Ryan).",
    "The candidates were asked if they opposed removing the filibuster and advancing voting rights legislation.",
    "Johnson agreed, saying the court is unbalanced due to former president Donald Trump stacking the court.",
    "“We got $12 billion back to 28 million consumers around the country, including here in Ohio,” she said.",
    "“Look, if you want to take jobs out of Ohio and out of the country, I'll be your worst enemy,” he said.",
    "Hello from @CentralState87 – the U.S. Senate primary debates hosted by @OHDebates are happening today!",
    "Harper believes in stacking the court, “re-calibrating” the system and getting rid of the filibuster.",
    "So I don't know quite what the criticism is here.”\nFor Ryan: What can be done about student loans?",
    "The debate was held at Central State University's Paul Robeson Cultural & Performing Arts Center.",
    "Harper agreed that she wanted to get rid of the filibuster to be able to protect voting rights.",
    "Johnson acknowledges that Putin is unchecked and stated her support for the current sanctions.",
    "?https://t.co/P6XCX1eUNy pic.twitter.com/iAkaM8jBln\n— Morgan Trau (@MorganTrau) March 28, 2022",
    "It's because of senators like Joe Manchin, who obstruct, even though they're in our party.",
    "The Congressman responded that he is going to “fight like hell” for workers and not CEOs.",
    "Harper believes in economic sanctions but is more cautious than Ryan in military action.",
    "Johnson is focusing on workers’ rights, the right to choose and criminal justice reform.",
    "We chose the portion of their statements that most closely aligned with the question.",
    "Ryan responded that the defense industry provides tens of thousands of jobs in Ohio.",
    "I'll be giving you brief updates on where the candidates stand on each question.",
    "Johnson said: She is pro-gun, but change needs to happen to combat gun violence.",
    "Johnson said she has spent a lifetime fighting for Ohioans in state government.",
    "The next question revolved around voting rights, accessibility and suppression.",
    "Ryan supports helping Ukraine and sending airplanes to help the NATO ally.",
    "Democrats are up at 11:30 a.m. Republicans at 7 p.m.\nWatch live on @WEWS ?",
    "He helped save the pension by working with Sen. Sherrod Brown, he said.",
    "Ryan “supported proudly” the bill and would plan on passing it again.",
    "“It is necessary that we both rebalance the Supreme Court, expand it.",
    "“She also said that I wasn't doing what Joe Manchin wanted me to do.",
    "She will be pushing for Medicare for all and killing the filibuster.",
    "For Harper: How does she plan on paying for Medicare for All?",
    "Ryan doesn’t want to stack the courts, neither does Johnson.",
    "She said if it comes down to it, then she would support it.",
    "She said she knows what is “at stake” with this election.",
    "Each candidate brought up their concern for Roe V. Wade.",
    "She also addressed anxiety about speaking at the debate.",
    "He is focused on job growth, economy and union workers.",
    "She does say that American troops need to be kept safe.",
    "Ryan added that he wants to get rid of the filibuster.",
    "The next revolved around Supreme Court reform.",
    "She wants to bring back respect to politics.",
    "“This is about playing fair,” he said.",
    "The next question was just for Ryan.",
    "“And what can that future look like?",
    "Harper then took a shot at Ryan.",
    "Here were the main points.",
    "We cannot live like this.",
    "She didn’t specify how.",
    "Finally, @mh4oh.",
    "??"
  ]
}