{
  "id": 11894,
  "mediaId": 8379,
  "date": "2022-03-27",
  "headline": "Ryan, Harper duel with different Democratic visions in Ohio Senate debate",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/03/johnson-harper-ryan.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/your-local-election-hq/ohio-democrats-running-for-u-s-senate-debate-for-first-time-monday/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Orner",
  "authorUrl": "https://www.nbc4i.com/author/ben-orner/",
  "termIds": [
    0
  ],
  "sentences": [
    "Ryan said Jackson is the “epitome” of a prospective justice because of her “record of working on behalf of working people, a record of protecting Roe v. Wade (and) always considering all different aspects and families who would be potentially affected by the decisions.”\nJohnson said lawmakers should “tread lightly” with the idea of expanding the court.",
    "Ryan said he and his wife are still paying off their student loans but noted, “I do think if you took out a loan you should pay it.” He said interest rates are too high and borrowers should be able to renegotiate rates down to “1 or 2%.”\nJoe Biden, as a candidate, promised to cancel $10,000 of debt per borrower.",
    "On issues like military intervention, the Supreme Court and student loan debt, Youngstown-area U.S. Rep. Tim Ryan, in office since 2003, and Morgan Harper, a former consumer advocate in the Obama administration, gave Democratic voters two liberal but contrasting platforms for the May 3 election.",
    "She said she supports Biden’s military, economic and humanitarian response, and she said of Putin, “We have to end his reign of terror.”\nHarper’s and Ryan’s more polished performances most of the debate, however, separated themselves from Johnson, who said Monday was her first political debate.",
    "And then the court will lose its power,” she said, adding that courts need to be “fair” and “reflective of the people in our country.”\nStudent loan debt\nHarper and Ryan also disagreed on how to reduce student loan debt, which has eclipsed $1.7 trillion among government and private borrowers.",
    "“These are business that, of course I’m going to work with them.”\nExpanding the Supreme Court\nWith the U.S. having a 6-to-3, conservative-majority Supreme Court whose decisions often do not reflect public opinion, candidates were asked whether the bench needs reformed.",
    "Harper hits special interests\nUsing Ryan as a brush, Harper painted Capitol Hill throughout the debate as being “infiltrated by special interests.” Her Washington experience includes three years as a senior advisor at the Consumer Financial Protection Bureau.",
    "WILBERFORCE, Ohio (WCMH) – A 20th-year Congressman and a progressive Columbus attorney separated themselves in Ohio’s Democratic U.S. Senate primary, offering dueling mainstream and reformist ideas from the same side of the political aisle in a Monday debate.",
    "The Congressman also said Ohio has “tens of thousands of jobs that are directly connected to the defense industry.”\n“And I don’t think we need to waste money, but I don’t think we should immediately be pulling the plug,” Ryan said.",
    "“But we also have to keep in mind about what we’ve been through over the last 20 years as a country, where we have seen a lot of military intervention that perhaps moved too quickly without always having the full information.",
    "“But instead, I observed that special interests have infiltrated that place and sometimes slowed progress.”\nDuring Harper’s answer on Ukraine, she dinged Ryan for accepting campaign funding from defense companies.",
    "Increasing U.S. involvement in Ukraine\nAn issue looming over Russia’s invasion of Ukraine is whether Article 5 of NATO’s treaty will be invoked, calling the U.S. and other members to directly defend Ukraine.",
    "“And I want to be clear-headed to make the right decisions for our foreign policy.”\nThe third candidate on the stage, Columbus community activist Traci Johnson, did not directly answer the Ukraine question.",
    "Harper called for a “strong response” from the U.S. that includes “aggressive economic sanctions” and diplomatic solutions, but she did not commit to voting for Biden’s hypothetical request to join the war.",
    "The Congressman mentioned two examples: A bill to write Roe v. Wade into law and the John Lewis Voting Rights Act, which includes allowing voter registration on Election Day and making the day a holiday.",
    "“It should either be reformed or eliminated,” Johnson said of the filibuster after saying it has historically been used to block legislation that would help Black Americans, especially on voting rights.",
    "Ryan told moderator Curtis Jackson that President Joe Biden should come to Congress and ask for military authorization, and he said he would support the U.S. joining the war.",
    "“I think that can solve 90% of the problems that we have by passing legislation that we’ve passed out of the House … that goes to the Senate to die,” Ryan said on the issue.",
    "Polling and next debates\nIn the only poll of the race, an Emerson College survey commissioned by NBC4 a month ago, Ryan got 31% of the vote, while 51% were still undecided.",
    "The Democratic candidates for governor, former Cincinnati mayor John Cranley and former Dayton mayor Nan Whaley, will take the stage Tuesday night from 7 p.m. to 8 p.m.",
    "“And I think we actually need to do more.”\nThe Congressman added that includes sending U.S. warplanes to Ukraine but does not include setting up a no-fly zone.",
    "“We need to cancel the debt,” Harper said of this “multigenerational crisis,” but she wasn’t specific on which loans or which degree levels should be forgiven.",
    "“I believe that we need to nominate justices like Judge (Ketanji Brown) Jackson,” for whom the Senate has been holding confirmation hearings this month.",
    "Harper said she supports expanding the number of justices, something that was last tried by President Franklin Roosevelt and has no law preventing it.",
    "“I also witnessed we could be doing even more if we had members of Congress who were always on the side of working people,” she said.",
    "The most recent polling shows Cleveland investment banker Mike Gibbons and former state Treasurer Josh Mandel as the frontrunners.",
    "Harper said she “wholeheartedly” supports getting rid the Senate rule that allows one lawmaker to stall debate on a bill.",
    "Johnson stumbled and lost her words multiple times, especially when describing her years working for state agencies.",
    "In rebuttal, Ryan noted his public displeasure 20 years ago with the Iraq War and the trillions of dollars it cost.",
    "Johnson, Harper, and LaShondra Tinsley (who was later disqualified from the ballot) pulled in single digits.",
    "Ending the filibuster\nHarper and Ryan did, however, agree on at least one issue: ending the filibuster.",
    "“I’m going to breathe because cameras intimidate me,” she said while collecting her thoughts.",
    "“If we expand the court as Democrats, then as Republicans come in, they’ll expand the court.",
    "Those seven GOP candidates will take the same stage Monday night from 7 p.m. to 8:30 p.m.",
    "He’s a killer, he’s a war criminal and he is slaughtering innocent people,” Ryan said.",
    "The winner of the May 3 primary will face the winner of a crowded Republican side.",
    "As president, he has delayed when payments are due, citing the COVID-19 pandemic.",
    "“I would certainly be willing to consider that if it comes to it,” Harper said.",
    "She added Roe v. Wade should be written into law to protect abortion rights.",
    "“Look, (Russian President Vladimir) Putin is a butcher.",
    "Watch the full debate in the video player above.",
    "“I am not for stacking the court,” Ryan said."
  ]
}