{
  "id": 12132,
  "mediaId": 2551,
  "date": "2022-03-27",
  "headline": "'Any 10-year-old could see this was wrong': Scared doctors and cunning coaches are turning NRL's concussion policy into a FARCE – while a Storm enforcer dodges punishment for a sickening shot, writes MIKE COLMAN",
  "image": "https://i.dailymail.co.uk/1s/2022/03/28/02/55879939-0-image-a-22_1648429367999.jpg",
  "link": "https://www.dailymail.co.uk/sport/nrl/article-10658137/Scared-doctors-cunning-coaches-turning-NRLs-concussion-policy-FARCE.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Colman For Daily Mail Australia",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Mike+Colman+For+Daily+Mail+Australia",
  "termIds": [
    0
  ],
  "sentences": [
    "+4\nView gallery\nJeremiah Nanai (centre) of the Cowboys celebrates scoring a try with team mates during the Round 3 NRL match between the Brisbane Broncos and the North Queensland Cowboys\nThey were superb right across the park, with Jason Taumalolo and Valentine Holmes both having their best games for two years, three-try teenager Jeremiah Nanai shining like a new penny and Broncos' discard Tom Dearden having a dream return to Suncorp with a try and three assists.",
    "+4\nView gallery\nJaydn Su'A is sent to the sin bin for a high shot and was given a one-match ban by the NRL's match review committee after collecting Shark Dale Finucane with a shoulder to the head\nIn Thursday night's rainswept St George Illawarra versus Cronulla clash, the Dragons' Jaydn Su'A was reported and copped 10 minutes in the sinbin for what referee Gerard Sutton described as a 'shoulder to the head' of the Sharks' Dale Finucane.",
    "Rudiger calls time on Chelsea\nPlay\n0:00\n1:32\nFull screen\nUnmute\nChelsea have a significant gap in their defence with the departure of Antonio Rudiger\nMann sank to his haunches holding the affected area and, after being assessed by the team trainer, hobbled back into position still clutching the front of his shorts.",
    "+4\nView gallery\nStorm prop Nelson Asofa-Solomona was not sin-binned and only received a $1000 fine despite clearly hitting Parramatta player Makahesi Makatoa in the head\nMidway through the second half following a scuffle in a tackle, Makatoa had goaded Asofa-Solomona by clapping his hands in his face.",
    "That's not to suggest Manly coach Des Hasler instructs his players to attempt to fool the bunker doctors, any more than Knights coach Adam O'Brien would tell Kurt Mann to clutch his wedding tackle when hit on the head, but you can't blame the medicos for being suspicious.",
    "As in, the NRL being so spooked by the possibility of being sued for lack of care over the long-term effects of head injuries that they have instructed their doctors to come down hard on anything that even resembles the slightest possibility of a potential concussion.",
    "+4\nView gallery\nNewcastle player Kurt Mann is told to get a head injury assessment after taking a knock to his testicles in their loss to the Penrith Panthers\nAs Steve 'Blocker' Roach, calling the game for Fox, put it, 'It's a long way from the head.'",
    "The irony of the whole HIA controversy is that while the NRL is obsessed with players not staying on the field after suffering a concussion, they seem to have dropped the ball when it comes to preventing players getting concussed in the first place.",
    "With their team undefeated after two rounds, starry-eyed Broncos supporters were declaring that they were back, Kevvie Walters was a genius, Adam Reynolds walked on water and Selwyn Cobbo was GI, Latrell and The Pearl all rolled into one.",
    "After the game, Fox panelist Cooper Cronk made the point that for a doctor to decide whether a player needed to be checked for a head injury, they would have to be at the ground - not, as in Mann's case, 200km away in Sydney.",
    "But in all fairness the award must go to Reynolds who was bought by the club to hold things together under pressure, yet twice kicked the ball out on the full and was totally outplayed by his opposite number Chad Townsend.",
    "And the doctors being so spooked by the possibility of being hoodwinked by coaches instructing their players to hide the symptoms of head injury, that they call for an HIA regardless of where the player claims to be hurt.",
    "https://t.co/7yN1kEqZRF\n— The Mole (@9_Moley) March 27, 2022\nAlerted by the bunker, Klein called out to Asofa-Solomona that he was on report, but there was no penalty awarded, let alone a sinbinning or send-off.",
    "How any medico could look at the injury sustained by the Knights' Kurt Mann at Bathurst when he tackled Scott Sorensen and determine that he needed to leave the field for a head injury assessment is beyond me.",
    "The footage could not have been clearer: Mann was one of three Knights players in the tackle and as they attempted to pull Sorensen down, he lashed out and accidentally kicked Mann between the legs.",
    "The incident occurred when ballcarrier Finucane charged at a stationary Su'A and dropped his body height to brace at the point of impact, causing his head to collide with Su'A's shoulder.",
    "Cobbo was twice forced back into the in-goal to give possession back to the Cowboys, Kurt Capewell was all but unsighted and Kotoni Staggs twice dropped the ball cold as a spud.",
    "But round three wasn't all about high shots and the bunker, there was also some pretty good footy played – the best of it by the Cowboys against the Broncos at Suncorp Stadium.",
    "In the lead-up to the game, Cowboys' coach Todd Payten revealed that he'd had an opportunity to negotiate for Reynolds' services last year but chose to sign Townsend instead.",
    "Three minutes later, as Makatoa was being pulled down by two Storm tacklers, Asofa-Solomona came in late and smashed him on the back of the head with a swinging forearm.",
    "But if Su'A deserved 10 minutes in the bin, the Storm's Nelson Asofa-Solomona should have been sent off for his hit on Parramatta's Makahesi Makatoa on Saturday night.",
    "We saw it last week in the Manly-Roosters game when Sea Eagles centre Morgan Harper was obviously hit in the head but clutched his shoulder when the trainer ran on.",
    "I don't know who the doctor was that the NRL had in the bunker for the Newcastle-Penrith game on Saturday, but I wouldn't want them taking out my appendix.",
    "When I replayed the incident for a medical expert the next day their considered diagnosis was, 'Any 10-year-old kid could see he was kicked in the nuts.'",
    "Michael Ennis spotted it from all the way up in the commentary box, but referee Ashley Klein, a few metres away from the play, missed it.",
    "A couple of minutes later, referee Peter Gough stopped play, called Mann out and told him, 'Kurt, the injury bunker has come through.",
    "It's a fair point but given the HIA shemozzle of the first two rounds, you have to wonder if there might be a little more to it.",
    "The only thing more surprising was the fact that a doctor in the bunker didn't send out the hook and make Makatoa have an HIA.",
    "On the other side of the ledger, it is a tough call to decide which of the Broncos' big names had the worst game.",
    "It could have just been a report and penalty but even so, the Dragons had little to complain about.",
    "You'd have to think that come fulltime on Sunday afternoon he wasn't regretting his decision.",
    "A grade one careless tackle, which brings a $1000 fine with an early guilty plea.",
    "Who can forget the clampdown on high shots during the Magic Round last season?",
    "'It's a swinging arm and he's had time to plant himself and plan it.",
    "After the incident was replayed, he was adamant it was.",
    "'It's direct contact to the back of the head,' he said.",
    "It was lineball who was more confused, Mann or the ref.",
    "It didn't take the Cowboys long to spoil the party.",
    "Apart from some of the referees I mean.",
    "So how could the doctor make that call?",
    "Chances are I'd end up with a boob job.",
    "You have to leave the field, mate.'",
    "Imagine if Radley did that!!!",
    "'Is that not a sin bin?'",
    "It's deliberate.'",
    "And the charge?",
    "Ennis asked."
  ]
}