{
  "id": 12300,
  "mediaId": 8480,
  "date": "2022-03-28",
  "headline": "Democratic US Senate candidates push for change in Ohio",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/Debate.png?w=1280",
  "link": "https://www.wdtn.com/news/your-local-election-hq/democratic-us-senate-candidates-push-for-change-in-ohio/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Ashley",
  "authorUrl": "https://www.wdtn.com/author/madeline-ashley/",
  "termIds": [
    0
  ],
  "sentences": [
    "Harper followed by assuring voters she’d be the right woman for the job, “I wanna be your next United States Senator to make sure we have Medicare for all, increase the minimum wage, and protect our fundamental rights.”\nCandidate Johnson vowed to defeat what she called ‘Trumpism’ while uplifting and and unifying Ohioans.",
    "Following opening statements, debate questions involved the war in Ukraine, which left all three candidates agreeing that Russian President Vladimir Putin should be taken down, and supporting President Biden if he decides to take action.",
    "“That is why I’ve committed to not accept money from any sector including the defense contracting sector that my opponent here today has taken over $400,000 dollars from over the course of his career,” Harper said.",
    "The Democratic Candidates that attended, Ohio Congressman Tim Ryan, Attorney Morgan Harper, and Businesswoman Traci Johnson, all gave opening statements in an attempt to attract voters.",
    "“Rebalance the Supreme Court, expand it, codify Roe v. Wade into law, and we need to make sure we get rid of the filibuster to make that possible,” Harper said.",
    "Senator Primary debate held at Central State University in Wilberforce on Monday saw three candidates hopeful to succeed the current Republican U.S. Sen.",
    "Congressman Ryan provided a rebuttal, claiming Harper’s claims pointless, and supporting people’s decision to support his campaign financially.",
    "“Joe Mansion wants to help another democrat in the state that borders his…I just don’t see what the criticism is,” Ryan said.",
    "Johnson, Harper, and Congressman Ryan all also agreed that confirming Judge Kentanji Brown Jackson would be a good move.",
    "The Ohio Republican U.S. Senate candidates will have their Primary Election debate Monday night.",
    "The hour and a half debate will be moderated by Karen Kasler of the Statehouse News Bureau.",
    "Senator, he’d go to Washington DC to lead not only Ohio, but the country in a positive way.",
    "However, Harper took things to the next level, hinting at packing the courts.",
    "Harper also didn’t hold back, putting the heat on Congressman Ryan.",
    "Now he’s threatening weapons of mass destruction,” Johnson said.",
    "Congressman Ryan ensured voters if he became Ohio’s next U.S.",
    "WILBERFORCE, Ohio (WDTN) — The Democratic U.S.",
    "The debate will begin at 7 p.m. on March 28.",
    "“We have to end his reign of terror.",
    "Rob Portman."
  ]
}