{
  "id": 12303,
  "mediaId": 6413,
  "date": "2022-03-22",
  "headline": "March Country Rookie of the Month: Carter Faith",
  "image": "https://www.billboard.com/wp-content/uploads/2022/03/carter-faith-credit-alexa-kinigopoulos-2022-billboard-1548.jpg?w=1024",
  "link": "https://www.billboard.com/music/country/march-country-rookie-carter-faith-1235045972/",
  "mediaOutlet": "Billboard",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessica Nicholson",
  "authorUrl": "https://www.billboard.com/author/jessica-nicholson/",
  "termIds": [
    0
  ],
  "sentences": [
    "Last year, Carter Faith hit three major life milestones: The North Carolina native not only graduated from Nashville’s Belmont University, but she made her debut performance at the Ryman Auditorium and released her six-song EP Let Love Be Love, via Pound It Out Loud Entertainment.",
    "It also gave me a launching pad and a family of others who want to be writers to feel comfortable with before you get thrown into Music Row, which is a whole different ballgame.",
    "Billboard spoke with Faith about her journey to Nashville, her new track “Greener Pasture,” and her affinity for singer-songwriters including Kacey Musgraves and Natalie Hemby.",
    "[A&R Directors] Roxy King and Zach Lund reached out and loved what I was writing.”\nEach song on her recent EP showcases Faith’s vivid, mature lyrics and soft, lilting twang.",
    "This past week or two I’ve been feeling so creatively inspired, just thinking about songs I could put on another EP or just as singles.",
    "“After I released the EP, it was really cool to see people in town that I looked up to really respond to it,” Faith tells Billboard.",
    "I kept coming back to this Morgan Harper Nichols poem called “Let July Be July,” about just letting things in life be as they are.",
    "I love Kacey Musgraves as an artist and I would love to sit in a room with her and hear how she turns a lyric and crafts a melody.",
    "Now, Faith has inked a music publishing deal with Universal Music Publishing Group Nashville, Billboard can exclusively reveal.",
    "It didn’t come from the most personal place — it was more lyric nerds getting into the room and trying to make a cool story.",
    "She recently opened shows for Russell Dickerson and has set tour dates with Kip Moore and Caitlyn Smith in the weeks ahead.",
    "[Whiskey Jam founder] Ward Guenther just cultivates this amazing community and you just want to support the other writers.",
    "Right now, I’m so focused on to getting to share the music that is already out there and to keep building my audience.",
    "I love when people discover something about themselves and it makes them feel comforted about the world they are in.",
    "We’re all trying to do this crazy dream and it’s going to get competitive at times, but you don’t feel that there.",
    "“They were willing to write with me and I would just randomly get set up to write with people at UMPG.",
    "It feels like you walk in and everyone’s guard is down and you can just be there for the music.",
    "Those are the two things I love: rootsy country music, and then pop music that can be escapist.",
    "I grew up in the backseat of the car listening to music or to cassettes my grandpa would play.",
    "My aunt gave me a hand pillow that’s stuffed with lavender and it’s become like a lucky charm.",
    "I tried also to just reach out to writers in Nashville to co-write and that helped as well.",
    "I was inspired by that and it was this great reminder to slow down and appreciate things.",
    "You made your debut at the Ryman Auditorium for the 10th anniversary of Whiskey Jam.",
    "I feel like every song of hers is different, but you still hear her mark on it.",
    "You recently released a new track, “Greener Pasture.” How did that come about?",
    "I would love to just even be a fly on the wall, hearing either of them write.",
    "No song I turned on was making me feel better, so I had to write one myself.",
    "You have to put into it what you want to get out of it, like with anything.",
    "My whole family got to come see me sing at the Ryman and it was surreal.",
    "Then Taylor Swift came onto the scene and I wanted to pick up a guitar.",
    "She’s totally forging a new path of music, and that’s what legends do.",
    "I love “Get Into It.”\nIf you were not doing music, what would you do?",
    "You just get to go jam out and support other people who enjoy music.",
    "But as you are writing it, you realize just how relatable it is.",
    "I think fashion influences so much of the world that we live in.",
    "He’s from where I’m from, me and my dad loves his music, too.",
    "I remember doing cover shows at a little bar in my hometown.",
    "I remember sitting on my bed and I was upset about a guy.",
    "How did that help you build upon your skills as a writer?",
    "All of the showcases and meetings, it was all networking.",
    "I never thought about being a songwriter, I just did it.",
    "They are such great writers but I just love that song.",
    "I wrote that with Tofer Brown and Lauren Hungate.",
    "You co-wrote all five songs on Let Love Be Love.",
    "When did you realize you wanted to pursue music?",
    "What artists would you love to collaborate with?",
    "I just randomly wrote a song one day at 16.",
    "I am also such a big fan of Natalie Hemby.",
    "What was your first concert you ever saw?",
    "What do you recall about that experience?",
    "What are your on-the-road essentials?",
    "I love how versatile her writing is.",
    "My first concert was Hannah Montana.",
    "You studied songwriting in college.",
    "What’s your favorite Doja Cat song?",
    "What was the first song you wrote?",
    "The pop scene is really fun, too.",
    "Or, I would be a psychologist.",
    "What inspired the title track?",
    "It helped me build confidence.",
    "Who are your dream co-writers?",
    "I love how it stays grounded.",
    "It was nothing I had planned.",
    "I’m obsessed with Doja Cat.",
    "And then, Kacey of course.",
    "I was like 7 years old.",
    "My family loved music.",
    "What is ahead for you?",
    "I would be a stylist.",
    "I love Eric Church."
  ]
}