{
  "id": 12989,
  "mediaId": 2641,
  "date": "2022-02-28",
  "headline": "Poll: Gibbons Leads GOP Primary for Ohio Sen. Portman's Seat",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=b1d028aa-f1a2-45f4-8482-6e213eebf770&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/poll-ohio-gop-primary-senate-seat/2022/02/28/id/1058879/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Freeman",
  "authorUrl": "",
  "termIds": [
    5581,
    4839,
    3475,
    2290,
    2736,
    1489,
    1126,
    6244,
    6718,
    6474
  ],
  "sentences": [
    "The GOP primary sample consisted of 410 voters with a margin of error of 4.8 percentage points, while the Democratic primary sample had 313 voters with a margin of error of 5.5 percentage points, and the general election sample was 723 voters with a margin of error of 5.5 percentage points.",
    "When asked, however, if an endorsement from former President Donald Trump would make voters more likely to support that candidate, 62% of Republicans said it would, 18% said it would make them less likely to back the endorsed candidate and 21% said it would make no difference.",
    "However, the survey's results raise questions about the importance of Portman's endorsement, with 38% saying his support makes them less likely to back Timken, while 43% said it makes no difference and only 19% saying it makes them more likely to vote for Timken.",
    "In the Democratic primary, Rep. Tim Ryan holds a large advantage at 31%, with tech executive Traci Johnson and social worker LaShondra Tinsley both at 5%.",
    "In one of the most closely watched Senate races, investment banker Mike Gibbons leads the Republican primary field to fill retiring Ohio Sen.",
    "Vance is third in the survey with 8%, while former state GOP Chair Jane Timken and state Sen. Matt Dolan each have 6% support.",
    "Former senior adviser at the Consumer Financial Protection Bureau Morgan Harper is at 4%, while a whopping 51% are undecided.",
    "However, 39% of the respondents in the poll were undecided, emphasizing the general consensus that the race is up for grabs.",
    "Gibbons is in first place with 22%, while former state Treasurer Josh Mandel is in second with 15%.",
    "Rob Portman's seat, according to a poll from The Hill/Emerson College poll released on Monday.",
    "Joni Ernst (Iowa), Shelley Moore-Capito (West Virginia) and Deb Fischer (Nebraska).",
    "President Joe Biden's approval rating is at only 40%, with 54% disapproving.",
    "The survey was conducted after Portman endorsed Timken to be his successor.",
    "Following that, Timken received backing as well from Sens.",
    "The poll was conducted on February 25-26.",
    "Author and businessman J.D."
  ]
}