{
  "id": 1393,
  "mediaId": 2573,
  "date": "2022-02-14",
  "headline": "Super PAC spending $1.4 million to reintroduce J.D. Vance to Ohio voters in GOP Senate showdown",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/vance.jpg",
  "link": "https://www.foxnews.com/politics/super-pac-spending-1-4-million-to-reintroduce-j-d-vance-to-ohio-voters-in-senate-gop-showdown",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5660,
    2939,
    4306,
    2765,
    280,
    976,
    1126,
    1489,
    6474
  ],
  "sentences": [
    "The Republican field also includes former Ohio treasurer and former two-time Senate candidate Josh Mandel; former Ohio GOP Chair Jane Timken; 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer and investment banker; and state Sen. Mike Dolan, a former county chief assistant prosecutor and state assistant attorney general whose family owns Major League Baseball’s Cleveland Guardians, who until last year were known for more than a century as the Indians.",
    "OHIO GOP SENATE SHOWDOWN: DOLAN GOES UP WITH A SECOND MASSIVE 7-FIGURE AD BUY\nVance, who along with most of the top contenders in the GOP primary has showcased his support for Trump and his polices in hopes of landing the former president’s endorsement, came under attack after entering the race last summer for his past criticisms of Trump during the 2016 presidential campaign.",
    "The new ad buy by the super PAC, as well as a seven-figure ad blitz by Dolan that was first reported earlier Monday by Fox News, are the latest sign that in a primary race where all nearly all the major contenders have plenty of personal wealth or are backed by well-financed outside groups, ad spending is soaring.",
    "Fabrizio, who polled for former President Donald Trump’s 2016 and 2020 campaigns, argued that Vance \"needs a course correction ASAP\" due to a \"precipitous decline\" since last autumn in Ohio’s crowded and competitive GOP Senate primary in the race to succeed retiring Republican Sen.",
    "TRUMP HELPS CLEAR THE FIELD IN OHIO'S CROWDED SENATE GOP PRIMARY\nThe ad concludes with a clip of Vance in an interview on Fox News’ \"Tucker Carlson Tonight,\" with the prime-time host telling the candidate that \"you really, I think, understand what’s gone wrong with the country.\"",
    "The launch of the new spot, which started airing on Friday and is expected to run for two weeks, comes in the wake of a warning from veteran GOP pollster Tony Fabrizio, who worked for the super PAC before transferring over to Vance’s Senate campaign.",
    "According to figures from the national ad tracking firm AdImpact, nearly $16 million had been spent through Thursday by the campaigns and super PACs to run ads in the Ohio Senate race, with nearly all the spending coming in the GOP primary.",
    "But a source with knowledge of the super PAC’s strategy indicated that the positive reinforcement ad of the best-selling author of the \"Hillbilly Elegy\" memoir \"was motivated by strategic considerations, not the news cycle.\"",
    "Ryan is considered the favorite for the Democratic nomination in race that also includes progressive Morgan Harper, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "Vance tells Fox News it is spending seven figures to run a new ad that reintroduces the best-selling author and venture capitalist to voters in Ohio with less than three months to go until the state’s primary.",
    "The Ohio Senate race to date is the second most expensive in the country this cycle, behind the showdown in the neighboring battleground state of Pennsylvania for another GOP-held open seat.",
    "The pollster’s presentation, which was first reported by Politico, spotlighted that polling conducted in January noted that \"driving his negatives is the perception that he is anti-Trump.",
    "The commercial then uses a clip of Vance, who has run a populist-themed campaign, arguing that \"the elites plunder this country and then blame us for it in the process.\"",
    "Republican operative Luke Thompson, who works for \"Protect Ohio Values,\" tells Fox News that the new ad buy \"is just the beginning\" ahead of Ohio’s May 3 primary.",
    "The group was fueled last summer by massive a $10 million contribution from Vance’s old boss, billionaire venture capitalist and PayPal co-founder Peter Thiel.",
    "The \"Protect Ohio Values\" super PAC tells Fox News that they are spending roughly $1.4 million to run the ad statewide in Ohio on TV and online.",
    "The winner of the May 3 Republican primary may face off against longtime Democratic Rep. Tim Ryan of northeastern Ohio.",
    "Vance is sending a message,\" the narrator in the emphasizes.",
    "A super PAC supporting Republican Senate candidate J.D.",
    "This has only grown.\"",
    "Rob Portman.",
    "\"J.D."
  ]
}