{
  "id": 14023,
  "mediaId": 8497,
  "date": "2022-03-16",
  "headline": "Commitment 2022: Tim Ryan campaigning for U.S. Senate",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ap21286686905365.jpg?crop=1.00xw:0.846xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/commitment-2022-tim-ryan-campaigning-for-us-senate/39398745",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John London",
  "authorUrl": "https://www.wlwt.com/news-team/0e331c55-fcf7-4f86-b314-3917d61a0129",
  "termIds": [
    0
  ],
  "sentences": [
    "With Rob Portman's seat opened up, the GOP will go all-out to try to hang onto it while the Democrats sense an opportunity to pair Ryan and Senator Sherrod Brown as Ohio's working-class Capitol Hill tandem.",
    "His statewide campaign approach would be needed right away if he wins in May because the state has tilted towards the Republicans in statewide elections.",
    "On the campaign trail, Ryan hits a lot of places like Fringe Coffeehouse in downtown Hamilton which was packed with his supporters the other day.",
    "\"Ninety percent of our generic drugs come from China,\" he told the coffeehouse crowd, pausing a beat before launching into a connecting line.",
    "Ryan hopes to make that happen by keeping his message as regular as a basic cup of coffee — a working-class cup of jobs and economy.",
    "\"One percent of our GDP on infrastructure,\" he said in his remarks to fellow Democrats who routinely nod or applaud in agreement.",
    "It is just on the outskirts of the downtown district in Hamilton, one of many Ohio towns that once had manufacturing muscle.",
    "Ohio's Democratic Party is staying neutral in the gubernatorial primary, but not so much in the race for the U. S. Senate.",
    "The Northeast Ohio Democratic Congressman who wants to be Senator was already considered the likely Democratic nominee.",
    "Ryan talked about how lost manufacturing jobs and self-defeating trade policies seem both genuine and strategic.",
    "So, he's traveling to places like Hamilton to try to recapture a natural constituency — the average worker.",
    "Tim Ryan now has his party's formal endorsement over his progressive primary opponent Morgan Harper.",
    "Ryan seemed to be taking nothing for granted even though most Democrats see him as the frontrunner.",
    "As a Democrat with an appeal to blue-collar workers, Ryan once stood on solid Northeast Ohio soil.",
    "\"Look people in the eye, tell 'em I give a damn about 'em and here's my plan to help,\" Ryan said.",
    "He is a known quantity and well-regarded by top establishment leaders in the Democratic Party.",
    "And I supported those initiatives because they're in the best interest of the country.\"",
    "He said the state and the country need to be about shop class, not culture wars.",
    "His 48-year-old eyes have fixed on the economic wreckage of the middle class.",
    "His tough talk about trade policies with China comes with comparisons.",
    "\"China spends 7-9% of their GDP on infrastructure every single year.\"",
    "But former President Donald Trump won his region and the state twice.",
    "He has proposed a party re-alignment around pocketbook issues.",
    "\"Trump wasn't wrong on everything,\" he said in an interview.",
    "\"He was right on China, he was right on renegotiating NAFTA.",
    "So far, he has been to 80 of the state's 88 counties.",
    "So, he brings what he called a \"no-bull\" approach.",
    "Ohio Democrats were once considered reliable.",
    "To win, he must appeal to those very voters.",
    "So, I'm talking to you again as an American.",
    "\"Like, what the hell are we thinkin'?",
    "Both parties are at fault for this.",
    "We got to get our act together.\"",
    "Broadband, not bandwagons.",
    "What the hell?"
  ]
}