{
  "id": 14255,
  "mediaId": 8323,
  "date": "2022-03-21",
  "headline": "‘Disgusted beyond belief’: Veterans demand apology for candidate’s comments in Ohio GOP forum",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/03/candidates.png?w=1280",
  "link": "https://fox8.com/news/disgusted-beyond-belief-veterans-demand-apology-for-candidates-comments-in-ohio-gop-debate/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“While others made a mockery of themselves with their phony tough guy antics, I focused on engaging with the voters,” he said, “honing in on the real problems that Ohioans face and providing true solutions that may make life better for working- and middle-class Americans.”\nFormer Ohio Republican Party chair Jane Timken, another GOP candidate in the Senate race, said she would lead with “grit and grace” if elected.",
    "“We all volunteered to serve our country away from our families, putting our lives in danger, so people like Mike Gibbons could make millions.”\nGibbons said Mandel initiated the physical aggression and made “several false, petty comments in an attempt to smear the new front-runner.”\n“Josh Mandel is unhinged, unfit and flailing — because he’s losing,” Gibbons campaign spokesperson Samantha Cotten said.",
    "Even before the Republicans’ event, the Ohio Democratic Party had predicted it would be “the first of what will be a brutal debate season.” The Democrats dubbed the GOP race a “cavalcade of clowns.”\nThe first Democratic debate, involving U.S. Rep. Tim Ryan, former consumer protection attorney Morgan Harper and community activist Traci Johnson, is slated for Monday.",
    "COLUMBUS, Ohio (AP) — A near-physical altercation in the nasty Republican primary for U.S. Senate in Ohio led to a demand Monday from some military veterans that one candidate apologize for saying a rival who did two tours in Iraq never served in the private sector and didn’t know anything about business.",
    "“Gibbons owes Josh and all veterans and those currently in the service an apology, (for) implying that ‘WE’ who served our country honorably and faithfully, never earned our way working in the private sector,” they wrote.",
    "“This is ridiculous.”\nVance, who is also a military veteran, later slammed Mandel as “disgraceful” for using the Marine Corps as a “political football,” drawing loud applause from the crowd.",
    "The debate became intense almost as soon as it began as former state Treasurer Josh Mandel attacked investment banker Mike Gibbons’ business dealings in his opening remarks.",
    "“This loss hits close to home for me and many Ohioans, and reminds us all just how valued and brave each and every member of our armed forces is,” Gibbons said.",
    "Mandel accused Gibbons of “making millions” off stock in a Chinese company, and Gibbons dismissively accused Mandel of not understanding how investments work.",
    "Soon, the two were standing face to face on the debate stage, shouting at each other as the moderator tried to keep their argument from further escalating.",
    "Those stations are WDTN 2 News in Dayton, NBC4 in Columbus, WKBN/WYTV in Youngstown, WTRF in Wheeling, West Virginia/Steubenville and FOX 8 News.",
    "“He is only a professional at one thing: running for office.”\nGibbons issued a separate statement Monday lamenting the death of Gunnery Sgt.",
    "The heated argument came during a debate Friday with five candidates running for the GOP nomination to replace the retiring Republican Sen.",
    "James W. Speedy, 30, of Cambridge, Ohio, and the three other American service members killed in a plane crash in Norway over the weekend.",
    "“Don’t tell me I haven’t worked!”\n“Back off, buddy, or you’re going to end up — ,” Gibbons told him, not finishing the sentence.",
    "But 15 veterans backing Mandel wrote an open letter Monday saying they were “disgusted beyond belief” at Gibbons’ comments.",
    "The top five Ohio Republican candidates will face each other Monday ahead of the upcoming primary.",
    "“You’re dealing with the wrong dude.”\n“No, you’re dealing with the wrong guy,” Mandel countered.",
    "Matt Dolan, Mike Gibbons, Josh Mandel, Jane Timken and JD Vance will debate at FOX 8 News.",
    "The hour-long debate can be viewed at 7 p.m. on Nexstar stations across the Buckeye state.",
    "“There are many show horses in this race, but I’m the workhorse,” she said in a statement.",
    "“You don’t know squat.”\n“Two tours in Iraq,” Mandel shouted after rising from his seat.",
    "Democrats view the open seat as among their best chances to flip a seat nationally.",
    "Vance, a venture capitalist and author of “Hillbilly Elegy,” appeared unimpressed.",
    "“You’ve never been in the private sector in your entire life,” Gibbons charged.",
    "Vance called Mandel and Gibbons “clown shows” in a statement after the debate.",
    "Come on,” he said, sitting in a row with the remaining candidates.",
    "The debate will also stream on each station’s website.",
    "“You watch what happens.”\nCandidate J.D.",
    "“What a joke,” he said.",
    "Rob Portman.",
    "“Sit down."
  ]
}