{
  "id": 179,
  "mediaId": 2771,
  "date": "2022-02-22",
  "headline": "Fast ForwardJosh Mandel, asked about Israel in debate with Black candidate, gives bizarre answer including slavery and MLK",
  "image": "https://images.forwardcdn.com/image/1300x/center/images/cropped/02-22-2022-harper-mandel-1536x80-1645567372.jpeg",
  "link": "https://forward.com/fast-forward/482823/josh-mandel-israel-debate-black-slavery-mlk/?utm_source=rss&utm_medium=feed&utm_campaign=Main",
  "mediaOutlet": "Forward",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ron Kampeas",
  "authorUrl": "https://forward.com/authors/ron-kampeas/",
  "termIds": [
    0
  ],
  "sentences": [
    "“It is part of what leads into things like Islamophobia that we have seen happening in various parts of our state and our country, and it’s really irresponsible for somebody who is trying to be in the United States Senate to stand up here and say that kind of thing.”\nHarper’s answer to the original question, about the threat from Iran, was typical, at least of Democrats on the progressive left: “I support continuing to do what’s necessary to protect Israel as a state,” said Harper, a former consumer protection attorney for the Obama administration.",
    "She added that, regarding the Israeli-Palestinian conflict, “both Israelis and Palestinians have human rights that need to be protected” and that Ohioans deserve to hear “from all sides on this issue.”\nMandel has drawn scrutiny for transitioning from being a moderate Democrat when he was state treasurer in the first part of the last decade, to a hard-right politician who backs former President Donald Trump and his false claims that he won the last election.",
    "There were actually Jews who died marching hand in hand, arm in arm, with MLK to advance the cause of civil rights.”\nIt’s not clear what slavery, Ethiopian immigration, or the alliance between U.S. Jews and Blacks in the civil rights era had to do with the Iranian threat; Morgan looked nonplussed while Mandel replied, and Mandel did not respond to a Jewish Telegraphic Agency request to elaborate.",
    "“Would you please tell us if you would give unconditional support to protect and defend Israel if Iran attacks the Jewish state?” said the moderator at the debate Monday between Josh Mandel, a Jewish far-right Republican running for Ohio’s U.S. Senate seat, and Morgan Harper, a progressive Democrat.",
    "Mandel pivoted to the Israeli-Palestinian conflict, saying, “There’s a reason why the Arab countries do not want the Palestinians: because time and time again the Palestinian leadership has acted like animals.”\nThat drew a rebuke from Harper.",
    "—\nThe post Josh Mandel, asked about Israel in debate with Black candidate, gives bizarre answer including slavery and MLK appeared first on Jewish Telegraphic Agency.",
    "“I really have to push back on some of this, honestly very dangerous rhetoric that my opponent is stating here today,” she said.",
    "The Harper-Mandel debate is unusual; both candidates are not yet nominees and face competitive primaries.",
    "“Morgan, do you know the only country on the whole planet where Africans were not brought as slaves?",
    "Mandel’s reply during the debate, held at a Black church in Cleveland, was anything but typical.",
    "“During the civil rights movement, the best partners that Martin Luther King had, were Jewish.",
    "(JTA) — It was a straightforward Israel question, typical of many recent political debates.",
    "He directly addressed Harper, who is Black.",
    "The Jewish state of Israel,” Mandel said."
  ]
}