{
  "id": 180,
  "mediaId": 2522,
  "date": "2022-02-23",
  "headline": "Marine vet candidate puts BLM crowd in its place after being told to leave debate because he’s white",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/02/SG-SG-SG-Josh-Mandel-BLM-Morgan-Harper-split.jpg",
  "link": "https://www.bizpacreview.com/2022/02/23/ohio-senate-candidate-on-wild-debate-fallout-sick-and-tired-of-dems-making-everything-about-skin-color-1204814/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "https://www.bizpacreview.com/author/terresa-monroe-hamilton/",
  "termIds": [
    0
  ],
  "sentences": [
    "“You had guys there from Black Lives Matter, you had other radical leftists there who kept interrupting me, and basically they were asking me to leave because that was a white guy in a black church,” Mandel noted during an interview concerning the incident where a woman told him he did not “belong” in the black community because he previously referred to Black Lives Matter members as “thugs.”\n“It’s everything that Martin Luther King marched against,” he added.",
    "“We saw each other as brothers, as United States Marines, and frankly, I think that’s the way that society should be as well.”\n“I’m sick and tired, and I know, Pete, your viewers are sick and tired of the Democrat Party and the leftists making everything about race and that’s what this lady tried to do to me at the debate the other night,” he charged.",
    "— SMichael017 (@Michael017S) February 23, 2022\n“What I told her was, you know, when I was in the Marine Corps, did a couple of tours in Iraq, and I put my life in the hands of young black men, and they put their lives in my hand, and we didn’t see each other as black or white or Hispanic or Asian,” Mandel stated.",
    "(Video Credit: Fox News)\nSenate candidate Josh Mandel (R-OH) clapped back at leftist radicals and Black Lives Matter members who interrupted him and demanded that he leave a church in Cleveland because he is white during an off-the-rails debate with Democratic candidate Morgan Harper.",
    "This is the same debate where Mandel referred to his opponent as being “like AOC only dumber.”\n\"She's like AOC, only dumber,\" said Ohio Senate candidate Josh Mandel (R) about candidate Morgan Harper (D), while standing mere feet from her.",
    "(@CleveIandOhio) February 23, 2022\nThe exchange that caused Mandel to respond involved a woman who attended the debate and her stance that he didn’t belong in the church where it was held ostensibly because he was white.",
    "“The Democrat Party of today is trying to make everything about skin color.”\nLeftists can only view US according to what category we fall into – they keep US divided with race, sex , religion and gender.",
    "“Unfortunately, not only could the radical leftist I was debating against not hold her own, but then the audience started chiming in,” Mandel told “Fox & Friends” co-host Pete Hegseth on Wednesday.",
    "“Uh huh, and then coming in the black community,” one woman loudly stated, adding “put him out!”\nMandel asked her, “You mean like put him out with a, with a bullet?",
    "I had young black men put their life in my hands in the United States Marine Corps in two tours in Iraq, so don’t stand there and lecture me,” Mandel shot back.",
    "https://t.co/Tc7bbgHZH6\n— Benjamin Ryan (@benryanwriter) February 22, 2022\nAt the end of the debate, Harper reportedly declined Mandel’s offer for a handshake.",
    "According to a Republican primary poll, he is the front runner currently and proudly contends he is pro-God, pro-Second Amendment, pro-liberty, and pro-Trump.",
    "Mandel is currently running in the Republican primary in Ohio against six other candidates who are all vying to take the place of retiring Sen.",
    "He is backed by Trump’s former National Security Adviser Michael Flynn, as well as Senators Mike Lee of Utah and Cynthia Lummis of Wyoming.",
    "The audience member could then be heard telling the moderator not to “suck up” to Mandel, asserting, “This is a black community.",
    "Mandel, in your previous debate, you referred to Black Lives Matter as thugs,” the moderator stated during the debate.",
    "What do you mean put him out?”\nDemocrats make everything about race because they are the racists, not the GOP.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "Mandel… Mr. Mandel… Mr. Mandel…” the moderator said attempting to stop the exchange.",
    "“Ask him to leave, he don’t belong in the black community,” the woman reiterated.",
    "“I thought this was America where we debate freely,” Mandel responded.",
    "The public will not see it and we do not share it.",
    "I put my life in the hands of young black guys.",
    "— Corn Pop (@AF1Doerr79) February 23, 2022\n“Mr.",
    "'”\n“Let me tell you something ma’am.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "Keep standing up for what’s right.",
    "It is set to take place on May 3.",
    "He’s calling my parents ‘thugs.",
    "BLM are the real racist ones!",
    "Rob Portman.",
    "— ??",
    "“Mr."
  ]
}