{
  "id": 221,
  "mediaId": 8322,
  "date": "2022-02-23",
  "headline": "Russia-Ukraine crisis intensifies",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/biden-newsletter-2-23-22.jpg",
  "link": "https://www.foxnews.com/us/russia-hit-with-sanctions",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Durschlag",
  "authorUrl": "",
  "termIds": [
    2021,
    2336,
    4905,
    5061,
    2859,
    6672,
    6569
  ],
  "sentences": [
    "Here's what you need to know to start your day ...\nBIDEN BITES BACK - President Biden on Tuesday announced new sanctions against Russia, calling Kremlin-led activities \"the beginning of a Russian invasion of Ukraine,\" and he announced the authorization of additional U.S. forces to the region, but he maintained that the United States has \"no intention\" of fighting Russia.",
    "Watch now …\nPOLITICS\nALL POLITICS LOCAL - The landslide recall of three left-wing San Francisco school board members last week has media outlets across the country wondering about the wider political implications and how powerful a voting bloc angry parents could be in November.",
    "Continue reading …\nEXPLOSIVE OHIO DEBATE - An Ohio U.S. Senate debate between Republican candidate Josh Mandel and Democrat Morgan Harper devolved into name-calling and sparring with the audience Monday night, adding the latest explosive moment to the Ohio Senate race.",
    "Continue reading …\nGUNS STILL POPULAR - American gun sales remained strong in 2021, with nearly 19 million firearms sold legally in the U.S., the second-highest total over the past two decades, according to new research from the home and personal safety group SafeHome.",
    "- SEAN HANNITY\nFOLLOW FOX NEWS ON SOCIAL MEDIA\nInstagram\nYouTube\nLinkedIn\nSIGN UP FOR OUR NEWSLETTERS\nFox News Lifestyle\nFox News Entertainment (FOX411)\nDOWNLOAD OUR APPS\nWATCH FOX NEWS ONLINE\nThis edition of Fox News First was compiled by Fox News' Jack Durschlag.",
    "Continue reading …\nMASK MANDATES - Rysa Bankston of Murray, Kentucky, battled mask mandates at her son’s preschool through a large portion of the coronavirus pandemic — and said doing her research and standing up for her little boy got her through the struggles.",
    "Continue reading …\nTEXAS POLITICS HEAT UP – The 2022 Republican primary for Texas attorney general is just days away and opponents George P. Bush and former Texas Supreme Court Justice Eva Guzman are attacking each other’s commitment to border security.",
    "IN OTHER NEWS\nFARE SHARE - Nearly 30% of New York City bus riders and 8% of subway users aren’t paying their fare — costing the city millions of dollars a year, according to new data released by the state-operated Metropolitan Transportation Authority.",
    "Continue reading …\nTWO WOMEN SCORNED - Hunter Biden's women issues could come back to haunt him, as reports have indicated that at least two of his ex-lovers have testified before the federal grand jury investigating President Biden's son.",
    "Continue reading …\nVIDEO OF THE DAY\nLaura Ingraham told \"The Ingraham Angle\" viewers Tuesday night that the Biden administration is on the ropes, and it will use just about any possible excuse to change the subject and silence its critics.",
    "- Washington, D.C., issued an alert Tuesday about potential protests in the weeks ahead, possibly referring to planned trucker convoys slated to arrive in the region in an effort to voice dissent about COVID-19 mandates and restrictions.",
    "Continue reading …\nNATO CHIEF’S WARNING - NATO Secretary-General Jens Stoltenberg said Tuesday that there is every indication that Russia is planning a \"full-scale attack\" on Ukraine and urged Moscow to reverse course immediately.",
    "Continue reading …\nCOPTER CRASH KILLS 4 - At least four people are dead after a civilian contracted helicopter crashed in Hawaii on Tuesday near the Pacific Missile Range Facility (PMRF) in Kauai County, the U.S. military said.",
    "Despite housing treasure troves of critical COVID-19 data on vaccines and on natural immunity, the Centers for Disease Control and Prevention has only been releasing slivers of data that support its own scientific dogma.",
    "Continue reading …\nROOFTOP REVELATIONS: DAY 94 - Those who call themselves members of the woke tribe in America often point to communities like Pastor Corey Brooks’ South Side neighborhood as signs of systemic racism.",
    "Continue reading …\nCOLLATERAL DAMAGE - An armed clash between Ukraine and Russia, coupled with punishing sanctions for Moscow, could push U.S. stocks toward another major loss, according to Goldman Sachs economists.",
    "With tensions rising between Ukraine and Russia, and no end in sight to existing supply chain disruptions, industry analysts expect prices to soar to over $100 a barrel before the end of the year.",
    "- \"This is the beginning of a Russian invasion of Ukraine,\" President Biden said on Tuesday in response to Russian President Vladimir Putin's recognition of Ukraine’s two breakaway regions.",
    "They talk of white supremacy, redlining and block-busting as the major contributors to the poverty and violence while conveniently ignoring the devastating impact of post-'60s liberalism.",
    "Our interest in affairs in our northern neighbor is not just neighborly: what happened in Canada was in fact a template for the suppression of freedom right here in the United States.",
    "The president said Russian President Vladimir Putin is \"setting up a rationale\" to take Ukrainian territory \"by force,\" after authorizing Russian forces to deploy into the country.",
    "Putin’s decision was quickly followed by the movement of thousands of Russian troops to the region to enforce that land grab, a sobering reminder of the emergent new world order.",
    "Continue reading …\nDR. MARTY MAKARY - The American people are waking up to the fact that too many public health leaders have not always been straight with them.",
    "Continue reading …\nREBECCA GRANT - Russia’s \"minor incursion\" of peacekeeping forces into Ukraine is President Biden’s last chance at world leadership.",
    "Following the sighting, reports claimed Gutierrez Reed was the receptionist at the tattoo parlor, but Fox News Digital confirmed that is incorrect.",
    "Ron DeSantis took a jab at White House press secretary Jen Psaki in a new inflation-themed video on National Margarita Day on Tuesday.",
    "Continue reading …\nTHE LAST WORD\n\"This [Russian invasion of Ukraine] has the potential to spiral way out of control very quickly.",
    "The Bravo TV personality is facing multiple counts of conspiracy to commit wire fraud and conspiracy to commit money laundering.",
    "– A legal expert says \"Real Housewives of Salt Lake City\" star Jen Shah's upcoming fraud trial isn't looking too good for her.",
    "Continue reading …\nBROOKE LESLIE ROLLINS - Events in Canada have captured our attention, and Americans need to understand why.",
    "The price of oil recently hit a seven-year high on the back of rising geopolitical tensions in Europe and the Middle East.",
    "War is underway, with NATO Secretary General Jens Stoltenberg saying Russia continues \"to plan for full-scale invasion.\"",
    "Continue reading …\nSPOTTED - \"Rust\" armorer Hannah Gutierrez Reed was spotted outside a tattoo parlor in Arizona Monday.",
    "Continue reading …\nFollow along as Fox News checks in with Pastor Corey Brooks each day with a new Rooftop Revelation.",
    "Biden can seize the initiative first by unleashing the massive sanctions he’s been boasting about for weeks.",
    "Continue reading …\nTOM MAGNESS - The United States is on the verge of an energy crisis of its own making.",
    "Surprising as it is, the harbinger of the American future just might have unfolded – in frigid Ottawa.",
    "If convicted on all charges, she faces a maximum of 50 years in prison.",
    "Continue reading …\nOPINION\nLT. COL. ROBERT MAGINNIS, (RET.)",
    "Thank you for making us your first choice in the morning.",
    "We’ll see you in your inbox first thing Thursday.",
    "Good morning and welcome to Fox News First.",
    "Time for Biden to shift into battle mode.",
    "Continue reading …\nHOUSEWIFE TO INMATE?",
    "Continue reading …\nBIDENFLATION CURE?",
    "Continue reading …\nTRUCKERS TO DC?",
    "Weakness should not be an option.",
    "That's all I'm seeing right now.\"",
    "- Florida Gov."
  ]
}