{
  "id": 3054,
  "mediaId": 2713,
  "date": "2022-02-01",
  "headline": "Addo-Carr to entertain as Nikorima thrown All Stars lifeline",
  "image": "https://static.ffx.io/images/$zoom_0.16300339525355062%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_116%2C$y_13/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/98f59e14b8963ce1443d33580fc1574cb021d94e",
  "link": "https://www.smh.com.au/sport/nrl/addo-carr-to-entertain-as-nikorima-thrown-all-stars-lifeline-20220201-p59sx6.html?ref=rss&utm_medium=rss&utm_source=rss_sport",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christian Nicolussi",
  "authorUrl": "https://www.smh.com.au/by/christian-nicolussi-h0yp7o",
  "termIds": [
    0
  ],
  "sentences": [
    "Indigenous All Stars: Albert Kelly, Alex Johnston, Andrew Fifita, Braydon Trindall, David Fifita, Hamiso Tabuai-Fidow, Jack Bird, Jamayne Taunoa-Brown, Jesse Ramien, Josh Addo-Carr, Josh Curran, Josh Kerr, Kotoni Staggs, Nicho Hynes, Reuben Cotter, Ryan James, Selwyn Cobbo, Tyrell Fuimaono, Will Kennedy, Will Smith\nNew Zealand Maori Kwis: Briton Nikora, Chanel Harris-Tavita, Dylan Walker, Erin Clark, Esan Marsters, James Fisher-Harris, Jayden Nikorima, Jazz Tevaga, Jordan Rapana, Joseph Tapine, Kenny Bromwich, Kevin Proctor, Kodi Nikorima, Morgan Harper, Pasami Saulo, Patrick Herbert, Reimis Smith, Royce Hunt, TC Robati, Tuku Hau Tapuha\nSports news, results and expert commentary.",
    "“It would have been nice to have Latrell, but whilst it’s disappointing he won’t play, we’ll look to get him into the camp somehow.”\nMitchell was forced to miss the game as part of a six-match ban for his shot on Manu late last season, while Wighton was unavailable because of a reluctance to spend a week in hard lockdown in the lead-up to the game.",
    "Stars like Latrell Mitchell, Cody Walker, Jack Wighton, Jarome Luai and Joey Manu will all miss the February 12 Indigenous and Maori All Stars clash, but Addo-Carr will keep the 20,000-strong crowd at CommBank Stadium on the edge of their seats - and Jayden Nikorima can remind fans why he still has so much to offer the game.",
    "Share\nNormal text sizeLarger text sizeVery large text size\nCoach Laurie Daley says he is lucky to work with genuine entertainer and “wonderful Indigenous ambassador” Josh Addo-Carr, while a player in NRL exile for six years has emerged as the All Stars feel-good comeback story.",
    "Jayden now gets to play some footy on the same field with his brother, which he hasn’t done in a long time.”\nMeanwhile, Daley was grateful to have a player like Addo-Carr in the Indigenous camp, whose infectious laugh and character lift the spirits of a group.",
    "Laurie Daley is grateful to have a player like Josh Addo-Carr in camp.Credit:NRL Photos\nNikorima was a surprise inclusion in the Maori line-up on Tuesday, considering he had been exiled from the game after two failed drug tests.",
    "Five Cronulla players were included in Daley’s squad, including newcomer Nicho Hynes, while Ryan James - who is seen as a contender to one day coach the Indigenous All Stars team - was one of the few front-rowers given the nod.",
    "No payment required\nRead more\nContinue with GoogleContinue with Apple\nor\nEmail addressContinue\nBy continuing, you agree to your personal information being collected under our privacy policy and accept our terms of use.",
    "“We’ve always had that brothers theme with the Watenes [Zelezniaks], then Benji [Marshall] and Jeremy Marshall-King, the Bromwich boys and now the Nikorimas.",
    "The 25-year-old was thrown an NRL lifeline by Melbourne late last year, and Maori coach David Kidwell was eager to include Nikorima in his squad.",
    "“He missed out on last year’s game because of COVID, he couldn’t get out of Melbourne, and I know how disappointed he was last year.",
    "“I told Kodi his little bro was going to be in the team, then let him call Jayden to break the news himself,” Kidwell said.",
    "“Josh is such a wonderful ambassador for our culture, a wonderful ambassador for himself and his family,” Daley said.",
    "By Christian Nicolussi\n February 1, 2022 — 6.17pm\n Save\nLog in, register or subscribe to save articles for later.",
    "He even left it to Jayden’s older brother, New Zealand Warriors playmaker Kodi, to make the proud phone call.",
    "“He’s always made himself available, he loves it and he’s such an infectious character to have in your group.",
    "Hopefully, it’s a good story, it’s a redemption story, and everyone deserves another chance.",
    "Register or log in now to read more articles and unlock extra benefits.",
    "He had a contract shredded by the Sydney Roosters at the end of 2017.",
    "Jayden Nikorima had his Roosters contract torn up in 2017.",
    "“All the reports have been great out of the Storm.",
    "Sign up for our Sport newsletter.",
    "Thank you for reading the Herald.",
    "This article is complimentary.",
    "Hide content"
  ]
}