{
  "id": 3827,
  "mediaId": 8358,
  "date": "2022-01-22",
  "headline": "Ohio State student workers organize protest",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/01/web1_20220122-AMX-US-NEWS-OHIO-STATE-STUDENT-WORKERS-ORGANIZE-1-OH.jpg",
  "link": "https://www.limaohio.com/news/494216/ohio-state-student-workers-organize-protest",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Though they’re protesting under different circumstances, Parker said Kenyon’s union strike was “incredibly inspiring.”\nOhio State student protesters marched across campus to Scott Dining Hall, where they heard from more student workers, as well as Morgan Harper, a lawyer who is running as an Ohio Democrat for the U.S. Senate.",
    "“Individuals who are referred through the Upshift app are not university employees, and students who are interested in this type of temporary work should apply directly with Upshift.”\nThe COVID-19 pandemic radically changed how many Americans view work, and that hasn’t excluded college students.",
    "By Sheridan Hendrix - The Columbus Dispatch\nDozens of Ohio State students gathered in frigid temperatures for a protest behind the Ohio Union to demand the university raise the minimum wage on campus to $15 an hour for student workers to improve overall working conditions.",
    "Sixty years ago, a college student who worked part-time during the school year and full-time during the summer at a minimum-wage job could pay for tuition, fees and most of their room and board at a typical public four-year university, according to the Urban Institute.",
    "In March 2021, more than 120 student-workers at Kenyon College in Gambier picketed their campus, saying the college exploited student labor and implemented unfair work policies during the pandemic that negatively impact some student workers.",
    "But stalled talks over raising the federal minimum wage, combined with the increasing cost of higher education, means most college students aren’t getting the same bang for their buck as they once did.",
    "“The university offers competitive salaries and benefits to retain and support our critical student employees, and we value their contributions to our campus life and land grant mission,” he said.",
    "In line with the state raising its minimum wage 50 cents from $8.80 to $9.30 an hour on Jan. 1, the university raised wages for returning student workers by the same amount this year.",
    "Instead of paying student workers more, Parker said Ohio State contracts with a third-party employer called Upshift, which connects adults with part-time jobs in the area.",
    "Since February 2020, at least three strikes were organized by graduate students at Columbia University, University of Michigan and University of California at Santa Cruz.",
    "Parker said Ohio State students aren’t trying to unionize at the moment, but protesters have been in contact with union organizers at Kenyon and other smaller schools.",
    "“I sacrifice sleep, grades and a social life to work.”\nMessman said student workers are “the lifeblood of the university” and ensure that everything runs smoothly.",
    "Jacob Messman, a sophomore majoring in geography and African American & African studies, works the 1 a.m. to 5 a.m. shift at Drackett Tower’s front desk.",
    "Resident assistants make $150 every two weeks, about $4.45 an hour, but those students don’t have to pay for housing and have discounted meals.",
    "Today, that same amount of work at minimum wage covers just 57% of college tuition and fees and 27% of room and board and other expenses.",
    "At a pay rate of $10.50 an hour, Parker earns less working for Ohio State than the delivery drivers picking up the food that he makes.",
    "Parker, a senior majoring in public policy, often works in the dining hall’s kitchen preparing orders for Grubhub drivers to pick up.",
    "Messman makes $9.30 an hour, but doesn’t earn any more for working overnight hours or holidays, and that’s just not enough, he said.",
    "“A lot of places are understaffed, and it’s easier to find close work off-campus that pays more, like Target or Chipotle,” he said.",
    "Parker said many student workers on campus are paid $10 an hour, which isn’t much compared to what they could make off-campus.",
    "Student bus drivers, for instance, start at $14 an hour, and employees at the university’s medical centers make $15 an hour.",
    "Students at the University of Minnesota called on the school to raise the minimum wage for student workers in November 2021.",
    "Between inflation rates making everyday life more expensive and the rising cost of tuition, he said it’s time for a change.",
    "University spokesman Ben Johnson said Ohio State employs more than 15,000 student employees across its six campuses.",
    "He helps students who get locked out, answers residents’ questions and asks visitors to properly wear their masks.",
    "“The problem is that wages have remained low.”\nOhio State pays its student workers a range of base hourly wages.",
    "Johnson said the university began working with Upshift in 2020 to fill short-term and temporary needs.",
    "A 2018 Georgetown University study found that nearly 70% of all college students in the U.S. work.",
    "As a student assistant in the Ohio Union, Anthony Parker’s job varies shift to shift.",
    "“The number one issue among students is wages,” Parker said at Friday’s protest.",
    "Parker said he hopes Ohio State leaders hear the demands of its student workers.",
    "But Parker said it’s a matter of principle to pay all student workers more.",
    "Most on-campus jobs pay anywhere between $9.30 to $13 an hour, Parker said.",
    "What would happen if none of them showed up to work one day, he asked.",
    "“Wages are determined by the market and other factors,” Johnson said.",
    "Those jobs have a base rate of $18 an hour, he said.",
    "“There’s an easy response to all this,” he said.",
    "“I get paid starvation wages,” Messman said.",
    "Some jobs on campus pay higher wages.",
    "Tipped employees earn $4.65 an hour.",
    "Previous"
  ]
}