{
  "id": 3974,
  "mediaId": 8369,
  "date": "2022-01-26",
  "headline": "Race Continues to Roil the Democrat Party",
  "image": "https://www.unz.com/wp-content/themes/unzSite/IMAGES/unz_large_logo.png",
  "link": "https://www.unz.com/article/race-continues-to-roil-the-democrat-party/",
  "mediaOutlet": "Michelle Malkin ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Roberts",
  "authorUrl": "https://www.unz.com/author/chris-roberts/",
  "termIds": [
    1819,
    2736,
    3653,
    3049,
    2753,
    5510,
    392,
    386,
    5949,
    6653
  ],
  "sentences": [
    "The Hill points out that Sen. Sinema, faces serious threats:\n“What started as a nascent ‘primary Sinema’ movement among some rogue activists has gained steam in recent weeks.”\n“Members of the Arizona Democratic Party recently voted to censure their own senator.”\n“Activists say they expect a Sinema challenger to emerge ahead of 2024, with some anticipating that Rep. Ruben Gallego could mount an intraparty fight.”\nThe Democrat Party is strong in Arizona, in part thanks to its 30 percent Hispanic population.",
    "The favorite is a 10-term congressman Tim Ryan from Ohio’s 13th congressional district, who once confessed, “Anytime you’re a white guy [which he always is] in America you’re always learning and trying to better understand what people of color are going through and I don’t know if that journey ever ends.” He may be in for an education; his most serious challenger is Morgan Harper, a black woman.",
    "As The Hill notes, “Former President Trump swept the state easily in both elections, and Manchin is still deeply popular with his constituents, despite the overall mood among Democrats in Washington souring on him.” That is because West Virginia is over 90 percent white and extremely conservative.",
    "Mr. Shahid said, “We need strong progressives in Congress to have some sort of counterweight and leverage against the conservative, corporate backed Democrats who are an obstacle to delivering results.” Like the article, Mr. Shahid says nothing about race.",
    "Both have been enfant terribles of the Democrats, unwilling to support a number of leftist proposals, such as President Biden’s “Build Back Better” plan, changing the filibuster, and expanding so-called “voting rights.”\nHere, too, race is important.",
    "His challenger, Jessica Cisneros, is darker and more Amerindian:\nHer website is bilingual:\nNext target is Carolyn Maloney, a 75-year-old white woman who represents New York’s 12th congressional district.",
    "Her challenger is Rana Abdelhamid, an Egyptian Muslim who used to teach “self-defense workshops for Muslim women.”\nThe third is Danny Davis of Illinois’ 7th congressional district.",
    "Finally, there’s Jim Cooper from Tennessee’s 5th congressional district, a white man and member of the conservative Democrat “Blue Dog Coalition.” He’s held the seat since 2003.",
    "The first quote in the article comes from South Asian Waleed Shahid, who worked for Alexandria Ocasio-Cortez and Jamaal Bowman, both of whom unseated white Democrat incumbents.",
    "Yesterday, The Hill published an article called “Five Democrats the left plans to target” about progressives who are trying to unseat moderate Congressional incumbents.",
    "His presidential run in 2020 went nowhere, and before that, his attempt to unseat Nancy Pelosi for the House Minority Leader position was defeated by 134 votes to 63.",
    "More than half of its congressmen are Democrats, and Rep. Gallego (whose lineage is Colombian and Mexican) is far from the only possible Hispanic challenger.",
    "Her campaign add includes a call for blacks to vote as one:\nCongressman Ryan will probably win, but it’s significant that he’s being challenged at all.",
    "Race remains the most salient factor in American politics, and white Democrats should think twice about their own policies that are pushing them out.",
    "The first target on the list is Henry Cuellar, of Texas’ 28th congressional district, a light-skinned Hispanic who clearly believes in assimilation.",
    "His challenger is Odessa Kelly:\nThe article ends with two “honorable mentions:” Senators Joe Manchin of West Virginia and Kyrsten Sinema of Arizona.",
    "A generation ago, he would have been a star of the Democrat Party: a well-spoken moderate populist who stands up for the middle class.",
    "Now he must defend his left flank in a state that is increasingly Republican because white guys like him are ditching the Democrats.",
    "Its three congressmen are all Republicans and the districts they represent are all so red that they’re considered un-swingable.",
    "Raúl Grijalva, a Chicano identitarian who urged Hispanics to support Bernie Sanders, could lead the charge.",
    "His name is “Enrique,” but he chooses to go by the anglicized version, and his website is in English only.",
    "Fourth is an Ohio Senate seat, held by Republican Rob Portman, who isn’t seeking reelection.",
    "Challenger Kina Collins tried to unseat Mr. Davis last election and lost by 46 points.",
    "Though not inaccurate, the piece fails to mention how important race is in all this.",
    "This is a contest between two blacks and is least likely to result in an upset.",
    "But today, his party is controlled by costal elites and revanchist non-whites.",
    "The article notes that there’s no obvious challenger to Sen. Manchin.",
    "Where would a progressive challenger come from?",
    "As such, Mr. Ryan can’t catch a break."
  ]
}