{
  "id": 4077,
  "mediaId": 8473,
  "date": "2022-01-26",
  "headline": "Two Senate candidates set pre-primary debate",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/news/ohio-news-apwire/2022/01/two-senate-candidates-set-pre-primary-debate/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "DeWine\nCOLUMBUS — A small committee of legislators could overrule the Ohio governor’s health orders under a bill ...\nJudge rejects request to exhume remains of Warren G. Harding\nMARION — U.S. President Warren G. Harding’s remains will stay right where they have lain since 1927 after a ...\nDioceses plan to name abusive priests\nOhio’s largest Roman Catholic diocese will join three other dioceses in the state and release a list of priests ...",
    "Harper said she has been unsuccessful in getting Democratic U.S. Rep. Tim Ryan to debate her, so she will use the faceoff to show she’s “ready and willing to take on the Republicans in this race.”\nShe has portrayed herself, as a black woman, as having the ability to provide the diversity that Democratic and Ohio voters are seeking.",
    "“I’m not afraid to take on anyone from either party on any issue,” Mandel said, adding he looks forward to debating Harper “to compare and contrast our visions for Ohio and where we stand on the issues.”\nIt was perhaps the kindest tone Mandel has taken toward a Democrat since launching his campaign last year.",
    "Vance began targeting universities as the enemy of the conservative movement, ...\nTwo Senate candidates set pre-primary debate\nCOLUMBUS (AP) — A Trump-aligned Republican and an underdog progressive Democrat are taking an unusually early ...\nExecutions for local killers delayed\nCOLUMBUS — Gov.",
    "The odd match-up between Josh Mandel, a former GOP state treasurer, and Democrat Morgan Harper, a former consumer protection lawyer, is being held Thursday at North Columbus Baptist Church.",
    "COLUMBUS (AP) — A Trump-aligned Republican and an underdog progressive Democrat are taking an unusually early step in their campaigns for the U.S. Senate: They’re holding a debate.",
    "“The democratic process needs to be about engaging people, elevating the issues and making sure that voters know where each candidate stands,” she said.",
    "Mike DeWine on Friday postponed four additional executions, including one each in Mahoning and ...\nSenate votes to limit health orders issued by Gov.",
    "It comes before either party’s competitive primary has been decided, so it’s unclear what purpose the event may serve beyond a bit of publicity.",
    "But the candidates said — in an, again, unconventional joint press release — that they want the event to be about ideas, and informing voters.",
    "NEWSLETTER\nToday's breaking news and more in your inbox\nOhio News\nJD Vance earned $70K from colleges\nCOLUMBUS — Before Republican J.D.",
    "He has become known for a Twitter presence marked by vitriol, name-calling and false narratives."
  ]
}