{
  "id": 5051,
  "mediaId": 2566,
  "date": "2022-04-19",
  "headline": "Bring Color To Your Space With Help From Target's Latest Artist Series Subjects, Chantell Marlow And Jessi Raulet Of EttaVee",
  "image": "https://www.essence.com/wp-content/uploads/2022/04/Artist-Series-900x600.jpg",
  "link": "https://www.essence.com/lifestyle/target-artist-series-chantell-marlow-jessi-raulet/",
  "mediaOutlet": "essence.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Ayoola",
  "authorUrl": "https://www.essence.com/authors/elizabeth-ayoola/",
  "termIds": [
    2433,
    2931,
    5171,
    5490,
    1280,
    6163
  ],
  "sentences": [
    "We look forward to seeing our guests’ excitement for these new offerings, which reinforce our commitment to spend more than $2 billion with Black-owned businesses.”\nThe latest artist series comprises 20 pieces of vibrant wall art that start at $15 for anyone already envisioning some of the artwork in their space and keen to support.",
    "“With these new Target-exclusive collections, we’re thrilled to offer guests inspirational, colorful designs by Chantell Marlow, a Midwest designer and illustrator, and Jessi Raulet, the artist behind the brand EttaVee, that celebrate their diverse cultures and perspectives.",
    "“Target’s history of partnering with incredibly talented designers and creators lives on with our next installment of the Artist Series – a rotating home décor collection from artists of diverse backgrounds, experiences and techniques,” she tells ESSENCE.",
    "Previously, the series has featured artists like Danielle Coke, an illustrator and the founder of Oh Happy Dani and Morgan Harper Nichols, a painter, poet and storyteller.",
    "They’re striving to do that through their projects like their Artist Series, which amplifies the voices and talents of artists from various backgrounds.",
    "Samara Tuchband, Target senior vice president of merchandising, Home, shared her excitement about this latest collaboration with Marlow and Raulet.",
    "The latest installment of artwork from the series features two talented Black women—Chantell Marlow and Jessi Raulet of EttaVee.",
    "Jessi Raulet is an American-born artist, designer, and social media influencer based in France and the face behind EttaVee.",
    "It’s a lifestyle brand notorious for bold hand-painted designs that express optimism and joy through color and good vibes.",
    "Marlow is a Midwest-based designer and illustrator with a love for florals, a theme you’ll see throughout her work.",
    "Target is committed to spending over $2 billion with Black-owned businesses by the end of 2025.",
    "It’s one of many opportunities to buy Black-owned and put money into a Black creative’s pocket.",
    "She uses her art to bring beauty and thoughtfulness to our fast-paced world.",
    "The collection is available on Target.com and in select Target stores now."
  ]
}