{
  "id": 5241,
  "mediaId": 2660,
  "date": "2022-04-22",
  "headline": "In Ohio US Senate race, Gibbons levels misleading attack against Mandel about China",
  "image": "https://static.politifact.com/politifact/rulings/meter-mostly-false.jpg",
  "link": "https://www.politifact.com/factchecks/2022/apr/22/mike-gibbons/ohio-us-senate-race-gibbons-levels-misleading-atta/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    4839,
    2290,
    2736,
    1819,
    1489,
    1376,
    466,
    6474,
    6509
  ],
  "sentences": [
    "The bill would have moved the U.S. toward imposing tariffs on countries that manipulate their currency, but more hurdles would have had to have been cleared, said Derek Scissors, an expert on the Chinese economy and trade policy at the American Enterprise Institute.",
    "In a video ad on Facebook and Instagram, the narrator said:\n\"As Ohio treasurer, Josh Mandel loaned your money to Chinese business interests, and Mandel opposed a bill holding Communist China accountable when they cheated and stole American jobs.\"",
    "Our ruling\nGibbons claimed in an ad that Mandel, as Ohio’s state treasurer, \"loaned your money to Chinese business interests and Mandel opposed a bill holding Communist China accountable when they cheated and stole American jobs.\"",
    "Citing STAR Ohio’s 2018 annual report, Gibbons’ campaign pointed to investments the fund made in Toyota Motor Credit Corp., Exxon Mobil Corp., JPMorgan Securities, Credit Suisse AG, MetLife Funding Inc. and Apple Inc.",
    "‘Opposed a bill holding China accountable’\nOn the second part of the ad’s claim, the Gibbons campaign referred to a 2011 federal bill that would have pressured China to allow its currency to appreciate.",
    "During a debate in March, Republicans Mike Gibbons and Josh Mandel literally got toe-to-toe after Mandel accused Gibbons of making millions from business dealings related to Chinese companies.",
    "A weaker yuan, relative to the U.S. dollar, means Chinese goods can be exported more cheaply to the United States, because each dollar in sales revenue translates to more yuan back in China.",
    "To back the first part of the ad’s claim, Gibbons’ campaign cited to PolitiFact investments made by the State Treasury Asset Reserve of Ohio while Mandel was treasurer, from 2011 to 2019.",
    "David Dollar, an expert on China's economy and U.S.-China economic relations at the Brookings Institution, said the companies \"cannot be characterized as Chinese business interests.",
    "Mandel indicated in 2012 that he opposed tariffs on China as proposed in 2011 federal legislation, saying he preferred diplomacy to dissuade China from manipulating its currency.",
    "On the money lending part of the claim, Gibbons cites the investment of Ohio public funds in companies such as U.S.-based Exxon and Apple, which many Americans are invested in.",
    "Besides Mandel and Gibbons, the Republican candidates include Ohio state Sen. Matt Dolan, former Ohio Republican Party chair Jane Timken and \"Hillbilly Elegy\" author J.D.",
    "Mandel led a state fund that invested public money in multinational corporations such as U.S.-based Exxon and Apple that do business in China, but are not based there.",
    "Now, with early voting underway for the May 3 Ohio primaries, Gibbons accused Mandel of being \"weak on China\" — a theme common in 2022 campaigns across the country.",
    "Featured Fact-check\nBy manipulating the value of its currency, China can gain a competitive advantage over American manufacturers by keeping its export prices low.",
    "Ohio race could help decide Senate control\nThe Ohio Senate seat is opening because Republican Rob Portman, who was elected in 2010, is not seeking reelection.",
    "The Gibbons campaign cited a 2012 Cleveland Plain Dealer story in which Mandel, in his first run for U.S. Senate, indicated opposition to the bill.",
    "STAR Ohio is a fund consisting of pooled assets from Ohio government subdivisions, including counties, municipalities and school districts.",
    "Toyota is based in Japan; Credit Suisse AG is based in Switzerland; and Exxon, JPMorgan, MetLife and Apple are based in the United States.",
    "Mandel indicated he did not support a 2011 bill that would have allowed for imposing tariffs on countries that manipulated their currency.",
    "The newspaper reported that Mandel believed China manipulated its currency and should be held accountable through diplomatic means.",
    "When verbal sparring between candidates nearly gets physical, you wouldn’t expect it to let up as primary election day draws near.",
    "The companies or the parent companies are multinational corporations based outside of China, not \"Chinese business interests.\"",
    "The campaign argued that at the time, each company had business operations in China or did business with companies in China.",
    "Overall, the race is rated by campaign watchers as \"leans\" Republican, \"likely\" Republican and \"solid\" Republican.",
    "Gibbons’ statement contains an element of truth but ignores critical facts that would give a different impression.",
    "Supporters argued that Chinese \"cheating\" on the issue cost the United States more than 1.6 million jobs.",
    "The leading Democratic candidates are U.S. Rep. Tim Ryan and consumer protection attorney Morgan Harper.",
    "At the same time, my approach would be a diplomatic approach, not a legislative approach,\" Mandel said.",
    "The companies do business in China, but they are multinational corporations, not Chinese companies.",
    "Their shareholders would mostly be from the USA and other developed countries, not China.\"",
    "\"We must be vigilant in taking them on and making sure they play by the rules.",
    "But he suggested holding China accountable through diplomatic efforts.",
    "The bill passed the Senate but was not taken up by the House.",
    "Mandel’s campaign did not reply to our requests for comment.",
    "In the race for the U.S. Senate in Ohio, you’d be right.",
    "The fund is administered by the treasurer.",
    "We rate it Mostly False.",
    "Vance."
  ]
}