{
  "id": 6362,
  "mediaId": 8379,
  "date": "2022-04-15",
  "headline": "Hilliard schools files police report against senate candidate",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/04/canva-photos-27.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/hilliard/hilliard-schools-files-police-report-against-senate-candidate/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cynthia Rosi",
  "authorUrl": "https://www.nbc4i.com/author/cynthia-rosi/",
  "termIds": [
    0
  ],
  "sentences": [
    "School administrators were not participating in the event, rather were supervising at a distance within view of the students.”\nHarper didn’t notify Darby administration or district leaders that she was going to attend the student walkout, “in clear violation of our visitor policies,” the statement said.",
    "According to a statement from the Hilliard school district about the event: “Without the consent of appropriate district personnel, an unauthorized person – a candidate for political office – entered school property without permission to do so.",
    "The press release for that event said it is: “in response to the Hilliard Darby High School administration attempt to stifle student political speech, and to the bigoted and draconian House Bill 616 introduced in Ohio last week.”",
    "HILLIARD, Ohio (WCMH) — Hilliard City Schools filed a report with the Hilliard Division of Police against Ohio senate candidate Morgan Harper after she made what the district says was an unauthorized visit to campus grounds.",
    "“Further, we have filed a report with the Hilliard Division of Police, and we have notified her through our attorney that she is prohibited from being on any school property, effective immediately.",
    "According to the district statement: “It is disappointing when someone in our community does not meet the same expectations we have of our students and school families.",
    "This was a unique situation and our parents can be assured that we provide a safe environment for our students and staff,” the statement concluded.",
    "Harper, who is running as a progressive Democrat in the upcoming senate race, attended a school walkout on Thursday afternoon at Darby High School.",
    "“She later posted photos of her trespass on social platforms along with photos that included our students.",
    "The district requested the candidate involved remove and delete all photos online from the event.",
    "“The district is also filing a complaint with the Ohio Elections Commission,” the statement said.",
    "“She was not invited by school administrators to attend the walkout and came of her own accord.",
    "Morgan Harper plans to hold a press conference on Saturday, April 16 in downtown Columbus.",
    "The district went on to give an opinion about Harper’s actions."
  ]
}