{
  "id": 6619,
  "mediaId": 8496,
  "date": "2022-04-12",
  "headline": "U.S. Senate race in Ohio: Who are the candidates running and what else you need to know before May 3 primary",
  "image": "https://media.wkyc.com/assets/WKYC/images/ee6e131d-bf51-4c69-83a3-20bae2f4ac4a/ee6e131d-bf51-4c69-83a3-20bae2f4ac4a_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/politics/elections/us-senate-race-ohio-candidates-what-you-need-to-know-before-may-3-primary/95-d373fbe1-f8bf-4725-8684-d5137c55559c",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1819,
    2290,
    5581,
    4839,
    2765,
    1489,
    6067,
    6474
  ],
  "sentences": [
    "She said Democrats will turn the U.S. into “a ditch.”\nFormer Ohio Treasurer Josh Mandel said, “Right now, what we need in Washington is to defeat the secular left, to defeat the radical left, to defeat Biden and (Senate President Chuck) Schumer and (House Speaker Nancy) Pelosi and save this country for our kids and grandkids.”\nGenerally, though, the candidates did more attacking of the moderator than of each other Monday — oftentimes, after a near physical altercation at one debate, concurring on or complimenting one another's answers.",
    "“I think every time a lawyer goes into their office every day, they’re trying to figure out how to do something legally.”\nIn a race that Democrats see as one of their best chances nationally to flip a Senate seat, the Republican candidates described the contest as a fight to preserve American values that they believe are slipping, to protect U.S. security and to revive the economy.",
    "Here is a recap of the event from the Associated Press:\nAll but one Republican seeking an open U.S. Senate seat in Ohio held fast to the disproven narrative Monday that the 2020 presidential election was either stolen from Donald Trump or fraught with irregularities, fraud or other problems.",
    "Here is what you need to know about the race for the U.S. Senate in Ohio:\nState Sen. Matt Dolan\nMike Gibbons\nJosh Mandel\nNeil Patel\nMark Pukita\nJane Timken\nJD Vance\nCandidates from both parties squared off on March 28 in debates held at Central State University in Wilberforce, Ohio.",
    "Cleveland investment banker Mike Gibbons said he does not believe recently discovered communications between Virginia Thomas, wife of Supreme Court Justice Clarence Thomas, and top aides to Trump are evidence of trying to inappropriately influence the 2020 election.",
    "Here are some key dates to remember as you plan when you will cast your ballot:\nEarly in-person voting hours: For specific information on where to vote, you can check your county board of election information here.",
    "“Because when he takes the time to look at all of us up on this stage and sees who's actually implemented the conservative Republican ideas that he brought to Washington, I've done it in Ohio,” he said.",
    "With the U.S. Senate currently at an even 50-50 between Republicans and Democrats (with Vice President Kamala Harris able to break ties), every race is taking on added importance across the nation.",
    "CLEVELAND — With the May 3 primary election coming up in Ohio, one of the key races that voters will be focusing on is the battle for the U.S. Senate seat which will be vacated by the retiring Sen.",
    "Ohio Public Radio's Karen Kasler pushed back during the 90-minute event, reminding audience members many of the claims they were hearing have been fact checked and found to be inaccurate.",
    "Among author and venture capitalist JD Vance's items of 2020 concern were the large donations that Facebook founder Mark Zuckerberg and his wife gave to states for election operations.",
    "“My problem is he's a failed president.”\nDolan said he still holds out hope he can garner Trump's endorsement, which has become increasingly questionable as the May 3 primary nears.",
    "Candidate Matt Dolan, a Cleveland-area state senator, was the only one of seven candidates on the stage at Central State University not to embrace the allegations.",
    "Rival Morgan Harper, a progressive former consumer protection lawyer and community organizer, accused the 10-term congressman of being too cozy with corporations.",
    "Former Ohio Republican chair Jane Timken continued to tout her work on the ground in Ohio to elect Trump — who won the state by more than 8 percentage points.",
    "It was the contentious, Trump-focused contest's first debate hosted by a mainstream journalist, who was tapped by the nonpartisan Ohio Debate Commission.",
    "“I don’t think questioning and trying to find a legal way of overturning the election is in any way treasonous, or even slightly illegal,” he said.",
    "“The Democrats are threatening the future of our country and I'm going to fight to make sure that we still have a country,\" said Timken.",
    "April 11-15: 8:00 a.m. - 5:00 p.m.\nApril 18-22: 8:00 a.m. - 5:00 p.m.\nApril 25-29: 8:00 a.m. - 7:00 p.m.\nApril 30: 8:00 a.m. - 4:00 p.m.",
    "The Ohio elections chief identified 62 potential fraud cases from 2020 to authorities, a tiny fraction of nearly 6 million votes cast.",
    "Rob Portman announced his retirement last year, expressing dismay over the deep partisanship and dysfunction in American politics.",
    "U.S. Rep. Tim Ryan, of the blue-collar Mahoning Valley, vowed to fight for Ohio’s workers and put more money toward job training.",
    "That included, she said, catching a Democrat ballot harvesting, a case she referred to the state attorney general.",
    "Earlier in the day, Democratic Senate candidates faced off in their only debate before the upcoming primary.",
    "If not returned by mail, absentee ballots must be received by your board of elections by 7:30 p.m. on May 3.",
    "Voters will decide on which of three Democrats and seven GOP members will face off in this fall's election.",
    "Democrats view Ohio’s open Senate seat as among their best chances to flip a seat nationally.",
    "“Let me be very clear: Joe Biden is the legitimate president of the United States,” he said.",
    "Polls will be open for the May 3 Primary Election from 6:30 a.m. - 7:30 p.m.\nMore Coverage:",
    "Mailed absentee ballots: The deadline to request an absentee ballot is April 30 at noon.",
    "Early in-person voting and absentee voting by mail has begun in the state of Ohio.",
    "Here is a list of the candidates from both parties seeking to replace Sen.",
    "Rob Portman, plus key dates leading up to the May 3 primary.",
    "Mailed absentee ballots must be postmarked by May 2.",
    "At times, she was loudly booed.",
    "Incumbent U.S. Sen.",
    "Rob Portman."
  ]
}