{
  "id": 7370,
  "mediaId": 2746,
  "date": "2022-04-07",
  "headline": "Ohio Right to Life backs JD Vance for open U.S. Senate seat",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/28/election_2022-senate-ohio-russia_deals_95247_c0-240-5760-3600_s1200x700.jpg?3b9a8ea0e82656f098dd6f7cd5420c99f93f2f69",
  "link": "https://www.washingtontimes.com/news/2022/apr/7/ohio-right-to-life-backs-jd-vance-for-open-us-sena/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julie Carr Smyth",
  "authorUrl": "",
  "termIds": [
    4755,
    5581,
    4306,
    2736,
    2290,
    1489,
    978,
    6474,
    6077,
    6067
  ],
  "sentences": [
    "Marshal Pitchford, board chair for the Ohio Right to Life Society, called Vance the best candidate to continue Portman’s “exemplary pro-life service and statesmanship.”\n“JD Vance is 100% pro-life and we are confident that he will not only advance the cause of life, but defend the unborn from Planned Parenthood and their allies in our nation’s capital,” Pitchford said in a statement.",
    "Other candidates seeking the GOP nomination are state Sen. Matt Dolan, who has defended his 2019 vote against a bill restricting abortions at the first detectable heartbeat as a “common sense” calculus based on the expensive federal lawsuits it would, and did, attract; and entrepreneurs Neil Patel and Mark Pukita.",
    "The organization noted that all four leading candidates in the seven-way primary - Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair Jane Timken and Vance - scored 100% on the survey used to help determine their endorsement.",
    "The exchange has prompted Timken and others to raise questions about whether either man has the temperament to be a U.S. senator, and the race has generally been regarded as one of the nastiest in the nation this year.",
    "Democrats seeking their party’s nod are U.S. Rep. Tim Ryan, former consumer protection attorney Morgan Harper and Columbus activist and tech executive Traci Johnson.",
    "The announcement could distinguish the venture capitalist and author of “Hillbilly Elegy” with GOP primary voters in the crowded race to succeed retiring U.S. Sen.",
    "COLUMBUS, Ohio (AP) — Republican JD Vance received the coveted endorsement Thursday of Ohio’s oldest and largest anti-abortion group, Ohio Right to Life.",
    "The group’s reference to statesmanship may hint at concern about a near-physical confrontation between Gibbons and Mandel at a March 18 debate.",
    "It gave a particular shout-out to Mandel’s anti-abortion record, even as it endorsed Vance.",
    "Early voting is already underway in the May 3 primary.",
    "Rob Portman."
  ]
}