{
  "id": 75,
  "mediaId": 2614,
  "date": "2022-02-23",
  "headline": "Ohio Senate Debate Gets Out Of Hand",
  "image": "https://www.lifezette.com/wp-content/uploads/2022/02/2022.02.23-09.22-lifezette-6216a5a0a14ef.jpg",
  "link": "https://www.lifezette.com/2022/02/ohio-senate-debate-gets-out-of-hand/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DrewBerquist.com",
  "authorUrl": "https://www.lifezette.com/author/dberquist/",
  "termIds": [
    1819,
    2290,
    1489,
    164,
    392,
    980,
    1126
  ],
  "sentences": [
    "The debate Monday included only Harper and Mandel.”\nThe second Josh Mandel v. Morgan Harper debate is going completely off the rails pic.twitter.com/DtZJZxmK40\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nThe moderator asked Mandel about a comment calling Black Lives Matter members “thugs.” Then an audience member interrupted with a loud “uhhhhuh.”\n“You ain’t coming in the Black community.",
    "FNC: “An Ohio Senate debate between Republican candidate Josh Mandel and Democrat Morgan Harper devolved into name-calling and sparring with the audience Monday night, adding the latest explosive moment to the incendiary Ohio Senate race.",
    "Among the insults, Mandel said Harper is ‘like AOC only dumber,’ referring to Rep. Alexandria Ocasio-Cortez, D-N.Y. And Harper mocked Mandel for being on his third run for U.S. Senate, with unsuccessful efforts in 2012 and 2018.",
    "I had young Black men put their life in my hands in the United States Marine Corps in two tours in Iraq, so don’t stand there and lecture me,” Mandel said, speaking over the moderator.",
    "Harper is a long shot Democrat in a primary against longtime Rep. Tim Ryan, who’s considered the clear front-runner in the Democratic primary.",
    "“Those were my brothers, whether they were Black or they were White or they were Hispanic or they were Asian.” Point, set, match: Mandel.",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "Mandel is the former treasurer of Ohio and one of several leading Republican candidates running to succeed retiring GOP Sen.",
    "“He don’t belong in the Black community.”\n“I thought this was America where we debate freely,” Mandel sharply retorted.",
    "But to bring that White man in the Black community like that, I’m finished,” the bigoted audience member said.",
    "An ignorant racist heckler got her head handed to her by Republican Josh Mandel at a Ohio Senate debate.",
    "Don’t embarrass me,” the moderator, who was black, said to the audience member, who was also black.",
    "It originally appeared in DrewBerquist.com and is used by permission.",
    "This piece was written by David Kamioner on February 23, 2022.",
    "“Hey, hey, we’re not doing that,” the moderator shot back.",
    "Mr. Mandel,” the moderator said, trying to regain control.",
    "“Don’t you suck up to him.”\nThen Mandel let her have it.",
    "“Ask him to leave,” the racist audience member said.",
    "“You mean like put him out with a, with a bullet?",
    "Put ’em out,” the moronic audience member said.",
    "I put my life in the hands of young Black guys.",
    "What do you mean put him out?” Mandel said.",
    "“Let me tell you something ma’am.",
    "Don’t do that… This is America.",
    "There was also further ruckus.",
    "Who says politics isn’t fun?",
    "“Hey sister, listen to me.",
    "“I’m not embarrassing you.",
    "“No, no, no, Mr. Mandel.",
    "But Mandel went for it.",
    "He can be here.",
    "Don’t do that.",
    "Rob Portman.",
    "Mr. Mandel."
  ]
}