{
  "id": 766,
  "mediaId": 2713,
  "date": "2022-02-25",
  "headline": "Manly lose gun trio to injury as Green Machine slip away in wet",
  "image": "https://static.ffx.io/images/$zoom_0.2425%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_178%2C$y_4/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/f17d92c97c25f60c153b2f1df5171b2c26f55923",
  "link": "https://www.smh.com.au/sport/nrl/manly-lose-gun-trio-to-injury-as-green-machine-slip-away-in-wet-20220225-p59zql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
  "mediaOutlet": "The Sydney Morning Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christian Nicolussi",
  "authorUrl": "https://www.smh.com.au/by/christian-nicolussi-h0yp7o",
  "termIds": [
    0
  ],
  "sentences": [
    "Marty Taupau lasted 90 seconds before suffering a back injury during a horror night for Manly.Credit:NRL Photos\nIn Walker and Taupau’s case, there will be a sense of relief because they are both keen for big starts to the year given they are off contract at the end of the season.",
    "Share\nNormal text sizeLarger text sizeVery large text size\nDes Hasler hopes Marty Taupau and Dylan Walker will recover from injury to be fit for round one, but the Sea Eagles look set to be without another gun back-rower in Haumole Olakau’atu.",
    "Already without Josh Schuster for the first month of the season, Olakau’atu will be sidelined for several weeks after he partially dislocated his right elbow during the 18-16 trial loss to Canberra in Gosford on Friday night.",
    "No payment required\nRead more\nContinue with GoogleContinue with Apple\nor\nEmail addressContinue\nBy continuing, you agree to your personal information being collected under our privacy policy and accept our terms of use.",
    "It’s frustrating for the fans.”\nCanberra trailed 16-0 before they hit back with a try and try assist to Jack Wighton, and a soft four-pointer for Joe Tapine under the sticks.",
    "Haumole is our biggest concern.”\nFans were still taking their seats and eating their $15 beef jerky when big Taupau grimaced in pain after a tackle involving Xavier Savage.",
    "“The main concern is Haumole,” said Hasler, who was also frustrated by the 20 penalties blown and stop-start nature of the second and final trial at Central Coast Stadium.",
    "It was not all bad news, however, with Jason Saab and rookie Tolutau Koula putting the foot down to score explosive long-range tries on the right side of the field.",
    "Hasler, however, said Koula would not start the year in the NRL and Morgan Harper, who injured himself during the All Stars, would be back on deck inside Saab.",
    "By Christian Nicolussi\nUpdated February 25, 2022 — 8.43pmfirst published at 7.55pm\n Save\nLog in, register or subscribe to save articles for later.",
    "Olakau’atu, who had an enormous breakout season last year, slammed his right arm into the ground and immediately clutched at his elbow.",
    "Taupau stood Savage up before he fell to the ground and his knees dug int the turf and appeared to part like a wishbone.",
    "Koula then showed his own slick pair of heels when he was put into space and raced 80m down the same side of the field.",
    "The continual penalties in a trial game left Hasler fearing a return to the bad old ways a couple of years ago.",
    "The schoolboy sprint sensation who once clocked 10.58 seconds for the 100m was never going to be caught.",
    "Savage, no slouch in the speed department, appeared up for the foot race early, but quickly tailed off.",
    "The only player who was near him was Saab, who - to be fair - looked to be jogging next to him.",
    "When asked it was frustrating watching the game from the box, Hasler said: “It was, you saw it.",
    "The Sea Eagles are already long shots to win their round-one game against Penrith on March 10.",
    "A few minutes later, Walker stayed down in back play and clutched at his right knee.",
    "Olakau’atu and Walker went down within minutes of each other in the second half.",
    "Saab intercepted a Jack Wighton pass and charged 95m to score after 13 minutes.",
    "Register or log in now to read more articles and unlock extra benefits.",
    "He clocked just over 11 seconds despite easing down the final 20m.",
    "“Walks is OK [with his knee] and Marty has a strained back.",
    "They have lost their past eight straight season openers.",
    "He said afterwards he knew he was in trouble.",
    "Thank you for reading the Herald.",
    "This article is complimentary.",
    "We took him off as precaution.",
    "He could have come back on.",
    "It wasn’t his hip.",
    "Hide content"
  ]
}