{
  "id": 820,
  "mediaId": 2605,
  "date": "2022-02-23",
  "headline": "What’s on TV Wednesday: ‘The Wonder Years,’ ‘The Conners’ and ‘Home Economics on ABC",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/5a46ee8/2147483647/strip/true/crop/1800x945+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8b%2F8f%2Fa9a30e974b75803aff6b694bc956%2Fthe-wonder-years-2.jpg",
  "link": "https://www.latimes.com/entertainment-arts/tv/story/2022-02-23/whats-on-tv-wednesday-the-wonder-years-the-conners-and-home-economics-on-abc",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Stockly",
  "authorUrl": "https://www.latimes.com/people/ed-stockly",
  "termIds": [
    0
  ],
  "sentences": [
    "(N) 12:37 a.m. KNBC\nNightline (N) 12:37 a.m. KABC\nMOVIES\nThe Madness of King George (1994) 8 a.m. Cinemax\nThe Revenant (2015) 8 a.m. FX\nClueless (1995) 9 a.m. HBO\nPoint Break (1991) 9:15 a.m. AMC\nBlacKkKlansman (2018) 9:30 a.m. FXX\nDial M for Murder (1954) 11 a.m. TCM\nThe Lobster (2015) 11 a.m. TMC\nCreed (2015) 11 a.m. TNT\nGet Out (2017) 11:30 a.m. FX\nThe Prestige (2006) Noon BBC America\nHereditary (2018) Noon Showtime\nWar Horse (2011) 12:07 p.m. Cinemax\nThe Postman Always Rings Twice (1946) 1 p.m. TCM\nSpider-Man: Homecoming (2017) 1:35 p.m. Starz\nCreed II (2018) 1:45 p.m. TNT\nSpider-Man: Far From Home (2019) 2 p.m. FX\nA Most Violent Year (2014) 2:30 p.m. TMC\nStand by Me (1986) 3 p.m. BBC America\nWedding Crashers (2005) 3 p.m. Freeform\nThe Peanuts Movie (2015) 3 p.m. Nickelodeon\nNight Watch (1973) 3 p.m. TCM\nSerenity (2005) 4 p.m. Syfy\nMississippi Burning (1988) 5 p.m. TCM\nLee Daniels’ the Butler (2013) 5:45 p.m. Showtime\nThe Naked Gun: From the Files of Police Squad!",
    "9 p.m. HBO\nSPORTS\nCollege Basketball Creighton visits St. John’s, 3:30 p.m. FS1; Mississippi State visits South Carolina, 3:30 p.m. SEC-TV; Boston College visits NC State, 4 p.m. BSSC; Xavier visits Providence, 4 p.m. CBSSN; Duke visits Virginia, 4 p.m. ESPN; TCU visits Texas, 4 p.m. ESPN2; Teams TBA, 4 p.m. ESPNews; Wake Forest visits Clemson, 5 p.m. ACC-TV; Butler visits Seton Hall, 5:30 p.m. FS1; Ole Miss visits Auburn, 5:30 p.m. SEC-TV; Wyoming visits Colorado State, 6 p.m. CBSSN; LSU visits Kentucky, 6 p.m. ESPN\nNHL Hockey The Edmonton Oilers visit the Tampa Bay Lightning, 4:30 p.m. TNT; the Kings visit the Arizona Coyotes, 7 p.m. TNT\nSoccer SheBelieves Cup: United States versus Iceland, from Frisco, Texas, 6 p.m. ESPN2\nTALK SHOWS\nCBS Mornings Olympic figure skater Nathan Chen.",
    "(1988) 6 p.m. MLB\nKajillionaire (2020) 6:15 p.m. Cinemax\nThe Fifth Element (1997) 6:30 p.m. Syfy\nJudas and the Black Messiah (2021) 6:50 p.m. HBO\nSpider-Man (2002) 7 p.m. Paramount\nShoot the Moon (1982) 7:15 p.m. TCM\nLove and Monsters (2020) 8 p.m. Epix\nDespicable Me 2 (2013) 8 and 9 p.m. Nickelodeon\nRain Man (1988) 8 p.m. Ovation\nTitanic (1997) 8 p.m. Showtime\nThe Last Time I Saw Paris (1954) 9 p.m. KVCR\nBill & Ted Face the Music (2020) 9:50 p.m. Epix\nSpider-Man 2 (2004) 10 p.m. Paramount\nSunshine Cleaning (2008) 10:15 p.m. Cinemax\nThe Perfect Storm (2000) 10:45 p.m. AMC\nNightmare Alley (2021) 10:50 p.m. HBO\nLemony Snicket’s A Series of Unfortunate Events (2004) 11:25 p.m. Epix",
    "10 p.m. FX\nSPECIALS\nFrederick Douglass: In Five Speeches Five Black actors give voice to the words of one of America’s most famous abolitionists in this new documentary executive produced by Henry Louis Gates Jr. and inspired by David W. Blight’s Pulitzer Prize-winning biography “Frederick Douglass: Prophet of Freedom.” Denzel Whitaker (“The Great Debaters”), Nicole Beharie (“Sleepy Hollow”), Colman Domingo (“Fear the Walking Dead”), Jonathan Majors (“Lovecraft Country”) and Jeffrey Wright (“Westworld”) recite passages from five of Douglass’ most celebrated speeches on racial injustice, which still resonate today.",
    "The CW\nThe Conners When Darlene (Sara Gilbert) falls in love with a house she’s looking at, the Realtor says she has a better chance of getting the house if she’s part of a couple, so Darlene convinces Ben (Jay R. Ferguson) to pretend to be her partner in this new episode.",
    "9 p.m. CBS\nChicago Fire (N) 9 p.m. NBC\nBatwoman Ryan, Sophie and Jada (Javicia Leslie, Meagan Tandy, Robin Givens) collaborate on a plan to stop Marquis (Nick Creegan), while Mary (Nicole Kang) tries to make amends for the harm she inflicted as Poison Ivy.",
    "9 p.m. Food Network\nModern Marvels “Ultimate Helicopters” and “Maximum Horsepower.” (N) 9 and 10 p.m. History\nHome Economics Marina (Karla Souza) convinces Connor (Jimmy Tatro) to salsa dance with Lupe (Lidia Porto) in competition in this new episode.",
    "8 p.m. KOCE\nThe Wonder Years The family spends spring break with Lillian’s (Saycon Sengbloh) parents in the countryside where Dean (Elisha Williams) tries to impress his cousins by exaggerating about the excitement of city life in Montgomery.",
    "SERIES\nBig Brother: Celebrity Edition (N) 8 p.m. CBS\nChicago Med (N) 8 p.m. NBC\nDC’s Legends of Tomorrow The Legends realize there is only one way to heal Gideon (Amy Pemberton), but Evil Gideon continues to attack.",
    "The CW\nThe Goldbergs Barry (Troy Gentile) is confronted with his ex-girlfriends and their current boyfriends at a bachelor-bachelorette beach party for Erica and Geoff (Hayley Orrantia, Sam Lerner).",
    "8 p.m. ABC\nI Can See Your Voice Judges Margaret Cho, Rachel Harris, Cheryl Hines and Adrienne Houghton choose one contestant to perform a duet with Shaggy in this new episode.",
    "9 p.m. Fox\nNOVA The new episode “Augmented” follows the dramatic personal journey undertaken by biophysicist Hugo Herr as he works to create brain-controlled robotic limbs.",
    "(N) 10 a.m. KABC\nRachael Ray (N) 10 a.m. KTTV\nThe Wendy Williams Show (N) 11 a.m. KTTV\nTamron Hall Kel Mitchell (“Blessed Mode”); Olympic athlete Apolo Ohno (“Hard Pivot”).",
    "9 p.m. KOCE\nWorst Cooks in America In the season finale, the remaining recruits forage for produce at a rooftop farm and create unique dishes with farm-fresh ingredients.",
    "(N) 11:35 p.m. KABC\nAmanpour & Company (N) midnight KVCR; 1 a.m. KLCS\nThe Late Late Show With James Corden Dave Grohl; Hilary Duff; Carlie Hanson performs.",
    "10 p.m. ABC\nSnowfall It’s the summer of 1986 and Franklin’s (Damson Idris) personal and professional relationships are flourishing in the season premiere.",
    "At 17, Herr’s legs were amputated following a climbing accident, and he quickly grew frustrated with the prosthetic limbs he was given in their place.",
    "(N) 10 p.m. NBC\nA Million Little Things On a road trip to Albany, Gary (James Roday Rodriguez) learns new things about Maggie (Allison Miller).",
    "(N) 2 p.m. KCBS\nThe Kelly Clarkson Show Clarkson sings “Careless Whisper”; Hilary Duff; Jabari Banks; Daisy the Great, featuring AJR, performs.",
    "(N) 3 p.m. KCOP\nAmanpour & Company 11:30 p.m. KCET\nThe Tonight Show Starring Jimmy Fallon Tracee Ellis Ross; Jabari Banks; Koffee performs.",
    "Also, Eddie (David Giuntoli) helps Rome (Romany Malco) in his time of need, while Regina (Christina Moses) sets boundaries with her father.",
    "8 p.m. Fox\nNature This new episode documents the history of American horse breeds, including Appaloosa, Morgan, mustang and quarter horse.",
    "Their final challenge is to make a three-course, restaurant-quality meal for judges Matt Abdoo, Kwame Onwuachi and Millie Peartree.",
    "(N) 7 a.m. KABC\nGood Day L.A. (N) 7 a.m. KTTV\nLive With Kelly and Ryan Alana Haim (“Licorice Pizza”); Sophia Bush (“Good Sam”).",
    "(N) 3 p.m. KCBS\nThe Ellen DeGeneres Show Tyler Perry (“A Madea Homecoming”); Glennon Doyle; Phillip-Michael Scales performs.",
    "(N) 2 p.m. KNBC\nDr. Phil A woman says her marriage lacks communication, affection and sex; her husband says she abuses him.",
    "(N) 11:34 p.m. KNBC\nThe Late Show With Stephen Colbert John Heilemann; Mark McKinnon; Jennifer Palmieri; Russell Howard.",
    "(N) 7 a.m. KNBC\nKTLA Morning News (N) 7 a.m. KTLA\nGood Morning America Jeffrey Wright; author Morgan Harper Nichols.",
    "Also, Dean’s mother (Sengbloh) tries to resolve a property dispute between her parents and some neighbors.",
    "(N) 12:37 a.m. KCBS\nLate Night With Seth Meyers Billie Eilish; Eric Adams; Stevie Nistor performs.",
    "Adam (Sean Giambrone) pushes back when Lou (Ken Lerner) takes over planning the wedding video.",
    "(N) 1 p.m. KABC\nThe Drew Barrymore Show Hannah Waddingham (“Ted Lasso”); Patrick Starr.",
    "(N) 9 a.m. KABC\nThe View Katy Perry, Luke Bryan and Lionel Richie (“American Idol”).",
    "9 p.m. ABC\nNext Level Chef Three contestants are sent home in the semifinals.",
    "8:30 p.m. ABC\nThe Amazing Race The race continues in Thessaloniki, Greece.",
    "Wendi McLendon-Covey also stars in this new episode of the family comedy.",
    "Caity Lotz, Nick Zano, Jes Macallan, Tala Ashe and Matt Ryan also star.",
    "Rachel Skarsten and Camrus Johnson also star in this new episode.",
    "You can find more TV coverage at: latimes.com/whats-on-tv.",
    "9:30 p.m. ABC\nGood Sam (N) 10 p.m. CBS\nChicago P.D.",
    "(N) 3 p.m. KNBC\nThe Real Grace Byers (“Harlem”).",
    "The prime-time TV grid is on hiatus in print.",
    "Tyler Perry; Usher; Ari Lennox performs.",
    "(N) 11:35 p.m. KCBS\nJimmy Kimmel Live!",
    "Anne Burrell and Cliff Crooks host.",
    "(N) 7 a.m. KCBS\nToday Pink.",
    "Grace Park also stars.",
    "Dulé Hill also stars.",
    "9 p.m.",
    "8 p.m."
  ]
}