{
  "id": 864,
  "mediaId": 2566,
  "date": "2022-02-25",
  "headline": "Morgan Harper Could Be The Only Black Woman In The U.S. Senate",
  "image": "https://www.essence.com/wp-content/uploads/2022/02/158-900x600.jpeg",
  "link": "https://www.essence.com/news/morgan-harper-us-senate/",
  "mediaOutlet": "essence.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Malaika Jabali",
  "authorUrl": "https://www.essence.com/authors/malaika-jabali/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Because if people still feel like they are struggling to get by after working, if people still feel like a medical bill could sink you out of nowhere, then we haven’t done our jobs of making people see that government can serve that role of protecting people and guaranteeing, at a minimum, basic needs are met and are okay.”\nLike in her House race, Harper is continuing to run on universal healthcare and debt-free public college.",
    "“We need to stop multinational corporations from outsourcing jobs to low-paying, union-busting countries and dodging their taxes, and instead, create secure, high-paying jobs here at home.”\nHarper’s challenge isn’t just winning people over on policy—it’s convincing voters she’s the one who can achieve them over her opponents.",
    "“We have to have someone that can authentically say that they’re going to be the one to fight for those things.” Referring to Ryan, she added, “based on where we’re at right now, in Ohio, somebody that can be portrayed as a creature of Washington who has made a career of politics, it’s just not going to be that person.”",
    "“When you’re running for office, especially as a grassroots candidate, and when you’re continuing to work with people directly on the ground, [you meet] people across the board who are feeling economically left behind and not feeling like votes are translating into any sort of different outcome.",
    "That’s pretty important, as we’re talking about trust with voters.”\n“When you’re running for office, especially as a grassroots candidate…[you meet] people across the board who are feeling economically left behind and not feeling like votes are translating into any sort of different outcome.",
    "Some Democrats opposed the move, saying in a letter that these kind of pre-primary endorsements “unfairly tip the scales of one candidate over another.”\nWhile the party machine has announced their support of her opponent, Harper believes she is more representative of what Ohio voters want.",
    "I think there’s a greater understanding of that now, even among people who find themselves on the other side of that economic equation, and wanting to do more to make sure that everyone is lifted up.”\nIn the House race, Rep. Joyce Beatty won the primary with 68% of the vote.",
    "“I was born here in Columbus and given up for adoption, and from then it’s just a journey of people and different social service sectors and agencies giving me a chance.”\nAt a young age, Harper won a scholarship to go to a private school in the suburbs of Columbus.",
    "Because that would be very unfair.”\nThe Stanford Law School graduate, who worked as a Senior Advisor at the Consumer Financial Protection Bureau under the Obama Administration, says she’s running for office so other people don’t have to depend on chance to get by.",
    "“I can turn out the voters that we need to win, and the only coalition that is proven to be successful in winning the state of Ohio as a Democrat really depends on turnout from Black voters.",
    "And there’s some truth to that.”\n-Morgan Harper\nAs reports continue to emerge of approval ratings declining for both Joe Biden and Congress among Black voters, trust is a scare resource.",
    "But some recognition of our collective vulnerability when there’s such a high number of us that have the potential to lose everything at the drop of a hat was one shock.",
    "Harper first ran in the 2020 House race for Ohio’s 3rd congressional district, announcing her campaign before COVID-19 became a ubiquitous reality.",
    "Harper is running for the U.S. Senate in her home state of Ohio, where she hopes to flip a Republican seat in this year’s midterms.",
    "This year, her most formidable primary challenger is Rep. Tim Ryan, who recently won the support of the Ohio Democratic Party.",
    "“My whole story is one that starts with the community stepping in and giving me a shot,” Morgan Harper shared with ESSENCE.",
    "“That was a key moment for me of just realizing this can’t possibly be how we’re doing this American Dream thing.",
    "I asked Harper about any changes to her policy priorities since the virus has become a part of our daily lives.",
    "“That allowed me to just dive into education and be in such a great learning environment.",
    "“The pandemic showed us all how a lot of people were very vulnerable,” she said.",
    "“Even pre-pandemic we’ve seen a million people in Ohio lose their health care.",
    "“At one point, Ohio had more high-paying jobs than any state in the country.",
    "But it stuck with me that this was random that we got in this position.",
    "This will be her second attempt vying to represent Ohio on the Hill.",
    "“But I also don’t take corporate PAC money like my opponent does.",
    "Today, we have one of the lowest,” her campaign website reads.",
    "She’s also aiming to bring more jobs back to her state.",
    "And I’m going to be able to do that,” Harper noted.",
    "We have to be honest about that,” she said.",
    "Yet Harper believes she can deliver.",
    "And that’s not right,” she shared.",
    "And there’s some truth to that."
  ]
}