{
  "id": 870,
  "mediaId": 8291,
  "date": "2022-02-24",
  "headline": "Ryan receives endorsement of pro-choice group",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/news/local-news/2022/02/ryan-receives-endorsement-of-pro-choice-group/",
  "mediaOutlet": "content.tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Tim Ryan only started to support women’s fundamental rights when the political winds changed direction.”\nnews@tribtoday.com\nNEWSLETTER\nToday's breaking news and more in your inbox\nLocal News\nOn the record: Lordstown\nWHAT: Board of Education meeting April 20 PRESENT: Cheryl Kistler, Jackie Woodward, William Catlin, Niki ...\nRobotics teams end season with awards\nWARREN — FIRST Robotics teams from Warren G. Harding High School and Champion High School finished the season at ...\nVeterans group seeks parade participants\nWARREN — The Trumbull County Veterans Services Commission is seeking participants for the 2022 Trumbull County ...\nCortland man guilty in counterfeiting case\nWARREN — A Cortland man Monday pleaded guilty to a charge of attempting counterfeiting connected to an October ...\nWarren man gets 2 years in robbery\nWARREN — A Warren man received a two-year prison sentence Monday for his part in a May 30, 2020, robbery at ...\nUdderly Smooth president, music ed grad to speak at YSU",
    "She added: “He is the leader Ohio needs to protect and expand access to abortion.”\nRyan, D-Howland, said: “In the Senate, I’ll keep working to codify Roe and to make sure every judge we put on the bench is committed to protecting this essential right.”\nRyan announced in January 2015 that he would no longer identify as pro-life — as he had done during his political career going back to his 2000 election to the state Senate.",
    "Morgan Harper, an attorney and community organizer challenging Ryan in the Democratic primary, criticized the endorsement, saying it “unfortunately speaks to the continued marginalization of black women by feminist organizations.”\nShe added: “Tim Ryan spent years in Washington opposing our fundamental rights and siding with anti-choice Republicans.",
    "U.S. Rep. Tim Ryan, who changed his position on abortions seven years ago from pro-life to pro-choice, received the endorsement in the Ohio Senate race of NARAL Pro-Choice America, the oldest abortion rights organization in the nation.",
    "“Over the course of his career, Rep. Ryan came to believe that we must trust pregnant people and families to make the best decision for their lives,” said Mini Timmaraju, NARAL’s president.",
    "After having conversations with women, Ryan said at the time that he believed women had a right to choose whether to have an abortion."
  ]
}