{
  "id": 8719,
  "mediaId": 2551,
  "date": "2022-04-07",
  "headline": "Knights fullback Kalyn Ponga and coach Adam O'Brien WALK OUT of press conference after copping a grilling about star's controversial meeting with Wayne Bennett",
  "image": "https://i.dailymail.co.uk/1s/2022/04/08/02/56357867-0-image-a-43_1649381624908.jpg",
  "link": "https://www.dailymail.co.uk/sport/nrl/article-10698189/Kalyn-Ponga-WALKS-press-conference-copping-grilling-Wayne-Bennett-meeting.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Alston For Daily Mail Australia",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Josh+Alston+For+Daily+Mail+Australia",
  "termIds": [
    0
  ],
  "sentences": [
    "Kalyn Ponga is at the centre of a tug-of-war for his services in 2023 between current club Newcastle and new franchise the Dolphins - but he was in no mood to talk about it in the wake of his club's 30-6 loss to Manly.",
    "#SBFsBay53 #AllRedandBlue #NRL #NRLKnightsManly pic.twitter.com/6Nxw4mDj6Z\n— Bay 53 Podcast (@Bay53Pod) April 7, 2022\n'At the end of the day, I want him to make the best decision with all the information on the table.",
    "'I don't know if you've noticed, but every time you ask I don't give you an answer, so stay patient, I have people working on it, my focus is always here [at Newcastle] and you know that,' he said.",
    "I know [other deals] are not as high profile and [being discussed] at this stage of the year, but they all come off contract, they all negotiate, and they usually negotiate with more than one club.",
    "Following Newcastle's third consecutive loss, Ponga fronted the media to face a barrage of questions about his future and his reported meeting last Saturday with Dolphins coach Wayne Bennett.",
    "+3\nView gallery\nPonga and the Knights endured a difficult evening against Manly, losing 30-6 - the club's third consecutive loss after opening the season with consecutive wins.",
    "Ponga smirked at questions about his meeting with Bennett before ultimately walking out of the media conference\nWhen pressed on his meeting with Bennett, Ponga was blunt.",
    "It comes after former Brisbane Broncos and North Queensland Cowboys star Brent Tate said Ponga was not worth the dollars the Dolphins are reportedly offering him.",
    "+3\nView gallery\nKnights trainer Craig Catterick attends to Ponga who had blood coming from his nose after a high shot from Harper and a collision with the ground.",
    "Ponga had a mixed night for the Knights in the loss to Manly on Thursday night, scoring a try but also being forced from the field for a HIA just before halftime.",
    "Manly coach Des Hasler said he was pleased with his players' effort to contain Ponga and was confident Harper would not have a case to answer for the incident.",
    "He was caught by a high shot from Manly centre Morgan Harper and hit his head on the turf, before returning to score his side's only try of the match.",
    "It resulted in some terse reponses followed by Ponga gesturing to his coach Adam O'Brien and both of them walking out of the press conference.",
    "'He's a quality player, and one of the most dangerous things a player like Kalyn has is time; we thought we cut down a little bit, he said.",
    "#NRLKnightsManly\n— Scott Bailey (@ScottBaileyAAP) April 7, 2022\n'We'll get the answer, and he's worth waiting for from my perspective.",
    "Scored one try tonight, otherwise yet to break the line, set up a try or put anyone through a hole in three matches.",
    "The reporters refused to drop the subject, however, forcing O'Brien to leap in to speak on behalf of Ponga.",
    "'We talk about million dollar players and he is going to get a huge contract at the Knights,' Tate said.",
    "'I'm comfortable because I don't see a dip in any of his preparation and his hunger at training.",
    "Then there's no regrets, and if he chooses to stay, he's made the choice with all the facts.",
    "But I still think he is pretty unproven when you talk about million-dollar players.'",
    "'Tonight, we should be talking about that performance, which wasn't great for us.'",
    "Quizzed about his meeting with Bennett, Ponga said: 'It obviously happened.",
    "Once it happened I moved on and I was worried about the [Manly] game.'",
    "It's his right, it's in his contract, a contract we wrote,' he said.",
    "Kalyn Ponga still averaging less than 100 metres a game this season.",
    "'I think Munster would be a great recruit for the Dolphins.'",
    "'I love Kalyn and I think he is a wonderful player.",
    "'I know his teammates are in similar situations.",
    "[Firstly] it's not a lunch date [with Bennett].",
    "+3\nView gallery\nNow you see him, now you don't.",
    "I'm really comfortable with it either way.",
    "KP’s reaction here is mildly infuriating.",
    "I've got a radar out for that stuff.",
    "'I think he [Harper] will be OK.",
    "I think he was unlucky.'",
    "'I can speak to that.",
    "That hasn't wavered."
  ]
}