{
  "id": 1033,
  "mediaId": 195,
  "date": "1/1/2022 12:00:00 AM",
  "headline": "Seven most vulnerable governors facing reelection in 2022",
  "image": "https://cdn.jwplayer.com/v2/media/PJbjrO9I/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/587202-seven-most-vulnerable-governors-facing-reelection-in-2022",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester",
  "termIds": [
    818,
    1698,
    1758,
    1844,
    1864,
    1951,
    1966,
    2002,
    2095,
    2298,
    4325,
    428,
    507
  ],
  "sentences": [
    "Laura Kelly\nKelly is set to face a contentious reelection battle this year for her seat, which the nonpartisan Cook Political Report has rated as a toss-up.? Kelly is currently facing four Republican challengers, including Kansas Attorney General Derek Schmidt.",
    "The Cook Political Report rates the race as a toss-up.?\nThe Michigan governor faces a crowded field of 11 Republican challengers, including former Detroit Police Chief James Craig, conservative talk show host Tudor Dixon and chiropractor Garrett Soldano.",
    "Earlier this month, Whitmer told local business owners that she understood concerns about the mandates, adding that if a federal mandate were to go into effect, we're going to lose state employees.?\nLike Whitmer in Michigan, Nevada Gov.",
    "Cook also shifted the state's Senate rating from lean Democratic? to toss-up.? Cook cited Biden's declining approval ratings and the current state of the economy, including rising inflation, as the reasons for the changes.",
    "Polling in the race has been relatively scarce, but a survey released by the GOP firm Remington Research in September showed Schmidt leading Kelly 44 percent to 40, with 16 percent of voters saying they were undecided.",
    "Meanwhile, a poll from the Democratic pollster Clarity Campaign Labs, which was also released in September, showed Kelly leading Schmidt 47 percent to 44 percent, with 8 percent of voters saying they were undecided.",
    "While Grisham appears to be in a stronger position than other Democratic incumbent governors, with the Cook Political Report rating her race as likely Democratic,? Republicans have set their sights on her seat.",
    "A number of Republicans, including former Sen. Dean Heller (Nev.), North Las Vegas Mayor John Lee, Las Vegas City Councilwoman Michele Fiore and boxer Joey Gilbert, have lined up to challenge Sisolak.",
    "Perdue and Kemp will also have to contend with former state Rep. Vernon Jones in the primary, but whoever comes out of the GOP contest will likely face off against Democratic candidate Stacey Abrams.",
    "Several Republicans, including state Rep. Rebecca Dow, former Senate candidate Mark Ronchetti and Sandoval County commissioner Jay Block, have thrown their hats into the ring to challenge Grisham.",
    "The former governor said earlier this month that he would get rid of Mills's vaccine mandate on day one? if elected, though he has strongly encouraged individuals to get the coronavirus vaccine.",
    "\"Kemp has been a very weak Governorthe liberals and RINOs have run all over him on Election Integrity, and more,\" Trump said in his endorsement, using the acronym for \"Republicans in name only.\"",
    "Republicans are feeling momentum after Virginia Gov.-elect Glenn Youngkin's victory in November, when he became the first Republican to win a statewide race in the blue-leaning state since 2009.",
    "Abrams, who lost to Kemp narrowly in the 2018 gubernatorial race, has been credited with leading the fight to flip Georgia from red to blue in 2020 through her organization Fair Fight Action.",
    "Think about how different it would be today if Kemp fought Abrams first instead of fighting Trump.?\nPerdue quickly garnered the endorsement of former President Trump after announcing.",
    "Whitmer has faced particularly strong pushback from Republicans on the issue of coronavirus restrictions in Michigan, which was the epicenter of the pandemic for a part of 2020.",
    "Paul LePage this year in a race that the Cook Political Report has rated as lean Democratic.?\nLePage announced his bid to take back the governor's office in Maine in September.",
    "Earlier this month, former Sen. David Perdue (R-Ga.), who lost his Senate seat to Sen. Jon Ossoff (D-Ga.) in January, announced he would challenge Kemp in the primary.",
    "The gubernatorial election landscape in 2022 is shaping up to be competitive as Republicans look to flip a number of governors' mansions across the country.",
    "In November, Kelly signed legislation into law that would make it easier for federal workers in the state to keep their jobs despite federal mask mandates.",
    "The party says the political environment is prime for Republicans to oust a number of vulnerable Democratic governors this year, including Gov.",
    "The Cook Political Report shifted Wisconsin's gubernatorial race from lean Democratic? to toss-up? earlier this month, an indicator that Gov.",
    "Soldano, who led a ballot initiative to repeal a law Whitmer used to enact coronavirus restrictions, raised a total of $1.1 million in 2021.",
    "Perdue accused Kemp of caving to Democrats after the governor refused to overturn the results of the 2020 presidential election in Georgia.",
    "Schmidt, who has served as attorney general since 2011, has also worked to tout his lawsuits against the Biden and Obama administrations.",
    "Instead of protecting our elections, he caved to Abrams and cost us two Senate seats, the Senate majority and gave Joe Biden free reign.",
    "However, Democrats say they see opportunities in states with contentious GOP primaries, particularly in Georgia, where incumbent Gov.",
    "Maine has fared relatively well during the coronavirus pandemic in terms of vaccinations, which have taken place on Mills's watch.",
    "\"I've been a bit controversial in the past,\" he said at a fundraiser over the summer, according to U.S. News and World Report.",
    "Cook rates the race as a toss-up.?\nGretchen Whitmer\nWhitmer's campaign has long been gearing up for her reelection bid.",
    "The 2022 governor's race in the state Biden won by just more than 2 points over Trump in 2020 stands to be a close one.",
    "Working hard to get very popular and capable Former Congressman Sean Duffy of Wisconsin to run for Governor.",
    "The Cook Political Report shifted the race's rating from lean Democratic? to toss-up? earlier this month.",
    "Steve Sisolak (D) is likely watching the crowded Republican gubernatorial primary forming in his state.",
    "In October, the campaign announced the governor raked in $3.1 million during the third quarter of 2021.",
    "Last month, Schmidt sued the Biden administration over its vaccine mandate for health care workers.",
    "Kelly has walked a fine line when navigating the politically tumultuous issue of vaccine mandates.",
    "A Morning Consult poll released in November showed the governor with a 54 percent approval rating.",
    "Craig led the GOP field in fundraising in the third quarter, raising $1.4 million since mid-July.",
    "Michelle Lujan Grisham (D) raked in more than $2.5 million over the previous six months.",
    "So far, four Republicans have lined up to challenge Evers, including former Lt. Gov.",
    "Here are seven vulnerable incumbent governors facing uphill reelection bids in 2022.",
    "Brian Kemp\nKemp will have to contend with a potentially contentious primary in May.",
    "Trump has also pushed former Rep. Sean Duffy (R-Wis.) to launch a bid for governor.",
    "However, his critics are quick to point out that he appeared at an anti-mask rally.",
    "The attorney general has hit Kelly over her handling of the coronavirus pandemic.",
    "LePage has a reputation for being bombastic and making controversial comments.",
    "Marine veteran Kevin Nicholson is said to be considering a run for the office.",
    "Trump has repeatedly knocked Kemp for not overturning the election results.",
    "Like Kelly, Whitmer has had to walk a fine line on the issue of vaccines.",
    "However, over the summer, he suggested he would be modifying his image.",
    "It's simple: He has failed all of us and cannot win in November.",
    "The fight is specifically aimed at combating voter suppression.",
    "Tony Evers (D) could have his work cut out for him this year.",
    "He would be fantastic!? Trump said in a statement in October.",
    "October campaign finance reports showed that New Mexico Gov.",
    "He has hit Mills over education and her pandemic response.",
    "Brian Kemp's (R) reelection chances are far from certain.",
    "This isn't personal,? Perdue said in his announcement.",
    "Janet Mills is slated to face former Republican Gov.",
    "\"Hope to clean up my act this time.\"",
    "However, the field could grow.",
    "Laura Kelly in Kansas and Gov.",
    "Gretchen Whitmer in Michigan.",
    "Look, I like Brian.",
    "Rebecca Kleefisch.",
    "Maine Gov."
  ]
}