{
  "id": 6,
  "mediaId": 43,
  "date": "d2022-04-25T00:00",
  "headline": "Morning Digest: Michigan Republican sends horrid",
  "image": "https://images.dailykos.com/images/1062480/story_image/mi-07.jpg?1650834399",
  "link": "https://www.dailykos.com/story/2022/4/25/2093788/-Michigan-Republican-sends-horrid-anti-trans-solicitation-after-fundraising-shortfall",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    651,
    699,
    821,
    837,
    1007,
    1299,
    1454,
    1480,
    1844,
    1901,
    2002,
    2277,
    2298,
    2303,
    3075,
    3087,
    428,
    2748,
    2791
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWhy House Democrats' best defense is a good offense\nThe Downballot\nFollowShare\n0:0044:11\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? MI-07: Republican state Sen. Tom Barrett, who is challenging Democratic Rep. Elissa Slotkin in Michigan's new and competitive 7th Congressional District, recently sent out a fundraising appeal by text message falsely telling recipients that \"your child's gender reassignment surgery has been booked,\" complete with a phony time for the appointment.",
    "The winner will take on 2020 nominee Hillary Scholten, who faces no intra-party opposition for her second bid, in a Grand Rapids-based seat that redistricting transformed from a 51-47 Trump seat to one Joe Biden would have carried 53-45.\n? MI-04: Republican Rep. Bill Huizenga, who represents the existing 2nd District, has no primary opposition following fellow Rep. Fred Upton's retirement announcement earlier this month.",
    "In yet another election that has turned into a battle of rival billionaires thanks to Illinois being one of just a few states without any limits on direct contributions to candidates, Uihlein's involvement so far still trails far behind the $20 million that fellow billionaire Ken Griffin, a hedge fund manager who is Illinois' wealthiest resident, has given to Irvin's campaign.",
    "Other candidates to watch include hedge fund manager John Conyers III, who is the son and namesake of the late longtime congressman; Detroit School Board member Sherry Gay-Dagnogo; Teach for America official Michael Griffie; former Detroit General Counsel Sharon McPhail; and Detroit city official Adrian Tonon, who is one of the few other non-Black contenders in the primary.",
    "The Charlotte Observer reports that a Soros-affiliated investment firm once owned a 7.6% stake in a company led by Budd's father that filed for bankruptcy in 2000, and there's no indication the congressman even had any role in the company's day-to-day operations, which is a very far cry from Soros actually supporting his contemporary political activities.",
    "? NY Redistricting: A five-judge panel on New York's Appellate Division, the state's intermediate appellate court, upheld a recent lower court ruling that the new congressional map drawn by Democrats violates the state constitution as an illegal partisan gerrymander and gave lawmakers until April 30 to craft a replacement.",
    "Tlaib, whose existing 13th District makes up 53% of the new 12th, ended March with a $1.62 million to $221,000 cash-on-hand lead over her nearest foe, Detroit City Clerk Janice Winfrey; Winfrey, for her part, has faulted Tlaib for casting a vote from the left against the Biden administration's infrastructure bill.",
    "? IL-Gov: Far-right billionaire Dick Uihlein has given another $2.5 million to the June primary campaign of Republican state Sen. Darren Bailey, bringing his total contributions to $3.5 million in addition to another $1 million that Uihlein gave to a third-party group opposing Aurora Mayor Richard Irvin.",
    "? MN-01: In what appears to be the first TV ad from anyone ahead of the special May 24 Republican primary, former Freeborn County party chair Matt Benda plays up his farming background and pledges to \"protect our children from indoctrination in the classroom [and] ensure election integrity.\"",
    "? TN-05: Tennessee has finalized its list of candidates for the Aug. 4 primary ballot now that each party has had the chance to eject contenders who did not meet their \"bona fide\" standards, an option the GOP utilized in the 5th District in order to bounce three notable candidates.",
    "? GA-Gov: A group called Take Back Georgia with ties to pro-Trump state Sen. Brandon Beach has unveiled a $2 million ad buy for a spot that goes all-in on 2020 election denial to highlight Trump's endorsement of former Sen. David Perdue ahead of the May 24 GOP primary against Gov.",
    "The few polls that have been released show former Detroit Police Chief James Craig as Team Red's frontrunner, but he's had to deal with several major campaign shakeups: Craig, most notably, parted ways with his first campaign manager in December, and his second left last month.",
    "Today's list only has a few entries, but the roundup will be sure to grow longer as the year progresses:\nAL-Sen: Mike Durant (R)\nPA-Gov: Bill McSwain (R) - anti-Doug Mastriano (R)\nWI-Gov: Rebecca Kleefisch (R) - anti-Tony Evers (D-inc)\nThis is a short blurb about Daily Kos.",
    "Barrett, a far-right politician who has worn a \"naturally immunized\" wrist band and refused to say if he's vaccinated, deployed this tactic after David Drucker of the conservative Washington Examiner reported that he'd badly missed his own team's fundraising goals.",
    "Ad Roundup\nIt's that time of the election cycle again when campaign ads have grown too numerous for us to detail every one, so we're bringing back a feature from past cycles where we'll round up any remaining ads that we don't have space to cover in greater depth.",
    "This appears to be the first ad of the cycle going directly after a candidate from any of the \"big four\" party groups (which in addition to the NRSC includes the Senate Leadership Fund super PAC on the GOP side and the DSCC and Senate Majority PAC for Democrats).",
    "While the two Republican front runners dominate the airwaves, the pro-Budd Club for Growth is notably training its focus on former GOP Rep. Mark Walker with an ad that criticizes him for frequently missing votes, including one involving Trump's impeachment.",
    "House\n? AK-AL: The Alaska Republican Party has endorsed businessman Nick Begich III ahead of the top-four special election primary this June, where Begich has emerged as one of the leading Republicans in the crowded all-party contest alongside former Gov.",
    "Soros is a Hungarian-born Holocaust survivor whom the far-right both here and abroad has frequently used as a target of and a stand-in for age-old conspiracy theories about wealthy Jews using their power to exert a nefarious influence over the world.",
    "? NC-11: Axios reports that Results for North Carolina, a super PAC close to Sen. Thom Tillis, is spending $310,000 on an ad campaign against Rep. Madison Cawthorn, which makes this the first major outside spending of the May 17 Republican primary.",
    "Lawrence, who supports Michigan Civil Rights Commissioner Portia Roberson, has argued that it's vital to keep a \"qualified, committed\" African American representing the state, something that several other Black candidates have also emphasized.",
    "Perdue has only been running a modestly sized ad buy recently after struggling to keep up in fundraising with Kemp, whose allies at the RGA have also spent millions airing their first-ever ads backing an incumbent against a primary challenger.",
    "Senate\n? AR-Sen: We have yet to see any polls indicating whether former NFL player Jake Bequette poses a serious threat to Sen. John Boozman in the May 24 Republican primary, but the incumbent did recently air an ad taking a swipe at his foe.",
    "The Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Meanwhile, former state GOP chair Jane Timken has been struggling to gain traction in the polls, and she has reportedly been off of broadcast TV in much of the state for weeks and is only continuing to run limited cable ads on Fox News.",
    "Kay Ivey has commissioned a poll from the Tarrance Group that shows her holding a dominant 57-14 lead over former Ambassador to Slovenia Lindy Blanchard ahead of the May 24 Republican primary, with businessman Tim James taking just 12%.",
    "? MI-08: Democratic Rep. Dan Kildee is defending a seat in the Flint and Saginaw areas that would have favored Joe Biden only 50-48, a small but potentially important shift from Biden's 51-47 showing in Kildee's existing 5th District.",
    "Sandy Mayor Stan Pulliam, meanwhile, goes all-in with courting right-wing outrage with spots where he calls for getting \"critical race theory out of our schools\" and \"not allow[ing] transgender athletes to compete in girls' sports.\"",
    "Warren Council member Angela Rogensues finished the quarter with $160,000 on hand, while attorney Huwaida Arraf and former Macomb County Judge Carl Marlinga were similarly situated with $145,000 and $135,000 to spend, respectively.",
    "However, McCrory's accusation that Soros, who is well known for openly funding progressive causes, would secretly support Budd, who has compiled a hard-right voting record in his three terms in office, relies on very dubious facts.",
    "There are nine Republicans remaining in the race to succeed retiring Democratic Rep. Jim Cooper in the 5th, which GOP mapmakers transmuted from a 60-37 Biden district to a 54-43 Trump constituency by cracking the city of Nashville.",
    "Bequette's allies at Arkansas Patriots Fund, meanwhile, have been going directly at Boozman with a commercial faulting him for having \"voted to confirm six in 10 Biden cabinet picks\" in the first 40 days of the administration.",
    "Former Grosse Pointe Shores Councilman Matthew Seely and businesswoman Candice Miller (not to be confused with the former congresswoman with the same name) are also in, but neither opened fundraising committees until recently.",
    "It's unclear whether Trump himself, whose super PAC recently reported it had over $120 million on hand, will increase its support for Perdue beyond the meager $500,000 it allocated a few weeks ago toward backing his endorsee.",
    "? MI-13: A total of 11 Democrats have filed to run to succeed retiring Rep. Brenda Lawrence, who is Michigan's only Black member of Congress, in this safely blue seat, which includes part of Detroit and its southern suburbs.",
    "The same day, several advocacy groups and Florida voters filed a lawsuit in state court alleging that the map violates the state constitution's prohibitions on partisan gerrymandering and diluting minority representation.",
    "It's possible that some candidates who submitted signatures won't appear on the ballot, though, because election authorities in Michigan have disqualified contenders in past years for not meeting the state's requirements.",
    "There have only been a few polls here from reliable firms, but every one of them this year has found Ivey far ahead of her rivals and in good shape to surpass the simple-majority threshold needed to avoid a June runoff.",
    "The only three who appear to be serious contenders are former state House Speaker Beth Harwell, who took a disappointing fourth place in the 2018 primary for governor; Maury County Mayor Andy Ogles; and retired Brig.",
    "In 2018, for instance, seven House hopefulsincluding a few notable nameswere thrown off the ballot after the secretary of state ruled that they'd failed to turn in the requisite number of acceptable petitions.",
    "Pat McCrory has debuted a new commercial ahead of the May 17 GOP primary where he calls Rep. Ted Budd weak on Vladimir Putin before claiming that Budd is backed by billionaire philanthropist George Soros.",
    "In its ruling, the Appellate Division also overturned the trial court's finding that the legislature lacked the power to draw new maps for the state Senate and Assembly, allowing those maps to be used.",
    "? MI-10: Five Democrats are competing to take on John James, who was Team Red's Senate nominee in 2018 and 2020, in an open seat in Detroit's northeastern suburbs that would have gone for Trump 50-49.",
    "On the Democratic side, former state House Speaker Tina Kotek talks about the progressive policies she helped pass, while state Treasurer Tobias Read's narrator argues that \"Oregon has lost its way.",
    "? CO-Sen: Wealthy construction company owner Joe O'Dea has announced he's spending $250,000 over three weeks to air an ad that touts his business record and portrays him as a conservative outsider.",
    "? MI-03: Rep. Peter Meijer, who was one of the 10 House Republicans to vote to impeach Trump, faces primary opposition from conservative commentator John Gibbs, who is Trump's endorsed candidate.",
    "The two have largely voted the same way in Congress, though while Levin has emphasized his support for Medicare for all and the Green New Deal, Stevens has portrayed herself as more pragmatic.",
    "Ron DeSantis signed his state's new congressional mapwhich he himself proposedon Friday, following party-line votes that advanced the map in both chambers of the Republican-run legislature.",
    "\"We announced just before Thanksgiving, you know, really, you know, we chained him to a desk and had him on the phones,\" said the staffer in February, \"and he raised, you know, 310 grand.",
    "Sterling Heights City Council member Henry Yanez, though, was far back with only $22,000 in the bank, while former Macomb County Health Department head Rhonda Powell had less than $5,000.",
    "The ad goes on to accuse the senator of backing \"amnesty for illegals, tax dollars for abortions, bailouts for Wall Street, even allowed the feds to confiscate your firearm records.\"",
    "A spokesperson for the Club, which is supporting former state Treasurer Josh Mandel, tersely responded to the news about Trump's message by saying, \"We are increasing our ad buy.\"",
    "? MI-Gov: A total of 10 Republicans are competing to take on Democratic incumbent Gretchen Whitmer, which would make this the largest gubernatorial primary field in state history.",
    "Silverman notes that this messaging is \"all in keeping with Read's efforts to portray himself as a change agent, though he has been in state government about as long as Kotek.\"",
    "(Thanedar, who lived in Ann Arbor when he unsuccessfully ran for governor, moved to Detroit ahead of his victorious bid for a state House seat in the city two years later.)",
    "? MI-12: Rep. Rashida Tlaib, who is one of the most prominent progressives in the House, faces three Democratic primary opponents in this safely blue Detroit-based seat.",
    "? MI-11: The Democratic primary is a duel between Reps. Haley Stevens and Andy Levin for a constituency in the Detroit northern suburbs that Biden would have won 59-39.",
    "This constituency in the Lansing area would have supported Joe Biden by a 50-49 margin, a small improvement for Slotkin from Trump's 50-49 edge in the old 8th District.",
    "Candidate filing closed Tuesday, and the only other Republican to turn in paperwork was insurance agency owner Jacob Hagg, who hasn't reported raising any cash at all.",
    "Most of Boozman's spot, which praises him as a \"workhorse, not a show pony\" is positive, though it employs a photo of Bequette as the narrator hits those last words.",
    "Also in the race are former state Rep. Shanelle Jackson and Lathrup Village Mayor Kelly Garrett, neither of whom reported raising any money during the last quarter.",
    "Vance in the May 3 Republican primary, the Club for Growth is once again running an ad that uses Vance's lengthy past history of anti-Trump statements against him.",
    "Conservative radio host Tudor Dixon doesn't have the same resources as her intra-party foes, but she sports endorsements from Reps. Bill Huizenga and Lisa McClain.",
    "The ad campaign reportedly angered Trump so greatly that he had an aide text Club president David McIntosh, \"Go f*^% yourself\" (which presumably wasn't censored).",
    "The Republican frontrunner is former Trump administration official Paul Junge, who lost to Democratic Rep. Elissa Slotkin 51-47 in the old 8th District in 2020.",
    "The commercial focuses on reports that the incumbent \"lied about being accepted to the Naval Academy\" and declares he's \"been caught lying about conservatives.\"",
    "James, who only has a little-known primary foe, had $1.25 million stockpiled at the end of March, which was considerably more than the Democrats had combined.",
    "Stevens has the support of retiring Rep. Brenda Lawrence, who represents the balance of this district, and EMILY's List, while the SEIU is in Levin's corner.",
    "However, with the polls showing Kemp in striking distance of the outright majority needed to avoid a June runoff, time is quickly running short for Perdue.",
    "? AZ-Sen: The NRSC is commencing what they call a \"seven figure\" ad buy that starts off with a spot attacking Democratic Sen. Mark Kelly over immigration.",
    "The polls have shown Walker in a distant third place, but the Club likely views his hard-right support base as overlapping with potential Budd supporters.",
    "The 5th will also likely be home to the only seriously contested House race, and we'll be taking a look at the field now that we know who's on the ballot.",
    "Thanedar had over $5 million on hand, which was more than ten times as much as the $453,000 that his nearest foe, state Sen. Adam Hollier, had available.",
    "Now that filing has passed in the Wolverine State, we'll be taking a look at Michigan's other big competitive races, starting with our MI-Gov item below.",
    "The super PAC received $1 million from conservative megadonor Dick Uihlein last year, which Politico's Alex Isenstadt says makes up most of its budget.",
    "(Several Democrats grumbled to Politico recently that Levin should have instead run for the new 10th, where he already serves most of the residents.)",
    "The narrator, who brands the congressman \"an attention-seeking embarrassment,\" does not mention Tillis' endorsed candidate, state Sen. Chuck Edwards.",
    "This seat in southwestern Michigan would have favored Trump 51-47, and the one Democrat to file, Joseph Alfonso, has not reported raising any money.",
    "? OR-Gov: The May 17 primary is rapidly approaching, and the Portland Monthly's Julia Silverman has collected several TV spots from the candidates.",
    "However, Democrats have already said they'll appeal to the state's highest court, the Court of Appeals, with oral arguments scheduled for Tuesday.",
    "However, the candidate who ended March with the most money by far is self-funding state Rep. Shri Thanedar, who is originally from India.",
    "We know about Barrett's underperformance because a Democratic operative provided Drucker with a vivid recording of one of his top aides.",
    "Budd himself has launched a new ad that features footage of a rally where Trump effusively endorses Budd and McCrory goes unmentioned.",
    "For the Republicans, former state House Minority Leader Christine Drazan declares that she's \"led the fight against [Democratic Gov.]",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "However, the senator hauled in only $456,000 during the first three months of 2022, which left him with $396,000 on hand.",
    "Former state Rep. Bob Tiernan uses his messaging to attack Brown and Kotek, saying that their approach is \"bull****.\"",
    "Gen. Kurt Winstead, who has the largest war chest by far, though it's possible another candidate will catch fire.",
    "Also in the running are chiropractor Garrett Soldano, Michigan State Police Captain Mike Brown, and five others.",
    "Little-known attorney Gabi Manolache is also running, though \"MAGA bride\" Audra Johnson did not end up filing.",
    "Slotkin, by contrast, took in $1.32 million during the first quarter and had a gigantic $5.5 million on hand.",
    "(A different Republican, consultant Bridget Barton, also tried to stand out with some censored potty mouth.)",
    "Stevens ended March with a $2.79 million to $1.47 million cash-on-hand edge over her fellow incumbent.",
    "Composite image of Michigan state Sen. Tom Barrett (R) and a fundraising appeal sent by his campaign.",
    "Finally, 2016 nominee Bud Pierce alludes to the Big Lie with the mention of \"broken elections.\"",
    "Stevens' existing 11th District makes up 45% of the new seat, while Levin represents only 25%.",
    "It's not yet clear whether Republicans plan to pursue their own appeal regarding this issue.",
    "The August primary also includes two wealthy businessmen, Kevin Rinke and Perry Johnson.",
    "But even an underfunded extremist like Barrett has an opening in a district this close.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "? OH-Sen: Undeterred by Trump's recent endorsement of venture capitalist J.D.",
    "One thing Barrett doesn't need to worry about, though, is the Aug. 2 primary.",
    "On the Democratic side, state Sen. Heidi Campbell has the field to herself.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "He's raising more money nowour goal is a million by the end of March.\"",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "O'Dea faces state Rep. Ron Hanks in the June Republican primary.",
    "(We previously detailed the map's impacts in this post.)",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "(We recently took a closer look at this primary.)",
    "(The old and new 8th Districts do not overlap.)",
    "Subscribe to our podcast, The Downballot!",
    "Redistricting\n? FL Redistricting: Gov.",
    "Governors\n? AL-Gov: Republican Gov.",
    "It's time for a new approach.\"",
    "Kate Brown's radical agenda.\"",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "? NC-Sen: Former Gov.",
    "Please read it.",
    "Sarah Palin.",
    "Brian Kemp."
  ]
}