{
  "id": 8435,
  "mediaId": 157,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "GOP election lawyer accuses Michigan Republicans of 'despicable abuse'",
  "image": "https://www.rawstory.com/media-library/james-craig.png?id=27473093&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/gop-election-lawyer-accuses-candidates-of-despicable-abuse/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.rawstory.com/u/igor_derysh_salon",
  "termIds": [
    651,
    1844,
    307,
    308,
    338,
    428,
    2791
  ],
  "sentences": [
    "The bureau said it has no evidence that the candidates were aware of the fraud but said in its report that it did not fully process all the signatures because it had already identified enough fake ones to put the candidates well short of the 15,000 valid signatures needed to qualify for the ballot.",
    "The Michigan Bureau of Elections released a report on Monday recommending that leading Republican gubernatorial candidates James Craig and Perry Johnson, as well as three others, be disqualified from the ballot after submitting too many fake petition signatures.",
    "The state Board of Canvassers on Thursday deadlocked on whether to accept or reject the recommendation, effectively leaving in place the bureau's decision to disqualify all five candidates, although Republicans have vowed to challenge the outcome in court.",
    "\"Disqualifying two of the highest polling candidates in this primary, as well as three others who have expended significant resources in their campaigns, is disenfranchising to Republican voters who ultimately should be the decision-makers,\" he argued.",
    "Tony Daunt, the other Republican on the board, said there was no question \"a widespread and disgraceful effort to defraud the voters of the state has occurred,\" but insisted that Republican candidates were the real victims.",
    "\"I don't know how anyone in good conscience would say these candidates should be on the ballot when they couldn't do something as fundamental as circulate properly registered voter signatures and turn them in,\" he said.",
    "The Michigan Democratic Party criticized Republicans on the Board of Canvassers for voting to ignore the evidence of fraud and called on the disqualified Republicans to drop out rather than fight the decision in court.",
    "The candidates and their attorneys argued that they were the victims of the circulators' fraud and that it was the Bureau of Elections' responsibility to prove that every individual signature was fraudulent.",
    "\"The Michigan Republican Party candidates ran garbage operations,\" tweeted Stu Sandler, political director of the National Republican Senatorial Committee and former executive director of the Michigan GOP.",
    "\"To keep the integrity of Michigan's democratic process intact, all Republican gubernatorial candidates whose petitions were under consideration at today's meeting should swiftly withdraw from the race.",
    "\"The report of the Board of Canvassers staff was incredibly detailed and legally overcomes any presumption of validity associated with each one of those candidates' petition drives,\" he said.",
    "Though the board has frequently broken down party lines, Pirich said he was surprised by the Republican members' votes because of the \"amount of evidence and the detail of the evidence.\"",
    "After spending years pushing former President Donald Trump's \"Big Lie,\" the Michigan Republican Party is defending its own candidates who were caught up in a massive fraud scheme.",
    "The bureau said it had identified 36 petition circulators who submitted more than 68,000 fake signatures across 10 sets of nominating contests, including the governor's primary.",
    "Paul Cordes, chief of staff of the Michigan Republican Party, told the board that disqualifying the candidates over fraudulent petition signatures would disenfranchise voters.",
    "Republican Chairman Norman Shinkle argued that the circulators \"should all go to prison\" but said he was \"not prepared to shift any burden to the candidates.\"",
    "\"This is of a magnitude beyond my imagination,\" he said, describing it as the \"most despicable abuse of the circulation process that I've ever witnessed.\"",
    "Despite the Republican Party's years-long campaign to stoke fears of election fraud, the Michigan GOP intervened on behalf of the disqualified candidates.",
    "Pirich, a former assistant state attorney general, refuted the GOP argument, noting that \"no one was on the ballot so you're not disenfranchising anyone.\"",
    "Michigan GOP Chairman Ron Weiser also criticized the decision, arguing in a statement that the party was \"fighting against voter disenfranchisement.\"",
    "Republicans on the board sided with the candidates, though it would have required three votes to overturn the Bureau of Elections' recommendation.",
    "\"If you hire scum-buckets to do your work, you're gonna get some scum-bucket results and you should be associated with those results,\" he said.",
    "Republican election attorney John Pirich told Salon that the fraud scheme uncovered by the election officials is \"the largest I've ever seen.\"",
    "\"Most of the people who signed these petitions of the five candidates that were involved in this process weren't real people,\" he said.",
    "\"Fraud is fraud, and under Michigan law, candidates are required to submit a minimum of 15,000 lawfully collected signatures.",
    "An attorney for Johnson said that the process that disqualified him had \"fatal flaws that didn't follow election laws.\"",
    "They did not meet that requirement,\" LaVora Barnes, chairwoman of the Michigan Democratic Party, said in a statement.",
    "Michiganders deserve accountable leaders, and these candidates have shown they are not capable of that.\"",
    "Craig called Thursday's outcome a \"travesty\" and vowed to file an \"immediate appeal\" to the courts.",
    "Pirich argued that the candidates are responsible for the petition signatures they turn in.",
    "\"So there's no real legal harm to anyone, in the sense that these weren't real voters.",
    "\"The fact the Michigan Republican Party is defending all this fraud is embarrassing.\"",
    "Pirich, however, predicted the candidate would lose his bid to get on the ballot.",
    "Other Republicans also took issue with the state party's attempt to intervene.",
    "\"I mean, to put them on the ballot would be an insult to the whole process.\"",
    "These were fictitious signatures of fraudulent circulators.",
    "Craig insisted that he expects to prevail in court.",
    "So that's a bogus argument.\""
  ]
}