{
  "id": 867,
  "mediaId": 881,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "The 2022 elections could determine the fate of abortion access for years in a number of major swing states.",
  "image": "https://video-images.vice.com/articles/6271421856f07d00947c82b3/lede/1651589876465-abortion-roe-v-wade-protest.png?crop=1xw:0.8433xh;0xw,0.096xh&resize=20:*",
  "link": "https://www.vice.com/en/article/5dgxzb/states-that-will-ban-abortion",
  "sentiment": "0",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron Joseph",
  "authorUrl": "https://www.vice.com/en/contributor/cameron-joseph",
  "termIds": [
    661,
    1761,
    1844,
    2095,
    2326,
    428,
    482,
    2550,
    2672,
    2791
  ],
  "sentences": [
    "Kari Lake, the Republican front-runner to replace Ducey, has called for Arizona to pass a carbon copy? of the law in Texas, which effectively bans abortion at six weeks, while Karrin Taylor Robson, the GOP establishment's favored candidate, has called the Texas law a victory for life.?\nArizona also has a law on the books from 1901a decade before it became a statethat calls for prison time for anyone who assists in an abortion, though it's unclear whether that law could be applied now.",
    "DeSantis is the heavy front-runner for reelection, but even if Rep. Charlie Crist or Florida Agriculture Commissioner Nikki Fried, the two strongest Democratic candidates, manage to win, Florida's Republican legislators just passed a gerrymandered map that will likely keep them in power for the next decade and block any attempts to repeal the newly minted law.",
    "Wisconsin Republicans have gerrymandered their state legislative maps so aggressively that it's an almost-certainty they'll maintain control of the legislature even in a good election year for Democrats, meaning that even if Evers wins reelection this fall they'll stand in the way of any attempts to re-legalize abortion in Wisconsin if Roe v. Wade falls.",
    "Fully 26 states are certain or likely to ban abortion if and when Roe is overturned, according to the Guttmacher Institute, an abortion rights research organization, including 13 states that have passed trigger laws? that would fully or partly ban abortion if Roe falls.",
    "Pennsylvania state Sen. Doug Mastriano has already introduced a bill to ban abortion after six weeks of pregnancy, while former Rep. Lou Barletta has pledged he will be a governor who signs pro-life legislation.?\nIf Roe falls, Wisconsin law will likely ban abortion.",
    "An 1849 law in Wisconsin makes abortion a felony punishable by up to six years in prisonand while it was amended in 1985 to apply to those assisting in the abortion and not the pregnant person, it has no exceptions for cases of rape or incest.",
    "Democratic front-runner Stacey Abrams opposes the law, but even if she wins, she'd need a massive landslide to overturn it, as Republican gerrymanders mean the state Legislature is likely to remain firmly in GOP hands after the election.",
    "It doesn't appear Sununu and a majority of state Republicans have a strong desire to push further abortion restrictionshe supports a bill to amend the law he just signed to include exemptions for rape, incest, and fetal abnormality.",
    "A Supreme Court draft opinion that leaked Monday night to Politico indicated the majority of the court will overturn Roe this summer, ending a half-century in the U.S. of constitutional protection for abortion rights.",
    "The Supreme Court's drafted plan to overturn Roe v. Wade will unleash chaos across the country, leading to a patchwork of abortion laws and state-by-state political wars over whether abortion will be legal.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "Here's a state-by-state rundown of where things stand in key swing states where the 2022 elections for governorship and state legislature could determine the fate of abortion access for years to come.",
    "Nevada is one of the only swing states with constitutional protections to abortion: In 1990, voters passed a ballot initiative supporting the right to an abortion in the first 24 weeks of pregnancy.",
    "The states with laws banning or significantly restricting abortion include some of the most important political battlegrounds in the 2022 midterms: Arizona, Georgia, Michigan, and Wisconsin.",
    "Brian Kemp signed a law in 2019 that would ban abortion at the point a heartbeat can be detected in the fetususually around six weeks of pregnancy, before many women know they are pregnant.",
    "Gretchen Whitmer tweeted Monday night that she will fight like hell? to protect abortion access in the state, and last month filed a lawsuit seeking to invalidate the 1931 law in court.",
    "Wisconsin Republicans passed a number of measures restricting abortion access the last time they controlled the state, between 2011 and 2018, with the support of then-Wisconsin Lt. Gov.",
    "The GOP already has control of the state's Legislature, and both of the GOP's gubernatorial front-runners have indicated they'll push for more abortion restrictions in the state.",
    "If she wins, she'd need a pro-abortion-rights majority in the state Legislature to do soboth chambers are currently controlled by the GOP, but are up for reelection this fall.",
    "Whether he wins reelection this fall or not, that 1849 law is likely to face a test in state courtsthough conservatives have a majority on the state Supreme Court.",
    "His main primary opponent, former Sen. Dean Heller, has promised to push for the most conservative pro-life laws enacted in the state of Nevada.?\nRepublican Gov.",
    "A 1931 Michigan law that criminalizes abortion as manslaughter is still on the books, and could be enforced if and when the Supreme Court strikes down Roe.",
    "Chris Sununu signed a law that bans abortion after 24 weeks of pregnancy in 2021 and mandates ultrasounds, but most abortion remains legal in the state.",
    "Arizona Secretary of State Katie Hobbs, the Democratic front-runner, supports legal abortion and has pledged to try to repeal the 15-week abortion ban.",
    "Clark County Sheriff Joe Lombardo, the GOP front-runner to face Sisolak, says he's pro-life but won't push to change the state's current laws.",
    "The GOP-controlled state Legislature has blocked her attempts to repeal the law; legislators are up for reelection this fall, as is Whitmer.",
    "Michigan Republican front-runner James Craig has pledged to do whatever I can? to keep that law in place should he win the governorship.",
    "Abortion is currently legal in Pennsylvania up until the 24th week of pregnancy under state law, and both term-limited Democratic Gov.",
    "And in some of the most crucial swing states, laws that go back to before the Civil War could immediately be used to ban abortion.",
    "Doug Ducey recently signed a law that bans abortion after 15 weeks of pregnancyand doesn't include exceptions for rape or incest.",
    "Tom Wolf and Attorney General Josh Shapiro, Democrats' likely 2022 nominee to succeed Wolf, support abortion access.",
    "In other key swing states, like Pennsylvania, access to abortion could be just one election away from being banned.",
    "Tony Evers has pushed to repeal this law but was rebuffed by Wisconsin's GOP-controlled state Legislature.",
    "Kleefisch has said she would sign a heartbeat bill? that would abortion at around six weeks of pregnancy.",
    "Her main primary opponent, Kevin Nicholson, has said he'd support a full ban on abortion in the state.",
    "If Evers loses, Republicans will likely move to further codify the state's abortion ban.",
    "If Roe v. Wade is indeed struck down, it would throw the issue back to the states.",
    "Kemp and his GOP primary opponent, former Sen. David Perdue, both support the law.",
    "Ron DeSantis recently signed a law that bans abortion after 15 weeks of pregnancy.",
    "That law would go immediately into effect if the Supreme Court overturns Roe.",
    "That law doesn't include exemptions for rape, incest, or human trafficking.",
    "But if Lake or Robson wins, they may push for a near-total ban on abortion.",
    "His successors may push for even more restrictionsor an outright ban.",
    "But if Republicans win the governorship, state law could change fast.",
    "Rebecca Kleefisch, the GOP front-runner to face Evers this fall.",
    "Sununu is the heavy favorite for reelection this fall.",
    "Steve Sisolak supports the current law.",
    "Wisconsin Democratic Gov.",
    "Michigan Democratic Gov.",
    "Georgia Republican Gov.",
    "Republican Gov.",
    "Republican Gov.",
    "Democratic Gov."
  ]
}