{
  "id": 8964,
  "mediaId": 261,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Perry Johnson files lawsuit in federal court to get on GOP primary ballot for governor",
  "image": "https://www.gannett-cdn.com/presto/2022/04/02/PDTF/d10d3d70-7e05-4a9f-a0cf-3b87fc927869-04022022_trumprally-10.jpeg?crop=2399,1350,x0,y122&width=2399&height=1350&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/2022/06/06/perry-johnson-federal-lawsuit-gop-primary-ballot/7536346001/",
  "sentiment": "0",
  "mediaOutlet": "Detroit Free Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arpan Lobo",
  "authorUrl": "https://www.freep.com/staff/4448999001/arpan-lobo/",
  "termIds": [
    651,
    1682,
    1844,
    2002,
    2171,
    2298,
    3075,
    3095,
    3099
  ],
  "sentences": [
    "Johnson's suit asks the court to allow him to stay on the ballot through a slew of legal maneuvering: he wants the court to declare the law unconstitutional as applied to him; issue an order stopping state election officials from enforcing the 15,000 signature requirement for candidates to get on the ballot; issue an order putting his name on the ballot or decreasing the signature requirements; and stop the state from printing ballots until he's had the chance to argue his case.",
    "For Subscribers:Procedural step squashed 5 Republican campaigns for Michigan's next governor\nIn the complaint filed Monday, Johnson's campaign argues that Michigan voters would be disenfranchised if he was not placed on the ballot, writing, \"it is in the public's interest to ensure that the fraudulent actions of a few do not cause the disenfranchisement of millions of Michigan voters who support and want to vote for Johnson as their Governor.\"",
    "Johnson's lawsuit, filed in the U.S. District Court for the Eastern District of Michigan, calls for an injunction against Secretary of State Jocelyn Benson and Michigan Bureau of Elections officials to prevent them from finalizing the August primary ballot before it is distributed to military and overseas voters June 18.",
    "Issues with Johnson's petition included signatures from voters who had changed addresses or had been removed from the list of qualified voters for reasons like moving out of Michigan or dying, misspelled addresses and names and repeated usage of uncommon signature abbreviations, per the Bureau report.",
    "Court of Appeals judges ruled that the Bureau of Elections did not have an obligation to individually review each signature submitted by the Johnson campaign before determining certain signatures were invalid, and the Supreme Court declined to take up the case.",
    "Along with Johnson, the Bureau of Elections found issues with signatures submitted by former Detroit Police Chief James Craig, Grand Haven financial adviser Michael Markey, Byron Center businesswoman Donna Brandenburg and Michigan State Police Capt.",
    "The Oakland County businessman was one of five Republican gubernatorial contenders who were disqualified from appearing on the ballot after state election officials found issues with petition signatures submitted by their respective campaigns.",
    "Gretchen Whitmer, a Democrat, in November: Norton Shores businesswoman Tudor Dixon, Farmington Hills pastor Ralph Rebandt, Mattawan chiropractor Garrett Soldano, Pontiac businessman Kevin Rinke and Ottawa County real estate agent Ryan Kelley.",
    "Perry Johnson, a Republican governor hopeful who was disqualified from appearing on the ballot for the August primary, filed a federal lawsuit Monday in a last-ditch attempt to stop ballots from being printed without his name.",
    "Johnson, who poured $2.5 million of his own money into his gubernatorial campaign, was one of five Republican governor contenders to miss the ballot after an unprecedented signature fraud scandal rocked the race.",
    "Johnson's campaign turned in over 23,000 signatures, but Bureau of Elections staff found around 9,400 of the signatures to be invalid, leaving Johnson short of the 15,000 required to get on the ballot.",
    "The Bureau of Elections sent a list of certified candidates to county clerks Friday evening, according to a spokesperson for Secretary of State Jocelyn Benson.",
    "Previous efforts to get back on the ballot fell short at both the Michigan Court of Appeals and the Michigan Supreme Court last week.",
    "Five Republican gubernatorial candidates have qualified to appear on the primary ballot in hopes of facing Gov.",
    "Craig, Markey and Brandenburg all filed unsuccessful court challenges to get on the August primary ballot.",
    "The board deadlocked 2-2 along party lines during a May 26 vote, effectively leaving him off.",
    "The deadline to finalize ballots for the August primary under state law was Friday, June 3.",
    "Brown ended his run after the Bureau reported signature fraud associated with his campaign.",
    "The Bureau recommended to the State Board of Canvassers Johnson be left off the ballot.",
    "Free Press staff writer Clara Hendrickson contributed to this report.",
    "Michael Brown, of Stevensville."
  ]
}