{
  "id": 8974,
  "mediaId": 151,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "POLITICO Playbook: Yellen admits Biden got inflation wrong",
  "image": "https://www.politico.com/dims4/default/6d67e38/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F8f%2F06%2Fef4d94f04450b2e1dde30914859d%2Fus-ireland-60132.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/06/04/yellen-admits-biden-got-inflation-wrong-00037235",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1844
  ],
  "sentences": [
    "NBC's Emily Gold  POLITICO's Traci Schweikert and Chase Sutton  E&E News' Carlos Anchondo  Scott Tranter  Protocol's Sydney Salazar and Chris Fong  Camden Stuebe of Free the Facts  Joey Coon of the Niskanen Center  WaPo's Colby Itkowitz  ProPublica's Justin Elliott  Amy Surber  Koch Industries' Steve Lombardo  David Bolger  Meta's Ryan Daniels  Gopuff's Jason Attermann  John Arundel of Perdicus Communications  Mike Murphy  Pangiam's Andrew Meehan  Mort Zuckerman  John O'Connell (77)  Amelia Showalter\nTHE SHOWS (Full Sunday show listings here):\nCNN State of the Union: Sen. Chris Murphy (D-Conn.)  Commerce Secretary Gina Raimondo  Denver Riggleman.",
    "More from the Philly Inquirer  Bloomberg Businessweek's Felix Gillette on how Oz won with one of the most audacious media strategies in American political history\nRegarding Fetterman: Amid ongoing questions about his health, he released a letter from his cardiologist  unusually scolding in tone  that revealed Fetterman was diagnosed with atrial fibrillation in 2017 but didn't follow up with doctors or take his meds, per the Pittsburgh Post-Gazette.",
    "NEW NOMINEES  The White House announced several new nominees, including Nate Fick as ambassador at large for cyberspace and digital policy, Daniel Rosenblum as ambassador to Kazakhstan, Kathleen Kavalec as ambassador to Romania, Richard Delmar as IG of the Treasury Department, Karla Gilbride as general counsel of the Equal Employment Opportunity Commission and Terrence Edwards as IG for the National Reconnaissance Office.",
    "CLICKER  The nation's cartoonists on the week in politics, edited by Matt Wuerker  17 funnies\nGREAT WEEKEND READS, curated by Ryan Lizza:\n Trial Diary: A Journalist Sits on a Baltimore Jury, by ProPublica's Alec MacGillis: Could 12 strangers agree on justice in Baltimore, a city riddled with killings and distrust of the police, in a shooting case where the victim was an actor on the legendary drama The Wire'?",
    "Now Bloomberg reports that in a new book about JANET YELLEN, the Treasury secretary was an early internal dissenter:\nPrivately, Yellen agreed with Summers that too much government money was flowing into the economy too quickly,' writes OWEN ULLMANN, the book's author and a veteran Washington journalist, referring to former Treasury Secretary LAWRENCE SUMMERS, who severely criticized the size of the aid plan.",
    "POLITICO Playbook: Yellen admits Biden got inflation wrong\nBy RYAN LIZZA, EUGENE DANIELS and RACHAEL BADE\n06/04/2022 11:05 AM EDT\nPresented by\nWith help from Eli Okun and Garrett Ross\nDRIVING THE DAY\nJUST POSTED  Maureen Dowd on Johnny and Amber: Trouble in Paradise\nBIDEN'S GREAT DEBATE  In the first year of most new administrations there is often one great debate that comes to define the president's term.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "BOMBSHELL GITMO TESTIMONY: JAMES MITCHELL, the psychologist who famously helped develop the Bush-era enhanced interrogation techniques, said for the first time in court that former CIA Director GINA HASPEL watched waterboarding happen at a CIA black site in Thailand, NYT's Carol Rosenberg and Julian Barnes report.",
    "The dominant foreign policy players in the Bush administration were skeptical of the Clinton-era focus on terrorism\nAll right, you've covered your ass now, Bush said dismissively after his intelligence briefer presented the famous Bin Ladin Determined to Strike US memo the month before the 9/11 attacks.",
    "Yellen's concern about inflation is why she had sought without success to scale back the $1.9 trillion relief plan by a third early in 2021 before Congress passed the enormous program,' wrote Ullmann, who had unfiltered access' to Yellen as he researched the book, according to publisher PublicAffairs.",
    "Russia is calling in the heads of U.S. news outlets in the country for a meeting Monday: If the work of the Russian media  operators and journalists  is not normalized in the United States, the most stringent measures will inevitably follow, a Kremlin spokesperson warned, per Reuters.",
    "Many relied on U.S. support, by WaPo's Joyce Sohyun Lee, Meg Kelly and Atthar Mirza: A joint Washington Post analysis reveals for the first time that the United States supported the majority of air force squadrons involved in the Saudi coalition's years-old air campaign.",
    "The Plot to Out Ronald Reagan, by James Kirchick in POLITICO Magazine, adapted from his new book, Secret City: A group of Republicans tried to stymie what they alleged was a nefarious homosexual network within the campaign of their own party's standard-bearer.",
    "Jacobs' stance in the wake of mass shootings in Texas and nearby Buffalo, N.Y., elicited swift backlash from local Republicans, pro-gun rights groups and DONALD TRUMP JR. We have a problem in our country in terms of both our major parties, Jacobs said Friday.",
    "She continued, There have been unanticipated and large shocks to the economy that have boosted energy and food prices and supply bottlenecks that have affected our economy badly that I didn't  at the time  didn't fully understand, but we recognize that now.",
    "I'm Still Alive but Sh*t Is Getting Wild': Inside the Siege of the Amarula, Outside magazine: When vast gas reserves were discovered off the idyllic coast of northern Mozambique, a crew of roughnecks flew in from around the world to make their fortunes.",
    "CHAOS FOR THE MICHIGAN GOP: The Michigan Supreme Court sent frontrunner JAMES CRAIG and other Republican gubernatorial candidates packing Friday, refusing to reinstate them on the primary ballot over fraudulent signatures on their nominating petitions.",
    "That decision  a marked difference from how prosecutors handled PETER NAVARRO and STEVE BANNON  appeared to hinge on Meadows' and Scavino's engagement with the committee and/or their stronger claims to privilege as top White House officials.",
    "More\nTRUMP ALUMNI  Jeffrey Clark, whose efforts to cast doubt on the 2020 election led to Trump trying to install him as acting A.G. in January 2021, is joining Russ Vought's Center for Renewing America, per Axios' Jonathan Swan.",
    "A JAN. 6 REPRIEVE: The Justice Department has decided not to charge MARK MEADOWS and DAN SCAVINO with contempt of Congress for defying subpoenas from the House Jan. 6 committee, NYT's Alan Feuer and Luke Broadwater scooped.",
    "It had two devastating effects: It made inflation worse, and it created a political environment that torpedoed what most Democrats saw as the more important and ambitious legislative priorities of Build Back Better.",
    "THE WIZARD OF OZ: DONALD TRUMP is the Republican Party's man behind the curtain, and he reigned supreme again (just barely) in Pennsylvania on Friday, as DAVID MCCORMICK conceded to MEHMET OZ in the Senate primary.",
    "ALABAMA AWAITS: In the GOP Senate runoff between KATIE BRITT and Rep. MO BROOKS this month, Trump is considering weighing in to pick a winner, but he's torn between the two, Natalie Allison reports this morning.",
    "WHY GUN RESTRICTIONS NEVER PASS: Rep. CHRIS JACOBS (R-N.Y.) abruptly dropped his reelection bid Friday, only a week after abandoning party orthodoxy to back new limits on guns, including an assault weapons ban.",
    "MSNBC The Sunday Show: House Majority Whip Jim Clyburn (D-S.C.)  Rep. Ted Deutch (D-Fla.)  Stacey Stevenson  Daniel Goldman  Rep. Madeleine Dean (D-Pa.)  Rep. Sheila Jackson Lee (D-Texas)  Gene Sperling.",
    "REVISE YOUR CALENDARS: Biden's planned swing through Saudi Arabia and Israel this month has been postponed to July as part of a larger Middle East trip, NBC's Andrea Mitchell and Josh Lederman scooped.",
    "Liberals thought he needn't pay too much attention, and moderates, who won, argued that attacking the deficit would appease bond traders, thus lowering interest rates and unleashing economic growth.",
    "HEADS UP: 53-year-old Michigan man and former NYC cop JEROME FELIPE was arrested outside the Capitol on Friday with a fake badge, a BB gun, body armor, high capacity magazines and other ammunition.",
    "How My Hometown Produced a Jan. 6 Sedition Suspect, by Caitlin Chandler in WaPo Magazine: One writer discovers her small Virginia town's underside of conspiracy, guns and anti-government belief.",
    "This week he added that inflation was worsened by an overlarge fiscal package at the start of Biden's presidency and the Fed's failure (which I shared) to recognize the problem early enough.",
    "MOMENTUM ON PRIVACY BILL: Bipartisan congressional leaders unveiled a deal Friday on major legislation that would create online privacy rights and restrict companies' use of people's data.",
    "CBS Face the Nation: Kansas City, Mo., Mayor Quinton Lucas  Rep. Adam Schiff (D-Calif.)  Sen. Pat Toomey (R-Pa.)  Walter Koroshetz  Betsey Stevenson  new polling with Anthony Salvanto.",
    "I want every American to know that I'm taking inflation very seriously and it's my top domestic priority, Biden said in May, more than a year after the American Rescue Package debate.",
    "How Ukraine's Greatest Novelist Is Fighting for His Country, by Giles Harvey in the NYT Magazine: Andrey Kurkov has spent his life writing about realities so absurd they defy satire.",
    "PLAYBOOKERS\nTrump administration alumni Brett Talley and Alice Lacour's quasi-anonymous, popular true crime podcast has stirred controversy as listeners discover their identities.",
    "100 DAYS OF WAR IN UKRAINE \n Ukraine said its forces had recaptured 20% of the territory they lost in Sievierodonetsk, the key eastern city now at the fulcrum of Russia's assault.",
    "I think I was wrong then about the path that inflation would take, she told CNN's Wolf Blitzer this week after he showed clips of her calling the problem small and manageable.",
    "The onslaught of Russian artillery has brought the war to a demoralizing stage for many Ukrainian soldiers, WaPo's Siobhn O'Grady, Anastacia Galouchka and Paul Sonne report.",
    "Biden got in hot water this week over reports that he planned to meet with Crown Prince MOHAMMED BIN SALMAN, though the reasons for this delay weren't immediately clear.",
    "One of the questions about the Biden administration has been whether there was anyone inside offering the president an alternative economic argument about inflation.",
    "The emerging rift could prove to be temporary, and backers of the bipartisan draft hope that Sen. Cantwell can be brought on board, WSJ's John McKinnon reports.",
    "STAFFING UP  Lt. Gen. Darryl Williams has been recommended to the White House as the next commander of U.S. Army Europe/Africa, Paul McLeary reports.",
    "More from The Guardian\n Two Reuters journalists were hurt and their driver killed as they were trying to reach Sievierodonetsk, per Reuters.",
    "After falling out of Trump world's good graces, Brooks is back in contention, with his recent lies about the 2020 election pleasing Trump.",
    "Playbook couldn't happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Setota Hailemariam and Bethany Irvine.",
    "Time Has Proved the Slow-Riot Theory of Mass Shootings, by The Atlantic's David French: We don't actually know how to solve the crisis.",
    "But there's at least one big hurdle: Senate Commerce Chair MARIA CANTWELL (D-Wash.) hasn't signed on, as she crafts her own version.",
    "(It's striking that Oz may hit the campaign trail before Fetterman after all  the opposite of what most expected on election night.)",
    "Biden's economic advisers dismissed the prospects of inflation, then later argued that it was transitory and nothing to worry about.",
    "In 2009, BARACK OBAMA's economic team made a fateful decision that its stimulus package could not be larger than a trillion dollars.",
    "As oil and gas fuel a new war in Europe, Alex Perry pieces together, shot by shot, a stunning morality tale for the global economy.",
    "Among the sticking points is that Cantwell wants to make it easier for consumers to sue, a tough pill for Republicans to swallow.",
    "In 2001, the great debate in GEORGE W. BUSH's young presidency was over how serious he took the threat from al-Qaida before 9/11.",
    "Two hundred holed up at the Amarula Lodge, where the expats faced a choice: save themselves, or risk it all to save everyone.",
    "It's a conservative bastion that he easily won twice, but where his endorsement record is mixed  and in need of vindication.",
    "For Trump, Alabama is an important state to get right in the wake of a series of losses in three gubernatorial primaries.",
    "Yellen was recently the first top Biden official to admit she was incorrect in her 2021 public remarks on inflation.",
    "You mean to tell me that the success of the program and my reelection hinges on  a bunch of f---ing bond traders?\"",
    "But in March 2021, Islamist rebels attacked, and the foreigners and thousands of Mozambicans were abandoned.",
    "McCormick's decision in the middle of a recount means Republicans can now unify against Democratic Lt. Gov.",
    "The State Department announced Dorothy McAuliffe as the new special representative for global partnerships.",
    "But the doctor said Fetterman is taking his health seriously now and should be OK to campaign and govern.",
    "That experience set the stage for the subject of the great debate of JOE BIDEN's year one: inflation.",
    "BIDEN'S SATURDAY  The president is in Rehoboth Beach, Del., and has nothing on his public schedule.",
    "A big political question looming over the midterms is will the president now admit that publicly?",
    "Natasha Silva is now senior director of federal government relations at the National MS Society.",
    "FOX Fox News Sunday, guest-anchored by John Roberts: House Minority Whip Steve Scalise (R-La.)",
    "Related (and major) investigation: Saudi-led airstrikes in Yemen have been called war crimes.",
    "VP KAMALA HARRIS' SATURDAY  The VP is in Los Angeles and has nothing on her public schedule.",
    "You got up and you died,' London Review of Books: Madeleine Schwartz at the Bataclan trial.",
    "HAPPY BIRTHDAY: Sen. Mike Lee (R-Utah)  Reps. Chris Pappas (D-N.H.) and Jim Baird (R-Ind.)",
    "Panel: Rep. Veronica Escobar (D-Texas), George Conway, Ashley Allison and Scott Jennings.",
    "Drop us a line with your inflation mea culpas: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "Yet Britt seems to lead in polling and has the support of retiring Sen. RICHARD SHELBY.",
    "CNN Inside Politics: Panel: Molly Ball, Seung Min Kim, Melanie Zanona and Hans Nichols.",
    "In 1993, the great debate in BILL CLINTON's White House was about deficit reduction.",
    "TRANSITIONS  Miguel Ayala will be comms director for Rep. Steven Horsford (D-Nev.).",
    "Democrats will be arguing over who got what wrong on inflation for years to come.",
    "Correction: Wednesday's Playbook listed outdated job information for Mark Green.",
    "ABC This Week: Transportation Secretary Pete Buttigieg  Rep. Tom Rice (R-S.C.).",
    "Joanna Taylor is now director of comms and marketing at Generation Citizen.",
    "She previously was senior comms manager at the National Immigration Forum.",
    "Send Playbookers tips to playbook@politico.com or text us at 202-556-3307.",
    "They told themselves that they could always go back to Congress for more.",
    "He ordered up a stimulus package much larger than the economy required.",
    "Rayna V. Farrell has been named manager of corporate comms at Bechtel.",
    "She most recently was deputy head of comms at the Business Roundtable.",
    "She previously was legislative director for Rep. Bill Keating (D-Mass.",
    "Panel: Chris Christie, Donna Brazile, Maggie Haberman and Julie Pace.",
    "Sometimes it's obvious, other times it's only apparent in hindsight.",
    "Not many details yet on why he was there, The Detroit News reports.",
    "PAUL KRUGMAN recently admitted, I called inflation wrong last year.",
    "Panel: Katie Pavlich, Jacqui Heinrich, Josh Holmes and Marie Harf.",
    "He previously was comms director for Rep. Jan Schakowsky (D-Ill.).",
    "He has reoriented his White House around correcting that mistake.",
    "Evidence of a great debate between competing camps has been slim.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\n9 THINGS THAT STUCK WITH US\n1.",
    "But it is also possible that  the effort is doomed once again.",
    "More than 40 years later, the story can finally be told.",
    "If you stray from a party position, you are annihilated.",
    "Fetterman's also been diagnosed with cardiomyopathy.",
    "Inflation is now the dominant issue of the midterms.",
    "This is starting to become a trend among economists.",
    "More from NYT's Nicholas Fandos and Jesse McKinley.",
    "Haspel's law firm and the CIA declined to comment.",
    "That leaves the party's efforts to take on Gov.",
    "They couldn't, and an anemic recovery followed.",
    "It was perfect preparation for this moment.",
    "Clinton famously said at one key meeting.",
    "He said she didn't take part directly.",
    "She's a former first lady of Virginia.",
    "Did someone forward this email to you?",
    "More from the Detroit Free Press\n5.",
    "), and is a Stephen Lynch alum.",
    "Thanks for reading Playbook.",
    "GRETCHEN WHITMER in flux.",
    "Good Saturday morning.",
    "Biden got it wrong.",
    "JOHN FETTERMAN.",
    "Gene Sperling.",
    "Sign up here.",
    "3.",
    "2.",
    "4.",
    "6.",
    "8.",
    "7.",
    "9."
  ]
}