{
  "id": 902,
  "mediaId": 19,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Exclusive  Chief James Craig Rips Woke Prosecutors': Bad Guys Know There's No Consequences' for Crime",
  "image": "https://media.breitbart.com/media/2020/12/detroit-police-chief-james-craig-ap-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/18/chief-james-craig-rips-woke-prosecutors-bad-guys-know-no-consequences-crime/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1844,
    1844,
    1997,
    1997,
    2303,
    2303,
    773,
    1374,
    1374,
    1237,
    1237,
    1147,
    1147,
    773,
    428,
    428,
    427,
    427,
    152,
    296,
    296,
    152,
    2791,
    2791,
    2826,
    2826,
    2873,
    2873,
    2609,
    2609,
    2713,
    2713
  ],
  "sentences": [
    "One of Siemon's policies was to limit felony firearm charges, which she claimed disproportionately impact[ed] Black people.? In response, the Crimestoppers of Mid-Michigan board of directors penned an op-ed in the Lansing City Pulse, condemning Siemon's policy changes as misguided? and counter to the mission? of the Crimestoppers organization.",
    "There, embattled Manhattan District Attorney Alvin Bragg was discovered in January to have sent a notice to his prosecutorial staff indicating his office would cease to seek jail and prison time for all but the most serious crimes,? according to a New York Times chronicle of Bragg's issues.",
    "Gretchen Whitmer (D) this year, noted that the far-left movement to defund the police and the overarching anti-police sentiment from that same Democrat faction had contributed to crime spikes, but he said controlling crime is more than focusing on the police.?\nWhat are the root causes?",
    "They can continue to do and engage in the bad deeds that they're doing because they know there are no consequences to it.?\nThe Michigan Republican said he found the issue to be consistent across the country, referencing New York City as another example.",
    "Former Detroit Police Chief James Craig believes rooting out woke prosecutors? and woke judges? is critical to overcoming nationwide crime waves, providing his view on the matter in an interview on SiriusXM's Breitbart News Saturday.",
    "Craig said, What they're doing is making victims today out of criminals instead of addressing the real victim, particularly in our vulnerable communities, and basically, these are communities of color.",
    "Siemon made headlines when she announced policy changes in 2021 to reduce racial disparities in the criminal justice system,? according to the Lansing State Journal.",
    "Listen:\nCraig pointed to Democrat leaders, who he said were complicit? in allowing overly lenient prosecutors and judges to continue to hold such powerful positions.",
    "Craig noted the felony firearm charge is a very serious offense,? asking, So if you're not going to charge that client, what message does that send to criminals?",
    "Craig worked for the Los Angeles Police Department for about 30 years, then became police chief in Portland, Maine, and then later in Cincinnati, Ohio.",
    "The former law enforcement official cited Democrat Carol Siemon, the Ingham County prosecutor, as an example of poor criminal justice practices.",
    "Craig, the current frontrunner in Michigan's Republican gubernatorial primary, has an extensive background in law enforcement.",
    "Craig then stepped into the role of chief of the Detroit Police Department, where he served for eight years until 2021.",
    "Governors certainly have an opportunity to use your bully pulpit to really call out woke prosecutors and woke judges.",
    " How many Democrats or the president or the governor or mayors are actually standing up and saying, Enough of this.",
    "They're the real victims.?\nWrite to Ashley Oliver at aoliver@breitbart.com.",
    "We need these violent predatory criminals locked up'?",
    "Bad guys know there's no consequences,? Craig said.",
    "Craig, who is hoping to unseat Michigan Gov.",
    "The number one cause is no consequences.",
    "Follow her on Twitter at @asholiver.",
    "Nobody's doing that,? Craig said."
  ]
}