{
  "id": 929,
  "mediaId": 19,
  "date": "3/21/2022 12:00:00 AM",
  "headline": "Poll: Joe Biden's Approval Rating Is 36 Percent, Impacting Battleground States",
  "image": "https://media.breitbart.com/media/2022/03/joe-biden-polls-number-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/21/poll-joe-bidens-approval-rating-is-36-percent-impacting-battleground-states/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    815,
    886,
    1119,
    1147,
    1646,
    1844,
    1951,
    2087,
    4325,
    571,
    2595,
    2672
  ],
  "sentences": [
    "Sen. Catherine Cortez Masto (D-NV) will have a tough time defending her seat against likely Republican and Trump endorsed challenger Adam Laxalt with Biden's approval numbers so low.",
    "Gretchen Whitmer (D) is looking to defend herself against many Republican challengers, including frontrunner James Craig, who was a strong supporter of the trucker convoys.",
    "President Joe Biden's nationwide approval rating is dangerously low at 36 percent, impacting races down-ballot in battleground states, a Monday Civiqs poll revealed.",
    "Sen. Raphael Warnock (D-GA) will also have a tough time contending with Republican challenger Herschel Walker amid the president's sagging approval numbers.",
    "In the Senate, Republicans look to retain an open seat with likely Republican primary candidate David McCormick leading in the polls against Mehmet Oz.",
    "The lack of support among independents for Biden is impacting battleground states where Republicans hope to defeat Democrats in November.",
    "In Georgia, a state where Donald Trump narrowly lost to Biden in 2020 by less than half a percent is polling poorly for the president.",
    "While 55 percent disapproved of Biden's performance, independents are majorly dragging down the president's polling numbers.",
    "Biden's polling will likely impact Sen. Mark Kelly's (D-AZ) reelection bid against likely Republican Blake Masters.",
    "Radical Democrat candidate Stacey Abrams will likely be dragged down in her race against either Gov.",
    "A number of highly contested seats may be impacted by Biden's low approval rating in Pennsylvania.",
    "In Arizona, where Trump lost by 10,457 votes, Biden's approval rating is just 35 percent.",
    "The key race that may be impacted the most in Michigan is the gubernatorial race.",
    "Biden's approval rating in Georgia may greatly impact the race for governor.",
    "Only 35 percent approved of Biden in the state with 57 disapproving.",
    "The poll sampled 179,724 respondents from January 20 to March 20.",
    "Just 35 percent approved of Biden, while 58 percent disapproved.",
    "Among independents, only 24 percent approved of Biden.",
    "Biden's approval rating in Michigan is also terrible.",
    "Pennsylvania voters have also given Biden poor marks.",
    "The gubernatorial race is an open seat with Gov.",
    "Nevada also has low approval ratings for Biden.",
    "Only 32 percent of Georgians approved of Biden.",
    "Brian Kemp (R) or former Senator David Purdue.",
    "Fifty-eight percent disapproved.",
    "Sixty-six percent disapproved.",
    "Tom Wolf (D) term limited.",
    "Just 35 percent approved.",
    "Fifty-seven disapproved.",
    "Fifty-eight disapproved.",
    "of Biden.",
    "Gov."
  ]
}