{
  "id": 983,
  "mediaId": 43,
  "date": "2/11/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 2/11",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/2/11/2078594/-Daily-Kos-Elections-Live-Digest-2-11",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2277,
    2277,
    2209,
    2209,
    2186,
    2186,
    2008,
    2008,
    1639,
    1639,
    1395,
    1395,
    1238,
    1238,
    1277,
    1277,
    1147,
    1147,
    2818,
    2818
  ],
  "sentences": [
    "Vance's allies at Protect Ohio Values, meanwhile, are going up with their first TV spot since mid-November days after Politico reported that the Peter Thiel-funded group's own polls showed that Vance needs a course correction ASAP that will resolidify him as a true conservative.? The commercial seeks to do that with clips of the candidate attacking elites? and concludes with footage of Fox host Tucker Carlson telling him, You've really, I think, understand what's gone wrong with the country.?\n Friday, Feb 11, 2022  11:51:24 AM Pacific Standard Time  Jeff Singer\nLA-Gov: Republican state Rep. Daryl Deshotel attracted plenty of attention when gave his campaign account $1 million, and he told the Lafayette Daily Advertiser on Thursday, I'm open to everything, but I honestly don't have a target right now.? The state representative, who has described himself as fiscally conservative but more moderate on social issues,? doesn't appear to have specifically mentioned next year's open seat race for governor as a possibility, though, and he also didn't even commit to using the money to aid himself.",
    "The younger Tarkanian (known as Little Tark to his not-friends), was a resident of Las Vegas' Clark County when he lost the:\n2004 general for state Senate\n2006 general for secretary of state\n2010 primary for U.S. Senate\n2012 general for the 4th Congressional District\n2016 general for the 3rd Congressional District\n2018 general for the 3rd Congressional District\nBut while Tarkanian's long string of defeats has made him a punchline to state and national political observers for years, his name recognition, personal wealth, and connections to Nevada's hardcore conservative base meant that he was never just another perennial candidate either party could dismiss.",
    "Friday, Feb 11, 2022  11:43:24 AM Pacific Standard Time  Jeff Singer\nOH-Sen: The Republican firm Co/Efficient has released the very first survey of the May August primary that wasn't done on behalf of a candidate or allied group, and it shows businessman Mike Gibbons leading former state Treasurer Josh Mandel 20-18, with state Sen. Matt Dolan in third with 7%; former state party chair Jane Timken takes 6%, while venture capitalist J.D.",
    "Deshotel instead said, It may be that I end up using the money to support other candidates who I believe can help the state.?\n Friday, Feb 11, 2022  11:56:39 AM Pacific Standard Time  Jeff Singer\nMI-Gov: Blueprint Polling, which describes itself as a sister company? to the Democratic firm Chism Strategies, is out with a survey showing Democratic incumbent Gretchen Whitmer deadlocked 44-44 with former Detroit Police Chief James Craig.",
    "Kean will likely have another line before long: The New Jersey Globe writes that he recently received the unanimous support of the Republican Executive Committee in Warren County, which forms another 14% of the 7th District, which means he is the favorite to win the county organizational line there as well.?\nThis is a short blurb about Daily Kos.",
    "Friday, Feb 11, 2022  11:08:05 AM Pacific Standard Time  Jeff Singer\nNV-02: Douglas County Commissioner Danny Tarkanian, a Republican who finally ended his legendary losing streak in 2020, revealed to the Nevada Independent that he's considering challenging Rep. Mark Amodei in the June primary for Nevada's 2nd Congressional District.",
    "Friday, Feb 11, 2022  12:19:48 PM Pacific Standard Time  Jeff Singer\nNJ-07: On Thursday evening, 2020 nominee Tom Kean Jr. narrowly defeated Assemblyman Erik Peterson at the Hunterdon County Republican Convention, which gives him the important party endorsement in the June primary to take on Democratic incumbent Tom Malinowski.",
    "Friday, Feb 11, 2022  12:02:34 PM Pacific Standard Time  Jeff Singer\nCA-03: Sacramento County Sheriff Scott Jones received an endorsement from Republican Rep. Darrell Issa, who represents an inland San Diego County seat, for the June top-two primary for this open district in Sacramento's eastern suburbs.",
    "Friday, Feb 11, 2022  10:10:50 AM Pacific Standard Time  David Nir\nLA Redistricting: Louisiana's GOP-run state House has passed a new congressional map with two independents joining all 68 Republicans to total 70 votes in favorexactly the number that would be needed to override a veto by Democratic Gov.",
    "Friday, Feb 11, 2022  8:36:14 AM Pacific Standard Time  Jeff Singer\nPA-18: Nonprofit executive Stephanie Fox, a Democrat who didn't report any fourth quarter fundraising with the FEC, has announced that she'll run for a state House seat rather than continue with her congressional bid.",
    "Friday, Feb 11, 2022  8:31:09 AM Pacific Standard Time  Jeff Singer\nNY-Gov: Westchester County Executive George Latimer, who previously backed Attorney General Tish James during her six-week campaign for governor, has now thrown his support behind Democratic incumbent Kathy Hochul.",
    "Tarkanian himself comes from a prominent family: His late father is the legendary University of Nevada, Las Vegas basketball coach Jerry Tarkanian, while his mother, Democrat Lois Tarkanian, was a longtime Las Vegas city councilwoman who now serves on the state Board of Regents.",
    "Sen. Robert Menendez and 2nd Congressional District candidate Jeff Van Drew, who was over a year away from his infamous party switch, appeared in the column identified as \"BURLINGTON COUNTY REGULAR DEMOCRATS\" along with party-backed candidates running for other offices.",
    "She goes on to say she \"used to like Henry Cuellar,\" the congressman Cisneros is hoping to unseat in the March 1 primary, but criticizes him for \"taking money from big insurance and drug companies\" even as the cost of medication and insurance has risen for her.",
    "Friday, Feb 11, 2022  11:59:46 AM Pacific Standard Time  David Nir\nTX-28: Democrat Jessica Cisneros' newest ad is narrated by a woman named Esther who says she's lived in Laredo for four decades but complains, \"Nothing changeseven the problems stay the same.\"",
    "The challenger joined a pro-development slate of candidates seeking seats on the 5-member body, and this time, fortune was finally on his side: Tarkanian won the nomination 50.1-49.9a margin of 17 votesand he had no opposition in the general election.",
    "The left-wing group Justice Democrats is also reportedly spending $78,000 to air a spot on Cisneros' behalf, attacking Cuellar for living it up as a politician (he \"got rides in donors' private jets\" and \"fixed his BMW with campaign cash\").",
    "Friday, Feb 11, 2022  11:33:20 AM Pacific Standard Time  Jeff Singer\nAZ-Sen: The Republican pollster Co/Efficient, which tells us they have no client, finds no clear favorite in the August GOP primary to take on Democratic Sen. Mark Kelly.",
    "The far-right Club for Growth joined in the fracas by releasing a poll showing former Nevada Attorney General Adam Laxalt beating him in a hypothetical primary, but all of this sound and fury ended up signifying nothing for 2020 at least.",
    "Amodei quickly responded by protesting, \"In no way, shape, or form, did I indicate support for impeachment,\" though even expressing openness to an inquiry was enough to infuriate not only the rank and file but top Republicans as well.",
    "In September of 2019, Amodei pissed off conservative nationwide when he became the first House Republican to identify as impeachment-curious, saying of the inquiry into Trump, \"Let's put it through the process and see what happens.\"",
    "While Issa's constituency is located hundreds of miles to the south of the new 3rd District, he may have some clout with conservatives here thanks in part to his long history of using his influence in Congress to torment Democrats.",
    "Friday, Feb 11, 2022  11:23:50 AM Pacific Standard Time  Jeff Singer\nAL-Sen: Former Business Council of Alabama head Katie Boyd Britt's new ad for the May Republican primary is centered around her opposition to abortion.",
    "Friday, Feb 11, 2022  8:34:25 AM Pacific Standard Time  Jeff Singer\nNJ-11: Morris County Surrogate Heather Darling has announced that she'll stay out of the Republican primary to take on Democratic Rep. Mikie Sherrill.",
    "The spot concludes with the voiceover saying, \"We need someone who works for us\" and shows a photo of Cisneros along with her name on-screen, but for no clear reason, the narrator doesn't actually say her name aloud.",
    "Peterson is a longtime politician from Hunterdon County, which makes up 17% of the population this six-county Congressional District, and he's enjoyed the county party's support in past bids for local races.",
    "Friday, Feb 11, 2022  8:33:25 AM Pacific Standard Time  Jeff Singer\nIL-03: State Rep. Delia Ramirez has picked up an endorsement from 14th District Rep. Lauren Underwood ahead of the June Democratic primary.",
    "Lisa McCormick, who was challenging Menendez for renomination, was listed on her own in the second column while the three candidates running against Van Drew each had a column entirely to themselves.",
    "However, the plan differs somewhat from the map that the state Senate approved a few days earlier (also with a two-thirds supermajority), so the two chambers will have to iron out their differences.",
    "The filing deadline is March 18, and whoever wins the GOP nod will be the clear favorite in a northern Nevada seat that, according to Dave's Redistricting App, would have backed Donald Trump 54-43.",
    "Yes.? The congressman, though, this time used his interview to say upfront that he'd oppose an impeachment inquiry, and he soon joined most of his party colleagues in voting against impeachment.",
    "That's because, in many counties, endorsed candidates appear in a separate column on the ballot along with other party endorsees, a big deal in a state where party machines are still powerful.",
    "That result may have cost Team Red the swingy 3rd District, but only just: Tarkanian lost to his Democratic foe, now-Sen. Jacky Rosen, 47-46 as Donald Trump was carrying the district 48-47.",
    "The congressman quickly responded to the news by telling the site, [I]t's America... if somebody thinks that they've got a better mousetrap, then those are the avenues available to them.\"",
    "Notably in 2016, Tarkanian overcame $1.6 million in outside spending directed against him in the primary to defeat state Senate Majority Leader Michael Roberson, the choice of then-Gov.",
    "Blueprint, which says it did this survey with no input or funding from any candidate, committee or interest group,? did not release numbers testing Whitmer against any other Republican.",
    "Amodei joined the rest of the GOP caucus in voting against both the inquiry and Trump's first impeachment, and neither Laxalt nor anyone else of stature ended up running against him.",
    "However, as South Carolina Rep. Nancy Mace just learned the hard way, Trump is very happy to back primary challenges to members who simply blamed him for the attack on the Capitol.",
    "The Trump campaign soon rolled out its state co-chairs for 2020, and politicos noticed that Amodei, who was and remains Nevada's only Republican member of Congress, was snubbed.",
    "Trump managed to ward off Little Tark just before the following year's filing deadline when he convinced him to drop out and run for the 3rd District again with his endorsement.",
    "While it remains to be seen what argument Tarkanian would make to persuade primary voters to oust Amodei, the congressman's experience last cycle could preview what's to come.",
    "Things played out in a familiar manner right after the Jan. 6 attack when Amodei told Nevada Newsmakers, Do I think he (Trump) has a responsibility for what has occurred?",
    "But he was hardly done with politics, and Amodei himself suggested in April of 2019, months before his impeachment inquiry flirtations, that he could run against him.",
    "Tarkanian decided soon afterwards that he'd had enough of Vegas and he moved to Douglas County, a small rural community located well to the north near the Reno area.",
    "Two other Republicans, retired Air Force Maj. Gen. Michael McGuire and state Corporation Commissioner Justin Olson, barely register with 3% and 1%, respectively.",
    "We'll find out in the next five weeks if, now that he's finally an elected official, Little Tark decides to test out his newfound luck by going after Amodei.",
    "Conservatives also took Little Tark seriously in 2017 when he launched a primary challenge to Sen. Dean Heller and a pair of polls showed him winning.",
    "Attorney General Mark Brnovich edges out rich guy Jim Lamon 17-13, with Thiel Capital chief operating officer Blake Masters just behind with 12%.",
    "Where it went was a firestorm of far-right outrage, with angry conservatives convinced that Amodei had actually called for impeaching Trump.",
    "Edwards has indicated he would veto a map that does not create a second Black district, which neither the House or Senate proposals do.",
    "Tarkanian instead devoted his efforts to denying renomination to a far lower profile incumbent, Douglas County Commission Dave Nelson.",
    "That earlier survey of the current field had Brnovich leading McGuire 25-11; when Ducey was added, he beat the attorney general 27-12.",
    "As we've written before, county party endorsements are typically very important in New Jersey primaries on both sides of the aisle.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Tarkanian, for his part, is also a very familiar name in Silver State politics, though not entirely for welcome reasons.",
    "These numbers are quite a bit different than what another GOP firm, OH Predictive Insights, found a few weeks ago.",
    "Amodei added, \"I'm a big fan of oversight, so let's let the committees get to work and see where it goes.\"",
    "You can see an example of this on this 2018 Democratic primary sample ballot from Burlington County.",
    "Doug Ducey runs and finds Brnovich narrowly outpacing him 14-13 as Lamon and Masters each take 11%.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "Sign up here to receive the Daily Kos Elections Morning Digest in your inbox each weekday.",
    "Tarkanian, though, lost to Democrat Susie Lee by wide 52-43 as Rosen was unseating Heller.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "\"You ask me, Henry Cuellar's been in Washington too long,\" she concludes.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "\"After 36 years in politics,\" says the narrator, \"Cuellar has changed.\"",
    "Brian Sandoval and national Republicans, by a surprisingly wide 32-24.",
    "(This designation is known colloquially as the \"organization line.\")",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "It also mentions the FBI raid of his home last month.",
    "It's also a place to discuss elections, not policy.",
    "The firm also tests out a scenario where Gov.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Vance grabs fifth with 5%.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "John Bel Edwards.",
    "Please read it."
  ]
}