{
  "id": 12357,
  "mediaId": 8408,
  "date": "2022-03-22",
  "headline": "Ron Watkins, QAnon Figurehead, Will Be on the Ballot in Arizona",
  "image": "https://media2.phoenixnewtimes.com/phx/imager/u/slideshow/13276695/51825580663_046c512586_6k.jpg",
  "link": "https://www.phoenixnewtimes.com/news/qanon-leader-ron-watkins-will-be-on-arizona-primary-ballot-13276203",
  "mediaOutlet": "phoenixnewtimes.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katya Schwenk",
  "authorUrl": "https://www.phoenixnewtimes.com/author/katya-schwenk",
  "termIds": [
    0
  ],
  "sentences": [
    "During Ron Watkins' stint at 8chan, the first posts from an unnamed \"Q\" that would inspire the QAnon conspiracy appeared on the platform, leading some researchers to argue that either Watkins or his father was behind the messages.",
    "But as of Tuesday, Watkins has collected enough petition signatures to put his name on the ballot as a Republican candidate for U.S. Representative, according to the Secretary of State's Office: 1,741 in total.",
    "He has nearly 400,000 followers on Telegram, a loosely moderated messaging app, and has used his platform to amplify bogus conspiracy theories around COVID-19 and the 2020 election, and to ask for donations.",
    "One story he shared from Prescott Valley on Telegram: \"I asked an elderly lady this afternoon if she was a Republican, and she replied, 'If I ever found out my kids voted Democrat, I would shoot them dead.'\"",
    "Per his campaign filings, Watkins has listed his residential address as an apartment in Tonto Basin, a small unincorporated community near Theodore Roosevelt Lake in rural Gila County.",
    "Over the past few weeks, per his Telegram channel, Watkins has been collecting signatures in places like Prescott Valley, Globe, and Payson to qualify him for the primary.",
    "Ron Watkins, a QAnon icon who launched an unexpected congressional campaign in Arizona last year, has made it onto the August 2 primary election ballot.",
    "Over the years, fringe groups flocked to 8chan as they were kicked off more mainstream platforms, making it a hub for white supremacy and neo-Nazism.",
    "They include Eli Crane, a military veteran and Shark Tank businessman, and Walt Blackman, currently a state representative in the Arizona House.",
    "Watkins gained notoriety as a site moderator for 8chan — now called 8kun — an online message board still owned by Watkins' father, Jim Watkins.",
    "\"My message vibes with all the people,\" he explained, saying that the number of petition signatures showed he had \"grassroots support.\"",
    "So far, Crane has raised more than $810,000, per FEC reports, and Blackman is trailing slightly behind at about $700,000.",
    "Multiple mass shooters, including the El Paso gunman who killed 23 people in 2019, posted their manifestos on the site.",
    "Watkins is hoping to unseat Democratic incumbent Tom O'Halleran in Arizona's newly redrawn 2nd Congressional District.",
    "It has spilled off 8chan and found a nationwide following, which includes some of Arizona's fringiest lawmakers.",
    "In a phone call with Phoenix New Times, Watkins said he had knocked on \"thousands of doors\" as he canvassed.",
    "His congressional bid in Arizona, however, raised eyebrows when Watkins made the announcement in October.",
    "But Watkins will have to beat out a slate of Republican challengers who are vying for O'Halleran's seat.",
    "Watkins has only vague ties to the state, and has so far lagged behind fellow candidates in fundraising.",
    "Before showing up in Arizona in the fall, Watkins had spent several years in Japan and the Philippines.",
    "The conspiracy holds that, among other things, a Satanic cabal controls the U.S. government.",
    "He has said he has family in Arizona, though much of his childhood was spent in Washington.",
    "It's the largest district in Arizona, spanning the rural northeast stretches of the state.",
    "\"Our fight is just beginning,\" Watkins wrote on his Telegram after he announced the news.",
    "\"I met many, many people, and they're all excited about my campaign,\" he claimed.",
    "In August, Watkins will now face off against multiple Republican challengers.",
    "He had traveled across the large district, and planned to continue, he said.",
    "So far, that canvassing has not yet translated into a flood of donations.",
    "According to FEC reports, Watkins has raised $31,000 from donations.",
    "He reported only one donation from Arizona, the filings show.",
    "It has also made Watkins a minor celebrity in the movement.",
    "And $3,000 of that sum was a contribution from his father.",
    "Still, Watkins is unconcerned about money, he said.",
    "He needed just over 1,400 to qualify."
  ]
}