{
  "id": 1838,
  "mediaId": 2662,
  "date": "2022-02-06",
  "headline": "“Without Election Integrity We Have a Dictatorship” – Congressional Candidate Code Monkey Z Ron Watkins Speaks with TGP’s Jordan Conradson on His Campaign (VIDEO)",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/code-monkey-ron-watkins.jpg",
  "link": "https://www.thegatewaypundit.com/2022/02/without-election-integrity-dictatorship-congressional-candidate-code-monkey-z-ron-watkins-speaks-tgps-jordan-conradson-campaign-video/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    2765,
    3111,
    2370,
    3510,
    4267,
    4669,
    4748,
    1631,
    1477,
    6269
  ],
  "sentences": [
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nHe will be taking on Walt Blackman, whose wife recently attempted to frame and defame The Gateway Pundit correspondent Jordan Conradson with a race hoax.",
    "Walt Blackman and his wife attempted to destroy Conradson after demanding his articles be removed from The Gateway Pundit by asserting a falsehood to destroy his credibility and subject hatred, contempt or ridicule.",
    "CodeMonkeyZ Speaks with Gateway Pundit: “What I Put Out on the Dominion Evidence is Roughly 1% of What We Are Holding”\nWatkins presented evidence of election fraud at Mike Lindell’s Cyber Symposium in August 2021.",
    "A.R.S 13-1804 states,\nA person commits theft by extortion by knowingly obtaining or seeking to obtain property or services by means of a threat to do in the future any of the following:\n6.",
    "I mean, you know more about than I do Jordan, but from what I understand, maybe his wife or him or someone sent like a text message and posted it on Facebook for about an hour.",
    "https://t.co/p01t7TJHjr\n— Garret Lewis (@GarretLewis) February 2, 2022\nThe Gateway Pundit correspondent Jordan Conradson spoke with Ron Watkins yesterday following this news.",
    "Expose a secret or an asserted fact, whether true or false, tending to subject anyone to hatred, contempt or ridicule or to impair the person’s credit or business.",
    "Code Monkey Z, has been fighting to expose the stolen 2020 election using his massive social media following and whistleblower documents to expose election fraud.",
    "Ron told Conradson about the exciting plans for his grassroots campaign task force, the “CMZ Army,” and the soon-to-be campaign headquarters.",
    "So if that is the case, then they’re trying to frame you they’re trying to potentially even blackmail you here, Jordan.",
    "He and his wife got caught sending each other racist texts to try to smear Gateway Pundit reporter @ConradsonJordan.",
    "And apparently, the text that they wrote on Facebook alleges that you are the one that sent it to them, Jordan.",
    "Tucson radio host Garret Lewis dubbed Blackman “the Jussie Smollett of Arizona politics.”\n.",
    "Watkins: Well, look, my platform is God is first and election integrity is a close second.",
    "Um, can you tell us about your platform, especially the election integrity side of it?",
    "And this text message apparently said something N-word, your dad is an N-word, RINO.",
    "Watkins is now running for U.S. Congress in Arizona’s Congressional District two.",
    "And when you call the phone number back it went to Blackman’s like work phone.",
    "Watkins: In District Two, I’m mainly running against Blackman and Eli crane.",
    "So yeah, there’s a big, big problem here, and we have to get out and fix it.",
    "Now, my understanding is they accidentally put their phone number on there.",
    "So in my opinion, that’s a criminal problem and Blackman should be in jail.",
    "Conradson: So in district two Can you tell us about your opponents?",
    "Now, Walt Blackman, he’s found himself in a crazy scandal.",
    "@BlackmanForAZ is the Jussie Smollett of Arizona politics.",
    "And with a dictatorship, we have no other rights at all.",
    "It is unclear how Walt was involved in this debacle.",
    "Without election integrity, we have a dictatorship.",
    "This is possibly a class four felony in Arizona.",
    "Are we Communist China at that point?",
    "Well, that is a powerful statement.",
    "You know, where even are we?",
    "Blackman should be in jail.",
    "So let me say that again.",
    "And without any rights.",
    "Now that’s a problem.",
    "Ron Watkins, a.k.a.",
    "Conradson: Wow.",
    "WATCH:",
    "Yep."
  ]
}