{
  "id": 4178,
  "mediaId": 3986,
  "date": "2022-01-19",
  "headline": "Video: 6 SEAL vets running for Congress vow to take on ‘grave threat’ Pelosi in new ad",
  "image": "https://americanmilitarynews.com/wp-content/uploads/Screenshot-2021-10-28-9.38.06-AM.png",
  "link": "https://americanmilitarynews.com/2022/01/video-6-seal-vets-running-for-congress-vow-to-take-on-grave-threat-pelosi-in-new-ad/",
  "mediaOutlet": "americanmilitarynews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Morgan",
  "authorUrl": "https://americanmilitarynews.com/author/staff-writer-15/",
  "termIds": [
    0
  ],
  "sentences": [
    "In a new campaign ad, the SEAL PAC said the SEAL veterans Ryan Zinke, Brady Duke, Derrick Van Orden, Eli Crane, Morgan Luttrell and Ed Thelander “have one grave threat left to defeat” over an image of House Speaker Nancy Pelosi (D-CA).",
    "They reiterated those concerns again in a November Fox News interview, during which Duke called the U.S. withdrawal from Afghanistan a “retreat.”\nThe SEAL PAC has also endorsed 21 other candidates with various military backgrounds.",
    "He is also the twin brother and fellow SEAL of Marcus Luttrell, who was the only survivor of Operation Red Wings and who authored the book “Lone Survivor.” Luttrell is running for Texas’ eighth congressional district.",
    "They know that our enemies are no match for their strength and their courage.”\n“These former Navy SEALs have protected America from enemies all over the world,” the ad continues.",
    "In October, they called for accountability from President Joe Biden’s administration for the number of U.S. citizens left in Afghanistan after the U.S. withdrawal this summer.",
    "Join them.”\nThe video ends with an overlay with the slogan “Defeat Nancy Pelosi!”\nAccording to their website, the SEAL PAC campaign ad will run on both Fox News and NewsMax.",
    "Zinke, a former commander of the elite SEAL Team 6, previously represented Montana in Congress before becoming the Secretary of the Interior under President Donald Trump.",
    "Six U.S. Navy SEAL veterans are running as Republicans for seats in Congress in 2022 and they’ve formed a political action committee, the SEAL PAC, to support their runs.",
    "He also volunteers as a firefighter and a reserve deputy sheriff and works with Swim With a Mission, a nonprofit that has donated $7 million to veterans programs.",
    "He had multiple combat tours in Afghanistan and Iraq and was responsible for planning Special Operations contingency operations in Europe in 2012.",
    "After leaving the service he started Bottle Breacher, which makes military-oriented bottle openers and donates to various veteran charities.",
    "Duke was a sniper for SEAL Team 1 and has since become a civilian instructor for military special operators and SWAT teams.",
    "Zinke is running to return to Montana’s congressional delegation and represent Montana’s first congressional district.",
    "Zinke, Duke, Van Orden, Crane and Luttrell have previously joined together for interviews on Fox News and NewsMax.",
    "Thelander served in the Navy for 21 years, including time in SEAL Teams 3 and 4 and SEAL Delivery Vehicle Team 2.",
    "He also worked at Navy survival school in Maine and as the SEAL Sniper course manager.",
    "Crane served in the Navy for 13 years, including time in SEAL Team 3.",
    "“They took a blood oath to protect America,” the 30-second ad begins.",
    "Luttrell served in the SEALs as a Navy Special Warfare Officer.",
    "He is running for Wisconsin’s third congressional district.",
    "He is running for Florida’s seventh congressional district.",
    "He is running for Arizona’s first congressional district.",
    "He is running for Maine’s first congressional district.",
    "“They understand that the only easy day was yesterday.",
    "“Now they have one great threat left to defeat.",
    "Van Orden served in the Navy for 26 years."
  ]
}