{
  "id": 8526,
  "mediaId": 8378,
  "date": "2022-04-05",
  "headline": "People | Nuvamsa elected to Arizona Community Foundation Board of Directors",
  "image": "https://navajotimes.com/wp-content/uploads/2022/04/SUBMITTED-MonicaNuvamsa.jpg",
  "link": "https://navajotimes.com/ae/people/people-nuvamsa-elected-to-arizona-community-foundation-board-of-directors/?utm_source=rss&utm_medium=rss&utm_campaign=people-nuvamsa-elected-to-arizona-community-foundation-board-of-directors",
  "mediaOutlet": "Navajo Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Navajo Times",
  "authorUrl": "https://navajotimes.com/author/ntpc_admin/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Republicans understand sovereignty, local leadership, and family first values.”\nHe concludes, “We know that leading Arizona doesn’t just end in Maricopa County but extends to all rural counties, especially our tribal nations.”\nWarren confirmed to AmeriCorps Board of Directors\nWASHINGTON – Alvin Harlyn Warren, Santa Clara Pueblo, was confirmed March 25 to serve as a member of the board of directors of the Corporation for National and Community Service, the federal agency more commonly known as AmeriCorps.",
    "I look forward to working with Mr. Warren to ensure the board and agency are operating at peak efficiency and fulfilling their critical mission of national service.”\nLynn Trujillo, Cabinet Secretary for New Mexico’s Indian Affairs Department, said, “Alvin has dedicated his life and career to being of service to others.",
    "Robbin Coulon, chairman of the board, said, “These three individuals bring a significant amount of experience in all facets of business and philanthropy, including government, banking, and the nonprofit and arts sectors.”\nNuvamsa, Hopi, is the executive director of the Hopi Foundation.",
    "“Since June 2021, I have made many attempts to meet online or in-person with our tribal Council members and have sent numerous emails inviting them to speak with us so that we can hear firsthand the issues facing tribal nations and the Navajo Nation Council,” he said.",
    "She earned her undergraduate degree and a certificate in graduate research studies from the University of Arizona and a certificate in nonprofit leadership from the Arizona State University Lodestar Center for Philanthropy and Nonprofit Innovation.",
    "Nuvamsa has served on several local, regional, and national nonprofit boards, including the Native American Agriculture Fund, Native Americans in Philanthropy, Arizona Grantmakers Forum, Native Public Media, and the Hopi Education Endowment Fund.",
    "Last year, AmeriCorps invested nearly $10 million in New Mexico and employed 6,700 corps members at 400 service sites, including schools, health clinics, veterans’ facilities, youth centers, food banks, and homeless shelters.",
    "Warren is the ninth Native American confirmed by the U.S. Senate under the Biden administration and will play a key role in setting policies and direction for the agency to carry out its mission of national service.",
    "“We have had successful meetings with the Ak-Chin, White Mountain Apache, and the Inter-Tribal Council of Arizona” he said, “and I thank them for sharing their concerns and long-standing challenges.",
    "The AmeriCorps State and National program awards grants to states and organizations to engage individuals in paid service to address local, regional, and national challenges.",
    "Local Diné campaigns for AZ Republicans\nGANADO – Mike Woestehoff, 39, is Navajo (Kiyaa’áanii nishli´, Áshiihí dashicheii) born in Tuba City and grew up in Ganado, Arizona.",
    "“I have repeatedly heard that Republicans don’t want to hear from Indian Country, but that is not the case as we have made many attempts starting in June 2021,” he said.",
    "Her tenure with the Hopi Foundation has included serving as general manager of KUYI Hopi Radio and associate director for the Hopi Foundation’s nonprofit programs.",
    "“My father was the marching band director of Ganado High School before he retired as vice-principal of Wingate High School in New Mexico,” he said.",
    "PHOENIX\nThe Arizona Community Foundation’s Board of Directors recently elected Monica Nuvamsa, Mitch Menchaca, and Anthony Sharett to the board.",
    "Warren currently serves as vice president of Career Pathways and Advocacy for the Los Alamos National Labs Foundation in Española, New Mexico.",
    "New Mexico corps members earned $33.5 million in Segal AmeriCorps Education Awards to help pay for their post-secondary education in 2021.",
    "“My aunts and uncles worked at Peabody Western Coal Company until they retired.”\nWoestehoff went to school in Ganado and in St. Michaels.",
    "She later became program manager for the Morris K Udall Foundation’s Native American Congressional Internship Program in Washington, DC.",
    "He also volunteers with the Blake Masters for U.S. Senate campaign and the Eli Crane for U.S. Congress (District 2) campaign.",
    "He earned a degree from Northern Arizona University while waiting tables, and he has a master’s from Georgetown University.",
    "Still, unfortunately, as of the last week of March 2022, he had not heard any responses from any Navajo Nation officials.",
    "He moved to Washington, D.C., 16 years ago to be a communications professional for Native American nonprofits.",
    "She currently serves on First Nation’s Development Institute boards and the Arizona Alliance for Nonprofits.",
    "Menchaca was appointed executive director of the City of Phoenix Office of Arts and Culture in 2018.",
    "I’m proud to call Alvin a friend and colleague, and I look forward to our work together.”\nRelated",
    "He is one of the campaign volunteers for the Kari Lake for Arizona Governor campaign.",
    "She served as an intergovernmental affairs liaison for the Hopi Tribe in her career.",
    "The three new board members were elected during the board’s annual March meeting.",
    "Warren is now the second Native American to be confirmed in the board’s history.",
    "He will be a voice and advocate for Indigenous people and communities.",
    "His candidates want to listen and respect tribal sovereignty, he said.",
    "She is Oomaw’wungwa Water Cloud Clan from the Village of Shungopavi.",
    "Board members serve three-year terms, renewable up to two times.",
    "“My cheii (maternal grandfather) was a code talker,” he said.",
    "Sharett is president of Meta Financial Group and Meta Bank.",
    "She transitioned to the nonprofit sector in 2006.",
    "Sen. Ben Ray Luján, D-N.M., said, “Mr.",
    "“My mother was a special ed teacher."
  ]
}