[
  {
    "id": 7024,
    "mediaId": 124,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "Among those being subpoenaed are Kelli Ward, the Arizona GOP chair who has already filed suit to block the committee from getting her phone records, and Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span>, an outspoken purveyor of the false claim that there was widespread fraud in the presidential election.",
    "author": "",
    "title": "New subpoenas from Jan. 6 committee target 'alternate elector' organizers",
    "sentiment": "0"
  },
  {
    "id": 7030,
    "mediaId": 237,
    "date": "2/15/2022 12:00:00 AM",
    "sentence": "The latest bevy of subpoenas includes those sent to Pennsylvania state Sen. <span class='selected-term'>Doug Mastriano</span> and Arizona state Rep. Mark Finchem, two Trump allies who the committee says boosted efforts to send alternate electors who would vote for Trump.",
    "author": "Virginia Aabram",
    "title": "'False electors' targeted in new round of Jan. 6 committee subpoenas",
    "sentiment": "0"
  },
  {
    "id": 7004,
    "mediaId": 43,
    "date": "3/4/2022 12:00:00 AM",
    "sentence": "In the battle for the Republican gubernatorial nomination, meanwhile, former Rep. Lou Barletta has a 17-14 edge over state Sen. <span class='selected-term'>Doug Mastriano</span>, with all others in single digits.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 3/4",
    "sentiment": "0.0"
  },
  {
    "id": 7001,
    "mediaId": 65,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Four candidates receive double-digit support: Lou Barletta (19%), <span class='selected-term'>Doug Mastriano</span> (18%), Dave White (14%), and Bill McSwain (11%).",
    "author": "Dana Blanton",
    "title": "Fox News Poll: McCormick tops Dr. Oz in Pennsylvania GOP senate primary poll",
    "sentiment": "0.0"
  },
  {
    "id": 7000,
    "mediaId": 43,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "GOP candidates who campaigned with these hate groups include Lou Barletta, <span class='selected-term'>Doug Mastriano</span>, Dave White, Bill McSwain and Guy Ciarrocchi.",
    "author": "",
    "title": "Josh Shapiro (D) Makes The Case Why PA GOP Deserve The Blame For Price Gouging At The Pump",
    "sentiment": "0.0"
  },
  {
    "id": 6994,
    "mediaId": 19,
    "date": "3/12/2022 12:00:00 AM",
    "sentence": "Recent polls show the Republican primary race as very much a two-man battle between himself and State Sen. <span class='selected-term'>Doug Mastriano</span>.",
    "author": "Hannah Bleau",
    "title": "Exclusive  Gubernatorial Candidate Lou Barletta: Illegal Immigration Ends When Im Governor of Pennsylvania",
    "sentiment": "0"
  }
]