[
  {
    "id": 7018,
    "mediaId": 124,
    "date": "2/16/2022 12:00:00 AM",
    "sentence": "The Jan. 6 committee has issued six new subpoenas related to the push to appoint alternate electors,? including Arizona Republican Party Chair Kelli Ward, Pennsylvania Republican State Sen. <span class='selected-term'>Doug Mastriano</span>, who is running for governor, and Arizona GOP Secretary of State candidate Mark FInchem.",
    "author": "",
    "title": "In Ukraine, Biden faces a crisis with little political benefit back home",
    "sentiment": "0.0"
  },
  {
    "id": 6987,
    "mediaId": 129,
    "date": "3/19/2022 12:00:00 AM",
    "sentence": "Meanwhile, some Republican politicians and candidates have come to pay their respects at the speedway camp, including Senator Ted Cruz of Texas and <span class='selected-term'>Doug Mastriano</span>, a Pennsylvania state senator and candidate for governor who chartered buses to Mr. Trumps Jan. 6 rally preceding the storming of the Capitol.",
    "author": "",
    "title": "Trucker Protest Moved by More Than Opposition to Covid Mandates",
    "sentiment": "0.0"
  },
  {
    "id": 6983,
    "mediaId": 675,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "U.S. Sen. Ron Johnson of Wisconsin and Pennsylvania State Sen. <span class='selected-term'>Doug Mastriano</span> met with members of the convoy to talk about their goals.",
    "author": "Michael Letts",
    "title": "Do D.C. Democrats fear the convoy truckers?",
    "sentiment": "0"
  },
  {
    "id": 6984,
    "mediaId": 675,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "U.S. Sen. Ron Johnson of Wisconsin and Pennsylvania State Sen. <span class='selected-term'>Doug Mastriano</span> met with members of the convoy to talk about their goals.",
    "author": "Michael Letts",
    "title": "Do D.C. Democrats fear the convoy truckers?",
    "sentiment": "0"
  },
  {
    "id": 6947,
    "mediaId": 43,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "One of them is State Sen. <span class='selected-term'>Doug Mastriano</span>, a Trump-loving guy who attended the Jan. 6 insurrection at the Capitol in Washington last year.",
    "author": "",
    "title": "Is Pennsylvania a Dead State Walking?",
    "sentiment": "-0.649"
  },
  {
    "id": 6906,
    "mediaId": 98,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "",
    "author": "David Lauter",
    "title": "Essential Politics: If you care about abortion, these are the states to watch",
    "sentiment": "0.0"
  },
  {
    "id": 6808,
    "mediaId": 238,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "Leading GOP gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, a state senator, has said he would appoint a secretary of state who would require all voters to re-register before casting their ballots, a move that could dramatically reshape the electorate  and would likely violate federal law.",
    "author": "Rosalind S. Helderman",
    "title": "Leading GOP candidates in Pennsylvania were in Washington on Jan. 6",
    "sentiment": "0"
  },
  {
    "id": 3434,
    "mediaId": 25,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "State Senator <span class='selected-term'>Doug Mastriano</span>, the leading candidate for the Republican gubernatorial nomination, was subpoenaed in February by the House Select Committee investigating the Jan. 6 attack at the Capitol.",
    "author": "Adam Brewster",
    "title": "Kathy Barnette, Pennsylvania Republican Senate candidate, campaign believes photos of her on Jan. 6 are genuine",
    "sentiment": "-0.261"
  },
  {
    "id": 6788,
    "mediaId": 881,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "(Michael M. Santiago/Getty Images)\nMAGA <span class='selected-term'>Doug Mastriano</span> and Kathy Barnette both look poised to win, in what one GOP former congressman calls a double-nightmare scenario.?\nA pair of fringe conspiracy theorists have seized the momentum to be the Republican Partys nominees for governor and senator in Pennsylvaniaa prospect thats alarming to Republicans who think theyll lose the general election, and even more concerning for democracy if they win it in the nations largest swing state.",
    "author": "",
    "title": "A MAGA star is born",
    "sentiment": "0.525"
  },
  {
    "id": 6737,
    "mediaId": 238,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "On Jan. 6, both the front-runner in Pennsylvanias Republican gubernatorial primary  state Sen. <span class='selected-term'>Doug Mastriano</span> (R)  and one of the leading candidates for the states Republican Senate nomination  Kathy Barnette  were in Washington.",
    "author": "Philip Bump",
    "title": "In a GOP primary, support for Jan. 6 isnt an obstacle. Is it an asset?",
    "sentiment": "0.866"
  },
  {
    "id": 6609,
    "mediaId": 238,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "As a Pennsylvania state senator and gubernatorial candidate, <span class='selected-term'>Doug Mastriano</span> railed against the rampant fraud that he believes was responsible for Donald Trumps 2020 defeat.",
    "author": "Josh Dawsey",
    "title": "Doug Mastrianos Pa. victory could give 2020 denier oversight of 2024",
    "sentiment": "0"
  },
  {
    "id": 6557,
    "mediaId": 129,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "As Reid Epstein wrote in The Times, Republican voters in Pennsylvania anointed right-wing gubernatorial candidate <span class='selected-term'>Doug Mastriano</span>, who helped lead the brazen effort to overturn the states 2020 election and chartered buses to the rally before the Capitol riot, and who has since promoted a constitutionally impossible effort to decertify President Bidens victory in his state.?\nMastriano spread conspiracies about 2020 phantom ballots, hacked machines and dead voters.",
    "author": "",
    "title": "Johnny Depp and Other Pirates",
    "sentiment": "0.0"
  }
]