{
  "id": 2230,
  "mediaId": 2718,
  "date": "2022-03-30",
  "headline": "Colbert Imagines That Boring GOP Cocaine Orgies Would Still Exclude Ted Cruz (Video)",
  "image": "https://www.thewrap.com/wp-content/uploads/2022/03/Colbert-GOP-Madison-Cawthorn-Eyes-Wide-Shut-Orgy.jpg",
  "link": "https://www.thewrap.com/colbert-imagines-that-boring-gop-cocaine-orgies-would-still-exclude-ted-cruz-in-video/",
  "mediaOutlet": "The Wrap",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ross A. Lincoln",
  "authorUrl": "https://www.thewrap.com/author/ross/",
  "termIds": [
    0
  ],
  "sentences": [
    "Truly, it’s one of the most banal places you can imagine.”\nAnd that, readers, is the basis of Colbert’s cold open gag, which repurposed footage from Stanley Kubrick’s 1999 erotic thriller “Eyes Wide Shut,” to imagine just how boring and banal things can get.",
    "Some are also insisting they’re confused by the whole thing, including Arizona congressman David Schweikert, who said this:\n“I’ve been here a decade, and besides the fact we’re just cruel to each other, at many levels, it’s one of the most boring places.",
    "Some of the people leading on the movement to try and remove addiction in our country, and then you watch them do a key bump of cocaine right in front of you.”\nRepublicans have since gotten kind of mad, publicly about this.",
    "For those catching up, on Sunday Cawthorn appeared on the “Warrior Poet” podcast, where he said this:\n“Look at all these people, a lot of them that I’ve looked up to through my life, I’ve always paid attention to politics.",
    "So it is that in the repurposed clip, presented as if it’s C-SPAN footage, Republicans attending an orgy are instead running through points of order like it’s a congressional committee meeting.",
    "And while the imagined orgy was as “boring” as some Republicans claimed DC actually is IRL, it wasn’t so boring that attendees would let Texas Republican Ted Cruz in.",
    "Then all of a sudden you get invited, ‘oh hey, we’re going to have a sexual get-together at one of our homes, you should come.’ What did you just ask me to come to?",
    "Because he opened Wednesday’s episode of “The Late Show” with a cold open gag inspired by it, this time trying to imagine just what those orgies would even be like.",
    "Then comes a knock at the door, followed by audio clips of Texas Republican Ted Cruz saying, “I’m Ted Cruz and I wanna be in the sex party.”\n“It’s Cruz!",
    "Stephen Colbert clearly finds GOP representative Madison Cawthorn’s claims of orgies and cocaine use among his fellow Republicans hilarious.",
    "Minority leader Kevin McCarthy, who has already had to “speak” to Cawthorn several times before this, was among them.",
    "As always, the cold open kicked off with a supercut of news explaining the premise, and so then shall we.",
    "“Look, I know you’re from Iowa, but not everyone is into corn play,” the orgy’s parliamentarian says.",
    "Why they’re so mad about something they insist isn’t true is unclear, but mad they are.",
    "They debate different kinds of sex toys and what kinds of acts will be permitted.",
    "Sen. Chuck Grassley even gets mocked for wanting to use corn as sex toys.",
    "Watch the clip below:\n— The Late Show (@colbertlateshow) March 31, 2022",
    "And then you realize they’re asking you to come to an orgy.",
    "Quick, turn off the lights!” the parliamentarian says.",
    "Ouch."
  ]
}