{
  "id": 3167,
  "mediaId": 2658,
  "date": "2022-03-13",
  "headline": "POLITICO Playbook: As Russia gets bogged down, negotiations heat up",
  "image": "https://static.politico.com/2c/a0/e053e64a4c8aa7aa0bd99102442c/220313-ukraine-ap-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/03/13/as-russia-gets-bogged-down-negotiations-heat-up-00016856",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1309,
    2597,
    2712,
    2813,
    3709,
    500,
    831,
    5287,
    5366
  ],
  "sentences": [
    "— The ‘why’: “Republicans in the nation’s biggest battleground state are focused primarily on appealing to the GOP base in a crucial election when the Governor’s Mansion, three Cabinet seats and all 160 seats of the Florida Legislature are up for grabs.” And the 2024 implications: “The action in Tallahassee is likely an early demonstration of the Republican Party’s strategy to win back the White House by focusing on some of the most divisive, hard-right policy bills the nation has encountered in recent times.”\n— Related reading: “Disney suspends political donations in Florida after bill restricting LGBTQ discussion,” by WaPo’s Kelsey Ables\nTHE WHITE HOUSE\nFOR YOUR RADAR — “Law enforcement officials have been investigating an incident in which someone accessed the property of a top White House official working on U.S. sanctions against Russia, according to a police report and people familiar with the matter,” WaPo’s Carol Leonnig and Tyler Pager report.",
    "SUNDAY BEST …\nJake Sullivan on additional Russian sanctions, on NBC’s “Meet the Press”: “There are additional steps that we will continue to take, additional targets of oligarchs that we are developing, additional measures to tighten the economic vice that we have put around the Russian economy.”\n— On China helping Russia: “We have made it clear to not just Beijing, but every country in the world, that if they think that they can basically bail Russia out, they can give Russia a workaround to the sanctions that we’ve imposed, they should have another thing coming, because we will ensure that neither China, nor anyone else, can compensate Russia for these losses.”\n— On what type of support the U.S. is providing, on “State of the Union”: “Right now, we are not looking at the provision of the fighter jets in question to Ukraine.",
    "China: The war “creates a powerful new incentive for the United States to find ways of prying President XI JINPING of China away from Mr. Putin.”\nIran: The war has paused “talks with Iran that just days earlier seemed on the verge of clinching a return to the 2015 deal that limited Iran’s nuclear program.”\nEurope: “Russia’s invasion has supercharged the Biden administration’s efforts to restore the morale of a NATO alliance that Mr. Trump undermined.”\nMore on Russia’s war in Ukraine:\n— Officials in Ukraine said this morning that “BRENT RENAUD, an award-winning U.S. filmmaker and former contributor to The New York Times, was fatally shot by Russian forces in Irpin,” The Independent’s Alex Woodward and David Harding report.",
    "POLITICO Playbook: As Russia gets bogged down, negotiations heat up\nBy RYAN LIZZA\n03/13/2022 11:56 AM EDT\n Updated 03/13/2022 10:25 PM EDT\n 2022-03-13T10:25-0400\nPresented by\nDRIVING THE DAY\nFOR YOUR RADAR —ERIC TOPOL, one of the top experts on the pandemic, with two alarming tweets: (1) “The next wave in Europe has begun.” (2) “Among countries that make their data available, some show rising hospital admissions.”\nDAY 18 — There are a lot of weekend developments from Ukraine, and most of them are driven by a single fact: Russia is losing — or at least not winning — its war.",
    "In the near term, Russia’s aggression is sure to invigorate Mr. Biden’s global fight for democracy against autocracies like Moscow, making vivid the threats to fledgling democracies like Ukraine.”\nClimate: The war reinforces “the need for more reliance on renewable clean energy over the fossil fuels that fill Russian coffers.”\nAutocrats: While the invasion has rallied the world’s democracies against Putin, oil politics are pushing the United States to soften relations with the authoritarians running three petro-states: Venezuela, Saudi Arabia and the United Arab Emirates.",
    "RON DESANTIS, the GOP-led state legislature has passed bills including (1) preventing “teachers from leading lessons on sexual orientation and gender identity for students in kindergarten through third grade,” (2) a strict ban on all abortions after 15 weeks of pregnancy, (3) blocking “state entities from doing business with companies that transport undocumented migrant children to Florida,” and (4) “created a new election police unit that DeSantis touted amid an effort by some Republicans to do a full-blown audit of the 2020 election,” among other measures.",
    "— On a related note: This morning, the White House announced that on Monday, Sullivan “and officials from the National Security Council and State Department will be in Rome,” where “Sullivan will meet with Chinese Communist Party Politburo Member and Director of the Office of the Foreign Affairs Commission YANG JIECHI” to “discuss the impact of Russia’s war against Ukraine on regional and global security.”\nWHAT PUTIN HAS WROUGHT — Russia’s invasion is scrambling geo-politics and there are two smart pieces today that attempt to sort out the scale of change.",
    "— SPOTTED at a house party celebrating Josh Dawsey’s new digs on Saturday night: Rosalind Helderman, Devlin Barrett, Ashley Parker, Tyler Pager, Isaac Arnsdorf, Tarini Parti and Ryan Barber, Olivia Nuzzi and Ryan Lizza, Shawn McCreesh, Kaitlan Collins, Kate Sullivan, Betsy Klein, Meridith McGraw, Rachael Bade, Zolan Kanno-Youngs, Katie Benner, Maureen Dowd, Eli Yokley, James Adams, Evan Hollander, Jeff Solnet, Jonathan Kott, and Dawsey’s rescue dog Pepper, who followed him around the party while occasionally begging for a slice of pizza.",
    "“A man was seen on the property owned by President Biden’s deputy national security adviser, DALEEP SINGH, about 1 p.m. on Feb. 26, then fled the scene in a ‘blue/teal’ older model BMW sedan, according to a D.C. police department public incident report.”\n— On a related topic: The State Department disclosed that it is “paying more than $2 million per month to provide 24-hour security to former Secretary of State MIKE POMPEO and a former top aide, both of whom face “serious and credible” threats from Iran,” AP’s Matthew Lee reports.",
    "and Rick Lazio (R-N.Y.) … Joe Rubin … WSJ’s Ryan Tracy … Erin Harbaugh … MSNBC’s Yelda Altalef … Brian Gaston … Lauren Inouye of the American Academy of Nursing … Microsoft’s David Pryor Jr. … Chris Gaspar … Tres York of the National Conference of State Legislatures … Karen Fisher of the Association of American Medical Colleges (6-0) … Sarah Makin … The Clearing’s Christina Roberts … Sarah Mulcahy … James Wesolek of the Texas GOP … Kristy Schmidt … JPMorgan Chase’s Jamie Dimon\nDid someone forward this email to you?",
    "National security adviser JAKE SULLIVAN said this morning that the attack, which early reports say killed at least 34 people and injured more than 100, is evidence that “[Russian President VLADIMIR] PUTIN is frustrated.”\n— Meanwhile, Russia is escalating its rhetoric about chemical and biological weapons in Ukraine, leading American officials to warn “that Russia may be preparing to use chemical weapons against Ukraine,” per WaPo’s David Stern, Joby Warrick, Michael Birnbaum, Ellen Nakashima and Missy Ryan.",
    "And what the president and his advisers did not tell the speaker was that they had already surveyed ‘Democrats deliver’ with voters — and the response to it was at the bottom of those for the potential slogans they tested, according to people familiar with the research.”\n— Spoiler alert: Neither side landed on a preferred choice that day, and Dems are still pleading with Biden to “come up with a sharper message” as the nation grapples with the war in Ukraine and surging inflation numbers.",
    "— SPOTTED at the D.C. debut of “SANDY HOOK: An American Tragedy and the Battle for Truth” ($28), with author Elizabeth Williamson of the NYT in conversation with Kara Swisher at Politics and Prose Union Market on Friday night: Juliet Eilperin, Michelle Boorstein, Brad Foss, Gail Ross, Jennifer Griffin, Greg Myre, Katherine Marsh, Julian Barnes, Michael Morell, Mary Beth Morell, Mark Walker, Jennifer Howard, Amanda Katz, Lisa Dickey, Paul Nevin, Nicholas Reynolds and Becky Reynolds.",
    "“The speaker, who has long been fond of pithy, made-for-bumper-sticker mantras, offered a suggestion she had heard from members: ‘Democrats deliver.’ …\n“What Ms. Pelosi did not fully detail that February evening was that some of her party’s most politically imperiled lawmakers were revolting against Mr. Biden’s preferred slogan, ‘Build back better,’ believing it had come to be a toxic phrase that only reminded voters of the party’s failure to pass its sweeping social policy bill.",
    "The spirit of 1989 will live on, thanks to a bunch of brave Ukrainians.”\nIn the NYT, Michael Crowley and Edward Wong argue that the “war in Ukraine has prompted the biggest rethinking of American foreign policy since … Sept. 11, 2001.” Among the changes:\nThe free world: The Russian invasion “has re-energized Washington’s leadership role in the democratic world just months after the chaotic U.S. withdrawal from Afghanistan ended 20 years of conflict on a dismal note.",
    "SPOTTED: Paul Pelosi, Barry Diller, Jennifer Stallone, Sophia Stallone, Martha Stewart, Margaret Carlson, James Rothschild and Nicky Hilton-Rothschild, David Rubenstein, Brendan Sullivan, Bret and Amy Baier, Lynda Carter Altman (in Louis Vuitton), Adrienne Arsht, Ari Katz, Sally Quinn, Nina Totenberg, Rita Braver and Bob Barnett, George Vrandenburg, Capricia Marshall, Pat Harrison, Sharon Rockefeller and Norah O’Donnell.",
    "“Those working for or advising cryptocurrency firms or investment funds include three former chairs of the Securities and Exchange Commission, three former chairs of the Commodity Futures Trading Commission, three former U.S. senators, and at least one former White House chief of staff, former Treasury secretary and former chair of the Federal Deposit Insurance Corporation,” WSJ’s Paul Kiernan and Dave Michaels report.",
    "— SPOTTED at the Washington Commanders’ inaugural brand launch VIP reception and party at La Vie at The Wharf on Friday night, where Logan Thomas, Doug Williams and members of the coaching staff mingled with the crowd: Steve Dodd, Lyndon Boozer, Matthew Cutts, Jon Nabavi, Ken Edmonds, Ken Harvey, Jason Wright, Joe Maloney, Tori Barnes, Casey Clark, Christian Genetski, Paxton Baker, Jimmy Lynn and Janene Jackson.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "It is much better to have the Ukrainians defeat the Russians on their own, depriving Moscow of the excuse that NATO attacked them, as well as avoiding all the obvious escalatory possibilities.”\n“Putin will not survive the defeat of his army.”\n“The invasion has already done huge damage to populists all over the world, who prior to the attack uniformly expressed sympathy for Putin.",
    "More than 2.5 million people have fled.”\nIn a NYT op-ed, Wang Huiyao, the head of a Beijing think tank who advises the Chinese government, argues, “We are now in an escalatory spiral” and [m]ounting pressure on Mr. Putin will likely make the situation more dangerous” as he “feels pushed to take increasingly extreme measures.”\nHuiyao recommends Chinese-brokered negotiations.",
    "The Yavoriv Combat Training Center is just 10 miles from the Polish border, and until last month, it was home to “160 members of the Florida National Guard” who had “been deployed to Ukraine since late November, training and advising and mentoring Ukrainian armed forces.” That training included how to destroy Russian tanks with American-made Javelin missiles.",
    "“On 13 March, Russian forces opened fire on a car with foreign journalists inside near Irpin, targeted with intense shelling by Russian forces in recent days.”\n— Biden on Saturday “approved an additional $200 million in arms and equipment for Ukraine,” in response to “urgent requests from President VOLODYMYR [ZELENSKYY],” per NYT’s Eric Schmitt.",
    "If you want a Congressman who supports political violence in Ukraine or in the United States Capitol, who supports party over country, who supports a would-be tyrant over the Constitution, and who makes decisions based solely on re-election, then RUSSELL FRY is your candidate.” More on Trump’s rally via South Carolina’s The State newspaper\n2.",
    "“The department told Congress in a report that the cost of protecting Pompeo and former Iran envoy BRIAN HOOK between August 2021 and February 2022 amounted to $13.1 million.”\nPOLICY CORNER\nCRYPTO COMES TO WASHINGTON — Crypto companies are carving out their place in D.C., and they’re calling on the big guns to get them influence.",
    "— “AP video shows tank and sniper fire in besieged Mariupol”\n— While major companies have pulled their business out of Russia, “makers of drugs, vaccines and medical equipment continue to do business … saying they have an ethical responsibility,” write WSJ’s Denise Roland, Jared Hopkins and Peter Loftus.",
    "HAPPY BIRTHDAY: Sen. John Hoeven (R-N.D.) … Jeff Weiss … CNN’s Katelyn Polantz … Ari Rabin-Havt … POLITICO’s David Lim and Tamar Barsamian … Kiki McLean … Ashley Hoy of Monument Advocacy … Shawn Turner … Erin Billings of Global Strategy Group … former Reps. Alan Grayson (D-Fla.), Joseph Cao (R-La.)",
    "Democracy Now plans to pitch the ad to other networks, and has also run the ad in the districts of seven House Republicans: Virginia Foxx (N.C.), Mike Garcia (Calif.), Carlos Giménez (Fla.), Yvette Herrell (N.M.), Nicole Malliotakis (N.Y.), David Schweikert (Ariz.) and Jeff Van Drew (N.J.).",
    "OUT AND ABOUT — Speaker Nancy Pelosi presented fashion designer Diane von Furstenberg with the third annual Justice Ruth Bader Ginsburg Woman of Leadership Award on Friday night in a ceremony and gala at the Library of Congress, where guests dined on branzino and white asparagus.",
    "… So I don’t understand why this is any worse than, from a Russian point of view, than other things.”\nHouse Minority Whip STEVE SCALISE on getting aid to Ukraine, on Gray TV’s “Full Court Press”: “We’ve got to get them all the things that they’re asking for now quickly.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nALL POLITICS\n‘GROUND ZERO’ OF THE CULTURE WARS — Our colleagues Gary Fineout and Andrew Atterbury have a sharp story up exploring why Florida has become “ground zero for America’s ‘culture war.’”\n— The ‘what’: Under Gov.",
    "… There is no diplomatic solution to the war possible prior to this happening.”\n“The Biden administration’s decisions not to declare a no-fly zone or help transfer Polish MiGs were both good ones; they’ve kept their heads during a very emotional time.",
    "PLAYBOOKERS\nFIRST IN PLAYBOOK — New Democracy tried to air an ad slamming Donald Trump for calling Vladimir Putin a “genius” and “savvy” on this morning’s “Fox News Sunday,” but Fox News rejected it for “misinformation,” the Democratic group said.",
    "— As restaurants, bars and stores across the U.S. try to make a statement by dumping “Russian” vodka and other products, the intended effect may be lost: “Americans consume hardly any products that are truly Russian,” NYT’s Jeremy Peters writes.",
    "Rep. TOM RICE (R-S.C.) lays out the choice facing Republicans after Trump’s South Carolina rally on Saturday in support of Rice’s primary opponent:\nThe quote: “Trump is here because, like no one else I’ve ever met, he is consumed by spite.",
    "— NYT’s Jonathan Martin has the details of a February meeting between Speaker NANCY PELOSI, President JOE BIDEN and White House officials in which they sought to figure out a new message for Dems ahead of the midterms.",
    "Reuters reports this morning: “Russian and Ukrainian officials gave their most upbeat assessments yet on Sunday of progress in their talks on the war in Ukraine, suggesting there could be positive results within days.",
    "But do everything possible to get those MiGs into Ukraine.”\nBIDEN’S SUNDAY — The Bidens will return to the White House from Camp David at 8:30 p.m.\nVP KAMALA HARRIS’ SUNDAY — The VP has nothing on her public schedule.",
    "— WaPo explainer: “What to know about the role Javelin antitank missiles could play in Ukraine’s fight against Russia”\n— Helpful clicker, via WSJ: “Russia’s War in Ukraine in Maps and Graphics”\nGood Sunday morning.",
    "At home, Putin continues the crackdown on dissent:\n— On Monday, Instagram will be blocked in Russia, a week after access to Twitter and Facebook, which Russia labeled an “extremist organization,” was restricted.",
    "The politics of the war has exposed their openly authoritarian leanings.”\n“A Russian defeat will make possible a ’new birth of freedom,’ and get us out of our funk about the declining state of global democracy.",
    "Whether or not that idea could ever be endorsed by the relevant parties, the crux of his argument is telling: the war will create escalating costs for China, so Beijing should intervene now to end it.",
    "“We have warned what kind of consequences the thoughtless transfer of weapons, such as portable air-defense systems and antitank systems, into Ukraine could have,” he said on state TV, per the WSJ.",
    "— The combination of new laws censoring the media and the new social media bans amount to Russia “dropping a digital iron curtain over its population,” write WSJ’s Sam Schechner and Keach Hagey.",
    "“Separately, U.S. Deputy Secretary of State WENDY SHERMAN said Russia was showing signs of willingness to engage in substantive negotiations about ending a conflict in which thousands have died.",
    "DCCC Chair SEAN PATRICK MALONEY talks to WaPo’s Paul Kane about the Democratic Party’s struggles with voters:\nThe quote: “‘They think that we’re divisive and too focused on cultural issues.",
    "They think that we act like we know better than parents when it comes to their kids in schools,’ Maloney said in an interview here during a conference designed to try to forge some unity.",
    "“It is the U.S. that is the source of maximum tension.”\n— Then this morning, Russia attacked the military facility in the far west of Ukraine that serves as a key hub for Western aid.",
    "The 30-second spot features the former president’s voice, and charges that “Republicans think it’s ‘genius’ to invade a [sovereign] nation,” before asking how the GOP went from “Mr.",
    "— The seeming stalemate, which is prompting gradual Russian escalation and more catastrophic conditions for Ukrainians, is leading to more talk of a negotiated end to the crisis.",
    "We are looking at other methods of getting the Ukrainian defenders advanced capabilities to be able to blunt the Russian advance and protect Ukrainian towns and cities.”\nSen.",
    "Related reading: “Putin’s prewar moves against U.S. tech giants laid groundwork for crackdown on free expression,” by WaPo’s Greg Miller and Joseph Menn\nTIME FOR AN OFF RAMP?",
    "“Her confidence is overflowing and contagious.” Sylvester Stallone walked out to the “Rocky” theme song and put pink boxing gloves on Ginsburg’s portrait.",
    "ABOUT LAST NIGHT — “Congress weighs permanent daylight saving time in a debate as regular as clockwork,” by WaPo’s Dan Diamond\nTWO QUOTES OF THE DAY —\n1.",
    "I took one vote he didn’t like and now he’s chosen to support a yes man candidate who has and will bow to anything he says, no matter what.",
    "Watch the 30-second ad\nA Fox News spokesperson confirmed to Playbook that the network declined to run the ad, but did not comment further.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "— On Saturday, Russia’s deputy foreign minister, SERGEI RYABKOV, warned that Western military deliveries would be subject to attack.",
    "Drop us a line and tell us what you would have done with that hour you lost overnight: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "… The collapse of their position could be sudden and catastrophic, rather than happening slowly through a war of attrition.",
    "And that gets to the MiGs that they want from Poland and we can help backfill other military equipment to our NATO allies.",
    "ROB PORTMAN (R-Ohio) on providing planes to Ukraine, on “State of the Union”: “I don’t understand why we’re not doing it.",
    "That includes MATTEO SALVINI, JAIR BOLSONARO, ÉRIC ZEMMOUR, MARINE LE PEN, VIKTOR ORBÁN, and of course DONALD TRUMP.",
    "“I’m a really shy person, and when I’m around Diane she makes me feel like I can do anything,” Pelosi said.",
    "Francis Fukuyama has what may be the most optimistic case for what the post-invasion world will look like.",
    "He makes several provocative predictions:\n“Russia is heading for an outright defeat in Ukraine.",
    "Instagram head Adam Mosseri said the new move will affect 80 million users in the country.",
    "As you know, last weekend, the secretary of State said it was going to get a green light.",
    "‘The problem is us.’”\nSpeaking of which…\nWHAT EXACTLY IS THE DEMS’ MESSAGE?",
    "Tell Republicans to put Americans first,” it concludes.",
    "Gorbachev, tear down this wall” to Trump’s comments.",
    "‘The problem is not the voters,’ [Maloney] added.",
    "“If you stand with Trump, you stand with Russia.",
    "Send Playbookers tips to playbook@politico.com.",
    "And for some reason, now we’re blocking it.",
    "We initially gave it a green light.",
    "They think that we’re preachy.",
    "Thanks for reading Playbook.",
    "Sign up here."
  ]
}