{
  "id": 3427,
  "mediaId": 2644,
  "date": "2022-03-17",
  "headline": "Biden cuts border funding as his policies are about to overwhelm it",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/newspress-collage-21567365-1647561577427.png?w=1024",
  "link": "https://nypost.com/2022/03/17/biden-cuts-border-funding-as-his-policies-are-about-to-overwhelm-it/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carrie Sheffield",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Illegal immigration tramples the rule of law and leaves communities exposed to not only violent criminal gangs but also what Arizona GOP Rep. David Schweikert calls “economic violence to the working poor.” On the House floor last year, Schweikert warned that opening up America’s borders to a flood of illegal migrants would drive the wages of US citizens downward.",
    "The Transportation hike will, one Democrat claimed, “mitigate the effects of climate change in our transportation system.”\nThe Environmental Protection Agency, which is doing everything it can to hurt working-class truckers and thus all American consumers, gets a 3% increase.",
    "A desperate Department of Homeland Security deputy secretary, John Tien, sent an e-mail to employees Wednesday asking them “to consider stepping forward to support the DHS Volunteer Force.” He’s seeking general support for CPB — including even help with data entry.",
    "The nosedive comes as illegal-immigrant apprehensions along the southwestern border skyrocketed in February to nearly 165,000, a 6.6% increase over January — and a 350% increase over February 2020, just after Biden took office and threw open America’s doors.",
    "The more than $20 billion in Green New Deal gimmicks in this bloated bill include an 8% increase for climate-change efforts at the National Oceanic and Atmospheric Administration, with cash for hiring “resilience-focused staff,” whatever that means.",
    "“As always is the case this administration is working every day to provide relief to immigrants, restore order, fairness, and humanity to our immigration system and bring it into the 21st century,” White House spokesman Vedant Patel said.",
    "More than three-quarters of those asked — 77% — told Pew that illegal immigration was a very big or moderately big problem in America today; 65% said the same about climate change, and 12% thought it wasn’t a problem at all.",
    "While border security is slashed, the Defense, Interior and Transportation departments, along with loan programs to state and local governments, all enjoy funding boosts to fight climate change.",
    "Authorities are bracing for a colossal crush of up to 170,000 people once the administration lifts the Title 42 public-health authority allowing (but not mandating) quick expulsion.",
    "The $1.5 trillion omnibus spending bill President Joe Biden signed this week — the first since he took office — has the biggest hike in domestic spending in four years.",
    "Democrats care more about climate-change slush funds than protecting America’s borders — even as their policies are about to make the problem even worse.",
    "Climate-change boondoggles get billions while border-security funding is slashed by nearly a half-billion — even as illegal crossings continue to spike.",
    "It’s a recipe for disaster as officials expect an overwhelming flood of migrants within weeks as Biden prepares to lift the COVID-deportation measure.",
    "And Democrats tout “a historic level of funding” for the Energy Department’s Office of Energy Efficiency and Renewable Energy, which got a 12% hike.",
    "Heartbreaking images of massive numbers of migrants huddled under a bridge at the Rio Grande made headlines last year.",
    "But it gives US Customs and Border Protection just $14.8 billion, a $428 million decrease from fiscal year 2021.",
    "President Donald Trump instituted Title 42 at the pandemic’s start, and it’s been upheld in court under Biden.",
    "Both Pew and Gallup have found that Americans care far more about border security than climate change.",
    "With inflation at record highs, working Americans can ill afford to lose even more buying power.",
    "The omnibus bill makes that clear: enact a radical climate-change agenda by all possible means.",
    "But the prez insists on ending it, even as he keeps other pandemic policies in place.",
    "Guns and drugs are flowing across our border, decimating our inner cities.",
    "Carrie Sheffield is a senior policy analyst at Independent Women’s Voice.",
    "The package boosts domestic spending by $46 billion, a nearly 7% hike.",
    "CPB simply doesn’t have the resources to deal with the coming crush.",
    "Biden’s first annual budget as boss certainly proves his priorities.",
    "That’s not where taxpayers want their hard-earned money to go.",
    "Yet Democrats determined to pull more funding from the agency.",
    "Fentanyl deaths alone have doubled over the last two years.",
    "(Factor in inflation, and the cuts are even deeper.)",
    "This year’s crisis is likely to look even uglier.",
    "They say a budget is a statement of your values.",
    "But not all programs are equal.",
    "What are their priorities?",
    "And no wonder."
  ]
}