{
  "id": 3692,
  "mediaId": 2658,
  "date": "2022-03-03",
  "headline": "POLITICO Playbook: How gas prices could crush Biden and the Democrats",
  "image": "https://static.politico.com/67/19/1f7d12304ad88647c180b325a8ef/220302-biden-getty-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/03/03/how-gas-prices-could-crush-biden-and-the-democrats-00013533",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1881,
    2693,
    2726,
    3975,
    4466,
    305,
    831,
    5366
  ],
  "sentences": [
    "HAPPY BIRTHDAY: NRCC Chair Tom Emmer (R-Minn.) … Reps. David Schweikert (R-Ariz.) (6-0), Mike Gallagher (R-Wis.) and Bryan Steil (R-Wis.) … Ira Glass … Alex Smith … George Little (5-0), celebrating in Miami … RGA’s Jesse Hunt … Dan Conston … Marc Short … Susan Zirinsky (7-0) … Mayer Brown’s Andrew Olmem … Tim Morrison … Elaina Plott … Alexa Henning … WHO Director-General Tedros Adhanom … Ron Chernow … Peter Mirijanian … Carlton Carroll … America First Policy Institute’s Steve Smith … Hadar Arazi … Cameron French … Michael Remez … POLITICO’s Lily Mihalik Bhandari and Bryan Jablonski Plescia … Jason Dick … Patrick Gavin … Amanda Crane … Laura Engquist of Rep.",
    "… But Biden’s effort to stabilize the party could alienate the coalition of Black people, young people, progressives and independents who delivered him the presidency in 2020 and will be needed again this year.”\nJUDICIARY SQUARE\nWHAT THE RIGHT IS LISTENING TO — Following a meeting with Biden’s Supreme Court Judge nominee, KETANJI BROWN JACKSON, Senate Minority Leader MITCH MCCONNELL said on GUY BENSON’s podcast that he asked Jackson if she could affirm RUTH BADER GINSBURG and STEPHEN BREYER’s stance against court packing.",
    "ICYMI: “If all goes according to plan, the schedule will allow for a full Senate vote on the nomination before a two-week recess scheduled to begin on April 8.”\nALL POLITICS\nTEXAS PRIMARY LATEST — Whichever Democrat wins the fiercely contested South Texas primary between HENRY CUELLAR and JESSICA CISNEROS, Republicans see it as a prime opportunity to capitalize on their growing appeal to Latino voters and flip a seat that has never elected a GOP member, Sarah Ferris and Ally Mutnick report from Laredo, Texas.",
    "Kolykhaev called on residents to follow conditions set by Russian forces in order to ‘keep the Ukrainian flag flying,’” including a curfew, not gathering in large groups and “allowing only cars carrying food, medicine and other supplies to enter the city.”\nNYT: “The week-old Russian invasion appeared to be making its biggest gains in the south, with the capture of Kherson potentially clearing the way for a bid to seize Ukraine’s entire Black Sea coast, which would cut off the country from world shipping.",
    "And in the southern port of Mariupol, hundreds are feared dead following hours of sustained shelling.”\nCNN: “Russian attacks on Ukraine's northeastern Kharkiv region killed 34 civilians and injured 285 more in the 24 hours to Thursday morning, according to emergency services.”\n— The U.S. sent “hundreds of Stinger anti-aircraft missiles to Ukraine for the first time over the last few days, including over 200 on Monday,” officials tell CNN’s Kylie Atwood and Zachary Cohen.",
    "“The committee suggested its evidence supported findings that Trump himself violated multiple laws by attempting to prevent Congress from certifying his defeat.” The committee’s latest filing\nThe committee’s findings will surely increase pressure on A.G. MERRICK GARLAND, who some Democrats have accused of dragging his feet when it comes to investigating potential crimes committed by the former president and his advisers stemming from the insurrection.",
    "The revenue raised would be divided “evenly between reducing the federal deficit and inflation, on the one hand, and enacting new climate and social programs, on the other.”\nTHE WHITE HOUSE\nBIDEN’S POST-SOTU CHALLENGE — On the heels of his first State of the Union address, Biden is risking “a revolt from key voices across his party’s sprawling coalition,” AP’s Steve Peoples, Alan Fram and Farnoush Amiri write.",
    "Van Taylor apologizes for affair with ‘ISIS bride,’ abruptly drops reelection bid,” by Dallas Morning News’ Todd Gillman\nTRUMP CARDS\nTRUMP BORDER WALL BREACHED 3,000+ TIMES — The new “border wall” barriers built by the Trump administration have been breached by smugglers 3,272 times over the past three years, according to unpublished Customs and Border Protection records obtained by WaPo’s Nick Miroff.",
    "POLITICO Playbook: How gas prices could crush Biden and the Democrats\nBy RACHAEL BADE and RYAN LIZZA\n03/03/2022 06:09 AM EST\nPresented by\nDRIVING THE DAY\nPOLICY PALOOZA DU JOUR: RUSSIAN OIL — President JOE BIDEN’s conservative critics — from Fox News to Capitol Hill Republicans — have slammed the administration for exempting Russian oil from the raft of financial sanctions aimed at the Kremlin.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "We’ve obtained a recording of that meeting.” Read and subscribe to West Wing Playbook here\nThe Ronald Reagan Presidential Foundation and Institute is creating a new #JustSayNo 2.0 Nancy Reagan Scholarship Competition to award college scholarships to students who “stand strong against today's drug pressures.”\nSPOTTED at St. Joseph’s on Capitol Hill for Ash Wednesday: Sens.",
    "SIREN: 1/6 COMMITTEE ALLEGES ‘CRIMINAL CONSPIRACY’ BY TRUMP — The House select committee on Jan. 6 said “its evidence has shown that [former President DONALD] TRUMP and his campaign tried to illegally obstruct Congress’ counting of electoral votes and ‘engaged in a criminal conspiracy to defraud the U.S.,’” our Kyle Cheney and Nicholas Wu report.",
    "A draft one-pager of their coming proposal states that such imports put U.S. “national security at risk and [support] Putin’s ability to stay in power.”\nIn an interview that just posted this morning, Murkowski told our Joshua Siegel that blocking Russian oil was worth the “hurt” of higher gas prices: “We are going to see price increases.",
    "Troy Balderson’s (R-Ohio) office … Spencer Hurwitz … John Roscoe … Cecilie Combs … Tyler Ann McGuffee … Jason Gerson … Scott Pollard … Hannah Blatt … Ghada Alkiek … Charles Cote … Jasen Castillo … Mike Yelovich … Ajay Kuntamukkala … former Rep. Paul Cook (R-Calif.)\nDid someone forward this email to you?",
    "THE HOUSE will meet at 9 a.m. to take up the Honoring our Promise to Address Comprehensive Toxics Act, with last votes at 3 p.m. Speaker NANCY PELOSI will hold her weekly press conference at 10:45 a.m.\nPHOTO OF THE DAY\nPLAYBOOK READS\nWAR IN UKRAINE\nDAY EIGHT …\n— The city of Kherson has fallen.",
    "LEDE OF THE DAY — Courtesy of Alex Thompson and Max Tani: “Last Friday at a voluntary all-hands meeting within the White House science office, chief of staff Marc Aidinoff and the temporary director of the office Alondra Nelson told staffers they needed to stop recording internal meetings.",
    "On Wednesday, units of Ukrainian troops cautiously walked on the rubble of a blown-up bridge on a main road from Kyiv as they headed toward Bucha, carrying sniper rifles, heavy machine guns and rocket-propelled grenades.”\n— Kharkiv continued to suffer heavy shelling.",
    "— 141 out of 193 nations backed a U.N. General Assembly resolution demanding that Russia “immediately end its invasion of Ukraine and unconditionally withdraw all its military forces.” Belarus, North Korea, Eritrea, Russia, and Syria voted against the resolution.",
    "While Biden on Wednesday said nothing is off the table, the administration has privately argued that cutting off Russian imports to the U.S. alone won’t do much to hurt Moscow; it only constituted about 10% of the nation’s total exports at the end of last year.",
    "Tim Kaine, who believes he has long Covid and introduced legislation Wednesday to study the issue, said, “It feels like all my nerves have had like five cups of coffee.”\nAlexandria Ocasio-Cortez has a diabolical job opening for a director of internet strategy.",
    "SPOTTED: Amanda Anderson, Courtney Robinson, Ashley Scott, Lee Dunn, Sasha Moss, Tiffany Moore, Lauren Culbertson, Julie Stitzel, Robin Reck, Lauren Belive, Sheila Warren, Cathy Merrill Williams, Brittany Bramell, Niloo Razi Howe and Amena Ross.",
    "And with the blessing of President VOLODYMYR ZELENSKYY, Ukrainian officials are privately pleading with the Biden administration to cut Russian oil and gas off completely: Otherwise, they say, President VLADIMIR PUTIN still has a lifeline.",
    "OUT AND ABOUT — Niki Christoff’s crypto and web3 gathering, co-hosted with Boys Club, drew 40 women in tech to Toolbox for a crash course on web3 and a fireside chat with Evin McMullen on digital identity in the metaverse Wednesday night.",
    "BIDEN’S THURSDAY:\n— 9 a.m.: The president will hold a secure video call with Australia PM SCOTT MORRISON, India PM NARENDRA MODI and Japan PM KISHIDA FUMIO to discuss the war in Ukraine and its implications for the Indo-Pacific region.",
    "Here’s the reality: “The Interior Department processed more oil and gas drilling permits during Biden's first year in office than three of the four years of the Trump administration,” our Ben Lefebvre and Zack Colman report.",
    "— The International Criminal Court will “immediately proceed with active investigations” into “allegations of war crimes, crimes against humanity or genocide committed” in Ukraine, according to ICC chief prosecutor KARIM A.",
    "Biden should simultaneously green-light domestic energy production to offset any oil shortages — a policy the GOP has been pushing for years and that is, in many ways, antithetical to the administration’s climate goals.",
    "Russian forces surrounded another key port city, Mariupol, whose fall would enable two flanks of Russian and Russian-backed fighters to trap Ukraine’s forces in the southeast.”\n— Kyiv remained under Ukrainian control.",
    "CONGRESS\nMANCHIN COUNTERS ON BBB — Hours after Biden floated a scaled-back version of his now-dead social-spending package, Manchin sounded more optimistic about a reconciliation Take Two than we’ve heard in a while.",
    "WSJ: “The large Russian force moving from Belarus northwest of Kyiv was held and repelled by Ukrainian forces in towns like Bucha, where the central street was littered with burned-out Russian military vehicles.",
    "Either they get to paint Biden as unwilling to go all out to punish Putin, or he takes the bait and gas prices jump before the midterms, which they’ll of course blame him for also..\nGood Thursday morning.",
    "From the Duberstein Group announcement: “While he had a knack (some might call it a reputation) for being the last one to enter the room, Ken was guaranteed to be the first one to fill it with laughter.",
    "Said McConnell: “I didn’t get an answer to that, but I’m sure she’ll be asked that again in her hearings before the Judiciary Committee.” The full clip\n— Meanwhile, Jackson also met with Sens.",
    "will circulate a memo to House Republicans blasting what he’s calling Biden’s “assault on domestic energy producers.” From the memo: “Putin’s war of aggression in Ukraine is an energy war.",
    "On Wednesday, crude oil prices reached their highest level in more than a decade, which will further inflate the cost of gasoline, already averaging $3.60 a gallon nationally.",
    "… The calculated messages, threaded through one of the most important speeches of Biden’s young presidency, marked a clear effort to reset the political climate for Democrats.",
    "Burgess Everett and Nicholas Wu report that Manchin wants to start with revenue savings from prescription drug pricing reform and rolling back the 2017 Trump tax cuts.",
    "“He glossed over concerns about voting rights and spent little time heralding his historic decision to nominate the first Black woman to serve on the Supreme Court.",
    "“Its mayor, IGOR KOLYKHAEV, said Russian troops had forced their way into the city council building and imposed a curfew on residents,” according to the BBC.",
    "And even though the administration paused new oil and gas lease sales on federal lands, many of the administration’s “green” policies have been stalled.",
    "While Russian oil and gas makes up a tiny fraction of U.S. energy supply, choking off its energy products will likely send prices soaring even more.",
    "Joe Manchin (D-W.Va.) and Lisa Murkowski (R-Alaska) sitting together, Sen. Susan Collins (R-Maine), and Justices Brett Kavanaugh and Samuel Alito.",
    "SOME FACTS TO KEEP IN MIND AS THIS DEBATE PLAYS OUT:\nThere’s a difference between banning Russian oil in the U.S. and sanctioning those products.",
    "“This is our moment to have a strong bipartisan response to say, ‘We don’t need your oil anymore than we need your caviar,’” Markey told Josh.",
    "), a leading progressive voice on climate change and the Senate sponsor of the Green New Deal, has drafted his own bill banning Russian oil.",
    "LISA MURKOWSKI (R-Alaska) and JOE MANCHIN (D-W.Va.), who hail from energy-producing states, are unveiling a bill to ban Russian oil imports.",
    "It’s why he used his State of the Union to announce that the U.S. and other countries would release 60 million barrels of oil from reserves.",
    "PLAYBOOKERS\nIN MEMORIAM — Ken Duberstein, former Reagan White House chief of staff and chair/CEO of the Duberstein Group, has died at 77.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "Regardless of how, when, and where Ken entered your life, you undoubtedly came away a bit happier, a bit lighter, a bit more thankful.",
    "— If he doesn’t block Russian oil and gas imports, Biden opens himself to allegations that he’s giving Putin precious breathing room.",
    "With Russia’s economy so reliant on the energy sector, the U.S. should target that nation’s energy exports in order to be effective.",
    "Its mayor told the BBC shelling and cruise missile strikes were hitting residential areas and inflicting heavy civilian casualties.",
    "MEDIA MOVES — Tim Murtaugh is now a columnist for The Washington Times, writing biweekly about the media, Big Tech and politics.",
    "Few lawmakers are advocating for going this far, though that is starting to change as the situation in Ukraine spirals.",
    "Republicans like to claim that Biden’s clean energy policies bolster Putin by not investing in domestic oil production.",
    "We are energy vulnerable.” First look at the memo here\nIT'S NOT JUST THE FAR RIGHT, THOUGH ...\n— In the center: Sens.",
    "— A million Ukrainians have fled the country, according to FILIPPO GRANDI, the U.N. High Commissioner for Refugees.",
    "— 5 p.m.: Biden will sign the Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act into law.",
    "We certainly have.”\nRon DeSantis pressured students appearing at an event with him to take off their masks.",
    "The FERC chair and commissioners will testify before the Energy and Natural Resources Committee at 10 a.m.",
    "We have not been in as volatile a situation as anytime in my life.”\n— On the left: Sen. ED MARKEY (D-Mass.",
    "It’s why desperate Hill Democrats looking toward the midterms are floating the idea of a gas tax holiday.",
    "However, if he bans Russian oil, and gas prices hike further, pressure to act will certainly increase.",
    "Even if Biden does ban Russian imports, it’s unclear whether he would open up new lands for drilling.",
    "The latter would dictate that no country that partners with the U.S. could buy Russian, either.",
    "The administration says that’s problematic for Europe, which relies heavily on Russia’s supply.",
    "He was comms director for the Trump reelect and has his own firm, Line Drive Public Affairs.",
    "That’s the last thing Biden wants, as inflation is already dragging down his poll numbers.",
    "Biden and Harris will speak, with Garland and Labor Secretary MARTY WALSH also attending.",
    "Here’s why:\n— If he does block Russian oil, skyrocketing gas prices will go even higher.",
    "TRANSITIONS — Missy Jenkins is joining The Assistance Fund as VP of external affairs.",
    "The issue is creating a dammed-if-he-does, damned-if-he-doesn’t situation for Biden.",
    "But now, calls to ban Russian oil are gaining bipartisan traction on Capitol Hill.",
    "— 2 p.m.: Biden will hold a Cabinet meeting, with VP KAMALA HARRIS also attending.",
    "BBC: “Ukraine's second-largest city, Kharkiv, came under a fierce aerial assault.",
    "She previously was founder of Belleaire Consulting, and is a Newt Gingrich alum.",
    "FIRST IN PLAYBOOK — Deanna Williams is now an SVP in Precision’s comms practice.",
    "But we all need to recognize Europe is in the midst of a war with Russia now.",
    "Fed Chair JEROME POWELL will testify before the Banking Committee at 10 a.m.",
    "She most recently consulted for various agencies, and is a Marriott alum.",
    "Case in point: Today, Republican Study Committee Chair JIM BANKS (R-Ind.)",
    "She previously was a reporter for the Heritage Foundation’s Daily Signal.",
    "… Marlon Bateman is now executive adviser to the office of the Utah A.G.",
    "Howard Fineman recalled being taken into KGB custody in Ukraine in 1970.",
    "The issue is making Republicans salivate, no matter how it ends up.",
    "That’s a separate issue — one that would infuriate his own party.",
    "He is a Trump State Department, Hoover Institution and RNC alum.",
    "He was somehow both larger than life and invariably authentic.",
    "DICK DURBIN (D-Ill.) and CHUCK GRASSLEY (R-Iowa) on Wednesday.",
    "— 11:15 a.m.: Biden will receive the President’s Daily Brief.",
    "… Mary Margaret Olohan is now a reporter for The Daily Wire.",
    "And, thanks to Joe Biden, America is unprepared to fight it.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "Send Playbookers tips to playbook@politico.com.",
    "Press secretary JEN PSAKI will brief at 1 p.m.",
    "Innocent people are dying, children are dying.",
    "— Peace talks will resume today, per CNN.",
    "They’ve argued two main things:\n1.",
    "And the GOP is itching to pounce.",
    "NYT’s Carl Hulse has the debrief.",
    "CRAZIEST STORY OF THE DAY — “Rep.",
    "The pay: $6,666.66 per month.",
    "Thanks for reading Playbook.",
    "And this is going to hurt.",
    "Nobody wants to see that.",
    "35 countries abstained.",
    "THE SENATE is in.",
    "Sign up here.",
    "A. KHAN.",
    "“Mr.",
    "2."
  ]
}