{
  "id": 5564,
  "mediaId": 2643,
  "date": "2022-02-11",
  "headline": "Rep. David Schweikert's Campaign Committee Fined $125K For Misusing Funds",
  "image": "",
  "link": "https://www.newsweek.com/rep-david-schweikerts-campaign-committee-fined-125k-misusing-funds-1678621",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron McDade",
  "authorUrl": "https://www.newsweek.com/authors/aaron-mcdade",
  "termIds": [
    3050,
    372,
    1163,
    4830
  ],
  "sentences": [
    "The investigation found that on multiple occasions over the course of several years, campaign finance documents were filed with the incorrect recipient of funds, or they listed a recipient but lacked adequate description for what the payment was for, or in several cases, whether it was then set to be transferred to a third party.",
    "The FEC found that an estimated $78,000 in disbursements were inadequately identified in campaign finance reports, with many listed under generic terms like \"strategic consulting,\" which were found to have paid for a wide range of things including advertising, website design, food and drinks, among others.",
    "The FEC documents, signed last month and released Friday, state that the committee \"knowingly and willfully,\" violated campaign finance laws by misreporting who received disbursements and for what purposes, and by \"converting campaign funds to personal use.\"",
    "\"No one has been more directly harmed by the malfeasance of Congressman Schweikert's former Chief of Staff than Friends of David Schweikert,\" said Chris Baker, a spokesperson for Schweikert's campaign committee, in a statement to Newsweek.",
    "The personal expenses included child care and other reimbursements of staff members who paid for Schweikert's personal expenses on their own, like dry cleaning meals or flight arrangements for the Representative's personal travel.",
    "The report also states that while the campaign understood the FEC's reasoning for believing that the violations were \"knowing and willful,\" the campaign did not admit to committing the violations knowingly and willfully.",
    "In 2020, Schweikert was fined $50,000 following a congressional ethics investigation into similar violations, mostly regarding payments to Oliver Schwab, Schweikert's former chief of staff, according to The Daily Beast.",
    "And while he has had no relationship or involvement with the campaign committee for several years now, we felt it was the right thing to self report his violations and enter into a conciliation agreement with the FEC.\"",
    "The campaign committee of U.S. Representative David Schweikert, a Republican from Arizona, has agreed to pay a total of $125,000 in fines related to improper use and classification of funds between 2014 and 2018.",
    "The fines, now public with the release of documents from the Federal Elections Commission, also came with an admission that the campaign broke at least three federal campaign finance laws.",
    "In addition, the FEC referenced the House Ethics Committee investigation's findings that nearly $1,500 of campaign funds were improperly used for personal expenses of staff members.",
    "It also found that about $50,000 was identified as being paid directly to Schwab, without properly identifying a third-party vendor to whom Schwab then paid the money.",
    "\"This matter arose after Friends of David Schweikert became fully aware of the extent of the former Chief of Staff's violations and self-reported them to the FEC.",
    "In addition to the $125,000 fine, the campaign also agreed to amend the prior campaign finance reports to accurately reflect the nature of the payments.",
    "The FEC probe was requested by Schweikert's campaign in a \"sua sponte\" submission, Latin for \"of one's own accord.\"",
    "The FEC investigation, unlike the congressional probe, was private until the documents were released Friday.",
    "Update 2/14/22, 4:07 p.m.: This story has been updated with a statement from Rep. Schweikert's campaign.",
    "Update 2/11/22, 5:50 p.m.: This story has been updated with additional information from the FEC report.",
    "This is the first time, either."
  ]
}