{
  "id": 5773,
  "mediaId": 2554,
  "date": "2022-02-05",
  "headline": "Bitcoin surges by 10%: US crypto-bill to 'unleash innovation' - expert makes $100K claim",
  "image": "https://cdn.images.express.co.uk/img/dynamic/22/750x445/1561457.jpg",
  "link": "https://www.express.co.uk/finance/city/1561457/Bitcoin-price-news-latest-jumps-10-congressman-us-crypto-bill-virtual-currency-tax",
  "mediaOutlet": "dailyexpress.co.uk",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian McGleenon",
  "authorUrl": "https://www.express.co.uk/journalist/122786/Brian-McGleenon",
  "termIds": [
    0
  ],
  "sentences": [
    "Speaking to Forbes, executive director of cryptocurrency think tank Coin Center Jerry Brito said: \"Not only will this create a level playing field for digital currencies, it will also help unleash innovation on applications like micropayments, which can consist of dozens of transactions per minute and thus are difficult to square with the current law.\"",
    "[INSIGHT]\n[ANALYSIS]\n[INSIGHT]\nHe added: \"We will continue to see more widespread adoption and the use of this once called “foreign” form of payment being more recognisable and used as it was created to be.\"",
    "Speaking about the reason for the rise in the bitcoin price crypto AMA host Andrew Forte said: \"The traditional financial market and that of new digital assets have a tendency of moving in sync.",
    "Cryptocurrency: Expert discusses success of Bitcoin\nThe bill will allow tax relief on small crypto payments and ease the use of bitcoin and ethereum as a means of day to day transactions.",
    "\"Crypto users once again remain optimistic and bullish in response to the proposed bill and the case over staking rewards which have great potential to benefit pioneers of this space.\"",
    "A group of bipartisan US representatives have reintroduced a bill that would exempt US citizens from paying taxes on bitcoin and crypto payments under $200.",
    "BITCOIN has surged 10 percent today after the US congressmen introduced a radical crypto bill that promises to \"unleash innovation\".",
    "The \"Virtual Currency Tax Fairness Act\" is an amendment bill that would simplify tax burdens on daily crypto users within the US.",
    "The bitcoin price has surged 300 percent over the last two years with the ethereum price climbing at an even faster pace.",
    "This was due to the demand for blockchain-based decentralized finance (DeFi) and collectable non-fungible tokens (NFTs).",
    "This week, congressman David Schweikert said in a statement: \"Virtual currency is reshaping our everyday lives.",
    "Currently, the IRS has been more active in pursuing holders of cryptocurrency such as bitcoin for tax evasion.",
    "\"This legislation is an important step forward, and it lays the groundwork for growing the digital economy.\"",
    "\"A 10 percent rally in Bitcoin, the vocal point of all digital assets; similarly to the S&P 500 and Nasdaq.",
    "\"The United States needs to recognise this and work to treat these currencies fairly in our tax code.",
    "\"Despite what seems to be a very confusing and uncertain future for crypto regulation and taxation.",
    "As of the time of writing the price of bitcoin is currently $41,500, up 10 percent in 24 hours.",
    "\"The United States had an influx of 467,000 jobs in January that exceeded many expectations.",
    "\"The move of both markets comes partially due to a stronger-than-expected jobs report.",
    "The value of ethereum has also jumped, rising 20 percent over last week's price.",
    "Mr Forte believes, \"bitcoin (BTC) can be priced at 100k within 3 years\".",
    "The price of ethereum is $3,000, up 9 percent in the last 24 hours.",
    "The bill was called \"an important step forward\" by one congressman.",
    "All-of of which moved in an upward trend."
  ]
}