{
  "id": 5796,
  "mediaId": 2528,
  "date": "2022-02-11",
  "headline": "Arizona GOP Rep. David Schweikert fined $125,000 by Federal Election Commission for repeated campaign finance law violations",
  "image": "https://i.insider.com/62069f8d3b86990018b2f122?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/fec-fines-arizona-david-schweikert-125000-campaign-finance-violations-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryan Metzger",
  "authorUrl": "https://www.businessinsider.com/author/bryan-metzger",
  "termIds": [
    3050,
    80,
    372,
    878,
    1156,
    4830
  ],
  "sentences": [
    "At one point during the investigation, Schwab testified to investigators that Schweikert was \"very adamant that he did not want a whole bunch of dinners in DC showing up on his FECs,\" directing Schwab to pay for those transactions personally and then charge Schweikert's campaign account for \"consulting fees\" to conceal the real purpose.",
    "Specifically, Schweikert failed to disclose at least $300,000 in loans or loan repayments to his campaign accounts, falsely reported other transactions, and paid $270,000 to a consulting firm operated by his chief of staff, Oliver Schwab, violating ethics rules that restrict outside income for senior congressional aides.",
    "At the encouragement of OCE, Schweikert voluntarily disclosed the malfeasance — specifically, submitting nearly $78,000 worth of insufficiently detailed spending reports and over $50,000 worth of transactions that listed the wrong recipient — to the FEC in June of 2018.",
    "Republican Rep. David Schweikert of Arizona has agreed to pay a $125,000 fine related to repeated campaign finance violations he committed between 2010 and 2017, according to documents made public by the Federal Election Commission on Friday.",
    "The bipartisan panel found the congressman misused taxpayer funds for non-official purposes, pressured his congressional staff to perform campaign-related work, and exhibited a \"lack of candor and due diligence\" during that investigation.",
    "\"While he has had no relationship or involvement with the campaign committee for several years now, we felt it was the right thing to self report his violations and enter into a conciliation agreement with the FEC.\"",
    "All of that emerged after a 2017 opinion piece in the Washington Examiner accused Schwab of using taxpayer funds to support a lavish lifestyle, prompting a complaint with the Office of Congressional Ethics.",
    "The commission ultimately voted 5-1 in August to find that Schweikert intentionally violated campaign finance laws, with Republican Commissioner Sean Cooksey the only dissenter.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "The FEC found that Schweikert \"knowingly and willfully\" misreported who and for what his official funds were used and misused campaign funds for personal affairs.",
    "And last month, both Schweikert and Schwab entered into conciliation agreements with the commission, which the commission unanimously voted to approve.",
    "\"No one has been more directly harmed by the malfeasance of Congressman Schweikert's former Chief of Staff\" than the campaign, he said in a statement.",
    "Tom Williams/CQ-Roll Call, Inc via Getty Images\nSchweikert was fined $125,000 by the FEC for improper spending and misreporting of campaign funds.",
    "Schweikert's committee agreed to pay a $125,000 civil penalty and amend its prior reports, while Schwab agreed to pay $7,500 in fines.",
    "He admitted to 11 different violations of House rules, leading to a formal reprimand by voice vote the following month.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Schweikert campaign committee spokesman Chris Baker blamed Schwab for the violations in a comment to Insider.",
    "A staffer testified that Schweikert \"did not want a whole bunch of dinners in DC showing up on his FECs.\"",
    "In July 2020, Schweikert was fined $50,000 by the House Ethics Committee for the same set of violations.",
    "He was previously fined $50,000 in 2020 by the House Ethics Committee for the same issues.",
    "Republican Rep. David Schweikert at a hearing on Capitol Hill on September 14, 2021.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Schwab parted ways with Schweikert amid the ethics investigation in 2018.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}