{
  "id": 5871,
  "mediaId": 2512,
  "date": "2022-02-13",
  "headline": "GOP lawmaker hit with $125K FEC fine for repeated campaign law violations",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29323465&width=1200&coordinates=0%2C16%2C0%2C34&height=600",
  "link": "https://www.alternet.org/2022/02/david-schweikert-fec/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meaghan Ellis",
  "authorUrl": "https://www.alternet.org/author/meaghanellis",
  "termIds": [
    3050,
    372,
    878,
    1156,
    1163,
    4830
  ],
  "sentences": [
    "\"Throughout the course of this investigation, Representative Schweikert made vague or misleading statements to the (investigative subcommittee) and (the Office of Congressional Ethics) that allowed him to evade the statute of limitations for the most egregious violations of campaign finance laws, his document productions were slow or non-responsive to several of the ISC’s requests for information regarding (Federal Election Commission) errors, and he gave self-serving testimony that lacked candor,\" the report said.",
    "Per Insider:\n\"Specifically, Schweikert failed to disclose at least $300,000 in loans or loan repayments to his campaign accounts, falsely reported other transactions, and paid $270,000 to a consulting firm operated by his chief of staff, Oliver Schwab, violating ethics rules that restrict outside income for senior congressional aides.\"",
    "\"While he has had no relationship or involvement with the campaign committee for several years now, we felt it was the right thing to self report his violations and enter into a conciliation agreement with the FEC.\"",
    "According to campaign finance documents disclosed by the FEC on Friday, February 11, the commission has determined that the Republican lawmaker repeatedly violated campaign finance laws from 2010 to 2017.",
    "In the report for that investigation, Schweikert was criticized for making vague and misleading statements to \"evade the statute of limitations for the most egregious violations of campaign finance laws.\"",
    "A Republican congressman in Arizona has been fined by the Federal Election Commission (FEC) for misappropriation of campaign funds, according to new reports.",
    "\"No one has been more directly harmed by the malfeasance of Congressman Schweikert's former Chief of Staff than the campaign,\" he said in a statement.",
    "According to Arizona Central, the lawmaker had a total of 11 ethics violations as a result of a lengthy House Ethics Committee investigation.",
    "Schweikert is also accused of \"knowingly and willfully\" misreporting how campaign funds were used and what they were used for.",
    "In a statement to Insider, Schweikert's spokesperson, Chris Baker, blamed Schwab for the campaign's repeated violations.",
    "Schweikert's campaign committee will pay a $125,000 fine for civil penalties while Schwab will pay a $7,500 fine.",
    "Business Insider reports that Rep. David Schweikert (R-Ariz.) has agreed to a penalty payment of $125,000.",
    "The statement comes one month after Schweikert and Schwab came to a conciliation agreement with the FEC.",
    "Report reveals how Ted Cruz found a way around this campaign finance rule - Alternet.org ›",
    "It was also determined that he had misused his political funds for personal use.",
    "The lawmaker's committee will also amend its reports as part of the agreement.",
    "This $125,000 fine follows Schweikert's previous $50,000 fine.",
    "The commission has approved the agreement."
  ]
}