{
  "id": 6227,
  "mediaId": 2924,
  "date": "2022-02-04",
  "headline": "Exempting Some Crypto Deals From IRS Makes Sense, Lawmakers Say",
  "image": "https://www.thestreet.com/.image/t_share/MTg1ODg4NTE4ODg1NjE1Mjk5/bitcoin_1.jpg",
  "link": "https://www.thestreet.com/investing/cryptocurrency/exempting-some-crypto-deals-from-irs-makes-sense-lawmakers-say",
  "mediaOutlet": "The Street",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rob Lenihan",
  "authorUrl": "https://www.thestreet.com/author/rob-lenihan",
  "termIds": [
    0
  ],
  "sentences": [
    "\"It’s great to see a bill like this be reintroduced and to have Congress focused on the years of bitcoin in smaller and daily transaction without adding significant tax burden or reporting requirements,\" said Brock Pierce, chairman of the Bitcoin Foundation.",
    "She added that the \"cuts the red tape and opens the door to further innovations, ultimately growing our digital economy.”\nIf it becomes law, the legislation would retroactively apply to all qualifying transactions from Dec. 31, 2021.",
    "Rep. Suzan DelBene, D-Wash., and David Schweikert R-Ariz., introduced the Virtual Currency Tax Fairness Act, which they said would \"create a workable structure for taxing purchases made with virtual currency.\"",
    "Cuts The Red Tape\n“Antiquated regulations around virtual currency do not take into account its potential for use in our daily lives, instead treating it more like a stock or ETF,” DelBene said.",
    "\"While this isn’t the first time a bill like this has been introduced to the House of Representatives, this latest iteration is coming just in time for the current tax season,\" Carnahan said.",
    "Citing \"antiquated regulations around virtual currency,\" U.S. lawmakers introduced the latest version of a bill that exempt cryptocurrency users from paying taxes on transactions under $200.",
    "\"The bill in its current form could offer real relief to new participants, many of whom are still scrambling to figure out how their crypto holdings will affect their taxes this year.\"",
    "'Any Step Forward'\nAlex Lemberg, CEO of Nimbus Platform, acknowledged the bill's importance, \"even though I certainly have considerable doubt in success of it being passed.\"",
    "Micah Carnahan, crypto and fintech specialist at Finder, said \"crypto taxes could be changing again, and this time, the law might actually help small investors.\"",
    "As more countries around the world consider adopting bitcoin as legal tender, Pierce said, its use in everyday transactions will likely continue to grow.",
    "Lemberg added that any step forward on a federal level to \"further acknowledge and work with\" blockchain could have a positive impact.",
    "“However, virtual currency has evolved rapidly in the past few years with more opportunities to use it in our everyday lives.\"",
    "\"The big deal is that there is an effort being put forth which sends a message of willful collaboration and participation.\"",
    "It's Not the First Try\nThere have earlier versions of the bill in 2017 and 2020 but neither received a vote in Congress.",
    "\"Any regulations or tax and reporting requirements that slow it down would be detrimental to the growth,\" he said.",
    "With younger generations onboarding into crypto, Carnahan said, smaller transactions have become more common.",
    "\"I also do not think the amount in question is what the focus should be at this time,\" he said.",
    "Reps. Tom Emmer, R-Minn., and Darren Soto, D-Fla., co-sponsored the proposed legislation.",
    "\"Most non-fungible tokens (NFTs), for example, sell for less than $200,\" he said.",
    "Cryptocurrency sector analysts are expressing support for the new legislation."
  ]
}