[
  {
    "id": 3631,
    "mediaId": 2520,
    "date": "2022-01-24",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is no longer attorney general.",
    "author": "EJ Montini",
    "title": "Arizona Attorney General Mark Brnovich turns a blind eye to fake Trump electors"
  },
  {
    "id": 4387,
    "mediaId": 2522,
    "date": "2022-01-26",
    "sentence": "The lawsuit, filed by Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, alleged that Google used unfair and deceptive practices to obtain users’ location data, which it then exploits for targeted advertising.",
    "author": "BPR Wire",
    "title": "Google handed major defeat in state AG lawsuit over location tacking"
  },
  {
    "id": 3761,
    "mediaId": 8322,
    "date": "2022-01-27",
    "sentence": "\"Americans do not require approval from a local jurisdiction to exercise their constitutional rights,\" Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in a press release.",
    "author": "Michael Lee",
    "title": "Twenty-five states urge Supreme Court to hear case fighting Maryland firearms ban"
  },
  {
    "id": 2904,
    "mediaId": 2548,
    "date": "2022-01-31",
    "sentence": "Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> sent a letter to Department of Homeland Security (DHS) Secretary Alejandro Mayorkas on Jan. 27 demanding that he stop allowing illegal migrants to travel through U.S. airports over a TSA policy permitting them to use arrest warrants as identification.",
    "author": "",
    "title": "State AG Asks Mayorkas To Stop Letting Illegal Migrants Travel Through US Airports With Arrest Warrants"
  },
  {
    "id": 3278,
    "mediaId": 2553,
    "date": "2022-02-01",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> submitted a petition for rulemaking to the U.S. Department of Health and Human Services (HHS) asking for the agency to adopt a rule that would prohibit the use of race or ethnicity when determining who should get medical therapies.",
    "author": "Ashe Schow",
    "title": "Arizona AG Asks HHS To Prohibit Racial Discrimination In COVID-19 Treatments"
  },
  {
    "id": 2693,
    "mediaId": 8322,
    "date": "2022-02-01",
    "sentence": "DESPITE DEMOCRACY FEARS, MORE AMERICANS ACCEPT BIDEN'S ELECTION THAN THEY DID TRUMP'S FOUR YEARS AGO\n\"Appearing before Judge Margaret LaBianca in Maricopa County Superior Court on January 26, 2022, McKee admitted signing Mary Arendt’s name to an early ballot envelope and mailing it to Maricopa County on or between October 7, 2020, and November 3, 2020,\" the office of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement, according to the report.",
    "author": "Lawrence Richard",
    "title": "Arizona woman pleads guilty to voter fraud after accused of forging dead mother's signature"
  },
  {
    "id": 2813,
    "mediaId": 8387,
    "date": "2022-02-01",
    "sentence": "Tracey Kay McKee, 64, entered a guilty plea to one felony count of attempted illegal voting for signing and casting her recently deceased mother's early ballot in the 2020 general election, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> reported.",
    "author": "Julie Luchetta",
    "title": "Scottsdale woman pleads guilty to casting dead mother's ballot in 2020 election"
  },
  {
    "id": 2749,
    "mediaId": 8326,
    "date": "2022-02-02",
    "sentence": "The lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Senate candidate and ally of former President Donald Trump.",
    "author": "Chelsey Cox",
    "title": "Arizona GOP Chair Kelli Ward, spouse, sue to block Jan. 6 panel from accessing phone records"
  },
  {
    "id": 2684,
    "mediaId": 2572,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Fox News Staff",
    "title": "Arizona attorney general: Biden sending US troops to secure Ukraine border is 'height of hypocrisy'"
  },
  {
    "id": 3046,
    "mediaId": 2514,
    "date": "2022-02-02",
    "sentence": "The case involving the lawsuit was initially assigned to U.S. District Judge Susan Brnovich, a Trump appointee whose husband, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, was criticized by Trump at a rally in the state last month for not doing more to investigate \"fraud\" in the 2020 election.",
    "author": "",
    "title": "Two 'alternate electors' sue Jan. 6 committee to block subpoena"
  },
  {
    "id": 3420,
    "mediaId": 2688,
    "date": "2022-02-02",
    "sentence": "According to Politico, the Wards’ lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, the wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> — an ally of former President Donald Trump who is running for Senate.",
    "author": "Cristina Cabrera",
    "title": "Jan. 6 Committee Subpoenas Arizona GOP Chair And Her Husband’s Phone Records"
  },
  {
    "id": 2777,
    "mediaId": 8475,
    "date": "2022-02-03",
    "sentence": "In September, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> sued the Biden administration over the federal government's mandate to require the COVID vaccine for federal workers, calling them unconstitutional.",
    "author": "Michael McDaniel",
    "title": "Arizona Republicans seek sovereignty over federal COVID mandates"
  },
  {
    "id": 3350,
    "mediaId": 2740,
    "date": "2022-02-03",
    "sentence": "The lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Senate candidate and ally of former President Donald Trump.",
    "author": "Chelsey Cox",
    "title": "Arizona GOP Chair Kelli Ward, spouse, sue to block Jan. 6 panel from accessing phone records"
  },
  {
    "id": 2606,
    "mediaId": 8350,
    "date": "2022-02-05",
    "sentence": "PHOENIX — A woman from Cochise County was indicted for allegedly casting the early ballot of her dead mother during the 2020 election, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> announced on Wednesday.",
    "author": "KTAR.COM",
    "title": "Another Arizona woman accused of casting dead mother’s ballot"
  },
  {
    "id": 1831,
    "mediaId": 8350,
    "date": "2022-02-06",
    "sentence": "A woman from Cochise County was indicted for allegedly casting the early ballot of her dead mother during the 2020 election, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> announced on Wednesday.",
    "author": "KTAR.COM",
    "title": "Weekend wrap-up: Here are the biggest Arizona stories from Feb. 4-6"
  },
  {
    "id": 1803,
    "mediaId": 2572,
    "date": "2022-02-07",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> on Monday issued a legal opinion that determines that the ongoing crisis at the southern border is an \"invasion\" under the Constitution – a move he says gives the state the power to take additional measures to defend itself.",
    "author": "Adam Shaw",
    "title": "Arizona AG Brnovich issues legal opinion declaring border crisis 'invasion' under Constitution"
  },
  {
    "id": 2178,
    "mediaId": 2919,
    "date": "2022-02-07",
    "sentence": "The four lawsuits filed in late January build upon claims made in a 2020 lawsuit filed by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Joseph Peters",
    "title": "State AGs sue Google over use and collection of location data"
  },
  {
    "id": 2546,
    "mediaId": 2641,
    "date": "2022-02-07",
    "sentence": "\"The violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an 'invasion' under the U.S. Constitution, and Arizona therefore has the power to defend itself from this invasion under the Governor’s authority as Commander-in-Chief,\" Attorney General <span class='selected-term'>Mark Brnovich</span> writes.",
    "author": "Jack Gournell",
    "title": "AG Brnovich: Arizona Can Declare 'Invasion,' Defend Self Under Constitution"
  },
  {
    "id": 2516,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "“Evidence and testimony collected since November 3, 2020, has reached the point of clear and convincing and is now in the hands of the Arizona Attorney General for action.”\nThe only thing clear and convincing is the fact that Attorney General <span class='selected-term'>Mark Brnovich</span> is under tremendous pressure to indict someone (anyone?)",
    "author": "Laurie Roberts",
    "title": "Rep. Finchem's bill to decertify Arizona's election is more about 2022 than 2020"
  },
  {
    "id": 1868,
    "mediaId": 2520,
    "date": "2022-02-08",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> has issued a sloppy, misleading opinion about Arizona's ability to address border security, columnist Robert Robb says.",
    "author": "",
    "title": "Can Arizona really go to war to stop a border 'invasion'?"
  },
  {
    "id": 2263,
    "mediaId": 2557,
    "date": "2022-02-08",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Fox News:\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> on Monday issued a legal opinion that determines that the ongoing crisis at the southern border is an “invasion” under the Constitution – a move he says gives the state the power to take additional measures to defend itself.",
    "author": "DML News App",
    "title": "REPORT: GOP state attorney general issues legal opinion declaring border crisis ‘invasion’ under Constitution"
  },
  {
    "id": 1967,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has officially ruled that the chaos on the Mexican border constitutes an “invasion” under the U.S. Constitution, clearing the way for the state’s governor to defend the boundary with police or troops of his own.",
    "author": "Stephen Dinan",
    "title": "Arizona AG rules states can deploy forces to fight border ‘invasion’"
  },
  {
    "id": 1826,
    "mediaId": 2564,
    "date": "2022-02-08",
    "sentence": "+5\nView gallery\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> released a legal opinion Monday calling the southern border crisis an 'invasion,' and claiming the U.S. Constitution gives states the power to defend and take action against such invasions\n STATE OF ARIZONA OFFICE OF THE ATTORNEY GENERAL\n ATTORNEY GENERAL OPINION By MARK BRNOVICH ATTORNEY GENERAL February 7, 2022 No.",
    "author": "Katelyn Caralle",
    "title": "Arizona's Republican Attorney General calls Biden's border crisis an 'INVASION': Mark Brnovich states in legal opinion the state can defend itself from the influx of migrants under the US Constitution"
  },
  {
    "id": 1134,
    "mediaId": 2573,
    "date": "2022-02-11",
    "sentence": "",
    "author": "",
    "title": "Fighter jet crashes at Luke AFB in Arizona; pilot survives"
  },
  {
    "id": 913,
    "mediaId": 8475,
    "date": "2022-02-14",
    "sentence": "Opinion\nGuest opinion\nIt’s impossible to overstate just how lawless and dangerous Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> showed himself to be this month when he issued a flagrantly political legal opinion that all but dares Gov.",
    "author": "Jim Small",
    "title": "Arizona AG Brnovich’s radical, lawless border war opinion normalizes extremism - sets stage for violence"
  },
  {
    "id": 1787,
    "mediaId": 2520,
    "date": "2022-02-15",
    "sentence": "Republican Attorney General <span class='selected-term'>Mark Brnovich</span> – now using his office as a campaign tool for his U.S. Senate campaign – filed a legal brief with the Arizona Supreme Court arguing that the court didn’t have the authority to rule on the anti-mask mandate.",
    "author": "EJ Montini",
    "title": "Arizona, where masks in classrooms are bad, but guns in classrooms are ... good?"
  },
  {
    "id": 1438,
    "mediaId": 6511,
    "date": "2022-02-16",
    "sentence": "El año pasado el fiscal de Arizona, <span class='selected-term'>Mark Brnovich</span>, dijo que el estado reanudaría las ejecuciones de las personas en el corredor de la muerte que hayan agotado sus apelaciones, por lo que los demandantes quieren que los tribunales eliminen el uso del gas “de una vez por todas”.",
    "author": "",
    "title": "ACLU demanda a Arizona para impedir ejecuciones con gas usado por nazis"
  },
  {
    "id": 1397,
    "mediaId": 2540,
    "date": "2022-02-17",
    "sentence": "The nominal frontrunner is probably state Attorney General <span class='selected-term'>Mark Brnovich</span> but no one -- in Arizona or Washington -- sees him as a top tier challenger to Kelly.",
    "author": "Chris Cillizza",
    "title": "Donald Trump may be single-handedly costing Republicans a Senate seat"
  },
  {
    "id": 414,
    "mediaId": 6676,
    "date": "2022-02-19",
    "sentence": "Tucson.com reached out to Attorney Gen. <span class='selected-term'>Mark Brnovich</span> but did not immediately hear back.",
    "author": "Russell Falcon",
    "title": "Arizona Jewish council sues to end gas chamber executions"
  },
  {
    "id": 3,
    "mediaId": 2573,
    "date": "2022-02-19",
    "sentence": "Earlier this month, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> issued a legal opinion declaring the situation at the border an \"invasion.\"",
    "author": "Adam Shaw",
    "title": "Conservative groups urge border states to use 'every legal means' to combat migrant crisis"
  },
  {
    "id": 40,
    "mediaId": 2572,
    "date": "2022-02-21",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> asked the state's Supreme Court last month to set briefing schedules so that his office can file execution warrants for Frank Atwood and Clarence Dixon.",
    "author": "Paul Best",
    "title": "Arizona Jewish community leaders sue state over potential use of cyanide gas in executions"
  },
  {
    "id": 678,
    "mediaId": 2746,
    "date": "2022-02-21",
    "sentence": "“While America is indeed the land of opportunity, it’s not the land of the welfare state,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told The Washington Times.",
    "author": "Stephen Dinan",
    "title": "DHS eyes more welfare for legal immigrants as Supreme Court hears challenge"
  },
  {
    "id": 458,
    "mediaId": 2520,
    "date": "2022-02-23",
    "sentence": "\"Whoever the federal government is, there's always going to be a state that thinks it's done the wrong thing,\" Kagan told Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "John Fritze",
    "title": "Supreme Court weighs whether Arizona can join lawsuit over Trump-era immigration rule"
  },
  {
    "id": 30,
    "mediaId": 8475,
    "date": "2022-02-24",
    "sentence": "Local\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> told the Supreme Court Wednesday that it would set a “dangerous precedent” if it let the Biden administration drop an immigration policy and refused to let the states step in to defend it.",
    "author": "Reagan Priest",
    "title": "Brnovich urges skeptical Supreme Court to let states step to defend public charge rule"
  },
  {
    "id": 757,
    "mediaId": 4091,
    "date": "2022-02-25",
    "sentence": "He also said that the results were being provided to the Arizona Senate as well as GOP Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "JD Heyes",
    "title": "Bombshell study finds more than 200,000 ballots from 2020 election with “mismatched signatures” indicating widespread fraud"
  },
  {
    "id": 17225,
    "mediaId": 8350,
    "date": "2022-02-27",
    "sentence": "Settlement funds will be disbursed to the state and its subdivisions through the One Arizona Plan over an 18-year period to aid in treatment, preventative measures and for education, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in a press release.",
    "author": "KTAR.COM",
    "title": "Weekend wrap-up: Here are the biggest Arizona stories from Feb. 25-27"
  },
  {
    "id": 12834,
    "mediaId": 2699,
    "date": "2022-02-28",
    "sentence": "“Stephen Hatch is a con man who will spend the next five years behind bars for tricking Arizona families into investing in his Ponzi scheme,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in June 2017.",
    "author": "Anna Venarchik",
    "title": "How a Real-Estate Agent Allegedly Bilked Christians Out of $82 Million in Massive Ponzi Scheme"
  },
  {
    "id": 11353,
    "mediaId": 2636,
    "date": "2022-03-08",
    "sentence": "",
    "author": "Stacy Cowley",
    "title": "Homeland Security Dept. gathered millions of money transfer records, senator says."
  },
  {
    "id": 15459,
    "mediaId": 8350,
    "date": "2022-03-10",
    "sentence": "#NCPW2022 https://t.co/UADOyOXBo0 pic.twitter.com/DlNFX4DBGl\n— <span class='selected-term'>Mark Brnovich</span> (@GeneralBrnovich) March 9, 2022\nIf the deal is approved, the restitution will be deposited into an account to be distributed to eligible consumers and cover claims administrator expenses.",
    "author": "KTAR.COM",
    "title": "Company accused of predatory lending in Arizona agrees to pay nearly $5M"
  },
  {
    "id": 11412,
    "mediaId": 8329,
    "date": "2022-03-11",
    "sentence": "But Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> may have a new argument to end ESG once and for all: it violates anti-law trust laws.",
    "author": "",
    "title": "The ‘genius’ argument to BANNING ESG that America may need"
  },
  {
    "id": 13410,
    "mediaId": 8450,
    "date": "2022-03-17",
    "sentence": "En una carta fechada el 17 de marzo, <span class='selected-term'>Mark Brnovich</span> citó una ley estatal que otorga a su oficina poderes de supervisión sobre los fiscales del condado.",
    "author": "",
    "title": "Brnovich exige a la fiscal Allister Adel respuestas de Adel sobre 180 casos desestimados"
  },
  {
    "id": 9263,
    "mediaId": 2520,
    "date": "2022-03-19",
    "sentence": "The request, made in a letter signed by Attorney General <span class='selected-term'>Mark Brnovich</span>, cites the attorney general's statutory authority in Arizona law to \"exercise supervisory powers over county attorneys of the several counties in matters pertaining to that office and require reports relating to the public business thereof.\"",
    "author": "Robert Anglen",
    "title": "Arizona's attorney general demands explanation, records from Allister Adel on 180 botched cases"
  },
  {
    "id": 9074,
    "mediaId": 2618,
    "date": "2022-03-21",
    "sentence": "AZ Attorney General <span class='selected-term'>Mark Brnovich</span> certified the fraudulent election, and he is certifying the cover-up by allowing the County to continue withholding elections machines and data.Arizona Senate President Karen Fann asked what they’re hiding now in a recent tweet.",
    "author": "Jordan Conradson",
    "title": "Maricopa County Receives Renewed Request For Records Or Information In 2020 Election Investigation – What Are They Hiding Now?"
  },
  {
    "id": 11668,
    "mediaId": 8450,
    "date": "2022-03-22",
    "sentence": "“Esta es una gran victoria para el estado de derecho y la seguridad de nuestras comunidades”, dijo el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>.",
    "author": "",
    "title": "Juez otorga orden preliminar a Arizona para frenar política de inmigración de Biden"
  },
  {
    "id": 11675,
    "mediaId": 8345,
    "date": "2022-03-22",
    "sentence": "She said the county has not sufficiently cooperated with a request for records from Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "",
    "title": "Arizona Senate GOP revives election bill"
  },
  {
    "id": 8891,
    "mediaId": 2573,
    "date": "2022-03-23",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> on Thursday hailed what he called a \"huge win for the rule of law\" after a federal judge partially blocked the implementation of the Biden administration’s significantly narrowed civil enforcement priorities, in response to a lawsuit from Republican states.",
    "author": "Adam Shaw",
    "title": "Arizona AG hails 'huge win for the rule of law' after judge partially blocks Biden ICE guidelines"
  },
  {
    "id": 11695,
    "mediaId": 8450,
    "date": "2022-03-28",
    "sentence": "“Esta es una gran victoria para el estado de derecho y la seguridad de nuestras comunidades”, dijo el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>.",
    "author": "",
    "title": "¿Quiénes son los inmigrantes que ICE puede deportar en Arizona?"
  },
  {
    "id": 9547,
    "mediaId": 2748,
    "date": "2022-03-28",
    "sentence": "Last week, President Trump released a statement saying, “now is finally the time for the Arizona Attorney General to issue warrants and take his investigation to the next level.”\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> has done nothing to hold these criminals accountable.",
    "author": "Women System",
    "title": "Maricopa County Supervisors Refuse To Attend Meeting After Arizona State Senate Issues New 2020 Election Subpoena"
  },
  {
    "id": 7441,
    "mediaId": 2520,
    "date": "2022-04-01",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> let his bid for U.S. Senate get in the way of his duty to defend Arizona election law, columnist Robert Robb says.",
    "author": "",
    "title": "Is AG Mark Brnovich ignoring his job just to appease Trump voters?"
  },
  {
    "id": 7293,
    "mediaId": 2520,
    "date": "2022-04-04",
    "sentence": "At the time, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said, “I’m not only shocked, but I’m disappointed.",
    "author": "EJ Montini",
    "title": "More legislative flim-flam to feed Arizona's charter school scam"
  },
  {
    "id": 7286,
    "mediaId": 2526,
    "date": "2022-04-04",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, Louisiana Attorney General Jeff Landry, and Missouri Attorney General Eric Schmitt have filed a lawsuit against President Joe Biden’s administration for plans to end the Title 42 border control that has helped stem waves of illegal immigration since 2020.",
    "author": "John Binder",
    "title": "Arizona, Louisiana, Missouri Sue Biden for Ending Title 42 Border Control"
  },
  {
    "id": 7191,
    "mediaId": 2664,
    "date": "2022-04-04",
    "sentence": "The fact remains that these right-wingers have been further enabled by the likes of Donald Trump and Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, both of whom spread the false gospel of Trump’s “Big Lie.”\nWith the U.S. Senate’s failure to pass voting rights legislation earlier this year, the voting rights fight has come to Arizona.",
    "author": "Anushka Sarkar",
    "title": "Arizona is leading the way on new anti-democratic laws fueled by Republican election lies"
  },
  {
    "id": 7631,
    "mediaId": 2522,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> bluntly stated on “Fox & Friends” Monday.",
    "author": "Terresa Monroe-Hamilton",
    "title": "GOP states sue Biden admin over plan to rescind Title 42 border policy, likely open migrant floodgates"
  },
  {
    "id": 9978,
    "mediaId": 8450,
    "date": "2022-04-04",
    "sentence": "La demanda judicial ante el Tribunal Federal del Distrito Este de Louisiana la encabeza el fiscal general de ese estado, Jeff Landry, y la acompañan sus pares de Arizona, <span class='selected-term'>Mark Brnovich</span>, y de Missouri, Eric Schmitt.",
    "author": "",
    "title": "Arizona demanda al gobierno de Biden para frenar la suspensión del Título 42"
  },
  {
    "id": 7582,
    "mediaId": 2509,
    "date": "2022-04-05",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "JACQUES BILLEAUD Associated Press",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 7699,
    "mediaId": 2801,
    "date": "2022-04-05",
    "sentence": "",
    "author": "ACACIA CORONADO and PAUL J. WEBER",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 7857,
    "mediaId": 2679,
    "date": "2022-04-05",
    "sentence": "“I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "JACQUES BILLEAUD",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 8742,
    "mediaId": 8347,
    "date": "2022-04-05",
    "sentence": "TUCSON, Ariz. (KGUN) — Attorney General (AG) <span class='selected-term'>Mark Brnovich</span> has announced the first execution warrant issued across Arizona in eight years.",
    "author": "Caleb J. Fernández",
    "title": "AG Brnovich announces first execution warrant issued across Arizona in eight years"
  },
  {
    "id": 7205,
    "mediaId": 2822,
    "date": "2022-04-05",
    "sentence": "",
    "author": "",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 7217,
    "mediaId": 2520,
    "date": "2022-04-05",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,\" Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "Jimmy Jenkins",
    "title": "Arizona Supreme Court issues execution warrant for death row prisoner Clarence Dixon"
  },
  {
    "id": 7542,
    "mediaId": 2728,
    "date": "2022-04-05",
    "sentence": "“I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "Jacques Billeaud",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 7331,
    "mediaId": 2822,
    "date": "2022-04-05",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "JACQUES BILLEAUD - Associated Press",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 7369,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "ACACIA CORONADO and PAUL J. WEBER",
    "title": "Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 7450,
    "mediaId": 2518,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "The Associated Press",
    "title": "Ex-Trump officials urge Texas to declare border ‘invasion’"
  },
  {
    "id": 7580,
    "mediaId": 2520,
    "date": "2022-04-06",
    "sentence": "Shortly after the 2020 presidential election Attorney General <span class='selected-term'>Mark Brnovich</span> appeared on Fox Business, where he was asked about unsubstantiated claims of election fraud in Arizona.",
    "author": "EJ Montini",
    "title": "Arizona Attorney General Mark Brnovich's election fraud investigation turns up bupkis"
  },
  {
    "id": 7474,
    "mediaId": 2514,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "",
    "title": "Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 7473,
    "mediaId": 2509,
    "date": "2022-04-06",
    "sentence": "",
    "author": "ACACIA CORONADO and PAUL J. WEBER Associated Press",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 7277,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "Via AP news wire",
    "title": "Arizona schedules its first execution in nearly eight years for 11 May"
  },
  {
    "id": 7273,
    "mediaId": 2525,
    "date": "2022-04-06",
    "sentence": "",
    "author": "Associated Press",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 7310,
    "mediaId": 2590,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "ACACIA CORONADO and PAUL J. WEBER",
    "title": "Ex-Trump Officials Urge Texas To Declare Border 'Invasion'"
  },
  {
    "id": 7180,
    "mediaId": 6509,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "Paul J. Weber",
    "title": "Ex-Trump Officials Urge Texas to Declare Border ‘Invasion'"
  },
  {
    "id": 7091,
    "mediaId": 2573,
    "date": "2022-04-06",
    "sentence": "Arizona's AG <span class='selected-term'>Mark Brnovich</span> called the administration's decision to rescind Title 42: \"one of the most boneheaded decisions of this administration\" and pointed out the public safety concern of doing so:\n\"While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,\" Brnovich said in a statement.",
    "author": "Elizabeth Heckman",
    "title": "Rep. McCaul torches Biden admin over Title 42: 'I have never seen the border this bad'"
  },
  {
    "id": 8050,
    "mediaId": 8345,
    "date": "2022-04-06",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 8005,
    "mediaId": 8326,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>’s probe of Maricopa County’s 2020 election thus far has found “serious vulnerabilities” in procedures but no crimes, according to an initial report released Wednesday on the monthslong investigation.",
    "author": "Mary Jo Pitzl",
    "title": "Attorney general's report on election in Maricopa County questions procedures, doesn't allege wrongdoing"
  },
  {
    "id": 7768,
    "mediaId": 2751,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "",
    "title": "'Unprecedented action': Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 7736,
    "mediaId": 2560,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "Acacia Coronado and Paul J. Weber",
    "title": "Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 7063,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Mr Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "Via AP news wire",
    "title": "Ex-Trump officials pressure Texas Governor Greg Abbott to declare ‘invasion’ along Mexico border"
  },
  {
    "id": 7801,
    "mediaId": 2520,
    "date": "2022-04-07",
    "sentence": "When the Arizona Supreme Court issued the warrant of execution for Dixon, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> issued a statement reading in part, “I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment.”\nActually, we know that is not true.",
    "author": "EJ Montini",
    "title": "Executing mentally ill Arizona death row inmate Clarence Dixon is, itself, insane"
  },
  {
    "id": 7618,
    "mediaId": 2627,
    "date": "2022-04-07",
    "sentence": "“The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump added.",
    "author": "Steve Benen",
    "title": "Arizona AG fails to produce the election evidence Trump demanded"
  },
  {
    "id": 7804,
    "mediaId": 2591,
    "date": "2022-04-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> released a report citing “serious vulnerabilities that must be addressed and raise questions about the 2020 election in Arizona.”\nIndeed, the report issued to the state Senate highlighted controversial management of the election in Maricopa County.",
    "author": "Human Events Staff",
    "title": "Arizona AG: ‘Serious Vulnerabilities’ in Maricopa County ‘Raise Questions’ About 2020 Election"
  },
  {
    "id": 7962,
    "mediaId": 2681,
    "date": "2022-04-08",
    "sentence": "“All branches of government in this state must come together to provide full assurance of the integrity of our elections and answer every outstanding question,” said a report from Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "",
    "title": "2020 ‘election fraud’ in Arizona ‘raises questions,’ AG reports"
  },
  {
    "id": 5943,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "The Arizona Democratic Party on Monday asked Attorney General <span class='selected-term'>Mark Brnovich</span> to investigate how commissioners decided to move Rogers and two other Republican state legislators – Sens.",
    "author": "Laurie Roberts",
    "title": "Did Arizona illegally redraw voting districts just to help Sen. Wendy Rogers?"
  },
  {
    "id": 5831,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "opinion contributor\nEarlier this month, Arizona Republic columnist Bob Robb argued that GOP Attorney General <span class='selected-term'>Mark Brnovich</span> is failing to fulfill his basic duties by refusing to defend Arizona’s mail-in voting system and is using the AG’s Office to advance his own political ambitions.",
    "author": "Kris Mayes",
    "title": "Mark Brnovich refused to defend election law, but that's not his only sin"
  },
  {
    "id": 5403,
    "mediaId": 2641,
    "date": "2022-04-11",
    "sentence": "\"As attorney general, I would deploy a mobile prosecution unit to arrest individuals under state criminal trespassing laws and similar to what [Attorney General] <span class='selected-term'>Mark Brnovich</span> has done in the state of Arizona; assert the state's sovereignty under the Constitution, where the federal government is compelled to defend the states.",
    "author": "Sandy Fitzgerald",
    "title": "George P. Bush to Newsmax: Abbott Right With Plan to Bus Immigrants"
  },
  {
    "id": 6912,
    "mediaId": 8416,
    "date": "2022-04-15",
    "sentence": "Brnovich leads coalition of 21 states\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> is leading a coalition of 21 states in filing a motion for a preliminary injunction against the federal government’s rescission of Title 42 in Arizona v. CDC.",
    "author": "Katie Conner",
    "title": "Attorney General Mark Brnovich Expands Lawsuit Against President Biden Over Rescinding Title 42"
  },
  {
    "id": 5993,
    "mediaId": 2664,
    "date": "2022-04-18",
    "sentence": "\"The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump ranted in the 2021 statement.",
    "author": "Sarah K. Burris",
    "title": "Trump posts angry anti-endorsement for Arizona AG who refused to help change election results"
  },
  {
    "id": 5353,
    "mediaId": 2557,
    "date": "2022-04-19",
    "sentence": "https://t.co/Pgogo9A7uO\n— <span class='selected-term'>Mark Brnovich</span> (@GeneralBrnovich) April 6, 2022\nBelow is Trump’s statement as he responded to the report:\nAttorney General Brnovich of Arizona was given massive information on the fraud and so-called ‘irregularities’ that took place in the 2020 Presidential Election.",
    "author": "DML News App",
    "title": "NEWS ALERT: AZ AG admits issues with 2020 election, Trump unleashes on him in scorching rebuke"
  },
  {
    "id": 5024,
    "mediaId": 8408,
    "date": "2022-04-19",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has tried for a year to issue a death warrant in his case.",
    "author": "Katya Schwenk",
    "title": "Law Enforcement \"Isn't a Profession,\" Judge Rules In Challenge To Arizona's Clemency Board"
  },
  {
    "id": 5541,
    "mediaId": 2550,
    "date": "2022-04-21",
    "sentence": "State Attorney General <span class='selected-term'>Mark Brnovich</span> is perhaps the best known of the contenders for the Republican nomination, but Trump is passing him over as insufficiently nutty and disloyal.",
    "author": "",
    "title": "How Putting Voting Rights on the Arizona Ballot Will Help Keep Control of the U.S. House and Senate"
  },
  {
    "id": 4860,
    "mediaId": 2790,
    "date": "2022-04-24",
    "sentence": "The Arizona Supreme Court issued Dixon's execution warrant earlier this month at the request of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Dustin Jones",
    "title": "In rejecting death row inmate's case, judge says law enforcement isn't a 'profession'"
  }
]