[
  {
    "id": 2442,
    "mediaId": 124,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "\"I am personally very terrified of what they're doing in Wisconsin, the national implications and the guardrails that might be out,\" said Irene Lin, the campaign manager for <span class='selected-term'>Tom Nelson</span>, who is running in the Democratic primary for the Senate.",
    "author": "",
    "title": "Biden gives Democrats the anti-Trump speech they've been waiting for"
  },
  {
    "id": 2436,
    "mediaId": 21,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "Mandela Barnes  who is seen as the frontrunner in the race  along with state Treasurer Sarah Godlewski, Outagamie County Executive <span class='selected-term'>Tom Nelson</span>, and businessman Alex Lasry.",
    "author": "John L. Dorman",
    "title": "GOP Sen. Ron Johnson of Wisconsin, a top foil for Democrats who pledged to only serve for two terms, poised to run for reelection to a third: sources"
  },
  {
    "id": 2392,
    "mediaId": 21,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Out in Outagamie County, Wisconsin, two flights and a lengthy Lyft ride from Capitol Hill, US Senate candidate <span class='selected-term'>Tom Nelson</span> follows events in Washington with disbelief as leaders of his own Democratic Party resist banning members of Congress from buying and selling stock.",
    "author": "Dave Levinthal",
    "title": "Democratic candidates blast Biden and Pelosi for not pushing Congress to pass a stock trade ban for lawmakers: 'Get in the ring!'"
  },
  {
    "id": 2384,
    "mediaId": 124,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, who is running for Senate there, said he was thrilled to see President Biden making good on his promise to create a court system that looks and lives more like America.? One of his primary rivals, Outagamie County Executive <span class='selected-term'>Tom Nelson</span>, noted that Jackson would be the first justice since the famed Thurgood Marshall to have significant experience as a public defender,? bringing a perspective to the bench that has been absent for decades.?\nAs progressives celebrated, top Republicans cast Jackson as too ideological for a lifetime appointment to the high court.",
    "author": "",
    "title": "Biden's Supreme Court pick thrills progressives looking for a win"
  },
  {
    "id": 2358,
    "mediaId": 43,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "Click below to donate and get involved with these incumbents re-election campaigns and to these Democratic Senate candidates:\nMark Kelly (D. AZ)\nRaphael Warnock (D. GA)\nCatherine Cortez Masto (D. NV)\nMaggie Hassan (D. NH)\nPennsylvania\nJohn Fetterman\nConor Lamb\nMalcom Kenyatta\nWisconsin\nMandela Barnes for U.S. Senate\nSarah Godlewski for U.S. Senate\n<span class='selected-term'>Tom Nelson</span> for U.S. Senate\nAlex Lasry for U.S. Senate\nOhio\nTim Ryan\nNorth Carolina\nCheri Beasley\nFlorida\nVal Demings\nMissouri\nLucas Kunce\nScott Sifton",
    "author": "",
    "title": "Chuck Schumer (D) Gets The Senate Ready To Grill Gas & Oil CEOs On Price Gouging"
  },
  {
    "id": 2349,
    "mediaId": 367,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "In many ways, Barnes, Milwaukee Bucks executive Alex Lasry, Outagamie County Executive <span class='selected-term'>Tom Nelson</span> and state Treasurer Sarah Godlewski are following the political path Baldwin blazed.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate contenders in Wisconsin focus on manufacturing"
  },
  {
    "id": 2347,
    "mediaId": 43,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "Or click below to donate and get involved with the Senate Democrat of your choice and these Wisconsin Democrats campaigns:\nWisconsin Democratic Party\nMinocqua Brewing Company SuperPAC\nTony Evers for Governor\nMandela Barnes for U.S. Senate\nSarah Godlewski for U.S. Senate\n<span class='selected-term'>Tom Nelson</span> for U.S. Senate\nAlex Lasry for U.S. Senate\nJosh Kaul for Attorney General",
    "author": "",
    "title": "Rep. Adam Schiff (D. CA) Helps Wisconsin Democrats Take Down Putin's Favorite Senator"
  },
  {
    "id": 1045,
    "mediaId": 43,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "Mandela Barnes' new internal from Impact Research (formerly known as Anzalone Liszt Grove or ALG) gives him a 38-17 lead over Milwaukee Bucks executive Alex Lasry in the August Democratic primary, with state Treasurer Sarah Godlewski and Outagamie County Executive <span class='selected-term'>Tom Nelson</span> at 9% and 8%, respectively.",
    "author": "",
    "title": "Morning Digest: Tennessee GOP's bill would block Trump's pick, but they'll need courts to agree"
  },
  {
    "id": 2337,
    "mediaId": 367,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "In both public and private polling, Barnes, the state's lieutenant governor, has a lead over three main rivals, Milwaukee Bucks executive Alex Lasry, state Treasurer Sarah Godlewski and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate candidate Mandela Barnes opposes Biden administration's plan to lift Title 42 rule at the border"
  },
  {
    "id": 2326,
    "mediaId": 367,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "In the Democratic primary, Outagamie County Executive <span class='selected-term'>Tom Nelson</span>'s campaign said it raised $220,000 in the first quarter and had $550,000 cash on hand at the end of March.",
    "author": "Bill Glauber",
    "title": "Republican U.S. Sen. Ron Johnson raised $7.1 million in campaign cash during the first three months of 2022"
  },
  {
    "id": 2312,
    "mediaId": 151,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Rep. Val Demings of Florida, who is challenging Sen. Marco Rubio (R-Fla.), seemed to defend the Biden administration's move earlier this month, but her campaign said on Monday that until there is a plan to put more boots on the ground and support our law enforcement officers at the border, Chief Demings does not support lifting Title 42.?\nThat leaves <span class='selected-term'>Tom Nelson</span> of Wisconsin as an outlier.",
    "author": "",
    "title": "More Dem Senate hopefuls split with Biden on border"
  },
  {
    "id": 2309,
    "mediaId": 238,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "); Milwaukee Bucks executive Alex Lasry; state Treasurer Sarah Godlewski and a county executive, <span class='selected-term'>Tom Nelson</span>.",
    "author": "",
    "title": "The most interesting Democratic primaries of 2022"
  },
  {
    "id": 2302,
    "mediaId": 238,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "State treasurer Sarah Godlewski has more than doubled her share, now taking 7 percent, while populist <span class='selected-term'>Tom Nelson</span> holds steady at 5 percent.",
    "author": "",
    "title": "Opinion The Wisconsin GOP is stuck with Ron Johnson. Democrats could pick a winner."
  },
  {
    "id": 2298,
    "mediaId": 237,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Among the candidates are Mandela Barnes, the current lieutenant governor; Alex Lasry, son to a part-owner of the Milwaukee Bucks; Sarah Godlewski, current state treasurer; and <span class='selected-term'>Tom Nelson</span>, current Outagamie County executive.",
    "author": "Salena Zito",
    "title": "The tea leaves in Wisconsin look promising for Republicans"
  },
  {
    "id": 868,
    "mediaId": 129,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "They include Mandela Barnes, the lieutenant governor; Sarah Godlewski, the state treasurer; Alex Lasry, a vice president for the Milwaukee Bucks; and <span class='selected-term'>Tom Nelson</span>, the top elected official in Outagamie County.",
    "author": "",
    "title": "Ready for the Midterm Primary Elections? Here's What to Know."
  },
  {
    "id": 869,
    "mediaId": 129,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "They include Mandela Barnes, the lieutenant governor; Sarah Godlewski, the state treasurer; Alex Lasry, a vice president for the Milwaukee Bucks; and <span class='selected-term'>Tom Nelson</span>, the top elected official in Outagamie County.",
    "author": "",
    "title": "Ready for the Midterm Primary Elections? Here's What to Know."
  },
  {
    "id": 2294,
    "mediaId": 43,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "Click below to donate and get involved with the Wisconsin Democrat of your choice and these Wisconsin Democrats campaigns:\nWisconsin Democratic Party\nMinocqua Brewing Company SuperPAC\nTony Evers for Governor\nMandela Barnes for U.S. Senate\nSarah Godlewski for U.S. Senate\n<span class='selected-term'>Tom Nelson</span> for U.S. Senate\nAlex Lasry for U.S. Senate\nJosh Kaul for Attorney General",
    "author": "",
    "title": "Now Says That COVID Vaccines Could Cause AIDS"
  }
]