[
  {
    "id": 2409,
    "mediaId": 178,
    "date": "d2022-01-19T00:00",
    "sentence": "Mandela Barnes, state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Associated Press",
    "title": "Democratic Senate candidate files election lawsuits",
    "sentiment": "0.0"
  },
  {
    "id": 2386,
    "mediaId": 367,
    "date": "d2022-02-23T00:00",
    "sentence": "Mandela Barnes, state Treasurer Sarah Godlewski, Outagamie County Executive <span class='selected-term'>Tom Nelson</span> and Alex Lasry, on leave from his executive job with the Milwaukee Bucks.",
    "author": "Bill Glauber",
    "title": "Gillian Battino expected to leave Democratic U.S. Senate race and announce run for state treasurer",
    "sentiment": "0"
  },
  {
    "id": 2385,
    "mediaId": 367,
    "date": "d2022-02-24T00:00",
    "sentence": "But this week, Outagamie County Executive <span class='selected-term'>Tom Nelson</span> turned his sights on the perceived Democratic front runner, Lt. Gov.",
    "author": "Bill Glauber",
    "title": "'Voters don't know where he's at': Tom Nelson turns sights on Democratic rival Mandela Barnes in U.S. Senate race",
    "sentiment": "-0.889"
  },
  {
    "id": 2332,
    "mediaId": 238,
    "date": "d2022-04-13T11:45",
    "sentence": "Meanwhile, <span class='selected-term'>Tom Nelson</span>, the county executive for rural Outagamie County and former state assemblyman, has been called a scrappy? underdog.",
    "author": "",
    "title": "Opinion: Democrats must make a strategic choice in Wisconsin's Senate race",
    "sentiment": "0.275"
  },
  {
    "id": 2301,
    "mediaId": 367,
    "date": "d2022-04-29T00:00",
    "sentence": "April 28: <span class='selected-term'>Tom Nelson</span> claims endorsement from Bernie Sanders-linked Our Wisconsin Revolution\nOutagamie County Executive Tom Nelson gained an endorsement Thursday from a key liberal group, the Bernie Sanders-inspired Our Wisconsin Revolution.",
    "author": "Bill Glauber",
    "title": "Wisconsin U.S. Senate election updates: Tom Nelson claims endorsement from Bernie Sanders-linked Our Wisconsin Revolution",
    "sentiment": "0.663"
  }
]