[
  {
    "id": 2446,
    "mediaId": 367,
    "date": "2022-00-05",
    "sentence": "State treasurer Sarah Godlewski and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>, both running for U.S. Senate, attacked Republican U.S. Sen. Ron Johnson, who has downplayed the attack.",
    "author": "Bill Glauber",
    "title": "Sarah Godlewski, Tom Nelson use Jan. 6 anniversary to criticize Ron Johnson, who has minimized the insurrection",
    "sentiment": "-0.896"
  },
  {
    "id": 2436,
    "mediaId": 21,
    "date": "2022-00-08",
    "sentence": "Mandela Barnes  who is seen as the frontrunner in the race  along with state Treasurer Sarah Godlewski, Outagamie County Executive <span class='selected-term'>Tom Nelson</span>, and businessman Alex Lasry.",
    "author": "John L. Dorman",
    "title": "GOP Sen. Ron Johnson of Wisconsin, a top foil for Democrats who pledged to only serve for two terms, poised to run for reelection to a third: sources",
    "sentiment": "0"
  },
  {
    "id": 2371,
    "mediaId": 195,
    "date": "2022-00-09",
    "sentence": "Mandela Barnes (D) leading that primary field with 23 percent support, while Milwaukee Bucks executive Alex Lasry trailed at 13 percent support and Outagamie County Executive <span class='selected-term'>Tom Nelson</span> garnered five percent support.",
    "author": "Julia Manchester",
    "title": "Johnson touts work with Milwaukee faith initiative in new ads",
    "sentiment": "0.0"
  },
  {
    "id": 2426,
    "mediaId": 195,
    "date": "2022-00-09",
    "sentence": "Mandela Barnes, state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Tal Axelrod",
    "title": "Ron Johnson announces run for third Senate term in Wisconsin",
    "sentiment": "0"
  },
  {
    "id": 2435,
    "mediaId": 178,
    "date": "2022-00-09",
    "sentence": "Mandela Barnes, who is seeking to become the state's first Black senator; Milwaukee Bucks executive Alex Lasry; state Treasurer Sarah Godlewski and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "SCOTT BAUER",
    "title": "Wisconsin Republican Sen. Ron Johnson will seek reelection",
    "sentiment": "0"
  },
  {
    "id": 2414,
    "mediaId": 424,
    "date": "2022-00-12",
    "sentence": "He's not a fiscal conservative, he's a corrupt errand boy for the ultra rich,? says Outagamie County Executive <span class='selected-term'>Tom Nelson</span>, a Democrat who is running against Johnson.",
    "author": "John Nichols",
    "title": "Ron Johnson Breaks His Term-Limit Pledge in Order to Keep Serving the Billionaire Class",
    "sentiment": "0.0"
  },
  {
    "id": 2332,
    "mediaId": 238,
    "date": "2022-00-13",
    "sentence": "Meanwhile, <span class='selected-term'>Tom Nelson</span>, the county executive for rural Outagamie County and former state assemblyman, has been called a scrappy? underdog.",
    "author": "",
    "title": "Opinion: Democrats must make a strategic choice in Wisconsin's Senate race",
    "sentiment": "0.275"
  },
  {
    "id": 2335,
    "mediaId": 367,
    "date": "2022-00-13",
    "sentence": "Outagamie Executive <span class='selected-term'>Tom Nelson</span> has traveled to the state's 72 counties and emphasized rural issues.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate contender Alex Lasry vows to 'bring more jobs and investment back to rural Wisconsin'",
    "sentiment": "0"
  },
  {
    "id": 2368,
    "mediaId": 367,
    "date": "2022-00-14",
    "sentence": "Outagamie County Executive <span class='selected-term'>Tom Nelson</span> registered 5% support in the poll, with Godlewski at 3%.",
    "author": "Bill Glauber",
    "title": "Democrat Sarah Godlewski releases her first TV ad in her bid for U.S. Senate, takes swipe at Republican Ron Johnson",
    "sentiment": "0.0"
  },
  {
    "id": 2361,
    "mediaId": 195,
    "date": "2022-00-15",
    "sentence": "Mandela Barnes (D) leading that primary field with 23 percent support, with Milwaukee Bucks executive Alex Lasry trailing at 13 percent support, Outagamie County Executive <span class='selected-term'>Tom Nelson</span> garnering five percent support and State Treasurer Sarah Godlewski three percent.",
    "author": "Julia Manchester",
    "title": "Democratic group runs ad hitting Ron Johnson over Trump 2017 tax bill",
    "sentiment": "0.0"
  },
  {
    "id": 2316,
    "mediaId": 238,
    "date": "2022-00-17",
    "sentence": "",
    "author": "",
    "title": "Opinion: Wisconsin's Tom Nelson reminds Democrats how populists should sound",
    "sentiment": "0.255"
  },
  {
    "id": 2357,
    "mediaId": 367,
    "date": "2022-00-17",
    "sentence": "Among the others in the large Senate primary are state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Patrick Marley",
    "title": "Gov. Tony Evers isn't endorsing any candidates in the Democratic primary for U.S. Senate",
    "sentiment": "0.0"
  },
  {
    "id": 2408,
    "mediaId": 195,
    "date": "2022-00-19",
    "sentence": "Barnes is a part of a crowded Democratic Senate primary that includes state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Julia Manchester",
    "title": "Barnes raises over $1 million in final quarter of 2021",
    "sentiment": "0"
  },
  {
    "id": 2409,
    "mediaId": 178,
    "date": "2022-00-19",
    "sentence": "Mandela Barnes, state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Associated Press",
    "title": "Democratic Senate candidate files election lawsuits",
    "sentiment": "0.0"
  },
  {
    "id": 2310,
    "mediaId": 367,
    "date": "2022-00-21",
    "sentence": "Mandela Barnes, the front runner, Milwaukee Bucks executive Alex Lasry, state Treasurer Sarah Godlewski and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate candidate Steven Olikara unveils 'agenda to make government work'",
    "sentiment": "0"
  },
  {
    "id": 2349,
    "mediaId": 367,
    "date": "2022-00-24",
    "sentence": "In many ways, Barnes, Milwaukee Bucks executive Alex Lasry, Outagamie County Executive <span class='selected-term'>Tom Nelson</span> and state Treasurer Sarah Godlewski are following the political path Baldwin blazed.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate contenders in Wisconsin focus on manufacturing",
    "sentiment": "0.465"
  },
  {
    "id": 2385,
    "mediaId": 367,
    "date": "2022-00-24",
    "sentence": "But this week, Outagamie County Executive <span class='selected-term'>Tom Nelson</span> turned his sights on the perceived Democratic front runner, Lt. Gov.",
    "author": "Bill Glauber",
    "title": "'Voters don't know where he's at': Tom Nelson turns sights on Democratic rival Mandela Barnes in U.S. Senate race",
    "sentiment": "-0.889"
  },
  {
    "id": 2304,
    "mediaId": 195,
    "date": "2022-00-27",
    "sentence": "State Treasurer Sarah Godlewski falls in third with 7 percent, and Outagamie County Executive <span class='selected-term'>Tom Nelson</span> rounds out the top four with 5 percent.",
    "author": "Tal Axelrod",
    "title": "Democratic Senate primary tightening in Wisconsin: poll",
    "sentiment": "0"
  },
  {
    "id": 2301,
    "mediaId": 367,
    "date": "2022-00-29",
    "sentence": "April 28: <span class='selected-term'>Tom Nelson</span> claims endorsement from Bernie Sanders-linked Our Wisconsin Revolution\nOutagamie County Executive Tom Nelson gained an endorsement Thursday from a key liberal group, the Bernie Sanders-inspired Our Wisconsin Revolution.",
    "author": "Bill Glauber",
    "title": "Wisconsin U.S. Senate election updates: Tom Nelson claims endorsement from Bernie Sanders-linked Our Wisconsin Revolution",
    "sentiment": "0.663"
  },
  {
    "id": 2346,
    "mediaId": 21,
    "date": "2022-00-29",
    "sentence": "His nearest rival was Milwaukee Bucks executive-on-leave Alex Lasry, who received 17% of the vote among primary voters, followed by state Treasurer Sarah Godlewski at 9% and Outagamie County Executive <span class='selected-term'>Tom Nelson</span> at 8%.",
    "author": "John L. Dorman",
    "title": "Wisconsin Lt. Gov. Mandela Barnes has early lead in Democratic Senate primary: poll",
    "sentiment": "0"
  }
]