[
  {
    "id": 2443,
    "mediaId": 65,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, state Treasurer Sarah Godlewski, and Outagamie County Executive <span class='selected-term'>Tom Nelson</span> also have highlighted their push to scrap the filibuster.",
    "author": "Paul Steinhauser",
    "title": "Democratic Senate candidates put changing the filibuster front and center"
  },
  {
    "id": 2445,
    "mediaId": 178,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Other Democrats running for Senate include state Treasurer Sarah Godlewski; Outagamie County Executive <span class='selected-term'>Tom Nelson</span>; Millennial Action Project founder Steven Olikara; and Wausau physician Gillian Battino.",
    "author": "SCOTT BAUER",
    "title": "Democratic Senate candidate Lasry releases democracy plan"
  },
  {
    "id": 2440,
    "mediaId": 367,
    "date": "1/7/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, state Treasurer Sarah Godlewski, Outagamie County Executive <span class='selected-term'>Tom Nelson</span> and Alex Lasry, on leave from his executive job with the Milwaukee Bucks.",
    "author": "Bill Glauber",
    "title": "U.S. Sen. Ron Johnson poised to announce run for a third term as early as next week, according to sources"
  },
  {
    "id": 2422,
    "mediaId": 147,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, who is seeking to become the state's first Black senator; Milwaukee Bucks executive Alex Lasry; state Treasurer Sarah Godlewski and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Scott Bauer",
    "title": "Wisconsin Republican Sen. Ron Johnson will seek reelection"
  },
  {
    "id": 2426,
    "mediaId": 195,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Tal Axelrod",
    "title": "Ron Johnson announces run for third Senate term in Wisconsin"
  },
  {
    "id": 2420,
    "mediaId": 112,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, who is seeking to become the state's first Black senator; Milwaukee Bucks executive Alex Lasry; state Treasurer Sarah Godlewski and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Associated Press",
    "title": "Wisconsin Republican Ron Johnson to run for re-election to Senate, reversing self-imposed term-limit vow"
  },
  {
    "id": 2414,
    "mediaId": 424,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "He's not a fiscal conservative, he's a corrupt errand boy for the ultra rich,? says Outagamie County Executive <span class='selected-term'>Tom Nelson</span>, a Democrat who is running against Johnson.",
    "author": "John Nichols",
    "title": "Ron Johnson Breaks His Term-Limit Pledge in Order to Keep Serving the Billionaire Class"
  },
  {
    "id": 2412,
    "mediaId": 195,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Mandela Barnes (D) said in a statement that the only people celebrating the announcement were Johnson's \"donors and corporate special interests,\" while Outagamie County executive <span class='selected-term'>Tom Nelson</span> said in a statement Johnson has spent the last ten years \"catering to the ultra-wealthy millionaires and corporate interests.\"",
    "author": "Julia Manchester",
    "title": "Senate Democrats' super PAC releases $1 million ad buy against Ron Johnson"
  },
  {
    "id": 2408,
    "mediaId": 195,
    "date": "1/19/2022 12:00:00 AM",
    "sentence": "Barnes is a part of a crowded Democratic Senate primary that includes state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Julia Manchester",
    "title": "Barnes raises over $1 million in final quarter of 2021"
  },
  {
    "id": 2406,
    "mediaId": 124,
    "date": "1/20/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and <span class='selected-term'>Tom Nelson</span>, the Outagamie County executive.",
    "author": "",
    "title": "Republicans 'all in' for Ron Johnson's Senate re-election fight in Wisconsin"
  },
  {
    "id": 2397,
    "mediaId": 195,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, Outagamie County Executive <span class='selected-term'>Tom Nelson</span> and Milwaukee Bucks executive Alex Lasry have also supported scrapping the filibuster.",
    "author": "Alexander Bolton",
    "title": "Democrats say change to filibuster just a matter of time"
  },
  {
    "id": 2398,
    "mediaId": 178,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "Another Democratic candidate in the primary, Ozaukee County Executive <span class='selected-term'>Tom Nelson</span>, has also pitched himself to rural voters as a folksy populist.",
    "author": "SCOTT BAUER",
    "title": "US Senate candidate Godlewski unveils rural Wisconsin plan"
  },
  {
    "id": 2394,
    "mediaId": 367,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "Outagamie County Executive <span class='selected-term'>Tom Nelson</span> reported raising $215,522 in the fourth quarter and finished with $484,372 cash on hand.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate candidate Alex Lasry pours in $1.55 million more into race, while Sarah Godlewski adds $750,000"
  },
  {
    "id": 2392,
    "mediaId": 21,
    "date": "2/4/2022 12:00:00 AM",
    "sentence": "Out in Outagamie County, Wisconsin, two flights and a lengthy Lyft ride from Capitol Hill, US Senate candidate <span class='selected-term'>Tom Nelson</span> follows events in Washington with disbelief as leaders of his own Democratic Party resist banning members of Congress from buying and selling stock.",
    "author": "Dave Levinthal",
    "title": "Democratic candidates blast Biden and Pelosi for not pushing Congress to pass a stock trade ban for lawmakers: 'Get in the ring!'"
  },
  {
    "id": 2361,
    "mediaId": 195,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Mandela Barnes (D) leading that primary field with 23 percent support, with Milwaukee Bucks executive Alex Lasry trailing at 13 percent support, Outagamie County Executive <span class='selected-term'>Tom Nelson</span> garnering five percent support and State Treasurer Sarah Godlewski three percent.",
    "author": "Julia Manchester",
    "title": "Democratic group runs ad hitting Ron Johnson over Trump 2017 tax bill"
  },
  {
    "id": 2357,
    "mediaId": 367,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "Among the others in the large Senate primary are state Treasurer Sarah Godlewski, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Patrick Marley",
    "title": "Gov. Tony Evers isn't endorsing any candidates in the Democratic primary for U.S. Senate"
  },
  {
    "id": 2358,
    "mediaId": 43,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "Click below to donate and get involved with these incumbents re-election campaigns and to these Democratic Senate candidates:\nMark Kelly (D. AZ)\nRaphael Warnock (D. GA)\nCatherine Cortez Masto (D. NV)\nMaggie Hassan (D. NH)\nPennsylvania\nJohn Fetterman\nConor Lamb\nMalcom Kenyatta\nWisconsin\nMandela Barnes for U.S. Senate\nSarah Godlewski for U.S. Senate\n<span class='selected-term'>Tom Nelson</span> for U.S. Senate\nAlex Lasry for U.S. Senate\nOhio\nTim Ryan\nNorth Carolina\nCheri Beasley\nFlorida\nVal Demings\nMissouri\nLucas Kunce\nScott Sifton",
    "author": "",
    "title": "Chuck Schumer (D) Gets The Senate Ready To Grill Gas & Oil CEOs On Price Gouging"
  },
  {
    "id": 2355,
    "mediaId": 195,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Former presidential candidate Marianne Williamson endorsed Outagamie County Executive <span class='selected-term'>Tom Nelson</span> in Wisconsin's Democratic Senate primary on Monday, calling Nelson \"the candidate with the truest progressive vision.\"",
    "author": "Julia Manchester",
    "title": "Marianne Williamson endorses Tom Nelson in Wisconsin Senate race"
  },
  {
    "id": 2349,
    "mediaId": 367,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "In many ways, Barnes, Milwaukee Bucks executive Alex Lasry, Outagamie County Executive <span class='selected-term'>Tom Nelson</span> and state Treasurer Sarah Godlewski are following the political path Baldwin blazed.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate contenders in Wisconsin focus on manufacturing"
  },
  {
    "id": 2347,
    "mediaId": 43,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "Or click below to donate and get involved with the Senate Democrat of your choice and these Wisconsin Democrats campaigns:\nWisconsin Democratic Party\nMinocqua Brewing Company SuperPAC\nTony Evers for Governor\nMandela Barnes for U.S. Senate\nSarah Godlewski for U.S. Senate\n<span class='selected-term'>Tom Nelson</span> for U.S. Senate\nAlex Lasry for U.S. Senate\nJosh Kaul for Attorney General",
    "author": "",
    "title": "Rep. Adam Schiff (D. CA) Helps Wisconsin Democrats Take Down Putin's Favorite Senator"
  },
  {
    "id": 2346,
    "mediaId": 21,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "His nearest rival was Milwaukee Bucks executive-on-leave Alex Lasry, who received 17% of the vote among primary voters, followed by state Treasurer Sarah Godlewski at 9% and Outagamie County Executive <span class='selected-term'>Tom Nelson</span> at 8%.",
    "author": "John L. Dorman",
    "title": "Wisconsin Lt. Gov. Mandela Barnes has early lead in Democratic Senate primary: poll"
  },
  {
    "id": 2342,
    "mediaId": 43,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "The other three are Sarah Godlewski, who is the state treasurer, Alex Lasry, who is an executive with the Milwaukee Bucks NBA team and <span class='selected-term'>Tom Nelson</span>, who is a county executive from the Northeastern part of this state.",
    "author": "",
    "title": "The Downballot: We open our mailbag and answer your questions! (transcript)"
  },
  {
    "id": 2340,
    "mediaId": 195,
    "date": "4/4/2022 12:00:00 AM",
    "sentence": "Outagamie County Executive <span class='selected-term'>Tom Nelson</span> has said China is eating our lunch,? when it comes to trade, while Milwaukee Bucks basketball team executive Alex Lasry vowed to stand up to China? in a TV ad.",
    "author": "Julia Manchester",
    "title": "Midwest Democrats go all in on tough-on-China approach"
  },
  {
    "id": 2337,
    "mediaId": 367,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "In both public and private polling, Barnes, the state's lieutenant governor, has a lead over three main rivals, Milwaukee Bucks executive Alex Lasry, state Treasurer Sarah Godlewski and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate candidate Mandela Barnes opposes Biden administration's plan to lift Title 42 rule at the border"
  },
  {
    "id": 2332,
    "mediaId": 238,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "Meanwhile, <span class='selected-term'>Tom Nelson</span>, the county executive for rural Outagamie County and former state assemblyman, has been called a scrappy? underdog.",
    "author": "",
    "title": "Opinion: Democrats must make a strategic choice in Wisconsin's Senate race"
  },
  {
    "id": 2335,
    "mediaId": 367,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "Outagamie Executive <span class='selected-term'>Tom Nelson</span> has traveled to the state's 72 counties and emphasized rural issues.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate contender Alex Lasry vows to 'bring more jobs and investment back to rural Wisconsin'"
  },
  {
    "id": 2321,
    "mediaId": 195,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Outagamie County Executive <span class='selected-term'>Tom Nelson</span> trailed at 5 percent, and Godlewski came in at 3 percent support.",
    "author": "Julia Manchester",
    "title": "Johnson raises $7.1 million in first quarter"
  },
  {
    "id": 2326,
    "mediaId": 367,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "In the Democratic primary, Outagamie County Executive <span class='selected-term'>Tom Nelson</span>'s campaign said it raised $220,000 in the first quarter and had $550,000 cash on hand at the end of March.",
    "author": "Bill Glauber",
    "title": "Republican U.S. Sen. Ron Johnson raised $7.1 million in campaign cash during the first three months of 2022"
  },
  {
    "id": 2316,
    "mediaId": 238,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion: Wisconsin's Tom Nelson reminds Democrats how populists should sound"
  },
  {
    "id": 2312,
    "mediaId": 151,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Rep. Val Demings of Florida, who is challenging Sen. Marco Rubio (R-Fla.), seemed to defend the Biden administration's move earlier this month, but her campaign said on Monday that until there is a plan to put more boots on the ground and support our law enforcement officers at the border, Chief Demings does not support lifting Title 42.?\nThat leaves <span class='selected-term'>Tom Nelson</span> of Wisconsin as an outlier.",
    "author": "",
    "title": "More Dem Senate hopefuls split with Biden on border"
  },
  {
    "id": 2310,
    "mediaId": 367,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, the front runner, Milwaukee Bucks executive Alex Lasry, state Treasurer Sarah Godlewski and Outagamie County Executive <span class='selected-term'>Tom Nelson</span>.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate candidate Steven Olikara unveils 'agenda to make government work'"
  },
  {
    "id": 2304,
    "mediaId": 195,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "State Treasurer Sarah Godlewski falls in third with 7 percent, and Outagamie County Executive <span class='selected-term'>Tom Nelson</span> rounds out the top four with 5 percent.",
    "author": "Tal Axelrod",
    "title": "Democratic Senate primary tightening in Wisconsin: poll"
  },
  {
    "id": 2306,
    "mediaId": 367,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Mandela Barnes was the choice of 19% while Milwaukee Bucks executive Alex Lasry was at 16%, with state Treasurer Sarah Godlewski at 7% and Outagamie County Executive <span class='selected-term'>Tom Nelson</span> at 5%.",
    "author": "Bill Glauber",
    "title": "Marquette Poll shows Mandela Barnes, Alex Lasry in tight Democratic U.S. Senate race in Wisconsin"
  },
  {
    "id": 2302,
    "mediaId": 238,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "State treasurer Sarah Godlewski has more than doubled her share, now taking 7 percent, while populist <span class='selected-term'>Tom Nelson</span> holds steady at 5 percent.",
    "author": "",
    "title": "Opinion The Wisconsin GOP is stuck with Ron Johnson. Democrats could pick a winner."
  },
  {
    "id": 2303,
    "mediaId": 151,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "| Scott Olson/Getty Images\nBy Holly Otterbein\n 04/28/2022 04:30 AM EDT\nA Bernie Sanders-aligned group is throwing its weight behind underdog <span class='selected-term'>Tom Nelson</span> in Wisconsin's closely watched Democratic Senate primary.",
    "author": "",
    "title": "Pro-Bernie group endorses in key Dem Senate primary"
  },
  {
    "id": 2300,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Mandela Barnes (D), state Treasurer Sarah Godlewski (D), Milwaukee Bucks vice president Alex Lasry (D), Outagamie County Executive <span class='selected-term'>Tom Nelson</span> (D) and nonprofit executive Steven Olikara (D), among others.",
    "author": "Reid Wilson",
    "title": "Democrats reserve $33 million in fall advertising in fight for Senate"
  },
  {
    "id": 2301,
    "mediaId": 367,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "April 28: <span class='selected-term'>Tom Nelson</span> claims endorsement from Bernie Sanders-linked Our Wisconsin Revolution\nOutagamie County Executive Tom Nelson gained an endorsement Thursday from a key liberal group, the Bernie Sanders-inspired Our Wisconsin Revolution.",
    "author": "Bill Glauber",
    "title": "Wisconsin U.S. Senate election updates: Tom Nelson claims endorsement from Bernie Sanders-linked Our Wisconsin Revolution"
  },
  {
    "id": 2298,
    "mediaId": 237,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Among the candidates are Mandela Barnes, the current lieutenant governor; Alex Lasry, son to a part-owner of the Milwaukee Bucks; Sarah Godlewski, current state treasurer; and <span class='selected-term'>Tom Nelson</span>, current Outagamie County executive.",
    "author": "Salena Zito",
    "title": "The tea leaves in Wisconsin look promising for Republicans"
  },
  {
    "id": 2293,
    "mediaId": 43,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "Click below to donate and get involved with these Democratic Senate candidates and incumbents campaigns:\nArizona\nMark Kelly\nGeorgia\nRaphael Warnock\nNevada\nCatherine Cortez Masto\nNew Hampshire\nMaggie Hassan\nPennsylvania:\nJohn Fetterman\nWisconsin:\nMandela Barnes\n<span class='selected-term'>Tom Nelson</span>\nAlex Lasry\nSarah Godlewski\nOhio:\nTim Ryan\nNorth Carolina:\nCheri Beasley\nFlorida:\nVal Demings\nMissouri:\nLucas Kunce",
    "author": "",
    "title": "Video Of A Rightfully Pissed Off Sen. Elizabeth Warren (D. MA) Hits 4.2 Million Views"
  }
]