{
  "id": 1156,
  "mediaId": 2572,
  "date": "2022-04-06",
  "headline": "Ohio GOP Senate showdown: Gibbons hits Mandel on China in ad that returns to root of combustible feud",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Josh-Mandel-CPAC-2022.jpg",
  "link": "https://www.foxnews.com/politics/josh-mandel-mike-gibbons-ohio-senate-soft-on-china",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    1804,
    4226,
    277,
    764,
    878,
    1171,
    5212,
    5240
  ],
  "sentences": [
    "CRUZ ENDORSES MANDEL IN OHIO'S CROWDED AND COMBUSTIBLE GOP SENATE PRIMARY\nFirst, while Mandel oversaw the State Treasury Asset Reserve of Ohio Fund while he was the treasurer, it owned shares in several large companies with Chinese \"business interests,\" according to the Gibbons campaign.",
    "In a new campaign ad, Ohio GOP Senate candidate Mike Gibbons accuses primary opponent and former state Treasurer Josh Mandel of being soft on China, circling back to the issue at the root of a combustible feud between the two.",
    "\"Every time Mike Gibbons is confronted with these facts, he says he wasn’t involved with selling an American company to Shanghai Shenda or investing in Chinese Petrol, yet he uses these profits to fund his campaign.",
    "MICHAEL FLYNN DEMANDS APOLOGY FROM GIBBONS OVER SPAT WITH MANDEL, AS FALLOUT FROM EXPLOSIVE DEBATE CONTINUES\nThe fallout from the fracas bled into a debate the following Monday and even after that.",
    "From Jillian Anderson\nThe new ad comes over two weeks after the feud began during a Fox 8 News Cleveland debate, with Mandel accusing Gibbons of \"making millions\" off stock in a Chinese company.",
    "\"Now, as he tries to buy a U.S. Senate seat, Mike Gibbons is lying about Josh Mandel because he wants to hide his own record shipping American companies and jobs to China and Mexico,\" she said.",
    "Second, the Gibbons ad points out to comments Mandel made when he was running for Senate in 2012, in which he opposed a bill that sought to impose tariffs if China manipulated its currency.",
    "That included $385,000 in shares of Toyota Motor Credit Corporation, a subsidiary of the Japan-based Toyota Motor Corporation, which was expanding significantly into China at the time.",
    "Now with his new ad, Gibbons is returning to the origin of the drama and reversing the accusation, saying Mandel has been weak on China while he knows how to take on the country.",
    "Ohioans don’t want a Senate seat purchased with Chinese Communist Party money, they want a true fighter in Josh Mandel who will go to Washington and put America first.\"",
    "\"Mike Gibbons has spent his entire career thinking about one thing: how to make millions for himself,\" said Mandel spokesperson Jillian Anderson.",
    "Mandel and his allies, including former Trump national security adviser Mike Flynn, accused Gibbons of disrespecting the military.",
    "The crowded Ohio GOP field will face off at the ballot box in less than a month when voters to go the polls on May 3.",
    "The Gibbons campaign expects to spend about $1 million on the 30-second spot as part of a broader $10 million ad buy.",
    "Mandel then got in Gibbons' face as the two continued to argue, before they were eventually separated by moderators.",
    "The fund also owned assets in J.P. Morgan, Credit Suisse, MetLife and Apple, according to the Gibbons campaign.",
    "Gibbons and even other candidates in the GOP primary slammed Mandel for his behavior on the debate stage.",
    "These companies are notably businesses that many Americans have assets in or interact with regularly.",
    "But the Gibbons campaign notes they all have various business ambitions or entanglements in China.",
    "Gibbons responded dismissively, accusing Mandel of not understanding how investments work.",
    "The winner of the primary will likely face Rep. Tim Ryan, D-Ohio, in the general election.",
    "\"Two tours in Iraq,\" Mandel shouted after rising from his seat and moving toward Gibbons.",
    "Like many entrepreneurs, Gibbons had to negotiate with dozens of Chinese businessmen.",
    "As Ohio Treasurer, Josh Mandel loaned your money to Chinese business interests.",
    "Gibbons' ad cites two instances in which Mandel was purportedly weak on China.",
    "Mandel said he preferred diplomacy, according to the Cleveland Plain Dealer.",
    "And Mandel opposed a bill holding China accountable,\" the ad says.",
    "\"You’ve never been in the private sector in your entire life.",
    "He'll do it from Washington,\" the ad says.",
    "\"Politician Josh Mandel is weak on China.",
    "Gibbons took on China in the boardroom.",
    "You don’t know squat,\" Gibbons charged.",
    "\"Don’t tell me I haven’t worked!\"",
    "But Mike Gibbons is Trump tough.",
    "\"He's been exposed."
  ]
}