{
  "id": 1967,
  "mediaId": 2564,
  "date": "2022-03-19",
  "headline": "Should've been boring but... Republican Ohio Senate hopefuls and millionaires Mike Gibbons and Josh Mandel nearly come to blows during primary debate about Chinese petroleum",
  "image": "https://i.dailymail.co.uk/1s/2022/03/19/13/55549393-0-image-a-4_1647696904256.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10630439/Ohio-Senate-hopefuls-Mike-Gibbons-Josh-Mandel-nearly-come-blows.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Drudge Report",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1804,
    767,
    878,
    1171,
    4910,
    5042,
    5212,
    5240
  ],
  "sentences": [
    "Scroll down for video\n+6\nView gallery\nSenate hopefuls Mike Gibbons, 69, (left, standing) and Josh Mandel, 44, (right) came toe-to-toe at the primary debate after Mandel attacked the father-of-five's financial assets in China, claiming he 'made millions' there\n+6\nView gallery\nMandel appeared irritated toward Gibbons - who's wealth ranges anywhere from $83milllion to $286million - said he didn't 'think I made millions off of anything'\nGibbons went on to say that former Marine 'didn't know squat' because he's never worked in private sector, to which Mandel replied that he had served two tours in Iraq and told the businessman: 'Don't tell me I haven't worked.'",
    "+6\nView gallery\nThe father-of-three told Gibbons' to 'back off' and when Gibbons told him he was messing with the 'wrong dude,' Mandel fired back that he wasn't\n+6\nView gallery\nGibbons has stock ties to Chinese petroleum companies and Mandel claimed Gibbons sold Ohio businesses to Chinese company Shanghai Shenda\n'I do,' Mandel fired back, as he stood up from his seat and squared himself up toe-to-toe with Gibbons.",
    "pic.twitter.com/hLJbcx4ace\n— Josh Mandel (@JoshMandelOhio) September 10, 2021\nDespite the need for financial transparency, Mandel - who is Jewish and a grandson of Holocaust survivors - has been vocal about wanting to 'shut down government schools and put schools in churches and synagogues' and that he regrets the separation of church and state.",
    "In September, standing in front of a Trump sign outside of a cornfield in Logansville, denounced President Joe Biden, 79, as the leader of the country, stating: 'Joe Biden - I'm not even going to call him president, he's not,' before pointing to the Trump sign and saying: 'He is my president.'",
    "Despite his multiple connections to Chinese companies, Gibbons said in May 2021 that he supported Trump because he was the 'first one with enough gumption to go out and say: \"We're gonna force you to play by the rules, and you're not going to keep draining us of our intellectual property.\"'",
    "But he certainly doesn't discriminate how one uses their money, as he also introduced OhioCrypto.com, making Ohio the first state to allow taxpayers to use cryptocurrency to pay taxes, the self-proclaimed 'Pro-God, Pro-Gun, Pro-Bitcoin' candidate said on his website.",
    "The Republican hopeful served two terms in the reserves in 2000 and served two tours in Anbar Province, Iraq, where he was awarded the Navy and Marine Corps Achievement Medal for his 'superior performance of his duties,' according to his website.",
    "But Mandel, former Ohio Treasurer who has disclosed assets of at least $2.2 million, wouldn't let the businessman and investment banker off so easily, firing back from his seat on the stage: 'But you made millions off it, sir.'",
    "Never one to shy away from controversy, Mandel's Twitter account was also suspended last year after he created a poll asking if 'Muslim terrorists' or 'Mexican gangbangers' would commit more crimes, The New York Times reported.",
    "Republican candidates Mike Gibbons, 69, a businessman, and Josh Mandel, 44, a veteran, both of Cleveland, got hot and bothered during Gibbons' talk where the younger man accused him of 'making millions' off Chinese petroleum.",
    "Mandel, who graduated first in boot camp and in his class in the Marine Corps Intelligence School, didn't take it lightly, pointing his finger in Gibbons face and saying: 'Two tours in Iraq, don't tell me I haven't worked.",
    "At one point someone had to tried to break the two men up as they argued about money and life experiences\nMandel immediately listed off two Chinese assets for Gibbons - Shanghai Shenda and Chinese petroleum.",
    "In a video posted to Twitter, the former Marine began attacking the businessman over his assets in China, stating: 'You filed that with the federal elections committee for stock in Chinese petro.'",
    "Two Ohio Senate hopefuls nearly came to blows Friday night during a crowded primary debate after getting into a heated argument over Chinese petroleum and whether or not they've 'worked.'",
    "Mandel, who threw his weight behind Donald Trump after his won the presidency, has far separated from his liberal Cleveland roots, according to The New York Times, and now friends said.",
    "Gibbons - who has assets anywhere from $83 million to $286 million, according to his Senate campaign's financial disclosure - retorted: 'I personally didn't buy the stock.'",
    "He went on two tours of Iraq and won the Navy and Marine Corps Achievement Medal for his 'superior performance of his duties' on both tours, according to his website.",
    "Matt Cox, a Republican lobbyist and former friend of Mandel, said the Cleveland-born hopeful is 'twisting himself into something he [not], just to win the election.'",
    "He also funded Trump's 2016 presidential campaign and proudly displayed on his website that he 'gave even more money to the Trump re-election campaign in 2020.'",
    "Mandel claimed Gibbons sold Ohio businesses - like Perfect Fit LLC, which makes and sells police accessories - to Shanghai Shenda, a textile company, in China.",
    "+6\nView gallery\nMandel (pictured in the military) holds the hand of a little girl in Iraq on one of his tours\nMandel's campaign has not released a statement.",
    "After the event, Gibbons' campaign issued a statement regarding the debacle, calling the 44-year-old 'unhinged, unfit, and flailing - because he's losing.'",
    "Gibbons brushed it off, turning back to the stage as if he was going to continue his speech, saying: 'I don't think I made millions off of anything.",
    "Senator and Ohio voters got a first-hand look at just how unprepared Josh Mandel has become and that will be reflected on the ballot on May 3.'",
    "Gibbons, on the other hand, has spent $12million already on his campaign in advertising alone, which is far more than the other candidates.",
    "Rob Zimmerman, a Democrat who spent hours fundraising with Mandel, said he wants to 'believe that this is a character he is playing.'",
    "Financial transparency appears to be important to Mandel, who introduced OhioCheckbook.com to the state during his time as treasurer.",
    "The father-of-five also has stock in Chinese petroleum companies, according to his Federal Trade Commission (FTC) portfolio.",
    "He has also said he is against the federal vaccine-or-test mandate and compared it to the Gestapo's actions toward the Jews.",
    "During their debate Friday, Gibbons goes for the blow, telling the Marine vet that he 'may not understand' private sector.",
    "The website - a 'first-of-its-kind' - allowed Ohioans to view $690 billion of state spending, according to his website.",
    "He also claimed he has 'already lived my American dream' and is only running to 'restore American values.'",
    "He said: 'You may not understand this, because you’ve never been in the private sector in your life.'",
    "Gibbons kept going, belittling the former Ohio House representative, saying: 'You don't know squat.'",
    "+6\nView gallery\nMandel was in the Marine Reserves and served two terms, starting in 2000.",
    "Gibbons fumbled for a comeback, before simply landing again on: 'You don't know squat.'",
    "The crowd even got involved, as a collective 'ohhh' rang out after the verbal blow.",
    "As someone tried to separate the two men, Mandel told Gibbons: 'You back off.'",
    "Gibbons replied: 'Watch, watch, you've squared it away with the wrong dude.'",
    "And you have to believe that, if you say it that often,' Cox told the Times.",
    "He doesn’t have the temperament, experience, or fortitude to be a U.S.",
    "DailyMail.com has attempted to contact Mandel and Gibbons for comment.",
    "'No, I'm not dealing with the wrong guy,' the father-of-three replied.",
    "When the gestapo show up at your front door, you know what to do.",
    "Mandel once again reminded him that he did two tours in Iraq.",
    "'He is only a professional at one thing: running for office.",
    "I'd loved to have made millions off of Chinese petro.'",
    "Ohioans will vote for the US Senate election on May 3.",
    "He claimed Trump was the 'first' to 'stand up.'",
    "'Telling obvious lies “is not part of the game.",
    "And said Mandel's change as 'broken my heart.'",
    "He is hellbent on lying because he is failing.",
    "'That's what happens, you watch what happens.'",
    "Don't tell me I haven't worked.'",
    "Do NOT comply with the tyranny.",
    "'I've worked, sir.'",
    "It’s intentional."
  ]
}