{
  "id": 2191,
  "mediaId": 2518,
  "date": "2022-03-21",
  "headline": "In the news",
  "image": "https://wehco.media.clients.ellingtoncms.com/static-4/ao_redesign/graphics/adgog.jpg",
  "link": "https://www.arkansasonline.com/news/2022/mar/21/in-the-news/",
  "mediaOutlet": "Arkansas Democrat-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Compiled Democrat-Gazette Staff From Wire Reports",
  "authorUrl": "https://www.arkansasonline.com/staff/compiled-democrat-gazette-staff-from-wire-reports/",
  "termIds": [
    0
  ],
  "sentences": [
    "• Jason Brown, 32, convicted in 2015 of torturing, killing and dismembering seven dogs, is eligible for parole years earlier than originally believed because his crimes involved dogs, not people, and \"animals are treated as personal property under Nevada law,\" Nevada Department of Corrections officials said.",
    "• Rorie Cartier, executive director at The Patriots Point Naval & Maritime Museum, said board members voted to dismantle a Cold War-era submarine at the Mount Pleasant, S.C., facility to end the \"never-ending battle against the corrosion that comes from being submerged in saltwater.\"",
    "• Elliott Sterling of Baton Rouge was convicted on 15 counts of wire fraud, financial aid fraud and money laundering for a two-year scheme in which he defrauded the federal student loan system of more than $1.4 million intended for 180 students using their personal information.",
    "• William Nichols, a 77-year-old retired pilot and licensed flight instructor, enrolled at Southern Regional Technical College in Bainbridge, Ga., to earn his commercial driver's license amid supply-chain struggles and a shortage of truck drivers in the United States.",
    "• Dhirendra Prasad, who worked for 10 years as a buyer in Apple's global supply-chain department, was charged with defrauding the tech giant out of more than $10 million by taking kickbacks, stealing equipment and laundering money, federal prosecutors said.",
    "• Shawn Guetschow, a police officer in Kenosha, Wis., resigned from his part-time security job after the local school district released footage showing him putting his knee on a 12-year-old girl's neck to restrain her during a lunchtime fight.",
    "• Rachel Brown, former associate dean for student programs at the University of Missouri School of Medicine, was awarded a $1.57 million settlement after her legal claim that she was fired from her post in favor of a younger employee.",
    "Gen. Ernest Litynski, who has received awards and decorations in nearly 30 years in the Army, now tells his mental health story in meetings with new Reserve troops to scrape away at the stigma with the armed services.",
    "• Josh Mandel, former Ohio state treasurer and U.S. Marine veteran, muttered \"Watch what happens.",
    "P****\" to another candidate during a debate between Republicans vying to succeed Sen.",
    "Rob Portman, who is retiring at the end of his current term.",
    "• Brig."
  ]
}