{
  "id": 3097,
  "mediaId": 2526,
  "date": "2022-03-07",
  "headline": "Exclusive— Josh Mandel: ‘Big Tech Oligarchs’ Like Mark Zuckerberg Must Be Criminally Investigated",
  "image": "https://media.breitbart.com/media/2022/03/july8-21-CEO-Facebook-Mark-Zuckerberg-Getty-640x335.jpg",
  "link": "https://www.breitbart.com/radio/2022/03/07/exclusive-josh-mandel-big-tech-oligarchs-zuckerberg-criminally-investigated/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Kraychik",
  "authorUrl": "https://www.breitbart.com/author/robert-kraychik/",
  "termIds": [
    1400,
    1414,
    1804,
    2979,
    151,
    364,
    434,
    5371
  ],
  "sentences": [
    "“For them, it’s just a cost of doing business, but you see what’s going on with Zuckerberg, right now — the fact that he might have tripped Wisconsin bribery laws with the 400-plus million that he spread around the country.”\nHe continued, “When they violate any criminal laws, they need to be investigated and prosecuted aggressively because that is, at the end of the day, the only thing that will make them wake up and make them listen and make them change their behavior.”\nThe U.S. must “take on these Big Tech oligarchs and thugs,” he added.",
    "pic.twitter.com/a335TivWh6\n— Josh Mandel (@JoshMandelOhio) March 7, 2022\nHe urged political observers to read about Wisconsin’s investigation of Facebook CEO Mark Zuckerberg’s funding of election operations in 2020, ostensibly “to ensure voters could cast their ballots safely and securely.”\nWisconsin state Special Counsel Michael Gableman said $8.8 million worth of funding from Zuckerberg is considered election bribery in the Badger State.",
    "And that is that the Center for Tech and Civic Life [received] $8,800,000 [from a] Zuckerberg-planned grant with the cities of Milwaukee, Madison, Racine, Kenosha, and Green Bay facially violates the Wisconsin law prohibiting election bribery.”\nMandel concluded by calling for the application of anti-monopoly measures against Big Tech companies.",
    "“Big Tech oligarchs” such as Mark Zuckerberg should be criminally pursued to stop large technology companies’ anti-competitive conduct, Josh Mandel, a Republican candidate running for election to the U.S. Senate to represent Ohio, said on Friday’s edition of SiriusXM’s Breitbart News Daily with host Alex Marlow.",
    "“We need to push removing their immunity and exemption from liability in Section 230 and on either code, any other parts of the code, there’s no reason whatsoever that they should have any immunity or exemption from liability.”\nTransparency — so the taxpayers can see how the money’s being spent.",
    "We’ve got to attack from different angles simultaneously all at once.”\nTechnology companies such as Facebook and Google should not continue benefiting from liability exemptions provided by Section 230 of the Communications Decency Act, Mandel held.",
    "They are obviously, I believe, violating monopolistic standards for American commerce, and I think they need to be broken up.”\nBreitbart News Daily broadcasts live on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.",
    "He said, “When I started this process, when I started this whole procedure, I had no other goal in mind than to find the truth.",
    "He went on, “I think part of the strategy needs to be just to attack their absolute power from 100 angles at once.",
    "He said, “I think they should be broken up — Facebook, Google, and some of these other companies.",
    "“You’ve got to go after them criminally because they don’t care about paying fines,” he remarked.",
    "One of the important truths that has to be mentioned is recited in Chapter 1 of our report.",
    "It’s like blitzkrieg, and they won’t know where it’s coming from.",
    "And while we don’t have it entirely yet, we’re getting it."
  ]
}