{
  "id": 4675,
  "mediaId": 2699,
  "date": "2022-02-16",
  "headline": "The Right-Wing Movements Inspired by Canadian Truckers Are Only ‘Picking Up Steam’",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1644998414/Fever-Dreams-Canada-Truckers_hqgdho",
  "link": "https://www.thedailybeast.com/the-right-wing-movements-inspired-by-canadian-truckers-are-only-picking-up-steam?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Daily Beast",
  "authorUrl": "https://www.thedailybeast.com/author/the-daily-beast",
  "termIds": [
    1726,
    2201,
    3967,
    4106,
    4890
  ],
  "sentences": [
    "?I hope that there will not be some sort of global economic incident of note triggered by cryptocurrency,” says Roth, in a sentence that will surely seem prophetic in six months’ time), and how Ohio Senate primary candidate Josh Mandel—the one whose alleged sex life Trump likes to gossip about—“looks like he just hatched out of something.”\nAnd finally, the hosts unpack how QAnon-loving Congresswoman Marjorie Taylor Greene has become a prime kingmaker in GOP political endorsements, and update us on what’s going on with MAGA election clerk Tina Peters, who tried to hide her iPad from the authorities, with violent results.",
    "“They apparently tried to run a cop off the road with a semi and they apparently were digging in and if police tried to remove the blockade, they were going to go full, I don’t know, Ruby Ridge on them.”\nWhat’s more, Lamoureux notes, the truckers’ movement seems to be picking up steam around the globe, spawning would-be imitators from Europe to Israel and generating a lot of fundraising among fellow-travelers on the U.S. far-right.",
    "A few days later, a package arrived at his ex’s house, and it was the film—which she’s now selling “as a way to recoup her losses.” As Lamoureux notes, “Not a decision I agree with—but I definitely have a lot of empathy for this woman.”\nIn his book, McLeod also wrote about killing some people who escaped his violence in real life—one of whom didn’t even know he was named in the murder-fantasy until Vice revealed it to him.",
    "Even though the Canadian trucker protesters have been cleared from Ottawa’s border bridge, and commerce lanes with the U.S. reopened this past weekend, Canada is still struggling to make sense of and contain the demonstrators—and if you look close enough, the truckers’ demands are a lot weirder than just opposing a vaccine mandate.",
    "Fever Dreams guest and Vice writer Mack Lamoureux, who has been covering various grifters now involved in the movement, notes of the protests: “There is some coherence in it but you have to remove yourself by 30 yards and squint real hard… it’s such a big tent movement.",
    "There are so many different groups… and then within the larger protest you have these more insidious groups—just yesterday, last night, [authorities] arrested a group within the greater protest who had a cache of and a bunch of long guns, handguns.",
    "Lamoureux also discusses his reporting on Denver shooter Lyndon McLeod, who was a somewhat influential writer in the hyper-violent online ‘manosphere’ before he killed five people whose slayings he’d forecasted in a self-published book.",
    "Elsewhere on the pod, co-hosts Asawin Suebsaeng and Kelly Weill, and very special guest host David Roth, talk about how Super Bowl 2022 was just one gigantic ad for crypto (“?",
    "After stealing money from his ex, McLeod went on his shooting spree and died while exchanging gunfire with cops.",
    "As it turns out, just before the shootings, McLeod had been abusing his girlfriend, and also working on a film.",
    "For example, like wanting to install a random woman as Queen of Canada.",
    "Warning: This episode of Fever Dreams contains disturbing material."
  ]
}