{
  "id": 4722,
  "mediaId": 2540,
  "date": "2022-02-17",
  "headline": "143 Republicans are running for Congress in Texas. Only 13 say the 2020 election was legitimate.",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220217112849-tx-voting-2020-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/17/politics/texas-primary-republican-party/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    0
  ],
  "sentences": [
    "(CNN)With the Texas primary looming in less than two weeks, the Houston Chronicle did something very interesting: They asked every Republican candidate running for Congress whether or not they believed the 2020 election was stolen or fraudulent.",
    "If Mitch would have fought for the election, like the Democrats would have if in the same position, we would not be discussing any of the above today, and our Country would be STRONG and PROUD instead of weak and embarrassed.\"",
    "\"Mitch McConnell does not speak for the Republican Party, and does not represent the views of the vast majority of its voters,\" Trump said in a statement earlier this month about the Senate minority leader.",
    "\"Of the 86 with discernible stances, at least 42 have said outright that the 2020 election was stolen, called the results illegitimate or said they would have voted not to certify.",
    "What's become clear in the year-plus since the 2020 election is that former President Donald Trump has turned election denialism into a loyalty test for ambitious Republicans.",
    "Kari Lake, the Trump-endorsed frontrunner in the Arizona gubernatorial race, has called for the state's Secretary of State to be jailed for her role in the 2020 election.",
    "A bit of quick math produces this: Just 9% of Republicans running for Congress this year are willing to publicly state the fact that the 2020 election was free and fair.",
    "Rep. Billy Long, who is running for the Senate in Missouri, has run TV ads pledging to \"stop the Democrats from stealing another election.\"",
    "Around that same time, Ohio Senate front-runner Josh Mandel told a debate audience that \"I believe the election was stolen from Donald J.",
    "Brian Kemp in a Republican primary, said late last year that he would not have signed the election certification if he had been governor.",
    "On a near-daily basis, Trump beats the drum -- via his Save America PAC -- on the false notion that he was somehow robbed of a victory.",
    "In CNN's latest national poll, released earlier this month, 70% of Republicans said President Joe Biden's victory was not legitimate.",
    "In swing state after swing state, recount after recount revealed that the election was, in the main, free from any major errors.",
    "Another 11 candidates have said there was enough fraud or irregularities to cast doubt on the results of the election.",
    "Trump's false claims about the 2020 election have become a must-hold position for aspiring Republican candidates.",
    "\"He did nothing to fight for his constituents and stop the most fraudulent election in American history ...",
    "There is zero actual evidence that the 2020 election was marred by widespread voter fraud.",
    "Candidates have, as the Chronicle's reporting on Texas proves, largely fallen in line.",
    "Which means that whether or not he runs (or wins) in 2024, the Big Lie will live on.",
    "Another 45% of Republicans said that there was \"solid evidence\" to prove that fact.",
    "(Georgia conducted three recounts of its vote, including a manual one.",
    "In Georgia, former Sen. David Perdue, who is running against Gov.",
    "And that only \"real\" Republicans support him in this effort.",
    "All three affirmed the fact that Biden had beaten Trump.)",
    "Just 13 said the results were legitimate.\"",
    "But, that's not really the point here.",
    "And, that's not an isolated finding.",
    "Neither of those things are true.",
    "The conclusion?",
    "NINE percent!",
    "Trump.\""
  ]
}