{
  "id": 4760,
  "mediaId": 2727,
  "date": "2022-02-23",
  "headline": "Jewish Senate hopeful cites slavery after Israel query in debate with Black opponent",
  "image": "https://static.timesofisrael.com/www/uploads/2022/02/02-22-2022-Harper-Mandel-e1645595392897-1024x640.jpg",
  "link": "https://www.timesofisrael.com/jewish-senate-hopeful-cites-slavery-after-israel-query-in-debate-with-black-opponent/",
  "mediaOutlet": "Time of Israel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ron Kampeas",
  "authorUrl": "https://www.timesofisrael.com/writers/ron-kampeas/",
  "termIds": [
    1804,
    1904,
    525,
    5049,
    5333
  ],
  "sentences": [
    "“It is part of what leads into things like Islamophobia that we have seen happening in various parts of our state and our country, and it’s really irresponsible for somebody who is trying to be in the United States Senate to stand up here and say that kind of thing.”\nHarper’s answer to the original question, about the threat from Iran, was typical, at least of Democrats on the progressive left: “I support continuing to do what’s necessary to protect Israel as a state,” said Harper, a former consumer protection attorney for the Obama administration.",
    "She added that, regarding the Israeli-Palestinian conflict, “both Israelis and Palestinians have human rights that need to be protected” and that Ohioans deserve to hear “from all sides on this issue.”\nAdvertisement\nMandel has drawn scrutiny for transitioning from being a moderate Republican when he was state treasurer in the first part of the last decade, to a hard-right politician who backs former US president Donald Trump and his false claims that he won the last election.",
    "There were actually Jews who died marching hand in hand, arm in arm, with MLK to advance the cause of civil rights.”\nIt’s not clear what slavery or the alliance between US Jews and Blacks in the civil rights era had to do with the Iranian threat; Morgan looked nonplussed while Mandel replied, and Mandel did not respond to a Jewish Telegraphic Agency request to elaborate.",
    "“Would you please tell us if you would give unconditional support to protect and defend Israel if Iran attacks the Jewish state?” said the moderator at the debate Monday between Josh Mandel, a Jewish far-right Republican running for Ohio’s US Senate seat, and Morgan Harper, a progressive Democrat.",
    "Mandel pivoted to the Israeli-Palestinian conflict, saying, “There’s a reason why the Arab countries do not want the Palestinians: because time and time again the Palestinian leadership has acted like animals.”\nThat drew a rebuke from Harper.",
    "As The Times of Israel's Diplomatic Correspondent, I'm well aware that Israel's security, strategy and national interests are always scrutinized and have serious implications.",
    "Financial support from readers like you allows me to travel to witness both war (I just returned from reporting in Ukraine) and the signing of historic agreements.",
    "And it enables The Times of Israel to remain the place readers across the globe turn to for accurate news about Israel's relationship with the world.",
    "If it's important to you that independent, fact-based coverage of Israel's role in the world exists and thrives, I urge you to support our work.",
    "The Harper-Mandel debate is unusual since both candidates are not yet nominees and face competitive primaries in their respective parties.",
    "It takes balance, determination, and knowledge to accurately convey Israel's story, and I come to work every day aiming to do so fully.",
    "“I really have to push back on some of this, honestly very dangerous rhetoric that my opponent is stating here today,” she said.",
    "“Morgan, do you know the only country on the whole planet where Africans were not brought as slaves?",
    "Mandel’s reply during the debate, held at a Black church in Cleveland, was anything but typical.",
    "“During the civil rights movement, the best partners that Martin Luther King had, were Jewish.",
    "JTA — It was a straightforward Israel question, typical of many recent political debates.",
    "Israel is now a far more prominent player on the world stage than its size suggests.",
    "Thank you,\nLazar Berman, Diplomatic Correspondent\nAdvertisement",
    "Will you join The Times of Israel Community today?",
    "He directly addressed Harper, who is Black.",
    "The Jewish State of Israel,” Mandel said."
  ]
}