{
  "id": 5515,
  "mediaId": 2664,
  "date": "2022-02-07",
  "headline": "JD Vance's campaign is going down in flames -- and his pollster warns he needs a 'course correction ASAP'",
  "image": "https://www.rawstory.com/media-library/jd-vance.jpg?id=27686010&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/jd-vance-2656587728/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    1804,
    2201,
    3466,
    1,
    831
  ],
  "sentences": [
    "\"Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival Josh Mandel, which have portrayed Vance as an anti-Trump figure,\" writes Politico.",
    "At issue are Vance's past comments about Trump, in which he said he sympathized with some of Trump's political positions but found his character to be so personally poisonous that he could not support him.",
    "Vance's campaign is heading down the tubes, and an internal campaign presentation obtained by Politico shows that he's having a hard time winning over supporters of former President Donald Trump.",
    "Polls have generally shown Vance trailing rival Josh Mandel, who has gone all-out to win over the Trump base by using survivalist rhetoric about keeping \"meat in the freezer... gun at the ready.\"",
    "\"The commercials, which use footage from 2016, show Vance describing himself as a 'Never Trump guy' and calling Trump an 'idiot,' 'noxious' and 'offensive,' appear to have made a dent.\"",
    "The presentation, which was written by longtime Trump pollster Tony Fabrizio, concluded that Vance \"needs a course correction ASAP that will resolidify him as a true conservative.\"",
    "IN OTHER NEWS: 'Nightmare' scenario for GOP as Trump and McConnell go to war with each other\n'Nightmare' scenario for GOP as Trump and McConnell go to war with each other",
    "Ohio Republican Senate candidate J.D."
  ]
}