{
  "id": 5571,
  "mediaId": 2664,
  "date": "2022-02-08",
  "headline": "Has America reached the 'tipping point' where most are sickened by the GOP?",
  "image": "https://www.rawstory.com/media-library/israel-feared-trump-would-spill-their-secrets-to-russia-and-that-s-exactly-what-just-happened.jpg?id=24736971&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/has-america-reached-the-tipping-point-where-most-are-sickened-by-the-gop/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thom Hartmann",
  "authorUrl": "https://www.rawstory.com/u/thom_hartmann",
  "termIds": [
    2338,
    2357,
    2434,
    2906,
    3370,
    3434,
    3466,
    3481,
    878,
    5371
  ],
  "sentences": [
    "As Alex Eisenstadt writes for Politico about a freak-out internal memo from within the campaign of JD Vance, the wealthy investor challenging perennial GOP candidate Josh Mandel:\n“Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival Josh Mandel, which have portrayed Vance as an anti-Trump figure.” (In reality, Vance has embraced Trump like a teenager mooning over a rock star.)",
    "On that score, Americans should welcome Mike Pence’s stand Friday for constitutional principle on elections no matter its political cost.”\nWhile Murdoch’s Fox “News” will continue to play the grievance game and hang onto Trump and his rube followers as long as they can to maintain audience share, the Journal’s management knows that their more educated and higher-income readers have already seen through Trump’s grifts.",
    "As a result, the GOP is going to go one of two ways in the next year or three: full fascist or back to being the Eisenhower/Nixon party that watched out for the interest of business (while the Dems stood up for labor) but also understood that a healthy economy included the need for reasonable taxes and anti-trust enforcement (Nixon, who maintained a 74% top income tax rate, started the AT&T breakup).",
    "The “law and order party” has declared that assaulting over 140 police so severely they had to be hospitalized, smearing feces on the walls of the US Capitol, and trying to overthrow our government are “legitimate political discourse.”\nRepublicans always claimed to be the best at economics, but have embraced tax cuts since 1981 that have created a $30 trillion national debt.",
    "Both groups are billionaire-affiliated, so it appears that even among Republican billionaires there’s a split between those favoring outright fascism and a return to a Reagan/Bush-style of embracing tax cuts and monopolies while pitching feel-good “morning in America” bromides to voters.",
    "Billionaire Rupert Murdoch’s Wall Street Journal is now openly calling them out in an editorial from the publication’s editorial board itself:\n“The United States desperately needs a Republican Party that is a sane alternative to the ruling Democrats who have lurched to the coercive left.",
    "While Republican successes in blocking legislation, judges and even presidential nominations may seem like the Party is on a roll, the reality is that the GOP is in the midst of an existential crisis as severe as any party has seen since the Whigs died out in the early 19th century.",
    "As this high-level schism plays out within the GOP, Republican politicians on the ground have stopped even pretending to hold or promote the values that were traditionally the mother’s milk of campaigning:\nThey no longer even bother to hold town hall meetings with constituents.",
    "The current Republican Party situation is unsustainable: the public is both exhausted and increasingly sickened by the recurrent panics and, outside of those, the GOP offers little by way of plans and policies to rebuild an America gutted by 40 years of Reagan’s neoliberalism.",
    "Grievance and freak-out politics work well for talk radio and Fox “News,” and have historically helped Republicans win a few elections (Willie Horton, “weak” Carter against Iran, Clinton getting a BJ, “Obamacare is socialism”) but have little to do with governing.",
    "But the fever also seems to be breaking as Trump’s crimes are increasingly laid bare, some January 6th “protestors” are getting long prison sentences, and Republicans like Pence, Romney and Cheney are calling out the deep grift within the party.",
    "Because the GOP has become so completely hollowed out, holding to tax cuts for rich people and deregulation for polluters as their only predictable political positions, they’ve turned to moral panics as their main tool to try to win elections.",
    "If Democrats wipe the floor with them (still a very real possibility), it could signal a turn away from Trump and the GOP returning to its more normal Reagan-type grift of just quietly shilling for billionaires and polluters.",
    "These moral panics used to pretty much only pop up in time for an election (Nixon’s 1971 War on Drugs, Bush Sr.’s Willie Horton freak-out, Bush Jr pushing Islamaphobic-panic to invade Iraq and seize its oil).",
    "Republicans used to performatively embrace kindness (kissing babies was always big) but now they openly promote assault weapons and militias that are simply this generation’s brutal version of the Klan.",
    "The “party of morality” that spent three years going after Bill Clinton for getting a BJ from a consenting adult no longer even bothers to justify Trump’s 20+ charges of rape and sexual assault.",
    "There are some predicting today’s GOP will vanish, going the way of the Whigs, to be replaced by a new party that embraces democracies instead of dictators but is also business-friendly.",
    "Pence standing up to Trump was either the beginning of the end of this incarnation of the GOP, or a warning flare that the final stage of the end of democracy in America has begun.",
    "A year ago many predicted the GOP was going to go full fascist by now, and that is still a serious danger, as I laid out in detail in The Hidden History of American Oligarchy.",
    "And don’t even think about honest history: Republicans across the nation are trying to ban the stories of the struggles of Black, Hispanic, Asian or Native Americans.",
    "The party that has long proclaimed itself the champion of “family values” can’t even muster a dozen votes to extend the child tax credit or support free pre-school.",
    "Most recently they’ve obsessed on Benghazi, Hillary’s emails, guns, wedding cakes, trans kids in school bathrooms, “voter fraud” and, most recently, Black history.",
    "In the Ohio senate primary to replace outgoing Senator Rob Portman, the race has degenerated into a contest about who loves Trump and his racist fascism the most.",
    "This represents a huge crisis for Republican elected officials and the Party’s leadership, particularly those who continue to play the Trump-humper card.",
    "That’s unlikely, though: the Whigs didn’t have a billion-dollar institutional infrastructure with its own momentum independent of individual politicians.",
    "Now it’s devolved to the point where a Republican candidate can simply purchase the endorsement of high profile conservatives by writing a $20,000 check.",
    "As Mitt Romney recently said about the party’s endorsement of the January 6th insurrection:\n“It could not have been a more inappropriate message.",
    "Today’s GOP, however, bereft of any core principles beyond money and power, has been forced to invent a new panic every year or so.",
    "Even science is no longer something Republicans feel comfortable with, from Covid to sex-ed to evolution and climate change.",
    "Patriotism and honor were values the GOP has used for decades to woo voters, but since Trump the party doesn’t even bother.",
    "Mitch McConnell long ago gave up on principle or ethics; he’s been all about pure power since Obama was elected.",
    "Anything that my party does that comes across as being stupid is not going to help us.”\nHow will it shake out?",
    "If the Trumpy candidates win across the board and the GOP goes full fascist, the country may well soon follow.",
    "The party of “one nation, under God” has embraced open racism in its attacks on teaching Black history.",
    "Obvious grifters like Boebert, Gaetz, Greene and Jordan are now the most visible faces of the Party.",
    "IN OTHER NEWS: Bad news for Trump as GOP turns into the 'party of Marjorie Taylor Greene'",
    "To a large extent, that will be decided by this November’s election.",
    "Many don’t answer their publicly published phones any longer.",
    "When the money leaves, the Party is dead.",
    "Watch this space."
  ]
}