{
  "id": 6044,
  "mediaId": 2660,
  "date": "2022-02-09",
  "headline": "In race for open US Senate seat in Missouri, fact-checking a PAC attack on Eric Schmitt over China",
  "image": "https://static.politifact.com/politifact/rulings/meter-half-true.jpg",
  "link": "https://www.politifact.com/factchecks/2022/feb/09/team-pac/race-open-us-senate-seat-missouri-fact-checking-pa/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Kertscher",
  "authorUrl": "https://www.politifact.com/staff/tom-kertscher/",
  "termIds": [
    2104,
    4433,
    878,
    1171,
    4852,
    5159,
    5240
  ],
  "sentences": [
    "AdImpact.com, \"Mao Money\" ad, accessed Feb. 7, 2022\nYouTube, \"Mao Money\" ad, Feb. 6, 2022\nYouTube, Team PAC post of \"Mao Money\" ad, Feb. 1, 2022\nEmail, Team PAC spokesperson Joe Kildea, Feb. 8, 2022\nInterview, Andrew Leppert, political director, Eric Schmitt campaign, Feb. 9, 2022\nMissouri Senate, SB 390, accessed Feb. 8, 2022\nMissouri Senate, SB 9, accessed Feb. 8, 2022\nMissouri Senate, Journal of the Senate, May 16, 2013\nMissouri Senate, Journal of the Senate, Sept. 11, 2013\nU.S. Securities and Exchange Commission, China Eastern Airlines Form 20-F, April 24, 2012\nMissouri Independent, \"Pro-Greitens PAC hits Schmitt on China in ad airing during Olympics opening ceremony,\" Feb. 3, 2022\nMissouri Times, \"Schmitt, Greitens release dueling China ads to air during Olympics,\" Feb. 4, 2022\nRiverfront Times, \"Lambert Airport's China Hub Is Dead, But May Live at MidAmerica Airport,\" Feb. 12, 2012\nBreitbart, \"U.S. Senate Candidate Missouri Attorney General Eric Schmitt Has a History of Helping Communist China,\" Sept. 4, 2021\nSt. Louis Beacon, \"China hub debate moves to Jefferson City,\" April 1, 2011\nSt. Louis Business Journal, \"The little airport that could,\" March 2, 2012\nSt. Louis Business Journal, \"Trade hub incentives don't pass Missouri General Assembly,\" May 16, 2011\nSt. Louis Business Journal, \"Mo.",
    "Senate gives green light to Aerotropolis incentives,\" April 28, 2011\nSt. Louis Post-Dispatch, \"Gateway to the future,\" April 1, 2011\nSt. Louis Post-Dispatch, \"Cargo backers: New tax credit key to China hub,\" March 25, 2011\nSt. Louis Post-Dispatch, \"Legislators take China hub issue to special session,\" Sept. 5, 2011\nSt. Louis Post-Dispatch, \"Is Missouri's agricultural law being rewritten in Hong Kong?",
    "The Team PAC ad didn’t mention the hub’s potential to handle exports, but one of the articles it cited, a St. Louis Post-Dispatch editorial, said the City of St. Louis was negotiating with China Cargo Airlines \"to bring Chinese-made goods to America through Lambert and to take American goods and agricultural products back overseas.\"",
    "Schmitt’s 2011 bill initially called for $480 million in tax credits, not state expenditures, for a proposed air cargo hub to support international trade, including exports, with a Chinese airline as a potential partner; the tax credits would have been contingent on investment and trade occurring.",
    "The bill was proposed as St. Louis leaders entered their fourth year of negotiations with Chinese officials over a freight hub at the airport, and two months after the Chinese directed their largest freight carrier — China Cargo Airlines — to begin direct talks with the airport, the story said.",
    "\"Schmitt sponsored a bill to spend $480 million of your tax dollars to create a cargo hub here for airlines owned by China's Communist Party to flood Missouri markets with cheap Chinese imports,\" the narrator continued, \"and Schmitt voted to let China buy up Missouri farmland.\"",
    "To back its claim that the airline was \"owned by China's Communist Party,\" the super PAC ad cited a U.S. Securities and Exchange Commission filing for 2011 by Shanghai-based China Eastern Airlines, in connection with securities listed on the New York Stock Exchange.",
    "One of the ads, from a conservative super PAC that is funded by a large Illinois GOP donor, used the Winter Olympics in Beijing as a backdrop to brand Missouri Attorney General Eric Schmitt as \"good for China, bad for Missouri.\"",
    "Uihlein, who owns a giant shipping supply company, is the second-largest individual donor to outside spending groups for the 2022 campaign cycle, having contributed $10.2 million, according to the nonprofit Open Secrets.",
    "Our ruling\nTeam PAC said Schmitt \"sponsored a bill to spend $480 million of your tax dollars to create a cargo hub here for airlines owned by China's Communist Party\" and \"voted to let China buy up Missouri farmland.\"",
    "Before the law, foreign businesses generally were prohibited from owning agricultural land in Missouri; the change loosened the prohibition, capping foreign ownership at 1% of Missouri’s total agricultural acreage.",
    "His bill called for $420 million of incentives to build warehouses and distribution centers within a 50-mile radius of Lambert; and $60 million in tax credits for companies shipping exports out of Missouri.",
    "As reported by the St. Louis Post-Dispatch, the initial bill would have offered up to $480 million worth of tax breaks over 15 years to spur foreign trade through Lambert-St. Louis International Airport.",
    "Team PAC and mega donor Uihlein\nTeam PAC raised $2.5 million in 2021, according to the Federal Election Commission — all of it from a suburban Chicago billionaire, Republican donor Richard Uihlein.",
    "Also among the GOP candidates are state Senate President Dave Schatz and attorney Mark McCloskey, who is best known for pointing a gun at protesters when they marched past his St. Louis home.",
    "As a super PAC, Team PAC may raise unlimited sums of money from corporations, unions, associations and individuals, then spend unlimited sums to advocate for or against political candidates.",
    "The other GOP candidates include U.S. Reps. Vicky Hartzler and Billy Long; Long’s campaign gained attention for running an ad claiming that Democrats \"rigged\" the 2020 presidential election.",
    "The law allowed a Chinese company, Shuanghui International of Hong Kong, to buy Virginia-based Smithfield Foods, which owned Missouri farmland at the time, the Post-Dispatch reported.",
    "In a race for an open seat in Pennsylvania, Dr. Mehmet Oz accused fellow Republican David McCormick of giving Chinese companies billions of dollars through the hedge fund he ran.",
    "Loosening of Missouri farmland law\nThe second part of the claim alludes to a 2013 state law, which Schmitt voted for, on the ownership of agricultural land by foreign businesses.",
    "Here’s what it does say:\nMost of the major airline companies in China were majority-owned either by the central government or by provincial or municipal governments in China.",
    "The statement is based on bills that Schmitt supported in the legislature, but it leaves out important context about his vote and the effect of the legislation.",
    "Greitens resigned as governor in 2018 after facing a felony computer tampering charge, which was dropped, and allegations related to an extramarital affair.",
    "The first part of the super PAC’s claim centers on a 2011 bill Schmitt proposed as a state senator, connected to what was known as the China Hub Project.",
    "Both parts of the claim are rooted in bills Schmitt supported in the legislature, but they omit important context about the effect of the legislation.",
    "A super PAC supporting Republican Josh Mandel for an open seat in Ohio claimed that Republican Jane Timken’s family business moved jobs to China.",
    "If Your Time is short\nA bill Schmitt sponsored originally called for $480 million in tax credits, not state expenditures, for the Missouri hub.",
    "Some Republicans running for open U.S. Senate seats are being hit from the right with attack ads that accuse them of cozying up to China.",
    "Meanwhile, Alex Lasry, one of the Democrats challenging GOP incumbent Ron Johnson in Wisconsin, pledged to \"finally stand up to China.\"",
    "Schmitt’s vote for a 2013 bill that became law allowed for foreign businesses to own a limited amount of agricultural land in Missouri.",
    "Under the version ultimately approved by the Missouri legislature, Schmitt’s bill would have provided $360 million in tax credits.",
    "The Chinese government controlled a 59.53% equity stake in a holding company that was China Eastern’s biggest shareholder.",
    "Schmitt argued at the time that the tax credits would be issued only if certain investment and trade occurred.",
    "A law Schmitt voted for allows for limited ownership of Missouri agricultural land by foreign businesses.",
    "China as a key campaign issue\nChina is a recurring theme in ads for Senate contests in several states.",
    "Schmitt said facilities built under the bill could be used to store meat that could be sent to China.",
    "The 2011 filing does not make clear the precise level of Chinese government ownership in China Cargo.",
    "So the filing indicates that the Communist government had at least an indirect stake in China Cargo.",
    "Without the bill, Schmitt didn’t see the China hub materializing, the St. Louis Beacon reported.",
    "The Missouri race is to succeed two-term GOP Sen. Roy Blunt, who is not seeking re-election.",
    "But what Schmitt voted for was not approval of any specific land purchases by China.",
    "Schmitt formerly served as Missouri’s secretary of state and as a state senator.",
    "It aired Feb. 4 during the broadcast of the opening ceremonies of the Games.",
    "Featured Fact-check\nChina Eastern owned 51% of \"subsidiary\" China Cargo.",
    "The primary is Aug. 2 for the seat, which is rated as solid Republican.",
    "The ad opened with images of fireworks behind the words \"China 2022.\"",
    "But the bill was not signed into law, and the project was scrapped.",
    "The TV ad from Team PAC, which is supporting former Missouri Gov.",
    "The measure was approved over the veto of then-Gov.",
    "The narrator said, \"How did China get so powerful?",
    "Eric Greitens in the race, is called \"Mao Money.\"",
    "Then it makes a two-part claim.",
    "The bill did not become law.",
    "Friends like Eric Schmitt.\"",
    "Jay Nixon, a Democrat.",
    "We rate it Half True.",
    "\", May 14, 2015"
  ]
}