{
  "id": 6173,
  "mediaId": 6428,
  "date": "2022-02-10",
  "headline": "From Reagan to Trump: GOP Navigates Changing Landscape",
  "image": "https://www1.cbn.com/sites/default/files/media/slider/images/dividedgop_hdv.jpg",
  "link": "https://www1.cbn.com/cbnnews/politics/2022/february/from-reagan-to-trump-gop-navigates-changing-landscape",
  "mediaOutlet": "CBN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Brody",
  "authorUrl": "https://www1.cbn.com/profiles/brody-david",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Unfortunately, the generations before us took pride in voting conservative, took pride in voting for Republicans, but they were getting the wool pulled over their eyes in Washington and people were just voting down the line for people that essentially sold them up the river.",
    "\"Did you ever think that one man out of office could intimidate an entire party where they're unwilling to take any vote contrary to what he thinks should be taken for fear of being defeated in a primary,\" Biden mused at a press conference last month.",
    "With rhetoric like that, the dividing lines were drawn with Republicans like U.S. Rep. Liz Cheney (R-WY) on one side saying the election was not stolen and Senate candidates like Ohio's Josh Mandel claiming the opposite.",
    "That's why they backed a proposal to remove Republicans Liz Cheney and Adam Kinzinger from the House Republican Conference due to their vocal support of the Jan. 6 committee.",
    "\"Some say they are but listen, D.C. is a swamp and, in every swamp, you have alligators,\" said Kathy Barnette, who is running for the U.S. Senate in Pennsylvania.",
    "The iconic Republican president was fond of saying, \"The person who agrees with you 80 percent of the time is a friend and an ally – not a 20 percent traitor.\"",
    "When asked whether the definition of a RINO has changed over the years, the chairwoman of the Republican National Committee (RNC) didn't want to go there.",
    "***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.",
    "Former President Donald Trump has said in the past that Senate Minority Leader Mitch McConnell (R-KY)didn't have the courage to challenge the election.",
    "Moderate Republicans that would vote with the Chamber of Commerce and totally abandoned some of our some of what we find is core morals and ethics.\"",
    "Current polls show 57 percent of Republicans say they won't vote for any GOP candidate who agrees that Joe Biden won the election fair and square.",
    "Recently, Trump said if he runs and regains the presidency, he'd look at pardoning those convicted of crimes in the U.S. Capitol that day.",
    "The label has been bestowed on Sen. Mitt Romney (R-Utah) and others who joined Democrats to pass the $1 trillion infrastructure bill.",
    "Don't focus on the alligator on the rocks and mainly focus on the alligator that is right on us and is about to destroy our country.\"",
    "Even President Biden understands Trump's gravitational pull, which he believes has prevented him from getting Republican support.",
    "\"There's only one candidate in this race for U.S. Senate who's willing to say that the election was stolen from Donald J. Trump.",
    "\"You have some alligators that are on a rock, sunbathing, and then you have other alligators that are right upon you.",
    "The question remains whether it will lead to the much-talked-about wave that could retake the majority in November.",
    "South Carolina Republican Senator Lindsey Graham strongly disagrees saying Trump's remarks were, \"inappropriate.\"",
    "His political operation starts the year with $122 million in the bank, much of it from small donations.",
    "Republican congressmen who have been reliable conservative votes over the years are now called RINOs.",
    "Help us continue to be a voice for truth in the media by supporting CBN News for as little as $1.",
    "Democrats are the alligators that are right upon us so we need to be really focused, real clear.",
    "\"I have guts and backbone and a steel spine and I don't care if the liberal media attacks me.\"",
    "It's become more of a populist party and no longer like your grandfather's Republican Party.",
    "There's no doubt something is in the water that's led to a shift in the Republican current.",
    "and I know everybody focuses on inner-party stuff and that will work out in the primaries.",
    "The momentum is also squarely with Donald Trump when it comes to the money flowing in.",
    "We are committed to delivering quality independent Christian journalism you can trust.",
    "\"I'm not as into dividing right now,\" RNC Chairwoman Ronna McDaniel told CBN News.",
    "Some candidates running in the midterms credit Trump for changing the GOP message.",
    "Yet, the RNC clearly recognizes where the momentum and energy are right now.",
    "So is Donald Trump a litmus test for Republicans running for office today?",
    "and I'm willing to say that because it's the truth,\" Mandel told CBN News.",
    "I mean Lindsey is a nice guy, but he's a RINO (Republican In Name Only).",
    "The days of Ronald Reagan seem long gone in today's Republican Party.",
    "But it takes a lot of hard work, time, and money to do what we do.",
    "said Andrew McCarthy, who is running for Congress in New York.",
    "That’s why we view every news story through the lens of faith.",
    "It appears his post-election rhetoric has made him stronger.",
    "Mandel seems to have strong backing on that side of the GOP.",
    "Trump responded flatly: \"Well, Lindsey Graham is wrong.",
    "That's certainly not the case today within the GOP.",
    "\"We need everyone to go win against the Democrats.",
    "***\nOf course, then there's the Jan. 6 divide.",
    "That seems to be where we are in today's GOP.",
    "The RNC has to stay neutral in primaries.\"",
    "The 2020 election changed everything.",
    "God is everywhere—even in the news.",
    "Did you know?",
    "\"Thank God!\""
  ]
}