{
  "id": 6354,
  "mediaId": 2658,
  "date": "2022-02-01",
  "headline": "A crypto breakthrough? Western states consider taking digital currency",
  "image": "https://static.politico.com/3e/00/67a31b53487d817fe70f661ee88a/gettyimages-1352551001-1.jpg",
  "link": "https://www.politico.com/news/2022/01/31/crypto-wyoming-arizona-tax-payments-00003910",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1804,
    3764,
    602,
    4830,
    5104,
    5371,
    5408
  ],
  "sentences": [
    "| Mario Tama/Getty Images\nBy Ben Schreckinger\n 02/01/2022 04:30 AM EST\nThe dreams of crypto enthusiasts inched closer to reality in recent days as lawmakers in Wyoming and Arizona put forward proposals that would allow those states to accept tax payments in the form of digital currencies.",
    "He said it is unlikely that courts would actually strike down Wyoming’s proposal on constitutional grounds, in part because of precedent permitting privately issued money and in part because any such ruling would have implications for existing tax credit systems used by states.",
    "Rogers, who did not immediately respond to a request for comment, has been a vocal proponent of the false claim that former President Donald Trump won the 2020 election and featured prominently in a recent report by the Anti-Defamation League on extremism in American politics.",
    "The new proposals, and others like them around the United States, threaten to erode a key distinction upholding the supremacy of the U.S. dollar over its would-be digital competitors: Americans can use U.S. dollars, but not cryptocurrencies, to pay their taxes.",
    "American CryptoFed, whose founders previously worked on mobile banking platforms, plans to issue a so-called algorithmic stablecoin — a cryptocurrency whose value is pegged to the consumer price index — that can be collected for sales tax purposes.",
    "The Arizona bill, according to Grey, faces a greater risk of being deemed unconstitutional because it seeks to designate a cryptocurrency as “legal tender.” This has broader implications than the Wyoming proposal, which is limited to tax payments.",
    "“I see this as much more of a stunt than genuine shakeup,” said Rohan Grey, who serves as research director of the Digital Fiat Currency Institute, a San Francisco-based trade group that represents government bodies and financial institutions.",
    "While crypto supporters contend that some digital currencies are pegged to the U.S. dollar or to baskets of goods and services, limiting their volatility, early attempts to let taxpayers in the U.S. pony up in crypto have proven to be busts.",
    "But Wyoming has gone further than any other state in passing laws to accommodate cryptocurrency adoption, and backers of the proposal there believe it will be the first state to take a significant step in the realm of tax payments.",
    "Critics of privately issued and open-source cryptocurrencies argue that if they displace national currencies, they would undermine the ability of national governments and central banks to effectively regulate the economy.",
    "A spokesperson for the Seminole County Tax Collector’s Office, Alan Byrd, said that the office no longer takes payments in cryptocurrencies and that no one had submitted any such payments when it did.",
    "But supporters of the incumbent banking system expressed skepticism that recent state-level proposals would do much to upset the current system, pointing to potential legal and practical hurdles.",
    "The mayor of Jackson, Tennessee, has said the city is studying how it might take property tax payments in digital currencies, and Miami-Dade County is examining similar possibilities.",
    "The Wyoming effort also offers a window into some of the forces vying to shape the future of digital money: namely, big retailers and veterans of the commercial banking industry.",
    "One potential obstacle to proposals like this in Arizona and Wyoming is Article I, Section 10 of the Constitution, which restricts the power of states to issue their own money.",
    "A spokesperson for the Ohio Treasurer’s office, Brittany Halpin, said that fewer than 10 businesses took advantage of the program during the 10 months it was active.",
    "The group supports the issuance of digital currencies by central banks as a government-controlled alternative to privately issued or open-source cryptocurrencies.",
    "The Wyoming proposal is also backed by the Merchant Advisory Group, a trade group for retailers that counts Amazon, Walmart, and the Home Depot among its members.",
    "Grey, who also works as a law professor at Willamette University in Salem, Oregon, predicted that a bigger problem than regulation would be a lack of interest.",
    "”It’s a milestone,” he said, “but it’s a very niche use.”\nBen Schreckinger covers tech, finance and politics for POLITICO; he is an investor in cryptocurrency.",
    "He said he remained more focused on the nitty-gritty details of his sales tax proposal than any sweeping implications it might hold for the future of money.",
    "“We are looking for alternative currencies to compete with the U.S. dollar,” said Zhou Xiaomeng of American CryptoFed, a group backing the Wyoming proposal.",
    "Instead, as the federal government gears up to more extensively regulate cryptocurrencies, Grey said Congress could simply pass a law banning the practice.",
    "In 2018, Ohio’s then-treasurer, Republican Josh Mandel, unveiled a program to let businesses pay some taxes in Bitcoin, the most popular cryptocurrency.",
    "In addition to the constitutional issues posed by the Arizona bill, its prospects are complicated by its sponsor, Republican Sen. Wendy Rogers.",
    "Also in 2018, Seminole County, Florida’s then-tax collector, Republican Joel Greenberg, said he would take payment for some fees in Bitcoin.",
    "Soon after he left office, his successor shuttered the program, which the state’s attorney general concluded was not properly authorized.",
    "Ocean Andrew, the sponsor of the amendment, which would allow crypto tax payments to be made automatically via digital smart contracts.",
    "If the Wyoming proposal succeeds, its real significance would be to help legitimize cryptocurrencies as alternatives to the greenback.",
    "Andrew, a Republican who runs a restaurant business based in Laramie, said he wanted to reduce the paperwork burden of sales taxes.",
    "As American CryptoFed’s name suggests, the group aspires to compete with the Federal Reserve System, which regulates the dollar.",
    "While the race to implement the first successful program is on, it is shaping up to be more of a marathon than a sprint.",
    "They also argue that Americans, in particular, benefit from the status of the dollar as the world’s reserve currency.",
    "The Wyoming proposal, which is not limited to any specific cryptocurrency, would apply only to sales and use taxes.",
    "He has since pleaded guilty to a raft of charges, including for embezzling county funds to purchase cryptocurrency.",
    "Andrew said he plans to work with the state’s Department of Revenue and to introduce an updated proposal next year.",
    "Under the Arizona proposal, the state would recognize the most popular cryptocurrency, Bitcoin, as legal tender.",
    "Meanwhile, lawmakers in Wyoming resolved law week to study the sales tax proposal rather than push ahead on it.",
    "Many cryptocurrencies have wildly fluctuating values, which undermines their practical value as forms of money.",
    "Jared Polis, a Democrat, said he wants his state to be the first to accept taxes in crypto.",
    "Several other U.S. jurisdictions are investigating the possibility of taking such payments.",
    "“The volatility of these instruments will do more damage than a legal response,” he said.",
    "“It’s the beginning of the end,” for central banking and the U.S. dollar, Zhou declared.",
    "“It’s just an idea about how to make the process more seamless and automated,” he said.",
    "Merchant Advisory Group’s CEO, John Drechny, declined an interview request.",
    "A Bitcoin ATM stands in a 7-Eleven store on Nov. 10, 2021, in Los Angeles.",
    "For retailers, part of the appeal would be convenience, said Wyoming Rep.",
    "But Greenberg’s tenure was cut short by a federal indictment.",
    "Both proposals face potential legal and political hurdles.",
    "But some of the plan’s backers have grander designs.",
    "Last year, Colorado Gov."
  ]
}