{
  "id": 638,
  "mediaId": 2550,
  "date": "2022-04-18",
  "headline": "Abbreviated Pundit Roundup: The illuminated war in Ukraine is taking place in plain sight",
  "image": "https://images.dailykos.com/images/1059663/story_image/GettyImages-657228186.jpg?1650038303",
  "link": "https://www.dailykos.com/stories/2022/4/18/2092522/-Abbreviated-Pundit-Roundup-The-illuminated-war-in-Ukraine-is-taking-place-in-plain-sight?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2292,
    3522,
    4979,
    5073,
    5077,
    5129,
    5287,
    5366
  ],
  "sentences": [
    "Around the same time, Josh Mandel, the forty-four-year-old former Ohio state treasurer, who overtook Gibbons in one recent poll, released an ad that begins with an Ohio woman saying critical race theory is “crap.” It then cuts to Mandel on the Edmund Pettus Bridge, in Selma, saying, “Martin Luther King, Jr., marched right here so skin color wouldn’t matter.”\nx\nNEW: Christian Dominionists who envision a theocratic takeover of the U.S. government have long sought to remake the nation in their image.",
    "x\nWestern officials believe that Russia has lost a disproportionate number of generals in Ukraine - likely the most of any modern military since WWII - because a failure to communicate orders to the front, forcing flag officers to do it themselves.https://t.co/R4Nz0jMqS7\n— Jack Detsch (@JackDetsch) April 16, 2022\nEliot A. Cohen/Atlantic:\nThis Is the War’s Decisive Moment\nThe United States and its allies can tip the balance between a costly success and a calamity.",
    "x\nRegarding Congressman Chip Roy’s texts with Mark Meadows…I went back and looked at how they fit with my reporting at the time, and it was honestly pretty interesting: https://t.co/g0ndKMb2Os\n— Abby Livingston (@TexasTribAbby) April 16, 2022\nBenjamin Wallace-Wells/New Yorker:\nThe First Post-Trump Republican Race\nIn Ohio’s raucous Senate primary, conservatives are competing for the ex-President’s favor—and to define what Trumpism still means.",
    "(@RonFilipkowski) April 17, 2022\nHunter Walker/Substack:\n‘Hard Core Trump Guys’ And Alternate Electors: Key Details From Mark Meadows’ Latest Leaked Texts\nIn recent weeks a stream of text messages exchanged by President Trump’s former chief of staff, Mark Meadows, have leaked.",
    "Last October, I reported that two organizers of the main January 6 rally where Trump spoke on the White House Ellipse claimed they were involved in “dozens” of planning calls where Republican members of Congress discussed strategies for overturning the election with activists.",
    "People who know conservative politics say that the Republicans running for the U.S. Senate in Ohio may be the most high-profile, well-resourced, and audacious group in the country—a good place to see the future of the Party a year after Donald Trump departed the White House.",
    "If Ukraine succeeds in preserving its freedom and territorial integrity, a diminished Russia will be contained; if it fails, the chances of war between NATO and Russia go up, as does the prospect of Russian intervention in other areas on its western and southern peripheries.",
    "x\nJust days before J6, Jason Sullivan, a former aide to Roger Stone, held a conference call to help organize it where he said Trump will not allow Biden to take office and will declare a “limited form of martial law.” This call was reported on by the NYT.",
    "Earlier this month, Vance cut an ad in which he asks his audience, “Do you hate Mexicans?” Ostensibly, it was a way to mock knee-jerk liberals, but he also seemed to blame border-crossing cartels for his mother’s opioid overdose.",
    "Take a look below where Bazaliyaka is in particular (next tweet)\nIlya Mateev/Twitter:\nMikhail Khodorenok, a retired colonel with the Russian general staff currently working as an analyst, writing *three weeks before the war*:\n 1.",
    "If such behavior leads to humiliation on the battlefield and economic chaos at home, those norms may be rebuilt to some degree; if Vladimir Putin’s government gets away with it, restoring them will take a generation or longer.",
    "Southwest Missouri high school teacher accused of using critical race theory loses job\nKim Morrison, a high school English teacher in Greenfield, was notified mid-March that her contract was not renewed for the next year.",
    "Along with adding to the evidence that members of Congress actively strategized to reverse Trump’s loss, the messages from Lee to Meadows provide some new detail on the White House’s efforts to overturn the vote.",
    "(@Noahpinion) April 17, 2022\nPhilips P O’Brien/Twitter:\nA brief thread on the political economy of the war and why what has happened since the invasion has also destroyed any strategy the Russians might have had.",
    "x\nAlex Jones' InfoWars files for bankruptcy in the face of multiple defamation lawsuits https://t.co/bKo3L4JglW\n— Reuters (@Reuters) April 18, 2022\nCas Mudde/Twitter:\nThis should not be/remain a local story.",
    "The latest Meadows texts, which were published by CNN on Friday, show his conversations with two Republican allies in Congress — Sen. Mike Lee (R-UT) and Rep. Chip Roy (R-TX) — and there are two key details.",
    "We already knew that members of Congress were part of the push to block President Joe Biden’s victory that culminated in the January 6, 2021 attack on the U.S. Capitol as the vote was being certified.",
    "I don’t generally highlight our own writers on the theory you’re already reading them (and want to know what’s going on elsewhere), but these posts fit today’s theme and are too good not not mention.",
    "Russia’s sheer brutality and utterly unwarranted aggression, compounded by lies at once sinister and ludicrous, have endangered what remains of the global order and the norms of interstate conduct.",
    "Philips P O’Brien/Twitter:\nThe upcoming Battle of the Donbas: where we might be when looking at both the most predictable but also one of the strangest battles in modern war.",
    "A Russian win would encourage a China coolly observing and assessing Western mettle and military capacity; a Russian defeat would induce a salutary caution in Beijing.",
    "More specifically, it is about limiting “racism” to a very specific, personal, ideology, overtly expressed and supported by just a minority of Americans.",
    "From the battle of Kyiv, to the sinking of the Moskva, to the Russian drive in Mariupol, the objectives and positioning are all there in plain sight.",
    "It shows that @kamilkazani is completely right: By cutting off technological exports to Russia, we can grind Putin's war machine to a halt.",
    "Between open source intelligence, subject matter experts and government sources, everyone has a bird’s eye view for what’s going on.",
    "Oh, and by the way, don’t miss Markos Moulitsas right here on this site explaining what’s going on (here’s a great example).",
    "Overall, the messages show that both Lee and Roy encouraged and aided efforts to overturn Trump’s loss in the 2020 election.",
    "O”Brien isn’t the only analyst out there, but he’s one of the better explainers without falling into military jargon.",
    "pic.twitter.com/FdejbZ7bNe\n— Phillips P. OBrien (@PhillipsPOBrien) April 16, 2022\n(That there is a tank turret.)",
    "Here's in-depth look at how they set the stage for the end of Roe v. Wade—with a focus on the federal courts.",
    "As everyone seems to guess, after losing the Battle of Kyiv, this battle is now Russia's great priority.",
    "Russia has no capability to destroy the Ukrainian military and thus end the war with one missile attack.",
    "There will be many more Kim Morissons soon, across “red” America, while many others will self-censure.",
    "Some examples follow (and they aren’t the “Russia is winning” framing provided by our major papers).",
    "For those of us born after World War II, this is the most consequential war of our lifetime.",
    "This would be very threatening to Russian communications, logistics coming out of Belgorod.",
    "The sentiment is perfectly captured in this banner: “Don’t Make Me Into A Racist”.",
    "Twitter and the non-commercial outlets are doing an amazing job covering this war.",
    "Ukrainian armed forces report that Ukrainian forces are pushing out from Kharkiv.",
    "Clearly the Putin government miscalculated on what sanctions Russia will face.",
    "No one in Ukraine will happily greet Russian troops in case of the invasion.",
    "Don't forget there's a consequential French election coming up this weekend.",
    "Russia lost in Afghanistan and Chechnya despite them having zero planes.",
    "Upon its outcome rests the future of European stability and prosperity.",
    "Obviously, it is not about Critical Race Theory, it is about racism.",
    "The war will not end quickly because of Russia's air supremacy.",
    "It will probably be a defining one for the equipment war.",
    "1/https://t.co/MmvDzi5puV\n— Ashton Pittman ??????????????",
    "Certainly they’ve been pushing a boundary of some kind.",
    "x\nI’m sure many of you have seen this arresting image.",
    "Philips P O’Brien/Twitter:\nWell this is interesting.",
    "And Ukraine does have an air force and air defense.",
    "pic.twitter.com/PfFJ4o33wU\n— Ron Filipkowski ????",
    "My state, Georgia, just passed an “anti-CRT” law.",
    "Students, schools and whole country will suffer.",
    "x\nThis is Russia's only domestic tank producer.",
    "https://t.co/U2B8C9Izo1\n— Noah Smith ??????",
    "(@ashtonpittman) January 26, 2022",
    "It just doesn't work that way.",
    "[An obvious one, but okay]\n2.",
    "This is the actual call.",
    "3.",
    "??"
  ]
}