{
  "id": 6475,
  "mediaId": 2590,
  "date": "2022-01-27",
  "headline": "A Hard-Right Republican And A Progressive Debated. It Went As Well As You'd Expect.",
  "image": "https://img.huffingtonpost.com/asset/61f369aa250000dc092b0a4b.jpeg?cache=wE9Z9Sdk2x&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/josh-mandel-morgan-harper-debate-ohio_n_61f2d761e4b0061af25c1d08",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    1804,
    2430,
    2599,
    3482,
    305,
    878,
    4916,
    5212
  ],
  "sentences": [
    "Harper, 38, shot back: “What we don’t need to happen is have Josh Mandel talk for the Black community.”\nAt one point, Mandel called Harper a “looney Nancy Pelosi” for “advocating for all this green energy” when Harper pledged to support renewable energy to help mitigate climate change.",
    "Mandel, 44, repeatedly said the Democratic Party “condescends” to people of color like Harper, and he insisted the reason her opponent wouldn’t debate her is because she isn’t a “white male.” Mandel also predicted he would set records for winning Black votes in Ohio’s Senate race.",
    "“Josh Mandel is the swamp.”\n- Democratic Senate candidate Morgan Harper\n“I am scared as a woman, as a Black person, as a daughter who has a mother who lives off of a monthly pension, of getting this guy anywhere near a seat of power in the United States Senate,” Harper said.",
    "“It doesn’t matter whether Josh Mandel is standing in a cornfield calling for an armed insurrection or showing his out-of-touch, anti-worker agenda on the debate stage; he’s wrong for Ohio and doesn’t belong anywhere near the U.S. Senate,” Ryan’s spokesperson Izzi Levy said.",
    "Jay LaPrete/Associated Press\nCOLUMBUS, Ohio — Morgan Harper said she couldn’t get her main opponent in Ohio’s Democratic Senate primary to debate her, so she opted for the furthest thing from him — a candidate on the other side of the aisle.",
    "“I’m pro-God, pro-gun, pro-Trump, and I will fight in Washington with the Constitution in one hand and the Bible in the other.”\n- GOP Senate candidate Josh Mandel\n“I do not believe in separation of church and state.",
    "Mandel, a former state treasurer, has veered hard right in the primary, trafficking in election conspiracies and racist rhetoric to appeal to the Trump base — and Trump himself for a potential endorsement.",
    "Advertisement\nIn the evening’s most bizarre exchange, Mandel insisted there is no separation between church and state in the United States — the literal First Amendment of the Constitution.",
    "She ran then with the backing of Justice Democrats, the group that helped democratic socialist Alexandria Ocasio-Cortez knock off a New York City incumbent to win her congressional seat.",
    "Harper, a progressive underdog, debated far-right Republican Josh Mandel, the presumed front-runner in Ohio’s GOP primary, in an Ohio church on Thursday night.",
    "“I’m pro-God, pro-gun, pro-Trump, and I will fight in Washington with the Constitution in one hand and the Bible in the other,” Mandel said.",
    "Advertisement\nHarper is a staunch progressive who challenged now-Congressional Black Caucus chair Joyce Beatty (D-Ohio) in a 2020 primary.",
    "Republican Josh Mandel, left, and Democrat Morgan Harper, both running for the U.S. Senate in Ohio, debated Thursday night in Columbus.",
    "The founders of this county, the Founding Fathers, they did not believe in the separation of church and state.",
    "Ryan’s campaign said it would debate Harper at some point, but right now it’s more focused on meeting voters.",
    "When you read the United States Constitution, nowhere do you read about the separation of church and state.",
    "Naturally, Harper and Mandel couldn’t be further apart on just about everything.",
    "It does not exist,” he said, followed by an audible gasp from the audience.",
    "Mandel has done much of his campaigning in evangelical churches.",
    "Advertisement\nIt went as well as you might expect.",
    "Way on the other side.",
    "There’s no such thing."
  ]
}