{
  "id": 6567,
  "mediaId": 2629,
  "date": "2022-01-27",
  "headline": "GOP Already Attacking Unnamed SCOTUS Nominee With Racist Dog Whistles",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNTQ5NjQyOS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwMjk1MjgwMn0.F7ZBtGEQmYS3_QSf-YPOlucEp68HS5M5RFTdhWFpLJg/img.jpg?width=1200&coordinates=0%2C57%2C0%2C58&height=600",
  "link": "https://www.nationalmemo.com/scotus",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Israel",
  "authorUrl": "https://www.nationalmemo.com/u/josh-israel",
  "termIds": [
    2201,
    2923,
    3787,
    3975,
    4168,
    682,
    878,
    996,
    1171
  ],
  "sentences": [
    "After former President Donald Trump explicitly promised during his campaign only to nominate to the Supreme Court justices who would overturn Roe v. Wade, during his term in office, Senate Republicans rammed through three far-right nominees — Neil Gorsuch, Brett Kavanaugh, and Amy Coney Barrett.",
    "Given the six Republican-appointed justices on the nine-member Court, who are generally hostile to workers, consumers, voting rights, campaign finance reform, reproductive choice, and the separation of church and state, Breyer's replacement will face a challenging work environment.",
    "\"When you take a look at his nominees for all these other positions, they are radical — and I mean radical — leftists, and I fear that's what he's going to do here for the Supreme Court,\" Wisconsin Sen. Ron Johnson told reporters.",
    "\"We are confident that this nominee will have a demonstrated commitment to equal justice and will protect the rights of all Americans, and we are well prepared for the fight ahead to ensure her speedy confirmation.\"",
    "With 50 Democrats in the Senate and Vice President Kamala Harris able to break ties as president of the chamber, if the majority sticks together, the GOP will not be able to do anything but complain.",
    "\"Joe Biden has failed to be the moderate president he sold to the American people and many of his radical nominees have not reflected American values in any way,\" wrote Kansas Sen. Roger Marshall.",
    "I predict that [Majority Leader] Chuck Schumer and whoever is running the White House will force all Democrats to obey and walk the plank in support of a radical liberal with extremist views.\"",
    "This isn't the time to send a squishy establishment RINO to Washington to sit back and sing kumbaya with Democrats and allow Joe Biden to appoint another justice like Kagan or Sotomayor.\"",
    "Tennessee Sen. Marsha Blackburn said in a statement: \"I will not stand by as President Biden attempts to fill our courts with activist judges who are beholden to progressive interests.",
    "Florida Sen. Rick Scott, who chairs the National Republican Senatorial Committee, released a statement that predicted, \"The Democrats know they will lose the Senate majority in 2022.",
    "I look forward to thoroughly vetting the nominee to see if they are a person of high character who will strictly interpret the Constitution and not make law from the bench.\"",
    "Will this deeply unpopular & divisive president finally reject the radical elements of his party and nominate someone who loves America and believes in the Constitution?\"",
    "\"I call on the President to remember his inauguration pledge of unity and nominate a replacement who will uphold the Constitution and reflect pride in our great nation.\"",
    "\"We are overcome with joy that President Biden will now have a historic opportunity to nominate the nation's first Black woman to a seat on the Supreme Court,\" he wrote.",
    "\"Instead President Biden should honor the Justice's legacy & nominate an experienced jurist who respects the current structure and limited role of the Supreme Court.\"",
    "In a press release, Rakim H. D. Brooks, president of the progressive advocacy group Alliance for Justice, noted the significance of Biden's potential pick.",
    "His latest use of the term comes after the 2020 presidential campaign, during which Biden promised to appoint the first Black woman to the high court.",
    "But due to a 2017 rule change by Senate Republicans, any potential Biden pick would need only a simple majority of senators' votes to be confirmed.",
    "\"There will be pressure from the left to replace Justice Breyer with a partisan who will legislate from the bench,\" said Texas Sen. John Cornyn.",
    "Former Ohio Treasurer Josh Mandel, who is seeking the GOP nomination for the Senate seat being vacated by retiring Ohio Republican Sen.",
    "Justice Stephen Breyer is going to retire, giving President Joe Biden his first chance to appoint someone to the Supreme Court.",
    "Hawley has frequently used the term \"woke\" as a racist dog whistle to dismiss those who work to combat systemic racism.",
    "Sen. John Barrasso (R-WY) told the New York Times that he didn't think the new justice would make much difference.",
    "But Senate Republicans are already smearing potential nominees and resorting to racist dog whistle attacks.",
    "Rob Portman, tweeted, \"The US Senate is our last line of defense against radical leftist SCOTUS justices.",
    "He later added he would oppose anyone he thought would be an \"activist judge.\"",
    "\"Replacing one liberal with another liberal, that's just running in place.\"",
    "\"Or will he continue to tear apart this country w/ a woke activist?\"",
    "Now Senate Republicans are demanding that Biden appoint a moderate.",
    "tweeted Sen. Josh Hawley (R-MO) on Wednesday.",
    "\"Moment of truth for Joe Biden."
  ]
}