[
  {
    "id": 6501,
    "mediaId": 2702,
    "date": "2022-01-21",
    "sentence": "With the former president slow to issue an endorsement in the race a number of heavyweight candidates are actively jockeying for his support, including former state Treasurer Josh Mandel, entrepreneur and author JD Vance and former state GOP Chair <span class='selected-term'>Jane Timken</span>.",
    "author": "Mychael Schnell",
    "title": "These Senate seats are up for election in 2022"
  },
  {
    "id": 6664,
    "mediaId": 6676,
    "date": "2022-01-21",
    "sentence": "With the former president slow to issue an endorsement in the race a number of heavyweight candidates are actively jockeying for his support, including former state Treasurer Josh Mandel, entrepreneur and author JD Vance and former state GOP Chair <span class='selected-term'>Jane Timken</span>.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "These Senate seats are up for election in 2022"
  },
  {
    "id": 6590,
    "mediaId": 2522,
    "date": "2022-01-25",
    "sentence": "Others running in the race include former Ohio treasurer and two-time Senate candidate Josh Mandel; former Ohio GOP Chair <span class='selected-term'>Jane Timken</span>; Cleveland businessman and luxury auto dealership giant Bernie Moreno; 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer, and investment banker; and Matt Dolan, a longtime state lawmaker whose family owns Major League Baseball’s Cleveland Guardians.",
    "author": "Terresa Monroe-Hamilton",
    "title": "JD Vance massively triggers left with glowing MTG endorsement, vow to take country back from ‘scumbags’"
  },
  {
    "id": 6734,
    "mediaId": 2716,
    "date": "2022-01-25",
    "sentence": "Other GOP candidates running for U.S. Senate in Ohio include \"former state Republican Party Chairwoman <span class='selected-term'>Jane Timken</span>, former state Treasurer Josh Mandel, businessman Bernie Moreno and investment banker Mike Gibbons,\" The Hill notes.",
    "author": "Brigid Kennedy",
    "title": "Ohio Senate candidate JD Vance 'honored' to have Marjorie Taylor Greene's endorsement"
  },
  {
    "id": 6451,
    "mediaId": 2636,
    "date": "2022-02-01",
    "sentence": "In Ohio, the Senate race is crowded with wealthy Republican self-funders who have lent or donated money to their own campaigns: Mike Gibbons, an investment banker ($11.4 million); <span class='selected-term'>Jane Timken</span>, a former party chair ($3.5 million); Bernie Moreno, a former car dealer ($3.75 million); and Matt Dolan, whose family owns the Cleveland Guardians ($10.5 million).",
    "author": "",
    "title": "Billionaires and Big Checks Shape Battle for Congress"
  },
  {
    "id": 7206,
    "mediaId": 2636,
    "date": "2022-02-01",
    "sentence": "",
    "author": "Shane Goldmacher, Rachel Shorey",
    "title": "Billionaires and Big Checks Shape Battle for Congress"
  },
  {
    "id": 6384,
    "mediaId": 2572,
    "date": "2022-02-01",
    "sentence": "",
    "author": "",
    "title": "Stefanik slams NY teacher's forced leave, alleges it was for criticizing COVID-19 mask mandate on Facebook"
  },
  {
    "id": 6279,
    "mediaId": 2560,
    "date": "2022-02-02",
    "sentence": "In Ohio, the three highest fundraisers – investment banker Michael Gibbons, former state Republican Party Chairwoman <span class='selected-term'>Jane Timken</span> and car dealer-turned tech executive Bernie Moreno – loaned their campaigns a total of $5.8 million.",
    "author": "Stephanie Akin",
    "title": "5 takeaways from the latest fundraising disclosures"
  },
  {
    "id": 6084,
    "mediaId": 2629,
    "date": "2022-02-03",
    "sentence": "Ohio Republican Senate candidate <span class='selected-term'>Jane Timken</span> is running as a self-proclaimed champion of a \"working class\" agenda.",
    "author": "Josh Israel",
    "title": "GOP Senate Hopeful Touts ‘Working Class’ Agenda — While She Campaigns At Country Clubs"
  },
  {
    "id": 6036,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "Josh Mandel, Mike Gibbons, JD Vance, and <span class='selected-term'>Jane Timken</span> are some of the Republican candidates who remain in the Senate race.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Bernie Moreno Suspends U.S. Senate Campaign"
  },
  {
    "id": 5579,
    "mediaId": 2658,
    "date": "2022-02-04",
    "sentence": "The commercial shows clips of the doctor contradicting himself, then directs viewers to a link to DeSantis’ campaign website to “pre-order your exclusive freedom over Fauci flip-flops today.”\n“Let’s fire Fauci and take back our freedoms,” Ohio Republican Senate candidate <span class='selected-term'>Jane Timken</span> said in an ad titled “Fire Fauci,” which aired last fall.",
    "author": "",
    "title": "Fauci is the villain in new GOP campaign ads"
  },
  {
    "id": 5772,
    "mediaId": 2752,
    "date": "2022-02-07",
    "sentence": "GOP Conference Chair Elise Stefanik endorsed <span class='selected-term'>Jane Timken</span> last month, and shamelessly tried to tie her to Trump’s “America first” movement.",
    "author": "Stephen Robinson",
    "title": "Trump Pretty Sure Josh Mandel Too Unf*ckable For Endorsement"
  },
  {
    "id": 6228,
    "mediaId": 2898,
    "date": "2022-02-07",
    "sentence": "COLUMBUS, Ohio — When <span class='selected-term'>Jane Timken</span> kicked off an eight-week advertising campaign on the Fox News Channel in her bid for the Republican nomination for Senate, she did not focus on immigration, health care or the economy.",
    "author": "",
    "title": "Republicans, wooing Trump voters, make Dr. Anthony Fauci their boogeyman"
  },
  {
    "id": 5827,
    "mediaId": 6435,
    "date": "2022-02-07",
    "sentence": "COLUMBUS, Ohio — When <span class='selected-term'>Jane Timken</span> kicked off an eight-week advertising campaign on the Fox News Channel in her bid for the Republican nomination for Senate, she did not focus on immigration, health care or the economy.",
    "author": "",
    "title": "Republicans, wooing Trump voters, make Dr. Anthony Fauci their boogeyman"
  },
  {
    "id": 6057,
    "mediaId": 6602,
    "date": "2022-02-07",
    "sentence": "COLUMBUS, Ohio — When <span class='selected-term'>Jane Timken</span> kicked off an eight-week advertising campaign on the Fox News Channel in her bid for the Republican nomination for Senate, she did not focus on immigration, health care or the economy.",
    "author": "",
    "title": "Republicans, wooing Trump voters, make Dr. Anthony Fauci their boogeyman"
  },
  {
    "id": 5536,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Luca Cacciatore",
    "title": "Josh Mandel, Jane Timken Slam Cincinnati Bell for Dropping Newsmax"
  },
  {
    "id": 5861,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Luca Cacciatore",
    "title": "Jane Timken to Newsmax: 'I Stood Up and Delivered for President Trump'"
  },
  {
    "id": 5582,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Luca Cacciatore",
    "title": "Josh Mandel, Jane Timken Slam Cincinnati Bell for Dropping Newsmax"
  },
  {
    "id": 5668,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "The two other candidates who have received major media attention, former state Republican Party Chairwoman <span class='selected-term'>Jane Timken</span> and Vance, were in fourth and fifth with 6% and 5% support, respectively.",
    "author": "Michael Ginsberg",
    "title": "New Ohio Senate Poll Shows More Bad News For JD Vance"
  },
  {
    "id": 5091,
    "mediaId": 2629,
    "date": "2022-02-13",
    "sentence": "As the New York Times reports, \"Fire Fauci\" became the inaugural ad for <span class='selected-term'>Jane Timken</span> last fall as she launched her bid to win Ohio's open Senate seat.",
    "author": "",
    "title": "Republican Candidates Vilifying Fauci To Excite Their Base Voters"
  },
  {
    "id": 4708,
    "mediaId": 2547,
    "date": "2022-02-14",
    "sentence": "As the New York Times reports, \"Fire Fauci\" became the inaugural ad for <span class='selected-term'>Jane Timken</span> last fall as she launched her bid to win Ohio's open Senate seat.",
    "author": "Kerry Eleveld",
    "title": "GOP Candidates Vilify Fauci To Rile Their Base"
  },
  {
    "id": 4767,
    "mediaId": 2636,
    "date": "2022-02-14",
    "sentence": "The Palm Beach gathering is expected to draw candidates vying for Republican congressional nominations, including Herschel Walker (who is running for Senate in Georgia), Katie Britt (Senate in Alabama), <span class='selected-term'>Jane Timken</span> (Senate in Ohio) and Morgan Ortagus (House in Tennessee).",
    "author": "",
    "title": "How One of the Most At-Risk Democrats in Congress Hangs On"
  },
  {
    "id": 4844,
    "mediaId": 2537,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Jane Timken",
    "title": "Opinion: Disdain for law enforcement in this country must end"
  },
  {
    "id": 4935,
    "mediaId": 2537,
    "date": "2022-02-16",
    "sentence": "",
    "author": "",
    "title": "$1 for 6 Months."
  },
  {
    "id": 4961,
    "mediaId": 2745,
    "date": "2022-02-16",
    "sentence": "Rob Portman (R-Ohio) on Wednesday endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> in the race to succeed him, calling Timken “the best candidate to advance conservative Republican policies to help Ohio workers and families.”\nTimken has touted herself in TV ads as a “Trump conservative” and is one of several Republican candidates who have worked furiously to prove their fealty to the former president.",
    "author": "",
    "title": "Ohio’s Sen. Portman backs former state GOP chair Jane Timken in race to succeed him"
  },
  {
    "id": 4703,
    "mediaId": 2728,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "Julie Carr Smyth",
    "title": "GOP’s Rob Portman backs Timken to succeed him in US Senate"
  },
  {
    "id": 4731,
    "mediaId": 2580,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "Associated Press",
    "title": "GOP’s Rob Portman backs Timken to succeed him in US Senate"
  },
  {
    "id": 4585,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "",
    "title": "GOP Sen. Rob Portman Endorses Jane Timken for His Seat"
  },
  {
    "id": 5041,
    "mediaId": 2702,
    "date": "2022-02-16",
    "sentence": "Rob Portman (R-Ohio) will back former Ohio Republican Party Chairwoman <span class='selected-term'>Jane Timken</span> as his chosen successor in an attempt to boost her through a crowded GOP field later this year.",
    "author": "",
    "title": "Portman backs Timken as successor in Ohio"
  },
  {
    "id": 5061,
    "mediaId": 2702,
    "date": "2022-02-18",
    "sentence": "Ohio Republican Senate candidate <span class='selected-term'>Jane Timken</span> hit her male primary rivals in a new ad released on Friday, touting her support for former President Trump while accusing the other challengers of being like men who “overcompensate.”\n“We all know guys who overcompensate for their inadequacies, and that description fits the guys in the Senate race to a tee,” Timken said in the ad, standing beside photos of fellow primary contenders Mike Gibbons, J.D.",
    "author": "Julia Manchester",
    "title": "Ohio’s Jane Timken hits male rivals ‘who overcompensate for their inadequacies’"
  },
  {
    "id": 4651,
    "mediaId": 2745,
    "date": "2022-02-21",
    "sentence": "The nod might go to a more establishment candidate, such as former state party chair <span class='selected-term'>Jane Timken</span>, who has Portman’s endorsement.",
    "author": "",
    "title": "Opinion: J.D. Vance’s attack on Gen. Barry McCaffrey is obscene. It’s also not unusual for today’s GOP."
  },
  {
    "id": 4746,
    "mediaId": 2745,
    "date": "2022-02-22",
    "sentence": "As Russia moved closer to an invasion, <span class='selected-term'>Jane Timken</span>, the former state GOP chair, put out a statement late Monday sharply condemning Russian leader Vladimir Putin’s moves, casting them as a threat to U.S. national security and calling for a tough U.S. response to them.",
    "author": "",
    "title": "Opinion: J.D. Vance’s repulsive spin about Putin and Ukraine faces a new test"
  },
  {
    "id": 5217,
    "mediaId": 6676,
    "date": "2022-02-24",
    "sentence": "He’s walking all over you and our allies.”\nAnd on the campaign trail, Ohio Senate GOP candidate <span class='selected-term'>Jane Timken</span> said “the U.S. must respond with strength and stand with Ukraine.”\nThose statements fall largely within a historical GOP tenet that a foreign policy guided by robust involvement overseas best keeps America safe.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "Ukraine poses test for fractured GOP"
  },
  {
    "id": 4522,
    "mediaId": 2753,
    "date": "2022-03-01",
    "sentence": "— Martha MacCallum (@marthamaccallum) February 25, 2022\n“Incredibly convenient for Joe Biden that the ‘science’ of mask mandates in the Capitol changed right before his #SOTU tonight so as to not ruin the photo op,” U.S. Senate candidate <span class='selected-term'>Jane Timken</span> said Tuesday.",
    "author": "WND News Services",
    "title": "Education activists: Dems' flip-flop on mask mandates motivated by 'political science'"
  },
  {
    "id": 4143,
    "mediaId": 2522,
    "date": "2022-03-02",
    "sentence": "— Martha MacCallum (@marthamaccallum) February 25, 2022\n“Incredibly convenient for Joe Biden that the ‘science’ of mask mandates in the Capitol changed right before his #SOTU tonight so as to not ruin the photo op,” U.S. Senate candidate <span class='selected-term'>Jane Timken</span> said Tuesday.",
    "author": "BPR Wire",
    "title": "Democrats blasted for flip-flop on mask mandates – motivated by ‘political science’"
  },
  {
    "id": 3663,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "“<span class='selected-term'>Jane Timken</span> is comfortable with establishment Republicans who make up a faction of our party, and with strong Trump Republicans who also are an important faction of our party, and that’s been true since becoming party chair,” he said.",
    "author": "",
    "title": "Trump endorsement casts long shadow over Ohio Senate race"
  },
  {
    "id": 4000,
    "mediaId": 2528,
    "date": "2022-03-03",
    "sentence": "Former Ohio Republican Party Chairwoman <span class='selected-term'>Jane Timken</span>, state Sen. Matt Dolan, and investment banker Mike Gibbon are also running for the seat.",
    "author": "Kayla Epstein",
    "title": "These 9 Senate races hold the key to who will control Joe Biden's agenda after the midterm elections in November"
  },
  {
    "id": 3908,
    "mediaId": 2550,
    "date": "2022-03-03",
    "sentence": "OH-Sen: NBC's Henry Gomez reports that former state party chair <span class='selected-term'>Jane Timken</span>, who has mostly directed her TV ads at Fox News until now, is spending six figures on her first broadcast spot for the May Republican primary.",
    "author": "",
    "title": "Morning Digest: A day after being forced into surprise runoff, Texas congressman quits amid scandal"
  },
  {
    "id": 3318,
    "mediaId": 2537,
    "date": "2022-03-07",
    "sentence": "After <span class='selected-term'>Jane Timken</span> gave a stump speech lambasting inflation, illegal immigration and the \"indoctrination of our children,\" U.S. Sen.",
    "author": "Haley BeMiller",
    "title": "With Portman endorsement, Ohio Senate candidate Jane Timken juggles opposing GOP factions"
  },
  {
    "id": 3535,
    "mediaId": 3987,
    "date": "2022-03-09",
    "sentence": "The failed “walls” of anti-immigrant rhetoric\nOhio GOP Senate Primary Candidates Bash Immigrants, While Ohio and American Businesses Rely on Immigrant Workers\nLatino Los Angeles To win the Latino Vote, Keep your Promises\nBy Maribel Hastings\nMarch 08, 2022\nMSNBC News Title 42, the Ukrainian refugee crisis, and U.S. immigration policy\nBy Jose Diaz Balart\nMarch 08, 2022\nBloomberg Green Card Backlog Fix Dropped From Lawmakers’ Budget Dea\nBy Ellen M. Gilmer\nMarch 09, 2022\nLatino Rebels Democratic Senators Introduce RELIEF Act for Green Card Backlog\nBy Pablo Manríquez\nMarch 08, 2022\nThe Columbus Dispatch With Portman endorsement, Ohio Senate candidate <span class='selected-term'>Jane Timken</span> juggles opposing GOP factions\nBy Haley Bemiller\nMarch 08, 2022\nWashington Post The Trailer: An emerging GOP agenda: Fight the “enemy within”\nBy David Weigel\nMarch 08, 2022\nPolitico Biden’s poll numbers bounce out of State of the Union, Ukraine crisis\nBy Steven Shepard\nMarch 08, 2022\nNew York Times For this border crisis, Poles extend a warm welcome, unlike last time.",
    "author": "Agencia EFE",
    "title": "Immigration Reform News March 9, 2022 / Qué Pasa En Inmigración"
  },
  {
    "id": 3038,
    "mediaId": 2702,
    "date": "2022-03-12",
    "sentence": "",
    "author": "Brad Dress",
    "title": "Bipartisan group of senators to meet with officials, visit refugee sites in Poland"
  },
  {
    "id": 3618,
    "mediaId": 2702,
    "date": "2022-03-12",
    "sentence": "",
    "author": "Caroline Vakil",
    "title": "??Sunday shows preview: Russian invasion in Ukraine extends into third week"
  },
  {
    "id": 3046,
    "mediaId": 2550,
    "date": "2022-03-14",
    "sentence": "Their new commercial declares that one of Vladimir Putin's \"old oligarchs partnered with <span class='selected-term'>Jane Timken</span>'s family business to build high-capacity freight rail cars, supplying Putin's government with military-grade machinery.\"",
    "author": "",
    "title": "Morning Digest: Renegade Washington Democrat who bolstered GOP for years finally calls it quits"
  },
  {
    "id": 2813,
    "mediaId": 2594,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Eric Garcia",
    "title": "How the war in Ukraine is affecting Republican primaries"
  },
  {
    "id": 3005,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "“You don’t know squat,” Gibbons is heard jabbing at the former state treasurer’s experience in the private sector, after which Mandel, a veteran, responds, “Two tours in Iraq, don’t tell me I haven’t worked.”\nThe men repeatedly told each other to back off before standing eye-to-eye for several seconds, while fellow GOP debate participants Matt Dolan, <span class='selected-term'>Jane Timken</span> and JD Vance looked on awkwardly.",
    "author": "",
    "title": "Ohio GOP Senate debate turns nasty as Gibbons and Mandel go nose-to-nose"
  },
  {
    "id": 2371,
    "mediaId": 2528,
    "date": "2022-03-19",
    "sentence": "The debate was attended by other GOP primary candidates JD Vance, Matt Dolan, and <span class='selected-term'>Jane Timken</span>, who looked on as the exchange unfolded.",
    "author": "Kelsey Vlamis",
    "title": "2 GOP frontrunners in the Ohio Senate race squared off during a heated debate moment: 'You watch what happens'"
  },
  {
    "id": 2050,
    "mediaId": 2748,
    "date": "2022-03-19",
    "sentence": "Four others, former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> (9%), State Sen. Matt Dolan (7%), businessman Neil Patel (2%), and businessman Mark Pukita (1%), all checked in at under 10%.",
    "author": "STATION GOSSIP",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 1914,
    "mediaId": 2662,
    "date": "2022-03-19",
    "sentence": "Four others, former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> (9%), State Sen. Matt Dolan (7%), businessman Neil Patel (2%), and businessman Mark Pukita (1%), all checked in at under 10%.",
    "author": "Julian Conradson",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 2738,
    "mediaId": 2650,
    "date": "2022-03-20",
    "sentence": "Former Ohio Republican Party Chair <span class='selected-term'>Jane Timken</span>, also running in the Senate primary, echoed Vance’s verdict, calling the event “embarrassing.” Matt Dolan, another GOP candidate, said Ohio voters deserved better.",
    "author": "Rick Moran",
    "title": "Watch: GOP Ohio Senate Race Heats Up With Near On-Stage Brawl Between Gibbons and Mandel"
  },
  {
    "id": 1854,
    "mediaId": 2550,
    "date": "2022-03-20",
    "sentence": "The ad claims that Vladimir Putin's old oligarchs partnered with <span class='selected-term'>Jane Timken</span>'s family business to build high capacity freight rail cards.",
    "author": "",
    "title": "The Downballot: Voting rights and criminal justice are on your local ballot this year (transcript)"
  },
  {
    "id": 2304,
    "mediaId": 2727,
    "date": "2022-03-21",
    "sentence": "Advertisement\n“While others made a mockery of themselves with their phony tough guy antics, I focused on engaging with the voters,” he said, “honing in on the real problems that Ohioans face and providing true solutions that may make life better for working- and middle-class Americans.”\nFormer Ohio Republican Party chair <span class='selected-term'>Jane Timken</span>, another GOP candidate in the Senate race, said she would lead with “grit and grace” if elected.",
    "author": "AP and TOI staff",
    "title": "Near-fight at Ohio GOP Senate debate between candidates Josh Mandel, Mike Gibbons"
  },
  {
    "id": 2346,
    "mediaId": 2748,
    "date": "2022-03-21",
    "sentence": "Trump has supported <span class='selected-term'>Jane Timken</span>, though he hasn’t endorsed anyone officially\nDifferent angle, view from the audience…",
    "author": "Blarp Blog",
    "title": "Ohio U.S. Senate debate goes off the rails… Josh Mandel almost comes to blows…"
  },
  {
    "id": 1932,
    "mediaId": 2537,
    "date": "2022-03-22",
    "sentence": "Gibbons was addressing questions about a previous interview, in which he said former Ohio Republican Party chair and GOP Senate challenger <span class='selected-term'>Jane Timken</span> \"barely worked\" and insinuated that her money comes from her husband.",
    "author": "Haley BeMiller",
    "title": "Gender dominates GOP Ohio Senate debate as Mike Gibbons dismisses women's oppression"
  },
  {
    "id": 1966,
    "mediaId": 2528,
    "date": "2022-03-24",
    "sentence": "Hicks was there for McCormick, and Bossie for <span class='selected-term'>Jane Timken</span>, an Ohio Senate GOP candidate.",
    "author": "Jake Lahut",
    "title": "Trump consultants are making $10,000 per month advising candidates seeking the former president's endorsement: WaPo"
  },
  {
    "id": 1980,
    "mediaId": 2540,
    "date": "2022-03-27",
    "sentence": "Others in the race include former state GOP chair <span class='selected-term'>Jane Timken</span> and state Sen. Matt Dolan.",
    "author": "Simone Pathe",
    "title": "The 10 Senate seats most likely to flip in 2022"
  },
  {
    "id": 2011,
    "mediaId": 2740,
    "date": "2022-03-28",
    "sentence": "Among them are former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span>, Ohio State Sen. Matt Dolan, Cleveland businessman Mike Gibbons and former Ohio treasurer Josh Mandel.",
    "author": "Orlando Mayorquin",
    "title": "Ohio Senate race: What to know about JD Vance, venture capitalist running for office"
  },
  {
    "id": 2360,
    "mediaId": 2553,
    "date": "2022-03-28",
    "sentence": "Ohio Republican Senate candidate <span class='selected-term'>Jane Timken</span> blasted the NCAA and Democrats over transgender swimmer Lia Thomas competing in women’s sports in a new campaign ad released on Monday.",
    "author": "Dillon Burroughs",
    "title": "GOP Senate Candidate Blasts Transgender Swimmer Lia Thomas Competing In Women’s Sports In New Campaign Ad"
  },
  {
    "id": 2215,
    "mediaId": 2919,
    "date": "2022-03-28",
    "sentence": "",
    "author": "Courtney Shaw",
    "title": "Ohio's 7 Republican Senate hopefuls face off in debate at Central State University"
  },
  {
    "id": 2470,
    "mediaId": 2702,
    "date": "2022-03-28",
    "sentence": "Ohio Republican Senate candidate <span class='selected-term'>Jane Timken</span> invoked Lia Thomas in a new campaign ad criticizing rules allowing transgender women being allowed to compete in women’s sports.",
    "author": "Julia Manchester",
    "title": "Timken invokes Lia Thomas in new Ohio Senate ad"
  },
  {
    "id": 2127,
    "mediaId": 2550,
    "date": "2022-03-29",
    "sentence": "Former state party chair <span class='selected-term'>Jane Timken</span>, meanwhile, is emphasizing her support for transphobia in her newest ad, something that other Republicans across the country have already worked into their own spots.",
    "author": "",
    "title": "Morning Digest: Both Republican senators in Louisiana eye fleeing D.C. for governor's mansion"
  },
  {
    "id": 2571,
    "mediaId": 2532,
    "date": "2022-03-30",
    "sentence": "Former Ohio GOP state chair <span class='selected-term'>Jane Timken</span> is slated to visit Mar-a-Lago next week, according to a source familiar.",
    "author": "",
    "title": "Trump has endorsed nearly 130 candidates for 2022, testing his influence in the Republican Party"
  },
  {
    "id": 1376,
    "mediaId": 2921,
    "date": "2022-04-01",
    "sentence": "Now, Ohio's <span class='selected-term'>Jane Timken</span> (R), who's running for the open U.S. Senate seat, is releasing a new ad solely on the threat to girls' sports.",
    "author": "Tony Perkins",
    "title": "Republicans even the score on girls' sports"
  },
  {
    "id": 1172,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Other primary candidates include investment banker Mike Gibbons, former Ohio treasurer Josh Mandel, and <span class='selected-term'>Jane Timken</span>, the former chair of the Ohio Republican Party.",
    "author": "Gustaf Kilander",
    "title": "JD Vance accused of racism over new campaign ad in which he asks ‘Do you hate Mexicans?’"
  },
  {
    "id": 1389,
    "mediaId": 2560,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary – Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair <span class='selected-term'>Jane Timken</span> and Vance – scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 956,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair <span class='selected-term'>Jane Timken</span> and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "Via AP news wire",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 1620,
    "mediaId": 2680,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair <span class='selected-term'>Jane Timken</span> and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 1246,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary - Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair <span class='selected-term'>Jane Timken</span> and Vance - scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open U.S. Senate seat"
  },
  {
    "id": 1241,
    "mediaId": 2822,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair <span class='selected-term'>Jane Timken</span> and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH - Associated Press",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 597,
    "mediaId": 2658,
    "date": "2022-04-11",
    "sentence": "At least two other Republican women running for Senate, Katie Britt in Alabama and <span class='selected-term'>Jane Timken</span> in Ohio, have since followed Hartzler’s lead and released their own ads touching on women’s sports.",
    "author": "",
    "title": "Greitens’ fade reorders Missouri Senate race"
  },
  {
    "id": 459,
    "mediaId": 2731,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Jane Timken",
    "title": "Ohio Bakery Case A Win Against The Woke Mob"
  },
  {
    "id": 101,
    "mediaId": 2641,
    "date": "2022-04-12",
    "sentence": "In 2020, when other states didn’t do the necessary work to make sure elections were safe and secure, <span class='selected-term'>Jane Timken</span> did, and Ohio delivered by more than 8.5 points for President Trump — an increased margin from 2016.",
    "author": "Bernard Kerik",
    "title": "In a Field of Buckeye State Pretenders, Timken Is the Real Deal"
  },
  {
    "id": 707,
    "mediaId": 2645,
    "date": "2022-04-13",
    "sentence": "OAN Newsroom\nOhio Senate candidate <span class='selected-term'>Jane Timken</span> released a new ad in which she blamed President Joe Biden for the massive increase in inflation.",
    "author": "",
    "title": "Senate candidate Timken says it’s time to balance the budget like Ohio families do"
  },
  {
    "id": 439,
    "mediaId": 2680,
    "date": "2022-04-14",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer Josh Mandel, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "GOP leaders in Ohio try to block Trump endorsement of Vance"
  },
  {
    "id": 616,
    "mediaId": 2550,
    "date": "2022-04-14",
    "sentence": "OH-Sen: Former GOP chair <span class='selected-term'>Jane Timken</span> avoids going after any of her many intra-party rivals in her new spot for the May 3 primary and instead blames Joe Biden for inflation.",
    "author": "",
    "title": "Morning Digest: The ugliest GOP primary might just be in Alabama's race for governor"
  },
  {
    "id": 854,
    "mediaId": 2680,
    "date": "2022-04-15",
    "sentence": "The decision marks a major blow for Vance's top rivals — former state treasurer Josh Mandel, investment banker Mike Gibbons and former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> — who have been locked in a heated and contentious race for both the nomination and Trump's backing in a primary that is now less than three weeks away.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 629,
    "mediaId": 2721,
    "date": "2022-04-15",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer Josh Mandel, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "",
    "title": "Trump to make huge announcement; GOP unhappy?"
  },
  {
    "id": 298,
    "mediaId": 2919,
    "date": "2022-04-15",
    "sentence": "Vance has been locked in a heated race against former state treasurer Josh Mandel, investment banker Mike Gibbons, former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span>, and state Sen. Matt Dolan, whose family owns the Cleveland Guardians.",
    "author": "Associated Press",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 563,
    "mediaId": 2640,
    "date": "2022-04-15",
    "sentence": "Sources tell Politico that businessman Mike Gibbons, slightly ahead of Mandel in recent polling, isn't on Trump's \"radar\" and that Trump doesn't want to endorse <span class='selected-term'>Jane Timken</span>, who reportedly tried to portray Trump's endorsement of her for state GOP chair in 2017 as endorsement in the Senate race.",
    "author": "Rob Quinn",
    "title": "To Dismay of Many, Trump Makes His Pick in Ohio"
  },
  {
    "id": 212,
    "mediaId": 2919,
    "date": "2022-04-19",
    "sentence": "A <span class='selected-term'>Jane Timken</span> spokesperson issued the following statement on the subject:\n“This is about standing up for fundamental fairness in girls’ sports.",
    "author": "Catherine Ross",
    "title": "North Canton City Schools address criticism of campaign ad filmed at Hoover High School"
  },
  {
    "id": 83,
    "mediaId": 2660,
    "date": "2022-04-20",
    "sentence": "",
    "author": "Jon Greenberg",
    "title": "Biden’s American Rescue Plan fueled inflation. So did post-COVID shortages"
  },
  {
    "id": 395,
    "mediaId": 2514,
    "date": "2022-04-22",
    "sentence": "Businessman Mike Gibbons appears to have inched out a slight lead over a field of similarly Trump-aligned GOP candidates that includes former Ohio Treasurer Josh Mandel, former Ohio GOP chair <span class='selected-term'>Jane Timken</span> and venture capitalist JD Vance.",
    "author": "Orlando Mayorquin",
    "title": "Who is Mike Gibbons? What to know about businessman leading Ohio GOP Senate primary polls"
  },
  {
    "id": 282,
    "mediaId": 2642,
    "date": "2022-04-22",
    "sentence": "Candidates like Josh Mandel, Mike Gibbons, <span class='selected-term'>Jane Timken</span>, and Vance have been battling it out in the primary.",
    "author": "WD Staff",
    "title": "Ohio Rallygoers Advised Not To Attend President Donald Trump Saturday Event Over JD Vance Endorsement?"
  }
]