[
  {
    "id": 6451,
    "mediaId": 2636,
    "date": "2022-02-01",
    "sentence": "In Ohio, the Senate race is crowded with wealthy Republican self-funders who have lent or donated money to their own campaigns: Mike Gibbons, an investment banker ($11.4 million); <span class='selected-term'>Jane Timken</span>, a former party chair ($3.5 million); Bernie Moreno, a former car dealer ($3.75 million); and Matt Dolan, whose family owns the Cleveland Guardians ($10.5 million).",
    "author": "",
    "title": "Billionaires and Big Checks Shape Battle for Congress"
  },
  {
    "id": 5668,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "The two other candidates who have received major media attention, former state Republican Party Chairwoman <span class='selected-term'>Jane Timken</span> and Vance, were in fourth and fifth with 6% and 5% support, respectively.",
    "author": "Michael Ginsberg",
    "title": "New Ohio Senate Poll Shows More Bad News For JD Vance"
  },
  {
    "id": 4961,
    "mediaId": 2745,
    "date": "2022-02-16",
    "sentence": "Rob Portman (R-Ohio) on Wednesday endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> in the race to succeed him, calling Timken “the best candidate to advance conservative Republican policies to help Ohio workers and families.”\nTimken has touted herself in TV ads as a “Trump conservative” and is one of several Republican candidates who have worked furiously to prove their fealty to the former president.",
    "author": "",
    "title": "Ohio’s Sen. Portman backs former state GOP chair Jane Timken in race to succeed him"
  },
  {
    "id": 4585,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "",
    "title": "GOP Sen. Rob Portman Endorses Jane Timken for His Seat"
  },
  {
    "id": 4703,
    "mediaId": 2728,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "Julie Carr Smyth",
    "title": "GOP’s Rob Portman backs Timken to succeed him in US Senate"
  },
  {
    "id": 4731,
    "mediaId": 2580,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "Associated Press",
    "title": "GOP’s Rob Portman backs Timken to succeed him in US Senate"
  },
  {
    "id": 3663,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "“<span class='selected-term'>Jane Timken</span> is comfortable with establishment Republicans who make up a faction of our party, and with strong Trump Republicans who also are an important faction of our party, and that’s been true since becoming party chair,” he said.",
    "author": "",
    "title": "Trump endorsement casts long shadow over Ohio Senate race"
  },
  {
    "id": 3005,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "“You don’t know squat,” Gibbons is heard jabbing at the former state treasurer’s experience in the private sector, after which Mandel, a veteran, responds, “Two tours in Iraq, don’t tell me I haven’t worked.”\nThe men repeatedly told each other to back off before standing eye-to-eye for several seconds, while fellow GOP debate participants Matt Dolan, <span class='selected-term'>Jane Timken</span> and JD Vance looked on awkwardly.",
    "author": "",
    "title": "Ohio GOP Senate debate turns nasty as Gibbons and Mandel go nose-to-nose"
  },
  {
    "id": 2215,
    "mediaId": 2919,
    "date": "2022-03-28",
    "sentence": "",
    "author": "Courtney Shaw",
    "title": "Ohio's 7 Republican Senate hopefuls face off in debate at Central State University"
  },
  {
    "id": 439,
    "mediaId": 2680,
    "date": "2022-04-14",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer Josh Mandel, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "GOP leaders in Ohio try to block Trump endorsement of Vance"
  },
  {
    "id": 298,
    "mediaId": 2919,
    "date": "2022-04-15",
    "sentence": "Vance has been locked in a heated race against former state treasurer Josh Mandel, investment banker Mike Gibbons, former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span>, and state Sen. Matt Dolan, whose family owns the Cleveland Guardians.",
    "author": "Associated Press",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 629,
    "mediaId": 2721,
    "date": "2022-04-15",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer Josh Mandel, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "",
    "title": "Trump to make huge announcement; GOP unhappy?"
  }
]