[
  {
    "id": 6384,
    "mediaId": 2572,
    "date": "2022-02-01",
    "sentence": "",
    "author": "",
    "title": "Stefanik slams NY teacher's forced leave, alleges it was for criticizing COVID-19 mask mandate on Facebook"
  },
  {
    "id": 6084,
    "mediaId": 2629,
    "date": "2022-02-03",
    "sentence": "Ohio Republican Senate candidate <span class='selected-term'>Jane Timken</span> is running as a self-proclaimed champion of a \"working class\" agenda.",
    "author": "Josh Israel",
    "title": "GOP Senate Hopeful Touts ‘Working Class’ Agenda — While She Campaigns At Country Clubs"
  },
  {
    "id": 5582,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Luca Cacciatore",
    "title": "Josh Mandel, Jane Timken Slam Cincinnati Bell for Dropping Newsmax"
  },
  {
    "id": 5536,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Luca Cacciatore",
    "title": "Josh Mandel, Jane Timken Slam Cincinnati Bell for Dropping Newsmax"
  },
  {
    "id": 4961,
    "mediaId": 2745,
    "date": "2022-02-16",
    "sentence": "Rob Portman (R-Ohio) on Wednesday endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> in the race to succeed him, calling Timken “the best candidate to advance conservative Republican policies to help Ohio workers and families.”\nTimken has touted herself in TV ads as a “Trump conservative” and is one of several Republican candidates who have worked furiously to prove their fealty to the former president.",
    "author": "",
    "title": "Ohio’s Sen. Portman backs former state GOP chair Jane Timken in race to succeed him"
  },
  {
    "id": 4731,
    "mediaId": 2580,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "Associated Press",
    "title": "GOP’s Rob Portman backs Timken to succeed him in US Senate"
  },
  {
    "id": 4703,
    "mediaId": 2728,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "Julie Carr Smyth",
    "title": "GOP’s Rob Portman backs Timken to succeed him in US Senate"
  },
  {
    "id": 4585,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "",
    "title": "GOP Sen. Rob Portman Endorses Jane Timken for His Seat"
  },
  {
    "id": 3005,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "“You don’t know squat,” Gibbons is heard jabbing at the former state treasurer’s experience in the private sector, after which Mandel, a veteran, responds, “Two tours in Iraq, don’t tell me I haven’t worked.”\nThe men repeatedly told each other to back off before standing eye-to-eye for several seconds, while fellow GOP debate participants Matt Dolan, <span class='selected-term'>Jane Timken</span> and JD Vance looked on awkwardly.",
    "author": "",
    "title": "Ohio GOP Senate debate turns nasty as Gibbons and Mandel go nose-to-nose"
  },
  {
    "id": 1914,
    "mediaId": 2662,
    "date": "2022-03-19",
    "sentence": "Four others, former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> (9%), State Sen. Matt Dolan (7%), businessman Neil Patel (2%), and businessman Mark Pukita (1%), all checked in at under 10%.",
    "author": "Julian Conradson",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 2738,
    "mediaId": 2650,
    "date": "2022-03-20",
    "sentence": "Former Ohio Republican Party Chair <span class='selected-term'>Jane Timken</span>, also running in the Senate primary, echoed Vance’s verdict, calling the event “embarrassing.” Matt Dolan, another GOP candidate, said Ohio voters deserved better.",
    "author": "Rick Moran",
    "title": "Watch: GOP Ohio Senate Race Heats Up With Near On-Stage Brawl Between Gibbons and Mandel"
  },
  {
    "id": 2304,
    "mediaId": 2727,
    "date": "2022-03-21",
    "sentence": "Advertisement\n“While others made a mockery of themselves with their phony tough guy antics, I focused on engaging with the voters,” he said, “honing in on the real problems that Ohioans face and providing true solutions that may make life better for working- and middle-class Americans.”\nFormer Ohio Republican Party chair <span class='selected-term'>Jane Timken</span>, another GOP candidate in the Senate race, said she would lead with “grit and grace” if elected.",
    "author": "AP and TOI staff",
    "title": "Near-fight at Ohio GOP Senate debate between candidates Josh Mandel, Mike Gibbons"
  },
  {
    "id": 101,
    "mediaId": 2641,
    "date": "2022-04-12",
    "sentence": "In 2020, when other states didn’t do the necessary work to make sure elections were safe and secure, <span class='selected-term'>Jane Timken</span> did, and Ohio delivered by more than 8.5 points for President Trump — an increased margin from 2016.",
    "author": "Bernard Kerik",
    "title": "In a Field of Buckeye State Pretenders, Timken Is the Real Deal"
  },
  {
    "id": 282,
    "mediaId": 2642,
    "date": "2022-04-22",
    "sentence": "Candidates like Josh Mandel, Mike Gibbons, <span class='selected-term'>Jane Timken</span>, and Vance have been battling it out in the primary.",
    "author": "WD Staff",
    "title": "Ohio Rallygoers Advised Not To Attend President Donald Trump Saturday Event Over JD Vance Endorsement?"
  },
  {
    "id": 395,
    "mediaId": 2514,
    "date": "2022-04-22",
    "sentence": "Businessman Mike Gibbons appears to have inched out a slight lead over a field of similarly Trump-aligned GOP candidates that includes former Ohio Treasurer Josh Mandel, former Ohio GOP chair <span class='selected-term'>Jane Timken</span> and venture capitalist JD Vance.",
    "author": "Orlando Mayorquin",
    "title": "Who is Mike Gibbons? What to know about businessman leading Ohio GOP Senate primary polls"
  }
]