[
  {
    "id": 6734,
    "mediaId": 2716,
    "date": "2022-01-25",
    "sentence": "Other GOP candidates running for U.S. Senate in Ohio include \"former state Republican Party Chairwoman <span class='selected-term'>Jane Timken</span>, former state Treasurer Josh Mandel, businessman Bernie Moreno and investment banker Mike Gibbons,\" The Hill notes.",
    "author": "Brigid Kennedy",
    "title": "Ohio Senate candidate JD Vance 'honored' to have Marjorie Taylor Greene's endorsement"
  },
  {
    "id": 5536,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Luca Cacciatore",
    "title": "Josh Mandel, Jane Timken Slam Cincinnati Bell for Dropping Newsmax"
  },
  {
    "id": 5582,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Luca Cacciatore",
    "title": "Josh Mandel, Jane Timken Slam Cincinnati Bell for Dropping Newsmax"
  },
  {
    "id": 5668,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "The two other candidates who have received major media attention, former state Republican Party Chairwoman <span class='selected-term'>Jane Timken</span> and Vance, were in fourth and fifth with 6% and 5% support, respectively.",
    "author": "Michael Ginsberg",
    "title": "New Ohio Senate Poll Shows More Bad News For JD Vance"
  },
  {
    "id": 3663,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "“<span class='selected-term'>Jane Timken</span> is comfortable with establishment Republicans who make up a faction of our party, and with strong Trump Republicans who also are an important faction of our party, and that’s been true since becoming party chair,” he said.",
    "author": "",
    "title": "Trump endorsement casts long shadow over Ohio Senate race"
  },
  {
    "id": 2371,
    "mediaId": 2528,
    "date": "2022-03-19",
    "sentence": "The debate was attended by other GOP primary candidates JD Vance, Matt Dolan, and <span class='selected-term'>Jane Timken</span>, who looked on as the exchange unfolded.",
    "author": "Kelsey Vlamis",
    "title": "2 GOP frontrunners in the Ohio Senate race squared off during a heated debate moment: 'You watch what happens'"
  },
  {
    "id": 1914,
    "mediaId": 2662,
    "date": "2022-03-19",
    "sentence": "Four others, former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> (9%), State Sen. Matt Dolan (7%), businessman Neil Patel (2%), and businessman Mark Pukita (1%), all checked in at under 10%.",
    "author": "Julian Conradson",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 2738,
    "mediaId": 2650,
    "date": "2022-03-20",
    "sentence": "Former Ohio Republican Party Chair <span class='selected-term'>Jane Timken</span>, also running in the Senate primary, echoed Vance’s verdict, calling the event “embarrassing.” Matt Dolan, another GOP candidate, said Ohio voters deserved better.",
    "author": "Rick Moran",
    "title": "Watch: GOP Ohio Senate Race Heats Up With Near On-Stage Brawl Between Gibbons and Mandel"
  },
  {
    "id": 2011,
    "mediaId": 2740,
    "date": "2022-03-28",
    "sentence": "Among them are former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span>, Ohio State Sen. Matt Dolan, Cleveland businessman Mike Gibbons and former Ohio treasurer Josh Mandel.",
    "author": "Orlando Mayorquin",
    "title": "Ohio Senate race: What to know about JD Vance, venture capitalist running for office"
  },
  {
    "id": 707,
    "mediaId": 2645,
    "date": "2022-04-13",
    "sentence": "OAN Newsroom\nOhio Senate candidate <span class='selected-term'>Jane Timken</span> released a new ad in which she blamed President Joe Biden for the massive increase in inflation.",
    "author": "",
    "title": "Senate candidate Timken says it’s time to balance the budget like Ohio families do"
  }
]