[
  {
    "id": 6664,
    "mediaId": 6676,
    "date": "2022-01-21",
    "sentence": "With the former president slow to issue an endorsement in the race a number of heavyweight candidates are actively jockeying for his support, including former state Treasurer Josh Mandel, entrepreneur and author JD Vance and former state GOP Chair <span class='selected-term'>Jane Timken</span>.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "These Senate seats are up for election in 2022"
  },
  {
    "id": 6501,
    "mediaId": 2702,
    "date": "2022-01-21",
    "sentence": "With the former president slow to issue an endorsement in the race a number of heavyweight candidates are actively jockeying for his support, including former state Treasurer Josh Mandel, entrepreneur and author JD Vance and former state GOP Chair <span class='selected-term'>Jane Timken</span>.",
    "author": "Mychael Schnell",
    "title": "These Senate seats are up for election in 2022"
  },
  {
    "id": 6734,
    "mediaId": 2716,
    "date": "2022-01-25",
    "sentence": "Other GOP candidates running for U.S. Senate in Ohio include \"former state Republican Party Chairwoman <span class='selected-term'>Jane Timken</span>, former state Treasurer Josh Mandel, businessman Bernie Moreno and investment banker Mike Gibbons,\" The Hill notes.",
    "author": "Brigid Kennedy",
    "title": "Ohio Senate candidate JD Vance 'honored' to have Marjorie Taylor Greene's endorsement"
  },
  {
    "id": 6451,
    "mediaId": 2636,
    "date": "2022-02-01",
    "sentence": "In Ohio, the Senate race is crowded with wealthy Republican self-funders who have lent or donated money to their own campaigns: Mike Gibbons, an investment banker ($11.4 million); <span class='selected-term'>Jane Timken</span>, a former party chair ($3.5 million); Bernie Moreno, a former car dealer ($3.75 million); and Matt Dolan, whose family owns the Cleveland Guardians ($10.5 million).",
    "author": "",
    "title": "Billionaires and Big Checks Shape Battle for Congress"
  },
  {
    "id": 6084,
    "mediaId": 2629,
    "date": "2022-02-03",
    "sentence": "Ohio Republican Senate candidate <span class='selected-term'>Jane Timken</span> is running as a self-proclaimed champion of a \"working class\" agenda.",
    "author": "Josh Israel",
    "title": "GOP Senate Hopeful Touts ‘Working Class’ Agenda — While She Campaigns At Country Clubs"
  },
  {
    "id": 6036,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "Josh Mandel, Mike Gibbons, JD Vance, and <span class='selected-term'>Jane Timken</span> are some of the Republican candidates who remain in the Senate race.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Bernie Moreno Suspends U.S. Senate Campaign"
  },
  {
    "id": 5579,
    "mediaId": 2658,
    "date": "2022-02-04",
    "sentence": "The commercial shows clips of the doctor contradicting himself, then directs viewers to a link to DeSantis’ campaign website to “pre-order your exclusive freedom over Fauci flip-flops today.”\n“Let’s fire Fauci and take back our freedoms,” Ohio Republican Senate candidate <span class='selected-term'>Jane Timken</span> said in an ad titled “Fire Fauci,” which aired last fall.",
    "author": "",
    "title": "Fauci is the villain in new GOP campaign ads"
  },
  {
    "id": 5861,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Luca Cacciatore",
    "title": "Jane Timken to Newsmax: 'I Stood Up and Delivered for President Trump'"
  },
  {
    "id": 5668,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "The two other candidates who have received major media attention, former state Republican Party Chairwoman <span class='selected-term'>Jane Timken</span> and Vance, were in fourth and fifth with 6% and 5% support, respectively.",
    "author": "Michael Ginsberg",
    "title": "New Ohio Senate Poll Shows More Bad News For JD Vance"
  },
  {
    "id": 5091,
    "mediaId": 2629,
    "date": "2022-02-13",
    "sentence": "As the New York Times reports, \"Fire Fauci\" became the inaugural ad for <span class='selected-term'>Jane Timken</span> last fall as she launched her bid to win Ohio's open Senate seat.",
    "author": "",
    "title": "Republican Candidates Vilifying Fauci To Excite Their Base Voters"
  },
  {
    "id": 4708,
    "mediaId": 2547,
    "date": "2022-02-14",
    "sentence": "As the New York Times reports, \"Fire Fauci\" became the inaugural ad for <span class='selected-term'>Jane Timken</span> last fall as she launched her bid to win Ohio's open Senate seat.",
    "author": "Kerry Eleveld",
    "title": "GOP Candidates Vilify Fauci To Rile Their Base"
  },
  {
    "id": 4961,
    "mediaId": 2745,
    "date": "2022-02-16",
    "sentence": "Rob Portman (R-Ohio) on Wednesday endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> in the race to succeed him, calling Timken “the best candidate to advance conservative Republican policies to help Ohio workers and families.”\nTimken has touted herself in TV ads as a “Trump conservative” and is one of several Republican candidates who have worked furiously to prove their fealty to the former president.",
    "author": "",
    "title": "Ohio’s Sen. Portman backs former state GOP chair Jane Timken in race to succeed him"
  },
  {
    "id": 4585,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "",
    "title": "GOP Sen. Rob Portman Endorses Jane Timken for His Seat"
  },
  {
    "id": 4731,
    "mediaId": 2580,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "Associated Press",
    "title": "GOP’s Rob Portman backs Timken to succeed him in US Senate"
  },
  {
    "id": 4703,
    "mediaId": 2728,
    "date": "2022-02-16",
    "sentence": "Rob Portman endorsed Republican <span class='selected-term'>Jane Timken</span> on Wednesday from among the crowded GOP field seeking the seat he is vacating next year.",
    "author": "Julie Carr Smyth",
    "title": "GOP’s Rob Portman backs Timken to succeed him in US Senate"
  },
  {
    "id": 5217,
    "mediaId": 6676,
    "date": "2022-02-24",
    "sentence": "He’s walking all over you and our allies.”\nAnd on the campaign trail, Ohio Senate GOP candidate <span class='selected-term'>Jane Timken</span> said “the U.S. must respond with strength and stand with Ukraine.”\nThose statements fall largely within a historical GOP tenet that a foreign policy guided by robust involvement overseas best keeps America safe.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "Ukraine poses test for fractured GOP"
  },
  {
    "id": 4000,
    "mediaId": 2528,
    "date": "2022-03-03",
    "sentence": "Former Ohio Republican Party Chairwoman <span class='selected-term'>Jane Timken</span>, state Sen. Matt Dolan, and investment banker Mike Gibbon are also running for the seat.",
    "author": "Kayla Epstein",
    "title": "These 9 Senate races hold the key to who will control Joe Biden's agenda after the midterm elections in November"
  },
  {
    "id": 3663,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "“<span class='selected-term'>Jane Timken</span> is comfortable with establishment Republicans who make up a faction of our party, and with strong Trump Republicans who also are an important faction of our party, and that’s been true since becoming party chair,” he said.",
    "author": "",
    "title": "Trump endorsement casts long shadow over Ohio Senate race"
  },
  {
    "id": 2813,
    "mediaId": 2594,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Eric Garcia",
    "title": "How the war in Ukraine is affecting Republican primaries"
  },
  {
    "id": 3005,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "“You don’t know squat,” Gibbons is heard jabbing at the former state treasurer’s experience in the private sector, after which Mandel, a veteran, responds, “Two tours in Iraq, don’t tell me I haven’t worked.”\nThe men repeatedly told each other to back off before standing eye-to-eye for several seconds, while fellow GOP debate participants Matt Dolan, <span class='selected-term'>Jane Timken</span> and JD Vance looked on awkwardly.",
    "author": "",
    "title": "Ohio GOP Senate debate turns nasty as Gibbons and Mandel go nose-to-nose"
  },
  {
    "id": 2371,
    "mediaId": 2528,
    "date": "2022-03-19",
    "sentence": "The debate was attended by other GOP primary candidates JD Vance, Matt Dolan, and <span class='selected-term'>Jane Timken</span>, who looked on as the exchange unfolded.",
    "author": "Kelsey Vlamis",
    "title": "2 GOP frontrunners in the Ohio Senate race squared off during a heated debate moment: 'You watch what happens'"
  },
  {
    "id": 1914,
    "mediaId": 2662,
    "date": "2022-03-19",
    "sentence": "Four others, former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> (9%), State Sen. Matt Dolan (7%), businessman Neil Patel (2%), and businessman Mark Pukita (1%), all checked in at under 10%.",
    "author": "Julian Conradson",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 1854,
    "mediaId": 2550,
    "date": "2022-03-20",
    "sentence": "The ad claims that Vladimir Putin's old oligarchs partnered with <span class='selected-term'>Jane Timken</span>'s family business to build high capacity freight rail cards.",
    "author": "",
    "title": "The Downballot: Voting rights and criminal justice are on your local ballot this year (transcript)"
  },
  {
    "id": 2738,
    "mediaId": 2650,
    "date": "2022-03-20",
    "sentence": "Former Ohio Republican Party Chair <span class='selected-term'>Jane Timken</span>, also running in the Senate primary, echoed Vance’s verdict, calling the event “embarrassing.” Matt Dolan, another GOP candidate, said Ohio voters deserved better.",
    "author": "Rick Moran",
    "title": "Watch: GOP Ohio Senate Race Heats Up With Near On-Stage Brawl Between Gibbons and Mandel"
  },
  {
    "id": 2346,
    "mediaId": 2748,
    "date": "2022-03-21",
    "sentence": "Trump has supported <span class='selected-term'>Jane Timken</span>, though he hasn’t endorsed anyone officially\nDifferent angle, view from the audience…",
    "author": "Blarp Blog",
    "title": "Ohio U.S. Senate debate goes off the rails… Josh Mandel almost comes to blows…"
  },
  {
    "id": 2215,
    "mediaId": 2919,
    "date": "2022-03-28",
    "sentence": "",
    "author": "Courtney Shaw",
    "title": "Ohio's 7 Republican Senate hopefuls face off in debate at Central State University"
  },
  {
    "id": 2011,
    "mediaId": 2740,
    "date": "2022-03-28",
    "sentence": "Among them are former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span>, Ohio State Sen. Matt Dolan, Cleveland businessman Mike Gibbons and former Ohio treasurer Josh Mandel.",
    "author": "Orlando Mayorquin",
    "title": "Ohio Senate race: What to know about JD Vance, venture capitalist running for office"
  },
  {
    "id": 1172,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Other primary candidates include investment banker Mike Gibbons, former Ohio treasurer Josh Mandel, and <span class='selected-term'>Jane Timken</span>, the former chair of the Ohio Republican Party.",
    "author": "Gustaf Kilander",
    "title": "JD Vance accused of racism over new campaign ad in which he asks ‘Do you hate Mexicans?’"
  },
  {
    "id": 1246,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary - Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair <span class='selected-term'>Jane Timken</span> and Vance - scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open U.S. Senate seat"
  },
  {
    "id": 1620,
    "mediaId": 2680,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair <span class='selected-term'>Jane Timken</span> and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 1389,
    "mediaId": 2560,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary – Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair <span class='selected-term'>Jane Timken</span> and Vance – scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 956,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair <span class='selected-term'>Jane Timken</span> and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "Via AP news wire",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 1241,
    "mediaId": 2822,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer Josh Mandel, former state Republican chair <span class='selected-term'>Jane Timken</span> and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH - Associated Press",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 707,
    "mediaId": 2645,
    "date": "2022-04-13",
    "sentence": "OAN Newsroom\nOhio Senate candidate <span class='selected-term'>Jane Timken</span> released a new ad in which she blamed President Joe Biden for the massive increase in inflation.",
    "author": "",
    "title": "Senate candidate Timken says it’s time to balance the budget like Ohio families do"
  },
  {
    "id": 629,
    "mediaId": 2721,
    "date": "2022-04-15",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer Josh Mandel, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "",
    "title": "Trump to make huge announcement; GOP unhappy?"
  },
  {
    "id": 854,
    "mediaId": 2680,
    "date": "2022-04-15",
    "sentence": "The decision marks a major blow for Vance's top rivals — former state treasurer Josh Mandel, investment banker Mike Gibbons and former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span> — who have been locked in a heated and contentious race for both the nomination and Trump's backing in a primary that is now less than three weeks away.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 563,
    "mediaId": 2640,
    "date": "2022-04-15",
    "sentence": "Sources tell Politico that businessman Mike Gibbons, slightly ahead of Mandel in recent polling, isn't on Trump's \"radar\" and that Trump doesn't want to endorse <span class='selected-term'>Jane Timken</span>, who reportedly tried to portray Trump's endorsement of her for state GOP chair in 2017 as endorsement in the Senate race.",
    "author": "Rob Quinn",
    "title": "To Dismay of Many, Trump Makes His Pick in Ohio"
  },
  {
    "id": 298,
    "mediaId": 2919,
    "date": "2022-04-15",
    "sentence": "Vance has been locked in a heated race against former state treasurer Josh Mandel, investment banker Mike Gibbons, former Ohio Republican Party chair <span class='selected-term'>Jane Timken</span>, and state Sen. Matt Dolan, whose family owns the Cleveland Guardians.",
    "author": "Associated Press",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 395,
    "mediaId": 2514,
    "date": "2022-04-22",
    "sentence": "Businessman Mike Gibbons appears to have inched out a slight lead over a field of similarly Trump-aligned GOP candidates that includes former Ohio Treasurer Josh Mandel, former Ohio GOP chair <span class='selected-term'>Jane Timken</span> and venture capitalist JD Vance.",
    "author": "Orlando Mayorquin",
    "title": "Who is Mike Gibbons? What to know about businessman leading Ohio GOP Senate primary polls"
  }
]