[
  {
    "id": 26068,
    "mediaId": 2643,
    "date": "2022-02-22",
    "sentence": "A Monday debate between U.S. Ohio Senate candidates <span class='selected-term'>Josh Mandel</span> and Morgan Harper became chaotic following interruptions from a woman in the audience.",
    "author": "Gerrard Kaonga",
    "title": "Josh Mandel Debate Descends into Chaos as Candidate Argues with Audience Member"
  },
  {
    "id": 26370,
    "mediaId": 2522,
    "date": "2022-02-23",
    "sentence": "‘You’re actually dumber than AOC.’\n‘Why are you so angry?’\nDonate to my campaign to keep <span class='selected-term'>Josh Mandel</span>’s hateful, sexist and racist rhetoric out of the Senate.https://t.co/RxdXFeviiB pic.twitter.com/egt7ImPlpy\n— Morgan Harper (@mh4oh) February 22, 2022\n“Last night I debated Josh Mandel in Cleveland,” she said, “and we saw from him what we’ve come to expect, racism, sexism, xenophobia, this guy has no solutions for the real issues that everyday Ohioans are facing and certainly no solutions for the black community,” throwing down the race card.",
    "author": "Chris Donaldson",
    "title": "‘Like AOC only dumber’: Ohio senate debate goes off the rails as racial hate turns to white Marine vet"
  },
  {
    "id": 25711,
    "mediaId": 2522,
    "date": "2022-02-23",
    "sentence": "(Video Credit: Fox News)\nSenate candidate <span class='selected-term'>Josh Mandel</span> (R-OH) clapped back at leftist radicals and Black Lives Matter members who interrupted him and demanded that he leave a church in Cleveland because he is white during an off-the-rails debate with Democratic candidate Morgan Harper.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Marine vet candidate puts BLM crowd in its place after being told to leave debate because he’s white"
  },
  {
    "id": 26092,
    "mediaId": 2614,
    "date": "2022-02-23",
    "sentence": "The debate Monday included only Harper and Mandel.”\nThe second <span class='selected-term'>Josh Mandel</span> v. Morgan Harper debate is going completely off the rails pic.twitter.com/DtZJZxmK40\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nThe moderator asked Mandel about a comment calling Black Lives Matter members “thugs.” Then an audience member interrupted with a loud “uhhhhuh.”\n“You ain’t coming in the Black community.",
    "author": "DrewBerquist.com",
    "title": "Ohio Senate Debate Gets Out Of Hand"
  }
]