[
  {
    "id": 1250,
    "mediaId": 2664,
    "date": "2022-02-15",
    "sentence": "The <span class='selected-term'>Josh Mandel</span> of 2003 — of 2016, even — would not recognize the Josh Mandel of 2021,\" Zimmerman added before admitting, \"This has broken my heart.”\nRepublican donor Brad Kastan believes the aspiring senator has made a big mistake expressing a belief that Mandel is “painting himself into a corner so far out that he can’t win” come November if he gets through the primary.",
    "author": "Tom Boggioni",
    "title": "'This has broken my heart': Josh Mandel called out by former supporters for trying to become the new Trump"
  },
  {
    "id": 9011,
    "mediaId": 2564,
    "date": "2022-03-19",
    "sentence": "Scroll down for video\n+6\nView gallery\nSenate hopefuls Mike Gibbons, 69, (left, standing) and <span class='selected-term'>Josh Mandel</span>, 44, (right) came toe-to-toe at the primary debate after Mandel attacked the father-of-five's financial assets in China, claiming he 'made millions' there\n+6\nView gallery\nMandel appeared irritated toward Gibbons - who's wealth ranges anywhere from $83milllion to $286million - said he didn't 'think I made millions off of anything'\nGibbons went on to say that former Marine 'didn't know squat' because he's never worked in private sector, to which Mandel replied that he had served two tours in Iraq and told the businessman: 'Don't tell me I haven't worked.'",
    "author": "",
    "title": "Should've been boring but... Republican Ohio Senate hopefuls and millionaires Mike Gibbons and Josh Mandel nearly come to blows during primary debate about Chinese petroleum"
  },
  {
    "id": 8941,
    "mediaId": 2641,
    "date": "2022-03-22",
    "sentence": "Ohio GOP Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons, who made headlines over the weekend after squaring off toe-to-toe during a party debate near Columbus, did not appear ready to back down during interviews on Newsmax Monday.",
    "author": "Sandy Fitzgerald",
    "title": "Ohio's Mandel, Gibbons to Newsmax: Not Backing Down After Debate Fight"
  },
  {
    "id": 11750,
    "mediaId": 8491,
    "date": "2022-03-22",
    "sentence": "Those would-be the moments like the exchange between <span class='selected-term'>Josh Mandel</span> and Mike Gibbons from an earlier debate, which the two of them were given a chance to explain at the start of Monday’s debate.",
    "author": "Dave Nethers",
    "title": "Ohio professors analyze Monday night’s GOP Senate Debate"
  },
  {
    "id": 5840,
    "mediaId": 2547,
    "date": "2022-04-10",
    "sentence": "Some of you may remember Gibbons from the recent debate where he and <span class='selected-term'>Josh Mandel</span> nearly came to blows.",
    "author": "Heather",
    "title": "Ohio GOP Senate Candidate: Middle Class Doesn't Pay 'Fair Share' Of Taxes"
  }
]