[
  {
    "id": 26520,
    "mediaId": 2590,
    "date": "2022-01-27",
    "sentence": "Harper, 38, shot back: “What we don’t need to happen is have <span class='selected-term'>Josh Mandel</span> talk for the Black community.”\nAt one point, Mandel called Harper a “looney Nancy Pelosi” for “advocating for all this green energy” when Harper pledged to support renewable energy to help mitigate climate change.",
    "author": "Liz Skalka",
    "title": "A Hard-Right Republican And A Progressive Debated. It Went As Well As You'd Expect."
  },
  {
    "id": 26532,
    "mediaId": 2679,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican <span class='selected-term'>Josh Mandel</span> and Democrat Morgan Harper, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "JULIE CARR SMYTH",
    "title": "Tim Ryan, not onstage, is early focus of Ohio Senate event"
  },
  {
    "id": 26544,
    "mediaId": 2728,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican <span class='selected-term'>Josh Mandel</span> and Democrat Morgan Harper, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "Julie Carr Smyth",
    "title": "Tim Ryan, not onstage, is early focus of Ohio Senate event"
  },
  {
    "id": 25658,
    "mediaId": 6598,
    "date": "2022-02-03",
    "sentence": "His departure from the race could allow others to consolidate support as former state treasurer <span class='selected-term'>Josh Mandel</span> has been an early frontrunner.",
    "author": "Andrew J. Tobias",
    "title": "Bernie Moreno drops out of Ohio’s Republican U.S. Senate race"
  },
  {
    "id": 25841,
    "mediaId": 2528,
    "date": "2022-03-19",
    "sentence": "\"He doesn't have the temperament, experience, or fortitude to be a US Senator and Ohio voters got a first-hand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become and that will be reflected on the ballot on May 3,\" she added.",
    "author": "Kelsey Vlamis",
    "title": "2 GOP frontrunners in the Ohio Senate race squared off during a heated debate moment: 'You watch what happens'"
  },
  {
    "id": 25900,
    "mediaId": 5153,
    "date": "2022-03-19",
    "sentence": "Career politician <span class='selected-term'>Josh Mandel</span> called investment banker Mike Gibbons a “p---y” under his breath at the end of the heated exchange.",
    "author": "Joseph Wilkinson",
    "title": "Republican Ohio Senate candidate calls opponent ‘p---y’ in near-altercation at debate"
  },
  {
    "id": 25933,
    "mediaId": 2916,
    "date": "2022-03-19",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\nMeanwhile, Mandel’s campaign manager said Gibbons “got upset tonight that he was called out for his investments in Chinese oil.”\n“He claims not to remember the investment, but it’s part of a pattern of Gibbons’ entire career making money by taking American companies and selling them to foreign interests,” campaign manager Scott Guthrie said.",
    "author": "Brittany Bernstein",
    "title": "Ohio GOP Senate Candidates Have Heated Face-to-Face Exchange during Debate"
  },
  {
    "id": 25745,
    "mediaId": 2727,
    "date": "2022-03-21",
    "sentence": "“We all volunteered to serve our country away from our families, putting our lives in danger, so people like Mike Gibbons could make millions.”\nGibbons said Mandel initiated the physical aggression and made “several false, petty comments in an attempt to smear the new front-runner.”\n“<span class='selected-term'>Josh Mandel</span> is unhinged, unfit and flailing — because he’s losing,” Gibbons campaign spokesperson Samantha Cotten said.",
    "author": "AP and TOI staff",
    "title": "Near-fight at Ohio GOP Senate debate between candidates Josh Mandel, Mike Gibbons"
  },
  {
    "id": 26266,
    "mediaId": 2525,
    "date": "2022-03-21",
    "sentence": "The debate became intense almost as soon as it began as former state Treasurer <span class='selected-term'>Josh Mandel</span> attacked investment banker Mike Gibbons’ business dealings.",
    "author": "Associated Press",
    "title": "Fight at Ohio GOP Senate debate elevates military issue"
  },
  {
    "id": 25607,
    "mediaId": 2641,
    "date": "2022-03-22",
    "sentence": "Ohio GOP Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons, who made headlines over the weekend after squaring off toe-to-toe during a party debate near Columbus, did not appear ready to back down during interviews on Newsmax Monday.",
    "author": "Sandy Fitzgerald",
    "title": "Ohio's Mandel, Gibbons to Newsmax: Not Backing Down After Debate Fight"
  },
  {
    "id": 25642,
    "mediaId": 2919,
    "date": "2022-03-28",
    "sentence": "\"I want to say it very clearly for all of the RINOs out there and all of the media elites out there the 2020 election was stolen from Donald J. Trump,\" candidate <span class='selected-term'>Josh Mandel</span> said.",
    "author": "Courtney Shaw",
    "title": "Ohio's 7 Republican Senate hopefuls face off in debate at Central State University"
  },
  {
    "id": 25804,
    "mediaId": 2560,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary – Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance – scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26125,
    "mediaId": 2680,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26388,
    "mediaId": 2822,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH - Associated Press",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26393,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary - Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance - scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open U.S. Senate seat"
  },
  {
    "id": 25884,
    "mediaId": 2680,
    "date": "2022-04-14",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair Jane Timken for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "GOP leaders in Ohio try to block Trump endorsement of Vance"
  },
  {
    "id": 25695,
    "mediaId": 2919,
    "date": "2022-04-15",
    "sentence": "Vance has been locked in a heated race against former state treasurer <span class='selected-term'>Josh Mandel</span>, investment banker Mike Gibbons, former Ohio Republican Party chair Jane Timken, and state Sen. Matt Dolan, whose family owns the Cleveland Guardians.",
    "author": "Associated Press",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 26354,
    "mediaId": 2680,
    "date": "2022-04-15",
    "sentence": "The decision marks a major blow for Vance's top rivals — former state treasurer <span class='selected-term'>Josh Mandel</span>, investment banker Mike Gibbons and former Ohio Republican Party chair Jane Timken — who have been locked in a heated and contentious race for both the nomination and Trump's backing in a primary that is now less than three weeks away.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 26323,
    "mediaId": 2512,
    "date": "2022-04-16",
    "sentence": "",
    "author": "Meaghan Ellis",
    "title": "Josh Mandel's Ohio GOP Senate campaign strategy is focused on capturing voters 'through churches'?: report"
  }
]