[
  {
    "id": 26495,
    "mediaId": 2716,
    "date": "2022-01-25",
    "sentence": "Other GOP candidates running for U.S. Senate in Ohio include \"former state Republican Party Chairwoman Jane Timken, former state Treasurer <span class='selected-term'>Josh Mandel</span>, businessman Bernie Moreno and investment banker Mike Gibbons,\" The Hill notes.",
    "author": "Brigid Kennedy",
    "title": "Ohio Senate candidate JD Vance 'honored' to have Marjorie Taylor Greene's endorsement"
  },
  {
    "id": 26470,
    "mediaId": 2522,
    "date": "2022-01-25",
    "sentence": "Others running in the race include former Ohio treasurer and two-time Senate candidate <span class='selected-term'>Josh Mandel</span>; former Ohio GOP Chair Jane Timken; Cleveland businessman and luxury auto dealership giant Bernie Moreno; 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer, and investment banker; and Matt Dolan, a longtime state lawmaker whose family owns Major League Baseball’s Cleveland Guardians.",
    "author": "Terresa Monroe-Hamilton",
    "title": "JD Vance massively triggers left with glowing MTG endorsement, vow to take country back from ‘scumbags’"
  },
  {
    "id": 26523,
    "mediaId": 2547,
    "date": "2022-01-26",
    "sentence": "Then he showed a creepy clip or talking point spewing robot man, <span class='selected-term'>Josh Mandel</span>, a GOP candidate from Ohio who repeated this right wing talking point: \"We need to get rid of this January 6th commission and replace it with a November 3rd commission.",
    "author": "Red Painter",
    "title": "Jim Acosta Mocks The Cowardly GOP Of 2022"
  },
  {
    "id": 26465,
    "mediaId": 2629,
    "date": "2022-01-27",
    "sentence": "Former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, who is seeking the GOP nomination for the Senate seat being vacated by retiring Ohio Republican Sen.",
    "author": "Josh Israel",
    "title": "GOP Already Attacking Unnamed SCOTUS Nominee With Racist Dog Whistles"
  },
  {
    "id": 26492,
    "mediaId": 4040,
    "date": "2022-01-31",
    "sentence": "John Fea @ Current: Ohio Senate candidate <span class='selected-term'>Josh Mandel</span> does not believe in the separation of church and state.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: That’s Not Voltaire You’re Quoting"
  },
  {
    "id": 26530,
    "mediaId": 2594,
    "date": "2022-02-01",
    "sentence": "Notable examples include Harriet Hageman, a Republican running to oust Rep Liz Cheney in Wyoming, as well as several candidates including <span class='selected-term'>Josh Mandel</span> in the Ohio Senate race.",
    "author": "John Bowden",
    "title": "Trump says war chest has more than $122m cash on hand after huge 2021 haul"
  },
  {
    "id": 26302,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "",
    "author": "Jordan Dixon-Hamilton",
    "title": "Bernie Moreno Suspends U.S. Senate Campaign"
  },
  {
    "id": 26409,
    "mediaId": 2630,
    "date": "2022-02-04",
    "sentence": "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\n<span class='selected-term'>Josh Mandel</span>, Ohio state treasurer, at a campaign stop for Sen. Marco Rubio, then a Republican presidential candidate, in Cleveland in 2015.Aaron Josefczyk / Reuters file\n‘He seemed like a totally normal, regular Republican’\nAmbition drove Mandel more than ideology early in his career, and establishment Republicans who saw in him a young and polite Jewish veteran who clicked with swing voters were eager to accommodate his quick rise.",
    "author": "",
    "title": "Josh Mandel foreshadowed Trump’s rise. His Ohio Senate bid is a test of what’s next."
  },
  {
    "id": 26363,
    "mediaId": 2687,
    "date": "2022-02-05",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Why Trump Hasn’t Endorsed Josh Mandel"
  },
  {
    "id": 26163,
    "mediaId": 2664,
    "date": "2022-02-05",
    "sentence": "According to one source close to Trump, \"The [former] president has used the term ‘f*cking weird’ to describe <span class='selected-term'>Josh Mandel</span> more than once, when I have spoken to him about [Mandel].",
    "author": "Tom Boggioni",
    "title": "Trump holding up Senate endorsement as he obsesses over sex rumors about 'weirdo' candidate: report"
  },
  {
    "id": 25941,
    "mediaId": 2738,
    "date": "2022-02-05",
    "sentence": "Sources tell The Daily Beast that Trump, a lover of gossip, has “privately regurgitated, often in disgust, a wide range of unverified, often completely unvetted, and lurid rumors about the MAGA candidate.” One source told the publication that Trump “has used the term ‘f*cking weird’ to describe <span class='selected-term'>Josh Mandel</span> more than once,” and that he “has talked about [Mandel] and sex in the same sentence more times than I would have liked to hear.” (Reminder, by the way, that Trump has also been credibly accused of sexual misconduct by over two dozen women.)",
    "author": "Matt Prigge",
    "title": "A MAGA-fied Candidate Is Having Trouble Getting Trump’s Endorsement Due To Rumors Of His ‘F*cking Weird’ Sex Life"
  },
  {
    "id": 25911,
    "mediaId": 2752,
    "date": "2022-02-07",
    "sentence": "When sentient slime trail Marjorie Taylor Greene, who is somehow a member of Congress, endorsed Senate candidate, author, and asshole JD Vance, we wondered why she’d stiffed <span class='selected-term'>Josh Mandel</span>, a seemingly more authentic MAGA zealot.",
    "author": "Stephen Robinson",
    "title": "Trump Pretty Sure Josh Mandel Too Unf*ckable For Endorsement"
  },
  {
    "id": 25820,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "\"Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival <span class='selected-term'>Josh Mandel</span>, which have portrayed Vance as an anti-Trump figure,\" writes Politico.",
    "author": "Brad Reed",
    "title": "JD Vance's campaign is going down in flames -- and his pollster warns he needs a 'course correction ASAP'"
  },
  {
    "id": 26252,
    "mediaId": 2664,
    "date": "2022-02-08",
    "sentence": "As Alex Eisenstadt writes for Politico about a freak-out internal memo from within the campaign of JD Vance, the wealthy investor challenging perennial GOP candidate <span class='selected-term'>Josh Mandel</span>:\n“Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival Josh Mandel, which have portrayed Vance as an anti-Trump figure.” (In reality, Vance has embraced Trump like a teenager mooning over a rock star.)",
    "author": "Thom Hartmann",
    "title": "Has America reached the 'tipping point' where most are sickened by the GOP?"
  },
  {
    "id": 25785,
    "mediaId": 6428,
    "date": "2022-02-10",
    "sentence": "With rhetoric like that, the dividing lines were drawn with Republicans like U.S. Rep. Liz Cheney (R-WY) on one side saying the election was not stolen and Senate candidates like Ohio's <span class='selected-term'>Josh Mandel</span> claiming the opposite.",
    "author": "David Brody",
    "title": "From Reagan to Trump: GOP Navigates Changing Landscape"
  },
  {
    "id": 25631,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "And like her Ohio U.S. Senate candidate colleague <span class='selected-term'>Josh Mandel</span> on the segment before her, Timken said that local telecom provider Cincinnati Bell's decision to drop Newsmax was \"against our First Amendment.\"",
    "author": "Luca Cacciatore",
    "title": "Jane Timken to Newsmax: 'I Stood Up and Delivered for President Trump'"
  },
  {
    "id": 25732,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "A Coefficient poll of 613 likely voters found businessman Mike Gibbons leading a crowd of six candidates with 20% support and former state treasurer <span class='selected-term'>Josh Mandel</span> in second with 18% support.",
    "author": "Michael Ginsberg",
    "title": "New Ohio Senate Poll Shows More Bad News For JD Vance"
  },
  {
    "id": 25675,
    "mediaId": 2643,
    "date": "2022-02-14",
    "sentence": "He's running against pro-Trump candidates like JD Vance, <span class='selected-term'>Josh Mandel</span> and Jane Timken.",
    "author": "Patricia McKnight",
    "title": "Trump May Bypass Big Names Mandel, Vance in Ohio Race for Unknown Dolan"
  },
  {
    "id": 26038,
    "mediaId": 2752,
    "date": "2022-02-14",
    "sentence": "A rational person would repeat this trick in Ohio and Missouri as well, where chaotic primaries threaten to allow weirdos like <span class='selected-term'>Josh Mandel</span> or Eric Greitens to jeopardize what should otherwise be winnable seats.",
    "author": "Liz Dye",
    "title": "Mitch McConnell And The 'Moderates' Really Think They're Going To Take GOP Back From Trump"
  },
  {
    "id": 25898,
    "mediaId": 2664,
    "date": "2022-02-15",
    "sentence": "The <span class='selected-term'>Josh Mandel</span> of 2003 — of 2016, even — would not recognize the Josh Mandel of 2021,\" Zimmerman added before admitting, \"This has broken my heart.”\nRepublican donor Brad Kastan believes the aspiring senator has made a big mistake expressing a belief that Mandel is “painting himself into a corner so far out that he can’t win” come November if he gets through the primary.",
    "author": "Tom Boggioni",
    "title": "'This has broken my heart': Josh Mandel called out by former supporters for trying to become the new Trump"
  },
  {
    "id": 25889,
    "mediaId": 2636,
    "date": "2022-02-15",
    "sentence": "What to read\nJennifer Medina and Lisa Lerer profile <span class='selected-term'>Josh Mandel</span>, a Republican Senate candidate of Ohio, and his political journey to the far right.",
    "author": "",
    "title": "The liberal group American Bridge is launching a new project to collect information for campaigns against Republicans running for state and local offices."
  },
  {
    "id": 26382,
    "mediaId": 2699,
    "date": "2022-02-15",
    "sentence": "Along with Walker, they include Ohio Senate hopeful <span class='selected-term'>Josh Mandel</span>, Trump White House doctor turned Texas congressional candidate Ronny Jackson, Peter Thiel-backed Arizona Senate candidate Blake Masters, Alabama gubernatorial challenger and Trump’s former ambassador to Slovenia Lynda Blanchard, and Kelly Tshibaka, who is taking on Trump target Sen. Lisa Murkowski in the Alaska Republican primary.",
    "author": "Roger Sollenberger",
    "title": "Republicans Are Still Trying to Buy Trump’s Love"
  },
  {
    "id": 26283,
    "mediaId": 4040,
    "date": "2022-02-16",
    "sentence": "Jennifer Medina and Lisa Lerer @ The New York Times: How <span class='selected-term'>Josh Mandel</span>, Son of Suburban Ohio, Became a Right-Wing Warrior.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: Rise of a Right-Wing Warrior"
  },
  {
    "id": 25682,
    "mediaId": 2699,
    "date": "2022-02-16",
    "sentence": "?I hope that there will not be some sort of global economic incident of note triggered by cryptocurrency,” says Roth, in a sentence that will surely seem prophetic in six months’ time), and how Ohio Senate primary candidate <span class='selected-term'>Josh Mandel</span>—the one whose alleged sex life Trump likes to gossip about—“looks like he just hatched out of something.”\nAnd finally, the hosts unpack how QAnon-loving Congresswoman Marjorie Taylor Greene has become a prime kingmaker in GOP political endorsements, and update us on what’s going on with MAGA election clerk Tina Peters, who tried to hide her iPad from the authorities, with violent results.",
    "author": "The Daily Beast",
    "title": "The Right-Wing Movements Inspired by Canadian Truckers Are Only ‘Picking Up Steam’"
  },
  {
    "id": 25765,
    "mediaId": 2540,
    "date": "2022-02-17",
    "sentence": "Around that same time, Ohio Senate front-runner <span class='selected-term'>Josh Mandel</span> told a debate audience that \"I believe the election was stolen from Donald J.",
    "author": "Chris Cillizza",
    "title": "143 Republicans are running for Congress in Texas. Only 13 say the 2020 election was legitimate."
  },
  {
    "id": 26021,
    "mediaId": 2564,
    "date": "2022-02-18",
    "sentence": "Vance is trailing <span class='selected-term'>Josh Mandel</span>, who knows how to be emollient to Trump.",
    "author": "",
    "title": "Opinion: Behold the Republican somersaults for Trump"
  },
  {
    "id": 26309,
    "mediaId": 2745,
    "date": "2022-02-18",
    "sentence": "Vance is trailing <span class='selected-term'>Josh Mandel</span>, who knows how to be emollient to Trump.",
    "author": "",
    "title": "Opinion: Behold the Republican somersaults for Trump"
  },
  {
    "id": 25813,
    "mediaId": 2745,
    "date": "2022-02-22",
    "sentence": "He and the leading candidate in the primary, former state treasurer <span class='selected-term'>Josh Mandel</span>, have both offered vacuous misdirection about our border being more important than Ukraine’s.",
    "author": "",
    "title": "Opinion: J.D. Vance’s repulsive spin about Putin and Ukraine faces a new test"
  },
  {
    "id": 25657,
    "mediaId": 2676,
    "date": "2022-02-23",
    "sentence": "",
    "author": "Thom Hartmann",
    "title": "Trump feeds on Americans' loss of political agency — a void created by the GOP itself"
  },
  {
    "id": 25953,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "Hamas spokesman to deliver response to state of the union.https://twitter.com/hollyotterbein/status/1496455601416814598\\u00a0\\u2026\n— <span class='selected-term'>Josh Mandel</span> (@Josh Mandel) 1645658514\nTwitter was jolted into condemning Mandel's unprovoked post for being baselessly and unabashedly racist.",
    "author": "Brandon Gage",
    "title": "Josh Mandel tweets racist trope about Rashida Tlaib"
  },
  {
    "id": 25992,
    "mediaId": 2831,
    "date": "2022-02-24",
    "sentence": "Look at Missouri, where you have these primaries of Eric Greitens, or the one in Ohio with <span class='selected-term'>Josh Mandel</span> and J. D. Vance.",
    "author": "Storer H. Rowley",
    "title": "Adam Kinzinger’s Warning to His Fellow Republicans on January 6 and Ukraine"
  },
  {
    "id": 25981,
    "mediaId": 2564,
    "date": "2022-02-25",
    "sentence": "",
    "author": "",
    "title": "EXCLUSIVE: Trump gets his game face on: Ex-President plays golf at his West Palm Beach course ahead of his CPAC speech on Saturday night after tearing into Biden's response to Putin's Ukraine invasion"
  },
  {
    "id": 25917,
    "mediaId": 2594,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Andrew Naughtie",
    "title": "Trump news: White House slams Putin ‘scheme’ as ex-president rejects House speaker plan"
  },
  {
    "id": 25908,
    "mediaId": 2584,
    "date": "2022-02-26",
    "sentence": "",
    "author": "David Smith",
    "title": "The strange Republican world where the big lie lives on and Trump is fighting to save democracy"
  },
  {
    "id": 25895,
    "mediaId": 2664,
    "date": "2022-02-26",
    "sentence": "With one speaker, Ohio's <span class='selected-term'>Josh Mandel</span> -- who is seeking the GOP nomination for his state's open U.S. Senate seat -- telling the crowd, \"We have Democrats who think it’s OK to cheat in elections, and I would submit to you that one of the most important fights of our day is to stop the cheating from the left...",
    "author": "Tom Boggioni",
    "title": "Republicans worried conspiracy ranting at CPAC will come back to 'hurt them': report"
  },
  {
    "id": 26025,
    "mediaId": 2540,
    "date": "2022-02-26",
    "sentence": "",
    "author": "Daniel Dale",
    "title": "Fact-checking the first two days of CPAC"
  },
  {
    "id": 26263,
    "mediaId": 2664,
    "date": "2022-02-26",
    "sentence": "The report notes that Freeman's belief of election fraud was amplified in a speech by <span class='selected-term'>Josh Mandel</span>, who is seeking Ohio's GOP U.S. Senate nomination, and told the crowd, \"We have Democrats who think it’s OK to cheat in elections, and I would submit to you that one of the most important fights of our day is to stop the cheating from the left...",
    "author": "Tom Boggioni",
    "title": "Trump supporters complain the Capitol riot gets 'bad press' at CPAC's 'parallel universe'"
  },
  {
    "id": 26200,
    "mediaId": 2631,
    "date": "2022-02-26",
    "sentence": "At CPAC on Friday, <span class='selected-term'>Josh Mandel</span>, a contender in the wide-open Senate primary in Ohio, said \"I believe this election was stolen from Donald J. Trump,\" to loud cheers.",
    "author": "",
    "title": "There are signs Republicans want to move on from 2020. Trump may not allow it."
  },
  {
    "id": 26334,
    "mediaId": 2699,
    "date": "2022-02-27",
    "sentence": "Also in this episode, Andy Levy makes his Sunday episode debut, just in time to listen to clips of <span class='selected-term'>Josh Mandel</span> sounding stupid and to unpack Texas Gov.",
    "author": "The Daily Beast",
    "title": "Ex-Prosecutor Says She Can Prove Trump Committed Two Crimes"
  },
  {
    "id": 25715,
    "mediaId": 2590,
    "date": "2022-02-27",
    "sentence": "Rep. Jim Jordan (R-Ohio) said he hoped Trump would run again, while Ohio Senate candidate <span class='selected-term'>Josh Mandel</span> declared Trump the winner of the 2020 election.",
    "author": "Liz Skalka",
    "title": "Conservatives Are Warming To The Idea Of A Post-Trump GOP"
  },
  {
    "id": 26119,
    "mediaId": 2537,
    "date": "2022-02-28",
    "sentence": "Neither Matt Dolan nor <span class='selected-term'>Josh Mandel</span> sought the party's endorsement, Hall said.",
    "author": "Erin Glynn",
    "title": "'Sending a message': Butler County GOP is second local party to shun Gov. Mike DeWine"
  },
  {
    "id": 26376,
    "mediaId": 2584,
    "date": "2022-02-28",
    "sentence": "And while some CPAC speakers did promulgate “the big lie” – Ohio Senate hopeful <span class='selected-term'>Josh Mandel</span> declared, “I want to say it very clearly and very directly: I believe this election was stolen from Donald J Trump” – they generally gave greater emphasis to winning Congress in 2022 and, of course, Trump returning to the White House in 2024.",
    "author": "David Smith",
    "title": "Trump ignores Farage – and risks midterm elections farrago – with insistence on big lie"
  },
  {
    "id": 26399,
    "mediaId": 2724,
    "date": "2022-02-28",
    "sentence": "— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) February 28, 2022\nTrump later froze $400 million in congressionally approved security assistance to Ukraine after a phone conversation with Ukrainian President Volodymyr Zelensky.",
    "author": "Rusty Weiss",
    "title": "Democrat Swalwell Claims If Trump Were President He’d Be ‘Sending Weapons To Russia’"
  },
  {
    "id": 25734,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "Timken’s GOP opponents <span class='selected-term'>Josh Mandel</span>, Mike Gibbons and JD Vance have all made a determined effort to win the Trump endorsement, while Matt Dolan is seeking to appeal to moderate Republicans who are less sold on Trump.",
    "author": "",
    "title": "Trump endorsement casts long shadow over Ohio Senate race"
  },
  {
    "id": 25809,
    "mediaId": 2748,
    "date": "2022-03-21",
    "sentence": "",
    "author": "Blarp Blog",
    "title": "Ohio U.S. Senate debate goes off the rails… Josh Mandel almost comes to blows…"
  },
  {
    "id": 26221,
    "mediaId": 2752,
    "date": "2022-03-21",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\nThis is all true, but we also imagine Cotten will twist herself into knots justifying Gibbons’s inevitable endorsement of Mandel if he wins the nomination.",
    "author": "Stephen Robinson",
    "title": "All Fun And Games Until Ohio GOP Senate Candidate Starts Calling Opponent A 'Pussy'"
  },
  {
    "id": 25848,
    "mediaId": 2658,
    "date": "2022-03-22",
    "sentence": "Mike Gibbons, the Ohio Senate hopeful who nearly came to blows with <span class='selected-term'>Josh Mandel</span>, urged voters to “choose your fighter” in the race.",
    "author": "",
    "title": "POLITICO Playbook: Friction between Harris and Biden camps revealed in new book"
  },
  {
    "id": 26062,
    "mediaId": 2602,
    "date": "2022-03-23",
    "sentence": "One is <span class='selected-term'>Josh Mandel</span>, who is running for the Republican Senate nomination in Ohio to succeed the retiring more moderate Rob Portman.",
    "author": "DOUGLAS BLOOMFIELD",
    "title": "Expectations are low for the congressional mid-term elections - opinion"
  },
  {
    "id": 26264,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "Watch the original exchange below:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other\\u2019s faces at tonight\\u2019s GOP #OHSen forum hosted by FreedomWorks.\\n\\n\\u201cYou watch what happens,\\u201d Mandel says.pic.twitter.com/fQuqfHxXHT\n— Heartland Signal (@Heartland Signal) 1647644328",
    "author": "Matthew Chapman",
    "title": "Even Trump is 'baffled' as Ohio GOP candidates threaten each other over who deserves his endorsement: report"
  },
  {
    "id": 26120,
    "mediaId": 2627,
    "date": "2022-03-25",
    "sentence": "Thankfully, we have writer Christian Vanderbrouk to provide a helpful translation of this brand of conservative GOP angst:\nJust days earlier, McLaughlin had provided another look inside the GOP’s tribal calculations, when he explained that even though a Senate candidate like Ohio’s deplorable <span class='selected-term'>Josh Mandel</span> was a “national embarrassment,” he would have no problem supporting him in the general election against a Democrat.",
    "author": "Charlie Sykes",
    "title": "Missouri's Eric Greitens is testing the limits of Trump's post-morals MAGAverse"
  },
  {
    "id": 25829,
    "mediaId": 2540,
    "date": "2022-03-27",
    "sentence": "Businessman Mike Gibbons and former state Treasurer <span class='selected-term'>Josh Mandel</span> led the pack in a Fox poll conducted in early March, with a quarter of GOP primary voters undecided.",
    "author": "Simone Pathe",
    "title": "The 10 Senate seats most likely to flip in 2022"
  },
  {
    "id": 25642,
    "mediaId": 2919,
    "date": "2022-03-28",
    "sentence": "\"I want to say it very clearly for all of the RINOs out there and all of the media elites out there the 2020 election was stolen from Donald J. Trump,\" candidate <span class='selected-term'>Josh Mandel</span> said.",
    "author": "Courtney Shaw",
    "title": "Ohio's 7 Republican Senate hopefuls face off in debate at Central State University"
  },
  {
    "id": 25792,
    "mediaId": 2660,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Amy Sherman",
    "title": "Georgia’s David Perdue said elections were stolen from him and Trump. Pants on Fire!"
  },
  {
    "id": 25964,
    "mediaId": 2548,
    "date": "2022-03-29",
    "sentence": "All major Republican candidates have expressed opposition to trade with China, and top two candidates Mike Gibbons and <span class='selected-term'>Josh Mandel</span> nearly came to blows at a March 18 debate over Mandel’s accusation that Gibbons traded Chinese petroleum stock.",
    "author": "Michael Ginsberg",
    "title": "Tim Ryan, Former Democratic Candidate For President, Focuses On One Big Issue Trump Always Talked About In New Campaign Ad"
  },
  {
    "id": 26176,
    "mediaId": 2532,
    "date": "2022-03-30",
    "sentence": "Her rivals, <span class='selected-term'>Josh Mandel</span>, JD Vance and Mike Gibbons, are also seeking endorsements.",
    "author": "",
    "title": "Trump has endorsed nearly 130 candidates for 2022, testing his influence in the Republican Party"
  },
  {
    "id": 25787,
    "mediaId": 2540,
    "date": "2022-04-01",
    "sentence": "Washington (CNN)A new television ad from Ohio Republican Senate candidate <span class='selected-term'>Josh Mandel</span> is centered on a false claim that Republican primary rival Mike Gibbons, a businessman, said that military service isn't \"real work.\"",
    "author": "Daniel Dale",
    "title": "Fact check: Ad from Ohio Republican Josh Mandel falsely claims party rival Mike Gibbons said military service isn't real work"
  },
  {
    "id": 26184,
    "mediaId": 2745,
    "date": "2022-04-03",
    "sentence": "A total deportation of immigrants in the country illegally and the restoration of Donald Trump to the White House as quickly as possible.”\nA statement from three-time Senate candidate <span class='selected-term'>Josh Mandel</span> caught the mood: “For all the RINOs out there and all the media elites out there, the 2020 election was stolen from Donald J. Trump.”\nYet while it has a high profile today, the far right has deep roots in Republican history.",
    "author": "E.J. Dionne Jr.",
    "title": "Opinion: Collins’s lonely voice on Jackson shows how extreme the GOP has become"
  },
  {
    "id": 26189,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Other primary candidates include investment banker Mike Gibbons, former Ohio treasurer <span class='selected-term'>Josh Mandel</span>, and Jane Timken, the former chair of the Ohio Republican Party.",
    "author": "Gustaf Kilander",
    "title": "JD Vance accused of racism over new campaign ad in which he asks ‘Do you hate Mexicans?’"
  },
  {
    "id": 25827,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Vance's allies at Protect Ohio Values PAC have released a new poll from Fabrizio Lee & Associates that shows an 18-18-18 deadlock between Vance, state Treasurer <span class='selected-term'>Josh Mandel</span>, and businessman Mike Gibbons in the May 3 GOP primary, with former state party chair Jane Timken at 9%.",
    "author": "",
    "title": "Morning Digest: Trump's 'bro' now frontrunner following Ohio Republican's unexpected retirement"
  },
  {
    "id": 25930,
    "mediaId": 2512,
    "date": "2022-04-11",
    "sentence": "Although he has yet to endorse far-right candidates JD Vance or <span class='selected-term'>Josh Mandel</span>, who are duking it out for the Republican nomination for Senate in Ohio, Trump's vibe is very much alive.",
    "author": "Brandon Gage",
    "title": "Donald Trump's 'troublemaking' could end up benefitting Democrats: columnist"
  },
  {
    "id": 26205,
    "mediaId": 2695,
    "date": "2022-04-13",
    "sentence": "Ohio: <span class='selected-term'>Josh Mandel</span> (R) and Mike Gibbons (R) are neck and neck in a packed Republican environment.",
    "author": "BlazeTV Staff",
    "title": "NPR predicts these 10 Senate seats might see a party FLIP"
  },
  {
    "id": 25884,
    "mediaId": 2680,
    "date": "2022-04-14",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair Jane Timken for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "GOP leaders in Ohio try to block Trump endorsement of Vance"
  },
  {
    "id": 26105,
    "mediaId": 2721,
    "date": "2022-04-15",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair Jane Timken for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "",
    "title": "Trump to make huge announcement; GOP unhappy?"
  },
  {
    "id": 26087,
    "mediaId": 2640,
    "date": "2022-04-15",
    "sentence": "Sources told NBC News Thursday that the president is on the verge of endorsing the Hillbilly Elegy author, but other Republicans including rival candidate <span class='selected-term'>Josh Mandel</span> are fighting hard to prevent it.",
    "author": "Rob Quinn",
    "title": "Ohio Republicans Are Trying to Stop a Trump Endorsement"
  },
  {
    "id": 25695,
    "mediaId": 2919,
    "date": "2022-04-15",
    "sentence": "Vance has been locked in a heated race against former state treasurer <span class='selected-term'>Josh Mandel</span>, investment banker Mike Gibbons, former Ohio Republican Party chair Jane Timken, and state Sen. Matt Dolan, whose family owns the Cleveland Guardians.",
    "author": "Associated Press",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 26354,
    "mediaId": 2680,
    "date": "2022-04-15",
    "sentence": "The decision marks a major blow for Vance's top rivals — former state treasurer <span class='selected-term'>Josh Mandel</span>, investment banker Mike Gibbons and former Ohio Republican Party chair Jane Timken — who have been locked in a heated and contentious race for both the nomination and Trump's backing in a primary that is now less than three weeks away.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  }
]