[
  {
    "id": 26402,
    "mediaId": 2643,
    "date": "2022-02-03",
    "sentence": "In March 2021, Twitter temporarily restricted Ohio U.S. Senate candidate <span class='selected-term'>Josh Mandel</span> in Match for violating the social media platform's rules.",
    "author": "Charlotte Trattner",
    "title": "Ohio Bill Could Make It Easier to Sue Social Media Companies Over Censorship"
  },
  {
    "id": 26444,
    "mediaId": 2746,
    "date": "2022-02-21",
    "sentence": "Mr. Greitens, who is running for Missouri’s open Senate seat, will deliver remarks on Friday, along with GOP Senate candidates <span class='selected-term'>Josh Mandel</span> of Ohio and Adam Laxalt of Nevada, a former state attorney general.",
    "author": "Mica Soellner",
    "title": "Disgraced ex-Missouri Gov. Eric Greitens to speak at CPAC"
  },
  {
    "id": 26025,
    "mediaId": 2540,
    "date": "2022-02-26",
    "sentence": "",
    "author": "Daniel Dale",
    "title": "Fact-checking the first two days of CPAC"
  },
  {
    "id": 25715,
    "mediaId": 2590,
    "date": "2022-02-27",
    "sentence": "Rep. Jim Jordan (R-Ohio) said he hoped Trump would run again, while Ohio Senate candidate <span class='selected-term'>Josh Mandel</span> declared Trump the winner of the 2020 election.",
    "author": "Liz Skalka",
    "title": "Conservatives Are Warming To The Idea Of A Post-Trump GOP"
  },
  {
    "id": 26376,
    "mediaId": 2584,
    "date": "2022-02-28",
    "sentence": "And while some CPAC speakers did promulgate “the big lie” – Ohio Senate hopeful <span class='selected-term'>Josh Mandel</span> declared, “I want to say it very clearly and very directly: I believe this election was stolen from Donald J Trump” – they generally gave greater emphasis to winning Congress in 2022 and, of course, Trump returning to the White House in 2024.",
    "author": "David Smith",
    "title": "Trump ignores Farage – and risks midterm elections farrago – with insistence on big lie"
  },
  {
    "id": 25767,
    "mediaId": 2660,
    "date": "2022-03-01",
    "sentence": "If Your Time is short\nNot a scrap of evidence has emerged to support <span class='selected-term'>Josh Mandel</span>’s assertion of a stolen election.",
    "author": "Jon Greenberg",
    "title": "Ohio’s Josh Mandel repeats false claim of stolen 2020 election"
  },
  {
    "id": 25653,
    "mediaId": 2676,
    "date": "2022-03-02",
    "sentence": "And in Ohio, the frontrunner for the GOP senate primary, <span class='selected-term'>Josh Mandel</span>, has been declaring that the separation of church and state is a \"myth.\"",
    "author": "Amanda Marcotte",
    "title": "Why aren't Republicans worried their fanatical culture war will hurt them in the midterms?"
  },
  {
    "id": 26145,
    "mediaId": 2528,
    "date": "2022-03-03",
    "sentence": "Ohio\n Former Ohio state treasurer <span class='selected-term'>Josh Mandel</span> (L) and author JD Vance (R) are running for the Republican Senate nomination in Ohio.",
    "author": "Kayla Epstein",
    "title": "These 9 Senate races hold the key to who will control Joe Biden's agenda after the midterm elections in November"
  },
  {
    "id": 26137,
    "mediaId": 2740,
    "date": "2022-03-21",
    "sentence": "A debate between Ohio Republican Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons on Friday escalated into an angry confrontation.",
    "author": "",
    "title": "Ohio GOP debate leads to angry confrontation"
  }
]