[
  {
    "id": 25765,
    "mediaId": 2540,
    "date": "2022-02-17",
    "sentence": "Around that same time, Ohio Senate front-runner <span class='selected-term'>Josh Mandel</span> told a debate audience that \"I believe the election was stolen from Donald J.",
    "author": "Chris Cillizza",
    "title": "143 Republicans are running for Congress in Texas. Only 13 say the 2020 election was legitimate."
  },
  {
    "id": 25992,
    "mediaId": 2831,
    "date": "2022-02-24",
    "sentence": "Look at Missouri, where you have these primaries of Eric Greitens, or the one in Ohio with <span class='selected-term'>Josh Mandel</span> and J. D. Vance.",
    "author": "Storer H. Rowley",
    "title": "Adam Kinzinger’s Warning to His Fellow Republicans on January 6 and Ukraine"
  },
  {
    "id": 25767,
    "mediaId": 2660,
    "date": "2022-03-01",
    "sentence": "If Your Time is short\nNot a scrap of evidence has emerged to support <span class='selected-term'>Josh Mandel</span>’s assertion of a stolen election.",
    "author": "Jon Greenberg",
    "title": "Ohio’s Josh Mandel repeats false claim of stolen 2020 election"
  },
  {
    "id": 26145,
    "mediaId": 2528,
    "date": "2022-03-03",
    "sentence": "Ohio\n Former Ohio state treasurer <span class='selected-term'>Josh Mandel</span> (L) and author JD Vance (R) are running for the Republican Senate nomination in Ohio.",
    "author": "Kayla Epstein",
    "title": "These 9 Senate races hold the key to who will control Joe Biden's agenda after the midterm elections in November"
  },
  {
    "id": 26075,
    "mediaId": 2537,
    "date": "2022-03-04",
    "sentence": "In 2007, then state representative <span class='selected-term'>Josh Mandel</span> pushed legislation to require the funds to divest from Iran and Sudan.",
    "author": "Laura A. Bischoff",
    "title": "Ohio's pension funds want to divest from Russia. The question is: How?"
  },
  {
    "id": 25829,
    "mediaId": 2540,
    "date": "2022-03-27",
    "sentence": "Businessman Mike Gibbons and former state Treasurer <span class='selected-term'>Josh Mandel</span> led the pack in a Fox poll conducted in early March, with a quarter of GOP primary voters undecided.",
    "author": "Simone Pathe",
    "title": "The 10 Senate seats most likely to flip in 2022"
  },
  {
    "id": 25920,
    "mediaId": 2740,
    "date": "2022-03-28",
    "sentence": "Among them are former Ohio Republican Party chair Jane Timken, Ohio State Sen. Matt Dolan, Cleveland businessman Mike Gibbons and former Ohio treasurer <span class='selected-term'>Josh Mandel</span>.",
    "author": "Orlando Mayorquin",
    "title": "Ohio Senate race: What to know about JD Vance, venture capitalist running for office"
  },
  {
    "id": 25792,
    "mediaId": 2660,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Amy Sherman",
    "title": "Georgia’s David Perdue said elections were stolen from him and Trump. Pants on Fire!"
  },
  {
    "id": 25930,
    "mediaId": 2512,
    "date": "2022-04-11",
    "sentence": "Although he has yet to endorse far-right candidates JD Vance or <span class='selected-term'>Josh Mandel</span>, who are duking it out for the Republican nomination for Senate in Ohio, Trump's vibe is very much alive.",
    "author": "Brandon Gage",
    "title": "Donald Trump's 'troublemaking' could end up benefitting Democrats: columnist"
  },
  {
    "id": 26132,
    "mediaId": 6503,
    "date": "2022-04-14",
    "sentence": "Ohio: <span class='selected-term'>Josh Mandel</span> (R) and Mike Gibbons (R) are neck and neck in a packed Republican environment.",
    "author": "Warner Todd Huston",
    "title": "Even Left-Wing NPR is Predicting Ten Senate Seats Could go Red"
  }
]