[
  {
    "id": 26495,
    "mediaId": 2716,
    "date": "2022-01-25",
    "sentence": "Other GOP candidates running for U.S. Senate in Ohio include \"former state Republican Party Chairwoman Jane Timken, former state Treasurer <span class='selected-term'>Josh Mandel</span>, businessman Bernie Moreno and investment banker Mike Gibbons,\" The Hill notes.",
    "author": "Brigid Kennedy",
    "title": "Ohio Senate candidate JD Vance 'honored' to have Marjorie Taylor Greene's endorsement"
  },
  {
    "id": 26470,
    "mediaId": 2522,
    "date": "2022-01-25",
    "sentence": "Others running in the race include former Ohio treasurer and two-time Senate candidate <span class='selected-term'>Josh Mandel</span>; former Ohio GOP Chair Jane Timken; Cleveland businessman and luxury auto dealership giant Bernie Moreno; 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer, and investment banker; and Matt Dolan, a longtime state lawmaker whose family owns Major League Baseball’s Cleveland Guardians.",
    "author": "Terresa Monroe-Hamilton",
    "title": "JD Vance massively triggers left with glowing MTG endorsement, vow to take country back from ‘scumbags’"
  },
  {
    "id": 26462,
    "mediaId": 2594,
    "date": "2022-01-26",
    "sentence": "Mr Vance's pivot from folksy intellectual to belligerent “patriot” is likely a tactic employed to take on his primary rival, former Ohio State Treasurer <span class='selected-term'>Josh Mandel</span>.",
    "author": "Graig Graziosi",
    "title": "JD Vance mocked for celebrating Marjorie Taylor Greene endorsement as he vows to take US back from ‘scumbags’"
  },
  {
    "id": 26302,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "",
    "author": "Jordan Dixon-Hamilton",
    "title": "Bernie Moreno Suspends U.S. Senate Campaign"
  },
  {
    "id": 25911,
    "mediaId": 2752,
    "date": "2022-02-07",
    "sentence": "When sentient slime trail Marjorie Taylor Greene, who is somehow a member of Congress, endorsed Senate candidate, author, and asshole JD Vance, we wondered why she’d stiffed <span class='selected-term'>Josh Mandel</span>, a seemingly more authentic MAGA zealot.",
    "author": "Stephen Robinson",
    "title": "Trump Pretty Sure Josh Mandel Too Unf*ckable For Endorsement"
  },
  {
    "id": 25820,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "\"Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival <span class='selected-term'>Josh Mandel</span>, which have portrayed Vance as an anti-Trump figure,\" writes Politico.",
    "author": "Brad Reed",
    "title": "JD Vance's campaign is going down in flames -- and his pollster warns he needs a 'course correction ASAP'"
  },
  {
    "id": 26252,
    "mediaId": 2664,
    "date": "2022-02-08",
    "sentence": "As Alex Eisenstadt writes for Politico about a freak-out internal memo from within the campaign of JD Vance, the wealthy investor challenging perennial GOP candidate <span class='selected-term'>Josh Mandel</span>:\n“Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival Josh Mandel, which have portrayed Vance as an anti-Trump figure.” (In reality, Vance has embraced Trump like a teenager mooning over a rock star.)",
    "author": "Thom Hartmann",
    "title": "Has America reached the 'tipping point' where most are sickened by the GOP?"
  },
  {
    "id": 25732,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "A Coefficient poll of 613 likely voters found businessman Mike Gibbons leading a crowd of six candidates with 20% support and former state treasurer <span class='selected-term'>Josh Mandel</span> in second with 18% support.",
    "author": "Michael Ginsberg",
    "title": "New Ohio Senate Poll Shows More Bad News For JD Vance"
  },
  {
    "id": 25675,
    "mediaId": 2643,
    "date": "2022-02-14",
    "sentence": "He's running against pro-Trump candidates like JD Vance, <span class='selected-term'>Josh Mandel</span> and Jane Timken.",
    "author": "Patricia McKnight",
    "title": "Trump May Bypass Big Names Mandel, Vance in Ohio Race for Unknown Dolan"
  },
  {
    "id": 25813,
    "mediaId": 2745,
    "date": "2022-02-22",
    "sentence": "He and the leading candidate in the primary, former state treasurer <span class='selected-term'>Josh Mandel</span>, have both offered vacuous misdirection about our border being more important than Ukraine’s.",
    "author": "",
    "title": "Opinion: J.D. Vance’s repulsive spin about Putin and Ukraine faces a new test"
  },
  {
    "id": 25731,
    "mediaId": 2659,
    "date": "2022-03-18",
    "sentence": "He trails Mike Gibbons by 11 points and <span class='selected-term'>Josh Mandel</span> by 9 points.",
    "author": "Jason Easley",
    "title": "JD Vance Sided With Putin And Now He May Lose The Ohio Senate GOP Primary"
  },
  {
    "id": 26052,
    "mediaId": 2589,
    "date": "2022-03-18",
    "sentence": "Things went downhill from there and a moderator came over like he was the referee at a fight:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other’s faces at tonight’s GOP #OHSen forum hosted by FreedomWorks.",
    "author": "John Sexton",
    "title": "Republican debate devolves into shouting match"
  },
  {
    "id": 26028,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\n“Mike Gibbons got upset tonight that he was called out for his investments in Chinese oil,” said Scott Guthrie, Mandel’s campaign manager.",
    "author": "",
    "title": "Ohio GOP Senate debate turns nasty as Gibbons and Mandel go nose-to-nose"
  },
  {
    "id": 26008,
    "mediaId": 2748,
    "date": "2022-03-19",
    "sentence": "Ohio Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons were so close to blows that the moderator was forced to step in and get between the pair before the altercation could worsen.",
    "author": "STATION GOSSIP",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 25609,
    "mediaId": 2662,
    "date": "2022-03-19",
    "sentence": "Both candidates are currently sitting atop the polls, with <span class='selected-term'>Josh Mandel</span> being the consensus front-runner for months, and Gibbons coming on strong of late, surging to the top spot among GOP Senate candidates in two recent independent surveys.",
    "author": "Julian Conradson",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 25841,
    "mediaId": 2528,
    "date": "2022-03-19",
    "sentence": "\"He doesn't have the temperament, experience, or fortitude to be a US Senator and Ohio voters got a first-hand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become and that will be reflected on the ballot on May 3,\" she added.",
    "author": "Kelsey Vlamis",
    "title": "2 GOP frontrunners in the Ohio Senate race squared off during a heated debate moment: 'You watch what happens'"
  },
  {
    "id": 25745,
    "mediaId": 2727,
    "date": "2022-03-21",
    "sentence": "“We all volunteered to serve our country away from our families, putting our lives in danger, so people like Mike Gibbons could make millions.”\nGibbons said Mandel initiated the physical aggression and made “several false, petty comments in an attempt to smear the new front-runner.”\n“<span class='selected-term'>Josh Mandel</span> is unhinged, unfit and flailing — because he’s losing,” Gibbons campaign spokesperson Samantha Cotten said.",
    "author": "AP and TOI staff",
    "title": "Near-fight at Ohio GOP Senate debate between candidates Josh Mandel, Mike Gibbons"
  },
  {
    "id": 26162,
    "mediaId": 2640,
    "date": "2022-03-21",
    "sentence": "The debate became intense almost as soon as it began as former state treasurer <span class='selected-term'>Josh Mandel</span> attacked investment banker Mike Gibbons' business dealings in his opening remarks.",
    "author": "",
    "title": "Vets Demand Apology After Tense Clash in GOP Debate"
  },
  {
    "id": 25920,
    "mediaId": 2740,
    "date": "2022-03-28",
    "sentence": "Among them are former Ohio Republican Party chair Jane Timken, Ohio State Sen. Matt Dolan, Cleveland businessman Mike Gibbons and former Ohio treasurer <span class='selected-term'>Josh Mandel</span>.",
    "author": "Orlando Mayorquin",
    "title": "Ohio Senate race: What to know about JD Vance, venture capitalist running for office"
  },
  {
    "id": 26109,
    "mediaId": 2644,
    "date": "2022-04-05",
    "sentence": "At a debate last month, Gibbons and former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, currently second in GOP primary polls, came close to a physical altercation on stage as Mandel slammed Gibbons for business links to China.",
    "author": "Steven Nelson",
    "title": "Ohio GOP Senate front-runner panned for taking $1.5M in PPP funds for bank"
  },
  {
    "id": 26319,
    "mediaId": 2752,
    "date": "2022-04-05",
    "sentence": "Republican Senate candidate <span class='selected-term'>Josh Mandel</span> of Ohio just received Ted Cruz’s endorsement, which is highly coveted by at least a couple people who aren’t Ted Cruz.",
    "author": "Stephen Robinson",
    "title": "Ted Cruz Endorses GOP Senate Candidate Josh Mandel, Who’s Almost As Terrible As He Is"
  },
  {
    "id": 26189,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Other primary candidates include investment banker Mike Gibbons, former Ohio treasurer <span class='selected-term'>Josh Mandel</span>, and Jane Timken, the former chair of the Ohio Republican Party.",
    "author": "Gustaf Kilander",
    "title": "JD Vance accused of racism over new campaign ad in which he asks ‘Do you hate Mexicans?’"
  },
  {
    "id": 26237,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "Via AP news wire",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26388,
    "mediaId": 2822,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH - Associated Press",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26393,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary - Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance - scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open U.S. Senate seat"
  },
  {
    "id": 26125,
    "mediaId": 2680,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 25804,
    "mediaId": 2560,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary – Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance – scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 25884,
    "mediaId": 2680,
    "date": "2022-04-14",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair Jane Timken for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "GOP leaders in Ohio try to block Trump endorsement of Vance"
  },
  {
    "id": 26105,
    "mediaId": 2721,
    "date": "2022-04-15",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair Jane Timken for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "",
    "title": "Trump to make huge announcement; GOP unhappy?"
  },
  {
    "id": 26087,
    "mediaId": 2640,
    "date": "2022-04-15",
    "sentence": "Sources told NBC News Thursday that the president is on the verge of endorsing the Hillbilly Elegy author, but other Republicans including rival candidate <span class='selected-term'>Josh Mandel</span> are fighting hard to prevent it.",
    "author": "Rob Quinn",
    "title": "Ohio Republicans Are Trying to Stop a Trump Endorsement"
  },
  {
    "id": 25695,
    "mediaId": 2919,
    "date": "2022-04-15",
    "sentence": "Vance has been locked in a heated race against former state treasurer <span class='selected-term'>Josh Mandel</span>, investment banker Mike Gibbons, former Ohio Republican Party chair Jane Timken, and state Sen. Matt Dolan, whose family owns the Cleveland Guardians.",
    "author": "Associated Press",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 26354,
    "mediaId": 2680,
    "date": "2022-04-15",
    "sentence": "The decision marks a major blow for Vance's top rivals — former state treasurer <span class='selected-term'>Josh Mandel</span>, investment banker Mike Gibbons and former Ohio Republican Party chair Jane Timken — who have been locked in a heated and contentious race for both the nomination and Trump's backing in a primary that is now less than three weeks away.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  }
]