[
  {
    "id": 26470,
    "mediaId": 2522,
    "date": "2022-01-25",
    "sentence": "Others running in the race include former Ohio treasurer and two-time Senate candidate <span class='selected-term'>Josh Mandel</span>; former Ohio GOP Chair Jane Timken; Cleveland businessman and luxury auto dealership giant Bernie Moreno; 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer, and investment banker; and Matt Dolan, a longtime state lawmaker whose family owns Major League Baseball’s Cleveland Guardians.",
    "author": "Terresa Monroe-Hamilton",
    "title": "JD Vance massively triggers left with glowing MTG endorsement, vow to take country back from ‘scumbags’"
  },
  {
    "id": 26465,
    "mediaId": 2629,
    "date": "2022-01-27",
    "sentence": "Former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, who is seeking the GOP nomination for the Senate seat being vacated by retiring Ohio Republican Sen.",
    "author": "Josh Israel",
    "title": "GOP Already Attacking Unnamed SCOTUS Nominee With Racist Dog Whistles"
  },
  {
    "id": 25863,
    "mediaId": 2688,
    "date": "2022-02-16",
    "sentence": "The mayor’s resignation comes a few months after he raised hell over what he called “pornographic content” in a school textbook, earning him an endorsement from Ohio GOP Senate candidate <span class='selected-term'>Josh Mandel</span> at the time.",
    "author": "Cristina Cabrera",
    "title": "TFW Your Insurrection Fails And You Have To Settle For Olive Garden"
  },
  {
    "id": 26062,
    "mediaId": 2602,
    "date": "2022-03-23",
    "sentence": "One is <span class='selected-term'>Josh Mandel</span>, who is running for the Republican Senate nomination in Ohio to succeed the retiring more moderate Rob Portman.",
    "author": "DOUGLAS BLOOMFIELD",
    "title": "Expectations are low for the congressional mid-term elections - opinion"
  },
  {
    "id": 25920,
    "mediaId": 2740,
    "date": "2022-03-28",
    "sentence": "Among them are former Ohio Republican Party chair Jane Timken, Ohio State Sen. Matt Dolan, Cleveland businessman Mike Gibbons and former Ohio treasurer <span class='selected-term'>Josh Mandel</span>.",
    "author": "Orlando Mayorquin",
    "title": "Ohio Senate race: What to know about JD Vance, venture capitalist running for office"
  }
]