[
  {
    "id": 26509,
    "mediaId": 2636,
    "date": "2022-01-11",
    "sentence": "",
    "author": "",
    "title": "The Strange Alliance of Crypto and MAGA Believers"
  },
  {
    "id": 26457,
    "mediaId": 2636,
    "date": "2022-01-12",
    "sentence": "I had some fun yesterday with a tweet by <span class='selected-term'>Josh Mandel</span>, the would-be MAGA senator from Ohio, who has declared his allegiance to fundamental American values: God, family and Bitcoin.",
    "author": "",
    "title": "Is Government Money Creation Actually Enabling Deficit Spending?"
  },
  {
    "id": 26479,
    "mediaId": 2803,
    "date": "2022-01-20",
    "sentence": "Separation of money and state, not separation of church and state.#Bitcoin\n— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) January 10, 2022\nStates that submit to the authority of Almighty God // states that don’t\nStates that are pro-family // states that aren’t\nStates that invest in #bitcoin infrastructure // states that won’t\nOhio must be a pro-God, pro-family, pro-bitcoin state.",
    "author": "Aaron Mak",
    "title": "When Did Crypto Become Republican?"
  },
  {
    "id": 26508,
    "mediaId": 6545,
    "date": "2022-01-20",
    "sentence": "Music store manager <span class='selected-term'>Josh Mandel</span> says flooding reached 5 feet in September and left a mess in his shop.",
    "author": "",
    "title": "Mamaroneck Finally Receiving Much-Needed Funds For Flood Mitigation Projects"
  },
  {
    "id": 26483,
    "mediaId": 6676,
    "date": "2022-01-21",
    "sentence": "With the former president slow to issue an endorsement in the race a number of heavyweight candidates are actively jockeying for his support, including former state Treasurer <span class='selected-term'>Josh Mandel</span>, entrepreneur and author JD Vance and former state GOP Chair Jane Timken.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "These Senate seats are up for election in 2022"
  },
  {
    "id": 26448,
    "mediaId": 2702,
    "date": "2022-01-21",
    "sentence": "With the former president slow to issue an endorsement in the race a number of heavyweight candidates are actively jockeying for his support, including former state Treasurer <span class='selected-term'>Josh Mandel</span>, entrepreneur and author JD Vance and former state GOP Chair Jane Timken.",
    "author": "Mychael Schnell",
    "title": "These Senate seats are up for election in 2022"
  },
  {
    "id": 26453,
    "mediaId": 2741,
    "date": "2022-01-21",
    "sentence": "A few weeks ago, Republican congressional candidate <span class='selected-term'>Josh Mandel</span> listed his love of Bitcoin beside his commitment to the “Almighty God” and his family, while outlining the issues he represents.",
    "author": "Caleb Ecarma",
    "title": "Eric Adams Pulls Crypto-Paycheck Stunt Hours Before Bitcoin Crash"
  },
  {
    "id": 26470,
    "mediaId": 2522,
    "date": "2022-01-25",
    "sentence": "Others running in the race include former Ohio treasurer and two-time Senate candidate <span class='selected-term'>Josh Mandel</span>; former Ohio GOP Chair Jane Timken; Cleveland businessman and luxury auto dealership giant Bernie Moreno; 2018 Ohio Republican Senate candidate Mike Gibbons, a Cleveland entrepreneur, real estate developer, and investment banker; and Matt Dolan, a longtime state lawmaker whose family owns Major League Baseball’s Cleveland Guardians.",
    "author": "Terresa Monroe-Hamilton",
    "title": "JD Vance massively triggers left with glowing MTG endorsement, vow to take country back from ‘scumbags’"
  },
  {
    "id": 26495,
    "mediaId": 2716,
    "date": "2022-01-25",
    "sentence": "Other GOP candidates running for U.S. Senate in Ohio include \"former state Republican Party Chairwoman Jane Timken, former state Treasurer <span class='selected-term'>Josh Mandel</span>, businessman Bernie Moreno and investment banker Mike Gibbons,\" The Hill notes.",
    "author": "Brigid Kennedy",
    "title": "Ohio Senate candidate JD Vance 'honored' to have Marjorie Taylor Greene's endorsement"
  },
  {
    "id": 26527,
    "mediaId": 2702,
    "date": "2022-01-25",
    "sentence": "> From censure to out-and-out political targeting, progressives want to challenge fellow Democrats they believe stand in the way of their agenda in Congress, reports The Hill’s Hanna Trudo, who offers five 2022 examples: Jessica Cisneros is challenging Rep. Henry Cuellar (Texas); Rana Abdelhamid wants to defeat Rep. Carolyn Maloney (New York); Kina Collins is targeting Rep. Danny K. Davis (Illinois); Odessa Kelly is taking aim at Rep. Jim Cooper (Tennessee); and Ohio underdog Morgan Harper would like to best Rep. Tim Ryan for contention in the state’s Senate primary in May (she will face off during a debate on Thursday against Republican Senate candidate <span class='selected-term'>Josh Mandel</span> in Columbus) (Cleveland.com).",
    "author": "",
    "title": "The Hill’s Morning Report – Biden, NATO eye ‘all scenarios’ with Russia"
  },
  {
    "id": 26587,
    "mediaId": 2723,
    "date": "2022-01-26",
    "sentence": "https://t.co/Waw8gcmkb4 @CWforA @YWforA — Penny Nance (@PYNance) January 26, 2022\n\nProclaiming that the Senate is the “our last line of defense against radical leftist SCOTUS justices,” Ohio Republican Senate candidate <span class='selected-term'>Josh Mandel</span> used the opportunity to promote his own campaign.",
    "author": "Kyle Mantyla, Right Wing Watch, David Badash",
    "title": "Influential Far Right Conservatives Ballistic Over Breyer Retirement: 'They Must Be Stopped'"
  },
  {
    "id": 26523,
    "mediaId": 2547,
    "date": "2022-01-26",
    "sentence": "Then he showed a creepy clip or talking point spewing robot man, <span class='selected-term'>Josh Mandel</span>, a GOP candidate from Ohio who repeated this right wing talking point: \"We need to get rid of this January 6th commission and replace it with a November 3rd commission.",
    "author": "Red Painter",
    "title": "Jim Acosta Mocks The Cowardly GOP Of 2022"
  },
  {
    "id": 26525,
    "mediaId": 4040,
    "date": "2022-01-26",
    "sentence": "https://t.co/Waw8gcmkb4 @CWforA @YWforA\n— Penny Nance (@PYNance) January 26, 2022\nProclaiming that the Senate is the “our last line of defense against radical leftist SCOTUS justices,” Ohio Republican Senate candidate <span class='selected-term'>Josh Mandel</span> used the opportunity to promote his own campaign.",
    "author": "Kyle Mantyla",
    "title": "‘They Must Be Stopped’: Right-Wing Reactions to the News of Justice Stephen Breyer’s Retirement"
  },
  {
    "id": 26462,
    "mediaId": 2594,
    "date": "2022-01-26",
    "sentence": "Mr Vance's pivot from folksy intellectual to belligerent “patriot” is likely a tactic employed to take on his primary rival, former Ohio State Treasurer <span class='selected-term'>Josh Mandel</span>.",
    "author": "Graig Graziosi",
    "title": "JD Vance mocked for celebrating Marjorie Taylor Greene endorsement as he vows to take US back from ‘scumbags’"
  },
  {
    "id": 26465,
    "mediaId": 2629,
    "date": "2022-01-27",
    "sentence": "Former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, who is seeking the GOP nomination for the Senate seat being vacated by retiring Ohio Republican Sen.",
    "author": "Josh Israel",
    "title": "GOP Already Attacking Unnamed SCOTUS Nominee With Racist Dog Whistles"
  },
  {
    "id": 26520,
    "mediaId": 2590,
    "date": "2022-01-27",
    "sentence": "Harper, 38, shot back: “What we don’t need to happen is have <span class='selected-term'>Josh Mandel</span> talk for the Black community.”\nAt one point, Mandel called Harper a “looney Nancy Pelosi” for “advocating for all this green energy” when Harper pledged to support renewable energy to help mitigate climate change.",
    "author": "Liz Skalka",
    "title": "A Hard-Right Republican And A Progressive Debated. It Went As Well As You'd Expect."
  },
  {
    "id": 26522,
    "mediaId": 2509,
    "date": "2022-01-27",
    "sentence": "The unorthodox event is set to take place on Thursday in Columbus and will feature Democrat Morgan Harper and Republican <span class='selected-term'>Josh Mandel</span>.",
    "author": "ByRick Klein,Averi Harper",
    "title": "Democrats seek reboot around Supreme Court vacancy: The Note"
  },
  {
    "id": 26543,
    "mediaId": 2594,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican <span class='selected-term'>Josh Mandel</span> and Democrat Morgan Harper, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "Via AP news wire",
    "title": "Ryan, not onstage, takes central focus at Ohio Senate event"
  },
  {
    "id": 26544,
    "mediaId": 2728,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican <span class='selected-term'>Josh Mandel</span> and Democrat Morgan Harper, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "Julie Carr Smyth",
    "title": "Tim Ryan, not onstage, is early focus of Ohio Senate event"
  },
  {
    "id": 26532,
    "mediaId": 2679,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican <span class='selected-term'>Josh Mandel</span> and Democrat Morgan Harper, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "JULIE CARR SMYTH",
    "title": "Tim Ryan, not onstage, is early focus of Ohio Senate event"
  },
  {
    "id": 26541,
    "mediaId": 2524,
    "date": "2022-01-28",
    "sentence": "Sheriffs in Ohio asked US Senate candidate, <span class='selected-term'>Josh Mandel</span>, to leave a school board meeting on Monday after he took the mic to bash transgender students.",
    "author": "Carla Sinclair",
    "title": "Josh Mandel is the most idiotic robot running for Senate in Ohio, making him GQP's frontrunner"
  },
  {
    "id": 26589,
    "mediaId": 2575,
    "date": "2022-01-28",
    "sentence": "by 8 posted onby aynrandfreak (Being a Democrat means never having to say you're sorry)\n\nTo: aynrandfreak\n\nMasters\n\n\n\nby 9 posted onby aynrandfreak (Being a Democrat means never having to say you're sorry)\n\nTo: T Ruth\n\nJohn Berman (Republican)\n\nMatt Dolan (Republican)\n\nMike Gibbons (Republican)\n\nJD Vance (Republican)\n\nMichael Leipold (Republican)\n\n<span class='selected-term'>Josh Mandel</span> (Republican)\n\nBernie Moreno (Republican)\n\nZachary Musick (Republican)\n\nNeil Patel (Republican)\n\nMark Pukita (Republican)\n\nJohn Reed (Republican)\n\nMackenzie Thompson (Republican)\n\nJane Timken (Republican) Morgan Harper (Democratic)\n\nTim Ryan (Democratic)\n\n\n\nby 10 posted onby kiryandil (China Joe and Paycheck Hunter - the Chink in America's defenses)\n\nTo: alstewartfan\n\nshhhhhhhhhhhhhh!",
    "author": "",
    "title": "U.S. Senate candidates Josh Mandel and Morgan Harper discuss race, environment in debate"
  },
  {
    "id": 26454,
    "mediaId": 2919,
    "date": "2022-01-28",
    "sentence": "“I’m going to take a message to the Black community about why freedom and liberty and parental control of our kids is the right way, not in government control of our kids.”\nBaffled, Harper retorted, “What we don’t need to have happen is <span class='selected-term'>Josh Mandel</span>’s speaking in any way for the Black community.",
    "author": "Nick Evans",
    "title": "Morgan Harper and Josh Mandel face off in Senate debate"
  },
  {
    "id": 26492,
    "mediaId": 4040,
    "date": "2022-01-31",
    "sentence": "John Fea @ Current: Ohio Senate candidate <span class='selected-term'>Josh Mandel</span> does not believe in the separation of church and state.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: That’s Not Voltaire You’re Quoting"
  },
  {
    "id": 26482,
    "mediaId": 2658,
    "date": "2022-02-01",
    "sentence": "In 2018, Ohio’s then-treasurer, Republican <span class='selected-term'>Josh Mandel</span>, unveiled a program to let businesses pay some taxes in Bitcoin, the most popular cryptocurrency.",
    "author": "",
    "title": "A crypto breakthrough? Western states consider taking digital currency"
  },
  {
    "id": 26530,
    "mediaId": 2594,
    "date": "2022-02-01",
    "sentence": "Notable examples include Harriet Hageman, a Republican running to oust Rep Liz Cheney in Wyoming, as well as several candidates including <span class='selected-term'>Josh Mandel</span> in the Ohio Senate race.",
    "author": "John Bowden",
    "title": "Trump says war chest has more than $122m cash on hand after huge 2021 haul"
  },
  {
    "id": 26402,
    "mediaId": 2643,
    "date": "2022-02-03",
    "sentence": "In March 2021, Twitter temporarily restricted Ohio U.S. Senate candidate <span class='selected-term'>Josh Mandel</span> in Match for violating the social media platform's rules.",
    "author": "Charlotte Trattner",
    "title": "Ohio Bill Could Make It Easier to Sue Social Media Companies Over Censorship"
  },
  {
    "id": 26302,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "",
    "author": "Jordan Dixon-Hamilton",
    "title": "Bernie Moreno Suspends U.S. Senate Campaign"
  },
  {
    "id": 25658,
    "mediaId": 6598,
    "date": "2022-02-03",
    "sentence": "His departure from the race could allow others to consolidate support as former state treasurer <span class='selected-term'>Josh Mandel</span> has been an early frontrunner.",
    "author": "Andrew J. Tobias",
    "title": "Bernie Moreno drops out of Ohio’s Republican U.S. Senate race"
  },
  {
    "id": 26031,
    "mediaId": 4040,
    "date": "2022-02-03",
    "sentence": "Liz Skalka @ HuffPost: <span class='selected-term'>Josh Mandel</span> May Be Trolling The GOP.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: President Taylor Greene"
  },
  {
    "id": 26292,
    "mediaId": 2710,
    "date": "2022-02-04",
    "sentence": "Lee’s PAC doled out campaign cash to several Republican candidates, including Ohio Senate candidate <span class='selected-term'>Josh Mandel</span>, Florida Sen. Marco Rubio and Utah Rep. Chris Stewart.",
    "author": "Bryan Schott",
    "title": "Who is leading the 2022 money race for Utah’s congressional seats?"
  },
  {
    "id": 26409,
    "mediaId": 2630,
    "date": "2022-02-04",
    "sentence": "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\n<span class='selected-term'>Josh Mandel</span>, Ohio state treasurer, at a campaign stop for Sen. Marco Rubio, then a Republican presidential candidate, in Cleveland in 2015.Aaron Josefczyk / Reuters file\n‘He seemed like a totally normal, regular Republican’\nAmbition drove Mandel more than ideology early in his career, and establishment Republicans who saw in him a young and polite Jewish veteran who clicked with swing voters were eager to accommodate his quick rise.",
    "author": "",
    "title": "Josh Mandel foreshadowed Trump’s rise. His Ohio Senate bid is a test of what’s next."
  },
  {
    "id": 26363,
    "mediaId": 2687,
    "date": "2022-02-05",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Why Trump Hasn’t Endorsed Josh Mandel"
  },
  {
    "id": 25941,
    "mediaId": 2738,
    "date": "2022-02-05",
    "sentence": "Sources tell The Daily Beast that Trump, a lover of gossip, has “privately regurgitated, often in disgust, a wide range of unverified, often completely unvetted, and lurid rumors about the MAGA candidate.” One source told the publication that Trump “has used the term ‘f*cking weird’ to describe <span class='selected-term'>Josh Mandel</span> more than once,” and that he “has talked about [Mandel] and sex in the same sentence more times than I would have liked to hear.” (Reminder, by the way, that Trump has also been credibly accused of sexual misconduct by over two dozen women.)",
    "author": "Matt Prigge",
    "title": "A MAGA-fied Candidate Is Having Trouble Getting Trump’s Endorsement Due To Rumors Of His ‘F*cking Weird’ Sex Life"
  },
  {
    "id": 26163,
    "mediaId": 2664,
    "date": "2022-02-05",
    "sentence": "According to one source close to Trump, \"The [former] president has used the term ‘f*cking weird’ to describe <span class='selected-term'>Josh Mandel</span> more than once, when I have spoken to him about [Mandel].",
    "author": "Tom Boggioni",
    "title": "Trump holding up Senate endorsement as he obsesses over sex rumors about 'weirdo' candidate: report"
  },
  {
    "id": 25911,
    "mediaId": 2752,
    "date": "2022-02-07",
    "sentence": "When sentient slime trail Marjorie Taylor Greene, who is somehow a member of Congress, endorsed Senate candidate, author, and asshole JD Vance, we wondered why she’d stiffed <span class='selected-term'>Josh Mandel</span>, a seemingly more authentic MAGA zealot.",
    "author": "Stephen Robinson",
    "title": "Trump Pretty Sure Josh Mandel Too Unf*ckable For Endorsement"
  },
  {
    "id": 25820,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "\"Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival <span class='selected-term'>Josh Mandel</span>, which have portrayed Vance as an anti-Trump figure,\" writes Politico.",
    "author": "Brad Reed",
    "title": "JD Vance's campaign is going down in flames -- and his pollster warns he needs a 'course correction ASAP'"
  },
  {
    "id": 25912,
    "mediaId": 2663,
    "date": "2022-02-08",
    "sentence": "I received no apology, no communication, nothing.”\nRelated: GOP candidate <span class='selected-term'>Josh Mandel</span> just mocked a queer teenager on Twitter because of course he did\nThen yesterday, two days after the tweet had gone out, Youngkin finally issued a statement, blaming the whole thing on a staffer who he claims wasn’t authorized to tweet from the account.",
    "author": "Graham Gremore",
    "title": "Gov. Glenn Youngkin opposes gay marriage but thinks doxing teenagers on Twitter is OK"
  },
  {
    "id": 26252,
    "mediaId": 2664,
    "date": "2022-02-08",
    "sentence": "As Alex Eisenstadt writes for Politico about a freak-out internal memo from within the campaign of JD Vance, the wealthy investor challenging perennial GOP candidate <span class='selected-term'>Josh Mandel</span>:\n“Vance’s decline follows a $2 million-plus TV ad campaign from the Club for Growth and USA Freedom Fund, outside groups that are backing Vance rival Josh Mandel, which have portrayed Vance as an anti-Trump figure.” (In reality, Vance has embraced Trump like a teenager mooning over a rock star.)",
    "author": "Thom Hartmann",
    "title": "Has America reached the 'tipping point' where most are sickened by the GOP?"
  },
  {
    "id": 26316,
    "mediaId": 2660,
    "date": "2022-02-09",
    "sentence": "A super PAC supporting Republican <span class='selected-term'>Josh Mandel</span> for an open seat in Ohio claimed that Republican Jane Timken’s family business moved jobs to China.",
    "author": "Tom Kertscher",
    "title": "In race for open US Senate seat in Missouri, fact-checking a PAC attack on Eric Schmitt over China"
  },
  {
    "id": 26147,
    "mediaId": 2643,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Mark Davis",
    "title": "Big Government is a Constant Threat to Religious Liberty | Opinion"
  },
  {
    "id": 26064,
    "mediaId": 2699,
    "date": "2022-02-09",
    "sentence": "The reason the frontrunner <span class='selected-term'>Josh Mandel</span>—“shitposter to the gods”—hasn’t scored that sweet Trumpy stamp of approval is because Trump thinks he’s “fucking weird.”\nWhat’s more, this is something Trump has been gossiping about far and wide: “he’s talked about how weird Mandel is, and there’s something just not right about him… he thinks he’s a dork, he thinks he has zero charisma, he thinks he’s bad on TV.\"",
    "author": "The Daily Beast",
    "title": "MAGA Extremists Slam the Upcoming Super Bowl Halftime Show as ‘Satanic’"
  },
  {
    "id": 25663,
    "mediaId": 2537,
    "date": "2022-02-09",
    "sentence": "One of <span class='selected-term'>Josh Mandel</span>'s final edicts as state treasurer was to allow Ohio businesses to pay their taxes with bitcoin.",
    "author": "Haley BeMiller",
    "title": "God, family and bitcoin? How cryptocurrency found its way to Ohio's U.S. Senate race"
  },
  {
    "id": 25624,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "Two Republican U.S. Senate candidates in Ohio spoke out strongly against the removal of Newsmax from the Midwestern telecom giant Cincinnati Bell in separate appearances Thursday on ''Spicer & Co.''\n<span class='selected-term'>Josh Mandel</span>, the former Ohio state treasurer, asserted that he would ''take on any company'' ... ''if they're trampling our First Amendment rights.''",
    "author": "Luca Cacciatore",
    "title": "Josh Mandel, Jane Timken Slam Cincinnati Bell for Dropping Newsmax"
  },
  {
    "id": 25631,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "And like her Ohio U.S. Senate candidate colleague <span class='selected-term'>Josh Mandel</span> on the segment before her, Timken said that local telecom provider Cincinnati Bell's decision to drop Newsmax was \"against our First Amendment.\"",
    "author": "Luca Cacciatore",
    "title": "Jane Timken to Newsmax: 'I Stood Up and Delivered for President Trump'"
  },
  {
    "id": 25641,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "Two Republican U.S. Senate candidates in Ohio spoke out strongly against the removal of Newsmax from the Midwestern telecom giant Cincinnati Bell in separate appearances Thursday on ''Spicer & Co.''\n<span class='selected-term'>Josh Mandel</span>, the former Ohio state treasurer, asserted that he would ''take on any company'' ... ''if they're trampling our First Amendment rights.''",
    "author": "Luca Cacciatore",
    "title": "Josh Mandel, Jane Timken Slam Cincinnati Bell for Dropping Newsmax"
  },
  {
    "id": 25686,
    "mediaId": 2693,
    "date": "2022-02-10",
    "sentence": "J. D. Vance may be running aground in Ohio\nAccording to some internal polling which made its way into the public domain, it looks like <span class='selected-term'>Josh Mandel</span> has the upper hand in the Ohio GOP Senate primary over J. D. Vance.",
    "author": "Scott McKay",
    "title": "Five Quick Things: Why Aren’t Black Politicians Crushing Biden Over Inflation?"
  },
  {
    "id": 25785,
    "mediaId": 6428,
    "date": "2022-02-10",
    "sentence": "With rhetoric like that, the dividing lines were drawn with Republicans like U.S. Rep. Liz Cheney (R-WY) on one side saying the election was not stolen and Senate candidates like Ohio's <span class='selected-term'>Josh Mandel</span> claiming the opposite.",
    "author": "David Brody",
    "title": "From Reagan to Trump: GOP Navigates Changing Landscape"
  },
  {
    "id": 26425,
    "mediaId": 2688,
    "date": "2022-02-10",
    "sentence": "pic.twitter.com/YbvVgHZDNr\n— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) October 19, 2021\nKansas GOP’s Second Shot At Map Veto Override Succeeds\nAfter initially failing on Monday, Kansas’ GOP-controlled legislature had the votes on Wednesday and Tuesday to form supermajorities in the state Senate and House, respectively, to override Democratic Gov.",
    "author": "Cristina Cabrera",
    "title": "Republican Mayor Argues Ice Fishing Leads To Prostitution"
  },
  {
    "id": 25732,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "A Coefficient poll of 613 likely voters found businessman Mike Gibbons leading a crowd of six candidates with 20% support and former state treasurer <span class='selected-term'>Josh Mandel</span> in second with 18% support.",
    "author": "Michael Ginsberg",
    "title": "New Ohio Senate Poll Shows More Bad News For JD Vance"
  },
  {
    "id": 26023,
    "mediaId": 2660,
    "date": "2022-02-11",
    "sentence": "A super PAC supporting Republican <span class='selected-term'>Josh Mandel</span> for an open seat in Ohio claimed that Republican Jane Timken’s family business moved jobs to China.",
    "author": "Tom Kertscher",
    "title": "No evidence for Senate hopeful McCormick’s claim that China created COVID-19"
  },
  {
    "id": 26038,
    "mediaId": 2752,
    "date": "2022-02-14",
    "sentence": "A rational person would repeat this trick in Ohio and Missouri as well, where chaotic primaries threaten to allow weirdos like <span class='selected-term'>Josh Mandel</span> or Eric Greitens to jeopardize what should otherwise be winnable seats.",
    "author": "Liz Dye",
    "title": "Mitch McConnell And The 'Moderates' Really Think They're Going To Take GOP Back From Trump"
  },
  {
    "id": 25742,
    "mediaId": 2602,
    "date": "2022-02-14",
    "sentence": "“In hindsight that was definitely a mistake on the part of whoever went over there,” Roegner said, adding that perhaps the people who brought the flag “didn’t know he was Jewish,” but “I could see how that could be misinterpreted if you’re Jewish.”\nDays later, Roegner had changed course slightly, saying in a Feb. 5 statement, “I support the constitutional right to peacefully assemble and of free speech, however I can never support personal intimidation or character attacks from either side.”\nTauring added, as evidence that this was not antisemitic, that he had recently met for dinner with <span class='selected-term'>Josh Mandel</span>, an Ohio Republican candidate for US Senate who is Jewish, to discuss his candidacy.",
    "author": "STEPHEN LANGEL/JTA, RON KAMPEAS/JTA",
    "title": "‘Christian veterans’ harrass Jewish Democrat over COVID laws"
  },
  {
    "id": 25675,
    "mediaId": 2643,
    "date": "2022-02-14",
    "sentence": "He's running against pro-Trump candidates like JD Vance, <span class='selected-term'>Josh Mandel</span> and Jane Timken.",
    "author": "Patricia McKnight",
    "title": "Trump May Bypass Big Names Mandel, Vance in Ohio Race for Unknown Dolan"
  },
  {
    "id": 26433,
    "mediaId": 4018,
    "date": "2022-02-14",
    "sentence": "“In hindsight that was definitely a mistake on the part of whoever went over there,” Roegner said, adding that perhaps the people who brought the flag “didn’t know he was Jewish,” but “I could see how that could be misinterpreted if you’re Jewish.”\nDays later, Roegner had changed course slightly, saying in a Feb. 5 statement, “I support the constitutional right to peacefully assemble and of free speech, however I can never support personal intimidation or character attacks from either side.”\nTauring added, as evidence that this was not antisemitic, that he had recently met for dinner with <span class='selected-term'>Josh Mandel</span>, an Ohio Republican candidate for U.S. Senate who is Jewish, to discuss his candidacy.",
    "author": "Stephen Langel",
    "title": "‘Christian veterans’ protest outside Jewish politician’s home as pastor compares vaccine mandates to Nazis"
  },
  {
    "id": 26382,
    "mediaId": 2699,
    "date": "2022-02-15",
    "sentence": "Along with Walker, they include Ohio Senate hopeful <span class='selected-term'>Josh Mandel</span>, Trump White House doctor turned Texas congressional candidate Ronny Jackson, Peter Thiel-backed Arizona Senate candidate Blake Masters, Alabama gubernatorial challenger and Trump’s former ambassador to Slovenia Lynda Blanchard, and Kelly Tshibaka, who is taking on Trump target Sen. Lisa Murkowski in the Alaska Republican primary.",
    "author": "Roger Sollenberger",
    "title": "Republicans Are Still Trying to Buy Trump’s Love"
  },
  {
    "id": 25644,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Last week, <span class='selected-term'>Josh Mandel</span>, the former Ohio state treasurer and the frontrunner in the 2022 Republican Senate race, told Spicer & Co. that he would ''take on any company'' ... ''if they're trampling our First Amendment rights.''",
    "author": "Newsmax Wires",
    "title": "Rand Paul to Cincinnati Bell Customers: 'Quit Them' Over Newsmax Cancellation"
  },
  {
    "id": 25806,
    "mediaId": 2636,
    "date": "2022-02-15",
    "sentence": "“The <span class='selected-term'>Josh Mandel</span> of 2003 — of 2016, even — would not recognize the Josh Mandel of 2021.”\nROB ZIMMERMAN, a Democrat who raised funds for Mr. Mandel, a Republican Senate candidate from Ohio who has taken a hard right turn politically from his moderate roots.",
    "author": "",
    "title": "Quotation of the Day: Stark Transformation From Ohio Moderate to Trump’s ‘No. 1 Ally’"
  },
  {
    "id": 25889,
    "mediaId": 2636,
    "date": "2022-02-15",
    "sentence": "What to read\nJennifer Medina and Lisa Lerer profile <span class='selected-term'>Josh Mandel</span>, a Republican Senate candidate of Ohio, and his political journey to the far right.",
    "author": "",
    "title": "The liberal group American Bridge is launching a new project to collect information for campaigns against Republicans running for state and local offices."
  },
  {
    "id": 25898,
    "mediaId": 2664,
    "date": "2022-02-15",
    "sentence": "The <span class='selected-term'>Josh Mandel</span> of 2003 — of 2016, even — would not recognize the Josh Mandel of 2021,\" Zimmerman added before admitting, \"This has broken my heart.”\nRepublican donor Brad Kastan believes the aspiring senator has made a big mistake expressing a belief that Mandel is “painting himself into a corner so far out that he can’t win” come November if he gets through the primary.",
    "author": "Tom Boggioni",
    "title": "'This has broken my heart': Josh Mandel called out by former supporters for trying to become the new Trump"
  },
  {
    "id": 25863,
    "mediaId": 2688,
    "date": "2022-02-16",
    "sentence": "The mayor’s resignation comes a few months after he raised hell over what he called “pornographic content” in a school textbook, earning him an endorsement from Ohio GOP Senate candidate <span class='selected-term'>Josh Mandel</span> at the time.",
    "author": "Cristina Cabrera",
    "title": "TFW Your Insurrection Fails And You Have To Settle For Olive Garden"
  },
  {
    "id": 25682,
    "mediaId": 2699,
    "date": "2022-02-16",
    "sentence": "?I hope that there will not be some sort of global economic incident of note triggered by cryptocurrency,” says Roth, in a sentence that will surely seem prophetic in six months’ time), and how Ohio Senate primary candidate <span class='selected-term'>Josh Mandel</span>—the one whose alleged sex life Trump likes to gossip about—“looks like he just hatched out of something.”\nAnd finally, the hosts unpack how QAnon-loving Congresswoman Marjorie Taylor Greene has become a prime kingmaker in GOP political endorsements, and update us on what’s going on with MAGA election clerk Tina Peters, who tried to hide her iPad from the authorities, with violent results.",
    "author": "The Daily Beast",
    "title": "The Right-Wing Movements Inspired by Canadian Truckers Are Only ‘Picking Up Steam’"
  },
  {
    "id": 26283,
    "mediaId": 4040,
    "date": "2022-02-16",
    "sentence": "Jennifer Medina and Lisa Lerer @ The New York Times: How <span class='selected-term'>Josh Mandel</span>, Son of Suburban Ohio, Became a Right-Wing Warrior.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: Rise of a Right-Wing Warrior"
  },
  {
    "id": 26590,
    "mediaId": 2575,
    "date": "2022-02-16",
    "sentence": "One internal campaign poll showed him in the lead with 23%, with <span class='selected-term'>Josh Mandel</span>, the former Ohio treasurer and the party’s 2012 Senate nominee, trailing him at 10.8%.",
    "author": "",
    "title": "Mike Gibbons casts himself as pro-Trump candidate in Ohio GOP Senate primary"
  },
  {
    "id": 25705,
    "mediaId": 2649,
    "date": "2022-02-17",
    "sentence": "The only major Republican candidate in the Ohio Senate race who did not rely on self-financing at all is <span class='selected-term'>Josh Mandel</span>, the pro-Trump former Ohio treasurer and Marine Corps veteran.",
    "author": "Katherine Huggins",
    "title": "Over $560 million in campaign contributions flooded 2022 Senate races in first year of midterm election cycle"
  },
  {
    "id": 25765,
    "mediaId": 2540,
    "date": "2022-02-17",
    "sentence": "Around that same time, Ohio Senate front-runner <span class='selected-term'>Josh Mandel</span> told a debate audience that \"I believe the election was stolen from Donald J.",
    "author": "Chris Cillizza",
    "title": "143 Republicans are running for Congress in Texas. Only 13 say the 2020 election was legitimate."
  },
  {
    "id": 25868,
    "mediaId": 4040,
    "date": "2022-02-18",
    "sentence": "Michael Kruse @ Politico: <span class='selected-term'>Josh Mandel</span> Could Be Ohio’s Next Senator.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: Worshippers of the Big Lie"
  },
  {
    "id": 25664,
    "mediaId": 2727,
    "date": "2022-02-18",
    "sentence": "“In hindsight that was definitely a mistake on the part of whoever went over there,” Roegner said, adding that perhaps the people who brought the flag “didn’t know he was Jewish,” but “I could see how that could be misinterpreted if you’re Jewish.”\nAdvertisement\nDays later, Roegner had changed course slightly, saying in a February 5 statement, “I support the constitutional right to peacefully assemble and of free speech, however I can never support personal intimidation or character attacks from either side.”\nTauring added, as evidence that this was not antisemitic, that he had recently met for dinner with <span class='selected-term'>Josh Mandel</span>, an Ohio Republican candidate for US Senate who is Jewish, to discuss his candidacy.",
    "author": "Andrew Lapin",
    "title": "‘Christian vets’ deny antisemitism at protest outside Jewish Ohio politician’s home"
  },
  {
    "id": 26021,
    "mediaId": 2564,
    "date": "2022-02-18",
    "sentence": "Vance is trailing <span class='selected-term'>Josh Mandel</span>, who knows how to be emollient to Trump.",
    "author": "",
    "title": "Opinion: Behold the Republican somersaults for Trump"
  },
  {
    "id": 26591,
    "mediaId": 2575,
    "date": "2022-02-18",
    "sentence": "",
    "author": "",
    "title": "Josh Mandel Could Be Ohio’s Next Senator. So What Does He Believe?"
  },
  {
    "id": 26309,
    "mediaId": 2745,
    "date": "2022-02-18",
    "sentence": "Vance is trailing <span class='selected-term'>Josh Mandel</span>, who knows how to be emollient to Trump.",
    "author": "",
    "title": "Opinion: Behold the Republican somersaults for Trump"
  },
  {
    "id": 26353,
    "mediaId": 2687,
    "date": "2022-02-18",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "What Does Josh Mandel Believe?"
  },
  {
    "id": 26444,
    "mediaId": 2746,
    "date": "2022-02-21",
    "sentence": "Mr. Greitens, who is running for Missouri’s open Senate seat, will deliver remarks on Friday, along with GOP Senate candidates <span class='selected-term'>Josh Mandel</span> of Ohio and Adam Laxalt of Nevada, a former state attorney general.",
    "author": "Mica Soellner",
    "title": "Disgraced ex-Missouri Gov. Eric Greitens to speak at CPAC"
  },
  {
    "id": 26133,
    "mediaId": 2526,
    "date": "2022-02-21",
    "sentence": "pic.twitter.com/6zG0ubtqf1\n— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) February 21, 2022\nIn his post, Mandel included an image of a screenshot of the notice he received from Facebook, which read, “You can’t post or comment for 24 hours,” because, “you previously posted something that didn’t follow our Community Standards.”\n“This post goes against our standards on hate speech, so only you can see it,” the message from Facebook added.",
    "author": "Alana Mastrangelo",
    "title": "Facebook Drops ‘Hate Speech’ Suspension for OH GOP Candidate Josh Mandel"
  },
  {
    "id": 25862,
    "mediaId": 2835,
    "date": "2022-02-21",
    "sentence": "Facebook suspended Ohio senate candidate <span class='selected-term'>Josh Mandel</span> for 24 hours after he posted an image that read, “Veterans Before Illegals,” which Facebook labeled “hate speech” and a violation of the company’s “community standards.” Facebook rescinded the ban and apologized to Mandel shortly after Breitbart News requested comment on the matter.",
    "author": "SIM Radio Network",
    "title": "Kyle's Conversation"
  },
  {
    "id": 25813,
    "mediaId": 2745,
    "date": "2022-02-22",
    "sentence": "He and the leading candidate in the primary, former state treasurer <span class='selected-term'>Josh Mandel</span>, have both offered vacuous misdirection about our border being more important than Ukraine’s.",
    "author": "",
    "title": "Opinion: J.D. Vance’s repulsive spin about Putin and Ukraine faces a new test"
  },
  {
    "id": 25635,
    "mediaId": 2557,
    "date": "2022-02-22",
    "sentence": "Don’t you suck up to him.”\nThe second <span class='selected-term'>Josh Mandel</span> v. Morgan Harper debate is going completely off the rails pic.twitter.com/DtZJZxmK40\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nPromoted Content\nMandel is just openly insulting Harper at this debate, to groans pic.twitter.com/YANuVOJn9X\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nAfter a debate in which Mandel called Harper dumb and scolded her for being “angry” about a dozen times, Harper refuses to shake his hand pic.twitter.com/yTuvfYDGzm\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nThe full debate is in the video below:\nHarper posted a video message on Tuesday, blasting Mandel, calling him a sexist and a racist.",
    "author": "DML News App",
    "title": "VIDEO: Debate erupts into chaos as Republican compares Dem to ‘dumber’ AOC"
  },
  {
    "id": 25622,
    "mediaId": 2578,
    "date": "2022-02-22",
    "sentence": "TRENDING: Muslim Youths Attack Easter Week Processions in Spain -- Pelt Christians with Rocks and Projectiles -- Police Called In (VIDEO)\n<span class='selected-term'>Josh Mandel</span>: You mean ‘put him out’ like kill him?",
    "author": "Jim Hoft",
    "title": "MANDEL BRINGS THE FIRE: GOP Candidate Josh Mandel SHREDS Vicious Audience Member During Senate Debate in Black Community – Then Destroys Dem Opponent (VIDEO)"
  },
  {
    "id": 25720,
    "mediaId": 2658,
    "date": "2022-02-22",
    "sentence": "The invitation\nDEBATE DEBACLE — Ohio GOP Senate candidate <span class='selected-term'>JOSH MANDEL</span> and Dem candidate MORGAN HARPER participated in a debate Monday evening.",
    "author": "",
    "title": "POLITICO Playbook: Today’s conundrum: What’s an ‘invasion’?"
  },
  {
    "id": 26068,
    "mediaId": 2643,
    "date": "2022-02-22",
    "sentence": "A Monday debate between U.S. Ohio Senate candidates <span class='selected-term'>Josh Mandel</span> and Morgan Harper became chaotic following interruptions from a woman in the audience.",
    "author": "Gerrard Kaonga",
    "title": "Josh Mandel Debate Descends into Chaos as Candidate Argues with Audience Member"
  },
  {
    "id": 26088,
    "mediaId": 4018,
    "date": "2022-02-22",
    "sentence": "“Would you please tell us if you would give unconditional support to protect and defend Israel if Iran attacks the Jewish state?” said the moderator at the debate Monday between <span class='selected-term'>Josh Mandel</span>, a Jewish far-right Republican running for Ohio’s U.S. Senate seat, and Morgan Harper, a progressive Democrat.",
    "author": "Ron Kampeas",
    "title": "Josh Mandel, asked about Israel in debate with Black candidate, gives bizarre answer including slavery and MLK"
  },
  {
    "id": 26037,
    "mediaId": 2564,
    "date": "2022-02-22",
    "sentence": "A debate between candidates running for Ohio's open Senate seat descended into chaos on Monday night as Republican <span class='selected-term'>Josh Mandel</span> shared a testy exchange with an audience member over his past comments calling Black Lives Matter activists 'thugs.'",
    "author": "Elizabeth Elkind",
    "title": "Chaos at Ohio Senate race debate as Republican Josh Mandel shouts at audience member who said he should be 'put out' for calling BLM 'thugs' and calls his Democratic rival 'like AOC only dumber'"
  },
  {
    "id": 25983,
    "mediaId": 2771,
    "date": "2022-02-22",
    "sentence": "“Would you please tell us if you would give unconditional support to protect and defend Israel if Iran attacks the Jewish state?” said the moderator at the debate Monday between <span class='selected-term'>Josh Mandel</span>, a Jewish far-right Republican running for Ohio’s U.S. Senate seat, and Morgan Harper, a progressive Democrat.",
    "author": "Ron Kampeas",
    "title": "Josh Mandel, asked about Israel in debate with Black candidate, gives bizarre answer including slavery and MLK"
  },
  {
    "id": 26362,
    "mediaId": 2602,
    "date": "2022-02-22",
    "sentence": "“Would you please tell us if you would give unconditional support to protect and defend Israel if Iran attacks the Jewish state?” said the moderator at the debate Monday between <span class='selected-term'>Josh Mandel</span>, a Jewish far-right Republican running for Ohio’s US Senate seat, and Morgan Harper, a progressive Democrat.",
    "author": "RON KAMPEAS/JTA",
    "title": "Josh Mandel gives bizarre answer about in Israel in debate with black candidate"
  },
  {
    "id": 26368,
    "mediaId": 4040,
    "date": "2022-02-22",
    "sentence": "Jon Skolnik @ Salon: GOP Senate candidate <span class='selected-term'>Josh Mandel</span> makes bizarre claim about slavery during debate.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: Entitled White Lady"
  },
  {
    "id": 26592,
    "mediaId": 6598,
    "date": "2022-02-22",
    "sentence": "",
    "author": "",
    "title": "Trump latest news: Ex-president dismisses plan to make him House speaker amid outrage at his appeal to Putin"
  },
  {
    "id": 26370,
    "mediaId": 2522,
    "date": "2022-02-23",
    "sentence": "‘You’re actually dumber than AOC.’\n‘Why are you so angry?’\nDonate to my campaign to keep <span class='selected-term'>Josh Mandel</span>’s hateful, sexist and racist rhetoric out of the Senate.https://t.co/RxdXFeviiB pic.twitter.com/egt7ImPlpy\n— Morgan Harper (@mh4oh) February 22, 2022\n“Last night I debated Josh Mandel in Cleveland,” she said, “and we saw from him what we’ve come to expect, racism, sexism, xenophobia, this guy has no solutions for the real issues that everyday Ohioans are facing and certainly no solutions for the black community,” throwing down the race card.",
    "author": "Chris Donaldson",
    "title": "‘Like AOC only dumber’: Ohio senate debate goes off the rails as racial hate turns to white Marine vet"
  },
  {
    "id": 26296,
    "mediaId": 2572,
    "date": "2022-02-23",
    "sentence": "An Ohio Senate debate went off the rails as the crowd interrupted the Republican candidate, <span class='selected-term'>Josh Mandel</span>, on race-based claims calling on him to leave the Black church where the event was being hosted.",
    "author": "",
    "title": "Ohio Senate candidate hits back at 'radical leftists,' BLM members who shouted him down during debate"
  },
  {
    "id": 25953,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "Hamas spokesman to deliver response to state of the union.https://twitter.com/hollyotterbein/status/1496455601416814598\\u00a0\\u2026\n— <span class='selected-term'>Josh Mandel</span> (@Josh Mandel) 1645658514\nTwitter was jolted into condemning Mandel's unprovoked post for being baselessly and unabashedly racist.",
    "author": "Brandon Gage",
    "title": "Josh Mandel tweets racist trope about Rashida Tlaib"
  },
  {
    "id": 26092,
    "mediaId": 2614,
    "date": "2022-02-23",
    "sentence": "The debate Monday included only Harper and Mandel.”\nThe second <span class='selected-term'>Josh Mandel</span> v. Morgan Harper debate is going completely off the rails pic.twitter.com/DtZJZxmK40\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nThe moderator asked Mandel about a comment calling Black Lives Matter members “thugs.” Then an audience member interrupted with a loud “uhhhhuh.”\n“You ain’t coming in the Black community.",
    "author": "DrewBerquist.com",
    "title": "Ohio Senate Debate Gets Out Of Hand"
  },
  {
    "id": 26135,
    "mediaId": 2550,
    "date": "2022-02-23",
    "sentence": "OH-Sen: Former state Treasurer <span class='selected-term'>Josh Mandel</span> has launched a $2 million buy, which the Republican firm Medium Buying says marks his first TV ad campaign since April of last year (though his allies at the Club for Growth have spent heavily on his behalf).",
    "author": "",
    "title": "Morning Digest: Orange County D.A. accused of weighing victims' race in possible death penalty case"
  },
  {
    "id": 26172,
    "mediaId": 2621,
    "date": "2022-02-23",
    "sentence": "Subscribe to\nOhio Republican Senate candidate <span class='selected-term'>Josh Mandel</span> joined Fox & Friends on Wednesday to discuss the off the rails debate he and Democrat Morgan Harper had on Monday.",
    "author": "Alex Griffing",
    "title": "Josh Mandel Claims Debate Audience Hated Him Because He Was a ‘White Guy in a Black Church’"
  },
  {
    "id": 25711,
    "mediaId": 2522,
    "date": "2022-02-23",
    "sentence": "(Video Credit: Fox News)\nSenate candidate <span class='selected-term'>Josh Mandel</span> (R-OH) clapped back at leftist radicals and Black Lives Matter members who interrupted him and demanded that he leave a church in Cleveland because he is white during an off-the-rails debate with Democratic candidate Morgan Harper.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Marine vet candidate puts BLM crowd in its place after being told to leave debate because he’s white"
  },
  {
    "id": 25657,
    "mediaId": 2676,
    "date": "2022-02-23",
    "sentence": "",
    "author": "Thom Hartmann",
    "title": "Trump feeds on Americans' loss of political agency — a void created by the GOP itself"
  },
  {
    "id": 25830,
    "mediaId": 2727,
    "date": "2022-02-23",
    "sentence": "“Would you please tell us if you would give unconditional support to protect and defend Israel if Iran attacks the Jewish state?” said the moderator at the debate Monday between <span class='selected-term'>Josh Mandel</span>, a Jewish far-right Republican running for Ohio’s US Senate seat, and Morgan Harper, a progressive Democrat.",
    "author": "Ron Kampeas",
    "title": "Jewish Senate hopeful cites slavery after Israel query in debate with Black opponent"
  },
  {
    "id": 25689,
    "mediaId": 2745,
    "date": "2022-02-24",
    "sentence": "",
    "author": "",
    "title": "The Trailer: In Texas, safe-seat candidates fight about the best way to be partisan"
  },
  {
    "id": 25992,
    "mediaId": 2831,
    "date": "2022-02-24",
    "sentence": "Look at Missouri, where you have these primaries of Eric Greitens, or the one in Ohio with <span class='selected-term'>Josh Mandel</span> and J. D. Vance.",
    "author": "Storer H. Rowley",
    "title": "Adam Kinzinger’s Warning to His Fellow Republicans on January 6 and Ukraine"
  },
  {
    "id": 25981,
    "mediaId": 2564,
    "date": "2022-02-25",
    "sentence": "",
    "author": "",
    "title": "EXCLUSIVE: Trump gets his game face on: Ex-President plays golf at his West Palm Beach course ahead of his CPAC speech on Saturday night after tearing into Biden's response to Putin's Ukraine invasion"
  },
  {
    "id": 25917,
    "mediaId": 2594,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Andrew Naughtie",
    "title": "Trump news: White House slams Putin ‘scheme’ as ex-president rejects House speaker plan"
  },
  {
    "id": 26317,
    "mediaId": 2650,
    "date": "2022-02-25",
    "sentence": "The 2020 election “was stolen,” declared <span class='selected-term'>Josh Mandel</span>, Republican candidate for U.S. Senate from Ohio, at CPAC 2022 on Friday, before telling the crowd that the Liz Cheneys and the Adam Kinzingers in the Republican Party “are traitors.”\n“We should abolish the January 6th Commission and replace it with a November 3rd Commission,” he declared.",
    "author": "Matt Margolis",
    "title": "U.S. Senate Candidate Josh Mandel Calls for J6 Commission to Be Abolished, Wants Commission on 2020 Election Instead"
  },
  {
    "id": 26263,
    "mediaId": 2664,
    "date": "2022-02-26",
    "sentence": "The report notes that Freeman's belief of election fraud was amplified in a speech by <span class='selected-term'>Josh Mandel</span>, who is seeking Ohio's GOP U.S. Senate nomination, and told the crowd, \"We have Democrats who think it’s OK to cheat in elections, and I would submit to you that one of the most important fights of our day is to stop the cheating from the left...",
    "author": "Tom Boggioni",
    "title": "Trump supporters complain the Capitol riot gets 'bad press' at CPAC's 'parallel universe'"
  },
  {
    "id": 26200,
    "mediaId": 2631,
    "date": "2022-02-26",
    "sentence": "At CPAC on Friday, <span class='selected-term'>Josh Mandel</span>, a contender in the wide-open Senate primary in Ohio, said \"I believe this election was stolen from Donald J. Trump,\" to loud cheers.",
    "author": "",
    "title": "There are signs Republicans want to move on from 2020. Trump may not allow it."
  },
  {
    "id": 25908,
    "mediaId": 2584,
    "date": "2022-02-26",
    "sentence": "",
    "author": "David Smith",
    "title": "The strange Republican world where the big lie lives on and Trump is fighting to save democracy"
  },
  {
    "id": 26025,
    "mediaId": 2540,
    "date": "2022-02-26",
    "sentence": "",
    "author": "Daniel Dale",
    "title": "Fact-checking the first two days of CPAC"
  },
  {
    "id": 25895,
    "mediaId": 2664,
    "date": "2022-02-26",
    "sentence": "With one speaker, Ohio's <span class='selected-term'>Josh Mandel</span> -- who is seeking the GOP nomination for his state's open U.S. Senate seat -- telling the crowd, \"We have Democrats who think it’s OK to cheat in elections, and I would submit to you that one of the most important fights of our day is to stop the cheating from the left...",
    "author": "Tom Boggioni",
    "title": "Republicans worried conspiracy ranting at CPAC will come back to 'hurt them': report"
  },
  {
    "id": 25715,
    "mediaId": 2590,
    "date": "2022-02-27",
    "sentence": "Rep. Jim Jordan (R-Ohio) said he hoped Trump would run again, while Ohio Senate candidate <span class='selected-term'>Josh Mandel</span> declared Trump the winner of the 2020 election.",
    "author": "Liz Skalka",
    "title": "Conservatives Are Warming To The Idea Of A Post-Trump GOP"
  },
  {
    "id": 26334,
    "mediaId": 2699,
    "date": "2022-02-27",
    "sentence": "Also in this episode, Andy Levy makes his Sunday episode debut, just in time to listen to clips of <span class='selected-term'>Josh Mandel</span> sounding stupid and to unpack Texas Gov.",
    "author": "The Daily Beast",
    "title": "Ex-Prosecutor Says She Can Prove Trump Committed Two Crimes"
  },
  {
    "id": 26376,
    "mediaId": 2584,
    "date": "2022-02-28",
    "sentence": "And while some CPAC speakers did promulgate “the big lie” – Ohio Senate hopeful <span class='selected-term'>Josh Mandel</span> declared, “I want to say it very clearly and very directly: I believe this election was stolen from Donald J Trump” – they generally gave greater emphasis to winning Congress in 2022 and, of course, Trump returning to the White House in 2024.",
    "author": "David Smith",
    "title": "Trump ignores Farage – and risks midterm elections farrago – with insistence on big lie"
  },
  {
    "id": 26399,
    "mediaId": 2724,
    "date": "2022-02-28",
    "sentence": "— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) February 28, 2022\nTrump later froze $400 million in congressionally approved security assistance to Ukraine after a phone conversation with Ukrainian President Volodymyr Zelensky.",
    "author": "Rusty Weiss",
    "title": "Democrat Swalwell Claims If Trump Were President He’d Be ‘Sending Weapons To Russia’"
  },
  {
    "id": 26119,
    "mediaId": 2537,
    "date": "2022-02-28",
    "sentence": "Neither Matt Dolan nor <span class='selected-term'>Josh Mandel</span> sought the party's endorsement, Hall said.",
    "author": "Erin Glynn",
    "title": "'Sending a message': Butler County GOP is second local party to shun Gov. Mike DeWine"
  },
  {
    "id": 25767,
    "mediaId": 2660,
    "date": "2022-03-01",
    "sentence": "If Your Time is short\nNot a scrap of evidence has emerged to support <span class='selected-term'>Josh Mandel</span>’s assertion of a stolen election.",
    "author": "Jon Greenberg",
    "title": "Ohio’s Josh Mandel repeats false claim of stolen 2020 election"
  },
  {
    "id": 25653,
    "mediaId": 2676,
    "date": "2022-03-02",
    "sentence": "And in Ohio, the frontrunner for the GOP senate primary, <span class='selected-term'>Josh Mandel</span>, has been declaring that the separation of church and state is a \"myth.\"",
    "author": "Amanda Marcotte",
    "title": "Why aren't Republicans worried their fanatical culture war will hurt them in the midterms?"
  },
  {
    "id": 25697,
    "mediaId": 2660,
    "date": "2022-03-03",
    "sentence": "In Ohio, a super PAC supporting Republican <span class='selected-term'>Josh Mandel</span> claimed in a TV ad that former state GOP chair Jane Timken’s family business moved jobs to China.",
    "author": "Tom Kertscher",
    "title": "2022 candidates use ads vowing to be tough on China, or attacking rivals as too soft on China"
  },
  {
    "id": 25734,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "Timken’s GOP opponents <span class='selected-term'>Josh Mandel</span>, Mike Gibbons and JD Vance have all made a determined effort to win the Trump endorsement, while Matt Dolan is seeking to appeal to moderate Republicans who are less sold on Trump.",
    "author": "",
    "title": "Trump endorsement casts long shadow over Ohio Senate race"
  },
  {
    "id": 26145,
    "mediaId": 2528,
    "date": "2022-03-03",
    "sentence": "Ohio\n Former Ohio state treasurer <span class='selected-term'>Josh Mandel</span> (L) and author JD Vance (R) are running for the Republican Senate nomination in Ohio.",
    "author": "Kayla Epstein",
    "title": "These 9 Senate races hold the key to who will control Joe Biden's agenda after the midterm elections in November"
  },
  {
    "id": 26075,
    "mediaId": 2537,
    "date": "2022-03-04",
    "sentence": "In 2007, then state representative <span class='selected-term'>Josh Mandel</span> pushed legislation to require the funds to divest from Iran and Sudan.",
    "author": "Laura A. Bischoff",
    "title": "Ohio's pension funds want to divest from Russia. The question is: How?"
  },
  {
    "id": 25802,
    "mediaId": 2915,
    "date": "2022-03-07",
    "sentence": "",
    "author": "Chad Groening/American Family News",
    "title": "More Than 100 Pastors Throw Support to Marine Corps Veteran Running for Senate in Ohio"
  },
  {
    "id": 26217,
    "mediaId": 2526,
    "date": "2022-03-07",
    "sentence": "pic.twitter.com/a335TivWh6\n— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) March 7, 2022\nHe urged political observers to read about Wisconsin’s investigation of Facebook CEO Mark Zuckerberg’s funding of election operations in 2020, ostensibly “to ensure voters could cast their ballots safely and securely.”\nWisconsin state Special Counsel Michael Gableman said $8.8 million worth of funding from Zuckerberg is considered election bribery in the Badger State.",
    "author": "Robert Kraychik",
    "title": "Exclusive— Josh Mandel: ‘Big Tech Oligarchs’ Like Mark Zuckerberg Must Be Criminally Investigated"
  },
  {
    "id": 26593,
    "mediaId": 2575,
    "date": "2022-03-09",
    "sentence": "Gibbons, Mandel lead Ohio GOP Senate primary field: poll\n\nPosted on by cotton1706\n\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> lead the Ohio GOP Senate primary field as Republicans battle for the chance to run for the seat being vacated by Sen.",
    "author": "",
    "title": "Gibbons, Mandel lead Ohio GOP Senate primary field: poll"
  },
  {
    "id": 26594,
    "mediaId": 2575,
    "date": "2022-03-13",
    "sentence": "POLL: Gibbons, Mandel lead Ohio GOP Senate primary field\n\nThe Hill ^ | March 8 | BY TAL AXELROD\n\nPosted on by RandFan\n\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> lead the Ohio GOP Senate primary field as Republicans battle for the chance to run for the seat being vacated by Sen.",
    "author": "",
    "title": "POLL: Gibbons, Mandel lead Ohio GOP Senate primary field"
  },
  {
    "id": 26113,
    "mediaId": 2550,
    "date": "2022-03-14",
    "sentence": "OH-Sen: Rich guy Mike Gibbons' newest ad attacks former state Treasurer <span class='selected-term'>Josh Mandel</span> as a phony conservative, arguing he \"supported Al Gore, flip-flopped on abortion, gave tax breaks to Hollywood leftists, and used $2 million of your tax dollars to promote himself.\"",
    "author": "",
    "title": "Morning Digest: Renegade Washington Democrat who bolstered GOP for years finally calls it quits"
  },
  {
    "id": 25793,
    "mediaId": 2688,
    "date": "2022-03-16",
    "sentence": "Ex-Ohio treasurer <span class='selected-term'>Josh Mandel</span> is right behind Gibbons at 20 percent.",
    "author": "Cristina Cabrera",
    "title": "Ohio GOP Senate Candidate Boosts Bunk Race Science, Makes Racist Comments About Asians"
  },
  {
    "id": 26398,
    "mediaId": 2545,
    "date": "2022-03-17",
    "sentence": "Kristi Noem (R-SD), speaking at the Family Leadership Summit, declared, “We prayed in schools, which by the way, in South Dakota, I’m putting prayer back in our schools.” Her sentiment was shared by <span class='selected-term'>Josh Mandel</span>, a pro-Trump conservative Republican running for a Senate from Ohio.",
    "author": "David Rosen",
    "title": "The Culture Wars and the 2022 Congressional Elections"
  },
  {
    "id": 26432,
    "mediaId": 2687,
    "date": "2022-03-18",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Josh Mandel and Mike Gibbons Nearly Come to Blows"
  },
  {
    "id": 26260,
    "mediaId": 2550,
    "date": "2022-03-18",
    "sentence": "OH-Sen: Former state Treasurer <span class='selected-term'>Josh Mandel</span> demonizes undocumented immigrants in his latest spot as he seeks the GOP nod, telling the audience, \"We shouldn't spend a penny on illegals as long as we have even one American veteran living on the street.\"",
    "author": "",
    "title": "Morning Digest: New Hampshire's Republican governor threatens to veto Republican gerrymander"
  },
  {
    "id": 26595,
    "mediaId": 2583,
    "date": "2022-03-18",
    "sentence": "",
    "author": "",
    "title": "‘You Watch What Happens, P*ssy’: Josh Mandel Flat Out Threatens Debate Opponent"
  },
  {
    "id": 25731,
    "mediaId": 2659,
    "date": "2022-03-18",
    "sentence": "He trails Mike Gibbons by 11 points and <span class='selected-term'>Josh Mandel</span> by 9 points.",
    "author": "Jason Easley",
    "title": "JD Vance Sided With Putin And Now He May Lose The Ohio Senate GOP Primary"
  },
  {
    "id": 25790,
    "mediaId": 2664,
    "date": "2022-03-18",
    "sentence": "Ohio Republican Senate hopefuls <span class='selected-term'>Josh Mandel</span> and Mike Gibbons got into each others' faces on Friday during a heated primary debate.",
    "author": "Brad Reed",
    "title": "WATCH: Ohio GOP Senate candidates get in each others' faces during heated primary debate"
  },
  {
    "id": 25855,
    "mediaId": 2659,
    "date": "2022-03-18",
    "sentence": "Ohio Republican Senate candidates Mike Gibbons and <span class='selected-term'>Josh Mandel</span> had to be separated as the two got in each other’s faces and threatened to fight.",
    "author": "Jason Easley",
    "title": "Chaos In Ohio As Fight Nearly Breaks Out Between GOP Senate Candidates"
  },
  {
    "id": 25722,
    "mediaId": 2659,
    "date": "2022-03-18",
    "sentence": "Senator, and Ohio voters got a first hand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become and that will be reflected on the ballot on May 3,” stated spokesperson Samantha Cotten.",
    "author": "Jason Easley",
    "title": "Mike Gibbons Calls Josh Mandel Unhinged After He Tried To Fight Him At Ohio Debate"
  },
  {
    "id": 26052,
    "mediaId": 2589,
    "date": "2022-03-18",
    "sentence": "Things went downhill from there and a moderator came over like he was the referee at a fight:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other’s faces at tonight’s GOP #OHSen forum hosted by FreedomWorks.",
    "author": "John Sexton",
    "title": "Republican debate devolves into shouting match"
  },
  {
    "id": 26028,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\n“Mike Gibbons got upset tonight that he was called out for his investments in Chinese oil,” said Scott Guthrie, Mandel’s campaign manager.",
    "author": "",
    "title": "Ohio GOP Senate debate turns nasty as Gibbons and Mandel go nose-to-nose"
  },
  {
    "id": 26008,
    "mediaId": 2748,
    "date": "2022-03-19",
    "sentence": "Ohio Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons were so close to blows that the moderator was forced to step in and get between the pair before the altercation could worsen.",
    "author": "STATION GOSSIP",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 26010,
    "mediaId": 2644,
    "date": "2022-03-19",
    "sentence": "Senator, and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become, and that will be reflected on the ballot on May 3.”\nMandel, a former state treasurer, and Gibbons, a businessman, are two of seven candidates facing off in the crowded Republican primary.",
    "author": "Kyle Morris",
    "title": "Ohio GOP Senate debate nearly gets physical as candidates get into altercation"
  },
  {
    "id": 25900,
    "mediaId": 5153,
    "date": "2022-03-19",
    "sentence": "Career politician <span class='selected-term'>Josh Mandel</span> called investment banker Mike Gibbons a “p---y” under his breath at the end of the heated exchange.",
    "author": "Joseph Wilkinson",
    "title": "Republican Ohio Senate candidate calls opponent ‘p---y’ in near-altercation at debate"
  },
  {
    "id": 25933,
    "mediaId": 2916,
    "date": "2022-03-19",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\nMeanwhile, Mandel’s campaign manager said Gibbons “got upset tonight that he was called out for his investments in Chinese oil.”\n“He claims not to remember the investment, but it’s part of a pattern of Gibbons’ entire career making money by taking American companies and selling them to foreign interests,” campaign manager Scott Guthrie said.",
    "author": "Brittany Bernstein",
    "title": "Ohio GOP Senate Candidates Have Heated Face-to-Face Exchange during Debate"
  },
  {
    "id": 26053,
    "mediaId": 2614,
    "date": "2022-03-19",
    "sentence": "Senator, and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become, and that will be reflected on the ballot on May 3,” said Samantha Cotten, a spokesperson for Gibbons’ campaign.",
    "author": "Red Voice Media",
    "title": "Ohio GOP Primary Debate Almost Turns Into A Fist Fight As Candidates Go Off The Rails [VIDEO]"
  },
  {
    "id": 26169,
    "mediaId": 2658,
    "date": "2022-03-19",
    "sentence": "A new civil dialogue movement attempts to restore healthy debate.”\n— “Night Shifts,” by Michael Clune for Harper’s Magazine: “Can technology shape our dreams?”\n— “The Post Post-Cold War World,” by Bruce Mehlman, Mehlman-Castagnetti: “Russia-Ukraine war, and its consequences.”\n— “How Russia’s mistakes and Ukrainian resistance altered Putin’s war,” Financial Times’ Visual Storytelling Team: “Moscow’s initial hopes of lightning-fast victory foundered in face of fierce opposition and its own shortcomings.”\nPLAYBOOKERS\nAn Ohio GOP Senate debate almost turned physical after <span class='selected-term'>Josh Mandel</span> got in Mike Gibbons’ face over accusations about both business dealings with Chinese companies and Mandel’s work history.",
    "author": "",
    "title": "POLITICO Playbook: Congress loses an Alaskan titan"
  },
  {
    "id": 25609,
    "mediaId": 2662,
    "date": "2022-03-19",
    "sentence": "Both candidates are currently sitting atop the polls, with <span class='selected-term'>Josh Mandel</span> being the consensus front-runner for months, and Gibbons coming on strong of late, surging to the top spot among GOP Senate candidates in two recent independent surveys.",
    "author": "Julian Conradson",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 25841,
    "mediaId": 2528,
    "date": "2022-03-19",
    "sentence": "\"He doesn't have the temperament, experience, or fortitude to be a US Senator and Ohio voters got a first-hand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become and that will be reflected on the ballot on May 3,\" she added.",
    "author": "Kelsey Vlamis",
    "title": "2 GOP frontrunners in the Ohio Senate race squared off during a heated debate moment: 'You watch what happens'"
  },
  {
    "id": 25805,
    "mediaId": 2564,
    "date": "2022-03-19",
    "sentence": "Scroll down for video\n+6\nView gallery\nSenate hopefuls Mike Gibbons, 69, (left, standing) and <span class='selected-term'>Josh Mandel</span>, 44, (right) came toe-to-toe at the primary debate after Mandel attacked the father-of-five's financial assets in China, claiming he 'made millions' there\n+6\nView gallery\nMandel appeared irritated toward Gibbons - who's wealth ranges anywhere from $83milllion to $286million - said he didn't 'think I made millions off of anything'\nGibbons went on to say that former Marine 'didn't know squat' because he's never worked in private sector, to which Mandel replied that he had served two tours in Iraq and told the businessman: 'Don't tell me I haven't worked.'",
    "author": "",
    "title": "Should've been boring but... Republican Ohio Senate hopefuls and millionaires Mike Gibbons and Josh Mandel nearly come to blows during primary debate about Chinese petroleum"
  },
  {
    "id": 26596,
    "mediaId": 2557,
    "date": "2022-03-19",
    "sentence": "Sign up for DML's newsletter\n\nAs the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DailyMail: Two Ohio Senate hopefuls nearly came to blows Friday night during a crowded primary debate after getting into a heated argument over Chinese petroleum and whether or not they’ve ‘worked.’ Republican candidates Mike Gibbons, 69, a businessman, and <span class='selected-term'>Josh Mandel</span>, 44, a veteran, both of Cleveland, got hot and bothered during Gibbons’ talk where the younger man accused him of ‘making millions’ off Chinese petroleum.",
    "author": "Please Enter Your Name Here",
    "title": "VIDEO: Republican Senate hopefuls nearly come to blows during primary debate: ‘You don’t know squat’"
  },
  {
    "id": 26597,
    "mediaId": 2753,
    "date": "2022-03-19",
    "sentence": "(FOX NEWS) – The GOP's Friday night U.S. Senate candidate forum in Ohio featured a face-off between candidates Mike Gibbons and <span class='selected-term'>Josh Mandel</span> that nearly brought them to blows.",
    "author": "Wnd News Services, These Reports Are Produced Another News Agency, The Editors Of Wnd Believe You'Ll Find It Of Interest., Art Moore, Michael Brown, Amanda Thomason, The Western Journal, Wnd Comics, Wayne Allyn Root, Samantha Chang",
    "title": "Ohio GOP Senate debate nearly gets physical as Gibbons, Mandel get into altercation"
  },
  {
    "id": 26598,
    "mediaId": 2575,
    "date": "2022-03-19",
    "sentence": "Ohio GOP Senate debate nearly gets physical as Gibbons, Mandel get into altercation\n\nFox News ^ | 3/18/2022 | Kyle Morris\n\nPosted on by grayboots\n\nThe GOP's Friday night U.S. Senate candidate forum in Ohio featured a face-off between candidates Mike Gibbons and <span class='selected-term'>Josh Mandel</span> that nearly brought them to blows.",
    "author": "",
    "title": "Ohio GOP Senate debate nearly gets physical as Gibbons, Mandel get into altercation"
  },
  {
    "id": 26275,
    "mediaId": 2547,
    "date": "2022-03-19",
    "sentence": "",
    "author": "Red Painter",
    "title": "All Hell Breaks Loose At Cantor HQ After Concession"
  },
  {
    "id": 26405,
    "mediaId": 6511,
    "date": "2022-03-19",
    "sentence": "Foto: Andrew Spear / Getty Images\nEn un foro de candidatos al Senado de Estados Unidos llevado a cabo este viernes en la noche, dos de los aspirantes republicanos, Mike Gibbons y <span class='selected-term'>Josh Mandel</span>, casi se van a los golpes.",
    "author": "",
    "title": "Candidatos republicanos al Senado por Ohio casi se van a los golpes en medio de acalorado debate"
  },
  {
    "id": 26411,
    "mediaId": 6633,
    "date": "2022-03-20",
    "sentence": "It cited a recent Tweet from potential Republican Senate nominee for Ohio <span class='selected-term'>Josh Mandel</span>, who remains a staunch Trump supporter and recently said that his vision for the future of Ohio is one of a “pro-family, pro-God, pro-Bitcoin” place to live.",
    "author": "Maggie Novak",
    "title": "Is Cryptocurrency Political?"
  },
  {
    "id": 26422,
    "mediaId": 2650,
    "date": "2022-03-20",
    "sentence": "“You’re dealing with the wrong guy,” Mandel says to Gibbons before calling him a “pussy.” pic.twitter.com/AbbyQpwXvu\n— Natalie Allison (@natalie_allison) March 18, 2022\nGibbons immediately tried to make political hay out of the tussle, calling Mandel “unfit” and “childlike.”\n<span class='selected-term'>Josh Mandel</span> is unhinged, unfit, and flailing – because he’s losing.",
    "author": "Rick Moran",
    "title": "Watch: GOP Ohio Senate Race Heats Up With Near On-Stage Brawl Between Gibbons and Mandel"
  },
  {
    "id": 26599,
    "mediaId": 2575,
    "date": "2022-03-20",
    "sentence": "To: cotton1706\n\nTo: cotton1706\n\nI don't know what to make of this._/i> I will tell you exactly what Yahoo News wants you to make of it, if it's not already glaringly obvious: Yahoo News, which is a leftist activist newsmag, wants readers to see the headline and connect <span class='selected-term'>Josh Mandel</span> with Trump's surrepticiously recorded \"grab em by the pussy\" comment, which was effectively used by the leftist activist media to turn left-leaning winemoms throughout America into stark raving loons and keep non left-leaning winemoms from ever voicing their support of Trump to their winemom friends.",
    "author": "",
    "title": "Republican Ohio Senate candidate calls opponent ‘p---y’ in near-altercation at debate"
  },
  {
    "id": 25887,
    "mediaId": 2601,
    "date": "2022-03-20",
    "sentence": "The exchange, between former Ohio State Treasurer <span class='selected-term'>Josh Mandel</span> and businessman Mike Gibbons, happened at a primary debate sponsored by conservative nonprofit FreedomWorks.",
    "author": "Dr. Tar",
    "title": "Pu$$ygate- Frontrunners for GOP Primary for Ohio’s Senate Seat Grab Each Other in Heated Exchange"
  },
  {
    "id": 25727,
    "mediaId": 2550,
    "date": "2022-03-20",
    "sentence": "This involves really two candidates: former Ohio treasurer, <span class='selected-term'>Josh Mandel</span>, and former Ohio Republican party chair, Jane Timken.",
    "author": "",
    "title": "The Downballot: Voting rights and criminal justice are on your local ballot this year (transcript)"
  },
  {
    "id": 25728,
    "mediaId": 4040,
    "date": "2022-03-21",
    "sentence": "Kipp Jones @ Mediaite: ‘You Watch What Happens, P*ssy’: <span class='selected-term'>Josh Mandel</span> Flat Out Threatens Debate Opponent.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: Watch What Happens"
  },
  {
    "id": 25745,
    "mediaId": 2727,
    "date": "2022-03-21",
    "sentence": "“We all volunteered to serve our country away from our families, putting our lives in danger, so people like Mike Gibbons could make millions.”\nGibbons said Mandel initiated the physical aggression and made “several false, petty comments in an attempt to smear the new front-runner.”\n“<span class='selected-term'>Josh Mandel</span> is unhinged, unfit and flailing — because he’s losing,” Gibbons campaign spokesperson Samantha Cotten said.",
    "author": "AP and TOI staff",
    "title": "Near-fight at Ohio GOP Senate debate between candidates Josh Mandel, Mike Gibbons"
  },
  {
    "id": 25809,
    "mediaId": 2748,
    "date": "2022-03-21",
    "sentence": "",
    "author": "Blarp Blog",
    "title": "Ohio U.S. Senate debate goes off the rails… Josh Mandel almost comes to blows…"
  },
  {
    "id": 26162,
    "mediaId": 2640,
    "date": "2022-03-21",
    "sentence": "The debate became intense almost as soon as it began as former state treasurer <span class='selected-term'>Josh Mandel</span> attacked investment banker Mike Gibbons' business dealings in his opening remarks.",
    "author": "",
    "title": "Vets Demand Apology After Tense Clash in GOP Debate"
  },
  {
    "id": 26193,
    "mediaId": 2862,
    "date": "2022-03-21",
    "sentence": "It all started with an argument - <span class='selected-term'>Josh Mandel</span>, 44, accused his opponent Mike Gibbons, 70, of making \"millions\" from buying Chinese stocks.",
    "author": "Max Gorbachev",
    "title": "Ohio Republican Calls His Rival 'P***y' During Argument Over Chinese Stocks"
  },
  {
    "id": 26137,
    "mediaId": 2740,
    "date": "2022-03-21",
    "sentence": "A debate between Ohio Republican Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons on Friday escalated into an angry confrontation.",
    "author": "",
    "title": "Ohio GOP debate leads to angry confrontation"
  },
  {
    "id": 26082,
    "mediaId": 2532,
    "date": "2022-03-21",
    "sentence": "",
    "author": "",
    "title": "Watch CBS News"
  },
  {
    "id": 25885,
    "mediaId": 2540,
    "date": "2022-03-21",
    "sentence": "': Republican candidates get heated at debate\n<span class='selected-term'>Josh Mandel</span> and Mike Gibbons, both Republican candidates for Ohio's US Senate seat, had to be separated after a heated exchange during a primary debate.",
    "author": "",
    "title": "'You're dealing with the wrong dude!': Republican candidates get heated at debate"
  },
  {
    "id": 26600,
    "mediaId": 2575,
    "date": "2022-03-21",
    "sentence": "This year this Ohioan chooses <span class='selected-term'>Josh Mandel</span> for Senate.",
    "author": "",
    "title": "Donald Trump's PAC Has More Cash Than Republicans, Democrats Combined"
  },
  {
    "id": 26266,
    "mediaId": 2525,
    "date": "2022-03-21",
    "sentence": "The debate became intense almost as soon as it began as former state Treasurer <span class='selected-term'>Josh Mandel</span> attacked investment banker Mike Gibbons’ business dealings.",
    "author": "Associated Press",
    "title": "Fight at Ohio GOP Senate debate elevates military issue"
  },
  {
    "id": 26281,
    "mediaId": 2518,
    "date": "2022-03-21",
    "sentence": "• <span class='selected-term'>Josh Mandel</span>, former Ohio state treasurer and U.S. Marine veteran, muttered \"Watch what happens.",
    "author": "Compiled Democrat-Gazette Staff From Wire Reports",
    "title": "In the news"
  },
  {
    "id": 26221,
    "mediaId": 2752,
    "date": "2022-03-21",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\nThis is all true, but we also imagine Cotten will twist herself into knots justifying Gibbons’s inevitable endorsement of Mandel if he wins the nomination.",
    "author": "Stephen Robinson",
    "title": "All Fun And Games Until Ohio GOP Senate Candidate Starts Calling Opponent A 'Pussy'"
  },
  {
    "id": 26401,
    "mediaId": 2540,
    "date": "2022-03-22",
    "sentence": "In Ohio, the race has become more combative -- literally -- in recent days, with candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons getting in each other's faces during a debate.",
    "author": "Adam Wollner",
    "title": "The biggest obstacle Republicans face in the battle for the Senate"
  },
  {
    "id": 25848,
    "mediaId": 2658,
    "date": "2022-03-22",
    "sentence": "Mike Gibbons, the Ohio Senate hopeful who nearly came to blows with <span class='selected-term'>Josh Mandel</span>, urged voters to “choose your fighter” in the race.",
    "author": "",
    "title": "POLITICO Playbook: Friction between Harris and Biden camps revealed in new book"
  },
  {
    "id": 25735,
    "mediaId": 2537,
    "date": "2022-03-22",
    "sentence": "The event came days after Gibbons and former state treasurer <span class='selected-term'>Josh Mandel</span> sparred on stage during another debate, one of them appearing to use a derogatory term for women as an insult.",
    "author": "Haley BeMiller",
    "title": "Gender dominates GOP Ohio Senate debate as Mike Gibbons dismisses women's oppression"
  },
  {
    "id": 25607,
    "mediaId": 2641,
    "date": "2022-03-22",
    "sentence": "Ohio GOP Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons, who made headlines over the weekend after squaring off toe-to-toe during a party debate near Columbus, did not appear ready to back down during interviews on Newsmax Monday.",
    "author": "Sandy Fitzgerald",
    "title": "Ohio's Mandel, Gibbons to Newsmax: Not Backing Down After Debate Fight"
  },
  {
    "id": 26062,
    "mediaId": 2602,
    "date": "2022-03-23",
    "sentence": "One is <span class='selected-term'>Josh Mandel</span>, who is running for the Republican Senate nomination in Ohio to succeed the retiring more moderate Rob Portman.",
    "author": "DOUGLAS BLOOMFIELD",
    "title": "Expectations are low for the congressional mid-term elections - opinion"
  },
  {
    "id": 26264,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "Watch the original exchange below:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other\\u2019s faces at tonight\\u2019s GOP #OHSen forum hosted by FreedomWorks.\\n\\n\\u201cYou watch what happens,\\u201d Mandel says.pic.twitter.com/fQuqfHxXHT\n— Heartland Signal (@Heartland Signal) 1647644328",
    "author": "Matthew Chapman",
    "title": "Even Trump is 'baffled' as Ohio GOP candidates threaten each other over who deserves his endorsement: report"
  },
  {
    "id": 25770,
    "mediaId": 2537,
    "date": "2022-03-24",
    "sentence": "3) Primary punches\n<span class='selected-term'>Josh Mandel</span> and Mike Gibbons, two Republican candidates for the U.S. Senate, got in each others' faces during a recent debate.",
    "author": "Anna Staver",
    "title": "Ohio Politics Explained podcast: DeWine's sets goals and candidates prepare to debate next week"
  },
  {
    "id": 25873,
    "mediaId": 2572,
    "date": "2022-03-25",
    "sentence": "I'd say that's a good thing, @AP,\" Rep. Vicky Hartrzler, R-Mo., responded, while Ohio Republican senate candidate <span class='selected-term'>Josh Mandel</span> \"fixed\" the first sentence of the AP article to read, \"Empathy FOR CHILD PREDATORS is not a quality many Republican senators want to see in the next Supreme Court justice.\"",
    "author": "Brandon Gillespie",
    "title": "AP mocked for saying GOP opposes Ketanji Brown Jackson for having ‘too much empathy’"
  },
  {
    "id": 26120,
    "mediaId": 2627,
    "date": "2022-03-25",
    "sentence": "Thankfully, we have writer Christian Vanderbrouk to provide a helpful translation of this brand of conservative GOP angst:\nJust days earlier, McLaughlin had provided another look inside the GOP’s tribal calculations, when he explained that even though a Senate candidate like Ohio’s deplorable <span class='selected-term'>Josh Mandel</span> was a “national embarrassment,” he would have no problem supporting him in the general election against a Democrat.",
    "author": "Charlie Sykes",
    "title": "Missouri's Eric Greitens is testing the limits of Trump's post-morals MAGAverse"
  },
  {
    "id": 26215,
    "mediaId": 2663,
    "date": "2022-03-26",
    "sentence": "",
    "author": "Editors",
    "title": "The Gay Twitter comedy machine: 19 tweets to make you laugh"
  },
  {
    "id": 25829,
    "mediaId": 2540,
    "date": "2022-03-27",
    "sentence": "Businessman Mike Gibbons and former state Treasurer <span class='selected-term'>Josh Mandel</span> led the pack in a Fox poll conducted in early March, with a quarter of GOP primary voters undecided.",
    "author": "Simone Pathe",
    "title": "The 10 Senate seats most likely to flip in 2022"
  },
  {
    "id": 25642,
    "mediaId": 2919,
    "date": "2022-03-28",
    "sentence": "\"I want to say it very clearly for all of the RINOs out there and all of the media elites out there the 2020 election was stolen from Donald J. Trump,\" candidate <span class='selected-term'>Josh Mandel</span> said.",
    "author": "Courtney Shaw",
    "title": "Ohio's 7 Republican Senate hopefuls face off in debate at Central State University"
  },
  {
    "id": 25920,
    "mediaId": 2740,
    "date": "2022-03-28",
    "sentence": "Among them are former Ohio Republican Party chair Jane Timken, Ohio State Sen. Matt Dolan, Cleveland businessman Mike Gibbons and former Ohio treasurer <span class='selected-term'>Josh Mandel</span>.",
    "author": "Orlando Mayorquin",
    "title": "Ohio Senate race: What to know about JD Vance, venture capitalist running for office"
  },
  {
    "id": 25964,
    "mediaId": 2548,
    "date": "2022-03-29",
    "sentence": "All major Republican candidates have expressed opposition to trade with China, and top two candidates Mike Gibbons and <span class='selected-term'>Josh Mandel</span> nearly came to blows at a March 18 debate over Mandel’s accusation that Gibbons traded Chinese petroleum stock.",
    "author": "Michael Ginsberg",
    "title": "Tim Ryan, Former Democratic Candidate For President, Focuses On One Big Issue Trump Always Talked About In New Campaign Ad"
  },
  {
    "id": 26152,
    "mediaId": 2550,
    "date": "2022-03-29",
    "sentence": "OH-Sen: Former state Treasurer <span class='selected-term'>Josh Mandel</span>'s newest ad for the truly ugly Republican primary stars a Gold Star mother named Sheila Nowacki saying of one of his opponents, \"Mike Gibbons has the nerve to say military service doesn't count as real work.",
    "author": "",
    "title": "Morning Digest: Both Republican senators in Louisiana eye fleeing D.C. for governor's mansion"
  },
  {
    "id": 25792,
    "mediaId": 2660,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Amy Sherman",
    "title": "Georgia’s David Perdue said elections were stolen from him and Trump. Pants on Fire!"
  },
  {
    "id": 26176,
    "mediaId": 2532,
    "date": "2022-03-30",
    "sentence": "Her rivals, <span class='selected-term'>Josh Mandel</span>, JD Vance and Mike Gibbons, are also seeking endorsements.",
    "author": "",
    "title": "Trump has endorsed nearly 130 candidates for 2022, testing his influence in the Republican Party"
  },
  {
    "id": 26601,
    "mediaId": 2575,
    "date": "2022-03-30",
    "sentence": "Renacci was a last few weeks fill-in for <span class='selected-term'>Josh mandel</span> who dropped out of that race.",
    "author": "",
    "title": "Renacci Tops DeWine, Others in New Ohio Gubernatorial GOP Nomination Poll"
  },
  {
    "id": 26343,
    "mediaId": 2550,
    "date": "2022-03-31",
    "sentence": "OH-Sen: USA Freedom Fund, a Club for Growth-aligned group backing former state Treasurer <span class='selected-term'>Josh Mandel</span>, has launched what Inside Elections' Jacob Rubashkin says is a $1.2 million buy that seeks to portray businessman Mike Gibbons as demeaning to the military.",
    "author": "",
    "title": "Morning Digest: Our guide to Ohio's new congressional map, gerrymandered to benefit the GOP"
  },
  {
    "id": 25737,
    "mediaId": 2745,
    "date": "2022-03-31",
    "sentence": "It's almost like they're looking for their partisan cue.”\nUSA Freedom Fund, “Real Work.” It's been more than a week since Ohio GOP U.S. Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons got into a near-physical argument at a forum, after Gibbons correctly said that Mandel had never worked in the private sector.",
    "author": "",
    "title": "The Trailer: Could Madison Cawthorn lose? Primary challengers come for the party-crashers."
  },
  {
    "id": 25787,
    "mediaId": 2540,
    "date": "2022-04-01",
    "sentence": "Washington (CNN)A new television ad from Ohio Republican Senate candidate <span class='selected-term'>Josh Mandel</span> is centered on a false claim that Republican primary rival Mike Gibbons, a businessman, said that military service isn't \"real work.\"",
    "author": "Daniel Dale",
    "title": "Fact check: Ad from Ohio Republican Josh Mandel falsely claims party rival Mike Gibbons said military service isn't real work"
  },
  {
    "id": 25807,
    "mediaId": 2550,
    "date": "2022-04-01",
    "sentence": "OH-Sen: Former state Treasurer <span class='selected-term'>Josh Mandel</span> and his allies have been running ads portraying businessman Mike Gibbons as demeaning towards the military, and Gibbons is now up with a response spot as the two compete for the GOP nod.",
    "author": "",
    "title": "Morning Digest: Why GOP leaders finally want to boot Madison Cawthorn (it's not really about orgies)"
  },
  {
    "id": 26174,
    "mediaId": 2664,
    "date": "2022-04-01",
    "sentence": "He went on to discuss GOP candidates Hershel Walker, Kelly Tshibaka, Sarah Palin, Michele Fiore, Eric Greitens, <span class='selected-term'>Josh Mandel</span>, Mike Gibbons, and Tina Forte.",
    "author": "Bob Brigham",
    "title": "WATCH: Bill Maher scorches GOP's 2022 candidates as even crazier than the 2010 Tea Party wave"
  },
  {
    "id": 26238,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "OHIO GOP SENATE SHOWDOWN: FIREBRAND REP. CAWTHORN ENDORSES <span class='selected-term'>JOSH MANDEL</span> IN CROWDED REPUBLICAN PRIMARY\nThe statements drew the ire of fellow Republicans who demanded to know names.",
    "author": "Marisa Schultz",
    "title": "Madison Cawthorn addresses 'orgy,' cocaine controversy"
  },
  {
    "id": 26184,
    "mediaId": 2745,
    "date": "2022-04-03",
    "sentence": "A total deportation of immigrants in the country illegally and the restoration of Donald Trump to the White House as quickly as possible.”\nA statement from three-time Senate candidate <span class='selected-term'>Josh Mandel</span> caught the mood: “For all the RINOs out there and all the media elites out there, the 2020 election was stolen from Donald J. Trump.”\nYet while it has a high profile today, the far right has deep roots in Republican history.",
    "author": "E.J. Dionne Jr.",
    "title": "Opinion: Collins’s lonely voice on Jackson shows how extreme the GOP has become"
  },
  {
    "id": 25931,
    "mediaId": 2694,
    "date": "2022-04-03",
    "sentence": "He made clear that he remained a loyal Republican, saying he would support <span class='selected-term'>Josh Mandel</span>, J. D. Vance, or any of the other Senate hopefuls who have been criticizing him and otherwise lurching to the right on the campaign trail.",
    "author": "Russell Berman",
    "title": "The Last of the Establishment Republicans"
  },
  {
    "id": 26015,
    "mediaId": 2687,
    "date": "2022-04-04",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Ted Cruz Endorses Josh Mandel In Ohio"
  },
  {
    "id": 26278,
    "mediaId": 2537,
    "date": "2022-04-04",
    "sentence": "Democrat\nTraci \"TJ\" Johnson, businesswoman\nMorgan Harper, attorney\nU.S. Rep. Tim Ryan\nRepublican\nMatt Dolan, state Senator\nMike Gibbons, businessman\n<span class='selected-term'>Josh Mandel</span>, former State Treasurer\nNeil Patel, businessman\nMark Pukita, businessman\nJane Timken, former chair of Ohio Republican Party\nJD Vance, author and businessman\nGovernor\nDemocrat\nJohn Cranley, former Mayor of Cincinnati\nNan Whaley, former Mayor of Dayton\nRepublican\nJoe Blystone, farmer and businessowner\nGov.",
    "author": "Scott Wartman",
    "title": "The Ohio primary is here, sort of. What to know as early voting starts"
  },
  {
    "id": 26319,
    "mediaId": 2752,
    "date": "2022-04-05",
    "sentence": "Republican Senate candidate <span class='selected-term'>Josh Mandel</span> of Ohio just received Ted Cruz’s endorsement, which is highly coveted by at least a couple people who aren’t Ted Cruz.",
    "author": "Stephen Robinson",
    "title": "Ted Cruz Endorses GOP Senate Candidate Josh Mandel, Who’s Almost As Terrible As He Is"
  },
  {
    "id": 26109,
    "mediaId": 2644,
    "date": "2022-04-05",
    "sentence": "At a debate last month, Gibbons and former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, currently second in GOP primary polls, came close to a physical altercation on stage as Mandel slammed Gibbons for business links to China.",
    "author": "Steven Nelson",
    "title": "Ohio GOP Senate front-runner panned for taking $1.5M in PPP funds for bank"
  },
  {
    "id": 25723,
    "mediaId": 2524,
    "date": "2022-04-05",
    "sentence": "GOP Senate candidate <span class='selected-term'>Josh Mandel</span> is \"fighting to protect the Judeo-Christian bedrock of America\" one pixel at a time.",
    "author": "Mark Frauenfelder",
    "title": "\"Pro-God, Pro-Gun, Pro-Trump\" candidate seems to be Pro-Photoshop, too"
  },
  {
    "id": 25739,
    "mediaId": 2680,
    "date": "2022-04-06",
    "sentence": "As early primary voting began in the Midwestern battleground state of Ohio on Tuesday, social media users questioned the authenticity of a photo used in a campaign ad by U.S. Senate candidate <span class='selected-term'>Josh Mandel</span>.",
    "author": "SOPHIA TULP",
    "title": "FACT FOCUS: Josh Mandel Senate campaign ad scrutinized"
  },
  {
    "id": 25670,
    "mediaId": 2586,
    "date": "2022-04-06",
    "sentence": "pic.twitter.com/7kz5nYseje\n— Natalie Allison (@natalie_allison) April 5, 2022\nShe wrote, “You folks asked if <span class='selected-term'>Josh Mandel</span>’s campaign photoshopped his head onto a Black man, and I looked for answers.",
    "author": "Stephanie Dube Dwilson",
    "title": "Josh Mandel Releases Original Photo with Black Marines After Photoshop Rumor"
  },
  {
    "id": 25786,
    "mediaId": 2679,
    "date": "2022-04-06",
    "sentence": "As early primary voting began in the Midwestern battleground state of Ohio on Tuesday, social media users questioned the authenticity of a photo used in a campaign ad by U.S. Senate candidate <span class='selected-term'>Josh Mandel</span>.",
    "author": "SOPHIA TULP",
    "title": "FACT FOCUS: Josh Mandel Senate campaign ad scrutinized"
  },
  {
    "id": 25822,
    "mediaId": 4040,
    "date": "2022-04-06",
    "sentence": "Liz Skalka @ HuffPost: <span class='selected-term'>Josh Mandel</span> Uses Selma Bridge, MLK As Props In ‘Critical Race Theory’ Ad.",
    "author": "Kyle Mantyla",
    "title": "Right Wing Round-Up: Personally Offended by Broad Social Trends"
  },
  {
    "id": 25888,
    "mediaId": 2550,
    "date": "2022-04-06",
    "sentence": "",
    "author": "",
    "title": "Josh Mandel stoops to low of trying to defile MLK legacy. King's daughter isn't having it"
  },
  {
    "id": 26151,
    "mediaId": 2572,
    "date": "2022-04-06",
    "sentence": "In a new campaign ad, Ohio GOP Senate candidate Mike Gibbons accuses primary opponent and former state Treasurer <span class='selected-term'>Josh Mandel</span> of being soft on China, circling back to the issue at the root of a combustible feud between the two.",
    "author": "Tyler Olson",
    "title": "Ohio GOP Senate showdown: Gibbons hits Mandel on China in ad that returns to root of combustible feud"
  },
  {
    "id": 26189,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Other primary candidates include investment banker Mike Gibbons, former Ohio treasurer <span class='selected-term'>Josh Mandel</span>, and Jane Timken, the former chair of the Ohio Republican Party.",
    "author": "Gustaf Kilander",
    "title": "JD Vance accused of racism over new campaign ad in which he asks ‘Do you hate Mexicans?’"
  },
  {
    "id": 26078,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "As early primary voting began in the Midwestern battleground state of Ohio on Tuesday, social media users questioned the authenticity of a photo used in a campaign ad by U.S. Senate candidate <span class='selected-term'>Josh Mandel</span>.",
    "author": "Via AP news wire",
    "title": "FACT FOCUS: Josh Mandel Senate campaign ad scrutinized"
  },
  {
    "id": 25967,
    "mediaId": 2549,
    "date": "2022-04-06",
    "sentence": "Far-right candidate <span class='selected-term'>Josh Mandel</span> is running for the United States Senate in Ohio.",
    "author": "Claire Goforth",
    "title": "‘I encourage you to study my father’: MLK’s daughter blasts far-right Republican who invoked her father in pro-gun, anti-critical race theory campaign ad"
  },
  {
    "id": 25968,
    "mediaId": 5247,
    "date": "2022-04-06",
    "sentence": "In his most recent video spot, <span class='selected-term'>Josh Mandel</span> is seen walking across the Edmund Pettus Bridge in Selma, Alabama, where Rev.",
    "author": "Sarah Sicard",
    "title": "Marine veteran’s campaign ad for US Senate features a bad photoshop job"
  },
  {
    "id": 25978,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "As early primary voting began in the Midwestern battleground state of Ohio on Tuesday, social media users questioned the authenticity of a photo used in a campaign ad by U.S. Senate candidate <span class='selected-term'>Josh Mandel</span>.",
    "author": "SOPHIA TULP - Associated Press",
    "title": "FACT FOCUS: Josh Mandel Senate campaign ad scrutinized"
  },
  {
    "id": 25924,
    "mediaId": 4044,
    "date": "2022-04-06",
    "sentence": "While there appears to be a significant color difference between Mandel’s face and his hands in the version that appeared in the campaign ad, this color difference is far less noticeable in the original photograph (at right in the tweet below):\nYou folks asked if <span class='selected-term'>Josh Mandel</span>’s campaign photoshopped his head onto a Black man, and I looked for answers.",
    "author": "Dan Evon",
    "title": "Did Mandel ‘Forget To Photoshop His Hands’ in Campaign Ad?"
  },
  {
    "id": 25903,
    "mediaId": 2621,
    "date": "2022-04-06",
    "sentence": "https://t.co/QVFP3SUhB9\n— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) April 5, 2022\nThis drew a rebuke from King, who said “Regretfully, I do not believe that I or the Martin Luther king Jr. Center legitimately motivated you to film this ad, as it is in opposition to nonviolence and to much of what my father taught.",
    "author": "Ken Meyer",
    "title": "Josh Mandel Goes After Martin Luther King’s Daughter for Objecting to His Namedropping Civil Rights Icon in Campaign Ad"
  },
  {
    "id": 26303,
    "mediaId": 2728,
    "date": "2022-04-06",
    "sentence": "As early primary voting began in the Midwestern battleground state of Ohio on Tuesday, social media users questioned the authenticity of a photo used in a campaign ad by U.S. Senate candidate <span class='selected-term'>Josh Mandel</span>.",
    "author": "Sophia Tulp",
    "title": "FACT FOCUS: Josh Mandel Senate campaign ad scrutinized"
  },
  {
    "id": 26412,
    "mediaId": 2517,
    "date": "2022-04-06",
    "sentence": "Ohio Republican Senate candidate <span class='selected-term'>Josh Mandel</span> paid tens of thousands of dollars to a woman he was dating during his 2018 Senate campaign, while married to another woman.",
    "author": "",
    "title": "EXCLUSIVE: Ohio Senate Candidate Josh Mandel Pocketed Donations Intended for 2018 GOP Nominee, Paid Tens of Thousands to Mistress"
  },
  {
    "id": 26428,
    "mediaId": 2549,
    "date": "2022-04-06",
    "sentence": "Did <span class='selected-term'>Josh Mandel</span> forget to photoshop his hands when he put this photo in his new ad pic.twitter.com/fsnO7O7j7I\n— Brett Meiselas (@BMeiselas)\nTwitter users also said that Mandel’s hands are much lighter in other photos.",
    "author": "Claire Goforth",
    "title": "‘He forgot to Photoshop the hands’: Did this GOP candidate insert himself into a pic of Black soldiers?"
  },
  {
    "id": 26400,
    "mediaId": 2752,
    "date": "2022-04-06",
    "sentence": "Ohio GOP Senate candidate <span class='selected-term'>Josh Mandel</span> dropped a particularly loathsome ad Tuesday where he’s filmed walking across the Edmund Pettus Bridge, the site of the famous Selma march for voting rights, which Mandel doesn’t support.",
    "author": "Stephen Robinson",
    "title": "MLK Expert Josh Mandel Explains To MLK’s Daughter Bernice How Much MLK Loved Guns"
  },
  {
    "id": 26602,
    "mediaId": 2575,
    "date": "2022-04-06",
    "sentence": "Mike Gibbons and <span class='selected-term'>Josh Mandel</span> get HEATED at Ohio GOP forum\n\nYoutube ^ | Mar 18, 2022\n\nPosted on by conservative98\n\nMike Gibbons and Josh Mandel get into each other’s faces at tonight’s GOP forum hosted by FreedomWorks.",
    "author": "",
    "title": "Mike Gibbons and Josh Mandel get HEATED at Ohio GOP forum"
  },
  {
    "id": 26388,
    "mediaId": 2822,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH - Associated Press",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26393,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary - Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance - scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open U.S. Senate seat"
  },
  {
    "id": 26237,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "Via AP news wire",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 25910,
    "mediaId": 2596,
    "date": "2022-04-07",
    "sentence": "Former Ohio Representative and current Senate candidate, <span class='selected-term'>Josh Mandel</span>, told Bernice King to 'study your history better' on Tuesday when King refuted statements Mandel made.",
    "author": "",
    "title": "Republican mansplains MLK Jr's beliefs... to MLK Jr's daughter"
  },
  {
    "id": 25960,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "Fact-checkers have pushed back on the accusation that Ohio Senate candidate <span class='selected-term'>Josh Mandel</span> photoshopped himself into an image included in one of his ads.",
    "author": "Gustaf Kilander",
    "title": "Photo filter blamed as Ohio Senate candidate accused of photoshop in ad"
  },
  {
    "id": 25963,
    "mediaId": 2537,
    "date": "2022-04-07",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Josh Mandel</span> drew swift condemnation this week after he filmed a campaign ad attacking critical race theory against the backdrop of a civil rights landmark in Selma, Alabama.",
    "author": "Haley BeMiller",
    "title": "No, Josh Mandel did not edit his face onto a Black Marine in his new U.S. Senate ad"
  },
  {
    "id": 26035,
    "mediaId": 2752,
    "date": "2022-04-07",
    "sentence": "PREVIOUSLY: All Fun And Games Until Ohio GOP Senate Candidate Starts Calling Opponent A 'Pussy'\nLast month, Republicans <span class='selected-term'>Josh Mandel</span> and Mike Gibbons almost came to blows at Ohio's Senate GOP primary debate.",
    "author": "Stephen Robinson",
    "title": "Maybe We Are Better Off Without Political Debates"
  },
  {
    "id": 26125,
    "mediaId": 2680,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 25827,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Vance's allies at Protect Ohio Values PAC have released a new poll from Fabrizio Lee & Associates that shows an 18-18-18 deadlock between Vance, state Treasurer <span class='selected-term'>Josh Mandel</span>, and businessman Mike Gibbons in the May 3 GOP primary, with former state party chair Jane Timken at 9%.",
    "author": "",
    "title": "Morning Digest: Trump's 'bro' now frontrunner following Ohio Republican's unexpected retirement"
  },
  {
    "id": 25797,
    "mediaId": 2660,
    "date": "2022-04-07",
    "sentence": "(<span class='selected-term'>Josh Mandel</span> for U.S. Senate)\nFred Davis, a Republican consultant who creates ads for Mandel, told PolitiFact that the version of the image that showed up in the ad reflected efforts by the video editor to make sure the text directing viewers to the campaign’s \"JoshMandel.com\" web address showed up on the video.",
    "author": "Bill McCarthy",
    "title": "No evidence Josh Mandel photoshopped his face onto body of Black Marine for campaign ad"
  },
  {
    "id": 25804,
    "mediaId": 2560,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary – Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance – scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26047,
    "mediaId": 2627,
    "date": "2022-04-08",
    "sentence": "“There's nothing racist about stopping critical race theory and loving America.”\nThen a voiceover comes in: “<span class='selected-term'>Josh Mandel</span> — pro-God, pro-gun, pro-Trump.”\nIt dishonors the memories of Lewis and King to promote an agenda that will bring nothing but more harm to Black people at a site where they struggled for Black people’s advancement.",
    "author": "",
    "title": "Conservatives' appropriation of MLK just reached a shocking new low"
  },
  {
    "id": 26603,
    "mediaId": 2575,
    "date": "2022-04-08",
    "sentence": "Veterans Over Illegals\n\ntownhall.com ^ | 4/8/2022 0001 hrs edt | <span class='selected-term'>Josh Mandel</span>\n\nPosted on by rktman\n\nThe federal government is giving billions of dollars in subsidies to illegal immigrants while tens of thousands of American veterans remain homeless.",
    "author": "",
    "title": "Veterans Over Illegals"
  },
  {
    "id": 26604,
    "mediaId": 2861,
    "date": "2022-04-08",
    "sentence": "The RealClearPolitics average of polling in the race has Vance running a fairly close third, behind Ohio investment banker Mike Gibbons and former Ohio State Representative and Treasurer <span class='selected-term'>Josh Mandel</span>.",
    "author": "A.M. Smith, Kathleen Janda, You Are Going To Send Email To, Move Comment",
    "title": "Outsider Senate candidate just blew up go-to play in Democrat’s far-Left playbook"
  },
  {
    "id": 26588,
    "mediaId": 2934,
    "date": "2022-04-08",
    "sentence": "After the campaign ad was released, posts on social media falsely claimed that Mandel edited the image with the Black Marines by photoshopping his head “on the body of a Black soldier.”\n\n“Ohio pro-Trump U.S. Senate candidate <span class='selected-term'>Josh Mandel</span> puts a photo of himself standing with black soldiers in his last campaign ad,” read a post shared by the progressive group Occupy Democrats.",
    "author": "Brea Jones",
    "title": "Josh Mandel Campaign Ad Was Not Photoshopped, Contrary to Social Media Posts"
  },
  {
    "id": 26106,
    "mediaId": 2547,
    "date": "2022-04-10",
    "sentence": "Some of you may remember Gibbons from the recent debate where he and <span class='selected-term'>Josh Mandel</span> nearly came to blows.",
    "author": "Heather",
    "title": "Ohio GOP Senate Candidate: Middle Class Doesn't Pay 'Fair Share' Of Taxes"
  },
  {
    "id": 25930,
    "mediaId": 2512,
    "date": "2022-04-11",
    "sentence": "Although he has yet to endorse far-right candidates JD Vance or <span class='selected-term'>Josh Mandel</span>, who are duking it out for the Republican nomination for Senate in Ohio, Trump's vibe is very much alive.",
    "author": "Brandon Gage",
    "title": "Donald Trump's 'troublemaking' could end up benefitting Democrats: columnist"
  },
  {
    "id": 25619,
    "mediaId": 2641,
    "date": "2022-04-12",
    "sentence": "A closer look into the caricature that is <span class='selected-term'>Josh Mandel</span>, the already twice-failed Senate contender, shows that Mandel was Marco Rubio’s top guy in Ohio and wouldn’t even say President Trump’s name during the RNC Convention in Cleveland.",
    "author": "Bernard Kerik",
    "title": "In a Field of Buckeye State Pretenders, Timken Is the Real Deal"
  },
  {
    "id": 25938,
    "mediaId": 3997,
    "date": "2022-04-13",
    "sentence": "",
    "author": "",
    "title": "Back to CR"
  },
  {
    "id": 26175,
    "mediaId": 2645,
    "date": "2022-04-13",
    "sentence": "It’s time for Congress to balance the budget, just like families in Ohio do.”\nThis comes as polls in the Republican primary show Timken with single digit support with businessman Mike Gibbons and former Ohio Treasurer <span class='selected-term'>Josh Mandel</span> leading the pack.",
    "author": "",
    "title": "Senate candidate Timken says it’s time to balance the budget like Ohio families do"
  },
  {
    "id": 26205,
    "mediaId": 2695,
    "date": "2022-04-13",
    "sentence": "Ohio: <span class='selected-term'>Josh Mandel</span> (R) and Mike Gibbons (R) are neck and neck in a packed Republican environment.",
    "author": "BlazeTV Staff",
    "title": "NPR predicts these 10 Senate seats might see a party FLIP"
  },
  {
    "id": 26132,
    "mediaId": 6503,
    "date": "2022-04-14",
    "sentence": "Ohio: <span class='selected-term'>Josh Mandel</span> (R) and Mike Gibbons (R) are neck and neck in a packed Republican environment.",
    "author": "Warner Todd Huston",
    "title": "Even Left-Wing NPR is Predicting Ten Senate Seats Could go Red"
  },
  {
    "id": 25884,
    "mediaId": 2680,
    "date": "2022-04-14",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair Jane Timken for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "GOP leaders in Ohio try to block Trump endorsement of Vance"
  },
  {
    "id": 25695,
    "mediaId": 2919,
    "date": "2022-04-15",
    "sentence": "Vance has been locked in a heated race against former state treasurer <span class='selected-term'>Josh Mandel</span>, investment banker Mike Gibbons, former Ohio Republican Party chair Jane Timken, and state Sen. Matt Dolan, whose family owns the Cleveland Guardians.",
    "author": "Associated Press",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 26105,
    "mediaId": 2721,
    "date": "2022-04-15",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair Jane Timken for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "",
    "title": "Trump to make huge announcement; GOP unhappy?"
  },
  {
    "id": 26087,
    "mediaId": 2640,
    "date": "2022-04-15",
    "sentence": "Sources told NBC News Thursday that the president is on the verge of endorsing the Hillbilly Elegy author, but other Republicans including rival candidate <span class='selected-term'>Josh Mandel</span> are fighting hard to prevent it.",
    "author": "Rob Quinn",
    "title": "Ohio Republicans Are Trying to Stop a Trump Endorsement"
  },
  {
    "id": 26354,
    "mediaId": 2680,
    "date": "2022-04-15",
    "sentence": "The decision marks a major blow for Vance's top rivals — former state treasurer <span class='selected-term'>Josh Mandel</span>, investment banker Mike Gibbons and former Ohio Republican Party chair Jane Timken — who have been locked in a heated and contentious race for both the nomination and Trump's backing in a primary that is now less than three weeks away.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 26323,
    "mediaId": 2512,
    "date": "2022-04-16",
    "sentence": "",
    "author": "Meaghan Ellis",
    "title": "Josh Mandel's Ohio GOP Senate campaign strategy is focused on capturing voters 'through churches'?: report"
  },
  {
    "id": 26407,
    "mediaId": 2687,
    "date": "2022-04-16",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Josh Mandel Runs His Campaign ‘Through Churches’"
  }
]