[
  {
    "id": 26479,
    "mediaId": 2803,
    "date": "2022-01-20",
    "sentence": "Separation of money and state, not separation of church and state.#Bitcoin\n— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) January 10, 2022\nStates that submit to the authority of Almighty God // states that don’t\nStates that are pro-family // states that aren’t\nStates that invest in #bitcoin infrastructure // states that won’t\nOhio must be a pro-God, pro-family, pro-bitcoin state.",
    "author": "Aaron Mak",
    "title": "When Did Crypto Become Republican?"
  },
  {
    "id": 26292,
    "mediaId": 2710,
    "date": "2022-02-04",
    "sentence": "Lee’s PAC doled out campaign cash to several Republican candidates, including Ohio Senate candidate <span class='selected-term'>Josh Mandel</span>, Florida Sen. Marco Rubio and Utah Rep. Chris Stewart.",
    "author": "Bryan Schott",
    "title": "Who is leading the 2022 money race for Utah’s congressional seats?"
  },
  {
    "id": 25737,
    "mediaId": 2745,
    "date": "2022-03-31",
    "sentence": "It's almost like they're looking for their partisan cue.”\nUSA Freedom Fund, “Real Work.” It's been more than a week since Ohio GOP U.S. Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons got into a near-physical argument at a forum, after Gibbons correctly said that Mandel had never worked in the private sector.",
    "author": "",
    "title": "The Trailer: Could Madison Cawthorn lose? Primary challengers come for the party-crashers."
  },
  {
    "id": 25807,
    "mediaId": 2550,
    "date": "2022-04-01",
    "sentence": "OH-Sen: Former state Treasurer <span class='selected-term'>Josh Mandel</span> and his allies have been running ads portraying businessman Mike Gibbons as demeaning towards the military, and Gibbons is now up with a response spot as the two compete for the GOP nod.",
    "author": "",
    "title": "Morning Digest: Why GOP leaders finally want to boot Madison Cawthorn (it's not really about orgies)"
  },
  {
    "id": 26238,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "OHIO GOP SENATE SHOWDOWN: FIREBRAND REP. CAWTHORN ENDORSES <span class='selected-term'>JOSH MANDEL</span> IN CROWDED REPUBLICAN PRIMARY\nThe statements drew the ire of fellow Republicans who demanded to know names.",
    "author": "Marisa Schultz",
    "title": "Madison Cawthorn addresses 'orgy,' cocaine controversy"
  }
]