[
  {
    "id": 25675,
    "mediaId": 2643,
    "date": "2022-02-14",
    "sentence": "He's running against pro-Trump candidates like JD Vance, <span class='selected-term'>Josh Mandel</span> and Jane Timken.",
    "author": "Patricia McKnight",
    "title": "Trump May Bypass Big Names Mandel, Vance in Ohio Race for Unknown Dolan"
  },
  {
    "id": 25705,
    "mediaId": 2649,
    "date": "2022-02-17",
    "sentence": "The only major Republican candidate in the Ohio Senate race who did not rely on self-financing at all is <span class='selected-term'>Josh Mandel</span>, the pro-Trump former Ohio treasurer and Marine Corps veteran.",
    "author": "Katherine Huggins",
    "title": "Over $560 million in campaign contributions flooded 2022 Senate races in first year of midterm election cycle"
  },
  {
    "id": 26119,
    "mediaId": 2537,
    "date": "2022-02-28",
    "sentence": "Neither Matt Dolan nor <span class='selected-term'>Josh Mandel</span> sought the party's endorsement, Hall said.",
    "author": "Erin Glynn",
    "title": "'Sending a message': Butler County GOP is second local party to shun Gov. Mike DeWine"
  },
  {
    "id": 25734,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "Timken’s GOP opponents <span class='selected-term'>Josh Mandel</span>, Mike Gibbons and JD Vance have all made a determined effort to win the Trump endorsement, while Matt Dolan is seeking to appeal to moderate Republicans who are less sold on Trump.",
    "author": "",
    "title": "Trump endorsement casts long shadow over Ohio Senate race"
  },
  {
    "id": 26028,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\n“Mike Gibbons got upset tonight that he was called out for his investments in Chinese oil,” said Scott Guthrie, Mandel’s campaign manager.",
    "author": "",
    "title": "Ohio GOP Senate debate turns nasty as Gibbons and Mandel go nose-to-nose"
  },
  {
    "id": 26008,
    "mediaId": 2748,
    "date": "2022-03-19",
    "sentence": "Ohio Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons were so close to blows that the moderator was forced to step in and get between the pair before the altercation could worsen.",
    "author": "STATION GOSSIP",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 25735,
    "mediaId": 2537,
    "date": "2022-03-22",
    "sentence": "The event came days after Gibbons and former state treasurer <span class='selected-term'>Josh Mandel</span> sparred on stage during another debate, one of them appearing to use a derogatory term for women as an insult.",
    "author": "Haley BeMiller",
    "title": "Gender dominates GOP Ohio Senate debate as Mike Gibbons dismisses women's oppression"
  },
  {
    "id": 25642,
    "mediaId": 2919,
    "date": "2022-03-28",
    "sentence": "\"I want to say it very clearly for all of the RINOs out there and all of the media elites out there the 2020 election was stolen from Donald J. Trump,\" candidate <span class='selected-term'>Josh Mandel</span> said.",
    "author": "Courtney Shaw",
    "title": "Ohio's 7 Republican Senate hopefuls face off in debate at Central State University"
  },
  {
    "id": 25804,
    "mediaId": 2560,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary – Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance – scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26125,
    "mediaId": 2680,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26237,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "Via AP news wire",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26388,
    "mediaId": 2822,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary — Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance — scored 100% on the survey used to help determine their endorsement.",
    "author": "JULIE CARR SMYTH - Associated Press",
    "title": "Ohio Right to Life backs JD Vance for open US Senate seat"
  },
  {
    "id": 26393,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "The organization noted that all four leading candidates in the seven-way primary - Cleveland investment banker Mike Gibbons, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, former state Republican chair Jane Timken and Vance - scored 100% on the survey used to help determine their endorsement.",
    "author": "Julie Carr Smyth",
    "title": "Ohio Right to Life backs JD Vance for open U.S. Senate seat"
  },
  {
    "id": 25884,
    "mediaId": 2680,
    "date": "2022-04-14",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair Jane Timken for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "JILL COLVIN and JULIE CARR SMYTH",
    "title": "GOP leaders in Ohio try to block Trump endorsement of Vance"
  },
  {
    "id": 26105,
    "mediaId": 2721,
    "date": "2022-04-15",
    "sentence": "Johnson, who has endorsed former Ohio Republican Party chair Jane Timken for Senate, said the letter has now been signed by between 40 and 50 people, including supporters of Timken, former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, Cleveland investment banker Mike Gibbons and state Sen. Matt Dolan.",
    "author": "",
    "title": "Trump to make huge announcement; GOP unhappy?"
  },
  {
    "id": 25695,
    "mediaId": 2919,
    "date": "2022-04-15",
    "sentence": "Vance has been locked in a heated race against former state treasurer <span class='selected-term'>Josh Mandel</span>, investment banker Mike Gibbons, former Ohio Republican Party chair Jane Timken, and state Sen. Matt Dolan, whose family owns the Cleveland Guardians.",
    "author": "Associated Press",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  }
]