[
  {
    "id": 25675,
    "mediaId": 2643,
    "date": "2022-02-14",
    "sentence": "He's running against pro-Trump candidates like JD Vance, <span class='selected-term'>Josh Mandel</span> and Jane Timken.",
    "author": "Patricia McKnight",
    "title": "Trump May Bypass Big Names Mandel, Vance in Ohio Race for Unknown Dolan"
  },
  {
    "id": 25790,
    "mediaId": 2664,
    "date": "2022-03-18",
    "sentence": "Ohio Republican Senate hopefuls <span class='selected-term'>Josh Mandel</span> and Mike Gibbons got into each others' faces on Friday during a heated primary debate.",
    "author": "Brad Reed",
    "title": "WATCH: Ohio GOP Senate candidates get in each others' faces during heated primary debate"
  },
  {
    "id": 26028,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\n“Mike Gibbons got upset tonight that he was called out for his investments in Chinese oil,” said Scott Guthrie, Mandel’s campaign manager.",
    "author": "",
    "title": "Ohio GOP Senate debate turns nasty as Gibbons and Mandel go nose-to-nose"
  },
  {
    "id": 26053,
    "mediaId": 2614,
    "date": "2022-03-19",
    "sentence": "Senator, and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become, and that will be reflected on the ballot on May 3,” said Samantha Cotten, a spokesperson for Gibbons’ campaign.",
    "author": "Red Voice Media",
    "title": "Ohio GOP Primary Debate Almost Turns Into A Fist Fight As Candidates Go Off The Rails [VIDEO]"
  },
  {
    "id": 25933,
    "mediaId": 2916,
    "date": "2022-03-19",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\nMeanwhile, Mandel’s campaign manager said Gibbons “got upset tonight that he was called out for his investments in Chinese oil.”\n“He claims not to remember the investment, but it’s part of a pattern of Gibbons’ entire career making money by taking American companies and selling them to foreign interests,” campaign manager Scott Guthrie said.",
    "author": "Brittany Bernstein",
    "title": "Ohio GOP Senate Candidates Have Heated Face-to-Face Exchange during Debate"
  },
  {
    "id": 26008,
    "mediaId": 2748,
    "date": "2022-03-19",
    "sentence": "Ohio Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons were so close to blows that the moderator was forced to step in and get between the pair before the altercation could worsen.",
    "author": "STATION GOSSIP",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 26010,
    "mediaId": 2644,
    "date": "2022-03-19",
    "sentence": "Senator, and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> has become, and that will be reflected on the ballot on May 3.”\nMandel, a former state treasurer, and Gibbons, a businessman, are two of seven candidates facing off in the crowded Republican primary.",
    "author": "Kyle Morris",
    "title": "Ohio GOP Senate debate nearly gets physical as candidates get into altercation"
  },
  {
    "id": 25609,
    "mediaId": 2662,
    "date": "2022-03-19",
    "sentence": "Both candidates are currently sitting atop the polls, with <span class='selected-term'>Josh Mandel</span> being the consensus front-runner for months, and Gibbons coming on strong of late, surging to the top spot among GOP Senate candidates in two recent independent surveys.",
    "author": "Julian Conradson",
    "title": "No, it’s Not an Episode of Jerry Springer: Ohio GOP Senate Front-Runners Nearly Come to Blows During HEATED Primary Debate (VIDEO)"
  },
  {
    "id": 26422,
    "mediaId": 2650,
    "date": "2022-03-20",
    "sentence": "“You’re dealing with the wrong guy,” Mandel says to Gibbons before calling him a “pussy.” pic.twitter.com/AbbyQpwXvu\n— Natalie Allison (@natalie_allison) March 18, 2022\nGibbons immediately tried to make political hay out of the tussle, calling Mandel “unfit” and “childlike.”\n<span class='selected-term'>Josh Mandel</span> is unhinged, unfit, and flailing – because he’s losing.",
    "author": "Rick Moran",
    "title": "Watch: GOP Ohio Senate Race Heats Up With Near On-Stage Brawl Between Gibbons and Mandel"
  },
  {
    "id": 26266,
    "mediaId": 2525,
    "date": "2022-03-21",
    "sentence": "The debate became intense almost as soon as it began as former state Treasurer <span class='selected-term'>Josh Mandel</span> attacked investment banker Mike Gibbons’ business dealings.",
    "author": "Associated Press",
    "title": "Fight at Ohio GOP Senate debate elevates military issue"
  },
  {
    "id": 26221,
    "mediaId": 2752,
    "date": "2022-03-21",
    "sentence": "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared <span class='selected-term'>Josh Mandel</span> is to be a leader and that will be reflected at the ballot on May 3.”\nThis is all true, but we also imagine Cotten will twist herself into knots justifying Gibbons’s inevitable endorsement of Mandel if he wins the nomination.",
    "author": "Stephen Robinson",
    "title": "All Fun And Games Until Ohio GOP Senate Candidate Starts Calling Opponent A 'Pussy'"
  },
  {
    "id": 25745,
    "mediaId": 2727,
    "date": "2022-03-21",
    "sentence": "“We all volunteered to serve our country away from our families, putting our lives in danger, so people like Mike Gibbons could make millions.”\nGibbons said Mandel initiated the physical aggression and made “several false, petty comments in an attempt to smear the new front-runner.”\n“<span class='selected-term'>Josh Mandel</span> is unhinged, unfit and flailing — because he’s losing,” Gibbons campaign spokesperson Samantha Cotten said.",
    "author": "AP and TOI staff",
    "title": "Near-fight at Ohio GOP Senate debate between candidates Josh Mandel, Mike Gibbons"
  },
  {
    "id": 26137,
    "mediaId": 2740,
    "date": "2022-03-21",
    "sentence": "A debate between Ohio Republican Senate candidates <span class='selected-term'>Josh Mandel</span> and Mike Gibbons on Friday escalated into an angry confrontation.",
    "author": "",
    "title": "Ohio GOP debate leads to angry confrontation"
  },
  {
    "id": 26264,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "Watch the original exchange below:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other\\u2019s faces at tonight\\u2019s GOP #OHSen forum hosted by FreedomWorks.\\n\\n\\u201cYou watch what happens,\\u201d Mandel says.pic.twitter.com/fQuqfHxXHT\n— Heartland Signal (@Heartland Signal) 1647644328",
    "author": "Matthew Chapman",
    "title": "Even Trump is 'baffled' as Ohio GOP candidates threaten each other over who deserves his endorsement: report"
  },
  {
    "id": 26109,
    "mediaId": 2644,
    "date": "2022-04-05",
    "sentence": "At a debate last month, Gibbons and former Ohio Treasurer <span class='selected-term'>Josh Mandel</span>, currently second in GOP primary polls, came close to a physical altercation on stage as Mandel slammed Gibbons for business links to China.",
    "author": "Steven Nelson",
    "title": "Ohio GOP Senate front-runner panned for taking $1.5M in PPP funds for bank"
  },
  {
    "id": 26151,
    "mediaId": 2572,
    "date": "2022-04-06",
    "sentence": "In a new campaign ad, Ohio GOP Senate candidate Mike Gibbons accuses primary opponent and former state Treasurer <span class='selected-term'>Josh Mandel</span> of being soft on China, circling back to the issue at the root of a combustible feud between the two.",
    "author": "Tyler Olson",
    "title": "Ohio GOP Senate showdown: Gibbons hits Mandel on China in ad that returns to root of combustible feud"
  },
  {
    "id": 26400,
    "mediaId": 2752,
    "date": "2022-04-06",
    "sentence": "Ohio GOP Senate candidate <span class='selected-term'>Josh Mandel</span> dropped a particularly loathsome ad Tuesday where he’s filmed walking across the Edmund Pettus Bridge, the site of the famous Selma march for voting rights, which Mandel doesn’t support.",
    "author": "Stephen Robinson",
    "title": "MLK Expert Josh Mandel Explains To MLK’s Daughter Bernice How Much MLK Loved Guns"
  },
  {
    "id": 26106,
    "mediaId": 2547,
    "date": "2022-04-10",
    "sentence": "Some of you may remember Gibbons from the recent debate where he and <span class='selected-term'>Josh Mandel</span> nearly came to blows.",
    "author": "Heather",
    "title": "Ohio GOP Senate Candidate: Middle Class Doesn't Pay 'Fair Share' Of Taxes"
  },
  {
    "id": 25619,
    "mediaId": 2641,
    "date": "2022-04-12",
    "sentence": "A closer look into the caricature that is <span class='selected-term'>Josh Mandel</span>, the already twice-failed Senate contender, shows that Mandel was Marco Rubio’s top guy in Ohio and wouldn’t even say President Trump’s name during the RNC Convention in Cleveland.",
    "author": "Bernard Kerik",
    "title": "In a Field of Buckeye State Pretenders, Timken Is the Real Deal"
  },
  {
    "id": 25695,
    "mediaId": 2919,
    "date": "2022-04-15",
    "sentence": "Vance has been locked in a heated race against former state treasurer <span class='selected-term'>Josh Mandel</span>, investment banker Mike Gibbons, former Ohio Republican Party chair Jane Timken, and state Sen. Matt Dolan, whose family owns the Cleveland Guardians.",
    "author": "Associated Press",
    "title": "Trump backs GOP’s JD Vance in US Senate primary in Ohio"
  },
  {
    "id": 26323,
    "mediaId": 2512,
    "date": "2022-04-16",
    "sentence": "",
    "author": "Meaghan Ellis",
    "title": "Josh Mandel's Ohio GOP Senate campaign strategy is focused on capturing voters 'through churches'?: report"
  }
]