[
  {
    "id": 13343,
    "mediaId": 2724,
    "date": "2022-02-28",
    "sentence": "— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) February 28, 2022\nTrump later froze $400 million in congressionally approved security assistance to Ukraine after a phone conversation with Ukrainian President Volodymyr Zelensky.",
    "author": "Rusty Weiss",
    "title": "Democrat Swalwell Claims If Trump Were President He’d Be ‘Sending Weapons To Russia’"
  },
  {
    "id": 10708,
    "mediaId": 2573,
    "date": "2022-03-18",
    "sentence": "(Tristan Wheelock/Bloomberg via Getty Images, AP Photo/Jill Colvin)\n\"<span class='selected-term'>Josh Mandel</span> is unhinged, unfit and flailing because he's losing,\" Samantha Cotten, a spokesperson for Gibbons' campaign, said in a statement following the altercation.",
    "author": "Kyle Morris",
    "title": "Ohio GOP Senate debate nearly gets physical as Gibbons, Mandel get into altercation"
  },
  {
    "id": 9176,
    "mediaId": 2658,
    "date": "2022-03-19",
    "sentence": "A new civil dialogue movement attempts to restore healthy debate.”\n— “Night Shifts,” by Michael Clune for Harper’s Magazine: “Can technology shape our dreams?”\n— “The Post Post-Cold War World,” by Bruce Mehlman, Mehlman-Castagnetti: “Russia-Ukraine war, and its consequences.”\n— “How Russia’s mistakes and Ukrainian resistance altered Putin’s war,” Financial Times’ Visual Storytelling Team: “Moscow’s initial hopes of lightning-fast victory foundered in face of fierce opposition and its own shortcomings.”\nPLAYBOOKERS\nAn Ohio GOP Senate debate almost turned physical after <span class='selected-term'>Josh Mandel</span> got in Mike Gibbons’ face over accusations about both business dealings with Chinese companies and Mandel’s work history.",
    "author": "",
    "title": "POLITICO Playbook: Congress loses an Alaskan titan"
  },
  {
    "id": 5843,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "Around the same time, <span class='selected-term'>Josh Mandel</span>, the forty-four-year-old former Ohio state treasurer, who overtook Gibbons in one recent poll, released an ad that begins with an Ohio woman saying critical race theory is “crap.” It then cuts to Mandel on the Edmund Pettus Bridge, in Selma, saying, “Martin Luther King, Jr., marched right here so skin color wouldn’t matter.”\nx\nNEW: Christian Dominionists who envision a theocratic takeover of the U.S. government have long sought to remake the nation in their image.",
    "author": "",
    "title": "Abbreviated Pundit Roundup: The illuminated war in Ukraine is taking place in plain sight"
  }
]