[
  {
    "id": 25968,
    "mediaId": 5247,
    "date": "2022-04-06",
    "sentence": "In his most recent video spot, <span class='selected-term'>Josh Mandel</span> is seen walking across the Edmund Pettus Bridge in Selma, Alabama, where Rev.",
    "author": "Sarah Sicard",
    "title": "Marine veteran’s campaign ad for US Senate features a bad photoshop job"
  },
  {
    "id": 25924,
    "mediaId": 4044,
    "date": "2022-04-06",
    "sentence": "While there appears to be a significant color difference between Mandel’s face and his hands in the version that appeared in the campaign ad, this color difference is far less noticeable in the original photograph (at right in the tweet below):\nYou folks asked if <span class='selected-term'>Josh Mandel</span>’s campaign photoshopped his head onto a Black man, and I looked for answers.",
    "author": "Dan Evon",
    "title": "Did Mandel ‘Forget To Photoshop His Hands’ in Campaign Ad?"
  },
  {
    "id": 25960,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "Fact-checkers have pushed back on the accusation that Ohio Senate candidate <span class='selected-term'>Josh Mandel</span> photoshopped himself into an image included in one of his ads.",
    "author": "Gustaf Kilander",
    "title": "Photo filter blamed as Ohio Senate candidate accused of photoshop in ad"
  },
  {
    "id": 25910,
    "mediaId": 2596,
    "date": "2022-04-07",
    "sentence": "Former Ohio Representative and current Senate candidate, <span class='selected-term'>Josh Mandel</span>, told Bernice King to 'study your history better' on Tuesday when King refuted statements Mandel made.",
    "author": "",
    "title": "Republican mansplains MLK Jr's beliefs... to MLK Jr's daughter"
  },
  {
    "id": 26047,
    "mediaId": 2627,
    "date": "2022-04-08",
    "sentence": "“There's nothing racist about stopping critical race theory and loving America.”\nThen a voiceover comes in: “<span class='selected-term'>Josh Mandel</span> — pro-God, pro-gun, pro-Trump.”\nIt dishonors the memories of Lewis and King to promote an agenda that will bring nothing but more harm to Black people at a site where they struggled for Black people’s advancement.",
    "author": "",
    "title": "Conservatives' appropriation of MLK just reached a shocking new low"
  }
]