[
  {
    "id": 26370,
    "mediaId": 2522,
    "date": "2022-02-23",
    "sentence": "‘You’re actually dumber than AOC.’\n‘Why are you so angry?’\nDonate to my campaign to keep <span class='selected-term'>Josh Mandel</span>’s hateful, sexist and racist rhetoric out of the Senate.https://t.co/RxdXFeviiB pic.twitter.com/egt7ImPlpy\n— Morgan Harper (@mh4oh) February 22, 2022\n“Last night I debated Josh Mandel in Cleveland,” she said, “and we saw from him what we’ve come to expect, racism, sexism, xenophobia, this guy has no solutions for the real issues that everyday Ohioans are facing and certainly no solutions for the black community,” throwing down the race card.",
    "author": "Chris Donaldson",
    "title": "‘Like AOC only dumber’: Ohio senate debate goes off the rails as racial hate turns to white Marine vet"
  },
  {
    "id": 25711,
    "mediaId": 2522,
    "date": "2022-02-23",
    "sentence": "(Video Credit: Fox News)\nSenate candidate <span class='selected-term'>Josh Mandel</span> (R-OH) clapped back at leftist radicals and Black Lives Matter members who interrupted him and demanded that he leave a church in Cleveland because he is white during an off-the-rails debate with Democratic candidate Morgan Harper.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Marine vet candidate puts BLM crowd in its place after being told to leave debate because he’s white"
  },
  {
    "id": 25802,
    "mediaId": 2915,
    "date": "2022-03-07",
    "sentence": "",
    "author": "Chad Groening/American Family News",
    "title": "More Than 100 Pastors Throw Support to Marine Corps Veteran Running for Senate in Ohio"
  },
  {
    "id": 26052,
    "mediaId": 2589,
    "date": "2022-03-18",
    "sentence": "Things went downhill from there and a moderator came over like he was the referee at a fight:\nMike Gibbons and <span class='selected-term'>Josh Mandel</span> get in each other’s faces at tonight’s GOP #OHSen forum hosted by FreedomWorks.",
    "author": "John Sexton",
    "title": "Republican debate devolves into shouting match"
  },
  {
    "id": 25787,
    "mediaId": 2540,
    "date": "2022-04-01",
    "sentence": "Washington (CNN)A new television ad from Ohio Republican Senate candidate <span class='selected-term'>Josh Mandel</span> is centered on a false claim that Republican primary rival Mike Gibbons, a businessman, said that military service isn't \"real work.\"",
    "author": "Daniel Dale",
    "title": "Fact check: Ad from Ohio Republican Josh Mandel falsely claims party rival Mike Gibbons said military service isn't real work"
  },
  {
    "id": 25670,
    "mediaId": 2586,
    "date": "2022-04-06",
    "sentence": "pic.twitter.com/7kz5nYseje\n— Natalie Allison (@natalie_allison) April 5, 2022\nShe wrote, “You folks asked if <span class='selected-term'>Josh Mandel</span>’s campaign photoshopped his head onto a Black man, and I looked for answers.",
    "author": "Stephanie Dube Dwilson",
    "title": "Josh Mandel Releases Original Photo with Black Marines After Photoshop Rumor"
  },
  {
    "id": 25968,
    "mediaId": 5247,
    "date": "2022-04-06",
    "sentence": "In his most recent video spot, <span class='selected-term'>Josh Mandel</span> is seen walking across the Edmund Pettus Bridge in Selma, Alabama, where Rev.",
    "author": "Sarah Sicard",
    "title": "Marine veteran’s campaign ad for US Senate features a bad photoshop job"
  },
  {
    "id": 25924,
    "mediaId": 4044,
    "date": "2022-04-06",
    "sentence": "While there appears to be a significant color difference between Mandel’s face and his hands in the version that appeared in the campaign ad, this color difference is far less noticeable in the original photograph (at right in the tweet below):\nYou folks asked if <span class='selected-term'>Josh Mandel</span>’s campaign photoshopped his head onto a Black man, and I looked for answers.",
    "author": "Dan Evon",
    "title": "Did Mandel ‘Forget To Photoshop His Hands’ in Campaign Ad?"
  },
  {
    "id": 25797,
    "mediaId": 2660,
    "date": "2022-04-07",
    "sentence": "(<span class='selected-term'>Josh Mandel</span> for U.S. Senate)\nFred Davis, a Republican consultant who creates ads for Mandel, told PolitiFact that the version of the image that showed up in the ad reflected efforts by the video editor to make sure the text directing viewers to the campaign’s \"JoshMandel.com\" web address showed up on the video.",
    "author": "Bill McCarthy",
    "title": "No evidence Josh Mandel photoshopped his face onto body of Black Marine for campaign ad"
  },
  {
    "id": 26047,
    "mediaId": 2627,
    "date": "2022-04-08",
    "sentence": "“There's nothing racist about stopping critical race theory and loving America.”\nThen a voiceover comes in: “<span class='selected-term'>Josh Mandel</span> — pro-God, pro-gun, pro-Trump.”\nIt dishonors the memories of Lewis and King to promote an agenda that will bring nothing but more harm to Black people at a site where they struggled for Black people’s advancement.",
    "author": "",
    "title": "Conservatives' appropriation of MLK just reached a shocking new low"
  }
]