[
  {
    "id": 26462,
    "mediaId": 2594,
    "date": "2022-01-26",
    "sentence": "Mr Vance's pivot from folksy intellectual to belligerent “patriot” is likely a tactic employed to take on his primary rival, former Ohio State Treasurer <span class='selected-term'>Josh Mandel</span>.",
    "author": "Graig Graziosi",
    "title": "JD Vance mocked for celebrating Marjorie Taylor Greene endorsement as he vows to take US back from ‘scumbags’"
  },
  {
    "id": 26292,
    "mediaId": 2710,
    "date": "2022-02-04",
    "sentence": "Lee’s PAC doled out campaign cash to several Republican candidates, including Ohio Senate candidate <span class='selected-term'>Josh Mandel</span>, Florida Sen. Marco Rubio and Utah Rep. Chris Stewart.",
    "author": "Bryan Schott",
    "title": "Who is leading the 2022 money race for Utah’s congressional seats?"
  },
  {
    "id": 25953,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "Hamas spokesman to deliver response to state of the union.https://twitter.com/hollyotterbein/status/1496455601416814598\\u00a0\\u2026\n— <span class='selected-term'>Josh Mandel</span> (@Josh Mandel) 1645658514\nTwitter was jolted into condemning Mandel's unprovoked post for being baselessly and unabashedly racist.",
    "author": "Brandon Gage",
    "title": "Josh Mandel tweets racist trope about Rashida Tlaib"
  },
  {
    "id": 25992,
    "mediaId": 2831,
    "date": "2022-02-24",
    "sentence": "Look at Missouri, where you have these primaries of Eric Greitens, or the one in Ohio with <span class='selected-term'>Josh Mandel</span> and J. D. Vance.",
    "author": "Storer H. Rowley",
    "title": "Adam Kinzinger’s Warning to His Fellow Republicans on January 6 and Ukraine"
  },
  {
    "id": 26343,
    "mediaId": 2550,
    "date": "2022-03-31",
    "sentence": "OH-Sen: USA Freedom Fund, a Club for Growth-aligned group backing former state Treasurer <span class='selected-term'>Josh Mandel</span>, has launched what Inside Elections' Jacob Rubashkin says is a $1.2 million buy that seeks to portray businessman Mike Gibbons as demeaning to the military.",
    "author": "",
    "title": "Morning Digest: Our guide to Ohio's new congressional map, gerrymandered to benefit the GOP"
  },
  {
    "id": 26189,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Other primary candidates include investment banker Mike Gibbons, former Ohio treasurer <span class='selected-term'>Josh Mandel</span>, and Jane Timken, the former chair of the Ohio Republican Party.",
    "author": "Gustaf Kilander",
    "title": "JD Vance accused of racism over new campaign ad in which he asks ‘Do you hate Mexicans?’"
  },
  {
    "id": 26323,
    "mediaId": 2512,
    "date": "2022-04-16",
    "sentence": "",
    "author": "Meaghan Ellis",
    "title": "Josh Mandel's Ohio GOP Senate campaign strategy is focused on capturing voters 'through churches'?: report"
  }
]