[
  {
    "id": 25813,
    "mediaId": 2745,
    "date": "2022-02-22",
    "sentence": "He and the leading candidate in the primary, former state treasurer <span class='selected-term'>Josh Mandel</span>, have both offered vacuous misdirection about our border being more important than Ukraine’s.",
    "author": "",
    "title": "Opinion: J.D. Vance’s repulsive spin about Putin and Ukraine faces a new test"
  },
  {
    "id": 25917,
    "mediaId": 2594,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Andrew Naughtie",
    "title": "Trump news: White House slams Putin ‘scheme’ as ex-president rejects House speaker plan"
  },
  {
    "id": 25981,
    "mediaId": 2564,
    "date": "2022-02-25",
    "sentence": "",
    "author": "",
    "title": "EXCLUSIVE: Trump gets his game face on: Ex-President plays golf at his West Palm Beach course ahead of his CPAC speech on Saturday night after tearing into Biden's response to Putin's Ukraine invasion"
  },
  {
    "id": 26399,
    "mediaId": 2724,
    "date": "2022-02-28",
    "sentence": "— <span class='selected-term'>Josh Mandel</span> (@JoshMandelOhio) February 28, 2022\nTrump later froze $400 million in congressionally approved security assistance to Ukraine after a phone conversation with Ukrainian President Volodymyr Zelensky.",
    "author": "Rusty Weiss",
    "title": "Democrat Swalwell Claims If Trump Were President He’d Be ‘Sending Weapons To Russia’"
  },
  {
    "id": 25731,
    "mediaId": 2659,
    "date": "2022-03-18",
    "sentence": "He trails Mike Gibbons by 11 points and <span class='selected-term'>Josh Mandel</span> by 9 points.",
    "author": "Jason Easley",
    "title": "JD Vance Sided With Putin And Now He May Lose The Ohio Senate GOP Primary"
  },
  {
    "id": 25727,
    "mediaId": 2550,
    "date": "2022-03-20",
    "sentence": "This involves really two candidates: former Ohio treasurer, <span class='selected-term'>Josh Mandel</span>, and former Ohio Republican party chair, Jane Timken.",
    "author": "",
    "title": "The Downballot: Voting rights and criminal justice are on your local ballot this year (transcript)"
  }
]