[
  {
    "id": 1433,
    "mediaId": 2866,
    "date": "2022-02-18",
    "sentence": "Ohio Rep. <span class='selected-term'>Jim Jordan</span>, the top Republican on the House Judiciary Committee, is requesting the Justice Department provide information about its new domestic terrorism office, considering the agency’s plans last year regarding parents at school board meetings.",
    "author": "Fix This Nation Staff",
    "title": "Are School Parents A Target With DOJ’s New Domestic Terror Office?"
  },
  {
    "id": 18,
    "mediaId": 8322,
    "date": "2022-02-21",
    "sentence": "Ric Grenell\nFormer Rep. Tulsi Gabbard, D-Hawaii, and former Democratic presidential candidate\nSaturday, Feb. 26\nRep. Marjorie Taylor Greene, R-Ga.\nRepublican National Committee Chair Ronna McDaniel\nRep. Ronny Jackson, R-Texas\nFormer Assistant Secretary of the Treasury for Public Affairs Monica Crowley\nSen. Bill Hagerty, R-Tenn.\nSen. Rick Scott, R-Fla.\nRep. <span class='selected-term'>Jim Jordan</span>, R-Ohio\nSen. John Kennedy, R-La.",
    "author": "",
    "title": "CPAC to kick off under banner of 'Awake not Woke,' serve as 'starting gun' for Republicans ahead of midterms"
  },
  {
    "id": 13268,
    "mediaId": 2699,
    "date": "2022-03-04",
    "sentence": "Ted Cruz (R-TX) and Josh Hawley (R-MO) and Reps. Matt Gaetz (R-FL) and <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Corbin Bolies",
    "title": "Revealed: Roger Stone’s Bonkers Pardon Plan for Jan. 6 Lawmakers"
  },
  {
    "id": 11220,
    "mediaId": 2664,
    "date": "2022-03-08",
    "sentence": "As CNN's Zanona points out, controversial Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) is already in line to take over the chairmanship of the powerful House Judiciary Committee \"with all the subpoena power that comes with it.\"",
    "author": "Tom Boggioni",
    "title": "Freedom Caucus plans to 'elevate' Taylor Greene and Boebert on committees after GOP retakes the House: report"
  },
  {
    "id": 9564,
    "mediaId": 2746,
    "date": "2022-03-21",
    "sentence": "It was signed by Judiciary Committee ranking member <span class='selected-term'>Jim Jordan</span> of Ohio and committee members Mike Johnson of Louisiana and Andy Biggs of Arizona.",
    "author": "Ryan Lovelace",
    "title": "Lawmakers question if FBI director misled Congress after audit revealed agents’ rule-breaking"
  },
  {
    "id": 9446,
    "mediaId": 2557,
    "date": "2022-03-27",
    "sentence": "I suspect this conduct goes back for multiple administrations and has been an ongoing problem affecting members of both parties.”\nPromoted Content\nThe House Judiciary Committee’s ranking member Rep. <span class='selected-term'>Jim Jordan</span>, Rep. Mike Johnson, and Rep. Biggs all signed a letter to Christopher Wray demanding an unredacted copy of the audit.",
    "author": "DML News App",
    "title": "REPORT: House GOP pushes Wray for transparency on FBI misconduct after audit report"
  },
  {
    "id": 8906,
    "mediaId": 8322,
    "date": "2022-03-27",
    "sentence": "HUNTER BIDEN'S LAPTOP: EX-CIA OFFICER BUCK SEXTON RIPS FORMER COLLEAGUES' REFUSAL TO APOLOGIZE\nBiggs signed onto a March 21 letter with the House Judiciary Committee’s ranking member Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Rep. Mike Johnson, R-La., to FBI Director Christopher Wray requesting an unredacted copy of the report, documents referring to or relating to the audit, an explanation of whether the FBI resolved the matters and a description of the FBI’s predicate to open investigations into politicians, religious groups and others named in the audit.",
    "author": "Fred Lucas",
    "title": "House GOP pushes Wray for transparency on FBI misconduct in probing politicians, religious groups, journalists"
  },
  {
    "id": 9356,
    "mediaId": 2748,
    "date": "2022-03-29",
    "sentence": "“The Judiciary Committee will have oversight in the next session of Congress.”\nBiggs and fellow Republican Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Mike Johnson of Louisiana have written a letter to FBI Director Christopher Wray for an unredacted copy of the audit.",
    "author": "STATION GOSSIP",
    "title": "FBI Made Mistakes Across Hundreds of Cases, But Here's What's Happening Now That Republicans Have Found Out"
  },
  {
    "id": 9703,
    "mediaId": 2689,
    "date": "2022-03-29",
    "sentence": "“The Judiciary Committee will have oversight in the next session of Congress.”\nBiggs and fellow Republican Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Mike Johnson of Louisiana have written a letter to FBI Director Christopher Wray for an unredacted copy of the audit.",
    "author": "",
    "title": "FBI Made Mistakes Across Hundreds Of Cases, But Here’s What Republicans Have Found Out…"
  },
  {
    "id": 7335,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "Freedom of speech on campus\nRepublicans on the panel, Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Andy Biggs of Arizona, focused on freedom of speech on college campuses, and argued that these places were not welcoming to conservatives.",
    "author": "Ariana Figueroa",
    "title": "Students who fought book ban tell their story to House panel"
  },
  {
    "id": 5259,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "John Binder",
    "title": "Exclusive — Andy Biggs: Biden Could Bring 30K Illegal Aliens to U.S. Border Every Day with End of Title 42"
  }
]