[
  {
    "id": 2803,
    "mediaId": 2618,
    "date": "2022-02-01",
    "sentence": "Monday on FNC’s “The Ingraham Angle,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) condemned the Biden administration’s use of government power to infringe on the exercise of First and Second Amendment rights.",
    "author": "Jeff Poor",
    "title": "Jordan: ‘Scary Stuff’ What the Biden Administration Has Done with First Amendment Rights, Second Amendment Liberties"
  },
  {
    "id": 2824,
    "mediaId": 2658,
    "date": "2022-02-02",
    "sentence": "But the bill has also attracted major GOP critics such as Florida Sen. Marco Rubio, Tennessee Sen. Marsha Blackburn, House Minority Leader Kevin McCarthy and House Judiciary ranking member <span class='selected-term'>Jim Jordan</span> of Ohio, all of whom have done interviews with Breitbart opposing the legislation.",
    "author": "",
    "title": "Split on the right: Breitbart joins Facebook and Google in opposing news media bill"
  },
  {
    "id": 3308,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "Politico also acknowledges that Republican lawmakers have flocked to Breitbart to condemn the legislation:\nBut the bill has also attracted major GOP critics such as Florida Sen. Marco Rubio, Tennessee Sen. Marsha Blackburn, House Minority Leader Kevin McCarthy and House Judiciary ranking member <span class='selected-term'>Jim Jordan</span> of Ohio, all of whom have done interviews with Breitbart opposing the legislation.",
    "author": "Allum Bokhari",
    "title": "Politico Attacks Breitbart for Not Joining Media Cartel Bandwagon"
  },
  {
    "id": 2641,
    "mediaId": 2526,
    "date": "2022-02-05",
    "sentence": "For the 2022 midterms, nearly 100 Republican lawmakers have accepted donations from the Koch Industries PAC, including Reps. Liz Cheney (R-WY), Jeff Duncan (R-SC), Don Bacon (R-NE), Tony Gonzalez (R-TX), Adam Kinzinger (R-IL), Ashley Hinson (R-IA), Julia Letlow (R-LA), Jackie Walorski (R-IN), Garret Graves (R-LA), Jim Banks (R-IN), Byron Donalds (R-FL), Yvette Herrell (R-NM), and <span class='selected-term'>Jim Jordan</span> (R-OH), among others.",
    "author": "John Binder",
    "title": "Axios: Breitbart News Readers, Trump’s Small-Dollar Donors Steer ‘Modern’ GOP as Corporate Class Fades"
  },
  {
    "id": 11524,
    "mediaId": 2526,
    "date": "2022-03-07",
    "sentence": "I respect that.”\nBishop, who is also a member of the Judiciary Committee and good friends with ranking member Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), noted there is a “particular logic that makes sense” in the possibility of him chairing Homeland.",
    "author": "Ashley Oliver",
    "title": "Exclusive: Freedom Caucus Members Jostle for Top Post on Immigration Oversight Panel"
  },
  {
    "id": 11236,
    "mediaId": 2557,
    "date": "2022-03-09",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) is demanding answers from the National School Boards Association (NSBA) regarding its “collusion” with the Biden administration to use federal law enforcement to investigate parents attending school board meetings as “domestic terrorists.”\nIn a letter obtained exclusively by Breitbart News, Jordan — who is the ranking member of the House Judiciary Committee — points out that the NSBA’s original letter to President Joe Biden prompted a “rapid and stunning response … that culminated in a directive from the Attorney General for federal law enforcement to monitor school board matters.”\nThe article goes on to state the following:\nJordan also pointed out in the letter that the NSBA and Biden administration sought to manufacture a reason for federal law enforcement to go after parents, saying, “We still have concerns about the NSBA’s collusion with the Biden Administration to develop a pretext for invoking federal law enforcement to intimidate and silence parents.” [Emphasis added].",
    "author": "DML News App",
    "title": "NEWS ALERT: Jim Jordan: NSBA Colluded with Biden Admin to ‘Intimidate and Silence Parents’"
  },
  {
    "id": 11054,
    "mediaId": 2618,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Jordan Dixon-Hamilton",
    "title": "Report: Oz Looks to Exit Senate Race, Return to Television"
  },
  {
    "id": 8942,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Matthew Boyle",
    "title": "Exclusive — Kevin McCarthy: Dozens of ‘Preservation Notices’ Being Sent Across Government, Setting Stage for GOP Investigative Clash with Biden After Midterms"
  },
  {
    "id": 7242,
    "mediaId": 2557,
    "date": "2022-03-31",
    "sentence": "“Big Tech, Big Democrat Party, and Big Media all colluded to keep critical information from the American people in the run-up to the most important election we have, the presidential election, so we’re launching an investigation,” said Ranking Member <span class='selected-term'>Jim Jordan</span> (R-OH) Thursday on Fox Business.",
    "author": "DML News App",
    "title": "NEWS ALERT: Judiciary GOP Investigating Facebook, Twitter for Suppressing Hunter Laptop"
  },
  {
    "id": 5325,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Paul Bois",
    "title": "Elon Musk ‘Has Decided Not’ to Join Twitter’s Board of Directors"
  },
  {
    "id": 5948,
    "mediaId": 2656,
    "date": "2022-04-16",
    "sentence": "The House Jan. 6 witch hunt committee admitted that Schiff altered a text message from Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) to former Trump chief of staff Mark Meadows, making it appear much more damning than it actually was.",
    "author": "Robert Spencer",
    "title": "You’ll Never Guess Who Wants to Be Speaker of the House Now"
  }
]