[
  {
    "id": 7071,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> voiced outrage at the marijuana bill's timing, saying that issues such as crime, inflation, and illegal immigration should be taking precedence.",
    "author": "",
    "title": "House votes to decriminalize marijuana at federal level"
  },
  {
    "id": 7565,
    "mediaId": 2553,
    "date": "2022-04-01",
    "sentence": "“The left will not let the Democrats do what needs to be done with the inflation problem, the energy problem, the illegal immigration problem on the southern border,” Representative <span class='selected-term'>Jim Jordan</span> (R-OH) said.",
    "author": "Charlotte Pence Bond",
    "title": "House Votes To Legalize Marijuana; Dems Applaud It As ‘Racial Justice Bill’"
  },
  {
    "id": 7821,
    "mediaId": 6621,
    "date": "2022-04-01",
    "sentence": "",
    "author": "",
    "title": "HIGH ON THE HILL: House Votes 220-204 to Legalize Marijuana Federally, Faces Opposition in the Senate"
  },
  {
    "id": 7131,
    "mediaId": 2621,
    "date": "2022-04-07",
    "sentence": "In a New York Times opinion piece, Mast called for taking action such as, but not limited to, “[d]efining what constitutes an assault or tactical firearm and not allowing them for future purchase — just as we already prohibit the purchase of fully automatic firearms” and “[b]anning the sale of accessories and add-ons that circumvent the ban on automatic firearms, and increasing the ages at which individuals can purchase various categories of firearms.”\nIn addition to Mast, Trump also endorsed on Wednesday Reps. Marjorie Taylor Greene (R-GA), Greg Murphy (R-NC), Kat Cammack (R-FL), Mike Johnson (R-LA), <span class='selected-term'>Jim Jordan</span> (R-OH) and Carol Miller (R-WV).",
    "author": "Jackson Richman",
    "title": "Trump Endorses Rep. Brian Mast By Touting Him as ‘Strong’ on 2nd Amendment — Even Though He Supports Assault Weapons Ban"
  }
]