[
  {
    "id": 1952,
    "mediaId": 2590,
    "date": "2022-02-07",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) also complained about GoFundMe’s action on Twitter, and Elon Musk gushed: “Canadian truckers rule.”\nDonald Trump Jr. called via a tweet on Friday for all Republican attorneys general in the U.S. to investigate.",
    "author": "Mary Papenfuss",
    "title": "Ted Cruz Throws In With Anti-Vaccine Ottawa Trucker Mob As City Declares Emergency"
  },
  {
    "id": 1897,
    "mediaId": 2590,
    "date": "2022-02-07",
    "sentence": "Ron DeSantis, Sen. Ted Cruz (R-Texas), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Republican attorneys general who want to launch an investigation into GoFundMe for its police-requested action against a foreign protest organization.",
    "author": "Mary Papenfuss",
    "title": "Christian Fundraiser For Kyle Rittenhouse Now Collecting Millions For Ottawa Trucker Mob"
  },
  {
    "id": 1791,
    "mediaId": 2572,
    "date": "2022-02-09",
    "sentence": "Joining me now is Ohio Congressman <span class='selected-term'>Jim Jordan</span>, House Judiciary Committee ranking member; and Indiana Congressman Jim banks, Republican Study Committee Chair.",
    "author": "Fox News Staff",
    "title": "'Ingraham Angle' on the Canadian 'Freedom Convoy' for medical freedom"
  },
  {
    "id": 1797,
    "mediaId": 2573,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Kyle Morris",
    "title": "DHS tracking reports of potential truck convoy in America amid Canada trucker protests"
  },
  {
    "id": 1351,
    "mediaId": 2664,
    "date": "2022-02-11",
    "sentence": "As Lewis notes, lawmakers like Rep. <span class='selected-term'>Jim Jordan</span> (R-OH and Sen. Ted Cruz (R-TX) have a long history of attacking Black Lives Matter protesters for shutting down streets but have no problem when it comes to anti-vaxx protests that threaten to leave store shelves empty.",
    "author": "Tom Boggioni",
    "title": "'Law and Order' GOPers flattened for sudden love affair with truck blockade"
  },
  {
    "id": 1578,
    "mediaId": 2699,
    "date": "2022-02-11",
    "sentence": "It is ironic, but not surprising, that this truckers’ protest is being championed by Republicans like Sen. Ted Cruz and Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "Matt Lewis",
    "title": "Wait, Now the Right Loves Traffic-Blocking Protesters?"
  },
  {
    "id": 977,
    "mediaId": 2590,
    "date": "2022-02-12",
    "sentence": "Ron DeSantis, Elon Musk, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), and Donald Trump and son Donald Trump Jr.\nGoFundMe earlier this month shut down a site that had raised close to $10 million for the truckers after Ottawa police reached out to the company to complain of illegal activity by the truckers.",
    "author": "Mary Papenfuss",
    "title": "Canadian Judge Blocks Money For Truckers From U.S. Right-Wing Christian Fundraising Site"
  },
  {
    "id": 1739,
    "mediaId": 2658,
    "date": "2022-02-14",
    "sentence": "Meanwhile, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) defended the truckers on Fox News.",
    "author": "",
    "title": "What's happening with the Canadian trucker convoy? Here's what you need to know"
  },
  {
    "id": 895,
    "mediaId": 2573,
    "date": "2022-02-16",
    "sentence": "When <span class='selected-term'>Jim Jordan</span> and myself said that they were spying on his campaign, we were ridiculed.",
    "author": "",
    "title": "'Hannity' on Durham findings, Canadian truckers"
  },
  {
    "id": 12515,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Kerry Picket",
    "title": "Harris compares Republicans to 1960s Alabama state troopers on ‘Bloody Sunday’"
  },
  {
    "id": 11036,
    "mediaId": 2724,
    "date": "2022-03-11",
    "sentence": "",
    "author": "RealClearWire",
    "title": "Will Dems’ Green Dream Fuel GOP Red Wave?"
  }
]