[
  {
    "id": 1015,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Laura Collins & Elizabeth Elkind &",
    "title": "Exclusive: Clinton cornered: Hillary refuses to answer questions about Durham revelation she paid to spy on the Trump campaign as she arrives at daughter Chelsea's Manhattan home ahead of the New York Democratic Convention"
  },
  {
    "id": 12526,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Natasha Anderson &",
    "title": "Nearly there! People's Convoy rolls into Maryland as 30 mile caravan of anti-mandate protesters approach their final destination of Washington DC and tease possible visit to WHITE HOUSE"
  },
  {
    "id": 12511,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Katie Weston",
    "title": "Vladimir Putin says Western sanctions on Russia are almost a declaration of WAR and anyone imposing no-fly zone on Ukraine would be considered to have entered the conflict"
  },
  {
    "id": 12928,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Jack Wright & Harriet Alexander",
    "title": "Parents grieve over toddler killed by shrapnel hours before 'ceasefire' intended to let them evacuate - which Putin's troops ignored anyway: Civilians attempting to escape Mariupol are forced back by shelling as Russians break pledge"
  },
  {
    "id": 12546,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Cristina Laila",
    "title": "Far-Left Actress Patricia Arquette Demands Russia be Kicked Out of….NATO – Then Blames Her ‘Dyslexia’ After Getting Roasted For Her Stupidity"
  },
  {
    "id": 6023,
    "mediaId": 2671,
    "date": "2022-04-10",
    "sentence": "Bartiromo had Rep. <span class='selected-term'>Jim Jordan</span> on air this morning, and the two of them delivered maybe the best segment on Hunter Biden and the laptop and Joe Biden complicity that I’ve seen on TV news.",
    "author": "Fred T",
    "title": "MUST SEE: Maria Bartiromo & Jim Jordan DESTROY Dem/Media collusion on Hunter Biden, SLAP Chris Wallace for good measure"
  },
  {
    "id": 5286,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Emily Crane",
    "title": "NY, Calif. failed in handling of COVID — but Florida was among best: study"
  },
  {
    "id": 5449,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "Must See: Engelbrecht and Phillips on the Charlie Kirk Show on 2020 Fraud and “2000 Mules” – Cross-State Ballot Traffickers ID’ed – Brian Kemp Implicated – 1155 Ballot Traffickers in PA (Video)"
  },
  {
    "id": 5344,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "“I’m Defending the Right to Express Your Views Under the First Amendment” – Alan Dershowitz Speaks Out in Defense of J6er He Is Representing who Was Waved in to US Capitol (Video)"
  },
  {
    "id": 5237,
    "mediaId": 2618,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Alexander Connell",
    "title": "Secret Recording: Kevin McCarthy Told Liz Cheney He Would Tell Trump To Resign In Shocking Leaked Audio"
  }
]