[
  {
    "id": 3705,
    "mediaId": 2573,
    "date": "2022-01-25",
    "sentence": "In a letter to Health and Human Services Secretary Xavier Becerra, Reps. James Comer, R-Ky., and <span class='selected-term'>Jim Jordan</span>, R-Ohio, pointed to a Feb. 1, 2020, conference call that included Fauci and former National Institutes of Health Director Francis Collins in which the virus's origins were discussed.",
    "author": "Ronn Blitzer",
    "title": "Reps. Comer, Jordan expose new Fauci emails they say point to COVID-19 lab leak 'cover up'"
  },
  {
    "id": 2817,
    "mediaId": 2572,
    "date": "2022-02-03",
    "sentence": "Reps. James Comer, R-Ky.,, a member of the Oversight and Reform Committee; Steve Scalise, R-La., the minority whip and ranking member of the Select Subcommittee on the Coronavirus Crisis; and <span class='selected-term'>Jim Jordan</span>, R-Ohio, ranking member of the Judiciary Committee, have questioned whether these scientists felt pressure from top health officials like Dr. Antony Fauci and Dr. Francis Collins.",
    "author": "Caitlin McFall",
    "title": "Top oversight Republicans call on 7 scientists to testify on COVID origins, Wuhan lab leak"
  },
  {
    "id": 2591,
    "mediaId": 2580,
    "date": "2022-02-05",
    "sentence": "This deep distrust includes two prominent members of Congress, Rep. <span class='selected-term'>Jim Jordan</span>, ranking member of the Committee on the Judiciary, and U.S. Sen. Roger Marshall, R-Kan., a scientist and physician I spoke with on Wednesday.",
    "author": "GOPUSA",
    "title": "Rep. Jim Jordan and Sen. Roger Marshall Expose Fauci’s Web of Deceit"
  },
  {
    "id": 13001,
    "mediaId": 4024,
    "date": "2022-03-01",
    "sentence": "WASHINGTON, D.C. (LifeSiteNews) — Republican U.S. Rep. <span class='selected-term'>Jim Jordan</span> of Ohio says investigations into Dr. Anthony Fauci and the Centers for Disease Control (CDC) need to become a top priority if Republicans get control of the House after the 2022 midterm elections.",
    "author": "Jack\nBingham",
    "title": "Jim Jordan says investigating Fauci a priority if GOP controls House after midterm election"
  },
  {
    "id": 9466,
    "mediaId": 6449,
    "date": "2022-03-23",
    "sentence": "It is worth recalling Fauci’s comments in response to questions from Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, about health measures amidst the pandemic: “I don’t look at this as a liberty thing … just as a public health thing.”\nHe was wrong.",
    "author": "Frank Yang",
    "title": "‘15 Days’ to 2 Years: How Power Corrupted Our Public Health Bureaucrats"
  }
]