[
  {
    "id": 4484,
    "mediaId": 2590,
    "date": "2022-01-13",
    "sentence": "When members of the House Select Committee on Jan. 6 asked Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) to meet with them, they probably should’ve known that he wouldn’t comply with their request.",
    "author": "Nathalie Baptiste",
    "title": "It's Time For Democrats To Accept That Norms Are Dead"
  },
  {
    "id": 3321,
    "mediaId": 8322,
    "date": "2022-02-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, joined \"The Ingraham Angle\" on Monday to discuss what he believes are unprecedented moves from the Biden administration against law-abiding Americans.",
    "author": "Fox News Staff",
    "title": "Rep. Jim Jordan: Second Amendment under attack by Biden administration"
  },
  {
    "id": 3072,
    "mediaId": 2748,
    "date": "2022-02-01",
    "sentence": "Monday on FNC’s “The Ingraham Angle,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) condemned the Biden administration’s use of government power to infringe on the exercise of First and Second Amendment rights.",
    "author": "Women System",
    "title": "Jordan: ‘Scary Stuff’ What the Biden Administration Has Done with First Amendment Rights, Second Amendment Liberties"
  },
  {
    "id": 2803,
    "mediaId": 2618,
    "date": "2022-02-01",
    "sentence": "Monday on FNC’s “The Ingraham Angle,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) condemned the Biden administration’s use of government power to infringe on the exercise of First and Second Amendment rights.",
    "author": "Jeff Poor",
    "title": "Jordan: ‘Scary Stuff’ What the Biden Administration Has Done with First Amendment Rights, Second Amendment Liberties"
  },
  {
    "id": 2043,
    "mediaId": 2740,
    "date": "2022-02-08",
    "sentence": "Ohio Rep. <span class='selected-term'>Jim Jordan</span>, who now serves as the lead Republican on the House Judiciary Committee, fumed that “Hillary Clinton gets treated different than anybody else.” Another member of the panel stated, “This is the reason for this hearing – the sloppiness, the messiness, and the ability for a secretary of State to do something that shouldn’t have been done.” Another Republican weighed in, “I want to know about the destruction – the hammering of BlackBerrys.” The panel’s chairman at the time, Jason Chaffetz, who can now be seen espousing self-righteous nonsense of Fox News, attacked Clinton, “The secretary had a choice.",
    "author": "Kurt Bardella",
    "title": "The 'but Hillary’s emails' crowd goes silent about Trump’s document destruction"
  },
  {
    "id": 1793,
    "mediaId": 2573,
    "date": "2022-02-09",
    "sentence": "Here with the very latest is the ranking member of the House Judiciary Committee, Congressman <span class='selected-term'>Jim Jordan</span>, along with former White House chief of staff and former congressman, Mark Meadows, is with us.",
    "author": "",
    "title": "'Hannity' on Capitol Police"
  },
  {
    "id": 1889,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "\"How wonderful to have prime-time hearings that actually have people talking about Donald Trump taking records, official White House records, shredding them up, shoving them down the toilet, staff members coming in to testify and showing clips of [Rep.] <span class='selected-term'>Jim Jordan</span>, showing clips of everybody else on that committee talking about how sacred these official documents are and how horrible it was that Hillary Clinton, you know, did what we've found out it seems like so many people in the Trump administration did with their email accounts, and then again, the destruction of these documents and have the staff members running behind saying, 'Yeah, we always had to run in and grab the documents out of the trash can and piece them together, the ones we could, the ones that Donald wasn't flushing down the toilet.\"",
    "author": "Travis Gettys",
    "title": "Democrats can expose GOP ‘hypocrisy’ using Jim Jordan’s playbook: Morning Joe"
  },
  {
    "id": 2575,
    "mediaId": 2636,
    "date": "2022-02-10",
    "sentence": "The committee did receive evidence in the documents requested from the National Archives that Mr. Trump had a call with Representative <span class='selected-term'>Jim Jordan</span>, Republican of Ohio, who led the floor strategy on Jan. 6 of objecting to Joseph R. Biden Jr.’s victory in key states, according to two people familiar with the investigation.",
    "author": "",
    "title": "Trump’s Missing Call Logs Present a Challenge for Jan. 6 Investigators"
  },
  {
    "id": 2199,
    "mediaId": 2672,
    "date": "2022-02-10",
    "sentence": "The committee has established that Trump spoke to several figures in this circle on Jan. 6, including Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), who admitted last summer he spoke to Trump on the day of the riot.",
    "author": "Ryan Bort",
    "title": "The White House Reportedly Didn’t Log Some of Trump’s Jan. 6 Calls — for Some Strange Reason"
  },
  {
    "id": 2130,
    "mediaId": 2547,
    "date": "2022-02-10",
    "sentence": "How wonderful to have prime time hearings that actually have people talking about Donald Trump taking records, official White House records, shredding them up, shoving them down the toilet, staff members coming in to testify and showing clips of <span class='selected-term'>Jim Jordan</span>, showing clips of everybody else on that committee talking about how sacred these official documents are and how horrible it was that Hillary Clinton, you know, did what we've found out it seems like so many people in the Trump administration did with their e-mail accounts.",
    "author": "Susie Madrak",
    "title": "Morning Joe: Dems Should Take Page From Jim Jordan Playbook"
  },
  {
    "id": 1302,
    "mediaId": 2664,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Chauncey Devega",
    "title": "Joe Walsh on what the left doesn't get: TrumpWorld 'would happily burn this country down'"
  },
  {
    "id": 1788,
    "mediaId": 2614,
    "date": "2022-02-13",
    "sentence": "With the bombshell news that Hillary was purposely trying to spy on then-President Trump, Ohio Representative <span class='selected-term'>Jim Jordan</span> spoke on Fox News about the accusations.",
    "author": "Red Voice Media",
    "title": "Durham Exposed Hillary’s Treason? Trump, Russia Collusion? – ‘Worse Than We Thought’ – Jim Jordan [VIDEO]"
  },
  {
    "id": 1412,
    "mediaId": 2630,
    "date": "2022-02-14",
    "sentence": "“Upon identifying DNS queries from Russian-made Yota phones in proximity to the Trump campaign and the EOP, respected cyber-security researchers were deeply concerned about the anomalies they found in the data and prepared a report of their findings, which was subsequently shared with the CIA.”\nHouse committee calls on Rep. <span class='selected-term'>Jim Jordan</span> to provide information about Jan. 6 Capitol riot\nDec. 23, 202103:29\nA spokesperson for special counsel Durham’s office said the office declines to comment beyond the court filings and any response will be in future filings with the court.",
    "author": "",
    "title": "Tech exec used access to White House computers to look for dirt on Trump, says special counsel"
  },
  {
    "id": 1400,
    "mediaId": 2659,
    "date": "2022-02-14",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio) said that former President Donald Trump’s call for the executions of those who worked on Hillary Clinton’s 2016 presidential campaign is “right on target.”\n“We’ve never seen anything like this in history,” Jordan told the hosts of “Fox and Friends.” “So, President Trump’s statement yesterday, I think is right on target.",
    "author": "Alan Ryland",
    "title": "Jim Jordan Says Trump’s Call for Clinton Campaign Executions is “Right on Target”"
  },
  {
    "id": 1570,
    "mediaId": 2627,
    "date": "2022-02-14",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, seemed to agree Sunday with a statement from former President Donald Trump that suggested some of Hillary Clinton's associates deserve to be executed.",
    "author": "Ja'han Jones",
    "title": "Rep. Jim Jordan seems to back Trump's comment about executing Clinton aides"
  },
  {
    "id": 975,
    "mediaId": 2590,
    "date": "2022-02-14",
    "sentence": "Donald Trump is calling for the execution of some who worked on Hillary Clinton’s 2016 presidential campaign - and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) seems to be on board.",
    "author": "",
    "title": "Jim Jordan Appears To Embrace Trump's Call To Execute Hillary Clinton Campaign Aides"
  },
  {
    "id": 985,
    "mediaId": 2641,
    "date": "2022-02-14",
    "sentence": "According to the New York Post, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, speaking on Durham's investigation, found credibility in the probe's assertion of spying.",
    "author": "Nick Koutsobinas",
    "title": "Nunes to Newsmax: Durham Probe Will Bring 'More' Indictments Against Clinton Campaign"
  },
  {
    "id": 997,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Rob Crilly",
    "title": "'I can't speak to that': Biden's Deputy Press Secretary Karine Jean-Pierre tells reporter THREE times to go to the DOJ when pressed on Durham's bombshell allegations Hillary spied on Trump when he was president and Biden knew about it"
  },
  {
    "id": 979,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "https://t.co/gGZwcIiczZ\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 13, 2022\nSenator Marsha Blackburn of Tennessee accused Sullivan of a ‘conflict of interest’ in his current efforts trying to de-escalate with Moscow.",
    "author": "Joe Hoft",
    "title": "Republican Leaders Jim Jordan and Marsha Blackburn Raise Concerns with Jake Sullivan as Biden’s National Security Advisor"
  },
  {
    "id": 1160,
    "mediaId": 2580,
    "date": "2022-02-15",
    "sentence": "In addition, reparations should be paid to those in our country who have been damaged by this.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) told Fox News the federal filing proves Trump’s claim that he was being spied on – a claim that “60 Minutes” journalist Lesley Stahl pooh-poohed during an interview in October 2020.",
    "author": "Jody Brown",
    "title": "Hillary’s campaign paid for high-tech spying on Trump – even after the election, says Durham"
  },
  {
    "id": 1015,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Laura Collins & Elizabeth Elkind &",
    "title": "Exclusive: Clinton cornered: Hillary refuses to answer questions about Durham revelation she paid to spy on the Trump campaign as she arrives at daughter Chelsea's Manhattan home ahead of the New York Democratic Convention"
  },
  {
    "id": 1078,
    "mediaId": 2701,
    "date": "2022-02-15",
    "sentence": "Trump seized upon the Special Counsel’s filing” to call the scandal “far greater in scope and magnitude than Watergate.” Rep. <span class='selected-term'>Jim Jordan</span> soon “endorsed Mr. Trump’s position,” Sussmann also complained.",
    "author": "Margot Cleveland",
    "title": "What We Learned From Michael Sussmann’s Response To The Spygate Special Counsel"
  },
  {
    "id": 1485,
    "mediaId": 2551,
    "date": "2022-02-15",
    "sentence": "When <span class='selected-term'>Jim Jordan</span> [U.S. Rep for Ohio-R] and myself said that they were spying on his campaign, we were ridiculed.",
    "author": "Katelyn Caralle",
    "title": "Ex-Director of National Intelligence says Hillary tried to 'frame' Trump with a 'false Russian collusion' narrative"
  },
  {
    "id": 1634,
    "mediaId": 2573,
    "date": "2022-02-15",
    "sentence": "And the Huffington Post's only coverage was an article focused on comments made by Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, reacting to the developments.",
    "author": "",
    "title": "Durham probe: Media outlets avoid, downplay latest developments implicating Clinton campaign"
  },
  {
    "id": 1453,
    "mediaId": 2600,
    "date": "2022-02-15",
    "sentence": "“Her husband has been #metooed and has been fingered to be on Epstein’s island and you know the Foundation, that’s just like a washed up money laundering operation.”\nWatters offered up a little speculation based on Durham’s recent filings… KEEP READING»>\nRepresentative <span class='selected-term'>Jim Jordan</span> of Ohio said that Donald Trump was ‘right on target’ when he suggested Hillary Clinton’s operatives should be executed after she was accused of treason by the former president.",
    "author": "IWB",
    "title": "‘SHE SHOULD BE BANISHED FROM POLITE SOCIETY’"
  },
  {
    "id": 883,
    "mediaId": 2572,
    "date": "2022-02-15",
    "sentence": "House Minority Leader Kevin McCarthy, R-Calif., left, is joined by his picks for the Jan. 6 Select Committee after House Speaker Nancy Pelosi rejected two Republicans, Rep. Jim Banks, R-Ind., center, and Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, right, for the committee investigating the Jan. 6 Capitol insurrection, at the Capitol in Washington, Wednesday, July 21, 2021.",
    "author": "",
    "title": "Republicans 'concerned' by Durham allegations, McCarthy pledges oversight with potential House majority"
  },
  {
    "id": 14545,
    "mediaId": 2644,
    "date": "2022-02-15",
    "sentence": "On Sunday, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), the top Republican on the House Judiciary Committee, said the latest filing proves Trump’s claim that “there was spying going on.”\n“It was worse than we thought because they were spying on the sitting ?president of the United States,” Jordan told “Fox & Friends.” “And it goes right to the Clinton campaign.",
    "author": "Callie Patteson",
    "title": "McCarthy says GOP will probe John Durham findings if it wins back House"
  },
  {
    "id": 895,
    "mediaId": 2573,
    "date": "2022-02-16",
    "sentence": "When <span class='selected-term'>Jim Jordan</span> and myself said that they were spying on his campaign, we were ridiculed.",
    "author": "",
    "title": "'Hannity' on Durham findings, Canadian truckers"
  },
  {
    "id": 1411,
    "mediaId": 2748,
    "date": "2022-02-16",
    "sentence": "He now works in the Biden White House,' Rep. <span class='selected-term'>Jim Jordan</span> of Ohio wrote on Twitter Monday.",
    "author": "Laura Collins",
    "title": "Hillary IGNORES question about Durham claims she spied on Trump as she arrives at Chelsea's home"
  },
  {
    "id": 1087,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Mark Sumner",
    "title": "The Republican platform for 2022"
  },
  {
    "id": 1265,
    "mediaId": 2642,
    "date": "2022-02-16",
    "sentence": "Promoted Content\n<span class='selected-term'>Jim Jordan</span> has certainly read through many damning documents, so there’s definitely a lot to be said when he’s actually shaken up over something.",
    "author": "Sophie O’Hara",
    "title": "[VIDEO] Jim Jordan Visibly Shaken Over Durham Allegations “Worse Than We Thought”"
  },
  {
    "id": 963,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "\"Clinton's cronies asked researchers to search internet data to establish an 'inference' and 'narrative' to tie President Trump to Russia,\" <span class='selected-term'>Jim Jordan</span>, R-Ohio, tweeted Wednesday night.",
    "author": "Eric Mack",
    "title": "Hillary Finally Reacts to Durham Probe Spying Reports: 'Nonsense'"
  },
  {
    "id": 1614,
    "mediaId": 8484,
    "date": "2022-02-17",
    "sentence": "He now works in the Biden White House,' Rep. <span class='selected-term'>Jim Jordan</span> of Ohio wrote on Twitter Monday.",
    "author": "Katelyn Caralle",
    "title": "Clinton's indicted campaign lawyer Michael Sussmann files motion to DISMISS charges in the Durham probe: Claims it was an overreach to accuse him of lying to a federal agent as Hillary spying claims"
  },
  {
    "id": 1594,
    "mediaId": 2547,
    "date": "2022-02-18",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> hurried to agree that the death penalty was completely appropriate for this crime of … of … they’d figure that out later.",
    "author": "Mark Sumner",
    "title": "John Durham Flip Flops On Friday - Go Figure"
  },
  {
    "id": 988,
    "mediaId": 2550,
    "date": "2022-02-18",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> hurried to agree that the death penalty was completely appropriate for this crime of … of … they’d figure that out later.",
    "author": "Mark Sumner",
    "title": "John Durham issues court filing to disown the Fox News fake conspiracy that he started"
  },
  {
    "id": 1781,
    "mediaId": 2551,
    "date": "2022-02-18",
    "sentence": "He now works in the Biden White House,' Rep. <span class='selected-term'>Jim Jordan</span> of Ohio wrote on Twitter Monday.",
    "author": "Katelyn Caralle",
    "title": "Special Counsel John Durham says he wasn't trying to 'politicize' or 'inflame media coverage' in his case against indicted Clinton attorney with filing that led to Hillary spying claims"
  },
  {
    "id": 642,
    "mediaId": 2540,
    "date": "2022-02-20",
    "sentence": "For example, GOP Rep. <span class='selected-term'>Jim Jordan</span> appeared on Fox News last week to declare that Clinton's (non-existent) spying on Trump was \"worse than we thought.\"",
    "author": "Dean Obeidallah",
    "title": "'Hillary Clinton Derangement Syndrome' is worse than ever"
  },
  {
    "id": 123,
    "mediaId": 2641,
    "date": "2022-02-20",
    "sentence": "The latest revelations from court filings by special counsel John Durham have exposed how lawyers and a White House internet contractor have effectively laundered information to \"create an inference and a narrative\" to \"frame\" former President Donald Trump, according to Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Eric Mack",
    "title": "Rep. Jim Jordan: Durham Exposed 'Concerted Effort to Try to Frame' Trump"
  },
  {
    "id": 53,
    "mediaId": 2664,
    "date": "2022-02-21",
    "sentence": "",
    "author": "Bob Brigham",
    "title": "John Durham's admission Republicans are ‘out of their minds’ means he must shut down ‘sham’ investigation: analysis"
  },
  {
    "id": 59,
    "mediaId": 2573,
    "date": "2022-02-21",
    "sentence": "We heard from Congressman <span class='selected-term'>Jim Jordan</span> on Twitter today, who wrote: \"It's not a vast right-wing conspiracy.",
    "author": "",
    "title": "'Your World' on Russia-Ukraine, Hillary Clinton in New York"
  },
  {
    "id": 24,
    "mediaId": 2564,
    "date": "2022-02-25",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, added on Twitter.",
    "author": "Morgan Phillips",
    "title": "Republican Senator Ben Sasse tears into 'evil' Putin and tells Biden to sanction 'lifestyles of the rich and famous a**hole mobsters and oligarchs' who enable the Russian leader's 'madness'"
  },
  {
    "id": 10942,
    "mediaId": 2578,
    "date": "2022-03-08",
    "sentence": "I was concerned that vocal proponents who exposed voter fraud like Matt Gaetz, <span class='selected-term'>Jim Jordan</span>, Ted Cruz, Paul Gosar, Andy Biggs, Louie Gohmert, Mo Brooks, Bernard Kerik and I would later be targeted.",
    "author": "Joe Hoft",
    "title": "EXCLUSIVE: Roger Stone Strikes Back at Washington Post Attack – Calls out Deep Fake Video"
  },
  {
    "id": 11337,
    "mediaId": 2748,
    "date": "2022-03-09",
    "sentence": "I was concerned that vocal proponents who exposed voter fraud like Matt Gaetz, <span class='selected-term'>Jim Jordan</span>, Ted Cruz, Paul Gosar, Andy Biggs, Louie Gohmert, Mo Brooks, Bernard Kerik and I would later be targeted.",
    "author": "STATION GOSSIP",
    "title": "EXCLUSIVE: Roger Stone Strikes Back at Washington Post Attack – Calls out Deep Fake Video"
  },
  {
    "id": 10953,
    "mediaId": 2614,
    "date": "2022-03-18",
    "sentence": "Fauci is probably responding to House republicans like Texas REP Chip Roy or Ohio REP <span class='selected-term'>Jim Jordan</span> who have made comments that they’ll be coming after him.",
    "author": "SteveGruber.com",
    "title": "Fauci Running Scared"
  },
  {
    "id": 7877,
    "mediaId": 2548,
    "date": "2022-04-03",
    "sentence": "(RELATED: ‘The News Was Fake’: Rep. <span class='selected-term'>Jim Jordan</span> Takes Shots At The Media For Disavowing Hunter Biden’s Laptop)\nA grand jury in Delaware is in the midst of investigating possible tax violations, money laundering and foreign lobbying.",
    "author": "Nicole Silverio",
    "title": "‘Had It Wrong’: Chris Christie Calls Out The New York Times And Washington Post Over Misreporting Hunter Biden’s Laptop"
  },
  {
    "id": 6057,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> said on Sunday it \"sure seems\" the president's son is on his way to being indicted, though the congressman acknowledged he could not say for certain.",
    "author": "Daniel Chaitin",
    "title": "'Something is up': Jim Jordan spots major shift in Hunter Biden story"
  }
]