[
  {
    "id": 13350,
    "mediaId": 2771,
    "date": "2022-03-03",
    "sentence": "One of the endorsees, <span class='selected-term'>Jim Jordan</span> of Ohio, was so prominent in the events surrounding the Jan. 6 insurrection, which led to deadly violence, that he has been invited to testify before the congressional committee investigating the event.",
    "author": "Ron Kampeas",
    "title": "Fast ForwardAIPAC’s PAC endorses dozens of Republicans who refused to certify Joe Biden as president"
  },
  {
    "id": 12726,
    "mediaId": 2727,
    "date": "2022-03-06",
    "sentence": "One of the endorsees, <span class='selected-term'>Jim Jordan</span> of Ohio, was so prominent in the events surrounding the January 6 insurrection, which led to deadly violence, that he has been invited to testify before the congressional committee investigating the event.",
    "author": "JTA and TOI staff",
    "title": "AIPAC slammed for endorsing Republicans who refused to certify Biden’s election"
  },
  {
    "id": 11157,
    "mediaId": 2602,
    "date": "2022-03-09",
    "sentence": "The New York Times has reported that he was said he was like KKK leader David Duke “without the baggage.”\nAIPAC’s most outrageous endorsement may be Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, who has refused to testify before the January 6 investigating committee and joined failed lawsuits to block certification of Biden’s election.",
    "author": "DOUGLAS BLOOMFIELD",
    "title": "AIPAC and some controversial endorsements - opinion"
  },
  {
    "id": 11410,
    "mediaId": 2699,
    "date": "2022-03-11",
    "sentence": "Among the AIPAC chosen are Ohio Rep. <span class='selected-term'>Jim Jordan</span> (who trashed the Jan. 6 committee), Texas Rep. Ronny Jackson (the former White House physician who says Trump won the 2020 election), and Pennsylvania Rep. Scott Perry (who compared Democrats to Nazis).",
    "author": "Eleanor Clift",
    "title": "AIPAC Is All In on Support for ‘Stop the Steal’ Candidates"
  },
  {
    "id": 11439,
    "mediaId": 2771,
    "date": "2022-03-18",
    "sentence": "That’s why I cannot stand idly by when an organization that claims to speak for me — and claims to support American and Israeli democracy — endorses candidates such as <span class='selected-term'>Jim Jordan</span> of Ohio who have excused and justified insurrection.",
    "author": "Nathan Wolfson",
    "title": "AIPAC’s far-right endorsements show how out of touch they are with American Jews"
  },
  {
    "id": 9420,
    "mediaId": 2618,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Lahav Harkov",
    "title": "US offering $1 million to report on Israeli human rights violations"
  },
  {
    "id": 9126,
    "mediaId": 2512,
    "date": "2022-03-23",
    "sentence": "“Earlier this month, the Committee released a list of 120 political endorsements that includes 37 Republicans who voted against certifying (President Joe) Biden’s victory after the January 6 storming of the Capitol.”\nMcGreal adds, “Among them are two members of Congress, <span class='selected-term'>Jim Jordan</span> and Scott Perry, who plotted with Trump’s White House to overturn the election result.",
    "author": "Alex Henderson",
    "title": "‘Morally bankrupt’ AIPAC slammed for endorsing GOP seditionists who refused to accept 2020 election results"
  },
  {
    "id": 7944,
    "mediaId": 2602,
    "date": "2022-03-31",
    "sentence": "Present at the talk were Senator Mike Lee (R-UT) and Congressmen <span class='selected-term'>Jim Jordan</span> (R-OH), Louis Gohmert (R-TX), Andy Harris (Maryland), Andy Barr (R-KY), Doug Lamborn (R-CO), Bill Johnson (R-OH), Barry Moore (R-AL) and Russ Fulcher (R-ID).",
    "author": "JERUSALEM POST STAFF",
    "title": "Netanyahu tells Congressmen that the Iran Deal is bad for the US"
  },
  {
    "id": 9531,
    "mediaId": 2727,
    "date": "2022-03-31",
    "sentence": "I will call out people like Rep. <span class='selected-term'>Jim Jordan</span> and Matt Gaetz and the like for their dangerous libel and the manipulative manner that they are subverting the democracy they are sworn to uphold.",
    "author": "",
    "title": "I’m sticking with AIPAC. You should too!"
  },
  {
    "id": 7464,
    "mediaId": 2562,
    "date": "2022-03-31",
    "sentence": "On Tuesday, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, hailed Burkov's initial capture as a major coup for U.S. law officials.",
    "author": "NationalWatch",
    "title": "Russian Hacker’s Mysterious Status Raises Concerns of US Cyberattack"
  },
  {
    "id": 7263,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "On Tuesday, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, hailed Burkov's initial capture as a major coup for U.S. law officials.",
    "author": "Jason Clemons",
    "title": "Russian Hacker's Mysterious Status Raises Concerns of US Cyberattack"
  }
]