[
  {
    "id": 4471,
    "mediaId": 2658,
    "date": "2022-01-03",
    "sentence": "And House Minority Leader Kevin McCarthy and Judiciary Committee ranking member <span class='selected-term'>Jim Jordan</span> (R-Ohio) have expressed objections to many of the antitrust proposals, casting doubts on the future of these efforts if the GOP takes over the House next year.",
    "author": "",
    "title": "2022 kicks off with tech nomination do-overs"
  },
  {
    "id": 4464,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "QUICK LINKS\nRep. <span class='selected-term'>Jim Jordan</span> says he won’t cooperate with Jan. 6 committee’s interview request, from Nicholas and Kyle\nTRANSITIONS\nOmair Mirza is joining J.P. Morgan Chase as VP of federal government relations.",
    "author": "",
    "title": "Dems eye voting rights fight, filibuster changes"
  },
  {
    "id": 4526,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "Now, they say, it is time for Mr. Biden to focus not only on his own achievements, but also on how the Republican Party threatens to reverse those efforts if it returns to power on Capitol Hill — something that has not been at the center of his presidency so far.”\nJAN. 6 AND ITS AFTERMATH\nJORDAN SNUBS JAN. 6 PANEL — Rep. <span class='selected-term'>JIM JORDAN</span> (R-Ohio) is refusing the Jan. 6 committee’s request for an interview, calling the ask an “unprecedented and inappropriate demand.”\nIn a letter to Chair BENNIE THOMPSON (D-Miss.)",
    "author": "",
    "title": "POLITICO Playbook: Biden faces his moment on the filibuster"
  },
  {
    "id": 4576,
    "mediaId": 2590,
    "date": "2022-01-12",
    "sentence": "“For example, in advance of January 6th, you reportedly explained to Mark Meadows and the former President that objections to the certification of the electoral votes on January 6th ‘was doomed to fail.’”\nAdvertisement\nIn his five-page letter to the California Republican, Thompson said he would like him to appear before the committee in the first week of February, and noted that McCarthy has said he “wouldn’t hide from anything.”\nThe committee previously asked Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), a Trump ally, to appear before the committee, but Jordan rejected that request.",
    "author": "",
    "title": "Jan. 6 Committee Asks House GOP Leader Kevin McCarthy To Testify"
  },
  {
    "id": 4511,
    "mediaId": 2614,
    "date": "2022-01-15",
    "sentence": "",
    "author": "Red Voice Media",
    "title": "Joe Biden Impersonator Draws More Attention Than The ‘Real’ Version [VIDEO]"
  },
  {
    "id": 4577,
    "mediaId": 2614,
    "date": "2022-01-15",
    "sentence": "",
    "author": "Red Voice Media",
    "title": "Conservative Pundit Suspended By YouTube Doubles Down, Dares Them In Based Email Response"
  },
  {
    "id": 3680,
    "mediaId": 2614,
    "date": "2022-01-16",
    "sentence": "",
    "author": "Red Voice Media",
    "title": "Biden Gets Wrecked In 11 Seconds On CNN Of All Places, His 2022 Is Off To That Bad Of A Start [VIDEO]"
  },
  {
    "id": 3857,
    "mediaId": 2614,
    "date": "2022-01-16",
    "sentence": "",
    "author": "Red Voice Media",
    "title": "Navy Seal Who Killed Bin Laden Posts 6 Images That Completely Destroy Dems January 6 Narrative"
  },
  {
    "id": 3641,
    "mediaId": 2742,
    "date": "2022-01-18",
    "sentence": "",
    "author": "",
    "title": "GOP Finally Focusing On Dems’ Drive To Weaponize Big Tech Against America"
  },
  {
    "id": 3936,
    "mediaId": 6534,
    "date": "2022-01-19",
    "sentence": "House Minority Leader Kevin McCarthy, R-Calif., and GOP Reps. Scott Perry of Pennsylvania and <span class='selected-term'>Jim Jordan</span> of Ohio have denied the committee’s requests for voluntary cooperation.",
    "author": "",
    "title": "Jan. 6 Committee Requests Interview With Ivanka Trump"
  },
  {
    "id": 4250,
    "mediaId": 6509,
    "date": "2022-01-19",
    "sentence": "House Minority Leader Kevin McCarthy, R-Calif., and GOP Reps. Scott Perry of Pennsylvania and <span class='selected-term'>Jim Jordan</span> of Ohio have denied the committee’s requests for voluntary cooperation.",
    "author": "",
    "title": "Jan. 6 Committee Requests Interview With Ivanka Trump"
  },
  {
    "id": 4207,
    "mediaId": 2526,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them; they were fantastic.",
    "author": "Hannah Bleau",
    "title": "Exclusive — Ron DeSantis’s Office Debunks Rumors of Infighting with Trump: ‘Fabricated’ Narrative to Distract from Biden’s Failures"
  },
  {
    "id": 3625,
    "mediaId": 2658,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them.”\nWhen he served in Congress, DeSantis was one of Trump’s staunchest defenders on Fox News as former Special Counsel Robert Mueller investigated alleged Russian interference in the 2016 election.",
    "author": "",
    "title": "Trump calls feud with DeSantis ‘fake news’"
  },
  {
    "id": 4389,
    "mediaId": 2553,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic.",
    "author": "Ryan Saavedra",
    "title": "Trump Makes Statement Over Reports That He Has A Problem With Governor Ron DeSantis"
  },
  {
    "id": 4102,
    "mediaId": 2605,
    "date": "2022-01-22",
    "sentence": "Before One America News Network host Dan Ball finished an interview with guest <span class='selected-term'>Jim Jordan</span> this past week, he asked the Ohio Republican congressman for a favor.",
    "author": "Stephen BattaglioStaff Writer",
    "title": "Why pay TV operators are dropping Trump-loving cable networks"
  },
  {
    "id": 3678,
    "mediaId": 2553,
    "date": "2022-01-24",
    "sentence": "McCarthy objected to Republicans being involved in the committee after Pelosi rejected two of his recommended House members from participating on the committee: Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Indiana Rep. Jim Banks.",
    "author": "Dillon Burroughs",
    "title": "Liz Cheney Destroyed In Wyoming GOP Straw Poll By Trump-Backed Candidate"
  },
  {
    "id": 3861,
    "mediaId": 2748,
    "date": "2022-01-24",
    "sentence": "",
    "author": "",
    "title": "Must See: Tucker SLAMS Kamala's Illegitimate Election Claims"
  },
  {
    "id": 3932,
    "mediaId": 2688,
    "date": "2022-01-25",
    "sentence": "In the wake of the announcement, DeSantis put out a rather misleading tweet, claiming the Biden administration made the decision “without a shred of clinical data.”\nTrumpy lap-dog Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) retweeted it.",
    "author": "John Judis",
    "title": "Where Things Stand: FDA Halting Use Of Some Monoclonal Antibodies Treatments Bursts GOP’s Anti-Vax Bubble"
  },
  {
    "id": 3616,
    "mediaId": 2724,
    "date": "2022-01-25",
    "sentence": "Fauci’s home office features photos of himself, his own bobblehead https://t.co/o7PqEYeFXt pic.twitter.com/y2LDGyJVUd\nRepresentative <span class='selected-term'>Jim Jordan</span> (OH) recently warned that Republicans will “definitely” investigate Dr. Fauci should the GOP win back the House in 2022.",
    "author": "Rusty Weiss",
    "title": "New Poll Shows Majority Of Independents Want Fauci To Resign"
  },
  {
    "id": 4272,
    "mediaId": 2553,
    "date": "2022-01-25",
    "sentence": "https://t.co/hP55vngVbh\n— Cernovich (@Cernovich) January 25, 2022\n“Unconscionable,” reacted Republican Rep. <span class='selected-term'>Jim Jordan</span> (OH).",
    "author": "Amanda Prestigiacomo",
    "title": "‘Kill People To Harm Republicans’: Social Media Clobbers Biden Admin After FDA Blocks Antibody Treatment"
  },
  {
    "id": 3558,
    "mediaId": 2658,
    "date": "2022-01-26",
    "sentence": "), <span class='selected-term'>Jim Jordan</span> (R-Ohio), Barry Loudermilk (R-Ga.), Troy Nehls (R-Texas), and Bryan Steil (R-Wisc.).",
    "author": "",
    "title": "Democrats lean on that other rules change"
  },
  {
    "id": 3580,
    "mediaId": 2658,
    "date": "2022-01-26",
    "sentence": "The plant is outside Turner’s Dayton-based congressional district, instead belonging to Republican <span class='selected-term'>Jim Jordan</span>‘s district.",
    "author": "",
    "title": "Lawmakers' answer to the Russia-Ukraine crisis: Weapons made in their states"
  },
  {
    "id": 3700,
    "mediaId": 2724,
    "date": "2022-01-27",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them.”\nFurther, Trump has blamed talk of a feud on Mitch McConnell and his allies.",
    "author": "John Hanson",
    "title": "DeSantis Blames ‘Corporate Media’ For Trying To ‘Manufacture’ Feud Between Him And Trump"
  },
  {
    "id": 3495,
    "mediaId": 2748,
    "date": "2022-01-28",
    "sentence": "#ReleaseTheTranscript\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 28, 2022\nThe White House released the following statement on the call:\n“President Joseph R. Biden, Jr. spoke today with President Volodymyr Zelenskyy of Ukraine.",
    "author": "",
    "title": "‘RELEASE THE TRANSCRIPT’: GOP Demands Biden-Zelensky Call Transcript, 'Joe Asked Trump to Do It!'"
  },
  {
    "id": 3196,
    "mediaId": 6621,
    "date": "2022-01-28",
    "sentence": "#ReleaseTheTranscript\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 28, 2022\nThe White House released the following statement on the call:\n“President Joseph R. Biden, Jr. spoke today with President Volodymyr Zelenskyy of Ukraine.",
    "author": "",
    "title": "‘RELEASE THE TRANSCRIPT’: GOP Demands Biden-Zelensky Call Transcript, 'Joe Asked Trump to Do It!'"
  },
  {
    "id": 3138,
    "mediaId": 2547,
    "date": "2022-01-28",
    "sentence": "It had support from lawmakers like Rep. Mo Brooks of Alabama, Matt Gaetz of Florida, Scott Perry of Pennsylvania, and <span class='selected-term'>Jim Jordan</span> of Ohio, just to name a few.",
    "author": "Brandi Buchman",
    "title": "Jan. 6 Committee Slams Trump's Fake 'Electors' With Raft Of Subpoenas"
  },
  {
    "id": 3233,
    "mediaId": 2550,
    "date": "2022-01-28",
    "sentence": "It had support from lawmakers like Rep. Mo Brooks of Alabama, Matt Gaetz of Florida, Scott Perry of Pennsylvania, and <span class='selected-term'>Jim Jordan</span> of Ohio, just to name a few.",
    "author": "",
    "title": "Jan. 6 committee hits Trump's 'alternate electors' with raft of subpoenas"
  },
  {
    "id": 2764,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "The committee has also sought testimony from Republican members of Congress, including House Minority Leader Kevin McCarthy and Ohio GOP Rep. <span class='selected-term'>Jim Jordan</span>, but so far it has yet to issue subpoenas to compel testimony from the lawmakers.",
    "author": "Gloria Borger",
    "title": "Exclusive: Trump WH spokesman is sent subpoena by January 6 committee"
  },
  {
    "id": 3254,
    "mediaId": 2528,
    "date": "2022-01-30",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, an Ohio Republican and Trump ally, also recently listed a slew of investigations he would launch into the Biden administration if Republicans take control of the House and he becomes chair of the House Judiciary Committee.",
    "author": "Alia Shoaib",
    "title": "Trump vows the GOP will investigate 'Biden corruption' if they retake Congress in the midterm elections"
  },
  {
    "id": 3029,
    "mediaId": 2636,
    "date": "2022-01-31",
    "sentence": "",
    "author": "Luke Broadwater",
    "title": "Former Pence Chief of Staff Has Testified to the Jan. 6 Committee"
  },
  {
    "id": 3072,
    "mediaId": 2748,
    "date": "2022-02-01",
    "sentence": "Monday on FNC’s “The Ingraham Angle,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) condemned the Biden administration’s use of government power to infringe on the exercise of First and Second Amendment rights.",
    "author": "Women System",
    "title": "Jordan: ‘Scary Stuff’ What the Biden Administration Has Done with First Amendment Rights, Second Amendment Liberties"
  },
  {
    "id": 3074,
    "mediaId": 2550,
    "date": "2022-02-01",
    "sentence": "One such record was a text from Rep. <span class='selected-term'>Jim Jordan</span> of Ohio to Meadows that advocated for then-Vice President Mike Pence to “call out all electoral votes he believes are unconstitutional as no electoral votes at all.”\nPence did not have that power.",
    "author": "",
    "title": "Court orders Eastman to cough up records on Jan. 6"
  },
  {
    "id": 2698,
    "mediaId": 2573,
    "date": "2022-02-01",
    "sentence": "REP. <span class='selected-term'>JIM JORDAN</span> (R-OH): No, this is frightening.",
    "author": "Fox News Staff",
    "title": "'The Ingraham Angle' on Biden's handling of Russia-Ukraine tensions"
  },
  {
    "id": 2803,
    "mediaId": 2618,
    "date": "2022-02-01",
    "sentence": "Monday on FNC’s “The Ingraham Angle,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) condemned the Biden administration’s use of government power to infringe on the exercise of First and Second Amendment rights.",
    "author": "Jeff Poor",
    "title": "Jordan: ‘Scary Stuff’ What the Biden Administration Has Done with First Amendment Rights, Second Amendment Liberties"
  },
  {
    "id": 3321,
    "mediaId": 8322,
    "date": "2022-02-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, joined \"The Ingraham Angle\" on Monday to discuss what he believes are unprecedented moves from the Biden administration against law-abiding Americans.",
    "author": "Fox News Staff",
    "title": "Rep. Jim Jordan: Second Amendment under attack by Biden administration"
  },
  {
    "id": 3220,
    "mediaId": 2746,
    "date": "2022-02-02",
    "sentence": "Among those many guests also set to appear in the four-day event: Reps. Lauren Boebert, Madison Cawthorn, Matt Gaetz, <span class='selected-term'>Jim Jordan</span>, Ronny Jackson, Barry Loudermilk and Roger Williams; Sen. Marsha Blackburn; Florida Gov.",
    "author": "Jennifer Harper",
    "title": "Trump’s advice to CPAC: ‘Let’s have fun’"
  },
  {
    "id": 3203,
    "mediaId": 2748,
    "date": "2022-02-02",
    "sentence": "",
    "author": "bigprick",
    "title": "MORE THAN 100 CONSTITUENTS OPEN INVESTIGATIONS INTO 2020 ELECTION FRAUD"
  },
  {
    "id": 3096,
    "mediaId": 2557,
    "date": "2022-02-02",
    "sentence": "pic.twitter.com/J7E6wBRI8l\n— Rep Andy Biggs (@RepAndyBiggsAZ) November 19, 2019\nRep. <span class='selected-term'>Jim Jordan</span>: “You talked to the one guy Adam Schiff won’t let you tell us how he is — is that right?”\nVindman: “Rep.",
    "author": "DML News App",
    "title": "REPORT: Whistleblower who kicked-off first impeachment sues Trump Jr. for ‘intimidation’"
  },
  {
    "id": 2838,
    "mediaId": 2644,
    "date": "2022-02-02",
    "sentence": "“Because in impeachment proceedings, the American public has the right to know all the evidence.”\nUS Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) also called it “frightening” to learn that Trump “wasn’t allowed to have information that he’s entitled to have to put on his defense.”\nA State Department spokesperson said, “We do not comment on matters under litigation.”",
    "author": "Bruce Golding",
    "title": "Classified 2016 email shows US diplomat warning of Hunter Biden deals in Ukraine"
  },
  {
    "id": 2754,
    "mediaId": 2643,
    "date": "2022-02-03",
    "sentence": "Furthermore, other names—such as staunchly pro-Trump GOP Representative <span class='selected-term'>Jim Jordan</span> of Ohio—have been floated for the top post in the legislative body.",
    "author": "Jason Lemon",
    "title": "Trump, Kevin McCarthy Have Equal Support to Be Next House Speaker: Poll"
  },
  {
    "id": 2635,
    "mediaId": 2523,
    "date": "2022-02-04",
    "sentence": "",
    "author": "The Associated Press",
    "title": "Pence: ‘Trump is wrong. I had no right to overturn the election’"
  },
  {
    "id": 2620,
    "mediaId": 2664,
    "date": "2022-02-04",
    "sentence": "The House committee investigating the Capitol riot has obtained evidence showing new details about then-President Donald Trump's phone call to Ohio GOP Rep. <span class='selected-term'>Jim Jordan</span> on Jan. 6, 2021.",
    "author": "Sky Palma",
    "title": "New evidence shows Trump and Jim Jordan had lengthy phone conversation on Jan. 6"
  },
  {
    "id": 2322,
    "mediaId": 2621,
    "date": "2022-02-04",
    "sentence": "“I mean I’ve talked the president so many, I can’t remember all the days I have talked to him, but I have certainly talked to the president.”\nIn a long rambling answer, <span class='selected-term'>Jim Jordan</span> admits he talked to Trump on January 6th.",
    "author": "Alex Griffing",
    "title": "CNN Confirms Jim Jordan Spoke With Trump Morning of Jan. 6 – A Fact Jordan Has Just Not Been Able to Remember"
  },
  {
    "id": 2323,
    "mediaId": 2748,
    "date": "2022-02-04",
    "sentence": "On Tuesday, Republican Rep. <span class='selected-term'>Jim Jordan</span> of Ohio appeared on Just the News’ self-titled news show and mounted a strong defense of Trump throughout the first impeachment.",
    "author": "STATION GOSSIP",
    "title": "Email Hidden for 5 Years Declared Hunter Biden 'Undercut' US Efforts to Fight Ukraine Corruption - Report"
  },
  {
    "id": 1947,
    "mediaId": 2643,
    "date": "2022-02-04",
    "sentence": "Republican Ohio Representative <span class='selected-term'>Jim Jordan</span> talked with President Donald Trump on the phone during the morning of January 6, 2021, during the Capitol riots, according to CNN.",
    "author": "Daniel Villarreal",
    "title": "Jim Jordan Spoke With Trump in 10-Minute Phone Call on 1/6, Records Show"
  },
  {
    "id": 1822,
    "mediaId": 2643,
    "date": "2022-02-05",
    "sentence": "Representative Jim McGovern, a Massachusetts Democrat, has suggested that Representative <span class='selected-term'>Jim Jordan</span>, an Ohio Republican, may be \"trying to hide\" something after a report this week revealed phone records show that the GOP congressman spoke with former President Donald Trump for about 10 minutes on the morning of January 6, 2021.",
    "author": "Jason Lemon",
    "title": "Jim Jordan 'Trying to Hide' Something on 1/6 Trump Call, Suggests McGovern"
  },
  {
    "id": 2175,
    "mediaId": 2550,
    "date": "2022-02-05",
    "sentence": "x\nNEWS: The Jan. 6 committee is now in possession of White House records that show Trump spoke via phone with GOP Rep. <span class='selected-term'>Jim Jordan</span> for 10 minutes on the morning of the US Capitol riot.",
    "author": "",
    "title": "Abbreviated Pundit Roundup: Biden's mostly, pretty much, not bad at all good week"
  },
  {
    "id": 2529,
    "mediaId": 2629,
    "date": "2022-02-05",
    "sentence": "Records that former President Donald Trump attempted to hide from public scrutiny have now revealed that he spoke on the phone with Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) on Jan. 6, 2021.",
    "author": "Oliver Willis",
    "title": "Records Trump Tried To Hide Reveal Call To Jim Jordan Before Capitol Attack"
  },
  {
    "id": 2641,
    "mediaId": 2526,
    "date": "2022-02-05",
    "sentence": "For the 2022 midterms, nearly 100 Republican lawmakers have accepted donations from the Koch Industries PAC, including Reps. Liz Cheney (R-WY), Jeff Duncan (R-SC), Don Bacon (R-NE), Tony Gonzalez (R-TX), Adam Kinzinger (R-IL), Ashley Hinson (R-IA), Julia Letlow (R-LA), Jackie Walorski (R-IN), Garret Graves (R-LA), Jim Banks (R-IN), Byron Donalds (R-FL), Yvette Herrell (R-NM), and <span class='selected-term'>Jim Jordan</span> (R-OH), among others.",
    "author": "John Binder",
    "title": "Axios: Breitbart News Readers, Trump’s Small-Dollar Donors Steer ‘Modern’ GOP as Corporate Class Fades"
  },
  {
    "id": 2331,
    "mediaId": 2664,
    "date": "2022-02-06",
    "sentence": "Speaking to the Fox network on Sunday, Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) revealed that the Republican Party campaign strategy for the 2022 midterms will be all about former President Donald Trump.",
    "author": "Sarah K. Burris",
    "title": "Jim Jordan: The GOP's ultimate goal in taking back Congress is to 'frame up' a win for Trump in 2024"
  },
  {
    "id": 1843,
    "mediaId": 2578,
    "date": "2022-02-06",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 1, 2022\nA federal firearm registry is explicitly banned by law.",
    "author": "Mike LaChance",
    "title": "Democrats Are Quietly Building A Gun Registry As A First Step In Gun Ban"
  },
  {
    "id": 1915,
    "mediaId": 2641,
    "date": "2022-02-06",
    "sentence": "Democrats have long claimed to be against gerrymandering, but they have no issue with the partisan redrawing of congressional districts when it suits them, according to Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Eric Mack",
    "title": "Rep. Jordan: Redistricting 'Only Gerrymandering' When GOP Does It"
  },
  {
    "id": 1812,
    "mediaId": 2643,
    "date": "2022-02-06",
    "sentence": "Attorney Neal Katyal, who previously served as principal deputy solicitor general and acting solicitor general for the Justice Department, said that former President Donald Trump, Representative <span class='selected-term'>Jim Jordan</span> and Trump allies are utilizing \"bad mob tactics\" in response to the House select committee investigating the January 6, 2021 attack against the U.S. Capitol.",
    "author": "Jason Lemon",
    "title": "Trump, Jordan Using 'Bad Mob Tactics' in Face of 1/6 Probe: Ex-DOJ Official"
  },
  {
    "id": 2019,
    "mediaId": 2621,
    "date": "2022-02-06",
    "sentence": "“In other words, the Democrats are better at being scoundrels than Republicans and Republicans better wake the hell up.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) then said Democrats are frequently hypocritical when it comes to the issue of gerrymandering.",
    "author": "Katherine Huggins",
    "title": "Mark Levin Claims Democrats Are ‘Better at Being Scoundrels’ Than GOP at Gerrymandering: ‘Republicans Better Wake the Hell Up’"
  },
  {
    "id": 2052,
    "mediaId": 6404,
    "date": "2022-02-06",
    "sentence": "",
    "author": "Mike LaChance",
    "title": "Democrats Are Quietly Building A Gun Registry As A First Step In Gun Ban"
  },
  {
    "id": 2101,
    "mediaId": 2808,
    "date": "2022-02-06",
    "sentence": "House Speaker Nancy Pelosi last year vetoed putting Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Rep. Jim Banks, R-Ind., on the panel, so House Minority Leader Kevin McCarthy pulled his three other GOP picks, leaving Pelosi free to tap Kinzinger and Cheney.",
    "author": "",
    "title": "RNC censure of Kinzinger, Cheney could backfire for Illinois Republicans"
  },
  {
    "id": 2081,
    "mediaId": 2636,
    "date": "2022-02-07",
    "sentence": "Another Republican from Ohio, Representative <span class='selected-term'>Jim Jordan</span>, who claims that Dr. Fauci knew the coronavirus “came from a lab,” has vowed that Republicans will investigate him if they win control of the House.",
    "author": "",
    "title": "Republicans, Wooing Trump Voters, Make Fauci Their Boogeyman"
  },
  {
    "id": 2381,
    "mediaId": 2547,
    "date": "2022-02-07",
    "sentence": "",
    "author": "John Amato",
    "title": "Jim Jordan Is An Absurd Hypocrite, Part Infinity"
  },
  {
    "id": 2411,
    "mediaId": 2679,
    "date": "2022-02-07",
    "sentence": "Another Republican from Ohio, Rep. <span class='selected-term'>Jim Jordan</span>, who claims that Fauci knew the coronavirus “came from a lab,” has vowed that Republicans will investigate him if they win control of the House.",
    "author": "SHERYL GAY STOLBERG",
    "title": "Republicans, wooing Trump voters, make Fauci their boogeyman"
  },
  {
    "id": 2617,
    "mediaId": 2522,
    "date": "2022-02-08",
    "sentence": "— Joe Albanese (@jalbanese27) February 7, 2022\nMany on Twitter sounded off on the administration’s stance, including Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Kevin Haggerty",
    "title": "‘Where’s your mask Jen?’ Psaki says WH stands by recommendation that students wear masks in schools"
  },
  {
    "id": 1992,
    "mediaId": 2572,
    "date": "2022-02-09",
    "sentence": "The second issue is what you just mentioned with <span class='selected-term'>Jim Jordan</span>, and that is the apparent double standard here, which is that we have these giant tech giants, and they seem to have one standard for one political persuasion and one for the other.",
    "author": "Fox News Staff",
    "title": "'Special Report All-Star Panel' react to Joe Biden's handling of Ukraine crisis"
  },
  {
    "id": 1995,
    "mediaId": 2625,
    "date": "2022-02-09",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 9, 2022",
    "author": "Matt Reynolds",
    "title": "Fauci Says “Full-Blown” Pandemic Is Almost Over"
  },
  {
    "id": 1951,
    "mediaId": 2592,
    "date": "2022-02-09",
    "sentence": "Meanwhile Americans: pic.twitter.com/8VqnOPnTa7\nRep. Marjorie Taylor Greene (@RepMTG) February 9, 2022\nBiden is sending free meth & crack pipes to minority communities in the name of ‘racial equity’\nThere is no end in sight for this lunacy https://t.co/RLv6cAuLCt pic.twitter.com/WdlzOojkdF\nMarco Rubio (@marcorubio) February 8, 2022\n“Will you have to show your vaccine passport to get your crack pipe?” Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, posted on Twitter.",
    "author": "Maggie Valenti",
    "title": "Biden Enrages Conservatives By Supporting Harm Reduction With Safe Drug Kits"
  },
  {
    "id": 1919,
    "mediaId": 2643,
    "date": "2022-02-09",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio) is attempting to rally the right by repeating a claim that the Biden administration is planning to hand out free \"crack pipes.\"",
    "author": "Aila Slisco",
    "title": "Jim Jordan Rallies the Right by Repeating Government 'Crack Pipe' Fable"
  },
  {
    "id": 2356,
    "mediaId": 2699,
    "date": "2022-02-10",
    "sentence": "Ted Cruz (R-TX) and Marsha Blackburn (R-TN), and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) called for an end to “government-funded crack pipes,” other politicians insisted this was part of Biden’s plans for racial justice.",
    "author": "Justin Baragona",
    "title": "How the White House Caved to Fox News’ Biden ‘Crack Pipe’ Faux-Scandal"
  },
  {
    "id": 2391,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "In a letter sent Thursday to FBI Director Christopher Wray, posted to Twitter, 18 GOP lawmakers, including ranking member Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, said the agency's \"half-page response to our serious concerns about the FBI’s use of counterterrorism resources — as evidence by documents provided to us by a whistleblower — to target concerned parents at local school board meetings.",
    "author": "Jeffrey Rodack",
    "title": "Judiciary Republicans Rip FBI for Withholding Information on School Boards Probe"
  },
  {
    "id": 1690,
    "mediaId": 2634,
    "date": "2022-02-11",
    "sentence": "?As the Select Committee will demonstrate in hearings later this year, no foreign power corrupted America’s voting machines, and no massive secret fraud changed the election outcome.”\nWhat they did this week\nRepresentative <span class='selected-term'>Jim Jordan</span> is still declining the committee’s invitation to sit down and answer questions.",
    "author": "Grace Segers",
    "title": "January 6 Committee Recap: Concerns About Trump’s Records Can’t Be Flushed Away"
  },
  {
    "id": 945,
    "mediaId": 8322,
    "date": "2022-02-11",
    "sentence": "Comer and Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, published portions of emails last month revealing Fauci knew that COVID-19 may have been intentionally modified and leaked from the Wuhan Institute of Virology.",
    "author": "",
    "title": "Rep. Comer accuses Fauci, CCP of covering up COVID origins 'from day one': 'Is he a mad scientist?'"
  },
  {
    "id": 1080,
    "mediaId": 2569,
    "date": "2022-02-11",
    "sentence": "Explicitly named in the minute-long spot are House Minority Leader Kevin McCarthy, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, and Rep. Marjorie Taylor Greene of Georgia.",
    "author": "",
    "title": "Lincoln Project ad goes for gold, skewers Republicans in ‘Coward Olympics’"
  },
  {
    "id": 1788,
    "mediaId": 2614,
    "date": "2022-02-13",
    "sentence": "With the bombshell news that Hillary was purposely trying to spy on then-President Trump, Ohio Representative <span class='selected-term'>Jim Jordan</span> spoke on Fox News about the accusations.",
    "author": "Red Voice Media",
    "title": "Durham Exposed Hillary’s Treason? Trump, Russia Collusion? – ‘Worse Than We Thought’ – Jim Jordan [VIDEO]"
  },
  {
    "id": 1192,
    "mediaId": 8322,
    "date": "2022-02-14",
    "sentence": "",
    "author": "",
    "title": "Biden ATF suggests Americans report current, former partners' 'illegal gun activity' for Valentine’s Day"
  },
  {
    "id": 973,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "Marsha Blackburn, Bill Hagerty, James Lankford and Marco Rubio; and Reps. Andy Biggs, Lauren Boebert, Ken Buck, Madison Cawthorn, Byron Donalds, Matt Gaetz, Jody Hice, Ronny Jackson, <span class='selected-term'>Jim Jordan</span>, Billy Long, Barry Loudermilk, Scott Perry and Greg Steube.",
    "author": "Jennifer Harper",
    "title": "Michele Tafoya leaves sports, jumps into politics"
  },
  {
    "id": 1570,
    "mediaId": 2627,
    "date": "2022-02-14",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, seemed to agree Sunday with a statement from former President Donald Trump that suggested some of Hillary Clinton's associates deserve to be executed.",
    "author": "Ja'han Jones",
    "title": "Rep. Jim Jordan seems to back Trump's comment about executing Clinton aides"
  },
  {
    "id": 1274,
    "mediaId": 2547,
    "date": "2022-02-14",
    "sentence": "Marshall then said he, Rand Paul, and insurrectionist <span class='selected-term'>Jim Jordan</span> are thinking about passing legislation requiring a president to take a mental test alongside their annual physical.",
    "author": "John Amato",
    "title": "Senator Roger Marshall's Medical License Should Be Revoked"
  },
  {
    "id": 1352,
    "mediaId": 2658,
    "date": "2022-02-15",
    "sentence": "That included $1,000 to McCarthy and $500 to Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span>’s joint fundraising committee.",
    "author": "",
    "title": "These companies stopped campaign donations to election objectors. Their lobbyists did not."
  },
  {
    "id": 902,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Charlie Spiering",
    "title": "Joe Biden Braces for Staff Exodus as Director of Broadcast Media Quits"
  },
  {
    "id": 1485,
    "mediaId": 2551,
    "date": "2022-02-15",
    "sentence": "When <span class='selected-term'>Jim Jordan</span> [U.S. Rep for Ohio-R] and myself said that they were spying on his campaign, we were ridiculed.",
    "author": "Katelyn Caralle",
    "title": "Ex-Director of National Intelligence says Hillary tried to 'frame' Trump with a 'false Russian collusion' narrative"
  },
  {
    "id": 1568,
    "mediaId": 2643,
    "date": "2022-02-15",
    "sentence": "Congress members such as Blackburn and <span class='selected-term'>Jim Jordan</span> (R-Ohio) both shared social media posts against what Blackburn calls \"government-funded crack pipes.\"",
    "author": "Daniel Villarreal",
    "title": "Biden Admin Commits to No Crack Pipes, Avoids Partial Government Shutdown"
  },
  {
    "id": 979,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "https://t.co/gGZwcIiczZ\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 13, 2022\nSenator Marsha Blackburn of Tennessee accused Sullivan of a ‘conflict of interest’ in his current efforts trying to de-escalate with Moscow.",
    "author": "Joe Hoft",
    "title": "Republican Leaders Jim Jordan and Marsha Blackburn Raise Concerns with Jake Sullivan as Biden’s National Security Advisor"
  },
  {
    "id": 997,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Rob Crilly",
    "title": "'I can't speak to that': Biden's Deputy Press Secretary Karine Jean-Pierre tells reporter THREE times to go to the DOJ when pressed on Durham's bombshell allegations Hillary spied on Trump when he was president and Biden knew about it"
  },
  {
    "id": 1160,
    "mediaId": 2580,
    "date": "2022-02-15",
    "sentence": "In addition, reparations should be paid to those in our country who have been damaged by this.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) told Fox News the federal filing proves Trump’s claim that he was being spied on – a claim that “60 Minutes” journalist Lesley Stahl pooh-poohed during an interview in October 2020.",
    "author": "Jody Brown",
    "title": "Hillary’s campaign paid for high-tech spying on Trump – even after the election, says Durham"
  },
  {
    "id": 1120,
    "mediaId": 2672,
    "date": "2022-02-15",
    "sentence": "Microsoft lobbyists gave the most, with Fred Humphries donating $2,500 to House Minority Leader Kevin McCarthy (R-Calif.) and $1,000 to Ohio Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "William Vaillancourt",
    "title": "Lobbyists Are Donating to GOP Election Deniers Even After Their Companies Pledged to Stop Giving"
  },
  {
    "id": 1015,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Laura Collins & Elizabeth Elkind &",
    "title": "Exclusive: Clinton cornered: Hillary refuses to answer questions about Durham revelation she paid to spy on the Trump campaign as she arrives at daughter Chelsea's Manhattan home ahead of the New York Democratic Convention"
  },
  {
    "id": 939,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Naomi Lim",
    "title": "Democrats in tight races abandon Biden as approval numbers plummet"
  },
  {
    "id": 1137,
    "mediaId": 2594,
    "date": "2022-02-16",
    "sentence": "In a stronger period of time in our country, this crime would have been punishable by death.”\nIn an even briefer statement three days later, evidently still basking in the glow of apparent triumph, he proclaimed: “I was proven right about the spying, and I will be proven right about 2020.”\nThe same development was likewise hailed loudly by Tucker Carlson on Fox News and on social media by loyalists including Donald Trump Jr, Ronna McDaniel, Ted Cruz, Kevin McCarthy, Marjorie Taylor Greene, Mark Meadows and <span class='selected-term'>Jim Jordan</span> but what exactly has Mr Durham alleged?",
    "author": "Joe Sommerlad",
    "title": "Why Donald Trump is once again claiming Democrats ‘spied’ on him"
  },
  {
    "id": 1255,
    "mediaId": 2618,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Christina Coulter",
    "title": "Florida woman, 33, 'used $15,000 pandemic relief loan to bankroll a hit on TSA agent who stole her boyfriend': Victim, 24, was gunned down outside her Miami home in front of her three-year-old daughter"
  },
  {
    "id": 968,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "Pelosi did not object to Nehls, but McCarthy pulled all of his nominees when Pelosi rejected Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Jim Banks, R-Ind., because they had worked to defend Trump on the House Judiciary Committee during House Democrat-led impeachment inquiries.",
    "author": "Eric Mack",
    "title": "Trump Endorses Texas GOP Reps. Nehls, Gooden, Weber"
  },
  {
    "id": 1644,
    "mediaId": 8369,
    "date": "2022-02-16",
    "sentence": "Perhaps then, following on the tendentiously ideological “findings” of the January 6 Commission which will surface conveniently prior to the election, the House decides to expel some members who are already in congress (e.g.. Rep <span class='selected-term'>Jim Jordan</span>) who supposedly had “contact” with the “insurrectionists”?",
    "author": "Boyd D. Cathey",
    "title": "Nightmare Scenario for the 2022 Congressional Elections?"
  },
  {
    "id": 1411,
    "mediaId": 2748,
    "date": "2022-02-16",
    "sentence": "He now works in the Biden White House,' Rep. <span class='selected-term'>Jim Jordan</span> of Ohio wrote on Twitter Monday.",
    "author": "Laura Collins",
    "title": "Hillary IGNORES question about Durham claims she spied on Trump as she arrives at Chelsea's home"
  },
  {
    "id": 1689,
    "mediaId": 2512,
    "date": "2022-02-16",
    "sentence": "That concern was shared by an unidentified member of the House Freedom Caucus, who wrote to Meadows on January 2nd that “if POTUS allows this to occur… we’re driving a stake in the heart of the federal republic.”\nThree days later, former Defense Department Inspector General Joseph Schmitz wrote to election objector Congressman <span class='selected-term'>Jim Jordan</span> (R-Ohio) that “on January 6, 2021, Vice President Mike Pence, as President of the Senate, should call out all electoral votes that he believes are unconstitutional as no electoral votes at all -- in accordance with guidance from founding father Alexander Hamilton and judicial precedence.",
    "author": "Brandon Gage",
    "title": "Text messages showcase the chaos and desperation inside Trumpworld on January 6th"
  },
  {
    "id": 1737,
    "mediaId": 2866,
    "date": "2022-02-17",
    "sentence": "“I think that may be something else that we’ll be looking on, that [Kentucky GOP Sen.] Rand Paul and I’ll be discussing, [Ohio GOP Rep.] <span class='selected-term'>Jim Jordan</span> again, seeing if we think that’s something that America deserves,” Marshall said.",
    "author": "Fix This Nation Staff",
    "title": "Joe Biden Shares Weird Personal Story About A Dead Dog"
  },
  {
    "id": 982,
    "mediaId": 2618,
    "date": "2022-02-17",
    "sentence": "",
    "author": "Monica Showalter",
    "title": "Biden recounts how he laid a dead dog at the doorstep of a constituent"
  },
  {
    "id": 1433,
    "mediaId": 2866,
    "date": "2022-02-18",
    "sentence": "Ohio Rep. <span class='selected-term'>Jim Jordan</span>, the top Republican on the House Judiciary Committee, is requesting the Justice Department provide information about its new domestic terrorism office, considering the agency’s plans last year regarding parents at school board meetings.",
    "author": "Fix This Nation Staff",
    "title": "Are School Parents A Target With DOJ’s New Domestic Terror Office?"
  },
  {
    "id": 1475,
    "mediaId": 2584,
    "date": "2022-02-18",
    "sentence": "The Ohio congressman <span class='selected-term'>Jim Jordan</span> similarly decried GoFundMe.",
    "author": "Sergio Olmos",
    "title": "Republicans who opposed racial justice protests hope truckers ‘clog up’ US cities"
  },
  {
    "id": 917,
    "mediaId": 2618,
    "date": "2022-02-18",
    "sentence": "",
    "author": "Monica Showalter",
    "title": "Wrong-way Biden dispatches Kamala Harris ... to the Ukraine border"
  },
  {
    "id": 422,
    "mediaId": 2550,
    "date": "2022-02-19",
    "sentence": "It cannot be emphasized enough: This was coming from a caucus that counts among its members the likes of Reps. <span class='selected-term'>Jim Jordan</span>, Andy Biggs, Paul Gosar, Matt Gaetz, Jody Hice, Marjorie Taylor Greene, Louie Gohmert, Madison Cawthorn, and Lauren Boebert.",
    "author": "Darrell Lucus\nCommunity",
    "title": "Freedom Caucus member: Jan. 6 could have been 'a stake in the heart of the federal republic'"
  },
  {
    "id": 95,
    "mediaId": 2584,
    "date": "2022-02-19",
    "sentence": "Kevin McCarthy, the minority leader, frequently breaks with McConnell in his expressions of fealty, in part because his caucus includes “Make America great again” extremists such as Madison Cawthorn, Matt Gaetz, Ronny Jackson, <span class='selected-term'>Jim Jordan</span> and Marjorie Taylor Greene.",
    "author": "David Smith",
    "title": "Renewed opposition to Trump stirs among establishment Republicans"
  },
  {
    "id": 59,
    "mediaId": 2573,
    "date": "2022-02-21",
    "sentence": "We heard from Congressman <span class='selected-term'>Jim Jordan</span> on Twitter today, who wrote: \"It's not a vast right-wing conspiracy.",
    "author": "",
    "title": "'Your World' on Russia-Ukraine, Hillary Clinton in New York"
  },
  {
    "id": 35,
    "mediaId": 2564,
    "date": "2022-02-21",
    "sentence": "Trump-aligned lawmakers including Reps. <span class='selected-term'>Jim Jordan</span>, Ronny Jackson, Madison Cawthorn and Sens.",
    "author": "Nikki Schwab",
    "title": "The rival Republican conferences: Democrat Tulsi Gabbard and Dr. Oz join the CPAC line-up alongside Trump this weekend - while election fraud critics hold event to back Cheney, Kinzinger and candidates facing MAGA challengers"
  },
  {
    "id": 301,
    "mediaId": 2537,
    "date": "2022-02-23",
    "sentence": "These \"ordinary citizens\" had just been whipped into insurrection by the Big Lie – by Donald Trump, the execrable <span class='selected-term'>Jim Jordan</span>, and others who wanted the mob to forcibly stop Congress from doing its duty to certify the results of an election that Trump’s own Department of Homeland Security called \"the most secure in American history.\"",
    "author": "Mark P. Painter",
    "title": "Opinion: There is no hope of saving the Republican Party"
  },
  {
    "id": 117,
    "mediaId": 2564,
    "date": "2022-02-23",
    "sentence": "The Texas Republican senator posted two images of himself at Mar-a-Lago\nHe's in Florida to speak at the Conservative Political Action Conference Thurs\nTrump was hosting a fundraiser for 2022 GOP congressional candidates\nCruz moderated a chat with Georgia Senate candidate Herschel Walker\nTennessee House candidate Morgan Ortagus was also there, along with former Florida AG Pam Bondi, Florida Rep. Mike Waltz and Ohio Rep. <span class='selected-term'>Jim Jordan</span>\nTop-dollar VIP access cost $250,000 per seat, and basic attendance ran $3,000\nTexas Senator Ted Cruz revealed he was at Donald Trump's Mar-a-Lago club in on Wednesday, along with a host of national Republican figures who gathered at the Florida resort for a high-profile fundraiser.",
    "author": "Elizabeth Elkind",
    "title": "Trump meets Ted Cruz at Mar-a-Lago ahead of C-PAC: Republicans and conservative donors mingle at private Florida private club ahead of ex-President's prime-time Saturday night speech"
  },
  {
    "id": 341,
    "mediaId": 2618,
    "date": "2022-02-23",
    "sentence": "",
    "author": "Monica Showalter",
    "title": "Doddering Biden volunteers America for higher energy prices to defend Ukraine's borders"
  },
  {
    "id": 419,
    "mediaId": 2580,
    "date": "2022-02-24",
    "sentence": "A host of prominent conservatives will speak at CPAC this weekend, from U.S. Sen. Ted Cruz to former Secretary of State Mike Pompeo, U.S. Sen. Marco Rubio and U.S. Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "",
    "title": "DeSantis, Trump to speak at CPAC"
  },
  {
    "id": 573,
    "mediaId": 2629,
    "date": "2022-02-24",
    "sentence": "Jim Banks of Indiana, Rep. Vern Buchanan of Florida, Rep. Mike Carey of Ohio, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, Rep. Debbie Lesko of Arizona, Rep. Mary Miller of Illinois, Rep. Mike Waltz of Florida, Sen. Marsha Blackburn of Tennessee, Sen. Ted Cruz of Texas, and Sen. Lindsey Graham of South Carolina—should definitely be getting questions about what conversations they had with Trump about the issue and how they felt about being at an event that boosted his stature in the Republican Party and was sandwiched between times he praised Putin for invading Ukraine.",
    "author": "Laura Clawson",
    "title": "Incoherent On Ukraine, Republican Officials Try To Ignore Trump Praise For Putin"
  },
  {
    "id": 113,
    "mediaId": 2512,
    "date": "2022-02-24",
    "sentence": "In the last week, Funes tagged Republican lawmakers like Reps. <span class='selected-term'>Jim Jordan</span>, Jim Banks, and Senator Josh Hawley with messages like, “Not all #J6 prisoners are created equal.",
    "author": "Brandi Buchman",
    "title": "Jan. 6 committee interviews ex-aide who claims 'Trump was framed' for insurrection"
  },
  {
    "id": 111,
    "mediaId": 2550,
    "date": "2022-02-24",
    "sentence": "Jim Banks of Indiana, Rep. Vern Buchanan of Florida, Rep. Mike Carey of Ohio, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, Rep. Debbie Lesko of Arizona, Rep. Mary Miller of Illinois, Rep. Mike Waltz of Florida, Sen. Marsha Blackburn of Tennessee, Sen. Ted Cruz of Texas, and Sen. Lindsey Graham of South Carolina—should definitely be getting questions about what conversations they had with Trump about the issue and how they felt about being at an event that boosted his stature in the Republican Party and was sandwiched between times he praised Putin for invading Ukraine.",
    "author": "Laura Clawson",
    "title": "Republicans don't want to talk about Trump calling Putin 'smart.' Time for the media to make them"
  },
  {
    "id": 24,
    "mediaId": 2564,
    "date": "2022-02-25",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, added on Twitter.",
    "author": "Morgan Phillips",
    "title": "Republican Senator Ben Sasse tears into 'evil' Putin and tells Biden to sanction 'lifestyles of the rich and famous a**hole mobsters and oligarchs' who enable the Russian leader's 'madness'"
  },
  {
    "id": 20,
    "mediaId": 2512,
    "date": "2022-02-25",
    "sentence": "The people that were benefiting from that were Mitch McConnell, Kevin McCarthy, <span class='selected-term'>Jim Jordan</span>, Matt Gaetz, Marjorie Taylor Greene, and the cuckoo caucus that is going to be a much larger part of that Republican demo in the coming year.",
    "author": "",
    "title": "Ex-Republican Rick Wilson gives Democrats advice on how to defeat authoritarian GOP"
  },
  {
    "id": 473,
    "mediaId": 2702,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Morgan Chalfant",
    "title": "Biden says Jackson will bring ‘uncompromising integrity’ to Supreme Court"
  },
  {
    "id": 325,
    "mediaId": 2594,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Andrew Naughtie",
    "title": "Trump news: White House slams Putin ‘scheme’ as ex-president rejects House speaker plan"
  },
  {
    "id": 716,
    "mediaId": 2676,
    "date": "2022-02-25",
    "sentence": "The people that were benefiting from that were Mitch McConnell, Kevin McCarthy, <span class='selected-term'>Jim Jordan</span>, Matt Gaetz, Marjorie Taylor Greene, and the cuckoo caucus that is going to be a much larger part of that Republican demo in the coming year.",
    "author": "Dean Obeidallah",
    "title": "Former GOP strategist Rick Wilson on Putin's deep appeal to \"dictator-friendly\" Republicans"
  },
  {
    "id": 847,
    "mediaId": 2548,
    "date": "2022-02-26",
    "sentence": "Republican Ohio Rep. <span class='selected-term'>Jim Jordan</span> branded President Joe Biden’s Supreme Court nominee as “another left-wing pick” while appearing on “FOX & Friends Saturday.”\nBiden announced Judge Ketanji Brown Jackson as his Supreme Court nominee Friday.",
    "author": "Kaitlin Housler",
    "title": "‘It’s Another Left-Wing Pick’: Rep. Jim Jordan Reacts To Biden’s SCOTUS Nominee"
  },
  {
    "id": 13,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "",
    "author": "Caitlin McFall",
    "title": "Ukraine invasion: Russia 'increasingly frustrated' by lack of momentum: US defense official"
  },
  {
    "id": 12704,
    "mediaId": 2746,
    "date": "2022-02-26",
    "sentence": "Prior to Mr. Trump, several other conservative and GOP speakers took the stage, including Ohio Rep. <span class='selected-term'>Jim Jordan</span>, Florida Sen. Rick Scott, and Louisiana Sen. John Kennedy.",
    "author": "Mica Soellner",
    "title": "Trump condemns Russian invasion of Ukraine as an ‘atrocity,’ blames Biden"
  },
  {
    "id": 12967,
    "mediaId": 2679,
    "date": "2022-02-26",
    "sentence": "Rep. Jim Banks, R-Ind., after saying he would “never, ever apologize for objecting” to Biden’s victory Jan. 6, said he and Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, were victimized when they were removed from the House committee investigating that day’s attack on the U.S. Capitol.",
    "author": "Astead W. Herndon",
    "title": "At CPAC, Ukraine and policy take a back seat to cultural grievances"
  },
  {
    "id": 13035,
    "mediaId": 2590,
    "date": "2022-02-27",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said he hoped Trump would run again, while Ohio Senate candidate Josh Mandel declared Trump the winner of the 2020 election.",
    "author": "Liz Skalka",
    "title": "Conservatives Are Warming To The Idea Of A Post-Trump GOP"
  },
  {
    "id": 13175,
    "mediaId": 2548,
    "date": "2022-02-27",
    "sentence": "Republican Ohio Rep. <span class='selected-term'>Jim Jordan</span> called Jackson “another left wing pick” and “radical,” criticizing her positions on parental rights in education, the First and Second Amendments and school choice during a Saturday appearance on “Fox & Friends.”\nJackson is one of the most high-profile judicial nominees confirmed to the U.S. Court of Appeals for the D.C.",
    "author": "Nicole Silverio",
    "title": "‘I Find Those Words Offensive’: Sen. Klobuchar Pushes Back On Claims That Biden’s SCOTUS Nominee Is ‘Far Left’"
  },
  {
    "id": 13219,
    "mediaId": 2724,
    "date": "2022-02-28",
    "sentence": "“It would have been nice if the $85 billion in weapons left in Afghanistan could’ve been sent to Ukraine.” ~ Rep. <span class='selected-term'>Jim Jordan</span> (Ohio – R)\nRELATED: Newspaper Editorial Blames Right-Wing Rhetoric For Assassination Attempt On Louisville Mayoral Candidate After BLM Activist Was Charged\nJordan: State Department Too Focused On ‘Pronouns’ And ‘Gender-neutral Passports’\nJordan then said the U.S. government should concentrate more on “real diplomacy” than political correct nonsense.",
    "author": "John Hanson",
    "title": "Video: Jim Jordan Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine"
  },
  {
    "id": 13206,
    "mediaId": 2724,
    "date": "2022-03-01",
    "sentence": "https://t.co/rJ4GDf6hlH\n— Gary Weiss (@gary_weiss) February 28, 2022\nRELATED: Video: <span class='selected-term'>Jim Jordan</span> Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nPsaki then touted Biden’s leadership abilities.",
    "author": "John Hanson",
    "title": "ABC’s George Stephanopoulos Breaks The News To Psaki That A Majority Of Americans ‘Question The President’s Mental Capacity’"
  },
  {
    "id": 13073,
    "mediaId": 2650,
    "date": "2022-03-01",
    "sentence": "On Monday, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), the top Republican on the House Judiciary Committee, was asked to identify “the number one investigation that the House Republicans should put forward and pursue,” should the Republicans be in the majority next year after the midterm elections.",
    "author": "Matt Margolis",
    "title": "Jim Jordan: House GOP Will Prioritize These 3 Investigations Next Year"
  },
  {
    "id": 12689,
    "mediaId": 2748,
    "date": "2022-03-01",
    "sentence": "On July 21, 2020, Pelosi blocked two of McCarthy's choices, <span class='selected-term'>Jim Jordan</span> and Jim Banks, each of whom supported Trump's decision to contest the election, which they had every legal right to do.",
    "author": "Allan H. Ryskind",
    "title": "Ryskind: Liz Cheney's Unjust War Against Trump, His Jan. 6 Advisers, and the GOP"
  },
  {
    "id": 12660,
    "mediaId": 2573,
    "date": "2022-03-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, said the \"masks were always political.\"",
    "author": "",
    "title": "The 'science' behind lifting of Capitol mask mandate ahead of State of the Union called into question"
  },
  {
    "id": 12488,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "will host a virtual pen and pad\n2 p.m. McCarthy, Scalise, Stefanik, Reps. Cathy McMorris Rodgers (R-Wash.), <span class='selected-term'>Jim Jordan</span> (R-Ohio), Kevin Hern (R-Okla.), Brian Steil (R-Wisc.",
    "author": "",
    "title": "Former Senate guy visits House chamber"
  },
  {
    "id": 12575,
    "mediaId": 2573,
    "date": "2022-03-02",
    "sentence": "Joining us now is House Minority Whip Steve Scalise, House Judiciary Committee Ranking Member <span class='selected-term'>Jim Jordan</span>, and Molly Hemingway Editor in Chief of the Federalist Fox News Contributor.",
    "author": "",
    "title": "'The Ingraham Angle' on Biden's State of the Union"
  },
  {
    "id": 12567,
    "mediaId": 2658,
    "date": "2022-03-02",
    "sentence": "House Minority Leader Kevin McCarthy, Rep. Scott Perry (R-Pa.) and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) have all refused, despite evidence showing they witnessed or participated in significant aspects of Trump’s effort.",
    "author": "",
    "title": "Jan. 6 probe points lawmakers more and more toward GOP colleagues"
  },
  {
    "id": 12885,
    "mediaId": 2641,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday that poor decisions about energy by President Joe Biden have led Russian President Vladimir Putin to use oil and gas as leverage.",
    "author": "Luca Cacciatore",
    "title": "Jim Jordan to Newsmax: 'Putin Is Using Energy as Leverage' on US, NATO"
  },
  {
    "id": 13228,
    "mediaId": 2548,
    "date": "2022-03-02",
    "sentence": "(RELATED: Rep. <span class='selected-term'>Jim Jordan</span> Says Biden Might Want To Change His Policies, But The ‘Radical Left’ In His Party Will Never Let Him)\nSanctioning Russian energy has gained bipartisan support from lawmakers, political commentators and elites.",
    "author": "Nicole Silverio",
    "title": "Gutfeld Says US Government Is ‘Acting Like White Knights’ As They Purchase Russian Oil"
  },
  {
    "id": 13350,
    "mediaId": 2771,
    "date": "2022-03-03",
    "sentence": "One of the endorsees, <span class='selected-term'>Jim Jordan</span> of Ohio, was so prominent in the events surrounding the Jan. 6 insurrection, which led to deadly violence, that he has been invited to testify before the congressional committee investigating the event.",
    "author": "Ron Kampeas",
    "title": "Fast ForwardAIPAC’s PAC endorses dozens of Republicans who refused to certify Joe Biden as president"
  },
  {
    "id": 12966,
    "mediaId": 2724,
    "date": "2022-03-03",
    "sentence": "On Wednesday, Republican Congressman <span class='selected-term'>Jim Jordan</span> argued that President Biden was essentially being held hostage policy-wise by the far-left wing of the Democrat Party – particularly when it comes to energy policy.",
    "author": "John Hanson",
    "title": "Rep. Jim Jordan Says ‘Radical Left’ Won’t Let Biden Reverse ‘Crazy’ Energy Policies"
  },
  {
    "id": 12961,
    "mediaId": 2584,
    "date": "2022-03-04",
    "sentence": "Discussing a plan in which Trump would issue a blanket pardon to co-conspirators in the attempt to overturn the election, Senator Ted Cruz and congressman <span class='selected-term'>Jim Jordan</span> among them.",
    "author": "Martin Pengelly",
    "title": "Roger Stone raged at ‘disgrace’ Trump over failure to overturn election – report"
  },
  {
    "id": 13310,
    "mediaId": 2609,
    "date": "2022-03-04",
    "sentence": "Ohio congressman <span class='selected-term'>Jim Jordan</span> (R) indicates an investigation into Fauci is a priority if they regain a majority in November’s midterms.",
    "author": "Leslie Eastman",
    "title": "Where in the World Has Dr. Anthony Fauci Gone?"
  },
  {
    "id": 13268,
    "mediaId": 2699,
    "date": "2022-03-04",
    "sentence": "Ted Cruz (R-TX) and Josh Hawley (R-MO) and Reps. Matt Gaetz (R-FL) and <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Corbin Bolies",
    "title": "Revealed: Roger Stone’s Bonkers Pardon Plan for Jan. 6 Lawmakers"
  },
  {
    "id": 12956,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Kevin Haggerty",
    "title": "Biden claims he enjoyed ‘teaching’ and misses ‘being a professor at Penn’. Except he never taught there."
  },
  {
    "id": 13165,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "(Snip) Ohio congressman <span class='selected-term'>Jim Jordan</span> (R) indicates an investigation into Fauci is a priority if they regain a majority in November’s midterms.",
    "author": "Leslie Eastman",
    "title": "Where in the World Has Dr. Anthony Fauci Gone?"
  },
  {
    "id": 12790,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Eric R. Mandel",
    "title": "While America watches the war in Ukraine, Biden finalizes a dangerous Iran deal"
  },
  {
    "id": 12564,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "P.F. Whalen",
    "title": "Knucklehead Of The Week: Cackling Kamala, Queen Of Clumsy Communication"
  },
  {
    "id": 12492,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Joe Hoft",
    "title": "And There It Is: Biden Asks for Billions for COVID and Ukraine – Where Will This Money Really Go?"
  },
  {
    "id": 12511,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Katie Weston",
    "title": "Vladimir Putin says Western sanctions on Russia are almost a declaration of WAR and anyone imposing no-fly zone on Ukraine would be considered to have entered the conflict"
  },
  {
    "id": 12509,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Haris Alic",
    "title": "Biden’s deficit reduction pledge undercut by push for trillions in new social welfare spending"
  },
  {
    "id": 12505,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Melissa Koenig",
    "title": "Former UN Ambassador Nikki Haley claims Biden's Afghan exit debacle and the Nord Stream 2 pipeline are to blame for emboldening Putin to invade Ukraine: Says it is 'lunacy' to continue to buy Russian oil"
  },
  {
    "id": 12494,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Chris Queen",
    "title": "Hate-Hoaxing Atlanta Rioters Who Tried to Frame Trump Supporters Convicted"
  },
  {
    "id": 12524,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Anthony",
    "title": "Amazing Video Shows The People’s Convoy Stretched Out Over 60 Miles"
  },
  {
    "id": 12576,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Chris Donaldson",
    "title": "Priest reminds ‘good Catholic’ Biden of confession schedule after angry response to abortion limits"
  },
  {
    "id": 12726,
    "mediaId": 2727,
    "date": "2022-03-06",
    "sentence": "One of the endorsees, <span class='selected-term'>Jim Jordan</span> of Ohio, was so prominent in the events surrounding the January 6 insurrection, which led to deadly violence, that he has been invited to testify before the congressional committee investigating the event.",
    "author": "JTA and TOI staff",
    "title": "AIPAC slammed for endorsing Republicans who refused to certify Biden’s election"
  },
  {
    "id": 12960,
    "mediaId": 2746,
    "date": "2022-03-06",
    "sentence": "The bill would require jurisdictions to get “approval from unelected people in the Justice Department before changing its election process — that’s some scary stuff,” Rep. <span class='selected-term'>Jim Jordan</span>, Ohio Republican, said last August.",
    "author": "Kerry Picket",
    "title": "Harris compares Republicans to 1960s Alabama state troopers on ‘Bloody Sunday’"
  },
  {
    "id": 11428,
    "mediaId": 2724,
    "date": "2022-03-07",
    "sentence": "Rogers’ comments are similar to those of Rep. <span class='selected-term'>Jim Jordan</span>, who argued last week that Biden is essentially being held hostage by the far-left of his party.",
    "author": "John Hanson",
    "title": "Republican Rep. Mike Rogers: Every Barrel Of Russian Oil U.S. Buys Has ‘Ukrainian Blood On It’"
  },
  {
    "id": 10832,
    "mediaId": 2641,
    "date": "2022-03-08",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, accused President Joe Biden of being \"afraid\" to stand up to Democrats and increase oil production in the U.S.\nJordan made his comments Tuesday during an interview on TV's \"Fox & Friends.\"",
    "author": "Jeffrey Rodack",
    "title": "Rep. Jim Jordan Slams Biden Over US Oil Production"
  },
  {
    "id": 10786,
    "mediaId": 2573,
    "date": "2022-03-08",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, slammed President Biden on \"Fox & Friends\" Tuesday for being \"afraid\" to stand up to Democrats on increasing U.S. energy production as gas prices skyrocket amid the Russia-Ukraine war.",
    "author": "Fox News Staff",
    "title": "Jim Jordan blasts Biden over oil: He's talking to other countries because he's afraid to stand up to his party"
  },
  {
    "id": 11466,
    "mediaId": 2629,
    "date": "2022-03-08",
    "sentence": "Anyone telling you otherwise is lying,\" Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) tweeted on Monday.",
    "author": "Emily Singer",
    "title": "Biden Approval Rises Despite GOP Attacks On Ukraine Policy"
  },
  {
    "id": 10990,
    "mediaId": 2664,
    "date": "2022-03-08",
    "sentence": "With Melanie Zanona's report pointing out that bombastic Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) is slated to take over the powerful House Judiciary Committee's chairmanship, the report adds that some Republicans are not pleased with the direction the party is going.",
    "author": "Tom Boggioni",
    "title": "GOP lawmaker rips into extremist 'wacky conference' and predicts worse antics to come"
  },
  {
    "id": 10706,
    "mediaId": 2572,
    "date": "2022-03-09",
    "sentence": "Crabtree said that his fellow guest, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, was the only person to voice disapproval at a congressional hearing with major companies' CEOs that saw promises to halt energy production.",
    "author": "",
    "title": "Rising gas prices have 'everything to do' with Biden says former Keystone XL pipeline worker"
  },
  {
    "id": 10715,
    "mediaId": 2526,
    "date": "2022-03-09",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) is demanding answers from the National School Boards Association (NSBA) regarding its “collusion” with the Biden administration to use federal law enforcement to investigate parents attending school board meetings as “domestic terrorists.”\nIn a letter obtained exclusively by Breitbart News, Jordan — who is the ranking member of the House Judiciary Committee — points out that the NSBA’s original letter to President Joe Biden prompted a “rapid and stunning response … that culminated in a directive from the Attorney General for federal law enforcement to monitor school board matters.”\nJordan also pointed out in the letter that the NSBA and Biden administration sought to manufacture a reason for federal law enforcement to go after parents, saying, “We still have concerns about the NSBA’s collusion with the Biden Administration to develop a pretext for invoking federal law enforcement to intimidate and silence parents.” [Emphasis added].",
    "author": "Breccan F. Thies",
    "title": "Exclusive — Jim Jordan: NSBA Colluded with Biden Admin to ‘Intimidate and Silence Parents’ Using Federal Law Enforcement"
  },
  {
    "id": 11157,
    "mediaId": 2602,
    "date": "2022-03-09",
    "sentence": "The New York Times has reported that he was said he was like KKK leader David Duke “without the baggage.”\nAIPAC’s most outrageous endorsement may be Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, who has refused to testify before the January 6 investigating committee and joined failed lawsuits to block certification of Biden’s election.",
    "author": "DOUGLAS BLOOMFIELD",
    "title": "AIPAC and some controversial endorsements - opinion"
  },
  {
    "id": 11088,
    "mediaId": 2664,
    "date": "2022-03-09",
    "sentence": "\\n\\n\"Which U.S. President had discussions with <span class='selected-term'>Jim Jordan</span> just prior to his supporters attacking the U.S. Capitol in an attempted coup?\"",
    "author": "Travis Gettys",
    "title": "'Bootlicker' Jim Jordan soundly mocked for one-word 'Trump' tweet: 'Really? That's the tweet?'"
  },
  {
    "id": 11394,
    "mediaId": 2724,
    "date": "2022-03-09",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) March 8, 2022\nRELATED: Psaki Gets Testy With Fox News’ Peter Doocy In Tense Back And Forth Over Spiking Gas Prices: ‘Let Me Finish’\nRep. Jordan: ‘The real answer is, let’s increase production here’\nOpening up the segment with clips of reporters asking White House press secretary Jen Psaki about Biden looking to Venezuela, Saudi Arabia, and Iran for help on the oil front, Fox host Steve Doocy asked Jordan what the impact of banning Russian oil imports will be.",
    "author": "John Hanson",
    "title": "Do Democrats Want $7 Gas? Rep. Jim Jordan Says Yes"
  },
  {
    "id": 11226,
    "mediaId": 2846,
    "date": "2022-03-09",
    "sentence": "",
    "author": "",
    "title": "Report: Biden Tried To Ask Saudis And UAE For More Oil But They REFUSED To Take His Calls"
  },
  {
    "id": 11236,
    "mediaId": 2557,
    "date": "2022-03-09",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) is demanding answers from the National School Boards Association (NSBA) regarding its “collusion” with the Biden administration to use federal law enforcement to investigate parents attending school board meetings as “domestic terrorists.”\nIn a letter obtained exclusively by Breitbart News, Jordan — who is the ranking member of the House Judiciary Committee — points out that the NSBA’s original letter to President Joe Biden prompted a “rapid and stunning response … that culminated in a directive from the Attorney General for federal law enforcement to monitor school board matters.”\nThe article goes on to state the following:\nJordan also pointed out in the letter that the NSBA and Biden administration sought to manufacture a reason for federal law enforcement to go after parents, saying, “We still have concerns about the NSBA’s collusion with the Biden Administration to develop a pretext for invoking federal law enforcement to intimidate and silence parents.” [Emphasis added].",
    "author": "DML News App",
    "title": "NEWS ALERT: Jim Jordan: NSBA Colluded with Biden Admin to ‘Intimidate and Silence Parents’"
  },
  {
    "id": 11233,
    "mediaId": 2644,
    "date": "2022-03-10",
    "sentence": "During the 2019 impeachment proceedings — which culminated with Trump being acquitted in a party-line vote — Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said Ukraine was regarded by accounting firm Ernst & Young as “one of the three most corrupt countries on the planet.”\nCawthorn is running for re-election in North Carolina’s 11th District, where he is facing seven Republican primary challengers.",
    "author": "Evan Simko-Bednarski",
    "title": "GOP Rep. Madison Cawthorn slams Zelensky as a ‘thug’ overseeing ‘evil’ government"
  },
  {
    "id": 11081,
    "mediaId": 2550,
    "date": "2022-03-10",
    "sentence": "In the midst of trying to defend Trump, Rep. <span class='selected-term'>Jim Jordan</span> called Ukraine “one of the three most corrupt countries on the planet.” He also condemned efforts to fight corruption in Ukraine as themselves corrupt because Biden was involved.",
    "author": "Laura Clawson",
    "title": "Republicans suddenly claim to be the biggest allies of the nation they once denounced as corrupt"
  },
  {
    "id": 11117,
    "mediaId": 2746,
    "date": "2022-03-10",
    "sentence": "The Republican Party is everybody else,” Rep. <span class='selected-term'>Jim Jordan</span>, Ohio Republican, told The Washington Times.",
    "author": "Mica Soellner",
    "title": "House GOP finish rebranding that Trump began, run as blue-collar party"
  },
  {
    "id": 11231,
    "mediaId": 2590,
    "date": "2022-03-10",
    "sentence": "Biden “shut off the Keystone Pipeline,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) declared in an interview last week.",
    "author": "Chris D'Angelo",
    "title": "The GOP's Biggest Whoppers About Biden And Fossil Fuels"
  },
  {
    "id": 11107,
    "mediaId": 2557,
    "date": "2022-03-11",
    "sentence": "https://t.co/KLL7SoYIzP\n— Donald Trump Jr. (@DonaldJTrumpJr) March 10, 2022\nRep. <span class='selected-term'>Jim Jordan</span> tweeted Tuesday, “Keystone Pipeline.",
    "author": "",
    "title": "VIDEO: Americans blast Biden for halting Keystone Pipeline: ‘Killed our economy’"
  },
  {
    "id": 11139,
    "mediaId": 2526,
    "date": "2022-03-11",
    "sentence": "“The First Amendment prohibits the government from directly censoring speech it finds objectionable.”\nThe group of Republicans consists of House Energy and Commerce Committee Ranking Member Cathy McMorris Rodgers (R-WA), House Minority Whip and Select Committee on the Coronavirus Crisis Ranking Member Steve Scalise (R-LA), Judiciary Committee Ranking Member <span class='selected-term'>Jim Jordan</span> (R-OH), and Oversight and Reform Committee Ranking Member James Comer (R-KY).",
    "author": "Jacob Bliss",
    "title": "Exclusive: House Republican Leaders Send Letter to Surgeon General over Big Tech Censorship"
  },
  {
    "id": 11026,
    "mediaId": 2625,
    "date": "2022-03-11",
    "sentence": "Biden “shut off the Keystone Pipeline,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) declared in an interview last week.",
    "author": "Chris D’Angelo",
    "title": "The GOP’s Four Biggest Lies About Joe Biden and Fossil Fuels"
  },
  {
    "id": 11036,
    "mediaId": 2724,
    "date": "2022-03-11",
    "sentence": "",
    "author": "RealClearWire",
    "title": "Will Dems’ Green Dream Fuel GOP Red Wave?"
  },
  {
    "id": 11410,
    "mediaId": 2699,
    "date": "2022-03-11",
    "sentence": "Among the AIPAC chosen are Ohio Rep. <span class='selected-term'>Jim Jordan</span> (who trashed the Jan. 6 committee), Texas Rep. Ronny Jackson (the former White House physician who says Trump won the 2020 election), and Pennsylvania Rep. Scott Perry (who compared Democrats to Nazis).",
    "author": "Eleanor Clift",
    "title": "AIPAC Is All In on Support for ‘Stop the Steal’ Candidates"
  },
  {
    "id": 11418,
    "mediaId": 2626,
    "date": "2022-03-11",
    "sentence": "Also, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said last year, \"We know that five states, some of the five key states that were critical in this election, changed their election law in an unconstitutional fashion.”\nIn Arizona, an Obama-appointed judge extended the registration date 18 days despite state law in \"an end-run around the Constitution.\"",
    "author": "Jay Maxson",
    "title": "Suns’ Chris Paul Joins Forces With Obamas To Fight ‘Voter Suppression’"
  },
  {
    "id": 11409,
    "mediaId": 2656,
    "date": "2022-03-12",
    "sentence": "",
    "author": "Rick Moran",
    "title": "Brace Yourselves: Illegal Alien Deportations Plummeted in 2021, Biden Prepares to End Title 42 Restrictions in 2022"
  },
  {
    "id": 10731,
    "mediaId": 2573,
    "date": "2022-03-14",
    "sentence": "\"Burkov has been described as an ‘asset of supreme importance’ and ‘one of the most connected and skilled malicious hackers ever apprehended by U.S. authorities,’\" Reps. <span class='selected-term'>Jim Jordan</span>, Michael McCaul, John Katko, and Mike Turner wrote to Sullivan, in a letter obtained by Fox News.",
    "author": "Brooke Singman",
    "title": "House GOP investigating US release of Russian cyber criminal"
  },
  {
    "id": 11024,
    "mediaId": 2641,
    "date": "2022-03-14",
    "sentence": "The letter, authored by GOP Reps. <span class='selected-term'>Jim Jordan</span> of Ohio, John Katko of New York, Michael McCaul of Texas and Mike Turner of Ohio, stated that ''Burkov has been described as an 'asset of supreme importance' and 'one of the most connected and skilled malicious hackers ever apprehended by U.S.",
    "author": "Jeremy Frankel",
    "title": "Republicans Demand Answers on Release of Russian Cyber Criminal"
  },
  {
    "id": 11044,
    "mediaId": 2746,
    "date": "2022-03-14",
    "sentence": "The top Republicans on four House committees are questioning the Biden administration‘s decision to “prematurely release” a Russian cybercriminal, raising concerns that “he may now be working against U.S. interests.”\nReps. <span class='selected-term'>Jim Jordan</span> and Michael Turner, both of Ohio, and Reps. John Katko of New York and Michael McCaul of Texas fired off a letter Monday to White House National Security Adviser Jake Sullivan asking for more information as to why the administration granted Aleksei Burkov early release from U.S. custody.",
    "author": "Seth McLaughlin",
    "title": "Republicans raise questions about U.S. release of Russian cybercriminal"
  },
  {
    "id": 10760,
    "mediaId": 2573,
    "date": "2022-03-15",
    "sentence": "Joining me now is House Minority Whip Steve Scalise; Ohio Congressman <span class='selected-term'>Jim Jordan</span>, Ranking Member of the House Judiciary Committee.",
    "author": "Fox News Staff",
    "title": "'The Ingraham Angle' on China's role in Russia-Ukraine war"
  },
  {
    "id": 10943,
    "mediaId": 2618,
    "date": "2022-03-15",
    "sentence": "Darrell Issa (R-CA), who was chairman of the House Committee on Oversight and Government Reform during former President Barack Obama’s scandal-ridden administration, told Breitbart News exclusively that Republicans are “preparing” for an oversight onslaught after the midterm elections in which they will hold President Joe Biden accountable.Issa, whose high-profile battles with Obama included the IRS targeting scandal, the Operation Fast and Furious gun-walking scandal, the Benghazi terrorist attack scandal, and more, said after the 2022 midterm elections many new faces will join the ranks of oversight veterans like himself and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) in the halls of Congress.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Darrell Issa: ‘We Are Preparing’ Legion of GOP ‘Watchdogs’ to ‘Hold this President Accountable’"
  },
  {
    "id": 11279,
    "mediaId": 2656,
    "date": "2022-03-15",
    "sentence": "Judiciary Committee Ranking Member <span class='selected-term'>Jim Jordan</span> (R-Ohio), Intelligence Committee Ranking Member Michael Turner (R-Ohio), Homeland Security Committee Ranking Member John Katko (R-N.Y.), and Foreign Affairs Committee Ranking Member Michael McCaul (R-Texas), sent a letter to Joe Biden’s National Security Advisor Jake Sullivan looking for answers.",
    "author": "Matt Margolis",
    "title": "Biden Released a Top Russian Hacker, and Republicans Have Questions"
  },
  {
    "id": 11318,
    "mediaId": 6551,
    "date": "2022-03-15",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio) said that the decision would undoubtedly lead to more chaos and harm at the border:\nDemocrats want to end Title 42 at the southern border.",
    "author": "",
    "title": "Immigration Arrests and Deportations Plummet During Biden's First Year"
  },
  {
    "id": 11572,
    "mediaId": 2744,
    "date": "2022-03-15",
    "sentence": "Just In...\nRepublican Reps. Steve Scalise and <span class='selected-term'>Jim Jordan</span> blasted Democrats for their handling of COVID-19, the economy, and the war in Ukraine.",
    "author": "Heather Hamilton",
    "title": "WATCH: GOP lawmakers say Democrats playing 'out of touch' political games"
  },
  {
    "id": 10825,
    "mediaId": 2550,
    "date": "2022-03-16",
    "sentence": "Related: Who’s who: A rolling guide to the targets of the Jan. 6 committee\nAccording to ABC, GOP House Leader Kevin McCarthy and Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania have had “no follow-up discussions” about their cooperation since receiving their respective subpoenas.",
    "author": "",
    "title": "Maybe there won't be subpoenas for GOP lawmakers from Jan. 6 probe but that doesn't spell doom"
  },
  {
    "id": 11444,
    "mediaId": 2668,
    "date": "2022-03-16",
    "sentence": "House Judiciary Committee Ranking Member Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Rep. Dan Bishop (R-N.C.) also went off, according to the DC, with Jordan calling it “crazy” and pointing out that everything about the Capitol is taxpayer-funded, and Bishop calling it “absurd” and noting that “the new normal for Democrats [is] to treat working-class Americans with disdain.”\nSen. Marshall also took shots at Politico for its breathless reporting:\nPulitzer Prize-winning article right here ?",
    "author": "Sister Toldjah",
    "title": "Kansas Senator Responds Accordingly to 'Hill Aide' Who Reported His Trucker Convoy Tour to the DOJ"
  },
  {
    "id": 11090,
    "mediaId": 2618,
    "date": "2022-03-16",
    "sentence": "",
    "author": "Terresa Monroe-Hamilton",
    "title": "Biden to announce $1B arms package, weighs giving Ukraine tank-killing Switchblade ‘kamikaze’ drones"
  },
  {
    "id": 11133,
    "mediaId": 2618,
    "date": "2022-03-16",
    "sentence": "",
    "author": "Kenneth Garger",
    "title": "Biden refers to Kamala Harris as ‘first lady’ in latest gaffe"
  },
  {
    "id": 10871,
    "mediaId": 8484,
    "date": "2022-03-17",
    "sentence": "'Told ya,' Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, quipped on Twitter.",
    "author": "Morgan Phillips",
    "title": "'The cover-up may be an even bigger crime than the contents of Hunter's laptop': Trump's office and Republicans tear into 'Big Tech, the liberal media and Biden' after New York Times finally confirmed his son's laptop is real"
  },
  {
    "id": 10700,
    "mediaId": 2572,
    "date": "2022-03-17",
    "sentence": "",
    "author": "Tyler Olson",
    "title": "Over 50 House Republicans back Banks' resolution opposing Iran nuclear deal amid Russia-Ukraine war"
  },
  {
    "id": 10970,
    "mediaId": 2745,
    "date": "2022-03-17",
    "sentence": "Another key figure in the push, Rep. <span class='selected-term'>Jim Jordan</span> (Ohio), top Republican on the House Judiciary Committee, has been a vocal critic of the most aggressive antitrust bills on the table.",
    "author": "",
    "title": "Tensions in House GOP over how to go after Big Tech are boiling over"
  },
  {
    "id": 11075,
    "mediaId": 6509,
    "date": "2022-03-17",
    "sentence": "“This is what the Democrats are focused on,\" said Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "Farnoush Amiri",
    "title": "House Passes CROWN Act Prohibiting Discrimination Based on Hair"
  },
  {
    "id": 11424,
    "mediaId": 2633,
    "date": "2022-03-17",
    "sentence": "“This is what the Democrats are focused on,\" said Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "Farnoush Amiri",
    "title": "House Passes CROWN Act Prohibiting Discrimination Based on Hair"
  },
  {
    "id": 11347,
    "mediaId": 2614,
    "date": "2022-03-17",
    "sentence": "WASHINGTON, DC – Rep. <span class='selected-term'>Jim Jordan</span> went on a tirade on the House floor earlier in March while calling out a bill that he said would “codify” the Biden administration’s past efforts to label parents attending school board meetings as being potential domestic terrorists.",
    "author": "Red Voice Media",
    "title": "Jim Jordan Calls Out Dems Trying To “Codify” Past Efforts To Label Parents Domestic Terrorists [VIDEO]"
  },
  {
    "id": 11291,
    "mediaId": 2748,
    "date": "2022-03-17",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) slammed Rep. Jerry Nadler (D-NY) over his handling of an investigation into the National School Boards Association (NSBA) letter asking the Biden administration to investigate parents as “domestic terrorists,” as Democrats try to “pass this bill which is going to codify the whole plot.”\nThe House Judiciary Committee is considering H.R.",
    "author": "Blarp Blog",
    "title": "Watch: Jim Jordan Slams Jerry Nadler as Democrats Try to ‘Codify’ School Board Domestic Terrorist ‘Scheme’ into Law"
  },
  {
    "id": 10742,
    "mediaId": 2594,
    "date": "2022-03-18",
    "sentence": "“This is what the Democrats are focused on,\" said Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "Via AP news wire",
    "title": "House passes bill to prohibit discrimination based on hair"
  },
  {
    "id": 10766,
    "mediaId": 2644,
    "date": "2022-03-18",
    "sentence": "“It’s important to the young girls and the young boys who have to cut their hair in the middle of a wrestling match in front of everyone because some white referee says that your hair is inappropriate to engage in your match.”\nMost Republicans called the legislation unnecessary, with Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) saying, “This is what Democrats are focused on.",
    "author": "Callie Patteson",
    "title": "House passes CROWN Act banning discrimination based on hairstyle, texture"
  },
  {
    "id": 10781,
    "mediaId": 2644,
    "date": "2022-03-18",
    "sentence": "Rep. Lauren Boebert (R-Colo.) raged on Twitter: “Now that the New York Times has even confirmed the Hunter Biden laptop’s veracity, can we begin to admit that Joe Biden is, by definition, a compromised politician?”\nMeanwhile, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) tweeted a link to a Post story on the Times’ confirmation, saying simply: “Told ya.”\nAnd the House Judiciary GOP linked the laptop scandal to claims by Democrats that former President Donald Trump colluded with Russia ahead of the 2016 presidential election.",
    "author": "Emily Crane",
    "title": "GOP fury at Big Tech, Dems after NYT admits Hunter Biden laptop is real"
  },
  {
    "id": 10795,
    "mediaId": 2526,
    "date": "2022-03-18",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) March 17, 2022\nLast week, the TSA announced the decision to extend the mask mandate — which was set to expire Friday, March 18 — another month.",
    "author": "Hannah Bleau",
    "title": "Jim Jordan: ‘End’ the TSA Mask Mandate"
  },
  {
    "id": 11464,
    "mediaId": 2861,
    "date": "2022-03-18",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) March 18, 2022\nYahoo reporter Michael Isikoff was mocked by conservatives for tweeting Thursday “In the category of – didn’t see this coming : The ?",
    "author": "",
    "title": "Rep. Jordan “Hunter Biden’s laptop was real. The emails were real. The eyewitness was real.”"
  },
  {
    "id": 13579,
    "mediaId": 8480,
    "date": "2022-03-19",
    "sentence": "“This is what the Democrats are focused on,” said Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "Associated Press",
    "title": "House passes bill to prohibit discrimination based on hair"
  },
  {
    "id": 9652,
    "mediaId": 2909,
    "date": "2022-03-20",
    "sentence": "",
    "author": "Deneen Borelli",
    "title": "Liberal Media Silent Over Hunter Biden Laptop – Again"
  },
  {
    "id": 9642,
    "mediaId": 2573,
    "date": "2022-03-21",
    "sentence": "",
    "author": "",
    "title": "Rep. Ken Buck leads letter to DOJ demanding action on surging retail crime"
  },
  {
    "id": 9484,
    "mediaId": 2699,
    "date": "2022-03-22",
    "sentence": "Later on the podcast, Molly makes predictions about the midterms—“Benghazi on steroids… It’s going to be the worst two fucking years of our lives.”\nShe gets more insight on impending midterm shittiness from NBC News political analyst Susan Del Percio, mainly because Del Percio has a very scary midterm prediction involving <span class='selected-term'>Jim Jordan</span>.",
    "author": "The Daily Beast",
    "title": "Josh Hawley Is on the Verge of Being ‘Senator From QAnon’"
  },
  {
    "id": 9302,
    "mediaId": 2724,
    "date": "2022-03-22",
    "sentence": "“Let’s get to the facts, let’s figure out exactly how much Joe Biden knew about this,” Representative <span class='selected-term'>Jim Jordan</span> (R-OH) told Fox News at the time as he called for a special counsel investigation into the business dealings revealed by the discovery of the device.",
    "author": "Rusty Weiss",
    "title": "Bill Barr: Joe Biden ‘Lied To The American People’ About Hunter’s Laptop Being ‘Russian Disinformation’"
  },
  {
    "id": 9366,
    "mediaId": 2877,
    "date": "2022-03-23",
    "sentence": "But the Kremlin can.” —Congressman <span class='selected-term'>Jim Jordan</span>\nNon Compos Mentis Awards\n“I can’t.",
    "author": "Jordan Candler",
    "title": "Wednesday Short Cuts"
  },
  {
    "id": 9279,
    "mediaId": 2584,
    "date": "2022-03-23",
    "sentence": "Multiple reporters have placed Brooks with other far-right Republicans including Marjorie Taylor Greene of Georgia and <span class='selected-term'>Jim Jordan</span> of Ohio in White House meetings with Trump.",
    "author": "Martin Pengelly",
    "title": "Republican says Trump asked him to ‘rescind’ 2020 election and remove Biden from office"
  },
  {
    "id": 9507,
    "mediaId": 2589,
    "date": "2022-03-23",
    "sentence": "I’ll bet every populist in the House GOP caucus, from <span class='selected-term'>Jim Jordan</span> to Paul Gosar to Matt Gaetz to Marjorie Taylor Greene and on down, has had to field the same request from Trump at one point or another.",
    "author": "Allahpundit",
    "title": "Mo Brooks turns on Trump: He pushed me to \"rescind\" the 2020 results, remove Biden, and reinstate him as president"
  },
  {
    "id": 9454,
    "mediaId": 2744,
    "date": "2022-03-23",
    "sentence": "Republican Rep. Jim Banks, who along with Rep. <span class='selected-term'>Jim Jordan</span> had been selected by GOP Majority Leader Kevin McCarthy to serve on the Capitol riot committee only to be rejected by Democratic House Speaker Nancy Pelosi, critiqued Buckley’s leadership position.",
    "author": "Jerry Dunleavy",
    "title": "Democratic staffer on Jan. 6 committee was part of intel effort to help Biden out of Hunter jam"
  },
  {
    "id": 9475,
    "mediaId": 2728,
    "date": "2022-03-23",
    "sentence": "Other Republicans involved in the effort to overturn the 2020 election — Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania — have refused requests from the panel for interviews.",
    "author": "Luke Broadwater",
    "title": "Mo Brooks says Donald Trump asked him to illegally ‘rescind’ the 2020 election"
  },
  {
    "id": 8942,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Matthew Boyle",
    "title": "Exclusive — Kevin McCarthy: Dozens of ‘Preservation Notices’ Being Sent Across Government, Setting Stage for GOP Investigative Clash with Biden After Midterms"
  },
  {
    "id": 9613,
    "mediaId": 2636,
    "date": "2022-03-23",
    "sentence": "Other Republicans involved in the effort to overturn the 2020 election — Representatives <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania — have refused requests from the panel for interviews.",
    "author": "",
    "title": "House Republican Says Trump Asked Him to Illegally ‘Rescind’ 2020 Election"
  },
  {
    "id": 9775,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "She added that Republicans plan to fire “lame duck” House Speaker Nancy Pelosi (D-NY) “once and for all.”\nThe Task Force Leaders of each topic are as follows:\nJobs and the Economy: Rep. Patrick McHenry (R-NC)\nBig Tech Censorship and Data: Rep. Cathy Rodgers (WA)\nFuture of American Freedoms: Rep. <span class='selected-term'>Jim Jordan</span> (R-OH)\nEnergy, Climate and Conservation: Rep. Garret Graves (R-LA)\nAmerican Security: Rep. John Katko (R-NY)\nHealthy Futures: Rep. Brett Guthrie (R-KY) and Rep. Vern Buchanan (R-FL)\nChina Accountability: Rep. Michael McCaul (R-TX)\nDuring the press conference, each Republican member provided a brief preview of the agenda items of their task force .",
    "author": "Hannah Bleau",
    "title": "House Republican Leadership Announces Taskforce Leaders to Fix Biden’s Failures"
  },
  {
    "id": 9790,
    "mediaId": 2509,
    "date": "2022-03-23",
    "sentence": "A spokesman for the panel, which has requested testimony from GOP Reps. Kevin McCarthy of California, <span class='selected-term'>Jim Jordan</span> of Ohio, and Scott Perry of Pennsylvania, declined to comment.",
    "author": "Benjamin Siegel",
    "title": "Trump repeatedly pressed to 'remove' Biden, 'rescind' 2020 election results, GOP lawmaker says"
  },
  {
    "id": 8886,
    "mediaId": 2572,
    "date": "2022-03-24",
    "sentence": "Ohio Congressman <span class='selected-term'>Jim Jordan</span>, ranking member of House Judiciary, is right in the middle of all this and joins me now.",
    "author": "",
    "title": "'The Ingraham Angle' on Kamala Harris, Ketanji Brown Jackson"
  },
  {
    "id": 8970,
    "mediaId": 2745,
    "date": "2022-03-24",
    "sentence": "She wrote, “House and Senate guys are pathetic too... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy.” She appeared to be referring to Republican House members Louie Gohmert of Texas, <span class='selected-term'>Jim Jordan</span> of Ohio, Paul A. Gosar of Arizona and Chip Roy of Texas.",
    "author": "",
    "title": "Virginia Thomas urged White House chief to pursue unrelenting efforts to overturn the 2020 election, texts show"
  },
  {
    "id": 9502,
    "mediaId": 2748,
    "date": "2022-03-24",
    "sentence": "She added that Republicans plan to fire “lame duck” House Speaker Nancy Pelosi (D-NY) “once and for all.”\nThe Task Force Leaders of each topic are as follows:\nJobs and the Economy: Rep. Patrick McHenry (R-NC)\nBig Tech Censorship and Data: Rep. Cathy Rodgers (WA)\nFuture of American Freedoms: Rep. <span class='selected-term'>Jim Jordan</span> (R-OH)\nEnergy, Climate and Conservation: Rep. Garret Graves (R-LA)\nAmerican Security: Rep. John Katko (R-NY)\nHealthy Futures: Rep. Brett Guthrie (R-KY) and Rep. Vern Buchanan (R-FL)\nChina Accountability: Rep. Michael McCaul (R-TX)\nDuring the press conference, each Republican member provided a brief preview of the agenda items of their task force .",
    "author": "Blarp Blog",
    "title": "House Republican Leadership Announces Taskforce Leaders to Fix Biden’s Failures"
  },
  {
    "id": 9340,
    "mediaId": 2726,
    "date": "2022-03-24",
    "sentence": "\"House and Senate guys are pathetic too ... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy,\" wrote Thomas, appearing to refer to Reps. Louie Gohmert, <span class='selected-term'>Jim Jordan</span>, Paul Gosar, and Chip Roy.",
    "author": "Cheryl Teh",
    "title": "Clarence Thomas' wife urged Mark Meadows to rally Republicans around Trump after the 2020 election and get those who hung on Trump's 'coattails' to pitch in"
  },
  {
    "id": 9378,
    "mediaId": 2548,
    "date": "2022-03-25",
    "sentence": "(RELATED: ‘The News Was Fake’: Rep. <span class='selected-term'>Jim Jordan</span> Takes Shots The Media For Disavowing Hunter Biden’s Laptop)\n“I would like to announce on behalf of the American people, we have to make sure that our leaders are held accountable,” Greene said.",
    "author": "Nicole Silverio",
    "title": "Rep. Jim Jordan Says Republicans Need To Discuss Possible Impeachment Of Biden"
  },
  {
    "id": 9567,
    "mediaId": 2644,
    "date": "2022-03-25",
    "sentence": "If it’s constitutional, that’s what his job should be — it’s him.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), who was seated next to McCarthy at the event, agreed with the minority leader, saying, “Totally.”\nWhile Wyden remains the only lawmaker to call on Thomas to recuse himself, several legal experts have made similar comments.",
    "author": "Callie Patteson",
    "title": "Clarence Thomas called to recuse himself over wife’s alleged texts"
  },
  {
    "id": 9034,
    "mediaId": 8484,
    "date": "2022-03-25",
    "sentence": "She also took aim at Republican lawmakers who refused to support Trump, as evidenced by a message seemingly referencing GOP Reps. Louie Gohmert of Texas, <span class='selected-term'>Jim Jordan</span> of Ohio, Paul A. Gosar of Arizona and Chip Roy of Texas.",
    "author": "Morgan Phillips",
    "title": "Supreme Court justice Clarence Thomas, 73, is discharged from hospital a week after he was admitted for 'flu-like symptoms' and treated with antibiotics for an infection"
  },
  {
    "id": 9165,
    "mediaId": 2745,
    "date": "2022-03-25",
    "sentence": "“If you’ve spent any time studying the Supreme Court justice, he’s the one who studies correctly.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) — who McCarthy said will become chair of the House Judiciary Committee if Republicans regain the majority in this year’s midterm elections — said he “totally” agreed with McCarthy’s assessment.",
    "author": "",
    "title": "Ethics experts see Ginni Thomas’s texts as a problem for Supreme Court"
  },
  {
    "id": 9755,
    "mediaId": 2753,
    "date": "2022-03-25",
    "sentence": "Future of American Freedoms\nThe Biden administration has put American freedoms in jeopardy, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, said.",
    "author": "WND News Services",
    "title": "GOP lawmakers cite 7 ways the left has failed Americans"
  },
  {
    "id": 9604,
    "mediaId": 2634,
    "date": "2022-03-25",
    "sentence": "The committee has asked Congressmen Scott Perry and <span class='selected-term'>Jim Jordan</span> to answer questions, and both lawmakers have declined its invitations.",
    "author": "Daniel Strauss",
    "title": "January 6 Recap: Committee Ratchets Up the Pressure on Two Key Trumpies"
  },
  {
    "id": 9605,
    "mediaId": 2695,
    "date": "2022-03-26",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R – Ohio) currently serves as the top Republican on the House Judiciary Committee and is positioned to take control of the committee in 2023 should the Republican Party retake control of Congress.",
    "author": "Samuel Mangold-Lenett",
    "title": "Rep. Jim Jordan indicates that Republicans are open to impeaching Biden if they retake Congress in 2022"
  },
  {
    "id": 8930,
    "mediaId": 2526,
    "date": "2022-03-26",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) told the Washington Times at the Republican retreat in Florida this week.",
    "author": "Wendell Husebø",
    "title": "Top Republicans Consider Impeaching Joe Biden After Midterm Elections"
  },
  {
    "id": 9408,
    "mediaId": 2642,
    "date": "2022-03-26",
    "sentence": "",
    "author": "Missy Crane",
    "title": "Richard Grenell Announces Big News On The Hunter Biden Saga"
  },
  {
    "id": 9403,
    "mediaId": 2671,
    "date": "2022-03-26",
    "sentence": "“Just look at the border,” <span class='selected-term'>Jim Jordan</span> tells the Washington Times.",
    "author": "Fred T",
    "title": "DO IT!!! Jim Jordan says GOP should IMPEACH Biden after taking the House BACK in November"
  },
  {
    "id": 9109,
    "mediaId": 2643,
    "date": "2022-03-27",
    "sentence": "Several Republican lawmakers in the U.S. criticized Biden for his comment, with Ohio Representative <span class='selected-term'>Jim Jordan</span> calling it \"war-triggering,\" while Indiana Senator Jim Risch said it was a \"horrendous gaffe.\"",
    "author": "Natalie Colarossi",
    "title": "Macron Warns Biden Against Escalating Ukraine War With 'Words or Actions'"
  },
  {
    "id": 9127,
    "mediaId": 2557,
    "date": "2022-03-27",
    "sentence": "Full stop.” pic.twitter.com/KDL1r3BmDV\n— The Recount (@therecount) March 27, 2022\nRepublican Rep. <span class='selected-term'>Jim Jordan</span> said Biden’s speech in Poland Saturday night was “more than confusing, it’s dangerous.”\n“Here’s the president potentially having more war-triggering type language than probably any president in American,” Jordan warned.",
    "author": "DML News App",
    "title": "WATCH: World leader joins lawmakers scolding Biden for escalating tensions with Russia"
  },
  {
    "id": 9646,
    "mediaId": 6404,
    "date": "2022-03-27",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) told the Washington Times at the Republican retreat in Florida this week.",
    "author": "Mike LaChance",
    "title": "Republicans Already Discussing Possibility Of Impeaching Biden After The Midterms"
  },
  {
    "id": 9656,
    "mediaId": 2636,
    "date": "2022-03-27",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> of Ohio, dressed down in a fleece vest, stood in one corner while Representative Marjorie Taylor Greene of Georgia hustled in and out of the reception area.",
    "author": "",
    "title": "Elise Stefanik, Reinvented in Trump’s Image, Embodies a Changed G.O.P."
  },
  {
    "id": 9672,
    "mediaId": 2748,
    "date": "2022-03-27",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) told the Washington Times at the Republican retreat in Florida this week.",
    "author": "Blarp Blog",
    "title": "Top Republicans Consider Impeaching Joe Biden After Midterm Elections"
  },
  {
    "id": 9653,
    "mediaId": 2562,
    "date": "2022-03-28",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> to Newsmax: Food Shortage Talks Shows Biden Has 'Screwed Things Up' (Newsmax's \"Stinchfield\")\nBy Jack Gournell | Monday, 28 March 2022 10:52 PM\nAmid a potential incoming food shortage, Rep. Jim Jordan, R-Ohio, told Newsmax that in every domain, the Biden administration has \"screwed things up.\"",
    "author": "NationalWatch",
    "title": "Rep. Jim Jordan to Newsmax: Food Shortage Talks Shows Biden Has ‘Screwed Things Up’"
  },
  {
    "id": 9042,
    "mediaId": 2557,
    "date": "2022-03-28",
    "sentence": "Full stop.” pic.twitter.com/KDL1r3BmDV\n— The Recount (@therecount) March 27, 2022\nRepublican Rep. <span class='selected-term'>Jim Jordan</span> said Biden’s speech in Poland Saturday night was “more than confusing, it’s dangerous.”\n“Here’s the president potentially having more war-triggering type language than probably any president in American,” Jordan warned.",
    "author": "DML News App",
    "title": "BREAKING: Biden: ‘I’m not walking anything back’ on whether Putin should be in power"
  },
  {
    "id": 9059,
    "mediaId": 2641,
    "date": "2022-03-28",
    "sentence": "Amid a potential incoming food shortage, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax that in every domain, the Biden administration has \"screwed things up.\"",
    "author": "Jack Gournell",
    "title": "Rep. Jim Jordan to Newsmax: Food Shortage Talks Shows Biden Has 'Screwed Things Up'"
  },
  {
    "id": 8927,
    "mediaId": 2526,
    "date": "2022-03-28",
    "sentence": "When it came to the National School Board Association letter, those were questions that I asked on the House Intelligence Committee that <span class='selected-term'>Jim Jordan</span> then followed up with on the Committee on the Judiciary really probing.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Elise Stefanik on Biden Family Subpoenas: ‘I Would Support Those’"
  },
  {
    "id": 9379,
    "mediaId": 2553,
    "date": "2022-03-28",
    "sentence": "So you get the worst of all possible worlds.” Cotton added that the pattern of Biden making problematic off-script remarks was “not reassuring for our safety or to our allies.”\nOhio Republican Congressman <span class='selected-term'>Jim Jordan</span> expressed his concerns late Saturday, warning that Biden’s comments were not just confusing, but that they were actually dangerous.",
    "author": "John Rigolizzo",
    "title": "‘Worst Of All Possible Worlds’: Tom Cotton, Jim Jordan, Other GOP Leaders Blast Biden For ‘Horrendous Gaffe’ In Poland Speech"
  },
  {
    "id": 9370,
    "mediaId": 2748,
    "date": "2022-03-29",
    "sentence": "When it came to the National School Board Association letter, those were questions that I asked on the House Intelligence Committee that <span class='selected-term'>Jim Jordan</span> then followed up with on the Committee on the Judiciary really probing.",
    "author": "Blarp Blog",
    "title": "Exclusive — Elise Stefanik on Biden Family Subpoenas: ‘I Would Support Those’"
  },
  {
    "id": 9406,
    "mediaId": 2509,
    "date": "2022-03-29",
    "sentence": "Trump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other lawmakers.",
    "author": "MARY CLARE JALONICK",
    "title": "8-hour gap in Trump's Jan. 6 White House phone records"
  },
  {
    "id": 9572,
    "mediaId": 2898,
    "date": "2022-03-29",
    "sentence": "Trump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other lawmakers.",
    "author": "",
    "title": "Jan. 6 House panel missing roughly 8 hours of Trump’s phone calls"
  },
  {
    "id": 9108,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "Other previously reported phone calls that did not show up on the White House logs include a phone call with Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), a heated exchange with House minority leader Kevin McCarthy (R-CA) and a conversation with Sen. Tommy Tuberville (R-AL).",
    "author": "Travis Gettys",
    "title": "Handwritten notes may reveal 'unknown person' in last Trump call before mysterious seven-hour gap"
  },
  {
    "id": 8999,
    "mediaId": 2526,
    "date": "2022-03-29",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) said last week.",
    "author": "Wendell Husebø",
    "title": "Poll: Trump Leads Biden by 6 Points in 2024 Potential Matchup"
  },
  {
    "id": 9769,
    "mediaId": 2707,
    "date": "2022-03-29",
    "sentence": "Trump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other lawmakers.",
    "author": "The Associated Press",
    "title": "Jan. 6 panel IDs 8-hour gap in Trump phone records"
  },
  {
    "id": 9689,
    "mediaId": 2608,
    "date": "2022-03-29",
    "sentence": "The records show that Trump was on the phone nearly nonstop from 8:23 a.m. until 11:06 a.m. During that time, he spoke with adviser Steve Bannon, who on a Jan. 5 podcast said “all hell is going to break loose tomorrow.” Trump also spoke with Rudy Giuliani, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), adviser Stephen Miller, and others.",
    "author": "Marisa Sarnoff",
    "title": "White House Phone Logs Provided to Jan. 6 Committee Contain Unexplained Eight-Hour Gap: Report"
  },
  {
    "id": 9696,
    "mediaId": 2627,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Steve Benen",
    "title": "Why it matters that Jim Jordan is talking about impeaching Biden"
  },
  {
    "id": 9706,
    "mediaId": 2694,
    "date": "2022-03-30",
    "sentence": "PSYOP.”\nThe communications between Meadows and Thomas disclosed her anger that so few Republicans were rallying behind Trump in the way that Representatives Louie Gohmert, <span class='selected-term'>Jim Jordan</span>, Paul Gosar, and Chip Roy were.",
    "author": "Peter Wehner",
    "title": "A Glimpse Into a Fearful, Angry, Imaginary World"
  },
  {
    "id": 9140,
    "mediaId": 2547,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, a possible collaborator with Trump on January 6, defended Ginni Thomas' explosive texts with Mark Meadows during the insurrection by claiming she was only advocating for her opinions while the US Capitol was under attack.",
    "author": "John Amato",
    "title": "Jim Jordan Hyperventilates Trying To Defend Ginni Thomas"
  },
  {
    "id": 9538,
    "mediaId": 2646,
    "date": "2022-03-30",
    "sentence": "The 9:16 AM call came after a call to then-Vice President Mike Pence – at 9:02 AM, and before a call at 9:24 AM to Congressman <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Ty Ross",
    "title": "LOSE MY NUMBER: McConnell revealed to have rejected Trump calls on Jan. 6th"
  },
  {
    "id": 9460,
    "mediaId": 2861,
    "date": "2022-03-30",
    "sentence": "Appearing with Eric Bolling, Rep. <span class='selected-term'>Jim Jordan</span> declared “This is worst Presidency certainly in our lifetimes, maybe in history.”\n.",
    "author": "",
    "title": "WATCH: Jim Jordan says Biden may be the worst President in History"
  },
  {
    "id": 9304,
    "mediaId": 2627,
    "date": "2022-03-30",
    "sentence": "Late last year, the House select committee investigating the Jan. 6 attack took a bold step: The panel asked three Republican members of Congress — Pennsylvania’s Scott Perry, Ohio’s <span class='selected-term'>Jim Jordan</span>, and California’s Kevin McCarthy — to voluntarily cooperate with investigators.",
    "author": "Steve Benen",
    "title": "After being scorned by Trump, will Brooks answer Jan. 6 questions?"
  },
  {
    "id": 9293,
    "mediaId": 2584,
    "date": "2022-03-30",
    "sentence": "“Here’s the thing: we know the former president spoke to people like Kevin McCarthy and <span class='selected-term'>Jim Jordan</span> during those seven hours and 37 minutes,” Colbert said.",
    "author": "Adrian Horton",
    "title": "Stephen Colbert on Trump’s missing phone logs: ‘A poorly executed cover-up’"
  },
  {
    "id": 9531,
    "mediaId": 2727,
    "date": "2022-03-31",
    "sentence": "I will call out people like Rep. <span class='selected-term'>Jim Jordan</span> and Matt Gaetz and the like for their dangerous libel and the manipulative manner that they are subverting the democracy they are sworn to uphold.",
    "author": "",
    "title": "I’m sticking with AIPAC. You should too!"
  },
  {
    "id": 7854,
    "mediaId": 2523,
    "date": "2022-03-31",
    "sentence": "By her account, when McCarthy told Trump it was his own supporters breaking into the building, Trump responded: “Well, Kevin, I guess these people are more upset about the election than you are.”\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "The Associated Press",
    "title": "Mapping out Donald Trump’s 8-hour gap in the phone records"
  },
  {
    "id": 7455,
    "mediaId": 2727,
    "date": "2022-03-31",
    "sentence": "(Senate Television via AP)\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "Colleen Long",
    "title": "A minute-by-minute of Trump’s 8-hour gap during the storming of the US Capitol"
  },
  {
    "id": 7477,
    "mediaId": 2548,
    "date": "2022-03-31",
    "sentence": "In this episode, Vince and Jason sit down with Ohio Republican Representative <span class='selected-term'>Jim Jordan</span> to discuss invoking the 25th amendment on Joe Biden, Trump vs. Biden on the border and inflation crises’, and some extreme Hunter Biden drama.",
    "author": "",
    "title": "Invoking The 25th Amendment & Hunter Biden Drama | Guest Rep. Jim Jordan | Vince & Jason Save The Nation"
  },
  {
    "id": 7520,
    "mediaId": 5329,
    "date": "2022-03-31",
    "sentence": "By her account, when McCarthy told Trump it was his own supporters breaking into the building, Trump responded: “Well, Kevin, I guess these people are more upset about the election than you are.”\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "Colleen Long",
    "title": "Trump’s 8-hour gap: Minute-by-minute during Jan. 6 riot"
  },
  {
    "id": 7800,
    "mediaId": 2560,
    "date": "2022-03-31",
    "sentence": "By her account, when McCarthy told Trump it was his own supporters breaking into the building, Trump responded: “Well, Kevin, I guess these people are more upset about the election than you are.”\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "Colleen Long",
    "title": "Trump’s 8-hour gap: Minute-by-minute during Jan. 6 riot"
  },
  {
    "id": 7766,
    "mediaId": 2563,
    "date": "2022-03-31",
    "sentence": "Congressman <span class='selected-term'>Jim Jordan</span> said, “the mainstream press, along with Big Tech and Democrats, all colluded to keep this important information from the American people just days before our most important election, the presidential election.” That about sums it up.",
    "author": "The Daily Skirmish - Liberato.US",
    "title": "The ‘Laptop from Hell’ Burns Our Devilish Elites"
  },
  {
    "id": 7572,
    "mediaId": 2707,
    "date": "2022-03-31",
    "sentence": "By her account, when McCarthy told Trump it was his own supporters breaking into the building, Trump responded: “Well, Kevin, I guess these people are more upset about the election than you are.”\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "The Associated Press",
    "title": "Mapping out Donald Trump’s 8-hour gap in the phone records"
  },
  {
    "id": 7568,
    "mediaId": 2654,
    "date": "2022-03-31",
    "sentence": "By her account, when McCarthy told Trump it was his own supporters breaking into the building, Trump responded: “Well, Kevin, I guess these people are more upset about the election than you are.”\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "Colleen Long",
    "title": "Piecing together Donald Trump’s 8-hour gap during Jan. 6 insurrection"
  },
  {
    "id": 7130,
    "mediaId": 2631,
    "date": "2022-03-31",
    "sentence": "Everybody’s concerned about that story,” said Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, a Trump loyalist who is likely to chair the Judiciary Committee if Republicans win the House back in November.",
    "author": "",
    "title": "Republicans squirm as Trump presses Putin for dirt on Bidens"
  },
  {
    "id": 7156,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Thursday that if Republicans take back the House this year, they will answer the two \"why\" questions on the Hunter Biden laptop story.",
    "author": "Luca Cacciatore",
    "title": "Rep. Jim Jordan: Big Tech, Big Media Colluded to Censor Hunter Biden Story"
  },
  {
    "id": 7263,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "On Tuesday, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, hailed Burkov's initial capture as a major coup for U.S. law officials.",
    "author": "Jason Clemons",
    "title": "Russian Hacker's Mysterious Status Raises Concerns of US Cyberattack"
  },
  {
    "id": 7243,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "In letters posted on Twitter, 10 Republicans, led by Rep. <span class='selected-term'>Jim Jordan</span>, the ranking member of the House Judiciary Committee, wrote to Facebook CEO Mark Zuckerberg and Parag Agrawal, Twitter's CEO.",
    "author": "Jeffrey Rodack",
    "title": "House Republicans Probing Big Tech 'Suppression' of Hunter Biden Laptop Story"
  },
  {
    "id": 7383,
    "mediaId": 2662,
    "date": "2022-03-31",
    "sentence": "“Big Tech, Big Democrat Party and Big Media all colluded to keep critical information from the American people in the run up to the most important election we have — the presidential election, so we’re launching an investigation,” <span class='selected-term'>Jim Jordan</span> said.",
    "author": "Cristina Laila",
    "title": "House Judiciary Republicans Launch Investigation Into Facebook and Twitter For Blocking Links to Hunter Biden’s Laptop From Hell Story"
  },
  {
    "id": 7378,
    "mediaId": 2526,
    "date": "2022-03-31",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> said last week.",
    "author": "Wendell Husebø",
    "title": "Democrat Insiders Fear ‘Screwing Up’ Midterms: ‘G**dammit Man, It’s So Infuriating’"
  },
  {
    "id": 7393,
    "mediaId": 2651,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Pamela Geller",
    "title": "House Judiciary launches investigation into Facebook, Twitter over Hunter Biden coverup"
  },
  {
    "id": 7178,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> speculated last week.",
    "author": "Wendell Husebø",
    "title": "Poll: 76 Percent Disapprove of Democrat-Controlled Congress"
  },
  {
    "id": 7216,
    "mediaId": 2641,
    "date": "2022-04-01",
    "sentence": "His comments come after 10 committee Republicans, led by ranking member Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, wrote to Twitter CEO Parag Agrawal and Facebook CEO Mark Zuckerberg, quoting a 2020 article from The New York Post about Hunter Biden's laptop and noting that mainstream outlets like The Washington Post, The New York Times and others are now reporting on the matter.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Steube to Newsmax: GOP Will Win, Subpoena Big Tech on Hunter Biden"
  },
  {
    "id": 7794,
    "mediaId": 2644,
    "date": "2022-04-01",
    "sentence": "Bill sponsor Rep. Jerry Nadler (D-NY) urged colleagues to support the MORE Act, saying Friday, “This bill will greatly reduce crime by redefining as not crimes things that are now considered crimes and by releasing people in jail who should not be in jail.”\nBut Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said Democrats called the vote because they “can’t deal” with other problems, such as inflation and illegal immigration, both at four-decade highs.",
    "author": "Steven Nelson",
    "title": "House votes to legalize marijuana despite Biden opposition"
  },
  {
    "id": 7507,
    "mediaId": 2745,
    "date": "2022-04-01",
    "sentence": "… Let’s focus on the things that matter,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said.",
    "author": "",
    "title": "House passes bill decriminalizing marijuana; Senate fortunes unclear"
  },
  {
    "id": 7460,
    "mediaId": 2590,
    "date": "2022-04-01",
    "sentence": "“Every major urban area has increased crime and Democrats are legalizing drugs and propping up the marijuana industry,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said on the House floor.",
    "author": "Arthur Delaney",
    "title": "House Passes Marijuana Decriminalization Bill"
  },
  {
    "id": 7420,
    "mediaId": 2766,
    "date": "2022-04-01",
    "sentence": "Signing the letter were Reps. <span class='selected-term'>Jim Jordan</span>, Steve Chabot, Louie Gohmert, Darrell Issa, Ken Buck, Matt Gaetz, Mike Johnson, Andy Biggs, Tom McClintock, W. Gregory Steube and others.",
    "author": "Bob Unruh",
    "title": "GOP Launches Review Of Facebook’s Censorship Of Hunter Biden Scandal"
  },
  {
    "id": 7821,
    "mediaId": 6621,
    "date": "2022-04-01",
    "sentence": "",
    "author": "",
    "title": "HIGH ON THE HILL: House Votes 220-204 to Legalize Marijuana Federally, Faces Opposition in the Senate"
  },
  {
    "id": 7733,
    "mediaId": 2650,
    "date": "2022-04-02",
    "sentence": "The thinking: It will be much easier to blunt the RINO impulse with <span class='selected-term'>Jim Jordan</span> as Speaker and somebody like Marsha Blackburn helming the Senate.",
    "author": "Mark Ellis",
    "title": "Is Conservative Commentary Getting Too Cocky About the Midterms?"
  },
  {
    "id": 7725,
    "mediaId": 2833,
    "date": "2022-04-02",
    "sentence": "The letter concludes, “This irresponsible conduct demands a thorough investigation so that we may understand how Big Tech wields its enormous power over the free flow of information to the detriment of free and fair elections.”\nAppearing on Fox Business Thursday, ranking GOP Rep <span class='selected-term'>Jim Jordan</span> declared that “Big Tech, Big Democrat Party and Big Media all colluded to keep critical information from the American people in the run up to the most important election we have — the presidential election, so we’re launching an investigation.”\nWatch:",
    "author": "Sean Adl-Tabatabai",
    "title": "Congress Launches Investigation Into Facebook & Twitter for Censoring Hunter Biden Pedophile Story"
  },
  {
    "id": 7139,
    "mediaId": 2557,
    "date": "2022-04-03",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) April 1, 2022\nThe Media Research Center pointed out that none of the “fact-checkers” on social media have updated their “checks” on the Hunter Biden laptop scandal.",
    "author": "DML News App",
    "title": "REPORT: Republicans take victory lap after media confirms Hunter Biden laptop"
  },
  {
    "id": 7211,
    "mediaId": 2547,
    "date": "2022-04-04",
    "sentence": "",
    "author": "John Amato",
    "title": "Border Patrol Council Embraces 'Great Replacement' Theory To Criticize Biden"
  },
  {
    "id": 7268,
    "mediaId": 2526,
    "date": "2022-04-04",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> said two weeks ago in relation to winning back the House.",
    "author": "Wendell Husebø",
    "title": "Democrat Strategist: U.S. Has ‘Lost Confidence’ in Joe Biden, ‘Heading into a Recession’"
  },
  {
    "id": 7175,
    "mediaId": 2664,
    "date": "2022-04-05",
    "sentence": "Among those present were Mr. Gosar, Mr. Biggs, Mr. Brooks, Ms. Greene, and Representatives <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania, who were deeply involved in Mr. Trump’s effort to fight the election results,\" the newspaper reported.",
    "author": "Bob Brigham",
    "title": "DOJ’s expanded coup investigation could ensnarl ‘hundreds’ — including GOP members of Congress: NYT"
  },
  {
    "id": 7601,
    "mediaId": 2818,
    "date": "2022-04-05",
    "sentence": "We know he took millions of dollars from energy companies in Ukraine and millions of dollars from companies in China with ties to the Chinese Communist Party,” said Congressman <span class='selected-term'>Jim Jordan</span>.",
    "author": "The First",
    "title": "JORDAN: Hunter Biden ‘Took Millions of Dollars’ from Moscow, Ukraine, Chinese Communists"
  },
  {
    "id": 7530,
    "mediaId": 2557,
    "date": "2022-04-05",
    "sentence": "“<span class='selected-term'>Jim Jordan</span>, my colleagues and I are ready to see this through to the end.”\nThe article goes on to state the following:\nIn the letter, the House Republicans reference a bombshell report from the New York Post published in the weeks leading up to the 2020 presidential election detailing the contents of Hunter Biden’s laptop that suggested he was using his father’s position of power for his own financial gain.",
    "author": "DML News App",
    "title": "REPORT: House Republicans put Hunter Biden’s legal team on notice over business dealings"
  },
  {
    "id": 7910,
    "mediaId": 2548,
    "date": "2022-04-05",
    "sentence": "(RELATED: ‘This Is Intentional’: Rep. <span class='selected-term'>Jim Jordan</span> Rips Biden Administration’s Handling Of Southern Border, COVID-19)\nSources tell me w/ parole releases, the migrants are asked to turn themselves into ICE in a city of their choice.",
    "author": "Nicole Silverio",
    "title": "Video Reportedly Shows ‘Mass Release’ Of Illegal Migrants Into Texas City"
  },
  {
    "id": 7068,
    "mediaId": 2572,
    "date": "2022-04-05",
    "sentence": "\"<span class='selected-term'>Jim Jordan</span>, my colleagues and I are ready to see this through to the end.\"",
    "author": "Andrew Mark Miller",
    "title": "House Republicans send letter to Hunter Biden law firm seeking preservation of records"
  },
  {
    "id": 7552,
    "mediaId": 2701,
    "date": "2022-04-06",
    "sentence": "“The White House has denied that Wolosky was involved in the Afghanistan Central Bank assets deliberations,” acknowledged Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, Mike Johnson, R-La., and Nicole Malliotakis, R-N.Y., in their joint letter sent Tuesday.",
    "author": "Tristan Justice",
    "title": "Did Biden Funnel $3.5 Billion Payout Away From Terror Victims And Toward Ex-Staff? Republicans Demand Answer"
  },
  {
    "id": 7408,
    "mediaId": 6676,
    "date": "2022-04-06",
    "sentence": "But many of Trump’s Republican allies in Congress, including Reps. <span class='selected-term'>Jim Jordan</span> (Ohio), Jim Banks (Ind.",
    "author": "Kelsey Carolan",
    "title": "Trump gets attention for saying he lost election"
  },
  {
    "id": 7599,
    "mediaId": 8484,
    "date": "2022-04-06",
    "sentence": "'President Biden must rescind his executive order and direct these funds into existing mechanisms to ensure that all victims of terrorism are treated fairly,' the letter, signed by Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, Nicole Malliotakis, R-N.Y., and Mike Johnson, R-La., and addressed to chief of staff Ron Klain.",
    "author": "Morgan Phillips",
    "title": "Republicans write to Biden urging him to divide seized Taliban assets equally among 9/11 victims"
  },
  {
    "id": 7602,
    "mediaId": 2744,
    "date": "2022-04-06",
    "sentence": "House Judiciary Committee Republicans, led by Rep. <span class='selected-term'>Jim Jordan</span>, sent letters to each signatory, asking them to “identify all people with whom you communicated about the inception, drafting, editing, signing, publishing, or promotion” of the ex-intelligence officials' letter and directing them to “produce all documents and communications referring or relating to” the public statement.",
    "author": "Jerry Dunleavy",
    "title": "House GOP demand records from ex-intel officials about Hunter Biden laptop letter"
  },
  {
    "id": 7089,
    "mediaId": 2572,
    "date": "2022-04-06",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> said the media peddled fake news about the Bidens as it claimed the Hunter Biden laptop story was \"Russian disinformation\" on \"The Ingraham Angle\" Tuesday.",
    "author": "Hannah Grossman",
    "title": "Jim Jordan on Hunter laptop story: The only thing fake 18 months ago was the news"
  },
  {
    "id": 7067,
    "mediaId": 2572,
    "date": "2022-04-07",
    "sentence": "(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nREP. <span class='selected-term'>JIM JORDAN</span>, (R-OH) HOUSE OVERSIGHT COMMITTEE RANKING MEMBER: We're launching an investigation because the real thing here was how Facebook and Twitter suppressed this information.",
    "author": "Fox News Staff",
    "title": "'Special Report' All-Star Panel on Russian war crime claims"
  },
  {
    "id": 7229,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "Republican Reps. <span class='selected-term'>Jim Jordan</span> of Ohio, Nicole Malliotakis of New York and Mike Johnson of Louisiana signed the letter.",
    "author": "Jeff Mordock",
    "title": "GOP: Move by ex-WH lawyer raises questions about dividing Taliban assets among 9/11 victims"
  },
  {
    "id": 7233,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, who will chair the powerful House Judiciary Committee if Republicans regain control of the House in this year's elections, told Newsmax there will be a \"number of things\" that will come under investigation, including the details behind the discoveries being made about President Joe Biden's son Hunter and the moves to cover up details about his laptop and actions during the 2020 election.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Jordan to Newsmax: GOP Will Investigate Hunter Biden If House Is Won"
  },
  {
    "id": 7379,
    "mediaId": 2550,
    "date": "2022-04-08",
    "sentence": "Incidentally, when the Jan. 6 committee exposed text messages sent by Rep. <span class='selected-term'>Jim Jordan</span> of Ohio to Mark Meadows, Jordan said the same had occurred.",
    "author": "",
    "title": "Trump Jr. pitched 'very simple' plan to White House to overturn 2020 election"
  },
  {
    "id": 7942,
    "mediaId": 2663,
    "date": "2022-04-08",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) April 7, 2022\nJordan, who recently won Donald Trump‘s endorsement in his bid for re-election, was quoting an interview Eric gave earlier this week to NDT’s “Capitol Report” about Hunter Biden’s laptop.",
    "author": "Graham Gremore",
    "title": "Eric Trump is trending because of Jim Jordan so you know something stupid happened"
  },
  {
    "id": 7484,
    "mediaId": 2629,
    "date": "2022-04-09",
    "sentence": "Incidentally, when the Jan. 6 committee exposed text messages sent by Rep. <span class='selected-term'>Jim Jordan</span> of Ohio to Mark Meadows, Jordan said the same had occurred.",
    "author": "Brandi Buchman",
    "title": "'Total Control': Trump Jr. Pushed Coup Plot In November 2020 Texts To Meadows"
  },
  {
    "id": 6057,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> said on Sunday it \"sure seems\" the president's son is on his way to being indicted, though the congressman acknowledged he could not say for certain.",
    "author": "Daniel Chaitin",
    "title": "'Something is up': Jim Jordan spots major shift in Hunter Biden story"
  },
  {
    "id": 6023,
    "mediaId": 2671,
    "date": "2022-04-10",
    "sentence": "Bartiromo had Rep. <span class='selected-term'>Jim Jordan</span> on air this morning, and the two of them delivered maybe the best segment on Hunter Biden and the laptop and Joe Biden complicity that I’ve seen on TV news.",
    "author": "Fred T",
    "title": "MUST SEE: Maria Bartiromo & Jim Jordan DESTROY Dem/Media collusion on Hunter Biden, SLAP Chris Wallace for good measure"
  },
  {
    "id": 5949,
    "mediaId": 6746,
    "date": "2022-04-10",
    "sentence": "According to Ohio Republican Representative for Ohio, <span class='selected-term'>Jim Jordan</span>; he said it was a veiled attempt to take away a possible victory of Donald Trump in 2014 again, cited Florida News.",
    "author": "Ed Forster",
    "title": "January 6 Committee Driven by Political Motives To Prevent Donald Trump From a 2024 White House Bid"
  },
  {
    "id": 5746,
    "mediaId": 2644,
    "date": "2022-04-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> said The Post’s story revealing how Hunter Biden covered expenses for his president dad shows how “involved” Joe Biden was in his son’s shady business dealings.",
    "author": "Mark Moore",
    "title": "GOP Rep. Jordan: Hunter Biden’s text messages ‘tie in the entire family’"
  },
  {
    "id": 5533,
    "mediaId": 2730,
    "date": "2022-04-10",
    "sentence": "No members appointed by the minority party serve on the select committee, since Pelosi blocked House Minority Leader Kevin McCarthy's picks of Reps. Banks and <span class='selected-term'>Jim Jordan</span> (R-OH), leading McCarthy to pull all his picks.",
    "author": "Rebecca Downs",
    "title": "Chris Christie Has a Theory About Liz Cheney"
  },
  {
    "id": 5267,
    "mediaId": 2562,
    "date": "2022-04-10",
    "sentence": "(Spencer Platt/Getty Images)\nBy Sandy Fitzgerald | Sunday, 10 April 2022 01:41 PM\nThe left may be dismissing reports concerning Hunter Biden's old laptop as being conspiracy theories, but the real conspiracy was big tech and big media \"keeping this story from the American people just days before the most important election we have, the election for president of the United States,\" Rep. <span class='selected-term'>Jim Jordan</span> insisted Sunday.",
    "author": "NationalWatch",
    "title": "Rep. Jim Jordan: Tech, Media, Intel Officers Staged Laptop Conspiracy"
  },
  {
    "id": 5234,
    "mediaId": 2641,
    "date": "2022-04-10",
    "sentence": "The left may be dismissing reports concerning Hunter Biden's old laptop as being conspiracy theories, but the real conspiracy was big tech and big media \"keeping this story from the American people just days before the most important election we have, the election for president of the United States,\" Rep. <span class='selected-term'>Jim Jordan</span> insisted Sunday.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Jim Jordan: Tech, Media, Intel Officers Staged Laptop Conspiracy"
  },
  {
    "id": 5208,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Hailey Sanibel",
    "title": "“New Crackdown On Gun Rights”: Joe Biden Is Making His Move Against The Second Amendment"
  },
  {
    "id": 5215,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Miranda Devine",
    "title": "The Biden family scheme unravels"
  },
  {
    "id": 5259,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "John Binder",
    "title": "Exclusive — Andy Biggs: Biden Could Bring 30K Illegal Aliens to U.S. Border Every Day with End of Title 42"
  },
  {
    "id": 5325,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Paul Bois",
    "title": "Elon Musk ‘Has Decided Not’ to Join Twitter’s Board of Directors"
  },
  {
    "id": 5499,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Ramsey Touchberry",
    "title": "Voters blame Putin, oil companies for inflated gas prices, poll says"
  },
  {
    "id": 5751,
    "mediaId": 2681,
    "date": "2022-04-11",
    "sentence": "Top House Republican <span class='selected-term'>Jim Jordan</span> said on Sunday he thinks “something is up” with the MSM’s recent flip-flop on the Hunter Biden laptop story – which was originally branded as Russian disinformation right before the 2020 US election, only to be validated as authentic in recent weeks amid a grand jury investigation into the First Son.",
    "author": "",
    "title": "“Something Is Up”: Rep. Jim Jordan Suggests Hunter Biden Indictment Could Be Coming"
  },
  {
    "id": 5740,
    "mediaId": 2522,
    "date": "2022-04-12",
    "sentence": "SIGN UP HERE\n(Video: Fox News)\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) joined Fox News’ “Fox and Friends” Tuesday and said he believes President Joe Biden was most certainly involved in his son Hunter’s business dealings with foreign entities though the president predictably continues to deny it.",
    "author": "Frank Webster",
    "title": "Jim Jordan vows to expose Joe’s role in corrupt Biden ‘family enterprise’"
  },
  {
    "id": 5876,
    "mediaId": 2690,
    "date": "2022-04-12",
    "sentence": "(TeaParty.org Exclusive) – Top House GOP member <span class='selected-term'>Jim Jordan</span> stated over the weekend that he believes “something is up” with the MSM’s flip-flopping concerning the Hunter Biden laptop story, which the radical left all referred to as “Russian disinformation” just before the 2020 presidential election, only to be confirmed to be authentic as a grand jury continues to investigate the youngest son of Joe Biden.",
    "author": "",
    "title": "‘Something Is Up’: Top House Republican Suggests Hunter Biden Indictment Could Be Coming"
  },
  {
    "id": 5992,
    "mediaId": 2627,
    "date": "2022-04-12",
    "sentence": "It was just two weeks ago, for example, when Ohio Rep. <span class='selected-term'>Jim Jordan</span> — a Republican positioned to chair the House Judiciary Committee — said he wanted to see his party at least begin a conversation about impeaching the president.",
    "author": "Steve Benen",
    "title": "Despite his members’ push, McCarthy hedges on impeachment"
  },
  {
    "id": 5464,
    "mediaId": 2614,
    "date": "2022-04-12",
    "sentence": "While appearing on Fox News, Ohio-based Republican Rep. <span class='selected-term'>Jim Jordan</span> spoke with Brian Kilmeade about how recently uncovered text messages suggest that Joe Biden had “something to do with” his son Hunter’s dealings.",
    "author": "Red Voice Media",
    "title": "Jim Jordan Puts The ‘Baloney’ Intelligence Officials Who Covered For The Biden Crime Family On Notice [VIDEO]"
  },
  {
    "id": 5268,
    "mediaId": 2618,
    "date": "2022-04-12",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) joined Fox News’ “Fox and Friends” Tuesday and said he believes President Joe Biden was most certainly involved in his son Hunter’s business dealings with foreign entities though the president predictably continues to deny it.His statement comes on the heels of a House Oversight Committee’s call for further investigation into the text messages allegedly stored on Hunter Biden’s infamous laptop that was abandoned to a Wilmington, DE, repair shop in 2019.",
    "author": "Frank Webster",
    "title": "Jim Jordan vows to expose Joe’s role in corrupt Biden ‘family enterprise’"
  },
  {
    "id": 5426,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Will",
    "title": "Watch: Abbott’s Buses of Illegals Arrive in DC"
  },
  {
    "id": 5344,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "“I’m Defending the Right to Express Your Views Under the First Amendment” – Alan Dershowitz Speaks Out in Defense of J6er He Is Representing who Was Waved in to US Capitol (Video)"
  },
  {
    "id": 5596,
    "mediaId": 2642,
    "date": "2022-04-14",
    "sentence": "We’re going to look at all those issues because the American people deserve the truth.”\nYou can watch the video below:\nWe need someone like <span class='selected-term'>Jim Jordan</span> in the Speaker role.",
    "author": "Sophie O’Hara",
    "title": "[VIDEO] Jim Jordan Makes a Promise to Voters… Vows to Expose Joe’s Role in “Biden Crime Family Enterprise”"
  },
  {
    "id": 6087,
    "mediaId": 2909,
    "date": "2022-04-19",
    "sentence": "",
    "author": "Tom Borelli",
    "title": "Judge Blocks Biden’s Transportation Mask Mandate"
  },
  {
    "id": 5583,
    "mediaId": 2553,
    "date": "2022-04-20",
    "sentence": "Maybe Obama will beat Special Counsel John Durham to the punch by revealing the truth behind the phony Steele Dossier, the Clinton campaign’s role in the entire affair, and divulging details of who else was involved in what appears to be a cover-up and scandal involving allegations that were, as Congressman <span class='selected-term'>Jim Jordan</span> (R-OH) said on Monday, “it was made up.”\nAt the very least, Obama could apologize to former Trump campaign advisor Carter Page for the fact that FBI agents made “serious errors” that allowed the FISA court to grant the DOJ permission to spy on Page.",
    "author": "Tim Meads",
    "title": "Obama’s Warning About Disinformation Again. Let’s Take A Look At Some Examples, Shall We?"
  },
  {
    "id": 4940,
    "mediaId": 2664,
    "date": "2022-04-20",
    "sentence": "\"The time period during which there is a gap in the phone logs includes at least five calls from or to President Trump whose occurrence has been documented in the public record,\" the letter notes, pointing to his reported correspondence with then-Vice President Mike Pence, House Minority Leader Kevin McCarthy, R-Calif., Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, then-Sen. Kelly Loeffler, R-Ga., and Sen. Mike Lee, R-Utah—who supposedly passed his phone to Sen. Tommy Tuberville, R-Ala.",
    "author": "Jessica Corbett",
    "title": "DOJ faces demands to investigate if Trump 'mutilated or destroyed' records to cover up crimes"
  },
  {
    "id": 5548,
    "mediaId": 2636,
    "date": "2022-04-21",
    "sentence": "The memo for Republicans, prepared by Representative <span class='selected-term'>Jim Jordan</span> of Ohio, the ranking member on the committee, details how the right plans to use the hearing to portray Democrats as pushing “far-left policies” that seek to abolish all immigration enforcement and even “encourage” illegal immigration.",
    "author": "",
    "title": "G.O.P. Memo Shows Road Map for Attacking Democrats on Immigration"
  },
  {
    "id": 5479,
    "mediaId": 2532,
    "date": "2022-04-21",
    "sentence": "Following the court decision blocking the CDC's mask order in transportation, Ohio Republican Congressman <span class='selected-term'>Jim Jordan</span> tweeted that \"Fauci lost.",
    "author": "Alexander Tin",
    "title": "Fauci fears judge's ruling on travel mask mandate may set \"dangerous precedent\""
  },
  {
    "id": 5340,
    "mediaId": 2641,
    "date": "2022-04-21",
    "sentence": "Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Andy Biggs, R-Ariz., were among the letter's signatories.",
    "author": "Eric Mack",
    "title": "House GOP Asks If Hunter Biden Ties Spared Rich Russian From Sanctions"
  },
  {
    "id": 5769,
    "mediaId": 2664,
    "date": "2022-04-21",
    "sentence": "His call for more “free speech” on Twitter is being taken up with enthusiasm by conservatives like US Reps. <span class='selected-term'>Jim Jordan</span> and Lauren Boebert, who see Musk as an ally in turning Twitter into a place where hateful and abusive speech are common and encouraged.",
    "author": "Noah Berlatsky",
    "title": "Elon Musk wants 'his speech to trump everyone else’s'"
  },
  {
    "id": 5754,
    "mediaId": 2562,
    "date": "2022-04-21",
    "sentence": "Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Andy Biggs, R-Ariz., were among the letter's signatories.",
    "author": "NationalWatch",
    "title": "House GOP Asks Why Late Moscow Mayor’s Wife Not Sanctioned"
  },
  {
    "id": 5761,
    "mediaId": 5117,
    "date": "2022-04-22",
    "sentence": "He has tried to temper his closest rivals, Rep. Steve Scalise of Louisiana and Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, even as he works to shore up the votes that would be needed to become speaker.",
    "author": "",
    "title": "Audio reveals GOP leader Kevin McCarthy planned to urge Trump to resign after Jan. 6 attack"
  },
  {
    "id": 5686,
    "mediaId": 6509,
    "date": "2022-04-22",
    "sentence": "Meadows’ former colleague and close friend, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, suggests in a late text on Jan. 5 — the day before Congress was due to certify Joe Biden's electoral victory — that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nPolitics\nPolitics from around the world.",
    "author": "",
    "title": "Official: Meadows Had Been Warned of Possible 1/6 Violence"
  },
  {
    "id": 5756,
    "mediaId": 2934,
    "date": "2022-04-22",
    "sentence": "However, there was no justification for some of the language included in the letter.”\nThe letter noted that the “voices of parents … should and must continue to be heard when it comes to decisions about their children’s education, health, and safety.”\nThe following month, Republican Rep. <span class='selected-term'>Jim Jordan</span> sent a letter to Garland saying that information from a Justice Department whistleblower called into question the accuracy of Garland’s testimony that “the Department of Justice and Federal Bureau of Investigation were not using federal counterterrorism tools to target concerned parents at local school board meetings.”\nJordan said a “protected disclosure” from the whistleblower showed “that the FBI’s Counterterrorism Division is compiling and categorizing threat assessments related to parents, including a document directing FBI personnel to use a specific ‘threat tag’ to track potential investigations.”\nSpecifically, Jordan cited an FBI email that said in response to Garland’s Oct. 4 memo, “the Counterterrorism and Criminal Divisions created a threat tag, EDUOFFICIALS, to track instances of related threats.” It directed FBI offices to apply that threat tag to “investigations and assessments of threats specifically directed against school board administrators, board members, teachers, and staff.”\nAccording to Jordan, “This disclosure provides specific evidence that federal law enforcement operationalized counterterrorism tools at the behest of a left-wing special interest group against concerned parents.”\nBut the email does not say that the FBI ought to apply tags to parents merely speaking out at school board meetings.",
    "author": "Robert Farley",
    "title": "Attorney General Never Called Concerned Parents ‘Domestic Terrorists’"
  },
  {
    "id": 5901,
    "mediaId": 2532,
    "date": "2022-04-22",
    "sentence": "\"The American people deserve answers and accountability for the Biden administration's lawlessness along the southwest border\" Ohio Congressman <span class='selected-term'>Jim Jordan</span>, the top Republican on the Judiciary Committee, said earlier this week when announcing Mayorkas' appearance before the panel on April 28.",
    "author": "Camilo Montoya-Galvez",
    "title": "Mayorkas says U.S. is preparing for \"significant challenges\" along the border, asking countries to accept deportees"
  },
  {
    "id": 6114,
    "mediaId": 2658,
    "date": "2022-04-22",
    "sentence": "Lawmakers who attended meetings, in person or by phone, included Reps. Scott Perry (R-Pa.), Louie Gohmert (R-Texas), <span class='selected-term'>Jim Jordan</span> (R-Ohio), Matt Gaetz (R-Fla.) and numerous members of the House Freedom Caucus, according to Cassidy Hutchinson, an aide to Meadows who provided key testimony about the conversations and meetings Meadows had in December 2020.",
    "author": "",
    "title": "GOP lawmakers were deeply involved in Trump plans to overturn election, new evidence suggests"
  },
  {
    "id": 5960,
    "mediaId": 2548,
    "date": "2022-04-22",
    "sentence": "Republican Ohio Rep. <span class='selected-term'>Jim Jordan</span> said the House needs to consider a possible impeachment of Biden over the large influx of migrants at the U.S.-Mexico border.",
    "author": "Nicole Silverio",
    "title": "‘This Ain’t Your Father’s Republican Party’: Biden Calls The Modern GOP ‘A Different Breed Of Cat’"
  },
  {
    "id": 5978,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "Kevin McCarthy on the phone with @RepLizCheney “I think this will pass, and it would be my recommendation you should resign.” pic.twitter.com/uk0sLDVdoa\n— Jean (@jeanvas5) April 22, 2022\nThis new audio belies McCarthy’s public face on January 6, where he strongly recommended an investigation into the Capitol attacks, then did an about-face after House Speaker Nancy Pelosi rejected the addition of Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Ind.",
    "author": "Jennifer Oliver O'Connell",
    "title": "GOP Leader Kevin McCarthy Caught on Tape; Says He Would Convince Trump That He 'Should Resign'"
  },
  {
    "id": 6020,
    "mediaId": 2679,
    "date": "2022-04-22",
    "sentence": "Meadows’ close friend, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, suggests in a late text on Jan. 5, 2021 — the day before Congress was due to certify Biden’s victory — that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows texted back in the early hours of Jan. 6: “I have pushed for this.",
    "author": "FARNOUSH AMIRI",
    "title": "Official: Meadows had been warned of possible 1/6 violence"
  },
  {
    "id": 5237,
    "mediaId": 2618,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Alexander Connell",
    "title": "Secret Recording: Kevin McCarthy Told Liz Cheney He Would Tell Trump To Resign In Shocking Leaked Audio"
  },
  {
    "id": 5524,
    "mediaId": 2685,
    "date": "2022-04-22",
    "sentence": "",
    "author": "LISA MASCARO",
    "title": "McCarthy, Trump have 'positive' call despite Jan. 6 audio"
  },
  {
    "id": 5199,
    "mediaId": 2680,
    "date": "2022-04-23",
    "sentence": "Meadows’ close friend, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, suggests in a late text on Jan. 5, 2021 — the day before Congress was due to certify Biden's victory — that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows texted back in the early hours of Jan. 6: “I have pushed for this.",
    "author": "FARNOUSH AMIRI",
    "title": "Official: Meadows had been warned of possible 1/6 violence"
  },
  {
    "id": 5139,
    "mediaId": 2631,
    "date": "2022-04-23",
    "sentence": "",
    "author": "",
    "title": "Meadows was warned Jan. 6 could turn violent, former White House official says"
  },
  {
    "id": 5116,
    "mediaId": 2569,
    "date": "2022-04-23",
    "sentence": "Meadows’ close friend, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, suggests in a late text on Jan. 5, 2021 — the day before Congress was due to certify Biden’s victory — that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows texted back in the early hours of Jan. 6: “I have pushed for this.",
    "author": "Associated Press",
    "title": "Official: Meadows had been warned of possible Jan. 6 violence"
  },
  {
    "id": 5086,
    "mediaId": 2644,
    "date": "2022-04-23",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> of Ohio suggests in a late text on Jan. 5 that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows responded to Jordan via text early the next morning.",
    "author": "Jesse O’Neill",
    "title": "Meadows had been warned of possible Jan. 6 violence: official"
  },
  {
    "id": 5176,
    "mediaId": 6656,
    "date": "2022-04-23",
    "sentence": "Among the GOP lawmakers named by Hutchinson as taking part in such discussions were Reps. Scott Perry, R-Pa., Louie Gohmert, R-Texas, <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Matt Gaetz, R-Fla.",
    "author": "Don Jacobson",
    "title": "Ex-aide: GOP lawmakers met with Meadows on Trump's Jan. 6 plans"
  },
  {
    "id": 5151,
    "mediaId": 2594,
    "date": "2022-04-23",
    "sentence": "Mr Meadows’ close friend, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, suggested in a late text on 5 January 2021 that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMr Meadows texted back in the early hours of 6 January: “I have pushed for this.",
    "author": "Bevan Hurley",
    "title": "Trump’s chief of staff was warned of possible violence on 6 January before attack"
  },
  {
    "id": 4987,
    "mediaId": 2738,
    "date": "2022-04-23",
    "sentence": "Professional nuisances and Beavis and Butt-Head lookalikes Matt Gaetz and <span class='selected-term'>Jim Jordan</span> have never been quiet about spreading misinformation about the 2020 election.",
    "author": "Matt Prigge",
    "title": "Matt Gaetz, Jim Jordan, And More Were Reportedly Even More Involved In Plans To Overturn The Election Than Previously Thought"
  },
  {
    "id": 4972,
    "mediaId": 6535,
    "date": "2022-04-23",
    "sentence": "Meadows’ close friend, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, suggests in a late text on Jan. 5, 2021 — the day before Congress was due to certify Biden's victory — that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows texted back in the early hours of Jan. 6: “I have pushed for this.",
    "author": "Farnoush Amiri",
    "title": "Official: Meadows Had Been Warned of Possible 1/6 Violence"
  },
  {
    "id": 4991,
    "mediaId": 6552,
    "date": "2022-04-23",
    "sentence": "Meadows’ close friend, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, suggests in a late text on Jan. 5, 2021 — the day before Congress was due to certify Biden’s victory — that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows texted back in the early hours of Jan. 6: “I have pushed for this.",
    "author": "Associated Press",
    "title": "Meadows had been warned of possible Jan. 6 violence, official says"
  },
  {
    "id": 5042,
    "mediaId": 2632,
    "date": "2022-04-23",
    "sentence": "Meadows’ close friend, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, suggests in a late text on Jan. 5, 2021 — the day before Congress was due to certify Biden's victory — that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows texted back in the early hours of Jan. 6: “I have pushed for this.",
    "author": "Farnoush Amiri",
    "title": "Official: Meadows Had Been Warned of Possible 1/6 Violence"
  },
  {
    "id": 4895,
    "mediaId": 8384,
    "date": "2022-04-23",
    "sentence": "Meadows’ close friend, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, suggests in a late text on Jan. 5, 2021 — the day before Congress was due to certify Biden’s victory — that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows texted back in the early hours of Jan. 6: “I have pushed for this.",
    "author": "Associated Press",
    "title": "Official: Meadows had been warned of possible Jan. 6 violence"
  },
  {
    "id": 4801,
    "mediaId": 2664,
    "date": "2022-04-23",
    "sentence": "Politico's Kyle Cheney and Nicholas Wu reported, \"Lawmakers who attended meetings, in person or by phone, included Reps. Scott Perry (R-Pa.), Louie Gohmert (R-Texas), <span class='selected-term'>Jim Jordan</span> (R-Ohio), Matt Gaetz (R-Fla.) and numerous members of the House Freedom Caucus.\"",
    "author": "Tom Boggioni",
    "title": "GOP lawmakers plotted with White House to prevent Joe Biden from taking office: Mark Meadows aide"
  },
  {
    "id": 4779,
    "mediaId": 2633,
    "date": "2022-04-23",
    "sentence": "Meadows’ close friend, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, suggests in a late text on Jan. 5, 2021 — the day before Congress was due to certify Biden's victory — that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows texted back in the early hours of Jan. 6: “I have pushed for this.",
    "author": "Farnoush Amiri",
    "title": "Official: Meadows Had Been Warned of Possible 1/6 Violence"
  },
  {
    "id": 4939,
    "mediaId": 2741,
    "date": "2022-04-24",
    "sentence": "The filing contains testimony and other materials related to discussions that aides, such as then-White House chief of staff Mark Meadows, and members of the hard-right Freedom Caucus, including Rep. <span class='selected-term'>Jim Jordan</span>, had in the lead up to the fateful day.",
    "author": "",
    "title": "New Congressional Evidence: Yes, Trump Allies Knew What Was Coming on Jan. 6"
  },
  {
    "id": 4952,
    "mediaId": 2629,
    "date": "2022-04-24",
    "sentence": "The GOP lawmakers who took part in these meetings and phone calls, according to Hutchinson, were Reps. Scott Perry (R-PA), Louie Gohmert (R-TX), <span class='selected-term'>Jim Jordan</span> (R-OH), and Matt Gaetz (R-FL).",
    "author": "Chibueze Godwin",
    "title": "New Evidence Shows GOP Lawmakers Deeply Involved In Trump Coup"
  }
]