[
  {
    "id": 4570,
    "mediaId": 2690,
    "date": "2022-01-10",
    "sentence": "pic.twitter.com/6zVW0lE0Ni\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 3, 2022\nIn the meantime, those who support Donald Trump and refuse to comply with the requests being made by Pelosi and her committee end up getting indicted and held in contempt of Congress.",
    "author": "",
    "title": "BREAKING: Mike Lindell Files Lawsuit Against Nancy Pelosi"
  },
  {
    "id": 3103,
    "mediaId": 2595,
    "date": "2022-01-28",
    "sentence": "They are asking Ivanka Trump, Rudy Giuliani, Kevin McCarthy, <span class='selected-term'>Jim Jordan</span>, Mark Meadows, and Scott Perry to come in and charged Steve Bannon with criminal contempt for not showing up.",
    "author": "M Dowling",
    "title": "Cheney’s J6 Witch Hunt Committee Subpoenas 14 GOP Electors & Others"
  },
  {
    "id": 3034,
    "mediaId": 2658,
    "date": "2022-01-31",
    "sentence": "Minority Leader Kevin McCarthy and Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Scott Perry (R-Pa.) have each refused to voluntarily appear.",
    "author": "",
    "title": "The Jan. 6 panel's on a hot streak against Trump World. Now what?"
  },
  {
    "id": 3029,
    "mediaId": 2636,
    "date": "2022-01-31",
    "sentence": "",
    "author": "Luke Broadwater",
    "title": "Former Pence Chief of Staff Has Testified to the Jan. 6 Committee"
  },
  {
    "id": 12699,
    "mediaId": 2584,
    "date": "2022-03-02",
    "sentence": "The select committee is examining Eastman’s records about Republican federal and state legislators including Andy Biggs, Mo Brooks, Ted Cruz, Louie Gohmert, Paul Gosar, Josh Hawley, Cindy Hyde-Smith, <span class='selected-term'>Jim Jordan</span>, Cynthia Lummis, Roger Marshall, Doug Mastriano, Scott Perry and Tommy Tuberville.",
    "author": "Hugo Lowell",
    "title": "Keyword list for Trump lawyer hints at focus of US Capitol attack investigation"
  },
  {
    "id": 12567,
    "mediaId": 2658,
    "date": "2022-03-02",
    "sentence": "House Minority Leader Kevin McCarthy, Rep. Scott Perry (R-Pa.) and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) have all refused, despite evidence showing they witnessed or participated in significant aspects of Trump’s effort.",
    "author": "",
    "title": "Jan. 6 probe points lawmakers more and more toward GOP colleagues"
  },
  {
    "id": 9683,
    "mediaId": 2862,
    "date": "2022-03-29",
    "sentence": "Conservatives have pointed out that the FBI’s investigation into the 6 January events found no evidence of a conspiracy and also the Select Committee had refused to include lawmakers such as Congressman <span class='selected-term'>Jim Jordan</span> that would be critical of its activities and narrative.",
    "author": "",
    "title": "Trump Denies Use of 'Burner Phone' on 6 Jan. as Seven-Hour Gap in Phone Logs Raises Questions"
  },
  {
    "id": 7489,
    "mediaId": 2576,
    "date": "2022-04-03",
    "sentence": "When House Speaker Nancy Pelosi rejected two of the five — Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Jim Banks (R-Ohio) — McCarthy decreed that his caucus would boycott the Jan. 6 committee altogether.",
    "author": "Detroit Free Press Editorial Board",
    "title": "Editorial: Will we ever learn what happened on Jan. 6?"
  },
  {
    "id": 7379,
    "mediaId": 2550,
    "date": "2022-04-08",
    "sentence": "Incidentally, when the Jan. 6 committee exposed text messages sent by Rep. <span class='selected-term'>Jim Jordan</span> of Ohio to Mark Meadows, Jordan said the same had occurred.",
    "author": "",
    "title": "Trump Jr. pitched 'very simple' plan to White House to overturn 2020 election"
  },
  {
    "id": 7484,
    "mediaId": 2629,
    "date": "2022-04-09",
    "sentence": "Incidentally, when the Jan. 6 committee exposed text messages sent by Rep. <span class='selected-term'>Jim Jordan</span> of Ohio to Mark Meadows, Jordan said the same had occurred.",
    "author": "Brandi Buchman",
    "title": "'Total Control': Trump Jr. Pushed Coup Plot In November 2020 Texts To Meadows"
  }
]