[
  {
    "id": 986,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "School officials or parents in 15 different counties received or witnessed threats they considered serious enough to report to police.”\nAccording to Republicans from state attorneys general to Rep. <span class='selected-term'>Jim Jordan</span> to Sen. Josh Hawley and Florida Gov.",
    "author": "Laura Clawson",
    "title": "'You better grow eyes in the back of your head': Death threats to school boards are very real"
  },
  {
    "id": 1418,
    "mediaId": 2547,
    "date": "2022-02-17",
    "sentence": "School officials or parents in 15 different counties received or witnessed threats they considered serious enough to report to police.”\nAccording to Republicans from state attorneys general to Rep. <span class='selected-term'>Jim Jordan</span> to Sen. Josh Hawley and Florida Gov.",
    "author": "Laura Clawson",
    "title": "Death Threats To School Boards Are Very Real"
  },
  {
    "id": 241,
    "mediaId": 2550,
    "date": "2022-02-24",
    "sentence": "In the last week, Funes tagged Republican lawmakers like Reps. <span class='selected-term'>Jim Jordan</span>, Jim Banks, and Senator Josh Hawley with messages like, “Not all #J6 prisoners are created equal.",
    "author": "",
    "title": "framed for Jan. 6 meets with probe"
  },
  {
    "id": 113,
    "mediaId": 2512,
    "date": "2022-02-24",
    "sentence": "In the last week, Funes tagged Republican lawmakers like Reps. <span class='selected-term'>Jim Jordan</span>, Jim Banks, and Senator Josh Hawley with messages like, “Not all #J6 prisoners are created equal.",
    "author": "Brandi Buchman",
    "title": "Jan. 6 committee interviews ex-aide who claims 'Trump was framed' for insurrection"
  },
  {
    "id": 12942,
    "mediaId": 2658,
    "date": "2022-02-27",
    "sentence": "You know, everyone loves <span class='selected-term'>Jim Jordan</span> here.",
    "author": "",
    "title": "At CPAC, Trump delivers a reminder of his muscle"
  },
  {
    "id": 13268,
    "mediaId": 2699,
    "date": "2022-03-04",
    "sentence": "Ted Cruz (R-TX) and Josh Hawley (R-MO) and Reps. Matt Gaetz (R-FL) and <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Corbin Bolies",
    "title": "Revealed: Roger Stone’s Bonkers Pardon Plan for Jan. 6 Lawmakers"
  },
  {
    "id": 9484,
    "mediaId": 2699,
    "date": "2022-03-22",
    "sentence": "Later on the podcast, Molly makes predictions about the midterms—“Benghazi on steroids… It’s going to be the worst two fucking years of our lives.”\nShe gets more insight on impending midterm shittiness from NBC News political analyst Susan Del Percio, mainly because Del Percio has a very scary midterm prediction involving <span class='selected-term'>Jim Jordan</span>.",
    "author": "The Daily Beast",
    "title": "Josh Hawley Is on the Verge of Being ‘Senator From QAnon’"
  },
  {
    "id": 9017,
    "mediaId": 2550,
    "date": "2022-03-27",
    "sentence": "",
    "author": "",
    "title": "Mark Foley. Dennis Hastert. Matt Gaetz. And Republicans want to pontificate about morals?"
  },
  {
    "id": 9207,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "Other calls were made to Senate minority leader Mitch McConnell (R-KY), who an aide says declined the call, and Sen. Josh Hawley (R-MO), and Trump spoke for 10 minutes with Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) starting at 9:24 a.m.",
    "author": "Travis Gettys",
    "title": "Trump’s mysterious last recorded phone call before the Jan. 6 riot was to an ‘unidentified person’"
  },
  {
    "id": 9121,
    "mediaId": 2745,
    "date": "2022-03-29",
    "sentence": "8:34 a.m. — Kurt Olsen\n8:37 a.m. — Stephen K. Bannon\n8:45 a.m. — Rudy Giuliani\n8:56 a.m. — Requests White House Chief of Staff Mark Meadows\n9:02 a.m. — Requests Vice President Mike Pence\n9:16 a.m. — Requests Senate Majority Leader Mitch McConnell (R-Ky.) (a call that an aide says the senator declined)\n9:24 a.m. — Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio)\n9:39 a.m. — Requests Sen. Josh Hawley (R-Mo.)",
    "author": "",
    "title": "The inexplicable gap in the Trump White House’s Jan. 6 records"
  },
  {
    "id": 9267,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "For example, Congressman <span class='selected-term'>Jim Jordan</span> infamously told a reporter he couldn't remember when he talked to the president on January 6, even if it was before or after the insurrection.",
    "author": "David Badash",
    "title": "‘Woodward and I have the docs’: Robert Costa posts Jan. 6 WH call logs that could be big trouble for Trump and allies"
  },
  {
    "id": 9296,
    "mediaId": 2512,
    "date": "2022-03-29",
    "sentence": "For example, Congressman <span class='selected-term'>Jim Jordan</span> infamously told a reporter he couldn’t remember when he talked to the president on January 6, even if it was before or after the insurrection.",
    "author": "David Badash",
    "title": "'Woodward and I have the docs': Robert Costa posts Jan. 6 WH call logs that spell big trouble for Trump and allies"
  },
  {
    "id": 7898,
    "mediaId": 2664,
    "date": "2022-04-05",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> helped cover up a sex-abuse scandal in college.",
    "author": "Bob Brigham",
    "title": "GOP adopts pedophile smear as QAnon conspiracy theory goes mainstream: report"
  },
  {
    "id": 7165,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "In a new supercut video set to The Tings Tings hit “That’s Not My Name”, The Daily Show's Trevor Noah takes her to school, trotting out the list of Republicans who have been exposed for proven or alleged sexual liaisons with underage people: former House Speaker Dennis Hastert, Florida Rep. Matt Gaetz, former Rep. Mark Foley of Massachusetts, Alabama's Roy Moore and Rep. <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Timothy Evans",
    "title": "Marjorie Taylor Greene's latest screed about Democrats destroyed in 'Daily Show' supercut"
  },
  {
    "id": 7596,
    "mediaId": 2803,
    "date": "2022-04-09",
    "sentence": "Also in 2018, Rep. <span class='selected-term'>Jim Jordan</span>, one of Trump’s fiercest allies and a co-founder of the hardline conservative Freedom Caucus, became embroiled in a scandal over his time as a wrestling coach at Ohio State University, where a team doctor named Richard Strauss, who committed suicide in 2005, was found to have sexually abused more than 177 male student athletes.",
    "author": "Jordan Weissmann",
    "title": "So, Let’s Talk About Republicans and Sex Crimes"
  },
  {
    "id": 5522,
    "mediaId": 2727,
    "date": "2022-04-17",
    "sentence": "Today’s GOP is dominated by extremists like the Freedom Caucus and crazies like Marjorie Taylor Greene, Matt Gaetz, Paul Gosar, Madison Cawthorn, Lauren Boebert and <span class='selected-term'>Jim Jordan</span>.",
    "author": "",
    "title": "Lilliput on the Potomac"
  }
]