[
  {
    "id": 11220,
    "mediaId": 2664,
    "date": "2022-03-08",
    "sentence": "As CNN's Zanona points out, controversial Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) is already in line to take over the chairmanship of the powerful House Judiciary Committee \"with all the subpoena power that comes with it.\"",
    "author": "Tom Boggioni",
    "title": "Freedom Caucus plans to 'elevate' Taylor Greene and Boebert on committees after GOP retakes the House: report"
  },
  {
    "id": 11261,
    "mediaId": 2550,
    "date": "2022-03-09",
    "sentence": "Related:\nJan. 6 committee puts fellow member of Congress in the hot seat\nWhite House Jan. 6 call log confirms what <span class='selected-term'>Jim Jordan</span> couldn't—or wouldn't\nKevin McCarthy's failure to act on Gosar and Greene's white nationalist flirtation says it all\nRepublicans divided on whether to use Jan. 6 committee as tool of revenge or just kill it off\nMcConnell finally gets around to taking issue with RNC's embrace of violence.",
    "author": "Laura Clawson",
    "title": "Freedom Caucus is poised to have serious sway if Republicans take the House"
  },
  {
    "id": 11339,
    "mediaId": 2818,
    "date": "2022-03-15",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) celebrate the moment on Twitter:\n“Ohio just became the 23rd state in the nation to enact constitutional carry legislation.",
    "author": "The First",
    "title": "OHIO GREENLIGHTS CONSTITUTIONAL CARRY: Jordan Says ‘Big Win for Second Amendment’"
  },
  {
    "id": 5972,
    "mediaId": 2741,
    "date": "2022-04-14",
    "sentence": "Troy Nehls, a Texas Republican, simply wrote, “Make Twitter Great Again,” while Rep. <span class='selected-term'>Jim Jordan</span> praised Musk on Fox, painting him as the embodiment of “free speech.”\nLast Saturday, Musk rejected an offer from Twitter to join the company’s board—a move that would have barred him from acquiring a Twitter stake greater than 14.9%.",
    "author": "Caleb Ecarma",
    "title": "Right-Wingers Are Absolutely Eating Up the Idea of Elon Musk Taking Over Twitter"
  },
  {
    "id": 5769,
    "mediaId": 2664,
    "date": "2022-04-21",
    "sentence": "His call for more “free speech” on Twitter is being taken up with enthusiasm by conservatives like US Reps. <span class='selected-term'>Jim Jordan</span> and Lauren Boebert, who see Musk as an ally in turning Twitter into a place where hateful and abusive speech are common and encouraged.",
    "author": "Noah Berlatsky",
    "title": "Elon Musk wants 'his speech to trump everyone else’s'"
  },
  {
    "id": 4983,
    "mediaId": 2547,
    "date": "2022-04-23",
    "sentence": "\"Oh, McCarthy lied to us but I'm sure <span class='selected-term'>Jim Jordan</span> won't.\"",
    "author": "NewsHound Ellen",
    "title": "McCarthy Was Caught Lying About Trump’s J6 Guilt. Now What?"
  }
]