[
  {
    "id": 1915,
    "mediaId": 2641,
    "date": "2022-02-06",
    "sentence": "Democrats have long claimed to be against gerrymandering, but they have no issue with the partisan redrawing of congressional districts when it suits them, according to Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Eric Mack",
    "title": "Rep. Jordan: Redistricting 'Only Gerrymandering' When GOP Does It"
  },
  {
    "id": 1015,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Laura Collins & Elizabeth Elkind &",
    "title": "Exclusive: Clinton cornered: Hillary refuses to answer questions about Durham revelation she paid to spy on the Trump campaign as she arrives at daughter Chelsea's Manhattan home ahead of the New York Democratic Convention"
  },
  {
    "id": 59,
    "mediaId": 2573,
    "date": "2022-02-21",
    "sentence": "We heard from Congressman <span class='selected-term'>Jim Jordan</span> on Twitter today, who wrote: \"It's not a vast right-wing conspiracy.",
    "author": "",
    "title": "'Your World' on Russia-Ukraine, Hillary Clinton in New York"
  },
  {
    "id": 12532,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Karol Markowicz",
    "title": "Why we must demand that leaders who got COVID wrong admit it and apologize"
  },
  {
    "id": 8886,
    "mediaId": 2572,
    "date": "2022-03-24",
    "sentence": "Ohio Congressman <span class='selected-term'>Jim Jordan</span>, ranking member of House Judiciary, is right in the middle of all this and joins me now.",
    "author": "",
    "title": "'The Ingraham Angle' on Kamala Harris, Ketanji Brown Jackson"
  },
  {
    "id": 8915,
    "mediaId": 2526,
    "date": "2022-03-29",
    "sentence": "GOP leader Rep. Kevin McCarthy (R-CA) has called the JCPA “the antithesis of conservatism,” while Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) has warned it would give the media “cartel power.”\nSens.",
    "author": "Allum Bokhari",
    "title": "Lindsey Graham Backs Democrat Led Bailout for Corporate Media"
  },
  {
    "id": 5230,
    "mediaId": 2618,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Harriet Alexander",
    "title": "NYPD identifies person of interest in NYC subway shooting and reveals he made 'concerning posts' on social media about homelessness, New York and Mayor Eric Adams: Cops say 62-year-old rented the U-Haul connected to the attack"
  },
  {
    "id": 5727,
    "mediaId": 2736,
    "date": "2022-04-17",
    "sentence": "From The Atlantic:\nThe day after Glenn Youngkin won the Virginia governor’s race last November, a Wall Street Journal headline declared: “Youngkin Makes the GOP the Parents’ Party.” Representative <span class='selected-term'>Jim Jordan</span> of Ohio exulted in this new party line on Twitter: “The Republican Party is the party of parents.”\nKendi is wrong here.",
    "author": "Sam Janney",
    "title": "‘Kinda gives the game away here, no’? Ibram X. Kendi goes straight-up #BlueAnon ranting about white supremacist grooming and LOL"
  }
]