[
  {
    "id": 4470,
    "mediaId": 2658,
    "date": "2022-01-05",
    "sentence": "“We can’t lose the entire WH counsels office,” he wrote to <span class='selected-term'>JIM JORDAN</span> and MARK MEADOWS on Dec. 31, 2020, likely referring to PAT CIPOLLONE’s opposition to pressuring MIKE PENCE to throw the Electoral College count.",
    "author": "",
    "title": "POLITICO Playbook: Republicans dodge and deflect ahead of Jan. 6"
  },
  {
    "id": 4526,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "Now, they say, it is time for Mr. Biden to focus not only on his own achievements, but also on how the Republican Party threatens to reverse those efforts if it returns to power on Capitol Hill — something that has not been at the center of his presidency so far.”\nJAN. 6 AND ITS AFTERMATH\nJORDAN SNUBS JAN. 6 PANEL — Rep. <span class='selected-term'>JIM JORDAN</span> (R-Ohio) is refusing the Jan. 6 committee’s request for an interview, calling the ask an “unprecedented and inappropriate demand.”\nIn a letter to Chair BENNIE THOMPSON (D-Miss.)",
    "author": "",
    "title": "POLITICO Playbook: Biden faces his moment on the filibuster"
  },
  {
    "id": 4389,
    "mediaId": 2553,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic.",
    "author": "Ryan Saavedra",
    "title": "Trump Makes Statement Over Reports That He Has A Problem With Governor Ron DeSantis"
  },
  {
    "id": 3308,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "Politico also acknowledges that Republican lawmakers have flocked to Breitbart to condemn the legislation:\nBut the bill has also attracted major GOP critics such as Florida Sen. Marco Rubio, Tennessee Sen. Marsha Blackburn, House Minority Leader Kevin McCarthy and House Judiciary ranking member <span class='selected-term'>Jim Jordan</span> of Ohio, all of whom have done interviews with Breitbart opposing the legislation.",
    "author": "Allum Bokhari",
    "title": "Politico Attacks Breitbart for Not Joining Media Cartel Bandwagon"
  },
  {
    "id": 1120,
    "mediaId": 2672,
    "date": "2022-02-15",
    "sentence": "Microsoft lobbyists gave the most, with Fred Humphries donating $2,500 to House Minority Leader Kevin McCarthy (R-Calif.) and $1,000 to Ohio Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "William Vaillancourt",
    "title": "Lobbyists Are Donating to GOP Election Deniers Even After Their Companies Pledged to Stop Giving"
  },
  {
    "id": 920,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "Pic\nHAPPY BIRTHDAY: Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio), Suzan DelBene (D-Wash.) (6-0) and Jake LaTurner (R-Kan.) … Brian Jack … DHS’ Sam Vinograd … Betsy Fischer Martin … Axios’ Lachlan Markay … Keegan Goudiss … McClatchy’s Kristin Roberts … Ashley Berrang … CNN’s Dianna Heitz … Cara Camacho … Boeing’s Fred Schwien … Edith Honan … AARP’s Barbara Shipley … Danielle Most … POLITICO’s Kelsey Tamborrino and Baker Landon … Annamarie Rienzi … Mark Shriver of Save the Children … Drew Cantor … Frederick Hill of FTI Consulting … Steven Grossman … Preston Mizell of Rep. Darrell Issa’s (R-Calif.) office … James Lynch … Alison Kutler … Mike Sager of EMILY’s List … Allison Hunn … David Carreiro … NAICU’s Emmanual Guillory … Shana Marchio … Skyla Freeman … Stephanie Young of When We All Vote … Cliff Sims … Surya Gunasekara … former Rep. Randy Forbes (R-Va.) (7-0) … Robert Giuffra\nDid someone forward this email to you?",
    "author": "",
    "title": "POLITICO Playbook: Operation ‘Stop Greitens’ goes awry"
  },
  {
    "id": 4801,
    "mediaId": 2664,
    "date": "2022-04-23",
    "sentence": "Politico's Kyle Cheney and Nicholas Wu reported, \"Lawmakers who attended meetings, in person or by phone, included Reps. Scott Perry (R-Pa.), Louie Gohmert (R-Texas), <span class='selected-term'>Jim Jordan</span> (R-Ohio), Matt Gaetz (R-Fla.) and numerous members of the House Freedom Caucus.\"",
    "author": "Tom Boggioni",
    "title": "GOP lawmakers plotted with White House to prevent Joe Biden from taking office: Mark Meadows aide"
  }
]