[
  {
    "id": 4558,
    "mediaId": 2724,
    "date": "2022-01-13",
    "sentence": "On Sunday, Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) also announced that he would not be cooperating with the committee.",
    "author": "Becky Noble",
    "title": "GOP Leader McCarthy Tells Jan 6 Committee He Will Not Cooperate"
  },
  {
    "id": 4388,
    "mediaId": 2730,
    "date": "2022-01-20",
    "sentence": "The select committee has also asked Reps. Scott Perry (R-PA) and <span class='selected-term'>Jim Jordan</span> (R-OH), as well as House Minority Leader Kevin McCarthy (R-CA).",
    "author": "Rebecca Downs",
    "title": "The January 6 Select Committee is Now Asking Ivanka Trump for Her 'Voluntary Cooperation,' Really"
  },
  {
    "id": 11524,
    "mediaId": 2526,
    "date": "2022-03-07",
    "sentence": "I respect that.”\nBishop, who is also a member of the Judiciary Committee and good friends with ranking member Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), noted there is a “particular logic that makes sense” in the possibility of him chairing Homeland.",
    "author": "Ashley Oliver",
    "title": "Exclusive: Freedom Caucus Members Jostle for Top Post on Immigration Oversight Panel"
  },
  {
    "id": 11220,
    "mediaId": 2664,
    "date": "2022-03-08",
    "sentence": "As CNN's Zanona points out, controversial Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) is already in line to take over the chairmanship of the powerful House Judiciary Committee \"with all the subpoena power that comes with it.\"",
    "author": "Tom Boggioni",
    "title": "Freedom Caucus plans to 'elevate' Taylor Greene and Boebert on committees after GOP retakes the House: report"
  },
  {
    "id": 11261,
    "mediaId": 2550,
    "date": "2022-03-09",
    "sentence": "Related:\nJan. 6 committee puts fellow member of Congress in the hot seat\nWhite House Jan. 6 call log confirms what <span class='selected-term'>Jim Jordan</span> couldn't—or wouldn't\nKevin McCarthy's failure to act on Gosar and Greene's white nationalist flirtation says it all\nRepublicans divided on whether to use Jan. 6 committee as tool of revenge or just kill it off\nMcConnell finally gets around to taking issue with RNC's embrace of violence.",
    "author": "Laura Clawson",
    "title": "Freedom Caucus is poised to have serious sway if Republicans take the House"
  },
  {
    "id": 10825,
    "mediaId": 2550,
    "date": "2022-03-16",
    "sentence": "Related: Who’s who: A rolling guide to the targets of the Jan. 6 committee\nAccording to ABC, GOP House Leader Kevin McCarthy and Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania have had “no follow-up discussions” about their cooperation since receiving their respective subpoenas.",
    "author": "",
    "title": "Maybe there won't be subpoenas for GOP lawmakers from Jan. 6 probe but that doesn't spell doom"
  },
  {
    "id": 9790,
    "mediaId": 2509,
    "date": "2022-03-23",
    "sentence": "A spokesman for the panel, which has requested testimony from GOP Reps. Kevin McCarthy of California, <span class='selected-term'>Jim Jordan</span> of Ohio, and Scott Perry of Pennsylvania, declined to comment.",
    "author": "Benjamin Siegel",
    "title": "Trump repeatedly pressed to 'remove' Biden, 'rescind' 2020 election results, GOP lawmaker says"
  },
  {
    "id": 9126,
    "mediaId": 2512,
    "date": "2022-03-23",
    "sentence": "“Earlier this month, the Committee released a list of 120 political endorsements that includes 37 Republicans who voted against certifying (President Joe) Biden’s victory after the January 6 storming of the Capitol.”\nMcGreal adds, “Among them are two members of Congress, <span class='selected-term'>Jim Jordan</span> and Scott Perry, who plotted with Trump’s White House to overturn the election result.",
    "author": "Alex Henderson",
    "title": "‘Morally bankrupt’ AIPAC slammed for endorsing GOP seditionists who refused to accept 2020 election results"
  },
  {
    "id": 9304,
    "mediaId": 2627,
    "date": "2022-03-30",
    "sentence": "Late last year, the House select committee investigating the Jan. 6 attack took a bold step: The panel asked three Republican members of Congress — Pennsylvania’s Scott Perry, Ohio’s <span class='selected-term'>Jim Jordan</span>, and California’s Kevin McCarthy — to voluntarily cooperate with investigators.",
    "author": "Steve Benen",
    "title": "After being scorned by Trump, will Brooks answer Jan. 6 questions?"
  },
  {
    "id": 7816,
    "mediaId": 6687,
    "date": "2022-04-02",
    "sentence": "“People in Congress, from Senators Rand Paul and Ted Cruz to Congressmen Marjorie Taylor Greene, Brian Babin, Thomas Massie, <span class='selected-term'>Jim Jordan</span>, Scott Perry and many, many others know Alabama’s Senate race is a no-brainer.",
    "author": "Yaffee",
    "title": "Chairman of House Freedom Caucus endorses Mo Brooks – He ‘fights unwaveringly for our conservative values’"
  },
  {
    "id": 7134,
    "mediaId": 2621,
    "date": "2022-04-03",
    "sentence": "",
    "author": "Katherine Huggins",
    "title": "Fox News’ Trey Gowdy Blasts Cawthorn Over Orgy Comments: ‘Can’t Blame the Media for Something That Came Out of Your Mouth’"
  },
  {
    "id": 7695,
    "mediaId": 2634,
    "date": "2022-04-08",
    "sentence": "Other Trump allies, like Congressmen <span class='selected-term'>Jim Jordan</span> and Scott Perry, have refused the committee’s invitation to sit down for interviews.",
    "author": "Daniel Strauss",
    "title": "January 6 Recap: Exactly What Did Ivanka Trump Talk About for Eight Long Hours?"
  },
  {
    "id": 5329,
    "mediaId": 2664,
    "date": "2022-04-11",
    "sentence": "The panel hasn't decided what to do with three Republican lawmakers -- House minority leader Kevin McCarthy and Reps. Scott Perry and <span class='selected-term'>Jim Jordan</span> -- who have refused to voluntarily testify, although committee chairman Bennie Thompson said they would not likely face subpoenas.",
    "author": "Travis Gettys",
    "title": "Jan. 6 panel faces major choices about Trump as investigation enters final phase"
  },
  {
    "id": 6066,
    "mediaId": 6687,
    "date": "2022-04-18",
    "sentence": "“Congressmen like <span class='selected-term'>Jim Jordan</span>, Scott Perry, and others in the Freedom Caucus need conservative fighters to work with them in the House, and they know that Casey Wardynski is the only candidate in this race that will stand with them and further an America First agenda.”\n“The Freedom Fund endorsement is highly sought after, and we’re glad that after thoroughly vetting the AL-5 field they recognized Casey Wardynski as the true conservative in the race,” he added.",
    "author": "Dylan Smith",
    "title": "House Freedom Caucus political arm endorses Casey Wardynski in AL-5 race"
  },
  {
    "id": 4825,
    "mediaId": 2523,
    "date": "2022-04-19",
    "sentence": "A House select committee that’s conducting a fact-finding investigation about January 6 separate from the Justice Department’s probe has said it wanted information from Republican lawmakers including Reps. <span class='selected-term'>Jim Jordan</span> of Ohio, Scott Perry of Pennsylvania and Kevin McCarthy of California, the House minority leader.",
    "author": "Cnn Com",
    "title": "Jan. 6: Oath Keepers talked about protecting GOP Rep. Ronny Jackson"
  },
  {
    "id": 6114,
    "mediaId": 2658,
    "date": "2022-04-22",
    "sentence": "Lawmakers who attended meetings, in person or by phone, included Reps. Scott Perry (R-Pa.), Louie Gohmert (R-Texas), <span class='selected-term'>Jim Jordan</span> (R-Ohio), Matt Gaetz (R-Fla.) and numerous members of the House Freedom Caucus, according to Cassidy Hutchinson, an aide to Meadows who provided key testimony about the conversations and meetings Meadows had in December 2020.",
    "author": "",
    "title": "GOP lawmakers were deeply involved in Trump plans to overturn election, new evidence suggests"
  },
  {
    "id": 4715,
    "mediaId": 2532,
    "date": "2022-04-23",
    "sentence": "On those calls, according to Hutchinson, were representatives from Trump's legal team, including Rudy Giuliani, Jenna Ellis and Sidney Powell, as well as Reps. <span class='selected-term'>Jim Jordan</span> and Scott Perry.",
    "author": "",
    "title": "Meadows had been warned of possible Jan. 6 violence, official says"
  },
  {
    "id": 4921,
    "mediaId": 2862,
    "date": "2022-04-23",
    "sentence": "a request that the judge in the case issue a ruling without a full trial), Pelosi et al.’s lawyers pointed to the presence of high-profile Republican lawmakers among those who sat in meetings with the Republican president’s officials, either in person or by phone.Among the officials cited by the filing were Ohio Congressman <span class='selected-term'>Jim Jordan</span>, Florida Representative Matt Gaetz, and Pennsylvania Congressman Scott Perry.“Mr.",
    "author": "Ilya Tsukanov",
    "title": "January 6 Probe Deposition Accuses High Profile Republicans of Involvement in Trump ‘Coup’ Plot"
  },
  {
    "id": 5176,
    "mediaId": 6656,
    "date": "2022-04-23",
    "sentence": "Among the GOP lawmakers named by Hutchinson as taking part in such discussions were Reps. Scott Perry, R-Pa., Louie Gohmert, R-Texas, <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Matt Gaetz, R-Fla.",
    "author": "Don Jacobson",
    "title": "Ex-aide: GOP lawmakers met with Meadows on Trump's Jan. 6 plans"
  },
  {
    "id": 4902,
    "mediaId": 6676,
    "date": "2022-04-23",
    "sentence": "That group includes GOP Reps. <span class='selected-term'>Jim Jordan</span> (Ohio), Mo Brooks (Ala.) Andy Biggs (Ariz.), Matt Gaetz (Fla.), Scott Perry (Pa.) Jody Hice (Ga.), Paul Gosar (Ariz.) and Debbie Lesko (Ariz.).",
    "author": "Rebecca Beitsch",
    "title": "Jan. 6 committee says Meadows knew about threat of violence ahead of riot"
  },
  {
    "id": 4987,
    "mediaId": 2738,
    "date": "2022-04-23",
    "sentence": "Professional nuisances and Beavis and Butt-Head lookalikes Matt Gaetz and <span class='selected-term'>Jim Jordan</span> have never been quiet about spreading misinformation about the 2020 election.",
    "author": "Matt Prigge",
    "title": "Matt Gaetz, Jim Jordan, And More Were Reportedly Even More Involved In Plans To Overturn The Election Than Previously Thought"
  },
  {
    "id": 4952,
    "mediaId": 2629,
    "date": "2022-04-24",
    "sentence": "The GOP lawmakers who took part in these meetings and phone calls, according to Hutchinson, were Reps. Scott Perry (R-PA), Louie Gohmert (R-TX), <span class='selected-term'>Jim Jordan</span> (R-OH), and Matt Gaetz (R-FL).",
    "author": "Chibueze Godwin",
    "title": "New Evidence Shows GOP Lawmakers Deeply Involved In Trump Coup"
  },
  {
    "id": 4939,
    "mediaId": 2741,
    "date": "2022-04-24",
    "sentence": "The filing contains testimony and other materials related to discussions that aides, such as then-White House chief of staff Mark Meadows, and members of the hard-right Freedom Caucus, including Rep. <span class='selected-term'>Jim Jordan</span>, had in the lead up to the fateful day.",
    "author": "",
    "title": "New Congressional Evidence: Yes, Trump Allies Knew What Was Coming on Jan. 6"
  }
]