[
  {
    "id": 4464,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "QUICK LINKS\nRep. <span class='selected-term'>Jim Jordan</span> says he won’t cooperate with Jan. 6 committee’s interview request, from Nicholas and Kyle\nTRANSITIONS\nOmair Mirza is joining J.P. Morgan Chase as VP of federal government relations.",
    "author": "",
    "title": "Dems eye voting rights fight, filibuster changes"
  },
  {
    "id": 4539,
    "mediaId": 2615,
    "date": "2022-01-11",
    "sentence": "Seth takes a closer look at Congressman <span class='selected-term'>Jim Jordan</span> refusing to cooperate with the January 6 investigation and Sen. Ted Cruz debasing himself on Fox News.",
    "author": "Charles Johnson",
    "title": "Seth Meyers: Ted Cruz Humiliates Himself by Groveling to Tucker Carlson on Fox News"
  },
  {
    "id": 2482,
    "mediaId": 2548,
    "date": "2022-02-07",
    "sentence": "Similarly, prominent Republican members of Congress including Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Tennessee Sen. Marsha Blackburn have indicated plans to further scrutinize the crowdfunding site.",
    "author": "Ailan Evans",
    "title": "Arizona AG Demands GoFundMe Preserve Documents Related To Removal Of Freedom Convoy Fundraiser"
  },
  {
    "id": 1952,
    "mediaId": 2590,
    "date": "2022-02-07",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) also complained about GoFundMe’s action on Twitter, and Elon Musk gushed: “Canadian truckers rule.”\nDonald Trump Jr. called via a tweet on Friday for all Republican attorneys general in the U.S. to investigate.",
    "author": "Mary Papenfuss",
    "title": "Ted Cruz Throws In With Anti-Vaccine Ottawa Trucker Mob As City Declares Emergency"
  },
  {
    "id": 1995,
    "mediaId": 2625,
    "date": "2022-02-09",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 9, 2022",
    "author": "Matt Reynolds",
    "title": "Fauci Says “Full-Blown” Pandemic Is Almost Over"
  },
  {
    "id": 1578,
    "mediaId": 2699,
    "date": "2022-02-11",
    "sentence": "It is ironic, but not surprising, that this truckers’ protest is being championed by Republicans like Sen. Ted Cruz and Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "Matt Lewis",
    "title": "Wait, Now the Right Loves Traffic-Blocking Protesters?"
  },
  {
    "id": 1137,
    "mediaId": 2594,
    "date": "2022-02-16",
    "sentence": "In a stronger period of time in our country, this crime would have been punishable by death.”\nIn an even briefer statement three days later, evidently still basking in the glow of apparent triumph, he proclaimed: “I was proven right about the spying, and I will be proven right about 2020.”\nThe same development was likewise hailed loudly by Tucker Carlson on Fox News and on social media by loyalists including Donald Trump Jr, Ronna McDaniel, Ted Cruz, Kevin McCarthy, Marjorie Taylor Greene, Mark Meadows and <span class='selected-term'>Jim Jordan</span> but what exactly has Mr Durham alleged?",
    "author": "Joe Sommerlad",
    "title": "Why Donald Trump is once again claiming Democrats ‘spied’ on him"
  },
  {
    "id": 117,
    "mediaId": 2564,
    "date": "2022-02-23",
    "sentence": "The Texas Republican senator posted two images of himself at Mar-a-Lago\nHe's in Florida to speak at the Conservative Political Action Conference Thurs\nTrump was hosting a fundraiser for 2022 GOP congressional candidates\nCruz moderated a chat with Georgia Senate candidate Herschel Walker\nTennessee House candidate Morgan Ortagus was also there, along with former Florida AG Pam Bondi, Florida Rep. Mike Waltz and Ohio Rep. <span class='selected-term'>Jim Jordan</span>\nTop-dollar VIP access cost $250,000 per seat, and basic attendance ran $3,000\nTexas Senator Ted Cruz revealed he was at Donald Trump's Mar-a-Lago club in on Wednesday, along with a host of national Republican figures who gathered at the Florida resort for a high-profile fundraiser.",
    "author": "Elizabeth Elkind",
    "title": "Trump meets Ted Cruz at Mar-a-Lago ahead of C-PAC: Republicans and conservative donors mingle at private Florida private club ahead of ex-President's prime-time Saturday night speech"
  },
  {
    "id": 12942,
    "mediaId": 2658,
    "date": "2022-02-27",
    "sentence": "You know, everyone loves <span class='selected-term'>Jim Jordan</span> here.",
    "author": "",
    "title": "At CPAC, Trump delivers a reminder of his muscle"
  },
  {
    "id": 12699,
    "mediaId": 2584,
    "date": "2022-03-02",
    "sentence": "The select committee is examining Eastman’s records about Republican federal and state legislators including Andy Biggs, Mo Brooks, Ted Cruz, Louie Gohmert, Paul Gosar, Josh Hawley, Cindy Hyde-Smith, <span class='selected-term'>Jim Jordan</span>, Cynthia Lummis, Roger Marshall, Doug Mastriano, Scott Perry and Tommy Tuberville.",
    "author": "Hugo Lowell",
    "title": "Keyword list for Trump lawyer hints at focus of US Capitol attack investigation"
  },
  {
    "id": 13243,
    "mediaId": 2724,
    "date": "2022-03-03",
    "sentence": "",
    "author": "Becky Noble",
    "title": "Hispanic Journalists Slam CNN For ‘Lack Of Diversity’ On Their New Streaming Service"
  },
  {
    "id": 13268,
    "mediaId": 2699,
    "date": "2022-03-04",
    "sentence": "Ted Cruz (R-TX) and Josh Hawley (R-MO) and Reps. Matt Gaetz (R-FL) and <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Corbin Bolies",
    "title": "Revealed: Roger Stone’s Bonkers Pardon Plan for Jan. 6 Lawmakers"
  },
  {
    "id": 12961,
    "mediaId": 2584,
    "date": "2022-03-04",
    "sentence": "Discussing a plan in which Trump would issue a blanket pardon to co-conspirators in the attempt to overturn the election, Senator Ted Cruz and congressman <span class='selected-term'>Jim Jordan</span> among them.",
    "author": "Martin Pengelly",
    "title": "Roger Stone raged at ‘disgrace’ Trump over failure to overturn election – report"
  },
  {
    "id": 11333,
    "mediaId": 2752,
    "date": "2022-03-17",
    "sentence": "",
    "author": "Liz Dye",
    "title": "Clown Convoy Threatens Capital, Gets Audience With GOP Congressmen"
  },
  {
    "id": 9484,
    "mediaId": 2699,
    "date": "2022-03-22",
    "sentence": "Later on the podcast, Molly makes predictions about the midterms—“Benghazi on steroids… It’s going to be the worst two fucking years of our lives.”\nShe gets more insight on impending midterm shittiness from NBC News political analyst Susan Del Percio, mainly because Del Percio has a very scary midterm prediction involving <span class='selected-term'>Jim Jordan</span>.",
    "author": "The Daily Beast",
    "title": "Josh Hawley Is on the Verge of Being ‘Senator From QAnon’"
  },
  {
    "id": 9605,
    "mediaId": 2695,
    "date": "2022-03-26",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R – Ohio) currently serves as the top Republican on the House Judiciary Committee and is positioned to take control of the committee in 2023 should the Republican Party retake control of Congress.",
    "author": "Samuel Mangold-Lenett",
    "title": "Rep. Jim Jordan indicates that Republicans are open to impeaching Biden if they retake Congress in 2022"
  },
  {
    "id": 8930,
    "mediaId": 2526,
    "date": "2022-03-26",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) told the Washington Times at the Republican retreat in Florida this week.",
    "author": "Wendell Husebø",
    "title": "Top Republicans Consider Impeaching Joe Biden After Midterm Elections"
  },
  {
    "id": 9017,
    "mediaId": 2550,
    "date": "2022-03-27",
    "sentence": "",
    "author": "",
    "title": "Mark Foley. Dennis Hastert. Matt Gaetz. And Republicans want to pontificate about morals?"
  },
  {
    "id": 9672,
    "mediaId": 2748,
    "date": "2022-03-27",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) told the Washington Times at the Republican retreat in Florida this week.",
    "author": "Blarp Blog",
    "title": "Top Republicans Consider Impeaching Joe Biden After Midterm Elections"
  },
  {
    "id": 7130,
    "mediaId": 2631,
    "date": "2022-03-31",
    "sentence": "Everybody’s concerned about that story,” said Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, a Trump loyalist who is likely to chair the Judiciary Committee if Republicans win the House back in November.",
    "author": "",
    "title": "Republicans squirm as Trump presses Putin for dirt on Bidens"
  },
  {
    "id": 7219,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "Reps. <span class='selected-term'>Jim Jordan</span>, Ohio Republican; Andy Biggs, Arizona Republican; and Mike Johnson, Louisiana Republican, wrote to Mr. Wray in March and demanded that he answer questions about the audit.",
    "author": "Ryan Lovelace",
    "title": "Sen. Ted Cruz requests oversight hearing of FBI after agents’ rule-breaking exposed"
  },
  {
    "id": 7596,
    "mediaId": 2803,
    "date": "2022-04-09",
    "sentence": "Also in 2018, Rep. <span class='selected-term'>Jim Jordan</span>, one of Trump’s fiercest allies and a co-founder of the hardline conservative Freedom Caucus, became embroiled in a scandal over his time as a wrestling coach at Ohio State University, where a team doctor named Richard Strauss, who committed suicide in 2005, was found to have sexually abused more than 177 male student athletes.",
    "author": "Jordan Weissmann",
    "title": "So, Let’s Talk About Republicans and Sex Crimes"
  },
  {
    "id": 6110,
    "mediaId": 2690,
    "date": "2022-04-16",
    "sentence": "Scott Tipton - 83%\nMark Meddows - 83%\nDunken Hunter - 83%\nPaul Gosar - 83% (R)AZ, Rep-House..\nBlake D. Moore - 83%\nH. Griffith - 83%\nKen Buck - 82%\n<span class='selected-term'>Jim Jordan</span> - 82%\nLance Gooden - 825 (R)TX, Rep-House..\nBill Posby - 82% ?",
    "author": "Raymond Embrey",
    "title": "The 75% option, The support for the Constutional Republic"
  }
]