[
  {
    "id": 1412,
    "mediaId": 2630,
    "date": "2022-02-14",
    "sentence": "“Upon identifying DNS queries from Russian-made Yota phones in proximity to the Trump campaign and the EOP, respected cyber-security researchers were deeply concerned about the anomalies they found in the data and prepared a report of their findings, which was subsequently shared with the CIA.”\nHouse committee calls on Rep. <span class='selected-term'>Jim Jordan</span> to provide information about Jan. 6 Capitol riot\nDec. 23, 202103:29\nA spokesperson for special counsel Durham’s office said the office declines to comment beyond the court filings and any response will be in future filings with the court.",
    "author": "",
    "title": "Tech exec used access to White House computers to look for dirt on Trump, says special counsel"
  },
  {
    "id": 1160,
    "mediaId": 2580,
    "date": "2022-02-15",
    "sentence": "In addition, reparations should be paid to those in our country who have been damaged by this.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) told Fox News the federal filing proves Trump’s claim that he was being spied on – a claim that “60 Minutes” journalist Lesley Stahl pooh-poohed during an interview in October 2020.",
    "author": "Jody Brown",
    "title": "Hillary’s campaign paid for high-tech spying on Trump – even after the election, says Durham"
  },
  {
    "id": 1137,
    "mediaId": 2594,
    "date": "2022-02-16",
    "sentence": "In a stronger period of time in our country, this crime would have been punishable by death.”\nIn an even briefer statement three days later, evidently still basking in the glow of apparent triumph, he proclaimed: “I was proven right about the spying, and I will be proven right about 2020.”\nThe same development was likewise hailed loudly by Tucker Carlson on Fox News and on social media by loyalists including Donald Trump Jr, Ronna McDaniel, Ted Cruz, Kevin McCarthy, Marjorie Taylor Greene, Mark Meadows and <span class='selected-term'>Jim Jordan</span> but what exactly has Mr Durham alleged?",
    "author": "Joe Sommerlad",
    "title": "Why Donald Trump is once again claiming Democrats ‘spied’ on him"
  }
]