[
  {
    "id": 1911,
    "mediaId": 2550,
    "date": "2022-02-08",
    "sentence": "https://t.co/TZDSTI5Oq0\n— Olivia Beavers (@Olivia_Beavers) October 26, 2021\nNehls never had his shot on the Jan. 6 committee because McCarthy ultimately withdrew his name and every other Republican he proposed for the panel after Speaker Pelosi rejected two of his selections: Rep. <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana.",
    "author": "",
    "title": "Texas Republican and Trump ally accuses Capitol Police of snooping through his office"
  },
  {
    "id": 2032,
    "mediaId": 2699,
    "date": "2022-02-08",
    "sentence": "In July, House Majority Leader Kevin McCarthy nominated Nehls to the Jan. 6 committee, along with Reps. <span class='selected-term'>Jim Jordan</span> (R-OH), Rodney Davis (R-IL), Kelly Armstrong (R-ND), and Jim Banks (R-IN).",
    "author": "Roger Sollenberger",
    "title": "GOP Rep. Claims Capitol Police Secretly Broke Into His Office"
  },
  {
    "id": 2449,
    "mediaId": 2564,
    "date": "2022-02-08",
    "sentence": "His nomination was withdrawn in protest by McCarthy after House Speaker Nancy Pelosi objected to Donald Trump allies Reps. <span class='selected-term'>Jim Jordan</span> and Jim Banks being on the panel.",
    "author": "Elizabeth Elkind",
    "title": "Republican Rep. Troy Nehls claims Capitol Police disguised as construction workers snuck into his office to take photos of his files after he was picked for the GOP panel to investigate January 6 'security failures'"
  },
  {
    "id": 1866,
    "mediaId": 2643,
    "date": "2022-02-09",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) has said \"we need to get to the truth\" after another GOP lawmaker claimed the U.S. Capitol Police had been spying on him.",
    "author": "Ewan Palmer",
    "title": "Jim Jordan Says We Must 'Get to the Truth' Over Capitol Police Spying Claim"
  },
  {
    "id": 968,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "Pelosi did not object to Nehls, but McCarthy pulled all of his nominees when Pelosi rejected Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Jim Banks, R-Ind., because they had worked to defend Trump on the House Judiciary Committee during House Democrat-led impeachment inquiries.",
    "author": "Eric Mack",
    "title": "Trump Endorses Texas GOP Reps. Nehls, Gooden, Weber"
  },
  {
    "id": 949,
    "mediaId": 2550,
    "date": "2022-02-18",
    "sentence": "But his nomination was also accompanied by McCarthy’s picks, Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana.",
    "author": "",
    "title": "U.S. Capitol Police watchdog: Long way to go on security improvements"
  }
]