[
  {
    "id": 4539,
    "mediaId": 2615,
    "date": "2022-01-11",
    "sentence": "Seth takes a closer look at Congressman <span class='selected-term'>Jim Jordan</span> refusing to cooperate with the January 6 investigation and Sen. Ted Cruz debasing himself on Fox News.",
    "author": "Charles Johnson",
    "title": "Seth Meyers: Ted Cruz Humiliates Himself by Groveling to Tucker Carlson on Fox News"
  },
  {
    "id": 4571,
    "mediaId": 2724,
    "date": "2022-01-12",
    "sentence": "pic.twitter.com/8AWWLhMxNy\n— Scott Morefield (@SKMorefield) January 12, 2022\nRELATED: GOP Senator Slams ‘Least Trusted Bureaucrat’ After Fauci Is Caught On Hot Mic Calling Him A ‘Moron’\nCarlson Excoriates ‘Filthy Little Demagogue’ Fauci\nCarlson said at the beginning of his monologue, “Turns out, Tony Fauci’s even more loathsome and complicit even than his toughest critics ever alleged.”\n“Today, two Republican congressmen, James Comer and <span class='selected-term'>Jim Jordan</span>, released emails that show Fauci was warned by scientists at the very beginning of the Corona pandemic this virus very likely leaked from the Wuhan Institute of Virology,” Carlson said.",
    "author": "John Hanson",
    "title": "Tucker Carlson Goes All In: Blasts Fauci As ‘Filthy Little Demagogue’"
  },
  {
    "id": 3861,
    "mediaId": 2748,
    "date": "2022-01-24",
    "sentence": "",
    "author": "",
    "title": "Must See: Tucker SLAMS Kamala's Illegitimate Election Claims"
  },
  {
    "id": 2641,
    "mediaId": 2526,
    "date": "2022-02-05",
    "sentence": "For the 2022 midterms, nearly 100 Republican lawmakers have accepted donations from the Koch Industries PAC, including Reps. Liz Cheney (R-WY), Jeff Duncan (R-SC), Don Bacon (R-NE), Tony Gonzalez (R-TX), Adam Kinzinger (R-IL), Ashley Hinson (R-IA), Julia Letlow (R-LA), Jackie Walorski (R-IN), Garret Graves (R-LA), Jim Banks (R-IN), Byron Donalds (R-FL), Yvette Herrell (R-NM), and <span class='selected-term'>Jim Jordan</span> (R-OH), among others.",
    "author": "John Binder",
    "title": "Axios: Breitbart News Readers, Trump’s Small-Dollar Donors Steer ‘Modern’ GOP as Corporate Class Fades"
  },
  {
    "id": 1793,
    "mediaId": 2573,
    "date": "2022-02-09",
    "sentence": "Here with the very latest is the ranking member of the House Judiciary Committee, Congressman <span class='selected-term'>Jim Jordan</span>, along with former White House chief of staff and former congressman, Mark Meadows, is with us.",
    "author": "",
    "title": "'Hannity' on Capitol Police"
  },
  {
    "id": 2356,
    "mediaId": 2699,
    "date": "2022-02-10",
    "sentence": "Ted Cruz (R-TX) and Marsha Blackburn (R-TN), and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) called for an end to “government-funded crack pipes,” other politicians insisted this was part of Biden’s plans for racial justice.",
    "author": "Justin Baragona",
    "title": "How the White House Caved to Fox News’ Biden ‘Crack Pipe’ Faux-Scandal"
  },
  {
    "id": 1015,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Laura Collins & Elizabeth Elkind &",
    "title": "Exclusive: Clinton cornered: Hillary refuses to answer questions about Durham revelation she paid to spy on the Trump campaign as she arrives at daughter Chelsea's Manhattan home ahead of the New York Democratic Convention"
  },
  {
    "id": 1137,
    "mediaId": 2594,
    "date": "2022-02-16",
    "sentence": "In a stronger period of time in our country, this crime would have been punishable by death.”\nIn an even briefer statement three days later, evidently still basking in the glow of apparent triumph, he proclaimed: “I was proven right about the spying, and I will be proven right about 2020.”\nThe same development was likewise hailed loudly by Tucker Carlson on Fox News and on social media by loyalists including Donald Trump Jr, Ronna McDaniel, Ted Cruz, Kevin McCarthy, Marjorie Taylor Greene, Mark Meadows and <span class='selected-term'>Jim Jordan</span> but what exactly has Mr Durham alleged?",
    "author": "Joe Sommerlad",
    "title": "Why Donald Trump is once again claiming Democrats ‘spied’ on him"
  },
  {
    "id": 895,
    "mediaId": 2573,
    "date": "2022-02-16",
    "sentence": "When <span class='selected-term'>Jim Jordan</span> and myself said that they were spying on his campaign, we were ridiculed.",
    "author": "",
    "title": "'Hannity' on Durham findings, Canadian truckers"
  },
  {
    "id": 150,
    "mediaId": 2672,
    "date": "2022-02-24",
    "sentence": "But only a few days later, during a segment with Rep. <span class='selected-term'>Jim Jordan</span>, Tucker voiced the same sentiment more clearly: “I think we should probably take the side of Russia,” he said, “if we have to choose between Russia and Ukraine.”\nDespite saying that he was \"just kidding\" about rooting for Russia over Ukraine, Tucker just doubled down on supporting the Russians in the conflict.",
    "author": "Tim Dickinson",
    "title": "These Are the American Right-Wingers Covering for Putin as Russia Invades Ukraine"
  },
  {
    "id": 12928,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Jack Wright & Harriet Alexander",
    "title": "Parents grieve over toddler killed by shrapnel hours before 'ceasefire' intended to let them evacuate - which Putin's troops ignored anyway: Civilians attempting to escape Mariupol are forced back by shelling as Russians break pledge"
  },
  {
    "id": 12526,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Natasha Anderson &",
    "title": "Nearly there! People's Convoy rolls into Maryland as 30 mile caravan of anti-mandate protesters approach their final destination of Washington DC and tease possible visit to WHITE HOUSE"
  },
  {
    "id": 7817,
    "mediaId": 2724,
    "date": "2022-04-06",
    "sentence": "Breaking: Following @FDRLST reporting that Adam Schiff and his staff doctored a text message between <span class='selected-term'>Jim Jordan</span> and former WH chief of staff Mark Meadows, the House Jan. 6 committee has just admitted that it did, in fact, doctor the text message.https://t.co/78aRNyOib7\n— Mollie (@MZHemingway) December 15, 2021\nIt seems there isn’t much that Kinzinger isn’t willing to believe if it casts a negative pall on his political adversaries.",
    "author": "Rusty Weiss",
    "title": "Never Trumper Adam Kinzinger Falls For Fake Tucker Carlson Quote Shared By Fellow ‘Never Trumper’ Joe Walsh"
  },
  {
    "id": 5286,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Emily Crane",
    "title": "NY, Calif. failed in handling of COVID — but Florida was among best: study"
  },
  {
    "id": 5449,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "Must See: Engelbrecht and Phillips on the Charlie Kirk Show on 2020 Fraud and “2000 Mules” – Cross-State Ballot Traffickers ID’ed – Brian Kemp Implicated – 1155 Ballot Traffickers in PA (Video)"
  },
  {
    "id": 5344,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "“I’m Defending the Right to Express Your Views Under the First Amendment” – Alan Dershowitz Speaks Out in Defense of J6er He Is Representing who Was Waved in to US Capitol (Video)"
  },
  {
    "id": 5972,
    "mediaId": 2741,
    "date": "2022-04-14",
    "sentence": "Troy Nehls, a Texas Republican, simply wrote, “Make Twitter Great Again,” while Rep. <span class='selected-term'>Jim Jordan</span> praised Musk on Fox, painting him as the embodiment of “free speech.”\nLast Saturday, Musk rejected an offer from Twitter to join the company’s board—a move that would have barred him from acquiring a Twitter stake greater than 14.9%.",
    "author": "Caleb Ecarma",
    "title": "Right-Wingers Are Absolutely Eating Up the Idea of Elon Musk Taking Over Twitter"
  },
  {
    "id": 5749,
    "mediaId": 2634,
    "date": "2022-04-18",
    "sentence": "Graduates of the institute include Mike Pence, Representative <span class='selected-term'>Jim Jordan</span>, and Project Veritas founder James O’Keefe.",
    "author": "Anne Nelson",
    "title": "10 People You’ve Never Heard of Who Are Destroying Democracy"
  }
]