[
  {
    "id": 4571,
    "mediaId": 2724,
    "date": "2022-01-12",
    "sentence": "pic.twitter.com/8AWWLhMxNy\n— Scott Morefield (@SKMorefield) January 12, 2022\nRELATED: GOP Senator Slams ‘Least Trusted Bureaucrat’ After Fauci Is Caught On Hot Mic Calling Him A ‘Moron’\nCarlson Excoriates ‘Filthy Little Demagogue’ Fauci\nCarlson said at the beginning of his monologue, “Turns out, Tony Fauci’s even more loathsome and complicit even than his toughest critics ever alleged.”\n“Today, two Republican congressmen, James Comer and <span class='selected-term'>Jim Jordan</span>, released emails that show Fauci was warned by scientists at the very beginning of the Corona pandemic this virus very likely leaked from the Wuhan Institute of Virology,” Carlson said.",
    "author": "John Hanson",
    "title": "Tucker Carlson Goes All In: Blasts Fauci As ‘Filthy Little Demagogue’"
  },
  {
    "id": 3705,
    "mediaId": 2573,
    "date": "2022-01-25",
    "sentence": "In a letter to Health and Human Services Secretary Xavier Becerra, Reps. James Comer, R-Ky., and <span class='selected-term'>Jim Jordan</span>, R-Ohio, pointed to a Feb. 1, 2020, conference call that included Fauci and former National Institutes of Health Director Francis Collins in which the virus's origins were discussed.",
    "author": "Ronn Blitzer",
    "title": "Reps. Comer, Jordan expose new Fauci emails they say point to COVID-19 lab leak 'cover up'"
  },
  {
    "id": 2043,
    "mediaId": 2740,
    "date": "2022-02-08",
    "sentence": "Ohio Rep. <span class='selected-term'>Jim Jordan</span>, who now serves as the lead Republican on the House Judiciary Committee, fumed that “Hillary Clinton gets treated different than anybody else.” Another member of the panel stated, “This is the reason for this hearing – the sloppiness, the messiness, and the ability for a secretary of State to do something that shouldn’t have been done.” Another Republican weighed in, “I want to know about the destruction – the hammering of BlackBerrys.” The panel’s chairman at the time, Jason Chaffetz, who can now be seen espousing self-righteous nonsense of Fox News, attacked Clinton, “The secretary had a choice.",
    "author": "Kurt Bardella",
    "title": "The 'but Hillary’s emails' crowd goes silent about Trump’s document destruction"
  },
  {
    "id": 2248,
    "mediaId": 2688,
    "date": "2022-02-10",
    "sentence": "But despite the missing call records, the Jan. 6 committee has reportedly unearthed information on at least one of Trump’s most highly scrutinized calls: A call between him and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Cristina Cabrera",
    "title": "Report: Jan. 6 Panel Finds Holes In Trump’s Official Call Logs On Day Of Insurrection"
  },
  {
    "id": 945,
    "mediaId": 8322,
    "date": "2022-02-11",
    "sentence": "Comer and Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, published portions of emails last month revealing Fauci knew that COVID-19 may have been intentionally modified and leaked from the Wuhan Institute of Virology.",
    "author": "",
    "title": "Rep. Comer accuses Fauci, CCP of covering up COVID origins 'from day one': 'Is he a mad scientist?'"
  },
  {
    "id": 5268,
    "mediaId": 2618,
    "date": "2022-04-12",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) joined Fox News’ “Fox and Friends” Tuesday and said he believes President Joe Biden was most certainly involved in his son Hunter’s business dealings with foreign entities though the president predictably continues to deny it.His statement comes on the heels of a House Oversight Committee’s call for further investigation into the text messages allegedly stored on Hunter Biden’s infamous laptop that was abandoned to a Wilmington, DE, repair shop in 2019.",
    "author": "Frank Webster",
    "title": "Jim Jordan vows to expose Joe’s role in corrupt Biden ‘family enterprise’"
  },
  {
    "id": 5740,
    "mediaId": 2522,
    "date": "2022-04-12",
    "sentence": "SIGN UP HERE\n(Video: Fox News)\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) joined Fox News’ “Fox and Friends” Tuesday and said he believes President Joe Biden was most certainly involved in his son Hunter’s business dealings with foreign entities though the president predictably continues to deny it.",
    "author": "Frank Webster",
    "title": "Jim Jordan vows to expose Joe’s role in corrupt Biden ‘family enterprise’"
  },
  {
    "id": 5596,
    "mediaId": 2642,
    "date": "2022-04-14",
    "sentence": "We’re going to look at all those issues because the American people deserve the truth.”\nYou can watch the video below:\nWe need someone like <span class='selected-term'>Jim Jordan</span> in the Speaker role.",
    "author": "Sophie O’Hara",
    "title": "[VIDEO] Jim Jordan Makes a Promise to Voters… Vows to Expose Joe’s Role in “Biden Crime Family Enterprise”"
  },
  {
    "id": 5754,
    "mediaId": 2562,
    "date": "2022-04-21",
    "sentence": "Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Andy Biggs, R-Ariz., were among the letter's signatories.",
    "author": "NationalWatch",
    "title": "House GOP Asks Why Late Moscow Mayor’s Wife Not Sanctioned"
  }
]