[
  {
    "id": 4073,
    "mediaId": 6621,
    "date": "2022-01-24",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), ranking member of the House Judiciary Committee, has tipped his hand on what he will do if the GOP flips the House after midterms, making Jordan chairman.",
    "author": "",
    "title": "JORDAN’S HIT LIST: GOP Majority Going After Garland, Mayorkas, Fauci"
  },
  {
    "id": 3647,
    "mediaId": 2746,
    "date": "2022-01-27",
    "sentence": "In a letter sent Thursday, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio and Rep. Mike Johnson of Louisiana asked Mr. Wray if the FBI has located a cache of missing files from applications submitted to the Foreign Intelligence Surveillance Court.",
    "author": "Emily Zantow",
    "title": "GOP lawmakers demand FBI detail efforts to rein in secret surveillance warrants"
  },
  {
    "id": 3433,
    "mediaId": 2644,
    "date": "2022-01-28",
    "sentence": "“Racism is an evil that our country has fought against for generations, and we must stand up for the rights of all Americans to receive equal protection under the law,” Reps. <span class='selected-term'>Jim Jordan</span> of Ohio, Dan Bishop of North Carolina, Darrell Issa of California and 13 others wrote in a Friday letter to Attorney General Merrick Garland.",
    "author": "Steven Nelson",
    "title": "Republicans ask DOJ to probe ‘racial discrimination’ against whites in COVID treatment"
  },
  {
    "id": 3413,
    "mediaId": 2746,
    "date": "2022-01-28",
    "sentence": "The four-page letter was signed by Reps. Andy Biggs of Arizona; Chip Roy of Texas; Cliff Bentz of Oregon; Dan Bishop of North Carolina; Darrell Issa of California; <span class='selected-term'>Jim Jordan</span> of Ohio; Ken Buck of Colorado; Louie Gohmert of Texas; Matt Gaetz of Florida; Michelle Fischbach of Minnesota; Mike Johnson of Louisiana; Scott Fitzgerald of Wisconsin; Tom McClintock of California; Tom Tiffany of Wisconsin; W. Gregory Steube of Florida and Victoria Spartz of Indiana.",
    "author": "Emily Zantow",
    "title": "House Republicans press DOJ on ‘racial discrimination’ in COVID-19 treatment policies"
  },
  {
    "id": 3347,
    "mediaId": 2521,
    "date": "2022-01-31",
    "sentence": "Honig also brought up Ivanka Trump — the former president’s daughter, who served as a top adviser in his administration; and GOP Reps. Kevin McCarthy (Calif.), <span class='selected-term'>Jim Jordan</span> (Ohio), and Scott Perry (Pa.).",
    "author": "Caleb Newton",
    "title": "Criminal Referrals For Trump Lawyers Via Jan. 6 Panel Pushed By Analyst"
  },
  {
    "id": 1812,
    "mediaId": 2643,
    "date": "2022-02-06",
    "sentence": "Attorney Neal Katyal, who previously served as principal deputy solicitor general and acting solicitor general for the Justice Department, said that former President Donald Trump, Representative <span class='selected-term'>Jim Jordan</span> and Trump allies are utilizing \"bad mob tactics\" in response to the House select committee investigating the January 6, 2021 attack against the U.S. Capitol.",
    "author": "Jason Lemon",
    "title": "Trump, Jordan Using 'Bad Mob Tactics' in Face of 1/6 Probe: Ex-DOJ Official"
  },
  {
    "id": 2039,
    "mediaId": 2744,
    "date": "2022-02-10",
    "sentence": "GOP Rep. <span class='selected-term'>Jim Jordan</span>, who serves as ranking member on the House Judiciary Committee, and 17 fellow Republicans sent a Thursday letter obtained by the Washington Examiner to FBI Director Christopher Wray blasting the bureau for not sufficiently answering months of questions despite significant pressure from congressional Republicans.",
    "author": "Jerry Dunleavy",
    "title": "GOP: FBI ‘refusing to accept accountability’ for enforcing DOJ school boards memo"
  },
  {
    "id": 1660,
    "mediaId": 2664,
    "date": "2022-02-11",
    "sentence": "\"I mean, I talked to Kevin McCarthy, I have talked to <span class='selected-term'>Jim Jordan</span> and I have talked to other members who were speaking to the president, the former president that day,\" he reported.",
    "author": "Tom Boggioni",
    "title": "Here's why Trump may be headed for a 'criminal referral'"
  },
  {
    "id": 1401,
    "mediaId": 2548,
    "date": "2022-02-14",
    "sentence": "(RELATED : ‘As Wrong As It Gets’: Rep. <span class='selected-term'>Jim Jordan</span> Calls Out Liberal Media And Democrats For Denying That Trump Was Spied On)\n“Jacqui, my answer is not going to change, I refer you to the Department of Justice,” Jean-Pierre repeated.",
    "author": "Nicole Silverio",
    "title": "‘Can’t Speak To That’: Karine Jean-Pierre Repeatedly Dodges Questions On Durham Report When Pressed By Fox News Reporter"
  },
  {
    "id": 986,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "School officials or parents in 15 different counties received or witnessed threats they considered serious enough to report to police.”\nAccording to Republicans from state attorneys general to Rep. <span class='selected-term'>Jim Jordan</span> to Sen. Josh Hawley and Florida Gov.",
    "author": "Laura Clawson",
    "title": "'You better grow eyes in the back of your head': Death threats to school boards are very real"
  },
  {
    "id": 1418,
    "mediaId": 2547,
    "date": "2022-02-17",
    "sentence": "School officials or parents in 15 different counties received or witnessed threats they considered serious enough to report to police.”\nAccording to Republicans from state attorneys general to Rep. <span class='selected-term'>Jim Jordan</span> to Sen. Josh Hawley and Florida Gov.",
    "author": "Laura Clawson",
    "title": "Death Threats To School Boards Are Very Real"
  },
  {
    "id": 1433,
    "mediaId": 2866,
    "date": "2022-02-18",
    "sentence": "Ohio Rep. <span class='selected-term'>Jim Jordan</span>, the top Republican on the House Judiciary Committee, is requesting the Justice Department provide information about its new domestic terrorism office, considering the agency’s plans last year regarding parents at school board meetings.",
    "author": "Fix This Nation Staff",
    "title": "Are School Parents A Target With DOJ’s New Domestic Terror Office?"
  },
  {
    "id": 11268,
    "mediaId": 2744,
    "date": "2022-03-10",
    "sentence": "",
    "author": "Jerry Dunleavy",
    "title": "Garland says Capitol riot investigation is ‘most urgent’ in DOJ’s history"
  },
  {
    "id": 11514,
    "mediaId": 2701,
    "date": "2022-03-10",
    "sentence": "According to a letter sent on Wednesday from Rep. <span class='selected-term'>Jim Jordan</span>, ranking member of the House Judiciary Committee, to FBI Director Christopher Wray, the FBI agent filed a whistleblower disclosure about the pipe bomb investigation — an investigation the Associated Press had characterized as “one of the highest-priority investigations for the FBI and the Justice Department.” The agent alleged that on Feb. 7, 2022, more than a year after the bombs were planted, the bureau’s Washington Field Office asked its other field offices “to canvass all confidential human sources nationwide for information about the individual and the crime.”\nThe canvass should “include sources reporting on all [types of] threats,” the message from Washington to the other FBI field offices requested, because the bomber’s “motive and ideology remain unknown.”\n“The special agent explained that the [Washington Field Office] request was ‘unusual’ because it was transmitted more than a year after the FBI had begun the investigation, and it raises questions about the progress and extent of the FBI’s investigation,” Jordan’s letter said.",
    "author": "Kylee Zempel",
    "title": "Whistleblower: FBI Is Just Now Asking Basic Questions About Jan. 6 Pipe Bombs — A Year Into Its Investigation"
  },
  {
    "id": 11444,
    "mediaId": 2668,
    "date": "2022-03-16",
    "sentence": "House Judiciary Committee Ranking Member Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Rep. Dan Bishop (R-N.C.) also went off, according to the DC, with Jordan calling it “crazy” and pointing out that everything about the Capitol is taxpayer-funded, and Bishop calling it “absurd” and noting that “the new normal for Democrats [is] to treat working-class Americans with disdain.”\nSen. Marshall also took shots at Politico for its breathless reporting:\nPulitzer Prize-winning article right here ?",
    "author": "Sister Toldjah",
    "title": "Kansas Senator Responds Accordingly to 'Hill Aide' Who Reported His Trucker Convoy Tour to the DOJ"
  },
  {
    "id": 9642,
    "mediaId": 2573,
    "date": "2022-03-21",
    "sentence": "",
    "author": "",
    "title": "Rep. Ken Buck leads letter to DOJ demanding action on surging retail crime"
  },
  {
    "id": 9589,
    "mediaId": 2641,
    "date": "2022-03-23",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, says FBI Director Christopher Wray needs to explain why an internal audit of the FBI has found violations of its own policies when conducting surveillance investigations, The Washington Examiner reported.",
    "author": "Peter Malbin",
    "title": "Rep. Jim Jordan: 'Pattern of Misconduct and Mismanagement Within the FBI'"
  },
  {
    "id": 7881,
    "mediaId": 2688,
    "date": "2022-03-31",
    "sentence": "Strzok imagined a Republican-controlled Congress with committees led by figures like Reps. <span class='selected-term'>Jim Jordan</span> (R-OH) and Marjorie Taylor Greene (R-GA), “whose entire existence is devoted to gumming up any DOJ and FBI investigation.”\n“I don’t think anybody can predict what they might do,” he said.",
    "author": "Matt Shuham",
    "title": "Is The Justice Department Finally Going After The Insurrection’s Big Fish?"
  },
  {
    "id": 7489,
    "mediaId": 2576,
    "date": "2022-04-03",
    "sentence": "When House Speaker Nancy Pelosi rejected two of the five — Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Jim Banks (R-Ohio) — McCarthy decreed that his caucus would boycott the Jan. 6 committee altogether.",
    "author": "Detroit Free Press Editorial Board",
    "title": "Editorial: Will we ever learn what happened on Jan. 6?"
  },
  {
    "id": 4940,
    "mediaId": 2664,
    "date": "2022-04-20",
    "sentence": "\"The time period during which there is a gap in the phone logs includes at least five calls from or to President Trump whose occurrence has been documented in the public record,\" the letter notes, pointing to his reported correspondence with then-Vice President Mike Pence, House Minority Leader Kevin McCarthy, R-Calif., Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, then-Sen. Kelly Loeffler, R-Ga., and Sen. Mike Lee, R-Utah—who supposedly passed his phone to Sen. Tommy Tuberville, R-Ala.",
    "author": "Jessica Corbett",
    "title": "DOJ faces demands to investigate if Trump 'mutilated or destroyed' records to cover up crimes"
  },
  {
    "id": 5059,
    "mediaId": 2862,
    "date": "2022-04-23",
    "sentence": "In a December filing, Mark Meadows requested the invalidation of two “overly broad and unduly burdensome” subpoenas issued by the House panel probing the Jan... 23.04.2022, Sputnik International\nhttps://cdnn1.img.sputniknews.com/img/07e6/04/17/1094999985_0:0:3073:1728_1920x0_80_0_0_a8c9b5795920773e041faf2a45445b2a.jpg.webp\nWhite House Chief of Staff Mark Meadows was warned of impending violence in association with the certification of Electoral College votes in the 2020 US presidential election, claimed Cassidy Hutchinson, a special assistant in the Trump White House who recently testified before the House Select Committee to Investigate the January 6th Attack on the US Capitol.Hutchinson told the 9-member panel of seven Democrats and two Republicans that Anthony Oranto, assistant director of the US Secret Service Office of Training, informed Meadows that there were concerns of violence surrounding the certification of Electoral College votes led by then-Vice President Mike Pence.The details of their conversation was not made clear in the testimony, which was included in the Jan. 6 panel’s Friday court filing.Texts messages from Meadows’ phone were also released by the panel, including one authored by Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), who told Meadows on Jan. 5 that Pence, as president of Congress, “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”Meadows has passed over 2,319 relevant text messages to the Jan. 6 panel, but has withheld some 1,000.",
    "author": "Evan Craighead",
    "title": "Mark Meadows Was Warned of Possible Violence Ahead of Jan. 6, Ex-Official Tells Panel"
  }
]