[
  {
    "id": 4539,
    "mediaId": 2615,
    "date": "2022-01-11",
    "sentence": "Seth takes a closer look at Congressman <span class='selected-term'>Jim Jordan</span> refusing to cooperate with the January 6 investigation and Sen. Ted Cruz debasing himself on Fox News.",
    "author": "Charles Johnson",
    "title": "Seth Meyers: Ted Cruz Humiliates Himself by Groveling to Tucker Carlson on Fox News"
  },
  {
    "id": 4589,
    "mediaId": 2724,
    "date": "2022-01-12",
    "sentence": "https://t.co/Y3FE2Fjjpi\n— Dukesmojo (@dukesmojo) January 12, 2022\nRELATED: GOP Rep. <span class='selected-term'>Jim Jordan</span> Refuses To Cooperate With Democrats’ Jan. 6 Committee, Calls Request ‘Unprecedented And Inappropriate’\n“If the Republican Party is going to have any future it has to get back to being a party of ideas and ideology and not this anti-truth cult of the former president,” Schiff said.",
    "author": "John Hanson",
    "title": "Adam Schiff Says Republicans Won’t Have ‘Any Future’ As Trump’s ‘Anti-Truth Cult’"
  },
  {
    "id": 3593,
    "mediaId": 2724,
    "date": "2022-01-18",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> warned that Republicans will “definitely” investigate Dr. Anthony Fauci should the GOP win back the House in 2022.",
    "author": "Rusty Weiss",
    "title": "Jim Jordan: We’re ‘Definitely’ Investigating Fauci If Republicans Win Back The House"
  },
  {
    "id": 3596,
    "mediaId": 8413,
    "date": "2022-01-19",
    "sentence": "NAYS: Bob Latta R-OH (5th), <span class='selected-term'>Jim Jordan</span> R-OH (4th)\nYEAS: Marcy Kaptur, D-OH (9th)\nSenate\nSenate Vote 1:\nDIGITAL ECONOMY: The Senate has confirmed the nomination of Alan Davidson to serve as the Commerce Department's assistant secretary for communications and information.",
    "author": "",
    "title": "Here's how area members of Congress voted"
  },
  {
    "id": 4188,
    "mediaId": 2540,
    "date": "2022-01-21",
    "sentence": "The shift in the balance of power within the House GOP conference -- from institutionalists like John Boehner to conservative rabble-rousers like <span class='selected-term'>Jim Jordan</span> -- is reflected in McCarthy's own evolution from young establishment Republican to dedicated Trump ally.",
    "author": "Michael Warren and Melanie Zanona",
    "title": "Kevin McCarthy's path to speakership enters final but treacherous leg"
  },
  {
    "id": 2930,
    "mediaId": 2526,
    "date": "2022-01-29",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), the ranking Republican member of the House Judiciary Committee, appeared on SiriusXM’s Breitbart News Saturday with Matt Boyle today.",
    "author": "Allum Bokhari",
    "title": "EXCLUSIVE: Jim Jordan Slams Senate Democrat Attempts to Revive Media Cartel Act"
  },
  {
    "id": 3074,
    "mediaId": 2550,
    "date": "2022-02-01",
    "sentence": "One such record was a text from Rep. <span class='selected-term'>Jim Jordan</span> of Ohio to Meadows that advocated for then-Vice President Mike Pence to “call out all electoral votes he believes are unconstitutional as no electoral votes at all.”\nPence did not have that power.",
    "author": "",
    "title": "Court orders Eastman to cough up records on Jan. 6"
  },
  {
    "id": 2798,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Kinzinger and Cheney are the only two Republicans serving on the January 6 committee after McCarthy withdrew his slate of members during negotiations over the panel's configuration and House Speaker Nancy Pelosi denied seats on the panel to ultra-conservative Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio -- both of whom objected to congressional certification of the election results from two states on January 6, 2021.",
    "author": "Gabby Orr",
    "title": "Proposal to endorse removing Cheney and Kinzinger from House GOP Conference gets more than 50 RNC co-sponsors"
  },
  {
    "id": 3321,
    "mediaId": 8322,
    "date": "2022-02-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, joined \"The Ingraham Angle\" on Monday to discuss what he believes are unprecedented moves from the Biden administration against law-abiding Americans.",
    "author": "Fox News Staff",
    "title": "Rep. Jim Jordan: Second Amendment under attack by Biden administration"
  },
  {
    "id": 2164,
    "mediaId": 2594,
    "date": "2022-02-04",
    "sentence": "House Minority Leader Kevin McCarthy initially announced a slate of Republicans that included allies of Mr Trump like Reps Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Eric Garcia",
    "title": "RNC votes to censure Liz Cheney and Adam Kinzinger over January 6 committee investigation"
  },
  {
    "id": 1822,
    "mediaId": 2643,
    "date": "2022-02-05",
    "sentence": "Representative Jim McGovern, a Massachusetts Democrat, has suggested that Representative <span class='selected-term'>Jim Jordan</span>, an Ohio Republican, may be \"trying to hide\" something after a report this week revealed phone records show that the GOP congressman spoke with former President Donald Trump for about 10 minutes on the morning of January 6, 2021.",
    "author": "Jason Lemon",
    "title": "Jim Jordan 'Trying to Hide' Something on 1/6 Trump Call, Suggests McGovern"
  },
  {
    "id": 2591,
    "mediaId": 2580,
    "date": "2022-02-05",
    "sentence": "This deep distrust includes two prominent members of Congress, Rep. <span class='selected-term'>Jim Jordan</span>, ranking member of the Committee on the Judiciary, and U.S. Sen. Roger Marshall, R-Kan., a scientist and physician I spoke with on Wednesday.",
    "author": "GOPUSA",
    "title": "Rep. Jim Jordan and Sen. Roger Marshall Expose Fauci’s Web of Deceit"
  },
  {
    "id": 1812,
    "mediaId": 2643,
    "date": "2022-02-06",
    "sentence": "Attorney Neal Katyal, who previously served as principal deputy solicitor general and acting solicitor general for the Justice Department, said that former President Donald Trump, Representative <span class='selected-term'>Jim Jordan</span> and Trump allies are utilizing \"bad mob tactics\" in response to the House select committee investigating the January 6, 2021 attack against the U.S. Capitol.",
    "author": "Jason Lemon",
    "title": "Trump, Jordan Using 'Bad Mob Tactics' in Face of 1/6 Probe: Ex-DOJ Official"
  },
  {
    "id": 2032,
    "mediaId": 2699,
    "date": "2022-02-08",
    "sentence": "In July, House Majority Leader Kevin McCarthy nominated Nehls to the Jan. 6 committee, along with Reps. <span class='selected-term'>Jim Jordan</span> (R-OH), Rodney Davis (R-IL), Kelly Armstrong (R-ND), and Jim Banks (R-IN).",
    "author": "Roger Sollenberger",
    "title": "GOP Rep. Claims Capitol Police Secretly Broke Into His Office"
  },
  {
    "id": 1911,
    "mediaId": 2550,
    "date": "2022-02-08",
    "sentence": "https://t.co/TZDSTI5Oq0\n— Olivia Beavers (@Olivia_Beavers) October 26, 2021\nNehls never had his shot on the Jan. 6 committee because McCarthy ultimately withdrew his name and every other Republican he proposed for the panel after Speaker Pelosi rejected two of his selections: Rep. <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana.",
    "author": "",
    "title": "Texas Republican and Trump ally accuses Capitol Police of snooping through his office"
  },
  {
    "id": 2395,
    "mediaId": 2522,
    "date": "2022-02-08",
    "sentence": "He was an original member of the Jan. 6 select committee, but Republicans decided not to participate after Pelosi refused to seat Reps. <span class='selected-term'>Jim Jordan</span> and Jim Banks.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Fuming GOP rep accuses Capitol Police of ‘illegally’ investigating his office, says staffer ‘caught them in the act’"
  },
  {
    "id": 2418,
    "mediaId": 2550,
    "date": "2022-02-09",
    "sentence": "*Some of those who voted against the bill include the MAGA all-star clown car of Marjorie Taylor Greene, Paul Gosar, Lauren Boebert, Madison Cawthorn, <span class='selected-term'>Jim Jordan</span>, and Chip Roy, among others.",
    "author": "",
    "title": "Rep. Matt Gaetz gives speech against sexual harassment. Yes, that Matt Gaetz"
  },
  {
    "id": 2556,
    "mediaId": 2547,
    "date": "2022-02-09",
    "sentence": "*Some of those who voted against the bill include the MAGA all-star clown car of Marjorie Taylor Greene, Paul Gosar, Lauren Boebert, Madison Cawthorn, <span class='selected-term'>Jim Jordan</span>, and Chip Roy, among others.",
    "author": "Walter Einenkel",
    "title": "Eyeroll Of The Week: Matt Gaetz's Speech On Sexual Harassment"
  },
  {
    "id": 2341,
    "mediaId": 2641,
    "date": "2022-02-09",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax that House Speaker Nancy Pelosi, D-Calif., was wrong to tell athletes at the 2022 Beijing Winter Olympics not to protest.",
    "author": "Nick Koutsobinas",
    "title": "Rep. Jim Jordan to Newsmax: Pelosi Wrong to Tell Olympians Not to Speak Out"
  },
  {
    "id": 1919,
    "mediaId": 2643,
    "date": "2022-02-09",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio) is attempting to rally the right by repeating a claim that the Biden administration is planning to hand out free \"crack pipes.\"",
    "author": "Aila Slisco",
    "title": "Jim Jordan Rallies the Right by Repeating Government 'Crack Pipe' Fable"
  },
  {
    "id": 1979,
    "mediaId": 2707,
    "date": "2022-02-10",
    "sentence": "As CNN reported last week, they show that Trump spoke on the phone at the White House residence with key Hill ally GOP Rep. <span class='selected-term'>Jim Jordan</span> of Ohio for 10 minutes on the morning of the January 6 — before Jordan took to the House floor to object to the certification of President Joe Biden’s Electoral College win.",
    "author": "Cnn Com",
    "title": "White House phone records show gaps during Jan 6 violence"
  },
  {
    "id": 1857,
    "mediaId": 8322,
    "date": "2022-02-10",
    "sentence": "",
    "author": "",
    "title": "Republicans concerned about Stanford law professor tapped to draw Connecticut redistricting map"
  },
  {
    "id": 1906,
    "mediaId": 2746,
    "date": "2022-02-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, Ohio Republican, defended arbitration as a cheaper, quicker alternative to litigation, which could limit victims from directly talking about their experiences.",
    "author": "Mica Soellner",
    "title": "Congress passes bipartisan bill ending forced arbitration in sexual misconduct cases"
  },
  {
    "id": 1889,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "\"How wonderful to have prime-time hearings that actually have people talking about Donald Trump taking records, official White House records, shredding them up, shoving them down the toilet, staff members coming in to testify and showing clips of [Rep.] <span class='selected-term'>Jim Jordan</span>, showing clips of everybody else on that committee talking about how sacred these official documents are and how horrible it was that Hillary Clinton, you know, did what we've found out it seems like so many people in the Trump administration did with their email accounts, and then again, the destruction of these documents and have the staff members running behind saying, 'Yeah, we always had to run in and grab the documents out of the trash can and piece them together, the ones we could, the ones that Donald wasn't flushing down the toilet.\"",
    "author": "Travis Gettys",
    "title": "Democrats can expose GOP ‘hypocrisy’ using Jim Jordan’s playbook: Morning Joe"
  },
  {
    "id": 957,
    "mediaId": 2578,
    "date": "2022-02-11",
    "sentence": "Completely devoid of any ethics or integrity, Schiff was caught red-handed only weeks ago editing the text messages of former White House Chief of Staff Mark Meadows as well as Congressman <span class='selected-term'>Jim Jordan</span> in the January 6th Witch Hunt.",
    "author": "Joe Hoft",
    "title": "ROGER STONE EXCLUSIVE: Liar Adam Schiff Faces Challenge from Fiery Conservative Woman Attorney, Descendant of Slaves"
  },
  {
    "id": 1333,
    "mediaId": 2643,
    "date": "2022-02-11",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> also believes the committee investigating the Capitol riot wants to keep Trump from running for the White House again.",
    "author": "Jenni Fink",
    "title": "Matt Gaetz Believes Jan. 6 Committee Will Try to Block Trump From 2024 Run"
  },
  {
    "id": 1400,
    "mediaId": 2659,
    "date": "2022-02-14",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio) said that former President Donald Trump’s call for the executions of those who worked on Hillary Clinton’s 2016 presidential campaign is “right on target.”\n“We’ve never seen anything like this in history,” Jordan told the hosts of “Fox and Friends.” “So, President Trump’s statement yesterday, I think is right on target.",
    "author": "Alan Ryland",
    "title": "Jim Jordan Says Trump’s Call for Clinton Campaign Executions is “Right on Target”"
  },
  {
    "id": 883,
    "mediaId": 2572,
    "date": "2022-02-15",
    "sentence": "House Minority Leader Kevin McCarthy, R-Calif., left, is joined by his picks for the Jan. 6 Select Committee after House Speaker Nancy Pelosi rejected two Republicans, Rep. Jim Banks, R-Ind., center, and Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, right, for the committee investigating the Jan. 6 Capitol insurrection, at the Capitol in Washington, Wednesday, July 21, 2021.",
    "author": "",
    "title": "Republicans 'concerned' by Durham allegations, McCarthy pledges oversight with potential House majority"
  },
  {
    "id": 922,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "\"In recent years, there has been growing public concern about the use of conservatorships to effectively deprive individuals of personal freedoms at the behest of others through the manipulation of the courts...the most striking example is perhaps the case of multi-platinum performing artist Britney Spears,\" reps Matt Gaetz and <span class='selected-term'>Jim Jordan</span> wrote in a Mar.",
    "author": "",
    "title": "Britney Spears Invited by Congress to Testify About Conservatorships"
  },
  {
    "id": 1644,
    "mediaId": 8369,
    "date": "2022-02-16",
    "sentence": "Perhaps then, following on the tendentiously ideological “findings” of the January 6 Commission which will surface conveniently prior to the election, the House decides to expel some members who are already in congress (e.g.. Rep <span class='selected-term'>Jim Jordan</span>) who supposedly had “contact” with the “insurrectionists”?",
    "author": "Boyd D. Cathey",
    "title": "Nightmare Scenario for the 2022 Congressional Elections?"
  },
  {
    "id": 968,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "Pelosi did not object to Nehls, but McCarthy pulled all of his nominees when Pelosi rejected Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Jim Banks, R-Ind., because they had worked to defend Trump on the House Judiciary Committee during House Democrat-led impeachment inquiries.",
    "author": "Eric Mack",
    "title": "Trump Endorses Texas GOP Reps. Nehls, Gooden, Weber"
  },
  {
    "id": 1451,
    "mediaId": 2643,
    "date": "2022-02-17",
    "sentence": "Right-wing political commentator Lou Dobbs expressed his hope that Representative <span class='selected-term'>Jim Jordan</span> of Ohio or Representative Matt Gaetz of Florida—both Republicans—could become House Speaker if the GOP retakes control of Congress' lower chamber in the upcoming midterm elections.",
    "author": "Jason Lemon",
    "title": "Lou Dobbs Backs Gaetz, Jordan Over McCarthy as Speaker if GOP Takes House"
  },
  {
    "id": 418,
    "mediaId": 2643,
    "date": "2022-02-20",
    "sentence": "Protestors in Ohio rallied outside of GOP Representative <span class='selected-term'>Jim Jordan</span>'s local office, urging the secretary of state to remove him from the ballot and prevent him from seeking another term in Congress.",
    "author": "Jason Lemon",
    "title": "Jim Jordan Should Be Disqualified From Ballot Over Jan. 6: Protestors"
  },
  {
    "id": 421,
    "mediaId": 2641,
    "date": "2022-02-22",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, on Tuesday sent a letter to House Judiciary Chairman Jerry Nadler, D-N.Y., demanding a hearing on what Jordan called the recent \"unprecedented spike\" in retail theft in cities across the country.",
    "author": "Jack Gournell",
    "title": "Rep. Jim Jordan Demands Hearing on Retail Crime Spike"
  },
  {
    "id": 13219,
    "mediaId": 2724,
    "date": "2022-02-28",
    "sentence": "“It would have been nice if the $85 billion in weapons left in Afghanistan could’ve been sent to Ukraine.” ~ Rep. <span class='selected-term'>Jim Jordan</span> (Ohio – R)\nRELATED: Newspaper Editorial Blames Right-Wing Rhetoric For Assassination Attempt On Louisville Mayoral Candidate After BLM Activist Was Charged\nJordan: State Department Too Focused On ‘Pronouns’ And ‘Gender-neutral Passports’\nJordan then said the U.S. government should concentrate more on “real diplomacy” than political correct nonsense.",
    "author": "John Hanson",
    "title": "Video: Jim Jordan Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine"
  },
  {
    "id": 13212,
    "mediaId": 2599,
    "date": "2022-03-01",
    "sentence": "",
    "author": "Stephen Green",
    "title": "Jim Jordan: House GOP Will Prioritize These 3 Investigations Next Year."
  },
  {
    "id": 13034,
    "mediaId": 2641,
    "date": "2022-03-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, who opposed the bill, said, \"Democrats are prioritizing this legislation, a bill to prohibit conduct already unlawful under our law, for political messaging reasons.",
    "author": "Nick Koutsobinas",
    "title": "GOP Stops House Bill Banning Race-Based Hair Discrimination"
  },
  {
    "id": 13073,
    "mediaId": 2650,
    "date": "2022-03-01",
    "sentence": "On Monday, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), the top Republican on the House Judiciary Committee, was asked to identify “the number one investigation that the House Republicans should put forward and pursue,” should the Republicans be in the majority next year after the midterm elections.",
    "author": "Matt Margolis",
    "title": "Jim Jordan: House GOP Will Prioritize These 3 Investigations Next Year"
  },
  {
    "id": 12488,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "will host a virtual pen and pad\n2 p.m. McCarthy, Scalise, Stefanik, Reps. Cathy McMorris Rodgers (R-Wash.), <span class='selected-term'>Jim Jordan</span> (R-Ohio), Kevin Hern (R-Okla.), Brian Steil (R-Wisc.",
    "author": "",
    "title": "Former Senate guy visits House chamber"
  },
  {
    "id": 12514,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, on Tuesday said that investigating Dr. Anthony Fauci, the country's leading expert on infectious disease, will be one of his top priorities if the GOP retakes the House in this year's midterm elections.",
    "author": "Jon Skolnik",
    "title": "Jim Jordan promises to investigate Dr. Fauci if GOP retakes the House this year"
  },
  {
    "id": 12966,
    "mediaId": 2724,
    "date": "2022-03-03",
    "sentence": "On Wednesday, Republican Congressman <span class='selected-term'>Jim Jordan</span> argued that President Biden was essentially being held hostage policy-wise by the far-left wing of the Democrat Party – particularly when it comes to energy policy.",
    "author": "John Hanson",
    "title": "Rep. Jim Jordan Says ‘Radical Left’ Won’t Let Biden Reverse ‘Crazy’ Energy Policies"
  },
  {
    "id": 15207,
    "mediaId": 8413,
    "date": "2022-03-07",
    "sentence": "An opponent, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, said the bill was unnecessary because \"under current law, if a person's hairstyle or hair texture is associated with a person's race or national origin and is used as a pretext for discrimination, that conduct is unlawful.\"",
    "author": "Targeted News Service",
    "title": "Here's a look at how area members of Congress voted"
  },
  {
    "id": 11374,
    "mediaId": 2754,
    "date": "2022-03-07",
    "sentence": "“And if you’re watching this, Dr. Fauci, look out because when the Americans give us control in the House of Representatives, God willing, we’re going to get some answers on behalf of the American people.”\nRoy’s remark came just a few days after Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), the ranking Republican on the House Judiciary Committee, confirmed to Just The News that the GOP will attempt to investigate Fauci and other federal health officials over how they responded to the COVID-19 pandemic.",
    "author": "Tyler Durden",
    "title": "GOP Says It'll Investigate Fauci If It Retakes House in 2022"
  },
  {
    "id": 10959,
    "mediaId": 2641,
    "date": "2022-03-09",
    "sentence": "Russian President Vladimir Putin has taken advantage of a lack of leadership in the White House to carry out his invasion of Ukraine, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday.",
    "author": "Brian Freeman",
    "title": "Rep. Jim Jordan to Newsmax: Putin Takes Advantage of WH Weakness"
  },
  {
    "id": 11394,
    "mediaId": 2724,
    "date": "2022-03-09",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) March 8, 2022\nRELATED: Psaki Gets Testy With Fox News’ Peter Doocy In Tense Back And Forth Over Spiking Gas Prices: ‘Let Me Finish’\nRep. Jordan: ‘The real answer is, let’s increase production here’\nOpening up the segment with clips of reporters asking White House press secretary Jen Psaki about Biden looking to Venezuela, Saudi Arabia, and Iran for help on the oil front, Fox host Steve Doocy asked Jordan what the impact of banning Russian oil imports will be.",
    "author": "John Hanson",
    "title": "Do Democrats Want $7 Gas? Rep. Jim Jordan Says Yes"
  },
  {
    "id": 11261,
    "mediaId": 2550,
    "date": "2022-03-09",
    "sentence": "Related:\nJan. 6 committee puts fellow member of Congress in the hot seat\nWhite House Jan. 6 call log confirms what <span class='selected-term'>Jim Jordan</span> couldn't—or wouldn't\nKevin McCarthy's failure to act on Gosar and Greene's white nationalist flirtation says it all\nRepublicans divided on whether to use Jan. 6 committee as tool of revenge or just kill it off\nMcConnell finally gets around to taking issue with RNC's embrace of violence.",
    "author": "Laura Clawson",
    "title": "Freedom Caucus is poised to have serious sway if Republicans take the House"
  },
  {
    "id": 11157,
    "mediaId": 2602,
    "date": "2022-03-09",
    "sentence": "The New York Times has reported that he was said he was like KKK leader David Duke “without the baggage.”\nAIPAC’s most outrageous endorsement may be Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, who has refused to testify before the January 6 investigating committee and joined failed lawsuits to block certification of Biden’s election.",
    "author": "DOUGLAS BLOOMFIELD",
    "title": "AIPAC and some controversial endorsements - opinion"
  },
  {
    "id": 11033,
    "mediaId": 2641,
    "date": "2022-03-09",
    "sentence": "Russian President Vladimir Putin has taken advantage of a lack of leadership in the White House to carry out his invasion of Ukraine, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday.",
    "author": "Brian Freeman",
    "title": "Rep. Jim Jordan to Newsmax: Putin Takes Advantage of WH Weakness"
  },
  {
    "id": 11117,
    "mediaId": 2746,
    "date": "2022-03-10",
    "sentence": "The Republican Party is everybody else,” Rep. <span class='selected-term'>Jim Jordan</span>, Ohio Republican, told The Washington Times.",
    "author": "Mica Soellner",
    "title": "House GOP finish rebranding that Trump began, run as blue-collar party"
  },
  {
    "id": 11541,
    "mediaId": 4032,
    "date": "2022-03-10",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> of Ohio, the ranking Republican on the House Judiciary Committee, has asked the FBI to provide an immediate briefing regarding the agency’s investigation into the pipe bombs left at the headquarters of the Democrat and Republican parties on January 5 last year.",
    "author": "Gary Benoit",
    "title": "FBI Not Answering GOP Committee Members on Jan. 5 Pipe-bomb Probe. Jordan Demands Briefing on Progress"
  },
  {
    "id": 11139,
    "mediaId": 2526,
    "date": "2022-03-11",
    "sentence": "“The First Amendment prohibits the government from directly censoring speech it finds objectionable.”\nThe group of Republicans consists of House Energy and Commerce Committee Ranking Member Cathy McMorris Rodgers (R-WA), House Minority Whip and Select Committee on the Coronavirus Crisis Ranking Member Steve Scalise (R-LA), Judiciary Committee Ranking Member <span class='selected-term'>Jim Jordan</span> (R-OH), and Oversight and Reform Committee Ranking Member James Comer (R-KY).",
    "author": "Jacob Bliss",
    "title": "Exclusive: House Republican Leaders Send Letter to Surgeon General over Big Tech Censorship"
  },
  {
    "id": 10970,
    "mediaId": 2745,
    "date": "2022-03-17",
    "sentence": "Another key figure in the push, Rep. <span class='selected-term'>Jim Jordan</span> (Ohio), top Republican on the House Judiciary Committee, has been a vocal critic of the most aggressive antitrust bills on the table.",
    "author": "",
    "title": "Tensions in House GOP over how to go after Big Tech are boiling over"
  },
  {
    "id": 10897,
    "mediaId": 2658,
    "date": "2022-03-17",
    "sentence": "— Section 230 front and center: Republican lawmakers discussed their plans for Section 230 reform extensively, agreeing that legislation from McMorris Rodgers and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) will likely serve as a framework for future efforts to reform the tech platforms’ liability shield.",
    "author": "",
    "title": "House GOP bickers over post-midterm antitrust plans"
  },
  {
    "id": 11075,
    "mediaId": 6509,
    "date": "2022-03-17",
    "sentence": "“This is what the Democrats are focused on,\" said Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "Farnoush Amiri",
    "title": "House Passes CROWN Act Prohibiting Discrimination Based on Hair"
  },
  {
    "id": 11424,
    "mediaId": 2633,
    "date": "2022-03-17",
    "sentence": "“This is what the Democrats are focused on,\" said Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "Farnoush Amiri",
    "title": "House Passes CROWN Act Prohibiting Discrimination Based on Hair"
  },
  {
    "id": 10863,
    "mediaId": 5118,
    "date": "2022-03-18",
    "sentence": "\"Fourteen months of chaos and we're doing a bill on hair,\" Republican Rep. <span class='selected-term'>Jim Jordan</span> of Ohio said Friday, adding, \"I hope we can actually focus on the things that matter to the American people.\"",
    "author": "",
    "title": "Congress passes CROWN Act banning race-based hair discrimination"
  },
  {
    "id": 10796,
    "mediaId": 2746,
    "date": "2022-03-18",
    "sentence": "“Fourteen months of chaos and we’re doing a bill on hair,” said Rep. <span class='selected-term'>Jim Jordan</span>, Ohio Republican.",
    "author": "Mica Soellner",
    "title": "House passes bill aimed to ban race-based hair discrimination"
  },
  {
    "id": 10742,
    "mediaId": 2594,
    "date": "2022-03-18",
    "sentence": "“This is what the Democrats are focused on,\" said Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "Via AP news wire",
    "title": "House passes bill to prohibit discrimination based on hair"
  },
  {
    "id": 10766,
    "mediaId": 2644,
    "date": "2022-03-18",
    "sentence": "“It’s important to the young girls and the young boys who have to cut their hair in the middle of a wrestling match in front of everyone because some white referee says that your hair is inappropriate to engage in your match.”\nMost Republicans called the legislation unnecessary, with Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) saying, “This is what Democrats are focused on.",
    "author": "Callie Patteson",
    "title": "House passes CROWN Act banning discrimination based on hairstyle, texture"
  },
  {
    "id": 10958,
    "mediaId": 2594,
    "date": "2022-03-18",
    "sentence": "It’s wrong if it happens,” said Rep <span class='selected-term'>Jim Jordan</span>, a Republican from Ohio.",
    "author": "Johanna Chisholm",
    "title": "House passes ‘vitally important’ bill that bans discrimination against Black hairstyles"
  },
  {
    "id": 11457,
    "mediaId": 5308,
    "date": "2022-03-18",
    "sentence": "It’s wrong if it happens,” Republican Rep. <span class='selected-term'>Jim Jordan</span> of Ohio said Friday.",
    "author": "Trone Dowd",
    "title": "The House of Representatives passed the “Creating a Respectful and Open World for Natural Hair,” or CROWN Act, Friday."
  },
  {
    "id": 11402,
    "mediaId": 2764,
    "date": "2022-03-18",
    "sentence": "“This is what the Democrats are focused on,” said Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Joshua Espinoza",
    "title": "U.S. House Passes CROWN Act to Ban Race-Based Hair Discrimination"
  },
  {
    "id": 11020,
    "mediaId": 2590,
    "date": "2022-03-18",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) carped that the House should instead focus on inflation or gas prices.",
    "author": "Sebastian Murdock",
    "title": "House Passes CROWN Act, Banning Discrimination Against Black Hairstyles"
  },
  {
    "id": 11191,
    "mediaId": 2532,
    "date": "2022-03-18",
    "sentence": "Congressman <span class='selected-term'>Jim Jordan</span>, a Republican from Ohio, argued on the floor that the Constitution already bans race-based discrimination, and that this bill was superfluous.",
    "author": "Zak Hudak",
    "title": "House passes the CROWN Act, a bill banning race-based hair discrimination"
  },
  {
    "id": 13763,
    "mediaId": 8480,
    "date": "2022-03-18",
    "sentence": "It’s wrong if it happens,” said Rep. <span class='selected-term'>Jim Jordan</span> (Ohio), the top Republican on the House Judiciary Committee.",
    "author": "Cristina Marcos",
    "title": "House passes CROWN Act, banning race-based hair discrimination"
  },
  {
    "id": 13475,
    "mediaId": 8491,
    "date": "2022-03-18",
    "sentence": "It’s wrong if it happens,” said Rep. <span class='selected-term'>Jim Jordan</span> (Ohio), the top Republican on the House Judiciary Committee.",
    "author": "Cristina Marcos",
    "title": "House passes CROWN Act, banning race-based hair discrimination"
  },
  {
    "id": 9455,
    "mediaId": 2656,
    "date": "2022-03-19",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) injected a note of sanity in the proceedings when he said: “This is what the Democrats are focused on.",
    "author": "Robert Spencer",
    "title": "With the World on Fire, You’ll Be Astonished at What the House of Representatives is Doing"
  },
  {
    "id": 9396,
    "mediaId": 2518,
    "date": "2022-03-19",
    "sentence": "\"This is what the Democrats are focused on,\" said Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "",
    "title": "House passes hair-bias measure"
  },
  {
    "id": 9393,
    "mediaId": 2627,
    "date": "2022-03-19",
    "sentence": "On Feb. 28, when Democrats attempted to pass the Crown Act using a fast-track process that required the support of two-thirds of the chamber, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, said he was opposed to the bill based on his belief that hair-based discrimination is already unlawful and because, he said, there were more important things Congress should be doing.",
    "author": "",
    "title": "Crown Act is the bill we need to end discrimination against Black natural hair"
  },
  {
    "id": 13579,
    "mediaId": 8480,
    "date": "2022-03-19",
    "sentence": "“This is what the Democrats are focused on,” said Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "Associated Press",
    "title": "House passes bill to prohibit discrimination based on hair"
  },
  {
    "id": 9642,
    "mediaId": 2573,
    "date": "2022-03-21",
    "sentence": "",
    "author": "",
    "title": "Rep. Ken Buck leads letter to DOJ demanding action on surging retail crime"
  },
  {
    "id": 8966,
    "mediaId": 2746,
    "date": "2022-03-22",
    "sentence": "The Judiciary Committee, which under GOP control would be headed by Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, would focus on more than a dozen key issues, according to a draft obtained by the Times.",
    "author": "Susan Ferrechio",
    "title": "House GOP to seek unity at annual retreat, plot agenda for takeover of Congress"
  },
  {
    "id": 8942,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Matthew Boyle",
    "title": "Exclusive — Kevin McCarthy: Dozens of ‘Preservation Notices’ Being Sent Across Government, Setting Stage for GOP Investigative Clash with Biden After Midterms"
  },
  {
    "id": 9480,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Melanie Zanona",
    "title": "Leaning on her Trump ties, Elise Stefanik plots future inside House GOP"
  },
  {
    "id": 9589,
    "mediaId": 2641,
    "date": "2022-03-23",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, says FBI Director Christopher Wray needs to explain why an internal audit of the FBI has found violations of its own policies when conducting surveillance investigations, The Washington Examiner reported.",
    "author": "Peter Malbin",
    "title": "Rep. Jim Jordan: 'Pattern of Misconduct and Mismanagement Within the FBI'"
  },
  {
    "id": 9613,
    "mediaId": 2636,
    "date": "2022-03-23",
    "sentence": "Other Republicans involved in the effort to overturn the 2020 election — Representatives <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania — have refused requests from the panel for interviews.",
    "author": "",
    "title": "House Republican Says Trump Asked Him to Illegally ‘Rescind’ 2020 Election"
  },
  {
    "id": 9775,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "She added that Republicans plan to fire “lame duck” House Speaker Nancy Pelosi (D-NY) “once and for all.”\nThe Task Force Leaders of each topic are as follows:\nJobs and the Economy: Rep. Patrick McHenry (R-NC)\nBig Tech Censorship and Data: Rep. Cathy Rodgers (WA)\nFuture of American Freedoms: Rep. <span class='selected-term'>Jim Jordan</span> (R-OH)\nEnergy, Climate and Conservation: Rep. Garret Graves (R-LA)\nAmerican Security: Rep. John Katko (R-NY)\nHealthy Futures: Rep. Brett Guthrie (R-KY) and Rep. Vern Buchanan (R-FL)\nChina Accountability: Rep. Michael McCaul (R-TX)\nDuring the press conference, each Republican member provided a brief preview of the agenda items of their task force .",
    "author": "Hannah Bleau",
    "title": "House Republican Leadership Announces Taskforce Leaders to Fix Biden’s Failures"
  },
  {
    "id": 9502,
    "mediaId": 2748,
    "date": "2022-03-24",
    "sentence": "She added that Republicans plan to fire “lame duck” House Speaker Nancy Pelosi (D-NY) “once and for all.”\nThe Task Force Leaders of each topic are as follows:\nJobs and the Economy: Rep. Patrick McHenry (R-NC)\nBig Tech Censorship and Data: Rep. Cathy Rodgers (WA)\nFuture of American Freedoms: Rep. <span class='selected-term'>Jim Jordan</span> (R-OH)\nEnergy, Climate and Conservation: Rep. Garret Graves (R-LA)\nAmerican Security: Rep. John Katko (R-NY)\nHealthy Futures: Rep. Brett Guthrie (R-KY) and Rep. Vern Buchanan (R-FL)\nChina Accountability: Rep. Michael McCaul (R-TX)\nDuring the press conference, each Republican member provided a brief preview of the agenda items of their task force .",
    "author": "Blarp Blog",
    "title": "House Republican Leadership Announces Taskforce Leaders to Fix Biden’s Failures"
  },
  {
    "id": 9186,
    "mediaId": 2641,
    "date": "2022-03-24",
    "sentence": "Now, along with McCarthy, the host committee for Hageman includes present House GOP Chair Elise Stefanik of New York, and Reps. <span class='selected-term'>Jim Jordan</span> (Ohio), Tom McClintock (California), Darrell Issa (California), Claudia Tenney (New York), Joe Wilson (South Carolina) and Tim Walberg (Michigan).",
    "author": "John Gizzi",
    "title": "McCarthy, Gov. Noem, 100 GOP House Members Back Liz Cheney Opponent"
  },
  {
    "id": 9378,
    "mediaId": 2548,
    "date": "2022-03-25",
    "sentence": "(RELATED: ‘The News Was Fake’: Rep. <span class='selected-term'>Jim Jordan</span> Takes Shots The Media For Disavowing Hunter Biden’s Laptop)\n“I would like to announce on behalf of the American people, we have to make sure that our leaders are held accountable,” Greene said.",
    "author": "Nicole Silverio",
    "title": "Rep. Jim Jordan Says Republicans Need To Discuss Possible Impeachment Of Biden"
  },
  {
    "id": 9403,
    "mediaId": 2671,
    "date": "2022-03-26",
    "sentence": "“Just look at the border,” <span class='selected-term'>Jim Jordan</span> tells the Washington Times.",
    "author": "Fred T",
    "title": "DO IT!!! Jim Jordan says GOP should IMPEACH Biden after taking the House BACK in November"
  },
  {
    "id": 8953,
    "mediaId": 2512,
    "date": "2022-03-26",
    "sentence": "McCarthy at the time was seated next to Rep. <span class='selected-term'>Jim Jordan</span>, the Ranking Member of the House Judiciary Committee, which just happens to oversee the Supreme Court – including impeachments of Supreme Court justices.",
    "author": "David Badash",
    "title": "As legal experts call for Clarence Thomas to recuse House Republicans say ‘we need more’ like him"
  },
  {
    "id": 9605,
    "mediaId": 2695,
    "date": "2022-03-26",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R – Ohio) currently serves as the top Republican on the House Judiciary Committee and is positioned to take control of the committee in 2023 should the Republican Party retake control of Congress.",
    "author": "Samuel Mangold-Lenett",
    "title": "Rep. Jim Jordan indicates that Republicans are open to impeaching Biden if they retake Congress in 2022"
  },
  {
    "id": 9656,
    "mediaId": 2636,
    "date": "2022-03-27",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> of Ohio, dressed down in a fleece vest, stood in one corner while Representative Marjorie Taylor Greene of Georgia hustled in and out of the reception area.",
    "author": "",
    "title": "Elise Stefanik, Reinvented in Trump’s Image, Embodies a Changed G.O.P."
  },
  {
    "id": 8906,
    "mediaId": 8322,
    "date": "2022-03-27",
    "sentence": "HUNTER BIDEN'S LAPTOP: EX-CIA OFFICER BUCK SEXTON RIPS FORMER COLLEAGUES' REFUSAL TO APOLOGIZE\nBiggs signed onto a March 21 letter with the House Judiciary Committee’s ranking member Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Rep. Mike Johnson, R-La., to FBI Director Christopher Wray requesting an unredacted copy of the report, documents referring to or relating to the audit, an explanation of whether the FBI resolved the matters and a description of the FBI’s predicate to open investigations into politicians, religious groups and others named in the audit.",
    "author": "Fred Lucas",
    "title": "House GOP pushes Wray for transparency on FBI misconduct in probing politicians, religious groups, journalists"
  },
  {
    "id": 9446,
    "mediaId": 2557,
    "date": "2022-03-27",
    "sentence": "I suspect this conduct goes back for multiple administrations and has been an ongoing problem affecting members of both parties.”\nPromoted Content\nThe House Judiciary Committee’s ranking member Rep. <span class='selected-term'>Jim Jordan</span>, Rep. Mike Johnson, and Rep. Biggs all signed a letter to Christopher Wray demanding an unredacted copy of the audit.",
    "author": "DML News App",
    "title": "REPORT: House GOP pushes Wray for transparency on FBI misconduct after audit report"
  },
  {
    "id": 9379,
    "mediaId": 2553,
    "date": "2022-03-28",
    "sentence": "So you get the worst of all possible worlds.” Cotton added that the pattern of Biden making problematic off-script remarks was “not reassuring for our safety or to our allies.”\nOhio Republican Congressman <span class='selected-term'>Jim Jordan</span> expressed his concerns late Saturday, warning that Biden’s comments were not just confusing, but that they were actually dangerous.",
    "author": "John Rigolizzo",
    "title": "‘Worst Of All Possible Worlds’: Tom Cotton, Jim Jordan, Other GOP Leaders Blast Biden For ‘Horrendous Gaffe’ In Poland Speech"
  },
  {
    "id": 9059,
    "mediaId": 2641,
    "date": "2022-03-28",
    "sentence": "Amid a potential incoming food shortage, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax that in every domain, the Biden administration has \"screwed things up.\"",
    "author": "Jack Gournell",
    "title": "Rep. Jim Jordan to Newsmax: Food Shortage Talks Shows Biden Has 'Screwed Things Up'"
  },
  {
    "id": 9653,
    "mediaId": 2562,
    "date": "2022-03-28",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> to Newsmax: Food Shortage Talks Shows Biden Has 'Screwed Things Up' (Newsmax's \"Stinchfield\")\nBy Jack Gournell | Monday, 28 March 2022 10:52 PM\nAmid a potential incoming food shortage, Rep. Jim Jordan, R-Ohio, told Newsmax that in every domain, the Biden administration has \"screwed things up.\"",
    "author": "NationalWatch",
    "title": "Rep. Jim Jordan to Newsmax: Food Shortage Talks Shows Biden Has ‘Screwed Things Up’"
  },
  {
    "id": 9629,
    "mediaId": 6449,
    "date": "2022-03-28",
    "sentence": "And in fact, [Reps.] Cathy McMorris Rodgers and <span class='selected-term'>Jim Jordan</span> have been working on legislation to make changes to Section 230 to take those protections away from Big Tech, because they haven’t been the marketplace of free speech and we need more town squares.",
    "author": "Virginia Allen",
    "title": "Republican House Leaders Elise Stefanik and Steve Scalise Outline GOP Agenda"
  },
  {
    "id": 9725,
    "mediaId": 2646,
    "date": "2022-03-28",
    "sentence": "There’s at least one Republican who has spoken up in support: none other than the jacketless GOP Congressman <span class='selected-term'>Jim Jordan</span> (R-OH), who in his not-so-eloquently way of speaking has said “I haven’t seen it, but Fortenberry sounds like he got set up.”\nWell, there you have it.",
    "author": "Ty Ross",
    "title": "FOREIGN INFLUENCE: Convicted GOP Nebraska congressman’s donor tied to terrorist group"
  },
  {
    "id": 9099,
    "mediaId": 2658,
    "date": "2022-03-29",
    "sentence": "The select committee has already attempted to secure voluntary cooperation from three Republican lawmakers: Rep. Scott Perry (Pa.), Rep. <span class='selected-term'>Jim Jordan</span> (Ohio) and GOP Leader Kevin McCarthy.",
    "author": "",
    "title": "The Jan. 6 panel had cooled focus on GOP lawmakers. Then Brooks happened."
  },
  {
    "id": 9572,
    "mediaId": 2898,
    "date": "2022-03-29",
    "sentence": "Trump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other lawmakers.",
    "author": "",
    "title": "Jan. 6 House panel missing roughly 8 hours of Trump’s phone calls"
  },
  {
    "id": 7477,
    "mediaId": 2548,
    "date": "2022-03-31",
    "sentence": "In this episode, Vince and Jason sit down with Ohio Republican Representative <span class='selected-term'>Jim Jordan</span> to discuss invoking the 25th amendment on Joe Biden, Trump vs. Biden on the border and inflation crises’, and some extreme Hunter Biden drama.",
    "author": "",
    "title": "Invoking The 25th Amendment & Hunter Biden Drama | Guest Rep. Jim Jordan | Vince & Jason Save The Nation"
  },
  {
    "id": 7156,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Thursday that if Republicans take back the House this year, they will answer the two \"why\" questions on the Hunter Biden laptop story.",
    "author": "Luca Cacciatore",
    "title": "Rep. Jim Jordan: Big Tech, Big Media Colluded to Censor Hunter Biden Story"
  },
  {
    "id": 7208,
    "mediaId": 2562,
    "date": "2022-04-01",
    "sentence": "OAN Newsroom\nUPDATED 1:11 PM PT – Friday, April 1, 2022\nCongressman <span class='selected-term'>Jim Jordan</span> (R-Ohio) said House Judiciary Committee Republicans have launched a probe into claims Facebook and Twitter suppressed information about the contents of Hunter Biden’s laptop.",
    "author": "NationalWatch",
    "title": "Rep. Jordan on Hunter Biden laptop: There was a conspiracy to keep information from American people"
  },
  {
    "id": 7071,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> voiced outrage at the marijuana bill's timing, saying that issues such as crime, inflation, and illegal immigration should be taking precedence.",
    "author": "",
    "title": "House votes to decriminalize marijuana at federal level"
  },
  {
    "id": 7483,
    "mediaId": 2645,
    "date": "2022-04-01",
    "sentence": "OAN Newsroom\nCongressman <span class='selected-term'>Jim Jordan</span> (R-Ohio) said House Judiciary Committee Republicans have launched a probe into claims Facebook and Twitter suppressed information about the contents of Hunter Biden’s laptop.",
    "author": "",
    "title": "Rep. Jordan on Hunter Biden laptop: There was a conspiracy to keep information from American people"
  },
  {
    "id": 7507,
    "mediaId": 2745,
    "date": "2022-04-01",
    "sentence": "… Let’s focus on the things that matter,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said.",
    "author": "",
    "title": "House passes bill decriminalizing marijuana; Senate fortunes unclear"
  },
  {
    "id": 7565,
    "mediaId": 2553,
    "date": "2022-04-01",
    "sentence": "“The left will not let the Democrats do what needs to be done with the inflation problem, the energy problem, the illegal immigration problem on the southern border,” Representative <span class='selected-term'>Jim Jordan</span> (R-OH) said.",
    "author": "Charlotte Pence Bond",
    "title": "House Votes To Legalize Marijuana; Dems Applaud It As ‘Racial Justice Bill’"
  },
  {
    "id": 7825,
    "mediaId": 2522,
    "date": "2022-04-01",
    "sentence": "The bill was vigorously opposed by some Republicans such as Representative <span class='selected-term'>Jim Jordan</span> (R-OH), who took to the podium to rail against what he argued is a seriously skewed sense of priorities.",
    "author": "Joshua Nybo",
    "title": "‘Wow. Wow!’ Jim Jordan goes OFF on cowardly Dem priorities as House votes to decriminalize marijuana"
  },
  {
    "id": 7821,
    "mediaId": 6621,
    "date": "2022-04-01",
    "sentence": "",
    "author": "",
    "title": "HIGH ON THE HILL: House Votes 220-204 to Legalize Marijuana Federally, Faces Opposition in the Senate"
  },
  {
    "id": 7832,
    "mediaId": 6677,
    "date": "2022-04-01",
    "sentence": "Wow,” said Rep. <span class='selected-term'>Jim Jordan</span> (Ohio), the top Republican on the House Judiciary Committee.",
    "author": "Cristina Marcos",
    "title": "House approves bill legalizing marijuana"
  },
  {
    "id": 7725,
    "mediaId": 2833,
    "date": "2022-04-02",
    "sentence": "The letter concludes, “This irresponsible conduct demands a thorough investigation so that we may understand how Big Tech wields its enormous power over the free flow of information to the detriment of free and fair elections.”\nAppearing on Fox Business Thursday, ranking GOP Rep <span class='selected-term'>Jim Jordan</span> declared that “Big Tech, Big Democrat Party and Big Media all colluded to keep critical information from the American people in the run up to the most important election we have — the presidential election, so we’re launching an investigation.”\nWatch:",
    "author": "Sean Adl-Tabatabai",
    "title": "Congress Launches Investigation Into Facebook & Twitter for Censoring Hunter Biden Pedophile Story"
  },
  {
    "id": 7816,
    "mediaId": 6687,
    "date": "2022-04-02",
    "sentence": "“People in Congress, from Senators Rand Paul and Ted Cruz to Congressmen Marjorie Taylor Greene, Brian Babin, Thomas Massie, <span class='selected-term'>Jim Jordan</span>, Scott Perry and many, many others know Alabama’s Senate race is a no-brainer.",
    "author": "Yaffee",
    "title": "Chairman of House Freedom Caucus endorses Mo Brooks – He ‘fights unwaveringly for our conservative values’"
  },
  {
    "id": 7127,
    "mediaId": 2594,
    "date": "2022-04-02",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span>, one of the co-founders of the House Freedom Caucus and one of Donald Trump’s fiercest apologists in Congress, had nothing to say when The Independent asked about his remarks.",
    "author": "Eric Garcia",
    "title": "Madison Cawthorn’s comments angered House Republicans. He was already in trouble back home"
  },
  {
    "id": 7676,
    "mediaId": 2866,
    "date": "2022-04-03",
    "sentence": "“Yet because of the way the federal criminal laws are written in the way that cannabis is placed in schedule one, it is very easy for a marijuana offense to actually get someone a worse sentence than an opioid offense like overprescribing OxyContin or selling fentanyl or a firearms.”\nRep. <span class='selected-term'>Jim Jordan</span> voiced outrage at the marijuana bill’s timing, saying that issues such as crime, inflation, and illegal immigration should be taking precedence.",
    "author": "Fix This Nation Staff",
    "title": "Pelosi Leads Charge To Decriminalize Marijuana Possession"
  },
  {
    "id": 7489,
    "mediaId": 2576,
    "date": "2022-04-03",
    "sentence": "When House Speaker Nancy Pelosi rejected two of the five — Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Jim Banks (R-Ohio) — McCarthy decreed that his caucus would boycott the Jan. 6 committee altogether.",
    "author": "Detroit Free Press Editorial Board",
    "title": "Editorial: Will we ever learn what happened on Jan. 6?"
  },
  {
    "id": 7510,
    "mediaId": 8290,
    "date": "2022-04-03",
    "sentence": "--Trump could push investigations for every Democrat misdeed in the present administration and last one -- and assign <span class='selected-term'>Jim Jordan</span> and Matt Gaetz to lead the committees interviewing the witnesses.",
    "author": "Jeffrey A. Rendall",
    "title": "The Right Resistance: Trump says he won’t be Speaker; there are many reasons why he should be"
  },
  {
    "id": 7606,
    "mediaId": 2752,
    "date": "2022-04-04",
    "sentence": "She’d join the undistinguished ranks of Marjorie Taylor Greene, Lauren Boebert, Matt Gaetz, <span class='selected-term'>Jim Jordan</span>, and Madison Cawthorn.",
    "author": "Stephen Robinson",
    "title": "Guess It Wasn’t Just A Cry For Help: Sarah Palin Really Running For Congress"
  },
  {
    "id": 7601,
    "mediaId": 2818,
    "date": "2022-04-05",
    "sentence": "We know he took millions of dollars from energy companies in Ukraine and millions of dollars from companies in China with ties to the Chinese Communist Party,” said Congressman <span class='selected-term'>Jim Jordan</span>.",
    "author": "The First",
    "title": "JORDAN: Hunter Biden ‘Took Millions of Dollars’ from Moscow, Ukraine, Chinese Communists"
  },
  {
    "id": 7817,
    "mediaId": 2724,
    "date": "2022-04-06",
    "sentence": "Breaking: Following @FDRLST reporting that Adam Schiff and his staff doctored a text message between <span class='selected-term'>Jim Jordan</span> and former WH chief of staff Mark Meadows, the House Jan. 6 committee has just admitted that it did, in fact, doctor the text message.https://t.co/78aRNyOib7\n— Mollie (@MZHemingway) December 15, 2021\nIt seems there isn’t much that Kinzinger isn’t willing to believe if it casts a negative pall on his political adversaries.",
    "author": "Rusty Weiss",
    "title": "Never Trumper Adam Kinzinger Falls For Fake Tucker Carlson Quote Shared By Fellow ‘Never Trumper’ Joe Walsh"
  },
  {
    "id": 7456,
    "mediaId": 2562,
    "date": "2022-04-06",
    "sentence": "Trump Endorses Reps. Greene, Jordan for Reelection\n(Douglas P. DeFelice/Getty Images)\nBy Luca Cacciatore | Wednesday, 06 April 2022 09:42 PM\nFormer President Donald Trump continued his string of endorsements on Wednesday, announcing support for two of his most notable allies: Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "NationalWatch",
    "title": "Trump Endorses Reps. Greene, Jordan for Reelection"
  },
  {
    "id": 7278,
    "mediaId": 2641,
    "date": "2022-04-06",
    "sentence": "Former President Donald Trump continued his string of endorsements on Wednesday, announcing support for two of his most notable allies: Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Luca Cacciatore",
    "title": "Trump Endorses Reps. Greene, Jordan for Reelection"
  },
  {
    "id": 7841,
    "mediaId": 4032,
    "date": "2022-04-06",
    "sentence": "Senator James Lankford (R-Okla.) and U.S. Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio), along with 21 of their congressional colleagues, signed an April 5 letter to D.C. Mayor Muriel Bowser and metropolitan police chief Robert J. Contee about the remains.",
    "author": "Rebecca Terrell",
    "title": "U.S. Legislators Demand #JusticeForTheFive"
  },
  {
    "id": 7951,
    "mediaId": 2645,
    "date": "2022-04-06",
    "sentence": "OAN Newsroom\nCongressman <span class='selected-term'>Jim Jordan</span> (R-Ohio) said he has seen an “interesting progression” in how the media is treating the Hunter Biden laptop story.",
    "author": "",
    "title": "Rep. Jordan sees interesting progression of media treatment of Hunter Biden"
  },
  {
    "id": 7233,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, who will chair the powerful House Judiciary Committee if Republicans regain control of the House in this year's elections, told Newsmax there will be a \"number of things\" that will come under investigation, including the details behind the discoveries being made about President Joe Biden's son Hunter and the moves to cover up details about his laptop and actions during the 2020 election.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Jordan to Newsmax: GOP Will Investigate Hunter Biden If House Is Won"
  },
  {
    "id": 7108,
    "mediaId": 2644,
    "date": "2022-04-07",
    "sentence": "Trump confirmed that he spoke with House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and multiple other people, adding that he has a “very good memory.”\nPublic reports also reveal that Trump accidentally called Sen. Mike Lee (R-Utah), believing he was contacting Sen. Tommy Tuberville (R-Ala.), during the call log gap.",
    "author": "Callie Patteson",
    "title": "Trump blasts Jan. 6 panel’s 8-hour questioning of Ivanka as ‘harassment’"
  },
  {
    "id": 7073,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "Fellow far-right Congressman <span class='selected-term'>Jim Jordan</span> of Ohio told National Review he supported the move to block Disney’s copyrights.",
    "author": "Bevan Hurley",
    "title": "Congressional Republicans may block Disney copyright after ‘Don’t Say Gay’ bill row"
  },
  {
    "id": 7131,
    "mediaId": 2621,
    "date": "2022-04-07",
    "sentence": "In a New York Times opinion piece, Mast called for taking action such as, but not limited to, “[d]efining what constitutes an assault or tactical firearm and not allowing them for future purchase — just as we already prohibit the purchase of fully automatic firearms” and “[b]anning the sale of accessories and add-ons that circumvent the ban on automatic firearms, and increasing the ages at which individuals can purchase various categories of firearms.”\nIn addition to Mast, Trump also endorsed on Wednesday Reps. Marjorie Taylor Greene (R-GA), Greg Murphy (R-NC), Kat Cammack (R-FL), Mike Johnson (R-LA), <span class='selected-term'>Jim Jordan</span> (R-OH) and Carol Miller (R-WV).",
    "author": "Jackson Richman",
    "title": "Trump Endorses Rep. Brian Mast By Touting Him as ‘Strong’ on 2nd Amendment — Even Though He Supports Assault Weapons Ban"
  },
  {
    "id": 7422,
    "mediaId": 2699,
    "date": "2022-04-07",
    "sentence": "One was Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), the influential de facto dean of the party’s right flank in Congress, the House Freedom Caucus.",
    "author": "Sam Brodey",
    "title": "Sarah Palin Is Back. Her GOP May Have Moved On."
  },
  {
    "id": 6057,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> said on Sunday it \"sure seems\" the president's son is on his way to being indicted, though the congressman acknowledged he could not say for certain.",
    "author": "Daniel Chaitin",
    "title": "'Something is up': Jim Jordan spots major shift in Hunter Biden story"
  },
  {
    "id": 5940,
    "mediaId": 2643,
    "date": "2022-04-10",
    "sentence": "In July, Pelosi objected to two of McCarthy's appointments to the panel—Representatives <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana.",
    "author": "Xander Landen",
    "title": "Raskin Says 1/6 Committee 'Able to Get Work Done' Thanks to McCarthy Gamble"
  },
  {
    "id": 5807,
    "mediaId": 2601,
    "date": "2022-04-11",
    "sentence": "Washington Examiner\n[Ohio Congressman <span class='selected-term'>Jim Jordan</span> interviewed by Maria Bartiromo on Sunday]\n“Remember, it started off as, ‘Oh, it wasn’t his laptop.’ Then it was, ‘Well, it was his laptop, but it was Russian disinformation.’ Now it’s, ‘No, it wasn’t Russian disinformation, but Joe had nothing to do with it,'” Jordan said.",
    "author": "Dr. Tar",
    "title": "Dems Spinning Furiously to Explain Away Biden Corruption"
  },
  {
    "id": 5939,
    "mediaId": 6687,
    "date": "2022-04-11",
    "sentence": "Casey Wardynski, Republican candidate for Alabama’s open fifth congressional district seat, on Monday announced that his campaign had landed the endorsement of U.S. Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio).",
    "author": "Dylan Smith",
    "title": "U.S. Rep. Jim Jordan endorses AL-5 hopeful Casey Wardynski — ‘He is just the kind of fighter we need’"
  },
  {
    "id": 5329,
    "mediaId": 2664,
    "date": "2022-04-11",
    "sentence": "The panel hasn't decided what to do with three Republican lawmakers -- House minority leader Kevin McCarthy and Reps. Scott Perry and <span class='selected-term'>Jim Jordan</span> -- who have refused to voluntarily testify, although committee chairman Bennie Thompson said they would not likely face subpoenas.",
    "author": "Travis Gettys",
    "title": "Jan. 6 panel faces major choices about Trump as investigation enters final phase"
  },
  {
    "id": 5397,
    "mediaId": 2594,
    "date": "2022-04-11",
    "sentence": "“Do you think it was a mistake for [House Republican Minority Leader] Kevin McCarthy to remove all of the Republicans on the January 6 committee once [Speaker Nancy] Pelosi took off [Illinois Representative] Jim Banks and [Ohio Representative] <span class='selected-term'>Jim Jordan</span>?” Mr Wong asked.",
    "author": "Gustaf Kilander",
    "title": "Marjorie Taylor Greene defends Jan 6 because it ‘only happened one time’ as she berates journalist on video"
  },
  {
    "id": 5523,
    "mediaId": 2694,
    "date": "2022-04-16",
    "sentence": "The day after Glenn Youngkin won the Virginia governor’s race last November, a Wall Street Journal headline declared: “Youngkin Makes the GOP the Parents’ Party.” Representative <span class='selected-term'>Jim Jordan</span> of Ohio exulted in this new party line on Twitter: “The Republican Party is the party of parents.”\nPolling data showed this new branding to be as misleading as the GOP’s framing of critical race theory.",
    "author": "Ibram X. Kendi",
    "title": "The Danger More Republicans Should Be Talking About"
  },
  {
    "id": 5948,
    "mediaId": 2656,
    "date": "2022-04-16",
    "sentence": "The House Jan. 6 witch hunt committee admitted that Schiff altered a text message from Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) to former Trump chief of staff Mark Meadows, making it appear much more damning than it actually was.",
    "author": "Robert Spencer",
    "title": "You’ll Never Guess Who Wants to Be Speaker of the House Now"
  },
  {
    "id": 6066,
    "mediaId": 6687,
    "date": "2022-04-18",
    "sentence": "“Congressmen like <span class='selected-term'>Jim Jordan</span>, Scott Perry, and others in the Freedom Caucus need conservative fighters to work with them in the House, and they know that Casey Wardynski is the only candidate in this race that will stand with them and further an America First agenda.”\n“The Freedom Fund endorsement is highly sought after, and we’re glad that after thoroughly vetting the AL-5 field they recognized Casey Wardynski as the true conservative in the race,” he added.",
    "author": "Dylan Smith",
    "title": "House Freedom Caucus political arm endorses Casey Wardynski in AL-5 race"
  },
  {
    "id": 5754,
    "mediaId": 2562,
    "date": "2022-04-21",
    "sentence": "Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Andy Biggs, R-Ariz., were among the letter's signatories.",
    "author": "NationalWatch",
    "title": "House GOP Asks Why Late Moscow Mayor’s Wife Not Sanctioned"
  },
  {
    "id": 5548,
    "mediaId": 2636,
    "date": "2022-04-21",
    "sentence": "The memo for Republicans, prepared by Representative <span class='selected-term'>Jim Jordan</span> of Ohio, the ranking member on the committee, details how the right plans to use the hearing to portray Democrats as pushing “far-left policies” that seek to abolish all immigration enforcement and even “encourage” illegal immigration.",
    "author": "",
    "title": "G.O.P. Memo Shows Road Map for Attacking Democrats on Immigration"
  },
  {
    "id": 5340,
    "mediaId": 2641,
    "date": "2022-04-21",
    "sentence": "Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Andy Biggs, R-Ariz., were among the letter's signatories.",
    "author": "Eric Mack",
    "title": "House GOP Asks If Hunter Biden Ties Spared Rich Russian From Sanctions"
  },
  {
    "id": 5677,
    "mediaId": 2746,
    "date": "2022-04-22",
    "sentence": "Ohio protesters have also held demonstrations to keep Rep. <span class='selected-term'>Jim Jordan</span>, a Republican, off the ballot this year for the same reason, though little has come out of the effort in Ohio.",
    "author": "Mica Soellner",
    "title": "Marjorie Taylor Greene tells courtroom that she’s a ‘victim’ of the Jan. 6 riot"
  },
  {
    "id": 5816,
    "mediaId": 2672,
    "date": "2022-04-22",
    "sentence": "So too have have Reps. Scott Perry (R-Pa.) and <span class='selected-term'>Jim Jordan</span> (R-Ohio).",
    "author": "William Vaillancourt",
    "title": "Jan. 6 Committee Findings Are So Explosive They Will ‘Blow the Roof Off the House,’ Rep. Jamie Raskin Says"
  },
  {
    "id": 4818,
    "mediaId": 2643,
    "date": "2022-04-23",
    "sentence": "Representative Matt Gaetz appeared to mull Representative <span class='selected-term'>Jim Jordan</span> as a possible replacement for House Minority Leader Kevin McCarthy following the release of audio where McCarthy said he was considering advising then-President Donald Trump to resign.",
    "author": "Darragh Roche",
    "title": "Matt Gaetz Mulls Jim Jordan as New GOP Leader Following McCarthy Audio Leak"
  },
  {
    "id": 4939,
    "mediaId": 2741,
    "date": "2022-04-24",
    "sentence": "The filing contains testimony and other materials related to discussions that aides, such as then-White House chief of staff Mark Meadows, and members of the hard-right Freedom Caucus, including Rep. <span class='selected-term'>Jim Jordan</span>, had in the lead up to the fateful day.",
    "author": "",
    "title": "New Congressional Evidence: Yes, Trump Allies Knew What Was Coming on Jan. 6"
  },
  {
    "id": 4833,
    "mediaId": 2685,
    "date": "2022-04-24",
    "sentence": "Munson tweeted Saturday that GOP U.S. Sen. Rand Paul of Kentucky has endorsed his campaign, after earlier announcing the support of Republican U.S. House representatives <span class='selected-term'>Jim Jordan</span> of Ohio and Thomas Massie of Kentucky.",
    "author": "Hunter Woodall",
    "title": "After hours of voting, GOP fails to endorse in First District"
  },
  {
    "id": 4960,
    "mediaId": 2643,
    "date": "2022-04-24",
    "sentence": "Meanwhile, after the recordings of the House minority leader were leaked, multiple Trump supporters, including those who have long criticized his leadership, suggested that GOP Representative <span class='selected-term'>Jim Jordan</span> of Ohio should replace him as the party's leader with the possibility that he could become House speaker if Republicans regain control of the legislative chamber after the midterm elections.",
    "author": "Fatma Khaled",
    "title": "Audio Leak Shows Kevin McCarthy 'Is a Liar and a Traitor': Elizabeth Warren"
  }
]