[
  {
    "id": 1412,
    "mediaId": 2630,
    "date": "2022-02-14",
    "sentence": "“Upon identifying DNS queries from Russian-made Yota phones in proximity to the Trump campaign and the EOP, respected cyber-security researchers were deeply concerned about the anomalies they found in the data and prepared a report of their findings, which was subsequently shared with the CIA.”\nHouse committee calls on Rep. <span class='selected-term'>Jim Jordan</span> to provide information about Jan. 6 Capitol riot\nDec. 23, 202103:29\nA spokesperson for special counsel Durham’s office said the office declines to comment beyond the court filings and any response will be in future filings with the court.",
    "author": "",
    "title": "Tech exec used access to White House computers to look for dirt on Trump, says special counsel"
  },
  {
    "id": 1570,
    "mediaId": 2627,
    "date": "2022-02-14",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, seemed to agree Sunday with a statement from former President Donald Trump that suggested some of Hillary Clinton's associates deserve to be executed.",
    "author": "Ja'han Jones",
    "title": "Rep. Jim Jordan seems to back Trump's comment about executing Clinton aides"
  },
  {
    "id": 1152,
    "mediaId": 6621,
    "date": "2022-02-14",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) stopped by Fox & Friends to discuss the latest bombshell report that special counsel John Durham filed a motion in federal court alleging the Clinton campaign paid a tech firm to infiltrate Trump Tower servers —and later, the White House.",
    "author": "",
    "title": "'YEP, THERE WAS SPYING': Jordan Reacts to Bombshell That Clinton Campaign Spied on President Trump"
  },
  {
    "id": 1063,
    "mediaId": 2583,
    "date": "2022-02-14",
    "sentence": "",
    "author": "",
    "title": "Rep. Jim Jordan on Durham Report: This Is ‘Worse than We Thought’"
  },
  {
    "id": 880,
    "mediaId": 8322,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Jessica Chasmar",
    "title": "Flashback: Democrats long trashed Durham probe as 'politically motivated investigation'"
  },
  {
    "id": 1137,
    "mediaId": 2594,
    "date": "2022-02-16",
    "sentence": "In a stronger period of time in our country, this crime would have been punishable by death.”\nIn an even briefer statement three days later, evidently still basking in the glow of apparent triumph, he proclaimed: “I was proven right about the spying, and I will be proven right about 2020.”\nThe same development was likewise hailed loudly by Tucker Carlson on Fox News and on social media by loyalists including Donald Trump Jr, Ronna McDaniel, Ted Cruz, Kevin McCarthy, Marjorie Taylor Greene, Mark Meadows and <span class='selected-term'>Jim Jordan</span> but what exactly has Mr Durham alleged?",
    "author": "Joe Sommerlad",
    "title": "Why Donald Trump is once again claiming Democrats ‘spied’ on him"
  },
  {
    "id": 9302,
    "mediaId": 2724,
    "date": "2022-03-22",
    "sentence": "“Let’s get to the facts, let’s figure out exactly how much Joe Biden knew about this,” Representative <span class='selected-term'>Jim Jordan</span> (R-OH) told Fox News at the time as he called for a special counsel investigation into the business dealings revealed by the discovery of the device.",
    "author": "Rusty Weiss",
    "title": "Bill Barr: Joe Biden ‘Lied To The American People’ About Hunter’s Laptop Being ‘Russian Disinformation’"
  },
  {
    "id": 9366,
    "mediaId": 2877,
    "date": "2022-03-23",
    "sentence": "But the Kremlin can.” —Congressman <span class='selected-term'>Jim Jordan</span>\nNon Compos Mentis Awards\n“I can’t.",
    "author": "Jordan Candler",
    "title": "Wednesday Short Cuts"
  },
  {
    "id": 7497,
    "mediaId": 6512,
    "date": "2022-04-05",
    "sentence": "Many of Trump's Republican allies have continued to prompt such narrative about the Presidential Election 2020, namely Reps. <span class='selected-term'>Jim Jordan</span>, Jim Banks, Paul Gosar, and Marjorie Taylor Greene.",
    "author": "Mary Webber",
    "title": "Donald Trump Admits He Didn't Win Presidential Election 2020 During Interview With Presidential Historians"
  },
  {
    "id": 7408,
    "mediaId": 6676,
    "date": "2022-04-06",
    "sentence": "But many of Trump’s Republican allies in Congress, including Reps. <span class='selected-term'>Jim Jordan</span> (Ohio), Jim Banks (Ind.",
    "author": "Kelsey Carolan",
    "title": "Trump gets attention for saying he lost election"
  },
  {
    "id": 7379,
    "mediaId": 2550,
    "date": "2022-04-08",
    "sentence": "Incidentally, when the Jan. 6 committee exposed text messages sent by Rep. <span class='selected-term'>Jim Jordan</span> of Ohio to Mark Meadows, Jordan said the same had occurred.",
    "author": "",
    "title": "Trump Jr. pitched 'very simple' plan to White House to overturn 2020 election"
  },
  {
    "id": 7484,
    "mediaId": 2629,
    "date": "2022-04-09",
    "sentence": "Incidentally, when the Jan. 6 committee exposed text messages sent by Rep. <span class='selected-term'>Jim Jordan</span> of Ohio to Mark Meadows, Jordan said the same had occurred.",
    "author": "Brandi Buchman",
    "title": "'Total Control': Trump Jr. Pushed Coup Plot In November 2020 Texts To Meadows"
  }
]