{
  "id": 10477,
  "mediaId": 2644,
  "date": "2022-03-29",
  "headline": "‘Drunk’ Cara Delevingne gets down to Wyclef Jean at NYC bash",
  "image": "https://pagesix.com/wp-content/uploads/sites/3/2022/03/cara-delevingne-index.jpg?quality=75&strip=all&w=1200",
  "link": "https://pagesix.com/2022/03/29/drunk-cara-delevingne-gets-down-to-wyclef-jean-at-nyc-bash/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2504,
    2812,
    4665,
    5715,
    1568,
    1541,
    6159,
    6442
  ],
  "sentences": [
    "Wyclef played a number of tunes telling the DJ, “Sound man, don’t let me hear feedback, I don’t want to have to Will Smith you,” referencing the “Men in Black,” actor slapping Chris Rock at the Oscars.",
    "She “seemed really drunk,” a source tells Page Six of the model, adding that along with her drink she was carrying around an unopened bottle of her vegan prosecco brand, Della Vite, all night.",
    "By Mara Siegler\nSupermodel Cara Delevingne was the life of the party on Monday night, serving as a hype man for Wyclef Jean and dancing wildly, appearing to have imbibed too many drinks.",
    "She was totally Wyclef’s hype man,” says an attendee at the event for Wells Fargo and Bilt — a new credit card company that earns you points for paying rent — at Summit One Vanderbilt.",
    "A$AP Rocky also played the event in front of a crowd that included NYC’s nightlife loving Mayor Eric Adams, who was spotted earlier in the night at the opening of the play Plaza Suite.",
    "In November, a spy told Page Six the model was “really drunk” at Leah McSweeney’s Halloween bash, almost stumbled off the stage but was caught by a security guard.",
    "“Everyone who moved to Florida, get your butts back to New York City because New York City is where you want to be,” the Mayor told the crowd.",
    "Guests including Floyd Mayweather, Dr. Mehmet Oz and artist Kaws were able to explore the top three floors of the 1,401 feet tall building.",
    "“Wyclef asked for people to come up on stage and she was pulling all these guests up and was dancing her face off with everyone.",
    "We’re told Vogue cover girl Delevingne, 29, was on stage the whole performance and that “her dance moves were crazy.",
    "“She dropped her phone, she head banged, she was making all the wild faces that made her so famous,” says the spy.",
    "It’s not the first time a wobbly Delevingne has taken to the stage.",
    "At one point she was doing what can only be considered a jig.",
    "A rep for Delevingne did not respond to request for comment."
  ]
}