{
  "id": 10593,
  "mediaId": 8500,
  "date": "2022-03-30",
  "headline": "Forum gets tense in GOP's sharp-elbowed US Senate primary",
  "image": "https://kubrick.htvapps.com/vidthumb/d0b37068-e1ee-43c5-bbc8-bccc0c813d0e/d0b37068-e1ee-43c5-bbc8-bccc0c813d0e_image.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wtae.com/article/pennsylvania-senate-mehmet-oz-kathy-barnette-david-mccormick-jeff-bartos/39589410",
  "mediaOutlet": "wtae.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MARC LEVY Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In the weeks after Russia's invasion of Ukraine, Republicans - including Oz - have redoubled support for the industry as a hedge against Russia's influence, and as a campaign weapon against Democrats who may question the long-term viability of natural gas in the age of climate change.",
    "\"Because you're a liberal,\" interjected Kathy Barnette, a one-time congressional candidate who has allied herself with arch-conservatives and leaders of fringe conspiracy theories about Democrats stealing 2020's election from former President Donald Trump.",
    "The first public appearance between the highest-profile Republicans running for U.S. Senate in Pennsylvania quickly became chippy Wednesday, as themes playing out in millions of dollars in sharp-elbowed TV attack ads played out on a small forum stage.",
    "Mehmet Oz - the celebrity heart surgeon best known as daytime TV's host of \"The Dr. Oz Show\" - absorbed the brunt of criticism from rivals seated beside him, defending himself by accusing one of lying and the others of flouting the forum's rules.",
    "With seven weeks until the May 17 primary, the GOP race is up in the air, especially with possibly the biggest primary prize - a Trump endorsement - appearing unlikely after his first choice, Sean Parnell, bowed out of the race in November.",
    "After they finished arguing, Oz did not go back to answer the question, but went into a stump speech giving up his entertainment career to run and tout his accomplishments, including raising millions for his children's wellness charity.",
    "\"On your shows and in your columns, you've argued for more regulation in fracking, you've made the case that there was health effects from fracking and you argued for a moratorium in Pennsylvania like that in New York,\" McCormick said.",
    "The campaign is one of this year's premier Senate contests and has been roiled by the arrival of three wealthy and well-connected candidates from other states, injecting carpetbaggery into the race as a prominent and persistent issue.",
    "Republicans in Pennsylvania have staunchly sided with Pennsylvania's booming natural gas industry, and often used it as a wedge issue in campaigns, including in 2020's presidential race to claim that Joe Biden would ban fracking.",
    "The forum's questions about economic, tax and energy policy didn't necessarily illuminate sharp policy differences between the candidates, as much as the candidates used it to try to establish a persona.",
    "\"They've come in and they're spending tens of millions of dollars on television, and we've been on the road, grassroots, for me for five years, visiting all 67 counties multiple times,\" Bartos said.",
    "Oz has contended that he had no role in writing three columns in 2014 and 2015 that cited reports and research that exposure to gas-field fracking chemicals may harm human health.",
    "Former hedge fund CEO David McCormick turned a question about energy policy into an attack, trying to frame Oz as an opponent of hydraulic fracturing, or \"fracking\" for short.",
    "Bartos and Barnette also used it as an opportunity to attack Oz and McCormick as recent arrivals - Oz from New Jersey, McCormick from Connecticut - trying to buy the election.",
    "Mehmet Oz absorbed the brunt of criticism from rivals seated beside him, defending himself by accusing one of lying and the others of flouting the forum's rules.",
    "Jeff Bartos, a real estate investor who was the party's 2018 nominee for lieutenant governor, worked to stress his devotion to \"main street\" business owners.",
    "Oz's TV shows cited by McCormick's campaign were cases of Oz more generally advising viewers about the potential for toxins in water and air.",
    "Bartos said he and Barnette are frustrated from being on the campaign trail and seeing \"political tourists\" campaigning through TV ads.",
    "Barnette's interruption drew a protest from Oz, an admonishment from the moderator and Barnette's refusal to agree to be quiet.",
    "Until Wednesday, Oz and McCormick had largely skipped forums attended by other candidates and not crossed paths in public.",
    "For McCormick, it was an opportunity to repeatedly stress his loyalty to Trump's \"America First\" governing philosophy.",
    "Oz told the audience at the Manufacturer & Business Association offices in Erie as he began his closing speech.",
    "Meanwhile, on TV they or super PACs supporting them have spent millions of dollars attacking the other.",
    "In her closing statement, Barnette suggested that rich politicians don't care about regular people.",
    "The columns bore his name and that of another physician, who Oz has said actually wrote them.",
    "Energy was a constant theme Wednesday's forum, since Pennsylvania is the nation's No.",
    "In any case, Oz said he didn't mind being attacked and had thick skin.",
    "\"You should all ask yourself, 'why is everyone attacking me?'\"",
    "\"I know what it means to make a difference,\" Oz said.",
    "Oz shot back that McCormick was wrong and lying.",
    "\"That's a lie and you know it's a lie,\" Oz said.",
    "2 natural gas-producing state."
  ]
}