{
  "id": 10696,
  "mediaId": 2573,
  "date": "2022-03-15",
  "headline": "'Hannity' on Biden's Putin blame game",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/6686b2a5-eeba-48d9-8560-5c3c3b501744/144978d1-4baf-4c44-8e20-9fc4537848d4/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/transcript/hannity-on-bidens-putin-blame-game",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fox News Staff",
  "authorUrl": "https://www.foxnews.com/person/s/fox-news-staff",
  "termIds": [
    4905,
    4591,
    2859,
    3373,
    2767,
    514,
    6029,
    6569
  ],
  "sentences": [
    "And what's a big problem for Joe Biden is and Kellyanne will agree with this I'm sure is that the problem Biden has is that 60 percent of the American people approve of President Zelenskyy and only 40 percent of the American people approve of the job that Joe Biden's doing, which means that as this Ukrainian situation gets even worse, everything that Joe Biden- Kamala Harris is doing is going to be met with resistance from the American people.",
    "So when you hear Joe Biden stand up there and say, well, the Keystone pipeline wasn't even open yet, that's why it's important that you start these things now and you do so in a timely fashion and you build them so they're available in the future and so it sends a signal to investors that the oil and gas industry is a good place to put your money because it's going to be stable for years to come.",
    "And then when you look at NATO and they don't meet their two percent and Joe Biden comes over and says, no, no, no, we're not going to sanction that Nord Stream pipeline, but we are going to sanction the East Med pipeline that would replace some of that gas had we stopped that pipeline through Israel, Cyprus and Greece, then he gets this overall picture that there's weakness to be exploited.",
    "The idea that a woman, the highest ranking woman in the United States, goes to Poland to stand with the president of Poland is not prepared for a question as to whether or not the United States is willing to help refugees that she looks to the president of another country that she is there to reassure, and then starts giggling like a fool, is an absolute embarrassment.",
    "Copyright 2022 VIQ Media Transcription, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of VIQ Media Transcription, Inc. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
    "So when we had this change of government, I mean when you tell Vladimir Putin would you please tell your hackers to keep off 16 entities in the inside the United States, or you ask him to help out with the Iran deal or to pump more oil, or you have the Afghanistan humiliation, then he senses weakness and that's another green light for him.",
    "I never anticipated senator that this country that was energy independent just a little over a year ago would find itself adopting insane Green New Deal, socialist policies that result in America take -- buying oil from Russia, begging the Iranian mullahs for a deal so we can buy their oil, begging Venezuela and begging OPEC.",
    "And last night and earlier today, we heard the president at a DNC event here in Washington and then at a House Democrats retreat in Philadelphia, he is testing out the midterms pitch and they really -- they talk a little bit about the pandemic but then it is look we know that prices are going up and it's going to hurt.",
    "Joe Biden's been counting on Vladimir Putin to be his lawyer for the last year to try to get Iran to cut a deal with us, and that's one of the reasons why he was so weak over the last year is he didn't want to do anything to offend Vladimir Putin and upset the apple cart with this nuclear deal with Iran.",
    "And so, I don't quite understand what the strategy is right now other than I guess what we're coming up to, Sean, is that we've got this pincer movement from the Black Sea and then down from Kyiv, and I think he's going to do what the Soviets did in World War II, or what he did in Grozny in Chechnya.",
    "But also tonight, we are following the Jussie Smollett hate crime hoax saga as the actor yesterday, as we showed you, was sentenced to 150 days in jail after he was convicted late last year of staging a fake hate crime in Chicago, which he falsely claimed was carried out by MAGA Trump supporter's.",
    "It's the Ukrainian president that's been inspiring so many people the way he's trying to protect and safeguard his country, and our president is making us less secure, making everyday life less affordable and is worrying people on everything from education to abortion to inflation to immigration.",
    "Well, no surprise to everyone except our cognitively impaired commander in chief who seems to believe that his anti-energy policies they've had nothing to do with rising energy costs rising inflation has nothing to do with government spending nothing to do with his energy and economic policies.",
    "DR. MEHMET OZ (R), CANDIDATE FOR U.S. SENATE IN PA: Well, I'm actually in Beaver County now, which is the western portion of the state and it is shocking that even the folks serving your food the diner here know everything about energy policy and know exactly how wrong Joe Biden is.",
    "(COMMERCIAL BREAK)\n(NEWSBREAK)\nHANNITY: Now, unfortunately, tonight, Biden-Harris continue to embarrass the whole country on the world stage, projecting weakness, doubling down on their failed far left policies and as usual, never ending stream of bizarre blunders by both of them.",
    "(COMMERCIAL BREAK)\n(NEWSBREAK)\nHANNITY: More development's tonight in the Alec Baldwin fatal film set shooting as the disgraced actor is now claiming that a clause in his contract shields him from financial responsibility in the shooting death of cinematographer Halyna Hutchins.",
    "And now, as they were just about to strike another terrible deal, Iran and Russia walk away from the table because they know they have Joe Biden over the barrel that he desperately wants this nuclear deal and they can extract more concessions from him both in Ukraine and Iran.",
    "Forget the trillions of dollars in new spending, the trillions in handouts and entitlements, forget the new restrictions on oil and gas and rising gas prices and energy prices, according to the left, this is all Vladimir Putin's fault because he invaded Ukraine 19 days ago.",
    "(COMMERCIAL BREAK)\nHANNITY: Now, I'll say it tonight the last two times, Putin has invaded Ukraine Joe Biden was in the White House and Biden's weak diplomacy, lack of action early on while that gave Putin a green light to unleash this bloody assault on a sovereign nation.",
    "Now images of as you can see look at these mass graves are commonplace inside the country and despite the carnage the Biden administration, they nixed a proposal to help Ukrainians protect their own skies by gifting them several Polish MiG fighter jets to Ukraine.",
    "And when it comes to this issue of oil and gas, Sean, the reality is, is that during the presidential debates on the Democrat side, Joe Biden was asked, would you be willing to displace hundreds of thousands of blue- collar workers to shift to a green economy?",
    "And then he followed it up on day one of the inauguration with executive orders killing Keystone, killing oil leases, raising taxes on oil companies, putting John Kerry in place, and on top of it, a few months later, he said yes to the Nord Stream 2 pipeline.",
    "I want to ask you about this Trafalgar poll, Reince, and do you believe the U.S. should send F-16 fighter planes to Poland another NATO country -- countries as replacements, allowing those countries to give older fighter planes to the Ukrainian air force?",
    "Straight ahead, Alec Baldwin trying to shield himself from liability as it relates to the fatal shooting on the set of the movie \"Rust\" and we will get the latest details on the ongoing drama involving the sentencing of Jussie Smollett.",
    "KAMALA HARRIS, VICE PRESIDENT OF THE UNITED STATES: In terms of the discussions that the President Johannes and I had, they ranged in subject including the issue of the Black Sea and I'll let him explain in more detail as he would like.",
    "Anyway, according to the media mob and the co-host of that hard-hitting news show \"The View\" on ABC, if you think laugh enough questions about release serious issues as unprofessional, that means you are racist and you are a sexist.",
    "And even though blaming inflation on Putin is different than blaming it on the pandemic, the reason is the same because these White House officials can say, pandemic, that's not something that we can ultimately control.",
    "I wouldn't be surprised if a couple of months from now or whenever he gets out -- he holds a news conference and says, they tried to Epstein me, somebody tried to hang me in my jail cell, I'm suing the city of Chicago.",
    "HANNITY: Weigh in on Alberta's premiere and the statement that if we had finished, we would we would now have finished the Keystone XL pipeline and Canada would be giving us about around 900,000 barrels of oil a day.",
    "That means, Joe, you can stop begging OPEC like you have been, stop dealing with the corrupt evil Iranian mullahs, stop begging the murdering thug in Venezuela Maduro, because it's humiliating and it's embarrassing.",
    "He would rather, as you say, go hat in hand and beg the ayatollahs to pump more oil for us, or go to Venezuela to a strong man, Nicholas Maduro, who we don't even recognize as a legitimate head of their government.",
    "I'll take half or two-thirds of Ukraine and we'll stop and accept things as they are in the battlefield, and then he thinks we're going to kind of sleep again and then in five years, he'll take the rest of Ukraine.",
    "(BEGIN VIDEO CLIP)\nJANET YELLEN, SECRETARY OF TREASUREY: So I think there's a lot of uncertainty that is related to what's going on with Russia and Ukraine, and I do think that it's -- it's exacerbating inflation.",
    "Now, Putin is dropping bombs all over Ukraine, including bombing entire neighborhoods civilian areas apartment buildings churches schools and yes even that women and children's hospital, the maternity hospital.",
    "JARRETT: Well, we haven't seen a contract -- sometimes they have a clause called a whole harmless indemnification, which basically says the employer is on the hook in the case of a judgment or attorney's fees.",
    "I don't know, between Joe and Kamala Harris, our country is being led by utter idiots at this point and now the American people were all paying the price and our national security is compromised on top of it.",
    "This week, our very own Peter Doocy asked circle back, chief propagandist Jen Psaki if the administration was planning to blame Putin for everything that goes wrong in the U.S. until the midterms.",
    "But according to Alberta's premier, you know that Keystone XL pipeline that you put the axe to, it would have been completed by today and Canada would be sending us 900,000 barrels of oil a day.",
    "But you use them -- if anything, people in those positions, elected officials, mainstream journalists, their credibility is everything to them and you didn't care that you might be damaging it.",
    "(END VIDEO CLIPS)\nHANNITY: After those bizarre courtroom antics, authorities released this booking photo of the disgraced star who will serve a mere 150 days at a Cook County, Illinois, jail.",
    "This critique has -- to the judge's point -- has nothing to do with race or gender, because I would say the same thing about the old white guy that happens to be her boss on the same issue.",
    "Those polls are coincide with what I've seen as well, which show that over percent of the American people think that we need to be more aggressive when it comes to Russia and Ukraine.",
    "(BEGIN VIDEO CLIP)\nREPORTER: President Biden has said that Americans will feel some pain for the sake of defending freedom and liberty, but there does seem to be no end game in sight.",
    "And get this -- according to a new report from \"Variety\", Baldwin actually tried to arrange a settlement with Hutchins' widow, which would've allowed filmmakers to complete the film.",
    "I'd rather get her from little Justin and Canada, at least they're an allied country and they're not -- not run by a murdering dictator, but a wannabe little dictator than Justin.",
    "JEANINE PIRRO, CO-HOST OF \"THE FIVE\": Well, I got to tell you, if anything, the one purpose she has served has been an insurance policy to make sure that Joe Biden stays there.",
    "(END VIDEO CLIP)\nHANNITY: Now, after the sentencing, Smollett lashed out, screaming repeatedly he's innocent and he's not suicidal, and he's not suicidal, he's not suicidal.",
    "Gas prices as every American knows were already -- were already way up before Putin invaded Ukraine inflation was already at a 40-year high before Vladimir invaded Ukraine.",
    "Usually, a president can a president can rely upon five six seven more points just when there's crisis and uncertainty elsewhere where we feel there's an American interest.",
    "I think you're going to see all these new phony polls saying oh his approval rating is going up, the Democrats are -- they're tightening the generic ballot, look at that.",
    "(BEGIN VIDEO CLIP)\nJEN PSAKI, WHITE HOUSE PRESS SECRETARY: You may have noticed this week that your gas prices have gone up I want to talk to you a little bit about why.",
    "More than 2 million people have crossed into this country over the U.S. southern border in the last year alone, that's triple the size of the total population of Boston.",
    "Don't forget, a couple of months ago, Joe Biden was blaming gas prices and inflation on the supply chain crisis on the, quote, pent-up demand for post-pandemic travel.",
    "Anyway, it's pretty humiliating not only for Joe Biden but the entire country and remember during the campaign, you might remember that this debate, a pivotal moment.",
    "I say about the president that he's weak, and frail, and he's obviously a cognitive mass, and then we got a vice president that gets serious questions and giggles.",
    "When it comes to the woman right now -- the candidate or nominee for Supreme Court, Ketanji Brown Jackson, there is no one no one questioning her qualifications.",
    "We're also learning tonight that the Russians are holding more than employees at the Chernobyl site hostage, as Putin continues his bloody war against Ukraine.",
    "Those Europeans will come back and beg him for more oil and gas and the United States will sort of forget and it'll be sort of like who remembers Grozny today?",
    "Now, that same poll shows an overwhelming majority of Americans want to replace Russian oil that we are no longer importing with our own domestic production.",
    "KELLYANNE CONWAY, FORMER SENIOR COUNSELOR TO PRESIDENT TRUMP: Sean, they have to be looking at the same polls we all see which has him down all around town.",
    "If I did this, then it means that I stuck my fist in the fears of Black Americans in this country for over 400 years, and the fears of the LGBTQ community.",
    "He moves when oil prices are high and the West needs oil and he's flushed with petrodollars and we're on green initiatives, whether it's in Europe or here.",
    "That moment was so bad that even the Ukrainian President Zelenskyy's former press secretary tweeted it would be a tragedy if Harris ever became president.",
    "I'd be looking to Texas and Oklahoma and Alaska for oil and I'd be looking to West Virginia Ohio and the state you want to represent Pennsylvania for gas.",
    "Here with reaction, the author of the book, \"The Dying Citizen\", Hoover institution senior fellow, friend of the show, Victor Davis Hanson is with us.",
    "And I think we're really miss -- we keep thinking that world opinion or he's going to stop or he's we're outraged that he that he bombed a hospital.",
    "We can get it done in eight months and you won't have to be importing oil from Russia and begging some of the most unsavory characters in the world.",
    "And I know that's probably a little too complicated for you to understand, especially in your compromise cognitive state at this point in your life.",
    "Joining us now with more former Trump White House chief of staff Reince Priebus, and former senior counselor to President Trump, Kellyanne Conway.",
    "Canada today said that they can find ways to give us an additional 400,000 barrels of oil a day by shipping it through rail, et cetera, et cetera.",
    "As far as blaming racism, I go back to an interview with Kamala Harris after she dropped out of the Democratic primaries before one vote was cast.",
    "And despite comparing ICE to the KKK, she was put in charge of fixing it, and it's only getting worse as she plays the role of absentee landlord.",
    "(END VIDEO CLIP)\nHANNITY: Here with reaction, co-host of \"The Five\", Judge Jeanine Pirro is with us, along with FOX News contributor, Joe Concha.",
    "You cannot have an American president that has an America last policy and blames American -- blames Americans and America for what's going wrong.",
    "And as Russia's bloody invasion of Ukraine continues, we are witnessing so many sad harrowing scenes from the ground, like -- look at this video.",
    "Instead, you have Joe Biden and John Kerry out there saying, well, we need more oil right now, but in five years, we don't want any oil and gas.",
    "But it's Friday, so you know what that means Joe Biden is now kicking back for another restful weekend, of ice cream, away from the White House.",
    "(LAUGHTER)\nHARRIS: More parents are seeing the value of educators when they had to bring their kids and say we're not paying them nearly enough.",
    "I just want to get your overall broad perspective on everything that's happening, between energy, the economy, inflation excuse-making, Ukraine.",
    "You did damage to them, because again, there is a side of you that has this arrogance, and selfishness and narcissism that's just disgraceful.",
    "Now, meanwhile, our country is falling apart Biden's treasury secretary now predicting uncomfortably high inflation for at least another year.",
    "But remember, according to Joe and the Democrats, Joe Biden has nothing to do with this inflation that has been at a 40-year high for months.",
    "How long should Americans expect how long should we be bracing for this really sort of historic inflation and some unprecedented gas prices?",
    "And if we don't give energy producers the confidence that they are respected as part of our national security, they are not going to invest.",
    "UNIDENTIFIED FEMALE: They constantly question the qualifications of black women, and that's why people are saying that she's unprepared.",
    "But that didn't stop Joe Biden from tweeting that he will quote take every step that he can to minimize Putin's price hike here at home.",
    "We have to talk about it because the American people think the reason for inflation is government spending more money, simply not true.",
    "People talking about it -- that I personally think if she was a guy they would never say because they also made fun of Hillary's laugh.",
    "But if he engages in grossly negligent reckless conduct, which is criminal, that's well outside the course and scope of his employment.",
    "As the great Bill Parcells said, you are what your record says you are and that's his record and that's why he's having big problems.",
    "He won't even unfreeze new exploration permits and he's lecturing constantly the oil and gas industry that are doing their very best.",
    "Is there anything that you see that he'd be willing to do that could be helpful in terms of Ukraine, energy, the economy, inflation?",
    "There's a direct connection between how weak Joe Biden has been on Iran and the war that Vladimir Putin is waging Ukraine right now.",
    "(END VIDEO CLIP)\nHANNITY: No, it's Biden's oil tax and it's Biden's 40-year high of inflation long before Vladimir invaded Ukraine.",
    "He believes that and, you know, a year from now, they're going to say, wow, that Napoleonic figure swallowed all of Ukraine almost.",
    "REINCE PRIEBUS, FORMER WHITE HOUSE CHIEF OF STAFF: Well, you know, look, Kellyanne's right about where the American people are at.",
    "And I think Biden thinks that the more that he appeases, that magnanimity is going to be returned in kind or appreciated by Putin.",
    "COTTON: Well, of course, Sean, but we're not doing it because Joe Biden's eco-activists on the left don't want North American oil.",
    "Now, a plan that sixty-nine percent of you the American people are in favor of according to our friend Robert Cahaly at Trafalgar.",
    "If they have to, I guess they'd rather take it from countries like Venezuela or Iran, but they are crippling our energy industry.",
    "PSAKI: Well, we've seen the price of gas go up at least 75 cents since President Putin lined up troops on the border of Ukraine.",
    "The people brokering the deal, it's Russia and China, they are brokering the deal because the Iranians won't talk to Joe Biden.",
    "The unfortunate part, this was the second debate and almost 100 million votes had already been cast when this debate occurred.",
    "But number two, so unwilling to channel the pride, the spirit, the resilience, the moxie of America as the American president.",
    "And for President Duda, I wanted to know if you think and if you asked the United States to specifically accept more refugees?",
    "(BEGIN VIDEO CLIP)\nJOE BIDEN, PRESIDENT OF THE UNITED STATES: I love, you know, Republicans saying it's Biden's gas pipeline.",
    "And he's also saying, Sean, that, you know, well, the armorer and the victim themselves, are to blame and that absolves me.",
    "Democrats out there with a little talking point, the little slogan, the little bumper sticker, all their lying won't work.",
    "Now, with that said, Canada is now telling us they can give us an extra 400,000 barrels of oil a day starting immediately.",
    "HANNITY: I agree with every single thing you just said and I pray to God that we're both wrong, and I don't think we are.",
    "According to the report, the employees are working at gunpoint, raising fears of a major catastrophe at that power plant.",
    "He moves when the president talks tough and carries a twig and he moves when NATO is in disarray and he senses weakness.",
    "We're going to have the greatest economy in the world but if you want to kill the economy, get rid of your oil industry.",
    "Coming up, the left continues to make America less secure and safe, while appeasing brutal dictators around the globe.",
    "Folks, let's get something straight here, the keystone pipeline was two years away, it had been two percent finished.",
    "She blames sexism and racism for her support being so low, which is a very odd way to talk about Democratic voters.",
    "So this time --\n(END VIDEO CLIP)\nHANNITY: Giggling is the perfect way to answer a serious question about refugees.",
    "He influenced the English to stop drilling, and all of the sudden, no surprise, he supplied them all their energy.",
    "He's got to stop doing things that increase inflation and he's got to stop making us depended on hostile nations.",
    "This -- so much of this increase in the gas tax -- the gas price started weeks leading up to what happened there.",
    "And you come up with solutions that your party can live with and you go out and you buck up the American people.",
    "As a matter of fact, we can't find a single thing that Biden is willing to do back here at home to lower prices.",
    "And then he's going to move in and he's going to call up Zelenskyy and saying, you know what, let's make a deal.",
    "(BEGIN VIDEO CLIP)\nREPORTER: Is the United States willing to make a specific allocation for Ukrainian refugees?",
    "(BEGIN VIDEO CLIP)\nJOY BEHAR, \"THE VIEW\" CO-HOST: Did you have a problem with the way she handled this, ladies?",
    "Now, tonight, we are at the bitter end of what was another horrific terrible week for the Biden administration.",
    "You know, we're likely to see another year in which 12-month inflation numbers remain very uncomfortably high.",
    "And, Sean, the war in Ukraine is actually closely connected to this terrible nuclear deal in Iran as you said.",
    "Beg Maduro, beg Venezuela, beg OPEC, you know make this ridiculous new nuclear deal with the Iranian mullahs.",
    "Now, according to \"The Wall Street Journal\", inflation is the single biggest concern for the American people.",
    "So, this is the playbook by the candidate and by the vice president and by her super PAC that is \"The View\".",
    "It was a clear reference to Jeffrey Epstein as if he is auditioning for the remake of the death of Epstein.",
    "People talk about social injustice, your name is coming up first, because that's actually what you wanted.",
    "(LAUGHTER)\nHARRIS: Because there's an interesting fact, in case you didn't, hard hats are actually unisex.",
    "So you literally have 69 percent of the American people believe we should be providing these fighter jets.",
    "We were already paying more for everything in every store we go to because it costs more to ship it there.",
    "We saved our oil industry and now it's very vibrant together, and everybody has very inexpensive gasoline.",
    "Straight ahead tonight, the world is taking notice after Kamala Harris embarrassed us yet again overseas.",
    "She should not be allowed out of the United States if she's going to be an embarrassment to this country.",
    "Victor Davis Hanson, he joins us, as well as Dr. Oz and, could Russia attack on Ukraine's nuclear points?",
    "They're going to hold back until they know that there's going to be a pathway to success for our nation.",
    "Here to react to that and much more, Pennsylvania Republican Senate candidate, Dr. Mehmet Oz is with us.",
    "I had never heard a judge just pound -- just pound the seriousness of what he did here and to somebody.",
    "But it would hurt worse if we did not inflict these sanctions on Putin, including cutting off the oil.",
    "I don't want to make a prediction exactly as to what's going to happen in the second half of the year.",
    "Now, he's willing to beg every single dictator every despot in the world who hates the United States.",
    "Kellyanne, there's not a single thing I can look at that I would say Joe Biden is doing successfully.",
    "It gives a theatrical appearance on his own in front of, I think it was, what, George Stephanopoulos.",
    "But that's only, Sean, if the actor is conducting himself in the course and scope of his employment.",
    "This rant -- I'm not suicidal, if something happens to them to me in jail, I didn't do it to myself.",
    "Natural gas, without question, is the wisest path to protect the environment but it is abused, Sean.",
    "You know, average gasoline prices long before Putin invaded Ukraine was almost a buck more a gallon.",
    "Biden said he's going to stop the Keystone pipeline and I did, and that's the reason prices went up.",
    "MODERATOR: Vice president --\n(END VIDEO CLIP)\nHANNITY: Here with more, Arkansas Senator Tom Cotton.",
    "Say what you want about relationship, we got Saudi Arabia, Mexico and Russia to cut back, way back.",
    "He's got to cast aside his work ideology and needs to get into agenda that stops stealing our jobs.",
    "And I am not suicidal and if anything happens to me when I go in there, I did not do it to myself.",
    "We don't need all of these countries that we had to fight war over because we needed their energy.",
    "(END VIDEO CLIP)\nHANNITY: Joining us now with more, our own White House correspondent Peter Doocy.",
    "You know, from places like Alaska and Texas and Oklahoma and Pennsylvania, West Virginia and Ohio.",
    "(BEGIN VIDEO CLIP)\nDONALD TRUMP, FORMER PRESIDENT: We are energy independent for the first time.",
    "Unless you're really that dumb, Joe, because you have to be really, really dumb to believe that.",
    "JUSSIE SMOLLETT, ACTOR: No, I would just like to say, Your Honor, that I'm -- I'm not suicidal.",
    "VICTOR DAVIS HANSON, SENIOR FELLOW AT THE HOOVER INSTITUTION: I think it's pretty simple, Sean.",
    "SEAN HANNITY, FOX NEWS HOST: Now we start with the FOX News alert this busy Friday news night.",
    "I would have taken the time at the Democratic retreat in Philadelphia to do breakout sessions.",
    "JOE CONCHA, FOX NEWS CONTRIBUTOR: This is not a serious person and a very serious time, Sean.",
    "NORAH O'DONNELL, CBS NEWS ANCHOR: You are considered the most liberal United States senator.",
    "But that settlement apparently fell apart after the family filed the wrongful death lawsuit.",
    "DOOCY: It sounds like it might be all that we're going to hear for the next few weeks, Sean.",
    "(BEGIN VIDEO CLIP)\nPETER DOOCY, FOX NEWS WHITE HOUSE CORRESPONDENT: Inflation goes up today.",
    "MODERATOR: All right Let me -- let me have -- let me allow Vice President Biden to respond.",
    "As you say, America feels Joe Biden and kamala Harris literally do nothing well right now.",
    "It's no surprise that nearly 60 percent of Americans are unhappy with Biden's performance.",
    "Don't forget, 40 percent of the gas hike happened before Putin ever even invaded Ukraine.",
    "No, under the law, he has an independent duty of due care to ensure the safety of others.",
    "Anyway Joe Biden's weakness is emboldening evil, ruthless dictators all across the globe.",
    "He's going to plaster the countryside, the villages, the towns, kill a lot of civilians.",
    "Ukrainian people have shown their will in a fight for their country, that's really good.",
    "Please stay with the FOX news channel for continuing coverage of Putin's war on Ukraine.",
    "Sean, I've never seen a president so unwilling to do that course correction, number one.",
    "Nearly two, two and a half million people have had to leave their homes and the country.",
    "This video shows two Ukrainians diffusing a Russian bomb by hand with a bottle of water.",
    "So, essentially, they are saying, we know that things are going to get bad but hang on.",
    "Now, it's a kind of weird thing to say since he won't restart the Keystone XL pipeline.",
    "They're not going to drill those 9,000 so-called permits that Biden was talking about.",
    "That is based on odd statements like, it's time for us to do what we have been doing.",
    "Is this strategy, this talking point, this slogan -- is this all we're going to hear?",
    "You met with some of the top producers of natural gas in your state of Pennsylvania.",
    "We've got a refugee crisis, two, two and a half million, that's what she was asked.",
    "Thirty-six percent said definitely yes, 32 percent -- point eight percent said yes.",
    "HARRIS: I -- somebody said that and it actually was Mike Pence on the debate stage.",
    "You know, Joe Biden is now -- \"I blame all of my failures on Vladimir Putin\" Biden.",
    "REP. NANCY PELOSI (D-CA), SPEAKER OF THE HOUSE: The larger issue about Putin's tax.",
    "So I call him Joe \"I blame everything that's going wrong on Vladimir Putin\" Biden.",
    "He didn't even benefit from unifying a country because of an international crisis.",
    "She was supposed to be plan B, now she is plan Z, even among many Democrats, Sean.",
    "In this state, they'd be 100,000 jobs, well-paying jobs that can't be outsourced.",
    "You have one on energy, one in the economy, one in education, one on health care.",
    "Are you guys just going to start blaming Putin for everything until the midterms?",
    "That's why gas prices are the highest they've been in this country for 14 years.",
    "Now, if I were president and I'm not, never will be, I wouldn't be begging Iran.",
    "It's abused by regulations made by middle level managers, unelected bureaucrats.",
    "GREGG JARRETT, FOX NEWS LEGAL ANALYST: You know, it was a fairly light sentence.",
    "But, you know, watching these clips, it's a pathetic performance by a bad actor.",
    "HANNITY: I don't know whose monologue was better, Kellyanne's, Reince's or mine.",
    "Now, of course, creepy, bizarre giggling is nothing new for the vice president.",
    "JARRETT: I mean, that's the kind of pathological liar and hoaxster this guy is.",
    "(BEGIN VIDEO CLIP)\nJUDGE: We are giving you the national pity party you wanted.",
    "I think --\nUNIDENTIFIED FEMALE: You can disagree, but that's the truth of it.",
    "Now we see her cackling when asked to basic question with the world watching.",
    "She makes an embarrassment of herself whenever she gets on the world stage.",
    "PSAKI: Well, Peter, last year, last two years, there was a global pandemic.",
    "DOOCY: And last month, the statement didn't mention the Putin price hike.",
    "HANNITY: I think you're -- I think you're dead on accurate unfortunately.",
    "So whatever responsibility they had, it doesn't exonerate him criminally.",
    "Your Honor, I respect you and I respect the jury, but I did not do this.",
    "That one is from Keanu Reeves but we could talk about that another time.",
    "END\nCopy: Content and Programming Copyright 2022 Fox News Network, LLC.",
    "First, it took a month to hand over the phone, now I'm not responsible.",
    "He's undermining Germany by getting them to implode on nuclear energy.",
    "Now, here's the vice president yesterday with the president of Poland.",
    "Just like they ignored the signs on COVID and pretended they weren't.",
    "How is that any different in terms of how it impacts the environment?",
    "There's no issue where they have a net approval rating on that issue.",
    "And by the way, the oil and gas market that is a futures market, Joe.",
    "People are already, already feeling Putin's price hikes at the pump.",
    "It was Joe Biden himself we're now learning that made that decision.",
    "Free to frack is a mantra right now and it's pretty straightforward.",
    "Now, prices have been rising sharply ever since he got into office.",
    "Joe Biden has shackled our oil and gas industry for the last year.",
    "So I think I'd go to them first rather than these other countries.",
    "That's a -- that's really Putin's gas hike, that's his gas hike.",
    "They're pointing on the front page, all the attention is on you.",
    "It's right next to Reagan's, Mr. Gorbachev, tear down this wall.",
    "Now, Kamala Harris was asked about this serious economic issue.",
    "He wants them to increase energy production in their countries.",
    "We want you all to drive a sixty thousand dollar electric car.",
    "Play the gender and the race card from the bottom of the deck.",
    "And this is a continuing, continuing image that we see of her.",
    "The only people that said no were 11.5, and definitely no 8.6.",
    "We know some of those activists were actually funded by Putin.",
    "I respect you, Your Honor, I respect your decision, jail time.",
    "He knew the camera was in decided to perform as best he could.",
    "Unfortunately, that's all the time we have left this evening.",
    "I was in a big town hall earlier and they broke into a chant.",
    "(BEGIN VIDEO CLIP)\nREPORTER: Do you plan to visit the border?",
    "When it came to Condi Rice, nobody questioned her confidence.",
    "Gas prices, inflation has happened long before this invasion.",
    "And for the record, she never managed to answer the question.",
    "Vladimir Putin, not something that we can ultimately control.",
    "Now, inflation had been under a 40-year high now for months.",
    "UNIDENTIFIED FEMALE: Absolutely there's a real aspect to it.",
    "Maybe he still considers it a minor incursion, I don't know.",
    "I literally have that quote hanging here in my home studio.",
    "But here is the deal: Biden has to stop ignoring the signs.",
    "Here with reaction, FOX News legal analyst, Gregg Jarrett.",
    "And I'm sick and tired of people saying it is about color.",
    "This copy may not be in its final form and may be updated.",
    "This is a rush transcript from \"Hannity,\" March 11, 2022.",
    "The battle for freedom has its cost here at home as well.",
    "We have images of a maternity hospital that was attacked.",
    "HANNITY: I have great friends that give great commentary.",
    "I can't be held legally responsible, it's in my contract?",
    "But they could have been times five on five convictions.",
    "HANNITY: Joe Concha, we have images now of a mass grave.",
    "Anyway, Democrats are opting for catchy slogans instead.",
    "I don't think we should be enriching America's enemies.",
    "But in the end, Ms. Harris has a communication problem.",
    "He needs to step up and reflect the best of who we are.",
    "Judge Jeanine Pirro, Joe Concha reacts, straight ahead.",
    "And he -- we know when he moves and when he stays put.",
    "But Biden would rather beg, what, the mullahs of Iran.",
    "The president's statement blames the Putin price hike.",
    "BIDEN: You need to be honest with the American people.",
    "(END VIDEO CLIP)\nHANNITY: Oh, so much for transitory.",
    "Let's take you down a short trip of memory lane here.",
    "(LAUGHTER)\n(END VIDEO CLIP)\nHANNITY: Lots of giggles.",
    "All he's doing is five months in jail, not in prison.",
    "(BEGIN VIDEO CLIPS)\nJUDGE: Do you have any questions?",
    "I could have said that I was guilty a long time ago.",
    "I never thought things would get this bad this fast.",
    "Reince and I have been at those Republican retreats.",
    "This is based in racism, this is based in misogyny.",
    "And more importantly, she's feeling on performance.",
    "HARRIS: Okay, a friend in need is a friend indeed.",
    "He hasn't even benefited that way and you see why.",
    "So if I were they, I would do a course correction.",
    "Joe abandoned America as a net exporter of energy.",
    "The death toll and the suffering is unimaginable.",
    "Could that have wide spread health ramifications?",
    "(LAUGHTER)\nANDRZEJ DUDA, POLISH PRESIDENT: Okay.",
    "Here's the judge admonishing Smollett yesterday.",
    "A deal that thankfully is stalled as of tonight.",
    "He's yelling at America again from Philadelphia.",
    "SEN. TOM COTTON (R-AR): Yeah, Sean, it's crazy.",
    "It mentioned inflation because of the pandemic.",
    "They're really following the political science.",
    "It's abused by radical environmental activists.",
    "Dr. Oz, you and I had a conversation this week.",
    "(LAUGHTER)\nHARRIS: Hold on, hold on, everybody.",
    "The deepest problems come down to basic things.",
    "Victor Davis Hanson, always great to have you.",
    "But you know, so you deter somebody like that.",
    "How do you explain that the response of hers?",
    "CONWAY: You're the one with the show, so you.",
    "Joe's economic and energy policies caused it.",
    "It's liquefied natural gas export facilities.",
    "By the way, doesn't she know about refugees?",
    "Voters see her as ill- equipped for the job.",
    "Stay tuned, \"THE INGRAHAM ANGLE\" is up next.",
    "He's blaming Putin, blaming the rest of us.",
    "Now, needless to say, it's not going well.",
    "A lot of it has to do with Vladimir Putin.",
    "HANNITY: What about the Alec Baldwin case?",
    "He was looking at three years behind bars.",
    "I've never heard of a contract like that.",
    "We'll have more HANNITY right after this.",
    "He doesn't believe the world is outraged.",
    "(END VIDEO CLIP)\nHANNITY: Simply is true.",
    "Well, it's actually the Biden price hike.",
    "Entire neighborhoods have been blown up.",
    "Gregg Jarrett, always great to have you.",
    "I am innocent and I am not suicidal man.",
    "I wouldn't be begging Venezuela or OPEC.",
    "But he's certainly not contrite either.",
    "As always, thank you for being with us.",
    "(COMMERCIAL BREAK)\nHANNITY: All right.",
    "But I felt there was a light sentence.",
    "Wow, that was gutsy and you know what?",
    "He'd rather beg the world's dictators.",
    "(END VIDEO CLIP)\nHANNITY: Who's worse?",
    "BIDEN: I never said I oppose fracking.",
    "I don't know, maybe I'm old-fashioned.",
    "In Europe, he knew what he was doing.",
    "Joe Biden is the one that stopped it.",
    "I think I tip my hat to both of you.",
    "UNIDENTIFIED FEMALE: Oh, I disagree.",
    "Putin is a carnivore, he's a raptor.",
    "Dr. Oz, thank you for being with us.",
    "I am not suicidal and I am innocent.",
    "You want -- and what about fracking?",
    "Where does this thinking come from?",
    "And he has to pay some restitution.",
    "Gregg Jarrett breaks it down, next.",
    "So he's an opportunistic aggressor.",
    "We'll get top that, coming up next.",
    "That's probably an understatement.",
    "HANSON: That's his modus operandi.",
    "You don't try to reason with them.",
    "He's not suicidal -- that's clear.",
    "We'll see you back here on Monday.",
    "That was a simple question to ask.",
    "Joe abandoned energy independence.",
    "Senator Cotton, great to have you.",
    "It's the pipeline infrastructure.",
    "It's not just oil and gas leases.",
    "Now, we're a net importer by far.",
    "He won't allow drilling in ANWR.",
    "HANNITY: Peter Doocy, thank you.",
    "So, yeah, fairly light sentence.",
    "It could have run consecutively.",
    "That's what I would like to say.",
    "HANNITY: You know, it's amazing.",
    "Is Joe afraid of Vladimir Putin?",
    "She has an authenticity problem.",
    "This woman should be a question.",
    "Dozens of schools have been hit.",
    "He killed over 20,000 Chechens.",
    "Why wouldn't you send the jets?",
    "We're sending Stinger missiles.",
    "That's the record of Joe Biden.",
    "Let not your heart be troubled.",
    "It's going to continue to rise.",
    "All of these things take time.",
    "You might recall some of this.",
    "But he doesn't think that way.",
    "She has a likability problem.",
    "Here's what they were saying.",
    "Now, they can course correct.",
    "She had no answer whatsoever.",
    "Thank you for being with us.",
    "We need to be free to frack.",
    "I think that's his attitude.",
    "Now, we're sending Javelins.",
    "Isn't she the borders czar?",
    "You make the show possible.",
    "SMOLLETT: I'm not suicidal.",
    "And you must all know that.",
    "SMOLLETT: I'm not suicidal.",
    "TRUMP: You said it on tape.",
    "Joe's policies are hurting.",
    "You know how risky that is?",
    "Senator, good to have you.",
    "We are energy independent.",
    "So I'm sick of this stuff.",
    "Let me tell you something.",
    "HANNITY: Thank you, Judge.",
    "I don't know what's worse.",
    "Watch this embarrassment.",
    "And this one: Pain heals.",
    "More coverage just ahead.",
    "Tell us what you learned.",
    "Why aren't we doing that?",
    "Watch with your own eyes.",
    "Always glad to have you.",
    "I mean, this is madness.",
    "That's not going to fly.",
    "It's abused by lawyers.",
    "Anyway, thank you both.",
    "You know what he said?",
    "Thank you, Joe Concha.",
    "That's how he thinks.",
    "Have a great weekend.",
    "Interesting question.",
    "Is it Joe or Kamala?",
    "What wonderful news.",
    "ALL RIGHTS RESERVED.",
    "That's what he does.",
    "Glory lasts forever.",
    "Judge, I don't know.",
    "He bombs hospitals.",
    "HANNITY: All right.",
    "Welcome to HANNITY.",
    "HANNITY: All right.",
    "That's what you do.",
    "They want to help.",
    "We'll be watching.",
    "I am not suicidal.",
    "I am not suicidal.",
    "HARRIS: Not today.",
    "Yes, yes, I would.",
    "PRIEBUS: Yes, sir.",
    "He's very cynical.",
    "Chicks dig scars.",
    "HANNITY: Oh, man.",
    "They're patriots.",
    "We appreciate it.",
    "\"Back off Biden.\"",
    "HANSON: I do too.",
    "It was that bad.",
    "HANNITY: I know.",
    "Give me a break.",
    "Thank you both.",
    "I don't get it.",
    "It makes sense.",
    "HANNITY: Yeah.",
    "He never will.",
    "Your thoughts?",
    "Your thoughts?",
    "It's permits.",
    "He never did.",
    "That's good.",
    "That's good.",
    "Take a look.",
    "JUDGE: Okay.",
    "JUDGE: Okay.",
    "Take a look.",
    "Take a look.",
    "Why is that?",
    "Take a look.",
    "You decide.",
    "Guess what?",
    "You decide.",
    "All right.",
    "All right.",
    "Thank you.",
    "Thank you.",
    "All right."
  ]
}