{
  "id": 10703,
  "mediaId": 8322,
  "date": "2022-03-09",
  "headline": "Dr. Oz slams politicians who still favor masks for young children: 'Harm we're doing could be irreparable'",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/12/Dr.-Oz.jpg",
  "link": "https://www.foxnews.com/media/dr-oz-masks-young-children-schools",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fox News Staff",
  "authorUrl": "https://www.foxnews.com/person/s/fox-news-staff",
  "termIds": [
    5407,
    2802
  ],
  "sentences": [
    "On the \"The Brian Kilmeade Show\" Wednesday, the Pennsylvania Republican Senate candidate and TV host said more information is coming in about the damaging effects of making young children wear masks for the past two years in many schools.",
    "DR. MEHMET OZ: Well, the World Health Organization for the entire pandemic, has said do not mask toddlers, children under the age of five should not wear masks.",
    "It probably doesn't matter because young children don't seem to have much of a problem with COVID, but they definitely are paying a price.",
    "If they have glasses, which five percent of children do, they can't read because they fog up all the time.",
    "And we have more data from yesterday again showing children developing more and more problems.",
    "Dr. Mehmet Oz slammed liberal politicians who still favor masking young children.",
    "They can't speak because they don't see the teacher's mouth move.",
    "They've got masks that blind them from speaking with each other.",
    "These little kids should be allowed to live their lives.",
    "The harm that we're doing could be irreparable.",
    "They feel scared of each other.",
    "It's one massive experiment.",
    "WATCH FULL INTERVIEW BELOW:",
    "The masks don't fit anyway.",
    "Here's why it doesn't work.",
    "… They slobber all over.",
    "They can't keep it on.",
    "We don't even know.",
    "It doesn't work."
  ]
}