{
  "id": 10739,
  "mediaId": 2526,
  "date": "2022-03-14",
  "headline": "GOP Senate Candidate Dr. Oz’s Soft History with Transgender Ideology Under Fire in Pennsylvania",
  "image": "",
  "link": "https://www.breitbart.com/politics/2022/03/14/gop-senate-candidate-dr-ozs-soft-history-with-transgender-ideology-under-fire-in-pennsylvania/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    5862,
    3890,
    3497,
    2802,
    1489,
    1126,
    6506
  ],
  "sentences": [
    "[That’s] including things like mastectomies on healthy teen girls and using pharmaceutical drugs to prevent puberty on healthy children.”\nThis would not be the first time Dr. Oz has seemingly altered his position on controversial issues to fall more in line with the conservative movement, as he stood as a proponent of Obamacare, supporting health insurance mandate requiring “everyone … to be in the system.” Even CNN described Dr. Oz as previously “taking positions that are unusual for a Republican candidate.”\nOnce again, though, Oz’s spokesperson said the candidate now “does not support a big government takeover of the health insurance industry” and “would not have voted for Obamacare.”\nA recent Fox News poll showed businessman David McCormick as the frontrunner in Pennsylvania’s GOP Senate primary race, leading Oz by nine percentage points.",
    "Five years prior, Dr. Oz featured a special on his program titled “Transgender Kids: Too Young to Decide?”:\nDuring the show, Dr. Oz also spoke with pediatrician Dr. Robert Garofalo, who later credited his appearance on the show for enabling a change in his “career path to think more broadly about the transgender health and specifically to the inclusion of children and families.” He reportedly started a transgender clinic, giving minors cross-sex hormones and surgeries, in 2013.",
    "Dr. Oz’s platform largely centers around rebuilding what he describes as “the middle layers of society – institutions like family and community – that have been hollowed out by failed policies, narrow thinking, and toxic culture wars.” However, in recent months, the left has made a significant push to advance radical transgender ideology — even on school children — and Dr. Oz’s history of giving a platform to activists and advocates is now under sharp scrutiny.",
    "It does not end there, either, as Oz hosted an online series called the “Queer Family Tree,” which featured a discussion on the “importance of pronouns.” While Fox News notes that Oz himself did not appear in the videos, the series was hosted on “Oz Tube.”\nCritics mainly point to the fact that Oz did not host critics of the radical transgender movement on his program as he did for those in favor.",
    "…\nDr. Oz also hosted two fathers who “had become moms,” discussed a couple’s sex life, and said it was “wonderful” that a child now called her dad-to-mom “mom-squared.”\nDr. Oz also hosted two segments with Dr. Christine McGinn, a surgeon who performs transgender surgeries and who also identifies as transgender.",
    "Fox News, laying out the concerns, noted that Oz had given a platform to “transgender children, parents who changed their gender identities, and a surgeon who performs transgender surgery, even before Bruce Jenner’s transgender splash in 2015” on his show.",
    "Celebrity Doctor Mehmet Oz, who is running as a Republican Senate candidate in Pennsylvania, is coming under fire in recent days over his soft history with transgender ideology, giving a platform to those advocating for the left’s radical views.",
    "Yet, during the show, Dr. Oz also featured segments with Dr. Christine McGinn, “a surgeon who performs transgender surgeries and who also identifies as transgender,” another example of his tendency to give a platform to transgender activists.",
    "And transgender folks who are adults, when they are processing this, have to figure out if they wanna keep living the lie – they don’t think they’re who they are – or be who they truly are and are [inaudible] because of it.",
    "Yet, when asked about Lia Thomas, the biological male at the University of Pennsylvania who has been smashing women’s records, the candidate said we “have to have compassion” for transgender adults.",
    "That’s not fair,” he said, adding that “feminists have very eloquently fought for the ability to have women’s sports be on equal [inaudible] as men’s sports, and this takes away that ability.",
    "“A review of his broadcasts suggests Dr. Oz has used his show to promote transgender ideology,” Michael Geer, president and CEO of the Pennsylvania Family Institute, told Fox News Digital.",
    "And you can see the beautiful young woman she’s becoming because of it.”\nNow, Jazz is 21 and admitting to struggling with mental health issues which led to 100 pounds in weight gain.",
    "“I would argue that what I just said can’t be said – I definitely couldn’t have said it on [The Dr. Oz Show] – and you need to be able to say those things,” he claimed.",
    "However, Dr. Oz’s spokesperson said that he is, indeed, a conservative who “doesn’t believe biological men should play women’s sports” — a major social issue.",
    "That same year, he featured famed transgender teenager and LGBT activist Jazz Jennings, telling his mother, “I love the support you’ve given your daughter.",
    "“But then you layer on top of that changes to our society that hurt other people in an effort to protect one group of people, and that’s not fair.",
    "“The transgender issue is kind of diluted a little bit,” Oz said at the time:\nThe suicide rate amongst transgender adults has grown [inaudible].",
    "That was not the first time Oz provided transgender activists with a platform, either.",
    "McGinn discussed how to change male sex organs into female sex organs.",
    "We have to have compassion on this problem.",
    "This is critical to understand.",
    "So that’s like the baseline.",
    "It is a devastating one.",
    "It’s wonderful."
  ]
}