{
  "id": 11186,
  "mediaId": 2556,
  "date": "2022-03-09",
  "headline": "‘The Good Dish’ Not Returning For Season 2 In Syndication; Sony Pictures TV Exploring Options",
  "image": "https://deadline.com/wp-content/uploads/2021/12/THE-GOOD-DISH-HOSTS_LOGO-YELLOW.jpg?w=1024",
  "link": "https://deadline.com/2022/03/the-good-dish-canceled-no-season-2-syndication-1234974476/",
  "mediaOutlet": "Deadline",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1817,
    4284,
    3691,
    1216,
    1217,
    6099,
    6678
  ],
  "sentences": [
    "The fate of The Dr. Oz Show, which had been renewed until mid-2023, became uncertain after Oz announced his candidacy for the Senate, with the Fox stations in New York and Philadelphia pulling the program right away.",
    "Both Dr. Oz and The Good Dish have been distributed by Sony Pictures Television, which is now looking for alternatives to keep The Good Dish on the air, including cable or streaming.",
    "Hosted by Oz’s daughter Daphne Oz along with Gail Simmons and Jamika Pessoa, The Good Dish was picked up by station groups across the country that carry The Dr. Oz Show.",
    "The Good Dish launched January 17 in more than 90% of the U.S., including top-market stations in New York, Los Angeles, Chicago, Philadelphia and Dallas.",
    "The Good Dish replaced the long-running The Dr. Oz Show, which ended on January 14 amid host Mehmed Oz’s Senate run in Pennsylvania.",
    "They include the Fox Stations, which had been The Dr. Oz Show‘s core station group, as well as Hearst, Nexstar, Gray and Sinclair.",
    "The Dr. Oz Show spinoff The Good Dish has been canceled after one partial season in national syndication, sources tell Deadline.",
    "The Good Dish comes from five-time Daytime Emmy-winning executive producers Amy Chiaro and Stacy Rader and ZoCo Productions.",
    "The show, whose end was reported by The Sun, is produced by ZoCo Productions and distributed by Sony Pictures Television.",
    "Fox Stations recently picked up the new Jennifer Hudson daytime syndicated talk show for next season.",
    "It is among the lower-rated syndicated talk shows but not at the very bottom of syndication ratings.",
    "It is yet to be slotted but I hear it will not go into The Good Dish periods.",
    "Subscribe to Deadline Breaking News Alerts and keep your inbox happy.",
    "The studio declined comment.",
    "96 Comments"
  ]
}