{
  "id": 11211,
  "mediaId": 2553,
  "date": "2022-03-17",
  "headline": "Dr. Oz Pledges To Renounce Turkish Citizenship If He Wins Senate Race",
  "image": "https://dw-wp-production.imgix.net/2022/03/80C70A32-B434-470F-B445-11017A1D9FFC-scaled.jpeg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/dr-oz-pledges-to-renounce-turkish-citizenship-if-he-wins-senate-race",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Rigolizzo",
  "authorUrl": "https://www.dailywire.com/author/john-rigolizzo",
  "termIds": [
    0
  ],
  "sentences": [
    "Oz condemned the attacks as “bigoted” and a “disgraceful tactic,” and said they were a sign of McCormick’s “desperate campaign.” “It is completely disqualifying behavior for anyone aiming to serve in the U.S. Senate.”\nOz and McCormick sparred with each other earlier this week after reports surfaced that Oz was planning to return to TV if he did not win the Republican nomination for Senate.",
    "“To me, it’s just inconceivable that you would make a decision that somehow would limit your access to this kind of intelligence that you need to do the job,” Sullivan said, though he did note that, to date, the U.S. Intelligence community has not weighed in, and the issue of dual citizenship from a Middle East country has never been tested.",
    "Oz, the former heart surgeon and television host who is running in the primary to replace retiring Senator Pat Toomey (R-PA), made the promise in a campaign statement on Wednesday, saying the issue of his dual citizenship had become a “distraction.”\n“My dual citizenship has become a distraction in this campaign,” Oz said.",
    "He served in the Turkish army for a time to retain his Turkish citizenship, and The Associated Press reported that he intended to keep that citizenship in order to make legal decisions for his mother, who lives in Turkey and suffers from Alzheimer’s disease.",
    "But the issue of his dual citizenship became the subject of controversy this week after a report by the website PA Politics claimed that Oz said he would forego certain security clearances in order to retain his dual citizenship.",
    "The Daily Wire reported:\n“He is only 61-years-old and isn’t ready to retire if he doesn’t go to Washington DC,” sources told Radar, the same publication that broke the Jeff Zucker scandal at CNN.",
    "Which is why there has already been talk about him becoming a primetime opinion host.”\nOz fired back at those reports Tuesday, claiming they were “fake news” being pushed by McCormick.",
    "In a press conference Wednesday with primary opponent David McCormick‘s campaign, Alaska Republican Senator Dan Sullivan criticized the decision without mentioning Oz by name.",
    "A February poll by the Trafalgar Group found that Oz held an 11-point lead over McCormick, but a March poll from Fox News found that McCormick held a 9-point lead over Oz.",
    "Senator to hold dual citizenship, as Senator Ted Cruz (R-TX) was born in Canada and held Canadian citizenship, though he was unaware of it, until he renounced it in 2016.",
    "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn in as the next U.S.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "Republican Pennsylvania Senate candidate Dr. Mehmet Oz has pledged to renounce his Turkish citizenship if elected to the United States Senate.",
    "The two candidates are the top contenders in a heated and volatile primary for the GOP nomination in Pennsylvania.",
    "Senator for Pennsylvania I will only be a U.S. citizen.”\nOz was born in Cleveland, Ohio, to Turkish parents.",
    "Like any good doctor, he is already looking for alternatives to keep his career alive if he doesn’t win.",
    "Fortunately for him, his appearances on Fox News and Newsmax have impressed the bosses.",
    "There is no doubt that he is a very gifted communicator on TV.",
    "Get inside access to The Daily Wire by becoming a member.",
    "“No one wants to admit defeat, but he isn’t a stupid man.",
    "Create a free account to join the conversation!",
    "He knows his campaign is on life support.",
    "His father passed away in 2019.",
    "Oz would not be the first U.S.",
    "I’m in to win,” Oz tweeted.",
    "“I’m in."
  ]
}