{
  "id": 11782,
  "mediaId": 8254,
  "date": "2022-03-24",
  "headline": "Biden asks Mehmet Oz to quit presidential council or be ousted",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/AP22042510861785-1.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/biden-asks-mehmet-oz-to-quit-presidential-council-or-be-ousted/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "LEXI LONAS",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In a post on Wednesday, Oz, who is a candidate in Pennsylvania, said the administration sent him a letter requesting he resign from the President’s Council on Sports, Fitness & Nutrition.",
    "According to CNN, individuals on the Council on Sports, Fitness & Nutrition are considered special government employees who are barred from partisan elections under the Hatch Act.",
    "(The Hill) – President Biden has asked Republican Senate candidates Herschel Walker and Mehmet Oz to quit their positions on a presidential council or be removed.",
    "“Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "A White House official said it is the administration’s policy not to let those running for federal office be on presidential boards.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons,” Oz said in the caption of the video.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "The two candidates were nominated to the council under former President Trump in 2018.",
    "A letter from the administration was shown in a video Oz released on the situation.",
    "A similar letter was also sent to Walker, who is running in Georgia, CNN reported.",
    "The letter states Oz needs to resign or he will be ousted at 6 p.m. on Wednesday.",
    "The Hill has reached out to Walker’s campaign and the White House for comment.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "“It’s sad that he would politicize such an important issue like health.",
    "I am proud of my service and will not resign,” Oz said in his video.",
    "Sign up for the abc27 newsletters here.",
    "Sign up here."
  ]
}