{
  "id": 12311,
  "mediaId": 8393,
  "date": "2022-03-28",
  "headline": "Senate contender Dr. Oz made stops in two local counties",
  "image": "https://www.pahomepage.com/wp-content/uploads/sites/91/2022/03/vlcsnap-2022-03-28-19h00m10s623.png?w=1280",
  "link": "https://www.pahomepage.com/news/senate-contender-dr-oz-made-stops-in-two-local-counties/",
  "mediaOutlet": "pahomepage.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cody Butler",
  "authorUrl": "https://www.pahomepage.com/author/cody-butler/",
  "termIds": [
    0
  ],
  "sentences": [
    "CLICK BELOW TO SEE THE FULL INTERVIEW WITH DR. OZ\n“America needs to get the message clearly that it’s a national security imperative to have natural gas drilling and supply it to both us and the rest of the world.",
    "I love this nation like everyone watching does,” said Dr. Mehmet Oz,(R) PA Senate candidate\nDr. Oz also visited a Coterra Energy Natural Gas Production site in Springville Township.",
    "EYEWITNESS NEWS (WBRE/WYOU) — From your local election headquarters, from TV to running for a Pennsylvania Senate seat, Dr. Mehmet Oz made a stop in our region on Monday.",
    "“This is everything from somebody driving big rigs to weld pipes together, to facilitate in hospitals with a functioning and full capacity.",
    "In all, his trip is to understand the need for more jobs and how the natural gas industry impacts the local community, state, and country.",
    "What is achievable and the reason America has become just a clean country with our environment is we have natural gas,” Dr. Oz explained.",
    "They realize there is other ways of learning other than going to a four-year college,” said Dr. Mehmet Oz, (R) PA Senate Candidate.",
    "I burned the boats which is metaphorically when I shut my showdown and closed my magazine because it is worth it to me.",
    "Dr. Oz plans to continue to tour the state to learn more about what Pennsylvanians want to see done in Washington D.C.",
    "Nursing students found Dr. Mehmet Oz teaching their class at Susquehanna County Career and Technology Center.",
    "The tv star focused on jobs and energy as his campaign came to Susquehanna and Wyoming counties.",
    "Dr. Oz made a campaign stop to learn more about career learning and natural gas production.",
    "Eyewitness News spoke with the tv doctor one-on-one, as we head into the primaries in May.",
    "He also made a stop in Wyoming County at Lackawanna College Petroleum and Natural Gas.",
    "Dr. Oz aired the final episode of his show in January to focus on his campaign.",
    "Oz believes the Green New Deal is a “lie.”\n“This is not a policy or politics.",
    "“it’s remarkable to get young energetic folks passionate about learning.",
    "“I’m campaigning because I am worried the crisis we find ourselves in.",
    "In addition to Dr. Oz making a stop at the center’s CDL program.",
    "That initiative has to be made clear to the federal level.",
    "As Senator Pat Toomey is not running for reelection.",
    "Dr. Oz is up against six Republicans in the race.",
    "as he wants to increase energy independence.",
    "Just scientifically it’s not achievable.",
    "This is Pennsylvania,” said Dr. Oz.",
    "We shouldn’t be short on workers.",
    "It’s not right now,” Dr. Oz said."
  ]
}