{
  "id": 1429,
  "mediaId": 6497,
  "date": "2022-02-11",
  "headline": "Why ‘Dr. Phil’ Is Bulletproof Despite “Toxic Workplace” Claims",
  "image": "https://www.hollywoodreporter.com/wp-content/uploads/2020/02/dr_phil_comp_1_embed.jpg?w=928",
  "link": "https://www.hollywoodreporter.com/business/business-news/why-dr-phil-is-bullet-proof-1235091844/",
  "mediaOutlet": "Hollywood Reporter",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gary Baum",
  "authorUrl": "https://www.hollywoodreporter.com/author/gary-baum-thr/",
  "termIds": [
    0
  ],
  "sentences": [
    "(A show spokesperson responded that Dr. Phil was “very disappointed” that she declined its offer of medical assistance, and “we view every Dr. Phil episode, including Miss Duvall and her struggle with mental illness, as an opportunity to share relatable, useful information and perspective with our audiences.”)\nThe Boston Globe and medical website STAT together alleged in 2017 that vulnerable guests of the program, including addicts suffering from withdrawal symptoms, were put at acute risk by the show’s staff.",
    "Then, in 2020, I wrote in THR about Dr. Phil’s chief content adviser, whose practices (including a treatment for mental illness) have been deemed potentially dangerous by the scientific community, as well as the show’s long affiliation with an L.A. rehab that the state of California had classified as “rogue” a decade earlier and which had subsequently lost its license following multiple client deaths.",
    "The similarities are striking: Dispiriting accusations of a culture of fear, intimidation and racism; a group of anonymous staffers pinning blame on executive producers; and implications that the name-brand talent have, at best, abdicated their own oversight responsibilities.",
    "Duvall herself told The Hollywood Reporter in 2021 that she “found out the kind of person he is the hard way,” and noted McGraw repeatedly called her mother to facilitate a follow-up interview even after the initial broadcast and its backlash.",
    "Skipping the innumerable tabloid revelations and McGraw’s own petard-hoisting claims while appearing on Fox News, there were headline-making charges of exploitation over interviews with Britney Spears in 2008 and Shelley Duvall in 2016.",
    "Rather, he’s spent an on-air career burnishing what Yandoli terms a “trademark brand of snarky straight talk,” which itself appeals to a self-selecting demographic suspicious of softness and in thrall to his imperious energy.",
    "When he gets a professional itch, he turns to podcasting about true crime (Mystery and Murder: Analysis by Dr. Phil) or spoofing cameos (from Frasier and Curb Your Enthusiasm to Crazy Ex-Girlfriend).",
    "This, coupled with no structural pressures — a loyal audience unlikely to rebel, a show he owns himself, a decentralized syndication system easy to govern when Dr. Phil remains the No.",
    "This time it’s not Ellen DeGeneres, whose eponymous show’s ratings soon went into precipitous decline, and will end after its 19th season later this year.",
    "Instead, it’s Phil McGraw, subject of a Feb. 10 investigation published by BuzzFeed News’ Krystie Lee Yandoli, who broke the DeGeneres story in July 2020.",
    "Employees of a top-rated, nationally syndicated TV host allege a systemic pattern of behind-the-scenes workplace toxicity and abuse.",
    "In a separate story, the publications probed concerns surrounding an addiction recovery program run by McGraw and his son, Jay.",
    "It’s what derailed Ellen and will, barring something unforeseen, allow Dr. Phil to bound along with no discernible impact.",
    "Representatives for Dr. Phil and McGraw have sought to refute, downplay or disassociate themselves from these claims.",
    "His viewers pride themselves on being clear-eyed, or at least willing to do the work to see the dirty truth.",
    "That’s because McGraw possesses a valuable quality in the business of power: shamelessness.",
    "Unlike his closest analog, would-be Senate hopeful Dr. Mehmet Oz, McGraw knows his lane.",
    "Her catchphrase, which made her look like a hypocrite, was “Be kind.” McGraw didn’t.",
    "1 daytime talk show, according to Nielsen — means there’s little chance for change.",
    "At most, the revelations about him may elicit some dark jokes among the faithful.",
    "DeGeneres was assailable because her fans think of themselves as nice.",
    "Unless he commits an intentional act of violence, he’ll be fine.",
    "(The BuzzFeed coverage also pursued a similar line of inquiry.)",
    "There’s no traction to be had because there’s no constituency.",
    "What’s more, they think the world should be, too.",
    "But in the end, they underscore his authenticity.",
    "McGraw’s world, by contrast, is hard-boiled.",
    "DeGeneres built her image on niceness.",
    "Dr. Phil has been exposed before.",
    "The difference is simple."
  ]
}