{
  "id": 1447,
  "mediaId": 2663,
  "date": "2022-02-11",
  "headline": "Dr. Oz is running a more abysmal campaign than Caitlyn Jenner did, if that’s even possible",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/02/Screen-Shot-2022-02-11-at-11.00.50-AM.png?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/dr-oz-running-abysmal-campaign-caitlyn-jenner-thats-even-possible-20220211",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Graham Gremore",
  "authorUrl": "https://www.queerty.com/author/graham-gremore",
  "termIds": [
    5905,
    3497,
    2802,
    5966,
    6506,
    6338
  ],
  "sentences": [
    "Today, Oz, who moved from New Jersey to Pennsylvania for the sole purpose of running for office there, will take a break from campaigning to fly across the country to Los Angeles, where he will receive a star on the Hollywood Walk of Fame, according to Newsweek.",
    "But the fact that Oz has stumbled out of the gate in this first test among GOP activists has exposed vulnerabilities in his past record and raised questions about whether rank-and-file voters will also turn their backs on him once they learn more about him.",
    "Related: Dr. Oz’s campaign for U.S. Senate is a sh*tshow of epic proportions, insiders say\nTellingly, Oz has made absolutely no mention on his Twitter page about receiving a star on the Hollywood Walk of Fame today.",
    "“I spent time with West Pittson leaders in Luzerne County talking about how regulations and bureaucracy are holding back our communities from making needed investments,” the 10-time Daytime Emmy Award winner wrote.",
    "Many political operatives expect that the state Republican Party ultimately will decline to endorse in the primary this year — giving state committee members much less power than they would otherwise have.",
    "Related: Caitlyn Jenner’s campaign debrief has begun and OMFG what a mess that was\nOz’s opponents were quick to criticize him for leaving to campaign trail to receive a star on the Hollywood Walk of Fame.",
    "Despite huge name recognition, deep pockets, connections to Oprah, and a ton of press coverage, the TV doctor is running an absolutely terrible campaign, and he has nobody to blame but himself.",
    "(@votethemout13) February 11, 2022\nPaid actors\n— Talal ALMUTAIRI (@hunterzorro2) February 11, 2022\nkwak kwak kwak\n— summerwind (@summerw07043354) February 11, 2022\nWhat is “it” exactly?",
    "Caitlyn Jenner pulled a similar move during her disastrous gubernatorial run in California last summer, when she flew to Australia to film Big Brother VIP, and was widely criticized.",
    "It is becoming increasingly clear that Dr. Mehmet Oz, who is currently running in the GOP primary for U.S. Senate in Pennsylvania, belongs in the latter category.",
    "A new attack ad accusing the TV doctor of being “right for Hollywood, but he’s wrong for Pennsylvania” has already begun airing across Pennsylvania.",
    "When it comes to TV personalities pivoting from the small screen to politics, there are two categories: the Donald Trumps and the Caitlyn Jenners.",
    "— Brendan McNulty (@VoiceofBrendan) February 11, 2022\nThe Hollywood Walk of Fame ceremony honoring Oz will commence at 11:30 AM PST today.",
    "This morning, while he was presumably en route to L.A., he tweeted a video of himself meeting with constituents in Luzerne County.",
    "Per Politico:\nThe straw poll results in the Senate race are not binding, and they’re not surveys of the actual electorate.",
    "In one of them, he received just one–yes, ONE–vote out of more than 100 cast, despite spending over $5 million on TV ads.",
    "Now, some responses…\nFrom tv personality to expert on how regulations and bureaucracy are holding back our communities.",
    "This is in addition to another attack ad branding him a “Hollywood liberal” that hit airwaves last month.",
    "(She also reportedly burned through almost $1 million on the failed vanity project.)",
    "— Colleen Boykin (@ColleenBoykin1) February 11, 2022\n“Our communities”?",
    "The ads come after Oz’s abysmal performances in multiple straw polls.",
    "Graham Gremore is the Features Editor and a Staff Writer at Queerty.",
    "She ultimately lost the election, winning a paltry 1% of the vote.",
    "Why he thought this was a good idea is anyone’s guess.",
    "You never really say anything but you talk too much.",
    "— Martha Roth (@Buds_mom) February 11, 2022\nGrifter.",
    "No, just someone who thinks they know more.",
    "In two others, he placed third and fourth.",
    "Follow him on Twitter @grahamgremore.",
    "You’re from New Jersey you quack.",
    "We don’t want or need you.",
    "Hypocritical fraud.",
    "— VOTE THEM OUT !",
    "GET OUT OF PA!"
  ]
}