{
  "id": 15790,
  "mediaId": 8270,
  "date": "2022-03-09",
  "headline": "Dr. Mehmet Oz’s U.S. Senate campaign makes stop in Berks County",
  "image": "https://www.readingeagle.com/wp-content/uploads/2022/03/Dz.-Oz1.jpg?w=1024&h=652",
  "link": "https://www.readingeagle.com/2022/03/09/dr-mehmet-ozs-stops-in-berks-county/",
  "mediaOutlet": "berksmontnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Shuey",
  "authorUrl": "https://www.readingeagle.com/author/karen-shuey/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I spoke up about this and they came after me for saying something that, as someone who is a physician and has expertise in the area, I should have been allowed to say.”\nAfter speaking for about 30 minutes on topics such as energy independence, accusations of liberal indoctrination, protecting the country’s borders and concerns about crime, Oz took questions from the audience.",
    "“He shares a lot of my conservative views, especially when it comes to education and energy.”\nSmith said that after hearing what Oz had to say he thinks the candidate will be a good choice to represent the commonwealth because of his experience and knowledge.",
    "“I have been on the front lines fighting for my views in the public eye, which is something you have to do if you want to be in the Senate.”\nOz promised voters that if they send him to Washington he will continue that battle on behalf of Pennsylvanians.",
    "Talking with the nearly 150 potential Republican primary election voters who gathered at the Oley Fire Company Fairgrounds Wednesday afternoon for a town hall meeting, he said his role as a television talk show host is actually a positive thing.",
    "“And his views on those issues just confirmed why I’m voting for him.”\nNeighbors John Halabura and Ken Smith of Orwigsburg came to Wednesday’s event with open minds, saying they haven’t yet settled on whom they will vote for in May.",
    "The heart surgeon-turned television personality launched his campaign for the open Senate seat late last year, saying the government’s response to the COVID-19 pandemic played a big role in his decision to run.",
    "As for his foreign policy views, Oz said the U.S. needs to set an example for what a successful democracy looks like and stand up to authoritarian regimes like the one in power in China.",
    "“Running was already in my mind, but with COVID smacking us around, I realized that the government believed the best way to go forward was to take an authoritarian approach,” he said.",
    "I’m an astrologist and numerologist so I know the importance of being knowledgeable about natural healing.”\nShe said Oz has her support because he stands for the right values.",
    "He said he is adamant about people being able to have the freedom to choose their own doctor and about advocating for transparency about the cost of care and medications.",
    "A Fox News poll released Tuesday of Pennsylvania Republican primary voters found that he is 9 points behind frontrunner David McCormick, the former CEO of a hedge fund.",
    "“And that didn’t work.”\nOz said the one-size-fits-all method was not the right way to handle the global health crisis, calling the guidelines and mandates draconian.",
    "One of those questions was about Oz’s top three priorities should he earn the Republican nomination in the May 17 primary and win in the general election this fall.",
    "Dr. Mehmet Oz’s competitors use his fame as a weapon, saying he’s a member of the Hollywood elite unqualified to represent Pennsylvania in the U.S. Senate.",
    "He said he thinks Oz is actually more qualified than most candidates to serve Pennsylvania because he has those experiences living in other states.",
    "Oz responded quickly and confidently, stating that his main points of focus will be health care, education and foreign policy.",
    "He said he will take the time to talk with his constituents, learn what problems they are facing and fight to find solutions.",
    "When it comes to education, he said parents need to be empowered to send their kids to any school district they choose.",
    "Genevieve McCormick of Kutztown said she feels comfortable with the candidate, having spent years watching him on TV.",
    "“I’m still undecided about who to vote for, so I thought I’d come hear what he has to say for myself,” Halabura said.",
    "He asked if Oz is ready to answer questions about the fact that he has not spent much time living in Pennsylvania.",
    "Oz does have history in the state, having earned medical and business degrees from the University of Pennsylvania.",
    "And it has forced him to be comfortable taking public stands, even when they run counter to the mainstream.",
    "“I don’t think anyone else running has the backbone needed to stand up for what they believe,” he said.",
    "It has taught him how to listen to people, to understand their concerns and fears and points of view.",
    "The support Oz received Wednesday was a bit of good news at a time when his campaign needed some.",
    "Another question came from a man who said he liked Oz but had some concerns about his viability.",
    "However, he used a Montgomery County address that is a home owned by his mother-in-law.",
    "“Every issue he addressed today is very important to me,” the Kutztown resident said.",
    "“People care much more about what you stand for than where you’re from,” he said.",
    "Oz’s performance at the town hall received a favorable reaction from the crowd.",
    "“We bristle when people treat us like sheep,” he said of the American people.",
    "But he has been a longtime resident of Bergen County in northern New Jersey.",
    "Halabura and Smith are farmers whose main concern right now is energy costs.",
    "So Oz’s message about being energy independent struck a chord with them.",
    "When it comes to his residency issues, Smith said he’s not concerned.",
    "The men said they simply cannot afford higher fuel prices right now.",
    "“I feel an affinity to Dr. Oz because I watched his show,” she said.",
    "“We need to continue to be that shining city on a hill,” he said.",
    "“I have been doing these things for years,” he told the audience.",
    "However, a third of those surveyed said they’re still undecided.",
    "Back in 2021, Oz did become a registered voter in Pennsylvania.",
    "Polls show that Oz is facing a bit of an uphill battle.",
    "“I really like his message about holistic health.",
    "“It gives him another perspective,” he said.",
    "They said Oz checks a lot of boxes for them.",
    "Oz dismissed concerns about residency.",
    "Mary Darrach feels the same way.",
    "Oz doesn’t see it that way."
  ]
}