{
  "id": 17250,
  "mediaId": 8254,
  "date": "2022-03-02",
  "headline": "Oz visits Harrisburg, picks up key endorsement",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/Dr.-Mehmet-Oz-in-Harrisburg.png?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/dr-oz-visits-harrisburg-picks-up-key-endorsement/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    2842,
    1000,
    1126,
    476,
    1584,
    1489,
    6208,
    6506
  ],
  "sentences": [
    "“We as a nation say ‘from now on when we say we need energy, we make energy.’ We don’t let pipelines get stopped halfway down the construction pipeline because a bunch of activists get upset about the possibility they might have an ecological impact.”\nThe Pennsylvania primary election is scheduled for May 17.",
    "“I guess the rationale there is, well who’s he going to be advocating for in the Senate?”\nRegan added he thinks it would be “nice to have a Pennsylvania Senator who’s the smartest guy in the Capitol.”\nGet daily news, weather, breaking news, and alerts straight to your inbox!",
    "“They’re sick and tired of the federal government, in particular, and bureaucrats who’re just paper pushers making rules they can’t keep up with.”\nThe child of Turkish immigrants, Oz was asked by abc27’s Dennis Owens about his take on the Russian invasion of Ukraine.",
    "The 61-year-old former cardiothoracic surgeon highlighted how he went to medical school at the University of Pennsylvania School of Medicine and earned a business degree from the Wharton School of the University of Pennsylvania.",
    "Regan, a member of the Pennsylvania Senate Judiciary Committee, says he never watched Oz’s long-running daytime television show “The Dr. Oz Show,” but he felt Oz was a “credible candidate” who closely matched him on the issues.",
    "Oz has been running television ads across the Commonwealth pushing against COVID-19 mandates, many of which local, state, and federal governments have begun to lift as cases decline across the country.",
    "The long-time television show host is one of more than a dozen Republican candidates registered with the Federal Election Commission to run in Pennsylvania’s U.S. Senate primary election.",
    "“He was nice, he didn’t seem like a TV star.”\nA criticism brought against Oz by campaign opponents has been his residency, with people questioning whether he’s from Pennsylvania.",
    "“They care much more for what I stand for than where I’m from.”\n“People want to say that he’s not from Pennsylvania and I guess that’s true,” said Regan.",
    "HARRISBURG, Pa. (WHTM) – U.S. Senate candidate Dr. Mehmet Oz picked up a key endorsement during his visit to the Midstate on Wednesday.",
    "Oz was joined by State Senator Mike Regan on Wednesday morning, meeting residents at the Front Street Diner in Harrisburg.",
    "“You can tell he’s extremely bright,” remarked the two-term State Senator after first meeting Oz in Camp Hill.",
    "“If that’s the biggest criticism against me, I’m in good shape,” remarked Oz wearing a Pennsylvania flag pin.",
    "Oz focused his attention on Pennsylvania’s energy resources and becoming energy independent.",
    "“Pennsylvanians know exactly what they want to do with their lives,” said Oz.",
    "“I’m very proud that I’m a Pennsylvanian,” said Oz.",
    "Watch the full interview with Dr. Oz down below!",
    "Sign up for the abc27 newsletters here."
  ]
}