{
  "id": 174,
  "mediaId": 8489,
  "date": "2022-02-22",
  "headline": "Mehmet Oz wants us to know why he’s here in Pa. Will enough voters buy it?",
  "image": "https://whyy.org/wp-content/uploads/2022/02/AP22042711194752.jpg",
  "link": "https://whyy.org/articles/mehmet-oz-wants-us-to-know-why-hes-here-in-pa-will-enough-voters-buy-it/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Meyer",
  "authorUrl": "https://whyy.org/person/katie-meyer/",
  "termIds": [
    0
  ],
  "sentences": [
    "He describes himself as a staunch, Fox News-watching Republican, and says Oz “has the same qualities that Trump has, and that’s the kind of people we want on our team.” Oz has made many appearances on Fox since announcing his bid, on topics ranging from COVID-19 “authoritarianism” to misleading rumors about immigrants being relocated to Pennsylvania.",
    "“If you don’t like anything else that you hear tonight, at least you have gotten something out of it for yourself.”\nAs Oz embarks on an outsider campaign to win Pennsylvania’s Republican U.S. Senate primary, he’s using these town hall events — he’s done nearly a dozen — to introduce himself to the commonwealth as a serious, conservative politician.",
    "Jeff Bartos, a real estate developer and the third candidate who has built real traction in the Senate primary, also has put more than a million of his own dollars into his campaign, and is backed by a PAC, Jobs for Our Future, that has reported spending almost $2 million on ads pitching Bartos as the only true Pennsylvanian in the race.",
    "But there is already at least one big PAC spending money on his behalf: American Leadership Action, which has a staff full of D.C.-based strategists and has so far reported spending almost $1.3 million on consulting and ads criticizing David McCormick, one of Oz’s biggest rivals.",
    "“Energy is a good example … I do my homework, but every day I learn more things.”\nHis core pitch to these voters, though, is that he understands them in much the same way they decided, nearly six years ago, that Donald Trump understood them.",
    "Ahead of his Wednesday night town hall at a Washington, Pa., American Legion post, Mehmet Oz is hidden away in a side room while his campaign staff bustles around, assuring the mostly elderly crowd that “the show” is going to start soon.",
    "“The great thing about having a lot of cash is you can skip debates, and you can just keep running TV ads, and you can make up whatever excuse you want for why you’re not actually showing up at the debates,” Chen said.",
    "He grew up, he says, “just south of Philadelphia, about 10 miles outside of a place called Kennett Square, which is the mushroom capital of the world.” He doesn’t mention his actual hometown, Wilmington, Delaware.",
    "3 months ago\nListen 2:29\nAs Oz straps the cuff on his first volunteer — her blood pressure is a little high, but not bad — he briefly runs through his biography, emphasizing the parts that feature Pennsylvania.",
    "The Pennsylvania Patriots PAC and Honor Pennsylvania Inc. have reported putting more than $2 million into ads decrying Oz for being a “Hollywood liberal” and appearing supportive of the Affordable Care Act.",
    "“It hit me like Trump hit me in ’16,” he says, recalling a trip to Europe before that election, during which he was struck by the fascination Europeans had with the fact Trump was running for president.",
    "And once you’re gone and the dust has spread, they can rebuild America with their toxic ideology.”\nOn this group at the American Legion post, at least, the pitch seems to resonate.",
    "He notes that he went to medical school at the University of Pennsylvania and business school at Wharton, but not that until last year, he lived and voted in New Jersey.",
    "“It’s not just a matter of being able to come through here and say, ‘Hey, I’ve got a lot of cash, I’m a well-known figure, I can represent you,’” Chen says.",
    "The 100 or so people attending are herded into folding chairs arranged in a circle around the show’s centerpiece: a stool with a blood pressure cuff on it.",
    "McCormick, the former CEO of Bridgewater, the world’s biggest hedge fund, is also wealthy and expected to self-fund, though he hasn’t filed reports yet.",
    "Chen says Oz’s name recognition is a definite strength, and that he sees potential for the former TV host to appeal to voters in ways similar to Trump.",
    "He throws out some policy specifics: He’s against mask and vaccine mandates, though he concedes he urged staff on “The Dr. Oz Show” to get vaccinated.",
    "The rhetoric among Pennsylvania’s GOP candidates for Senate and governor has been the same: short on provable facts, long on inflammatory rhetoric.",
    "Several people in the hall say they came because they had gotten calls and texts from the campaign, letting them know Oz would be in town.",
    "Samuel Chen, a political science professor and Republican political strategist, notes all that money can bring with it a real downside.",
    "But that pitch always comes with a blood pressure cuff-shaped reminder: He’s still the Dr. Oz of more than a decade of daytime TV fame.",
    "“Part of the reason I’m here is to find out what’s getting your blood pressure up,” Oz tells the crowd once he’s made his entrance.",
    "She says she doesn’t care that Oz has so little in common with her and her family, or that he’s still getting to know the state.",
    "I think that was the same with Trump.”\nThat’s one of Oz’s pitches to these voters: He doesn’t plan to take any PAC money.",
    "It’s true, almost all of the more than $5 million in the Dr. Oz for Senate campaign account came from Oz himself.",
    "“Why does Washington get it wrong?” Oz asks, referring to D.C. “Because they have different values than us.",
    "“I was like, ‘Well, maybe he has a chance.’”\nMikec, who is 64, has some experience with politics.",
    "But, he adds, it’s a long race, and Pennsylvania is much bigger than a few American Legion halls.",
    "“You almost feel like you know him,” says Art Navrhe, a 79-year-old semi-retired psychologist.",
    "This is just the beginning of what will likely be a historically expensive U.S. Senate race.",
    "She’s a mom and a grandma, and her husband, David, works in natural gas extraction.",
    "But after the show, he says seeing Oz work the room in person has him reevaluating.",
    "More than 60% of Washington County residents voted for Trump in both 2016 and 2020.",
    "Eventually, he thinks, Oz will need to be more specific about why he’s doing this.",
    "Most were excited to see the man in person, after watching him on TV for years.",
    "And they don’t care about your values because they think your values are wrong.",
    "Some were a little skeptical of his Pennsylvania bona fides and policy chops.",
    "Case in point, the first Senate GOP debate at Villanova University on Monday.",
    "“You’ve got to show that you understand what it means to be a Pennsylvanian.",
    "Ken Randolph, 72, the commander of this American Legion post, sees it too.",
    "He’s been on the GOP state committee and was a Washington County chairman.",
    "Becky Redell, 49, also says she thought of Trump after hearing Oz speak.",
    "But he isn’t the only one here making comparisons between Oz and Trump.",
    "They think you are irredeemably stained and need to be broken asunder.",
    "He wants a tighter southern border, and to stop outsourcing to China.",
    "At least two political action committees are spending on his behalf.",
    "At first, Mark Mikec considered himself to be one of the skeptics.",
    "Guy Reschenthaler, a supporter who has been campaigning with him.",
    "It insulates candidates from actually answering tough questions.",
    "I don’t think I believe him when he says he can’t be bought.",
    "Initially, he’d dismissed Trump, but that changed his mind.",
    "I think there’s so much, so many politicians being bought.",
    "He punts a question on natural gas extraction to U.S. Rep.",
    "The fact that he’s wealthy makes her trust him more.",
    "I think that’s going to be his biggest challenge.”",
    "“I think because he can’t be bought,” she says.",
    "He thinks tougher policing is a good idea.",
    "Neither Oz nor McCormick participated.",
    "He’s taken to using the ELO song “Mr.",
    "“We all have blind spots,” Oz says.",
    "It’s actually a familiar feeling.",
    "Blue Sky” as his walkout music.",
    "Others were already on board.",
    "“He already has his money.",
    "It’s just corrupt."
  ]
}