{
  "id": 17728,
  "mediaId": 8314,
  "date": "2022-03-02",
  "headline": "The Changing Definition of Freedom",
  "image": "",
  "link": "https://epgn.com/2022/03/02/the-changing-definition-of-freedom/",
  "mediaOutlet": "epgn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Victoria A. Brownworth",
  "authorUrl": "https://epgn.com/author/victoria-brownworth/",
  "termIds": [
    0
  ],
  "sentences": [
    "The chamber stood and cheered Oksana Markarova, the ambassador of Ukraine to the U.S., as Biden said that Putin “thought he could roll into Ukraine and the world would roll over” but then “met the Ukrainian people.”\nMarkarova, the guest of First Lady Jill Biden, appeared overwhelmed with emotion as she stood, a small blue and yellow Ukrainian flag clutched in her hands.",
    "Oz declares that the federal government “took away our freedom” by “getting COVID wrong.”\nIn the face of the bravery of the Ukrainian people who were enjoined to make Molotov cocktails in their homes to fight the Russians, these cries of Americans against life-saving mandates are petulant and embarrassing, given the nearly one million dead from the virus.",
    "The “Freedom Convoy” of trucks rolling toward Washington D.C. or the protests outside local school districts, police departments and firehouses, in which signs demand “freedom,” are a constant, querulous bleating over public health initiatives requiring either masks or vaccinations to protect against COVID-19.",
    "In the hours before the SOTU, it was revealed that the Texas Department of Family and Protective Services (DFPS) has been investigating parents of children receiving gender-affirming care for “child abuse.”\nThe information was made public in a lawsuit filed Tuesday, March 1, against Texas GOP Gov.",
    "These same topics were discussed at length at CPAC and AFPAC and included “parental freedom” statutes which have become a workaround for the GOP to snare much-needed white suburban voters like those who chose Youngkin in Virginia and who GOP candidates hope to win over in Pennsylvania.",
    "But as the midterms move into full swing — the Texas primary was held March 1 and the Pennsylvania primary is May 17, with many other states’ primaries in-between — the conflation of “freedom” with bigotry and racism will no doubt continue.",
    "Zelensky has said repeatedly over these days of the Russian siege against Ukraine that the Ukrainian people are waging a battle for their freedom and for democracy and that the fight in Ukraine is a fight for freedom everywhere.",
    "The messaging echoes loud and long: parents deserve the “freedom” to keep kids from learning about true American history and “freedom” to keep kids from learning about their own sexual orientation and gender identities.",
    "That “freedom” mantra being promulgated by the right includes freedom of (white) parents to demand their (white) children be shielded in the classroom from the historical realities of slavery and genocide.",
    "As I reported in November, Republican businessman Glenn Youngkin ran on that messaging and won the Virginia governorship with more than 67,000 Democrats voting for him over the Democratic candidate.",
    "Those of us who don’t subscribe to these restrictive and assaultive terms of GOP engagement and the limitations of this narrow definition of freedom must use our own guerilla tactics in response.",
    "“Freedom” was also the main topic at the annual Conservative Political Action Conference (CPAC) and the America First Political Action Conference (AFPAC) held over the last weekend of February.",
    "Our votes are our best weapons — our metaphoric Molotov cocktails — to fight back against those who would corrupt and subvert our democracy and excise many from its Constitutional protections.",
    "Kim Reynolds delivered the opposition rebuttal to Biden’s SOTU speech Tuesday night and was fixated on masks, vaccines, parents’ rights and “freedom.”\n“Freedom” is a charged word in America.",
    "There has been a lot of talk about “freedom” in the U.S. in recent months, but none of it has been about defending this country from an armed invader like Vladimir Putin.",
    "Local airwaves in and around Philadelphia have been inundated with political ads from the two lead Republican contenders for the U.S. Senate seat for Pennsylvania.",
    "The ACLU argues that Abbott’s letter is a fear-mongering tactic to bypass the legislature and attack parents seeking gender-affirming care for their children.",
    "Some would say it began with the January 6 insurrection at the Capitol in which “freedom” was invoked repeatedly by those attempting to overturn the election.",
    "Both conferences were rife with right-wing extremism and white nationalism, but that didn’t stop senators and members of Congress from attending and speaking.",
    "Last week the U.S. Supreme Court decided to hear an appeal from a Colorado web designer, Lorie Smith, who objects to providing services for same-sex couples.",
    "Philadelphia is the titular “birthplace of liberty” — where this nation was founded in the writings of the Declaration of Independence and the Constitution.",
    "The lawsuit was brought by the Texas ACLU on behalf of a DFPS employee, the mother of a 16 year old trans teen, identified as Mary Doe in the suit.",
    "But even as those documents were being written as a democratic template for the world, they did not include a million slaves nor a single woman.",
    "Youngkin has since remained true to his word and issued an executive order banning books on race as well as LGBT+ issues in the schools.",
    "“In this struggle, as President Zelenskiy said in his speech to the European Parliament: ‘Light will win over darkness,’” Biden said.",
    "This broadening of the parameters of “freedom” by the GOP is a far cry from Ukrainians risking their lives to defend their country.",
    "At issue is the question of “personal religious freedom” versus laws banning discrimination on the basis of sexual orientation.",
    "The plaintiff, named as Jane Doe, says she was being investigated for “child abuse” by Abbott in a letter sent February 22.",
    "At President Biden’s State of the Union Address on March 1, there was little unity between Democrats and Republicans.",
    "But on one point the group appeared to be unanimous: all were seemingly in solidarity with the people of Ukraine.",
    "A wave of GOP book bans are targeting race, LGBT+ and U.S. history all across the country.",
    "It’s a fight that has crossed the country from suburban to big city school districts.",
    "Dr. Mehmet Oz and David McCormick both invoke the “freedom” mantra in their ads.",
    "In the period since that attack, “freedom” has taken on a different message.",
    "Yet the GOP has latched onto these complaints as a mantra for the midterms.",
    "We don’t have to weather bombs and shelling to engage this fight.",
    "On February 23 DFPS placed her on administrative leave.",
    "Greg Abbott, DFPS and DFPS commissioner Jaime Masters.",
    "But make no mistake, the stakes are no less high.",
    "Iowa GOP Gov."
  ]
}