{
  "id": 1981,
  "mediaId": 6511,
  "date": "2022-02-06",
  "headline": "El Partido Republicano de Pensilvania se niega a respaldar la carrera por el Senado",
  "image": "https://laopinion.com/wp-content/uploads/sites/3/2022/02/GettyImages-455544344.jpg?quality=80&strip=all&w=1200",
  "link": "https://laopinion.com/2022/02/06/el-partido-republicano-de-pensilvania-se-niega-a-respaldar-la-carrera-por-el-senado/",
  "mediaOutlet": "LA OPINIÓN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4029,
    2765,
    1489,
    1126,
    6506
  ],
  "sentences": [
    "Conor McGuinness, director de campaña de Bartos, dijo que “Estas encuestas informales han sido los únicos votos emitidos en esta elección, y los resultados son claros: los republicanos prefieren un residente real de Pensilvania, un conservador real, a los anuncios de televisión de pretendientes fuera del estado“.",
    "Aun así, la falta de apoyo fue una decepción para el desarrollador de bienes raíces, Jeff Bartos, cuya campaña no proyectó una victoria antes de la reunión, pero recibió más votos en las encuestas de opinión de los miembros del comité en las asambleas regionales en las semanas anteriores.",
    "Bartos, quien ha tenido problemas en las encuestas y fue superado por el médico Mehmet OZ y el ex director general de fondos de cobertura David MacCormick, necesita agitar la carrera para superar las ventajas financieras y de identificación de nombre de sus rivales.",
    "Foto: Win McNamee / Getty Images\nEl Partido Republicano de Pensilvania optó este sábado por no respalda a un candidato de las primarias en una de las contiendas por el Senado de Estados Unidos que podría ponerlos en desacuerdo con el expresidente Donald Trump.",
    "Los miembros del comité estatal del Partido Republicano, que cerraron su reunión en Lancaster a la prensa, rechazaron una moción para respaldar a los candidatos en cualquier carrera estatal por voto de voz, de acuerdo con varias fuentes de la sala.",
    "El evento de ayer estuvo marcado por altos niveles de optimismo del Partido Republicano, y los oradores en la reunión pregonaron que este año 2022 sería un muy buen año para los conservadores.",
    "Hasta el momento, Bartos demuestra en las encuestas de opinión que es el favorito entre las bases del Partido Republicano en todo el estado de Pensilvania.",
    "Por su parte, el doctor Oz se beneficia de la falta de respaldo tras un desempeño deficiente en las encuestas anteriores de activistas del partido.",
    "Asimismo, en la reunión de la semana pasada, el Partido Demócrata de Pensilvania tampoco respaldó a ningún candidato para el Senado.",
    "Oz y McCormick también han gastado más en publicidad en televisión hasta ahora que un super PAC pro-Bartos.",
    "Previo a la votación, la mayoría de los republicanos predijeron que no había un respaldo.",
    "Lea también:"
  ]
}