{
  "id": 2261,
  "mediaId": 8469,
  "date": "2022-02-08",
  "headline": "Dr. Oz brings Senate campaign to Greater Pittston",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2022/02/128187598_web1_Dr.-Oz-Visits-Gr.-Pittston-2.jpg.optimal.jpg",
  "link": "https://s24526.pcdn.co/news/1538821/1538821",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Carroll kcarroll@timesleader.com",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I think it was a good opportunity for us to meet Dr. Oz, and for Dr. Oz to meet us.”\nAt many points throughout the visit, the “rivalry” between Pittston and West Pittston was brought up for laughs, but Lombardo made it a point to note that, at the end of the day, what’s best for one side of the bridge is best for the other.",
    "In fact, it was Dr. Mehmet Oz who visited the Greater Pittston area Tuesday afternoon, spending time in both Pittston and West Pittston, checking out a few local businesses and getting a firsthand look at the Firefighters’ Memorial Bridge, which has been closed since August after an inspection revealed a bent eyebar.",
    "West Pittston mayor Angelo Alfano and borough council president both acknowledged the issues created by the closed bridge, both in terms of businesses being affected and with traffic congestion caused by cars being rerouted to the Fort Jenkins Bridge, which lies to the north of the Firefighters’ Memorial Bridge.",
    "“I’m glad we got him [Dr. Oz] here, he seems like he wants to get things done.”\nFrom there, the doctor made his way into West Pittston to see the closed bridge, while also discussing a proposed levee system for the borough with Alfano and Quinn, along with other members of West Pittston’s borough council.",
    "“The infrastructure bill just passed is an example of that, but now I want to see it in action.”\nCounty council tabled a decision to allocate funds from the $113 million in federal American Rescue Plan funding received by the county at a meeting held in January.",
    "West Pittston council president Ellen Quinn, Dr. Mehmet Oz, center, and West Pittston Mayor Angelo Alfano, aid each other as they walk on icy terrain at the exit of the Firefighters’ Memorial Bridge that connects Pittston to West Pittston.",
    "“It’s great to have some excitement in town.”\nLombardo explained to Oz the progress Pittston had made in revitalizing Main Street over the years, and to what end the government could play in helping to continue the downtown’s success.",
    "West Pittston Mayor Angelo Alfano points to irregularities in the closed Firefighters’ Memorial Bridge with PA Senate hopeful Dr. Mehmet Oz during Dr. Oz’s visit to Greater Pittston on Tuesday afternoon.",
    "For two municipalities connected by a closed-down bridge, a visit from one of the candidates for Pennsylvania’s open seat in the U.S. Senate was just what the doctor ordered.",
    "Oz started his day at Kuharchik Construction in Exeter, where he was greeted by Alfano and Kuharchik CEO Robert Bresnahan, who helped coordinate the doctor’s visit.",
    "The doctor also traveled across the Susquehanna River to Pittston, stopping in the Ah Baby + Co shop and the Art E Fekts art gallery, both located on Main Street.",
    "Ah Baby owner Caroline Nelson, a native of the area who opened the store this past August, was excited to see Dr. Oz take a visit in her store, and in the city.",
    "“The biggest mistake we made is taking doctors out of the equation.”\nAfterward, both mayors were happy with the visit and optimistic about the future.",
    "“We need this bridge not just for us, but for Pittston.”\nThe seat Oz seeks is opening up because Sen. Pat Toomey, R-Lehigh Valley, is retiring.",
    "Quinn also noted the effect the closure could have on emergency services when she spoke with Oz at the foot of the Firefighters’ bridge.",
    "Oz also touched on a number of issues during his visit, including COVID-19 and the federal government’s handling of the pandemic.",
    "“If it would cost $50 million to build a levee here, that’s a pretty wise investment to protect these homes,” Oz said.",
    "“I think it was a good visit, I hope that Dr. Oz got to realize what our priorities are,” Lombardo said.",
    "“Rob worked on [Rep.] Dan Meuser’s campaign … he had spoken with Dr. Oz a few months ago,” Alfano said.",
    "“I don’t think you could judge candidates and make decisions without actively engaging with them.",
    "“We don’t want to see the river as something that divides us, but something that makes us close.”",
    "“Part of being a senator is looking at how you provide infrastructure to the nation,” Oz said.",
    "“What if emergency vehicles need to get across, from our side or Pittston’s side?” she asked.",
    "That vacancy has led to a crowded field of candidates on the Republican and Democratic sides.",
    "“We had heard whispers Dr. Oz may be coming here, but I wasn’t sure,” Nelson said.",
    "“We joke about what side is better, but we’re all in the same boat,” he said.",
    "“When you mix politics and medicine, you get politics,” he said.",
    "To the right is Ellen Quinn, West Pittston council president.",
    "Subscribers enjoy a distraction-free reading experience.",
    "The bridge connects West Pittston with Pittston.",
    "Click here to subscribe today or Login.",
    "Tired of ads?"
  ]
}