{
  "id": 2653,
  "mediaId": 2562,
  "date": "2022-02-06",
  "headline": "Dr. Oz: Biden Got It Wrong on COVID, Giving ‘Too Much Pajama Time’",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/02/getfile.aspxguid092FB074-19FB-4EC2-8D97-E7C03E70FCD0.jpg",
  "link": "https://donaldjtrumppolls.com/dr-oz-biden-got-it-wrong-on-covid-giving-too-much-pajama-time/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"They got it wrong on inflation, because they didn't realize that taking out over $30 trillion in debt can signal to the world that your currency is not strong,\" Oz told Sunday's \"The Cats Roundtable\" on WABC 770 AM-N.Y. \"They got it wrong on paying people not to work and giving people too much pajama time, which has hurt the ability of business, especially small businesses, to adequately hire people, so we now we've got underserved supply chain issues\n\"They got it wrong, Washington has, on our schools, literally force-feeding teachers and kids about issues, values in particular, that parents need to be involved in.",
    "(Rob Kim/Getty Images for The Blue Jacket Fashion Show)\nBy Eric Mack | Sunday, 06 February 2022 10:48 AM\nThe COVID-19 pandemic has exposed Washington, D.C., Democrats, and President Joe Biden on every issue important to Pennsylvanians, according to GOP Senate primary candidate Dr. Mehmet Oz.",
    "They must destroy America because, if the world sees that a democracy can create a thriving economy like America, then what's the point of having a Communist Chinese government, a totalitarian-ruled state in order to have an economy?\"",
    "Oz is among a number of Trump-supporting GOP Senate primary candidates who are vying for the seat vacated by Trump-critic Sen. Pat Toomey, R-Pa., who voted to impeach the former president.",
    "Americans are growing wiser to the dangers of big government ruling our lives amid the pandemic lockdowns, travel restrictions, and mask and vaccine mandates.",
    "\"Anytime the government has enough power to do everything for you, it has enough power to take it all the way from you,\" Oz warned.",
    "Oz boasts name recognition and financial resources – \"I cannot be bought,\" he told Newsmax's \"Spicer & Co.\" this week.",
    "\"We've got a double-digit lead, and we've held onto that as more contestants entered the fray,\" Oz told Catsimatidis.",
    "We don’t want government involved in aspects of our lives where we can take better care of ourselves.\"",
    "We've got problems at the border\n\"They tell us it's about people who are coming are in trouble.",
    "Dr. Oz: Biden Got It Wrong on COVID, Giving 'Too Much Pajama Time' Dr. Mehmet Oz in 2020.",
    "Washington just has \"different values than we have,\" Oz added to host John Catsimatidis.",
    "\"We don't understand the absolute threat this country poses to us.",
    "No, it's about a cartel-run, human-trafficking operation.",
    "And those drugs, many times, come from China.\"",
    "\"Washington's got China wrong,\" he continued.",
    "\"We witnessed this throughout human history.",
    "And they're running drugs at the same time.",
    "Original Article"
  ]
}