{
  "id": 2756,
  "mediaId": 2573,
  "date": "2022-02-03",
  "headline": "Dr. Oz: COVID lockdowns study should anger Americans",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/Dr.-Oz-Pennsylvania-Senate-Race.jpg",
  "link": "https://www.foxnews.com/media/dr-oz-new-study-on-impact-of-covid-lockdowns-should-anger-you",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joshua Q. Nelson",
  "authorUrl": "https://www.foxnews.com/person/n/joshua-q-nelson",
  "termIds": [
    2778,
    2802,
    5407,
    1126,
    739,
    677,
    489,
    6678
  ],
  "sentences": [
    "The researchers – Johns Hopkins University economics professor Steve Hanke, Lund University economics professor Lars Jonung, and special advisor at Copenhagen's Center for Political Studies Jonas Herby – analyzed the effects of lockdown measures such as school shutdowns, business closures, and mask mandates on COVID-19 deaths.",
    "LOCKDOWNS ONLY REDUCED COVID-19 DEATH RATE BY .2%, STUDY FINDS: 'LOCKDOWNS SHOULD BE REJECTED OUT OF HAND'\nLockdowns during the early stage of the coronavirus wave in the spring of 2020 only reduced COVID-19 mortality by .2% in the U.S. and Europe, according to a Johns Hopkins University meta-analysis of several studies.",
    "\"And just to take you back in time, two years ago, when you and I were doing \"Fox & Friends\" almost every single morning, we were talking about the fact that some of these rules temporarily might be OK, but unlikely that long term that these lockdowns would work.\"",
    "\"They showed that school closures, business closures, domestic travel restrictions, limiting gathering – all these crazy things that we were sort of looking around and seeing if there was a camera watching us because they made no sense.\"",
    "\"While this meta-analysis concludes that lockdowns have had little to no public health effects, they have imposed enormous economic and social costs where they have been adopted,\" the researchers wrote.",
    "He will bring his name recognition and wealth to a wide-open race that is expected to be among the nation’s most competitive and could determine control of the Senate in next year’s election.",
    "\"We find little to no evidence that mandated lockdowns in Europe and the United States had a noticeable effect on COVID-19 mortality rates,\" the researchers wrote.",
    "\"In consequence, lockdown policies are ill-founded and should be rejected as a pandemic policy instrument.\"",
    "In November, Dr. Oz, 61, announced he is running for Pennsylvania’s open U.S. Senate seat as a Republican.",
    "Dr. Mehmet Oz said a new study showing the ineffectiveness of COVID-19 lockdowns should anger Americans.",
    "\"There are a lot of people … Just to be clear, one size fits all mandates do not work.",
    "Oz said that Johns Hopkins researchers reviewed 24 real-world studies.",
    "I'm angry as a physician,\" Oz told \"The Brian Kilmeade Show\" Thursday.",
    "Oz said lockdowns during past pandemics had never been successful.",
    "These are real people with real illnesses,\" he stressed.",
    "Fox News' Paul Best contributed to this report.",
    "It wouldn't work today,\" he argued.",
    "\"These are not esoteric models.",
    "\"Well, you should be angry.",
    "\"It didn't work in 1918.",
    "They failed. \""
  ]
}