{
  "id": 3376,
  "mediaId": 8489,
  "date": "2022-02-01",
  "headline": "Millions pouring into Pa. governor and U.S. Senate races, with Fetterman and Oz ahead",
  "image": "https://whyy.org/wp-content/uploads/2022/01/AP21350625123203.jpg",
  "link": "https://whyy.org/articles/millions-pouring-into-pa-governor-and-u-s-senate-races-with-fetterman-and-oz-ahead/",
  "mediaOutlet": "whyy.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Meyer",
  "authorUrl": "https://whyy.org/person/katie-meyer/",
  "termIds": [
    0
  ],
  "sentences": [
    "Two large groups, Pennsylvania Patriots PAC and Honor Pennsylvania Inc., have been running ads across the commonwealth that are good for McCormick: accusing Oz of previously supporting the Affordable Care Act and of being a “Hollywood liberal.”\nHonor Pennsylvania’s latest disclosure reveals several high-profile donors from the world of high finance, like hedge fund CEO Kenneth Griffin, who gave $5 million.",
    "Jeff Bartos, the Montgomery County real estate developer who has sought to carve out a niche as a Pennsylvania insider among opponents with more tenuous ties to the state, has brought in more than $3.3 million since the start of the campaign, and spent nearly $829,000 — mostly opting out of the ad war into which McCormick and Oz have already sunk millions of dollars.",
    "By Dec. 31, the end of the most recent quarter, the likely top contenders for governor had already raised well over $20 million collectively, while in the Senate race, the reported fundraising had topped $25 million — and that’s without counting outside spending by political action committees.",
    "These Pa. 2022 candidates could change the balance of power in the U.S. Senate\nCook Political Report, which is tracking Senate races around the country, says the outcome in Pennsylvania is genuinely unpredictable — but critically important.",
    "Rich guy vs. rich guy\nIn his first filings of the race, longtime TV doctor Mehmet Oz, who recently was a resident of New Jersey, reported that he was responsible for much of the money in his own campaign account.",
    "Pennsylvania is one of the likeliest tipping points for control of the U.S. Senate, and the governorship could be the difference between continued split power in state government, or near-total GOP domination.",
    "New campaign finance reports for Pennsylvania’s governor and U.S. Senate races are now public and the commonwealth appears to be on its way to its most expensive statewide elections ever.",
    "He loaned himself $5.2 million in the early days of the campaign, easily outstripping nearly every other candidate on either side of the aisle who has so far filed financial reports.",
    "But, like Oz, the independently wealthy McCormick, who grew up in the state but only recently returned as a resident, is expected to be able to prodigiously self-fund his Senate bid.",
    "To date, the most that has ever been spent on a Pennsylvania gubernatorial race was $82 million in 2014, and the most spent on a U.S. Senate race was $164 million in 2016.",
    "Because McCormick announced his campaign after the last financial reporting cutoff, he won’t have to disclose any fundraising or spending numbers until mid-April.",
    "Though Bartos doesn’t have the personal wealth of his two most formidable opponents, he has so far loaned more than $1.2 million to his campaign.",
    "Some signs of his likely political connections are also leaking out in PAC disclosures.",
    "With ten months to go before the election, candidates are already dumping in cash.",
    "Former Bridgewater CEO Dave McCormick’s campaign is a little more of a black box.",
    "But this year, the stakes are especially high.",
    "Plus, there’s no incumbent in either race.",
    "Progressive, centrist, Trumper?",
    "7 months ago"
  ]
}