{
  "id": 4170,
  "mediaId": 8393,
  "date": "2022-01-19",
  "headline": "Dr. Oz makes campaign stop in Old Forge",
  "image": "https://www.pahomepage.com/wp-content/uploads/sites/91/2022/01/11922-Caroline-Dr.-Oz-Old-Forge-visit-pkg-2.jpg?w=1280",
  "link": "https://www.pahomepage.com/top-stories/dr-oz-makes-campaign-stop-in-old-forge/",
  "mediaOutlet": "pahomepage.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Foreback",
  "authorUrl": "https://www.pahomepage.com/author/caroline-foreback/",
  "termIds": [
    0
  ],
  "sentences": [
    "She said in part: “We’ve seen what happens when TV personalities gain power in Washington and Dr. Oz is the last thing we need when our commonwealth faces real challenges.”\nIt’s so early on but this is already looking like it could be a very interesting race.",
    "“Pennsylvania is the bellwether for the entire country so It’s not about me, it’s not about the Senate race, it’s about the entire country watching Pennsylvania, realizing that the path we chart forward is the path the country should be moving forward on.",
    "I know the ideas that I’m offering for Pennsylvania about why Washington got it wrong and how we fix it will work here in all the parts of the state but also outside in other parts of the country as well,” Dr. Oz said.",
    "He said he’s fighting for stronger borders, mental health care, the Second Amendment, voter ID’s and signature verification, and school choice in PA. Dr. Oz also answered questions from people in the audience.",
    "“He has similar beliefs as I do, we agree on mostly all the topics and his outlook is pretty much the same as mine so it’s a direction I’d like to see the state go in,” Anthony from Mountain Top said.",
    "OLD FORGE, LACKAWANNA COUNTY (WBRE/WYOU) — The race for the state Senate is already heating up and Wednesday night the spotlight was on Old Forge.",
    "I think he could do a very good job, so we’ll have to see what happens in the primaries,” Lackawanna County Commissioner Chris Chermak said.",
    "I’ve done lots of work within the state of Pennsylvania in addition to vacationing here, so for me it’s not a foreign issue,” Dr. Oz said.",
    "The surgeon and TV personality is now a Republican contender in the race for Pennsylvania’s open seat in the U.S. Senate.",
    "Dr. Mehmet Oz made a campaign stop at Arcaro & Genelle Restaurant and he spoke exclusively with Eyewitness News.",
    "Dr. Oz brought up concerns with big spending in Washington, U.S. relations with China, and big tech censorship.",
    "Senator Pat Toomey’s vacant seat, but voters want to know why he’s running in Pennsylvania, so we asked him.",
    "He criticized how Washington handled the pandemic, specifically the shutdowns and limited treatment options.",
    "Democrat candidate Val Arkoosh is also a physician and made a public statement against Dr. Oz.",
    "The celebrity doctor from New Jersey could be a big contender to fill retired Republican U.S.",
    "Dr. Oz shed light on his ties to Pennsylvania, where he says he recently bought property.",
    "I chose Pennsylvania because the lens I look out on life with was honed in Pennsylvania.",
    "Dr. Oz talked about conservative values while promoting individualism and empowerment.",
    "He told the crowd “we don’t want the government micromanaging decisions in our lives”.",
    "But the long-time New Jersey resident will have to prove himself to skeptical voters.",
    "“People generally care much more about what you stand for than where you came from.",
    "Dr. Oz greeted a packed house at Arcaro & Genelle in Old Forge Wednesday night.",
    "I always have, I talk about it endlessly, I do free clinics across the state.",
    "When I look at the world, I have Pennsylvania values when I do that.",
    "Dr. Oz is not the only doctor in this race.",
    "“He had a lot of good things to say.",
    "I chose to be in Pennsylvania.",
    "I love this state."
  ]
}