{
  "id": 4255,
  "mediaId": 2732,
  "date": "2022-01-21",
  "headline": "Ryan Shafik: Time to end corrupt endorsement process",
  "image": "",
  "link": "https://triblive.com/opinion/ryan-shafik-time-to-end-corrupt-endorsement-process/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Shafik",
  "authorUrl": "",
  "termIds": [
    2604,
    3944,
    4735,
    1126,
    6506,
    6512,
    6016,
    6107
  ],
  "sentences": [
    "Known simply in Keystone State political parlance as “the endorsement,” it’s a protracted process of wannabe candidates cloyingly ingratiating themselves to the few hundred apparatchiks comprising the Republican State Committee (RSC), in a frenzied effort to earn these party officials’ “vital support.”\nFor decades, eager candidates have been brainwashed into believing that winning the GOP nomination in Pennsylvania, especially for the U.S. Senate or governor’s mansion, requires the endorsement of the GOP politburo … er, State Committee.",
    "This happened most recently in 2021, when the five southeast bosses colluded to give their delegations’ votes to appellate court candidate Drew Crompton, who was not faring well in the early RSC straw polls throughout Trump country (most of Pennsylvania outside the Philly suburbs) — that is, until the five southeast bosses decided to throw their weight behind him.",
    "The good news is the rise of self-funding candidates like Dr. Mehmet Oz, Carla Sands and David McCormick could once again show how useless the endorsement process is — just like Tom Smith demonstrated when he easily dispatched the establishment’s golden-boy endorsed candidate, Steve Welch, in the 2012 U.S. Senate Primary.",
    "But one gains an appreciation of the inherently corrupt nature of the endorsement by the fact that many RSC members are paid lobbyists, work for politicians, hold government jobs and are pawns of county GOP leaders — to whom many are indebted for their election to the RSC in the first place.",
    "Over the years I have seen scores of candidates bend over backwards with the sole focus of their efforts aimed at trying to gain the RSC endorsement, while ignoring the only real factors that validate the viability of a statewide candidacy: money, message, manpower and more money.",
    "Therefore, when the endorsement charade comes to town, you often see those five southeast Republican chairs cutting a backroom deal to throw their endorsement votes in a bloc to one candidate or another — while the public is in the dark of what transpired behind closed doors.",
    "Candidates with money, especially Oz, McCormick and Sands, shouldn’t waste one second or one red cent on this worthless process that does nothing to increase their chances of winning, but instead only perpetuates the corrupt political swamp they claim to be running against.",
    "With a process like this that reeks of backroom dealing, cronyism and corruption, do you think the modern GOP — with a renewed zeal of populism and rebranded with the slogan “drain the Swamp” — would finally shed this shady process?",
    "In addition, the endorsement comes with scant structural support from the committee members, which is often over-sold and instead, provides the false illusion for many endorsed candidates that they don’t need to do anything else.",
    "In reality, these partisan stalwarts are simply enamored by the title of “committeeman” or “committeewoman” and absolutely love getting their ego stroked every year by candidates begging for their precious endorsement vote.",
    "I hope more candidates with resources continue to ignore this sham process and instead focus their campaign effort where the nomination will be decided — by the actual voters who comprise the party they seek to represent.",
    "This is especially true in the five southeast counties (Bucks, Montgomery, Chester, Delaware and Philadelphia), where virtually all RSC members are beholden to a county party boss for their seat on the RSC.",
    "Those who dare to run un-endorsed in a free, open primary and seek the support of rank-and-file Republican voters are deemed treasonous in the eyes of the party elite.",
    "Most voters think party officials actually do party-building work, such as registering voters, distributing information about the party’s platform and raising money.",
    "Ryan Shafik is the principal of Rockwood Strategies, a Pennsylvania conservative-free-market affiliated political consulting, communications and research firm.",
    "Simply put, the modern RSC resembles a gossiping knitting club on a good day more than the grassroots GOTV electoral juggernaut it claims to be.",
    "It’s rooted in the false notion these party elites must give a candidate “their approval” in order for him or her to run in a primary election.",
    "Furthermore, if a candidate ends up receiving the endorsement of RSC, it doesn’t come with serious money and guaranteed victory in the primary.",
    "However, many voters have no clue who RSC members are or what their function is, or even that there is an endorsement process.",
    "Every year in Pennsylvania Republican politics, there is a dog-and-pony show that occurs mostly unseen by the average voter.",
    "Pennsylvania is one of a few states that still feature this antiquated vestige of Tammany Hall politics.",
    "But in fact, an overwhelming majority of RSC members don’t do any of these vital tasks.",
    "Crompton ended up being the lone statewide Republican candidate to lose in 2021.",
    "It’s time to finally abolish the outdated, corrupt GOP endorsement process.",
    "The party doesn’t do it for you, despite promises of financial grandeur.",
    "RSC members are elected by county in primary elections.",
    "You, the candidate, have to raise the money.",
    "Categories: Featured Commentary | Opinion"
  ]
}