{
  "id": 4292,
  "mediaId": 2663,
  "date": "2022-01-19",
  "headline": "Oh god, another ex-Trump official is rumored to be eyeing a career in reality TV",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/01/GettyImages-694285530.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/oh-god-another-ex-trump-official-rumored-eyeing-career-reality-tv-20220119",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Graham Gremore",
  "authorUrl": "https://www.queerty.com/author/graham-gremore",
  "termIds": [
    0
  ],
  "sentences": [
    "#CBBUS3 #BBCeleb\nAlexa Penavega\nCurtis Stone\nErin Brady\nHope Hicks\nJillian Michaels\nJerry Trainor\nLamar Odom\nNeNe Leakes\nNe-Yo\nTodrick Hall\nTiffany Pollard\nSha'carri Richardson\nShangela\nTyler Cameron pic.twitter.com/bJKiky2f2o\n— CBB Insider #CBBUS3 #BBCeleb (@InsiderCbb) January 19, 2022\nCelebrity Big Brother generally doesn’t announce the season’s lineup until just days before it premieres.",
    "Related: Sean Spicer blames low score on ‘Dancing With The Stars’ debut on anti-Christian sentiment\nStill, given the number of former Trump administration officials who have gone on to appear on reality shows or write trashy tell-alls, we wouldn’t be surprised if Hicks followed suit.",
    "As if there wasn’t already enough trash on television, rumor has it former Trump advisor/White House Communications Director Hope Hicks is borrowing a page out of failed gubernatorial candidate Caitlyn Jenner’s playbook and joining the cast of Celebrity Big Brother.",
    "Related: Caitlyn Jenner accuses Ellen of making everyone think she’s an a**hole\nThough it hasn’t been officially confirmed, rumors have been flying on Twitter all morning after an alleged cast list leaked.",
    "Related: 6 reality TV stars who were caught being homophobic\nGiven what we know about Hicks, it seems highly unlikely that she would participate in a reality show.",
    "— Atlas Smugged (@arrpeebee) January 19, 2022\nHope Hicks' name is trending on this nutty site because someone made up a rumor about her going on a reality show.",
    "The only building isolated from the rest of the world and constantly monitored by cameras she should be in is a prison, not some goddamn TV show.",
    "— Eric A (@culdesacfan) January 19, 2022\nSaw Hope Hicks trending and thought for sure it was because she’s going to be on Dancing With The Stars.",
    "(@StompTheGOP) January 19, 2022\nWow… Hope Hicks gets reality TV gig…and I thought Melania made her disappear by turning Hope into an NFT.",
    "It named Hicks, along with several other queer celebrities, including Jillian Michaels, Todrick Hall, Sha’carri Richardson, and Shangela.",
    "— Shari Lynn (@LynnSharig8) January 19, 2022\nHope Hicks is on Big Brother, a show about a house full of idiots saying stupid things.",
    "McCormick is currently competing against TV doctor Mehmet Oz for the Republican nomination to U.S. Senate in Pennsylvania.",
    "She tends to keep a low profile, preferring to work behind the scenes and rarely stepping out in front of the camera.",
    "— Brian Stelter (@brianstelter) January 19, 2022\nHope Hicks always sounded like a GOP voter outreach program to me.",
    "The new season debuts on February 2, which means the official cast list can be expected around January 30 or 31.",
    "— Brian O'Sullivan (@osullivanauthor) January 19, 2022\nAmazed to see how many people on here loathe Hope Hicks.",
    "— Matthew Rettenmund (@mattrett) January 19, 2022\nHope Hicks is taking her pant-steaming act to Big Brother?",
    "Here’s what people on Twitter are saying about the whole thing…\nI woke up to see Hope Hicks trending.",
    "(@KevinRay62) January 19, 2022\nGraham Gremore is the Features Editor and a Staff Writer at Queerty.",
    "I was mistaken – it’s apparently because she’s going to be on Celebrity Big Brother instead.",
    "(@catfishyak) January 19, 2022\nFirst is was Sean Spicer on Dancing With The Stars.",
    "Also, she just joined hedge fund exec David McCormick’s campaign as an advisor.",
    "EXCLUSIVE: Meet all 14 celebrities entering the Celebrity Big Brother house.",
    "She's not, she never would, but I'm sure the truth won't stop the \"trend.\"",
    "The death knell of democracy will be judged by its damn Nielsen ratings.",
    "Is she on dancing with the stars or something?",
    "It's basically the Trump White House 2.0.",
    "Follow him on Twitter @grahamgremore.",
    "Now it's Hope Hicks on Big Brother.",
    "She should feel right at home.",
    "— Y'all hurry up???????????",
    "Stop normalizing traitors.",
    "I thought it was just me.",
    "Scary Larry ?",
    "— Kevin Ray?",
    "??????",
    "— ?",
    "?"
  ]
}