{
  "id": 4593,
  "mediaId": 2636,
  "date": "2022-01-13",
  "headline": "Trump’s Pride Goeth Before Our Fall",
  "image": "https://static01.nyt.com/images/2022/01/13/opinion/13Bruni-image/13Bruni-image-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/01/13/opinion/donald-trump-npr-interview.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5918,
    3625,
    3639,
    4905,
    5507,
    5546,
    2159,
    2765,
    1126,
    1489
  ],
  "sentences": [
    "East by beating the Miami Dolphins (8-8), who were eliminated from postseason contention last week, while the Buffalo Bills (10-6) can clinch the division by defeating the Jets, who were eliminated in 1972.” (Mark Cameron, Suquamish, Wash.) And here’s a bonus from Mike, on the quarterback for the Pittsburgh Steelers, who ended up making it into the playoffs: “Ben Roethlisberger, who is expected to retire at season’s end, now throws and runs like a great-uncle playing a pickup game at a backyard cookout after three I.P.A.s and two helpings of potato salad.” (Conrad Macina, Landing, N.J., and Christopher Bailey, Richmond, Va.)\nReflecting on New York City’s new mayor, Ginia Bellafante observed: “Saturday marks the end of Eric Adams’s first week as the mayor of New York, a time he has used to successfully distinguish himself from his predecessor — taking the J train; holding meetings at 9 a.m., an hour that found Bill de Blasio still in sweatpants; riding a Citi Bike in a suit, horse-bit loafers and a rose-colored helmet coordinated to the hue of his tie.",
    "And here he is on one of the less hallowed movies directed by Peter Bogdanovich, who died last week: “Before Michael Cimino’s ‘Heaven’s Gate,’ before Elaine May’s ‘Ishtar,’ there was the scandal of ‘At Long Last Love,’ which the critics of the time heaven’s-gated, leaving Bogdanovich ishtarred and feathered.” (Allan Tarlow, West Hollywood, Calif.)\nExamining the aftermath of the Jan. 6 riot in The Washington Post, Kate Woodsome wrote: “As the psychotherapist Resmaa Menakem teaches, over time, a person’s trauma can look like personality.",
    "Whatever might come, this would not be a tenure of earth tones and lethargy and saturnine expressions.” (Debbie Deitcher, Manhattan)\nTaking the measure of Mehmet Oz, Annaliese Griffin wrote: “He’s rightly understood as a kind of quasi-religious leader, one who has set up his revival tent between a yoga studio and an urgent-care clinic, with the television cameras rolling.” (Scott Williams, Salt Lake City)\nFinally, here’s Charles Blow on his dinner with Sidney Poitier: “His enchantment settled on you, like a soft sweater.",
    "Reviewing Carl Bernstein’s new memoir, “Chasing History,” about his beginnings as a reporter, the Times book critic Dwight Garner wrote: “At 77, he is entering his anecdotage.” (Nancy Mansbach, Waban, Mass., and Gordon Brown, Boulder, Colo.) Garner also described Bernstein’s youthful enthusiasm this way: “If he’d been a dog, his head would have always been outside the car window.” (Helaine Fendelman, Manhattan)\nWeighing in on the final weekend of regular-season N.F.L.",
    "Or maybe you’re tying your shoes with broken fingers.” (Tricia Chatary, Middlebury, Vt. )\nAnd Rex Huppke was having none of it when he fired off this column for The Chicago Tribune, which observed: “A portion of the populace has slid from ‘it’s good to be smart’ to ‘being smart is elitist, so I’m going to follow the medical advice of this podcaster,’ a painfully common epitaph throughout the pandemic.” He added that Jan. 6 “will live in idiocy.",
    "You can just picture him sitting there in the White House, surrounded by McDonald’s wrappers, thrilled at the TV scenes of MAGA hooligans attacking the police.”\nHis insistence on an inverted version of history — one that doesn’t merely flatter him but that turns him into a noble martyr — is one of the driving forces behind many Republicans’ anti-democratic maneuvers and their indulgence or outright promotion of conspiratorial thinking.",
    "“To Paradise,” by Hanya Yanagihara, has attracted extensive analysis, none more deft than a review in The Atlantic by Jordan Kisner: “Reading the novel delivers the thrilling, uncanny feeling of standing before an infinity mirror, numberless selves and rooms turning uncertainly before you, just out of reach.” (Thanks to Barbara Rothschild of Columbia, Mo., for nominating this.)",
    "When a man of those advantages oversees the hollowing out of the State Department, allows the president to fire inspectors general who displease him by their inspection, uses his position to cultivate donors for his party, and consistently bends the norms and destroys the traditions that have lifted him to power, what hope can there be for his country?",
    "It pointedly and perfectly captures a truism that we sometimes speed too quickly past and that has special relevance to events in American politics, and to the Republican Party in particular, over these past few years: People will sell out anyone and anything, including themselves, if it gets them to, or keeps them at, the top of the heap.",
    "Hardly a day goes by when Regan, in a patch of forest safely distant from streets and cars, doesn’t give futile chase to a posse of white-tailed deer, either sprinting toward them at a velocity that stuns me or hopping, like a kangaroo, so she doesn’t lose sight of her quarry in the tall grass.",
    "Oodles of acquaintances brought my attention to a recent article in The Atlantic, “How Ivy League Elites Turned Against Democracy,” by Stephen Marche, because of this withering claim within it: “What the Ivy League produces, in spades, on both the left and the right, is unwarranted confidence.",
    "How and why, Marche wonders, do the likes of Senator Josh Hawley, a Missouri Republican who went to Stanford as an undergraduate and got his law degree at Yale, and Senator Ted Cruz, whose three years at Harvard Law were preceded by four at Princeton, incite anti-elite fury?",
    "Its institutions are hubris factories.” My acquaintances wanted my thoughts because I once wrote a book questioning the magical power that so many students and their parents attribute to such schools and because I now teach at an Ivy-esque institution, Duke.",
    "Marche describes the contradiction especially well in writing about the second of President Trump’s two secretaries of state: “Mike Pompeo graduated first in his class from West Point and served as editor of the Harvard Law Review.",
    "And Marche provides it: Right now their surest path to power, or firmest grip on it, involves the theatrical trashing of their own trappings, the reinvention of themselves as characters in a story other than their own.",
    "In Manhattan I had more history, a memory on every street corner, and I had those early evenings when, without even planning it, I found myself walking along the Hudson exactly as the sun set over the Palisades.",
    "Dogs are Rorschachs, and someone less sentimental about them than I am might consider the positions of Regan (right) and Marlin (left, who belongs to my sister and is recovering from toe surgery) accidental.",
    "To nominate favorite bits of recent writing from The Times or other publications to be mentioned in “For the Love of Sentences,” please email me here, and please include your name and place of residence.",
    "They carried me to Chapel Hill, where I smile almost every time I turn into my driveway because, for someone who’d become so firmly rooted in the concrete jungle, suburbia is the adventure.",
    "Or we can wonder how urgently all those forces would matter — whether they would have moved us this fast toward this brink — without the impossibly fragile ego of one insatiably needy man.",
    "I think about Trump’s narcissism every time we get a closer glimpse into what he was doing and how he was feeling during the Jan. 6 riot, when those ghastly images filled our screens.",
    "On a Personal Note\nIt has been exactly six months since I left New York for North Carolina, and not one of them has gone by without several New Yorkers asking me how much I miss it.",
    "And while, yes, this big liar is the product of dynamics in the electorate that he didn’t create, he turbocharges the ugliness with a relentlessness and perverse skill all his own.",
    "All these months later, Trump was still fixated on the inferior size of the crowds that turned out for Biden in 2020, still prattling on about it, still insistent: I’m bigger!",
    "I thought about Trump’s delicate psyche and our delicate state when my Monday and Tuesday news feeds filled with his attack on Senator Mike Rounds, a South Dakota Republican.",
    "We can survey all the Republican efforts to subvert the will of voters, size up the hatred that so many Americans feel for one another and see the makings of a civil war.",
    "There has long been a (verbally sexist) “Great Man” theory of history, but with Trump we have a subset of that, or an annex to it: the great psychosis theory of history.",
    "In this view, Marlin happened to place his cone, which he’s wearing so that he doesn’t lick and aggravate his wound, atop Regan’s paws; she was too zonked out to care.",
    "As my colleague Maureen Dowd wrote last weekend, “Rather than admit that he lost re-election, Trump was willing to egg on a seditious cult to overturn the election.",
    "And how and why do Hawley, Cruz and other lawmakers who make their careers in government fan the flames that would burn down the very institutions they inhabit?",
    "That was before he hung up on Inskeep, who had the temerity not to surrender readily to Trump’s delusion that the election was stolen.",
    "My thoughts are that Marche’s assessment applies accurately to some students at elite colleges but by no means to most of them.",
    "The difference is that wit is multifaceted, like a gem that, however small, offers different glimmers at different angles.",
    "Their makeovers are fundamentally commercial: They sized up the current marketplace and manufactured what sells best.",
    "Cleverness exhausts itself in a single glint and then repeats itself to infinity.” (Zino Vogiatzis, Timonium, Md.)",
    "I could sense within me a growing impatience, a gnawing unsettledness, a twitchy finger wanting to turn the page.",
    "And the long list of reasons to ignore that feeling couldn’t compete with the emotional logic of paying it heed.",
    "I thought about that on Wednesday morning as I listened to Donald Trump’s interview with Steve Inskeep on NPR.",
    "A garage door that opens automatically and a mailbox with a little red flag on its side are what’s exotic.",
    "games, Mike Tanier explained: “The New England Patriots (10-6) can improve their chances to win the A.F.C.",
    "A few of the neighborhood deer seem to have figured out what I already knew: Regan’s all bound, no bite.",
    "Mere inches from me on a conveniently king-size bed, these dog cousins (of a sort) comfort each other.",
    "In this life you can make lists of pros and cons and prudently yield to the arithmetic of it all.",
    "But his article — an excellent one, worth your time — has stuck with me for a different reason.",
    "It was the charge of the not-bright brigade.” (Helen Mooty, Seabrook, Texas)\nNow to The Times.",
    "But there’s a simple solution to the seemingly complicated riddle of Hawley, Cruz and Pompeo.",
    "Here’s his appraisal of “Don’t Look Up,” which he calls “a clever film that’s short on wit.",
    "Cashmere, of course.” (Tom Wild, Killington, Vt., and Vipan Chandra, Attleboro, Mass.)",
    "There’s comfort and safety in staying put, but it can also leave you cramped, cinched.",
    "“I will never endorse this jerk again.” Such elevated language, and the prompt for it?",
    "Or you can respond to the weather inside you, and just as wisely ride those currents.",
    "Regan wanted to provide it, even if that meant coarse plastic against her soft fur.",
    "One man’s pathological insecurity is — or can be — an entire country’s fate.",
    "If you’re fortunate enough to be able to stray, why not head into the woods?",
    "If he cannot manage to keep faith with the system, who can?”\nOuch and amen.",
    "Does a great nation’s future hinge on a rejected president’s pride?",
    "He must always reassure himself that he’s the king of the jungle.",
    "Rounds had merely acknowledged that Biden won the 2020 election.",
    "“Is he crazy or just stupid?” Trump said in a written statement.",
    "They haven’t had some post-Ivy moral or philosophical epiphany.",
    "On those occasions when she catches up to them, she freezes.",
    "We can rant about the Senate and rail against Fox News.",
    "By leaving Manhattan, I was doing something similar.",
    "In The New Yorker, Richard Brody has been on a tear.",
    "He must forever fluff his mane and amplify his roar.",
    "In pursuing them, she’s just stretching her legs.",
    "It’s an assumptive question: how much, not if.",
    "The ranting is warranted and the railing just.",
    "What churned our stomachs salved his vanity.",
    "Oddly, no, and I somehow knew I wouldn’t.",
    "There’s no Big Lie without the Big Liar.",
    "That has been the case elsewhere before.",
    "So they sometimes don’t bother to flee.",
    "In Manhattan I had more restaurants.",
    "I choose a different interpretation.",
    "Maybe this is simply how you are.",
    "Don’t I pine just a bit for that?",
    "In Manhattan I had more friends.",
    "Scanning everywhere for threats.",
    "It’s a big overgeneralization.",
    "Growing angry with the banal.",
    "I just look on — and beam.",
    "Marlin craved connection.",
    "Is it the case here now?",
    "That's my theater.",
    "But I get it.",
    "I’m better!",
    "Insomnia.",
    "Drinking."
  ]
}