{
  "id": 4601,
  "mediaId": 2590,
  "date": "2022-01-13",
  "headline": "Hedge Fund Exec David McCormick Latest To Enter Pennsylvania Senate Race",
  "image": "https://img.huffingtonpost.com/asset/61dfb62720000092838d6fc9.jpeg?cache=rv0PVaxbMb&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/david-mccormick-pennsylvania-senate-race_n_61dfb16de4b0ae44b31b80e2",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    2765,
    5862,
    4905,
    4540,
    1126,
    1023,
    476,
    1489,
    6506,
    6520
  ],
  "sentences": [
    "Other Republicans in the race include conservative commentator Kathy Barnette, Trump’s former ambassador to Denmark Carla Sands and real estate developer Jeff Bartos, who are each trying to carve out a lane in the race, from decrying “woke” culture to Democrats’ response to the pandemic.",
    "McCormick, who filed paperwork with the Federal Election Commission yesterday, stepped down from his role as chief executive at the Connecticut investment firm Bridgewater Associates this month in anticipation of joining the race.",
    "A political action committee supporting another Republican in the race, TV host Mehmet Oz, launched an ad attacking McCormick’s ties to China, where Bridgewater Associates manages $5 billon of its $150 billion portfolio.",
    "Associated Press\nHedge fund executive David McCormick is the latest Republican to jump into Pennsylvania’s U.S. Senate primary, another candidate competing for oxygen in one of the nation’s hottest midterm races.",
    "A veteran who served as a senior Treasury Department official under President George W. Bush, McCormick isn’t well known outside the finance world, but he has strong connections to former President Donald Trump.",
    "Advertisement\nA front-runner has struggled to break out in the field after Trump’s early pick, Sean Parnell, dropped out amid a child custody battle and abuse allegations by his estranged wife, which he denied.",
    "Advertisement\nIn a state Biden won by roughly 1%, Democrats and Republicans are competing for a seat that could determine control of the evenly split Senate, with crowded primaries on both sides.",
    "His allies have compared him ideologically to Glenn Youngkin, the private equity executive who won Virginia’s governor’s race last year with a coalition of moderates and Donald Trump supporters.",
    "McCormick joins other wealthy self-funding candidates who have recently lived elsewhere but reestablished residency in the state in order to run for retiring Republican Pat Toomey’s seat.",
    "The Pennsylvania Democratic Party asked federal election officials to look into $2 million in TV ads he placed in the state before declaring his candidacy.",
    "Advertisement\n“From working on my family’s Christmas tree farm to serving our country in the Persian Gulf War, I have never run from a fight.",
    "While McCormick didn’t officially announce his candidacy until Thursday, his rivals have been treating him like an opponent for weeks.",
    "His wife, Dina Powell, was Trump’s deputy national security adviser, and McCormick was considered for a Pentagon job under Trump.",
    "My next mission: take back our country and bring America First, conservative leadership to the U.S. Senate,” he wrote.",
    "McCormick has tapped top Trump aides Hope Hicks and Stephen Miller to advise his campaign, Politico reported.",
    "The 56-year-old investment CEO grew up near Wilkes-Barre and recently bought a home in the Pittsburgh area.",
    "Pennsylvania’s 2022 Senate race is expected to be one of the most competitive in the nation.",
    "David McCormick, here with Donald Trump in 2016, is running for Senate in Pennsylvania.",
    "He confirmed his entry in the race on Twitter Thursday."
  ]
}