{
  "id": 4721,
  "mediaId": 8356,
  "date": "2022-04-21",
  "headline": "PA Senate race: Ex hedge fund CEO David McCormick tries to fend off Oz's Trump endorsement",
  "image": "https://www.gannett-cdn.com/presto/2022/03/23/NBCT/2ca8c930-4652-4870-b9ca-d60149565535-David_McCormick_Department_of_Defense_photo.jpg?crop=719,405,x0,y180&width=719&height=405&format=pjpg&auto=webp",
  "link": "https://www.ydr.com/story/news/2022/04/21/david-mccormick-pa-senate-candidate-making-strides-in-gop-primary/65348988007/",
  "mediaOutlet": "ldnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4958,
    5862,
    2765,
    2469,
    1126,
    1489,
    1032,
    6506
  ],
  "sentences": [
    "In January, Politico reported that McCormick, who had yet to formally enter the race, had “built a campaign-in-waiting with a who’s who of Trump-world operatives, and distanced himself from his former company’s China ties, while his allies have reached out to Trump-friendly media.”\nThose efforts and his wife’s connections weren’t enough, though, to win over Trump, who endorsed Oz, saying in a statement that Oz was “Pro-life, very strong on crime, the border, election fraud, our great military, and our vets, tax cuts, and will always fight for and support our under-siege Second Amendment.”\nTrump also said that Oz will “do very well” in Philadelphia and Pittsburgh, “where other candidates will just not be accepted.”\nMcCormick has responded with endorsements from Christian leader Ralph Reed, former U.S. Sen. Rick Santorum and former U.S. Secretary of State Mike Pompeo, who served under Trump.",
    "From Bloomsburg to Washington\nMcCormick, 56, was born in Washington County and attended high school in Bloomsburg, where his father, James, was president of Bloomsburg University and also chancellor of the Pennsylvania State System of Higher Education\nAfter graduating from the U.S. Military Academy in 1987, McCormick served in the 82nd Airborne Division during the Persian Gulf War.",
    "Financial filings reported on by the Associated Press show that McCormick’s Pittsburgh home is valued at between $1 million to $5 million, and he also owns homes in Dallas and New York City —– worth a combined $10 million to $50 million —– as well as a ranch in Colorado and his family’s farm near Bloomsburg.",
    "According to RealClearPolitics.com, McCormick has an average lead of 4.2% in polls of the race since late February, although Dr. Mehmet Oz, who received the GOP-coveted endorsement of former President Donald Trump, held a 3-percentage point lead over McCormick in a recent Trafalgar Group poll.",
    "More:Dr. Oz focuses on pandemic during campaign stop in York, Pa.\nMcCormick's top issues\nUnder the issues section on his campaign website, McCormick lists the economy, “standing up to China,” domestic energy independence, border security, and ending COVID-19 mandates, among others.",
    "As McCormick echoes Trump’s “America First” mantra and calls China an “existential threat,” there have been reports that during his hedge fund days McCormick was more bullish on China, calling it the most important “bilateral relationship” for the United States.",
    "Former hedge fund CEO David McCormick had little statewide name recognition when he was recruited by Republican insiders to run for U.S. Senate, but with just a few weeks to go until the May 17 primary it seems he has a good shot at capturing the nomination.",
    "A relatively unknown in Pennsylvania six months ago, state GOP operatives began recruiting McCormick to run once then-favorite Sean Parnell dropped out after losing a Butler County custody fight with his ex-wife in which she made allegations of abuse.",
    "Both McCormick and Oz have been criticized by primary opponents for living outside of Pennsylvania for decades, then deciding to move back to run for the seat being vacated by retiring Republican Sen. Pat Toomey of Lehigh County.",
    "The Associated Press also reported that McCormick made $22 million with the hedge fund last year, owns $50 million of stock in the company and reported assets totaling between $116 million and $289 million.",
    "Democrats are hoping a victory in Pennsylvania will help them gain a clear majority in the current 50-50 split Senate, where ties are broken by Democratic Vice President Kamala Harris.",
    "He declined an offer to be U.S. deputy secretary of defense in the Trump administration, but his wife, Dina Powell, served as Trump’s deputy national security adviser.",
    "While he has portrayed himself as a down-home Pennsylvania farm boy, McCormick’s lucrative business background ties to China have dogged him on the campaign trail.",
    "While Oz spent years in New Jersey close to New York City, where his eponymous TV show was filmed, McCormick lived in Connecticut as CEO of Bridgewater Associates.",
    "That wealth has allowed him to sink at least $7 million into TV ads to introduce himself to voters and rise to the top of the Republican primary field.",
    "According to the AP, Oz reported assets of between $104 million and $422 million, and has plowed $10 million of his own money into the Senate campaign.",
    "Oz, whose estimated wealth is between $76 million and $300 million, according to his filings, has also blanketed the state with TV ads.",
    "During his time with Bridgewater, McCormick oversaw more than $1 billion in investments in China, Politico reported.",
    "He earned a doctorate in international relations from Princeton University in 1996, then entered the business world.",
    "McCormick bought a house in Pittsburgh, and Oz has said he is renting his in-laws' home in Montgomery County.",
    "McCormick’s website describes him as “staunchly pro-life\" and a “strong believer” in the Second Amendment.",
    "McCormick served in President George W. Bush's administration in the Commerce and Treasury departments.",
    "McCormick’s campaign did not make him available for an interview with the USA TODAY Network.",
    "Prose is a reporter for the USA TODAY Network's Pennsylvania State Capital Bureau.",
    "He supports term limits and vows to serve only two six-year terms in the Senate.",
    "He can be reached at jprose@gannett.com.",
    "He left the Army in 1992 as a captain.",
    "J.D."
  ]
}