{
  "id": 4809,
  "mediaId": 2562,
  "date": "2022-04-23",
  "headline": "David McCormick to Newsmax: Trump Endorsing Oz Won’t Stop Me From Winning",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguidC5F3609C-E419-4EA5-8265-CA5745D919A6.jpg",
  "link": "https://donaldjtrumppolls.com/david-mccormick-to-newsmax-trump-endorsing-oz-wont-stop-me-from-winning/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    2440,
    2765,
    4905,
    5862,
    5533,
    2802,
    910,
    6512,
    6506
  ],
  "sentences": [
    "David McCormick to Newsmax: Trump Endorsing Oz Won't Stop Me From Winning (Newsmax's \"America Right Now\")\nBy Eric Mack | Saturday, 23 April 2022 01:49 PM\nWhile former President Donald Trump is popular in his state and the endorsement of Dr. Mehmet Oz \"matters,\" Pennsylvania Senate GOP primary candidate David McCormick told Newsmax it will not keep him from winning on May 18.",
    "A West Point Graduate, U.S. veteran, former undersecretary of commerce and treasury, former deputy national security adviser under former President George W. Bush, and investment firm CEO, McCormick told host Tom Basile that Oz's policy positions do not necessarily jibe with those in the state.",
    "\"Whether you're talking about the Second Amendment, or whether you're talking about the issue of life, or whether you're talking about fracking, which is really critical to Pennsylvania's future, Mehmet Oz has a set of positions that are in direct conflict.\"",
    "\"President Trump is quite popular in Pennsylvania and his America first agenda is popular, because it really address the problems that millions of Americans and Pennsylvanians had felt – and they hadn't been addressed in the past,\" McCormick said.",
    "And, despite Pennyslvania not being a border state, it has liberals running sanctuary cities like Philadelphia in the state, where crime has run rampant, making immigration the third-biggest election issue for the state's voters, McCormick warned.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nOriginal Article",
    "\"But the fentanyl crisis in Pennsylvania is a direct consequence of the border and so is the crime that we see in our sanctuary cities like Philadelphia, which moving out into the suburbs.\"",
    "\"So he's very popular, of course his endorsement matters, but Mehmet Oz, my primary opponent, is not popular, because his positions are in conflict with really an America first agenda.",
    "Also, the Trump administration doctrine of energy independence is something Pennyslvanians lost under President Joe Biden and desperately want to return to, McCormick added.",
    "\"I see lots of momentum across my campaign as a guy who's a Pennsylvanian and battle tested both in combat and creating jobs in Pennsylvania.\"",
    "\"Those are the three issues I want to hammer on most, because that's what Pennsylvanians are talking about around the kitchen table,\" he said.",
    "Inflation, energy, and immigration matter to voters this May 18 for the Senate GOP primary and Nov. 8 for the midterms, McCormick concluded.",
    "McCormick said the three most important issues with Pennyslvania voters are: inflation, energy independence, and the southern border.",
    "\"I don't think the endorsement will stand in the way of me winning,\" McCormick told Saturday's \"America Right Now.\"",
    "Inflation is the silent thief that hurts us all, but it really hurts working families.\"",
    "If Pennsylvania were a country, we'd be the fourth largest energy country in the world.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "\"That surprised me a little bit honestly,\" he said of the importance of the border.",
    "It's hurt our energy workers, and of course, it's driven up the price of fuel.\"",
    "\"And yet the Biden administration's war on energy has really hurt investment.",
    "\"We're the fourth largest natural gas reserves in the world.",
    "\"Energy is bountiful in Pennsylvania,\" McCormick continued.",
    "\"Inflation is killing working families,\" McCormick said.",
    "\"It's killing elders on fixed income.",
    "It's killing small businesses.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}