{
  "id": 5022,
  "mediaId": 8493,
  "date": "2022-04-19",
  "headline": "Dr. Oz: Snyder County Has ‘So Much More Opportunity’",
  "image": "https://www.wkok.com/wp-content/uploads/2022/04/IMG_20220419_112841611-225x300.jpg",
  "link": "https://www.wkok.com/dr-oz-snyder-county-has-so-much-more-opportunity/",
  "mediaOutlet": "wkok.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WKOK Staff",
  "authorUrl": "https://www.wkok.com/author/newsroom/",
  "termIds": [
    2802,
    2765,
    1594,
    6506,
    6608,
    6678
  ],
  "sentences": [
    "We should be energy dominant now.”\nOz even went so far as to say using natural gas is ‘one of the wisest moves’ if anyone cares about the environment, “If I were to take the natural gas under our feet here in Pennsylvania and began to use it to replace other sources overseas, it would the be equivalent of electrifying every vehicle in America, plus putting a solar panel on every residential roof, plus doubling wind energy, which is why America’s already exceeded most of the western countries in reducing our carbon footprint, just because we’ve got the raw resources right here.",
    "You see what people can do if they’re not over regulated to give them the freedom to build something unique.”\n“This is an unbelievable facility and Wood-Mode is able to create great cabinetry that is unparalleled.",
    "Dr. Oz, who’s been endorsed by former President Donald Trump, was especially impressed after touring Wood-Mode Custom Cabinetry, “You look at Wood-Mode, you see an example of American ingenuity.",
    "KREAMER – ‘There’s so much more opportunity in Snyder County,’ that was part of the message from GOP U.S. Senate Candidate Dr. Mehmet Oz when he visited the Valley Tuesday.",
    "They understand that an overreaching, authoritarian federal government is limiting our ability to access energy from federal lands, which is our lands.",
    "He said Pennsylvanians are angry because they know energy prices are driving inflation, “They know they have the solution right at their feet.",
    "Oz says there’s more room to grow nationwide and especially in Pennsylvania by using our own natural gas.",
    "Congressman Fred Keller (R-12th, Kreamer, Pa), who has also endorsed Oz for U.S. Senate.",
    "We’re not energy independent for that reason, like we were under President Trump.",
    "Let’s use it.”\nAlso, in attendance for the tour at Wood-Mode Tuesday was U.S.",
    "But most importantly, you’re proud to be American.",
    "We’re giving up huge amounts of income locally.",
    "That’s what we want in this country,” he said.",
    "We’re paying extra money at the gas pump.",
    "There’s no pipelines to ship them.",
    "This is American made.",
    "About The Author"
  ]
}