{
  "id": 5162,
  "mediaId": 2528,
  "date": "2022-04-24",
  "headline": "Chris Christie says Donald Trump's endorsements are 'emotional decisions' and not 'political analysis'",
  "image": "https://i.insider.com/6190eb9b8e9bfa001986d8ed?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/chris-christie-says-donald-trump-bases-endorsements-on-emotions-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Getahun",
  "authorUrl": "https://www.businessinsider.com/author/hannah-getahun",
  "termIds": [
    4306,
    2400,
    2072,
    2765,
    49,
    1489,
    6175
  ],
  "sentences": [
    "—This Week (@ThisWeekABC) April 24, 2022\nChristie continued by saying Trump's endorsements landed \"all over the place,\" referencing Trump's Senate endorsements of \"Hillbilly Elegy\" author JD Vance and TV personality Dr. Mehmet Oz,\nBoth endorsements received backlash from Republican party officials.",
    "Governor Chris Christie(R-NJ) speaks with US President Donald Trump(L) after he delivered remarks on combatting drug demand and the opioid crisis on October 26, 2017 Jim Watson/AFP via Getty Images\nFormer Governor Chris Christie said Donald Trump's endorsements are based on \"emotional decisions.\"",
    "\"I do think, though, when we get to June, we're going to look back and say that most of the big endorsements he made — not the ones in deep-red House districts but in the big endorsements he made — are going to turn out to not have been right,\" Christie said.",
    "You've got Republicans killing Republicans there with the Club for Growth, who's been carrying Trump's water in Georgia, is now working against him with the JD Vance endorsement, so he's kind of all over the lot,\" Christie said of Trump.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Former New Jersey Governor Chris Christie said former President Donald Trump bases his endorsements on \"emotional decisions\" rather than \"political analysis.\"",
    "\"The idea that he makes these decisions based upon political analysis is sophistry,\" Christie told host Martha Raddatz.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Christie was asked whether or not Trump endorsements matter during an interview on ABC's \"This Week\" on Sunday.",
    "He also said that Republicans may find the endorsements \"are going to turn out to not have been right.\"",
    "Christie also said that Trump's endorsements won't determine whether or not his candidates will win.",
    "Christie said Trump's endorsements are \"all over the place,\" referencing JD Vance and Dr. Mehmet Oz.",
    "A representative for Trump did not immediately respond to Insider's request for comment.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "\"I don't know that the JD Vance one is anywhere near a layup.",
    "\"This is all emotional decisions and who speaks to him last.\"",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}