{
  "id": 5219,
  "mediaId": 2618,
  "date": "2022-04-10",
  "headline": "Explosive Pennsylvania Testimony Explains How Leftist Money Infiltrated Election Offices In 2020",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/10/explosive_pennsylvania_testimony_explains_how_leftist_money_infiltrated_election_offices_in_2020_82982.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Margot Cleveland",
  "authorUrl": "",
  "termIds": [
    2662,
    1792,
    3437,
    3706,
    4600,
    4539,
    4066,
    5881,
    6506
  ],
  "sentences": [
    "As more and more information surfaces regarding the stolen election...it's a miracle there hasn't been a revolt nation wide...WE should have a day of mourning for our republic...and shut down the corporate dudes for a week...time for a nation wide strike...Disney is starting to feel the anger of parents and grandparents with all the cancelations and bad press...just as Pepsi and coke had to tighten their budgets because WE stopped buying their products....and now...Cracker Jack has folded with the new cracker Jill ...and what's with Oreo cookies?...How can they be racist...they're black and white!",
    "In turn, “the New Venture Fund is managed by Arabella Advisors,” Shepherd continued, noting that “the ‘parent’ group of Arabella, New Venture Fund — they are part of what the Atlantic Magazine identified as ‘The Massive Progressive Dark-Money Group You’ve Never Heard Of.’” In fact, in January, The New York Times called out the New Venture Fund in its article headlined, “Democrats Decried Dark Money.",
    "Not just Zuckerberg/Chan: While the grants originated with the nominally non-partisan Center for Tech and Civic Life—an organization that Mark Zuckerberg and Priscilla Chan’s private foundation later infused with some $350 million in cash—emails reveal that a main consultant involved in targeting select counties, Marc Solomon, worked for the Center for Secure and Modern Elections, or the CSME.",
    "Both Torren Ecker and Dan Moul voted for Act 77 (Mail in Ballots) and refuse to do anything about correcting voter fraud in PA. Then you have our PA Senator (Doug Mastriano) who voted twice for Act 77 and runs around PA pretending that he did not know how Act 77 was approved.",
    "PA's Republican legislature finally offered a resolution regarding the election and certification of electors on November 30th...after the Governor certified the electors on the 24th.",
    "“What’s important to know about CSME is that it is not a 501(c)3, but rather it is a fiscally sponsored project of the New Venture Fund,” Shepherd told the Pennsylvania lawmakers.",
    "Like I said, you can't win here in PA.\nYeah but ... Pennsylvania produced the first transgender Admiral in the Public Health Service, so we have that going for us.",
    "Like Wisconsin and the other four states that are at the heart of this \"controversy\", it's a day late and a dollar short.",
    "#3, the answer to your question is Republican in both the house and senate in PA. Let me give you some information.",
    "They should have given her a period of time to remove them and if they were not removed, then start impeachment.",
    "We have a speaker in the house that is a Kevin McCarthy, weak and does not want to rock the boat.",
    "The rest of the state was wall-papered with Trump signs right up until the 2020 election.",
    "The only thing that is going to save this state is to give Philadelphia to New Jersey.",
    "Then we have a U.S. congressman that is nothing more than milk toast, Dr. Joyce.",
    "Postal service (mail); 2) handcarry to the election office; and 3) in person.",
    "To top it off, we have Trump endorsing Dr. Oz for the U.S. Senate position.",
    "There are only three ways in accordance with Act 77 to vote in PA, 1) U.S.",
    "Word has it, one of Dr. Joyce's family members works for McCarthy.",
    "Like Mitch always says, it was the best the Republicans could do.",
    "Oz is another Romney, Collins, Murkowski all rolled in one.",
    "In the senate you have a not so trusting majority leader.",
    "There are two representatives in our county that SUCK.",
    "Ballot drop boxes opens the door to ballot harvesting.",
    "Not one of the legislators have the stomach for this.",
    "Did our legislators do anything about it, hell NO.",
    "However, the Secretary of State said it was okay.",
    "Then they Won with it in 2020,” Shepherd added.",
    "You just can't win here in PA.\nOops, I forgot.",
    "There was no mention of ballot drop boxes.",
    "But this is what really angers us in PA.",
    "How ever Kevin votes, so does Dr. Joyce.",
    "Ballot drop boxes are everywhere.",
    "They are located in all counties.",
    "He is Kevin McCarthy's shadow.",
    "They are illegal.",
    "You ask why!!!",
    "Very true #7.",
    "!"
  ]
}