{
  "id": 5249,
  "mediaId": 2618,
  "date": "2022-04-10",
  "headline": "Disney heir who works as a high school biology teacher comes out as transgender man and blasts Ron DeSantis' so-called 'Don't Say Gay' law: Family makes $500,000 donation to LGBTQ advocacy group",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/10/disney_heir_who_works_as_a_high_school_biology_teacher_comes_out_as_transgender_man_and_blasts_ron_desantis_so-called_dont_say_gay_law_family_makes_500000_donation_to_lgbtq_advocacy_group_82991.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Harriet Alexander",
  "authorUrl": "",
  "termIds": [
    2401,
    1679,
    4794,
    1357,
    6159
  ],
  "sentences": [
    "A transgender heir to the Disney fortune has told of their guilt at not doing more to speak out against Florida's 'Don't Say Gay' bill, addressing the issue for the first time since their father announced to the world that he had a trans child.Charlee Corra Disney, a 30-year-old high school biology and environmental science teacher, came out as a transgender man who uses the pronouns 'they/theirs' to their family four years ago.Having avoided the spotlight for much of their adult life, Charlee was then thrown into the center of attention last week when their father Roy P. Disney - grandson of the company's co-founder, and great-nephew to Walt -\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "It has become more and more obvious that the entire motivating factor among such individuals is to create more of their kind by propagandizing and indoctrinating children and impressionable youth.",
    "It took a long time of reading the imaginary they/their pronouns in the story before I found out that they/their is actually an XX pretending to be an XY.",
    "Last night I was remarking to our Bible study leader that those who saw the normalization of homosexuality as a precursor to pedophilia were right.",
    "While it may be attention garnering and a trendy thing to do, reality has a way of intruding on delusions that will be very difficult to ignore.",
    "The fact that you believe children as young as three should be presented with any sexual concept is an indication that you are not fit to teach.",
    "Trot out everyone in the family, and the corporation and parents will still agree that sexual matters should be left to the parents to explain.",
    "It is part of the value system of the family and no corporation, employee or family member thereof has a say into what goes on in a family.",
    "I assume the next step will be for you/them/he/she/it will be to suggest a 5 year old can consent to having sex with a filthy predator.",
    "But we are talking about little children whose biggest quandary is whether to have strawberry or grape jelly with their peanut butter.",
    "So all she is doing is trying to get people confused about her pronouns and make an announcement to everyone how cool and hip she is.",
    "I will not accept the farce of so called gender dysphoric individuals in their frantic attempts to normalize the abnormal.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "You are usurping the right of parents to decide when and what their children need to know regarding sexual matters.",
    "Disney has ruined its brand and will forever be known as a bunch of creepy, anti-family, pro-grooming zealots.",
    "Children need to be protected from grooming regardless of where they are, especially in the classroom.",
    "So this means she really isn't doing anything to change her gender and it's just a pronoun change.",
    "She isn't even embracing the fad enough to go all the way to a he but rather just a they/theirs.",
    "\"Grooming\" is their raison d'etre for being in education; pedophiles go where the children are.",
    "I refuse to accept they/their as valid pronouns for this totally divorced from reality female.",
    "I would not want you teaching my child because I believe you to be emotionally unstable.",
    "Look at the tilt of the head that is characteristically female when being photographed.",
    "Charlee, pretending to be what you are not genetically will be a hard life for you.",
    "You cannot bring up sexual concepts at this age, they are not prepared to hear it.",
    "From the pictures it looks like she is still embracing her original female gender.",
    "They believe they can be anything and explore the world with their imaginations.",
    "I don’t care if Mickey Mouse himself comes out along with the rest of his crew.",
    "If a child can determine his gender then he certainly can give consent.",
    "If you love and cherish your children, get them out of public schools!",
    "Your donation helps keep our discussions going and our voices heard.",
    "But as an adult I do not have to play along with his fantasy.",
    "So I can only assume that I am abnormal because I am normal.",
    "Take your creepy grooming agenda and keep it to yourselves.",
    "You do not have that right especially as an educator.",
    "They do not need to believe that their sex is fluid.",
    "In case you do not know an adult female is a woman.",
    "Children should be protected not indoctrinated.",
    "Putting on lipstick does not make him a woman.",
    "To sexualize a child is evil and perverted.",
    "It is confusing and totally inappropriate.",
    "But as an adult he can make this choice.",
    "I don't care how Charlee lives his life.",
    "Small children are easily influenced.",
    "I was born female, I am now a woman.",
    "Americans have rejected your agenda.",
    "A so-called \"transgendered\" teacher.",
    "Yes, he is a man like it or not.",
    "Probably just a matter of time.",
    "Because, I asked, what's left?",
    "Is there anything else to say?",
    "Hint to the newest SCOTUS.",
    "His DNA would prove that.",
    "Isn't that the next step?",
    "Children need stability.",
    "He replied, \"animals\".",
    "You are not welcome.",
    "Get over it Disney.",
    "Follow the science.",
    "This is evil.",
    "Case closed.",
    "Thank you."
  ]
}