{
  "id": 5281,
  "mediaId": 2557,
  "date": "2022-04-14",
  "headline": "VIDEO: Laura Ingraham Goes Against Trump And Hannity, Calls Their Latest Move A ‘Mistake’",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-1128204182-e1587476297568.jpg",
  "link": "https://dennismichaellynch.com/video-laura-ingraham-goes-against-trump-and-hannity-calls-their-latest-move-a-mistake/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    3054,
    2802,
    2765,
    2767,
    2482,
    2021,
    1126,
    1323,
    514,
    6506
  ],
  "sentences": [
    "Conway dodge the question, saying, “I think that it confused many Republicans and conservatives in Pennsylvania because they’ve seen Oz at his own words on video about [being] against guns, for abortion, praising Hillary Clinton as one of the most brilliant women, smartest women he’s ever met, being for Obamacare and so on and so forth.”\nWATCH the full exchange below, as Ingraham pushes back, saying it was a mistake for Trump to endorse Oz.",
    "Trump endorsed Oz’s candidacy Saturday, saying Oz will be “most able” to defeat a “radical Left Democrat looking to do unthinkable harm” to the U.S. Ingraham played footage of Oz discussing red flag laws and claiming a fetal heart is not beating at six weeks gestation, then asked former Trump-era senior counsel Kellyanne Conway if the endorsement was a mistake.",
    "‘What the hell was he thinking?’: Pennsylvania conservatives react to Trump’s support of Oz https://t.co/25Do3BHEot\n— Laura Ingraham (@IngrahamAngle) April 11, 2022\nLaura Ingraham Calls Trump And Hannity’s Endorsement Of Dr. Oz A ‘Mistake’ https://t.co/qTB0L9xk8Y\n— Daily Caller (@DailyCaller) April 13, 2022\nThe DML News App offers the best in news reporting.",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nFox News host Laura Ingraham called former President Donald Trump and her colleague Sean Hannity’s endorsement of Republican Pennsylvania Senate candidate Dr. Mehmet Oz a “mistake” Tuesday.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "The article goes on to state the following:\n“Was it a mistake, Kellyanne?” Ingraham asked.",
    "To get more information about this article, please visit DAILYCALLER.COM.",
    "Listen to the latest daily DML podcasts below!",
    "Then please share."
  ]
}