{
  "id": 5436,
  "mediaId": 2562,
  "date": "2022-04-13",
  "headline": "Mehmet Oz to Newsmax: Trump Endorsement ‘Massive’ in Senate Primary",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid08E0F314-DD7C-4FE3-91C4-B68ADF282980.jpg",
  "link": "https://donaldjtrumppolls.com/mehmet-oz-to-newsmax-trump-endorsement-massive-in-senate-primary/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    5862,
    2802,
    2370,
    2765,
    910,
    1489,
    1126
  ],
  "sentences": [
    "Mehmet Oz to Newsmax: Trump Endorsement 'Massive' in Senate Primary Newsmax's \"Greg Kelly Reports\"\nBy Jay Clemons | Wednesday, 13 April 2022 09:27 PM\nDr. Mehmet Oz fully understands the power of an endorsement from former President Donald Trump, calling it a potential tipping point in the Pennsylvania Senate race.",
    "However, it is worth noting: The most recent polls listed all preceded Trump's Oz endorsement; and in The Trafalgar Group poll — which historically has a good reputation for accuracy — Oz owns a sizable 11-point lead over McCormick.",
    "\"I think everyone [in Pennsylvania] agrees they've been waiting on an endorsement decision,\" Oz said, referencing a poll where 61% of the state's Republican voters were eagerly anticipating Trump's primary recommendation.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nOriginal Article",
    "Oz, a medical doctor-turned TV star (syndicated medical host for more than a decade), threw his proverbial hat into the Senate primary ring last November, despite never formally running for public office.",
    "During the interview with host Greg Kelly, Oz brushed off the McCormick-camp speculation of Trump's recommendation having more to do with a preexisting relationship than pure political acumen.",
    "During his one-on-one interview on Newsmax's \"Greg Kelly Reports\" on Wednesday night, Dr. Oz was humbled and appreciative of the Trump recommendation, which formally came at a weekend rally.",
    "Also, when addressing his primary challenger's political track record, Oz said McCormick \"has made decisions that have benefited him and Wall Street, but not mainstream Pennsylvanians.\"",
    "According to RealClearPolitics, McCormick leads Oz in four of five tracking polls involving the GOP primary in Pennsylvania, with an average advantage of 2.6 percentage points.",
    "\"President Trump wanted someone who could speak to these cultural issues\" and also \"push back against Democratic wokeism,\" Oz said.",
    "Oz then countered by revealing he and McCormick were interviewed by Trump, leading up to Saturday's announcement.",
    "And eventually, the former president determined Oz is \"smart, tough, and will never let [Pennsylvanians] down.\"",
    "\"Well, those folks now have an answer; and pretty quickly, it's going to become evident as polling continues.\"",
    "Oz then mimicked some of Trump's tent-pole prerequisites for identifying America First candidates.",
    "Oz then added: \"President Trump did not find David McCormick to be able to do that.\"",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "His main opponent in the May 17 primary: Republican David McCormick.",
    "Oz called it \"massive\" for his Senate Republican primary campaign.",
    "\"Someone who'd be brave enough to do it over and over again.\"",
    "Trump took \"a lot of time\" to make this decision, Oz said.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}