{
  "id": 5472,
  "mediaId": 2562,
  "date": "2022-04-20",
  "headline": "Dr. Oz to Newsmax: Time for Americans to “Get Back to Reality’ on COVID",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid7164AB86-71E5-4623-A623-88B2B1844921.jpg",
  "link": "https://donaldjtrumppolls.com/dr-oz-to-newsmax-time-for-americans-to-get-back-to-reality-on-covid/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    5905,
    2802,
    2765,
    1370,
    910,
    6678
  ],
  "sentences": [
    "Dr. Oz to Newsmax: Time for Americans to \"Get Back to Reality' on COVID (Newsmax/\"National Report\")\nBy Sandy Fitzgerald | Wednesday, 20 April 2022 03:36 PM\nNow that a federal judge has lifted the Centers for Disease Control and Prevention's mask mandate for planes and other forms of transportation, it's important to \"let America get back to reality\" and learn to travel without masks, Dr. Mehmet Oz, now a GOP candidate for the U.S. Senate race in Pennsylvania, told Newsmax Wednesday.",
    "\"The judge said it was capricious and arbitrary that the CDC was limiting our ability to travel by mandating masks and planes trades just about every other form of transport, and I think the judge was correct in her decision,\" Oz, whose campaign has been endorsed by former President Donald Trump, said on Newsmax's \"National Report.\"",
    "The White House has said that it won't appeal the order to drop the mandate unless the CDC says the masks must still be worn, but Oz said he suspects there will be no fight over the ruling, which was to run out in another 10 days.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nOriginal Article",
    "But you got to protect kids through school, so they're not indoctrinated and you've got to get them well enough educated to go out and get meaningful jobs and then provide health care to them afterward.\"",
    "There are some concerns from parents of young children who can't get their vaccinations yet, he acknowledged, but he stressed that \"healthy children are incredibly resilient against COVID.\"",
    "It's also not good to mix politics and medicine, as \"you get politics and there's no medicine left,\" said Oz, adding that it will do the White House no good to file an appeal.",
    "He added that Trump wants him to focus on the fact that he has a \"bold, loud voice and I will win in November…I'm conservative and I will not let us down.",
    "Oz also responded to other GOP candidates in Pennsylvania who are questioning his conservative values and Trump's backing.",
    "I know people have phobias about COVID but the medical reality is we're going to have to learn to travel without masks.",
    "There is network television to get my ideas across and make sure that that we are never pushed back and I've listened.\"",
    "\"I'm socially conservative about life, liberty, and the pursuit of happiness life because it starts at conception.",
    "I have the ability to walk into the knife fight of the culture wars with more than just an index card.",
    "But as for now, \"it does not make a lot of sense to force people to wear masks on planes,\" said Oz.",
    "\"President Trump endorsed me because he thought I was 'smart, tough and will never let us down.'\"",
    "It's going to be part of our lives, and it's going to be around with new variants continuously.\"",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "They don't help most people if they've already had natural immunity.",
    "Further, Oz said, \"you're in pretty good shape on a plane.",
    "They don't help people if they've been well vaccinated.",
    "I know exactly how to play on the biggest stage.",
    "Young people didn't benefit from them.\"",
    "\"We need to move forward,\" said Oz.",
    "\"This is no longer a pandemic.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "It's an endemic virus.",
    "349, Dish Network Ch.",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch.",
    "said Oz."
  ]
}