{
  "id": 5542,
  "mediaId": 4043,
  "date": "2022-04-09",
  "headline": "Donald Trump endorses celebrity surgeon known for guesting on Oprah in crucial Senate race",
  "image": "https://e3.365dm.com/22/04/1600x900/skynews-mehmet-oz-republican_5734945.jpg?20220410042603",
  "link": "https://news.sky.com/story/donald-trump-endorses-celebrity-surgeon-known-for-guesting-on-oprah-in-crucial-senate-race-12586864",
  "mediaOutlet": "Sky News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Acres",
  "authorUrl": "",
  "termIds": [
    5644,
    5462,
    4905,
    2802,
    2751,
    2765,
    1489
  ],
  "sentences": [
    "Sean Parnell had been considered the favourite after receiving Mr Trump's first endorsement last September, but he suspended his campaign in November after he lost custody of his three children following allegations that he had physically abused his estranged wife.",
    "However, Mr Biden has still been frustrated in his bid to pass his landmark \"Build Back Better\" social spending and climate change bill due to opposition from Democrat Joe Manchin to the $1.75trn spending commitment.",
    "Candidates will face off in a primary on 17 May to decide who contests November's crucial midterm elections, with Pennsylvania tipped to be competitive and crucial in determining who controls the Senate from 2023.",
    "Dr Mehmet Oz, a Turkish-American TV personality who made more than 60 appearances on Winfrey's show before it stopped airing in 2011, is running to replace retiring Republican Pat Toomey in Pennsylvania.",
    "Former president Donald Trump has endorsed a celebrity surgeon well known for guesting on The Oprah Winfrey Show in a Senate race that could prove pivotal to the fate of Joe Biden's domestic agenda.",
    "The outgoing Mr Toomey was one of seven Republican senators who voted to convict Mr Trump in February 2021 following his impeachment on a charge that he incited last year's attack on the Capitol.",
    "The Dr Oz Show debuted in 2009, and he became known for shocking audiences with show-and-tell displays of decaying lungs and rotting livers, telling viewers they should take care of themselves.",
    "Dr Oz was said to have enjoyed the media attention he received and went on to appear as a health expert on Winfrey's show for five seasons, before she offered to produce a series of his own.",
    "His public image took a blow in 2014, however, when he told US politicians investigating bogus diet product ads that some products promoted on his show lacked \"scientific muster\".",
    "\"Dr Oz is smart, tough, and will never let you down,\" said the 75-year-old, whose backing is being keenly sought by Republican candidates as he maintains huge sway over the party.",
    "While Mr Trump has not confirmed his intention to run for president again in 2024, he is widely expected to, and therefore his endorsements are being closely watched.",
    "Trump backs 'smart, tough' surgeon Oz\nMr Trump, himself a TV personality before entering politics, said Dr Oz had his \"complete and total endorsement\".",
    "The Democrats narrowly control the Senate - the Democrats and Republicans are split 50-50, but Vice President Kamala Harris has a deciding vote.",
    "Dr Oz rose to fame for working on a heart transplant for ex-baseball player Frank Torre during the 1996 World Series.",
    "Dr Oz said the 45th US president \"knows how critical it is to change the kinds of people we send to Washington\".",
    "Pennsylvania has two seats in the US Senate, one held by Mr Toomey and the other by Democrat Bob Casey.",
    "In 2018, Dr Oz was appointed by Mr Trump to the president's council on sports, fitness, and nutrition.",
    "Dr Oz's main rival for the Republican nomination is former hedge fund CEO David McCormick.",
    "The Senate vote of 57-43 fell short of the two-thirds majority needed to convict him.",
    "\"I am proud to receive his endorsement,\" he added.",
    "How is the race shaping up?",
    "Who is Dr Oz?"
  ]
}