{
  "id": 5556,
  "mediaId": 2688,
  "date": "2022-04-12",
  "headline": "Trump Refuses To Back His Ex-US Attorney For Not Big Lying Hard Enough",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/04/GettyImages-624424334-scaled.jpg",
  "link": "https://talkingpointsmemo.com/news/trump-former-us-attorney-mcswain-pennsylvania-gop-governor?utm_source=rss&utm_medium=rss&utm_campaign=trump-former-us-attorney-mcswain-pennsylvania-gop-governor",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Shuham",
  "authorUrl": "https://talkingpointsmemo.com/profile/matt-shuham",
  "termIds": [
    2765,
    4811,
    5665,
    1032,
    6512,
    6506
  ],
  "sentences": [
    "It was there for the taking and he failed so badly.”\nMcSwain formerly served as served as the chief federal prosecutor in Philadelphia under the Trump administration during the most crucial days and weeks of the former president’s efforts to overturn the 2020 presidential election results.",
    "Former President Trump on Tuesday knocked his old friend Pennsylvania GOP gubernatorial candidate — who Trump once appointed as a U.S. attorney — for doing “absolutely nothing” to push his bogus claims of widespread election fraud.",
    "“Hence, our Country is going to hell.”\nLast weekend, the former president announced his controversial endorsement of celebrity doctor Mehmet Oz in the hotly contested GOP primary for Pennsylvania Senate.",
    "In a statement riddled with baseless claims of election fraud, Trump declared that he will not endorse Bill McSwain in the upcoming GOP primary in the Pennsylvania governor’s race.",
    "In his Tuesday statement, the former president insisted that McSwain “should have done his job anyway” even if Barr dissuaded him from pursuing baseless voter fraud allegations.",
    "McSwain has campaigned on his ties with the former president, touting his term as U.S. attorney and airing campaign ads that show both of them pictured together.",
    "“He was the U.S. Attorney who did absolutely nothing on the massive Election Fraud that took place in Philadelphia and throughout the commonwealth,” Trump said.",
    "He supported the Big Lie, McSwain just apparently did not Big Lie hard enough — and it seems his efforts to get Trump’s backing have failed.",
    "In his letter, McSwain accused former Trump Attorney General Bill Barr of stonewalling his Big Lie-related investigations.",
    "However, Trump has not endorsed a candidate in the crowded GOP primary to succeed Pennsylvania Gov.",
    "McSwain also sent a letter to Trump last year seeking his endorsement in the governor’s race.",
    "“Do not vote for Bill McSwain, a coward, who let our Country down,” he added.",
    "Attorneys were probably told not to do anything by Barr,” Trump said.",
    "“He knew what was happening and let it go.",
    "“Many of the U.S.",
    "Tom Wolfe (D)."
  ]
}