{
  "id": 5592,
  "mediaId": 2790,
  "date": "2022-04-10",
  "headline": "Trump endorses Dr. Oz for the U.S. Senate in Pennsylvania",
  "image": "https://media.npr.org/assets/img/2022/04/10/ap22042710407560_wide-41da32217472eb5f6a834971f96c906ec9256fb7.jpg?s=1400",
  "link": "https://www.npr.org/2022/04/10/1091939065/trump-dr-oz-senate-pennsylvania",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emma Bowman",
  "authorUrl": "https://www.npr.org/people/543959056/emma-bowman",
  "termIds": [
    5862,
    4958,
    2802,
    2440,
    2765,
    1126,
    1489,
    1394,
    6474,
    6506
  ],
  "sentences": [
    "The former president also praised Dr. Oz's medical and academic credentials, adding, \"He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!).\"",
    "While the former president has been reserving his support for candidates who reinforce his false claims of voter fraud, it's unclear how much weight a Trump stamp of approval carries for the contested primary elections.",
    "\"This is all about winning elections in order to stop the Radical Left maniacs from destroying our Country,\" Trump said in a statement promoting the celebrity heart surgeon-turned-politician this weekend.",
    "Earlier in Pennsylvania, Trump had endorsed Sean Parnell, an Army veteran who dropped out of the race after allegations of physical abuse against his wife and children emerged.",
    "Former President Donald Trump has endorsed fellow TV personality-turned-politician Dr. Mehmet Oz for the U.S. Senate ahead of the Republican primary in Pennsylvania.",
    "The endorsement comes as Republican candidates vie for Trump's support in the key battleground state and in other primaries across the country like Ohio.",
    "Another candidate in the race, David McCormick, whose resume more closely fits the establishment Republican mold, had been seeking Trump's endorsement.",
    "Pennsylvania Democrats, meanwhile, are waging their own high-stakes primary battle as the party seeks to retain control of the Senate.",
    "Trump is betting on Dr. Oz's electability to sway a race in which McCormick has a slight lead, according to recent poll data.",
    "\"I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.",
    "The former George W. Bush administration official is married to Dina Powell, a former Trump White House official.",
    "In response to the Oz endorsement, Parnell took to Twitter to slam Trump's shift in support.",
    "He has lived with us through the screen and has always been popular, respected, and smart.\"",
    "Parnell has denied those accusations."
  ]
}