{
  "id": 5798,
  "mediaId": 2738,
  "date": "2022-04-11",
  "headline": "Trump’s Poorly-Attended Weekend Rally Included Bragging So Silly That His Own Crowd Began Laughing",
  "image": "https://uproxx.com/wp-content/uploads/2022/04/0b87b51082e682d270a0dcf3925c5849.jpg?w=1024",
  "link": "https://uproxx.com/viral/trump-rally-cleanest-person-dr-oz/",
  "mediaOutlet": "uproxx.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kimberly Ricci",
  "authorUrl": "https://uproxx.com/author/kimberly-ricci/",
  "termIds": [
    2765,
    4129,
    4591
  ],
  "sentences": [
    "Newsweek detailed how Trump made his “sheriff” brag while pointing toward the local sheriff, and then Trump boasted about how investigators try to bring him down to no avail: “You know, you’ve been investigated years and years, millions and millions of pages of documents, they found nothing,”\nIt’s not clear whether Trump seriously plans to run for reelection or if he’s simply grifting for more campaign contributions, but it appears that the MAGA group size could be dwindling.",
    "I think I’m the most honest human being, perhaps, that God ever created.” As Lincoln Project co-founder George Conway pointed out in the below tweet, not even Trump’s own fanbase could resist chuckling.",
    "Amid reports that Vladimir Putin wants to retaliate against the U.S. by supporting ex-President Trump for 2024 reelection, well, that’s not looking like such a great plan.",
    "Mediaite is reporting that Trump’s weekend rally was a bust, and he didn’t even come close to filling the chosen venue with less than 2,000 people in attendance.",
    "That means people like you pic.twitter.com/Te5aCTTlQE\n— Acyn (@Acyn) April 10, 2022\nSo many delusions, but can they hold up?",
    "The twice-impeached reality star declared that he was one of the most incredibly honest people that ever existed.",
    "Trump’s been feeling some intense backlash for endorsing Dr. Mehmet Oz in a Senate race out of Pennsylvania.",
    "However, Trump’s standing firm so far in his commitment to Oz: “When you’re in television for 18 years.",
    "That means people like you.”\nTrump on Oz Endorsement: When you’re in television for 18 years.",
    "Nonetheless, Trump wasn’t deterred from his customary bragging.",
    "In fact, he declared, “I’ve got to be the cleanest sheriff.",
    "Why they laughed, who knows, but that was the response.",
    "We’ll find out come midterm time.",
    "That wasn’t all that he said.",
    "That’s like a poll.",
    "That’s like a poll."
  ]
}