{
  "id": 5884,
  "mediaId": 2619,
  "date": "2022-04-16",
  "headline": "Citadel’s Ken Griffin is Republican party’s top donor – with $40 million put toward midterms",
  "image": "https://images.mktw.net/im-526243/social",
  "link": "https://www.marketwatch.com/story/citadels-ken-griffin-is-republican-partys-top-donor-with-40-million-put-toward-midterms-11650128626?rss=1&siteid=rss",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lydia Moynihan",
  "authorUrl": "",
  "termIds": [
    5862,
    190,
    1126,
    6159,
    6678
  ],
  "sentences": [
    "“That’s a really difficult backdrop with which to draw talent to your city.”\nWhile it takes safety for a nation to flourish in the short term, it also takes a substantive education system to maintain a thriving country, Griffin argues.",
    "“Too many of America’s business leaders stay out of politics today,” Griffin said “They have to be engaged because they understand the ramification of policy decisions: I’m building a business; I’m running a factory; I’m creating jobs.",
    "“A huge part of my shift towards being more involved in politics has been watching federal and state policies undermine access to the American Dream.”\nGriffin is quick to acknowledge not everyone shares his political viewpoints.",
    "They just can’t continue to be silent.”\nGriffin, who’s worth an estimated $30.5 billion, according to Bloomberg Billionaires Index, has slowly ramped up his involvement — and his election spending — over the last decade.",
    "The New York Post\nBillionaire hedge fund manager Ken Griffin isn’t just investing in stocks, he’s also investing in politics — to the tune of $40 million in the upcoming midterm election cycle, according to a report.",
    "Griffin has criticized Trump’s unsubstantiated claims that the 2020 election was rigged and adds it’s time to look to “the next generation” of candidates for the 2024 election cycle.",
    "“Nothing is more important to the future of America than a robust nursery through high school, and then a system of higher education,” Griffin adds.",
    "Griffin, who made more money than any other hedge fund manager last year — raking in $2 billion in 2021 alone — has also become the No.",
    "I’ve had a colleague stabbed on the way to work,” Griffin, who is based in Chicago, said in an interview with the Wall Street Journal.",
    "Last year Griffin decided to shell out $43.2 million last month for a rare copy of the US Constitution at the urging of his son.",
    "The document, which is one of 13 original copies from 1787, was initially valued by Sotheby’s at $15 million to $20 million.",
    "He’s also donated $7.5 million to a PAC associated with Pennsylvania Republican gubernatorial candidate David McCormick.",
    "But he still encourages those who disagree with him to get involved and donate to causes they care about as well.",
    "McCormick left his CEO perch at posh hedge fund Bridgewater Associates to run against Dr. Mehmet Oz.",
    "While he’s donated broadly to issues, he is also interested in supporting individual candidates.",
    "And Griffin, 53, is particularly focused on reining in crime and improving education.",
    "He has given $5 million to a political action committee associated with Florida Gov.",
    "1 donor to Republican causes, according to the Wall Street Journal’s tabulations.",
    "Griffin is less enthusiastic about one politician in particular: Donald Trump.",
    "But Griffin said he decided he’d spend whatever it took to get it.",
    "And it’s not just politics Griffin is spending big money on.",
    "In 2020, he gave more than $67 million to political causes.",
    "“I told myself, ‘I am going to own this,’” Griffin said.",
    "In 2010, he gave under $1 million to political causes.",
    "“I’ve had multiple colleagues mugged at gunpoint.",
    "“I don’t do that very often.”",
    "Ron DeSantis."
  ]
}