{
  "id": 5885,
  "mediaId": 2594,
  "date": "2022-04-09",
  "headline": "Trump endorses Dr Mehmet Oz in Republican primary for Senate race in Pennsylvania",
  "image": "https://static.independent.co.uk/2022/04/10/00/GettyImages-1370026514.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/trump-dr-oz-senate-republican-pennsylvania-b2054796.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Garcia",
  "authorUrl": "https://www.independent.co.uk/author/eric-garcia",
  "termIds": [
    0
  ],
  "sentences": [
    ")”\nDr Oz jumped into Pennsylvania’s Senate race Mr Trump’s preferred Senate candidate, Sean Parnell, dropped out after his estranged wife accused him of abusing her and his children during custody proceedings.",
    "“Perhaps most importantly, I believe that Mehmet Oz will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” he said in a statement.",
    "Dr Oz is locked in a contentious primary with David McCormick, a hedge fund CEO, who has his own ties to the Trump administration given that his wife Dina Powell served as deputy national security adviser.",
    "Republicans are running to replace retiring Republican Senator Pat Toomey, who voted to convict Mr Trump for his role in the January 6 insurrection at the Capitol.",
    "Like Mr Trump, Dr Oz earned national name recognition through television, in his case through the popular Dr Oz show, which Mr Trump cited in his endorsement.",
    "“He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!",
    "Mr Trump went on the Dr Oz show during the 2016 campaign, during which time, Mr Trump said he wanted to lose weight, which Mr Trump cited.",
    "Former president Donald Trump endorsed television host and physician Mehmet Oz ahead of the Pennsylvania Senate primary on Saturday night.",
    "He has lived with us through the screen and has always been popular, respected, and smart,” Mr Trump said in a statement.",
    "“I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.",
    "Mr Trump made the announcement on Saturday ahead of his rally in Selma, North Carolina.",
    "Pennsylvania will hold its Senate primary on 17 May 2022."
  ]
}