{
  "id": 5921,
  "mediaId": 2726,
  "date": "2022-04-10",
  "headline": "Republican governor says Trump is backing 'crazy' candidates for the GOP's primary races and is 'going to lose in 2022'",
  "image": "https://i.insider.com/6253a4a58394f20018d42ffe?width=1200&format=jpeg",
  "link": "https://www.insider.com/gop-governor-says-trump-backing-crazy-candidates-for-political-races-2022-4",
  "mediaOutlet": "thisisinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cheryl Teh",
  "authorUrl": "https://www.insider.com/author/cheryl-teh",
  "termIds": [
    2765,
    2012,
    4958,
    4026,
    758,
    1126,
    6175
  ],
  "sentences": [
    "Parnell was forced to suspend his campaign after facing domestic abuse allegations from his estranged wife, while Greitens is currently fending off allegations of physical abuse made by his ex-wife.",
    "The former president has also endorsed a slate of far-right congresspeople, including Rep. Marjorie Taylor Greene, who is running for re-election in Georgia.",
    "He added that the candidates Trump supports — and their performance in their respective electoral races — would be critical in defining the face of the GOP.",
    "As of March 30, Trump has endorsed at least 130 candidates for primary races, many of whom were reportedly vetted by a small, secretive group of advisers.",
    "Some of his picks, such as Pennsylvania Senate candidate Sean Parnell and Missouri Senate candidate Eric Greitens, have faced scandal-plagued campaigns.",
    "He also went as far as to rescind the endorsement of his ally, Mo Brooks, calling the congressman and current Alabama Senate candidate \"disappointing.\"",
    "The Maryland governor has also been outspoken about what he said was the GOP's continuing concerns about possible retaliation from the Trump camp.",
    "On Sunday, Trump also gave his \"total endorsement\" of Mehmet Oz — also known as the TV personality \"Dr. Oz\" — and called the latter \"brilliant.\"",
    "\"Trump is trying to insert himself in races all across the country where people he's supporting are crazy,\" the governor told ABC News.",
    "Larry Hogan said on Friday that former President Donald Trump is backing \"crazy\" candidates in the Republican Party's primary races.",
    "In recent weeks, Trump has also taken the position that candidates who rebuke his baseless claims of voter fraud have gone \"woke.\"",
    "\"The primaries are critically important because they are going to determine what the Republican Party looks like,\" Hogan said.",
    "\"The primaries are critically important because they are going to determine what the Republican Party looks like,\" said Hogan.",
    "He has also endorsed Kelly Schulz, the opponent to Trump-backed Dan Cox, as his successor when his term ends in 2023.",
    "And it just bothers me that you have to swear fealty to the 'Dear Leader' or you get kicked out of the party.",
    "\"He lost the White House and the Senate and the House and governors' races and state legislative bodies.",
    "Hogan has previously accused the former president of \"stirring up the insurrection\" on January 6, 2021.",
    "\"I'd like to be able to say, you know, we won all these races — and he lost,\" Hogan told ABC.",
    "Hogan also expressed hope that Trump's ambitions for the elections would meet with failure.",
    "And so that's something that can help us steer things in a better direction.\"",
    "\"And now he's going to lose in 2022 — another round of losses for him.",
    "Larry Hogan slammed Trump during an interview with ABC News this week.",
    "Hogan said that Trump was backing \"crazy\" candidates in GOP primaries.",
    "And what does that foretell about the next election two years later?\"",
    "\"It will tell us how much Trump's influence has waned or not.",
    "Oz is making a run for the US Senate seat in Pennsylvania.",
    "\"They're concerned about being attacked within the party.",
    "It just doesn't make any sense,\" Hogan said in May 2021.",
    "I wouldn't call that being a winner,\" he added.",
    "Has he been diminished?",
    "Maryland GOP Gov.",
    "Republican Gov."
  ]
}