{
  "id": 6032,
  "mediaId": 2718,
  "date": "2022-04-12",
  "headline": "Colbert Mocks Trump’s Endorsement of Dr. Oz: ‘Grandpa Thinks His TV Friends Are His Real Friends’",
  "image": "https://www.thewrap.com/wp-content/uploads/2022/04/maxresdefault-38.jpg",
  "link": "https://www.thewrap.com/colbert-mocks-trump-dr-oz-kid-rock/",
  "mediaOutlet": "The Wrap",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jolie Lash",
  "authorUrl": "https://www.thewrap.com/author/jolie-lashthewrap-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "“In his statement, the former president assured Pennsylvania voters that he was making the endorsement based on his personal experience, writing, ‘I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.",
    "“Late Show” host Stephen Colbert has had fun in his monologue over Dr. Oz’s run for the Senate in Pennsylvania, and he continued that theme on Monday night.",
    "He has lived with us through the screen, and has always been popular, respected and smart,'” Colbert said, quoting the former president’s statement.",
    "“You know, I’ll tell you who should be attorney general: That nice lady from ‘Murder She Wrote.’ She solved all the crimes in Cabot Cove,” he said.",
    "He knows wheels.”\nColbert moved on to another topic, making light of an introduction Trump made for a Kid Rock show via pre-recorded video.",
    "Colbert then lowered his glasses on his nose, and putting on a different voice, pretended to act like a grandfather giving a lecture.",
    "Around the middle of his 10-minute opener, Colbert ripped into former President Donald Trump’s recent endorsement of Mehmet Oz.",
    "“The former President of the United States of America is opening for Kid Rock — on a Wednesday,” Colbert joked.",
    "“Also, when are they going to make Pat Sajak Secretary of Transportation?",
    "“Aww, Grandpa thinks his TV friends are his real friends,” Colbert joked.",
    "Watch his full monologue above.",
    "Then he dropped his punchline."
  ]
}