{
  "id": 6042,
  "mediaId": 8448,
  "date": "2022-04-14",
  "headline": "What Happened Today: April 14, 2022",
  "image": "https://cdn.substack.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fc35fcf3e-3372-4ae0-bfd4-b141c2d3d656_1456x1048.png",
  "link": "https://thedailyscroll.substack.com/p/what-happened-today-april-14-2022?s=r",
  "mediaOutlet": "Tablet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sean P. Cooper",
  "authorUrl": "https://substack.com/profile/117034-sean-p-cooper",
  "termIds": [
    5891,
    4118,
    1394,
    6678
  ],
  "sentences": [
    "Because of “the importance of Feinstein’s ability to govern,” the paper said it agreed to shield the identity of several lawmakers and three former staff members who said in recent interviews that her memory is rapidly deteriorating and that “it appears she can no longer fulfill her job duties without her staff doing much of the work required to represent the nearly 40 million people of California.” In a written response, Feinstein said the past year has been a personally painful and distracting one because of the recent illness and death of her husband, adding, “There’s no question I’m still serving and delivering for the people of California, and I’ll put my record up against anyone’s.” Should Democrats pull off the unlikely victory in the midterm and maintain control of the Senate, Feinstein is designated to become the president pro tempore, which puts her third in line for the presidency.",
    "The first-quarter earning reports are rolling in this week from the biggest U.S. banks, showing significant economic disruption from the war in Ukraine and something of a warning of intense economic volatility from JP Morgan, whose chief executive, Jamie Dimon, told investors that the bank set aside $900 million to prepare for the potential economic disruptions as the war continues, inflation stays up, loan defaults increase, and a possible recession looms on the horizon: “Those are very powerful forces, and those things are going to collide at one point.",
    "The CDC didn’t offer any evidence as to what was significant about this seemingly arbitrary block of time, but White House spokesperson Jen Psaki did tell reporters yesterday that the security directive allowed the CDC “a little bit more time to assess” the potential impact of the Omicron variant that’s seen case levels rise but had little impact on rates of severe illness or hospitalization.",
    "“I am not anti-union,” Shultz said, according to The Wall Street Journal, before explaining that “people who might be voting for a union don’t really understand, let alone the dues they are going to pay.” It was unclear, from his comments, just what it is his employees can’t understand about unions, but they surely understand that unionization efforts are picking up steam.",
    "Last week, on his first day back at work as Starbucks’ CEO, Howard Schultz, who founded the company and is now at its helm in an interim role, announced that he’d be suspending a stock buyback program that would have further enriched his board, and would instead be putting those funds (some $20 billion) toward improving the company’s cafés and supporting its employees.",
    "“Their assessment, from a medical standpoint, a data gathering standpoint, is that two weeks would give them some additional time to do that,” Psaki said, but all that data doesn’t cut it with an increasingly large number of passengers, other officials, and even the airlines themselves, who point to the relaxation of mask mandates across the rest of society.",
    "To bring Amazon’s HQ2 to Arlington, Virginia, the state promised the company $750 million in tax relief, and the details of the deal get at the core of the underlying logic of the growing affordability crisis: To collect its $750 million tax payday, all Amazon has to do is hire at least 37,850 workers at HQ2—who will need 37,850 places to live.",
    "At the federal level, this Clinton-era mixed-income housing initiative, called HOPE VI, displaced an estimated quarter-million people from city centers, the vast majority of whom were African American, by offering grants to tear down public housing in favor of mixed-income housing constructed through public-private partnerships.",
    "“I invested in Twitter as I believe in its potential to be the platform for free speech around the globe, and I believe free speech is a societal imperative for a functioning democracy,” Musk wrote in a letter to a Twitter board member this week, echoing the stakes he laid out today in an interview at this year’s TED conference.",
    "The endorsement comes within days of Oz’s leading challenger, the hedge fund executive David McCormick, going down to Mar-a-Lago for a second time to seek Trump’s backing, in a race that could ultimately decide who controls the Senate and in turn the fate of Biden’s agenda for the remainder of the president’s term in office.",
    "In a tweet, NYU journalism professor Jeff Jarvis compared Musk’s potential takeover to “the last evening in a Berlin nightclub at the twilight of Weimar Germany,” a hysterical conflation of Nazism and free speech advocacy that reveals much more about those in favor of strict content censorship than Musk’s intentions.",
    "… No one knows what’s going to turn out.” Like many international companies whose operations were vulnerable to both Western sanctions against Russia and supply chain disruptions related to the war, JP Morgan took a significant hit to its profits over the past quarter, but that’s not to say it was unprofitable.",
    "McCormick has brought on a slew of former aides in Trump’s White House to the campaign, and his wife, Dina Powell, was Trump’s deputy national security adviser, but those connections weren’t enough, media outlets reported, because of Oz’s strong relationships with Melania Trump and Sean Hannity.",
    "Amazon’s financing of several thousand units of affordable housing may look like a contribution to the overall good of the city, but when you do the math, you see it will end up doing little to offset the negative effect that a hiring surge of high-income workers will have on the housing market.",
    "Apple, Amazon, Google, Meta, and Microsoft did the same in those cities, but together they will spend more than $7 billion over the next few years, an investment roughly 23 times larger than that of the cities and far more than what a city government typically spends on housing in a decade.",
    "One example: In a survey of 1,350 conservative American adults, Greenberg and Harris asked half the group, “Do you think we are spending too little, about the right amount, or too much on national defense and military?” About a third (30%) responded that we are spending too little.",
    "Read More: https://www.clearerthinking.org/post/our-research-shows-how-word-choice-can-have-a-huge-impact-on-survey-results\nBig Tech’s Affordable Housing Fad\nIn 2021, the cities of Washington D.C., San Francisco, and Seattle, put a combined $300 million toward affordable housing.",
    "We haven’t built this kind of housing in the United States since the 1970s, when the Nixon administration put a moratorium on the construction of federally subsidized public housing and instead introduced vouchers for low-income families to use in the private rental market.",
    "All told, the $2.5 billion from Apple, $2 billion from Amazon, $1 billion from each Google and Meta, and $750 million from Microsoft amount to a baffling philanthropic enthusiasm for what has been, for decades, a strategically underfunded social and economic problem.",
    "To fix the American urban affordability crisis caused by the skyrocketing rents and home prices, exorbitantly high construction costs, and inadequate supply of affordable housing in many U.S. cities, Big Tech would need to spend even more than it has thus far.",
    "If Oz goes down, joining other recent Trump endorsees who lost their race, it could be a knock on Trump’s status as a GOP kingmaker and weaken his hold on Pennsylvania, which will be a key state for Trump should he make a bid in 2024 for the White House.",
    "“Having a public platform that is maximally trusted and broadly inclusive is extremely important to the future of civilization.”\nThe bid has rattled advocates of the type of censorship Twitter and other social platforms have deployed in recent years.",
    "In its evaluation of the offer, which represented a 54% premium on the price of the stock the day before his first acquisition, Wall Street seems to think the deal won’t go through, as stocks were trading midday today lower than they were yesterday.",
    "“It makes no sense to require masks on a plane when masks are not recommended in places like restaurants, bars, or crowded sports facilities,” Airlines for America, a trade group representing the largest U.S. airlines, wrote to the CDC yesterday.",
    "The Big Story\nTwitter’s board of directors is currently mulling over Elon Musk’s offer on Wednesday to buy the publicly traded company and take it private, a $43 billion buyout that follows Musk’s recent acquisition of a 9% take in the platform.",
    "This announcement from the Taliban, which comes late in Afghanistan’s growing season, will have little short-term impact—it is unlikely that any of the farmers suffering through the country’s hunger crisis are about to burn their budding crops.",
    "A distorted incentive structure has solidified, with Big Tech and local officials seeing their priorities aligned: Tech sector growth leads to hiring and building, which fills the coffers of local governments through income and property taxes.",
    "Purely public housing provides government-sponsored units to poor and very low-income families, who in turn spend no more than 30% of their income on rent: A family making $20,000 a year, in this system, spends $500 a month on their home.",
    "Currently the richest man in the world, and now Twitter’s largest shareholder after his recent stock haul, Musk has positioned himself as a champion of Twitter’s capacity to become the global public square where free speech reins supreme.",
    "Goldman Sachs beat analysts’ first-quarter estimates by $8 earned per share, and bank stocks across the board are up 26% compared to this time last year, trading now almost at twice the value they were during their COVID-19 pandemic lows.",
    "One of the biggest races in the upcoming midterm election has gotten a little more interesting as former president Trump endorsed the celebrity medical personality Mehmet Oz in the Republican primary for the Pennsylvania senate seat.",
    "Tech companies like Amazon continue to hire—the number of tech workers in the United States is projected to grow by 13% between 2020 and 2030—and companies hastily buy up space and build more offices to accommodate their new workers.",
    "They asked the other half of those surveyed, “Do you think we are spending too little or too much on national defense and military?” This time, 61% said we are spending too little—more than double the percentage of the other half.",
    "More likely is that the Taliban has timed this announcement to allow this year’s crop to get produced while conceding something to the West, in the hopes that the international community might be moved to open up its aid coffers.",
    "This move was largely interpreted as a first volley in his counteroffensive against the unionization push that is occurring at Starbucks locations across the country—at present, eight Starbucks locations have formed unions.",
    "The 88-year-old senior senator from California, Dianne Feinstein, is struggling to remember previous conversations and the identity of those she’s speaking with, according to a new San Francisco Chronicle investigation.",
    "The CDC said yesterday that after 14 months, it was adding two more weeks to its mask mandate order that required the Transportation Security Administration to enforce the masks-on rule for all public systems of travel.",
    "A New York Fed survey captured Americans’ concerns about what that means for them: The number of those surveyed who said they’d be worse off financially a year from now was at the survey’s highest level in nine years.",
    "These private and public programs, then, prioritize the creation of much-needed affordable housing, but not public housing for the poorest Americans, who get entirely priced out of these nominally affordable programs.",
    "See this latest example, a half-million-dollar donation by Reid Hoffman, one of the most prominent donors for the Democratic candidates, to a Republican super PAC dedicated to getting pro-LGBT candidates into office.",
    "A week after his return, Schultz hosted an employee forum during which he announced that the company is getting ready to unveil some new benefits for Starbucks workers—but not those at unionized Starbucks locations.",
    "At Bloomberg, a recent report attempts to at least put a number on the average price of inflation for U.S. households and finds that this year the cost is $5,200 for each house, which breaks down to $433 a month.",
    "In Seattle, for example, developers can take advantage of government incentives to provide “affordable housing” to households earning 80% of the area median income—which amounts to $90,000 for a family of four.",
    "Simultaneously, as the federal government retreated from its responsibility to create new public housing, private developers, nonprofits, and community development corporations used subsidies to fill the void.",
    "While the big banks continue to navigate fantastic returns despite the widespread economic upheaval, the true pocketbook cost of ongoing market turmoil can be hard for working Americans to parse.",
    "Afghanistan exports 80% of the world’s opium supply, and while exact numbers are tough to come by, an estimate of Afghanistan’s opium profits from 2019 is $1.7 billion—8% of the country’s GDP.",
    "But how a Musk-led Twitter would sit with advertisers and affect the platform’s already shaky revenue model is unclear, just as it remains to be seen how Musk would finance the purchase.",
    "For many years, in fact, the problem of affordable housing has been made worse by local officials’ perennial fixation on all forms of construction except that of affordable housing.",
    "Or, at least, it’s not so much divided into red and blue as it is into those who use a particular status quo to maintain and accrue power and those who question the current order.",
    "San Francisco, for example, needs to construct 160,000 affordable homes, according to the National Low Income Housing Coalition, which would cost an estimated $100 trillion.",
    "This is the conclusion of research conducted by Spencer Greenberg, a mathematician, and Clare Harris, an anthropologist, that was recently published at Clearerthinking.org.",
    "In contrast to that Seattle family of four that can rent an “affordable unit” based on AMI, the average household living in public housing nationwide earns $14,693 a year.",
    "In the absence of such construction, supply remains low as demand increases, which drives up prices and ultimately forces families and working people to leave the city.",
    "It’s great if you’re part of the power elite, but everyone who isn’t on Big Tech’s payroll is left watching an increasingly unaffordable city get built all around them.",
    "Sure to make the country’s financial crisis worse, the Taliban has announced that it is banning the production of Afghanistan’s second most valuable commodity: opium.",
    "The 1990s marked yet another shift away from public housing—this time toward “mixed-income” housing, where affordable units were built alongside market-rate units.",
    "Read it here: https://apnews.com/article/elon-musk-twitter-offer-92fe6980cbcfdedea43637ac336c367a\nIn The Back Pages: Big Tech’s Affordable Housing Fad\nThe Rest\n?",
    "And as cities across the country compete for the jobs and tax revenue that tech companies can bring, they entice those companies with lucrative tax incentives.",
    "Reid Hoffman, one of the Democratic Party's biggest donors, gives $500,000 to a Republican super PAC — one that focuses on electing pro-LGBT Republicans.",
    "This could ultimately send more people back into the workforce, which will at least be good news for employers, who continue to struggle to hire staff.",
    "Seattle, per the King County Regional Affordable Housing Taskforce, needs 244,000 affordable units by 2040, with a price tag of roughly $75 trillion.",
    "As high-salaried tech workers come in, that median number goes up, making these “affordable units” less affordable for the lowest-income workers.",
    "This drastically reduced the supply of available affordable options and led to yearslong waitlists for both public housing and the new vouchers.",
    "The authors looked at several surveys on a range of subjects and then repeated those surveys after rephrasing some of the key language used.",
    "That bump has already begun to eat away at the savings many accrued over the pandemic, and undermines the recent increase in wages.",
    "All to say that investors at least appear pessimistic that Twitter will accept what Musk described as his “best and final” offer.",
    "Cities roll out the red carpet for Big Tech because they know these companies bring high-wage earners and their taxable incomes.",
    "At the same time, Musk wants ownership of that very public square, which he sees as imperiled by Twitter’s current management.",
    "Gonzalez surely negotiated for some solid benefits, as she received an $8 million severance package on her way out the door.",
    "The results of surveys with binary response options, it turns out, largely depend on the language of the survey’s questions.",
    "So much so that Schultz fired the company’s top lawyer, Rachel Gonzalez, for failing to fight off the growing union drive.",
    "The two-party system continues to seem like an outdated conception of how power and influence move through our society.",
    "Read more: https://www.bloomberg.com/news/articles/2022-03-29/u-s-households-face-5-200-inflation-tax-this-year-chart\n?",
    "In 2021, Amazon announced that it would hire 25,000 new workers in the Washington, D.C., region over the next 10 years.",
    "The new housing initiatives from Big Tech have been exclusively investing in affordable housing, not public housing.",
    "The two differ in key ways, but primarily in that affordable housing is tied to a region’s area median income (AMI).",
    "These expansions are not only approved by city and state officials but are desperately sought out by them.",
    "But they haven’t gotten much help from governments in keeping their host cities hospitable for workers.",
    "Indeed, the board could simply reject the offer because it doesn’t like how Musk has packaged the deal.",
    "Read more: https://www.sfchronicle.com/politics/article/dianne-feinstein-senate-17079487.php\n?",
    "Valerie Stahl is an Assistant Professor of City Planning at San Diego State University.",
    "The authors concluded that the wording of surveys can change the results drastically.",
    "They rely, after all, on a local workforce to support their sprawling operations.",
    "Affordable housing provisions operate in a number of ways in the United States.",
    "American Unity PAC was launched originally by GOP mega-donor Paul Singer.",
    "The companies of Silicon Valley have taken note.",
    "Do you (a) dislike surveys or (b) despise them?",
    "David Sugarman is a writer and teacher.",
    "Follow her on twitter @ValerieEStahl.",
    "You can follow him @David_Sugarman_.",
    "And not a month?",
    "Or three weeks?",
    "Why two weeks?",
    "Interesting.",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}