{
  "id": 6781,
  "mediaId": 8449,
  "date": "2022-04-12",
  "headline": "Trump respalda a Dr. Oz en la carrera primarista del Senado",
  "image": "https://media.telemundo62.com/2019/09/trump-oz-photo.jpg?quality=85&strip=all&fit=1200%2C675",
  "link": "https://www.telemundo62.com/noticias/decision/local-decision/trump-respalda-a-dr-oz-en-la-carrera-primarista-del-senado/2206164/",
  "mediaOutlet": "telemundo62.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4958,
    2765,
    2802,
    1489,
    6116
  ],
  "sentences": [
    "Oz es uno de los siete candidatos republicanos que se postulan para uno de los escaños del Senado de los Estados Unidos de Pensilvania luego del anuncio del actual senador republicano Pat Toomey en octubre de 2020 de que no se postularía para un tercer mandato.",
    "En un comunicado, Trump describió a Oz como \"pro-vida, muy fuerte en el crimen, la frontera, el fraude electoral, nuestro gran ejército y nuestros veteranos, recortes de impuestos\" y como alguien que \"siempre lucharía y apoyaría a nuestra Segunda Enmienda.\"",
    "Oz valoró sus activos entre $104 millones y $422 millones, según un conteo de The Philadelphia Inquirer, un rango amplio que es el resultado de la solicitud del Senado de que cada activo se valore dentro de un determinado rango de dólares.",
    "El miércoles, Oz presentó un formulario de divulgación financiera requerido para todos los candidatos al Senado que cuenta una larga lista de inversiones: más de 400 cuentas individuales, empresas o participaciones.",
    "“Quizás lo más importante, creo que Mehmet Oz será el más capaz de ganar las elecciones generales contra un demócrata de izquierda radical que busca causar un daño impensable a nuestro país”, escribió Trump.",
    "Después de mucha especulación sobre a qué candidato republicano apoyaría, el expresidente Donald Trump anunció el sábado que respaldará al Dr. Mehmet Oz en las primarias del Senado de Pensilvania.",
    "Los expertos aseguran que las elecciones del ocho de noviembre de 2022 en Pensilvania jugarán un papel clave para determinar si los demócratas o los republicanos controlarán el Senado en 2023.",
    "Trump había respaldado previamente a Sean Parnell en la carrera, pero Parnell retiró su candidatura en medio de acusaciones de abuso por parte de su esposa de quien está separado.",
    "Oz estaba compitiendo por el respaldo de Trump contra McCormick, un exdirector ejecutivo de fondos de cobertura cuya esposa, Dina Powell, sirvió en la administración de Trump.",
    "Antes de su carrera en la política, Oz era mejor conocido como un célebre cirujano cardíaco y presentador del programa de televisión diurno \"The Dr. Oz Show\".",
    "Decisión Local\nEl 30 de noviembre de 2021, Oz anunció que participaría en la carrera por el Senado de los Estados Unidos en Pensilvania como republicano.",
    "Además, dijo en una entrevista radial la semana pasada que estaba cerca de tomar una decisión, pero que aún no se había decidido.",
    "Sus oponentes republicanos incluyen a Kathy Barnette, Jeff Bartos, George Bochetto, Sean Gale, David McCormick y Carla Sands.",
    "De ser elegido, sería uno de los miembros más ricos del Senado, y posiblemente el más rico.",
    "En un tuit el sábado por la noche, Oz agradeció a Trump por su apoyo.",
    "\"Me gusta el hombre\", dijo sobre Oz, \"así que veremos qué pasa\"."
  ]
}