{
  "id": 7146,
  "mediaId": 2718,
  "date": "2022-04-07",
  "headline": "Dr. Oz Was Paid $269,000 for His 2-Week ‘Jeopardy!’ Guest Hosting Gig",
  "image": "https://www.thewrap.com/wp-content/uploads/2021/12/Doctor-Oz.jpg",
  "link": "https://www.thewrap.com/dr-oz-guest-hosting-jeopardy-salary/",
  "mediaOutlet": "The Wrap",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Natalie Oganesyan",
  "authorUrl": "https://www.thewrap.com/author/natalie-oganesyanthewrap-com/",
  "termIds": [
    2802,
    43,
    799,
    6678
  ],
  "sentences": [
    "The cardiothoracic surgeon-turned-TV personality announced his run for office in late November last year as part of a crowded pool of candidates looking to fill retiring Sen. Pat Toomey’s seat, writing on his website, “Today, America’s heartbeat is in a code red in need of a defibrillator to shock it back to life.”\nOther notable figures include a $2 million salary for “The Dr. Oz Show,” along with more than $7 million in ownership interest from Oz Media.",
    "While Oz leaned heavily on his medical and media background for his political run, he has faced scrutiny for previous unsound promotions of “alternative and complementary medicine.” In April 2021, he faced backlash for advocating for school reopenings, which he said may only cost “2 to 3 % in terms of mortality” and “might be a tradeoff” worth considering.",
    "He later apologized, saying he “misspoke.”\nOz’s long-standing controversial status in the medical community led many “Jeopardy!” fans to call for his removal from guest hosting, citing his “dangerous medical misinformation for profit” regarding COVID-19.",
    "Dr. Mehmet Oz was paid roughly $269,000 for a 2-week guest hosting stint on “Jeopardy!,” according to financial disclosure filings he made as a prospective Republican Senate candidate in Pennsylvania.",
    "The researcher also has assets totaling in the tens of millions, including stocks in Amazon and Microsoft, as well as various real estate holdings and LLCs.",
    "He’s gone over to the dark side,” Joy Behar asked, referencing the surgeon’s “America-first, Make America Great Again conservative” ideology.",
    "He also received more than $330,000 in royalties from Columbia University for his part in developing the cardiovascular device MitraClip.",
    "Oz also owns a cattle farm, which he purchased in December of last year.",
    "“The View” hosts were similarly baffled by Oz’s political run.",
    "The payment was directed toward an undisclosed charity.",
    "“What happened to him?"
  ]
}