{
  "id": 7185,
  "mediaId": 2570,
  "date": "2022-04-01",
  "headline": "Biden White House Dropping Dr. Oz And Hershel Walker From Sports And Fitness Council Is A Healthy Move",
  "image": "",
  "link": "https://www.forbes.com/sites/leeigel/2022/04/01/biden-white-house-dropping-dr-oz-and-hershel-walker-from-sports-and-fitness-council-is-a-healthy-move/?sh=6744520320b5",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lee Igel",
  "authorUrl": "https://www.forbes.com/sites/leeigel/",
  "termIds": [
    0
  ],
  "sentences": [
    "(When Ted Kennedy was playing for Harvard's football team in 1955, the future U.S. senator responded to being told that he could go pro by saying he planned to attend law school and “go into another contact sport—politics.”)\nOne month into his presidency, Kennedy reorganized the President's Council on Youth Fitness.",
    "If that were ever really the case, events over the past several weeks—diplomatic boycotts of the Beijing Olympic Games, international governing bodies suspending Russian athletes and teams from competition due to doping and to the war in Ukraine—are upending that notion.",
    "The rise of the business-oriented, “pay-to-play model” has spurred a $20-billion-plus industry for participation among sets of players, parents, coaches, and trainers, and encouraged competition among investors, venue operators, and tourism hubs.",
    "Eisenhower, a former member of the U.S. Military Academy football team and commanding general of the Allied forces in Europe during World War II before being elected president, knew well about promoting health among the nation's youth.",
    "But supporting physical education, emotional wellbeing, and the overall health of the nation—especially its youth post-Covid pandemic—are surely important considerations for government administrations over the long-run.",
    "Both were appointed to the council by former President Donald Trump—Biden's rival in the most recent presidential campaign—and both are running for political offices on tickets that challenge Biden and his party.",
    "Walker is known in the public eye for his athletic career, having first starred as running back for the University of Georgia football team and then taking to the professional ranks in both the USFL and NFL.",
    "Before long, though, medical professionals and lawmakers were taking him to task for using the program to shill questionable interventions, misinformation, and quack products that endanger public health.",
    "But it's a dangerous slope when politics overtake sports in ways that diminish the positive roles and impacts that sports can have on people and communities, especially a nation's youth.",
    "They were influential in his upbringing; the same went for his siblings, who would later be instrumental in efforts that led to creating the Special Olympics and advancing Title IX.",
    "Arnold Schwarzenegger, the bodybuilder-turned-Hollywood-superhero, was appointed to the council years before the campaign that led him to being elected governor of California.",
    "But both Oz and Walker say it has more to do with playing politics, seeing as they are running on Republican tickets and the request is coming from a Democrat administration.",
    "That led to opportunities including a show of his own, which would end up attracting four-million daily viewers and guests ranging from Michelle Obama to Donald Trump.",
    "The Biden administration recently sent letters to Oz and Walker, informing them that they would need to resign from their posts or be removed anyway.",
    "The disruption is rapidly displacing the community-based youth sports model that was traditional to the U.S. and familiar around most of the world.",
    "The reasoning is that their status as candidates for seats in the U.S. Senate conflicts with advisory roles on the federal government council.",
    "He picked up the habit in his youth, from reading books and wanting to overcome bullying for being overweight and having a speech impediment.",
    "In fact, politics have been a part of the game since Dwight D. Eisenhower established the President's Council on Youth Fitness in 1956.",
    "His experiences developing physical health and managing mental health challenges have been part of his public message over the years.",
    "It has, at the same time, discouraged many who feel they can't meet the financial or developmental cut from being involved in sport.",
    "But broader disputes about the meaning of “fitness” and concerns about the reach of government-ordered programs hobbled the effort.",
    "No small part of his notoriety owes to a workout regimen that still includes performing 1,500 push-ups and 3,000 sit-ups each day.",
    "And Oz and Walker are carrying enough baggage to make their dismissal stand on the merits, not just their political aspirations.",
    "By Arthur L. Caplan & Lee H. Igel\nJoe Biden is reshuffling the roster of the President’s Council on Sports, Fitness & Nutrition.",
    "Who and what influences gym class activities across the country usually doesn't rise to the top of a president's daily agenda.",
    "There are weightier matters on the president's mind, like Russia's invasion of Ukraine and rising inflation at home.",
    "He first gained popularity through appearances as a health expert on Oprah Winfrey's top-rated television talk show.",
    "Oz used the platform to promote good habits, such as healthy eating, regular exercise, and annual flu vaccinations.",
    "He tapped Charles “Bud” Wilkinson, the well-known University of Oklahoma football coach, to be its new director.",
    "But its focus on addressing and promoting national health and fitness issues has generally remained intact.",
    "He, too, however, has been tied to quack therapists, as well as a history of domestic abuse incidents.",
    "So, too, has its way of being filled with popular figures from sports, fitness, health, and wellness.",
    "Appointment of celebrities to a government council have political interests in mind almost as a rule.",
    "But there usually isn't an issue as long as the person doesn't clearly enter the political fray.",
    "This isn't the first time that politics has crossed up the council's focus on sports and health.",
    "Oz is an Ivy League-educated cardiothoracic surgeon who became a controversial media celebrity.",
    "Is this a case of politicians using sports and the nation's health to settle political scores?",
    "Offloading kooks, cranks, abusers, and proponents of ideas that harm rather than help is not.",
    "There are also implications for the debate that sports is supposed to be free of politics.",
    "This also brings up implications for the U.S. youth sports landscape, in particular.",
    "Two current members are being cut from the squad: Dr. Mehmet Oz and Hershel Walker.",
    "The President’s Council on Sports, Fitness & Nutrition is not above politics.",
    "Oz and Walker have said they won't step down, leaving Biden to fire them.",
    "Kennedy placed a high value on competitive and recreational sports.",
    "The cases of both Oz and Walker present something different.",
    "Eisenhower had the vision for what the council could do.",
    "Bipartinsanship is a virtue when it comes to sports.",
    "His successor, John F. Kennedy, gave it a shape.",
    "The title of the council has changed over time.",
    "It must be navigated with care."
  ]
}