{
  "id": 7481,
  "mediaId": 2663,
  "date": "2022-04-07",
  "headline": "Dr. Oz has grocery store meltdown while buying ingredients for crudité, blames Biden for $6 salsa",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/04/Screen-Shot-2022-04-07-at-12.10.48-PM.png?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/dr-oz-grocery-store-meltdown-buying-ingredients-crudite-blames-biden-6-salsa-20220407",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Graham Gremore",
  "authorUrl": "https://www.queerty.com/author/graham-gremore",
  "termIds": [
    5905,
    4905,
    3497,
    1967,
    2802
  ],
  "sentences": [
    "The TV doctor, who is currently running for U.S. Senate in Pennsylvania despite living in New Jersey, is being widely ridiculed on social media after posting a video of himself inside a grocery store buying ingredients for crudité and complaining about the prices, which he says President Biden is responsible for.",
    "pic.twitter.com/8kNil6upn8\n— Dr. Mehmet Oz (@DrOz) April 6, 2022\nOz posted the video shortly after his campaign released his most recent financial disclosure statement that lists his wealth at more than $400 million, which would make him one of the wealthiest Senators if elected (God forbid).",
    "https://t.co/7r1avZDHJx\n— (((DonnaZimmerman))) (@donna_zimmerman) April 7, 2022\nThis guy is roaming around a New Jersey grocery store (where he lives, not Pennsylvania) without a shopping cart complaining about the price of salsa.",
    "(@KylaInTheBurgh) April 6, 2022\nHe don’t even know that there are carts for groceries shopping pic.twitter.com/NAgW3OyBRY\n— Serge Lan (@sergelan1973) April 6, 2022\nThat particular salsa is awful, btw.",
    "pic.twitter.com/YVffpkJG3M\n— mamacita (@mamacta7) April 7, 2022\n“I haven’t been to the grocery store myself in 15 years, but I’m going to today, and boy am I going to tuck my shirt into my pants.",
    "Related: Dr. Oz is running a more abysmal campaign than Caitlyn Jenner did, if that’s even possible\nThis is just the latest embarrassing thing to happen to the cardiologist on the campaign trail.",
    "Now, the responses to Dr. Oz’s grocery store meltdown…\nCardiac surgeon and tv host living in these two mansions complaining about spending $20 on vegetables is priceless.",
    "In January, he was widely ridiculed for posting a video of himself incorrectly performing a blood pressure check on a man at the Pennsylvania Farm Show.",
    "— CK (@HRCDemocrat) April 6, 2022\nI’m sure he just dumped it all on a shelf for someone else to put back, after they stopped filming.",
    "This was shortly after his wife, Lisa, was caught cursing out a reporter without realizing she was still on the phone.",
    "This is probably the first time you ever stepped foot in a grocery store & it was to make some stupid shit like this?",
    "“I’m doing some grocery shopping,” Oz, wearing a navy cotton henley tucked into black dress pants, says.",
    "I’m going to tuck them in good!”\n— Aaron Masser (@aaronmasser) April 6, 2022\nWho says ‘A’ broccoli?",
    "Your outfit alone is reason enough for you to get the hell out of PA. You don’t even live here!",
    "Except he’s not actually just like them… as evidenced by his recent trip to the grocery store.",
    "(@Lily_61Warren) April 7, 2022\nHere in PA we simple folk call it a veggie platter.",
    "We got Joe Biden to thank for this.”\nInflation is hurting American families.",
    "Under Joe Biden, gas prices are skyrocketing and food prices are rising.",
    "(@ace_maddie) April 6, 2022\nClearly you don’t know how to shop.",
    "Try using a basket next time, it’s what the simple folk do.",
    "That’s four more dollars.”\n“That’s $10 of vegetables there!",
    "BTW, if wife sent you out to the store, who’s filming?",
    "Dr. Oz wants voters to know that he’s just like them!",
    "Well, that’s a ton of broccoli there,” he continues.",
    "“My wife wants some vegetables for crudité.",
    "I just got all the same stuff for ~$10.",
    "Don’t be lazy, make your own guac dude.",
    "“I’m at Wegner’s”\n(He means Wegman’s.)",
    "And this doesn’t include the tequila.",
    "We must stop the reckless spending.",
    "She loves salsa, yeah, salsa there.",
    "This video is so damn embarrassing.",
    "(@dmol79) April 7, 2022\nHahahah.",
    "And then we need some guacamole.",
    "Ew\n— Kyla In The Burgh ???????",
    "Guys, that’s $20 for crudite!",
    "Must be a shortage of salsa.",
    "(@ace_maddie) April 6, 2022",
    "I mean, that’s outrageous!",
    "“There’s some asparagus.",
    "So, here’s a broccoli.",
    "This is outrageous!",
    "Thanks a lot, Joe.",
    "Dr. Oz is a fraud.",
    "That’s two bucks.",
    "That’s $4 more!",
    "— DawnO ??????",
    "— Yinzer_Girl!",
    "— Yinzer_Girl!",
    "— Debbie J.",
    "That’s $4.",
    "Carrots.",
    "Right?",
    "$6?"
  ]
}