{
  "id": 7737,
  "mediaId": 2570,
  "date": "2022-04-08",
  "headline": "Checks & Imbalances: Big Oil, Big Tech And Big Fines",
  "image": "",
  "link": "https://www.forbes.com/sites/zacheverson/2022/04/08/checks--imbalances-big-oil-big-tech-and-big-fines/?sh=33c3b3d619df",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zach Everson",
  "authorUrl": "https://www.forbes.com/sites/zacheverson/",
  "termIds": [
    0
  ],
  "sentences": [
    "He was elected to improve businesses, jobs, and the economy - but now he's personally betting against that.” (Twitter/congresstrading.com)\n“Koch group says U.S. should deliver partial ‘victory’ to Russia in Ukraine” (Popular Information)\n“House Judiciary delves into FARA in first dedicated hearing in 30 years” (Politico)\n“House Democrats weigh stronger response to Justice Thomas conflict of interest accusations” (NBC News)\n“First look: Senate GOP campaign arm raises $43 million in Q1” (Axios)\n“Democratic incumbents facing off in Michigan’s 11th Congressional District are raising big money” (OpenSecrets)\n“China used TV, TikTok stars in discreet Olympics campaign” (The Associated Press)\n“House members spend more of their funds on security” (LegiStorm)\n“Former congressional aide pleads guilty to theft through bonuses, inflated salary” (The Hill)\n“Spotted at a trade policy event at Akin Gump Strauss Hauer & Feld’s Capitol Hill office, per a Politico Influence tipster: House Ways and Means Trade Subcommittee ranking member Adrian Smith (R-Neb.",
    "N.Y. Attorney General Asks Court To Hold Trump In Contempt, Fine Him $10,000 A Day Until He Turns Over Records\n“New York Attorney General Letitia James asked a judge on Thursday to hold former President Donald Trump in contempt of court for refusing to comply with a subpoena in her investigation into the Trump Organization’s business practices—and to fine him $10,000 per day until he turns over the documents,” reports Anna Kaplan for Forbes:\nThe attorney general’s office wrote in a motion that Trump “did not comply at all” with a court order to turn over documents requested in the subpoena by March 31.",
    "), Reps. Jodey Arrington (R-Texas), Ron Estes (R-Kan.), Carol Miller (R-W.Va.), Darin LaHood (R-Ill.) and Lloyd Smucker (R-Pa.).” (Politico)\nIn Closing\n“I met a man in TexasAnd oh, he was so fine\nAnd I said to myself\nSelf, I'm gonna make him mine\nHe owned a lot of oil wells and his bank roll sure was healthy\nAnd I new if I married him I'd suddenly be wealthy\nOh I'll oil wells love you\nI'll oil wells care\nI'll oil wells need you\nI want you oil wells dear”",
    "James said in a statement Trump evaded a “crystal clear” order to “comply with our subpoena and turn over relevant documents to my office.”\nFEC Collects From Federal Contractors Who Violated Law Barring Political Donation\nLast month, the FEC collected at least $94,000 in civil penalties from companies who violated a law barring federal contractors from making political contributions.",
    "She went on to claim that Oz’s private investment pales in comparison with his primary opponent, former hedge fund executive David McCormick’s, “record of ripping off Pennsylvania taxpayers.”\nOz trails McCormick in Pennsylvania’s Republican Senate primary, according to polls taken by the Philadelphia Inquirer and Washington Free Beacon.",
    "Continuing Irresolutions\nUpdates on Checks & Imbalances’ previous reporting\n“The Federal Election Commission has referred the first of its fines against Amy Kremer’s PAC Women Vote Smart (formerly named Women Vote Trump) to the U.S. Department of Treasury for enforcement and collection,” Rantt Media reported on Wednesday.",
    "It is.” (Statement by Manhattan District Attorney Alvin Bragg)\n“DOJ plans to investigate boxes of records taken to Trump’s Mar-a-Lago” (The Washington Post)\n“False election claims dominate party for Trump, allies at Mar-a-Lago” (The Washington Post)\nEditor's Picks\n“Senator Carper just reported heavily shorting the market.",
    "Tracking Trump\n“In recent weeks, the Manhattan District Attorney’s Office has been repeatedly asked whether our investigation concerning former President Donald J. Trump, the Trump Organization, and its leadership is continuing.",
    "ig oil companies contributed $383,000 in support of the lawmakers questioning their executives at a committee hearing on Wednesday, 97% of which went to Republicans, according to data from the Federal Election Commission.",
    "New York State Judge Arthur F. Engoron ordered Trump in February to comply with James’ subpoena, and also required Trump and two of his children, Donald Trump Jr. and Ivanka Trump, to testify as part of the subpoena.",
    "“I’ve got scars to prove it.”\nOz and his wife also have got at least $10.2 million worth of stock in Alphabet, Amazon, Apple and Microsoft, according to a campaign disclosure he filed Wednesday with the Senate.",
    "PACs for BP America, Chevron, Devon Energy, ExxonMobil, Pioneer Natural Resources, Shell and the American Petroleum Institute, a trade association, have supported 10 of the committee’s 19 members.",
    "The breakdown of the donations to other committee members:\nGoing back to 1975, the PACs for the six companies and the industry trade group have made $46.8 million in political contributions.",
    "Intriguing Investments\nThe Mississippi Republican Party spent $35,000 on legal fees in February, which comprised 60% of its spending that month, according to a report it filed in March.",
    "Today we look at Dr. Oz’s possibly conflicted thoughts on Big Tech as well as the latest developments in the New York attorney general’s investigation into the Trump Organization.",
    "As for earned income, Oz reported receiving $10 million, $2 million of which came from hosting the Dr. Oz Show while another $7 million was from his stake in Oz Media.",
    "He owns at least $5 million worth of shares in Wawa, the Pennsylvania-based gas station and convenience store that’s a bit of an institution in the Mid-Atlantic.",
    "*****\nThe Secret Service police were still maintaining a presence outside of former National Security Advisor John Bolton's suburban D.C. home as of Saturday.",
    "Subcommittee Chair Diana DeGette (D-Colo.) and Rep. Frank Pallone (D-N.J.), chair of the entire committee, have each reported accepting $3,500 from the firms.",
    "Thanks For Reading Checks & Imbalances\nThis is the Thursday, April 7 edition of the Checks & Imbalances newsletter, usually sent Mondays and Thursdays.",
    "Executives from six oil companies are scheduled to testify about gas prices before the House Committee on Energy and Commerce’s sub panel on oversight.",
    "While Oz took flack for running to represent Pennsylvania despite living in New Jersey, his disclosures do reveal a Keystone State connection.",
    "“I’ve gone to battle with Big Tech,” Mehmet Oz, the physician and TV personality, said when announcing his Senate campaign in December.",
    "(The $268,000 he was paid for 11 days of hosting the game show is $94,000 more than what his annual salary would be in the Senate.)",
    "The fees relate to a 2002 court case involving redistricting, said Tate Lewis, the Mississippi GOP’s executive director.",
    "“You can own stocks and still be critical of a company, look at Elon Musk,” said campaign spokesperson, Brittany Yanick.",
    "His appearances on Jeopardy and the app Cameo as well as three speeches raised $347,000, which he donated to charity.",
    "Rep. Cathy McMorris Rodgers (R-Wash.) the largest recipient on the subcommittee, hauled in contributions of $134,000.",
    "The following week office-supply wholesaler TonerQuest Inc. did likewise for $4,700 while 3M paid $4,500.",
    "Oz did pocket the $125,000 he was paid for giving a speech to the American Pistachio Growers Association.",
    "The senior Republican on the panel, Rep. Morgan Griffith of Virginia, comes in second with $97,000.",
    "Big Oil Donated $383,000 To The Lawmakers Grilling Its Executives About Gas Prices.",
    "Iran is plotting to assassinate Bolton, reported the Washington Examiner in March.",
    "He Owns At Least $10 Million In Shares Of Alphabet, Amazon, Apple And Microsoft.",
    "Overall, Oz values his and his wife’s assets at more than $100 million.",
    "The Secret Service has been protecting Bolton since at least January.",
    "The dividends from Wawa alone paid Oz more than $1 million last year.",
    "In Case You Missed It\nDr. Oz Wants To Fight Big Tech In The Senate.",
    "Kremer was an organizer of the Stop the Steal rally on January 6.",
    "On March 10, Marathon Petroleum cut the FEC a check for $85,000.",
    "Please support this work, if you can, by subscribing to Forbes.",
    "Additionally, Oz reported $594,000 in honoraria payments.",
    "PACs for all six firms and API have backed her campaign.",
    "She and her PAC owe at least $20,000 in past-due fines.",
    "Almost All The Contributions Went To Republicans.",
    "To make sure you don’t miss an issue, subscribe.",
    "And you can follow me on Twitter at @z_everson.",
    "Welcome to the Checks & Imbalances newsletter.",
    "Email me at zeverson@forbes.com.",
    "Any tips or suggestions?",
    "Voting ends on May 17.",
    "It’s free.",
    "Thanks!"
  ]
}