{
  "id": 812,
  "mediaId": 6746,
  "date": "2022-02-23",
  "headline": "Dr. Mehmet Oz Says Dr. Anthony Fauci Misleads Americans, Decries COVID-19 Mandates After Chief Adviser Expresses Concern on Taking Off Masks",
  "image": "https://1075914428.rsc.cdn77.org/data/images/full/269203/dr-mehmet-oz-says-dr-anthony-fauci-misleads-americans-decries-covid-19-mandates-after-chief-adviser-expresses-concern-on-taking-off-masks.jpg",
  "link": "https://www.hngn.com/articles/240765/20220223/dr-mehmet-oz-anthony-fauci-misleads-americans-decries-covid-19.htm",
  "mediaOutlet": "hngn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madz Dizon",
  "authorUrl": "https://www.hngn.com/reporters/madz-dizon",
  "termIds": [
    0
  ],
  "sentences": [
    "Read Also: Bill Gates Warns About New Pandemic Amid Weakening of COVID-19: \"It Will Be a Different Pathogen\"\nFauci Urges Not To Lift Mask Mandates Yet\nDr. Anthony Fauci, White House senior medical adviser and director of the National Institute of Allergy and Infectious Diseases, talked on masks in schools on Thursday, saying that lifting requirements on children might be premature and \"risky.\"",
    "He referenced the Biden administration's choice to dismiss criticisms from certain notable public health professionals, notably Food and Drug Administration consultant Dr. Paul Offit, who objected to the proposal that youngsters line up for booster vaccinations.",
    "Dr. Mehmet Oz, one of television's most well-known physicians, who is now running for Senate in Pennsylvania as a Republican, feels that the Biden administration has placed too much emphasis on a vaccine that has failed to deliver on its promises.",
    "According to PennLIVE in Harrisburg, the court ruled that Beam, who took over after previous Pennsylvania Secretary of Health Rachel Levine left for the Biden administration, did not have the authority to require pupils to wear masks at school.",
    "Just days after suggesting that yearly COVID-19 booster injections may not be required for every American, Fauci said on Wednesday that future requirements for further boosters or shots are being reviewed, Fox News reported.",
    "He said, however, that the Biden administration has promoted boosters for those who don't need them, claiming that research doesn't back the notion that young people, for example, should have a third dose.",
    "Oz's earlier advocacy of hydroxychloroquine, an anti-malarial medicine not licensed for use in treating COVID-19, has been cited by critics as an example of what they call promoting baseless claims.",
    "Oz is running for the Republican nomination to succeed departing Sen. Pat Toomey, who is leaving the Senate after 12 years in the chamber in the 2022 election cycle.",
    "Vaccinations, according to Oz, a former cardiothoracic surgeon and long-time TV personality, are beneficial when given appropriately and with the right expectations.",
    "Oz, a former cardiothoracic surgeon, and long-time TV personality said vaccinations are great when administered correctly and with the appropriate expectations.",
    "According to Vice President Kamala Harris' tie-breaking vote, Democrats now have a 50-50 majority in the chamber, according to the Washington Examiner.",
    "States throughout the country are repealing the increasingly controversial mask regulations in public schools, prompting Fauci's remarks.",
    "Everyone above the age of 12 should get a booster vaccine, according to the Centers for Disease Control and Prevention.",
    "Tom Wolf and Acting State Health Secretary Alison Beam was ruled down by the Pennsylvania Supreme Court on Friday.",
    "Other states, such as Pennsylvania, have been involved in court conflicts over the necessity to wear a mask.",
    "Related Article: Several States Drop Mask, Proof of Vaccination Mandates Except to a Lone Place; Here's Why!",
    "Meanwhile, the CDC's drive for masks in schools has been challenged for relying too much on faulty studies.",
    "Masks have been demonstrated to have a detrimental influence on children's social abilities in studies.",
    "In an interview with the Washington Examiner last week, Dr. Mehmet Oz said, \"Fauci has to mislead us.\"",
    "The seat is critical to the GOP's hopes of gaining a Senate majority.",
    "A statewide school mask mandate pushed by Democratic Gov.",
    "Dr. Oz: Fauci Misled Us\n\"Dr.",
    "@YouTube"
  ]
}