{
  "id": 8436,
  "mediaId": 8449,
  "date": "2022-04-08",
  "headline": "Candidato al Senado informa al menos $100 millones en activos",
  "image": "https://media.telemundo62.com/2022/03/107004487-1642769624499-gettyimages-1365957834-ajr_0360_b5209d47-0341-43e2-af07-ea2864b0a279.jpeg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.telemundo62.com/noticias/decision/local-decision/candidato-al-senado-informa-al-menos-100-millones-en-activos/2205630/",
  "mediaOutlet": "telemundo62.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1489,
    1196
  ],
  "sentences": [
    "Antes de renunciar a su carrera en el entretenimiento para postularse para el Senado de los Estados Unidos, Mehmet Oz, el célebre cirujano cardíaco más conocido como el presentador del programa televisivo diurno \"The Dr. Oz Show\", acumuló activos por valor de más de $100 millones, incluidas casas, acciones, seguros de vida y conexiones con el imperio de poda de árboles de sus suegros.",
    "Incluye al menos seis millones en acciones no públicas en la cadena de tiendas de conveniencia Wawa Inc. y al menos cinco millones en acciones no públicas en la agencia de viajes Five Star Travel Corp.\nDecisión Local\nSus decenas de millones de dólares en acciones incluyen millones en acciones de Amazon, Microsoft, Sharecare y la empresa matriz de Google, Alphabet.",
    "Oz presentó el miércoles por la noche un formulario de divulgación financiera requerido para todos los candidatos al Senado que cuenta una larga lista de inversiones (más de 400 cuentas individuales, negocios o propiedades que tienen valor) que respaldan las finanzas de un hombre que ha dicho que invirtió $10 millones en su campaña en Pensilvania.",
    "Oz enumera dos casas en Cliffside Park, Nueva Jersey, con vista a Manhattan, que valora en más de un millón cada una, incluida la que vivió durante un par de décadas antes de decidir postularse para el Senado, más otra casa en los suburbios de Filadelfia valorada en un millón o más.",
    "Otros activos incluyen pólizas de seguro de vida valoradas en millones e intereses en numerosas propiedades comerciales, incluidos apartamentos en la ciudad de Nueva York y propiedades en Tremont Avenue en Boston y en Clearwater Beach Island en Florida.",
    "Oz valoró sus activos entre $104 millones y $422 millones, según un conteo de The Philadelphia Inquirer, un rango amplio que es el resultado de la solicitud del Senado de que cada activo se valore dentro de un determinado rango de dólares.",
    "Para Oz, su presentación muestra al menos $11,5 millones, y posiblemente mucho más, en acciones no públicas en Asplundh, la empresa de poda de árboles propiedad de la familia de su esposa.",
    "También está su casa de vacaciones en Palm Beach, Florida, que Oz valora en cinco millones a $25 millones y una granja de ganado en Okeechobee, Florida, valorada en un millón o más.",
    "Informó que ganó alrededor de $10 millones en 2021, casi todo de su salario como presentador de programas de televisión y la propiedad de la empresa matriz del programa.",
    "Otra candidata rica, Carla Sands, presentó una declaración pública de activos el año pasado, valorando más de 50 cuentas o propiedades entre $35 y $152 millones.",
    "El ex director ejecutivo de fondos de cobertura, David McCormick, aún no ha presentado una declaración financiera.",
    "Oz no es el único multimillonario en el campo de las primarias republicanas en Pensilvania.",
    "De ser elegido, sería uno de los miembros más ricos del Senado, y posiblemente el más rico.",
    "Él pone el valor del ganado en $250,000 a $500,000."
  ]
}