{
  "id": 893,
  "mediaId": 8322,
  "date": "2022-02-11",
  "headline": "'Hannity' on Democrats' panic",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/790d2676-e502-4ea3-b613-afa3dc10f6dd/85408acd-4c22-4308-803d-e2a8ad81700a/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/transcript/hannity-on-democrats-panic",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1708,
    2767,
    4068,
    4905,
    5510,
    4960,
    756,
    392,
    514
  ],
  "sentences": [
    "(BEGIN VIDEO CLIP)\nJOE BIDEN, PRESIDENT OF THE UNITED STATES: I'm going to work like the devil to bring gas prices down which I'm going to work in to make sure that we keep strengthening the supply chains to bring the cost of energy and everything else and the goods that come to America down by helping the ports 24/7, by changing a whole range of things that -- you know, what's happened with COVID, COVID has caused significant increase in prices in the supply chain.",
    "Copyright 2022 VIQ Media Transcription, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of VIQ Media Transcription, Inc. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
    "Why doesn't she say, I'm going to -- I'm going to donate a million, how much can you donate, go around the neighborhood, get some money, build a facility, put in some showers, serve a hot meal a day and put in a couple of drug counselors that can maybe guide people in the right direction, to get off this crap that's going to eventually kill them.",
    "Coming from the ground up, people are fed up with these petty totalitarian government officials, these left-wing Democrats who believe they have the power to control every aspect of your life, to shut down your business, to shut down your kids' schools, to force you to wear a mask, to force you to get a vaccine, to silence your speech.",
    "HANNITY: Do you -- Sean wants to know again, do you understand that because this started here, do you understand the extent that this has reflected on America, that an American convoy is starting that -- that the new people in New Zealand are rising up, that people in Australia --\n(CHEERS)\nCARTER: Sean, I've got to tell you.",
    "I think we're going to retake the Senate also because people are fed up with policies that don't work, and we haven't even touched the disastrous economy, inflation out of control, the chaos at the southern border and the utterly incoherent weakness of foreign policy like everything Biden touches goes to crap.",
    "But she said when it comes to -- you know, students and schools and other congregate settings and transportation, she kind of listed the four or five different things that they're looking at so that we all know it, with a goal towards doing that lifting this mandate by the end of February, beginning of March.",
    "In fact, far left government officials across the border in Ontario they have successfully frozen donations to the truckers in an effort to freeze them out so they can't get fuel for their trucks, so they can have heat inside of their cabins that they sleep in the back of their truck.",
    "And these Canadian truckers are pissed, and they should be pissed because their government leaders think they're rulers and dictators and have the ability to say, if you don't get that make the health care choices that we demand you make, you're out of a job and you're fired.",
    "And by the way, you know, the summer of 2020 when all those riots took place that they ignored, when Democrats fully supported nationwide mostly peaceful protests that killed dozens of people, injured thousands of cops, created billions of property damage, arson and looting.",
    "You have kids pre-kindergarten that have to go through interviews to see if they can get into these elite schools because the New York public school system sucks, and then parents won't speak up because they are afraid the kids won't get in the schools.",
    "And, of course, schools they're saying we need to open the schools back, as soon as -- as soon as possible, and most of the talk about climate change and socialism and new green dealism and -- oh, that's right packing the courts and D.C. statehood.",
    "And they're not teaching them the real values, biblical values, Western civilization, reading and writing in basics which you can find -- as Rachel said, in Christian classical schools, in classical Catholic schools, if you have to home school.",
    "If you see someone going down the street in their car and it's a mess and there's a broken window and there's foil over it, they're using a coat hanger for an antenna, and there's fast food on the dash, don't you just go that person's a mess?",
    "Our very own Chad Pergram is reporting that the concern is now growing in Washington among lawmakers about a coordinated trucker convoy going to D.C., and as support for the freedom convoy grows, liberals -- well, they're losing their minds.",
    "Sean, I got to tell you, I spent the day with a lot of the families, a lot of the truckers in the convoy just outside of Ottawa as they prepared to convoy from where they were at, a small town just outside here, towards the city.",
    "That's the point and the point is, if they really cared -- oh, we're going to throw billions of taxpayer dollars in this program and that program, when it's there -- it's right in their neighborhood, and they don't lift a finger.",
    "ADAM CAROLLA, HOST OF \"THE ADAM CAROLLA SHOW\": Well, first thing, I guarantee that Nancy Pelosi's double-wide, sub-zero refrigerator is worth more than all the belongings that all the homeless people have in her entire district.",
    "We make it that, OK, you learn the basics, reading, writing, math, science, history and if you want your kids in a sex-ed class with pizza toppings, you parents get to choose to opt in, the parents get to choose, is that fair?",
    "REP. ALEXANDRIA OCASIO-CORTEZ (D-NY): One that I'm actively engaged in in advocacy for is the reduction of really truly talking about the reduction of our NYPD budget and defunding a six billion dollar NYPD budget.",
    "UNIDENTIFIED MALE: Sean, seeing that you're a Rangers fan, why don't you see if you can get Ron MacLean, Kelly Hrudey, Wayne Gretzky, Sidney Crosby, all these guys that we supported all our lives to support us.",
    "I think that is a little bit frustrating when you hear some of the rhetoric that's being spread around and the rumors that have been going around about us and his opinion --\nCARTER: Sean has a question -- Sean.",
    "Now I don't believe the Biden administration when they're going to spend $30 million, they said oh we're not buying the crack pipes, but the program originally said that in fact they were, along with syringes.",
    "The pain is obviously hurting the poor and the middle class in the country the hardest, and Obama's own economic adviser, Lawrence Summers, he sees a full-blown recession in his crystal ball is on its way.",
    "Now, when you think it can't get any worse at the White House, think again, because Joe Biden is probably -- I'm not trying to be rude here, but one of the dumbest least capable presidents we've ever had.",
    "CRUZ: So they don't, and there's a pattern we're seeing of petty authoritarian government leaders enlisting their buddies in big tech to silence dissent, to -- they can't defend their views on the merits.",
    "You went to a football game, you know, when it really hit a moment was when they were chanting \"F Joe Biden\" at the New England Patriots in Boston, and just spontaneously football fans are frustrated.",
    "Joe Biden literally has once again made us dependent on energy, the lifeblood of our economy, killed the XL -- Keystone XL pipeline, restricted oil and gas drilling all over, and exploration all over.",
    "REP. ILHAN OMAR (D-MN): This model of saying not only do we need to defund but we need to dismantle and start anew allows us to really re-imagine what public safety should look like in our community.",
    "Even Beto Bozo Francis O'Rourke who vowed to confiscate guns -- damn right we're going to take your guns in Texas, as late as 2021, he's now vowing to protect and cherish the Second Amendment.",
    "They're only changing their opinions because of politics and they love their power that is more important than anything else even for example compromising every so-called principle they have.",
    "Now, Chuck Schumer is terrified of a primary challenge from Alexandria Ocasio-Cortez is ready, willing to ram through any spending proposal no matter how large, no matter how irresponsible.",
    "Now, I don't know about you, but I don't want to aid and abet in somebody's suicide, because if you're smoking meth, you smoking crack, you're shooting heroin, you're committing suicide.",
    "If you send your kids to a public school or woke private schools, all you're going to do is spend your time either fighting school board or deprogramming your kids at dinner every night.",
    "And so, Jen Paki at the White House calls on Spotify -- just take Rogan down, silence him because we don't want the people hearing something that that we, the autocrats, didn't approve.",
    "There's people downtown running around with empty jerry cans tied around their necks with police chasing them all over the place, just for the pure enjoyment of trying to trip those up.",
    "MAT MCKENZIE, CANADIAN TRUCKER PROTESTING IN OTTAWA: I think it's wonderful to see and I think it took strong Canadians to get this movement moving and I think it's spread worldwide.",
    "And get this, a new study from a senior economist at Moody's found the average American household is now spending an additional 276 bucks a month because of record-setting inflation.",
    "(BEGIN VIDEO CLIP)\nRANDI WEINGARTEN, PRESIDENT, AMERICAN FEDERATION OF TEACHERS: The one governor who I think is doing it absolutely the right way was Governor Hochul in New York.",
    "I have many, many friends who say in their elementary schools, their kids are being taught the gender bread man as a way of explaining the fake science frankly of gender fluidity.",
    "The assignment included a number of disturbing instructions where students were encouraged to use their favorite and least favorite toppings to represent their sexual preferences.",
    "(BEGIN VIDEO CLIP)\nREP. AYANNA PRESSLEY (D-MA): Yes, I support the defund movement because this is about the investment in our communities which have historically been divested.",
    "Los Angeles, Venice Beach, California, San Francisco, when you see the homeless population and you see the mess that's outside, doesn't that just mean the whole city's a mess?",
    "This is a rank-and-file school district which could go either direction, which they thought it was okay to assign something like this or a revised version of it for our kids.",
    "(END VIDEO CLIP)\nHANNITY: Yeah, this is the guy that said we had all the leverage against the Taliban and abandoned Americans there, and nobody talks about it but this show.",
    "Nancy Pelosi lives in a gated community, rich, wealthy community, and then one mile from her house is where all the homeless people congregate, shoot up and all that stuff.",
    "We ran out of monoclonal antibodies and the antivirals you have told me and every doctor I know has told me that they would be very effective if we had them in our arsenal.",
    "On Tuesday, following widespread backlash over the outrageous assignment, the school superintendent was forced to admit that it was a mistake during a school board meeting.",
    "This is not like I'm hoping that if in fact he's foolish enough to go in, he's smart enough not to in fact do anything that would negatively impact on American citizens.",
    "HANNITY: Yeah, because the John Hopkins study said everything that they did do not only didn't work but was harmful and should never ever be considered again as policy.",
    "And it's --\nHANNITY: Let me ask you this --\nCRUZ: It's abusive but at the same time, it's powerful, because it shows they can't defend what they're doing on the merits.",
    "Even your buddy Beto Bozo who you defeated in your Senate race against him, all of a sudden, the guy that wanted to confiscate everybody's guns has changed his mind.",
    "You know, I actually view the Canadian truckers an awful lot like the chants, the \"Let's go Brandon\" chants or how they started, \"F Joe Biden\", which were organic.",
    "Senator, I see this as a moment and it's now gone international -- in Europe, New Zealand, it's coming to America, and it's remained peaceful and I understand why.",
    "No one wears them all day long, there's major issues when they get wet, when if you wear a mask in a three-year-old's mouth all day long, it's not going to be dry.",
    "They don't like Joe Rogan for the same reason they don't like the Canadian truckers, because he's saying things that they can't control, that they disagree with.",
    "I was up in a place called Upper Saint Clarice near Pittsburgh on my Senate campaign, these parents were really angry, so angry they changed the school board.",
    "HANNITY: Why -- if Nancy Pelosi, one mile from her office in one direction one mile from her home in the other direction and she lives with all millionaires.",
    "And now, there are reports that the Department of Homeland Security is warning that an American trucker convoy could start this weekend at the Super Bowl.",
    "But Manchin is literally stopping his own party from completely destroying the economy, which there are -- just kind of on the verge of collapse as it is.",
    "So, parents try to escape failing public schools and they pay a bunch of money and they go through interviews and applications to give their kids status.",
    "He really went far, where he's greeted by large crowds of protesters including one man with a very special sign that reads, quote, build crack better.",
    "(END VIDEO CLIP)\nHANNITY: Even fake news CNN says nearly 60 percent of Americans think Joe Biden has done absolutely nothing right, nothing at all.",
    "UNIDENTIFIED MALE: You know, they come at us with the jerry cans downtown, you're not allowed to touch a jerry can, you could be arrested with it.",
    "Here with reaction, author of the new book, \"Everything Reminds Me of Something,\" which by the way you can now get on amazon.com, adamcarola.com.",
    "Charities now reportedly are asking people to open their doors, open -- openly welcome their homeless right into their homes to live with them.",
    "But on a serious note, the idea liberal -- I always say liberals are generous with other people's money, and they don't put up their own money.",
    "To that end, a brand new bulletin from Biden's DHS warns that anyone who spreads misinformation about the U.S. government might be a terrorist.",
    "KAMALA HARRIS, VICE PRESIDENT OF THE UNITED STATES: You know, in many cities in America, over one-third of their city budget goes to police.",
    "It is, quote, draining the hard-earned wages on every American and it's causing real and severe economic pain that can no longer be ignored.",
    "As you noted, on Sunday, I sent a letter to the Federal Trade Commission asking them to investigate GoFundMe for deceptive trade practices.",
    "Then we'll go neighbor to neighbor to neighbor inside her gated mansion and see how many of her neighbors adopt one of the homeless people.",
    "Anyway, coming up, fueled by radical far-left policies, the homelessness crisis continues to spiral out of control in our nation's cities.",
    "In case you're wondering, Biden's plan to curb inflation was to spend $3 trillion that in real money was over $5 trillion, and guess what?",
    "HANNITY: Yeah, but the problem is even very expensive, hard to get into private schools in New York, for example, I mean, it's like a war.",
    "As I said, I grew up in a family where the price of the pump went up, you filled it, and I understand, but these things are necessities.",
    "Okay, like almost every other idiotic plan pushed by Democrats in the last three years, all the results on this have been catastrophic.",
    "San Francisco's adult assistant program actually does give eligible adults 620 bucks per month plus a free transit pass and much more.",
    "On top of that, he gets -- let's see -- other benefits, free transit passes, a state ID, career counseling, mental health counseling.",
    "So, I mean -- I do want to say though, I do have to -- I do have to thank the, man, though because of the unity he's brought Canada.",
    "In other words, if you dare to disagree with the administration, you might be labeled a domestic terrorist by Mayorkas and his DHS.",
    "As \"MarketWatch\" put it, quote, high inflation has jacked up the cost of food, gas, cars, rent, and there's little relief in sight.",
    "And we are encouraging them to choose their topping based on not just their sexual preference but their preferred sexual activity.",
    "And never forget, it was Biden along with his many Democratic colleagues who called for the police to be defunded and dismantled.",
    "All of a sudden, they're distancing themselves from their own words on defunding, dismantling the police and ending no bail laws.",
    "I mean, when was it that you said, okay, this is it, I'm coming -- I'm joining the convoy, I'm joining Chris and the rest of you?",
    "How do you think the last two weeks have reflected on what's happened in the United States now with the convoy starting up there?",
    "I mean -- I don't know if I'm supposed to say this, but I mean, this country's been under the grasp of a tyrant since he got in.",
    "Joe Biden abandoned Americans in Afghanistan and buckle up, because Biden is about to abandon more Americans abroad in Ukraine.",
    "(BEGIN VIDEO CLIP)\nHOLT: What are your plans toward American citizens who are in Ukraine and might be there during an invasion?",
    "In fact, Americans are paying almost twice as much now to fill up their tanks under Biden than they were under President Trump.",
    "In an effort to rewrite history, many Democrats are now lifting COVID-19 restrictions under the guise the science has changed.",
    "Well, those protests were -- we were told were important part of democracy, even when they were violent and deadly and costly.",
    "So when they are motivated and they want to put on a good face for the world and the country, they will activate and motivate.",
    "Those gas cans -- I was there yesterday when the police went in and took a whole load of gas cans and nothing was happening.",
    "And I've had the opportunity to spend time with all of you here in the city and I've been able to see what's been happening.",
    "CARTER: Did you ever think the truckers that y'all would be like the on the front lines of soldiers for liberty and freedom?",
    "We love our brothers and sisters who've come up here to give their support to us as well, but this is a worldwide movement.",
    "CARTER: Okay, Sean wants to hear from the crowd, how you feel about the gutless, spineless cowardly Prime Minister Trudeau?",
    "So, again, the White House press secretary stands up and says, you know, it's Republicans who wanted to abolish the police.",
    "(LAUGHTER)\nCARTER: I think -- I think you've got a lot of support here and a lot of love, Sean, even you're a Rangers fan.",
    "After spending trillions and trillions and trillions of dollars on handouts, our economy is on fire but not in a good way.",
    "(END VIDEO CLIP)\nHANNITY: Joe's going to work like the devil himself, but just don't ask him any tough questions about it.",
    "CAROLLA: Well, I'm in L.A., and the Super Bowl is coming on Sunday, and they have cleaned -- they cleaned up the homeless.",
    "You can see how they run their city by going outside, but imagine all the other horrible decisions they're making inside.",
    "Still, one powerful teachers union president is demanding that your kids continue to wear masks in school in perpetuity.",
    "They're following the political science and this one-size-fits-all mandate that we've been looking at with masks fails.",
    "The handout went so far as to list two examples, including, quote, olives equal giving oral, and cheese equals kissing.",
    "And I noticed that right after Christmas -- how is it possible they still have not mass-produced all of these things?",
    "And GoFundMe, another big tech company, happily stole about $10 million that had been given to the Canadian truckers.",
    "HANNITY: You have said you believe an investigation is warranted because of GoFundMe, and the idea that --\nCRUZ: Yes.",
    "HANNITY: You know, this guy said in this interview, he gets 200 bucks a month in food stamps, 620 bucks a month cash.",
    "Look at this one homeless man telling author Michael Shellenberger that he actually gets paid to live on the streets.",
    "In case you didn't notice, I just -- I'm wondering ahead of time how much trouble you're going to get me in tonight.",
    "(COMMERCIAL BREAK)\nHANNITY: The freedom convoy of Canadian truckers protesting vaccine mandates is not backing down.",
    "And here's the reality of it, there's -- because of the downsides, we shouldn't be looking at mask mandates anymore.",
    "BIDEN: The last thing you need is an up-armored Humvee coming into a neighborhood, it's like the military invading.",
    "You can't collect $10 million from people for one cause and then just pocket the money and send it where you want.",
    "Tonight, we're learning, 8th graders in one Connecticut two were given an assignment entitled \"pizza and consent\".",
    "Eight graders in one class are asked to share their personal sexual desires by using pizza toppings as a metaphor.",
    "Fifty-six percent of Americans, nearly six in 10 Americans, that means a decent amount of Democrats said nothing.",
    "HANNITY: How is it that after Christmas -- that's when I first noticed -- we had no tests available for anybody?",
    "It takes months to actually tool up, especially when a lot of the equipment is not even made in America anymore.",
    "Fauci and the CDC have got to stop being myopic about masks, about vaccines or they will risk being irrelevant.",
    "For the majority of people here have been warm, welcoming, really standing up for what they believe is freedom.",
    "Don't give up, don't let people portray you as something you're not, and don't let anybody get out of control.",
    "But the liberal Democrats who run cities like San Francisco -- well, they've done nothing to fix the problem.",
    "You can see all the truckers there with her as they continue their protest of the draconian vaccine mandates.",
    "But the changes that are needed to change this rotten system probably won't happen in time to save your kids.",
    "And by the way, it's the exact same thing, Sean, that is happening with the Biden White House and Joe Rogan.",
    "(BEGIN VIDEO CLIP)\nLESTER HOLT, NBC NEWS ANCHOR: Back in July, you said inflation was going to be temporary.",
    "They just do whatever they think will make them popular, increase their political power, get them reelected.",
    "(END VIDEO CLIP)\nHANNITY: Yes, we'll redirect the funding away from the police and police become the enemy.",
    "CAROLLA: Well, maybe Nancy's just for the needle program because she wants to save some money on the Botox.",
    "It's not a mother of three who got fired from a job at the book bindery, and is now living on the streets.",
    "Here with reaction, \"FOX and Friends\" weekend co-hosts Rachel Campos-Duffy and Pete Hegseth, both parents.",
    "UNIDENTIFIED MALE: When you said that San Francisco pays people to be homeless, what did you mean by that?",
    "Now with the midterms fast approaching, Joe's fellow Democrats, they're trying to pull a fast one on you.",
    "But tell them I can't stand their cowardly prime minister, so I stand with them on the important issues.",
    "Adam Carolla is back with us, likely to get us about 400,000 articles written after his last appearance.",
    "Now, all of a sudden, they're pulling back and saying, no, we're going to lift these draconian measures.",
    "But I will say this, these kids can't read, write, do math, science and a little to no American history.",
    "Initially, they said, we're going to redirect it to the causes we like, to our little left-wing causes.",
    "SARA CARTER, FOX NEWS CONTRIBUTOR: Oh, Sean Hannity sends his best, a lot of support from the viewers.",
    "They've told me about their concerns for their own children, but they say they are not going to move.",
    "There is no good respected study that shows meaningful benefit of masks the way they're used by kids.",
    "When we come back, if you are a parent with kids in school, you don't want to miss this next segment.",
    "You're doing it more slowly, but you're killing yourself, and I don't want to assist in your suicide.",
    "Dr. Oz, all right, so the two -- your two worlds are colliding here and that is politicizing OCOVID.",
    "SEN. TED CRUZ (R-TX): I think it is powerful what we're seeing happening with the Canadian truckers.",
    "They are going to continue to make their stand, despite what Prime Minister Justin Trudeau has said.",
    "COVID-19 mandates, all of a sudden, two weeks ago when Republicans were doing it, it was a disaster.",
    "They're watching these convoys build not only in Canada, around the world and even here in the USA.",
    "(END VIDEO CLIP)\nHANNITY: Children are the least likely to get seriously ill or die from COVID-19.",
    "And today, a very frail-looking Joe -- well, he made his way all the way down to central Virginia.",
    "We -- the reality is, Enfield, the school district where this -- this is not a suburb of New York.",
    "Teaching comprehensive queer inclusive pleasure based sex-ed was a highlight of my time teaching.",
    "Now, all of a sudden, they agree with those Republican governors and they are now following suit.",
    "The Biden administration should have six months ago said, we have pretty good data on this stuff.",
    "UNIDENTIFIED MALE: I've been kind of praying for something to happen for a couple years already.",
    "CONGRESSMAN: Americans will -- who own AR-15s, AK-47s, will have to sell them to the government.",
    "So my generic point is that --\nHOST: But can we agree that we can redirect some of the funding?",
    "CAROLLA: No, but I -- they've cleaned up the homeless encampments between LAX and SoFi Stadium.",
    "And the reality is, these kids in most schools, many schools aren't learning the basics, Pete.",
    "Oddly enough, people don't like it when government tries to control every aspect of your life.",
    "Like almost every other Democrat in the country, you got to understand what's happening here.",
    "They're sexualizing our kids to create confusion about identity, just like they do with race.",
    "PETE HEGSETH, CO-HOST OF \"FOX & FRIENDS WEEKEND\": These are 13 years old, Sean, 13 years old.",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: If you're going to be homeless, it's pretty easy here.",
    "(COMMERCIAL BREAK)\nHANNITY: Now, out on the West Coast, crime, homelessness are nothing new.",
    "You know, a lot of the trackers here and their families are concerned about the government.",
    "Breaking today, inflation hit a brand new 40-year high on top of last month's 40-year high.",
    "They just go, we're going to throw more money at it, and it never fixes the actual problem.",
    "They are doing the same thing with sex-ed, which was -- you know, anatomy when I was a kid.",
    "That's a tough number, early in the midterm election year for the president United States.",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: Do you approve of President Biden's job performance?",
    "Send our solidarity, love and -- well, support for all of the brave people that are there.",
    "There's these so- called homeless advocates, experts on homelessness who are always wrong.",
    "Patients were told, just go home and, you know, go to the emergency room if you turn blue.",
    "Now, Democrats -- so all of a sudden now, they were lifting the draconian COVID measures.",
    "But doctors weigh complications as well as best benefits, they customize care for masks.",
    "BIDEN: Well, you're being a wise guy with me a little bit, I understand that's your job.",
    "(COMMERCIAL BREAK)\nHANNITY: Unfortunately, that's all the time we have left for tonight.",
    "CAROLLA: I'm with you and their problem of throwing money at the problem is the problem.",
    "You're going to have to, you know, make financial and all kinds of sacrifices to do it.",
    "During a speech, Biden vowed to work like the devil to get these prices under control.",
    "And calls grow for the very weak cowardly pathetic Justin Trudeau to end all mandates.",
    "TUCKER CARLSON, FOX NEWS HOST: We'll be back tomorrow night and every night, 8:00 p.m.",
    "She lifted the adult mask mandate effective immediately, like the Nevada governor did.",
    "That person doesn't know what they're doing, I wouldn't want them running my business.",
    "I want -- what they think of the gutless, spineless, cowardly Prime Minister Trudeau?",
    "They've realized they're wildly unpopular and so now, they're running away from them.",
    "And certainly, they're trying to claim they were never their policies to begin with.",
    "And what really happened was the federal government replaced the American physician.",
    "Now, if you follow that science, that would mean all of this would end, wouldn't it?",
    "They're concerned about the police taking their private property without any reason.",
    "UNIDENTIFIED MALE: From general assistance or would you -- how was that hard to get?",
    "Only four in 10 Americans, 41 percent at the moment, approve of his job performance.",
    "You know, I'm encouraged by the people fighting, the parents who are going in there.",
    "And tonight, our live coverage from the freedom convoy in Ottawa, Canada continues.",
    "(END VIDEO CLIP)\nHANNITY: Hell yes, now we're going to defend the Second Amendment.",
    "And according to \"The Wall Street Journal,\" gas prices will only continue to rise.",
    "These same Democrats are now vilifying the real peaceful freedom convoy in Canada.",
    "Sounds a lot like Facebook, Twitter and news -- and other social media platforms.",
    "Anyway, Sara Carter, as you can see, is having a good old time with the truckers.",
    "Now, Joe is steering the country right off a cliff abroad and right here at home.",
    "Then the outcry became so great, they said, oh, no, we'll just refund the money.",
    "Dr. Oz, who I am supporting for the Senate, I'm watching your race very closely.",
    "They only want to say these things to get reelected and care about their power.",
    "HANNITY: Ask them if they care at all that I'm a Rangers and an Islanders fan?",
    "Democrats are pretending that they have nothing to do with the spike in crime.",
    "HOLT: You've told him to that Americans would be a line that they can't cross?",
    "That's a world war, when Americans and Russians start shooting at one another.",
    "The base of the Democratic Party is filled to the brim with actual socialists.",
    "I fully expect our fellow Americans to turn in their AR-15s and their AK- 74s.",
    "I think a lot of Americans are wondering what your definition of temporary is.",
    "Oh, how wonderful would the revise version had been if you hadn't been caught?",
    "The progressives are taking it over from Connecticut to Colorado, they got it.",
    "CAMPOS-DUFFY: No, how about just leaving it up to the parents to teach sex-ed.",
    "In the meantime, let not your heart be troubled, Laura Ingraham takes it away.",
    "The show that's the sworn enemy of lying, pomposity, smugness and groupthink.",
    "What scenarios would you put American troops to rescue and get Americans out?",
    "So in Canada, the government leaders demanded of GoFundMe, cut off the money.",
    "Five percent of kids wear glasses, glasses fog up when you're wearing a mask.",
    "The governor was prevented from passing mandates like this, but guess what?",
    "DR. MEHMET OZ (R), CANDIDATE FOR U.S. SENATE IN PA.: Oh, it's not science.",
    "Adam Carolla will get the show in trouble, coming up, next straight ahead.",
    "We're in a situation now where -- you know, you should have peace of mind.",
    "And my answer to this, and this is my opinion, Sean, is get your kids out.",
    "RACHEL CAMPOS-DUFFY, CO-HOST OF \"FOX & FRIENDS WEEKEND\": It's outrageous.",
    "We ask people, what has President Biden done for you that you approve of?",
    "I mean, if we're going to be realistic, they pay you to be homeless here.",
    "Do they know the extent to which the American people are supporting them?",
    "Even the blue state governors are saying, we got it -- we read the polls.",
    "I'm waiting for them to say, it was Republicans who put mask mandates in.",
    "You know, you think of Canadians -- I mean, what are Canadians known for?",
    "They want to control every aspect of your life and people are sick of it.",
    "So you kind of turned that into almost --\nUNIDENTIFIED MALE: A big joke.",
    "But the reality is liberals are only generous with other people's money.",
    "HANNITY: How about, Rachel, we do this, and we have less than a minute.",
    "HANNITY: Sara, what I want to ask -- I want you to ask the whole crowd.",
    "That's why we got vaccines almost immediately after they were approved.",
    "Schumer is reportedly very angry with his colleague from West Virginia.",
    "He said all I had to do is make a blanking phone call to get the cash.",
    "We've been all about -- we've been all over the critical race theory.",
    "Violent crime is soaring in every major city, and can you believe it?",
    "HANNITY: -- oh, they're just going to take the money or cut them off?",
    "I'm an advocate for my Labrador dog Phil, but I'm not a veterinarian.",
    "CARTER: Do you care at all that he's a Rangers and an Islanders fan?",
    "Our own Sara Carter is live again in Ottawa with the freedom convoy.",
    "We're going to back off of draconian measures --\nHANNITY: All right.",
    "(CROSSTALK)\nOZ: So I'm here thinking about what are you going to do?",
    "We hope you'll set your DVR so you never miss an episode of HANNITY.",
    "HANNITY: I don't think I'm going to look at pizza at same way again.",
    "And I think the reality is that this is what's happening in schools.",
    "Copy: Content and Programming Copyright 2022 Fox News Network, LLC.",
    "I was a real wise ass, Pete, I'd ask, what's your favorite topping?",
    "You couldn't control yourself an entire segment, you just couldn't.",
    "I mean, couldn't we really judge a city by its homeless population?",
    "What I want to make sure that we do is defend the Second Amendment.",
    "CHRIS CUOMO, TV HOST: Are you in fact in favor of gun confiscation?",
    "No amount of smoke and mirrors and flip- flops can change reality.",
    "Residents are now being asked to open their homes to the homeless.",
    "They are now, in evidence, they're going to last far beyond COVID.",
    "They are giving their kids the false values that they don't need.",
    "HANNITY: I don't know, I think --\nHEGSETH: -- the Democrat camp.",
    "All of a sudden, the polls show the American people have had it.",
    "I think it's really a reflection of a groundswell that's coming.",
    "I mean, they're just -- they're about this far from saying that.",
    "They know that at this point, they're desperate to say anything.",
    "HANNITY: Did they know the extent -- here's the question I have.",
    "(END VIDEO CLIP)\nCARTER: Sean, I have Mat McKenzie with me here.",
    "They want you to believe that it's totally out of their control.",
    "That we don't have any more socialist build back broke handouts.",
    "I know food prices are up and we're working to bring them down.",
    "Joe Biden, he caused America's terrible 40-year high inflation.",
    "One CNN fake news commentator tweeted today, slash their tires?",
    "So they should go over there and get themselves some dove bars.",
    "The judge is going to decide if their kids get their masks off.",
    "HEGSETH: The miseducation of America on Fox Nation lays it out.",
    "But really think about it this way, Sean, like philosophically.",
    "This is a town which had a Republican town council until 2021.",
    "It's wrong, but the good news is, everybody is fed up with it.",
    "And I want you to take a listen to what they had to say today.",
    "Every day is an adventure, a mind game adventure and it's fun.",
    "(BEGIN VIDEO CLIP)\nCARTER: What drove you to join the convoy?",
    "But apparently, that's not enough for San Francisco liberals.",
    "CARTER: I got to tell you, Sean, I could barely hear you now.",
    "It's about time because the American people have seen enough.",
    "Really excited for the house sex-ed bill hearing later today.",
    "This is not an outright, left wing, lunatic school district.",
    "They just don't do it unless the Super Bowl rolls into town.",
    "This is a rush transcript of \"Hannity\" on February 10, 2022.",
    "Most Democrats don't actually have any firm beliefs at all.",
    "HANNITY: I'm going to ask the bravest question of all time.",
    "Are they surprised that they're popping up all over Europe?",
    "HANNITY: Obviously, we have a midterm election approaching.",
    "We're going to go ahead and give you the funding for this.",
    "Here with reaction, Pennsylvania Senate candidate, Dr. Oz.",
    "This copy may not be in its final form and may be updated.",
    "Well, look at how bad these numbers are for the president.",
    "But also kids aren't learning to socialize appropriately.",
    "In fact, the science has not changed, but the polls have.",
    "And in return, kids are not learning to speak correctly.",
    "It's even worse, accelerating to 7.5 percent in January.",
    "So we have to have this conversation, what are we doing?",
    "We're in a very different world than we've ever been in.",
    "HOLT: Not even on behalf of simply evacuating Americans.",
    "Now call it what it is and start working on the problem.",
    "The woke indoctrination of nation's students continues.",
    "UNIDENTIFIED MALE: No, this is -- this is like a dream.",
    "Ask them if they care --\nCARTER: Oh, wait, the bravest.",
    "In fact, their far left policies are likely the cause.",
    "Is it politics or is it science, the reason behind it?",
    "I would say that's called an election year conversion.",
    "Number two, really the problem is homeless advocates.",
    "Hell yes, we're going to take your AR-15, your AK-47.",
    "This is what she wrote on Twitter just the other day.",
    "I mean, am I that old-fashioned, stick to the basics?",
    "So --\nOZ: Government authoritarianism does not work.",
    "The teachers union has to acknowledge what you said.",
    "Do you want food stamps and 620 bucks cash a month?",
    "He's been with the convoy since the very beginning.",
    "Sara, a lot of support from our viewers last night.",
    "Joe Biden caused the crisis at the southern border.",
    "They're now trying to rewrite history on this also.",
    "His cognitive decline is precipitous at this point.",
    "By the way, Manchin did him a favor, so did Sinema.",
    "Find a good charter, religious or classical school.",
    "Otherwise, almost the entire system is compromised.",
    "I don't think there is any hope for these systems.",
    "Now, it's sexual preference and sexual activities.",
    "It's that kind of hypocrisy that drives me insane.",
    "I'm not interested in taking anything from anyone.",
    "Are they surprised an American convoy is starting?",
    "Are they surprised one in New Zealand is starting?",
    "When we come back, Sara Carter live on the ground.",
    "And so, they started throwing problems in our way.",
    "We appreciate you being on, as always, thank you.",
    "His truck is parked right in front of parliament.",
    "For all those people there, please send our best.",
    "I mean, nobody had done anything to provoke that.",
    "I like him but I need a professional to help him.",
    "All of a sudden, now all that talk has gone away.",
    "They're trying to turn 180 on almost every issue.",
    "They disapprove of everything that has happened.",
    "Democrat Joe Manchin called it an inflation tax.",
    "(CHEERS)\nHANNITY: I played hockey my whole life.",
    "They said be teaching reading, math and science.",
    "Now, the school district said it was a mistake.",
    "Now, we've got a proposal out of San Francisco.",
    "UNIDENTIFIED MALE: Phone call, bro, phone call.",
    "Okay, I say we start with Nancy Pelosi's house.",
    "In a mile in the other direction is her office.",
    "Like no sentient person believes that nonsense.",
    "Senator Manchin, he's been standing in the way.",
    "Looks to me like the truckers are going to win.",
    "HANNITY: All right, Sara, great job as always.",
    "So --\nCARTER: Well, that's what's interesting.",
    "HEGSETH: You're totally right, no, you're not.",
    "They are grooming and they're indoctrinating.",
    "How do you feel about Prime Minister Trudeau?",
    "(BEGIN VIDEO CLIP)\nBETO O'ROURKE, FORMER U.S.",
    "BIDEN: Well, I didn't have to tell him that.",
    "They're supposed to protecting these people.",
    "That's -- I don't think we have enough time.",
    "You can't find any of these things anywhere.",
    "There are limitations to the value of masks.",
    "So, Pete and I talk all the time about this.",
    "The rest of the Howard Stern show continues.",
    "That's what the assignment was using pizza.",
    "I don't think this is a role of the school.",
    "And they're not experts, they're advocates.",
    "(END VIDEO CLIP)\nHANNITY: Being a wise guy?",
    "CARTER: I'm going to try to remember that.",
    "CARTER: I think you get the message, Sean.",
    "Republicans are going to retake the House.",
    "Listen, I think Pete is 100 percent right.",
    "You think Connecticut, you think New York.",
    "CAMPOS-DUFFY: No, you can't make this up.",
    "There is a state senator in Rhode Island.",
    "That's what the Trump administration did.",
    "It's -- they can't defend their policies.",
    "Why would they have the right to do that?",
    "So they want to use power to shut you up.",
    "Here with more is Texas Senator Ted Cruz.",
    "I mean, Quebec, everybody's together now.",
    "Why isn't she adopting a homeless person?",
    "(END VIDEO CLIP)\nHANNITY: He's not wrong.",
    "I am asking Nancy Pelosi to lead the way.",
    "Nearly six in 10, 58 percent disapproved.",
    "The truckers, they're not going anywhere.",
    "Democrats, they're in a full-blown panic.",
    "And, Matt, I want to ask you a question.",
    "They're known for being polite and nice.",
    "They won't even say what the problem is.",
    "This is what we are doing in 8th grade?",
    "Thank you for making the show possible.",
    "We'll have more HANNITY straight ahead.",
    "I want to know how they feel about him.",
    "Why isn't she cleaning up her backyard?",
    "SEAN HANNITY, FOX NEWS HOST: All right.",
    "I mean, I get 620 bucks a month, dude.",
    "HANNITY: Gutless, spineless, cowardly.",
    "CARTER: What about the prime minister?",
    "That is beyond chilling and dangerous.",
    "And it's -- I think people are fed up.",
    "They're no longer going to benefit us.",
    "Now, the legal profession is involved.",
    "Choose a school that fits your values.",
    "(COMMERCIAL BREAK)\nHANNITY: All right.",
    "These are addicts with mental illness.",
    "We also looked at the signs for once.",
    "November is going to be a tidal wave.",
    "No treatments were given to doctors.",
    "Again, they do not care about truth.",
    "You have to be intentional about it.",
    "I mean, they do it with everything.",
    "She'll check in with us any moment.",
    "HANNITY: Let me ask you about that.",
    "We think we're going to approve it.",
    "UNIDENTIFIED MALE: Forget about it.",
    "And it is now spreading worldwide.",
    "We meant to use a revised version.",
    "And that's not what they're doing.",
    "I can't believe I am saying this.",
    "HANNITY: OK, got to take a break.",
    "They don't care about principles.",
    "That's what they call themselves.",
    "HANNITY: I do, but you know what?",
    "(BOOS)\nCARTER: Did I do it right?",
    "We've turned that into a mockery.",
    "Are those kind of threats legal?",
    "Sara's report is coming up next.",
    "I don't think it can be stopped.",
    "It's not just the United States.",
    "So --\nCROWD: Where are the boys?",
    "Keep it peaceful and you'll win.",
    "Imagine how they run their city.",
    "I think we'll freeze frame that.",
    "But I'll give you the last word.",
    "HANNITY: You can't make this up.",
    "The elite schools are the worst.",
    "HANNITY: Rachel, you have kids.",
    "HANNITY: Pretty much well said.",
    "But they can't rewrite history.",
    "They were going to kill people.",
    "BIDEN: No, how do you do that?",
    "By the way, he predicted that.",
    "OZ: I've called the companies.",
    "Justin Trudeau, where are you?",
    "They're learning disabilities.",
    "He says it wasn't hard to get.",
    "That's the way you solve this.",
    "The problem is mental health.",
    "They do it with homelessness.",
    "Appreciate you being with us.",
    "This is not an isolated case.",
    "But first, back here at home.",
    "HOLT: Have you told him that?",
    "They're even telling us that.",
    "I don't know what I'm doing.",
    "HANNITY: I think you got it.",
    "I think you get the message.",
    "They're not the right masks.",
    "It's a progressive pipeline.",
    "But your kids are worth it.",
    "This is an interesting one.",
    "But it's not going to work.",
    "MCKENZIE: Where do I start?",
    "She's having a block party.",
    "Now, why is this happening?",
    "It was easily preventable.",
    "How do you even find them?",
    "If you follow the science?",
    "It's family and education.",
    "That person doesn't exist.",
    "HEGSETH: No olives for me.",
    "And Pete is exactly right.",
    "We say stop the bleeding.",
    "It takes time and effort.",
    "And we're starting early.",
    "So what's happening here?",
    "The damage is outweighed.",
    "Senator, good to see you.",
    "Hmm, isn't that a threat?",
    "He's been here in Ottawa.",
    "MCKENZIE: Yeah, go ahead.",
    "You mean that literally?",
    "UNIDENTIFIED MALE: Yeah.",
    "It will fail in general.",
    "For example, wear masks.",
    "They don't know anybody.",
    "That's stuck in my head.",
    "HANNITY: How about this?",
    "It's all mental illness.",
    "They do it with schools.",
    "Adam Carolla, thank you.",
    "But I'm not going there.",
    "HANNITY: Are you going?",
    "They are the most woke.",
    "She's a former teacher.",
    "Her name is Tiara Mack.",
    "BIDEN: Yes, absolutely.",
    "And welcome to HANNITY.",
    "UNIDENTIFIED MALE: Wow.",
    "That'll make you safe.",
    "They become the enemy.",
    "Maybe a couple others.",
    "HANNITY: There you go.",
    "What's your reaction?",
    "It was irresponsible.",
    "Why wouldn't I do it?",
    "There's no violence.",
    "It's called freedom.",
    "Have the best night.",
    "Here's Sean Hannity.",
    "This is fascinating.",
    "A little testy, Joe?",
    "Save your grandkids.",
    "ALL RIGHTS RESERVED.",
    "It's drug addiction.",
    "I'm not that person.",
    "HANNITY: Well said.",
    "Take your kids out.",
    "BIDEN: They're not.",
    "HANNITY: All right.",
    "Thank you, Trudeau.",
    "OZ: It should end.",
    "There's no racism.",
    "Look for yourself.",
    "Tucker, thank you.",
    "Is that realistic?",
    "So it can be done.",
    "I knew you would.",
    "I know it's hard.",
    "You may remember.",
    "CRUZ: Yeah, yeah.",
    "Enough is enough.",
    "So you know what?",
    "We need the NHL.",
    "We need the NHL.",
    "She's in Ottawa.",
    "They're fed up.",
    "Save your kids.",
    "Thank you both.",
    "It's all drugs.",
    "O'ROURKE: Yes.",
    "It's abusive.",
    "What say you?",
    "What garbage?",
    "Is that fair?",
    "Stay with us.",
    "Take a look.",
    "Take a look.",
    "Okay, watch.",
    "Take a look.",
    "Take a look.",
    "Take a look.",
    "BIDEN: Yes.",
    "So -- yeah?",
    "All right.",
    "Thank you.",
    "Everybody.",
    "So, right?",
    "All right.",
    "Look."
  ]
}