{
  "id": 898,
  "mediaId": 2664,
  "date": "2022-02-16",
  "headline": "Turkey’s autocratic ruler could have leverage over a future GOP senator: report",
  "image": "https://www.rawstory.com/media-library/president-donald-j-trump-walks-with-turkish-president-recep-tayyip-erdogan-wednesday-nov-13-2019-from-the-diplomatic-reception-room-to-the-oval-office-of-the-white-house.jpg?id=29357125&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/dr-oz-turkey-pennsylvania/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    5862,
    4958,
    4844,
    4178,
    2802,
    2765,
    1126,
    1359,
    1489,
    6669,
    6709
  ],
  "sentences": [
    "“So, if Dr. Oz gets into the Senate, it’s like Erdogan’s arm will be in the Senate.”\nIN RECENT NEWS: Reporter explains how Biden got Putin to blink after Russian forces amassed near Ukraine\nReporter explains how Biden got Putin to blink after Russian forces amassed near Ukraine",
    "The latest polls show him as the front-runner, 11 points above former Treasury Department official and hedge-fund executive David McCormick and 12 points above President Donald Trump’s ambassador to Denmark and former actress Carla Sands,\" he wrote.",
    "But never before has our country experienced a senator who has dual citizenship, served in a foreign military and maintains deep ties to the nation of his birth — one where the leader is notorious for punishing those who cross him.",
    "\"As the prospect of “Senator Doctor Oz” becomes plausible, several reports have questioned Oz’s national allegiances and detailed his ties to elite business and political circles in his birth country, Turkey.\"",
    "Oz” — has myriad connections to Turkey and the world of its autocratic president, Recep Tayyip Erdogan, that are causing concern in Washington and beyond,\" Josh Rogin wrote.",
    "On the Republican side, the race became chaotic after Trump-endorsed candidate Sean Parnell ended his campaign after losing custody of his children.",
    "The race to succeed retiring Sen. Pat Toomey (R-PA) could have foreign policy implications, according to a new report in The Washington Post.",
    "NBA player Enes Kanter Freedom, who was born in Turkey and whose father was jailed by Erdogan, slammed Oz.",
    "Rogin describes Oz's campaign as \"serious\"\n\"His campaign is spending millions on television ads.",
    "TV personality Dr. Oz then entered the race, followed by hedge fund executive David McCormick.",
    "\"Members of the U.S. Senate often have conflicts of interest, both business and personal.",
    "And whatever Erdogan wants, that’s what Dr. Oz is going to do,” Freedom said.",
    "He has near 100 percent name recognition and a huge social media following.",
    "After attending Harvard, Oz spent two years in the Turkish army.",
    "“People need to understand that Dr. Oz is in Erdogan’s pocket.",
    "Mehmet Oz — more commonly known by his television name of “Dr."
  ]
}