{
  "id": 8981,
  "mediaId": 2522,
  "date": "2022-03-20",
  "headline": "Growing chorus of Republicans say Congress must initiate probe into Hunter Biden laptop, coverup",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/03/SG-Russian-Disinformation-CNN-vs-SG-Hunter-Biden.jpg",
  "link": "https://www.bizpacreview.com/2022/03/20/growing-chorus-of-republicans-say-congress-must-initiate-probe-into-hunter-biden-laptop-coverup-1214920/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Vivek Saxena",
  "authorUrl": "https://www.bizpacreview.com/author/vivek-saxena/",
  "termIds": [
    0
  ],
  "sentences": [
    "In a way, the current outbreak is worse, because even tech companies that were formed to take a stand against the predations of establishment tech giants like Google have bent the knee and joined the latest witch hunt:\nCritics see red flags as Google alternative DuckDuck Go announces big changes https://t.co/12p5KzruXE\n— American Wire News (@americanwire_) March 10, 2022\nThe worry is that without an investigation and, more importantly, accountability, the cycle will repeat itself over and over again — much as it, in fact, already has …\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "“The president needs to clearly state right now that he will not interfere in any federal probe into his son Hunter, and he will not use his presidential powers — including the pardon power — to rescue his son if there are charges brought against Hunter.”\nMore emails in ‘laptop from Hell’ show Joe Biden was expecting 10% cut in Hunter deal Chinese giant https://t.co/8TcAFLPBcF pic.twitter.com/sVImbLDknp\n— Conservative News (@BIZPACReview) November 29, 2021\n“It’s sad.",
    "Her point was that the real disinformation came from all the Biden-allied figures in America’s major institutions who’d flagrantly dismissed the Post’s legitimate reporting on his son’s laptop as “Russian disinformation.”\nAmong those who’d participated in the lie was the Times itself, which is why former President Donald Trump’s personal attorney, Rudy Giuliani, who’d been responsible for bringing the laptop to the Post, still thinks the paper is trash.",
    "— Ronna McDaniel (@GOPChairwoman) March 19, 2022\nThis includes intelligence officials:\n“The most basic accountability requires firing those responsible for the ‘Russian disinfo’ lie about the Biden family’s corruption, including and especially the former intelligence officials who were elevated to the top of cable news because they pushed wild and unsubstantiated Russia conspiracy theories about President Trump,” Cruz added.",
    "He added, “As Pennsylvania’s next Senator, I will support an investigation into the findings of Hunter Biden’s laptop and any efforts to cover it up.”\nAnd this includes Joe Biden and his son:\n“There is very damning evidence that Hunter Biden sold his father’s access when his father was the vice president of the United States, and that’s on his laptop.",
    "This includes big tech giants:\n“Big Tech’s censorship of a story the liberal media has now acknowledged to be true just proves that a Republican House majority must take meaningful action to rein in Big Tech censors next year,” one Republican, New York Rep. Claudia Tenney, said to the Post regarding big tech’s complicity.",
    "These calls come amid The New York Times’ extremely late admission last week that, despite the cries of “Russian disinformation” that flooded the airways when the New York Post first reported on the laptop 17 months earlier, the laptop is indeed real.",
    "All this comes amid yet another outbreak of establishment voices in America’s major institutions crying “Russian disinformation,” this time over any reporting or commentary that belies the mainstream narrative on the crisis in Ukraine.",
    "This includes the media:\n“This is just another example of the media being quick to silence anything that would shine a light on the corrupt Biden family,” GOP Pennsylvania Senate candidate Dr. Mehmet Oz told the Post.",
    "We’re all talking about disinformation in Russia and other totalitarian countries and we are learning that we have it right here at home,” another Republican, New York Rep. Nicole Malliotakis, said to the Post.",
    "SIGN UP HERE\nA growing chorus of Republican voices are calling for a congressional investigation into the cover-up of President Joe Biden’s crack-smoking son Hunter Biden’s laptop.",
    "“Big Tech leaders who participated in censoring the truth should answer to Congress and the American people in sworn testimony,” Texas Sen. Ted Cruz said in agreement.",
    "And there is even evidence that then Vice President Joe Biden may have been in on this,” former Senate Judiciary Committee chief counsel Mike Davis said to the Post.",
    "Whether or not any investigation will actually occur hinges on whether Republicans retake Congress — at least the House, if not also the Senate — come November.",
    "Polling data tracked by RealClearPolitics shows Republicans currently enjoying a 3.7 percentage point lead in the 2022 generic congressional ballot.",
    "The target of any investigation, Republicans say, should include everybody who’d contributed to covering up the truth about the laptop.",
    "“All options should be on the table, including probes into their conduct and its impact on the Democratic process,” she added.",
    "Republican National Committee chair Ronna McDaniel also concurred:\nBig Tech censored questions about COVID’s origins.",
    "Even if The Times wanted to apologize — which they wouldn’t — I would shove it right back in their face.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "On RCP’s Senate map, they’re leading with 47 likely seats to the Democrats’ 46 likely seats.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "They removed conservatives from their platforms but not Iran and Russian propagandists.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "They are a disgraceful publication,” he told the Post.",
    "The public will not see it and we do not share it.",
    "I don’t need The Times to make me feel vindicated.",
    "They censored stories on Hunter Biden’s laptop.",
    "We need accountability!",
    "“Do I feel vindicated?",
    "What’s next?"
  ]
}