{
  "id": 9085,
  "mediaId": 2590,
  "date": "2022-03-24",
  "headline": "White House Removes Dr. Oz, Herschel Walker From Presidential Council",
  "image": "https://img.huffingtonpost.com/asset/623bf2012100004248504715.jpg?cache=s0YZg30wVF&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/dr-oz-herschel-walker-presidential-council_n_623bddbde4b0f1e82c532165",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josephine Harvey",
  "authorUrl": "",
  "termIds": [
    3217,
    4905,
    2137,
    2802,
    2765,
    1489
  ],
  "sentences": [
    "Under the Hatch Act, they “may not be a candidate for nomination or election to public office in a partisan election.”\nThe White House announced earlier on Wednesday that President Joe Biden will appoint WNBA star Elena Delle Donne and philanthropist chef José Andrés as co-chairs of the President’s Council on Sports, Fitness and Nutrition.",
    "pic.twitter.com/fJaVLKVWOC\n— Dr. Mehmet Oz (@DrOz) March 24, 2022\nWalker, the Trump-endorsed front-runner in the GOP contest to challenge Sen. Raphael Warnock (D-Ga.) in November, recently questioned the science of evolution.",
    "The official confirmed that letters were sent Wednesday to Oz and Walker requesting their resignations by 6 p.m.\nAdvertisement\nMembers of the presidential council are considered special government employees, CNN noted.",
    "One of his go-to targets is Dr. Anthony Fauci, the nation’s top infectious disease expert, whom Oz has called a “petty tyrant” over his handling of the COVID-19 pandemic.",
    "The President’s Council on Sports, Fitness and Nutrition is a federal advisory committee that aims to promote healthful eating habits and physical activity.",
    "Mehmet Oz and Herschel Walker were appointed in 2018 by then-President Donald Trump to serve on the President’s Council on Sports, Fitness and Nutrition.",
    "The White House asked two Republican Senate candidates to resign from their positions on a presidential council by 6 p.m. Wednesday or be removed.",
    "It’s against the Biden administration’s policy for political candidates to serve on presidential boards, a White House official told CNN.",
    "I received this letter on behalf of @POTUS requesting I resign from the President's Council on Sports, Fitness & Nutrition.",
    "Advertisement\nOz has based his campaign on being an outsider seeking to “cure” the Washington establishment.",
    "His campaign did not immediately respond Wednesday to a request for comment on the White House request.",
    "Trump appointed them to another two-year term in December 2020, a month before leaving office.",
    "Oz tweeted Wednesday that the White House had demanded his resignation by the end of the day.",
    "Advertisement\nOz, a celebrity doctor, is running for a U.S. Senate seat in Pennsylvania.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.",
    "“If President Biden wants to politicize health, he will have to fire me,” he wrote.",
    "It’s sad that he would politicize such an important issue like health.",
    "Walker, a former NFL star, is a Senate contender in Georgia.",
    "He slammed the move and said he would not do so.",
    "He was co-chair of the wellness council.",
    "About 30 people serve on the panel."
  ]
}