{
  "id": 9183,
  "mediaId": 2718,
  "date": "2022-03-24",
  "headline": "Biden Boots Dr. Oz, Herschel Walker From Presidential Council",
  "image": "https://www.thewrap.com/wp-content/uploads/2022/03/Oz.jpg",
  "link": "https://www.thewrap.com/biden-boots-dr-oz-herschel-walker-from-presidential-council/",
  "mediaOutlet": "The Wrap",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andi Ortiz",
  "authorUrl": "https://www.thewrap.com/author/andi-ortiz/",
  "termIds": [
    4905,
    3217,
    2137,
    2765,
    2802,
    1489,
    6175
  ],
  "sentences": [
    "Oz expressed his dismay over the move on Twitter, posting a video as part of a thread, and noting that he has “no intention of resigning.”\n“It’s sad that he would politicize such an important issue like health,” Oz tweeted.",
    "But it’s against the Biden administration’s policy for federal candidates to serve on presidential boards, so Oz and Walker will not be able to finish those terms (both would expire in December).",
    "President Biden is so scared about us beating Raphael Warnock that he has asked me to resign from my unpaid position on the President’s Council on Sports, Fitness, and Nutrition.",
    "However, I have no intention of resigning.”\nI received this letter on behalf of @POTUS requesting I resign from the President's Council on Sports, Fitness & Nutrition.",
    "pic.twitter.com/fJaVLKVWOC\n— Dr. Mehmet Oz (@DrOz) March 24, 2022\nIf President Biden wants to politicize health, he will have to fire me.",
    "You would think record gas prices, a 40-year inflation high, and the situation in Ukraine would be his highest priorities at the moment.",
    "With that said, I am beyond grateful to President Trump for appointing me to this very prestigious & important position.",
    "Both men are now running for Senate, with Walker running in Georgia and Oz hoping to get the nomination in Pennsylvania.",
    "Two of Donald Trump’s appointees to the President’s Council on Sports, Fitness & Nutrition are getting the boot.",
    "— Dr. Mehmet Oz (@DrOz) March 24, 2022\nWalker publicly commented on the letter later in a Thursday tweet.",
    "I am also grateful to my colleagues on the committee & proud of everything we were able to achieve.",
    "Oz and Walker were first given their spots on the council back in 2018, during Trump’s presidency.",
    "President Biden requested the resignations of both Dr. Mehmet Oz and Herschel Walker this week.",
    "Following his first impeachment, Trump reappointed both men to a two-year term in 2020.",
    "“The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.",
    "Letters to Oz and Walker were sent on Wednesday, requesting their resignations.",
    "It’s sad that he would politicize such an important issue like health.",
    "I’m not a quitter so you are going to have to fire me.",
    "— Herschel Walker (@HerschelWalker) March 24, 2022"
  ]
}