{
  "id": 9231,
  "mediaId": 2644,
  "date": "2022-03-19",
  "headline": "Republicans demand new probe into Hunter Biden laptop, coverup",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/newspress-collage-21585937-1647723199746.png?w=1024",
  "link": "https://nypost.com/2022/03/19/republicans-call-for-new-probe-into-hunter-biden-laptop/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Levine",
  "authorUrl": "",
  "termIds": [
    4905,
    5530,
    3858,
    3037,
    2403,
    2765,
    1125,
    1126
  ],
  "sentences": [
    "Texas Sen. Ted Cruz (R-Texas) told The Post, “The most basic accountability requires firing those responsible for the ‘Russian disinfo’ lie about the Biden family’s corruption, including and especially the former intelligence officials who were elevated to the top of cable news because they pushed wild and unsubstantiated Russia conspiracy theories about President Trump.",
    "“There is very damning evidence that Hunter Biden sold his father’s access when his father was the vice president of the United States and that’s on his laptop and there is even evidence that then Vice President Joe Biden may have been in on this,” said Mike Davis, a former chief counsel for nominations for the Senate Judiciary Committee.",
    "The laptop — which Hunter left at the Delaware computer-repair shop of John Paul Mac Isaac and contained evidence that he was colluding with deep-pocketed corporations in China and Ukraine and giving a cut to his father — eventually made its way to Trump attorney and former Mayor Rudy Giuliani.",
    "“The president needs to clearly state right now that he will not interfere in any federal probe into his son Hunter, and he will not use his presidential powers — including the pardon power — to rescue his son if there are charges brought against Hunter.”",
    "“All options should be on the table, including probes into their conduct and its impact on the Democratic process.”\nIn a tweet, Saturday, Republican National Committee Chairwoman Ronna McDaniel also demanded “accountability” from Big Tech on the issue.",
    "They are a disgraceful publication.”\n“This is just another example of the media being quick to silence anything that would shine a light on the corrupt Biden family,” Dr. Mehmet Oz, a leading GOP Pennsylvania Senate candidate, told The Post.",
    "“As Pennsylvania’s next Senator, I will support an investigation into the findings of Hunter Biden’s laptop and any efforts to cover it up.”\nLegal experts said a new Hunter Biden probe could potentially implicate his father President Biden.",
    "Though The Post exclusively revealed in September 2020 the existence of Hunter Biden’s laptop and the potentially compromising material contained there, the story was censored by social media companies at the behest of the Democratic Party.",
    "Almost 50 percent of Biden voters knew nothing of the laptop scandal at the time of the election and almost 10 percent said they would not have voted for Biden had they known, according to a survey from The Media Research Center.",
    "More than 50 intelligence agency officials publicly attempted to discredit the coverage saying it had “the classic earmarks of a Russian information operation” — and none offered any apology when contacted by The Post this week.",
    "A growing number of Republicans around the country are demanding a new investigation into Hunter Biden after the New York Times confirmed the authenticity of a laptop whose contents were published by The Post 17 months ago.",
    "“Big Tech’s censorship of a story the liberal media has now acknowledged to be true just proves that a Republican House majority must take meaningful action to rein in Big Tech censors next year,” she said.",
    "Mainstream media outlets — including The Times — attacked or ignored The Post revelations, while the Biden administration falsely suggested it was part of a Russian disinformation campaign.",
    "We’re all talking about disinformation in Russia and other totalitarian countries and we are learning that we have it right here at home,” Staten Island GOP Rep. Nicole Malliotakis said.",
    "Hunter Biden is already facing a sprawling federal probe into his tax filings and business dealings around the world, the New York Times finally reported this week.",
    "“Furthermore, Big Tech leaders who participated in censoring the truth should answer to Congress and the American people in sworn testimony,” he said Saturday.",
    "The Post authenticated the computer and its contents in interviews with Mac Isaac and Biden cronies whose emails were found on the hard drive.",
    "Outlets and social media only admitted they were wrong after the election, which Biden won with 51% of the popular vote.",
    "Even if The Times wanted to apologize — which they wouldn’t — I would shove it right back in their face.",
    "Upstate Republican Rep. Claudia Tenney said Saturday that the episode demanded congressional action.",
    "“Do I feel vindicated?” Giuliani told The Post Saturday.",
    "“I don’t need The Times to make me feel vindicated.",
    "The coverup helped swing the election to Biden.",
    "He brought it to The Post in September 2020.",
    "“It’s sad."
  ]
}