{
  "id": 930,
  "mediaId": 8254,
  "date": "2022-02-16",
  "headline": "Senate candidate Dr. Oz visits Somerset county",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/Do6.jpeg?w=1280",
  "link": "https://www.abc27.com/election/senate-candidate-dr-oz-visits-somerset-county/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Tracy",
  "authorUrl": "https://www.wearecentralpa.com/?post_type=profile&p=133",
  "termIds": [
    2802,
    4905,
    1126,
    1489,
    6610,
    6611,
    6512,
    6506
  ],
  "sentences": [
    "“When you get people who don’t have work, they get depressed, they don’t have a purpose in their lives, they turn to drugs.”\nWhen Dr. Oz, who lived in New Jersey for 30 years, was asked why he was running for the Pennsylvania seat on the U.S. Senate he talked about something his father told him when he was young.",
    "Dr. Oz responded by expressing his desire to strengthen the border and criticized how the Biden administration for what he called “paying people not to work.”\n“In Somerset County, without question, I’m hearing about the fact not enough people are going to work,” Dr. Oz said.",
    "Dr. Oz visited the Summit Diner, located on Center Avenue in Somerset where he met and chatted with locals ahead of his town hall to find out what issues were happening in Somerset.",
    "“We are paying people not to work which is hurting the people who are working.”\nHe then went on to discuss how drug issues in the area could connect to those who aren’t working.",
    "That’s what’s been happening to a lot of people in Pennsylvania.”\nAfterward, around 9 a.m. Dr. Oz visited Guy Chemical Company Inc. in Somerset to host a town hall event.",
    "Dr. Oz, who is currently leading in early polls, is one of many Republican candidates looking to represent their party in the general election in November.",
    "SOMERSET COUNTY, Pa (WTAJ) — Dr. Mehmet Oz, a current Republican candidate for the U.S. senate visited Somerset county on Wednesday to host a town hall.",
    "During the town hall, one crowd member asked him about being called a “Republican in name only”, which is something seen in attack ads.",
    "Dr. Oz told the crowd he is pro-life, pro-second amendment, and said his opponent, David McCormick has connections to China.",
    "“That’s where my dad said don’t be treated like a mushroom or you’ll be kept in the dark and fed manure all day long.",
    "I still don’t have a pill I can give to you that’s available at a drug store to help you if you got Covid.",
    "“If you take doctors out of the equation, which they did, they didn’t let us prescribe any medication.",
    "“I grew up south of Philadelphia, near mushroom capital of the world Kennet Square,” Dr. Oz said.",
    "Some of the families he spoke with expressed their concerns with opioids and staffing issues.",
    "“I’m also hearing about drugs and I’ve covered this a lot in my show,” Dr. Oz said.",
    "Dr. Oz has also been very critical of how the COVID-19 pandemic has been handled.",
    "We’ve had some of these pills in existence before Covid hit our shores.”",
    "Some of his opponents include former lawmakers and business leaders.",
    "“They didn’t respect doctors as the main caregivers,” Dr. Oz said.",
    "How is that possible?"
  ]
}