{
  "id": 9310,
  "mediaId": 2702,
  "date": "2022-03-24",
  "headline": "NATO summit to address Russia’s invasion of Ukraine underway",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/nato_032422ap.jpg?w=1280",
  "link": "https://thehill.com/policy/international/599522-nato-summit-to-address-russias-invasion-of-ukraine-underway/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2790,
    2973,
    4905,
    4844,
    884,
    6569,
    6411,
    6672
  ],
  "sentences": [
    "Also ahead of the summit, Biden met with Stoltenberg one-on-one and “discussed the unity and strength of the alliance and NATO’s ongoing efforts to deter and defend against any aggression, and they welcomed the support of Allies for the government and people of Ukraine,” according to the White House.",
    "NATO Secretary General Jens Stoltenberg began the summit by declaring that Russia’s invasion in Ukraine created a “new security reality in Europe.”\n“We are always doing more on land, at sea, and in the air, this is necessary to respond to new security reality in Europe,” he told NATO leaders.",
    "Western nations have rolled out coordinated sanctions and offered military and humanitarian assistance to Ukraine, all while Biden and other leaders have been coordinated in wanting to avoid an escalation that would draw in NATO forces.",
    "During the photo, the president shook hands and said a few words to U.K. Prime Minister Boris Johnson, Turkish President Recep Tayyip Erdogan, French President Emmanuel Macron, and Estonian Prime Minister Kaja Kallas.",
    "President Biden and NATO allies opened up meetings on Thursday on how to address Russia’s invasion of Ukraine as the alliance seeks ways to further deter Moscow from potentially escalating its attacks.",
    "Stoltenberg said that leaders would “discuss allied support to Ukraine” and “NATO’s efforts to strengthen our defenses now and for years to come” during the meetings.",
    "We are united in condemning the Kremlin’s unprovoked aggression and in our support for Ukraine’s sovereignty and territorial integrity,” the secretary general said.",
    "“We pay tribute to the great courage of the Ukrainian people and the Ukrainian armed forces fighting for their freedom and their rights.",
    "But the U.S. and NATO allies have thus far been adamant they will not fight Russia in Ukraine, which is not a member of the alliance.",
    "Maintaining the united front that has defined the Western response to Russia so far is a major focus on Biden’s trip to Europe.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "He also said the group is determined to continue to impose costs on Russia and honor the Ukrainian people.",
    "Stoltenberg spoke about the looming threat of cyberattacks and even the use of nuclear weapons by Russia.",
    "Biden earlier on Thursday participated in a family photo with Stoltenberg and all 29 other NATO leaders.",
    "?a Group of Seven meeting and attend a European Council summit to discuss shared concerns about Ukraine.",
    "We also recognize those in the Russia who are bravely speaking out against the war.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "“We gather at a critical crime for our security.",
    "Later on Thursday, Biden will participate in ?",
    "We hear their voices, they matter,” he said.",
    "–Updated at 7:14 a.m."
  ]
}