{
  "id": 9322,
  "mediaId": 6497,
  "date": "2022-03-23",
  "headline": "Biden Administration Seeks Resignations of Dr. Oz, Herschel Walker From Presidential Council",
  "image": "https://www.hollywoodreporter.com/wp-content/uploads/2022/03/GettyImages-1370241456.jpeg?w=1024",
  "link": "https://www.hollywoodreporter.com/news/politics-news/biden-seeks-dr-oz-herschel-walker-resignations-1235117882/",
  "mediaOutlet": "Hollywood Reporter",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Abid Rahman",
  "authorUrl": "https://www.hollywoodreporter.com/author/abid-rahman/",
  "termIds": [
    2765,
    2137,
    2016,
    2802,
    4905,
    1489,
    6175
  ],
  "sentences": [
    "Oz and Walker, both appointed to two-year terms on the council by former President Donald Trump in 2018 and reappointed in December 2020, were sent letters by the administration asking them to resign, adding “should we not receive your resignation, your position with the Council will be terminated effective 6:00 pm tonight.”\nBoth Oz and Walker are running for the Senate as Republicans, in Pennsylvania and Georgia, respectively.",
    "The Biden administration is seeking the formal resignations of TV personality Dr. Mehmet Oz and former NFL star Herschel Walker from the President’s Council on Sports, Fitness & Nutrition, warning that failure to quit the posts would lead to termination.",
    "In a statement to The Hollywood Reporter, Oz said, “Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "Earlier Wednesday, the White House announced the appointment of chef and humanitarian José Andrés and WNBA star Elena Delle Donne as co-chairs of the President’s Council on Sports, Fitness & Nutrition.",
    "I am proud of my service and will not resign.”\nThe former host of The Dr. Oz Show also tweeted a video response, with himself standing in front of a curtain, denouncing the request.",
    "CNN reported that a White House official confirmed that it is against the Biden administration’s policy for federal candidates to serve on presidential boards.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons,” he added.",
    "“It’s sad that he would politicize such an important issue like health.",
    "THR has reached out to Walker’s rep for comment."
  ]
}