{
  "id": 9485,
  "mediaId": 6428,
  "date": "2022-03-28",
  "headline": "'Grateful to God': Senate Candidate Kathy Barnette's Miraculous Story of Purpose and Value",
  "image": "https://www1.cbn.com/sites/default/files/media/slider/images/kathypic.png",
  "link": "https://www1.cbn.com/cbnnews/politics/2022/march/grateful-to-god-senate-candidate-kathy-barnettes-miraculous-story-of-purpose-and-value",
  "mediaOutlet": "CBN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Brody",
  "authorUrl": "https://www1.cbn.com/profiles/brody-david",
  "termIds": [
    5862,
    4280,
    272,
    1489,
    6026,
    6506
  ],
  "sentences": [
    "\"These carpetbaggers have been spending beaucoup millions within the first two weeks of February,\" she told voters at a meet and greet in Mechanicsburg, PA.\n\"Oz has already spent $7 million just in the first two weeks.",
    "\"If You are real and if You can really save my life, and I won't be a hypocrite like some that I've seen growing up as a child, then I want you,\" she told CBN News.",
    "How simple and yet today, we have murdered over 63 million babies because somehow, we have convinced ourselves that life has no value, that life has no purpose.",
    "***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.",
    "I'm so grateful to God that there were people who came alongside my very young mother when she was in a very broken place, and there I was, in her womb.",
    "Barnette became the first in her family to finish college, saw success in the corporate world, and is now running for United States Senator.",
    "\"We have critical race theory that goes into classrooms and teaches little white kids that because of the color of your skin, you're evil.",
    "\"I can see how at the age of 19, how He grabbed my hand and He began to show me my purpose and how everything about me is by design.",
    "\"I grew up in a home with no insulation, no running water, an outhouse in the back, and a well on the side,\" Barnette told CBN News.",
    "Looking at her birth certificate for the first time, she did the math, asked questions, reached out to her mom, and made peace.",
    "When voters in Pennsylvania meet U.S. Senate candidate Kathy Barnette, they see smiles and hear a straightforward message.",
    "\"All of that was blocked out until my daughter brought it to my attention,\" Kathy's mother Mamie Bullock told CBN News.",
    "\"I believe it was during that time on that train ride from California to Alabama that I gave my life to the Lord.\"",
    "Barnette, who's lived in the Keystone State for almost a decade, wants to make sure voters get that message.",
    "While a childhood of poverty is tough enough, Barnette's entry into the world could be considered a miracle.",
    "\"I want to finish this race and hear the Lord say, 'Well done my good and faithful servant,' Barnette said.",
    "For the voters of her state, she wants an America that gives others the opportunities that she herself got.",
    "The word of God says that it is Him who decides the day and the time and the place where we will be born.\"",
    "She heard an audible voice saying, 'go back home' and recalls telling God something specific on the way.",
    "The May Primary is hotly contested in a state that could determine which party controls the Senate.",
    "Barnette didn't find out about this part of her life until joining the military in her late teens.",
    "\"Everything is on fire in our country and it's not working,\" she bluntly said at a recent debate.",
    "As a homeschooling mom of two, she's tired of the indoctrination school kids are under every day.",
    "If she wins, Kathy Barnette would become the United States Senate's first black Republican woman.",
    "What is she hoping to accomplish, knowing full well she is a true believer in a God of miracles.",
    "I thought I kept it hid from them, but I should have realized they had their birth certificate.\"",
    "\"I am the byproduct of a rape,\" Barnette told CBN News while sharing her story through tears.",
    "\"Our nation is in need of those who will take a long-term custodial view of our country.",
    "While Barnette polls in the single digits, she's gained a strong grassroots following.",
    "She makes a habit of calling out Democrats for using black voters to their advantage.",
    "\"Our nation is in need of good people to get engaged,\" Barnette said emphatically.",
    "Former talk show host Dr. Mehmet Oz is also in the race and has name recognition.",
    "After the reconciliation came another meeting that would change her life forever.",
    "My father was 21 and I am so grateful to God that there were adults in the room.",
    "They cannot secure the White House without getting 92 to 95% of the black vote.",
    "She pitches herself as a citizen legislator, such as the founders intended.",
    "David McCormick has many high-profile endorsements and leads the field.",
    "Her supporters are praying for her to do just that in Pennsylvania.",
    "Barnette found Jesus after a dream about the Book of Revelation.",
    "I took no part in how I was conceived and yet there I was.\"",
    "She points out that neither opponent is from Pennsylvania.",
    "\"My mother was 11 years old when I was conceived.",
    "But behind the direct rhetoric is a deeper story.",
    "Our country does not have long-term custodians.\"",
    "'You ran your race that was in front of you.'\"",
    "\"They saw me as someone with value,\" she said.",
    "\"What exactly have we gotten for loyalty?\"",
    "I never wanted them to think about it.",
    "It all started to make sense to her.",
    "So how does Barnette define success?",
    "Well, what exactly have we gotten?\"",
    "Barnette will be forever thankful.",
    "It is racist and it is wrong.\"",
    "\"We know what Democrats get.",
    "So they get the White House?",
    "It's a crowded GOP field.",
    "\"I never talked about it.",
    "My life has purpose.\"",
    "My life is valuable.",
    "\"I'm so grateful.",
    "Who does that?\"",
    "she asks.",
    "***"
  ]
}