{
  "id": 9537,
  "mediaId": 2644,
  "date": "2022-03-24",
  "headline": "Biden tells GOP Senate candidates Walker, Oz to quit health council or be fired",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/biden-oz-walker-presidential-council-comp-1.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/24/biden-tells-gop-senate-candidates-walker-oz-to-quit-health-council-or-be-fired/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Callie Patteson",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "White House policy notwithstanding, federal law permits both Walker and Oz to “engage in political activity that full-time federal employees may not” when they are off the council clock, according to a 2019 opinion by the head of the Office of Special Counsel’s Hatch Act Unit.",
    "You would think record gas prices, a 40-year inflation high, and the situation in Ukraine would be his highest priorities at the moment.”\nOz announced his decision to run for the Senate representing Pennsylvania in November, vowing to help “heal” America.",
    "“A member is not prohibited by the Hatch Act from running for partisan political office,” Ana Galidon Marrone wrote at the time, “although a member who does so may not engage in any campaign-related activity while performing Commission work.",
    "Similarly, a member may solicit, accept, and receive political contributions while off-duty.”\nOn Wednesday, the White House nominated world-renowned chef José Andrés and WNBA star Elena Delle Donne to replace Walker and Oz",
    "The doctor he should ask to resign is Dr. [Anthony] Fauci, for a multitude of obvious reasons.”\nThe letter, which bore Wednesday’s date, was addressed to Oz and signed by Gautam Raghaven, assistant to the president.",
    "“I’m not a quitter so you are going to have to fire me.”\nWalker is the heavy favorite to win the Republican Senate primary in Georgia and take on Warnock, who won the seat in a special election in January 2021.",
    "In another tweet, Oz thanked Trump for appointing him to the council in 2018, saying he is “beyond grateful.”\n“I am also grateful to my colleagues on the committee & proud of everything we were able to achieve.",
    "“President Biden is so scared about us beating Raphael Warnock that he has asked me to resign from my unpaid position on the President’s Council on Sports, Fitness, and Nutrition,” Walker tweeted Thursday.",
    "Democrats face a steep climb this fall to keep their slim majorities in the House and Senate, as more than 30 Democratic members of the House have announced their intent not to run for their seats again.",
    "The 1982 Heisman Trophy winner for the University of Georgia has been endorsed by several top Republicans, including former President Donald Trump and Senate Minority Leader Mitch McConnell (R-Ky.).",
    "President Biden this week urged Republican Senate candidates Herschel Walker and Dr. Mehmet Oz to leave their positions on the President’s Council on Sports, Fitness and Nutrition or face removal.",
    "“I received this letter on behalf of @POTUS requesting I resign from the President’s Council on Sports, Fitness & Nutrition,” Oz tweeted alongside a video sharing an image of the letter.",
    "A White House official confirmed the letters to The Post, saying the administration is against having candidates for federal office on executive branch boards.",
    "Both GOP contenders shared Biden’s request on Twitter, accusing the president of politicizing health ahead of this November’s midterm elections.",
    "“On behalf of President Biden, I am writing to request your resignation as a Member of the President’s Council on Sports, Fitness & Nutrition.",
    "He will be looking to fill the open seat left by Sen. Pat Toomey, who announced his intent not to run in October 2020.",
    "“Should we not receive your resignation, your position with the Council will be terminated effective 6:00pm tonight.",
    "Please submit your resignation to me by the close of business today,” the letter reads.",
    "Thank you.”\nThe letter does not say why the president asked for the resignations.",
    "Republicans will only need a net gain of five seats to win back the House.",
    "“If President Biden wants to politicize health, he will have to fire me.",
    "“It’s sad that he would politicize such an important issue like health.",
    "However, I have no intention of resigning,” Oz wrote."
  ]
}