{
  "id": 9566,
  "mediaId": 2621,
  "date": "2022-03-23",
  "headline": "Joe Biden Just Fired Dr. Oz – Yes, Really",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-23-at-5.14.22-PM.jpg",
  "link": "https://www.mediaite.com/politics/joe-biden-just-fired-dr-oz-yes-really/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Luciano",
  "authorUrl": "https://www.mediaite.com/author/michael-luciano/",
  "termIds": [
    2765,
    2802,
    2137,
    4905,
    3217,
    4468,
    859,
    6175,
    6506
  ],
  "sentences": [
    "The White House sent Dr. Mehmet Oz and Herschel Walker letters demanding their resignations from the President’s Council on Sports, Fitness & Nutrition, and informed the U.S. Senate candidates from Pennsylvania and Georgia respectively that if they do not resign by 6 p.m. Wednesday they will be “terminated.”\nUnder the Hatch Act, Oz and Walker are considered special government employees who “may not be candidates in partisan elections” while engaged in official government business.",
    "pic.twitter.com/EP1vHWATp4\n— Dr. Mehmet Oz (@DrOz) March 23, 2022\nA formal letter from the White House to Oz reads,\nOn behalf of President Biden, I am writing to request your resignation as a Member of the President’s Council on Sports, Fitness & Nutrition.",
    "Oz served on the board with other notable personalities such as New England Patriots coach Bill Belichick and Baseball Hall of Fame inductee Mariano Rivera.",
    "Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "In response, Oz said former President Donald Trump appointed him to two terms on the council and that he will not step down.",
    "Should we not receive your resignation, your position with the Council will be terminated effective 6:00 pm tonight.",
    "After the 6 p.m. deadline arrived, Oz posted a video that appeared to be recorded earlier in the day.",
    "The council is an advisory committee that promotes healthy eating habits and physical activity.",
    "He stated he would not resign and instead called for the resignation of Dr. Anthony Fauci.",
    "Oz posted an email he received from the Office of Presidential Personnel dated March 23.",
    "It is unclear whether Walker, a former NFL running back, tendered his resignation.",
    "That means that, as of this writing, President Joe Biden has fired him.",
    "Please submit your resignation to me by the close of business today.",
    "I am proud of my service and will not resign.",
    "Have a tip we should know?",
    "tips@mediaite.com",
    "Thank you."
  ]
}