{
  "id": 9622,
  "mediaId": 2721,
  "date": "2022-03-24",
  "headline": "Biden threatened to fire… who!?",
  "image": "https://thehornnews.com/wp-content/uploads/2022/01/biden_family-600x315-cropped.jpeg",
  "link": "https://thehornnews.com/youre-fired-biden-demands-resignation-from-this-guy/",
  "mediaOutlet": "thehornnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    4899,
    3120,
    2859,
    2016,
    2765,
    2137,
    6697
  ],
  "sentences": [
    "Of course, they didn’t point out that White House press secretary Jen Psaki may have violated the Hatch Act last year by confirming Biden’s support for Democrat Terry McAuliffe in Virginia’s gubernatorial election, the watchdog group CREW alleged.",
    "“President Biden is so scared about us beating Raphael Warnock that he has asked me to resign from my unpaid position on the President’s Council on Sports, Fitness, and Nutrition,” Walker tweeted on Wednesday.",
    "In 2018, former President Donald Trump appointed television personality Dr. Mehmet Oz and professional athlete Herschel Walker to the President’s Council on Sports, Fitness and Nutrition.",
    "CNN even speculated that Oz and Walker may have been violating the Hatch Act: a longstanding law prohibiting some federal officials from partisan activities.",
    "Walker tweeted yesterday, “I’m not a quitter so you are going to have to fire me.”\nIf the CNN’s report is accurate, then they have each been fired by now.",
    "“Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "According to a White House official’s remarks to CNN, the Biden administration forbids federal candidates from serving on presidential boards.",
    "The White House has already announced its replacements: professional athlete Elena Delle Donne and nonprofit restaurateur Jose Andres.",
    "The Biden administration send two letters requesting resignations by 6 p.m. on Wednesday, a White House official told CNN that day.",
    "Previously, the Biden administration faced criticism for firing Trump appointees from their board positions at military academies.",
    "Sponsored: The one food you should NEVER put on your dinner plate\nThe two just so happen to be running for Senate… as Republicans.",
    "Oz is running for the Republican nomination in Pennsylvania’s competitive, closely watched race to fill an empty seat.",
    "Meanwhile, Walker has become the frontrunner for the GOP’s nomination to unseat Georgia Democrat Raphael Warnock.",
    "I am proud of my service and will not resign,” Oz told The Hollywood Reporter Wednesday.",
    "Now President Joe Biden is demanding their resignations… under threat of termination.",
    "Oz and Walker each announced their campaigns for Senate while on the council.",
    "Each candidate will appear on a primary ballot in May.",
    "Both appointees refused to resign.",
    "The Horn editorial team"
  ]
}