{
  "id": 9903,
  "mediaId": 8254,
  "date": "2022-03-30",
  "headline": "Forum gets tense in GOP’s sharp-elbowed Pennsylvania US Senate primary",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/AP22056538328626.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/forum-gets-tense-in-gops-sharp-elbowed-pennsylvania-us-senate-primary/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Levy",
  "authorUrl": "",
  "termIds": [
    2540,
    2802,
    5862,
    1126,
    1489,
    6144,
    6208,
    6506
  ],
  "sentences": [
    "HARRISBURG, Pa. (AP) — The first public appearance between the highest-profile Republicans running for U.S. Senate in Pennsylvania quickly became chippy Wednesday, as themes playing out in millions of dollars in sharp-elbowed TV attack ads played out on a small forum stage.",
    "The campaign in one of this year’s premier Senate contests also has been roiled by the arrival of three wealthy and well-connected candidates from other states, injecting carpetbaggery into the race as a prominent and persistent issue.",
    "2 natural gas-producing state, and former hedge fund CEO David McCormick turned a question about energy policy into an attack, accusing Oz of repeatedly raising questions about “fracking” in the past.",
    "Mehmet Oz — the celebrity heart surgeon best known as daytime TV’s host of “the Dr. Oz Show” — absorbed the brunt of criticism from rivals seated beside him.",
    "“Why is everyone attacking me?” Oz asked the audience rhetorically at the Manufacturer & Business Association offices in Erie as he began his closing speech.",
    "Until Wednesday, Oz and McCormick had largely skipped forums attended by other candidates and not crossed paths in public.",
    "That drew a protest from Oz, an admonishment from the moderator and Barnette’s refusal to agree to be quiet.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "“Because you’re a liberal,” interjected Kathy Barnette, a one-time congressional candidate.",
    "In any case, Oz said, he didn’t mind being attacked and had thick skin.",
    "Energy was a constant theme, since Pennsylvania is the nation’s No.",
    "Oz shot back that McCormick was wrong and lying.",
    "Sign up here."
  ]
}