{
  "id": 9961,
  "mediaId": 8254,
  "date": "2022-03-31",
  "headline": "Pennsylvania Senate Primary Poll: Oz & McCormick tied, majority undecided",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/AP22056538328626.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/pennsylvania-senate-primary-poll-oz-mccormick-tied-majority-undecided/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    0
  ],
  "sentences": [
    "“They care much more for what I stand for than where I’m from.”\nOn This Week in Pennsylvania, McCormick highlighted his background as a “seventh-generation Pennsylvanian.”\n“I’ve spent more of my life in Pennsylvania, more than half of my life in Pennsylvania.",
    "I grew up here in Bloomsburg on the family farm trimming Christmas trees and baling hay.”\nNearly 91% of Republican voters 65 and older say they are very likely to vote in the race, compared to 84% 50-64, 64% of residents 30-49, and 75% of residents 18-29.",
    "According to the poll, Democrats and Republicans disagree on whether Pennsylvania runs fair elections: 75% of Democrats think the state runs fair elections compared to 42% of Independents and just 28% of Republicans.",
    "(WHTM) – A new WHTM/Emerson College Polling/The Hill poll shows Dr. Mehmet Oz and David McCormick virtually tied in the May 17 Pennsylvania Republican US Senate primary, but a majority of voters remain undecided.",
    "The general election sample consisted of registered voters in Pennsylvania, n=1,069 with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/- 3 percentage points.",
    "It is important to remember that subsets based on gender, age, party breakdown, ethnicity, and region carry with them higher margins of error, as the sample size is reduced.",
    "Fox News contributor and former professor Kathy Barnette finished third at 6.4%, followed by former Danish ambassador under President Donald Trump, Carla Sands, at 5.7%.",
    "The Republican primary sample consisted of likely voters, n=372, with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/-5.0 percentage points.",
    "The Democratic primary sample consisted of likely voters, n=471, with a Credibility Interval (CI) similar to a poll’s margin of error (MOE) of +/-4.5 percentage points.",
    "Data was collected using a cellphone sample of SMS-to-web, an online panel provided by Amazon MTurk, and an Interactive Voice Response (IVR) system of landlines.",
    "The breakdown in support among younger and older voters is significant with Oz receiving no support from voters 18-29, but leading among the 50-64 age range.",
    "Candidates who receive at least 5% in either poll can qualify for a debate hosted by Nexstar Media Inc. and our media partners, WPXI-TV in Pittsburgh.",
    "McCormick leads Oz among those with a high school education or less, while support among those with college degrees or some college are closely split.",
    "In the poll of 373 Pennsylvania Republicans, the former television personality Oz received one more vote than McCormick, a former hedge fund CEO.",
    "The poll finds 61% of Pennsylvanian Republicans are more likely to support a Trump-endorsed candidate, while 13.2% say they are less likely.",
    "White voters support McCormick by 0.4% over Oz, while Sands received the most support among seven candidates with African American voters.",
    "Nearly 59% of rural voters are undecided compared to 48.6% of suburban residents and 30.4% of those who live in urban/city areas.",
    "The elephant in the room is former President Donald Trump, who, at the time of polling, has not endorsed a candidate in the race.",
    "Forty-six percent say it is very important how long a candidate has lived in Pennsylvania and 28.2% say it is somewhat important.",
    "Republicans and Democrats are also largely in favor of their candidate living in Pennsylvania for a significant amount of time.",
    "McCormick leads or is tied among every other age group, tying Bartos among the 30-49-year-olds and Bochetto in the 18-29 range.",
    "An overwhelming majority of Pennsylvanian Republican voters (50.5%) say they are still undecided in the crowded race.",
    "Polling methodology\nThe WHTM/Emerson College Polling/The Hill Pennsylvania poll was conducted from March 26-28, 2022.",
    "Nearly 64% of voters 65 and older say Trump’s endorsement will more than likely lead them to vote for that candidate.",
    "Fifteen percent say they are unsure and 10.7% say residency is not very or not at all important in their decision.",
    "More than 55% of Pennsylvania Republican voters with a post-graduate degree or higher are undecided in the race.",
    "Both Oz and McCormick have drawn criticism from others in the race for not recently living in Pennsylvania.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "The data sets were weighted by gender, age, education, race, and region based on 2020 turnout modeling.",
    "Among urban and city residents, McCormick had a double-digit lead over Oz with 25% support.",
    "McCormick also leads among male voters with 15.1%, while Oz has 15.1% support among women.",
    "Oz leads among suburban voters and McCormick has a slight 1.8% edge in rural voters.",
    "Emerson College will be releasing a second poll of Republican voters in early April.",
    "Nearly 26% say an endorsement from Trump will not make a difference in their vote.",
    "Fifty-nine percent of women are undecided compared to 41.9% of Republican men.",
    "Governor candidate Jeff Bartos rounded out the top five with 5.3% of the vote.",
    "Oz has previously lived in New Jersey but went to school in Philadelphia.",
    "Oz finished first in the poll with 14.4% followed by McCormick at 14.3%.",
    "“I’m very proud that I’m a Pennsylvanian,” Oz told abc27’s Dennis Owens.",
    "George Bochetto and Sean Gale each received less than 3% in the poll.",
    "Barnette received 10.8% support among men, followed by Sands at 9.1%.",
    "The majority of voters are undecided regardless of age category.",
    "Sign up here.",
    "Sign up here.",
    "Former Lt."
  ]
}