[
  {
    "id": 1290,
    "mediaId": 43,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "Cawthorn won't have a clear path through the May primary, though, as state Sen. <span class='selected-term'>Chuck Edwards</span> and Michele Woodhouse, who leads the GOP in the old 11th District (which is barely any different from this new seat) each made it clear they're staying in.",
    "author": "",
    "title": "Morning Digest: Join us for our liveblog tonight as the 2022 primaries get underway in Texas"
  },
  {
    "id": 923,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? NC-11: Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. <span class='selected-term'>Chuck Edwards</span>' campaign to defeat freshman Rep. Madison Cawthorn in the May 17 Republican primary, saying the next day that the incumbent \"has fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "author": "",
    "title": "Morning Digest: Why GOP leaders finally want to boot Madison Cawthorn (it's not really about orgies)"
  },
  {
    "id": 2914,
    "mediaId": 1576,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "He's a little bit of a different commodity that probably does not have as strong a base outside the beltway than some of those other members.?\nRepublican Sen. Thom Tillis of North Carolina has formally endorsed a primary challenger, state Sen. <span class='selected-term'>Chuck Edwards</span>, in the wake of Cawthorn's latest comments.",
    "author": "",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "The narrator, who brands the congressman \"an attention-seeking embarrassment,\" does not mention Tillis' endorsed candidate, state Sen. <span class='selected-term'>Chuck Edwards</span>.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid"
  }
]