[
  {
    "id": 2981,
    "mediaId": 238,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "Some are nuisance candidates, but others are serious, such as GOP district chair Michele Woodhouse and <span class='selected-term'>Chuck Edwards</span>, a state senator who represents a significant chunk of the new seat.",
    "author": "",
    "title": "Opinion: Madison Cawthorn is in trouble. And it's entirely his own fault."
  },
  {
    "id": 2944,
    "mediaId": 43,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. <span class='selected-term'>Chuck Edwards</span>' campaign to defeat freshman Rep. Madison Cawthorn in the May 17 Republican primary for North Carolina's 11th District, saying the next day that the incumbent has fallen well short of the most basic standards Western North Carolina expects from their representatives.?\nTillis threw in an unsubtle reference to Cawthorn's previous attempt to leave his constituents behind to run for an even more conservative district in the Charlotte area that he barely represented before a new court-drawn map foreclosed that possibility, antics that likely did him far more damage at home than his litany of embarrassing behavior.",
    "author": "",
    "title": "North Carolina senator endorses effort to deny renomination to Madison Cawthorn in May"
  },
  {
    "id": 923,
    "mediaId": 43,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? NC-11: Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. <span class='selected-term'>Chuck Edwards</span>' campaign to defeat freshman Rep. Madison Cawthorn in the May 17 Republican primary, saying the next day that the incumbent \"has fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "author": "",
    "title": "Morning Digest: Why GOP leaders finally want to boot Madison Cawthorn (it's not really about orgies)"
  },
  {
    "id": 2914,
    "mediaId": 1576,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "He's a little bit of a different commodity that probably does not have as strong a base outside the beltway than some of those other members.?\nRepublican Sen. Thom Tillis of North Carolina has formally endorsed a primary challenger, state Sen. <span class='selected-term'>Chuck Edwards</span>, in the wake of Cawthorn's latest comments.",
    "author": "",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 2712,
    "mediaId": 237,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The 26-year-old lawmaker is facing two viable Republican challengers, state Sen. <span class='selected-term'>Chuck Edwards</span> and Michele Woodhouse, former GOP chairwoman of western North Carolina's 11th Congressional District.",
    "author": "David M. Drucker",
    "title": "Rep. Madison Cawthorn holds GOP primary edge despite many unflattering headlines"
  },
  {
    "id": 2674,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Tillis has come out in support of a primary challenger to Cawthorn, state Sen. <span class='selected-term'>Chuck Edwards</span> (R), in recent weeks.",
    "author": "Sarakshi Rai",
    "title": "Timeline of Madison Cawthorn controversies"
  }
]