[
  {
    "id": 2914,
    "mediaId": 1576,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "He's a little bit of a different commodity that probably does not have as strong a base outside the beltway than some of those other members.?\nRepublican Sen. Thom Tillis of North Carolina has formally endorsed a primary challenger, state Sen. <span class='selected-term'>Chuck Edwards</span>, in the wake of Cawthorn's latest comments.",
    "author": "",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 2181,
    "mediaId": 43,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "? NC-11: While state Sen. <span class='selected-term'>Chuck Edwards</span>' new spot avoids directly mentioning freshman incumbent Madison Cawthorn, the person he's trying to unseat in next month's GOP primary, there's no question whom Edwards is comparing himself to when he says, \"If you want a celebrity, go watch the Kardashians.",
    "author": "",
    "title": "Morning Digest: Maryland's Republican governor and Democratic legislature reach redistricting deal"
  },
  {
    "id": 2878,
    "mediaId": 21,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Meanwhile, GOP figures like Thom Tillis, a senator from Cawthorn's home state, are backing one of his primary challengers <span class='selected-term'>Chuck Edwards</span>.",
    "author": "Cheryl Teh",
    "title": "Fox News host says Madison Cawthorn needs to name those involved in orgies and drugs, or admit to making up stories about DC's elite"
  },
  {
    "id": 2869,
    "mediaId": 43,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "But the most important thing is that just the other day, Republican Senator Thom Tillis announced that he would be endorsing state Senator <span class='selected-term'>Chuck Edwards</span>, who is running against Madison Cawthorn or in the May 17 GOP primary.",
    "author": "",
    "title": "The Downballot: How Democrats are fighting to hold the House (transcript)"
  },
  {
    "id": 2866,
    "mediaId": 43,
    "date": "4/8/2022 12:00:00 AM",
    "sentence": "Moving on to the topic of Madison Cawthorn, Republican Sen. Thom Tillis announced that he would be endorsing state Sen. <span class='selected-term'>Chuck Edwards</span>, who is running against Cawthorn in the May 17 GOP primary.",
    "author": "",
    "title": "Highlights from The Downballot: House Majority PAC and Democrats fight to hold Congress"
  },
  {
    "id": 1910,
    "mediaId": 238,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "David Weigel",
    "title": "The Trailer: The pandemic planner, the crypto billionaire and a bunch of angry Democrats"
  },
  {
    "id": 2675,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "The incumbent congressman is still supported by 38 percent of GOP voters, compared to 21 percent who back his top rival, state Senator <span class='selected-term'>Chuck Edwards</span>.",
    "author": "Jason Lemon",
    "title": "Madison Cawthorn Losing GOP Support Despite Keeping Large Primary Lead"
  },
  {
    "id": 2630,
    "mediaId": 593,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Tillis, who has endorsed state Senator <span class='selected-term'>Chuck Edwards</span>' challenge of Cawthorn, added: \"I just want better representation, better results for people out in the district.\"",
    "author": "David Morgan",
    "title": "Nude Video Latest Scandal Turning Republicans Against U.S. Rep. Cawthorn"
  }
]