[
  {
    "id": 1263,
    "mediaId": 43,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "State Sen. <span class='selected-term'>Chuck Edwards</span>, who has largely self-funded his campaign, ended 2021 with $329,000 in the bank.",
    "author": "",
    "title": "Morning Digest: With filing closed, here's how things looks in North Carolina's new House districts"
  },
  {
    "id": 2996,
    "mediaId": 409,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "He supports Ukraine and the Ukrainian President's efforts to defend their country against Russian aggression, but does not want America drawn into another conflict through emotional manipulation.?\nShortly after WRAL published the video, Cawthorn tweeted that Russian President Vladimir Putin's actions are disgusting? but claimed that propaganda is being used to entice America into another war? and said leaders, including Zelensky, should NOT push misinformation on America.?\nNorth Carolina state senator <span class='selected-term'>Chuck Edwards</span>, who is challenging Cawthorn in the Republican primary, pushed back against the congressman's claims, writing in a tweet, Let's be clear.",
    "author": "Brittany Bernstein",
    "title": "Madison Cawthorn Calls Zelensky a Thug,' Accuses Ukrainian Government of Pushing Woke Ideologies'"
  },
  {
    "id": 2953,
    "mediaId": 33,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "\"It comes down to focus on the district, producing results for the district, and in my opinion, Mr. Cawthorn hasn't demonstrated much in the way of results over the last 18 months,\" Tillis told CNN, describing why he is backing state Sen. <span class='selected-term'>Chuck Edwards</span> in his primary against Cawthorn.",
    "author": "Melanie Zanona, Manu Raju and Alex Rogers",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 251,
    "mediaId": 124,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "With Cawthorn once again in the headlines, North Carolina GOP Sen. Thom Tillis endorsed one of Cawthorn's primary challengers, state Sen. <span class='selected-term'>Chuck Edwards</span>, CNN reported yesterday.",
    "author": "",
    "title": "Potential new border surge presents one more challenge for Biden administration"
  },
  {
    "id": 2923,
    "mediaId": 233,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis, R-N.C., said Cawthorn \"has fallen well short of the most basic standards Western North Carolina expects from their representatives,\" and he supports state legislator <span class='selected-term'>Chuck Edwards</span> in the GOP primary scheduled for May 17.",
    "author": "David Jackson",
    "title": "More trouble for GOP Rep. Madison Cawthorn: North Carolina Republican senator endorses primary opponent"
  },
  {
    "id": 2945,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Ahead of the Tar Heel State's May 17 primary, Cawthorn is facing a number of opponents, including: state Sen. <span class='selected-term'>Chuck Edwards</span>, whom Tillis said he is endorsing; Michele Woodhouse, a self-described \"business-woman and political activist\"; Bruce O'Connell, a hotel and restaurant operator; Rod Honeycutt, a retired US Army colonel; Matthew Burril, a businessman and local economic leader; and Wendy Nevarez, a Navy veteran.",
    "author": "Rachel Janfaza",
    "title": "Who is Madison Cawthorn, the freshman congressman causing headline chaos for the GOP?"
  },
  {
    "id": 248,
    "mediaId": 151,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Tillis also issued a vocal endorsement Thursday of state Sen. <span class='selected-term'>Chuck Edwards</span> as the best Republican alternative to Cawthorn.",
    "author": "",
    "title": "Cloud of notoriety builds over Cawthorn after sex-and-drugs claims"
  },
  {
    "id": 2898,
    "mediaId": 136,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Thom Tillis, a GOP senator from Cawthorn's home state of North Carolina, announced that he would not be backing Cawthorn in his upcoming May primary, instead choosing to endorse one of his opponents, state Senator <span class='selected-term'>Chuck Edwards</span>.",
    "author": "Adam Staten",
    "title": "Cawthorn to Speak at Trump Rally Despite GOP Fury Over Orgy, Cocaine Claim"
  },
  {
    "id": 2900,
    "mediaId": 195,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Those latest allegations, in particular, have drawn the ire of Republican lawmakers in Washington, including House Minority Leader Kevin McCarthy (R-Calif.), who told reporters this week that Cawthorn had lost my trust, and he's going to have to earn it back.?\nMeanwhile, Sen. Thom Tillis (R-N.C.) announced that he would support Cawthorn's Republican primary challenger, state Sen. <span class='selected-term'>Chuck Edwards</span>, while retiring Sen. Richard Burr (R-N.C.) called the first-term congressman an embarrassment? in comments to CNN.",
    "author": "Max Greenwood",
    "title": "Cawthorn to speak at North Carolina Trump rally"
  },
  {
    "id": 2910,
    "mediaId": 21,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Throwing his weight behind Cawthorn's challenger, <span class='selected-term'>Chuck Edwards</span>, Tillis wrote that Edwards would \"never embarrass Western North Carolina with a consistent pattern of juvenile behavior, outlandish statements, and untruthfulness.\"",
    "author": "Cheryl Teh",
    "title": "GOP leaders from Madison Cawthorn's home state are backing his primary challenger after the congressman's orgy comments"
  },
  {
    "id": 2914,
    "mediaId": 1576,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "He's a little bit of a different commodity that probably does not have as strong a base outside the beltway than some of those other members.?\nRepublican Sen. Thom Tillis of North Carolina has formally endorsed a primary challenger, state Sen. <span class='selected-term'>Chuck Edwards</span>, in the wake of Cawthorn's latest comments.",
    "author": "",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 2869,
    "mediaId": 43,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "But the most important thing is that just the other day, Republican Senator Thom Tillis announced that he would be endorsing state Senator <span class='selected-term'>Chuck Edwards</span>, who is running against Madison Cawthorn or in the May 17 GOP primary.",
    "author": "",
    "title": "The Downballot: How Democrats are fighting to hold the House (transcript)"
  },
  {
    "id": 2845,
    "mediaId": 21,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "Meanwhile, other GOP figures like Thom Tillis, a senator from Cawthorn's home state, promptly backed one of Cawthorn's primary challengers, <span class='selected-term'>Chuck Edwards</span>, while accusing the congressman of embarrassing the GOP.",
    "author": "Cheryl Teh",
    "title": "Madison Cawthorn criticized GOP leaders for 'weakening' and 'cheapening' the Republican party's platform and chasing 'non-existent middle-ground voters'"
  },
  {
    "id": 2835,
    "mediaId": 43,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "He further enraged Republicans in his own state by briefly jumping districts, then changing his mind  after which the GOP leaders in the state legislature endorsed his opponent, state Sen <span class='selected-term'>Chuck Edwards</span>.",
    "author": "",
    "title": "Good News Roundup April 13 Edition"
  },
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "After Cawthorn alleged that D.C. leaders used cocaine and invited him to an orgy, top Republicans started actively supporting one of his challengers, state Sen. <span class='selected-term'>Chuck Edwards</span>.",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 2004,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Cawthorne's main opponent right now appears to be state Sen. <span class='selected-term'>Chuck Edwards</span>, who has the endorsement of Sen. Thom Tillis.",
    "author": "",
    "title": "Highlights from The Downballot: Confusion in New York over redistricting and a May primary overview"
  },
  {
    "id": 2757,
    "mediaId": 195,
    "date": "4/22/2022 12:00:00 AM",
    "sentence": "Cawthorn is facing a primary against several Republicans, with Sen. Thom Tillis (R-N.C.) throwing his endorsement behind Cawthorn's opponent, state Sen. <span class='selected-term'>Chuck Edwards</span> (R).",
    "author": "Lexi Lonas",
    "title": "Photos show Cawthorn wearing lingerie at apparent party: Politico"
  },
  {
    "id": 2747,
    "mediaId": 136,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "The advertisement comes as some Republicans in North Carolina consolidate support around his opponent state Senator <span class='selected-term'>Chuck Edwards</span>.",
    "author": "Andrew Stanton",
    "title": "Trump-Backed Cawthorn's 'Lies' Ripped in Ad by PAC Linked to GOP's Tillis"
  },
  {
    "id": 2738,
    "mediaId": 195,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "The ad released by state Sen. <span class='selected-term'>Chuck Edwards</span>, one of a number of Republicans taking on Cawthorn in the Tar Heel State's primary race, features photos Cawthorn posted on Instagram of himself on a boat, smoking a cigar and drinking a pineapple drink, among others.",
    "author": "Mychael Schnell",
    "title": "Cawthorn challenger knocks opponent for Instagram use in new ad"
  },
  {
    "id": 1919,
    "mediaId": 238,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis (R-N.C.) and a PAC aligned with him have helped <span class='selected-term'>Chuck Edwards</span>, a primary challenger of embattled Rep. Madison Cawthorn (R-N.C.).",
    "author": "",
    "title": "Post Politics Now Biden issues first pardons, commutations of his presidency"
  },
  {
    "id": 126,
    "mediaId": 43,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "? NC-11: GOPAC, a Republican super PAC that says it hasn't endorsed anyone in this race, is out with a survey from Differentiators Data that shows freshman Rep. Madison Cawthorn leading state Sen. <span class='selected-term'>Chuck Edwards</span> 38-21 in next month's Republican primary.",
    "author": "",
    "title": "Morning Digest: Trump pick for Nebraska governor attacks woman who accused him of assault in new ad"
  },
  {
    "id": 2674,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Tillis has come out in support of a primary challenger to Cawthorn, state Sen. <span class='selected-term'>Chuck Edwards</span> (R), in recent weeks.",
    "author": "Sarakshi Rai",
    "title": "Timeline of Madison Cawthorn controversies"
  },
  {
    "id": 2675,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "The incumbent congressman is still supported by 38 percent of GOP voters, compared to 21 percent who back his top rival, state Senator <span class='selected-term'>Chuck Edwards</span>.",
    "author": "Jason Lemon",
    "title": "Madison Cawthorn Losing GOP Support Despite Keeping Large Primary Lead"
  },
  {
    "id": 2689,
    "mediaId": 129,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "The group is supporting the campaign of a more mainstream Republican, State Senator <span class='selected-term'>Chuck Edwards</span>, who is running against Mr. Cawthorn.",
    "author": "",
    "title": "Pressure Mounts on Cawthorn as Scandals Pile Up"
  },
  {
    "id": 2665,
    "mediaId": 195,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "Cawthorn's two main opponents are state Sen. <span class='selected-term'>Chuck Edwards</span> (R), considered the so-called establishment pick, and Michele Woodhouse, a former GOP district chair.",
    "author": "Tal Axelrod",
    "title": "Mounting scandals fuel uncertainty over Cawthorn's reelection"
  },
  {
    "id": 2668,
    "mediaId": 237,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "If you're state Sen. <span class='selected-term'>Chuck Edwards</span>, running against Rep. Madison Cawthorn in North Carolina's 11th Congressional District, you focus on meat-and-potato problems and, more specifically, the mountains.?\nI'm running because the 14-month experiment here in District 11 has concluded, and it's time to send someone to Washington, D.C., to represent the people of the mountains who has a deep history of accomplishment in life and in business and in serving the people of the district,? Edwards told the Washington Examiner in an interview.",
    "author": "David M. Drucker",
    "title": "Chuck Edwards campaigns against Rep. Madison Cawthorn as the adult in the room"
  },
  {
    "id": 2630,
    "mediaId": 593,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Tillis, who has endorsed state Senator <span class='selected-term'>Chuck Edwards</span>' challenge of Cawthorn, added: \"I just want better representation, better results for people out in the district.\"",
    "author": "David Morgan",
    "title": "Nude Video Latest Scandal Turning Republicans Against U.S. Rep. Cawthorn"
  },
  {
    "id": 2633,
    "mediaId": 21,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "His main opponent is North Carolina state Sen. <span class='selected-term'>Chuck Edwards</span>, who Tillis endorses.",
    "author": "Camila DeChalus",
    "title": "Voters in Madison Cawthorn's North Carolina district have very mixed feelings about the freshman lawmaker as controversies swirl before his May 17 primary"
  },
  {
    "id": 2628,
    "mediaId": 163,
    "date": "5/6/2022 12:00:00 AM",
    "sentence": "Tillis, who has endorsed state Senator <span class='selected-term'>Chuck Edwards</span>' challenge of Cawthorn, added: \"I just want better representation, better results for people out in the district.\"",
    "author": "David Morgan",
    "title": "Nude video latest scandal turning Republicans against U.S. Rep. Cawthorn"
  },
  {
    "id": 3259,
    "mediaId": 238,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "Tillis and many of North Carolina's top Republicans, including the state's House speaker and Senate leader, are backing a challenger, state Sen. <span class='selected-term'>Chuck Edwards</span>, in next Tuesday's primary.",
    "author": "",
    "title": "Inside the Republican campaign to take down Madison Cawthorn"
  }
]