[
  {
    "id": 2946,
    "mediaId": 129,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "If you really want to back the blue, obey the law.?\nThe biggest primary threat to Mr. Cawthorn may come from a state senator, <span class='selected-term'>Chuck Edwards</span>, who has the endorsements of most members of the state legislature in the district.",
    "author": "",
    "title": "House Republicans Tire of Madison Cawthorn's Antics. Some in His District Have, Too."
  },
  {
    "id": 2815,
    "mediaId": 376,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "GOP Sen. Thom Tillis plans to appear as a special guest? at a fundraiser slated for next week benefiting <span class='selected-term'>Chuck Edwards</span>, a primary challenger of embattled North Carolina Rep. Madison Cawthorn, according to an invitation sent to potential donors in the lobbying sector.",
    "author": "Kate Ackley",
    "title": "GOP senators, lobbyists aid challengers to lightning rod House members"
  },
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "After Cawthorn alleged that D.C. leaders used cocaine and invited him to an orgy, top Republicans started actively supporting one of his challengers, state Sen. <span class='selected-term'>Chuck Edwards</span>.",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 1919,
    "mediaId": 238,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis (R-N.C.) and a PAC aligned with him have helped <span class='selected-term'>Chuck Edwards</span>, a primary challenger of embattled Rep. Madison Cawthorn (R-N.C.).",
    "author": "",
    "title": "Post Politics Now Biden issues first pardons, commutations of his presidency"
  },
  {
    "id": 2675,
    "mediaId": 136,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "The incumbent congressman is still supported by 38 percent of GOP voters, compared to 21 percent who back his top rival, state Senator <span class='selected-term'>Chuck Edwards</span>.",
    "author": "Jason Lemon",
    "title": "Madison Cawthorn Losing GOP Support Despite Keeping Large Primary Lead"
  }
]