[
  {
    "id": 243,
    "mediaId": 43,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "Morning Digest: Why GOP leaders finally want to boot Madison Cawthorn (it's not really about orgies)\nDaily Kos Staff, 4/1/2022\n? NC-11: Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. <span class='selected-term'>Chuck Edwards</span>' campaign to defeat freshman Rep. Madison Cawthorn in the May 17 Republican primary, saying the next day that the incumbent \"has fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "author": "",
    "title": "North Carolina Open Thread: Usual cast of villains, Rooftop solar, pharmaceutical waste and more"
  },
  {
    "id": 173,
    "mediaId": 238,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "After Cawthorn alleged that D.C. leaders used cocaine and invited him to an orgy, top Republicans started actively supporting one of his challengers, state Sen. <span class='selected-term'>Chuck Edwards</span>.",
    "author": "",
    "title": "The most interesting Republican primaries of 2022"
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "The narrator, who brands the congressman \"an attention-seeking embarrassment,\" does not mention Tillis' endorsed candidate, state Sen. <span class='selected-term'>Chuck Edwards</span>.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid"
  },
  {
    "id": 1931,
    "mediaId": 43,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "? NC-11: State Sen. <span class='selected-term'>Chuck Edwards</span>' latest ad for next month's Republican primary cuts right to the chase and calls far-right Rep. Madison Cawthorn an Instagramer who posts all day but doesn't actually do anything to solve the country's ongoing problems.",
    "author": "",
    "title": "Morning Digest: Michigan GOP nominates Big Lie boosters for secretary of state and attorney general"
  },
  {
    "id": 1890,
    "mediaId": 43,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Jeff Singer:\nCawthorn's main opponent right now looks like state Senator <span class='selected-term'>Chuck Edwards</span>, who has the endorsement of Senator Thom Tillis.",
    "author": "",
    "title": "The Downballot: Big, big May primary preview (transcript)"
  }
]