[
  {
    "id": 2924,
    "mediaId": 237,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Seven Republicans have entered the primary race to oust Cawthorn, with two sources telling the Washington Examiner that state Sen. <span class='selected-term'>Chuck Edwards</span> and businesswoman Michele Woodhouse could be viable contenders.",
    "author": "Juliegrace Brufke",
    "title": "Republicans turn against Rep. Madison Cawthorn after orgies and cocaine comment"
  },
  {
    "id": 2926,
    "mediaId": 136,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "North Carolina Republican Senator Thom Tillis told CNN this week that he intends to support Cawthorn's Republican opponent, state Senator <span class='selected-term'>Chuck Edwards</span>, as he attempts to defeat Cawthorn in the May primaries.",
    "author": "Jason Lemon",
    "title": "GOP Senators From Madison Cawthorn's State Won't Back His Re-Election Bid"
  },
  {
    "id": 2933,
    "mediaId": 195,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Another top candidate in the race is state Sen. <span class='selected-term'>Chuck Edwards</span>, who has been running television ads in the district for three weeks.",
    "author": "",
    "title": "Madison Cawthorn's antics miff GOP"
  },
  {
    "id": 2900,
    "mediaId": 195,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Those latest allegations, in particular, have drawn the ire of Republican lawmakers in Washington, including House Minority Leader Kevin McCarthy (R-Calif.), who told reporters this week that Cawthorn had lost my trust, and he's going to have to earn it back.?\nMeanwhile, Sen. Thom Tillis (R-N.C.) announced that he would support Cawthorn's Republican primary challenger, state Sen. <span class='selected-term'>Chuck Edwards</span>, while retiring Sen. Richard Burr (R-N.C.) called the first-term congressman an embarrassment? in comments to CNN.",
    "author": "Max Greenwood",
    "title": "Cawthorn to speak at North Carolina Trump rally"
  },
  {
    "id": 2905,
    "mediaId": 136,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Tillis has even endorsed one of Cawthorn's opponents in the May GOP primary, State Senator <span class='selected-term'>Chuck Edwards</span>.",
    "author": "Darragh Roche",
    "title": "Will 'Orgy' Claims Cost Madison Cawthorn His GOP Career?"
  },
  {
    "id": 2910,
    "mediaId": 21,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "Throwing his weight behind Cawthorn's challenger, <span class='selected-term'>Chuck Edwards</span>, Tillis wrote that Edwards would \"never embarrass Western North Carolina with a consistent pattern of juvenile behavior, outlandish statements, and untruthfulness.\"",
    "author": "Cheryl Teh",
    "title": "GOP leaders from Madison Cawthorn's home state are backing his primary challenger after the congressman's orgy comments"
  },
  {
    "id": 2824,
    "mediaId": 237,
    "date": "4/16/2022 12:00:00 AM",
    "sentence": "North Carolina Republican Sen. Thom Tillis made the rare move of publicly endorsing Cawthorn's primary opponent, state Sen. <span class='selected-term'>Chuck Edwards</span>, saying in a statement that Cawthorn has \"fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "author": "Andrew Kerr",
    "title": "Madison Cawthorn spent taxpayer funds at luxury resort"
  },
  {
    "id": 2707,
    "mediaId": 63,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Tillis endorsed Cawthorn's primary challenger <span class='selected-term'>Chuck Edwards</span> last month, saying Cawthorn has fallen well short of the most basic standards Western North Carolina expects from their representatives.? Tillis has also previously called for his fellow senator, Richard Burr (R-N.C.), to explain himself to the country over a call Burr made to his brother, who then sold shares in February 2020ahead of the stock market crash caused by the coronavirus pandemic.",
    "author": "Anna Kaplan",
    "title": "Sen. Tillis Calls For Insider Trading Probe Over Rep. Cawthorn's Ties To Let's Go Brandon' Meme Coin"
  }
]