[
  {
    "id": 3033,
    "mediaId": 43,
    "date": "2/28/2022 12:00:00 AM",
    "sentence": "His primary opponent (one of several) is state Senator <span class='selected-term'>Chuck Edwards</span> who has $329K cash on hand.",
    "author": "",
    "title": "Madison Cawthorn, chronic politically transmitted disease, is back in"
  },
  {
    "id": 251,
    "mediaId": 124,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "With Cawthorn once again in the headlines, North Carolina GOP Sen. Thom Tillis endorsed one of Cawthorn's primary challengers, state Sen. <span class='selected-term'>Chuck Edwards</span>, CNN reported yesterday.",
    "author": "",
    "title": "Potential new border surge presents one more challenge for Biden administration"
  },
  {
    "id": 2945,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Ahead of the Tar Heel State's May 17 primary, Cawthorn is facing a number of opponents, including: state Sen. <span class='selected-term'>Chuck Edwards</span>, whom Tillis said he is endorsing; Michele Woodhouse, a self-described \"business-woman and political activist\"; Bruce O'Connell, a hotel and restaurant operator; Rod Honeycutt, a retired US Army colonel; Matthew Burril, a businessman and local economic leader; and Wendy Nevarez, a Navy veteran.",
    "author": "Rachel Janfaza",
    "title": "Who is Madison Cawthorn, the freshman congressman causing headline chaos for the GOP?"
  },
  {
    "id": 2878,
    "mediaId": 21,
    "date": "4/5/2022 12:00:00 AM",
    "sentence": "Meanwhile, GOP figures like Thom Tillis, a senator from Cawthorn's home state, are backing one of his primary challengers <span class='selected-term'>Chuck Edwards</span>.",
    "author": "Cheryl Teh",
    "title": "Fox News host says Madison Cawthorn needs to name those involved in orgies and drugs, or admit to making up stories about DC's elite"
  },
  {
    "id": 2816,
    "mediaId": 195,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Sen. Thom Tillis (R-N.C.) recently endorsed state Sen. <span class='selected-term'>Chuck Edwards</span>, one of Cawthorn's challengers.",
    "author": "Emily Brooks",
    "title": "Secretly recorded call adds to controversy swirling around Cawthorn"
  },
  {
    "id": 2689,
    "mediaId": 129,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "The group is supporting the campaign of a more mainstream Republican, State Senator <span class='selected-term'>Chuck Edwards</span>, who is running against Mr. Cawthorn.",
    "author": "",
    "title": "Pressure Mounts on Cawthorn as Scandals Pile Up"
  }
]