{
  "id": 10130,
  "mediaId": 8507,
  "date": "2022-04-01",
  "headline": "Hundreds turn out in Cambridge event to honor fallen Marine Gunnery Sgt. James Speedy",
  "image": "https://www.gannett-cdn.com/presto/2022/04/01/NDAJ/c12c800c-dc91-4173-9d3a-8211100eea6c-GySgt_Speedy_-10.jpg?crop=4431,2493,x0,y225&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.daily-jeff.com/story/news/2022/04/01/cambridge-ohio-honors-usmc-fallen-marine-gunnery-sgt-james-speedy/7235028001/",
  "mediaOutlet": "zanesvilletimesrecorder.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristi R. Garabrandt",
  "authorUrl": "https://www.daily-jeff.com/staff/5552694002/kristi-r-garabrandt/",
  "termIds": [
    2143,
    1480,
    1630,
    982,
    553,
    753,
    110,
    5978,
    6027,
    6468
  ],
  "sentences": [
    "Speedy received several decorations for his service, including the Navy and Marine Achievement Medal with two gold stars, the Marine Corps Good Conduct Medal, the National Defense Service Medal and the Global War on Terrorism Service Medal, according to the Marine Corps.",
    "Speedy returned home with an escort from the Zanesville Municipal Airport by the Ohio State Highway Patrol, the Guernsey County Sherriff's Office (GSO), The Cambridge Police Department, The Patriot Guard Riders motorcycle group, and his family.",
    "The four Marines killed in the crash were assigned to Marine Medium Tiltrotor Squadron 261, Marine Aircraft Group 26, 2d Marine Aircraft Wing stationed on Marine Corps Air Station New River, North Carolina.",
    "Mike DeWine ordered American and state flags on all public buildings and grounds throughout Guernsey County be flown at half-staff until sunset on April 9, the day he will be laid to rest.",
    "The Cambridge Fire Department displayed a large flag from a ladder truck near the Thorn-Black Funeral Home, where services for Speedy are expected to take place next week.",
    "Austin Netting of Cambridge and Chris Kandibovich of Columbus decorated their truck with four large and several small flags.",
    "The Cambridge native was one of four Marines who died when their Osprey aircraft crashed March 18 during a NATO exercise.",
    "James Speedy, one of four Marines killed in a training accident in Norway, made its way into Cambridge Friday afternoon.",
    "Michael St.Clair, an Army National Guard, distributed small flags to those who came out to welcome Speedy home.",
    "The cause of the crash remains under investigation, but Norwegian police reported bad weather in the area.",
    "Kandibovich described Speedy as an outgoing person in high school, who always brought a smile to everyone.",
    "Kandibovich went to high school with Speedy and Netting attended school with his younger brother, Charles.",
    "\"For a guy to sacrifice his life, it's the least I can do on this day to show him respect,\" Netting said.",
    "Officials in Norway said the MV-22B Osprey crashed in Graetaedalen in Beiarn, south of Bodoe.",
    "Residents waved flags and red, white and blue bows lined the sidewalks and hung from posts.",
    "\"I'm really here to support the troops and show my respect,\" Kandibovich added.",
    "\"We just want to support the family and give our condolences,\" said Shirley.",
    "Hundreds turned out to pay their respects as a procession for Gunnery Sgt.",
    "Bill and Shirley Bertram came from Harrison County to pay their respects.",
    "Ross A. Reynolds, 27, of Leominster, Massachusetts, and Cpl.",
    "Matthew J. Tomkiewicz, 27, of Fort Wayne, Indiana, Capt.",
    "Jacob M. Moore, 24, of Catlettsburg, Kentucky.",
    "In honor of Speedy, Gov.",
    "The others were Capt.",
    "He was 30 years old."
  ]
}