{
  "id": 10174,
  "mediaId": 8480,
  "date": "2022-04-04",
  "headline": "Ohio leaders react to Sacramento’s mass shooting",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/04/Sacramento.png?w=1280",
  "link": "https://www.wdtn.com/news/local-news/ohio-leaders-react-to-sundays-sacramento-mass-shooting/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Ashley",
  "authorUrl": "https://www.wdtn.com/author/madeline-ashley/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Like I said every time we see that to all the survivors and loved ones that lost their loved ones it’s so retraumatizing when we watch them things.”\nThe tragedy in Sacramento brought flashbacks from the 2019 Oregon District mass shooting to Dayton City Commissioner Matt Joseph, who calls for more to be done to protect people from gun violence.",
    "I continue to be angry at the irresponsibility of our legislators who continue to let the conditions exist for this to happen again and again.”\nSacramento resident Haleigh Vanlandingham lives just ten minutes from where the shooting happened, and also visits the downtown area often.",
    "The Kings play right there so that is the main stretch of downtown in Sacramento.”\nPrior to the shooting, Vanlandingham said the downtown area in Sacramento always felt like a safe place to have a good time with friends, but now, she’ll be more cautious.",
    "Green continues to call for stricter gun control laws, but even in times like this where setbacks are faced in the fight, he relies on his faith to keep up the fight and continue to make his voice heard.",
    "“Even going out in a different part of town on the other side it just still felt so weird, and like kind of unsettling being out there and knowing they haven’t found the people who’ve done this.",
    "DAYTON, Ohio (WDTN) — The Sacramento, California mass shooting early Sunday morning which killed 6 people and injured 12 has left another tragic mark on U.S. soil at the hands of gun violence.",
    "“We also know that in the long run we’ve got to fix our mental health system, and that certainly doesn’t that people who have a mental health problem are criminals, that’s not true at all.",
    "Just as our heart has to go out, our hearts have to go out to victims in cities across the state when you’re seeing a child killed, and violent crimes occurring,” Ohio Gov.",
    "Dayton resident Dion Green’s father was one of the nine people killed, and recalls his reaction after seeing Sunday’s devastating news in Sacramento.",
    "“Not only just there the night before, I go out there all the time because that’s the main place where there’s tons bars, restaurants, and action.",
    "DeWine signed a Constitutional Carry Law which allows people 18-and-older to carry firearms without training classes or background checks.",
    "The tragedy also hits home here in Ohio after the Oregon District mass shooting in August of 2019 which killed 9 and injured 27 others.",
    "However, the Ohio governor says he’s calling for more to be done to get violent offenders off the streets.",
    "But, we’ve got to be able to give them in their local community the support and help they need,” Gov.",
    "“I’m not even going to lie, when I seen it, it kind of gave me chills because I seen people running.",
    "“It was just kind of an eerie feeling knowing that I was just there,” Vanlandingham said.",
    "Especially something that looks so similar to what happened here,” Joseph said.",
    "You don’t know why they did it or what happened or the story behind anything.",
    "“My purpose is to be a voice and to be wherever I’m needed at in that realm.",
    "“The first reaction is oh no, oh no I can’t believe this is happening again.",
    "“He didn’t take me that night so he left me with a purpose,” Greene said.",
    "You don’t know if it’s the person right next to you,” Vanlandingham said.",
    "To share and speak on the affects of gun violence.”",
    "Sunday’s mass shooting comes not long after Gov.",
    "It just reminded me of my night,” said Green.",
    "“Our heart goes out to all the victims.",
    "“Second, I was just angry.",
    "Mike DeWine said.",
    "DeWine said."
  ]
}