{
  "id": 10267,
  "mediaId": 8494,
  "date": "2022-04-04",
  "headline": "Ohio Republican redistricting commissioners make their case against court reprimands",
  "image": "https://npr.brightspotcdn.com/dims4/default/7297ee1/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Fcd%2Fe0%2F0298b90243368fc0d078e24cd418%2Fohio-redistricting-commission-3-27-22.jpg",
  "link": "https://www.wksu.org/government-politics/2022-04-04/ohio-republican-redistricting-commissioners-make-their-case-against-court-reprimands",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow",
  "authorUrl": "https://www.wksu.org/people/andy-chow",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/zAsJ8e2QTr\n— \"The State Of Ohio\" PBS News Program (@stateofohioshow) March 29, 2022\nThe Republican legislative leaders said — had they stuck with the independent mapmakers — the commission would not have made the court's deadline of passing a plan by March 28.",
    "'A shocking turn'\nVoter rights advocates, community organizations, and a national Democratic group have asked the court to order the commissioners to explain why they should not be held in contempt of court based on the events leading up to adoption of the March 28 maps.",
    "The court battle over Ohio's latest state legislative district maps — the fourth attempt by redistricting officials — is happening in two different forms: an objection to the plan and a motion to hold the redistricting commissioners in contempt of court.",
    "The filing from Senate President Matt Huffman (R-Lima) and House Speaker Bob Cupp (R-Lima) cited the portion of the constitution that states the court does not have the ability to implement a district map that has not been adopted by the commission.",
    "Following the rules\nWhen ruling against the third attempt at state legislative district maps, which were adopted on February 24, the court included several rules for the Ohio Redistricting Commission to follow when drafting a new plan.",
    "Petitioners say the GOP commissioners \"hijacked\" the redistricting process by adopting a new state legislative district plan that only featured slight changes from the third plan, which was already found unconstitutional by the court.",
    "\"By filing these show-cause motions, petitioners are distracting the court from its constitutional duty to review the merits of the fourth commission-passed General Assembly-district plan,\" writes Brodi Conover, attorney for Faber.",
    "\"What is beyond the court’s authority is the power to directly or indirectly, under the threat of contempt or otherwise, compel the implementation or adoption of any general assembly district plan,\" wrote counsel for for Gov.",
    "While Faber voted against the fourth round of House and Senate district maps, he and the other Republican commissioners made similar arguments for why members on the redistricting panel should not be held in contempt.",
    "With the objections filed against the latest district maps and a motion to hold commissioners in contempt, Auditor Keith Faber (R-Ohio) says, through counsel, that petitioners want \"two bites at the apple.\"",
    "Through court filings, the members said the state supreme court is a co-equal branch of government to the redistricting commission and therefore cannot tell the commission how to perform its function.",
    "Separation of powers\nThe Republican redistricting commissioners argued that the Ohio Supreme Court does not have the authority to penalize members for decisions they make while drafting new maps.",
    "House @SpeakerCupp explains why Republicans on the Ohio Redistricting Commission tweaked House and Senate maps that were ruled unconstitutional instead of using those created by hired mapmakers.",
    "They noted the landmark DeRolph v. State case in which the court found Ohio's school funding formula to be unconstitutional in 1997 but declined to instruct the state on how to fix the system.",
    "By its sponsors’ admission, it is the invalidated second revised plan with 'only minor changes,'\" wrote Freda Levenson, attorney for ACLU of Ohio, on behalf of the League of Women Voters.",
    "Objections in state and federal court\nThe process to redraw Ohio House and Ohio Senate district maps is once again in limbo as the court considers the objections raised by petitioners.",
    "The plan adopted by the commission at the eleventh-hour on March 28 and submitted to the court is not the bipartisan, transparently drawn, map of the entire commission.",
    "However, they said the state legislative district plan that was ultimately adopted was the product of tweaks made by Republican legislative staff behind closed doors.",
    "Meanwhile, the federal court has stated that it will have to weigh in on Ohio's redistricting case if state officials are unable to come up with a plan by April 20.",
    "Those petitioners acknowledge the transparent and independent process created by the members of the commission in the 10 days they had to adopt a fourth plan.",
    "Along with the request to hold commissioners in contempt, the Ohio Supreme Court is also considering the overall objection to the maps adopted on March 28.",
    "Only a good faith effort to comply with this court’s orders,\" stated in the memo filed by Yost, on behalf of Huffman and Cupp.",
    "With early voting already under way, local boards of elections removed state legislative races from the May 3 primary.",
    "Because of that new process, Huffman and Cupp told the court they carried out every task directed in the last ruling.",
    "They added that they did not go with the plan drawn by the independent mapmakers because it was not ready in time.",
    "Another primary will be scheduled once a final decision has been made on Ohio's state legislative district maps.",
    "\"Only after that became clear did the commission adopt the 'failsafe' plan that complies with the constitution.",
    "They hired independent mapmakers and created a live stream of those experts drawing new district lines.",
    "\"Matters took a shocking turn, as the process was hijacked by four Republican commissioners.",
    "Republicans on the Ohio Redistricting Commission are the main target for the latter.",
    "@Russo4Ohio says she thinks there's another reason why they made that choice.",
    "Mike DeWine (R-Ohio), submitted by Attorney General Dave Yost (R-Ohio).",
    "The commission reconvened on March 18 to begin that new process.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "There is no contempt."
  ]
}