{
  "id": 10274,
  "mediaId": 8473,
  "date": "2022-03-30",
  "headline": "State maps draw ire for little change",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/news/local-news/2022/03/state-maps-draw-ire-for-little-change/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "NEWSLETTER\nToday's breaking news and more in your inbox\nLocal News\nOn the record: Lordstown\nWHAT: Board of Education meeting April 20 PRESENT: Cheryl Kistler, Jackie Woodward, William Catlin, Niki ...\nRobotics teams end season with awards\nWARREN — FIRST Robotics teams from Warren G. Harding High School and Champion High School finished the season at ...\nVeterans group seeks parade participants\nWARREN — The Trumbull County Veterans Services Commission is seeking participants for the 2022 Trumbull County ...\nCortland man guilty in counterfeiting case\nWARREN — A Cortland man Monday pleaded guilty to a charge of attempting counterfeiting connected to an October ...\nWarren man gets 2 years in robbery\nWARREN — A Warren man received a two-year prison sentence Monday for his part in a May 30, 2020, robbery at ...\nUdderly Smooth president, music ed grad to speak at YSU\nYOUNGSTOWN — William “Bill” Kennedy Jr., president of Redex Industries, the manufacturer of Udderly Smooth ...",
    "Yost calls amendment that created commission an ‘epic failure’ as 4th try sent to high court\nCOLUMBUS — The next set of proposed boundaries for new state legislative districts has arrived at the Ohio Supreme Court, which must decide for the fourth time whether the maps are constitutionally sound.",
    "The new 59th House District, which would favor Democrats by about 5 percent, would include Youngstown, Coitsville, Ellsworth, Poland, Sebring, New Middletown, North Lima, Smith, Goshen, Green, Beaver and Springfield along with three townships in northwestern Columbiana County.",
    "Ohioans overwhelmingly supported a 2015 constitutional amendment that mandated the redistricting commission at least attempt to avoid partisan favoritism and to distribute districts proportionally to reflect Ohio’s 54 percent Republican, 46 percent Democratic split.",
    "RELATED DEVELOPMENT\nIn a related development, new and still-disputed congressional maps are likely to stay in place for the May 3 primary under a schedule for hearing arguments in that case established by the court Tuesday morning.",
    "Late in the afternoon, the commission reversed course and voted 5-2 to revive maps previously declared unconstitutional by the court and make some adjustments to them in the hopes of fixing problems identified by the court.",
    "The court rejected the previous three sets of Ohio House and Senate maps drawn by the panel, ruling in a 4-3 vote each time that the plans unconstitutionally were gerrymandered to favor Republicans unduly.",
    "In Mahoning County, the 33rd Senate District would include all of Mahoning, Columbiana and Carroll counties and favor Republicans by about 9.5 percent, according to partisan statewide voting trends.",
    "The 58th House District, which would favor Democrats by less than 1 percent, would include Austintown, Boardman, Canfield, Berlin, Milton, Jackson, Craig Beach, Struthers, Campbell and Lowellville.",
    "TWEAKED MAPS\nLate Monday, the redistricting commission voted 4-3 along mostly partisan lines to revive a set of slightly altered legislative maps already rejected by the court earlier this month.",
    "The maps approved Monday night, created by GOP staffers, come closer to the 54 percent-46 percent target by decreasing the number of competitive districts that favor Democrats, Republicans said.",
    "The likelihood of the court approving those maps already appeared uncertain, after the state’s political mapmaking body created them late Monday from a previously rejected set of maps.",
    "A new 64th House District, which would favor Democrats by almost 10 percent, includes all of Warren, Girard, Liberty, Niles, Hubbard, Vienna, Howland, McDonald and Weathersfield.",
    "In doing so, the commission set aside the efforts of two independent mapmakers paid $450 per hour for the last four days to draw new maps in work viewed step-by-step online.",
    "Nothing in the Mahoning Valley was changed except the removal of Hanover Township in Columbiana County from a state House district that includes parts of Mahoning County.",
    "The rest of Trumbull County, along with a large portion of Ashtabula County, would be in a solid Republican 65th House District, favoring that party by about 23 percent.",
    "LAST MINUTE\nThroughout Monday, the redistricting commission awaited final results from its two independent mapmakers who worked through the weekend on new maps.",
    "Republican State Auditor Keith Faber joined state Sen. Vernon Sykes, an Akron Democrat, and Rep. Allison Russo, the top House Democrat, in rejecting the maps.",
    "The GOP-controlled Ohio Redistricting Commission approved those congressional maps March 2 over Democrats’ objections that they unfairly favor Republicans.",
    "Republican Attorney General Dave Yost on Tuesday called the amendment creating the commission “an epic failure” and said the state needs to start over.",
    "Cupp called the vote “the best that could be done in the time that we were allotted by the Supreme Court.”\nDemocrats sharply criticized the move.",
    "“There seems to be no end to the arrogance of the super-majority,” Sykes said, referring to Republicans’ majority in the House and Senate.",
    "Russo called it “a slap in the face to Ohio voters” that disregarded the Supreme Court’s order to draw constitutional maps.",
    "The district would be a safe Republican district, favoring that party by more than 10 percent according to voting trends.",
    "Four Republicans — Secretary of State Frank LaRose, Senate President Matt Huffman, House Speaker Bob Cupp, and Gov.",
    "The new maps are virtually the same as the ones that were ruled unconstitutional for a third time by the court.",
    "The 32nd Senate District would include all of Trumbull and Ashtabula counties and a section of Geauga County.",
    "A “safety valve” was needed to ensure the commission made the court’s midnight deadline Monday, Huffman said.",
    "“Sheer disgust,” Jen Miller, executive director of the Ohio League of Women Voters, said after the vote.",
    "She suggested a ballot issue may be needed to create an entirely independent redistricting commission.",
    "“If we’re not going to land the plane, it would be nice to have a parachute,” he said.",
    "It’s the same district as the one that currently exists except it adds more of Geauga.",
    "Before the removal of Hanover, the district favored Democrats by about 3 percent.",
    "The current district includes all of Mahoning and Columbiana counties.",
    "Mike DeWine — voted in favor of the tweaked maps.",
    "Arguments were scheduled well past the primary."
  ]
}