{
  "id": 10372,
  "mediaId": 8498,
  "date": "2022-03-31",
  "headline": "Federal judges considering Ohio redistricting lawsuit, but lawmakers have no plans to move primary",
  "image": "https://woub.org/wp-content/uploads/2020/07/bob_cupp-e1596144924942.jpg",
  "link": "https://woub.org/2022/03/31/federal-judges-considering-ohio-redistricting-lawsuit-but-lawmakers-have-no-plans-to-move-primary/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Kasler | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/karen-kasler-statehouse-news-bureau/",
  "termIds": [
    0
  ],
  "sentences": [
    "My hope is, it goes forward on May 3.”\nAs Cupp was speaking, three federal judges were hearing arguments on whether to order a set of maps put into place, to move the primary or related dates or to wait till the Ohio Supreme Court decides on the latest set of maps approved Monday.",
    "Amanda Grandjean said that boards of elections would need a minimum of 74 days, and the law requires 90 days between the filing deadline and election day – potentially pushing the calendar out till August.",
    "While a pair of Senate Democrats have sponsored a bill to move the May primary to June 28, House Speaker Bob Cupp (R-Lima) said majority Republicans aren’t proposing moving or splitting the primary.",
    "Secretary of State Frank LaRose, who voted for all the invalidated maps as a member of the Ohio Redistricting Commission – as did Cupp, along with Senate President Matt Huffman (R-Lima) and Gov.",
    "< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — Early voting starts next week for the May 3 primary, but right now it’s unknown when voters will decide Ohio House and Senate races.",
    "But LaRose’s director of elections testified earlier that holding a full primary on May 3 is all but impossible.",
    "They’re not on that ballot because there are no constitutional district maps.",
    "And state lawmakers are waiting on a panel of federal judges to make a move.",
    "Maybe the federal court will have an answer – maybe they won’t,” Cupp said.",
    "“Whenever we get some sort of clarification, we’ll try to make a decision.",
    "“The question is, if the primary is moved, where do you move it to?",
    "Mike DeWine – told the judges he prefers a single primary.",
    "I mean, nobody knows that date."
  ]
}