{
  "id": 10445,
  "mediaId": 8363,
  "date": "2022-04-01",
  "headline": "Business briefs: Local manufacturing forum, USDA extension, In-Demand Jobs Week",
  "image": "https://www.gannett-cdn.com/-mm-/d4eaed6aec50f036bc9845757aa8d530ff8579a6/c=0-65-300-234/local/-/media/2017/06/08/OHGroup/Mansfield/636325340634294239-BizBriefLogo.png?width=300&height=169&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/04/01/business-briefs-richland-county-manufacturing-forum-usda-funding/7191592001/",
  "mediaOutlet": "mansfieldnewsjournal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mansfield News Journal",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“This year, we are specifically bringing awareness to jobs that pay over $50,000 a year and require less than a year of training, giving Ohioans a clear path to their next opportunity.”\nIn-Demand Jobs Week is designed to promote Ohio’s most in-demand and fastest-growing industries through statewide hiring, education, and training events.",
    "USDA extends application deadline for Meat and Poultry Processing Expansion Program funding\nWASHINGTON — U.S. Department of Agriculture (USDA) is extending to May 11 the application deadline for the Meat and Poultry Processing Expansion Program (MPPEP), which provides funding to expand meat and poultry processing capacity.",
    "“The best way to find out if a job is for you is to try it out, and students will have that opportunity to do just that.”\n“During In-Demand Jobs Week, we shine a light on career opportunities that give job seekers a path toward new, high-paying jobs in fields where Ohio businesses are hiring immediately,” said Husted.",
    "USDA encourages applications that benefit smaller farms and ranches, new and beginning farmers and ranchers, Tribes and tribal producers, socially disadvantaged producers, military veteran producers and underserved communities.",
    "Manufacturing forum to be held April 29\nThe Regional Manufacturing Coalition (RMC), representing Ashland, Crawford, Huron, Knox and Richland counties, will host a manufacturing forum April 29 at the Gorman Rupp Training Center.",
    "USDA is offering grants of up to $25 million each to expand processing capacity through a variety of activities, including but not limited to construction, expansion of existing facilities and acquisition of equipment.",
    "The decision to extend the deadline comes after Rural Development heard from applicants about challenges with System for Award Management (SAM) registration, which must be completed prior to filing an application.",
    "This year, In-Demand Jobs Week will highlight Ohio’s top jobs that pay more than $50,000 per year and don’t require a degree or years of training–just a credential.",
    "Jon Husted, who serves as director of the Governor’s Office of Workforce Transformation, announced the fifth annual In-Demand Jobs Week will take place May 2-6.",
    "“In-Demand Jobs Week is a great chance for businesses to open their doors and showcase the many top jobs, industries and skills across Ohio,” said DeWine.",
    "The guest presenters for the roundtable discussion will be state Rep. Marilyn John and state Sen. Mark Romanchuk, a founding member of the RMC.",
    "Anyone who has questions they would like addressed are asked to email Jeff Miller at director@rmcohio.org or call 419-884-2164.",
    "USDA Rural Development is making $150 million of American Rescue Plan Act funding available through the MPPEP.",
    "Organizations can visit TopJobs.Ohio.gov to add their event to the In-Demand Jobs Week map.",
    "The event begins with networking at 7:30 a.m. followed by the meeting at 8 a.m.",
    "Questions may be submitted through the website or sent to MPPEP@usda.gov.",
    "Fifth annual In-Demand Jobs Week set for May\nCOLUMBUS — Gov.",
    "The lawmakers will provide updates from the statehouse.",
    "For more information, visit www.rd.usda.gov/mppep.",
    "Mike DeWine and Lt. Gov."
  ]
}