{
  "id": 10452,
  "mediaId": 8496,
  "date": "2022-04-01",
  "headline": "Body of Ohio Marine killed in NATO exercise crash returns home",
  "image": "https://media.wkyc.com/assets/WBNS/images/ef032a3c-d37c-46b5-b199-7de8e56afe94/ef032a3c-d37c-46b5-b199-7de8e56afe94_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/body-of-ohio-marine-killed-nato-exercise-crash-returns-home/530-74d771c7-d8fc-4a67-9818-22efec71329e",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Ohio Governor Mike DeWine ordered that flags be lowered to half-staff at all public buildings and grounds in Guernsey County, the Ohio Statehouse, the Vern Riffe Center and the Rhodes State Office Tower.",
    "Speedy’s family and law enforcement from across the state lined up on Wheeling Avenue in Guernsey County on Friday afternoon as his body returns home.",
    "According to the U.S. Marine Corps, the four were on an Osprey aircraft when it crashed in a Norwegian town in the Arctic Circle.",
    "The cause of the crash remains under investigation, but Norwegian police reported bad weather in the area at the time.",
    "CAMBRIDGE, Ohio — The body of an Ohio Marine killed during a NATO training exercise returned home on Friday.",
    "Speedy earned two gold stars, several medals and multiple certificates and letters of appreciation.",
    "Gunnery Sergeant James Speedy, 30, was among four Marines who died last month during the exercise.",
    "DeWine said the flags will remain at half-staff until sunset on Saturday - the day of Gunnery Sgt.",
    "He would always want to talk to you about anything.”\nGunnery Sgt.",
    "Since joining the Marine Corps in June 2009, Gunnery Sgt.",
    "Speedy will be buried in his hometown of Cambridge.",
    "“Just always being there to talk to,” Charles said.",
    "To his younger brother, Charles, Gunnery Sgt.",
    "Speedy was more than a well-respected Marine.",
    "“I think he was that guy.",
    "Members of Gunnery Sgt.",
    "He was also an idol.",
    "Speedy's funeral."
  ]
}