{
  "id": 10503,
  "mediaId": 8498,
  "date": "2022-03-29",
  "headline": "Southeast Ohio veterans and lawmakers push to keep Chillicothe VA Med Center’s doors open",
  "image": "https://woub.org/wp-content/uploads/2022/03/Screen-Shot-2022-03-29-at-6.44.07-PM-e1648594065404.jpeg",
  "link": "https://woub.org/2022/03/29/southeast-ohio-veterans-and-lawmakers-push-to-keep-chillicothe-va-med-centers-doors-open/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Donaldson",
  "authorUrl": "https://woub.org/post_author_new/sarah-donaldson/",
  "termIds": [
    0
  ],
  "sentences": [
    "You talk to anybody that works out there, and they’ll tell you that they have pride in their facility.”\nJohnson said the medical center has a long history and a strong standard for mental health treatment, which is why he’s introduced a resolution in the Ohio General Assembly to urge the Department of Veterans Affairs to keep its Chillicothe Medical Center’s doors open.",
    "Kaltenbach and more than fifty others attended a town hall at the American Legion on Main Street in Chillicothe Thursday night to hear more information about what the report could mean for the medical center — and many, to express frustration with the possibility of its closure.",
    "The report, which is a broader market assessment of veteran health care for the Asset and Infrastructure Review (AIR) Commission, cites the location, age and use of the buildings on the Chillicothe campus as reasons for recommending its closure.",
    "A recent U.S. Department of Veterans Affairs report recommended closing the center, which oversees outpatient clinics in six rural Southeast Ohio counties — and it has left the future of VA health care in the region uncertain.",
    "“Family means everything to somebody who has dementia, and I’ve been married to this man for 54 years, and I don’t want to lose him or have him go so far away,” Pamela Kaltenbach, the wife of a U.S. Air Force Veteran said.",
    "< < Back to\nCHILLICOTHE, Ohio (WOUB) — Veterans and lawmakers across Southeast Ohio are fighting to keep open the Chillicothe VA Medical Center, which has served veterans in the region for close to 100 years.",
    "But the recommendations is mobilizing the local community: From veterans, to workers at the medical center that employs more than 1,400 people, to some federal and state lawmakers.",
    "State Rep. Mark Johnson (R-Chillicothe), who was also at the town hall, said in an interview he was surprised to learn what the Department of Veterans Affairs prescribed.",
    "Under the suggestions in the report, inpatient and outpatient treatment would relocate to already existing or newly established VA clinics in Ohio.",
    "I think the people of Ohio should send a loud signal that we want to save this facility,” Johnson said.",
    "After this period of public comment, the commission will finalize recommendations in January 2023.",
    "President Joe Biden will either approve or disapprove the report in entirety by March 2023.",
    "“The bottom line is that veterans should come first,” U.S. Navy Veteran Mike Westfall said.",
    "“I just don’t think that we should just sit back and let the federal government decide.",
    "Senators Sherrod Brown (D-Ohio) and Rob Portman (R-Ohio) and Ohio Gov.",
    "“I would say that most of Southern Ohio was surprised,” Johnson said.",
    "Mike DeWine attended to take down public comments from attendees.",
    "“To hell with the dollars.”\nRepresentatives for U.S.",
    "“To us, it’s a jewel of a facility."
  ]
}