{
  "id": 10616,
  "mediaId": 8497,
  "date": "2022-03-29",
  "headline": "Using electronic communications devices while driving may soon be prohibited in Ohio if bill passes",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/texting-1486419267.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/texting-and-driving-ohio-bill/39576320",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lawson Gutzwiller",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Car crashes are the leading cause of death for children, ages 8 to 24.”\nRight now in Ohio, drivers are prohibited from using a handheld wireless communication device to write, send or read text-based communications while driving, except for emergency or navigation purposes.",
    "Lampton said during the hearings, the bill received \"overwhelming support\" from various groups such as the Ohio State Highway Patrol, the Ohio Department of Transportation and the Ohio Chamber of Commerce.",
    "“Representatives Abrams and Lampton have a bill — House Bill 283 — pending before you now, that if passed will significantly help decrease distracted driving tragedies,” said DeWine.",
    "The two representatives said the goal of the bill is to reduce the number of distracted driving tragedies by prohibiting the use of electronic communication devices while driving.",
    "COLUMBUS, Ohio —\nTwo Ohio lawmakers are working to pass a bill that would prohibit using electronic communications devices while driving.",
    "DeWine’s support for this legislation.”\nThe bill has already had four hearings in the House Criminal Justice Committee.",
    "Mike DeWine gave his State of the State address where he mentioned the importance of passing House Bill 283.",
    "“I’m very pleased that ending distracted driving is included in the Governor’s priorities,” Abrams said.",
    "For most Ohio drivers, there are no specific restrictions for talking on the phone while driving.",
    "House Bill 283 is currently waiting for a fifth hearing in the House Criminal Justice Committee.",
    "State Rep. Brian Lampton and State Rep. Cindy Abrams introduced House Bill 283 in May 2021.",
    "As Governor DeWine mentioned in his address, lives truly are at stake,” Lampton said.",
    "“I am proud to sponsor House Bill 283 with Rep. Abrams, and I am pleased with Gov.",
    "Please pass this bill.”\n“Distracted driving tragedies are 100% preventable.",
    "“My friends, lives are at stake.",
    "Last Wednesday, Ohio Gov."
  ]
}