{
  "id": 10650,
  "mediaId": 8494,
  "date": "2022-03-31",
  "headline": "Ohio is expanding its gun ballistics testing program",
  "image": "https://npr.brightspotcdn.com/dims4/default/ad673ca/2147483647/strip/true/crop/4928x2587+0+346/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Flegacy%2Fsites%2Fwksu%2Ffiles%2F201908%2Fgun_show_-_keith_homan_shutterstock.jpg",
  "link": "https://www.wksu.org/government-politics/2022-03-31/ohio-is-expanding-its-gun-ballistics-testing-program",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Richmond",
  "authorUrl": "https://www.wksu.org/people/matthew-richmond",
  "termIds": [
    3235,
    625,
    6474
  ],
  "sentences": [
    "“It's high tech shoe leather.”\nMost of the $10.5 million will go to the attorney general’s Bureau of Criminal Investigation, which will be in charge of testing on behalf of local police departments.",
    "“It's being able to match different things and pieces of evidence that comes from different places and tie them together,” Ohio Attorney General Dave Yost said during a press conference Thursday.",
    "He joined Yost to announce an initiative to buy nine new NIBIN machines and an outreach campaign to convince agencies to send all their recovered casings and firearms in for testing.",
    "Or recovered guns are fired at law enforcement labs and then those casings are added to the national database to find other instances when that gun may have been used in a crime.",
    "The money would purchase machines to scan casings from fired ammunition to compare with other casings in the National Integrated Ballistic Information Network or NIBIN.",
    "In an effort to prevent gun violence in Ohio, the state is planning to spend $10.5 million dollars to expand police use of ballistics testing technology.",
    "“As a result of this current shooting cases will be solved faster, future shootings will be prevented and lives will be saved,” DeWine said.",
    "About $1 million will go to Ohio State Highway Patrol, which will now be able to conduct its own testing of confiscated firearms.",
    "Governor Mike DeWine said most police departments in Ohio don’t use NIBIN in their investigations.",
    "When a gun is fired, it leaves marks on the casing that’s often left behind at a crime scene.",
    "The state plans to increase the number of machines it owns from seven to 16.",
    "Those marks can be used to find casings that were fired from the same gun."
  ]
}