{
  "id": 10828,
  "mediaId": 2537,
  "date": "2022-03-14",
  "headline": "Letters: Kids consume enough sugary drinks to fill a bathtub",
  "image": "https://www.gannett-cdn.com/-mm-/a60b4e05ce75873d10bdd7956b82ad265b7cb3be/c=0-154-3000-1842/local/-/media/Cincinnati/2015/04/11/B9316907828Z.1_20150411134441_000_GP2AEU0IS.1-0.jpg?width=3000&height=1688&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/03/14/letters-kids-consume-enough-sugary-drinks-fill-bathtub/9445320002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2143,
    2503,
    2765,
    2787,
    3191,
    4595,
    4905,
    276
  ],
  "sentences": [
    "William Moffat, Oakley\nFoolish to think US can go green overnight\nOne has to wonder if Joe Biden is compromised in some way to the progressive wing of his party, since common sense dictates that he let America \"do its thing\" and start utilizing the natural resources at our disposal to get us out of the current energy crisis.",
    "Alyson Poling, Executive Director, Cincinnati American Heart Association, Finneytown\nSoda ban will have no effect on childhood obesity\nCincinnati City Council is about to pass a non-sensical regulation that will ban private companies from listing soda items on kid's menus.",
    "Now, if that's out of your price range and you insist on driving your gas-powered auto, NBC provided a tip on a recent evening news broadcast that is sure to get America moving in the right direction: slow down a few miles per hour when driving on the interstate.",
    "Most of us realize that a gradual transition to \"greener\" energy would be a good thing, but to eliminate fossil fuels in an \"overnight\" manner is not only foolish, but it puts a severe financial strain on middle and lower-class Americans.",
    "Michael Marchal, North Avondale\nSlow down or buy an electric car\nPresident Biden and Transportation Secretary Pete Buttigieg both put forth the perfect solution to counter the high cost of gasoline at the pump: buy an electric car!",
    "A second letter from a Montfort Heights resident pointed out that Russian President Vladimir Putin did not invade the Ukraine during Trump's administration but did under George W. Bush's, Barack Obama's and Biden's administrations.",
    "Jean Swartley, South Cumminsville\nLogic is still logic even if we disagree on some facts\nIn my freshman year at Xavier University, I had to take a logic course, a requirement that I have come to appreciate more and more.",
    "One letter accused President Joe Biden of eliminating the mask requirement the day before the State of the Union address for political reasons even though the science had not changed.",
    "Louise Easterly, Mason\nWe must embrace the hard work of democracy\nThank you, Robert Rack, for your guest column, \"Reflection on the gift of democracy before it's too late.\"",
    "Wouldn't it be admirable if the rich oil companies made some sacrifices for the common good and absorbed some of the excess costs instead of passing it on to the consumer?",
    "Instead, he remains entrenched in the leftist agenda to destroy traditional American energy sources by refusing to divert from his self-destructive Green Energy policies.",
    "This letter betrayed more of an ignorance of the latest guidelines and a cynicism about the president's character than any logical connection between the events.",
    "Oil companies should make sacrifice for the common good\nAs consumers, we are all being asked to make sacrifices in one way or another to make ends meet.",
    "On average, children drink more than 30 gallons of sugary beverages annually – enough to fill a bathtub, and seven times the recommended maximum.",
    "We all want healthy kids, and the Healthy Default Beverage ordinance is a small way to support parents wanting healthy options for their kids.",
    "With one-issue voters, social media, misleading soundbites, unquestioning devotion to left or right news stations, we're in trouble.",
    "Democracy was found to be difficult and so many are leaning toward something easier – follow the leader and don't bother thinking.",
    "Under this policy, parents can still choose a sugary drink for their kids but makes milk, 100% juice or water the offered options.",
    "City Council can do no more to stop obesity than they can to stop global warming – another lofty (lefty) goal they have adopted.",
    "Americans have become so coddled by comfort ,and convenience, and so lazy when it comes to really understanding our government.",
    "During the pandemic, we have seen our businesses struggle as well, and they too have made necessary sacrifices to stay afloat.",
    "We have road rage incidents and hostile stranger encounters which result in fights that quickly escalate to gun casualties.",
    "The letter writer turned a complex sequence of geopolitical events into a simplistic analysis of Putin's motivation.",
    "One of the logical fallacies that I learned about was not to turn chronological sequence into a causal connection.",
    "Mike DeWine: Please veto the gun law that allows for Ohioans to carry a gun without a permit and without training.",
    "Why is it that when fuel costs rise, the oil companies immediately pass those increased costs onto the consumer?",
    "City Council members, if you really want to improve the lives of your citizens, fix the damn potholes!",
    "But I have lived in several different cities, and have to say the roads here are atrocious.",
    "Just hope Americans find the courage and character to embrace the hard work of democracy.",
    "Two really great pieces of advice to keep the Biden Green Energy Plan moving forward.",
    "Once a treat, now 85% of U.S. households eat out about five times a week on average.",
    "According to CNBC, the average cost of such a vehicle is currently around $56,000.",
    "Mary Scherl, Sharonville\nVeto law allowing guns to be carried with no permit\nGov.",
    "There are already too many guns out there that are resulting in increased deaths.",
    "Monday's letters to the editor (Feb. 7) had two prime examples of that fallacy.",
    "We had one recently where two men argued and guns came out and one person died.",
    "This is a commonsense approach toward a positive outcome: healthy children.",
    "Come on, folks; we can disagree about the facts, but logic is still logic.",
    "Many restaurants absorbed costs to keep customers in order to survive.",
    "We need an informed electorate and a willingness to compromise.",
    "This will have absolutely no affect on childhood obesity.",
    "Democracy has not failed because it was found lacking.",
    "That could easily endanger innocent bystanders also.",
    "Please think hard about this and do the right thing.",
    "Fast forward to today with the high gas costs.",
    "We don't need more guns out there!",
    "That's something you can control.",
    "I moved here last summer.",
    "Jack Felton, Green Twp.",
    "I love Cincinnati.",
    "Jack Peters, Mt.",
    "Lookout"
  ]
}