{
  "id": 10835,
  "mediaId": 2550,
  "date": "2022-03-15",
  "headline": "AL and OH governors sign",
  "image": "https://images.dailykos.com/images/1048596/story_image/ScreenShot2022-03-14at7.57.03PM.png?1647313515",
  "link": "https://www.dailykos.com/stories/2022/3/15/2085926/-AL-and-OH-governors-sign-no-permit-bills-for-toting-concealed-guns-GA-and-IN-governors-ponder-same?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1126,
    35,
    875,
    574,
    5928,
    5951,
    6175,
    6650,
    6474
  ],
  "sentences": [
    "(It is also worth pointing out that the Court limited the question presented to “[w]hether the State’s denial of petitioners’ applications for concealed-carry licenses for self-defense violated the Second Amendment.” It therefore does not appear inclined to address the open carry issue and will instead need to confront the statement in Heller that appears to have suggested that states could constitutionally ban concealed carry altogether.)",
    "It’s a path the supporters of so-called “constitutional carry”—particularly the Second Amendment absolutists of Gun Owners of America as well as the National Rifle Association (NRA)—have been treading state by state for the past 13 years with tremendous success despite the NRA’s recent financial and legal troubles.",
    "In a recent CNN report on law enforcement leaders speaking out in staunch opposition to permitless carry in several states, Lincoln Chief of Police Teresa Ewins said:\n\"If someone feels the right to go into a business or a coliseum or an arena [while concealed carrying], then there's going to be an argument.",
    "Riley Bunch at Georgia Public Radio reported earlier this month when the bill passed the state senate:\nDallas Republican Sen. Jason Anavitarte, the bill’s sponsor, said that as a response to the rise in violent crime Georgians have an increased interest in purchasing a firearm to protect themselves.",
    "They want to protect themselves from the criminals who are committing the crimes.”\nUnder the bill, any “lawful weapons carrier” could carry a concealed firearm without first going through the licensing process that usually requires a fingerprint, background check and a fee.",
    "John Weber, the NRA’s state director in Indiana, stated:\nHoosiers value their Second Amendment rights, yet under the current regime they are forced to ask the government for extra permission in order to exercise the fundamental right of carrying a firearm for self-defense.",
    "When this was written, Republican governors in Georgia and Indiana were still deciding whether they would sign similar bills passed in those legislatures, and the Nebraska legislature seems on the verge of passing its own, with gubernatorial signature likely.",
    "Whether it’s handing firearms to bad actors, discrediting COVID-19 vaccines, or politicizing classrooms, Indiana Republicans would rather divide families and communities with their partisan culture wars than actually create a better future for Hoosiers.\"",
    "A 2017 study by the National Bureau of Economic Research found that in 11 states then having “right-to-carry” laws, being able to carry a handgun boosted crime: By the 10th year of these laws, violent crime was up between 13% and 15% in those states.",
    "Attorney General Yost’s 2021 Statistics on Concealed Handgun Licenses (CHL) in Ohio, released the morning of the House floor vote of SB 215, revealed 420 CHLs revoked for cause, such as a felony conviction or an adjudication as mentally incompetent.",
    "Over the decades, New York courts have held that failure to \"demonstrate a special need for self-protection distinguishable from that of the general community or of persons engaged in the same profession\" is a good enough reason to deny a permit.",
    "Like other such statutes, proposed or already enacted, the Alabama law eliminates the current need for obtaining a permit to carry a firearm concealed by anyone age 18 or older unless they have a felony conviction or a dangerous mental illness.",
    "Because history will play an important role in the decision no matter what methodology the Court ultimately uses, this background will likely be debated among the justices, the parties, and the scholars filing amicus briefs in the case.",
    "The ABC affiliate in Indianapolis reported:\nMike Schmuhl, Chairman of the Indiana Democratic Party, said \"This is what the Indiana Democratic Party meant when it said Republicans will put their partisanship before anything else.",
    "Seven years later, with intense pressure from “constitutional carry” advocates squeezing and flattering state legislators, a trickle turned into a flood, with 15 states having switched by the end of 2020 to no permits required.",
    "As in other states, law enforcement agencies, organizations representing police officers, activists seeking an end to gun violence, and public health officials have opposed these laws, tying them to increases in violent crime.",
    "But in two or three months, if the Supreme Court decides to make the broadest possible ruling in the case of New York State Rifle & Pistol Association Inc. v. Bruen, all 50 states could be forced to go down the same path.",
    "But appellate courts are split on the constitutional legitimacy of such good cause or good reason laws, having both overturned and upheld similar state gun regulations, which is how the case made it to the Supreme Court.",
    "That seems to be the assumption of commentators who see the decision to take this case as a victory for the conservative justices who have been looking to expand gun rights since shortly after Heller was decided.",
    "If the Indiana GOP get their way and sign House Bill 1077 into law, they will ignore the will of voters and state and municipal law enforcement who worry about public safety - all to fulfill an extreme agenda.",
    "Historians who study the history of gun regulations note that good-cause or may-issue regimes more broadly trace their history back even before New York’s adoption of such a law at the turn of the century.",
    "Many advocates of stricter gun laws fear that the conservatives on the court will give gun rights advocates another victory like the change ushered in by the 2008 ruling in District of Columbia v. Heller.",
    "Not everyone agrees that the Bruen ruling will be so dire:\nJake Charles, executive director at the Duke Center for Firearms Law, offers a caution about assuming the Supremes will toss Sullivan.",
    "“… What everyone in this chamber needs to understand is this: The growing response by law-abiding constituents to hearing these terrible stories is to go buy a gun and protect themselves.",
    "Concealed firearms are still not allowed in Alabama courthouses, jails, and prisons, at events in school athletic venues, or on private property without express permission from the owner.",
    "Brian Kemp’s office says he is considering whether to sign the no-permit, no-training law passed Friday by the Georgia House of Representatives in a 94-57 vote—again, along party lines.",
    "As in Alabama and most other states where no-permit, no-training bills have passed, the vote was overwhelmingly partisan, with Republicans mostly in favor and Democrats mostly against.",
    "Republicans have made it crystal clear that they value the approval of the gun lobby more than the lives of Ohioans and the police officers who protect our communities every day.",
    "Just having a rash of robberies in the neighborhood, which is at the root of the Bruen case, is not a “proper cause” for granting a permit, according to the lower court’s ruling.",
    "SB 215 completely betrays Ohioans who have called time after time for commonsense gun safety legislation, not extreme bills that endanger the lives of our children and families.",
    "On a completely partisan vote, the no-permit bill passed the Alabama House of Representatives with 65 Republican ayes cast against 28 Democratic and nine Republican nays.",
    "Even if the court chooses a more narrow ruling, it will almost certainly require several states to relax at least some provisions in their own concealed gun permit laws.",
    "This is just another layer of difficulty for them because it's hard to understand who has a gun, who doesn't have a gun and then having people who are not trained.\"",
    "That 108-year history dwarfs the lifespan of several other laws that Justice Scalia in Heller called “longstanding” exceptions to the Second Amendment’s scope.",
    "Eric Holcomb is also considering whether to sign a no-permit, no-training law passed last week by the legislature with the expected ample partisan margins.",
    "For one thing, the justices can often issue surprising rulings, like last Term’s majority decision by Justice Gorsuch in Bostock v. Clayton County.",
    "Open carry was already on the books in the state, which has a gun homicide record higher than New York’s despite having a fourth of the population.",
    "Come April, 25 states could allow people to carry handguns concealed without a permit or training in how to shoot and handle a firearm safely.",
    "Dubbed the “Massachusetts model” after its progenitor, these laws spread after the Civil War and were commonplace in the early 20th century.",
    "In green are the states with “constitutional carry” laws that let people carry concealed firearms with no permit and no training required.",
    "By April 1, half the states in the nation may have added laws allowing people to carry concealed firearms without training or a permit.",
    "Pete Ricketts\nThe unicameral state legislature on Friday beat a filibuster against Legislative Bill 773 and passed it on first reading.",
    "They argue that no permit is needed to exercise First Amendment rights and none should be required for the Second Amendment either.",
    "Removing these responsible and reasonable precautions compromises the safety and security of our communities and law enforcement.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Ohio House Minority Leader Allison Russo issued a statement:\nThis is yet another example of failed Republican leadership ...",
    "In 2020, over 2,000 concealed carry licenses were revoked, and 1,777 licenses were denied by sheriff’s offices across Ohio.",
    "A recent poll commissioned by The Atlanta Journal-Constitution showed that nearly 70% of Georgians opposed the legislation.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Many law enforcement agencies and some police unions say the no-permit, no-training laws endanger officers and the public.",
    "It requires that anyone who wants to carry a concealed handgun in public has to show “proper cause” to obtain a permit.",
    "Last year, six more joined that roster—Arkansas, Iowa, Montana, Tennessee, Texas, and Utah, bringing the total to 21.",
    "The NRA is proud to have played a key role in getting this bill to the governor’s desk and we hope he will sign it.",
    "Like all the other such bills, this one would kill the need for a permit or training to carry a concealed firearm.",
    "Having long advocated for relaxed gun laws, it is almost certain he will sign this one, making the Peach State No.",
    "Several other states that have switched to permitless carry also have eliminated the need for firearms training.",
    "That’s a total of 4,968 people who were without a CHL in Ohio in 2021 because they were not fit to have one.",
    "The justices decided in that case that people have a constitutional right to keep a loaded firearm at home.",
    "The only Black Republican in the legislature was also the only Black legislator to vote for the bill.",
    "Last April, The Trace posted 32 states that let people carry guns without learning how to shoot one.",
    "“This law is strictly intended to remove an unnecessary burden from law-abiding Georgians,” he said.",
    "There were another 1,880 CHLs suspended, for a total of 2,300 revocations and suspensions in 2021.",
    "Although the Alabama bill was signed first, Ohio’s goes into effect six months earlier on June 12.",
    "The GVPedia, a project researching gun violence has published this information on gun permit laws.",
    "For another, the history of good-cause licensing laws for concealed carry is rich and widespread.",
    "Until 2003, only Vermont allowed people to carry firearms concealed or openly without a permit.",
    "Another 2,668 applicants were denied CHLs because they did not meet statutory requirements.",
    "It still has to clear two more votes—and two more filibusters—to win final approval.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Last year, he wrote:\nThe Supreme Court is going to strike down the law, right?",
    "Here’s a list with some details as of March 10, and below is an updated map.",
    "It passed the state senate with 23 Republican ayes and six Democratic nays.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "New York’s law has continued in substantially the same form since 1913.",
    "Pete Ricketts is likely to sign the bill if it clears the legislature.",
    "Otherwise, that map above could be all green by this time next year.",
    "Mike DeWine signed his state’s no-permit, no-training bill Monday.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Then law enforcement will have to respond and try to deescalate.",
    "Eric Holcomb\nINDIANA\nUPDATED: Holcomb has not signed the bill.",
    "But it is not entirely clear that that will be the outcome.",
    "But Alabama has never required training to obtain a permit.",
    "That year Alaska became the second state to do the same.",
    "25 with “constitutional carry” as the law of the land.",
    "The map was last updated before Ohio Republican Gov.",
    "An upcoming Supreme Court ruling could double that.",
    "Then there’s the Supreme Court in the Bruen case.",
    "What that means is left legislatively undefined.",
    "Kay Ivey signed the bill into law last Thursday.",
    "Several of these states also allow open carry.",
    "Alabama is the 22nd state to join the parade.",
    "At issue is New York’s 1911 Sullivan Act.",
    "Mike DeWine signed Ohio’s SB 215 Monday.",
    "That is as it should be, say advocates.",
    "This is a short blurb about Daily Kos.",
    "One can hope that Charles is right.",
    "23 in this growing free for all.",
    "That would make the state No.",
    "It takes effect Jan. 1, 2023.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Mike DeWine\nRepublican Gov.",
    "Meanwhile, Republican Gov.",
    "Want to keep it that way?",
    "Alabama joined last week.",
    "NEBRASKA\n Nebraska Gov.",
    "Daily Kos is different.",
    "GEORGIA\n Georgia Gov.",
    "ALABAMA\n Alabama Gov.",
    "And that’s no joke.",
    "OHIO\n Ohio Gov.",
    "Republican Gov.",
    "Republican Gov.",
    "Republican Gov.",
    "Please read it.",
    "Indiana Gov.",
    "Brian Kemp.",
    "Kay Ivey."
  ]
}