{
  "id": 10864,
  "mediaId": 8313,
  "date": "2022-03-15",
  "headline": "What to know about Ohio's new permitless concealed carry law",
  "image": "https://www.gannett-cdn.com/presto/2020/02/12/PCIN/ee70cc03-617f-4edf-bdd7-05edb0f45364-CCW6.jpg?crop=3799,2137,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/03/15/what-know-ohios-new-permitless-concealed-carry-law/7046104001/",
  "mediaOutlet": "enquirer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron Knight",
  "authorUrl": "https://www.cincinnati.com/staff/2648134001/cameron-knight/",
  "termIds": [
    2938,
    2143,
    1489,
    6241,
    6279,
    6474
  ],
  "sentences": [
    "Rob Sexton, the organization's legislative affairs director, said the law in both Ohio and Kentucky applies to out-of-state residents, so those crossing the river will soon be operating under a similar set of laws.",
    "The state doesn't consider the total number of active license holders a public record, but an Enquirer analysis from 2019 estimated that about 673,000 or 1 in 17 Ohioans has a concealed carry permit.",
    "Senate Bill 215\nSenate Bill 215, which will go into effect in about three months, states people 21 or older can carry a concealed gun without a permit if they are legally allowed to own the gun.",
    "Ohio residents who would like to carry a concealed weapon in states without a permitless law, such as Indiana, would still have to obtain an Ohio permit.",
    "On Monday, Ohio became the 23rd, according to the Buckeye Firearms Association, a gun rights organization that supported the legislation.",
    "Mike DeWine signed a bill into law Monday doing away with the permitting restrictions to carrying a concealed firearm in the state.",
    "Permitless carry Ohio joins Kentucky\nPermitless or \"constitutional\" carry laws have been gaining traction around the country.",
    "Ohio law previously required eight hours of training, including live-fire practice, to obtain a concealed carry permit.",
    "Indiana could join soon\nIndiana does not have a permitless carry law, but the legislature passed a bill this month.",
    "Unlike Ohio and Kentucky's law which apply to those 21 and up, Indiana's proposed law would apply to 18 and up.",
    "The new law also eliminates the requirement that people inform a police officer if they are carrying a weapon.",
    "An officer can still ask, and lying to the officer about carrying a weapon is a misdemeanor.",
    "Ohio has established reciprocity agreements with other states to have its permit recognized.",
    "Restrictions on carrying guns in certain places like courthouses remain in place.",
    "At the time, it was the 15th state to pass such a law.",
    "It has been sent to the governor to sign.",
    "Ohio legalized concealed carry in 2004.",
    "Kentucky passed a similar law in 2019.",
    "A background check was required.",
    "Ohio Gov."
  ]
}