{
  "id": 11039,
  "mediaId": 2537,
  "date": "2022-03-14",
  "headline": "Opinion: Colleges, Greek organizations aren't doing enough to stop hazing",
  "image": "https://www.gannett-cdn.com/presto/2020/08/26/PCIN/89c37c85-4834-4fc2-8082-0d0be71aa398-Capture.PNG?crop=786,443,x0,y0&width=786&height=443&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/03/14/opinion-colleges-greek-organizations-arent-doing-enough-stop-hazing/9431574002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rex H. Elliott and Sean R. Alto",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "On March 4, 2021, in a hazing ritual involving the PIKE fraternity at Bowling Green State University, Stone Foltz was forced to consume the equivalent of nearly 35 shots of Evan Williams Bourbon in approximately 18 minutes leading to his death three days later.",
    "Since Stone’s death on March 7, 2021, there have been three more hazing deaths, seven serious hazing injuries, and 24 more fraternities and sororities expelled, suspended, or punished for acts of hazing.",
    "Opinion contributors\nAs we approach the first anniversary of the hazing ritual that took the life of 19-year-old Stone Foltz, it is worth asking the question: Is hazing on the decline in America?",
    "You do not want to hear from university officials or law enforcement that your child has died or been seriously hurt, nor do you want your child arrested and charged criminally for hazing.",
    "We want a world free of death and serious injuries from senseless acts of hazing and do not want to see any kid’s life ruined by felony charges, expulsions, or jail sentences.",
    "Universities are responsible for monitoring these organizations, they are responsible for the safety of their students, and they can no longer passively oppose hazing.",
    "Rex H. Elliott and Sean R. Alto are attorneys with the law firm of Cooper Elliott and the lawyers for Collin Wiant, Stone Foltz and Tyler Perino.",
    "Finally, to all parents, please educate your kids now when they are in middle school and high school regarding the consequences of hazing.",
    "Shockingly, despite Stone’s death, more hazing incidents have occurred at BGSU – the same university responsible for Stone’s safety.",
    "In March 2019, Tyler Perino was savagely beaten in a hazing ritual involving the Delta Tau Delta fraternity at Miami University.",
    "Simply establishing an anti-hazing policy and saying they oppose hazing is not enough now, and it hasn’t been for decades.",
    "That means educational institutions and other essential provisions are required to report hazing incidents transparently.",
    "It elevates hazing incidents involving alcohol or drugs to felonies and makes hazing a mandatory reporting incident.",
    "Stone’s death also motivated Ohio’s 14 largest public universities to adopt a zero-tolerance policy to hazing.",
    "On Nov. 12, 2018, Collin Wiant died in a hazing incident involving the Sigma Pi fraternity at Ohio University.",
    "You would think this would lead to a sharp decline in hazing, but it has not.",
    "Stone’s death has been widely publicized, helping push legislators and Gov.",
    "Tyler suffered severe bodily injuries, but the hazing did not stop there.",
    "Collin’s death was widely publicized, but hazing did not stop there.",
    "Universities and National Greek Organizations must do more.",
    "Hazing is not even on the decline in Ohio.",
    "Mike DeWine to enact Collin’s Law.",
    "The answer is a resounding no.",
    "This cannot continue."
  ]
}