{
  "id": 11086,
  "mediaId": 2919,
  "date": "2022-03-09",
  "headline": "Gov. DeWine to host summit to prepare for Ukrainian refugees coming to Ohio",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/e9eff90/2147483647/strip/true/crop/1018x534+0+16/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F44%2Fb7%2Fbc4c158242559abbc3946f4ae0f8%2Fscreen-shot-2022-02-20-at-8.58.07%20PM.png",
  "link": "https://www.news5cleveland.com/news/national/russia-ukraine-conflict/gov-dewine-to-host-summit-to-prepare-for-ukrainian-refugees-coming-to-ohio",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clay LePard",
  "authorUrl": "https://www.news5cleveland.com/clay-lepard",
  "termIds": [
    2143,
    4954,
    5888,
    6474,
    6502,
    6672
  ],
  "sentences": [
    "“We’re the biggest concentration between Chicago and New York City.”\nFor Mayor DeGeeter, these past two weeks have tested the people of Parma, who are watching what’s happening nearly 5,000 miles away and looking for ways to help with the area home to an estimated 30,000-40,000 Ukrainians.",
    "It’s not just a sense of ‘We're Cleveland, we’ve got this and it’s in our DNA,’ which is all true; these really are family members of people who live here, and welcoming them is the right thing to do.”\nCopyright 2022 Scripps Media, Inc. All rights reserved.",
    "PARMA, Ohio — Following Russia’s unprovoked invasion of Ukraine, Ohio Governor Mike DeWine announced the Ohio Department of Job and Family Services will convene a summit of area organizations to help prepare for Ukrainian refugees who resettle in Ohio.",
    "He told News 5 his team was prepared for around 400 refugees to make their way to Northeast Ohio, however, through word of mouth and families and friends settling closer together, that number, he says, is closer to 800 or even more.",
    "We’re trying to do our part and we’ll be at the table to be as helpful as we can.”\nIn addition to representatives from Parma, expect to see Joe Cimperman, president of Global Cleveland, likely taking part in the summit.",
    "“Like many Ohioans, I am disgusted by the senseless aggression of the Russian military and want to support Ukrainian families being driven out of their country,” said Governor DeWine in a statement.",
    "“While we do not yet know what role Ohio will play in helping these families, I want us to be prepared when the time does come.”\nThe summit is scheduled to take place on March 17.",
    "While refugees are processed through federal programs, the Ohio Department of Job and Family Services Refugee Services Program works with local resettlement agencies.",
    "In addition to hosting various rallies, the Ukrainian flag flies outside City Hall and some street signs were painted with the colors of the Ukrainian flag.",
    "We're getting a lot of calls in the governor's office from people who just want to help — people who say, \"I open my home, I'll do this, I'll do that.\"",
    "Global Cleveland is a refugee and immigration advocacy organization dedicated to welcoming and integrating people from around the world into the city.",
    "According to the Governor’s office, more than 500 Ukrainians have resettled in Ohio since 2018, with the majority resettling in Northeast Ohio.",
    "Cimperman played an instrumental role in helping integrate Afghan refugees resettling in Ohio beginning last year when the Taliban took over.",
    "“At least one church out there has a database where folks have said they’re willing to house any Ukrainian refugees,” Mayor DeGeeter added.",
    "\"Well, the federal government will determine if and when we get refugees from the Ukraine,\" DeWine said in an interview with news 5.",
    "“Parma will be the epicenter likely where those refugees come from Poland to the United States,” Parma Mayor Tim DeGeeter said.",
    "“I think we’re going to see a lot of people, we just don’t know how many and when,” he said.",
    "“I was talking to somebody last night, his nephews are living in part of Ukraine.",
    "And this summit that we have put together is really informational for everyone.",
    "Cimperman expects when it comes to Ukraine, that number could be even higher.",
    "“I was talking to a woman this morning, her sister is in Kyiv,” he explained.",
    "“This is a natural place because of the churches, because of the businesses.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "And so we thought it would be good to just have an informational session.\"",
    "\"But it's important, I think, for us to be ready."
  ]
}