{
  "id": 11241,
  "mediaId": 2643,
  "date": "2022-03-14",
  "headline": "Ohio Becomes Latest State to Allow Concealed Gun Carry Without a Permit",
  "image": "",
  "link": "https://www.newsweek.com/ohio-becomes-latest-state-allow-concealed-gun-carry-without-permit-1687963",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia McKnight",
  "authorUrl": "https://www.newsweek.com/authors/patricia-mcknight",
  "termIds": [
    2068,
    2143,
    1489,
    1126,
    6653,
    6399,
    6279,
    6474,
    5928
  ],
  "sentences": [
    "\"Laws currently protect officers and the public they serve by requiring that those who go armed in public report the presence of loaded firearms, thereby including this awareness in any potentially dangerous situation,\" said Robin Hawkins member of the Ohio Veterans and Public Safety Committee.",
    "— Senator Sandra Williams (@SenSWilliams) March 14, 2022\nOhio is now the 23rd state to allow citizens to carry a concealed handgun without a government-issued permit, according to the National Rifle Association's (NRA) Institute for Legislative Action.",
    "Until now, motorists during a traffic stop who failed to notify an officer that they had a gun faced a first-degree misdemeanor, punishable by up to six months in jail, a $1,000 fine and suspension of their concealed handgun license.",
    "Ohio Governor Mike DeWine signed a bill that eliminates a concealed carry permit requirement for Ohioans ages 21 and over who are legally eligible to own and carry a firearm in the state.",
    "\"Blindfolding officers and weighting the individual's right to carry loaded firearms with no restrictions makes everyone, especially those charged with public safety, less safe.\"",
    "Ohioans are no longer required to have a concealed carry permit for their firearms or undergo background checks, following the governor signing Republican-backed legislation.",
    "That's why the NRA worked tirelessly with state leaders and legislators to pass this landmark legislation in Ohio,\" said Jason Ouimet, NRA-ILA executive director.",
    "The enactment of \"constitutional carry\" or \"permitless carry\" has been opposed by law enforcement and anti-gun violence activists during the approval process.",
    "Senate Bill 215 will go into effect in 90 days and will remove permitting, training and background check requirements to carry a concealed weapon.",
    "Prior law required citizens to have eight hours of training, a background check and an application through their local sheriff.",
    "DeWine for signing this important piece of legislation that protects the Second Amendment rights of all law-abiding Buckeyes.\"",
    "For those citizens who do decide to obtain a permit, they will no longer be required to carry the license on their person.",
    "Other states allowing law-abiding citizens to a concealed handgun include Alabama, Kentucky, Mississippi and Texas.",
    "Citizens will no longer have the duty to \"promptly\" notify every law enforcement officer during an official stop.",
    "Instead, the person must disclose that they are carrying a concealed handgun only after an officer asks.",
    "\"Any right requiring a fee or government permission slip isn't much of a right at all.",
    "DeWine allows anybody in Ohio tocarry a concealed weapon WITHOUT a permit.",
    "The bill makes several changes to Ohio's concealed carry laws.",
    "The bill also changes the law for carrying the license.",
    "Newsweek reached out to DeWine's office for comment.",
    "(unless you have certain prior criminal offenses).",
    "Senate Bill 215 now eliminates that penalty.",
    "Senate Bill 215 Takes effect in 90 days.",
    "New concealed carry law signed by Gov.",
    "\"The NRA commends Gov."
  ]
}