{
  "id": 1124,
  "mediaId": 8379,
  "date": "2022-02-12",
  "headline": "Former Ohio House Speaker Batchelder, 79, dies",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/02/WILLIAM-BATCHELDER.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/columbus/former-ohio-house-speaker-batchelder-79-dies/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Griffin",
  "authorUrl": "https://www.nbc4i.com/author/daniel-griffin/",
  "termIds": [
    0
  ],
  "sentences": [
    "According to the Batchelder Company website, for which Batchelder was serving as President Emeritus at the time of his death, Batchelder spent 31 years at Williams and Batchelder Law firm in Medina, served as an adjunct professor of law at the University of Akron Law School and at Cleveland State University Levin College of Urban Affairs.",
    "“I have sought his advice many times over the years.”\nCurrent Ohio Speaker of the House Bob Cupp, in a statement, said Batchelder’s impact for the state of Ohio was “positive and lasting.”\n“To Speaker Bill Batchelder we say: ‘Thank you for your service in the Ohio House of Representatives and to Ohio and its citizens.",
    "Mike DeWine said Batchelder was “a classic conservative whose guiding principle was freedom.”\n“Bill was a consummate legislator who helped me as we passed a drunk driving bill in 1982 for which I will always be grateful,” DeWine said in a statement issued by the governor’s office Saturday afternoon.",
    "After leaving the House in 1999, Batchelder became a judge in Medina County Common Pleas Court and on the Ninth District Court of Appeals from 1999 to 2005.",
    "Batchelder graduated with a bachelor’s degree from Ohio Wesleyan Univesity in 1964 and a Juris Doctorate from Ohio State University College of Law in 1967.",
    "COLUMBUS, Ohio (WCMH) — Former Republican Speaker of the Ohio House of Representatives William G. Batchelder III, 79, has died.",
    "Batchelder returned to the House in 2007, ascending to the Speaker post in 2011 before leaving due to term limits in 2014.",
    "You will be missed – but the enduring light of your legacy will shine on us always,'” the statement reads.",
    "First elected to the Ohio Statehouse in 1969, Batchelder represented District 81 until 1999.",
    "Batchelder is survived by his wife Alice, two adult children, and seven grandchildren.",
    "In total, he served in the House for 38 years.",
    "Ohio Gov."
  ]
}