{
  "id": 11364,
  "mediaId": 2593,
  "date": "2022-03-15",
  "headline": "Republican Governor Signs Law Making Concealed Carry Permits Optional",
  "image": "https://ijr.com/wp-content/uploads/2022/03/GettyImages-504165794-scaled.jpg",
  "link": "https://ijr.com/republican-governor-signs-law-concealed-carry/",
  "mediaOutlet": "IJR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Savannah Rychcik",
  "authorUrl": "https://ijr.com/author/savannah/ ",
  "termIds": [
    0
  ],
  "sentences": [
    "Once again, he’s failed on both fronts, putting his own political interests over the safety and well-being of his constituents.”\nRepublican @GovMikeDeWine signed into law on Monday a bill that makes concealed carry permits optional in Ohio.https://t.co/X48fOV0d3Q\n— Washington Examiner (@dcexaminer) March 15, 2022\nAxios noted Ohio is now one of 23 states that has a permitless carry law.",
    "He added, “I am very disappointed, however, that the legislature did not include in this bill the essential provisions that I proposed to make it harder for dangerous criminals to illegally possess and use guns.”\nWe are committed to truth and accuracy in all of our journalism.",
    "DeWine for signing this critical bill that upholds the Second Amendment in Ohio, for the benefit of law-abiding citizens.”\nOhio Democratic Party Chair Elizabeth Walters issued a statement criticizing DeWine for signing the law.",
    "“By signing this bill into law, Mike DeWine has sold out Ohioans and law enforcement officers to special interest groups and extremists in the legislature,” Walters said.",
    "“It is vital that law-abiding citizens have the right to legally protect themselves when confronted with a life-threatening situation,” DeWine said in a statement.",
    "According to The Washington Examiner, the “constitutional carry” law also allows citizens to carry concealed firearms without having training.",
    "Time and again, DeWine has promised to support law enforcement officers and ‘do something’ to combat gun violence in our state.",
    "Still, the law requires citizens to inform the police they are carrying a firearm if they are asked.",
    "The signing comes a little over a year after the governor signed the “Stand Your Ground” bill.",
    "Mike DeWine (R) signed a law allowing citizens to carry concealed firearms without a permit.",
    "The bill eliminates the duty to retreat before shooting in self defense.",
    "The lobbying arm of the NRA said in a statement, “NRA thanks Gov.",
    "Other states include Alabama, Iowa, Tennessee, Texas and Wyoming.",
    "She added, “This bill will make all Ohioans less safe.",
    "Read our editorial standards.",
    "Ohio Gov."
  ]
}