{
  "id": 11487,
  "mediaId": 2688,
  "date": "2022-03-15",
  "headline": "Russian State TV Producer Missing After Protesting Ukraine War Live On Air",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/03/GettyImages-1239208024-scaled.jpg",
  "link": "https://talkingpointsmemo.com/morning-memo/russian-state-tv-producer-missing-after-protest-ukraine-war-live-broadcast-lawyers?utm_source=rss&utm_medium=rss&utm_campaign=russian-state-tv-producer-missing-after-protest-ukraine-war-live-broadcast-lawyers",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Cabrera",
  "authorUrl": "https://talkingpointsmemo.com/profile/cristina_cabrera",
  "termIds": [
    4986,
    1815,
    3639,
    3702,
    421,
    6286,
    6672,
    6569
  ],
  "sentences": [
    "European Leaders Travel To Kyiv\nCNN: “Prime ministers of Poland, Slovenia and Czech Republic en route to meet Zelensky in Kyiv”\nThe Washington Post: “Kyiv under attack as European leaders announce visit”\nThe New York Times: “The leaders of the Czech Republic, Poland and Slovenia head to Kyiv, a visit that was kept secret.”\nIdaho Passes Texas-Inspired Abortion Ban\nIdaho is now the first state to approve an abortion ban modeled after Texas Republicans’ law, which prohibits the procedure after six weeks of pregnancy and incentives private citizens to sue abortion providers and collect a reward in court.",
    "Politico Demands Hawley Stop Using Fist-Pump Pic For Merch\nLawyers for Politico sent a cease-and-desist letter to Sen. Josh Hawley’s (R-MO) campaign last month after the senator started selling mugs featuring that infamous photo of him fist-pumping Trump supporters several hours before the Capitol attack on Jan. 6.",
    "Kremlin spokesman Dmitry Peskov accused the TV producer of “hooliganism” on Tuesday but claimed the broadcasting station, not the government, was “dealing with this.”\nOvsyannikova recorded a video before she stormed the set in which she expressed regret over “working on Kremlin propaganda” at Channel One.",
    "Beyond Gutsy\nLawyers for Marina Ovsyannikova, an editor and producer of Russia’s state-run Channel One who burst onto the set during a live broadcast to protest the Kremlin’s war on Ukraine on Monday night, told the Washington Post on Tuesday that they can’t find their client.",
    "“I am ashamed that I let the Russian people be zombified.”\nThey’re PERFECT Together\nFormer Wisconsin Supreme Court Justice Michael Gableman and Tina Peters, the indicted Mesa County, Colorado clerk, will be at the same event for 2020 election truthers next week.",
    "Capitol Moves Toward Reopening After Two Years\nMultiple outlets report that U.S. Capitol Police and House and Senate officials are reviewing a plan to reopen the Capitol, which has been shut to the public since March 12, 2020 due the pandemic.",
    "Ginni Thomas Went To Pre-Insurrection Jan. 6 Rally\nSupreme Court Justice Clarence Thomas’ wife, Ginni Thomas, admitted on Monday that she went to the pro-Trump “Stop the Steal” rally on Jan. 6 that came right before the Capitol insurrection.",
    "They’re lying to you here”:\nOvsyannikova was arrested after the incident and detained at a police station at the Ostankino broadcasting center in Moscow, according to OVD-Info, a human rights group that tracks protests in Russia.",
    "Gableman, who also went to MyPillow CEO Mike Lindell’s “Cyber Symposium” circus, will also speak at another “election data” event in Utah the next day on March 26, his office confirmed to the Wisconsin State Journal on Monday.",
    "Peters will be there to share “her incredible story of exposing Dominion fraud” (there’s no evidence that Dominion Voting Systems conspired to rig the election against Trump, as MAGA supporters have insisted).",
    "Mike DeWine (R) signed state Republicans’ bill on Monday that lets anyone age 21 and over carry a concealed firearm without limits unless the person’s been banned from carrying guns by state or federal law.",
    "The Idaho ban is somewhat less extreme than the Texas one: Idaho’s bill is limited to family members of the so-called “preborn child,” while Texas allows literally any citizen to sue the providers.",
    "Clarence Thomas was the only dissenting vote in the Supreme Court’s 8-1 decision denying Trump’s attempt to block the House Jan. 6 Committee’s subpoena for records on the Capitol attack.",
    "Thomas–who has ties to both the rally organizers and MAGAland’s efforts to overturn the 2020 election–said she “got cold and left early” before Trump took the stage at the event.",
    "A Hawley campaign spokesperson told E&E News on Monday that “we are in full compliance with the law” but wouldn’t say if the campaign paid for the license to use the photo.",
    "Gableman is headlining a March 25 event in Utah that promises to deliver “mind blowing Information on Utahs [sic] 2020 election,” according to the event’s Facebook page.",
    "Wisconsin Republicans appointed to run a bogus 2020 election audit and also thinks it’s possible to “decertify” the election (it’s not).",
    "Idaho includes an exception for rape and incest (though the victim is required to obtain a police report) while Texas has no exceptions.",
    "Tina Peters is the pro-Trump election official who was charged last week in a bizarro alleged scheme involving county voting machines.",
    "Ovsyannikova had run up behind the news anchor and shouted “Stop the war!” while holding up a sign that said in Russian “Stop the war.",
    "In case you had any questions about it, Hawley insists that the mug is “not a pro-riot mug,” so that’s that on that.",
    "“I am ashamed that I’ve allowed the lies to be said on the TV screens,” she said in the video.",
    "Gableman has presented zero evidence that the Wisconsin election results were fraudulent.",
    "Idaho’s GOP-controlled legislature passed the measure on Monday and sent it over to Gov.",
    "The spokesperson claimed that the campaign hadn’t gotten the letter from Politico.",
    "The photo was taken by a photojournalist at E&E News, which is owned by Politico.",
    "Ohio Now Allows Concealed Weapon Carry Without Training Or Permit\nOhio Gov.",
    "Thomas claimed she wasn’t involved in planning the rally.",
    "Brad Little (R), who is expected to sign it.",
    "Don’t believe the propaganda.",
    "Here are some of the things.",
    "This is TPM’s Morning Memo.",
    "A lot of things happened.",
    "Do you like Morning Memo?",
    "Gableman is the guy??",
    "Let us know!"
  ]
}