{
  "id": 11788,
  "mediaId": 8433,
  "date": "2022-03-26",
  "headline": "Local Briefs: 3-26-2022",
  "image": "https://bloximages.chicago2.vip.townnews.com/sent-trib.com/content/tncms/custom/image/29de8604-1271-11e8-b1b5-53be103f8c1b.jpg?resize=600%2C315",
  "link": "https://www.sent-trib.com/news/local-briefs-3-26-2022/article_7f73a8ba-acff-11ec-bae1-ff0bc423a476.html",
  "mediaOutlet": "sent-trib.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4198,
    1253,
    228,
    183,
    602,
    6678,
    6504,
    6336
  ],
  "sentences": [
    "The commission is comprised of the director of the Ohio Department of Development, the chancellor of the Ohio Department of Higher Education, the governor’s science and technology advisor, the chief investment officer of JobsOhio, and six regional business or research representatives and one public-at-large representative appointed by the governor.",
    "Events will take place each Monday in April, starting with presentations about caregiving from Sara Chambers from Hospice of Northwest Ohio and Jessica Ricker from the Wood County Committee on Aging at Stony Ridge Branch Library on April 4.",
    "Two ‘Simple Gifts’ concerts set\nPERRYSBURG — St. Timothy’s Episcopal Church of Perrysburg Discovers Series presents a concert duo of two women playing 12 instruments on April 3 at 3 p.m. at the church, 871 E. Boundary St.",
    "Community reads dives into caregiving and burnout\nPEMBERVILLE — Join the Pemberville Public Library System’s 2022 Community Reads Program, featuring “Already Toast: Caregiving and Burnout in America” by Kate Washington.",
    "This book is a memoir of the author’s struggle to care for her seriously ill husband, offering a revealing look at the role unpaid family caregivers play in a society that fails to provide them with structural support.",
    "BGSU ensembles show canceled\nPERRYSBURG — The Chamber Ensembles of Bowling Green State University previously scheduled to perform at St. Timothy’s Episcopal Church on Sunday has been canceled.",
    "Rotary hears about downtown district\nThe Bowling Green Rotary Club guest speaker for Thursday is Tony Vetter, executive director of the Downtown Bowling Green Special Improvement District.",
    "The commission is responsible for the allocation of funds appropriated by the Ohio General Assembly to support programs and activities associated with the Ohio Third Frontier.",
    "Trustees vote on budget\nLIME CITY — The Perrysburg Township will hold a special meeting on Thursday at 4 p.m. in the township meeting hall at 26609 Lime City Road.",
    "Vetter will give an update on the mission to preserve and promote the special improvement district as the cultural, historic and business heart of the city.",
    "The Luckey Area Library Movement and Friends of the Pemberville and Stony Ridge Libraries have sponsored a limited number of paperback copies to give away.",
    "Linda Littleton and Karen Hirshon switch among fiddle, mandolin, banjo, guitar, recorders, bowed psaltery, hammered dulcimer, guitar and percussion.",
    "Drawing on an impressive variety of ethnic folk styles, this award-winning duo plays everything from lively Irish jigs to Balkan dance music.",
    "The concert will be repeated on the Bowling Green State University campus April 4 at 4 p.m. at Kelly Hall, 1012 Moore Musical Arts Center.",
    "Performing Romanian, Klezmer, Greek, Scottish, Scandinavian, Appalachian, and more music than one afternoon can imagine.",
    "The trustees will consider and vote on approval of the township permanent budget for calendar year 2022.",
    "The Community Reads will wrap up on April 25 with a virtual author visit at Pemberville Public Library.",
    "Forecast\nToday: A chance of rain and snow showers before 3 p.m., then a chance of rain showers.",
    "For the full schedule of events, visit the library’s website at pembervillelibrary.org.",
    "Copies of the book are available at the Pemberville, Stony Ridge and Luckey libraries.",
    "Tonight: A chance of rain and snow before midnight, then a slight chance of snow.",
    "Births\nPsalm Steffen and Connor Evans, a son, March 24, Wood County Hospital.",
    "Mike DeWine has appointed a Perrysburg man to the Third Frontier Commission.",
    "Enstone to serve on Third Frontier Commission\nCOLUMBUS, Ohio —Ohio Gov.",
    "David George Enstone’s term begins April 2 and ends April 1, 2025.",
    "New snow accumulation of less than a half inch possible.",
    "The club meets at noon at Bowling Green Country Club.",
    "Sunday: A slight chance of snow before 3 p.m.",
    "Partly cloudy at night, with a low around 21.",
    "Mostly cloudy at night, with a low around 28.",
    "Mostly cloudy at night, with a low around 35.",
    "Extended: Sunny Monday, with a high near 38.",
    "Mostly cloudy Tuesday, with a high near 41.",
    "The special meeting is open to the public.",
    "Little or no snow accumulation expected.",
    "Breezy, with a west wind 15 to 20 mph.",
    "Mostly cloudy, with a low around 26.",
    "Mostly cloudy, with a low around 53.",
    "Mostly cloudy, with a high near 62.",
    "Mostly cloudy, with a high near 64.",
    "Showers likely, mainly after 3 a,m.",
    "Partly sunny, with a high near 35.",
    "It will rescheduled in the fall.",
    "Chance of precipitation is 30%.",
    "Chance of precipitation is 30%.",
    "Chance of precipitation is 60%.",
    "Chance of precipitation is 60%.",
    "Chance of precipitation is 50%.",
    "Chance of precipitation is 50%.",
    "Chance of precipitation is 20%.",
    "A chance of showers Thursday.",
    "A chance of showers at night.",
    "Northwest wind 14 to 16 mph.",
    "Cloudy, with a high near 37.",
    "Northwest wind 14 to 17 mph.",
    "Showers likely Wednesday.",
    "All are invited.",
    "Perrysburg Twp."
  ]
}