{
  "id": 1178,
  "mediaId": 8299,
  "date": "2022-02-14",
  "headline": "The Buckeye Trail",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/14/2022/02/web1_2.15-BT-2.jpg",
  "link": "https://www.mydailysentinel.com/news/70205/the-buckeye-trail",
  "mediaOutlet": "Daily Sentinel - United States - Ohio",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pomeroy Daily Sentinel",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“This designation is not just an acknowledgement of past achievements with a vast network of partners like ODNR, it is also a commitment to the future work creating an even better experience that is there for all of us when we need it most.”\nThe other two trails to receive this designation are a 40-mile segment of the Miami and Erie Canal Towpath Trail in Northwest Ohio and the Blackhand Gorge Trail in Licking County.",
    "“From the shores of Lake Erie to the banks of the Ohio River and through the hills of Appalachia, this looping trail highlights something in every corner of the state that makes Ohio beautiful.”\nThe Buckeye Trail passes through nearly 40 ODNR properties including state forests, state wildlife areas, state nature preserves, and nearly 20 state parks.",
    "“This designation shows how important this trail is for Ohioans who want to see the sights our state has to offer.”\nThe designation as a State Trail recognizes the prominence of the Buckeye Trail in the network of Ohio’s recreational trails and solidifies the partnership between ODNR and the Buckeye Trail Association (BTA).",
    "“This designation is a great compliment to the hard work of generations of Buckeye Trail Association volunteers who have built, maintained, protected, and promoted the trail they dreamed to hike, and share with us all,” Executive Director, Buckeye Trail Association Andrew Bashaw said.",
    "GLOUSTER, Ohio – The 1,450-mile Buckeye Trail was officially designated a State Trail by the Ohio Department of Natural Resources (ODNR) at Burr Oak State Park in Glouster over the weekend.",
    "The Buckeye Trail Association is the leader in building, maintaining, protecting, and promoting the use of Ohio’s longest scenic hiking trail for our citizens, communities, and partners.",
    "After the signing ceremony, Director Mertz and BTA President Steve Walker signed a joint statement acknowledging the designation and celebrating the renewed partnership.",
    "“Trails are something we are very passionate about at ODNR, and the Buckeye Trail is one of my favorite paths in Ohio,” Director Mertz said.",
    "That vision has grown into 1,450 miles of trail connecting big cities and large tracts of forested lands throughout Ohio.",
    "The Buckeye Trail is only the third trail in Ohio to receive this recognition, according to a news release from ODNR.",
    "This includes a 26-mile stretch of Buckeye Trail through the new Appalachian Hills Wildlife Area in Morgan County.",
    "The trail has been expanded and maintained by the association along with dedicated volunteers and landowners.",
    "“Following the Buckeye Trail is one of the best adventures you can find in Ohio’s great outdoors,” Gov.",
    "ODNR Director Mary Mertz made the designation official during the annual BRRRRR Oak Winter Hike.",
    "The inspiration for the Buckeye Trail began in the 1950s.",
    "Information provided by ODNR.",
    "Mike DeWine said."
  ]
}