{
  "id": 11799,
  "mediaId": 8331,
  "date": "2022-03-23",
  "headline": "Gov. Mike DeWine touts Intel deal, economic growth in his State of State address",
  "image": "https://www.gannett-cdn.com/presto/2022/01/21/PNEW/ddeeb349-f3a8-4013-bd61-40b9985c1cf7-NEW_20220121_Intel_Factory_Annoucement_27.jpg?crop=3735,2101,x0,y1641&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/business/economy/2022/03/23/heres-what-gov-mike-dewine-said-intel-his-state-state-address-economy-deal-semiconductor-chips/7139505001/",
  "mediaOutlet": "Granville Sentinel - United States - Ohio",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura A. Bischoff",
  "authorUrl": "https://www.dispatch.com/staff/7138143002/laura-a-bischoff/",
  "termIds": [
    4057,
    2143,
    673,
    646,
    6077,
    6474,
    6310,
    6670
  ],
  "sentences": [
    "JobsOhio President and CEO J.P. Nauseef told the USA TODAY Network Ohio Bureau that while the deal still has details to be fleshed out, it is in place and underway based on \"a handshake and an agreement on that outline.\"",
    "Mike DeWine's first term in office – when COVID-19 and culture wars dominated headlines – the securing of a massive, $20 billion investment from Intel arguably ranks as one of the brightest spots so far.",
    "Titus Wu is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "\"It’s a game-changer for our state and will have positive economic ripple effects across Ohio,\" DeWine declared, later adding that \"Ohio’s economic success is not limited to Intel.\"",
    "More:Here's how Ohio won a bid by Intel to build the world's largest chip factory\nAs many as 3,000 workers with an average salary of $135,000 per year will be employed at the site.",
    "The company has promised to build two plants in Licking County near Columbus to manufacture semiconductors, critical components for everyday technology.",
    "A spokesperson for JobsOhio later reinforced \"that agreeing to terms before having executed agreements is standard for every single project we work on.\"",
    "The Republican governor mentioned Intel during his State of the State address Wednesday, as he laid out his priorities and achievements for the state.",
    "Democrats, on the other hand, have tried to claim success for the Intel deal, giving President Joe Biden and other federal-level Democrats credit.",
    "DeWine used the project in his State of the State speech to bolster his image as a jobs-creating governor who should be elected again this year.",
    "The project, powered by at least $2 billion in state incentives, is expected to break ground by the end of the year.",
    "\"But now we are bringing the highest tech manufacturing known to man into the state of Ohio, and guess what?",
    "DeWine in his re-election bid has touted the Intel deal, Ohio's largest economic development project.",
    "The economy remains a top priority for many voters, and economic growth can boost re-election bids.",
    "He also highlighted tax cuts, state spending reductions, the low unemployment rate and others.",
    "There also will be 7,000 construction jobs and as many as 10,000 indirect jobs.",
    "\"We are finalizing the negotiation of all the definitive documents.",
    "\"Ohio has always been a manufacturing state,\" he said to applause.",
    "He listed multiple other economic projects during his address.",
    "More jobs could come if Intel pursues further expansion.",
    "This is a standard part of the process,\" Nauseef said.",
    "The world is taking notice.\"",
    "During Gov."
  ]
}