{
  "id": 11889,
  "mediaId": 8496,
  "date": "2022-03-28",
  "headline": "Ohio Gov. Mike DeWine announces assistance approval of new projects, including 2 in Cuyahoga County",
  "image": "https://media.wkyc.com/assets/WKYC/images/f855a1b1-4ba3-497b-9477-24298e9fbeb5/f855a1b1-4ba3-497b-9477-24298e9fbeb5_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/ohio-mike-dewine-announces-approval-of-new-projects-including-2-cuyahoga-county/95-346ca2b4-4323-438f-8094-c8968f3196f0",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "According to a press release, the two Northeast Ohio-based projects, both of which are located in Cuyahoga County, include:\nAxuall Inc., city of Cleveland (Cuyahoga Co.): Expects to create 75 full-time positions, generating $7 million in new annual payroll and retaining $1.3 million in existing payroll as a result of the company’s startup project in Cleveland.",
    "Zin Technologies Inc., city of Middleburg Heights (Cuyahoga Co.): Expects to create 125 full-time positions, generating $11.8 million in new annual payroll and retaining $17.4 million in existing payroll as a result of the company’s expansion project in Middleburg Heights.",
    "The projects, which also include approved proposals in Wood County, Hamilton County, Shelby County, Licking County and Franklin County, are expected to result in more than $129 million in new payroll and spur more than $1 billion in investments across Ohio.",
    "Zin Technologies provides advanced engineering services and product development for NASA, the Department of Defense, and private industry.",
    "Axuall provides digital credentialing in health care, including proof about identity, qualifications, credentials, and experience.",
    "Governor Jon Husted have announced the approval of assistance for eight projects statewide, including two in Northeast Ohio.",
    "Altogether, the eight projects are expected to create 1,884 new jobs and retain 838 jobs across the Buckeye State.",
    "The TCA approved a 1.770 percent, eight-year Job Creation Tax Credit for this project.",
    "The TCA approved a 1.913 percent, nine-year Job Creation Tax Credit for this project.",
    "CLEVELAND — Editor's note: the video in the player above is from a previous story.",
    "Ohio Governor Mike DeWine and Lt."
  ]
}