{
  "id": 11906,
  "mediaId": 8498,
  "date": "2022-03-28",
  "headline": "Ohio joins states with no concealed carry license requirement",
  "image": "https://woub.org/wp-content/uploads/2021/09/kyle_koehler_on_house_session_chamber_floor_hb123_payday_lending_072418_-_chow-e1632172673269.jpg",
  "link": "https://woub.org/2022/03/28/ohio-joins-states-with-no-concealed-carry-license-requirement/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We do see up-ticks in the short-term, but I think today if you look back just a few decades it is quite evident that even with the humongous increase in the number of firearms owned and firearms used, that the violent rates are down across the country and across Ohio specifically,” Eaton said.",
    "While campaigning in 2018, DeWine told the Buckeye Firearms Association he would deliver on two major gun bills if elected: a permitless carry bill and a “stand your ground” law allowing people to use deadly force in response to an attack rather than being required to first try and retreat.",
    "Until the new law takes effect, those who do not want to display their gun but still carry must apply for a concealed carry license, a process that requires an application, a minimum $67 fee, a background check and an eight-hour training class including two hours of hands-on instruction.",
    "In 2021, 2,668 concealed carry applications were denied in Ohio, along with 420 licenses that were revoked for felony convictions or mental incompetence, according to Ohio Attorney General David YostIn total, 202,920 new or renewal licenses were granted, a 20% increase from 2019.",
    "So as you travel, late at night, flat tire, you hit a deer, you have the option to use your constitutional right to have your hand gun as protection in the event that something like that would happen and someone with ill intent would be the first to find you,” Wilkins said.",
    "This year there’s a larger increase than usual at this profitable time, which he says could be due in part to a recently signed state law allowing people to carry concealed firearms without a license\n“We’ve seen a small increase in sales because of that,” Linscott said.",
    "In October of 2019, DeWine introduced the “STRONG Ohio plan,” which would have raised penalties against violent offenders caught with guns, expanded courts’ abilities to confiscate firearms and expanded background checks for private firearms sales.",
    "In Kentucky, the number of people with concealed carry licenses has dipped after the state passed a permitless carry law–from 410,000 in 2019 to 396,919 in 2021, according to the Crime Prevention Research Center, a gun rights advocacy group.",
    "So we have seen an increase in gun sales, whether it’s due to the economy or the permitless carry, I’m not sure what’s driven it up some.”\nOhio joined its neighbors in the Ohio Valley as a “permitless carry” state when Republican Gov.",
    "0+1\n0Like\n0Share\n< < Back to\nATHENS, Ohio (OVR) — Every year at tax time Mike Linscott knows that business is soon to pick up at River’s Edge Outfitters, his family-run firearm and archery supply store in Canaanville, Ohio.",
    "The new law, often referred to as the “permitless carry” or “Constitutional carry” bill by supporters, revokes this restriction, allowing any Ohioan, 21 and older, to concealed carry without a license or background check.",
    "Eaton, the spokesperson for Buckeye Firearms Association, has been involved with concealed carry classes in the past and says many Ohioans will see the benefits to going through the process even if it is not required.",
    "According to the Bureau of Alcohol, Tobacco, Firearms and Explosives, a person cannot legally possess a firearm if they:\nHave been convicted of a crime punishable by imprisonment for a term exceeding one year.",
    "“As in other states with such legislation, Ohio will now likely see even more needless gun deaths.”\nGun violence\nThe permitless carry law comes on the heels of the two deadliest years for gun violence in Ohio.",
    "The states also have “castle doctrine” laws on the books, giving citizens the right to protect themselves and those around them on their property, home, or sometimes vehicle by means of force if necessary.",
    "After DeWine signed the permitless concealed carry law earlier this month, the Ohio Coalition Against Gun Violence released a statement reminding DeWine of his promises after the mass shooting in Dayton.",
    "In addition to permitless carry, all three Ohio Valley states also have “stand your ground” laws, which allow people to respond to perceived threats with lethal force without fear of prosecution.",
    "“Shamefully, Governor DeWine has just signed a bill to eliminate essential restrictive measures for those who carry weapons, but put the public at risk,” group board member Rosie Craig wrote.",
    "In 2020 there were 45,222 total gun deaths in the United States, the highest year on record, representing a 14% increase from 2019, a 25% increase from 2015 and a 43% increase from 2010.",
    "That’s what he told me: ‘This is a bad bill’.”\nDeWine has a history with gun reform\nThroughout his one term in office and time on the campaign trail, Ohio’s Republican Gov.",
    "The new law also removes “duty to notify” from the state, making it so Ohioans are no longer required to notify law enforcement of a weapon unless they are directly asked.",
    "Under the new law, set to take effect in June, adults who can lawfully own a firearm will be able to conceal carry a handgun without a permit or background checks.",
    "Back at River’s Edge Outfitters in Canaanville, owner Mike Linscott predicts permitless carry won’t change his business much, other than the increase in customers.",
    "DeWine spoke at a vigil for the victims, but was interrupted with chants of “Make a change” and “Do something.”\nDeWine attended the funeral of one of the victims.",
    "During a debate on the Ohio House floor, he said the measure “puts law abiding citizens on a more equal footing with those who do not care about the law.”.",
    "“Most opposition to this bill wants to make the case that suddenly we will see everybody, everywhere, carrying a gun and I do not think that is the case.",
    "According to the Health Policy Institute of Ohio, the rate of homicides and suicides that involve guns has steadily increased over the last two decades.",
    "“When somebody of this caliber who owns guns, who builds them, says to me that there are people he knows that should not own guns – this is a bad bill.",
    "Democratic Rep. Joe Miller spoke against the bill, citing a constituent who is an avid gun enthusiast that approached him about the bill.",
    "“As governor, I will do everything that I can to see that something positive comes out of this horrible tragedy,” DeWine wrote.",
    "“It in general gives the people of Ohio more choices on how they want to keep themselves and their families safe,” Eaton said.",
    "But the measure didn’t make it far in the legislature, which instead pushed forward with a “stand your ground” law in 2020.",
    "“Sometimes it takes five minutes, sometimes it takes up to three or four days, there is no rhyme or reason,” Linscott said",
    "It’s a heated debate\nGun advocacy groups and many GOP legislators have long been fighting for a law of this kind in Ohio.",
    "In West Virginia, the number of permits has fluctuated from 147,801 in 2015, to 133,991 in 2019 and 147,327 in 2020.",
    "Ohio is currently an “open-carry state,” meaning gun owners can carry a firearm in public so long as it is visible.",
    "According to the Ohio Department of Health, there were 1,762 gun-related deaths in 2021 and 1,764 deaths in 2020.",
    "Concealed carry\nUnlike concealed carry laws, permitless carry measures allow people to forgo background checks.",
    "Joe Eaton, a spokesperson for the Buckeye Firearms Association, argues the statistics point to a safer society.",
    "But gun advocates point out that these numbers, though startling, don’t take into account population growth.",
    "In 1974, the peak of gun deaths for the country, there were 16.3 gun deaths per 100,000 people.",
    "Patrons will still have to get a background check, since his business is federally licensed.",
    "Have been adjudicated as a mental defective or have been committed to a mental institution.",
    "Similar laws are already in place in 23 other states, including Kentucky and West Virginia.",
    "He said the constituent was concerned about the lack of checks for people purchasing guns.",
    "“I will stand up and protect the Second Amendment but this goes too far,” Miller said.",
    "Wilkins represents Ohio’s 91st district, a predominantly rural area in southern Ohio.",
    "From 1999 to 2020, suicide deaths in Ohio increased 49% and homicides increased 123%.",
    "“A lot of people are worried about the unknown, so they want to protect themselves.",
    "A year later in 2019, a shooter killed nine people and injured 27 others in Dayton.",
    "According to the Ohio Capital Journal, DeWine hand wrote a letter to the bereaved.",
    "He said carrying concealed weapons makes people feel safer in his district.",
    "In 2020 the gun-related death rate was 13.6 deaths per 100,000 people.",
    "Mike DeWine has gone back and forth on permitless concealed carry.",
    "We plan our trips knowing you can call now, you can’t call then.",
    "Have been convicted of a misdemeanor crime of domestic violence.",
    "Not everyone will exercise this constitutional right,” he said.",
    "The group said it was “appalled” by the governor’s actions.",
    "Republican state Rep. Shane Wilkins co-sponsored the bill.",
    "Unlawfully use or are addicted to a controlled substance.",
    "Have been discharged from the Armed Forces dishonorably.",
    "Mike DeWine signed into law Senate Bill 215 on March 14.",
    "Across the country, gun-related deaths are on the rise.",
    "DeWine threatened to veto it, but signed it instead.",
    "Have a restraining order against them.",
    "Renounced their US citizenship.",
    "“There’s limited cell service.",
    "Are a fugitive from justice.",
    "Is in the US illegally."
  ]
}