{
  "id": 11941,
  "mediaId": 8278,
  "date": "2022-03-29",
  "headline": "Software Developers among Top Jobs in Ohio",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/03/in-demand-jobs-wee.jpg",
  "link": "https://businessjournaldaily.com/software-developers-among-top-jobs-in-ohio/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“This year, we are specifically bringing awareness to jobs that pay over $50,000 a year and require less than a year of training, giving Ohioans a clear path to their next opportunity.”\nTo learn more about the job opportunities or to find financial assistance to help earn a credential, visit OhioMeansJobs.com or contact the local OhioMeansJobs center.",
    "“The best way to find out if a job is for you is to try it out, and students will have that opportunity to do just that.”\nThis marks the fifth annual In-Demand Jobs Week, which is designed to promote Ohio’s most in-demand and fastest-growing industries through statewide hiring, education and training events.",
    "“During In-Demand Jobs Week, we shine a light on career opportunities that give job seekers a path toward new, high-paying jobs in fields where Ohio businesses are hiring immediately,” said Lt. Gov.",
    "“In-Demand Jobs Week is a great chance for businesses to open their doors and showcase the many top jobs, industries and skills across Ohio,” said Gov.",
    "COLUMBUS, Ohio — In-Demand Jobs Week is May 2 to 6, and the state is promoting the top career paths that pay more than $50,000 annually.",
    "Other jobs being promoted range from computer programmers, which pay a median salary of $84,000, to fire fighters, which pay $51,000.",
    "Promoted jobs don’t require a degree or years of training – just a credential, according to a release.",
    "Software developers are among the highest paying jobs being promoted, with a median salary of $91,000.",
    "Individuals interested in attending an event can use the 2022 event map to find opportunities nearby.",
    "Organizations can visit TopJobs.Ohio.gov to add their event to the official In-Demand Jobs Week map.",
    "Published by The Business Journal, Youngstown, Ohio.",
    "Mike DeWine.",
    "Husted."
  ]
}