{
  "id": 11953,
  "mediaId": 8494,
  "date": "2022-03-22",
  "headline": "Groups will be listening to State of the State for hints on how Ohio will spend billions",
  "image": "https://npr.brightspotcdn.com/dims4/default/d2d1c60/2147483647/strip/true/crop/1572x825+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Fcb%2F5c%2Fefc2dffd43abab5d60fef19895c0%2Fdewine-sos-2019-gesture-pic-credit-ogt.png",
  "link": "https://www.wksu.org/government-politics/2022-03-22/groups-will-be-listening-to-state-of-the-state-for-hints-on-how-ohio-will-spend-billions",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Kelsey Bergfeld, director of Advocates for Ohio’s Future, said the coalition be listening for hints on how DeWine plans to spend $3.3 billion in American Rescue Plan money, since earlier COVID-19 relief funds went to businesses and to pay the state’s unemployment debt.",
    "“We know that folks are still struggling from the impact of the pandemic and looking for investments in health and human services, specifically housing recovery, food and nutritional support as well as ongoing support for things like child care,\" Bergfeld said.",
    "Lawson said he’s especially interested in anything related to leveraging the $20 billion investment that computer chip manufacturer Intel is making, along with $2 billion in state dollars, which is almost certain to come up in this re-election year speech.",
    "With that federal COVID-19 relief money and a capital construction bill set for this year, Greg Lawson with the Buckeye Institute says as always, he’s concerned about too much state spending.",
    "And Bergfeld said the groups will be upset if more funds go to those who have already benefitted from this money, saying this is the time to invest in people and get them back to work.",
    "\"We need to be very targeted in what we do, use the federal resources that we’re getting in targeted ways that help get us back on our feet.\"",
    "\"We need to be sure that we don’t set ourselves up for long-term budget headaches because we overspend in state resources now,\" Lawson said.",
    "Advocates for Ohio’s Future is a coalition of more than 500 health and human services activists and groups involved in safety net programs.",
    "Lawson said he wants to hear DeWine talk about infrastructure, COVID-19 relief, and workforce development.",
    "There are two groups with very different constituencies who listened for specific messages about money.",
    "Mike DeWine (R-Ohio) delivered his first State of the State speech since 2019.",
    "The previous two addresses were scrapped because of the COVID-19 pandemic.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "On Wednesday, Gov."
  ]
}