{
  "id": 1196,
  "mediaId": 8494,
  "date": "2022-02-12",
  "headline": "Former Ohio House Speaker Bill Batchelder dies at 79",
  "image": "https://npr.brightspotcdn.com/dims4/default/d905825/2147483647/strip/true/crop/4000x2100+0+450/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2F4f%2F7d%2Fcdb5a3814fde80bcf74d29c9db66%2Fbatchelder-w-portrait.JPG",
  "link": "https://www.wksu.org/government-politics/2022-02-12/former-ohio-house-speaker-bill-batchelder-dies-at-79",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "At the time, a fierce battle was going on over who would become the new speaker following the resignation of Cliff Rosenberger (R-Wilmington), with forces lining up behind Ryan Smith (R-Bidwell) and Larry Householder (R-Glenford).",
    "In his last interview with the Statehouse News Bureau, Jo Ingles spotted him walking the halls in his familiar blue seersucker suit after a ceremony inducting him into the Senior Citizens Hall of Fame in May 2018.",
    "The conservative lawmaker was one of the founders of what became known as the \"Caveman Caucus\", and wore a dog muzzle on the floor of the House to protest procedure under longtime Democratic Speaker Vern Riffe.",
    "Former Ohio House Speaker William Batchelder - known for his stories and humor, his distinctive glasses and decades of service in the chamber - has died at 79.",
    "And he fought fellow Republican John Kasich when he was governor, pushing back on his plans to expand Medicaid after the passage of the Affordable Care Act.",
    "He and other Republican lawmakers were photographed mowing the Statehouse lawn after raising concerns about budget cuts under Democratic Gov.",
    "Bill was a consummate legislator who helped me as we passed a drunk driving bill in 1982 for which I will always be grateful.",
    "Batchelder was also a judge on the Medina County Court of Common Pleas and the Ninth District Court of Appeals.",
    "He returned in 2007, became speaker in 2011, and left after Republicans won a supermajority of seats in 2014.",
    "He played what was considered a critical role in dealing with the savings and loan crisis in the 1980s.",
    "Batchelder is survived by his wife U.S. Sixth Circuit Court Alice Batchelder and two adult children.",
    "He was a Ronald Reagan Republican – a classic conservative whose guiding principle was freedom.\"",
    "A month later, Smith ended up winning in a three-hour session with 11 rounds of voting.",
    "“The House is my home and this is difficult,\" Batchelder told Jo Ingles at the time.",
    "Mike DeWine said in a statement: “Ohioans are grateful for his decades of service.",
    "He served until 1998, when he was forced out by term limits.",
    "I have sought his advice many times over the years.",
    "Batchelder was first elected to the House in 1968.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "John Gilligan in 1971.",
    "Gov."
  ]
}