{
  "id": 11973,
  "mediaId": 8379,
  "date": "2022-03-23",
  "headline": "Gov. DeWine emphasizes need for mental health resources in State of State address",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/03/MicrosoftTeams-image-1.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/gov-dewine-emphasizes-need-for-mental-health-resources-in-state-of-state-address/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristine Varkony",
  "authorUrl": "https://www.nbc4i.com/author/kristine-varkony/",
  "termIds": [
    0
  ],
  "sentences": [
    "And over 40 percent of Ohio children have experienced one or more Adverse Childhood Experiences, putting them at higher risk for lifelong health and mental health challenges.”\nDeWine said to help fix these issues, the state needs to fund and grow its behavioral health workforce, increase research and innovation, build community capacity for care that offers better crisis response services and treatment, increase prevention efforts, and add more residential and outpatient services.",
    "COLUMBUS, Ohio (WCMH)– Ohio Governor Mike DeWine dedicated nearly one-fifth of his State of the State address Wednesday to the state’s growing mental health crisis.",
    "“In the Ohio I see, fewer families face the unimaginable grief of losing a son, a daughter, a brother, a sister, or a parent to suicide or overdose.",
    "During his one-hour speech, DeWine detailed issues including suicide in young Ohioans, drug overdoses, and Adverse Childhood Experiences.",
    "“The shared adversity of the COVID pandemic has worsened rates of depression, anxiety, addiction, and post-traumatic stress disorder.",
    "Mike DeWine’s 2022 State of the State address\n“Accidental drug overdose deaths remain at record levels,” DeWine said.",
    "And, those who seek help are met with respect and treated with the dignity they deserve,” he continued.",
    "Mental illness is treated as a health issue, not as a crime.",
    "Access to care still remains elusive for too many Ohioans.",
    "Shame, fear, stigma, and embarrassment are erased.",
    "FULL VIDEO: Gov."
  ]
}