{
  "id": 1198,
  "mediaId": 8365,
  "date": "2022-02-15",
  "headline": "Briefs: New Bloomington farmer gets gubernatorial appointment",
  "image": "https://www.gannett-cdn.com/-mm-/1f5cf201681a65be6127472788853de159a5467f/c=0-729-3333-2604/local/-/media/2017/03/06/Marion/B9326557529Z.1_20170306154121_000_GGHHL1P1V.1-0.png?width=3200&height=1801&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.marionstar.com/story/news/2022/02/15/briefs-gov-dewine-reappoints-cy-prettyman-livestock-board/6782064001/",
  "mediaOutlet": "marionstar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marion Star",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Visitors may also take self-guided tours of the historic “Big House.”\nOther festivals are slated at Hocking Hills State Park (March 12-13), Hueston Woods State Park (March 5-6, 12-13) and Indian Lake (March 19-20)\nAll events are free and open to the public.",
    "Four state parks to hold maple syrup festivals in March\nCOLUMBUS — The Ohio Department of Natural Resources (ODNR) invites visitors to celebrate the goodness of locally made maple syrup during festivals taking place in March at four of Ohio's state parks.",
    "Governor reappoints local resident to statewide board\nCOLUMBUS — Governor Mike DeWine has reappointed Cy Leroy Prettyman of New Bloomington to the Ohio Livestock Care Standards Board for a term beginning Feb. 11 and ending Jan, 15, 2025.",
    "Applicants sought for State Farm's Neighborhood Assist initiative\nState Farm is celebrating its 100th anniversary in 2022 by awarding more grants to local communities as part of State Farm Neighborhood Assist.",
    "Upcoming meetings:\n• Tri-Rivers Joint Vocational School District Board of Education, 6:30 p.m., Wednesday, multi-purpose room, Tri-Rivers Career Center, 2222 Marion-Mt.",
    "This year, the program will award 100, $25,000 grants (versus 40 grants in previous years) to nonprofit organizations to help fund neighborhood improvement projects.",
    "The public will have a chance to vote 10 times a day, every day for 10 days, from April 27-May 6, for their favorite causes from the list of finalists.",
    "Last year, 125,000 people cast more than three million votes in support of their favorite causes, selecting winners from small towns and big cities.",
    "One of the first festivals will take place from noon - 4 p.m. on March 5-6 and March 12-13 at Malabar Farm State Park in Mansfield.",
    "These family-fun events will feature activities ranging from live historical demonstrations to maple syrup demonstrations.",
    "There will be live historic and modern demonstrations, horse-drawn wagon rides, food and maple products to taste and buy.",
    "This is among more than two dozen appointments to statewide boards and commissions announced by the governor on Friday.",
    "Individuals or organizations can submit a cause at neighborhoodassist.com starting at 1 p.m. Wednesday.",
    "Gilead Road, Marion\n• River Valley Local Board of Education Policy Committee, 8 a.m., Feb. 25, via Zoom",
    "A review committee will then narrow the field to the Top 200 finalists using a scoring rubric.",
    "Since the program began, more than 380 causes have received a total of $10 million.",
    "Additionally, State Farm is doubling the number of cause submissions to 4,000.",
    "Ultimately, voters will decide which community improvement projects win big.",
    "The 100 causes that receive the most votes will each win a $25,000 grant.",
    "State Farm will accept the first 4,000 submissions.",
    "For more information visit ohiodnr.gov.",
    "Winners will be announced on June 7."
  ]
}