{
  "id": 1200,
  "mediaId": 8278,
  "date": "2022-02-12",
  "headline": "Columbus Drive-In: Valley ‘Well Positioned’ to Get Funding Requests",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/02/2022-columbus-drivein.jpg",
  "link": "https://businessjournaldaily.com/chamber-led-group-presses-local-priorities-during-columbus-drive-in/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Nelson",
  "authorUrl": "https://businessjournaldaily.com/author/gnelsonbusiness-journal-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Based on the conversations he has had, he believes the Valley is “well positioned” to get its requests fulfilled because so much time and effort has been made “on the front end to get to this point.”\nCopyright 2022 The Business Journal, Youngstown, Ohio.",
    "Brite, the energy-focused incubator in downtown Warren, is seeking funds for what its president and CEO, Rick Stockburger, calls “Brite 2.0,” an upgrade of its existing assets to make the space more welcoming and more focused on the future of work.",
    "Members of the group also advocated for projects involving the Butler Institute of American Art, Akron Children’s Hospital Mahoning Valley, Mahoning County Career & Technical Center and Western Reserve Port Authority.",
    "Stambaugh Auditorium, which operates DeYor under a management agreement, will be submitting a request for “significant capital improvements at DeYor,” said JoAnn Stock, Stambaugh chief development officer.",
    "Also, the chamber organized a unified front by many of the players within our community to show how much we all are supporting each other when it comes to this mission, which is quite awesome,” she said.",
    "A group of 74 chamber staff and representatives of local businesses, government entities and not-for-profit organizations traveled to the state capital Wednesday as part of the Regional Chamber’s event.",
    "Lisa Resnick, managing broker of Burgan Friedkin Commercial Group and a member of Oh Wow’s board of directors, was among the participants who were optimistic about getting funding for local priorities.",
    "Getting chamber members in front of key decision-makers is “where we feel our organization provides that type of value not only to our membership but to the entire Mahoning Valley,” McNaughton said.",
    "“The main crux of the day was we brought groups down who are seeking to obtain dollars in the upcoming capital budget,” said Ryan McNaughton, chamber vice president for government affairs.",
    "He expects them to be “very supportive of the local requests, partially because of the effort the chamber has made to build good relationships with those legislators,” he added.",
    "The breakout sessions focused on seeking capital funds for local projects by America Makes, Brite Energy Innovators, DeYor Performing Arts Center, Flying High Inc. and Oh Wow!",
    "The educational center is looking to renovate existing space or build a new facility where it will have an electric car for training students how to repair such vehicles.",
    "During one of the sessions, the chamber hosted the leadership of the Ohio Department of Transportation, DriveOhio and the Ohio Turnpike and Infrastructure Commission.",
    "“I will be starting a capital campaign for that but a large part of the funding we need is hopefully going to come from the capital budget appropriation,” she said.",
    "YOUNGSTOWN, Ohio – Participants in the Youngstown/Warren Regional Chamber’s Columbus Drive-In said they were pleased with what they heard from state officials.",
    "“The next step for us is to build on this momentum and to help these organizations either craft or finalize their narrative and their asks,” he said.",
    "“We really just want to upgrade it in meaningful ways,” with a better entry point and maximizing the space’s footprint, Stockburger said.",
    "They also participated in breakout sessions to advocate on behalf of various local projects with state legislators and officials.",
    "The Roger & Gloria Jones Children’s Center for Science & Technology, as well as various transportation and military projects.",
    "Mike DeWine, Ohio House Speaker Bob Cupp and state Sen. Matt Dolan, chairman of the Ohio Senate finance committee.",
    "“For us in our mission, it’s very easy for everyone to see the positive impact, no matter what side you stand on.",
    "Announcements about what projects will be funded are expected by late May or no later than June 1.",
    "“I got very good feedback from the legislators we were able to talk to,” Stockburger said.",
    "The deadline for capital budget requests to lawmakers is March 18, McNaughton said.",
    "The building needs a new roof and improved access for the Adler Art Academy space.",
    "“We had a very nice showing of business and community leaders from the Valley.",
    "“MCCTC has a really forward-thinking program,” McNaughton said.",
    "It was recognized by the elected officials,” Stock said.",
    "Members of the group heard from speakers including Gov."
  ]
}