{
  "id": 12038,
  "mediaId": 8358,
  "date": "2022-03-26",
  "headline": "What will sports betting do to Ohio’s gambling problems?",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/03/web1_Ohio-40.jpg",
  "link": "https://www.limaohio.com/news/502386/what-will-sports-betting-do-to-ohios-gambling-problems",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "His studies have shown that the opening of brick-and-mortar casinos and racinos roughly doubled the number of Ohioans at risk of gambling problems, and he expects that trend to continue with the availability of sports betting — not just at physical establishments, but on smartphone apps, payable by credit card.",
    "Derek Longmeier, executive director of the Problem Gambling Network of Ohio, has called legal sports betting “certainly the biggest expansion of gambling that Ohio has ever seen.”\nThe Problem Gambling Network of Ohio is a nonprofit group that works with state agencies and provides problem gambling treatment.",
    "You’re going to have a painless way to hit ‘yes, yes, yes’ all the time.”\nPeople will be able to bet not just on entire games but on individual plays, increasing the “velocity” of betting, allowing losses or wins to add up quickly, Anderson said.",
    "“We just know that were doing everything proactively we can ahead of it.”\nHow Ohio is preparing\nAnticipating an upsurge of need, Ohio officials are in contact with surrounding states that have already implemented sports gambling, Anderson said.",
    "“Most Ohioans aren’t aware of how many people are at risk in their communities.”\nPeople with gambling problems may also be at higher risk for drug and alcohol abuse, mental health problems and suicidal thoughts, she said.",
    "People can get off the state exclusion list after one year just by asking, and off of some gaming industry lists; but if they put themselves on a company’s exclusion list for a second time, that’s permanent, he said.",
    "The number of calls to Ohio’s Problem Gambling Helpline has risen for a fifth straight year, according to a new report — and counselors are bracing for a new surge with the rollout of legalized betting on sports.",
    "A 2017 survey by the Ohio mental health department found that one-fourth of sports bettors are at risk of developing a gambling problem, compared to one-tenth of those who gamble on other things, he said.",
    "“All types of sports gaming must be allowed to start at the same time,” no later than Jan. 1, 2023, according to a presentation on the issue given at the casino commission meeting Dec. 15.",
    "One that emerged during the Super Bowl was that some gambling apps didn’t list customer service numbers, so frustrated bettors started calling problem-gambling helplines, he said.",
    "Bets will be allowed on professional sports, college sports and esports teams, but betting on horse racing will remain confined to established pari-mutuel betting at racetracks.",
    "When sports gambling rolls out, Longmeier hopes to have the helpline number appear on smartphone gambling apps, perhaps popping up when someone exceeds a set spending limit.",
    "Three levels of licenses will be issued:\n—One for professional sports organizations and existing casinos, likely in partnership with a sportsbook company to manage betting.",
    "“There’s a difference between responsible entertainment and potentially destructive behavior,” Stacey Frohnapfel-Hasson, DMHAS prevention chief, said in a news release.",
    "Of that, 98% will go to fund public and nonpublic education through General Assembly appropriations, with half to go on sports and other extracurricular activities.",
    "The state estimates that sports betting will be a $1.1 billion industry in Ohio in its first year or so of operation, growing to $3.35 billion within a few years.",
    "People can ask to be removed from exclusion lists - perhaps they want to attend a non-gambling event that’s held on a casino property, Anderson said.",
    "About 6,200 people have participated since its 2012 beginning, with 882 added in fiscal 2021, according to the Ohio for Responsible Gambling report.",
    "“They can use it as a marketing mechanism as well.”\nWhat’s coming\nOhio legislators wrangled for years on whether or how to legalize sports betting.",
    "In the past few years the state mental health department has created a credential for social work with a specialty in problem gambling, he said.",
    "To prevent that in Ohio, the state will put together a public campaign on what the helpline actually does and how to use it, Anderson said.",
    "—One for self-service or clerk-operated gaming kiosks that can be installed in bars, bowling alleys and restaurants with liquor permits.",
    "Ohio for Responsible Gambling is an initiative of four state agencies, led by the Ohio Department of Mental Health & Addiction Services.",
    "A demographic survey found today’s Ohio gamblers are often young, single, and with below-average education and income, he said.",
    "Slot machines, lottery tickets and casino table games are the most common reasons for calls to their helpline, in that order.",
    "March is Problem Gambling Awareness Month, and for that Ohio for Responsible Gambling released a report on gambling trends.",
    "Those facilities, allocated according to county population and economy, may partner with one betting management company.",
    "Some will send users a warning when their play accelerates, but others will encourage people to play more, he said.",
    "They’re often older, well-educated and with higher incomes — believing they have a “system” for winning, he said.",
    "Plus each of those properties has an internal list of people barred from the company’s properties nationwide.",
    "The state Casino Control Commission is working to roll out details of licensure and operation by fall 2022.",
    "———\nHow to get help\nThe gambling helpline is available 24/7 at 800-589-9966, or at www.Beforeyoubet.org.",
    "The state maintains a voluntary exclusion list of people barred from gambling facilities, Anderson said.",
    "“The honest answer is we don’t know how much money it’s going to take (in) or what we’ll see,” he said.",
    "“The sports bettor is unique,” said Scott Anderson, DMHAS problem gambling treatment coordinator.",
    "On some gambling apps, players can pre-set limits on time or money, but not all, Anderson said.",
    "“Those lists actually contain a lot more people globally than we see here in Ohio,” he said.",
    "That money will be welcome, but it’s impossible to say how far it will go, Anderson said.",
    "“We have so much access to whatever it is (that) we do too much of,” Anderson said.",
    "For information on the Problem Gambling Network of Ohio, go to www.pgnohio.org.",
    "“There’s going to be an incredible amount of data collected,” Anderson said.",
    "Every casino and racino has “some sort of exclusion list,” Anderson said.",
    "—One for brick-and-mortar facilities with betting terminals and windows.",
    "“We’re bringing in sports-specific experts to Ohio,” Anderson said.",
    "The remaining 2% will go to programs to combat gambling addiction.",
    "“The sport bettor was the exact opposite of that,” Anderson said.",
    "Both losing and winning can tempt people to bet more, he said.",
    "They’re expected to mostly be at existing casinos and racinos.",
    "On Dec. 9, 2021, the General Assembly approved it, and Gov.",
    "“We’ve listened to what problems they’ve found,” he said.",
    "Now clinician training on sports betting is ramping up.",
    "The bill imposes a 10% tax on sports gaming receipts.",
    "“So it’s going to be a new crop,” Anderson said.",
    "Twice as many men as women are involved.",
    "Mike DeWine signed the bill Dec. 22.",
    "It’s in your pocket all the time.",
    "“It’s in your hand all the time.",
    "But that’s likely to change.",
    "Previous"
  ]
}