{
  "id": 12091,
  "mediaId": 8323,
  "date": "2022-03-23",
  "headline": "DeWine talks COVID recovery, Intel in State of the State",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/03/stateofthestate.jpg?w=1280",
  "link": "https://fox8.com/news/ohios-state-of-the-state-resumes-after-2-year-hiatus/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Talia Naquin",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Ohio Democratic Party Chair Elizabeth Walters issued the following response to DeWine’s address:\n“Amid all of the bombast and bluster Ohioans heard from Mike DeWine today, what we failed to hear is any plan for him to do his job and fix the redistricting mess he created.",
    "The election chaos we’re seeing in Ohio falls squarely at the feet of Mike DeWine and Republicans on the redistricting commission who failed time and again to pass fair maps.",
    "A press release from DeWine’s office said the governor would talk about his vision for the future of Ohio and the strength of the state.",
    "Today, Ohio Democrats are once again calling on DeWine and his fellow Republicans to do their jobs and pass fair maps.”",
    "COLUMBUS, Ohio (WJW) – Ohio Governor Mike DeWine held his State of the State address Wednesday.",
    "Wednesday it resumed in its traditional spot at the Ohio House Chamber of the Statehouse.",
    "DeWine also spoke about the resiliency of the people of Ohio during the COVID pandemic.",
    "The company will be spending $20 billion to build chip factories in Licking County.",
    "The governor faces both primary and general election competition this year.",
    "Ohioans are sick and tired of words, it’s time for action.",
    "The last two addresses were canceled due to the pandemic.",
    "“The state of our amazing state is strong!” said DeWine.",
    "The governor talked about Intel’s Ohio investment.",
    "It was the first State of the State since 2019.",
    "“Ohio is strong!” he said."
  ]
}