{
  "id": 12094,
  "mediaId": 8494,
  "date": "2022-03-21",
  "headline": "As he prepares for his State of the State address, DeWine says his goals have not changed",
  "image": "https://npr.brightspotcdn.com/dims4/default/14050c1/2147483647/strip/true/crop/4107x2156+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Flegacy%2Fsites%2Fwcpn2%2Ffiles%2F201903%2Fmike_dewine_good_lighting_sots_030519_-_chow_cropped.jpg",
  "link": "https://www.wksu.org/government-politics/2022-03-21/as-he-prepares-for-his-state-of-the-state-address-dewine-says-his-goals-have-not-changed",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow",
  "authorUrl": "https://www.wksu.org/people/andy-chow",
  "termIds": [
    0
  ],
  "sentences": [
    "\"If we want Ohio to be the great state that we know it is and be even greater, we have to focus on making sure that every Ohioan, no matter where they live, has the opportunity to live their American dream and has the opportunity to live up to their God-given potential,\" DeWine said.",
    "Mike DeWine's first State of the State address\nDeWine says his speech will focus on items his administration has accomplished by working with the legislature, such as expanding broadband to rural areas of the state.",
    "DeWine's most recent State of the State speech was in March 2019 when he emphasized the importance of investing in programs that support early childhood development, public health, and workforce development.",
    "Since his last State of the State address, DeWine enacted several health orders in response to the COVID-19 pandemic, which included shutting down businesses and schools and mandating face masks in public.",
    "Several legislators fought against those restrictions and passed bills that reduced the governor's ability to implement such orders in the future.",
    "DeWine spent his first months in office fighting for an increase to the gas tax in order to fill a hole in the transportation budget.",
    "He says the other big component of his address will look to the future and outline the state's major priorities.",
    "The relationship between DeWine and some Republican lawmakers has shifted in the past three years.",
    "\"Our goals have not changed,\" DeWine said, when asked for a preview of his March 23 address.",
    "Republican legislators are currently considering a bill to roll back that increase.",
    "Mike DeWine will deliver his second State of the State address to Ohio lawmakers.",
    "DeWine will deliver his second State of the State address at noon Wednesday.",
    "State leaders eventually agreed on an increase of 10.5 cents per gallon.",
    "A key point in his 2019 address might come up again in 2022.",
    "After the pandemic caused a two-year hiatus, Gov.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "Watch: Gov."
  ]
}