{
  "id": 1213,
  "mediaId": 2745,
  "date": "2022-02-11",
  "headline": "‘The Bungles’ no more: Super Bowl-bound Bengals bring hope to long-suffering Cincinnati",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UFRGFDUJXMI6ZA4PBT67NHGOHQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/nation/2022/02/11/bengals-bring-hope-back/?utm_source=rss&utm_medium=referral&utm_campaign=wp_national",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "National\nCINCINNATI — Even in the worst years, when fans sat freezing in the stands of the old Riverfront Stadium here wearing paper bags over their heads while rooting for the losing Bengals, Ricardo Grant’s dad always said the same thing: “This year they’re going to go to the Super Bowl.”\n“My hopes were always high for them!” Ricardo Lewis, 63, said Monday, standing with his son in the snow outside his home as Super Bowl week kicked off.",
    "“Despite that, the people here in Cincinnati, in part because of this team, have so much optimism, so much joy, so much hope for the future, that it’s overwhelming.”\nThe Bengals presented the city with the game ball from their first playoff victory in 31 years, against the Las Vegas Raiders on Jan. 15, and the mayor has been toting it around since.",
    "Asked by reporters Monday which of his many nicknames he prefers — “Joe Brrr” is one, also “Joe Cool” — he said simply, “Just call me Joe.”\nAt a Monday night pep rally at Paul Brown Stadium before the team left for Los Angeles, fans draped themselves in fuzzy tiger-stripe blankets, braved a wind chill of 25 degrees and chanted “Who dey?",
    "“We’re here in this moment on the heels of 24 months of a global pandemic with an economic downturn that’s disproportionally affecting our Black and Brown communities; it’s been a really, really difficult time,” said Cincinnati Mayor Aftab Pureval (D), who took office in January.",
    "People can’t believe the Bengals are in the Super Bowl.”\nThis city of 301,000 has had a rough couple of years, trying to find its way out of an economic downturn that hit it hard, and other parts of Ohio even harder as the coronavirus pandemic has stubbornly persisted.",
    "There was a great pride in not giving up.”\nNow Cincinnati has set its hopes for Sunday and beyond on Burrow, 25, the son of a football coach and a high school principal who grew up a little more than two hours away in Athens County, in the Appalachian foothills.",
    "He managed to overcome a serious knee injury in a late-season game against the Washington Football Team in 2020 to take his team to a 10-7 record this season, surviving a playoff game against the Tennessee Titans where he was sacked nine times.",
    "On Monday, DeWine temporarily renamed three state parks in honor of the Bengals, including Burr Oak State Park in southeastern Ohio to “Burrow Oak State Park” in honor of Burrow, who grew up in nearby The Plains and went to Athens High School.",
    "The city and state have rallied behind the team in a big way, celebrating the Bengals’ “surreal” journey to Los Angeles with outbursts of joy, spontaneous hugs with strangers and chants of “Who Dey?” — the team’s rallying cry.",
    "Jim Moehring, 54, owner of the Holy Grail sports bar downtown, said this January was the first in a decade that he hadn’t had to lay off any of his kitchen staff, with business up 200 percent during the Bengals’ playoff run.",
    "It was like a religious experience.”\nThe Bengals are quickly emerging as fan favorites to beat the Los Angeles Rams on Sunday, even though the Las Vegas oddsmakers disagree — they have the Rams as four-point favorites.",
    "Now the Joe Burrow Hunger Relief fund at the nonprofit Foundation for Appalachian Ohio has grown to $1.5 million, with fans donating nearly $100,000 in the days since the Bengals clinched their Super Bowl berth.",
    "“Whenever a team is winning there is excitement and giddiness and joy, but what’s different here is that there’s disbelief,” said Mo Egger, a local sports radio announcer and lifelong Bengals fan.",
    "He endeared himself to his home state during his speech the night he won the Heisman trophy in 2019 en route to winning the national championship as the quarterback at Louisiana State University.",
    "Bengals fans, who have been cheering for their hometown team since 1968, guzzle beer and eat Cincinnati chili while singing along to Guns N’ Roses “Welcome to the Jungle,” their de facto anthem.",
    "Burrow led his high school team to the state playoffs and was such a great performer in high school that his legend endures — they named the football stadium for him a few years back.",
    "This sports-crazy, blue-collar city on the banks of the Ohio River didn’t have much to celebrate until recently, when the Bengals’ young quarterback Joe Burrow — the NFL’s No.",
    "“Burrow was looking fragile, broken, but he came back from injury and now we’re in the Super Bowl,” said fan Brittany Scruggs, 22, a personal trainer and Cincinnati resident.",
    "He once feared he might have to close down, he said, even though the bar is just yards from home plate of the city’s other cathedral of sport, the Cincinnati Reds’ stadium.",
    "After the Bengals’ unlikely run, their devoted fan base — which stuck with them even during the worst times — deserves its first Super Bowl win, the thinking goes.",
    "Who dey think gonna beat dem Bengals?” (Answer: “Nobody!”) The noise level in the stadium rose to a dull roar when the team entered through a cloud of fake smoke.",
    "He, Heitker and two other high school buddies had season tickets to Bengals games for years even though “everybody would make fun of us,” Moehring recalled.",
    "1 draft pick in 2020 — led the team in a thrilling come-from-behind overtime victory over the Kansas City Chiefs, earning a trip to Sunday’s Super Bowl.",
    "Grant said he has been moved watching those like his dad who have supported the team from the beginning finally being able to feel the winning energy.",
    "The itinerant Rams play before celebrities like Jay-Z and Kendrick Lamar while their moneyed fans sip at the champagne bar in the new SoFi stadium.",
    "“I’m up here for all those kids in Athens and in Athens County that go home to not a lot of food on the table, hungry after school,” he said.",
    "“It’s the gritty underdogs going out to L.A. to take these pretty boys out,” said Grant, who runs a bar, art gallery and barbershop in town.",
    "“We are incredibly proud of the Bengals and everything they have accomplished this season,” DeWine said in a statement announcing the honor.",
    "“There’s a saying: ‘Cincinnati is not a city, it’s a town.’ People who grow up in Cincinnati rarely leave, and if we do, we don’t go far.",
    "Paul Brown Stadium, one of the city’s iconic landmarks, is blazing orange, as are other buildings across the skyline.",
    "“The poverty rate is almost two times the national average, and there’s so many people there that don’t have a lot.",
    "Burrow got the loudest cheer, along with the chant for “MVP, MVP,\" which is what they hoped he would be named.",
    "The Rams just got there two days ago.” (Actually the team returned to L.A. in 2016, but you see his point.)",
    "Their first two appearances — after the 1981 and 1988 seasons — ended in losses to the San Francisco 49ers.",
    "“Coming from southeast Ohio, it’s a very impoverished area,” the then-23-year-old Burrow said, tearing up.",
    "The omicron variant sent the state’s hospitalization levels to an all-time high in December, and Gov.",
    "Moehring was at the Bengals’ playoff game against the Raiders and said he wept as the clock hit zero.",
    "Mostly, he was missing his best friend and business partner, Tom Heitker, who died of cancer in 2017.",
    "The fact that ‘Joey Brrr’ held this ball, they want to be close to him and touch that excitement.",
    "People say they like Burrow because he’s humble and tough, with just the right amount of swagger.",
    "They held onto the seats, and a rotating cast of friends takes Heitker’s seat in his honor.",
    "Fans often donate in multiples of nine — Burrow’s jersey number, the foundation said.",
    "Nearly half-a-million dollars poured into the local food bank after his speech.",
    "“I’ve heard the word surreal used more in the last week than I have in my life.",
    "Mike DeWine (R) sent in the Ohio National Guard to help overwhelmed hospitals.",
    "This is the team’s third trip to the Super Bowl, but the first in 33 years.",
    "Now that statement is true,” said Grant, 36, a Cincinnati entrepreneur.",
    "“This town is deeply rooted in family and tradition,” Grant said.",
    "Last season, the Bengals won four games, the season before, two.",
    "He’s been wearing his “Ohio Against the World” jacket all week.",
    "The whole state will be rooting for them on Sunday, he said.",
    "The contrast between the teams couldn’t be more striking.",
    "(He was named “Comeback Player of the Year” Thursday.)",
    "And do they dare even dream of a victory parade?",
    "Everywhere he takes it, he says, “I’m swarmed.",
    "Schools will be closed the day after the game.",
    "“Bengals fans have been Bengals fans forever.",
    "They hadn’t won a playoff game since 1991.",
    "“It’s definitely the year of the tiger.”",
    "“Took him 30 years to predict it right.",
    "It still seems hard to believe.",
    "So it’s a prideful thing.",
    "Who dey?"
  ]
}