{
  "id": 12163,
  "mediaId": 8288,
  "date": "2022-03-24",
  "headline": "DeWine's State-of-State Promises: Groups Say Proof is in the Policy",
  "image": "",
  "link": "https://www.clevescene.com/cleveland/dewines-state-of-state-promises-groups-say-proof-is-in-the-policy/Content?oid=38603020",
  "mediaOutlet": "clevescene.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Kuhlman",
  "authorUrl": "https://www.clevescene.com/author/mary-kuhlman-ohio-news-service",
  "termIds": [
    0
  ],
  "sentences": [
    "\"The top thing that we need to be doing at a time where we need to be focusing on getting the workforce ready for the 21st century challenges and making sure that we keep a competitive tax code for the state,\" Lawson added.",
    "Greg Lawson, research fellow at conservative think tank the Buckeye Institute, applauded DeWine for highlighting reduced state spending and tax cuts, and cautioned against any new and increased spending.",
    "Hannah Halbert, executive director of Policy Matters Ohio, a progressive research organization, said she appreciated the governor's vision for a thriving Ohio, providing opportunity for all.",
    "DeWine also touted policies to improve telehealth, as well as addiction and mental-health services, and new investments in the Appalachian region and state parks.",
    "\"We've been able to get through the COVID pandemic, we've come back with good, strong tax revenues, and that's all very positive,\" Lawson outlined.",
    "\"The majority of Ohioans, the bottom 60% of people earning money, have actually seen some increases in what they're paying in taxes and fees.\"",
    "\"But if you spend too much today that sometimes sets you up for problems when there's a recession or something hits in the future.\"",
    "DeWine also promoted the recent announcement of Intel's $20 billion investment in two semiconductor facilities in Central Ohio.",
    "The governor avoided the controversial issues of the state's redistricting debacle, and the House Bill 6 bribery scandal.",
    "\"Tax cuts overwhelmingly have benefited people who are very well-to-do, have very high income,\" Halbert pointed out.",
    "\"It's encouraging to hear the optimism; it's encouraging to hear the big vision,\" Halbert acknowledged.",
    "\"But what do these proposals actually look at and who's actually being called in to share this vision?\"",
    "DeWine touted the resiliency of Ohioans throughout the pandemic, as well as the state's strong economy.",
    "And we believe everyone deserves access to accurate independent coverage of their community and state.",
    "Halbert contended all Ohioans should join in the prosperity, which she argued is not always the case.",
    "Mike DeWine promised a bright future for Ohio, but policy analysts said the proof is in the policy.",
    "Help us keep this coverage going with a one-time donation or an ongoing membership pledge.",
    "Lawson, again, urged lawmakers to carefully consider what is being prioritized.",
    "Join the Cleveland Scene Press Club\nLocal journalism is information.",
    "In his second State of the State address on Wednesday, Gov.",
    "Information is power."
  ]
}