{
  "id": 12705,
  "mediaId": 2537,
  "date": "2022-02-27",
  "headline": "5 stories to know to start your week: Ukraine, Brent Spence, Bengals, segregation, lawyer",
  "image": "https://www.gannett-cdn.com/presto/2021/11/08/PCIN/f15d9f77-2747-4437-bd53-b5b23c0f42a2-110821_BSB_004.jpg?crop=5999,3375,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/02/27/cincinnati-news-stories-this-week-ukraine-bridge-bengals-law/6968167001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wayne Baker",
  "authorUrl": "https://www.cincinnati.com/staff/6868945002/wayne-baker/",
  "termIds": [
    5341,
    3362,
    4614,
    2143,
    670,
    275,
    1320,
    6279,
    6672
  ],
  "sentences": [
    "The disciplinary counsel, the office that investigates attorney misconduct, filed a motion with the Ohio Supreme Court for an interim remedial suspension of Dusing's license\nSegregation in Cincinnati’s neighborhoods: A brief history\nThe history of segregated neighborhoods in Cincinnati is long and complicated.",
    "Motion filed to suspend Ohio law license of attorney who threatened to 'blow up' lawyers\nThe Ohio disciplinary counsel filed a motion Friday to immediately suspend Ben Dusing, a high-profile Northern Kentucky attorney, from practicing law in Ohio.",
    "Her story is now a play, penned by her grandson\nReports from the ground: Attacks begin on Cincinnati's Ukrainian sister city, Kharkiv\nLast week, The Enquirer interviewed a number of Kharkiv residents.",
    "Here's how I handled it\nMy commentary last week criticizing city leaders for staging a rally for the Super Bowl runner-up Bengals evoked quite a passionate response from the community.",
    "Andy Beshear are holding a joint meeting Monday to announce new plans to secure funding in order to address traffic congestion on the Brent Spence Bridge.",
    "Get ready for the week ahead and download the Cincinnati.com app to be the first to know about breaking news in your community.",
    "It has existed since the 1800s and has been shaped by politics, development and the economic changes brought by both.",
    "JFC $20 million relief effort:Jewish Federation of Cincinnati joins $20 million relief campaign for Jews in Ukraine",
    "They were hopeful that diplomacy would prevail and a conflict would be averted, but a lot has changed in a week.",
    "Jason Williams: Criticism of staged rally for Super Bowl runner-up Cincinnati Bengals evoked visceral response.",
    "Ohio, Kentucky governors meeting Monday to announce plans for Brent Spence Bridge funding\nOhio Gov.",
    "Freedom Rider:Sixty years ago, she was a Freedom Rider in peril.",
    "Now it's your turn to share your voice in this column.",
    "Segregation is nothing new to the city.",
    "Mike DeWine and Kentucky Gov."
  ]
}