{
  "id": 12918,
  "mediaId": 2537,
  "date": "2022-03-04",
  "headline": "Ohio Politics Explained podcast: Conceal carry permit and Russian vodka could disappear",
  "image": "https://www.gannett-cdn.com/presto/2022/02/27/NCOD/6eadd60d-9a6b-4b1a-949d-c66fb535451f-Ukraine3.jpg?crop=1088,612,x0,y192&width=1088&height=612&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/03/04/ohio-explained-podcast-no-more-conceal-carry-permits-russian-vodka/9363076002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Staver",
  "authorUrl": "https://www.dispatch.com/staff/5802228002/anna-staver/",
  "termIds": [
    5199,
    3235,
    2143,
    1477,
    1489,
    6201,
    6569,
    6474
  ],
  "sentences": [
    "Ohio Republicans passed new Congressional maps, a resolution condemning the invasion of Ukraine by Russia and a bill to eliminate the state's concealed carry permit.",
    "Senate Bill 215, which is known as constitutional or permitless carry, would let anyone 21 or older conceal a firearm so long as they are legally allowed to own it.",
    "The USA TODAY Network Ohio Bureau serves The Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "4) Abortion laws and lawsuits\nA Hamilton County judge blocked the Ohio Department of Health from revoking credentials for Southwest Ohio's two abortion clinics.",
    "1) Redistricting redo\nRepublicans on Ohio's redistricting commission hope the third time is the charm when it comes to the maps for the state House and Senate.",
    "At the same time, Sen. Steve Huffman, R-Tipp City, introduced a bill that would require those seeking the abortion pills to undergo an in-person exam.",
    "3) Time to divest\nOhio's elected officials took symbolic and substantive steps this week to assert their opposition to Russia's invasion of Ukraine.",
    "The eight hour safety course, background check and permit would become optional for folks who need the license to conceal carry in another state.",
    "Republicans said this law would restore Second Amendment rights, while Democrats and law enforcement worried it would make Ohio cities less safe.",
    "And Attorney General Dave Yost said it was a \"moral imperative\" that Ohio's five public pension funds divest their Russian financial holdings.",
    "Ohio law requires clinics to have admitting privileges at area hospitals in case of emergencies or be affiliated with doctors who do.",
    "It's a podcast from the USA TODAY Network Ohio Bureau where we catch you up on the state's political news in 15 minutes or less.",
    "The rule came in response to a state law passed in December that put more restrictions on doctors who partner with the clinics.",
    "And they think the May primary can go forward as planned so long at the Supreme Court doesn't strike down either one.",
    "Lawmakers in the House and Senate unanimously passed resolutions condemning Russia's actions.",
    "Listen to \"Ohio Politics Explained\" on Spotify, Apple, Google Podcasts and TuneIn Radio.",
    "We break down what it all means on this week's episode of Ohio Politics Explained.",
    "Mike DeWine this week that would eliminate the need for a concealed carry permit.",
    "The episode is also available by clicking the link at the top of the article.",
    "This week, host Anna Staver was joined by reporter Jessie Balmert.",
    "2) No permit, no problem\nOhio Republicans sent a bill to Gov.",
    "Mike DeWine pulled Russian vodka from store shelves.",
    "They also passed a second Congressional map.",
    "Gov."
  ]
}