{
  "id": 13043,
  "mediaId": 3993,
  "date": "2022-03-03",
  "headline": "Dismantling dumb argument against Ohio constitutional carry",
  "image": "https://bearingarms.com/wp-content/uploads/2022/03/gun-belt-carry-holster-gun-holster-5538604-e1646333256206-1110x740.jpg",
  "link": "https://bearingarms.com/tomknighton/2022/03/03/constitutional-carry-18-n56033",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Knighton",
  "authorUrl": "https://bearingarms.com/author/tomknighton",
  "termIds": [
    2143,
    970,
    6474
  ],
  "sentences": [
    "This Assembly is ready now to pass a bill allowing virtually any adult to legally carry a gun in public, hidden from your view, without first getting a permit or a background check or any training whatsoever.",
    "Gun rights advocates insist that gun regulation is a “slippery slope” that leads to gun confiscation, even as these same advocates march us down the real slippery slope — toward no gun regulation at all.",
    "After all, one shouldn’t have to jump through legal hoops to carry a gun when the Second Amendment specifies the right to keep and bear arms as one that shall not be infringed.",
    "For years, Ohioans have been assured that allowing responsible gun owners to hide their guns and carry them everywhere will make us freer and safer.",
    "Since the passage of Ohio’s concealed-carry law in 2004, each successive Ohio General Assembly has taken more steps to reduce gun regulations.",
    "They’re more focused on getting that gallon of milk they need or hoping that the brand of cat food they buy is actually on the shelf today.",
    "I mean, a lot of us are pretty upfront about it, so I don’t see why he’s making this huge pronouncement like he’s discovered something.",
    "All while admitting that Ohio’s murder rate actually increased by less than the national average as the state restored gun rights?",
    "Though gun violence across the nation also increased, the national homicide increase was 34%, substantially lower than Ohio’s.",
    "They’re far from alone, of course, but it seems likely that they’ll be the next state to do so with a bill now headed to Gov.",
    "I will say, though, that if this is the best gun control has these days, our Second Amendment rights are safe and sound.",
    "Criminals have long carried guns illegally, and virtually no one was paralyzed by the fear that this was the case.",
    "I feel like I’m picking on the special needs kid on the school bus here, so I’m going to put the breaks on it.",
    "The process takes months but the latest data (for 2020) were released recently and Ohio is doing miserably.",
    "The federal Centers for Disease Control and Prevention annually counts up all the ways that people die.",
    "Do we feel freer to enter public places knowing that anyone/everyone around us may be secretly armed?",
    "Some people suck are arguing their position, but even they are better at it than this guy.",
    "While suicides still lead Ohio’s grim numbers, gun homicides increased by a shocking 46%.",
    "Will we feel even freer if the gun carriers among us are likely to have no real training?",
    "They don’t even blink at the possibility or have it even remotely enter their minds.",
    "The only good news for Ohio was a reduction in gun suicides during the pandemic.",
    "And that’s your argument for putting the breaks on further restoration efforts?",
    "Suicide is a mental health issue and isn’t impacted by constitutional carry.",
    "However, not everyone is a fan of that, as an op-ed managed to point out.",
    "The state of Ohio is poised to enshrine Constitutional Carry into law.",
    "From 2019 to 2020, Ohio gun deaths of all kinds increased nearly 12%.",
    "One question is easy to answer: Are we safer from gun violence?",
    "They’re not panicking because someone might be carrying a gun.",
    "Oh, but he’s got statistics showing how awful everything is.",
    "Not in Ohio and not anywhere else in the world, either.",
    "Gun deaths of all kinds rose by 12 percent, huh?",
    "And that’s a good thing because guess what?",
    "How much freer and safer are we since 2004?",
    "They simply went along with their lives.",
    "Most people don’t even think about it.",
    "That’s good news for a lot of Ohioans.",
    "“Oh, but suicides-”\nShut the hell up.",
    "He says this like it’s a bad thing.",
    "People were carrying guns already.",
    "The bill is Senate Bill 215.",
    "It’s kind of sad, really.",
    "I mean, I get it.",
    "In 2020 you say?",
    "Mike DeWine.",
    "The truth?"
  ]
}