{
  "id": 13058,
  "mediaId": 2570,
  "date": "2022-02-28",
  "headline": "10 States Have Banned Russian Vodka—A Symbolic Gesture With Little Economic Punch",
  "image": "",
  "link": "https://www.forbes.com/sites/zacharysmith/2022/03/01/10-states-have-banned-russian-vodka-a-symbolic-gesture-with-little-economic-punch/?sh=2213d6b22f9c",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Snowdon Smith",
  "authorUrl": "https://www.forbes.com/sites/zacharysmith/",
  "termIds": [
    0
  ],
  "sentences": [
    "Jim Justice (R) Monday issued executive orders instructing their states’ alcohol control agencies to remove Russian liquor from shelves, with Cox remarking Utah’s businesses “will not support Russian enterprises, no matter how small the exchange.”\nPennsylvania’s Liquor Control Board Sunday instructed state-run Fine Wine & Good Spirits liquor stores to halt the buying and selling of Russian products, following a plea from Gov.",
    "Russian Standard sold 237,000 9-liter cases in the U.S. in 2019, compared to 8.9 million from Smirnoff, a British-owned brand with distilleries in several countries including the U.S., 8.8 million from U.S. brand Tito’s Handmade Vodka and 5.3 million from U.S. brand New Amsterdam Vodka, according to the Beverage Information Group.",
    "tweeted that Americans should dump Russian vodka and “send the empty bottles to Ukraine to use for Molotov cocktails.”\nVodka is the best-selling spirit in the U.S., accounting for 78.1 million 9-liter cases sold in 2021, up from 62.7 million cases in 2011, according to the Distilled Spirits Council of the United States (DISCUS).",
    "Topline\nAlabama on Monday became the latest state to banish Russian vodka from shelves, joining a nationwide movement that, while packing a symbolic punch by targeting one of Russia’ best-known products, impacts a tiny proportion of total liquor sales and in some cases has led to the mistaken dumping of non-Russian liquor.",
    "A bar at Vermont’s Magic Mountain Ski Area Thursday tweeted a video of a bartender pouring out a bottle of Stolichnaya vodka, announcing, “Sorry, we don’t serve Russian products here.” Stolichnaya was originally a Soviet brand, sometimes sourced from Ukraine.",
    "Russian vodka accounted for just $18.5 million—or 1.3%— of all vodka imports to the U.S. in 2021, compared to $660 million imported from France, $291 million from the Netherlands, $177 million from Sweden and $137 from Latvia, according to DISCUS.",
    "However, Russian vodka imports have declined by nearly 79% in that period and now account for only a small proportion of vodka sold in the U.S. marketplace, said Lisa Hawkins, senior vice president of public affairs for DISCUS.",
    "Cox acknowledged that removing Russian vodka from shelves in Utah was—like holding rallies in support of Ukraine—a “mostly symbolic” gesture, and compared it to the raising of the U.S. flag at Iwo Jima during World War II.",
    "The Stolichnaya brand is presently owned by two separate companies, one in Russia and one in Luxembourg, the latter of which supplies the vodka that’s widely available in the United States.",
    "Smirnoff is another high-profile vodka brand that traces its origins to Russia, but it is no longer based in Russia, and Smirnoff consumed in the U.S. is produced in Plainfield, Illinois.",
    "Tom Wolf (D) to remove Russian products “as a show of solidarity and support for the people of Ukraine.”\nSome politicians have taken less binding steps: In a tweet Saturday, Texas Gov.",
    "Janet Mills (D) called for the state’s Liquor and Lottery Commission to quickly delist all Russian-made spirits, preventing the spirits from being offered at stores or restaurants.",
    "I thought I would put on sanctions as well.’’\nRussian Standard is one of the leading Russian vodka brands in the U.S., but its sales are dwarfed by non-Russian brands.",
    "Kay Ivey (R), the Alabama Alcoholic Beverage Control Board pulled Russian Standard, the lone Russian vodka stocked in the state, while Maine Maine Gov.",
    "Justice banished Russian-produced brands Beluga Vodka, Hammer & Sickle Russian Vodka, Moskovskaya and Russian Standard from liquor store shelves.",
    "Greg Abbott (R) asked all Texas retailers to voluntarily remove Russian products from their shelves, while Sen. Tom Cotton (R-Ark.)",
    "Cox’s executive order, on the other hand, directed Utah liquor stores to remove Russian-branded products from their shelves.",
    "That’s about how many liters of vodka DISCUS reports were sold in the U.S. in 2021—enough to make 23 billion martinis.",
    "“You wonder what you can do,” Bob Quay, proprietor of Bob’s Bar in Grand Rapids, Michigan, told the Associated Press.",
    "However, the Stolichnaya vodka currently widely available in the U.S. is produced in Latvia.",
    "However, non-Russian-produced vodka brands using Russian brand names were exempted.",
    "Ivey also specifically exempted merely “Russian-themed” products.",
    "Christopher Sununu (R) Saturday and North Carolina Gov.",
    "“The U.S. obviously is putting on sanctions.",
    "Spencer Cox (R) and New Hampshire Gov.",
    "Roy Cooper (D) and West Virginia Gov.",
    "Monday, at the urging of Alabama Gov.",
    "703 million.",
    "Utah Gov."
  ]
}