{
  "id": 1307,
  "mediaId": 8384,
  "date": "2022-02-18",
  "headline": "Ohio redistricting process falters as panel hits ‘impasse’",
  "image": "https://www.news-herald.com/wp-content/uploads/2021/07/newsherald.jpg",
  "link": "https://www.news-herald.com/2022/02/18/ohio-redistricting-process-falters-as-panel-hits-impasse/",
  "mediaOutlet": "news-herald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.news-herald.com/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "House Democratic Leader Allison Russo said, “This is a direct assault on our democracy and Ohio voters, and if we do not respect the legitimacy of the courts, then we are disrespecting the rule of law.”\nRusso led the fight earlier in the afternoon for her party’s proposed district lines, insisting in the face of vigorous questioning that they met all provisions of the Ohio Constitution.",
    "As Ohio continues to wade through a new redistricting process for the first time, it was unclear where Thursday’s decision not to act would leave the three separate lawsuits filed against the original maps by voting-rights and Democratic groups, including the legal arm of former Attorney General Eric Holder’s National Democratic Redistricting Committee.",
    "“But in spite of the fact that you have supermajorities in the House and Senate, all the statewides (offices), the congressional delegation, this commission and the Ohio Supreme Court, you’ve been unable and unwilling to comply with our highest directive, and that is to comply with the constitution.”\nRepublican Gov.",
    "The two Democrats on the seven-member Redistricting Commission rejected the GOP line of argument, after presenting a version of Ohio House and Senate maps that their mapmakers said were constitutional.",
    "“Unfortunately, as a practical matter, it would appear — at least at this point — that this body is at an impasse, said Secretary of State Frank LaRose, one of five Republicans on the commission.",
    "By JULIE CARR SMYTH\nCOLUMBUS — Republicans on the Ohio Redistricting Commission declared defeat in their attempts to redraw state legislative maps in the face of a court-set deadline Thursday.",
    "Huffman also asserted that Democrats’ map violated federal law through “racial gerrymandering,” a practice where Black voters are targets and drawn intentionally into districts.",
    "LaRose and other Republicans said the party’s expert mapmakers simply couldn’t find a way to draw constitutional maps that met all the Ohio Supreme Court’s requirements.",
    "Democratic co-chair Sen. Vernon Sykes, a 30-year veteran of the Legislature, maligned Republicans for what he said was a dereliction of duty as the state’s ruling party.",
    "The plan would have delivered approximately 45% of legislative seats to their party and 54% to the GOP, which roughly matches Ohio’s political breakdown.",
    "Republican Senate President Matt Huffman argued that drawing individual districts to favor or disfavor one party is in itself gerrymandering.",
    "They said they saw no path forward that would both comply with orders from the state’s high court and meet the state’s Constitution.",
    "I don’t think that that is an option that the law gives us.”\nYet no additional maps were on the table as the panel adjourned.",
    "He pressed Russo on the fact the Democrats’ latest maps would have displaced more than a dozen sitting Republican lawmakers.",
    "Russo replied that “some of the unfairly favored members will lose their seats” when a state is undoing a gerrymander.",
    "LaRose has said the state is now precariously close to violating federal and state laws for carrying out the election.",
    "“If, comprehensively, this district plan favors or disfavors a political party, it is unconstitutional,” he said.",
    "Mike DeWine, a member of the commission, said, “We have an obligation under law to give them a third map.",
    "The maps went down to defeat, however, in a party-line vote shortly before the deadlock was declared.",
    "… I think it is a mistake for this commission to stop and to basically say that we’re at an impasse.",
    "The impasse also raised questions for the fate of Ohio’s primary, still scheduled for May 3.",
    "Sykes, an Akron Democrat who is Black, said Democrats did not take race into consideration.",
    "“The majority has the responsibility and the authority to rule, to decide.",
    "They’ve got the numbers,” Sykes said.",
    "It was rejected along party lines."
  ]
}