{
  "id": 13194,
  "mediaId": 2537,
  "date": "2022-03-04",
  "headline": "Ohio's pension funds want to divest from Russia. The question is: How?",
  "image": "https://www.gannett-cdn.com/presto/2021/11/24/NCOD/d8d3d45a-320f-4aa1-81bc-356663f50c4c-STRS_DCIII.JPG?crop=3983,2241,x8,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/03/04/ohio-pension-funds-may-divest-russian-investments-support-ukraine/9376085002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura A. Bischoff",
  "authorUrl": "https://www.dispatch.com/staff/7138143002/laura-a-bischoff/",
  "termIds": [
    0
  ],
  "sentences": [
    "Other states divesting in Russian assets\nState Sen. Niraj Antani, R-Miamisburg, introduced legislation to force divestiture and noted that California, Arkansas, Indiana, Georgia, Pennsylvania, New York, North Carolina and Colorado have all taken steps to divest public investments and or cancel contracts in Russia.",
    "We just need to figure out how to do this, given the turmoil that is occurring,\" said state Sen. Kirk Schuring, R-Canton, who leads the Ohio Retirement Study Council, which will discuss divesture at its meeting Thursday.",
    "Laura Bischoff is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "\"Our retirement systems are independent trust funds regulated by the Ohio Revised Code,\" said Schuring, who has been involved in the Ohio Retirement Study Council for 25 years.",
    "The School Employees Retirement System put a hold on any new purchases and told investment managers to consider selling assets if a reasonable and prudent opportunity arises.",
    "Ohio's five public pension systems, which collectively have more than $210 million invested in Russian assets, are considering how they can best get rid of the holdings.",
    "The pension systems opposed it, saying it could cost them big money and conflict with their fiduciary responsibilities to manage the investments for the best returns.",
    "Holdings in Russian interests held by the five pension systems are:\nOhio Public Employees Retirement System: roughly $110 million, out of a $123 billion portfolio.",
    "Legislators and the systems agreed to a compromise that called for voluntary, gradual divestment, and annual reports to the legislature.",
    "\"The reality however, is that there is currently no market for the sale of Russian securities,\" said SERS spokesman Tim Barbour.",
    "Ohio Highway Patrol Retirement System: no direct investments in Russian holdings but has $1.6 million in co-mingled funds.",
    "In 2007, then state representative Josh Mandel pushed legislation to require the funds to divest from Iran and Sudan.",
    "Over the years, Ohio's public pension systems have been fiercely independent in resisting controls on investments.",
    "Selling off investment holdings in Russian companies to show support for Ukraine is easier said than done.",
    "But the systems are independent and forcing them to take action would require a change in state law.",
    "And Ohio's pension funds have a fiduciary responsibility to manage investments for the best returns.",
    "State Teachers Retirement System: less than $50 million, or less than 0.05% of its assets.",
    "School Employees Retirement System: $42.1 million, out of a $17.8 billion portfolio.",
    "Ohio Police & Fire Pension Fund: roughly $6.5 million, out of $19 billion portfolio.",
    "Mike DeWine issued an executive order telling the pension funds to divest.",
    "The Russian stock market is closed, hindering trading.",
    "\"Absolutely we need to divest.",
    "Ohio Gov."
  ]
}