{
  "id": 13216,
  "mediaId": 2559,
  "date": "2022-02-28",
  "headline": "Reynolds orders Iowa wholesaler to stop selling Russian-made liquor; vodka removed from some shelves",
  "image": "https://www.gannett-cdn.com/presto/2022/02/28/PDEM/556b6f5f-be0d-4888-aa5f-4db2d537a416-Stoli_Drake_Neighborhood.jpg?crop=4031,2268,x0,y373&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.desmoinesregister.com/story/news/2022/02/28/gov-kim-reynolds-orders-iowa-alcoholic-beverages-division-stop-selling-russian-liquor-vodka-ukraine/6964657001/",
  "mediaOutlet": "Des Moines Register",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philip Joens",
  "authorUrl": "https://www.desmoinesregister.com/staff/2684116001/philip-joens/",
  "termIds": [
    0
  ],
  "sentences": [
    "Permanent Listing\nRussian Standard Original vodka\nRussian Standard Platinum vodka\nHammer + Sickle vodka\nSpecial Order on Hand Listing\nRussian Standard Imperia vodka\nZu Bison Grass vodka\nQuadro vodka\nSpecial Order\nRussian Standard Gold vodka\nGreen Mark vodka\nGancia Fernet liqueur\nDeLuze Cognac VSOP\nJewel of Russia Classic vodka\nJewel of Russia Ultra vodka\nBeluga Noble vodka\nBeluga Gold Line vodka\nBeluga TransAtlantic Racing vodka\nZyr vodka\nMamont vodka\nInformation from USA TODAY and the Associated Press was used in this report.",
    "More:Black Velvet Whiskey remains Iowans' favorite drink for nearly a decade, and they're drinking more overall\nOther states cut ties with Russian products, services\nOfficials in Ohio, Pennsylvania, New Hampshire, Utah and Virginia, where state boards also control alcohol sales, directed Russian-sourced alcohol to be removed from store shelves.",
    "Iowa is one of 17 states that controls the wholesale of alcoholic beverages, according to a news release from the governor's office, which called the move a show of \"solidarity with the brave people of Ukraine as they defend their freedom against (Vladimir) Putin’s tyranny.\"",
    "“Indiana will not be a safe haven for ill-gotten Russian funds, nor for its oligarchs trying to find financial shelter in the wake of Putin’s unconscionable invasion of Ukraine,” Democratic state Rep. Ryan Dvorak said while proposing the amendment last week.",
    "Blue Ox Vodka out of Grimes topped the list of Iowa liquor brands, ranked by gallons sold, followed by Cedar Ridge Bourbon from Swisher, Gotcha Vodka in Clive, Swell Vodka in Cumming, and Prairie Fire Cinnamon Flavored Whiskey in Cumming.",
    "Reynolds also on Monday ordered Iowa Sister States to end its relationship with Stavrapol Krai, Russia, and provide recommendations for enhancing its relationship with Cherkasy Oblast, Ukraine, according to the release from her office.",
    "Georgia House Speaker David Ralston, a Republican, got a bipartisan standing ovation Monday when he told representatives he would seek to have the state’s retirement funds quickly divested from any Russian assets.",
    "Many vodkas associate their brands with Russia because Russia traditionally is thought to have the best vodka in the world, Duax said — and the word \"vodka\" comes from the Russian word \"voda,\" which means water.",
    "Russian-made products no longer available through Iowa Alcoholic Beverages Division\nThe following is a list of Russian-made liquor products that the Iowa Alcoholic Beverages Division will stop selling after Gov.",
    "The Iowa Alcoholic Beverages Division determines brands of liquor products available to retailers, such as grocery stores, liquor stores and other liquor license holders, which then sell products to consumers.",
    "In the last fiscal year, liquor sales in Iowa topped $415 million, a record that beat 2020 sales by 13.2%, according to the annual report from the beverages division.",
    "Vodka most popular liquor in Iowa\nVodka is clear, colorless and tasteless, which makes it popular with a wide range of drinkers — \"It's very easy to mix,\" Duax said.",
    "Many Hy-Vee stores across Iowa removed vodkas with Russian-sounding names like Stolichnaya over the weekend, including stores in downtown Des Moines and Iowa City.",
    "Duax noted that Central City still has many of the state's prohibited items for sale at its retail store, but they make up only a small portion of its business.",
    "American vodka was the state's top-selling category with more than $59 million in sales and nearly 1.5 million gallons sold, according to the latest report.",
    "Kim Reynolds on Monday ordered the Iowa Alcoholic Beverages Division to remove Russian-produced alcoholic liquor products from its wholesale purchase list.",
    "Out of 30 imported vodkas sold in Iowa only two are Russian-made, according to the beverages division, which doesn't supply any vodkas from Ukraine.",
    "Twenty of the top 50 liquors sold in Iowa were vodkas, and seven of the 20 most popular liquors made in Iowa, in terms of gallons sold, were vodkas.",
    "The Indiana House passed legislation that would block Russian-controlled businesses and nonprofits from acquiring property in the state for a year.",
    "In a news release Monday the beverages division listed 17 products it will no longer sell, including 13 vodkas and four other liquors.",
    "Hochul ordered New York agencies to divest money and assets from companies or institutions aiding Russia in its war against Ukraine.",
    "Tito’s Handmade Vodka, Captain Morgan Original Spiced Rum, Fireball Cinnamon Whiskey and Hawkeye Vodka rounded out the top five.",
    "Since 2012, Black Velvet Canadian Whiskey has been the best-selling liquor brand in Iowa, and last year sold 380,492 gallons.",
    "Gregg Abbott, a Republican, asked restaurants and retailers to \"voluntarily remove all Russian products from their shelves.\"",
    "The beverages division will not accept returns of any of the prohibited products and will cancel any pending special orders.",
    "He expected the state to take some action to support Ukraine, but wasn't sure what that'd be until Monday's announcement.",
    "Retailers and bars will not be prohibited from selling items on the list currently in stock, according to the release.",
    "The vodka became a popular target of people protesting Russia's invasion of Ukraine last week, according to USA TODAY.",
    "In fact, only 1.2% of U.S. vodka imports came from Russia during the first half of 2021, according to USA TODAY.",
    "Kathy Hochul, a Democrat, signed an executive order Sunday forbidding her state from doing business with Russia.",
    "On its website, Stoli Group says it “stands for peace in Europe and in solidarity with the Ukrainian people.\"",
    "Imported vodka was ninth in sales at $14.9 million and eighth in volume at about 225,000 gallons.",
    "He can be reached at 515-443-3347 at pjoens@registermedia.com or on Twitter @Philip_Joens.",
    "Central City Liquors Vice President Brian Duax handles the company's wholesaling products.",
    "It is not included on the beverages division's list of Russian-made products.",
    "Stolichnaya is a popular vodka owned by Russian-born tycoon Yuri Shefler.",
    "Grain for Stoli is grown in Russia, but the vodka is distilled in Latvia.",
    "A spokesperson for Hy-Vee did not respond to requests for comment.",
    "Philip Joens covers breaking news for The Des Moines Register.",
    "But most vodkas are not made in Russia anymore, he said.",
    "Reynolds' order Monday.",
    "New York Gov.",
    "Texas Gov.",
    "Gov."
  ]
}