{
  "id": 13249,
  "mediaId": 3986,
  "date": "2022-03-05",
  "headline": "Ohio lawmakers pass ‘constitutional carry’ gun bill",
  "image": "https://americanmilitarynews.com/wp-content/uploads/Screen-Shot-2017-06-15-at-2.55.57-PM.png",
  "link": "https://americanmilitarynews.com/2022/03/ohio-lawmakers-pass-constitutional-carry-gun-bill/",
  "mediaOutlet": "americanmilitarynews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Gaines - Springfield News Sun",
  "authorUrl": "https://americanmilitarynews.com/author/jim-gaines-springfield-news-sun/",
  "termIds": [
    0
  ],
  "sentences": [
    "Under HB 324, unless a public health order prohibits it, hospitals would be required to allow in-person visits during a pandemic from “the patient’s family, caretakers or clergy,” plus lawyers and “other individuals providing care or companionship to the patient.”\nIf a public health order is in place prohibiting visitors, hospitals still couldn’t bar visitation if the patient’s condition becomes terminal.",
    "Gutting permitting requirements will put our communities, and the people whose job it is to keep us safe, in danger.”\nConcealed carry licenses will still be available for those who want them, state Sen. Terry Johnson, R-McDermott, the bill’s sponsor, has said.",
    "It would now also forbid a school district and a property owner from making a “private pay” agreement, in which the property owner pays the district not to challenge a valuation; but doesn’t prohibit a new valuation agreement if it’s reflected on the tax list.",
    "“It’s outrageous and frustrating that our lawmakers are ignoring law enforcement’s vocal opposition to permitless carry and continue to push through this dangerous bill,” Kristine Woodworth, a volunteer with Moms Demand Action in Ohio, said in a news release.",
    "Bills have been presented in former legislative sessions, but have not advanced.”\nOhio chapters of Moms Demand Action and Students Demand Action, part of Everytown for Gun Safety network, decried the bill when it headed for the House floor.",
    "The bill has three basic provisions: — A person at least 21 years old who is otherwise legally allowed to have a gun can carry it concealed without a permit, without having to take the now-required eight hours of gun safety training.",
    "Tax objections\nA bill to change the process for objecting to property tax valuations has passed both the House and Senate — but stalled Wednesday when the House unanimously refused to agree with amendments made in the Senate.",
    "Secretary of State Frank Rose, citing the rapidly approaching May 3 primary and still unsettled legislative district maps, called earlier this week for more funding to help county election boards meet their requirements.",
    "Republicans tabled Democratic attempts to add amendments moving the primary to June 21, and allowing election boards to work with nongovernment groups to recruit poll workers and provide voter information.",
    "Republicans shot down multiple amendments offered by Democrats — for a one-page brochure on current firearm laws, for universal background checks and temporary removal of guns from people in crisis.",
    "That would prevent school districts from challenging valuations on other properties, and schools could only file a response to an owner’s complaint if the school board passed a resolution to do so.",
    "Substitute House Bill 126, sponsored by state Rep. Derek Merrin, R-Monclova Twp., originally would have required school districts to pass a resolution before challenging a property tax valuation.",
    "Election funding\nAnother $9 million for Ohio’s 88 county boards of election moved quickly through the Ohio House and was agreed to by the Senate on Wednesday, attached to an unrelated bill.",
    "But it was changed in committee to prohibit anyone from filing a property tax complaint with a county Board of Revision, unless that person or entity owns the property in question.",
    "But those visits must be “conducted in such a way as to not endanger the health of hospital patients, staff or other individuals in the hospital facility,” the bill says.",
    "The Senate approved the amended bill in December, but county auditors and other public officials who had previously supported the bill came out against the new version.",
    "Under the bill, hospitals could require visitors to wear masks and take other “reasonable safety precautions,” such as requiring prior screening for symptoms.",
    "Medicaid for chiropractors\nA bill requiring Medicaid to cover initial evaluation and management services by chiropractors passed the Senate unanimously.",
    "Substitute Senate Bill 215 passed the House 57-35, and the Senate — which passed a version of the bill in December — concurred with House changes 24-8.",
    "Hospital visitation\n“Shirley and Wilma’s Law” unanimously passed the Ohio House, aiming to require hospitals to allow visitors during a pandemic.",
    "Marijuana for autism\nA bill adding autism spectrum disorders to the conditions for which medical marijuana is authorized passed the House 73-13.",
    "State Rep. Gary Click, R-Vickery, who cosponsored Substitute House Bill 324 with state Rep. Scott Lipps, R-Franklin, explained the bill’s name.",
    "Click, a pastor, said it’s named for two members of his church who died while not being allowed visitors during extensive COVID-19 precautions.",
    "The Buckeye Firearms Association, which had declared this “constitutional carry” bill as its top legislative priority, hailed its passage.",
    "Russian invasion\nBoth houses overwhelmingly passed separate resolutions condemning Russian President Vladimir Putin’s invasion of Ukraine.",
    "Substitute Senate Bill 9 originally focused on requiring state agencies to cut regulations — especially on businesses — by 30% by 2025.",
    "On Wednesday Merrin urged House members to vote against the amendments, which he said were “wholesale changes” to the bill’s intent.",
    "— If stopped by police, a person with a concealed weapon no longer has to tell officers about it unless they’re specifically asked.",
    "The bill would require hospitals to allow the same degree of access during a pandemic as during normal times, with some caveats.",
    "“This is the closest we’ve ever been to passing a bill to make the licensing process optional for concealed carry of a firearm.",
    "A bill to essentially eliminate the need for Ohioans to get concealed-carry handgun licenses has passed the General Assembly.",
    "The amended bill passed 59-33, and soon afterward the Senate agreed 27-5 to concur with the House amendments.",
    "House Bill 60 is cosponsored by state Reps. Juanita Brent, D-Cleveland, and Bill Seitz, R-Cincinnati.",
    "It also would have required the districts to notify the affected property owners of the challenge.",
    "“Law enforcement across our state agree — there is no reason to get rid of our permitting system.",
    "— Holders of a current concealed-carry permit no longer have to carry that license with them.",
    "Hospitals across Ohio have at times limited visitation to slow the spread of the coronavirus.",
    "They could limit the number of visitors to a patient at one time, but not down to one.",
    "A “more robust” bill expanding medical marijuana is in a House committee, Seitz said.",
    "“We are at a historic moment in Ohio legislative history,” the group announced.",
    "That’s still included, but now the bill also provides more election funding.",
    "That’s Senate Bill 261, sponsored by state Sen. Steve Huffman, R-Tipp City.",
    "House Bill 136, which already passed the House, was sponsored by Lipps.",
    "Seitz said 17 states have already legalized marijuana for autism.",
    "“This has been three years in the making,” Brent said.",
    "Mike DeWine to consider signing into law.",
    "His bill has already cleared the Senate.",
    "The bill now heads to Ohio Gov.",
    "___\n(c) 2022 the Journal-News"
  ]
}