{
  "id": 13408,
  "mediaId": 8497,
  "date": "2022-03-15",
  "headline": "Sheriff McGuffey: Signing of concealed carry bill 'not well thought out' for high population areas",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/sheriff-mcguffey-1647362062.jpg?crop=1.00xw:0.846xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/sheriff-mcguffey-says-signing-of-concealed-carry-bill-not-well-thought-out-for-high-population-areas/39438512",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Mike DeWine signed into law Monday a measure that will make a concealed weapons permit optional for anyone legally allowed to carry a gun and eliminate the requirement that individuals “promptly” notify police officers that they are carrying a concealed weapon, Hamilton County Sheriff Charmaine McGuffey said she thinks the signing is not well thought out for areas such as Hamilton County.",
    "The Ohio Democratic Party accused the governor of caving “to special interest groups and extremists,” saying the measure “will make all Ohioans less safe.”\nLast year, Ohio sheriffs issued 202,920 new or renewed conceal carry licenses, a 20% increase over 2020, the Ohio Attorney General’s Office said.",
    "\"To vote for people to be able to concealed carry without a license, without any training, without any documentation, makes it exponentially harder for law enforcement to prevent gun crimes,\" McGuffey said.",
    "Gun owners can still apply for a concealed weapons permit under the legislation, allowing those who obtain it to carry a concealed weapon in states with reciprocity agreements recognizing such permits.",
    "It was introduced by GOP state Sen. Terry Johnson of southern Ohio’s Scioto County, who said it eliminates a discrepancy in Ohio law that currently allows people to openly carry a gun.",
    "Sheriffs denied licenses to 2,668 applicants who didn’t meet state-mandated requirements and revoked 420 licenses for such things as felony convictions and mental incompetence.",
    "Gun control groups such as Moms Demand Action for Gun Sense in America opposed it, as did law enforcement groups concerned about the legislation’s lack of required training.",
    "This is something that needs to be considered when we allow untrained and unlicensed individuals to walk the streets of Hamilton County with concealed weapons.\"",
    "The measure, dubbed “Constitutional Carry” by its backers, is one of several GOP-backed proposals in recent years seeking to expand gun rights in Ohio.",
    "McGuffey said that poor decision making happens and those who are carrying a weapon can make bad decisions that can cause tremendous ramifications.",
    "That's why I have been a vocal opponent of this bill, and tried to educate the public on what this means for our community,\" McGuffey said.",
    "In encounters with police, the bill requires only that individuals confirm they are carrying a weapon if asked by an officer.",
    "The Buckeye Firearms Association said 21 other states allow people to carry a concealed weapon without a license.",
    "In a high-stress situation, my accuracy or that of any trained officer will go down by about 40%.",
    "\"I have many, many years of firearm training and I am usually at 90% accuracy.",
    "\"People in the general public may not understand how poorly most people shoot.",
    "HAMILTON COUNTY, Ohio —\nAfter Republican Gov."
  ]
}