{
  "id": 13422,
  "mediaId": 8480,
  "date": "2022-03-18",
  "headline": "Montgomery Co. election officials discuss May primary after redistricting maps struck down",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2018/04/9a2fd265f0294e38954db64dc1b7d2e0_36811916_ver1.0.jpg?w=1280",
  "link": "https://www.wdtn.com/news/your-local-election-hq/montgomery-co-election-officials-discuss-may-primary-after-redistricting-maps-struck-down/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Riley Phillips",
  "authorUrl": "https://www.wdtn.com/author/riley-phillips/",
  "termIds": [
    2143,
    1710,
    2202,
    1608,
    1489,
    6104,
    6407
  ],
  "sentences": [
    "And even looking at statewide candidates for Senate, for governor and all these different offices, they burn a lot of money in a given day,” Lee Hannah, associate professor of political science at Wright State University, said.",
    "DAYTON, Ohio (WDTN) – In a letter to Governor Mike DeWine on Thursday, Secretary of State Frank LaRose expressed his concerns about the upcoming primary election.",
    "“There may be adjustments to the ballot, but our operation is continuing to move forward and be well prepared for the May 3rd election,” Rezabek said.",
    "“It may cause a second election or it may cause the state legislature to move the entire election, but at this point that is out of our hands.",
    "He said election officials across the state do not have enough time to complete the work needed to get their counties ready for the election.",
    "Jeff Rezabek, director of the Montgomery County Board of Elections, said right now, he is still planning for the primary on May 3, 2022.",
    "And so what we’re doing as well as boards of elections around the state is we’re preparing for the May 3rd election,” Rezabek said.",
    "Rezabek said these delays impacted ballot preparations as they had to wait to make sure the right races were on the ballots.",
    "In the letter, LaRose said the May 3 primary could no longer include state House and Senate races.",
    "In the meantime, there are several things people can be doing to prepare for the election.",
    "This comes after the Ohio Supreme Court struck down redistricting maps for a third time.",
    "Still, Rezabek said he and his team are continuing to work towards the May 3 date.",
    "If you would like to help out on Election Day, poll workers are needed.",
    "“There are candidates that don’t know their lines yet.",
    "So they don’t know where they need be campaigning.",
    "The deadline to register to vote is April 4, 2022.",
    "Voters should also double check their precincts.",
    "These delays are also affecting the candidates.",
    "For more information, click here."
  ]
}