{
  "id": 13425,
  "mediaId": 8480,
  "date": "2022-03-17",
  "headline": "Ohio holds summit to prepare for Ukrainian refugees",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/snapshot-32-2.jpg?w=1280",
  "link": "https://www.wdtn.com/news/ukraine-russia-tensions/ohio-holds-summit-to-prepare-for-ukrainian-refugees/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allison Gens",
  "authorUrl": "https://www.wdtn.com/author/allison-gens/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Sometimes we only receive one to two weeks notice before we have a refugee family arrive, so there is much to prepare for before we pick them up at the airport,” Heath Rosenberger with Cleveland Catholic Charities said.",
    "“We are a welcoming state, we are a welcoming people, we’re a nation of immigrants, we are a state that was built by immigrants.”\nRefugee services are funded through the federal government and run by nonprofits.",
    "The Ohio Department of Job and Family Services helps refugees reach self-sufficiency, including medical screening, monetary assistance, mentoring, and employment programs.",
    "Ohio has a history of helping refugees and a significant Ukrainian population in Ohio, which is what the federal government looks for when placing refugees.",
    "PARMA, Ohio (WDTN) – State leaders and Ohio nonprofits met Thursday to discuss what Ohio will need if Ukrainian refugees are placed here.",
    "Mike DeWine said Ohio does not know how many refugees will be coming here at this point, but the state needs to be prepared.",
    "Some of these nonprofits said the challenges they face include affordable housing and access to education for refugees.",
    "In Ohio, there are nine refugee resettlement agencies, including the Catholic Social Services of the Miami Valley.",
    "The Ohio Summit on Ukrainian Refugees gathered in Parma, Ohio which has the state’s largest Ukrainian population.",
    "Resettlement agencies are often faith-based organizations, charities and nonprofits that support refugees.",
    "At the beginning of the year, agencies notify the state how many refugees they have the capacity for.",
    "“Ohio welcomes and will welcome any refugees who come from Ukraine,” DeWine said.",
    "Gov."
  ]
}