{
  "id": 1343,
  "mediaId": 2919,
  "date": "2022-02-11",
  "headline": "Gov. DeWine wages assortment of Cincinnati food in Super Bowl wager with California governor",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/5167569/2147483647/strip/true/crop/1920x1008+0+36/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2Ffe%2F11%2Fdcacf0eb48469a2b0ce051aece6c%2Funtitled-design-2022-01-30t213731.068.png",
  "link": "https://www.news5cleveland.com/sports/gov-dewine-wages-assortment-of-cincinnati-food-in-super-bowl-wager-with-california-governor",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kaylyn Hlavaty",
  "authorUrl": "https://www.news5cleveland.com/kaylyn-hlavaty",
  "termIds": [
    2143,
    731,
    275,
    6060,
    6026,
    6474
  ],
  "sentences": [
    "DeWine bet an assortment of Cincinnati food products including:\nSteaks and seasoning from Jeff Ruby’s\nRibs from Montgomery Inn\nGoetta and bratwurst from Queen City Sausage\nPotato chips from Grippo’s\nChocolates from Maverick Chocolate Company\nFirst Lady Fran DeWine will send her Bengals Buckeye Brownies if the wager is paid out.",
    "“This friendly bet highlights some of Cincinnati’s most iconic foods and restaurants that everyone across Ohio and across the U.S.A. should know about and enjoy!”\nNewsom has in turn wagered “some of California’s world-class agricultural offerings” for a Bengals win.",
    "Mike DeWine has placed a wager with California Governor Gavin Newsom ahead of Super Bowl LVI on Sunday, featuring the Cincinnati Bengals and the Los Angeles Rams.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "“Fran and I are so excited by the Bengals’ thrilling playoff run and Super Bowl appearance,” said DeWine.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "CLEVELAND — It’s not a Super Bowl without a friendly wager, and Ohio Gov.",
    "Download now on your Apple device here, and your Android device here.",
    "Each governor placed some of their state’s food items as the wager.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "Gov."
  ]
}