{
  "id": 13450,
  "mediaId": 8323,
  "date": "2022-03-15",
  "headline": "Cleveland officials, religious leaders remember lives lost during COVID pandemic",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/03/download-14.png?w=1280",
  "link": "https://fox8.com/news/watch-live-cleveland-officials-survivors-reflect-on-lives-lost-during-covid-pandemic/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melissa Reid",
  "authorUrl": "https://fox8.com/author/melissareidfox8news/",
  "termIds": [
    3786,
    6067
  ],
  "sentences": [
    "Cleveland Mayor Justin Bibb and Cuyahoga County Executive Armond Budish, along with local faith leaders, gathered Tuesday night at Cleveland Music Hall to remember all those who have died from COVID-19.",
    "At the same time, downtown buildings, bridges and surrounding neighborhoods were lit with amber lights to represent the city’s comeback and remember those who lost their lives because of the virus.",
    "Also Tuesday, the Cleveland Department of Public Health announced they teamed up with GOJO and the NBA to provide sanitizer, masks and COVID test kits to community organizations.",
    "Social workers, teachers and so many others that risked their lives to help and protect people they didn’t even know,” said Budish.",
    "As COVID cases continue to drop in the state, the Ohio Department of Health recently decided to stop posting daily COVID reports.",
    "Each agency will each get 150 test kits and 150 bottles of hand sanitizer for community distribution.",
    "Since the pandemic began, the state of Ohio has lost more than 37,000 lives due to COVID-19.",
    "CLEVELAND (WJW) – Tuesday was a day of remembrance and resilience in the City of Cleveland.",
    "“We’ve lost mothers, fathers, teachers, nurses, brothers and sisters,” said Bibb.",
    "Mike DeWine announced the first confirmed cases of COVID-19 in the state.",
    "“They are first responders, doctors and nurses.",
    "The service also celebrated COVID survivors.",
    "They also honored those on the front lines.",
    "Last week marked two years since Ohio Gov."
  ]
}