{
  "id": 13499,
  "mediaId": 8491,
  "date": "2022-03-20",
  "headline": "Local organization helps Ukrainian refugees",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/03/ukrainian-refugees-youngstown.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/local-organization-helps-ukrainian-refugees/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Desirae Gostlin",
  "authorUrl": "https://www.wkbn.com/author/desirae-gostlin/",
  "termIds": [
    4978,
    1420,
    6075,
    6067,
    6076,
    6569,
    6672
  ],
  "sentences": [
    "“We have a huge Ukrainian population in our state and we have a lot of Ukrainian-specific organizations already in place, specifically in Northeast Ohio,” said Chaney Nezbeth with The Way Station.",
    "It’s unclear when more refugees might start arriving to the area, but advocates believe if the war in Ukraine continues, more refugees could start to arrive in as little as three weeks.",
    "Though more than 3 million refugees have escaped to other countries, but the United Nations estimates another 6.5 million have left their homes but are stuck in Ukraine.",
    "COLUMBIANA, Ohio (WKBN) — As the humanitarian crisis continues in Ukraine, the United Nations estimates 10 million people have fled their homes since Russia invaded.",
    "A family of three would get $3,000, but with inflation and the rising cost of goods from shortages, that money is not expected to last long.",
    "Organizations like The Way Station can help connect refugees to jobs and other resources and refugees are protected under the law.",
    "On Thursday, Governor Mike DeWine held a summit near Cleveland to connect with organizations about how they can help refugees.",
    "Chaney Nezbeth is the executive director of The Way Station — a faith-based community resource in Columbiana County.",
    "When they are declared a refugee they have the right to stay as long as they need and to work,” Nezbeth said.",
    "They want to be able to go back home, but it’s not going to be the case for everyone,” Nezbeth said.",
    "Most of the refugees are women and children as men 18-60 are subject to a draft in Ukraine.",
    "“They have to have the refugee status but from day one they have legal residency status.",
    "“With rent, utilities — but we all know that is not going to be enough,” Nezbeth said.",
    "“We are already helping people in need who have nothing,” Nezbeth said.",
    "Eligibility to work does not expire so it’s not like a tourist visa.",
    "Nezbeth said that every Ukrainian refugee gets $1,000 dollars.",
    "“They want to stay in their own country.",
    "One of those organizations is local."
  ]
}