{
  "id": 13536,
  "mediaId": 8379,
  "date": "2022-03-21",
  "headline": "Ukrainian disaster expert sees war’s effects in Ohio",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/03/gleb-tsipursky.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/ukrainian-disaster-expert-sees-wars-effects-in-ohio/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cynthia Rosi",
  "authorUrl": "https://www.nbc4i.com/author/cynthia-rosi/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I am devastated thinking about what they are going through right now with the shelling and the bombing, and I have no idea if they are alive or dead.”\nAs a disaster management expert, Tsipursky feels more could have been done by Ukraine and the West to prepare for Russian President Vladimir Putin’s aggression toward Ukraine.",
    "Ohio prepares for Ukrainian refugees\nAt the Ohio Summit on Ukrainian Refugees, 110 people attended, representing at least 60 organizations including resettlement agencies, faith-based organizations, charities, and others with an interest in the well-being of Ukrainians, the governor’s office said in a media release.",
    "“And so people who are in the local community in Columbus, central Ohio, are sometimes even hiding the fact they are Russian — they don’t want to talk about it because it just feels so bad.”\nSome Russians have burned their Russian passports because of these feelings, so deep is their shame, he said.",
    "Many were resettled due to the Lautenberg Amendment, a federal program established in 1990 that allows religious minorities from the former Soviet Union to seek refuge in the United States, according to the governor’s office.",
    "“The thing is people have not really managed it — when you look at the risk management aspects of it, there could have been so much more done to prepare and anticipate for this situation,” Tsipursky said.",
    "The day ended with a networking session that allowed community organizations to ask questions and exchange ideas with others wanting to help displaced people, the release said.",
    "“Just in terms of how much resources you would need to hold a country like that.”\nHe points out that Ukraine is doing better than expected, and Russia is faring worse.",
    "“There could have been infrastructure built; there could have been anticipation that Putin would be aggressive.”\nHe believes Ukraine will ultimately win the war.",
    "He built a life in central Ohio, first as a professor at Ohio State University from 2011 to 2018, and now running his company Disaster Avoidance Experts.",
    "COLUMBUS, Ohio (WCMH) — The story of Gleb Tsipursky, a Ukrainian disaster-management expert in Columbus, has become all too familiar for that community.",
    "“The people who have the financial resources and the skills and the where-with-all to come here are going to be the best of the best.”\nOn Thursday, Gov.",
    "They heard presentations from federal and state officials, as well as panel discussions regarding the resettlement process, and the refugee experience.",
    "In addition, Ukraine has a population of about 40 million, which means you would need at least one soldier per 100 citizens, Tsipursky pointed out.",
    "Mike DeWine opened the Ohio Summit on Ukrainian Refugees in northeast Ohio to prepare for Ukrainians who might want to travel to Ohio.",
    "That’s because the refugees that would come to the US would be people of means, who could also fill the labor shortage.",
    "He has family in Kyiv who are being bombed by Russian rockets and doesn’t know whether they are alive or dead.",
    "“People who are Ukrainian like me are outraged of course; people who are Russian are feeling really ashamed.",
    "Tsipursky is softly spoken and came to the United States at age 10 as the former Soviet Union fell in 1991.",
    "“I know a lot of people who are Ukrainian, and I know a lot of people who are Russian,” Tsipursky said.",
    "“It didn’t have to be so sudden, so drastic, that we have to drop everything and support Ukrainians.",
    "As a person who has Russian and Ukrainian friends, Tsipursky sees two effects of the war.",
    "Keeping 400,000 Russian soldiers permanently in Ukraine is not something Russia can do.",
    "The only relaxation for Ukrainians in the U.S. is that they don’t have to go back home.",
    "Since 2018, more than 500 Ukrainians have been resettled in Ohio, mostly in Cleveland.",
    "“I have family in Kyiv, and I don’t know what’s happening to them,” Tsipursky said.",
    "“I’m very confident Russia won’t be able to absorb Ukraine,” Tsipursky said.",
    "Others are watching the news in Ukrainian, abandoning the Russian channels.",
    "“At best, [Russia] will seize the eastern part of Ukraine,” he predicted.",
    "Welcoming Ukrainian refugees would be a boost for Ohio, Tsipursky said.",
    "But they need visas in order to get here, Tsipursky said.",
    "“You’ll have a filtering effect,” Tsipursky said."
  ]
}