{
  "id": 13612,
  "mediaId": 8313,
  "date": "2022-03-15",
  "headline": "A look back at Ohio's major gun policy changes",
  "image": "https://www.gannett-cdn.com/presto/2021/02/15/NCOD/76518042-04b6-4867-acf2-50e7592d6db8-Dayton.JPG?crop=4283,2410,x0,y217&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/03/15/when-can-ohioans-carry-concealed-weapons-without-permit/7047139001/",
  "mediaOutlet": "enquirer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura A. Bischoff",
  "authorUrl": "https://www.dispatch.com/staff/7138143002/laura-a-bischoff/",
  "termIds": [
    2143,
    875,
    6474,
    6104
  ],
  "sentences": [
    "Laura Bischoff is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Ohio's new law allowing adults to carry concealed firearms without training classes or background checks goes into effect June 12 – marking a major change to gun policy in the Buckeye state.",
    "2022: DeWine signs a bill to eliminate the need for Ohioans to take an eight hour training course and have a background check to obtain a permit to carry a concealed weapon.",
    "2021: DeWine signs a \"Stand Your Ground\" bill into law, allowing Ohioans to use deadly force in self-defense in public places without first trying to retreat.",
    "It eliminates semi-automatic weapons that fire 31 or more cartridges without re-loading from the list of highly regulated dangerous ordnances.",
    "2016: Ohio allows CCW permit holders to carry guns on college campuses, in day care centers, in parts of airports and other places.",
    "2014: Ohio reduces CCW required training hours to eight from 12 and expands reciprocity of CCW permits with other states.",
    "2011: Ohio allows CCW permit holders to carry guns into bars, restaurants, shopping malls, museums and other places.",
    "Here’s a look at other major changes to Ohio’s gun laws over the years:\n1859: Ohio bans carrying concealed weapons.",
    "2018: Ohio changes the self-defense law to shift the burden of proof to the prosecution, instead of the accused.",
    "2006: Lawmakers expand the CCW program and preempt local jurisdictions from having their own firearms laws.",
    "It bans property owners from barring CCW permit holders from keeping their firearms in their vehicles.",
    "Mike DeWine advocates a 17-point plan for gun restrictions and increased mental health services.",
    "The NRA praises it as the most sweeping gun rights bill adopted in any state in 10 years.",
    "2012: Ohio allows gun owners to keep firearms in the vehicles in parking facilities.",
    "Gun rights groups have pushed for a permitless carry law for more than 20 years.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "2008: Ohio expands the right to use deadly force to defend a home or vehicle.",
    "2004: Ohio enacts its first concealed carry weapons permitting system.",
    "It aligned Ohio law with laws in 49 other states.",
    "2019: Following a mass shooting in Dayton, Gov.",
    "Why his gun record leaves him open to attack.",
    "Mike DeWine signed permitless carry.",
    "More:Ohio Gov."
  ]
}