{
  "id": 1362,
  "mediaId": 8495,
  "date": "2022-02-11",
  "headline": "Fans Don’t Let Fans Drive Drunk",
  "image": "https://wktn.com/wp-content/uploads/2020/11/Ohio-State-Highway-Patrol-OSP-OHSP.jpg",
  "link": "https://wktn.com/fans-dont-let-fans-drive-drunk-2",
  "mediaOutlet": "WKTN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Making the right decision to plan ahead and designate a sober driver protects you and those around you from the devastating consequences of impaired driving.”\nThe public is encouraged to use #677 to report impaired drivers and drug activity.",
    "“I encourage everyone who is cheering on the Bengals on Sunday to celebrate responsibly and designate a sober driver.”\nDuring last year’s Super Bowl, the Patrol made 59 OVI arrests from 6 a.m. Sunday to 6 a.m. Monday.",
    "Because this year’s game will include the Cincinnati Bengals, many festivities are expected in Ohio, and the Ohio State Highway Patrol urges fans to refrain from driving while impaired.",
    "Make designating a sober driver your game plan this Super Bowl Sunday\nCOLUMBUS – Super Bowl Sunday is one of America’s highest-profile and most entertaining sporting events.",
    "“As Ohioans gather to watch the game, the Patrol will be working to remove impaired drivers from our roads,” said Colonel Richard S. Fambro, Patrol superintendent.",
    "If you host a Super Bowl party, make sure your guests have a safe and sober way home, and do not serve alcohol to anyone under 21 years of age.",
    "“The Cincinnati Bengals have given many Ohioans an extra reason to celebrate the Super Bowl this year,” said Governor Mike DeWine.",
    "To help keep the roads safe this Super Bowl Sunday, troopers will be cracking down on impaired drivers.",
    "You can also help others make good choices by reminding them that Fans Don’t Let Fans Drive Drunk.",
    "During the 24-hour reporting period, there were two fatal crashes killing two people.",
    "Also, there were 178 injuries, in which 35 were OVI related.",
    "If you plan on consuming alcohol, don’t drive.",
    "Plan ahead and designate a sober driver."
  ]
}