{
  "id": 13626,
  "mediaId": 8413,
  "date": "2022-03-19",
  "headline": "Local CCW instructor reacts to Ohio's new gun law allowing 'permitless carry'",
  "image": "https://www.gannett-cdn.com/presto/2022/03/18/PFRE/73aa6d3b-19fb-4584-91b9-449ad29ea670-IMG_0364.jpg?crop=3077,1731,x0,y283&width=3077&height=1731&format=pjpg&auto=webp",
  "link": "https://www.thenews-messenger.com/story/news/2022/03/19/ccw-instructor-believes-course-still-has-benefits-safety-practice/7059245001/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Stinchcomb",
  "authorUrl": "https://www.thenews-messenger.com/staff/4395603002/jon-stinchcomb/",
  "termIds": [
    2143,
    3511,
    6179,
    6474
  ],
  "sentences": [
    "Reciprocity agreements\nOhio also established reciprocity agreements with other states to have its permit recognized, such as Indiana, where constitutional carry has not yet been passed, meaning Ohio residents seeking to legally carry a concealed weapon there would still have to obtain a permit.",
    "The association has long been a proponent for \"constitutional carry\" across several states, noting Ohio’s new law does not eliminate the state’s permitting system and people who want a permit for \"reciprocity reasons\" will still be able to purchase a concealed handgun permit here.",
    "GIBSONBURG — While Ohioans soon will no longer be required to take an eight-hour training course before legally carrying a concealed firearm, one local instructor believes they may still find benefit from all that is covered over that time.",
    "\"'Constitutional carry' is the most popular pro-gun legislation in the country, with multiple state legislatures poised to pass it into law in 2022,\" said Dudley Brown, president of the National Association for Gun Rights.",
    "\"I know there’s a lot of stats out there with other states that crime has been reduced, but I really don’t think there will be much changed (after the new law goes into effect),\" he said.",
    "\"Mike DeWine is so scared of a primary challenge from his fellow Republicans, he’s willing to put Ohioans’ lives on the line,\" said Matt Keyes, spokesperson for the Ohio Democratic Party.",
    "Though an officer can still ask, and if a person is found to be lying about carrying a weapon, the person could be charged with a misdemeanor-level offense for doing so.",
    "The prior Ohio law required the eight-hour course taught by a state-certified instructor, which Karr is one of several around the area, which also included live-fire.",
    "Constitutional carry backed in other states\nKentucky and West Virginia already have passed what advocates for the new law often referred to as \"constitutional carry.\"",
    "\"It’s despicable to watch DeWine sell out law enforcement officers and Ohio families all to try and hold on in a Republican primary in which most voters oppose him.\"",
    "Mike DeWine signed Senate Bill 215 into law, which allows people 21 or older to carry a concealed gun without a permit if they are legally allowed to own the gun.",
    "In those eight hours, Karr and the attendees go into detail about gun safety, proper shooting practice, grip, stance, and even things to look out for.",
    "He added he does think it will increase the number of people carrying, but primarily among those who were on the fence about whether to do so.",
    "Additionally, the new law going into effect eliminates the requirement people inform a police officer if they are carrying a weapon.",
    "Existing restrictions on carrying guns in certain places, such as courthouses and school campuses, still remain in place, however.",
    "\"I don’t think it’s going to be an increased risk for law enforcement,\" said Karr, who works as a full-time officer himself.",
    "\"It’s still beneficial,\" said Don Karr, assistant chief of police in Gibsonburg and a certified concealed carry instructor.",
    "\"The people who are doing the bad things, who are carrying when they’re not supposed to, are going to continue to do so.",
    "Some restrictions will remain in place\nThe law is set to change 90 days from this past Monday, which is when Gov.",
    "Similar to Karr, Brown stressed the same point about law-abiding citizens and added they wanted this law in Ohio.",
    "\"My classes, in general, cover a lot more than just the laws and CCW (carrying a concealed weapon).\"",
    "Before obtaining the previously necessary permit, people also needed to pass a background check.",
    "The people who are committing crimes obviously don’t care what the law is.\"",
    "Indiana legislators are considering passing a law that would follow suit.",
    "But he does not believe they will present more of a problem, if any.",
    "\"We go over how to do it the right way,” he said.",
    "The law did not come without strong opposition.",
    "“So it’s still beneficial to anybody.",
    "jstinchcom@gannett.com\n419-680-4897",
    "It’s just not required.\""
  ]
}