{
  "id": 13645,
  "mediaId": 8288,
  "date": "2022-03-16",
  "headline": "A Year Later, American Rescue Plan Dollars Foster Learning in Ohio",
  "image": "",
  "link": "https://www.clevescene.com/cleveland/a-year-later-american-rescue-plan-dollars-foster-learning-in-ohio/Content?oid=38559858",
  "mediaOutlet": "clevescene.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Kuhlman",
  "authorUrl": "https://www.clevescene.com/author/mary-kuhlman-ohio-news-service",
  "termIds": [
    0
  ],
  "sentences": [
    "Ohio's Rescue Plan dollars supported the academic, social and emotional needs of students and educators, as well as resources and connectivity for remote and hybrid learning.",
    "It's been two years now since COVID-19 disrupted the education system and exactly one year since the American Rescue Plan infused $4.4 billion into Ohio school districts.",
    "\"And it was a difficult transition for some families to switch their kids to remote learning, even though that was the safest, and it was what those parents wanted.\"",
    "\"And some of these things were changes that were made that will continue even after we catch the kids up academically, so that they are in a healthier environment.\"",
    "Sellers added the move to virtual learning was also a challenge for teachers and schools, and they scrambled to ensure each student had computer access at home.",
    "Sellers believes the funding was especially important for districts in communities where the pandemic's impact was exacerbated due to long-standing inequities.",
    "Cincinnati Public Schools received about $208 million, spent on hiring reading and math specialists and school counselors, and on summer learning programs.",
    "Julie Sellers, president of the Cincinnati Federation of Teachers, said the money also made buildings safer, with better ventilation systems.",
    "Mike DeWine recently announced funding from the American Rescue Plan will also be used to help expand school-based health-care clinics.",
    "\"That funding was probably the most important thing I think that the government did in order to help districts,\" Sellers contended.",
    "Federal funds provided one-on-one devices, which she believes are teaching skills children will use throughout their school years.",
    "Some Rescue Plan funds have been used to ensure children have access to healthy meals at home they would have received at school.",
    "\"Most of the urban areas, the spread was so great it was really unsafe for kids to be in the building,\" Sellers recounted.",
    "By January of this year, 95% of public K-12 schools were in-person full-time, compared to 46% in January 2021.",
    "And we believe everyone deserves access to accurate independent coverage of their community and state.",
    "\"And that would have never happened if we weren't forced to go to some of that remote learning.",
    "Help us keep this coverage going with a one-time donation or an ongoing membership pledge.",
    "American Rescue Plan funds were also used for COVID-19 vaccines for school staff.",
    "\"The stuff that my kids know on technology now, it's amazing,\" Sellers remarked.",
    "But now there's more technology integrated, even into the in-person learning.\"",
    "Join the Cleveland Scene Press Club\nLocal journalism is information.",
    "And the state continues to benefit.",
    "Information is power.",
    "Gov."
  ]
}