{
  "id": 13696,
  "mediaId": 8494,
  "date": "2022-03-18",
  "headline": "Morning Headlines: May 3 ballot won't include House, Senate races; GOP governor debate off after DeWine, rival drop out",
  "image": "https://npr.brightspotcdn.com/dims4/default/4271ac2/2147483647/strip/true/crop/4096x2150+0+5/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4a%2F1c%2Fdec548d34c1787005593527b34c8%2Fshutterstock-1743370412.jpg",
  "link": "https://www.wksu.org/2022-03-18/morning-headlines-may-3-ballot-wont-include-house-senate-races-gop-governor-debate-off-after-dewine-rival-drop-out",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Friday, March 18:\nMay 3 ballot won't include House, Senate races\nGOP governor debate off after DeWine, rival drop out\nRetired Ohio teachers will get cost-of-living raises again\nChipmaker Intel details $150 million education investment\nRock Hall of Fame to Dolly: Voters will decide if you're in\nAP source: Mayfield requests trade after Browns chase Watson\nMay 3 ballot won't include House, Senate races\n(Statehouse News Bureau) -- Ohio’s top elections official says he’s determined a full primary will not happen on May 3.",
    "Rock Hall of Fame to Dolly: Voters will decide if you're in\n(AP) -- Dolly Parton is still on the list of this year’s nominations for the Rock & Roll Hall of Fame despite the country icon asking to be removed because she hasn’t “earned that right.” The Rock & Roll Hall of Fame Foundation said in a statement Thursday that, in effect, it is up to the voters to decide if Parton is elected.",
    "Retired Ohio teachers will get cost-of-living raises again\n(Statehouse News Bureau) -- More than 150,000 retired Ohio teachers are learning some good news – that they’ll see a cost of living adjustment, or COLA, in their pension checks for the first time in years starting for some in July.",
    "The update follows the company's January announcement that it's investing $20 billion to build a factory in central Ohio in an attempt to help alleviate a global shortage of chips that power everything from phones to cars to home appliances.",
    "AP source: Mayfield requests trade after Browns chase Watson\n(AP) -- Baker Mayfield reportedly has requested the Cleveland Browns trade him after the team failed in its pursuit of quarterback Deshaun Watson.",
    "Chipmaker Intel details $150 million education investment\n(AP) — Chipmaker Intel has revealed new details about a $150 million investment in semiconductor research in Ohio and nationally.",
    "But LaRose, DeWine, Senate President Matt Huffman, and House Speaker Bob Cupp are all Republicans on the Ohio Redistricting Commission and voted for the maps that have been tossed out.",
    "A former SEC lawyer hired by teachers determined STRS wasn’t transparent and had squandered money, but STRS maintained it had appropriate oversight and was committed to transparency.",
    "Mayfield was upset by the team's public overtures toward Watson, and now appears his relationship with the Browns is ending just 15 months since leading the team to the playoffs.",
    "LaRose’s letter blames what he calls “a cascading series of delays beyond our control,” such as late census data, opponent lawsuit, and out-of-state special interests.",
    "Intel said the U.S. National Science Foundation will provide a matching $50 million to advance research on semiconductor design and manufacturing across the country.",
    "DeWine's campaign manager has said voters already know DeWine well because he meets with constituents daily and regularly fields questions from the media.",
    "Parton went on social media on Monday to “respectfully bow out” of the process, saying she did not want to take votes away from the remaining nominees.",
    "While LaRose says the legislature must come up with a new date for the legislative races, the other statewide races will go forward on May 3.",
    "GOP governor debate off after DeWine, rival drop out\n(AP) — A debate among Republican candidates for governor in Ohio has been canceled.",
    "Mike DeWine that because of the court’s rejection of the House and Senate maps, those races can’t appear on the May 3 primary ballot.",
    "STRS board chair Robert McFee introduced the resolution, which also includes the elimination of the minimum retirement age of 60.",
    "The cost of living adjustment or COLA was reduced in 2013 and suspended in 2017, even as other pension systems continued theirs.",
    "Mayfield asked to be traded through his agent shortly after the Browns were told by Watson that he wasn’t coming to Cleveland.",
    "The company said Thursday it's investing $50 million each in Ohio and national semiconductor education initiatives.",
    "The board of the State Teachers Retirement System approved a one-time 3% cost of living increase beginning in July.",
    "Secretary of State Frank LaRose has notified the Republican and Democratic leaders of the House and Senate and Gov.",
    "But teacher contributions to the fund weren’t reduced, and another benefit review will happen next spring.",
    "A third GOP gubernatorial candidate, former state Rep. Ron Hood, never returned organizers’ phone calls.",
    "Mike DeWine declined to participate and former U.S. Rep. Jim Renacci decided to follow suit.",
    "The nonpartisan Ohio Debate Commission event had been scheduled for March 29.",
    "That would have left central Ohio farmer Joe Blystone alone on the stage.",
    "The state auditor’s office is also still working on a review of STRS.",
    "Parton had no immediate comment on the hall’s decision.",
    "The team told Mayfield they aren't trading him.",
    "That's after GOP Gov."
  ]
}