{
  "id": 1380,
  "mediaId": 8278,
  "date": "2022-02-17",
  "headline": "DiRusso’s Sausage Gets $250K State Grant to Boost Capacity",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/02/dirusso-sausage.jpg",
  "link": "https://businessjournaldaily.com/dirussos-sausage-gets-250k-state-grant-to-boost-capacity/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Guy D'Astolfo",
  "authorUrl": "https://businessjournaldaily.com/author/dastolfobusiness-journal-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "“By awarding this money, we can help these Ohio businesses enhance their operations to strengthen the local meat supply chain and reduce reliance on out-of-state processors.”\nEach company will receive a grant of up to $250,000, with half of the funds disbursed before projects are started and the other half awarded after the companies show that the initial funds were spent on eligible costs.",
    "Grant funding will be used to implement processing efficiencies, expand or construct facilities at existing sites, assist in training and certification, and improve harvest services, according to a news release from the state.",
    "“We’re also buying a variety of equipment to increase efficiencies and also some refrigeration and freezer equipment.”\nHusted said the grants will benefit Ohio consumers, help sustain the companies and increase employment.",
    "The DeWine-Husted administration prioritized the creation of the Ohio Meat Processing Grant Program in the state’s 2022-2023 operating budget, which was passed last year.",
    "“We will buy a new patty forming machine that will allow us to increase capacity on sausage patties and also make new items if needed,” said Robert DiRusso, president.",
    "“The supply chain issues that our country is facing have put increased pressure on our meat processors, and they can’t keep up with the demand,” DeWine said.",
    "COLUMBUS, Ohio — DiRusso’s Sausage Inc. of Youngstown has received a $250,000 state grant to help it expand its production capacity.",
    "“In addition to new jobs, this funding will help businesses retain 300 jobs and nearly $30 million in payroll,” he said.",
    "C&J Meats of the Homeworth area in Columbiana County is the only other Mahoning Valley company to receive a grant.",
    "In total, the businesses receiving awards have estimated that the funds will help them create up to 830 jobs.",
    "The program generated tremendous interest from the meat processing industry, the news release stated.",
    "The grant program is designed to help meet the growing demand for meat processing services.",
    "Jon Husted, will distribute a total of $10 million to 40 meat and poultry processers.",
    "Grants were awarded on a first-come, first-served basis to eligible businesses.",
    "A total of 143 applications requesting more than $28 million were submitted.",
    "DiRusso’s will use the money to purchase several pieces of equipment.",
    "Copyright 2022 The Business Journal, Youngstown, Ohio.",
    "The grant recipients, announced today by Gov.",
    "It also received $250,000.",
    "Mike DeWine and Lt. Gov."
  ]
}