{
  "id": 13819,
  "mediaId": 8494,
  "date": "2022-03-19",
  "headline": "Some Ohio Republicans raise talk about impeaching Chief Justice over redistricting decisions",
  "image": "https://npr.brightspotcdn.com/dims4/default/66ca493/2147483647/strip/true/crop/2999x1575+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Flegacy%2Fsites%2Fwcpn2%2Ffiles%2F201909%2Fo_connor_state_of_the_judiciary_2019_-_credit_liesl_bonneau.jpg",
  "link": "https://www.wksu.org/government-politics/2022-03-19/some-ohio-republicans-raise-talk-about-impeaching-chief-justice-over-redistricting-decisions",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "While some Republicans have been sharing this idea quietly, Rep. Scott Wiggam tweeted out, “It’s time to impeach Maureen O’Connor now.”\nRepublican state Rep Scott Wiggam tweeting out what others are saying quietly regarding the Ohio Supreme Court’s Republican Chief Justice, who’s sided w the three Democratic justices in the redistricting cases pic.twitter.com/HsDziI9wSE\n— Karen Kasler (@karenkasler) March 18, 2022\nBut Gov.",
    "Democratic Justice Jennifer Brunner is running to replace O’Connor and will face Republican Justice Sharon Kennedy, who’s written some sharply worded dissents and criticized O’Connor directly last month for asking the Redistricting Commission members to explain why they shouldn’t be held in contempt, saying the chief justice didn’t have that authority.",
    "Some Ohio Republicans are floating the idea of impeaching Chief Justice Maureen O’Connor, who has sided with the Ohio Supreme Court’s three Democrats in ruling all the maps produced by the GOP dominated Redistricting Commission are unconstitutionally gerrymandered.",
    "“I don’t think we want to go down that pathway because we disagree with a decision by a court, because we disagree with a decision by an individual judge or justice,” DeWine said.",
    "Both Pfeifer and O’Neill said there’s always tension among the justices, but O’Connor’s decision to side with the three Democrats over redistricting isn’t related to that.",
    "“I'm embarrassed for the people of Ohio that anybody would suggest that you put the word impeachment and chief justice in the same sentence.\"",
    "Bob Taft’s lieutenant governor, has been chief justice for 20 years and can’t run for re-election because of Ohio’s age limit on justices.",
    "Republican former Justice Paul Pfeifer says lawmakers have raised impeachment in anger over Supreme Court decisions in the past.",
    "Mike DeWine, who’s voted for every map that O’Connor and the three Democratic justices have ruled unconstitutional, is opposed.",
    "Bill O’Neill was the lone Democratic justice on the court for years and said he voted most often with Maureen O’Connor.",
    "But two former Ohio Supreme Court justices said the calls to impeach O’Connor are rare and not serious.",
    "\"A lot of legislators are furious with the chief justice, make no mistake about that.",
    "But there won't be any follow through with any chatter about impeachment.",
    "To see more, visit The Statehouse News Bureau.",
    "She's being reasonable now,” O’Neill said.",
    "Copyright 2022 The Statehouse News Bureau.",
    "That just won't happen,” Pfeifer said.",
    "\"She was reasonable then.",
    "O’Connor, who was Gov."
  ]
}