{
  "id": 13829,
  "mediaId": 8379,
  "date": "2022-03-16",
  "headline": "DeWine: Crime one reason for permitless carry law",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2019/09/concealed-carry-gun-weapon-ccw.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/state-news/dewine-crime-other-states-reason-for-permitless-carry-law/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Herchik",
  "authorUrl": "https://www.nbc4i.com/author/matthew-herchik/",
  "termIds": [
    0
  ],
  "sentences": [
    "I’m going to continue to work for them and fight to get them passed.”\nThe governor said that they have been able to pass $20 million to local police departments and currently have a police reform bill pending in the state legislature.",
    "In addition to allowing Ohioans to conceal carry without a permit, the law no longer requires gun-carrying citizens to let police officers know when they are armed, placing that responsibility to ask on the officers.",
    "“What we’re seeing in our cities, but not just cities, in communities across the state, is that the violence that is occurring is predominantly from people who have committed violence in the past,” DeWine said.",
    "“Most police departments have told us that what they will do, that will simply become part of the protocol,” DeWine said, answering to criticism from the Ohio Fraternal Order of Police.",
    "That bill is pending in the state legislature and needs to be passed.”\nThe bill DeWine is alluding to would allow judges to sentence repeat gun offenders to at least 10 years in prison.",
    "“About half the states now have this provision and this is consistent, I think, with the United States Constitution,” DeWine said during an event Wednesday morning.",
    "The legislation will now allow Ohioans to legally carry a concealed firearm without a permit and has been opposed by activists and the state’s police union.",
    "After signing the Stand Your Ground law last May, Senate Bill 215 becomes the second piece of pro-gun legislation signed into law by the governor.",
    "While gun advocates said DeWine’s decision only protects their Constitutional rights, opponent fear a further uptick in violence across the state.",
    "On the heels of the third anniversary of the Dayton mass shooting, DeWine sent a message to loved ones who have fallen victim to the violence.",
    "Gun advocates said the law protects Ohioans’ Constitutional rights, while opponents say it will lead to more gun violence in the state.",
    "“Going after violent repeat offenders, making sure police have the adequate training, and continue to get good training,” DeWine said.",
    "The bill was passed by the state House of Representatives nearly two weeks ago, with DeWine signing it into law on Monday.",
    "Mike DeWine is speaking for the first time about his decision to sign the “permitless carry” bill, Senate Bill 215.",
    "He said these are bipartisan actions that both sides of the aisle should support.",
    "Since that time, the governor hadn’t commented on signing the law.",
    "“So there are things that are in front of the state legislature.",
    "Now, he’s calling on the state legislature to take action.",
    "On Wednesday, he shed some light on his decision.",
    "“We need to go after these people.",
    "COLUMBUS, Ohio (WCMH) – Ohio Gov.",
    "“It’s pretty simple,” he said."
  ]
}