{
  "id": 13845,
  "mediaId": 8323,
  "date": "2022-03-17",
  "headline": "Lake County sheriff responds to Ohio’s new concealed carry law",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2021/07/4AB586FEB34D4314930A37D9045E59ED.jpg?w=1280",
  "link": "https://fox8.com/news/lake-county-sheriff-responds-to-ohios-new-concealed-carry-law/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Unger",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "I would also ask that if you are carrying a weapon on you, and find yourself in an interaction with law enforcement, that you voluntarily inform the officer as soon as possible for everyone’s safety.”\nThe sheriff’s office will continue offering concealed carry licenses for those who want one.",
    "“As well, there are many other benefits to having a CHL/CCW license such as a speedier process for background check when purchasing new firearms due to the checks already performed by a Sheriff’s Office when getting a CHL/CCW permit,” Leonbruno said in the statement.",
    "***Related video: What Ohio’s new concealed carry law could mean for traffic stops***\nLAKE COUNTY, Ohio (WJW) – The Lake County Sheriff’s Office released a statement in response to changes that are coming to Ohio’s concealed carry law.",
    "“As a supporter of the second amendment, I understand the importance of your rights to lawfully possess and carry firearms for personal protection or sporting purposes, if you choose,” Leonbruno said.",
    "Mike DeWine signed Senate Bill 215 into law Monday, eliminating the concealed carry permit requirement for Ohioans 21 and over who can legally own and carry a firearm.",
    "The changes also mean there will no longer be a requirement for drivers with a concealed weapon to announce it to an officer during a traffic stop.",
    "Starting June 13, Ohioans who can legally carry or possess a handgun can conceal it without a license, training requirement or a background check.",
    "In a statement, Sheriff Frank Leonbruno encouraged residents to still consider attending firearms courses, as well as other recommendations.",
    "I continue to encourage all firearms owners, new or seasoned to consider attending firearms courses for safety and proficiency.",
    "Under the new law, though, if an officer asks if you are carrying a handgun, you still have to answer truthfully.",
    "They say the licenses are still important for anyone traveling to a state with different concealed carry laws.",
    "Those who do not tell law enforcement about their firearm could face up to 90 days in jail and a $750 fine.",
    "“As your Sheriff, and a firearms owner, I am also an advocate of responsible and safe firearms handling.",
    "The sheriff’s office said they’re reviewing the new law and training deputies on the changes.",
    "Ohio Gov."
  ]
}