{
  "id": 13871,
  "mediaId": 8480,
  "date": "2022-03-18",
  "headline": "Full May 3 primary ‘no longer possible,’ Ohio’s top election official says",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/frank-larose-ohio-mask-maps.jpg?w=1280",
  "link": "https://www.wdtn.com/news/your-local-election-hq/full-may-3-primary-no-longer-possible-ohios-top-election-official-says/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Orner",
  "authorUrl": "https://www.nbc4i.com/?post_type=profile&p=455963",
  "termIds": [
    0
  ],
  "sentences": [
    "“I regret to inform you that as a result of last night’s decision by the Ohio Supreme Court, and barring the immediate action of a federal court,” LaRose wrote, “our 88 county boards of elections can no longer include contests for the state House and state Senate in the May 3, 2022 primary election.”\nThe state Supreme Court ruled Wednesday that a third attempt by the Ohio Redistricting Commission to draw state legislative district maps again unconstitutionally favored Republicans.",
    "In his letter to state leaders, LaRose, a Republican, said he believes lawsuits fighting the map proposals are “entirely political, and the strategy is being bankrolled by out of state special interests ultimately seeking court-ordered gerrymandering for partisan advantage.”\nMultiple times, however, Ohio’s proposed maps — both for state legislative districts and congressional districts — have been struck down for giving Republicans an outsized advantage.",
    "An election effectively begins with boards sending ballots to military and overseas voters, LaRose wrote, and with that deadline being Friday, “it’s no longer logistically possible to include district-specific legislative races.”\nBut because federal litigation is still pending on Ohio’s state legislative maps, however, LaRose directed local election boards Thursday night to not yet send out ballots and “continue to prepare for” a May 3 election.",
    "Only state lawmakers have the authority to change the date of an election, so it will be up to both Republican-led chambers to decide whether Ohio has two primaries — one on May 3 and one later for statehouse races — or just move all races to later in 2022.",
    "Six weeks is just too close the upcoming primary for local boards of elections to meet their pre-election deadlines and prepare and set ballots, LaRose, who is Ohio’s top election official, wrote in a letter to lawmakers and Gov.",
    "COLUMBUS, Ohio (WCMH) — Ohio’s May 3 primary election, if it even keeps the date, will not include state House and Senate races, Secretary of State Frank LaRose made official Thursday night.",
    "DeWine last week signed a bill to move the date to send ballots to overseas and military voters from Friday to April 5, but federal officials have yet to approve that.",
    "LaRose also accused the Biden administration for an “intentional” contribution to redistricting delays, because census data came later than expected.",
    "The rest of the primary election contests, like local, governor and U.S. Senate contests, are still a go for May 3, LaRose assured in his letter.",
    "The U.S. Census Bureau, however, was already behind schedule with its decennial process during the Trump administration because of COVID-19.",
    "The state Supreme Court has yet to rule on the redistricting commission’s latest congressional map, passed March 2 along party lines.",
    "Lawmakers have already dispatched $9 million to help local election boards with the turmoil, and Gov.",
    "The bipartisan, Republican-majority commission has until March 28 to submit its fourth try.",
    "Mike DeWine’s time extension of overseas and military voting gave boards another $200,000.",
    "LaRose has estimated a second primary would cost $20 million-$25 million.",
    "When Ohio held a second primary in 2011, it cost taxpayers $15 million.",
    "Mike DeWine."
  ]
}