{
  "id": 13982,
  "mediaId": 8496,
  "date": "2022-03-17",
  "headline": "Dr. Amy Acton addresses Cleveland Leadership Center to mark 2 years since start of COVID-19 pandemic",
  "image": "https://media.wkyc.com/assets/WKYC/images/cbb2cb91-1a9d-4df6-8780-047459aae2a0/cbb2cb91-1a9d-4df6-8780-047459aae2a0_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/dr-amy-acton-cleveland-leadership-center-2-years-since-start-covid-19-pandemic/95-3806c999-3971-4d37-a837-6f3675fc6ca7",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Mike DeWine put us at ease by calmly explaining the facts as well as the importance of the moment, and made her somewhat of a cult hero not just in Ohio, but across the nation.",
    "But things quickly changed during her initial meetings with DeWine and other leaders from around the country, including then-acting White House Chief of Staff Mick Mulvaney.",
    "\"Ohioans flattened the curve,\" Acton declared, alluding to the fact that the state's numbers were significantly lower than similar areas during that time.",
    "CLEVELAND — It's been two years since the COVID-19 pandemic made it's way to Ohio, and when we think back to those early days, one name comes to mind.",
    "From there on out, she became a regular presence on televisions across the state, with the mantra \"flatten the curve\" entering the public lexacon.",
    "It's safe to say Acton didn't expect to become a national figure, once jokingly telling a colleague \"You're going to know me for about a month.\"",
    "As the state's health director at the time, Dr. Amy Acton helped guide citizens through uncertainty and fear as the virus began to spread.",
    "\"I don't think there is anyone who has gone untouched by what we've been though, and I also think we're going to be a lot better for it.\"",
    "The decision came in the wake of relentless attacks from critics, but she says she has no regrets about her actions to keep Ohioans safe.",
    "\"It is no small thing that we've made it to this point together,\" Acton said via Zoom as she looked back on the last two years.",
    "However, she returned to screens Thursday to address dozens gathered for an event hosted by the Cleveland Leadership Center.",
    "Since leaving the DeWine administration in the summer of 2020, Acton has largely remained out of the public eye.",
    "But Acton's time as health director would not last, as she resigned from the position in June of 2020.",
    "The \"war\" truly began in Ohio weeks later, with Acton and the governor issuing a \"stay at home\" order.",
    "\"It was sort of like that tipping off point where everyone knew that it was the real thing,\" she said.",
    "Ohio's former health director took some time to reminisce about the early days of the pandemic.",
    "\"I just said, 'I really feel this is the higher angels moment.",
    "\"It was something we were going to have to do for each other.\"",
    "\"I would do it a million times over,\" she said of her work.",
    "We are at war with an invisible enemy.'\"",
    "Her daily press briefings with Gov."
  ]
}