{
  "id": 14122,
  "mediaId": 8420,
  "date": "2022-03-18",
  "headline": "DeWine signs Concealed Carry bill into law",
  "image": "",
  "link": "https://putnamsentinel.com:443/Content/News/Local-News/Article/DeWine-signs-Concealed-Carry-bill-into-law/1/1/32630",
  "mediaOutlet": "Putnam County Sentinel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steven Coburn-Griffis",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "At that time, he introduced moderate legislative action which proposed the creation of voluntary state-level background checks for private gun sales, increasing penalties for the illegal sale of firearms, and expanding Ohio’s existing “pink-slip” law, which allows for institutionalizing those with drug or alcohol problems, thereby curbing those individuals’ access to firearms.",
    "In their place, the General Assembly introduced and passed SB175 in 2020, a so-called Stand Your Ground bill which expanded an individual’s right to use deadly force from a home or car, to any place “in which the person lawfully has a right to be.” DeWine signed the bill into law in January of 2021, and the law went into effect last August.",
    "Reacting to DeWine’s signing of SB215 into law, the Ohio Democratic Party accused the governor of “once again caving to extremists in the legislature and special interests.”\n“By signing this bill into law, Mike DeWine has sold out Ohioans and law enforcement officers to special interest groups and extremists in the legislature.",
    "“I believe the majority of people will take the right seriously, and do what they need to do to prepare themselves, to understand what’s they’re required to do while they’re exercising their Second Amendment right.”\n* indicates a required field\nA comment must be approved by our staff before it will displayed on the website.",
    "“What it’s going to do is allow Ohioans to carry and exercise their 2nd Amendment rights without the fear of violating state law,” said Ohio Senator Rob McColley (R-District 1), who, along with 12 other Republican state lawmakers, co-sponsored the bill introduced by Senator Terry Johnson (R-District 14).",
    "To me, I look at it as a distinction that is, in many ways, very minor.”\nThe law, which goes into effect in 90 days, also eliminates the need for handgun training, as well as a requirement to notify law enforcement during traffic stops that a firearm is in the vehicle.",
    "Although a concealed carry permit is no longer required in the State of Ohio effective mid-June, legislative and law enforcement officials believe many Ohioans will continue to seek permits in order to carry in those states which continue to require permitting.",
    "Under the old law, those with concealed carry permits who did not proactively notify law enforcement of a firearm in the vehicle were subject to a first degree misdemeanor charge carrying a potential six-month jail term and a $1,000 fine.",
    "According to the National Rifle Association’s Institute for Legislative Action, Ohio will become the 23rd state in the nation allowing concealed carry in public without the need for a permit.",
    "Once again, he’s failed on both fronts, putting his own political interests over the safety and well-being of his constituents,” Ohio Democratic Party Chair Liz Walters said in a statement.",
    "Under the new law, should an individual fail to accurately respond to a query regarding concealed carry by law enforcement, the penalty has dropped to a misdemeanor of the second degree.",
    "“It’s up to each individual to take responsibility for the decisions that they make,” Van Wert County Sheriff Tom Riggenbach, who chairs the Buckeye State Sheriff’s Association said.",
    "The governor offered conflicting opinions on the matter, initially supporting so-called Constitutional Carry to the Buckeye Firearms Association when running for office in 2018.",
    "OHIO — On Monday, March 14, Governor Mike DeWine signed Senate Bill 215 into law, eliminating the need for a concealed carry permit in Ohio.",
    "Likewise, those same officials expressed faith in Ohioans, saying responsible gun owners will often receive training in handling firearms.",
    "Now, if I throw on a sport coat or a winter jacket that covers up that holster, I would be violating current law in the State of Ohio.",
    "If I wanted to carry with a gun and a holster on my waist that everyone could see, I could walk anywhere publicly that I wanted to.",
    "Time and again, DeWine has promised to support law enforcement officers and ‘do something’ to combat gun violence in our state.",
    "“I think context is very important in this instance, and that’s because Ohio is already an open carry state.",
    "Then, following a mass shooting in Dayton in 2019, DeWine walked back that support in the face of protests.",
    "On arrival, Ohio’s overwhelmingly Republican General Assembly immediately flushed the proposed actions.",
    "Even so, DeWine’s support of the bill was not a foregone conclusion.",
    "And I could do that under Ohio law right now.",
    "This bill will make all Ohioans less safe.",
    "Submit"
  ]
}