{
  "id": 14174,
  "mediaId": 8264,
  "date": "2022-03-15",
  "headline": "Gov. DeWine speaks to Ohio economy at OU Inn",
  "image": "https://bloximages.chicago2.vip.townnews.com/athensnews.com/content/tncms/assets/v3/editorial/9/c6/9c6205d8-a47c-11ec-ae97-4bd27e1bf59c/6230be51b9529.image.jpg?crop=1662%2C873%2C0%2C187&resize=1200%2C630&order=crop%2Cresize",
  "link": "https://www.athensnews.com/news/local/gov-dewine-speaks-to-ohio-economy-at-ou-inn/article_228a422a-a47c-11ec-ba9c-872548243dc1.html",
  "mediaOutlet": "athensnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cole Behrens Athens NEWS Associate Editor",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The realization really came together and was brought home to so many people during the pandemic that we have to make more things in The United States.”\nDeWine pointed to the planned Intel chip-making factory in New Albany, near Columbus.",
    "“You know more about your community, you know more about the county and you know more about the region.”\nDeWine was introduced by regional business leader Steve Evans, owner of Steve Evans Sausages.",
    "DeWine spoke last Wednesday morning at the OU Inn, at an event hosted by the Appalachian Partnership, a nonprofit organization of business leaders representing the Appalachian Ohio region.",
    "DeWine said he valued the insight of the gathered industry leaders, who he said he relies on them for the issues affecting job growth and business development in the community.",
    "Evans thanked DeWine for visiting the region to hear the economic development work happening in southeast Ohio, and said the future was bright for the Appalachian Partnership.",
    "Mike DeWine visited Athens last Wednesday and discussed the resilience of the Appalachian economy, the opportunities for regional growth and the need for local insight.",
    "“We have to focus not just on the three C’s … so look, we’ve got other parts of the state, and southeast Ohio is vitally, vitally important,” DeWine said.",
    "He pointed to the work of JobsOhio, a Ohio Department of Development program focused on job growth, as an asset to retooling the southeast Ohio economy.",
    "“If we get people coming in the door, people who will talk to us about thinking about coming to Ohio — we’ll make our share of sales,” DeWine said.",
    "DeWine and others have said the economic growth from the factory will extend all throughout Ohio as suppliers decide to enter the regional market.",
    "And you and your team made those.”\nDeWine is facing two Primary challengers, former U.S. Rep. Jim Renacci and cattle rancher Joe Blystone.",
    "DeWine continued, saying a point of focus for economic development in Ohio will be developing the southeastern portion of the state.",
    "“I’m proud to be part of this effort.”\nEvans also thanked DeWine for his efforts to keep the coronavirus pandemic under control.",
    "According to Reuters, an initial $20 billion investment — the largest in Ohio's history — will create 3,000 jobs.",
    "The event was also hosted by OhioSE, a subsidiary of Appalachian Partnership, the regional JobsOhio partner.",
    "“What we try to work at every single day is listen and respond to what people are telling us,” DeWine said.",
    "“There was no silver bullet, there was no right answer — there was just a lot of hard decisions.",
    "“We can do really great things with the Appalachian Partnership as it is today,” Evans said.",
    "DeWine said “this is really our time in history” as Ohioans.",
    "“I can’t imagine the depth of that challenge,” Evans said.",
    "The Primary Election date is set for May 3.",
    "“All the things are coming together.",
    "ATHENS — Ohio Gov."
  ]
}