{
  "id": 1452,
  "mediaId": 8365,
  "date": "2022-02-17",
  "headline": "Ohio Redistricting Commission fails to pass new legislative maps, violating court order",
  "image": "https://www.gannett-cdn.com/presto/2022/01/18/NCOD/4f0c4c34-e64d-4f1b-bdbe-97de227bc6eb-Ohio_Redistricting_Commission_KWR_02.jpg?crop=2499,1406,x0,y0&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/02/17/ohio-redistricting-legislative-maps-commission-meeting-columbus-approved-deadline/6801298001/",
  "mediaOutlet": "marionstar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    0
  ],
  "sentences": [
    "“If the standard is the current set of maps, which favor Republicans, or the maps that you proposed in the last commission meeting that have been thrown out by the courts, ... if that is the standard that you are using then yes, some Republicans are going to lose seats,\" Russo said.",
    "\"I find it incredibly regrettable that Ohioans are being held hostage by politicians who care more about their own power than creating maps that the people deserve,\" said Jen Miller, executive director of the League of Women Voters of Ohio.",
    "Democratic maps rejected\nThe decision to forgo a third set of maps came after an hour-long grilling of Democrats over their proposed maps – which would give Republicans a 54-45 advantage in the House and an 18-15 advantage in the Senate.",
    "Under state law, constitutional law, two supreme court decisions and federal law and federal constitutional law, we've tried over the last 10 days to draw a map that complies with all that and we don't think it's possible.\"",
    "The court, in both 4-3 decisions, ruled that maps must comply with the statewide voting preferences of Ohioans, which amount to 54% for Republican candidates and 46% for Democratic ones over the past decade.",
    "\"No General Assembly district plan has been presented to date that achieves a strictly proportional 54-46 result without committing significant other violations of the Ohio Constitution,\" Huffman said.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "LaRose said GOP legislative staff told the commission that it was impossible to produce maps that comply with both the Ohio Constitution and the courts' orders – a point that Democrats dispute.",
    "Chief Justice Maureen O'Connor's statement during a December oral argument has proven prescient: \"If it (the map) is challenged, and it's back here, this could go on forever.\"",
    "The commission and court are operating under a new set of rules, approved by voters in 2015 to curb partisan gerrymandering, so there's no roadmap for what happens next.",
    "But House Minority Leader Allison Russo, D-Upper Arlington, disagreed, saying: \"This is a matter of what we can accomplish and what we are choosing not to get done.\"",
    "Republicans, who dominate the commission, said they couldn’t comply with the Ohio Supreme Court’s redistricting demands and the state Constitution at the same time.",
    "\"We are dangerously close to possibly violating federal law,\" Ohio Secretary of State Frank LaRose, the state's top election official and a commission member, said.",
    "Huffman also criticized House districts in the Democratic proposals for not being compact, citing one that stretched between Summit, Portage and Geauga counties.",
    "Huffman said the Democrats' maps unduly favored Democratic candidates over Republican ones – in violation of voter-approved changes to the Ohio Constitution.",
    "Meanwhile, Ohioans don’t have districts for 99 House and 33 Senate seats – lines that are needed to elect party nominees for representatives on May 3.",
    "The Ohio Supreme Court has twice ordered the seven-member Ohio Redistricting Commission to pass constitutional maps for House and Senate districts.",
    "Huffman said he was sharing concerns about compactness and splitting communities, which the public raised in public hearings held across the state.",
    "Russo contended that to align legislative maps with Ohioans' voting preferences, Democrats would gain seats and Republicans would lose them.",
    "The Ohio Redistricting Commission failed to pass new state House and Senate maps Thursday, violating an Ohio Supreme Court order.",
    "With no maps and no political path, it's difficult to see how Ohioans escape this loop between the commission and the court.",
    "\"This map only, not only primarily, only favors the Democrat party and only disfavors the Republican party,\" Huffman said.",
    "Mike DeWine said the commission could and should have passed maps Thursday that got close to what the court wanted.",
    "Republican Senate President Matt Huffman, R-Lima, said the task set out by the Ohio Supreme Court was impossible.",
    "\"It is possible for us to draw constitutional maps and for to work together as the court has directed us to do.\"",
    "In a lengthy back-and-forth, Russo repeatedly asked Huffman what constitutional violation he was alleging.",
    "That prompted Sen. Vernon Sykes, D-Akron to say: \"I’m surprised that you’re putting emphasis on it now.\"",
    "In the end, the commission did not adopt the Democratic maps, voting to reject them along party lines.",
    "Democratic members of the commission said Republicans simply lacked the will to fulfill their duties.",
    "Now, the Ohio Supreme Court must decide what to do with a commission that won’t follow its orders.",
    "The commission now faces another tall task: enacting a new congressional map in the coming weeks.",
    "The commission’s inaction throws those races, and the imminent primary, into even more turmoil.",
    "\"We have an obligation to follow the Constitution, to follow the court order and to pass a map.",
    "But Huffman's attendance at those hearings was spotty; he often sent other senators to attend.",
    "Their first map was struck down by the Ohio Supreme Court as unconstitutional gerrymandering.",
    "\"Meeting proportionality as required by the Constitution is not gerrymandering,\" Russo said.",
    "The majority on the court didn't think so and neither did Democrats on the commission.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "He pointed to 10 House Republicans paired in districts with other legislators.",
    "One proposed Ohio Senate district jogged from Toledo to Crawford County.",
    "\"You would have to ask the legislative leaders about that,\" DeWine said.",
    "\"The people who draw the map work directly for them.\"",
    "DeWine skipped one to attend Bengals training camp.",
    "That's not gerrymandering, it's partisan balance.",
    "I think we could have passed a map,\" DeWine said.",
    "Republicans never proposed a new set of maps.",
    "\"We did try to fulfill the court's order.",
    "Impossible task or no will?",
    "Huffman said they tried.",
    "That was the obligation.",
    "So why didn't they?",
    "But is he right?",
    "Gov.",
    "Gov."
  ]
}