{
  "id": 15332,
  "mediaId": 8497,
  "date": "2022-03-08",
  "headline": "Ohio Gov. DeWine calls for state agencies to prepare for possible Ukrainian resettlement",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/dewine-sotu-1627899453.jpg?crop=1.00xw:0.983xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-gov-dewine-calls-for-state-agencies-to-prepare-for-possible-ukrainian-resettlement/39375538",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    2143,
    4498,
    962,
    6077,
    6067,
    6474,
    6672,
    6569
  ],
  "sentences": [
    "Related video above: Refugees continue to scramble to escape Ukraine amid invasion\nOhio Department of Job and Family Services will host multiple organizations that could play a role in relocating Ukrainian families.",
    "\"ODJFS is pleased to help bring Ohio's resettlement agencies, and other charitable organizations together to seek ways of helping displaced Ukrainians,\" ODJFS Director Matt Damschroder said in a statement.",
    "Many were resettled due to the Lautenberg Amendment, a federal program established in 1990 that allows religious minorities from the former Soviet Union to seek refuge in the United States.",
    "The summit is intended to help the organizations better understand their possible role in refugee resettlement, and to assess what Ukrainians' needs may be, DeWine's office said.",
    "\"Like many Ohioans, I am disgusted by the senseless aggression of the Russian military and want to support Ukrainian families being driven out of their country,\" DeWine said.",
    "Mike DeWine is working with the Ohio Department of Job and Family Services to prepare to welcome any Ukrainian refugees that may flee to the United States.",
    "The organizations involved are resettlement agencies, faith-based organizations, charities, and others interested in supporting Ukrainians.",
    "\"While we do not yet know what role Ohio will play in helping these families, I want us to be prepared when the time does come.\"",
    "\"Over the next few days, we'll be finalizing an agenda and providing more information to the key players in this effort.\"",
    "According to DeWine's office, since 2018, more than 500 Ukrainians have been resettled in Ohio, mostly in Cleveland.",
    "More than 14,000 Ukrainian nationals have been resettled in the U.S. under the Amendment in the past five years.",
    "It's also expected to be a way to exchange ideas between organizations on the topic.",
    "The summit will take place on March 17 in Northeast Ohio.",
    "COLUMBUS, Ohio —\nOhio Gov."
  ]
}