{
  "id": 15358,
  "mediaId": 8480,
  "date": "2022-03-10",
  "headline": "Ohio to start reporting COVID-19 cases weekly instead of daily",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/updated-web-coronavirus-in-ohio.png?w=1280",
  "link": "https://www.wdtn.com/community/health/coronavirus/odh-to-provide-update-on-covid-in-ohio-2/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Clark",
  "authorUrl": "https://www.nbc4i.com/author/joe-clark/",
  "termIds": [
    4736,
    2983,
    2143,
    253,
    6077,
    6474
  ],
  "sentences": [
    "Jon Husted and former state health director Amy Acton appeared at a lectern in the Ohio Statehouse, warning of an imminent threat posed by COVID-19, a mysterious respiratory illness spreading in other countries and gaining a foothold in the U.S.",
    "COLUMBUS, Ohio (WCMH) — As COVID-19 moves from being a pandemic to endemic in Ohio, Dr. Bruce Vanderhoff, the state’s health director, said the frequency of reporting case data will change, too.",
    "And Vanderhoff said the state will focus more attention on community transmission levels, which the CDC recently has emphasized in regards to hospital capacity and mask-wearing in public.",
    "Vanderhoff said Thursday during a news conference that, beginning Monday, the state will shift to reporting new cases, hospitalizations and deaths weekly instead of daily.",
    "In becoming endemic, COVID-19 will go from being a society-dominating pandemic to becoming a disease that is a regular part of people’s lives, such as a cold or a flu.",
    "Vanderhoff also reported that the count of new cases per 100,000 residents over two weeks stood at 78, down from 2,200 during the peak of the winter omicron surge.",
    "They will be required to report a positive COVID-19 test only if it’s from a test that the district conducted itself.",
    "The 21-day case average is below 1,200, and since Sunday, there have been no days with cases above 1,000.",
    "And hospitalizations have dropped from a recent high of some 6,000 COVID-19 patients to fewer than 800.",
    "Ohio was one of the few remaining states still reporting case information daily, Vanderhoff said.",
    "Information on the state’s coronavirus dashboards will begin to update only on Thursdays.",
    "The state health department is also easing reporting requirements for school districts.",
    "Changing to weekly will bring the state in line with many others.",
    "COVID-19 cases in Ohio have been on the decline in recent weeks.",
    "It’s been two years since Gov.",
    "Mike DeWine, Lt. Gov."
  ]
}