{
  "id": 1544,
  "mediaId": 8496,
  "date": "2022-02-17",
  "headline": "Ohio redistricting process falters as panel hits ‘impasse’",
  "image": "https://media.wkyc.com/assets/WBNS/images/8436e7df-e2f5-40c1-9442-abd6123452e9/8436e7df-e2f5-40c1-9442-abd6123452e9_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/ohio-redistricting-process-falters-panel-hits-impasse/95-6d460d64-b49f-4cae-b93c-c9598da79a84",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Unfortunately, as a practical matter, it would appear — at least at this point — that this body is at an impasse, said Secretary of State Frank LaRose, one of five Republicans on the commission.",
    "COLUMBUS, Ohio — GOP members of the Ohio Redistricting Commission say they are at an impasse after failing to meet the court-set deadline for fixing state legislative maps.",
    "The plan would have delivered approximately 45% of legislative seats to their party and 54% to the GOP, which roughly matches Ohio’s political breakdown.",
    "The Ohio Supreme Court had set Thursday as the deadline for the commission to produce a new version of state legislative maps.",
    "The map-drawing process driven by the 2020 Census intended for new lines to be in place for the 2022 primary, which is May 3.",
    "LaRose has said the state is now precariously close to violating federal and state laws for carrying out the election.",
    "The two Democrats on the committee put forth Ohio House and Senate maps that their mapmakers said were constitutional.",
    "In a decision set down earlier this month, the state's high court had set Thursday as the deadline for a new version.",
    "Proposed maps have twice rejected by the Ohio Supreme Court for being gerrymandered in favor of Republicans.",
    "Mike DeWine, a member of the commission, said, “We have an obligation under law to give them a third map.",
    "I think it is a mistake for this commission to stop and to basically say that we’re at an impasse.",
    "I don’t think that that is an option that the law gives us.”\nPrevious Reporting:",
    "It was rejected along party lines shortly before the deadlock was declared.",
    "Republican Gov.",
    "..."
  ]
}