{
  "id": 15516,
  "mediaId": 8497,
  "date": "2022-03-10",
  "headline": "Commitment 2022: Mike Gibbons campaigning for U.S. Senate",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ap22015035249552.jpg?crop=1.00xw:0.846xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/commitment-2022-mike-gibbons-campaigning-for-us-senate/39397632",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John London",
  "authorUrl": "https://www.wlwt.com/news-team/0e331c55-fcf7-4f86-b314-3917d61a0129",
  "termIds": [
    4905,
    2684,
    2765,
    2290,
    2143,
    1345,
    1489,
    1126,
    6077,
    6474
  ],
  "sentences": [
    "When asked about Ohio's current governor, a fellow Republican who is taking a lot of political heat from the Republican right, Gibbons told us he voted for Mike DeWine and contributed to his campaign.",
    "Just when you think you have it figured out, up pops a new poll showing roughly 25% of those who intend to vote on May 3 are undecided about which candidate they will vote for.",
    "\"You know, the things that they've done that are not so good that they're pointing out right now, I had nothing to do with,\" he said in reference to CRT advocates.",
    "Although they all express confidence, businessman Mike Gibbons has reason to feel a lot better about his chances than he did just a few weeks ago.",
    "Gibbons expressed a much different opinion about President Joe Biden, saying he \"is taking the country down the tubes in very short order.\"",
    "Besides showing up at the high end of recent polling, a surefire indicator is the proliferation of attack ads directed his way.",
    "COLUMBUS, Ohio —\nThe Republican primary for the U. S. Senate in Ohio is challenging the wisdom of making pundit predictions.",
    "As he worked the Republican crowd at The Farm in Delhi the other night, he spoke with WLWT about the Donald Trump he knows.",
    "He wants to secure the border and give parents control of what's taught in schools, calling critical race theory \"Marxism.\"",
    "He raised a lot of money for him and wants the Trump base here in Ohio to remember that when they vote in a few weeks.",
    "He, like most of the others, is standing on Front Street when it comes to admiring former President Donald Trump.",
    "He is getting his story out as a self-made success, describing himself as a businessman instead of a politician.",
    "The Republican primary for the U. S. Senate in Ohio is challenging the wisdom of making pundit predictions.",
    "He said a lot of businesses suffered because of what he called \"some pretty stupid processes.\"",
    "But he said he does not like a lot of things DeWine has done, particularly the lockdown.",
    "He insisted that he, not Josh Mandel, was the most \"Trump-y\" of the Senate hopefuls.",
    "All five of the contenders believe they have room to grow in the closing weeks.",
    "I had zero, close to zero percent name recognition when I started,\" he said.",
    "Gibbons contends Trump got and continues to get a raw deal from the media.",
    "We had a president get up and say this country's systemically racist.",
    "Gibbons is getting more traction as the voting draws closer.",
    "\"I'm working harder than all the other candidates combined.",
    "And by the way, if I did they wouldn't be my friends.\"",
    "There wasn't much of that early on, but there is now.",
    "\"He's nothing that they, the left describes him as.\"",
    "\"He is empathetic, kind, polite,\" Gibbons told us.",
    "Polling has him in definite contention.",
    "The Gibbons profile seems to be rising.",
    "\"Nobody alive had anything to do with.",
    "That is far from the case now.",
    "I'm going out to the voters.",
    "I don't even know a racist.",
    "I do not know one racist."
  ]
}