{
  "id": 15560,
  "mediaId": 8495,
  "date": "2022-03-09",
  "headline": "DeWine Calls for Summit of Refugee Organizations to Plan for Possible Ukrainian Resettlement",
  "image": "https://wktn.com/wp-content/uploads/2021/01/Job-and-Family-Services.jpg",
  "link": "https://wktn.com/dewine-calls-for-summit-of-refugee-organizations-to-plan-for-possible-ukrainian-resettlement",
  "mediaOutlet": "WKTN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3110,
    2143,
    962,
    6067,
    6474,
    6672
  ],
  "sentences": [
    "“Over the next few days, we’ll be finalizing an agenda and providing more information to the key players in this effort.”\nDamschroder noted that early discussions with some resettlement agencies revealed that while the current outpouring of donations has been appreciated, there will be long-term needs and those wishing to give may want to wait until more specific information about the needs is known.",
    "“While we do not yet know what role Ohio will play in helping these families, I want us to be prepared when the time does come.”\nOn March 17th, ODJFS will bring together multiple organizations who could play a role in the relocation of Ukrainian families at a summit in Northeast Ohio.",
    "It also oversees programs that help refugees achieve economic self-sufficiency and social adjustment following their arrival in the U.S. Actual services are provided by nine resettlement agencies and other non-profit groups located throughout Ohio.",
    "(COLUMBUS, Ohio)—Ohio Governor Mike DeWine today has directed the Ohio Department of Job and Family Services (ODJFS) to convene a summit of various service organizations to ensure Ohio’s preparedness to welcome Ukrainian refugees, if asked.",
    "“ODJFS is pleased to help bring Ohio’s resettlement agencies, and other charitable organizations together to seek ways of helping displaced Ukrainians,” said ODJFS Director Matt Damschroder.",
    "Many were resettled due to the Lautenberg Amendment, a federal program established in 1990 that allows religious minorities from the former Soviet Union to seek refuge in the United States.",
    "While refugee programs are all federal programs, the ODJFS Refugee Services Program works with local resettlement agencies to provide the federal government with information on capacity.",
    "“Like many Ohioans, I am disgusted by the senseless aggression of the Russian military and want to support Ukrainian families being driven out of their country,” said Governor DeWine.",
    "The summit is intended to help the organizations better understand their possible role in refugee resettlement, and to assess what Ukrainians needs may be.",
    "These will include resettlement agencies, faith-based organizations, charities, and others interested in supporting Ukrainians.",
    "More than 14,000 Ukrainian nationals have been resettled in the U.S. under the Amendment in the past five years.",
    "Since 2018, more than 500 Ukrainians have been resettled in Ohio, mostly in Cleveland.",
    "It is intended to facilitate an exchange of ideas among interested parties."
  ]
}