{
  "id": 15618,
  "mediaId": 8496,
  "date": "2022-03-08",
  "headline": "Gun safety group urges DeWine to not sign permitless concealed carry bill",
  "image": "https://media.wkyc.com/assets/WBNS/images/fac48d48-73ed-4b02-9abf-784c06c07439/fac48d48-73ed-4b02-9abf-784c06c07439_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/gun-safety-group-urges-dewine-not-sign-permitless-concealed-carry-bill/530-5cab1ac9-b22b-4483-b7b6-5f27876aef06",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The problem is if you decide after the governor signs this, if you decide to carry without a license and you go to another state, you need to check their laws to see if they require you to have a license or not,” LaRosa said.",
    "Chuck LaRosa is a board member for Ohioans for Concealed Carry and argues it is your constitutional right to carry concealed without training, but that sheriff's offices will still give permits to those who want one.",
    "“Governor DeWine, if you oppose this bill, you will likely never know all of the lives that you saved, if you vote for this bill, you will know the lives that are affected by gun violence,” McGuffy said.",
    "HAMILTON COUNTY, Ohio — “It's a fantasy to think this will make us safer,” said Hamilton County Sheriff Charmaine McGuffey\nStrong words from an Ohio sheriff who wants Gov.",
    "The governor has not said yet whether he'll sign or veto the bill, but a spokesperson says the governor has always supported the second amendment.",
    "If a driver is stopped by police, that person would no longer be required to tell officers they have a concealed weapon, unless the officer asks.",
    "Senate Bill 215 says if you are legally allowed to carry a concealed gun, you will no longer need to take eight hours of training.",
    "He warns, if the governor signs the bill and you want to carry your firearm in another state, you may still need a permit.",
    "The Hamilton County Sheriff said it's a \"fantasy\" to think the permitless carry bill is going to make people safer.",
    "In a virtual press conference hosted by Everytown for Gun Safety, the Hamilton County Sheriff pleaded with DeWine.",
    "“Not only will it be a thing you can do, the sheriff will still be required to under the law,” LaRosa explained.",
    "DeWine has 10 days to sign or veto it following its passage, or the bill would become law without his signature.",
    "“If you have a can gun license here, it goes with most states that we have reciprocity with.",
    "Mike DeWine to veto recently passed legislation that would allow permitless carry."
  ]
}