{
  "id": 15627,
  "mediaId": 8491,
  "date": "2022-03-09",
  "headline": "State grant is final push Sebring needs for cleaner water",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/03/village-of-sebring.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/state-grant-is-final-push-sebring-needs-for-cleaner-water/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stan Boney",
  "authorUrl": "https://www.wkbn.com/author/stan-boney/",
  "termIds": [
    0
  ],
  "sentences": [
    "A lot has been done since then to correct the problems and earlier this week, Ohio Governor Mike DeWine granted Sebring $500,000 to finish the job.",
    "When asked if Sebring had that kind of money, Haney said, “We don’t have to do it all in one shot but we’ll make it happen.”",
    "“These are the small 5/8ths, 3/4 inch lines that go from the main lines into the curb stops into the houses,” Haney said.",
    "So we’re trying to make sure everybody understands when it’s going to happen and where it’s going to happen,” Haney said.",
    "“This actually will allow the property owners to get a new service line and have it basically paid for,” Haney said.",
    "“We’ve taken steps to address this and the water we are putting out is great,” said Sebring city manager Jack Haney.",
    "The Village of Sebring must pay to have lines replaced upfront and then will be reimbursed by the state.",
    "Sebring has already identified the houses that need new lines, which helped the village get the grant.",
    "The money will be used to replace lead water lines leading into 175 to 250 Sebring houses.",
    "In 2016, samples of water had to be tested after being collected from places like schools.",
    "Haney outlined the details of the grant to ensure Sebring’s drinking water remains great.",
    "It was all to protect people from what possibly could be lead-tainted drinking water.",
    "“They’ve already gone around and actually done tests at the various households.",
    "SEBRING, Ohio (WKBN) – Six years ago, the people of Sebring received a scare.",
    "We sent letters out to the households and also have gone door to door.",
    "They were told the water they were drinking may be tainted with lead.",
    "Sebring will be allocated $500,000 from the state’s new H2Ohio fund.",
    "Haney called the money coming from the state a reimbursement grant.",
    "Cases of bottled water were also given out."
  ]
}