{
  "id": 15648,
  "mediaId": 8494,
  "date": "2022-03-09",
  "headline": "GOP redistricting commissioners file their rebuttal to challenge over Ohio congressional map",
  "image": "https://npr.brightspotcdn.com/dims4/default/e9e5e16/2147483647/strip/true/crop/3566x1872+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2F38%2F26%2F9ede0e4a49e1abf5363f425021bc%2Fimg-6070.jpg",
  "link": "https://www.wksu.org/government-politics/2022-03-09/gop-redistricting-commissioners-file-their-rebuttal-to-challenge-over-ohio-congressional-map",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow",
  "authorUrl": "https://www.wksu.org/people/andy-chow",
  "termIds": [
    0
  ],
  "sentences": [
    "In a court filing, the response from Senate President Matt Huffman (R-Lima) and House Speaker Bob Cupp (R-Lima) argues that the sections of the constitution that prohibit drawing a map that unduly favors one party do not apply to the Ohio Redistricting Commission.",
    "\"These requirements expressly apply to the general assembly and are contained in the section describing the adoption of a plan by the general assembly by a simple majority vote,\" wrote Phillip Strach, attorney for Huffman and Cupp.",
    "Republican redistricting commissioners say the congressional map they adopted March 2 complies with the Ohio Supreme Court's orders and creates a map that can be implemented in time for the primary.",
    "The Ohio General Assembly had the first opportunity to redraw the congressional district map, but when that time lapsed the responsibility turned over to the commission.",
    "The congressional district map creates 10 Republican districts, three Democratic districts, and two competitive districts that lean in favor of Democratic candidates.",
    "The response also argues that the Ohio Redistricting Commission is not a party in the lawsuit since the original challenge was against a bill, SB258, and it was Gov.",
    "Opponents say the map still unduly favors Republicans in Ohio by creating a GOP advantage in 66% of the districts in a state that's about 54% Republican.",
    "That map, which was invalidated by the court in January, created 12 seats that heavily favored or leaned in favor of Republicans.",
    "A previous congressional district map was passed by the Legislature in November 2021.",
    "Mike DeWine named in the filing as the defendant.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau."
  ]
}