{
  "id": 15644,
  "mediaId": 8496,
  "date": "2022-03-07",
  "headline": "Parents remember Stone Foltz one year after alleged hazing death",
  "image": "https://media.wkyc.com/assets/WBNS/images/ef6ee670-9081-4cd3-bbd4-94a5543c54bf/ef6ee670-9081-4cd3-bbd4-94a5543c54bf_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/stone-foltz-death-one-year-later/530-7717028d-234c-41a7-aade-84938df1120c",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“So that's just amazing, hearing those good stories.”\n“It would mean everything to us to get to meet her and meet the others that you know, we're recipients of Stone’s organs, because it just means so much,” Shari said.",
    "“That was our promise to Stone that we would not stop until we can eradicate hazing all together because this is not the way any parent wants to live or any siblings want to live,” Shari said.",
    "Shari and Cory Foltz promised their son Stone, while he was on life-support, that they would do everything they can to prevent this tragedy from happening to another family.",
    "Four months after Stone’s death, Shari stood alongside the family of Collin Wiant and spoke in front of journalists and Governor Mike DeWine during the bill signing.",
    "He drank an entire bottle of bourbon and could not walk on his own afterward, according to findings from a law firm hired by the university to investigate the death.",
    "I think, for us, the grieving helps us more to stay out in front of everybody and try to help others.”\nThe Foltz family is now speaking at local universities.",
    "“And we hope and that's what we carry on is that we hope that we can hear from them someday.”\nStone’s legacy lives on through more than just organ donation.",
    "“We did hear that his heart was a successful transplant to a female in her 20s and she's been able to spend time with her five-year-old son now,” Cory said.",
    "\"We will not stop until we can eradicate hazing altogether because this is not the way any parent wants to live or any siblings want to live,\" Shari said.",
    "“Some people grieve differently, and they may want to stay home and stay out of public sight and not visit or not have guests and kind of stay sheltered.",
    "“I had no plans of speaking and Kathleen Wiant said, ‘You know, you need to get up there, you've pushed the principles with these universities.",
    "Shari Foltz, Stone's mother, expressed that the family's lives have completely and not a day goes by where they are not mourning his loss.",
    "There is not a day that doesn't go by that we are not mourning the loss of Stone and trying to remember the good memories that we've had.",
    "COLUMBUS, Ohio — Monday marks one year since the alleged hazing event that led to the death of Delaware County native Stone Foltz.",
    "It was better for me to stand in front of individuals and talk about Stone’s story, and how we need to make change,” Cory said.",
    "And it's not right and it's not fair.”\nStone Foltz was pledging Pi Kappa Alpha fraternity at Bowling Green State University.",
    "You'll hear how they are following the ongoing court cases and the progress they've made in their mission to end hazing.",
    "Last year, Foltz attended an off-campus event for the Pi Kappa Alpha Fraternity at Bowling Green State University.",
    "Foltz, who was trying to join the fraternity, was found unconscious by a roommate after the alleged hazing ritual.",
    "Shari and Cory decided to save countless other lives by keeping Stone alive long enough to become an organ donor.",
    "It stiffened hazing penalties in Ohio and called for more transparency within organization over hazing.",
    "Their mission is to educate others on hazing and ensure another family doesn't suffer the way they are.",
    "His story was the push needed to make a stalled anti-hazing bill move on to the Governor’s desk.",
    "He was attending a big-little off-campus drinking event the night of March 4, 2021.",
    "They started the iamstonefoltz Foundation with a basketball tournament in November.",
    "Fast forward to today, Foltz's parents and two siblings travel to speak at schools.",
    "You need to speak about it.’ And I was like, ‘Oh, okay, I wasn't prepared at all.'",
    "Shari and Cory Foltz tell 10TV they have been following the ongoing court cases.",
    "Foltz was placed on life support for organ donation and died on March 7, 2021.",
    "Monday on Wake Up CBUS at 6 a.m., Clay Gordon sits down with the Foltz family.",
    "They will also speak at Buckeye Valley, Stone’s former high school, in May.",
    "Telling Stone’s story has helped his family during the grieving process.",
    "The next Stone Foltz HOOPS 4A CHANGE is scheduled for November 19-20.",
    "Later, he was placed on life support for alcohol poisoning.",
    "The coroner said Foltz died of fatal ethanol intoxication.",
    "More than a hundred transplants were a success, Cory said.",
    "His parents remember the events as if it was yesterday.",
    "Collin’s Law was signed at the beginning of July 2021.",
    "“I mean, our life has completely changed.",
    "“For me, personally, it probably helped.",
    "I feel better after I talk about it.",
    "I spoke from my heart,” Shari said.",
    "But it is hard."
  ]
}