{
  "id": 15764,
  "mediaId": 8276,
  "date": "2022-03-07",
  "headline": "Crawford Anti-Wind: 'What we're asking for is to actually let the people have a say'",
  "image": "https://www.gannett-cdn.com/presto/2022/03/05/PBUC/bfee9454-58de-4451-99ba-8c20d57d1caf-petitions_1.JPG?crop=2212,1244,x0,y125&width=2212&height=1244&format=pjpg&auto=webp",
  "link": "https://www.bucyrustelegraphforum.com/story/news/2022/03/07/crawford-anti-wind-wants-residents-vote-planned-wind-farm/9357308002/",
  "mediaOutlet": "bucyrustelegraphforum.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gere Goble",
  "authorUrl": "https://www.bucyrustelegraphforum.com/staff/4395714002/gere-goble/",
  "termIds": [
    0
  ],
  "sentences": [
    "The state's two-year budget bill, passed last summer, extends the law allowing counties to offer a payment in lieu of taxes, or PILOT fee, option for renewable energy projects until the end of 2024.\nggoble@gannett.com\n419-559-7263",
    "Crawford Anti-Wind petitions are available at local sites\nWeisenauer said the anti-wind group, which has a core group of about 20 active members, has been circulating its petitions for several weeks.",
    "The petitions are directed at trustees of each township, asking that they in turn ask the Crawford County commissioners to declare the county a restricted zone, preventing wind farm development.",
    "The legislation also adds two ad hoc members representing the community to the siting board while it reviews the local project — leaders of the township trustees and county commissioners.",
    "A spokeswoman for developer Apex Clean Energy has said Honey Creek Wind is expected to include approximately 60 turbines, each with an anticipated height between 590 and 670 feet.",
    "If a facility is in multiple townships, all of the trustee members are to vote on a representative — or all commissioners would vote if the project involves multiple counties.",
    "Instead, wind farm developers would make an annual Payment in Lieu of Taxes, or PILOT fee, of $9,000 per megawatt, nameplate capacity, Commissioner Doug Weisenauer said.",
    "On its Facebook page, Crawford Anti-Wind describes itself as \"a grass roots group of citizens who are committed to stopping the invasion of BIG WIND in the rural areas.\"",
    "No one who has signed a lease or easement agreement with the developer of a utility facility, or holds any other beneficial interest in a utility facility, can serve.",
    "Opponents to an industrial wind farm planned in the northern half of Crawford County are making it easy for residents to sign petitions against Honey Creek Wind.",
    "\"And then the people ... they will be able to, if they don't agree with what the commissioners did, then they can get signatures and have it put on the ballot.",
    "Under terms of an Alternative Energy Zone approved by Crawford County commissioners in 2011, renewable energy developers would not pay standard property taxes.",
    "Commissioners can adopt a resolution designating any portion of unincorporated land in the county as a restricted area, prohibiting construction of wind farms.",
    "In the 90 days that follow, commissioners may pass a resolution prohibiting the construction of the facility or limiting its boundaries to a smaller area.",
    "\"The idea was, although township trustees technically do not have any power, they could influence commissioners, who do have the power,\" Moritz said.",
    "The law also requires developers to present their plans at a public meeting 90 days prior to filing an application with the Ohio Power Siting Board.",
    "Throughout the week, petitions are available at Randy's Tire; LuLu's Kitchen, 1640 Marion Road; Home Town Garage, 117 E. Perry St.; and Kaye & Co.",
    "Mike DeWine signed Senate Bill 52, which significantly changed Ohio's laws governing siting requirements for industrial solar and wind projects.",
    "At the meeting, they must present the scale of the project, its maximum nameplate capacity and a map of the proposed geographic boundaries.",
    "On Saturday, the group had drive-thru events at Randy's Tire and Auto Repair, 1000 N. Sandusky Ave.; and at the American Legion Post No.",
    "The petitions state signers \"desire to protect the township from the negative impacts of industrial scale wind and solar projects.\"",
    "It gives county commissioners the ability to prevent Ohio Power Siting Board certification of certain wind and solar facilities.",
    "\"The idea of the petition is to help support the commissioners in saying, 'We at least want to let the people have a say.'",
    "\"They don't have to get out of their car and they can sign a petition,\" Crawford Anti-Wind member Kay Weisenauer said.",
    "And they can do that by just making us an exclusion zone — the whole county or just part of the county,\" Moritz said.",
    "If such a resolution is passed, petitioners have 30 days to request a referendum vote on the decision.",
    "Two batches of signed petitions have been delivered to trustees across the county already, she said.",
    "The new law also requires developers to submit a decommissioning plan along with their application.",
    "If commissioners take no action, developers can proceed with seeking siting board approval.",
    "Since its Facebook group was formed in January, it has attracted more than 1,400 members.",
    "On Saturday, they had drive-thru petition-signing events in Bucyrus and New Washington.",
    "\"If we get enough signatures, we can help them make the decision to restrict us.\"",
    "Senate Bill 52 changed Ohio law governing siting requirements\nIn July, Gov.",
    "The same information must be submitted in writing to county commissioners.",
    "Sandusky Township resident Lynette Moritz is one of the group's leaders.",
    "\"What we're asking for is to actually let the people have a say.\"",
    "\"The commissioners, today, could make this go away,\" Moritz said.",
    "Commercial operation is targeted to begin in 2024.",
    "\"We're had great response,\" she said.",
    "\"I'd say at least a couple thousand.\"",
    "405 parking lot in New Washington.",
    "Salon, 125 E. Rensselaer St."
  ]
}