{
  "id": 1580,
  "mediaId": 8379,
  "date": "2022-02-18",
  "headline": "Ohio State fair returns for Summer 2022",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2018/07/Records_reveal_most_dangerous_ride_at_Oh_1_50176428_ver1.0.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/ohio-state-fair-returns-for-summer-2022/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristine Varkony",
  "authorUrl": "https://www.nbc4i.com/author/kristine-varkony/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We have experienced so many remarkable moments with our children and grandchildren at fairs over the years, and this summer, we can’t wait to enjoy the Ohio State Fair once again.”\nThe release stated that fair staff “are actively working on enhancements that will make this year’s Ohio State Fair safe, fun, and memorable.”\n“When we open our gates, people will be able to rediscover the Ohio State Fair,” said Strickler.",
    "You’ll be able to walk through the barn, see the iconic butter cow, try some deep-fried food on a stick, listen to music, browse arts exhibitions, watch performances by the All-Ohio State Fair Band and Youth Choir, visit with Smokey Bear, learn about agriculture, and so much more.”",
    "The first big-name acts in this year’s Ohio State Fair Concert & Event Series will be announced March 7, with additional announcements to follow on March 21 and April 4.",
    "Governor Mike DeWine and Ohio Expo Center & State Fair General Manager Virgil Strickler announced Friday the 167th Ohio State Fair will run from July 27 to August 7.",
    "The 2020 fair was completely canceled due to the COVID-19 pandemic, and in 2021, it was closed to the public, focusing on agricultural and educational competitions.",
    "It’s a place where we can all celebrate our great state and make memories that will last a lifetime,” Governor DeWine said in a press release.",
    "COLUMBUS, Ohio (WCMH)– After a two-year hiatus, the Ohio State Fair will return this summer.",
    "“Fran and I absolutely love fairs, none more than the Ohio State Fair,” DeWine continued.",
    "“This summer, all of our fair favorites will return.",
    "“The Ohio State Fair brings people together."
  ]
}