{
  "id": 15835,
  "mediaId": 8494,
  "date": "2022-03-14",
  "headline": "DeWine signs bill to make it easier for people to carry concealed guns",
  "image": "https://npr.brightspotcdn.com/dims4/default/776c4f8/2147483647/strip/true/crop/4373x2296+0+311/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Flegacy%2Fsites%2Fwcpn2%2Ffiles%2F201612%2Fconcealed_carry_generic_-_praphab_louilarpprasert_shutterstock.com_.jpg",
  "link": "https://www.wksu.org/government-politics/2022-03-14/dewine-signs-bill-to-make-it-easier-for-people-to-carry-concealed-guns",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "When asked if the timing was a motive for passing the controversial legislation now, House Speaker Bob Cupp (R-Lima) said, “The Legislature does what it deems good public policy so that’s our focus.”\nLast January, DeWine signed the controversial \"Stand Your Ground\" bill (SB175) which removes the requirement for a person to retreat before shooting someone in self-defense.",
    "Just two months later, he stood alongside then Dayton Mayor Nan Whaley, a Democrat who is now running for governor in her party's primary, when he announced his \"Strong Ohio\" gun reform plan.",
    "Last year, after signing the \"Stand Your Ground\" bill, DeWine tried to insert some parts of his gun plan into his proposed two-year state budget but lawmakers didn't embrace those proposals.",
    "Mike DeWine (R-Ohio) has signed into law a bill that would allow Ohioans to carry a concealed gun without first having to obtain a permit or take a training course.",
    "DeWine was in a precarious position with this bill as he faces three Republican primary challengers, all of whom are more supportive of relaxing gun regulations.",
    "He embraced some controls on guns, especially after the August 2019 mass shooting near Dayton in which nine people were killed and17 others were injured.",
    "DeWine says he signed it because he said he had promised to do so during his campaign.",
    "The bill doesn't contain an emergency clause so it will go into effect in 90 days.",
    "But DeWine has also said he doesn't consider guns to be a high priority issue.",
    "But Ohio lawmakers have not been willing to take up DeWine's gun reform plan.",
    "Over the objection of police groups and gun control advocates, Gov.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau."
  ]
}