{
  "id": 15833,
  "mediaId": 8373,
  "date": "2022-03-14",
  "headline": "Report: Ohio’s sports betting law a model for the nation",
  "image": "https://jnswire.s3.amazonaws.com/jns-media/a5/7c/11632216/adobestock_288328725.jpeg",
  "link": "https://mountvernonnews.com/stories/621827177-report-ohio-s-sports-betting-law-a-model-for-the-nation",
  "mediaOutlet": "mountvernonnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "J.D. Davidson",
  "authorUrl": "https://mountvernonnews.com/author/j-d-davidson",
  "termIds": [
    0
  ],
  "sentences": [
    "The length of time, PlayOhio believes, is a benefit, allowing lawmakers a chance to fine-tune the law that allows both retail and statewide online betting, allows betting on pro, college and Olympic sports, gives pro sports teams and gaming facilities preferential consideration for licenses and allows lottery retailers to host sports betting kiosks.",
    "“The result is a structure that is the new standard in the U.S.”\nOhio still is nearly a year from the Jan. 1, 2023, target launch date, one of the longest spans from becoming law to launch among the other 32 states and the District of Columbia that have moved into legal sports betting in some form.",
    "“The state took its time in legalizing sports betting and then took a collaborative approach with existing casino stakeholders, local pro sports franchises and the lottery program,” said Eric Ramsey, data analyst who co-authored the PlayOhio.com market analysis.",
    "PlayOhio, part of the PlayUSA Network, believes the state’s patient and collaborative approach to produce its sports gaming law set the bar high for states still debating gaming options.",
    "Ohio appears poised to emerge as the second- or third-largest sports betting market in the country, clearly behind New York, but perhaps rivaling Nevada, New Jersey, and Illinois for No.",
    "(THE CENTER SQUARE) – An industry group that tracks sports betting laws and revenue from gaming across the nation called Ohio’s new sports gambling law the best in the country.",
    "The licenses include those for mobile apps, brick-and-mortar stores and kiosks at certain lottery retail agents, which includes businesses that hold a specific liquor permit.",
    "“The state’s sports landscape and the affinity for land-based gambling among its residents and visitors additionally bode well for the future of sports betting in Ohio.",
    "It estimates the state could produce as much as $900 million in revenue, $12 billion in wagers and $90 million in state taxes annually in as quickly as three years.",
    "Mike DeWine made sports betting legal in Ohio when he signed a bill into law in late December, creating online, retail and kiosk sports gaming throughout the state.",
    "“This framework provides a firm foundation for operators to build what should be one of the nation’s largest, most dynamic sports betting markets,” Ramsey said.",
    "The state plans to issue at least 25 mobile betting licenses and 40 brick-and-mortar licenses for places such as casinos and pro sports venues.",
    "An unlimited number of licenses for kiosks at places such as bars, restaurants and other places with liquor sales will be available.",
    "The gap meant Ohio missed a unique revenue opportunity when the Cincinnati Bengals appeared in the Super Bowl in February.",
    "The Ohio Casino Control Commission will oversee the program, and the Ohio Lottery Commission also will play a role.",
    "The law creates three types of gaming licenses that last for five years and goes into effect Jan. 1, 2023.",
    "PlayUSA believes Ohio will be one of the largest sports gaming markets in the country despite the delay.",
    "PlayOhio estimated the state could have seen between $70-$100 million wagered on the game.",
    "The group’s opinions are outline in a new market analysis recently published.",
    "The state also plans a 10% tax.",
    "2.”\nGov."
  ]
}