{
  "id": 15920,
  "mediaId": 8473,
  "date": "2022-03-10",
  "headline": "Judge demands answer on bribe payments in corruption scandal",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/news/latest-news/2022/03/judge-demands-answer-on-bribe-payments-in-corruption-scandal/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The hearing concerned a proposed settlement of lawsuits filed by shareholders on behalf of FirstEnergy against board members and top executives in the wake of allegations that the company paid $60 million in bribes to win a $1 billion legislative bailout of two Ohio nuclear plants operated at the time by a wholly-owned FirstEnergy subsidiary.",
    "Adams also wanted to know why the settlement was reached without depositions from current and former FirstEnergy officials and why no effort had been made to force former company executives to return millions in compensation, including $81 million from former CEO Chuck Jones.",
    "Jones was fired in October 2020, several weeks before FirstEnergy revealed a $4 million payment to end a “purported consulting agreement” to a firm tied to Sam Randazzo shortly before Randazzo was appointed chair of the Public Utilities Commission of Ohio by Gov.",
    "Federal authorities say the $60 million from FirstEnergy was used to get Householder supporters elected to help him win passage of the bailout legislation and to prevent bailout opponents from placing a referendum on the Ohio ballot.",
    "AKRON (AP) — A federal judge abruptly ended a hearing when an attorney for utility giant FirstEnergy Corp. refused to say who at the company was responsible for paying bribes to a dark money group in an Ohio corruption scandal.",
    "The proposed settlement of a number of derivative lawsuits calls for FirstEnergy’s insurer to pay the company $180 million less attorney fees on behalf of board members and company executives.",
    "Ohio House Speaker Larry Householder, four associates and a dark money group were indicted in July 2020 on federal racketeering conspiracy charges for their roles in the bribery scandal.",
    "U.S. District Judge John Adams to the surprise of those gathered in his Akron courtroom on Wednesday told FirstEnergy’s lead attorney, Jeroen Van Kwawegen, “You are wasting my time.",
    "The proposed settlement was announced Feb. 10 in Columbus, where U.S. District Judge Algenon Marbley oversees various shareholder lawsuits filed on behalf and against FirstEnergy.",
    "FirstEnergy in July said it would pay a $230 million criminal penalty as part of a deferred prosecution agreement with the U.S. Department of Justice.",
    "Current company CEO and president Steven Strah in a statement of facts attached to the agreement detailed FirstEnergy’s role in the bribery scandal.",
    "Other provisions include an agreement that six longtime board members not stand for reelection at FirstEnergy’s next shareholder meeting.",
    "FirstEnergy officials later said the payment to Randazzo’s firm was for future help he could provide as Ohio’s top energy regulator.",
    "Van Kwawegen told Adams it was a senior executive but said he could not disclose the name while the settlement is pending.",
    "Adams scheduled Wednesday’s hearing to learn why the case should be heard in Columbus instead of Akron.",
    "Neither he nor Jones have been charged with any crimes and both have denied wrongdoing.",
    "Randazzo resigned in November 2020 after FBI agents searched his Columbus townhome.",
    "You are here to duck and avoid,” before ending the hearing.",
    "NEWSLETTER\nToday's breaking news and more in your inbox",
    "You are not here to answer my questions.",
    "Householder has pleaded not guilty.",
    "No trial date has been scheduled.",
    "Mike DeWine."
  ]
}