{
  "id": 16058,
  "mediaId": 8365,
  "date": "2022-03-06",
  "headline": "Ukrainian OSU Marion professor: To stop the war machine, you cannot just send blankets",
  "image": "https://www.gannett-cdn.com/presto/2022/03/04/PGRF/d5fcf6c5-3fca-4fe6-ad5a-daf91aedaa2f-Ukrainian_ciyt_of_Bucha.jpg?crop=1439,810,x0,y51&width=1439&height=810&format=pjpg&auto=webp",
  "link": "https://www.marionstar.com/story/news/local/2022/03/06/ukrainian-osu-marion-professor-gives-insight-into-country-under-attack/6973144001/",
  "mediaOutlet": "marionstar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sophia Veneziano",
  "authorUrl": "https://www.marionstar.com/staff/5656871001/sophia-veneziano/",
  "termIds": [
    0
  ],
  "sentences": [
    "She detailed not only a reality where Putin does not view Ukraine as a separate country, merely a puppet state developed by the \"evil west\" seeking to destroy Russia, but also where the Russian people are brainwashed into believing Ukrainian forces are firing on their own country, as she has heard from friends who have reached out to family members living in Russia for help.",
    "“If the history predicts the future, it’s quite likely that Ukraine will not be able to survive in the shape and the form that it exists right now, and I don’t know if it’s a temporary development or this is something that could preclude the possibility that the Ukrainian state will emerge again,” said Klochko.",
    "Though she said that any kind of donation works, Klochko noted that some of the smaller aid organizations have the ability to be more flexible and adaptive given the rapidly changing landscape of warfare and looking into donating to these could be a good place for those who wish to support to start.",
    "\"I guess I need help too – but I am not as important as other people, especially young kids who are just at the end of their rope and are very stressed out and trying to make sense of this while checking on their relatives and friends back in Ukraine as well as trying to raise some funds.\"",
    "In her presentation, Klochko showed a chart displaying the countries that condemned or supported Russia's attacks on Ukraine, pointing to a quote from Dr. Martin Luther King Jr. saying:\n\"In the end, we will remember not the words of our enemies but the silence of our friends.\"",
    "The associate professor of sociology and criminology at Ohio State Marion gave a presentation Thursday on the history of Russian aggression and the current situation in Europe, allowing members of the Ohio State community to listen, learn from her insight and ask questions.",
    "Noticing a lack of support\nAs she mentioned noticing the silence of friends, Klochko noted that while Ohio State has posted on Twitter about the conflict, the university has not made a formal declaration of condemnation for Russia's aggression.",
    "She later explained that she is thinking mainly of her students when she pointed out this lack of response, citing the added stress for Ukrainian or Ukrainian-American students while trying to navigate preexisting stressors of university life.",
    "Attending Thursday's presentation virtually, Shellie Shirk, a pre-Law advisor at Ohio State Marion, said she has felt helpless watching the fight from afar, explaining there is so much she wants to do to help, but she doesn't know how.",
    "Showing images of cities destroyed by the conflict and explaining the realities of Ukrainian people hiding in bomb shelters quickly running out of supplies, Klochko removed the distance many feel toward the warfare.",
    "You could send the bullets and send the tanks, but if people lose the will to fight or the strong conviction to fight because they feel they’ve been abandoned, that would be very difficult for them,\" Klochko said.",
    "And since Putin has shown multiple times that he only understands the forceful response and he’s only considering the strong response, however difficult it is to make the strong response,\" she said.",
    "Because the world did not hold Putin accountable in 2014 during the annexation of Crimea, he now has seen this as a \"green light\" from a western world that he views as weak, Klochko explained.",
    "Dr. Marianna Klochko looked around the room in Morrill Hall at The Ohio State University at Marion Thursday and asked the following question:\n\"Are we going to be Chamberlains or Churchills?\"",
    "Nobody really knows exactly what will happen, but for sure one thing that is happening and will happen even further is the tragic loss of life and humanitarian catastrophe,” she concluded.",
    "\"The methods Putin is using are very similar if not worse than the methods Stalin is using, and people tend to forget and tend to glorify and think this is fantastic,\" Klochko said.",
    "A 'green light' to warfare\nBefore he was president of Russia and even before the collapse of the Soviet Union, Putin was a KGB officer who gained power rising through the ranks.",
    "Those issues, those sanctions were imposed more than a week ago by the federal government, and here the state government is now just talking about doing this,\" Schertzer said.",
    "“What other choice do we have, we either become a hostage to Putin's demand – what else is he going to ask – when do we stand up,\" she said during her Thursday presentation.",
    "Beyond financial support, she said her friends in Ukraine have cited the emotional support of the watching world has been an encouragement through this sudden warfare.",
    "'\"We need to pull our money out for good, sound, fiscal reasons and we need to pull it out for moral reasons too and support the people of Ukraine,\" he continued.",
    "Ohio Governor Mike DeWine issued an executive order Thursday in support of Ukraine, condemning the Russian violence and supporting federal economic sanctions.",
    "Though she is watching Russian President Vladimir Putin wage war on Ukraine from afar, Klochko, of Kharkiv, Ukraine, is emotionally much closer to the fight.",
    "Still, this is the greatest determination of the future of Ukraine, Klochko said, following previous attempts to independence ultimately thwarted by Russia.",
    "To the engaged audience of her presentation at Ohio State Marion Thursday, Klochko explained the world's dire need to stand up to the Russian aggression.",
    "Though unable to predict the future of Ukraine's statehood or the matters of global politics, Klochko said further destruction was inevitable.",
    "\"Putin said Stalin is the best person in Universe and that he's a great statesman, and because of Stalin millions of people perished.\"",
    "She outlined the tactics of the Russian army as ruthless and rooted in the cruelty of Stalin's regime which she said \"birthed Putin.\"",
    "Klochko pointed the audience to a resource guide of Ukrainian organizations to support financially, saying that \"anything helps.\"",
    "Ukraine has considered itself a separate people long before the 30 years of independence it has experienced since 1991.",
    "\"I hear a lot from my friends in Ukraine who say, ‘Thank you to the global community for paying attention to us.'\"",
    "They might not be thinking along the same lines that I do, but I just feel that they need more help,\" she said.",
    "Strength needed to end cycles of aggression\nStill, emotional or economic support, it seems, can only go so far.",
    "Marion Mayor Scott Schertzer said Ohio's official support for Ukraine should have been announced sooner.",
    "It gives you strength where you might not have it otherwise and it fuels this sense of righteousness.",
    "Klochko said the fate of Ukraine is in danger depending on the world's response to join the fight.",
    "“To stop the war machine, you cannot just send blankets – you have to do something.",
    "\"Not only do I support that divestiture, but why hasn't it already been done.",
    "“I’m just worried about the students and other members of the OSU community.",
    "“I don’t know if I can predict anything with a great degree of certainty.",
    "Story by: Sophia Veneziano (740) 564 - 5243 | sveneziano@gannett.com",
    "It is this background that has influenced his cruelty, Klochko said.",
    "“The feeling of support obviously has a symbolic value.",
    "Ukraine: does it stand alone?"
  ]
}