{
  "id": 1697,
  "mediaId": 8433,
  "date": "2022-02-11",
  "headline": "Chancellor speaks on education collaboration",
  "image": "https://bloximages.chicago2.vip.townnews.com/sent-trib.com/content/tncms/assets/v3/editorial/8/18/8187ba72-8b55-11ec-b5f2-331643bd2179/62068b338ba30.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
  "link": "https://www.sent-trib.com/community/chancellor-speaks-on-education-collaboration/article_68f7e1b2-8b55-11ec-9382-8f3da3abb552.html",
  "mediaOutlet": "sent-trib.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Roger LaPointe",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We’ve got to put parochial interests aside and collaborate as much as possible, because the one thing that made this work is knowing that Ohio has a pretty good reputation for it’s colleges and universities to work together.”\nHe was on calls with Intel during the negotiating process.",
    "Gardner said the recent announcement of the new Intel computer chip plant in the Columbus area, which is a $20 billion investment that is estimated to result in 3,000 jobs, was because of the willingness of a variety of Ohio interests to make the project work.",
    "“I really think the DeWine administration’s mental health concern and support for both K-12 and college and universities, first in the nation in 2020 to provide funding, is something important that many people just don’t know,” Gardner said.",
    "At the direction of DeWine, Gardner, together with Director Lori Criss, Ohio Department of Mental Health and Addiction Services, created a new $16 million program for student mental health funding.",
    "Randy Gardner, chancellor of the Ohio Department of Higher Education, presented the annual report on the State of Higher Education in Ohio as the guest speaker for the Bowling Green Rotary Club.",
    "The company wanted to be assured that Ohio universities would be able to supply the new graduates with the necessary science, technology and math backgrounds that they needed.",
    "Gardner said Bowling Green State University President Rodney Rogers was the first to pledge support for increased collaboration between a university and the company.",
    "DeWine had been participating in the 2020 Chancellors Student Roundtable, when the increasing mental health issues among students during the pandemic was discussed.",
    "The $16 million was part of discretionary Coronavirus Aid, Relief, and Economic Security Act funding, meant to generally mitigate the impacts of COVID-19.",
    "Gardner said that over the next 10 years Intel will invest $100 million in higher education to help facilitate the growth of the jobs.",
    "Gardner said that locally, BGSU’s total allocation for mental health and counseling was $565,000 from the governor’s fund.",
    "Bowling Green Rotary Club meetings are held at the Bowling Green Country Club at noon on the second Thursday of the month.",
    "Gardner said Ohio was the first state to decide to prioritize funding for mental health and counseling services.",
    "The theme for the former Ohio Senate Majority leader and member of the Ohio House was collaboration.",
    "$13.5 million of that funding was in the form of direct grants to colleges and universities.",
    "“I think the biggest factor is that we wanted to be partnered with them,” Gardner said.",
    "As chancellor, he oversees the state’s colleges, universities and technical centers.",
    "Gardner was appointed to the chancellor’s position by DeWine in January 2019.",
    "He then related an example of the way he and Gov, Mike DeWine work together.",
    "“Please let them know, whatever it takes,” Gardner said Rogers pledged.",
    "The remaining went for statewide mental health initiatives.",
    "More information is available at the club’s Facebook page."
  ]
}