{
  "id": 17095,
  "mediaId": 8323,
  "date": "2022-03-02",
  "headline": "Ohio concealed carry: More people armed; hundreds of permits revoked",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/03/GettyImages-638866922.jpg?w=1280",
  "link": "https://fox8.com/news/ohio-concealed-carry-more-people-armed-hundreds-of-permits-revoked/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Talia Naquin",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "amended and section 2923.111 of the Revised Code be enacted to\n(5) and (6) of section 2923.16 of the Revised Code, except that\nin a vessel unless it is unloaded and is carried in one of the\n(D)(1) and (2) of section 2923.12 of the Revised Code are\nan affirmative defense to a charge under division (C) or (D) of\nor (C) of section 2923.16 of the Revised Code while the vessel\n(C) or (D) of this section shall be required to obtain a license",
    "If they fail to do so then it would be a misdemeanor of the second degree,” Bob Cornwell, Executive Director of the Buckeye State Sheriff’s Association, representing sheriffs across Ohio, told FOX 8.",
    "“If an individual is approached by a law enforcement officer, the individual, if they’re carrying a firearm, must notify the law enforcement officer that they are carrying.",
    "Under Ohio law, county sheriffs are responsible for issuing concealed-carry licenses and renewing them, as well as suspending and revoking licenses.",
    "Originally, those carrying a firearm would not be required to tell law enforcement they were armed during a traffic stop unless directly asked.",
    "Opponents of the bill include the Ohio Association of Chiefs of Police, Moms Demand Action, and Ohio’s Fraternal Order of Police.",
    "By a vote of 57-35, the House passed Senate Bill 215, after it moved through the House Government Oversight Committee Tuesday.",
    "Statistics reported to the Attorney General’s office show sheriffs issued around 94,000 new licenses and 108,000 renewals.",
    "According to a report from Ohio Attorney General Dave Yost, 202,920 licenses were issued across the state last year.",
    "The Attorney General notes the number of regular licenses denied set a record for the second consecutive year.",
    "The report shows licenses were denied to 2,668 applicants who didn’t meet the state-mandated requirements.",
    "COLUMBUS, Ohio (WJW) – The number of permits issued for concealed carry licenses in Ohio went up in 2021.",
    "420 licenses were revoked due to felony convictions and mental incompetence, according to the report.",
    "Proposed legislation that would eliminate the permit requirement was passed by the House Wednesday.",
    "The bill will change Ohio law to allow anyone who can legally carry do so without a permit.",
    "Supporters say the bill allows people to realize their Second Amendment rights more fully.",
    "While the overall number is higher than last year, slightly fewer new permits were issued.",
    "The Senate gave it a final sign-off; it now heads to Ohio Gov.",
    "Permit holders must renew their licenses every 5 years.",
    "But, an amendment added Wednesday changes that.",
    "That’s up from 169,232 licenses in 2020.",
    "Read the full copy of the bill below.",
    "Mike DeWine‘s desk."
  ]
}