{
  "id": 171,
  "mediaId": 8379,
  "date": "2022-02-24",
  "headline": "Ohio Redistricting Commission set to propose state legislative maps",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/01/536a6e22f71f416a8fb7ece1725d6901.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/ohio-redistricting-commission-set-to-propose-state-legislative-maps/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karina Cheung",
  "authorUrl": "https://www.nbc4i.com/author/karina-cheung/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Believe it comports with everything in the constitution and the dictates that the court has given us so at the point in time at 6 o’clock after the request three-hour break, I’ll present that and talk in detail,” said Senate President Matt Huffman.",
    "Senator Vernon Sykes said this before recess, “Indicated I thought it was distasteful I thought at least the public should be given at least one day notice – in accordance with our open meetings law.”\nThe commission is in recess until 6 p.m.",
    "Mike DeWine, will appear before the Ohio Supreme Court Tuesday at 10 a.m. to explain to the justices why they shouldn’t be held in contempt of court for failing to meet the deadline.",
    "He said all five of the Republican commissioners have reviewed the map — which would dictate the districts for representation in the Ohio General Assembly — and made suggestions.",
    "COLUMBUS, Ohio (WCMH) — The Ohio Redistricting Commission plans to propose state legislative maps tonight after missing its court-appointed deadline last week.",
    "Senate President Matt Huffman announced the Republicans have maps that they’d like to present tonight when the commission reconvenes at 6 p.m.",
    "The commission met this afternoon and hosted public comment as part of its duties to draft a Congressional map for federal representation.",
    "This is being brought up again — a week past the deadline that the Ohio Supreme Court gave to this commission to adopt legislative maps.",
    "President Huffman announced at the tail end of the meeting that Republican commissioners have legislative maps ready to go.",
    "The two Democrats on the commission said they have not seen this map yet and are reviewing it now.",
    "It is expected that this map will be voted on tonight.",
    "This commission, including Gov."
  ]
}