{
  "id": 17102,
  "mediaId": 8323,
  "date": "2022-02-28",
  "headline": "FedEx, UPS to suspend shipments in and out Russia, Ukraine",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2021/04/AP21118474540253.jpg?w=1280",
  "link": "https://fox8.com/news/russia-ukraine-conflict/fedex-ups-to-suspend-shipments-in-and-out-russia-ukraine/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessica Bates",
  "authorUrl": "https://fox8.com/author/jessicabatesfox8/",
  "termIds": [
    1161,
    419,
    487,
    1421,
    6672,
    6569
  ],
  "sentences": [
    "According to their website, due to the situation in Ukraine, the following UPS services have been temporarily suspended:\nAll shipping services to, from and within Ukraine impacting collections and deliveries (February 24 until further notice)\nInternational shipments to destination addresses in Russia (Effective February 25 until further notice)\nOver the weekend, Ohio Gov.",
    "In a statement from DeWine’s office, the Ohio Division of Liquor Control estimates there are approximately 6,400 bottles of vodka made by Russian Standard currently on sale in the state’s 487 liquor stores.",
    "Mike DeWine, and other states, issued an order for the state to stop buying and selling vodka made by a Russian-owned distillery after the country invaded Ukraine.",
    "The state said other brands of vodka, even those with Russian names, are bought by the state from distilleries outside of Russia.",
    "(WJW) Less than a week after Russia invaded Ukraine, more fallout continues regarding services from multiple companies.",
    "FedEx and the United Parcel Service (UPS) are the latest companies to announce they are adjusting their availability.",
    "FedEX noted on their website, they are not providing services in and out of Ukraine until further notice.",
    "Russian Standard vodka is sold under the brand names Green Mark Vodka and Russian Standard Vodka.",
    "The United Parcel Service (UPS) is also adjusting its services.",
    "Shipments already in transit will be temporarily held."
  ]
}