{
  "id": 17154,
  "mediaId": 8497,
  "date": "2022-03-01",
  "headline": "Kroger pulls Russian-produced vodka from shelves in solidarity with Ukraine",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/kroger-png-1570072295.png?crop=1.00xw:0.994xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/kroger-russian-vodka-shelves-ukraine/39284401",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    2143,
    699,
    419,
    1161,
    959,
    5988,
    6060,
    6569,
    6672,
    6474
  ],
  "sentences": [
    "Over the weekend, we removed Russian-produced vodka from our shelves, and today, we are sending emergency food assistance to support refugees through a grant\n— Kroger News (@KrogerNews) March 1, 2022\nThe announcement comes shortly after Ohio Gov.",
    "The Ohio Division of Liquor Control (DOLC), a division of the Ohio Department of Commerce, estimates that there are approximately 6,400 bottles of vodka made by Russian Standard currently for sale in Ohio's 487 liquor agencies across the state.",
    "Ukraine's flag will also fly at the Ohio Statehouse in Columbus and at the Governor's Residence in Bexley to further show support for those under attack in Ukraine and for Ohio's Ukrainian population.",
    "The Cincinnati-based grocery chain announced that over the weekend they removed Russian-produced vodka and are sending emergency food assistance to support refugees.",
    "On Saturday, DeWine directed the Ohio Department of Commerce to cease both the purchase and sale of all vodka made by Russian Standard until further notice.",
    "All other brands of vodka that are sold in Ohio, including those branded with Russian names are purchased from distilleries not located in Russia.",
    "Zero Hunger | Zero Waste Foundation to the UN World Food Programme's Ukraine Emergency Fund will be providing a grant to send the food assistance.",
    "Mike DeWine has declared Sunday a statewide Day of Prayer for the people of Ukraine in response to Russia's unprovoked invasion of Ukraine.",
    "CINCINNATI —\nKroger has pulled all Russian-produced vodka from its shelves in solidarity with Ukraine, the grocer announced.",
    "You may be able to find the same content in another format, or you may be able to find more information, at their web site.",
    "The DOLC has directed these retailers to immediately pull Green Mark Vodka and Russian Standard Vodka from their shelves.",
    "Russian Standard's vodka is sold under the brand names of Green Mark Vodka and Russian Standard Vodka.",
    "They also said they will match all donations made by their associates and customers up to $250,000.",
    "As America’s grocer, we're taking action to show our support and solidarity with Ukraine ????.",
    "Related video above: Hundreds attend March for Ukraine in Cincinnati\nThe Kroger Co.",
    "This content is imported from Twitter."
  ]
}