{
  "id": 17174,
  "mediaId": 8507,
  "date": "2022-02-27",
  "headline": "Hunting season winds down as fishing begins to pick up in Ohio",
  "image": "https://www.gannett-cdn.com/presto/2022/02/25/NCOD/172d27ac-9c67-46b7-97b1-6cd42c539568-ducks.jpg?crop=2015,1134,x0,y186&width=2015&height=1134&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/sports/2022/02/27/what-outdoor-enthusiasts-need-know-month-march/6936787001/",
  "mediaOutlet": "zanesvilletimesrecorder.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Golowenski",
  "authorUrl": "",
  "termIds": [
    2143,
    5008,
    6077,
    6474,
    6241
  ],
  "sentences": [
    "… The American Kayaking Association in Franklin County and Adaptive Sports Connection in Delaware County were among 15 community boating safety education organizations that recently benefitted from grants awarded by the Ohio Division of Parks and Watercraft, receiving $21,858 and $29,989, respectively",
    "Special to The Columbus Dispatch\nMost people in Ohio aren’t likely to notice much difference outdoors just because of the flip of a calendar page, but Monday marks the last day of rabbit hunting season and Tuesday the first day of meteorological spring.",
    "Ohio taxpayers can help by donating all or a portion of their refund to the Wildlife Diversity Fund and/or to State Nature Preserves and Scenic Rivers by designating an amount on the appropriate line of the 2021 IT 1040 tax form.",
    "Stamp champ\nIndiana resident Jeff Klinefelter’s painting of three lesser scaup was chosen Feb 19 during the Ducks Unlimited state convention in Columbus as the best of six entries in the 2022 Ohio Wetlands Stamp Competition.",
    "Bunnies and many creatures nonetheless answer to a wake-up call set to go off in spring that nudges them toward an innate biological mandate to multiply for the benefit of the species and that of others.",
    "Bunnies, unbeknownst to them, will no longer be legal human targets as of Tuesday, but that doesn’t change their status as something to catch and eat for coyotes, hawks, owls and cats.",
    "Anglers can get a little more serious in March with steelhead running in northeastern Lake Erie streams, walleye heading up the Maumee River and warming coves inviting inland fish.",
    "“These tax-deductible donations help … (make) the state’s natural resources available to all Ohioans,” said Mary Mertz, director of the Ohio Department of Natural Resources.",
    "Revenues from the stamp, which are also bought by collectors and birdwatchers, have generated $10.9 million since 1982 for wetlands conservation in the state.",
    "Parting shots\nA total of 86 acres has been added to North Turkeyfoot Wildlife Area, located on what was formerly Great Black Swamp landscape in Henry County.",
    "Fishers who have persisted in renewing by that scrapped schedule need to make sure they’ve paid the state its modest tribute before venturing out.",
    "In a few northwestern counties along Lake Erie trapping for mink, muskrat, raccoon, opossum, skunk and weasel remains legal through March 15.",
    "Money from donations has supported the reintroductions of species, including lake sturgeon, mussels, trumpeter swans and hellbenders.",
    "Donations have also helped support access projects at 140 state nature preserves and 15 scenic rivers.",
    "Tax relief\nConservation efforts in the state have ramped up during the administration of Gov.",
    "Monday marks the last day statewide that trappers can legally take a river otter or a beaver.",
    "Hunting doesn’t altogether end in March, though there is very little the game allowable .",
    "The last day of February for a long time marked the end of Ohio’s fishing license year.",
    "A $15 annual stamp purchase is required of waterfowl hunters in Ohio age 18 and older.",
    "It's the last day for a mink or muskrat in most of the state, including central Ohio.",
    "A rendering of the painting will appear on the 2023 Ohio Wetlands Stamp.",
    "Rabbit hunting belongs to fall and winter, renewal and growth to spring.",
    "Klinefelter is a six-time winner of the annual competition.",
    "Next up is wild turkey season in parts of April and May.",
    "Nonetheless, a need remains.",
    "Mike DeWine."
  ]
}