{
  "id": 17173,
  "mediaId": 8496,
  "date": "2022-02-27",
  "headline": "'We fight for Ukraine': US Sen. Rob Portman, Rep. Marcy Kaptur attend prayer service and rally for country in Parma",
  "image": "https://media.wkyc.com/assets/WKYC/images/b8d10274-2490-4377-8cf7-afc65bf69f64/b8d10274-2490-4377-8cf7-afc65bf69f64_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/nation-world/ukraine/rob-portman-prayer-service-rally-ukraine-parma/95-f2b03cc7-0403-4782-9a00-6e81ef07e9dd",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5408,
    5186,
    4591,
    2736,
    1197,
    6502,
    6672,
    6569
  ],
  "sentences": [
    "Rob Portman both gave remarks at the event this afternoon, expressing their solidarity with the area's large Ukrainian population and pledging to do what they could to support the nation's efforts against Russian aggression.",
    "PARMA, Ohio — Members of Northeast Ohio's large Ukrainian community gathered at St. Vladimir Ukrainian Orthodox Cathedral in Parma for a prayer service and rally Sunday following Russia's invasion of the country.",
    "Northeast Ohio's entire congressional delegation did the same, with Kaptur stating that, \"The great conflicts of the past have taught us that [Russian President Vladimir] Putin's aggression cannot be tolerated.\"",
    "Following Russia's initial strikes, Portman joined his Democratic Senate colleague Sherrod Brown in condemning the attack, calling it \"illegal\" and \"unprovoked.\"",
    "\"When the Ukrainian people stood up to a corrupt Russian-backed government eight years ago, they thought they were charting a course to freedom from Russia.",
    "While Kaptur expressed understanding for his sentiments, she also indicated her belief that could spark an even more catastrophic conflict.",
    "\"Today and this past week, no matter what our backgrounds, we are all Ukrainians,\" he declared, something Portman himself would later say.",
    "The Republican Portman is currently co-chair of the Senate Ukraine Caucus, while Kaptur holds the same position in the House.",
    "During her remarks, Kaptur was interrupted by a protestor calling for American troops to be sent directly to Ukraine.",
    "The governor pledged to stand with the state's Ukrainian population, which numbers some 80,000 people.",
    "Mike DeWine was also in Parma for a prayer service at St. Andrew Ukrainian Catholic Church.",
    "And now we see the atrocity that is going on as Russia attempts to change history.\"",
    "Want to be among the first to know the most important local and national news?",
    "\"We fight for Ukraine, when and wherever we can,\" Portman told parishioners.",
    "They were joined by two of the state's most powerful political figures.",
    "\"We don't want nuclear war,\" the congresswoman cautioned.",
    "Download the free WKYC app today: Android, Apple.",
    "U.S. Rep. Marcy Kaptur and U.S. Sen.",
    "Earlier Sunday, Ohio Gov."
  ]
}