{
  "id": 17224,
  "mediaId": 8491,
  "date": "2022-03-03",
  "headline": "Gov. DeWine signs order ending Ohio investments, purchases from Russia",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/03/Intel-Newark-DeWine-6.jpg?w=1280",
  "link": "https://www.wkbn.com/news/ohio/gov-dewine-signs-order-ending-ohio-investments-purchases-from-russia/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Clark",
  "authorUrl": "https://www.nbc4i.com/author/joe-clark/",
  "termIds": [
    2143,
    3235,
    6077,
    6474,
    6569
  ],
  "sentences": [
    "All state agency procurement officers have specific standard contract language that prohibits the purchases of services from or investments in Russian institutions or companies and that all quotations, statements of work, and other proposals for services affirm they are in compliance with this order.",
    "The order also states:\nAll state agencies, boards and commissions, state educational institutions, and pension funds, to the extent practicable, divest any investment in and terminate any contracts with a Russian institution or company.",
    "A release from the governor’s office states that Executive Order 22-02D will prohibit Ohio from providing finances that might aid Russia in violating the rights of the Ukrainian people.",
    "On Wednesday, Attorney General Dave Yost sent a letter asking Ohio’s public employee pension boards to pull all Russian-based investments from their portfolios.",
    "Mike DeWine announced Thursday he had signed an executive order that prohibits the state from investment or purchasing activity from aiding Russia.",
    "DeWine has already ordered the state to stop buying and selling vodka made by a Russian-owned distillery after the country invaded Ukraine.",
    "This is in addition to existing Executive Order 2019-12D which generally prohibits the purchase of offshore services by the State of Ohio.",
    "COLUMBUS, Ohio (WCMH) — Gov."
  ]
}