{
  "id": 1724,
  "mediaId": 8379,
  "date": "2022-02-17",
  "headline": "Ohio Redistricting Commission fails to produce legislative map before court-ordered deadline",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/01/536a6e22f71f416a8fb7ece1725d6901.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/ohio-redistricting-commission-fails-to-produce-legislative-map-before-court-ordered-deadline/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karina Cheung",
  "authorUrl": "https://www.nbc4i.com/author/karina-cheung/",
  "termIds": [
    0
  ],
  "sentences": [
    "“If there’s some ideas to come forward to help develop a legislative district map that we can send to the court that we think meets what they’re looking for — if we can figure out what they’re looking for — we’d work very hard to produce that.”\nAs the map’s future lies in the hands of the Ohio Supreme Court, the League of Women Voters of Ohio — a group that’s been at the forefront of lawsuits challenging previously-proposed maps — said the fight is not over.",
    "“Let’s see what the Ohio Supreme Court does, but we of course will be filing our objections saying it is 100 percent possible to make a map that works for the people of Ohio,” Jen Miller, executive director of the League of Women Voters of Ohio, said.",
    "LaRose, who’s also a member of the commission, said the state is dangerously close to breaking federal law when it comes to the May election, as the deadline to mail ballots to military members is coming up in a matter of weeks.",
    "“I don’t think that’s an option the law gives us.”\nThe fate of the state’s legislative maps is now up to the Ohio Supreme Court, a waiting game that Ohio Secretary of State Frank LaRose said leaves him with deep concern.",
    "Despite an Ohio Supreme Court-ordered deadline for state lawmakers to approve a map outlining state legislative districts by 11:59 p.m. Thursday, the Redistricting Commission failed to reach a consensus.",
    "Although the commission said it reached an impasse and could no longer work to devise more legislative map proposals after four hours of the meeting, DeWine said he’s not sure it’s possible to stop.",
    "In the first meeting since the commission was ordered to redraw its maps, the seven-member commission voted 5-2 on party lines to reject the Democratic commissioners’ proposed drawings.",
    "Auditor Keith Faber proposed a rule change to allow three commissioners to call for a meeting — rather than leaving it up to the co-chairs of the commission to make that decision.",
    "“We now have an obligation under the law to give them a third map, so I think it is a mistake for this commission to stop and basically say we’re at an impasse,” DeWine said.",
    "Although Republicans questioned several aspects of the Democratic-proposed maps for the first hour of the meeting, they themselves did not present a map to the commission.",
    "COLUMBUS, Ohio (WCMH) — The Ohio Redistricting Commission met hours before their deadline Thursday to push through legislative maps for a third time — but, to no avail.",
    "Sen. Vernon Sykes, one of two Democrats on the commission who introduced the map in question, condemned Republican cries of unconstitutionality as mere accusations.",
    "The Ohio Supreme Court has ruled that the commission is to take into account the voter preferences of Ohioan when drawing the maps.",
    "“The truth is, we have not seen a map that’s been produced — that after it’s been analyzed — follows the Constitution,” Gov.",
    "“We will try to keep working,” House Speaker Bob Cupp said.",
    "That make up is 54% Republican and 46% Democrat.",
    "Mike DeWine, who sits on the commission, said."
  ]
}