{
  "id": 17319,
  "mediaId": 8497,
  "date": "2022-02-28",
  "headline": "'An unprecedented opportunity in history': Two governors unite to build new Ohio River bridge",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/brent-spence-1618223984.png?crop=0.845xw:1.00xh;0.0785xw,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/an-unprecedented-opportunity-in-history-two-governors-unite-to-build-new-ohio-river-bridge/39270446",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Hamrick",
  "authorUrl": "https://www.wlwt.com/news-team/b7c4f745-61dd-495c-a5a1-a42c1a8f9b11",
  "termIds": [
    0
  ],
  "sentences": [
    "“Everybody knows there’s money at the federal government for projects like this, but we’re not going to get a penny of it unless there are days like this where the two states show that they’re working together.”\nBoth governors hope to get through the application process by this fall and break ground on the project by next year.",
    "CINCINNATI —\nTwo governors from two different political parties are coming together for what they’re calling an historic agreement that they hope will get a new bridge built over the Ohio River in Cincinnati without tolls.",
    "“Let’s put it like this, this is the biggest thing that has happened to this project in the last two decades,” said Ohio, Kentucky and Indiana Council of Governments executive director Mark Polcinski.",
    "The governors signed the agreement that basically tells the federal government that they are on the same page in the effort to construct a companion to the Brent Spence bridge.",
    "“With today’s signing, the commonwealth of Kentucky and the state of Ohio are aligning our efforts to make this project a reality,” said Kentucky Democratic Gov.",
    "“This is really an unprecedented opportunity in history,” said Ohio Republican Gov.",
    "It is considered one of the most congested bottlenecks in the country.",
    "Each state is working to secure $1 billon of the funds.",
    "The Brent Spence bridge merges I-75 and I-71.",
    "The cost of a new bridge is $2.8 billion.",
    "Andy Beshear.",
    "Mike DeWine."
  ]
}