{
  "id": 17327,
  "mediaId": 8507,
  "date": "2022-03-01",
  "headline": "Rittberger will use state grant to upgrade equipment",
  "image": "https://www.gannett-cdn.com/presto/2022/02/24/PZAN/70ca6dd3-976c-443e-b94e-32ea4b4f2e69-zan_rittberger_grant.jpg?crop=4547,2558,x0,y277&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.zanesvilletimesrecorder.com/story/news/local/2022/03/01/rittberger-use-state-grant-upgrade-equipment/6879707001/",
  "mediaOutlet": "zanesvilletimesrecorder.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Crook",
  "authorUrl": "https://www.zanesvilletimesrecorder.com/staff/4395824002/chris-crook/",
  "termIds": [
    4547,
    4246,
    6747,
    6474
  ],
  "sentences": [
    "The company was awarded nearly $250,000 through the Ohio Meat Processing Grant Program, which Ohio Gov.Mike DeWine said would help \"Ohio businesses enhance their operations to strengthen the local meat supply chain and reduce reliance on out-of-state processors.\"",
    "The company will use the fund to purchase three new pieces of equipment, Rittberger President Andy Rittberger said, including a hulking machine used for mixing sausage ingredients the company bought used in 1965.",
    "Once the third-largest hog processor in the state of Ohio, the company has been buffeted by the winds of globalization, as multinational meat processors pushed out smaller companies, Rittberger said.",
    "ZANESVILLE — Carl Rittberger Sr. company has weathered the Great Depression, wars and globalization, and a grant from the State of Ohio will help keep the long-time Zanesville staple moving forward.",
    "The grants were for up to $250,000, with half of the funding used to start projects, and the second awarded after companies submit proof the first batch of funds were spent appropriately.",
    "The same supply chain woes that have made finding the spices the company uses for it's popular spiced loaf and garlic bologna difficult has made it hard to source new equipment promptly.",
    "It has been able to survive because of a swing back to locally-produced foods, and diversifying, including a popular wedding and event space, the Scale Haus, in a former barn.",
    "Prior to the COVID-19 pandemic, the machine could be replaced for about $250,000, Rittberger said he expects the price has risen since.",
    "Rittberger was one of 40 meat processors across the state awarded the grant, which is required to be used for processing equipment.",
    "Rittberger recently announced they will become an outlet for Crooked Creek Cattle Company's Wagyu beef.",
    "Another thing Rittberger credits for the company's survival is Rittberger North Market in Zanesville.",
    "The store provides a retail space for the company's products and other other local producers.",
    "It will be modeled after the company's Zanesville store, but will also have a patio area.",
    "The new machines will be more efficient and have improved safety features, he said.",
    "Rittberger said it would likely be months before all of the equipment arrived.",
    "Company will open a second location in Buckeye Lake soon, Rittberger said.",
    "They are hoping to open by summer."
  ]
}