{
  "id": 17414,
  "mediaId": 8498,
  "date": "2022-03-02",
  "headline": "No Opening Day at Ohio’s MLB ballparks, but the minor leagues will still play ball",
  "image": "https://woub.org/wp-content/uploads/2022/03/shutterstock_486746077-e1646244028427.jpg",
  "link": "https://woub.org/2022/03/02/no-opening-day-at-ohios-mlb-ballparks-but-the-minor-leagues-will-still-play-ball/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Kasler | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/karen-kasler-statehouse-news-bureau/",
  "termIds": [
    0
  ],
  "sentences": [
    "“So my understanding is all Ohio minor league teams will be starting the season on the date that they’ve set.”\nDeWine said the delayed start will hurt the small businesses and vendors near Progressive Field in Cleveland and Great American Ball Park in Cincinnati.",
    "< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — While the major leagues won’t be playing ball on Opening Day March 31 because talks have broken down between the MLB and the players association, there is some good news for baseball fans.",
    "The Findlay Market opening day parade in Cincinnati, which usually brings in thousands and has been cancelled for the last two years, has been postponed.",
    "DeWine said while it’s disappointing major league teams won’t start on time, he says Ohio’s five minor league baseball teams should be playing in April.",
    "Mike DeWine is a longtime Cincinnati Reds fan and his family has owned the Houston Astros’ North Carolina affiliate the Ashville Tourists for 12 years.",
    "The Akron Rubber Ducks and the Lake County Captains also start that day away, with their home openers set for April 12.",
    "The Columbus Clippers start that day as well, but on the road, and come back for their home opener April 12.",
    "And until they have a major league contract, they can certainly play in the minor leagues,” DeWine said.",
    "“They have players who are not in collective bargaining; they’re not in the union.",
    "As of now, the Toledo Mud Hens will host their home opener on April 5.",
    "There will be baseball in Ohio in the early spring.",
    "The Dayton Dragons start at home on April 8.",
    "Gov."
  ]
}