{
  "id": 17458,
  "mediaId": 8494,
  "date": "2022-03-01",
  "headline": "Groups file objections to new Ohio House, Senate maps as contempt hearing is delayed",
  "image": "https://npr.brightspotcdn.com/dims4/default/dac6173/2147483647/strip/true/crop/3680x1932+0+414/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Fd1%2Fe3%2Fb288fe554538b1bed4310ff6be30%2Fimg-3468.jpg",
  "link": "https://www.wksu.org/government-politics/2022-03-01/groups-file-objections-to-new-ohio-house-senate-maps-as-contempt-hearing-is-delayed",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Justice Sharon Kennedy wrote in a dissent to the order to call the hearing: \"The chief justice, acting alone, does not have the authority to reject the answers filed by respondents, the Ohio Redistricting Commission and the commission members, to the show-cause orders in these cases and order the commission members to appear in person.",
    "Kennedy writes in her dissent that Chief Justice Maureen O'Connor called for the contempt hearing and that \"The chief justice, acting alone, does not have the authority to reject the answers filed by respondents\" but needs three more judges to issue that order.",
    "The groups also want the court to declare the maps from Stanford Professor Jonathan Rodden filed in the initial case in December are constitutional, but stopped short of asking for the court to implement them.",
    "The court has also delayed Tuesday’s contempt of court hearing for the Ohio Redistricting Commission while it looks at the new maps the panel passed last week and the filings in the case.",
    "— Karen Kasler (@karenkasler) February 25, 2022\nJustice Pat Fischer also said he would be writing a dissent, but it hasn't been published to the court's website yet.",
    "It can’t require the adoption of a particular map and that may seem like a very thin distinction,\" Steinglass said in an interview for \"The State of Ohio.\"",
    "But the secretary of state has ordered boards of elections to start preparing May 3 primary ballots with candidates for the districts on those maps.",
    "\"Nothing in the Ohio Constitution grants the chief justice of this court authority to rule on motions on behalf of the full court,\" Kennedy wrote.",
    "The Ohio Supreme Court still has to sign off on the House and Senate maps passed last week by the Ohio Redistricting Commission.",
    "of State Frank LaRose, who was among four Republicans voting for those maps, can’t use those maps for the May 3 primary.",
    "Cleveland State Marshall College of Law Dean Emeritus Steven Steinglass says that’s not possible.",
    "Mike DeWine, could face individual consequences as a member of the Ohio Redistricting Commission.",
    "That got a response from the voting advocacy groups that filed the lawsuits over the maps.",
    "Justice Pat DeWine has recused himself from contempt proceedings since his father, Gov.",
    "Rather, such orders require the assent of at least three other justices of this court.\"",
    "The groups want the court to rule those maps invalid, but also to say Sec.",
    "So he can't be called to vote on whether there should be a hearing.",
    "And Kennedy said O'Connor didn't call for a vote of the court.",
    "But there was a dispute among the justices about that hearing.",
    "“I don't think you can order the implementation of a map.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau."
  ]
}