{
  "id": 17461,
  "mediaId": 8487,
  "date": "2022-03-02",
  "headline": "Judge blocks Ohio abortion rules that clinics call harmful",
  "image": "https://whiznews.com/wp-content/uploads/2018/07/cropped-WHIZ_for_web-2-1.png",
  "link": "https://whiznews.com/2022/03/02/judge-blocks-ohio-abortion-rules-that-clinics-call-harmful/",
  "mediaOutlet": "whiznews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://whiznews.com/author/associatedpress/",
  "termIds": [
    0
  ],
  "sentences": [
    "Huffman has called the bill “another step in our continued commitment to uphold the sanctity of human life.”\nOhio Right to Life, the state’s oldest and largest anti-abortion group, calls the new law “anti-infanticide.”\nThe U.S. Supreme Court currently has before it an abortion case from Mississippi, in which the court’s conservative majority signaled in December they might limit abortion rights and could even overrule Roe v. Wade and Planned Parenthood v. Casey, the landmark cases declaring a nationwide right to an abortion.",
    "Amy Gilbert, staff attorney for the ACLU of Ohio, has called that “piling yet another medically unnecessary, arbitrary and onerous requirement on abortion facilities in an attempt to put abortion out of reach for Ohioans.”\nBoth Women’s Med in Dayton and Planned Parenthood of Southwest Ohio in suburban Cincinnati operate under state variances that include partnerships with several doctors.",
    "COLUMBUS, Ohio (AP) — An Ohio judge has blocked preemptive enforcement of a law imposing additional requirements on consulting physicians at abortion clinics — requirements that abortion providers say threaten operations at two of the last clinics in the state.",
    "While the bill’s stated goal was to impose criminal penalties on doctors who fail to provide life-saving measures in rare instances where abortion attempts are unsuccessful, it also included additional restrictions on clinic operations.",
    "Mike DeWine in December, adds restrictions that say qualifying doctors may not work for or be affiliated with a medical school or osteopathic medical school at a public college or university, including as a professor or instructor.",
    "Facilities that face undue hardship striking such an agreement can get a variance from the state by signing an agreement for medical back-up with a local doctor who has admitting privileges at a hospital within 25 miles.",
    "Planned Parenthood has described the law as another in a series of TRAP laws, or “targeted restrictions on abortion providers,” aimed to eventually make abortion unavailable.",
    "In Wednesday’s ruling, Hamilton County Common Pleas Judge Alison Hatheway barred the Ohio Department of Health from enforcing the law before it takes effect March 23.",
    "The ACLU and two southwest Ohio clinics argue that compliance with the law will be onerous and impede Ohio women’s access to their right to an abortion.",
    "Under Ohio law, all ambulatory surgical facilities must have a written transfer agreement with a local hospital in case of emergency.",
    "A hearing on whether the law will be blocked after that date, while a legal challenge proceeds, is scheduled for March 16.",
    "If that happens, each state would determine abortion rights for its residents.",
    "Terry Johnson, a retired doctor, and Steve Huffman, a practicing physician.",
    "That’s the part that threatens the two clinics in southwest Ohio.",
    "Some are affiliated with medical schools at public universities.",
    "Abortions remain constitutionally protected for now.",
    "The bill was sponsored by Republican state Sens.",
    "The latest bill, signed by Republican Gov."
  ]
}