{
  "id": 17480,
  "mediaId": 8384,
  "date": "2022-03-01",
  "headline": "Ohio, Kentucky want $2B from infrastructure act for bridge",
  "image": "https://www.news-herald.com/wp-content/uploads/2022/03/Infrastructure-Notorious_Bridge_73952.jpg?w=1024&h=576",
  "link": "https://www.news-herald.com/2022/03/01/ohio-kentucky-want-2b-from-infrastructure-act-for-bridge/",
  "mediaOutlet": "news-herald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.news-herald.com/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "By JOHN SEEWER\nOhio and Kentucky want the federal government to spend $2 billion from the bipartisan infrastructure deal to build a new Ohio River bridge and to fix an existing outdated span that has long been the source of frustration for commuters and politicians, their governors said Monday.",
    "The Federal Highway Administration declared the bridge functionally obsolete in the 1990s because its narrow lanes carry more cars than it was designed for — the 160,000 vehicles it now sees daily is double than what was intended.",
    "Overhauling the Brent Spence Bridge, which connects Cincinnati with northern Kentucky, was a big selling point for President Joe Biden during the debate over the federal infrastructure legislation.",
    "Beshear, a Democrat, and DeWine, a Republican running for reelection this year, steered clear of politics while saying both states were ready to begin working on the overhaul.",
    "Governors from both states on Monday signed an agreement to work together to overhaul the bridge and to seek funding from the $1 trillion infrastructure package.",
    "He touted the project in July at a CNN town hall in Cincinnati, vowing his administration would “fix that damn bridge of yours” if the legislation passed.",
    "Mike DeWine said the two states can make a strong case for getting funding for the project, which is estimated to cost $2.8 billion.",
    "The bridge in downtown Cincinnati has become a bottleneck on a heavily used freight route that connects the Midwest and the South.",
    "Just before signing the bill last November, Biden said he expected that the bridge would finally get funding.",
    "The two states would share in picking up the rest of the tab, but pledged not to include tolls on motorists.",
    "Its traffic woes have been a symbol of the nation’s growing infrastructure needs for decades.",
    "“This project is the poster child for the federal infrastructure act,” said Kentucky Gov.",
    "“We all understand the national significance of this bridge,” DeWine said.",
    "“I know its aggressive, but we’ve waited too long,” he said.",
    "Beshear said he hopes they can break ground next year.",
    "Andy Beshear.",
    "Ohio Gov."
  ]
}