{
  "id": 17484,
  "mediaId": 2543,
  "date": "2022-03-03",
  "headline": "Renowned New York Restaurant Blasted for Russian Connections, Owners Take Matter Into Own Hands",
  "image": "https://www.westernjournal.com/wp-content/uploads/2022/03/Russian-Tea-Room.jpg",
  "link": "https://www.westernjournal.com/renowned-new-york-restaurant-blasted-russian-connections-owners-take-matter-hands/",
  "mediaOutlet": "Conservative Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Warner Todd Huston",
  "authorUrl": "https://www.westernjournal.com/author/igcolonel/ ",
  "termIds": [
    0
  ],
  "sentences": [
    "The establishment has appeared on film and TV, too, including “When Harry Met Sally,” “Big” and “Tootsie” along with several “Friends” episodes and episodes of “The Nanny,” “Gossip Girl” and “Saturday Night Live.”\nBut the New York Post reported Tuesday that the Tea Room has been nearly empty since Putin’s invasion of Ukraine.",
    "“Just as the original founders, Soviet defectors who were displaced by the revolution, stood against Stalin’s Soviet Union.”\nThe Tea Room concluded by saying, “We stand against Putin and with the people of Ukraine.”\nThe restaurant isn’t alone in being targeted for Putin’s actions.",
    "Famed New York City restaurant the Russian Tea Room is suddenly falling on hard times because of its connection to Russia, with customers avoiding the place in droves since Vladimir Putin launched his invasion of neighboring Ukraine last month.",
    "Bill McCormick, owner of Pine Tavern in Bend, Oregon, made a point of announcing that he destroyed every drop of Russian vodka in his bar, an act that cost him $200 in inventory, according to KPTV-TV reported.",
    "Cris Sununu took things to another level, signing an executive order instructing state-controlled liquor stores to remove Russian-made and -branded products from the shelves until further notice.",
    "This morning I signed an Executive Order instructing @nhliquorwine outlets to begin removing Russian-made and Russian-branded spirits from our liquor and wine outlets until further notice.",
    "The restaurant tried to remind customers that its founders and later owners have always renounced Russia’s crimes against humanity going back to its condemnation of Soviet communism.",
    "The restaurant became the haunt of many celebrities, including Frank Sinatra, Raquel Welch and Liza Minelli, turning the Tea Room into an iconic Manhattan eatery.",
    "Opened in 1927 by a group of former members of the Russian Imperial Ballet, the establishment quickly became a gathering place for Russian expatriates.",
    "“For 95 years, the NY institution’s history has been deeply rooted in speaking against communist dictatorship and for democracy,” the restaurant said.",
    "It has been so bad that during a recent three-hour lunch period, the restaurant had only 16 customers when it usually has many times that.",
    "Jacob Liquor Exchange of Wichita, Kansas, Bob’s Bar in Grand Rapids, Michigan, and other establishments have joined in on the boycott.",
    "Whether Russia is winning its war in Ukraine or not, one thing seems sure: It has become a pariah in most corners of the world.",
    "“The Russian Tea Room renounces Russia’s unprovoked acts of war on the strongest possible term,” it said in a statement.",
    "To bring customers back, the Tea Room is desperately trying to distance itself from Putin and his invasion of Ukraine.",
    "The Post also reported that some employees even found threatening messages on their personal social media accounts.",
    "Russian products — or at least products associated with the former communist nation — are also finding tough times.",
    "The restaurant’s owners are desperate to let customers know that they do not support Putin’s warmongering.",
    "Some bars, restaurants and liquor stores are taking Russian vodkas off the shelves, for instance.",
    "Mike DeWine made a similar move for state-operated liquor stores in the Buckeye State.",
    "The establishment took to social media on Monday with a campaign to change minds.",
    "New Hampshire stands with the people of Ukraine in their fight for freedom.",
    "— Chris Sununu (@GovChrisSununu) February 26, 2022\nOhio Gov.",
    "But it also attracted the rich and the famous.",
    "And he is far from alone.",
    "New Hampshire Gov.",
    "????"
  ]
}