{
  "id": 17489,
  "mediaId": 8496,
  "date": "2022-02-28",
  "headline": "Columbus Public Health recommends lifting mask requirement on March 7",
  "image": "https://media.wkyc.com/assets/WBNS/images/b6a6408a-15d3-4d94-aa38-ce3e18aeae7d/b6a6408a-15d3-4d94-aa38-ce3e18aeae7d_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/columbus-leaders-announce-end-to-mask-mandate/530-d7b70670-4306-42d0-aebb-5235bed4fdb3",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“It is time to turn our efforts to minimizing the impact COVID-19 has on our health, our healthcare systems and our community, while focusing our efforts on protecting those who are most at risk of severe illness.”\nCity Council members in both Columbus and Worthington would need to remove the mandates through legislative action and by an executive order from the Mayor's Office.",
    "According to a release from the health department, the week-out date was chosen to give public and private entities time to adjust their mask policies as well as to ensure the current case and hospitalization trends continue.",
    "Last week, the CDC announced updated guidance to masking policies, adding they will no longer be required on school buses; a development officials said was made to align with updated masking guidance in K-12 schools.",
    "\"With decreasing case numbers and hospitalizations in Franklin County and across Ohio, we should feel good about where we are in this pandemic, but still vigilant,\" said Council President Shannon G. Hardin.",
    "Currently, Franklin County falls into the medium level of community transmission, according to calculations from the CDC, which states masks are not required for counties in that category.",
    "The recommendation was made to align with recently updated guidance from the Centers for Disease Control and Prevention, which states most healthy Americans no longer need to mask up.",
    "Statewide hospitalizations peaked in early January and have gradually declined ever since Ohio Department of Health Director Dr. Bruce Vanderhoff said in a recent press briefing.",
    "Timeline of mask mandates in Ohio:\nGovernor Mike DeWine issued the state's first-ever mask mandate in April of 2020, changing his mind one day later.",
    "“The pandemic is not over, but the situation has changed, and we are in a new phase,” said Columbus Health Commissioner Dr. Mysheika Roberts.",
    "Columbus City Schools School Board President Jennifer Adair said at city council there could be an update on CCS's mask policy on Tuesday.",
    "COLUMBUS, Ohio — Columbus Public Health is recommending city leaders in Columbus and Worthington wait until March 7 to end mask mandates.",
    "Columbus City Council announced they are planning to vote to lift the mask mandate during its regularly scheduled meeting on March 7.",
    "Columbus City Council passed an ordinance on Sept. 13, 2021, requiring both vaccinated and unvaccinated people to wear masks.",
    "The recommendation was made to align with recently updated guidance from the Centers for Disease Control and Prevention.",
    "Following an end to the statewide mandate, county, city and school leaders were tasked with putting mandates in place.",
    "\"If you're not vaccinated, please do so as soon as you can, and let's all move our community ahead of this COVID-era.\"",
    "\"People looked at this and they said 'That's one government mandate too far,'\" DeWine said at the time.",
    "As of last Thursday, statewide cases have dropped by more than 90% since reaching an omicron peak.",
    "That July, state officials issued a county-based mask mandate determined by risk levels.",
    "That mandate lasted nearly one year before DeWine declared its end in May 2021.",
    "At the time, Franklin County was averaging 493 cases per day.",
    "Two weeks later, the entire state was ordered to wear masks."
  ]
}