{
  "id": 17513,
  "mediaId": 8494,
  "date": "2022-03-04",
  "headline": "Redistricting officials argue for and against Ohio's legislative maps in court filings",
  "image": "https://npr.brightspotcdn.com/dims4/default/36811ae/2147483647/strip/true/crop/4032x2117+0+80/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2F23%2Fec%2F1216352f49eba7448956e94490c1%2Fimg-3655.JPG",
  "link": "https://www.wksu.org/government-politics/2022-03-04/redistricting-officials-argue-for-and-against-ohios-legislative-maps-in-court-filings",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow",
  "authorUrl": "https://www.wksu.org/people/andy-chow",
  "termIds": [
    0
  ],
  "sentences": [
    "\"This marks the third attempt by the Republican commissioners to advance a patently unconstitutional redistricting plan that would enable Republicans to maintain a stranglehold on the Ohio Senate and House of Representatives,\" wrote C. Benjamin Cooper, attorney for Russo and Sykes.",
    "In their court filing, Russo and Sykes are calling on the court to invalidate the Republican-drawn map, rule the Democratic-drawn map as constitutional, or appoint a special master of the court to prepare a constitutional plan.",
    "Voter rights advocates, community organizations, and a national Democratic group raised objections to the new Republican-drawn House and Senate maps, which is dubbed as the \"Third Plan\" in court filings.",
    "\"Rather than concede the constitutionality of the Third Plan, petitioners lurch in the direction of constitutional crisis (and election chaos),\" wrote Phillip Strach, attorney for Cupp and Huffman.",
    "The response argues that the plaintiffs have changed their definition of a competitive district and adds that a previous Democratic-drawn map had the same amount of competitive districts.",
    "The court filings from Republican and Democratic commissioners are in response to the objections raised by plaintiffs against the state legislative maps passed Feb. 24.",
    "Democratic commissioners, House Minority Leader Allison Russo (D-Upper Arlington) and Sen. Vernon Sykes (D-Akron), filed responses in court siding with the plaintiffs.",
    "The new state legislative district maps create 54 Republican and 45 Democratic seats in the House and 18 Republican and 15 Democratic seats in the Senate.",
    "Attorneys of House Speaker Bob Cupp (R-Lima) and Senate President Matt Huffman (R-Lima) contend those objections \"moved the constitutional goalposts.\"",
    "They argued that a plan that creates more competitive districts for one party than another is a form of gerrymandering that unduly favors Republicans.",
    "Mike DeWine (R-Ohio), echoed the argument of Cupp and Huffman, saying the objections over symmetry is not found in the constitution or in Ohio law.",
    "Huffman says lawmakers do not plan to change the date of the primary unless the supreme court decides to invalidate the maps for a third time.",
    "The plaintiffs say the maps create more than a dozen competitive districts for Democrats and zero competitive districts for Republicans.",
    "of State Frank LaRose (R-Ohio), a redistricting commissioner, has said the ability to put on the primary May 3 is now up to the court.",
    "\"At this point, petitioners have no credible basis for objection,\" Little wrote.",
    "They say the competitive districts should be symmetrical for the parties.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "Attorney Marion Little, representing Gov.",
    "Sec."
  ]
}