{
  "id": 17673,
  "mediaId": 8291,
  "date": "2022-03-03",
  "headline": "Thu. 11:31 a.m.: Bill ending conceal carry permit mandate heads to governor",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/news/latest-news/2022/03/thu-1131-a-m-bill-ending-conceal-carry-permit-mandate-heads-to-governor/",
  "mediaOutlet": "content.tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "COLUMBUS (AP) — A concealed weapons permit would become optional and the requirement that individuals “promptly” notify police officers that they are carrying a concealed weapon would be eliminated under legislation approved along partisan lines by Ohio’s GOP-controlled Legislature and sent to Republican Gov.",
    "“Responsible gun owners should not be punished for lawfully practicing their constitutional rights.”\nGun owners could still apply for a concealed weapons permit under the legislation, allowing those who obtain it to carry a concealed weapon in states with reciprocity agreements recognizing such permits.",
    "“We are reviewing the bill, but I would note Governor DeWine has long supported the Second Amendment rights of law abiding citizens to keep and bear arms,” said spokesperson Dan Tierney\nThe measure is one of several GOP-backed proposals in recent years seeking to expand gun rights in Ohio.",
    "A last minute change to the bill clarified that people carrying weapons without a concealed carry permit still face the same disqualifications as those with permits, such as a ban on fugitives from justice, Gongwer News Service reported.",
    "A second change clarified that nothing in the law prevents police officers from briefly detaining individuals during investigations based on reasonable suspicion a crime has been committed, a provision known as a “Terry” stop.",
    "Sheriffs also denied licenses to 2,668 applicants who didn’t meet state-mandated requirements and revoked 420 licenses for issues including felony convictions and mental incompetence, as required by law, the report said.",
    "Last year, Ohio sheriffs issued 202,920 new or renewed conceal carry licenses, a 20 percent increase over 2020, the Ohio Attorney General’s Office said in an annual report released earlier this week.",
    "Gun control groups such as Moms Demand Action for Gun Sense in America oppose it, along with law enforcement groups concerned about the legislation’s lack of required training.",
    "“However, once an individual were to put on a sweatshirt or jacket without a concealed carry permit, they would be in violation of the law,” Johnson said.",
    "“This bill undermines commonsense safety measures and eliminates the need for concealed weapon training and safety standards,” House Democrats tweeted.",
    "The concept has the backing of the Buckeye Firearms Association, which says 21 other states allow people to carry a concealed weapon without a license.",
    "The bill, dubbed “Constitutional Carry” by its backers, was introduced by state Sen. Terry Johnson, a Republican from southern Ohio’s Scioto County.",
    "In encounters with police, the bill requires only that individuals confirm they are carrying a weapon if asked by an officer.",
    "Johnson says the bill eliminates discrepancy in Ohio law, which currently allows people to openly carry a gun.",
    "A governor’s spokesperson hinted that the measure, passed on Wednesday, would likely be signed into law.",
    "NEWSLETTER\nToday's breaking news and more in your inbox",
    "Mike DeWine."
  ]
}