{
  "id": 181,
  "mediaId": 8494,
  "date": "2022-02-26",
  "headline": "What it could mean if redistricting commissioners are found in contempt by the Ohio Supreme Court",
  "image": "https://npr.brightspotcdn.com/dims4/default/31c8ac4/2147483647/strip/true/crop/4928x2587+0+338/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Flegacy%2Fsites%2Fwcpn2%2Ffiles%2F202010%2Fsupreme_court_bench_3.jpg",
  "link": "https://www.wksu.org/government-politics/2022-02-26/what-it-could-mean-if-redistricting-commissioners-are-found-in-contempt-by-the-ohio-supreme-court",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“There are a lot of tools that the court has available in order to try to get to the end point, which, after all, is compliance with the state constitution, and, although it may sound a little rhetorical, compliance with the will of the voters,\" Steinglass said.",
    "Kennedy writes in her dissent that Chief Justice Maureen O'Connor called for the contempt hearing and that \"The chief justice, acting alone, does not have the authority to reject the answers filed by respondents\" but needs three more judges to issue that order.",
    "Justice Sharon Kennedy wrote in her dissent that she didn't think fellow Republican Chief Justice Maureen O'Connor had the authority to order a contempt hearing because such an order would require three of the other six justices to agree.",
    "The elected officials on the Ohio Redistricting Commission have a date in the Ohio Supreme Court Tuesday to explain why they shouldn’t be held in contempt for not passing state House and Senate maps by the Court’s deadline of Feb. 17.",
    "But he said he won't be recusing himself from the redistricting cases because he's said his father is just a single member of the Commission and has no personal stake in how the districts are drawn.",
    "Justice Pat DeWine said he's recusing himself from the contempt proceedings, which could impose sanctions on individual commission members, which include his father Gov.",
    "Fifth District Court of Appeals Judge W. Scott Gwin will sit in on the March 1 hearing for the Ohio Redistricting Commission in place of Justice DeWine.",
    "— Karen Kasler (@karenkasler) February 25, 2022\nKennedy is running for Chief Justice this year and will face Democratic Justice Jennifer Brunner.",
    "And I don't think any government official would want that kind of a blemish on their on their record,\" Steinglass said.",
    "But Steinglass said even if there’s no punishment, a finding of contempt against a public official is still important.",
    "“I think contempt against a public official is really by analogy, an example of professional governmental malpractice.",
    "In an interview for \"The State of Ohio,\" Steinglass said civil contempt is designed to force compliance with an order.",
    "Gwin last joined the Court last year for a case involving what was the state's largest online charter school, ECOT.",
    "O'Connor can't seek re-election because of the 70-year age limit on justices running for the Ohio Supreme Court.",
    "Steven Steinglass is dean emeritus of the Marshall College of Law at Cleveland State University.",
    "But two of the three Republican justices don't agree with holding the contempt hearing.",
    "Justice Pat Fischer also said he'd be writing a dissent, but it hasn't been posted yet.",
    "In this case, drawing maps within the court’s guidelines of what’s constitutional.",
    "DeWine has made in his response showing why he shouldn't be held in contempt.",
    "Interestingly, that echoes the argument that Gov.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "But he said jail and fines are possible.",
    "Mike DeWine."
  ]
}