{
  "id": 182,
  "mediaId": 8496,
  "date": "2022-02-24",
  "headline": "Cleveland Cavaliers announce plans for Caesars sportsbook at Rocket Mortgage FieldHouse",
  "image": "https://media.wkyc.com/assets/WKYC/images/4859ca68-1c83-4704-b6b9-a87b2357585e/4859ca68-1c83-4704-b6b9-a87b2357585e_1140x641.jpg",
  "link": "https://www.wkyc.com/article/sports/nba/cavaliers/rocket-mortgage-field-house-sportsbook-caesars-announcement-cavs/95-610e7d7b-eceb-4aaa-b30f-8414dd974b07",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Caesars Sportsbook at Rocket Mortgage FieldHouse will be a first-class venue providing an exciting atmosphere for sports betting and more.”\nPlans for the 10,355 square foot sportsbook include a full-service bar and VIP lounge, an extensive menu and wall-to-wall TVs.",
    "“We’re ready to welcome Ohio sports fans into the Caesars Sportsbook Empire, while also making history with our second sportsbook at an NBA arena,” Caesars Digital Co-President Chris Holdren said in a statement.",
    "“Building upon our already established roots with Scioto Downs in Columbus, we’re excited to announce our partnership with the Cavaliers at an exciting time in their franchise’s history.",
    "As we prepare to launch sports betting in Ohio later this year, this wide-ranging partnership enables us to connect with the Cavs passionate and highly engaged fanbase.",
    "On Thursday, the Cleveland Cavaliers announced a partnership with Caesars Entertainment, which includes plans for a retail sportsbook at Rocket Mortgage FieldHouse.",
    "Construction on the sportsbook, is expected to begin soon, with plans for it to be open by the end of 2022 subject to regulatory and other necessary approvals.",
    "But while gaming has yet to officially be implemented in Ohio, once it is, we now know where one of the most prominent sportsbooks in Cleveland will be.",
    "According to a release, the sportsbook will be located on the street level inside the northwest atrium area of the arena.",
    "Late last year, Ohio Governor Mike DeWine signed a bill legalizing sports gambling in the Buckeye State.",
    "CLEVELAND — Editor's note: the video in the player above is from a previous story.",
    "Sports betting in Ohio is expected to be implemented later this year.",
    "Costs for the improvements will be paid by the Cavaliers and Caesars."
  ]
}