{
  "id": 190,
  "mediaId": 8318,
  "date": "2022-02-21",
  "headline": "Ohio State Fair is back",
  "image": "https://s3-wp-lyleprintingandp.netdna-ssl.com/wp-content/uploads/2021/01/28170700/ride-3-e1611871653406.jpg",
  "link": "https://www.farmanddairy.com/news/ohio-state-fair-is-back/703887.html?utm_source=rss&utm_medium=rss&utm_campaign=ohio-state-fair-is-back",
  "mediaOutlet": "farmanddairy.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Other News",
  "authorUrl": "https://www.farmanddairy.com/author/othernews",
  "termIds": [
    0
  ],
  "sentences": [
    "Details\nMore Information on the 2022 Ohio State Fair admission and parking:\nHours of operation:\nMonday through Friday — 10 a.m. – 9 p.m.\nSaturday and Sunday* — 9 a.m. – 9 p.m.\n*Except Sunday, Aug. 7, when admission gates close at 6 p.m.\nGate admission prices:\nAdults (13-59) — $10\nYouth (6-12) — $8\nSenior (60+) — $8\nChildren 5 and under — free\nGeneral parking — Free\nEarly bird admission — $6 (valid May 1-31)\nAdvance admission — $8 (valid June 1-July 26 only)\nMidway ride-all-day wristbands — $25 each (through July 26 only)\nParking\nGeneral parking is free to fairgoers in the main lots north of the Cardinal Gate.",
    "Rides\nMidway hours:\nWednesday, July 27 — 11 a.m.-11 p.m.\nThursday, July 28 — 11 a.m.-11 p.m.\nFriday, July 29 — 11 a.m.-midnight\nSaturday, July 30 — 10 a.m.-11 p.m.\nSunday, July 31 — 10 a.m.-11 p.m.\nMonday, Aug. 1 — 11 a.m.-11 p.m.\nTuesday, Aug. 2 — 11 a.m.-11 p.m.\nWednesday, Aug. 3 — 10 a.m. – 11 p.m.\n**Sensory-friendly morning: Thursday, Aug. 4 — 11 a.m.-11 p.m.\nFriday, Aug. 5 — 11 a.m.-midnight\nSaturday, Aug. 6 — 10 a.m.-11 p.m.\nSunday, Aug. 7 — 10 a.m.-10 p.m.",
    "You’ll be able to walk through the barn, see the iconic butter cow, try some deep-fried food on a stick, listen to music, browse arts exhibitions, watch performances by the All-Ohio State Fair Band and Youth Choir, visit with Smokey Bear, learn about agriculture, and so much more.”\n2019 fair\nDuring the 2019 Ohio State Fair, 934,925 people attended during the event’s 12-day run.",
    "We have experienced so many remarkable moments with our children and grandchildren at fairs over the years, and this summer, we can’t wait to enjoy the Ohio State Fair once again.”\n“When we open our gates, people will be able to rediscover the Ohio State Fair,” said Strickler.",
    "The first big-name acts in this year’s Ohio State Fair Concert and Event Series will be announced by the Ohio Expo Center and State Fair, March 7, with additional announcements to follow, March 21 and April 4.",
    "Mike DeWine and Ohio Expo Center and State Fair General Manager Virgil Strickler announced that the 2022 Ohio State Fair will run from July 27 to Aug. 7.",
    "These attendees came from each of Ohio’s 88 counties, all 50 states, the District of Columbia, as well as Canada and Mexico.",
    "It’s a place where we can all celebrate our great state and make memories that will last a lifetime,” said DeWine.",
    "The Ohio State Fair plans to follow applicable state and local protocols related to the spread of COVID-19.",
    "“Fran and I absolutely love fairs, none more than the Ohio State Fair.",
    "Reserved parking is not available to the general public for purchase.",
    "“This summer, all of our fair favorites will return.",
    "“The Ohio State Fair brings people together.",
    "COLUMBUS — Ohio Gov."
  ]
}