{
  "id": 191,
  "mediaId": 8496,
  "date": "2022-02-26",
  "headline": "Cleveland's Russian Cultural Garden to remove Russian flag in protest of invasion of Ukraine",
  "image": "https://media.wkyc.com/assets/WKYC/images/a8d8cc4a-0d15-4cc9-ad52-3bdce90c2ec7/a8d8cc4a-0d15-4cc9-ad52-3bdce90c2ec7_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/cleveland/cleveland-russian-cultural-garden-to-remove-russian-flag-protest-invasion-of-ukraine/95-8562802f-e30c-41f8-b007-a0af73e6e872",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In a post on Facebook Friday, co-founder Dr. Boris Vinogradsky blasted Russian President Vladimir Putin and his government, adding those who run the garden \"don't want to be associated in any way with these criminals.\"",
    "Ever since its founding just four years ago, Cleveland's Russian Cultural Garden has been a source of pride for locals of Russian descent, showcasing the country's heritage through both nature and history.",
    "Ohio and Greater Cleveland are both home to a large Ukrainian and Eastern European population, and the response to the attack has been one of almost-universal condemnation.",
    "The garden's decision to remove its flag appears to be among the strongest evidence yet that the outrage crosses ethnic lines, including for those of Russian descent.",
    "Northeast Ohio's entire congressional delegation and both of its U.S. senators have expressed their anger at Russia's actions in Ukraine.",
    "Mike DeWine has also declared Sunday a statewide Day of Prayer and ordered all Russian vodka brands to be removed from store shelves.",
    "On Sunday afternoon, the garden will take down its Russian flag as an act of protest against the country's invasion of Ukraine.",
    "\"It's a humanitarian issue, and it's our moral imperative to condemn the war and preserve culture and peace.",
    "\"I understand that the Gardens are not about politics but this is more than politics,\" Vinogradsky wrote.",
    "Taking down the flag is the least we can do to demonstrate our support to Ukraine.\"",
    "The Russian Cultural Gardens will officially remove the flag at 2 p.m. tomorrow.",
    "CLEVELAND — *EDITOR'S NOTE: The above video is from a previous story.",
    "But as we've seen in recent days, everyone has their limits.",
    "Gov."
  ]
}