{
  "id": 1933,
  "mediaId": 8491,
  "date": "2022-02-08",
  "headline": "Gov. DeWine declares Sunday ‘Cincinnati Bengals Day’ in Ohio",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/02/GettyImages-1366329946.jpg?w=1280",
  "link": "https://www.wkbn.com/sports/gov-dewine-declares-sunday-cincinnati-bengals-day-in-ohio/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristine Varkony",
  "authorUrl": "https://www.nbc4i.com/author/kristine-varkony/",
  "termIds": [
    2143,
    4736,
    1295,
    689,
    731,
    707,
    275,
    6060,
    6474,
    6077
  ],
  "sentences": [
    "Governor Jon Husted and I encourage all Ohioans to wear orange and black and cheer on the Bengals as they play to win Ohio’s first Super Bowl championship!”\nThe full proclamation reads:\nIn the Name and by the Authority of The State of Ohio…\nWHEREAS, the Cincinnati Bengals finished che regular season I0-7 and were crowned Kings of the North, winning the AFC Norch title; and\nWHEREAS, the Bengals’ defense sealed a victory over the Las Vegas Raiders with a goal line interception in the final seconds of the Wild Card round, winning their first playoff game in 31 years; and\nWHEREAS, the Bengals showed why it’s important to draft a kicker when, as time expired, they booted a 52-yard field goal to lift the Bengals over the top-seeded Tennessee Titans 19-16, earning the franchise’s first road playoff victory; and\nWHEREAS, the Bengals’ offense lad the team back from a record-tying 18-point deficit to defeat the Kansas City Chiefs in overtime and win the AFC championship; and\nWHEREAS, on Sunday, February 13, 2022, the Cincinnati Bengals will play the Los Angeles Rams in Super Bow LV1; and\nNOW, THEREFORE, We, Mike DeWine and Jon Husted, Governor and Lieutenant Governor of the State of Ohio, do hereby declare Sunday, February 13, 2022,\nCINCINNATI BENGALS DAY\nthroughout the State of Ohio, and we encourage all Ohioans to wear orange and black and tune in and cheer on the Bengals as they play to win the state’s first Super Bowl championship and 10th NFL championship on this 8 day of February 2022.",
    "Governor Mike DeWine made the proclamation Tuesday saying, “Sunday has been declared Cincinnati Bengals Day in Ohio!",
    "COLUMBUS, Ohio (WCMH)– Super Bowl Sunday has officially been declared Cincinnati Bengals Day in Ohio.",
    "The Bengals meet the Los Angeles Rams at 6:30 p.m. Sunday at Sofi Stadium in Los Angeles.",
    "You can watch the game on NBC4.",
    "Ohio Lt."
  ]
}