{
  "id": 1991,
  "mediaId": 8413,
  "date": "2022-02-07",
  "headline": "Ohio Supreme Court again rejects legislative maps, sends redistricting commission back to drawing board",
  "image": "https://www.gannett-cdn.com/presto/2021/12/08/NCOD/cb181ea3-3fb4-4b91-9118-dece2c0b40de-Oral_Arguments_Redistricting_KWR_04.jpg?crop=2173,1223,x163,y0&width=2173&height=1223&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/02/07/ohio-supreme-court-rejects-statehouse-map-redistricting-commission-primary/9253196002/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Staver",
  "authorUrl": "https://www.dispatch.com/staff/5802228002/anna-staver/",
  "termIds": [
    0
  ],
  "sentences": [
    "Candidates have no specific direction regarding the districts for their campaigns and voters face the uncertainty of additional court ordered gerrymandering.”\nThe opinion noted that the commission's failure places pressure on election officials and said the Legislature can move the May 3 primary date if necessary.",
    "“It’s time for the Ohio Redistricting Commission to finally do their job: make maps that serve the people of Ohio rather than their own short sighted political interests,\" said Jen Miller of the League of Women Voters of Ohio, one of the plaintiffs in the case.",
    "Ohio redistricting: Groups that sued over rejected maps say new versions still violate Constitution\nMeanwhile, Ohio lawmakers and legislative candidates have been left to wonder when they'll know which residents they are running to represent.",
    "Jessie Balmert, Laura A. Bischoff and Anna Staver are reporters for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "The DeWine-Kennedy dissent lays out an argument Republicans have been pushing for weeks: They believe it's impossible to draw 45 Democratic districts while adhering to other constitutional requirements like compactness and continuity.",
    "For the second time, Chief Justice Maureen O'Connor, a Republican, joined with three Democratic justices to reject state House and Senate approved by Republicans on the Ohio Redistricting Commission over Democrats' objections.",
    "Democrats, according to the dissent, cluster in major metropolitan areas where they win by large margins \"while Republicans tend to be in more competitive districts in which Republican candidates win by smaller margins.\"",
    "The Ohio Supreme Court once again rejected legislative maps that Republicans drew to disproportionately favor their candidates, sending mapmakers back to the drawing board and Ohio's primary into massive uncertainty.",
    "In a dissent, Republicans Pat DeWine and Sharon Kennedy criticized their fellow justices, accusing them of commandeering the map process and holding out until they get what they want.",
    "But about a dozen House districts just barely cleared the threshold to be labeled Democratic districts, creating the appearance of proportionality without ceding many actual seats.",
    "After two rounds of mapmaking, the seven-member Ohio Redistricting Commission has proved incapable of working together to craft maps that pass constitutional muster.",
    "The other members include Ohio Secretary of State Frank LaRose, Auditor Keith Faber, House Speaker Bob Cupp and Senate President Matt Huffman, all Republicans.",
    "The court gave the commission until Feb. 17 to approve a new map that reflects the 54% Republican, 46% Democrat voting preferences split over the past decade.",
    "The uncertainty led legislators to tweak procedural election deadlines at the end of January but more wholesale changes might be needed going forward.",
    "There is a word for the action the majority has ordered the commission to undertake – gerrymandering,\" Kennedy and DeWine wrote.",
    "\"In today’s astonishing order, the majority compels the commission to design districts that guarantee Democratic victories.",
    "The majority opinion took Republican mapmakers to task for only trying to adjust the map that the court had invalidated.",
    "Ohio Senate GOP spokesman John Fortney said Ohio faces “a constitutional crisis and election system chaos.",
    "The maps could have given Republicans a 57-42 advantage in the House and a 20-13 advantage in the Senate.",
    "Our instruction to the commission is – simply – to comply with the Constitution,” the opinion said.",
    "“The revised plan does not attempt to closely correspond to that constitutionally defined ratio.",
    "The two Democrats on the panel are House Minority Leader Allison Russo and Sen. Vernon Sykes.",
    "And Democrats on the commission reported that they were left in the dark about the maps.",
    "The adjustments called for several \"Democratic leaning\" districts to be toss up seats.",
    "Mike DeWine, who is a member of the Ohio Redistricting Commission.",
    "Will the third time be the charm?",
    "Pat DeWine is the son of Gov.",
    "Read the full opinion below."
  ]
}