{
  "id": 2179,
  "mediaId": 8379,
  "date": "2022-02-07",
  "headline": "‘Burrow Oak State Park’: Three Ohio state parks renamed for Super Bowl-bound Bengals",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/02/Untitled-design.png?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/burrow-oak-state-park-three-ohio-state-parks-renamed-for-super-bowl-bound-bengals/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Orri Benatar",
  "authorUrl": "https://www.nbc4i.com/author/orri-benatar/",
  "termIds": [
    0
  ],
  "sentences": [
    "“The whole state will be rooting for Cincinnati on Sunday, and this is a fun way to show support for the orange and black.”\nThe other two state parks getting orange and black makeovers are Paint Creek State Park in Bainbridge, now called “Evan McPherson Extra Point Creek State Park” after the Bengals rookie kicker, and Hueston Woods State Park in College Corner, now dubbed “Ickey Woods State Park” after Cincinnati’s legendary running back.",
    "Burrow has been instrumental in Cincinnati’s run to an AFC Championship and will be looking to become the first quarterback in history to win a Heisman trophy, college national title, and Super Bowl.",
    "Mike DeWine has announced that three Ohio state parks will be temporarily renamed after Cincinnati Bengals players to honor the team’s upcoming Super Bowl appearance against the Los Angeles Rams.",
    "DeWine and Ohio Department of Natural Resources Director Mary Mertz has renamed Burr Oak State Park in Glouster to “Burrow Oak State Park” after the Bengals quarterback Joe Burrow.",
    "“We are incredibly proud of the Bengals and everything they have accomplished this season,” DeWine said.",
    "The locations of the new Bengals park name signs will be announced by ODNR once they are in place.",
    "The Bengals and Rams face off in Super Bowl LVI on Sunday from Los Angeles exclusively on NBC4.",
    "COLUMBUS, Ohio (WCMH) — Gov."
  ]
}