{
  "id": 2185,
  "mediaId": 8463,
  "date": "2022-02-05",
  "headline": "Turnpike to add gateless E-ZPass lanes for smoother drive",
  "image": "https://www.gannett-cdn.com/presto/2022/01/24/PFRE/7e299a92-1bbd-4e4c-918d-360f9ae5861a-ohio_turnpike_1.jpg?crop=399,225,x0,y60&width=399&height=225&format=pjpg&auto=webp",
  "link": "https://www.thenews-messenger.com/story/news/2022/02/05/turnpike-add-gateless-e-zpass-lanes-open-road-tolling-lantes/9298973002/",
  "mediaOutlet": "thenews-messenger.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "News-Messenger/News Herald",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Other TCS modernization projects include infrastructure upgrades for new tolling equipment at all interchanges from Toll Plaza 52 to Toll Plaza 209; constructing an additional toll plaza lane at Toll Plaza 64 (Wood County) and Toll Plaza 152 (Lorain County); and construction of automatic traffic recorders and weigh-in motion systems at various locations throughout the turnpike.",
    "“The senator and his peers in the Ohio Legislature answered the public’s call in near-unanimous support of this important step in modernizing the Ohio Turnpike’s toll collection system.”\nThe turnpike’s modernization plan includes the construction of three new toll plazas and one toll plaza renovation with state-of-the-art highway speed E-ZPass lanes.",
    "“The new open road tolling system is expected to debut with all gates removed for E-ZPass customers in spring 2023.”\nSystem will use license plate lookup\nUnder the new law (Senate Bill 162), the commission will work with the Ohio Bureau of Motor Vehicles to require vehicle owners to pay their delinquent tolls before they can register their vehicle.",
    "“Our customers’ request to build a modern toll system on the Ohio Turnpike was heard loud and clear,” said Ferzan Ahmed, executive director of the turnpike commission, referring to its strategic plan that included survey of nearly 14,000 Ohio E-ZPass customers, AAA members and the public.",
    "The operational savings is a result of the reduction of toll plazas from 31 to 24; the addition of automatic toll payment machines at all toll plazas; the elimination of toll gates on all entry lanes; and a projected increase in E-ZPass usage.",
    "USA Today Network\nBEREA — A new state law permits the Ohio Turnpike and Infrastructure Commission to collect toll fees from non-E-ZPass customers who drive through its gateless E-ZPass lanes without paying.",
    "Senate Bill 162 — sponsored by Sen. Bill Reineke (R-Tiffin), who also serves as a turnpike commission member — passed last month in the Senate and House by votes of 31-0 and 95-1, respectively.",
    "Switch to new Customer Service Center was a milestone\nLast year, the migration to the new E-ZPass Customer Service Center system was a significant milestone in the TCS modernization efforts.",
    "The first new toll plaza at milepost 49 in Swanton (Fulton/Lucas counties), which was completed in 2021, will be used for testing various components of the new system in 2022.",
    "The other new toll plaza locations under construction include Westgate Toll Plaza at milepost 4 in Edon (Williams County) and milepost 211 in Newton Falls (Trumbull County).",
    "The existing Eastgate Toll Plaza at milepost 239 in Springfield Township (Mahoning County) will be substantially renovated as part of the modernized system in 2023.",
    "This system manages the accounts of Ohio’s E-ZPass customers and exchanges information with other tolling authorities to make electronic tolling possible.",
    "The system will photograph license plates and send a bill to customers who travel through ungated E-ZPass lanes without a valid E-ZPass transponder.",
    "Removing the gates is part of the Ohio Turnpike’s new Toll Collection System (TCS), which includes open road tolling lanes.",
    "The new law also protects customers’ confidential information and establishes an appeals process for turnpike customers.",
    "Motorists will be able to travel the full length of the Ohio Turnpike nonstop in all E-ZPass lanes at highway speeds.",
    "Reineke’s work on this legislation is to be commended,” said Jerry Hruby, chairman of the turnpike commission.",
    "The total capital investment to implement the new TCS is expected to cost between $204 and $232 million.",
    "Customers without an E-ZPass will have the option to take a ticket and pay using cash or a credit card.",
    "The new TCS is expected to save about $257 million in operating costs over 30 years.",
    "When fully implemented the TCS will process unpaid tolls using license plate lookup.",
    "The bill was signed into law by Gov.",
    "Mike DeWine on Dec. 22.",
    "“Sen."
  ]
}