{
  "id": 227,
  "mediaId": 8363,
  "date": "2022-02-23",
  "headline": "Shelby school year to end a week early due to construction",
  "image": "https://www.gannett-cdn.com/presto/2022/02/23/PMAN/053a45a5-bb89-4eef-8faa-a07be2577b45-IMG_5767.JPG?crop=3263,1836,x0,y301&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/02/23/shelby-city-schools-release-students-early-summer-break/6894489001/",
  "mediaOutlet": "mansfieldnewsjournal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Caudill",
  "authorUrl": "https://www.mansfieldnewsjournal.com/staff/4395513002/mark-caudill/",
  "termIds": [
    0
  ],
  "sentences": [
    "Further, the Ohio Dyslexia Committee is requiring educators to complete 18 hours of professional development, designed to help them identify characteristics of dyslexia and understand how to instruct students with or at risk of dyslexia.",
    "\"While constructing and moving into a new building is an exciting opportunity for students, staff and the community, the district certainly hopes that the calendar change does not create any hardships for families,\" Tarvin said.",
    "As for the new athletic complex, which is scheduled to be ready for the upcoming football season, Harvey said the football, baseball and softball scoreboards are up, along with the home bleachers at the football stadium.",
    "Building project moving at fast pace\nDuring Tuesday's meeting, building and grounds supervisor Scott Harvey gave board members an update on the construction project.",
    "\"The construction schedule also calls for the middle school to be abated and the two-story academic wing to be demolished beginning the week of May 30,\" Tarvin said.",
    "New K-8 building is on track to open Sept. 6\nSHELBY — Construction of the pre-K-8 building has caused Shelby City Schools to change its end-of-the-year schedule.",
    "Board members get update on state's dyslexia law\nIn his curriculum update, Assistant Superintendent Paul Walker gave board members notice of Ohio's dyslexia law.",
    "Dyslexia is a specific learning disorder that is neurological in origin and is characterized by unexpected difficulties with accurate or fluent word recognition.",
    "More:Shelby breaks ground on new pre-K-8 school building\nSuperintendent Tim Tarvin explained the change at Tuesday's school board meeting.",
    "The timeline is as follows:\n• By the beginning of the 2023-24 school year for all licensed kindergarten and first-grade teachers.",
    "He said the new $38.5 million school building is on track to be completed for the beginning of the next school year on Sept. 6.",
    "Districts must administer a universal screener to all students in grades K-3 after Jan. 1, 2023, but before Jan. 1, 2024.",
    "\"What's more, Auburn and Dowds elementary schools are slated to be turned over to their new owners early in June.\"",
    "They can do the same for students in grades 4-6 if requested by a parent or teacher, with parental consent.",
    "Districts also must establish a multidisciplinary team to administer screening and intervention measures.",
    "Adams, Albert & Curry, along with Buckeye Chrysler Jeep Dodge, contributed $5,000 each for the press box.",
    "\"In my 14 years (on the board), I've never been to a meeting where we didn't have at least one donation.",
    "• By the beginning of the 2024-25 school year for all licensed second- and third-grade teachers.",
    "\"In the last few weeks, they've really picked up the pace,\" he said of the construction crew.",
    "Mike DeWine signed a set of laws strengthening dyslexia supports for the state's children.",
    "• By the beginning of the 2025-26 school year for intervention specialists in grades 4-12.",
    "AMC Masonry Contractors has donated I beam steel for the scoreboards, a $15,000 value.",
    "\"Please know that the decision to alter the school calendar was not taken lightly.\"",
    "ArcelorMittal contributed $50,000 for the press box canopy and fieldhouse sign.",
    "\"I always get nervous about teachers being pulled from classrooms,\" White said.",
    "In addition, the 1998 Shelby football team donated $6,600 for the fieldhouse.",
    "In relation to the athletic complex, the board accepted numerous donations.",
    "The calendar will be posted on social media and in a district newsletter.",
    "\"This is something that you're going to hear a lot about,\" Walker said.",
    "District officials moved up the timeline a full year on the project.",
    "\"It's going to be tight, tight, tight,\" Harvey said of the schedule.",
    "The last day for students had been scheduled for Thursday, May 26.",
    "\"How is that negatively affecting what's ultimately happening?\"",
    "OmniSource added a $1,500 donation for the fieldhouse sign.",
    "The calendar change affects only students, not staff.",
    "He said work would continue during the track season.",
    "The new football field will be inside the track.",
    "It's amazing,\" board President Lorie White said.",
    "Staff must get rooms packed up by May 27.",
    "\"There's stuff happening everywhere.\"",
    "\"This isn't all special education.\"",
    "mcaudill@gannett.com\n419-521-7219",
    "It now will be Friday, May 20.",
    "Last month, Gov."
  ]
}