{
  "id": 2306,
  "mediaId": 8455,
  "date": "2022-02-07",
  "headline": "U.S. Senate, Ohio governor debates set for March",
  "image": "https://www.toledoblade.com/image/2022/01/31/600x_q90_a4-3_cTCjpg/Intel-Plant-Ohio-18.jpg",
  "link": "https://www.toledoblade.com/local/politics/2022/02/07/governor-u-s-senate-debates-set-for-march/stories/20220207091",
  "mediaOutlet": "The Toledo Blade",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“That fact these debates will be held on the campus of a [historically black college of university] speaks volumes to the value of these institution,” said Eddie Harrell, Jr., debate commission board member and regional vice president of Radio One [Ohio Markets].",
    "“Furthermore, this partnership illustrates ODC's commitment to making sure all communities in Oho are informed and engaged in the electoral process.”\nThe debates will take place in the university's 1,000-seat Paul Robeson Cultural and Performing Arts Center.",
    "Seeking the Democratic nomination are U.S. Rep. Tim Ryan, consumer protection attorney Morgan Harper, information technology executive Traci Johnson, and former Franklin County Jobs and Family Services employee LaShonda Tinsley.",
    "Rob Portman include state Sen. Matt Dolan (R., Chagrin Falls), businessman Mike Gibbons, former Ohio Treasurer Josh Mandel, former Ohio Republican Party Chairman Jane Timken, author J.D.",
    "COLUMBUS — Official debates for candidates for U.S. Senate and Ohio governor have been confirmed for March 28 and 29, respectively, at Central State University in Wilberforce.",
    "Mike DeWine for the Republican nomination are former state Rep. Ron Hood, former U.S. Rep. Jim Renacci, and cattle farmer Joe Blystone.",
    "The debate commission is a nonpartisan collaboration of civic organizations, media, and universities started in 2018.",
    "The debates, arranged by the Ohio Debate Commission, will be made available for broadcast and live-streaming.",
    "On the Democratic side are two former mayors, Cincinnati's John Cranley and Dayton's Nan Whaley.",
    "The candidates for the Republican nomination to replace retiring U.S. Sen.",
    "Vance, businessman Neil Patel, businessman Mark Pukita, and Bill Graham.",
    "Details on format, tickets, and moderators are still to come.",
    "First Published February 7, 2022, 7:30am",
    "Social distancing will be employed.",
    "Challenging Gov."
  ]
}