{
  "id": 2340,
  "mediaId": 8496,
  "date": "2022-02-10",
  "headline": "Ohio's child behavioral health system is at a 'breaking point'",
  "image": "https://media.wkyc.com/assets/WBNS/images/c798309c-d0ac-4dbb-82d2-ecb07a17eeb0/c798309c-d0ac-4dbb-82d2-ecb07a17eeb0_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/health/mental-health-ohio-child-behavioral-health-system-at-a-breaking-point/530-1ce016b5-b745-4ffe-9c50-6c2cbd34acf6",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Landers",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Over the biennium, we have provided $15.7 million to expand this certification program and have funded the certification of 121 full-time counselors/consultants and 7 master trainers.”\nThe state says early childhood intervention to catch mental health illnesses in children is working based on screening tests that show:\n38% of students were screened for depression\n34% substance abuse\n28% trauma\n41% suicide screening\nIn March 2020, Nationwide Children's Hospital opened the Big Lots Behavioral Health Pavilion, making it the largest behavioral treatment and research center in the United States.",
    "During the webinars, mental health insurance experts will explain how the department regulates mental health and substance use disorder insurance benefits, help consumers and healthcare professionals determine the benefits in a health plan and provide a tutorial about the mental health and substance use disorder insurance benefits tools and resources on the department's website, including how to file a complaint and appeal a denied claim.",
    "“Results showed that suicide in children is most often associated with mental health concerns, prior suicidal behavior, trauma — including abuse or neglect, exposure to domestic violence, suicide or the death of a family member — or peer, school or family-related problems.”\nChild psychotherapist Kristen Santel runs one of the few child therapy offices in the city.",
    "According to this white paper, written by the Ohio Council on Behavioral Health and Family Service Providers, the lack of therapists in Ohio has created “a perfect storm that jeopardizes behavioral health care providers' ability to respond.” The report raised serious concerns about the rates of child suicide in Ohio.",
    "Delaware-Morrow Mental Health and Recovery Services Board: 740-368-1740\nPaint Valley ADAMH Board (Fayette, Highland, Pickaway, Pike and Ross Counties): 740-773-2283\nFairfield County ADAMH Board: 740-654-0829\nNationwide Children’s Hospital and Franklin County Youth Psychiatric Crisis Line: 614-722-1800.",
    "“Despite in 2008 passing the mental health parity law and patient equity act which was supposed to bring reimbursement for mental health care services parity with other traditional health care services that is not being adequately enforced,” he said.",
    "The Mental Health Parity and Addiction Equity Act was enacted in 2008 and requires insurance coverage for mental health conditions, including substance use disorders, to be no more restrictive than insurance coverage for other medical conditions.",
    "They contract with local community mental health and substance use disorder prevention, treatment, recovery support and harm reduction service providers to help ensure access to a full continuum of behavioral health services across the lifespan.",
    "“Suicide is the eighth leading cause of death among youth aged 5 to 11 in the United States, and suicide rates in this age group increased nearly 15% annually between 2012 and 2017,” according to the Centers for Disease Control and Prevention.",
    "Waiting six months to a year for a child to see a mental health professional for ADHD, anxiety, depression or suicidal thoughts in Ohio is “unacceptable for sure,” says the Director of Ohio’s Mental Health and Addiction Services Lori Criss.",
    "The Ohio Department of Insurance is hosting free, live webinars in February to help consumers and healthcare professionals understand mental health and substance use disorder insurance benefits, director Judith L. French announced.",
    "Governor DeWine has also expanded the Infant & Early Childhood Mental Health Consultation Program to provide a pipeline of workers specially trained to address the unique mental health needs of Ohio’s youngest residents.",
    "“If someone were to email today it would probably be a year before I could see their kid, says Danielle Weatherholtz who is one of the few people in Columbus that works with children as young as 3 years old.",
    "Suicide was the second leading cause of death among Ohioans between the ages of 10 and 34 years and the 11th leading cause of death overall.”\nThose statistics mirror what is happening across the country.",
    "“If we had more staff we would open more beds,” says Dr. David Axelson, Chief of the Department of Psychiatry and Medical Director of the Big Lots Behavioral Pavilion at Nationwide Children’s Hospital.",
    "“It gets progressively worse because as she is supposed to be maturing and fitting into societal norms that child is not doing that so there are more and more disappointments every day,” she said.",
    "County ADAMH Board Directory: Ohio’s 50 county Alcohol, Drug Addiction and Mental Health Services (ADAMHS) Boards serve as the local planning authorities for community behavioral health services.",
    "Weatherholtz: No, and I hear that from families all the time, but they just got this new building I just hear they increased all these services and I called them and it said 6 months to a year.",
    "She says it wasn't until she had to call the police, because she couldn't control her daughter, that she says she was able to move up on the waiting list at Nationwide Children’s Hospital.",
    "Below are some red flags that parents can look out for:\nDirector Criss says the state is working on a plan to help retain and grow the workforce in the field of child mental health.",
    "“It’s truly at a breaking point in terms of the sheer numbers of people who cannot get access to care,” says Jared Skilings of the American Psychological Association.",
    "“It's a crisis consultation over the phone then links to other services and supports,” said Lori Criss, the director of Ohio Mental Health and Addiction Services.",
    "A new federal law mandates that, as of July 16, every state must have a call system for people to seek immediate help for mental health or substance use crises.",
    "The number of children seeking help for depression, anxiety, and suicide is overwhelming the system because there are not enough therapists to treat them.",
    "Fast forward two years later, the head of the department says the unit has expanded from 44 beds to 56 beds and it can't find enough workers to add more.",
    "“We just never end up getting paid for things no matter how many times we spend on the phone no matter how many times we resubmit claims,” Santel said.",
    "A spokesperson for Governor Mike DeWine said, “When he took office, less than 40% of childcare providers receiving public funding were quality rated.",
    "Lisa Denino of Columbus has seen firsthand what it is like to be placed on hold as she struggled to find a mental health therapist for her daughter.",
    "Her daughter was adopted from Russia and at 3 years old she says her daughter began expressing behaviors that she knew immediately were not normal.",
    "“Nobody wanted to work with a toddler and insurance wasn't going to cover it anyway and nobody believed me until they saw the video,” she said.",
    "That means each provider had to meet a set of standards to provide for the academic success, as well as the health and well-being, of our kids.",
    "Inside Kirsten Santel’s practice in Columbus, which specializes in child therapy, therapists say wait times are longer than they've ever been.",
    "Those who work in child therapy say insurance companies like Medicare haven't raised their reimbursement levels to keep up with inflation.",
    "Like many professional therapists in central Ohio thought Children's Hospital's Behavioral Center would help absorb more kids in need.",
    "“The proposal we put together with the department of Medicaid calls for 200 million dollars that comes from the federal government.",
    "The 988 system is a dedicated call-in line for dispatching trained staff to respond to mental health and substance use emergencies.",
    "“Insurance reimbursement through Medicaid is maybe half of what I would make if people were private paying,” says Jordan-Frias.",
    "That’s despite the fact that over the past three years Ohio has dedicated more than $1.2 billion for student wellness.",
    "More than 75% of the counties in Ohio have what's called mental health HPSA’s or Health Professional Shortage Areas.",
    "A skilled professional is available 24/7 for families and can support/triage them to the appropriate level of care.",
    "If you can not find help right away, you can contact the National Suicide Prevention Lifeline at the number below.",
    "As a result, more therapists are dropping insurance coverage and only accepting those who can pay out of pocket.",
    "“We get requests for services seven to 10 times a day for new clients that we just can't support,” Santel said.",
    "Mental health professionals across Ohio and across the country say their profession is at a \"breaking point.\"",
    "Denino says it took her three years on a waiting list to find a child therapist to work with her daughter.",
    "Michelle Jordan-Frias, a social worker and child therapist, said it's heartbreaking to tell a parent no.",
    "The Boards receive allocations from OhioMHAS, federal funding and, in many areas, local levy dollars.",
    "They weren't the terrible twos or anything that other moms I spoke to were familiar with,” she said.",
    "“The waitlists for mental health clinicians across the whole country are absolutely out of control.\"",
    "That is one-time funding that we believe can be invested in growing this workforce,” Criss said.",
    "As for Lisa Denino, she says she feels lucky she found a therapist that's helping her daughter.",
    "If long wait times and a lack of child therapists weren't bad enough, there’s another problem.",
    "Before the pandemic, most of the therapists in the practice say wait times were a few months.",
    "But without more people to care for those kids, he says, he's worried about what will happen.",
    "According to the Kaiser Family Foundation, Ohio has 116 HPSA’s meeting just 38% of the need.",
    "“In Ohio, there was a 27.4% increase in the number of suicide deaths between 2010 and 2019.",
    "Denino: Was my child going to have a police record before any therapist would talk to her?",
    "Others are leaving the industry which further limits the number of children who need help.",
    "“Depression and anxiety have increased significantly in our kids,” said Dr. Axeslon.",
    "“Some of the prioritized kids will get in in three or four days,” said Dr. Axelson.",
    "The result,\n“People will get sicker and mental health will get worse,” Santel said.",
    "He says the problem with child behavioral health started long before the pandemic.",
    "Surgeon General Vivek H. Murthy believe the law is being carried out as intended.",
    "She says her office is constantly getting requests from parents looking for help.",
    "“Some of our programs the waits are several months some of the not so as long.\"",
    "“We are probably four times lower than what we truly need,” said Dr. Axelson.",
    "Landers: Even if you could double your staff could you still meet the demand?",
    "“Around three she started to display really behaviors that were not typical.",
    "However, research on suicide deaths among this age range has been limited.",
    "Franklin County ADAMHS serves Greater Columbus and all of Franklin County.",
    "“Wait times are the longest they've ever been in my practice,\" he said.",
    "Ohio Crisis Text Line: Text Keyword 4HOPE to 741 741 | More info here.",
    "Additional resources\nOhio CareLine: 1.800.720.9616 | More info here.",
    "Crisis counselors are standing by 24 hours a day, seven days a week.",
    "The state would need 111 health care providers to meet the demand.",
    "Denino says she desperately tried to find help for her daughter.",
    "She showed us the video of her daughter on the floor screaming.",
    "Within 20 months, all publicly funded providers were rated.",
    "Landers: So, it didn't provide the relief you were hoping?",
    "Turning parents away, they say, has always been an issue.",
    "Ohio is working to get the new phone line up and running.",
    "These are areas where no child health counselor exists.",
    "Even children who express suicidal thoughts must wait.",
    "we could not meet the demand if we tripled our staff.",
    "Now, it's happening more often because of the demand.",
    "Landers: What is it like for you to tell a parent no?",
    "The waiting, she says, just made her child worse.",
    "We just don't have that many saints,” she says.",
    "But few in the industry including the U.S.",
    "She just wishes there were more of them.",
    "He says Ohio lacks child psychiatrists.",
    "“Basically, they are saints on earth.",
    "Landers: So what does that tell you?",
    "The pandemic just exasperated it.",
    "That's insane.",
    "Santel: No."
  ]
}