{
  "id": 2498,
  "mediaId": 6571,
  "date": "2022-02-09",
  "headline": "Peloton Abandons Plans To Open Ohio Factory That Would've Employed Thousands",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/02/09/f62e9ad1-63ea-4b5e-8d5b-4e825155eb37/thumbnail/1200x630/0eca74ec36af40b1a918ba7731021f8b/GettyImages-1238297090.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/ohio-peloton-factory-canceled/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2143,
    4057,
    673,
    6474,
    6723,
    6731,
    6660
  ],
  "sentences": [
    "TOLEDO, Ohio (AP) — Peloton has abandoned plans to open its first U.S. factory, which would have employed 2,000 workers in Ohio, the home fitness equipment maker said Tuesday as it announced a major restructuring.",
    "But demand for its interactive bikes and treadmills quickly dropped off as more people returned to the gym and competition increased from other exercise equipment makers and gyms offering virtual classes.",
    "The company added to its manufacturing capacity at the end of 2020 with the acquisition of Precor, a maker of fitness machines with facilities in Whitsett, North Carolina, and Woodinville, Washington.",
    "Peloton's move was disappointing, but the site will be attractive for future use, said J.P. Nauseef, president of JobsOhio, the state's privatized economic development office.",
    "Peloton said Tuesday that it was cutting 2,800 jobs, many at its New York City headquarters, and that its co-founder was stepping down as chief executive.",
    "Construction already was underway on the factory near Toledo, which was designed to be a showplace for its products.",
    "The company broke ground just outside Toledo this past summer and had expected to begin production there in 2023.",
    "Peloton said it will finish work on the building's shell and sell it and the surrounding land.",
    "The project came with great promise as the pandemic was reshaping the fitness industry.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "The decision is a blow to state officials, including Republican Gov.",
    "Most of Peloton's high-end stationary bikes are made in Taiwan.",
    "Mike DeWine, who touted it as a big win.",
    "(Copyright 2022 The Associated Press.",
    "All rights reserved.",
    "In:\npeloton"
  ]
}