{
  "id": 2510,
  "mediaId": 2594,
  "date": "2022-02-08",
  "headline": "Peloton lays off 2,800 workers and offers them one-year subscription as severance",
  "image": "https://static.independent.co.uk/2021/08/09/15/Virus_Outbreak_Future_of_Fitness_16968.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/peloton-layoff-subscription-stock-bike-b2010437.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan Place",
  "authorUrl": "https://www.independent.co.uk/author/nathan-place",
  "termIds": [
    3667,
    1019,
    6474
  ],
  "sentences": [
    "“As part of this program, we’ve made the difficult decision to reduce the size of the Peloton team by approximately 2,800 positions globally.”\nThe former CEO – now Peloton’s “executive chair” – added that outgoing employees would receive a “meaningful cash severance allotment,” extended health coverage (“for a period of time”), career services, and a free year of Peloton’s live-streamed exercise classes.",
    "“However, as our post-COVID demand picture looks different than anticipated, these investments no longer align with how we intend to operate our business going forward.”\nAccordingly, Peloton is scrapping its plan to build a factory in Ohio, which would have been its first plant in the United States.",
    "“This appointment is the culmination of a months-long succession plan that I’ve been working on with our Board of Directors, and we are thrilled to have found in Barry the perfect leader for the next chapter of Peloton,” Mr Foley said.",
    "“I recently shared that we have been in the process of re-evaluating our costs across the entire organization to ensure we are appropriately structured for the post-COVID landscape,” Mr Foley wrote.",
    "John Foley, the exercise bike company’s co-founder, announced the layoffs on Tuesday in a bombshell message, in which he also said he’d be stepping down as CEO.",
    "“I look forward to working with him and invite you to welcome him with open arms.”\nThe 2,800 laid-off employees make up 20 per cent of Peloton’s workforce.",
    "“We navigated COVID-19 together, did our best to meet unprecedented demand, increased the size of our team, and grew our product portfolio,” he said.",
    "At the peak of the Covid-19 pandemic, Peloton’s sales skyrocketed as gyms closed and fitness fanatics found themselves trapped in their homes.",
    "But as the lockdowns have loosened, Peloton’s profits have taken a huge hit – since January 2021, the company’s stock has sunk by 80 per cent.",
    "Peloton has laid off 2,800 of its employees, and part of their severance is a 12-month subscription to the company’s fitness services.",
    "“The Peloton monthly membership will be complimentary for impacted team members for an additional 12 months,” he said.",
    "“Within manufacturing operations, we have decided to wind down our Peloton Output Park (POP) plan,” Mr Foley said.",
    "Replacing Mr Foley as CEO will be Barry McCarthy, the former chief financial officer of both Netflix and Spotify.",
    "For those in North America, Mr Foley said the “separation conversations” would begin immediately.",
    "Mr Foley acknowledged these challenges in his letter."
  ]
}