{
  "id": 2616,
  "mediaId": 8363,
  "date": "2022-02-04",
  "headline": "Business briefs: Local patent, federal contract, Rumpke recycling, BWC rate reduction",
  "image": "https://www.gannett-cdn.com/-mm-/d4eaed6aec50f036bc9845757aa8d530ff8579a6/c=0-65-300-234/local/-/media/2017/06/08/OHGroup/Mansfield/636325340634294239-BizBriefLogo.png?width=300&height=169&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/02/04/business-briefs-local-patent-federal-contract-rumpke-recycling-bwc/9283715002/",
  "mediaOutlet": "mansfieldnewsjournal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mansfield News Journal",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "BWC Board of Directors consider another rate reduction for private employers\nCOLUMBUS — Ohio’s private employers would pay nearly $106 million less in premiums compensation next fiscal year due to a 10% rate reduction proposed to the agency’s Board of Directors.",
    "The actual premium paid by individual private employers depends on several factors, including the expected future claims costs in their industry, their company’s recent claims history, and their participation in various BWC programs.",
    "Lexington company assigned a new patent\nLEXINGTON — Global Medical Foam of Lexington has been assigned a patent developed by Victoria A. Langer of Lexington for a \"scrotal edema pressure redistribution device.\"",
    "Galion company awarded federal contract\nGALION — Brothers Body & Equipment of Galion won a federal contract award Jan. 31 for $217,695 from the U.S. Army, Vicksburg, Mississippi, for a portable concrete mixer.",
    "Rumpke expands acceptable recycling items list\nCLEVELAND — Effective immediately, Rumpke Waste & Recycling will accept disposal plastic and aluminum cups in curbside and drop-box programs.",
    "If approved by the board at its Feb. 25 meeting, the rate reduction would be effective July 1 and private employers would pay close to $106 million less in this year’s premiums.",
    "Plastic cups processed at Rumpke’s recycling facilities will be used to make new plastic containers and aluminum cups will be made into aluminum cans.",
    "Overall, the average rate levels for the 249,000 private and public Ohio employers in the BWC system are at their lowest in at least 40 years.",
    "It also would follow a 10% rate reduction for public employers — counties, cities, schools and others — that went into effect Jan. 1.",
    "According to the patent application, scrotal swelling — also known as scrotal edema — is a serious condition and medical emergency.",
    "Scrotal edema can occur from a plethora of medical conditions, such as a twisted testicle, cancer, kidney failure, and hernias.",
    "These cups are made from polystyrene and Rumpke currently does not have a secure, long-term end user for this material.",
    "Recent innovations in plastic recycling resulted in commitments from end-users to accept and recycle more material.",
    "Examples of acceptable cups include plastic beverage cups from fast-food restaurants (Starbucks, McDonalds, etc.",
    "The proposed 10% rate cut represents an average statewide premium change including administrative costs.",
    "Advancements in plastic recycling have increased the demand for additional types of plastic products.",
    "The swelling may interrupt blood flow to the testicles and can lead to tissue death of the testicles.",
    "Additional guidelines include:\nPlastic lids should be reattached to plastic cups.",
    "If approved, the reduction would be the fourth straight reduction since Gov.",
    "In fact, they can be damaging to the glass recovery process.",
    "), plastic souvenir cups and Ball brand aluminum cups.",
    "For more information on recycling, visit rumpke.com.",
    "Colorful Solo brand cups are not accepted.",
    "Ceramic and glass cups are not accepted.",
    "Straws and stoppers are not accepted.",
    "Mike DeWine took office in 2019.",
    "K-cups are not accepted."
  ]
}