{
  "id": 2633,
  "mediaId": 2537,
  "date": "2022-02-09",
  "headline": "Ickey Woods invented the 'Ickey Shuffle.' Here's how to do it and Ja'Marr Chase's 'The Griddy'",
  "image": "https://www.gannett-cdn.com/presto/2022/01/23/PCIN/6d7c04f0-0378-4fff-ba31-8bf5cc8a2d0e-CINCpt_10-13-2013_Enquirer_1_I008__2013_10_11_IMG_ickey13_1_1_DN5CHRLS_L300951751_IMG_ickey13_1_1_DN5CHRLS.jpg?crop=1791,1008,x0,y143&width=1791&height=1008&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/sports/2022/02/09/ickey-woods-touchdown-dance-and-how-do-ickey-shuffle-jamarr-chase-griddy/6720968001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Harrington",
  "authorUrl": "https://www.caller.com/staff/5164631002/joe-harrington/",
  "termIds": [
    5719,
    1912,
    4740,
    4713,
    2539,
    2257,
    568,
    617,
    275,
    893
  ],
  "sentences": [
    "When he started catching touchdown passes from Joe Burrow for the Cincinnati Bengals, much like college, nothing was different except for the jersey,\nHow to do Ja'Marr Chase's 'The Griddy' touchdown dance\nHere you go:\nC.J.",
    "Ickey Woods has even judged 'Ickey Shuffle' contests\nJa'Marr Chase has 'The Griddy'\nWhen Ja'Marr Chase was catching touchdown passes from Joe Burrow at LSU, he dropped a trademark touchdown dance, \"The Griddy.\"",
    "Uzomah rips knee brace off at Bengals' Super Bowl rally at Paul Brown Stadium\nLike when Van Halen brought David Lee Roth and Sammy Hagar on tour, Uzomah gave us the best of both worlds.",
    "Maybe it's destiny that the Bengals are in Super Bowl LVI in 2022 playing the L.A. Rams, because another rookie who already won Rookie of the Year, has his own dance, \"The Griddy.\"",
    "He finished third in Rookie of the Year voting, somehow losing to John Stephens of the New England Patriots, who rushed for more yards but scored 11 fewer touchdowns.",
    "Uzomah, didn't disappoint when he scored during the Bengals' first playoff win in 31 years last month against the Raiders.",
    "'Ickey Shuffle':Cincinnati Bengals' playoff run has resurrected legend of 'Ickey Shuffle'\nWhat are we doing here?",
    "Ickey Woods rushed for 1,525 yards in his four-year career, but he scored 27 touchdowns in just 37 games.",
    "How to do Ickey Woods' iconic 'Ickey Shuffle'\nIn 2013, Woods broke it down on \"The List.\"",
    "Uzomah: The best of both worlds\nCincinnati Bengals fans' spirit animal, tight end C.J.",
    "The \"Ickey Shuffle\" was born in 1988 and the Bengals went to the Super Bowl.",
    "Keith Jackson, a tight end, of the Philadelphia Eagles finished second.",
    "Maybe Geico will bring it back — going to get some cold cuts today!",
    "It's no wonder Bengals fans will never forget the \"Ickey Shuffle.\"",
    "The man scored 15 touchdowns and rushed for 1,066 yards.",
    "Here's how to do them on Sunday during the Super Bowl.",
    "Woods' touchdown dance has made the rounds since 1988.",
    "Woods scored 15 touchdowns his rookie season in 1988.",
    "Important: Don't forget the Woo-Woo.",
    "Woods didn't even finished second.",
    "Like c'mon, 1988 voters.",
    "They saw it quite a bit.",
    "Uzomah injury:C.J.",
    "Anywho.",
    "C.J."
  ]
}