{
  "id": 2638,
  "mediaId": 8496,
  "date": "2022-02-07",
  "headline": "3 Ohio state parks to undergo temporary name changes ahead of Super Bowl",
  "image": "https://media.wkyc.com/assets/WBNS/images/e501e245-4d9a-456f-9243-bbcb9c983fd4/e501e245-4d9a-456f-9243-bbcb9c983fd4_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/welcome-burrow-oak-state-park-ohios-parks-undergo-temporary-name-changes-ahead-of-super-bowl/530-7528dfd8-efc8-4a06-8991-901d7639bcf3",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "#RuleItAll\n— Governor Mike DeWine (@GovMikeDeWine) February 7, 2022\nAdditionally, DeWine announced Paint Creek State Park in northeast Ohio will temporarily be referred to as “Evan McPherson Extra Point Creek State Park,” while Hueston Woods State Park in southwest Ohio will go by “Ickey Woods State Park” to honor legendary running back Ickey Woods.",
    "Governor Mike DeWine announced Monday he and Ohio Department of Natural Resources Director Mary Mertz renamed the three parks to honor current and past Cincinnati Bengals players.",
    "Ahead of the big game, DeWine said Burr Oak State Park in southeast Ohio will be referred to as “Burrow Oak State Park” in honor of the quarterback from nearby Athens.",
    "If the Bengals win Sunday’s game, Joe Burrow will become the first ever quarterback to win the Heisman Trophy, a National Championship and the Super Bowl.",
    "Once they are, you can take a photo with the signs and tag @GovMikeDeWine, @ohiodnr and @ohstateparks.",
    "COLUMBUS, Ohio — Three Ohio state parks are temporarily getting new names ahead of Super Bowl Sunday.",
    "We're teaming up with @ohiodnr this week to celebrate the @bengals as they head to the #SuperBowl!",
    "The announcement comes as the Bengals head to California to face the LA Rams in Super Bowl LVI.",
    "We've temporarily renamed three Ohio State Parks in honor of current and past Bengals players!",
    "DeWine said updated signage will be put in place at the three parks this week."
  ]
}