{
  "id": 2721,
  "mediaId": 8495,
  "date": "2022-02-02",
  "headline": "Patrol Identifies Contributing Factors to Fatal Crashes from 2021",
  "image": "https://wktn.com/wp-content/uploads/2020/11/Ohio-State-Highway-Patrol-OSP-OHSP.jpg",
  "link": "https://wktn.com/patrol-identifies-contributing-factors-to-fatal-crashes-from-2021",
  "mediaOutlet": "WKTN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    982,
    6474,
    6335
  ],
  "sentences": [
    "Driving responsibly and attentively is something that all drivers can focus on, which will lead to safer roadways for our local community and Ohio as a whole.”\nThe Patrol reminds you to call #677 when you see unsafe motorists driving on Ohio roads.",
    "“Driving aware not only helps you stay safe, but it helps other motorists get home to their families as well.”\nFrom 2017 to 2021, more fatal crashes happened in Franklin County (505) than in any other county.",
    "“Law enforcement officers see the deadly consequences of traffic violations on a daily basis, and more often than not, these crashes are preventable,” said Lt. Matt Crow, Findlay Post Commander.",
    "Those factors of the at-fault driver are driving off the roadway, unsafe speed, left of center, failure to yield, improper lane changes, and following too close.",
    "(Findlay) – According to the Ohio State Highway Patrol, six contributing circumstances accounted for 71 percent of fatal crashes in 2021.",
    "For more information, a traffic safety bulletin can be found at:\nhttps://statepatrol.ohio.gov/doc/fatalcrashbulletin_feb2022.pdf",
    "Large numbers of fatal crashes also occurred in Cuyahoga (456), Hamilton (272), Montgomery (259), and Lucas (211) Counties.",
    "“Crashes are preventable when drivers stay focused and make good decisions behind the wheel,” said Governor Mike DeWine.",
    "Provisional data shows that 2021 was the deadliest year on record since 2002, with 1,246 crashes and 1,357 fatalities.",
    "Combined, these five counties accounted for 31 percent of all fatal crashes during these five years."
  ]
}