{
  "id": 287,
  "mediaId": 8496,
  "date": "2022-02-25",
  "headline": "Ohio Supreme Court continues in-person showdown over state's legislative maps",
  "image": "https://media.wkyc.com/assets/WKYC/images/c0c8a8ac-2cd7-4a10-a2f6-8074a7abbb63/c0c8a8ac-2cd7-4a10-a2f6-8074a7abbb63_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/ohio-supreme-court-continues-in-person-showdown-state-political-maps/95-ee218df8-73d5-4e44-a99e-ded280038a28",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "COLUMBUS, Ohio — An extraordinary showdown that would have brought a high-powered line-up of Ohio's political mapmakers before justices of the Ohio Supreme Court was continued Friday, after the state's Republican-controlled redistricting panel delivered the court a third set of legislative maps that its majority insists are now constitutional.",
    "In a statement, he raised concerns that these new maps may violate the Constitution \"with unnecessary splits and by compromising compactness to achieve a specific ratio.”\nSykes criticized Republicans for excluding his party from the creation of the final maps for the third time in a row.",
    "The panel's Democrats, Sykes and Russo, voted against the third set of maps — questioning Republicans' characterization that the plan creates a 54-45 Republican majority in the Ohio House and an 18-15 Republican majority in Ohio Senate.",
    "The Democratic leader of the Ohio Senate, Kenny Yuko, said in a statement that the commission “has had more than enough chances to work together and follow the court’s directions.” He said, \"Ohioans deserve better.”\nPrevious Reporting:",
    "“The fact is, is that it is a new constitutional provision that has never before been utilized or navigated or litigated — and, as such, naturally results in differing opinions and understanding about what is required,\" Cupp said.",
    "Mike DeWine, Secretary of State Frank LaRose, Auditor Keith Faber, Senate President Matt Huffman and House Speaker Bob Cupp, all Republicans, and House Minority Leader Allison Russo and state Sen. Vernon Sykes, both Democrats.",
    "A 4-3 majority scolded the Republican-led Ohio Redistricting Commission both times for illegally gerrymandering the lines for partisan gain and failing to work with panel Democrats to achieve bipartisan consensus.",
    "The plan ultimately finalized Thursday was seven days late, adding to the commission's record of blowing nearly every deadline for its work dictated by the state's Constitution and the courts.",
    "Kennedy argued that Chief Justice Maureen O’Connor — a Republican who has joined the court’s three Democrats to find maps gerrymandered — improperly acted alone to summon the commissioners.",
    "That would be just the ratios the high court has ordered, because it would deliver Ohioans representation at the Statehouse proportional to their party preferences.",
    "He argued the belabored back-and-forth with the court was a necessary exercise for understanding how Ohio's brand new redistricting system should be carried out.",
    "The third dissenting justice in the gerrymandering cases, the governor's son Justice Pat DeWine, had recused himself from Tuesday's proceeding.",
    "Two justices who dissented in the court’s map-related rulings, Sharon Kennedy and Pat Fischer, objected to holding Tuesday’s hearing.",
    "Individually and as a body, they faced contempt charges for defying a court-ordered Feb. 17 deadline for approving the maps.",
    "“Decisions of the Ohio Supreme Court have subsequently filled in some of the meaning of certain constitutional provisions.\"",
    "Cupp, himself a former justice, made perhaps the most impassioned argument to date Thursday night on Republicans' behalf.",
    "The state has been here twice before, and twice the high court has invalidated the GOP-drawn and -supported maps.",
    "For now, however, commissioners will not be compelled to show up in person Tuesday to answer to the court.",
    "The high court has given opponents until Monday to file objections to the maps themselves.",
    "Opponents of the state legislative maps have until Monday to file an objection.",
    "O’Connor had replaced DeWine with Judge W. Scott Gwin, a Democrat.",
    "The decision did not end the fight over the maps, however.",
    "This time, Faber joined Democrats in opposing the plan.",
    "Those summoned before the court had included Gov."
  ]
}