{
  "id": 2963,
  "mediaId": 8473,
  "date": "2022-01-28",
  "headline": "Former Ohio congressman, newspaper chief Clarence Brown dies",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/news/latest-news/2022/01/former-ohio-congressman-newspaper-chief-clarence-brown-dies/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Brown continued as a board member but retired as chairman in 2002, when he was succeeded by his son, actor Clancy Brown, who has appeared films including “The Shawshank Redemption” and “Highlander.” His other son, Roy Brown, became president and chief executive officer of the company in 2000.",
    "“Having succeeded his dad in office after he had served 27 years in Congress, both Bud and his father were dedicated public servants, working tirelessly to help people in Ohio and the nation,” DeWine said.",
    "URBANA (AP) — Clarence “Bud” Brown Jr., a former congressman from Ohio and retired chairman of the now-defunct Brown Publishing Co., has died, according to a funeral home in his hometown.",
    "11:20 a.m.: Warren to face suit over Summit dam dangers\nWARREN -- The family of Lisa Zitello will file a lawsuit against the city of Warren over the lack of adequate ...\nTue.",
    "Mike DeWine, who followed Brown in representing Ohio’s seventh congressional district, said Brown was a leading Republican voice in Congress on energy and economic policy.",
    "10:27 a.m.: Todd Rundgren announced for both Robins, Packard\nWARREN — Todd Rundgren will be making two appearances in Warren five weeks apart.",
    "Brown Publishing, based in the Cincinnati suburb of Blue Ash, was founded in 1920 and included 18 daily newspapers.",
    "The Republican was elected in 1965 to complete the congressional term of his father, U.S. Rep. Clarence J.",
    "In 1982, Brown lost the race for governor of Ohio to Democrat Richard Celeste by more than 600,000 votes.",
    "He was a U.S. Navy veteran and also served as the U.S. deputy secretary of commerce from 1983 until 1988.",
    "11:15 a.m.: State awards $3.4M toward St. Joseph Riverside demo\nWARREN Ohio Governor Mike DeWine and Lt.",
    "Brown had worked as a journalist for the family-owned Brown Publishing Co. starting in 1949.",
    "Visitation will be Tuesday and services the following day, according to Vernon Funeral Home.",
    "Brown is survived by his wife, Joyce Brown, and their two sons, and a daughter, Catherine.",
    "The company filed for Chapter 11 bankruptcy in 2010 and its assets were sold that year.",
    "He became acting secretary in 1987 after the death of Secretary Malcolm Baldridge.",
    "He also was president of the U.S. Capitol Historical Society from 1992 to 1999.",
    "Governor Jon Husted today awarded more than $60 million in funding to ...\nTue.",
    "10:41 a.m.: US consumers still confident in April, but slightly less so\nTue.",
    "He was named company president in 1965 and chairman of the board in 1976.",
    "NEWSLETTER\nToday's breaking news and more in your inbox\nLatest News\nTue.",
    "10:16 a.m.: Housing shortage, soaring rents squeeze US college students",
    "10:44 a.m.: Stocks fall ahead of earnings from Big Tech companies\nTue.",
    "The younger Brown served in the position until 1983.",
    "Another daughter, Beth, died in 1964 at age 7.",
    "Brown, of Urbana, died at his home Wednesday.",
    "Brown was born in Columbus on June 18, 1927.",
    "Tickets will go on sale ...\nTue.",
    "Brown, who died that year.",
    "He was 94.",
    "Ohio Gov."
  ]
}