{
  "id": 2982,
  "mediaId": 8494,
  "date": "2022-01-31",
  "headline": "Morning Headlines: COVID cases, hospitalizations decline; Guard members wrap up Northeast Ohio hospital deployments",
  "image": "https://npr.brightspotcdn.com/dims4/default/56d12ec/2147483647/strip/true/crop/7680x4032+0+144/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F80%2F0b%2Fc661d0604e579b2ae65e97d73724%2Fshutterstock-1667357200.jpg",
  "link": "https://www.wksu.org/2022-01-31/morning-headlines-covid-cases-hospitalizations-decline-guard-members-wrap-up-northeast-ohio-hospital-deployments",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Monday, January 31:\nCOVID cases, hospitalizations decline\nGuard members wrap up Northeast Ohio hospital deployments\nSherwin-Williams breaks ground on new HQ\nSource of carbon monoxide at hotel sought; 11 go to hospital\nCOVID cases, hospitalizations decline\n(WKSU) -- The omicron wave is continuing to subside in Ohio.",
    "Source of carbon monoxide at hotel sought; 11 go to hospital\n(AP) — Authorities are trying to find the source of carbon monoxide at a central Ohio hotel that sent at least 11 people, more than half of them children, to a hospital.",
    "Guard members wrap up Northeast Ohio hospital deployments\n(Beacon Journal) -- Ohio National Guard members are nearing the end of their deployment serving Northeast Ohio hospitals.",
    "Sherwin-Williams breaks ground on new HQ\n(WKSU) -- Construction is officially underway on a new downtown Cleveland headquarters for paint giant Sherwin-Williams.",
    "The company plans to build a 36-story tower, along with a parking garage and pavilion on about seven acres near Public Square.",
    "The 40 guard members at Cleveland Clinic Akron General and 30 at Aultman Hospital in Canton ended their deployment on Friday.",
    "The Columbus Dispatch reports that everyone who was hospitalized had been in the pool area of a Hampton Inn in Marysville.",
    "The state on Sunday reported around 5,200 new COVID-19 cases, the fewest in a single day in nearly two months.",
    "Daily case counts have been declining since January 22 after reaching record highs just after the holidays.",
    "Hospitalizations are also on the decline, with about 4,200 COVID patients statewide as of Sunday.",
    "The Beacon Journal reports 30 of 50 members remain at Summa's Akron City and Barberton hospitals.",
    "The cause is under investigation and Hampton Inn officials say they are cooperating with police.",
    "And 20 guard members will remain at Cleveland Clinic Mercy Hospital for at least another week.",
    "Sherwin-Williams is also building a new research and development facility in Brecksville.",
    "Mike DeWine sent more than 2,000 members to help hospitals manage the COVID-19 surge.",
    "It will be home to about 3,000 employees when construction is complete in 2024.",
    "There are about 800 COVID patients in ICUs, down by about 200 from last Sunday.",
    "A virtual groundbreaking ceremony was held Friday.",
    "That’s down more than 1,100 since last Sunday.",
    "All victims have been stabilized or released.",
    "Gov."
  ]
}