{
  "id": 2984,
  "mediaId": 8496,
  "date": "2022-02-02",
  "headline": "Judge again blocks Ohio law regulating aborted fetal remains",
  "image": "https://media.wkyc.com/assets/WBNS/images/79901c6a-c694-4772-b41d-71b568f09274/79901c6a-c694-4772-b41d-71b568f09274_1140x641.jpeg",
  "link": "https://www.wkyc.com/article/news/politics/judge-again-blocks-law-regulating-aborted-fetal-remains/530-fb547caf-fb57-42a8-ba7b-86367e2ec9c2",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Others include a ban on most abortions after a “detectable fetal heartbeat,” as early as six weeks into pregnancy; part of a ban on D&E, or dilation & evacuation, abortions, the most common method used in the second trimester; a ban on the use of telemedicine in medication abortions; and certain restrictions on clinic operations that were tucked into Ohio’s two-year operating budgets back in 2013 and 2015.",
    "It was intended to replace an earlier Ohio law requiring aborted fetuses to be disposed of “in a humane manner,” but without defining “humane.”\nUnder current law the new rules seek to replace, fetal remains from what are known as surgical, or procedural, abortions fall under existing rules for handling infectious waste, meaning they could be disposed of with material from other medical procedures.",
    "“Compliance with this law would have a devastating impact on the ability of Ohioans to access time-sensitive health care, and intentionally denies them autonomy over their own lives, especially harming people with low-incomes, our Black, Latino and Indigenous communities, and people in rural communities,” they said in a joint statement.",
    "The litigation challenges the law as an unconstitutional hurdle to women’s legal right to an abortion, as well as “frivolous and medically unnecessary.”\nClinics that sued include Planned Parenthood, Preterm-Cleveland, Women’s Med Group and Northeast Ohio Women’s Center.",
    "In seeking to keep the law blocked, abortion providers and their lawyers argued the law imposes a funeral ritual on every patient, regardless of religious or spiritual belief, removing their autonomy.",
    "It was the second time in a year that Hamilton County Common Pleas Judge Alison Hatheway prevented the law from taking effect, in a case brought by a group of clinics and the ACLU of Ohio.",
    "The injunction she granted will stand until a lawsuit against the Ohio Department of Health and others determines the permanent fate of the law.",
    "COLUMBUS, Ohio — A judge again blocked an Ohio law Wednesday that would require fetal remains from surgical abortions to be cremated or buried.",
    "Abortion rights groups have called it another effort by the state’s Republican-led Legislature to obstruct a legally available procedure.",
    "Hatheway delivered them a victory, determining the law violates the clinics’ and patients’ rights to due process and equal protection.",
    "Clinics that sued include Planned Parenthood, Preterm-Cleveland, Women’s Med Group and Northeast Ohio Women’s Center.",
    "Abortion opponents lobbied for the new language, which they say assures human dignity.",
    "The fetal remains law is one of several Ohio abortion restrictions that are on hold.",
    "Mike DeWine signed the law in December 2020.",
    "Republican Gov."
  ]
}