{
  "id": 3006,
  "mediaId": 8323,
  "date": "2022-02-02",
  "headline": "‘It will be slow’: ODOT gives tips on navigating roads, keeping crews safe",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/02/570DBFBF329D617DF7E24AC9F54030CF.jpg?w=1280",
  "link": "https://fox8.com/weather/winter-weather-2021-2022/it-will-be-slow-odot-gives-tips-on-navigating-roads-keeping-crews-safe-during-winter-storm/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darcie Loreno",
  "authorUrl": "https://fox8.com/author/lorenodarcie/",
  "termIds": [
    0
  ],
  "sentences": [
    "“This is going to be one of those goofy storms where it’s going to start from rain, we may get a little freezing rain, the snow is going to come in, move in and stay and not leave,” said Brent Kovacs, public information officer for ODOT’s District 12.",
    "CLEVELAND (WJW) — Ohio Department of Transportation officials are gearing up to clear the roads as Winter Storm Landon hits, but they still warn conditions will be hazardous for drivers.",
    "One thing to keep in mind, he said, is that if a plow is angled to the right and a driver is passing on it’s left, there is a snow cloud that comes off that left side of the plow.",
    "“Be aware of the snow cloud coming off the opposite side of the plow.”\nKovacs wants to remind drivers, too, that stopping distances must be increased during snowy and icy weather.",
    "“It’s just the sheer volume of snow that the plow catches and is pushed to the right side; there is still some that comes off the left side of the plow,” he said.",
    "But if you have to be out and about, ODOT has some tips for navigating the roads and keeping crews safe as they work to clear 43,000 miles of roadways.",
    "“Please don’t have the expectation that you are going to drive on a dry road the next 48 hours or drive on a lightly slushy road,” he said.",
    "So far this year, Kovacs said, ODOT plows were hit 17 times when “drivers have failed to control their vehicles around” the plows.",
    "Over the next few days, there will be 65 ODOT trucks on the roads, with crews working 12-hour shifts around the clock.",
    "As the storm transitions to snow, one to two inches is expected to fall per hour, and the plows will be down.",
    "It will be that slow.”\nKovacs asks drivers to use extra caution when they need to drive around plows.",
    "“Roads will be snow-covered, and tire tracks will be a good road condition.”",
    "That’s when crews will primarily be salting the roads, said Kovacs.",
    "“Please get up an hour or two early…if you have to drive into work.",
    "The rain is then expected to start freezing or turn right to snow.",
    "It takes a plow a half hour to an hour to loop around its route.",
    "Mike DeWine has even asked residents to stay home if they can.",
    "“There’s the ice, then the sheer amount of snow,” he said.",
    "The storm is expected to start with rain.",
    "And if you don’t have to pass a plow?",
    "One final piece of advice?",
    "Don’t pass it, he said.",
    "Gov."
  ]
}