{
  "id": 3084,
  "mediaId": 2919,
  "date": "2022-02-01",
  "headline": "Gov. DeWine and ODOT asking Ohioans to stay off road during major winter storm",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/eee85ba/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F39%2Fc0%2F62549e124667b38c335221c8d654%2Fodot2.jpeg",
  "link": "https://www.news5cleveland.com/weather/weather-news/gov-dewine-and-odot-asking-ohioans-to-stay-off-road-during-major-winter-storm",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kaylyn Hlavaty",
  "authorUrl": "https://www.news5cleveland.com/kaylyn-hlavaty",
  "termIds": [
    2143,
    2761,
    966,
    6067,
    6474
  ],
  "sentences": [
    "“For those who must travel, please be safe and take it slow, giving yourself plenty of time to get to your destination.”\nIn Northeast Ohio, counties are under Winter Storm Watches and Warnings for significant amounts of snow, with most areas seeing between 9 and 14 inches of snowfall.",
    "In central Ohio, freezing rain is the biggest weather threat because ODOT crews can’t pretreat the roads ahead of the storm, and once they are treated, rain continuously washes the material away.",
    "\"During winter storms, ODOT strives to keep roads passable to help ensure that emergency services and essential workers can safely reach their destinations,\" said ODOT Director Jack Marchbanks.",
    "Download the News 5 App free now: Apple|Android\nDownload the StormShield app for weather alerts on your iOS and Android device: Apple|Android\nFollow the News 5 Weather Team:",
    "Mike DeWine are asking motorists to stay off the road during the second half of the week as a major winter storm moves in beginning Wednesday.",
    "“We are encouraging Ohioans to avoid any unnecessary trips during the storm to help give all of our road crews room to work,” said DeWine.",
    "“But even with our crews out in full force, roads will likely be snow and ice-covered, and it will take much longer to travel.",
    "ODOT asks if you must travel for any reason, give yourself plenty of time to reach your destination and take it slow.",
    "Once the storm moves out, our crews will be able to make progress toward getting traffic moving at regular speed.\"",
    "Want the latest Power of 5 weather team updates wherever you go?",
    "CLEVELAND — The Ohio Department of Transportation and Ohio Gov.",
    "Drift is also a potential issue due to high winds."
  ]
}