{
  "id": 3146,
  "mediaId": 8494,
  "date": "2022-02-02",
  "headline": "Conservative former state reps join Republican contest for Ohio governor",
  "image": "https://npr.brightspotcdn.com/dims4/default/c0ee896/2147483647/strip/true/crop/900x473+0+35/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2F7a%2F7b%2F94d3205c4ea8a370eb9e435f0dda%2Fron-hood-gun-concealed-carry.jpg",
  "link": "https://www.wksu.org/government-politics/2022-02-02/conservative-former-state-reps-join-republican-contest-for-ohio-governor",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "At the top of the ticket is Ron Hood, a former state representative from Ashville who described himself as a “forever Trumper” when he ran for Congress against the Trump-endorsed candidate who won, Mike Carey (R-OH 15).",
    "There are already two strongly Trump-focused teams in the GOP primary: former Congressman Jim Renacci and central Ohio farmer and businessman Joe Blystone.",
    "Keller confirmed the campaign launch by posting a photo of herself and Hood on the Facebook page of her group Patriot America, with the caption “Game on”.",
    "The two worked together in 2020 on a bill to prevent doctors from prescribing drugs to delay puberty or perform surgery to change a child’s gender.",
    "Both are running as critics of COVID actions and other policies of incumbent Mike DeWine, but are far behind him in fundraising.",
    "His running mate Candice Keller is a former state representative from Middletown and leads an anti-abortion pregnancy center.",
    "With Hood, Renacci and Blystone all in the race, they could end up splitting the anti-DeWine votes in the May primary.",
    "DeWine hasn't officially launched his campaign for governor, but is planning on filing his paperwork on Wednesday.",
    "They're also strong supporters of former president Trump, and have spread disinformation about COVID and vaccines.",
    "Both Hood and Keller back the expansion of gun rights and oppose all abortions.",
    "She ran unsuccessfully for the Ohio Senate in 2020.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau."
  ]
}