{
  "id": 3182,
  "mediaId": 8473,
  "date": "2022-01-29",
  "headline": "Ohio lured Intel with $2B incentive",
  "image": "https://ogden_images.s3.amazonaws.com/www.tribtoday.com/images/2022/01/29005724/intel-666x500.jpg",
  "link": "https://www.tribtoday.com/news/local-news/2022/01/ohio-lured-intel-with-2b-incentive/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "NEWSLETTER\nToday's breaking news and more in your inbox\nLocal News\nOn the record: Lordstown\nWHAT: Board of Education meeting April 20 PRESENT: Cheryl Kistler, Jackie Woodward, William Catlin, Niki ...\nRobotics teams end season with awards\nWARREN — FIRST Robotics teams from Warren G. Harding High School and Champion High School finished the season at ...\nVeterans group seeks parade participants\nWARREN — The Trumbull County Veterans Services Commission is seeking participants for the 2022 Trumbull County ...\nCortland man guilty in counterfeiting case\nWARREN — A Cortland man Monday pleaded guilty to a charge of attempting counterfeiting connected to an October ...\nWarren man gets 2 years in robbery\nWARREN — A Warren man received a two-year prison sentence Monday for his part in a May 30, 2020, robbery at ...\nUdderly Smooth president, music ed grad to speak at YSU",
    "The complex could grow much larger and more quickly, Intel executives said, if Congress approves a $52 billion bill that would invest in the chip sector and help ensure more production in the U.S.\nIntel CEO Patrick Gelsinger said the total Ohio investment could top $100 billion over the decade, with six additional factories, making it one of the world’s biggest chipmaking sites.",
    "COLUMBUS — Ohio offered Intel Corp. incentives worth roughly $2 billion to secure a new $20 billion chipmaking factory that the company says will help alleviate a global shortage and create a new technology hub in the Midwest.",
    "The state’s development director said Friday that the combination of tax breaks and incentives are likely the largest ever offered by Ohio for what state leaders say is the biggest economic development deal in its history.",
    "Shortages of computer chips, which mostly are made in Asia and used in everything from handheld video games to automobiles, have become a growing concern and were exposed in the U.S. and Europe during the pandemic.",
    "The state’s share will be money well spent because the Intel facility will not only create jobs, but also make Ohio more attractive to industries such as auto, aviation and defense that rely on chips, Mihalik said.",
    "The state’s privatized economic development office, JobsOhio, will provide Intel with as much as $150 million in combined economic development and workforce grants, said Matt Englehart, a JobsOhio spokesperson.",
    "In addition, the city of New Albany said it will give Intel a 30-year, 100 percent property tax abatement on buildings the company constructs in its business park, The Columbus Dispatch reported.",
    "Ohio’s offer includes $600 million to help Intel offset the cost of building the factories, which is more expensive than it would be in Asia, said Lydia Mihalik, the state’s development director.",
    "“These investments will not only ensure that this project is successful here, but will also be supporting the region by increasing local infrastructure to support future growth,” Mihalik said.",
    "The two factories on a 1,000-acre site in Licking County, just east of Columbus, are expected to create 3,000 company jobs — many of them highly skilled — and 7,000 construction jobs.",
    "Santa Clara, California-based Intel, the world’s second biggest chipmaker, announced a week ago it had selected a site outside Columbus for two new chip manufacturing facilities.",
    "The U.S. share of the worldwide chip manufacturing market has declined from 37 percent in 1990 to 12 percent today, according to the Semiconductor Industry Association.",
    "The state also will pay nearly $700 million for roadwork and water infrastructure upgrades, including a system that will allow the plant to reuse wastewater.",
    "The facility will support tens of thousands of additional jobs for suppliers and partners, Intel and local and state officials said last week.",
    "Intel wants to move quickly on the Ohio plants, which will support its own line of processors and build chips designed by other firms.",
    "The state Legislature this summer approved a 30-year tax break that will allow Intel to save $650 million.",
    "Construction is expected to begin this year, with production coming online at the end of 2025.",
    "Ohio beat out 40 other states for the project, state officials said."
  ]
}