{
  "id": 321,
  "mediaId": 8491,
  "date": "2022-02-22",
  "headline": "DeWine announces new outdoor children’s literacy trails",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/02/local-park-trail-generic.jpg?w=1280",
  "link": "https://www.wkbn.com/news/ohio/dewine-announces-new-outdoor-childrens-literacy-trails/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peyton Ellert",
  "authorUrl": "https://www.wkbn.com/author/peyton-ellert/",
  "termIds": [
    0
  ],
  "sentences": [
    "“These trails give families a new and exciting way to get out and spend time – I’m excited that even more communities will be able to build these trails and encourage children to learn in a really fun way, all while teaching them the importance of protecting our natural resources.”\nThe ODNR Recreational Trail Grant Awards are as follows:\nThe Ashland County Park District will receive $5,173 for a new trail at Byers Woods.",
    "COLUMBUS, Ohio (WKBN) – Ohio Governor Mike DeWine, First Lady Fran DeWine, and Ohio Department of Natural Resources (ODNR) Director Mary Mertz announced Tuesday that the state is awarding more than $28,000 in grants for new or improved children’s literacy trails in Ohio.",
    "“Developing an appreciation for reading at a young age is so important for children as they grow, and we are excited to award these grants to help more communities combine the love of reading with the love of nature,” he said.",
    "ODNR Director Mary Mertz said she believes the trails will not only get families to spend more time together, but help children understand the importance of protecting our natural resources.",
    "There are currently 308,640 children enrolled in the Ohio Governor’s Imagination Library, which provides one free book every month to children enrolled in the program from birth to age five.",
    "The grants, awarded as part of ODNR’s Recreational Trails Grant Program, will fund trail and trailhead construction, maintenance, and storybook signage for each trail.",
    "An interactive map of ODNR’s Storybook Trails, as well as similar trails located at parks and library districts across the state, can be found at ohiodnr.gov.",
    "The Black Swamp Conservancy will be awarded $5,060 for the creation of a permanent storybook trail at the Dr. Robert L. Nehls Memorial Nature Preserve.",
    "The Village of Chauncey in Athens County will be awarded $5,233.19 to expand their story walk trail along the Bailey’s Trail System.",
    "This grant program is federally funded and is administered by the ODNR in cooperation with the Federal Highway Administration.",
    "To learn more about the Ohio Governor’s Imagination Library and how to participate, visit OhioImaginationLibrary.org.",
    "Governor DeWine said he hopes the local trails will promote the benefits of early literacy and a heathy lifestyle.",
    "The Recreational Trails Program is a reimbursement grant program that provides up to 80% project funding.",
    "The Village of Lewisburg will receive $7,856 for a storybook walking path at Lewisburg Community Park.",
    "Goshen Township Memorial Park will receive $5,160.80 to create a new Mechanicsburg story walk.",
    "The trails will be very similar to ODNR’s Storybook Trails."
  ]
}