{
  "id": 3298,
  "mediaId": 8381,
  "date": "2022-02-04",
  "headline": "Right Now is a Fantastic Time to View Ohio’s Bald Eagles",
  "image": "https://www.thenbxpress.com/wp-content/uploads/2018/05/cropped-NBX-Site-Icon-June-2018-1-32x32.jpg",
  "link": "https://www.thenbxpress.com/right-now-is-a-fantastic-time-to-view-ohios-bald-eagles/?utm_source=rss&utm_medium=rss&utm_campaign=right-now-is-a-fantastic-time-to-view-ohios-bald-eagles",
  "mediaOutlet": "NBX Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff \"JP\" Miklovic",
  "authorUrl": "https://www.thenbxpress.com/author/jpmiklovichotmail-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Excellent viewing opportunities can be found at Magee Marsh Wildlife Area (Lucas and Ottawa counties), Pickerel Creek Wildlife Area (Sandusky County), Ottawa National Wildlife Refuge (Lucas and Ottawa counties), Mosquito Creek Wildlife Area (Trumbull County), and Killdeer Plains Wildlife Area (Wyandot and Marion counties).",
    "These large tracts of wetland habitats provided the necessary space for eagles to nest and raise their young, expanding from only four nesting pairs in 1979.”\nBald eagles in Ohio typically lay eggs and incubate in February and March, nesting in large trees such as sycamores, oaks, and cottonwoods.",
    "COLUMBUS, Ohio – Bald eagle nesting activity increases in Ohio during the winter months, providing additional chances to see these majestic birds hunt, repair their nests, and establish territory, according to the Ohio Department of Natural Resources (ODNR) Division of Wildlife.",
    "“Bald eagles are flourishing in Ohio because of improved habitat and water quality in wetlands, and this habitat will only continue to improve through wetlands restored and created through our H2Ohio initiative,” said Ohio Governor Mike DeWine.",
    "Bald eagle habitat protection and research is funded by the sale of bald eagle conservation license plates, income tax check-off donations to the Endangered Species and Wildlife Diversity Fund, and sales of the Ohio Wildlife Legacy Stamp.",
    "When rehabilitation professionals assessed the bird’s injuries, they discovered it was banded as a hatchling on June 10, 1993 at Reno Beach in Lucas County, making her an astounding 28 years old.",
    "After much hard work and continued conservation, the bald eagle was removed from the federal list of threatened and endangered species in 2007, and from Ohio’s list in 2012.",
    "Thanks to partnerships between the Division of Wildlife, Ohio zoos, wildlife rehabilitation facilities, concerned landowners, and conservationists its population increased.",
    "The mission of the Division of Wildlife is to conserve and improve fish and wildlife resources and their habitats for sustainable use and appreciation by all.",
    "The results indicated Ohio had 712 active eagle nests, a 153% increase from the previous census completed in 2012, when 281 nests were recorded.",
    "Bald eagles are protected under both state law and the federal Bald and Golden Eagle Protection Act, making it illegal to disturb bald eagles.",
    "Meanwhile, frozen lakes and rivers force the birds to expand their hunting grounds in search of fish and carrion, their foods of choice.",
    "“Wildlife areas have also been increased and restored, in part, thanks to funds from our sportsmen through hunting license purchases.",
    "However, a 28-year-old female was discovered in April 2021 when Ohio wildlife officers responded to a call about an injured eagle.",
    "More about Ohio’s bald eagles\nThe bald eagle was once an endangered species, with only four nesting pairs in Ohio in 1979.",
    "Report bald eagle nests\nAll Ohioans can report a bald eagle nest at wildohio.gov or through the HuntFish OH mobile app.",
    "Lake Erie and other large waterbodies host the highest number of eagles because of easy access to food resources.",
    "Ohio is made up of two major watersheds, roughly separated by U.S. 30 which runs through north-central Ohio.",
    "As with many of Ohio’s native wildlife species, bald eagles require specific habitat conditions to thrive.",
    "When viewing these majestic birds, remember to respect the bird’s space and stay at least 100 yards away.",
    "ODNR ensures a balance between wise use and protection of our natural resources for the benefit of all.",
    "An eagle’s large size, impressive wingspan, and dark body is easy to spot against winter snow and ice.",
    "In 2020, a nest census was completed in an attempt to locate every active bald eagle nest in Ohio.",
    "In southern Ohio, look near major rivers such as the Muskingum, Hocking, Scioto, and Great Miami.",
    "Caption: Bald eagles become more active with hunting and nest building in January and February.",
    "They can be found roosting along rivers, sitting on frozen lakes, or even in open farm fields.",
    "Most nests were confirmed on private property, while less than 150 were on public lands.",
    "Learn how to support Ohio’s magnificent wildlife such as the bald eagle at wildohio.gov.",
    "Historic bald eagle banding\nOn average, bald eagles live about 20 years in the wild.",
    "In the Ohio River watershed, covering the rest of the state, 316 nests were found.",
    "Look for these large raptors wherever they can find clean water and abundant food.",
    "Disturbing bald eagles at the nest site could lead the pair to abandon the eggs.",
    "January is also when Ohio’s bald eagles begin courtship and pair bonding.",
    "Ohio’s bald eagle population has increased dramatically in recent years.",
    "The bird was rehabilitated and released back to the wild in June 2021.",
    "Look for them in locations with clean water and an abundance of fish.",
    "The Lake Erie watershed, located north of U.S. 30, hosted 396 nests.",
    "Of those, 43 nests were located on Division of Wildlife properties.",
    "Visit the ODNR website at ohiodnr.gov.",
    "Visit wildohio.gov to find out more."
  ]
}