{
  "id": 3317,
  "mediaId": 8494,
  "date": "2022-02-03",
  "headline": "Morning Headlines: Winter storm brings hundreds of closings, canceled flights; Ohio leads the nation in COVID deaths per capita",
  "image": "https://npr.brightspotcdn.com/dims4/default/23db68e/2147483647/strip/true/crop/5616x2948+0+398/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb6%2Fb8%2F61e9db2d4f7785fb2e45daad2ff8%2Fshutterstock-243809152.jpg",
  "link": "https://www.wksu.org/2022-02-03/morning-headlines-winter-storm-brings-hundreds-of-closings-canceled-flights-ohio-leads-the-nation-in-covid-deaths-per-capita",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Thursday, February 3:\nWinter storm brings hundreds of closings, flight delays\nOhio leads the nation in COVID deaths per capita\n13 to vie for US Senate seat in Ohio, 6 for governor\nLawsuit: Wrong sperm used during fertilization procedure\nFormer House speaker asks judge to drop conspiracy charge\nJudge again blocks Ohio law regulating aborted fetal remains\nWinter storm brings hundreds of closings, canceled flights\n(WKSU) -- State officials are urging residents to stay home as the entire region is under a winter storm warning through Friday morning.",
    "Former House speaker asks judge to drop conspiracy charge\n(AP) — The former Republican legislative leader accused of helping orchestrate a $60 million bribery scheme has asked a judge to dismiss a conspiracy charge against him.",
    "13 to vie for US Senate seat in Ohio, 6 for governor\n(AP) — The crowded race for Ohio’s open U.S. Senate seat topped out at 13 major-party candidates on Wednesday, as the state closed the books on candidate entries for 2022.",
    "Lawsuit: Wrong sperm used during fertilization procedure\n(AP) — A Cuyahoga Falls family is suing Summa Health System and one of its physicians, saying the wrong sperm was used during a fertilization procedure in 1991.",
    "Judge again blocks Ohio law regulating aborted fetal remains\n(AP) — A judge has again blocked an Ohio law that would require fetal remains from surgical abortions to be cremated or buried.",
    "The decision Wednesday marked the second time in a year that a Hamilton County judge has prevented the law from taking effect in a case brought by a group of clinics and the ACLU of Ohio.",
    "Larry Householder was charged 18 months ago with plotting to oversee the funneling of energy company money into a legislative effort to bail out two nuclear power plants.",
    "Many Northeast Ohio cities have issued parking bans and there are hundreds of school closings, including Akron, Cleveland, Kent State, and University of Akron campuses.",
    "Three statewide officeholders — Attorney General Dave Yost, Treasurer Robert Sprague, and Auditor Keith Faber, all Republicans — face no same-party competition in May.",
    "Ohio leads the nation in COVID deaths per capita\n(WKSU) -- While Ohio is seeing a drop in COVID-19 cases and hospitalizations, some numbers remain troubling.",
    "Galloway with the help of her attorneys' law firm were able to identify and then confirm through sleuthing and DNA testing her biological father's identity.",
    "The lawsuit says Jessica Harvey Galloway learned from a DNA ancestry test in 2020 that the man who helped raise her wasn't her biological father.",
    "Galloway, her mother Jeanine Harvey, and Mike Harvey are suing Dr. Nicholas Spirtos, the physician who performed the procedure and Summa.",
    "Parties argued the law imposes a funeral ritual on every patient, regardless of religious or spiritual belief, removing their autonomy.",
    "The judge found it violates patients’ rights to due process and equal protection, keeping it on hold until their case is heard.",
    "New York Times data show Ohio leads the nation in COVID deaths per capita, with 155 Ohioans dying each day of COVID on average.",
    "Mike DeWine also drew three primary challengers, and Republican Secretary of State Frank LaRose drew two.",
    "The U.S. Attorney's Office says it will oppose the request to drop charges through its own court filings.",
    "And, Ohio’s vaccination rate ranks 17th worst in the nation at 57%, behind Michigan and Pennsylvania.",
    "They argue prosecutors haven't provided the essential facts needed for criminal charges.",
    "Late Tuesday his attorneys filed court motions asking that the indictment be dismissed.",
    "Democrats are running unopposed in all races except governor and U.S. Senate.",
    "Cleveland Hopkins says nearly 100 flights today have been canceled.",
    "You can track the latest weather alerts and school closings here.",
    "The same is the case for two Ohio Supreme Court justices.",
    "Snow throughout the day will be heavy at times.",
    "That’s a 28% increase over the past two weeks.",
    "The national COVID vaccination rate is 64%.",
    "He has pleaded not guilty.",
    "Republican Gov."
  ]
}