{
  "id": 332,
  "mediaId": 2632,
  "date": "2022-02-25",
  "headline": "Potent Protest: Bars Drop Russian Vodka, Promote Ukraine's",
  "image": "https://media.nbcbayarea.com/2022/02/GettyImages-483512189.jpg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.nbcbayarea.com/news/national-international/potent-protest-michigan-bar-drops-russian-vodka-promotes-ukraines/2823338/",
  "mediaOutlet": "nbcbayarea.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“It’s been awesome.’’\nU.S. & World\nThe Magic Mountain ski resort in Londonderry, Vermont, posted a video on Twitter showing an employee pouring Stolichnaya down the drain and saying: “Sorry, we don’t serve Russian products here.”\nGovernors entered the fray, too.",
    "It also promised to accept the return of any Russian products and declared that it “stands with Ukraine, its people, and the Ukrainian Canadian community here in Ontario.”\nIn Grand Rapids, Quay said he may never sell Russian products again.",
    "Mike DeWine directed the state's Commerce Department to cease the purchase and sale of Russian Standard, the only Russian vodka sold in Ohio (under the brand names Green Mark and Russian Standard).",
    "In Canada, the Liquor Control Board of Ontario on Friday announced that “all products produced in Russia will be removed from LCBO channels,” including 679 of its stores across the province.",
    "Some bars and liquor stores think they’ve found a potent way to punish Russia for invading Ukraine: They’re pulling Russian vodka off their shelves and promoting Ukrainian brands instead.",
    "The Southern Spirits liquor store in Indian Land, South Carolina, is doing a booming business in the Ukrainian vodka Kozak after pulling Russian brands off its shelves.",
    "We’ve got people coming in who’ve never been in the bar before.”\nStoli, owned by the Russian-born tycoon Yuri Shefler, is actually made in Latvia.",
    "I thought I would put on sanctions as well.’’\nSo he rid his shelves of the old Soviet brand Stolichnaya and started promoting Ukraine’s Vektor.",
    "Chris Sununu signed an executive order requiring state liquor outlets to remove Russian-made and branded alcohol, as did Utah Gov.",
    "And he’s taken another step: “I’ve ordered a Ukrainian flag, and that will be going up next week.”\nThis is a live update.",
    "On its website, Stoli Group says it “stands for peace in Europe and in solidarity with the Ukrainian people.\"",
    "“We have a sign above it that says: Support Ukraine.”\nQuay announced the move on Facebook, and “it blew up.",
    "You wonder what you can do,” said Bob Quay, owner of Bob’s Bar in Grand Rapids, Michigan.",
    "“It’s selling out a lot faster than we thought,” said general manager Drew Podrebarac.",
    "“I woke up yesterday morning, and I saw that Russia had invaded Ukraine.",
    "Click here for complete coverage of the crisis in Ukraine.",
    "“The U.S. obviously is putting on sanctions.",
    "New Hampshire Gov.",
    "Spencer Cox.",
    "Ohio Gov."
  ]
}