{
  "id": 3328,
  "mediaId": 8494,
  "date": "2022-02-02",
  "headline": "It's a close money race for Ohio Democrats running for governor, but there's a clear winner for Republicans",
  "image": "https://npr.brightspotcdn.com/dims4/default/7083ed5/2147483647/strip/true/crop/3264x1714+0+367/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2F33%2F64%2F970b33f6404d825fac385176611d%2Fimg-7813.jpg",
  "link": "https://www.wksu.org/government-politics/2022-02-02/its-a-close-money-race-for-ohio-democrats-running-for-governor-but-theres-a-clear-winner-for-republicans",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "DeWine: raised $383,673.00 with $355,956.77 cash on hand\nFischer: raised $195,551.52 with $179,095.68 cash on hand\nKennedy: $539,386.00 with $544,121.37 cash on hand\nDemocratic Justice Jennifer Brunner, Tenth District Court of Appeals Judge Terri Jamison and First District Court of Appeals Judge Marilyn Zayas raised $189,000.",
    "Brunner: raised $162,676.66 with $117,891.54 cash on hand\nJamison: raised $23,873.00 with $18,618.33 cash on hand\nZayas: raised $3,000 with $19,030.57 cash on hand\nBrunner and Kennedy are facing each other for Chief Justice.",
    "But incumbent Mike DeWine raised $3,300,367.66, and has $9,204,068.06 in the bank – which his campaign says is the largest cash-on-hand balance of any incumbent governor at this point of a campaign.",
    "The Ohio House Republican Alliance, which raises money for the 64 House Republicans, brought in $1,318,998.37 in the last six months, and has $1,299,221.21 on hand.",
    "The Republican Senate Campaign Committee, fundraising for the 25 Senate Republicans, took in $1,744,807.06 and now has $3,774,504.06 cash on hand.",
    "In reports filed with the Secretary of State on Monday, former Dayton mayor Nan Whaley raised $1,261,985.53 and has $1,770,157.39 cash on hand.",
    "But the Ohio House Democratic Campaign Committee, which brings in money for the 35 Democrats, raised $128,195.53 and has $249,319.87 on hand.",
    "The Ohio Senate Democrats, representing eight Democrats in the Senate, reported raising $160,415.02 and has $204,284.09 in the bank.",
    "Republican former Congressman Jim Renacci has $4,112,822.58 in the bank, but that includes a $4.8 million loan he made to himself.",
    "The candidates vying for the Democratic nomination for governor raised close to the same amount of money in the last six months.",
    "Central Ohio farmer and businessman Joe Blystone raised $314,447.52, more than twice that, but only has $214,312.03 cash.",
    "Republican candidates for the Statehouse and Ohio Supreme Court are dramatically outpacing their Democratic opponents.",
    "Former Cincinnati mayor John Craney just behind, raising $1,048,989.17 and holding $1,905,289.75 in cash.",
    "The story is similar for the three Republicans running for the Ohio Supreme Court.",
    "Justices Pat DeWine, Pat Fischer and Sharon Kennedy, raised $1.1 million.",
    "Fischer will face Jamison, and Zayas is hoping to unseat DeWine.",
    "But the fundraising race on the Republican side was no contest.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "And he raised just $148,723.81."
  ]
}