{
  "id": 3543,
  "mediaId": 8264,
  "date": "2022-02-01",
  "headline": "Major winter storm to roll through Athens, region",
  "image": "https://bloximages.chicago2.vip.townnews.com/athensnews.com/content/tncms/assets/v3/editorial/3/68/368397c0-6fdb-11ec-a471-77fa8f15cc75/61d871bc83760.image.jpg?crop=1621%2C851%2C0%2C213&resize=1200%2C630&order=crop%2Cresize",
  "link": "https://www.athensnews.com/news/major-winter-storm-to-roll-through-athens-region/article_d5243d40-8394-11ec-8a5c-1b62cee50576.html",
  "mediaOutlet": "athensnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cole Behrens",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“For those who must travel, please be safe and take it slow, giving yourself plenty of time to get to your destination.”\nAshley Rittenhouse, spokesperson for ODOT District 10, said because the winter storm will take the form of rain at least initially, ODOT will be unable to do a brine pretreatment on highways they are responsible for.",
    "The forecast for the southern portion of Ohio shows serious potential for heavy rain that could lead to flooding issues before it changes over to freezing rain or snow, an Ohio Department of Transportation press release warned.",
    "Freezing rain is the most challenging of winter precipitation that ODOT deals with because crews cannot pre-treat roads ahead of the storm, and once the roads are treated, rain continuously washes the material away.",
    "In addition, a wintry mix, including the possibility of significant freezing rain, will develop across southeast Ohio, including Athens, Perry, Morgan and Vinton Counties.",
    "The Charleston, West Virginia, office of the National Weather Service has issued a winter storm watch effective Wednesday evening through Friday morning.",
    "“We are encouraging Ohioans to avoid any unnecessary trips during the storm to help give all of our road crews room to work,” DeWine said.",
    "Some forecasts are calling for over a foot of snow with blowing and drifting conditions due to high winds, an ODOT release said.",
    "The Scalia Lab at Ohio University announced there was a potential of significant icing on top of a couple of inches of snow.",
    "Athens County and the surrounding region are expecting a major winter storm to roll through beginning Wednesday.",
    "Minor flooding is possible near streams, creeks, or low lying/flood prone areas, according to the NWS.",
    "The storm will sweep east across West Virginia and southwest Virginia late Thursday night into Friday.",
    "In central Ohio, crews expect freezing rain to be the biggest threat, according to a release.",
    "A cold front will bring rain Wednesday into Thursday, some of which could be heavy at times.",
    "“Brine would obviously just wash off the road at that point,” Rittenhouse said.",
    "In northern Ohio, crews are preparing for significant amounts of snow.",
    "The storm will also affect northeast Kentucky Thursday, the NWS added.",
    "Mike DeWine cautioned travel throughout the state.",
    "Ohio Gov."
  ]
}