{
  "id": 3592,
  "mediaId": 8495,
  "date": "2022-01-27",
  "headline": "Nearly $15 Million of ARPA Block Grant Funding Will Help Strengthen Behavioral Healthcare Services",
  "image": "https://wktn.com/wp-content/uploads/2020/12/WKTN-Logo.png",
  "link": "https://wktn.com/nearly-15-million-of-arpa-block-grant-funding-will-help-strengthen-behavioral-healthcare-services",
  "mediaOutlet": "WKTN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“These dollars will make key investments in substance use disorder and mental health prevention programs and treatment services to help Ohioans live their best and healthiest lives.”\n“Through close partnerships and collaborations with our community partners, these investments will be targeted in ways that facilitate more responsive, agile, and effective interventions supporting lifelong health and recovery for all Ohioans,” said Ohio Department of Mental Health and Addiction Services (OhioMHAS) Director Lori Criss.",
    "As part of the ARPA block grant funding, OhioMHAS is also this month releasing $2.98 million in COVID mitigation funds to Ohio’s Alcohol, Drug Addiction and Mental Health Boards (ADAMH) to be used by boards and community behavioral health providers for COVID testing, PPE purchases, contact tracing, healthy environment maintenance, and other efforts to prevent spread of COVID-19, as well as for behavioral health services for individuals in short-term housing who are at elevated risk of contracting COVID.",
    ".$1.8M to mitigate losses for uncompensated care at 17 existing First Episode Psychosis/Early Serious Mental Illness teams in the following counties: Allen, Athens, Auglaize, Butler, Clermont, Coshocton, Cuyahoga, Delaware, Fairfield, Fayette, Franklin, Gallia, Greene, Guernsey, Hamilton, Hardin, Highland, Hocking, Jackson, Lorain, Lucas, Mahoning, Meigs, Montgomery, Morgan, Morrow, Muskingum, Noble, Perry, Pickaway, Pike, Portage, Ross, Stark, Summit, Trumbull, Vinton, Washington, Wood.",
    "With the set aside requirement now satisfied, the Department plans to direct the balance of its ARPA Block Grant Funding towards four key areas identified by stakeholders as priorities: innovation and modernization of Ohio’s behavioral health data and technology systems; workforce development; strengthening Ohio’s crisis services continuum; and enhancing strategic cross-systems collaboration.",
    "These supplemental funds to the block grants from the American Rescue Plan Act (ARPA) infuse desperately needed resources into areas most needed by the behavioral health field, like prevention, crisis, technology, and workforce, all of which are important to build strong bridges to a future of health and wellness for all Ohioans.",
    "(COLUMBUS, Ohio)—Ohio Governor Mike DeWine today announced that $14.9 million in American Rescue Plan (ARPA) Supplemental Block Grants funds will be used to help strengthen Ohio’s statewide mental health and addiction care services system, specifically in the areas of youth prevention and early intervention services.",
    "About Block Grant Funding\nThe Mental Health (MH) and Substance Abuse Prevention and Treatment (SAPT) block grant dollars are federal investments, and OhioMHAS has historically focused these dollars on the sustainability of Ohio’s system of behavioral health services and supports at the local and state levels.",
    "As a condition of this funding, the Substance Abuse and Mental Health Services Administration (SAMHSA), required OhioMHAS to set aside 10 percent of the overall Mental Health ARPA Block Grant award for First Episode Psychosis/Early Serious Mental Illness programming and 5 percent for Crisis.",
    "Individuals with first episode psychosis will access specific coordinated specialty care services through their local community mental health center (i.e., case management, education and vocational support and on-site nursing and medication management).",
    "OhioMHAS submitted spending plans to the federal government last Fall, detailing how the state would prioritize $96.8 million in ARPA Block Grant funding ($44.5 million for Mental Health and $52.2 million for Substance Abuse Prevention and Treatment).",
    "“We know that 75% of substance use disorders and mental illness begin before the age of 25, and prevention and early intervention strategies are vital to building resilience and opportunities for long-term health,” said Governor Mike DeWine.",
    "The strategies outlined in Ohio’s spending plan follow SAMSHA’s specific guidance and reflect priorities identified by OhioMHAS key stakeholders, Ohio’s local ADAMH boards, providers, advocates, and Ohioans with lived experience.",
    "The funds will be distributed over the next four years and are broken down as follows:\nPrimary Prevention\n.$5M ($1.25M per year) for community coalitions and youth-led programs to address marijuana and alcohol prevention.",
    "Supplemental COVID Relief funds through the block grants are allowing Ohio to restore and enhance the safety net of services and supports that the pandemic put a great deal of pressure on, exposing gaps and disparities.",
    "Using telehealth to expand services, specialists at the Ohio State University Early Psychosis Intervention Center (EPICENTER) will provide medication management, psychotherapy, and family support and education.",
    "Coordinated Specialty Care for First Episode Psychosis\n.$2.3M to fund two pilot First Episode Psychosis Coordinated Specialty Care Virtual Teams in year two and six additional teams in years three and four.",
    "“We know our front-line providers continue to struggle with the effects of the variants of COVID-19, and these funds will help them continue to provide critically needed services safely,” added Criss.",
    ".$307,926 for the purposes of adopting Healthcare, Outcomes, Network, Education (HONE) developed by Yale University to better collect outcomes on Ohio’s First Episode Psychosis clients.",
    "Additional resources:\nOhioMHAS Prevention Services Strategic Plan 2021-2024:\nhttps://mha.ohio.gov/static/learnandfindhelp/PreventionServices/prevention-strategic-plan.pdf",
    "SAMHSA also required that 20 percent of the Substance Abuse Prevention and Treatment ARPA Block Grant be earmarked for primary prevention.",
    "These funds will be awarded on a competitive basis with a goal of reaching up to 250,000 individuals over the next four years.",
    ".$5.4M to support public health campaigns designed to enhance the perception of harm of alcohol and marijuana use.",
    "The Department will be sharing additional details on these investments in the near future.",
    "These are one-time allocations to Ohio’s ADAMH boards for local distribution.",
    "They are also aligned with the OhioMHAS 2021-2024 Strategic Plan.",
    "EPICENTER will provide training and ongoing consultation."
  ]
}