{
  "id": 3599,
  "mediaId": 2512,
  "date": "2022-01-25",
  "headline": "The far right is trying to oust Ohio’s conservative governor for not being MAGA enough",
  "image": "https://www.alternet.org/media-library/image.png?id=29108535&width=1200&coordinates=0%2C0%2C0%2C190&height=600",
  "link": "https://www.alternet.org/2022/01/the-maga-far-right-is-trying-to-oust-ohios-conservative-governor-report/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    1991,
    1826,
    2143,
    2765,
    1489,
    1126,
    6474
  ],
  "sentences": [
    "In an article published by Politico on January 25, reporters Zach Montellaro and Michael Kruse note that Ohio’s 2022 GOP gubernatorial U.S. Senate primary “is developing as an early test case of intra-party rebellion against a number of Republican governors this year.”\n“DeWine has forged a long and decorated career in Ohio capped off by his governorship — but relations with his own changing party have been challenging at times,” Montellaro and Kruse explain.",
    "The GOP primary could show just how far Trumpism, even without the former president’s direct involvement, can take a challenger against a more traditional conservative governor who clashed with the most strident parts of the Republican base during the pandemic.”\nRenacci’s campaign is being advised by Brad Parscale, Trump’s former campaign manager.",
    "More than a year into Joe Biden’s presidency, the ex-president who Biden unseated, Donald Trump, hasn’t lost his stranglehold on the Republican Party — and conservative Republicans who are considered insufficiently Trumpian are facing aggressive GOP primary challenges in the 2022 midterms.",
    "Montellaro and Kruse quote Parscale as saying, “Jim Renacci's the only Trump candidate, and it is clear from the data that Mike DeWine is the anti-Trump candidate.”\nHow well Renacci would perform against a Democratic nominee in the general election remains to be seen.",
    "In Ohio’s 2018 U.S. Senate race, Renacci lost to incumbent Democratic Sen. Sherrod Brown by almost 7% — whereas DeWine defeated Democratic gubernatorial nominee Richard Cordray by 4% that year.",
    "DeWine favored social distancing restrictions in Ohio in 2020, and he has aggressively encouraged residents of the Buckeye State to get vaccinated for COVID-19.",
    "Weaver told Politico, “Although some folks in the base are not happy with him because of the COVID decisions, he’s the most durable brand in Ohio politics….",
    "Ironically, Trump himself has recently been encouraging Americans to receive COVID-19 vaccines and booster shots, noting that he has had a booster shot.",
    "Former Ohio Deputy Attorney General Mark Weaver, a long-time DeWine ally, doesn’t believe that Renacci poses a real threat to the governor.",
    "According to a survey conducted by GOP pollster Fabrizio Lee, Ohio Republicans in that state favor Renacci over DeWine 46-38%.",
    "As MAGA extremists see it, DeWine deserves to be voted out of office because of his response to the COVID-19 pandemic.",
    "“Renacci, meanwhile, has molded his campaign in Trump’s image — though he lacks Trump’s actual endorsement so far.",
    "Ohio is also where a bitter, ugly GOP Senate primary has been taking place, with “Hillbilly Elegy” author J.D.",
    "Vance and former Ohio State Treasurer Josh Mandel competing to show who is the most MAGA.",
    "Rob Portman of Ohio, a conservative Republican, is not seeking reelection.",
    "He’s a known quantity, and he knows how to campaign in the state.”",
    "Mike DeWine, who is being challenged by former Rep. Jim Renacci.",
    "Renacci’s message: DeWine isn’t MAGA enough.",
    "One of them is Ohio Gov.",
    "Sen."
  ]
}