{
  "id": 3648,
  "mediaId": 2520,
  "date": "2022-01-21",
  "headline": "Intel announces new microchip plant in Ohio, following similar move in Arizona",
  "image": "https://www.gannett-cdn.com/presto/2022/01/21/NCOD/f8d54f27-1074-4426-aa77-3441529811b6-Intel_Rendering_Beauty.jpg?crop=5099,2869,x0,y330&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/money/business/jobs/2022/01/21/new-intel-microchip-factory-ohio-follows-developments-arizona/6609195001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban voting machines Ducey signs COVID-19 inspired bans into law\nSince the beginning of 2021, the semiconductor industry has announced $80 billion in new projects in the U.S., according to the White House.",
    "The announcement comes about 10 months after the computer chip giant said it would spend $20 billion to build two additional factories in Arizona, a move heralded as the largest private-sector investment in that state's history.",
    "The COVID-19 pandemic has led to a shortage of semiconductor microchips, which power thousands of products such as cars, cell phones, appliances, gaming consoles and medical devices.",
    "“Ultimately, we hope to establish the largest semiconductor manufacturing site on the planet,’’ Intel CEO Pat Gelsinger and Senior Vice President Keyvan Esfarjani told Ohio Gov.",
    "USA TODAY and The Arizona Republic\nIntel, the world's largest semiconductor manufacturer announced plans Friday to build a new $20 billion factory outside of Columbus, Ohio.",
    "The new factories in Ohio and Arizona come as Congress considers the CHIPS for America Act, which would provide $52 billion to incentivize future semiconductor investments.",
    "The Ohio project, which will be Intel's first new manufacturing site in 40 years, includes two semiconductor fabrication plants, or what the company calls fabs.",
    "The Ohio project, which will be Intel's first new manufacturing site in 40 years, includes two semiconductor fabrication plants, or what the company calls fabs.",
    "It eventually could involve eight factories and $100 billion in investment over the next decade, including Intel and its suppliers and partners.",
    "It eventually could involve eight factories and $100 billion in investment over the next decade, including Intel and its suppliers and partners.",
    "The shortage depleted vehicle inventory, producing global supply chain issues and increasing consumer prices on automobiles and other goods.",
    "Arizona also landed the first U.S. site of Taiwan Semiconductor Manufacturing Co., which is building a $12 billion factory in north Phoenix.",
    "This article includes information from USA TODAY reporters Joey Garrison and Mark Williams and Arizona Republic reporter Russ Wiles.",
    "Currently, 12% of the world's chips are made in the U.S., down from 37% in the 1990s, according to industry officials.",
    "The Ohio project is expected to create 3,000 construction jobs and an additional 7,000 construction jobs.",
    "Construction is expected to start this year, with the first chips being produced by 2025.",
    "Construction is expected to start this year, with the first chips being produced by 2025.",
    "The new factories are being developed at Intel's current campus in Chandler.",
    "Increasingly, the U.S. has relied on foreign import of computer chips.",
    "Jon Husted in a letter last month.",
    "Subscribe to azcentral.com today.",
    "About 80% are made in Asia.",
    "Support local journalism.",
    "Mike DeWine and Lt. Gov."
  ]
}