{
  "id": 371,
  "mediaId": 8498,
  "date": "2022-02-21",
  "headline": "As the Supreme Court deliberates abortion rights, access is already limited in the Ohio Valley",
  "image": "https://woub.org/wp-content/uploads/2022/02/feat-e1645471409770.jpg",
  "link": "https://woub.org/2022/02/21/as-supreme-court-deliberates-abortion-rights-access-already-limited-in-ohio-valley/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "We never would want to pit mothers against their children.”\nParker said Ohio Right to Life wants to empower women just as much as their opposing side does, but that “abortion is an evil that we will not accept.”\nReligious objection is a common theme amongst the anti-abortion movement, with many churches and faith-based organizations taking vocal stances against the procedure.",
    "So it’s just kind of like a vicious cycle of not like keeping this taboo outlook on sex education.”\nThese experiences helped influence Clark’s work with Sexy Sex Ed, a sex education group that works with teenagers in Kentucky to provide sex education that teaches anatomy, consent, sexual safety and other topics not legally required by the public school system.",
    "Because we’re already economically depressed and then you add another child into that situation when it’s not something you necessarily want or can necessarily afford.”\nBut Clark says the problem goes beyond abortion restrictions and lack of transportation, all the way back to how schools teach kids and adolescents about sex.",
    "“We have seen an increase in aggressiveness and assertiveness in the protesters since last January, really since the insurrection, the same kind of characters we’re seeing that we didn’t necessarily see by our facility previously.”\nIn April 2021, a Columbus, Ohio man called in a bomb threat to an area women’s health center.",
    "Republican Rep. Nancy Tate, the bill’s sponsor, said the measure is a “compassionate approach.”\n“As a parent and grandparent, it’s hard to absorb the fact that children as young as 13 are undergoing an abortion with minimal consideration for their long-term mental or physical health.",
    "“The conversations that are happening around sex education are more shame-based conversations, which is scary for young people.”\nPublic transportation is not widely available in the Appalachian region, which Clark says leaves many without access to the medical care that they need.",
    "The West Virginia Women’s Health Center in Charleston provides abortions up to 17 weeks and 6 days into a pregnancy, just over two weeks earlier than the current legal limit\nSamantha Facemire, an escort volunteer, said patients frequently drive long distances for services.",
    "And it would create new restrictions for medication abortions–generally used up to the 10th week of pregnancy–requiring doctors to tell a patient that the process can be reversed by taking further medication, an ineffective and potentially harmful procedure.",
    "Not just the job that you’re paid to do, but your job as a neighbor, as a human.”\nWorking as an escort volunteer has given Facemire plenty of opportunities to support people, she says, something that benefits not only the patients, but also her son.",
    "“I can remember having friends who were afraid that they were pregnant, and in the hallway, figuring out a way to get this person to an abortion clinic, figuring out how to like pay for an abortion, how to keep it from their parents,” Clark said.",
    "It affects everyone.”\nOpposition to abortion is more visible\nAs the conversation around abortion continues to be at the forefront of politics in the U.S., anti-abortion protests outside of providers and government buildings are increasing.",
    "Trimble Local Schools To Put Five-Year Levy On Ballot Vote Planned for $213M Face-Lift to Historic Cincinnati Train Station Belmont County Jail Adds to Security with Body Scanner West Virginia To Get $2.4M For Road, Schools Flood Damage",
    "Studies show that traveling longer distances for abortion services is associated with an increased financial and emotional burden on patients, along with an increased likelihood of needing emergency medical services after the procedure.",
    "Rovetti said that’s led to an increase in protesters at her facility\n“Now that we are the only provider in town, we have now doubled the protesters because now they’ve all transferred to us, which is very difficult,” Rovetti said.",
    "In West Virginia, an employee at an abortion provider filed a restraining order against former House of Delegates member Derrick Evans in 2019, alleging he stalked her and posted her personal information on a Facebook page.",
    "Before the Roe v. Wade ruling was handed down in 1973, the Southern Baptist Convention passed an official resolution in 1971 supporting the right to abortion in cases of rape, incest or when a woman’s health is at risk.",
    "Multiple abortion restriction bills have been signed by Ohio Republican Governor Mike DeWine in recent years, including Senate Bill 157, the “Born-Alive Infant Protection Act,” which he signed in December 2021.",
    "Currently a Mississippi case pending in the U.S. Supreme Court may overturn Roe v. Wade, as the high court deliberates whether the state should be allowed to ban abortion after the 15th week of pregnancy.",
    "Trigger laws, six-week bans and other legislation in multiple states mean that if the Supreme Court overturns Roe vs. Wade in the summer, abortion could be functionally banned in roughly half the country.",
    "For many people in rural parts of the Ohio Valley, wading through a sea of anti-abortion protesters is a jarring experience that can only take place after hours of driving, sometimes across state lines.",
    "For portions of southeastern Kentucky, Knoxville’s Center for Reproductive Health is the closest abortion provider, especially after the 2017 closure of a women’s health center in Lexington.",
    "“It’s a place of death,” calls out a tall man, as his two young daughters walk back and forth across the sidewalk with flyers and pamphlets to hand people as they pull into the parking lot.",
    "Patients have few options in rural areas of the Ohio Valley like Harlan, Kentucky, where the nearest abortion providers are three hours away in Knoxville and four hours away in Louisville.",
    "The Knoxville Center for Reproductive Health became the only abortion provider in the city after an arsonist burned down the East Knoxville Planned Parenthood on New Years Eve last year.",
    "During a recent debate on the House floor, Democratic lawmakers Lisa Zukoff and Barbara Fleischauer moved to include exceptions for instances of rape or incest, but the effort failed.",
    "The declining numbers follow a legislative trend of increasing abortion restrictions, with 2021 setting the record for the largest number of restrictions enacted within a single year.",
    "The 1973 landmark U.S. Supreme Court decision Roe v. Wade forbids states from restricting access to abortion before the point a fetus can be viable outside the womb–roughly 24 weeks.",
    "“They would have to stay overnight and figure out how to get money to pay for a hotel room, have someone take them and also try to keep all of that from their parents,” Clark said.",
    "Abortion restrictions are on the rise\nIn Kentucky, Republican lawmakers recently introduced House Bill 3 which would make it more difficult for minors to get an abortion.",
    "Samantha Facemire, the abortion escort volunteer in Charleston, West Virginia, has seen both sides of the issue, having been raised by a conservative Christian family.",
    "Over the last five years, the number of abortion providers has decreased from three to two in Kentucky, three to one in West Virginia and fourteen to six in Ohio.",
    "0+1\n0Like\n0Share\n< < Back to\nKNOXVILLE, Tennessee (OVR) – On a cold Wednesday morning in February, cars arrive at an abortion provider in Knoxville, Tennessee.",
    "As a doctor at the only abortion provider in the city, she believes that protests are becoming more aggressive due to intense politicization of the issue.",
    "We owe it to these children to ensure their best interests are considered when these life-altering medical decisions are made,” Tate said in a statement.",
    "Corinne Rovetti, a nurse at the center, said the facility has long been a resource for people around the region who don’t have easy access to abortions.",
    "In Kentucky, there is no comprehensive sex education policy, only requirements that schools provide some type of sex education and encourage abstinence.",
    "“I’m pretty sure we’ve received Texas patients since Texas enacted their shenanigans.”\nTexas recently banned abortions after the 6th week of pregnancy.",
    "The centers often provide health care services including STI testing, hormone replacement therapy, birth control and cancer screenings, among others.",
    "Both Kentucky and Ohio currently have “heartbeat” abortion bans on the books that would forbid the procedure once a fetal heartbeat can be detected.",
    "They huddle and develop a new strategy: shouting in the window of the facility, where they know someone is on the other side, talking to the doctor.",
    "Failure to do so and fill out the proper forms to report the incident to the state could lead to a third-degree felony charge for the physicians.",
    "Advocates warn that could lead to the closure of two facilities, Women’s Med in Dayton and Planned Parenthood of Southwest Ohio in Mount Auburn.",
    "Back in Knoxville, anti-abortion protestors gather again at four corners of a busy intersection by the Knoxville Center for Reproductive Health.",
    "Correction (2/23/2022, 1:50 p.m.): The Women’s Health Center of West Virginia provides abortions up to 17 weeks and 6 days into a pregnancy.",
    "Shaylan Clark is a 25 year-old peer sex educator in eastern Kentucky and says this puts young people in a particularly difficult position.",
    "Proper identification would be required, as would an affidavit from the physician stating that they secured consent before the procedure.",
    "Traveling for care is more common\nDespite current and looming restrictions, the only abortion provider in West Virginia remains busy.",
    "“Reproductive health and abortion rights go hand-in-hand, abortion is reproductive health, abortion is universal health,” Clark said.",
    "In Ohio, anti-abortion groups like Ohio Right to Life are actively working to end abortion except when a mother’s life is at risk.",
    "“These people’s paths are their own and what choices they make impact my life in no way, and supporting them is what your job is.",
    "“There’s not a lot of options for people to take care of themselves the way they should with the quality of life,” Facemire said.",
    "West Virginia and Kentucky have the fourth and fifth highest poverty levels in the country, respectively, and Ohio has the 17th.",
    "Incidents where abortions result in live births are extremely rare, according to the Centers for Disease Control and Prevention.",
    "They pray for the women arriving at the facility and reach for them, telling them they’d adopt their child if given the chance.",
    "Around him, others hold signs with Bible verses and phrases like “Abortion is Murder.”\n“We’re here to help you!” says another.",
    "She says she was formerly against abortion, but her work delivering babies as a doula opened her eyes to other possibilities.",
    "“The one thing that my parents taught me, but it wasn’t really modeled, is that you treat people how you want to be treated.",
    "Facemire, the abortion escort in Charleston, says people seeking abortions in the region are often in desperate situations.",
    "The women wait for an escort in a fluorescent pink vest to come to their cars, and are quickly walked into the building.",
    "“At the end of the day these women deserve our compassion and care and abortion just adds another trauma,” Parker said.",
    "The measure requires physicians to try and save the life of an infant who is born alive after an attempted abortion.",
    "The Ohio measure also bans doctors who work with state-funded medical schools from working with abortion providers.",
    "The women inside their cars are met with a line of people, mostly men, on either side of the parking lot entrance.",
    "Mary Parker, legislative director for Ohio Right to Life, says ending abortion is aligned with the state’s values.",
    "Rovetti, the nurse at the Knoxville Center for Reproductive Health, has seen first-hand how the protests evolved.",
    "A fetal heartbeat may be detected as early as five-and-a-half weeks, earlier than many pregnancies are detected.",
    "The Mississippi measure is almost identical to the ban currently being debated in the West Virginia statehouse.",
    "The measures have been blocked while lawsuits against them make their way through the federal courts system.",
    "Ohio passed a six-week ban in 2019 that was blocked by a federal court and West Virginia has a pre-Roe ban.",
    "“I think having access to your own autonomy and what you want to do with your body, I think it’s freedom.",
    "In many states, including Ohio and Tennessee, the law requires two visits, the first with counseling.",
    "Parker believes that most women who have had abortions in those situations “regret” their decision.",
    "Under the bill, minors seeking an abortion would require the consent of both parents or guardians.",
    "It would create a higher standard for judges to approve the procedure without parental approval.",
    "“And certainly that has increased, you know, with the restrictions and closures,” Rovetti said.",
    "So when you pull in for that first appointment, you know you’ll have to do this all over again.",
    "The conservative-leaning court is expected to make its decision on the case in June this year.",
    "“I’ve seen people from New Jersey, I’ve seen license plates from Nebraska,” Facemire said.",
    "If one day we have to close the door as we’re leaving, then that’s what we’ll have to do.",
    "“We’ve seen things become much more radicalized as the years have passed,” Rovetti said.",
    "“They want to teach abstinence only sex ed – which is statistically proven not to work.",
    "In West Virginia, House Bill 4004 would ban abortions after the 15th week of pregnancy.",
    "“Don’t turn your back on God,” calls one protester, who calls himself Reverend Scott.",
    "Kentucky has a law that would totally ban abortion in the state if Roe is overturned.",
    "The bill excludes abortions for medical emergencies or severe fetal abnormalities.",
    "Evans also stormed the Capitol during the Jan. 6, 2021 U.S. Capitol insurrection.",
    "And new restrictions are proposed in Kentucky, Ohio and West Virginia this year.",
    "He pleaded guilty to the charges earlier this month and is awaiting sentencing.",
    "Even though the protests can be stressful, Rovetti says the work is worthwhile.",
    "Patients at women’s health centers are not always there for abortion services.",
    "“There’s an issue with transportation, and there’s zero public transportation.",
    "He also threatened to kill a patient who he believed was seeking an abortion.",
    "Experts say both could be reinstated depending on the high court’s ruling.",
    "“Come home to God,” shout the protestors, as the door shuts behind them.",
    "Ohio Right to Life does not support abortion in cases of rape or incest.",
    "“We are a pro-life state and we have a pro-life majority,” Parker said.",
    "I keep telling our staff, we do what we do best, we show up every day.",
    "If they need to see an OBGYN, if they need to get tested?” Clark said.",
    "The facility had its doors and windows shot in earlier in the year.",
    "Travel to abortion providers can be a financial burden for some.",
    "All three states ban abortions after the 20th week of pregnancy.",
    "And we’re going to be here and we’re going to provide services.",
    "Abortion restrictions reach much further than the Ohio Valley.",
    "The bill includes no exceptions for cases of rape or incest.",
    "“So like, it’s not something that just affects a few people.",
    "Access to abortion services is dwindling across the region.",
    "The proposal will now be considered by the state Senate.",
    "This is something that I’m modeling for my child.",
    "He’s nine, he knows what I do,” Facemire said.",
    "“Trying to ban abortion doesn’t stop abortion.",
    "It just stops safe abortions,” Facemire said.",
    "You take care of others, stand up to bullies.",
    "Up until the moment we can’t,” Rovetti said.",
    "The nearest hospital is 45 minutes away.",
    "So how are they supposed to get there?",
    "“The anxiety and stress is in the air.",
    "But we’re going to put up that fight.",
    "“Both mother and child are a victim.",
    "But, this wasn’t always the case.",
    "This is not something we hide.",
    "And we will continue to do so.",
    "Clark says that’s a problem."
  ]
}