{
  "id": 374,
  "mediaId": 8480,
  "date": "2022-02-22",
  "headline": "Preble county to build children’s storybook trail",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2020/03/dnr-trails_36804852_ver1.0.jpg?w=1280",
  "link": "https://www.wdtn.com/news/local-news/preble-county-to-build-childrens-storybook-trails/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’m excited that even more communities will be able to build these trails and encourage children to learn in a really fun way, all while teaching them the importance of protecting our natural resources.”\nThe grants will be handed out as follows:\nThe Village of Lewisburg in Preble County will receive $7,856 for a storybook walking path at Lewisburg Community Park\nGoshen Township Memorial Park in Champaign County will receive $5,160.80 to create a new Mechanicsburg story walk\nThe Ashland County Park District will receive $5,173 for a new trail at Byers Woods\nThe Village of Chauncey in Athens County will be awarded $5,233.19 to expand their story walk trail along the Bailey’s Trail System\nThe Black Swamp Conservancy will be awarded $5,060 for the creation of a permanent storybook trail at the Dr. Robert L. Nehls Memorial Nature Preserve\nThese grants, awarded as part of the Recreational Trails Grant Program, are made in partnership with the Ohio Governor’s Imagination Library and Dolly Parton’s Imagination Library.",
    "“Developing an appreciation for reading at a young age is so important for children as they grow, and we are excited to award these grants to help more communities combine the love of reading with the love of nature,” said Governor DeWine.",
    "These grants will not only fund trail construction but also maintenance and storybook signage for each trail, the release said, much like the 11 Storybook Trails located at state parks across Ohio.",
    "According to a release by DeWine, the state of Ohio has awarded over $28,000 for new or improved children’s literacy trails in Ashland, Athens, Champaign, Ottowa and Preble counties.",
    "COLUMBUS, Ohio (WDTN) – Preble and Champaign Counties will be getting new children’s literacy trails as part of a grant given to five Ohio counties, Governor Mike DeWine said.",
    "“These trails give families a new and exciting way to get out and spend time,” said ODNR Director Mary Mertz.",
    "For an interactive map of Ohio’s Storybook Trails and other trails like them, click here."
  ]
}