{
  "id": 3783,
  "mediaId": 8496,
  "date": "2022-01-21",
  "headline": "'A great day in Ohio history': Intel announces $20 billion plan to build 2 new factories with 20,000 jobs",
  "image": "https://media.wkyc.com/assets/WKYC/images/bd0e1cbc-b334-4fca-8239-7d14cca32d3b/bd0e1cbc-b334-4fca-8239-7d14cca32d3b_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/intel-announcement-licking-county-ohio-governor-mike-dewine/95-bf5cc066-fe33-4d9c-91d6-640bb53da0ac",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "(Credit: Intel Corporation)\nThe Intel project's site breaks down the plan on the following ideas:\n70% of semiconductors are produced in Asia\nForeign-built chips create national security risks\nHundreds of thousands of manufacturing jobs have left the U.S.\nA shortage of chips is strangling more than 300 downstream economic sectors and puts 26 million jobs at risk\nU.S.-based Intel chose Ohio to launch a new hi-tech campus to manufacture semiconductors.",
    "Mike DeWine announced Friday that Intel plans to invest more than $20 billion in Ohio “to build two state-of-the-art factories by 2025.”\nIntel has selected a site in central Ohio within Licking County as the future home for what is being called the company’s “most advanced semiconductor manufacturing facilities in the world.”\nIn total, the project is expected to add $2.8 billion to Ohio’s annual gross state product, according to a press release.",
    "Also known as “chips,” Intel’s semiconductors are widely used, including for:\nComputers and smartphones\nCloud devices\nMedical equipment\nThe Internet of Things\nMilitary defense systems\nDespite being a key building block in almost every piece of technology we use, only 12 percent of semiconductors were manufactured in the United States in 2020.",
    "“With the project announced today, we are establishing an entirely new industry sector that currently does not exist in our state, and along with it, we are rebuilding for America a sustainable, resilient domestic supply chain of semiconductors, which is critical to our national and economic security.”\nGov.",
    "The success of these companies will create new jobs, fuel growth in other key Ohio industry sectors, and position Ohio at the center of America’s industrial innovation.”\nA rendering shows early plans for two new leading-edge Intel processor factories in Licking County, Ohio.",
    "“Advanced manufacturing, research and development, and talent are part of Ohio’s DNA, and we are proud that chips — which power the future — will be made in Ohio, by Ohioans.”\nIntel says this new Ohio location will be the company’s first new manufacturing site in 40 years.",
    "Intel envisions building its future in Ohio because generations of visionary Ohioans built the ideal foundation — a great place to live and work combined with a spirit of dedication to excellence and pride in hard work,” JobsOhio president and CEO J.P. Nauseef noted.",
    "“Just as candles gave way to light bulbs, carriages gave way to cars and now engines to battery packs, we must continue to attract the businesses and jobs of the future to make sure Ohioans, their children, and their grandchildren can prosper here,” Lt.",
    "“Today, we take an important step toward our goal to rebalance global chipmaking capacity and help boost production to meet the surging demand for advanced semiconductors, powering a new generation of innovative products,” says Intel CEO Pat Gelsinger.",
    "#IntelOhio #BuiltForThis pic.twitter.com/JPxDU4SwaJ\n— Governor Mike DeWine (@GovMikeDeWine) January 21, 2022\n“The initial manufacturing facilities (known in the industry as FABs or foundries) will be located on a 926-acre site in Licking County,” Gov.",
    "Senator Sherrod Brown (D): “Today, we are burying the term ‘rust belt.’ Intel’s record investment in our state confirms what we already know: Ohio workers represent the vibrant, dynamic workforce who will lead our country into the future,” said Brown.",
    "“For 11 years, JobsOhio has been proud to work with the state administration, our network partners, and stakeholders across the state to provide Ohio a competitive advantage in attracting and growing some of the world’s most important businesses.",
    "We want the world to know that Ohio’s Future is Built with Intel and is open to business from other companies that want to come alongside.”\nYou can watch Friday's announcement event in the player below:\nU.S.",
    "This move will create thousands of high-paying jobs, secure America’s chip supply chain, launch the semiconductor sector in the state, and reinforce Ohio as a magnet for attracting talent and businesses.",
    "This project will make Ohio a national leader for domestic semiconductor manufacturing and puts Ohioans at the forefront of making built-in-the-USA products that are safeguarding our national security.",
    "DeWine’s team added that this chip production is critical to key Ohio sectors like automotive, advanced mobility, aerospace, aviation, consumer goods, data centers, defense, healthcare and technology.",
    "“Intel’s new facilities will be transformative for our state, creating thousands of good-paying jobs in Ohio manufacturing strategically vital semiconductors, often called ‘chips,’ he said.",
    "More than 140 existing Ohio businesses across the state are already Intel suppliers, and the project is expected to bring additional new businesses to Ohio to support the supply chain.",
    "Now more than ever, critical components need to be made here at home instead of relying on overseas manufacturing.”\nOhio House Speaker Bob Cupp: “This is an historic day for Ohio.",
    "“The new factories we’ll build in Ohio are part of our strategy to increase semiconductor R&D and global manufacturing capacity and restore U.S. semi manufacturing leadership.",
    "\"It is so vitally important that we make semiconductor chips here in the United States, and there is no better place to manufacture them than in Ohio,\" the governor added.",
    "We know how to speed up our supply chains, lower prices, and better compete with China: make more things in America – and there’s no better place to do it than Ohio.”\nU.S.",
    "It’s expected to generate more than 20,000 jobs in the state – including 3,000 direct Intel jobs, earning an average of $135,000 per year (plus benefits).",
    "On top of a highly strained global supply chain, it means that American consumers, and our government, are facing a serious shortage of essential chips.",
    "DeWine’s office noted that the United States was a world leader in chip production back in 1990 with 40 percent of the world’s production capacity.",
    "Announced on Jan. 21, 2022, the $20 billion project spans nearly 1,000 acres and is the largest single private-sector investment in Ohio history.",
    "Announced on Jan. 21, 2022, the $20 billion project spans nearly 1,000 acres and is the largest single private-sector investment in Ohio history.",
    "This is a project that will have a profound economic impact not only in Licking County but throughout Ohio for decades to come.”\nMORE HEADLINES:",
    "This project will also mean thousands of additional indirect and support jobs that include contracted positions, electricians and engineers.",
    "“This plant will mean 10,000 new, good-paying jobs, and it will position Ohio as the national leader in this critical, growing industry.",
    "We expect Intel Ohio will become one of the largest semiconductor manufacturing sites in the world over the next decade.”\nGov.",
    "It’s expected to generate more than 20,000 jobs, which include 3,000 direct Intel jobs with an average of $135,000 per year.",
    "SUBSCRIBE: Get the day's top local and national headlines sent to your email inbox each weekday morning with 3News to GO!",
    "Intel is a world-class company and Ohio is well situated to be the home of their new semiconductor manufacturing center.",
    "Ohio Senate President Matt Huffman: \"This is a powerful development for Ohio's economy, jobs, and national security.",
    "newsletter\nA rendering shows early plans for two new leading-edge Intel processor factories in Licking County, Ohio.",
    "DeWine’s office says this project will be the largest single private sector company investment in Ohio’s history.",
    "Intel’s semiconductors are crucial to the automotive, aerospace, consumer goods, data center and defense sectors.",
    "Intel’s decision to make semiconductor chips in Ohio builds on our history as a great manufacturing state.",
    "Construction is expected to begin in late 2022, with production coming online at the end of 2025.",
    "Construction is expected to begin in late 2022, with production coming online at the end of 2025.",
    "Senator Rob Portman (R): \"This historic investment is great news for Ohio and for our nation.",
    "Making one chip takes approximately three months and machines worth a combined $150 million.",
    "A formal press conference regarding the Intel announcement was held on Friday afternoon.",
    "During his remarks, DeWine termed the news as \"a great day in Ohio history.\"",
    "There’s also 7,000 construction jobs throughout the course of the build.",
    "Ohioans have a great work ethic, a highly trained workforce.",
    "DeWine said the announcement is “monumental news” for Ohio.",
    "By 2020, however, the nation’s share dipped to 12 percent.",
    "Governor Jon Husted said in the state’s press release.",
    "“Ohio was built for this moment and this industry.",
    "“But the impact will be statewide.",
    "This is a huge win for Ohio and ??",
    "(Credit: Intel Corporation)\nGov.",
    "LICKING COUNTY, Ohio — Gov.",
    "DeWine’s office reveals.",
    "????????-??????????????",
    "It’s a great match.\"",
    "????????????????",
    "????????????.",
    "??????",
    "??????",
    "Gov."
  ]
}