{
  "id": 3879,
  "mediaId": 8465,
  "date": "2022-01-26",
  "headline": "Crisis Care Line of VW receives ARPA grant",
  "image": "https://s0.wp.com/i/blank.jpg",
  "link": "https://thevwindependent.com/news/2022/01/27/crisis-care-line-receives-arpa-grant/",
  "mediaOutlet": "thevwindependent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    367,
    6687
  ],
  "sentences": [
    "“We are happy to provide this funding to help advocates of all professional disciplines work together to respond to family violence and provide coordinated services that improve the public understanding of family violence and enhance all services for victims and their children,” Governor Mike DeWine said.",
    "Administered by the Ohio Department of Public Safety’s Office of Criminal Justice Services (OCJS), the FVPSA federal grant program is the primary federal funding stream dedicated to the support of emergency shelter and related assistance for victims of domestic violence and their children.",
    "VW independent staff and submitted information\nCrisis Care Line of Van Wert has been awarded a $39,767.01 grant to help support victims of family violence, domestic violence, and dating violence during the COVID-19 pandemic.",
    "provide specialized services for children exposed to family violence, domestic violence, or dating violence, underserved populations, and victims who are members of racial and ethnic minority populations.",
    "provide immediate shelter, supportive services, and access to community-based programs for victims of family violence, domestic violence, or dating violence, and their dependents.",
    "Funding will support the establishment, maintenance, and expansion of programs and projects to:\nprevent incidents of family violence, domestic violence, and dating violence.",
    "The grant is coming from the Family Violence Prevention and Services Act (FVPSA) American Rescue Plan Act (ARPA) supplemental funding federal grant program.",
    "Copyright © 2010-2022 The Van Wert Independent — Subscribe to our RSS feed — Web Site Design by J. DeWert Enterprises, LLC",
    "In total, 42 grants worth $2.5 million were awarded to 40 local agencies in 35 counties."
  ]
}