{
  "id": 3907,
  "mediaId": 8494,
  "date": "2022-01-25",
  "headline": "Ohio schools will begin screening kids for dyslexia next fall. A guidebook is in the works.",
  "image": "https://npr.brightspotcdn.com/dims4/default/5d1bc5f/2147483647/strip/true/crop/980x515+0+18/resize/1200x630!/quality/90/?url=https%3A%2F%2Fideastream-production.s3.amazonaws.com%2Fuploads%2F2022%2F1%2F24%2Fshutterstock_1371114032-Veja.jpg",
  "link": "https://www.wksu.org/education/2022-01-25/ohio-schools-will-begin-screening-kids-for-dyslexia-next-fall-a-guidebook-is-in-the-works",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jenny Hamel",
  "authorUrl": "https://www.wksu.org/people/jenny-hamel",
  "termIds": [
    0
  ],
  "sentences": [
    "“These laws are in alignment with a larger portfolio of policies at the state level designed to increase reading achievement, to promote evidence-based practices and to promote instruction and intervention grounded in the science of reading,” Clinton said.",
    "HB 436 not only mandates the dyslexia screenings and the creation of the guidebook by the Ohio Dyslexia Committee, districts must also provide related professional development and establish a multi-sensory instruction certification process.",
    "“Research suggests that when children at risk for reading difficulties receive early and intensive intervention, they have a much stronger chance of achieving grade level reading ability,” Clinton told Ideastream Public Media.",
    "Mike DeWine signed HB 436, Ohio’s Dyslexia Law, which mandated dyslexia screenings to ensure those affected can get the interventions they need, said LM Clinton, ODE’s program administrator for literacy policy.",
    "It’s meant to offer school districts guidance on best practices for screening students who may be at risk for dyslexia and for providing intervention and remediation to students who are identified as dyslexic.",
    "The committee has been working on the guidebook for the last six months, and will spend Tuesday going over nearly 400 public comments to determine if the guidebook needs to be amended.",
    "In subsequent years, only kindergartners will be required to take the screener, but any first through sixth graders can take the screener upon the request of a parent or teacher.",
    "Fourth through sixth graders can take the Tier 1 dyslexia screener if a parent or a teacher, with permission from the parent, requests it.",
    "It’s a first for the state, and the Ohio Department of Education (ODE) wants to ensure school districts are guided in the process.",
    "For the first year, all students in kindergarten through third grade will be required to take a Tier 1 dyslexia screening test.",
    "Starting in the 2022-23 academic year, every school district in Ohio will have to screen its youngest students for dyslexia.",
    "On Tuesday, an 11-member committee formed by ODE, will put the finishing touches on the Ohio Dyslexia Guidebook.",
    "The law aligns with Ohio's broader efforts to raise literacy achievement in Ohio, Clinton said.",
    "To see more, visit WCPN.",
    "In January 2021, Gov.",
    "Copyright 2022 WCPN."
  ]
}