{
  "id": 3944,
  "mediaId": 8496,
  "date": "2022-01-26",
  "headline": "Ohio Gov. Mike DeWine made written policy 'promises' to the gun lobby. Will he keep them?",
  "image": "https://media.wkyc.com/assets/WKYC/images/7a057495-da2c-4d4a-9328-0046b10ee040/7a057495-da2c-4d4a-9328-0046b10ee040_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/politics/ohio-gov-mike-dewine-policy-promises-gun-lobby/95-3bd13a05-3d89-4090-a174-9fb4d395a4b1",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "How these two sets of promises comport is unclear, but the picture could soon come into focus: State lawmakers in the House and Senate have both passed separate but substantially similar versions of legislation to waive permitting, background check and eight-hour training requirements (part of the current law) to carry a concealed handgun in the state.",
    "\"Right now, the Ohio legislature is considering two dangerous bills, one is to eliminate our state’s firearm permit system and the other is to allow teachers to carry firearms in the classroom with minimal training — both pieces of legislation will increase the gun violence crisis we’re facing and put lives at risk,\" he said.",
    "It created a judicial process for family members of people experiencing mental health or substance abuse crises to allow the temporary seizure of their firearms; compelled better data entry for serious crimes into background check systems; and stiffened penalties on different gun crimes.",
    "DeWine told BFA verbally and in writing in the questionnaire that he would sign a a bill repealing the legal duty to try to retreat before responding to an attack with deadly force, according to remarks from Buckeye Firearms lobbyist Rob Sexton and confirmed by the governor’s spokesman.",
    "In November, the Ohio House passed legislation that would allow teachers and other school personnel to bring firearms to school, so long as they receive permission from the school board and 20 hours of specialized training and eight hours of concealed carry training requirements.",
    "Another bill, passed by the House and awaiting Senate review, would empower school boards to allow teachers and other school personnel to carry weapons after 20 hours of specialized training on top of the eight hours required to obtain a concealed carry license.",
    "'He committed to sign constitutional carry'\nDuring the gubernatorial campaign in the 2018 Republican primary, Buckeye Firearms Association, a gun rights advocacy group, issued a questionnaire to candidates asking their views on various policy items.",
    "\"As [DeWine] heads toward his re-election campaign, it would be a heck of a message to send gun owners if he signs constitutional carry and emergency powers [another BFA policy goal] in that same year.",
    "DeWine ignited speculation of a veto when he responded, \"they really should focus on what we sent them\" — a reference to a modest gun restriction package he proposed after the Dayton shooting.",
    "DeWine, as attorney general, convened a working group to propose a recommendation for a \"model curriculum for training armed school employees\" to the Ohio Peace Officer Training Commission.",
    "In an interview earlier this month, before the BFA questionnaire came to light, DeWine refrained from taking explicit stances on various gun bills navigating the legislative process.",
    "Sexton offered a warm, though mixed take on DeWine, who is now facing several primary challengers from his political right seeking to paint him as insufficiently conservative.",
    "I want that person who’s carrying a gun in my child's school or my grandchild's school to have very specific training and scenario based training, and for that to continue.\"",
    "\"Unfortunately, less than two years later, he signed 'Stand Your Ground' legislation into law and there’s been no progress on passing common-sense gun safety measures.\"",
    "\"My attitude toward the bill will depend on what final bill do we get, and it will also depend on, there might be some other things contained in that bill,\" he said.",
    "For instance, when asked whether the government should require gun owners to receive training and a permit before carrying a concealed weapon, DeWine demurred.",
    "In an interview earlier this month, DeWine said the actual number of required training hours is less important than the subject and rigor of the training.",
    "Despite the governor's sometimes-vague public statements about the permitless carry bill, Sexton was confident DeWine would come through for gunowners.",
    "Earlier this month in an interview, DeWine said \"I have not taken a position\" on legislation removing permitting requirements to carry a weapon.",
    "In December 2020, a reporter asked DeWine whether he'd sign the \"stand your ground\" bill lawmakers had just passed removing the duty to retreat.",
    "He provided a copy of the letter on an agreement the Ohio Capital Journal not publish its full contents out of respect for his family’s privacy.",
    "The proposal has gone nowhere in the gun-friendly, Republican dominated legislature during the current and previous general assemblies.",
    "As such, Green said in a statement issued through Moms Demand Action, an anti-gun violence advocacy group, that DeWine let him down.",
    "A similar bill percolated in 2013 that called for the attorney general to establish a model curriculum to train such employees.",
    "Mike DeWine told the gun lobby, in writing, that he'd deliver as governor on two major firearms bills if they reached his desk.",
    "\"As governor, I will do everything that I can to see that something positive comes out of this horrible tragedy,\" DeWine wrote.",
    "\"A lot of our members are very unhappy about his support for Strong Ohio but happy with the duty to retreat,\" Sexton said.",
    "Ohioans 21-and-older would automatically be allowed to carry a concealed firearm they lawfully possess, under the bill.",
    "The governor also promised to 'do everything that I can' to prevent gun violence following the Dayton mass shooting.",
    "About a year later, a young man shot and killed nine people and injured 17 in a mass shooting outside a Dayton bar.",
    "As DeWine signed stand your ground, he lamented the General Assembly's failure to pass his STRONG Ohio bill.",
    "Green, in a statement, said DeWine and other leaders must put the safety of Ohio communities first.",
    "After the funeral, the governor handwrote a letter, obtained by the Ohio Capital Journal, to Green.",
    "He said he'd reserve judgement on the current bill until he knew what kind of training it entails.",
    "The other allowed Ohio adults to carry concealed weapons without training or a background check.",
    "I think it would send a message that he can be counted on for strong, pro-gun legislation.\"",
    "\"I don't think you can answer that unless you know how you’re counting the hours,\" he said.",
    "\"He claimed this issue was his priority and showed up to my father’s funeral,\" Green said.",
    "While we know that can't bring your dad back, we (I) owe it to all victims to try.\"",
    "He declined to answer whether 20 hours, however it's organized, is sufficient.",
    "\"Our expectation is that he lives up to his promises because he has before.\"",
    "COLUMBUS, Ohio — *EDITOR'S NOTE: The above video is from a previous report.",
    "In the aftermath, DeWine attended the funeral of the father of Dion Green.",
    "Green was at the bar with his father that night and watched him die.",
    "\"He committed to sign constitutional carry previously,\" Sexton said.",
    "That recommendation called for 152 hours of training over 19 days.",
    "Regardless, he signed the stand your ground bill two weeks later.",
    "It was the nation's second mass killing in a 24-hour period.",
    "DeWine also indicated he'd support a permitless carry bill.",
    "\"I believe that we can do things to make everyone safer.",
    "One expanded the use of lethal force in self defense.",
    "Now, both sides are awaiting his next move.",
    "\"We have to look at the entire package.",
    "The package had several components.",
    "Green declined an interview.",
    "Where's DeWine on guns?",
    "He promised action.",
    "In 2018, Gov."
  ]
}