{
  "id": 3966,
  "mediaId": 8375,
  "date": "2022-01-27",
  "headline": "County Commissioners show support for museum",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/42/2022/01/web1_thumbnail_IMG_1753-9.jpg",
  "link": "https://www.mydailytribune.com/news/69931/county-commissioners-show-support-for-museum",
  "mediaOutlet": "mydailytribune.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gallipolis Daily Tribune",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "It is our understanding that the Gallipolis Railroad Freight Museum will not only be a museum in the traditional sense, but will also be a hub for education to celebrate our area’s rich history and teach future generations about the contributions and significance of railroads in Southeastern Ohio and the rest of the nation.",
    "We are proud to endorse the concept of a railroad museum to house railroad memorabilia (assisted by the Ohio Historical Connection), as well as a working telegraph office, period furnishings, possible store, model train displays, a rail yard with a working hand car, and rolling stock.",
    "County Grants Administrator Karen Sprague presented the 2021 Ohio Historic Preservation Office (OHPO) Exempt Projects Report for the Community Development Block Grant (CDBG) Funded Projects with environmental reviews completed during 2021.",
    "Your generous award to this important project is yet another demonstration of your outstanding commitment to counties, law enforcement, and the communities they serve.”\nThe commissioners approved the the letter to be sent to the governor.",
    "These projects include the 2020 CDBG Target of Opportunity Grant- Gallia County DD School Roof Replacement Project and the 2018 CDBG CHIP Grant – one rehabilitation project in Gallipolis and one home repair project in Middleport.",
    "The letter read, “Dear Governor DeWine, The Gallia County Commissioners express our sincere gratitude for the generous award of $5,500,000 received through SB 310 Capital Improvement Funding for Local Jails Projects.",
    "With increased tourism revenue from the museum itself, new jobs and-an increased focus on education and history, we think the museum could serve as the driving force behind a resurgence of Gallipolis.",
    "The Canine Shelter report for the week ending Jan. 9, showed 11 animals coming in, three animals adopted, three animals reclaimed, six animals went to rescues and four animals are in foster homes.",
    "The project will alleviate the risks associated with the current aged and undersized jail while also relieving the escalating financial and logistical strain incurred by out-of-county housing.",
    "GALLIPOLIS — The Gallia County Board of Commissioners recently approved the minutes from the Jan. 13 commission minutes, which included contracts and support letters.",
    "ABM Building and Energy Solutions, John Ferragonio presented findings and recommendations to save energy around the county and thanked the commission for their time.",
    "The letter read, “Dear Mr. Davis, We are writing today to express our support for the Gallipolis Railroad Freight Museum Project that is underway in Gallipolis.",
    "This grant will provide invaluable financial support for the construction of a new 32,222 SF, 120-bed full-service correctional facility in Gallia County.",
    "Thank you for embarking on such an ambitious project.”\nCounty Administrator Melissa Clark presented a letter for Governor Mike Dewine for approval.",
    "Sheriff administrator Heather Casto submitted a prisoner housing contract with Monroe County and an enhanced law enforcement contract for approval.",
    "Clark presented the Annual Summery of Work-related and Injuries Form to be approved and signed by the Montgomery, commission president.",
    "We are also excited about the potential economic development benefits such a project will bring to Gallipolis and the surrounding area.",
    "The bid was from Tim Lally Chevrolet with a total cost of vehicles and delivery for sum not to exceed $164,385.25 for three units.",
    "County treasurer Steve McGhee, chair of the investment committee, presented the fourth quarter 2021 investment report for review.",
    "It was noted that the first amended certificate of estimated resources was presented to the commission board by Clark.",
    "A letter of support for the Gallipolis Railroad Freight Station Museum was presented by Annette Brown, clerk.",
    "One bid was received for the sheriff patrol vehicles and was opened by the commission during the meeting.",
    "The station undergoing renovation was originally built in 1901 and served as a busy freight depot.",
    "We can think of no greater place for such project than southeastern Ohio and downtown Gallipolis.",
    "We look forward to hearing how the museum project is progressing in the months and years to come.",
    "Commissioners approved the report as presented and is on file in the county’s CDBG grant files.",
    "Commissioners Harold Montgomery, Eugene Greene and Jay Stapleton were present for the meeting.",
    "This shows a total of 12 animals out of the shelter and 19 animals remaining at the shelter.",
    "The bid was turned over to the county administrator for review and recommendation.",
    "Finally, we are thrilled to support a project that will tell the railroad story.",
    "It was noted the reports are submitted monthly and meetings are held quarterly.",
    "The report is on file in both the treasurer and commission’s office for review.",
    "Information from Gallia County Commission’s office.",
    "The contracts were approved.",
    "No action was taken."
  ]
}