{
  "id": 3975,
  "mediaId": 8498,
  "date": "2022-01-18",
  "headline": "The panel that will redraw legislative maps meets with Ohio Supreme Court deadline looming",
  "image": "https://woub.org/wp-content/uploads/2022/01/img-3350-2-scaled-e1642545030145.jpg",
  "link": "https://woub.org/2022/01/18/panel-that-will-redraw-legislative-maps-meets-with-ohio-supreme-court-deadline-looming/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Kasler | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/karen-kasler-statehouse-news-bureau/",
  "termIds": [
    0
  ],
  "sentences": [
    "“It’s my understanding, Mr. Chairman, that these discussions have actually been discussions have been going on that those who are actually looking at the maps and have that data in front of them have been talking among themselves.”\nRepublican Secretary of State Frank LaRose said he cast his yes vote on the previous maps with “great unease” and was quoted in the court case as texting his chief of staff: “This rationale is asinine.",
    "“And so let’s not move forward assuming that attempt is unachievable because it has been proven in prior attempts to actually do this.”\nBut Republicans dispute that any map submitted in the previous map drawing process meets all the constitutional criteria, not just the 54%-46% split.",
    "Mike DeWine, who said when he and other Republicans voted to approve those maps that he was “very very sorry that we are where we are”, said there are specific requirements the court laid out for the new maps: for instance, a 54% Republican, 46% Democratic split.",
    "And so we need to reach that finality as quickly as possible.”\nRusso agreed with the other on the panel, co-chair Sen. Vernon Sykes, that the court ruling spells out a 54%-46% split, and that the commission must do that unless they can’t do it.",
    "The Ohio Redistricting Commission has just a few days to produce new Ohio House and Senate maps, after the Ohio Supreme Court ruled the maps the commission approved in September were unconstitutionally gerrymandered toward Republicans.",
    "0+1\n0Like\n0Share\n< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — It was back to work for the seven member commission that spent much of last year drawing new district maps for state lawmakers and Ohio’s Congressional delegation.",
    "The previous maps had more than 64% of state legislative seats favoring Republicans, which the Ohio Supreme Court ruled violated the constitutional amendment voters approved in 2015 to take partisanship out of redistricting.",
    "After the meeting, Sykes and his Republican co-chair Speaker Bob Cupp took questions, with Cupp noting that the new maps are not due on Monday as is typical with government deadlines falling on weekends, but on Saturday.",
    "While public comment will be accepted this time too – via a website that Cupp said will be reactivated – Cupp says it’s still under discussion whether there will be public testimony.",
    "Ten-year maps would require both Democrats to vote for them – which would almost certainly mean a unanimous vote, and quite a change from the process that yielded the previous maps.",
    "And so we have examples to help us and direct us and guide us to make the deadline.”\nAgain, Republicans dispute that constitutional maps were submitted by the public or anyone else.",
    "“We are attempting to comply with the court decision and this has to be, although there’s been work done over the weekend, this is the beginning of the process,” Cupp said.",
    "The Commission also needs to redraw the Congressional map it created that was approved by state lawmakers and signed by DeWine on a party line vote in November.",
    "“As this process continues, we are starting to become perilously close to reaching that point where that may become logistically impossible,” LaRose said.",
    "“Obviously, members should be mindful that no more than three members may be present at any one time when discussing commission matters,” DeWine said.",
    "“We know from the prior work of this commission that there are many maps that have been proposed that meet all of those requirements,” Russo said.",
    "And I am committed to making sure that that happens, but without finality on maps that starts to become mechanically impossible very soon.",
    "There wasn’t much on the first meeting agenda beyond the swearing in of the only new member, House Minority Leader-elect Allison Russo.",
    "This is a second round of map drawing and we have dozens of examples dozens of maps that comply with the percentage breakdowns.",
    "That map had to reduce the delegation from 16 to 15 members, and tipped 12 of those seats toward Republicans.",
    "Sykes added: “I think we should be clear, I think we should be clear that we’re not starting from scratch.",
    "But several members shared their impressions of what the Supreme Court’s ruling means to this new process.",
    "He told the commission he’s very concerned about coming up with maps in time for the May primary.",
    "And she said it has already been done, in the six weeks before the previous maps were approved.",
    "And DeWine said discussions have already started – though they’re not official public meetings.",
    "“Let me be clear, the General Assembly has ordered me to conduct an election on May 3.",
    "It was ruled unconstitutional a few days after the legislative maps were.",
    "I should vote no”.",
    "Gov."
  ]
}