{
  "id": 3978,
  "mediaId": 8379,
  "date": "2022-01-22",
  "headline": "Ohio GOP redistricting proposals adopted by partisan vote",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/01/approved-congressional-maps.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/state-news/ohio-redistricting-proposals-debated-as-deadline-looms/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karina Cheung",
  "authorUrl": "https://www.nbc4i.com/author/karina-cheung/",
  "termIds": [
    0
  ],
  "sentences": [
    "“This is an important night where we want to make sure the redistricting commission ultimately create maps that don’t serve them but instead really represent the people of Ohio,” League of Women Voters representative Jen Miller said Saturday.",
    "“That is essentially 97 percent of the goal, so that, I think, closely corresponds to almost everybody’s dictionary.”\n“It’s questionable whether how much objectivity they could actually have,” said Democratic State Sen. Vernon Sykes.",
    "The Ohio Supreme Court struck down the maps passed by the Republican majority in September, saying the maps unfairly favored Republicans, defying a constitutional amendment passed by the state’s voters in 2015.",
    "“The plan adopted today does not have the requisite amount of Democratic-leaning districts the court directed this commission to achieve,” said Ohio Rep. Allison Russo, the House minority leader-elect.",
    "“Didn’t hit the exact numbers, but came pretty close, and also, I believe, conformed to the constitution in all the other provisions, so I can’t say it’s impossible,” said Ohio Gov.",
    "COLUMBUS, Ohio (WCMH) – The Ohio Redistricting Commission voted along party lines to adopt a Republican proposal to redraw the state’s Senate and House of Representatives districts.",
    "With the 5-2 party-line vote, the commission adopted plans that would create 57 Republican-leaning districts for the state’s House, with 42 Democratic-leaning seats.",
    "“Maybe there’s a map out there, but we didn’t see one.”\nThe commission got started with presentations Saturday, with both Republicans and Democrats making proposals.",
    "During Saturday’s hearing, commission members were able to question each of the proposals, specifically compactness and if Ohio’s constitutional guidelines were met.",
    "The party-line approval failed to meet the bipartisan consensus needed to enact the maps for 10 years; as approved, the maps will be in effect for four years.",
    "The redrawing of that map heads to the General Assembly, which has 30 days from the Jan. 14 court ruling to accomplish the task.",
    "According to the latest data released by the state, Ohio’s political makeup is 54 percent Republican, 46 percent Democratic.",
    "The Ohio League of Women Voters is one of the organizations which filed a lawsuit regarding the previous maps.",
    "“That is just three seats off of a 99-member legislature,” said Republican House Speaker Robert Cupp.",
    "The Democrats’ proposal for the House showed 45 seats leaning Democrat, 54 leaning Republican.",
    "In its September ruling, the court reserved the right to review the commission’s proposal.",
    "On the Senate side, Republicans will have a 20-13 advantage of Republican-leaning seats.",
    "If they fail, the Ohio Redistricting Commission will be tasked with redrawing the map.",
    "On the Senate side, Democrats proposed 15 seats leaning Democrat, 18 Republican.",
    "The Ohio Supreme Court also struck down Ohio’s U.S. Congressional map.",
    "The deadline to pass both redistricting maps was midnight Saturday.",
    "The redistricting battle isn’t over for the General Assembly.",
    "Mike DeWine, who also sits on the committee."
  ]
}