{
  "id": 3986,
  "mediaId": 8480,
  "date": "2022-01-21",
  "headline": "Intel bringing 20,000 jobs, innovation to Ohio",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/01/intel-computer-chips-1.jpg?w=1280",
  "link": "https://www.wdtn.com/news/ohio/intel-bringing-20000-jobs-innovation-to-ohio/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Bean",
  "authorUrl": "https://www.wdtn.com/author/sarah-bean/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Intel’s new facilities will be transformative for our state, creating thousands of good-paying jobs in Ohio manufacturing strategically vital semiconductors, often called ‘chips.’ Advanced manufacturing, research and development, and talent are part of Ohio’s DNA, and we are proud that chips — which power the future — will be made in Ohio, by Ohioans.”\nOhio leaders DeWine and Husted were joined by JobsOhio, One Columbus, and several local, state and federal leaders to announce the project at 2:30 p.m. Friday.",
    "Intel’s announcement today is a signal to China and to the rest of the world that from now on, our central manufactured products in this country will be made in the United States of America.”\n“Just as candles gave way to light bulbs, carriages gave way to cars, and now engines to battery packs, we must continue to attract the businesses and jobs of the future to make sure Ohioans, their children, and their grandchildren can prosper here,” said Lt.",
    "This project will be the largest single private sector company investment in Ohio’s history, the release said, bringing in 3,000 direct Intel jobs and 7,000 construction jobs over the course of the build as well as a variety of other support jobs.",
    "According to a release, the leading semiconductor manufacturer Intel Corporation has chosen a location in Licking County to build two state-of-the-art factories by 2025, both designed to process materials on an atomic level.",
    "And there is no better place to manufacture any of them than right here in Ohio, made by Ohioans.”\nDeWine said the announcement by Intel confirms that it is the state’s time in history.",
    "DeWine said there is a need for more products to be made in the United States, especially as more countries in Asia have a large portion of the world’s chip capacity.",
    "“We expect Intel Ohio will become one of the largest semiconductor manufacturing sites in the world over the next decade,” said Intel CEO Pat Gelsinger.",
    "Support positions include contractors, electricians, engineers, and jobs in restaurants, healthcare, housing and entertainment, among others.",
    "Governor John Husted announced a project expected to bring over 20,000 jobs to Ohio in a variety of positions and fields.",
    "“Today’s announcement is monumental news for the state of Ohio,” said Governor Mike DeWine.",
    "LICKING COUNTY, Ohio (WDTN) – Ohio Governor Mike DeWine and Lt.",
    "“We must make more products right here in the United States.",
    "You can watch the full announcement in the player below.",
    "We have an opportunity to lead once again.",
    "DeWine’s remarks in the player below.",
    "Governor Jon Husted.",
    "“This is our time.",
    "You can watch Gov.",
    "Gov."
  ]
}