{
  "id": 4015,
  "mediaId": 8480,
  "date": "2022-01-24",
  "headline": "Ohio National Guard helping Clark Co. Combined Health District",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/01/National-Guard-CCCHD.jpg?w=1280",
  "link": "https://www.wdtn.com/community/health/coronavirus/the-ohio-national-guard-helping-clark-co-combined-health-district/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Ashley",
  "authorUrl": "https://www.wdtn.com/author/madeline-ashley/",
  "termIds": [
    2614,
    2143,
    2,
    974,
    6065
  ],
  "sentences": [
    "These are true Ohioans helping Ohioans.”\nThe Ohio National Guard Members are expected to stick with CCCHD until mid-February, but Captain Slater said the timing and amount of Guard Members on site is subject to change as they continue following COVID-19 case rates.",
    "CLARK COUNTY, Ohio (WDTN) – With Clark County’s COVID-19 cases sitting at the highest ever in the pandemic, Clark County’s Combined Health District (CCCHD) workers are getting help under the direction of Ohio Governor Mike DeWine from Ohio National Guard members.",
    "“We’re helping anywhere from processing some admin paperwork, returning phone calls, getting people scheduled for those test, and doing our part what we can to help overcome this pandemic,” said 178th Wing Public Affairs leader Captain Courtney Slater.",
    "Things that we’re absolutely qualified and we’re ready to do, step in, and help out where needed.”\nCCCHD Nursing Director Christina Conover said that Mercy Health has lent a helping hand to their team by providing a building for COVID-19 testing.",
    "It helps not only us but our community, so…thank you so much.”\nCaptain Slater said she and the Ohio National Guard members on site are happy to lend a hand.",
    "We have been to kinda increase capacity, but this will definitely help to ensure that capacity is there until the demand is no longer,” said Conover.",
    "As of Monday, 10 Ohio National Guard airmen and soldiers have been stationed to help CCCHD with nonclinical duties.",
    "Currently we don’t have anyone medically trained in here, but we’re also doing a lot of admin support.",
    "“We have diverse backgrounds that are here, which is what really makes the Guard something special.",
    "Captain Slater said Guard members have come from all different professions to help out.",
    "Testing gives people more information to make the best out of their situations.",
    "“I think we’re just very thankful for the guard members to serve in this way.",
    "Conover said she’s also thankful for the help of the National Guard.",
    "“Doing our best to try to meet demand for testing.",
    "We all come from diverse backgrounds.",
    "“I’m extremely proud."
  ]
}