{
  "id": 4049,
  "mediaId": 8480,
  "date": "2022-01-24",
  "headline": "DeWine awards $4.7M in funding for Ohio police body cameras",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2021/11/OSHP-body-cam.jpg?w=1280",
  "link": "https://www.wdtn.com/news/ohio/dewine-awards-4-7m-in-funding-for-ohio-police-body-cameras/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Shatsby",
  "authorUrl": "https://www.wdtn.com/author/katie-shatsby/",
  "termIds": [
    0
  ],
  "sentences": [
    "“With these grants, more than four dozen law enforcement agencies that have never had body cameras before will be able to invest in this technology to help protect their officers and offer transparency to the public.”\nThe governor’s office said that of the 109 agencies, 49 are using the funding to create new body-worn camera programs while the other 60 will dedicate the funding toward expanding or upgrading existing technology.",
    "“They’re definitely a value to us and as time goes on they’re here to stay, law enforcement realizes that and our deputies have accepted this without any problem at all,” said Montgomery County Sheriff’s Office Chief Deputy Daryl Wilson.",
    "“Cameras will also be a huge help in the jails, especially with audio to enforce proper protocol on officers and inmates.”\nBody-worn cameras have been on Mercer County’s deputies since 2015.",
    "“This is just the start of many new ways we’ll be helping law enforcement with state-of-the-art tools and innovative programs to fight crime and protect the public,” said Governor DeWine.",
    "According to the governor’s office, the $4.7 million in grant funding to local law enforcement agencies is for expenses associated with launching or maintaining body-worn camera programs.",
    "Chief Deputy Wilson said the Montgomery County Sheriff’s Office was awarded $38,785 and plans to use the funds to help maintain over 200 body cameras already on deputies.",
    "Mercer County Sheriff’s Office was awarded $43,832.46 and Sheriff Jeff Grey said they plan to use these funds to buy 29 body-cameras for their correctional facility.",
    "“The deputies, police officers and troopers who are putting their lives on the line every day need to know they have support from the top,” said Sheriff Grey.",
    "“We already pull body-camera video once a month on each deputy to make sure deputies are talking to people right and following protocols,” said Sheriff Grey.",
    "In total, this funding will help agencies purchase around 1,700 new body cameras as well as computer equipment, software, video storage and more.",
    "Sheriff Grey believes the law enforcement community welcomes body-worn cameras, not only to encourage transparency but also retain support.",
    "COLUMBUS, Ohio (WDTN) – Governor Mike DeWine awarded over $4.7 million in grant funding to 109 local law enforcement agencies on Monday.",
    "Out of the 109 recipients, nearly 50 of them will be using funds to jumpstart their first body-worn camera programs.",
    "“Body cameras have quickly become a necessary tool for modern policing,” said Governor DeWine.",
    "Last year they spent over $200,000 to purchase those cameras.",
    "To see a full list of program grantees, click here."
  ]
}