{
  "id": 4056,
  "mediaId": 2715,
  "date": "2022-01-22",
  "headline": "What we know about Intel’s $20 billion bet on Ohio",
  "image": "https://cdn.vox-cdn.com/thumbor/ujBxbV9ulvpDToGn6QPehQL_2Pw=/0x73:1100x649/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13892035/intelchips.1419963683.jpg",
  "link": "https://www.theverge.com/2022/1/22/22895447/intel-ohio-chip-fab-manufacturing-cpu-processor-explained",
  "mediaOutlet": "The Verge",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sean Hollister",
  "authorUrl": "https://www.theverge.com/authors/sean-hollister",
  "termIds": [
    2327,
    2594,
    2143,
    4905,
    646,
    5949,
    6026,
    6474
  ],
  "sentences": [
    "The public has never heard evidence of Chinese chips being used to spy on the United States outside of one widely criticized Bloomberg report, but that hasn’t stopped the United States from repeatedly cracking down on Chinese telecommunications vendors in particular due to unspecified national security concerns, and Biden has actually expanded Trump-era bans on American investment in companies with ties to the Chinese military.",
    "Hours later, President Biden, Ohio governor Mike DeWine, US Secretary of Commerce Gina Raimondo, Intel CEO Pat Gelsinger, and other executives and local officials suggested the up-to-$100 billion development could be a panacea for a wide variety of issues, too — including global competitiveness, national security, the chip shortage, the high price of cars, racial and gender gaps in STEM employment, even inflation itself.",
    "But according to Time, the local government will be spending at least a billion: “The state agreed to invest $1 billion in infrastructure improvements, including widening State Route 161, to support the factory and the nearby community.”\nTo win Intel’s interest, Ohio also had to change its laws to offer job creation tax credits for 30 years instead of 15 years to big developments like Intel’s.",
    "As far as global competitiveness, there’s hope that when Intel chooses to build new fabs in the United States, others will follow suit — and that does appear to be happening, with Samsung promising to build a $17 billion advanced chipmaking plant in Taylor, Texas, and both TSMC and its suppliers reportedly mulling additional investments in Arizona.",
    "Intel hasn’t offered details yet, but Gelsinger said in the presentation that it will produce advanced chips at process nodes “2nm and below.”\n“What we have said is that the Ohio factories are designed for the ‘Angstrom era,’ with support for Intel’s most advanced process technologies, including Intel 18A,” an Intel spokesperson tells The Verge.",
    "There’s no question that the investment is a big deal for Intel, which has been clawing its way back from the brink of potential irrelevance by fundamentally changing its entire outlook on the industry: doubling down on manufacturing, building chips for competitors, and relying on some competitors to help build chips of its own.",
    "Intel is also giving itself a decade to spend $100 million on education — “to help develop and attract a pipeline of skilled talent from within the region” — while promising approximately 3,000 Intel jobs, 7,000 construction jobs, and that 140 existing Ohio companies will do business with Intel as suppliers.",
    "To Intel’s credit, its own statements on the subject have been fairly clear: it’s a $20 billion initial investment in two fabs (short for fabrication plants; they typically produce silicon wafers), with construction beginning in late 2022 and the facility expected to open in late 2025.",
    "Every little bit helps, I imagine, but even if the House approved $52 billion in funding for domestic semiconductor manufacturing and Intel spent the full $100 billion in Ohio — again, over a decade — they’ll still be completely dwarfed by chip giants TSMC and Samsung.",
    "There’s one waiting in the wings — Last April, Biden called for federal funding to ease the semiconductor shortage, and the Senate answered in June, passing a bill that would provide $52 billion for domestic semiconductor manufacturing in the United States.",
    "I would argue that Silicon Valley is unique, because it’s about a lot more than semiconductor manufacturing — it’s the mass accumulation of talent and investment and investors themselves, complete with all the problems (like crazy housing prices!)",
    "While the chip shortage is a gigantic supply chain issue that is absolutely affecting the auto industry, leading chipmakers agree it’s slated to ease in the second half of 2022, and this plant won’t be operating until 2025 at the earliest.",
    "“We have a goal of investing as much as $100B over the next decade, but without federal government support, that goal will be difficult to reach in that time frame,” Intel spokesperson William Moss confirmed to The Verge.",
    "There are other forms of national security concerns, too: “If China attacked Taiwan or if North Korea attacked South Korea, the US would not have access to leading edge semiconductors, which is an issue,” says Moorhead.",
    "Intel declined to get into specifics (except to say that tax credits, exemptions, and infrastructure improvements are part of the package), but Ohio Lieutenant Governor Jon Husted seems to have anticipated the question.",
    "“At full buildout, the total investment in the site could grow to as much as $100 billion over the next decade, making it one of the largest semiconductor manufacturing sites in the world,” reads Intel’s press release.",
    "So Biden held up Intel and Ohio as an example of what’s possible if we invest in domestic chipmaking, while raising the specter of national security and global competitiveness concerns if we fail to pass the bill.",
    "However, Samsung’s Pyeongtaek Line 2 is just one of the facilities in the area, and Japan’s Nikkei reports that a new, third Samsung fab will have clean rooms that fit 25 soccer fields, compared to Intel’s four.",
    "The Nikkei report points out that Samsung invests $25 billion each year on chipmaking, and TSMC has earmarked a record $44 billion on manufacturing capacity in 2022 alone, after spending $30 billion in 2021.",
    "But the Biden administration and Ohio really want to be seen doing something important for the economy — and Biden can use it to pressure the House of Representatives to pass a key piece of legislation.",
    "That aside, Time reports that New Albany, Ohio, is far more developed than outsiders might know, is one of the wealthiest places in Ohio, and that Intel isn’t the first big tech company to break ground.",
    "But Intel manufacturing and supply chain boss Keyvan Esfarjani said its Ohio facility might be 30 football fields in size, with clean rooms as large as four football fields each.",
    "In August 2020, Samsung announced that it had begun producing memory chips on the largest production line in the world — Pyeongtaek Line 2, roughly the size of 16 soccer fields.",
    "On Friday, Intel announced it would build the “largest silicon manufacturing location on the planet” here in the United States, on a 1,000-acre plot of land in New Albany, Ohio.",
    "If the actual promise is $20 billion for two fabs, and Intel already spent $20 billion for two new fabs in Arizona, and it won’t ease the shortage, why is this such a big deal?",
    "In November, Margrethe Vestager, head of the EU’s antitrust division, warned that chipmakers might play governments “against each other” to get government subsidies.",
    "90 percent of the most advanced chips are made in Taiwan.”\n“This project will be bigger and faster with the CHIPS Act,” Intel CEO Gelsinger stated on the Biden call.",
    "Technically, the land underneath Intel’s new facilities was part of Jersey Township, until New Albany annexed that exact parcel this year, just ahead of the deal.",
    "None of that stopped US Secretary of Commerce Gina Raimondo and Ohio Governor Mike DeWine from repeatedly bringing up cars and tying them to inflation, though.",
    "“Car prices are driving a third of inflation because we don’t have enough chips,” said Raimondo, adding that each electric vehicle requires 2,000 chips.",
    "“This deal is mostly about diversifying where leading edge manufacturing is done to protect US interests.”\nWhat about economic competitiveness?",
    "During his presentation, Intel’s CEO seemed to have a slightly looser definition:\n“When we moved to Oregon, we established the Silicon Forest.",
    "“Given this fab goes online in 2025 it won’t have any impact on the current chip crisis,” says Moor Insights & Strategy analyst Pat Moorhead.",
    "“If there’s a concrete truck in the state of Ohio that’s not working for me next year, I want to know about it,” joked Gelsinger on the call.",
    "Correction, January 22nd 10:11PM ET: The annexed land is the light region in the upper-right-hand corner of the map, not the dark region.",
    "“We hope to be able to make an announcement about major, new EU investment plans within the next several months,” Intel tells The Verge.",
    "Even though the so-called “CHIPS Act” has bipartisan support, it’s been stalled in the House ever since, so the money isn’t available.",
    "“For every six cents of capital investment Ohio will make, Intel will make a dollar,” he said unprompted during the presentation.",
    "The rest of Intel’s promises are fuzzier — like the idea that the Ohio site might wind up housing eight fabs instead of just two.",
    "Google, Amazon, and Meta all have data centers there — all of them part of the sprawling New Albany International Business Park.",
    "It’s planning to open more fabs in Europe as well — by investing up to 80 billion euros ($90 billion US) over the next decade.",
    "Though the promises may have similarities, we’re not getting any Foxconn-in-Wisconsin vibes from the Intel deal quite yet.",
    "Some quick napkin math: does that mean Ohio is contributing $1.2 billion on top of Intel’s $20 billion?",
    "“So that’s why today’s announcement from Intel is so exciting.”\nWhat will the Ohio plant actually make?",
    "(Intel did buy autonomous driving chip company Mobileye in 2017, but its chips are produced by TSMC.)",
    "But that isn’t a firm commitment — it’s more of a stretch goal if Intel gets federal subsidies.",
    "It appears that Intel liked the idea of being associated with wealthy New Albany, by the way.",
    "We now rank number nine,” said Biden, pointing how much US chip manufacturing has receded.",
    "The phrase “Silicon Heartland” was uttered at least eight times across two livestreams.",
    "It’s the first time Intel’s breaking ground on a new manufacturing site in 40 years.",
    "Remember how Intel’s hoping for a federal subsidy to help build out the Ohio fabs?",
    "Reportedly, Intel will start its European expansion in France, Germany, and Italy.",
    "It could become Ohio’s version of California’s Silicon Valley, several suggested.",
    "Would it actually be the “largest silicon manufacturing location on the planet”?",
    "The initial $20 billion investment doesn’t depend on federal subsidies, though.",
    "(Intel’s Arizona, New Mexico and Oregon expansions joined existing facilities.)",
    "“Until that passed, we weren’t in the game,” Husted told The Columbus Dispatch.",
    "How could any of that solve today’s chip shortage, car prices, and inflation?",
    "Intel suggests the average annual salary at its facilities will be $135,000.",
    "We went to Israel, and we helped to establish the Silicon Oasis,” he said.",
    "When we went to Arizona, we helped to establish the Silicon Desert.",
    "Why does this remind me of a Verge story about empty buildings?",
    "Also, Intel doesn’t produce chips for cars, at least not yet.",
    "What did Ohio promise Intel in exchange for this investment?",
    "“Today, 75 percent of production takes place in East Asia.",
    "We went to Ireland, we helped to create the Silicon Isle.",
    "Intel had nothing to do with the shortage of car chips.",
    "And, of course, it could be a huge deal for Ohio, too.",
    "At that rate, it seems unlikely Intel would catch up.",
    "Is there something to the national security concern?",
    "But Intel isn’t necessarily just playing for the US.",
    "Plus, soccer fields are larger than football fields.",
    "(Here are more “Silicon” place names if you want.)",
    "But it never passed the House of Representatives.",
    "“We were ranked number one in the world in R&D.",
    "As of today, the deal is the exact same size.",
    "What is Intel actually promising in Ohio?",
    "It might be, but probably not for long.",
    "Will Ohio become a new Silicon Valley?",
    "It’s just not a bigger deal.",
    "$100 billion in investment?",
    "Let’s back up a second.",
    "Intel wouldn’t say.",
    "It’s a big deal!",
    "But guess what?",
    "But inflation?",
    "Tell me more.",
    "they cause.",
    "Car prices?",
    "It can’t.",
    "Perhaps."
  ]
}