{
  "id": 4121,
  "mediaId": 8498,
  "date": "2022-01-24",
  "headline": "New House and Senate maps approved by Republicans only, and just hours before deadline",
  "image": "https://woub.org/wp-content/uploads/2022/01/img-1155-e1642778179970.jpe",
  "link": "https://woub.org/2022/01/24/legislative-maps-approved-by-gop-hours-before-deadline/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/andy-chow-statehouse-news-bureau/",
  "termIds": [
    0
  ],
  "sentences": [
    "Ohio Redistricting Commission is back and Senate President Matt Huffman (R-Lima) moves to adopt the Ohio House and Ohio Senate district maps created by Republican legislative leaders pic.twitter.com/vyGLnpmHuZ\n— Andy Chow (@andy_chow) January 23, 2022\nDemocratic members on the Ohio Redistricting Commission say the maps approved on Saturday still fall short of meeting that proportional requirement.",
    "Rep. Allison Russo (D-Upper Arlington), House Minority Caucus Leader-elect, says complying with the proportional requirements would mean 54 Republican to 45 Democratic district split in the Ohio House and an 18 Republican to 15 Democratic district split in the Ohio Senate.",
    "He says the new plans follow what was instructed by the Supreme Court and called the maps “fair.”\nDeWine said the maps come close to reflecting Ohio’s partisan breakdown, saying, “I think we all would have liked to have seen us get to those numbers exactly.",
    "The Supreme Court said those maps, which gave Republicans a 64% majority in the House and Senate, violated changes added to the state constitution by voters in 2015 to avoid gerrymandering, when maps are drawn to favor one political party over another.",
    "The Supreme Court's decision notes Dr. Jonathan Rodden's map was \"compliant with Article XI\" and \"is more proportional to the statewide voter preferences than the plan adopted\" https://t.co/BXjRiJvKhH\n— Karen Kasler (@karenkasler) January 21, 2022",
    "< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — The Republican-drawn maps create 57 Republican to 42 Democratic districts in the Ohio House and 20 Republican districts to 13 Democratic districts in the Ohio Senate.",
    "That ruling said the maps must be redrawn to reflect the state’s partisan breakdown which is about 54% Republican and 46% Democratic, according to an average of statewide race results over 10 years.",
    "“While the majority may claim it is impossible to draw a proportional map that is compliant with line-drawing requirements, that is simply not the case,” Russo said during the commission meeting.",
    "The ACLU of Ohio has said it submitted a map that met all the constitutional requirements and the Republican-Democratic split, and notes it was cited in the ruling throwing out the old maps.",
    "The Ohio Redistricting Commission was working to meet a deadline set by the Ohio Supreme Court when it ruled on January 12 that the previous legislative district maps were unconstitutional.",
    "While those maps reached the proportional threshold laid out in the supreme court ruling, Republicans criticized the Democratic plans for not meeting other constitutional requirements.",
    "“It is shameful that we are here again, adopting yet another unconstitutional map in direct contradiction to the Ohio Supreme Court.”\nBut Republican defended the newly-adopted maps.",
    "That, in fact, those competitive districts could go either direction.”\nThe maps were approved by a 5 to 2 vote, with both Democratic members voting against the plans.",
    "The Democrat map had some pretty blatant violations of the constitution.”\nThe Democratic-drawn House map created 54 Republican districts and 45 Democratic districts.",
    "Senate President Matt Huffman (R-Lima) noted a handful of districts that he said did not meet the requirements of compactness.",
    "The original plaintiffs in the Supreme Court case can review the maps and decide if they want to raise an objection.",
    "@acluohio on Republicans' claims no Ohio House/Senate maps so far meet all constitutional criteria.",
    "All but one of the competitive districts in the new House and Senate maps are Democratic-leaning.",
    "The Democratic-drawn Senate district map has 18 Republican districts and 15 Democratic districts.",
    "In the House, 12 of the 42 Democratic districts have a Democratic voter index of less than 51%.",
    "Of those Democratic-leaning districts, three have a Democratic advantage between 50% to 52%.",
    "Of those Democratic-leaning districts, eight have a Democratic advantage between 50% to 52%.",
    "Mike DeWine (R-Ohio) had voted for the previous maps but expressed disappointment with them.",
    "But there was no other map that was presented — certainly the Democrat map did not do that.",
    "“Meaning they’re toss ups,” says Catherine Turcer, Common Cause Ohio executive director.",
    "That means the new House and Senate maps can go into effect for only four years.",
    "All the GOP-leaning districts have an index of Republican voters above 52%.",
    "All the GOP-leaning districts have an index of Republican voters above 53%.",
    "Republicans would likely have won 23 seats in the Senate and Democrats 10.",
    "The previous maps gave 67 House seats to Republicans and 32 to Democrats.",
    "“And so when you look at the partisan breakout, it’s not exactly right.",
    "Gov.",
    "."
  ]
}