{
  "id": 4128,
  "mediaId": 2586,
  "date": "2022-01-20",
  "headline": "When Will Online Sports Betting Be Legal in Ohio?",
  "image": "https://heavy.com/wp-content/uploads/2022/01/GettyImages-1365246135-e1642720350862.jpg?quality=65&strip=all&w=780",
  "link": "https://heavy.com/sports/betting/when-will-online-sports-betting-be-legal-in-ohio/",
  "mediaOutlet": "Heavy",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Craig Bennett",
  "authorUrl": "https://heavy.com/author/craigmbennett/",
  "termIds": [
    0
  ],
  "sentences": [
    "According to an article on SI.com from December 22, 2021:\n“A 10 percent tax on net revenue will be implemented, with roughly 98 percent of that going toward funding public and private K-12 education and the remaining 2 percent will go toward problem gambling assistance.”\nAs for some geographical tax rate comparisons, Pennsylvania taxes 36 percent for online sports betting, West Virginia, like Ohio will be, is 10 percent, Michigan is 9.65 percent, and Indiana 9.5%.",
    "They’re currently taking bets on the following sports:\nBaseball (MLB futures, international leagues)\nBasketball (NBA, NCAA, WNBA, international leagues)\nBoxing\nFootball (NFL, NCAA, CFL)\nGolf (PGA Tour, LPGA Tour)\nIce Hockey (NHL, international leagues)\nMMA\nMotorsports (NASCAR, Formula One, IndyCar)\nRugby Union\nSoccer (MLS, international leagues, World Cup)\nTennis (ATP, WTA, ITF Challenger)\nAnd these are just the sports that are in season.",
    "Bet $5, Win $150 on Any NFL Playoff Game This Weekend\nIf you are a resident of Ohio and happen to be in Pennsylvania, Michigan, Indiana, or West Virginia and want to place a bet on an NFL Playoff game, FanDuel Sportsbook has a new user promotion for first-time bettors on the app.",
    "Other States With Legalized Online Sports Betting\nIn addition to Ohio’s neighbors mentioned earlier — Pennsylvania, Michigan, Indiana, and West Virginia — there are nine other states who have legalized online sports betting and feature FanDuel as an operator.",
    "The state also has professional sports teams in the NFL (Cincinnati Bengals, Cleveland Browns), NBA (Cleveland Cavaliers), MLB (Cincinnati Reds, Cleveland Guardians), NHL (Columbus Blue Jackets), and MLS (Columbus Crew, FC Cincinnati).",
    "The Ohio Senate passed HB 29 in June 2021, but like most of the sportsbooks that have been legalized in various states around the country, Ohio’s delay in passing of the bill centered around issues with the online betting aspect.",
    "And in one particular state, many have been wondering:\n“When will online sports betting be legal in Ohio?”\nPer the Ohio Casino Control Commission, sports betting in Ohio has a launch date set for January, 1, 2023, after Gov.",
    "Legal Sports Betting Options in Pennsylvania, Michigan, Indiana & West Virginia\nWhile it isn’t yet legal to bet sports online in Ohio, the FanDuel Sportsbook is live and legal four of the five states that border it.",
    "It is unknown at this time what sportsbooks will be coming to Ohio, although the FanDuel Sportsbook, an affiliate partner of Heavy, has been operating Daily Fantasy Sports (DFS) in the state for sometime.",
    "“We want to get this up and running as soon as possible, but we’re building a whole new industry,” Sen. Kirk Schuring said at the time of the HB 29 signing to The Cincinnati Enquirer.",
    "Casinos and sports teams that have initial licenses can apply for a second if they can prove to the Ohio Casino Control Commission (OCCC) that it will benefit the state economically.",
    "According to Legal Sports Report, Pennsylvania posted a record $84.9 million in revenue in November 2021, while Illinois set a revenue record of $78.2 million over the same month.",
    "Sports Betting in Ohio Expected to be a Major Success\nOhio is one of the most populated states at roughly 11.7 million, 7th-most in the U.S., according to 2021 numbers.",
    "More and more states have legalized online sports betting, with the most recent being New York, which launched FanDuel Sportsbook, among mobile apps for wagering.",
    "Next Steps for Online & Mobile Sports Betting in Ohio\nWhile January 1, 2023, is the target date, some Ohio lawmakers are hoping to launch sports betting earlier.",
    "If you’re in one of the those states, you can create a FanDuel Sportsbook account and begin placing online bets, just as long as you’re 21 years of age or older.",
    "For comparison sake, two bordering states with similar populations — Pennsylvania (12.8 million) and Illinois (12.6 million) — are seeing record-setting numbers.",
    "Just as the other states who have legalized online sports betting, in order to do so, you must be physically present in the state and be at least 21 years old.",
    "All you have to do is get a FanDuel Sportsbook account, which takes just a few minutes with a couple of quick steps:\n1) Download the app for iOS or Android.",
    "It is assumed FanDuel, among other online apps, will make a strong push for an online sports betting license in Ohio as soon as they possibly can.",
    "So if you’re in the Hoosier State and want to place some online sports bets, as long as you’re at least 21 years of age, you can legally wager.",
    "Mike DeWine signed House Bill 29, which legalized sports betting throughout the state whether it be online or at a “brick and mortar” casino.",
    "The Ohio Legislative Service Commission estimates sports betting can eventually produce upwards of $3.35 billion in revenue in the state.",
    "FanDuel Sportsbook went live in Michigan on January 22, 2021, so if you’re present in the state, you can place sports bets online.",
    "This weekend’s games are (Point Spreads provided by FanDuel):\nCincinnati Bengals at Tennessee Titans (-3.5) — Saturday, 4:30 p.m.",
    "FanDuel, which has a sportsbook at Valley Forge Casino in King of Prussia, entered the PA online betting scene in July of 2019.",
    "West Virginia sportsbooks have been accepting in-person wagers since August 2018, with online apps going live a year later.",
    "Pennsylvania, Michigan, Indiana, and West Virginia all border Ohio and each have already launched the FanDuel Sportsbook.",
    "Michigan launched in-person betting on March 11, 2020, just days before the casinos were shut down due to the pandemic.",
    "Those states include Arizona, Colorado, Connecticut, Illinois, Iowa, New Jersey, New York, Tennessee, and Virginia.",
    "Simply take a trip over the border to be physically present in one of these four states and you’re ready to go.",
    "Indiana legalized sports betting in September 2019, with online apps coming into the fray about a month later.",
    "That is likely to change, however, as it’s expected most of these casinos will apply for sportsbook licenses.",
    "Joe Burrow and the Cincinnati Bengals face the Tennessee Titans in the NFL Playoffs on Saturday, January 22.",
    "You just need to travel to a state that has legalized online sports betting and most of your neighbors have.",
    "They were quick to roll out online sports betting in January 2021, just in time to take Super Bowl wagers.",
    "Paperwork, choosing which operators will get sportsbooks, and server testing, to name just a few.",
    "Other states have set the wheels in motion to legalize online sports betting in the near future.",
    "With the signing of the House Bill 29, sports betting is technically legal in the state of Ohio.",
    "Once you’re physically in the state, you can place online sports bets with FanDuel Sportsbook.",
    "4) Choose the sporting events of your choice and place your bets (there is a $5 minimum bet).",
    "The FanDuel Sportsbook online app was one of the first to launch, going live in August 2019.",
    "There are also over a dozen major colleges and universities with Division I athletics.",
    "However, online sports betting is not as no app operators have been approved just yet.",
    "Then there are the parlays, teasers, team and player props, in-game bets, and more.",
    "Casinos, sports teams, stadiums, bars, and restaurants can all apply for licenses.",
    "Also, while there are 11 operating casinos in Ohio, none of them have sportsbooks.",
    "There are the “basic” bets, like point spread, moneyline, and total (over/under).",
    "You can find those in the App Store (iPhones) or Google Play Store (Androids).",
    "The state will be allowed to start issuing sports betting licenses on April 1.",
    "So what are the next steps to getting a live launch for Ohio sports betting?",
    "You can bet $5 to win $150 on any of the four divisional games this weekend.",
    "And, of course, online apps can apply to be online betting operators, too.",
    "ET\nSan Francisco 49ers at Green Bay Packers (-5.5) — Saturday, 8:15 p.m.",
    "If you’re an Ohio resident and want to place online wagers, you can.",
    "ET\nLos Angeles Rams at Tampa Bay Buccaneers (-3) — Sunday, 3 p.m.",
    "ET\nBuffalo Bills at Kansas City Chiefs (-1.5) — Sunday, 6:30 p.m.",
    "The HB 29 calls for as many as 25 online sportsbooks initially.",
    "The FanDuel Sportsbook has no shortage of sports to wager on.",
    "“We’re hoping it can be done sooner (than January 1, 2023).",
    "Pennsylvania legalized online sports betting in May 2019.",
    "You must be at least 21 years old to make online bets.",
    "If your team wins, you get $150 cash, not site credit.",
    "Newly legalized New York has a 51.5 percent tax rate.",
    "The FanDuel Sportsbook launched in October 26, 2019.",
    "ET\nIs Online Sports Betting Legal in Pennsylvania?",
    "As for the types of bets, again, too many to list.",
    "Is Online Sports Betting Legal in West Virginia?",
    "3) Make your initial deposit of at least $10.",
    "The wagers tend to vary from sport to sport.",
    "Is Online Sports Betting Legal in Michigan?",
    "Is Online Sports Betting Legal in Indiana?",
    "The bill was signed on December 22, 2021.",
    "That now, of course, has been resolved.",
    "Other sports are available in season.",
    "That’s 30/1 odds on any of the games.",
    "This is promo is for new users only.",
    "There is some work to be done first.",
    "What Will the Tax Rate Be for Ohio?",
    "Is Sports Betting Legal in Ohio?",
    "It sure is."
  ]
}