{
  "id": 415,
  "mediaId": 8498,
  "date": "2022-02-22",
  "headline": "Republicans on the Ohio Redistricting Commission revive talks on new state legislative maps",
  "image": "https://woub.org/wp-content/uploads/2021/09/img-2114-scaled-e1632497436427.jpg",
  "link": "https://woub.org/2022/02/22/republicans-on-the-ohio-redistricting-commission-revive-talks-on-new-state-legislative-maps/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/andy-chow-statehouse-news-bureau/",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/GHesLF5iD8\n— “The State Of Ohio” PBS News Program (@stateofohioshow) February 22, 2022\nAuditor Keith Faber (R-Ohio) expressed his sense of urgency on the topic by asking for the commission to meet again the next two days straight to continue getting updates on the work being done for new state legislative maps.",
    "< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — Just days after allowing a court-ordered deadline to expire and facing possible contempt of court, Republican members of the Ohio Redistricting Commission are expressing a change of heart on adopting new state House and Senate district maps.",
    "“Because ultimately, what matters more than anything else is that voters get the districts that they deserve that really serve them rather than political operatives interests.”\nOhio does not have finalized district lines for the Ohio House, Ohio Senate, and Congress.",
    "Secretary of State Frank LaRose (R-Ohio) has said it is crucial for the commission to adopt new maps as soon as possible to give election officials enough time to prepare for the May 3 primary and early voting.",
    "What followed DeWine’s comments was a shift in tone from other commissioners, such as Senate President Matt Huffman (R-Lima), who said staff is working on coming up with new House and Senate maps.",
    "House Speaker Bob Cupp (R-Lima) said the leaders will attempt to set a new meeting for Wednesday for the “dual purpose” of creating new state legislative and congressional maps.",
    "Mike DeWine (R-Ohio) reiterated his stance on creating new state legislative lines; that the commission had an obligation to adopt constitutional and court-compliant maps.",
    "“This is a question of following the law, the rule of law, respect for law and I again would want to state that that’s where we should head,” said DeWine.",
    "He had said last Thursday it was not possible to adopt new maps that followed the constitution and the order of the Ohio Supreme Court.",
    "The Ohio Supreme Court wants the panel to explain why they shouldn’t be held in contempt for not passing maps last week.",
    "So it is, I think, with some of the additional time we can get a product that the court will approve of,” says Huffman.",
    "On Friday, the court ordered the Commission to show why they shouldn’t be held in contempt for ignoring the deadline.",
    "They rejected maps drawn by Democrats and adjourned without any Republican-drawn maps being proposed or approved.",
    "“You know, starting from a whole new map, new constitutional concepts — with asymmetry and things like that.",
    "“I’m glad to see the change of heart,” says Jen Miller, League of Women Voters of Ohio executive director.",
    "Huffman says the additional time explains the difference between his comments on Thursday and Tuesday.",
    "The Ohio Redistricting Commission seems to be reviving talk of passing House/Senate maps.",
    "The commission met on Tuesday to begin work on drawing new congressional district lines.",
    "The commission had met on Thursday, just hours before the court’s deadline of midnight.",
    "Co-chairs @SpeakerCupp and @DrVernonSykes spoke after the meeting.",
    "But, when asked if there was other business to discuss, Gov."
  ]
}