{
  "id": 423,
  "mediaId": 2679,
  "date": "2022-02-24",
  "headline": "Ohio mapmakers scramble to avoid facing state’s high court",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/nation/ohio-political-mapmakers-ordered-to-face-states-high-court/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JULIE CARR SMYTH",
  "authorUrl": "https://www.seattletimes.com/author/julie-carr-smyth/",
  "termIds": [
    1710,
    4710,
    3469,
    5185,
    1267,
    392,
    973,
    1126,
    6474,
    6077
  ],
  "sentences": [
    "With pressure growing on multiple fronts, the Ohio Redistricting Commission’s GOP members released a new plan late Thursday that would create a 54-45 Republican majority in the Ohio House and an 18-15 Republican majority in Ohio Senate, by their calculations.",
    "COLUMBUS, Ohio (AP) — Republicans on Ohio’s political mapmaking panel voted Thursday to approve legislative maps they hope can pass constitutional muster, as they scramble to avoid a summons to appear before the Ohio Supreme Court under threat of contempt.",
    "The faceoff would be the most dramatic turn to date between the stalemated Ohio Redistricting Commission and the divided court, which has repeatedly invalidated by 4-3 votes gerrymandered maps being sent to it from up the block at the Ohio Statehouse.",
    "Both the secretary of state, who runs elections, and the state attorney general, who serves as the state’s lawyer, have urged a state Legislature controlled by fellow Republicans to move the primary date to avoid violations of state and federal law.",
    "Republican commission members used the promise that new maps could be approved this week in seeking a reprieve from threatened contempt of court charges tied to blowing past a Feb. 17 deadline for action imposed by the Supreme Court.",
    "Lawmakers punted their opportunity to redraw that map to the commission, citing the fact that any bill they passed without the support of Democrats would have lacked a crucial time-saving emergency clause.",
    "However, Democratic state Sen. Vernon Sykes, the panel’s co-chair, said his party was again not involved in those discussions, and he and House Democratic Leader Allison Russo both cast no votes.",
    "Already, the commission has sent two Republican-drawn, Republican-supported sets of legislative maps to the Ohio Supreme Court, only to have both invalidated as unconstitutionally gerrymandered.",
    "Advertising\n Skip Ad\nLitigation pending before a federal court from a group of Republican voters asks for the panel’s most recent map to be used this year, although it’s been invalidated.",
    "It’s not yet clear what the federal court’s role might be in the disagreement, as Ohio voters gave the Ohio Supreme Court original and exclusive jurisdiction in the redistricting process.",
    "Because those maps lacked any Democratic votes, each would have been good for only four years, rather than the 10 years envisioned to adjust for the once-per-decade U.S. Census.",
    "Secretary of State Frank LaRose was compelled to certify 2022 primary ballots earlier this week that omitted the names of candidates whose races are tied to the missing maps.",
    "The Redistricting Commission has until March to submit the updated congressional map, which must account for Ohio’s loss of one U.S. House seat due to lagging population.",
    "Democrats disagreed with those calculations, opposing a plan they contended contained many districts too closely divided to be considered in their column.",
    "House Democrats introduced legislation last month to shift the date a month, to June 7, anticipating potential delays associated with redistricting.",
    "The panel also includes Ohio’s secretary of state, auditor, House speaker and minority leader, Senate president and additional senator.",
    "It wasn’t immediately known if the court would still summon the commissioners to the in-person hearing, currently set for Tuesday.",
    "Justices invalidated two previous plans approved by the commission along party lines as gerrymandered to unduly favor one party.",
    "If GOP assessments were accurate, it was the closest plan yet to match Ohio’s political breakdown, as required by the court.",
    "The high court also has invalidated a map of U.S. House districts approved by the state Legislature and signed by DeWine.",
    "Advertising\n Skip AdSkip AdSkip Ad\nConflict unfolding over the maps could affect the fate of Ohio’s May 3 primary.",
    "Attorney General Dave Yost warns “a thousand” legal questions will arise if the primary is not moved soon.",
    "Commissioners called before the high court earlier in the day include Republican Gov.",
    "Mike DeWine, whose son, Justice Pat DeWine, recused himself from the proceeding.",
    "The adjustment takes the state to 15 representatives, down from the current 16.",
    "But it isn’t only Ohio House and Senate seats that are at issue.",
    "Republican state Auditor Keith Faber also voted no.",
    "So far, no GOP-backed effort to do so has emerged.",
    "JULIE CARR SMYTH"
  ]
}