{
  "id": 4280,
  "mediaId": 8397,
  "date": "2022-01-26",
  "headline": "USPS will deliver at-home test kits",
  "image": "https://s25456.pcdn.co/wp-content/uploads/2022/01/128125383_web1_Tests.jpg",
  "link": "https://www.peoplesdefender.com/2022/01/26/usps-will-deliver-at-home-test-kits/",
  "mediaOutlet": "peoplesdefender.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brett Milam",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“The number of COVID-19 positive patients in hospital and ICU beds continues to increase, and nearly every day brings the highest levels since the pandemic’s beginning,” the Health Collaborative, a nonprofit organization in Cincinnati, who has been compiling the data in conjunction with Cincinnati Children’s Hospital and other organizations, said.",
    "The region still remains stubbornly below 60 percent for those who have completed their two-dose vaccination regimen with the Moderna or Pfizer-BioNTech vaccines, or the one dose for the Johnson & Johnson vaccine, at 57 percent, with about 20 percent having received a booster shot.",
    "Clermont County Public Health also recently announced they are ready to roll with booster shots for 12-to-15 yearolds, which was approved by the Food and Drug Administration, the Centers for Disease Control and Prevention and the Ohio Department of Health earlier this month.",
    "“As cases increase across the state, the best thing Ohioans can do is to stay up to date on their COVID-19 vaccine.”\nThe three Cincinnati locations are Crossroads Church in Mason, Riverbend Music Center in Cincinnati, and at the University of Cincinnati.",
    "It’s also important to remember that if you’re experiencing the symptoms of COVID-19 and don’t yet have the at-home testing kit, to get tested at a local pharmacy, urgent care or locally hosted testing sites instead of at the emergency room.",
    "“We are grateful that National Guard members are continuing to fill critical roles in our state’s response to this pandemic, especially as the strain on our health care providers continues,” Governor Mike DeWine said in a press release.",
    "COVID-19 hospitalizations climb in the area; vaccination rates stubbornly unmoved\nThe most common age group for contracting COVID-19 in the region is among those 20- to 39-years of age, according to the most recent Jan. 14 data.",
    "Fortunately, the seven-day moving average of COVID-19 deaths has not similarly ticked upward in the region, but that’s with the caveat that reports of deaths tend to lag one to two months, the Health Collaborative noted.",
    "This includes 200 Guard members offering medical support, and 2,100 offering general support, including testing, food services, in-hospital patient transportation, administrative tasks, and more.",
    "Residents who don’t have access to a computer and/or don’t want to deal with a mobile app can call 513-735-8500 to schedule an appointment to receive their vaccine.",
    "To that point, the most important thing residents can do to avoid potential serious illness, landing in the hospital and even death is to get vaccinated.",
    "The Ohio National Guard has been deployed to support a number of testing locations throughout the state, including three testing locations in Cincinnati.",
    "And the incident rate for new cases climbed week-over-week, from 1,134 new cases per 100,000 people to 1,491 cases per 100,000 people.",
    "Clermont County trends slightly below the region on that front at 55 percent who have completed their vaccination regimen.",
    "In total National Guard members working with Ohio’s health care systems is now at 2,300 members, the press release said.",
    "For those who are vaccinated, they should also get their booster shot to ensure the most protection against COVID-19.",
    "The overwhelming majority of individuals who end up in the hospital with COVID-19 are those who are unvaccinated.",
    "Our neighbors to the east are faring far worse, with Brown and Adams at 39 percent and 34 percent, respectively.",
    "Clermont Sun\nThe United States Post Office will now deliver COVID-19 at-home test kits directly to your house.",
    "There are a number of either walk-in sites or places to schedule an appointment throughout the area.",
    "According to the United States Post Office:\n– Limit of one order per residential address.",
    "There are more than 1,000 confirmed COVID-19 positive patients in the region’s hospitals.",
    "Anyone five years of age and older are eligible to get the Pfizer-BioNTech vaccine.",
    "The booster shot applies to the Pfizer-BioNTech COVID-19 vaccine.",
    "Visit testandprotectcincy.com to find an applicable testing site.",
    "– One order includes 4 individual rapid antigen COVID-19 tests.",
    "In addition, 188 are in the ICU and 150 are on ventilators.",
    "To order your test kit, visit special.usps.com/testkits.",
    "– Orders will ship free starting in late January."
  ]
}