{
  "id": 4322,
  "mediaId": 8317,
  "date": "2022-01-22",
  "headline": "Judge Braig files for re-election",
  "image": "https://www.examiner.org/wp-content/uploads/2022/01/Judge-Braig.jpg",
  "link": "https://www.examiner.org/judge-braig-files-for-re-election/?utm_source=rss&utm_medium=rss&utm_campaign=judge-braig-files-for-re-election",
  "mediaOutlet": "examiner.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "BELLEFONTAINE EXAMINER STAFF",
  "authorUrl": "https://www.examiner.org/author/adminweb/",
  "termIds": [
    0
  ],
  "sentences": [
    "Judge Braig also obtained a $300,000 grant from the federal government to fund the court’s specialty docket, the Adult Recovery Court, that focuses on helping individuals in the criminal justice system confront substance abuse disorder issues and to develop habits that lead to replacing a life driven by substance abuse with a life driven by recovery.",
    "Unlike many other courts, Judge Braig did not suspend jury trials, except for a short period between Nov. 15, 2020, and March 1, 2021, when COVID-19 prevalence reached its highest levels in Logan County and a vaccine was not yet available.",
    "Judge Kevin P. Braig announced this week that he has filed a petition to seek re-election as the Republican candidate for the bench of the General Division of the Logan County Court of Common Pleas.",
    "In 2020, he obtained grant funds from the State of Ohio to install video conferencing technology in both courtrooms on the second floor of the Logan County Courthouse and the Logan County Jail.",
    "His practice focused on private interests, particularly private agricultural interests and emphasized the protection of the liberty and property rights of individuals and businesses.",
    "Because the judge kept the court operating at a near normal level, the court’s docket is not burdened with a large backlog of unresolved cases like so many other courts in Ohio.",
    "The improvements also enabled the court to cease its use of a courtroom in the jail and return that space to the Logan County Sheriff’s Office.",
    "Throughout the COVID-19 pandemic, Judge Braig kept the General Division of the Logan County Court operating as close to normal as possible.",
    "Since taking the bench, Judge Braig has focused on improving the court’s technology to improve the court’s service and to reduce costs.",
    "The improvements enabled the county to reduce expenses related to transporting persons between the courthouse and the jail.",
    "In 2020, he ran unopposed and won election in the March Republican primary and in the November special election.",
    "Governor Mike DeWine appointed Judge Braig to the bench in October of 2019 to replace Judge William Goslee.",
    "Prior to taking the bench, Judge Braig was in private practice for 26 years.",
    "He is seeking a new six-year term commencing Jan. 1, 2023.",
    "His current term expires on Dec. 31, 2022.",
    "Judge Braig began to serve Dec. 3, 2019."
  ]
}