{
  "id": 4340,
  "mediaId": 8379,
  "date": "2022-01-20",
  "headline": "‘Silicon Heartland’: Intel to build $20 billion computer chip facility in New Albany",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/01/INTEL-PLANT-2.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/new-albany/the-20-billion-chip-is-out-of-the-bag-intel-is-coming-according-to-time-com/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Orner",
  "authorUrl": "https://www.nbc4i.com/author/ben-orner/",
  "termIds": [
    0
  ],
  "sentences": [
    "“These factories will create a new epicenter for advanced chipmaking in the U.S. that will bolster Intel’s domestic lab-to-fab pipeline and strengthen Ohio’s leadership in research and high tech.”\nKeyvan Esfarjani, Intel’s senior vice president of manufacturing, supply chain and operations, said the New Albany decision came after more than nine months of careful consideration among dozens of sites nationwide.",
    "NEWARK, Ohio (WCMH) – On stage inside a historic theater, giving the appearance of a stylish Silicon Valley tech announcement, Intel CEO Pat Gelsinger pledged to turn Ohio into the “Silicon Heartland” with a $20 billion computer chip manufacturing campus planned for northwest Licking County.",
    "The semiconductor plant coming to New Albany will be the largest private investment in state history, and Intel says the two chip factories on 1,000 acres will create 3,000 high-paying jobs, 7,000 construction jobs and the potential of over 10,000 local long-term jobs.",
    "In interviews before Jersey Township was selected as the site, Gelsinger described the scope of the project as a “little city.”\nThe project is expected to add $2.8 billion to Ohio’s annual gross state product, according to DeWine’s office.",
    "The company released renderings on Friday of what it envisions for the campus:\nGelsinger spent Friday morning making appearances promoting the project and then went to the White House to announce it alongside President Joe Biden and Sens.",
    "Two fabrication factories will be built first, he said, but Intel “a clear intention to build more.”\n“If there’s a concrete truck in the state of Ohio that’s not working for me next year, I want to know about it,” Gelsinger joked.",
    "“We expect that Ohio will become one of the largest semiconductor manufacturing sites in the world over the next decade,” Gelsinger said Friday at an announcement event inside Newark’s Midland Theater.",
    "Intel will also invest an additional $100 million over next 10 years in partnership with Ohio universities, community colleges and the U.S. National Science Foundation to build a talent pipeline.",
    "The governor’s office expects the average salary for workers at the two fabrication plants to be $135,000, approximately 2.5 times the median income of an Ohio family of four.",
    "The news of Intel’s arrival came to light last week when Ben Pieper, a Jersey Township trustee, told NBC4 about a 10-year development coming to that part of the township.",
    "Mike DeWine joined the computing company CEO, touting Intel’s investment as a rebirth of U.S. manufacturing in a state with a proud history of building and innovating.",
    "“Intel is bringing leading capability and capacity back to the United States to strengthen the global semiconductor industry,” Gelsinger said in a Friday news release.",
    "Construction will begin later this year, Esfarjani said, and the campus will be able to produce millions of chips every day at full buildout.",
    "The township sits on the edge of Licking County, which has Newark as its seat, even though most of New Albany is in Franklin County.",
    "Over next decade, Gelsinger said, Intel’s investment in the state could grow to $100 billion — five times the initial amount.",
    "“This is a major win for Ohio and is really a game changer – a game changer – for our economic future,” the governor said.",
    "“Ohio has a culture deep in its roots to do what it takes to win,” Esfarjani said during Friday’s event.",
    "Intel’s plan will reshape a large section of Jersey Township on 3,190 acres annexed into New Albany.",
    "Attracting Intel was central Ohio’s strong infrastructure, favorable regulations and talent pool.",
    "On Tuesday, New Albany city council agreed to millions of dollars of improvements on the land.",
    "The senators also joined Intel and state leaders at the Newark event.",
    "The factories are expected to be finished by 2025.",
    "Sherrod Brown and Rob Portman of Ohio.",
    "Gov."
  ]
}