{
  "id": 4401,
  "mediaId": 8494,
  "date": "2022-01-21",
  "headline": "Morning Headlines: Stark County COVID testing site to close; Intel confirms $20 billion central Ohio chip factory",
  "image": "https://npr.brightspotcdn.com/dims4/default/d6a7156/2147483647/strip/true/crop/5048x2650+0+357/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc5%2Fa5%2Fe2d31c3f475fac84ff059d5423eb%2Fpexels-martin-lopez-954583.jpg",
  "link": "https://www.wksu.org/2022-01-21/morning-headlines-stark-county-covid-testing-site-to-close-intel-confirms-20-billion-central-ohio-chip-factory",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Friday, January 21:\nStark County COVID testing site to close\nIntel confirms $20 billion central Ohio chip factory\nCOVID cases, hospitalizations rise in southern, western Ohio\nGovernor: Put brakes on a proposal to halt added Ohio gas tax\nOSU sees the highest COVID positivity rate of the pandemic\nStark e-commerce business to move, expand in Green\nStark County COVID testing site to close\n(WKSU) -- Stark County’s COVID testing site will close Friday at noon.",
    "Republican State Sen. Steve Huffman has proposed legislation to reduce both gas and diesel taxes to 28 cents for gas or diesel for the next five years to give Ohioans a break since Ohio is getting millions in federal infrastructure improvement dollars.",
    "COVID cases, hospitalizations rise in southern, western Ohio\n(WKSU) -- Ohio health officials say that while COVID-19 case and hospitalizations are dropping in Cuyahoga County, the state continues to see high numbers of the omicron variant.",
    "State Health Director Dr. Bruce Vanderhoff said hospitalizations have fallen as much as 24% in Cleveland and Akron this week, but that southwest Ohio reported a 14% increase and the western Ohio region a 13% increase in ICU admissions.",
    "The state says it’s the largest single private sector company investment in Ohio’s history and will generate more than 20,000 jobs in the state, including 3,000 direct Intel jobs earning an average of $135,000 per year.",
    "OSU sees the highest COVID positivity rate of the pandemic\n(Columbus Dispatch) -- Ohio State University officials say the COVID-19 positivity rate is the highest it’s been on campus since the pandemic began.",
    "Intel confirms $20 billion central Ohio chip factory\n(WKSU) -- State officials have confirmed plans for a multi-billion-dollar computer chip manufacturing facility to be built in central Ohio.",
    "The Columbus Dispatch reports that about 10% of the roughly 18,000 PCR tests administered to students, faculty, and staff last week came back positive.",
    "In a statement, the governor’s office says Intel Corporation plans to invest more than $20 billion to build two factories in Licking County by 2025.",
    "Mike DeWine wants lawmakers to put the brakes on a proposal to halt the collection of the state's newly increased taxes on gas and diesel fuel.",
    "Stark e-commerce business to move, expand in Green\n(WKSU) -- A Stark county e-commerce business is relocating and expanding in Summit County.",
    "DeWine and GOP lawmakers reached a deal in 2019 to raise the gas tax to about 38 cents a gallon to maintain deteriorating roads and bridges.",
    "Tradefull Inc. will move to a vacant, 275,000-square-foot vacant building in Green and plans to add 200 jobs by the end of 2023.",
    "Green City Council is expected to approve a five-year Municipal Economic Development Grant that will provide tax incentives.",
    "OSU says about 93% of students, faculty, and staff members reported they were partially or fully vaccinated as of this week.",
    "The site that’s been operating at the Stark County Fairgrounds for the last 10 days is seeing a drop in demand.",
    "All students living in university housing are required to get tested weekly, regardless of vaccination status.",
    "National Guard staff that’s been helping to run the site will be redeployed to other locations in the state.",
    "The Canton Repository reports it’s seen about 1,300 visitors with a 35% positivity case rate.",
    "He points out Ohio continues to record an average of more than 20,000 positive cases daily.",
    "Before students left for winter break last month, the positivity rate was about 2.5%.",
    "Governor: Put brakes on a proposal to halt added Ohio gas tax\n(AP) — Gov.",
    "DeWine says the money is needed to protect Ohio's infrastructure.",
    "Cleveland’s mass testing site will close on Sunday.",
    "Akron’s closed last week."
  ]
}