{
  "id": 4423,
  "mediaId": 8323,
  "date": "2022-01-21",
  "headline": "‘Silicon heartland:’ Intel invests $20 billion to build chip production facilities in Ohio",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/01/GettyImages-1310805405.jpg?w=1280",
  "link": "https://fox8.com/news/monumental-news-intel-plants-will-bring-20000-jobs-to-ohio/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cris Belle",
  "authorUrl": "https://fox8.com/author/cris-belle/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Intel’s new facilities will be transformative for our state, creating thousands of good-paying jobs in Ohio manufacturing strategically vital semiconductors, often called ‘chips.’ Advanced manufacturing, research and development, and talent are part of Ohio’s DNA, and we are proud that chips — which power the future — will be made in Ohio, by Ohioans.”\nDeWine held a press conference Friday afternoon saying that after 40 states competed, “Intel chose Ohio.”\nIntel already has 100 suppliers in Ohio and, now, around 30 more are expected, he explained.",
    "Intel CEO Pat Gelsinger said Ohio will now be a “tech hub” where jobs will continue to grow in years to come starting at the two future manufacturing plants, “Silicon Heartland” to go with Silicon Valley.",
    "Mike DeWine’s team confirmed the news that Intel Corporation would be investing $20 billion to build two factories in the state that would ultimately lead to 20,000 jobs.",
    "He said the company’s goal is to bring semiconductor manufacturing back to the U.S. and make it a more geographically-balanced industry by bringing it to Ohio.",
    "The jobs break down as 3,000 direct Intel jobs earning 6 figures, thousands of construction jobs and thousands of other jobs generated by the new facilities.",
    "Jon Husted said that this announcement comes as failures in the supply chain demonstrate the need for these sites to be on U.S. soil.",
    "According to a press release, the project will be the largest single private sector company investment in Ohio’s history.",
    "The site is one of the only sites that produces the chips all “in house” – from design to production to distribution.",
    "“We are excited to call Ohio home to Intel’s first new manufacturing site in 40 years,” said Gelsinger.",
    "A site in Licking County will be home to the semiconductor or chip manufacturing facilities.",
    "“Today’s announcement is monumental news for the state of Ohio,” said Governor Mike DeWine.",
    "“When (supply) companies consider expanding, they have to think of Ohio,” he said.",
    "The company hopes to break ground at the site by the end of 2022.",
    "“All we want people to do, is give us a look.”\nLieutenant Gov.",
    "COLUMBUS, Ohio (WJW) – Early Friday morning, Ohio Gov.",
    "They plan to build both facilities by 2025."
  ]
}