{
  "id": 4485,
  "mediaId": 8413,
  "date": "2022-01-14",
  "headline": "Intel picks Greater Columbus for $20 billion semiconductor factory to employ 3,000 workers",
  "image": "https://www.gannett-cdn.com/presto/2022/01/13/NCOD/6f17c5c7-6215-498c-a665-bc20f0f4dda6-CEB_Chips_Project_02.jpg?crop=3983,2241,x8,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/business/2022/01/14/factory-built-land-annexed-into-new-albany/6524507001/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Williams",
  "authorUrl": "https://www.dispatch.com/staff/5748338002/mark-williams/",
  "termIds": [
    0
  ],
  "sentences": [
    "“In addition to its potential for creating good-paying tech jobs, this investment takes a major step toward addressing the national chip shortage and would mark a significant milestone in our efforts to lessen dependence on overseas manufacturers.”\nNew Albany's council on Jan. 4 voted 6-0 to enter into an annexation agreement with Jersey Township for the property, which is bounded by the Franklin-Licking County line, Green Chapel Road, Mink Street and Jug Street.",
    "State and local officials, along with those from the state's economic development agency JobsOhio, have officially declined to comment, but rumors have been rampant for months of a massive economic development project that could include a computer-chip factory coming to 3,190 acres the city of New Albany is annexing from Jersey Township in western Licking County.",
    "Intel has previously announced plans to invest $20 billion to expand its operations in Arizona, and CEO Pat Gelsinger said last summer that the company wants to create what would in essence be a mini-city that could see a total investment approaching $100 billion with multiple chip fabrication factories, called \"fabs.\"",
    "Latest updates on Intel project in Ohio:What we know about Intel factory coming to Columbus area\nManufacturers and policy makers have been eager to bring back production of semiconductor chips to the U.S. as a result of a global supply chain crunch during the pandemic.",
    "\"Restoring American leadership as a producer of advanced computer chip technology is critically important in strengthening U.S. supply chain resiliency and addressing our over-reliance on foreign suppliers for components vital to our national defense,” Rep.",
    "“I can’t confirm or announce economic development projects until they are finalized and I won’t address details in press reports speculating about the possibility of a major semiconductor manufacturing facility being built and operated in Ohio,\" Gov.",
    "Four of them – including the Chandler plant – are in the U.S.\nHow quickly such a development could occur depends in part on Congress, which is debating legislation that would provide incentives to bring chip-making back to the U.S.",
    "“Any potential announcement here could be terrific news, both for the country, as we become more competitive, and obviously especially terrific news for the state of Ohio,” Sen. Sherrod Brown said Friday.",
    "The Silicon Valley semiconductor maker plans to invest $20 billion in a Licking County site that will employ 3,000 workers, a source close to the project told The Dispatch.",
    "The site also will employ thousands of construction workers along with workers from Intel suppliers that will locate at the site as well, the source said.",
    "The land would be for an expansion of the New Albany International Business Park where tech giants Google, Amazon and Facebook have data centers.",
    "While Ohio has been a manufacturing powerhouse, it doesn't have any factories that make chips that are crucial to the U.S. economy.",
    "Innovation and Competition Act in June that provides $52 billion in federal investments for research, design and manufacturing.",
    "\"This would be a very large site, so six to eight fab modules, and at each of those fab modules, between $10 and $15 billion.",
    "As a result of the shortage, semiconductor companies have started the long process of developing new U.S. sources of chips.",
    "They are the brains in thousands of products such as cars, cell phones, appliances, gaming consoles and medical devices.",
    "Currently, 12% of the world's chips are made in the U.S., down from 37% in the 1990s, according to industry officials.",
    "“Jersey Township will never be the same after this, that’s for sure,” said Jersey Township Trustee Dan Wetzel.",
    "Chips are an integrated circuit or small wafer of semiconductor material embedded with integrated circuitry.",
    "Beyond the annexation agreement, \"Anything else is speculation,\" New Albany spokesman Scott McAfee said.",
    "Intel has picked Greater Columbus for a new factory that could spark a new industry for the state.",
    "Intel operates 15 chip manufacturing \"fabs\" in 10 worldwide locations, according to the company.",
    "It's a project over the next decade on the order of $100 billion of capital, 10,000 direct jobs.",
    "Troy Balderson, R-Zanesville, whose district includes the site, said in a statement Friday.",
    "Dispatch Reporter Titus Wu and This Week Reporter Gary Seaman contributed to this report.",
    "So, essentially, we want to build a little city,\" he told The Washington Post in August.",
    "The factory would dramatically escalate development for the already fast-growing area.",
    "Brown, a Democrat, said he's been working with the governor and fellow Ohio Sen.",
    "Officials have stated publicly that no use for the property has been identified.",
    "The process could take several years before the plants would be up and running.",
    "Rob Portman, a Republican, on a number of issues surrounding the project.",
    "100,000 jobs are created as a result of those 10,000, by our experience.",
    "Intel's investment would be the biggest in state history.",
    "Intel did not respond to a request for comment.",
    "Mike DeWine said in a statement Tuesday.",
    "The legislation is pending in the House.",
    "mawilliams@dispatch.com\n@BizMarkWilliams",
    "About 80% are made in Asia.",
    "The Senate passed the U.S."
  ]
}