{
  "id": 4716,
  "mediaId": 6676,
  "date": "2022-04-23",
  "headline": "State National Guards to send armored vehicles to Ukraine",
  "image": "https://www.wkrg.com/wp-content/uploads/sites/49/2022/04/BombDisposalUkraineGettyImages-1239984383.jpg?w=1280",
  "link": "https://www.wkrg.com/international/state-national-guards-to-send-armored-vehicles-to-ukraine/",
  "mediaOutlet": "wkrg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Hill via Nexstar Media Wire",
  "authorUrl": "https://www.nxsttv.com/nmw/?post_type=profile&p=173669",
  "termIds": [
    4195,
    3305,
    2143,
    861,
    6672,
    6474
  ],
  "sentences": [
    "“Ohio has a strong Ukrainian community, and we stand behind them and their families overseas.”\n“By joining with other states in sending numerous of these armored vehicles to Ukraine, we hope and pray that this will give Ukrainian forces a major leg up in their defense of their home country,” Justice said in his own statement on Friday.",
    "Jim Justice (R) announced this week that their state National Guards would be providing an unspecified number of M-113 armored personnel carriers (APC), which help move equipment and soldiers “while providing protection from small arms fire and the effects of artillery,” according to press releases from both governors’ offices.",
    "The development comes just days after President Biden announced that the U.S. will send Ukraine another $800 million in military support, which includes 72 155mm howitzers and more than 121 “Ghost” drones, according to a fact sheet from the Pentagon.",
    "Meanwhile, Ukrainian President Volodymyr Zelenskyy announced on Saturday that Secretary of State Antony Blinken and Secretary of Defense Lloyd Austin will be traveling to Ukraine on Sunday.",
    "“As we continue to learn about Russian war crimes in Ukraine, those of us in Ohio stand ready to help the Ukrainian people in any way possible,” DeWine said in a statement on Wednesday.",
    "(The Hill) – Multiple governors announced this week that their state National Guards would be sending armored vehicles to Ukraine in response to a request from the Pentagon.",
    "A separate round of $800 million in aid to Ukraine that was authorized by Biden earlier this month included 200 M113 APCs, 300 Switchblade drones and other equipment.",
    "The M-113 APCs are a part of a Pentagon inventory drawdown for Ukraine support.",
    "Mike DeWine (R) and West Virginia Gov.",
    "Ohio Gov."
  ]
}