{
  "id": 4743,
  "mediaId": 8494,
  "date": "2022-04-22",
  "headline": "Morning Headlines: Cuyahoga County jail committee slows review of proposed site...and more stories",
  "image": "https://npr.brightspotcdn.com/dims4/default/ad318e8/2147483647/strip/true/crop/1374x721+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbe%2F4f%2F5c4ff47d4106acb551955ed668ee%2Fjailsite-web.png",
  "link": "https://www.wksu.org/2022-04-22/morning-headlines-cuyahoga-county-jail-committee-slows-review-of-proposed-site-and-more-stories",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amy Eddings",
  "authorUrl": "",
  "termIds": [
    2548,
    2713,
    693,
    181,
    281,
    269,
    6067,
    6096,
    6474
  ],
  "sentences": [
    "Here are your headlines for Friday, April 22nd:\nCuyahoga County committee vows environmental review for proposed jail site\nColumbus City Attorney sues Ohio over medical “conscience clause”\nKent State program for Black pregnant moms gets grant\nGuardians beat White Sox, sweep series\nWeather: Mostly sunny, with summery weekend ahead\nCuyahoga County committee vows environmental review for proposed jail site\n(WEWS-TV) -- A committee charged with finding a site for a new Cuyahoga County jail is slowing down its assessment of a tract of land in Cleveland's industrial valley.",
    "Guardians beat White Sox, sweep series\n(AP) – Josh Naylor had two hits and two RBIs, Franmil Reyes had his first home run of the season, and the Cleveland Guardians completed a series sweep of the Chicago White Sox with a 6-3 victory at Progressive Field.",
    "Columbus City Attorney sues Ohio over medical “conscience clause”\n(Statehouse News Bureau) -- The Columbus City Attorney is suing the state over a law that allows medical providers to deny care that goes against their conscience or religious beliefs.",
    "Kent State program for Black pregnant moms gets grant\n(Ideastream Public Media) – A Kent State University program aimed at combatting high infant mortality rates for Black babies is expanding its services through a $100,000 grant.",
    "After a five-hour long session, the Cuyahoga County Justice Center Steering Committee voted to move forward with the proposed site on Transport Road only after an environmental review.",
    "Klein filed the lawsuit Wednesday on behalf of the city's public health department, which provides vaccines and runs a women's health clinic offering contraceptives.",
    "Mike DeWine has said the law will not change much, because most health care workers do not work in settings that go against their beliefs.",
    "Weather: Mostly sunny, with summery weekend ahead\n(National Weather Service) – Mostly sunny, a slight chance of afternoon showers today.",
    "Naylor who had surgery and a lengthy rehab after multiple fractures in his right leg said it was \"awesome, but it's about more than me.\"",
    "The committee also agreed to an independent review of its previous determination on renovating the existing jail.",
    "Zach Klein said the so-called medical conscience clause violates home rule and the federal Affordable Care Act.",
    "The Sox have lost four straight games while the Guardians took both games of a doubleheader on Wednesday.",
    "The Guardians are in the Bronx tonight to start a weekend series against the New York Yankees.",
    "Many who spoke during the public comment period questioned the need for a new jail.",
    "The program, Spirit of Motherhood, treats Black pregnant women for chronic stress.",
    "It will go toward hiring more staff and adding up to 20 additional participants.",
    "Mostly sunny, highs in the upper 70s for Cleveland and the low 80s for Akron.",
    "Saturday and Sunday’s forecast calls for a foretaste of summer.",
    "The grant is from the Anthem Blue Cross Blue Shield Foundation.",
    "Reyes was happy to see his \"best friend\" back on the field.",
    "The property is a former oil refinery.",
    "He also said it's unconstitutional.",
    "Its expected to cost $550 million.",
    "High 66 in Akron, 58 in Cleveland.",
    "Tonight, showers.",
    "Low 51.",
    "Gov."
  ]
}