{
  "id": 4764,
  "mediaId": 8494,
  "date": "2022-04-21",
  "headline": "Columbus city attorney files suit over Ohio's 'medical conscience' clause",
  "image": "https://npr.brightspotcdn.com/dims4/default/4513c87/2147483647/strip/true/crop/5288x2776+0+296/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Flegacy%2Fsites%2Fwcpn2%2Ffiles%2F201809%2Fstethoscope_nurses_medical_doctor_generic_-_lenetstan_shutterstock.jpg",
  "link": "https://www.wksu.org/government-politics/2022-04-21/columbus-city-attorney-files-suit-over-ohios-medical-conscience-clause",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2548,
    2143,
    3235,
    1126,
    6474,
    6077
  ],
  "sentences": [
    "\"But more importantly, substantively, a law like this threatens Ohioans from receiving good quality health care from providers simply because a doctor, nurse or pharmacist has a personal or philosophical objection to the medicine or treatment,\" Klein said.",
    "“We don't want to wait for an example to present itself or someone's life is threatened, or someone receiving the appropriate care is not receiving that treatment because of a person's personal objection,\" Klein said.",
    "Columbus’ Democratic city attorney is suing the State of Ohio over a provision that Republican lawmakers put into the budget that passed last year – though so far the law created by that provision hasn’t been used.",
    "The medical conscience clause was put into the budget to provide legal protection to workers and health care and insurance providers who deny service, and to protect their First Amendment rights.",
    "Attorney General Dave Yost, a Republican, said in a statement that the lawsuit is meritless because the provision was thoroughly vetted, and he pledged to defend it vigorously in court.",
    "Zach Klein, Columbus city attorney, said the so-called medical conscience clause violates home rule, it’s unconstitutional, and it’s illegal under the federal Affordable Care Act.",
    "However, Klein said the lawsuit isn’t based on a particular instance of a refusal of treatment, but seeks to stop that before it happens.",
    "Several states have similar \"conscience\" laws, often to cover pharmacists who refuse to fill emergency contraception prescriptions.",
    "Critics have said the provision makes it legal to discriminate against patients based on skin color, gender, or sexual orientation.",
    "Mike DeWine, a Republican, said, \"People are not going to be discriminated against in regard to medical care.\"",
    "But in defending his decision not to veto that provision in July, Gov.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau."
  ]
}