{
  "id": 4771,
  "mediaId": 8288,
  "date": "2022-04-18",
  "headline": "Ohio's First Lady Fran DeWine Now Also Has COVID-19 Like Mike",
  "image": "",
  "link": "https://www.clevescene.com/news/ohios-first-lady-fran-dewine-now-also-has-covid-19-like-mike-38764192",
  "mediaOutlet": "clevescene.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allison Babka",
  "authorUrl": "https://www.clevescene.com/author/allison-babka",
  "termIds": [
    2143,
    253,
    503,
    678,
    1486,
    6474
  ],
  "sentences": [
    "The Centers for Disease Control and Prevention currently advises that those testing positive for COVID-19 or with COVID-19 symptoms should isolate themselves from others — especially from those who are immunocompromised — and avoid travel for at least five to 10 full days, depending on symptoms, severity or setting.",
    "Scientists have said that getting one of the three COVID-19 vaccination series available in the United States (Pfizer, Moderna or Johnson & Johnson) greatly protects people from severe illness and likely hospitalization should they be exposed to the coronavirus, including its variants like Omicron and Delta.",
    "The CDC and U.S. Food & Drug Administration have granted emergency use authorization for the COVID-19 treatment, but full approval for several cocktails is on hold because tests haven't held up against the highly transmissible Omicron variant and its even more infectious sub-variant, BA.2.",
    "There have been more than 987,000 COVID-19 deaths reported in the United States since the pandemic began in early 2020, according to data gathered by the New York Times.",
    "According to CDC data, sub-variant BA.2 is now responsible for nearly 90% of all COVID-19 cases in the United States, The Hill reported on April 12.",
    "The Omicron variant became the dominant form of the still-evolving coronavirus in early December as it began spreading faster than its predecessors.",
    "U.S. residents can order free at-home COVID-19 tests through a partnership from the federal government and the United States Postal Service.",
    "The current First Lady of Ohio announced April 18 that she has tested positive for the coronavirus, just days after her husband Ohio Gov.",
    "The variant caused a major surge in hospitalizations during the winter months after people gathered maskless indoors for the holidays.",
    "After COVID-19 cases swelled in January and February — including in the Cincinnati area — the nation saw somewhat of a decline.",
    "Ohio has seen more than 38,200 deaths, though experts largely agree that actual case numbers are larger than what is reported.",
    "She has received a monoclonal antibody treatment and will continue to quarantine at home with her husband, the release adds.",
    "She was diagnosed by her personal physician and has \"mild\" COVID-19 symptoms, according to an April 18 press release.",
    "Monoclonal antibody treatment could help a patient's immune system respond better to the coronavirus, the CDC says.",
    "And though even vaccinated people can still contract COVID-19, they are much less likely to need hospitalization.",
    "Neither of the DeWines have publicly indicated a start date for their quarantines or an anticipated end date.",
    "Both of the DeWines had been through a two-shot COVID vaccination series plus had received a booster shot.",
    "Adding a booster provides even more protection against serious health challenges or death, experts say.",
    "And we believe everyone deserves access to accurate independent coverage of their community and state.",
    "Ohio is one of the least-vaccinated states in the nation, the Ohio Capital Journal reported in March.",
    "Fran DeWine had initially tested negative when the governor made his own announcement on April 15.",
    "Help us keep this coverage going with a one-time donation or an ongoing membership pledge.",
    "People ending isolation should continue to wear a mask for five more days, the CDC says.",
    "But Omicron's BA.2 sub-variant has since pushed case numbers higher again.",
    "Most hospitalized COVID patients are unvaccinated, medical staff say.",
    "Join the Cleveland Scene Press Club\nLocal journalism is information.",
    "Fran DeWine couldn't escape COVID-19 and is now like Mike.",
    "Mike DeWine, shared his positive diagnosis.",
    "Information is power."
  ]
}