{
  "id": 4823,
  "mediaId": 8491,
  "date": "2022-04-18",
  "headline": "Lt. Gov. Husted visits the Valley, talks future of Ohio",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/04/jon-husted.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/lt-gov-husted-visits-the-valley-talks-future-of-ohio/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stan Boney",
  "authorUrl": "https://www.wkbn.com/author/stan-boney/",
  "termIds": [
    4736,
    5158,
    2143,
    646,
    1590,
    1625,
    6474,
    6077
  ],
  "sentences": [
    "He talked of how the administration of Ohio Governor Mike DeWine has protected the lives of the unborn and of the 2nd amendment, but Husted’s primary focus was on Ohio’s future jobs and how the states must be prepared.",
    "(WKBN) — Ohio Lieutenant Governor Jon Husted started his afternoon at Hynes Industries in Austintown, then went on to Youngstown State, before campaigning in Boardman.",
    "Husted continued his optimistic outlook on Ohio’s future economy during a speech before fellow Republicans in Boardman where again he mentioned the Intel project.",
    "He says right now the Ohio Means Jobs website has 150,000 jobs paying over $50,000 dollars a year while only 63,000 people are on unemployment.",
    "“I don’t think we’ll ever be able to meet the needs that all of this opportunity you’re bringing through the old-fashioned, traditional ways.",
    "Husted spent his time at Youngstown State meeting with high school and college students who had completed a 5G workforce broadband program.",
    "“If you have a skill in a tech area there are going to be more jobs out there and you’ll be able to pick your future,” said Husted.",
    "“And I’ll tell you this when Intel told us why they came to Ohio they said just because you’re so business-friendly,” said Husted.",
    "One floor below Husted was the showroom of YSU’s Excellence Training Center where one section is all 3D printers.",
    "“Ten years from now the world’s going to look at Ohio as the center of high-tech manufacturing,” said Husted.",
    "Husted reminded the students that Intel will someday soon be making semi-conductors near Columbus.",
    "The only thing that I have to ask you to do is to stay in Ohio and go to work here,” said Husted.",
    "YSU President Jim Tressel, who was part of Husted’s talk, pushed hard to get the center built.",
    "Husted called the current state of Ohio the best time ever to be looking for a job.",
    "Husted said Ohio is creating jobs faster than people can fill them.",
    "While at YSU there was one thing he asked of the students.",
    "“I’m glad that you’re engaged in preparing yourself.",
    "We’re going to have to flow together,” said Tressel.",
    "“Ohio has a very bright future,” said Husted."
  ]
}