{
  "id": 4855,
  "mediaId": 8480,
  "date": "2022-04-19",
  "headline": "‘Discriminatory:’ Major central Ohio employers condemn, ignore HB 616",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/04/lgbtq-flag-virginia.jpg?w=1280",
  "link": "https://www.wdtn.com/news/ohio/discriminatory-major-central-ohio-employers-condemn-ignore-hb-616/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Orner",
  "authorUrl": "https://www.nbc4i.com/?post_type=profile&p=455963",
  "termIds": [
    0
  ],
  "sentences": [
    "Abbruzzese, the Honda spokesperson, said the company came to Ohio in the 1970s “because it was a welcoming place,” and Honda employers “want that to continue to be true for all Honda associates and our families who call the Buckeye State home.”\nAEP’s Ridout echoed that thought: “Ohio should be inclusive to all so that our company can continue to recruit and retain talent from all backgrounds and the state can continue to attract economic development opportunities.”\nMost employers — plus Intel — don’t comment\nJPMorgan Chase, by far central Ohio’s largest employer with more than 20,000 full-time workers, declined to comment.",
    "Ohio should be inclusive to all so that our company can continue to recruit and retain talent from all backgrounds and the state can continue to attract economic development opportunities.” – spokesperson Tammy Ridout\nBREAD FINANCIAL (formerly Alliance Data): “Bread Financial supports public policy that protects and advances individual rights, fosters a business environment that creates jobs and economic prosperity, and aligns with our values, including fostering diversity, equity, and inclusion.",
    "Victoria’s Secret did not comment, but Bath & Body Works said in a statement that “the bill is counter to our commitment to diversity, equity and inclusion.” The company added its government affairs team is “actively engaged in making our views known to decision-makers.”\n“Legislation that seeks to limit understanding of race, class, gender, sexuality or any of the layers that define each of us and our shared history, is a step backward,” Cardinal Health said in a statement.",
    "“In line with this commitment, we’re proud to be among more than 230 other businesses who have signed HRC’s Business Statement in support of the LGBTQ community.” – A&F\nBATTELLE: “Battelle, along with many large employers in the Ohio business community, opposes any legislation that seeks to marginalize any person or groups of people and that is not aligned with our values related to diversity, equity and inclusion.” – Battelle",
    "“As such, it can be exceedingly difficult for us to recruit the most qualified candidates for jobs in states that pursue such laws, and these measures can place substantial burdens on the families of our employees who already reside in these states.”\nThe central Ohio employers NBC4 contacted that also signed that petition were Abercrombie & Fitch, Amazon, Honda, Cardinal Health, Gap, and Victoria’s Secret.",
    "We encourage state officials to assure that Ohio remains a welcoming place for all Ohioans and a great place to live, work and do business.” – spokesperson Chris Abbruzzese\nBATH & BODY WORKS: “We stand against legislation that does not align with our values … to be clear: we believe the bill is counter to our commitment to diversity, equity and inclusion.",
    "As a public company employing 6,000+ associates globally, we oppose legislation that is discriminatory or in any way conflicts with those or any other company values.” – Bread Financial\nABERCROMBIE & FITCH: “Now more than ever it’s important to reaffirm our unwavering support for our LGBTQ associates, customers and allies.",
    "Legislation that seeks to limit understanding of race, class, gender, sexuality or any of the layers that define each of us and our shared history, is a step backward.” – Cardinal Health\nAMERICAN ELECTRIC POWER: “AEP is committed to fostering an inclusive workplace where we welcome and celebrate diversity in all forms.",
    "“Any legislation that seeks to shame or penalize groups of Ohioans based on gender, sexual orientation, race or ethnicity is contrary to our company values of inclusion and diversity and undermines the positive business climate the state has sought to cultivate,” said Honda spokesperson Chris Abbruzzese in a statement.",
    "Abercrombie & Fitch did not specifically mention HB 616 in its statement, but the New Albany-headquartered retailer of about 2,600 local workers noted its “unwavering support for our LGBTQ associates, customers and allies.”\nOnly one employer outside the local top 10 responded to NBC4.",
    "And Columbus-headquartered Bread Financial, which employed 3,000 local full-time workers in 2019 when it was named Alliance Data, said in a statement, “(W)e oppose legislation that is discriminatory” or conflicts with its “diversity, equity and inclusion” values.",
    "Any legislation that seeks to shame or penalize groups of Ohioans based on gender, sexual orientation, race or ethnicity is contrary to our company values of inclusion and diversity and undermines the positive business climate the state has sought to cultivate.",
    "Gap\n1,508\nNO\nBelow are the full seven statements NBC4 received, ordered by local full-time employees:\nHONDA: “Honda came to Ohio more than four decades ago because it was a welcoming place to begin creating products close to our customers in America.",
    "“We hope Ohio lawmakers will join us in embracing diversity and inclusion and not diminish the rights of and respect for the LGBTQ+ community or suppress discussions exploring racial inequity and systemic racism,” AEP spokesperson Tammy Ridout wrote.",
    "“We are deeply concerned by the bills being introduced in statehouses across the country that single out LGBTQ individuals — many specifically targeting transgender youth — for exclusion or differential treatment,” the petition reads in part.",
    "We are proud that as a company we are taking action that aligns with our values.” – B&BW\nCARDINAL HEALTH: “At Cardinal Health, we believe deeply in diversity and inclusion, and champion policies that support the human dignity of all people.",
    "COLUMBUS, Ohio (WCMH) – House Bill 616, which would restrict certain teachings on race, gender and diversity in Ohio’s K-12 schools, has the attention of some of the Columbus area’s largest private employers — but most are staying silent.",
    "The bill also bans any student from learning things including critical race theory; The New York Times’ 1619 Project on slavery and Black Americans’ contributions to U.S. history; and diversity, equity and inclusion outcomes.",
    "Bill could be unattractive for businesses\nHB 616 would ban “divisive or inherently racist concepts” taught in Ohio schools, including sexual orientation and gender identity for students between kindergarten and third grade.",
    "22 with just over 1,600 full-timers, said it “opposes any legislation that seeks to marginalize any person or groups of people.”\nSee full statements and the entire list of 25 companies at the bottom of this story.",
    "“We hope Ohio lawmakers will join us in embracing diversity and inclusion and not diminish the rights of and respect for the LGBTQ+ community or suppress discussions exploring racial inequity and systemic racism.",
    "We stand by our long-term partners – including GLSEN, The Trevor Project, Human Rights Campaign (HRC) and Stonewall Columbus – as they seek inclusive representation and visibility of LGBTQ communities.",
    "California tech giant Intel will start construction later this year on a $20 billion computer chip factory in Licking County that its CEO said could become the planet’s largest semiconductor facility.",
    "Ohio Chamber of Commerce CEO Steve Stivers said in a statement last week that “some of the language in this bill may impede Ohio’s ability” to keep and attract workers who want to put down roots.",
    "With a major plant in Marysville being part of its North American headquarters, the Japanese automaker employs more than 11,000 full-time workers in the Columbus region, ranking third.",
    "“These bills would harm our team members and their families, stripping them of opportunities and making them feel unwelcome and at risk in their own communities,” the petition adds.",
    "We are actively working to foster a diverse and inclusive workforce that not only respects different identities but also removes any barriers to access and opportunity.",
    "Proponents say Ohio’s bill gives parents more say in the classroom, but critics deride it as bigoted legislation that will hurt LGBTQ+ students and students of color.",
    "Intel is also among nearly 250 companies that have signed a Human Rights Campaign petition opposing anti-LGBTQ+ legislation pushed by state lawmakers nationwide.",
    "“We encourage state officials to assure that Ohio remains a welcoming place for all Ohioans and a great place to live, work and do business,” Abbruzzese said.",
    "They liken it to Florida’s Parental Rights in Education law, which puts forth similar policies and has been labeled the ‘Don’t Say Gay’ bill by opponents.",
    "Other major companies headquartered locally that did not comment include Huntington Bancshares, Safelite, Abbott Nutrition, and Worthington Industries.",
    "NBC4 reached out to the 25 Columbus-area companies with the most full-time employees per a 2019 list by the region’s economic development arm.",
    "Full list and statements\nEach of these top employers has more than 1,500 full-time employees in central Ohio, according to the 2019 list.",
    "Once operational by 2025, Intel said the campus will employ 3,000 full-time workers, which would tie Bread Financial for ninth locally.",
    "We remain focused on supporting positive social change both within our workplace and in the dynamic and vibrant communities we serve.",
    "We know that each of our 16,700 employees brings experiences and perspectives that make our company and our communities stronger.",
    "The Dublin-headquartered health services company employs more than 5,000 full-time workers in central Ohio, ranking fifth.",
    "*\nVictoria’s Secret (HQ)\n7,662 (among two companies)\nNO\nBath & Body Works (HQ)\n7,662 (among two companies)\nYES\n5.",
    "“At Bath & Body Works, we believe everyone deserves a place where they feel valued for who they are, as they are.",
    "Open, honest conversations are a crucial part of building understanding and combating bigotry and intolerance.",
    "We want that to continue to be true for all Honda associates and our families who call the Buckeye State home.",
    "Everyone deserves to feel safe & accepted, regardless of sexual orientation, gender identity or expression.",
    "HB 616 also allows the Ohio Department of Education to take away funding depending on a school’s violation.",
    "Honda was one of three companies in the local top five, as well as six in the top 10, to condemn HB 616.",
    "4 on the 2019 list was L Brands, which split last year into Victoria’s Secret and Bath & Body Works.",
    "NBC4 asked Intel for comment, but a company spokesperson declined and did not give a reason why.",
    "Our government affairs team is actively engaged in making our views known to decision-makers.",
    "Seven companies condemned the bill, two declined to comment, and the rest didn’t respond.",
    "8 locally with about 3,600 full-time employees, challenged legislators directly.",
    "Amazon, Gap, and Victoria’s Secret did not respond to requests for comment.",
    "Bread Financial (HQ)\n3,000\nYES\nIntel (Upcoming)\n3,000 by 2025\nDECLINED\n10.",
    "DHL Supply Chain (U.S. HQ)\n2,192\nNO\n16\nAbbott Nutrition (HQ)\n2,055\nNO\n17.",
    "The top 25 companies represent more than 110,000 local workers.",
    "Columbus science and technology company Battelle, ranked No.",
    "Intel also expects another 7,000 jobs for construction.",
    "A spokesperson for American Electric Power, ranked No.",
    "“We take the introduction of this bill very seriously.",
    "2 with just under 13,000 employees, did not respond.",
    "Worthington Industries (HQ)\n1,625\nNO\n25.",
    "Abercrombie & Fitch (HQ)\n2,598\nYES\n11.",
    "“Our values are core to who we are.",
    "JPMorgan Chase\n20,316\nDECLINED\n2.",
    "Cardinal Health (HQ)\n5,075\nYES\n6.",
    "TS Tech (U.S. HQ)\n1,789\nNO\n20.",
    "Honda (U.S. HQ)\n11,077\nYES\n4.",
    "Teleperformance\n1,730\nNO\n21.",
    "Nationwide (HQ)\n12,862\nNO\n3.",
    "Huntington (HQ)\n4,921\nNO\n7.",
    "Battelle (HQ)\n1,636\nYES\n23.",
    "Ascena Retail\n1,635\nNO\n24.",
    "XPO Logistics\n2,246\nNO\n15.",
    "Safelite (HQ)\n2,551\nNO\n12.",
    "UnitedHealth\n1,900\nNO\n19.",
    "Nationwide Insurance, No.",
    "Whirlpool\n2,519\nNO\n13.",
    "Discover\n2.283\nNO\n14.",
    "AEP (HQ)\n3,627\nYES\n9.",
    "Spectrum\n2,000\nNO\n18.",
    "Behind Honda at No.",
    "Amazon\n4,828\nNO\n8.",
    "UPS\n1,669\nNO\n22.",
    "1."
  ]
}