{
  "id": 4887,
  "mediaId": 8278,
  "date": "2022-04-19",
  "headline": "Husted Tours Hynes Industries, Says ‘Everybody Wins’ with TechCred",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/04/husted-at-hynes.jpg",
  "link": "https://businessjournaldaily.com/husted-tours-hynes-industries-says-everybody-wins-with-techcred/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Lydic",
  "authorUrl": "https://businessjournaldaily.com/author/jlydic/",
  "termIds": [
    4736,
    2143,
    2707,
    4302,
    616,
    6678,
    6744,
    6474
  ],
  "sentences": [
    "“That happened in a lot of places in America.”\nWhile serving as speaker of the Ohio House of Representatives from 2005 to 2009, Husted said the legislature worked to reform the tax code, reformed workers’ compensation and did tort reform to improve the environment for manufacturing in the state.",
    "“So that’s been really something that they’ve taken advantage of in a number of our other local companies.”\nWhile course offerings were interrupted because of the pandemic, MVMC is seeing apprenticeship participation picking back up and classes are being filled, Borza said.",
    "“But more importantly as well, to enhance the skills of the people that we have.”\nIndeed, that is the goal of TechCred, which reimburses employers up to $2,000 in training costs for each credential successfully gained by an employee, said Lt. Gov.",
    "I love it, because it’s one of these things where everybody wins.”\nThrough TechCred and its sister program, Individual Microcredential Assistance Program, employees earn credentials, which increases their skills, earning power and job security.",
    "“We reformed all that.”\nToday, the country is benefitting from “deglobalization,” he said, as companies are able to compete because of innovation, productivity, a talented workforce “and the need for a dependable domestic supply,” he said.",
    "As the pandemic accelerated the realization that the U.S. can’t rely on products built in other countries as essential parts of its supply chain, “America has woken up and understands that we have to be self-reliant,” he said.",
    "We’re seeing that continued interest, and I think even more so as companies are realizing that they need to grow their employees into the most skilled positions that are experiencing retirements and so forth.",
    "YOUNGSTOWN, Ohio – More than 40% of workers at Hynes Industries have received additional training through the state’s TechCred program, up-skilling the company’s workforce and saving it money in the process.",
    "Educators are also adding capacity in needed areas, such as industrial maintenance, which is offered through the Trumbull Career and Technical Center, as well as Eastern Gateway Community College.",
    "Because of TechCred, Hynes was able to provide a class that gave Zerbs good pointers on setting up the mill equipment, “so I didn’t struggle as much learning the setup position,” Zerbs said.",
    "After the roundtable, Husted toured Hynes and says he’s impressed with how the nearly 100-year-old company has been able to serve modern industries to thrive, including solar and logistics.",
    "The Governor’s Office of Workforce Transformation initially set a goal of having 10,000 people take advantage of it in the first year, and another 20,000 in the second year, Husted said.",
    "When something’s popular with both business and employees, that means that the General Assembly is very likely to continue to support it now and even more so in the future,” he said.",
    "“You got taxed for it at the time when American manufacturing needed to compete on productivity, so you had to buy more modern equipment if you were going to compete,” he said.",
    "In early March, the state allocated more than $5 million in TechCred funding for the 12th round of funding – the most ever requested or awarded in a single application period.",
    "That was an “innovative, creative solution to help companies tap into that funding,” said Jessica Borza, executive director of the Mahoning Valley Manufacturers Coalition.",
    "He praised the efforts of the state and Husted, as well as the stakeholders for promoting and implementing programs like TechCred, as well as Ohio to Work and WorkAdvance.",
    "“As they progress with completing their classes and passing their classes, and get their on-job training, they move up on pay scale every year as they go,” Billock said.",
    "So it’s all coming together.”\nHynes has brought on five apprentices, two of which have completed their apprenticeships, said Greg Billock, maintenance supervisor.",
    "“Governor [Mike] DeWine and I are excited that in Ohio right now, we’re creating jobs faster than we could find people to fill them, in many ways,” he said.",
    "The MVMC works to line up the instructor and work with the school to ensure all the pieces are in place and that they have enough people to fill a class.",
    "Some 30 years ago, the U.S. was losing manufacturing jobs to globalizations, he said, so much so that the factory where his father worked had to close.",
    "Organ commented on the ease of the application process, as well as coordinating with training providers to get its workers the training they need.",
    "He recalled a time when the state’s tangible personal property tax, which taxed companies for buying a new piece of machinery or equipment.",
    "As of Monday, OhioMeansJobs.com has more than 250,000 job postings, more than 150,000 of which pay at least $50,000 annually, he reported.",
    "Employers win because having better trained employees improves productivity, allowing companies to better serve their customers, he said.",
    "Reda took the class as well and said it gave him the encouragement and drive to move more into a setup role when the opportunity arises.",
    "“The programs that you’ve worked so hard to advance within this community at the state level, and now at the local level, are working.",
    "“We kind of helped chunk it so that they can apply for different components of the apprenticeship as they go through,” Borza said.",
    "“Ohio wins because we have people who have more earning potential and businesses who have a more talented workforce,” he said.",
    "“When [there’s an] opportunity for me to get into setup, I’m definitely going to take it because of this training,” he said.",
    "In addition to up-skilling workers, TechCred has opened the door for more apprenticeship programs at local manufacturers.",
    "The funding will provide the opportunity for Ohioans to earn 4,434 tech-focused credentials, Husted’s office reported.",
    "“We know that there’s enough in the pipeline to do additional classes, and that’s what we’re working on right now.",
    "Husted joined Organ and a roundtable of stakeholders Monday to visit Hynes and see how it implemented the funding.",
    "“It has enabled us to bring on people in a challenging environment,” said Rick Organ, president and CEO of Hynes.",
    "To date, 76 new or existing workers at Hynes have gained credentials on the strength of the TechCred program.",
    "Workers who perform setup are skilled individuals, or “engineers without the engineering education,” he said.",
    "There are currently more companies interested in the apprenticeships than are currently applying, Borza said.",
    "“And I’ll put in a plug for our next TechCred grant, because we’ve got another one coming,” Organ quipped.",
    "Among the workers at Hynes to benefit from TechCred are Jay Zerbs and Brian Reda, operators at the plant.",
    "And while many of those jobs require skills, including tech skills, that doesn’t mean college, he said.",
    "And the manufacturer of custom metal products is ready to apply for more in the next round of funding.",
    "Since launching TechCred in October 2019, the program has exceeded the Lt. Governor’s expectations.",
    "We’re a testament to that.”\nHynes is the kind of business “that we love to support,” Husted said.",
    "On-the-job training can give individuals the skills they need to work the available jobs.",
    "Setup is one of the key positions within Hynes, Organ explained.",
    "“We’re in that ongoing sustainability phase and it’s working.",
    "Husted doesn’t expect that funding to lessen anytime soon.",
    "Copyright 2022 The Business Journal, Youngstown, Ohio.",
    "So I feel really good about where it is,” she said.",
    "“A lot of my family lost their jobs,” Husted said.",
    "“We have benefited from all of those,” Organ said.",
    "“We’re already up to 40,000,” he said.",
    "Jon Husted tours Hynes Industries.",
    "Pictured at top: Lt. Gov.",
    "“The demand is there.",
    "“It’s very popular.",
    "Jon Husted."
  ]
}