{
  "id": 4929,
  "mediaId": 8491,
  "date": "2022-04-19",
  "headline": "DeWine among Republican governors forming ‘Border Strike Force’",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/04/AP22104828789102-1.jpg?w=1280",
  "link": "https://www.wkbn.com/news/ohio/dewine-among-republican-governors-forming-border-strike-force/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt McGovern",
  "authorUrl": "https://www.fox44news.com/author/matt-mcgovern/",
  "termIds": [
    3554,
    2143,
    5078,
    5213,
    1126,
    1258,
    6653
  ],
  "sentences": [
    "Signatories to the memorandum include: Governors Doug Ducey (AZ), Greg Abbott (TX), Kay Ivey (AL), Mike Dunleavy (AK), Asa Hutchinson (AR), Ron DeSantis (FL), Brian Kemp (GA), Brad Little (ID), Eric Holcomb (IN), Kim Reynolds (IA), Larry Hogan (MD), Tate Reeves (MS), Mike Parson (MO), Greg Gianforte (MT), Pete Ricketts (NE), Chris Sununu (NH), Doug Burgum (ND), Mike DeWine (OH), Kevin Stitt (OK), Henry McMaster (SC), Kristi Noem (SD), Bill Lee (TN), Spencer Cox (UT), Glenn Youngkin (VA), Jim Justice (WV), and Mark Gordon (WY).",
    "The new strike force will aim to target cartels and criminal organizations operationally and financially by increasing collaboration, improving intelligence, investing in analysis, combating human smuggling, and stopping drug flow among each of the participating states.",
    "This is a multi-state partnership designed to disrupt and dismantle the transnational criminal organizations along the southern border.",
    "This comes after an increase in criminal operations along the southern border, and in communities across the country.",
    "WASHINGTON, D.C. (FOX 44) – Twenty-six Republican governors, including Ohio Governor Mike DeWine, led by Texas Gov.",
    "The Republican governors are using State National Guard and law enforcement reinforcements in Texas and Arizona.",
    "Greg Abbott, announced the creation of the American Governors’ Border Strike Force on Tuesday.",
    "Joe Biden they say could immediately relieve border activities.",
    "They have 10 policy solutions they want present to Pres.",
    "You can view the memorandum here."
  ]
}