{
  "id": 4956,
  "mediaId": 8498,
  "date": "2022-04-21",
  "headline": "Groups fighting GOP-drawn legislative maps say federal court ruling rewards gerrymandering",
  "image": "https://woub.org/wp-content/uploads/2022/04/img-2507-scaled-e1650567887754.jpg",
  "link": "https://woub.org/2022/04/21/groups-fighting-gop-drawn-legislative-maps-say-federal-court-ruling-rewards-gerrymandering/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/andy-chow-statehouse-news-bureau/",
  "termIds": [
    3380,
    392,
    1126,
    975,
    1267,
    6474
  ],
  "sentences": [
    "“Ultimately what the federal court did was pull the rug out from underneath Ohio voters and the Ohio Supreme Court because they are allowing the redistricting commission to use a map that is clearly unconstitutional and clearly unfair to all the voters of the state,” said Miller, adding that there is still time for the commission to get together and follow the Ohio Supreme Court’s latest ruling to pass new maps by May 6.",
    "“The current Commissioners have attained their goal of an unconstitutionally asymmetric map by flaunting orders of the Ohio Supreme Court – flirting even with contempt – and relying on this Court to rescue their unlawful redistricting plan once they had manufactured a sufficient emergency,” Marbley wrote.",
    "In his dissent, U.S. District Court Judge Algenon Marbley said the invalidated, Republican-drawn maps should not be used if the commission does not meet the May 28 deadline because Republican commissioners are the officials that keep approving maps that are later denied by the supreme court.",
    "The Ohio Organizing Collaborative, the coalition of community groups opposing the commission-adopted maps, did not criticize the federal court decision saying instead that it allowed the Ohio Redistricting Commission enough time to go back to the drawing board and adopt constitutional maps.",
    "0+1\n0Like\n0Share\n< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — A voting rights advocacy group and a national Democratic organization is criticizing the federal court ruling that would allow Republicans to implement unconstitutional state legislative district maps.",
    "“We are urging the Ohio Redistricting Commission to honor the taxpayer resources that Ohioans have already spent towards the redistricting process by adopting the fair and bipartisan maps created by the independent mapmakers.",
    "“It rewards the Republicans on the redistricting commission for continuing delays and ultimately gerrymandering Ohio Senate and House districts in violation of the Ohio Constitution,” Miller said.",
    "However, a main argument against those maps is that 16 of the 45 Democratic House seats and 6 of the 15 Democratic Senate seats are within a 3% margin between Democratic and Republican voters.",
    "A panel of federal judges, by a 2-1 decision, ruled that state officials involved in the redistricting process have until May 28 to adopt new Ohio House and Ohio Senate district maps.",
    "Miller’s group, along with a coalition of community organizations and a national Democratic organization, filed objections to the Republican-drawn Map 3 in the supreme court.",
    "Mike DeWine and Secretary of State Frank LaRose, both Republicans, joined Senate President Matt Huffman (R-Lima) and House Speaker Bob Cupp (R-Lima) in voting for the maps.",
    "“The federal court has illogically and dangerously given its blessing to gerrymandered maps that were declared unconstitutional and invalid by the Ohio Supreme Court.",
    "The commission hired two outside “independent” mapmakers to draw state legislative plans, but ended up going with a different set of maps on their fourth attempt.",
    "The federal court case was filed by a group of Republican voters who said the federal judges needed to step-in because state officials were at an impasse.",
    "Auditor Keith Faber, a Republican, voted against the maps with Sen. Vernon Sykes (D-Akron) and House Minority Leader Allison Russo (D-Upper Arlington).",
    "Republican members of the Ohio Redistricting Commission said they were reviewing the federal court decision and did not want to provide comment yet.",
    "If Republican Commissioners continue their partisan hijack of democracy, the federal courts should not be complicit in those actions,” said Holder.",
    "The Republican plaintiffs argued that new maps needed to be implemented soon so Ohio voters could have a primary for state legislative races.",
    "The group’s affiliate, National Redistricting Action Fund, has also been a petitioner to challenge the commission maps in the supreme court.",
    "We demand fair maps to ensure that all of our communities are equally represented,” said Jeniece Brock, OOC’s Policy and Advocacy Director.",
    "Petitioners say those toss-up races could result in the GOP retaining a supermajority and therefore unduly favors the Republican party.",
    "If new maps are not in place, then the federal court will implement maps adopted by the Ohio Redistricting Commission on February 24.",
    "Early voting is already under way for Ohio’s May 3 primary which is still happening for statewide, congressional, and local races.",
    "The maps created 54 Republican and 45 Democratic House seats along with 18 Republican and 15 Democratic Senate seats.",
    "Jen Miller, executive director of the League of Women Voters of Ohio, said she was disappointed by the ruling.",
    "Former U.S. Attorney General Eric Holder is chair of the National Democratic Redistricting Committee.",
    "Those maps – referred to as Map 3 – were later ruled unconstitutional by the Ohio Supreme Court.",
    "These kinds of actions put the legitimacy of the federal judicial system into question.",
    "The May 28 deadline is based on having maps in time for an August 2 primary.",
    "The February 24 maps – Map 3 – were approved by a 4-3 vote.",
    "Gov."
  ]
}