{
  "id": 5007,
  "mediaId": 8414,
  "date": "2022-04-22",
  "headline": "Ohio National Guard provides support to Ukraine",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/28/2022/04/web1_20220412_THS_0006-1.jpg",
  "link": "https://www.portsmouth-dailytimes.com/news/75008/ohio-national-guard-provides-support-to-ukraine",
  "mediaOutlet": "portsmouth-dailytimes.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Portsmouth Daily Times",
  "authorUrl": "",
  "termIds": [
    2143,
    1161,
    1408,
    974,
    959,
    951,
    6077,
    6569,
    6672,
    6474
  ],
  "sentences": [
    "He also signed Executive Order 22-02D prohibiting State of Ohio investment or purchasing activity from aiding Russia in violating the rights of the Ukrainian people and ordered all state agencies, boards and commissions, state educational institutions, and pension funds, to the extent practicable, divest any investment in and terminate any contracts with a Russian institution or company.",
    "In February, Governor DeWine directed the Ohio Department of Commerce to cease both the purchase and sale of all vodka made by Russian Standard, the only overseas, Russian-owned distillery with vodka sold in Ohio and declared February 27 a Day of Prayer in Ohio to show support for innocent civilians under attack by Russia.",
    "Delivery of the personal protective gear donations to Ukraine is being coordinated by the Fund to Aid Ukraine, a non-profit organization based in Parma that is affiliated with the United Ukrainian Organizations of Ohio, a member of the Ukrainian Congress Committee of America.",
    "Following a request from the Department of Defense (DOD), the Ohio Army National Guard will give an undisclosed number of M-113 Armored Personnel Carriers (APC) to Ukraine as part of a drawdown of DOD inventories to support the war-torn country.",
    "Earlier this month, Governor DeWine announced that the Ohio Department of Public Safety had begun collecting hundreds of pieces of surplus or expired personal protective gear for donation to members of the Ukraine civilian territorial defense.",
    "Local law enforcement agencies that have not yet donated but would like to offer unneeded personal protective gear to Ukraine, should contact their nearest Ohio State Highway Patrol post to arrange for the transfer of the equipment.",
    "More than two dozen law enforcement agencies in Ohio agreed to donate unneeded equipment, including approximately 75 ballistic and riot helmets and 840 pieces of body armor, including vests and plates.",
    "“Ohio has a strong Ukrainian community, and we stand behind them and their families overseas.”\nThe announcement is the latest effort in Ohio to help Ukraine combat the unprovoked attack by Russia.",
    "In March, Governor DeWine held the Ohio Summit on Ukrainian Refugees to bring together various organizations to ensure Ohio is ready to help, should it be asked to accept Ukrainian refugees.",
    "COLUMBUS— Ohio Governor Mike DeWine announced today that the Ohio Army National Guard will aid Ukraine by providing armored personnel carriers for use against continued Russian aggression.",
    "“As we continue to learn about Russian war crimes in Ukraine, those of us in Ohio stand ready to help the Ukrainian people in any way possible,” said Governor DeWine.",
    "M-113 APCs are used to move Soldiers and equipment across the battlefield while providing protection from small arms fire and the effects of artillery."
  ]
}