{
  "id": 5027,
  "mediaId": 8288,
  "date": "2022-04-22",
  "headline": "In Town Hall, Renacci Embraces Culture Wars in Primary Against DeWine",
  "image": "",
  "link": "https://www.clevescene.com/news/in-town-hall-renacci-embraces-culture-wars-in-primary-against-dewine-38790031",
  "mediaOutlet": "clevescene.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Zuckerman",
  "authorUrl": "https://www.clevescene.com/author/jake-zuckerman-ohio-capital-journal",
  "termIds": [
    2143,
    2765,
    1991,
    247,
    392,
    6026,
    6678,
    6474
  ],
  "sentences": [
    "We are bringing people across the border in Mexico, and they’re coming to Ohio because we have sanctuary cities.”\nIn 2016, Renacci joined a unanimous U.S. House vote on a bill, later signed into law by President Barack Obama, that blocked the DEA from freezing suspicious orders of opioid shipments from drug companies.",
    "“What I have said is, we’ve gotten so much federal money, let’s take that federal money and eliminate the gas tax so that hardworking Ohioans get a chance to save a little money.”\nOn COVID-19, Renacci repeatedly accused DeWine of running the state like then-New York Governor Andrew Cuomo.",
    "Renacci alleged parents are being ignored as the theory is being “pushed down their children’s throats.”\nWhen asked by the emcee, Renacci acknowledged that no Ohio cities moved to defund the police in the wake of a Minneapolis police officer murdering George Floyd in the summer of 2020.",
    "During the 30-minute event, the former congressman blamed “illegal immigrants” for record drug overdose deaths in Ohio; pledged to take on “critical race theory;” and criticized what he called an insufficiently aggressive National Guard in responding to racial justice protests in 2020.",
    "Newsmax said it merely reported on allegations by public officials and called the lawsuits “a clear attempt to squelch such reporting and undermine a free press.”\nGas tax, COVID\nRenacci also attacked DeWine through a lane closer to more conventional, pocketbook issues.",
    "His congressional seat was replaced by GOP Rep. Anthony Gonzalez, who has since been ostracized by most the Republican Party for disputing Trump’s claim of a stolen election and voting in support of Trump’s impeachment after the Jan. 6, 2021 insurrection.",
    "The new law, according to the Washington Post, made it nearly impossible for the DEA to issue fines to drug distributors for repeatedly ignoring warnings about suspicious sales of hundreds of millions of opioids into American communities.",
    "A 2010 article in Politco labeled him a “serial litigant,” after unearthing a lengthy history of his filing at least 10 lawsuits against others and facing at least 20 as a named defendant, according to the article.",
    "It’s facing defamation lawsuits from two companies that make voter machines in connection with the network’s airing of President Donald Trump’s baseless claims that he won the 2020 election.",
    "A Renacci spokesman did not respond to a request for evidence connecting sanctuary cities or immigration to the drug crisis, or questions about Renacci’s vote on the opioid legislation.",
    "(Congressional disclosure rules only require members to include a range of value and income of their assets)\nRenacci has made several statements critical of COVID-19 vaccinations.",
    "His most recent financial disclosure from 2017 shows he owned between $282,000 and $730,000 0f stock in pharmaceutical companies of Pfizer, Johnson and Johnson, Merck and Sanofi.",
    "Besides serving in Congress and as the mayor of Wadsworth, Renacci is known for his success in the private sector running car dealerships, real estate ventures and nursing homes.",
    "“If you look at his policies, we’re really not running as a Republican state.”\nHe expressed support for increased public spending for Ohio students to enroll in public schools.",
    "And once you do that, you’ll start to bring that crime back down to where it should be.”\nThe television event was aired Wednesday by Newsmax, a conservative TV news station.",
    "An estimated 5,600 Ohioans fatally overdosed in the 12-month period ending in April 2021, according to the CDC, a record high and the fourth highest rate by state.",
    "In a televised town hall, Jim Renacci made a case steeped in conservative culture wars as to why he should represent Ohio Republicans as a gubernatorial candidate.",
    "However, he said DeWine should have more aggressively deployed the National Guard in response to riots that broke out in the immediate aftermath of the killing.",
    "On a question about rising inflation in the U.S., he went after the incumbent for signing off on legislation that raised Ohio’s gas tax by 10.5 cents in 2019.",
    "Several audience members asked Renacci about “critical race theory” — an analytical approach to the ways law and racism have intertwined in American history.",
    "When asked about record overdose deaths, Renacci blamed illegal immigrants and added that the U.S. needs to address the problems of homeless veterans.",
    "In a breach of traditional democratic procedure, DeWine has declined to join Renacci or primary opponent Joe Blystone in a debate.",
    "“He ran the state like Cuomo, when it came to lockdowns and shutdowns, he was right there with New York and California,” he said.",
    "That included criticism of lockdowns in early 2020, and for a lottery designed to increase vaccination rates in the state.",
    "Open Secrets, an organization that analyzed Renacci’s 2017 financial disclosure, estimated his net worth at $83 million.",
    "The term is sometimes used as a catchall by conservatives for the teaching of race and racism in schools.",
    "“When people are breaking windows, I’m sending the National Guard in right behind the police,” he said.",
    "And we believe everyone deserves access to accurate independent coverage of their community and state.",
    "He said the dollars should “follow the child,” and the competition will make for better schools.",
    "He said a defund the police “mentality” prevailed at the time, even if no budgets were cut.",
    "Help us keep this coverage going with a one-time donation or an ongoing membership pledge.",
    "“The first thing he did when he became governor is he raised the gas tax,” Renacci said.",
    "In 2018, Renacci lost a general election to current Democratic U.S. Sen. Sherrod Brown.",
    "According to the Newsmax host, DeWine declined an invitation to appear with Renacci.",
    "“We really need to look at, what’s the cause and why is it coming in?” he said.",
    "If a school system can’t compete, he said, then it won’t have any students.",
    "Join the Cleveland Scene Press Club\nLocal journalism is information.",
    "A DeWine campaign spokesman did not respond to an email.",
    "“You have to show people they can’t break the law.",
    "Originally published by the Ohio Capital Journal.",
    "“We have five sanctuary cities in our state.",
    "Republished here with permission.",
    "Information is power.",
    "Think about that."
  ]
}