{
  "id": 574,
  "mediaId": 8496,
  "date": "2022-02-25",
  "headline": "Parma mayor joins Global Cleveland in pledge of support to Ukrainian community",
  "image": "https://media.wkyc.com/assets/WKYC/images/abf8b661-05bf-42c4-a6ed-413c47a9412e/abf8b661-05bf-42c4-a6ed-413c47a9412e_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/nation-world/ukraine/parma-global-cleveland-pledge-support-ukrainian-community/95-ce6c93d2-641b-407b-9d58-0cdac50654cb",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Global Cleveland will work with Mayor Timothy DeGeeter and all our civic, philanthropic, corporate, and faith based partners to ensure the safety and refuge of our families in Ukraine, in Parma, and throughout out county.\"",
    "We stand by the Ukrainian people both here and abroad and we pray for a swift resolution to end these unnecessary and ongoing acts of violence inflicted against Ukrainians,\" wrote WWGC President and CEO Augie Napoli.",
    "Senators, Democrat Sherrod Brown and Republican Rob Portman, issued statements condemning Russia's aggression, as did all members of Northeast Ohio's congressional delegation and Gov.",
    "You can read the entire statement from Global Cleveland and the city of Parma below:\nThank you to @ParmaMayor for pledging to support the needs of the Ukrainian population.",
    "\"From Kiev, Ukraine to Parma, Ohio - We Stand United\" follows the joint statement that Global Cleveland put out with Cleveland and Cuyahoga County on Thursday.",
    "PARMA, Ohio — Another Northeast Ohio political leader has pledged support to Ukraine amid the violence that has come as a result of Russia's recent invasion.",
    "\"Northeast Ohio is home to an extensive Ukranian community, the largest of which resides in Parma, Ohio,\" according to Friday's statement.",
    "Read our joint statement below: pic.twitter.com/p6clWd5HoY\n— Global Cleveland (@GlobalCleveland) February 25, 2022\nPrevious Reporting:",
    "On Thursday, hundreds filled Pokrova Ukrainian Greco-Catholic Church for a prayer and meeting called \"Cleveland for Ukraine.\"",
    "”United Way of Greater Cleveland condemns this week’s unprovoked and brutal attack on the citizens of Ukraine.",
    "In addition, the United Way of Greater Cleveland has also pledged its support of Ukraine.",
    "On Friday, Parma Mayor Tim DeGeeter released a joint statement with Global Cleveland.",
    "Parma has been the epicenter of the local response to Russia's invasion of Ukraine.",
    "A similar service was held at Parma's Saint Josaphat Cathedral.",
    "Both of Ohio's U.S.",
    "Mike DeWine."
  ]
}