{
  "id": 578,
  "mediaId": 2919,
  "date": "2022-02-24",
  "headline": "Map drawers tell high court why they shouldn’t be held in contempt",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/9deaa3c/2147483647/strip/true/crop/1024x538+0+93/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Ff1%2Faf%2Fc69844c846d2af3f90ccf9f2d407%2Fimg-0883-1024x768.jpeg",
  "link": "https://www.news5cleveland.com/news/state/map-drawers-tell-high-court-why-they-shouldnt-be-held-in-contempt",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marty Schladen",
  "authorUrl": "https://www.news5cleveland.com/marty-schladen",
  "termIds": [
    5761,
    5185,
    1710,
    2143,
    4005,
    3469,
    4730,
    1267,
    6474,
    6679
  ],
  "sentences": [
    "Auditor Faber and Secretary LaRose are not liable in contempt for failing to approve a plan whose constitutionality they doubt simply because this court’s deadline was looming.”\nA filing on behalf of Huffman and Cupp also said those two commissioners took the deadline seriously, but found it impossible to meet.",
    "Asked about the looming deadline, Cupp laughed and said, “You’re really set on these deadlines aren’t you?” When he was told it was the Supreme Court’s deadline, he said, “They are, too.”\nFor his part, DeWine stressed to the court that he implored his fellow commissioners to keep working.",
    "Russo, one of the Democrats, proposed maps that would reduce the partisan split, but Republican members of the commission said they violated other requirements that districts be compact and that they avoid too much splitting of communities such as cities and towns.",
    "For example, over the past decade the GOP has won statewide elections by about 8 percentage points, but the party controls 65% of the seats in the state House, 78% of the seats in the state Senate and 75% of the state’s congressional seats.",
    "In their response to the Supreme Court, lawyers for LaRose and Faber said the officials were placed in an impossible position by having to decide whether to “approve a map whose constitutionality you question or be held in contempt.",
    "DeWine believed and strongly advocated that the commission should continue to work on crafting a new map that, to the greatest extent possible, complied with both Supreme Court decisions and the Ohio Constitution,” his filing said.",
    "Seven of Ohio’s top public officials on Wednesday explained to the Ohio Supreme Court why they shouldn’t be held in contempt for not meeting a deadline last Thursday to submit another set of proposed state legislative maps.",
    "After two rejections by the high court, several of the commission’s GOP members declared that they were “at an impasse” and that it would be impossible to meet the Feb. 17 deadline to produce another set of maps.",
    "The first two sets of maps produced by the commission would have decreased Republican dominance in the legislature, but only by a little, and despite having a GOP majority, the Ohio Supreme Court rejected them.",
    "The commission consists of DeWine and four fellow Republicans: Auditor Keith Faber, Secretary of State Frank LaRose, Senate President Matt Huffman of Lima and House Speaker Bob Cupp, also of Lima.",
    "When “there is a gerrymander that must be undone … some of the … unfairly favored members will lose their seats,” the redistricting commission’s filing Wednesday quoted her as saying.",
    "“While it is (regrettable) that the Commission itself was unable to ‘ascertain and determine’ a new General Assembly district plan … it certainly was not for lack of trying,” it said.",
    "“Finally, the threat of contempt runs afoul of Ohio’s constitutional separation of powers and the express language of” the anti-gerrymandering provision in the Constitution, it says.",
    "Even if none of the commission’s members is cited, last week’s order to explain why redistricting commission members shouldn’t be held in contempt might be having the desired effect.",
    "The governor’s lawyers made an argument about his legal powers that also could be seen as a sign of how diminished his political powers have become in a divided Republican Party.",
    "“Quite simply, we proposed a constitutional plan that complied with the Ohio Supreme Court’s order, but alone we do not have enough votes to pass it,” Russo said in an affidavit.",
    "Sykes and Russo rejected those arguments, with Russo saying the Republican commissioners didn’t want to give up enough seats to make the legislature more closely resemble Ohio.",
    "They described the map Russo produced and what they said was their Republican colleagues’ unwillingness to consider it or hold meetings after the Supreme Court’s Feb. 7 order.",
    "“He lacks the legal power or capacity to dictate or compel a specific action, let alone result,” the filing says, explaining why the DeWine shouldn’t be held in contempt.",
    "“The Republican commissioners were dead set on not approving it or any other plan that complies with (the Ohio Constitution’s) proportionality requirement.”",
    "In their filing Sykes and Russo pointed to video of Cupp, the House speaker, shot by Spectrum News the day before the Feb. 17 deadline to produce new maps.",
    "“Ohio voters, in adopting (the provision) clearly delineated the respective roles of this court and the commission on the subject of a redistricting plan.",
    "The state hasn’t set legislative or congressional boundaries with military and absentee overseas voting due to start in a little more than three weeks.",
    "After earlier this month declaring an impasse, the Republican-led commission scheduled a meeting for later Wednesday to further consider the matter.",
    "But it is expressly prohibited from ordering ‘the commission to adopt a particular general assembly district plan or to draw a particular district.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "For that and other reasons, he said, he shouldn’t be held in contempt personally for what the redistricting commission didn’t do.",
    "And, they claimed, because racial data were considered in drawing the maps, they amounted to unlawful racial gerrymandering.",
    "On Feb. 7, the court set a Feb. 17 deadline to produce maps that more closely resembled the partisan makeup of the state.",
    "'”\nRusso and Sykes, the two Democrats on the panel, made a much simpler case for why they shouldn’t be held in contempt.",
    "In an election year, DeWine can’t get members of his own party to follow his lead in drawing legislative maps.",
    "How seriously one of the lawmakers took the deadline was questioned by their Democratic colleagues.",
    "The commission itself was created by a 2015 constitutional amendment passed with 71% of the vote.",
    "It also has two Democrats: Sen. Vernon Sykes of Akron and Rep. Allison Russo of Upper Arlington.",
    "Mike DeWine, said he was powerless to get legislative leaders in his own party to keep working.",
    "The court is empowered to review and determine the constitutionality of a redistricting plan.",
    "It was aimed at limiting the extreme partisan gerrymandering for which Ohio is noted.",
    "The filings come as Ohio increasingly finds itself mired in a constitutional crisis.",
    "It adds a constitutional argument against a contempt citation.",
    "Some said they tried to do what the court ordered.",
    "Others said the task was impossible.",
    "And the state’s top official, Gov.",
    "So, they did not vote for it.",
    "“Gov."
  ]
}