{
  "id": 593,
  "mediaId": 8497,
  "date": "2022-02-24",
  "headline": "Ohio political mapmaking in limbo as 2022 pressure grows",
  "image": "https://kubrick.htvapps.com/htv-prod/ibmig/cms/image/wlwt/28979302-img-same-sex-couples-celebrate-supreme-court-decision-to-not-hear-case.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-political-mapmaking-in-limbo-as-2022-pressure-grows/39206607",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "COLUMBUS, Ohio —\nWith pressure growing, Ohio's political map-making panel planned to reconvene Thursday in pursuit of consensus on lines for U.S. House and state legislative districts that can satisfy both parties and the state's high court.",
    "Both the secretary of state, who runs elections, and the state attorney general, who serves as the state's lawyer, have urged a state Legislature controlled by fellow Republicans to move the date to avoid violations of state and federal law.",
    "That pledge of coming action was among reasons the commission and its members cited in seeking a reprieve from threatened contempt of court charges tied to blowing past a Feb. 17 deadline for action imposed by the Ohio Supreme Court.",
    "Republican Senate President Matt Huffman, a member of the powerful but stalemated Ohio Redistricting Commission, said Wednesday that GOP mapmakers could present updated legislative maps for a vote as soon as Thursday.",
    "Lawmakers punted their opportunity to redraw that map to the commission, citing the fact that any bill they passed without the support of Democrats would have lacked a crucial time-saving emergency clause.",
    "However, Democratic state Sen. Vernon Sykes, the panel's co-chair, said his party has not been involved in those discussions - portending perhaps a third round of party-line voting on any new plan.",
    "Already, the commission has sent two Republican-drawn, Republican-supported sets of legislative maps to the Ohio Supreme Court, only to have both invalidated as unconstitutionally gerrymandered.",
    "Litigation pending before a federal court from a group of Republican voters asks for the panel's most recent map, declared unconstitutional by the Ohio Supreme Court, to be used this year.",
    "Each would have been good for only four years, rather than the 10 years envisioned to adjust for the once-per-decade U.S. Census, because they lacked any Democratic votes.",
    "The Redistricting Commission has until March to submit the updated congressional map, which must account for Ohio's loss of one U.S. House seat due to lagging population.",
    "House Democrats introduced legislation last month to shift the date a month, to June 7, anticipating potential delays associated with redistricting.",
    "The Ohio Supreme Court has also invalidated a map of U.S. House districts approved by the state Legislature and signed by Republican Gov.",
    "And the 99 seats in the Ohio House and 33 seats in the Ohio Senate aren't the only ones at issue.",
    "The adjustment takes the state to 15 representatives, down from the current 16.",
    "The fate of Ohio's May 3 primary is the most pressing concern.",
    "So far, no GOP-backed effort to do so has emerged.",
    "Mike DeWine."
  ]
}