{
  "id": 6073,
  "mediaId": 6449,
  "date": "2022-04-19",
  "headline": "More States Move to Affirm Parental Rights in Education",
  "image": "https://www.dailysignal.com/wp-content/uploads/classroom-5.jpg",
  "link": "https://www.dailysignal.com/2022/04/19/more-states-move-to-affirm-parental-rights-in-education/?utm_source=rss&utm_medium=rss&utm_campaign=more-states-move-to-affirm-parental-rights-in-education",
  "mediaOutlet": "Daily Signal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maggie Hroncich",
  "authorUrl": "https://www.dailysignal.com/author/maggie-hroncich/",
  "termIds": [
    1916,
    2143,
    2153,
    1126,
    6159,
    5928
  ],
  "sentences": [
    "The bill states, in part, that “a parent shall have the right to play a central role in a child’s education, to obtain critical information about what is being taught or provided in the classroom and to take action when a parent feels that the quality or content of a child’s education does not align with the values and expectations the parent expects and deserves.”\nIf the bill becomes law, Kansas parents will be able to inspect any classroom materials, such as lessons, curriculums, surveys, and tests.",
    "“Lawmakers around the country are considering parents’ bills of rights that affirm that parents are their children’s primary caregivers, prevent schools from compelling students to affirm ideas that violate the Civil Rights Act of 1964, require schools to receive parental permission before administering health services to children, and authorize parents to view the list of books and instructional materials for K–12 classrooms,” the Heritage report reads.",
    "Among the parental rights listed are the right to “question and address your child’s school officials via letters, electronic communications, and in-person meetings” and the right to “make medical care decisions on behalf of your child.”\nRokita, a Republican, said the purpose of the bill of rights is to ensure parents understand their legal rights to oversee their children’s education.",
    "Florida’s law—inaccurately dubbed “the Don’t Say Gay law” by opponents—prohibits “classroom instruction by school personnel or third parties on sexual orientation or gender identity” to children in kindergarten through third grade or in a manner that isn’t age appropriate according to state standards.",
    "The bill also would protect the right of parents to “challenge the material or educational benefit of any book, magazine, or any other material available to students in the school library such that a successful challenge results in the removal of the book, magazine, or material from the school.”\n4.",
    "Indiana\nIndiana Attorney General Todd Rokita issued an updated parents’ bill of rights that, although only a legal opinion and not state law, provides what Rokita calls a “road map” for parents to direct their children’s educational and medical decisions.",
    "The bill also would require any instructional materials used in grades four through 12 to be “age-appropriate or developmentally appropriate for students in accordance with state standards.”\nThe Legislature has not yet voted on the bill.",
    "A report by The Heritage Foundation says that other states are responding to parent dissatisfaction by increasing classroom transparency and asserting parents’ rights as decision-makers for their children.",
    "Florida has been the center of national attention for weeks over its new Parental Rights in Education law, but it’s not alone: Across the country, state lawmakers are introducing similar legislation.",
    "Ohio\nAs with Florida’s law, legislators in Ohio proposed a bill April 4 to prohibit teachers from instructing children from kindergarten through grade three on sexual orientation and gender identity.",
    "The new Alabama law also limits who may use which multiple-occupancy restrooms, locker rooms, changing rooms, and shower facilities in K-12 public schools, “based on their biological sex.”\n2.",
    "In recent months, these five states—among others—have taken action to limit discussion of gender ideology in the classroom and to protect parents’ rights in K-12 education.",
    "The legislation also states: “If a parent or guardian does not provide written consent, a student may opt out of instruction relating to gender identity.”\n5.",
    "Iowa\nA proposed bill in Iowa would require schools to obtain parental consent to teach children in grades one through six about gender identity.",
    "To sound off, please email letters@DailySignal.com and we’ll consider publishing your edited remarks in our regular “We Hear You” feature.",
    "It prohibits classroom instruction to children in kindergarten through fifth grade on gender identity or sexual orientation.",
    "‘We the Parents’ have the duty to raise our families and are primarily responsible for what and how our children learn.",
    "Kansas\nIn March, the Kansas state Senate approved SB 496, which aims to create a parents’ bill of rights.",
    "Parents also would be able to object to any learning activities that infringe on their values.",
    "Remember to include the URL or headline of the article plus your name and town and/or state.",
    "Kay Ivey, a Republican, on April 8 signed into law a bill that goes further than Florida’s.",
    "It is not the government’s job to raise our children, even if it wants to do so.",
    "He wrote:\nThe family unit is the vital building block of a free society.",
    "(The Daily Signal is the news outlet of The Heritage Foundation.)",
    "Mike DeWine, a Republican, has not yet indicated his position.",
    "Have an opinion about this article?",
    "Alabama\nAlabama Gov.",
    "Ohio Gov.",
    "3.",
    "1."
  ]
}