{
  "id": 637,
  "mediaId": 8480,
  "date": "2022-02-21",
  "headline": "Health leaders still cautious for spring with significant COVID-case rate average",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/02/GettyImages-1356173386-1.jpg?w=1280",
  "link": "https://www.wdtn.com/community/health/coronavirus/health-leaders-still-cautious-for-spring-with-significant-covid-case-rate-average/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Morse",
  "authorUrl": "https://www.wdtn.com/author/caroline-morse/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We always use what we used last year which was 50 cases per 100,000 over a two week period, so even if we got down to that for one week period, that would be a good target,” said Clark County Combined Health District Health Commissioner Charles Patterson.",
    "“Looking at where we are right now and where we came from, the outlook for Spring looks much more promising than where we were 2 to 3 weeks ago,” said Miami Valley Hospital Chief Medical Officer Dr. Roberto Colon.",
    "“We’re still about five times that number right now.”\nHealth leaders in the Miami Valley are cautiously optimistic as the weather warms, but until COVID cases are under control, precautions are still encouraged.",
    "“I think some are overly confident where we are, so we are improving but monitoring the situation but I am much more comfortable than where we were a couple weeks ago,” said Dr. Colon.",
    "Less than a year ago, Governor Mike DeWine announced he would remove restrictions once the case rate averaged 50 cases per 100,000 people.",
    "Even with a 90 percent drop in cases since January, Clark county is still averaging 228 cases per 100,000 residents.",
    "At this time, the coronavirus dashboard shows nearly 62 percent of all Ohioans have started the vaccination process.",
    "DAYTON, Ohio (WDTN) – Across the state, Ohioans continue to see a big drop in COVID-19 cases and hospitalizations.",
    "This is the first time Ohio has experienced a significant steady decline in cases since the beginning of August.",
    "As we see these numbers to continue to trend downward, Ohio’s health leaders are cautiously optimistic.",
    "There were under 1,000 cases reported on Monday, marking the second day in the row."
  ]
}