{
  "id": 6548,
  "mediaId": 8473,
  "date": "2022-04-18",
  "headline": "On the record – Warren",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/news/local-news/2022/04/on-the-record-warren-34/?utm_source=rss&utm_medium=rss&utm_campaign=on-the-record-warren-34",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5847,
    4841,
    5739,
    5283,
    4604,
    2163,
    2883,
    2143,
    6067,
    6474
  ],
  "sentences": [
    "Prior law required them to undergo eight hours of training, a background check and an application through their local sheriff;\n• Heard from officials the Courthouse Square Park fountain is near completion and the swan, which is in storage, will be placed on a pedestal overlooking the fountain;\n• Heard from Rucker of the need to get burned houses demolished and compiling a list of those houses needing to be demolished;\n• Approved participating in the Ohio Department of Transportation purchasing program.",
    "WHAT: City council meeting Wednesday\nPRESENT: John Brown, Todd Johnson, Andrew Herman, Greg Greathouse, Mark Forte, Cheryl Saffold, Ronald White, Helen Rucker, Gary Steinbeck, Ken MacPherson and Mayor Doug Franklin\nABSENT: Ashley Miner\nCouncil:\n• Heard from resident Ken Beachler of problems with motorcycles and dirt bikes being driven on roads.",
    "A committee will review the idea;\n• Heard from Franklin that council is reviewing a request by Annette McCoy of the local chapter of the NAACP to pass legislation similar to what Cleveland officials did against the recent bill signed by Gov.",
    "Beachler said he is concerned someone will get hurt or crash into something;\n• Heard from resident Bob Jadloski, who is offering aerial drone services to the city and teaching people to use them.",
    "When the law takes effect, all Ohioans age 21 and older who are lawfully allowed to possess a weapon will be able to carry it concealed on their persons.",
    "Mike DeWine removing training, background check and permitting requirements to carry a concealed weapon in Ohio.",
    "He said he can provide 20 to 25 drones to the city.",
    "He said one person on a bike had a gun.",
    "— Bob Coupland"
  ]
}