{
  "id": 6578,
  "mediaId": 8276,
  "date": "2022-04-12",
  "headline": "Wayne County firefighter who died on duty 'did his job,' possibly averting more fatalities",
  "image": "https://www.gannett-cdn.com/presto/2022/04/12/NATG/5921994c-524a-4e2b-b36c-50dcf74c3ede-I71_fatal_press_conference002.jpg?crop=1999,1125,x0,y125&width=1999&height=1125&format=pjpg&auto=webp",
  "link": "https://www.the-daily-record.com/story/news/local/2022/04/12/ohio-mourns-death-wayne-firefighter-philip-wigal-who-died-line-duty/7293476001/",
  "mediaOutlet": "bucyrustelegraphforum.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryce Buyakie",
  "authorUrl": "https://www.the-daily-record.com/staff/4704308001/bryce-buyakie/",
  "termIds": [
    0
  ],
  "sentences": [
    "The veteran firefighter died Monday after he and a state trooper were struck by a semi tractor-trailer while investigating a crash on Interstate 71 just south of the state Route 301 exit, according to information from the Highway Patrol.",
    "Mike DeWine ordered flags at half staff on \"all public buildings and grounds throughout Wayne County, the Ohio Statehouse, the Vern Riffe Center, and the Rhodes State Office Tower,\" a news release from the governor's office reads.",
    "Crews that responded to the scene from nearby agencies included the Ohio Highway Patrol, sheriff's deputies from Ashland and Wayne counties, EMS crews from Ashland, Town & Country and New Pittsburg and two towing companies.",
    "WEST SALEM – First responders across Ohio and the communities of Wayne and Ashland counties are reeling from the death of a 35-year-old firefighter who was doing his job when his life ended this week.",
    "Be mindful while driving:State officials plead for attentive driving as crashes involving ODOT workers rise\nState Rep. Scott Wiggam issued a statement Tuesday expressing his condolences.",
    "Nearly 45 minutes after Hill was dispatched, a semi struck the left rear of a fire engine, a Highway Patrol cruiser and the vehicle involved in the initial crash, according to Santiago.",
    "\"Our hearts are saddened with the tremendous loss that Town & Country Fire District suffered yesterday,\" the Paint Township Mount Eaton Fire Department posted on its Facebook page.",
    "A routine investigation goes wrong\nState troopers were sent to the southbound lanes of I-71 at 3:14 p.m. Monday following a report of a minor injury crash involving one vehicle.",
    "Area fire departments are in mourning and have posted messages on their Facebook pages, while one department will donate money from a coming fundraiser to Wigal's family.",
    "The driver of the semitrailer, identified as Edyt Hernandez, 41, of Hialeah, Florida, was transported to an area hospital with minor injuries, authorities said.",
    "'This is a huge loss for our fire department'\nWigal began his career with the department in August 2006 as a part-time firefighter, Chief Adam Hory had said.",
    "The Ashland City Fire Department will offer all proceeds from its 49th annual Pancake Day to the Wigal family, according to the department's Facebook page.",
    "Local firefighters tried to administer aid to Wigal but those attempts were unsuccessful, and he was pronounced dead at the scene, he said.",
    "Hory thanked those who sent support, which came from the local community and fire departments from around the state and nation.",
    "\"Once we were able to determine the trooper was OK, we were unable to locate the firefighter on the scene,\" Roberts said.",
    "Once the investigation is completed, evidence will be sent to the Wayne County Prosecutor's Office for possible charges.",
    "As troopers started their investigation, units of the Town & Country Fire District arrived, according to a news release.",
    "Trooper Steven Hill, 37, from the Ashland post, was taken to a hospital with injuries that were not life-threatening.",
    "Hill radioed back to troopers that he had been hit, Highway Patrol Lt. Todd Roberts said as the news conference.",
    "State and U.S. flags were lowered to half-staff in honor of Town & Country Fire District's Lt. Philip Wigal.",
    "Wigal was one of three full-time firefighters that served alongside 24 volunteer members in the district.",
    "\"He will always be remembered as a true hero that paid the ultimate price in service of his community.\"",
    "\"The family of Lt. Philip Wigal is in our thoughts and prayers during this time of grief and loss.\"",
    "Wigal had parked the fire engine to create a barrier between traffic and the accident scene, Sgt.",
    "\"Phil was strong in his faith and it seemed to grow stronger every day,\" the fire chief said.",
    "\"This is a huge loss for our fire department, the community and most importantly his family.\"",
    "\"The community will never forget his courage, commitment and bravery,\" the statement reads.",
    "\"It was determined he had been struck by that semi and required some extrication.\"",
    "\"If he didn't put the equipment there,\" multiple fatalities might have happened.",
    "In 2011, he was promoted to lieutenant, and in May 2014 he was hired full time.",
    "He was a devoted family man to his wife and two daughters, Hory said.",
    "\"Flags shall remain lowered until sunset on the day of his funeral.\"",
    "The event is 6 a.m. to noon Saturday at the Central Fire Station.",
    "Hernandez was cooperative and has given statements, Roberts said.",
    "He did everything by the book and \"did his job,\" Santiago said.",
    "Hill was documenting the crash near the damaged vehicle.",
    "Ray Santiago said at a Tuesday press conference.",
    "The investigation is ongoing, Santiago said.",
    "Flags lowered as community mourns\nGov.",
    "Both Hill and Wigal also were struck.",
    "Wigal was finishing his report.",
    "It was a routine investigation."
  ]
}