{
  "id": 6579,
  "mediaId": 8498,
  "date": "2022-04-11",
  "headline": "School leaders say a bill to change the property tax appeal process could hurt most Ohio taxpayers",
  "image": "https://woub.org/wp-content/uploads/2022/04/tax-bill-credit-aeolos-image-shutterstock.com_-scaled-e1649689531473.jpg",
  "link": "https://woub.org/2022/04/11/school-leaders-say-a-bill-to-change-the-property-tax-appeal-process-could-hurt-most-ohio-taxpayers/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jo Ingles | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/jo-ingles-statehouse-news-bureau/",
  "termIds": [
    2143,
    979,
    6077,
    6474
  ],
  "sentences": [
    "Is it the homeowner whose property is now protected from the new restrictions in the law or is it all of the other homeowners who will have to pay more in taxes to subsidize their neighbor’s undervalued property?” Schwartz said.",
    "For more than four decades, local school districts have been able to challenge owners whose properties are believed to be undervalued for tax purposes.",
    "This bill — which limits how school districts can challenge property values at local boards of revisions — is meant to remedy that situation.",
    "School districts contend if those changes are signed into law, the result will be tax shifting that will hurt the majority of taxpayers.",
    "It’s often commercial property owners who are challenged because residential properties generate less tax revenue in comparison.",
    "Mike DeWine (R-Ohio) a bill that would limit the role of school districts and cities in the property tax challenge process.",
    "Republicans who testified for this new bill in the Ohio legislature have said school districts often abuse that process.",
    "The Ohio School Boards Association’s Will Schwartz warned this bill will mean less tax revenue for schools.",
    "It would also shorten the time frame for appeals and increase the minimum amount they can challenge.",
    "The final bill would ban districts from appealing county board of revision decisions to the state.",
    "< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — State lawmakers have sent to Gov.",
    "It’s now up to DeWine to decide whether to sign the bill into law.",
    "He said someone will end up paying for the loss.",
    "“Which taxpayer is being protected?"
  ]
}