{
  "id": 658,
  "mediaId": 8371,
  "date": "2022-02-23",
  "headline": "Ohio Lake Erie Commission seeking submissions for 30th annual ‘Life on Lake Erie’ photo contest",
  "image": "https://www.morningjournal.com/wp-content/uploads/2021/07/mornjourn.jpg",
  "link": "https://www.morningjournal.com/2022/02/23/ohio-lake-erie-commission-seeking-submissions-for-30th-annual-life-on-lake-erie-photo-contest/",
  "mediaOutlet": "morningjournal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Editorial Staff",
  "authorUrl": "https://www.morningjournal.com/author/editorial-staff/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I look forward to seeing the submissions for this year’s special 30-year celebration.”\nThe Life on Lake Erie photo contest has been a signature outreach opportunity since 1992 with more than 4,100 participants representing 90 communities in Ohio and beyond, and 328 photo awards, the release said.",
    "Winning photographs may be displayed on the Ohio Lake Erie Commission website and social media platforms, may be used in Commission publications to promote Lake Erie and will be part of a statewide gallery tour, according to the release.",
    "To recognize 30 years of “Life on Lake Erie” photos and incredible Laker Erie images captured by the amateur photographers participating in the contest, a video is available highlighting the winning photos of every year since 1992.",
    "The contest is an opportunity for amateur photographers, at least 18 years of age, to submit their favorite photos of Lake Erie and the surrounding landscapes, people, wildlife and events that take place on and around the lake.",
    "The contest is an opportunity for amateur photographers to showcase their talent for photographing one of Ohio’s most valuable natural resources – Lake Erie, according to a news release from the Commission.",
    "“This annual photo contest continues to be an amazing opportunity to showcase the beauty of the lake for everyone to see and enjoy, as well as to share the talents of amateur photographers,” said Gov.",
    "The Ohio Lake Erie Commission was established to preserve Lake Erie’s natural resources, to protect the quality of its waters and ecosystem and to promote economic development of the region.",
    "To kick off this year-round recognition, the Commission is seeking submissions for the 30th annual “Life on Lake Erie” photo contest.",
    "This year’s contest is open to original photos taken from Aug. 1, 2021, through July 31, 2022, of Ohio’s Lake Erie watershed.",
    "Winning photographs and photographers will be featured at the fall meeting of the Commission, the release said.",
    "Throughout 2022, the Ohio Lake Erie Commission (OLEC) is celebrating its 30-year anniversary.",
    "Entry forms and official contest rules can be found at https://lakeerie.ohio.gov/.",
    "Mike DeWine."
  ]
}