{
  "id": 6743,
  "mediaId": 8288,
  "date": "2022-04-15",
  "headline": "Ohio Supreme Court Rejects GOP Legislative Maps for a Fourth Time",
  "image": "",
  "link": "https://www.clevescene.com/news/ohio-supreme-court-rejects-gop-legislative-maps-for-a-fourth-time-38743720",
  "mediaOutlet": "clevescene.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Tebben",
  "authorUrl": "https://www.clevescene.com/author/susan-tebben-the-ohio-capital-journal",
  "termIds": [
    0
  ],
  "sentences": [
    "“With time in mind, it appears that the most efficient way for the commission to proceed may well be to continue working with Dr. McDonald and Dr. Johnson to complete the plan on which they have made considerable progress — if they are willing and available and if the commission has the authority to timely retain them for additional work.”\nThe court argued that “by certain measure” the Johnson/McDonald plan “is on track to being constitutionally compliant.”\nSeemingly responding to sticking points that came up along the way, the court’s majority gave new guidance on adopting a new legislative plan.",
    "“Money that is being consumed by the never-ending cycle of map drawing, litigation, and now, two primaries, one on May 3 and the other perhaps on Aug. 2, all ordained by the majority’s overreach.”\nJustice Patrick DeWine claimed the majority had “long ago forsaken any concern about the actual words of the Constitution – it simply demands a General Assembly-district plan that achieves its policy goals.”\n“With each iteration of these cases, it becomes more evident that a rogue majority is simply exercising raw political power,” Justice DeWine wrote in his own dissent.",
    "“Particularly problematic,” those justices said, was Huffman’s “last-minute insistence” that the mapmakers consider the addresses of incumbent House and Senate members in their district drawing, which the court said “pulled the rug out from under the independent map drawers.”\nIn throwing forth the revised version of the third plan, commission members sent the court “a nearly identical one-sided distribution of toss-up districts,” the court rules.",
    "“The timeline of events demonstrates convincingly that the commission — or at least some members of the commission — when faced with one or more plans that closely matched constitutional requirements in the form of Dr. McDonald’s and Dr. Johnson’s plans, reverted to partisan considerations when time was running short, even though the potential for successful completion was high,” the majority justices wrote.",
    "The supreme court spelled out in its Thursday ruling the way in which objections to the maps showed “beyond a reasonable doubt” that the plan once again violated the constitutional regulations surrounding redistricting, but they didn’t order any other remedies offered by the map challengers, which included taking the map-drawing power away from the ORC.",
    "The commission started off on the right foot this time, the justices in the majority said, when they “began to heed our suggestions” given in the previous map rejection, which advised the commission to hire independent mapdrawers, hold near-daily meetings, and give mapdrawers “a neutral set of instructions” that they would use to publicly draw maps.",
    "The best option, he then said, was to make a few changes to the previously rejected map, and submit it to the court, with the argument that it was better to get a map in on time than to wait for the mapmakers to be done with their map and possibly go past the March 28 date set by the court.",
    "“No one should be deceived.”\nThe justice goes on to say the authors of the constitutional amendment overhauling redistricting “were overly optimistic,” and the threat of a four-year map instead of 10-year map “was not the stick it was thought to be” to incentivize bipartisan work.",
    "“While the process has proved challenging for the commission, as evidenced by four legislative plans falling short of (the constitution’s) requirements, the difficulty of the task is not a reason for federal-court intervention,” the majority of supreme court justices wrote.",
    "Broken ‘parachute’\nDespite the fact that the court told the commission to come up with an “entirely new map” this time, the court said the commission acted as though a tweaked version of an invalidated plan was a “parachute” to get it over the finish line.",
    "Those judges are considering a lawsuit by Ohio voters asking that the federal court decide on a map for the state to use, under the argument that voters are losing their constitutional right to do so without a map to establish candidate districts.",
    "The Ohio Supreme Court turned away a fourth set of redistricting plans from the Ohio Redistricting Commission in a 4-3 decision on Thursday, but left the responsibility with the commission to redraw the maps yet again.",
    "Adopting another new plan…again\nThe majority justices, while acknowledging that they do not have the power to adopt a map of their own, suggested a more “efficient way” of moving forward with a new plan.",
    "The three votes against rejecting the maps came from expected sources: Justices Sharon Kennedy, Patrick DeWine and Patrick Fischer, all of whom voted against rejection in the last three court decisions.",
    "The commission also partnered with the Ohio Channel to set up a room with cameras showing Johnson and McDonald working, and the computers on which they were collecting data and drawing district lines.",
    "On that day, Huffman made a move to bypass the Johnson/McDonald maps because he said time was running short, too short for the commission members to offer amendments and make changes by the deadline.",
    "In the week leading up to the March 28 deadline for the most recent maps, the commission hired Dr. Douglas Johnson, as proposed by the GOP, and Dr. Michael McDonald, as proposed by the Democrats.",
    "“While this may be true, the improvement falls short of landing in constitutional territory.”\nThe court is now giving the commission until 9 a.m. on May 6 to come up with an “entirely new” plan.",
    "“The evidence suggests that Springhetti … modified the second revised plan in one afternoon to produce the (fourth map),” the majority justices wrote in their rejection of the most recent maps.",
    "The fourth set of maps were similar to the third maps, as admitted by Senate President Matt Huffman, the member of the commission who proposed they be adopted by the ORC at the end of March.",
    "The fact remained, though, that all the toss-up districts were considered “Democratic-leaning” in the GOP analysis of the maps, and none were similarly toss-ups for Republican districts.",
    "During the late hours of March 28, Cupp and Huffman both argued the commission couldn’t push past the deadline because the court had said it would not allow any other extensions of time.",
    "Justices also took time in their decision to argue against a federal intervention in state redistricting, something being discussed by a three-judge panel in U.S. District Court.",
    "“The majority’s continued denial of the limitation of this court’s power may end up costing the taxpayers millions of dollars,” Kennedy wrote in her dissent to the newest ruling.",
    "“(The court’s job) is not to impose extraconstitutional standards on the commission in an attempt to achieve political outcomes that the court finds desirable,” DeWine wrote.",
    "This wasn’t the case in the congressional maps, forcing challengers of that map to file brand new lawsuits to fight against what they see as gerrymandered federal districts.",
    "The number of toss-up districts — those districts whose partisan “advantage” is less than 2 percentage points — went from 26 to 23 from the third maps to the fourth.",
    "Kennedy, who is running for chief justice in this year’s election, used her Thursday dissent to again discredit the majority opinion for overuse of judicial power.",
    "She criticized the justices who rejected the last three maps for moving constitutional goalposts and abusing their power in previous dissents over redistricting.",
    "Justice Patrick DeWine, son of governor and commission member Mike DeWine, recused himself from the contempt proceedings, but not from the redistricting rulings.",
    "The commission met several times during that week to answer questions from the mapmakers and give them instructions, up until the day of the deadline.",
    "They also retained jurisdiction on the map, meaning they hold on to the authority to reject or approve the map as they have in previous instances.",
    "“Senate President Huffman and House Speaker Cupp point out that the (fourth plan) improves upon the (third plan),” court justices noted.",
    "The commission, however, could file a motion for an extension to their time with the secretary of state if they can prove it is needed.",
    "The court was more specific this time in saying no request for extension of time could be filed for objections to the adopted maps.",
    "In a separate announcement, the court also denied requests to hold commissioners in contempt of court for violating court orders.",
    "To do so, he tasked Blake Springhetti, a House GOP staffer who had worked on the previous maps, to make the changes that night.",
    "Whatever the reason for the “mess” redistricting has become, Patrick DeWine said court overreach is not the solution.",
    "And we believe everyone deserves access to accurate independent coverage of their community and state.",
    "They also said there was evidence of efforts to block McDonald and Johnson from finishing their maps.",
    "Help us keep this coverage going with a one-time donation or an ongoing membership pledge.",
    "“No matter what the primary date is to be, time is of the essence,” the justices wrote.",
    "The two were paid at a rate of $450 per hour, with a cap set at $49,000 each.",
    "They again pushed for transparency and public viewing of the process.",
    "Join the Cleveland Scene Press Club\nLocal journalism is information.",
    "Originally published by the Ohio Capital Journal.",
    "Republished here with permission.",
    "Information is power."
  ]
}