{
  "id": 6873,
  "mediaId": 8498,
  "date": "2022-04-15",
  "headline": "DeWine supports constitutional amendment to change rules for setting bail",
  "image": "https://woub.org/wp-content/uploads/2021/03/mike_dewine_signs_sb263_010621_6-e1614904856802.jpeg",
  "link": "https://woub.org/2022/04/15/dewine-supports-constitutional-amendment-to-change-rules-for-setting-bail/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/andy-chow-statehouse-news-bureau/",
  "termIds": [
    5761,
    4710,
    3235,
    2143,
    2040,
    1126,
    6474
  ],
  "sentences": [
    "Russian retreat from areas around Kyiv reveals ‘pattern of apparent war crimes’ A Data Dive Into The Ohio Valley Midterm Election Results W.Va. House Passes Bill to Reduce Steam Coal Severance Tax Kentucky Bourbon Distilleries Draw Record Number of Visits",
    "The court ruled, in DuBose v. McGuffey, that public safety should not be a consideration when determining bail because the state already has a different procedure in which public safety is used as a factor for release: pre-trial detention.",
    "A different bipartisan bill would increase the amount of crimes that can be considered for pre-trial detention services and change the evidentiary standard to keep someone – presumed to be a violent criminal – in jail until trial.",
    "But we have to take action to allow judges to once again do what they have always been able to do and that is take into consideration the safety of the community in setting bail and setting bond,” said DeWine.",
    "Some have accused the proposed amendment to be a political move that would undercut the power of the Ohio Supreme Court at a time when it has been at odds with the Republican supermajority of the legislature.",
    "Opponents of the resolution have said lawmakers should expand the ability to use Ohio’s pre-trial detention services, instead of pushing for a constitutional amendment that makes it easier to rely on bail.",
    "Along with allowing judges to consider public safety when determining bail, the resolution also strips the Ohio Supreme Court’s ability to prescribe rules related to the amount and conditions of bail.",
    "The resolution was scheduled for a vote on the House floor earlier in the month, but instead House Speaker Bob Cupp (R-Lima) said the resolution would remain in committee for further consideration.",
    "Regardless of intent, the efforts to amend the state constitution will unfortunately double-down on this often-ineffective approach,” said Robert Alt, president and CEO of The Buckeye Institute.",
    "The Ohio Supreme Court has ruled against newly-drawn Ohio House, Ohio Senate, and congressional district maps – approved by lawmakers and legislative leaders – on five separate occasions.",
    "The movement to change bail has been in the works for years at the Statehouse with the unlikely pairing of liberal and conservative groups, such as The Buckeye Institute and ACLU of Ohio.",
    "0+1\n0Like\n0Share\n< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — The push to put a constitutional amendment on the statewide ballot gained the endorsement of Gov.",
    "“Ohioans can definitively instruct the court with their votes about their desire for public safety to be restored to the bail analysis,” Yost told a House committee.",
    "Those groups have said Ohio needs to move away from using bail as a function of public safety and only use it as a financial accountability tool.",
    "State lawmakers are holding committee hearings on a resolution that would put the issue on the ballot for the November General Election.",
    "The proposed constitutional amendment would allow judges to make public safety a factor when determining an accused offender’s bail.",
    "DeWine, a former prosecutor and state attorney general, said the court made the “wrong decision.”\n“We have to respect that decision.",
    "But the measure has seen pushback, especially from a bipartisan coalition of groups advocating for criminal justice reform.",
    "“Ohio has an over-reliance on a cash bail system that allows violent criminals to buy their way out of jail.",
    "Mike DeWine, a Republican, who said public safety should be considered when judges are setting cash bail.",
    "DeWine’s son, Ohio Supreme Court Justice Patrick DeWine, was among the three dissenting justices.",
    "The resolution is getting support from certain Republican lawmakers, prosecutors, and judges.",
    "Attorney General Dave Yost, a Republican, is also a vocal supporter of the measure.",
    "The issue stems from an Ohio Supreme Court decision in January."
  ]
}