{
  "id": 6908,
  "mediaId": 8373,
  "date": "2022-04-11",
  "headline": "Ohio overtime changes, online marketplace bills signed into law",
  "image": "https://jnswire.s3.amazonaws.com/jns-media/b8/e7/127110/overtime.jpg",
  "link": "https://mountvernonnews.com/stories/623067029-ohio-overtime-changes-online-marketplace-bills-signed-into-law",
  "mediaOutlet": "mountvernonnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "J.D. Davidson",
  "authorUrl": "https://mountvernonnews.com/author/j-d-davidson",
  "termIds": [
    4858,
    2145,
    2143,
    1489,
    956,
    970,
    6474
  ],
  "sentences": [
    "We’re sending a message to these criminals to not take advantage of our citizens in this capacity – it will not be tolerated.”\nThe bill defines a high-volume, third-party seller as someone, in any continuous 12-month period in the previous 24 months, who has entered into at least 200 discreet sales for new or unused consumer goods, resulting in at least $5,000 of gross revenue.",
    "DeWine also signed House Bill 272, which requires high-volume, third-party online sellers to disclose certain pieces of identifying information to help protect consumers, according to sponsor Rep. Haraz Ghanbari, R-Perrysburg.",
    "\"This legislation is necessary due to a federal change in the U.S. Department of Labor's new overtime rule and the reality that more employees are working from home,\" Andrew Brenner, R-Delaware, said.",
    "The bill \"will increase flexibility for the employee on how they accomplish their work duties and removes employer incentives to prohibit employees from accessing work material at home.\"",
    "(THE CENTER SQUARE) – Ohio businesses will not have to pay employees overtime for some tasks, and high-volume online marketplace sellers will have to be identified after Gov.",
    "It also clarifies that a small amount of time spent performing tasks outside the normal workday without specific direction from an employer is not included in overtime.",
    "“It’s going to simultaneously protect our consumers and assist in curbing organized retail crime across Wood County and our great state.",
    "Its changes to overtime pay requirements were a result of adjustments to employee workdays as a result of the COVID-19 pandemic.",
    "Senate Bill 47, which spent more than a year in the General Assembly, was one of the laws created with DeWine’s signature.",
    "The new law exempts an employer from having to pay overtime wages when an employee is traveling to and from a worksite.",
    "The Ohio Chamber of Commerce supported the legislation, while the Ohio Association of Justice testified against it.",
    "DeWine for signing this important piece of legislation into law today,” Ghanbari said.",
    "It also followed changes to federal overtime rules.",
    "Mike DeWine signed two bills into law.",
    "“I’m thankful to Gov."
  ]
}