{
  "id": 7014,
  "mediaId": 8494,
  "date": "2022-04-13",
  "headline": "Environmentalists ask Mike DeWine to veto Ohio bill impacting clean water regulations",
  "image": "https://npr.brightspotcdn.com/dims4/default/b059a40/2147483647/strip/true/crop/1920x1008+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Flegacy%2Fsites%2Fwcpn2%2Ffiles%2F202107%2Fdewine_budget_hand_up.jpg",
  "link": "https://www.wksu.org/government-politics/2022-04-13/environmentalists-ask-mike-dewine-to-veto-ohio-bill-impacting-clean-water-regulations",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow",
  "authorUrl": "https://www.wksu.org/people/andy-chow",
  "termIds": [
    0
  ],
  "sentences": [
    "Rep. Michael Sheehy (D-Toledo) says the bill can have an impact on keeping the rest of Ohio's waterways clean, \"As these ephemeral streams are often found at the top of the watershed, this measure will undoubtedly affect water quality downstream.\"",
    "Watch: Ohio House debates change to clean water regulations\nEphemeral streams, which are dry beds that only have flowing water after a heavy rainfall, are no longer listed as protected waterways by the U.S. EPA under the federal Clean Water Act.",
    "\"To bring orderly, cost effective, and predictable development and improvement to Ohio's infrastructure, wetlands and streams, housing stock, etcetera,\" said Hillyer, who added that business groups and developers approved of the change.",
    "Mike DeWine (R-Ohio) to veto a bill that eliminates the requirement for state regulators to grant permits to build around ephemeral streams, which advocates say totals about 36,000 miles of waterways in the state.",
    "Ohio Environmental Council says the state needs these protections to make sure projects include mitigation efforts in order to protect waterways from pollution.",
    "Rep. Brett Hillyer (R-Uhrichsville) says this removes red tape for companies that would otherwise need to seek permits for projects.",
    "The Trump administration changed what's known as the the Waters of the United States rule in 2020 to exclude ephemeral streams.",
    "The measure correlates with a rule change to the federal Clean Water Act by the Trump administration.",
    "Now, the Biden administration is reviewing current rules and could reverse course on that action.",
    "The bill, HB175, would remove ephemeral streams as protected waterways by the Ohio EPA.",
    "The Obama administration included ephemeral streams as protected waterways in 2015.",
    "Protection for ephemeral streams has gone back-and-forth in federal code.",
    "A spokesperson for DeWine said the bill remains under review.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "Environmental groups are asking Gov."
  ]
}