{
  "id": 7041,
  "mediaId": 8491,
  "date": "2022-04-15",
  "headline": "Local service calls increase while fire department volunteers decrease",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2021/10/new-western-reserve-joint-fire-district-station-in-poland.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/local-service-calls-increase-while-fire-department-volunteers-decrease/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Abigail Cloutier",
  "authorUrl": "https://www.wkbn.com/author/abigail-cloutier/",
  "termIds": [
    0
  ],
  "sentences": [
    "The national standard is to have 18-20 firefighters at a house fire, but with fewer fighters available, it makes it more difficult to get the required staff on scene.",
    "(WKBN) – On Thursday, Governor Mike DeWine announced a task force to help combat the decline in staff at volunteer fire departments throughout Ohio.",
    "Comstock hopes DeWine’s task force will make recommendations on incentives to help get and keep volunteer firefighters, like tax breaks.",
    "Most of those volunteers got paid $11 an hour to respond to the scene and had to leave other jobs or their families to do so.",
    "He said young people have to work more hours at other part-time jobs to make ends meet, giving them less time to volunteer.",
    "At the same time, we have less younger people to recruit,” said Western Reserve Joint Fire District Chief Chip Comstock.",
    "He said his department is considering hiring part-time staff on a shift rotation to have more firefighters available.",
    "Several volunteers with the Green Township Fire Department responded to a smoky scene Friday afternoon on Knopp Road.",
    "The Western Reserve Joint Fire District is experiencing a steady increase of EMS calls, despite declining staff.",
    "So we had more people to help accomplish putting the fire out,” said Green Township Fire Chief Todd Baird.",
    "So we had to rely on our neighbors to help provide the additional numbers,” Comstock said.",
    "“Today, there’s about eight of us and we had to call Beaver Township for help.",
    "“We do get 18 firefighters on average in Poland but last week I only had 12.",
    "“We have an aging population which makes more demands on us for our calls.",
    "They said a controlled burn reignited, then spread to several hay bales.",
    "They’re already on track to respond to 47 more calls than last year.",
    "Departments here in Mahoning County are no different.",
    "Baird said in 1989, they had 50 firefighters.",
    "“This shouldn’t come as a surprise to anyone.",
    "It was a time-consuming endeavor to put out.",
    "But this is not just in Green Township.",
    "Today, that number is just around 30.",
    "Legislators see it,” DeWine said."
  ]
}