{
  "id": 7203,
  "mediaId": 2919,
  "date": "2022-03-31",
  "headline": "Police officer from Northwest Ohio struck, killed by fleeing vehicle while deploying stop sticks",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/f6781b6/2147483647/strip/true/crop/1532x804+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Ff5%2Ffd%2F6c157ee442a28fb8795b5e8035f0%2Fwews5-1532x864.jpg",
  "link": "https://www.news5cleveland.com/news/local-news/police-officer-from-northwest-ohio-struck-killed-by-fleeing-vehicle-while-deploying-stop-sticks",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Drew Scofield",
  "authorUrl": "https://www.news5cleveland.com/drew-scofield",
  "termIds": [
    0
  ],
  "sentences": [
    "My deepest condolences are with Officer Francis’ loved ones and the residents of Bluffton.”\nDownload the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "Ohio Attorney General Dave Yost paused for a moment of silence ahead of a press conference in Columbus Thursday afternoon and issued the following statement regarding the officer's death:\n\"A hero has died and a community is shaken.",
    "Mike DeWine ordered the U.S. and Ohio flags flown at half-staff at the Statehouse and public buildings in Allen and Hancock counties \"in honor of the life and service of Bluffton Police Officer Dominic Francis.\"",
    "\"Obviously this is a very sad day, not only for the residents of Bluffton, [Francis'] family, but the brotherhood of law enforcement,\" Bluffton Mayor Richard Johnson said.",
    "BLUFFTON, Ohio — An officer from the Bluffton Police Department died in the line of duty Thursday morning when he was struck by a vehicle while deploying stop sticks.",
    "The incident that led to Francis' death started around 2 a.m. when state troopers from the Marion Post saw a dark-colored sedan speeding northbound on State Route 23.",
    "The officer, Dominic Francis, was 42 years old and had been with the department for nine years and in law enforcement overall for 19 years, according to police.",
    "2 suspects are in custody, investigators are searching for a third @WEWS https://t.co/dpb97MVhJ8\n— Catherine Ross (@CatherineRossTV) March 31, 2022\nOhio Gov.",
    "Around 2:30 a.m., Francis was attempting to deploy stop sticks on I-75, near exit 142 to stop the fleeing vehicle when he was fatally struck, police said.",
    "And it’s hard when something like this happens - for everyone.”\nAccording to OSHP, after the crash, three people left the vehicle and took off running.",
    "\"Fran and I are sad to learn of the death of Bluffton Police Officer Dominic Francis, who tragically died today after being hit by a fleeing driver.",
    "\"We'd like to let them know that the Village of Bluffton will do anything to help the family out and we send our condolences to all those involved.\"",
    "We are grateful to him for his selfless service to Ohio, and our hearts go out to his family and his colleagues at the Bluffton PD,\" DeWine said.",
    "At approximately 2:20 a.m., a Findlay Post trooper observed the vehicle, identified as an Infiniti sedan, on State Route 15 in Hancock County.",
    "Around 8:15 a.m., one person in the Prius was taken into custody after a traffic stop at State Route 57 and Chestnut Ridge Road in Elyria.",
    "He had a heart of gold, and he will be missed,\" Bluffton Police Chief Ryan Burkholder said during a press conference Thursday morning.",
    "Not only was he a police officer, he was a school teacher; he was a bus driver; he was a coach for the youth in this community.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "In addition to working in law enforcement, Francis was a coach and school bus driver at Cory-Rawson Local Schools.",
    "Around 3 a.m., a gray 2010 Toyota Prius was stolen from a home on County Road 29 in Hancock County.",
    "Officer Francis, 41, was killed by a fleeing car when he tried to deploy stop sticks this morning.",
    "Another trooper spotted the Prius traveling on I-71 near mile post 208 in Medina County.",
    "The vehicle continued to flee from troopers on State Route 82, topping speeds of 120mph.",
    "Download now on your Apple device here, and your Android device here.",
    "Bluffton is located in Hancock County, about an hour south of Toledo.",
    "The vehicle fled the area on State Route 15 and then south on I-75.",
    "The bravery of the men and women that wear the badge is astounding.",
    "A third person was arrested just before 1 p.m., authorities said.",
    "Officer Francis’ valor will live on and never be forgotten.",
    "“We’re all in this profession for a reason,\" OSHP Sgt.",
    "One of the three people was arrested nearby.",
    "Learn more about our streaming options here.",
    "\"You want to go out and make a difference.",
    "Troopers were unable to stop the vehicle.",
    "He is an outstanding police officer.",
    "We're also on Amazon Alexa devices.",
    "The chase ended in Lorain County.",
    "The community lost a hero.",
    "\"Today is a sad day.",
    "Brice Nihiser said.",
    "His heart was big."
  ]
}