{
  "id": 7423,
  "mediaId": 6428,
  "date": "2022-04-04",
  "headline": "'Silicon Heartland': New Intel Project Could Start to Reverse US Dependence on Foreign Chips",
  "image": "https://www1.cbn.com/sites/default/files/media/slider/images/intelohio_hdv.jpg",
  "link": "https://www1.cbn.com/cbnnews/us/2022/april/silicon-heartland-new-intel-project-could-start-to-reverse-us-dependence-on-foreign-chips",
  "mediaOutlet": "CBN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather Sells",
  "authorUrl": "https://www1.cbn.com/profiles/sells-heather",
  "termIds": [
    2143,
    2590,
    646,
    6474,
    6310
  ],
  "sentences": [
    "She's already using the catchphrase \"Silicon heartland,\" and has begun to zero in on the new businesses that Intel will bring, along with new families and a new culture where high-tech jobs can be found at home.",
    "A 2019 Brookings Institution report found that from 2005 to 2017, five urban areas dominated the nation's innovation sector employment growth: Seattle, Boston, San Francisco, San Diego, and San Jose.",
    "LICKING COUNTY, Ohio – On a 1,000-acre parcel of rural land near Columbus lies the beginning of a technology investment that could begin to reverse America's semi-conductor chip shortage.",
    "It will begin construction on two chip factories in late 2022 with the promise of 3,000 Intel jobs, 7,000 construction jobs, and tens of thousands of extra long-term jobs in the region.",
    "\"Our students that are coming out of school, our families that are looking for the next career opportunities--they don't have to look farther afield than right up the street,\" she said.",
    "\"That's thousands of lives changed, family's lives changed, generational change in wealth and homeownership and education that can happen not only here in our region but across Ohio.\"",
    "It's also expected to create an enormous opportunity for tech workers in the Midwest, potentially turning the region into what advocates are calling a \"Silicon Heartland.\"",
    "Mike DeWine calls the project a \"great victory\" and recently told CBN News it demonstrates that the heartland is capable of attracting top tech investment and talent.",
    "\"It's at a minimum a very encouraging signal that we actually can and should invest in new places and bring our most critical industries into the heartland,\" he said.",
    "The \"new game\" includes building the chip factories, sourcing and training the workforce, and creating communities around them that maintain a high quality of life.",
    "\"As a result, fully one-third of the nation's innovation jobs now reside in just 16 counties and more than half are concentrated in 41 counties,\" it said.",
    "***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.",
    "A Brookings analysis shows the U.S. share of worldwide semiconductor manufacturing has steadily declined from 37 percent in 1990 to 12 percent in 2020.",
    "The Intel project is also expected to bring critical momentum to America's fragile semiconductor industry, which has moved overseas in large part.",
    "\"Much of America is left on the sidelines, watching the technology and innovation activities of the country go on somewhere else,\" he said.",
    "Kenny McDonald, president of the Columbus Partnership, helped lead the economic development team that worked to bring Intel to the region.",
    "\"It really sends a signal that Ohio and the Midwest is certainly in the game in regards to manufacturing anything,\" he said.",
    "The Intel investment is a bold departure from a growing concentration of tech companies in major coastal cities.",
    "\"Having overly long, remote, globalized supply chains is a real source of vulnerability for the United States.\"",
    "Many economic and political analysts believe that's eroded U.S. manufacturing innovation and national security.",
    "\"They're cut off in some ways from some of the most vibrant sources of jobs and social and economic mobility.\"",
    "Laura Tussing is a regional president at Park National Bank in Newark, Ohio, right near the Intel site.",
    "For now, McDonald and his economic development team are focused on paving the way for Intel to move in.",
    "People are going to be able to make career progressions and expand their businesses within our state.",
    "Mark Muro, one of the report's authors, told CBN News there's concern about the regional imbalance.",
    "\"As somebody who's been an economic developer for over 25 years, this really is the Super Bowl.",
    "\"We have a lot of work ahead of us, and we're just pumped up to do it,\" said McDonald.",
    "The semiconductor giant Intel announced the $20 billion investment earlier this year.",
    "At its full build-out, it could be over $100 billion of investment,\" he said.",
    "\"So we've got another field to run now and we're on the one-yard line.\"",
    "\"It's simply good to manufacture important things at home,\" said Muro.",
    "The Intel investment, he said, begins to change that trajectory.",
    "The report detailed the economic disparity among regions.",
    "\"We're going to have those opportunities here.",
    "They don't have to go somewhere else now.\"",
    "\"It's a totally new game,\" said McDonald.",
    "Gov.",
    "***"
  ]
}