{
  "id": 750,
  "mediaId": 8492,
  "date": "2022-02-26",
  "headline": "Governor Announces Partnership to Promote Road Safety for Teen Drivers",
  "image": "https://i.iheart.com/v3/re/new_assets/621a135bb59f165a36f813bf?ops=gravity(%22north%22),fit(740,416),quality(65)",
  "link": "https://wkkj.iheart.com/content/2022-02-26-governor-announces-partnership-to-promote-road-safety-for-teen-drivers/",
  "mediaOutlet": "wkkj.iheart.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Giving our young people more opportunities to practice making good driving decisions will prevent crashes and save lives.”\nOTSO houses the Teach Your Teen to Drive (TYTTD) website, which includes links to short videos for teens to learn how to safely enter and exit a highway, change lanes, and manage intersections.",
    "Additionally, by executive order in 2020, Governor DeWine created the Ohio Traffic Safety Council of federal, state, and local partners to focus on ways to make Ohio’s roadways safer by using proven education, engineering, enforcement, emergency response, and public policy countermeasures.",
    "Other links feature a guide with tips and tricks to prepare for behind-the-wheel practice, Ohio driving laws and requirements, and a tool to help families track their progress and record which driving environment their teens need more practice with.",
    "(Columbus) -- Ohio Governor Mike DeWine announced a partnership Friday between the Ohio Traffic Safety Office (OTSO) and the Ohio High School Athletic Association (OHSAA) to raise awareness about the resources available to help teens drive safely.",
    "The OTSO/OHSAA partnership builds on Governor DeWine’s initiative by raising awareness during the boys and girls district, regional, and state basketball tournament games and sectional, district, and state wrestling tournaments.",
    "In 2019, he launched a statewide virtual driver assessment program, Ready, Test, Drive!, to better equip Ohio’s new drivers with critical skills to safely navigate the roads.",
    "If we put teens in controlled driving situations before they face them in real time, they will be better prepared to navigate the road safely,” said Governor DeWine.",
    "TYTTD messages will be included in programs, on parking passes and tickets, during public address announcements, and on signs and banners during the sporting events.",
    "As teens are learning to drive, this safety program will help save lives.”\nCrashes are the leading cause of death among young drivers (ages 15-20) nationally.",
    "“We are proud to partner with the Governor and the Ohio Traffic Safety Office on this important safety initiative,” said OHSAA Executive Director Doug Ute.",
    "The goal of this campaign is to create an open conversation between teens, parents, and other family members on the importance of road safety.",
    "This age group is more likely to be involved in fatal and serious crashes because they lack driving experience and tend to take greater risks.",
    "In Ohio, young drivers ages 15 to 25 represent almost 30% of deaths and 35% of serious injuries each year.",
    "“We are committed to get this message in front of as many teens and their families as possible.",
    "Governor DeWine has placed a priority on safe driving during his administration.",
    "“Inexperience behind the wheel is a major factor in crashes for new drivers.",
    "“We want everyone on the road to make it home safely."
  ]
}