{
  "id": 788,
  "mediaId": 2919,
  "date": "2022-02-20",
  "headline": "Concern grows for local Ukrainian-Americans as Russian-Ukraine tensions mount",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/9e58756/2147483647/strip/true/crop/1018x534+0+32/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fab%2Fd3%2F08648c2b4c838d6a0a627b827a89%2Fscreen-shot-2022-02-20-at-8.58.07%20PM.png",
  "link": "https://www.news5cleveland.com/news/local-news/concern-grows-for-local-ukrainian-americans-as-russian-ukraine-tensions-mount",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clay LePard",
  "authorUrl": "https://www.news5cleveland.com/clay-lepard",
  "termIds": [
    0
  ],
  "sentences": [
    "We have to make sure [Russia] understands they’re going to pay a very significant penalty if they do this.”\nMore than 30 years after Ukraine gained independence from the Soviet Union, members of this Northeast Ohio community say they’ll continue to support Ukraine in any way they can.",
    "PARMA, Ohio — Dozens gathered outside the Ukrainian Catholic Cathedral in Parma Sunday, showing their support for their families overseas as Ukraine’s future remains in doubt.",
    "Jaskiw points out the crowd outside was initially here to commemorate the hundred people who died during the 2014 Revolution of Dignity in Ukraine's capital city of Kyiv.",
    "“This was our way of commemorating, letting the world know, thanking people who support us, and being resolute to stop this aggression,” Jaskiw added.",
    "It comes as U.S. officials told ABC News that lower-level Russian tactical commanders have been given orders consistent with orders to invade Ukraine.",
    "However, they found themselves also standing for solidarity, reflecting on the past, and wondering about the future of their families overseas.",
    "“Ukraine has a 2,000-year history and we want it to continue in a positive way.”\nCopyright 2022 Scripps Media, Inc. All rights reserved.",
    "News 5 asked Governor Mike DeWine about Russia's intent to invade Ukraine on Saturday during NBA All-Star weekend festivities.",
    "“This is really ominous, threatening and yet we’ve seen this before,” Andy Fednysky with the Ukrainian Museum-Archives said.",
    "Even at almost 5,000 miles away, experts told News 5 Northeast Ohio is home to anywhere from 30,000-40,000 Ukrainians.",
    "This news is consistent with statements previously made by President Biden and Defense Secretary Lloyd Austin.",
    "“Today Ukraine is fighting for a democratic Europe,” Bishop Bohdan Danylo said to parishioners Sunday.",
    "“What’s at stake is our ability to pursue life, liberty and happiness on a world-based system.",
    "George Jaskiw serves as vice president of the United Ukrainian Organizations of Ohio.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "“We’re at an inflection point,” he said.",
    "“This is just a tragedy,” DeWine said."
  ]
}