{
  "id": 792,
  "mediaId": 8379,
  "date": "2022-02-22",
  "headline": "What happens in Ohio if Roe v. Wade is overturned?",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2021/12/roe-v.-wade.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/state-news/what-happens-in-ohio-if-roe-v-wade-is-overturned/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maeve Walsh",
  "authorUrl": "https://www.nbc4i.com/author/maeve-walsh/",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s unclear what the future of abortion looks like, but the Ohio Right to Life is hopeful – and Planned Parenthood of Greater Ohio is fearful – that cases before the Supreme Court will spur its conservative majority to reverse the 1973 decision that found a constitutional right to abortion in the U.S.\nWith “hundreds of laws” enacted across the country restricting abortion access, Iris Harvey, president and CEO of Planned Parenthood of Greater Ohio, said it’s only a matter of time before the nation’s highest court reverses precedent.",
    "“It is an incredible imposition on people.”\nAlthough Baum said the constitutionality of the Human Life Protection Act, if enacted, could be challenged before the Ohio Supreme Court, Parker said it’s unlikely the Republican-majority court would strike the bill down – especially with permission from the U.S. Supreme Court for states to allow a total ban.",
    "“We’re not saying it’s easy, but we’re here to do the right thing.”\nWhile Harvey said the prohibition of abortion is quickly approaching in Ohio – a state she called “ground zero for the deterioration of abortion access” – she said Planned Parenthood will continue to provide healthcare to its patients.",
    "According to Larry Baum, professor emeritus in political science at Ohio State University, it is “exceedingly likely” that the court’s 6-3 conservative majority will use the lawsuit to induce some kind of modification to existing abortion law.",
    "Parker, who testified in support of the bill before the Senate Health Committee in October, said the trigger ban would allow exceptions in cases where an abortion is deemed necessary by a physician to save the life of a mother.",
    "If the Supreme Court does use Dobbs or other future cases to overhaul Roe v. Wade, Baum said the power will lie in the hands of the Ohio General Assembly to determine whether access to abortion survives in the state.",
    "COLUMBUS, Ohio (WCMH) – As laws restricting abortion pop up in state legislatures across the country, abortion rights and anti-abortion groups in Ohio await to see if the U.S. Supreme Court will overturn Roe v. Wade.",
    "“I don’t think there will be problems with it not passing.”\nFor abortion-rights advocates like Harvey, the Human Life Protection Act represents an “inhumane restriction” on the bodily autonomy of pregnant people.",
    "Women of color and those living in rural areas – who historically have lacked access to healthcare – would disproportionately bear the brunt of an Ohio prohibition of abortion, Harvey said.",
    "In December, the Supreme Court heard oral argument in Dobbs v. Jackson Women’s Health – a case challenging the constitutionality of a Mississippi law banning abortions after 15 weeks.",
    "“If you’re raped, right, if it’s incest, and you have no access to abortion care, that’s a very uncomfortable and difficult pregnancy to welcome and to bear,” Harvey said.",
    "“We will navigate the system with our patients to be side-by-side with them to ensure that they are safe, that they are respected, and that they are cared for,” she said.",
    "“It’s known as a trigger ban because it will be triggered by the ruling of the Supreme Court,” Mary Parker, director of legislative affairs at Ohio Right to Life, said.",
    "The Human Life Protection Act would make people have to travel to someplace abortion is legal or rely on unsafe, non-medical people to perform a procedure.",
    "“We’re going to work to make abortion both illegal and unthinkable because, at the end of the day, there are better alternatives,” Parker said.",
    "Two Republican lawmakers introduced the Human Life Protection Act in March 2021, which – if passed by the General Assembly and enacted by Gov.",
    "Mike DeWine – would immediately prohibit abortion in Ohio amid a Supreme Court decision overturning Roe v. Wade, according to the bill’s text.",
    "“One of the things I love about working in Ohio is that we have pro-life officials in both assemblies,” Parker said.",
    "“It’s not if Roe v. Wade is overturned; it is when Roe v. Wade is overturned,” Harvey said.",
    "Anyone who causes or induces an abortion could be found guilty of a fourth-degree felony.",
    "What’s known as a “trigger ban” has already been introduced in the Ohio Senate.",
    "Since 2010, 12 abortion clinics have closed in Ohio, according to Harvey.",
    "No exceptions would be made for pregnancies caused by rape or incest.",
    "“What none of us knows is how substantial that will be,” Baum said.",
    "“Imagine that you have a job and family responsibilities.",
    "Bear the cost of lodging and travel?” she said.",
    "And now you have to travel hundreds of miles?",
    "Stay overnight, perhaps?"
  ]
}