{
  "id": 808,
  "mediaId": 8360,
  "date": "2022-02-19",
  "headline": "Ohio Supreme Court to redistricting commission: Why shouldn’t we hold you in contempt?",
  "image": "https://i0.wp.com/www.lovelandmagazine.com/wp-content/uploads/2022/02/IMG_2312-2048x1536-2.jpg?fit=2048%2C1536&ssl=1",
  "link": "https://www.lovelandmagazine.com/ohio-supreme-court-to-redistricting-commission-why-shouldnt-we-hold-you-in-contempt/",
  "mediaOutlet": "lovelandmagazine.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Mike DeWine, Secretary of State Frank LaRose, Auditor Keith Faber, Senate President Matt Huffman, House Speaker (and commission co-chair) Bob Cupp, state Sen. (and commission co-chair) Vernon Sykes and House Minority Leader Allison Russo, to explain the “failure to comply with this court’s February 7, 2022 order,” and why they shouldn’t face anything from fines to jail time, the consequences for contempt of court.",
    "The court had been asked by the League of Women Voters, the Ohio Organizing Collaborative and a group of Ohio residents – the parties in the three lawsuits originally filed to challenge maps approved by the ORC – to order the commission to give specific reasons for their choice to adjourn without maps on Feb. 17.",
    "The GOP commission members said during the meeting that they could not find a way to draw maps that complied with all the redistricting provisions of the constitution, while also complying with the rules the supreme court had given in their majority opinion invalidating the previous maps.",
    "(Photo: Susan Tebben, OCJ)\nBY: SUSAN TEBBEN – Ohio Capital Journal\nThe Ohio Supreme Court weighed in on the redistricting battle on Friday evening, asking the members of the Ohio Redistricting Commission why it shouldn’t hold them in contempt of court for defying its order.",
    "The groups also asked for justification for the commission’s lack of action on any sort of map, despite being presented with a map by the Democratic House and Senate caucuses, which they shot down along party lines on the day of the deadline.",
    "“I don’t think that is an option that the law gives us.”\nCo-chair Sykes agreed that contempt was a possibility for the commission members, and said he was willing to do whatever could be done to move forward.",
    "Asked after the commission adjourned if that included contempt of court: “Including whatever we can do.”\nThe choice to adjourn didn’t require a majority vote, but was met with no formal objections.",
    "Susan Tebben is an award-winning journalist with a decade of experience covering Ohio news, including courts and crime, Appalachian social issues, government, education, diversity and culture.",
    "Huffman accused drawers of the Dem map of racial gerrymandering to the benefit of Democrats in certain districts, including the district that holds Lake County, typically a strongly GOP area.",
    "That lawsuit asks the district court to take over the process, and accuses the redistricting commission of preventing them from advocating for candidates, running for office, and even voting.",
    "Mainly, the GOP said they couldn’t hit the target of 54-46 partisan breakdown asked for by the court justices, a number based on statewide voter preferences over the last 10 years.",
    "The order came the same day a federal lawsuit was filed by Ohio residents, some of whom are also anti-abortion advocates in the statewide lobby group Ohio Right to Life.",
    "The supreme court ordered the ORC to come up with “entirely new” maps after invalidating not one but two different sets of legislative district maps.",
    "Their deadline to file with the Secretary of State’s Office was Feb. 17, with those maps then being sent to the court for review by the next day.",
    "Chief Justice Maureen O’Connor signed an entry in all three of the lawsuits against the ORC on legislative redistricting, asking Gov.",
    "Attorney Phillip Strach speaks before the Ohio Supreme Court, arguing for the constitutionality of legislative district maps.",
    "But some of the commission members, of both parties, disagreed with the decision to leave before approving a map.",
    "She has worked for The Newark Advocate, The Glasgow Daily Times, The Athens Messenger, and WOUB Public Media.",
    "The ORC members now have until noon on Feb. 23 to tell the court why they shouldn’t be held in contempt.",
    "“I think it is a mistake for this commission to stop and basically say that we’re at an impasse,” Gov.",
    "The court heard arguments on three cases asking it to reject the maps approved in September.",
    "She has also had work featured on National Public Radio.",
    "Russo wholly denied the accusations.",
    "Mike DeWine said on Thursday.",
    "MORE FROM AUTHOR"
  ]
}