{
  "id": 8174,
  "mediaId": 8480,
  "date": "2022-04-08",
  "headline": "Ohio collecting personal protective gear for Ukraine civilians",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/04/AP22044533180759-1-1-1.jpg?w=1280",
  "link": "https://www.wdtn.com/news/ohio/ohio-collecting-personal-protective-gear-for-ukraine-civilians/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Clark",
  "authorUrl": "https://www.nbc4i.com/author/joe-clark/",
  "termIds": [
    0
  ],
  "sentences": [
    "If any other law enforcement agencies have unneeded protective gear, there is still time to take part in this important statewide donation effort.”\nSo far, the state has collected approximately 75 ballistic and riot helmets and 840 pieces of body armor, including vests and plates that will be delivered to Fund to Aid Ukraine, a non-profit organization based in Parma that is affiliated with the United Ukrainian Organizations of Ohio, a member of the Ukrainian Congress Committee of America.",
    "“As Russia continues its unprovoked attack on Ukraine, citizens are stepping up to defend their country with little more protection than the clothes on their backs, and I am grateful to the Ohio law enforcement agencies that didn’t hesitate to offer their unneeded gear,” stated DeWine in a release, Friday.",
    "In March, DeWine asked local and state law enforcement agencies to provide information on the amount of surplus or expired, but still functional, personal protective gear, that could be donated to Ukraine civilian territorial defense.",
    "Any law enforcement agencies that did not respond to DeWine’s initial inventory request, but would like to donate unneeded personal protective gear, can contact their nearest OSHP post for more information.",
    "COLUMBUS, Ohio (WCMH) — Governor Mike DeWine has announced that the Ohio Department of Public Safety is collecting law enforcement personal protective gear that it will send to Ukraine.",
    "“This is Ohio’s opportunity to provide civilian humanitarian aid to help the innocent Ukrainians who are voluntarily putting their lives at risk on the front lines."
  ]
}