{
  "id": 8337,
  "mediaId": 8373,
  "date": "2022-04-07",
  "headline": "In State of the State speech, DeWine offers optimistic vision for Ohio",
  "image": "https://jnswire.s3.amazonaws.com/jns-media/b7/ec/57482/Dewine.jpg",
  "link": "https://mountvernonnews.com/stories/622489312-in-state-of-the-state-speech-dewine-offers-optimistic-vision-for-ohio",
  "mediaOutlet": "mountvernonnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Beasley",
  "authorUrl": "https://mountvernonnews.com/author/david-beasley",
  "termIds": [
    2143,
    420,
    970,
    6077,
    6474
  ],
  "sentences": [
    "\"If we can remove this small group of dangerous offenders from our streets, the violent crime in our distressed neighborhoods will be reduced dramatically, and the citizens and families who live there will be safer and lives will be saved.”\nEven libraries were mentioned in the governor's speech.",
    "“One of the most important things we can do that will benefit – not only the 32 counties in the Appalachian region, but also our entire state – is to make a long-overdue, comprehensive investment in Appalachia,” the governor said.",
    "He cited the Ohio Governor’s Imagination Library, which provides local communities with half of the funds they need to operate the program in their counties.",
    "He addressed issues ranging from mental illness to state parks, from education to support for law enforcement, according to a March 23 news release.",
    "“I see an Ohio that harnesses the innovative potential of our research colleges and universities to conduct strategic, cutting-edge research.",
    "“We need to get tough on the convicted violent offenders who carry and use weapons in violation of the law,\" he said.",
    "An Ohio with fewer emergency room visits and where fewer Ohioans with mental illnesses are living on the streets.",
    "Enrollment in the Imagination Library improves kindergarten readiness and family literacy habits.",
    "“We know that a child’s brain is 80 percent developed by the time they turn 3 years of age.",
    "COLUMBUS – In his 2022 State of the State speech to Ohio General Assembly, Ohio Gov.",
    "DeWine pledged to crack down on crime and to increase funding for police.",
    "He cited the Appalachian region of Ohio in particular as a priority.",
    "“Now is the time to ‘seize our Ohio moment,’” the governor said.",
    "And no matter where you live in Ohio, your child is eligible.”",
    "So, these first years of development are so very important.",
    "Mike DeWine presented an upbeat outlook for the state.",
    "lessening pressure on the criminal justice system.\"",
    "An Ohio where mental illness isn’t criminalized."
  ]
}