{
  "id": 839,
  "mediaId": 8365,
  "date": "2022-02-21",
  "headline": "Briefs: Local fire departments awarded grants for training",
  "image": "https://www.gannett-cdn.com/-mm-/1f5cf201681a65be6127472788853de159a5467f/c=0-729-3333-2604/local/-/media/2017/03/06/Marion/B9326557529Z.1_20170306154121_000_GGHHL1P1V.1-0.png?width=3200&height=1801&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.marionstar.com/story/news/2022/02/21/briefs-green-camp-scioto-valley-fire-departments-awarded-grants/6877945001/",
  "mediaOutlet": "marionstar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marion Star",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Marion County fire departments receive training reimbursement grants\nCOLUMBUS — The Ohio Department of Commerce’s Division of State Fire Marshal announced the recipients of the 2022 Training Reimbursement Grants, which includes 208 fire departments in 70 counties throughout the state totaling $456,743.70.",
    "Contributions will support various statewide programming including student award programs, the recruitment and retention of current and future agricultural educators, Ohio FFA Camp, the Ohio FFA officer team and general activities and initiatives.",
    "While all firefighters, career or volunteer, are required to have the same level of basic training for state certification, this grant helps fire departments go beyond the basics to complete more advanced, nationally recognized training.",
    "The fire departments were selected based on a variety of criteria, including the fire department’s annual budget, annual number of fire incidents and the resident population served by the fire department.",
    "State fair dates announced\nCOLUMBUS — Ohio Governor Mike DeWine and Ohio Expo Center & State Fair General Manager Virgil Strickler have announced the 2022 Ohio State Fair will run from July 27 to Aug. 7.",
    "Ohio to celebrate Give FFA Day Thursday\nCOLUMBUS — Members of Ohio’s agricultural community are encouraged to show their support for FFA and agricultural education on Thursday during Give FFA Day.",
    "The first big-name acts in this year’s Ohio State Fair Concert & Event Series will be announced on March 7, with additional announcements to follow on March 21 and April 4.",
    "The first 50 donors to join the Ohio FFA Foundation’s monthly giving program Thursday will receive a “Proud to Support the Future of Agriculture” coffee mug.",
    "Individuals can give online at ohioffa.org/give-ffa-day or contributions can be mailed to the Ohio FFA Foundation, 717 A East 17th Ave., Columbus, OH 43211.",
    "In addition, Sunrise Cooperative, an agricultural and energy cooperative in Ohio, will match gifts, up to $25,000, to the Ohio FFA Foundation.",
    "Among them are the Green Camp Township Fire Department, which was awarded $300 and the Scioto Valley Fire District, which will receive $1,400.",
    "Monthly gifts can be as low as $5 with a transaction processing fee automatically applied each month.",
    "Attendees will hear from key Ohio FFA stakeholders via Zoom about how they can support FFA members.",
    "At 9:30 a.m. Thursday, all are invited to join the second virtual Give FFA Day Coffee Kickoff.",
    "The State Fire Marshal Training Reimbursement Grant application period opens every December.",
    "During the 2019 Ohio State Fair, 934,925 people attended during the event’s 12-day run.",
    "Donors can designate their gift to which of these areas that matter to them most.",
    "For more information, visit the grants application page.",
    "Registration is available at ohioffa.org/give-ffa-day."
  ]
}