{
  "id": 8424,
  "mediaId": 8497,
  "date": "2022-04-08",
  "headline": "Ohio to donate protective gear to people in Ukraine",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/dewinee-1605787343.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ukraine-ohio-protective-gear-ballistic-riot-helmets/39674243",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    2143,
    1408,
    964,
    6077,
    6672,
    6569,
    6502,
    6474
  ],
  "sentences": [
    "\"As Russia continues its unprovoked attack on Ukraine, citizens are stepping up to defend their country with little more protection than the clothes on their backs, and I am grateful to the Ohio law enforcement agencies that didn't hesitate to offer their unneeded gear,\" DeWine said in a statement.",
    "The donations will be delivered through the Fund to Aid Ukraine, a non-profit organization based in Parma that is affiliated with the United Ukrainian Organizations of Ohio, a member of the Ukrainian Congress Committee of America.",
    "“We express our gratitude to Governor DeWine, the Ohio Department of Public Safety, and the law enforcement community,\" Marta Liscynesky Kelleher, President of United Ukrainian Organizations of Ohio said in a statement.",
    "“This quick response is meaningful and essential to the people of Ukraine fighting each day to defend their country, their freedom, and democratic principles against the brutal and unprovoked invasion by Russia.",
    "\"This is Ohio's opportunity to provide civilian humanitarian aid to help the innocent Ukrainians who are voluntarily putting their lives at risk on the front lines.",
    "More than two dozen agencies responded offering offering around 75 ballistic and riot helmets and 840 pieces of body armor, including vests and plates.",
    "If any other law enforcement agencies have unneeded protective gear, there is still time to take part in this important statewide donation effort.\"",
    "DeWine said he has requested inventory from local and states law enforcement on expired, but still functional, gear that can be donated.",
    "We appreciate Governor DeWine’s leadership in this effort, which can serve as a model for other states to take on similar initiatives.”",
    "Mike DeWine said the state is collecting protective gear to donate to Ukraine.",
    "COLUMBUS, Ohio —\nOhio Gov."
  ]
}