{
  "id": 862,
  "mediaId": 8373,
  "date": "2022-02-21",
  "headline": "Ohio House passes bill that targets protesters, riots",
  "image": "https://jnswire.s3.amazonaws.com/jns-media/70/c6/11689560/adobestock_269927165.jpeg",
  "link": "https://mountvernonnews.com/stories/620884852-ohio-house-passes-bill-that-targets-protesters-riots",
  "mediaOutlet": "mountvernonnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "J.D. Davidson",
  "authorUrl": "https://mountvernonnews.com/author/j-d-davidson",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’m not saying there aren’t a few bad apples across the nation, but there are bad apples in anything you do.”\nRep. David Leland, D-Columbus, said the bill would discourage people from becoming involved with lawful protests and civil demonstrations.",
    "“At its core, HB 109 is un-American because it upsets the fragile balance between law and order and liberty and justice, and by doing so, it puts at risk a basic fundamental freedom: the freedom of speech.",
    "The bill, originally introduced in November 2020, was in response to protests that summer in Columbus and throughout the country in the wake of the murder of George Floyd by a Minneapolis police officer.",
    "The group’s chief lobbyist also tweeted the proposed law is dangerous and criticized lawmakers for working on the bill rather than spending time on congressional and state legislative districts.",
    "| Adobe Stock\n(THE CENTER SQUARE) – Allowing law enforcement officers to sue for injuries or false claims suffered during riots became closer to becoming law in Ohio.",
    "The Ohio House bill came in response to protests two years ago in Columbus and elsewhere after the murder of George Floyd by a Minneapolis police officer.",
    "House Bill 109, which heads to the Senate, also would increase penalties for rioting and create new laws for riot assault and riot vandalism.",
    "The American Civil Liberties Union of Ohio said in a tweet the bill is meant to intimidate people who exercise their First Amendment rights.",
    "This dangerous, undemocratic bill would have imprisoned MLK, seized his assets [and] shut down his church [and] groups he worked with.",
    "At the time, Rep. Cindy Abrams, R-Harrison, called the disrespect of law enforcement a substantial issue across the state.",
    "This is what they champion instead of passing fair maps,” Gary Daniels, chief lobbyist with ACLU of Ohio, tweeted.",
    "Democrats and other groups called the bill passed by the Ohio House an attack on free speech, however.",
    "“The disrespect right now, it is devastating to the uniformed police officers,” Abrams said in 2020.",
    "“Less than one month after quoting MLK all over social media, the Ohio House today passed HB 109.",
    "He called the bill’s language vague and said it would put charity groups at risk for prosecution.",
    "More than 100 businesses were vandalized, along with numerous government buildings.",
    "In Columbus, protests centered around the downtown area, mostly at Capitol Square.",
    "It also would punish those who provide help to those who carry out a riot.",
    "Mike DeWine called in the Ohio National Guard to maintain order.",
    "The city of Columbus enacted a curfew, and Gov.",
    "A freedom that defines America,” Leland said."
  ]
}