{
  "id": 896,
  "mediaId": 8313,
  "date": "2022-02-16",
  "headline": "'Our future is bright': Fans honor Bengals with rally at Washington Park Wednesday",
  "image": "https://www.gannett-cdn.com/presto/2022/02/17/PCIN/98575947-d44d-4edb-9c1c-feb95d8cc4f5-021622_BENGALS_SG_0018.jpg?crop=5183,2916,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/02/16/bengals-fans-honor-historic-season-rally-washington-park/6821918001/",
  "mediaOutlet": "enquirer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brook Endale",
  "authorUrl": "https://www.cincinnati.com/staff/2684199001/brook-endale/",
  "termIds": [
    0
  ],
  "sentences": [
    "Cincinnati Bengals:'The Bengals Growl' is the Bengals fight song, and its been so since the NFL came to Cincinnati\n\"This team made a whole new generation of Bengals fans.",
    "Mayor Aftab Pureval hosted the rally and introduced guests, including the fan of the year, Bengal Jim, the Ben-Gals and Bootsy Collins.",
    "Lifelong Bengals fan, Caroline Pennington, was one of many dressed in orange and black from head to toe at the rally.",
    "Speaking about the team's performance, Brown said, \"they made us proud,\" as fans shouted back, \"yes, they did.\"",
    "Signs saying \"thank you\" and \"you won all of our hearts\" were waved around while the crowd chanted \"Who Dey!\"",
    "Mike DeWine also spoke at the rally to let the Bengals know how proud they've made everyone in the state.",
    "\"This has been one of the best years of my life and that's a thanks to you all, the fans,\" Taylor said.",
    "\"The one thing we took away from last weekend is we've got to find a way to get back and win it all.\"",
    "Then Bengals owner Mike Brown took the stage to thank fans for the support they showed the team.",
    "As head coach Zac Taylor took the stage to speak, the crowd began to chant, \"thank you, coach.\"",
    "Bengals fans packed Washington Park Wednesday night to honor the team's historic season.",
    "The mayor noted that these were the first keys he has handed out since he took office.",
    "Taylor thanked the fans for being at every game and showing their love for the team.",
    "The event concluded with Pureval presenting Taylor and Brown with keys to the city.",
    "To come out on a Wednesday night, last minute, just so say we appreciate the team.",
    "This team will keep going year after year,\" Brown said.",
    "It says Cincinnati has some of the most loyal fans.",
    "I got here at 4:30 and it was already packed.",
    "It's pretty cool,\" Pennington said.",
    "I think the turnout is great.",
    "\"Fans, we got it next year.",
    "Our future is bright.\"",
    "\"It's pretty crazy.",
    "Ohio Gov."
  ]
}