{
  "id": 8969,
  "mediaId": 2537,
  "date": "2022-03-29",
  "headline": "Letters: Permanent daylight savings time was a disaster before, will be again",
  "image": "https://www.gannett-cdn.com/presto/2021/09/11/PFTM/7ecc20db-824f-40e1-91f1-dbfd0e26ea99-FNP_091021_ai_billboard_002.jpg?crop=5136,2889,x0,y103&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/03/29/letters-permanent-daylight-savings-time-disaster-before-again/7126921001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2765,
    2576,
    3662,
    4591,
    4145,
    5699,
    1489,
    6474
  ],
  "sentences": [
    "While some of these conflicts did not involve the same scales of population or military forces – the number of Ukrainian refugees alone is alarming – nonetheless these prior conflicts must not to be erased from our historical consciousness lest we fall into a kind of European exceptionalism that believes the continent has somehow achieved a permanent and enduring, rather than fragile and limited peace.",
    "The calls for peace in Chicago, around the nation, and around the world – the world’s second superpower The New York Times called us – went unheeded, and the United States government proceeded with its invasion of Iraq, an invasion and war premised on the lie that Iraq was harboring weapons of mass destruction.",
    "Hopefully, unlike the U.S. senators, they will spend a little time researching this before blithely instituting something that has serious ramifications for sleep and safety, does not in fact save on electricity usage and which was wildly unpopular when it was tried before.",
    "We must stand in solidarity with the Ukrainians who are desperately defending their country from Vladimir Putin’s aggression, and we must stand in solidarity with those Russians who are now resisting, protesting and going to jail over their nation’s invasion of Ukraine.",
    "Steve Sylvester, Montgomery\nFree flow of ideas is a bedrock of our society\nIt seems to me that Ohio House Bill 327, which would \"prohibit teaching, advocating or promoting divisive concepts,\" would make us a lot more like Vladimir Putin’s Russia than the Buckeye State.",
    "The American and international media are rightfully providing detailed coverage of the events in Russia and Ukraine, including the crackdown on protests, speech and access to information in Russia, as well as the admirable resistance of the Ukrainian people.",
    "Patty Eber, East Walnut Hills\nLeave religion questions out of confirmation hearing\nI just heard Senator Lindsey Graham ask Supreme Court nominee Judge Ketanji Brown Jackson \"how often does she go to church\" in the March 22 Senate confirmation hearing.",
    "Now, if you are an Ohio CCW licensee, the background check for that license will exempt you from any additional background checks because it is a very thorough review of your history and shows that you do not have any skeletons in your legal closet.",
    "I wish politicians would quit referencing religion and remember that the establishment clause of the First Amendment prohibits the establishment of religion by Congress, which is often interpreted as the separation of church and state.",
    "At the very least, it can teach us to be more humble in our judgments and in our view that Europe has enjoyed constant peace since 1945, and this is leaving aside conflicts such as those in Northern Ireland or the Greek Civil War.",
    "My family has participated in every war against tyrants of evil going back to World War I.\nI lived in Cleveland and New York years ago, and I learned – street smarts – unanswered threats and crime bring more threats and crime.",
    "Instead, they have voted for a proposal that will keep Ohio in darkness until about 9 a.m. for several months a year, thereby, sending children to their bus stops and most people to work in in bitterly cold (no sun!",
    "It seems to me that the Senate might have had a few other things to be concerned with like the Ukrainian catastrophe, inflation, gas prices, stalled COVID funding, a Supreme Court justice nominee, to mention a few.",
    "Ted Day, Montgomery\nNew gun law not passed to satisfy NRA\nI read, with a sense of amazement, a letter written by Day Lemming of Hyde Park that was titled \"Training teaches how to handle a gun properly\" (March 21).",
    "Hank Meiners, Milford\nWar in Ukraine demands outrage, reflection and calls for peace\nNearly 19 years ago, a few friends and I sat down and locked arms outside the Kluczynski Federal Building in downtown Chicago.",
    "This was done with no discussion, no input from sleep and/or safety experts and total disregard for the fact that when this was tried in 1974 it was such a disaster that it was rescinded in less than two years.",
    "Mark Sherman, Oakley\nAmerica must use force to stop genocide in Ukraine\nI am distraught by the failure of the U.S. administration to stop the genocide and the complete destruction of Ukraine – a free country.",
    "The Senate prided themselves on this being being a bipartisan vote, and indeed it was sponsored by a bipartisan committee – Patty Murray (D -Washington) and Marco Rubio (R -Florida) – and passed unanimously.",
    "The march ended with hundreds being corralled against their will and denied the chance to disperse, until they were loaded onto city buses by police in riot gear and driven off to Chicago jail cells.",
    "I am forgetful of my own actions against a war that resulted in the deaths of thousands of Americans and hundreds of thousands of Iraqis, vast cultural destruction, and enduring instability.",
    "Mike DeWine has approved a law that allows folks to buy a gun without requiring training or a background check in order to satisfy an NRA push for Second Amendment freedom.",
    "The police methodically pulled us apart, handcuffed us, and threw us into the back of police vans, which hauled us away to a Chicago jail where we would spend the night.",
    "Yet there has been little reflection on how our own aggressions, invasions, occupations, and wars have set a precedent for Russia’s destructive invasion of Ukraine.",
    "If this an example of bipartisanship, perhaps we need to return to a divided Senate – at least that would produce some discussion about what was being voted upon.",
    "The only rationale for this vote that I read was Sen. Chuck Grassley’s (R-Iowa) explanation that his wife liked daylight saving time, so I guess there is that.",
    "We need to both decry the violence in Ukraine and consider how our actions as a nation have enabled such violence and how we have ignored violence elsewhere.",
    "In an astonishing example of the U.S. Senate’s ability to act first and think later, the entire Senate voted to continue daylight savings time permanently.",
    "The U.S. Senate unanimously passed a proposal to make daylight savings time permanent in spite of the fact that this was a disaster when tried in 1974.",
    "World leaders and the media have lamented that war has broken out once again in Europe, claiming it to be the worst, or the first, since World War II.",
    "Although we occupied Iraq for over a decade, no weapons of mass destruction were ever found, save the ones we brought with us when we invaded.",
    "If you go to a sporting goods store and buy a firearm, there will be a federal form to fill out and sign with the attendant background check.",
    "Even I catch myself saying things like, \"I can’t recall in my lifetime such an act of naked aggression by one nation against another.\"",
    "I would love to know on what basis our Senators Sherrod Brown and Rob Portman felt this was a good idea for their Ohio constituents.",
    "Just weeks ago our former president was calling Russia’s attack on Ukraine “genius” and calling Putin “very savvy” for his actions.",
    "There are a number of freedom-supporting organizations throughout the country that support laws defending the Second Amendment.",
    "The United States military is the only force of good on Earth with the will and immediate capability of stopping powerful evil.",
    "But the exception I take to the letter is the writer states that this new law removes the requirements for a background check.",
    "This proposal has to be approved by the House of Representatives and signed by President Joe Biden for it to take effect.",
    "It is evident from the hundreds of thousands of Americans who support these types of laws that this is a growing trend.",
    "The world is now again watching in horror as a military power invades another sovereign nation on groundless pretexts.",
    "We marched onto Lake Shore Drive that night calling for our government to step back from war, death and destruction.",
    "Yes, let us support the brave Ukrainian people in defending their homeland and pushing back the Russian invasion.",
    "We must use American force – now – to stop missile attacks on children, women, men and don't forget animal pets.",
    "As I recall, we are free to purchase rifles (and have been for quite some time) without a training requirement.",
    "President Biden is not the weak one\nFox News, many Republicans and Donald Trump call President Joe Biden weak.",
    "Our protest at the Federal Building came a day after thousands of us marched through the streets of Chicago.",
    "But let us do so in order to at last beat our swords into ploughshares and our spears into pruning hooks.",
    "If we are to be allies to the Ukrainians and the peoples of the world, then self-reflection is in order.",
    "Moreover, we are aghast that a military power like Russia is deploying that power against a weaker foe.",
    "Perhaps the letter writer could benefit from the lost art of research prior to expository expressions.",
    "Who withheld vital weapons from Ukraine President Volodymyr Zelensky in exchange for political dirt?",
    "Did not those besieged for years at Sarajevo exhibit as much courage as those at Kyiv and Kharkiv?",
    "We justifiably worry over the precedent this could set for aggression by China against Taiwan.",
    "Who called Russia's invasion brilliant, labeling his combat troops a peace-keeping force?",
    "Who made the deal with the Taliban promising the removal of U.S. troops from Afghanistan?",
    "In the end, the city paid millions of dollars to settle lawsuits for wrongful arrests.",
    "Who believed Putin's words over our own intelligence, who regularly criticized NATO?",
    "Meanwhile, we sit and watch the daily slaughter of millions of innocent human souls.",
    "Are there lessons from the war in Kosovo that may be operable in the war in Ukraine?",
    "In our act of civil disobedience, we were joining hundreds who were there that day.",
    "To address the background check, I know that Ohio law does not preempt federal law.",
    "They say his weakness caused Russian President Vladimir Putin's attack of Ukraine.",
    "Yet the violence, destruction, and resistance also demand the wisdom of history.",
    "The separating of church and state is what allows religious liberty to exist.",
    "Vast amounts of live tape and audio recordings are a living document to this.",
    "Nowhere in this new law is the federal background law rescinded or canceled.",
    "You fear Russia's nuclear weapons – well, America has nuclear weapons, too.",
    "The free flow of ideas has always been a bedrock activity in our society.",
    "The second issue is that this law was not passed to \"satisfy\" the NRA.",
    "The courage of the Ukrainian people must be applauded and supported.",
    "Russia is escalating war every day with mass atrocities on humanity.",
    "As I recall, Ohio is the 22nd state to approve laws of this type.",
    "One local organization is the Ohio Buckeye Firearms Association.",
    "So, just take one moment and ask, \"who are these weak morons?\"",
    "The violence and destruction in Ukraine demand our outrage.",
    "Who pressed for the removal of U.S. troops from Europe?",
    "We were there to protest the U.S. invasion of Iraq.",
    "Yet, the lack of historical context is astounding.",
    "Not after they are all dead, action is needed now.",
    "In this letter, the writer states that Gov.",
    "Vladimir Putin has already started WWIII.",
    "Calls for peace must be loud and heard.",
    "We are so quick to forget our history.",
    "), dark mornings for months at a time.",
    "And let us finally study war no more.",
    "Stop the mindless destruction today.",
    "Yet is not Kosovo part of Europe?",
    "Who called Putin smart and savvy?",
    "Let us work for peace in Ukraine.",
    "Are our elected leaders cowards?",
    "Certainly not President Biden!",
    "We should not fear criminals.",
    "Criminals should fear us.",
    "Robin Cox, Anderson Twp.",
    "Thomas Strunk, Northside",
    "DON’T THROW IT AWAY.",
    "Let's look back.",
    "Really?"
  ]
}