{
  "id": 8993,
  "mediaId": 2537,
  "date": "2022-03-24",
  "headline": "Ohio Politics Explained podcast: DeWine's sets goals and candidates prepare to debate next week",
  "image": "https://www.gannett-cdn.com/presto/2022/03/23/NCOD/f42355c1-0184-41b0-bc4a-9fb716244c39-State_of_the_State_BJP_05.jpg?crop=3599,2025,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/03/24/ohio-politics-podcast-dewines-new-goals-and-holocaust-education/7156102001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anna Staver",
  "authorUrl": "https://www.dispatch.com/staff/5802228002/anna-staver/",
  "termIds": [
    5761,
    2143,
    2290,
    1489,
    6067,
    6474
  ],
  "sentences": [
    "\"You should talk about these atrocities that have happened in history, but you also do have an obligation to point out the value that each individual brings to the table,\" Rep. Sarah Fowler Arthur, R-Ashtabula, said during an interview with NEWS 5 in Cleveland.",
    "2) \"Inappropriate and uninformed\"\nA Republican lawmaker found herself at the center of a controversy this week over comments she made about how the Holocaust should be explained to children.",
    "The USA TODAY Network Ohio Bureau serves The Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "3) Primary punches\nJosh Mandel and Mike Gibbons, two Republican candidates for the U.S. Senate, got in each others' faces during a recent debate.",
    "The two men both told each other to sit down, and one of them was heard using an expletive, though both campaigns deny it was their candidate.",
    "Republican leaders in the House and Senate said they were open to the governor's ideas, but had yet to see specifics--including a price tag.",
    "4) Upcoming debates at Central State\nOhio's next set of primary debates will be held next Monday and Tuesday at Central State University.",
    "A day after that debate, DeWine and one of his primary challengers, Joe Blystone, got into a heated conversation at the Ohio Beef Expo.",
    "Mike DeWine gave his first state of the state speech in three years on Wednesday and laid out an ambitious set of goals for Ohio.",
    "It's a podcast from the USA TODAY Network Ohio Bureau where we catch you up on the state's political news in 15 minutes or less.",
    "The Republicans are scheduled for 7 p.m.\nOn Tuesday, March 29, Democratic gubernatorial candidates will debate at 7 p.m.",
    "The primary debate for the Republicans hoping to become governor was canceled after DeWine declined to participate.",
    "He talked about investing in mental health care, state parks, Appalachia, police training and water projects.",
    "House Speaker Bob Cupp quickly distanced himself, calling her remarks \"inappropriate\" and \"uninformed.\"",
    "Ohio's governor packed the statehouse this week for his biggest and possibly last state of the state.",
    "And another Republican found herself in hot water over comments she made about Holocaust education.",
    "The Democratic candidates for U.S. Senate will take the stage Monday, March 28 at 11:30 a.m.",
    "Listen to \"Ohio Politics Explained\" on Spotify, Apple, Google Podcasts and TuneIn Radio.",
    "We break down what it all means on this week's episode of Ohio Politics Explained.",
    "The episode is also available by clicking the link at the top of the article.",
    "This week, host Anna Staver was joined by bureau chief Anthony Shoemaker.",
    "1) Big ideas\nGov."
  ]
}