{
  "id": 9106,
  "mediaId": 2699,
  "date": "2022-03-27",
  "headline": "Making It Easy to Carry a Concealed Gun Is Absolute Madness",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_675,w_1200,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1648346976/220326-cohen-guncontrol-hero_psdwg8",
  "link": "https://www.thedailybeast.com/making-it-easy-to-carry-a-concealed-gun-is-absolute-madness?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael A. Cohen",
  "authorUrl": "https://www.thedailybeast.com/author/michael-cohen",
  "termIds": [
    5020,
    1126,
    5928,
    6241,
    6474,
    6614,
    6729,
    6678,
    6693
  ],
  "sentences": [
    "The argument commonly made by gun rights advocates—that only a gun provides sufficient protection from violent bad guys—is undone by the well-known fact that possessing a gun significantly increases the likelihood that the gun owner, or someone close to them, will die from gun violence.",
    "But of course, in America, the way we treat guns and gun ownership is anything but normal.”\nWhile it’s still too early to assess the full effect of recently passed permitless concealed laws, there’s enough available data to suggest that they will lead to more needless deaths.",
    "Not surprisingly, studies have shown that states with “may issue” concealed carry laws—which, in certain states, gives the police discretion as to who can carry concealed weapons—have fewer incidents of gun violence than those that have less restrictive “shall issue” laws.",
    "Mike DeWine introduced a series of gun control measures after a mass shooting in Dayton took the lives of nine people and wounded 27 (it was the second mass shooting of that day in America—the other being the massacre of 22 people in a Wal-Mart in El Paso, Texas).",
    "One such study, conducted by the Boston University School of Public Health in 2017, found states with “shall issue” laws have homicide rates more than 10 percent higher than those with more restrictive laws.",
    "States have long allowed gun owners to carry a concealed weapon, but all but Vermont required them to go through a permit process, which often entailed a background check and a mandatory safety class.",
    "Would anyone consider it a good idea to let any adult legally get behind the wheel of a two-ton automobile with no training, no permitting, and no proof that they actually know how to properly drive?",
    "A generation of Americans have been told that they have no responsibility to retreat and every right to mete out the ultimate punishment to those who threaten them—even if the person is fleeing.",
    "Holcomb’s trust in his fellow citizens is badly misplaced, because if he were correct, the U.S. would not have, by far, the most gun-related homicides of any developed country in the world.",
    "With more people on the street potentially carrying a gun, police will almost certainly become even more skittish about the potential of getting shot by a gun-toting citizen.",
    "But ultimately, the power of the National Rifle Association and the pro-gun lobby is simply too strong, even for a party that likes to portray itself as pro-police.",
    "Let’s face it: there are few better ways to damage one’s support among Republican primary voters than by proposing sensible regulations on gun safety and ownership.",
    "Indeed, in permitless concealed carry states residents can buy a weapon and carry it hidden on their body—even if they have no idea how to use that weapon properly.",
    "Unless the person cutting your hair is the modern reincarnation of Sweeney Todd, chances are pretty good that you need not worry about dying in the barber’s chair.",
    "Last week, Indiana became the latest state to make it legal for ordinary citizens to carry a concealed weapon on their person, with no permit and no training.",
    "As should have been expected, gun homicides in the state from 2012 to 2019 rose by 33 percent over the previous seven-year period before the policy change.",
    "For Holcomb, Dewine, and every other Republican governor who has signed a permitless concealed carry law—the politics of that decision are crystal clear.",
    "A concealed carry permit in Ohio used to require paying a fee of at least $67, a background check, and eight hours of training—mainly focused on safety.",
    "This follows the lead of two other states that passed such laws this year—Alabama and Ohio—and six states that enacted similar legislation last year.",
    "So, too, did the Indiana State Fraternal Order of Police, the state Association of Chiefs of Police, and the Indiana Prosecuting Attorneys Council.",
    "For comparison’s sake, obtaining a license to cut hair in Ohio requires the completion of at 1,500 hours enrolled in a cosmetology school program.",
    "For example, we already know that states with weaker gun laws have higher rates of gun violence, and those with strong gun laws have lower rates.",
    "In signing the new legislation, Holcomb said he trusts citizens of the Hoosier state to “lawfully and responsibly carry a handgun” in the state.",
    "A more pertinent and less-discussed argument is that all of us would be safer if there were fewer untrained shooters toting concealed weapons.",
    "It’s no doubt a good part of the reason why overwhelming numbers of Americans (as much as 88 percent) oppose these new less-restrictive laws.",
    "That will undoubtedly lead to more shootings by cops already trained to believe that every citizen they encounter could be carrying a weapon.",
    "Instead, there was a family of five inside the minivan and, rather than avenging an armed robbery, he took the life of a 9-year old girl.",
    "So too, tragically, is the consequence of such political cynicism—namely more dead Americans at the hands of an untrained gun owner.",
    "“It boggles the mind that anyone would want people running around with guns they have no training or experience in using.",
    "According to gun rights advocates, these new laws are necessary because the current permit process is simply too onerous.",
    "It boggles the mind that anyone would want people running around with guns they have no training or experience in using.",
    "These are mothers and fathers, sons and daughters, husbands and wives—taken too soon from their families and friends.",
    "These kinds of tragic incidents happen all too often in America—and rarely garner more than a few days’ attention.",
    "All this is happening at a time when firearm homicides in 2020 surpassed 45,000—the highest number yet recorded.",
    "Wisconsin, which is currently debating a permitless concealed carry law, weakened its permit process in 2011.",
    "But try to imagine any public official taking the same attitude toward the issuing of driver’s licenses.",
    "Legislatures in Georgia, Nebraska, South Carolina, and Wisconsin are also considering such legislation.",
    "But that was then—and now DeWine is running for reelection this year in a crowded GOP primary field.",
    "It’s also the reason that police organizations are almost unanimously opposed to these new laws.",
    "Prominent police chiefs in Ohio also decried the legislation (but, as in Indiana, to no avail).",
    "If pro-gun state legislators get their way, those numbers will likely only increase further.",
    "But of course, in America, the way we treat guns and gun ownership is anything but normal.",
    "Take, for example, what happened last month after a man was held up at an ATM in Houston.",
    "Thanks to the actions of Republican state legislators in Indiana—and the state’s GOP Gov.",
    "He took out a gun and fired at a car that he believed was driven by the assailant.",
    "The chief of Indiana’s state police spoke out against permitless concealed carry.",
    "Every day in the United States more than 110 Americans are killed with a gun.",
    "With permitless concealed carry, these tragedies will only multiply.",
    "As a result, 38 states have so called “stand your ground” laws.",
    "And just how onerous are the old gun permitting rules, anyway?",
    "No background check, no training, no shooting exercises.",
    "In many states, police could reject permit applications.",
    "Eric Holcomb—these daily tragedies will likely rise.",
    "These new laws, however, remove all restrictions.",
    "But that is precisely the point.",
    "In 2019, Ohio Gov."
  ]
}