{
  "id": 9129,
  "mediaId": 2919,
  "date": "2022-03-23",
  "headline": "Esther's Law now in effect in Ohio, family and legislators set to push for more protection against elder abuse",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/82e7ca2/2147483647/strip/true/crop/1686x885+0+5/resize/1200x630!/quality/90/?url=https%3A%2F%2Fx-default-stgec.uplynk.com%2Fausw%2Fslices%2F2d8%2Fb2c1c5c2af374f52af57ddcae54c6663%2F2d8d162abde140568115446ec87c0ca1%2Fposter_7da1a9621d5848c194c3a0b03238d242.png",
  "link": "https://www.news5cleveland.com/news/state/esthers-law-now-in-effect-in-ohio-family-and-legislators-set-to-push-for-more-protection-against-elder-abuse",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Taneisha Cordell",
  "authorUrl": "https://www.news5cleveland.com/taneisha-cordell",
  "termIds": [
    2143,
    2221,
    2578,
    3928,
    6474,
    6096,
    6067
  ],
  "sentences": [
    "CLEVELAND — Esther’s Law, aimed at protecting nursing home residents by allowing their families to set up a camera in their room, is now in effect in Ohio following approval from Governor Mike DeWine and a series of News 5 investigations.",
    "“Making sure that everyone understood that there's parts of this bill that can actually work for their benefit, that this isn't a gotcha bill.”\nDeWine signed Esther’s Law in December of 2021.",
    "Families can now request cameras inside their loved one’s nursing home starting Wednesday after notifying the facility and receiving verification of the use of a fixed-lensed camera.",
    "“I've had an Esther in my life and I wish I would have had cameras during that time period when my mother was in a rehabilitation center,” Brent said.",
    "Brent first sponsored legislation allowing families to set up cameras in nursing homes to catch potential abuse in 2019, but the bill failed.",
    "“It really was an eye-opener of how much we needed things such as Esther's law.”\nBut in 2021, State Senator Nickie Antonio joined in support.",
    "“If I would have this for my mother, you know, it might have stopped the abuse.”\nIf you suspect elderly abuse or neglect.",
    "The aide responsible, Virgen Caraballo, pleaded guilty to 7 counts of gross patient abuse and was sentenced to 10 years.",
    "In 2011, Steve Piskor placed a hidden camera in his then 78-year-old mother’s, Esther, room at an elderly nursing home.",
    "Piskor says he and other legislators are pushing to include protection in assisted living facilities and group homes.",
    "I don't want to see anybody go through that again.”\nWith the video proving abuse, Pisklor went to trial.",
    "Caraballo was ordered into a rehab program and cannot have contact or work with any elderly ever again.",
    "But Piskor also reached out to local leaders like State Representative Juanita Brent of Cleveland.",
    "The legislation, in honor of Piskor’s mother who passed in 2018, is now in effect 90 days later.",
    "you can call Cuyahoga County's Division of Senior and Adult Services Hotline at 216-420-6700.",
    "“We really worked together on getting this over the finish line,” Antonio said.",
    "That same year, Esther's Law passed unanimously through the House and Senate.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "Ohio leaders and the family behind Esther’s Law say this is just the start.",
    "“What she went through, it was, was a horrific experience,” he said.",
    "If a loved one has any roommates, they also must sign an agreement.",
    "She was granted early release in 2019 after serving six years.",
    "You can also report elder abuse through the state's website.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "Piksor says he suspected abuse by an aide.",
    "They must follow this law,” Piskor said.",
    "“It was something that I had to do...",
    "“This is a law for nursing homes.",
    "And it won’t be the last."
  ]
}