{
  "id": 915,
  "mediaId": 8322,
  "date": "2022-02-11",
  "headline": "Ohio developer in Dave Chappelle hometown controversy moving forward with housing plan: report",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/dave-chappelle.jpg",
  "link": "https://www.foxnews.com/entertainment/ohio-developer-dave-chapelle-moving-forward",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Ruiz",
  "authorUrl": "https://www.foxnews.com/person/r/michael-ruiz",
  "termIds": [
    2143,
    3484,
    73,
    372,
    6740,
    6104,
    6474
  ],
  "sentences": [
    "(Photo by Owen Sweeney/Invision/AP, File)\n\"He stated that he has ‘millions of dollars’ in investments in the Village currently, and stated that if the development proceeds, ‘What I am investing in is no longer happening, and Oberer can come buy all this property from me if they want to be your benefactor,’\" according to minutes from a Dec. 6 council meeting.",
    "(Photo by Shannon Finney)\nDAVE CHAPPELLE THREATENS TO PULL OHIO INVESTMENTS OVER POTENTIAL NEARBY HOUSING DEVELOPMENT\nAs a result of pushback from Chappelle, who lives near the village and threatened to pull planned investment in a new comedy club at the heart of the community, and other residents, the village council voted it down Monday.",
    "An Ohio developer says he is moving forward with construction on a controversial housing project in Dave Chappelle’s hometown of Yellow Springs following a heated village council meeting that saw the comic icon threaten to withdraw millions in planned investments in the community.",
    "Chappelle received criticism earlier this week after the paper reported his opposition to the developer’s plan – which sought to add dozens of multiple-family homes to the village, which in 2019 had less than 4,000 residents, according to the U.S. Census Bureau.",
    "(Mathieu Bitton/Netflix)\nDAVE CHAPPELLE ISSUES STATEMENT ON THREAT TO WITHDRAW INVESTMENTS OVER OHIO HOUSING DEVELOPMENT\nProponents argued the development would bring affordable housing in the community – but critics say it would barely bring any.",
    "They ultimately voted down a plan Monday that would have created 140 homes – 64 for single families, 52 duplexes and two dozen townhouses while donating just under two acres for future affordable housing development.",
    "Other residents had raised concerns about increased traffic and light pollution, as well as removing trees and limited space for parking at prior council meetings, records show.",
    "CLICK HERE TO SIGN UP FOR OUR ENTERTAINMENT NEWSLETTER\nBut the developer plans to move forward with construction under the current zoning, for single-family homes.",
    "At an earlier meeting in December 2021, village records describe \"Dave Chappelle expressed that he is adamantly opposed to the development.\"",
    "\"Construction should commence in early spring,\" George Oberer, the CEO of Oberer Homes, told Dayton Daily News, the major local newspaper.",
    "Sims called the plan \"an accelerant on the homogenization\" of the village, which houses Antioch College and is the hometown of Gov.",
    "\"Concerned residents and a responding Village Council ‘killed’ a half-baked plan which never actually offered affordable housing.\"",
    "The plan, according to Chappelle’s team, would have set aside just three of more than 140 lots for \"future\" affordable housing.",
    "And critics have pointed out that existing development agreements and land covenants could complicate the process.",
    "Still – regulations require that even the single-family plan, an alternate proposal, obtain legislative approval.",
    "Many, like Chappelle, argued that the plan was being mislabeled as an affordable housing development.",
    "\"Dave Chappelle didn't kill affordable housing,\" said Carla Sims, a spokesperson for Chappelle.",
    "\"The rest of the homes were to be priced between $250,000 and upwards of $600,000,\" she said.",
    "\"In Yellow Springs, and in many other places, that is not considered affordable housing.\"",
    "Others opposed the plan to install a new homeowners association for the development.",
    "A spokeswoman for Oberer did not immediately respond to a request for comment.",
    "Story tips can be sent to michael.ruiz@fox.com and on Twitter: @mikerreports",
    "Village officials did not immediately respond to requests for comment.",
    "The village’s planning commission meets again on Tuesday.",
    "The Associated Press contributed to this report.",
    "Michael Ruiz is a reporter for Fox News Digital.",
    "The village is about 20 miles east of Dayton.",
    "Mike DeWine in addition to Chappelle."
  ]
}