{
  "id": 9847,
  "mediaId": 8358,
  "date": "2022-03-30",
  "headline": "Ohio legislature passes limits on OT pay",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/03/web1_Ohio-45.jpg",
  "link": "https://www.limaohio.com/news/502681/ohio-legislature-passes-limits-on-ot-pay",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4858,
    2484,
    1489,
    956,
    6077,
    6474,
    6153,
    6108
  ],
  "sentences": [
    "Andrew Brenner of Delaware County and Bob Peterson of Fayette County, previously testified in a House committee that examples of those activities include workers “checking their schedule, listening to voicemails, or reading emails.”\nThe exemptions don’t apply if the worker performs the previously mentioned tasks during the work day, or if they do them at the specific direction of their employer.",
    "The bill, a priority for the Ohio Chamber of Commerce, allows employers to not have to pay overtime to employees for time spent traveling to and from work, and for “activities requiring insubstantial or insignificant periods of time beyond the employee’s scheduled working hours.”\nRepublican bill sponsors, state Sens.",
    "One House-added amendment would require workers who want to join a class-action lawsuit alleging overtime wage theft to file a written consent form with the court, which is already required for minimum-wage class-action suits in Ohio, Peterson said during a floor speech.",
    "Brenner noted that SB47 doesn’t create any new overtime exemptions, as the U.S. Supreme Court previously ruled that small amounts of time do not need to be compensated to comply with the Federal Labor Standards Act.",
    "But prior to last week’s House vote approving the bill, state Rep. Jeff Crossman, a Parma Democrat running for Ohio attorney general, said SB47 is a slap in the faces of workers.",
    "Under current Ohio law, when such class-action suits are filed, “similarly situated” employees are automatically added to the lawsuit unless they opt out, according to Peterson.",
    "Brenner said last September that SB47 would clarify for both employers and workers what is and what’s not considered eligible for overtime claims and stop “frivolous” lawsuits.",
    "The second House amendment clarifies that SB47 won’t affect collective bargaining agreements that have provisions regarding what type of work activities are compensated.",
    "The Senate passed a similar bill to SB47 last session, but that legislation died because the House took no action on it before the the end of the legislative session.",
    "Senate Bill 47 passed a Senate concurrence vote by a party-line 25-8 vote, with Republicans voting in favor and Democrats against the measure.",
    "COLUMBUS, Ohio—Legislation to exempt employers from paying overtime to workers for commuting and checking messages off-hours is headed to Gov.",
    "Wednesday’s Senate vote was held after virtually no debate, as the bill was previously debated and passed last September.",
    "“I have to urge a no vote on this bill because I don’t support wage theft,” he said.",
    "The Senate had to vote again because the House added two amendments.",
    "Mike DeWine after clearing a final Ohio Senate vote Wednesday.",
    "Previous"
  ]
}