{
  "id": 9966,
  "mediaId": 8491,
  "date": "2022-04-04",
  "headline": "Valley to share in $2B Ohio transportation money",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/01/ohio-department-of-transportation.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/nearly-2b-invested-into-ohio-transportation-in-2022/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooke Meenachan",
  "authorUrl": "https://www.wkbn.com/author/brooke-meenachan/",
  "termIds": [
    0
  ],
  "sentences": [
    "In Columbiana County, which is covered by a different district, there are 15 projects planned at about $25.5 million:\nSix resurfacing\nTwo slide repairs\nFive bridge/culvert projects\nOne enhancement project\nOne safety project\nThe projects include the resurfacing of Route 11 from Lisbon to just south of Columbiana and of U.S. Route 30 from the Stark County line to Hanoverton.",
    "“Our investments have made Ohio an attractive place to do business, and ongoing improvements to our roads are essential for continued economic development and the safety of our travelers.”\nSince the beginning of the DeWine Administration, ODOT has invested nearly $6 billion into more than 2,800 projects.",
    "We need every motorist to buckle up, obey the speed limit, drive sober, and drop the distractions.”\nYou can stay up to date on construction across the state by signing up for weekly bulletins or visiting the projects page on the ODOT website.",
    "Others involve paving and repairs on a number of sections of Interstate 680 between Austintown and Beaver Township, as well as the resurfacing of Market Street on Youngstown’s south side.",
    "We’re constantly looking for ways to better engineer our roads to ensure they’re as safe as possible for those who use them each day,” said ODOT Director Jack Marchbanks.",
    "“We currently have 18 projects between Mahoning and Trumbull counties and about $40 million worth of work between those 18 projects,” said ODOT spokesperson Ray Marsch.",
    "There is an ongoing project on the Elizabeth Street bridge in East Liverpool and intersection improvements planned on County Road 43 in Calcutta.",
    "In Trumbull County, they list pavement repairs on Route 422 in Warren, as well as resurfacing of the Route 5 Bypass and State Route 82.",
    "More than $450 million has been spent on safety projects like safe routes to school and nearly 400 pedestrian safety projects.",
    "“Ohio is a state that makes and moves things, and a solid transportation system is key,” said Governor Mike DeWine.",
    "COLUMBUS, Ohio (WKBN) – The Ohio Department of Transportation unveiled its plan for the 2022 construction season.",
    "The largest in Mahoning County will be a repaving of State Route 170 through the Village of New Middletown.",
    "Editor’s note: This story corrects the number of projects slated for Trumbull and Mahoning counties.",
    "Ninety-five cents of every dollar spent goes toward preserving existing infrastructure.",
    "“Safety has been the top priority since the first day of the DeWine Administration.",
    "This year, Ohio is investing nearly $2 billion in 829 projects across the state.",
    "You can also see where work might impact your commute or trip at OHGO.com.",
    "These projects aren’t just targeted at motor vehicles.",
    "“However, drivers have an important role to play too.",
    "We regret the error."
  ]
}