{
  "id": 2304,
  "mediaId": 195,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Democratic Senate primary tightening in Wisconsin: poll",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2021/07/mandelabarnes.jpeg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3469100-democratic-senate-primary-tightening-in-wisconsin-poll/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod/",
  "termIds": [
    2510,
    2510,
    2468,
    2468,
    2192,
    2192,
    1568,
    1591,
    1591,
    1568,
    1564,
    1564,
    1925,
    1925,
    2039,
    2039,
    1147,
    1147,
    802,
    802,
    571,
    571,
    146,
    146,
    2538,
    2538,
    2710,
    2710,
    2672,
    2672,
    2972,
    2969,
    2972,
    2969,
    2941,
    2941,
    2855,
    2855
  ],
  "sentences": [
    "Wisconsin's Democratic Senate primary is tightening as the race heats up, though a broad swath of undecided voters is still leaving it open heading into the summer, according to a new Marquette Law School poll released Wednesday.",
    "However, Johnson had previously been left for dead by Republicans in both 2010 and 2016 only to pull out upset victories that GOP operatives attribute to an intangible connection with the Wisconsin electorate.",
    "Mandela Barnes still in the lead with 19 percent support among Democrats, including independents who lean Democratic and independents who say they will vote in the Democratic primary.",
    "The ultimate Democratic nominee will face off against Sen. Ron Johnson (R), who is running for a third term in a race that could decide which party controls the Senate.",
    "Barnes has consistently been considered the front-runner, but Lasry has been buoyed by a wave of spending on campaign ads, in part backed by his own personal funds.",
    "Democrats believe Johnson is a vulnerable incumbent after making controversial comments about coronavirus treatments, the 2020 election and other topics.",
    "At the same time, only 43 percent approve of the job President Biden is doing, a figure that could serve as an anchor on the Democratic nominee.",
    "State Treasurer Sarah Godlewski falls in third with 7 percent, and Outagamie County Executive Tom Nelson rounds out the top four with 5 percent.",
    "There is also a relatively large window for the candidates to further shake up the race, with primary voters not casting a ballot until Aug. 9.",
    "However, Milwaukee Bucks executive Alex Lasry trails just behind him at 16 percent, a difference that falls within the poll's margin of error.",
    "The Marquette Law School poll surveyed 805 Wisconsin registered voters, including 363 likely Democratic primary voters from April 19-24.",
    "Still, Johnson suffers from low approval ratings, with just 36 percent of Wisconsin registered voters approving of the job he's doing.",
    "The survey marks a significant tightening from the same poll in February, which showed Barnes leading Lasry by a 23-13 margin.",
    "Still, the race appears up for grabs, with a whopping 48 percent saying they're undecided  the same figure from February.",
    "The survey has margins of error of 4.1 percentage points and 6.6 percentage points, respectively.",
    "The latest survey showed Lt. Gov."
  ]
}