{
  "id": 2335,
  "mediaId": 367,
  "date": "d2022-04-13T00:00",
  "headline": "Democratic U.S. Senate contender Alex Lasry vows to 'bring more jobs and investment back to rural Wisconsin'",
  "image": "https://www.gannett-cdn.com/presto/2021/10/26/PMJS/69f52157-6447-4de1-8588-77fa76ec6fc9-MJS_labor30_10_hoffman.jpg_labor30.JPG?crop=1460,2258,x1901,y6&width=600&height=928&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/politics/elections/2022/04/13/democratic-us-senate-contender-alex-lasry-releases-rural-plan/7296973001/",
  "sentiment": "0.0",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Glauber",
  "authorUrl": "https://www.jsonline.com/staff/2646086001/bill-glauber/",
  "termIds": [
    741,
    802,
    1568,
    2039,
    2468,
    146,
    571,
    596,
    2855,
    2945,
    2972
  ],
  "sentences": [
    "More:Democratic U.S. Senate candidate Mandela Barnes opposes Biden administration's plan to lift Title 42 rule at the border\nMore:Democratic U.S. Senate candidate Sarah Godlewski issues 'Cut Costs Plan,' calls for suspension of federal gas tax",
    "U.S. Senate contender Alex Lasry released a rural economic plan Wednesday, vowing to fight for federal funding and promising to partner with Democratic U.S. Sen. Tammy Baldwin to \"bring more jobs and investment back to rural Wisconsin.\"",
    "Among elements of Lasry's plan:\nInstituting college loan forgiveness programs \"to attract people to move back\" to rural communities as well as providing incentives to fill job shortages in key professions like health, teaching and law.",
    "Working on the next Farm Bill or separate legislation \"to enact meaningful dairy policy reform,\" while making sure trade negotiations help open more marks \"for dairy exports, especially in the specialty cheese program.\"",
    "Providing federal funds to UW-Extension to help create \"more direct markets for farms to local businesses, farmers markets and consumers\" and \"investing in agricultural research and development through the UW System.\"",
    "Bolstering infrastructure by working to make sure Wisconsin receives as much funding as possible in competitive federal grants and pushing for investments in affordable housing and health care.",
    "This plan at its core is about investing more in our rural, working families,\" Lasry said in a statement that accompanied the eight-page \"Strengthening Rural Economics\" policy paper.",
    "Getting companies to earn tax breaks for such things as bringing manufacturing back from overseas, locating operations in rural communities and employing a unionized workforce.",
    "Democrats in the run-up to the Aug. 9 primary are focusing on rural issues and areas as they try to reverse the party's fortunes in a key part of Wisconsin.",
    "Calling on Congress to establish regulations for PFAS, so-called \"forever chemicals\" and pushing to hold \"polluters accountable.\"",
    "Wisconsin Treasurer Sarah Godlewski released a rural blueprint that called for making broadband a public utility.",
    "Outagamie Executive Tom Nelson has traveled to the state's 72 counties and emphasized rural issues.",
    "The primary winner will take on Republican U.S. Sen. Ron Johnson in the fall.",
    "Mandela Barnes is currently on a \"Barnes for Barns\" tour across the state.",
    "Lt. Gov."
  ]
}