{
  "id": 2337,
  "mediaId": 367,
  "date": "d2022-04-12T00:00",
  "headline": "Democratic U.S. Senate candidate Mandela Barnes opposes Biden administration's plan to lift Title 42 rule at the border",
  "image": "https://www.gannett-cdn.com/presto/2021/10/26/PMJS/79db349c-f4d6-447a-90dd-8be48900978c-MJS_dems_obama_8_hoffman.jpg_DEMS_OBAMA.JPG?crop=2323,1307,x1,y58&width=2323&height=1307&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/politics/elections/2022/04/12/mandela-barnes-opposes-biden-plan-lift-title-42-rule-border/7279683001/",
  "sentiment": "0.0",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Glauber",
  "authorUrl": "https://www.jsonline.com/staff/2646086001/bill-glauber/",
  "termIds": [
    741,
    802,
    1147,
    1568,
    1925,
    2039,
    2087,
    2468,
    146,
    571
  ],
  "sentences": [
    "During an interview with the Milwaukee Journal Sentinel, Barnes said he doesn't support the administration's plan to lift what is known as Title 42, which has been used to turn away migrants at the southern border during the pandemic.",
    "Title 42 was imposed in March 2020 during the Trump administration by the Centers for Disease Control and Prevention and restricted migrants coming into the country because of a public health emergency triggered by the pandemic.",
    "In both public and private polling, Barnes, the state's lieutenant governor, has a lead over three main rivals, Milwaukee Bucks executive Alex Lasry, state Treasurer Sarah Godlewski and Outagamie County Executive Tom Nelson.",
    "A bipartisan measure introduced in the U.S. Senate calls for a 60-day extension of Title 42 while requiring the Department of Homeland Security to draw up a plan to deal with an influx of migrants.",
    "Explaining his opposition to ending the restriction on May 23, Barnes said \"simply because there's not a detailed plan in place so that we can keep asylum seekers and people in the country safe.\"",
    "A supporter of Medicare for All and a Green New Deal \"that works for Wisconsin,\" Barnes was asked if his liberal background might leave him open to attack in the fall, if he's the nominee.",
    "Barnes said he \"supports comprehensive immigration reform that treats people with dignity, with fairness, with humanity\"\nHe also said he is not part of the defund the police movement.",
    "In a wide-ranging interview ahead of the candidate's rural tour, called \"Barnes for Barns,\" the front runner for the Democratic nomination laid out the broad strokes of his campaign.",
    "With inflation spiking, Barnes said he was supportive of a suspension of the 18.4 cents per gallon federal gas tax, a proposal also backed by Lasry and Godlewski.",
    "\"I want to make sure that law enforcement agencies have the resources they need,\" he said, adding \"I also think we need to increase crime-prevention initiatives.\"",
    "\"The issues that I have always consistently brought up throughout my time in office are the issues that have been most concerning to people in Wisconsin.\"",
    "Barnes, who has traveled the state as lieutenant governor, said Democrats can attract voters in rural areas, where Republicans have dominated.",
    "Yet Barnes said Democrats can't take for granted turnout in urban areas, either, including the party's strongholds in Madison and Milwaukee.",
    "\"I'd like to see Biden put forward a comprehensive plan that deals with an influx of asylum seekers before we lift Title 42,\" Barnes said.",
    "They're running with others in the August 9 primary, with the winner taking on two-term Republican U.S. Sen. Ron Johnson in the fall.",
    "Democratic U.S. Senate candidate Mandela Barnes is breaking with the Biden administration on a key piece of immigration policy.",
    "Asked what few words he wanted the public to associate with his campaign, Barnes said, \"opportunity, middle class and future.\"",
    "On Tuesday, the Barnes campaign announced it raised more than $1.7 million in the first three months of the year.",
    "Barnes said the turnout was \"less of a concern, more of a warning about what we need to actually excite people.",
    "\"Knowing the concerns people have, the struggles people have, also the hopes and dreams,\" he said.",
    "\"We just can't assume that people in rural communities won't show up to vote for us,\" he said.",
    "by making the more direct connection to people by directly appealing to their concerns.\"",
    "\"I look forward to communicating with people over the air and in person,\" he said.",
    "Turnout in Milwaukee's recent special election for mayor was lower than in 2020.",
    "Unlike Johnson, Lasry and Godlewski, Barnes has yet to launch a campaign ad.",
    "He added Democrats \"actually have to talk about the things that matter.",
    "Barnes declined to compare himself to his primary opponents.",
    "Instead, he emphasized his own credibility as a candidate.",
    "\"I don't think that, I don't think that at all,\" he said.",
    "And I connect with people in every corner of the state.\"",
    "\"I know the struggles of working people,\" he said.",
    "\"Those struggles are my struggles.",
    "We have to have people engaged.\"",
    "\"We have to have a presence.\""
  ]
}