{
  "id": 2343,
  "mediaId": 65,
  "date": "3/30/2022 12:00:00 AM",
  "headline": "The Senate candidate who spotlights 'It is us versus China' in a new ad is a Democrat",
  "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/03/1862/1048/Tim-Ryan-Ohio-Democratic-Senate-primary-debate-1.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/politics/ohio-democratic-senate-candidate-us-versus-china-ad",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    741,
    781,
    1115,
    146,
    428,
    571,
    2566,
    2863
  ],
  "sentences": [
    "One reason for the partisan spending gap on China-related ads may be that many GOP candidates  including all but one of the leading contenders in Ohio's crowed and combustible Republican Senate primary  are yearning to land an endorsement by former President Trump, who remains very popular with Republican voters as he continues to play a kingmaker's role in party politics and flirts with a 2024 White House run.",
    "Ryan, a center-left politician who has long showcased his heartland heritage and his ability to connect with the White working-class voters in the Rust Belt, has spotlighted his efforts to champion workers and their jobs since launching his bid 11 months ago to succeed retiring GOP Sen.",
    "With a handful of wealthy GOP candidates who've poured millions of their own money into their campaigns and with well-financed outside groups backing the contenders, the Ohio Senate race is the second most expensive in the nation in terms of ad spending, according to AdImpact.",
    "It is us versus China, and instead of taking them on, Washington is wasting our time on stupid fights,\" Rep. Tim Ryan, the clear front-runner in the Democratic Senate primary in Ohio, says in spliced-together clips from the campaign trail in his first TV spot.",
    "THE LATEST FOX NEWS POLL IN OHIO'S CROWDED AND COMPETITIVE GOP SENATE PRIMARY\nRyan's campaign told Fox News Digital the first commercial is part of a $3.3 million ad buy that started running on Monday and extends two weeks past Ohio's scheduled May 3 primary.",
    "Talk of taking a muscular approach to U.S.-Chinese relations and curbing Beijing's influence is a message most Republican voters want to hear, and plenty of GOP candidates running in this year's midterm elections are spotlighting the issue in their ads.",
    "But a new commercial in which a Senate candidate laments that \"China is out-manufacturing us left and right\" and stresses that \"America can never be dependent on communist China\" comes from a Democrat, not a Republican.",
    "Since the start of the 2022 election cycle, Republican candidates have spent $5.4 million dollars to run ads that mention China, according to data from AdImpact, a leading national ad tracking firm.",
    "That's more than triple the $1.5 million dished out by independent candidates to run China related ads this cycle and dwarfs the less than half a million dollars spent by Democratic candidates.",
    "The Buckeye State was long a crucial general battleground, but Trump carried it by eight points in his 2016 presidential election victory and in his 2020 reelection defeat.",
    "And many of these candidates have spotlighted their support for the former president's America First policies, which included a confrontational stance against China.",
    "With polls showing both Democrats and Republicans viewing China suspiciously, Beijing is an easy target in campaign commercials in this year's midterm elections.",
    "One of those Democrats was Senate candidate Alex Lasry of Wisconsin, who in a January commercial pledged to \"stand up to China.\"",
    "And the vast majority of $44.8 million shelled out to run ads in Ohio has been spent in the GOP primary.",
    "Ryan, the longtime congressman from northeast Ohio, emphasizes: \"It's us versus them.",
    "But Ryan is one of the first Democrats to spotlight the issue in their ads.",
    "Trump made major gains in Ohio pushing his anti-China agenda.",
    "Capitalism versus communism.",
    "I'm not backing down.\"",
    "It's definitely China.",
    "One word: China.",
    "Rob Portman.",
    "\"China."
  ]
}