{
  "id": 2347,
  "mediaId": 43,
  "date": "3/28/2022 12:00:00 AM",
  "headline": "Rep. Adam Schiff (D. CA) Helps Wisconsin Democrats Take Down Putin's Favorite Senator",
  "image": "https://images.dailykos.com/images/1053450/story_image/Adam-Schiff-copy-900x506.jpeg?1648506707",
  "link": "https://www.dailykos.com/story/2022/3/28/2088723/-WI-Sen-Rep-Adam-Schiff-D-CA-Helps-Wisconsin-Democrats-Take-Down-Putin-s-Favorite-Senator",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2475,
    2475,
    2087,
    2087,
    2095,
    2095,
    1459,
    1765,
    1765,
    2030,
    2030,
    1925,
    1925,
    1335,
    1335,
    1459,
    1147,
    1147,
    1081,
    1081,
    571,
    571,
    563,
    563,
    428,
    428,
    148,
    148,
    2793,
    2793,
    2672,
    2672,
    2910,
    2910,
    2959,
    2959,
    2972,
    2972
  ],
  "sentences": [
    "Or click below to donate and get involved with the Senate Democrat of your choice and these Wisconsin Democrats campaigns:\nWisconsin Democratic Party\nMinocqua Brewing Company SuperPAC\nTony Evers for Governor\nMandela Barnes for U.S. Senate\nSarah Godlewski for U.S. Senate\nTom Nelson for U.S. Senate\nAlex Lasry for U.S. Senate\nJosh Kaul for Attorney General",
    "House Intelligence Committee Chairman, Rep. Adam Schiff (D. CA-28)\nReceived this e-mail today from House Intelligence Committee Chairman, Rep. Adam Schiff (D. CA-28), on behalf of the Wisconsin Democratic Party:\n Sen. Ron Johnson (R. WI), Putin's Puppet.",
    "Pitch in $1 or more to Wisconsin Dems to join their fight to defeat Ron Johnson \nThank you for all you do,\n Rep. Adam Schiff\nCongressman from California's 28th District\nClick here to donate to the Wisconsin Democratic Party.",
    "Now, I'm not all that surprised by Ron Johnson's dishonesty, Mary  he's proven to be one of the leading spreaders of misinformation in the Trump era, on everything from election integrity to climate change to COVID-19.",
    "Senator Elizabeth Warren (D. MA):\n Sen. Elizabeth Warren (D. MA)\nWith a 50-50 split in the Senate right now, defending our Democratic majority this year is going to be an uphill battle.",
    "Senator Cory Booker (D. NJ):\n Sen. Cory Booker (D. NJ)\nI'm reaching out to ask you to split a $10 contribution to my friend Mandela Barnes' campaign for U.S. Senate and mine.",
    "His approval ratings are at an all-time low, and Wisconsin Dems are doing the critical, year-long organizing work to pave the way to victory for his Democratic challenger.",
    "I want to be respectful of your time, so I'll cut right to the chase: Wisconsin deserves better than Senator Ron Johnson, and the WisDems need your support to defeat him.",
    "So with Mandela facing an important FEC fundraising deadline in just 3 days, I am asking you:\nCan you make a $5 contribution to Mandela Barnes' campaign for U.S. Senate?",
    "Since his race is currently rated as a toss-up, we can't wait a moment longer to build the momentum we're going to need to win this thing and send Ron Johnson packing.",
    "With Wisconsin's Democratic primary not until August, investing in WisDems now is one of the best ways to help prepare the ground for Johnson's Democratic challenger.",
    "But the best defense is a good offense, which is why I've endorsed Mandela Barnes to defeat Ron Johnson and win back Wisconsin's U.S. Senate seat for Democrats.",
    "Earlier this year, Ron Johnson announced that he's running for re-election, going back on his word that he wouldn't be seeking another term in office.",
    "Please make a $10 contribution to Mandela Barnes and my campaign before the FEC deadline to show we're ready to flip Wisconsin's Senate seat.",
    "That's why I am personally asking you to make a contribution to Mandela and my campaign before this important FEC fundraising deadline.",
    "Mandela Barnes (D. WI)\nCan you please contribute $10 to Mandela Barnes' campaign for U.S. Senate and mine before the FEC deadline ends?",
    "I know right down to my bones that Mandela is our best chance to win back Wisconsin's Senate seat  as long as we all get in the fight.",
    "We need those leaders in the U.S. Senate and across Wisconsin  a state that very well could decide the Electoral College vote in 2024.",
    "Please make a $5 contribution before this important FEC deadline if you can to help send Mandela Barnes to the U.S. Senate.",
    "Mandela Barnes is exactly the candidate we can count on to defeat him, and Mandela will also make us proud in the Senate.",
    "While you can support any Democratic candidate for the Senate you want, but two big Democratic names are backing Lt.",
    "He's counting on people like you to have the resources required to flip Wisconsin's Senate seat for Democrats.",
    "The kind of jobs that have slipped away as giant corporations have tilted the playing field in their favor.",
    "In the Senate, Mandela will champion opportunity, accountability, and justice, the way he has always done.",
    "His mom was a Milwaukee school teacher, and his dad worked the third shift at the General Motors plant.",
    "Mandela's race gives us the chance to not only keep our Senate majority, but to expand it even further.",
    "And Ron Johnson has been named the most vulnerable Republican Senator up for re-election this year.",
    "And if you're like me, you don't want to see Mitch McConnell reinstated as Senate Majority Leader.",
    "He'll address the climate crisis, stand up for good union jobs, and protect the right to vote.",
    "Wisconsin could be the race that determines whether we defend the Democratic Senate majority.",
    "Together we can help flip Wisconsin's Senate seat and expand the Democratic Senate majority.",
    "Election experts rank Wisconsin as our number one opportunity to beat a Republican Senator.",
    "So today, can you help WisDems defeat Ron Johnson and elect a great Democrat in his place?",
    "This FEC deadline is an important opportunity to show the strength of Mandela's campaign.",
    "He'll fight to create opportunities for hardworking families like the one he grew up in.",
    "Those were solid, middle-class union jobs  the kind of jobs that could support a family.",
    "I could go on and on and on and on about Ron Johnson's history of falsehoods and lies.",
    "He is a game changer who is committed to expanding opportunities for working people.",
    "I know Mandela can win, as long as he has people like you with him in this race.",
    "Look, Wisconsin is a golden opportunity for us to flip a Republican-held seat.",
    "His brand of politics continues to threaten the very fabric of our democracy.",
    "McConnell's super PACs have nearly limitless resources to keep this seat red.",
    "Thanks for being a part of this,\nElizabeth\nThe next e-mail came from U.S.",
    "The Wisconsin Dems have an opportunity to defeat Johnson this November.",
    "Mandela is exactly the kind of person we need in the Senate right now.",
    "Any amount you can give will make a real difference for his campaign.",
    "Who knows how much more damage he can cause given another six years?",
    "Now more than ever, it's important to elect leaders with integrity.",
    "Thank you for adding a contribution before the FEC deadline.",
    "Cory\nClick the links above to donate to Barnes campaign.",
    "Governor Mandela Barnes' (D. WI) U.S. Senate campaign.",
    "Mandela gives Democrats the best chance to do that.",
    "Joe Biden and Kamala Harris won the state in 2020.",
    "Mitch McConnell can't afford to lose Ron Johnson.",
    "This race is as important as they come.",
    "Can he count on you to chip in today?",
    "The first e-mail came from U.S.",
    "Champions of democracy.",
    "Hi, it's Adam Schiff.",
    "But it won't be easy."
  ]
}