{
  "id": 2368,
  "mediaId": 367,
  "date": "3/14/2022 12:00:00 AM",
  "headline": "Democrat Sarah Godlewski releases her first TV ad in her bid for U.S. Senate, takes swipe at Republican Ron Johnson",
  "image": "https://www.gannett-cdn.com/presto/2022/02/02/PMJS/a5029251-e341-4259-9ae1-d772ad986a7c-godlewski_sarah.jpg?crop=1224,1710,x2171,y610&width=600&height=840&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/2022/03/14/democrat-sarah-godlewski-releases-her-first-tv-ad-u-s-senate-bid/7028344001/",
  "sentiment": "0.0",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill Glauber",
  "authorUrl": "https://www.jsonline.com/staff/2646086001/bill-glauber/",
  "termIds": [
    741,
    802,
    1568,
    2039
  ],
  "sentences": [
    "In the 30-second ad, Godlewski mentions her role as state Treasurer while taking a swipe at Republican U.S. Sen. Ron Johnson, who is running for a third term,\n\"Dairy farms disappearing, prices up, COVID still not gone,\" Godlewski says in the ad.",
    "Johnson said money needed to be spent on infrastructure but opposed the legislation for not being fully paid for, adding the country needed to \"stop further mortgaging our children's future.\"",
    "While Democrats have a large primary field, the ad space so far has been dominated by Milwaukee Bucks executive Alex Lasry, whose campaign has spent more than $3 million on TV spots.",
    "Lasry's early ad push appeared to pay off in the most recent Marquette University Law School Poll, which showed him with 13% support among Democrats.",
    "The seven-figure buy will run for the next several weeks and includes broadcast, cable and digital messages in every major market across the state.",
    "Democrat Sarah Godlewski is going up Monday with her first broadcast and cable TV ad buy in her bid to claim the party's U.S. Senate nomination.",
    "It's still very early in the race as the candidates are trying to raise their name id's as well as gather support from potential primary voters.",
    "But the manufacturer of Listerine and medical experts said studies of the idea hadn't yet concluded it was a proven antidote.",
    "Godlewski's jab concerned Johnson's comment in December that mouthwash was one way to protect from COVID-19.",
    "Outagamie County Executive Tom Nelson registered 5% support in the poll, with Godlewski at 3%.",
    "Nearly half of those Democrats polled in the Marquette survey had no preference in the race.",
    "The jobs' reference concerned Johnson's vote against the $1.2 billion infrastructure bill.",
    "Voted against new jobs and told us to take mouthwash to cure COVID.\"",
    "Mandela Barnes, who registered 23% support.",
    "Barnes has yet to air any ads.",
    "\"And what's Ron Johnson done?",
    "Lasry trailed Lt. Gov."
  ]
}