{
  "id": 2405,
  "mediaId": 129,
  "date": "1/21/2022 12:00:00 AM",
  "headline": "What Mattered This Week",
  "image": "https://static01.nyt.com/images/2022/01/21/us/politics/21onpolitics-newsletter-pm-2/21onpolitics-newsletter-pm-2-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/01/21/us/politics/democrats-biden-midterms-voting-rights.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    741,
    781,
    2039,
    2087,
    2411,
    2505,
    146,
    400,
    562,
    2672,
    2845,
    2969
  ],
  "sentences": [
    "In Iowa, former Representative Abby Finkenauer, a front-runner in the Democratic primary to take on Senator Chuck Grassley, called Sinema a sellout.? And Stacey Abrams, who's virtually guaranteed to win the Democratic nomination for governor in Georgia, lumped Manchin and Sinema with the Senate Republican conference: 52 Senators  two Democrats and all Republicans  failed their voters.?\nA Democratic ad takes on inflation\nAn ad from the crowded Democratic Senate primary in Wisconsin caught our attention this week for showing how candidates might distance themselves from an unpopular president.",
    "Melissa Murray, a law professor at New York University who studies women's movements, described the change in their stance as a recognition that these groups now see abortion rights and the scaffolding of democracy to be intertwined.? It was no coincidence, she said, that the states that have been most aggressive in limiting the right to vote are the very same states that have the most aggressive abortion laws.?\nDemocrats turn on their own\nProgressives in the House and Senate have long railed against Sinema and her fellow pro-filibuster Democrat, Senator Joe Manchin III of West Virginia.",
    "At the March for Life in Washington, Kate Zernike and Madeleine Ngo found that the annual anti-abortion rally took on the tone of a celebration? this year as protesters anticipated the Supreme Court overturning the decision that established a constitutional right to abortion half a century ago.?\nKlain steps into the klieg lights\nWe'll regularly feature work by Doug Mills, The Times's longtime White House photographer and a two-time Pulitzer Prize winner.",
    "Voters have this false sense of immediacy, and that has created this expectation that things can be solved in a very short period of time,? said Silas Lee, a Democratic pollster who worked on the Biden campaign in 2020. You have to manage expectations.?\nAs our colleagues noted in a White House memo this week, Biden is also planning another tried-and-true Washington tactic: distancing himself from Congress.",
    "During a two-hour news conference, he defended his record but also took repeated bites of humble pie:\nI know there's a lot of frustration and fatigue in this country.?\nI call it a job not yet finished.?\nLook, we're not there yet, but we will get there.?\nI understand the overwhelming frustration, fear and concern with regard to inflation and Covid.",
    "A recent fund-raising email from Representative Tim Ryan, a Democrat running for Senate in Ohio, read that Joe Manchin killed Build Back Better? and blamed Sinema's vote against filibuster reform for killing our chance to pass voting rights.? And then it asked for campaign contributions to expand the Democratic majority.",
    "What to read\nIn a first for the Biden administration's new Election Threats Task Force, the Justice Department charged a Texas man with publicly calling for the assassination of Georgia's election officials on the day before the Jan. 6 attack on the Capitol, Reid J. Epstein reports.",
    "And while it might be hard for President Senator? to let go of a place he served for four decades, Democrats told us it's a political necessity:\nHe has vast power in the regulatory, law enforcement and foreign policy realms,? Paul Begala, a Democratic consultant, said.",
    "Here's what Doug had to say about capturing the shot above:\nI stuck around last night outside the White House and took photos of Biden's chief of staff, Ron Klain, as he did a round of interviews on the anniversary of Biden taking office.",
    "He should never go back.?\nAbortion rights groups shift on the filibuster\nIn June, Senator Kyrsten Sinema of Arizona published an Op-Ed in The Washington Post arguing that it would be a mistake for Democrats to ditch the filibuster.",
    "Tim has always been clear that he'll work with anyone, and stand up to anyone  including members of his own party  to make our government work better for working people here in Ohio,? Ryan's spokesperson, Izzi Levy, told us.",
    "That's exactly how we built the Bucks Arena,? he says in the ad, by having 80 percent of the materials come from Wisconsin? and paying higher wages.? For good measure, he adds that he'd finally stand up to China,? too.",
    "The decision to prioritize the goals of his party's activist base over the issues prioritized by voters is more reminiscent of the last half-century of politically unsuccessful Democratic presidents,? he writes.",
    "He can do a lot without Congress.?\nBiden needs to grab control of the conversation by utilizing fully the latent powers of the executive branch,? said Jeff Hauser, director of the Revolving Door Project.",
    "At the time, Sinema was speaking for many in the abortion rights community, which quietly opposed eliminating a tool that could stop federal laws restricting abortion from passing by 51-vote majorities.",
    "Biden hits the reset button\nThere's a ritual for unpopular presidents that goes something like this: Trudge out in front of the White House press corps and let reporters bat you around for a while.",
    "Ryan is the clear front-runner for the Democratic nomination  he doesn't need to prove his progressive bona fides to win a primary before launching into a more centrist statewide campaign.",
    "To varying degrees, Emily's List, NARAL, Planned Parenthood and the Center for Reproductive Rights all said they supported changing the filibuster to pass voting rights legislation.",
    "The spot, by Alex Lasry, a Milwaukee Bucks executive, doesn't shy away from the economic problems pulling down Biden's poll numbers: supply-chain shortages and surging inflation.",
    "The subtext of his pitch seems to be that he's the one who can win over voters who have soured on Biden  a bold move since midterms tend to be a referendum on the party in power.",
    "Candidates in the year's marquee races for governor flaunted big fund-raising numbers, while Democrats running in primaries for congressional seats edged away from Washington.",
    "Governors' Races: Georgia's race will be at the center of the political universe this year, but there are several important contests across the country.",
    "He's a creature of the Senate and he needs to leave the Senate behind,? said John Morgan, a Florida trial lawyer and a top donor to Biden.",
    "What if, she asked, Republicans defunded women's reproductive health services?  e.g., Planned Parenthood  once they took back the Senate?",
    "In the House: Republicans are already poised to capture enough seats to take control, thanks to redistricting and gerrymandering alone.",
    "Lasry calls for keeping manufacturing jobs in the United States, a proposal in keeping with the state's long tradition of populism.",
    "Things got so heated that House Speaker Nancy Pelosi had to remind her unruly caucus members to be respectful? of their colleagues.",
    "And, perhaps most importantly, the White House overhauled its political strategy as the president marked his first year in office.",
    "Klain, a backstage operator so powerful that some aides jokingly refer to him as the prime minister,? is someone we rarely see.",
    "This week, President Biden, polling in the low 40s and stymied on Capitol Hill, followed the script more faithfully than most.",
    "Midterm Elections\nIn the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "This week, in a striking shift, several powerful abortion rights groups loudly rejected Sinema's argument.",
    "Their voting rights bills ran into a wall in the Senate, provoking angry sniping within their own ranks.",
    "Key Issues: Both parties are preparing for abortion rights and voting rights to be defining topics.",
    "I've made many mistakes, I'm sure.?\nAnother way to read Biden's remarks: a plea for patience.",
    "He almost never goes to White House events, and if he does, he's always wearing a mask.",
    "Lasry is one of four Democrats leading the primary field, which also includes Lt. Gov.",
    "Maybe you have a plan to turn things around, to get out of the Washington bubble.",
    "What's new is that Democratic candidates in red states are following suit.",
    "Elsewhere, the contours of the 2022 midterms grew more clearly defined.",
    "Tell them you're aware of the discontent throughout the country.",
    "That you aren't satisfied with the way things are going either.",
    "Maybe you just need to explain your policies better.",
    "Maybe you've been consulting with outside advisers.",
    "It was another difficult stretch for Democrats.",
    "Is there anything you think we're missing?",
    "I get it.?\nA Look Ahead to the 2022 U.S.",
    "Joe Biden is no F.D.R., Nate Cohn says.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "We'd love to hear from you.",
    "Here are 10 races to watch.",
    "But it's not just Ryan.",
    "That you get it.",
    "Mandela Barnes."
  ]
}