{
  "id": 2407,
  "mediaId": 43,
  "date": "1/20/2022 12:00:00 AM",
  "headline": "Morning Digest: Republican launches rematch for governor in Connecticut after close 2018 race",
  "image": "https://images.dailykos.com/images/1028482/story_image/AP22019525428943.jpg?1642635872",
  "link": "https://www.dailykos.com/story/2022/1/20/2075645/-Morning-Digest-Republican-launches-rematch-for-governor-in-Connecticut-after-close-2018-race",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    681,
    741,
    1299,
    1454,
    1670,
    1686,
    1703,
    2039,
    428,
    2626
  ],
  "sentences": [
    "Country * Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cabo Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Cte d'Ivoire Croatia Cuba Curaao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Runion Romania Russian Federation Rwanda Saint Barthlemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia ZimbabweUnited States\nAttribution: Stephen Wolf / Daniel Donner\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "4Q Fundraising\nWI-Sen: Mandela Barnes (D): $1.2 million raised\nAR-Gov: Sarah Huckabee Sanders (R): $1.6 million raised, $7 million cash-on-hand\nMD-Gov: Kelly Schulz (R): $1.5 million raised (in 2021), $1.1 million cash-on-hand\nMN-Gov: Michelle Benson (R): $213,000 raised (in four months)\nNY-Gov: Jumaane Williams (D): $222,000 (since November)\nRI-Gov: Helena Foulkes (D): $965,000 raised, additional $100,000 self-funded, $830,000 cash-on-hand\nSenate\n? OH-Sen: It seems to be internal polling release season for Ohio's Republican Senate candidates, as businessman Bernie Moreno has dropped new numbers from Chip Englander and Kellyanne Conway (yes, that Kellyanne Conway) to argue that his $4 million ad campaign has helped him gain ground ahead of the May primary.",
    "Sabina Matos\nState Rep. Teresa Tanzi\nFormer state Rep. Stephen Ucci\nNational Education Association of Rhode Island executive director Robert Walsh\nMany more Democrats have been mentioned as possibilities:\nBiden admin official Gabe Amo\nProvidence Mayor Jorge Elorza\nProvidence City Council President John Igliozzi\nState Senate Majority Leader Michael McCaffrey\nFormer Cranston Mayor Michael Napolitano\nFormer state party chair Ed Pacheco\nDNC member Liz Beretta-Perik\nState House Speaker Joe Shekarchi\nMcGowan suggests that Shekarchi is the big name to watch, writing, \"We won't know very much about this race until the state's most powerful politician decides his political future.\"",
    "Under the state constitution, the court must file a final plan with the secretary of state by Feb. 15.\n? KS Redistricting: Kansas Republicans released four proposed congressional maps on Tuesday, one of which would undermine Democratic Rep. Sharice Davids' chances of re-election in the 3rd District by carving up the blue-trending Kansas City area and placing half of it in the much more conservative 2nd.",
    "On the Republican side, state Rep. Anthony Sabatini, a far-right bomb thrower who launched a bid against Murphy well before she retired, said that, while he wouldn't commit to running in any specific constituency before redistricting was done, \"I do know my strong plan now, no matter what it looks like, is to run for the seat that's dominantly Seminole County.\"",
    "? AZ Redistricting: What was supposed to be a final meeting of Arizona's Independent Redistricting Commission went off the rails on Tuesday as commissioners unexpectedly changed their votes, accused one another of harboring improper motives, and even disappeared from the proceedings altogether, as Jeremy Duda details in the Arizona Mirror.",
    "Pazniokas also points out that on Tuesday, one day before Stefanowski launched his bid, state budget analysts projected that Connecticut had a $2.2 billion surplus, news that allows the governor to propose tax breaksa welcome change from the previous decade, when Malloy was hammered for twice raising taxes in order to address deficits.",
    "? TX-30: State Rep. Jasmine Crockett, who has the backing of retiring Rep. Eddie Bernice Johnson in this safely blue Dallas seat, has released a Lester & Associates poll of the Democratic primary giving her a 35-11 lead over perennial candidate Barbara Mallory Caraway, with party operative Jane Hope Hamilton all the way back at 3%.",
    "Klarides has yet to officially enter the race, though she's spent heavily on polling and has been publishing anti-Lamont op-eds; the Hartford Courant adds that some party leaders believe that Klarides could be a \"somewhat more moderate candidate appealing to a broader base\" than Stefanowski, who is closer to conservatives.",
    "Opt in to email updates from Daily Kos Elections\nSponsored by: Daily Kos Elections\nTeam Blue lost this post in 1990 when ex-Sen. Lowell Weicker, a former liberal Republican running under the banner of his short-lived A Connecticut Party, narrowly beat Republican John Rowland in a race to replace outgoing Democratic Gov.",
    "Tommy Thompson rather unexpectedly didn't rule out seeking the Republican nomination to reclaim the job he gave up in 2001 last week, but if he were to run and win, the University of Minnesota's Eric Ostermeier reports that the nearly 22-year gap between Thompson's tenures would be the sixth-largest in American history.",
    "Meanwhile, in the Republican Senate primary, businessman Jeff Bartos' allies at Jobs for Our Future PAC have launched a commercial declaring that two of his intra-party foes, hedge fund manager David McCormick and TV personality Mehmet Oz, are \"[o]ut of state politicians\" who want to \"buy a U.S. Senate seat.\"",
    "House\n? CA-13: A consultant for Democratic state Sen. Anna Caballero didn't rule out the idea that Caballero could enter the top-two primary for the new (and newly open) 13th District, adding that the state senator \"thinks this is [a] historic opportunity for a Latina to represent the Central Valley.\"",
    "Mayors\n? Milwaukee, WI Mayor: Acting Milwaukee Mayor Cavalier Johnson has unveiled a Global Strategy Group poll that shows him leading a fellow Democrat, state Sen. Lena Taylor, 25-18 in the Feb. 15 nonpartisan primary, with 14% going to the only conservative in the field, former Alderman Bob Donovan.",
    "Leading Off\n? CT-Gov: Wealthy businessman Bob Stefanowski, a Connecticut Republican who lost the 2018 gubernatorial race 49-46 to Democrat Ned Lamont, announced Wednesday that he was launching his long-awaited bid for a rematch and had made an \"initial investment of $10 million\" into his new campaign.",
    "? RI-02: While Democratic Rep. Jim Langevin's Tuesday retirement announcement caught almost everyone by surprise, we already have such a long list of potential successors that the Boston Globe's Dan McGowan titled his column, \"Everyone you know wants to replace Jim Langevin in Congress.\"",
    "? MD-Gov: State Comptroller Peter Franchot has publicized internal numbers from Tidemore Public Affairs that give him a 23-16 lead over former Prince George's County Executive Rushern Baker in the packed June Democratic primary for this open seat, with author Wes Moore in third at 10%.",
    "Morgan, who lost the 2018 primary for governor 56-40, made news for all the wrong reasons last month when she tweeted that a \"black friend\" had become \"hostile and unpleasant\" to herdue to critical race theory, of courseadding, \"I am sure I didn't do anything to her, except be white.\"",
    "The boundaries of the 6th District, which includes Northern Middlesex County and the northern Jersey Shore, didn't change much in redistricting, but it did become slightly bluer: Under the old lines, it voted for Joe Biden 57-42, but the new version would have gone for Biden 59-40.",
    "Malloy ultimately retired in the 2018 cycle with wretched poll numbers due in large part to a widespread perception that Connecticut hadn't recovered from the Great Recession as well as its neighbors had, but even with Donald Trump dragging the GOP ticket down, Democrats struggled.",
    "Connecticut Republican Bob Stefanowski\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "? CT Redistricting: Nathaniel Persily, the special master assisting the Connecticut Supreme Court in redrawing the state's congressional districts, submitted a map on Tuesday that would make minimal changes to existing lines in order to equalize population between seats.",
    "? NJ-06: Monmouth County Commissioner Sue Kiley announced Tuesday that she would seek the Republican nomination to take on Democratic Rep. Frank Pallone, an 18-term incumbent and House Energy and Commerce Committee chair who has won re-election easily for decades.",
    "The only general election numbers we've seen so far came from a late October Public Policy Polling survey for the pro-charter schools group Democrats for Education Reform that showed Lamont decisively beating Klarides and Stefanowski 52-32 and 52-36, respectively.",
    "? VA-10: Businessman Caleb Max, who is a grandson of former 17-term Rep. Frank Wolf, has decided to test just how blue Northern Virginia's 10th Congressional District has become by launching a bid for the GOP nod to take on Democratic Rep. Jennifer Wexton.",
    "? MA-Gov: An unnamed \"confidant\" of Attorney General Maura Healey tells Boston Globe columnist Scot Lehigh that \"[s]he has made up her mind\" to seek the Democratic nomination for governor, adding, \"Now it's just a matter of hitting the launch button.\"",
    "Amusingly, the Indy notes that Lombardo had touted his haul last week as \"more than any Democrat or Republican candidate in Nevada history has ever raised in a non-election year,\" a statement that Sisolak's own fundraising quickly rendered obsolete.",
    "? MD Redistricting: A committee in Maryland's Democratic-run state Senate has approved a new map for its own districts on a party-line vote, with a vote before the full chamber \"likely by the end of the week,\" according to the Baltimore Sun.",
    "? PA-Sen, PA-02: Democratic state Sen. Sharif Street said Wednesday that he wouldn't run for Pennsylvania's open U.S. Senate seat despite setting up an exploratory committee back in April, but this may not be the last we've heard from him.",
    "Lamont ended up winning another close election, a victory that the CT Mirror's Pazniokas points out was \"the first time in more than a century that a politician was able to succeed a member of his own party in an open race for governor.\"",
    "Tuesday's meeting was ostensibly for the purpose of certifying those tweaks, but one Democratic commissioner, Shereen Lerner, announced that she'd \"made an error\" in backing the congressional map in December \"[d]espite my misgivings.\"",
    "Mandel's allies at the Club for Growth quickly fired back with a WPA Intelligence internal showing him beating Timken 26-15, though even these figures still represented a big decline for Mandel from an earlier Club poll in September.",
    "The record is likely to remain for quite some time, however, with West Virginia's Cecil Underwood, a Republican who won his state's top job in 1956, lost re-election in 1960, and eventually took the post back 36 years later in 1996.",
    "The third-place spot belongs to California Democrat Jerry Brown, who saw 28 years pass between when he gave up the governorship to unsuccessfully run for the Senate in 1982 and when he regained the office after the 2010 elections.",
    "? FL-07: State Rep. Joy Goff-Marcil didn't rule out the idea of running to succeed retiring Rep. Stephanie Murphy, a fellow Democrat, merely telling the Orlando Sentinel, \"My focus right now is on the current legislative session.\"",
    "Doherty ran for the neighboring 1st District as a Republican in 2012 and lost that closely-watched race 53-41 to Democratic Rep. David Cicilline, but he registered as an independent two years later and became a Democrat in 2015.",
    "For the new districts to take effect immediately, lawmakers would have to attach an \"emergency clause\" to the legislation; without that, they can't come into force until 90 days after the current legislative session ends in May.",
    "Party leaders in the House have resisted the idealikely because Republican incumbents don't want to see their districts change dramaticallyprompting 16 GOP dissenters to vote against the 6-2 approach, along with every Democrat.",
    "The plan's key aim is to split the city of Nashville, which is currently based in the Democratic-held 5th District, between three seats in order to dilute the influence of Democratic voters and elect an additional Republican.",
    "North Las Vegas Mayor John Lee, who defected from the Democratic Party just ahead of his entry into the GOP primary last year, raised $600,000, loaned himself another $1 million, and had just shy of $800,000 in the bank.",
    "As a backdrop, Arizona Democrats had reacted angrily to the initial vote approving the new congressional map, which could transform the party's 5-4 edge in the state's House delegation into a 6-3 advantage for the GOP.",
    "Those sentiments may help explain why Lerner and the other Democrat on the board, Derrick Watchman, then voted against the map on Tuesday despite supporting virtually the exact same boundaries just a few weeks earlier.",
    "? WI-Sen: Milwaukee Bucks executive Alex Lasry has launched what his campaign says is a seven-figure ad buy well ahead of the August Democratic primary, which makes these his first commercials in more than two months.",
    "Last month, he proposed a GOP-friendly congressional map with a Republican colleague that would have created a new open seat based in Philadelphia custom-made for Street by weakening Democratic Rep. Brendan Boyle.",
    "Republicans explicitly ran on a promise to target Davids in 2020 as part of a successful defense of their two-thirds supermajorities in the legislature, which would allow them to override a veto by Democratic Gov.",
    "Lerner rejected the accusation and in turn alleged that GOP commissioner David Mehl acted to aid Republican legislators, in violation of a constitutional prohibition on taking into account where incumbents live.",
    "Surprisingly, former Sen. Dean Heller raised just $374,000 from donors, transferred an additional $176,000 from his old federal account, self-funded another $100,000, and ended 2021 with only $265,000 to spend.",
    "However, state House Minority Leader Crystal Quade has suggested Democrats won't ask for concessions in redistricting but would instead press for unrelated demands, such as full funding for Medicaid expansion.",
    "Dan Malloy, who beat none other than Lamont in the primary, ultimately pulled off a close 50-49 win against wealthy Republican Tom Foley, which made him the state's first Democratic governor in two decades.",
    "The plan would maintain the GOP's existing 6-2 advantage in the state's House delegation while also shoring up Rep. Ann Wagner's 2nd District, which was the site of a hotly contested election in 2020.",
    "Moreno dropped these numbers a little more than a week after Timken publicized a Moore Information poll showing Mandel edging her out just 18-16, with Gibbons and Moreno at 14% and 9%, respectively.",
    "Last month, all five members of the panel voted in favor of a new congressional map, opening a period of review for local election officials to propose minor administrative adjustments to the lines.",
    "Schroder, who won his current post by beating two other Republicans in a 2017 special election, will almost certainly end up facing very tough intra-party opposition in next year's contest, though.",
    "Political observers had expected this development for some time, in part because Ricketts has a famously terrible relationship with another candidate, Trump-backed agribusinessman Charles Herbster.",
    "That about-face infuriated Republican commissioners as well as the commission's independent chair, Erika Neuberg, who charged, \"Someone was directing you then and someone is directing you now.\"",
    "The Republican launched his second campaign by once again arguing that Connecticut had become unaffordable under Democratic rule, though as Pazniokas notes, plenty else has changed since 2018.",
    "Paul LePage, $1 million to $900,000 during the second half of 2021, but thanks to a head-start in launching her campaign, Mills enjoys a much wider $1.3 million to $600,000 cash-on-hand lead.",
    "Rebecca Kleefisch has dropped a Tarrance Group poll ahead of businessman Kevin Nicholson's anticipated campaign launch that shows her destroying him 61-8 in the August Republican primary.",
    "The map also faces a rocky future in the Senate, which is already bitterly divided between GOP leaders and far-right extremists, since hardliners in the upper chamber also want a 7-1 map.",
    "Venture capitalist Guy Nohra, meanwhile, took in $1.3 million, though it's not clear how much the candidate, who previously pledged to self-fund at least $1 million, raised from donors.",
    "Steve Sisolak's $4.5 million haul allowed him to end the year with an $8.3 million war chest, which gives him access to more money than all of his many Republican foes put together.",
    "The survey gives former state Treasurer Josh Mandel a 20-18 lead over former state party chair Jane Timken, with Moreno, fellow self-funder Mike Gibbons, and venture capitalist J.D.",
    "2020 nominee Bob Lancia was already running again before Langevin called it a career, but the former state representative's 58-42 defeat doesn't seem to have left anyone impressed.",
    "While those boundaries have almost no chance of being implemented, Street this week did not rule out a House bid and made it clear he was keeping his exploratory committee around.",
    "That's because, while Connecticut has been reliably blue in federal elections for some time, voters here have been far more reticent about electing Democrats to the top state job.",
    "We'll start with the Democratic side, where former Rhode Island State Police Superintendent Brendan Doherty and state Sen. Joshua Miller have both publicly expressed interest.",
    "McGowan reports that former Warwick Mayor Scott Avedisian, whom he describes as someone who \"has watched his party move far to the right without him,\" is thinking about it.",
    "? TN Redistricting: A committee in Tennessee's Republican-run Senate has approved a new congressional map very similar to one that a House committee recently signed off on.",
    "However, extremists in the Republican caucus are demanding a map that would lock in a 7-1 GOP edge by splitting up the Democratic-held 5th District in the Kansas City area.",
    "Democrats finally got an opening in 2010 when Rell decided not to run again, but the GOP wave and the incumbent's enduring popularity made this anything but an easy pickup.",
    "The Republicans who are the subject of the most speculation, though, are state Rep. Barbara Ann Fenton-Fung and her husband, two-time GOP gubernatorial nominee Allan Fung.",
    "? SC Redistricting: A committee in South Carolina's Republican-run state Senate has approved a new congressional map similar to the one the state House passed last week.",
    "That haul was little better than the $325,000 that little-noticed attorney Joey Gilbert brought in, though at least Heller's war chest dwarfed the $65,000 Gilbert had.",
    "Elizabeth Roberts; former Providence Mayor Angel Taveras; TV anchor Gene Valicenti; and Secretary of State Nellie Gorbea, who is continuing her campaign for governor.",
    "The GOP list is unsurprisingly much shorter, though some Republicans hope they can still put what is currently a 56-43 Biden seat in play with the right candidate.",
    "Nutmeg State Democrats, though, will want to see much more before they can feel at all comfortable given how difficult it's been for the party to hold this office.",
    "Stefanowski and his allies did all they could to tie Lamont to the outgoing governor, though Democrats didn't let voters forget that Trump had backed Stefanowski.",
    "As a result, the commission could not certify both maps and transmit them to Secretary of State Katie Hobbs, the step that would make the new districts official.",
    "Wolf easily won his final term in 2012 as Mitt Romney was narrowly taking the old version of the 10th, but the area swung hard to the left during the Trump era.",
    "Lamont, for his part, self-funded almost his entire effort last time, and the CT Mirror's Mark Pazniokas reports the incumbent \"plans to do so again this year.\"",
    "? MO Redistricting: Missouri's Republican-run state House approved a new congressional map on Wednesday, but some major hurdles loom before it can be enacted.",
    "Politico notes that Caballero currently is involved in an incumbent vs. incumbent battle against fellow Democrat Melissa Hurtado brought on by redistricting.",
    "Stefanowski, though, is betting that things will be different now that Trump isn't in the White House and Joe Biden is facing rough poll numbers nationwide.",
    "Governors\n? LA-Gov: Republican state Treasurer John Schroder became the first major candidate to enter the 2023 all-party primary to succeed Democratic Gov.",
    "Weicker left after one term, but this time, Rowland prevailed in a tight race to succeed him before winning lopsided re-election campaigns in 1998 and 2002.",
    "Before Stefanowski can focus on taking on Lamont, though, he may need to get past former state House Minority Leader Themis Klarides in the August primary.",
    "The new 10th would have backed Joe Biden 58-40, which makes it just a smidge redder than his 59-40 performance in the old version of the district.",
    "The memo also references an unreleased month-old poll that had Moreno in sixth, attributing his gains to his commercials making him better known.",
    "Redistricting\nStay on top of the map-making process in all 50 states by bookmarking our invaluable redistricting timeline tracker, updated daily.",
    "However, without any explanation, Neuberg was no longer in attendance at that point, prompting the panel to adjourn without voting on that plan.",
    "? NY-24: Onondaga County Executive Ryan McMahon said this week that he would not run to succeed his fellow Republican, retiring Rep. John Katko.",
    "The top fundraiser ahead of the June GOP primary was Clark County Sheriff Joe Lombardo, who took in $3.1 million and had $2.65 million on-hand.",
    "Republicans will therefore likely need Democratic support to approve an emergency clause, giving the often powerless minority unusual leverage.",
    "This is the first poll we've seen since September, when a Moore survey showed Franchot with a similar 17-12 lead over Baker and Moore with 7%.",
    "Pete Ricketts on Tuesday endorsed Jim Pillen, a University of Nebraska regent and pig farmer, in the May Republican primary to succeed him.",
    "Earlier in the month, she'd claimed for the first time that the plan ran afoul of the state constitutiontwo weeks after voting for it.",
    "Malloy then won a rematch against Foley four years later by a slightly wider 51-48 margin during another strong cycle for the GOP.",
    "No Connecticut governor has lost re-election since 1954, when Democrat Abraham Ribicoff narrowly dispatched Republican John Lodge.",
    "It may take some time for things to shake out, because Rhode Island's late June filing deadline is one of the last in the nation.",
    "However, an attempt to add an emergency clause to the new map failed on Wednesday, mustering only 95 of the necessary 109 votes.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Billy Nungesser and Attorney General Jeff Landry will run, and other Republicans have also shown some interest in this contest.",
    "Las Vegas City Councilwoman Michele Fiore brought in $700,000, though she has yet to reveal how much she still has available.",
    "The runner-up is Kentucky Democrat James McCreary, who was first elected governor in 1875 and won his second term in 1911.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "GoLocalProv, meanwhile, asked state Rep. Patricia Morgan if she was considering, to which she merely responded, \"Maybe.\"",
    "State House Minority Leader Blake Filippi has also been name-dropped, though he recently turned down a bid for governor.",
    "The primary will take place in mid-September, which is also well after most states have conducted nominating contests.",
    "With the support of Neuberg and the commission's two Republicans, however, the final proposal passed on a 3-2 vote.",
    "Both plans would make the state's only competitive seat, GOP Rep. Nancy Mace's 1st District, significantly redder.",
    "? NV-Gov: The Nevada Independent has rounded up campaign finance reports covering all of 2021, and Democratic Gov.",
    "Neither has publicly said anything yet, though, and Fung reportedly has been planning to run for state treasurer.",
    "The spots (here, here, and here) promote Lasry as a progressive businessman and highlight his ties to the Bucks.",
    "? ME-Gov: Democratic incumbent Janet Mills narrowly outraised her all-but-certain Republican foe, former Gov.",
    "The state, he writes, is \"still struggling for economic growth but not facing an immediate fiscal crisis.\"",
    "John Bel Edwards, who cannot run again because of term limits, kicking off his campaign on Wednesday.",
    "The full Senate could vote on the map on Thursday, with the House reportedly set to do so on Monday.",
    "Jodi Rell, who ascended to the governorship, pulled off a landslide win of her own two years later.",
    "The narrator goes on to praise Bartos' local roots, business background, and conservative views.",
    "That would be after the scheduled Aug. 2 primary, and long after the candidate filing deadline.",
    "Kay Orr, whose single term from 1987 to 1991 makes her the only woman to lead Nebraska to date.",
    "Sabatini continued, \"And if it gives the Democrats an advantage built in, I'm fine with that.",
    "Candidates need to win a majority of the vote on March 1 in order to avert a May runoff.",
    "After a recess, the commission reconvened to consider the state's new legislative map.",
    "(In December, Neuberg and the Republicans voted for the map, with Democrats opposed.)",
    "The two candidates with the most votes will face off in the April 5 general election.",
    "Several others also haven't ruled anything out:\n2020 candidate Dylan Conley\nLt. Gov.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Rowland resigned in disgrace in 2004 amidst a corruption scandal, but GOP Lt. Gov.",
    "2014 gubernatorial candidate Ken Block, meanwhile, quickly shot down the idea.",
    "Lehigh himself adds that Healey's kickoff could come \"as soon as this week.\"",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "(McCreary in between served in both the U.S. House and Senate.)",
    "Get the Daily Kos Elections Morning Digest over email\n Sign up!",
    "Because it's going to be a very strong year for Republicans.\"",
    "McGowan adds that state Sen. Sam Bell is also considering.",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "The New Jersey Globe also says that Democratic Gov.",
    "State politicos have long anticipated that Lt. Gov.",
    "The panel has not yet said when it will meet again.",
    "Phil Murphy won 53% last year in the new 6th.",
    "Pillen also has the support of former Gov.",
    "(Mehl of course denied those accusations.)",
    "Vance all tied for third with 10% each.",
    "In the \"no\" column are former Lt. Gov.",
    "This is a short blurb about Daily Kos.",
    "? Governors: Former Wisconsin Gov.",
    "That's not the only issue, though.",
    "You may unsubscribe at any time.",
    "The filing deadline is in June.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Here's our privacy policy.",
    "Want to keep it that way?",
    "? NE-Gov: Termed-out Gov.",
    "? WI-Gov: Former Lt. Gov.",
    "Daily Kos is different.",
    "William O'Neill.",
    "Please read it.",
    "Laura Kelly.",
    "Sign up!"
  ]
}