{
  "id": 2410,
  "mediaId": 43,
  "date": "1/19/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 1/19",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/1/19/2074686/-Daily-Kos-Elections-Live-Digest-1-19",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Wednesday, Jan 19, 2022  8:32:46 AM Pacific Standard Time  Jeff Singer\nMA-Gov: An unnamed confidant? to Attorney General Maura Healey tells Boston Globe columnist Scot Lehigh that [s]he has made up her mind? to seek the Democratic nomination for governor, adding, Now it's just a matter of hitting the launch button.? Lehigh himself adds that Healey's kickoff could come as soon as this week.?\n Wednesday, Jan 19, 2022  8:37:42 AM Pacific Standard Time  Jeff Singer\nMD-Gov: State Comptroller Peter Franchot has publicized internal numbers from Tidemore Public Affairs that give him a 23-16 lead over former Prince George's County Executive Rushern Baker in the packed June Democratic primary for this open seat, with author Wes Moore in third with 10%.",
    "Meanwhile in the Republican Senate primary, real estate businessman Jeff Bartos' allies at Jobs for Our Future PAC have launched a commercial declaring that two of his intra-party foes, hedge fund manager David McCormick and TV personality Mehmet Oz, are [o]ut of state politicians? who want to buy a U.S. Senate seat.? The narrator goes on to praise Bartos' local roots, business background, and conservative views.",
    "Wednesday, Jan 19, 2022  10:17:05 AM Pacific Standard Time  David Nir\nAZ Redistricting: What was supposed to be a final meeting of Arizona's Independent Redistricting Commission went off the rails on Tuesday as commissioners unexpectedly changed their votes, accused one another of harboring improper motives, and even disappeared from the proceedings altogether, as Jeremy Duda details in the Arizona Mirror.",
    "Wednesday, Jan 19, 2022  9:24:55 AM Pacific Standard Time  Jeff Singer\nTX-30: State Rep. Jasmine Crockett, who has the backing of retiring Rep. Eddie Bernice Johnson in this safely blue Dallas seat, has released a Lester & Associates Democratic primary poll giving her a 35-11 lead over perennial candidate Barbara Mallory Caraway, with party operative Jane Hope Hamilton all the way back at 3%.",
    "Wednesday, Jan 19, 2022  8:06:03 AM Pacific Standard Time  Jeff Singer\nOH-Sen: It seems to be internal polling release season for Ohio's Republican Senate candidates, as businessman Bernie Moreno has dropped new numbers from Chip Englander and Kellyanne Conway (yes, that Kellyanne Conway) to argue that his $4 million ad campaign has helped him gain ground ahead of the May primary.",
    "Wednesday, Jan 19, 2022  9:35:31 AM Pacific Standard Time  Jeff Singer\nMilwaukee, WI Mayor: Acting Mayor Cavalier Johnson has unveiled a Global Strategy Group poll that shows him leading his fellow Democrat, state Sen. Lena Taylor, 25-18 in the Feb. 15 nonpartisan primary, with 14% going to the only conservative in the field, former Alderman Bob Donovan.",
    "Wednesday, Jan 19, 2022  10:31:20 AM Pacific Standard Time  David Nir\nCT Redistricting: Nathaniel Persily, the special master assisting the Connecticut Supreme Court in redrawing the state's congressional districts, submitted a map on Tuesday that would make minimal changes to existing lines in order to equalize population between seats.",
    "Wednesday, Jan 19, 2022  9:19:13 AM Pacific Standard Time  Jeff Singer\nNJ-06: Monmouth County Commissioner Sue Kiley announced Tuesday that she would seek the Republican nomination to take on Democratic Rep. Frank Pallone, an 18-term incumbent and House Energy & Commerce Committee chair who has won re-election easily for decades.",
    "Wednesday, Jan 19, 2022  9:32:22 AM Pacific Standard Time  Jeff Singer\nVA-10: Businessman Caleb Max, who is a grandson of former 17-term Rep. Frank Wolf, has decided to test just how blue this Northern Virginia constituency has gotten by launching a bid for the GOP nod to take on Democratic Rep. Jennifer Wexton.",
    "Wednesday, Jan 19, 2022  8:16:51 AM Pacific Standard Time  Jeff Singer\nPA-Sen, PA-02: Democratic state Sen. Sharif Street said Wednesday that he wouldn't run for Pennsylvania's open U.S. Senate seat despite setting up an exploratory committee back in April, but this may not be the last we've heard from him.",
    "Tommy Thompson last week didn't rule out seeking the Republican nomination to reclaim the job he gave up in 2001, and the University of Minnesota's Eric Ostermeier says that if Thompson won, the nearly 22-year gap between his gubernatorial tenures would be the sixth-largest in American history.",
    "Wednesday, Jan 19, 2022  8:21:43 AM Pacific Standard Time  Jeff Singer\nWI-Sen: Milwaukee Bucks executive Alex Lasry has launched what his campaign says a seven-figure ad buy well ahead of the August Democratic primary, which makes these his first commercials in more than two months.",
    "The boundaries of the 6th District, which includes Northern Middlesex County and the northern Jersey Shore, didn't change much in redistricting, but it did become slightly bluer: Under the old lines, it voted for Joe Biden 57-42, but the new version would have gone for Biden 59-40.",
    "Wednesday, Jan 19, 2022  10:40:04 AM Pacific Standard Time  David Nir\nTN Redistricting: A committee in Tennessee's Republican-run Senate has approved a new congressional map very similar to one that a House committee recently signed off on.",
    "Tuesday's meeting was ostensibly for the purpose of certifying those tweaks, but one Democratic commissioner, Shereen Lerner, announced that she'd \"made an error\" in backing the congressional map in December \"[d]espite my misgivings.\"",
    "The plan's key aim is to split the city of Nashville, which is currently based in the Democratic-held 5th District, between three seats in order to dilute the influence of Democratic voters and elect an additional Republican.",
    "The third place spot belongs to California Democrat Jerry Brown, who saw 28 years pass between when he gave up governorship to unsuccessfully run for the Senate in 1982 and when he regained the office after the 2010 election.",
    "As a backdrop, Arizona Democrats had reacted angrily to the initial vote approving the new congressional map, which could transform the party's 5-4 edge in the state's House delegation into a 6-3 advantage for the GOP.",
    "Those sentiments may help explain why Lerner and the other Democrat on the board, Derrick Watchman, then voted against the map on Tuesday despite supporting virtually the exact same boundaries just a few weeks earlier.",
    "Last month, he unveiled a proposed GOP-friendly congressional map with a Republican colleague that would have created a new and open Philadelphia-based district for Street by weakening Democratic Rep. Brendan Boyle.",
    "Wednesday, Jan 19, 2022  9:21:04 AM Pacific Standard Time  Jeff Singer\nNY-24: Onondaga County Executive Ryan McMahon said this week that he would not run to succeed his fellow Republican, retiring Rep. John Katko.",
    "Lerner rejected the accusation and in turn alleged that GOP commissioner David Mehl acted to aid Republican legislators, in violation of a constitutional prohibition on taking into account where incumbents live.",
    "The record, though, is likely to stay with West Virginia's Cecil Underwood, a Republican who won his state's top job in 1956, lost re-election in 1960, and eventually took the post back 36 years later in 1996.",
    "Moreno dropped these numbers a little more than a week after Timken publicized a Moore Information poll showing Mandel edging her out just 18-16, with Gibbons and Moreno at 14% and 9%, respectively.",
    "Last month, all five members of the panel voted in favor of a new congressional map, opening a period of review for local election officials to propose minor administrative adjustments to the lines.",
    "Political observers had expected this development for some time in part because Ricketts has a famously horrible relationship with another candidate, Trump-backed agribusinessman Charles Herbster.",
    "That about-face infuriated Republican commissioners as well as the commission's independent chair, Erika Neuberg, who charged, \"Someone was directing you then and someone is directing you now.\"",
    "Rebecca Kleefisch has dropped a Tarrance Group poll ahead of businessman Kevin Nicholson's anticipated campaign launch that shows her destroying him 61-8 in the August Republican primary.",
    "Mandel's allies at the Club for Growth quickly fired back with a WPA Intelligence internal showing him beating Timken 26-15, though this still represented a big decline from September.",
    "While those boundaries have almost no chance of being implemented, Street this week did not rule out a House bid and made it clear he was keeping his exploratory committee around.",
    "Wednesday, Jan 19, 2022  8:39:39 AM Pacific Standard Time  Jeff Singer\nME-Gov: Democratic incumbent Janet Mills narrowly outraised her all-but-certain Republican foe, former Gov.",
    "The survey gives former state Treasurer Josh Mandel a 20-18 lead over ex-state party chair Jane Timken, with Moreno, fellow self-funder Mike Gibbons, and venture capitalist J.D.",
    "As a result, the commission could not certify both maps and transmit them to Secretary of State Katie Hobbs, the step that would make the new districts official.",
    "Wolf easily won his final term in 2012 as Mitt Romney was narrowly taking the old version 10th, but this area swung hard to the left during the Trump era.",
    "The memo also references an unreleased month-old poll that had Moreno in sixth, and it attributes his gains to his commercials making him better known.",
    "Paul LePage, $1 million to $900,000 during the second half of 2021, but Mills' head start left her with a $1.3 million to $600,000 cash-on-hand lead.",
    "The new 10th would have backed Joe Biden 58-40, which makes it just a smidge redder than his 59-40 performance in the old version of the district.",
    "However, without any explanation, Neuberg was no longer in attendance at that point, prompting the panel to adjourn without voting on that plan.",
    "Daily Kos is the country's largest progressive, independent news outletfree from corporate sponsorship and the agendas of billionaire backers.",
    "This is the first poll we've seen since September, when a Moore survey showed Franchot with a similar 17-12 lead over Baker with Moore at 7%.",
    "Pete Ricketts on Tuesday endorsed Jim Pillen, a University of Nebraska regent and pig farmer, in the May Republican primary to succeed him.",
    "Earlier in the month, she'd claimed for the first time that the plan ran afoul of the state constitutiontwo weeks after voting for it.",
    "We rely on readers and activists like you to make ends meet and every contributionno matter how big or smallhelps us keep fighting.",
    "The runner up is Kentucky Democrat James McCreary, who was first elected governor in 1875 and won his second term in 1911.",
    "With the support of Neuberg and the commission's two Republicans, however, the final proposal passed on a 3-2 vote.",
    "The spots (here, here, and here) promote Lasry as a progressive businessman and highlight his ties to the Bucks.",
    "Wednesday, Jan 19, 2022  9:10:21 AM Pacific Standard Time  Jeff Singer\nGovernors: Former Wisconsin Gov.",
    "Under the state constitution, the court must file a final plan with the secretary of state by Feb. 15.",
    "The full Senate could vote on the map on Thursday, with the House reportedly to do so on Monday.",
    "Kay Orr, whose single term from 1987 to 1991 makes her the only woman to lead Nebraska so far.",
    "Wednesday, Jan 19, 2022  8:52:42 AM Pacific Standard Time  Jeff Singer\nWI-Gov: Former Lt. Gov.",
    "Wednesday, Jan 19, 2022  8:50:15 AM Pacific Standard Time  Jeff Singer\nNE-Gov: Termed-out Gov.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "Sign up here to receive the Daily Kos Elections Morning Digest in your inbox each weekday.",
    "Candidates need to win a majority of the vote on March 1 in order to avert a May runoff.",
    "After a recess, the commission reconvened to consider the state's new legislative map.",
    "The two candidates with the most votes will face off in the April 5 general election.",
    "(In December, Neuberg and the Republicans voted for the map, with Democrats opposed.)",
    "Can you support Daily Kos with a contribution of $3 today?",
    "(McCreary in between served in the U.S. House and Senate.)",
    "The New Jersey Globe also says that Democratic Gov.",
    "It's also a place to discuss elections, not policy.",
    "The panel has not yet said when it will meet again.",
    "Phil Murphy won 53% last year in the new 6th.",
    "Pillen also has the support of former Gov.",
    "(Mehl of course denied those accusations.)",
    "Daily Kos relies on readers like you.",
    "Vance tied for third with 10% each.",
    "Donate $3\nDonate $5 monthly"
  ]
}