{
  "id": 2415,
  "mediaId": 238,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "The Trailer: San Francisco's school board recalls are tearing Democrats apart",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/01/11/trailer-san-franciscos-school-board-recalls-are-tearing-democrats-apart/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    741
  ],
  "sentences": [
    "Social distancing in public spaces\nSupport: 65%\nOppose: 32%\nRequiring masks in public spaces\nSupport: 54%\nOppose: 41%\nRequiring booster shots in the next 90 days\nSupport: 43%\nOppose: 53%\nRequiring vaccine cards in public spaces\nSupport: 42%\nOppose: 55%\nShifting schools to remote learning\nSupport: 30%\nOppose: 66%\nA worldwide shutdown for six weeks\nSupport: 22%\nOppose: 73%\nThe current political fight over pandemic health restrictions is largely about two issues  the Biden administration's vaccination mandate for large employers, and demands by some teachers unions (in Chicago and elsewhere) that schools briefly move back to remote learning.",
    "Rep. Jim Cooper (D), who has been warning Republicans against such a map, called it an insult.? Odessa Kelly, a local organizer backed by Justice Democrats and challenging Cooper from the left, tweeted that the Republican plan amounted to Jim Crow 2.0? and would enforce white supremacy.?\nLate Tuesday afternoon, a three-judge panel ruled against plaintiffs who've sued to change North Carolina's gerrymandered maps, drawn to give Republicans a lopsided advantage in the closely divided state.",
    "As loyal Trailer readers know, the retirement of Rep. David E. Price (D) kicked off a competitive primary, with Durham County Commissioner Nida Allam running to be the state's first Muslim member of Congress, state Sen. Valerie Foushee running to be the Research Triangle's first Black member of Congress and state Sen. Wiley Nickel pitching himself as the field's most effective liberal legislator.",
    "But it'll give us something positive to do with all that anger, so that it gets channeled into something that might make a difference for our kids.?\nAfter their wins in Virginia last year, Republicans and conservative activists around the country have focused intensely on education  from demands for in-person learning to scrutiny of how schools teach about race and sexuality.",
    "Brandee Marckmann, 48, the co-president of San Francisco Berniecrats, chastised Raj and Looijen for appearing on Glenn Beck's radio show to promote the campaign, in a segment about parents successfully pushing back against [an] out-of-control school board.?\nIt's a moderate/conservative power grab,? said Marckmann, whose group is part of the coalition against the recalls.",
    "SAN FRANCISCO  The black and yellow signs were hard to miss, their message spelled out in English and Cantonese: Vote YES to Recall the School Board.? Volunteers with the Chinese American Democratic Club urged shoppers to get registered for the Feb. 15 election, telling them why three members of the city's school board  all Democrats  needed to be removed from office.",
    "It is so important to have leadership that will tackle these challenges head-on, and not get distracted by unnecessary influences or political agendas,? Breed said in her endorsement of the recall campaign, though she herself had appointed Moliga, and he had not joined Collins and Lpez on some of the decisions that recall campaigners are running against.",
    "After the Sun-Sentinel newspaper declined to endorse in the race, citing Cherfilus-McCormick's delay in filing her personal financial disclosure, the Democrat said in a statement that she'd had the ability to fund most of my campaign? by herself, instead of placing the burden on those facing economic challenges? and dealing with the coronavirus.",
    "He just barely passed the line, and if he wasn't a Chinese boy, he'd pass it very easily.?\nNext month's recall elections, the first-ever attempts to remove members of San Francisco's school board, have exposed new, stark political divisions in a city where Joe Biden won 86 percent of the vote, where Vice President Harris and Gov.",
    "I hate to break it to them,? said Gonzalez of the recall's opponents, but this is really more about incompetence than it is about how it fits into some ideological battle over school boards or textbooks or things like that.?\nRaj and Looijen have also kept national politics away from the race, emphasizing their own liberalism.",
    "I'm deeply gratified that our bench in the 7th District is deep and fortunately we have a strong group of leaders who are ready and able to take up that torch.?\nPerlmutter won the old 7th Congressional District in 2006, and the GOP's collapse in Denver's suburbs made it safer for him over the past decade.",
    "Supporters of Collins and the other targeted board members warn that whatever problems parents might have had in 2021, a successful recall would galvanize conservatives across the country  and give momentum to the campaign to recall District Attorney Chesa Boudin, a vote that will unfold in June.",
    "Not for the first time, Hogan's got more support from Democrats (78 percent) than Republicans (69 percent)  Republican voters have backed him overwhelmingly when he's been on the ballot, but Hogan's angered conservative media by criticizing Donald Trump and refusing to vote for him in 2020.",
    "If elected, she'd be Florida's first Haitian American member of Congress, and her strong performance in majority-Haitian parts of the district lifted her in the November primary, with more politically experienced candidates capturing their own bases, if they were lucky, and not much else.",
    "There was this groundswell of anger in the community about closed schools, and we worried that it was going to get turned back on families,? said Autumn Looijen, 44, who launched the recall campaign a year ago with her partner, Siva Raj, 49. We thought, well, a recall might not succeed.",
    "In Tennessee, where Republicans control redistricting, House Speaker Cameron Sexton confirmed Monday that their map will split Nashville into several districts, replacing the safely Democratic 5th Congressional District with at least two seats that could be winnable by the GOP.",
    "That's not how it felt when I ran in 2016.? The reasons he cites for another run are illegal border crossings and crime  including November's tragedy in Waukesha, where a man released weeks earlier on a $1,000 bond is charged with killing six people by driving into a parade.",
    "A year ago, as the recall campaign was getting underway, Collins critics publicized tweets she'd sent after the 2016 election, asking why Asians were not opposing Donald Trump more vocally, using a racial epithet about pliant enslaved people to emphasize the point.",
    "They were running the campaign from an apartment on Haight Street, their hallway loaded up with the Recall the School Board? shopping bags they'd begun handing out to voters, and plotting their strategy in what, when they moved in, they expected would be a bedroom.",
    "They stuck with him after opponents questioned whether his criminal record disqualified him from running; Mariner produced a memo contradicting their reading of Florida law, which is restrictive on what former felons can do, and Democrats didn't pursue it further.",
    "As a new lottery system lowered the number of Asian and White students while admitting more Black and Latino students, alumni joined the effort to recall board President Gabriela Lpez, Vice President Faauuga Moliga and former board vice president Alison Collins.",
    "Just two months after Colorado's redistricting commission drew him into a slightly more competitive seat, Rep. Earl Perlmutter (D) announced his retirement from the House, joining 25 other Democrats who've decided to hang it up or seek higher office this year.",
    "One possible reason: A bipartisan bill that will pay out rebates to people with car insurance is starting to go into effect, and Democrats have put money into TV ads that feature Whitmer herself talking about the checks about to hit Michiganders' mailboxes.",
    "Nashville's Davidson County, which has made up most of the district for decades, gave Biden 65 percent of the vote, but two-thirds of residents are White, meaning that the state does not need to draw a seat that takes minority representation into account.",
    "Former Broward County commissioner Dale Holness filed a lawsuit right after Thanksgiving, asking a judge to void Cherfilus-McCormick's five-vote primary win because, among other arguments, offering voters a $1,000 monthly stimulus amounted to a bribe.",
    "They're making the argument that they believe is going to try to energize a group of voters that may be on the fence,? said Matt Gonzalez, 56, a former city supervisor who narrowly lost a 2003 mayoral race to Newsom as a member of the Green Party.",
    "Annoyance with a campaign to paint over a Depression-era mural with outdated stereotypes is another factor  the board's majority voted to paint over The Life of Washington,? then decided merely to cover it with panels, before the pandemic began.",
    "These people are basically trying to take advantage of parents.?\nIf the recalls succeed, replacements for the ousted candidates will be picked by Mayor London Breed, a Democrat  and a supporter of the effort to remove Collins, Lpez and Moliga.",
    "It's an educational emergency right now.?\nThe dropped lawsuit fit comfortably into the straightforward story told by recall supporters: that the board was more focused on a racial reckoning than on reopening schools or closing its budget gap.",
    "Mariner has talked openly about his past convictions for theft and cocaine possession and his time in jail, and while Palm Beach County transplant Donald Trump ignored the race, Palm Beach County Republicans donated $23,000 to his campaign.",
    "The 20th District, which connects majority-Black cities and towns in western Palm Beach and Broward counties, simply isn't supposed to be competitive, and both major parties saw the November primary as the decisive battle for the seat.",
    "The commission's new map, which irritated Democrats by shoring up Rep. Lauren Boebert (R) while giving the GOP more opportunities in 2022, expanded the district south; with the new precincts, the district backed Biden by 14 points.",
    "Jim Lamon for Senate, Let's Go.? Joe Biden showed up only rarely in Republican advertising last year, in part because the most competitive races were in districts and states that leaned more Democratic than the rest of the country.",
    "He responded to Johnson's announcement with this 97-second digital spot, which begins with the slowly typed news that Johnson is running, and continues with a highlight reel of Johnson's most irritating (to Democrats) quotes.",
    "Lamon, a first-time candidate in Arizona who spent most of the last 15 years in the solar industry, comes out of the gate swinging at Biden, setting up the kicker  Let's go, Brandon?  with a few other let's-go cheers.",
    "Lasry for Wisconsin, We Must Stop Ron Johnson.? Milwaukee Bucks vice president Alex Lasry entered this year with a fundraising lead over his fellow Democratic U.S. Senate candidates, and twice as much money to spend.",
    "Two Democrats have filed so far: former independent Eric Garcia and 2020 nominee Phil Arballo, who's been warning Democratic voters that they could be locked out of the runoff if they don't consolidate their support.",
    "Critics pointed out that Looijen's three children were attending school in another district; she said it became clear just how the board was failing when her kids went back to in-person classes, and Raj's did not.",
    "And everyone, from the recall's proponents to the outspent campaign to protect the three incumbents, agrees that a board vote to replace merit-based admissions at Lowell High School mobilized parents and alumni.",
    "They're expected to appeal to the state Supreme Court, which has a narrow Democratic majority, and which repeatedly ruled against Republican-drawn maps over the last decade  albeit when that majority was larger.",
    "Mask mandates and vaccine card requirements, which actually are in effect in much of the country, are more popular, with 72 percent of Democrats supporting vaccine card checks before people enter public spaces.",
    "None of them, however, dazzled Bush-era America with their cover of Unchained Melody.? Democratic National Committee Chairman Jaime Harrison raised some eyebrows with a tweet welcoming Aiken to the race.",
    "This survey of voter opinions doesn't ask, specifically, about either idea  there's no time frame on the idea of shifting schools to remote learning.?\nBut phrased that way, it's unpopular with everyone.",
    "I don't want Alison Collins and Gabriela Lpez to be the face of the progressive movement.?\nIn Collins's view, defeat next month would obviously fire up a conservative movement that mocks San Francisco.",
    "If the recall succeeds, there'll be some gloating from conservatives; if it fails, a board they don't support will stay intact, and keep galvanizing the people who think San Francisco is ungovernable.",
    "This ad features just one speaking role, for National Border Patrol Council President Brandon Judd, who stands before a section of border fencing and praises the governor's support for border agents.",
    "It wasn't just: Elect me, I've been around for a long time.?\nThere are three more Democratic primaries in South Florida today, all for state legislative seats, thanks to Florida's resign-to-run law.",
    "While the lines aren't finished, splitting the seat could give Republicans control in eight of Tennessee's nine House districts this year, though Biden won 37 percent of the vote here in 2020.",
    "Michigan's Democratic governor was one of the GOP's top targets this year, even before the pandemic  and before the negative attention she got for visiting her father in Florida last March.",
    "Now the chief attorney at the public defender's office, and an artist, Gonzalez said he had begun to question what the board was doing after the debate over destroying the Washington mural.",
    "Cherfilus-McCormick, 42, ran as a supporter of Medicare-for-all, a Green New Deal, a $20 minimum wage and $1,000 permanent recovery checks? for adults making less than $75,000 per year.",
    "Some people file election litigation because they think they're right,? said Mitch Caesar, a former Broward County Democratic Party chair working with the Cherfilus-McCormick campaign.",
    "My priorities have always been reopening schools safely, closing the budget deficit and attracting talent to our districts.?\nAnger at the board has most frequently focused on Collins.",
    "Most established Republicans were sitting out the race so long as Perlmutter was running, and the first candidate to jump in after his announcement was state Sen. Brittany Petterson.",
    "American Idol? runner-up Clay Aiken entered the Democratic primary in the new 6th Congressional District, which is based in Durham and drawn to be safe for any Democratic nominee.",
    "One way to think of the district: If this is the sort of place Democrats can't win this year, Republicans are winning their largest House majority since the early 20th century.",
    "White voters and Republicans are more likely to oppose remote learning, but Black voters, the demographic most supportive of the policy, still oppose it by a four-point margin.",
    "If a candidate secures more than 50 percent of the vote that day  or, more realistically given California's ballot-counting process, a few days later  they'll head to Congress.",
    "Empower Wisconsin, Fire John Chisholm.? Like Johnson's ad, this conservative group's spot features images of the Wisconsin parade killings  it's what the entire ad's about.",
    "Fortenberry has denied any wrongdoing, described the investigation as a political scheme and has yet to draw any Republican primary opponent ahead of the Feb. 15 deadline.",
    "Republicans won't return to their post-2020 strength until April 5, at the earliest, the new date for the special election in California's 22nd Congressional District.",
    "The long, long campaign for Florida's 20th Congressional District comes to an end today, 280 days after the death of Rep. Alcee Hastings (D) created this vacancy.",
    "Sadly, as a Black woman, I am all too familiar with having to prove myself, double, despite my successes, even to those who claim to be without bias,? she added.",
    "That continues here, in the pollster's first look at Hogan since 2020, and as Republicans continue to urge a term-limited Hogan to run for U.S. Senate this year.",
    "Why do we keep electing people to represent us who are out of touch with we, the people?? Mariner told Local 10 News last week, while early voting was underway.",
    "This campaign is different, though opponents see it as a way for moderates and conservatives to take power they haven't won in ordinary school board races.",
    "Two Republicans are running, Fresno County Supervisor Nathan Magsig and former Hill aide Elizabeth Heng, who ran in a neighboring district four years ago.",
    "But the recall campaign has attracted plenty of Democrats, from Breed to a series of Democratic clubs, which see no upside in keeping the board in place.",
    "Legislators who took a gamble on the primary, including onetime House party leader Perry E. Thurston Jr., had to leave office before today's election.",
    "What we're looking at is two to three splits and making sure we satisfy the Voting Rights Act, which we think we have,? Sexton told the Tennessean.",
    "Republicans, who have no bench to speak of in the district, nominated local ad company owner Jason Mariner, 36, to challenge Cherfilus-McCormick.",
    "State Senate President Chuck Morse will seek the GOP's U.S. Senate nomination, the latest wrinkle in a race that changed dramatically after Gov.",
    "Rep. Jeff Fortenberry (R) announced Monday that he'd seek another term, despite his indictment in an investigation into campaign finance fraud.",
    "If elected, he said, he'd oppose whatever form of Build Back Better survived Democratic negotiations, saying its passage would hike inflation.",
    "She's recovered some support since then, especially with independents, who flipped from mostly negative to mostly positive over the holidays.",
    "If you want to keep corrupt politicians from rigging elections, let's go,? Lamon says, over photographs of the president and vice president.",
    "(Her two primary campaigns against Hastings, in 2018 and 2020, had gotten her fairly well known before any other Democrats started running.)",
    "In 15 seconds, the ad explains that Milwaukee District Attorney John Chisholm gave suspect Darrell Brooks a surprisingly low bond, that Gov.",
    "Anger at covid-related school closings is part of it  in-person schooling started up again in August after being closed since March 2020.",
    "In a third, where no Republican filed to run, any registered voter can vote for a Democratic nominee, who'd take office later this year.",
    "All three races brought extra campaigning and turnout to the bottom of the ballot, which hasn't been a factor in the congressional race.",
    "Health-care company CEO Sheila Cherfilus-McCormick (D) has the clear advantage in a district that backed Joe Biden by 55 points in 2020.",
    "As a 501(c)(4), Empower Wisconsin can run political ads if they're informational, highlighting an issue and explaining how to act on it.",
    "This election wasn't about critical race theory, transgender athletes or the other issues being litigated in Republican-run states.",
    "A win for Cherfilus-McCormick would push the Democrats back up to 222 House seats, making it marginally easier to pass legislation.",
    "His grandson, he explained, nearly missed out on a spot at the high school he'd tested into, and the school board was responsible.",
    "Since taking office in January 2015, Maryland's Republican governor has never seen his approval rating drop lower than 67 percent.",
    "Others file frivolous litigation for political reasons.? Holness has already filed to seek the seat again in the August primary.",
    "We had a message that was actually about helping people,? Cherfilus-McCormick said in an interview after clinching the primary.",
    "Cherfilus-McCormick had tougher competition in November, when she fended off a more politically experienced group of Democrats.",
    "When there's this much money behind a special election, it's worth looking at who's behind it,? Collins said in an interview.",
    "It's an opportune moment for folks who want to privatize public education, because right now, teachers are really suffering.",
    "(I'm very sorry that my words were used in a way that was hurtful to a community that was reeling,? she'd later tell KQED.)",
    "Ron Johnson for Senate, Stand and Fight.? In 2010, Wisconsin's Republican senator pledged to serve only two six-year terms.",
    "There comes a time when you pass the torch to the next generation of leaders,? Perlmutter said in his Monday announcement.",
    "(Bolduc, like every candidate Trump has praised since 2020, believes that the presidential election may have been stolen.",
    "Early voting wrapped up Sunday, and registered Democrats cast roughly 77 percent of around 50,000 early and mail ballots.",
    "He doesn't mention the wall sections Abbott is having Texas build, while the president has no interest in adding to it.",
    "No dog in that fight but we need folks to know that Democrats are fighting against fear and fascism.?\nNew Hampshire.",
    "A September survey from the same pollster found Whitmer's numbers falling precipitously from their heights in 2020.",
    "Newsom  millions of dollars, noted Looijen, were spent telling Democrats that recalls were illegitimate by design.",
    "That's not a surprise, given that some liberal cities and counties have already put rules like that into place.",
    "They decided to move back to the city, they said, after celebrating Joe Biden's 2020 victory in the streets.",
    "In 2012, Barack Obama carried it by 15 points; in 2020, Joe Biden swamped Donald Trump there by 23 points.",
    "Facing calls to resign, she responded to the board's decision to demote her with an $87 million lawsuit.",
    "Cherfilus-McCormick won by just five votes, after a recount  and the decisive part of the race was over.",
    "Gavin Newsom (D) began their careers, and where House Speaker Nancy Pelosi (D) carries every precinct.",
    "At the end of 2021, Mariner had just $24,000 left to spend, and Cherfilus-McCormick had $1.3 million.",
    "I've been wanting to run for this seat for a long time,? Petterson told the Colorado Sun on Tuesday.",
    "Greg Abbott (R) is facing multiple challengers on March 1, and early voting starts in a month.",
    "Our country is in trouble, Johnson says, as footage of a burning flag rolls across the screen.",
    "I can see why sleep-deprived people are really easy to co-opt into a parents reopen' movement.",
    "California has seen backlashes like that before, and they've run out of gas in San Francisco.",
    "Chris Sununu (R) opted to run for reelection instead of challenging Sen. Maggie Hassan (D).",
    "I can't speak for the entire school board or our leadership,? Moliga said in an interview.",
    "When I'm looking at this situation, I'm saying: How can progressives support this board?",
    "I've never seen this type of energy and this much money involved in a special election.",
    "Gen. Don Bolduc, who's been praised by Donald Trump but not officially endorsed by him.",
    "Martin Luther King's speech, I believe in that: Don't judge people by race,? he said.",
    "All are from 2020 or 2021, responding to the pandemic or to the Jan. 6 insurrection.",
    "(The last Haitian American to serve in Congress, Utah's Mia Love, was a Republican.)",
    "One month after she dropped it, all three recalls qualified for the Feb. 15 ballot.",
    "In two of those races, Democrats and Republicans will hold their own primaries.",
    "I don't care who wins,? Harrison told one of the critics in a follow-up tweet.",
    "Only about 12 percent of ballots came from registered Republicans.",
    "His third campaign starts by explaining why he broke the pledge.",
    "I've always thought of myself as a progressive,? Looijen said.",
    "(He has less than six weeks to decide, as filing closes Feb.",
    "If not, the top two finishers will head to a June 7 runoff.",
    "It feels like our country is being torn apart,? he says.",
    "Joe Biden isn't protecting America, but Texas and Gov.",
    "Tony Evers (D) could remove him, and that he hasn't.",
    "They'd opposed the 2021 recall attempt against Gov.",
    "But it's not just about keeping the schools open.",
    "Texans for Greg Abbott, Secure Our Border.? Gov.",
    "It's the first real challenge for retired Brig.",
    "Greg Abbott are stepping up,? Judd says.",
    "The low, low bar left behind after 2011.",
    "Yung Chen, 73, was already convinced.",
    "Morse has not said that.)",
    "But it might as well be.",
    "No judge took it up.",
    "North Carolina.",
    "Nebraska.",
    "22.)"
  ]
}