{
  "id": 2416,
  "mediaId": 195,
  "date": "d2022-01-11T13:18",
  "headline": "Booker endorses Mandela Barnes in Wisconsin Senate race",
  "image": "https://cdn.jwplayer.com/v2/media/pmw70L9k/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/589137-booker-endorses-mandela-barnes-in-wisconsin-senate-race",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell",
  "termIds": [
    704,
    741,
    802,
    1333,
    1916,
    1925,
    2039,
    571,
    2972
  ],
  "sentences": [
    "From helping to lead Wisconsin's recovery efforts from the pandemic, championing economic development for rural and urban communities, and bringing people together to find solutions to the climate crisis, Mandela stands up for Wisconsin's working families,? Booker wrote.",
    "An internal poll released by the Barnes campaign on Friday found that the lieutenant governor has a 29-point lead over Milwaukee Bucks executive Alex Lasry and a 30-point lead over Wisconsin Treasurer Sarah Godlewski.",
    "Booker on Tuesday highlighted Barnes's efforts in Wisconsin, touching on his work during the pandemic, helping the economic development in rural and urban communities and addressing climate change.",
    "The winner will likely take on Sen. Ron Johnson (R-Wis.), who announced on Sunday that he will run for reelection after vowing in 2016 to only seek two terms in the upper chamber.",
    "Barnes released his first policy plan last month, which called attention to some progressive proposals including enacting new voting rights legislation and ending the filibuster.",
    "Booker called Barnes a game changer,? adding that he is exactly what working families need in this moment.?\nMandela's story is only possible here in America.",
    "Barnes has emerged as an early front-runner in the crowded primary field, in which 12 Democrats are vying for the party's nomination.",
    "Mandela Barnes (D) for U.S. Senate, throwing his support behind the perceived front-runner in the crowded primary field.",
    "He'll expand opportunities for working people, stand up for good union jobs, and protect the right to vote,? he added.",
    "It shows how hard work, faith, and opportunity can transform a family and a community,? Booker said in a statement.",
    "In the Senate, Mandela will champion opportunity, accountability, and justice, the way he has always done.",
    "Booker is the latest high-profile political figure to formally support Mandela's candidacy.",
    "Twenty-nine percent of those polled, however, say they still remain undecided in the race.",
    "House Majority Whip James Clyburn (D-S.C.) and Sen. Elizabeth Warren (D-Mass.)",
    "Sen. Cory Booker (D-N.J.) on Tuesday endorsed Wisconsin Lt. Gov.",
    "have both endorsed the lieutenant governor."
  ]
}