{
  "id": 2420,
  "mediaId": 112,
  "date": "d2022-01-10T03:13",
  "headline": "Wisconsin Republican Ron Johnson to run for re-election to Senate, reversing self-imposed term-limit vow",
  "image": "https://images.mktw.net/im-280077?width=700&size=1.5005861664712778&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/wisconsin-republican-ron-johnson-to-run-for-re-election-to-senate-reversing-self-imposed-term-limit-vow-01641788003",
  "sentiment": "0.0",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.marketwatch.com/column/associated-press",
  "termIds": [
    741,
    802,
    1112,
    1147,
    1490,
    1568,
    1925,
    2039,
    428,
    571,
    2771,
    2972
  ],
  "sentences": [
    "Why do we assume that the body's natural immune system isn't the marvel that it really is??\nFrom the archives (June 2021): Senate Republican Ron Johnson of Wisconsin is planning an event to publicize adverse vaccine experiences\nJohnson has espoused conspiracy theories related to last year's Capitol raid that attempted to shift blame for what happened away from Trump supporters.",
    "From the archives (March 2021): Wisconsin Republican Ron Johnson's remark about feeling safe in Senate during Capitol riot labeled racist\nRepublican Wisconsin Assembly Speaker Robin Vos told the AP on Friday that there is zero chance? of the legislature taking over the awarding of the state's 10 presidential elector votes in 2024.",
    "Johnson won by nearly 5 points in 2010, his first race for office, and then by just over 3 points in 2016, after polls showed Democrat Russ Feingold, who'd held the seat from 1993 to 2011, leading Johnson through most of the year in his bid to return to the chamber.",
    "From the archives (June 2021): If Sen. Ron Johnson is running for re-election in Wisconsin, it appears he'll do so as a culture warrior\nThe race is sure to be one of the most hotly contested in the country next year in purple Wisconsin.",
    "MADISON, Wis. (AP)  Republican U.S. Sen. Ron Johnson, one of former President Donald Trump's most ardent backers, announced Sunday that he will seek re-election in battleground Wisconsin, breaking his promise not to seek a third term.",
    "Johnson has since downplayed the violence, saying it didn't seem like an armed insurrection to me.?\nJust before the U.S. Capitol was stormed a year ago, Johnson objected to counting the Electoral College votes from Arizona.",
    "His website urges supporters to help Kevin take back Washington.? In a series of tweets Sunday, Nicholson said it was no secret he was mulling a run for governor and would announce a decision soon.",
    "From the archives (August 2020): Wisconsin Republican Ron Johnson on defensive over probe of Biden and Ukraine in wake of intelligence assessment about ongoing Russian election interference",
    "When re-election is not your primary motivation, those are easy promises to keep  and I have faithfully done so.?\nJohnson's opponent won't be known this time until after an Aug. 9 primary.",
    "Mandela Barnes, who is seeking to become the state's first Black senator; Milwaukee Bucks executive Alex Lasry; state Treasurer Sarah Godlewski and Outagamie County Executive Tom Nelson.",
    "The only people celebrating Ron Johnson's announcement are his donors and the corporate special interest groups he's bailed out time and time again,? Barnes said in a statement.",
    "But Johnson rescinded the pledge in the lead-up to announcing his re-election bid, saying circumstances have changed after Democrats won the White House and control of Congress.",
    "Johnson over the past year has been a leading voice in downplaying the Jan. 6, 2021, Capitol riot and the coronavirus pandemic, in addition to remaining a vocal Trump supporter.",
    "Johnson announced his decision via email two days after a pair of Republicans with knowledge of his decision told the Associated Press that he was close to launching a bid.",
    "Johnson, who contracted COVID-19 in October 2020 and reportedly is not vaccinated, has cast doubt over the efficacy of vaccines and pushed for unproven treatments.",
    "No other Senate retirements are likely beyond the five Republicans and one Democrat, Sen. Patrick Leahy of Vermont, who have already announced plans to step down.",
    "Let's get to work and retire this failed senator.?\nBarnes, Godlewski, Nelson and other Democrats faulted Johnson for breaking his promise to serve only two terms.",
    "Kevin Nicholson, a former Marine who ran for U.S. Senate and lost in the GOP primary in 2018, has said he would run for governor if Johnson sought re-election.",
    "Having already experienced a growing level of vitriol and false attacks, I certainly don't expect better treatment in the future,? he said in his announcement.",
    "Much as I'd like to ease into a quiet retirement, I don't feel I should,? Johnson wrote in an op-ed in the Wall Street Journal announcing his re-election bid.",
    "Just last week, Johnson on conservative talk radio said, Why do we think that we can create something better than God in terms of combating disease?",
    "Johnson's announcement that he will run again came a day after Republican Sen. John Thune, of South Dakota, said he would seek a fourth term.",
    "The two have remained close following Trump's defeat, with Trump in April endorsing Johnson for a third term and encouraging him to run.",
    "Last year, he told Republicans who control the Wisconsin state legislature that they should take over control of federal elections.",
    "Johnson, who rose out of the tea-party movement in 2010, has long been aligned with Trump's hardline policies and politics.",
    "Former President Barack Obama's Democratic Party, for example, lost 63 seats in the House and six in the Senate in 2010.",
    "President Joe Biden won the state by fewer than 21,000 votes in 2020 after a similarly narrow win by Trump in 2016.",
    "Johnson, 66, had long said his preference was to serve just two terms and pledged in 2016 not to run a third time.",
    "The party that does not hold the White House generally gains seats in midterm congressional elections.",
    "An extension of that promise is that I don't conduct myself worrying about re-election,? he wrote.",
    "He said the response to the coronavirus pandemic also played a part in his decision to run again.",
    "Earlier this week, former U.S. Rep. Sean Duffy bowed out of running for Senate or governor.",
    "Several high-profile and well-funded Democrats are running, including Lt. Gov.",
    "Johnson's decision also has ripple effects on Wisconsin's governor's race.",
    "Johnson said he did not make the decision to run again lightly.",
    "Johnson said he never voted with re-election in mind.",
    "History is on Johnson's side in the midterm election.",
    "Nicholson had been focused on running for Senate.",
    "MarketWatch contributed."
  ]
}