{
  "id": 2421,
  "mediaId": 43,
  "date": "1/10/2022 12:00:00 AM",
  "headline": "Morning Digest: Why the special election to succeed Devin Nunes could be an orphan race",
  "image": "https://images.dailykos.com/images/1024802/story_image/CA22e.png?1641665686",
  "link": "https://www.dailykos.com/story/2022/1/10/2073477/-Morning-Digest-Why-the-special-election-to-succeed-Devin-Nunes-could-be-an-orphan-race",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1609,
    1609,
    2024,
    2024,
    1454,
    1394,
    1394,
    1445,
    1445,
    1454,
    1211,
    1211,
    1021,
    1021,
    2558,
    2561,
    2561,
    2558
  ],
  "sentences": [
    "Country * Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cabo Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Cte d'Ivoire Croatia Cuba Curaao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Runion Romania Russian Federation Rwanda Saint Barthlemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia ZimbabweUnited States\nAttribution: Stephen Wolf / Daniel Donner\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "4Q Fundraising\nAZ-Sen: Mark Kelly (D-inc): $9 million raised, $18.5 million cash-on-hand\nNH-Sen: Maggie Hassan (D-inc): $3.1 million raised, $5.3 million cash-on-hand\nOH-Sen: Tim Ryan (D): $2.9 million raised, $5 million cash-on-hand\nPA-Sen: Conor Lamb (D): $1.3 million raised, $3 million cash-on-hand\nCA-15: Emily Beach (D): $275,000 raised (in six weeks); Kevin Mullin (D): $247,000 raised (in five weeks)\nTX-30: Abel Mulugheta (D): $250,000 raised (in two months)\nSenate\n? NH-Sen: When asked about his potential bid for the Republican nod Thursday, Londonderry Town Manager Kevin Smith said that \"you can expect some news about a decision on me running next week.\"",
    "While Democrats long ago consolidated behind Attorney General Josh Shapiro, Mastriano joins a GOP field that currently consists of:\n2018 Senate nominee Lou Barletta\nFormer Chester County Chamber of Business and Industry President Guy Ciarrocchi\nState Senate President Pro Tempore Jake Corman\nMontgomery County Commissioner Joe Gale\nGOP strategist Charlie Gerow\nFormer Rep. Melissa Hart\nState Sen. Scott Martin\nFormer U.S. Attorney Bill McSwain\nBusinessman Dave White\nSurgeon Nche Zama\nPennsylvania's filing deadline is about two months away, so this lineup could still expand or contract.",
    "Leading Off\n? CA-05, CA-22 (special): While GOP Rep. Tom McClintock still hasn't said anything publicly about his midterm plans, multiple media outlets have reported that he'll seek re-election in California's new 5th Congressional District, prompting Republican state Sen. Andreas Borgeas to announce that he won't run for the House.",
    "Donald Trump's margin of victory in the new 1st ticked up from 51-47 to 52-46.\n? VA-07: Green Beret veteran Derrick Anderson, a Republican who launched a campaign months before redistricting was complete, has announced that he'll continue his bid against Democratic Rep. Abigail Spanberger in the revamped 7th District.",
    "Three other districts share some DNA with the old 22nd, but they're no better: The new 20th, where House Minority Leader Kevin McCarthy is sure to run for another term, is wildly conservative at 61-36 Trump, while Democratic Rep. Jim Costa has said he'll run in the new 21st, which would have gone for Joe Biden 59-39.",
    "? MI-Gov: A federal judge has dismissed a Republican lawsuit seeking to invalidate a Michigan rule allowing candidates who are the target of recalls to raise unlimited funds from donors, saying that the plaintiffs lacked standing because they failed to show they'd been harmed by the so-called \"recall exception.\"",
    "The U.S. Senate Judiciary went on to issue a report in October recommending that he be further probed for his alleged role in the attempt to steal the election after finding that Mastriano, along with Rep. Scott Perry, pressured the Justice Department to investigate the state's results.",
    "Rather, a big-name Democrat, Assemblyman Rudy Salas, was already running against Valadao, and he'd be difficult to beat in a primary: The old 22nd makes up just 10% of the new 22nd, whereas Salas already represents 51% of the new 22nd in the legislature, according to our calculations.",
    "However, U.S. District Judge Janet Neff, an appointee of George W. Bush, ruled that Republicans were in essence conflating the hypothetical recall elections with the regular quadrennial election, pointing out that the recall committees could have also raised unlimited sums.",
    "? NJ-08: Port Authority Commissioner Robert Menendez Jr. finally confirmed Thursday that he was entering the Democratic primary to succeed retiring Rep. Albio Sires in this 72-28 Biden seat, a declaration that came weeks after he picked up endorsements from Sires, Gov.",
    "At first, an unnamed Trump aide declined to comment on Mastriano's claims to the Associated Press, though another Trump staffer (or possibly the same one) later confirmed to the Philadelphia Inquirer's Jonathan Tamari that a meeting between the two men had occurred.",
    "? FL-28: Both Politico and the National Journal report that former Republican Rep. Dennis Ross would mull a comeback if the new GOP-drawn map creates a new seat in central Florida, though the former item adds that Ross wouldn't take on a Republican incumbent.",
    "All the candidates will compete on one ballot on April 5; if no one earns a majority, the top-two vote-getters, regardless of party, would compete in the June 7 general election that would take place the same day as the regular statewide primary.",
    "? PA-Gov: State Sen. Doug Mastriano, an ardent election denier who was filmed on Jan. 6 apparently passing breached barricades at the Capitol, has at last announced that he's running in the extremely packed May Republican primary for governor.",
    "Speaker Anthony Rendon last month ejected him from the Education Committee, though Rendon's office denied Kiley's claim that the move was meant as retaliation for what the Republican depicted as his fight \"against the corrupt school shutdown.\"",
    "The Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "House\n? CA-03: Assemblyman Kevin Kiley on Thursday became the first notable Republican to announce a bid for the redrawn 3rd District following GV Wire's report that GOP Rep. Tom McClintock would campaign for the new 5th rather than here.",
    "Gretchen Whitmer had taken advantage of the rule to raise roughly $4 million beyond what normal contribution limits would allow because opponents had launched dozens of recall efforts aimed at her, all of which failed to go anywhere.",
    "Mastriano, who is an Army veteran of Iraq and Afghanistan, won a 2019 special election for his current post one year after he took a close fourth place against now-Rep. John Joyce in the primary for the 13th Congressional District.",
    "Kotek made her declaration one day after longtime Senate President Peter Courtney, who has been an obstacle to progressive reforms during his almost two decades in charge, announced that he was retiring from the upper chamber.",
    "In August, after his calls for Pennsylvania to emulate Arizona's infamous \"forensic investigation\" of the 2020 results went nowhere, he appeared on the far-right One America News to trash state Senate leader Jake Corman.",
    "Redistricting\n? KY Redistricting: Kentucky's candidate filing deadline was supposed to be Friday, but with redistricting still incomplete, lawmakers passed a bill a day beforehand to delay the deadline until Jan. 25.",
    "? MI-12: State Rep. Kyra Harris Bolden did not rule out running to succeed her fellow Democrat, retiring Rep. Brenda Lawrence, in an interview with MILive.com, saying she's leaving \"every opportunity on the table.\"",
    "Kiley, who won a seat in the Assembly in 2016, sought a promotion in 2019 when he campaigned in a special election for the state Senate, but he lost an ugly all-GOP general election to colleague Brian Dahle 54-46.",
    "We could therefore find ourselves with an essentially orphaned special election, featuring candidates who would either be unlikely to win in November or would simply not appear on the midterm ballot altogether.",
    "GOP Rep. David Valadao is likely to seek re-election here, and while he infuriated the national party base by voting to impeach Trump, his presence could still deter most other strong Republicans from running.",
    "Even if he were to succeed Nunes, though, there'd be no plausible district where he could try for a full term if McClintock does indeed run in the 5tha conundrum for every Republican considering the special.",
    "Governors\n? HI-Gov: Developer Peter Savio tells Hawaii News Now that he's thinking about entering the August Republican primary for this open seat, though he doesn't sound enthusiastic about the idea.",
    "Garlin Gilchrist\nMichigan Civil Rights Commissioner Portia Roberson\nState Sen. Syliva Santana\nDetroit City Council President Mary Sheffield\nThe filing deadline is in mid-April for the August primary.",
    "? OR-Gov: State House Speaker Tina Kotek said Thursday that she will resign from the legislature, effective Jan. 21, in order to focus on her campaign for the Democratic nomination for governor.",
    "? MI-13: MLive.com mentions a few more Democrats as possible contenders for this safely blue Detroit-based seat, though there's no word on any of their interest:\nState Sen. Erika Geiss\nLt. Gov.",
    "And while the state senator spent all of 2021 talking about running to succeed the termed-out Wolf, his attempts to win Trump's support does not appear to have played out the way he expected.",
    "Savio says that, while he's spoken to party leaders, \"I'm hoping they can find someone else and I can give them ideas and solutions that I believe would help to make Hawaii a better place.\"",
    "That tome didn't help the assemblyman much when he ran in last year's recall campaign, though, as Kiley finished sixth on the moot replacement-candidate question with just 3.5% of the vote.",
    "? OH-Sen: Former state party chair Jane Timken has released a Moore Information poll that shows her trailing former state Treasurer Josh Mandel just 18-16 in the May Republican primary.",
    "The state senator, though, made news in ways he didn't intend to after he had to bolt from an Oval Office meeting with Trump after learning he'd tested positive for the coronavirus.",
    "Menendez is the son and namesake of Sen. Robert Menendez, who represented a previous version of this North Jersey constituency before he was appointed to the upper chamber in 2006.",
    "Mastriano hardly let that setback deter him, however, and he soon turned his efforts towards busing people to the Jan. 6 rally that took place just before the attack on Congress.",
    "Republicans had argued that the recall rules were unconstitutional because they allowed Whitmer to raise more money than any of the GOP candidates running for governor this year.",
    "The revamped 3rd, which is based in the eastern suburbs of Sacramento, would have supported Donald Trump by a small 50-48 margin according to data from Dave's Redistricting App.",
    "It remains to be seen if Trump will end up backing Mastriano after all, but it's clear the new gubernatorial candidate is going to run a Trumpy campaign to secure the GOP nod.",
    "Because those recalls never made the ballot, Democratic Secretary of State Jocelyn Benson determined last year that Whitmer's campaign would have to disgorge any excess funds.",
    "Kiley, who during that contest refused to acknowledge Joe Biden was legitimately elected, has also clashed with the Democratic leadership of the chamber he's sought to leave.",
    "The only other notable declared candidate is physician Kermit Jones, a Democrat who spent months campaigning against McClintock before redistricting altered the battlefield.",
    "While the old 22nd, which went for Donald Trump 52-46, isn't necessarily the most appetizing target, the 5th, which would have backed Trump 55-43, is considerably less so.",
    "It's an unusual situation without much in the way of recent precedent, and it could lead to diminished interest in the contest to fill the last few months of Nunes' term.",
    "Lawmakers in each chamber of the Republican-run legislature on Friday and Saturday also passed the new GOP-drawn congressional, state Senate, and state House boundaries.",
    "Gavin Newsom just scheduled for April 5, and he was also reportedly eyeing a bid for the redrawn 5th, but now it appears that Borgeas won't participate in either race.",
    "Rob Wittman because redistricting had moved him to the 7th District; Navarre also made it clear that he would be backing Democratic Rep. Abigail Spanberger in the 7th.",
    "Ross unexpectedly announced in 2018 that he would retire from the current 15th District even though he almost certainly would have won a fifth term in that red seat.",
    "Neff said that any \"alleged harm\" was therefore \"self-inflicted\" because plaintiffs could have donated any amount they wanted to the recall efforts but chose not to.",
    "Mastriano was later denied admittance to closed-door GOP caucus gatherings, with fellow Republicans accusing him of sharing information from meetings with outsiders.",
    "Mastriano quickly emerged as one of the leading proponents of an effort to overturn Joe Biden's victory in Pennsylvania, which earned him a trip to the White House.",
    "Opt in to email updates from Daily Kos Elections\nSponsored by: Daily Kos Elections\nThe last option would be the new 22nd, which is in fact winnable for Democrats.",
    "Rendon previously had Kiley exiled to the least desirable office in the state capitol, nicknamed \"the dog house,\" after a 2019 clash with committee Democrats.",
    "Borgeas had filed paperwork with the FEC for a possible bid in the special election to fill Devin Nunes' vacant 22nd District, a contest that Democratic Gov.",
    "Mandela Barnes has publicized a mid-December ALG Research survey that gives him a 40-11 lead over Milwaukee Bucks executive Alex Lasry in the August primary.",
    "The last primary survey we saw from a reputable firm was another Moore internal for Timken in November, and it had Mandel edging her out by a 21-17 margin.",
    "She could, however, simply give it the state Democratic Party or another organization that could then spend it to support her re-election bid this fall.",
    "? NY-Gov: Suffolk County Executive Steve Bellone has announced that he will not be seeking the Democratic nomination for any statewide office this year.",
    "He claims he left the Capitol before the violence began, but videos released in May appear to show him and his wife passing through breached barricades.",
    "The younger Menendez is likely to be the heavy favorite to win the nod in a state where party establishments still carry a massive amount of influence.",
    "Gavin Newsom's pandemic safety measures, went on to self-publish a book called \"Recall Gavin Newsom: The Case Against America's Most Corrupt Governor.\"",
    "In late December, he put out a Facebook video where he warned that his intra-party rivals will \"lie, cheat and steal\" to defeat a \"people's governor.\"",
    "? IL-01: Democratic state Sen. Jacqueline Collins tells the Chicago Crusader she'll \"pursue the prospects of running\" for this safely blue open seat.",
    "Democratic Rep. Rashida Tlaib, who represents the current 13th District, is campaigning for the new and very blue 12th District in the Detroit area.",
    "Corman, who later launched his own campaign for governor, responded by having Mastriano booted as chair of the Senate Intergovernmental Committee.",
    "Biden, however, would have carried the 22nd 55-42though Democrats tend to underperform here downballot, especially during non-presidential years.",
    "? WI-Sen: Republican Sen. Ron Johnson on Sunday published an editorial in the Wall Street Journal titled, \"Why I'm Seeking a Third Senate Term.\"",
    "? VA-01: Marine veteran Stewart Navarre announced Friday that he was dropping his campaign for the Democratic nomination to face Republican Rep.",
    "Mastriano, of course, has ignored Democratic calls for his resignation, though his antics have caused him some damage with Republicans at home.",
    "(Mastriano, naturally, had traveled to D.C. just after he attended a four-hour maskless gathering with fellow Republican election deniers.)",
    "Kiley currently represents 58% of the new 3rd Congressional District in the legislature, which gives him a good geographic base of support.",
    "John McGuire and 2020 candidate Tina Ramirez, have not made any decisions now that the new maps have moved them to other seats, though.",
    "In May, Mastriano said in a radio interview that he met with Trump regarding an endorsement and even said Trump encouraged him to run.",
    "The maps now go to Beshear, who has a total of 10 days to sign or veto the maps; however, Republicans can easily override a veto.",
    "Two wealthy businessmen, Mike Gibbons and Bernie Moreno, are behind with 14% and 9%, respectively, while venture capitalist J.D.",
    "Mastriano has spent the pandemic holding anti-mask and anti-vaccine mandate events aimed at undermining Democratic Gov.",
    "Phil Murphy, Sen. Cory Booker, Jersey City Mayor Steve Fullop, and the Democratic parties of Hudson and Union counties.",
    "The campaign has said it will do so this month, though Whitmer hasn't yet revealed what she'll do with the money.",
    "Those potential contenders will have until the Feb. 10 filing deadline to decide if they'll run in the special.",
    "Tom Wolf's public health measures, but he only truly rose to national infamy just after that year's election.",
    "Indeed, no other notable Democrats have announced since Sires announced his retirement just before Christmas.",
    "Andy Beshear signed the measure a few hours later, and we've updated our 2022 election calendar accordingly.",
    "Mastriano's full-throated embrace of the Big Lie, though, could help him stand out amongst the crowd.",
    "Half our revenue comes from readers like you, meaning we literally couldn't do this work without you.",
    "Mastriano also argued that none of his opponents were popular enough to hold announcement rallies.",
    "No notable Republicans, though, are currently competing for the top job in this very blue state.",
    "(For inverse reasons, Republicans wouldn't want to run in these districts either.)",
    "Daily Kos is the country's largest progressive, independent news and activism hub.",
    "The filing deadline for the June top-two primary will take place in mid-March.",
    "However, this aide made clear that Trump has not issued an endorsement.",
    "Vance takes 8%; bringing up the rear with 4% is state Sen. Matt Dolan.",
    "We don't have billionaire backers like some right-wing media outlets.",
    "That's not the real issue for a would-be Nunes successor, though.",
    "Get the Daily Kos Elections Morning Digest over email\n Sign up!",
    "Can you donate $3 right now to help Daily Kos keep fighting?",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "We'll have more about his decision in our next Digest.",
    "Kiley, who spent 2020 attacking Democratic Gov.",
    "It's also a problem for every Democrat, too.",
    "Meanwhile on the Democratic side, Lt. Gov.",
    "Daily Kos relies on readers like you.",
    "You may unsubscribe at any time.",
    "Two other GOP contenders, Del.",
    "Donate $3\nDonate $5 monthly",
    "Here's our privacy policy.",
    "Democratic Gov.",
    "Democratic Gov.",
    "Sign up!"
  ]
}