{
  "id": 2424,
  "mediaId": 312,
  "date": "1/9/2022 12:00:00 AM",
  "headline": "Wisconsin Republican Sen. Ron Johnson Will Seek Reelection",
  "image": "https://api.time.com/wp-content/uploads/2022/01/Johnson.jpg?w=800&quality=85",
  "link": "https://time.com/6137992/sen-ron-johnson-reelection/",
  "sentiment": "0",
  "mediaOutlet": "Time",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "SCOTT BAUER / AP",
  "authorUrl": "https://time.com/author/associated-press/",
  "termIds": [
    741,
    802,
    1568,
    2039
  ],
  "sentences": [
    "More Must-Read Stories From TIME\nShonda Rhimes Already Knows What You're Going to Watch Next\nHow Donald Trump Turned Jan. 6 into a Windfall\nWhy 2022 Is the Year We Learn to Live With COVID-19\nPublic Schools Are Struggling to Retain Black Teachers.",
    "These Ex-Teachers Explain Why\nCDC Director Rochelle Walensky Faces a Surging VirusAnd a Crisis of Trust\nHow Addictive Social Media Algorithms Could Finally Face a Reckoning in 2022\nThe Supreme Court Could Let Religious Schools Take Taxpayer Money.",
    "Why do we assume that the body's natural immune system isn't the marvel that it really is??\nJohnson has espoused conspiracy theories related to last year's Capitol raid that attempted to shift blame for what happened away from Trump supporters.",
    "MADISON, Wis.  Republican U.S. Sen. Ron Johnson of Wisconsin, one of former President Donald Trump's biggest backers, announced Sunday that he will seek reelection in the battleground state, breaking his promise not to seek a third term.",
    "Johnson has since downplayed the violence, saying it didn't seem like an armed insurrection to me.?\nJust before the U.S. Capitol was stormed a year ago, Johnson objected to counting the Electoral College votes from Arizona.",
    "Republican Wisconsin Assembly Speaker Robin Vos told the AP on Friday that there is zero chance? of the Legislature taking over the awarding of the state's 10 presidential elector votes in 2024.",
    "When re-election is not your primary motivation, those are easy promises to keep  and I have faithfully done so.?\nJohnson's opponent won't be known this time until after an Aug. 9 primary.",
    "Mandela Barnes, who is seeking to become the state's first Black senator; Milwaukee Bucks executive Alex Lasry; state Treasurer Sarah Godlewski and Outagamie County Executive Tom Nelson.",
    "The only people celebrating Ron Johnson's announcement are his donors and the corporate special interest groups he's bailed out time and time again,? Barnes said in a statement.",
    "Johnson over the past year has been a leading voice in downplaying the Jan. 6, 2021, Capitol riot and the coronavirus pandemic, in addition to remaining a vocal Trump supporter.",
    "But Johnson rescinded the pledge in the lead-up to announcing his reelection bid, saying circumstances have changed after Democrats won the White House and control of Congress.",
    "Johnson announced his decision via email two days after a pair of Republicans with knowledge of his decision told The Associated Press that he was close to launching a bid.",
    "No other Senate retirements are likely beyond the five Republicans and one Democrat, Sen. Patrick Leahy of Vermont, who have already announced plans to step down.",
    "Let's get to work and retire this failed senator.?\nBarnes, Godlewski, Nelson and other Democrats faulted Johnson for breaking his promise to serve only two terms.",
    "Having already experienced a growing level of vitriol and false attacks, I certainly don't expect better treatment in the future,? he said in his announcement.",
    "Kevin Nicholson, a former Marine who ran for U.S. Senate and lost in the GOP primary in 2018, has said he would run for governor if Johnson sought reelection.",
    "His website urges supporters to help Kevin take back Washington.?\nEarlier this week, former U.S. Rep. Sean Duffy bowed out of running for Senate or governor.",
    "Johnson, who contracted COVID-19 in October 2020 and is not vaccinated, has cast doubt over the efficacy of vaccines and pushed for unproven treatments.",
    "Just last week, Johnson on conservative talk radio said, Why do we think that we can create something better than God in terms of combating disease?",
    "Johnson's announcement that he will run again came a day after Republican Sen. John Thune, of South Dakota, said he would seek a fourth term.",
    "The two have remained close following Trump's defeat, with Trump in April endorsing Johnson for a third term and encouraging him to run.",
    "Much as I'd like to ease into a quiet retirement, I don't feel I should,? Johnson wrote in an editorial announcing his reelection bid.",
    "Last year, he told Republicans who control the Wisconsin Legislature that they should take over control of federal elections.",
    "Johnson, who rose out of the tea party movement in 2010, has long been aligned with Trump's hardline policies and politics.",
    "Former President Barack Obama's Democratic Party, for example, lost 63 seats in the House and six in the Senate in 2010.",
    "President Joe Biden won the state by fewer than 21,000 votes in 2020 after a similarly narrow win by Trump in 2016.",
    "Johnson, 66, had long said his preference was to serve just two terms and pledged in 2016 not to run a third time.",
    "Johnson won by nearly 5 points in 2010, his first race for office, and then by just over 3 points in 2016.",
    "The party that does not hold the White House generally gains seats in midterm congressional elections.",
    "The race is sure to be one of the most hotly contested in the country next year in purple Wisconsin.",
    "An extension of that promise is that I don't conduct myself worrying about re-election,? he wrote.",
    "He said the response to the coronavirus pandemic also played a part in his decision to run again.",
    "Several high-profile and well-funded Democrats are running, including Lt. Gov.",
    "Johnson's decision also has ripple effects on Wisconsin's governor's race.",
    "Johnson said he did not make the decision to run again lightly.",
    "History is on Johnson's side in the midterm election.",
    "But Nicholson had been focused on running for Senate.",
    "Former Students Say That's a Mistake\nSHARE THIS STORY",
    "Johnson said he never voted with reelection in mind.",
    "Both times he defeated Democrat Russ Feingold."
  ]
}