{
  "id": 2441,
  "mediaId": 43,
  "date": "1/7/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 1/7",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/1/7/2072321/-Daily-Kos-Elections-Live-Digest-1-7",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    741,
    2039
  ],
  "sentences": [
    "Friday, Jan 7, 2022  11:10:04 AM Pacific Standard Time  Jeff Singer\nWI-Sen: Local ABC reporter Matt Smith tweeted Friday that unnamed Republican sources tell him that Sen. Ron Johnson has decided to seek a third term and that an announcement is expected in the coming days.? CNN also reported that day that Johnson's fellow Republicans now widely anticipate he'll run and would be surprised if he did not.?\n Friday, Jan 7, 2022  11:32:53 AM Pacific Standard Time  David Nir\nMI-Gov: A federal judge has dismissed a Republican lawsuit seeking to invalidate a Michigan rule allowing candidates who are the target of recalls to raise unlimited funds from donors, saying that the plaintiffs lacked standing because they failed to show they'd been harmed by the so-called \"recall exception.\"",
    "While Democrats long ago consolidated behind Attorney General Josh Shapiro, Mastriano joins a GOP field that currently consists of:\n2018 Senate nominee Lou Barletta\nFormer Chester County Chamber of Business and Industry President Guy Ciarrocchi\nState Senate President Pro Tempore Jake Corman\nMontgomery County Commissioner Joe Gale\nGOP strategist Charlie Gerow\nFormer Rep. Melissa Hart\nState Sen. Scott Martin\nFormer U.S. Attorney Bill McSwain\nBusinessman Dave White\nSurgeon Nche Zama\nPennsylvania's filing deadline is about two months away, so this lineup could shift further.",
    "Friday, Jan 7, 2022  8:49:04 AM Pacific Standard Time  Jeff Singer\nNH-Sen: When asked about his potential bid for the Republican nod Thursday, Londonderry Town Manager Kevin Smith said that you can expect some news about a decision on me running next week.?\n Friday, Jan 7, 2022  8:55:44 AM Pacific Standard Time  Jeff Singer\nOR-Gov: State House Speaker Tina Kotek said Thursday that she will resign from the legislature, effective Jan. 21, in order to focus on her campaign for the Democratic nomination for governor.",
    "Friday, Jan 7, 2022  10:40:32 AM Pacific Standard Time  Jeff Singer\nMI-12: State Rep. Kyra Harris Bolden did not rule out running to succeed her fellow Democrat, retiring Rep. Brenda Lawrence, in an interview with MILive.com, saying she's leaving every opportunity on the table.? Democratic Rep. Rashida Tlaib, who represents the current 13th District, is campaigning for the new and very blue 12th District in the Detroit area.",
    "Friday, Jan 7, 2022  10:52:56 AM Pacific Standard Time  Jeff Singer\nNJ-08: Port Authority Commissioner Robert Menendez Jr. finally confirmed Thursday that he was entering the Democratic primary to succeed retiring Rep. Albio Sires in this 72-28 Biden seat, a declaration that came weeks after he picked endorsements from Sires, Gov.",
    "Friday, Jan 7, 2022  12:16:34 PM Pacific Standard Time  Jeff Singer\nPA-Gov: State Sen. Doug Mastriano, an ardent election denier who was filmed on Jan. 6 apparently passing breached barricades at the Capitol, has at last announced that he's running in the extremely packed May Republican primary for governor.",
    "Friday, Jan 7, 2022  11:03:51 AM Pacific Standard Time  Jeff Singer\nVA-07: Green Beret veteran Derrick Anderson, a Republican who launched a campaign months before redistricting was complete, has announced that he'll continue his bid against Democratic Rep. Abigail Spanberger in the revamped 7th District.",
    "The U.S. Senate Judiciary went on to issue a report in October recommending that he be further probed for his alleged role in the attempt to steal the election after finding that Mastriano, along with Rep. Scott Perry, pressured the Justice Department to investigate the state's results.",
    "Savio says that, while he's spoken to party leaders, I'm hoping they can find someone else and I can give them ideas and solutions that I believe would help to make Hawaii a better place.? No notable Republicans, though, are currently competing for the top job in this very blue state.",
    "However, U.S. District Judge Janet Neff, an appointee of George W. Bush, ruled that Republicans were in essence conflating the hypothetical recall elections with the regular quadrennial election, pointing out that the recall committees could have also raised unlimited sums.",
    "At first, an unnamed Trump aide declined to comment on Mastriano's claims to the Associated Press, though another Trump staffer (or possibly the same one) later confirmed to the Philadelphia Inquirer's Jonathan Tamari that a meeting between the two men had occurred.",
    "Friday, Jan 7, 2022  9:50:40 AM Pacific Standard Time  David Nir\nKY Redistricting: Kentucky's candidate filing deadline was supposed to be Friday, but with redistricting still incomplete, lawmakers passed a bill a day beforehand to delay the deadline until Jan. 25.",
    "Friday, Jan 7, 2022  10:41:59 AM Pacific Standard Time  Jeff Singer\nMI-13: MLive.com mentions a few more Democrats as possible contenders for this safely blue Detroit-based seat, though there's no word on any of their interest:\nState Sen. Erika Geiss\nLt. Gov.",
    "Friday, Jan 7, 2022  10:31:03 AM Pacific Standard Time  Jeff Singer\nHI-Gov: Developer Peter Savio tells Hawaii News Now that he's thinking about entering the August Republican primary for this open seat, though he doesn't sound enthusiastic about the idea.",
    "Friday, Jan 7, 2022  10:25:13 AM Pacific Standard Time  Jeff Singer\nOH-Sen: Former state party chair Jane Timken has released a Moore Information poll that shows her trailing former state Treasurer Josh Mandel just 18-16 in the May Republican primary.",
    "In late December, he put out a Facebook video where he warned that his intra-party rivals will lie, cheat and steal? to defeat a people's governor.? Mastriano also argued that none of his opponents were popular enough to hold announcement rallies.",
    "Gretchen Whitmer had taken advantage of the rule to raise roughly $4 million beyond what normal contribution limits would allow because opponents had launched dozens of recall efforts aimed at her, all of which failed to go anywhere.",
    "Mastriano, who is a veteran of Iraq and Afghanistan, won a 2019 special election for his current post one year after he took a close fourth place against now-Rep. John Joyce in the primary for the 13th Congressional District.",
    "In August, after his calls for Pennsylvania to emulate Arizona's infamous forensic investigation\" of the 2020 results went nowhere, he appeared on the far-right One America News to trash state Senate leader Jake Corman.",
    "Friday, Jan 7, 2022  9:02:13 AM Pacific Standard Time  Jeff Singer\nNY-Gov: Suffolk County Executive Steve Bellone has announced that he will not be seeking the Democratic nomination for any statewide office this year.",
    "Friday, Jan 7, 2022  10:33:23 AM Pacific Standard Time  Jeff Singer\nIL-01: Democratic state Sen. Jacqueline Collins tells the Chicago Crusader she'll pursue the prospects of running? for this safely blue open seat.",
    "Friday, Jan 7, 2022  11:00:33 AM Pacific Standard Time  Jeff Singer\nVA-01: Marine veteran Stewart Navarre announced Friday that he was dropping his campaign for the Democratic nomination to face Republican Rep.",
    "Kotek made her declaration one day after longtime Senate President Peter Courtney, who has been an obstacle to progressive reforms during his almost two decades in charge, announced that he was retiring.",
    "Garlin Gilchrist\nMichigan Civil Rights Commissioner Portia Roberson\nState Sen. Syliva Santana\nDetroit City Council President Mary Sheffield\nThe filing deadline is in mid-April for the August primary.",
    "Corman, who later launched his own campaign for governor, responded by bringing the chamber into session for the sole purpose of booting Mastriano as chair of the Senate Intergovernmental Committee.",
    "The state senator spent all of 2021 talking about running to succeed the termed-out Wolf, though his attempts to win Trump's support does not appear to have played out the way he expected.",
    "The state senator, though, made news in ways he didn't intend to after he had to bolt from an Oval Office meeting with Trump after learning he'd tested positive for the coronavirus.",
    "Menendez is the son and namesake of Sen. Robert Menendez, who represented a previous version of this North Jersey constituency before he was appointed to the upper chamber in 2006.",
    "Republicans had argued that the recall rules were unconstitutional because they allowed Whitmer to raise more money than any of the GOP candidates running for governor this year.",
    "Because those recalls never made the ballot, Democratic Secretary of State Jocelyn Benson determined last year that Whitmer's campaign would have to disgorge any excess funds.",
    "It remains to be seen if Trump will end up backing Mastriano after all, but it's clear the new gubernatorial candidate is going to run a Trumpy campaign to secure the GOP nod.",
    "Mastriano hardly let that setback deter him, though, and he soon turned his efforts towards busing people to the Jan. 6 rally that came just before the attack on Congress.",
    "The same day, lawmakers in the Republican-run state House and Senate each approved new maps for their own chamber, while the Senate passed the GOP's new congressional map.",
    "Mandela Barnes has publicized a mid-December ALG Research survey that gives him a 40-11 lead over Milwaukee Bucks executive Alex Lasry in the August Democratic primary.",
    "Rob Wittman because redistricting had moved him to the 7th District; Navarre also made it clear that he would be backing Democratic Rep. Abigail Spanberger in the 7th.",
    "Neff said that any \"alleged harm\" was therefore \"self-inflicted\" because plaintiffs could have donated any amount they wanted to the recall efforts but chose not to.",
    "Mastriano quickly emerged as one of the leading proponents of an effort to overturn Joe Biden's victory in Pennsylvania, which earned him a trip to the White House.",
    "The last primary survey we saw from a reputable firm was another Moore internal for Timken in November, and it had Mandel edging her out by a 21-17 margin.",
    "She could, however, simply give it the state Democratic Party or another organization that could then spend it to support her re-election bid this fall.",
    "He claims he left the Capitol before the violence began, but videos released in May appear to show him and his wife passing through breached barricades.",
    "The younger Menendez is likely to be the heavy favorite to win the nod in a state where party establishments still carry a massive amount of influence.",
    "Mastriano, of course, has ignored Democratic calls for his resignation, though his antics have caused him some damage with Republicans at home.",
    "(Mastriano, naturally, had traveled to D.C. just after he attended a four-hour maskless gathering with fellow Republican election deniers.)",
    "John McGuire and 2020 candidate Tina Ramirez, have not made any decisions now that the new maps have moved them to other seats, though.",
    "In May, Mastriano said in a radio interview that he met with Trump regarding an endorsement and even said Trump encouraged him to run.",
    "Two wealthy businessmen, Mike Gibbons and Bernie Moreno, are behind with 14% and 9%, respectively, while venture capitalist J.D.",
    "Mastriano has spent the pandemic holding anti-mask and anti-vaccine mandate events aimed at undermining Democratic Gov.",
    "Phil Murphy, Sen. Cory Booker, Jersey City Mayor Steve Fullop, and the Democratic parties of Hudson and Union counties.",
    "Andy Beshear would then have up to 10 days to sign or veto the maps, though Republicans can easily override a veto.",
    "The campaign has said it will do so this month, though Whitmer hasn't yet revealed what she'll do with the money.",
    "Indeed, no other notable Democrats have announced since Sires announced his retirement just before Christmas.",
    "Tom Wolf's public health measures, but he only truly rose to national infamy just after that year's election.",
    "Andy Beshear signed the measure a few hours later, and we've updated our 2022 election calendar accordingly.",
    "Mastriano's full-throated embrace of the Big Lie, though, could help him stand out amongst the crowd.",
    "Half our revenue comes from readers like you, meaning we literally couldn't do this work without you.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "Sign up here to receive the Daily Kos Elections Morning Digest in your inbox each weekday.",
    "Friday, Jan 7, 2022  10:28:04 AM Pacific Standard Time  Jeff Singer\nWI-Sen: Lt. Gov.",
    "Daily Kos is the country's largest progressive, independent news and activism hub.",
    "Donald Trump's margin of victory in the new 1st ticked up from 51-47 to 52-46.",
    "Legislators say they expect to finish work on redistricting on Saturday.",
    "However, this aide made clear that Trump has not issued an endorsement.",
    "Vance takes 8%; bringing up the rear with 4% is state Sen. Matt Dolan.",
    "We don't have billionaire backers like some right-wing media outlets.",
    "Can you donate $3 right now to help Daily Kos keep fighting?",
    "It's also a place to discuss elections, not policy.",
    "Daily Kos relies on readers like you.",
    "Two other GOP contenders, Del.",
    "Donate $3\nDonate $5 monthly",
    "Democratic Gov.",
    "Democratic Gov.",
    "Democratic Gov."
  ]
}