{
  "id": 1436,
  "mediaId": 8465,
  "date": "2022-02-10",
  "headline": "Penner running for seat in the Ohio House",
  "image": "https://thevwindependent.com/news/wp-content/uploads/2022/02/Ted-Penner-copy-2-10-2022.png",
  "link": "https://thevwindependent.com/news/2022/02/11/penner-running-for-seat-in-the-ohio-house/",
  "mediaOutlet": "thevwindependent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "I truly believe we need as little government as possible and we should only interject when it’s the residents requesting the representative to do so.”\nPenner and his late wife have four children and six grandchildren with one on the way.",
    "VW independent staff and submitted information\nDEFIANCE – Republican Ted Penner has filed as a candidate for the Ohio House of Representatives seat currently held by Craig Riedel, who has decided to seek a U.S. Congressional seat.",
    "“I also have the civility it takes to negotiate and advocate for those I would represent.”\nThe 82nd district is currently comprised of Defiance, Paulding and Van Wert counties, and a portion of Auglaize County.",
    "Penner has served as a trustee for the Defiance County Improvement Corporation for over 10 years and has been highly engaged in economic development projects and workforce initiatives throughout his service.",
    "“That’s why I’ll make sure we are bringing precision ag, and the necessary broadband infrastructure to the forefront.”\nPenner was a co- business owner of Spatial Ag.",
    "“We have to be vigilant in making sure one of Ohio’s top industries doesn’t get left behind in the technology age,” Penner said.",
    "“I believe I have what it takes to lead the 82nd District by listening to the residents of this great region,” Penner said.",
    "Copyright © 2010-2022 The Van Wert Independent — Subscribe to our RSS feed — Web Site Design by J. DeWert Enterprises, LLC",
    "Systems, LLC for 17 years, until he and his wife Brenda transitioned their share of the business to his stepson in 2018.",
    "However, the boundaries are subject to change because of a recent ruling by the Ohio Supreme Court.",
    "He stated his goals if elected, include recognizing and facilitating 21st Century ag production.",
    "He has been a township trustee for fourteen years and a fiscal officer for six.",
    "“I have northwest Ohio values, I’m a traditional conservative,” Penner said.",
    "Penner lives outside of Defiance and is an attorney and accountant (CPA).",
    "“I’m pro-life and a strong supporter of the second amendment.",
    "He currently serves as the Township Association’s President."
  ]
}