{
  "id": 1176,
  "mediaId": 65,
  "date": "3/17/2022 12:00:00 AM",
  "headline": "Demolition derby in Georgia as Herschel Walker's GOP primary rivals slam the Senate front-runner",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1c7aa86f-ca3a-4134-ae2d-e4ef1f742c2b/f6961970-d414-407f-9d0c-0b255f477e2b/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/demolition-derby-in-georgia-as-herschel-walkers-gop-primary-rivals-slam-the-senate-front-runner",
  "sentiment": "-0.759",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    815,
    1147,
    1312,
    1462,
    1932,
    428,
    571,
    2555,
    2672
  ],
  "sentences": [
    "WHO'S UP AND WHO'S DOWN IN THE LATEST FOX NEWS MIDTERMS POWER RANKINGS\nRepublican Senate candidate Kelvin King charged in comments to the Atlanta Journal Constitution that \"Herschel Walker talks about working hard and fighting for the interests of Georgians, yet he works behind the scenes to ensure a level of celebrity comfort and elusiveness, separating himself from the questions and engagement that Georgians demand.",
    "\"We cannot expect a candidate to survive a vicious General Election when they spend the entire primary hiding behind celebrity status, President Trump's endorsement, softball interviews, and \"double bookings\" that conveniently take place when forums are scheduled,\" argued King, a construction company owner and military veteran who announced his candidacy last April.",
    "Walker, who won a Heisman Trophy and helped steer the University of Georgia to a college football national championship four decades ago, jumped into the GOP race to face off against first-term Democratic Sen. Raphael Warnock after months of support and encouragement to run for the Senate by former President Donald Trump, his longtime friend.",
    "Taking the lead is Gary Black, a cattle farmer and Georgia's elected agriculture commissioner, who on Wednesday went up with a scathing digital ad that spotlights alleged past violent behavior by Walker, including an alleged incident where Walker held a razor to his ex-wife's throat, choked her, and later put a gun to her head.",
    "But as Walker mulled a Senate run last summer and as he jumped into the race, plenty of Republicans in Washington and Georgia were raising concerns that the first-time candidate was untested on the campaign trail and worried about his political baggage that could give Warnock and the Democrats plenty of ammunition.",
    "With just over two months to go until Georgia's May 24 primary and former professional and college football star Hershel Walker holding a massive polling and fundraising lead in the race for the Republican Senate nomination, his rivals appear to be going for the jugular.",
    "Walker was dinged by numerous reports that he had over inflated the success of one of his chicken distribution business, and the Democratic Party of Georgia's spotlighted more recent reports that Walker and his businesses owed millions in unpaid loans.",
    "Pointing to the new ad by Black, a veteran Georgia based Republican consultant who's neutral in the Senate primary - and who asked to remain anonymous to speak more freely  told Fox News \"Gary Black has addressed the elephant in the room.",
    "FIRST ON FOX NEWS: TRUMP RETURNING TO GEORGIA LATER THIS MONTH\nThe spot also highlights other alleged incidents of violence with other woman before the narrator asks \"how many more women are out there, and what stories might they tell?\"",
    "CLICK HERE FOR THE LATEST FOX NEWS REPORTING FROM THE CAMPAIGN TRAIL\nBesides the multiple allegations of physical abuse, Walker for years has openly discussed his struggles with a mental illness known as dissociative identity disorder.",
    "CLICK HERE TO GET THE FOX NEWS APP\nTrump will weigh in to the race again in a week and a half, as he returns to Georgia to team up with Walker and other candidates he's endorsed as he holds a large rally northwest of Atlanta.",
    "Black campaign adviser and spokesman Dan McLagan told Fox News that it's imperative to have this discussion about Walker during the Republican primaries rather than during the general election, when it will be \"too late.\"",
    "Walker, whose relationship with the former president goes back to his days playing for the Trump-owned New Jersey Generals USFL football team in the 1980s, was a major Trump supporter and surrogate in the 2020 election.",
    "Asked about the ad, Walker campaign communications director Mallory Blount told Fox News that \"the only thing more embarrassing than Gary Black's obsession with Herschel Walker is Gary's fundraising and poll numbers.\"",
    "The most recent survey  a Fox News poll conducted March 2-6  indicated Walker at 66% support among likely Republican primary voters in Georgia, with Black a very distant second at 8%.",
    "WHAT A NEW FOX NEWS POLL SHOWS IN GEORGIA'S GOP RACE FOR SENATE\nWalker has held large leads over his rivals in public opinion polls since launching his campaign in late August.",
    "McLagan said the campaign's spending five figures right now to run the ad digitally across Georgia, and that they're considering airing a shorter version of the spot on TV.",
    "Walker spotlighted his mental health challenges in a 2008 book, writing that he was able to overcome his multiple personalities with therapy and his faith in Christianity.",
    "Saddler, in comments to the Atlanta Journal Constitution, noted that Walker had lived in Texas for years before moving back to Georgia to run for the Senate.",
    "Even though Gary can't win the primary, every Republican in Georgia now knows what the ads against Herschel will look like in the general election.\"",
    "The ad asks GOP voters in Georgia to \"imagine what Democrats would do to Herschel Walker if he becomes the Republican nominee.\"",
    "King is 3% support in the Fox News poll, a point ahead of military veteran and businessman Latham Saddler.",
    "Black for months has taken aim at Walker, who has said he won't debate his GOP Senate rivals.",
    "So, my question to the voters out there is how's that gonna work against Raphael Warnock?\"",
    "But now, some of the other lesser-known candidates in the race are following suit.",
    "This is a campaign - not an autograph tour for those who can pay an access fee.\"",
    "HE'S GOT TRUMP'S ENDORSEMENT, SO WHY IS DAVID PERDUE STRUGGLING AGAINST GOV.",
    "And Sadler said \"it's clear he's [Walker] not willing to debate any of us.",
    "All other candidates received 6% combined, with 16% questioned unsure.",
    "\"He abandoned Georgia,\" Sadler charged.",
    "BRIAN KEMP?"
  ]
}