{
  "id": 6043,
  "mediaId": 238,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Trump makes closing pitch for Nebraska candidate accused of groping",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/01/trump-herbster-nebraska-republicans/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1147,
    1839,
    1902,
    1909,
    2136,
    2470,
    3010,
    3103,
    588,
    2816
  ],
  "sentences": [
    "They include Herschel Walker, a U.S. Senate candidate in Georgia who has been accused of threatening the lives of two women, as well as Sean Parnell, who ended his U.S. Senate campaign in Pennsylvania last year amid domestic abuse allegations, and Roy Moore, a 2017 candidate for U.S. Senate in Alabama who was accused by two women of initiating unwanted sexual encounters when Moore was in his 30s and they were 16 and 14.",
    "The Sunday rally included two conservative activists who have falsely claimed that the 2020 election was stolen from Trump: MyPillow CEO Mike Lindell and Republican activist David Bossie, the producer of a documentary titled Rigged.?\nTrump endorsed Herbster last year, stoking tensions among local Republicans, starting with Ricketts, who had urged the former president not to get behind the candidate.",
    "When the allegations were first reported, all 13 women in the Nebraska Senate signed a letter that called the allegations disqualifying? and completely unacceptable.?\nSexual assault is despicable and damaging,? they wrote, including state Sen. Carol Blood (D), who is running unopposed for the Democratic gubernatorial nomination.",
    "In a joint statement, they accused Herbster of trying to wield the judicial system as a weapon to silence his victims? and avoid accountability, adding that survivors of sexual assault and witnesses should be free to come forward and tell the truth.? Two said they received letters from Herbsters legal representatives.",
    "Personally, having daughters and being in the political world, its a little disheartening to hear that someone whos running for governor would, or could have, engaged in that kind of activity.?\nThe rival candidates are not alone in questioning Herbsters defense or explanations.",
    "I dont think theres any body to it.? His wife Summer, 43, said, People are going to say whatever theyre going to say, no matter who it is.?\nRepublican opponents have not called on Herbster to quit the race, but they have criticized his response to the allegations.",
    " Former president Donald Trump on Sunday made a closing pitch for a Republican gubernatorial candidate who has been accused of sexually assaulting multiple women, stepping deeper into a primary that has divided Republicans in this staunchly conservative state.",
    "After telling the crowd about how many of his preferred candidates had won their primaries, Trump pointed to slides produced by his pollster, McLaughlin & Associates, lingering on numbers that showed more than 60 percent of his voters strongly? supported him.",
    "But on this issue were going to disagree.?\nThe allegations against Herbster threw more uncertainty into what pollsters see as a three-way race between him, Pillen and state Sen. Brett Lindstrom (R), with state Sen. Theresa Thibodeau (R) not far behind.",
    "At a parade in Nebraska City on Saturday, celebrating the 150th annual Arbor Day, Herbster raced back and forth across the route, shaking hands and telling one family not to believe all the crap? they were hearing.",
    "We are going to take back Nebraska.?\nHe compared his vision for making Nebraska great again? to Trumps approach to the presidency, rolling up his sleeves to take on illegal immigration and defend religious freedom.",
    "Trump, who has faced and denied multiple allegations ranging from sexual harassment to rape, has backed other candidates who have been accused of sexual misconduct or domestic violence and denied the allegations.",
    "The number of calls and text messages and prayers coming in to me has been absolutely overwhelming.?\nOn Tuesday, four Republican state senators, all women, launched a Herbster Victim Witness Legal Defense Fund.",
    "According to state Sen. Julie Slama (R), Herbster reached up her skirt without her consent and touched her inappropriately as she walked by during a local Republican fundraiser in a crowded ballroom in 2019.",
    "The former president called Herbster a very good man? who had been maligned.? Trump said Herbster was innocent? of what he called despicable charges.?\nI defend people when I know theyre good,? Trump said.",
    "Those leadership characteristics just arent there.?\nHerbster, who has spent $5 million of his own wealth on his campaign, was seen to be leading a tight race when Slama accused him of groping her in 2019.",
    "We will show this lawsuit for what it is: a frivolous and bad faith attempt to bully a sexual assault victim into silence,? an attorney for Slama said in a statement provided to The Washington Post.",
    "Herbster had business interests outside the state, there were questions about his taxes, and they were uncomfortable replacing the wealthy Ricketts with another multimillionaire governor, they said.",
    "At a recent news conference, Herbster explained that he had taken the route of attorneys to protect my name and my reputation.?\nI respect all women, all females across this land,? Herbster said.",
    "While Trump won Nebraska by 19 points in 2020, and remained overwhelmingly popular with Republicans in the state, some primary voters said that they were not sold on supporting Herbster.",
    "Since Im a veterinarian and pig farmer,? said Pillen, Id call that hogwash.?\nLindstrom said that he did not believe in a rush to judgment,? but was disgusted? by the accusations.",
    "The visit came after a recent Nebraska Examiner report in which eight women, including a state senator speaking on the record, accused Herbster of touching them inappropriately.",
    "Now, its Charles W. Herbster.?\nTrump hinted at a personal reason for campaigning with Herbster  trying to prove, once again, that the candidates he endorsed were winners.",
    "Trump appeared at a rally in Greenwood with Charles Herbster, a businessman who has advised the former president on agricultural policy and has donated to his campaigns.",
    "It is an issue of character and basic human decency.?\nHerbster has released a television ad both denying the accusations and noting that Slama once worked for Ricketts.",
    "I never saw that there was any real desire to learn Nebraska or learn Nebraska policy,? Thibodeau, who went on to enter the gubernatorial primary, said in an interview.",
    "Herbster tapped former top Trump White House official Kellyanne Conway to help with his campaign last year, along with former Trump campaign manager Corey Lewandowski.",
    "Last July, Herbsters initial running mate, Thibodeau, quit the ticket, saying that the candidate was chaotic and disorganized? and not ready for the top state job.",
    "Speaking onstage before Trump spoke, Herbster briefly and obliquely addressed the allegations, saying that the political establishment? didnt want him to win.",
    "Pete Ricketts (R), who has said that Herbster would be a terrible governor? and supports a rival candidate, University of Nebraska regent Jim Pillen.",
    "Both Trump and Herbster sought to dismiss the allegations on Sunday, taking a defiant posture without discussing the accusations in specific terms.",
    "In a brief interview, Pillen dismissed his rivals suggestion that he is simply the latest in a line of conservatives to face false accusations.",
    "Herbster sued for defamation, saying that the false accusations and attacks on my character? had been part of a greater scheme? to defeat him.",
    "Elizabeth Todsen, a former aide to a state senator, said Herbster grabbed her buttocks after stopping to greet her table at the same event.",
    "He mentioned his preferred candidates in other states including Ohio, which is holding a closely watched Republican Senate primary Tuesday.",
    "When it was postponed, she and her sister-in-law headed to a Thibodeau rally nearby, both saying that they planned to support her.",
    "When I look at the people whove come out, I tend to take their word for it,? he said after speaking to supporters on Saturday.",
    "Multiple women told the Examiner that Herbster touched them inappropriately when they greeted him or posed for a photo.",
    "Taking a stance similar to Trump, Herbster has argued that both of them were falsely accused for political reasons.",
    "Its a playbook from the past,? Herbster told former Trump adviser Stephen K. Bannon on his War Room? podcast.",
    "Vance but on Sunday appeared to momentarily conflate his name with Josh Mandel, a rival Republican candidate.",
    "The gubernatorial candidate used his time to talk about being one of Trumps earliest supporters in 2016.",
    "Trump had been scheduled to rally with Herbster on Friday but the event was delayed because of weather.",
    "Some voters grabbed signs for the Herbster campaign, with the words Trump endorsed? under his name.",
    "In December, he parted ways with Lewandowski, when the adviser was accused of sexual harassment.",
    "Mandel,? said Trump, who in the same rally mocked President Biden for stumbling over his words.",
    "The sexual assault allegations against Herbster have become a contentious topic in the primary.",
    "The Herbster campaign, which did not respond to a request for comment, has had other problems.",
    "Last week, another one of the eight women alleged on the record that Herbster had groped her.",
    "They are trying to scare me out of this race and its not going to happen,? Herbster said.",
    "Arlene Osantowski, 81, had traveled nearly two hours to attend the Trump rally on Friday.",
    "I defend my friends.?\nThe former president invited Herbster onstage during his remarks.",
    "Hes the best suited for the job,? said Terry Coen, 36. I dont really think it matters.",
    "Herbster has suggested that Ricketts was behind them, which the governor has denied.",
    "He knew and trusted the two identified accusers, Slama and Todsen, he added.",
    "Trumps presence in the Nebraska race has pitted him against outgoing Gov.",
    "A lot of people, they look at you and say: You dont have to do it, sir.",
    "I respect many accomplishments President Trump had,? Ricketts said.",
    "Trump recently endorsed author and venture capitalist J.D.",
    "Many were skeptical of the allegations against Herbster.",
    "In January, the governor endorsed Pillen.",
    "Look what they did to Brett M. Kavanaugh.",
    "Look what they did to Clarence Thomas.",
    "Look what they did to Donald J. Trump.",
    "This is not a question of politics.",
    "This is my show,? Herbster added.",
    "He has denied the accusations.",
    "Weve endorsed J.P., right?",
    "NEBRASKA CITY, Neb.",
    "J.D."
  ]
}