{
  "id": 7357,
  "mediaId": 151,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Trump flops in Georgia: 5 takeaways from a big primary night",
  "image": "https://www.politico.com/dims4/default/c374fef/2147483647/legacy_thumbnail/1200x798%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F6e%2F03%2F7342ce7a467dbdedd4334d43e87c%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1399107165",
  "link": "https://www.politico.com/news/2022/05/25/trump-georgia-five-takeaways-primary-2022-00035017",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    984,
    1147,
    1434,
    1459,
    2095,
    2136,
    428,
    2555,
    2617,
    2672
  ],
  "sentences": [
    "The renewed nationwide debate over abortion access could have blown the race wide open for his progressive challenger Jessica Cisneros, who made women's health care a more central theme of her campaign in the weeks following the revelation that the Supreme Court was preparing to strike down Roe v. Wade.",
    "Election administrators versus the Big Lie\nMore than any other primary this year, Raffensperger's contest was a test of the salience of Trump's lie that the 2020 election was stolen, after Raffensperger refused to find votes for him in Georgia.",
    "But of all the states that have held primaries so far, Trump arguably had more skin in the game in Georgia than anywhere else, after losing the state in 2020 and then watching the U.S. Senate fall to Democrats there the following year.",
    "With votes still being counted in Alabama, Arkansas, Georgia and Texas, here are five takeaways from Tuesday's so-called SEC primary:\nTrump's big flop\nIt's almost impossible to overstate how bad Georgia was for Donald Trump.",
    "Forty percent of Republican primary voters polled by the Texas Hispanic Policy Foundation last month said they'd never vote for George P. Bush, two-thirds of them citing his membership in the Bush family as a reason.",
    "In doing so, Pence attempted to fashion himself as a sunny party statesman  I will always believe there is more that unites us than divides us, he said on Monday, ahead of a possible presidential run of his own.",
    "Jason Shepherd, a former chair of the Republican Party in Georgia's Cobb County, in the Atlanta suburbs, said late Tuesday that this has been a wholesale rejection of Donald Trump's brand of politics.",
    "Cisneros outperformed her March 1 primary performance in the northern part of the district, but so did Cuellar in his home base of Laredo and throughout the culturally conservative Rio Grande Valley.",
    "He split with much of his family to endorse Trump, campaigned hard on his support for a border wall and, late in the campaign, released an ad that took his name  and its liability  on directly.",
    "Then there was Rep. Jody Hice, the Trump-backed candidate for secretary of state who ran so far behind incumbent Brad Raffensperger that he failed even to force Raffensperger into a runoff.",
    "If there is any cosmic political karma, Brian Kemp deserves every bit of it, said John Watson, a former chair of the Georgia Republican Party, said, This is the payback of all paybacks.",
    "| Joe Raedle/Getty Images\nBy David Siders, Adam Wren and Ally Mutnick\n 05/25/2022 01:48 AM EDT\nBrian Kemp humiliated Donald Trump in Georgia, while Texas laid the Bush dynasty to rest.",
    "But what Raffensperger's performance laid bare is that Trump's obsession with 2020 may not be an especially salient voting concern  at least not for a majority of primary voters.",
    "This time, though, a cadre of bold-faced GOP candidates crossed Trump to make that happen  adding insult to injury by rallying around the Georgia governor excoriated by Trump.",
    "Not only did he loan his longtime aide Marc Short to Kemp's campaign down the homestretch, Pence also appeared at an election-eve Kemp rally in suburban Atlanta to stump.",
    "And Cuellar's brand in the southern part of the district, as a moderate Blue Dog Democrat who is pro-gun, makes him more impervious to the national political trends.",
    "But Raffensperger's victory does not appear to be a one-off, as Republicans have now favored elections administrators with experience in a series of primaries.",
    "But Texas's 28th District cobbles together two parts of Texas that are very different culturally, and Cuellar's political instincts may have played out.",
    "But no matter what happens, his primary runoff makes clear that abortion rights is not a runaway winner for the party in every slice of the country.",
    "He has been universally unsuccessful, Christie told POLITICO of what he called Trump's vendetta tour targeting Republican gubernatorial candidates.",
    "Trump berated him, the state GOP passed a resolution to censure him, and he drew a Trump-backed challenge from a credible opponent, Rep. Jody Hice.",
    "And that's to say nothing of two Trump-backed House candidates, Vernon Jones and Jake Evans, who were running second in their respective primaries.",
    "As one Republican strategist familiar with the race said, Paxton has been a conservative, he's been a fighter, that's what primary voters want.",
    "But on Tuesday, it was Raffensperger's surprising vote total  not Kemp's  that traditionalist Republicans in Georgia were texting around.",
    "Bush, the Texas land commissioner, got clobbered in his bid to unseat Texas's scandal-plagued, Trump-backed attorney general, Ken Paxton.",
    "Brian Kemp's friends in high places\nA Trump-backed gubernatorial candidate lost a primary for the third time this month on Tuesday night.",
    "Cuellar, meanwhile, doubled down on his opposition to abortion except in the case of rape, incest, and danger to the life of the mother.",
    "Abortion rights is no clear winner\nWe still don't know the fate of Rep. Henry Cuellar (D-Texas), the last anti-abortion House Democrat.",
    "Trump's pick for attorney general, John Gordon, got walloped by incumbent Chris Carr, with roughly 500,000 votes separating the two.",
    "Republicans in upcoming primaries will still have an opportunity to nominate conspiracy theorists to run their state elections.",
    "The border counties in the region are heavily Catholic and perhaps just as motivated to vote to help restrict abortion access.",
    "In Idaho, the primary for secretary of state went to Ada County Clerk Phil McGrane, despite his acknowledgment Joe Biden won.",
    "It's a sign of a GOP establishment increasingly willing to take on Trump, even as they continue to embrace his policy agenda.",
    "The end of the Bush era\nIt was bad enough for the Bush dynasty that George P. Bush, the last Bush in office, lost on Tuesday.",
    "Pete Ricketts, who helped beat back the Trump-green-light campaign of Charles Herbster earlier this month, joined Gov.",
    "Democrats hope the abortion debate will energize their base in swing seats across the country  and it still might.",
    "Her team's goal was to run up the margins in the counties around San Antonio, where abortion access is popular.",
    "Doug Ducey of Arizona, the sitting co-chair of the Republican Governors Association, and former New Jersey Gov.",
    "Polls consistently find that a large majority of Republicans still believe that the 2020 election was rigged.",
    "For now, at least, it's lights out for a family that for decades was a giant in Republican Party politics.",
    "Jeb Bush, George P. Bush bent over backward to distance himself from his family's moderate credentials.",
    "Brain Kemp's thrashing of David Perdue, the former senator recruited by Trump to run against him.",
    "Nebraska Secretary of State Bob Evnen, who has pushed back against the Big Lie, won his primary.",
    "But the most dramatic incursion on Trump's turf came from his former Vice President Mike Pence.",
    "Trump's preferred candidate for insurance commissioner, Patrick Witt, lost by a similar margin.",
    "Trump was not without victories  most significantly Herschel Walker in the U.S. Senate primary.",
    "In a small but critical set of primaries, the Trump brand got its toughest test yet this year.",
    "Brian Kemp speaks during his primary night election party on May 24, 2022 in Atlanta, Georgia.",
    "He also framed the race as the GOP's future versus its past grievances over the 2020 election.",
    "Former President George W. Bush appeared as a special guest at a Texas fundraiser for Kemp.",
    "For the diminished, establishment wing of the Republican Party, it was proof of life.",
    "He said he was proud of his family, but that this race isn't about my last name.",
    "So did the salience of the Big Lie and, on the Democratic side, abortion rights.",
    "Chris Christie as a member of the establishment cavalry coming to Kemp's aide.",
    "All this, of course, after Trump dumped $2.5 million into Perdue's campaign.",
    "Early on, most Republicans in Georgia figured Raffensperger for dead.",
    "Election administrators are white-knuckling their way to victory.",
    "As for Bush, he said, I think the Bush dynasty is done.",
    "It got even uglier for Trump further down the ballot.",
    "But this was not the most effective trial balloon.",
    "On Tuesday, Georgia repudiated Trump once again.",
    "Bush didn't lose in spite of his family name.",
    "He lost at least in part because of it.",
    "Republican gubernatorial candidate Gov.",
    "But what was worse was the reason.",
    "The rest of it, they'll live with.",
    "It's about Ken Paxton's crimes.",
    "The result was widely expected.",
    "The son of former Florida Gov.",
    "He is winless.",
    "There was Gov.",
    "Nebraska Gov.",
    "It wasn't."
  ]
}