{
  "id": 7432,
  "mediaId": 305,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Herschel Walker Claims Trump Never Said The Presidential Election Was 'Stolen'",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/5861c6d69e63460d597f5270dce8b638.jpg",
  "link": "https://www.theroot.com/herschel-walker-somehow-claims-trump-never-said-electio-1848971149",
  "sentiment": "-0.809",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Murjani Rawls",
  "authorUrl": "https://www.theroot.com/author/murjanirawls",
  "termIds": [
    815,
    1147,
    1951,
    146,
    428,
    571,
    2555,
    2672,
    2945
  ],
  "sentences": [
    "Last week, Trump said at a rally in Texas that he was writing a book named The Crime of the Century based on his false allegations of voter fraud, regarding the 2020 election.",
    "Then Walker went on to say that something went on in the election, never specifying what  even trying to drag Democratic gubernatorial candidate Stacey Abrams into it.",
    "Nevertheless, Walker is projected to win the GOP nomination for the Senate race in Georgia in a matchup with Democratic incumbent Raphael Warnock this fall.",
    "He then sought to turn the question around, noting that Democratic gubernatorial candidate Stacey Abrams did not concede during her 2018 election.",
    "Spencer then noted that while Abrams has not conceded, she has not brought it up on a regular basis for a year and a half as Trump has done.",
    "The Georgia primary races have started today, and GOP Senate candidate Herschel Walker couldnt help but give another priceless soundbite.",
    "Was Herschel Walker just not around on Jan. 6th, 2021, or see the audits across the country that found no evidence of voter tampering?",
    "During an interview with Atlanta-based news station WAGA-TV this week, news anchor Russ Spencer asked Walker about the claims.",
    "According to Newsweek, Walker claims that former President Donald Trump never said the 2020 Presidental election was stolen.",
    "Hes never said that to me, Walker responded, prompting Spencer to point out that Trump has said it over and over.",
    "No, its not that Walker has a cure for COVID or the lack of understanding of Americas energy policies.",
    "But in that instance right there, I said, Guys, theres people that theyre unhappy with the election.",
    "Im not saying the presidentbut everyone knows that something happened in the election.",
    "I dont know what it wasbut something happened because people are angry, Walker said.",
    "Walker said if he did not believe Trumps claims, he would disagree with him.",
    "Georgia voters, make the right decision, please.",
    "I dont know whether President Trump said that.",
    "I think reporters said that.",
    "I think something happened.",
    "Do you know what happened?",
    "Please."
  ]
}