{
  "id": 7444,
  "mediaId": 943,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "What to watch in Tuesdays primaries: Trumps bid to reshape GOP faces biggest hurdles in Georgia",
  "image": "https://www.chicagotribune.com/resizer/uLInV-qBi1asHFqGfkjia6WtNdg=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/H7S455RG4EIWIKAME6JTYTZYFE.jpg",
  "link": "https://www.chicagotribune.com/nation-world/ct-aud-nw-primary-elections-georgia-gop-20220524-vftfvppv5ffghfq7tydjvrk6xu-story.html",
  "sentiment": "0.0",
  "mediaOutlet": "Chicago Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STEVE PEOPLES and JEFF AMY",
  "authorUrl": "",
  "termIds": [
    815,
    896,
    1147,
    1434,
    1951,
    2095,
    4325,
    428,
    2537,
    2555,
    2672
  ],
  "sentences": [
    "The law made it harder to vote by mail, which was popular among Democrats in 2020 amid the pandemic; introduced new voter identification requirements that critics warned might disenfranchise Black voters; and expanded early voting in rural areas that typically vote Republican.",
    "ATLANTA  Donald Trump hopes to avoid a stinging defeat in the Georgia governors race on Tuesday as Republican primary voters decide the fate of the former presidents hand-picked candidate to lead one of the most competitive political battlegrounds in the U.S.",
    "When Brian Kemp prevails on Tuesday, he will prove that voters want their leaders to focus on the everyday issues in their lives like high gas prices and rising crime, not indulging the petty grievances of another politician, Hogan told The Associated Press.",
    "On the Democratic side in Georgia, two congressional incumbents, Reps. Lucy McBath and Carolyn Bourdeaux, were running against each other in suburban Atlanta, forced into a rare incumbent-on-incumbent primary after Republicans re-drew the congressional map.",
    "Republicans have stepped up their criticism of Abrams since she told a Democratic dinner on Saturday that I am tired of hearing about being the the best state in the country to do business when we are the worst state in the country to live.",
    "In a show of anti-Trump defiance, the Republican governors of Arizona, Nebraska and Maryland have lined up behind Kemp, who refused to support Trumps baseless claims that the 2020 election in Georgia and other swing states was stolen.",
    "Democrats were especially focused on a runoff election in south Texas, where longtime incumbent Rep. Henry Cuellar is facing a fierce challenge from progressive Jessica Cisneros in a race where abortion is a prominent issue.",
    "Meanwhile, Republicans and Democrats elsewhere are grappling with ideological and strategic divisions that will determine what kind of candidates to nominate and which issues to prioritize for the November general election.",
    "While Democrats are uniting behind our candidates, Republicans are in chaos as they run on an extreme agenda and try to outdo each other as the most MAGA candidate, said Democratic National Committee Chair Jaime Harrison.",
    "Leading Trump ally Rep. Marjorie Taylor Greene is also expected to win her primary election in the states 14th congressional district, despite a first term marred by conspiracy theories and controversy.",
    "Brian Kemp refused to accept Trumps baseless claims of widespread voter fraud in Georgia, he sought retribution by personally recruiting former Republican Sen. David Perdue to mount a primary challenge.",
    "Brooks, a leading figure at the Jan. 6 Stop the Steal rally that preceded the Capitol attack, initially won Trumps endorsement, although Trump rescinded it after watching Brooks struggle in the polls.",
    "Trump-backed former NFL star Herschel Walker is poised to win Georgias GOP Senate nomination after fending off conservative opponents who raised questions about his history of domestic violence.",
    "When she told Black farmers, you dont need to be on the farm, and when she told Black workers in hospitality and all this ... she is demeaning her own race when it comes to that, Perdue said.",
    "On the eve of the election, Perdues allies were bracing for a lopsided defeat, the only question being whether Kemp would win the 50% majority he needs to avoid a runoff election next month.",
    "In the GOP primary for secretary of state, Trump has railed against GOP incumbent Brad Raffensperger, who refused support the former presidents direct calls to overturn the 2020 election.",
    "Meanwhile, the Georgia Republican primary for governor  and the GOPs secretary of state contest will have a direct impact on Georgias election system for the 2024 presidential contest.",
    "The new law also bans the practice of handing out food or water within 150 feet of a polling place, a practice common in urban areas where there are typically long voter lines.",
    "While Trump remains deeply popular among the partys most loyal voters, the opening stage of the midterm primary season has shown they dont always side with his picks.",
    "Perdue, for his part, ended the day saying Stacey Abrams, who is Black and running unopposed for the Democratic nomination for governor, was demeaning her own race.",
    "In a clear illustration of the divide among top Republicans, Trumps own vice president, Mike Pence, rallied with Kemp in the Atlanta suburbs on Monday evening.",
    "Elections are about the future, he told the crowd, adding that when you vote for Brian Kemp tomorrow, you will say yes to a future of freedom here in Georgia.",
    "Were not going to have a runoff, said Matha Zoller, a longtime Republican activist and northeast Georgia talk show host with ties to both Trump and Perdue.",
    "Tuesday marks the first election held under new voting laws adopted by the Republican-backed state legislature in response to Trumps unfounded grievances.",
    "He likened the comment to remarks Abrams made in 2018 arguing people shouldnt have to go into agriculture or hospitality to make a living in Georgia.",
    "No state has more consequential elections this week than Georgia, a longtime Republican stronghold that has shifted Democratic in recent elections.",
    "Through the end of Friday, 857,401 voters cast early ballots, including 795,567 who voted early in-person, according to the secretary of state.",
    "And in Alabama, conservative firebrand Rep. Mo Brooks is running to represent the GOP in the race to replace retiring Sen. Richard Shelby.",
    "This year, Trumps obsession with his 2020 loss have loomed over Republican primary elections for governor, Senate and secretary of state.",
    "Biden defeated Trump in Georgia by less than 12,000 votes total in 2020, and Democrats narrowly won both Senate seats two months later.",
    "But in an interview Monday with conservative radio host John Fredericks and former Trump adviser Peter Navarro, Perdue went further.",
    "Democrats downplayed the voting disparity, noting that the states highest-profile contests were playing out on the Republican side.",
    "But that may prove to be a bad bet as Kemp has emerged as a powerful fundraiser who has tapped into the benefits of incumbency.",
    "That figures shattered early voting turnout in the 2020 presidential election, when a total of 254,883 Georgians voted early.",
    "Abrams has said her comments were meant to address Georgias dismal rankings for mental health access and maternal mortality.",
    "In Arkansas, former Trump aide Sarah Huckabee Sanders is expected to claim the Republican governors nomination.",
    "In the final days of the campaign, he unveiled a $5.5 billion, 8,100-job Hyundai Motor plant near Savannah.",
    "But none has been more consumed by Trump and his lie that the 2020 election was stolen than Georgia.",
    "Early voting totals in Georgia suggest enormous voter enthusiasm  especially on the Republican side.",
    "The winner will serve as Georgias chief election officer in the 2024 presidential election.",
    "You will say yes to our most cherished values at the heart of everything we hold dear.",
    "Raffensperger faces three primary challengers, including Trump-backed Rep. Jody Hice.",
    "In all, five states are voting, including Alabama, Arkansas, Texas and Minnesota.",
    "That includes 483,149 votes cast by Republicans and 368,949 votes by Democrats.",
    "Other prominent Republicans, meanwhile, are growing increasingly assertive.",
    "The results could raise questions about where power resides within the GOP.",
    "Larry Hogan suggested a Kemp victory would send a clear message to Trump.",
    "Walker would face Democratic incumbent, Sen. Raphael Warnock, this fall.",
    "Republicans will also decide a series of lower-profile primaries.",
    "Cuellar is last anti-abortion Democrat serving in the House.",
    "He asserted that she was referring to Black farmers.",
    "Peoples reported from Washington.",
    "Its going to be embarrassing.",
    "After incumbent GOP Gov.",
    "Maryland Gov."
  ]
}