{
  "id": 7472,
  "mediaId": 19,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "*** Election Night Livewire *** Georgia, Alabama, Texas, Arkansas, Minnesota Vote in Key Primaries",
  "image": "https://media.breitbart.com/media/2022/04/AP22115061957308-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/24/election-night-livewire-georgia-alabama-texas-arkansas-minnesota-vote-in-key-primaries/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Boyle",
  "authorUrl": "https://www.breitbart.com/author/matthew-boyle/",
  "termIds": [
    815,
    896,
    2095,
    2422,
    2475,
    4325,
    2537,
    2551,
    2557,
    2672,
    2796,
    2934
  ],
  "sentences": [
    "ET\nFormer President Donald Trumps team passes along this list of endorsements he has made in tonights elections:\nAlabama-01: Carl, Jerry\nAlabama-02: Moore, Barry\nAlabama-03: Rogers, Mike\nAlabama-04: Aderholt, Robert\nAlabama-06: Palmer, Gary\n\nArkansas-Senate: Boozman, John\nArkansas-Governor: Sanders, Sarah Huckabee\nArkansas-Attorney General: Griffin, Tim\nArkansas-01: Crawford, Rick\nArkansas-04: Westerman, Bruce\n\nGeorgia-Governor: Perdue, David\nGeorgia-Lieutenant Governor: Jones, Burt\nGeorgia-Secretary of State: Hice, Jody\nGeorgia-Attorney General: Gordon, John\nGeorgia-Insurance Commissioner: Witt, Patrick\nGeorgia-Senate: Walker, Herschel\nGeorgia-01: Carter, Buddy\nGeorgia-06: Evans, Jake\nGeorgia-09: Clyde, Andrew\nGeorgia-10: Jones, Vernon\nGeorgia-11: Loudermilk, Barry\nGeorgia-12: Allen, Rick\nGeorgia-14: Greene, Marjorie Taylor\n\nTexas-Attorney General: Paxton, Ken\nTexas-Land Commissioner: Buckingham, Dawn\nTexas-State House-61: Frazier, Frederick\nTexas-State Senate-24: Flores, Pete\nTexas-Tarrant County-District Attorney: Sorrells, Phil\nTrump is expected to win many of these, but some are going to be tightespecially those in Georgia.",
    "ET:\nMSNBCs Steve Kornacki noticed the same thing Breitbart News did earlier about Raffensperger underperforming Kemp significantly:\nKeep in mind that the early/mail vote will be reported out first in most counties, with the same-day vote coming in as the night progresses  and if the pattern we've seen elsewhere this spring holds, Hice as a Trump-aligned candidate will fare better with the same-day vote\n Steve Kornacki (@SteveKornacki) May 24, 2022\nIts still earlier, but this could be bad for the Secretary of State in Georgia.",
    "Voters in Georgia, Alabama, Texas, and Arkansas are selecting their GOP and Democrat nominees in several hotly contested primary states on Tuesday, while voters in a key congressional district in Minnesota will select who will represent their parties in the seat the late Rep. Jim Hagedorn (R-MN) once represented.",
    "Perdue is the third Trump-backed governor candidate to lose in as many weeks https://t.co/Sie3a6qeqA pic.twitter.com/zLhCJkWtjm\n Grace Panetta (@grace_panetta) May 24, 2022\nWhile the Associated Press and the networks have not yet called it, it is looking like a very big night for Brian Kemp.",
    "Both Britt and Brooks have run America First-focused policy oriented campaigns, both pledging to cut immigration levels into the United States if electedand if these two end up in the runoff it could become a race to the right over the next month to see which one can outdo the other.",
    "Trump has many other endorsements on the line in the Peach State, too, and faces several tough races where he has made his most aggressive slew of picks yet, from those in the Secretary of State race to contested congressional primaries to many other down-ticket races and more.",
    "Perdue, backed by former President Donald Trump in one of Trumps highest profile intra-GOP fights to date, has trailed Kemp in many recent polls by significant margins but hopes that new voters not registering in polling data might make up the difference for him.",
    "ET:\nWith the polls closed everywhere there are elections today, the first results are starting to stream in in Minnesotaand the widow of the late Rep. Jim Hagedorn (R-MN), Jennifer Carnahan, is significantly trailing her two other opponents in the GOP primary.",
    "The winner between Kemp and Perdue will face off against Democrat Stacey Abrams in November, as Abrams seeks to make her second bid for the governors mansion as the Democrat nominee official on Tuesday night while she runs uncontested in that partys primary.",
    "Warnock became Georgia's first Black senator when he defeated GOP incumbent Kelly Loeffler in a special election runoff in 2021. https://t.co/Mo5ptTFS9I pic.twitter.com/cZ4v3Mkjoy\n AP Politics (@AP_Politics) May 24, 2022\nUPDATE 7:48 p.m.",
    "Trump had previously endorsed Rep. Mo Brooks (R-AL) in this race, but rescinded it later when he was performing badly in the polls against former chief of staff to outgoing Sen. Dick Shelby (R-AL) Katie Britt and veteran Mike Durant.",
    "Bush, who has been much more like modern Republicans than others in his family, is still being hampered by the Bush family nameand this race comes after a series of missteps by former GOP president George W. Bush in recent days.",
    "ET:\nWith about 3 percent reporting in Alabama according to the New York Times, results are looking a lot like recent polling with Katie Britt at 47.5 percent, Mo Brooks at 27.9 percent, and Mike Durant at 21.6 percent.",
    "ET:\nSarah Huckabee Sanders wins the GOP nomination for governor in Arkansas, another win for Trump:\nBREAKING: Sarah Huckabee Sanders wins Republican nomination for governor in Arkansas primary election.",
    "ET:\nPaxton has won in Texas, defeating the Bush dynasty:\nAustin, Texas (AP)  Texas Attorney General Ken Paxton wins GOP nomination for reelection while still under indictment, FBI investigation.",
    "ET\nThe first votes are showing up in Georgias results, according to the New York Times, in the Senate GOP primary where Herschel Walker has as expected taken a commanding lead out the gate.",
    "ET:\nSen. Raphael Warnock (D-GA) has won his primary in Georgia:\nU.S. Sen. Raphael Warnock has won his Democratic primary in Georgia as he looks to capture his first full term in office.",
    "Walkers win was decisive and comes with just 15 percent reporting in this primary:\nBREAKING: Herschel Walker wins Republican nomination for U.S. Senate in Georgia primary election.",
    "ET:\nWith 16 percent reporting now, and Kemps lead growinghe is at 74.3 percent and Perdue is at 21.4 percentsome are already calling the election for Kemp:\nBREAKING: Georgia Gov.",
    "ET:\nWith 2 percent reporting in Arkansass GOP governor primary, as expected, Sarah Huckabee Sanders has moved way out front into first place leading now by nearly 20 percent.",
    "This race could get interesting and is worth tracking closely as the night progresses to see if these early returns are a fluke for him or if he may end up in trouble later.",
    "ET:\nThe first votes are coming in in Texas, too, and in the 28th district with 28 percent reporting incumbent Democrat Rep. Henry Cuellar (D-TX) is in very serious trouble.",
    "ET:\nThe very first handfuls of votes are coming in in Alabama, with Katie Britt out front with an early lead and Mo Brooks in second place and Mike Durant in third place.",
    "Brian Kemp defeats Donald Trump-backed challenger David Perdue after a furious push by the former president to punish Kemp for not overturning the 2020 election results.",
    "Brian Kemp has won the GOP primary and defeated Trump-backed former Sen. David Perdue (R-GA), handing Trump yet another loss for the scoreboard this year:\nGeorgia Gov.",
    "In Arkansas, Sen. John Boozman (R-AR) aims to fend off a pair of primary challengers who came at him despite his long history of strength on the issue of immigration.",
    "ET:\nWith about 5 percent reporting in the governor primary in Georgia, Kemps lead is more than 50 percent as the governor has 73.1 percent to Perdues 22.5 percent.",
    "ET:\nTrump-backed picks in Georgia House primaries are also struggling in early returns as in both the sixth and tenth districts Trumps candidates trail as of now.",
    "ET:\nRep. Marjorie Taylor Greene (R-GA) has won her primary in Georgia:\nU.S. Rep. Marjorie Taylor Greene has won a GOP primary for her Georgia congressional seat.",
    "ET:\nVernon Jones has pulled into second place now in the 10th district in Georgia but is still well behind there, trailing Mike Collins by more than 10 percent.",
    "Brooks has seen a resurgence in the polls, and Durant has fallen, to the point where Durant says he will back Brooks if he does not make the runoff with Britt.",
    "Greene was stripped of committee assignments during her first term over racist remarks, an embrace of conspiracy theories and a past endorsement of violence.",
    "In the sixth, Jake EvansTrumps pickis down at 27.8 percent, trailing Rich McCormick, who has 38.6 percent, by more than 10 points with 4 percent reporting.",
    "Texas has several interesting races to wrap up in runoffs, with Attorney General Ken Paxton aiming to fend off a primary challenge from George P. Bush.",
    "ET:\nWith now 8 percent reporting in the GOP primary for governor in Arkansas, Sarah Huckabee Sanders has exploded her lead to more than 60 percent.",
    "Socialist Jessica Cisneros, with 51.9 percent, leads incumbent Democrat Rep. Henry Cuellar (D-TX)who has 40.1 percentby less than a thousand votes.",
    "Brian Kemp has taken a similarly strong lead in the first batch of votes in, with 77.3 percent compared to former Sen. David Perdues 19.6 percent.",
    "And in Minnesota, several Republicans are vying to replace the late Hagedorn and this race could also say a lot about the future of the party.",
    "ET:\nThe polls have closed in Alabama and part of Texas, and others are calling Kemp the winner in Georgias governor race t\nAs expected, Gov.",
    "Texans will also decide if Rep. Henry Cuellar (D-TX) will survive to the November election or if he will lose his primary to a socialist.",
    "ET:\nKemp is maintaining his commanding lead with 11 percent reporting now, with 72 percent of the vote compared to Perdues 23.2 percent.",
    "While Perdue is within 50 points now, this is a wallopingit will probably get somewhat closer but not a strong night so far for Perdue.",
    "Several Republicans were worried about Carnahan gaining traction, and are breathing a sigh of relief as these first results trickle in.",
    "In Alabama, a three-way U.S. Senate primary will likely eliminate one contender as the other two advance to a runoff a month from now.",
    "Brian Kemp wins the GOP nomination & defeats Trump-endorsed primary challenger David Perdue, Insider and @DecisionDeskHQ project.",
    "ET:\nWith 68 percent reporting now in the Texas 28th congressional district Democrat primary, things have considerably tightened.",
    "Brian Kemp (R) defeats David Perdue (R) in the #GAGOV GOP primary and Herschel Walker (R) wins the GOP nomination for #GASEN.",
    "Its still early there but could be very problematic for Cuellarand for Democrat efforts to hold this district in November.",
    "Sarah Huckabee Sandersthe Trump-backed former White House press secretary who is also the daughter of former Arkansas Gov.",
    "Trump has also backed former NFL running back Herschel Walker for U.S. Senate here, and Walker is expected to easily win.",
    "Dave Wasserman (@Redistrict) May 24, 2022\nStill no formal call there yet, but looking very likely that Kemp will win.",
    "ET:\nBecause she ran unopposed, Democrat Stacey Abrams is now officially the Democrat nominee for governor in Georgia.",
    "His socialist opponent Jessica Cisneros have a several thousand vote lead of 85 percent to Cuellars 15 percent.",
    "With 19 percent reporting in the tenth district, Trumps pick Vernon Jones is in third place with 16.1 percent.",
    "https://t.co/gPbfIhHwH5 pic.twitter.com/6XgcogNpfZ\n AP Politics (@AP_Politics) May 25, 2022\nUPDATE 8:35 p.m.",
    "But assuming nobody breaks 50 percent, the top two vote-getters will advance to a runoff a month from now.",
    "ET:\nTrump-backed incumbent Ken Paxton is dominating George P. Bush in the Attorney General race in Texas.",
    "This is a win for former President Donald Trump, who endorsed him early after encouraging Walker to run.",
    "ET\nIts still very early, but Secretary of State Brad Raffensperger in Georgia is running far below Gov.",
    "ET:\nIncumbent Georgia Attorney General Chris Carr has won his primary, according to the New York Times.",
    "Boozman is expected to win, but how close this race is could say a lot about the future of the party.",
    "Trumps early backing kept other potential contenders for this seat at bay and out of this race.",
    "Brian Kemp aims to fend off a primary challenge from former U.S. Sen. David Perdue (R-GA).",
    "Mike Huckabeetrails in her primary early, but it is early and expect that to change soon.",
    "He defeated Trump-backed John Gordon for the nod, another setback for Trump in Georgia.",
    "ET:\nHerschel Walker has won the GOP nomination for U.S. Senate in Georgia, as expected.",
    "Walker will face Democrat Sen. Raphael Warnock (D-GA) in Novembers general election.",
    "ET:\nThe polls have closed in Georgia and the first results are expected imminently.",
    "Follow along here for live updates as the results pour in from across the country.",
    "With 31 percent reporting, Paxton has 66.5 percent compared to Bushs 33.5 percent.",
    "https://t.co/2Eptn5RNB9\n AP Politics (@AP_Politics) May 25, 2022\nUPDATE 8:51 p.m.",
    "https://t.co/2nlgpji7ac\n AP Politics (@AP_Politics) May 25, 2022\nUPDATE 9:29 p.m.",
    "https://t.co/2nlgpji7ac\n AP Politics (@AP_Politics) May 24, 2022\nUPDATE 7:59 p.m.",
    "ET:\nThe polls are closed in Arkansas and the first results are pouring in there.",
    "Georgias banner race is the GOP governor primary, where incumbent Gov.",
    "There are less than 100 votes counted so far, so its very early there.",
    "Mike Collins has 31.9 percent and David Curry has 18.6 percent there.",
    "Sen. John Boozman (R-AR) has a healthy early lead in his primary.",
    "Expect this to change and probably tighten as the night goes on.",
    "The victory sets up a rematch against Democrat Stacey Abrams.",
    "Gregory Korte (@gregorykorte) May 25, 2022\nUPDATE 9:32 p.m.",
    "ET, and in Minnesota and the rest of Texas at 9:00 p.m.",
    "It is still early, but it is not looking good for her.",
    "ET, in some of Texas and all of Alabama at 8:00 p.m.",
    "She is well on her way to a very likely victory.",
    "He is just shy of 80 percent to start the night.",
    "Still early there, and this could change.",
    "ET:\nIt is now official in Georgia: Gov.",
    "The polls close in Georgia at 7:00 p.m.",
    "This one is going down to the wire.",
    "Follow along here for the latest.",
    "Brian Kemp in the early returns.",
    "Tough night for the Bush family.",
    "#APRaceCall at 8:30 p.m. CDT.",
    "#APRaceCall at 7:56 p.m. EDT.",
    "ET, in Arkansas at 8:30 p.m.",
    "UPDATE 9:33 p.m.",
    "UPDATE 8:30 p.m.",
    "UPDATE 8:31 p.m.",
    "UPDATE 8:36 p.m.",
    "UPDATE 9:22 p.m.",
    "UPDATE 9:25 p.m.",
    "UPDATE 8:47 p.m.",
    "UPDATE 8:42 p.m.",
    "UPDATE 8:48 p.m.",
    "UPDATE 7:53 p.m.",
    "UPDATE 7:57 p.m.",
    "UPDATE 7:28 p.m.",
    "UPDATE 7:50 p.m.",
    "UPDATE 8:05 p.m.",
    "UPDATE 8:01 p.m.",
    "UPDATE 8:28 p.m.",
    "UPDATE 8:14 p.m.",
    "UPDATE 8:10 p.m.",
    "UPDATE 7:18 p.m.",
    "UPDATE 7:13 p.m.",
    "UPDATE 7:15 p.m.",
    "UPDATE 7:09 p.m.",
    "UPDATE 7:11 p.m.",
    "ET\nGov.",
    "ET."
  ]
}