{
  "id": 7536,
  "mediaId": 223,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Herschel Walker on Abortion: 'There's No Exception in My Mind'",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/270/5423eecf-c667-4ece-b495-da9c2d4b69c0.jpg",
  "link": "https://townhall.com/tipsheet/madelineleesman/2022/05/20/herschel-walker-on-abortion-theres-no-exception-in-my-mind-n2607578",
  "sentiment": "0.923",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Leesman",
  "authorUrl": "https://townhall.com/tipsheet/madelineleesman/",
  "termIds": [
    815,
    1136,
    5980,
    146,
    342,
    571,
    5672,
    2672
  ],
  "sentences": [
    "Source: AP Photo/Ben Gray\nGeorgia Senate candidate and former professional football player Herschel Walker said on Wednesday that he supports restrictions on abortion without exceptions for rape, incest or the health of the mother.",
    "Herschel Walker will be a most effective champion for unborn babies and their mothers in Washington and he has demonstrated the passion and perseverance it takes to win the critically important Georgia Senate race.",
    "National Right to Life is pleased to endorse Herschel Walker for the U.S. Senate, Carol Tobias, president of National Right to Life, said in a statement.",
    "In addition, Walker opposes the Womens Health Protection Act (WHPA), a Democrat-led piece of legislation that would codify Roe v. Wade into federal law.",
    "Walkers stance for life stands in stark contrast to the out-of-touch record of Warnock who supports abortion for any reason until birth.",
    "The organization added that Walker supports pro-life protections and opposes using taxpayer dollars to fund abortion providers.",
    "He is a support of the Hyde Amendment, which protects federal funds from being used for abortions in government programs.",
    "And Ive seen some people, theyve had some tough times, but I always said, No matter what, tough times make tough people.",
    "Georgia deserves a pro-life senator like Herschel Walker who is committed to building a culture of life, said Tobias.",
    "In a statement shared with The Hill, Walkers campaign said the he is pro-life and will not apologize for that.",
    "Democratic Sen. Raphael Warnock, from Georgia, supports pro-abortion policies.",
    "Last month, the pro-life organization National Right to Life endorsed Walker.",
    "The legislation would undermine pro-life laws enacted at the state level.",
    "Walker made the remarks to reporters after a campaign speech this week.",
    "You never know what a child is going to become, he added.",
    "Theres no exception in my mind, he said.",
    "Like I say, I believe in life.",
    "I believe in life."
  ]
}