{
  "id": 7539,
  "mediaId": 558,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Senate candidate Herschel Walker failed to disclose millions in earnings",
  "image": "https://s.yimg.com/ny/api/res/1.2/gHyJuFutPq2xx_1Ms1E_WQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTM5NztjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/S9RdQQEfivAgNuS8QvHytg--~B/aD0zOTY7dz03MDQ7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/thegrio_yahoo_articles_946/ea706a802407d455b33314a72ad7e507",
  "link": "https://news.yahoo.com/senate-candidate-herschel-walker-failed-202500706.html",
  "sentiment": "-0.652",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1147,
    428,
    550,
    571,
    578,
    3561,
    2672
  ],
  "sentences": [
    "Sunday, Walker made changes to his candidate report, reflecting that hed made $3.2 million from H. Walker Enterprises in addition to his previously reported earnings, bringing their actual total earnings from late 2020 through the end of 2021 to $4.1 million.",
    "The U.S. Senate Select Committee on Ethics mandates that senatorial candidates submit a candidate report describing income, assets, compensation, and other financial detail in the span of 30 days of officially filing for candidacy, cites Business Insider.",
    "As reported in Business Insider, the former standout University of Georgia running back and NFL star filed candidate financial documents five months later its staffers reviewed that changed his original income figure to over four times the amount.",
    "Despite Walkers front-runner status, his Republican primary opponents hope to drive him into a June runoff, making their fair share of attacks on his character, including mentions of alleged domestic abuse.",
    "Former president Donald Trump threw his support behind Walkers Senate campaign, and he faces an ambitious mix of Republican rivals, including two other Black men, in Georgias primary on May 24.",
    "Candidates who fail to do so face the possibility of a fine or Justice Department inquiry, but misrepresenting that amount goes largely unnoticed  either by authorities or potential voters.",
    "Georgia Republican Herschel Walker, currently leading its race for the U.S. Senate, failed to disclose over $3 million in earnings in his last federal disclosure form.",
    "Last month, Georgia Agriculture Commissioner Gary Black, thought to be Walkers top adversary, did so in a stump speech at a Putnam County Republican Party gathering.",
    "The sum was made up of earnings from several corporations, including $100,000 in income from Renaissance Man Food Services, LLC.",
    "Walkers candidate documents filed five months later changed his original income figure to over four times the amount.",
    "If successful, Walker will face incumbent Democratic Sen. Raphael Warnock in the November general election.",
    "In December, Walker filed paperwork listing his and his wifes joint earnings as $927,886.",
    "Folks, he cant win in November, Black told them, according to .",
    "The post appeared first on .",
    "The baggage is too heavy.",
    "Itll never happen."
  ]
}