{
  "id": 7543,
  "mediaId": 169,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Herschel Walker left out millions in his financial report",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/04/herschel-walker-0401221.jpg",
  "link": "https://www.salon.com/2022/05/20/herschel-walker-left-out-millions-in-his-financial-report_partner/",
  "sentiment": "-0.488",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meaghan Ellis",
  "authorUrl": "https://www.salon.com/writer/meaghan_ellis",
  "termIds": [
    815,
    1147,
    2223,
    78,
    408,
    428,
    550
  ],
  "sentences": [
    "Under the laws stated in the U.S. Senate Select Committee on Ethics, all candidates are required to submit candidate reports that disclose \"their honoraria payments, income, assets, liabilities, compensation, and other personal financial details within 30 days of becoming a candidate,\" per Insider.",
    "According to Business Insider: \"Walker's original candidate report, filed in December 2021, listed him and his spouse cumulatively earning $927,886 from late 2020 to the end of 2021 through various corporations, including a $100,000 salary from 'Renaissance Man Food Services, LLC.'\"",
    "Herschel Walker, the Georgia Republican candidate running for the U.S. Senate endorsed by former President Donald Trump, is facing scrutiny for failing to report more than $3 million in earnings over a five-month period as part of his federal financial disclosure.",
    "Per the H. Walker Enterprises' website, the company stated that its mission is to \"establish a business structure capable of servicing food service, corporate and retail customers with a variety of products on a national level.\"",
    "According to Hedtler-Gaudette, Walker's decision to do so at such a late point on the campaign trail \"undermines 'the basic compact between a person running for office and the people they are trying to recruit to support them.'\"",
    "Business Insider's review of the amended documents indicates that he \"amended his overall income in the disclosure to $4.1 million, more than four times higher than the original candidate report.\"",
    "Five months after filing the original candidate report, Walker reportedly amended it to include that he'd garnered an additional $3.2 million through a company called \"H. Walker Enterprises.\"",
    "Speaking to Business Insider, Dylan Hedtler-Gaudette, who serves as the government affairs manager for the Project on Government Oversight, weighed in on Walker amending his reports.",
    "\"There's some potential a voter who may find him supportable may have already contributed some money on the basis of the information they had at that point,\" Hedtler-Gaudette said.",
    "Candidates that do not may face a number of different penalties including but not limited to a fine or an inquiry launched by the U.S Department of Justice (DOJ).",
    "However, it remains unclear what Walker's role is within the company as his campaign report describes the \"partnership distributions.\"",
    "\"But as we're seeing now, that information was incomplete.\""
  ]
}