{
  "id": 7585,
  "mediaId": 19,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Georgia Republican Herschel Walker Invites GOP Opponents to Unity Celebration on Primary Day",
  "image": "https://media.breitbart.com/media/2021/10/georgia-senate-candidate-herschel-walker-sept25-21-ap-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/09/georgia-republican-herschel-walker-invites-gop-opponents-to-unity-celebration-on-primary-day/",
  "sentiment": "0.493",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    815,
    1011,
    1136,
    1312,
    428,
    571,
    2672
  ],
  "sentences": [
    "#gasen #gapol https://t.co/5XCYzIAreO\n Greg Bluestein (@bluestein) May 9, 2022\nGoing into the primary election later this month, Walkers campaign is likely to feel confident after showing a commanding lead in the polls throughout the primary election cycle against his GOP opponents, as well as a slight edge over incumbent Sen. Raphael Warnock (D-GA) in a general election matchup.",
    "Walkers campaign said in a press release that running for office in his home state has been the greatest honor of my life and that he knew it was going to require hard work, sacrifice, and perseverance, which is why he wants to make sure the Republican party of Georgia is as unified as possible.",
    "Another GOP operative in Georgia told Breitbart News they felt the invite from Walker was arrogant, adding, Whether Herschel wins in a route or Georgia turns into Rich Strike 2.0, staffers for his opponents have spent the last year busting their asses for people they believe in.",
    "Georgia Republican Senate candidate Herschel Walker appeared to acknowledge a possible blowout in the primary as he dominates in the polls and invited his GOP opponents, their staff, and supporters to a unity celebration in an effort to bring everyone together on election day.",
    "In doing so, Walkers campaign, in an effort to bring everyone together, invited all U.S. Senate Republican candidates to bring their staff and top supporters to a unity celebration on May 24, 2022, the same day as the primary.",
    "#gapol https://t.co/2gRDjBIIJP\n Stephen Lawson (@StephenLawson_) May 9, 2022\nHowever, Walkers show of confidence was not looked at favorably by all Republicans in the state.",
    "One GOP operative working on behalf of the super PAC, Stephen Lawson, called Walkers invite to his primary opponents a classy move in a post on social media.",
    "Its as unappreciative of the work that goes into campaigns as it gets to say, hey come celebrate me (before the polls even close) instead of your hard work.",
    "Regardless of the outcome, I think it is important to focus on what brings us together  we can all agree that we need to defeat Raphael Warnock in November.",
    "The decisive move by the Walker campaign showed how confident he is going into the primary, one local reporter Greg Bluestein said about the invite.",
    "A recent poll from SurveyUSA, commissioned by local outlet 11 Alive, showed that Walker held a wide leader over the rest of the Republican field.",
    "This morning, he issued an invitation to his Senate GOP rivals to bring their staff and top donors to a unity celebration on primary night.",
    "Walker took 62 percent of the vote, far outpacing his closest competitor, Agriculture Commissioner Gary Black, who took six percent.",
    "Another recent poll, conducted by 34N22, a pro-Walker super PAC, also showed Walker with a ten-point lead over Warnock.",
    "If the 2020 election showed us anything, its that Republicans need to put aside differences and come together.",
    "The remaining four candidates showed a combined ten percent in the poll, with 21 percent undecided.",
    "More jolt: How confident is Herschel Walker in his GOP primary victory on May 24?",
    "Write to him at jbliss@breitbart.com or follow him on Twitter @JacobMBliss.",
    "The polling model showed Walker with 51.4 percent to Warnocks 41 percent.",
    "Now more than ever, its time to unitenot divide, the invite said.",
    "This is what real, winning leadership looks like, Lawson wrote.",
    "This is what real, winning leadership looks like.",
    "Jacob Bliss is a reporter for Breitbart News.",
    "Ashley Oliver contributed to this report.",
    "Classy move."
  ]
}