{
  "id": 7590,
  "mediaId": 65,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "ABC's Sunny Hostin condemned by Black, Latino Republicans for disparaging remarks: 'That's racism right there'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/a57206c6-d47c-4dce-b9e8-afed0952629f/ba8e59f3-2b63-438c-a1e4-0b2244ea1a19/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/view-host-sunny-hostin-condemned-by-black-latino-republicans",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Rutz",
  "authorUrl": "https://www.foxnews.com/person/r/david-rutz",
  "termIds": [
    815,
    1189,
    1611,
    4337,
    4677,
    16,
    428,
    482,
    2934
  ],
  "sentences": [
    "Last year, California Republican gubernatorial candidate Larry Elder was called the \"Black face of White supremacy\" in a Los Angeles Times column, and last month, far-left The Nation correspondent Elie Mystal wrote Georgia Republican Senate candidate Herschel Walker was \"an animated caricature of a Black person drawn by white conservatives The Walker campaign exists as a political minstrel show: a splashy rendition of what white Republicans think Black people look and sound like.\"",
    "MSNBC host Joy Reid last year compared Sen. Ted Cruz, R-Texas, a staunchly conservative Cuban-American, to the treacherous house slave Stephen in the film \"Django Unchained,\" and she's also referred to Supreme Court Justice Clarence Thomas as \"Uncle Clarence,\" a reference to the disparaging term \"Uncle Tom\" for Blacks seen as deferential to Whites.",
    "The VIEW DEFENDS BIDEN'S MAGA CROWD COMMENTS, SAYS HE WAS BEING KIND CALLING THEM EXTREME'\nDr. Ben Carson, who ran for the 2016 Republican presidential nomination and served as President Trump's Secretary of Housing and Urban Development, likened Hostin's logic to a \"relic of Jim Crow.\"",
    "Scott was the target of racially charged attacks from the left last month for not supporting the confirmation of Supreme Court nominee Ketanji Brown Jackson, who will become the first Black woman on the court when she takes the place of retiring Justice Stephen Breyer.",
    "THE VIEW' HOST WHOOPI GOLDBERG RETURNS FROM SUSPENSION OVER HOLOCAUST REMARKS: HONOR TO SIT AT THIS TABLE'\nThe offices of Sen. Tim Scott, R-S.C., the lone Black Senate Republican, and Sen. Marco Rubio, R-Fla., who is Cuban-American, declined a request for comment.",
    "\"The millions of free thinking, independent minded Black and Latino Americans who are in the Republican Party should continue to ignore the personal attacks and attempts to intimidate them by liberals like Sunny Hostin,\" he told Fox News Digital in a statement.",
    "\"The view of the RNC is that all minority Republicans are valued, appreciated, and respected and we look forward to welcoming even more into the GOP and seeing the record number of Black and Latino Republican candidates for Congress win in November.\"",
    "\"The View\" co-host Sunny Hostin's contention that being a Black Republican was an \"oxymoron\" and she didn't \"understand\" Black or Latino Republicans drew outrage from party members on Friday, with accusations of racism and calls for an apology.",
    "THE VIEW' LOSES IT OVER REPORT SUPREME COURT WILL OVERTURN ROE V. WADE: I SEE FASCISM DOWN THE LINE\nTexas Republican congressional candidate Mayra Flores said Hostin's remarks were racist and called on her to apologize immediately.",
    "Flores, who was born in Mexico and is pursuing a House seat in Texas' 34th District, said she was raised with conservative values and wouldn't abandon them, whereas Hostin \"obviously doesn't understand our culture.\"",
    "The panel became visibly uncomfortable as she went on to say, \"I don't understand either of you,\" referring to her and co-host Ana Navarro, who remains a Republican despite her staunch support for Democrats.",
    "Rep. Byron Donalds, R-Fla., suggested \"The View\" invite him on so he could explain why he was a Black Republican, and Texas 28th District U.S. House candiate Cassy Garcia tweeted, \"Wow.",
    "Hostin, after guest host Lindsey Granger said she was a Republican on Friday, interrupted her on the ABC daytime gabfest, saying, \"I feel like that's an oxymoron, a Black Republican.\"",
    "\"We like low taxes, a secure border & free speech; we want to protect life, we want school choice, and we dont want socialists in charge of the economy the list goes on!\"",
    "\"That's racism right there, when someone tells you because of the color of your skin, because of where you're from, you have to think a certain way.\"",
    "Hostin, who is Afro-Latina, openly supports Democrats and fawned over Sen. Elizabeth Warren, D-Mass., in the show's interview with her on Friday.",
    "The remarks drew outrage online from the right, and lawmakers and politicians who spoke with Fox News Digital uniformly condemned her comments.",
    "\"They forgot all about us, and they not just forgot about us, you look at the policy that's going on, which has nothing to do with color.\"",
    "\"[W]hat's strange about it is he's not telling everyone that the Democratic Party has left Brown and Black people behind,\" Walker said.",
    "Jennifer-Ruth Green, an Indiana congressional candidate, tweeted in response to the clip, \"Hi, Sunny, I'm Black and a proud Republican.",
    "Republican National Committee spokesperson and director of Black media affairs Paris Dennard also condemned Hostin's comments.",
    "Walker, the frontrunner to win the GOP nomination to take on Sen. Raphael Warnock, D-Ga., this fall, responded on \"Hannity.\"",
    "I was raised to love America and value the principles of faith, family, personal responsibility, and service to country.",
    "Asked for comment on Hostin, Cruz's office pointed to his tweet blasting Hostin for the \"blatant racism\" on display.",
    "\"Honestly, I feel it's a disrespect for her to talk that way because she's obviously sold her values,\" Flores said.",
    "\"The impudent behavior to tell others how they should think, feel, and live is a relic of Jim Crow and disgusting.",
    "\"Freedom is the liberty to pursue happiness on ones own free will,\" Carson told Fox News Digital in a statement.",
    "Hostin then said, \"I don't understand Black Republicans, and I don't understand Latino Republicans.\"",
    "Conservative ideals like faith, liberty, community, and life transcend race, sex, and religion.",
    "We've been taken for granted here in south Texas  They want to pretend like we don't exist .",
    "Criticizing someones political views based on their skin colorsounds really woke to me.",
    "More Americans are coming to that realization and that is why the left is so scared.\"",
    "Such sentiments against minorities on the right are not new in left-leaning media.",
    "She's constantly spreading misinformation, constantly disrespecting our values.",
    "[The media] are completely silent about it because it doesn't fit their agenda.",
    "I've been called all kinds of names because I'm running as a Republican.",
    "God, family and hard work, that's who we are in the Hispanic community.\"",
    "\"I've been told from people from the left I should go back to Mexico.",
    "A spokesperson for \"The View\" didn't return a request for comment.",
    "Honestly, shame on her and shame on The View.\"",
    "\"[Democrats] continue to make promises to us.",
    "\"Its not difficult to understand,\" he wrote.",
    "Luckily, we dont need your approval Sunny.\"",
    "\"She owes us a huge apology,\" she added.",
    "\"That's what you call racism,\" she said.",
    "I just wanted to introduce myself.\"",
    "She owes an apology to all of us."
  ]
}