{
  "id": 7668,
  "mediaId": 237,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "GOP candidate Walker leads Democratic Sen. Warnock in Georgia Senate race: Poll",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/66425c6/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fcf%2F91%2Fcc5564144d239fcf578a88f5de38%2Fap102120388629.jpg",
  "link": "https://www.washingtonexaminer.com/news/gop-candidate-walker-leads-democratic-sen-warnock-in-georgia-senate-race-poll",
  "sentiment": "0.696",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-m-drucker",
  "termIds": [
    815,
    1131,
    1136,
    1657,
    2087,
    146,
    232,
    428,
    571,
    2672
  ],
  "sentences": [
    "The microtargeting project, which is likely the most expansive and detailed survey conducted in Georgia so far this cycle, shows the dominant position that Herschel Walker maintains over Raphael Warnock in the race for the U.S. Senate, Republican pollster Blaise Hazelwood wrote in a memorandum for 34N22, the super PAC supporting Walkers Senate bid.",
    "Meanwhile, Republican operatives advising 34N22 believe Walker could be in an even stronger position against Warnock than the top-line ballot test suggests based on message testing conducted in this survey on crime, inflation, and the economy more broadly.",
    "The survey from the firm Grassroots Targeting, made available to the Washington Examiner on Tuesday, polled registered Georgia voters from April 3-16, using a mixture of landline and cellphone conversations and text message interviews.",
    "The Democrat is a talented politician who has raised an incredible amount of money for his 2022 campaign, reporting a haul of $13.6 million in the first quarter and a war chest of $25.6 million as of March 31.",
    "Sen. Raphael Warnock is in trouble this fall, according to an expansive poll conducted for the super PAC supporting the Georgia Democrats likely Republican rival, former professional athlete Herschel Walker.",
    "Walker is so well thought of, it does not seem to matter to voters that he lived in Texas for many years until recently  or that his personal life has been fraught with controversy.",
    "That includes Georgia, where the president defeated his predecessor, former President Donald Trump, in 2020, becoming the first Democrat to carry the state since 1992.",
    "Voter dissatisfaction with Biden in turn generated a generic Senate ballot that preferred an unnamed Republican over an unnamed Democrat by a margin of 51.9% to 40%.",
    "First, Walker must get past state Agriculture Commissioner Gary Black in Georgias May 24 primary, although polling suggests he is poised to cruise to victory.",
    "The senators problem appears to be President Joe Biden, whose job approval rating in this poll was 43.8% overall and 41.9% among independent voters.",
    "Warnock advanced to the Senate in early January 2021 after defeating appointed Sen. Kelly Loeffler, a Republican, in a runoff election.",
    "The Republican, a Trump ally, has been a folk hero for four decades because he led the Bulldogs to a national championship.",
    "But the political environment for the first midterm election under Biden is shaping up as a brutal one for the Democrats.",
    "In a survey of 2,500 registered voters, Walker led Warnock 51.4% to 41%, with 7.6% undecided.",
    "He played football for the University of Georgia and later professionally in the NFL.",
    "The margin of error was plus or minus 1.96 percentage points.",
    "Enter Walker."
  ]
}