{
  "id": 7701,
  "mediaId": 558,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Were running out of time to hold Donald Trump accountable",
  "image": "https://s.yimg.com/ny/api/res/1.2/t8XSsnYUn9GxMiJAKDqRxg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU3NjtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/eYN75IA6vYXOn.IwXwsq2A--~B/aD02MDA7dz0xMDAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/theguardian_763/a3fadb500fa03b7b76ffac453c18a587",
  "link": "https://sg.news.yahoo.com/running-time-hold-donald-trump-102152731.html",
  "sentiment": "0.835",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Reich",
  "authorUrl": "",
  "termIds": [
    815,
    1147,
    1653,
    1801,
    4247,
    232,
    380,
    571,
    2862
  ],
  "sentences": [
    "To get a strong endorsement from Trump, a candidate apparently must fulfill three prerequisites  run in a swing state whose primaries and general election will attract lots of media attention, be totally committed to Trump and his big lie, and be capable of promoting Trump and his lie with the kind of celebrity pizzaz that sells well on television.",
    "As federal district court judge David Carter in a recent opinion: [T]he court finds it more likely than not that President Trump corruptly attempted to obstruct the Joint Session of Congress on January 6, 2021.",
    "Oz is a celebrity television doctor who has over the years come under fire for bogus on-air medical advice, which makes him perfect for promoting Trump and his big lie, too.",
    "Robert Reich, a former US secretary of labor, is professor of public policy at the University of California at Berkeley and the author of and .",
    "This follows his endorsement of Mehmet Oz in Pennsylvanias Senate Republican primary and Herschel Walker in the Georgia Senate race.",
    "Trump admires Ozs television bona fides: They liked him for a long time, Trump said of Oz at a rally in Pennsylvania last week.",
    "The media has framed these endorsements as long-shot bets that could put [Trumps] desired image as a kingmaker at risk.",
    "Whats really at stake for Trump is the selling of Trump and his big lie that the 2020 election was stolen from him.",
    "But now that hes running for the Senate, Vance has become one of the most forceful promoters of Trump and his lie.",
    "Trump couldnt care less whether hes viewed as a kingmaker by the press and politicians inside the Beltway.",
    "And he has a knack for recognizing ambitious, unprincipled, television-savvy hucksters who will help him.",
    "He cares only about his narcissistic need to delegitimize the outcome of the 2020 presidential election.",
    "Vance  celebrity author of Hillbilly Elegy  was originally appalled by Trump and his lie, and said so.",
    "On Friday, Trump endorsed JD Vance in the Ohio Senate Republican primary.",
    "You know, when youre in television for 18 years, thats like a poll.",
    "As Trump noted about Vance, he gets it now.",
    "He was both a college and NFL star.",
    "Walker fits the criteria, as well.",
    "He is a Guardian US columnist.",
    "That means people like you.",
    "But this misses the point.",
    "His new book, is out now.",
    "His newsletter is at",
    "Thats like a poll."
  ]
}