{
  "id": 7739,
  "mediaId": 136,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Herschel Walker Is Betting Favorite to Win Georgia Senate Seat",
  "image": "https://d.newsweek.com/en/full/2021192/walker-senate-race.webp?w=790&f=554b8a4f455f92cc813b0990fa659c02",
  "link": "https://www.newsweek.com/herschel-walker-georgia-senate-election-favorite-1698260",
  "sentiment": "0.748",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zoe Strozewski",
  "authorUrl": "https://www.newsweek.com/authors/zoe-strozewski",
  "termIds": [
    815,
    1136,
    1147,
    1312,
    232,
    428,
    571,
    584,
    2672
  ],
  "sentences": [
    "While the betting odds collected by US-Bookies are separate from polling numbers for the Senate race in Georgia, several polls since the beginning of the year have shown that Walker is leading his Republican counterparts and Senator Raphael Warnock, who is favored to win the Democratic nomination.",
    "\"The Donald Trump endorsement is a clear factor to keep an eye on in these elections, as it often comes with significant GOP support,\" a US-Bookies spokesperson said in the press release, referencing both Georgia's and Pennsylvania's 2022 U.S. Senate elections.",
    "Polls from Emerson College, Quinnipiac and the University of Georgia, all of which were compiled between late January and early April, showed Walker leading Warnock, though Walker's lead was no greater than a few percentage points in each instance.",
    "When two polls, one by Public Policy and one by the University of Georgia, asked about Warnock versus Black instead of Warnock versus Walker in a general election, Warnock received larger percentages in both instances.",
    "Emerson College's poll, which was compiled at the beginning of April, showed that Walker had a sizable lead over the other Republican candidates in securing his party's nomination, with 57 percent of the vote.",
    "Herschel Walker, one of the Republican candidates vying for a U.S. Senate seat in Georgia, has the highest odds of winning the 2022 election, betting aggregator US-Bookies said in a press release.",
    "In the last quarter of 2021 alone, Warnock's campaign said that it had raised $9.8 million while Walker's campaign said that it had raised $5.4 million, the Associated Press reported.",
    "\"Herschel Walker will never let you down,\" Trump said in a statement last year that declared his \"complete and total endorsement\" for the candidate, CNN reported.",
    "As of December 31, 2021, Warnock had raised about $29.8 million while Walker had raised about $9.1 million, according to an Open Secrets report.",
    "Warnock, meanwhile, was also leading his Democratic counterparts with 85 percent of the primary vote, according to the Emerson poll.",
    "The spokesperson said that Walker, \"who has been Trump's pick for some time, has overwhelmingly strong odds to win the primary.\"",
    "In the Republican field, Walker has several key endorsements in his corner, including from former President Donald Trump.",
    "US-Bookies also said that Republicans have better odds than Democrats of winning the Georgia election.",
    "In the field of Republican candidates, Walker has the highest odds of becoming the party's nominee.",
    "The GOP competitor with the second-largest share, Gary Black, had 13 percent of the primary vote.",
    "ET: This story was updated with additional information and background.",
    "But Warnock seems to be beating Walker in his fundraising efforts.",
    "Newsweek reached out to Walker's campaign team for comment.",
    "Update 4/15/22, 1:30 p.m."
  ]
}