{
  "id": 7821,
  "mediaId": 65,
  "date": "4/8/2022 12:00:00 AM",
  "headline": "Clarence Thomas publicly spotted for first time since being hospitalized",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/3df92c92-c872-43e2-9c05-cb68285919df/6e1e571f-b512-4353-8820-f4d97fe42110/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/clarence-thomas-publicly-spotted-for-first-time-since-being-released-from-hospital",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Mark Miller",
  "authorUrl": "https://www.foxnews.com/person/m/andrew-mark-miller",
  "termIds": [
    812,
    815,
    827,
    4819,
    5811,
    5973,
    482,
    5594,
    5605,
    2672
  ],
  "sentences": [
    "A campaign staffer for former NFL star Herschel Walker, who is running as a Republican for a Senate seat in Georgia, posted a photo with Clarence Thomas on Friday afternoon marking the first time Thomas has been seen since being released from a hospital on March 25 following an undisclosed illness.",
    "JUDICIAL CRISIS NETWORK PUTS $1.5M BEHIND AD ACCUSING JUDGE JACKSON OF MISUNDERSTANDING JUSTICE THOMAS\nThomas was hospitalized in Washington, D.C., with \"flu-like symptoms\" for a week due to an illness that the Supreme Court said was not related to the coronavirus.",
    "\"Herschel got to spend time with Justice Thomas while in DC to receive the Horatio Alger Award this week,\" Walker Communications Director Mallory Blount tweeted Friday.",
    "Thomas is an honorary board member of the Horatio Alger Association, which is one of the nation's largest need-based, privately-funded college scholarship providers.",
    "Thomas, as the most senior justice, decides who writes the majority opinion if Chief Justice John Roberts is in the minority on a case.",
    "Supreme Court Justice Clarence Thomas was spotted in public Friday for the first time since being hospitalized in March.",
    "Fox News Shannon Bream and Bill Mears contributed to this report\nAndrew Mark Miller is a writer at Fox News.",
    "The 73-year-old missed a week of oral arguments entirely before participating remotely the following week.",
    "Thomas has served on the Supreme Court since 1991 after being nominated by former President George H.W.",
    "Find him on Twitter @andymarkmiller and email tips to AndrewMark.Miller@Fox.com.",
    "Bush to succeed Thurgood Marshall, the nation's first Black justice."
  ]
}