{
  "id": 7837,
  "mediaId": 195,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Herschel Walker leads Warnock in Georgia Senate race: poll",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2021/08/walkerherschel_warnockraphael_082521getty-gn_split_walker.jpeg?w=2000&ssl=1",
  "link": "https://thehill.com/news/3260483-herschel-walker-leads-warnock-in-georgia-senate-race-poll/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod/",
  "termIds": [
    815,
    1147,
    1765,
    2087,
    2230,
    146,
    232,
    428,
    571,
    2672
  ],
  "sentences": [
    "Walker, a former football star, is currently the heavy favorite to win the GOP primary after earning the endorsement of former President Trump, Senate Minority Leader Mitch McConnell (Ky.) and other prominent Republicans.",
    "Warnock, who won a special election in 2021 and is now running for a full term, is supported by 45 percent of registered voters in the poll released Wednesday, while Walker is backed by 49 percent of voters.",
    "Trumps claims that voter fraud cost him the state in 2020 are believed to have depressed GOP turnout in the primaries and are credited in part with helping the two Democrats win last year.",
    "The state narrowly went to President Biden in 2020, and Warnock and Sen. Jon Ossoff (D-Ga.) won their seats by extremely tight margins in a pair of Senate runoffs in January 2021.",
    "Some Republicans have also voiced concerns that Democrats will go after Walker over his past business practices and the fact that he has been accused of abuse by his ex-wife.",
    "Georgia Sen. Raphael Warnock (D) narrowly trails Republican Herschel Walker in the Peach States marquee Senate race, according to a new The Hill/Emerson College poll.",
    "Bidens approval rating in Georgia is underwater, according to the new poll, with 42 percent of voters approving of the job hes doing and 49 percent disapproving.",
    "Still, Warnock will be running in what is anticipated to be a very GOP-friendly atmosphere, an environment driven largely by Bidens sagging approval ratings.",
    "The Republicans lead is just outside the surveys margin of error of 3 percentage points, though 6 percent of voters remain undecided, according to the poll.",
    "Democrats are hopeful that Warnocks resume, including his service at Martin Luther King Jr.s old church, could help him repeat his win this year.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The Georgia Senate race is anticipated to be among the most competitive in the country.",
    "The Hill/Emerson College poll surveyed 1,013 Georgia registered voters from April 1-3.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}