{
  "id": 7858,
  "mediaId": 151,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "The baggage is too heavy: GOP foes tee up last-ditch effort to sink Herschel Walker",
  "image": "https://www.politico.com/dims4/default/a0cce18/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F46%2Ff7%2Fdafaa6a5404b9f76ae73d1d4d13d%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1235507155",
  "link": "https://www.politico.com/news/2022/04/01/herschel-walker-primary-00022192",
  "sentiment": "-0.856",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1058,
    1136,
    1147,
    146,
    428,
    562,
    571,
    2672
  ],
  "sentences": [
    "Republican Senate candidate Herschel Walker speaks at a rally featuring former President Donald Trump on Sept. 25, 2021, in Perry, Ga. | Sean Rayford/Getty Images\nBy Natalie Allison\n 04/01/2022 04:31 AM EDT\nHerschel Walker, the former football star whos armed with former President Donald Trumps enthusiastic endorsement, has been on a glide path to the GOP nomination since announcing his Senate bid in Georgia.",
    "Similarly, a memo sent March 18 to Blacks donors, obtained by POLITICO, says Blacks campaign hired Meeting Street Insights to conduct internal polling in late February and found Walkers support dropped to 38 percent after Republican primary voters were informed about past allegations and his support for granting a pathway to citizenship to some immigrants living in the country illegally.",
    "After informing voters about Walkers history of alleged domestic violence  which includes his ex-wife being granted a restraining order after she told police Walker pointed a gun at her head and choked her unconscious  as well as other points about his business record and stance on immigration, the group said his vote share dropped to 34 percent.",
    "Black, who has been elected statewide four times as agriculture commissioner and was appointed to Trumps agriculture policy advisory council ahead of the 2016 presidential election, has built a grassroots network of supporters that includes nearly half of the states county sheriffs, as well as dozens of state legislators.",
    "In the eight weeks running up to the May 24 primary, two super PACs supporting Walkers GOP rivals plan to drop millions of dollars in ads attacking Walker, according to people familiar with their spending plans  ad buys that stand to alter the shape of a race that could decide control of the Senate.",
    "But his opponents intend to drive his support under 50 percent and force him into a June runoff, when the second-place finisher will be able to focus attention on what many Georgia Republicans contend is Walkers unique vulnerability to Democratic attack: his history of alleged domestic abuse.",
    "Walkers high name ID and his own prolific fundraising  he raised $9.1 million in 2021 alone  stand in contrast to the other candidates, who lack access to top national donors but who have, in some cases, invested years in Georgia Republican politics while Walker was living out of state.",
    "Black and former Navy SEAL officer Latham Saddler, two of the six Republicans vying for the Senate nomination, are being aided by new super PACs that each plan to soon make seven-figure ad buys attacking Walker and highlighting their candidates as a sensible alternative.",
    "In an interview, Black said his campaign, for practical purposes, is just getting started, and suggested voters will begin paying more attention to the race within a few weeks when the NCAA mens basketball championship and Masters Tournament in Augusta are over.",
    "The owner of a health product company and real estate investment firm, Clark said he is still considering putting in a significant amount of his money to try to catch up with Walker, though he declined to say how much he would be willing to spend.",
    "Though Senate Minority Leader Mitch McConnell reportedly had concerns early last year about a Walker nomination, the Kentucky Republican ultimately endorsed him after Walker officially entered the race, months after Trump had urged Walker to run.",
    "In an effort to convince the National Republican Senatorial Committee of Walkers vulnerabilities as a nominee, at a November meeting the Black campaign showed an early cut of a hard-hitting video highlighting Walkers domestic violence history.",
    "At a meeting of the Putnam County Republican Party on Monday night, Walkers leading challenger, state Agriculture Commissioner Gary Black, closed his stump speech with an impassioned appeal for the crowd to do their research on Walker.",
    "Janelle King, former deputy state director for the Georgia Republican Party, has been active for a decade in grassroots conservative politics in the state, and currently serves as a Georgia Gang panelist on Fox 5 Atlanta.",
    "Polling last summer and in January showed Warnock beating Black by at least 5 percentage points in a general election, though more surveys have tested a match-up between Warnock and Walker, showing an even tighter race.",
    "In addition to Black and Saddler, two other Republican candidates are burning up pavement attending local party functions and other campaign events in a desperate attempt to be recognized as an alternative to Walker.",
    "Ive spent 20 years of my career building the Republican Party in the state of Georgia, and Herschel Walker is going to be a drag on the whole thing and potentially make the whole thing go down the drain, Black said.",
    "That polling was conducted by Ingress Strategies among 890 likely Republican primary voters, half through landline interviews and half through mobile text response, with a margin of error of 3.9 percent.",
    "Were not calculating an implosion, but we do see a slow drip or steady loss of the lead over time, candidate Kelvin King said of Walkers trajectory, though he did not provide internal polling.",
    "The opposition research file on Walker, much of which has already been covered by local and national media, hasnt stopped national Republican leaders from throwing their support behind him.",
    "A Fox News poll conducted in early March found support for Walker at 66 percent among GOP primary voters  far ahead of Black at 8 percent, and the other candidates in the low single digits.",
    "With one of the Senates top fundraisers, Democratic Sen. Raphael Warnock, looming in the fall, some Republicans fear Walker wont be able to survive the onslaught of Democratic attack ads.",
    "Clark still thinks highly of Walker, he said, having recently encouraged his children to pose for a photo with the famous athlete when the family encountered Walker at a campaign stop.",
    "Black and other GOP candidates in the race have also taken issue with Walkers refusal to participate in primary debates, as Walker has said he is only interested in debating Warnock.",
    "He noted that he reached out to Trumps staff a year ago about his plans to run for the seat, around the time Trump had released a statement encouraging Walker to get into the race.",
    "But the Fox survey showed Walkers support slipping since polls conducted this winter by Quinnipiac University and The Trafalgar Group found him at 81 and 70 percent, respectively.",
    "Foote said his independent expenditure group plans to collaborate with Defend Georgia, the super PAC backing Black, to be strategic on anti-Walker messaging in the coming weeks.",
    "King, an all-conference football player at Air Force who, like Walker, went on to start his own company, argues he has the right profile to win a general election in Georgia.",
    "[Ive] voted for Republicans since Gerald Ford, Black said, noting that Walker, who was publicly supportive of Trump in 2016 and 2020, has a history of sitting out elections.",
    "The video, which the Black campaign later published, was so brutal that an NRSC staff member let out a gasp at one point, according to a person present at the meeting.",
    "Polling conducted by Georgia First PAC in December sought to answer not who was closest behind Walker, but can Herschel Walker really be beat in a primary, Foote said.",
    "While Walker was speaking at a rally for Trump in Commerce on Saturday night, Black was leading the National Anthem at the Great Southland Stampede Rodeo in Athens.",
    "The meeting in question was not designed to be about other candidates or the primary, despite the Black campaigns attempt to show the video, the spokesperson said.",
    "Obviously, President Trump knows we are great Republicans here in Georgia, because he chose us to do a commercial instead of Herschel Walker, Kelvin King said.",
    "A spokesperson for the NRSC, recalling the meeting, said the committee speaks with candidates early on to hear about their strategy for the general election.",
    "Everybody seems to feel like Herschel is kind of inevitable, said Tyler Foote, a Republican consultant working on the Georgia First PAC to support Saddler.",
    "Walker spokesperson Mallory Blount rebuffed in a statement the idea that Walkers support had fallen and that there was any chance of a runoff occurring.",
    "But like the others in the race, Clark insisted that Walker cant win the general election if Democrats attack his character as expected.",
    "Black was referring to police reports documenting Walkers past run-ins with law enforcement and instances of alleged domestic violence.",
    "Josh Clark, a former Georgia state representative who entered the race in November, said Walker was one of his childhood heroes.",
    "The committee did not allow the campaign to finish showing it, insisting it wasnt their role to get involved in the primary.",
    "So far, very little has been spent going negative on Walker  and specifically, no ads have appeared yet on television.",
    "Let the Democrats pour $140 million on top of domestic violence and threatening shootouts with police, he added.",
    "The pollster interviewed 500 primary voters on landlines and cellphones with a margin of error of 4.4 percent.",
    "None of the surveys, at least that Ive seen so far, are actually testing the negative hits against Herschel.",
    "The Trump campaign tapped King and his wife to appear in an October 2020 ad geared toward Black voters.",
    "Nor have they expressed concerns about his candidacy, as theyve done with former Missouri Gov.",
    "Eric Greitens, who is running for Senate despite leaving office mid-term in 2018 amid scandal.",
    "Representatives of the super PACs declined to say how much money theyve raised to date.",
    "Their only strategy to gain any sort of relevance is to obsess over Herschel.",
    "Folks, he cant win in November, Black said, raising his voice as he spoke.",
    "Theres been zero drop in poll numbers since this race started, she said.",
    "It seems as if the more he speaks, the more unforced errors there are.",
    "Walker has publicly discussed his long history with mental illness.",
    "The other Republicans in this race are at less than 15% combined.",
    "A lot of it is going to come down to resources and funding.",
    "Walker is still expected to finish first in the primary.",
    "Not a dime has been spent attacking him on television.",
    "Herschel is solely focused on beating Raphael Warnock.",
    "And like both Walker and Warnock, King is a Black man.",
    "I can articulate the right type of message, King said.",
    "There is a path, there is an opportunity, Foote said.",
    "As of the last quarter, Clark had put in $35,000.",
    "That discussion is going to be had right now.",
    "Any suggestion to the contrary is silly.",
    "Thats about to change dramatically.",
    "Theyre just doing the horse race.",
    "Im pretty passionate about that.",
    "I dont think its a done deal.",
    "The baggage is too heavy.",
    "Itll never happen.",
    "And yeah, he can.",
    "Let that happen."
  ]
}