{
  "id": 7862,
  "mediaId": 234,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Jared Kushner and Donald Trump Probably Wont Be Splitting a Milkshake With Two Straws Any Time Soon",
  "image": "https://media.vanityfair.com/photos/62474db878feebfc24e83115/master/w_2240,c_limit/1208986986",
  "link": "https://www.vanityfair.com/news/2022/04/jared-kushner-january-6-committee-meeting",
  "sentiment": "0.0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bess Levin",
  "authorUrl": "https://www.vanityfair.com/contributor/bess-levin",
  "termIds": [
    661,
    815,
    1039,
    1147,
    1434,
    1477,
    1839,
    2240,
    2406,
    3094,
    482
  ],
  "sentences": [
    "Then Their Colleagues Were Killed in Ukraine\n The Life and Confessions of Mob Chef David Ruggerio\n Kremlin Keeps Blurring Its Red Line Around Nuclear War\n Calls for Recusals, Resignations, and Even Impeachment: Democrats Escalate Ethics Campaign Around Clarence Thomas\n Two Ukrainian AP Journalists Capture the Most Devastating Moments of War\n Trump: If I Was President Id Threaten to Drop a Nuclear Bomb on Russia\n What Will Dems Do If Biden Doesnt Run?",
    "In the nine months since the House of Representatives formed a select committee to investigate the events surrounding the January 6, 2021, attack on the Capitol, numerous members of Donald Trumps inner circle have refused to cooperate, preferring instead to risk contempt of Congress charges than reveal what is, more than likely, extremely damaging information about the former president.",
    "A Trump-backed candidate willing to find extra votes (The Guardian)\nScoop: Jen Psaki planning to leave White House this spring for MSNBC gig (The Hill)\nRobot dog patrolling the ruins of ancient Italian city Pompeii (UPI)\nThe Oscars Swag Bag Was $137,000 Worth of the Weirdest Gifts Known to Man (Jezebel)\n Fox News Hosts Entertained Putin-Friendly Talking Points.",
    "Kushner was en route back to Washington from Saudi Arabia while the Capitol was being attacked, but the panel is obviously also interested in the events leading up to the insurrection (for example, Trumps monthslong campaign to convince people a second term had been stolen from him, and attempts to get Mike Pence to block the certification of Joe Bidens win.)",
    "The hire lists were so often filled with infamous bigots and conspiracy theorists, woefully under-qualified names, and obvious close friends of Thomas that several senior Trump aides would laugh at themthat is, until Trump would force his staff to put certain names through the official vetting process, three sources familiar with the matter said.",
    "According to NBC News, the panel had been expected to inquire about Trumps false claims that he won the election and other information related to the deadly attack on the Capitol, as well as any dealings [Kushner] had with Virginia Ginni Thomas, the wife of Supreme Court Justice Clarence Thomas, in the lead-up to Jan. 6.",
    "The fire lists were particularly problematic, as they were frequently based on pure conjecture, rumor, or score-settling, where even steadfastly MAGA aides were targeted for being part of the Deep State or some other supposedly anti-Trump coalition, according to people who saw them during the Trump administration.",
    "Which, based on the text messages we now know Thomas sent the former White House chief off stafflike the one in which she quoted a right-wing websites claims that the Biden family had been arrested and would be living in barges off GITMO to face military tribunals for sedition, sounds pretty apt!",
    "It should also never, ever be forgotten that the duos go-to move while working in the administration was to literally flee the scene any time there was blowback for something extra bad Trump did, in apparent hopes people would forget they were senior advisers to the president.",
    "Jared Kushner and Donald Trump Probably Wont Be Splitting a Milkshake With Two Straws Any Time Soon\nThe former first son-in-law reportedly gave the House January 6 committee valuable and helpful information about the events surrounding the attack on the Capitol.",
    "Speaking to NPR, Luria said, I think that the committee really appreciates hearing information directly from people who have relevant facts about January 6, and the fact that Jared Kushner came as a witness is helpful to building the story of our investigation.",
    "GOP Senate candidate unconcerned about getting caught telling bold-faced lie\nTime was, candidates for office would be deeply embarrassed and/or ashamed for reporters to find out that a story theyd told multiple times over the years was a flat-out lie.",
    "Orgies, Beheadings, Jewish Space Lasers: Everything Kevin McCarthy Has Had to Speak to Republican Lawmakers About\n The Truth Behind Republicans Vile Questioning of Ketanji Brown Jackson\n From the Archive: Molly Blooms House of Cards\n Not a subscriber?",
    "There is not a single voter in Georgia who believes that whether Herschel graduated at the top of his class or as Valedictorian 40 years ago has any bearing on his ability to be a great United States Senator, Mallory Blount insisted.",
    "NBC News reports that Kushnerhusband of Ivanka, son-in-law of Donald, and former senior White House advisermet virtually with the panel on Thursday for more than six hours, after voluntarily agreeing to speak with the committee.",
    "She often came armed with written memos of who she and her allies believed Trump should hire for plum jobsand who she thought Trump should promptly purgethat she distributed to Trump and other high-ranking government officials.",
    "Nothing to see here, just the wife of a Supreme Court justice telling the executive branch who to hire and fire\nGinni Thomas sees your separations of power and raises you a but what if there werent separations of power?",
    "Asked why the campaign recently removed a reference to him graduating valedictorian from the University of Georgia, Walkers campaign manager, Scott Paradise, told KFILE, Multiple reporters wrote about this 40 years ago.",
    "In June, CNN reported that an alleged chilliness had developed between Jared and Ivanka and the 45th president, supposedly, in part, over the couples annoyance that Trump wouldnt stop harping about the 2020 election.",
    "While Trump family members have been known in the past to meet with officials investigating the ex-president only to plead the Fifth hundreds of times, Kushner reportedly saw no reason to stonewall the group.",
    "Though the details of what he revealed are not known at this time, Virginia Democratic representative Elaine Luria told MSNBC the former first son-in-law provided the panel with really valuable information.",
    "As Russia drafts young men, some fear ending up on Ukraines front line (The Washington Post)\nRon DeSantis Is Threatening Disney With Regulations Because It Spoke Out Against Floridas Anti-LBGTQ Law (V.F.)",
    "(Last week, The Washington Post revealed that the committee was in possession of more than two dozen text messages between Thomas and White House chief of staff Mark Meadows re: overturning the election.",
    "Having said that, they apparently had no issue following him to Florida and spending the summer at his club in Bedminster, New Jersey, where their accommodations are separated by mere tens of feet.",
    "In a letter sent to the former first daughter in January, the committee noted that she was in the Oval Office during a phone call between her father and Mike Pence on the morning of January 6.",
    "In January, the House voted to hold Meadows in criminal contempt, after he initially said he would cooperateand turned over thousands of pages of documentsbefore abruptly changing his mind.",
    "(For her part Ivanka tweeted that day the violence must stop, which would have meant more if she hadnt initially addressed the people attacking the Capitol as American patriots.)",
    "Per the Daily Beast:\nOn multiple occasions throughout the Trump era, Thomas would show up in the White House, sometimes for a private meeting or a luncheon with the president.",
    "Nevertheless, Kushners apparent helpfulness to the committeewhich could change should he be asked to turn over documentsis in stark contrast to numerous other insiders.",
    "The expectation is that it will take place, as to when I cant tell you right now, I know we are engaging her as a committee, chairman Bennie Thompson said Wednesday.",
    "Powell, of course, is the unhinged Trump attorney who promoted claims like there is a secret server that all the votes go to where they [are] manipulate[d].)",
    "Per CNNs KFILE:\nFor years, Herschel Walker has told the same inspiring story: that he graduated in the top 1% of his class at the University of Georgia.",
    "One of them, from November 13, 2020, seemingly referred to Kushner, with Thomas writing: Just forwarded to yr gmail an email I sent Jared this am.",
    "Hes told the story, according to a review of his speeches by CNN's KFile, during motivational speeches over the years and as recently as 2017.",
    "In a statement, a spokesperson for Walker told KFILE that voters wont care that the Senate candidate repeatedly lied about his history.",
    "According to the committee, it is in talks with Ivanka Trump for her to answer questions, but a final agreement has not been reached.",
    "And just this week, the panel unanimously voted to hold former Trump advisers Dan Scavino and Peter Navarro in contempt of Congress.",
    "Joe Biden asks Trump how do you like demdeficit reductions\nRemind us again, is it better to be above the x-axis or below the x-axis?",
    "Rep. Liz Cheney has also said the committee had firsthand testimony that Ivanka asked her father at least twice to stop the riot.",
    "In November, former senior White House adviser Stephen Bannon was criminally charged for ignoring a subpoena from the panel.",
    "Walker did not graduate from Georgia, where he was a star running back after entering as a prized high school recruit.",
    "If you have a difficult time getting in touch with them, ask yourself why you are asking such a stupid question.",
    "These fucking lists were so insane and unworkable, a former Trump White House official told the Daily Beast.",
    "In addition to lying about his background, Herschel recently suggested the jury was still out on evolution.",
    "Amazon Union Win in NYC Holds Potential to Spread Far and Wide (Bloomberg)\nThe latest threat to democracy?",
    "Sidney Powell & improved coordination now will help the cavalry come and Fraud exposed and America saved.",
    "Jared Kushner, who was apparently more than happy to bring investigators up to speed on what he knows.",
    "A lot of them were dripping with paranoia and read like they were written by a disturbed person.",
    "And, to date, they have never publicly declared that Biden won the election fair and square.",
    "If you would like to receive the Levin Report in your inbox daily, click here to subscribe.",
    "Its water off a ducks back and anyone trying to claim otherwise can go f--k themselves.",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "So no one should be hailing Kushner as some kind of hero or defender of democracy.",
    "he didnt have the courage to block the certification of Bidens win.",
    "If you have a problem with what they wrote, please contact them.",
    "Thomas did not respond to requests for comment on this story.",
    "Thats the phone call the president reportedly told his V.P.",
    "But in the post-truth world the GOP lives in?",
    "So he really ticks all the GOP boxes.",
    "The only problem: its not true.",
    "Surprisingly not among them?",
    "Elsewhere!"
  ]
}