{
  "id": 7894,
  "mediaId": 12,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "Trump brings his anti-Kemp campaign to Georgia",
  "image": "https://www.ajc.com/resizer/2anrQcrynNxohnoxLZ4NvXFz1bE=/fit-in/720x480/cloudfront-us-east-1.images.arcpublishing.com/ajc/ROOOUYRJJ6ENDSWXCNHRU73FRA.jpg",
  "link": "https://www.ajc.com/politics/trump-brings-his-anti-kemp-campaign-to-georgia/IH5NZU3OL5FNDJ56CH4EVL5M4I/",
  "sentiment": "-0.388",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815,
    1147,
    1274,
    1951,
    2087,
    2095,
    4325,
    428,
    2624,
    2672
  ],
  "sentences": [
    "Before a crowd of a few thousand supporters, Trumps rambling speech invoked familiar, false claims that he and former U.S. Sen. David Perdue got screwed in 2020 and warned that his backers wont vote in a general election against Democratic gubernatorial candidate Stacey Abrams if Kemp is the nominee.",
    "COMMERCE  Former President Donald Trump escalated his grudge Saturday against Brian Kemp at a rally in northeast Georgia, urging supporters to oust the incumbent he once endorsed and purge state government of many of the governors allies.",
    "The only candidate who didnt invoke Trumps name in his opening speech was Walker, who is far enough ahead in the polls that hes trying to pivot toward a November matchup against Democratic U.S. Sen. Raphael Warnock.",
    "Im just truthfully here to see if he will give us some news about what hes up to in the future, said Jeannette Fehr, who drove in from Wisconsin for a funeral a week ago and remained in town to hear Trump.",
    "Three separate tallies of the states roughly 5 million ballots upheld Bidens narrow victory, court challenges by Trump allies were squashed, and bipartisan election officials have vouched for the results.",
    "In the state of Georgia, thanks to Brian Kemp, in 2020 our elections were absolutely stolen, Perdue said, adding that he would make sure that whoever was responsible goes to jail if hes elected.",
    "Some of his Republican allies warn that Trumps take-no-prisoners brand of politics  and his obsession with his defeat in Georgia  will only come back to haunt GOP candidates in November.",
    "The crowd was smaller and more tepid than many of Trumps previous Georgia rallies, and many of the former presidents lines were met with light applause or none at all.",
    "Former Democrat Vernon Jones, endorsed by Trump for a U.S. House seat to get him to quit the governors race, talked of the former president in almost mythical terms.",
    "Other candidates boasted of their close ties to Trump and nodded to Georgias role as the most important test of the former presidents influence in the nation.",
    "He said for the first time this past week that he also was the victim of a stolen election when he lost the January 2021 runoff to Democrat Jon Ossoff.",
    "If we dont have a red wave, it doesnt play well for us to put Donald Trump in the White House in 2024, but I think weve going to have a red wave.",
    "His spokesman Cody Hall issued a statement saying that Kemp is focused on making sure Stacey Abrams is never our governor or the next president.",
    "If Kemp runs, I think Herschel Walker will be seriously and negatively impacted, Trump thundered from the stage at an old racetrack in Commerce.",
    "Few know that better than Kemp, who routed a GOP runoff opponent in 2018 after the then-president endorsed him six days before the election.",
    "Chrissy Maxwell of Newton wore a bejeweled denim Trump hat as she lingered with friends around a cluster of food trucks with lengthy lines.",
    "After a Saturday event in Columbia County with local Republican leaders, Kemp sidestepped a question about Trumps influence in the race.",
    "Trump voters will not go out and vote for Brian Kemp, Trump said, adding that the Senate GOP frontrunner will also be damaged.",
    "This 2020 cycle is so important because it will set the stage for 2024, said Burt Jones, Trumps pick for lieutenant governor.",
    "Perdue previously didnt argue his election was stolen  in fact, he conceded to Ossoff shortly after the Jan. 5, 2021, runoff.",
    "Trump used much of his remarks to tout his term in the White House and falsehoods about his 2020 election defeat in Georgia.",
    "Still, some trucked in from hundreds of miles away to get a glimpse of the former president and his Georgia allies.",
    "I hear them talking about a no-fly zone in Ukraine, said the ex-state legislator, who switched parties last year.",
    "They include several little-known contenders for down-ticket office running against incumbents allied with Kemp.",
    "And thats what Im going out there, working to do, Kemp said, adding that he wants voters to weigh his record.",
    "But now Trumps clout is far harder to define  even as more candidates are trying to ride on his coattails.",
    "I hope, David, youre going to be the governor, he said, or I just wasted a helluva lot a time tonight.",
    "When his attention shifted to Georgia candidates, he mostly doted on Perdues attempt to oust Kemp.",
    "Trump, meanwhile, issued his own sharp message to Perdue as some in the crowd began filing out.",
    "A vote for Brian Kemp, RINO, is a vote for Democrat senator who shouldnt be in the Senate.",
    "Once, Trumps endorsement was the closest thing to a lock in Georgia Republican politics.",
    "If Brian Kemp is renominated, he will go down in flames at the ballot box, said Trump.",
    "With hefty leads in recent polls, Kemp has hardly uttered Perdues name in recent days.",
    "This trip is about him and his grievance-driven brand of politics, said Lt. Gov.",
    "An audit of absentee ballot signatures in Cobb County found no cases of fraud.",
    "directed at Kemp broke out, as Perdue smiled and flashed a thumbs-up sign.",
    "My message to folks is I need their endorsement, their vote on May 24.",
    "She said shed vote for whomever Trump endorsed  no questions asked.",
    "Im not here to be a politician, Im here to be a warrior, he said.",
    "And at Saturdays rally, he unveiled sharper attacks on Kemp.",
    "Let me tell you something: Donald Trump is the no-fly zone.",
    "Thats who I listen to  and sometimes not in that order.",
    "Geoff Duncan, not the future of the state we all love.",
    "I trust him to tell me what to do, she said.",
    "I cant control what other people are doing.",
    "But I really want him back in office now.",
    "Perdue, meanwhile, returned the favor.",
    "Thats what God sent me to do.",
    "The election wasnt stolen.",
    "Chants of lock him up!",
    "I want him to run.",
    "Jesus and Trump."
  ]
}