{
  "id": 8143,
  "mediaId": 178,
  "date": "2/14/2022 12:00:00 AM",
  "headline": "Winning the Super Bowl showed Rams made all the right moves",
  "image": "https://chorus.stimg.co/23240415/merlin_66558208.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/rams-super-bowl-win-all-the-right-moves-kevin-oconnell-vikings-coach-jim-souhan/600146495/",
  "sentiment": "0.0",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1505,
    5690,
    5696,
    5841,
    5574,
    5583,
    5610,
    5617,
    5621
  ],
  "sentences": [
    "If not for a few fortuitous flags and Kupp's brilliance, O'Connell would have been forced to explain in his first news conference how his old boss, a supposed offensive genius, could lose two Super Bowls with different offensive stars, while producing just 19 points.",
    "The Rams had a good team, one that went to the Super Bowl with Jared Goff at quarterback just a few years ago, but O'Connell's bosses, GM Les Snead and coach Sean McVay, kept trading first-round draft picks until they had the roster they wanted.",
    "The argument the Rams presented: Draft picks are uncertain, the careers of even great players can be short and, if you think you have a chance to win it all, you should take that chance and worry about the consequences, if there are any, later.",
    "So it came to pass that Matthew Stafford, in his first season with the Rams, threw a touchdown pass to Cooper Kupp, the former third-rounder, late in a 23-20 victory over the Cincinnati Bengals in Inglewood, Calif.",
    "They're also a collection of long shots and underdogs, because before they became stars, all professional athletes were long shots and underdogs  kids hoping to get to play on TV someday.",
    "The NFL's best postseason effectively ended with the league's best player this year, Kupp, cradling the ball in the end zone, having taken a brutal hit to the head two plays earlier.",
    "We have no idea how much O'Connell contributed to the victory and that might not matter anyway, but if you're the Wilfs, that last Rams drive had to feel like an omen, or a reprieve.",
    "A guy who had never won a playoff game before this season combined with a former third-round draft pick from Eastern Washington to produce the touchdown that won the Super Bowl.",
    "All season, the Rams made a persuasive argument that talented NFL teams should always be all-in, should always push their chips to the middle of the table and scream \"call.\"",
    "On Sunday, McVay seemed to fall into the old-school trap of trying to establish the run, meaning the Rams wasted early downs and left themselves in long-distance situations.",
    "Sometime in the next few days, Rams offensive coordinator Kevin O'Connell is expected to fly to Minnesota for his introductory news conference as the new Vikings coach.",
    "The Buccaneers might have been good enough to win it all again, but they failed to do something that virtually every NFL team failed to do this year  cover Kupp.",
    "Yes, the Los Angeles Rams are a collection of football stars who performed Sunday in a $5 billion stadium filled with Hollywood and music stars.",
    "The Vikings were back in the playoffs by '92, went to the playoffs relentlessly all decade, then played in the 1998 and 2000 NFC title games.",
    "Kupp's late TD meant that McVay and Stafford are champions and O'Connell will arrive in Eagan carrying a ring instead of an alibi.",
    "Until that last drive, he coached a lot more like Mike Zimmer than the coach known as the NFL's offensive wunderkind.",
    "The Rams are evidence that, at least in the NFL, you need to win while your best players are active and healthy.",
    "That go-for-it-now attitude pervaded the NFL postseason, making this the greatest postseason in NFL history.",
    "The Bills might have had the best team in the league, and 13 seconds kept them from proving it.",
    "For Vikings fans watching the game for a glimpse of O'Connell, you probably didn't learn much.",
    "Minnesotans are accustomed to hearing general managers talk about building and rebuilding.",
    "That sequence provided all you needed to justify love or hate of the NFL, or both.",
    "The Chiefs might have had the best team in the league, but they blinked.",
    "It is always painted as The Trade That Destroyed the Vikings.",
    "This article was written using the television broadcast.",
    "Losing the Super Bowl wouldn't have meant he was wrong.",
    "The Star Tribune did not travel for this event.",
    "Winning the Super Bowl justified his moves.",
    "Remember the Herschel Walker trade?",
    "Will Vikings fans ever forget it?",
    "He might smell of champagne.",
    "He could reek of philosophy.",
    "It occurred in 1989."
  ]
}