{
  "id": 8149,
  "mediaId": 129,
  "date": "2/12/2022 12:00:00 AM",
  "headline": "Selling Trump: A Profitable Post-Presidency Like No Other",
  "image": "https://static01.nyt.com/images/2022/02/13/us/politics/00pol-trumpmoney-top/00pol-trumpmoney-top-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/02/12/us/politics/donald-trump-business-interests.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    968,
    1147,
    1443,
    6032,
    183,
    522,
    2550,
    2661,
    5066
  ],
  "sentences": [
    "And there are smaller ones, like remodeling the lobby bar of Trump Tower in Manhattan and renaming it the 45 Wine and Whiskey Bar  where specialty cocktails range in price up to, yes, $45 (that one comes with two American beef sliders) and can be sipped in dark velvet chairs surrounded by Mr. Trumps black-and-white presidential portraits and paraphernalia.",
    "Lawrence M. Noble, former general counsel at the Federal Election Commission, said that the combination of ways that Mr. Trump had monetized his life after the White House, while remaining intimately involved in Republican politics and a possible future candidate himself, had created ethical questions unlike any post-presidency in modern times.",
    "As Mr. Trump left office, his company was going through a challenging time, with a bad year at its remaining hotels because of the coronavirus pandemic and the decision by several blue-chip vendors  including its law firm, real estate broker and two banks  to stop doing business with the family after the Jan. 6 attack on the Capitol.",
    "Beyond the ticket price, the event generated revenue from an auction of items including a bottle of Pappy Van Winkle bourbon with a portrait of Mr. Trump painted on the label, and a signed photograph of Mr. Trump holding a Bible across the street from the White House after the police cleared protesters from the area in June 2020.",
    "Mr. Trumps for-profit store, meanwhile, has added a MAGA collection, and sells items like a $95 Mar-a-Lago Christmas ornament, that it is marketing to supporters of Mr. Trumps 2020 campaign through email lists rented from the Trump political operation and maintained by Brad Parscale, Mr. Trumps former campaign manager.",
    "The company behind the high tea event, Whip Fundraising, also organized Mr. Trumps holiday party in Naples, Fla., in December, where several attendees said that guests were asked to put their phones in small magnetic pouches while Mr. Trump spoke to limit the shooting of unauthorized videos or photos.",
    "Consumer Services Division is currently investigating whether this event involves an entity operating in violation of Chapter 496, Florida Statutes, Erin M. Moffet, an agency spokeswoman, said in a statement, referring to the state law requiring charities to register before soliciting money.",
    "Mrs. Trump is now selling tickets to the April high tea, with organizers saying that some of the profits will benefit an initiative of her Be Best endeavor called Fostering the Future, meant to provide computer-science scholarships to young people who have been in foster care.",
    "Her plan to maximize the sales price by accepting payments only in cryptocurrency appears to have backfired, however: The crash in cryptocurrency prices in January reduced the planned opening-bid price of $250,000 to about $170,000 on the final day of the auction.",
    "Eric Trump, the executive vice president of the Trump Organization, added in an interview that direct consumer sales and Mr. Trumps public appearances were worth a modest amount of money compared with the organizations real estate deals and other major ventures.",
    "His multimillion-dollar advance from the publishing company, first reported by The Washington Post, was confirmed by a person familiar with the arrangement; The Post also reported that Mr. Trump has delivered paid speeches since leaving office.",
    "Donald Trump Jr., for his part, operates another online store, selling proudly provocative clothes, like shirts that say, Guns Dont Kill People / Alec Baldwin Kills People  a reference to the actors movie-set shooting last year.",
    "Mrs. Trump, after declining to address questions from The Times about the status of the charity, sent a Tweet after publication of this article, asserting that everything has been done lawfully, & all documents are in the works.",
    "The real-estate business has, for the most part, been shrinking, with the Trump family selling off, terminating or being pushed out of hotel contracts in Washington, Toronto, New York City, Vancouver and Panama in recent years.",
    "Marketing MAGA to the masses\nAfter years of slapping his name, for a price, on everything from steaks to water bottles to golf courses, Mr. Trump has found a big new market for lower-priced goods like hats, T-shirts and books.",
    "But the golf business has benefited from a surge in play during the pandemic, with revenues even at the Trump golf course near Los Angeles, a Democratic stronghold, jumping by 50 percent since 2019, according to tax records.",
    "Now, he is executing the same playbook, only in reverse: converting a political following that provided hundreds of millions of dollars in small campaign contributions into a base of consumers for all things branded Trump.",
    "But no former president has been more determined to meld his business interests  from chocolate bars to real estate to a tech start-up  with a continuing political operation and capitalize on that for personal gain.",
    "The new push to capitalize on Mr. Trumps name and brand echoes what he has done for decades with his real estate company, whose holdings now include six hotels in the United States and more than a dozen golf clubs.",
    "There, a long red carpet marked the pathway into a Christmas-decorated hangar filled with supporters of Mr. Trump who had paid $10,000 to $30,000 for the privilege of attending a party and taking a photo with him.",
    "Asked about the solicitation, officials at the Florida agency that oversees charitable fund-raising said they also could not find evidence of the required state registration and had opened an inquiry as a result.",
    "Mr. Trumps business practices are the subject of investigations in New York by the Manhattan district attorney and the state attorney generals office, inquiries that Eric Trump says are politically motivated.",
    "That store is now selling red Make America Great Again hats for $50 each  a $20 markup from the price currently offered by his political action committee  with all proceeds going to a Trump-owned company.",
    "After sacrificing considerably to lead our nation, there continues to be unprecedented demand for President Trump, his thoughts and his products, unlike anything politics has ever seen, Mr. Budowich said.",
    "The roughly $375,000 the PAC paid in Trump Tower rent was more than the total of $350,000 that Mr. Trumps group donated to the scores of federal and state-level political candidates he endorsed in 2021.",
    "After the acquittal of Kyle Rittenhouse, the teen who shot and killed two people during the unrest in Kenosha, Wis., the store briefly promoted a new sweatshirt: In a World Full of Alecs, Be a Kyle.",
    "Much as he did while in the White House, Donald Trump has thoroughly blurred the lines between his political ambitions and his business interests, with a wide-ranging set of moneymaking ventures.",
    "In early December, Donald J. Trump put on a tuxedo and boarded the private jet of a scrap-metal magnate and crypto-miner for a short flight across Florida, touching down at an airport in Naples.",
    "Bill and Hillary Clintons speechmaking after leaving the White House was estimated to have netted them $153 million by the spring of 2015, when Mrs. Clinton announced her own run for president.",
    "In January, she put up for auction a digital portrait of her by a French artist, a print of the portrait and a white hat she once wore at the White House while meeting the president of France.",
    "In a statement, she said she would provide the site exclusive content to inspire others and promote a series of future online auctions of collectibles like the hat she wore at the White House.",
    "In the year since Mr. Trump has left the White House, he has undertaken a wide-ranging set of moneymaking ventures, trading repeatedly on his political fame and fan base in pursuit of profit.",
    "His wife, Melania, has gotten into the act, too, auctioning off online collectibles and scheduling her own big-ticket event in Naples this April, a tulips and topiaries high tea, with V.I.P.",
    "Sergio Gor, a co-founder of Winning Team Publishing with Donald Trump Jr., called the book a success and said he was in discussions to acquire the rights to the former presidents next one.",
    "Out of office, Mr. Trump faces few formal limits on his business dealings, though if he were to run again in 2024, some of his financial activity would be revealed on future disclosures.",
    "There are grandiose enterprises, such as a fledgling social-media company, whose billion-dollar market capitalization is largely predicated on Mr. Trumps direct personal involvement.",
    "In an interview, the younger Mr. Trump accused Democratic politicians like Attorney General Letitia James of New York of seeking political power by promising to go after his father.",
    "Mr. Keltner, the owner of Whip Fundraising, said that events like the one in Naples raised large sums for charity but declined to discuss the specifics of any events with Mr. Trump.",
    "Winning Team Publishing announced its second author this week: Charlie Kirk, the leader of Turning Point USA, a conservative youth group that holds its winter gala at Mar-a-Lago.",
    "His political operation has also promoted the book in emails to his supporters, as has his official post-presidential office, which also issued a recent statement (Check it out!)",
    "It was Mr. Keltner who arranged the flight for Mr. Trump to Naples, on the plane of Adam Weitsman, a crypto-mining investor who also owns a scrap-metal company in New York.",
    "Herschel Walker, the former football player whom Mr. Trump recruited to run for Senate in Georgia, spent more than $135,000 at Mar-a-Lago, Mr. Trumps private Florida club.",
    "Multiple attendees said they bought their tickets from a private company, Whip Fundraising, whose founder, Brad Keltner, has asserted that the lions share went to charity.",
    "You come here, you drink Trump, said Daniel Popescu, a 79-year-old architect and a bar regular, whose typical order is a $20 glass of Trump Blanc de Blanc sparkling wine.",
    "But for the most part, since Mr. Trump left office, his business has focused on appealing to Middle America, not buyers of luxury condos or multimillionaire investors.",
    "In Miami, the Trump family has announced plans to expand the Trump National Doral, long one of its biggest sources of revenue, by adding high-rise luxury condos.",
    "Mr. Trumps PAC made two $1 million donations to conservative nonprofits in 2021: the America First Policy Institute and the Conservative Partnership Institute.",
    "He expertly leveraged his celebrity as the host of The Apprentice and his image as a decisive businessman to build credibility when he first entered politics.",
    "Mr. Trump faced similar questions while president, as he frequently promoted, patronized and profited from his private properties, including internationally.",
    "At his first campaign-style rallies of 2022, in Arizona and Texas, giant television screens paid for by Mr. Trumps PAC advertised his $75 picture book.",
    "In 2021, Mr. Trumps political committees spent more than $600,000 on Trump properties for rent, meals, meeting expenses and hotel stays, records show.",
    "He has turned an online Trump store into a MAGA merchandiser, with his company sending marketing missives to people on his 2020 campaigns email list.",
    "He has published a $75 coffee-table book, after being paid a multimillion-dollar advance by a new publishing company co-founded by his eldest son.",
    "Much as he did while in the White House, Mr. Trump has thoroughly blurred the lines between his political ambitions and his business interests.",
    "The auction drew just seven bids, according to electronic records, which also suggest that the winning bid was made by the auctions sponsors.",
    "On a far bigger scale, the Trump Media & Technology Group, which is behind the new social media company, has raised more than $1 billion.",
    "For a billionaire to give up his life to do good for the country, Mr. Popescu said, with a shake of his head and a sip, its unbelievable.",
    "Her first posts were about Pearl Harbor Day and deadly tornadoes in Kentucky, but she began frequently posting about the online auction.",
    "Collectibles and high tea\nMrs. Trump, too, has found ways to monetize her ties to Mr. Trump, including through a series of online sales.",
    "The books sales are scarcely spectacular: The tell-all from his niece, Mary Trump, had sold 950,000 copies by the day it went on sale.",
    "Blurred lines between profit and politics\nAny division between Mr. Trumps business and his political operation can be hard to discern.",
    "Instead, Mr. Trumps share of the evenings proceeds went straight into his pocket, according to a person familiar with the arrangement.",
    "The event had all the trappings of a typical high-end fund-raiser: a giant American flag, a lectern, chandeliers and an open bar.",
    "Mr. OReilly pushed back on reports of empty seats by disclosing that gross receipts on the first show alone were $2 million.",
    "On sale at the events was Mr. Trumps coffee-table book, which the former president has said is nearing 250,000 copies sold.",
    "Bankers for the company dangled an unusual perk: Invest at least $100 million, get a phone call from the former president.",
    "The thing that is different about Trump is the making-money part seems to have permeated everything, Mr. Noble said.",
    "Tax records for the most recent year available show the group spent nearly $280,000 there on food and beverages.",
    "Many of those candidates, in turn, redirected funds back to Mr. Trump, holding lavish events at his properties.",
    "Taylor Budowich, a spokesman for Mr. Trump, noted that Mr. Trump had been wealthy before seeking public office.",
    "His political action committees have even fewer constraints than his re-election campaign account did.",
    "There is this appearance, at least, that he is always thinking: How can I make a profit off of this?",
    "Frank Stallones band provided the music; an anti-Biden Lets Go Brandon banner hung from the rafters.",
    "It is wrong for influence and power in this country to be sold for personal profit, Mr. Noble said.",
    "I just gave them a ride, Mr. Weitsman said, adding that the Trumps were very nice and respectful.",
    "He has gone on an arena tour with the former Fox News host Bill OReilly, where a backstage V.I.P.",
    "Florida requires any organization that raises charitable contributions in the state to register.",
    "On Wednesday, Parler announced a deal with Mrs. Trump whose financial terms were not disclosed.",
    "The Republican National Committee forked over $175,000 for a fund-raiser there in the spring.",
    "There was no indication of how much of the proceeds Mrs. Trump herself intended to pocket.",
    "His PAC continued to make monthly $37,541.67 rent payments to Trump Tower Commercial LLC.",
    "Mr. Weitsman said he flew Mr. Trump and the former first lady as a favor to Mr. Keltner.",
    "Shortly before the auction, Mrs. Trump joined the conservative social-media site Parler.",
    "He hailed Mr. Trump on a recent evening as the best president this country has ever had.",
    "For Mr. Trump, the monetization of his post-presidency represents a return to his roots.",
    "Its prosecutorial misconduct and its something you would find in a third world country.",
    "Letitia James campaigned on the promise of harassing and suing Donald Trump, he said.",
    "No charity with the name Fostering the Future or Be Best is registered in Florida.",
    "And Mr. Keltner, reached by phone, declined to discuss how money was distributed.",
    "Other past presidents have cashed in financially after leaving the White House.",
    "Barack and Michelle Obama reportedly sold a joint book deal for $65 million.",
    "His four-stop tour with Mr. OReilly sought to fill arenas at $100 a ticket.",
    "packages reaching $50,000 and an undisclosed portion going to charity.",
    "Watchdogs who worried then about his selling access remain concerned.",
    "But the money raised did not go to Mr. Trumps political operation.",
    "But the website advertising the event listed no charitable cause.",
    "George W. Bush has been a mainstay on the speaking circuit, too.",
    "Later, the price of such a call came down to $50 million.",
    "A tour organizer did not respond to requests for comment.",
    "We have had an exceptional year as a company, he said.",
    "Signed copies went for $229.99 and quickly sold out.",
    "But Mr. Trumps picture book is priced far higher.",
    "He said he did not have to pay for the privilege.",
    "Both also hosted big events at Mar-a-Lago.",
    "promoting a Trump property in Miami.",
    "package sold for more than $7,500."
  ]
}