{
  "id": 8190,
  "mediaId": 12,
  "date": "2/3/2022 12:00:00 AM",
  "headline": "Sharp growth in Georgia voters alters landscape for 2022 elections",
  "image": "https://www.ajc.com/resizer/J7KSvc1Qxtc6iyoph0u179QQdPk=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/U3YM72OEVFKSW7QELKVU2DN4YY.jpg",
  "link": "https://www.ajc.com/politics/sharp-growth-in-georgia-voters-alters-landscape-for-2022-elections/HEZQQJR75NAP5CHY56SKB4TS54/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Niesse",
  "authorUrl": "https://www.ajc.com/staff/mark-niesse/",
  "termIds": [
    815,
    2087,
    2095,
    146,
    501,
    2617,
    2642,
    2672,
    2686
  ],
  "sentences": [
    "Both political parties acknowledge these demographic trends generally favor Democrats in a closely divided state, where Democrat Joe Biden won the 2020 presidential race by less than 12,000 votes after Republican Brian Kemp prevailed in the 2018 gubernatorial contest by 55,000 votes.",
    "Greater Georgia, a voter engagement organization founded by former Republican U.S. Sen. Kelly Loeffler, recognizes that Georgia has become increasingly competitive because of efforts from the Left, spokeswoman Caitlin ODea said.",
    "Swing state\nThere are now nearly 7.7 million registered voters in Georgia, a sharp increase from 6.9 million voters before the 2018 election for governor, when Kemp defeated Democrat Stacey Abrams by 1.4 percentage points.",
    "Fueled by population growth and increases in turnout, Democrats gradually eroded Republican dominance, making consistent gains since 2006, when Republican Sonny Perdue won reelection for governor by 20 percentage points.",
    "But the true fight ahead is in turning out existing conservatives who were discouraged from voting in 2020  and in adding voters to our rolls through a year-round focus on registration and engagement.",
    "It wasnt until the 2020 elections that Democrats won statewide contests with victories by Biden in the presidential race, along with Jon Ossoff and Raphael Warnock in the U.S. Senate runoffs.",
    "A comparison of Georgias voter lists by The Atlanta Journal-Constitution shows how quickly the state has grown from 2018 to 2022, setting up tight elections for governor and the U.S. Senate.",
    "The biggest increases in voters were among those who identified themselves as Hispanic, Asian or other when registering to vote, which combined represent 8% of Georgias registered voters.",
    "Democrats won both of Georgias U.S. Senate seats after 752,000 voters who had participated in the 2020 presidential election didnt cast ballots in the runoffs, according to turnout data.",
    "Candidates from both parties will try to attract those new voters, whose political preferences arent necessarily as rigid.About 63% of Hispanic and 70% of Asian voters supported Biden.",
    "If you were to replay the 2018 election with a more diverse electorate, youd be seeing a coin toss of an election, said Tom Bonier, CEO of the Democratic data firm TargetSmart.",
    "But Republicans see vast room for gains as Bidens approval ratings slump, disillusioned conservative voters return to the fold and the GOP tries to appeal to people of color.",
    "Among Democrats, it remains in doubt whether the changes in Georgias electorate will result in victories at the polls during a lower-turnout, off-year election such as 2022.",
    "In all, there are 1.3 million voters registered today who werent signed up to vote before Election Day in 2018, according to a comparison of voter lists.",
    "Growth trends\nGeorgias shift from a solidly Republican state to perhaps the most closely divided state in the country has been building for years.",
    "Nonetheless, fast-growing populations of voters, like the Hispanic community, are increasingly supportive of the conservative agenda, ODea said.",
    "They first became eligible to vote when they turned 18, and many were automatically registered to vote when they obtained drivers licenses.",
    "In this years Senate race, the poll showed Republican Herschel Walker favored at 47% to Warnock at 44%, within the margin of error.",
    "Over the past four years, the percentage of white voters in Georgia has declined from 54% to 52% of the electorate.",
    "Most white and rural voters favor Republican candidates, while Black and urban voters tend to vote for Democrats.",
    "A recent AJC poll of registered voters showed Kemp ahead of Abrams, 48% to 41% in an early, hypothetical matchup.",
    "New voters are concentrated in metro Atlanta counties that have supported Democratic candidates in recent years.",
    "As the 2022 election year ramps up, a recent list of Georgias registered voters shows how the state has changed.",
    "The net increase in the number of registered Georgia voters is lower, 742,000, because of migration and deaths.",
    "While young voters lean toward Democrats, their turnout trails older and more politically involved voters.",
    "On a similar question pitting Republican David Perdue against Abrams, they finished in a statistical tie.",
    "About 12% of the states new voters are in Fulton County, followed by Gwinnett, DeKalb and Cobb counties.",
    "Meanwhile, Democrats believe theyve closed the gap from the last election for governor four years ago.",
    "Biden received about nine-tenths of the Black vote in 2020, according to the AP VoteCast survey.",
    "Rapid growth in the electorate since then could make this years races even more competitive.",
    "Theyre more racially diverse, with substantial increases of Hispanic and Asian voters.",
    "Republicans are focusing on both new voters and voters who sat out recent elections.",
    "The biggest group of new voters  52% of the total  is under 35 years old.",
    "The changes in the electorate are overwhelmingly favorable for Democrats.",
    "The changes create an opportunity for Republicans and Democrats alike.",
    "The number of registered voters has jumped 11% since four years ago.",
    "Warnock was leading other Republicans running for the U.S. Senate.",
    "Most new voters are under 35 and live in metro areas.",
    "The share of Black voters has held steady at 30%.",
    "The last election for Georgia governor was close."
  ]
}