{
  "id": 8272,
  "mediaId": 1576,
  "date": "1/18/2022 12:00:00 AM",
  "headline": "Georgians At The RNC: An Entirely Different Republican Strategy",
  "image": "https://www.wabe.org/app/uploads/2020/08/AP20241146683208-scaled.jpg",
  "link": "https://www.wabe.org/pantheon/georgians-at-the-rnc-an-entirely-different-republican-strategy/",
  "sentiment": "-0.399",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1131,
    1247,
    1794,
    2355,
    146,
    428,
    2672
  ],
  "sentences": [
    "To present diverse faces claiming that Donald Trump isnt a racist, and then, on the other hand, to invoke racial code words like law and order, they may actually end up counteracting each other and have little to no effect, she said.",
    "I guess this is maybe an entirely different Republican strategy because its not just that its Georgians in marginal seats were not featured, neither were politicians from other states that are thought to be marginal.",
    "University of Georgia political scientist Charles Bullock said the decision to exclude many of Georgia and the nations Republican politicians could have been strategic, to make room for different kinds of voices.",
    "The only other Georgian to speak during primetime was Herschel Walker, the former University of Georgia and professional football player, a longtime friend of Trumps, who also strongly defended him.",
    "Acknowledging that many might wonder about his presence at the convention he said, And heres the answer: the Democratic Party does not want Black people to leave their mental plantation.",
    "For someone like Perdue, a prominent Trump ally who is in a tight race with Democratic opponent Jon Ossoff, it could be more of a liability to appear at the convention, she said.",
    "Andra Gillespie, a political science professor at Emory University, said the Republican convention emphasized more diverse voices, perhaps in an attempt to broaden the base.",
    "The intra-party fight between Loeffler and Collins, who is challenging Loeffler in the November special election, could be dicey for the party to wade into, Gillespie said.",
    "In a nod to diversity and in a nod to President Trump really wanting to highlight his record, he probably wouldnt want to create certain types of distractions, she said.",
    "At the Republican National Convention, which wrapped up Thursday, the only Georgia politician in the featured speaking lineup was Democratic state Rep. Vernon Jones.",
    "But [Trump] may be doing his party and some of its endangered members a disservice by not giving them an opportunity to have a little exposure in prime time.",
    "Its an attempt, she argued, that might not work because of the conventions other messaging targeted to the partys base, about being tough on crime.",
    "Bullock said the Republican convention has very much been the Trump Convention, [with] the members of [Trumps] family all playing prominent roles.",
    "And including Georgias other politicians, such as controversial Republican Congressional nominee Marjorie Taylor Greene, could be distracting.",
    "David Perdue and Kelly Loeffler and Rep. Doug Collins all recorded videos for the convention, which aired before primetime earlier this week.",
    "Maybe this fits in with Trump trying to continue the narrative that hes an outsider, that hes not a professional politician, Bullock said.",
    "It may be the decision was not to share the spotlight with Republican Senators from Georgia or from anyplace else.",
    "Gillespie said there could be other reasons for the exclusion of Georgias Republican politicians from the lineup.",
    "I take it as a personal insult that people would think Ive had a 37-year friendship with a racist.",
    "Jones broke with his party this spring to endorse President Donald Trump.",
    "It hurt my soul to hear the terrible things people called Donald.",
    "Greene was invited to attend Trumps Thursday speech in person.",
    "Weve been forced to be there for decades and generations.",
    "The worst one is racist, he said.",
    "Trending",
    "Sens."
  ]
}