{
  "id": 8303,
  "mediaId": 25,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "Georgia Bulldogs win first national title since 1980",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/01/11/19d6505a-03e5-402f-9d28-e64e0308a073/thumbnail/1240x826/436c3bd2b1b458c7949a6020407b0801/gettyimages-1237653504.jpg",
  "link": "https://www.cbsnews.com/news/georgia-bulldogs-ncaa-football-national-title/",
  "sentiment": "0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    5873,
    5891,
    3315,
    2537,
    2672,
    2710,
    2711
  ],
  "sentences": [
    "Trending News\n Rafael Nadal tests positive for COVID: \"Unpleasant moments\"\n Ranking every Super Bowl, from worst to first\n Olympic high jumpers from Qatar and Italy share gold medal\n Former NFL star found dead in hotel room had CTE, family says\n Nick Kyrgios calls Australia's treatment of Novak Djokovic \"really bad\"\nDownload our Free App\nFor Breaking News & Analysis Download the Free CBS News app\n iOS\n Android\n Fire TV\n Apple TV\n Roku\n All Smart TV Apps",
    "Jamie Schwaberow / Getty Images\nStetson Bennett delivered the biggest throws of his storybook career and Georgia's defense sealed the sweetest victory in program history, vanquishing rival Alabama 33-18 in the College Football Playoff title Monday for its first national title in 41 years.",
    "Christopher Smith #29 of the Georgia Bulldogs intercepts a pass from the Alabama Crimson Tide during the College Football Playoff Championship held at Lucas Oil Stadium on January 10, 2022 in Indianapolis, Indiana.",
    "Instead of going down with a little over a minute left, Ringo took off and behind a convoy of blockers went 79 yards for a touchdown that set off a wild celebration by the Georgia fans who packed Lucas Oil Stadium.",
    "Nick Saban's Crimson Tide had won seven straight against the Bulldogs, including the last four against Georgia coach Kirby Smart, Saban's longtime assistant.",
    "3 Georgia a 19-18 lead with 8:09 left and then hooked up with Brock Bowers for a 15-yard TD on a screen to put the Bulldogs up with with 3:33 left.",
    "Kelee Ringo intercepted an underthrown deep ball down the sideline by Heisman Trophy winner Bryce Young.",
    "The Bulldogs hadn't won a national title since freshman Herschel Walker led them there in 1980.",
    "Bennett connected with Adonai Mitchell on a 40-yard touchdown to give No.",
    "If simply snapping the drought wasn't good enough, doing it against No.",
    "1 Alabama (13-2) had to make it feel even better.",
    "The final blow came from the defense."
  ]
}