{
  "id": 3701,
  "mediaId": 675,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Disney tries to keep its special district, now federal judge issues ruling",
  "image": "https://www.wnd.com/wp-content/uploads/2022/03/donald-duck-disney-angry-fist-fighting-florida-mickey-mouse-animals-pixabay.jpg",
  "link": "https://www.wnd.com/2022/05/disney-tries-keep-special-district-now-federal-judge-issues-ruling/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND Staff",
  "authorUrl": "https://www.wnd.com/author/wndstaff/",
  "termIds": [
    661,
    1448,
    2171,
    4508,
    524,
    613,
    3663,
    2661,
    5130
  ],
  "sentences": [
    "The report continued, \"Leaked videos published soon after Disney came out against the Florida legislation reportedly showed internal meetings in which Disney employees plotted to inject LGBT content into childrens shows and explained how the company was helping employees medically transition themselves and their children to the opposite sex.\"",
    "If the cancellation is fully implemented, the company will be subject to county zoning and regulatory agencies, such as building codes, and highway requirements, and instead of paying for those improvements through its own district, likely would be obligated to pay taxes for those services from the two counties in which its properties lie.",
    "But the facts are that Disney has been servicing that debt by payments to the special district already, and if that district is dissolved, and the liability transfers to local governments, it would be unclear why Disney would be allowed to suddenly halt what essentially were tax payments to service that debt.",
    "The report said Congress has allowed corporations to extend their copyrights for up to 120 years through the Copyright Term Extension Act, more commonly known as the Mickey Mouse Protection Act, Hawleys office told Fox News.",
    "A federal court judge has tossed out a legal challenge to a decision by Florida lawmakers to cancel a special tax district that was set up to provide Disney with special privileges, ruling the dispute involves state law.",
    "The Examiner explained the background: \"Critics such as Sanchez argued that DeSantis's move was done in retaliation against Disney for its vocal opposition to the Parental Rights in Education bill.\"",
    "The privilege for Disney was canceled by lawmakers who were concerned about the company's open antagonism toward a new state law protecting young children in schools from LGBT agenda indoctrination.",
    "Sanchez, in a statement to the Examiner through his office, said, \"Since the order is without prejudice, plaintiffs will be filing an amended complaint, as is often done in matters such as these.",
    "Betsy McCaughey\nRead all of today's COMMENTARY...\nMoney\nWorld\nDiversions\nHealth\nU.S.\nEducation\nPolitics\nMORE COMMENTARY\nMichael Brown\nLarry Elder\nRead all of today's COMMENTARY...\nNew Section",
    "The move comes after a public battle between Disney and DeSantis which ended with DeSantis stripping the company of its special administrative zone and accompanying tax privileges in April.",
    "Today Im introducing legislation to strip ?@Disney of its? special copyright protectionshttps://t.co/pushCxnjoO\n Josh Hawley (@HawleyMO) May 10, 2022\nNo more handouts for woke corporations.",
    "Hawleys Copyright Clause Restoration Act of 2022? would limit the length of copyrights Congress gives corporations to 56 years and would apply retroactively, according to Fox News.",
    "Ron DeSantis had demanded a halt to the legislative plans to dismantle the Reedy Creek Improvement District that essentially gives Disney total control of its own property.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "The district was created by the state  at the request of Disney  in the 1960s and allowed nearly total control by the company over its own properties.",
    "The Examiner reported U.S. District Judge Cecilia Altonaga ruled this week the federal court didn't have jurisdiction because it was a state dispute.",
    "It alleged the change violated the Florida Taxpayer's Bill of Rights and Reedy Creek Improvement Act, which the judge found to be state law issues.",
    "Disney has claimed that Florida taxpayers would be on the hook for about $1 billion in outstanding debt if the district vanishes.",
    "There, Republican Missouri Sen. Josh Hawley planned legislation stripping Disney of its special copyright privileges.",
    "Today Im introducing legislation to strip @Disney of its special copyright protections,? Hawley tweeted Tuesday.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "The lawsuit came from Democrat William Sanchez, a political candidate, and several individuals.",
    "The Daily Caller News Foundation reported this week the issue already was in Congress, too.",
    "If you like WND, get the news that matters most delivered directly to your inbox  for FREE!",
    "And she said the plaintiff's arguments regarding the First Amendment were flawed.",
    "Faith\nCommentary\nJack Cashill\nLt. Col. James Zumwalt\nJane M. Orient, M.D.",
    "The amended complaint should be filed by Monday, May 16th, 2022.\"",
    "The Washington Examiner reported the lawsuit against Florida Gov.",
    "The company had stated its goal was to overturn the law.",
    "Further, the law doesn't take effected until July.",
    "No more handouts for woke corporations."
  ]
}