{
  "id": 4036,
  "mediaId": 675,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "The conservative surge in Twitter followers  the Elon Musk effect?",
  "image": "https://www.wnd.com/wp-content/uploads/2022/04/Twitter-Pixabay.jpg",
  "link": "https://www.wnd.com/2022/05/conservative-surge-twitter-followers-elon-musk-effect/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Larry Elder",
  "authorUrl": "https://www.wnd.com/author/lelder/",
  "termIds": [
    661,
    1147,
    1473,
    2171,
    2517,
    3754,
    4268,
    177,
    262,
    539,
    637
  ],
  "sentences": [
    "Politics\nCommentary\nMichael Master\nMichael Brown\nJack Cashill\nLt. Col. James Zumwalt\nRead all of today's COMMENTARY...\nDiversions\nWorld\nMoney\nU.S.\nEducation\nHealth\nFaith\nMORE COMMENTARY\nBetsy McCaughey\nStar Parker\nBen Shapiro\nRead all of today's COMMENTARY...\nNew Section",
    "As to the study, Paul Barrett, deputy director of the NYU Stern Center for Business and Human Rights, said: \"Republicans, or more broadly conservatives, have been spreading a form of disinformation on how they're treated on social media.",
    "Ron DeSantis  three of America's most forthright conservative mouthpieces  have experienced an influx of 175,960, 301,570 and 286,559 followers respectively since the news of Musk's takeover broke earlier this week.\"",
    "TRENDING: Amber Heard makes massive mistake amid Johnny Depp trial, ditches PR team over nightmarish headlines\nMy campaign for governor of California, which attracted international attention, ended Sept. 14, 2021.",
    "USA Today said, \"Despite repeated charges of anti-conservative bias from former President Donald Trump and other GOP critics, Facebook, Twitter and Google's YouTube are not slanted against right-leaning users.\"",
    "In January, I wrote about a USA Today article centered around a New York University study that supposedly disproved the claim that social media platforms, like Twitter, discriminate against conservatives.",
    "The Daily Mail wrote: \"Alexandra (sic) Ocasio-Cortez (AOC), Hillary Clinton and Ellen DeGeneres have witnessed an exodus of 26,072, 21,424 and 27,141 Twitter followers respectively in the past four days.",
    "I wrote: \"Tell this to singer-songwriter John Ondrasik, to cite just one example, who on Jan. 2 posted his new music video critical of President Joe Biden's disastrous withdrawal from Afghanistan.",
    "Nine hours later, when conservatives and, one hopes, others complained, YouTube restored it, although it added another warning labeling the video 'inappropriate or offensive to some audiences.'",
    "As Ondrasik pointed out, a number of videos on YouTube displaying 'similar Taliban atrocities' not only remain on the platform but are monetized, actually making money for whoever posted it.\"",
    "If true, this undercuts the suspicion that Twitter employees might be covering their anticonservative biases in order to keep their jobs under the new and different management.",
    "By contrast, big-name liberals, with the exception of former President Barack Obama and President Joe Biden, experienced steep drops in their Twitter follower count.",
    "It certainly seems awfully peculiar that after Musk, a non-liberal, bought Twitter, the platform suddenly and dramatically appears more welcoming to conservatives.",
    "Twitter says it blocked anyone within the company from changing its algorithms to avoid internal sabotage from workers who might be unhappy with Musk's purchase.",
    "They complain they're censored and suppressed but, not only is there not evidence to support that, what evidence exists actually cuts in the other direction.\"",
    "YouTube first attached a warning that the video's images violated the platform's 'graphic content policy,' making it unsuitable for younger audiences.",
    "For whatever reason over the next several weeks, I lost over 25,000 followers and started losing hundreds of Twitter followers per day.",
    "Vice President of the United States Kamala Harris lost over 28,000 of her supporters and Michelle Obama dropped a dramatic 32,073.\"",
    "Other conservatives have similar stories about a sudden loss of Twitter followers or about suppressed content on that platform.",
    "But something odd happened shortly before and shortly after mega-billionaire Elon Musk announced his purchase of Twitter.",
    "\"About its abrupt takedown and restoration, YouTube explained: 'This was our mistake and we've reinstated your video.",
    "By contrast, I experienced no such erosion on Instagram and Facebook where I also regularly post content.",
    "But expect another New York University study to provide a perfectly innocent and rational explanation.",
    "The Daily Mail reported: \"Fox News host Tucker Carlson, Donald Trump Jr. and Florida Gov.",
    "Maybe Musk might next purchase The New York Times  and turn it into a newspaper.",
    "So sorry this happened and thanks for being patient while we worked this out.'",
    "Yet, the NYU study essentially dismissed these suspicions as baseless.",
    "But five days and 250,000 views later, YouTube removed it altogether.",
    "Other conservatives also saw their follower numbers suddenly spike.",
    "Or, perhaps, buy the Washington Post  and hire actual journalists.",
    "In a 24-to-48-hour span, I gained nearly 9,000 followers.",
    "This drip-by-drip erosion continued for months.",
    "What was there to 'work out'?",
    "One can hope.",
    "Who knows?"
  ]
}