{
  "id": 4212,
  "mediaId": 675,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Amazon to foot the bill for employees' abortion tourism",
  "image": "https://www.wnd.com/wp-content/uploads/2022/03/baby-babies-children-bright-whites-pure-abortion-planned-parenthood-unsplash.jpg",
  "link": "https://www.wnd.com/2022/05/amazon-foot-bill-employees-abortion-tourism/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    661,
    2171,
    13,
    539,
    2550,
    2661,
    2738,
    2846
  ],
  "sentences": [
    "Health\nCommentary\nScott Lively\nMychal Massie\nRachel Alexander\nRead all of today's COMMENTARY...\nMoney\nPolitics\nFaith\nU.S.\nDiversions\nEducation\nWorld\nMORE COMMENTARY\nMichael Brown\nOliver L. North & David Goetsch\nRead all of today's COMMENTARY...\nNew Section",
    "While the precedent set in Roe v. Wade generally bars states from banning abortion in the first six months of pregnancy, the Supreme Court could overturn that decision in Dobbs v. Jackson Womens Health or change the legal definition of fetal viability.",
    "By Laurel Duggan\nDaily Caller News Foundation\nAmazon will fund up to $4,000 in annual travel expenses for employees seeking abortions, according to a company spokesman, joining several other large corporations with similar policies.",
    "Florida Enacts Protections for Unborn Babies at 15 Weeks https://t.co/IeOANY8LxM\n Ron DeSantis (@GovRonDeSantis) April 14, 2022\nThe move comes as GOP-led states are implementing abortion limits ranging from conception to 15 weeks.",
    "TRENDING: Archaeologists find cave, then realize 70,000 Christians may have hidden in biggest underground city on Earth\nAn Amazon spokesman confirmed the policy to the Daily Caller News Foundation but declined to comment further.",
    "The company announced in an internal message that it will cover travel expenses for abortions when an employee cannot obtain one within 100 miles of their home and virtual care? is not possible, according to Reuters.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "The Amazon policy will cover $4,000 of travel for non-life-threatening medical procedures other than abortions as well, according to Reuters.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "Citigroup, Apple, Match Group and Yelp are also covering abortion-related travel expenses for employees.",
    "Florida, Oklahoma, Arizona and Kentucky implemented new restrictions in April alone.",
    "This story originally was published by the Daily Caller News Foundation.",
    "It will go into effect retroactively, extending to Jan. 1, 2022."
  ]
}