{
  "id": 7301,
  "mediaId": 98,
  "date": "5/23/2022 12:00:00 AM",
  "headline": "Primary problem: Michigan GOP governor candidates short signatures",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/aa096f1/2147483647/strip/true/crop/4866x3244+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdb%2F75%2F29e0eecc46cead0ef95ac2635cc6%2F52dac7c3363a4c1cbcb6c27b2e5b30bc",
  "link": "https://www.latimes.com/politics/story/2022-05-23/primary-problem-michigan-gop-governor-candidates-short-sigs",
  "sentiment": "0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DAVID EGGERT",
  "authorUrl": "",
  "termIds": [
    651,
    773,
    1682,
    1844,
    2002,
    2171,
    2298,
    3075,
    3095,
    3099,
    146,
    307,
    308,
    428,
    2791
  ],
  "sentences": [
    "Those qualifying for the ballot would be Dixon, a former conservative TV news host who netted the DeVos family endorsement earlier Monday; chiropractor and grass-roots activist Garrett Soldano; wealthy self-funding businessman Kevin Rinke; real estate broker and anti-coronavirus lockdown activist Ryan Kelley; and pastor Ralph Rebandt.",
    "The recommendations immediately transformed the race in the battleground state and dealt a major blow to former Detroit Police Chief James Craig, who has led in polling despite campaign problems, and businessman Perry Johnson, who has spent millions of his own money to run.",
    "LANSING, Mich. \nMichigan's elections bureau said late Monday that five Republican candidates for governor, including two leading contenders, failed to file enough valid nominating signatures and should not qualify for the August primary.",
    "The staff of the Democrat secretary of state does not have the right to unilaterally void every single signature obtained by the alleged forgers who victimized five campaigns, campaign consultant John Yob said in a statement.",
    "The agency found evidence of consistent handwriting across all 10 signatures on petition sheets and of round-tabling, where circulators took turns signing a line on each sheet in an effort to vary handwriting.",
    "We strongly believe they are refusing to count thousands of signatures from legitimate voters who signed the petitions and look forward to winning this fight before the board, and if necessary, in the courts.",
    "At this point, the Bureau does not have reason to believe that any specific candidates or campaigns were aware of the activities of fraudulent-petition circulators, staff wrote.",
    "Bureau staff also determined that three other lesser-known GOP candidates  Donna Brandenburg, Michael Brown and Michael Markey  did not turn in enough valid signatures.",
    "The bipartisan, four-member Board of State Canvassers will meet Thursday to consider the elections bureau's findings of fraud across five gubernatorial campaigns.",
    "They tossed 9,393, including 6,983 that they said are fraudulent and were gathered by many of the same people who also forged signatures that Craig submitted.",
    "Johnson, a self-proclaimed quality guru, vowed to fight the recommendation from the bureau, which is part of Secretary of State Jocelyn Benson's department.",
    "The bureau said it discovered the fraud on its own review and did not process the challenges filed by the Michigan Democratic Party and Dixon.",
    "If the canvassers agree with the recommendations, the 10-person field of political newcomers would be cut in half to five.",
    "The bureau said it was working to refer incidents of apparent fraud to law enforcement for criminal investigation.",
    "It tossed 11,113 signatures, including 9,879 that were allegedly fraudulently collected by 18 paid circulators.",
    "It also uncovered more than 42,000 bogus signatures that were collected for Brandenburg, Brown and Markey.",
    "Gretchen Whitmer in November, could end up going to court if they do not make the ballot.",
    "The bureau said Craig submitted 10,192 valid signatures  well short of the 15,000 needed.",
    "Another GOP candidate, Tudor Dixon, had also contested Craig's voter signatures as fake.",
    "Democrats had challenged their petitions, alleging mass forgery and other issues.",
    "The Republican candidates, who are vying to face Democratic Gov.",
    "Johnson turned in 13,800 valid signatures, according to staff."
  ]
}