{
  "id": 914,
  "mediaId": 675,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "L.A. lawless: Crime is so bad, a former Republican could win mayor's race",
  "image": "https://www.wnd.com/wp-content/uploads/2020/03/los-angeles-city-california-downtown-skyscrapers-buildings-americans-pixabay-jpg.jpg",
  "link": "https://www.wnd.com/2022/04/l-lawless-crime-bad-former-republican-win-mayors-race/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    796,
    1863,
    2171,
    2397,
    2434,
    290,
    428,
    2590,
    2764
  ],
  "sentences": [
    "Faith\nCommentary\nBrent Smith\nLt. Col. James Zumwalt\nPatrice Lewis\nWayne Allyn Root\nRead all of today's COMMENTARY...\nEducation\nU.S.\nDiversions\nWorld\nPolitics\nMoney\nHealth\nMORE COMMENTARY\nBarbara Simpson\nMichael Brown\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "Caruso is polling at 24% compared to 23% for Bass and 6% for City Council Member Kevin de Len in the city's Democratic primary, according to a poll from the UC Berkeley Institute of Governmental Studies and co-sponsored by the Los Angeles Times.",
    "TRENDING: School nurse fired for spilling beans on students given puberty blockers\nCaruso's campaign has emphasized the city's crime problem, according to the Los Angeles Times, and highlighted his service on the Los Angeles Police Commission.",
    "By Laurel Duggan\nDaily Caller News Foundation\nBillionaire real estate developer and former Republican Rick Caruso is a point ahead of his opponent, Democratic California Rep. Karen Bass, in the Los Angeles mayoral race, a recent poll found.",
    "pic.twitter.com/hkud7Okf6T\n Karen Bass (@KarenBassLA) April 10, 2022\nBrazen crime in the Los Angeles area has grabbed national headlines, and violent crime has seeped into upscale neighborhoods including Beverly Hills.",
    "Together we can clean up L.A.?\nBass' campaign has focused on social and economic justice, and she does not view increased policing as the answer to the city's crime problem.",
    "She said community organizations and trained experts, rather than law enforcement, must be given resources to deal with the root causes of crime on her campaign website.",
    "We have to prevent the conditions that lead to crime and rehabilitate people who have made mistakes,? she said on Twitter when announcing her plan to combat crime.",
    "Rampant homelessness, people living in fear for their safety and politicians in city hall just in it for themselves,? Caruso said in a campaign commercial.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "#CarusoCan? pic.twitter.com/UUGti9XXHY\n Rick J. Caruso (@RickCarusoLA) April 8, 2022\nThe city we love is in a state of emergency.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "Crime in the affluent commercial neighborhood of West Hollywood rose 137% in 2022, according to KTLA News.",
    "The poll surveyed 2,047 registered voters between March 29 and April 5, and had a margin of error of 3.5%.",
    "Bass and Caruso did not immediately respond to the Daily Caller News Foundation's request for comment.",
    "Caruso claimed during a mayoral debate that crime has fallen 30% during his time on the commission.",
    "The primary will move to a November runoff unless one candidate gets more than half of the votes.",
    "Los Angeles saw a 30% reduction in crime during my time as President of the Police Commission.",
    "They raised me to make a commitment to spend my life fighting for social and economic justice.",
    "We can have safety and justice at the same time.?\nMy father was a letter carrier.",
    "This story originally was published by the Daily Caller News Foundation.",
    "That's what I've done and that's why I'm running for mayor.",
    "I've done it before, and I will do it again as your Mayor.",
    "My mother was a homemaker."
  ]
}