{
  "id": 927,
  "mediaId": 147,
  "date": "3/24/2022 12:00:00 AM",
  "headline": "A new era of lawmakers driven from protests to the halls of power",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/assets/images/placeholder.jpg",
  "link": "https://www.pbs.org/newshour/show/a-new-era-of-lawmakers-driven-from-protests-to-the-halls-of-power",
  "sentiment": "0.0",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Geoff Bennett",
  "authorUrl": "https://www.pbs.org/newshour/author/geoff-bennett",
  "termIds": [
    646,
    1586,
    1970,
    2171,
    2258,
    2340,
    2419,
    2537,
    2805,
    2903
  ],
  "sentences": [
    "Geoff Bennett:\nYoung African Americans who had organized with the Student Nonviolent Coordinating Committee, or SNCC, and who campaigned alongside Dr. King for the Voting Rights Act, now turned from casting a ballot to getting their names on one, like Shirley Chisholm in 1968, the first Black woman elected to Congress and to run in a major presidential primary.",
    "Geoff Bennett:\nAnd the late Congressman John Lewis, known for giving a speech at the March on Washington and who was famously beaten and bloodied by police in 1965 as he crossed Alabama's Edmund Pettus Bridge to peacefully demonstrate for voting rights, an incident Lewis marked every year until his death in 2020.",
    "Geoff Bennett:\nActivists worked to register African Americans to vote in the Jim Crow South and took that cause to Washington, with Dr. Martin Luther King Jr. personally appealing to President Lyndon Johnson for the Voting Rights Act of 1965.",
    "Martin Luther King III, Civil Rights Leader:\nI also requested of the president that, as soon as the bill is signed, that, immediately, federal examiners would be placed in certain key counties where we have faced a great deal of resistance.",
    "Geoff Bennett:\nSix years after the death of Michael Brown pushed Bush into the political arena, Generation Z is making its way into the halls of power, fueled by the police killings of George Floyd and Breonna Taylor in 2020.",
    "Chi Osse:\nThere are some interviews that I had within the second month of running for office, and I completely rejected this idea that I was a politician or wanting to be a politician, but I think that was a bit of denial.",
    "I feel like my muscle grew a little, because it showed that, even though people say that you can't do anything, you can't move anything, you have no power, you have no say  it was unorthodox, I guess, what we did.",
    "Geoff Bennett:\nThe police killing of Michael Brown ignited nights of protests in Ferguson that Bush helped lead, sparking the Black Lives Matter movement and inspiring her and others to run for elected office.",
    "Geoff Bennett:\nBut for lawmakers like Osse and Bush, the question of translating the Black Lives Matter movement's success into law remains a challenge, which Glaude says is not new to this generation.",
    "Geoff Bennett:\nShe says she pulled from the toolbox a tactic of her role model, Shirley Chisholm, who was known for saying  quote  \"If they don't give you a seat at the table, bring a folding chair.\"",
    "Geoff Bennett:\nShe arrived at the Capitol in 2021, an insurgent progressive, having ended the political dynasty that had represented her St. Louis district for over half-a-century.",
    "And while he draws from the contributions of icons like John Lewis and Shirley Chisholm, he says he's equally inspired by his queer predecessors and by the people around him.",
    "Geoff Bennett:\nThis past August, some 11 million Americans were behind on rent and at risk of losing their homes, with the pandemic-related pause on evictions set to expire.",
    "The history-making win was long in the making for Bush, whose political ascent began in 2014, when her community became the epicenter of the fight against police violence.",
    "The peaceful demonstration for voting rights, met with police violence, galvanized young civil rights leaders to run for office, including the late Congressman John Lewis.",
    "The peaceful demonstration for voting rights that was met with police violence galvanized young civil rights leaders to run for office, including the late Rep. John Lewis.",
    "Geoff Bennett:\nBush slept on the steps of the U.S. Capitol for four nights, until the White house stepped in with a temporary extension of the evictions pause.",
    "Geoff Bennett:\nTwenty-three-year-old Chi Osse, now a New York City council member, said deciding to fight for change from the inside wasn't an easy choice.",
    "It was the people that I was on the ground protesting with who were leading those protests, which were a lot of young people of color, young Black folks.",
    "Eddie Glaude Jr., Princeton University:\nThey're moving not only from direct action in the streets to actually trying to grab hold of the reins of power.",
    "Rep. Cori Bush:\nYou need that outside game, which is the activist, and you need the inside game, being that person seated right here in Congress.",
    "(LAUGHTER)\nGeoff Bennett:\nA new generation of activists in politics, taking lessons from leaders past and carving their own way towards change.",
    "Read the Full Transcript\nJudy Woodruff:\nThis month marks the 57th anniversary of the civil rights march from Selma to Montgomery, Alabama.",
    "Eddie Glaude Jr.:\nWe often think of the country as kind of engaging in this kind of linear progression towards a more perfect union.",
    "Geoff Bennett:\nOsse too made history as the first openly queer person to represent his Brooklyn district, and the first from Gen Z.",
    "Eddie Glaude Jr.:\nYou had activists from across the wide spectrum of Black politics getting together to articulate a Black agenda.",
    "Geoff Bennett reports on the legacy of that generation and a new era of lawmakers driven from protest to the halls of power.",
    "Rep. Cori Bush:\nIf not enough people want to focus on it, you get to hear my mouth focus on it, because I am those people.",
    "Rep. Cori Bush:\nThere is a situation happening in St. Louis that needs to be addressed that didn't happen overnight.",
    "But you have been here for a while, and you didn't use your power, your pin, or the purse to be able to affect that.",
    "Geoff Bennett reports on the legacy of that generation and a new era of lawmakers who are following a similar path.",
    "Historically, this hyphenate, this activist-politician role, how has it shown up over time and how has it evolved?",
    "Geoff Bennett:\nEddie Glaude Jr. is the chair of the African American Studies Department at Princeton University.",
    "And the result was this extraordinary increase in the election of what we call BEOs, Black elected officials.",
    "But there's still so much that people were trying to do to hold us back, and we still broke through.",
    "And, of course, work was done before us to pave the way for us to do the work that we're doing now.",
    "Walk me through your journey from organizer to lawmaker, from protester to elected politician.",
    "Bush says she knew the feeling firsthand, as a single mom who had three times been evicted.",
    "So, once the president decided to extend the eviction moratorium, did you feel vindicated?",
    "Do you consider yourself to be an activist, or a politician, or some combination of both?",
    "Rep. Cori Bush:\nIt was just like, OK, well, we didn't get it done, so it's time to go.",
    "This month marks the 57th anniversary of the march from Selma to Montgomery, Alabama.",
    "If you don't like how I'm doing it, you should have fixed it before Cori got here.",
    "He says Bush follows a tradition dating back to the civil rights movement.",
    "I couldn't understand how human beings could allow that to happen.",
    "Returning to the steps now, she reflected on what it meant.",
    "Well, I don't know necessarily if vindicated is the word.",
    "And that's something that really sparked and got me here.",
    "It's always one step forward, two, three steps backwards.",
    "Rep. Cori Bush:\nI pull from my toolbox as an organizer.",
    "For the \"PBS NewsHour,\" I'm Geoff Bennett.",
    "Chi Osse:\nWho in particular inspires me?",
    "My main answer to that is my generation.",
    "You put yourself on the line first.",
    "It was  the people have to win.",
    "Rep. Cori Bush:\nAbsolutely.",
    "And that's not quite true.",
    "But I'm also an activist.",
    "I am a politician.",
    "So, now I'm here.",
    "What do you do?",
    "I felt happy.",
    "You built me."
  ]
}