[
  {
    "id": 2286,
    "mediaId": 43,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "?The problem with Democracy  you can look at quotes from famous Chinese leaders like Mao, Gorbachev  they loved Democracy because Democracy is a step toward socialism, which is a step towards communism.?\nWe will cross our fingers and hope that <span class='selected-term'>Loren Culp</span> does not somehow emerge from the crowded GOP Primary to unseat Dan Newhouse as the nominee, because Washington's 4th Congressional District has a +13 Republican lean, and whomever comes out of it is almost guaranteed a win, regrettably.",
    "author": "",
    "title": "Fanatical Republican Extremist of the Day: Loren Culp",
    "sentiment": "0.0"
  },
  {
    "id": 2285,
    "mediaId": 33,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "In Washington state, Trump endorsed the candidacy of former gubernatorial candidate <span class='selected-term'>Loren Culp</span>, a Republican who is running against GOP Rep. Dan Newhouse in the state's 4th District.",
    "author": "Chris Cillizza",
    "title": "Two more Republicans just went on Donald Trump's hit list",
    "sentiment": "0.0"
  },
  {
    "id": 984,
    "mediaId": 43,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "Washington Republican <span class='selected-term'>Loren Culp</span>\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "author": "",
    "title": "who refuses to accept his own 2020 defeat",
    "sentiment": "0.0"
  },
  {
    "id": 2280,
    "mediaId": 63,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "In Washington state, Thiel gave a much smaller amount ($2,900) to gubernatorial hopeful <span class='selected-term'>Loren Culp</span>; his campaign also spiraled.",
    "author": "Abram Brown",
    "title": "Poolside Fundraisers, Crypto And Mini-Trumps: Inside Peter Thiel's Life After Facebook",
    "sentiment": "0.0"
  },
  {
    "id": 57,
    "mediaId": 238,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Newhouse will benefit from Washington's top-two primary law as well, and Trump only recently endorsed a Newhouse opponent  <span class='selected-term'>Loren Culp</span>, the Republican nominee for Washington governor in 2020.",
    "author": "",
    "title": "Opinion: Republicans who voted to impeach Trump might be in less peril than people think",
    "sentiment": "0.0"
  },
  {
    "id": 2272,
    "mediaId": 157,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "You funny.https://twitter.com/Sessler/status/1512558618746359811\\u00a0\\u2026\n Dee Snider\\ud83c\\uddfa\\ud83c\\uddf8 (@Dee Snider\\ud83c\\uddfa\\ud83c\\uddf8) 1649488354\nDonald Trump has endorsed <span class='selected-term'>Loren Culp</span> in the race.",
    "author": "Bob Brigham",
    "title": "'Twisted Sister' represents 'traditional, conservative' values: GOP candidate",
    "sentiment": "0.0"
  },
  {
    "id": 2217,
    "mediaId": 376,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "Trump endorsed 2020 GOP gubernatorial nominee <span class='selected-term'>Loren Culp</span>, who refused to concede that race despite losing by 13.5 points to Democratic Gov.",
    "author": "",
    "title": "New lines, interesting races in Washington state",
    "sentiment": "0.0"
  },
  {
    "id": 2269,
    "mediaId": 157,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The core team of ShadowGate? promoters eventually expanded to include Scott Bennett, a former military contractor who had previously been convicted of making a false and fraudulent statement to the government and for the unauthorized wearing of a military uniform by a federal jury in Florida; Stephen Pidgeon, a Washington State attorney who represented Republican gubernatorial candidate <span class='selected-term'>Loren Culp</span> in a lawsuit alleging widespread election fraud that was reportedly withdrawn after the state Attorney General warned it would ask a judge the impose sanctions; and Dennis Nathan Cain, a former FBI contractor who reportedly possessed documents said to have linked the Clinton Foundation to the 2013 sale of a Canadian-owned mining company to a Russian firm's subsidiary.",
    "author": "Jordan Green",
    "title": "Insiders flagged credibility problems for 'key witness' in lawsuits filed to overturn 2020 election",
    "sentiment": "0.0"
  }
]