[
  {
    "id": 6647,
    "mediaId": 2664,
    "date": "2022-02-01",
    "sentence": "The slate of fake electors includes <span class='selected-term'>Lou Barletta</span> and Charlie Gerow, both candidates for governor in Pennsylvania; Burt Jones, a candidate for lieutenant governor in Georgia; James Lamon, a candidate for U.S. Senate from Arizona; and candidates for state legislative seats.",
    "author": "Kira Lerner",
    "title": "Trump’s fake electors: Here’s the full list"
  },
  {
    "id": 2124,
    "mediaId": 2732,
    "date": "2022-03-22",
    "sentence": "The four — <span class='selected-term'>Lou Barletta</span>, Jake Corman, Bill McSwain and Dave White — issued the joint statement Monday night, eight weeks before the May 17 primary election.",
    "author": "Associated Press",
    "title": "4 GOP candidates for Pa. governor set rules to join a debate"
  },
  {
    "id": 598,
    "mediaId": 2629,
    "date": "2022-04-13",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span> (R-PA) is the current front-runner in the crowded field of Republicans running to become Pennsylvania's next governor.",
    "author": "Emily Singer",
    "title": "Trump Bashes GOP Candidate In Pennsylvania For Failing To Overturn 2020 Election"
  },
  {
    "id": 610,
    "mediaId": 2732,
    "date": "2022-04-18",
    "sentence": "GOP candidates not participating include former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, state Sen. Doug Mastriano, former U.S. Attorney Bill McSwain and Delaware County business owner Dave White.",
    "author": "Paula Reed Ward",
    "title": "Trib Total Media co-sponsoring debate in Pa.'s hotly contested GOP primary race for governor"
  },
  {
    "id": 623,
    "mediaId": 2732,
    "date": "2022-04-20",
    "sentence": "The other four candidates — including poll front-runners state Sen. Doug Mastriano of Franklin County and ex-U.S. Rep. <span class='selected-term'>Lou Barletta</span> of Hazleton — demanded a partisan moderator and did not participate.",
    "author": "",
    "title": "5 takeaways from Spotlight PA’s Republican gubernatorial debate"
  }
]