[
  {
    "id": 820,
    "mediaId": 2679,
    "date": "2022-04-10",
    "sentence": "HARRISBURG, Pa. (AP) — Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY",
    "title": "GOP’s energy promises face limits in Pa. governor’s race"
  },
  {
    "id": 359,
    "mediaId": 2680,
    "date": "2022-04-10",
    "sentence": "HARRISBURG, Pa. (AP) — Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 302,
    "mediaId": 2509,
    "date": "2022-04-10",
    "sentence": "Republican candidates for Pennsylvania governor are pledging to open up natural gas production, but there are constraints to what a governor can do\nHARRISBURG, Pa. -- Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY Associated Press",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 164,
    "mediaId": 2594,
    "date": "2022-04-10",
    "sentence": "Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "Via AP news wire",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  }
]