[
  {
    "id": 6472,
    "mediaId": 2590,
    "date": "2022-01-27",
    "sentence": "The candidate, former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, who ran unsuccessfully for Senate in 2018, continued to maintain the Leaders Only Unite PAC, or LOU PAC, after leaving the House in 2019.",
    "author": "Daniel Marans",
    "title": "Pennsylvania Republican Lou Barletta’s PAC Spent Most Of Its Money On Overhead"
  },
  {
    "id": 6063,
    "mediaId": 2732,
    "date": "2022-02-03",
    "sentence": "He was followed by Senate President Pro Tempore Jake Corman of Centre County with 12 votes; GOP strategist and public relations firm CEO Charlie Gerow with seven; Chester County Chamber of Business and Industry CEO Guy Ciarrocchi, with five; former congressman <span class='selected-term'>Lou Barletta</span> of Luzerne County, with four; and Dr. Nche Zama, a retired cardiothoracic surgeon from Northampton County, with one vote.",
    "author": "",
    "title": "Last of GOP regional straw polls hand victories to Bartos, White for U.S. Senate, governor"
  },
  {
    "id": 2124,
    "mediaId": 2732,
    "date": "2022-03-22",
    "sentence": "The four — <span class='selected-term'>Lou Barletta</span>, Jake Corman, Bill McSwain and Dave White — issued the joint statement Monday night, eight weeks before the May 17 primary election.",
    "author": "Associated Press",
    "title": "4 GOP candidates for Pa. governor set rules to join a debate"
  },
  {
    "id": 2328,
    "mediaId": 6570,
    "date": "2022-03-23",
    "sentence": "It was a lighthearted reprieve from an hour of consensus, as <span class='selected-term'>Lou Barletta</span>, Bill McSwain, Jake Corman and Dave White — those in the field who have registered by name in recent polling — mostly agreed on the need to unleash Pennsylvania’s energy sector, cut the corporate net income tax rate and make the state less of a regulatory maze for businesses.",
    "author": "Julian Routh",
    "title": "GOP governor candidates take magic wand approach to fix one thing in Pennsylvania"
  },
  {
    "id": 359,
    "mediaId": 2680,
    "date": "2022-04-10",
    "sentence": "HARRISBURG, Pa. (AP) — Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 164,
    "mediaId": 2594,
    "date": "2022-04-10",
    "sentence": "Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "Via AP news wire",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 302,
    "mediaId": 2509,
    "date": "2022-04-10",
    "sentence": "Republican candidates for Pennsylvania governor are pledging to open up natural gas production, but there are constraints to what a governor can do\nHARRISBURG, Pa. -- Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY Associated Press",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 820,
    "mediaId": 2679,
    "date": "2022-04-10",
    "sentence": "HARRISBURG, Pa. (AP) — Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY",
    "title": "GOP’s energy promises face limits in Pa. governor’s race"
  },
  {
    "id": 668,
    "mediaId": 2732,
    "date": "2022-04-14",
    "sentence": "Here’s what we know about the Republican field’s donors, based on their most recent campaign finance reports covering the first three months of 2022 (the next report is due in early May):\n<span class='selected-term'>Lou Barletta</span>\nCash raised overall: $1.3 million.",
    "author": "Angela Couloumbis",
    "title": "Pa. primary election 2022: See how much money the GOP candidates for governor have raised"
  },
  {
    "id": 623,
    "mediaId": 2732,
    "date": "2022-04-20",
    "sentence": "The other four candidates — including poll front-runners state Sen. Doug Mastriano of Franklin County and ex-U.S. Rep. <span class='selected-term'>Lou Barletta</span> of Hazleton — demanded a partisan moderator and did not participate.",
    "author": "",
    "title": "5 takeaways from Spotlight PA’s Republican gubernatorial debate"
  },
  {
    "id": 786,
    "mediaId": 2509,
    "date": "2022-04-22",
    "sentence": "“We have a governor that wants to put us in a Regional Greenhouse Gas Initiative that will literally eliminate gas in Pennsylvania,” Republican candidate <span class='selected-term'>Lou Barletta</span> told a forum in Erie last month.",
    "author": "MARC LEVY Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 651,
    "mediaId": 2822,
    "date": "2022-04-22",
    "sentence": "“We have a governor that wants to put us in a Regional Greenhouse Gas Initiative that will literally eliminate gas in Pennsylvania,” Republican candidate <span class='selected-term'>Lou Barletta</span> told a forum in Erie last month.",
    "author": "MARC LEVY - Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  }
]