[
  {
    "id": 6804,
    "mediaId": 2732,
    "date": "2022-01-20",
    "sentence": "His announcement now reduces the field vying for GOP nomination in the May 17 primary to: <span class='selected-term'>Lou Barletta</span> of Luzerne County, Shawn Berger of Carbon County, Guy Ciarrocchi of Chester County, Senate President Pro Tempore Jake Corman of Centre County, Montgomery County Commissioner Joe Gale, Charlie Gerow of Cumberland County, Melissa Hart of Allegheny County, Sen. Scott Martin of Lancaster County, Sen. Doug Mastriano of Franklin County, William McSwain of Chester County, Jason Richey of Allegheny County, John Ventre of Westmoreland County, Dave White, and Dr. Nche Zama of Northampton County.",
    "author": "",
    "title": "Former Pa. House Speaker Mike Turzai declares he is not running for governor"
  },
  {
    "id": 7005,
    "mediaId": 2603,
    "date": "2022-01-24",
    "sentence": "On top of a flood of new anti-trans legislation, former congressman <span class='selected-term'>Lou Barletta</span>, currently running as the Republican candidate for governor in Pennsylvania, is making a campaign issue out of pledging “to protect girls’ and women’s sports from biological male competitors.”\n“Women fought for a level playing field in sports for a long time, and now the ‘woke’ crowd is taking it away from them again by forcing girls and women to compete against biological males who have physical advantages,” Barletta said in the release.",
    "author": "Emily Leibert",
    "title": "Pennsylvania Governor Candidate Pledges to ‘Protect Girls’ and Women’s Sports from Biological Male Competitors’"
  },
  {
    "id": 6472,
    "mediaId": 2590,
    "date": "2022-01-27",
    "sentence": "The candidate, former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, who ran unsuccessfully for Senate in 2018, continued to maintain the Leaders Only Unite PAC, or LOU PAC, after leaving the House in 2019.",
    "author": "Daniel Marans",
    "title": "Pennsylvania Republican Lou Barletta’s PAC Spent Most Of Its Money On Overhead"
  },
  {
    "id": 6388,
    "mediaId": 2658,
    "date": "2022-01-28",
    "sentence": "Ambassador to China Nick Burns … Christy Gibson … POLITICO’s Peter King … Helen Kalla … former Reps. <span class='selected-term'>Lou Barletta</span> (R-Pa.), Tom Downey (D-N.Y.) and Brian Bilbray (R-Calif.) … Lynnette Johnson Williams of BHJM Communications … Achim Bergmann … Leslie Jones of American Forests … Matt DoBias … Frank Purcell … Robert Satloff of the Washington Institute for Near East Policy … Skip Rutherford … Ted Greener of the ?Association of American Railroads … Reginald Darby … Microsoft’s Matt Gelman … John Milewski … Missy Lieberman of the Pew Charitable Trusts … Sam Greene … CNN’s Jay McMichael … Stephanie Adams … USA Today’s Courtney Subramanian … Blaine Volpe of the Millennial Action Project (28) … Terry McNaughton … Grant Campbell … Bloomberg’s Justin Fox … Danny Rickert (6-0)\nDid someone forward this email to you?",
    "author": "",
    "title": "POLITICO Playbook: Dr. Oz tries to please McConnell and Trump"
  },
  {
    "id": 7091,
    "mediaId": 2563,
    "date": "2022-01-28",
    "sentence": "I recently wrote an article, “The Midnight Flights of the Biden Administration,” that was partially predicated upon another Fox News report that included a video from <span class='selected-term'>Lou Barletta</span>, a former congressman and current candidate for the governorship of Pennsylvania, showing images of suspected ‘ghost flights’ arriving in Wilkes-Barre on Christmas.",
    "author": "Michael Cutler",
    "title": "Biden Admin Now Running Biggest Human Trafficking Operation in History"
  },
  {
    "id": 7003,
    "mediaId": 2746,
    "date": "2022-01-29",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span>, a close Trump ally and current Republican contender in the state’s gubernatorial race, also chimed in.",
    "author": "Joseph Clark",
    "title": "Trump, supporters take victory lap after Pennsylvania court decision on mail-in voting"
  },
  {
    "id": 6610,
    "mediaId": 4024,
    "date": "2022-01-31",
    "sentence": "“Now we know that not only was Act 77 a terrible law, it was also unconstitutional and shouldn’t have been passed in the first place,” former Rep. <span class='selected-term'>Lou Barletta</span> said.",
    "author": "Raymond\nWolfe",
    "title": "Trump, Republicans vindicated after Pennsylvania mail-in voting law struck down"
  },
  {
    "id": 6647,
    "mediaId": 2664,
    "date": "2022-02-01",
    "sentence": "The slate of fake electors includes <span class='selected-term'>Lou Barletta</span> and Charlie Gerow, both candidates for governor in Pennsylvania; Burt Jones, a candidate for lieutenant governor in Georgia; James Lamon, a candidate for U.S. Senate from Arizona; and candidates for state legislative seats.",
    "author": "Kira Lerner",
    "title": "Trump’s fake electors: Here’s the full list"
  },
  {
    "id": 6092,
    "mediaId": 2540,
    "date": "2022-02-02",
    "sentence": "And in Pennsylvania, Republican gubernatorial candidate <span class='selected-term'>Lou Barletta</span> has cited flights carrying children to the state for care from the border in his criticism of the Biden administration.",
    "author": "Priscilla Alvarez",
    "title": "Internal documents show heated back-and-forth between DeSantis and Biden admin over care of migrant children"
  },
  {
    "id": 5524,
    "mediaId": 2748,
    "date": "2022-02-03",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span> (R-PA), running for governor in Pennsylvania, has vowed to take similar action to ensure that NGOs and private contractors are not doing business with the state while aiding in illegal immigration.",
    "author": "John Binder",
    "title": "House Republicans Seek to Bankrupt Corporate-Funded NGOs Aiding Biden’s ‘Mass Invasion’"
  },
  {
    "id": 6063,
    "mediaId": 2732,
    "date": "2022-02-03",
    "sentence": "He was followed by Senate President Pro Tempore Jake Corman of Centre County with 12 votes; GOP strategist and public relations firm CEO Charlie Gerow with seven; Chester County Chamber of Business and Industry CEO Guy Ciarrocchi, with five; former congressman <span class='selected-term'>Lou Barletta</span> of Luzerne County, with four; and Dr. Nche Zama, a retired cardiothoracic surgeon from Northampton County, with one vote.",
    "author": "",
    "title": "Last of GOP regional straw polls hand victories to Bartos, White for U.S. Senate, governor"
  },
  {
    "id": 5627,
    "mediaId": 2665,
    "date": "2022-02-10",
    "sentence": "",
    "author": "James Varney",
    "title": "'Ghost Flights': The Mystery of the Migrant Kids the Feds Are Spiriting Into the U.S. Interior"
  },
  {
    "id": 5439,
    "mediaId": 2701,
    "date": "2022-02-15",
    "sentence": "",
    "author": "James Varney",
    "title": "Biden Admin Hiding ‘Ghost Flights’ Scattering Illegal Migrants Around The Country"
  },
  {
    "id": 4575,
    "mediaId": 2658,
    "date": "2022-02-15",
    "sentence": "Mastriano is running for governor of Pennsylvania, and has polled in second place — behind former Rep. <span class='selected-term'>Lou Barletta</span> — in multiple Republican primary polls, as City & State Pennsylvania has detailed.",
    "author": "",
    "title": "Jan. 6 panel targets key players in false Trump elector strategy"
  },
  {
    "id": 5236,
    "mediaId": 2729,
    "date": "2022-02-18",
    "sentence": "A poll conducted this month by the Trafalgar Group showed former U.S. Representative <span class='selected-term'>Lou Barletta</span>, an ardent Trump supporter, leading the pack of more than a dozen Republican gubernatorial candidates, followed by Mastriano.",
    "author": "Towleroad",
    "title": "Governors’ races in ‘blue wall’ states carry high stakes for voting rights"
  },
  {
    "id": 4697,
    "mediaId": 2592,
    "date": "2022-02-18",
    "sentence": "A poll conducted this month by the Trafalgar Group showed former U.S. Representative <span class='selected-term'>Lou Barletta</span>, an ardent Trump supporter, leading the pack of more than a dozen Republican gubernatorial candidates, followed by Mastriano.",
    "author": "James Oliphant",
    "title": "Governors' Races In 'Blue Wall' States Carry High Stakes For Voting Rights"
  },
  {
    "id": 4770,
    "mediaId": 2730,
    "date": "2022-02-20",
    "sentence": "pic.twitter.com/B4SR4oOY1O\n— Joe Gale (@VoteJoeGalePA) December 1, 2020\nFormer Rep. <span class='selected-term'>Lou Barletta</span>, who has a Contract for Pennsylvania Parents, also issued warnings about the unions.",
    "author": "Rebecca Downs",
    "title": "PA Gubernatorial Candidate is Anti-CRT, But Has Hire Lobbyists Who Previously Worked for Teachers Union"
  },
  {
    "id": 5369,
    "mediaId": 2603,
    "date": "2022-02-23",
    "sentence": "Last month, Pennsylvania Governor candidate <span class='selected-term'>Lou Barletta</span> pledged to “protect girls’ and women’s sports from biological male competitors,’’ exploiting the debate surrounding trans swimmer Lia Thomas for political steam.",
    "author": "Emily Leibert",
    "title": "Republicans' War on Trans Kids Keeps Getting Darker"
  },
  {
    "id": 5086,
    "mediaId": 2732,
    "date": "2022-02-24",
    "sentence": "Just one week after the catastrophe, candidate for governor <span class='selected-term'>Lou Barletta</span> sent out a campaign email blast blaming Democrats for the collapse.",
    "author": "Rep. Dan Frankel",
    "title": "Rep. Dan Frankel: Bridge collapse symbol of toxic politics, but doesn’t have to be"
  },
  {
    "id": 3709,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "White is sitting in a crowded primary field that includes former U.S. Rep. <span class='selected-term'>Lou Barletta</span> and William McSwain, a former U.S. attorney.",
    "author": "Matt Leach",
    "title": "Pennsylvania gubernatorial candidate gets private sit-down with Trump at CPAC; will seek endorsement"
  },
  {
    "id": 4050,
    "mediaId": 2631,
    "date": "2022-02-28",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span>, a hard-liner on immigration, was listed as a so-called alternate elector in Trump allies’ strategy to overturn the 2020 election — an illegitimate effort to send a completing slate of electors to Congress to stop the ascertainment of Biden’s win.",
    "author": "",
    "title": "Inside the chaotic GOP primary for governor in Pennsylvania"
  },
  {
    "id": 3894,
    "mediaId": 2676,
    "date": "2022-03-03",
    "sentence": "\"From parroting Donald Trump's lies about the election to embracing his far-right agenda,\" Pennsylvania Democratic Party spokesman Brendan Welch said in a statement, \"<span class='selected-term'>Lou Barletta</span> is running a campaign defined by Trumpian litmus tests and dangerous conspiracy theories.\"",
    "author": "Igor Derysh",
    "title": "Is Pennsylvania losing it? Hate groups proliferate as state GOP descends into MAGA paranoia"
  },
  {
    "id": 3656,
    "mediaId": 2664,
    "date": "2022-03-03",
    "sentence": "\"From parroting Donald Trump's lies about the election to embracing his far-right agenda,\" Pennsylvania Democratic Party spokesman Brendan Welch said in a statement, \"<span class='selected-term'>Lou Barletta</span> is running a campaign defined by Trumpian litmus tests and dangerous conspiracy theories.\"",
    "author": "Igor Derysh",
    "title": "Is Pennsylvania losing it? Hate groups proliferate as state GOP descends into MAGA paranoia"
  },
  {
    "id": 3973,
    "mediaId": 2550,
    "date": "2022-03-07",
    "sentence": "In the battle for the Republican gubernatorial nomination, meanwhile, former Rep. <span class='selected-term'>Lou Barletta</span> has a 17-14 edge over state Sen. Doug Mastriano, with all others in single digits.",
    "author": "",
    "title": "Morning Digest: With filing closed, here's how things looks in North Carolina's new House districts"
  },
  {
    "id": 2822,
    "mediaId": 2526,
    "date": "2022-03-12",
    "sentence": "Former congressman and leading Republican gubernatorial candidate <span class='selected-term'>Lou Barletta</span> (R-PA) told Breitbart News Saturday that as governor, he will use all powers available to him to stop illegal immigration, noting that many in the GOP do not have the backbone to stand against the radical left’s illegal immigration policies.",
    "author": "Hannah Bleau",
    "title": "Exclusive — Gubernatorial Candidate Lou Barletta: Illegal Immigration ‘Ends When I’m Governor of Pennsylvania’"
  },
  {
    "id": 3065,
    "mediaId": 6526,
    "date": "2022-03-15",
    "sentence": "George Bochetto, Philadelphia\nSean Gale, Plymouth Township, Montgomery\nDave McCormick, Pittsburgh, Allegheny\nJeff Bartos, Lower Merion Township, Montgomery\nKathy Barnette, Lower Moreland Township, Montgomery\nMehmet Oz, Bryn Athyn, Montgomery\nCarla Sands, Wormleysburg, Cumberland\nCharlie Gerow, Hampden Township, Cumberland\nDave White, Ridley Township, Delaware\n<span class='selected-term'>Lou Barletta</span>, Hazleton, Luzerne\nJason Richey, Sewickley Heights, Allegheny\nDouglas V. Mastriano, Greene Township, Franklin\nJoe Gale, Plymouth Township, Montgomery\nBill McSwain, West Chester, Chester\nMelissa Hart, Bradford Woods, Allegheny\nJake Corman, Bellefonte, Centre\nNche Zama, Wind Gap, Northampton\nClarice Schillinger, Horsham, Montgomery\nTeddy Daniels, Lake Twp, Wayne\nRick Saccone, Elizabeth Township, Allegheny\nCarrie Lewis Delrosso, Oakmont, Allegheny\nChris Frye, City Of New Castle, Lawrence\nJames Earl Jones, Hatboro, Montgomery\nJeff Coleman, Lemoyne, Cumberland\nJohn Brown, Bangor, Northampton\nRuss Diamond, Annville Township, Lebanon",
    "author": "Eugene Tauber",
    "title": "Here are the candidates running in Pennsylvania primary for U.S. Senate, governor and Congress"
  },
  {
    "id": 3208,
    "mediaId": 6570,
    "date": "2022-03-17",
    "sentence": "Former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, a leading contender for the GOP nomination in the Pennsylvania governor’s race, is hoisting up the economic impacts of Russia’s invasion into Ukraine as a portrait of why American energy independence is so important.",
    "author": "Julian Routh",
    "title": "GOP governor candidate Lou Barletta says Pennsylvania could lead the way for U.S. energy independence"
  },
  {
    "id": 2646,
    "mediaId": 6571,
    "date": "2022-03-19",
    "sentence": "A recent Fox News poll in Pennsylvania showed 19% of GOP primary voters saying they support <span class='selected-term'>Lou Barletta</span> and 18% backing Doug Mastriano.",
    "author": "",
    "title": "Big GOP Primary Field For Pa. Governor Has Party Leaders Worried"
  },
  {
    "id": 2124,
    "mediaId": 2732,
    "date": "2022-03-22",
    "sentence": "The four — <span class='selected-term'>Lou Barletta</span>, Jake Corman, Bill McSwain and Dave White — issued the joint statement Monday night, eight weeks before the May 17 primary election.",
    "author": "Associated Press",
    "title": "4 GOP candidates for Pa. governor set rules to join a debate"
  },
  {
    "id": 2718,
    "mediaId": 6571,
    "date": "2022-03-23",
    "sentence": "The four — <span class='selected-term'>Lou Barletta</span>, Jake Corman, Bill McSwain, and Dave White — issued the joint statement Monday night, eight weeks before the May 17 primary election.",
    "author": "",
    "title": "Pennsylvania GOP Candidates For Governor Set Rules To Join A Debate"
  },
  {
    "id": 2328,
    "mediaId": 6570,
    "date": "2022-03-23",
    "sentence": "It was a lighthearted reprieve from an hour of consensus, as <span class='selected-term'>Lou Barletta</span>, Bill McSwain, Jake Corman and Dave White — those in the field who have registered by name in recent polling — mostly agreed on the need to unleash Pennsylvania’s energy sector, cut the corporate net income tax rate and make the state less of a regulatory maze for businesses.",
    "author": "Julian Routh",
    "title": "GOP governor candidates take magic wand approach to fix one thing in Pennsylvania"
  },
  {
    "id": 2227,
    "mediaId": 2732,
    "date": "2022-03-24",
    "sentence": "Former congressman <span class='selected-term'>Lou Barletta</span>, state Senate President Pro Tempore Jake Corman, former U.S. Attorney Bill McSwain and former Delaware County councilman Dave White won’t take part in any debate that is not moderated by a Republican who lives in the state.",
    "author": "",
    "title": "Editorial: GOP candidates should embrace better debates"
  },
  {
    "id": 1978,
    "mediaId": 4045,
    "date": "2022-03-26",
    "sentence": "",
    "author": "MARC LEVY - Associated Press",
    "title": "Abortion to elections: Republican candidates on the issues"
  },
  {
    "id": 1248,
    "mediaId": 2526,
    "date": "2022-04-02",
    "sentence": "Tim Murtaugh, an advisor to gubernatorial competitor <span class='selected-term'>Lou Barletta</span>, told the publication that Mastriano’s proposal was a “dangerous idea.”\n“Directing the government to broadcast the personal medical information of private citizens is a dangerous idea that should never even be considered,” Murtaugh said.",
    "author": "Katherine Hamilton",
    "title": "Report: Pennsylvania State Sen. Doug Mastriano Wanted Government to Publicly Report Identities of Everyone Who Got Coronavirus"
  },
  {
    "id": 1046,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "The Pennsylvania GOP gubernatorial primary is similarly shaping up as a two-candidate race, according to the Emerson poll:\n<span class='selected-term'>Lou Barletta</span>: 20%.",
    "author": "Eric Mack",
    "title": "Emerson Poll: Oz Stalks Lead, but Undecided Voters Lean Toward McCormick"
  },
  {
    "id": 302,
    "mediaId": 2509,
    "date": "2022-04-10",
    "sentence": "Republican candidates for Pennsylvania governor are pledging to open up natural gas production, but there are constraints to what a governor can do\nHARRISBURG, Pa. -- Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY Associated Press",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 359,
    "mediaId": 2680,
    "date": "2022-04-10",
    "sentence": "HARRISBURG, Pa. (AP) — Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 820,
    "mediaId": 2679,
    "date": "2022-04-10",
    "sentence": "HARRISBURG, Pa. (AP) — Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY",
    "title": "GOP’s energy promises face limits in Pa. governor’s race"
  },
  {
    "id": 407,
    "mediaId": 4045,
    "date": "2022-04-10",
    "sentence": "",
    "author": "MARC LEVY - Associated Press",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 164,
    "mediaId": 2594,
    "date": "2022-04-10",
    "sentence": "Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "Via AP news wire",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 152,
    "mediaId": 2664,
    "date": "2022-04-12",
    "sentence": "\"And to top it off, former U.S. Rep. <span class='selected-term'>Lou Barletta</span> (R-PA), another leading candidate, just happened to have a campaign fund-raiser planned for Tuesday evening at Mar-a-Lago, Trump’s private club in Florida.",
    "author": "Bob Brigham",
    "title": "'Whiplash-inducing': Trump is 'still sowing chaos' in Pennsylvania GOP politics"
  },
  {
    "id": 921,
    "mediaId": 2732,
    "date": "2022-04-12",
    "sentence": "Corman’s withdrawal still would have left eight Republican candidates vying for the party’s nomination, including McSwain, former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, state Sen. Doug Mastriano and former Delaware County Councilman Dave White.",
    "author": "The Philadelphia Inquirer",
    "title": "Jake Corman is staying in the Republican race for Pennsylvania governor after moving to drop out"
  },
  {
    "id": 91,
    "mediaId": 2641,
    "date": "2022-04-12",
    "sentence": "A WHTM/Emerson College Polling/The Hill Pennsylvania primary survey last week showed former Rep. <span class='selected-term'>Lou Barletta</span> (19.8%) with a slight lead over state Sen. Doug Mastriano (19.4%) in the GOP gubernatorial primary race.",
    "author": "Charlie McCarthy",
    "title": "Trump Blasts Pennsylvania Governor Hopeful McSwain, Withholds Endorsement"
  },
  {
    "id": 631,
    "mediaId": 2746,
    "date": "2022-04-12",
    "sentence": "The blow to Mr. McSwain‘s campaign, coupled with the expected decision by state Senate President Pro Tempore Jake Corman to quit the race, leaves former U.S. Rep. <span class='selected-term'>Lou Barletta</span> and state Sen. Doug Mastriano as the two most prominent GOP candidates for governor.",
    "author": "Dave Boyer",
    "title": "Trump slams GOP candidate in Pa. governor’s race for not going after 2020 election fraud"
  },
  {
    "id": 598,
    "mediaId": 2629,
    "date": "2022-04-13",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span> (R-PA) is the current front-runner in the crowded field of Republicans running to become Pennsylvania's next governor.",
    "author": "Emily Singer",
    "title": "Trump Bashes GOP Candidate In Pennsylvania For Failing To Overturn 2020 Election"
  },
  {
    "id": 489,
    "mediaId": 2735,
    "date": "2022-04-14",
    "sentence": "Leading GOP candidates Doug Mastriano and <span class='selected-term'>Lou Barletta</span> even took part in Trump’s fraudulent elector scheme.",
    "author": "Igor Derysh",
    "title": "Trump Says He Advised Barr to Get Impeached in Support of Bogus Election Claims"
  },
  {
    "id": 668,
    "mediaId": 2732,
    "date": "2022-04-14",
    "sentence": "Here’s what we know about the Republican field’s donors, based on their most recent campaign finance reports covering the first three months of 2022 (the next report is due in early May):\n<span class='selected-term'>Lou Barletta</span>\nCash raised overall: $1.3 million.",
    "author": "Angela Couloumbis",
    "title": "Pa. primary election 2022: See how much money the GOP candidates for governor have raised"
  },
  {
    "id": 610,
    "mediaId": 2732,
    "date": "2022-04-18",
    "sentence": "GOP candidates not participating include former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, state Sen. Doug Mastriano, former U.S. Attorney Bill McSwain and Delaware County business owner Dave White.",
    "author": "Paula Reed Ward",
    "title": "Trib Total Media co-sponsoring debate in Pa.'s hotly contested GOP primary race for governor"
  },
  {
    "id": 883,
    "mediaId": 2645,
    "date": "2022-04-19",
    "sentence": "OAN Newsroom\nRepublican candidate for Pennsylvania governor, <span class='selected-term'>Lou Barletta</span> released a new television ad, highlighting his efforts fighting the failed democrat agenda.",
    "author": "",
    "title": "Pa. Governor candidate Barletta releases campaign ad highlighting efforts to fight failed Dem policies"
  },
  {
    "id": 623,
    "mediaId": 2732,
    "date": "2022-04-20",
    "sentence": "The other four candidates — including poll front-runners state Sen. Doug Mastriano of Franklin County and ex-U.S. Rep. <span class='selected-term'>Lou Barletta</span> of Hazleton — demanded a partisan moderator and did not participate.",
    "author": "",
    "title": "5 takeaways from Spotlight PA’s Republican gubernatorial debate"
  },
  {
    "id": 46,
    "mediaId": 2550,
    "date": "2022-04-20",
    "sentence": "PA-Gov: Former Rep. <span class='selected-term'>Lou Barletta</span> has put $750,000 behind his first TV ad for the May 17 Republican primary, which promotes how he was among the first in Congress to endorse Trump, led the way on anti-immigrant policies, and \"fought the liberals\" on energy policy.",
    "author": "",
    "title": "Morning Digest: Two Georgia Democrats focus on voting rights in"
  },
  {
    "id": 268,
    "mediaId": 2732,
    "date": "2022-04-22",
    "sentence": "“We have a governor that wants to put us in a Regional Greenhouse Gas Initiative that will literally eliminate gas in Pennsylvania,” Republican candidate <span class='selected-term'>Lou Barletta</span> told a forum in Erie last month.",
    "author": "Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 786,
    "mediaId": 2509,
    "date": "2022-04-22",
    "sentence": "“We have a governor that wants to put us in a Regional Greenhouse Gas Initiative that will literally eliminate gas in Pennsylvania,” Republican candidate <span class='selected-term'>Lou Barletta</span> told a forum in Erie last month.",
    "author": "MARC LEVY Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 651,
    "mediaId": 2822,
    "date": "2022-04-22",
    "sentence": "“We have a governor that wants to put us in a Regional Greenhouse Gas Initiative that will literally eliminate gas in Pennsylvania,” Republican candidate <span class='selected-term'>Lou Barletta</span> told a forum in Erie last month.",
    "author": "MARC LEVY - Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  }
]