[
  {
    "id": 6804,
    "mediaId": 2732,
    "date": "2022-01-20",
    "sentence": "His announcement now reduces the field vying for GOP nomination in the May 17 primary to: <span class='selected-term'>Lou Barletta</span> of Luzerne County, Shawn Berger of Carbon County, Guy Ciarrocchi of Chester County, Senate President Pro Tempore Jake Corman of Centre County, Montgomery County Commissioner Joe Gale, Charlie Gerow of Cumberland County, Melissa Hart of Allegheny County, Sen. Scott Martin of Lancaster County, Sen. Doug Mastriano of Franklin County, William McSwain of Chester County, Jason Richey of Allegheny County, John Ventre of Westmoreland County, Dave White, and Dr. Nche Zama of Northampton County.",
    "author": "",
    "title": "Former Pa. House Speaker Mike Turzai declares he is not running for governor"
  },
  {
    "id": 7005,
    "mediaId": 2603,
    "date": "2022-01-24",
    "sentence": "On top of a flood of new anti-trans legislation, former congressman <span class='selected-term'>Lou Barletta</span>, currently running as the Republican candidate for governor in Pennsylvania, is making a campaign issue out of pledging “to protect girls’ and women’s sports from biological male competitors.”\n“Women fought for a level playing field in sports for a long time, and now the ‘woke’ crowd is taking it away from them again by forcing girls and women to compete against biological males who have physical advantages,” Barletta said in the release.",
    "author": "Emily Leibert",
    "title": "Pennsylvania Governor Candidate Pledges to ‘Protect Girls’ and Women’s Sports from Biological Male Competitors’"
  },
  {
    "id": 6472,
    "mediaId": 2590,
    "date": "2022-01-27",
    "sentence": "The candidate, former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, who ran unsuccessfully for Senate in 2018, continued to maintain the Leaders Only Unite PAC, or LOU PAC, after leaving the House in 2019.",
    "author": "Daniel Marans",
    "title": "Pennsylvania Republican Lou Barletta’s PAC Spent Most Of Its Money On Overhead"
  },
  {
    "id": 7003,
    "mediaId": 2746,
    "date": "2022-01-29",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span>, a close Trump ally and current Republican contender in the state’s gubernatorial race, also chimed in.",
    "author": "Joseph Clark",
    "title": "Trump, supporters take victory lap after Pennsylvania court decision on mail-in voting"
  },
  {
    "id": 6647,
    "mediaId": 2664,
    "date": "2022-02-01",
    "sentence": "The slate of fake electors includes <span class='selected-term'>Lou Barletta</span> and Charlie Gerow, both candidates for governor in Pennsylvania; Burt Jones, a candidate for lieutenant governor in Georgia; James Lamon, a candidate for U.S. Senate from Arizona; and candidates for state legislative seats.",
    "author": "Kira Lerner",
    "title": "Trump’s fake electors: Here’s the full list"
  },
  {
    "id": 3709,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "White is sitting in a crowded primary field that includes former U.S. Rep. <span class='selected-term'>Lou Barletta</span> and William McSwain, a former U.S. attorney.",
    "author": "Matt Leach",
    "title": "Pennsylvania gubernatorial candidate gets private sit-down with Trump at CPAC; will seek endorsement"
  },
  {
    "id": 4050,
    "mediaId": 2631,
    "date": "2022-02-28",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span>, a hard-liner on immigration, was listed as a so-called alternate elector in Trump allies’ strategy to overturn the 2020 election — an illegitimate effort to send a completing slate of electors to Congress to stop the ascertainment of Biden’s win.",
    "author": "",
    "title": "Inside the chaotic GOP primary for governor in Pennsylvania"
  },
  {
    "id": 3656,
    "mediaId": 2664,
    "date": "2022-03-03",
    "sentence": "\"From parroting Donald Trump's lies about the election to embracing his far-right agenda,\" Pennsylvania Democratic Party spokesman Brendan Welch said in a statement, \"<span class='selected-term'>Lou Barletta</span> is running a campaign defined by Trumpian litmus tests and dangerous conspiracy theories.\"",
    "author": "Igor Derysh",
    "title": "Is Pennsylvania losing it? Hate groups proliferate as state GOP descends into MAGA paranoia"
  },
  {
    "id": 2822,
    "mediaId": 2526,
    "date": "2022-03-12",
    "sentence": "Former congressman and leading Republican gubernatorial candidate <span class='selected-term'>Lou Barletta</span> (R-PA) told Breitbart News Saturday that as governor, he will use all powers available to him to stop illegal immigration, noting that many in the GOP do not have the backbone to stand against the radical left’s illegal immigration policies.",
    "author": "Hannah Bleau",
    "title": "Exclusive — Gubernatorial Candidate Lou Barletta: Illegal Immigration ‘Ends When I’m Governor of Pennsylvania’"
  },
  {
    "id": 3208,
    "mediaId": 6570,
    "date": "2022-03-17",
    "sentence": "Former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, a leading contender for the GOP nomination in the Pennsylvania governor’s race, is hoisting up the economic impacts of Russia’s invasion into Ukraine as a portrait of why American energy independence is so important.",
    "author": "Julian Routh",
    "title": "GOP governor candidate Lou Barletta says Pennsylvania could lead the way for U.S. energy independence"
  },
  {
    "id": 2328,
    "mediaId": 6570,
    "date": "2022-03-23",
    "sentence": "It was a lighthearted reprieve from an hour of consensus, as <span class='selected-term'>Lou Barletta</span>, Bill McSwain, Jake Corman and Dave White — those in the field who have registered by name in recent polling — mostly agreed on the need to unleash Pennsylvania’s energy sector, cut the corporate net income tax rate and make the state less of a regulatory maze for businesses.",
    "author": "Julian Routh",
    "title": "GOP governor candidates take magic wand approach to fix one thing in Pennsylvania"
  },
  {
    "id": 1248,
    "mediaId": 2526,
    "date": "2022-04-02",
    "sentence": "Tim Murtaugh, an advisor to gubernatorial competitor <span class='selected-term'>Lou Barletta</span>, told the publication that Mastriano’s proposal was a “dangerous idea.”\n“Directing the government to broadcast the personal medical information of private citizens is a dangerous idea that should never even be considered,” Murtaugh said.",
    "author": "Katherine Hamilton",
    "title": "Report: Pennsylvania State Sen. Doug Mastriano Wanted Government to Publicly Report Identities of Everyone Who Got Coronavirus"
  },
  {
    "id": 1046,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "The Pennsylvania GOP gubernatorial primary is similarly shaping up as a two-candidate race, according to the Emerson poll:\n<span class='selected-term'>Lou Barletta</span>: 20%.",
    "author": "Eric Mack",
    "title": "Emerson Poll: Oz Stalks Lead, but Undecided Voters Lean Toward McCormick"
  },
  {
    "id": 820,
    "mediaId": 2679,
    "date": "2022-04-10",
    "sentence": "HARRISBURG, Pa. (AP) — Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY",
    "title": "GOP’s energy promises face limits in Pa. governor’s race"
  },
  {
    "id": 302,
    "mediaId": 2509,
    "date": "2022-04-10",
    "sentence": "Republican candidates for Pennsylvania governor are pledging to open up natural gas production, but there are constraints to what a governor can do\nHARRISBURG, Pa. -- Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY Associated Press",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 359,
    "mediaId": 2680,
    "date": "2022-04-10",
    "sentence": "HARRISBURG, Pa. (AP) — Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 91,
    "mediaId": 2641,
    "date": "2022-04-12",
    "sentence": "A WHTM/Emerson College Polling/The Hill Pennsylvania primary survey last week showed former Rep. <span class='selected-term'>Lou Barletta</span> (19.8%) with a slight lead over state Sen. Doug Mastriano (19.4%) in the GOP gubernatorial primary race.",
    "author": "Charlie McCarthy",
    "title": "Trump Blasts Pennsylvania Governor Hopeful McSwain, Withholds Endorsement"
  },
  {
    "id": 152,
    "mediaId": 2664,
    "date": "2022-04-12",
    "sentence": "\"And to top it off, former U.S. Rep. <span class='selected-term'>Lou Barletta</span> (R-PA), another leading candidate, just happened to have a campaign fund-raiser planned for Tuesday evening at Mar-a-Lago, Trump’s private club in Florida.",
    "author": "Bob Brigham",
    "title": "'Whiplash-inducing': Trump is 'still sowing chaos' in Pennsylvania GOP politics"
  },
  {
    "id": 921,
    "mediaId": 2732,
    "date": "2022-04-12",
    "sentence": "Corman’s withdrawal still would have left eight Republican candidates vying for the party’s nomination, including McSwain, former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, state Sen. Doug Mastriano and former Delaware County Councilman Dave White.",
    "author": "The Philadelphia Inquirer",
    "title": "Jake Corman is staying in the Republican race for Pennsylvania governor after moving to drop out"
  },
  {
    "id": 598,
    "mediaId": 2629,
    "date": "2022-04-13",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span> (R-PA) is the current front-runner in the crowded field of Republicans running to become Pennsylvania's next governor.",
    "author": "Emily Singer",
    "title": "Trump Bashes GOP Candidate In Pennsylvania For Failing To Overturn 2020 Election"
  },
  {
    "id": 610,
    "mediaId": 2732,
    "date": "2022-04-18",
    "sentence": "GOP candidates not participating include former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, state Sen. Doug Mastriano, former U.S. Attorney Bill McSwain and Delaware County business owner Dave White.",
    "author": "Paula Reed Ward",
    "title": "Trib Total Media co-sponsoring debate in Pa.'s hotly contested GOP primary race for governor"
  },
  {
    "id": 623,
    "mediaId": 2732,
    "date": "2022-04-20",
    "sentence": "The other four candidates — including poll front-runners state Sen. Doug Mastriano of Franklin County and ex-U.S. Rep. <span class='selected-term'>Lou Barletta</span> of Hazleton — demanded a partisan moderator and did not participate.",
    "author": "",
    "title": "5 takeaways from Spotlight PA’s Republican gubernatorial debate"
  },
  {
    "id": 786,
    "mediaId": 2509,
    "date": "2022-04-22",
    "sentence": "“We have a governor that wants to put us in a Regional Greenhouse Gas Initiative that will literally eliminate gas in Pennsylvania,” Republican candidate <span class='selected-term'>Lou Barletta</span> told a forum in Erie last month.",
    "author": "MARC LEVY Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 651,
    "mediaId": 2822,
    "date": "2022-04-22",
    "sentence": "“We have a governor that wants to put us in a Regional Greenhouse Gas Initiative that will literally eliminate gas in Pennsylvania,” Republican candidate <span class='selected-term'>Lou Barletta</span> told a forum in Erie last month.",
    "author": "MARC LEVY - Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  }
]