[
  {
    "id": 3709,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "White is sitting in a crowded primary field that includes former U.S. Rep. <span class='selected-term'>Lou Barletta</span> and William McSwain, a former U.S. attorney.",
    "author": "Matt Leach",
    "title": "Pennsylvania gubernatorial candidate gets private sit-down with Trump at CPAC; will seek endorsement"
  },
  {
    "id": 2328,
    "mediaId": 6570,
    "date": "2022-03-23",
    "sentence": "It was a lighthearted reprieve from an hour of consensus, as <span class='selected-term'>Lou Barletta</span>, Bill McSwain, Jake Corman and Dave White — those in the field who have registered by name in recent polling — mostly agreed on the need to unleash Pennsylvania’s energy sector, cut the corporate net income tax rate and make the state less of a regulatory maze for businesses.",
    "author": "Julian Routh",
    "title": "GOP governor candidates take magic wand approach to fix one thing in Pennsylvania"
  },
  {
    "id": 1248,
    "mediaId": 2526,
    "date": "2022-04-02",
    "sentence": "Tim Murtaugh, an advisor to gubernatorial competitor <span class='selected-term'>Lou Barletta</span>, told the publication that Mastriano’s proposal was a “dangerous idea.”\n“Directing the government to broadcast the personal medical information of private citizens is a dangerous idea that should never even be considered,” Murtaugh said.",
    "author": "Katherine Hamilton",
    "title": "Report: Pennsylvania State Sen. Doug Mastriano Wanted Government to Publicly Report Identities of Everyone Who Got Coronavirus"
  },
  {
    "id": 820,
    "mediaId": 2679,
    "date": "2022-04-10",
    "sentence": "HARRISBURG, Pa. (AP) — Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY",
    "title": "GOP’s energy promises face limits in Pa. governor’s race"
  },
  {
    "id": 302,
    "mediaId": 2509,
    "date": "2022-04-10",
    "sentence": "Republican candidates for Pennsylvania governor are pledging to open up natural gas production, but there are constraints to what a governor can do\nHARRISBURG, Pa. -- Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY Associated Press",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 164,
    "mediaId": 2594,
    "date": "2022-04-10",
    "sentence": "Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "Via AP news wire",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 359,
    "mediaId": 2680,
    "date": "2022-04-10",
    "sentence": "HARRISBURG, Pa. (AP) — Republican Bill McSwain pledges to be a pro-energy governor by “turning on the spigot of natural gas.” Another hopeful, Dave White, says he wants Pennsylvania “to be the energy capital of the world.” A third candidate, <span class='selected-term'>Lou Barletta</span>, says having a glut of natural gas in the ground without a pipeline is “like being in college and having a keg of beer without a tap.”\nIn Pennsylvania, the No.",
    "author": "MARC LEVY",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 921,
    "mediaId": 2732,
    "date": "2022-04-12",
    "sentence": "Corman’s withdrawal still would have left eight Republican candidates vying for the party’s nomination, including McSwain, former U.S. Rep. <span class='selected-term'>Lou Barletta</span>, state Sen. Doug Mastriano and former Delaware County Councilman Dave White.",
    "author": "The Philadelphia Inquirer",
    "title": "Jake Corman is staying in the Republican race for Pennsylvania governor after moving to drop out"
  },
  {
    "id": 598,
    "mediaId": 2629,
    "date": "2022-04-13",
    "sentence": "Former Rep. <span class='selected-term'>Lou Barletta</span> (R-PA) is the current front-runner in the crowded field of Republicans running to become Pennsylvania's next governor.",
    "author": "Emily Singer",
    "title": "Trump Bashes GOP Candidate In Pennsylvania For Failing To Overturn 2020 Election"
  },
  {
    "id": 623,
    "mediaId": 2732,
    "date": "2022-04-20",
    "sentence": "The other four candidates — including poll front-runners state Sen. Doug Mastriano of Franklin County and ex-U.S. Rep. <span class='selected-term'>Lou Barletta</span> of Hazleton — demanded a partisan moderator and did not participate.",
    "author": "",
    "title": "5 takeaways from Spotlight PA’s Republican gubernatorial debate"
  },
  {
    "id": 786,
    "mediaId": 2509,
    "date": "2022-04-22",
    "sentence": "“We have a governor that wants to put us in a Regional Greenhouse Gas Initiative that will literally eliminate gas in Pennsylvania,” Republican candidate <span class='selected-term'>Lou Barletta</span> told a forum in Erie last month.",
    "author": "MARC LEVY Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 651,
    "mediaId": 2822,
    "date": "2022-04-22",
    "sentence": "“We have a governor that wants to put us in a Regional Greenhouse Gas Initiative that will literally eliminate gas in Pennsylvania,” Republican candidate <span class='selected-term'>Lou Barletta</span> told a forum in Erie last month.",
    "author": "MARC LEVY - Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  }
]