[
  {
    "id": 3039,
    "mediaId": 2702,
    "date": "2022-02-03",
    "sentence": "The conservative Club for Growth’s political action committee is intervening in the Republican Senate primary in Arizona, endorsing venture capitalist <span class='selected-term'>Blake Masters</span> to take on Sen. Mark Kelly (D-Ariz.).",
    "author": "Max Greenwood",
    "title": "Club for Growth endorses Blake Masters in Arizona Senate race"
  },
  {
    "id": 2326,
    "mediaId": 2748,
    "date": "2022-02-04",
    "sentence": "Brand new ad from <span class='selected-term'>Blake Masters</span>\nMasters is running for U.S. Senate in Arizona\nConversation with Madison Cawthorn",
    "author": "Blarp Blog",
    "title": "Psychopaths are running the country…Videos"
  },
  {
    "id": 2290,
    "mediaId": 2644,
    "date": "2022-02-07",
    "sentence": "“Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions.”\nThiel likewise praised Zuckerberg for his “intelligence, energy, and conscientiousness.”\n“His talents will serve Meta well as he leads the company into a new era,” Thiel said\nThiel is now reportedly expected to focus more of his time on conservative political causes, including senate bids by two of his proteges, <span class='selected-term'>Blake Masters</span> and JD Vance, according to the WSJ report.",
    "author": "Theo Wayt",
    "title": "Peter Thiel leaving Meta board, will reportedly focus on pro-Trump advocacy"
  },
  {
    "id": 1931,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "Thiel has already announced support for <span class='selected-term'>Blake Masters</span> who is running for the US Senate in Arizona.",
    "author": "Jim Hoft",
    "title": "Billionaire Peter Thiel to Step Down from Facebook Board to Support President Trump-Aligned Candidates in 2022"
  },
  {
    "id": 7802,
    "mediaId": 2557,
    "date": "2022-03-31",
    "sentence": "https://t.co/7G0bOOjUTd #azleg pic.twitter.com/WiJLv1HhXL\n— AZ House Republicans (@AZHouseGOP) March 30, 2022\n<span class='selected-term'>Blake Masters</span> of Arizona, a Republican candidate for U.S. Senate, released the following video message praising the newly-passed bill.",
    "author": "DML News App",
    "title": "REPORT: State will force voters to show proof of citizenship in bid to crack down on fraud"
  },
  {
    "id": 7509,
    "mediaId": 2699,
    "date": "2022-04-01",
    "sentence": "For instance, take <span class='selected-term'>Blake Masters</span>, a far-right Republican candidate vying for Senate in Arizona and a longtime vocal crypto advocate.",
    "author": "Roger Sollenberger",
    "title": "Bitcoin Makes QAnon Candidate’s Fundraising Even Sadder"
  },
  {
    "id": 7015,
    "mediaId": 8349,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Garret Lewis",
    "title": "Garret Talks To Blake Masters About Election Fraud Report, Border"
  },
  {
    "id": 5537,
    "mediaId": 4091,
    "date": "2022-04-14",
    "sentence": "He was known to the FBI, but FBI was too busy kidnapping the Michigan governor.pic.twitter.com/LFXCCAbQmh\n— <span class='selected-term'>Blake Masters</span> (@bgmasters) April 13, 2022\nAfter two suspects were acquitted in an alleged plot to kidnap Governor Whitmer, a Daily Mail report revealed that the FBI played an instrumental role in escalating what was initially just ‘stoned crazy talk’ in to a full blown plan to kidnap Governor Whitmer.",
    "author": "News Editors",
    "title": "“FBI was too busy kidnapping the Michigan Governor” to keep tabs on black nationalist NYC subway shooter who was on their radar” says Arizona senate candidate"
  }
]