[
  {
    "id": 4473,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "Arizona GOP Senate candidate <span class='selected-term'>Blake Masters</span> last month raised $550,000 in 36 hours when he auctioned off digital tokens depicting the cover of a book he wrote with tech investor and GOP megadonor Peter Thiel.",
    "author": "",
    "title": "Former Manchin chief signs 2"
  },
  {
    "id": 3169,
    "mediaId": 2643,
    "date": "2022-01-27",
    "sentence": "",
    "author": "Jake Thomas",
    "title": "For Some, Biden's Pledge of SCOTUS Nominee Puts Race Above Achievement"
  },
  {
    "id": 3039,
    "mediaId": 2702,
    "date": "2022-02-03",
    "sentence": "The conservative Club for Growth’s political action committee is intervening in the Republican Senate primary in Arizona, endorsing venture capitalist <span class='selected-term'>Blake Masters</span> to take on Sen. Mark Kelly (D-Ariz.).",
    "author": "Max Greenwood",
    "title": "Club for Growth endorses Blake Masters in Arizona Senate race"
  },
  {
    "id": 10977,
    "mediaId": 2573,
    "date": "2022-03-11",
    "sentence": "Arizona Senate candidate <span class='selected-term'>Blake Masters</span> joined ‘Tucker Carlson Tonight’ to weigh in on Big Tech censorship and the ‘hook’ it has into the White House.",
    "author": "Fox News Staff",
    "title": "Big Tech has a 'hook' into the White House says US Senate candidate"
  },
  {
    "id": 11204,
    "mediaId": 2598,
    "date": "2022-03-17",
    "sentence": "",
    "author": "",
    "title": "Blake Masters Quits Peter Thiel Foundation To Run For Senate"
  },
  {
    "id": 5567,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "Arizona Republican Senate candidate <span class='selected-term'>Blake Masters</span> has made no secret of his connections to his longtime business partner and biggest political benefactor, billionaire tech investor Peter Thiel.",
    "author": "Roger Sollenberger",
    "title": "The Epic Back-Scratching Fest Between a GOP Senate Wannabe and a Trumpy Billionaire"
  },
  {
    "id": 7015,
    "mediaId": 8349,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Garret Lewis",
    "title": "Garret Talks To Blake Masters About Election Fraud Report, Border"
  },
  {
    "id": 5537,
    "mediaId": 4091,
    "date": "2022-04-14",
    "sentence": "He was known to the FBI, but FBI was too busy kidnapping the Michigan governor.pic.twitter.com/LFXCCAbQmh\n— <span class='selected-term'>Blake Masters</span> (@bgmasters) April 13, 2022\nAfter two suspects were acquitted in an alleged plot to kidnap Governor Whitmer, a Daily Mail report revealed that the FBI played an instrumental role in escalating what was initially just ‘stoned crazy talk’ in to a full blown plan to kidnap Governor Whitmer.",
    "author": "News Editors",
    "title": "“FBI was too busy kidnapping the Michigan Governor” to keep tabs on black nationalist NYC subway shooter who was on their radar” says Arizona senate candidate"
  }
]