{
  "id": 10746,
  "mediaId": 2550,
  "date": "2022-03-10",
  "headline": "Ukraine update: 'R' is for Russia",
  "image": "https://images.dailykos.com/images/1046866/story_image/AP22068633624084.jpg?1646919975",
  "link": "https://www.dailykos.com/stories/2022/3/10/2085075/-Ukraine-update-R-is-for-Russia?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Sumner",
  "authorUrl": "/users/mark sumner",
  "termIds": [
    2443,
    5384,
    4591,
    4524,
    3618,
    6286,
    6672,
    6569,
    6678
  ],
  "sentences": [
    "As a prime example, see Tucker Carlson who is, unaccountably, still on Fox News, defending Russian claims, laughing at Nuland, and claiming that “this is all entirely real.”\nWhat might be a bit more surprising — but probably shouldn’t be at this point — is this statement from Kentucky Republican Rep. Thomas Massie, here citing professional troll Glenn Greenwald.",
    "?Russian forces reportedly hit a gas pipeline near #Svitlodarsk #Ukraine #UkraineRussiaWar pic.twitter.com/xGrRSzK9IP\n— MilitaryLand.net (@Militarylandnet) March 10, 2022\nThursday, Mar 10, 2022 · 10:42:31 AM Pacific Standard Time · Mark Sumner\nWhen this war is over, the documentary filmmakers are going to have a hard time sorting through all the available media.",
    "The bomb crater from one of the weapons that struck the maternity hospital in Mariupol\nLong before Vladimir Putin sent the tanks over the border into Ukraine, he began building a propaganda case that has helped his war maintain majority support inside Russia, even though the average Russian is seeing their meager life savings absolutely destroyed.",
    "pic.twitter.com/7BUHJDJ9eJ\n— The Kyiv Independent (@KyivIndependent) March 10, 2022\nThursday, Mar 10, 2022 · 10:51:39 AM Pacific Standard Time · Mark Sumner\nA specific claim related to the idea that Russia is initiating false flag operations inside Ukraine both to act as chemical attacks, and justify further use of chemical weapons.",
    "“By targeting bakeries, schools, and hospitals, you make people lose all hope.” https://t.co/WmUDJyt3er\n— Julia Ioffe (@juliaioffe) March 10, 2022\nThursday, Mar 10, 2022 · 10:36:52 AM Pacific Standard Time · Mark Sumner\nAnd speaking of hitting infrastructure for the singular purpose of making people miserable …\nx\n??",
    "?Armed Forces (@ArmedForcesUkr) March 10, 2022\nThursday, Mar 10, 2022 · 10:34:09 AM Pacific Standard Time · Mark Sumner\nA reminder that Russia’s bombing of civilian sites is not generated from simple carelessness, and the frequent strikes against hospitals, schools, and basic infrastructure are not accidental.",
    "pic.twitter.com/L1b4k1PodF\n— Peter Baker (@peterbakernyt) March 10, 2022\nThursday, Mar 10, 2022 · 10:23:46 AM Pacific Standard Time · Mark Sumner\nOryx has now passed 1,000 Russian vehicles and aircraft, photographically identified as destroyed, abandoned, or captured by Ukrainian forces.",
    "https://t.co/XkOu4ky9Xz\n— Thomas Massie (@RepThomasMassie) March 9, 2022\nYes, this is a “serious admission, under oath,” to something that the United States has been publicly and openly working on, in conjunction with the Ukrainian government, since there has been a Ukrainian government.",
    "https://t.co/KyFGjaT3pV\n— Oz Katerji (@OzKaterji) March 10, 2022\nThursday, Mar 10, 2022 · 10:00:35 AM Pacific Standard Time · Mark Sumner\nThis kind of result makes it seem as if the commitment of Russian forces to do anything but sit miles back and lob artillery is completely lacking.",
    "It shouldn’t be necessary to go to Poynter’s fact checking site for something this sickening and ridiculous, but just in case:\n“We found no evidence that Russian President Vladimir Putin bombed property owned by President Joe Biden or that the president owns any villas in Ukraine.",
    "Cooperation between Ukrainian scientists and U.S. scientists has continued as part of the “Biological Threat Reduction Program.” Russia has continued to hammer the idea that this is a bioweapons program, not an effort to halt the spread of disease and safely close down old labs.",
    "And the claim about ‘pedophile rings’ is unsubstantiated.”\nHowever, what’s genuinely disturbing is the extent to which these Russian propaganda efforts are moving Republicans to side with Putin, in the middle of a bloody war, against their own nation.",
    "@WRAL has the video: https://t.co/9zx73FP5Il\n— David Gura (@davidgura) March 10, 2022\nThursday, Mar 10, 2022 · 9:50:40 AM Pacific Standard Time · Mark Sumner\nOne of the most hideous acts in a war that, despite its brevity, is already full of horrors.",
    "QAnon is actually casting the whole war as a joint effort between BFFs Donald Trump and Vladimir Putin to smash bioweapons labs and pedophile rings, some of which are operating—and this claim has actually been made—at Joe Biden’s Black Sea villa.",
    "x\nMeanwhile, in Chernihiv region, the Russian military has abandoned 10 fully operational tanks, an SAM unit, and a medevac vehicle following a contact with the Ukrainian military on March 10. https://t.co/ona1RYvHwr\n— Illia Ponomarenko ????",
    "To create that story, Putin leaned on the existence of right-wing nationalist parties, particularly in the southeastern section of Ukraine, even though those parties enjoy far less support than similar parties in every other European nation.",
    "pic.twitter.com/uQ5CItYpHm\n— Visegrád 24 (@visegrad24) March 10, 2022\nThursday, Mar 10, 2022 · 10:45:24 AM Pacific Standard Time · Mark Sumner\nCompared to the numbers cited on Oryx, or by U.S. officials, these numbers may seem high.",
    "That’s not unheard of, but there is one small detail…(THREAD) pic.twitter.com/6OsVGjPxQQ\n— Maria Pevchikh (@pevchikh) March 10, 2022\nThursday, Mar 10, 2022 · 9:41:15 AM Pacific Standard Time · Mark Sumner\n‘R’ is for Russia.",
    "Just this past week, Undersecretary of State Victoria Nuland warned that the Russian invasion threatened to damage both the old and new labs, and that there was concern about the potential exposures that could result.",
    "That story, in terms that sound all too familiar, is that Ukraine was harboring “weapons of mass destruction.” Specifically, that it was hosting bioweapons labs were the U.S. was cooking up a nasty attack on Russia.",
    "Thursday, Mar 10, 2022 · 9:37:25 AM Pacific Standard Time · Mark Sumner\nIf you want a good idea of why the list of sanction targets keeps expanding, and why it’s still far from enough, read this thread.",
    "It is “applicable to clinical, diagnostic, teaching, and moderate-risk agents that are present in the community.” If you live in a U.S. city, there are many labs with this designation near you.",
    "What is shocking is how many people in the U.S. are hurrying to help Putin sell a conspiracy theory that casts Russian invaders as the good guys and the American government as the villain.",
    "The way that both Greenwald and Massie are presenting this is deliberately skewed in a way that gives them the excuse to do what they wanted to do all along — support Vladimir Putin.",
    "Russian propaganda was all about reversing the direction of this action, claiming that the U.S. was actually expanding these programs, rather than shutting them down.",
    "It’s all part of casting Putin’s war—in which Russia is bombing maternity hospitals, leveling villages, and blasting missiles through kindergartens—as justifiable.",
    "On Thursday, at least two videos have emerged of Ukrainian forces operating outside Kyiv, possibly in the capture of a large group of vehicles reported earlier.",
    "Also, claiming that they are addressing a threat of WMDs, helps Putin to justify using WMDs like the thermobaric TOS-1 system and potentially chemical weapons.",
    "That reality being a series of Soviet bioweapons research labs, left behind in Ukraine, which the U.S. agreed to help clean up all the way back in 1993.",
    "Since this isn’t a fixed position, and the action here appears to be some hours past, hopefully nothing in this video endangers forces on the ground.",
    "Before the invasion of Crimea in 2014, Russian propaganda artists had sketched out another justification for destroying a neighboring nation.",
    "(@IAPonomarenko) March 10, 2022\nThursday, Mar 10, 2022 · 10:22:29 AM Pacific Standard Time · Mark Sumner\nThese images are like a gut-punch.",
    "— The Kyiv Independent (@KyivIndependent) March 10, 2022\nDaily Kos readers have now raised over $1.4 million to help Ukrainian refugees.",
    "?Ukraine's Security Service: Russia considers blowing up ammonia warehouses in Kharkiv Oblast and blaming it on Ukraine’s armed forces.",
    "\"Remember that the Ukrainian government is incredibly corrupt and is incredibly evil and has been pushing woke ideologies,\" he said.",
    "Russia is making whole cities disappear — along with the lives of those who made those cities into vibrant, unique communities.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "x\nThere’s so much propaganda on both sides that I didn’t take the concern over Ukrainian biological labs seriously… until now.",
    "x\nBefore and after in Mariupol — graphic illustrations of how Russian forces are demolishing civilian buildings in Ukraine.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "However, no matter how it seems, not every vehicle or aircraft destroyed in this war becomes the subject of a video.",
    "Thursday, Mar 10, 2022 · 11:49:06 AM Pacific Standard Time · Barbara Morrill\nContinuing coverage can be found here.",
    "Under this program, the U.S. helped Ukraine construct two Biosafety Level 2 labs, one in Kyiv, the other in Odessa.",
    "She lives in a huge apartment in Kensington and loves to party, her instagram feed looks like a non-stop holiday.",
    "“The idea is to weaken the civilians to make those living under the opposition areas feel life is hell,” he said.",
    "The truth almost certainly lies somewhere between these figures and the documented values at sites like Oryx.",
    "But Russia is once again pressing the idea that these labs, including the older Soviet facilities, are “U.S.",
    "Thursday, Mar 10, 2022 · 10:28:29 AM Pacific Standard Time · Mark Sumner\nA Pantsir anti-aircraft battery.",
    "They are deliberately trying to create as much physical discomfort and emotional pain as they can manage.",
    "There were just three votes against that resolution of support: Massie, Paul Gosar, and Matt Rosendale.",
    "x\nThese are the estimates of Russia's losses as of March 10, according to the Armed Forces of Ukraine.",
    "x\nIn a speech to supporters, Rep. Madison Cawthorn (R-NC) called President Zelenskyy \"a thug.\"",
    "x\nMy latest dispatch from Ukraine, reporting from Irpin’s bridge of death for @newlinesmag.",
    "Just like the Nazi claim, Putin was able to hook this ludicrous charge onto something real.",
    "None of this, considering Russia’s demonstrably monstrous actions, should be surprising.",
    "A Biosafety 2 lab is at the same level as labs used in many universities and hospitals.",
    "Massie, by the way, voted against a House resolution to support the people of Ukraine.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Part of the story he’s been selling is that Ukraine is, improbably, run by Nazis.",
    "But these claims are also bogus, and part of disinformation efforts by Russians.",
    "funded bioweapons labs” that it is trying to eliminate during the invasion.",
    "These are nothing like the labs associated with actual bioweapons research.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "This is a serious admission, under oath, from a person who would know.",
    "Russia’s targeting of civilians isn’t just deliberate, it’s tactical.",
    "That wasn’t the only reason Putin gave for rolling over the border.",
    "Claims about nefarious biolabs in Ukraine — some supposedly ‘U.S.",
    "owned’ — have permeated social media since the Russian invasion.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Polina is a 26-year-old glamorous Russian girl from London????.",
    "Hopefully Ukraine can put this capture right back on the line.",
    "This is a systematic approach that Russia has used before.",
    "Actual combat seems like the last thing on their agenda.",
    "As CNN reports, QAnon has been on this theme for weeks.",
    "x\nUkrainian forces ambush Russian soldiers near Kyiv.",
    "x\nThe Russians have done this before—in Syria.",
    "x\nI would like you to meet Polina Kovaleva.",
    "This is a short blurb about Daily Kos.",
    "?-?1 pic.twitter.com/izfpQMwr5p\n— ???",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Help keep that support going.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "There was no secret here.",
    "Daily Kos is different.",
    "Which makes it worse.",
    "‘R’ is for Russia.",
    "No hidden agenda.",
    "???????-?????????",
    "Donate $5 monthly",
    ": ??????????????",
    "Please read it.",
    "???????????",
    "??????????",
    "«????????",
    "?» ??????",
    "????????",
    "????????",
    "x\n??????",
    "???????",
    "???????",
    "??????",
    "?, ??",
    "????",
    "????",
    "????",
    "x\n?",
    "??"
  ]
}