{
  "id": 10816,
  "mediaId": 2547,
  "date": "2022-03-18",
  "headline": "Idaho Lt Gov Backtracks: Was Glad To Speak To Racist Conference",
  "image": "https://crooksandliars.com/files/mediaposters/2022/03/49780.jpg",
  "link": "https://crooksandliars.com/2022/03/idaho-lt-gov-backtracks-was-glad-speak",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Frances Langum",
  "authorUrl": "https://crooksandliars.com/team/frances-langum",
  "termIds": [
    2443,
    2994,
    3596,
    4039,
    5039,
    1036,
    6238
  ],
  "sentences": [
    "And in the interview, she blabs and blabs about her deep abiding connection to all things Trump, and drops this nugget (as noted by Right Wing Watch):\nYes, I did know who I was talking to\" when she addressed the white nationalist AFPAC conference and she stands by it: \"I'm not going to back off from the opportunity to talk to other conservatives ... about America First policies.\"",
    "I'm guessing Janice wants to have it all -- a freakout to the \"mainstream\" that anyone would suggest her sending a video to AFPAC means she is in agreement with racism, and another private winky=winky to the Idaho White Nationalist Republican base (via a three-subscriber YouTuber) that she's completely cool with it.",
    "Today Right Wing Watch unearthed a video interview with McGeachin on mainstream media, oh wait, it's with something called \"Valiant News,\" which has a YouTube channel started in February and now has three whole subscribers and a spinning helmet logo that looks vaguely Aryan.",
    "Idaho Lieutenant Governor Janice McGeachin made news earlier this week when she had a disastrous interview with an actual reporter, Brian Holmes, in which she denied responsibility for sending a video speech to Nick Fuentes's white nationalist conference.",
    "She goes on to say that an immigrant from the Philippines who is married to a Jewish man, Michelle Malkin, invited her to the conference, implying how can it be racist?",
    "This being the same conference Marjorie Taylor Greene and Paul Gosar attended.",
    "Chuthlu forbid she should alienate the Nazi Youth brigade!",
    "(It totally can and is, Janice.)",
    "The medium is NOT the message?",
    "Sorry Janice, it totally is.",
    "Topics:"
  ]
}