{
  "id": 10918,
  "mediaId": 8439,
  "date": "2022-03-12",
  "headline": "Hate groups declined in 2021, but fringe ideology is a 'powerful force' shaping US politics, SPLC warns",
  "image": "https://www.gannett-cdn.com/presto/2021/06/20/USAT/ccbebd70-0c8a-4a6a-a38f-af8775e6c02c-GTY_1320067198.jpg?crop=2999,1687,x0,y152&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/nation/2022/03/09/splc-hate-group-2021-declines-fringe-ideology-mainstream/9422517002/",
  "mediaOutlet": "Southwest Valley Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "N'dea Yancey-Bragg",
  "authorUrl": "https://www.usatoday.com/staff/2646700001/ndea-yancey-bragg/",
  "termIds": [
    3514,
    2443,
    1708,
    1093,
    5949
  ],
  "sentences": [
    "The report outlines how right-wing figures like Fox News personality Tucker Carlson and elected officials like U.S. Rep. Matt Gaetz, R-Fla., have promoted white supremacist conspiracy theories like the \"great replacement\" myth, while others – including former President Donald Trump and Republican U.S. Reps. Paul Gosar of Arizona and Madison Cawthorn of North Carolina – have normalized threats and the use of violence as a political tool.",
    "The nonprofit defines hate and antigovernment groups as:\n\"Hate groups vilify others based on such immutable characteristics as race, religion and gender identity, while groups in the antigovernment movement believe that the federal government is tyrannical, and traffic in conspiracy theories that often malign the same marginalized communities that hate groups target.\"",
    "The law center also said the decline in anti-government groups does not indicate a decrease in the popularity of their ideology, noting that anti-government extremists have continued to organize against issues including the belief critical race theory is being taught in public schools, and that vaccine and masks mandates are designed to stop the spread of COVID-19.",
    "Among them, the group urged the federal government to:\ncontinue to enforce current laws that prohibit private militias and political violence;\nenact the Domestic Terrorism Prevention Act to investigate and prosecute cases involving extremism;\nand continue to investigate and prosecute those who participated in the attack on the Capitol.",
    "\"When you combine that with this hard-right effort to silence conversations about racism in our schools and other public places, you create an atmosphere where anti-Black, anti-immigrant and ethno-nationalist policies could really further take root,\" said Cassie Miller, a senior research analyst at the SPLC, on Wednesday.",
    "In the year after the U.S. Capitol attack, the number of active hate groups in the United States has continued to decline, but the popularity of extremist ideas that fueled the insurrection still poses a threat to democracy, according to an annual report from the Southern Poverty Law Center released Wednesday.",
    "Although extremist ideas are gaining more acceptance among politicians, white-power groups are facing pressure from federal law enforcement's renewed focus on domestic extremism and civil lawsuits such as the high-profile suit over the deadly 2017 white supremacist rally in Charlottesville, Virginia.",
    "The findings echo the results of two recent studies from the Anti-Defamation League and voting rights organization Public Wise, which found candidates running for office and sitting politicians are increasingly embracing extremist talking points and expressed support for conspiracy theories.",
    "The law center, based in Montgomery, Alabama, acknowledged that the federal government, law enforcement and intelligence agencies have begun to shift their focus to domestic white supremacist extremism and offered several recommendations on how officials can continue to address the threat.",
    "The decline does not indicate the far right's power is waning, but rather suggests that extremist ideas have moved from fringe groups to the political mainstream, and hate groups have been impacted by the fallout and prosecutions stemming from the Capitol insurrection, the report said.",
    "In addition to mainstream channels, the report found some extremists have gravitated toward livestreaming on \"alt-tech\" platforms to raise money and spread their message after being de-platformed on sites such as YouTube and streaming services such as Twitch.",
    "Miller said the group is facing \"immense legal pressure\" that would typically cause a group to crumble, but the Proud Boys have been able to thrive by latching on to \"moral panics\" about mask and COVID-19 vaccine mandates and school curriculums.",
    "The mainstream movement is in part a response to the nationwide racial justice protests in the summer of 2020, a pattern that has played out historically many times during moments of social change, the SPLC said.",
    "\"The Proud Boys really latched on to those ideas and used it to launch themselves into more mainstream spaces ... that allows them to build alliances and makes them more of a danger than they already are.\"",
    "As the Biden administration implements policy shifts, anti-government groups could grow, the report said, noting that such activity has historically increased during liberal administrations.",
    "As a result, leaders in the white-power movement encouraged their members to maintain anonymity and avoid joining public facing groups, causing the number of neo-Nazi groups to fall to 54.",
    "Meanwhile, antigovernment groups like the Oath Keepers have also had to reorganize and disperse because of increased public scrutiny following the attack on the Capitol, the report says.",
    "The report repeatedly called on lawmakers to implement stronger voting rights protections to prevent the far right from gaining more political power, saying democracy is \"under threat.\"",
    "\"The country needs to address the threat of extremism as a social problem, which requires investment in social programs and public health-inspired prevention measures,\" the report said.",
    "2020 SPLC REPORT:Hate groups declined in 2020 from 2018's record high, but amount of hate hasn't\nMeanwhile, some extremist groups were able to grow through local-level organizing.",
    "The law center, which tracks racism, xenophobia, misogyny and anti-government militias, found 733 active hate groups operating in 2021 – down from the 838 identified last year.",
    "The report came one day after former national chairman of the Proud Boys Henry \"Enrique\" Tarrio was arrested and charged with conspiracy in the Jan. 6 insurrection.",
    "\"We need to use every instance where there is hate or violence, we use those opportunities to further our solidarity, our support and showing up for each other.\"",
    "\"Local communities across the U.S. are just feeling the weight of harassment, intimidation and even violence,\" said senior research analyst Rachel Carroll Rivas.",
    "Contributing: Will Carless, USA TODAY\nContact Breaking News Reporter N'dea Yancey-Bragg at nyanceybra@gannett.com or follow her on Twitter @NdeaYanceyBragg",
    "The SPLC, a liberal advocacy group, has faced defamation lawsuits from organizations it has designated as hate groups, including the Proud Boys.",
    "The law center called on tech companies to create and enforce policies that prevent hate from spreading and making money on their platforms.",
    "The SPLC identified 72 chapters of the extremist group the Proud Boys last year, an \"alarming rise\" from the 43 found in 2020, Miller said.",
    "It's really up to us,\" said Aneelah Afzali, executive director of Muslim Association of Puget Sound - American Muslim Empowerment Network.",
    "\"Instead, they’ve coalesced into a political movement that is now one of the most powerful forces shaping politics in the United States.\"",
    "The SPLC also recommended funding education initiatives to prevent more Americans, particularly young people, from becoming radicalized.",
    "Despite that, the SPLC warned white nationalists could continue to mobilize and even commit violence during the 2022 midterm elections.",
    "But the report cautioned that traditional counterterrorism tools that rely on law enforcement are not enough to stop the movement.",
    "\"Despite all this legal pressure, 2021 was the most active year for the Proud Boys since they were formed in 2016,\" she said.",
    "\"The reactionary and racist beliefs that propelled a mob into the Capitol that day have not dissipated,\" the report said.",
    "'FRINGE IDEAS' ARE GOING MAINSTREAM IN US POLITICS:That's a danger to democracy, extremism experts say.",
    "The report urged the government to continue to prosecute those involved in the Jan. 6 Capitol attack.",
    "White power groups declined as they faced arrests and civil suits, but the Proud Boys chapters grew.",
    "The number of hate groups has been steadily declining since hitting a record high of 1,020 in 2018.",
    "Anti-government groups, which peaked a decade ago, also decreased to 488, 79 less than in 2020.",
    "\"We've seen particularly harsh activity directed at school boards and county health boards.\"",
    "The number of hate groups fell for the third year in a row, a report from the SPLC found.",
    "\"We can't rely on the president or Congress or the courts to save us.",
    "What can be done?",
    "."
  ]
}