{
  "id": 11028,
  "mediaId": 2512,
  "date": "2022-03-16",
  "headline": "'Partisan Derangement Syndrome': GOP group torches Trump supporters in scathing new ad set to air on Fox News",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29545021&width=1200&coordinates=0%2C0%2C0%2C36&height=600",
  "link": "https://www.alternet.org/2022/03/gop-group-torches-trump-supporters-in-scathing-new-announcement-set-to-air-on-fox-news/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meaghan Ellis",
  "authorUrl": "https://www.alternet.org/author/meaghanellis",
  "termIds": [
    2765,
    5225,
    4066,
    514,
    1126
  ],
  "sentences": [
    "But instead of the video focusing on an appeal to rescue animals from abusive environments, the latest ad is more of a mocking clip focused on Republican votes suffering from an illness described as “Partisan Derangement Syndrome.”\nAre you or is someone you love suffering from Partisan Derangement Syndrome?pic.twitter.com/WQLDc9RO9N\n— The Republican Accountability Project (@The Republican Accountability Project) 1647300888\nThe ad is reportedly scheduled to air for Washington, D.C. viewers next week during \"Fox & Friends\" - one of the former president's favorite Fox News broadcasts.",
    "“They know Trump’s lies about the 2020 election and actions on January 6 were wrong, but they lack the courage to take a stand and say they won’t support him.”\nThe latest ad is one of the Republican Accountability Project's many efforts criticizing Republican lawmakers like House Minority Leader Kevin McCarthy (R-Calif.) and Rep. Paul Gosar (R-Ariz.) for their continuous enabling of Trump.",
    "A Republican political group is preparing to run a public service announcement (PSA) calling out Republican voters who are well aware of the danger former President Donald Trump poses to the political party but still plan to vote for him if he receives the Republican nomination in 2024.",
    "“This ad shows the ridiculous lengths these Republicans will go to try to remain in Trump’s good graces,” Sarah Longwell, the organization’s executive director, said in a news release.",
    "According to HuffPost, the PSA is inspired by the old American Society for the Prevention of Cruelty to Animals (ASPCA) ads featuring Canadian singer, Sarah McLachlan.",
    "The ad, which is set to air on Fox News, was created by the Republican Accountability Project."
  ]
}