{
  "id": 11035,
  "mediaId": 2590,
  "date": "2022-03-09",
  "headline": "Kevin McCarthy Won't Punish Republicans Who Joined White Nationalist Conference",
  "image": "https://img.huffingtonpost.com/asset/6228f5f7240000c36096c537.jpeg?cache=uIj6nsmqrh&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/kevin-mccarthy-marjorie-taylor-greene_n_6228f0d3e4b004e4e389d027",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arthur Delaney",
  "authorUrl": "",
  "termIds": [
    2443,
    2187,
    3246,
    3049,
    4066,
    1126,
    6678,
    6026
  ],
  "sentences": [
    "Lawmakers voted to strip Greene of her committee assignments for her embrace of racist and antisemitic conspiracy theories, as well as for “liking” Facebook posts about executing prominent Democrats\nAdvertisement\nThe failure to punish Greene and Gosar stands in stark contrast to McCarthy’s past threats to strip committee assignments from Republicans who participated in the special committee investigating the Jan. 6 attack on the Capitol.",
    "It will be up to McCarthy whether Greene and Gosar can have committee assignments — one of the most fundamental aspects of a House member’s job — if Republicans win control in November’s midterm election and make McCarthy speaker.",
    "The far-right Republicans have already both been stripped of their seats on House committees for previous statements, and McCarthy said they would be able to regain committee roles in spite of their continued outrageous behavior.",
    "Reps. Marjorie Taylor Greene (R-Ga.) and Paul Gosar (R-Ariz.) won’t face punishment for participating in a white nationalist conference, House Republican leader Kevin McCarthy (R-Calif.) said Wednesday.",
    "McCarthy has gone from admitting that ex-president Donald Trump incited the riot to blaming the whole thing on House Speaker Nancy Pelosi (D-Calif.), who he said failed to secure the building.",
    "Placating Trump, and Trump-aligned lawmakers like Greene and Gosar, seems to be McCarthy’s strategy to keep the GOP’s hard-right wing from thwarting his bid for speaker.",
    "The House censured Gosar last year after he published a cartoon video showing himself as a heroic character who kills Rep. Alexandria Ocasio-Cortez (D-N.Y.).",
    "Advertisement\n“They have the ability to be able to get committees based upon that time when it comes,” McCarthy said at a news conference.",
    "The event’s organizer said America had forgotten “young, white men” and asked the crowd to cheer for Russian President Vladimir Putin.",
    "Greene spoke in person at the America First Political Action Conference last month and Gosar appeared via pre-recorded video.",
    "Greene then took the lectern to flatter attendees as “canceled Americans.”\nMcCarthy has called the conference appalling.",
    "It will never be tolerated.”\nMcCarthy said he met with Greene and “she will not go again” to that group’s events.",
    "Advertisement\n“There’s no place for what has gone on with that organization,” he said Wednesday.",
    "“I passed phone calls with Gosar last night, unfortunately,” McCarthy said at the time.",
    "Last week, McCarthy told HuffPost that he and Gosar had engaged in phone tag.",
    "Republicans have strong odds of retaking the chamber.",
    "He said he hadn’t yet spoken to Gosar.",
    "“There never will be in this party.",
    "Here’s hoping the two can connect!"
  ]
}