{
  "id": 11305,
  "mediaId": 4018,
  "date": "2022-03-14",
  "headline": "In rare show of unity, all 25 Jewish House Democrats blast Amnesty director’s comments on Israel",
  "image": "https://www.jta.org/wp-content/uploads/2022/03/03-14-2022-Nadler-Schakowsky.jpg",
  "link": "https://www.jta.org/2022/03/14/politics/in-rare-show-of-unity-all-25-jewish-house-democrats-blast-amnesty-directors-comments-on-israel",
  "mediaOutlet": "jta.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ron Kampeas",
  "authorUrl": "https://www.jta.org/author/ron-kampeas",
  "termIds": [
    0
  ],
  "sentences": [
    "WASHINGTON (JTA) — All 25 Jewish Democrats in the House, a fractious caucus that rarely unanimously agrees on issues of Jewish interest, signed onto a statement slamming recent comments by Amnesty International’s U.S. director, who said he believes polls showing overwhelming U.S. Jewish support for Israel are inaccurate.",
    "Luria and Rep. Josh Gottheimer last week spearheaded a letter saying they would likely oppose any bid by the Biden administration to reenter the Iran nuclear deal, while Reps. John Yarmuth of Kentucky and Alan Lowenthal of California have decried former President Donald Trump’s withdrawal from the deal as catastrophic.",
    "“I believe my gut tells me that what Jewish people in this country want is to know that there’s a sanctuary that is a safe and sustainable place that the Jews, the Jewish people can call home,” he said, a status short of a Jewish state, which O’Brien had said in the same address Amnesty rejected.",
    "Someone at the event, at the Women’s National Democratic Club in Washington D.C., asked him about a 2020 Ruderman Family Foundation poll that showed eight in 10 American Jews identify as “pro-Israel.” The poll is commensurate with findings of multiple polls over the years.",
    "A staffer involved in shaping the statement, requesting anonymity to speak freely, said the feeling was that each side should take care of offenses on its own side, and statements by a liberal group like Amnesty International would be on the Democratic side of the ledger.",
    "For example, Reps. Elaine Luria of Virginia and Dean Phillips of Minnesota have condemned comments by fellow caucus member, Ilhan Omar, as antisemitic, while Rep. Jan Schakowsky of Illinois has joined with Omar to combat antisemitism.",
    "Jewish staffers on Capitol Hill who watched as the Amnesty statement accrued the names of every Jewish member told the Jewish Telegraphic Agency said they were amazed to see the members overcome differences large and small.",
    "However, we are in full agreement that Mr. [Paul] O’Brien’s patronizing attempt to speak on behalf of the American Jewish community is alarming and deeply offensive,” the statement released on Monday reads.",
    "The staffer said Republicans should work to isolate and condemn those in their party who make statements offensive to Jews, singling out Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona.",
    "“We are opposed to the idea — and this, I think, is an existential part of the debate — that Israel should be preserved as a state for the Jewish people,” O’Brien had said earlier in his comments.",
    "Last week, in an address first reported by Jewish Insider, Paul O’Brien defended Amnesty’s recent report designating Israel as an “apartheid” state.",
    "The only Jewish members of the House missing from the statement were its two Republicans, David Kustoff of Tennessee and Lee Zeldin of New York.",
    "O’Brien tweeted Friday that his remarks were removed from context, although he did not dispute the contents of the quote.",
    "“As Jewish Members of the House of Representatives, we represent diverse views on a number of issues relating to Israel.",
    "Republicans have condemned remarks by Gosar and Greene and others but have resisted imposing penalties on them.",
    "“We’re trying to set an example for our Jewish Republican colleagues,” the staffer said.",
    "Such unanimity is rare among Jewish Democrats, especially on issues of Jewish import.",
    "“I did not and Amnesty takes no position on the legitimacy of any state,” he said.",
    "Spokesmen for each said they were not approached to sign onto it."
  ]
}