{
  "id": 1238,
  "mediaId": 2699,
  "date": "2022-02-16",
  "headline": "Arizona Politician Promotes Far-Right Event Featuring Hanukkah-Basher",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1644998869/210215-wendy-rogers-tease-01_m730dp",
  "link": "https://www.thedailybeast.com/arizona-state-senator-wendy-rogers-promotes-far-right-event-featuring-hanukkah-basher-baked-alaska?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelly Weill",
  "authorUrl": "https://www.thedailybeast.com/author/kelly-weill",
  "termIds": [
    2443,
    2589,
    4039,
    340,
    100,
    5949,
    6488
  ],
  "sentences": [
    "Rogers announced her membership to the group several years ago and gave a speech for members in March 2021, while Gosar allegedly told an Arizona Oath Keepers leader that the U.S. was already in a civil war, “we just haven’t started shooting yet.”\nBut their friendliness with Fuentes and his “America First” movement signals an effort to ingratiate themselves with a younger generation of racists—an effort both cringe-worthy and at times downright dangerous for the Arizona politicians’ constituents.",
    "In a speech for Arizona State University’s College Republicans United last year, Foxx made a white supremacist appeal, bashing Democrats for “anti-white rhetoric” and asking why “white supremacist was an offensive term.”\nAFPAC speaker Milo Yiannopoulos, who rose to fame on a career of racist and sexist internet commentary, has attempted to host events in Arizona but later bailed under dubious circumstances.",
    "Although Yiannopoulos claimed Scottsdale, Arizona police canceled his 2018 speech due to threats from the left, Scottsdale police denied those claims, noting that they hadn’t even heard of the event until after Yiannopoulos pulled the plug.",
    "Gionet was already out on pretrial release for allegedly pepper-spraying a security guard at an Arizona bar, and weeks later would participate in the Jan. 6 break-in at the U.S. Capitol, for which he is also facing charges.",
    "Organized by white nationalist and “Unite The Right” attendee Nick Fuentes, the conference is a watering hole for people who think the Conservative Political Action Conference (also next week) needs to use more slurs.",
    "(“This is going to be the most racist, sexist, anti-Semitic, Holocaust-denying speech in all of Dallas this weekend,” Fuentes boasted of one of his upcoming speeches after he was kicked out of CPAC in 2021.)",
    "An event poster that Rogers shared last week, which features the conference’s lineup, includes two unnamed “mystery speakers.”\nThe post was far from Rogers’ first in support of Fuentes, an open bigot.",
    "Fuentes has returned the favor, using Rogers’ posts to hype AFPAC and even hinting that the state senator might be involved, researcher Arizona Right Wing Watch reported.",
    "Undeterred, Yiannopoulos fans began suggesting mass-murder of leftist foes, or clamoring for the far-right group the Proud Boys begin providing Yiannopoulos’s security.",
    "The association is unlikely to bother Rogers, who posted on Valentine’s Day that she would “rather hang out” with Confederate general Robert E. Lee than a communist.",
    "But the fringe conference is also playing footsie with elected officials, this year with Arizona State Senator Wendy Rogers, who promoted the event on Telegram.",
    "It’s the second year in a row that an Arizona politician has backed the conference, putting them in league with Gionet and other legally challenged extremists.",
    "In November, far-right internet personality Tim “Baked Alaska” Gionet was charged for allegedly defacing a Hanukkah display outside Arizona’s state capitol.",
    "Three months later, he’s a speaker at a conference that just received the endorsement of an Arizona state senator who works in that same building.",
    "The America First Political Action Conference, scheduled next week in Orlando, Florida, is an annual gathering of far-right and racist figures.",
    "This year’s AFPAC, which Rogers promoted, features a rogues’ gallery of fringe speakers, some of whom have specifically menaced Arizonans.",
    "Gosar, a 2020 election denialist who just this week retweeted a different white nationalist, later posed with Fuentes at a restaurant.",
    "Rogers’ office did not return The Daily Beast’s request for comment on whether the state senator intends to attend next week’s AFPAC.",
    "Earlier this month, after Rogers shared a Fuentes post about not wanting friends, Fuentes bragged on Telegram about the relationship.",
    "Both Gosar and Rogers have well-documented ties to the militant right, particularly the paramilitary group the Oath Keepers.",
    "One, Vincent James Foxx, is a former unofficial videographer for the white supremacist brawling group Rise Above Movement.",
    "(A Gosar spokesperson did not return a request for comment on whether Gosar would attend the conference this year.)",
    "In December 2020, Gionet allegedly defaced a Hanukkah display outside the Arizona capitol, where Rogers works.",
    "Rogers has authored at least two dozen fawning posts about Fuentes, according to Left Coast Right Watch.",
    "But she wouldn’t be the first Arizona politician to align with the far-right conference.",
    "“Wait until they see our AFPAC III lineup,” he wrote above a screenshot of Rogers’ post.",
    "Gionet, better known as Baked Alaska, is a longtime clout-chaser in neo-Nazi scenes.",
    "“No more ‘Happy Hanukkah,’ only ‘Merry Christmas,’” Gionet said on a livestream.",
    "Rogers’ involvement with AFPAC, outside her work as its hypewoman, is unclear.",
    "Last year, U.S. Rep Paul Gosar (R-AZ) delivered the event’s keynote address.",
    "The Proud Boys’ founder, Gavin McInnes is also a scheduled AFPAC speaker.",
    "Other speakers have caused their own fracas in the state."
  ]
}