{
  "id": 12495,
  "mediaId": 2550,
  "date": "2022-02-28",
  "headline": "Abbreviated Pundit Roundup: This is the dangerous part (Putin losing)",
  "image": "https://images.dailykos.com/images/1042443/story_image/GettyImages-1238674877.jpg?1645906538",
  "link": "https://www.dailykos.com/stories/2022/2/28/2082681/-Abbreviated-Pundit-Roundup-This-is-the-dangerous-part-Putin-losing?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2443,
    2576,
    2240,
    4591,
    4450,
    3838,
    2887,
    1126,
    6672,
    6569
  ],
  "sentences": [
    "Things are not going well for Mr. Putin, but the reverberations (including amongst MAGA supporters) is only beginning\nSunday Times:\nBitter, isolated — Putin may have lost the plot\nThe Russian president’s determination to defy all reason and wage war on Ukraine is raising doubt about his mental health\nMarco Rubio, a former presidential candidate whose position as vice-chairman of the US Senate’s select committee on intelligence gives him extensive access to secret information, cryptically tweeted: “I wish I could share more, but for now I can say it’s pretty obvious to many that something is off with Putin.",
    "x\nthe Trump agenda Barr salutes here is actually related to current events\nit included deriding NATO, embracing Putin, and squeezing Ukraine\nthose things, in turn, are related to the Mueller investigation Barr worked to discredit https://t.co/d1CyAYDOsG\n— John Harwood (@JohnJHarwood) February 27, 2022\nLinda Kinstler/WaPo:\nTo understand the Ukraine-Russia conflict, look to colonialism\nUkrainians have been fighting Russian imperialism for hundreds of years\n“You are being told that we are Nazis,” Zelensky said.",
    "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\nRUSI: [The Royal United Services Institute, UK think tank]:\nUkraine Through Russia’s Eyes\nThe Kremlin’s pre-invasion research suggested Ukraine was fertile ground for subversion, but the shock of war may transform Ukrainians’ willingness to resist in unpredictable ways.",
    "https://t.co/j66PkSiSLc\n— ProfTalmadge (@ProfTalmadge) February 27, 2022\nWSJ:\nGermany to Raise Defense Spending Above 2% of GDP in Response to Ukraine War\nDecision breaks with decades of lower investment in defense than peers and a growing energy partnership with Russia\n“We have to ask ourselves: What capacities does Putin’s Russia have?",
    "— John Sipher (@john_sipher) February 27, 2022\nAZ Mirror:\nWendy Rogers said white nationalists are ‘patriots’ and called for hanging political enemies\nLater in the evening, former Maricopa County Sheriff Joe Arpaio gave a rambling, 40-minute speech in which he seemingly didn’t realize he was speaking to a crowd of white nationalists.",
    "https://t.co/BFBvWzFC53\n— Andrew Bates (@AndrewJBates46) February 28, 2022\nNY Times:\nNew Research Points to Wuhan Market as Pandemic Origin\nScientists released a pair of extensive studies on Saturday that point to a market in Wuhan, China, as the origin of the coronavirus pandemic.",
    "It would be a mistake to assume this Putin would react the same way he would have five years ago.”\nx\nIt's beyond ironic that Russia's supposed effort to create a neutral buffer zone against foreign attack through Ukraine is now prompting huge increases in GERMAN defense spending.",
    "“It’s clear, we will need to invest a lot more in the security of our country to defend our freedom and our democracy.”\n“Putin wants to establish a Russian empire…the question is…whether we can summon the strength to set boundaries to warmongers like Putin,” Mr. Scholz said.",
    "The Ukrainian Army, both regular and reserve, was highly trusted, with 68% of the population supportive, as were military veterans, while regional and municipal governments were comparatively well-trusted with over 40% of the population having a favourable opinion of them.",
    "Analyzing data from a variety of sources, they concluded that the coronavirus was very likely present in live mammals sold in the Huanan Seafood Wholesale Market in late 2019 and suggested that the virus twice spilled over into people working or shopping there.",
    "Countries cut off from SWIFT, as Iran was in 2012, are effectively cast back into the precomputer era—forced to rely on primitive barter transactions, or Breaking Bad–style pallets of physical cash, to fund their governments and their economies.",
    "According to the polling data, Ukrainians in early February were, by and large, pessimistic about the future and apathetic about politics, and did not trust politicians, political parties or the majority of Ukraine’s domestic institutions.",
    "Well, I’m not.”\nLater, when he repeated that he was called “the biggest racist in the country” and received loud applause, he quickly added, “I have a black grandkid, I got a Mexican grandkid,” prompting some in the crowd to boo him.",
    "“Everyone said, ‘What are you using this for?’ I said, ‘To shoot people that come across the border,’” he said, eliciting raucous cheers from the crowd that left Arpaio visibly surprised.",
    "Caveats: Not all White Evangelical Christians embrace Putin nor support Russia’s invasion of Ukraine; veneration of Putin not necessarily based on facts and includes many contradictions.",
    "I’m saying the illegals that are terrorists and other violent (criminals), if they’re going to start shooting at my people, I’m going to fire back,” he explained, to much fewer cheers.",
    "— Michael Cohen (@speechboy71) February 27, 2022\nSummary from RH Fontaine/Twitter:\nSince the invasion began, the scale and rapidity of geopolitical shifts have been astonishing.",
    "x\nAs Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "President Volodymyr Zelenskiy had poor approval ratings at -34, but a high proportion of Ukrainians polled still professed that they would vote for him over other candidates.",
    "Zelensky’s grandfather served in the Soviet infantry; my grandfather, born and raised outside Kyiv, spent the war running radio cables between the front line and Moscow.",
    "x\nFor all the people saying Putin has undermined the international order … the international order is demonstrating the very real downsides of trying to undermine it.",
    "SWIFT is a messaging technology based in Belgium that allows banks to talk to one another in secure ways, enabling the safe and sure electronic transmission of funds.",
    "He underscored that though Russians and Ukrainians may share kin and culture, that does not mean their relationship can forever be that of colonizer and colonized.",
    "(1)\nThe world’s major economies, save China, have combined to foment a financial crisis in Russia, casting aside the previous worries about systemic economic risk.",
    "Already:\nRussia has moved from a sullen, revisionist state to a clear and present danger to its neighbors, and has directly threatened countries beyond Ukraine.",
    "And when it came to willingness to serve in the military or otherwise resist a foreign invasion, 40% of respondents stated that they would not defend Ukraine.",
    "Central-bank sanctions are a weapon so devastating, in fact, that the only question is whether they might do more damage than Western governments might wish.",
    "However, other institutions enjoyed approval figures that ranged from mediocre to poor, including the police at 28% and domestic security services at 23%.",
    "x\nYou have to give Trump credit for trying to build a bridge between the Putin wing of the GOP and the Hitler wing of the GOP in his CPAC speech today.",
    "@playbookdc: \"It was Biden and his team’s patience and close consultation with European allies that has led to the extraordinary unity now on display.\"",
    "And which capacities do we need to counter his threats?” Mr. Scholz told parliament, gathered for an extraordinary session on Sunday.",
    "(3)\nFinland and Sweden are firmly aligned with the West and against Moscow, and the invasion may tip them into NATO membership.",
    "(2)\nGermany has moved from a pacifist laggard on defense spending to announcing a huge increase, moving ahead of 2% of GDP.",
    "Trust in the Rada – the Ukrainian parliament – and in political parties was abysmal, at 11% and 8% respectively.",
    "They said they found no support for an alternate theory that the coronavirus escaped from a laboratory in Wuhan.",
    "“I’m not about to shoot illegals who are coming across, just for coming illegally,” he finished, to no cheers.",
    "Zelensky’s address was both an appeal and a prayer, a clearheaded response to Russian justifications for war.",
    "Their main concerns were overwhelmingly inflation and the cost of living, with both perceived to be rising.",
    "They could potentially bankrupt the entire Russian banking system and push the ruble into worthlessness.",
    "— David Rothkopf (@djrothkopf) February 27, 2022\nDavid Frum/Atlantic:\nCan Putin Recover From This?",
    "Neighbors always enrich each other’s cultures, but that does not make them one entity,” he said.",
    "“I have the reputation of being the biggest racist in the country,” he said, to robust applause.",
    "— Teddy Wilson (@reportbywilson) February 27, 2022\nIf you don’t care for Twitter, read it here.",
    "Trust in the office of the president sat at 27%, with 67% distrustful of the presidency.",
    "At another point, Arpaio boasted about having a howitzer artillery gun while sheriff.",
    "x\nOur boy held up those much needed Javelins in an organized crime blackmail scheme.",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now.",
    "“He has always been a killer, but his problem now is different and significant.",
    "His voice was calm and forceful, but you could hear the anger behind his words.",
    "It is instead a way to guarantee that money moves where it is supposed to go.",
    "Full neutrality has become untenable given popular revulsion at the invasion.",
    "But 8 million Ukrainians died fighting with the Soviet army in World War II.",
    "?Why do White Evangelical Christians in the U.S. embrace Vladimir Putin?",
    "“We must put a stop to warmongers like Putin,” the new Chancellor says.",
    "That, in turn, may provoke domestic unrest with unknown implications.",
    "The Fed and the European Central Bank move hard, fast, and together.",
    "Russia is also being hit by a partial cut-off from the SWIFT system.",
    "At times, he seemed taken aback at the reaction to things he said.",
    "– will freeze Russian assets as a result of Moscow’s aggression.",
    "Governments have no trust in or tolerance for the Putin regime.",
    "“You are told that we hate Russian culture,” Zelensky said.",
    "Talk about causing the thing you've spent 77 years fearing.",
    "We want to build our own history, peaceful, calm and fair.",
    "SWIFT is not a bank, nor is it exactly a payments system.",
    "“What are you clapping for, that I am or that I’m not?",
    "“We are different, but that does not make us enemies.",
    "“That requires strength of our own.” A new Germany.",
    "I didn’t mean to shoot the illegals coming across.",
    "(4)\nNeutral Switzerland – Switzerland!",
    "“But how can you hate culture?",
    "(5) [see Reuters for update]",
    "It’s complicated.",
    "“Wait a minute.",
    "Any culture?",
    "I remember.",
    "x\n?",
    "x\n."
  ]
}