{
  "id": 12585,
  "mediaId": 2512,
  "date": "2022-03-07",
  "headline": "'I want them to shut up': Republicans angry Kevin McCarthy is impotent in dealing with GOP extremism",
  "image": "https://www.alternet.org/media-library/image.jpg?id=27078112&width=1200&coordinates=0%2C82%2C0%2C82&height=600",
  "link": "https://www.alternet.org/2022/03/kevin-mccarthy/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Evans",
  "authorUrl": "https://www.alternet.org/author/timothy_evans",
  "termIds": [
    4039,
    4066,
    4591,
    2443,
    2620,
    1126,
    6026,
    6672
  ],
  "sentences": [
    "“Dealing with dumb, stupid things people do in Congress should probably go down — and go pretty far down — on the list when you’ve got peacekeeping tanks rolling into a country that was not in conflict, when you’ve got record inflation, when you’ve got all of these things,” Armstrong said.",
    "One centrist Republican, who spoke about the flap on the condition of anonymity, observed that the GOP leader has few options with which to threaten Greene and Gosar because House Speaker Nancy Pelosi and Democrats have “fired all our shots” by stripping their panel assignments.",
    "He recently promised that he's going to have a talk with Reps. Marjorie Taylor Greene (R-GA.) and and Paul Gosar (R-AZ) about their \"appalling\" decision to speak at a conference organized by a far-right fringe figure and self-proclaimed white nationalist Nick Fuentes.",
    "Kevin McCarthy of California speaking at the 2016 Republican National Convention, Wikimedia Commons\nHouse Minority Leader Kevin McCarthy (R-CA) says many things, mostly because he desperately wants to become Speaker of the House.",
    "It's not clear exactly what McCarthy plans to say to Greene and Gosar or when, but as Politico reports he might be postponing \"the talk\" because there's really nothing he can do to control their behavior.",
    "Greene smiled and waved to the crowd right after Fuentes asked for a “round of applause for Russia” as Vladimir Putin rained down missiles and mortars on Ukraine.",
    "The two already have been stripped of committee assignments and any move to censure the pair only would draw attention to the far right faction of the GOP.",
    "One House Republican, Rep. Kelly Armstrong (R-N.D.), says the wanna-be speaker should focus on issues much more important than Greene and Gosar.",
    "Rep. Kevin McCarthy of California speaking at the 2016 Republican National ConventionRep.",
    "What else can Kevin do officially through the conference?”",
    "Just stop it,” this Republican said.",
    "“[But] there’s nothing else.",
    "“I want them to shut up."
  ]
}