{
  "id": 12594,
  "mediaId": 2621,
  "date": "2022-03-03",
  "headline": "Nearly 13,000 Christians Sign Petition Calling on the RNC to Censure Reps. Greene and Gosar For Addressing White Nationalist Group",
  "image": "https://www.mediaite.com/wp-content/uploads/2021/11/GettyImages-1329768515-scaled-e1640649439262.jpg",
  "link": "https://www.mediaite.com/politics/nearly-13000-christians-sign-petition-calling-on-the-rnc-to-censure-reps-greene-and-gosar-for-addressing-white-nationalist-group/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Griffing",
  "authorUrl": "https://www.mediaite.com/author/alex-griffing/",
  "termIds": [
    3896,
    4039,
    2443,
    2187,
    1126,
    1125,
    883,
    99
  ],
  "sentences": [
    "The group also details their objection to Greene’s remarks about her speech to the conference:\nFollowing Friday’s neo-Nazi event, Greene defended her remarks by invoking her Christian faith, claiming she was following Jesus’s example and tweeting that the point of the racist gathering was to ‘declare that Christ is king,’ Greene also attacked her critics as ‘godless’ and promised to keep focusing ‘on proudly proclaiming the greatness of our God’\n“We are especially outraged by Greene’s attempts on Twitter to hijack Jesus’s name for politics, blasphemously twisting our faith into an excuse for propping up racist authoritarians,” added the petition, which was first posted on Monday.",
    "The petition, from a group called Faithful America, is addressed to “RNC Chair Ronna McDaniel” and says “As grassroots Christians from across the country, we call on the RNC to censure Representatives Marjorie Taylor Green and Paul Gosar for taking part in the explicitly white nationalist America First Political Action Conference.”\nMcDaniel did issue a statement over the weekend condemning “white supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.”\nBoth Greene and Gosar have been roundly condemned for addressing the conference hosted by white nationalist and Holocaust-denier Nick Fuentes.",
    "A Christian group’s online petition calling for the Republican National Committee to censure Reps. Marjorie Taylor Greene (R-GA) and Paul Gosar (R-AZ) for addressing a white nationalist convention over the weekend has gained almost 13,000 signatures by Thursday evening.",
    "Our members — Catholic, Protestant, and more — are sick of sitting by quietly while Jesus’ message of good news is hijacked by the religious right to serve a hateful political agenda.”\nHave a tip we should know?",
    "The group also called out the RNC for censuring Reps. Adam Kinzinger (R-IL) and Liz Cheney (R-WY) for participation on the Jan. 6 committee, but not addressing Greene and Gosar.",
    "According to their website, Faithful America is “the largest online community of Christians putting faith into action for social justice.",
    "tips@mediaite.com"
  ]
}