{
  "id": 12616,
  "mediaId": 2551,
  "date": "2022-02-28",
  "headline": "'Have you lost all sense of decency?' Liz Cheney shames Kevin McCarthy for not chastising Marjorie Taylor Greene for speaking at white nationalist event",
  "image": "https://i.dailymail.co.uk/1s/2022/02/28/16/54762299-0-image-a-4_1646065254890.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10560931/Liz-Cheney-shames-Kevin-McCarthy-not-chastising-Marjorie-Taylor-Greene.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Goodin",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Emily+Goodin,+Senior+U.S.+Political+Reporter",
  "termIds": [
    5891,
    2443,
    2638,
    2187,
    3596,
    3896,
    4039,
    2887,
    4066,
    1125,
    1126
  ],
  "sentences": [
    "Fuentes has been described as a white supremacist by the Anti-Defamation League and was permanently banned from YouTube for making anti-Semitic remarks\n+9\nView gallery\nWhen one of the CBS reporters informed Greene that Fuentes was a white nationalist, she said she didn't support that view and repeated that she knows nothing about Fuentes\nFuentes, who has been described as a white supremacist by the Anti-Defamation League, founded AFPAC in 2020 to rival the popular Conservative Political Action Conference, which also held it's annual conference on Saturday.",
    "+9\nView gallery\nUS Rep. Marjorie Taylor Greene (center) denied knowing white nationalist Nick Fuentes (right) despite taking a picture together with him and right-wing pundit Michelle Malkin during his America First Political Action Conference in Orlando on Friday\n+9\nView gallery\nGreene came out as a special guest at Fuentes' AFPAC event to talk about 'god and liberty.'",
    "+9\nView gallery\nGreene defended her appearance at AFPAC and said she is not guilty by association for speaking at Fuentes' event\nThe Republican Jewish Coalition has condemned Greene 'in the strongest possible terms' for attending the event with 'Nazi-sympathizer Nick Fuentes.'",
    "Greene appeared as a surprise guest at the America First Political Action Conference in Orlando, an event organized by Nick Fuentes, a white nationalist who was permanently suspended from YouTube for anti-Semitic hate speech in 2020.",
    "Cheney, a Republican from Wyoming, is one of several Republicans who have criticized Greene for speaking at an event hosted by a far-right activist, but Greene defended her appearance and said she doesn't support white nationalism.",
    "'It is appalling and outrageous that a Member of Congress would share a platform with an individual who has actively spread antisemtic bile, mocked the Holocaust, and promoted dangerous anti-Israel conspiracy theories.'",
    "After speaking at the event, Greene posed in a photo with Fuentes and right-wing pundit Michelle Malkin, but when questioned about her appearance at AFPAC and relationship with Fuentes, Greene denied she knew him.",
    "+9\nView gallery\nLiz Cheney slammed House GOP leadership for not chastising Marjorie Taylor Greene for speaking at a white nationalist event\n+9\nView gallery\nOther Republicans have spoken out against her appearance.",
    "She went on to explain that she appeared at Fuentes' AFPAC event in to talk about 'god and liberty' and reach out to his young followers because 'it's a generation I'm extremely concerned about.'",
    "'I'm also not going to turn down the opportunity to speak to 1,200 young America First patriots because of a few off-color remarks by another speaker, even if I find those remarks unsavory.'",
    "And Republican National Committee Chairwoman Ronna McDaniel said that 'white supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.'",
    "'House GOP Leaders: Have you lost all sense of decency?,' Cheney wrote on Twitter Sunday evening after Greene posted video of her speech to her official Congressional Twitter account.",
    "'I am not going to play the guilt by association game in which you demand every conservative should justify anything ever said by anyone they've ever shared a room with,' she said.",
    "Liz Cheney slammed Kevin McCarthy and other members of House GOP leadership for not chastising Marjorie Taylor Greene for speaking at a white nationalist event.",
    "She is pictured speaking at Conservative Political Action Conference on Saturday\n+9\nView gallery\nNick Fuentes, (above) founded AFPAC in 2020 to rival CPAC.",
    "'Anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points,' the senator told CNN on Sunday.",
    "'Marjorie Taylor Greene now using her official USG congressional account to promote anti-Semitic, white supremacist, pro-Hitler, pro-Putin conference.",
    "The two are pictured together at Friday's event\n+9\nView gallery\nGreene defended her appearance at AFPAC and denied any involvement with Fuentes.",
    "Republican Sen. Mitt Romney slammed both Greene and Republican Rep. Paul Gosar of Arizona, who sent pre-taped remarks to the conference.",
    "The Democratic-controlled House took away her committee assignments after she spread information from conspiracy theories.",
    "He gained infamy for making many anti-Semitic comments, denying the Holocaust happened and opposing women's right to vote.",
    "'I do not know what his views are so I am not aligned with anything that is controversial.'",
    "On Twitter, Greene said that she is not responsible for Fuentes views, only for her own.",
    "Cheney has been an outspoken critic of members of her party that she disagrees with.",
    "'I have never heard him speak, I have never seen a video [of him].",
    "Greene has repeatedly clashed with other members of her party.",
    "'I do not know Nick Fuentes,' Greene told CBS on Saturday.",
    "This is a toxin in the bloodstream of America.",
    "'Morons,' Romney called them.",
    "It must stop,' Cheney said."
  ]
}