{
  "id": 12668,
  "mediaId": 2540,
  "date": "2022-02-27",
  "headline": "'I've got morons on my team': Romney blasts fellow GOP members for attending White nationalist event and supporting Putin",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220227160527-mitt-romney-file-2021-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/27/politics/mitt-romney-gop-ukraine-russia/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chandelis Duster",
  "authorUrl": "https://www.cnn.com/profiles/chandelis-duster",
  "termIds": [
    2443,
    5037,
    5583,
    5423,
    4591,
    4039,
    1126,
    5949
  ],
  "sentences": [
    "The comment from Romney follows criticism from Wyoming Rep. Liz Cheney, a Republican, of Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona for speaking at the America First Political Action Conference that took place in Orlando, Florida and was organized by White nationalist Nick Fuentes.",
    "Greene defended her appearance at the event in a statement and told reporters at the Conservative Political Action Conference on Saturday that she doesn't know Fuentes, or about his views, and condemned Putin and his invasion of Ukraine.",
    "\"(Rep.) Marjorie Taylor Greene and (Rep.) Paul Gosar, I don't know them, but I'm reminded of that old line from the 'Butch Cassidy and the Sundance Kid' movie where - where one character says, 'Morons, I've got morons on my team.'",
    "(CNN)Republican Sen. Mitt Romney of Utah on Sunday blasted his fellow GOP members who attended a White nationalist event and those who support Russia President Vladimir Putin as the country invades Ukraine.",
    "Fuentes, who has been labeled a White supremacist by the US Department of Justice and the Anti-Defamation League, has been banned from most major social media platforms for his White nationalist rhetoric.",
    "\"As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Cheney tweeted Saturday.",
    "\"But, of course, they do it because if they get shock value and it's good to get the more eyeballs and maybe make a little more money for them or their network.",
    "And I have to think anybody that would sit down with White nationalists and speak at their conference was certainly missing a few IQ points.\"",
    "1 geopolitical foe,\" called for more sanctions against Russia and said Putin \"has been an adversary of America at every chance he's had.\"",
    "Last week, Fuentes wrote on the messaging app Telegram, \"I am totally rooting for Russia,\" while also referring to Putin as \"my Czar.\"",
    "Greene spoke at the event in person and Gosar, who attended the same conference last year, appeared through pre-recorded remarks.",
    "Romney also criticized some of the pro-Putin rhetoric coming from corners of his own party amid the Russian invasion of Ukraine.",
    "\"It's unthinkable to me, it's almost treasonous and it just makes me ill to see some of these people do that,\" he told Bash.",
    "Gosar and House Minority Leader Kevin McCarthy didn't immediately respond to a request for comment.",
    "It's simply wrong ... it's evil as well,\" Romney told CNN's Dana Bash on \"State of the Union.\"",
    "\"Look, there is no place in either political party for this White nationalism or racism.",
    "\"All Americans should renounce this garbage and reject the Putin wing of the GOP now.\"",
    "Illinois Rep. Adam Kinzinger, also a Republican, criticized Greene and Gosar.",
    "The Utah senator, who in 2012 called Russia \"our No.",
    "CNN's Daniella Diaz contributed to this report.",
    "It's disgusting.\""
  ]
}