{
  "id": 12675,
  "mediaId": 2512,
  "date": "2022-02-28",
  "headline": "AOC tears into Kevin McCarthy for 'protecting his little KKK caucus'",
  "image": "https://www.alternet.org/media-library/paul-gosar-retweets-aoc-cartoon-murder-video-minutes-after-being-censured-for-it.jpg?id=27988787&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.alternet.org/2022/03/aoc-kevin-mccarthy-kkk-caucus/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2443,
    4066,
    3049,
    605,
    1126
  ],
  "sentences": [
    "\"McCarthy stood on the House floor and passionately defended Rep. Gosar, who also headlined fundraisers for white nationalist orgs and escalated into inciting violence in the House,\" she said, referring to a cartoon video Gosar posted that depicted him murdering her.",
    "Rep. Alexandria Ocasio-Cortez (D-NY) on Monday delivered a blistering denunciation of House Republican Leader Kevin McCarthy (R-CA) after he finally condemned Rep. Marjorie Taylor Greene (R-GA) for appearing at a white nationalist conference over the weekend.",
    "She then explained how McCarthy had the opportunity to condemn Gosar after the first time he attended a white nationalist conference, but declined to do so until the Arizona Republican defiantly did it a second time.",
    "McCarthy stood on the House floor and passionately defended Rep. Gosar, who also headlined fundraisers for white nationalist orgs & escalated into inciting violence in the House.",
    "Writing on Twitter, Ocasio-Cortez accused McCarthy of covering for the racist behavior of Greene and Rep. Paul Gosar (R-AZ) for years.",
    "He’s now helped them for so long they’ve escalated their open antisemitism and collaboration with white nationalist groups.",
    "\"McCarthy has been protecting his little KKK Caucus for years with these toothless statements and meetings,\" she wrote.",
    "He made it fair game.\\n\\nIt\\u2019s not an exaggeration in the slightest to say he works to protect them.",
    "It’s not an exaggeration in the slightest to say he works to protect them.\"",
    "— Alexandria Ocasio-Cortez (@Alexandria Ocasio-Cortez) 1646086455",
    "\"It’s how he covers for them.",
    "He’s just as culpable.\"",
    "\"He made it fair game."
  ]
}