{
  "id": 12716,
  "mediaId": 2520,
  "date": "2022-03-02",
  "headline": "Rep. Paul Gosar is 1 of 3 to vote against pro-Ukraine measure",
  "image": "https://www.gannett-cdn.com/presto/2021/11/10/PPHX/b07fb40c-5fd5-4f3b-83a9-fe439d1b08d4-AP21313299334094.jpg?crop=5999,3374,x0,y31&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/03/02/rep-paul-gosar-one-of-three-votes-against-pro-ukraine-measure/9350238002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald J. Hansen",
  "authorUrl": "https://www.azcentral.com/staff/2647673001/ronald-j-hansen/",
  "termIds": [
    4591,
    5037,
    3049,
    4039,
    3618,
    2443,
    2765,
    2426,
    1126,
    1477,
    6672,
    6569
  ],
  "sentences": [
    "“The problem is that our leaders are dumb … and so far, allowed him to get away with this travesty and assault on humanity.”\nSupreme Court won't let Arizona voters weigh in on tax cut Brnovich takes election manual fight with Hobbs to court Karrin Taylor Robson drops fundraising tactic after questions AZ House Speaker Rusty Bowers wins award for courage\nIn a written statement Tuesday, Trump accused \"RINOs,\" or Republicans in Name Only, \"Warmongers\" and \"Fake News\" of lying and misrepresenting his comments about Putin \"because they know this terrible war being waged against Ukraine would have never happened under my watch.\"",
    "“I have repeatedly stated that this conflict has nothing to do with American national security and not one American soldier should be dragged into a war 5000 miles away when there is no reason to be there.”\nReps. Thomas Massie, R-Ky., and Matt Rosendale, R-Mont., also voted against the measure, which, among other things, said the United States stands \"steadfastly, staunchly, proudly, and fervently behind the Ukrainian people in their fight against the authoritarian Putin regime.\"",
    "He blamed the “extreme left environmentalists” for making the U.S. dependent on Russian goods, called Ukraine “Russia's backyard” and said, “God be with the people of Ukraine.”\nLast year, the Democrat-controlled House censured Gosar and stripped him of his committee assignments after he shared an animated video that depicted him slaying Rep. Alexandria Ocasio-Cortez, D-N.Y., and attacking President Joe Biden.",
    "The resolution passed 426-3, underscoring how broadly unpopular the Russian war in Ukraine has become in the week since it began, despite the rhetoric of former President Donald Trump, who has recently praised Vladimir Putin as “smart,” “savvy” and “genius.”\nWhen Rep. Adam Kinzinger, R-Ill., noted his dismay with Wednesday's few \"no\" votes, Gosar, R-Ariz., tweeted, \"Talk to me when our border is secure.\"",
    "“While I have deep compassion and sympathy for the horrible suffering of the people of Ukraine and am moved by their nationalism, this resolution would have been more aptly titled the ‘Resolution that Drags the United States into Another Foreign War,’” Gosar said.",
    "'Let’s get it done once and for all': Immigration advocates see urgency in Biden's speech to pass comprehensive reform\nRep. Andy Biggs, R-Ariz., voted for the resolution Wednesday, but made clear afterward that he had misgivings about it.",
    "By Saturday, after international opinion had solidified against Russia's aggression, Trump offered some criticism of the invasion, but maintained Putin was “smart” during his remarks to the annual Conservative Political Action Conference.",
    "On Sunday, Sen. Mitt Romney, R-Utah, likened Gosar and Rep. Marjorie Taylor Greene, R-Ga., to \"morons\" for their association with the America First Political Action Conference, an annual event organized by white nationalist Nick Fuentes.",
    "Gosar has tried to recast the Jan. 6, 2021, riot at the U.S. Capitol as a day of patriotic protest and said the police slaying of a California woman climbing through a barricaded door that day was \"murder.\"",
    "Later, Gosar issued a statement faulting the resolution for referencing NATO's longstanding collective defense provision that treats an attack on one member nation as one against all of them.",
    "Rep. Paul Gosar was one of three members of the House of Representatives on Wednesday to vote against a symbolic measure calling for a cease-fire in Ukraine and support for its people.",
    "The language of the resolution opens the door for American troops to become involved in Ukraine, perpetuating a false notion that the United States is the defense force of the world.\"",
    "Lampooned on \"Saturday Night Live\" and often marginalized in the national media, Gosar is to many best known as the member of Congress who had six siblings campaign for his opponent.",
    "President Putin has shown himself to be a power-hungry tyrant whose actions have caused unnecessary harm, death, and global instability,\" he said in a written statement.",
    "Since the Russian invasion of Ukraine became an international focus, Gosar has taken to social media for a variety of different takes on the situation.",
    "The war in Ukraine has become a rare issue in which many Republicans have broken from Trump's lead, even if in small ways.",
    "Adding to a controversial portfolio\nThe controversial vote adds to Gosar's growing profile as a political outlier.",
    "\"It’s terrible, but this is what you get with Biden, the Democrats, and RINO warmongers!\"",
    "Reach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493.",
    "“The problem is not that Putin is smart, which, of course, he’s smart,” Trump said.",
    "Trump cast the invasion of Ukraine as a failure of Biden, NATO and \"the West.\"",
    "\"I condemn Russia’s unprovoked attack against Ukraine in the strongest terms.",
    "Gosar appeared at AFPAC by video, after attending in person last year.",
    "On Feb. 23, Trump said Putin's attack on Ukraine was a shrewd move.",
    "I mean, he's taking over a country for $2 worth of sanctions.",
    "Subscribe to our free political podcast, The Gaggle.",
    "\"My vote … comes with serious reservations.",
    "I'd say that's pretty smart,” Trump said.",
    "Follow him on Twitter @ronaldjhansen.",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "“Putin's smart.",
    "he said.",
    "."
  ]
}