{
  "id": 12838,
  "mediaId": 2528,
  "date": "2022-02-27",
  "headline": "'Morons': Mitt Romney goes after Marjorie Taylor Greene and Paul Gosar for attending conference with white nationalist ties",
  "image": "https://i.insider.com/621bca30101faf0019295ae8?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/romney-criticizes-reps-greene-gosar-for-attending-white-nationalist-event-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Connor Perrett",
  "authorUrl": "https://www.businessinsider.com/author/connor-perrett",
  "termIds": [
    2443,
    5583,
    5423,
    4039,
    1126,
    6238,
    6488,
    5949,
    6684
  ],
  "sentences": [
    "GOP Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona attended the third-annual America First Political Action Conference in Orlando, which was held Friday and organized by the far-right figure Nick Fuentes.",
    "Fuentes is known for white nationalist views, including his questioning the existence of the Holocaust, criticizing interracial marriage, and praising Jim Crow-era segregation, Insider previously reported.",
    "\"As Rep. Marjorie Taylor Greene and Rep. Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" she said.",
    "Doug Ducey last week defended Rogers days before she attended the event, saying she was \"still better\" than the Democratic opponent she defeated in 2020, Insider's John L. Dorman reported.",
    "\"And Marjorie Taylor Greene and Paul Gosar, I don't know them, but I'm reminded of that old line from the 'Butch Cassidy and the Sundance Kid' movie, where one character says: 'Morons.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "I don't know what his views are, so I'm not aligned with anything that may be controversial,\" Greene told reporters at CPAC, held at the same time in Orlando.",
    "GOP Rep. Liz Cheney, a pariah among staunch supporters of former President Donald Trump, also chastised her colleagues for attending the evening in a tweet.",
    "He continued: \"And I have to think anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points.\"",
    "Utah Sen. Mitt Romney on Sunday implied that members of his own party were \"morons\" after they attended a Florida event associated with white nationalists.",
    "\"I have to think anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points,\" he said.",
    "As HuffPost reported, other Republican lawmakers were associated with the event, including Arizona state Sen. Wendy Rogers and Idaho Lt. Gov.",
    "Greene on Saturday defended her appearance at the conference, claiming she did not know its organizer or about his views, Insider reported.",
    "He implied GOP Reps. Marjorie Taylor Greene and Paul Gosar were \"morons\" for attending an event associated with white nationalists.",
    "It's simply wrong,\" the Republican lawmaker told CNN's Dana Bash during a Sunday appearance on \"State of the Union.\"",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "The Anti-Defamation League has also called Fuentes a \"well-known white supremacist pundit and organizer.\"",
    "Anna Moneymaker/Getty Images\nUtah Sen. Mitt Romney on Sunday criticized members of his own party.",
    "\"Look, there's no place in either political party for this white nationalism or racism.",
    "\"All Americans should renounce this garbage and reject the Putin wing of the GOP now.\"",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "But during his CNN appearance, Romney called out Greene and Gosar by name.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Janice McGeachin, who appeared in a pre-recorded video.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "I have got morons on my team.'\"",
    "Loading Something is loading.",
    "\"I do not know Nick Fuentes.",
    "I've never heard him speak.",
    "Arizona's Republican Gov.",
    "Sen. Mitt Romney of Utah.",
    "I've never seen a video."
  ]
}