{
  "id": 12861,
  "mediaId": 2664,
  "date": "2022-03-01",
  "headline": "While democracy is under attack in Europe, GOP plots to destroy democracy in America",
  "image": "https://www.rawstory.com/media-library/marjorie-taylor-green-erin-scott-pool-afp.jpg?id=26387542&width=1200&coordinates=0%2C57%2C0%2C58&height=600",
  "link": "https://www.rawstory.com/while-democracy-is-under-in-europe-gop-plots-to-destroy-democracy-in-america/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4066,
    4591,
    5252,
    2187,
    1126,
    6678,
    6569,
    6672,
    6029
  ],
  "sentences": [
    "Trump, in his speech at CPAC, doubled down on his statements heralding Putin as “genius” and “smart” (even as he perfunctorily, and passionlessly, called the invasion an “atrocity,” helping give the GOP cover as Republicans suddenly scramble to look like they’re not pro-Putin as the American public is outraged by the images it is seeing from Ukraine.)",
    "Promoting the white supremacist conspiracy of replacement theory, Donald Trump and other GOP politicians and leaders at the Conservative Political Action Conference in Orlando discussed the “invasion” on the border with Mexico — and actually made comparisons between besieged immigrants seeking asylum and Putin’s armed troops storming Ukraine.",
    "So they organized a whiter supremacist conference at the same time a few miles away, the America First Political Action Committee, organized by Nick Fuentes, who’s been kicked off social media for promoting white supremacist hate and was involved in the infamous Charlottesville Unite the Right rally.",
    "Instead is was a pathetic, dwindling copy-cat convoy of the Canada anti-vaxers, which had been on its way from California to Washington to protest Covid restrictions — even though mask mandates have been lifted everywhere and the federal government isn’t mandating truckers get vaccinated.",
    "Later, after criticism, she feigned ignorance that it was a white supremacist conference — though it received enormous attention last year when GOP Congressman Paul Gosar of Arizona (who sent a video message this year to the conference) attended and spoke.",
    "Senate Minority leader Mitch McConnell and House Minority Leader Kevin McCarthy made weak statements this week about how “wrong” it was for Greene to attend and how white supremacy supposedly doesn’t have “a place” in the GOP.",
    "NOW WATCH: 'It would take years': Jen Psaki reacts to Fox News host who wants Keystone pipeline to solve Ukraine crisis\n'It would take years' Jen Psaki reacts to Fox host who wants Keystone pipeline solve Ukraine crisis",
    "There is no plan by him and GOP leaders in the House to censure or expel Greene, so obviously there is a “place” for white supremacists in the GOP — as well as anti-vaxers, QAnon supporters and anti-LGBTQ extremists.",
    "“We’re going to be doing it again a third time.” The crowd thundered, heralding the idea of having an authoritarian back in the White House, one who bowed to Putin, a dictator who’s currently engaged in war crimes.",
    "And they continued the Big Lie that the 2020 election was stolen, while promoting ways to steal it in the mid-terms via voter suppression laws, gerrymandering and propaganda campaigns to demonize Democrats.",
    "As we watch democracy under attack abroad, Republicans are making it even easier for Democrats to make a clear connection back to the GOP and the insurrection heading into the mid-term elections.",
    "Congresswoman Lauren Boebert of Colorado said that the U.S. and Canada — where anti-vax truckers obstructed the streets of Ottawa protesting vaccine mandates — need to be liberated like Ukraine.",
    "And Congresswoman Marjorie Taylor Greene, the QAnon cultist from Georgia, spoke at the conference, getting applause while she viciously attacked transgender youth.",
    "They held panel discussions at CPAC that promoted banning books and passing laws to stop the teaching of history regarding slavery and race in schools.",
    "And many discussed a convoy of trucks headed to a capitol — but it wasn’t the Russian convoy headed to Ukraine intent on seizing the city of Kiev.",
    "Greene went back to CPAC, where she wasn’t barred but was instead welcomed, because, as one of the CPAC organizers said, we don’t “cancel” people.",
    "They planned out how they would further attack transgender teens and censor discussion of sexual orientation and gender identity in schools.",
    "While Russia was invading Ukraine, prominent Republicans instead were condemning another “invasion” — which isn’t an invasion at all.",
    "While democracy is under attack in Europe against America’s allies, the GOP in the U.S. is plotting to destroy democracy in the U.S.",
    "“We did it twice, and we’ll do it again,” Trump said, falsely claiming again that he won the 2020 election.",
    "But when asked again about it by reporters today, McCarthy refused to discuss it.",
    "At AFPAC Fuentes, in discussing Putin, defended both Putin and Adolf Hitler.",
    "CPAC was a white supremacist conference in and of itself.",
    "Trump also came close to announcing he’s running in 2024.",
    "But to some MAGA, it’s not extreme enough.",
    "And they must hit on it every day."
  ]
}