{
  "id": 12933,
  "mediaId": 2584,
  "date": "2022-02-28",
  "headline": "First Thing: Russian rouble crashes as sanctions make their mark",
  "image": "https://i.guim.co.uk/img/media/e64ae9dbbb70f5c2902d413ee4d078b5ae47691f/0_96_7198_4318/master/7198.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=34752fda874cbbee8533208d8cb18dd5",
  "link": "https://www.theguardian.com/us-news/2022/feb/28/first-thing-russian-rouble-crashes-as-sanctions-make-their-mark",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicola Slawson",
  "authorUrl": "https://www.theguardian.com/profile/nicola-slawson",
  "termIds": [
    1882,
    4325,
    4453,
    4905,
    5665,
    5699,
    2765,
    6672,
    6569
  ],
  "sentences": [
    "Climate check: Impact of climate crisis much worse than predicted, says Alok Sharma\nThe impacts of the climate crisis are proving much worse than predicted, and governments must act more urgently to adapt to them or face global disaster, the UK president of the UN climate talks has warned on the eve of a landmark new scientific assessment of the climate.",
    "The impacts on our daily lives will be increasingly severe and stark.”\nLast Thing: Turmoil in small Italian town after judge silences church bells\nAll eight Slovenian MEPs have weighed in to a ding-dong in a small town in northern Italy, calling on the European Commission to act to “protect traditions” after an Italian judge silenced a church’s bells.",
    "The Russian star conductor Valery Gergiev has been dropped by his management over his close ties to Vladimir Putin as he faces a looming deadline to publicly denounce the Russian president or lose yet another role in his rapidly crumbling career, with Munich Philharmonic poised to fire him next.",
    "Supreme court nomination of Ketanji Brown Jackson ‘beyond politics’\nThe supreme court nomination of Ketanji Brown Jackson should be placed “beyond politics”, the politician who extracted Joe Biden’s politically priceless promise to instal the first Black woman on the court said on Sunday.",
    "At least 368,000 people have already fled their homes in Ukraine, according to the UN refugee agency, and more than 4.5 million more could follow if the fighting spreads, Ukrainian authorities have said, with reports of tens of thousands on the move within the country itself.",
    "Stat of the day: Biden’s polling plummets to 37%, his lowest yet\nTwo days before his first State of the Union address, with war raging in Ukraine and inflation rising at home, Joe Biden’s approval rating hit a new low in a major US poll.",
    "James Clyburn, the South Carolina congressman and House Democratic whip whose endorsement propelled Biden to the presidential nomination and produced his promise to pick a Black woman, appeared yesterday on CBS’s Face the Nation.",
    "The news came as Ukraine’s president, Volodymyr Zelenskiy, told the British prime minister that the next 24 hours would be crucial for his country amid reports that a column of Russian tanks was heading for the capital.",
    "In other news …\nMarjorie Taylor Greene and Paul Gosar, members of Congress who spoke at a white nationalist event in Florida this week, are “morons” with no place in the Republican party, Mitt Romney said yesterday.",
    "His book, One Damn Thing After Another: Memoirs of an Attorney General, will be published on 8 March, its title taken from a description of the job by Ed Levi, appointed by Gerald Ford after the Watergate scandal.",
    "William Barr uses new book to outline case against Trump White House run\nIn a new memoir, the former US attorney general William Barr says Donald Trump must not be the Republican candidate for president in 2024.",
    "A rare emergency special session of the UN general assembly is due to be held today in response to Russia’s invasion of Ukraine, marking the first time in 40 years the security council has made such a request.",
    "Don’t miss this: Patrisse Cullors on co-founding Black Lives Matter, the backlash – and why the police must go\nIt is 10 years since she helped launch possibly the biggest global protest movement in history.",
    "Jen Psaki, the White House press secretary, told ABC’s This Week that Biden would acknowledge challenges but also project optimism when he speaks to Congress and the nation at the Capitol on Tuesday night.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "In fact, Steve Vladeck, a professor at the University of Texas, has pointed out that Jackson has more trial experience than four current justices combined – including the chief, John Roberts.",
    "Some Republicans have complained that nominations should not be made on grounds of race or gender – ignoring promises to put women on the court acted on by Ronald Reagan and Donald Trump.",
    "Alok Sharma, who led the Cop26 climate summit last year, said: “The changes in the climate we are seeing today are affecting us much sooner and are greater than we originally thought.",
    "Trump, Barr says, has surrounded himself with “sycophants” and “whack jobs from outside the government, who fed him a steady diet of comforting but unsupported conspiracy theories”.",
    "The rouble crashed more than 40% after trading began today amid unprecedented international sanctions against Russia’s financial system over Vladimir Putin’s invasion of Ukraine.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "The man he served between 2019 and 2020, Barr writes, has “shown he has neither the temperament nor persuasive powers to provide the kind of positive leadership that is needed”.",
    "For some in Dolina, a town with a minority Slovene community close to Italy’s border with Slovenia, the bells of Sant’Ulderico church were essential to the rhythm of their day.",
    "For others, the “loud and excessive” ringing was a bane, leading to a petition that in turn led a judge in nearby Trieste to remove the bells in an unprecedented ruling.",
    "Ukraine has agreed to send a delegation to meet Russian representatives on the border with Belarus, which would be the two sides’ first public contact since war erupted.",
    "Russia’s central bank more than doubled interest rates to 20%, and banned foreigners from selling local securities, in an effort to protect its currency and economy.",
    "The number of new people getting vaccinated in America has steadily declined in recent months, according to Centers for Disease Control and Prevention (CDC) data.",
    "But doctors emphasize that the virus remains a threat in the US and that people who are not vaccinated are at greater risk of become severely ill or dying.",
    "Get in touch\nIf you have any questions or comments about any of our newsletters please email newsletters@theguardian.com\n… we have a small favour to ask.",
    "The US stepped up the flow of weapons to Ukraine, announcing yesterday it would send Stinger missiles as part of a package approved by the White House.",
    "“I have to think anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points,” he said.",
    "The Washington Post spoke to an unnamed US administration official on Sunday evening who said the deployment could begin as soon as today.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "Meanwhile, a US official believes Belarus is preparing to send soldiers into Ukraine in support of the Russian invasion.",
    "He said he hoped “that all my Republican friends will look upon” the nomination of Jackson as being “beyond politics”.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "Patrisse Cullors describes how her childhood inspired her activism – and the hurt she has suffered.",
    "“I was thrust into a global spotlight, but at the end of the day I’m a local community organiser.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "I think being the face of a global movement was turning me into something I didn’t want to be.",
    "Zelenskiy said he was not confident that any progress would be made, but that he would try.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "The survey from the Washington Post and ABC News put Biden’s approval rating at 37%.",
    "The fivethirtyeight.com poll average pegs his approval rating at 40.8% overall.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "Sign up\nFirst Thing is delivered to thousands of inboxes every weekday.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "I don’t have the emotional bandwidth,” she tells Nesrine Malik.",
    "Trump hinted again on Saturday that he intends to run in 2024.",
    "Why would it be such a big deal with Jackson gets approved?",
    "But then came controversy as huge sums of money flowed in.",
    "And we provide all this for free, for everyone to read.",
    "Of 115 supreme court justices, 108 have been white men.",
    "We do this because we believe in information equality.",
    "He did not immediately comment on Barr’s analysis.",
    "If there were ever a time to join us, it is now.",
    "If you’re not already signed up, subscribe now.",
    "Is the US doing anything more to help?",
    "Two have been Black men, five women.",
    "I can sustain local organising work.",
    "Is there any chance of a ceasefire?",
    "When will Barr’s book be out?",
    "I didn’t want to be a shark.",
    "She definitely seems to be.",
    "But is she qualified?",
    "What about the UN?",
    "Good morning.",
    "Thank you.",
    "Yes.",
    "?"
  ]
}