{
  "id": 12950,
  "mediaId": 2664,
  "date": "2022-03-01",
  "headline": "Trump-loving lawmaker threatens to 'destroy' any Republican who tries to punish her for attending white nationalist conference",
  "image": "https://www.rawstory.com/media-library/arizona-state-senator-wendy-rogers-speaking-at-a-rally-photo-credit-gage-skidmore.jpg?id=29410777&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/trump-loving-lawmaker-threatens-to-destroy-any-republican-who-tries-to-punish-her-for-attending-white-nationalist-conference/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.rawstory.com/u/jeremyduda-arizonamirror",
  "termIds": [
    5114,
    3019,
    2952,
    3702,
    3651,
    4039,
    1126,
    1394,
    1489
  ],
  "sentences": [
    "Bill Gates, the board’s chairman, and Clint Hickman, its vice chairman, issued a joint statement on Monday blasting Rogers for defending Putin, for declaring “that everyone who doesn’t support her conspiracy theories is a Soros puppet, a traitor or a communist” — Rogers has leveled similar criticism at the Arizona Mirror — and for embracing “anti-Semitic, racist and homophobic rhetoric.”\n“The United States of America has always been a beacon of hope for those who believe in self-determination and self-governance.",
    "I trust other business, community, and political leaders will publicly condemn her hateful, dangerous, paranoid, un-American rhetoric.”\nRepublican Supervisor Tom Galvin tweeted that Rogers “spreads anti-Semitic tropes in defense of Putin” and wrote, “The AFPAC knuckleheads are not conservatives and I’m all for cancelling white supremacists, Nazi sympathizers, and Putin bootlickers.”\nThe Arizona Chamber of Commerce and Industry also condemned Rogers for her statements.",
    "Fann noted that some members of the Senate are “are having conversations about the rest of the statements that were made.” She wouldn’t comment on Gray’s assertion that a possible censure could be underway, saying only, “We’re not even at that point yet.” She said the Senate will be putting out additional statements and taking action “as needed.”\nShe added that some senators were still largely unfamiliar with or unaware of Rogers’ recent statements.",
    "Hit me all you want.”\nShe continued: “I will personally destroy the career of any Republican who partakes in the gaslighting of me simply because of the color of my skin or opinion about a war I don’t want to send our kids to die in.”\nThe America First Political Action Conference, as the event is known, is an annual white nationalist gathering.",
    "U.S. Sen. Mitt Romney, R-Utah, referred to them as “morons.” And Wyoming GOP Congresswoman Liz Cheney criticized members of her own party for not speaking out against them, saying, “silence by Republican Party leaders is deafening and enabling.” Illinois Republican Adam Kinzinger said Gosar and Greene should be kicked out of the GOP.",
    "Sen. Paul Boyer, a Glendale Republican who has found himself at odds with much of his party over his refusal to embrace false conspiracy theories about the 2020 election, of which Rogers is a vocal proponent, or the so-called “audit” that Fann ordered of the election in Maricopa County, was the loudest voice among Senate Republicans.",
    "Asked about Gosar and Greene, U.S. Senate Minority Leader Mitch McConnell said, “There’s no place in the Republican Party for white supremacists or anti-Semitism.” His counterpart in the House, California’s Kevin McCarthy, said it was “appalling and wrong” for Gosar and Greene to appear at AFPAC, and said he would speak with them.",
    "In a speech to the conference in Orlando on Friday, Rogers, a Flagstaff Republican, called for gallows to be built to hang “high-level criminals” and “traitors who have betrayed our country.”\nRogers also praised event organizer Nick Fuentes, a known Holocaust denier with a history of making racist and anti-Semitic remarks.",
    "She added that he, French President Emmanuel Macron, New Zealand Prime Minister Jacinda Ardern and Canadian Prime Minister Justin Trudeau “all report to the same Satanic masters.”\n“I stand with the Christians worldwide not the global bankers who are shoving godlessness and degeneracy in our face,” Rogers wrote on Twitter.",
    "Shope wouldn’t go as far as to say that he’d rather have a Democrat than Rogers, but said, “I would rather have somebody filling that seat that I’m not going to have to explain myself away on a daily basis.”\nShope wouldn’t comment on how he would vote on a hypothetical censure motion against Rogers.",
    "In a speech to the conference, Fuentes said people are comparing Russian President Vladimir Putin to Adolph Hitler, “as if that isn’t a good thing.” Fuentes is a leader of the “groyper” movement that seeks to push the Republican Party further toward white nationalism.",
    "He said he would have to look at whatever information was presented to him and doesn’t want to “go out of turn.”\nRogers, who boasted in her AFPAC speech that she didn’t run from criticism, would not speak with reporters on the Senate floor on Monday.",
    "Discussions are underway at the Arizona Senate about possibly censuring Sen. Wendy Rogers over her recent inflammatory comments and her speech to a white nationalist conference over the weekend, according to the chamber’s second-ranking Republican.",
    "Rogers on Friday called him “the most persecuted man in America.”\nGray, a Republican from Sun City, said he had “serious concerns” about the clips he’d seen of Rogers’ comments to AFPAC, as the event is known.",
    "She noted that she and other Senate Republican leaders put out a statement strongly supporting Ukraine in its war against Russia, but wouldn’t comment on Rogers’ other statements or her participation in AFPAC.",
    "But GOP members of the Maricopa County Board of Supervisors, who are derided by Rogers’ wing of the party over false election conspiracy theories and debunked claims from the “audit,” were highly critical.",
    "NOW WATCH: John Bolton temporarily stunned into silence by Newsmax host's response to his Trump criticism\nJohn Bolton temporarily stunned into silence by Newsmax host's response to his Trump criticism",
    "I think it’s better to consolidate on what we’re going to do before we start talking to the media about what we’re going to do,” Sen. Rick Gray, the Senate majority leader, told reporters on Monday.",
    "That’s why I said we need to have a little time so that people can catch up with everything that’s transpired so that they can make their decisions about how best we should handle it,” Fann said.",
    "Elected officials who spread this kind of hateful and divisive rhetoric will have to answer to the voters,” Chamber spokeswoman Annie Vogt said in a statement provided to the Mirror.",
    "He questioned whether a censure would have any effect, but said other Republicans should speak out against her and expressed hope that voters would remove her from office this year.",
    "Rogers also raised eyebrows over the weekend with inflammatory social media posts about the Russian invasion of Ukraine, some of which included well-established antisemitic tropes.",
    "She said Ukrainian President Volodimyr Zelensky, who has became the global face of resistance to Putin’s invasion, “is a globalist puppet” for George Soros and the Clintons.",
    "Nationally, several prominent Republicans took aim at two GOP members of Congress who spoke at AFPAC, Arizona’s Paul Gosar and Georgia’s Marjorie Taylor Greene.",
    "At this critical time, we need the world to see that we don’t just preach American values to others but we live them ourselves,” Gates and Hickman said.",
    "“That kind of … rhetoric is beyond the pale.”\nSen. T.J. Shope, R-Coolidge, was also highly critical of Rogers’ rhetoric and her participation in AFPAC.",
    "Asked if he thought Rogers was a white nationalist, Boyer said she associates with white nationalists, speaks their language and appeals to them.",
    "Arizona Mirror is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "Some Republican senators, such as Sonny Borrelli and David Livingston, said they weren’t aware of Rogers’ statements and declined to comment.",
    "The chamber and a PAC it controls gave $140,000 to the governor’s PAC, which spent nearly $3.4 million to elect Republican legislators.",
    "“We hope it goes without saying that the Chamber vehemently condemns the anti-Semitic views espoused by AFPAC and its supporters.",
    "In a tweet on Monday, Shope referred to Rogers’ comments about Ukraine as “bullsh**.”\n“It’s completely, utterly bizarre.",
    "Boyer said he’d rather have a Democrat, even though it would deprive Senate Republicans of their decisive 16th vote.",
    "Rogers lashed out at the idea Monday night, writing on social media that she “will not apologize for being white.",
    "He noted that he was the chairman of the House ethics committee and has “tremendous respect” for the process.",
    "“I think that we’d still have to make persuasive arguments on the merits of any given policy,” Boyer said.",
    "Doug Ducey’s assertion that Rogers is still better than the Democrat she defeated to win office in 2020.",
    "I can tell you I have some members that don’t even know of the things that were said over the weekend.",
    "Ducey’s political action committee spent about $500,000 to help her defeat Democrat Felicia French.",
    "That doesn’t mean that we, as a Senate body, agree with that,” said Fann, a Prescott Republican.",
    "The Arizona Chamber of Commerce helped finance Ducey’s campaign to boost Rogers in 2020.",
    "“There are a lot of people who don’t follow Twitter and don’t follow the other stuff.",
    "“We do have a First Amendment right and anybody is allowed to say anything they want.",
    "Talk about something that just doesn’t seem rational at all, as far as thought.",
    "He also took issue with her invoking Christ and the gospels in her speech.",
    "“Globalist” is a common code word used by antisemites to disparage Jews.",
    "Nothing positive to say, that’s for sure,” he told reporters on Monday.",
    "Republicans in Arizona were largely silent about Rogers on Monday.",
    "Her comment about building gallows were “disappointing,” he said.",
    "Senate President Karen Fann was more restrained in her response.",
    "“Wendy Rogers does not represent American values or interests.",
    "Boyer said Rogers’ comments were “specifically” antisemitic.",
    "Contact Editor Jim Small for questions: info@azmirror.com.",
    "Sine Kerr and Tyler Pace declined to comment as well.",
    "Others were forceful in their denunciation of Rogers.",
    "They have no place in politics, in civil society.",
    "Arizona Mirror maintains editorial independence.",
    "Follow Arizona Mirror on Facebook and Twitter.",
    "I don’t even know where that comes from.",
    "Boyer also said he disagreed with Gov.",
    "“I can say I do not reflect her views.",
    "It’s not where I stand,” Gray said.",
    "They’re ridiculous,” Boyer said.",
    "Soros and Zelensky are Jewish.",
    "“We’re talking about that.",
    "We’re discussing that.",
    "“They’re disgusting.",
    "Republican Sens."
  ]
}