{
  "id": 12976,
  "mediaId": 2643,
  "date": "2022-02-28",
  "headline": "Mitch McConnell Condemns GOP Members Who Engage With White Nationalists",
  "image": "",
  "link": "https://www.newsweek.com/mitch-mcconnell-condemns-gop-members-who-engage-white-nationalists-1683443",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Natalie Colarossi",
  "authorUrl": "https://www.newsweek.com/authors/natalie-colarossi",
  "termIds": [
    2187,
    2443,
    4039,
    4591,
    4267,
    5583,
    1126
  ],
  "sentences": [
    "\"There's no place in the Republican Party for white supremacists or antisemitism,\" McConnell told Politico, when asked to comment on Reps. Marjorie Taylor Greene and Paul Gosar's attendance at the America First Political Action Conference.",
    "Senate Minority Leader Mitch McConnell of Kentucky on Monday spoke out against fellow Republicans who engaged with white nationalists during a far-right rally on Friday, stating that there is no room for that kind of behavior in the GOP.",
    "\"As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" she said on Twitter.",
    "In a statement given to Newsweek on Sunday, Greene defended her attendance at the rally by saying that it was an important opportunity to \"speak to 1,200 young America First patriots.\"",
    "Fuentes has also come under fire for previously urging the U.S. to protect the \"white demographic core,\" and has made multiple remarks deemed to be \"racist and antisemitic\" by the ADL.",
    "The rally took place in Orlando, Florida, and was organized by Nick Fuentes, a podcaster and talk show host whom the Anti-Defamation League (ADL) has labeled a white supremacist.",
    "\"Now they're going on about Russia and Vladimir Putin is Hitler—they say that's not a good thing,\" Fuentes added before laughing and saying that he \"shouldn't have said that.\"",
    "\"I am not going to play the guilt by association game in which you demand every conservative should justify anything ever said by anyone they've ever shared a room with.",
    "During the event, Fuentes urged attendees to \"give a round of applause for Russia\" as Russian President Vladimir Putin moved to invade Ukraine just one day before.",
    "She added that she would not turn down the opportunity to speak over \"a few off-color remarks by another speaker, even if I find those remarks unsavory.\"",
    "And I have to think anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points.\"",
    "Other Republicans, including Wyoming Rep. Liz Cheney, similarly spoke out against Greene and Gosar and urged the rest of the GOP to follow.",
    "Utah Republican Senator Mitt Romney condemned both of the lawmakers on Sunday, accusing them \"missing a few IQ points.\"",
    "Both Greene and Gosar gave remarks during Friday's event, sparking a wave of backlash from other members in the GOP.",
    "But I'm reminded of that Butch Cassidy and the Sundance Kid movie where one character says, 'Morons.",
    "\"There's no place in either political party for this white nationalism or racism.",
    "It's simply wrong,\" he said during an interview with CNN.",
    "\"Marjorie Taylor Greene and Paul Gosar—I don't know them.",
    "I talked about God and Liberty,\" she stated.",
    "I'm not going to be drawn into that.",
    "I'm only responsible for what I say.",
    "So ask me about my speech.",
    "I have morons on my team.'"
  ]
}