{
  "id": 12982,
  "mediaId": 2528,
  "date": "2022-02-28",
  "headline": "Kevin McCarthy condemns Marjorie Taylor Greene and Paul Gosar for attending 'appalling and wrong' white nationalist event: 'This is unacceptable'",
  "image": "https://i.insider.com/621d470abea1240018a909ca?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/mccarthy-condemns-marjorie-taylor-greene-gosar-america-first-conference-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryan Metzger",
  "authorUrl": "https://www.businessinsider.com/author/bryan-metzger",
  "termIds": [
    2493,
    2443,
    2187,
    1798,
    4066,
    4039,
    3049,
    1617,
    1126
  ],
  "sentences": [
    "Republican House Minority Leader Kevin McCarthy offered a rare rebuke of two members of his caucus on Monday, saying it was \"unacceptable\" for Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona to speak at an event held by a man widely described to be white nationalist.",
    "The former has quickly become a thorn in the side of GOP leadership for her outrageous remarks, while the latter was censured by the House in November for releasing an anime video that depicted him killing Democratic Rep. Alexandria Ocasio-Cortez on New York.",
    "McCarthy, who was in Israel with a congressional delegation last week, told Punchbowl News that the news was particularly appalling to him given his visit to the country's Holocaust museum during his time there.",
    "Greene sought to address the controversy over the weekend, telling reporters at CPAC that she doesn't \"know what [Fuentes'] views are, so I'm not aligned with anything that may be controversial.\"",
    "Both have been removed from their committee assignments, though McCarthy previously pledged to restore their positions as committee members should Republicans retake the House majority. \"",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "\"When I come back I see two colleagues who went a participated with a group that has a leader that many times gives anti-Semitic views, and led a chant for Putin.\"",
    "The event was hosted by Nick Fuentes, who has been described by the Anti-Defamation League as \"well-known white supremacist pundit and organizer.\"",
    "Her office later issued a lengthy statement characterizing attendees as \"young conservatives who feel cast aside and marginalized by society.\"",
    "Kent Nishimura / Los Angeles Times via Getty Images\nMcCarthy offered a rare rebuke of Marjorie Taylor Greene and Paul Gosar on Monday.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "\"I took a number of the freshmen, we went and saw Yad Vashem,\" he told Punchbowl's Jake Sherman.",
    "—Jake Sherman (@JakeSherman) February 28, 2022\nGreene and Gosar are no strangers to controversy.",
    "He said it was \"unacceptable\" for the duo to appear at a conference with white supremacist ties.",
    "Prior to introducing Greene, Fuentes asked the crowd to \"give a round of applause for Russia.\"",
    "\"The party should not be associated any time any place with somebody who is anti-Semitic.\"",
    "On Friday, Greene made a surprise appearance at the America First Conference in Orlando.",
    "But I think with that introduction, you should've walked off stage,\" McCarthy added.",
    "—Liz Cheney (@Liz_Cheney) February 26, 2022\n\"For me it was appalling and wrong.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "House Minority Leader Kevin McCarthy at a press conference on January 20, 2022.",
    "Sherman also reported that McCarthy plans to speak with Greene this week.",
    "\"They may have better committee assignments,\" McCarthy mused in November.",
    "Her office did not immediately respond to Insider's request for comment.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "And there's no place in our party for any of this,\" said McCarthy.",
    "And there's no place in our party for any of this,\" said McCarthy.",
    "Stay up to date with what you want to know.",
    "\"She has personally gone to answer this.",
    "Sign up for notifications from Insider!",
    "\"For me it was appalling and wrong.",
    "Loading Something is loading.",
    "\"This is unacceptable.\""
  ]
}