{
  "id": 13016,
  "mediaId": 2810,
  "date": "2022-03-04",
  "headline": "Putin’s Republican Sympathizers",
  "image": "https://www.thenation.com/wp-content/uploads/2022/03/AP22060812352425.jpg",
  "link": "https://www.thenation.com/article/politics/putins-republican-sympathizers/",
  "mediaOutlet": "The Beat",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sasha Abramsky",
  "authorUrl": "https://www.thenation.com/authors/sasha-abramsky/",
  "termIds": [
    0
  ],
  "sentences": [
    "Instead, in this moment, Arizona GOP state Senator Wendy Rogers chose to speak at the white nationalist America First Political Action Conference in Orlando, Fla., where she announced that she fantasized about hanging her political opponents, so as to “make an example of these traitors,” and told the assembled white nationalists in her audience that they were “patriots.”\nArizona voted for Joe Biden in 2020, and now has two Democratic senators—although one of them, Kyrsten Sinema, is doing a damn good impersonation of a Republican these days—but that doesn’t mean its politics are reliably blue.",
    "The Southern Poverty Law Center and other organizations that track hate groups and fascist leaders have documented AFPAC’s leader Nick Fuentes’s repeated use of the N-word, his belief that America should be a “White Christian” nation, his Holocaust denialism, his fascination with Hitler, and his support for Vladimir Putin.",
    "In that week, Vladimir Putin has shown the world exactly who he is: a fanatical Russian nationalist, with a mystic vision of a greater Russia, the intellectual justifications for which seem to be on a par with Hitler’s vision of a German Reich with Lebensraum carved out of his unfortunate neighbors’ lands.",
    "It still has a GOP-controlled legislature, which has spent much of the past year debating ever more ludicrous and offensive ways to overturn the 2020 presidential election result, and it still has a GOP governor, Doug Ducey, who ran on a right-wing platform.",
    "This is a moment when people of good conscience the world over ought to be rallying to demand peace, to demand an end to the increasingly vicious, and globally destabilizing, actions of the Russian autocrat.",
    "He has made his own country a global pariah and ensured that his people will, even in a best-case scenario, live in deprivation for years to come, as Western sanctions gradually corrode the Russian economy.",
    "But will that response hold firm come November if the GOP—at least some of whose members, some of its base, and some of its media cheerleaders continue to flirt with Putinism—returns to power in Congress?",
    "Fuentes, a young provocateur who now runs a far-right podcast, attended both the neo-Nazi “unite the right” rally in Charlottesville in 2017 and the January 6 insurrection in D.C. in 2021.",
    "Putin has sent thousands of young Russians to slaughter and be slaughtered against a neighboring state that he claims to believe is populated by Russia’s brothers and sisters.",
    "To modify an old adage: “With a brother like this, who needs enemies?”\nThe Russian leader has launched massive missile and artillery attacks against civilian neighborhoods.",
    "Ducey has unapologetically embraced Rogers, despite her membership in the Oath Keepers, her identification with white nationalists, and her support for political violence.",
    "It is a moment when, after years of far-right drift, the GOP ought to publicly recommit to the principles of democracy and tolerance that make possible an open society.",
    "That any elected politician would think it even remotely a good idea to attend such an event shows just how debased one wing of American politics has become.",
    "Days after Rogers’s sickening antics, the Arizona Senate finally got around to censuring her, with most Republicans joining the Democrats in the 24-3 vote.",
    "This was not some mildly provocative gathering; rather, it was a celebration of the most rabidly racist, fascist-worshipping fringe of American politics.",
    "Calling a legislator a “moron” or slapping them on the wrist with a censure vote is easy; actually kicking them out of the party takes a bit more guts.",
    "It’s time, once and for all, to force a break with this American authoritarianism, this dictatorial, supremacist impulse let loose by Trumpism.",
    "Far better to nip this cancer in the bud now, and to expel members such as Greene, Gosar, and Rogers from the GOP before they do more damage.",
    "It’s Wednesday evening as I write this, and the bloody, pointless, and potentially globe-wrecking war in Ukraine has now gone on for a week.",
    "But if they aren’t kicked out of the party, the cancer nurtured and unleashed by Trump will continue to grow within America’s body politic.",
    "Two GOP members of the US Congress—Paul Gosar of Arizona and Marjorie Taylor Greene of Georgia—also attended and spoke at the AFPAC event.",
    "Some, like Greene, are happy to explicitly worship him; others simply seek to emulate his strongman assault on democratic institutions.",
    "It’s not enough for Romney and the “grown-up” Republicans to cluck their tongues in distaste and call their colleagues morons.",
    "But why, doesn’t in this moment of vast international peril, doesn’t the GOP use this as an opportunity to clean house?",
    "Correction: A previous version of this article stated that Arizona govenor Doug Ducey is running for re-election.",
    "In 2022, the democratic, pluralist, world is standing largely united in its abhorrence of Russia’s actions.",
    "Mitt Romney called the Republican lawmakers who attended this fascist hate-fest “morons.” That’s a start.",
    "He has repeatedly threatened with an annihilatory nuclear response those who oppose him and his methods.",
    "Let’s go!”\nThis was on February 25, two days after Putin had ordered his troops into Ukraine.",
    "But that’s a far cry from removing her from office or actually kicking her out of the GOP.",
    "Will that response hold firm if Trump emerges as the GOP presidential hopeful come 2024?",
    "Now, in his wake, a significant part of the GOP has become essentially Putinesque.",
    "This sort of politics ought to have no place in a major US political party.",
    "He has reached his term limit and therefore cannot run for re-election.",
    "Putin!” and compared him to another of his idols, Adolf Hitler.",
    "To this, the fascists in the audience whooped back, “Let’s go!",
    "Trump spent his four years as president cozying up to Putin.",
    "Rogers is joined by fellow gargoyles on the national stage.",
    "At the AFPAC event, Fuentes got the crowd to chant “Putin!",
    "So too did Idaho Lieutenant Governor Janet McGeachin."
  ]
}