{
  "id": 13074,
  "mediaId": 2676,
  "date": "2022-03-01",
  "headline": "GOP leaders condemn Marjorie Taylor Greene, Paul Gosar — Dems say they’re “just as culpable”",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/03/gosar-greene-mcconnell-mccarthy-0301221.jpg",
  "link": "https://www.salon.com/2022/03/01/leaders-condemn-marjorie-taylor-greene-paul-gosar--dems-say-theyre-just-as-culpable/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    0
  ],
  "sentences": [
    "Greene on Saturday similarly defended her appearance at the event by claiming that she did not know anything about Fuentes but had attended the conference to \"address his very large following because that is a young, very young, following and a generation I am extremely concerned about.\"",
    "Instead, the Republican National Committee recently voted to censure Reps. Liz Cheney, R-Wyo., and Adam Kinzinger, R-Ill., for joining the House committee investigating the deadly Jan. 6 pro-Trump Capitol riot, a move defended by McCarthy.",
    "\"It continues to disturb me that the Republicans in Congress have allowed white supremacists to infiltrate their ranks and that not only do they not repudiate it, they encourage it,\" Rep. Debbie Wasserman Schultz, D-Fla., told NBC News.",
    "House Democrats and a small group of Republicans last year voted to strip Greene of her committee posts over past social media posts espousing antisemitic conspiracy theories and calling for the death of prominent Democrats.",
    "Ocasio-Cortez added that McCarthy had \"passionately defended\" Gosar on the House floor after Gosar's previous appearance at Fuentes' conference and his House censure over an anime video depicting him killing Ocasio-Cortez.",
    "Liz and I can get censured, they're going to get help up as the future leaders of the party,\" he told Politico, calling for McCarthy to hold a press conference booting Greene and Gosar from the Republican conference.",
    "Not only did McCarthy refuse to take any disciplinary action against the two members on his own, he vowed to restore their committee assignments if Republicans regain control of the chamber in November's elections.",
    "Republican congressional leaders on Monday denounced Reps. Marjorie Taylor Greene, R-Ga., and Paul Gosar, R-Ariz., for their appearances at a white nationalist event led by far-right \"groyper\" guru Nick Fuentes.",
    "... And then when I come back, I see two colleagues, who went and participated with a group that has a leader that many times gives you antisemitic views, led a chant for Putin,\" McCarthy told CNN.",
    "It's how he covers for them,\" tweeted Rep. Alexandria Ocasio-Cortez, D-N.Y. \"He's now helped them for so long they've escalated their open antisemitism & collaboration w/ white nationalist groups.",
    "Greene and Gosar spoke over the weekend at the America First Political Action Conference in Orlando, an event organized by Fuentes as a far-right alternative to the nearby CPAC conference.",
    "\"There's no place in the Republican Party for white supremacists or antisemitism,\" Senate Minority Leader Mitch McConnell said in a statement to Reuters when asked about Greene and Gosar.",
    "\"The Pharisees in the Republican Party may attack me for being willing to break barriers and speak to a lost generation of young people who are desperate for love and leadership.\"",
    "McCarthy, in a statement, noted that Fuentes at the conference espoused antisemitic rhetoric and led a chant in support of Russian President Vladimir Putin's invasion of Ukraine.",
    "\"It doesn't matter if I'm speaking to Democrat union members or 1,200 young conservatives who feel cast aside and marginalized by society,\" she said in a statement to CBS News.",
    "Democrats have repeatedly called out McCarthy's inaction as he tries to keep his caucus unified while also avoiding picking fights with hardcore pro-Trump members of his party.",
    "Gosar, who also headlined the event last year, previously defended his appearance by arguing that \"you don't accomplish anything by isolating\" certain audiences.",
    "Greene, meanwhile, criticized her fellow Republicans for not doing more to reach out to the types of audiences that attend Fuentes' white nationalist events.",
    "But the GOP leadership's statements were met with skepticism, especially since Republican House leader Kevin McCarthy has repeatedly defended both members.",
    "Former Republican congressman Joe Walsh, now a vocal opponent of Donald Trump, quipped that this would be McCarthy's \"284th 'talk' with MTG and Gosar.\"",
    "But the Republican leaders' condemnation garnered great skepticism given Greene and Gosar's extensive track records of extremism.",
    "\"McCarthy has been protecting his little KKK Caucus for years with these toothless statements and meetings.",
    "\"The party should not be associated, any time, any place, with somebody who is antisemitic,\" McCarthy said.",
    "They don't shun candidates who are running for Congress with their party who embrace white supremacists.\"",
    "Sen. Mitt Romney, R-Utah, called Greene and Gosar \"morons\" who are \"certainly missing a few IQ points.\"",
    "Former Secretary of State Mike Pompeo accused Greene of \"playing footsie\" with \"antisemitic neo-Nazis.\"",
    "In November, House Democrats and two Republican members voted to censure Gosar over the AOC video.",
    "McCarthy said he would have a discussion with Greene and Gosar, rejecting Greene's explanation.",
    "Rep. Dan Crenshaw, R-Texas, rejected Greene's claim that she was unaware of Fuentes' views.",
    "\"It's not an exaggeration in the slightest to say he works to protect them,\" she wrote.",
    "\"And there's no way [Greene] didn't understand that before going to the conference.\"",
    "He's one of the worst human beings I've ever come across,\" Crenshaw told CNN.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "But I think with that introduction, you should have walked off stage.",
    "\"She has personally gone to answer this, saying she did not know.",
    "Kinzinger predicted that nothing would happen to Greene or Gosar.",
    "Everybody should know they're supposed to hate Nick Fuentes.",
    "\"What I think we should do is kick them out of the party.",
    "\"They fan the flames of those who are white supremacists.",
    "Republican leaders denounced the appearances on Monday.",
    "\"They'll have committees,\" McCarthy said last fall.",
    "Subscribe to our morning newsletter, Crash Course.",
    "There's no place in our party for any of this.\"",
    "They may have better committee assignments.\"",
    "\"He's not going to do that,\" Kinzinger said.",
    "\"They may have other committee assignments.",
    "Other Republicans also hit out at the pair.",
    "\"To me, it was appalling and wrong.",
    "What do I think we're going to do?",
    "\"Last week, I was just in Israel.",
    "\"I f**king hate Nick Fuentes.",
    "He's just as culpable.\"",
    "That is unacceptable.\"",
    "Read more:",
    "Nothing."
  ]
}