{
  "id": 13138,
  "mediaId": 4044,
  "date": "2022-03-04",
  "headline": "No, Paul Gosar Did Not Tweet ‘I’ve Been Called Stupid My Whole Life’",
  "image": "https://www.snopes.com/tachyon/2022/03/GettyImages-1090899950-paul-gosar.jpg",
  "link": "https://www.snopes.com/fact-check/paul-gosar-moron-stupid-romney-tweet/",
  "mediaOutlet": "Snopes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan MacGuill",
  "authorUrl": "https://www.snopes.com/author/danmacguill/",
  "termIds": [
    0
  ],
  "sentences": [
    "I’ve got morons on my team.’ And I have to think anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points.”\nIn the days that followed, social media users shared what appeared to be a screenshot of a response issued by Gosar, dated March 1, 2022.",
    "The tweet seemed designed to defend or counter-attack against Romney’s criticism, but was phrased in such a way that Gosar inadvertently made himself look worse:\nMitt Romney says that speaking at a white nationalist event makes me a “moron.” Does he think that bothers me, being called stupid?",
    "In early 2022, right-wing Congress members Paul Gosar of Arizona and Marjorie Taylor Greene of Georgia provoked outrage and criticism, including from some fellow Republicans, after they took part in a conference organized by white nationalist Nick Fuentes.",
    "Luckily, we can check whether the tweet was deleted using a resource called Politwoops — a database created and maintained by ProPublica, which tracks and keeps a record of tweets removed or deleted by U.S. politicians and electoral candidates.",
    "We are issuing a rating of “False.”\nAs of March 4, Gosar’s official Twitter account — @RepGosar — showed no record of any such tweet, meaning one of two things must be true: either the tweet was removed or deleted, or it never existed.",
    "Sen. Mitt Romney of Utah, for example, took aim at the pair in response to a question from CNN’s Dana Bash, on Feb. 27, making a reference to a line from the movie “Butch Cassidy and the Sundance Kid”:\n“One character says ‘Morons.",
    "If the tweet was real, one could reasonably expect that more than one person had taken a screenshot of it, and it would therefore be highly likely to be available with a white background, as well.",
    "For example, every social media post appeared to contain the same screenshot, or slightly cropped variations — showing Twitter in dark mode, with a dark blue background.",
    "The screenshot was also shared very widely on Facebook, as the image below demonstrates:\nIn reality, Gosar never sent any such tweet, and the screenshots were fake.",
    "Even if we were unable to definitively determine that the tweet was bogus using Politwoops, other clues indicated that it was not the genuine article.",
    "Furthermore, while screenshots of the purported tweet were widely available on social media, a link to the tweet itself was not.",
    "A quick check of the @RepGosar feed on Politwoops shows that the most recent deleted tweet from that account came on Feb. 21.",
    "Therefore, we can safely conclude Gosar never sent the “stupid” tweet, and never made the remarks attributed to him.",
    "This is another common sign that a tweet does not actually exist, but is instead the result of digital editing.",
    "NYTimes.com, https://www.nytimes.com/2022/02/28/us/politics/republicans-extremism-marjorie-taylor-greene.html.",
    "Leaders Condemn Lawmakers’ Appearance at White Nationalist Conference.” The New York Times, 1 Mar.",
    "Sources:\n“I Have Got Morons on My Team:” Romney Hits GOP Ties to White Nationalists – CNN Video.",
    "www.cnn.com, https://www.cnn.com/videos/politics/2022/02/27/romney-on-gop.cnn.",
    "Weisman, Jonathan, and Annie Karni.",
    "I’ve heard it my whole life.",
    "Every teacher I ever had.",
    "From my classmates.",
    "My constituents.",
    "Nice try though.",
    "Accessed 4 Mar.",
    "My colleagues.",
    "My siblings.",
    "The media.",
    "“G.O.P.",
    "2022.",
    "2022."
  ]
}