{
  "id": 13146,
  "mediaId": 2640,
  "date": "2022-02-27",
  "headline": "Greene Hears From McDaniel About America First Speech",
  "image": "https://img2-azrcdn.newser.com/image/1400581-12-20220227130455.jpeg",
  "link": "https://www.newser.com/story/317442/greene-gop-clash-over-speech-to-white-nationalists.html",
  "mediaOutlet": "newser.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Cronin",
  "authorUrl": "https://www.newser.com/bio/83627676/bob-cronin.html",
  "termIds": [
    2187,
    2240,
    4039,
    4591,
    1126,
    6569,
    6175,
    6488
  ],
  "sentences": [
    "At the Conservative Political Action Conference elsewhere in Orlando later—where former President Donald Trump singled her out to cheers—Greene told reporters, \"Putin is a murderer and he should never have invaded Ukraine.\"",
    "\"In any other world, Greene speaking at a white supremacist conference where attendees have defended Vladimir Putin and praised Adolf Hitler would warrant expulsion from the caucus,\" Ammar Moussa said in a statement.",
    "The Georgia Republican tweeted that she wouldn't be caught up in \"the guilt by association game in which you demand every conservative should justify anything ever said by anyone they’ve ever shared a room with.\"",
    "Greene added, \"I'm also not going to turn down the opportunity to speak to 1,200 young America First patriots because of a few off-color remarks by another speaker, even if I find those remarks unsavory.\"",
    "But others, including the head of the Republican National Committee, were less impressed with her appearance Friday night before the America First Political Action Conference, USA Today reports.",
    "Fuentes joked about the Russian president to the meeting, saying, \"Now they’re going on about Vladimir Putin and Russia, and Vladimir Putin is Hitler—and they say that's not a good thing.\"",
    "(Newser) – Rep. Marjorie Taylor Greene received applause when she spoke Saturday to an organization of white nationalists in Florida—a group that also cheered Vladimir Putin.",
    "\"White supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party,\" RNC Chairwoman Ronna McDaniel said Saturday.",
    "The event's organizer is Nicholas Fuentes, a Putin backer who's been subpoenaed in the investigation of the attack on the US Capitol, per the Guardian.",
    "GOP Rep. Liz Cheney, who's on the outs with her party, denounced Greene and Arizona Rep. Paul Gosar, who spoke to the America First meeting virtually.",
    "\"All Americans should renounce this garbage and reject the Putin wing of the GOP now,\" Cheney tweeted.",
    "The America First crowd at one point broke into chants of \"Putin!",
    "So did a spokeswoman for the Democratic National Committee.",
    "He added that he shouldn't have said that, then laughed.",
    "(Read more Marjorie Taylor Greene stories.)",
    "But Greene held her ground.",
    "Putin!\""
  ]
}