{
  "id": 13208,
  "mediaId": 2830,
  "date": "2022-02-27",
  "headline": "‘Morons’: Romney, Cheney, Kinzinger condemn fellow Republicans for speaking at white nationalist event",
  "image": "https://images.mktw.net/im-423778/social",
  "link": "https://www.marketwatch.com/story/morons-romney-cheney-kinzinger-condemn-fellow-republicans-for-speaking-at-white-nationalist-event-11646006480?rss=1&siteid=rss",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Murphy",
  "authorUrl": "https://www.marketwatch.com/author/mike-murphy",
  "termIds": [
    2187,
    2443,
    5583,
    5037,
    2887,
    4039,
    1126
  ],
  "sentences": [
    "The event was put on by Nick Fuentes, a far-right, white nationalist leader who has been banned from most social-media platforms for his inflammatory rhetoric\nRep. Adam Kinzinger of Illinois, censured alongside Cheney by the Republican National Committee for opposing Trump, tweeted at Greene on Saturday: “If this was not bizarro world, you would be the one censured and excommunicated from the GOP.”\nSen. Mitt Romney of Utah joined the intramural criticism Sunday during an interview with CNN’s “State of the Union.”\n“Liz Cheney was right with that statement and has been right for a long time,” Romney told CNN’s Dana Bash.",
    "In a tweet Saturday, Rep. Liz Cheney, who has faced intraparty censure in her home state of Wyoming over her criticism of former President Donald Trump, blasted their speaking appearance: “As Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now.”\nGreene, of Georgia, and Gosar, from Arizona, spoke at the America First Political Action Conference in Orlando, Fla., an alternative event to the concurrent Conservative Political Action Conference.",
    "Key Words\n‘It’s simply wrong,’ Romney says of appearances by Reps. Marjorie Taylor Greene and Paul Gosar\nThree veteran Republican lawmakers have called out far-right Reps. Marjorie Taylor Greene and Paul Gosar for speaking at a weekend event organized by a white nationalist.",
    "Romney added that recently expressed support from members of his party for Russian President Vladimir Putin is “almost treasonous.”\n“Standing up for freedom is the right thing to do in America.",
    "It’s simply wrong.”\n“Anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points,” Romney said.",
    "Anything less than that, in my opinion, is unworthy of American support,” he told CNN.",
    "“There’s no place in either political party for this white nationalism or racism."
  ]
}