{
  "id": 13204,
  "mediaId": 2631,
  "date": "2022-02-28",
  "headline": "GOP leaders denounce Greene, Gosar for speaking at white nationalist event",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220228-orlando-fla-Marjorie-Taylor-Greene-ac-557p-2f9b7c.jpg",
  "link": "https://www.nbcnews.com/politics/congress/gop-leaders-denounce-greene-gosar-speaking-white-nationalist-event-rcna18050",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2187,
    2443,
    4039,
    2765,
    4066,
    4267,
    5583,
    1489,
    1126
  ],
  "sentences": [
    "“This is unacceptable.”\n“There’s no place in the Republican Party for white supremacists or anti-Semitism.”\nSenate Republican Leader Mitch McConnell\nMoments later, House Minority Whip Steve Scalise, R-La., whose own political career nearly ended after it was reported that he had addressed white supremacists in 2002, generally condemned antisemitism and racism but also noted that Greene had distanced herself from the remarks of the event organizer.",
    "\"We don’t condone those, and we reject it.”\nMarjorie Taylor Greene hit with four new fines over anti-mask stance\nNov. 2, 202100:24\nThe rare criticism of fellow Republican lawmakers by GOP leaders, which followed fierce condemnation of Greene and Gosar from Republicans across the political spectrum, highlighted how the two represent a major political liability for the party as it seeks to win back control of the House and the Senate this fall.",
    "“It continues to disturb me that the Republicans in Congress have allowed white supremacists to infiltrate their ranks and that not only do they not repudiate it, they encourage it,” Rep. Debbie Wasserman Schultz, D-Fla., the former Democratic National Committee chair and the first Jewish woman from Florida elected to Congress, said in an interview.",
    "“For those individuals, picking fights internally isn’t something they are willing to do, because it could interfere with their ability to become speaker.”\nBut the GOP outcry made it clear to Republican leaders that Greene and Gosar had given Democrats a new opportunity to argue why they should remain in control of the House and the Senate.",
    "“This is an event that no Republican should attend ... and it’s unfortunate that she did.”\nThe firestorm erupted over the weekend when Greene and Gosar spoke at the far-right America First Political Action Conference at a hotel in Orlando, Florida, an event organized by Nicholas Fuentes.",
    "Sen. Mitt Romney, R-Utah, called Greene and Gosar “morons” in an appearance on CNN, while Rep. Liz Cheney, R-Wyo., said her House colleagues are promoting antisemitism and white supremacy that is “a toxin in the bloodstream.”\nEven some high-profile Trump allies said they were disgusted.",
    "Fuentes, a white nationalist activist who gained national prominence after he attended the 2017 Unite the Right rally in Charlottesville, Virginia, has praised Russian President Vladimir Putin as “brilliant” in recent days as he ordered his military to invade Ukraine.",
    "That’s why, for the past year, McCarthy and Scalise have been reluctant to publicly criticize or discipline any rank-and-file members — particularly those in the ultraconservative Freedom Caucus who are closely aligned with Trump, like Greene and Gosar.",
    "A year ago this month, all House Democrats — along with 11 Republicans — voted to boot Greene off her two committees after it was revealed that her past Facebook posts espoused antisemitic conspiracy theories and violence against Democratic politicians.",
    "WASHINGTON — GOP leaders in the House and the Senate on Monday denounced a pair of far-right Trump allies — Reps. Marjorie Taylor Greene, R-Ga., and Paul Gosar, R-Ariz. — for speaking at a gathering of white nationalists in Florida over the weekend.",
    "The weekend’s episode further highlighted the thin tightrope that McCarthy, Scalise and other House GOP leaders are walking as they try to win back the majority in November and position themselves for the top leadership roles in 2023.",
    "House Minority Leader Kevin McCarthy, R-Calif., told reporters for CNN and Punchbowl News that it was “appalling and wrong” for the two lawmakers to attend the meeting in Florida and that he plans to discuss the matter with them.",
    "“And voters have a choice to make all across the country on whether they want to increase the concentration of white supremacists in the Congress by continuing to elect and re-elect Republicans who embrace that philosophy.\"",
    "And in November, all House Democrats and two Republicans voted to censure Gosar and remove him from his committees after he tweeted an anime video depicting him killing Rep. Alexandria Ocasio-Cortez, D-N.Y.",
    "But to get there, they are taking extreme caution not to anger former President Donald Trump, the de facto leader of the GOP, or his top allies on Capitol Hill, whose support they may need in the future.",
    "“I went to his event ... to address his very large following, because it’s a very young following, and it’s a generation I’m extremely concerned about.”\nGosar has been silent about the controversy.",
    "Both were involved in an effort last year to launch an “America First Caucus” to protect “Anglo-Saxon political traditions”; the idea was dropped after members of both parties panned it.",
    "The party should not be associated any time, any place with somebody who is antisemitic,” said McCarthy, who recently returned from leading a delegation of House Republicans to Israel.",
    "“It’s my understanding Marjorie had condemned the remarks that the leader of that group made, and obviously he made some statements that were racist and antisemitic,\" Scalise said.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nGreene defended her appearance, telling a CBS News reporter that she knew very little about Fuentes.",
    "1 goal for a handful of people in this town is to become speaker next Congress,” said a House Republican who requested anonymity to speak about GOP leadership.",
    "“There’s no place in the Republican Party for white supremacists or anti-Semitism,” Senate Minority Leader Mitch McConnell, R-Ky., said in a terse statement.",
    "A GOP victory in the fall midterms would be likely to catapult McCarthy and Scalise into the speaker’s and the majority leader’s offices, respectively.",
    "“There’s no place in America for antisemitism, for hate speech and thought that any race is purer than any other,” Scalise told NBC News.",
    "“It’s unbecoming for a member of Congress to speak at an event that’s promoted by anyone who espouses those views,” Banks told NBC News.",
    "Before he introduced Greene in Orlando, Fuentes appeared to offer praise for Adolf Hitler, to whom Democrats have been comparing Putin.",
    "In the latter two instances, Democrats forced floor votes after McCarthy refused to take disciplinary action against Greene and Gosar.",
    "McCarthy has said he would put Gosar and Greene back on their committees if Republicans win the House in the midterm elections.",
    "Gosar attended the Fuentes event last year in person and addressed the gathering over the weekend in a recorded video.",
    "They don’t shun candidates who are running for Congress with their party who embrace white supremacists,” she said.",
    "Former Secretary of State Mike Pompeo tweeted that Greene was “playing footsie” with “anti-Semitic neo-Nazis.\"",
    "And Rep. Jim Banks, R-Ind., the head of the conservative Republican Study Committee, also did not mince words.",
    "“Now they’re going on about Russia and Vladimir Putin is Hitler — they say that’s not a good thing,” he said.",
    "Fuentes then urged the crowd to rally behind Russia in its war with Ukraine; the crowd chanted back: “Putin!",
    "I do not know what his views are, so I am not aligned with anything that is controversial,” Greene said.",
    "Putin!”\nGet the Morning Rundown\nGet a head start on the morning's top stories.",
    "His office did not immediately respond to a request for comment.",
    "“They fan the flames of those who are white supremacists.",
    "Controversy is nothing new for Greene and Gosar.",
    "“There’s no place in our party for any of this.",
    "I have never heard him speak.",
    "“I do not know Nick Fuentes.",
    "I have never seen a video.",
    "“The No.",
    "..."
  ]
}