{
  "id": 13302,
  "mediaId": 2676,
  "date": "2022-02-28",
  "headline": "\"I have morons on my team\": Mitt Romney blasts radical Republicans in Congress",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/02/greene-romney-gosar-0228221.jpg",
  "link": "https://www.salon.com/2022/02/28/i-have-morons-on-my-team-mitt-romney-blasts-radical-in-congress/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.salon.com/writer/jon-skolnik",
  "termIds": [
    2187,
    2443,
    2994,
    4039,
    4148,
    5583,
    1126,
    6569,
    6360
  ],
  "sentences": [
    "Rep. Liz Cheney, R-Wyo., who is spearheading the investigation into the January 6 Capitol riot, condemned the event this week, accusing Greene of \"using her official USG congressional account to promote anti-Semitic, white supremacist, pro-Hitler, pro-Putin conference.\"",
    "Sen. Mitt Romney, R-Utah, called Reps. Marjorie Taylor Greene, R-Ga., and Paul Gosar, R-Ariz., \"morons\" on Sunday after the two House lawmakers attended a white nationalist event whose participants heaped praise on Russia for invading Ukraine.",
    "The event, organized by white nationalist and Holocaust denier Nick Fuentes, featured a number of conservatives firebrands known for their off-color rhetoric, including Arizona state Sen. Wendy Rogers, Idaho Lt.",
    "Several Republicans, including Fox News host Tucker Carlson and Donald Trump, have walked back their praise of Russian President Vladimir Putin as civilian and military casualties continue to mount.",
    "Following her appearance, Greene attempted to dissociate herself from Fuentes, telling CBS News, \"I don't know what his views are, so I'm not aligned with anything that may be controversial.\"",
    "\"I went to his event last night to address his very large following because that is a young, very young, following and a generation I am extremely concerned about,\" the lawmaker added.",
    "Most participants ostensibly elided or downplayed Russia's recent invasion into Ukraine, which was launched last week on the heels of months of brinkmanship along the Ukrainian border.",
    "Romney's comments came in response to Greene and Gosar's presence at the America First Political Action Conference (AFPAC), held this past weekend in Orlando, Florida.",
    "Over the past week, Republicans have been uncharacteristically divided on the Russian invasion, lacking any unified message as to whether Putin should be condemned.",
    "Thus far, Russia has failed to overtake any key Ukrainian cities, casting strong doubt over prior speculation that the invasion would be carried out quickly.",
    "\"I have to think anybody that would sit down with White nationalists and speak at their conference was certainly missing a few IQ points,\" the senator added.",
    "Last week, Trump called Putin's unprovoked incursion \"genius,\" arguing that the Russian leader has \"taken over a country for $2 worth of sanctions.\"",
    "But during an appearance at the Conservative Political Action Conference (CPAC) this past weekend, Trump condemned the Russian attack \"appalling.\"",
    "\"I'm reminded of the old line from the 'Butch Cassidy and the Sundance Kid' movie, where one character says, 'Morons, I have morons on my team.'\"",
    "Monday marks the fifth day of Putin's invasion, with Russian forces continuing the edge their way into the heart of Kyiv, the Ukrainian capital.",
    "However, Fuentes addressed the issue head-on, prompting the crowd to give a \"round of applause for Russia.\"",
    "\"Marjorie Taylor Greene and Paul Gosar, I don't know them,\" Romney said during a CNN interview.",
    "\"We are praying for the proud people of Ukraine,\" said the former president.",
    "Governor Janice McGeachin, and former Maricopa County sheriff Joe Arpaio.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "The crowd immediately erupted into cheers, chanting, \"Putin!",
    "Subscribe to our morning newsletter, Crash Course.",
    "\"House GOP Leaders,\" Cheney tweeted.",
    "\"Have you lost all sense of decency?",
    "\"God bless them all.\"",
    "Putin!\"",
    "Putin!"
  ]
}