{
  "id": 13432,
  "mediaId": 8475,
  "date": "2022-03-16",
  "headline": "Republicans in Congress file suit to end mask mandate for air travel",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/031622_airport_mask_1.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/nationworld/report/031622_mask_mandate_airports/republicans-congress-file-suit-end-mask-mandate-air-travel/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Fischler",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/78548",
  "termIds": [
    2443,
    2082,
    2426,
    3618,
    5384,
    1489,
    253,
    1433
  ],
  "sentences": [
    "The members complained in the suit that in the two years since public health measures meant to curb the spread of the coronavirus began, “Americans have been subject to an increasing amount of government overreach … This is a case seeking to remedy one such overreach.”\nIn a statement, Rosendale railed against “the fearmongering narrative of COVID-19.”\n“The CDC has forced Americans to wear masks on commercial flights for two years without legal standing,” Rosendale said.",
    "In addition to Biggs and Gosar, that list includes Dan Bishop of North Carolina, Lauren Boebert of Colorado, Andrew Clyde and Marjorie Taylor Greene of Georgia, Warren Davidson of Ohio, Bob Good of Virginia, Brian Mast and Bill Posey of Florida and Matt Rosendale of Montana.",
    "Seventeen Republican members of Congress, including Arizona’s Andy Biggs and Paul Gosar, have sued the U.S. Centers for Disease Control and Prevention, seeking an end to the federal rule requiring passengers on commercial flights and in airports to wear masks.",
    "A quartet of Republican senators, including Mississippi’s Roger Wicker, the ranking member of the Senate Commerce Committee, which oversees air travel, held a press conference Tuesday to also call for an end to the mandate.",
    "Everywhere but an airport — looks a lot like a shopping mall to me.”\nWicker added that the constituent groups involved in air travel, including the airlines and flight attendants, were ready for the mandate to end.",
    "The members, who are paid $174,000 a year, also said the cost of purchasing masks caused them “ongoing financial harm.”\nRepresentatives for the CDC did not return a message seeking comment Tuesday.",
    "“A mandate is not law, and Congress never passed legislation codifying the CDC’s mask wearing demands.”\nConcerned about keeping quality reporting alive in Tucson?",
    "U.S. Rep. Thomas Massie and U.S. Sen. Rand Paul, both of Kentucky, are the first members listed on the suit, which they filed in federal court in that state.",
    "The Republican opposition highlighted the difficulty of enforcing the remaining mandates related to the COVID-19 pandemic while many others fall away.",
    "Republican Sen. James Lankford, of Oklahoma, noted that masks are no longer required on school buses, but are on public transportation.",
    "But it comes at a time of increasing political pressure to end mandates of all kinds amid falling case numbers throughout the country.",
    "Mandates removed\nThe suit challenges the federal government’s legal authority to enforce the mandate at any point in the pandemic.",
    "The mandate illegally restricts the lawmakers’ freedom and is not backed by legal authority, they said in the suit filed Monday.",
    "Multiple local and state governments, including those led by Democrats, have relaxed public health measures in recent weeks.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "“People can sit shoulder to shoulder in restaurants across the land now, without a mask,” Wicker said.",
    "The CDC extended the air travel mandate last week to April 18.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "“All we’re looking for is basic consistency,” he said.",
    "Support TucsonSentinel.com with a contribution today!",
    "They asked the court to step in to lift the rule.",
    "Fifteen other GOP House members joined.",
    "Thanks for reading TucsonSentinel.com.",
    "It had been set to expire March 18.",
    "“They can go to malls.",
    "- 30 -"
  ]
}