{
  "id": 14102,
  "mediaId": 8251,
  "date": "2022-03-17",
  "headline": "Valley doctor concerned over federal funding winding down for uninsured COVID patients",
  "image": "https://media.12news.com/assets/KPNX/images/795f5309-59a6-4de5-8a25-5a89eb08d0db/795f5309-59a6-4de5-8a25-5a89eb08d0db_1140x641.jpg",
  "link": "https://www.12news.com/article/news/health/coronavirus/valley-doctor-concerned-over-federal-funding-winding-down-soon-for-uninsured-covid-patients/75-2385279b-0fdd-4c17-8027-586871a7541e",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In response to 12 News’ inquiry about the additional funding, Sen. Mark Kelly’s office released the following statement:\n“Senator Kelly will keep working in the Senate to ensure Arizonans have access to vaccines, boosters, and testing so that parents can continue to safely send their kids to school, our businesses can stay open, and we can grow our economy.” – Kelly spokesperson\nUntil it’s done in D.C. Southwell said he would keep going.",
    "Sen. Mitt Romney (R-Utah), sent a letter to President Joe Biden questioning the need for additional funding, after Congress has already allocated trillions of dollars to battle the pandemic, and asked for accountability of how the money has been spent.",
    "However, the spokesperson for HRSA said COVID-19 vaccines will still have to be given to people at, \"no out-of-pocket cost\" to recipients because of the Centers for Disease Control and Prevention’s Requirements for COVID-19 Vaccination Program.",
    "“It will be back more people are going to die, we still need the things that we've learned we can do.”\nThe White House released a fact sheet this week detailing what could happen in funding doesn’t come from Congress to replenish the programs.",
    "We will continue to provide all mandated benefits for COVID testing, vaccines, and treatments as we have since the beginning of the pandemic,” Paige Rothermel, Chief Operating Officer of Blue Cross Blue Shield of Arizona said in the statement.",
    "“The most important of which is in South Phoenix, where we see about 230 uninsured patients on average every day, seven days a week with testing, consultation, treatment, and vaccination services,” Southwell said.",
    "“The pharmaceutical companies must keep accurate records of side effects and release that data more timely with updates so that patients are not duped, mislead or simply uninformed about the potential risks.",
    "“Since the beginning of the pandemic, I have been adamant that Americans—especially people from lower-income households—should not have to foot the bill for COVID-19-related medical expenses.",
    "As it stands right now, the White House said providers can no longer submit claims to be reimbursed for testing and treatment for COVID come Tuesday, and for providing vaccines come April 5.",
    "It is my expectation that leadership will allow debate and amendments to any funding bill where consumer protection and transparency will be highlighted and ensured,” Gosar said in part.",
    "In emailed statements, Reps. Ruben Gallego (D-Ariz.) and Greg Stanton (D-Ariz.) both called on Congress to get funding secured for the COVID-19 treatments, testing and vaccines.",
    "ARIZONA, USA — Federal funding to help those who are uninsured get COVID testing, vaccines and treatments will start to run out next week unless Congress passes new funding.",
    "A spokesperson for Rep. Raul Grijalva (D-Ariz.) said Grijalva, \"was prepared to vote in favor of the supplemental funding\" and would still support the additional money.",
    "Only Blue Cross Blue Shield of Arizona responded to 12 News’ questions via email, saying in a statement:\n“We meet regularly to align benefits with our members’ needs.",
    "Come Tuesday, the White House warns the money to reimburse doctors and other medical providers helping uninsured patients with testing and treatment will run out.",
    "“We see about 230 uninsured patients on average every day, seven days a week – with testing, consultation, treatment and vaccination services,” Southwell said.",
    "Southwell said he was notified two days ago that the federal program that reimburses providers to help patients with COVID will start to run out next week.",
    "In a few weeks on April 5, the White House said providers would no longer be reimbursed for administering the COVID-19 vaccine to uninsured people.",
    "“We're in a situation where we're in a bit of a lull, but you can see in Europe, the new BA2 variant is causing another surge,” Southwell said.",
    "“I’m disappointed that Congress hasn’t yet reached a deal on how to fund the next steps of our efforts to defeat COVID,” Stanton said in part.",
    "Rep. Paul Gosar (R-Ariz.) said in a statement to 12 News he would continue to support more funding for COVID testing, treatments and vaccines.",
    "12 News contacted UnitedHealthcare, Aetna, Humana, Cigna and Blue Cross Blue Shield of Arizona about how the costs could affect their members.",
    "Federal funding to help uninsured patients get COVID testing, treatment and vaccines will start to run out next week unless Congress acts.",
    "The Provider Relief Fund is distributed through the Health Resources and Services Administration (HRSA) from pandemic relief money.",
    "The federal government will also no longer be able to purchase more doses of monoclonal antibodies, according to the White House.",
    "Adding, health centers that treat patients regardless if they can pay or not, can be found at the HRSA Find a Health Center tool.",
    "Last week, The House was set to include COVID relief funding in a broader spending bill but excluded money to fund pandemic aid.",
    "The White House also warned the federal government would also not be able to secure enough vaccine booster doses for everyone.",
    "Southwell said since the beginning of the pandemic, he and his clinic has expanded to help serve those who needed health care.",
    "The spokesperson recommended individuals order at-home tests from the federal government at no cost through COVIDtests.gov.",
    "Only by keeping this commitment and investing in worldwide vaccination can we end this pandemic,” Gallego said in part.",
    "They’re going to avoid getting care and more people are going to get closer to being unsavable,” Southwell said.",
    "Our benefit designs are compliant with all state and federal requirements and are not driven by federal funding.",
    "A spokesperson for HRSA said providers are generally reimbursed $40 for providing the vaccine.",
    "“What are people going to do when they hear they’re no longer going to get this care for free?",
    "One Valley doctor said this could impact hundreds of patients his practice serves each week.",
    "12 News contacted all of Arizona’s representatives and senators for comment on the issue.",
    "In a time of uncertainty, it’s been help that Dr. Tyler Southwell has wanted to provide.",
    "I’m going to lose money every single day until I can’t do it anymore,” Southwell said.",
    "However, Gosar said he wanted to see more transparency surrounding the COVID vaccine.",
    "Now, Southwell said his practice has grown to dozens of employees and three clinics.",
    "Catch up on the latest news and stories on the 12 News YouTube channel.",
    "And I am not going to shut my doors next week.",
    "It’s on Congress to pass more funding.",
    "And pray that we figured this out.",
    "“I have faith in this country.",
    "Subscribe today."
  ]
}