{
  "id": 1478,
  "mediaId": 2629,
  "date": "2022-02-14",
  "headline": "GOP Politicians Complain About Supply Chain While Promoting Trucker Blockade",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjkyNDg4Mi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY1NTcyOTcyNX0.GDq-RKnb9gMvTePtovhBYivX5XnmFRTPjX6peFtbJkY/img.jpg?width=1200&coordinates=0%2C59%2C0%2C59&height=600",
  "link": "https://www.nationalmemo.com/gop-2656662844",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Israel",
  "authorUrl": "https://www.nationalmemo.com/u/josh-israel",
  "termIds": [
    0
  ],
  "sentences": [
    "A group of Canadian truckers calling themselves a \"Freedom Convoy\" has spent the past few weeks blocking highways and bridges in the capital city of Ottawa and other places, including the Ambassador Bridge border crossing between Windsor, Ontario, and Detroit, Michigan.",
    "Kentucky Sen. Rand Paul told the right-wing website Daily Signal on Thursday, \"It'd be great\" if truckers shut down U.S. cities such as Los Angeles and Washington, D.C.\n“I hope the truckers do come to America, and I hope they clog up cities,\" he said.",
    "Members of the convoy caused a shutdown of local businesses, damaged government vehicles, attempted to force an Ottawa homeless shelter to give them food, waved swastika flags, desecrated Canada's National War Memorial, and impeded border crossings.",
    "While Republican politicians in the United States and their Fox News allies are abandoning the pretense of wanting \"law and order\" and cheering on the convoy, politicians in Canada, including Conservatives, have seen enough.",
    "Though experts say these extremists in trucks already have done significant damage to the economy and supply chains, some Republicans are openly urging American anti-vaccine activists to do the same thing at home.",
    "Their actions, they say, are in protest against COVID-19 safety mandates, including a requirement that unvaccinated truckers quarantine after reentering the country following visits to the United States.",
    "In a November op-ed for the West Kentucky Star, Paul wrote, \"Lately, you might have noticed an increase in prices at the gas pump, the grocery store, and pretty much everything else you can buy.",
    "Colorado Rep. Lauren Boebert cheered on a protest against vaccine mandates by city workers that took place on February 7 in New York City, encouraging protesters to shut down American bridges.",
    "But Saturday, Gooden told Fox News, \"I would absolutely welcome a similar pronouncement of protest in our nation's capital by truckers and anyone who wants their freedoms back.\"",
    "On February 10 he suggested that Democratic officials easing safety mandates as the omicron waves subside might really be doing so because of what was happening in Canada.",
    "Now, as Biden's administration works to address the challenges, many of the same Republicans are urging anti-vaccine protesters to take actions to make it worse.",
    "Rep. Paul Gosar of Arizona said in December, \"Our country is in the middle of a catastrophic supply chain crisis caused by Biden's incompetent administration.\"",
    "And after initially backing the protesters, the House of Commons interim Conservative Party Leader Candice Bergen also urged them to end their blockades.",
    "For months, congressional Republicans have been falsely blaming troubles with international supply chains on President Joe Biden and Democratic policies.",
    "Doug Ford, the premier of Ontario and a member of its Progressive Conservative Party, scolded the truckers on February 11 and told them to leave.",
    "The shelves at stores are empty, employers can't find workers to fill positions, and Americans everywhere are bracing for higher taxes.",
    "\"The United States didn't have a supply chain crisis until Joe Biden became president,\" Rep. Lance Gooden of Texas tweeted in October.",
    "In their America, it's seemingly okay to spend trillions of dollars, rack up copious amounts of debt, and ignore a crisis at hand.\"",
    "\"Your right to make a political statement does not outweigh the right of thousands of workers to make a living,\" he warned.",
    "The Canadian Freedom Convoy has sparked a fire in the hearts of patriots,\" Boebert tweeted on February 9.",
    "\"I believe the time has come to take down the barricades, stop the disruptive action, and come together.",
    "Eventually, the government stepped in and has been dispersing the wildly unpopular blockades.",
    "Back in November, she tweeted, \"Black Friday was better without supply chain shortages.\"",
    "The economy you want to see reopened is hurting,\" she said on February10.",
    "The last thing the [they] want is an American trucker convoy,\" he warned.",
    "\"Freedom is contagious and there's no vaccine that can shut it down.",
    "\"Welcome to Joe Biden's and the Democrats' socialist America.",
    "\"Now the Brooklyn Bridge has been shut down with protests.",
    "\"The Science hasn't changed, their poll numbers have.",
    "Let's take our nation back from medical tyranny!\"",
    "Oh and #freedomconvoy22 is making an impact.",
    "\"I believe this is not what you want to do.\"",
    "supply chain problems",
    "\"I'm all for it.\""
  ]
}