{
  "id": 1509,
  "mediaId": 2676,
  "date": "2022-02-18",
  "headline": "Kevin McCarthy breaks political tradition, endorses Liz Cheney's pro-Trump primary challenger",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/02/mccarthy-cheney-0218221.jpg",
  "link": "https://www.salon.com/2022/02/18/kevin-mccarthy-breaks-political-tradition-endorses-liz-cheneys-pro-primary-challenger/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.salon.com/writer/jon-skolnik",
  "termIds": [
    0
  ],
  "sentences": [
    "RELATED: Kevin McCarthy lashes out at 'illegitimate' Jan. 6 committee — says he'll refuse to testify\nHageman said in a response she is \"grateful for Leader McCarthy's strong support, and I pledge that when I am Wyoming's congresswoman, I will always stand up for our beautiful state and do the job I was sent there to do.\"",
    "It is rare for congressional leaders to openly attempt to influence primary races for or against their congressional colleagues, as The New York Times noted, and the move likely underscores escalating internecine tensions within the Republican Party around who is showing enough fealty to former President Donald Trump.",
    "And when Rep. Paul Gosar, R-Ariz., posted an anime-style video of himself murdering Rep. Alexandria Ocasio-Cortez, R-N.Y., McCarthy did not comment on Gosar's conduct until a week later, telling CNN: \"[Gosar] took the video down and he made a statement that he doesn't support violence to anybody.\"",
    "Over the past year, pro-Trump members of the GOP have primarily targeted Cheney and Rep. Adam Kinzinger, R-Ill., both of whom were censured earlier this month over their participation in the select House committee charged with investigating the Capitol riot.",
    "\"I look forward to welcoming Harriet to a Republican majority next Congress, where together, we will hold the Biden administration accountable and deliver much-needed solutions for the American people,\" McCarthy said in a statement.",
    "Not a representative that they have today that works closer with Nancy Pelosi, going after Republicans instead of stopping these radical Democrats from what they're doing to this country,\" the California Republican added.",
    "For instance, when Rep. Marjorie Taylor Greene, R-Ga., freshman firebrand known for her incendiary rhetoric, was facing calls for expulsion, McCarthy did not weigh in whether she should be.",
    "McCarthy's endorsement, first reported by The Federalist, came on Thursday for Harriet Hageman, a pro-Trump candidate and former Republican candidate for the governor of Wyoming.",
    "Cheney and Kinzinger have congress have been widely condemned by pro-Trump advocates as \"RINOs,\" or Republicans In Name Only.",
    "\"Wyoming deserves to have a representative who will deliver the accountability against this Biden administration.",
    "House Minority Leader Kevin McCarthy, R-Calif., has backed the primary challenger to Rep. Liz Cheney, R-Wyo.",
    "McCarthy, for his part, has until now stayed mostly mum when it comes to intra-party battles.",
    "\"The most successful representatives in Congress focus on the needs of their constituents.\"",
    "– a firm and official rebuke of Cheney's recent break from the rest of the party.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Subscribe to our morning newsletter, Crash Course."
  ]
}