{
  "id": 15397,
  "mediaId": 8345,
  "date": "2022-03-07",
  "headline": "GOP torn as Green, Gosar speak to far right group",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2022/03/07/GOP_torn_Gosar_web.jpg",
  "link": "https://kdminer.com/news/2022/mar/07/gop-torn-green-gosar-speak-far-right-group/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://kdminer.com/staff/associated-press/",
  "termIds": [
    2443,
    2765,
    2137,
    4039,
    4066,
    4267,
    392,
    1126,
    5949
  ],
  "sentences": [
    "McConnell offered no public comments, but said in a statement from his office: ’There’s no place in the Republican Party for white supremacists or anti-Semitism.”\nGreene defended her appearance at the America First Political Action Committee event, saying she will continue sharing her message to “every corner” of the U.S. She has said she did not personally know the organizer or his beliefs, and participated so she could speak to the large crowd.",
    "WASHINGTON - Republican leaders in Congress are torn over what to do with Rep. Marjorie Taylor Greene after the congresswoman spoke at a an event last month organized by a white nationalist who marveled over Russia’s invasion of Ukraine as the crowd erupted in chants of “Putin!” Rep. Paul Gosar (R-Arizona), who represents the Kingman area, spoke to the group by video.",
    "House Republican leader Kevin McCarthy called the congresswoman’s speech on the same stage “unacceptable.” Senate Republican leader Mitch McConnell said “there’s no place in the Republican Party for white supremacists.”\nYet it’s unclear whether Greene will face any further reprimand or rebuke for what is now an ongoing pattern of startling behavior.",
    "Another Republican Senate candidate, Gary Black, the agricultural commissioner, said in a Tuesday statement that Greene’s ideas and judgement “are a poison in the bloodstream of our party.”\nWhile McCarthy said he would be meeting with Greene, other Republicans were stepping in to offer their own views.",
    "“He won’t because she has power, let’s be honest, but I’m embarrassed by it.”\nThe scrutiny over the congresswoman, who remains an outlier on Capitol Hill, comes as most of Congress is largely unified in its condemnation of Russian President Vladimir Putin and its support of Ukraine.",
    "Greene kicked off the group’s weekend conference in Florida, which was billed as a far-right alternative to the more established Conservative Political Action Conference that drew Trump and other GOP elected officials to Orlando over the weekend.",
    "Putin!”\nFuentes said more than 1,000 had gathered for his event, the third and biggest so far, and that the “secret sauce” of the organization’s strength was “these young white men.” He mocked the Democrats’ mantra that diversity is a strength.",
    "“This may be a chance to burn out the cancer of the Republican Party — those that are, you know, Putin sympathetic,” said Rep. Adam Kinzinger, R-Ill., a former military pilot who broke with his party over the Trump presidency.",
    "This is not the first time Greene, of Georgia, has broken the norms of political behavior by associating with extremist groups, espousing conspiracy theories or musing about violence against politicians she disagrees with.",
    "But the organization is not unfamiliar to Greene or several other Republicans in Congress including Rep. Matt Gaetz, R-Fla., who has said they had briefly considered forming an America First Caucus in Congress.",
    "Ahead of President Joe Biden’s first State of the Union address, the invasion has proven to be a rare moment of common ground amid Democrats and Republicans as the U.S. defends the Western-style democracy.",
    "On Tuesday, Republican U.S. Sen. candidate Herschel Walker dropped plans to attend a “Shall Not Be Infringed” rally for gun rights that Greene is set to host this upcoming weekend in Rome, Georgia.",
    "Asked if Greene or the others should be kicked out of the GOP, Sen. Mitt Romney of Utah, once the party’s presidential nominee, said: “They should be laughed out.”\nSUBMIT FEEDBACK\nClick Below to:",
    "Asked to elaborate Tuesday as cameras were rolling during a press conference at the Capitol, McCarthy demurred, declining further response, as other Republican leaders and lawmakers stood by.",
    "He grew to prominence after the 2017 neo-Nazi march in Charlottesville that brought the far-right’s enthusiasm for Donald Trump into the streets during the first year of his presidency.",
    "The congresswoman was welcomed to the stage after Fuentes led the crowd of mostly white men into a rousing embrace of Russia, marveling at its show of strength invading Ukraine.",
    "McCarthy had previously suggested the Georgia congresswoman, who is now barred by Democrats from committees, would enjoy a promotion i f Republicans take control of the House.",
    "Shortly after taking off in 2021, the House voted to strip the new lawmaker of committee assignments over her views and actions, in a largely party-line vote.",
    "“Perdue has also been clear that Putin is a murderer and a thug who has been enabled by Biden’s weakness and must be stopped,” said spokesperson Jenni Sweat.",
    "It all shows the difficulty Republican leaders have combating the party’s drift toward Trump-style authoritarianism and embracing right-wing extremism.",
    "Walker no longer plans to speak at the rally, spokesperson Mallory Blount told The Associated Press on Tuesday, without giving a reason.",
    "The America First Political Action Committee was launched by Nick Fuentes, who is considered by anti-hate groups as a white nationalist.",
    "But David Perdue, who the former Republican senator who Trump is backing in a primary challenge to incumbent Gov.",
    "But he worries that McCarthy and other GOP leaders will stop short of kicking Greene out of the party.",
    "“For me, it was appalling and wrong,” McCarthy told reporters at the Capitol late Monday.",
    "Another, Rep. Paul Gosar, R-Ariz., who has also spoken to the group.",
    "“There’s no place in our party for any of this,” he had said.",
    "“Can we get a round of applause for Russia?” he asked.",
    "Brian Kemp, still plans to attend.",
    "The crowd chanted “Putin!",
    "Fallout has been mixed."
  ]
}