{
  "id": 1579,
  "mediaId": 2664,
  "date": "2022-02-16",
  "headline": "Arizona Republican hyping far-right event featuring notorious white nationalist: report",
  "image": "https://www.rawstory.com/media-library/wendy-rogers.jpg?id=27634534&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/nick-fuentes-2656686033/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    2443,
    4039,
    4647,
    1220,
    1126,
    1312,
    340,
    5949
  ],
  "sentences": [
    "But their friendliness with Fuentes and his “America First” movement signals an effort to ingratiate themselves with a younger generation of racists—an effort both cringe-worthy and at times downright dangerous for the Arizona politicians’ constituents,\" The Beast reported.",
    "Rogers announced her membership to the group several years ago and gave a speech for members in March 2021, while Gosar allegedly told an Arizona Oath Keepers leader that the U.S. was already in a civil war, 'we just haven’t started shooting yet.'",
    "\"Organized by white nationalist and 'Unite The Right' attendee Nick Fuentes, the conference is a watering hole for people who think the Conservative Political Action Conference (also next week) needs to use more slurs,\" Kelly Weill reported.",
    "('This is going to be the most racist, sexist, anti-Semitic, Holocaust-denying speech in all of Dallas this weekend,' Fuentes boasted of one of his upcoming speeches after he was kicked out of CPAC in 2021.)",
    "It’s the second year in a row that an Arizona politician has backed the conference, putting them in league with [Tim 'Baked Alaska' Gionet] and other legally challenged extremists.\"",
    "\"Fuentes has returned the favor, using Rogers’ posts to hype AFPAC and even hinting that the state senator might be involved, researcher Arizona Right Wing Watch reported.\"",
    "\"But the fringe conference is also playing footsie with elected officials, this year with Arizona State Senator Wendy Rogers, who promoted the event on Telegram.",
    "The America First Political Action Conference in Orlando is receiving a major boost from a prominent Arizona Republican, The Daily Beast reported Wednesday.",
    "\"Both Gosar and Rogers have well-documented ties to the militant right, particularly the paramilitary group the Oath Keepers.",
    "Rogers has authored at least two dozen fawning posts about Fuentes, according to Left Coast Right Watch,\" The Beast reported.",
    "Gosar recently defended Fuentes, who is described as a white nationalist by the Southern Poverty Law Center.",
    "The 2021 America First Political Action Conference was addressed by Rep. Paul Gosar (R-AZ).",
    "The conference is seen as a vehicle for Republicans to reach out to younger racists.",
    "\"The post was far from Rogers’ first in support of Fuentes, an open bigot."
  ]
}