{
  "id": 17103,
  "mediaId": 8387,
  "date": "2022-03-02",
  "headline": "Oath Keeper pleads guilty to seditious conspiracy in U.S. Capitol riot",
  "image": "https://www.gannett-cdn.com/presto/2021/03/12/USAT/db2cb0ef-0d55-4172-9701-7208296cffa5-Joshua_James.jpg?crop=358,202,x0,y38&width=358&height=202&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/local/arizona/2022/03/02/joshua-james-pleads-guilty-seditious-conspiracy-capitol-riot/9351314002/",
  "mediaOutlet": "Northwest Valley Republic: Local news headlines for Surprise, Anthem, Sun City, Sun City West and Youngtown Arizona - azcentral.",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Anne Ryman",
  "authorUrl": "https://www.azcentral.com/staff/2684130001/anne-ryman/",
  "termIds": [
    5398,
    4905,
    2879,
    2443,
    939,
    226
  ],
  "sentences": [
    "'I've got morons on my team':Sen. Mitt Romney hits Reps. Paul Gosar, Marjorie Taylor Greene\nThe alleged co-conspirators — 10 men and one woman — traveled from multiple states to the Washington, D.C. area, where prosecutors say they set up arsenals of weapons, ammunition and supplies at hotels just across the river in Arlington, Virginia.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nThe other 10 defendants have pled not guilty to the criminal charges.",
    "Joshua James, a co-defendant in a criminal case involving Oath Keepers founder Stewart Rhodes, pleaded guilty Wednesday in federal court to charges of seditious conspiracy and obstruction related to the U.S. Capitol riot.",
    "A guilty plea is potentially problematic for the 10 other co-defendants in the high-profile criminal case, who are accused of acting by force to prevent, hinder or delay laws related to the transfer of presidential power.",
    "Prosecutors say the defendants were part of a conspiracy led by Rhodes to disrupt the Electoral College process on Jan. 6, 2021, and prevent the transfer of presidential power from President Donald Trump to Joe Biden.",
    "He and another defendant, Robert Minuta, are accused of riding in a golf cart to the aid of their Oath Keeper colleagues on Jan. 6, \"swerving around law enforcement vehicles\" to join the mob outside the Capitol.",
    "Federal prosecutors say that James and Minuta parked their golf carts near the Capitol complex and continued on foot to join their colleagues, whom they had been in communication with earlier that day.",
    "As part of a \"statement of offenses,\" James signed along with his plea agreement, he admitted that a few days later, on Jan. 8, he met up with Rhodes at an Alabama restaurant.",
    "As part of his plea, the 34-year-old James agreed to cooperate with law enforcement and prosecutors, including testifying before grand jury and sitting for interviews.",
    "About 140 police officers were injured and four people died that day, as a mob stormed the Capitol and temporarily halted the counting of Electoral College votes.",
    "The use of QRFs was nothing new, and it's \"disingenuous\" of the government to portray them as an invasion force, his attorneys wrote in a recent court filing.",
    "Court documents allege they organized into so-called \"quick reaction forces,\" or QRFs, and stood ready to deliver those weapons if the call came from Rhodes.",
    "But five of the charges were dismissed in exchange for pleading guilty to one-count seditious conspiracy and one-count obstruction of an official proceeding.",
    "Judges also consider the recommendations made by the pre-trial services department along with information from prosecutors and defense attorneys.",
    "Prosecutors say James entered the historic building, where he grabbed the vest of a metropolitan police officer and pulled him toward a mob.",
    "Judge Mehta asked him during the late afternoon video hearing from Washington, D.C.\n\"Yes sir,\" James replied in a soft, southern accent.",
    "More than 725 people have been charged and about 165 have pleaded guilty to various federal charges related to the Capitol riot.",
    "Prosecutors asked U.S. District Court Judge Amit P. Mehta to defer sentencing to ensure James cooperates to their satisfaction.",
    "There, Rhodes expressed gratitude for James' actions and told him to alter his physical appearance to conceal his identity.",
    "Mehta estimated that because James has no prior criminal history, he could face from 7.25 to nine years in prison.",
    "They maintain he recruited people to provide security at rallies, as the Oath Keepers have done in the past.",
    "James, an Army veteran from Alabama, provided security for Trump ally Roger Stone while in Washington, D.C.",
    "Five of them, including 63-year-old Vallejo of Phoenix, are being detained while awaiting trial.",
    "Rhodes is the 56-year-old founder and leader of the far-right extremist group the Oath Keepers.",
    "Seditious conspiracy is one of the 57 federal crimes under the terrorism enhancement statute.",
    "James had faced seven federal charges, including assaulting, resisting or impeding officers.",
    "He yelled, \"Get out of my Capitol,\" and \"This is my (expletive) building,\" prosecutors say.",
    "Another court hearing in the case is scheduled for 1 p.m. Eastern Time on Friday.",
    "Phoenix resident and political activist Edward Vallejo is among those charged.",
    "Reach the reporter at anne.ryman@arizonarepublic.com or 602-444-8072.",
    "\"Are you pleading guilty Mr. James because you are, in fact, guilty?\"",
    "Attorneys for Rhodes have denied he led any alleged conspiracy.",
    "But the judge cautioned that was just an estimate.",
    "A conviction can carry a 20-year prison sentence.",
    "Follow her on Twitter @anneryman.",
    "Subscribe to azcentral.com today.",
    "Support local journalism."
  ]
}