{
  "id": 17116,
  "mediaId": 2727,
  "date": "2022-02-27",
  "headline": "US Rep. Taylor-Greene slammed for addressing white supremacist gathering",
  "image": "https://static.timesofisrael.com/www/uploads/2022/02/063_1372989627-1024x640.jpg",
  "link": "https://www.timesofisrael.com/us-rep-taylor-greene-slammed-for-attending-white-supremacist-gathering/",
  "mediaOutlet": "Time of Israel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "TOI staff and Agencies",
  "authorUrl": "",
  "termIds": [
    2240,
    4591,
    4039,
    3896,
    883,
    1125,
    1126,
    6678
  ],
  "sentences": [
    "“I’m also not going to turn down the opportunity to speak to 1,200 young America First patriots because of a few off-color remarks by another speaker, even if I find those remarks unsavory.”\nAt the AFPAC meeting, Fuentes said, “Now they’re going on about Vladimir Putin and Russia, and Vladimir Putin is Hitler – and they say that’s not a good thing.”\n“I shouldn’t have said that,” he said, and then burst into laughter, drawing approval from the audience.",
    "Taylor Greene also attended that event, where she told reporters that “Putin is a murderer and he should never have invaded Ukraine.” Former US president Donald Trump was there too, offering praise for “smart Putin” and saying the invasion of Ukraine only happened because of what he falsely claims was a rigged election in the US to oust him from office.",
    "“This has absolutely no place in the Republican Party.”\nHowever, Taylor Greene refused to back down and tweeted that “I am not going to play the guilt by association game in which you demand every conservative should justify anything ever said by anyone they’ve ever shared a room with.”\n“I’m not going to be drawn into that.",
    "Advertisement\nLast February, Senate Republican leader Mitch McConnell called her embrace of conspiracy theories and “loony lies” a “cancer for the Republican Party.” The Democratic-led House that same month tossed her from her two committee assignments, the House Education and Labor Committee and the House Budget Committee.",
    "Republican US Rep. Marjorie Taylor Greene was facing calls that she be booted from her party after she spoke at a white supremacist conference on Friday night where the organizer joked that comparing Russian President Vladimir Putin to Nazi Germany dictator Adolf Hitler should be a compliment.",
    "“In any other world, Greene speaking at a white supremacist conference where attendees have defended Vladimir Putin and praised Adolf Hitler would warrant expulsion from the caucus, to say nothing of her advocacy for violence and consistent anti-Semitism,” the DNC said.",
    "The Georgia congresswoman defended her appearance at the America First Political Action Conference organized by Nicholas J. Fuentes, who has questioned the number of Jews who were killed in the Holocaust and believes that Israel has a malicious influence on US policy.",
    "Advertisement\n“It is appalling and outrageous that a member of Congress would share a platform with an individual who has actively spread antisemitic bile, mocked the Holocaust and promoted dangerous anti-Israel conspiracy theories,” the RJC said in a statement.",
    "On social media, she has voiced support for racist views, unfounded QAnon pro-Trump conspiracy theories such as the lie that the 2020 election was stolen, and calls for violence against Democratic politicians, including House Speaker Nancy Pelosi of California.",
    "Advertisement\nHe also said that “the US government has become the evil empire in the world.”\n“Now they’re going on about Vladimir Putin and Russia and Vladimir Putin is Hitler and they say that’s not a good thing.",
    "In January Twitter said it had permanently banned Taylor Greene’s personal account due to misinformation on COVID-19 policy, but the ban does not affect her official Twitter account, @RepMTG.",
    "“White supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party,” McDaniel said according to a report from USA Today on Saturday.",
    "As The Times of Israel's Diplomatic Correspondent, I'm well aware that Israel's security, strategy and national interests are always scrutinized and have serious implications.",
    "Financial support from readers like you allows me to travel to witness both war (I just returned from reporting in Ukraine) and the signing of historic agreements.",
    "(Laughter)”pic.twitter.com/NsCUXbQzb4\n— Steven Dennis (@StevenTDennis) February 26, 2022\nNumerous social media platforms have banned Fuentes for his views.",
    "And it enables The Times of Israel to remain the place readers across the globe turn to for accurate news about Israel's relationship with the world.",
    "If it's important to you that independent, fact-based coverage of Israel's role in the world exists and thrives, I urge you to support our work.",
    "The AFPAC was organized as an alternative to the more mainstream Conservative Political Action Conference, held the next day in the same city.",
    "It takes balance, determination, and knowledge to accurately convey Israel's story, and I come to work every day aiming to do so fully.",
    "The Republican Jewish Coalition said it “condemns in the strongest possible terms” Taylor Greene’s participation in the AFPAC.",
    "The Democratic National Committee said in a statement that the Republican party should expel Taylor Greene.",
    "Democrats along with Republican National Committee chairperson Ronna McDaniel criticized Taylor Greene.",
    "The first-term congresswoman has repeatedly stirred controversy over inflammatory commentary.",
    "Israel is now a far more prominent player on the world stage than its size suggests.",
    "Arizona Republican congressman Paul Gosar also appeared via pre-recorded video.",
    "Will you join The Times of Israel Community today?",
    "Thank you,\nLazar Berman, Diplomatic Correspondent",
    "I’m only responsible for what I say,” she wrote.",
    "(Smiles) I shouldn’t have said that."
  ]
}