{
  "id": 17150,
  "mediaId": 8350,
  "date": "2022-03-04",
  "headline": "Valley Ukrainian man describes family’s life in the country during conflict with Russia",
  "image": "https://ktar.com/wp-content/uploads/2022/03/GettyImages-1238852910-scaled-e1646348516831.jpg",
  "link": "https://ktar.com/story/4927458/valley-ukrainian-man-describes-familys-life-in-the-country-during-conflict-with-russia/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "TAYLOR TASLER",
  "authorUrl": "https://ktar.com/story/author/ttasler/",
  "termIds": [
    0
  ],
  "sentences": [
    "“At the most maybe they are going to get food somewhere if they can… but in terms of leisure that’s obviously not happening anymore.”\nHe added the Ukrainian American community in the state is devastated to see these attacks happening in the 21st century.",
    "Igor Borisevich, a member of the Ukrainian American community in Arizona, said he has family in western Ukraine as well as the southwest part of the country in the cities of Lviv and Odesa.",
    "Borisevich said the Ukrainian community in Arizona has received a lot of support from local leaders and the U.S. government, as well as members of the Russian community.",
    "“We’ve seen a lot of Russians actually support Ukraine, to be honest, because they understand that they’re kind of hostages of their own regime,” Borisevich said.",
    "Borisevich said his family is staying put at the moment, but he knows a lot of families who live in the areas where there is warfare going on.",
    "Borisevich is also a member of the Ukrainian American Society in Tucson, which has organized multiple events in support of Ukraine.",
    "“Every day they hear sirens in the city, a lot of people are hiding in bomb shelters,” he told KTAR News 92.3 FM.",
    "PHOENIX — A Valley Ukrainian man with family still in the country calls the conflict with Russia very unsettling.",
    "He said the goal of these demonstrations is to gain as much support for Ukraine as they can.",
    "The group on Sunday will hold a rally in Tucson at 1:00 p.m. in the Jácome Plaza in Tucson.",
    "“They’re currently not working, nobody’s obviously going out anywhere,” Borisevich said."
  ]
}