{
  "id": 17543,
  "mediaId": 8251,
  "date": "2022-02-28",
  "headline": "'I've got morons on my team': Mitt Romney chastises Arizona Rep. Paul Gosar for supporting white nationalist rally",
  "image": "https://media.12news.com/assets/KPNX/images/eb0bbe51-a949-4179-a7c2-9684675d8d95/eb0bbe51-a949-4179-a7c2-9684675d8d95_1140x641.jpg",
  "link": "https://www.12news.com/article/news/politics/morons-team-mitt-romney-chastises-arizona-rep-paul-gosar-supporting-white-nationalist-rally/75-6a71a7c3-0a13-4ec3-a144-a15028d56f0c",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Sen. Mitt Romney (R-Utah) invoked a quote from Butch Cassidy and the Sundance Kid when referencing Gosar and Rep. Marjorie Taylor Greene (R-Ga.)\nGosar and Greene were featured at the “America First Political Action Conference” in Florida that was organized by Nick Fuentes.",
    "Fuentes was marked as a white supremacist by the DOJ and advocacy groups, and he has been a public apologist for Vladimir Putin even as Russia’s invasion of Ukraine is condemned by the U.S. and Western allies.",
    "“It’s evil.”\nAs Rep Marjorie Taylor Greene and Rep Paul Gosar speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "PHOENIX — One of the nation’s top Republican leaders called Arizona Rep. Paul Gosar a “moron” who is “missing a few IQ points” for his ongoing support for a purported white nationalist.",
    "“Anybody that would sit down with white nationalists and speak at their conference was certainly missing a few IQ points,” Romney, a former presidential nominee, said.",
    "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\nTrack all of our current updates with Arizona politics on our 12 News YouTube channel.",
    "Gosar was censured by the House last November after tweeting an edited anime clip that showed him killing Rep. Alexandria Ocasio-Cortez.",
    "Greene was kicked off committee assignments in the House after spreading conspiracy theories and endorsing violence on social media.",
    "“There is no place in either political party for this white nationalism or racism,” Romney said.",
    "All Americans should renounce this garbage and reject the Putin wing of the GOP now.",
    "Greene was physically present at the rally while Gosar appeared through a video.",
    "The 63-year-old Arizona lawmaker was at last year’s rally in person.",
    "Neither Gosar nor Greene are strangers to controversy.",
    "Subscribe for updates on all of our new uploads."
  ]
}