{
  "id": 2143,
  "mediaId": 2547,
  "date": "2022-02-10",
  "headline": "Ali Alexander Was Mysteriously Paid Thousands Just After 1/6 Subpoena",
  "image": "https://crooksandliars.com/files/primary_image/22/02/ali_alexander_for_020922_cl.jpg",
  "link": "https://crooksandliars.com/2022/02/ali-alexander-mysteriously-paid-6000-just",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NewsHound Ellen",
  "authorUrl": "https://crooksandliars.com/team/newshound-ellen",
  "termIds": [
    2426,
    2443,
    4770,
    5592,
    3627,
    1536,
    226,
    39
  ],
  "sentences": [
    "Its letter noted that in the weeks before the January 6th attack, Alexander repeatedly suggested using violence to accomplish Stop the Steal’s goals and that he “claimed to have been in communication with the White House and members of Congress regarding events planned to coincide with the certification of the 2020 Electoral College results” at the Capitol on Jan. 6, 2021.",
    "One week later, a mysterious deposit of $6,000 was made by a dormant super PAC called “Stop the Steal” into the account of Alexander’s old consulting firm, The Daily Beast’s Roger Sollenberger reported Wednesday:\n“Stop the Steal” received just one contribution, for $11,000, on the last day of 2020.",
    "His friend Daniel Bostic—an aspiring model and actor who Alexander once helped promote with a number of fake Bostic “celebrity” fan websites and Twitter accounts—was on the original organizational filings, however.",
    "You may recall that Ali Alexander, a felon formerly known as Ali Akbar, has claimed that he planned the Jan. 6th rally preceding the Capitol insurrection with Congressmen Paul Gosar, Mo Brooks and Andy Biggs.",
    "Sollenberger further explains how Alexander’s moves now make it unclear which federal agency has regulatory power over Stop the Steal and what is now covered by the congressional subpoena.",
    "He doesn't recall who was in attendance because there was no roll call of attendees because the call was so large.”\nThere’s an awful lot that Alexander seems determined to conceal.",
    "Since the subpoena and Alexander’s $6,000 windfall, he has sued to stop Verizon from turning over his phone and internet records to the January 6th committee.",
    "According to the PAC, the donor info became unavailable because the payment platform had cut it off and cut off access because of its connection to 1/6.",
    "In this case, however, it seems Alexander—a longtime small-time GOP operative, conspiracy theorist, and key architect of Jan. 6—made that impossible.",
    "The money, however, came from a donor whose name, address, occupation, and employer are all listed as “unknown.”\nThis was a problem.",
    "The PAC said it was working to get the donor information and would file an amended report once that information was received.",
    "Although the PAC sure seems connected to Alexander, he also seems to have gone to great lengths to make it seem otherwise.",
    "But Alexander took steps after the riot to cover those digital tracks, scrambling domains for numerous websites he owned.",
    "Federal election law requires committees to disclose that donor information, or at least make “best efforts” to do so.",
    "Alexander’s complaint indicated a case of lawyerly amnesia about who took part in “an organizing call” last January.",
    "And website data shows that the “Stop the Steal PAC” site belongs to Alexander’s company, Vice and Victory.",
    "ABC News quotes from the complaint: “Members of Congress might have been present and some were invited.",
    "More from TDB:\nFurthermore, Alexander’s name has never been linked to the PAC in official documents.",
    "He filed the suit shortly after he was deposed by the committee for eight hours in early December.",
    "But the questions for the rest of us remain: Who gave the PAC the $11,000 and why?",
    "Alexander was subpoenaed by the January 6th committee on October 7, 2021.",
    "I’ll leave the legal questions up to the feds, at least for now.",
    "None of the three congressmen has admitted to knowing Alexander.",
    "And why was Alexander so hell-bent on muddying so many records?",
    "Was it only to obscure his own role or was there more to hide?"
  ]
}