{
  "id": 2200,
  "mediaId": 2664,
  "date": "2022-02-07",
  "headline": "Paul Gosar endorses ‘dumbest guy in Congress’ in primary against Texas AG Ken Paxton",
  "image": "https://www.rawstory.com/media-library/rep-paul-gosar.jpg?id=29282652&width=1200&coordinates=0%2C50%2C0%2C0&height=600",
  "link": "https://www.rawstory.com/louie-gohmert-ken-paxton/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1847,
    2426,
    2443,
    3621,
    4596,
    99,
    1126,
    6653
  ],
  "sentences": [
    "I am grateful to have your support, @DrPaulGosar!https://twitter.com/drpaulgosar/status/1490547793064169475\\u00a0\\u2026\n— Louie Gohmert (@Louie Gohmert) 1644241186\nIN OTHER NEWS: Mike Pence killed his political future after four years of 'cozying up' to Trump\nMike Pence killed his political future after four years of 'cozying up' to Trump",
    "Gohmert: When I took it, did very well.. I\\u2019m sure that shocks people who think I\\u2019m the dumbest guy in Congresspic.twitter.com/4U63Qb3dYu\n— Acyn (@Acyn) 1621534070\nGosar described Gohmert as \"smart\" while writing the Texas Republican \"is one of the most principled America First members of Congress.",
    "Controversial Rep. Paul Gosar (R-AZ) is taking a stand in a GOP primary two states to the east as Republicans battle each other in the 2022 midterms.",
    "\"In this pic he is standing up against the DC Gulag with me,\" he said, posting a picture with Reps. Andy Biggs (R-AZ) and Matt Gaetz (R-FL).",
    "Gosar endorsed Rep. Louie Gohmert (R-TX) in his campaign against Republican Texas Attorney General Ken Paxton.",
    "Gohmert has infamously taken to the House floor to deny his reputation as the dumbest member of Congress.",
    "Gohmert wrote he was \"grateful\" to have the support of the controversial Arizona Republican.",
    "Biggs, Gaetz, Gohmert, and Gosar all all members of the far-right House Freedom Caucus.",
    "He would make a great Attorney General for Texas.\"",
    "He’s smart, hard working and relentless."
  ]
}