{
  "id": 2320,
  "mediaId": 2573,
  "date": "2022-02-08",
  "headline": "Rep. Rosendale introduces bill to block military assistance to Ukraine until US border is secured",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/02/GettyImages-1230425162.jpg",
  "link": "https://www.foxnews.com/politics/rep-rosendale-introduces-bill-block-military-aid-ukraine-us-border-secured",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4007,
    5384,
    4905,
    1126,
    1477,
    6569,
    6672,
    6286,
    6526
  ],
  "sentences": [
    "But Rosendale’s bill seeks to bring attention back to the southern border, where there were 178,840 migrant apprehensions in December alone, capping a year that saw massive migrant numbers as well as drugs such as fentanyl pouring into the U.S.\n\"I think it's quite hypocritical if someone in the U.S. Congress is willing to expend funds to secure a border overseas thousands of miles away while they're not willing to secure our own border,\" Rosendale told Fox News Digital in an interview.",
    "Cosponsors on the bill include Reps. Andy Biggs, R-Ariz., Bob Good, R-Va., Matt Gaetz, R-Fla., Paul Gosar, R-Ariz., Jody Hice, R-Ga., Mary Miller, R-Ill., Ralph Norman, R-S.C., and Bill Posey, R-Fla.\nRosendale said the prioritizing of the southern border reflects what he believes are the priorities of his constituents, who are concerned about things like the flood of fentanyl coming into Montana and other states.",
    "\"We witnessed an invasion over the last year of two million individuals trying to get into the country, we’re not even sure how many of them have been successful, so lets build the border wall system, let's gain operational control of our southern border, and then we might be able to have a conversation about what we’re going to do overseas about securing someone else’s border,\" Rosendale said.",
    "FIRST ON FOX: Rep. Matt Rosendale, R-Mont., on Tuesday introduced legislation that would block security and military assistance to Ukraine until the U.S. southern border is secured -- the latest example of Republican concern that Ukraine’s border security is being prioritized over American border security.",
    "\"And we have war hawks on both sides of the aisle willing to go over there and spend American blood and treasure in Ukraine and what I'm saying is we’re not obligated and so at least the minimum we can do is secure our own border first if you are going to go over there and spend money.\"",
    "The Secure America’s Border First Act would prohibit the expenditure or obligation of military and security assistance to Kyiv until there is \"operation control\" of the U.S.-Mexico border – where the border crisis is moving into its second year.",
    "\"They’ve spent several years trying to secure that southern border and haven't been able to accomplish that prior to having any discussions about Ukraine so I find it hard to believe now that they're going to do both,\" he said.",
    "Rosendale’s bill would hold funds back until the border wall system, which was halted by the Biden administration, is completed, and \"operational control\" as defined by the 2006 Secure Fence Act is achieved.",
    "DEMOCRATS' UKRAINE BILL TOUTS ‘INVIOLABILITY OF BORDERS,' WHILE PARTY IGNORES US BORDER CRISIS\nThere is growing concern in Washington D.C. about the Russian buildup of forces at the Ukrainian border.",
    "Rosendale’s bill is the latest Republican contrast between the focus on Ukraine and the situation at the southern border, although assistance for Ukraine does retain broad bipartisan support.",
    "Rep. Madison Cawthorne, R-N.C., said in December that \"until we get our own southern border secured, I don't give a damn about the border conflict in Ukraine,.\"",
    "The wall system is defined as a 30-foot-high steel bollard barrier, with all-weather access and patrol roads, perimeter lighting, cameras and detection tech.",
    "\"Biden is unwilling to defend our southern border, yet he's willing to send troops overseas to protect another nation's border,\" Hagerty tweeted.",
    "U.S. combat forces have arrived in Poland this week amid fears that a Russian invasion of Ukraine could see Kyiv fall within days.",
    "\"We need to demonstrate our resolve & take action, & that sort of action needs to be in the form of sanctions—sanctions now.\"",
    "\"And we are witnessing not a threat, but we are witnessing an absolute invasion that is taking place right now.\"",
    "This month, Sen. Bill Hagerty, R-Tenn., used the comparison to make the case for sanctions on Russia instead.",
    "He also rejected the idea that Washington could both secure the border and protect Ukraine.",
    "He said that the U.S. \"has no legal or moral authority to come to Ukraine's aid.\""
  ]
}