{
  "id": 234,
  "mediaId": 8345,
  "date": "2022-02-22",
  "headline": "Community View | Election integrity is the most important political conversation",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2016/08/03/KDM-Community-Viewpoint-thumbnail.jpg",
  "link": "https://kdminer.com/news/2022/feb/22/community-view-election-integrity-most-important-p/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "HR1 creates a standardized election process for federal races (not state races), which might be contrary to the Constitution (which grants the states elections power), but it does not “strip away state and local control to nationalize our elections.” HR1 is about federal elections for federal positions.",
    "But, the legislation allows for a sworn statement as an alternate provision for federal races only for those whose ID does not meet requirements of current ID laws, such as for those living on reservations with no standardized addresses.",
    "Then let Congressman Gosar know what you support, and what you want him to negotiate for compromised change to HR1, because reform IS badly needed, and because that is how work gets done for the people.",
    "Your constituents need you to work for them – all of them – not divide them further with politically divisive mailings in a official capacity, which means taxpayer-funded political division.",
    "Election integrity is, perhaps, the most important political conversation in which we are engaged as a state and nation, because there are legitimate concerns that need to be addressed.",
    "The legislation proposes some changes to election ID laws, but it does not “ban voter ID laws.” Section [1903] clarifies that if a state requires ID to vote, ID is still required.",
    "This month’s Real Change website PACtion organizes the proposed HR1 legislation into user-friendly layers, so you can see the structure of the legislation in “biteable” pieces.",
    "And you can go as deep as you want into the layers, even to click on every single individual section to read the original text of the legislation passed by the House.",
    "Because, much of what’s in the HR1 legislation we already have in effect in Arizona, so it’s not anywhere near as “radical” as Gosar wants us all to believe it is.",
    "There are provisions for public funding options, just like we already have in Arizona through the Clean Elections legislation passed by Arizona voters.",
    "But it does not “force taxpayer funding for federal elections.” Sections 5101 through 5104 introduces a “My Voice” voucher pilot program.",
    "And, while I agree with Gosar that there are “problems” with HR1, where I disagree most is with his divisive approach.",
    "Taxpayers are not going to pay $1,200 for every $200 contribution, no matter how badly campaign finance needs reform.",
    "Gosar’s mailing has grains of truth, but they are not the political evil he is trying to paint them to be.",
    "Although, it is inconceivable how any reasonable adult can justify a 6x match of “small” contributions.",
    "Congressman Paul Gosar recently sent a mailing vilifying the Democrats for trying to pass reform.",
    "And, Sections 5111 through 5221 are provisions for some public funding for federal races.",
    "The February PACtion pops up as the “splash” page, or under the PACtion menu.",
    "To Mohave County readers, please don’t take my word, or Gosar’s word.",
    "(J’aime Morgaine is the PAC Executive Director of Real Change.)",
    "Stop automatically voting “no,” and work for compromise.",
    "Stop obstructing, and work for common ground.",
    "The website is easy: www.RealChangePAC.com.",
    "Please read the legislation for yourself.",
    "Look for the common ground; it is there.",
    "Election reform is a nonpartisan issue.",
    "Look at the legislation for yourself.",
    "Form your own opinion.",
    "Gosar is right.",
    "Gosar is right.",
    "Gosar is right.",
    "So, yes.",
    "No."
  ]
}