{
  "id": 2657,
  "mediaId": 2752,
  "date": "2022-02-08",
  "headline": "Paul Gosar's Fave White Nationalist Will Be Really Hurt If You Say He's Not A Real Incel",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTI4MzM5OC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY2MTQxNTQzOX0.jYn5hplaSqm71yN-nT8dvfmFcMtU2bBHWJsseVdxeFI/img.png?width=1200&coordinates=0%2C0%2C0%2C408&height=600",
  "link": "https://www.wonkette.com/paul-gosar-s-fave-white-nationalist-will-be-really-hurt-if-you-say-he-s-not-a-real-incel",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robyn Pennacchia",
  "authorUrl": "https://www.wonkette.com/u/robyn_pennacchia",
  "termIds": [
    0
  ],
  "sentences": [
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nRobyn Pennacchia\nRobyn Pennacchia is a brilliant, fabulously talented and visually stunning angel of a human being, who shrugged off what she is pretty sure would have been a Tony Award-winning career in musical theater in order to write about stuff on the internet.",
    "Also, late last month, Rep. Paul Gosar, who held at least two fundraising events with Fuentes last year, defended Fuentes on Gab, writing, \"The phony January 6th Committee's partisan witch-hunt continues as they have now set their sights on young conservative Christians like Nick Fuentes.",
    "This came as a surprise to absolutely no one who is somewhat aware of his existence, and also to anyone listening to the show at that time — during which the 23-year-old said that women shouldn't be allowed to vote and described the Taliban's treatment of women as \"ideal.\"",
    "During his \"America First\" show, Fuentes explained that he doesn't want a relationship, because all he wants is \"revenge against my enemies and a total Aryan victory,\" and criticized those calling him a \"fakecel\" by saying they would tell Hitler he too was a \"fakecel.\"",
    "In December of last year, Nick Fuentes, the white nationalist leader of the Groyper Army and darling of GOP officials Paul Gosar and Wendy Rogers, announced on \"You Are Here,\" a rightwing chat show hosted by Glenn Beck's The Blaze, that he had never had a girlfriend.",
    "Perhaps there needs to be a new term, for both Fuentes and all the Men Going Their Own Way out there, in which there is mutual agreement between a particularly repulsive man and the entire world population of women that neither want anything to do with one another.",
    "By the time January rolled around, Fuentes was describing himself as a \"proud incel,\" saying that he was choosing to \"be an historical figure\" over having relationships with women — adding that he might get married at some point, but would still be an \"incel.\"",
    "They want relationships and/or sex but don't have them, frequently because of how they are repulsive assholes who spend their lives posting unbelievably misogynistic — and often racist — nonsense on message boards with other men who hate women.",
    "Like Arizona state Sen. Wendy Rogers, a Republican (obviously) who swooned hard last month when Fuentes called her \"based,\" a term Fuentes has explicitly said means that someone is \"racist, sexist, anti-Semitic.\"",
    "Just look at how thrilled these upstanding Republican members of Congress are to be associated with someone who says they can't be in a relationship with anything other than \"total Aryan victory.\"",
    "Now Fuentes is getting into slapfights with other self-identified incels who say he is a \"fakecel\" or a \"volcel\" (voluntary celibate) because he admitted to having kissed a girl in high school.",
    "Some of us might describe this as something else entirely — either aromantic or asexual or both or something else involving not wanting to have sexual or romantic relationships with women.",
    "But he also doesn't want to date and claims he is \"involuntarily celibate\" because his lack of desire to have a sexual or romantic relationship with a woman is something he was born with.",
    "But Fuentes is a bigot who likely just wants to align himself with an extreme misogynist movement best known for the number of times its adherents have committed mass murder.",
    "Fuentes is also repulsive, misogynistic, and racist, and it seems highly likely that were he to pursue dating, he would not have many takers.",
    "Wonkette is independent and fully funded by readers like you.",
    "This is pure political persecution and it has to stop.\"",
    "Of course, \"incels\" are \"involuntarily\" celibate.",
    "Of course, there are always exceptions.",
    "Follow her on Twitter at @RobynElyse",
    "How often would you like to donate?",
    "Which is not what that means.",
    "Click below to tip us!"
  ]
}