{
  "id": 2811,
  "mediaId": 2520,
  "date": "2022-02-01",
  "headline": "Gosar defends white nationalist Nick Fuentes on social media site Gab",
  "image": "https://www.gannett-cdn.com/presto/2021/11/10/PPHX/b07fb40c-5fd5-4f3b-83a9-fe439d1b08d4-AP21313299334094.jpg?crop=5999,3374,x0,y31&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/02/01/gosar-defends-familiar-ally-white-nationalist-nick-fuentes-gab/9205303002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tara Kavaler",
  "authorUrl": "https://www.azcentral.com/staff/6030226001/tara-kavaler/",
  "termIds": [
    2443,
    4039,
    3049,
    1220,
    1394,
    526,
    6520
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nFuentes sparked national attention after attending the 2017 white nationalist rally in Charlottesville, the same year he started his live stream show \"America First with Nicholas J.",
    "In a Jan. 24 Gab post, Gosar defended extremist Nick Fuentes, whom the Southern Poverty Law Center describes as a white nationalist:\n\"The phony January 6th Committee's partisan witch-hunt continues as they have now set their sights on young conservative Christians like Nick Fuentes.",
    "He was censured by the U.S. House of Representatives in November and was stripped of all committee assignments after posting an anime-style video in which he kills Rep. Alexandria Ocasio-Cortez, D-N.Y.\nGosar deleted the tweet after widespread criticism and ahead of the censure vote.",
    "It serves as an alternative location for people to share unvarnished views, including hate speech, that likely would be removed for violating more mainstream platforms' terms of service agreements.",
    "Gosar was invited to join Gab last August and joined the site in November, after encouragement from Gab CEO Andrew Torba and months of a #getgosarongab social media campaign.",
    "Gosar, who represents Arizona's 4th Congressional District, tends to tweet more frequently from his professional and his personal Twitter account than on Gab.",
    "The Chicago Tribune reported that Fuentes' accounts have been removed from most popular social media platforms like Facebook, Youtube, TikTok and Instagram.",
    "@realnickjfuentes\"\nFuentes, who the Anti-Defamation League also calls a white supremacist leader and organizer, responded on Gab: \"Thank you Congressman!\"",
    "The fringe social media network rose to prominence in 2018, after becoming known as the site du jour of the Tree of Life Synagogue shooter in Pittsburgh.",
    "Gosar skipped a February 2021 House vote on COVID-19 relief to attend a Fuentes-organized America First Political Action Committee conference in Florida.",
    "The two were supposed to hold a fundraiser last year, although Gosar denied his attendance despite being featured in the invitation with Fuentes.",
    "The ADL says Gab is \"rife with white supremacist, hateful, anti-Semitic bigotry\" and is the \"Extremists' Online Destination of Choice.\"",
    "Rep. Paul Gosar has found a new home on social media where he can continue to push the boundaries of acceptable political discussion.",
    "Gab can act as a new online forum for those who have been barred from participating in the more commonly-used online sites.",
    "He also addressed the same crowd as former President Donald Trump in Washington on Jan. 6, 2021, before the Capitol riot.",
    "As of Monday, Gosar's personal Twitter account had nearly 148,000 followers after five years and more than 5,700 tweets.",
    "He has also been barred, according to the paper, from mobile cash payment apps like Venmo, PayPal and Stripe.",
    "While Gosar frequently posts similar items on Twitter and Gab, selected posts are exclusive for the latter.",
    "She can be reached by email at tara.kavaler@arizonarepublic.com or on Twitter @kavalertara.",
    "Established in 2016, Gab is a social networking site that attracts the ultra-right-wing.",
    "His personal Gab account had more than 114,000 followers since November and 147 posts.",
    "The Southern Poverty Law Center calls Gab an \"organizing hub for white supremacists.\"",
    "Moments after the censure, he retweeted a post that included the violent animation.",
    "This includes Gosar's shout-out to Fuentes, who was kicked off Twitter last July.",
    "Gosar did not respond to The Arizona Republic's request for comment.",
    "Tara Kavaler is a politics reporter at The Arizona Republic.",
    "This is pure political persecution and it has to stop.",
    "Gosar is no stranger to social media controversy.",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "Fuentes.\""
  ]
}