{
  "id": 2869,
  "mediaId": 2627,
  "date": "2022-02-02",
  "headline": "GOP's Paul Gosar goes to Gab to cry for subpoenaed white nationalist buddy",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220202-ROB-Gosar-Crying-White-Nationalists-jg-b20720.jpg",
  "link": "https://www.msnbc.com/the-reidout/reidout-blog/republicans-gosar-gab-rcna14537",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ja'han Jones",
  "authorUrl": "https://www.msnbc.com/author/ja-jones-ncpn371241",
  "termIds": [
    0
  ],
  "sentences": [
    "Below, for example, is a member of the Jan. 6 committee sharing a fundraising flyer with both men on it, reportedly posted to one of Fuentes’ social media accounts:\nIt’s also noteworthy that Gosar framed the Jan. 6 committee’s investigation as an attack on “young conservative Christians,” because it apiece with his previous efforts to connect with and uplift young, conservative extremists.",
    "On Tuesday, The Arizona Republic brought to light a post Gosar shared last week on Gab — a social media platform popular among right-wing extremists — in which he complained about investigators looking into Fuentes’ actions after the 2020 election.",
    "The committee is also looking into a large Bitcoin payment Feuntes allegedly received from a French national ahead of the Jan. 6 attack and whether the payment was part of a coordinated effort to sow doubt in President Joe Biden’s election victory.",
    "His anti-democratic views apparently align with Gosar’s, which explains why the congressman has attended Fuentes’ white nationalist events, touted projects Fuentes has worked on and frequently interacts with Fuentes on social media.",
    "Rep. Paul Gosar, R-Ariz., seems to have a soft spot in his heart for white nationalists — particularly Nick Fuentes, who was recently subpoenaed by the House Jan. 6 committee over his potential involvement in the Capitol riot.",
    "Recommended\nLast year, the House voted to censure Gosar for sharing online a photoshopped anime video of him appearing to kill Rep. Alexandria Ocasio-Cortez , D-N.Y., and attack Biden.",
    "In the weeks leading up to the attack, Fuentes spoke at and organized rallies meant to spread former President Donald Trump's lie that the 2020 election was rigged against him.",
    "\"The phony January 6th Committee’s partisan witch-hunt continues as they have now set their sites on young conservative Christians like Nick Fuentes,\" he wrote.",
    "Fuentes reportedly replied, “Thank you Congressman!”\nThat friendly exchange between the two men wasn’t the first time they’d crossed paths.",
    "Fuentes is well known in conservative and white nationalist circles, as a leader of the “America First’’ extremist movement.",
    "As I wrote last month, the Jan. 6 committee is investigating what role Fuentes may have played in the Capitol riot.",
    "Gosar's ongoing support for Fuentes should be seen as part of that embarrassing act, as well.",
    "He's been called out for sharing violent extremist and white nationalist memes online.",
    "He told colleagues he does these things to appeal to a younger audience.",
    "\"This is pure political persecution and it has to stop.\"",
    "But on Gab, Gosar painted Fuentes as a victim."
  ]
}