{
  "id": 2903,
  "mediaId": 4040,
  "date": "2022-02-02",
  "headline": "What’s Up With Wendy Rogers’ Adoration of Nick Fuentes?",
  "image": "https://files.rightwingwatch.org/uploads/nick-fuentes-1.png",
  "link": "https://www.rightwingwatch.org/post/whats-up-with-wendy-rogers-adoration-of-nick-fuentes/",
  "mediaOutlet": "Right Wing Watch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kristen Doerer",
  "authorUrl": "https://www.rightwingwatch.org/post_author/kristen-doerer/",
  "termIds": [
    0
  ],
  "sentences": [
    "He also claimed to be a “proud incel”—a term to describe men who are involuntarily celibate and often blame women for their problems—who doesn’t have time for relationships or sex because he’s too busy becoming a “historical figure.”\nRogers, for her part, became a MAGA celebrity by traveling the country questioning the results of the 2020 presidential election and calling for the fraudulent audit in Arizona.",
    "While the exchange may seem innocuous to the uninitiated, the adoration between the two—a 23-year-old white nationalist who says his own mother is afraid of him and a state legislator who raised $2.5 million last year for reelection—is strange let alone troubling.",
    "In 2017, Fuentes took part in the white supremacist Unite the Right gathering in Charlottesville, Virginia, that left one dead; two years later, he sympathized with the El Paso shooter’s white supremacist manifesto.",
    "She has also claimed to be a member of the Oath Keepers, a far-right anti-government group that saw some of its members attack the U.S. Capitol on Jan. 6 and whose leader now faces seditious conspiracy charges.",
    "While her social media is rife with “groyper” content—from conversations about Bitcoin to links to the white nationalist-affiliated VDARE—her campaign speeches are focused almost exclusively on the Big Lie.",
    "Arizona state Rep. Wendy Rogers thanked white nationalist Nick Fuentes for his support on Telegram Wednesday in the latest exchange between the two expressing mutual admiration.",
    "Media Matters documented Rogers’ praise and defense of Fuentes over the past year, which included this line: “I am officially based because Nick Fuentes says I’m based.",
    "Last month, he was subpoenaed by the House select committee investigating Jan. 6 for his role in potentially coordinating events that took place that day.",
    "It is like knighthood.”\nIn case you’re wondering what “based” is, let us provide you with Nick Fuentes’ definition: “It means racist, sexist, antisemite.",
    "He has denied the Holocaust, launched into antisemitic tirades, and suggested interracial marriages cause drug use.",
    "Following that subpoena, another politician from Arizona, Rep. Paul Gosar, was quick to come to his defense.",
    "Eventually people will show up and support what I am trying to do.”\n“This post goes so hard,” Fuentes added.",
    "https://t.co/iq8ldPGXmw pic.twitter.com/iDmzTfIUKa\n— Right Wing Watch (@RightWingWatch) January 17, 2022",
    "On Tuesday, Fuentes shared a Jan. 31 post from Rogers in which she wrote, “I don’t really want friends.",
    "Just this past month, Fuentes used the N-word, then defended his use of it.",
    "That’s what it means.”\nNick Fuentes: \"Do you know what 'based' means?",
    "Wednesday’s exchange is just the latest between the two.",
    "We are behind you 100%.”\n“Thank you @nickjfuentes!",
    "Fuentes has a long history of extremism.",
    "It means racist, sexist, antisemite.",
    "“We support you Wendy Rogers!!!",
    "I want to do what is right.",
    "That's what it means.\"",
    "” Rogers replied."
  ]
}