{
  "id": 2997,
  "mediaId": 2553,
  "date": "2022-02-01",
  "headline": "Squad Member Ilhan Omar Makes Her Decision Regarding 2022 Run",
  "image": "https://dw-wp-production.imgix.net/2022/02/Untitled-design-17-copy-7.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/squad-member-ilhan-omar-makes-her-decision-regarding-2022-run",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dillon Burroughs",
  "authorUrl": "https://www.dailywire.com/author/dillon-burroughs",
  "termIds": [
    5813,
    2298,
    3049,
    3448,
    5756,
    5132,
    4066,
    392,
    6396,
    6441
  ],
  "sentences": [
    "pic.twitter.com/pwVHE7xXQm\n— Ilhan Omar (@IlhanMN) February 1, 2022\nOmar is seen as controversial among many Americans over her progressive views that have included calls to defund police as well as attacks against Israel that have been noted as anti-semitism on multiple occasions:\nOmar was slammed by Jewish organizations for the anti-Semitic outburst, which is just the latest example in a long history of anti-Semitic remarks.",
    "https://t.co/hsj1v6u4yI\n— StopAntisemitism.org (@StopAntisemites) June 29, 2021\nHouse Minority Leader Kevin McCarthy said in an interview in January that if Republicans win control of the House in 2022 that he is kicking at least three Democrats off of certain committees, including Omar.",
    "The Daily Wire reported:\nMcCarthy made the remarks in an interview with Breitbart News and said that the move comes in light of to Democrats kicking two Republicans — Reps. Marjorie Taylor Greene (R-GA) and Paul Gosar (R-AZ) — off their committees.",
    "pic.twitter.com/3LhuOuXEff\n— Mike Berg (@MikeKBerg) October 25, 2021\nThe Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "Before we kickoff our reelection campaign, we thought it might be fun to look back at the last three years and try this challenge where progressive leaders share everything they’ve gotten done in under two minutes.",
    "But this new standard which these Democrats have voted for—if Eric Swalwell cannot get a security clearance in the private sector, there is no reason why he should be given one to be on Intel or Homeland Security.",
    "Omar became the first Somali American elected to Congress in 2018 and was re-elected in 2020 with 64% support in Minnesota’s 5th District against Republican challenger Lacy Johnson.",
    "Additionally, she passed another 48 bills through the House, introduced 100 more, and co-sponsored nearly 1,100 more bills and amendments,” the report added.",
    "House Speaker Nancy Pelosi (D-CA) said a couple of weeks ago that she “did not rebuke” Omar for comparing the U.S. and Israel to terrorist organizations.",
    "“This is a new level of what the Democrats have done.”\nOmar also made headlines in October 2021 for blasting her own state’s Minneapolis police force.",
    "“One, the police have chosen to not fulfill their oath of office and to provide the public safety they are owed to the citizens they serve, right?",
    "Other members include Reps. Jamaal Bowman (NY), Cori Bush (MO), Alexandria Ocasio-Cortez (NY), Ayanna Pressley (MA), and Rashida Tlaib (MI).",
    "In a video prior to her re-election announcement, Omar posted a video to show her accomplishments over the past three years in the House.",
    "The Minneapolis Police Department is the most dysfunctional police department, in our state and probably in the country,” she said.",
    "Ilhan Omar accuses police of not fulfilling their oath of office and blames them for the rise in violent crime in Minneapolis.",
    "The progressive congresswoman has long been associated with a radical group of House Democrats referred to as the Squad.",
    "“The Democrats have created a new thing where they’re picking and choosing who can be on committees,” McCarthy said.",
    "“Never in the history [of Congress] have you had the majority tell the minority who can be on committee.",
    "Something I said to myself and to the voters over and over: I believe that a better world is possible.",
    "He will not be serving there.”\n“Ilhan Omar should not be serving on Foreign Affairs,” McCarthy said.",
    "Minnesota Democratic Rep. Ilhan Omar announced on Monday that she will seek re-election in 2022.",
    "Shocking – Ilhan Omar refusing to take ANY accountability for her obscene antisemitism.",
    "When will this vile bigot finally be censured and properly reprimanded by her party?",
    "“Omar has passed eight bills and amendments into law during her first two terms.",
    "I still believe that,” Omar said in a statement on Monday, according to WCCO.",
    "“When I first ran for this office there was one thing I kept coming back to.",
    "Instead she has the audacity to blame Jewish members of Congress.",
    "Get inside access to The Daily Wire by becoming a member.",
    "is our remix: 3 years in… more or less 3 minutes.",
    "But even before that, it was documented.",
    "Enough is enough!",
    "It’s documented.",
    "Here ??",
    "??"
  ]
}