{
  "id": 3014,
  "mediaId": 8345,
  "date": "2022-02-03",
  "headline": "Mohave County Lincoln Day Dinner set for Saturday, Feb. 12",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2022/02/03/Gosar_web.jpg",
  "link": "https://kdminer.com/news/2022/feb/03/mohave-county-lincoln-day-dinner-set-saturday-feb-/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "According to the release, Pestritto has published seven books, including “Woodrow Wilson and the Roots of modern Liberalism and American Progressivism.”\nElected officials set to attend the event include Rep. Leo Biasiucci (R-Lake Havasu City) and State Sen. Sonny Borrelli (R-Lake Havasu City).",
    "KINGMAN – Tickets are now on sale for the 75th annual Lincoln Day Dinner, the annual fundraiser for the District 1 Mohave County Republican Central Committee, set for 5:30 p.m. Saturday, Feb. 12 at Beale Celebrations, 201 N. 4th St.",
    "Candidates set to attend include Matt Salmon, cofounder of the Freedom Caucus and candidate for Arizona governor, as well as Jim Lamon, candidate for U.S. Senate and advocate of America First, education and border security.",
    "Tickets, which cost $65 per person, are now on sale from 10 a.m. to 4 p.m. Mondays through Thursdays and 10 a.m. to 3 p.m. Fridays at the GOP office at 2116 Stockton Hill Road, Ste.",
    "Food for the evening will come courtesy of Chef Luigi Garabaldi, with the menu selection set to include Lincoln’s favorite foods such as beef bourguignon and apple pie.",
    "The theme for the evening is “Freedom.”\nRonald J. Pestritto, graduate dean and professor of politics at Hillsdale College, will be the evening’s keynote speaker.",
    "The committee wrote in a news release that this year’s fundraiser coincides with the birthday of Abraham Lincoln, the 16th president of the United States.",
    "Rep. Paul Gosar (R-Prescott) will speak at the event, as will local educator Wayne Eder, an American Civil War living historian.",
    "There will also be a live auction, silent auction and 50/50 drawing.",
    "Questions and reservations can be directed to 928-279-1411.",
    "B."
  ]
}