{
  "id": 3591,
  "mediaId": 2578,
  "date": "2022-01-22",
  "headline": "DC Judge Orders Prominent J6 Political Prisoners Joe Biggs and Ethan Nordean to Notorious DC Gulag From their Local Jails Away from Families",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/IMG_3152-1.jpg",
  "link": "https://www.thegatewaypundit.com/2022/01/dc-judge-orders-prominent-j6-political-prisoners-joe-biggs-ethan-nordean-notorious-dc-gulag-local-jails-away-families/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Engels",
  "authorUrl": "https://www.thegatewaypundit.com/author/jacobengels/",
  "termIds": [
    1849,
    2370,
    4066,
    3590,
    1093,
    572
  ],
  "sentences": [
    "The hearing discusses Biggs’ concerns over the lack of access to phones to communicate with his counsel in the DC jail as “not so good.” The men also raised concerns over COVID-19, which have left J6 political prisoners on lockdown without visitation for 30-days or more, to which the judge replied…\nBoth Nordean and Biggs assert that they would not have access to in-person visits with their attorneys in the DOC, in part due to COVID-19 and the procedures now in place because of the current rise in cases.",
    "A DC federal judge overseeing the case against Proud Boys Joseph Biggs and Ethan Nordean has again responded to their December request to re-open their bail proceedings, which he has already denied, by ordering the men to be transferred from the local jails they are currently being housed (in Seattle for Nordean and Central Florida for Biggs) to the infamous DC jail that has become known as the “DC Gulag” for the horrendous conditions faced by J6 political prisoners.",
    "MUST SEE VIDEO: Greene, Gaetz, Gohmert, and Gosar Release “Unusually Cruel” Report on DC Jail and Unusual and Cruel Treatment of J6 Defendants\nThe DC judge claims that their initial arguments for a reconsideration of their bond status and pre-trial release in order to better prepare for trial were unfounded, citing that the government’s solution of simply transferring them to the DC jail was “less drastic” than early release pending trial.",
    "Moreover, according to the Gov- ernment, those parties are working to create an e-discovery room “where January 6 defendants will be able to review discovery and share notes about discovery materials with their attorneys.”\nRecently released former Proud Boys Chairman Enrique Tarrio told this GP journalist that it seems the government has misinformed the judge about the realities of what actually goes on in the DC jail.",
    "I was denied that right on numerous occasions and actually had to meet with my attorney in a hallway with guards within earshot, which does not protect privileged conversations.”\nBiggs and Nordean argued that the wait times to obtain a laptop in the DC jail can take up to 30 days, when both men need every minute possible to review over 15,000 hours of footage from January 6th in preparation for their mid-May trial.",
    "Furthermore, Judge Kelly argues that the political prisoners’ concerns over the lack of reliable technology in the DC jail that would allow them to review evidence and interact with their attorneys as “not persuasive.”\nIn the DOC, the Government represents, defendants can make legal calls lasting up to 30 minutes at a time during their five-hour recreation period.",
    "Members of Congress Matt Gaetz, Marjorie Taylor Greene, Louie Gohmert and Paul Gosar released a report on the conditions in the DC jail in early December titled “Unusually Cruel.”\nThe US Marshals also recently inspected the prison to their own shock and dismay, releasing their own critical report which even far-left DC Mayor Muriel Bowser has vowed to address.",
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nThe decision was appealed on December 27th, which was followed by a status conference on January 11th, according to the response filed by Judge Timothy Kelly on January 21st ordering the men to be transferred to DC.",
    "And the Government represents that the DOC has been working with it and the Federal Public Defender for the District of Columbia to provide January 6 defendants with access to an electronic discovery database through their educational tablets.",
    "Both question how easily, and for how long, those detained at the DOC can access laptops to review discovery—asserting that the wait for a laptop is “no less than a month” and that the laptops quickly run out of battery power.",
    "Denial of cancer medications, feces water flowing into inmate cells and abuse by prison guards are just a handful of the abhorrent circumstances that TGP has reported on over the past year.",
    "Likely temporary like two-weeks to “slow the spread” and second dose/booster/regular boosters according to the ever evolving “rules” dictated by Dr. Anthony Fauci.",
    "Every January 6 defendant has been provided an educational tablet, whichallows “confidential messaging communication between defendants and their attorneys.” Id.",
    "That means you have an hour total each day to exercise outside of your cell, take phone calls, shower and review evidence for your case, which is unreal.",
    "He concluded by arguing that they will have to be housed in the DC jail for their May 18 trial, so the idea of moving them in 5-months early is logical.",
    "The issue of how long the laptops held a charge is also discussed, with the judge claiming that access to “some” technology is STILL technically ACCESS.",
    "There is literally a message at the top of the tablet informing you that there is no privacy and that everything is being monitored.",
    "He lived the horrors of the DC jail for nearly 6-months before being released a little over a week ago.",
    "Joseph Biggs is a decorated combat veteran who earned two Purple Hearts serving in the War on Terror.",
    "Both Biggs and Nordean are fathers who are currently being housed close to their respective families.",
    "But those measures are likely temporary, as the DOC responds to evolving public health conditions.",
    "Furthermore, the tablets do not work within your cell if you are being held for 23hours a day.",
    "The judge also argued that both men would have better access to their counsel if housed in DC.",
    "But neither disputes that the laptops provide defendants some ability to review discovery.",
    "Defendants also have access—even if limited—to a laptop to review electronic discovery.",
    "“First of all, you do not have confidential communications on the educational tablets.",
    "This is a breaking story and we will update you as soon as we learn more.",
    "Democrats continue to shred the Constitution and rule of law.",
    "When it comes to in-person visits from your attorneys?",
    "You can read the full ruling here.",
    "259; see also January 11, 2021 Tr.",
    "Yes, likely temporary.",
    "See, e.g., ECF No.",
    "258 at 4; ECF No.",
    "at 22:13–25.",
    "See ECF No.",
    "272 at 5.",
    "258 at 3.",
    "257 at 5.",
    "ECF No.",
    "ECF No.",
    "at 6.",
    "Id."
  ]
}