{
  "id": 3617,
  "mediaId": 2618,
  "date": "2022-01-26",
  "headline": "Trump Derangement Syndrome, The Left’s Revisionist History, And The Not-So-Great COVID Reset: Where Are The Thunderbirds Now?",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/01/26/trump_derangement_syndrome_the_lefts_revisionist_history_and_the_not-so-great_covid_reset_where_are_the_thunderbirds_now_77850.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Betty Louise Tyndale",
  "authorUrl": "",
  "termIds": [
    2765,
    3016,
    3245,
    4794,
    5532,
    1335
  ],
  "sentences": [
    "But it says something about Rogan that he’s not afraid to continue to take on topics that might set them off — such as going after House Speaker Nancy Pelosi (D-CA) and her husband for their profiting from stock options while they are in the position of promoting and regulating things that will affect the value of those options.“They know laws that are going to be put into place,” Rogan said on his Spotify podcast on Thursday.",
    "Shortly after a mass shooting occurred in Sacramento, California early Sunday, Joe Biden was busy using the tragedy to beat the drum for more gun control across the country – despite the fact that California arguably has what are the nation’s strictest gun control laws, and despite not having any facts about the shooting or the shooters.",
    "In an announcement from the governor’s office yesterday, DeSantis “called on lawmakers to review independent special districts established prior to Nov. 5, 1968.”\nThere’s been a lot of big news over the last several months regarding John Durham’s investigation into the origins of the Trump-Russia collusion hoax.",
    "The actual story, which most of the mainstream media will likely attempt to erase, has nothing to do with lax gun control laws and everything to do with the “reimagining” of the justice system\nEarly Sunday morning, Azerbaijan time, an explosion tore through a crowded nightclub in the capital of Baku.",
    "There is no definitive count of casualties now, but the explosion could not have come at a worse time for Russian President Vladimir Putin.In 2020, former Soviet Republics, Azerbaijan and Armenia, fought a brutal 44-day war over a disputed chunk of land with the Tolkien-esqe name of Nagorno-Karabakh.",
    "What the troublemaker had shouted was mostly inaudible, but it sounded like something about “enslaver of women,”\nTell me if you’ve heard this one before: Violent sociopath sentenced to prison for felony crimes is released early and recommits violent crime, killing again.",
    "(related Alec Baldwin Makes Stunning Claim About Shooting on ‘Rust’ Movie Set) Now, a new report from the New Mexico Occupational Health and Safety Bureau has determined that gross negligence occurred on the set, fining the film company the maximum penalty of $136,793.",
    "But with the complete derangement we’ve been witnessing from the left, combined with DeSantis’ utter ballsy-ness, the section of the Culture War battlefield currently occupied by DeSantis looks like a Marine Corps Battalion fighting against the local Cub Scouts Troop.",
    "Michael Jordan once said “Republicans buy shoes too” – or something to that effect –\nPeople across the country are outraged and hurt by a tasteless, misogynistic, offensive joke that Pat Sajak made during an episode of the long-running game show, Wheel of Fortune.",
    "Newsweek picked up a story from The Sacramento Bee that one of the alleged participants in last weekend’s horrific shooting, a third person of interest originally arrested on charge of illegal firearm possession, was already released on bail.",
    "They write: “A third person arrested in connection with the early Sunday morning shooting in Sacramento, California, that killed six and injured at least a dozen has been released on bail after he was charged with illegal firearm possession.",
    "Before watching the video below, please go to your safe space, clutch your teddy bear, and have your therapist on call in case it traumatizes you.If you’re still reading this, it means you weren’t too traumatized to continue.",
    "Watching Rand Paul rail at Fauci during a Senate hearing, the ever-adroit, ever-facile Tony had his responses down pat,\nComments:\nThe level of politicization with COVID, right from the very beginning, really is remarkable.",
    "The real enemies are those who prevented doctors from treating patients and told the docs (thankfully not all obeyed) to let people get extremely sick - basically give the virus a huge head start on killing people.",
    "In this installment of their weekly Sunday Six conversation, PF Whalen and Parker Beauregard of The Blue State Conservative discuss six prominent leftist activists that they find extremely stupid and annoying.",
    "“I feel like this is starting a new chapter for me in that, doing things like this – real substance – can help people,” the 50-year-old went on to say during an interview on Entertainment Tonight.",
    "We have discovered that the real enemy is not the virus, but the CDC, FDA, Pfizer and the Enemedia who have kept millions from early, effective, cheap treatment and let them die, around the world.",
    "Rather, it was an endorsement that seems to have come out of nowhere, and I’ll go so far as to say it may be his worst ever (yes, worse than Morgan Ortega) — at least as a Republican politician.",
    "The D-list actor, a staunch anti-Trump figure liberal firebrand, has previously claimed he did not actually pull the trigger and that he holds no responsibility for the tragic incident.",
    "In sum, Sajak asked Vanna White if she was an opera buff, she said no, and he shot back with “have you ever watched opera in the buff?” It was a silly retort, a quick play on words.",
    "Donald Trump held a rally in North Carolina on Saturday night, but it wasn’t the normal theatrics and hilarity that the former president delivers that made the biggest impression.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Right now, most of the world is afflicted by a virus made vicious by the machinations of a human in a lab in Wuhan, China, funded by money courtesy of the U.S. taxpayers.",
    "The trial of Michael Sussman, who recently lost a bid to dismiss the case, is coming up shortly, and the most recent filing points to a wide range of targets for Durham.",
    "Yet, there’s also something else buried in those revelations: It looks like Christopher Steele, the author of the infamous Trump Dossier, is going to get off scot-free.",
    "James, who unquestionably belongs in the conversation as one of the best NBAers in history, stupidly waded into the political fray some time ago and never looked back.",
    "Actor Mark Wahlberg, who has a new film, “Father Stu,” set to come out very soon, has been thinking long and hard about what the future might hold for him.",
    "For the evidence of that, I’ll turn to someone far smarter and more experienced than me on such legal issues, my RedState colleague, Leslie McAdoo Gordon.",
    "And we got a glimpse of that sturdiness again this week when Barrett was being interviewed during an appearance at the Ronald Reagan Presidential Library.",
    "Man, as we’ve seen over and over in this miserable pandemic debacle, can be as malignant a force as a microbe barely seen under an electron microscope.",
    "Honestly, I know some people take umbrage with anyone ever questioning Trump’s decision-making, but this is truly a head-scratching moment.",
    "The video below picks up after a heckler had interrupted Barret while she answered a question about the media attention she had to endure.",
    "The actor, who has been busy promoting his new movie, stated that his new career goal is to take his faith and marry it with his films.",
    "Alec Baldwin is now claiming to be “exonerated” of any wrongdoing in his fatal shooting of a set member that occurred in late 2021.",
    "We first witnessed Amy Coney Barrett’s affability and strength in the face of adversity during her confirmation hearings in 2020.",
    "The left has come down heavily in its effort to take Joe Rogan down for daring to say things against their prevailing narratives.",
    "This time in history is bound to assume a place alongside The Black Plague, the First and Second World War, and The Cold War.",
    "#6: Professional athlete and political ignoramus Lebron James Parker: LeBron James has certainly earned a spot on this list.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "In the war, Armenia was soundly thumped, and Russia, attempting to show its relevance, acted as the intermediary",
    "I’m not sure offering endorsements to people based on them being on TV for a long time is the best strategy.",
    "We cannot take our eye off of the New Red Menace lest we be relegated to the ash heap of Once Great Powers.",
    "Azerbaijan has ties with Israel and is a member of the NATO farm club, the “Partnership for Peace” program.",
    "Florida Republican Governor Ron DeSantis is a smart guy, and he’s also a highly skilled politician.",
    "Yet, Baldwin says the report exonerates him, relieving him of any liability for the shooting.",
    "The Chinese Communist Party, our deadly enemy, must be the focus of our foreign relations.",
    "She put on quite a display as Democrats did everything possible to shake and disrupt her.",
    "This sociopath doesn't like what Dr. Paul makes so very apparent of this shyster.",
    "Senator, Dr. Rand Paul puts this alleged scientist, Mengele Fraud, in his cage.",
    "His activism will be a blemish on his otherwise stellar athletic legacy.",
    "Your donation helps keep our discussions going and our voices heard.",
    "The truth hurts, and the painful look on the Fraud's face is proof.",
    "All empires and civilizations believe they will last forever.",
    "Other gun control activists quickly jumped aboard the train.",
    "“I definitely want to focus on making more,” he continued.",
    "Excellent read, filled with very intelligent conclusions.",
    "They started this with their biological warfare.",
    "He’s a man among boys, and he’s not letting up.",
    "The Armenians are a Russian client state.",
    "History is not kind to that hubris.",
    "Doesn’t that beat all?",
    "So much for unity.",
    "It didn’t work.",
    "Sound familiar?",
    "Thank you.",
    "Congrats."
  ]
}