{
  "id": 3621,
  "mediaId": 2621,
  "date": "2022-01-20",
  "headline": "White Nationalist Nick Fuentes, Subpoenaed by Jan. 6 Committee, Suggested Killing Legislators Days Before Riot",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/01/Screen-Shot-2022-01-20-at-12.55.58-PM.jpg",
  "link": "https://www.mediaite.com/news/white-nationalist-nick-fuentes-subpoenaed-by-jan-6-committee-suggested-killing-legislators-days-before-riot/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Meyer",
  "authorUrl": "https://www.mediaite.com/author/ken-meyer/",
  "termIds": [
    2443,
    4039,
    1126
  ],
  "sentences": [
    "I’m not advising that but I mean what else can you do right?” pic.twitter.com/Oeq0bkqpBB https://t.co/JGHIDA4sY7\n— Christian Vanderbrouk (@UrbanAchievr) January 20, 2022\nAs the House Select Committee for January 6th moves to compel testimony from Nick Fuentes, they could start by asking him about how he floated the idea of killing legislators just days before the storming of the Capitol.",
    "The committee announced on Wednesday that they were subpoenaing Fuentes, a known anti-Semite who has denied the Holocaust, defended segregation, threatened and harassed journalists, and has consistently worked to pull Republicans toward the alt-right.",
    "The committee’s announcement calls out Fuentes and Casey for their involvement in the lead-up events before the January 6th “Stop the Steal” rally, encouraging people to march on the Capitol, and for celebrating the riot as it unfolded.",
    "Since the subpoena is expected to focus on their events and rhetoric preceding January 6th, The Bulwark’s Christian Vanderbrouk noted that before the riot, Fuentes seemed to raise the idea of killing lawmakers.",
    "Fuentes is also affiliated with Rep. Paul Gosar (R-AZ) since his organization, the so-called “Groyper Army,” hosted the now-censured congressman at a fundraiser they held as a counter-event to CPAC.",
    "The committee also subpoenaed Patrick Casey, another prominent member of the Groypers who has pushed 2020 election fraud claims.",
    "Two days before 1/6, Fuentes told his audience that only remaining option was to kill legislators.",
    "“What can you and I do to a state legislator besides kill ’em?” Fuentes said.",
    "I’m not advising that but I mean what else can you do right?”\nWatch above.",
    "“What can you and I do to a state legislator besides kill ’em?",
    "“Although we should not do that.",
    "Although we should not do that.",
    "Have a tip we should know?",
    "tips@mediaite.com"
  ]
}