{
  "id": 3698,
  "mediaId": 2621,
  "date": "2022-01-25",
  "headline": "‘Never Seen a Moment Like This’: ADL Chief On Report That Over 100 Candidates for Office in 2022 Have ‘Explicit Ties’ to Extremism",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/01/CNN-Newsroom-With-Poppy-Harlow-and-Jim-Sciutto-10_00_00-AM-1.jpg",
  "link": "https://www.mediaite.com/tv/never-seen-a-moment-like-this-adl-chief-on-report-that-over-100-candidates-for-office-in-2022-have-explicit-ties-to-extremism/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Griffing",
  "authorUrl": "https://www.mediaite.com/author/alex-griffing/",
  "termIds": [
    5146,
    5668,
    3261,
    1126,
    72
  ],
  "sentences": [
    "So that they can influence the ability of elections to be implemented effectively in the years ahead.”\nSciutto followed up, asking Greenblatt, “In your view, has the GOP been complicit in this, either through silence or through active support for these candidates or at a minimum, insufficiently aware of this and doing something about it?”\nGreenblatt responded:\nWell, there is no question that neither side of the spectrum is exempt from intolerance.",
    "But to your question, yes, when people like Boebert (R-CO) and Marjorie Taylor Greene (R-GA) and Paul Gosar (R-AZ) sit in the well of the house under the banner of GOP and espouse very kind of evil ideas about QAnon, making ugly comparisons to the Holocaust and just literally, we’re just in a moment where that silence, a conspiracy of silence has allowed conspiracy-minded people to affect the public conversation.",
    "We’ve tracked now a list that’s expanding on a daily basis, over 100 candidates running for office across 32 states who have explicit extremist ties to groups like the Oath Keepers, the Proud Boys, the Three Percenters, ex-KKK, ex-Neo Nazis.”\nGreenblatt continued, calling these candidates “a mélange of really bad actors” who he noted are “running for congress, state office, secretary of state.",
    "Double the acts of harassment, vandalism, and violence than we did just a few years ago, and this weekend, we had these antisemitic flyers drop in six different states.”\n“There’s a particular nasty white supremacist group that has been coordinating this leafletting through Gab and their own sort of platforms and Telegram.",
    "Subscribe to\nJonathan Greenblatt, the CEO of the Anti-Defamation League, joined CNN’s Newsroom on Tuesday to discuss a new report published by the ADL’s Center on Extremism detailing 2022 midterm candidates with ties to extremist groups in the United States.",
    "Anchor Jim Sciutto began the interview by asking Greenblatt about some recent flyers blaming Jewish people for the “Covid agenda” and just how worrying that kind of rhetoric is these days.",
    "Sciutto then asked Greenblatt to explain how the report connects candidates to extremist groups, particularly how QAnon devotees are often linked to white supremacist groups.",
    "The fact they feel so empowered to do this, so emboldened is really quite frightening,” Greenblatt added before the conversation turned to the ADL’s new report.",
    "The ADL Center on Extremism has been tracking extremists of all variety, across the spectrum, for decades.",
    "You can hear crazy anti-vaxxer Holocaust distortions from Robert RFK Jr. this past weekend or Naomi Wolf.",
    "“Considering we’re already living in a moment where we’ve seen a large rise in anti-semitic incidents.",
    "Watch the full interview above via CNN\nHave a tip we should know?",
    "We watch them and monitor them through our center on extremism.",
    "“This report, I think, is really very important.",
    "We’ve never seen a moment like this, Jim.",
    "“Very worrisome,” Greenblatt responded.",
    "Want to avoid video ads?",
    "tips@mediaite.com"
  ]
}