{
  "id": 3744,
  "mediaId": 2636,
  "date": "2022-01-25",
  "headline": "Cawthorn Challenge Raises the Question: Who Is an ‘Insurrectionist’?",
  "image": "https://static01.nyt.com/images/2022/01/25/us/politics/25dc-insurrection-1/merlin_190617579_56fd9c46-5804-4f86-bcb9-0abe1a60e519-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/01/25/us/politics/madison-cawthorn-jan-6.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2765,
    3805,
    5399,
    1126,
    6709
  ],
  "sentences": [
    "Section three of the 14th amendment concludes with a key phrase that refers to the insurrectionist disqualification, or disability: “Congress may by a vote of two-thirds of each House, remove such disability.” Congress did just that, he said, with the Amnesty Act of 1872 that declared, that “all political disabilities imposed by the third section” of the 14th amendment were “hereby removed from all persons whomsoever.”\nGerard N. Magliocca, an expert witness for the complainants and a law professor at Indiana University who has written on the constitutional section in question, said Mr. Bopp was wrong.",
    "Weeks after the 2020 election, Mr. Cawthorn told a conservative gathering to “call your congressman” to protest the results, adding, “you can lightly threaten them.” He promoted the “Save America” rally behind the White House on Jan. 6, writing on Twitter, “the future of this Republic hinges on the actions of a solitary few,” then adding “It’s time to fight.” At the rally, he riled the crowd from the stage with talk of election “fraud.”\nHe later called those jailed for storming the Capitol “political hostages” and “political prisoners” that he would like to “bust” out of prison.",
    "That section declares that “no person shall” hold “any office, civil or military, under the United States, or under any state, who, having previously taken an oath” to “support the Constitution,” had then “engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.”\nMr. Cawthorn, 26, who is in his first term in Congress, has denounced the case as an egregious misreading of the 14th Amendment, but he has retained James Bopp Jr., one of the most prominent conservative campaign lawyers in the country, as counsel.",
    "While the House committee investigating the assault on the Capitol has so far been unsuccessful in its effort to force key members of Congress to cooperate with the inquiry, the North Carolina case has already prompted a legal discussion — one that is likely to land in court — about what constitutes an insurrection, and who is an insurrectionist.",
    "WASHINGTON — A group of lawyers is working to disqualify from the ballot a right-wing House Republican who cheered on the Jan. 6 rioters unless he can prove he is not an “insurrectionist,” disqualified by the Constitution from holding office, in a case with implications for other officeholders and potentially former President Donald J. Trump.",
    "Mr. Bopp, in an interview, declared the matter “the most frivolous case I’ve ever seen,” but allowed that what he called an “unethical” exploitation of North Carolina law by “competent” lawyers could pose a real threat to Mr. Cawthorn — and by extension, to others labeled “insurrectionists” by liberal lawyers.",
    "Mr. Bopp also said the Constitution clearly granted each chamber of Congress — not a board of elections — the power to determine eligibility for office, an assertion that Ron Fein, the legal director of Free Speech for People, a nonpartisan interest group that is participating in the challenge, dismissed.",
    "The novel challenge to the re-election bid of Representative Madison Cawthorn, one of the House’s brashest supporters of Mr. Trump and the lie that the 2020 election was stolen, could set a precedent to challenge other Republicans who swore to uphold the Constitution, then encouraged the attack.",
    "North Carolina’s new House district map, heavily gerrymandered by the Republican legislature, is currently stuck in court, and the state’s Board of Elections has frozen the candidacy qualifications case against Mr. Cawthorn until he can determine which district he intends to be a candidate in.",
    "“I don’t think we can have those persons who have engaged in acts of insurrection elected to office and serving in office in violation of their constitutional duties and oath,” said John R. Wallace, one of the lawyers on the case and a campaign finance and election law expert in Raleigh, N.C.",
    "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, Paul Gosar of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "It only seems to be difficult for Madison Cawthorn.”\nCases challenging the legitimacy of a candidate before election boards usually hinge on a candidate’s age, legal residency, place of birth or citizenship status, or the legitimacy of signatures in a candidacy petition.",
    "Michael J. Gerhardt, a constitutional law professor at the University of North Carolina, said such disputes were weighty ones for a board of elections, and he predicted that Mr. Cawthorn would seek to force the courts to decide whether he is or is not an insurrectionist.",
    "The lawyers challenging Mr. Cawthorn’s eligibility are using an amendment last invoked in 1920, when Representative Victor L. Berger, an Austrian-American socialist, was denied his seat representing Wisconsin after criticizing American involvement in World War I.",
    "This case revolves around the little-known third section of the 14th Amendment, adopted during Reconstruction to punish members of the Confederacy who were streaming back to Washington to reclaim their elective offices — and infuriating unionist Republicans.",
    "He added, “If our election systems continue to be rigged, and continue to be stolen, then it’s going to lead to one place, and it’s bloodshed.”\nCapitol Riot’s Aftermath: Key Developments\nMr. Bopp said all of that was beside the point.",
    "“It just so happens that Madison Cawthorn is the tip of the spear.”\nThat is because North Carolina’s election statute offers challengers a remarkably low bar to question a candidate’s constitutional qualifications for office.",
    "If nothing else, the lawyers, including two former justices of the North Carolina Supreme Court, want to depose Mr. Cawthorn as part of discovery to question his actions before, during and after the attack on the Capitol.",
    "Ultimately, those involved in the case could use Mr. Cawthorn’s example to try to keep Mr. Trump off the ballot in North Carolina, a key swing state, should he try for a presidential comeback in 2024.",
    "Whether it makes Mr. Cawthorn an “insurrectionist” would have to be determined by North Carolina’s Board of Elections, or more likely, by the state’s courts, where the board might punt the matter.",
    "“If he’s right, than a nine-year-old could show up with enough signatures and qualify for the ballot, because only Congress could disqualify him after the election,” Mr. Fein said.",
    "Congress did not discuss what would happen in the future when it debated granting amnesty to confederates in 1872, nor did it have the power to grant prospective pardons, he said.",
    "“And I think they pass the straight-face test.”\nFor Mr. Cawthorn, that would be a problem beyond the spectacle of him having to answer whether he is an insurrectionist.",
    "Mr. Berger, the sole office holder denied re-election after Reconstruction because of the amendment, tried to make the same argument, but Congress rejected it.",
    "The challenge to Representative Madison Cawthorn’s re-election bid could set a precedent to challenge other Republicans who encouraged the Jan. 6 attack.",
    "Once someone establishes a “reasonable suspicion or belief” that a candidate is not qualified, the burden shifts to the officeseeker to prove otherwise.",
    "“There is, of course, much that we don’t know, and the statute allows discovery by deposition and the production of records,” Mr. Wallace said.",
    "“Just by bringing the complaint, they might jeopardize a member of Congress running for re-election.”\n“They have multiple targets,” he added.",
    "With North Carolina’s Republican primary scheduled for June, the delays could jeopardize his ability to even get his name on a ballot.",
    "If one of their colleagues is disqualified for his role in encouraging the rioters, those hurdles might become easier to clear.",
    "Besides, Mr. Magliocca said, the section at issue remains in the Constitution; Congress does not have the power to repeal it.",
    "And for the first time, a lawmaker who embraced the rioters may have to answer for his actions in a court of law.",
    "The Second Amendment was written so that we can fight against tyranny,” he would later say in Franklin, N.C.",
    "“The Second Amendment was not written so that we can go hunting or shoot sporting clays.",
    "If Mr. Cawthorn is labeled an “insurrectionist,” that could have broader ramifications.",
    "“There’s an old saying in law school, ‘Does it pass the straight-face test?’” he said.",
    "He added, “It should not be difficult to prove you are not an insurrectionist.",
    "“We are definitely going to file other challenges,” Mr. Fein said.",
    "“We have no specific names or dates to divulge just yet.”",
    "“This is the real threat to our democracy,” he said.",
    "He did not agree that the case was frivolous.",
    "There is much that is known."
  ]
}