{
  "id": 3770,
  "mediaId": 8295,
  "date": "2022-01-20",
  "headline": "Capital COVID: State, federal lawmakers face different pandemic rules",
  "image": "https://cronkitenews.azpbs.org/wp-content/uploads/2021/06/flattaxdome-1024.jpg",
  "link": "https://cronkitenews.azpbs.org/2022/01/20/capital-covid-state-federal-lawmakers-face-different-pandemic-rules/",
  "mediaOutlet": "cronkitenewsonline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Sacia",
  "authorUrl": "https://cronkitenews.azpbs.org/people/emily-sacia/",
  "termIds": [
    0
  ],
  "sentences": [
    "She said her positive test meant she had to miss a hearing on transgender rights that she had “prepared for for days, read all this material, you know, have questions that I wanted to ask, and I was unable to participate.”\n“In another world, if I didn’t care so much about the health of my colleagues, I could have easily gone down there and been in the meeting and exposed people,” Butler said.",
    "Democratic leaders complained to Bowers and Senate President Karen Fann, saying that allowing people to participate in the process “from the safety of their home is the only responsible option.”\nBut Kavanagh noted that it was Democrats two years ago – including Salman – who opposed GOP efforts to allow more remote work by the Legislature.",
    "He defended the end of remote testimony this session, saying that it will end the problem of witnesses who flood “the system with the testimony from people who might not even be Arizona residents.”\nThat has not proven to be an issue in Congress, where there is greater control over who testifies at committee hearings.",
    "“It’s necessary for democracy and it’s necessary that people can weigh in on bills that are going to affect their lives.”\nBut state Rep. John Kavanagh, R-Fountain Hills, thinks the state Constitution is clear – legislators need to do their lawmaking in person.",
    "Senators still need to show up to vote in Congress, but the House has allowed proxy voting since May 2020, the first time in history that chamber’s members have been allowed to cast floor votes without actually being on the floor.",
    "And Rep. Athena Salman, D-Phoenix, asked House Speaker Rusty Bowers before the start of this year’s legislative session for permission to participate from home, citing the impending birth of her first child.",
    "WASHINGTON – Even though Rep. Raúl Grijalva tested positive for COVID-19 Wednesday, the Tucson Democrat was still able to cast votes in Congress by proxy Thursday while he was quarantined at home.",
    "Congressional Republicans, including several from Arizona, sued House Speaker Nancy Pelosi in an effort to stop the practice, citing some of the same constitutional arguments as Kavanagh.",
    "That makes more sense to Butler, who called the state Capitol procedures “this stupid policy.”\n“It’s devastating not to be able to be there to represent my constituents,” said Butler.",
    "Both the House and Senate continue to hold hearings with some members and witnesses in the room and some participating virtually, which they have done for much of the past two years.",
    "But that suit was unsuccessful, and the policy has been extended repeatedly because of the ongoing threat of COVID-19 – and has since been used by scores of House Republicans.",
    "Rep. Judy Schwiebert, D-Phoenix, unsuccessfully tried to get the House Appropriations Committee to allow remote participation by members and the public Wednesday.",
    "But Bowers, who was quoted in news reports saying he is “trying to give some air of normalcy” to the Legislature, sharply limited virtual participation this year.",
    "In order to vote by proxy, lawmakers must designate another member to vote on their behalf and notify them, in writing, on how to vote for each individual bill.",
    "Grijalva, who has voted by proxy on all 14 roll calls so far this year, including three on Thursday, did not immediately respond to a request for comment.",
    "The Arizona House largely reverted to pre-pandemic rules this session, which means representatives have to be present at the Capitol to vote or debate.",
    "He and Rep. Ann Kirkpatrick, D-Tucson, were among the biggest users of the proxy vote in the House, according to a Cronkite News analysis last summer.",
    "While people can still watch streamed House proceedings, they cannot participate unless they are in the Capitol in person – lawmakers included.",
    "And that means Butler, who remained in isolation Thursday after a positive test earlier this week, cannot perform her legislative duties.",
    "Members can vote from their offices in the Capitol, if they have advance permission from Bowers, but they must be in the building.",
    "“And this is because it’s a requirement of the Arizona Constitution.”\nButler is not the only one upset by the change.",
    "“It incentivizes people to go down there and participate, this stupid policy, even though they’re sick.”",
    "This is the second positive COVID-19 test since 2020 for Grijalva, who is fully vaccinated.",
    "“The main rule is that you have to be in the Capitol building,” Kavanagh said.",
    "And Rep. Paul Gosar, R-Prescott, had cast dozens of proxy votes by that time.",
    "That’s an option state Rep. Kelli Butler, D-Scottsdale, wishes she had.",
    "“I think it’s a threat to democracy,” Butler said.",
    "No working from home."
  ]
}