{
  "id": 3997,
  "mediaId": 4040,
  "date": "2022-01-18",
  "headline": "Right Wing Bonus Tracks: Smell the Stain",
  "image": "https://files.rightwingwatch.org/uploads/Bonus_Trax2.jpg",
  "link": "https://www.rightwingwatch.org/post/right-wing-bonus-tracks-smell-the-stain/",
  "mediaOutlet": "Right Wing Watch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kyle Mantyla",
  "authorUrl": "https://www.rightwingwatch.org/post_author/kyle-mantyla/",
  "termIds": [
    0
  ],
  "sentences": [
    "Well, the N-word was always funny, but me.”\nPatrick Howley had an antisemitic meltdown on Twitter, then asserted that “Zionists in politics want to vaccinate people” because they get “sexual stimulation from the idea of violating and raping little kids with a needle.”\nFinally, Heidi St. John is running for Congress because “America needs a mom.",
    "It’s premeditated, it’s calculated, it’s Genocide.”\nRep. Paul Gosar says that those who call him a white nationalist are the real white nationalists: “If they’re calling me a white nationalist, go back and look in the mirror.",
    "If you smell the stain, it’s up to you.”\nNick Fuentes insists that he has nothing to apologize for after saying the N-word during a recent livestream: “I’m just trying to make things cool again.",
    "There’s a whole bunch of people [in Congress] that just need to go into timeout right now … America needs a mom and so I’m running to be a mom for America.”",
    "Having been banned from nearly every mainstream social media platform, QAnon conspiracy theorist Liz Crokin has launched a Substack newsletter.",
    "Stew Peters declares that “the anti-white coronavirus death cult Vax nazis are killing us in these hospitals.",
    "They’re being murdered at death camps formerly known as ‘healthcare’ facilities.",
    "Those people that are calling it are the ones that are guilty.",
    "Who made it cool to say that interracial is wrong?",
    "… People don’t die from ‘Covid’ at home.",
    "… Who made misogyny cool again?",
    "And say the N-word?",
    "Me.",
    "Me."
  ]
}