{
  "id": 4118,
  "mediaId": 2723,
  "date": "2022-01-25",
  "headline": "Madison Cawthorn Retains High-Powered GOP Attorney for Case Seeking to Disqualify Him as an Insurrectionist",
  "image": "https://www.thenewcivilrightsmovement.com/wp-content/uploads/2021/01/cawthorn-jan-56-ss-4.jpg",
  "link": "https://www.thenewcivilrightsmovement.com/2022/01/madison-cawthorn-retains-high-powered-gop-attorney-for-case-seeking-to-disqualify-him-as-an-insurrectionist/",
  "mediaOutlet": "thenewcivilrightsmovement.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Badash",
  "authorUrl": "https://www.thenewcivilrightsmovement.com/author/dbadash/",
  "termIds": [
    0
  ],
  "sentences": [
    "Cawthorn, 26, who is in his first term in Congress, has denounced the case as an egregious misreading of the 14th Amendment, but he has retained James Bopp Jr., one of the most prominent conservative campaign lawyers in the country, as counsel.”\nBopp, known as being one of the attorneys who won the democracy-damning Citizens United case at the Supreme Court, flooding American politics with millions (billions?)",
    "“No person shall be a Senator or Representative in Congress,” the 14th Amendment reads, “who, having previously taken an oath, as a member of Congress…shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.”\nThe New York Times Tuesday night reports “Mr.",
    "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, Paul Gosar of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "Once someone establishes a ‘reasonable suspicion or belief’ that a candidate is not qualified, the burden shifts to the officeseeker to prove otherwise.”\nOther Republicans are likely worried, which should have some wondering who’s footing the bill for Bopp.",
    "A group of attorneys is looking at both the 14 Amendment to the U.S. Constitution and North Carolina law, in an attempt to have him declared an insurrectionist and therefore unfit to serve.",
    "If one of their colleagues is disqualified for his role in encouraging the rioters, those hurdles might become easier to clear.”\nRead the entire Times report here.",
    "The Times adds that “North Carolina’s election statute offers challengers a remarkably low bar to question a candidate’s constitutional qualifications for office.",
    "Four Republicans are primarying the far-right freshman lawmaker, one of those five will go on to face the Democratic challenger.",
    "U.S. Rep. Madison Cawthorn (R-NC) is facing several six challengers to his seat in the House of Representatives this year.",
    "But Congressman Cawthorn is facing an even great challenge, and he’s taking it seriously.",
    "“If Mr. Cawthorn is labeled an ‘insurrectionist,’ that could have broader ramifications.",
    "He’s also been a vice-chair of the RNC, and is recognized as a top conservative lawyer.",
    "Two Democrats will face off, with one becoming their party’s nominee.",
    "in dark money."
  ]
}