{
  "id": 4130,
  "mediaId": 2522,
  "date": "2022-01-21",
  "headline": "Clinton labor secretary blames his tweet calling for the assault of Sen. Sinema on Republicans",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/01/SG-SG-Kyrsten-Sinema-Former-Democratic-Labor-Secretary-Robert-Reich-split.jpg",
  "link": "https://www.bizpacreview.com/2022/01/21/clinton-labor-secretary-blames-his-tweet-calling-for-the-assault-of-sen-sinema-on-republicans-1191272/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "https://www.bizpacreview.com/author/terresa-monroe-hamilton/",
  "termIds": [
    5879,
    3729,
    2938,
    3049,
    1394,
    1126,
    1489
  ],
  "sentences": [
    "— Robert Reich (@RBReich) November 18, 2021\nHe also attacked Rep. Marjorie Taylor Greene (R-GA) for calling Rep. Ocasio-Cortez a “little communist from New York City” and “not an American.”\n“Leave it to Kevin McCarthy to be more outraged about Liz Cheney telling the truth about a presidential election than Marjorie Taylor Greene inciting violence against her colleagues,” Reich stated.",
    "Others blasted Reich for the tweet as well:\n“Kyrsten Sinema is the sort of inspiring LGBT woman who must be slapped around by her party if she fails to follow the demands of a white man,” writes @RBReich\n— Charles C. W. Cooke (@charlescwcooke) January 20, 2022\nWhat are Democrats supposed to do to Sen. Sinema with \"the backs of their hands,\" @RBReich?",
    "SIGN UP HERE\nFormer Democratic Labor Secretary Robert Reich was torched after attempting to blame conservative media for a now-deleted tweet he sent out Wednesday stating that Senate Democrats should give Sen. Kyrsten Sinema (D-AZ) the “backs of their hands” because she blocked nuking the filibuster.",
    "pic.twitter.com/XFJyU0d1Sc\n— Glenn Greenwald (@ggreenwald) January 20, 2022\nHey little lady… if you don't vote my way we're just gonna have to smack you around a bit until you fall in line and do what you're told.\"",
    "— Nicholas Fondacaro (@NickFondacaro) January 20, 2022\nFirst Amendment lawyer Ari Cohen took first prize, however, for dragging Reich over the incendiary tweet: “Nobody misinterpreted or distorted anything.",
    "She has been stalked in public places, had slurs hurled at her in public, and has had activists confront her at an airport, on a plane, and chase her into a bathroom filming and taunting her.",
    "Leave it to Kevin McCarthy to be more outraged about Liz Cheney telling the truth about a presidential election than Marjorie Taylor Greene inciting violence against her colleagues.",
    "— Carol Roth (@caroljsroth) January 20, 2022\n“‘Back of the hand’ is an idiom to strike someone in the face with it,” noted Newsbusters deputy managing editor Nicholas Fondacaro.",
    "“Democratic senators should have given her the backs of their hands.” He deleted the offensive tweet but not before conservatives got a hold of it and excoriated him for it.",
    "He took to Twitter hours later, explaining why he deleted the tweet, “Last night I deleted a tweet because it was widely misinterpreted and distorted by conservative media.",
    "— Larry O'Connor (@LarryOConnor) January 20, 2022\nThis is @RBReich saying Democrats should assault a female senator because the democrat party is the… champion of women.",
    "— Robert Reich (@RBReich) January 20, 2022\nSinema has faced constant threats of violence since she took a stand saying she would not support nixing the filibuster.",
    "— Ari Cohn (@AriCohn) January 20, 2022\nReich has previously criticized heated political rhetoric, hypocritically stating that it can have consequences.",
    "pic.twitter.com/glADJoRvYp\n— Jason Rantz on KTTH Radio (@jasonrantz) January 20, 2022\nHere’s @RBReich encouraging people to batter a Senator.",
    "— Acyn (@Acyn) January 20, 2022\nLast night I deleted a tweet because it was widely misinterpreted and distorted by conservative media.",
    "“Just admit it… you hate women, conservative media, and women IN conservative media,” conservative journalist Beth Baumann tweeted.",
    "He aggressively went after Rep. Paul Gosar (R-AZ) for his anime depicting an attack on Rep. Alexandria Ocasio-Cortez (D-NY).",
    "She asserted that Sinema and Sen. Joe Manchin (D-WV) don’t care about blacks and minorities in an interview last weekend.",
    "— Robert Reich (@RBReich) June 1, 2021\nReich was joined by Rep. Maxine Waters (D-CA) in his vocal disgust with Sinema.",
    "pic.twitter.com/VM9ORFTFQU\n— Jonathan Greenberg (@JGreenbergSez) January 20, 2022\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "If you spout vile conspiracy theories and incite violence against your colleagues, you do not belong in Congress.",
    "If you spout vile conspiracy theories and incite violence against your colleagues, you do not belong in Congress.",
    "I wholeheartedly condemn violence against women.” He has not appeared to have directly apologized for the tweet.",
    "Until those at the highest levels of government are held accountable, no one in political life will be safe.",
    "Until those at the highest levels of government are held accountable, no one in political life will be safe.",
    "Not only is he frequently on MSNBC, but the left-wing economist has also made appearances on CNN as well.",
    "Reich served under former President Bill Clinton and is a talking head who appears frequently on MSNBC.",
    "“Tonight, Republican senators lined up to shake Kyrsten Sinema’s hand,” Reich wrote in his tweet.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "It remains to be seen if Reich will take any responsibility for his own words in this instance.",
    "— Beth Baumann (@eb454) January 20, 2022\n“Only one ‘idiom’ here,” author Carol Roth snarked.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "(Video Credit: MSNBC)\nReich is a professor at the University of California-Berkeley.",
    "Just admit it… you hate women, conservative media, and women IN conservative media.",
    "He claims the tweet was simply an idiom and not a call for violence against Sinema.",
    "Take some f***ing responsibility.”\nNobody misinterpreted or distorted anything.",
    "Liberal networks look to him as an expert on political and economic matters.",
    "They appear to be giving him a pass on his hateful rhetoric towards Sinema.",
    "— Robert Reich (@RBReich) July 26, 2021\n“Folks, this is not complicated.",
    "“Back of the hand” is an idiom to strike someone in the face with it.",
    "Violent threats against lawmakers are on track to double this year.",
    "Violent threats against lawmakers are on track to double this year.",
    "Conservatives pushed back hard after Reich’s vicious tweet.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "The public will not see it and we do not share it.",
    "I wholeheartedly condemn violence against women.",
    "By the way, censure is not enough for Gosar.",
    "By the way, censure is not enough for Gosar.",
    "Expel Marjorie Taylor Greene,” he demanded.",
    "Deleted with no apology or acknowledgement.",
    "\"Back of the hand\" is an idiom for rebuke.",
    "‘Back of the hand’ is an idiom for rebuke.",
    "He should be expelled,” he tweeted.",
    "Take some fucking responsibility.",
    "Folks, this is not complicated.",
    "Expel Marjorie Taylor Greene.",
    "– @RBReich's inner thoughts?",
    "A female Senator, no less.",
    "He should be expelled.",
    "Only one “idiom” here.",
    "“It’s not just @AOC.",
    "It’s not just @AOC.",
    "Uh huh."
  ]
}