{
  "id": 4218,
  "mediaId": 2766,
  "date": "2022-01-19",
  "headline": "Joe Biden’s Presidency: How It Started… How It’s Going",
  "image": "https://conservativefiringline.com/wp-content/uploads/2022/01/bidenoneyearoffice2.jpg",
  "link": "https://conservativefiringline.com/joe-bidens-presidency-how-it-started-how-its-going/",
  "mediaOutlet": "conservativefiringline.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Catherine Mortensen",
  "authorUrl": "https://conservativefiringline.com/author/cmortensen/",
  "termIds": [
    2451,
    2765,
    4079,
    4905,
    3858,
    942,
    1233,
    5930
  ],
  "sentences": [
    "“Biden was identified as “Chair / Vice Chair depending on agreement with CEFC,” an apparent reference to the former Shanghai-based conglomerate CEFC China Energy Co.\n“His pay was pegged at “850” and the email also noted that “Hunter has some office expectations he will elaborate.”\n“In addition, the email outlined a “provisional agreement” under which 80 percent of the “equity,” or shares in the new company, would be split equally among four people whose initials correspond to the sender and three recipients, with “H” apparently referring to Biden.”\nJoe Biden’s first year in office is nothing but broken promises.",
    "An article entitled, Emails reveal how Hunter Biden tried to cash in big on behalf of family with Chinese firm, notes:\n“Hunter Biden pursued lucrative deals involving China’s largest private energy company — including one that he said would be “interesting for me and my family,” emails obtained by The Post show.",
    "The Biden administration went into full attack mode against the First Amendment right to petition the government as Attorney General Merrick Garland has declared that parents opposing Critical Race Theory before their local school boards should be treated as terrorists under the Patriot Act.",
    "Facebook, Google, and other members of the Silicon Valley Axis of Evil are now doing everything they can to deliberately silence conservative content online, so please be sure to check out our MeWe page here, check us out at ProAmerica Only and follow us at Parler, Social Cross and Gab.",
    "“If a federally imposed eviction moratorium is to continue,” the opinion said, “Congress must specifically authorize it.”\n‘Defend our Democracy’\nUnder the Biden Department of Justice, federal agents have been mobilized against private citizens who speak out against local school boards.",
    "Alaska radio host and former U.S. Senate candidate Bob Bird weighed in on the near tragedy with these comments in the Alaska Watchman, “[This] is an example of what happens when a lawless and completely illegitimate political party and administration come to power.",
    "The Court’s majority opinion looked to whether the Occupational Safety and Health Act of 1970 — the congressional statute that gives OSHA the power to regulate — clearly authorizes OSHA to issue the vaccine mandate.",
    "Americans for Limited Government President Richard Manning has called it “Biden’s Katrina,” in reference to the 2005 Hurricane Katrina which virtually crippled George W. Bush’s administration.",
    "An Oct. 2020 article in Forbes magazine, How The Bidens Earned $16.7 Million After Leaving The White House, details how when Biden left the West Wing [in 2016], the big money started coming.",
    "While you’re at it, be sure to check out our friends at Whatfinger News, the Internet’s conservative front-page founded by ex-military!And be sure to check out our friends at Trending Views:",
    "“One email sent to Biden on May 13, 2017, with the subject line “Expectations,” included details of “remuneration packages” for six people involved in an unspecified business venture.",
    "Congressman Paul Gosar (R-AZ) recently shared with his constituents new photos and video of the latest surge of illegal aliens crossing the southern border in Yuma, Arizona.",
    "“This week, Arizonans have watched in horror as new pictures and videos depict the latest rush of illegal aliens crossing the border in Yuma,” Gosar said in a press release.",
    "These are individuals, almost all of whom are charged with misdemeanors, who still haven’t had their day in court to explain their actions during the Jan. 6 Capitol breach.",
    "Cross-posted with The Daily Torch\nVoters: Majority says country going in ‘wrong direction’ under Biden\nTurn your back on Big Tech oligarchs and join the New Resistance NOW!",
    "It is here, and none of us are safe.”\nIn addition, the Biden Department of Justice still has hundreds of American citizens rotting under deplorable conditions of the D.C.",
    "A year ago today, newly-installed President Joe Biden stood on the west steps of the U.S. Capitol and boldly declared that “Before God and all of you I give you my word.",
    "President Joe Biden’s Attorney General, Merrick Garland’s memo directing the FBI to investigate parents who speak out at school board meetings shocked the nation.",
    "The Supreme Court said as much last week when it struck down his mandate that would have forced nearly 85 million Americans to get vaccinated or lose their jobs.",
    "The Court majority wrote, “It is indisputable that the public has a strong interest in combating the spread of the Covid-19 Delta variant,” the opinion said.",
    "In 2017, the Bidens declared $11.1 million in total earnings, nearly twice as much in a single year as they had made in the previous 18 years combined.",
    "In one case the FBI raided the home of an Alaska couple who had attended former President Donald Trump’s Jan. 6 peaceful rally near the White House.",
    "The Biden Department of Justice has similarly targeted private citizens for harassment and mistreatment as it relates to the Jan. 6 Capitol breach.",
    "‘Defend the Constitution’\nInstead of defending the Constitution, he has attempted to shred it with his unconstitutional COVID vaccine mandates.",
    "The Democrats are utilizing the proven techniques of communism and fascism, and weaponizing federal law enforcement for political purposes.",
    "I will give my all in your service thinking not … of personal interest, but of the public good.”\nThat’s how his presidency started.",
    "You can also follow us on Twitter at @co_firing_line, and at the new social media site set up by members of Team Trump, GETTR.",
    "‘Not personal interest, but public good’\nJoe Biden and his family have enriched themselves at the public trough for decades.",
    "Joe Biden’s open border policies are an open invitation to criminals and drug cartels to cross into our country unchecked.",
    "Biden again trampled the Constitution when he sought to remove the rights of private landowners to evict deadbeat tenants.",
    "Biden ignored the advice of his top generals and withdrew our troops in a debacle that will not soon be forgotten.",
    "It is evident by these disturbing images that the crisis along the southern border is getting worse by the day.",
    "‘Defend America’\nOur ongoing border crisis is proof that President Biden fails every day to defend America.",
    "The New York Post, and other news outlets, extensively covered the Hunter and Joe Biden corruption scheme.",
    "And Biden’s disastrous withdrawal from Afghanistan resulted in the deaths of 13 American service members.",
    "His historically low poll numbers reflect the growing truth that Americans know he is a failed president.",
    "This is the crisis that Joe Biden doesn’t want you to see but a picture is worth a thousand words.",
    "“But our system does not permit agencies to act unlawfully even in pursuit of desirable ends.",
    "About $10 million of that flowed through two S-corporations called CelticCapri and Giacoppa.",
    "Catherine Mortensen is Vice President of Communications at Americans for Limited Government.",
    "The crisis has reached a new level and what is taking place in Yuma is unconscionable.",
    "“Photos and videos showing lines and lines of criminals walking into our country.",
    "They are now reaping the fruits of the November’s compromised election.",
    "Our country will not be made great again until he is out of office.",
    "Thousands more staging along the border getting ready to cross.",
    "Its aftermath spells the end of freedom in America.",
    "Mountains of litter and rubbish strewn everywhere.",
    "Joe Biden is destroying America,” concluded Gosar.",
    "The Court held that it does not.",
    "I will defend the Constitution.",
    "I will defend our democracy.",
    "It is no longer a threat.",
    "Here is how it is going.",
    "I will defend America."
  ]
}