{
  "id": 4394,
  "mediaId": 2540,
  "date": "2022-01-22",
  "headline": "Videos show 'Stop the Steal' rally organizer saying he would work with extremist groups",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220121104559-ali-alexander-1209-super-tease.jpg",
  "link": "https://www.cnn.com/2022/01/22/politics/ali-alexander-january-6-extremists-kfile/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Kaczynski and Em Steck",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In previously unreported videos from the social media platform Periscope reviewed by CNN's KFile, Ali Alexander, a leader of the \"Stop the Steal\" rally and a central figure in the House select committee's investigation of January 6, said he would reach out to the right-wing Proud Boys and Oath Keepers on providing security for the event.",
    "They also show the heated rhetoric used by Alexander to describe his efforts, including speculating that a civil war could occur if the \"Stop the Steal\" movement's efforts were successful and that he'd rather see the White House be struck by lightning and \"burn down\" than have then President-elect Joe Biden enter it.",
    "A spokesperson for Brooks last month denied that the congressman was in contact with Alexander beyond one \"benign\" text message sent in mid-December 2020 from Alexander, in which Alexander identified himself as the founder of the \"Stop the Steal\" movement and claimed the two met in 2010.",
    "(CNN)An organizer of the \"Stop the Steal\" rallies that preceded the attack on the US Capitol a year ago said he would work with two extremist groups, who later had members charged in the attack, about providing security and housing for the January 6, 2021, rally in Washington.",
    "He was focused on his research and arguments to work within the confines of the law and established precedent to restore integrity to our elections, and to ensure that all Americans -- regardless of party affiliation -- can again have complete trust in our elections systems.\"",
    "In one Periscope video from January 2, 2021 -- four days before the session to certify the Electoral College results -- Alexander claimed Arizona's Rep. Andy Biggs of Arizona worked with him to pressure senators to object to certifying the results of the 2020 election.",
    "The purpose of the Stop the Steal movement's work, Alexander said in a previously reported video first highlighted by the nonpartisan watchdog organization Project On Government Oversight in January 2021, was to build public pressure to intimidate members of Congress.",
    "Jared Holt, a resident fellow at The Atlantic Council's Digital Forensic Research Lab who studies US domestic extremist movements and had extensively researched January 6, said Alexander's rhetoric had the potential to influence bad behavior among the far-right.",
    "In other videos removed from Periscope -- it's unknown who removed the videos, when and why -- Alexander claimed to describe further details of his communications and coordination with several Congressional Republicans pushing to overturn the election result.",
    "Alexander previously worked as a Republican political operative under the name of Ali Akbar on John McCain's 2008 presidential campaign and a handful of political action committees before rebranding himself as an outspoken supporter of Trump.",
    "\"I think the White House should burn down and I'm not saying that -- I'm not telling anyone to, but I'm just saying -- I literally believe that a bolt of lightning should hit the White House and light it on fire before it's handed over.\"",
    "Also in that December 17 video, Alexander called Marjorie Taylor Greene, who at that point had been elected but not sworn in as a Georgia representative, \"a friend of mine\" who would help their efforts to object to the election results.",
    "\"[Who worked with] Congressman Paul Gosar to whip up votes in the House, Congressman Andy Biggs, to not only whip up votes in the House, but also let me know who the soft senators were because he briefed them in the Steering committee?",
    "After the attack on the Capitol last January, Biggs' spokesperson told CNN, \"Congressman Biggs is not aware of hearing of or meeting Mr. Alexander at any point -- let alone working with him to organize some part of a planned protest.\"",
    "An attorney for Alexander denied that his client worked with the Proud Boys but acknowledged that Alexander did try to help them with housing; the attorney also said the Oath Keepers did provide security for several events.",
    "While some of Alexander's Periscope videos have been previously reported by CNN, these additional videos provide new details of his claims about his contacts with extremist groups and lawmakers in the lead-up to the rally.",
    "In another video from December 29, 2020, Alexander said he spoke to the Proud Boys to make sure they had lodging covered for the event after a hotel frequented by the group said it would close in early January temporarily.",
    "He has also handed over thousands of text messages and communication records that include his interactions with members of Congress and former President Donald Trump's inner circle leading up to the riot at the Capitol.",
    "And it was to build momentum and pressure, and then on the day change hearts and minds of Congresspeoples [sic] who weren't yet decided or saw everyone outside and said, 'I can't be on the other side of that mob.'\"",
    "Alexander gained notoriety after he began posting videos of himself espousing pro-Trump and far-right views in 2019 on social media and for his work with MAGA conspiracy theorists Jacob Wohl and Laura Loomer.",
    "In one livestream video on December 23, 2020, entitled \"JAN6,\" Alexander said to his followers that he planned to reach out to the Proud Boys and Oath Keepers about providing security for the January 6 rally.",
    "And after the December 12 rally, at least four people were stabbed after an evening of faceoffs with counterprotesters; at least 33 people were arrested, including six people for assaulting police officers.",
    "In another previously unreported video, Alexander claimed that Gosar came up with the idea for a march in Washington, DC on to protest the results of the election, though he did not specify which march.",
    "In the same recording, Alexander, speaking straight to the camera, said he worked with Alabama Rep. Mo Brooks and Arizona Rep. Paul Gosar to gather Republican votes protesting the election results.",
    "Baron Coleman, Alexander's attorney, told CNN his client \"did not work with the Proud Boys,\" saying his \"colorful remarks or exaggerations during playful livestreams contextualize his intentions.\"",
    "\"Using tiny clips from the thousands of hours of extemporaneous speaking that Ali produced during the 2020 election cycle seems out of context and without regard to the truth,\" Coleman said.",
    "Gosar's chief of staff previously told the New York Times that Alexander was \"a solid organizer,\" but that Gosar's office, while it promoted the events, was not involved in planning them.",
    "\"I'm the guy who came up with the idea of January 6th when I was talking with Congressman [Paul] Gosar, Congressman Andy Biggs, and Congressman Mo Brooks,\" he said on December 28, 2020.",
    "The extent of Alexander's work with members of Congress, the Trump campaign and the Trump White House has been a subject of interest for the House committee investigating January 6.",
    "I'm gonna try to make sure that every 15 minutes -- so that you just know in your head, you don't have to know in a map -- that Metro stops are being patrolled,\" he said.",
    "Coleman, Alexander's attorney, also argued to CNN in an email that the clips provided seemed out of context, arguing Alexander was joking or exaggerating in clips.",
    "\"His role in the pro-Trump political space, connecting politicians, influencers, and activists, means that his words matter a great deal,\" Holt told CNN.",
    "\"What Alexander says, whether in jest or in earnest, has the potential to ripple across far-right communities and offer permission for bad behavior.\"",
    "Alexander sat in early December for a deposition and claimed in a court filing he told lawmakers of his interactions with Republican representatives.",
    "Alexander has not been charged or implicated in any unlawful act and he has denied working with anyone, including lawmakers, to attack the Capitol.",
    "The spokesperson added that Biggs \"did not have any contact with protestors or rioters, nor did he ever encourage or foster the rally or protests.",
    "Heated rhetoric\nThe videos unearthed by CNN's KFile also show the heated rhetoric that Alexander used leading up to the January 6, 2021, rally.",
    "A spokesperson for Greene's office previously told Rolling Stone that she and her office \"had nothing to do with planning of any protest.\"",
    "In his December testimony, he claimed that the evidence he handed over to the committee exonerated himself and members of Congress.",
    "Last week, the Justice Department charged the Oath Keepers leader and 10 others with seditious conspiracy related to the attack.",
    "\"There's no circumstance that I think is legitimate that Joe Biden should enter the White House,\" he said on January 1, 2021.",
    "But he said his client did offer to help them find new housing and the Oath Keepers did provide security for several events.",
    "In one video from early January 2021, Alexander speculated that being successful on January 6 might lead to a civil war.",
    "After at least two rallies in Washington, DC, however, clashes between protesters and counterprotesters turned violent.",
    "Spokespeople for Biggs and Brooks have previously denied planning rallies or coordinating with Alexander in any way.",
    "The spokesperson said Brooks did not recognize the number and had \"no personal knowledge\" about who the sender was.",
    "Prosecutors have said members of both groups conspired ahead of time to disrupt the Electoral College proceeding.",
    "At a November 14 rally, violence erupted between the groups after dark and at least 20 people were arrested.",
    "Alexander's attorney told CNN that his client was referring to the first rally in Washington DC in November.",
    "Dozens of members of the Proud Boys and the Oath Keepers have been charged in the attack on the US Capitol.",
    "I'm gonna talk to the Oath Keepers and I'm gonna try to get patrols going, okay, of men that go for hours.\"",
    "They're either mistaken or lying,\" Alexander said in his opening statement to the committee on December 9.",
    "\"Who worked with Congressman Mo Brooks to whip up votes in the House,\" Alexander said in the livestream.",
    "He has denied working with anyone, including lawmakers or extremist groups, to attack the Capitol.",
    "\"I got a call from Congressman Gosar,\" Alexander said in a speech at a rally on December 3, 2020.",
    "In the same video, he said he'd rather see the White House \"burn down,\" than have Biden enter it.",
    "In one video from December 21, 2020, Alexander said he shared a dinner with Gosar a day earlier.",
    "Alexander had also mentioned speaking with Brooks in an earlier video from December 17, 2020.",
    "\"Anyone who suggests I had anything to do with the unlawful activities on January 6 is wrong.",
    "Both groups later had members charged in the attack on the Capitol, including conspiracy.",
    "\"So, we're the four guys who came up with a January 6th event, hashtag 'do not certify.'",
    "The lawmakers have denied planning rallies or coordinating with Alexander in any way.",
    "The other ones under his care post-Election Day; all peaceful and without incident.\"",
    "\"I will tell you, I have talked with Mo Brooks,\" Alexander said of the lawmaker.",
    "None of the lawmakers contacted by CNN returned repeated requests for comment.",
    "\"I'll find you a room,\" Alexander said in a livestream addressing the camera.",
    "I talked tonight to the Proud Boys to make sure that they were all covered.\"",
    "Alexander's attorney said his comments about the White House were \"in jest.\"",
    "Both groups have been the subject of subpoenas by the January 6 committee.",
    "\"All of Ali's rallies, to this date, remain peaceful and without incident.",
    "All of the dozens of rallies he did, all peaceful, without incident.",
    "Alexander has not been charged or implicated in any unlawful act.",
    "\"Don't worry, I'm gonna make sure so many people are so safe.",
    "I've talked with the staff and I've talked with him.\"",
    "He called me and said, 'Y'all need to march on DC.'",
    "He said all of Alexander's rallies were peaceful.",
    "He's actually the originator of the DC march.",
    "\"He's the spirit animal of Stop the Steal.",
    "\"I'm gonna try to go that deep into it.",
    "I said, 'We'll see what we can do.'\"",
    "Boom, we've been doing the work.\"",
    "I'm gonna talk to the Proud Boys.",
    "It's gonna make your head spin.",
    "\"My team will find you a room.",
    "\"We are talking personally."
  ]
}