{
  "id": 4486,
  "mediaId": 2810,
  "date": "2022-01-13",
  "headline": "Madison Cawthorn’s Incitement of Insurrection Should Knock Him Off the Ballot",
  "image": "https://www.thenation.com/wp-content/uploads/2022/01/GettyImages-1268943647.jpg",
  "link": "https://www.thenation.com/article/politics/madison-cawthorn-ballot/",
  "mediaOutlet": "The Beat",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Nichols",
  "authorUrl": "https://www.thenation.com/authors/john-nichols/",
  "termIds": [
    2765,
    4905,
    5399,
    542,
    1125,
    1126,
    1433,
    1477,
    6456
  ],
  "sentences": [
    "He then referred to insurrectionists that had been arrested as “political prisoners.” And he argued that “if our election systems continue to be rigged and continue to be stolen, then it’s going to lead to one place—and it’s bloodshed.”\nIt is difficult to review Cawthorn’s record and not conclude that he has violated his oath to “bear true faith and allegiance” to the US Constitution, which states, in Amendment 14, Section 3:\nNo person shall be a Senator or Representative in Congress, or elector of President and Vice-President, or hold any office, civil or military, under the United States, or under any State, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.",
    "Like Trump, who would be impeached for his seditious words and deeds on that day, Cawthorn celebrated the fact that the rally had “some fight in it.” Peddling the lie that the Democrats were engaging in “fraud…in this election,” the congressman said, “The Constitution has been violated.” He then asked for the crowd to back him up when, “at 12 o’clock today, we will be contesting the election.”\nThe rally appearance was the culmination of weeks of agitating by Cawthorn, who echoed and amplified Trump’s claims that the election had been “rigged” and “stolen,” and who urged young right-wing activists to intimidate and pressure members of Congress who were disinclined to seek to overturn the election results.",
    "Speaking to a December 2020 gathering, he declared, “Ladies and gentlemen, the fight for America is only just beginning and I honestly feel bad for the enemies of liberty and justice because they have no idea what they’ve just started.”\nAfter the violent attack on the Capitol, which left five people dead and 140 police officers injured, Cawthorn implemented the agenda of the insurrectionists by voting to reject the Electoral College votes of states that had chosen Democrat Joe Biden over Trump.",
    "The 25-year-old Republican from North Carolina pledged in his oath of office to “support and defend the Constitution of the United States against all enemies, foreign and domestic.”\nThree days later, Cawthorn appeared with Donald Trump at the so-called “Stop the Steal” rally, at which the Republican president and his allies urged insurrectionists to march on the US Capitol as part of an effort to prevent the certification of election results that confirmed Trump’s defeat in the 2020 election.",
    "In it, they ask the North Carolina State Board of Elections to take steps that could lead to a determination that the representative is constitutionally disqualified from public office “based on reasonable suspicion that he helped facilitate the January 6, 2021 insurrection.”\n“This challenge is all about enforcing the Constitution of the United States,” said Robert F. Orr, a Republican former justice on the North Carolina Supreme Court, who is one of the lawyers supporting the challenge.",
    "“As set forth in our complaint, the publicly available evidence, including Representative Cawthorn’s own statements and reports that he or his office coordinated with the January 6 organizers, establish reasonable suspicion that Representative Cawthorn aided the insurrection, thereby disqualifying him from federal office,” said Ron Fein, the constitutional lawyer who serves as legal director for Free Speech For People.",
    "A number of House members have been identified by planners of the “Stop the Steal” rally as having collaborated with them—either directly or via assigned staffers—including Marjorie Taylor Greene of Georgia, Paul Gosar of Arizona, Lauren Boebert of Colorado, Mo Brooks of Alabama, Andy Biggs of Arizona, and Louie Gohmert of Texas.",
    "“The Constitution mandates that those who take the oath to support the Constitution and then violate that oath shall be disqualified from holding office.”\nFormer chief justice of the North Carolina Supreme Court James G. Exum Jr. serves as a lawyer of counsel for the challenge to Cawthorn’s eligibility.",
    "The fact that prominent jurists, lawyers, and good-government activists are on board highlights the seriousness of the initiative, as does the fact that the North Carolina Board of Elections immediately moved to schedule a meeting for the purpose of establishing an official panel to hear the complaint.",
    "In addition, there are eight senators and 139 representatives who, after the deadly assault on the Capitol, gave aid and comfort to the coup attempt by voting to sustain one or both of the objections to the election results that were under consideration when the Trump supporters attacked.",
    "The Cawthorn challenge is vital to the overall process of holding coup plotters and insurrectionists to account, as it goes to the very heart of the question of whether House members must abide by the Constitution they swear an oath to support and defend.",
    "In a lawsuit filed by lawyers with the national group Free Speech for People, along with top election lawyers in North Carolina, voters from the state have mounted a formal legal challenge to Cawthorn’s reelection bid.",
    "Under North Carolina law, a candidate who “does not meet the constitutional or statutory qualifications for the office” they are seeking cannot be listed on the ballot.",
    "So it has fallen to North Carolina voters to demand a review of his candidacy with an eye toward striking his name from the list of contenders.",
    "By this standard, it is entirely appropriate—and necessary—to argue that Cawthorn has disqualified himself from continued service in Congress.",
    "On January 3, 2021, Madison Cawthorn was sworn in as the youngest member of the US House of Representatives.",
    "Cawthorn is the first sitting House member to face such a challenge—but he won’t be the last.",
    "“We look forward to asking him about his involvement under oath.”",
    "Yet Cawthorn is bidding for a second term."
  ]
}