{
  "id": 457,
  "mediaId": 8484,
  "date": "2022-02-20",
  "headline": "Forensic linguists say they now know the origin of the Q texts on the message board that began the QAnon movement",
  "image": "https://i.dailymail.co.uk/1s/2022/02/20/03/54413667-0-image-a-19_1645329460413.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10531793/Forensic-linguists-say-know-origin-Q-texts-began-QAnon-movement.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "whatdoesitmean.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2051,
    2765,
    3190,
    4926,
    4933,
    1101,
    5949
  ],
  "sentences": [
    "+17\nView gallery\nRon Watkins, 35, who is running for Congress in Arizona, defended the messaging of the movement as mostly good but denied being Q\n+17\nView gallery\nSouth African tech journalist Paul Furber, 55, was identified as one of the earlier advocates of QAnon\n+17\nView gallery\nArizona Rep. Paul Gosar met with Arizona congressional hopeful Ron Watkins, who was identified as one of the original authors of the QAnon movement, which he has denied\n'An accidental stylistic resemblance between Watkins and a still-to-be identified author seems quite unlikely,' said Florian Cafiero, a visiting scholar at Columbia University who co-authored the study with Jean-Baptiste Camps from the French École des Chartes.",
    "+17\nView gallery\n The group's leader Brian Protzman (pictured above) maintains that JFK Jr. did, in fact, appear to them that night in the form of Keith Richards during a Rolling Stones concert\n+17\nView gallery\nQAnon rapper Pryme Minister has reportedly offered property for the group to set up a new headquarters in Dallas and called it the QAnon 'promised land'\n+17\nView gallery\nPictures posted to social media by Steven Monacelli, the publisher of Protean magazine, show QAnon followers congregated on the infamous grassy knoll.",
    "+17\nView gallery\nQAnon followers believed that an international child sex ring was run out of this DC pizza shop\n+17\nView gallery\nJacob Anthony Chansley, who also goes by the name Jake Angeli, a QAnon believer known as the 'QAnon Shaman,' speaks to a crowd of Trump supporters in November 2020\n+17\nView gallery\nDevotees of QAnon believed that the 2020 election was stolen from Donald Trump through widespread voter fraud.",
    ": There may now be multiple people posing as Q on the anonymous 4chan boards\n+17\nView gallery\nA QAnon believer blocked the bridge near Hoover Dam with a homemade armored tank in the name of the movement, and later pleaded guilty to terrorism\nHoover Dam: In June 2019, 32-year-old Matthew Wright, a QAnon supporter, blocked the bridge near Hoover Dam in Arizona with a homemade armored vehicle in a 90-minute stand-off.",
    "He pleaded guilty to terrorism charges and has written two letters to Donald Trump from jail, which include the sign-off, which has become the QAnon motto: “For where we go one, we go all.”\nMichael Flynn: Trump’s former national security adviser became a martyr figure for QAnon believers after he took a plea deal from Special Counsel Robert Mueller, admitting he lied about his Russia contacts.",
    "+17\nView gallery\nRoten and Pousaz concluded that Furber and Watkins (pictured) worked together initially, but when the message board migrated to 8chan, Watkins took over\n+17\nView gallery\n'There is probably more good stuff than bad,' Watkins told The Times, enumerating the valuable messages like 'fighting for the safety of the country, and for the safety of the children of the country.'",
    "'While relying on two completely different technologies, both stylometric [quantitative study of literary style] analyses could establish that QAnon's early period on the 4chan forum, from October to December 2017, was likely the result of a collaboration between Paul Furber and Ron Watkins,' according to Claude-Alain Roten, the CEO of OrphAnalytics.",
    "Michael Brian Protzman, on the group's leaders known to his followers as Negative48, helped organize the gatherings and told his 105,000 Telegram followers that QAnon rapper Pryme Minister, whose real name is Randell Moody, has offered the use of a property in the city that could act as a permanent headquarters for the group, according to Vice News.",
    "+17\nView gallery\nQAnon believers make former National Security Advisor Michael Flynn out to be a martyr after taking a plea deal with Robert Mueller\nQAnon Political Candidates: Jo Rae Perkins, 64, won the Republican primary in Oregon in May to run for a Senate seat against incumbent Democratic Senator Jeff Merkley.",
    "Two sets of forensic linguists have published two separate papers using two different techniques to conclude that Q appears to be two people: South African tech journalist Paul Furber, 55, and 4chan internet message board moderator and computer entrepreneur Ron Watkins, 34, according to the studies.",
    "QAnon started out as a fringe group on the obscure and extremely nerdy 4chan internet forum but grew into a global movement that propagated wild conspiracy, like that there was an international child sex ring run by Democrats operating out of a Washington, D.C., pizza shop called Comet Pizza.",
    "QAnon: America's most lurid pro-Trump conspiracy theorist group\nOrigins: Q non started on fringe website 4chan, where a poster calling themselves Q left messages claiming to be a senior federal official and purporting to reveal a 'deep state' cabal intent on bringing down Donald Trump.",
    "At one point, the group stands in the shape of a giant ‘Q'\n+17\nView gallery\nA popular QAnon theory claims that he faked his death\nJFK Jr. died in a plane crash off the coast of Martha's Vineyard in Massachusetts in 1999, along with his wife, Carolyn Bessette and her sister, Lauren.",
    "Q grew out of the discredited 'Pizzagate' conspiracy that top Democrats were involved in pedophilia and cannibalism from the basement of a Washington D.C. restaurant, but quickly picked up steam with 'Q' leaving 'clues' and claims that Trump was going to bring down the deep state.",
    "According to the theory, he would announce that he was running with former President Donald J. Trump in the 2024 presidential election, but Trump would step down and let JFK Jr. step in as president and appoint former National Security Advisor Michael Flynn as his vice president.",
    "Followers of QAnon believed that then-President Donald Trump was a supporter and many of the movement's devotees participated in the January 6 attack on the Capitol based on the debunked belief that the 2020 election was stolen due to widespread computer fraud.",
    "Protzman also offered the theory that JFK, JFK Jr. and Jackie Kennedy would all reappear, after which JFK would tour the world for seven days, transfer the presidency back to Trump and die, Gizmodo reports, even though that is not how presidential power works.",
    "QAnon rapper Pryme Minister reportedly offered property for the conspiracy theorists to set up a permanent headquarters near the infamous grassy knoll at Dealey Plaza - the site of the 1963 assassination of President John F. Kennedy, Vice News first reported.",
    "Pictured: A Q follower in May 2020\n+17\nView gallery\n Furber didn't dispute that Qu's writing resembled his own\nRoten and Pousaz concluded that Furber and Watkins worked together initially, but when the message board migrated to 8chan, Watkins took over.",
    "Roten, who worked with Lionel Pousaz, a partner at OrphAnalytics, took the writings of several people identified as potential Q originators and analyzed writings they had authored then cross-referenced it using computer software with early QAnon posts.",
    "The conspiracy theorists now reportedly believe JFK Jr., the son of former President John F. Kennedy and Jackie Kennedy Onassis, will reveal he switched political affiliations and faked his own death to avoid retribution, according to Gizmodo.",
    "In an audio chat on a Telegram channel called Occupy Dealey Plaza, someone asks Protzman how long the group was going to stay in Dallas, to which he reveals that they seek to maintain a base in there because it is 'the promised land.'",
    "Protzman makes predictions and touts theories based on his own interpretation of gematria, the ancient Jewish numerology code that assigns a numerical value to letters, words and phrases and translates them to create a new meaning.",
    "The group expected JFK Jr. to appear at 12.29 p.m. on November 2 - the time his father was shot dead - but when he failed to arrive, followers dashed off to the Rolling Stones concert at the Cotton Bowl instead.",
    "QAnon followers recently flocked to Dallas in November under the impression that JFK Jr. - who died in a plane crash in 1999 - was going to 'appear' and announce a vice presidential run with Donald Trump.",
    "QAnon conspiracy have spun Flynn pleading guilty into him being a persecuted victim of the deep state – and some even claim he is ‘Q.’\nMany believers put three star emojis next to their Twitter handles.",
    "She claims to have stopped believing in QAnon in 2018, but continues to make controversial statements, and was forced to apologize in June for comparing mask mandates to the Holocaust\nAdvertisement",
    "'There is probably more good stuff than bad,' he told The Times, enumerating the valuable messages like 'fighting for the safety of the country, and for the safety of the children of the country.'",
    "They also believed that after JFK Jr. would appear, the clocks would go back an hour, people would adopt the Julian calendar, and the date would go back to October 20, according to Newsweek.",
    "Many in our govt worship Satan,' was the first post on October 2017 that launched the movement, according to The New York Times, which was given exclusive access to the linguistics studies.",
    "But the retired three-star general has denounced any connections to the group and pulled out of participating in an event after finding out it was hosted by a QAnon believer.",
    "Trump would then 'most likely' become the king of kings, a popular QAnon Telegram account with more than 100,000 subscribers wrote about the conspiracy in a post on Monday.",
    "Although there is no official leader of QAnon, Protzman has create his own cult-like group within the movement that recognizes him as a godlike figure, Vice News reported.",
    "Marjorie Taylor Greene came in first place in the Republican primary in a deep-red Georgia district, and was elected to the US House of Representatives in November 2020.",
    "When reached by the Times, Furber didn't dispute that Q's writing resembled his own, while Watkins, who is running for Congress in Arizona, told the NYT: 'I am not Q.'",
    "He uses his devoted following on Telegram to spread his own conspiracy theories and lore JFK Jr. is the Archangel Michael and Donald Trump is the Holy Spirit.",
    "As such, identifying its authors and their motivations is of great importance to orient future debates,' says Pousaz, a co-inventor at OrphAnalytics.",
    "In March 2021, HBO launched a docuseries called 'Q: Into the Storm' which traces the origins of QAnon to Watkins, whose father owns the 8chan forum.",
    "'QAnon is going to fuel social studies for a long time, and maybe even history, as one of the most singular and concerning movements of our time.",
    "Navy divers found their bodies still strapped into their seats in the wreckage 18 hours after his plane, which he was piloting, disappeared.",
    "Furber told The New York Times that his writing may bare a resemblance to Q because he was so heavily influenced by the moderator's style.",
    "A poll conducted by the Public Religion Research Institute found that 15 percent of all Americans believe the basic tenets of QAnon.",
    "In a telephone interview with The Times from his home near Johannesburg, Furber didn't dispute that Q's writing resembled his own.",
    "It is unclear why the QAnon followers thought JFK Jr. would appear at the location where his father was famously murdered in 1963.",
    "Whenever the conspiracies turn out to not be true, followers rationalize that the inaccuracies are part of Q’s larger plan.",
    "She insisted she goes to QAnon message boards as a “source of information” and claims media focuses too much on the group.",
    "JFK Jr., the theory posits, will then help usher in a new age American prosperity, as his father did in the 1960s.",
    "In 2019, Forbes reports, some believers expected JFK Jr. to return on July 4, again as Trump's running mate.",
    "Instead, he claimed that Q's posts had influenced him so deeply that they altered his prose.",
    "One of the enduring mysteries of the Trump era - 'who is Q' - appears to be solved, sort of.",
    "“I stand with Q and the team,” she said when asked about her interest in the group.",
    "Pousaz defended his unmasking of the QAnon founders as important social science.",
    "They later refused to leave, calling the Texas city their 'promised land.'",
    "Perkins won 49 per cent of the vote against three other Republicans.",
    "It did not specify what becoming the 'king of kings' would entail.",
    "This debunks one theory that Q is a high-ranking military insider.",
    "It 'took over our lives, literally,' Furber told the paper.",
    "Watkins' father reportedly owned the 8chan message board.",
    "More bluntly, Watkins told The Times: 'I am not Q.'",
    "But he defended the messages behind the movement.",
    "The FBI labeled the movement a terror threat.",
    "'We all started talking like him.'",
    "That theory has been debunked.",
    "Watkins has been outed before.",
    "'Open your eyes.",
    "Who is Q?"
  ]
}