{
  "id": 4598,
  "mediaId": 6502,
  "date": "2022-01-06",
  "headline": "AP Declares Mistreatment Of Jan 6th Prisoners Is A 'Conspiracy Theory'",
  "image": "http://www.informationliberation.com/files/640px-DC_Capitol_Storming_IMG_7965.jpg",
  "link": "http://www.informationliberation.com/?id=62788",
  "mediaOutlet": "informationliberation.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Watson",
  "authorUrl": "",
  "termIds": [
    2443,
    111,
    5949
  ],
  "sentences": [
    "On attorney described his client Ryan Samsel's face as looking \"like a tomato that was stomped on,\" after a beating by correctional officers that left him \"blind in one eye, [with] a skull fracture and detached retina.\"",
    "Inmate Ronald Sandlin has also alleged that minority guards are targeting the mostly white inmates with racial abuse, specifically noting that one guard shouted \"I hate all white people and your honky religion.\"",
    "The Associated Press has declared, via its \"fact checkers\", that the mistreatment of hundreds of people still in prison for being involved in the January 6th Capitol incident is a \"conspiracy theory\".",
    "Attorney Joseph McBride appeared last year on CNN in an infamous interview where he vociferously alleged that his client and others are being brutally tortured \"five miles from the White House\".",
    "@RepGosar's Full Remarks On The Horrible Treatment Of January 6th Defendants\n\"What is being described by these political prisoners is nothing short of human rights violations.",
    "Journalist Andy Ngo noted that there have been ongoing reports of abuse of those still incarcerated without trial, but that the AP says it isn't true because they get fed.",
    "The inmates and some of their lawyers have alleged that they are being held in solitary confinement and have been subject to beatings, threats and verbal abuse by guards.",
    "Attorneys of some of the prisoners have previously alleged that they are regularly being denied access to their clients, who are being subjected to torture in jail.",
    "Watch:\nEven CNN itself ran a piece regarding the mistreatment of at least one prisoner who had cancer and was released owing to unsafe conditions in prison.",
    "(@MrAndyNgo) January 5, 2022\nThe piece also asserts that the so called QAnon Shaman Jacob Chansley was even given organic food after requesting it.",
    "\"While it's true some of the suspects have complained about their time in jail, it's wrong to argue they're being held as political prisoners.",
    "Authorities have said the suspects in custody are being given the same access to food and medical care as any other inmate,\" the AP declares.",
    "Lawmakers including Georgia Rep. Marjorie Taylor Greene and Arizona Rep. Paul Gosar have spoken out on the matter:\n.",
    "@DavidKlepper, how did this pass the quality check for fact checking at AP?",
    "The silence from the ACLU & Amnesty International is deafening.\"",
    "pic.twitter.com/Bt2NTMJ5Bi\n— The Columbia Bugle ????",
    "Claim: Jailed Jan. 6 riot suspects are mistreated.",
    "pic.twitter.com/JbUIz9eGpa\n— Andy Ngô ??????",
    "(@ColumbiaBugle) December 7, 2021",
    "Authorities say they get food.",
    "Klepper: False.",
    "."
  ]
}