{
  "id": 4707,
  "mediaId": 2746,
  "date": "2022-04-24",
  "headline": "McCarthy works to stanch the fallout from leaked post-Jan. 6 recording",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/04/22/Congress_McCarthy_56138.jpg-6dde9_c0-0-5298-3090_s1200x700.jpg?ac1aa3497ede3544eeeca6c280e93d5f13a3b687",
  "link": "https://www.washingtontimes.com/news/2022/apr/24/kevin-mccarthy-works-stanch-fallout-leaked-post-ja/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Clark",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "They understand that it is wrong what happened — an attempt to overthrow our government.”\nMr. McCarthy said to party leaders on Jan. 10, 2021, that he planned to tell Mr. Trump that the impeachment resolution brought against the president in the House would likely pass and that he “should resign,” though he acknowledged that Mr. Trump would probably not heed his advice, according to a report Thursday in The New York Times.",
    "And I’ll tell you one thing: Our Republican Party is a very diverse party, and we have diverse opinions, which is good.”\nSen. Roy Blunt, a Missouri Republican who is retiring, said Mr. McCarthy might not have remembered the January 2021 conversation correctly and that he seemed to be working through various possibilities on the call.",
    "“Absolutely, I think Kevin is in very good shape,” Mr. McCaul told “Fox News Sunday.” “In fact, the [former] president came out and said this is not going to endanger his relationship with Kevin, that he’s strongly supportive.”\nMr. McCaul called the issue a “Beltway bubble blip” that won’t resonate with midterm voters.",
    "McCarthy is still the odds-on favorite but now will have to manage skeptical pro-Trump loyalists on his right flank while fending off attacks from across the spectrum over his political stumble: a bald-faced lie about whether he planned to tell Mr. Trump to resign after the Jan. 6 attack.",
    "“And other than that brief period of time, I suspect he likes me quite a bit.”\nRep. Michael T. McCaul, Texas Republican, said he expects House Republicans to swipe up to 40 seats in the midterm elections and that he supports Mr. McCarthy for speaker.",
    "“I’m only one of two people in the history of the country who’ve been elected leaders in both the House and Senate,” Mr. Blunt told NBC’s “Meet the Press.” “I’ve never been in a leadership meeting where you felt like you couldn’t think out loud.",
    "Rep. Kevin McCarthy’s fellow Republicans issued a collective shrug over the unflattering leaked audio, and Mr. Trump told a crowd of supporters on Saturday that he had patched things up with the congressman from California.",
    "Mr. Trump said Friday that he was displeased with Mr. McCarthy’s comments in the recording but added that the two have had a “very good relationship.”\n“I like him,” the former president told The Wall Street Journal.",
    "“@GOPLeader — you should have trusted my instincts, not your own.”\nFormer Trump adviser Steve Bannon said the audio shows that Mr. McCarthy and the Republican Party establishment were plotting to “roll” Mr. Trump.",
    "A spokesman for Mr. McCarthy did not respond to a request for comment, though the 57-year-old Republican leader sprang into action to maintain his position as the front-runner for the speaker’s post.",
    "We have a war in Europe, we have a serious situation on the border,” Ms. Spartz, who was born in Ukraine, told CNN’s “State of the Union.” “I know there is a lot of politics, a lot of drama.",
    "A prominent Democrat called the top House Republican a “traitor” on Sunday for misrepresenting his discomfort with former President Donald Trump after the January 2021 attack on the Capitol.",
    "It is inopportune timing for Mr. McCarthy, who has had his eye on the speakership since 2015 when he ditched his bid to replace retiring House Speaker John A. Boehner, Ohio Republican.",
    "This is outrageous,” Sen. Elizabeth Warren, Massachusetts Democrat, told CNN’s “State of the Union.” “That is really the illness that pervades the Republican leadership right now.",
    "The mixed reaction showcased the suddenly uncertain path forward for Mr. McCarthy, who is gunning for the speakership next year if Republicans, as expected, retake the House.",
    "“While I was rallying in Wyoming against Liz Cheney … Kevin McCarthy was defending Liz Cheney among House Republicans,” Rep. Matt Gaetz, Florida Republican, said on Twitter.",
    "Soon after the article was published, Mr. McCarthy issued a statement calling the reporting “totally false and wrong” and reiterated his allegiance to Mr. Trump.",
    "Mr. McCarthy is still well-positioned to become the next House speaker, Republican insiders say, though that could change if more damning recordings surface.",
    "Mr. McCarthy’s outreach included Mr. Trump, who is out of office but remains influential in the Republican Party and might run for president in 2024.",
    "Mr. McCarthy has worked hard to stay in the good graces of Mr. Trump after briefly splitting with him publicly over the events of Jan. 6.",
    "Boris Epshteyn, an adviser to the Trump 2020 campaign, said the audio is “extremely hurtful” to Mr. McCarthy’s hopes of becoming speaker.",
    "Rep. Victoria Spartz, Indiana Republican, said Sunday from Kyiv, Ukraine, that the U.S. has more pressing issues than the leaked audio.",
    "“I would make sure that Kevin is reaching out to his members ASAP to make sure that he hears their concerns directly,” he said.",
    "And apparently, they have a leadership where you can’t think out loud.”\nIt’s unclear whether Mr. McCarthy is out of the woods.",
    "“I believe Leader McCarthy over The New York Times every time,” said Rep. Paul A. Gosar, Arizona Republican.",
    "The New York Times apparently is sitting on more recordings that could create challenges for Mr. McCarthy.",
    "“I think McCarthy needs to get on this quickly,” said John Feehery, a Republican Party strategist.",
    "For now, most Republican lawmakers are giving Mr. McCarthy the benefit of the doubt.",
    "Others were less forgiving in the immediate aftermath of The Times’ leaked audio.",
    "“This is like a Shakespearean drama,” Mr. Bannon said on his “War Room” podcast.",
    "“These types of ‘scandals’ can grow a life of their own if not handled quickly.",
    "Later Thursday, The Times released an audio recording confirming the reporting.",
    "That they say one thing to the American public and something else in private.",
    "“Kevin McCarthy has a big problem,” Mr. Epshteyn said on Mr. Bannon’s show.",
    "“We need to really deal with serious issues right now.",
    "“Kevin McCarthy is a liar and a traitor.",
    "“He has a big problem.”"
  ]
}