{
  "id": 4798,
  "mediaId": 2754,
  "date": "2022-04-23",
  "headline": "Destroying Democracy To Save It? Court Advances Effort To Block GOP Candidates From Ballots",
  "image": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2022-04/Rep._Marjorie_Taylor_Greene_official_photo_117th_Congress.jpg?itok=7cmVU_tl",
  "link": "https://www.zerohedge.com/political/destroying-democracy-save-it-court-advances-effort-block-gop-candidates-ballots",
  "mediaOutlet": "Zero Hedge",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Durden",
  "authorUrl": "",
  "termIds": [
    5399,
    2013,
    2426,
    2399,
    392,
    1126
  ],
  "sentences": [
    "Chase ruled that Section 3 did not disqualify Sheffey because “legislation by Congress is necessary to give effect to” Section 3 of the 14th Amendment, and disqualification from office “can only be provided for by Congress.”\nCongress later passed the Amnesty Act of 1872, which overrode the Disqualification Clause except for “Senators and Representatives of the thirty-sixth and thirty-seventh Congresses.”\nThe Supreme Court has repeatedly ruled that states cannot impose their own qualifications for Congress because it would “erode the structure envisioned by the Framers.” Under such an approach, partisan state election boards could simply conclude that a member is an insurrectionist and prevent voters from being able to make such choices for themselves.",
    "Totenberg ruled that Greene’s critics could bring a challenge under the Constitution’s 14th Amendment, known as the “Disqualification Clause.” This is the same clause cited by some liberal members of Congress and legal experts as a way to bar dozens of Republicans, including former President Trump, from office for allegedly engaging in insurrection against the United States or giving aid and comfort to its enemies.",
    "At the time, many members were not pleased to see former Confederates like Alexander Stephens (D-Ga.), the Confederacy’s vice president, appear in Congress to retake the very oath they previously violated by waging war against the country.",
    "Whether Jan. 6 was a riot or an actual insurrection remains a matter of deep and largely partisan disagreement — but the disqualification clause was written in reference to a real Civil War in which more than 750,000 people died in combat.",
    "In fairness to the court, Totenberg complained that “the parties devoted little time and few pages to the complicated questions inspired by this novel situation.” As such, she did not feel comfortable in granting an injunction for Greene.",
    "Authored by Jonathan Turley,\nBelow is my column in the Hill on the recent decision of a federal judge to allow a challenge to Rep. Marjorie Taylor Greene (R., Ga.) from appearing on the ballot as an insurrectionist.",
    "Totenberg simply insists that barring an insurrectionist is the same as barring someone from running for president who is not a natural-born citizen or who does not meet the age requirement for Congress.",
    "The latter effort just received a huge boost from a judge in Georgia who has allowed a challenge to knock Rep. Marjorie Taylor Greene (R-Ga.) off the ballot as an insurrectionist.",
    "Cawthorn prevailed in a federal court, which dismissed that effort; an appeal of that ruling will be heard May 3 by the U.S. Court of Appeals for the 4th Circuit in Richmond, Va.",
    "The theory, supported by figures like Harvard Professor Lawrence Tribe, runs against the clear language and history of the Disqualification Clause of the 14th Amendment.",
    "Judge Amy Totenberg ruled that critics could potentially strip Greene from the ballot due to her public comments before and after the Jan. 6, 2021, riot in Congress.",
    "There is another problem: To the extent that a person can be disqualified under the 14th Amendment, it requires action from Congress, not a local board of election.",
    "Here is the column:\nAs the country braces for the midterm elections, the left seems to be rallying behind three D’s: Democracy, Disinformation and Disqualification.",
    "Totenberg is suggesting that a local board declaring a representative to be an insurrectionist is the same as confirming the age or place of birth of a candidate.",
    "However, if such freedom-is-tyranny claims seem Orwellian, they are nothing compared to the push to disqualify dozens of candidates from appearing on ballots.",
    "The problem is that you have to be willing to live with the judgment of your fellow citizens rather than control what they read or who they may vote for.",
    "Despite an otherwise long, careful opinion, Totenberg blithely set aside such details, including an 1869 decision by then-Chief Justice Salmon P. Chase.",
    "This argument most recently was used against Rep. Madison Cawthorn (R-N.C.), who also has been opposed by House colleagues on both sides of the aisle.",
    "Totenberg gave a green light to these constitutional claims despite both the constitutional text and history showing that the claims are meritless.",
    "In the meantime, the Democrats will likely see in November whether the “three D’s” resonate as well with voters as they did with this judge.",
    "The case in question challenged the right of Hugh W. Sheffey to hold a Virginia state court office, given his support for the Confederacy.",
    "Just as free speech allows good ideas to counteract bad ideas, free elections allow good candidates to prevail over bad candidates.",
    "To paraphrase the Vietnam strategy, democracy can only be saved by destroying it through the denial of speech or the right to vote.",
    "Section 3 of the 14th Amendment was written after the 39th Congress convened in December 1865, following the end of the Civil War.",
    "There are similar efforts to block members like Arizona GOP Reps. Paul Gosar and Andy Biggs from appearing on state ballots.",
    "However, age and citizenship are easily ascertainable qualifications stated in the Constitution for all candidates.",
    "Countries like Iran routinely strike candidates from ballots due to their underlying views or perceived disloyalty.",
    "However, that expression of reluctance at the end of the opinion belies the sweeping language used to get there.",
    "No less dangerous, though, is the means being used by some of Greene’s critics to get rid of her.",
    "Many Democratic politicians and pundits have long pushed for censorship as vital to freedom.",
    "The Confederacy was a separate government with its own army, currency and foreign policy.",
    "With the other pending cases, this issue may now be headed for a Supreme Court showdown.",
    "Many of us have criticized Greene for her inflammatory rhetoric and her extreme views.",
    "There is no additional finding or action required for such disqualifications.",
    "It is all part of a new movement to defend democracy by denying it.",
    "Nothing says “democracy” like preventing others from voting.",
    "In my view, the underlying claim is meritless."
  ]
}