{
  "id": 516,
  "mediaId": 2528,
  "date": "2022-02-24",
  "headline": "Marjorie Taylor Greene and the MAGA world position on Ukraine: Biden, a warmonger who is weak, did something wrong",
  "image": "https://i.insider.com/61d74ea137afc20019ac8ed4?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/the-maga-world-position-on-ukraine-is-simple-biden-did-something-wrong-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charles R. Davis",
  "authorUrl": "https://www.businessinsider.com/author/charles-davis",
  "termIds": [
    0
  ],
  "sentences": [
    "Literally, one minute earlier, Gosar was lamenting the fact that Biden was ordering \"our border patrol to leave our border open to help Ukraine with its borders\" — a mischaracterization of an article about the Biden administration sending staff overseas to help evacuate US citizens (Gosar then shared a post about \"endless wars\" distracting from how \"our 2020 election was rigged\").",
    "But Trump too has played both sides, praising Putin for outmaneuvering his successor in the White House, yes, but also insinuating he himself would have been tougher, issuing a statement this week that blasted Biden's \"weak sanctions\" and deplored Russia's \"taking over a country and a massive piece of strategically located land.\"",
    "In a radio appearance on the eve of the Russian attack, former President Donald Trump — who embraced a debunked conspiracy theory that Ukraine's political elite conspired with Hillary Clinton during the 2016 election, a line pushed by a Russian government that itself intervened in that election — praised Putin as a \"genius.\"",
    "The opportunistic \"antiwar\" rhetoric, deployed then forgotten then deployed again, is also not so novel: Out of power, even more traditional Republicans, such as former President George W. Bush, have fallen back on the twin arguments that Democrats are \"weak\" but also overly committed to military adventurism.",
    "Russia's unprovoked attack on Ukraine is providing an opportunity for some Republicans to have it both ways, some of the brightest stars in MAGA World charging President Joe Biden with both weakness and aggression in his approach to Russian President Vladimir Putin.",
    "It's the same dance back in Congress, where far-right lawmakers such as Rep. Paul Gosar of Arizona have praised Putin, saying he \"puts Russia first as he should,\" but see a Russian invasion as a can't-miss opportunity to criticize the White House.",
    "The \"America First\" politics of former President Donald Trump and his allies is defined less by a consistent foreign policy of \"isolationism\" than what it is against, which is often enough, whatever liberals are for.",
    "A month earlier, however, the Republican from Georgia was accusing the president of just that, saying Biden was \"threatening war with nuclear Russia\" because of \"his son Hunter Biden's business dealings in Ukraine.\"",
    "Rep. Matt Gaetz, a Trump ally from Florida, likewise spun Russia's invasion as a failure of the Biden administration to protect borders after previously mocking Democrats' concern over \"the phony threat of Russia.\"",
    "Putin may be responding to American weakness or aggression, who can really say, but per these politicians' statements, one thing's for sure: Joe Biden did something wrong — to provoke a war that's not our fight.",
    "Moments after lamenting, on Thursday, Biden's failure to promise a full-on military intervention in defense of Ukraine, Greene reverted back to the line that \"neocons and liberals\" were agitating for one.",
    "What's arguably different now is the soft spot that some on the right have for a Russian government that is seen as upholding \"traditional\" values and challenging the elite consensus.",
    "As Insider's John Haltiwanger noted on Wednesday, some can't help but admire a strongman who has, above all, succeeded at making liberals from Brussels to Washington look ineffectual.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "The constant here is politics, partisanship, and an unwillingness to fault a right-wing authoritarian who makes \"woke\" liberal elites look bad.",
    "AP Photo/Carolyn Kaster\nFar-right lawmakers are trying to balance tough talk on foreign policy with isolationist slogans.",
    "And following up with a statement on Thursday evening saying that Russia would not attack Ukraine if he was president.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "The rough pivots to the most damaging argument of the minute may appear cynical, but it's not all that confusing.",
    "\"It is obvious the world thinks the Biden regime is incompetent and impotent,\" Gosar tweeted on Thursday.",
    "Russia's invasion of Ukraine, they say, is a product of Biden's \"weakness\" — but also not the US's fight.",
    "\"Americans don't want to be dragged into more never-ending foreign wars on another continent,\" she wrote.",
    "\"It's no surprise to anyone that Putin invaded Ukraine,\" Rep. Marjorie Taylor Green wrote on Twitter.",
    "\"Biden,\" she posted, \"gave him the green light by saying the US is not going to war with Russia.\"",
    "Reps. Matt Gaetz and Marjorie Taylor Greene speak outside the US Capitol on January 6, 2022.",
    "The only real consistency is the argument that whatever Biden does they could do better.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "But one need not go back a month to uncover inconsistency.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "\"Russia's actions make that clear.\"",
    "Loading Something is loading."
  ]
}