{
  "id": 5553,
  "mediaId": 2621,
  "date": "2022-04-17",
  "headline": "GOP Congressman Says the Republican Party is in ‘Troubled Waters’ Thanks to the Marjorie Taylor Greene ‘Element’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-17-at-11.28.07-AM.jpg",
  "link": "https://www.mediaite.com/tv/gop-congressman-says-the-republican-party-is-in-troubled-waters-thanks-to-the-marjorie-taylor-greene-element/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ken Meyer",
  "authorUrl": "https://www.mediaite.com/author/ken-meyer/",
  "termIds": [
    2187,
    4066,
    5245,
    5252,
    3822,
    3246,
    1126
  ],
  "sentences": [
    "He continued to question whether McCarthy would be able to reach the margin necessary to succeed, saying “it will be very hard to govern, for Republicans, if we’re under 230, knowing we’ve got the MTG-element that’s really not a part of a governing majority.”\n“We’ve had wild types of members of Congress since the history of this republic,” Todd said to Upton’s agreement.",
    "Is that a different element than you’ve ever seen before?”\n“I don’t think we’ve had as many folks in that sort of wing of the party elected as we have before, but I think they’re very popular back at home,” Upton answered.",
    "On the possibility of House Minority Leader Kevin McCarthy becoming Speaker, Todd asked Upton “can [he] both represent you and Marjorie Taylor Greene?”\n“He can if he gets the margin,” Upton answered.",
    "Subscribe to\nCongressman Fred Upton (R-MI) said the Republican Party faces “troubled waters” from the rising prevalence of firebrands like Congresswomen Marjorie Taylor Greene and Lauren Boebert.",
    "“What does that tell you about the Republican Party?” Todd asked, to which, Upton responded with “Troubled waters.”\n“That’s why the margin is going to be so [close],” he continued.",
    "Upton gave a broad interview to NBC’s Chuck Todd on Sunday for Meet The Press, which centered around Republican Party agenda will look like if they sweep the 2022 midterms.",
    "She’s not going to lose a vote, and I don’t think she really has in the last year and a half.",
    "“[Nancy] Pelosi’s got the votes, particularly with the use of the proxy vote.",
    "“But Lauren Boebert, and Marjorie Taylor Greene, and Paul Gosar.",
    "None of us want that to happen.”\nWatch above, via NBC.",
    "We’re not going to have proxy votes.",
    "Kevin has made that very clear.",
    "Have a tip we should know?",
    "Want to avoid video ads?",
    "tips@mediaite.com"
  ]
}