{
  "id": 589,
  "mediaId": 8416,
  "date": "2022-02-25",
  "headline": "Local Conservatives to Host Statewide Republican Candidates",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/02/25/local-conservatives-to-host-statewide-republican-candidates-2/?utm_source=rss&utm_medium=rss&utm_campaign=local-conservatives-to-host-statewide-republican-candidates-2",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The local chapter of the Yavapai County’s Conservatives for a Constitutional Republic (ConCR) has announced that Republican candidates for Arizona Governor, US Congress, and Attorney General, will speak at their upcoming meeting this Saturday, February 26, 2022, in Chino Valley.",
    "The Yavapai County chapter of Conservatives for a Constitutional Republic is a group of conservative activists dedicated to defending and promoting the values of representative government as set forth in the United States Constitution.",
    "Recent speakers include Arizona GOP Chair Kelli Ward, Congressmen Paul Gosar and Andy Biggs, State Senator Wendy Rogers and many other prominent conservative figures and candidates for office.",
    "However, most members are registered Republicans or conservative leaning Independents who are civically engaged or are current or former elected officials or candidates for office.",
    "He is running to fill the vacancy created by the current Attorney General, Mark Brnovich, who is running in the Republican primary for a seat in the United States Senate.",
    "However, in the interest of informing voters about important issues and candidates, the appearances of guest speakers of high public interest are open to the public.",
    "His website, www.yatesforarizona.com, sets forth detailed positions on key issues facing Arizona including border security, water, agriculture and public lands.",
    "He also serves in the Air Force Reserve where, as a member of the Judge Advocate Corps, he handles criminal matters under the Uniform Military Code of Justice.",
    "After moving to Arizona twenty years ago, his first job was working for the Arizona Republican Party where he managed statewide voter registration efforts.",
    "She is a business leader and the founder of La Dolce Vita Biscotti Company, headquartered in Arizona, which she built into a multi-million dollar company.",
    "All those wishing to meet the candidates and learn about their positions on the issues of interest to conservative voters are cordially invited to attend.",
    "Mr. Glassman is a practicing attorney in Phoenix with Beus, Gilbert and McRode, where he specializes in corporate law and complex civil litigation.",
    "He describes himself as a Constitutional Conservative and a strong supporter of the Second Amendment, free speech, and the right to life.",
    "Over the coming year President Dutton has scheduled candidates for all top level state and national offices to address the group.",
    "He holds a bachelors degree in government from Harvard University and a Masters Degree in business administration from ASU.",
    "As an immigrant to the United States, she places great value on American heritage and constitutional freedoms.",
    "She sold the company several years ago and now devotes herself to community activism and political work.",
    "Andy Yates is a newcomer to elective office but brings a strong resume of political activism.",
    "ConCR meets monthly at the Bible Baptist Church, 3490 N. State Road 89, in Chino Valley.",
    "They are a private organization and not directly affiliated with any political party.",
    "Ms. Paola Tulliani is a candidate in the Republican primary for Arizona Governor.",
    "He and his wife Sarah, reside in Prescott where they run a small business.",
    "RSVP’s are requested and should be addressed to concr2018@gmail.com",
    "The meeting is free and open to the public but seating is limited.",
    "Rodney Glassman is a candidate for state Attorney General.",
    "Her website gives more information on the issues.",
    "More information can be found on his website.",
    "The meeting will begin promptly at 11:15am.",
    "Those wishing to attend are asked to RSVP.",
    "ConCR is a membership organization.",
    "Doors open at 11am."
  ]
}