{
  "id": 5973,
  "mediaId": 2699,
  "date": "2022-04-22",
  "headline": "‘Oh No, Wait!’: Marjorie Taylor Greene’s Own Words Haunt Her",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2068,w_3676,x_0,y_167/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1650648676/GettyImages-1240152627_l56srk",
  "link": "https://www.thedailybeast.com/marjorie-taylor-greenes-own-words-haunt-her-during-election-hearing?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Corbin Bolies",
  "authorUrl": "https://www.thedailybeast.com/author/corbin-bolies",
  "termIds": [
    2187,
    2426,
    2443,
    2643,
    3246,
    4039,
    5399,
    4905
  ],
  "sentences": [
    "The lawyer had to remind Greene that he had not asked about Pelosi’s commitment to her constitutional oath before citing a CNN article including Greene’s comments, which said Pelosi was “guilty of treason” which is “punishable by death.”\n“Did you say those words that are quoted?” the judge asked Greene after repeated evasions.",
    "“I do not remember” was Greene’s response to multiple questions about whether she spoke to government officials about the run-up to the Capitol attack, including election deniers Reps. Andy Biggs (R-AZ) and Paul Gosar (R-AZ) and anyone in the White House.",
    "Greene tried to paint the lawyer quoting her past comments as having “as many conspiracies as QAnon,” to which he asked her: “Well, you believe in QAnon, right?”\n“I—no, I did not say I believe in QAnon,” Greene insisted.",
    "Rep. Marjorie Taylor Greene (R-GA) was grilled under oath in court Friday as she sought to defend her place on the ballot for this year’s midterms—and had some trouble keeping track of her own wild past statements.",
    "Greene’s status on the May 14 primary ballot was challenged by a Georgian voter, who argued she should be disqualified due to her encouragement of Congress not certifying Joe Biden’s 2020 win.",
    "After her head-turning appearance at the white nationalist America First Political Action Conference, Greene tried to deny knowing who white nationalist Nick Fuentes was and what he stood for.",
    "After she initially denied calling House Speaker Nancy Pelosi (D-CA) a “traitor to our country,” the lawyer questioning her proceeded to pull out an exhibit contradicting her statement.",
    "Greene insisted she couldn’t remember much throughout her testimony Friday as she was asked about her involvement with the Jan. 6 insurrection at the Capitol.",
    "She then tried to backtrack her initial denial, arguing Pelosi’s support for migrants crossing the border amounted to betraying her oath of office.",
    "If Greene is found to be ineligible for the May 14 primary, a notice will be placed next to her name indicating votes for her will not count.",
    "Rep. Madison Cawthorn (R-NC) also had his status challenged due to his actions on Jan. 6, but a judge struck it down.",
    "Her claims were almost immediately quashed after a photo of the two posing together was posted on Twitter.",
    "“According to the CNN article, I did,” Greene said—before trying to spin her comments again.",
    "I believe, by not securing the border, that violates her oath of office,” Greene said.",
    "She is the second Republican lawmaker to face the threat of disqualification.",
    "Her past affinity for QAnon came back to bite her, too.",
    "Greene could not evade all her past actions, however.",
    "Greene’s dalliance with amnesia is not new.",
    "“Oh no, wait, hold on now!"
  ]
}