{
  "id": 6128,
  "mediaId": 2608,
  "date": "2022-04-22",
  "headline": "Seeking to Prevent Her Disqualification, Rep. Marjorie Taylor Greene Claims Under Oath That She Can’t Remember Much About Talks Before Jan. 6",
  "image": "https://lawandcrime.com/wp-content/uploads/2022/04/Marjorie-Taylor-Greene.jpg",
  "link": "https://lawandcrime.com/u-s-capitol-breach/seeking-to-prevent-her-disqualification-rep-marjorie-taylor-greene-claims-under-oath-that-she-cant-remember-much-about-jan-6/",
  "mediaOutlet": "lawnewz.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Klasfeld",
  "authorUrl": "https://lawandcrime.com/author/adam-klasfeld/",
  "termIds": [
    2187,
    2765,
    4045,
    3811,
    5399,
    1126,
    5963,
    6175
  ],
  "sentences": [
    "Greene’s questioning began with a focus on her oath of office because that is how the 14th Amendment’s disqualification clause begins:\nNo person shall be a Senator or Representative in Congress, or elector of President and Vice-President, or hold any office, civil or military, under the United States, or under any State, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.",
    "Confronting Greene on that oath, Celli told the congresswoman that it required her to “support and defend the Constitution of the United States against all enemies” and that she do so “freely, without any mental reservation, or purpose of evasion.”\nPressing Greene on whether she violated that oath, Celli added: “So if someone broke the law, in an effort to interfere with the accounting of the electoral votes, that person would be an enemy of the Constitution: Am I right about that?”\n“Breaking the law is unlawful,” Greene replied, tautologically.",
    "Asked whether she was permitted to take her seat because she took the oath of office, Greene countered: “I became a member of Congress by being elected by the people on the 14th District.”\nSome attended the hearing to support Greene, but her backers were admonished by Administrative Law Judge Charles R. Beaudrot on multiple occasions for sporadically breaking into applause.",
    "Asked whether she knew activist Ali Alexander—whose suspected connection to Jan. 6 is currently being scrutinized by Congress and the Department of Justice—Greene replied that she didn’t “really.”\nThe non-profit group Free Speech for People brought similar against Rep. Madison Cawthorn (R-N.C.) and Rep. Paul Gosar (R-Ariz.) on the same grounds.",
    "“There’s been over 700 people charged for what happened on Jan. 6.”\nThroughout this exchange, Greene’s attorney James Bopp, a longtime GOP lawyer, objected to questions about her beliefs under the speech or debate clause of the U.S. Constitution.",
    "He also questioned whether his client could be asked about her political speech, which he framed as protected because, he said, because it did not rise to incitement under the test established by the Supreme Court in Brandenburg v. Ohio (1969).",
    "On Dec. 19, 2020, Greene shared an article by the far-right disinformation site Epoch Times, stating that then-President Donald Trump called his supporters to the nation’s capital for a “wild” protest on Jan. 6.",
    "Fighting to prevent her disqualification for office during testimony in Atlanta, Rep. Marjorie Taylor Greene (R-Ga.) described broad memory lapses on Friday in response to pointed questions about Jan. 6.",
    "Greene’s testimony had barely begun before a lawyer for her challengers, Andrew Celli of the firm Emery Celli Brinckerhoff Abady Ward & Maazel LLP, asked to treat her as a hostile witness.",
    "Despite limiting the questioning in some respects, the administrative law judge permitted questions about Greene’s tweets in the lead-up to Jan. 6 — before her account was deactivated.",
    "Celli noted that Greene’s tweet did not specify that the protest would be “peaceful.” In fact, Celli said, some of Greene’s social media posts appeared to be explicitly violent.",
    "Five Georgia voters backed by a non-profit group claim that the Donald Trump loyalist should be banned from office under the 14th Amendment’s “insurrection” prohibition.",
    "She claimed not to remember posts from her now-deactivated Twitter account or any of her meetings with fellow Congress members or with the White House before Jan. 6.",
    "Celli added that Greene’s account appeared to “like” a comment suggesting that “bullet to the head” would be a quicker way to remove Pelosi.",
    "Greene claimed not to recall whether or not she did that, noting that many people manage her social media account at various times.",
    "She denied “really” knowing a prominent pro-Trump activist being scrutinized by the Jan. 6 Committee and the Department of Justice.",
    "That’s what treason is.”\nGreene allegedly added that the penalty for such behavior could be expulsion from Congress or death.",
    "Previously a reporter for Courthouse News, he has appeared as a guest on MSNBC, BBC, NPR, PBS, Sky News, and other networks.",
    "He recited one suggesting that House Speaker Nancy Pelosi (D-Calif.) had committed a crime punishable by death.",
    "tips@lawandcrime.com\nLaw&Crime's managing editor Adam Klasfeld has spent more than a decade on the legal beat.",
    "Though Cawthorn succeeded in blocking the challenge, Greene’s federal lawsuit seeking similar relief failed.",
    "She also insisted that she did not remember words for which she was regularly quoted in the press.",
    "But Congress may by a vote of two-thirds of each House, remove such disability.",
    "“She’s a traitor to our country,” Greene wrote in the post, according to Celli.",
    "She gives aid and comfort to our enemies who illegally invade our land.",
    "“The phrase that you used there is #FightforTrump,” Celli noted.",
    "She took an oath to protect the American citizens.",
    "(Screengrab via C-Span)\nHave a tip we should know?",
    "“That’s what it says on my tweet,” Greene said.",
    "Greene’s testimony is ongoing.",
    "“She’s guilty of treason."
  ]
}