{
  "id": 6314,
  "mediaId": 8416,
  "date": "2022-04-13",
  "headline": "Gosar Rips Biden for Latest Assault on Second Amendment",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/04/13/gosar-rips-biden-for-latest-assault-on-second-amendment/?utm_source=rss&utm_medium=rss&utm_campaign=gosar-rips-biden-for-latest-assault-on-second-amendment",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The latest attack, mandating privately made guns contain a serial number will do absolutely nothing to curb the violent crime that is taking place all across the country because of Biden’s soft-on-crime policies but it will further weaken the Second Amendment, which is under constant attack by this administration.",
    "(AZ-04) issued the following statement after the Biden administration submitted a final rule reclassifying gun kits or made-at-home weapons to qualify as firearms under the Gun Control Act.",
    "Background:\nNothing in the Constitution permits the federal government to force Americans to put serial numbers on knives, guns or other weapons they make in their own garages or basement.",
    "Only Congress can change the Constitution and this Second Amendment infringement will not withstand a certain court challenge,” concluded Congressman Gosar.",
    "Serial numbers are used for tracking items, and that is exactly what Biden wants to do here: illegally create a data base of gun makers.",
    "Rather than targeting law-abiding gun owners, Joe Biden should be focused on going after criminals instead of giving them a pass.",
    "The Constitution does not permit this, and the Second Amendment, a fundamental civil right, cannot be abridged in this manner.",
    "“Joe Biden’s unconstitutional assault on gun owners knows no boundaries.",
    "Congressman Paul Gosar, D.D.S."
  ]
}