{
  "id": 6671,
  "mediaId": 8416,
  "date": "2022-04-14",
  "headline": "Joe Biden Continues to Fuel the Crisis Along the Southern Border – Rep. Paul Gosar",
  "image": "https://prescottenews.com/wp-content/uploads/2020/05/favicon2enews-150x150.jpg",
  "link": "https://prescottenews.com/index.php/2022/04/14/joe-biden-continues-to-fuel-the-crisis-along-the-southern-border-rep-paul-gosar/?utm_source=rss&utm_medium=rss&utm_campaign=joe-biden-continues-to-fuel-the-crisis-along-the-southern-border-rep-paul-gosar",
  "mediaOutlet": "prescottenews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Last week, the Biden administration announced it will end the Title 42 public health policy that was implemented under President Trump and has been used for the past two years to quickly expel illegal lawbreakers at the southern border.",
    "As many as 18,000 illegal immigrants per day, which will exceed a half million illegal aliens in April, and countless more amounts of deadly fentanyl will flow across the border because of this inconceivably reckless decision.",
    "Today, Democrats and the Biden administration claim that keeping out sick and infected aliens is somehow wrong and they want American citizens exposed to COVID-19 variants and other diseases.",
    "The Trump administration enacted the Title 42 policy in March 2020 as a public health measure to make sure sick, infected and diseased illegal aliens were not allowed to enter our country.",
    "This announcement comes just days after the U.S. Border Patrol Chief announced the U.S. will soon hit one million illegal border crossings, and we are only in the middle of April.",
    "Notably, Sen. Kelly and Sen. Sinema oppose the Democrat plan to end Title 42; some squishy Republicans support terminating Title 42.",
    "Approximately 1,000,000 million infected illegal aliens were barred by DHS and returned to Mexico or another point of origin.",
    "This policy change will devastate the southern border and cause irrevocable harm to the security of the United States.",
    "Now his decision to end the use of Title 42 is turning a major crisis into a catastrophe.",
    "Our country is under a sustained attack and invasion because of Democrat policies.",
    "Joe Biden’s open border policies caused the invasion along the southern border.",
    "Repealing Title 42 will bring another surge of illegals into our country.",
    "Under the Democrat plan, these sick aliens will be allowed to enter.",
    "Thus, they are terminating the Title 42 expulsion program."
  ]
}