{
  "id": 68,
  "mediaId": 8475,
  "date": "2022-02-24",
  "headline": "Before any U.S. troops are sent to Ukraine, some in Congress want a say",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/022122-ukraine-materiel_1.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/nationworld/report/022422_ukraine_troops_congress/before-any-us-troops-are-sent-ukraine-some-congress-want-say/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ariana Figueroa",
  "authorUrl": "",
  "termIds": [
    2199,
    4905,
    3788,
    3028,
    3008,
    1433,
    6672,
    6678,
    6569,
    6146
  ],
  "sentences": [
    "Nearly 50 lawmakers signed the DeFazio-Davidson letter, including Democrat Cori Bush of Missouri, Rashida Tlaib of Michigan, Raúl Grijalva of Arizona, Darren Soto of Florida, Ilhan Omar of Minnesota, Earl Blumenauer of Oregon and Mark Pocan and Gwen Moore of Wisconsin, along with Republicans Matt Gaetz, Bill Posey and Kat Cammack of Florida, Matt Rosendale of Montana, Yvette Herrell of New Mexico, Andy Biggs, David Schweikert and Paul Gosar of Arizona, Peter Meijer of Michigan, Jeff Fortenberry of Nebraska and Ben Cline and Morgan Griffith of Virginia, among others.",
    "“Therefore, we ask that your decisions comport with the Constitution and our nation’s laws by consulting with Congress to receive authorization before any such deployment.”\nDeFazio said in a statement that the letter is meant to reaffirm the War Powers Resolution, which “states that Congressional authorization is required before the ‘introduction of United States Armed Forces into hostilities, or into situations where imminent involvement in hostilities is clearly indicated by the circumstances.’”\nConcerned about keeping quality reporting alive in Tucson?",
    "They noted that “the War Powers Resolution of 1973 was passed into law after multiple presidential administrations failed to receive congressional approval for over a decade of unauthorized involvement by U.S. Armed Forces in hostilities in Southeast Asia.”\nThe Democratic and Republican lawmakers acknowledged there’s no intention now to place U.S. troops in Ukraine.",
    "“Should your administration seek to introduce U.S. Armed Forces into hostilities or decline to remove any U.S. military personnel currently deployed inside Ukraine from unauthorized hostilities or imminent hostilities, Congress stands ready to deliberate over the potentially monumental implications of such scenarios,” according to the letter.",
    "U.S. Reps. Peter DeFazio of Oregon, a Democrat, and Warren Davidson of Ohio, a Republican, are leading a broad, bipartisan coalition of lawmakers urging the president to not send U.S. troops into Ukraine, or declare war, before receiving authorization from Congress.",
    "“However, if the ongoing situation compels you to introduce the brave men and women of our military into Ukraine, their lives would inherently be put at risk if Russia chooses to invade,” lawmakers said in the letter.",
    "In a Tuesday letter to Biden, the House members cited Article I in the Constitution that gives Congress the power to finance and declare war, along with Article II that names the president as commander-in-chief.",
    "“The American people, through their representatives in Congress, deserve to have a say before U.S. troops are placed in harm’s way or the U.S. becomes involved in yet another foreign conflict,” lawmakers wrote.",
    "President Joe Biden has not dispatched troops to Ukraine following Russia’s invasion and has said he does not intend to do so, but on Tuesday announced sanctions on Russia, as well as on its oligarchs.",
    "Russia’s President Vladimir Putin on Monday directed troops to begin moving into two areas within eastern Ukraine, the Luhansk People’s Republic and the Donetsk People’s Republic.",
    "Bipartisan members of Congress banded together on Tuesday to urge Biden to place tough sanctions on Russia, though some Republicans remained highly critical of Biden.",
    "Biden also said he would move U.S. forces and equipment already in Europe to the three Baltic states — Estonia, Latvia and Lithuania.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "Support TucsonSentinel.com with a contribution today!",
    "- 30 -"
  ]
}