{
  "id": 7098,
  "mediaId": 2621,
  "date": "2022-04-01",
  "headline": "Paul Gosar Blames ‘Miscommunication’ With Staffer For His Address to White Nationalist Nick Fuentes’ AFPAC",
  "image": "https://www.mediaite.com/wp-content/uploads/2021/03/GettyImages-1227814984.jpg",
  "link": "https://www.mediaite.com/politics/paul-gosar-blames-miscommunication-with-staffer-for-his-address-to-white-nationalist-nick-fuentes-afpac/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kipp Jones",
  "authorUrl": "https://www.mediaite.com/author/kipp-jones/",
  "termIds": [
    2443,
    1767,
    4039,
    4066,
    1126,
    1036,
    542,
    99
  ],
  "sentences": [
    "“And there was miscommunication.”\nGosar spoke to AFPAC in-person in 2021:\nRep. Paul Gosar is helping Nick Fuentes recruit young conservatives to his white nationalist, Christian nationalist ideology https://t.co/1yZuAV3oq4 pic.twitter.com/8rzfAhSv5S\n— Right Wing Watch (@RightWingWatch) March 12, 2021\nWhen asked about addressing the White nationalists again this year, Gosar reportedly shrugged it off.",
    "He blamed the appearance on a staffer:\n“It wasn’t supposed to go to Nick’s group,” Gosar told POLITICO, noting that a staffer “misconstrued” directions from his chief of staff.",
    "“The young people that were being misled by somebody — we should be trying to mentor, trying to change them,” he told POLITICO.",
    "House Minority Leader Kevin McCarthy (R-CA) had said he would speak to Gosar and Greene about the appearances at AFPAC.",
    "Rep. Paul Gosar (R-AZ) blamed his video appearance at a White nationalist conference a month ago on his staff.",
    "Gosar appeared at the America First Political Action Committee, as did Rep. Marjorie Taylor Greene (R-GA).",
    "Gosar concluded he and Greene “didn’t know anything about” Fuentes or his group prior to addressing AFPAC.",
    "Fuentes is an ardent Holocaust denier and has made anti-Semitic statements for years.",
    "The tape was intended to go to other groups as a general “welcome video,” he added.",
    "The event was hosted by Nick Fuentes, and was an extreme right alternative to CPAC.",
    "POLITICO spoke with Gosar about a video statement he made addressing AFPAC.",
    "He also said AFPAC was not among groups “authorized” to receive his video.",
    "The United States is at a crisis point,’” Gosar told the outlet.",
    "Nick’s got a problem with his mouth.”\nHave a tip we should know?",
    "“So there is nothing there,” he said he explained to McCarthy.",
    "The video “just basically said ‘welcome to the Miami area.",
    "Gosar said he sent a copy of the video to McCarthy.",
    "“I’ve given up … on dealing with Nick.",
    "“We’re kind of short-handed,” he said.",
    "Have a great conference.",
    "tips@mediaite.com"
  ]
}