{
  "id": 7105,
  "mediaId": 2550,
  "date": "2022-04-07",
  "headline": "Jimmy Kimmel claps back after Marjorie Taylor Greene says she reported his joke to the police",
  "image": "https://images.dailykos.com/images/1051545/story_image/GettyImages-1386034685.jpg?1648052825",
  "link": "https://www.dailykos.com/stories/2022/4/7/2090627/-Marjorie-Taylor-Greene-cheered-on-Jan-6-but-wants-police-to-investigate-a-Will-Smith-joke?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Clawson",
  "authorUrl": "/users/laura clawson",
  "termIds": [
    2187,
    2436,
    2443,
    5699,
    4905,
    3049,
    3246,
    5802,
    474,
    1126
  ],
  "sentences": [
    "@ABC, this threat of violence against me by @jimmykimmel has been filed with the @CapitolPolice,” Greene tweeted, along with a video clip of Kimmel talking about her tweet calling the three Republican senators who supported Judge Ketanji Brown Jackson’s confirmation to the Supreme Court “pro-pedophile.”\n“Wow, where is Will Smith when you really need him,” Kimmel asked in the clip.",
    "I would like to report a joke.”\nRELATED STORY: Kevin McCarthy's failure to act on Gosar and Greene's white nationalist flirtation says it all\nIt’s all mission accomplished for Greene, who got Kimmel to quote-tweet her to his 11.8 million followers, a number Greene can only dream of.",
    "Greene herself lost her committee assignments after a series of revelations about her, including that she had liked other people’s Facebook comments calling for, in one case, “a bullet to the head” for Speaker Nancy Pelosi and in other cases for executing FBI agents.",
    "While in Congress, Greene described congressional Democrats as “enemies to the American people” who “will be held accountable.” That’s a lot closer to a threat than, “Where is Will Smith when you need him?”\nMarjorie Taylor Greene embraces violence.",
    "RELATED STORIES:\nQAnon congresswoman doesn't exactly deny supporting assassinations, then goes on the attack\nFar-right Freedom Caucus is poised to have serious sway if Republicans take the House\nThis is a short blurb about Daily Kos.",
    "Rep. Marjorie Taylor Greene continued her clout-chasing ways on Wednesday afternoon with a tweet claiming to have reported comedian Jimmy Kimmel to the Capitol Police for a joke he made on network television.",
    "Gosar, one of her main buddies in Congress, lost his committee assignments after he tweeted an edited video showing himself murdering Rep. Alexandria Ocasio-Cortez and attacking President Joe Biden.",
    "When Greene posted about the Iran deal, a commenter asked about hanging former President Barack Obama and former Secretary of State Hillary Clinton, to which Greene responded, “Stage is being set.",
    "But fine, if she wants attention focused on threats of violence, let’s be clear about who she is and where the real threats of violence are coming from.",
    "Greene recently escaped meaningful rebuke from Republican leaders when she and Rep. Paul Gosar spoke at a white nationalist event.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "This must be done perfectly or liberal judges would let them off.” Those posts were in 2018 and 2019.",
    "She called Jan. 6 a “1776 moment.”\nShe’s likely not even a little bit upset about that joke.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "But if Greene wants to talk about threats of violence, we can do that.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "In response to Greene’s tweet, Kimmel tweeted, “Officer?",
    "She’s definitely thrilled by the attention.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Players are being put in place.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "We must be patient.",
    "Donate $5 monthly",
    "Please read it.",
    "“."
  ]
}