{
  "id": 7323,
  "mediaId": 2664,
  "date": "2022-04-06",
  "headline": "Trump's trashing of Ukraine pays off for Russia",
  "image": "https://www.rawstory.com/media-library/trump-tours-swing-states-to-stem-election-slide.jpg?id=24495617&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/trump-s-trashing-of-ukraine-pays-off-for-russia/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather Digby Parton",
  "authorUrl": "https://www.rawstory.com/u/heather_digby_parton_salon",
  "termIds": [
    0
  ],
  "sentences": [
    "This isn't like Kosovo when they were voting on whether to authorize airstrikes, it was a purely symbolic statement to back the NATO allies which are bearing a huge burden of taking refugees and a statement of support for NATO's \"founding democratic principles\" citing the threat of \"authoritarian regimes\" and \"internal threats from proponents of illiberalism.\"",
    "\"It's obvious this is where the Trump base is on this issue\"\nAnd, needless to say, aside from his impressive manly manliness, a lot of Republicans appreciate Vladimir Putin because he believes in traditional family values and won't let that \"woke,\" gay agenda infect his culture the way the Democrats have done here.",
    "Because, let's face facts, this is all the Democrats' fault, especially the alleged \"Biden Crime Family,\" and the bogus climate change pushers who cooked the whole thing up to screw up the oil markets and force their radical Green New Deal down the throats of Real Americans.",
    "If anything, they were sympathetic to the Serbian strongman who had been terrorizing the region for most of the decade, Slobodan Miloševic, who was eventually found guilty of war crimes by the International Criminal Court in The Hague.",
    "If you look at that list of the Republicans who voted against this resolution, nearly one-third of the caucus, you'll see that it includes the usual Trumpist suspects and a few more we might not have known was in that faction.",
    "On Tuesday night, the House of Representatives held a vote for a simple, non-binding resolution expressing support for NATO and calling on President Joe Biden to strengthen the organization's commitment to defending democracy.",
    "But after the many decades of reflexive GOP hostility to the Soviet Union and their virulent anti-communist scaremongering, it is still a bit startling to see so many of them suddenly ambivalent about Russian aggression.",
    "The House GOP leader at the time, Tom Delay of Texas, said he didn't trust the president and claimed the crisis was \"falsely described as a huge humanitarian problem, when in comparison to other places, it was nothing.\"",
    "\"Before Tuesday night, 21 House Republicans had already voted against support for Ukraine or sanctions on Russia\"\nTwo weeks later on March 9th, the House voted to suspend oil and gas imports from Russia.",
    "Some believe that Ukraine deserved to be invaded, largely based on the misinformation they've been fed about \"biolabs\" and \"Nazis,\" both of which they believe America is responsible for perpetrating.",
    "North Carolina Rep. Madison Cawthorn and Arizona's Gosar want to prohibit the military from deploying any more troops in support of Ukraine in Europe than are stationed at the Mexican border.",
    "A couple of weeks ago, some Republican senators took to the microphones to declare that the war in Ukraine has shown that Democrats are a bunch of weaklings who can't defend America.",
    "They were so paranoid about it that for a time they believed the entire government was overrun with Russian spies and the whole country was in danger of being overtaken from within.",
    "It's actually not unprecedented for Republicans to vote against military action instigated by Democratic presidents and it isn't even unprecedented for them to refuse to back NATO.",
    "The first vote on March 2nd was a resolution urging sanctions against Russia and military aid to Ukraine for which all of the Democrats, even the true blue anti-war lefties, voted.",
    "NOW WATCH: Trump supporter get stumped by comedian after blaming antifa for the Jan. 6 attack\nTrump supporter get stumped by comedian after blaming antifa for the Jan. 6 attack",
    "Back in the '90s, many of them voted against intervention in the Balkans region after the former Yugoslavia splintered, even in the face of ethnic cleansing and genocide.",
    "Considering all the kind words Trump himself has had to say about Putin ever since he began the invasion, it's obvious this is where the Trump base is on this issue.",
    "Meanwhile, members of this faction are busy proposing legislation of their own, which explains their objections to the aforementioned resolutions and bills.",
    "Their hatred for Clinton was so overwhelming they simply could not support anything he did and frankly, they just didn't care about all those war crimes.",
    "And that number had only grown from one vote to the next, culminating last night in 63 Republicans voting against even expressing support for democracy.",
    "Many of them just don't think the U.S. has any reason to have allies or joint defense agreements, which reveals that they have no knowledge of history.",
    "If the voters are following the same trajectory as their representatives, there are more today than there were a month ago and that's frightening.",
    "That's because they know their party is hopelessly confused about what they need to do to appeal to their base on foreign policy these days.",
    "There was a time when the hard-line right-wingers defined themselves by their antagonism toward America's strongest post-war adversary.",
    "On March 17, the House passed a bill to end favorable trade relations with Russia and Belarus and eight Republicans voted against it.",
    "Elected GOP officials are all over the map on this issue, with a growing faction becoming more hostile to support Ukraine by the day.",
    "I think it's only a matter of time before they propose an invasion of Mexico along the lines of Putin's incursion into Ukraine.",
    "But a lot of this attitude is no doubt due to Trump's trashing of Ukraine and its president Volodymyr Zelenskyy over the years.",
    "They also seem to think that Russia is super strong and America is extremely weak, so it's a mistake to hit the hornet's nest.",
    "And, of course, Trump blamed Ukraine for the election interference in 2016 — no doubt having been told that by Putin himself.",
    "And this wasn't the first House vote that made that clear — although it did garner more votes than any of the previous ones.",
    "That third of the caucus will have an enormous influence if the Republicans take control of the House next January.",
    "These are the people who dress up in the flag and sing \"I'm proud to be an American '' at their wedding receptions.",
    "Only three Republicans declined to support it: Matt Rosendale, R-Mt., Thomas Massie, R- Ky., and Paul Gosar, R-Az.",
    "Before Tuesday night, 21 House Republicans had already voted against support for Ukraine or sanctions on Russia.",
    "10 more Republicans want to bar the delivery of military aid to Ukraine until the border wall is completed.",
    "Some simply don't like NATO and have bought into Trump's nonsensical view that Europe is a \"welfare case.\"",
    "And some of it comes from a very real admiration for Russia, especially its leader Vladimir Putin.",
    "This was the most anodyne resolution under the circumstances you could possibly come up with.",
    "But despite their fist-shaking, you could see they were just going through the motions.",
    "I think what he said accurately summed up the thinking of many Republicans at the time.",
    "This faction within the Republican Party is powerful and it's becoming mainstream.",
    "Some of it is simple contrarianism, of course, just as it was back in the '90s.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "All the Democrats and two-thirds of the Republicans voted for it.",
    "The big question is how many Republican voters are with them.",
    "Two Democrats voted against it as did 15 Republicans.",
    "One of them even called Joe Biden \"Bambi's brother.\"",
    "There is, after all, a Democrat in the White House.",
    "Subscribe to our morning newsletter, Crash Course.",
    "And it seems to be growing in Congress.",
    "But there are other rationales as well.",
    "63 Republicans voted against it.",
    "All of the Democrats voted yes.",
    "So where is this coming from?",
    "(It was not nothing.)",
    "What a shocker?",
    "Not anymore.",
    "Why?"
  ]
}