{
  "id": 7734,
  "mediaId": 2528,
  "date": "2022-04-08",
  "headline": "'Stop the Steal' organizer agrees to cooperate with the Justice Department's Capitol riot investigation",
  "image": "https://i.insider.com/6250d3d5ee61990018dde694?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/stop-the-steal-organizer-ali-alexander-cooperates-with-justice-department-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Erin Snodgrass",
  "authorUrl": "https://www.businessinsider.com/author/erin-snodgrass",
  "termIds": [
    4905,
    2765,
    1442,
    1433,
    226
  ],
  "sentences": [
    "The grand jury subpoena that Alexander received, according to The Times, also seeks information about executive and legislative lawmakers who played a part in the events of January 6 or may have attempted to obstruct the certification of the 2020 election — a sign that the government's investigation could reach the Trump administration and its congressional allies, the outlet noted.",
    "While several rioters have struck cooperation deals with the government, Alexander, who planned multiple pro-Trump post-election events, is the first notable political figure to publicly acknowledge his cooperation with the Justice Department's criminal probe.",
    "The Justice Department's investigation is running concurrently with a congressional probe into the attack, in which lawmakers have issued dozens of subpoenas seeking to link members of Trump's inner circle to the rioters.",
    "A top organizer of the \"Stop the Steal\" movement has agreed to cooperate with the Justice Department's expanded investigation into the January 6 Capitol riot and rally, according to The New York Times.",
    "In a statement provided to The Times by his lawyer, Alexander said he was taking a \"cooperative posture\" with the federal government's investigation but was unsure of what help he could offer.",
    "The Justice Department's January 6 probe was previously focused primarily on the rioters who stormed the Capitol in an attempt to stall Congress's certification of President Joe Biden's win.",
    "Ali Alexander told the outlet via his lawyer that he recently received a subpoena from a federal grand jury seeking information on pro-Trump rallies that followed the 2020 election.",
    "Alexander denied any involvement in the attempted insurrection and via his lawyer on Friday, told The Times that he disavowed anyone who took part in or planned violence on Jan. 6.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Stop the Steal organizer Ali Alexander returns deposition meeting on Capitol Hill with the House select committee investigating the January 6th attack on December 09, 2021.",
    "\"We four schemed up of putting maximum pressure on Congress while they were voting,\" Alexander said in a Periscope video following the attack which has since been deleted.",
    "During the \"Stop the Steal\" event, which was held just blocks from the US Capitol, Trump urged his supporters to \"fight like hell\" and march on the Capitol.",
    "Alexander voluntarily sat for an interview with the panel in late December and handed over his communications with Republican lawmakers preceding the riot.",
    "A federal grand jury is now seeking information from several people linked to the rallies and Trump's efforts to overturn the election results.",
    "But last month, the department expanded the probe to include the planning of former President Donald Trump's rally ahead of the riot.",
    "Photo by Anna Moneymaker/Getty Images\nA \"Stop the Steal\" organizer will cooperate with the Justice Department's Jan. 6 probe.",
    "Alexander previously said that Republican Reps. Andy Biggs, Mo Brooks, and Paul Gosar helped him plan the January 6 rally.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Hundreds of protesters subsequently laid siege to the Capitol in an attack that ultimately led to five deaths.",
    "Last month, the DOJ expanded its investigation to include the rally that preceded the riot.",
    "Ali Alexander told The New York Times he recently received a federal grand jury subpoena.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}