{
  "id": 7757,
  "mediaId": 2859,
  "date": "2022-04-06",
  "headline": "Mitt Romney’s support of Ketanji Brown Jackson unleashes conservative vitriol",
  "image": "https://deseret.brightspotcdn.com/dims4/default/1433ac7/2147483647/strip/true/crop/5826x3326+0+440/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2F03mGJpOodMhISKXNl3cT7Jt2diw%3D%2F0x0%3A5826x3884%2F5826x3884%2Ffilters%3Afocal%283606x2103%3A3607x2104%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F23371213%2FAP22088710504333.jpg",
  "link": "https://www.deseret.com/2022/4/6/23012121/mitt-romney-ketanji-brown-jackson-conservative-backlash-supreme-court-marjorie-greene-pro-pedophile",
  "mediaOutlet": "Deseret News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dennis Romboy",
  "authorUrl": "https://www.deseret.com/authors/dennis-romboy",
  "termIds": [
    2383,
    2187,
    4905,
    4597,
    5699,
    5583,
    1498,
    1489,
    1126,
    1269,
    6684
  ],
  "sentences": [
    "In other tweets, Greene, of Georgia, included a few summarized details of the child pornography cases along with “This is repulsive @MittRomney” and “How would you feel if this was one of your children or grandchildren @Mitt Romney.”\n“The rhetoric from Marjorie Taylor Greene is shocking, both for her apparent disregard of the actual facts at issue and for her eagerness to impugn the motives of senators tasked with the weighty job of advice and consent in the Supreme Court nominations process,” said Chris Karpowitz, co-director for the Center for the Study of Elections and Democracy at Brigham Young University.",
    "After the vote in the Senate to discharge Jackson’s nomination to break an 11-11 tie on the Judiciary Committee, Murkowski said she had “assumed a level of risk” but “there’s three of us that found ourselves in this place where I believe the strength, qualifications of the candidate are such that are appropriate for the court.”\n“Some colleagues on my side of the aisle, I thought, asked respectful questions, and were able to elicit responses from her that I think were very helpful to those that are making an evaluation,” he told CNN’s Kasie Hunt.",
    "Others at The Federalist also piled on Romney as Jonathan Chait pointed out in a New York magazine piece headlined, “Why Republicans are Smearing Everyone as Pedophiles Now.”\n“Sean Davis, CEO of The Federalist, calls attention to a fact pattern he finds significant: ‘Romney opposed KBJ’s nomination to a lower federal court less than a year ago, which means he didn’t decide to support her for SCOTUS until *after* he learned of her horrifying history of going easy on child molesters and pedophiles.’ What could it mean?",
    "“If voters reward this sort of ugly and destructive politics, then we will see more of it, but our constitutional system will be the poorer for it.”\nDonald Trump Jr. weighed in on the GOP senators on Twitter, saying, “If you’re mad at RINOs like Mitt Romney & Lisa Murkowski for caving to the left on KBJ, don’t just complain, make them pay at the ballot box.”\nMurkowski is up for reelection this year.",
    "“People of goodwill are likely to have different preferences about the ideological leanings of the ideal Supreme Court justice, but if those ideological preferences are the only criterion for advice and consent, then the likely effect is to undermine confidence in the potential for the impartial administration of justice,” he said.",
    "“Greene’s abusive behavior has gone on too long and allowing it to continue risks normalizing it further.”\nKarpowitz said when members of either party use Supreme Court nominations merely to score partisan points and are unable to see beyond their own ideologies, it is the court itself, in the end, that is harmed.",
    "“This kind of extreme and overheated rhetoric only makes the nominations process more dysfunctional by needlessly politicizing the debate, leaving little room for anyone to recognize nominees of character, thoughtfulness and experience from the other side of the aisle.”\nGreene and Romney have some recent history.",
    "While it is not uncommon for senators to vote in favor of judges for lower courts but deny support for higher chambers, it is exceedingly rare, if ever, that a senator gives a nominee the green light for the Supreme Court after a vote of rejection for a lower bench,” Tristan Justice wrote in The Federalist.",
    "Senior political reporter Aaron Blake writes that Romney’s decision is significant because he had voted against Jackson for a seat on the appeals court last year, and because it means Jackson will get at least as many crossover votes from Republicans — three — as she did in her previous confirmation.",
    "Murkowski said her decision partly rests “on my rejection of the corrosive politicization of the review process for Supreme Court nominees, which, on both sides of the aisle, is growing worse and more detached from reality by the year,” The Associated Press reported.",
    "Utah Sen. Mitt Romney and two other Republican senators were the target of nasty rhetoric for pledging to support Supreme Court nominee Ketanji Brown Jackson, none more vitriolic than the words spewing from a conservative firebrand in Congress.",
    "A column in the Washington Post headlined, “Mitt Romney historic flip on Ketanji Brown Jackson,” notes Romney made history in 2020 when he became the first senator to vote to convict a president of his own party in an impeachment trial.",
    "People for the American Way, a progressive advocacy group, called for Twitter to suspend Greene’s congressional account after her tweet about Romney, noting the social media platform has already shut down her personal account.",
    "She tweeted, “The only new info since he voted against her a few months ago was increased awareness of her ‘soft-on-pedos’ approach, which makes this new Romney position super interesting.”\n“Interesting how?” Chait wrote.",
    "Also, Romney referred to Greene and Rep. Paul Gosar, R-Ariz., as “morons” for attending a conference put on by a white supremacist where people cheered for Russian President Vladimir Putin after the invasion of Ukraine.",
    "Republicans on the Senate Judiciary Committee, including Utah Sen. Mike Lee, voted against advancing Jackson to full Senate, citing what they say were lenient sentences in child pornography cases, among other reasons.",
    "And were, if you will, doing the things you have to do to get on TV, which I think is unfortunate.”\nRomney did not vote to confirm Jackson when Biden nominated her to serve on the U.S. Court of Appeals for the D.C.",
    "“After this newest reprehensible post by Rep. Greene, it’s time for Twitter to take the next step and suspend her official account as well,” Ben Jealous, the organization’s president, said in a statement.",
    "“Romney’s declared support for Jackson is merely the latest episode of the Utah Republican deliberately splitting from the GOP in defining moments to self-righteously cast himself above the fray.",
    "In voting to confirm Jackson to the Supreme Court, Romney replaces Sen. Lindsey Graham, R-S.C., who supported her nomination to the appeals court but is not voting for her this time.",
    "The Utah senator told reporters Tuesday that after reviewing Jackson’s record and testimony before the Senate Judiciary Committee that he found her to be in the mainstream.",
    "“While I do not expect to agree with every decision she may make on the court, I believe that she more than meets the standard of excellence and integrity,” he said.",
    "“But now she’ll receive at least as much bipartisan support as for her previous confirmation — only the second time that has happened in at least the last 50 years.”",
    "There are MANY more qualified black women judges, that actually can define what a woman is, but Biden chose the one that protects evil child predators.",
    "A Republican should introduce the censure motion tomorrow, Republicans should vote en masse for it, and support her primary opponent,” he tweeted.",
    "Romney, Murkowski and Collins announced that they will vote to confirm Jackson’s nomination when it goes before the full Senate later this week.",
    "Romney rebuked Greene and Rep. Lauren Boebert, R-Colo., for shouting at President Joe Biden during his State of Union speech last month.",
    "“The bigger question is whether voters will hold representatives who engage in extremist rhetoric to account,” Karpowitz said.",
    "“Again, that part is left unsaid.”\nRomney’s decision to vote for Jackson also drew attention as a history-making event.",
    "“A member of Congress accuses 3 (really 53) senators of being “pro-pedophile” for supporting a Supreme Court nominee.",
    "The court, more than any of the other branches of government, depends upon that confidence for its legitimacy.",
    "In response to Greene’s tweets this week, Romney said the “situation is a sad self-indictment” for her.",
    "In a statement Monday, he said he concluded that she is a well-qualified jurist and a person of honor.",
    "It was expected that Jackson would be confirmed, given Democrats’ effective majority,” Blake wrote.",
    "And then Romney, Murkowski, and Collins vote for her,” Greene wrote in a series of tweets Monday.",
    "Romney is also supporting Jackson even though he opposed most of Biden’s judicial nominees.",
    "Lisa Murkowski, of Alaska, and Susan Collins, of Maine, “pro-pedophile” in a Twitter rant.",
    "“Both that and the GOP’s pushback on Jackson makes Romney’s decision more significant.",
    "Chait writes that Mollie Hemingway, the Federalist’s editor, goes a half step further.",
    "Trump Jr.’s tweet includes a plea to send money to Murkowski’s Republican opponent.",
    "Romney, who hasn’t announced if he will run for a second term, is up in 2024.",
    "But he said, “I thought some were preparing for their presidential campaign.",
    "“Any Senator voting to confirm #KJB is pro-pedophile just like she is.",
    "And he is making some history again with the Jackson confirmation.",
    "Circuit last summer, prompting some to call him a flip-flopper.",
    "GOP Rep. Marjorie Taylor Greene called Romney and Sens.",
    "He doesn’t quite say,” he wrote.",
    "This is sick, and dangerous."
  ]
}