{
  "id": 7782,
  "mediaId": 2699,
  "date": "2022-03-31",
  "headline": "The GOP Was Hard to Embarrass. Then Came Madison Cawthorn.",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1648755340/033122-ali-cawthorne-hero_de64cs",
  "link": "https://www.thedailybeast.com/the-gop-was-hard-to-embarrass-then-came-madison-cawthorn?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wajahat Ali",
  "authorUrl": "https://www.thedailybeast.com/author/wajahat-ali",
  "termIds": [
    1874,
    5399,
    5441,
    5052,
    4591,
    2879,
    3702,
    4066,
    1126
  ],
  "sentences": [
    "This includes Cawthorn driving with a revoked license for a second time earlier this month, referring to Ukrainian President Volodymyr Zelensky as a “thug,” describing Ukraine as “incredibly evil,” bringing a knife to a school board meeting, bringing a gun through airport security, being accused of sexual assault, promoting false claims about election fraud and warning of “bloodshed” over future elections, supporting the Big Lie, and posting photos of his visit to Hitler’s vacation home in 2017—in which he said the spot was on his “bucket list.” (I mean, that’s a perfectly normal bucket list wish for 21-year-old American men, right?)",
    "The alleged illicit sex and drugs are not the main reason Cawthorn earned the vocal wrath of his Republican colleagues—such as Sen. Richard Burr, who called Cawthorn an “embarrassment at times” and Sen. Thom Tillis, who said the youngster has “not done much for his House district.” As if to prove their disdain, Burr and Tillis, North Carolina’s two most powerful Republicans, appeared at a fundraiser for Cawthorn’s primary opponent state Sen. Chuck Edwards last week.",
    "According to McCarthy, Cawthorn said his allegations were exaggerations, and also completely changed his story—now alleging he “thinks he saw maybe a staffer in a parking garage 100 yards away.”\n“This is unacceptable,” McCarthy told reporters after the meeting, in which he admonished Cawthorn and told the young lawmaker (who once posted a video of himself beating up a tree) that he had lost his trust.",
    "If you’re keeping score at home: promoting deranged conspiracy theories, supporting a coup, participating in a coup, spreading the Big Lie, appearing at white nationalist conferences, encouraging violence against congressional colleagues, and being accused of sexual assault and having sex with a minor are all perfectly halal for GOP leadership—requiring no censures, punishments or public condemnation.",
    "Even after spending the past six years consistently enabling a racist vulgarian who bragged about grabbing women by the pussy, paid off a porn star to cover up an extramarital affair, and incited a violent insurrection to overturn our elections—it took a bizarre comment by freshman Rep. Madison Cawthorn to force GOP leadership into showing us their embarrassed face.",
    "In fact, more Republicans have spoken about Cawthorn’s wild allegations than the terrifying revelations about Ginni Thomas, wife of Supreme Court Justice Clarence Thomas, who sent 29 bat-shit texts to Trump’s White House Chief of Staff Mark Meadows spouting QAnon conspiracies and urging him to help Trump overturn the 2020 election.",
    "Leader McCarthy concluded Cawthorn’s recent statements are “not becoming of a congressman.” Oddly, McCarthy has been silent on nearly every other instance of Cawthorn’s unbecoming behavior, which can only mean he found them, at the very least, acceptable.",
    "Yet another Freedom Caucus member, Rep. Paul Gosar, has emerged essentially unscathed after speaking at a white supremacist conference and posting a violent anime depicting the murder of Rep. Alexandria Ocasio-Cortez.",
    "Given the current conservative obsessions over “grooming” and fictitious Democrat-run international child sex trafficking rings, it’s odd that GOP leadership has been mute when it comes to speaking out against Gaetz.",
    "He joins Rep. Marjorie Taylor Greene, a walking embarrassment, who also defended her attendance at the same conference in which the crowd of budding white nationalists cheered for Russian tyrant Vladimir Putin.",
    "What should have been a salacious story of D.C. sexual politics (and a middle-aged lament on my part as to why I haven’t been invited to such amazing events) has instead become a full-blown GOP family drama.",
    "Instead, they reserved all their bad-faith outrage and theatrical brimstone for Supreme Court nominee Judge Ketanji Brown Jackson last week, when they grilled her over her sentencing in child porn cases.",
    "On the right-wing social media platform Gab, Stone wrote, “Congressman Madison Cawthorn just told me [he] has NOT retracted his claims about drug-fueled orgies among D.C. elites.”\nWho should we believe?",
    "Cawthorn got a little too comfortable on a podcast last week, waxing poetic about Republican orgies—a.k.a “sexual get-together[s]”—featuring “key bumps of cocaine” at an older colleague’s home.",
    "However, the Freedom Caucus is perfectly fine with its member Rep. Matt Gaetz, who has been accused of having sex with a minor and also actively promotes the Big Lie.",
    "It’s a mortifying episode for the Republican Party, but unlike so many other outrageous sins committed by GOP members, the leaders are actually mortified this time!",
    "According to Politico, even the House Freedom Caucus, which includes the GOP Justice League of freaks, nuts and racists, has apparently “soured” on Cawthorn.",
    "The message to other Republicans is clear: Do your part to help burn American democracy to the ground, but keep your mouth shut about “key bumps of cocaine.”",
    "Cawthorn and other Republicans promote racism, violent conspiracy theories, and the Big Lie, and GOP leadership considers it just part of doing business.",
    "There was no paternalistic sit-down with him or a public lashing by Republican leaders, just some grumbles from Senate Minority Leader Mitch McConnell.",
    "House Minority Leader Kevin McCarthy and other senior GOP leaders met with Cawthorn, the youngest Republican in Congress, at the Capitol on Wednesday.",
    "All of this was within the parameters of acceptable behavior for Republican leaders, but mouthing off about orgies was simply a bridge too far.",
    "“You can’t make statements like that as a member of Congress, it affects everybody else and the country as a whole,” said McCarthy.",
    "But when it comes to telling some salacious tales, Leader McCarthy believes you’re setting a bad example and harming the nation.",
    "Longtime GOP dirty trickster Roger Stone, who has a friendly history with orgies, came in with a last-second plot twist.",
    "This week was a revelation—we finally discovered that Republican leaders actually have limits to their shamelessness.",
    "They asked him to name the people involved in the alleged orgy.",
    "But wait, we’re not done!",
    "Who cares?"
  ]
}