{
  "id": 78,
  "mediaId": 2621,
  "date": "2022-02-25",
  "headline": "Marjorie Taylor Greene Speaks at White Nationalist Conference Where Crowd Cheers Russia and Host Praises Hitler",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/02/Screen-Shot-2022-02-25-at-8.16.33-PM.jpg",
  "link": "https://www.mediaite.com/politics/marjorie-taylor-greene-speaks-at-white-nationalist-conference/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Luciano",
  "authorUrl": "https://www.mediaite.com/author/michael-luciano/",
  "termIds": [
    2240,
    4591,
    4039,
    72,
    1394,
    6678,
    6569,
    6509
  ],
  "sentences": [
    "pic.twitter.com/pJps00s4ei\n— The Republican Accountability Project (@AccountableGOP) February 26, 2022\nIn another, Fuentes said, “Now they’re going on about Russia and Vladimir Putin is Hitler they say that’s not a good thing.”\nNick Fuentes, the host of the White Nationalist event featuring @RepMTG @RepGosar and Wendy Rogers,\nsaid:\n“Now they’re going on about Russia and Vladimir Putin is Hitler they say that’s not a good thing.” pic.twitter.com/6vvyNGO2m7\n— The Republican Accountability Project (@AccountableGOP) February 26, 2022\nGreene complained that Twitter had banned her personal account “because I tweeted out the truth about Covid-19.”\nFuentes is the leader of the so-called “groyper” movement – a collection of internet trolls that attempts to inject far-right and white nationalist rhetoric into mainstream conservatism.",
    "AFPAC is led by white nationalist Nick Fuentes, who told the crowd, “Our secret sauce here – it’s these young, White men.”\nThe Anti-Defamation League has described Fuentes as “a white supremacist leader and organizer and podcaster who seeks to forge a white nationalist alternative to the mainstream GOP.”\nFuentes’ line about young White men received hoots and hollers of approval.",
    "pic.twitter.com/I8BGH1TYGm\n— Ben Lorber (@BenLorber8) February 26, 2022\nIn one clip posted to Twitter, Greene said, “I have been attacked more than any other freshman member of congress in United States history.”\nTonight, @RepMTG was the surprise guest at a rally hosted by far-right white nationalist Nick Fuentes.",
    "And I look at China, I look at Russia, who – can we give a round of applause for Russia?”\nThe crowd obliged and raucously cheered the nuclear power that launched an unprovoked invasion of Ukraine this week.",
    "Some in the audience began chanting, “Putin, Putin,” to which Fuentes replied, “Absolutely, absolutely.”\nShortly before bringing up MTG, the camera showed a sizeable and raucous crowd.",
    "Fuentes then solicited a round of applause for Russia in its invasion of Ukraine, and the groyper crowd chanted \"Putin, Putin.\"",
    "Rep. Marjorie Taylor Greene (R-GA) spoke at the America First Political Action Conference on Friday.",
    "\"I have been attacked more than any other freshman member of congress in United States history.\"",
    "He has been subpoenaed by the House committee investigating the Jan. 6 Capitol insurrection.",
    "“America and the world has forgotten about them, but not us,” he continued.",
    "“You know, they say about America, diversity is our strength, you know?",
    "Greene is the second sitting member of Congress known to address AFPAC.",
    "In 2021, Rep. Paul Gosar (R-AZ) of Arizona gave the keynote address.",
    "Fuentes praised \"our secret sauce…young white men.\""
  ]
}