{
  "id": 7895,
  "mediaId": 2520,
  "date": "2022-04-07",
  "headline": "Rep. Paul Gosar promotes, then disavows, extremist group's event",
  "image": "https://www.gannett-cdn.com/presto/2021/11/10/PPHX/b07fb40c-5fd5-4f3b-83a9-fe439d1b08d4-AP21313299334094.jpg?crop=5999,3374,x0,y31&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/04/07/rep-paul-gosar-denies-involvement-far-right-group-event/9498207002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald J. Hansen",
  "authorUrl": "https://www.azcentral.com/staff/2647673001/ronald-j-hansen/",
  "termIds": [
    2443,
    1676,
    4257,
    4039,
    1126
  ],
  "sentences": [
    "Supreme Court won't let Arizona voters weigh in on tax cut Brnovich takes election manual fight with Hobbs to court Karrin Taylor Robson drops fundraising tactic after questions AZ House Speaker Rusty Bowers wins award for courage\nLast year, House Democrats stripped him of his committee assignments after he echoed on social media a violent animation that depicted him killing Rep. Alexandria Ocasio Cortez, D-N.Y., and taking aim at President Joe Biden.",
    "Vince Dao, chairman of the group, called it a “logistical decision made based on venue availability — and nothing more.”\n“Planners on our team were not even aware that April 20 (a day far more known for its connection to marijuana, frankly) was Hitler’s birthday.",
    "His penchant for spreading the false narrative of a stolen election in the U.S. in 2020 has brought similar calls for him to be probed by the House Ethics Committee and the special committee examining the causes of the Jan. 6, 2021, riot at the U.S. Capitol.",
    "… We are not affiliated with ‘neo-Nazism’ or ‘white nationalism.’ We are authentic American conservatives who stand for faith, family and tradition.”\nReach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493.",
    "Gosar's bare-knuckles political style has long appealed to extremists in the U.S., Great Britain and put him on the same side as authoritarians like Russian President Vladimir Putin and Hungarian Prime Minister Viktor Orban.",
    "The Anti-Defamation League has cast the APU as \"a Groyper-esque group that champions anti-immigration and anti-LGBTQ+ sentiments and regards the modern GOP as a corrupt, globalist conservative establishment.\"",
    "Gosar's office denied Thursday he was planning to attend the group's conference or address it in any way, though he has mentioned it on his Instagram account and the group touted it on its Twitter feed.",
    "Gosar, R-Ariz., has promoted an event in Tempe for the American Populist Union, a relatively new group popular with \"Groypers,\" that falls on a day revered by extremists: Adolf Hitler's birthday.",
    "The latest flap comes days after Gosar sought to distance himself from Nick Fuentes, the white nationalist whose group Gosar addressed in person in 2021 and greeted by video message in February.",
    "Last year, he and Rep. Marjorie Taylor Greene, R-Ga., were linked to the formation of an \"America First\" caucus on Capitol Hill that was abandoned after rare, bipartisan pushback.",
    "In a statement posted on its Twitter account on Thursday, the APU ripped “slanderous liars” in the media for noting the April 20 Tempe event falls on Hitler’s birthday.",
    "Rep. Paul Gosar has once again brought national attention to a far-right group and its efforts with his name dangled as a participant, only to be later disavowed.",
    "The denial came after his potential involvement was first reported by the Arizona Mirror and ricocheted up to the Washington Post, Rolling Stone and MSNBC.",
    "House Speaker Nancy Pelosi, D-Calif., called for an ethics investigation of Gosar over the matter.",
    "He told Politico that a staffer mistakenly sent the message to Fuentes' group.",
    "Gosar has been linked to a fundraiser with Fuentes that was later walked back.",
    "The APU said Gosar withdrew from the event because of a scheduling conflict.",
    "Subscribe to our free political podcast, The Gaggle.",
    "Follow him on Twitter @ronaldjhansen.",
    "Subscribe to azcentral.com today.",
    "Support local journalism."
  ]
}