{
  "id": 7935,
  "mediaId": 2688,
  "date": "2022-04-06",
  "headline": "Where Things Stand: Gosar Is Done ‘Dealing With Nick’ Fuentes So Stop Asking",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/04/GettyImages-1383120591-scaled.jpg",
  "link": "https://talkingpointsmemo.com/edblog/gosar-done-nick-fuentes-stop-asking?utm_source=rss&utm_medium=rss&utm_campaign=gosar-done-nick-fuentes-stop-asking",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jackie Wilhelm",
  "authorUrl": "https://talkingpointsmemo.com/profile/jackiewilhelm",
  "termIds": [
    0
  ],
  "sentences": [
    "The Best Of TPM Today\nHere’s what you should read this evening:\nA new must-read from Josh Kovensky in TPM Prime: Russia’s ‘Denazification’ Strategy Emerges, Including Specific Ukrainian Targets | Talking Points Memo\nFrom TPM Cafe: Russia’s War Tests Evangelicals’ Support Of Putin As An Anti-LGBTQ World Leader\nDumb of the day: Gingrich Records Himself Flipping Endorsement To Trump-Backed Candidate, Then Insists He Didn’t Do That\nYesterday’s Most Read Story\nOh Look, Yet Another Former Trump Official Seems To Have Done A Voter Fraud — Cristina Cabrera\nWhat We Are Reading\nRussian influencers scramble to maintain their followers — and livelihoods — Andrew Deck and Masha Borak\nThe bond that explains why some on the Christian right support Putin’s war — Bethany Moreton",
    "After news broke that Gosar and Greene addressed the crowd at the white nationalist-hosted event, Senate Minority Leader Mitch McConnell (R-KY) boldly declared, “there’s no place in the Republican Party for white supremacists or anti-Semitism.” House Minority Leader Kevin McCarthy (R-CA) called their participation in the event “appalling,” but did little in terms of addressing the issue or punishing the two lawmakers for giving Fuentes and his followers the time of day.",
    "Rep. Paul Gosar (R-AZ) has addressed the crowds at white nationalist Nick Fuentes’ events the last two years in a row — most recently sparking uproar after both he and Rep. Marjorie Taylor Greene (R-GA) appeared at the America First Political Action Conference last month.",
    "He claimed the pre-recorded video of him that was featured at the Fuentes event was meant to be sent as a general “welcome video” to other types of conservative group conferences, but a staffer in his office “misconstrued” things!",
    "In an interview with Politico, Gosar admitted he “wasn’t suppose to go to Nick’s group” again, before blaming his staff for sending his video-recorded address to the organizers of the Fuentes conference.",
    "Despite receiving abnormally swift condemnation from GOP leadership after news of his appearance broke, Gosar had not yet addressed the bipartisan backlash to his speech until just a few days ago.",
    "Nick’s got a problem with his mouth,” which is one way to say the man has repeatedly spewed white nationalist talking points and racist and anti-Semitic rhetoric for years.",
    "All these various conservative groups’ names sound like organizers filled out a madlib after attending a Trump rally to land on an official name.",
    "When Politico asked whether he’d met with McCarthy about it yet, Gosar responded, “Why would I?”)\nBut fret not, Gosar has learned his lesson.",
    "Gosar told Politico the video was actually meant to be sent to American Principles and CPAC event organizers, not Fuentes’ group.",
    "The two reportedly were asked to sit down with McCarthy for a nice long chat, which … punishment enough.",
    "(Gosar apparently hasn’t actually had to talk to the minority leader about the issue.",
    "“And there was miscommunication.”\nYou can’t really blame said staffer.",
    "He told Politico he has “given up … on dealing with Nick.",
    "“We’re kind of short-handed,” he said."
  ]
}