{
  "id": 831,
  "mediaId": 5308,
  "date": "2022-02-22",
  "headline": "The QAnon-host-turned-congressional-candidate can add bad poetry to his resume.",
  "image": "https://video-images.vice.com/articles/6214da202a2d7d0096688f46/lede/1645538404384-ron-watkins-qanon-congress.jpeg?image-resize-opts=Y3JvcD0xeHc6MC41NjE4eGg7MHh3LDAuMjI4NXhoJnJlc2l6ZT0xMjAwOiomcmVzaXplPTEyMDA6Kg",
  "link": "https://www.vice.com/en/article/jgmb7d/ron-watkins-q-drops",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Gilbert",
  "authorUrl": "https://www.vice.com/en/contributor/david-gilbert",
  "termIds": [
    0
  ],
  "sentences": [
    "Watkins has sought support from the most extreme elements within the Republican Party, and this week met with far-right Arizona lawmaker Rep. Paul Gosar, posting a picture of them together on his Telegram channel and calling Gosar the “most patriotic congressman in America today.”\nAs he continues to campaign in Arizona, Watkins posted a link to his campaign fundraising website at the end of his poem, hoping that those sending him money are not poetry ?",
    "It was his way of rebutting claims made in a bombshell New York Times report on Sunday that revealed that two separate teams of forensic linguists had concluded that Watkins, together with a South African software developer named Paul Furber, were the likely authors of the almost 5,000 so-called “Q drops” that make up the basis for the QAnon conspiracy movement.",
    "While his fundraising efforts are paltry in comparison to his main rivals, his campaign has managed to gain some momentum—mostly built on ridiculous stunts like visiting the border wall at night and shouting at school board meetings.",
    "Watkins has built his entire celebrity from QAnon, first as administrator of the site where it blossomed to become a mainstream force, and then as an “expert” on election fraud who was embraced by the pro-Trump ecosystem.",
    "And Watkins all but admitted his involvement in last year’s HBO documentary series “Q: Into the Storm.”\nMost credible QAnon researchers agree that this explanation, in broad strokes at least, is how QAnon evolved.",
    "The new research from data scientists in France and Switzerland, who employed machine learning techniques to identify Furber and Watkins as the authors, provides some empirical evidence to back up the theory.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "In the 14 months since Q’s last post, QAnon has continued to thrive, and in 2021 there was a dramatic increase in the number of violent incidents linked to the conspiracy movement.",
    "“I learned how to use [the Socratic method] from Q, [which] I use often in my posts now,” Watkins recently said in a podcast interview with an election conspiracy theorist.",
    "We all started talking like him.”\nBut the scientists pointed out that some of the social media posts used to compare Furber’s writing and that of Q were contemporaneous.",
    "?aficionados put off by his clumsy attempt to get “spirit” to rhyme with “pivot.”\n“In spite of their attacks on our spirit,\nWe persevere and stand our ground with pride.",
    "Furber, speaking to the New York Times, had the same explanation for why his writing style was almost identical to Q’s: “[His messages] took over our lives, literally.",
    "Watkins penned a poem entitled “I am not Shakespeare” and posted it on his Telegram channel Monday night, along with an audio recording of him reading the poem.",
    "But ultimately, of course, to the people who still believe in QAnon, it doesn't matter what the data scientists find or what the New York Times reports.",
    "Our God's good grace and love does not pivot,\nNo man, malign in thought, may break our stride.”\nWant the best of VICE News straight to your inbox?",
    "The title of the poem refers to the final two lines, where Watkins argues that writing a poem like the English bard doesn’t make him Shakespeare.",
    "This is a reference to Watkins’ admission that he has mimicked the style of Q posts in his own writing but only after reading the Q drops.",
    "Then NPR’s “Reply All” podcast posited the theory that Watkins had stolen QAnon from Furber using his administrator privileges on 8chan.",
    "The theory that QAnon was started by Furber and then taken over by Watkins when it moved from 4chan to 8chan is not new.",
    "“This sonnet wrote in style of old is clear; Where does it prove that I am Bill Shakespeare?” Watkins asks.",
    "Ron Watkins, the QAnon-host-turned-congressional-candidate, has added a new title to the list: poet.",
    "Now, he’s trying to test just how far he can take his notoriety by running for Congress in Arizona.",
    "Dozens of QAnon adherents were arrested for taking part in the Jan. 6 attack on the Capitol.",
    "All lies they spread are spread with utter glee,” Watkins wrote in the poem’s opening verse.",
    "Real truth is hard for leftist sheep to see; Their claims are not substantial in my view.",
    "Furber’s early involvement was first highlighted by NBC reporters in 2018.",
    "“Not once, no where, was I involved with Q.",
    "Sign up here."
  ]
}