{
  "id": 88,
  "mediaId": 8475,
  "date": "2022-02-21",
  "headline": "Wendy Rogers, Kari Lake and Joe Arpaio listed as speakers at white nationalist conference",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/022122_kari_lake.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/022122_white_nationalist_speakers/wendy-rogers-kari-lake-and-joe-arpaio-listed-as-speakers-white-nationalist-conference/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerod MacDonald-Evoy",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/65775",
  "termIds": [
    2706,
    4039,
    4148,
    340,
    351,
    751,
    1394,
    6292,
    6159
  ],
  "sentences": [
    "Flagstaff Republican state Sen. Wendy Rogers, former Maricopa County Sheriff Joe Arpaio and gubernatorial candidate Kari Lake are all listed on the America First Political Action Conference website as being in attendance, with Rogers and Arpaio as “featured speakers.”\nThe third annual America First Political Action Conference, or AFPACIII for short, is the brainchild of white nationalist Nick Fuentes.",
    "Rogers did not reply to a request from the Mirror confirming if she is attending but on Twitter in response to the flier said she has always “been supportive of America First for a long time.”\nLake, the former television journalist now running as a Republican for governor, said on Twitter that a flier touting her involvement was a “false photo,” adding that she is not taking part in the conference.",
    "“You don’t think I’m going to turn my back because of controversial people?” Arpaio said, adding that he doesn’t agree with white nationalism and he plans to speak only about the “war on cops and illegal immigration.”\nArpaio said he was invited to speak by “Mommy Groyper” Michelle Malkin.",
    "(“This is going to be the most racist, sexist, anti-Semitic, Holocaust-denying speech in all of Dallas this weekend,” Fuentes boasted of one of his upcoming speeches after he was kicked out of CPAC in 2021, the Daily Beast reported.)",
    "Other Arizonans will also be in attendance at the event as “special guests.”\nAnthime “Tim” Gionet, a right-wing activist who goes by the moniker Baked Alaska online, will be there.",
    "None of that was a problem for Arpaio, who told the Arizona Mirror he didn’t care that he would be speaking to a gathering of white nationalists and helping promote their event.",
    "AFPACIII is part of the Groyper movement, white nationalists and far-right activists who often troll conservatives who they feel are not extreme enough.",
    "Local\nArizona Republican politicians, including a sitting state senator, are scheduled to speak at a white nationalist conference in Florida next week.",
    "Rogers responded on Twitter to a reporter who publicized her listing as a speaker by saying the journalist has “no idea” what he was talking about.",
    "But Rogers is a vocal fan of Fuentes, authoring at least two dozen fawning social media posts about him, according to Left Coast Right Watch.",
    "It is designed to be a rival to CPAC, the Conservative Political Action Conference, and is scheduled on the same days at a nearby location.",
    "Gionet live-streamed his attendance at the Jan. 6 insurrection and has been charged with damaging a Hanakauh display at the State Capitol.",
    "and one of their strategies is by presenting their views in a mainstream appearance or within mainstream organizations.",
    "Last year, U.S. Rep. Paul Gosar, R-Prescott, was the first sitting congressman to ever speak at the conference.",
    "Take it easy on her we support her,” Fuentes told his supporters, who had been lashing out at her on Twitter.",
    "Though loosely organized and members of many different groups, Groypers are almost all followers of Fuentes.",
    "Fuentes is an avowed racist and Holocaust-denier who advocates for a white, Christian American theocracy.",
    "He also has faced charges for assault, disorderly conduct and criminal trespass in a case in Scottsdale.",
    "One of the main goals of Groypers is to push conservatives in a white nationalist direction.",
    "The flier for AFPAC III still lists two “mystery” speakers who have yet to be announced.",
    "On Telegram, Fuentes said that Lake planned to attend but had a scheduling conflict.",
    "They have a well-documented history of antisemitism and racist remarks.",
    "She did not return requests for comment from the Arizona Mirror.",
    "“I have been supportive of America First for a long time.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "Thanks for reading TucsonSentinel.com.",
    "Thanks for reading TucsonSentinel.com.",
    "This isn’t ‘news,’” she wrote.",
    "“Just a misunderstanding.",
    "- 30 -"
  ]
}