{
  "id": 9305,
  "mediaId": 2716,
  "date": "2022-03-28",
  "headline": "Jan. 6 committee moves to hold Trump aides Peter Navarro and Dan Scavino in contempt",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1648516193/GettyImages-1230441722.jpg",
  "link": "https://theweek.com/jan-6-committee/1011879/jan-6-committee-moves-to-hold-trump-aides-peter-navarro-and-dan-scavino-in",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Catherine Garcia",
  "authorUrl": "https://theweek.com/authors/catherine-garcia",
  "termIds": [
    2259,
    2151,
    2765,
    5322,
    4345,
    4905,
    3925,
    564,
    1442
  ],
  "sentences": [
    "The committee's report also stated that Scavino \"reportedly attended several meetings\" with Trump \"in which challenges to the election were discussed,\" and was part of a campaign to spread false information on social media about \"alleged election fraud and recruiting a crowd to Washington for the events of January 6th.\"",
    "The House select committee investigating the Jan. 6 Capitol attack voted unanimously on Monday night to recommend Peter Navarro and Dan Scavino be referred to the Department of Justice for criminal contempt of Congress charges.",
    "In January, Navarro appeared on MSNBC and admitted to host Ari Melber that he concocted a plan called the \"Green Bay Sweep\" with Stephen Bannon, former President Donald Trump's onetime chief strategist.",
    "It was a way to overturn Biden's electoral victory, and Navarro explained that more than 100 members of Congress were prepared to participate, challenging the results in \"six battleground states.\"",
    "On Sunday night, the committee issued a report stating that Navarro and Scavino have both claimed that because of \"executive privilege,\" they don't have to cooperate with the panel.",
    "The panel previously voted on criminal referrals for Bannon and former White House Chief of Staff Mark Meadows, after they both ignored subpoenas from the committee.",
    "He said the plan was launched \"beautifully\" by Sen. Ted Cruz (R-Texas) and Rep. Paul Gosar (R-Ariz.), but thwarted by the pro-Trump mob storming the Capitol.",
    "Both have refused to cooperate with the Jan. 6 committee, ignoring subpoenas for their testimonies and documents related to the Capitol riot.",
    "The Justice Department has not yet acted on the referral against Meadows, but Bannon has been charged with two counts of contempt.",
    "During the Trump administration, Navarro served as a trade adviser and Scavino was White House deputy chief of staff.",
    "President Biden has already waived executive privilege in relation to the investigation.",
    "He pleaded not guilty, and his trial is expected to begin in July.",
    "Navarro has said that Trump \"was on board with the strategy.\""
  ]
}