{
  "id": 9778,
  "mediaId": 2532,
  "date": "2022-03-31",
  "headline": "McCarthy rebukes Cawthorn over his claims that lawmakers have invited him to orgies and use drugs",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/03/31/be1cb680-4428-4d6c-a7b8-09595fec02c2/thumbnail/1200x630/1ce25ae09298437107643db74a221ae8/gettyimages-1238861874.jpg",
  "link": "https://www.cbsnews.com/news/kevin-mccarthy-rebukes-madison-cawthorn-drug-use-allegations-orgy-invitation/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melissa Quinn",
  "authorUrl": "",
  "termIds": [
    5399,
    4066,
    3049,
    1126,
    6175,
    6456,
    6038,
    6709
  ],
  "sentences": [
    "Ellis Kim contributed to this report\nTrending News\n Supreme Court to hear case of praying football coach who lost job\n Florida governor signs bill that strips Disney of special tax status\n Greene testifies against challenge to her congressional candidacy\n Russian military vehicles abandoned\n Mayorkas says U.S. is preparing for \"significant\" border challenges",
    "McCarthy's rebukes came after House Democrats had lambasted him for not doing enough to address behavior from other Republican members, namely Rep. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona, who both spoke at a gathering of white nationalists last month.",
    "Gosar was also stripped of his committee assignments and censured by the House after he posted an edited anime video to his social media accounts that depicted violence against President Biden and Democratic Rep. Alexandria Ocasio-Cortez of New York.",
    "McCarthy told reporters on Capitol Hill that he told Cawthorn during a private meeting that the first-term congressman \"lost my trust,\" and the allegations Cawthorn had made during a podcast interview last week were \"exaggerated,\" according to Axios.",
    "Cawthorn has in recent weeks been publicly condemned by McCarthy over his comments, most recently after he called Ukrainian President Volodymyr Zelenskyy a \"thug\" and claimed the government of Ukraine is \"incredibly corrupt\" and \"incredibly evil.\"",
    "The accusations from the first-term congressman did not sit well with some of his fellow Republican lawmakers, some of whom voiced their frustrations during a closed-door meeting of the House Republican Conference on Tuesday, Politico reported.",
    "Amid the backlash to his comments, Cawthorn shared a digital ad to his Twitter account declaring that he has been targeted as \"as public enemy number one\" and characterizing him as his constituents' \"champion for faith, family and freedom.\"",
    "Cawthorn made the claims about lawmakers' behavior during an interview last week on the podcast Warrior Poet Society after he was asked whether the Netflix series \"House of Cards\" was an accurate portrayal of Washington or fictitious.",
    "\"The sexual perversion that goes on in Washington, I mean, being kind of a young guy in Washington where the average age is probably 60 or 70, and I look at all these people, a lot of them that I've looked up to through my life.",
    "There's no evidence behind his statements,\" McCarthy said, according to reports, adding, \"I told him you can't make statements like that, as a member of Congress, that affects everybody else and the country as a whole.\"",
    "Cawthorn continued, \"Or the fact that there are some of the people that are leading on the movement to try and remove addiction in our country and then you watch them doing a key bump of cocaine right in front of you.",
    "Washington — House Minority Leader Kevin McCarthy on Wednesday admonished Republican Rep. Madison Cawthorn of North Carolina over claims he had watched members of Congress use drugs and was invited to an \"orgy.\"",
    "The House minority leader said Cawthorn was \"wrong\" about his characterization of Zelenskyy, though he said he then that he still planned to support his reelection campaign.",
    "The GOP leader said Cawthorn's comments upset many lawmakers, and he warned Cawthorn could face consequences for what McCarthy said are \"unacceptable\" remarks.\"",
    "Then when he comes in he tells me — he says he thinks he saw maybe a staffer in a parking garage from 100 yards away,\" McCarthy told reporters.",
    "Asked about Cawthorn's ad, McCarthy reiterated that \"there was just no evidence that he provided to make me think that that story's right.\"",
    "\"Then all of a sudden you get invited to 'Hey, we're going to have kind of a sexual get together at one of our homes, you should come.'",
    "\"Despite all adversity, Madison Cawthorn continues to stand up and fight to represent the people of North Carolina in the DC swamp.\"",
    "The three are close allies of former President Donald Trump and have promoted claims the 2020 presidential election was stolen.",
    "But Madison Cawthorn cannot not be stopped, and that's why they are terrified of him because he's effective,\" the ad states.",
    "McCarthy also told reporters that Cawthorn acknowledged some of his claims were \"exaggerated.\"",
    "\"Their smears and attacks are relentless, and they've tried everything to take him down.",
    "And then you realize they're asking you to come to an orgy.\"",
    "\"In the interview, he claims he watched people do cocaine.",
    "And I'm like, 'What did you just ask me to come to?'",
    "I've always paid attention to politics,\" he said.",
    "And it's like, this is wild.\"",
    "\"It's just frustration."
  ]
}