{
  "id": 100,
  "mediaId": 8475,
  "date": "2022-02-21",
  "headline": "No Republican candidates for Arizona governor are calling for school cuts to be stopped",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/school-sign-edited-1024x614.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/022122_school_funding_gov_candidates/no-republican-candidates-arizona-governor-are-calling-school-cuts-stopped/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "",
  "termIds": [
    2706,
    3019,
    3471,
    3813,
    4623,
    1489,
    1126,
    5949
  ],
  "sentences": [
    "Arizona's Republican gubernatorial hopefuls aren't voicing any support for legislation to avert nearly $1.2 billion in education cuts this school year that could see teachers laid off and schools shut down, with some keeping silent on the issue and others actively supporting the GOP lawmakers who are opposing the effort to head off more than a billion dollars in budget cuts to public education.",
    "After last week's vote in the House of Representatives to raise the constitutional spending limit for K-12 schools, Republican frontrunner Kari Lake retweeted a message of support for the 14 GOP legislators who voted to let the cuts, which amount to 16% of school funding, go into effect in the current academic year.",
    "208 opponents are worried that if the legislature raises the spending limit, something the legislature has done periodically in the past, Invest in Education will use to argue that the tax hike can't be illegal, even if it pushes K-12 spending over the cap, because lawmakers can suspend that limit in any given year.",
    "The Arizona Constitution stipulates that lawmakers have until March 1 to lift the cap, though schools would have another month before they had to start implementing their budget cuts because state law sets an April 1 deadline for schools to complete their revised budgets.",
    "House Speaker Rusty Bowers and Senate President Karen Fann sponsored resolutions to raise the limit by $1.154 billion for the current fiscal year, which would permit public schools to spend money the legislature included in the current fiscal year's budget.",
    "As of Feb. 15, the day the House voted to raise the expenditure limit, there were at least 19 votes in the Senate to suspend the cap, including five Republicans, one short of the 20 needed to reach a two-thirds supermajority.",
    "208 Invest in Education campaign noted in its filing to the high court that the plaintiffs have acknowledged that even if the tax hike goes into effect, no revenue would be collected or spent during the current fiscal year.",
    "Due to a combination of increased K-12 funding and the expiration of a law that exempted about $600 million per year from the cap, schools are on pace to dramatically exceed that limit in the 2021-22 school year.",
    "208 and the resolutions that would raise the cap are intertwined, or that raising the cap by the limited amount that he and Fann proposed would run the risk of allowing the tax hike to go into effect.",
    "That's the income tax hike that voters approved in 2020 and which the Arizona Supreme Court has ruled illegal if, and only if, the revenue it generates pushes school funding over the spending cap.",
    "208 needs to be thrown out, and I am only willing to have a deeper conversation about this issue after that is dealt with and we have more information,\" Salmon said in a statement to the Mirror.",
    "Some Republican lawmakers say they're willing to raise the limit, but only after the judge rules that it won't allow the income tax hike on high earners to go into effect.",
    "Voters in 1980 approved an amendment to the Arizona Constitution that created a formula-based ceiling on K-12 spending known as the aggregate expenditure limit, or AEL.",
    "Fann has since said she wants to get a majority of her caucus on board, in which case she would need nine Republicans instead of just six to support the resolution.",
    "Secretary of State Katie Hobbs, the Democratic frontrunner, called on the Senate to raise the limit and save K-12 schools from \"this manufactured funding crisis.\"",
    "Lake wasn't the only Republican gubernatorial candidate to oppose raising the limit, though Matt Salmon is doing so on narrower and more limited grounds.",
    "Salmon's campaign told the Mirror that he opposes raising the limit until lawmakers are certain that it won't open the door to saving Proposition 208.",
    "208 campaign that opposed the GOP lawmakers in litigation over the tax hike, emphasized the lack of a connection between the two issues as well.",
    "In a filing that opposes legislative leaders' request for the Arizona Supreme Court to force a speedy resolution, the pro-Prop.",
    "And Marco Lopez tweeted on the day of the House vote, \"It's time to #WaiveTheAEL..\nBowers rejected the notion that Prop.",
    "The legislature has the power to approve one-year suspensions of that limit with a two-thirds vote in each chamber.",
    "The campaigns of Republican candidates Steve Gaynor and Karrin Taylor Robson declined to comment on the issue.",
    "It's unclear why Lake views voting against raising the limit as a vote for parents' rights and children.",
    "208 has no bearing on current debate over whether to raise the spending cap, the filing stated.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "The Supreme Court sent the case back to the trial court judge to determine whether Prop.",
    "The House approved the resolution on Feb. 15, but the Senate hasn't yet followed suit.",
    "Democratic candidates for governor are vocally supportive of raising the cap.",
    "Aaron Lieberman chastised the Senate for failing to raise the cap last week.",
    "Her campaign did not respond to multiple inquiries from the Arizona Mirror.",
    "If they connect them, that would be sad,\" Bowers told the Arizona Mirror.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "\"I do not think the two are connected in any way.",
    "Attorneys for Invest in Education, the pro-Prop.",
    "That means that the litigation surrounding Prop.",
    "\"The harmful income tax hike imposed by Prop.",
    "The judge's ruling is due by mid-March.",
    "Vote for the names in RED on this list.",
    "Thanks for reading TucsonSentinel.com.",
    "208 funding will exceed the cap.",
    "Standing up for parents rights.",
    "Standing up for our children.",
    "Like what you're reading?",
    "Conversely, some Prop.",
    "Showing backbone!\"",
    "Lake tweeted.",
    "\"Take note!",
    "- 30 -"
  ]
}