{
  "id": 10001,
  "mediaId": 8350,
  "date": "2022-03-30",
  "headline": "Gov. Doug Ducey signs legislation stiffening citizenship proof to vote",
  "image": "https://ktar.com/wp-content/uploads/2022/03/voting-voters-GettyImages-524477504.jpg",
  "link": "https://ktar.com/story/4977898/gov-doug-ducey-signs-legislation-stiffening-citizenship-proof-to-vote/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KTAR.COM",
  "authorUrl": "https://ktar.com/story/author/ktar-com/",
  "termIds": [
    4623,
    2915,
    6360,
    5949,
    6515
  ],
  "sentences": [
    "2492 provides clarity to Arizona law on how officials process federal form voter registration applications that lack evidence of citizenship.”\nHe added the move addressed the growing number of registrants who were voting but hadn’t provided proof of citizenship.",
    "The governor’s office said the law also ensured the state attorney general had information necessary to enforce any violation of election integrity and would include relevant databases that counties needed to maintain voter rolls.",
    "He went on to call House Bill 2492, “a balanced approach that honors Arizona’s history of making voting accessible without sacrificing security in our elections.”\nRepublican Rep. Jake Hoffman sponsored the bill.",
    "“Election integrity means counting every lawful vote and prohibiting any attempt to illegally cast a vote,” Ducey said in a letter to Secretary of State Katie Hobbs.",
    "“In just Maricopa County alone, there are currently 13,042 active registered voters who have not provided evidence of citizenship to vote,” Ducey said.",
    "Doug Ducey signed legislation Wednesday that requires voters to show proof of citizenship when casting a presidential ballot in person or by mail.",
    "“Arizona law prohibits non-citizens from voting for all state and local offices, and requires proof of citizenship.”\n“H.B.",
    "County recorders will be tasked with rejecting voting applications that don’t include citizenship documents.",
    "“Federal law prohibits non-citizens from voting in federal elections,” Ducey wrote.",
    "PHOENIX – Arizona Gov."
  ]
}