{
  "id": 10063,
  "mediaId": 8475,
  "date": "2022-03-30",
  "headline": "Ducey signs Az abortion ban, outlaws procedure after 15 weeks — even for those who were raped",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/031422_abortion_protest_2019_1.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/033022_az_abortion_law/ducey-signs-az-abortion-ban-outlaws-procedure-after-15-weeks-even-those-who-were-raped/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gloria Gomez",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110050",
  "termIds": [
    0
  ],
  "sentences": [
    "NARAL Pro Choice America, an abortion rights group, said the bill is incongruent with the actual opinions of Arizonans statewide, citing a survey which found 71% of respondents oppose making abortion illegal, and 90% agree that family planning should be left up to individuals, without government interference.",
    "But Arizona politicians — including the governor today — are willfully ignoring both public opinion and science with the sole goal of stripping constituents of their constitutional rights,” said President Alexis McGill Johnson in a statement.",
    "Make no mistake — stripping away women’s constitutional rights won’t stop women from seeking access to reproductive health care,” Hobbs, who is running as a Democrat to replace Ducey as governor, said.",
    "The ban comes in the wake of Republican attacks on abortion access across the country, as conservatives anticipate the federal protections will be torn down by the U.S. Supreme Court later this year.",
    "The legislation, which will go into effect 90 days after the legislative session ends, was modeled after a Mississippi law that the U.S. Supreme Court is currently considering.",
    "“With Governor Ducey’s signature, our elected leaders have chosen to turn their backs on the overwhelming majority of Arizonans who support the constitutional right to choose.",
    "“Banning abortion will do NOTHING to protect babies, but everything to strip Arizonans of their bodily autonomy & self-determination,” tweeted Rep. Athena Salman, D-Tempe.",
    "Planned Parenthood Action Fund, which advocates for reproductive freedom, denounced Ducey’s approval and said it ignores the varied medical situations women could face.",
    "A 15-week abortion ban in Mississippi is being contested in Dobbs v. Jackson Women’s Health Organization, which observers predict the high court will uphold.",
    "“I think if you would look at the statistics on what is already happening in our country, you’d find that this is a very reasonable policy,” he said.",
    "Doug Ducey made it illegal for Arizona women to seek an abortion after 15 weeks of pregnancy — even if they became pregnant because they were raped.",
    "Both the bill’s sponsor, Sen. Nancy Barto, R-Phoenix, and Ducey have cited the upcoming Supreme Court case in defending the legislation’s legality.",
    "Speaking to reporters after an event Wednesday afternoon, Ducey noted the new law doesn’t ban all abortions, just those done after 15 weeks.",
    "The UA School of Journalism started the fellowship in 1977 to honor Don Bolles, an Arizona Republic reporter killed in a 1976 car bombing.",
    "Under Senate Bill 1164, doctors would be prohibited from performing the procedure, even if the patient was a victim of incest or rape.",
    "While supporters have championed the measure as in defense of children, opponents argue it actually places undue burden on women.",
    "Secretary of State Katie Hobbs echoed this in a statement her office released shortly after Ducey’s, condemning his action.",
    "But Democrats in staunch opposition to the measure say its current unconstitutionality opens it up to legal challenges.",
    "Gloria Gomez is a senior at the University of Arizona and the 2022 UA School of Journalism’s Don Bolles Fellow.",
    "A class 6 felony comes with fines, probation and possible prison time between months and up to 5 years.",
    "But if a victim finds out about a pregnancy afterward that time, they’re left without recourse.",
    "I believe it is each state’s responsibility to protect them,” Ducey wrote in a signing letter.",
    "Critics say the move is out of step with the opinions of Arizonans and medical professionals.",
    "Currently, Planned Parenthood v. Casey makes bans earlier than 24 weeks unconstitutional.",
    "“In Arizona, we know there is immeasurable value in every life — including preborn life.",
    "Ducey said few abortions happen after 15 weeks, so that argument didn’t persuade him.",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "We’ll see you in court and at the polls,” tweeted Rep. Melody Hernandez, D-Tempe.",
    "Join Jerald Peek, Joan Hall, and Ted Downing and contribute today!",
    "Doctors in violation face a class 6 felony and revoked license.",
    "“Medical professionals in Arizona are against this ban.",
    "Local\nWith the stroke of a pen Wednesday, Gov.",
    "“Arizonans won’t stand for this.",
    "Nobody asked for this.",
    "- 30 -"
  ]
}