{
  "id": 10220,
  "mediaId": 2543,
  "date": "2022-03-31",
  "headline": "Arizona Gov. Doug Ducey Signs Trio of Bills Protecting Unborn and Vulnerable Children from Becoming Victims of Leftist Ideology",
  "image": "https://www.westernjournal.com/wp-content/uploads/2022/03/Doug-Ducey.jpg",
  "link": "https://www.westernjournal.com/arizona-gov-doug-ducey-signs-trio-bills-protecting-unborn-vulnerable-children-becoming-victims-leftist-ideology/",
  "mediaOutlet": "Conservative Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grant Atkinson",
  "authorUrl": "https://www.westernjournal.com/author/gatkinson/ ",
  "termIds": [
    0
  ],
  "sentences": [
    "“With Governor Ducey’s signature, our elected leaders have chosen to side with the extremists in their party and turn their backs on the overwhelming majority of Arizonans who support the constitutional right to choose.”\nIn Hobbs’ mind, people who are against killing unborn babies are “extremists.” That alone proves how needed this bill was.",
    "“Every young Arizona athlete should have the opportunity to participate in extracurricular activities that give them a sense of belonging and allow them to grow and thrive.”\nThis last bill protects not only children in middle school and high school, but also young adults in college.",
    "“I believe it is each state’s responsibility to protect them.”\nThe bill does not allow for women to be prosecuted for receiving an abortion after 15 weeks, and it includes an exception for cases where the mother is at risk of death or serious injury.",
    "According to a press release from his office, this bill “delays irreversible gender reassignment surgery until the age of 18.”\nChildren in Arizona will not be barred from taking puberty blockers or undergoing other hormone therapy.",
    "“The reason is simple, and common sense – this is a decision that will dramatically affect the rest of an individual’s life, including the ability of that individual to become a biological parent later in life,” Ducey wrote.",
    "1165 creates a statewide policy to ensure that biologically female athletes at Arizona public schools, colleges, and universities have a level playing field to compete,” Ducey wrote.",
    "In addition, he protected unborn children from the attacks of the left and made sure minors cannot get life-changing surgery until they are old enough to decide for themselves.",
    "Doug Ducey of Arizona signed a bevy of bills on Wednesday, and three of them were aimed at protecting unborn children and shielding minors from political indoctrination.",
    "“Today marks a giant step backward in the fight for equality for women across Arizona and across the country,” Hobbs said according to the Associated Press.",
    "As the left continues its attempts to force wokeness onto children, states need to follow Ducey’s lead and protect their most vulnerable citizens.",
    "Finally, Ducey signed Senate Bill 1165, which requires public schools and universities in Arizona to designate sports based on biological sex.",
    "Despite the fact that he is still a man, he was allowed to compete against women and won a national championship in the 500-yard freestyle.",
    "Thomas was born a man and competed on the men’s swim team at Pennsylvania University for three seasons before “transitioning” to a female.",
    "“In Arizona, we know there is immeasurable value in every life – including preborn life,” Ducey wrote in a letter announcing the decision.",
    "Doctors who perform abortions after 15 weeks could be charged with a felony and risk having their medical license revoked.",
    "It simply prohibits doctors from performing life-altering surgery before a child is old enough to make such a decision.",
    "The bill makes it illegal for doctors to provide abortions for women after 15 weeks of pregnancy.",
    "Nonetheless, Democrat Secretary of State Katie Hobbs painted the bill as an attack on women.",
    "According to KTAR-FM, the most high-profile of the three bills was Senate Bill 1164.",
    "Ducey has ensured a situation like that one will not occur in Arizona.",
    "It is particularly important given the recent case of Lia Thomas.",
    "The second bill Ducey signed was Senate Bill 1138.",
    "Republican Gov.",
    "“S.B."
  ]
}