{
  "id": 10683,
  "mediaId": 8347,
  "date": "2022-03-30",
  "headline": "Gov. Ducey signs bill requiring voters to provide 'satisfactory evidence' of U.S. citizenship",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/0109fd2/2147483647/strip/true/crop/1100x578+0+78/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F56%2F6d%2F500d904646558478bf52dbb12965%2Fap-20309016963966.jpg",
  "link": "https://www.kgun9.com/news/local-news/gov-ducey-signs-bill-requiring-voters-to-provide-satisfactory-evidence-of-u-s-citizenship",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caleb J. Fernández",
  "authorUrl": "https://www.kgun9.com/caleb-fernandez",
  "termIds": [
    0
  ],
  "sentences": [
    "The House bill also addresses government officials who fail to follow the prescribed requirements saying:\nIF THE COUNTY RECORDER OR OTHER OFFICER IN CHARGE OF ELECTIONS FAILS TO ATTEMPT TO VERIFY THE CITIZENSHIP STATUS OF AN APPLICANT PURSUANT TO SUBSECTIONS D AND E OF THIS SECTION AND THE COUNTY RECORDER OR OTHER OFFICER IN CHARGE OF ELECTIONS KNOWINGLY CAUSES THE APPLICANT TO BE REGISTERED AND IT IS LATER DETERMINED THAT THE APPLICANT WAS NOT A UNITED STATES CITIZEN AT THE TIME OF REGISTRATION, THE COUNTY RECORDER OR OTHER OFFICER IN CHARGE OF ELECTIONS IS GUILTY OF A CLASS 6 FELONY.",
    "After earning his bachelor's degree from Pennsylvania State University in Advertising/Public Relations, Caleb went straight to New York City where he learned the necessities of production assistance, photography and art direction.",
    "An Arizonan is qualified to register to vote if the resident:\nIS A CITIZEN OF THE UNITED STATES AND HAS PROVIDED SATISFACTORY EVIDENCE OF CITIZENSHIP AS PRESCRIBED IN SECTION 16-166.",
    "2492 ensures that the Attorney General's office has the data needed to properly determine if a person who has registered with the federal form is in fact a non citizen.\"",
    "2492 provides clarity to Arizona law on how officials process federal form voter registration applications that lack evidence of citizenship,\" added Gov.",
    "Share your story ideas and important issues with Caleb by emailing caleb.fernandez@kgun9.com or by connecting on LinkedIn, Instagram, and Twitter.",
    "TUCSON, Ariz. (KGUN) — Governor Doug Ducey has signed a new House bill requiring voters to provide 'satisfactory evidence' of U.S. citizenship.",
    "WILL BE EIGHTEEN YEARS OF AGE OR MORE ON OR BEFORE THE DATE OF THE REGULAR GENERAL ELECTION NEXT FOLLOWING HIS REGISTRATION.",
    "\"Arizona law prohibits non-citizens from voting for all state and local offices, and requires proof of citizenship,\" Gov.",
    "IS ABLE TO WRITE THE RESIDENT'S NAME OR MAKE THE RESIDENT'S MARK, UNLESS PREVENTED FROM SO DOING BY PHYSICAL DISABILITY.",
    "2492 voter registration; verification; citizenship is to ensure only American citizens partake in Arizona's elections.",
    "Even people who have previously registered but can't provide the 'satisfactory evidence' are not eligible to vote.",
    "IS A RESIDENT OF THIS STATE TWENTY-NINE DAYS NEXT PRECEDING THE ELECTION, EXCEPT AS PROVIDED IN SECTION 16-126.",
    "Born and raised in Southern California, Caleb has always had an affinity for creative collaborations.",
    "Any application which does not include the necessary information will be labeled incomplete.",
    "Certain exclusions do not apply to absent uniformed services voters or overseas voters.",
    "HAS NOT BEEN CONVICTED OF TREASON OR A FELONY, UNLESS RESTORED TO CIVIL RIGHTS.",
    "HAS NOT BEEN ADJUDICATED AN INCAPACITATED PERSON AS DEFINED IN SECTION 14-5101.",
    "Requirements for proper registration are thoroughly described.",
    "——-\nCaleb Fernández is a digital content producer for KGUN 9.",
    "Ducey shared in a letter to Secretary of State Katie Hobbs.",
    "However, it also includes exceptions.",
    "The goal of H.B.",
    "Ducey.",
    "\"H.B.",
    "\"H.B."
  ]
}