{
  "id": 10887,
  "mediaId": 2662,
  "date": "2022-03-08",
  "headline": "Arizona Legislature Working To Repeal PC Purge Bill – Anti-Precinct Committeemen Elections HB2839",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/891FA5C2-B689-4B5A-A169-D6B36049821E.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/03/arizona-legislature-working-repeal-pc-purge-bill-anti-precinct-committeemen-elections-hb2839/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    4949,
    5712,
    4267,
    1896,
    2370,
    3813,
    2765,
    1126,
    1087,
    102,
    5949,
    6360
  ],
  "sentences": [
    "In an article titled “McCain’s Big Purge,” Politico reported,\nAs the longtime Republican senator lays the groundwork for a likely 2016 reelection bid, his political team is engaging in an aggressive and systematic campaign to reshape the state GOP apparatus by ridding it of conservative firebrands and replacing them with steadfast allies.",
    "“A lot of the party folks who were hostile to John McCain have been marginalized, and that’s a good thing.”\n“He was very unhappy with the censure and wanted to make sure it never happened again,” said Mike Hellon, McCain’s deputy campaign manager in 2010.",
    "— Lisa M. Marra (@LisaMarra) March 7, 2022\nMara recently thanked RINO House Speaker Rusty Bowers, who introduced HB2839 to the House, for preventing election integrity efforts and decertification of Arizona.",
    "Arizona Association of Counties lobbyists frequently request to speak in opposition to election integrity measures that were drafted after the Arizona audit discovered massive evidence of voter fraud.",
    "Now, after an influx of candidates were recruited by the senator’s allies, around 40 percent of those offices — 1,531 to be exact — will be held by people McCain’s team regards as friendly.",
    "This move came days after President Trump urged the American people to join Precinct Strategy and fill local County Republican Party committees, positions which are too often left vacant.",
    "After the Maricopa County GOP censured John Mccain for his destructive liberal voting record in 2014, McCain launched a massive campaign to root out his dissenters from party politics.",
    "Arizona Independent reported,\nOne of the biggest supporters of HB2839 was the Arizona Association of Counties (AAOC), the lobbyist organization for the state’s 15 county governments.",
    "Last week, Arizona legislators passed a bill to strip local political parties of their voices by radically changing the process for selecting precinct committeemen in the state.",
    "Prior to Aug. 26, when the races for the party offices were held, the vast majority of the 3,925 precinct slots were filled by people McCain’s team considered opponents.",
    "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nWhat would John McCain do?",
    "https://twitter.com/noprezzie2012/status/1501286262325460999\nSenate President Karen Fann spoke today during the meeting to admit the legislature’s massive error.",
    "“There’s been a huge organizational effort that I’ve never seen before,” said Gordon James, an Arizona public relations executive and longtime McCain confidant.",
    "https://t.co/rICGW5SUHg\n— Kari Lake for AZ Governor (@KariLake) March 8, 2022\nThe Senate Judiciary Committee decided to reschedule the bill for Thursday.",
    "This bill would not have been necessary if Katie Hobbs would have taken appropriate measures to be prepared for redistricting during a major election.",
    "The operation was reported to be headquartered in Alexandria, VA using a super PAC to find McCain allies to fill PC roles and “marginalize” patriots.",
    "PSA to end Sunday: If you have questions about elections, Precinct Committeemen, or redistricting, in #Arizona, contact #TrustedInfo2020 sources.",
    "https://t.co/YNI9EaiU9u\n— Lisa M. Marra (@LisaMarra) February 24, 2022\nThis is just another way to silence pro-election integrity patriots.",
    "All Republicans who unanimously voted for this bill are now scrambling to fix this massive mistake after pressure from their voters.",
    "McCain RINO establishment members like Rusty Bowers are trying to stop the MAGA apparatus again, but this time through legislation.",
    "The language was inserted by the Arizona Association of Counties president and Cochise County elections director, Lisa Marra.",
    "The Gateway Pundit reported that new bills, SB1720 and HB2840, were introduced yesterday to repeal SB1719 and HB2839.",
    "Shame on the county lobbyists for taking advantage by inserting language that harms grassroots precinct committeemen.",
    "Lisa Marra, an AAOC president, claims this bill was meant to “increase party representation.” This is an obvious lie.",
    "HB2839 was introduced by our legislators to protect our candidates’ interests from Katie Hobbs’s negligence.",
    "Under the new law, the county board of supervisors shall appoint the political party precinct committeemen.",
    "They will have the power to vote down hostile Republican chairmen in each of their respective localities.",
    "AAOC was involved in drafting the language of the bill to address “some concerns,” according to Fann.",
    "This was an attempt by RINOs and leftists to suppress the people and unseat MAGA patriots.",
    "Unseat conservative activists who hold obscure, but influential, local party offices.",
    "So much deliberate disinformation over a bill meant to increase Party representation.",
    "We The People AZ Alliance gave us the following comment on this horrible new law.",
    "Today, The Legislature will consider these bills in House and Senate committees.",
    "What better way to stop election integrity efforts in the Arizona GOP?",
    "Thank you Speaker Bowers for continuing to be the voice of reason.",
    "The RINO-Democrat establishment is trying to silence Arizonans.",
    "The final language was not available until Wednesday night.",
    "Stop these continued lies about the 2020 Arizona election.",
    "Precinct committeemen were formerly elected by the people.",
    "She is a known anti-audit and anti-election integrity.",
    "He tried to do something similar.",
    "YOUR county election officials.",
    "This just happened last week.",
    "Show up at the Capitol today.",
    "Late’s get this fixed!",
    "Team McCain’s goal?",
    "It's shameful.",
    "Can you help?",
    "It's 2022."
  ]
}