{
  "id": 11539,
  "mediaId": 2520,
  "date": "2022-03-07",
  "headline": "First Hobbs, now López. Democrats need a candidate for governor who isn't dragging baggage",
  "image": "https://www.gannett-cdn.com/presto/2021/05/20/PPHX/32c43440-4519-48f9-a20d-556c1e6c0f48-Lopez.jpeg?crop=731,411,x1,y123&width=731&height=411&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/03/07/yet-another-democratic-candidate-arizona-governor-trouble/9414695002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    0
  ],
  "sentences": [
    "It took gleeful Republicans not even an hour to start the high fives on Friday after the Arizona Agenda report tying López to a scandal the Department of Justice has called “the largest foreign bribery case in history.”\n“AZ Gov Candidate Implicated in Corruption Scheme,” blared the press release from the Republican Governor’s Association.",
    "\"I am proud of the business that I, the son of working class immigrants, built from the ground up.”\nHe told The Republic’s Stacey Barchenger his company was hired by Lozoya to run security checks and that the work that was not affiliated with the Peña Nieto campaign.",
    "Lozoya faces charges that he accepted more than $3 million in bribes from Odebrecht, a Brazilian-based construction company that in 2016 pleaded guilty to conspiracy to violate the anti-bribery provisions of the Foreign Corrupt Practices Act.",
    "Her opponents, former state Rep. Aaron Lieberman and former Nogales Mayor Marco López, register barely a blip and her supporters seem unconcerned about the Adams debacle — especially if Trump's pick, Kari Lake, becomes the Republican nominee.",
    "“With alleged ‘racist’ Katie Hobbs and corrupt politician Marco Lopez battling it out for the Democratic nomination for Governor in AZ, will the DGA admit their massive recruiting failure in the state?” the RGA asked in a press release.",
    "And López may be able to convince some voters that he had no idea that he was doing business with international criminals in 2012 when he accepted $35,000 via a Swiss bank account from the alleged middle man in a bribery scheme.",
    "“I think she’s the best bet in the general (election) despite some of the missteps earlier.”\nAnd I still think the Democrats' best bet is a someone who can run the coming race without dragging along some fairly weighty baggage.",
    "The political newsletter reported that López’s consulting company profited from a bribery scheme while doing work a decade ago for an advisor to the campaign of Enrique Peña Nieto, who went on to become Mexico's president.",
    "Frontrunner Katie Hobbs hobbled herself late last year when she bungled her response to a jury's $2.75 million award to a Black Senate Democratic aide who was fired in 2015 while Hobbs was Senate minority leader.",
    "Lozoya, who in 2012 was working on Peña Nieto's campaign, in 2020 told investigators that Peña Nieto and a top aide ordered him to use bribe money from Odebrecht to pay campaign consultants, including Lopez.",
    "Records show $35,000 in payments to Lopez’s company, Intermestic Partners, went through a Swiss bank account and a company managed by Emilio Lozoya, the alleged middleman of the bribery scheme.",
    "Hobbs’ supporters are quick to say she’s better than any of the Republican alternatives, a crop of candidates currently engaged in a cage fight to show who is the Trumpiest of them all.",
    "Hobbs may be able to convince some voters that her handling of the Talonya Adams debacle and her initial pass-the-buck response to the verdict in no way reflect her leadership skills.",
    "\"The simple truth is that for a Democrat to win statewide in Arizona, they need to run a near perfect race,\" he said, in a statement issued after the report on López hit on Friday.",
    "There are eight months still to go until the November election and already two of the three Democrats running for Arizona governor are looking like the walking wounded.",
    "\"I strongly dispute the notion that I or Intermestic did anything wrong with regard to the payment in question,\" López wrote, in a statement to The Arizona Republic.",
    "Two juries sided with Adams, the latest in November, resulting in a $2.75 million award for pay discrimination and retaliatory firing after she complained about it.",
    "“If you’re explaining, you’re losing.”\nEspecially in an election year that already favors the other guys, if history and Joe Biden's approval ratings mean anything.",
    "While Republicans, as the majority party, were responsible for the pay disparity, it was clear from trial testimony that Hobbs played a key role in Adams’ firing.",
    "Yet after the verdict Hobbs blamed the Republicans then later insisted there were good reasons to fire Adams that had nothing to do with race or gender.",
    "She later apologized but it was too little too late for some leaders in the African American community who vowed to campaign against her.",
    "It’s whether Hobbs can win the hearts and minds of those all-important independents who will decide this and every other statewide race.",
    "And I don't see how Leiberman, who could walk down most any street in Arizona without being recognized, can beat Hobbs in a primary.",
    "Certainly, she'll have no competition from Marco López after the Arizona Agenda’s report tying him to a bribery scandal in Mexico.",
    "The consultants, he said, were advised to use terms like “Colombia Project” on their invoices to obscure the trail of the money.",
    "Adams was fired by the Senate in 2015 after complaining that she earned substantially less than her white male colleagues.",
    "OPINION: Two of the three Democratic candidates for Arizona governor are now dragging around some fairly weighty baggage.",
    "Perhaps Lopez can explain why getting paid with money launderedthrough a Swiss bank account didn’t raise a red flag.",
    "“If you’re explaining, you’re losing.”\nSo said Ronald Reagan, a guy who knew a thing or two about winning elections.",
    "Now comes a report linking Democratic candidate Marco López to the largest international bribery scheme in history.",
    "Someone like U.S. Rep. Greg Stanton, who is facing a battle to be re-elected in a newly competitive district.",
    "When she emailed Senate Democratic leaders to discuss it, Hobbs replied that her email was “inappropriate”.",
    "After hearing a lot, if that RGA press release is any indication, about her treatment of Talonya Adams.",
    "His invoice for the work says he provided two months of “advisory services” for the “Columbia Project”.",
    "Leiberman, meanwhile, says he's the only Democrat in the race with a chance to win in November.",
    "“I still think Katie Hobbs can beat a Republican,” Democratic consultant Chad Campbell told me.",
    "But Hobbs was knocked down as well, by minimizing her own role in kicking Adams to the curb.",
    "\"With today’s news, I don’t see how either Secretary Hobbs or Mr. Lopez can pull that off.\"",
    "But the question really isn’t whether Democratic voters would support their nominee.",
    "López has denied any wrongdoing and has not been charged in the investigation.",
    "The award was knocked down to $300,000, given the federal cap on such cases.",
    "Despite that, she remains the clear frontrunner in the Democratic race.",
    "The bribes were offered to get future inflated public works contracts.",
    "Not the greatest start for what will surely be a tough election.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "But it’s March and that ship, likely, has sailed.",
    "Perhaps there’s a good explanation for that.",
    "But again there is that cautionary quote.",
    "She just wouldn’t tell us what they were.",
    "Shortly thereafter, Adams was fired.",
    "But what’s that old saying?",
    "In a word, no.",
    "They won't."
  ]
}