{
  "id": 12122,
  "mediaId": 2549,
  "date": "2022-03-22",
  "headline": "QAnon guru Ron Watkins says he’s officially on the ballot for Congress—but his chances remain slim",
  "image": "https://uploads.dailydot.com/2022/03/Ron.jpg?auto=compress&fm=pjpg",
  "link": "https://www.dailydot.com/debug/ron-watkins-arizona-congress-ballot/",
  "mediaOutlet": "Daily Dot",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mikael Thalen",
  "authorUrl": "https://www.dailydot.com/author/mikael-thalen/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Add the lack of funds to an unorthodox campaigning approach conducted primarily on Telegram, the absence of a much sought-after Trump endorsement, and a campaign manager who ‘sees UFOs wherever he goes,’ and it’s clear that Watkins is facing an uphill climb to make any impact on the congressional race in Arizona’s second district.”\nAs it currently stands, Watkins chances of winning a seat in Congress appear slim at best.",
    "“Out of 30 total candidates, I am the first candidate of any party certified for the 2022 Congressional primary in Arizona’s CD2.”\nThe far-right figure, who helped spread countless debunked conspiracy theories regarding the 2020 presidential election, went on to thank his supporters and himself for reaching the vital milestone.",
    "Despite claiming in October that he would raise at least $1 million, Watkins’ first campaign finance report released at the end of January showed that he had only managed to scrape together just $30,588.22 from supporters.",
    "Watkins, believed by many to have been behind the “Q” persona while running the imageboard 8chan, has spent the last several months campaigning in an effort to represent one of the state’s rural districts in Congress.",
    "“I knocked on thousands of doors and now need new socks and my boots resoled.”\nYet despite gaining widespread attention as a conspiracy theorist, Watkins’ congressional bid has largely been ignored by his base.",
    "“Just got confirmation from AZSOS Katie Hobbs that I am officially certified for the 2022 ballot in Arizona’s Congressional District 2!” Watkins wrote.",
    "In a post on Telegram, Watkins shared a photo of himself at the office of Arizona Secretary of State Katie Hobbs before making his announcement.",
    "“Watkins’ paltry fundraising efforts show how difficult it will be to translate his QAnon fame into votes,” Gilbert reported.",
    "Watkins’ opponent, incumbent Democratic Rep. Tom O’Halleran, was able to raise more than $435,000 during the same period.",
    "QAnon guru Ron Watkins claimed on Tuesday that he has been officially placed on the ballot in Arizona.",
    "As noted by VICE News‘ David Gilbert, Watkins campaign has not come close to its initial goals.",
    "“Thank you everybody who signed my petition and helped gather petitions,” he added."
  ]
}