{
  "id": 1529,
  "mediaId": 2625,
  "date": "2022-02-16",
  "headline": "States of Denial: A Guide to Some of the GOP’s Most Brazen Attacks on Voting Rights and Elections",
  "image": "https://www.motherjones.com/wp-content/uploads/2022/01/20220112_midterms-states-sb_2000.jpg?w=1200&h=630&crop=1",
  "link": "https://www.motherjones.com/politics/2022/02/guide-republican-attacks-on-voting-rights-and-elections-gerrymandering-suppression-subversion/",
  "mediaOutlet": "Mother Jones",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ari Berman",
  "authorUrl": "https://www.motherjones.com/author/ari-berman/",
  "termIds": [
    0
  ],
  "sentences": [
    "Republicans have launched an all-out assault on the integrity of the state’s election system, with former conservative state Supreme Court Justice Michael Gableman—who admitted he didn’t have “any understanding of how elections work”—launching a sprawling Arizona-style audit of the 2020 election, while other top Republicans have called for jailing members of the state’s bipartisan elections commission and stripping them of the authority to oversee elections.",
    "In Galveston, the GOP-controlled county commission has adopted new redistricting maps that eliminated the county’s lone district where voters of color are the majority, represented by Democrat Stephen Holmes for 22 years—one of the most flagrant examples of racial gerrymandering since the Supreme Court gutted the Voting Rights Act in 2013.",
    "Colorado Secretary of State Jena Griswold called this an “unprecedented security breach.”\nMimicking Georgia, Republicans banned giving food and water to voters in line, along with making it harder to vote by mail—after more Democrats than Republicans did so for the first time in the state’s recent history.",
    "Republicans stripped Democratic Secretary of State Katie Hobbs of the power to defend state election laws and transferred that authority to the Republican attorney general—but only through the 2022 election, in case the partisan composition of the offices is reversed after that.",
    "Republicans removed student IDs as a valid form of voter identification and repealed Election Day registration, which is disproportionately used by younger and Native American voters—some of whom have to travel 130 miles to reach a polling place.",
    "Republican state Sen. Kathy Bernier tearfully said, “We’re in jeopardy of losing” our republic, and called Gableman’s review “a charade” to “jazz up the base,” but announced she was retiring after Gableman called for her resignation.",
    "Mesa County Clerk Tina Peters allowed unauthorized individuals to copy hard drive images of election software, resulting in this information being shared publicly by election conspiracy theorists.",
    "Greg Abbott issued an edict one month before the 2020 election, limiting the number of ballot drop boxes to one per county (Harris County has 4.7 million residents).",
    "In November, he won a bid to become a local election judge, part of a growing wave of Big Lie proponents who are taking over election administration positions.",
    "Ron DeSantis signed the bill in May during a Fox & Friends exclusive; all other media outlets were barred from the event.",
    "Stephen Lindemuth of Elizabethtown attended the “Stop the Steal” rally on January 6 that led to the insurrection.",
    "Top image credits: Jessica Reilly/Telegraph Herald/AP; LM Otero/AP; Chris O’Meara/AP",
    "In September, Republicans went further and banned all drop boxes in the state.",
    "Facts matter: Sign up for the free Mother Jones Daily newsletter.",
    "Support our nonprofit reporting.",
    "Subscribe to our print magazine.",
    "Gov.",
    "Gov."
  ]
}