{
  "id": 15743,
  "mediaId": 8350,
  "date": "2022-03-10",
  "headline": "Democratic Arizona gubernatorial candidate proposes free pre-K",
  "image": "https://ktar.com/wp-content/uploads/2021/09/aaron-lieberman-fb.jpg",
  "link": "https://ktar.com/story/4941431/democratic-arizona-gubernatorial-candidate-proposes-free-pre-k/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "Lieberman envisions a program that would eventually serve 60,000 children at a cost of $450 million a year, which he said the state could fund with existing resources, particularly if voters roll back tax cuts that were enacted last year and largely benefitted the wealthy.",
    "That’s what we’re going to change by making sure we’re actually paying for teachers well.”\nLieberman founded two organizations focused on early childhood education before being elected to the Legislature from Paradise Valley in 2018.",
    "He’s not well-known to Democratic primary voters compared with Secretary of State Katie Hobbs, who has built a national profile defending the integrity of the 2020 election.",
    "He acknowledged that child care providers, already struggling to find and retain staff, would struggle to find enough staff to handle the influx of students.",
    "He also says his plan would boost the economy by allowing more parents to enter the workforce or save money that they would otherwise spend on child care.",
    "He also faces Marco Lopez, a businessman who was mayor of Nogales and a border official during President Barack Obama’s administration.",
    "He developed a reputation as a moderate during two terms in the House and resigned last year to focus on his campaign for governor.",
    "Former state Rep. Aaron Lieberman outlined the proposal in a news conference at a Head Start center in eastern Phoenix on Thursday.",
    "The state also has a large surplus, though much of it is from one-time windfalls not expected to be available long into the future.",
    "PHOENIX (AP) — A Democrat running for Arizona governor says all 4-year-olds should have the option for free preschool.",
    "He says high-quality early learning programs set children up for success in kindergarten and long into the future.",
    "“Anyone who has been involved in pre-K as an educator usually is doing it because it’s a passion,” Lieberman said.",
    "“Often they stopped doing it because they can’t afford to support their family.",
    "He said good salaries will help.",
    "Share\nComments"
  ]
}