{
  "id": 15911,
  "mediaId": 2741,
  "date": "2022-03-08",
  "headline": "A New Legal Group Wants to Disbar the Lawyers Who Helped Sell Trump’s Big Lie",
  "image": "https://media.vanityfair.com/photos/622798ea6df0fdac83f86123/16:9/w_1280,c_limit/vf-322-the-65-project.png",
  "link": "https://www.vanityfair.com/news/2022/03/legal-group-disbar-lawyers-who-helped-trump",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caleb Ecarma",
  "authorUrl": "https://www.vanityfair.com/contributor/caleb-ecarma",
  "termIds": [
    0
  ],
  "sentences": [
    "(In a statement to Axios, Eastman’s lawyer denounced the investigation, saying that his client expects the Bar to “fully exonerate him from any charges.”)\nOn Monday, the group filed its initial 10 ethics complaints, including against former Trump adviser Cleta Mitchell, for her attempts to “convince Georgia’s Secretary of State to ‘find’ enough votes for Mr. Trump to win that state,” and former Trump campaign lawyer Joseph diGenova, for remarks that a U.S. cybersecurity official should be “taken out at dawn and shot” for saying that the 2020 election “was the most secure in American history.” Others under the gun include pro-Trump legal pundit Jenna Ellis and former Trump aide Boris Epshteyn, who admitted to MSNBC in January that he was “part of the process to make sure there were alternate electors for when, as we hoped, the challenges to the seated electors would be heard, and would be successful.”\nAt least one of the targets of this group, Paul Davis, a Texas lawyer who attended the Capitol riot, is already grumbling about this project’s mission, telling Axios it is “nothing more than a desperate attempt by leftist hacks and mercenaries” who are executing some kind of preemptive cover up for “malfeasance in the 2022 midterms.”\nThis project comes as GOP legislatures in several states have spent the past year stripping power from nonpartisan or elected election officials, taking aim at those who resisted Trump’s attempts to overturn the 2020 election.",
    "?Images of Russia’s Attack on Ukraine\n—Trump Calls Putin’s Ukraine Moves “Genius” Because He Hates Democracy\n— The Zucker-Cuomo Saga Just Got Even Messier\n— Why Biden Wanted Americans to Know Exactly What Putin Was Planning\n— It’s Been a Hell of a Week for Letitia James\n— “If Ukraine Matters, Tell Us Why”: Joe Biden Is Talking to Everyone Except the American People\n— Republicans on Russia Crisis: It’s Biden’s Fault\n— Thieves in the Night: A Vast Burglary Ring From Chile Has Been Targeting Wealthy U.S.",
    "A new legal group linked to Democratic Party insiders that is aimed at disbarring the lawyers who pushed Donald Trump’s election fraud lies in the courts has launched, Axios first reported Monday, a project that’s targeting the lesser-known lawyers that did Trump’s bidding and punching back at recent Republican efforts to make the election certification process more partisan.",
    "Others involved include former Democratic Senate majority leader Tom Daschle; Democratic consultant and Clinton administration official Melissa Moss; and former George W. Bush Department of Homeland Security appointee Paul Rosenzweig, a Federalist Society conservative who was senior counsel on Ken Starr’s Whitewater investigation into the Clintons.",
    "The 65 Project, a name derived from the number of lawsuits that were aimed at reversing or muddying Joe Biden’s electoral victory, plans to invest $2.5 million in its first year and target 111 lawyers across 26 states who were involved in Trump’s post-election lawsuits, according to Axios.",
    "In Georgia, for instance, Republicans removed the secretary of state as chair of Georgia’s State Election Board, instead making the position an appointee of the state General Assembly, after the current state secretary, Brad Raffensperger, resisted Trump’s election interference.",
    "The group hopes to raise public awareness and push state bar associations “to clarify the rules ahead of the 2022 election that fraudulent and malicious lawsuits to overturn legitimate election results violate the ethical duties lawyers must abide by,” per The Washington Post.",
    "The project is being advised by some big names in the Democratic Party, most notably David Brock, the founder of Media Matters for America and the super PAC American Bridge 21st Century, who is a close confidant of Hillary Clinton’s and a prolific fundraiser for the party.",
    "Though the group’s budget is unlikely to compete in what is expected to be a saturated and expensive 2022 television advertising market, it’s clear this new project does have some eyes on the midterms, with plans to run ads in Pennsylvania, Michigan, Arizona, and Georgia.",
    "The Arizona GOP stripped the secretary of state’s office—currently held by Katie Hobbs, a Democrat—of the right to defend the state’s election laws in court, a responsibility that was instead given to Arizona’s attorney general, a position currently held by a Republican.",
    "And conservative legal writer John Eastman, who, in the lead up to the Capitol riot, authored a memo for Trump and his allies meant to serve as a road map in their blitz to overturn the election, is also currently under investigation by the State Bar of California.",
    "“[Project 65 will] not only bring the grievances in the bar complaints, but shame them and make them toxic in their communities and in their firms,” Brock told Axios of the group’s mission.",
    "Several of those figures, like Rudy Giuliani, who is temporarily barred from practicing law in New York and Washington, D.C., have already faced consequences.",
    "Sidney Powell and L. Lin Wood, likewise, were sanctioned by a federal judge for their role in mongering election lies.",
    "(It should be noted that Raffensperger defended Georgia’s sweeping voting law, despite it stripping his own powers.)",
    "Rosenzweig, though a lifelong conservative, left the Republican Party in 2016, with Trump's nomination.",
    "Households\n— Watergate’s Central Mystery: Why Did Nixon’s Team Order the Break-In in the First Place?",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "This isn’t just a project aimed at the biggest names in Trump’s orbit.",
    "— From the Archive: Russia’s Dark Master\n— Not a subscriber?",
    "It looks like we're experiencing playback issues.",
    "Our bad!",
    "— ?"
  ]
}