{
  "id": 17240,
  "mediaId": 8475,
  "date": "2022-03-04",
  "headline": "Arizona candidate signature thresholds fixed by fast-tracked legislation",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/030422_petition-signature.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/030422_candidate_signatures/arizona-candidate-signature-thresholds-fixed-by-fast-tracked-legislation/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    0
  ],
  "sentences": [
    "State law says that if the new districts aren’t effective by Jan. 2, the number of required signatures is based on “the number of qualified signers in the elective office, district or precinct that was effective on January 2 of the year of a general election.” It’s unclear whether that means the old district in which candidates live, or the current district with the same number as the old one.",
    "The deadline is significantly earlier than in previous years, including past redistricting years, because when the legislature moved the primary election date from late August to the first Tuesday of the month back in 2019, it changed the deadline for the secretary of state to calculate signature requirements from March 2 to Jan. 2.",
    "In order to qualify for the Aug. 2 primary election ballot, candidates must collect a minimum number of signatures on their qualifying petitions, which, for legislative and congressional hopefuls, is equal to one half of 1% of the voters in their district who are eligible to sign.",
    "Because Arizona’s new congressional and legislative districts weren’t officially adopted by the state until after that deadline, Secretary of State Katie Hobbs used the old districts to determine the minimum number of signatures that candidates need to collect.",
    "Doug Ducey’s signature on Thursday, candidates who were assigned an absurdly high signature requirement will be able to use a different number that’s based on the per-district average of Democrats, Republicans, Libertarians or independents statewide.",
    "The legislature eliminated that safeguard last year as part of a law aimed at helping legislative and congressional candidates navigate the uncertainties of redistricting by permitting them to collect signatures in both their old and new districts.",
    "Conversely, the signature requirement for Republican candidates running in the old District 27 in heavily Democratic south Phoenix is based on voter registration numbers for the old District 22, Toma’s GOP stronghold in Peoria.",
    "Local\nOn the eve of the turn-in period for candidates’ nominating petitions, lawmakers fast-tracked a bill to clear up confusion over how many signatures legislative candidates need to qualify for the 2022 ballot.",
    "At the time, if the new districts weren’t official by that deadline, state law instructed the secretary of state to calculate signature requirements based on the date when the new districts became effective.",
    "Congressional and legislative candidates who find themselves needing an unusually high number of signatures due to complications from redistricting will now be able to submit a lower number.",
    "So the signature for a candidate running in the new District 5 in central Phoenix is based on the voter registration numbers in the old District 5, which is based in Mohave County.",
    "This all means many candidates’ signature requirements are based on districts that are wildly different from the ones they’ll run for in this year’s elections.",
    "Adding to the confusion is the fact that Hobbs is pegging candidates’ signature requirements to the old districts with the same number as their new ones.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "But his signature requirements are based on the old district with the same number, which is an overwhelmingly Democratic district based south Phoenix.",
    "State law requires the Secretary of State’s Office to make those calculations based on voter registration numbers on Jan. 2 of the election year.",
    "The bill was passed with an emergency clause — both chambers of the legislature passed it unanimously — so it will go into effect immediately.",
    "Those who were assigned an abnormally low number by the secretary of state’s calculations will be able to maintain that low threshold.",
    "House Majority Leader Ben Toma, for example, will run in the new District 27, a heavily Republican district in the northwest Valley.",
    "As a result, he needs far fewer signatures than would normally be required of a GOP candidate in such a staunchly Republican area.",
    "For Republicans, the average would be about 492, and for Democrats it’s about 469, Toma told the House of Representatives.",
    "If the original number from the secretary of state is lower, they’ll still have the option to use that instead.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "“Some of us won the lottery and others got screwed over.”\nWith the passage of House Bill 2839 and Gov.",
    "Hobbs urged legislative leaders to address the problem in a Feb. 10 letter.",
    "Candidates can begin submitting their nominating petitions on Saturday.",
    "“It’s happening to both sides,” Toma told the Arizona Mirror.",
    "The deadline to turn in nominating petitions is April 4.",
    "Donate to TucsonSentinel.com today!",
    "- 30 -"
  ]
}