{
  "id": 17337,
  "mediaId": 8350,
  "date": "2022-03-03",
  "headline": "Arizona Senate approves bill that would make it harder for bar to discipline lawyers",
  "image": "https://ktar.com/wp-content/uploads/2022/03/pexels-rodnae-productions-7841812-scaled-e1646272796426.jpg",
  "link": "https://ktar.com/story/4925430/arizona-senate-approves-bill-that-would-make-it-harder-for-bar-to-discipline-lawyers/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/associated-press/",
  "termIds": [
    4623,
    3401,
    3488,
    1126,
    100,
    1489,
    6515,
    6141
  ],
  "sentences": [
    "Under Leach’s bill, the State Bar of Arizona would be required to pay for attorney fees, investigation and court costs, the loss of future earnings and damage to a lawyer’s reputation if the bar pursues discipline but doesn’t win the case.",
    "PHOENIX (AP) — Arizona Senate Republicans have voted to require the state bar to pay attorney fees and other costs if the bar seeks to discipline a lawyer and ends up losing.",
    "Republican Sen. Vince Leach introduced the bill after Democratic Secretary of State Katie Hobbs filed a bar complaint against Republican Attorney General Mark Brnovich.",
    "“The discipline statistics don’t support the conclusion that the process has been used to weaponize,” England said during a hearing of the Senate Judiciary Committee.",
    "The measure approved Wednesday has the potential to discourage investigations of attorneys accused of ethical violations or other misbehavior.",
    "Hobbs said Brnovich and lawyers in his office broke attorney ethics rules while representing her in cases related to the 2020 election.",
    "Brnovich signed a diversion agreement that requires him to take unspecified actions to keep his law license in good standing.",
    "Joel England, executive director of the state bar, told lawmakers last month that the penalty system is unworkable.",
    "He said with nearly 25,000 lawyers in the state, there were 2,885 charges and 403 were investigated in 2020.",
    "He says in looking into it he found others were also taking advantage of that system.",
    "Leach says Hobbs “weaponized” the bar complaint system by targeting Brnovich.",
    "Leach’s bill passed in a 16-11 vote and goes next to the House.",
    "He said formal action was taken in 68 cases.",
    "Share\nComments"
  ]
}