{
  "id": 1824,
  "mediaId": 8326,
  "date": "2022-02-08",
  "headline": "AG Mark Brnovich wants to send troops to the border (and himself to the Senate)",
  "image": "https://www.gannett-cdn.com/presto/2022/01/11/PPHX/75be6067-e789-43ef-8fd2-a0d9e0cea78b-_RS19937.JPG?crop=2999,1687,x0,y253&width=2999&height=1687&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/02/08/mark-brnovich-aims-ride-border-invasion-right-into-senate/6707614001/",
  "mediaOutlet": "Gilbert Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    2706,
    3401,
    2915,
    4623,
    1489,
    83,
    98,
    5949
  ],
  "sentences": [
    "What’s remaining of the electorate that’s persuadable and how does he get them?”\nThis is how he gets them, by tossing out the biggest, bloodiest cut of red meat available: permission for the governor to execute his war powers and send in the military to beat back an \"invasion\".",
    "“TODAY our office issued a legal opinion determining the current crisis at Arizona’s southern border, fueled by violence and lawlessness of cartels & gangs, legally qualifies as an ‘invasion’ under the U.S. Constitution, & AZ has the power to defend itself,” he tweeted.",
    "It remains to be seen whether this will be enough, whether Brnovich can stay ahead in the polls — ahead of Jim Lamon and his millions and Blake Masters and his sugar daddy tech boss, Peter Thiel, who already has committed $10 million to getting the young man elected.",
    "Earlier on Monday, one of his rival candidates, former Arizona National Guard leader Mick McGuire, called on Brnovich to release records from the State Bar’s investigation of the complaints filed by Secretary of State Katie Hobbs and the Arizona Board of Regents.",
    "“The public has a right to know, one, about the specific ethical violations, two, what were the findings of the investigation and three, what diversion or rehabilitation training has been accepted,” McGuire told The Arizona Republic’s Yvonne Wingett-Sanchez.",
    "When the heat is on, change the subject\nAnd a stellar way to change the subject from the inconvenient fact that he recently agreed to enter into a diversion program to resolve a pair of State Bar of Arizona’s complaints about unethical behavior.",
    "Thus all the Republican candidates beating a path to the border to video themselves, with extra points scored if they can get brown people streaming by behind them as they make their pitch to be the toughest of the tough.",
    "His campaign office is also the Attorney General’s Office\nOn Monday, Brnovich was in full bully pulpit mode, declaring that Arizona is being invaded at the border and thus within its rights to go to war.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Opinion: There is only one way to describe Attorney General/Senate candidate Mark Brnovich's declaration that Arizona is under 'invasion' and can send troops to the border: Genius political move.",
    "The fact that none of the Republican candidates have offered any real solutions to deal with the underlying problems – beyond building a wall – matters not a whit to Republican primary voters.",
    "The fact that many of those immigrants are in search of asylum and most of the ones apprehended are sent packing back across the border matters not a whit to Republican primary voters.",
    "As gubernatorial candidate and Trump favorite Kari Lake so eloquently put it on Monday: “The crooks have been cornered & their house of cards is about to fall.",
    "Mark Brnovich may not be able to match the wallets of his more well-endowed opponents in the Republicans’ Senate race but he’s got something much, much better.",
    "This is an invasion and Arizona has the right to defend itself!”\nI’ll leave it to constitutional scholars to decide whether he’s got a legal leg to stand on.",
    "Brnovich’s ethical problems or his legal blessing for the state of Arizona to send troops to the border, and not just in a support mode as Ducey has done?",
    "“I'm declaring war on the southern border invasion,” he tweeted from his campaign account, which linked to the statement from his official state account.",
    "Not Trump or cash, but Brnovich has red meat\nNow Brnovich has trumped them all, with his declaration that we are being invaded and his call to arms.",
    "He doesn’t have the highly coveted Donald Trump seal of approval, and he’s under pressure to start indicting people for nonexistent election fraud.",
    "And a genius one\nAttached was his inevitable interview with Fox News, which appears to have occurred even before he publicly released his opinion.",
    "It remains to be seen what Trump will do, although it seems likely that he’ll endorse Masters, having already attended a fundraiser for the guy.",
    "“Can Mark hold onto 35% of the electorate and get a piece of that Trump electorate?” longtime Republican consultant Chuck Coughlin mused.",
    "If there is one thing Republican voters care about more than nonexistent election fraud, it’s illegal immigration and border security.",
    "He, after all, has the two most potent campaign weapons of all:\nThe Attorney General’s Office and a well-worn path to Fox News.",
    "We better see some perp walks soon.”\nBut what Brnovich does have is the Attorney General’s Office, and he knows how to use it.",
    "Brnovich’s response was to declare that an “invasion” of Arizona is underway and warrants a military response, should Gov.",
    "Within minutes, Brnovich’s legal opinion became the tip of the spear in his political campaign for the Senate.",
    "Biden has bungled the border, as immigrants and drugs continue to flow forth in mind boggling numbers.",
    "And to sociologists to decode the hyper-heated talk of “invasion.”\nBut as a political move?",
    "“The southern border is being flooded by cartels and gangs, trafficking people and drugs.",
    "The border is a key issue for GOP voters\nBrnovich isn’t raising much money.",
    "They want the country to get control of the border and rightfully so.",
    "Which issue do you think plays best with the Republican base?",
    "Support local journalism: Subscribe to azcentral.com today.",
    "In a crowded Senate primary, I like Brnovich's chances.",
    "“You presume the hard Trumpists aren’t going for him.",
    "Doug Ducey possess the cajones to unleash it.",
    "As I said, genius political move.",
    "We, apparently, are Ukraine.",
    "This was a political move.",
    "Wonder how that happens?)",
    "(Much different.)",
    "Only different.",
    "Genius.",
    "(Huh."
  ]
}