{
  "id": 3223,
  "mediaId": 2528,
  "date": "2022-02-02",
  "headline": "January 6 committee subpoenaed Arizona GOP chair Kelli Ward, who told election officials in the state 'we need you to stop counting the votes'",
  "image": "https://i.insider.com/61fb3221d534ea00198f2a44?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/january-6-committee-subpoenas-arizona-gop-chair-kelli-ward-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelsey Vlamis",
  "authorUrl": "https://www.businessinsider.com/author/kelsey-vlamis",
  "termIds": [
    0
  ],
  "sentences": [
    "Both of the Wards were among those who signed documents that falsely claimed they were the presidential electors for their state in the 2020 election, declaring former President Donald Trump the winner of Arizona's electoral votes, despite the state being won by President Joe Biden, Politico reported.",
    "The select House committee investigating the Capitol riot subpoenaed the phone records of Kelli Ward, the chair of the Republican party in Arizona, and her husband, Michael Ward, according to a lawsuit filed by the couple on Tuesday, Politico reported.",
    "The lawsuit argues that providing the records would infringe upon their right to privacy and doctor-patient privilege, as the Wards are both doctors and use their phones to talk to patients, as well as violate their First and Fourth Amendment rights.",
    "Shortly after the messages were revealed, Arizona Secretary of State Katie Hobbs urged the state's attorney general to launch a criminal investigation into whether state election laws were violated by Trump or his allies, including Kelli Ward.",
    "In texts to members of the county's Board of Supervisors, Kelli Ward wrote: \"We need you to stop the counting\" and \"I know you don't want to be remembered as the guy who led the charge to certify a fraudulent election.\"",
    "In July, public records obtained by The Arizona Republic and the Associated Press showed Kelli Ward had pressured officials in Maricopa County, which includes Phoenix, to stop counting ballots.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Pro-Trump electors from seven states signed illegitimate certificates in a failed attempt to falsely claim that Trump won the popular vote in their respective states.",
    "The lawsuit said T-Mobile received the subpoena from the committee on January 24, and that they are seeking phone records from November 1, 2020, to January 31, 2021.",
    "Ross D. Franklin, File/Associated Press\nThe January 6 committee has requested phone records of Arizona GOP chair Kelli Ward and her husband.",
    "The Wards are suing the committee, Chairman Bennie Thompson, and T-Mobile to block the company from providing their phone records.",
    "In this Nov. 18, 2020, file photo, Dr. Kelli Ward, chair of the Arizona Republican Party, holds a press conference in Phoenix.",
    "The scheme was coordinated by Trump campaign officials and Rudy Giuliani, CNN and The Washington Post reported last month.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "The Wards were among the pro-Trump electors to sign illegitimate certificates related to the election results.",
    "The Wards filed a lawsuit Tuesday against the committee and T-Mobile to block the subpoena.",
    "T-Mobile and Rep. Thompson's office did not immediately respond to a request for comment.",
    "An attorney for the Wards did not immediately respond to Insider's requests for comment.",
    "When the texts were initially reported, Ward called the media reports \"BS\" in a tweet.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}