{
  "id": 3359,
  "mediaId": 5296,
  "date": "2022-01-30",
  "headline": "Arizona Republican Party, Maricopa County Republican Committee Adopt Election Integrity Resolution",
  "image": "https://www.thepostemail.com/wp-content/uploads/2022/01/TM-Election-Integrity-Resolution-adopted.png",
  "link": "https://www.thepostemail.com/2022/01/30/republican-party-of-arizona-maricopa-county-republican-committee-adopt-election-integrity-resolution/",
  "mediaOutlet": "thepostemail.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The resolution reads:\nWhereas ongoing controversies related to the official results of the 2020 Maricopa County Election [2020 Election] remain unresolved;\nWhereas Maricopa County government failed to maintain appropriate control over the administration of the election, essentially turning over partial control to Dominion Voting Systems (VIDEO);\nWhereas the primary purpose of the Audit was to uphold the most basic — and important — principles of election integrity;\nWhereas the Audit contractors strived to be a part of the solution to any and all problems observed in the administration of the election, up to and including the County canvass and state certification of the election results; and\nWhereas the Maricopa County Board of Supervisors, Recorder’s Office, Elections Department, Attorney’s Office, and Arizona Secretary of State’s Office failed to honor or cooperate with the Audit as appropriate, thus making those government agencies part of the problem, yet those agencies blamed problems on the auditors, further undermining the integrity of the 2020 Election; now, therefore, be it\nResolved, the Arizona Republican Party hereby:\nExpresses appreciation and gratitude for the Arizona State Senate Audit of the 2020 Election;\nCalls upon Maricopa County government to immediately cooperate with the Audit and immediately terminate contracts with Dominion Voting Systems (DVS), including DVS personnel;\nUrges the Arizona Attorney General to remain committed to a comprehensive investigation of the administration and certification of the 2020 Election; and\nEncourages the Arizona State Legislature and Arizona Governor to immediately enact responsible election laws further upholding election integrity in Arizona elections.",
    "As for the state senate’s subpoenas to Dominion for data and materials associated with the November 3, 2020 election, CBS wrote:\nDominion, which makes the election equipment used by Maricopa County, also refused to comply with the request, calling it “illegal and unenforceable.” Dominion said that it only provides its security keys and confidential passwords to “authorized recipients” that are “specifically approved by the U.S. Election Assistance Commission” and complying with the subpoena “would cause grave harm.”\nThe audit was considered “controversial” by some, and recent litigation on the part of The Arizona Republic and a non-profit, American Oversight, for records from the audit held by the lead company, Cyber Ninjas, has prompted the company to close, Arizona Family reported January 5.",
    "Having served as a poll worker, poll watcher and election worker in the past, he said, he began to observe a departure from customary voting practices prior to the August primaries “under cover of COVID.”\nWhile much of what Manos told us and provided in the way of documentation is material for future articles, he observed that U.S. elections systems are “far too complex for their own good.”\nWe asked Manos about the history of the resolution and his public service:\nQ: When did you first conceive of the idea of writing the resolution, and how long did it take to draft it?",
    "What truly matters is not which party controls our government, but whether our government is controlled by the people.”\nI imagine once he said those things, as great as patriotic Americans felt, it shocked dark forces all throughout the United States and all throughout the world, and those anti-American forces saw President Trump as an existential threat, and that’s all directly related to how they tried to take him down over and over and over again, before he ran, while he ran, once he was elected, and still to this day.",
    "That’s for him to decide, and so he has to make sure that everything he does, not only does he have to prove and back up everything that we gave to him…then he has to go to the next step and determine, ‘OK, how do we handle this?’ So it’s not appropriate for him to talk about it.”\nTwo weeks after the MCRC adopted Manos’s resolution, at its annual meeting on January 22, the Arizona Republican Party (AZGOP) chaired by Dr. Kelli Ward, followed suit.",
    "2022-AZGOP-Mandatory-Meeting-CallDownload\nIn the January 28, 2022 issue of “Republican Briefs,” Manos wrote of the adoption of the resolution:\nGood to see the Resolution adopted at the 2022 MCRC and AZGOP Mandatory Meetings promoting the importance of upholding Election Integrity HERE is being covered by the Arizona Republic (AZ Central), going so far as quoting multiple lines of the Resolution, HERE (or HERE to bypass a paywall).",
    "Others in Arizona, including State Senate President Karen Fann, who chaired several audit hearings, claimed after the results of the audit were made public that the election was marred by suspected fraud and what appeared to be violations of law, whether intentional or stemming from “incompetence.”\nIn late September the results were made public in a lengthy hearing before the state Senate.",
    "One of my favorite sayings in promoting the importance of Precinct Committeemen is, “If you see something missing in the Republican Party, it might just be you.” It’s important for patriotic Americans to realize, especially those committed to America First, Make America Great Again (these days, more like Save America), the opportunity to transform the Republican Party from within.",
    "Although it’s Republican Party membership who adopted this resolution, it really transcends partisan politics: it’s for our fellow citizens, it’s of, by, and for We The PCs serving and representing We The People and our God-given and unalienable rights to Life, Liberty, Property, and the Pursuit of Happiness, all backed up by the right of We The People to Keep and Bear Arms.",
    "On March 31, 2020, the Wisconsin Supreme Court issued an opinion that, contrary to “guidance” issued by Dane County Clerk Scott McDonnell, the state’s election law does not allow for voters to simply declare themselves to be “indefinitely confined,” therefore allowing them to cast an absentee ballot, without providing proof of identification to election officials.",
    "At 2:06:40 in a November 20, 2020 meeting of the Board of Supervisors to discuss complaints arising from the election and the results of an election canvass, Maricopa County Election Day and Emergency Voting Director Scott Jarrett described Dominion as “subject matter experts” who provide a valuable “private-public partnership” to the county.",
    "According to the election integrity organization TruetheVote.org following Raffensperger’s confirmation of an investigation:\nAfter a year’s worth of research and analysis, True the Vote submitted three official complaints to the Georgia Secretary of State’s office regarding occurrences in the 2020 General and 2021 Run-off Elections.",
    "by Sharon Rondeau\n(Jan. 30, 2022) — At its meeting on January 8, the Maricopa County (AZ) Republican Committee (MCRC) adopted a resolution drafted by Phoenix businessman and MCRC committeeman Tristan Manos focused on the issue of election integrity stemming from the November 3, 2020 presidential election.",
    "Long story short, I wrote this resolution to call attention to what’s been going on and what it’s going to take to get things right, meaning getting ourselves good government, making elections open and transparent again, easier for We The People to understand, participate, and control again.",
    "Once an SC, a member may run to serve as an executive officer of the state party (the AZGOP, which also adds Members-at-Large and other positions, including National Committeeman and National Committeewoman (one position is reserved for a man, and the other is reserved for a woman).",
    "A: A Precinct Committeeman (man or woman) is charged to serve and represent his or her fellow registered Republicans throughout his or her Precinct first, then throughout the overall Legislative District (or LD for short), mostly on just about anything and everything political.",
    "In Maricopa County, one Precinct Committeeman position is established for every 125 registered Republicans in one’s own Precinct, and it’s the Precinct Committeemen (or PCs for short) who are the members of the Maricopa County Republican Committee (or MCRC for short).",
    "Where else is it being covered, or even mentioned in any way, shape, or form, especially within Republican circles, even President Trump e-blasting it or actually talking about it, via his Trump Alerts and 45 Office platforms, in an interview, or anything, anywhere?",
    "If you see or hear any mention of this Resolution, anywhere, please contact me, or if you’d like a copy of the text HERE, a graphic HERE, or the controversial statements made by Maricopa County government officials that hit over half a million views on Twitter HERE.",
    "A: I like to make a point of writing a minimum of one resolution for the MCRC’s annual county party meeting and the AZGOP’s annual state party meeting, so something about some resolution is just about always on my mind, one way or another, to one extent or another.",
    "For its part, the Maricopa County Board of Supervisors, which consists of four Republicans and one Democrat, alleges the audit’s final results contain “nearly 80 false claims” after writing in a letter to Fann in May it would not cooperate further with the Senate.",
    "“These individuals know the software better than us; they train our employees through the contractual relationship; we rely on their expertise to ensure that we have a – we can provide a accurate [sic], reliable election for Maricopa County voters,” Jarrett said.",
    "Some people downplay or even dismiss resolutions for one thing or the other, but I strongly believe in the great potential resolutions represent, most especially as positively charged and highly principled position statements driving bold calls to action.",
    "Where it’s going, one may say he or she can only imagine, or hope, or pray, but, as good and important as that may be, I go back to emphasizing the importance of getting all the more involved, oneself, especially by being a Precinct Committeeman.",
    "A: Both the AZGOP and MCRC Bylaws prescribe some of the overall protocol, mostly in the form of some official basic requirements, with the remainder being up to the AZGOP and MCRC Chairs first, then the respective Resolutions Committee Chairs.",
    "Citing that ruling, the citizen-led Voter Integrity Project of the non-profit LookAheadAmerica.org reported on that in Wisconsin in 2020, “1,093% more Indefinitely Confined statuses were granted than in 2016, with 169,282 new applications.",
    "You can read more about the announcement here – Georgia Opens Investigation Into Possible Illegal Ballot Harvesting in 2020 Election\nShockingly similar findings will soon be released to appropriate authorities in five additional states.",
    "On August 4, 2021, CBS News reported of the audit:\nThe Maricopa County Board of Supervisors and Dominion Voting Systems refused Monday to provide additional material requested in subpoenas from Republicans in the Arizona Senate.",
    "While the number of ballots cast for Joe Biden was found to be slightly higher than officials had certified, approximately 49,000 ballots were questioned for various reasons, according to a 97-page report released September 24.",
    "Because today we are not merely transferring power from one administration to another, or from one party to another, but we are transferring power from Washington, D.C. and giving it back to you, the American People.",
    "Their victories have not been your victories; their triumphs have not been your triumphs; and while they celebrated in our nation’s Capital, there was little to celebrate for struggling families all across our land.",
    "Just prior to the audit results becoming public, a Special Master was appointed to mediate between the county and the Senate on outstanding issues surrounding the Senate’s subpoenas for additional information.",
    "In Georgia, an investigation was launched earlier this month into possible ballot “harvesting” in the 2020 election and 2021 Senate runoff elections by Secretary of State Brad Raffensperger; in November, Gov.",
    "After it’s adoption, where is one single Arizona State or Federal Legislator (Senate or House), or candidate for the same, or candidate for Arizona Governor or Secretary of State, calling attention to it?",
    "Although media outlets criticized the audit as “partisan,” “troubled” and amateurish, they quickly reported that the findings showed Biden with slightly more votes than were certified by state officials.",
    "If you’re looking at a grand jury, if you are looking at some sort of potential indictment or whatever path that he goes down based on everything he finds out and these mistakes that were done.",
    "After that, over the course of a few days, I made a few rounds of minor revisions to fine tune the wording before officially submitting the resolution to the MCRC’s Resolutions Committee Chair.",
    "A: I imagine everything in the resolution, most especially what it resolves to bring about in its conclusion, in the form of its principled, bold, and important calls to action, is happening.",
    "All the above goes to show how, in some way, to some extent, the Precinct Committeeman is one of the most important (some say one of the most powerful) positions in the Republican Party.",
    "COVID-19 was not a qualification.” Despite the court ruling, in its analysis, the group found “243,900 indefinitely confined registered voters in the 2020 General Election in Wisconsin.",
    "All resolutions approved by the Resolutions Committee shall be sent to the duly elected PCs with the notice of the time and place of such Statutory Organizational or Mandatory Meeting.",
    "One particular passage is bold, righteous, and remarkable, all at the same time:\nPresident Trump (Inaugural Speech, January 20th, 2017):\n“Today’s ceremony has a very special meaning.",
    "The resolution expressed “appreciation and gratitude” for the audit completed in September of the county’s 2020 election returns launched by Republican members of the Arizona Senate.",
    "Of those voters, 169,282 claimed the indefinitely confined status for the first time.”\nBiden reportedly won Wisconsin’s ten electoral votes by a margin of just under 21,000 ballots.",
    "I never even brought it up with anyone, that is, of course, until officially submitting it to the Resolutions Committee, where it was ultimately accepted at the committee’s meeting.",
    "Might it be that the name of the author is someone other than yourself, and you’re more, mostly, or only interested in calling attention to something if it’s got your name on it?",
    "Once it was locked in, I submitted the same overall resolution to the AZGOP Resolutions Committee Chair, only changing the wording in one passage from the MCRC to the AZGOP.",
    "All resolutions not initiated by the Resolutions Committee must be submitted forty-five (45) days in advance of the scheduled Statutory Organizational or Mandatory Meeting.",
    "Contact: tristanmanos3@gmail.com\nOn Friday we spoke with Manos at length about Maricopa County elections and the questions arising from the last presidential election.",
    "This resolution is just one small but important part of something that’s greater than us all, but is going to take us all to get involved and to save America.",
    "In a recent interview (scroll to bottom of page here), Fann told Gateway Pundit journalist Jordan Conradson that Brnovich “has opened up an investigation.",
    "The adoption of this resolution reflects the organizational integrity of both the Arizona Republican Party and the Maricopa County Republican Committee.",
    "This Resolution is primarily for the sake of upholding Election Integrity, starting right here—Ground Zero—Maricopa County, and all throughout Arizona.",
    "As a result, on January 3, 2022, Georgia Secretary of State Brad Raffensperger announced a statewide investigation into ballot trafficking in Georgia.",
    "I pray to God for Divine Intervention, for the sake of Divine Providence, for the sake of God’s Creation, for past, present, and future generations.",
    "Special thanks to Arizona State Senator Sonny Borrelli for taking to the mic at the AZGOP Mandatory Meeting to voice his strong support for it.",
    "The AZGOP Chair, the National Committeeman, and the National Committeewoman all serve on the Republican National Committee (or RNC for short).",
    "The Republic you save will be your own, in your time, and for future generations who will see you and be grateful to you for getting involved.",
    "Fann followed up on the audit’s conclusions by referring the alleged criminal wrongdoing to Arizona Attorney General Mark Brnovich’s office.",
    "Once a PC, a member may run to serve as an executive officer of an LD as LD Chair, 1st Vice-Chair, 2nd Vice-Chair, Secretary, or Treasurer.",
    "A: I wrote the resolution, including the title, all by myself, praying to God for the right words in the right spirit all along the way.",
    "Q: As far as you know, what is the current status of the investigation into the 2020 Maricopa County election conducted by Cyber Ninjas?",
    "I can tell you that it is extensive; they have pulled numerous, numerous people…these are things that you don’t talk about in public.",
    "Beyond that, a PC may run to serve as an executive officer of the county committee (the MCRC), which also adds five Members-at-Large.",
    "I’m Just In The Way.” President Trump ran for re-election in 2020, and we saw how that played out, and how it’s still playing out.",
    "In 2016, President Donald J. Trump showed how to run as a Republican and win as a Republican, transforming the party from within.",
    "I worked on the first draft of the resolution for just a few hours straight one day, and it ended up being about 99+% good to go.",
    "For too long, a small group in our nation’s Capital has reaped the rewards of government while the people have borne the cost.",
    "The saying about how there’s a lot more of us (PCs and SCs) than them (county and state party executive officers) rings true.",
    "Were they done out of incompetence, or were they done intentionally, which would indicate that there may be some fraud there.",
    "The popular meme is right: President Trump boldly faces you in black and white, saying, “In Reality, They’re Not After Me.",
    "Q: What is the process for submitting a resolution to either the Maricopa County Republican Committee or the AZGOP?",
    "Biden won Arizona’s 11 electoral votes by 10,457 votes as certified by Secretary of State Katie Hobbs (D) and Gov.",
    "In July, 45th President Donald J. Trump predicted “outrageous” results from the audit once they became available.",
    "That all changes – starting right here, and right now, because this moment is your moment: it belongs to you.",
    "PCs may run for State Committeeman (or SC for short), established as one SC position for every three PCs.",
    "Arizona is one of six states the Trump campaign claimed he won were it not for widespread ballot fraud.",
    "In Arizona, Republicans hold a two-seat majority in both the state House of Representatives and Senate.",
    "It’s about good government, election integrity, and civic duty, and it all goes to personal integrity.",
    "“One count of 950 votes for Biden actually appears to be just 92,” JusttheNews reported November 19.",
    "In general, people who exit the Republican Party or try to start a new party are missing the point.",
    "A good resource to check out is my good friend Dan Schultz’s website at www.precinctstrategy.com.",
    "Imagine the feeling you’d get being asked, “Where were you when all this was going on?” Be a PC.",
    "The Arizona Republican Party and Maricopa County Republican Committee both voted to adopt it.",
    "For example, Article VIII Section 4 (c) of the MCRC Bylaws states:\nProposing Resolutions:\n1.",
    "Good people must get into the Republican Party and go about transforming it from within.",
    "I strongly encourage people to revisit his Inaugural Speech (linked to CSPAN archive).",
    "It belongs to everyone gathered here today and everyone watching all across America.",
    "Proposed resolutions, other than memorial, shall be no more than 250 words long.",
    "Speaking more generally, any Election Integrity advocates, anywhere, out there?",
    "Biden’s declared victory over Trump in Georgia was by fewer than 12,000 votes.",
    "When are elections held, and how long do those elected hold their positions?",
    "SCs are the members of the Arizona Republican Party (or AZGOP for short).",
    "The establishment protected itself, but not the citizens of our country.",
    "The others are Wisconsin, Nevada, Pennsylvania, Michigan, and Georgia.",
    "Brian Kemp launched a probe into election practices in Fulton County.",
    "Is the AG taking action on the criminal referral sent by Senate Pres.",
    "Politicians prospered, but the jobs left, and the factories closed.",
    "Washington flourished, but the people did not share in its wealth.",
    "It’s about We The PCs serving and representing We The People.",
    "And this, the United States of America is your country.",
    "Q: What are the responsibilities of a committeeman?",
    "Never mind the author, always mind the principle.",
    "If you believe in it, take it and run with it.",
    "Were there several drafts, or “one and done”?",
    "If you’re already involved, good and great.",
    "Doug Ducey (R) on November 30, 2020.",
    "If otherwise, please get involved.",
    "Q: Did anyone help you write it?",
    "This is your celebration.",
    "What’s that mean to you?",
    "They’re After You.",
    "This is your day.",
    "Karen Fann?",
    "3.",
    "2."
  ]
}