{
  "id": 3657,
  "mediaId": 2578,
  "date": "2022-01-19",
  "headline": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/654E115F-2CEB-470C-80B2-14E9CBAC17F1.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/01/az-attorney-general-mark-brnovich-threatens-prosecute-soros-funded-secretary-state-katie-hobbs-rigging-2022/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    5292,
    4267,
    4623,
    4066,
    3401,
    5949
  ],
  "sentences": [
    "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State Katie Hobbs for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General Mark Brnovich for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "Sambo “Bo” Dul\nGeneral Counsel & Sr. Election Policy Advisor\nArizona Secretary of State\n1700 West Washington Street, 7th Floor\nPhoenix, Arizona 85007\nRe: Availability of E-Qual for 2022 Legislative & Congressional Candidates\nDear Ms. Dul:\nWe have received numerous complaints regarding the Secretary of State’s Office (“SOS”) recent communication to congressional and legislative candidates regarding the E-Qual online system.",
    "The law requires the Secretary of State to provide an online system for congressional and legislative candidates to gather nomination signatures: “Notwithstanding any other statute in this title, the secretary of state shall provide a system for qualified electors to sign a nomination petition … for [candidates for statewide and legislative offices] by way of a secure internet portal.” A.R.S.",
    "Moreover, as you are aware, a public officer upon whom a duty is imposed by Title 16, who knowingly fails or refuses to perform that duty in the manner prescribed by law or knowingly acts in violation of any provision of such law, is guilty of either a class 6 felony or class 3 misdemeanor.",
    "Arizona Republicans are working to pass election reform in the legislature, including decertification of the fraudulent 2020 election after the Maricopa County election audit found hundreds of thousands of ballot discrepancies, and elections law violations.",
    "In … Continue reading\nKatie Hobbs, who is also running for Governor of Arizona, sent an email to candidates last week, informing them that the E-Qual online system would be shut down in March, likely until the end of the filing period in April.",
    "Sincerely,\nJennifer Wright\nAssistant Attorney General\nSenate Majority Leadership Applauds @GeneralBrnovich for Once Again Calling Out @SecretaryHobbs for Failing to Comply with Elections Law\nFull statement and letter can also be found HERE: ??",
    "An email sent from the SOS dated January 11, 2022, informed candidates that the system would be suspended when the new redistricting maps are finalized and likely remain unavailable through the remainder of the filing period.",
    "No matter what state you live in, contact Arizona Attorney General Mark Brnovich to demand immediate action and arrests for the criminals identified in the long-ago reported audit and canvassing efforts in Maricopa County.",
    "EXCLUSIVE: The Fact that Arizona Attorney General Brnovich Has Done Nothing with Criminal Activities Identified in 2020 Election Audit is REPREHENSIBLE\nThey’re now doing again because they got away with it last time.",
    "The SOS must therefore take all steps necessary to continue the E-Qual system during the remainder of the candidate filing period in order for the Secretary of State to comply with the law and her legal duties.",
    "https://t.co/1iwwBUqpIg pic.twitter.com/BrbT6nVUqZ\n— AZSenateRepublicans (@AZSenateGOP) January 18, 2022\nYesterday, Arizona Senate Republicans issued a statement commending Arizona Attorney General Brnovich.",
    "Arizona will operate under the 2019 Elections Procedures Manual in the upcoming elections after Arizona Attorney General Mark Brnovich refused to certify AZ Secretary of State Katie Hobbs’ 2021 draft manual.",
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nThis would make the online petition portal for 2022 candidates unavailable.",
    "The Gateway Pundit recently reported that the Arizona Attorney General Mark Brnovich rejected Katie Hobbs’ proposed 2022 Elections Procedures Manual after she failed to correct the outlined law violations.",
    "As it is clear that no action yet has been taken to deprive candidates of their statutory right to obtain online nomination signatures, we urge the Secretary of State to fix the system without delay.",
    "We would expect greater leadership from someone charged with carrying out the core functions of Arizona’s election laws, but instead, she continues to make serious errors that violate statute.",
    "Many Of My Colleagues In The Arizona Senate Want To Decertify.”\nArizona Attorney General Mark Brnovich recieved all evidence of voter fraud in Maricopa County and other counties months ago.",
    "On Friday, Assistant Attorney General Jennifer Wright sent an email to the Secretary of State’s office, threatening Katie Hobbs’ with a class 6 felony if she follows through.",
    "The Attorney General is required to enforce the provisions of Title 16 through civil and criminal actions in any election for members of the legislature.",
    "Radical Soros-funded leftist Arizona Secretary of State Katie Hobbs is straining to steal the 2022 elections, starting with a rigged primary election.",
    "Furthermore, the“system shall allow only those qualified electors who are eligible to sign for a particular candidate to sign the petition[.",
    "Secretary of State Hobbs’ blatant disregard of state law infringes on the ability for candidates from all parties to qualify for the ballot.",
    "No potential candidates should face any illegal roadblocks when participating in our democratic process,” stated Senate Majority Leadership.",
    "Arizona Secretary of State Katie Hobbs is running for Governor of Arizona, and she tried to make it even easier to cheat again.",
    "“The Secretary of State’s office is tasked with facilitating candidate election qualification- not influencing it.",
    "Arizona law requires the Secretary of State to provide a secure internet portal for candidate petitions.",
    "The purpose of this letter is to inform you that any such action would be contrary to law.",
    "§ 16-316(A), (B) (emphasis added);seealsoA.R.S.§16-318(same for congressional candidates).",
    "Candidates must obtain a minimum number of petition signatures to appear on a ballot.",
    "State Senator Wendy Rogers Speaks At AZ Trump Rally: “I Am A Yes Vote To DECERTIFY.",
    "Arizona will now operate under the 2019 Elections Procedures Manual.",
    "He has done little to hold criminals like Katie Hobbs accountable.",
    "She is rigging another election.",
    "§§ 16-1009, -1010.",
    "§ 16-1021.",
    "A.R.S.",
    "A.R.S.",
    "]” Id."
  ]
}