{
  "id": 4089,
  "mediaId": 2520,
  "date": "2022-01-27",
  "headline": "Frontrunner no more. New poll shows Kari Lake has gone stagnant",
  "image": "https://www.gannett-cdn.com/presto/2022/01/16/PPHX/92791a04-7438-465a-ae5a-6074983712e6-Trump_in_Florence_Drop_4_041.JPG?crop=2648,1490,x0,y0&width=2648&height=1490&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2022/01/27/kari-lake-just-lost-her-gop-frontrunner-status-arizona-governor/9244618002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurie Roberts",
  "authorUrl": "https://www.azcentral.com/staff/2646519001/laurie-roberts/",
  "termIds": [
    0
  ],
  "sentences": [
    "There may be a limit to Kari Lake's appeal\nLake jumped into the race last June with a bellyful of anger, raging her way right to the top of the heap, saying all the right things to win over hard right Republicans.",
    "“However, it’s not translating into an increase of support.”\nNone of the other candidates hit double digits in the poll, though I’d watch for Karrin Taylor Robson, with her yacht-load of cash, to come on strong.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "After spending more than a million dollars on her campaign, snagging Donald Trump’s endorsement and grabbing all of the headlines in the race, it appears this particular Lake has gone stagnant.",
    "Add in already strong name ID, from her two decades as a news anchor, and it didn’t take long for Trump to endorse her, making her the candidate to beat in the Republican primary.",
    "Add in those all-important independent voters, who weren’t part of the poll but will certainly play a large role in the election, and this Lake may have sprung an early leak.",
    "By contrast, Lake has burned through her money – spending it on food, travel and campaign events rather than voter outreach – and has just $375,000 left.",
    "“She’s got a celing, and my sense is that it will ultimately end up somewhere in the 20s,” longtime Republican consultant Chris Baker told me.",
    "“Lake has had great fundraising, key political endorsements and a good amount of earned media,” pollster Mike Noble told me.",
    "She’s dropped seven points since November, according to a new poll of registered Republicans by OH Predictive Insights.",
    "But some longtime operators in GOP circles have wondered if there’s a limit to Lake’s appeal.",
    "Lake’s support dropped from 28% in November to 21% in OH Predictive Insight’s January poll.",
    "In all, the poll found 46% of Republican voters haven’t yet decided who they will support.",
    "It’s distorting.”\nShe spent on food, not voter outreach\nThis poll underscores that point.",
    "Kari Lake, Republican frontrunner in the governor’s race, is the frontrunner no more.",
    "A similar sized poll of Democrats saw Katie Hobbs with a commanding lead of 46%.",
    "The poll of 302 Republican voters was conducted via an online panel Jan. 11-13.",
    "The drop in support isn’t steep, given the poll’s 5.7% margin of error.",
    "But the fact that Lake isn’t attracting any new Republican support?",
    "“Right now, the most extreme in the GOP get all the attention.",
    "Neither Marco Lopez nor Aaron Lieberman reached double digits.",
    "Support local journalism: Subscribe to azcentral.com today.",
    "Robson has nearly $3 million in the bank to make her case.",
    "Support for Salmon, meanwhile, rose from 11% to 17%.",
    "Maybe a Trump endorsement isn’t what it used to be.",
    "Embrace conspiracy theories about election fraud?",
    "Money on hand is key as the race goes nasty.",
    "Rail about the border/masks/teachers?",
    "Has this Lake sprung an early leak?",
    "Salmon has $491,000 in the bank.",
    "(And, oh yes, it will.)",
    "Check, check, check.",
    "Attack the media?",
    "Check.",
    "Check."
  ]
}