{
  "id": 4691,
  "mediaId": 8350,
  "date": "2022-04-21",
  "headline": "Republican Arizona AG Brnovich suing Democratic Sec. Hobbs over election procedures manual",
  "image": "https://ktar.com/wp-content/uploads/2022/04/brnovich-hobbs-split-900x506-1.jpg",
  "link": "https://ktar.com/story/5019212/republican-arizona-ag-brnovich-suing-democratic-sec-hobbs-over-election-procedures-manual/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/associated-press/",
  "termIds": [
    4623,
    3401,
    392,
    1126,
    1489,
    6515,
    6070
  ],
  "sentences": [
    "“There is no legal basis for these wholesale deletions, and they contravene the purpose of the Manual itself, leaving large gaps in election procedures, introducing inconsistency to longstanding processes, and creating unnecessary uncertainty and risk for election officials on the cusp of an election year that will already be challenging due to redistricting,” Hobbs wrote.",
    "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State Katie Hobbs in an escalation of a dispute over the election procedures manual she is required to complete.",
    "The GOP-controlled Legislature responded by stripping Hobbs of her authority to determine the state’s position in election cases, even though she’s the chief election official, though that provision was later blocked by the Arizona Supreme Court.",
    "Brnovich threatened to investigate Hobbs for temporarily taking down an online signature collection system used by candidates in order to update it with new congressional and legislative district maps approved early this year.",
    "It seeks an order compelling Hobbs to provide a manual that gives county election officials clear guidance on how to run elections and complies with current state election law.",
    "Brnovich entered a diversion agreement with the State Bar of Arizona that will result in the complaint being dismissed if he follows through with certain commitments.",
    "A contract lawyer Brnovich hired to review the manual sent her a letter in early December where he said large parts of it did not meet legal requirements.",
    "The two have been at odds for months over the manual that tells county officials how to run elections, and have tangled in other fights as well.",
    "In 2020, Hobbs filed a complaint with the state bar alleging Brnovich acted unethically in representing her and her office in election cases.",
    "In a Dec. 17 response, Hobbs told Brnovich much of the rejected material had been approved just two years earlier by him and Gov.",
    "Hobbs then sought a judge’s intervention to stop that promised investigation, but the judge said her request was premature.",
    "The lawsuit by Brnovich and the Yavapai County Republican Committee was filed Thursday in Yavapai County Superior Court.",
    "Brnovich is seeking his party’s nomination for U.S. Senate in hopes of taking on Democratic Sen. Mark Kelly in November.",
    "Brnovich has not said what’s required of him, but such agreements often involve additional training in legal ethics.",
    "That left the one she completed two years before as the guidelines for the 2020 elections.",
    "Hobbs submitted the manual as required on Oct. 1, but Brnovich refused to approve it.",
    "Brnovich then farmed out the investigation to the Cochise County Attorney’s Office.",
    "There is a political backdrop to all the drama.",
    "Hobbs, meanwhile, is running for governor.",
    "The two have been at odds for much longer.",
    "Share\nComments",
    "Doug Ducey."
  ]
}