{
  "id": 5073,
  "mediaId": 2658,
  "date": "2022-04-22",
  "headline": "‘You only win if you fight’: Will Gallego unseat Sinema?",
  "image": "https://static.politico.com/06/2a/37ca911d45dcb585aa3f1efa816e/https-delivery.gettyimages.com/downloads/1253484669",
  "link": "https://www.politico.com/news/2022/04/22/ruben-gallego-deep-dive-00027134",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Trump narrowly lost the state in 2020, Senator Mark Kelly — the Democratic incumbent — is one of the most vulnerable senators up for reelection this year and strategists are already looking at the 2024 Senate election to see who will run against Kyrsten Sinema.",
    "Mentioned in the show:\nCongressman Gallego’s book about his time in Iraq: They Called Us “Lucky\": The Life and Afterlife of the Iraq War’s Hardest Hit Unit\nTranscribed excerpts from that conversation are below, edited for length and readability.",
    "On Senator Kyrsten Sinema and potentially running against her in the 2024 primary:\nRyan Lizza: Do you think you’ve passed the point of no return where you are definitely going to jump in that primary or it’s still a decision for the future?",
    "And I’ll be honest, growing up in Evergreen Park, Illinois, with a lot of like working-class white Democrats, by the way, I just knew that what he was saying and doing was appealing to them and that would actually have an effect.",
    "We’re going to have a blowout fight all the way up into the primary, and the most likely thing is that whoever won that primary was going to lose that general because we’re going to fight each other.",
    "| Tasos Katopodis/Getty Images\nBy POLITICO Staff\n 04/22/2022 05:00 AM EDT\nThis week Playbook co-author Ryan Lizza is in Arizona to dig into a few big plotlines ahead of this year’s elections.",
    "They discuss Gallego’s fraught history with Sinema, a potential campaign against her in 2024, the political environment in Arizona ahead of midterms and his deployment in the Iraq war.",
    "I don’t think she’s going to do it with me because I mean, honestly, I think she cares more about her career than she cares about what we can do with our elected office, right?",
    "Gallego: I looked at the numbers and I said, “You know, we’re assuming that white voters are going to vote the same way, that we’ve hit the bottom.” I just didn’t believe that.",
    "Number two, what he was in terms of danger to this democracy, And I told people and I said, “This guy can also win the general.”\nLizza: Why did you think that at that time?",
    "A lot of the time there are events where all the Democrats who are up for election get together and they put their hands together and like, “Unity.",
    "Do you have a chance to make a difference?” And what we’re looking at right now may be different than what we’re looking at next year.",
    "I think she understands Arizona from a perspective many years ago, but she actually doesn’t understand Arizona like what’s happening.",
    "But I understand there’s a pretty significant Senate race in Arizona this year, and a significant governor’s race.",
    "Gallego: I think it for me, it became apparent in the 2016 election where she nominally endorsed Hillary Clinton.",
    "I literally have done everything I can to keep this party alive in this state, and I was not going to do it.",
    "On this week’s Playbook Deep Dive Episode, Ryan joins Rep. Ruben Gallego for a long dinner and a few drinks.",
    "She never understood, because in order for you to do that, you actually have to expose yourself.",
    "I would love to be on the stump with her helping Democrats win, but she’s not going to do it.",
    "She’s running based on past elections, but she isn’t involved to see what’s happening here.",
    "Congressman Ruben Gallego: Well, I think the decision is going to be made by Arizonans.",
    "Gallego: No, the difference is, look… I care about the Arizona Democratic Party.",
    "I believe that I saw the existential threat to Trump before a lot of people did.",
    "Gallego: At the end of the day, I realized that two things are going to happen.",
    "In 2018, in 2020, I thought for a long time about running against [Mark] Kelly.",
    "I mean, look, honestly, she’s not going to be out here stumping for Democrats.",
    "So the perspective of politics is based ten years ago and she never adapted.",
    "But I’m not going to do something that’s going to harm the Democratic Party.",
    "I have done everything, some of the hardest time, to keep this party alive.",
    "We have the largest microchip manufacturing plant opening up right now.",
    "And she’s not one to expose herself to what could be like criticisms.",
    "I was stumping for Hillary all over the state, all over the country.",
    "Lizza: In other words, you’re not going to mount a suicide mission.",
    "I think we have the values that are going to make Arizona better.",
    "She’s not here that often, so I would have to interact with her.",
    "Lizza: What is it like when you interact with her [Sinema] now?",
    "She’s not going to help Katie Hobbs or whoever the Democrat is.",
    "She’s not going to be out there with our gubernatorial nominee.",
    "We have Latino young men and women that were 18 ten years ago.",
    "Rep. Ruben Gallego attends a press conference on Capitol Hill.",
    "She, You know, in my opinion, and I look, I will say this.",
    "Lizza: You don’t think she’ll be on stage with Mark Kelly?",
    "Like, I’ll be out there helping whoever is the nominee.",
    "Lizza: Like, she wasn’t a full-throated endorsement?",
    "Yay!” So is that going to happen with you and her?",
    "Politicians don’t decide this on their own vanity.",
    "We have all these biotech companies moving here.",
    "She doesn’t care about the Democratic movement.",
    "Because I’m a good Democrat, I want us to win.",
    "Lizza: When did that become apparent with her?",
    "But look, we have to interact with each other.",
    "We have all these tech companies moving here.",
    "Gallego: Oh no, because she doesn’t do that.",
    "She doesn’t care about working class people.",
    "She’s not going to be out there with Mark.",
    "Gallego: I mean honestly, we just haven’t.",
    "Honestly, she doesn’t understand Arizona.",
    "They’re now 28 and are starting to vote.",
    "Everyone just didn’t want to believe it.",
    "It’s like, “Do you have a chance to win?",
    "Gallego: Number one, Yes, he could win.",
    "I think that’s actually the real thing.",
    "It’s just like she cares about herself.",
    "Lizza: You thought he could win?",
    "She’s not going to help Mark.",
    "So look, I wish she would.",
    "She’s all about herself.",
    "What did you see in him?",
    "It’s all about herself.",
    "It’s not her nature.",
    "I’m a professional.",
    "Lizza: Oh really?",
    "Lizza: Alright.",
    "Doing events?",
    "Gallego: No.",
    "Gallego: No."
  ]
}