{
  "id": 5125,
  "mediaId": 2548,
  "date": "2022-04-22",
  "headline": "Rep. Ruben Gallego Trashes Sen. Sinema, Says ‘She’s All About Herself’",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/04/gallego-sinema-e1650642121739.jpg",
  "link": "https://dailycaller.com/2022/04/22/ruben-gallego-kyrsten-sinema-arizona-selfish-primary-challenge/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Ginsberg",
  "authorUrl": "https://dailycaller.com/author/michael.b.ginsberg1998@gmail.com",
  "termIds": [
    5879,
    2459,
    3361,
    2753,
    1489,
    1477,
    1126,
    330,
    392,
    5949
  ],
  "sentences": [
    "She doesn’t care about working-class people.”\nListen to that and much more in this week’s unmissable Deep Dive podcast interview: https://t.co/Bw5mBA7LkA\n— POLITICO Playbook (@playbookdc) April 22, 2022\nGallego went on to accuse Sinema of not caring about other Democrats or her constituents, as evidenced by her lack of appearances on the campaign trail for Kelly or gubernatorial candidate Katie Hobbs.",
    "We’re going to have a blowout fight all the way up into the primary, and the most likely thing is that whoever won that primary was going to lose that general because we’re going to fight each other.”\nRUBEN GALLEGO on KYRSTEN SINEMA: “It’s just like she cares about herself.",
    "(RELATED: ‘I Think She’s A C*nt’: Ex-Obama Aide Goes On Expletive-Filled Rant Against Kyrsten Sinema)\nAlong with West Virginia Sen. Joe Manchin, Sinema is one of only two Democratic senators to oppose eliminating the filibuster.",
    "Sinema has faced harsh criticism from members of the Democratic Party over her opposition to the Build Back Better social spending package, and her perceived refusal to negotiate on legislative specifics.",
    "Democratic Arizona Rep. Ruben Gallego called out fellow Arizona Sen. Kyrsten Sinema in a Friday interview, accusing the moderate of being selfish and not supportive toward other members of their party.",
    "He told Politico’s Ryan Lizza that he has not yet made a final decision about the challenge, and revealed that he considered primarying Arizona’s other senator, Mark Kelly, in both 2018 and 2020.",
    "A Morning Consult poll conducted in January found that 44% of Arizonans approved of Sinema’s performance as senator, with 42% disapproving and 14% having no opinion.",
    "Gallego, a member of the Congressional Progressive Caucus, is seemingly considering challenging Sinema in a primary when she runs for re-election in 2024.",
    "On several occasions, she has been publicly targeted by left-wing activist, including some who followed her into a bathroom at Arizona State University.",
    "Several activists have suggested that she is racist for refusing to eliminate the filibuster to pass an elections nationalization package.",
    "I think she understands Arizona from a perspective many years ago, but she actually doesn’t understand Arizona like what’s happening.",
    "She’s running based on past elections, but she isn’t involved to see what’s happening here,” Gallego continued.",
    "In 2018, in 2020, I thought for a long time about running against [Mark] Kelly,” Gallego continued.",
    "Notably, 55% of Republicans approved of Sinema’s performance, compared to only 43% of Democrats.",
    "Politicians don’t decide this on their own vanity,” he said of a primary challenge.",
    "“I’m not going to do something that’s going to harm the Democratic Party.",
    "“At the end of the day, I realized that two things are going to happen.",
    "“She doesn’t do that,” he said of Sinema’s campaign appearances.",
    "She’s not going to help Katie Hobbs or whoever the Democrat is.",
    "It’s all about herself.”\n“She doesn’t understand Arizona.",
    "“I think the decision is going to be made by Arizonans.",
    "She doesn’t care about the Democratic movement.",
    "I think that’s actually the real thing.",
    "She’s not going to help Mark.",
    "“She’s all about herself."
  ]
}