{
  "id": 5386,
  "mediaId": 2664,
  "date": "2022-04-12",
  "headline": "Trump allies secretly pushed DHS to help change the results of the 2020 election: report",
  "image": "https://www.rawstory.com/media-library/white-house-shuts-down-press-availability-after-trump-tweet-admits-collusion.jpg?id=24723452&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/mark-finchem-trump/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    5207,
    4470,
    3037,
    2765,
    2246,
    2391,
    362,
    1441,
    5949
  ],
  "sentences": [
    "Waldron reportedly originated the strategy to have the Defense Department seize voting machines, and he also distributed a PowerPoint presentation urging Trump to declare a state of emergency\n“It’s concerning that someone like Phil Waldron had this degree of access to DHS officials even while he and other Trump allies were pursuing dangerous schemes to reverse the election,” said American Oversight spokesperson Dera Silvestre.",
    "The newly released emails show that top CISA officials reviewed Finchem's request, which was sent through a standard online form, six days after the Oval Office meeting, and the request made its way up the chain of command over the following days and an employee whose name was redacted noted the agency conducted fact-finding on the issue with Arizona's secretary of state Katie Hobbs and the state election director.",
    "Trump met in the Oval Office on Dec. 18, 2020, with supporters, including Giuliani, Sidney Powell and Michael Flynn, to discuss extreme measures -- such as an executive order to have the Department of Defense seize voting machines -- to change the election outcome, and Finchem's outreach to CISA appears to have originated around that time.",
    "Finchem specifically asked for help probing voting machines from CISA's Hunt and Incidence Response Teams, a term that's not widely used outside the cybersecurity world, and he asked for a company known as CyTech, which he believed was connected to Raytheon Technologies, examine the voting equipment using their CyFIR technology.",
    "Arizona state Rep. Mark Finchem asked the Department of Homeland Security to conduct “a full spectrum forensic examination” of voting machines\" in the final weeks of the Trump presidency, and he got the attention of the department's acting director of the Cybersecurity and Infrastructure Security Agency, reported Politico.",
    "Politico reviewed the emails obtained by the watchdog group American Oversight through a Freedom of Information Act lawsuit and showing attempts by Trump lawyer Rudy Giuliani and outside allies like Finchem to reverse the former president's election loss, and some of those individuals remain active in government roles.",
    "“It’s even more concerning that we’re only now finding out about it, over a year later.”\nNOW WATCH: Russian state TV floats 'revenge plan' against America that hinges on making Trump president again\nRussian state TV floats 'revenge plan' against America that hinges on making Trump president again",
    "A Donald Trump ally who's running to oversee Arizona's elections played a key role in the effort to overturn the 2020 presidential election, and he was joined in those efforts by a fringe figure who was in constant contact with White House chief of staff Mark Meadows, according to a new report.",
    "CyTech, CyFIR and their former owner Ben Cotton eventually did play a role in the effort to overturn Trump's election loss when they were hired by Cyber Ninjas to examine voting machines in Maricopa County, Arizona, in an audit ordered by the Republican-led state Senate.",
    "Another email obtained by American Oversight appears to show another Trump ally, which the watchdog believes to be Flynn associate Phil Waldron, directly contacted Chad Mizelle, DHS’ acting general counsel, on Dec. 21, 2020, to request a collaboration.",
    "“We need to do a call on this today,” wrote acting director Brandon Wales minutes after receiving the request from Finchem, early on the morning of Christmas Eve 2020.",
    "Cotton copied data from the county and drove with it to a lab in Montana, and he also gave a presentation when the final report was delivered to the state Senate.",
    "He sold CyFIR last year to eSentire and works for that company, which was aware of its role in the Arizona audit, as a vice president for incident response."
  ]
}