{
  "id": 652,
  "mediaId": 8251,
  "date": "2022-02-25",
  "headline": "Judge declines Katie Hobbs request to block AG threats",
  "image": "https://media.12news.com/assets/KPNX/images/c255a174-87d1-41bf-9676-7df9f6b551db/c255a174-87d1-41bf-9676-7df9f6b551db_1140x641.jpg",
  "link": "https://www.12news.com/article/news/local/arizona-judge-declines-katie-hobbs-request-to-block-ag-threats/75-b3378f7b-2221-4668-b6a8-712c0014df40",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Roopali Desai, a lawyer for Hobbs, said the secretary is stuck between two competing laws — one requiring her to maintain an online signature system and another mandating that signatures only be accepted from voters who qualify because they live in the candidate’s district.",
    "The GOP-controlled Legislature responded by stripping Hobbs of her authority to determine the state's position in election cases, even though she's the chief election official, though that provision was later blocked by the Arizona Supreme Court.",
    "A judge this week declined Secretary of State Katie Hobbs' request for an order blocking Arizona's attorney general from prosecuting her if she temporarily shuts down a candidate signature portal for a required update.",
    "Hobbs filed suit after Attorney General Mark Brnovich had one of his assistant attorneys general send Hobbs a letter implying she could face criminal prosecution if the “E-Qual” system is taken offline.",
    "A spokeswoman for Hobbs, Murphy Hebert, said she will continue with plans to shut down on March 11 the “E-Qual” system that candidates use to collect signatures they need to appear on the ballot.",
    "A shutdown is required because the statewide system is unusable once any one of the state’s 15 counties starts loading the new district maps from the every-10-years redistricting process.",
    "Brnovich entered a diversion agreement with the State Bar of Arizona that will result in the complaint being dismissed if he follows through with certain commitments.",
    "Candidates must collect a certain number of signatures from voters in order to make the ballot, and most are collected using the online system.",
    "In 2020, Hobbs filed a complaint with the state bar alleging Brnovich acted unethically in representing her and her office in election cases.",
    "The lawsuit is the latest legal skirmish between Brnovich, a Republican, and Hobbs, a Democrat, both of whom are seeking higher offices.",
    "Brnovich has not said what's required of him, but such agreements often involve additional training in legal ethics.",
    "Maricopa County Superior Court Judge Joan Sinclair said the request is “premature” in a ruling issued Wednesday.",
    "Catch up on the latest news and stories on the 12 News YouTube channel.",
    "PHOENIX — Editor's Note: The above video is from an earlier broadcast.",
    "Subscribe today."
  ]
}