{
  "id": 667,
  "mediaId": 8475,
  "date": "2022-02-21",
  "headline": "Bid to create Arizona lieutenant governor post clears Senate committee",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/022122_CapitolTowerMedium.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/022122_lieutenant_governor_bill/bid-create-arizona-lieutenant-governor-post-clears-senate-committee/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    0
  ],
  "sentences": [
    "The 2010 proposal would have created what Mesnard described as an “extremely convoluted” system in which candidates for governor and lieutenant governor run separately in the primary but were forced to run on a joint ticket in the general election, setting the stage for scenarios in which gubernatorial nominees may be saddled with running mates they don’t want.",
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nThough the secretary of state is an important position, with oversight of Arizona’s elections system and responsibility for business filings, they may not be cut out to be governor, Mesnard said.",
    "Local\nFor the eighth time in the dozen years since Arizonans last had an opportunity to consider such a proposal, lawmakers are trying to create a lieutenant governor position that would be first in the line of succession if the state’s chief executive vacates the office.",
    "To help lieutenant governors train for the possibility, Mesnard’s proposal would install them as the director of the Arizona Department of Administration, a vital agency that serves as the nerve center of state government.",
    "Since the last time voters had an opportunity to weigh in on the subject in 2010, lawmakers have proposed measures to create the position in seven of 11 legislative sessions, not counting the current session.",
    "It would create a system in which candidates for governor and lieutenant governor run together on a joint ticket, similar to the way candidates for president and vice president run together.",
    "With a lieutenant governor, voters would be able to see who the candidates selected as their successors and would be able to judge whether they’re fit to hold the office, if need be.",
    "In some years, including 2021, it’s come close, passing out of one chamber and getting out of committee in the next, only to die quietly without a floor vote in the second chamber.",
    "Doug Ducey noted in January, he’s the first governor in 36 years to give an eighth State of the State address because so many of his predecessors have left office early.",
    "“Let’s say the lieutenant governor poorly manages the ADOA or people are not happy with it, what is the recourse?” said Sen. Warren Petersen, a Gilbert Republican.",
    "Several members of the committee were supportive of the idea, but worried that the lieutenant governor might not be qualified to run such an important agency.",
    "Mesnard has been trying to create a lieutenant governor post for years, and this year’s push marks his sixth attempt since joining the legislature in 2011.",
    "The secretary of state is instead first in the line of succession, which has been triggered a surprisingly high number of times over the past few decades.",
    "Only twice, in 1994 and 2010, have voters had the opportunity to create a lieutenant governor position, and both times they overwhelmingly rejected it.",
    "Sometimes, that change in administration comes with an unexpected change in which political party controls the governor’s office, Mesnard noted.",
    "And because independent candidates don’t have primary elections, any independent gubernatorial hopefuls wouldn’t actually have running mates.",
    "Republican Jan Brewer succeeded Democrat Janet Napolitano in 2009, while Democrat Rose Mofford took over for Republican Evan Mecham in 1988.",
    "Sen. Martin Quezada, D-Glendale, was also wary of automatically giving the lieutenant governor control of the Department of Administration.",
    "Having a lieutenant governor would ensure that Arizonans get the same party they voted for, even if the governor leaves office, he said.",
    "If both chambers of the legislature ultimately approve idea, it will go to the November ballot, where voters will decide its fate.",
    "And then if there is a vacancy in the governor’s office, the thinking is they would be ready to govern on day one,” Bowie said.",
    "If Ducey, a Republican, were to leave office early, he would be replaced by Democratic Secretary of State Katie Hobbs.",
    "All four of the committee’s Republicans and two of its three Democratic members voted in favor of the proposals.",
    "Prior to Ducey, five of Arizona’s last eight governors have inherited the office through the line of succession.",
    "Sen. Sean Bowie, D-Phoenix, spoke in support of Mesnard’s proposal, which he said shouldn’t be a partisan issue.",
    "Under the 1994 proposal, gubernatorial candidates would choose their running mates before the primary.",
    "Quezada said he’s gone back and forth over the issue throughout his time at the legislature.",
    "However, Mesnard said that doesn’t necessarily mean they’ll feel the same about his plan.",
    "Gubernatorial nominees would select their running mates after the primary election.",
    "The Senate Government Committee approved a pair of measures sponsored by Sen. J.D.",
    "“It’s a radical change from what the voters might have expected,” Mesnard said.",
    "At the same time, he’s not opposed to letting the voters decide the issue.",
    "He’s not convinced Arizona actually needs a lieutenant governor, he said.",
    "The quest for a lieutenant governor is a near-annual rite at the Capitol.",
    "Mesnard, R-Chandler, that would put the issue on the ballot in November.",
    "In some states, he said, lieutenant governors have no real job duties.",
    "“Largely the governor can then marginalize them,” Mesnard replied.",
    "Arizona is one of only a few states without a lieutenant governor.",
    "“I’m going to err on the side of giving voters the choice.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "“They actually have a day job to keep them busy.",
    "I just don’t see why we need it,” Quezada said.",
    "More than 65% of voters rejected that plan.",
    "In 2010, 59% of voters rejected the idea.",
    "Thanks for reading TucsonSentinel.com.",
    "And if voters want to pass it, great.",
    "As Gov.",
    "- 30 -",
    "."
  ]
}