{
  "id": 6974,
  "mediaId": 2514,
  "date": "2022-04-17",
  "headline": "Lawmakers worry 2020 will provide a blueprint for stealing a future election",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220426-donald-trump-mjf-1449-71185c.jpg",
  "link": "https://www.nbcnews.com/politics/elections/lawmakers-worry-2020-will-blueprint-stealing-future-election-rcna24568",
  "mediaOutlet": "AOL",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Dana Nessel, the Michigan attorney general, told NBC News: “If we don’t hold people accountable there is literally nothing to stop them from doing this again, because there will have been no repercussions for it.”\n(Republican officials, Trump allies and attorneys for some of the electors have said that they were looking to ensure that Trump votes would be counted in case he was eventually deemed the winner in those states).",
    "Kristi Noem, a Republican, told NBC News: “I couldn’t see the point in it other than that she was angry and bitter.”\nBut amid reports of a split within the House Jan. 6 panel over whether to make a direct case to Garland that he needs to target Trump, the members seem wholly unified when it comes to another point: There might well be another attempted coup in 2024, and Jan. 6 supplied the blueprint for pulling it off.",
    "“The idea was to try to negate and nullify the Electoral College votes by getting the vice president to proclaim these new powers and then to exercise those powers by asserting that there was controversy and uncertainty at the state level and a disputed Electoral College situation,” Rep. Jamie Raskin, D.-Md., a member of the Jan. 6 committee, told NBC News.",
    "Donald Trump supporters storm the Capitol following a \"Stop the Steal\" rally in Washington, D.C., on Jan. 6, 2021.Spencer Platt / Getty Images file\nMembers plan to hold public hearings that will lay out the evidence they’ve gathered and describe a multi-pronged effort to disenfranchise voters by handing the losing presidential candidate a second term.",
    "“The most important question is how do we ensure there is no political actor in Congress or state government that can elevate those fake electors into something that might actually get counted,” said Matthew Seligman, a Yale Law School fellow who has been advising Congress on how best to revamp the Electoral Count Act, according to a Senate aide.",
    "Rep. Liz Cheney, R-Wyo., said last weekend that her panel had compiled enough facts to refer Trump to the Justice Department for criminal prosecution, while U.S. District Judge David Carter wrote last month that Trump and others undertook “a coup in search of a legal theory.”\nNeither has the power to bring charges against the former president.",
    "“Until the Electoral Count Act is brought into full conformity with the framers’ design, every presidential election will take place in the shadow of the threat of possible attempts in the January 6 (congressional) joint session to reverse the outcome of the election,” Jacob told NBC News.",
    "A memo written by John Eastman, an attorney who was advising Trump at the time, spelled out several scenarios in which Vice President Mike Pence, presiding over the count, could recognize the rival slates of pro-Trump electors, triggering a chain of events that ended with Trump winning.",
    "“It appears one component of that was this notion of fake electors being sent from the states, so I think it’s an area that we have to reform, and we have very little time to do so.”\nWhat seems most likely to pass, if anything, are a few fixes for which there is a broad consensus.",
    "“There were a number of parties and nefarious actors back in 2020 that tried to weaponize the Electoral Count Act in ways that were deeply problematic,” Rep. Joe Neguse, D., Colo., who was a House prosecutor in Trump’s second impeachment trial, told NBC News.",
    "But to the extent that people watching from home are alarmed by what they learn, the hope is that it could pique Congress’ interest and give fresh incentive to rewrite the 19th- century law that controls the process used to tabulate presidential elections.",
    "Both a federal judge and the top Republican on the House committee investigating the Jan. 6 riot have now reached the same stark conclusion: There is evidence to suggest Donald Trump’s effort to overturn the 2020 election could be a crime.",
    "“A lot of what we saw in 2020 and the aftermath of the election was testing the waters to see where there are weaknesses in the system of laws that govern us,” Arizona’s Secretary of State, Katie Hobbs, a Democrat, told NBC News.",
    "But I really think this could all backfire badly unless we have legislatures submitting (T)rump slates (based on a conclusion this was the proper result under states law).” The committee did not comment on the text messages.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nMiller’s appearance before the committee presumably gave members a chance to probe how the Trump forces believed Biden’s victory could be undone.",
    "After watching 2020 unfold, some elected officials and election experts fear the Electoral Count Act could be exploited in ways that might give Trump or someone else a victory in 2024, whether they win enough votes or not.",
    "Lawmakers may also raise the threshold so that it takes more than a single member of the House and Senate to object to a state’s electoral votes and thus delay the formal certification of the incoming president’s victory.",
    "Lee Lonsberry, a spokesperson for Lee, said: \"The text messages tell the same story Sen. Lee told from the floor of the Senate the day he voted to certify the election results of each and every state in the nation.\"",
    "In a series of text messages published Friday by CNN, Sen. Mike Lee, R-Utah, wrote to White House chief of staff Mark Meadows three days before the insurrection: “I’d love to be proven wrong about my concerns.",
    "On Thursday, the committee heard eight hours of testimony from Stephen Miller, a top Trump White House adviser, who talked publicly about the alternate electors in December on the day they were gathering.",
    "Congress may clarify that the vice president plays merely a ceremonial role when it’s time to count the electoral votes and cannot, as Trump argued, unilaterally reject the outcome in certain states.",
    "New texts show GOP lawmakers’ attempts to overturn 2020 election\nApril 15, 202206:55\nTrump denies any wrongdoing, and his allies contend that Cheney has lost credibility as any sort of fair broker.",
    "He balked at the strategy Eastman laid out in his memo and traded heated messages with him when the Capitol was overrun, according to emails released by the committee in a court filing last month.",
    "Donald Trump supporters storm the Capitol in Washington D.C., on Jan. 6, 2021.Brent Stirton / Getty Images file\nCongress is trying to strengthen the law, though with little to show for its work.",
    "One of the two sets of pro-Trump alternate electors purporting to represent Arizona used the official state seal in the documents forwarded to Washington, giving them a patina of legitimacy.",
    "“Our focus is showing the country how close we came to losing our democracy, and why we’re not out of the woods,” Rep. Adam Schiff, D-Calif., a member of the House committee, told NBC News.",
    "Dozens of people from five swing states that President Joe Biden won signed documents purporting to be “duly elected and qualified” electors and declaring that Trump was the victor.",
    "(In two other states, New Mexico and Pennsylvania, the documents included caveats saying their legitimacy depended on whether Trump was ultimately found to be the winner).",
    "“It’s important to understand how they essentially got recruited to do this,” Rep. Elaine Luria, D-Va., who serves on the Jan. 6 panel, said of the alternate electors.",
    "Hector Balderas, the attorney general in New Mexico, said he is part of a task force investigating the alternate electors along with his counterparts in other states.",
    "That’s up to Attorney General Merrick Garland, whose focus to date has largely been on the people who stormed the Capitol in a violent effort to keep Trump in power.",
    "… Where did the direction come from — to go out to the states, find these people, and get them to sign their names?”\nState officials are also trying to get answers.",
    "Greg Jacob, former legal counsel to Pence, was with him in the Capitol on Jan. 6 when rioters stormed the building and called for the vice president to be hanged.",
    "If there is no “accountability and tightening up of these laws, we are at risk of these things happening again,” added Hobbs, who is now running for governor.",
    "One solution that election experts have proposed is giving the courts the final say if there’s any dispute about which slate of electors should be counted.",
    "“And, unfortunately, that’s exactly what the law permits.”\nWhether the law gets changed in time for the next presidential election is by no means certain.",
    "“There was not.”\nEven stalwart Trump supporters in Congress were leery of relying on alternate electors whose candidate — Trump — didn’t actually win.",
    "For much of the past year, Democratic lawmakers who control both houses focused instead on broader election reform aimed at expanding voting rights.",
    "A danger is that more groups may come forward in the future and misrepresent themselves as the actual electors when in fact their candidate lost.",
    "That way, in an era of extreme partisanship, members of Congress and governors aren’t the ones settling disputes about who gets to be president.",
    "Senate Democratic leader Chuck Schumer has at times portrayed the parallel effort to revise the Electoral Count Act as an unwanted distraction.",
    "Committee aides have also flown to Arizona and spoken to Hobbs about other efforts to “change the results” in her state, she said.",
    "One focus of the Jan. 6 panel is alternate, or what critics call “fake,” electors, who surfaced in the last presidential election.",
    "Both the Jan. 6 committee and the Justice Department are examining how these slates of Trump electors came into being.",
    "All of which suggests an urgent need to overhaul the Electoral Count Act, some lawmakers and former officials said.",
    "Sen. Jeanne Shaheen, D-N.H., is part of a bipartisan group of senators working to revamp the Electoral Count Act.",
    "The slates were sent to Washington, where Trump loyalists prepared to use them to his advantage.",
    "That fear is helping to shape the committee's plans for hearings, slated to start next month.",
    "“It’s not clear” that the negotiations will result in passage of a bill, she told NBC News.",
    "There is no guarantee that a bogus set of electors would be thrown out in later elections.",
    "“First of all, the group that has been working on it has to come to some agreement.",
    "The committee’s main audience will be the general public; another is Garland.",
    "“Whether we can get agreement on how to address it remains to be seen.”",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Pointing to Cheney’s persistent criticism of Trump, South Dakota Gov.",
    "And then we have to get agreement from the leadership on both sides.",
    "“I do see it as a problem,” Shaheen said of the alternate electors.",
    "To Trump’s dismay, Pence didn’t go along.",
    "He wound up certifying Biden’s victory.",
    "No laws even need be broken.",
    "That initiative collapsed.",
    "“Were they recruited?",
    "Were they pressured?"
  ]
}