{
  "id": 7529,
  "mediaId": 8428,
  "date": "2022-04-08",
  "headline": "Trump holds fundraiser for Kari Lake at Mar-a-Lago",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/04/tk.png",
  "link": "https://www.rsbnetwork.com/news/trump-holds-fundraiser-for-kari-lake-at-mar-a-lago/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Summer Lane",
  "authorUrl": "https://www.rsbnetwork.com/author/summer-lane/",
  "termIds": [
    2706,
    3545,
    3715,
    2765,
    4905,
    4669,
    1138,
    748,
    1126,
    5949,
    6292
  ],
  "sentences": [
    "President Trump took the podium to stump for Lake, telling the audience, “Kari Lake will be the greatest Governor in our country’s history.”\nIn September 2021, President Trump strongly endorsed Kari Lake as a candidate in her race for governor of Arizona, calling her a “fantastic person” who will fight for the values of the MAGA movement.",
    "Lake has also vowed to finish Trump’s border wall in Arizona, which remains a popular campaign promise as the crisis at the southern border continues to escalate under the leadership of the Biden administration.",
    "In a poll released on Thursday, Lake was reported as “out-polling” every Republican and Democrat gubernatorial candidate in the Grand Canyon State, leaving Democrat opponent Katie Hobbs in the dust.",
    "The event, attended by many conservative figures like Larry Elder and even RSBN’s own Brian Glenn, included speakers like MyPillow CEO Mike Lindell and former Trump adviser Kimberly Guilfoyle.",
    "President Donald J. Trump held a fundraiser for Republican gubernatorial candidate Kari Lake on Thursday in Mar-a-Lago to supercharge her campaign in Arizona.",
    "For example, on Monday, Lake called for the decertification of both Wisconsin and Arizona due to recently-uncovered evidence of voter fraud.",
    "Lake has been very popular with potential Arizona voters due to her strong stances on issues like immigration and election integrity.",
    "Lake also easily qualified for the August primary ballot in March, netting double the signatures required to qualify.",
    "“It only took us three weeks to get enough signatures – record time!” Lake posted on Twitter.",
    "And Arizona,” she stated on Twitter.",
    "“Our movement cannot be stopped.”",
    "“Decertify Wisconsin now."
  ]
}