{
  "id": 8010,
  "mediaId": 2662,
  "date": "2022-04-08",
  "headline": "Justice Michael Gableman Joins War Room Discusses the Zuckerbucks Infiltration of the 2020 Election and Tianna Epps-Johnson from the CTCL",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/justice-michael-gableman.jpg",
  "link": "https://www.thegatewaypundit.com/2022/04/justice-michael-gableman-joins-war-room-discusses-zuckerbucks-infiltration-2020-election-tianna-epps-johnson-ctcl/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/jim-hoft/",
  "termIds": [
    0
  ],
  "sentences": [
    "They are:\nElizabeth Goitein, Co-Director, Liberty and National Security Program, Brennan Center for Justice at NYU School of Law\nLawrence Norden, Director, Election Reform Program, Brennan Center for Justice at NYU School of Law\nWendy Weiser, Vice President and Director, Democracy Program, Brennan Center for Justice at NYU School of Law\nHoward signed the April 13 letter to President Fann, along with Ryan Macias, Mark Lindeman of Verified Voting and Paige Alexander of The Carter Center and the April 22 letter again to President Fann, along with 19 other nonprofits, computer scientists and, again, Ryan Macias.",
    "Macias certified Arizona’s voting machines“\nJennifer Morrell, “an election consultant with Protect Democracy”\nLiz Howard, “an attorney with the Brennan Center for Justice”\nAccording to the membership list of this Task Force, Ryan Macias is listed as “Ryan Macias, Former Acting Director of Testing and Certification, U.S. Election Assistance Commission.”\nJennifer Morrell is listed as a member, not as an affiliate of Protect Democracy, but as a “Partner, Elections Group.”\nLiz Howard is not listed as a member of the Task Force, however, three of her associates at the Brennan Center are.",
    "Incredibly, there is one very important director of a nonprofit who is a member of this Task Force who should be explicitly named: Tiana Epps-Johnson, an Obama Foundation Fellow and the executive director of the Center for technology and Civic Life (CTCL), the bagman nonprofit for the roughly $ .5 billion (that we know of) in Zuckerbucks distributed all across the U.S. last year, especially to swing states including Arizona, Georgia, Michigan, Nevada, Pennsylvania, and Wisconsin.",
    "Protect Democracy’s staff supports the work of the Task Force, and in doing so has drawn on assistance from Jenner & Block, the Institute for Constitutional Advocacy and Protection at Georgetown Law, the Democracy & Rule of Law Clinic at Harvard Law School, and the William & Mary Election Law Society.“\nJ. Christian Adams had this to say about this Task Force in an April 30, 2020 article in PJMedia:\nOne Potemkin outfit is the self-styled National Task Force on Election Crises.",
    "The 45+ person membership of the National Task Force on Election Crises includes no fewer than three representatives of the Brennan Center, as noted, a senior advisor with Verified Voting, Pamela Smith, The Carter Center, and such nonprofit giants in the Democratic “election integrity” field as the League of Women Voters, Common Cause and All Voting is Local – a project of the LCCHR’s Education Fund.",
    "Baker describes himself as ” Director of National Security and Cybersecurity, R Street Institute; Former FBI General Counsel.”\nThe mission of the task force is:\nThe mission of the nonpartisan National Task Force on Election Crises is to ensure a free and fair 2020 general election by recommending responses to a range of potential election crises.",
    "Ryan Macias’ LLC has a motto: “Resiliency in the election infrastructure = Securing election technology + Mitigating risk to the democratic process.“\nIt looks like Macias and other members of the National Task Force on Election Crises have inserted themselves into the Maricopa Audit process in an attempt to shut it down.",
    "Therefore, ALL of Secretary of State Hobbs’ observers to the Arizona Senate’s forensic audit – 100% of them – not only have connections to these recent nonprofit threat letters, but they are also all affiliated with the National Task Force on Election Crises, with two of them being actually listed as members.",
    "During their conversation, Gableman brought up Tianna Epps-Johnson an Obama Foundation Fellow, and the executive director of the Center for technology and Civic Life (CTCL), the bagman nonprofit for the roughly $ .5 billion (that we know of) in Zuckerbucks distributed all across the U.S. last year.",
    "Hobbs lobbed this task force into this forensic audit process – the first one of its kind in the history of our country – and for that, given her position as Chief Election Official for the state of Arizona, she should resign immediately or be recalled.",
    "Go ahead have a look at the membership list of this ultra-secretive, covert operation, a quiet little “Task Force” hidden deep within the operations of a 501(c)(3) charitable, tax-exempt, “nonpartisan” nonprofit called the Protect Democracy Project.",
    "Ryan Macias now needs to disclose to the President of the Arizona Senate, Karen Fann, and to the people of Maricopa County and Arizona, his role with James Baker’s and the Protect Democracy Project’s covert National Task Force on Election Crises.",
    "There is something very troubling in that almost all of the nonprofit players in the Democrat Party’s efforts to end the Maricopa County, Arizona audit have ties to an entity no one has ever heard of, the National Task Force on Election Crises.",
    "Well, this RSM Election Solutions owner, Ryan Macias lied once, that we know of – he pretended he was a reporter – so lying, being disingenuous, making stuff up on the fly, hiding his background, when asked, appear to come easy to this guy.",
    "It is designed to appear bipartisan but in action, it is the opposite…\n…Not only does this largely leftist task force represent phony bipartisanship, but it also uses that misleading brand to place hit-and-run pieces in conservative media.",
    "Except on this Task Force Macias’ affiliation is listed as “ Former Acting Director of Testing and Certification, U.S. Election Assistance Commission.”\nRyan Macias revealed his true colors by being a member of this ‘task force’.",
    "Secretary of State Katie Hobbs’ three observers reported recently according to UncoverDC, are:\nRyan Macias, “the former acting director of certification and testing for the U.S. election assistance commission.",
    "In reality, the group is the usual collection of far-left race activists, liberal law professors, vendor grifters sprinkled in with one or two non-crazies to give the organization a whiff of not-entirely-nuts.",
    "These nonprofits – the Protect Democracy Project from D.C. and the Brennan Center from NYC – are not even from Arizona yet people affiliated with them are being utilized to take down an Arizona county audit!",
    "TRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nThe Gateway Pundit reported on Tianna Epps-Johnson and the CTCL earlier.",
    "He reserved the other affiliation, the RSM Election Solutions LLC one, for the two letters sent, respectively, to the four audit teams and the president of the Arizona Senate, Karen Fann.",
    "There are no listed members from the Protect Democracy Project on the Task Force simply because:\n“The Task Force was convened by Protect Democracy, a nonpartisan nonprofit organization.",
    "The people of Maricopa County and Arizona who fought so hard for this audit deserve so much better than this partisan Democrat hack pretending to be an impartial Secretary of State.",
    "She obeyed orders from on high and used weaponized nonprofits blessed by both the national Democratic machine and by this partisan National Task Force on Election Crises.",
    "Shut down any efforts to perform an unbiased audit of the 2020 election and come up with an accurate count of results based on the audit findings.",
    "This National Task Force on Election Integrity is all over the left-wing efforts to stop the audit in Maricopa County currently going on.",
    "Former Wisconsin Justice Michael Gableman, the Wisconsin Special Counsel, went on with Steve Bannon oon The War Room Thursday afternoon.",
    "There are, notably, two media representatives, a former associate editor of the Washington Post and a director of R&D, Jigsaw (Google).",
    "HUGE: Maricopa County Was Given $3 Million of ‘Zuckerbucks’ Before Election But No One Knows Who Received It and What It Was Used For!",
    "This group appears to be chaired by none other than James Baker, Former FBI General Counsel to the disgraced FBI Director James Comey.",
    "As more and more information is discovered and released on the planning and coordination of the great election theft of 2020.",
    "This appears to be the real purpose of this Task Force, hidden deep inside of the Protect Democracy Project’s operations.",
    "Among all the members of this covert operation, the National Task Force on Election Crises, whose name do we see?",
    "They’re small potatoes compared to a national Task Force with Jim Baker on it.",
    "We see that Trojan Horse, RSM Election Solutions’ owner, Ryan Macias.",
    "Maricopa County itself alone received $3 million in Zuckerbucks.",
    "This information comes from a previous Gateway Pundit report.",
    "This is why they are in Maricopa County, Arizona.",
    "Did Hobbs vet her three observer candidates?",
    "Who pushed the individuals’ names her way?",
    "How did she even come upon their names?"
  ]
}