{
  "id": 8217,
  "mediaId": 8350,
  "date": "2022-04-08",
  "headline": "AG Brnovich won’t say if widespread voter fraud found, cites ongoing investigation",
  "image": "https://ktar.com/wp-content/uploads/2021/09/mark-brnovich-mcso-fb.jpg",
  "link": "https://ktar.com/story/4996676/ag-brnovich-wont-say-if-widespread-voter-fraud-found-cites-ongoing-investigation/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KEVIN STONE",
  "authorUrl": "https://ktar.com/story/author/kstone/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Well, no prosecutor worth his salt would even publish this interim report that is simply meant to stoke fear.”\nThe Republican Party of Arizona reacted to the report Wednesday by tweeting that Brnovich “determined widespread FRAUD in the Maricopa County 2020 election,” something the attorney general would not confirm Friday.",
    "Multiple audits, reviews and lawsuits have failed to produce evidence of widespread fraud in Maricopa County’s 2020 election, but supporters of former President Donald Trump, who lost narrowly to President Joe Biden in Arizona, have continued to question the validity of the results.",
    "… I assure you that I will not leave a mess for the next attorney general, and I’m going do everything I can to make sure that everyone that goes into the voter booth in 2022, whether Republican or Democrat, has confidence in the process,” said Brnovich, who joined Republican Gov.",
    "In a later interview with The Mike Broomhead Show, Maricopa County Recorder Stephen Richer, a Republican who has staunchly defended the integrity of the 2020 election, which occurred before he took office, questioned Brnovich’s motives and explanation.",
    "“I know there’s folks that may be uncomfortable discussing these issues, but I think these are issues that need to be raised, need to be discussed, so everyone can have confidence in elections as we go forward,” Brnovich said.",
    "“And we still have an ongoing investigation.”\nOn Wednesday, Brnovich issued an interim report to state Senate President Karen Fann, a fellow Republican, on his office’s investigation into Maricopa County’s 2020 election.",
    "“I will just tell you that no prosecutor worth their salt is going to reach a conclusion before they have evaluated all the facts and evidence,” Brnovich told KTAR News 92.3 FM’s The Mike Broomhead Show.",
    "“He said no prosecutor worth his salt would reach conclusions based on an interim report,” said Richer, who unseated the Democrat who oversaw the 2020 election in the state’s largest county.",
    "PHOENIX – Arizona Attorney General Mark Brnovich said Friday he can’t say if his office has uncovered evidence of widespread fraud in the 2020 election because the investigation is ongoing.",
    "The contractors’ hand recount, one part of the review, affirmed President Joe Biden’s victory with numbers close to the ones certified in November by state officials, including Brnovich.",
    "The AG Office’s Election Integrity Unit launched the current investigation after receiving reports from the Senate about last year’s controversial election audit led by Cyber Ninjas.",
    "… If he had concerns about the election, then why did the last time he saw me say we’re still both dealing with the same nonsense and craziness,” Richer said.",
    "The EIU is also reviewing other “complaints alleging election failures and potential misconduct that occurred in 2020,” according to the interim report.",
    "Richer said he agreed with some of Brnovich’s suggestions for improving the election process but disagreed with the attorney general’s methods.",
    "“It’s just, you know, I think something’s changed in the world of Mark Brnovich, and I don’t think it’s the facts about the 2020 election.”",
    "Doug Ducey and Democratic Secretary of State Katie Hobbs weeks after the Nov. 3, 2020, election to officially certify the results.",
    "The attorney general’s 12-page report to Fann details concerns and potential vulnerabilities in Maricopa County’s 2020 election.",
    "Brnovich, who is running for U.S. Senate this year, said Friday that the final report would be produced before the midterms.",
    "“I think it’s important to have certainty with our elections as we go into the next cycle.",
    "“If he had concerns about the 2020 election, then why did he certify the election?",
    "“I will let other people draw their own conclusions,” Brnovich said.",
    "The primaries are Aug. 2 and the general is Nov. 8."
  ]
}