{
  "id": 8538,
  "mediaId": 2730,
  "date": "2022-04-08",
  "headline": "Alabama Lawmakers Advance Florida-Style Parental Rights Bill",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/172/6b271620-baa5-4e12-b3db-16895d20a449.jpg",
  "link": "https://townhall.com/tipsheet/madelineleesman/2022/04/08/alabama-lawmakers-advance-florida-style-parental-rights-bill-n2605640",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Leesman",
  "authorUrl": "https://townhall.com/tipsheet/madelineleesman/",
  "termIds": [
    0
  ],
  "sentences": [
    "The other piece of legislation, SB 184, the Vulnerable Child Protection Act, states that any person who provides “gender-affirming” healthcare, which includes hormone therapy treatment, sex reassignment surgery, and puberty blockers, could be convicted of a felony and sentenced to prison for 10 years and a $15,000 fine.",
    "The reason is simple, and common sense – this is a decision that will dramatically affect the rest of an individual’s life, including the ability of that individual to become a biological parent later in life,” Ducey wrote in a letter to Arizona Secretary of State Katie Hobbs.",
    "Greg Abbott after a “non binding” opinion by Texas Attorney General Ken Paxton that said parents who provide their minor children with puberty-suppressing drugs or other “gender-affirming” treatments could be investigated for child abuse.",
    "“Throughout law, children are protected from making irreversible decisions, including buying certain products or participating in activities that can have lifelong health implications,” Ducey added.",
    "Source: AP Photo/Mary Altaffer, File\nThe Alabama legislature passed two bills centered on transgender minors this week, one of which mirrors Florida’s Parental Rights in Education law.",
    "Senate Bill 1138 states that “a physician or other health care professional may not provide gender transition procedures to any individual under eighteen years of age.\"",
    "Sponsors of the bill say it protects children from life-altering decisions that mutilate their bodies and affects their ability to have children of their own one day.",
    "Alabama Republican state Sen. Shay Shelnutt, the bill’s sponsor, called gender-affirming health care \"child abuse,” according to ABC News.",
    "One of the bills, HB 322, prohibits transgender students from using bathroom and locker rooms that are opposite their biological sex.",
    "Doug Ducey signed a series of bills late last month limiting abortion and protecting minors from “gender-affirming” health care.",
    "Florida’s law prohibits teachers from teaching kindergarten through third graders about sexuality and gender identity.",
    "In addition, lawmakers in Idaho are also pushing legislation eliminating “gender-affirming” health care for minors.",
    "Last month, Texas began investigating the parents of transgender minors for child abuse, as Townhall followed.",
    "Democratic Texas Judge Amy Clark Meachum in Travis County, Texas halted the investigations soon after.",
    "In addition, the bill limits LGBT content in classrooms, which was added to the bill last-minute.",
    "This is just to protect children,\" Shelnutt said on the state Senate floor in February.",
    "This week, Landon covered how two state lawmakers in Ohio introduced a similar bill.",
    "We don’t want to make that an option, because that’s what it is; it’s child abuse.",
    "1138 delays and irreversible gender reassignment surgery until the age of 18.",
    "“These decisions should be made when an individual reaches adulthood.”",
    "\"We don’t want parents to be abusing their children.",
    "The investigations were launched by GOP Gov.",
    "In Arizona, GOP Gov.",
    "“S.B."
  ]
}