{
  "id": 8685,
  "mediaId": 2784,
  "date": "2022-04-07",
  "headline": "Arizona Governor Candidate Katie Hobbs Supports Killing Babies in Abortions Up to Birth",
  "image": "https://www.lifenews.com/wp-content/uploads/2022/04/katiehobbs.jpg",
  "link": "https://www.lifenews.com/2022/04/07/arizona-governor-candidate-katie-hobbs-supports-killing-babies-in-abortions-up-to-birth/",
  "mediaOutlet": "LifeNews",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4623,
    392,
    244,
    5949
  ],
  "sentences": [
    "When the host pressed Hobbs to answer whether she could draw the line on legalizing abortion at 15 weeks or 24 weeks, Hobbs deflected, calling abortion a “personal decision.”\n“Abortion is a personal decision between a woman and her family and her doctor.",
    "Please follow us for the latest pro-life news\nHobbs said that giving medical care to an infant who survived an attempted abortion was “cruel” and argued that resuscitation “can actually harm the infant,” according to a 2017 AZ Central report.",
    "“So, if I’m elected governor, that’s what folks are getting.”\n“I will work with the legislature that’s in place to ensure that women have continued access to reproductive healthcare,” she added.",
    "“A 15-week limit on abortion would not only save lives, it would protect women from the emotional and physical harms of later term abortion.”\nLifeNews Note: Mary Rooke writes for Daily Caller.",
    "Democratic Arizona gubernatorial candidate Katie Hobbs refused to answer Sunday whether abortions conducted in Arizona should have a time limit based on the baby’s gestational age.",
    "During the 2017 legislative session, she voted against SB 1367, requiring abortion providers to give medical care to infants who survived the abortion process and were born alive.",
    "Hobbs has been consistent in her pro-abortion stance, including voting against a 2012 bill, The Mother’s Health and Safety Act, which prohibited abortions after 20 weeks.",
    "Hobbs dodged a question by a local CBS host asking if she would support any limits on abortions performed after 15 weeks, according to a Sunday evening interview.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "“Preborn babies at 15 weeks gestation have fully formed noses, eyelids, and lips, as well as developing hearts, kidneys, and other organs.",
    "Center for Arizona Policy President Cathi Herrod told LifeNews that this bill would give protection to babies who need it.",
    "And that’s something that needs to be discussed in the medical exam room, not by politicians,” she responded.",
    "She also voted against the 2011 bill HB 2443, banning abortions based on the sex or race of the infant.",
    "I’ve been very clear on my position on that throughout my time in the legislature,” Hobbs responded.",
    "While Hobbs was in the state Senate, she continued to vote against pro-life legislation.",
    "30, making it illegal to perform an abortion after the infant reaches 15 weeks.",
    "Today, those babies are one step closer to protection,” Herrod told the outlet.",
    "“Well, women deserve access to abortion care.",
    "They suck their thumbs, and they feel pain.",
    "Doug Ducey signed SB 1164 into law on Mar.",
    "Republican Arizona Gov.",
    "Abortion is healthcare.",
    "LifeNews is on GETTR."
  ]
}