{
  "id": 9111,
  "mediaId": 2664,
  "date": "2022-03-24",
  "headline": "Trump's 'Big Lie' demolished again as new audit of Arizona vote shows no fraud: report",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=25146311&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/arizona-election-audit-2657027527/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    4905,
    2765,
    84,
    334,
    1489,
    749,
    5949,
    6360
  ],
  "sentences": [
    "\"Maricopa County Board of Supervisors chairman Bill Gates said in a written statement that the report should be 'a final stake in the heart of the Senate’s so-called ‘audit,’' pointing out that it concluded the ballot tabulation system was not connected to the internet and that county routers were not connected to the election tabulation system,\" continued the report.",
    "On Thursday, the Arizona Capitol Times reported that yet another audit of the Maricopa County election process ordered by the GOP-controlled Arizona State Senate has concluded — showing, as the others have, no signs of any misconduct in the 2020 presidential election, which President Joe Biden won by just over 10,000 votes.",
    "Despite all of this, and despite Republican officials in Maricopa County agreeing the election was conducted fairly, Trump allies running for office in Arizona have continued to assert Democrats somehow stole the election, with gubernatorial candidate Kari Lake even calling for the arrest of Secretary of State Katie Hobbs.",
    "This operation was highly criticized for not following proper auditing procedures, lack of transparency to the press, and its investigation of conspiracy theories like searching for bamboo fibers in ballots to check if they were Asian forgeries.",
    "\"The report comes after the Arizona Senate and the county agreed in September 2021 that three independent computer security experts would review the county’s routers and answer the Senate’s questions in relation to the 2020 general election.",
    "The choice of Shadegg as special master was itself a controversial decision, as he was revealed to have attended a November 4 rally for former President Donald Trump where election conspiracy theories were promulgated.",
    "This comes after a much more high-profile partisan process, in which the Senate brought in a Florida security company, Cyber Ninjas, to \"audit\" all of the ballots in Maricopa County.",
    "\"Six months later, the findings, which were released late Wednesday, fall in line with the county’s own independent election audits conducted more than a year ago.\"",
    "Both parties agreed that former Congressman John Shadegg would act as an impartial 'special master' to oversee the process,\" reported Kyra Haas.",
    "Cyber Ninjas has subsequently shut down in the face of heavy contempt of court fines for refusing to turn over documents about its procedures.",
    "This investigation also turned up no signs of fraud and even purported to find extra uncounted votes for Biden.",
    "\"He also noted that one of the three independent experts was recommended by the Senate.\""
  ]
}