{
  "id": 9239,
  "mediaId": 2618,
  "date": "2022-03-30",
  "headline": "Biden planning to tap oil reserve to control gas prices",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/30/biden_planning_to_tap_oil_reserve_to_control_gas_prices_82324.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zeke Miller & Josh Boak",
  "authorUrl": "",
  "termIds": [
    2765,
    4905,
    4794,
    6569,
    6678
  ],
  "sentences": [
    "WASHINGTON—President Joe Biden is preparing to order the release of up to 1 million barrels of oil per day from the nation’s strategic petroleum reserve, according to two people familiar with the decision, in a bid to control energy prices that have spiked as the U.S. and allies have imposed steep sanctions on Russia over its invasion of UkraineThe announcement could come as soon as Thursday, when the White House says Biden is planning to deliver remarks on his administration’s plans to combat rising gas prices.",
    "The people spoke on the condition of anonymity\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Draini;g the strategic oil reserve is part of his plan, as is having the Federal Reserve, US Treasury and the Energy Department doing all they can to prevent banks from lending to oil and natural gas companies.",
    "Then, maybe we can ditch the installed WH occupants and put the Speaker of the GOP controlled House of Representatives in place to get the country back on track by putting America First.",
    "Tell them PDT filled the reserves when he was President because he managed to secure a great deal and knew the importance of having a good solid reserve supply if we needed it.",
    "So Republican leadership, do you have a serious comment on this or will you stand whining in a microphone which is your usual response and then add, we’ll get ‘em in November!",
    "Releasing the reserves means when they are depleted and we need them they won't be there and only electric tanks and warplanes will be left to fight with.",
    "He did it to protect America in the case of a worldwide embargo or other economic emergency to guarantee the American economy would continue to thrive.",
    "Perhaps Biden will keep another of his delusional campaign promises by putting oil company executives “in jail” for endangering the climate.",
    "His alleged 81 million voters should be quite happy that Biden is keeping his 2020 campaign promise “to get rid of fossil fuels”.",
    "Fraud Biden hates fossil fuel his dream is to see all of us using electric golf carts before he dies but, it won't ever happen.",
    "And in not appealing a bizarre ruling by a federal judge that climate change must be considered when issuing drilling permits.",
    "Just reinforce the fact that democrats have destroyed all the good we were experiencing under President Trump’s leadership.",
    "AOC and the squad have Joe's nuts in a green lock box he will not do the right thing and drill or open pipelines, never.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Point out that democrats are busy destroying our way of life with every single policy decision they make.",
    "It’s not going to be a hard sell because Americans know what is happening every time we pump gas.",
    "Joe will drain the oil reserves, PPE stocks and anything else he can to make the country weaker.",
    "But with the FJB clown car administration we are heading for an energy/food shortage nightmare.",
    "The amount of oil that could be released won't even amount to one week relief at the gas pump.",
    "President Trump made a great deal and filled the strategic reserve fuel for a very low cost.",
    "Biden is draining a wartime resource that wont do squat for his approval or our economy.",
    "The duration of the release hasn’t been finalized but could last for several months.",
    "Biden is not only a corrupt and inept politician, he’s an extremely dangerous one.",
    "Cheap political gimmick by Biden to lower gas prices just for the election.",
    "Biden has hated America ever since he got laughed out of the race in 1987.",
    "The Republican base is sick of the pathetic leadership you are showing.",
    "His actions also allowed Putin to fund the atrocities in the Ukraine.",
    "Your donation helps keep our discussions going and our voices heard.",
    "A price drop of maybe three cents for a few days is a fool's errand.",
    "OPEN UP our vast natural resources and in time this too shall pass.",
    "More of his plan to destroy our energy and foce us to go electric.",
    "Biden may release oil equivalent to a day or two use of energy.",
    "He knows this will have no effect on the cost to U.S. citizens.",
    "But you can be sure the elite will have access to gas and food.",
    "If you voted for this man and his crime family…any regrets?",
    "Sounds like a great idea as he puts us on the verge of WW3.",
    "Some shadowy cabal hidden deep within the executive branch.",
    "Remind them he made it a priority to be energy independent.",
    "He knows how to solve this problem because he caused it.",
    "Of course, that is assuming you actually want to win.",
    "Put this whole mess on Biden and the democrats.",
    "No public transportation or crickets for them.",
    "Peeing in the ocean to raise it 100 feet.",
    "Another America last move by Democrats!",
    "FJB punishes us everyday as payback.",
    "FJB\nThis just in from the AP (TASS).",
    "It is time to go on the offensive.",
    "November cannot come soon enough.",
    "How about educating the public?",
    "NO, that is not what it is for.",
    "Who— exactly— is “Biden?” Lol.",
    "“Biden.” What does that mean?",
    "It appears to be deliberate.",
    "This man will destroy us.",
    "Just you wait and see!",
    "This is how we win.",
    "Think about that.",
    "Let's Go Brandon.",
    "He's an idiot.",
    "Thank you.",
    "FJB."
  ]
}