{
  "id": 9440,
  "mediaId": 4418,
  "date": "2022-03-31",
  "headline": "REPORT: Registered Republican Voters Now Outnumber Democrats In Florida By Over 100,000",
  "image": "",
  "link": "https://conservativepapers.com/news/2022/03/31/report-registered-republican-voters-now-outnumber-democrats-in-florida-by-over-100000/",
  "mediaOutlet": "conservativepapers.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Lambert",
  "authorUrl": "https://conservativepapers.com/news/author/kalel/",
  "termIds": [
    4760,
    4623,
    3401,
    1679,
    1127,
    1126,
    392,
    6159
  ],
  "sentences": [
    "FOX News reports:\nTRENDING: JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State Katie Hobbs For Election Crimes\nFlorida’s registered Republican voters outnumber Democrats by over 100K for first time\nA red wave is brewing in Florida as registered Republican voters now outnumber Democrats by over 100,000 for the first time in the state’s history, according to data obtained by Fox News Digital.",
    "DeSantis pointed out that the Republicans had 300,000 fewer voters in 2018 when he was elected to lead, but now, ‘Florida Republicans now outnumber Democrats by over 100,000 registrants.’https://t.co/e2GeMWcmlC\n— Rebel News USA (@RebelNews_USA) March 30, 2022\nThis is a major win for the GOP.",
    "“Florida voters are appreciative of the palpable sense of freedom he has created in our state.”\n“Unemployment is lower than the national average, our schools are open, there are no lockdowns, and there are no masks.",
    "Advertisement – story continues below\nAt the end of 2021, Florida GOP’s voter registration numbers officially overtook the state Democratic Party, giving Republicans the lead in a state steadily shifting red.",
    "“There’s no beating around the fact this historic gain is because of Governor Ron DeSantis,” Florida Republican Party executive director Helen Aguirre Ferré said in a statement to Fox News Digital.",
    "Now, Republicans in Florida outnumber Democrats for the first time by over 100,000 voters, in both new registrants and party switches, according to internal numbers from Gov.",
    "A spokesperson for DeSantis’ campaign told Fox News Digital that the surge in Republican voters broke 101,000 as of Tuesday morning.",
    "Advertisement – story continues below\nIt certainly doesn’t hurt that Florida has a strong Republican governor like Ron DeSantis.",
    "Registered Republicans now outnumber Democrats by more than 100,000 which gives Republican candidates a significant advantage.",
    "That is unprecedented.”\nAdvertisement – story continues below\nIs it safe to call Florida a red state now?",
    "Voters recognize the governor is a champion for families and businesses alike,” Aguirre Ferré continued.",
    "Ron DeSantis’ re-election campaign exclusively obtained by Fox News Digital.",
    "“Our voter registration numbers are impressive, but a 363,000 net change?",
    "Advertisement – story continues below\nCross posted from American Lookout.",
    "Few states in the union are turning bright red as quickly as Florida.",
    "Source material can be found at this site."
  ]
}