[
  {
    "id": 3570,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "Healey is the latest high-profile state attorney general to entertain running for governor this cycle, following in the footsteps of <span class='selected-term'>Josh Shapiro</span> in Pennsylvania, where Gov.",
    "author": "",
    "title": "She took on Trump, Juul and the Sacklers. Now she wants to run Massachusetts."
  },
  {
    "id": 3560,
    "mediaId": 2658,
    "date": "2022-01-24",
    "sentence": "Down the ballot\nFIRST IN SCORE: THE CASH DASH — Pennsylvania state Attorney General <span class='selected-term'>Josh Shapiro</span>, who is effectively running unopposed in the Democratic primary for governor, tells us he raised $6.3 million in the final quarter of 2021, POLITICO’s Holly Otterbein writes in to Score.",
    "author": "",
    "title": "GOP Senate spending tops $15M in PA"
  },
  {
    "id": 3687,
    "mediaId": 2590,
    "date": "2022-01-27",
    "sentence": "The winner of that primary will face Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> in the general election.",
    "author": "Daniel Marans",
    "title": "Pennsylvania Republican Lou Barletta’s PAC Spent Most Of Its Money On Overhead"
  },
  {
    "id": 2870,
    "mediaId": 8469,
    "date": "2022-01-28",
    "sentence": "Pennsylvania’s attorney general, <span class='selected-term'>Josh Shapiro</span>, said in a statement the opinion will be immediately appealed and will not have any immediate impact on Pennsylvania’s upcoming elections.",
    "author": "",
    "title": "Pennsylvania court strikes down expansive mail-in voting law"
  },
  {
    "id": 2786,
    "mediaId": 2592,
    "date": "2022-01-28",
    "sentence": "Reflecting Biden's currently dimmed political star, one important Democrat from Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, pointedly kept away from the presidential visit, citing a scheduling conflict.",
    "author": "Saul Loeb with Sebastian Smith",
    "title": "At Collapsed Bridge, Biden Envisions Rebuilding America"
  },
  {
    "id": 2780,
    "mediaId": 2592,
    "date": "2022-01-28",
    "sentence": "Reflecting Biden's currently dimmed political star, one important Democrat from Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, pointedly kept away from the presidential visit, citing a scheduling conflict.",
    "author": "Saul Loeb with Sebastian Smith",
    "title": "At Collapsed Bridge, Biden Envisions Rebuilding America"
  },
  {
    "id": 2776,
    "mediaId": 2641,
    "date": "2022-01-28",
    "sentence": "Reflecting Biden's currently dimmed political star, one important Democrat from Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, pointedly kept away from the presidential visit, citing a scheduling conflict.",
    "author": "",
    "title": "Biden Visits Collapsed Bridge, Touts Infrastructure Law"
  },
  {
    "id": 2735,
    "mediaId": 2592,
    "date": "2022-01-28",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> says the ruling will be immediately appealed to the state supreme court.",
    "author": "Ben Scheffer",
    "title": "Pennsylvania Law Rules Mail-In Voting Law Unconstitutional"
  },
  {
    "id": 2712,
    "mediaId": 2658,
    "date": "2022-01-28",
    "sentence": "JOHN FETTERMAN, a leading Senate candidate, and state Attorney General <span class='selected-term'>JOSH SHAPIRO</span>, the likely Democratic nominee in the race for governor, will be absent,” AP’s Steve Peoples and Marc Levy note.",
    "author": "",
    "title": "POLITICO Playbook: Dr. Oz tries to please McConnell and Trump"
  },
  {
    "id": 2705,
    "mediaId": 2658,
    "date": "2022-01-31",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat running for governor, said the ruling will be appealed.",
    "author": "",
    "title": "The FEC reports we can’t wait to see"
  },
  {
    "id": 3534,
    "mediaId": 8469,
    "date": "2022-02-04",
    "sentence": "That’s how the office of Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> on Thursday characterized actions by state Republicans who planned to nominate their own electors following the 2020 presidential election in which their candidate lost.",
    "author": "Bill OBoyle boboyle@timesleader.com",
    "title": "Shapiro’s office: GOP elector plan not illegal, but misleading"
  },
  {
    "id": 17239,
    "mediaId": 2512,
    "date": "2022-02-28",
    "sentence": "Please understand that this is abnormal and beyond the guardrails, like so much in our civic discourse at this time.”\nDave La Torre, a spokesperson for Corman, told the Philadelphia Inquirer that voters in Pennsylvania “deserve to know that their candidates for governor are transparent and comply with the law.”\nSeidman reports, “(A) letter Wednesday from Corman campaign lawyer Zachary M. Wallen alleged Mastriano ‘may have committed flagrant and willful violations’ of state law by ‘submitting an obviously deficient and incomplete campaign finance report.’ The Corman campaign also sent the letter to state Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat who is also running for governor.”",
    "author": "Alex Henderson",
    "title": "Pennsylvania’s gubernatorial race turns nasty as candidate Corman demands criminal investigation of rival Mastriano"
  },
  {
    "id": 13870,
    "mediaId": 8504,
    "date": "2022-03-17",
    "sentence": "Zito says there are too many Republicans running and an assumption that Democrat Attorney General <span class='selected-term'>Josh Shapiro</span> is a shoe-in.",
    "author": "Dennis Owens",
    "title": "Political forecaster shares thoughts on Pa. Senate and Gov. races"
  },
  {
    "id": 14145,
    "mediaId": 8449,
    "date": "2022-03-17",
    "sentence": "El presunto nominado del Partido Demócrata, <span class='selected-term'>Josh Shapiro</span>, presentó su candidatura a gobernador en medio de su segundo mandato como fiscal general electo de Pensilvania.",
    "author": "",
    "title": "Primarias 2022: guía para entender el contenido de la boleta"
  },
  {
    "id": 11597,
    "mediaId": 2572,
    "date": "2022-03-22",
    "sentence": "Democratic incumbent governors are running for reelection in all of those states, other than the key battleground of Pennsylvania, where the party seems to be coalescing around state Attorney General <span class='selected-term'>Josh Shapiro</span> in the race to succeed term-limited Gov.",
    "author": "",
    "title": "Under attack by Trump, Georgia Gov. Kemp gets reinforcements from pro-GOP governors group, Chris Christie"
  },
  {
    "id": 9022,
    "mediaId": 4045,
    "date": "2022-03-26",
    "sentence": "",
    "author": "MARC LEVY - Associated Press",
    "title": "Abortion to elections: Republican candidates on the issues"
  },
  {
    "id": 6874,
    "mediaId": 8380,
    "date": "2022-04-12",
    "sentence": "The winner of the May 17 primary will take on state Attorney General <span class='selected-term'>Josh Shapiro</span>, who is running unopposed in the Democratic primary.",
    "author": "Brian X. McCrone",
    "title": "Call with Trump Leads Pa. GOP Candidate to Stay in Race for Governor"
  },
  {
    "id": 5889,
    "mediaId": 2732,
    "date": "2022-04-12",
    "sentence": "Bill’s record of upholding the law and going after criminals speaks for itself.”\nOn the campaign trail, McSwain points to himself as the only prosecutor in the Republican gubernatorial primary race and the opposite of the prosecutor who is running unopposed in his bid for the Democratic gubernatorial nomination: <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Pennlive.Com",
    "title": "Trump weighs in on Pa. governor’s race, naming candidate he's not endorsing"
  },
  {
    "id": 5224,
    "mediaId": 2746,
    "date": "2022-04-12",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> is the presumptive Democratic nominee for governor.",
    "author": "",
    "title": "Trump slams McSwain, who’d sought his endorsement for gov"
  },
  {
    "id": 5836,
    "mediaId": 2746,
    "date": "2022-04-12",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span> is the leading Democratic candidate for governor.",
    "author": "Dave Boyer",
    "title": "Trump slams GOP candidate in Pa. governor’s race for not going after 2020 election fraud"
  },
  {
    "id": 5942,
    "mediaId": 8401,
    "date": "2022-04-12",
    "sentence": "READ MORE:\nAttorney General <span class='selected-term'>Josh Shapiro</span> is the presumptive Democratic nominee for governor.",
    "author": "",
    "title": "Former President Donald Trump Slams Bill McSwain, Who’d Sought His Endorsement For Pennsylvania Governor"
  },
  {
    "id": 5357,
    "mediaId": 2664,
    "date": "2022-04-12",
    "sentence": "\"The developments didn’t bring much clarity to the crowded race to take on state Attorney General <span class='selected-term'>Josh Shapiro</span>, the presumptive Democratic nominee.",
    "author": "Bob Brigham",
    "title": "'Whiplash-inducing': Trump is 'still sowing chaos' in Pennsylvania GOP politics"
  },
  {
    "id": 6510,
    "mediaId": 8404,
    "date": "2022-04-13",
    "sentence": "The nine-person field has some state GOP officials worried that a badly divided primary electorate will choose a nominee who can’t beat presumptive Democratic nominee <span class='selected-term'>Josh Shapiro</span>, the state attorney general.",
    "author": "Associated Press",
    "title": "Trump intervenes in Pennsylvania GOP gubernatorial primary"
  },
  {
    "id": 6465,
    "mediaId": 8503,
    "date": "2022-04-14",
    "sentence": "His supporters love him for it, but critics say his base of supporters won’t help him carry the suburban and urban voters he will need to win a general election against Democrat <span class='selected-term'>Josh Shapiro</span>.",
    "author": "",
    "title": "Doug Mastriano could ride 2020 election denial into the PA governor's mansion"
  },
  {
    "id": 6442,
    "mediaId": 8503,
    "date": "2022-04-18",
    "sentence": "The primary election is May 17, and the winner of the Republican nomination will take on state Attorney General <span class='selected-term'>Josh Shapiro</span>, the presumed Democratic nominee.",
    "author": "",
    "title": "Bill McSwain still touts Trump connection even though the ex-president trashed him"
  },
  {
    "id": 4704,
    "mediaId": 8481,
    "date": "2022-04-18",
    "sentence": "We are just going to do the best we can to try and win this because it’s very important that we beat <span class='selected-term'>Josh Shapiro</span> in November.”\nBarletta will be joined on stage with Doug Mastriano, Dave White, and Bill McSwain in Harrisburg on April 27th for a debate right here on WTAJ.",
    "author": "Jordan Tracy",
    "title": "Lou Barletta talks governor’s race as primary looms"
  }
]