[
  {
    "id": 4247,
    "mediaId": 8481,
    "date": "2022-01-27",
    "sentence": "HARRISBURG, Pa. (WHTM) — In the last year alone, an average of 14 Pennsylvanians died a day from an overdose, according to Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Lauren Rude",
    "title": "All Pa. counties sign on to $26 billion global opioid settlement"
  },
  {
    "id": 2968,
    "mediaId": 8467,
    "date": "2022-01-28",
    "sentence": "",
    "author": "Associated Press",
    "title": "Court throws Pennsylvania’s mail-in voting law into doubt"
  },
  {
    "id": 2870,
    "mediaId": 8469,
    "date": "2022-01-28",
    "sentence": "Pennsylvania’s attorney general, <span class='selected-term'>Josh Shapiro</span>, said in a statement the opinion will be immediately appealed and will not have any immediate impact on Pennsylvania’s upcoming elections.",
    "author": "",
    "title": "Pennsylvania court strikes down expansive mail-in voting law"
  },
  {
    "id": 2763,
    "mediaId": 8254,
    "date": "2022-02-02",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat, has said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "AP",
    "title": "Arguments set for March on Pennsylvania’s mail-in voting law"
  },
  {
    "id": 11069,
    "mediaId": 2732,
    "date": "2022-03-07",
    "sentence": "Most party pillars — Wolf, Sen. Bob Casey and state Attorney General <span class='selected-term'>Josh Shapiro</span> — have not taken sides.",
    "author": "Associated Press",
    "title": "'We want to win': Democrats face choice in key Senate race in Pennsylvania"
  },
  {
    "id": 15442,
    "mediaId": 8254,
    "date": "2022-03-10",
    "sentence": "HARRISBURG, Pa. (WHTM) - Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is reminding Pennsylvanians of important tips and warnings when it comes to donating money or goods to assist the people of Ukraine.",
    "author": "George Stockburger",
    "title": "Pennsylvania AG offers tips, warning for making donations to Ukraine"
  },
  {
    "id": 15366,
    "mediaId": 8254,
    "date": "2022-03-14",
    "sentence": "“Pennsylvania’s farmers trusted Comrey to complete and submit important plans on their behalf, plans that could make or break their farming operations,” said Attorney General <span class='selected-term'>Josh Shapiro</span> in the press release.",
    "author": "Avery Van Etten",
    "title": "Pa. attorney general suing woman who allegedly scammed farmers"
  },
  {
    "id": 13433,
    "mediaId": 6571,
    "date": "2022-03-18",
    "sentence": "HARRISBURG, Pa. (AP) — Democrat <span class='selected-term'>Josh Shapiro</span> is rolling out the first tax proposal of his candidacy for governor, saying Friday that he would use surplus state cash and federal pandemic aid to eliminate state taxes on cell phone bills, send payments to car-owning households and expand Pennsylvania's rent and property tax rebate program.",
    "author": "",
    "title": "Josh Shapiro Rolls Out First Tax Relief Plan Of Governor's Race"
  },
  {
    "id": 11633,
    "mediaId": 6571,
    "date": "2022-03-26",
    "sentence": "",
    "author": "",
    "title": "First Case Of New Avian Flu Strain Detected In Pennsylvania"
  },
  {
    "id": 12016,
    "mediaId": 8424,
    "date": "2022-03-26",
    "sentence": "HARRISBURG — Attorney General <span class='selected-term'>Josh Shapiro</span> is warning Pennsylvanians to be on the lookout for bogus fund-raising calls that purport to benefit the families of two fallen Pennsylvania State Police troopers killed Monday on Interstate 95 South in Philadelphia.",
    "author": "",
    "title": "AG warns of scams related to donations for fallen PSP troopers"
  },
  {
    "id": 11767,
    "mediaId": 6571,
    "date": "2022-03-26",
    "sentence": "By: KDKA-TV News Staff\nHARRISBURG (KDKA) -- Ahead of the April 18 tax deadline, Attorney General <span class='selected-term'>Josh Shapiro</span> is warning taxpayers to be wary about potential scams.",
    "author": "",
    "title": "Attorney General Josh Shapiro Warns About IRS Tax Day Scams"
  },
  {
    "id": 9813,
    "mediaId": 8322,
    "date": "2022-03-31",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span> tweeted his support of the officers.",
    "author": "",
    "title": "Pennsylvania officer, suspect killed, 2 officers wounded in gunfire exchange"
  },
  {
    "id": 6693,
    "mediaId": 8493,
    "date": "2022-04-11",
    "sentence": "Whoever wins will take on State Attorney General <span class='selected-term'>Josh Shapiro</span>, the presumptive Democratic nominee, who had $16 million in his campaign account at the close of the three-month period ending March 28 — a huge financial advantage over his prospective GOP rivals.",
    "author": "WKOK Staff",
    "title": "PA Headlines: DNA Used in I-81 IDs, GOP Candidate Spending Update"
  },
  {
    "id": 5942,
    "mediaId": 8401,
    "date": "2022-04-12",
    "sentence": "READ MORE:\nAttorney General <span class='selected-term'>Josh Shapiro</span> is the presumptive Democratic nominee for governor.",
    "author": "",
    "title": "Former President Donald Trump Slams Bill McSwain, Who’d Sought His Endorsement For Pennsylvania Governor"
  },
  {
    "id": 6510,
    "mediaId": 8404,
    "date": "2022-04-13",
    "sentence": "The nine-person field has some state GOP officials worried that a badly divided primary electorate will choose a nominee who can’t beat presumptive Democratic nominee <span class='selected-term'>Josh Shapiro</span>, the state attorney general.",
    "author": "Associated Press",
    "title": "Trump intervenes in Pennsylvania GOP gubernatorial primary"
  },
  {
    "id": 4704,
    "mediaId": 8481,
    "date": "2022-04-18",
    "sentence": "We are just going to do the best we can to try and win this because it’s very important that we beat <span class='selected-term'>Josh Shapiro</span> in November.”\nBarletta will be joined on stage with Doug Mastriano, Dave White, and Bill McSwain in Harrisburg on April 27th for a debate right here on WTAJ.",
    "author": "Jordan Tracy",
    "title": "Lou Barletta talks governor’s race as primary looms"
  },
  {
    "id": 4752,
    "mediaId": 8315,
    "date": "2022-04-18",
    "sentence": "That one candidate is no stranger to public service: Pennsylvania’s Attorney General, <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Brendan Scanland",
    "title": "Meet the Candidates: Josh Shapiro for PA Governor"
  },
  {
    "id": 4639,
    "mediaId": 8254,
    "date": "2022-04-19",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span>, who is running unopposed, has $12 million more cash on hand than all nine Republican candidates combined.",
    "author": "George Stockburger",
    "title": "Pennsylvania Governor race: Shapiro & White lead Q1 fundraising"
  },
  {
    "id": 4667,
    "mediaId": 2680,
    "date": "2022-04-22",
    "sentence": "Pennsylvania may not stay in the consortium even if Wolf's successor is Democrat <span class='selected-term'>Josh Shapiro</span>, the party's presumed nominee who is endorsed by Wolf.",
    "author": "MARC LEVY",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 5856,
    "mediaId": 2822,
    "date": "2022-04-22",
    "sentence": "Pennsylvania may not stay in the consortium even if Wolf's successor is Democrat <span class='selected-term'>Josh Shapiro</span>, the party's presumed nominee who is endorsed by Wolf.",
    "author": "MARC LEVY - Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 5991,
    "mediaId": 2509,
    "date": "2022-04-22",
    "sentence": "Pennsylvania may not stay in the consortium even if Wolf's successor is Democrat <span class='selected-term'>Josh Shapiro</span>, the party's presumed nominee who is endorsed by Wolf.",
    "author": "MARC LEVY Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 5046,
    "mediaId": 8483,
    "date": "2022-04-23",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is the only Democrat running for the state's top office.",
    "author": "Tom Lehman",
    "title": "One-on-one with Pennsylvania gubernatorial candidate Josh Shapiro"
  }
]