[
  {
    "id": 4545,
    "mediaId": 2690,
    "date": "2022-01-05",
    "sentence": "“As the judge noted, there’s no justification for preventing the county from looking at their own machines.”\nThe inspection had been scheduled for earlier this month but the state Attorney General <span class='selected-term'>Josh Shapiro</span> along with the Secretary of State sued to prevent the inspection.",
    "author": "",
    "title": "BOOM! Judge Allows Inspection Of 2020 Dominion Voting Machines"
  },
  {
    "id": 18689,
    "mediaId": 8446,
    "date": "2022-01-06",
    "sentence": "In July 2021, PA Attorney General <span class='selected-term'>Josh Shapiro</span> announced the settlement that had been negotiated with pharmaceutical companies.",
    "author": "",
    "title": "Susquehanna County joins opioid settlement"
  },
  {
    "id": 4494,
    "mediaId": 8493,
    "date": "2022-01-06",
    "sentence": "The presumed Democratic nominee is <span class='selected-term'>Josh Shapiro</span>, the state’s two-term attorney general.",
    "author": "WKOK Staff",
    "title": "AP: GOP PA Gov Hopefuls Face Off at Dickinson College"
  },
  {
    "id": 4480,
    "mediaId": 8417,
    "date": "2022-01-06",
    "sentence": "Perhaps Mastriano’s fast and loose approach to campaign finance is a “gray area” as he maintains, but since his potential November opponent is State Attorney General <span class='selected-term'>Josh Shapiro</span>, the guy who enforces these laws, he’d better be sure of it.",
    "author": "Dwight Weidman",
    "title": "Mastriano dodges and weaves ahead of expected jump into race for Pa. governor"
  },
  {
    "id": 4513,
    "mediaId": 8493,
    "date": "2022-01-09",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, a resident of Abington in the Philadelphia suburbs, appears to have cleared the Democratic Party primary field.",
    "author": "WKOK Staff",
    "title": "Sen. Mastriano Announces, Kellyanne Conway Helps Corman"
  },
  {
    "id": 4568,
    "mediaId": 2602,
    "date": "2022-01-09",
    "sentence": "Mastriano is running as a Republican and, if he wins the primary, will likely face off against <span class='selected-term'>Josh Shapiro</span>, the state’s Democratic attorney-general who rose to prominence by vocally opposing efforts to cast doubt on Joe Biden’s victory in the state in the 2020 presidential election.",
    "author": "SHIRA HANAU/JTA",
    "title": "GOP's Doug Mastriano enters Pennsylvania governor with shofar blast"
  },
  {
    "id": 4602,
    "mediaId": 8493,
    "date": "2022-01-11",
    "sentence": "But the statewide Commonwealth Court that issued the seven-page order did not immediately greenlight the release of some information that Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> challenged as being protected by privacy laws.",
    "author": "WKOK Staff",
    "title": "PA Headlines: Bochetto Joins Gov Race, ‘Envoy Sage’ Gets Greenlight"
  },
  {
    "id": 4519,
    "mediaId": 2590,
    "date": "2022-01-13",
    "sentence": "“Navient repeatedly and deliberately put profits ahead of its borrowers — it engaged in deceptive and abusive practices, targeted students who it knew would struggle to pay loans back, and placed an unfair burden on people trying to improve their lives through education,” said Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat and one of the attorneys general suing the company.",
    "author": "Kevin Robillard",
    "title": "Major Student Loan Processor Cancels $1.7 Billion In Debt"
  },
  {
    "id": 4572,
    "mediaId": 2874,
    "date": "2022-01-13",
    "sentence": "“Navient repeatedly and deliberately put profits ahead of its borrowers – it engaged in deceptive and abusive practices, targeted students who it knew would struggle to pay loans back, and placed an unfair burden on people trying to improve their lives through education,” said Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who co-led the litigation and negotiation of the settlement.",
    "author": "Devi Shastri",
    "title": "More than 5,000 student loan borrowers in Wisconsin will receive relief through settlement with loan servicer Navient"
  },
  {
    "id": 4523,
    "mediaId": 2634,
    "date": "2022-01-13",
    "sentence": "In my interview with Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, the presumptive Democratic nominee for governor, he stressed that the efforts to recalibrate voting rules were very real and serious.",
    "author": "Daniel Strauss",
    "title": "Democratic Governors May Be Democracy’s Last Line of Defense"
  },
  {
    "id": 4517,
    "mediaId": 2872,
    "date": "2022-01-13",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> said in a statement, “Navient repeatedly and deliberately put profits ahead of its borrowers — it engaged in deceptive and abusive practices, targeted students who it knew would struggle to pay loans back, and placed an unfair burden on people trying to improve their lives through education.”\n“Today’s settlement corrects Navient’s past behavior, provides much needed relief to Pennsylvania borrowers, and puts in place safeguards to ensure this company never preys on student loan borrowers again,” Shapiro continued.",
    "author": "Vanessa Taylor",
    "title": "Navient is canceling $1.7 billion in student loans after accusations of predatory lending"
  },
  {
    "id": 4497,
    "mediaId": 8399,
    "date": "2022-01-14",
    "sentence": "And instead of helping them, they ran a multi-billion dollar scam,” Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who sued Navient in 2017 and co-led the litigation and settlement negotiations with four other states, said during a virtual press conference on Jan. 13.",
    "author": "Marley Parish",
    "title": "Pa. borrowers to see relief after $1.85B settlement with Navient for ‘predatory’ practices"
  },
  {
    "id": 3645,
    "mediaId": 8438,
    "date": "2022-01-18",
    "sentence": "Tom Wolf and state attorney General <span class='selected-term'>Josh Shapiro</span>, a Democratic candidate for governor, have dismissed Barletta’s complaints as a federal issue.",
    "author": "South Philly Review -",
    "title": "Briefs: January 18th, 2022"
  },
  {
    "id": 4355,
    "mediaId": 8254,
    "date": "2022-01-19",
    "sentence": "While Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is the only Democrat seeking to succeed outgoing Governor Tom Wolf, there are 14 Republicans who have thrown their hats into the ring.",
    "author": "Dennis Owens",
    "title": "Mike Turzai opts against run for Governor of Pennsylvania in 2022"
  },
  {
    "id": 4045,
    "mediaId": 8449,
    "date": "2022-01-19",
    "sentence": "El actual gobernador, el demócrata Tom Wolf, deja el cargo en enero de 2023 y no puede postularse para un tercer mandato, por lo que su partido tiene un candidato esperando entre bastidores: se espera que el actual fiscal general de Pensilvania, <span class='selected-term'>Josh Shapiro</span>, no enfrente un gran desafío por la nominación demócrata en las elecciones primarias de mayo.",
    "author": "",
    "title": "¿Quién corre por la gobernación en 2022?"
  },
  {
    "id": 3570,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "Healey is the latest high-profile state attorney general to entertain running for governor this cycle, following in the footsteps of <span class='selected-term'>Josh Shapiro</span> in Pennsylvania, where Gov.",
    "author": "",
    "title": "She took on Trump, Juul and the Sacklers. Now she wants to run Massachusetts."
  },
  {
    "id": 4320,
    "mediaId": 8493,
    "date": "2022-01-19",
    "sentence": "SELINSGROVE – State Attorney General <span class='selected-term'>Josh Shapiro</span> visited the Valley Wednesday to announce the expansion of treatment programs in Snyder County.",
    "author": "WKOK Staff",
    "title": "Shapiro Announces Expansion of Snyder County Treatment Program"
  },
  {
    "id": 3847,
    "mediaId": 8380,
    "date": "2022-01-19",
    "sentence": "Pennsylvania Governor Race 2022 Candidates\n<span class='selected-term'>Josh Shapiro</span> (Democrat): The second-term state attorney general who lives in Abington Township, just outside Philadelphia, is the presumptive nominee for the Democratic Party.",
    "author": "Brian X. McCrone",
    "title": "Who Is Running for Pennsylvania Governor in 2022?"
  },
  {
    "id": 3972,
    "mediaId": 8500,
    "date": "2022-01-20",
    "sentence": "The likely Democratic Party nominee is two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>, who in October reported having $10 million in his campaign account.",
    "author": "",
    "title": "McSwain lands endorsement of big GOP campaign donor"
  },
  {
    "id": 3781,
    "mediaId": 8488,
    "date": "2022-01-20",
    "sentence": "News\nSports\nWeather\nOn Air\nParade of Lights\nGallery\nAbout\nWHLM/WBWX FCC Applications\nState Attorney General <span class='selected-term'>Josh Shapiro</span> appeared in Snyder County Wednesday, to announce the expansion of drug treatment programs in the region.",
    "author": "Tory Gates",
    "title": "Shapiro Announces Expansion of LETI Program"
  },
  {
    "id": 3893,
    "mediaId": 8305,
    "date": "2022-01-20",
    "sentence": "",
    "author": "Lowman S Henry",
    "title": "Lowman S. Henry: Blessing or curse? Pa. GOP ponders large field of gubernatorial candidates"
  },
  {
    "id": 3836,
    "mediaId": 8437,
    "date": "2022-01-20",
    "sentence": "Meanwhile, state Democrats have one lone contender, current Attorney General <span class='selected-term'>Josh Shapiro</span>, who will advance to the General Election barring a political development of epic proportions.",
    "author": "Lowman S Henry",
    "title": "Lowman S. Henry: Blessing or curse? Pa. GOP ponders large field of gubernatorial candidates"
  },
  {
    "id": 3903,
    "mediaId": 8393,
    "date": "2022-01-20",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span> announced in November Pennsylvania would see about $1.1 billion of the settlement.",
    "author": "Cody Butler",
    "title": "Fighting the opioid epidemic in Luzerne County"
  },
  {
    "id": 4066,
    "mediaId": 8380,
    "date": "2022-01-20",
    "sentence": "The likely Democratic Party nominee is two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>, who in October reported having $10 million in his campaign account.",
    "author": "",
    "title": "Big GOP Donor Endorses McSwain for Pa. Governor"
  },
  {
    "id": 4295,
    "mediaId": 8469,
    "date": "2022-01-21",
    "sentence": "Also calling for the Womble report’s release are candidates from both parties running to succeed Wolf in this fall’s election, including Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat, and three Republican state senators: Senate President Pro Tempore Jake Corman, R-Centre; Doug Mastriano, R-Franklin; and Scott Martin, R-Lancaster); along with fellow GOP candidates Guy Ciarrochi, Scott Gerow and John Ventre.",
    "author": "",
    "title": "Pennsylvania lawmakers mull pension reforms as PSERS remains under scrutiny"
  },
  {
    "id": 4108,
    "mediaId": 8493,
    "date": "2022-01-23",
    "sentence": "But those straw poll results were more mixed when it came to the crowded field of gubernatorial candidates vying to take on presumed Democratic nominee <span class='selected-term'>Josh Shapiro</span> in November.",
    "author": "WKOK Staff",
    "title": "PennLive: Bartos Leads Republican Field in US Senate Race"
  },
  {
    "id": 3577,
    "mediaId": 2658,
    "date": "2022-01-24",
    "sentence": "Jonathan Older is the new scheduler in Rep. Josh Gottheimer’s (D-N.J.) office, as <span class='selected-term'>Josh Shapiro</span> moves to be staff assistant.",
    "author": "",
    "title": "Senators counting on Electoral Count Act"
  },
  {
    "id": 3560,
    "mediaId": 2658,
    "date": "2022-01-24",
    "sentence": "Down the ballot\nFIRST IN SCORE: THE CASH DASH — Pennsylvania state Attorney General <span class='selected-term'>Josh Shapiro</span>, who is effectively running unopposed in the Democratic primary for governor, tells us he raised $6.3 million in the final quarter of 2021, POLITICO’s Holly Otterbein writes in to Score.",
    "author": "",
    "title": "GOP Senate spending tops $15M in PA"
  },
  {
    "id": 4228,
    "mediaId": 2732,
    "date": "2022-01-24",
    "sentence": "For example, Democratic Attorney General <span class='selected-term'>Josh Shapiro</span>, who won in 2020 when Republicans swept other state office races, will likely cruise to his party’s gubernatorial nomination without burning much of his financial resources or having to move to the left on policy matters to win over progressives.",
    "author": "Christopher Borick",
    "title": "Christopher Borick: A Pa. Republican Wave — if the party can ride it"
  },
  {
    "id": 3763,
    "mediaId": 8437,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Matthew J Brouillette",
    "title": "Matthew J. Brouillette: Counting down to a new direction in Pa."
  },
  {
    "id": 3860,
    "mediaId": 8305,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Matthew J Brouillette",
    "title": "Matthew J. Brouillette: Counting down to a new direction in Pa."
  },
  {
    "id": 4192,
    "mediaId": 8427,
    "date": "2022-01-25",
    "sentence": "Democrat Attorney General and gubernatorial candidate <span class='selected-term'>Josh Shapiro</span> defended Wolf’s shutdowns in court, targeted the natural gas industry with trumped-up criminal charges, and stands proudly with the government union executives who oppose empowering parents to control their children’s education.",
    "author": "Matthew J. Brouillette",
    "title": "Matthew J. Brouillette: Counting down to a new direction in Pa."
  },
  {
    "id": 3603,
    "mediaId": 8438,
    "date": "2022-01-25",
    "sentence": "“Our campaign created this website to help give citizens a voice who are fed up with Krasner.”\nBarletta wants end to flights of illegals to PA\nLou Barletta, Republican candidate for governor, called on the General Assembly to pass a resolution demanding that Attorney General <span class='selected-term'>Josh Shapiro</span> file a lawsuit against the Biden administration for violations of the Refugee Act of 1980.",
    "author": "South Philly Review -",
    "title": "Briefs: January 25th, 2022"
  },
  {
    "id": 4375,
    "mediaId": 8452,
    "date": "2022-01-26",
    "sentence": "In <span class='selected-term'>Josh Shapiro</span>’s childhood home, every Friday night was reserved for Shabbat dinner, which begins the day of rest in Judaism.",
    "author": "Fallon Roth",
    "title": "Josh Shapiro speaks to Temple Jewish Law Students Association"
  },
  {
    "id": 3427,
    "mediaId": 6534,
    "date": "2022-01-27",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "",
    "title": "Biden Visits Collapsed Bridge, Touts Infrastructure Law"
  },
  {
    "id": 4397,
    "mediaId": 8322,
    "date": "2022-01-27",
    "sentence": "Democratic incumbent governors are running for re-election in all those states, other than the key battleground of Pennsylvania, where the Democrats seem to be coalescing around state Attorney General <span class='selected-term'>Josh Shapiro</span> in the race to succeed term-limited Gov.",
    "author": "Paul Steinhauser",
    "title": "Republican Governors Association hauls in record $75M last year"
  },
  {
    "id": 4112,
    "mediaId": 2553,
    "date": "2022-01-27",
    "sentence": "Similarly, Pennsylvania Governor Tom Wolf and Attorney General <span class='selected-term'>Josh Shapiro</span> (who is currently running to succeed Wolf as Governor), who are both ardent Biden supporters, have placed regular obstacles to the completion of the Mariner East pipeline connecting the Marcellus natural gas shale in Northwestern Pennsylvania to Philadelphia-area ports; citing environmental concerns.",
    "author": "",
    "title": "As America Sleeps, A Dangerous Axis Develops"
  },
  {
    "id": 4459,
    "mediaId": 2551,
    "date": "2022-01-27",
    "sentence": "+6\nView gallery\nPresident Joe Biden will visit Pittsburgh on Friday, but two high-profile Democratic candidates running in Pennsylvania will not be there - the latest to keep away from a presidential visit\n+6\nView gallery\n+6\nView gallery\nPennsylvania Lieutenant Governor and U.S. Senate candidate John Fetterman said he had a party meeting 200 miles away on Friday, while state Attorney General and gubernatorial candidate <span class='selected-term'>Josh Shapiro</span> gave no reason other than a scheduling conflict\n+6\nView gallery\nA Monmouth University Poll this week showed just how far Biden's numbers have dropped\nThe numbers have Republicans licking their lips in anticipation of sweeping gains in Novembers midterm elections - and Democrats apparently avoiding their party's biggest name.",
    "author": "Rob Crilly",
    "title": "Democratic candidates say 'scheduling conflicts' will keep them away from Biden visit to Pittsburgh on Friday, as plunging poll numbers make president an election liability"
  },
  {
    "id": 4384,
    "mediaId": 2548,
    "date": "2022-01-27",
    "sentence": "John Fetterman and state Attorney General <span class='selected-term'>Josh Shapiro</span> will not attend due to scheduling conflicts, the Associated Press reported.",
    "author": "Michael Ginsberg",
    "title": "Pennsylvania Democrats Ditch Biden Event As His Poll Numbers Tank"
  },
  {
    "id": 2992,
    "mediaId": 2641,
    "date": "2022-01-27",
    "sentence": "John Fetterman, who is running for U.S. Senate in 2022, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, who is seeking the Democratic nomination for governor the same year, will not attend due to \"scheduling conflicts,\" their spokespeople told AP.",
    "author": "Luca Cacciatore",
    "title": "'Scheduling Conflicts' to Keep Democratic Candidates From Biden's Pa. Visit"
  },
  {
    "id": 4385,
    "mediaId": 8254,
    "date": "2022-01-27",
    "sentence": "HARRISBURG, Pa. (WHTM) — In the last year alone, an average of 14 Pennsylvanians died a day from an overdose, according to Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "James Wesser",
    "title": "All Pa. counties sign on to $26 billion global opioid settlement"
  },
  {
    "id": 4303,
    "mediaId": 8256,
    "date": "2022-01-27",
    "sentence": "https://t.co/Mtlk9QmwuO\n— AG <span class='selected-term'>Josh Shapiro</span> (@PAAttorneyGen) January 27, 2022\nThe settlement money is to be used for programs and services such as treatment of opioid use disorder, distribution of medication like Naloxone to reverse overdoses, and educational outreach to prevent the over-prescribing of opioids, and discourage misuse.",
    "author": "",
    "title": "Philly to get at least $186 million to fight opioid crisis after national settlement"
  },
  {
    "id": 4247,
    "mediaId": 8481,
    "date": "2022-01-27",
    "sentence": "HARRISBURG, Pa. (WHTM) — In the last year alone, an average of 14 Pennsylvanians died a day from an overdose, according to Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Lauren Rude",
    "title": "All Pa. counties sign on to $26 billion global opioid settlement"
  },
  {
    "id": 4299,
    "mediaId": 8500,
    "date": "2022-01-27",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "",
    "title": "Key Pa. Dems to miss Biden visit, cite scheduling conflicts"
  },
  {
    "id": 4405,
    "mediaId": 8469,
    "date": "2022-01-27",
    "sentence": "“<span class='selected-term'>Josh Shapiro</span> is running to be the governor of Pennsylvania and he’s focused on the issues that matter to Pennsylvania families,” Shapiro spokesperson Will Simons said.",
    "author": "",
    "title": "Top Pa. Dems to miss Biden visit, cite scheduling conflicts"
  },
  {
    "id": 4035,
    "mediaId": 8325,
    "date": "2022-01-27",
    "sentence": "In 2018, about a dozen priests who were among hundreds to be identified and criticized in a massive report by Attorney General <span class='selected-term'>Josh Shapiro</span> about child abuse in six Catholic dioceses filed legal challenges to the document before its release.",
    "author": "Gant Team",
    "title": "PA Pension Fund Says It Won’t Require Board to Sign Secrecy Oaths to Hear Key Report"
  },
  {
    "id": 3892,
    "mediaId": 2668,
    "date": "2022-01-27",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "Bonchie",
    "title": "Top Democrats Start Avoiding Joe Biden in Public Because He's So Toxic"
  },
  {
    "id": 3281,
    "mediaId": 6509,
    "date": "2022-01-27",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "",
    "title": "Biden Visits Collapsed Bridge, Touts Infrastructure Law"
  },
  {
    "id": 3098,
    "mediaId": 2633,
    "date": "2022-01-27",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "",
    "title": "Biden Visits Collapsed Bridge, Touts Infrastructure Law"
  },
  {
    "id": 3846,
    "mediaId": 2562,
    "date": "2022-01-27",
    "sentence": "John Fetterman, who is running for U.S. Senate in 2022, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, who is seeking the Democratic nomination for governor the same year, will not attend due to \"scheduling conflicts,\" their spokespeople told AP.",
    "author": "NationalWatch",
    "title": "‘Scheduling Conflicts’ to Keep Democratic Candidates From Biden’s Pa. Visit"
  },
  {
    "id": 3871,
    "mediaId": 2696,
    "date": "2022-01-27",
    "sentence": "They are now pleading for federal agencies to get involved in the investigation; for the case to be referred to Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>; and for information to be released to Cyril Wecht, a renowned pathologist hired to conduct a private autopsy.",
    "author": "Mara Luisa Pal",
    "title": "A co-worker invited him to a rural cabin. He was killed hours later."
  },
  {
    "id": 3795,
    "mediaId": 2679,
    "date": "2022-01-27",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "STEVE PEOPLES",
    "title": "Key Pa. Dems to miss Biden visit, cite scheduling conflicts"
  },
  {
    "id": 4420,
    "mediaId": 2732,
    "date": "2022-01-27",
    "sentence": "That’s why I’m supporting <span class='selected-term'>Josh Shapiro</span> for governor, because he has a proven track record of defending democracy and fighting for Pennsylvanians’ rights, and has a 10-point plan to defend democracy, ensure access to the ballot box and improve elections.",
    "author": "Rep. Emily Kinkead",
    "title": "Rep. Emily Kinkead: As governor, Shapiro will protect our democracy"
  },
  {
    "id": 2935,
    "mediaId": 2732,
    "date": "2022-01-27",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "Associated Press",
    "title": "Key Pennsylvania Dems to miss Biden visit, cite scheduling conflicts"
  },
  {
    "id": 4368,
    "mediaId": 2594,
    "date": "2022-01-27",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their respective spokespeople.",
    "author": "Via AP news wire",
    "title": "Top Pa. Dems to miss Biden visit, cite scheduling conflicts"
  },
  {
    "id": 4350,
    "mediaId": 2540,
    "date": "2022-01-27",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, also a Democrat, said he concluded that charges weren't warranted.",
    "author": "Marshall Cohen",
    "title": "What to know about the Trump 'fake electors' scheme"
  },
  {
    "id": 4315,
    "mediaId": 6526,
    "date": "2022-01-27",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "Steve Peoples",
    "title": "Top Pennsylvania Democrats to skip Biden visit as his poll numbers drop. They cite scheduling conflicts"
  },
  {
    "id": 3280,
    "mediaId": 6535,
    "date": "2022-01-27",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "",
    "title": "Biden Visits Collapsed Bridge, Touts Infrastructure Law"
  },
  {
    "id": 4024,
    "mediaId": 2728,
    "date": "2022-01-27",
    "sentence": "Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their respective spokespeople.",
    "author": "Steve Peoples And Marc Levy",
    "title": "Key Pa. Dems to miss Biden visit, cite scheduling conflicts"
  },
  {
    "id": 3917,
    "mediaId": 2687,
    "date": "2022-01-27",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts… Another top Senate candidate, Rep. Conor Lamb, a longtime Biden supporter based in Pittsburgh, will attend.”\nSave to Favorites",
    "author": "Taegan Goddard",
    "title": "Top Pennsylvania Democrats Will Skip Biden Event"
  },
  {
    "id": 3687,
    "mediaId": 2590,
    "date": "2022-01-27",
    "sentence": "The winner of that primary will face Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> in the general election.",
    "author": "Daniel Marans",
    "title": "Pennsylvania Republican Lou Barletta’s PAC Spent Most Of Its Money On Overhead"
  },
  {
    "id": 2845,
    "mediaId": 8380,
    "date": "2022-01-27",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "",
    "title": "Biden Visits Collapsed Bridge, Touts Infrastructure Law"
  },
  {
    "id": 3241,
    "mediaId": 8504,
    "date": "2022-01-28",
    "sentence": "The Department added that they are “notifying all county election boards that they should proceed with all primary election preparations as they were before today’s Commonwealth Court ruling.”\nPennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who is also running for Governor, tweeted that he is “confident that Act 77 will ultimately be upheld as constitutional.”\nThe court’s ruling and opinion issued by President Judge Emerita Mary Hannah Leavitt can be read below:\nIn 2019 Governor Tom Wolf said Act 77 made voting “more convenient and more secure for millions of Pennsylvanians.”\nJust over 2.5 million people voted under the law in 2020's presidential election, most of them Democrats, out of 6.9 million total cast.",
    "author": "George Stockburger",
    "title": "Court finds Pennsylvania mail-in voting law unconstitutional, appeal anticipated"
  },
  {
    "id": 3299,
    "mediaId": 8504,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "The Associated Press",
    "title": "Biden visits collapsed bridge, touts infrastructure law"
  },
  {
    "id": 3018,
    "mediaId": 8254,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "The Associated Press",
    "title": "Biden visits collapsed bridge, touts infrastructure law"
  },
  {
    "id": 3135,
    "mediaId": 8469,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "Colleen Long",
    "title": "Biden visits collapsed bridge, touts infrastructure law"
  },
  {
    "id": 3251,
    "mediaId": 8483,
    "date": "2022-01-28",
    "sentence": "Incredible video shows how bridge collapse stopped bus from careening into Pittsburgh ravine\nState Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "",
    "title": "Biden touts infrastructure plan after visiting site of Pittsburgh bridge collapse"
  },
  {
    "id": 3158,
    "mediaId": 8270,
    "date": "2022-01-28",
    "sentence": "",
    "author": "Associated Press",
    "title": "Court throws Pennsylvania’s mail-in voting law into doubt"
  },
  {
    "id": 2696,
    "mediaId": 2658,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, also a Democrat, said the ruling would be appealed to the state Supreme Court, which turned back other challenges to the law in 2020 and has a generally liberal bent.",
    "author": "",
    "title": "Pennsylvania voting fight escalates as court strikes down mail ballot law"
  },
  {
    "id": 3392,
    "mediaId": 2528,
    "date": "2022-01-28",
    "sentence": "—<span class='selected-term'>Josh Shapiro</span> (@JoshShapiroPA) January 28, 2022\nOriginally, Rep. Conor Lamb, a longtime Biden ally who is running against Fetterman for the Senate seat, was the only major midterm candidate set to join Biden.",
    "author": "Brent D. Griffiths",
    "title": "John Fetterman attended Biden's speech in Pennsylvania, despite earlier report that he would miss it"
  },
  {
    "id": 2712,
    "mediaId": 2658,
    "date": "2022-01-28",
    "sentence": "JOHN FETTERMAN, a leading Senate candidate, and state Attorney General <span class='selected-term'>JOSH SHAPIRO</span>, the likely Democratic nominee in the race for governor, will be absent,” AP’s Steve Peoples and Marc Levy note.",
    "author": "",
    "title": "POLITICO Playbook: Dr. Oz tries to please McConnell and Trump"
  },
  {
    "id": 2785,
    "mediaId": 2590,
    "date": "2022-01-28",
    "sentence": "“This opinion is based on twisted logic and faulty reasoning, and is wrong on the law,” Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> said in a statement.",
    "author": "Lydia O'Connor",
    "title": "Court Strikes Down Pennsylvania Law Making It Easier To Vote By Mail"
  },
  {
    "id": 2782,
    "mediaId": 2679,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "STEVE PEOPLES",
    "title": "Biden visits collapsed bridge, touts infrastructure law"
  },
  {
    "id": 3532,
    "mediaId": 2644,
    "date": "2022-01-28",
    "sentence": "The scheduled absence of Fetterman and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the party’s likely gubernatorial nominee, raised eyebrows as a potential indicator that the Keystone State’s top two Democrats up for election this year were giving the struggling president a wide berth.",
    "author": "Callie Patteson",
    "title": "Pennsylvania Lt. Gov. John Fetterman changes plans, stays for Biden Pittsburgh speech"
  },
  {
    "id": 3539,
    "mediaId": 2679,
    "date": "2022-01-28",
    "sentence": "Pennsylvania’s attorney general, <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor, said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "MARC LEVY",
    "title": "Court throws Pennsylvania’s mail-in voting law into doubt"
  },
  {
    "id": 3452,
    "mediaId": 2518,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "The Associated Press",
    "title": "Biden heads to Pennsylvania to talk infrastructure as bridge collapses"
  },
  {
    "id": 2975,
    "mediaId": 2801,
    "date": "2022-01-28",
    "sentence": "Pennsylvania's attorney general, <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor, said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "MARC LEVY",
    "title": "Court throws Pennsylvania's mail-in voting law into doubt"
  },
  {
    "id": 2852,
    "mediaId": 2728,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "Colleen Long",
    "title": "Biden visits collapsed bridge, touts infrastructure law"
  },
  {
    "id": 3139,
    "mediaId": 2728,
    "date": "2022-01-28",
    "sentence": "Pennsylvania’s attorney general, <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor, said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "Marc Levy",
    "title": "Court throws Pennsylvania’s mail-in voting law into doubt"
  },
  {
    "id": 2999,
    "mediaId": 2643,
    "date": "2022-01-28",
    "sentence": "— <span class='selected-term'>Josh Shapiro</span> (@JoshShapiroPA) January 28, 2022\n\"Political campaigns really want to control the message of every event, and if they think the president will distract from their message, they may want to go another way.",
    "author": "Jason Lemon",
    "title": "Prominent Pennsylvania Democrats Snub Biden's Visit Amid Low Approval Ratings"
  },
  {
    "id": 3533,
    "mediaId": 2752,
    "date": "2022-01-28",
    "sentence": "It will be immediately appealed and therefore won’t have any immediate impact on Pennsylvania’s upcoming elections,\" tweeted Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor.",
    "author": "Liz Dye",
    "title": "Pennsylvania Court Decides Mail-In Voting Is Illegal Now That Democrats Are Doing It"
  },
  {
    "id": 2867,
    "mediaId": 2751,
    "date": "2022-01-28",
    "sentence": "Incredible video shows how bridge collapse stopped bus from careening into Pittsburgh ravine\nState Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "",
    "title": "Biden touts infrastructure plan after visiting site of Pittsburgh bridge collapse"
  },
  {
    "id": 3228,
    "mediaId": 2607,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "Associated Press",
    "title": "Biden visits collapsed bridge, touts infrastructure law"
  },
  {
    "id": 3340,
    "mediaId": 2511,
    "date": "2022-01-28",
    "sentence": "The state Supreme Court, which will hear the appeal, has a 5-2 Democratic majority and Pennsylvania’s attorney general <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor, said he is confident the mail-in law will be upheld as constitutional.",
    "author": "",
    "title": "Pennsylvania court strikes down state’s mail-in voting law"
  },
  {
    "id": 3222,
    "mediaId": 2594,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "Via AP news wire",
    "title": "Key Pa. Dems to miss Biden visit, cite scheduling conflicts"
  },
  {
    "id": 2951,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "Governor John Fetterman, who is running for Senate, and Attorney General <span class='selected-term'>Josh Shapiro</span>, who is running for governor, both cited scheduling reasons for not attending Biden's event.",
    "author": "Kevin Liptak and Phil Mattingly",
    "title": "Biden is aiming to hit the road to reset his presidency. He starts with yet another stop in Pennsylvania."
  },
  {
    "id": 2893,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "Both Pennsylvania Lt. Gov, John Fetterman and Attorney General <span class='selected-term'>Josh Shapiro</span> are not slated to appear with Biden, citing scheduling conflicts.",
    "author": "Chris Cillizza",
    "title": "Joe Biden is going to Pennsylvania today. Top Democrats are avoiding him."
  },
  {
    "id": 3368,
    "mediaId": 2594,
    "date": "2022-01-28",
    "sentence": "Pennsylvania's attorney general, <span class='selected-term'>Josh Shapiro</span>, said in a statement the opinion will be immediately appealed and will not have any immediate impact on Pennsylvania’s upcoming elections.",
    "author": "Via AP news wire",
    "title": "Pennsylvania court strikes down expansive mail-in voting law"
  },
  {
    "id": 3396,
    "mediaId": 2560,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "Steve Peoples",
    "title": "Biden visits collapsed bridge, touts infrastructure law"
  },
  {
    "id": 3087,
    "mediaId": 2560,
    "date": "2022-01-28",
    "sentence": "Pennsylvania’s attorney general, <span class='selected-term'>Josh Shapiro</span>, said in a statement the opinion will be immediately appealed and will not have any immediate impact on Pennsylvania’s upcoming elections.",
    "author": "Marc Levy",
    "title": "Pennsylvania court strikes down expansive mail-in voting law"
  },
  {
    "id": 3121,
    "mediaId": 2716,
    "date": "2022-01-28",
    "sentence": "\"This opinion is based on twisted logic and faulty reasoning, and is wrong on the law,\" said state Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat, per Politico.",
    "author": "Brigid Kennedy",
    "title": "Trump praises Pennsylvania ruling against mail-in voting: 'Big news'"
  },
  {
    "id": 3165,
    "mediaId": 2654,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "Steve Peoples",
    "title": "WATCH: Biden visits collapsed bridge in Pennsylvania, touts infrastructure law"
  },
  {
    "id": 3307,
    "mediaId": 2702,
    "date": "2022-01-28",
    "sentence": "A number of other Pennsylvania Democrats, including Attorney General <span class='selected-term'>Josh Shapiro</span>, a gubernatorial candidate, and Lt. Gov.",
    "author": "Lexi Lonas",
    "title": "Bridge collapses in Pittsburgh just hours before Biden infrastructure visit"
  },
  {
    "id": 3224,
    "mediaId": 2732,
    "date": "2022-01-28",
    "sentence": "The court’s opinion said the decision “explains how a system of no-excuse mail-in voting may be constitutionally implemented in the commonwealth and expresses no view on whether such a system should, or should not, be implemented as a matter of public policy.”\nThe 3-2 Republican majority opinion was immediately appealed to the state Supreme Court, said Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Paula Reed Ward",
    "title": "Pa. Commonwealth Court strikes down mail-in voting; State AG's office already filed notice of appeal"
  },
  {
    "id": 2780,
    "mediaId": 2592,
    "date": "2022-01-28",
    "sentence": "Reflecting Biden's currently dimmed political star, one important Democrat from Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, pointedly kept away from the presidential visit, citing a scheduling conflict.",
    "author": "Saul Loeb with Sebastian Smith",
    "title": "At Collapsed Bridge, Biden Envisions Rebuilding America"
  },
  {
    "id": 3316,
    "mediaId": 2570,
    "date": "2022-01-28",
    "sentence": "But a constitutional amendment must be presented to the people and adopted into our fundamental law before legislation authorizing no-excuse mail-in voting can ‘be placed upon our statute books.’”\n“This opinion is based on twisted logic and faulty reasoning, and is wrong on the law,” Pennyslvania Attorney General <span class='selected-term'>Josh Shapiro</span> said Friday, noting the case’s appeal means the ruling “won’t have any immediate impact on Pennsylvania’s upcoming elections.”\nThe Trump campaign and its allies baselessly alleged that mail-in voting in Pennsylvania in the 2020 election led to widespread voter fraud and unsuccessfully challenged the state’s mail-in voting rules at the Supreme Court.",
    "author": "Alison Durkee",
    "title": "Pennsylvania’s Mail-In Voting Law Struck Down"
  },
  {
    "id": 3118,
    "mediaId": 2637,
    "date": "2022-01-28",
    "sentence": "Article content\n<span class='selected-term'>Josh Shapiro</span>, the state’s Democratic attorney general who is running for governor, said it would be appealed.",
    "author": "",
    "title": "Pennsylvania court strikes down state's mail-in voting law"
  },
  {
    "id": 3541,
    "mediaId": 2509,
    "date": "2022-01-28",
    "sentence": "A campaign spokesperson for Attorney General <span class='selected-term'>Josh Shapiro</span> -- who is likely to become the Democratic gubernatorial nominee -- told ABC News the attorney general is \"focused on the issues that matter to Pennsylvania families\" but won't be in Pittsburgh on Friday.",
    "author": "Sarah Kolinovsky",
    "title": "Biden pushes infrastructure law after visiting site of collapsed bridge in Pittsburgh"
  },
  {
    "id": 3499,
    "mediaId": 2514,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "",
    "title": "Biden visits collapsed bridge, touts infrastructure law"
  },
  {
    "id": 3031,
    "mediaId": 6571,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "",
    "title": "Key Pennsylvania Democrats To Miss President Biden's Pittsburgh Visit"
  },
  {
    "id": 2681,
    "mediaId": 8322,
    "date": "2022-01-28",
    "sentence": "Josh Fetterman, the state’s lieutenant governor, who is running for Senate, and gubernatorial candidate <span class='selected-term'>Josh Shapiro</span>, the state’s current attorney general, will both miss Biden’s visit to Mill 19.",
    "author": "Brooke Singman",
    "title": "Biden to tout 'remarkable economic progress' of his administration in Pittsburgh visit"
  },
  {
    "id": 3272,
    "mediaId": 6404,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "Mike LaChance",
    "title": "Some Democrats Are Already Making Excuses To Not Appear In Public With Joe Biden"
  },
  {
    "id": 3434,
    "mediaId": 2721,
    "date": "2022-01-28",
    "sentence": "The 3 foods that GROW cancer [Sponsored]\n“<span class='selected-term'>Josh Shapiro</span> is running to be the governor of Pennsylvania and he’s focused on the issues that matter to Pennsylvania families,” a Shapiro spokesperson told The Associated Press on Friday.",
    "author": "",
    "title": "Burning bridges: Top Dems won’t attend Biden’s visit to Pittsburgh"
  },
  {
    "id": 2809,
    "mediaId": 2641,
    "date": "2022-01-28",
    "sentence": "Another no-show will be state Attorney General <span class='selected-term'>Josh Shapiro</span>, who’s expected to be the Democratic nominee in the state gubernatorial race.",
    "author": "Michael Dorstewitz",
    "title": "Dems Now Avoid Their Biggest Liability — Joe Biden"
  },
  {
    "id": 2924,
    "mediaId": 6571,
    "date": "2022-01-28",
    "sentence": "Pennsylvania's attorney general, <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor, said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "",
    "title": "Pennsylvania Court Declares Expansive Mail-In Voting Law Unconstitutional"
  },
  {
    "id": 2743,
    "mediaId": 2641,
    "date": "2022-01-28",
    "sentence": "John Fetterman, who is running for the U.S. Senate this year, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, who is seeking the Democratic nomination for governor, will not attend due to \"scheduling conflicts,\" their spokespeople told The Associated Press.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Norman to Newsmax: Dems Avoiding 'Toxic' Biden in Pittsburgh"
  },
  {
    "id": 3178,
    "mediaId": 2730,
    "date": "2022-01-28",
    "sentence": "On Thursday evening, Lexi Lonas reported for The Hill that Lieutenant Governor John Fetterman and state Attorney General <span class='selected-term'>Josh Shapiro</span> are among those who will not meet with the president during his visit.",
    "author": "Rebecca Downs",
    "title": "Biden Heads to PA to Tout Infrastructure as Bridge Collapses and State Dems Too Busy to Campaign with Him"
  },
  {
    "id": 3286,
    "mediaId": 2578,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "Jim Hoft",
    "title": "Top Pennsylvania Democrats to Skip Out on Joe Biden’s Visit to Pittsburgh Today — Due to “Scheduling Conflicts”"
  },
  {
    "id": 2841,
    "mediaId": 2562,
    "date": "2022-01-28",
    "sentence": "John Fetterman, who is running for the U.S. Senate this year, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, who is seeking the Democratic nomination for governor, will not attend due to \"scheduling conflicts,\" their spokespeople told The Associated Press.",
    "author": "NationalWatch",
    "title": "Rep. Norman to Newsmax: Dems Avoiding ‘Toxic’ Biden in Pittsburgh"
  },
  {
    "id": 3526,
    "mediaId": 2748,
    "date": "2022-01-28",
    "sentence": "Pennsylvania Lieutenant Governor and U.S. Senate candidate John Fetterman said he had a party meeting 200 miles away on Friday, while state Attorney General and gubernatorial candidate <span class='selected-term'>Josh Shapiro</span> gave no reason other than a scheduling conflict\nThe numbers have Republicans licking their lips in anticipation of sweeping gains in Novembers midterm elections - and Democrats apparently avoiding their party's biggest name.",
    "author": "STATION GOSSIP",
    "title": "Democratic candidates say 'scheduling conflicts' will keep them away from Biden visit to Pittsburgh on Friday, as plunging poll numbers make president an election liability"
  },
  {
    "id": 2679,
    "mediaId": 2572,
    "date": "2022-01-28",
    "sentence": "Two of Pennsylvania's top Democrats, Josh Fetterman, the state’s lieutenant governor, who is running for Senate, and gubernatorial candidate <span class='selected-term'>Josh Shapiro</span>, the state’s attorney general, will miss the president's visit because of scheduling conflicts.",
    "author": "Emmett Jones",
    "title": "Pittsburgh bridge collapse causes massive gas leak leaving 4 hospitalized ahead of Biden's visit"
  },
  {
    "id": 2998,
    "mediaId": 2574,
    "date": "2022-01-28",
    "sentence": "Pennsylvania attorney general <span class='selected-term'>Josh Shapiro</span> (D.), a gubernatorial candidate, will also miss the event.",
    "author": "Chuck Ross",
    "title": "Biden Emerges as Dividing Line for Dems in Pennsylvania Senate Primary"
  },
  {
    "id": 3088,
    "mediaId": 2570,
    "date": "2022-01-28",
    "sentence": "The Pennsylvania certificate, for instance, says the GOP officials may “ultimately be recognized” as the “duly elected and qualified electors” in the event of a court order “or other proceeding prescribed by law.” Pennsylvania AG <span class='selected-term'>Josh Shapiro</span> told CNN that means the state couldn’t prosecute the GOP electors for committing forgery, as other states might be able to do.",
    "author": "Alison Durkee",
    "title": "Fake GOP Electors Subpoenaed By January 6 Committee"
  },
  {
    "id": 2735,
    "mediaId": 2592,
    "date": "2022-01-28",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> says the ruling will be immediately appealed to the state supreme court.",
    "author": "Ben Scheffer",
    "title": "Pennsylvania Law Rules Mail-In Voting Law Unconstitutional"
  },
  {
    "id": 3520,
    "mediaId": 2514,
    "date": "2022-01-28",
    "sentence": "",
    "author": "",
    "title": "Pennsylvania court strikes down state's mail-in voting law"
  },
  {
    "id": 2775,
    "mediaId": 2621,
    "date": "2022-01-28",
    "sentence": "John Fetterman (D) and Attorney General <span class='selected-term'>Josh Shapiro</span> (D) were scheduled to miss the event, though Fetterman ultimately attended.",
    "author": "Michael Luciano",
    "title": "The Five Takes Glee in Democrats Not Appearing with Biden: ‘Entirely Ghosting the President’"
  },
  {
    "id": 2786,
    "mediaId": 2592,
    "date": "2022-01-28",
    "sentence": "Reflecting Biden's currently dimmed political star, one important Democrat from Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, pointedly kept away from the presidential visit, citing a scheduling conflict.",
    "author": "Saul Loeb with Sebastian Smith",
    "title": "At Collapsed Bridge, Biden Envisions Rebuilding America"
  },
  {
    "id": 2877,
    "mediaId": 2714,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to his spokesperson.",
    "author": "",
    "title": "Biden visits collapsed bridge, touts infrastructure law"
  },
  {
    "id": 3180,
    "mediaId": 2553,
    "date": "2022-01-28",
    "sentence": "Wolf and the state’s Attorney General <span class='selected-term'>Josh Shapiro</span> (D) pledged to appeal the ruling to Pennsylvania’s Supreme Court.",
    "author": "Tim Meads",
    "title": "Pennsylvania Court Rules State’s Mail-In-Voting Law Is ‘Unconstitutional’"
  },
  {
    "id": 3351,
    "mediaId": 2551,
    "date": "2022-01-28",
    "sentence": "+23\nView gallery\n+23\nView gallery\nPennsylvania Lieutenant Governor and U.S. Senate candidate John Fetterman (left) and Attorney General and gubernatorial candidate <span class='selected-term'>Josh Shapiro</span> (right) said they planned to skip Biden's event, but now Fetterman will be in Pittsburgh due to the bridge collapse\n+23\nView gallery\nThe president is visiting Mill 19, a converted steel mill that houses Carnegie Mellon University's Manufacturing Futures Institute\n+23\nView gallery\nMill 19 was built circa 1943 by Jones & Laughlin to house munitions production during World War II\n+23\nView gallery\nThe first building of the new Hazelwood Green development, Mill 19, once served as the location of the Pittsburgh region's most productive steel mills\nBREAK DOWN OF THE $1.2T BIPARTISAN INFRASTRUCTURE BILL\nPresident Joe Biden signed the bipartisan infrastructure package into law in mid-November and is now traveling around the country touting its benefits.",
    "author": "Rob Crilly",
    "title": "Biden resurrects his Build Back Better bill in Pittsburgh"
  },
  {
    "id": 3080,
    "mediaId": 2589,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "Ed Morrissey",
    "title": "BREAKING: Pittsburgh bridge collapses ahead of Biden visit; Update: Visit still on, says WH"
  },
  {
    "id": 3398,
    "mediaId": 2656,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of “scheduling conflicts,” according to their spokespeople.",
    "author": "Rick Moran",
    "title": "Key Pennsylvania Democrats Decline the Honor of Appearing With Biden During His Visit"
  },
  {
    "id": 2776,
    "mediaId": 2641,
    "date": "2022-01-28",
    "sentence": "Reflecting Biden's currently dimmed political star, one important Democrat from Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, pointedly kept away from the presidential visit, citing a scheduling conflict.",
    "author": "",
    "title": "Biden Visits Collapsed Bridge, Touts Infrastructure Law"
  },
  {
    "id": 3304,
    "mediaId": 2562,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "NationalWatch",
    "title": "Biden Visits Collapsed Bridge, Touts Infrastructure Law"
  },
  {
    "id": 2682,
    "mediaId": 2573,
    "date": "2022-01-28",
    "sentence": "But despite being invited, Democratic Attorney General <span class='selected-term'>Josh Shapiro</span> and Lt. Gov.",
    "author": "Sam Dorman",
    "title": "GOP politicians slam Biden as he visits Pittsburgh to promote infrastructure package"
  },
  {
    "id": 3008,
    "mediaId": 2580,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "Associated Press",
    "title": "Top Pa. Dems too busy for Biden visit, cite scheduling conflicts"
  },
  {
    "id": 3143,
    "mediaId": 2618,
    "date": "2022-01-28",
    "sentence": "Infrastructure is desperately needed, but I wouldn’t trust for a minute that money allocated by Democrats will go to the things that need infrastructure help.But Biden faced a different problem when he arrived — while some Democrats were in attendance to greet him, people like State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, were not there to meet with him because of “scheduling conflicts.”",
    "author": "Nick Arama",
    "title": "Biden's Brain Turns to Confetti in Real Time During PA Remarks"
  },
  {
    "id": 2832,
    "mediaId": 2724,
    "date": "2022-01-28",
    "sentence": "John Fetterman, running for Senate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, running for governor, have encountered “scheduling conflicts” and will miss President Biden’s visit to Pittsburgh today where he will discuss infrastructure.",
    "author": "Rusty Weiss",
    "title": "Report: Democrat Candidates Are Hidin’ From Biden As Poll Numbers Continue To Crater"
  },
  {
    "id": 3345,
    "mediaId": 2674,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat, was also quick to react to the ruling, pledging that an appeal would be filed soon and saying the decision was based on “twisted logic” and “faulty reasoning.”",
    "author": "",
    "title": "Court deems mail-in voting law unconstitutional"
  },
  {
    "id": 3236,
    "mediaId": 8401,
    "date": "2022-01-28",
    "sentence": "Pennsylvania’s attorney general, <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor, said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "",
    "title": "Court Throws Pennsylvania’s Mail-In Voting Law Into Doubt"
  },
  {
    "id": 3269,
    "mediaId": 2668,
    "date": "2022-01-28",
    "sentence": "But Biden faced a different problem when he arrived — while some Democrats were in attendance to greet him, people like State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, were not there to meet with him because of “scheduling conflicts.” Lt. Gov.",
    "author": "Nick Arama",
    "title": "Biden's Brain Turns to Confetti in Real Time During PA Remarks"
  },
  {
    "id": 3494,
    "mediaId": 8493,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "WKOK Staff",
    "title": "PA Headlines: Maps Examined by Courts, Pres. Biden in Pittsburgh"
  },
  {
    "id": 3365,
    "mediaId": 8500,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "The Associated Press",
    "title": "President Biden discusses infrastructure in Pittsburgh after bridge collapse"
  },
  {
    "id": 3285,
    "mediaId": 8380,
    "date": "2022-01-28",
    "sentence": "Pennsylvania's attorney general, <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor, said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "Marc Levy",
    "title": "Court Throws Pennsylvania's Mail-In Voting Law Into Doubt"
  },
  {
    "id": 3475,
    "mediaId": 8412,
    "date": "2022-01-28",
    "sentence": "",
    "author": "",
    "title": "Varney on Biden's Pennsylvania trip: The party is walking away from its leader"
  },
  {
    "id": 2870,
    "mediaId": 8469,
    "date": "2022-01-28",
    "sentence": "Pennsylvania’s attorney general, <span class='selected-term'>Josh Shapiro</span>, said in a statement the opinion will be immediately appealed and will not have any immediate impact on Pennsylvania’s upcoming elections.",
    "author": "",
    "title": "Pennsylvania court strikes down expansive mail-in voting law"
  },
  {
    "id": 3132,
    "mediaId": 8393,
    "date": "2022-01-28",
    "sentence": "The Department added that they are “notifying all county election boards that they should proceed with all primary election preparations as they were before today’s Commonwealth Court ruling.”\nPennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who is also running for Governor, tweeted that he is “confident that Act 77 will ultimately be upheld as constitutional.”\nThe court’s ruling and opinion issued by President Judge Emerita Mary Hannah Leavitt can be read below:\nIn 2019 Governor Tom Wolf said Act 77 made voting “more convenient and more secure for millions of Pennsylvanians.”\nJust over 2.5 million people voted under the law in 2020's presidential election, most of them Democrats, out of 6.9 million total cast.",
    "author": "George Stockburger",
    "title": "Court finds Pennsylvania mail-in voting law unconstitutional, appeal anticipated"
  },
  {
    "id": 3550,
    "mediaId": 8409,
    "date": "2022-01-28",
    "sentence": "Pennsylvania’s attorney general, <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor, said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "Associated Press",
    "title": "Court throws Pennsylvania’s mail-in voting law into doubt"
  },
  {
    "id": 2968,
    "mediaId": 8467,
    "date": "2022-01-28",
    "sentence": "",
    "author": "Associated Press",
    "title": "Court throws Pennsylvania’s mail-in voting law into doubt"
  },
  {
    "id": 3290,
    "mediaId": 8481,
    "date": "2022-01-28",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "The Associated Press",
    "title": "Biden visits collapsed bridge, touts infrastructure law"
  },
  {
    "id": 3406,
    "mediaId": 8469,
    "date": "2022-01-28",
    "sentence": "Pennsylvania’s attorney general, <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor, said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "MARC LEVY",
    "title": "Court throws Pennsylvania’s mail-in voting law into doubt"
  },
  {
    "id": 2941,
    "mediaId": 8322,
    "date": "2022-01-28",
    "sentence": "John Fetterman, the state’s lieutenant governor, and <span class='selected-term'>Josh Shapiro</span>, the attorney general, will both miss the president’s visit to Mill 19, a research and development center.",
    "author": "",
    "title": "Top Pennsylvania Dems can’t meet Biden due to scheduling conflict"
  },
  {
    "id": 3486,
    "mediaId": 2632,
    "date": "2022-01-28",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, was absent because of scheduling conflicts, according to his spokesperson.",
    "author": "",
    "title": "Biden Visits Collapsed Bridge, Touts Infrastructure Law"
  },
  {
    "id": 2943,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor this fall, slammed the decision, saying it was “based on twisted logic and faulty reasoning and is wrong on the law.”\n“It will be immediately appealed and therefore won’t have any immediate impact on Pennsylvania’s upcoming elections.",
    "author": "Dianne Gallagher",
    "title": "Pennsylvania court declares state’s no-excuse absentee voting law unconstitutional"
  },
  {
    "id": 3268,
    "mediaId": 8380,
    "date": "2022-01-29",
    "sentence": "Democrats had an easier time endorsing <span class='selected-term'>Josh Shapiro</span>, the state's two-term attorney general, in a unanimous voice vote against no competition.",
    "author": "Marc Levy",
    "title": "Pennsylvania Democrats Deadlock on Endorsing in Senate Race"
  },
  {
    "id": 2890,
    "mediaId": 2736,
    "date": "2022-01-29",
    "sentence": "— AG <span class='selected-term'>Josh Shapiro</span> (@PAAttorneyGen) January 28, 2022\nIn summary, the lower court is saying that the state constitution needs to be amended and these changes can’t be implemented with legislation alone:\nThe court notably isn’t saying mail voting is “bad” in some way — this is about the PA Constitution’s requirements for voting; how those requirements were interpreted in past cases; and how Act 77 changed election law.",
    "author": "Greg P.",
    "title": "Donald Trump takes a victory lap after the Pennsylvania Commonwealth Court rules Act 77 unconstitutional"
  },
  {
    "id": 3082,
    "mediaId": 2748,
    "date": "2022-01-29",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "Women System",
    "title": "Democrats Are Already Making Excuses To Not Appear In Public With Joe Biden"
  },
  {
    "id": 3063,
    "mediaId": 2748,
    "date": "2022-01-29",
    "sentence": "John Fetterman and Attorney General <span class='selected-term'>Josh Shapiro</span> — the leading Democratic candidates for senator and governor, respectively — declined to join Biden during the visit, citing scheduling conflicts.",
    "author": "STATION GOSSIP",
    "title": "Pennsylvania Dem Hopefuls Don't Want Anything to Do With Biden as President Visits State"
  },
  {
    "id": 2711,
    "mediaId": 2572,
    "date": "2022-01-29",
    "sentence": "Prominent Pennsylvania Democrats Lieutenant Governor John Fetterman and Attorney General <span class='selected-term'>Josh Shapiro</span> declined to appear in a photo-op with Biden during his visit to the state this week.",
    "author": "Peter Aitken",
    "title": "DNC chair reportedly looking to leave amid tensions with Biden White House"
  },
  {
    "id": 3341,
    "mediaId": 6571,
    "date": "2022-01-29",
    "sentence": "Democrats had an easier time endorsing <span class='selected-term'>Josh Shapiro</span>, the state's two-term attorney general, in a unanimous voice vote against no competition.",
    "author": "",
    "title": "Pa. Democrats Deadlocked On Endorsement For U.S. Senate Primary"
  },
  {
    "id": 2737,
    "mediaId": 2658,
    "date": "2022-01-29",
    "sentence": "The state’s Democratic Party endorsed Attorney General <span class='selected-term'>Josh Shapiro</span> for governor and state Rep. Austin Davis for lieutenant governor.",
    "author": "",
    "title": "Pennsylvania Dems decline to endorse in Senate primary"
  },
  {
    "id": 3053,
    "mediaId": 8489,
    "date": "2022-01-29",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, who previously served as a state representative and a Montgomery County commissioner, is the only major candidate running for the Democratic nomination.",
    "author": "Katie Meyer",
    "title": "Split among 4 candidates, Pa. Democrats fail to endorse one for U.S. Senate"
  },
  {
    "id": 3185,
    "mediaId": 8469,
    "date": "2022-01-29",
    "sentence": "Democrats had an easier time endorsing <span class='selected-term'>Josh Shapiro</span>, the state’s two-term attorney general, in a unanimous voice vote against no competition.",
    "author": "MARC LEVY",
    "title": "Pennsylvania Democrats deadlock on endorsing in Senate race"
  },
  {
    "id": 3065,
    "mediaId": 8493,
    "date": "2022-01-30",
    "sentence": "Democrats had an easier time endorsing <span class='selected-term'>Josh Shapiro</span>, the state’s two-term attorney general, in a unanimous voice vote against no competition.",
    "author": "WKOK Staff",
    "title": "AP: Lamb Garners Most Votes in Straw Poll For Dem’s Endorsement"
  },
  {
    "id": 3457,
    "mediaId": 8254,
    "date": "2022-01-30",
    "sentence": "The state Democratic committee endorsed Attorney General <span class='selected-term'>Josh Shapiro</span> for governor and State Rep. Austin Davis for lieutenant governor, both in the first round of voting.",
    "author": "Sanika Bhargaw",
    "title": "Pennsylvania Democrats unable to endorse candidate for U.S. Senate"
  },
  {
    "id": 3177,
    "mediaId": 2732,
    "date": "2022-01-30",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> has vowed to appeal the ruling to the state Supreme Court.",
    "author": "",
    "title": "Editorial: Logical failings with Act 77 challenge, court ruling"
  },
  {
    "id": 2947,
    "mediaId": 6404,
    "date": "2022-01-30",
    "sentence": "Trending: CNN+ Employees Furious That They’re Only Being Offered 90 Days To 6 Months Of Severance Pay\nProminent Pennsylvania Democrats Lieutenant Governor John Fetterman and Attorney General <span class='selected-term'>Josh Shapiro</span> declined to appear in a photo-op with Biden during his visit to the state this week.",
    "author": "Mike LaChance",
    "title": "DNC Chair Reportedly Considering Stepping Down Due To Frustration With Biden White House"
  },
  {
    "id": 3107,
    "mediaId": 8500,
    "date": "2022-01-31",
    "sentence": "Democrats had an easier time endorsing <span class='selected-term'>Josh Shapiro</span>, the state's two-term attorney general, in a unanimous voice vote against no competition.",
    "author": "MARC LEVY Associated Press",
    "title": "Pennsylvania Democrats deadlock on endorsing in Senate race"
  },
  {
    "id": 3205,
    "mediaId": 8449,
    "date": "2022-01-31",
    "sentence": "A los demócratas les resultó más fácil respaldar a <span class='selected-term'>Josh Shapiro</span>, el fiscal general del estado durante dos mandatos, en un voto unánime contra la no competencia.",
    "author": "",
    "title": "Demócratas estancados en el respaldo de la contienda por el Senado"
  },
  {
    "id": 3441,
    "mediaId": 8449,
    "date": "2022-01-31",
    "sentence": "El fiscal general de Pensilvania, <span class='selected-term'>Josh Shapiro</span>, un demócrata que se postula para gobernador, dijo que confía en que la Corte Suprema del estado mantendrá la ley de votación por correo como constitucional.",
    "author": "",
    "title": "Tribunal pone en duda la ley de votación por correo"
  },
  {
    "id": 3173,
    "mediaId": 8493,
    "date": "2022-01-31",
    "sentence": "HARRISBURG – While the state Democratic Committee couldn’t agree on an endorsement for the US Senate candidates in Pennsylvania, the current state Attorney General <span class='selected-term'>Josh Shapiro</span> easily won the party’s endorsement for governor of Pennsylvania.",
    "author": "WKOK Staff",
    "title": "PA Headlines: State Democrats Endorse Josh Shapiro for Governor"
  },
  {
    "id": 3390,
    "mediaId": 8500,
    "date": "2022-01-31",
    "sentence": "PITTSBURGH —\nA group of nearly 100 people from various faith and community organizations sent a letter to state and federal law enforcement agencies, requesting the investigation into Peter Spencer's death be handed over to the State Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Kalea Gunderson",
    "title": "Faith, community organizations request changes to investigation of Peter Spencer's death"
  },
  {
    "id": 2705,
    "mediaId": 2658,
    "date": "2022-01-31",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat running for governor, said the ruling will be appealed.",
    "author": "",
    "title": "The FEC reports we can’t wait to see"
  },
  {
    "id": 3252,
    "mediaId": 2732,
    "date": "2022-02-01",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, the presumed Democratic candidate for governor, has endorsed Pittsburgh-area lawmaker Austin Davis as his running mate.",
    "author": "Julia Felton",
    "title": "Former state Rep. Jeff Coleman running for lieutenant governor"
  },
  {
    "id": 3183,
    "mediaId": 8481,
    "date": "2022-02-01",
    "sentence": "WTAJ– Attorney General <span class='selected-term'>Josh Shapiro</span> is looking to fill vacancies in Pennsylvania police departments and is outlining incentives to bring in more officers.",
    "author": "Aaron Marrie",
    "title": "Shapiro looks to fill police vacancies across the state"
  },
  {
    "id": 3030,
    "mediaId": 8438,
    "date": "2022-02-01",
    "sentence": "“Our campaign created this website to help give citizens a voice who are fed up with Krasner.”\nBarletta wants end to flights of illegals to PA\nLou Barletta, Republican candidate for governor, called on the General Assembly to pass a resolution demanding that Attorney General <span class='selected-term'>Josh Shapiro</span> file a lawsuit against the Biden administration for violations of the Refugee Act of 1980.",
    "author": "South Philly Review -",
    "title": "Briefs: February 1st, 2022"
  },
  {
    "id": 3245,
    "mediaId": 8380,
    "date": "2022-02-01",
    "sentence": "The Democratic Party's endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2022 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "Marc Levy",
    "title": "Democrat Shapiro Sets Campaign Cash Record in Race for Pa. Governor"
  },
  {
    "id": 2791,
    "mediaId": 2573,
    "date": "2022-02-01",
    "sentence": "So, when Biden visited Pennsylvania earlier today, two of the three leading state Democrats, Lieutenant Governor John Fetterman, who's a leading Senate candidate and State Attorney General <span class='selected-term'>Josh Shapiro</span>, likely Dem nominee for the governorship kept him at arm's length.",
    "author": "Fox News Staff",
    "title": "'The Ingraham Angle' on COVID mandates, Minnie Mouse's makeover"
  },
  {
    "id": 2796,
    "mediaId": 2641,
    "date": "2022-02-02",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> said in a release that his office charged Energy Transfer's ETC Northeast Pipeline LLC unit with two counts of discharging industrial waste, two counts of discharging other pollutants, two counts of potential pollution and three counts of unlawful conduct.",
    "author": "",
    "title": "Energy Transfer Charged With Environmental Crimes in Pennsylvania"
  },
  {
    "id": 2683,
    "mediaId": 2573,
    "date": "2022-02-02",
    "sentence": "Tom Wolf, Attorney General <span class='selected-term'>Josh Shapiro</span>, Sen. Bob Casey, D-Pa., Rep. Mary Gay Scanlon, D-Pa., and Rep. Dwight Evans, D-Pa., did not respond to Fox News' request for comment.",
    "author": "",
    "title": "GOP politicians say University of Pittsburgh fetal tissue probe a 'whitewash' and not nearly sufficient"
  },
  {
    "id": 3544,
    "mediaId": 8401,
    "date": "2022-02-02",
    "sentence": "HARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2022 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "",
    "title": "Pennsylvania Attorney General Josh Shapiro Sets Campaign Cash Record To Start Election Year"
  },
  {
    "id": 3114,
    "mediaId": 8401,
    "date": "2022-02-02",
    "sentence": "",
    "author": "",
    "title": "State Sen. Jake Corman Joins FOP In Calling For Philadelphia DA Larry Krasner’s Impeachment"
  },
  {
    "id": 2919,
    "mediaId": 8401,
    "date": "2022-02-02",
    "sentence": "",
    "author": "",
    "title": "Pennsylvania Supreme Court To Decide Congressional District Map"
  },
  {
    "id": 3000,
    "mediaId": 8481,
    "date": "2022-02-02",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat, has said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "The Associated Press",
    "title": "Arguments set for March on Pennsylvania’s mail-in voting law"
  },
  {
    "id": 3215,
    "mediaId": 8500,
    "date": "2022-02-02",
    "sentence": "HARRISBURG, Pa. (AP) —\nThe Democratic Party's endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2022 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "MARC LEVY Associated Press",
    "title": "Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 2912,
    "mediaId": 8500,
    "date": "2022-02-02",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat, has said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "",
    "title": "Arguments set for March on Pennsylvania's mail-in voting law"
  },
  {
    "id": 2763,
    "mediaId": 8254,
    "date": "2022-02-02",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat, has said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "AP",
    "title": "Arguments set for March on Pennsylvania’s mail-in voting law"
  },
  {
    "id": 2976,
    "mediaId": 8504,
    "date": "2022-02-02",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat, has said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "AP",
    "title": "Arguments set for March on Pennsylvania’s mail-in voting law"
  },
  {
    "id": 3442,
    "mediaId": 8481,
    "date": "2022-02-02",
    "sentence": "The “explosion happened because of Energy Transfer’s negligence as they built the Revolution pipeline,” Attorney General <span class='selected-term'>Josh Shapiro</span> said in a written statement.",
    "author": "The Associated Press",
    "title": "Company faces criminal charges over pipeline explosion"
  },
  {
    "id": 3483,
    "mediaId": 8467,
    "date": "2022-02-02",
    "sentence": "By MARC LEVY\nHARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2021 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "Associated Press",
    "title": "Pennsylvania Attorney General Josh Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 2931,
    "mediaId": 8468,
    "date": "2022-02-02",
    "sentence": "HARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2021 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "Associated Press",
    "title": "Pennsylvania Attorney General Josh Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 3212,
    "mediaId": 8356,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Teresa Boeckel",
    "title": "Primary 2022: Hot races for governor, U.S. Senate, plus what you need to know about voting"
  },
  {
    "id": 3309,
    "mediaId": 8409,
    "date": "2022-02-02",
    "sentence": "By MARC LEVY\nHARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2021 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "Associated Press",
    "title": "Pennsylvania Attorney General Josh Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 2942,
    "mediaId": 8437,
    "date": "2022-02-02",
    "sentence": "HARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2021 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "Associated Press",
    "title": "Pennsylvania Attorney General Josh Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 2868,
    "mediaId": 8469,
    "date": "2022-02-02",
    "sentence": "HARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2021 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "MARC LEVY",
    "title": "Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 2851,
    "mediaId": 8305,
    "date": "2022-02-02",
    "sentence": "HARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2021 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "Associated Press",
    "title": "Pennsylvania Attorney General Josh Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 2986,
    "mediaId": 8270,
    "date": "2022-02-02",
    "sentence": "HARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2021 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "Associated Press",
    "title": "Pennsylvania Attorney General Josh Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 3110,
    "mediaId": 8500,
    "date": "2022-02-02",
    "sentence": "",
    "author": "MARC LEVY Associated Press",
    "title": "Millions follow rich candidates in Pennsylvania Senate race"
  },
  {
    "id": 3426,
    "mediaId": 8449,
    "date": "2022-02-02",
    "sentence": "",
    "author": "",
    "title": "Josh Shapiro: “Nuestra democracia está siendo amenazada”"
  },
  {
    "id": 2733,
    "mediaId": 8254,
    "date": "2022-02-02",
    "sentence": "HARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2022 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "Marc Levy",
    "title": "Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 3391,
    "mediaId": 8481,
    "date": "2022-02-02",
    "sentence": "HARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2021 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "The Associated Press",
    "title": "Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 2980,
    "mediaId": 8254,
    "date": "2022-02-02",
    "sentence": "",
    "author": "George Stockburger",
    "title": "Gov. Wolf announces $1.7B plan for pandemic recovery with direct payments to some Pennsylvanians"
  },
  {
    "id": 3221,
    "mediaId": 2732,
    "date": "2022-02-02",
    "sentence": "“I know that <span class='selected-term'>Josh Shapiro</span> will be an extension of the disastrous Wolf administration, pandering to liberal interest groups and further wrecking an already wounded state economy,” DelRosso said.",
    "author": "Ryan Deto",
    "title": "State Rep. Carrie DelRosso announces run for lieutenant governor"
  },
  {
    "id": 2958,
    "mediaId": 2509,
    "date": "2022-02-02",
    "sentence": "The “explosion happened because of Energy Transfer’s negligence as they built the Revolution pipeline,” Attorney General <span class='selected-term'>Josh Shapiro</span> said in a written statement.",
    "author": "MICHAEL RUBINKAM Associated Press",
    "title": "Company faces criminal charges over pipeline explosion"
  },
  {
    "id": 2755,
    "mediaId": 2590,
    "date": "2022-02-02",
    "sentence": "“Public information must be tempered with the obligation of a complete and thorough investigation.”\nNearly 100 faith and community leaders sent a letter to local and state authorities urging that the investigation be handled by state Attorney General <span class='selected-term'>Josh Shapiro</span>, according to WTAE-TV.",
    "author": "",
    "title": "Jamaican Killed On Camping Trip To Be Honored At Pittsburgh Vigil"
  },
  {
    "id": 3122,
    "mediaId": 2679,
    "date": "2022-02-02",
    "sentence": "The “explosion happened because of Energy Transfer’s negligence as they built the Revolution pipeline,” Attorney General <span class='selected-term'>Josh Shapiro</span> said in a written statement.",
    "author": "MICHAEL RUBINKAM",
    "title": "Company faces criminal charges over pipeline explosion"
  },
  {
    "id": 3481,
    "mediaId": 2732,
    "date": "2022-02-03",
    "sentence": "I can feel our campaign’s momentum growing by the day, and I know we are ready to take on and defeat career politician <span class='selected-term'>Josh Shapiro</span> this November.”\nShapiro, Pennsylvania’s attorney general, is the presumed Democratic gubernatorial nominee.",
    "author": "",
    "title": "Last of GOP regional straw polls hand victories to Bartos, White for U.S. Senate, governor"
  },
  {
    "id": 3073,
    "mediaId": 8400,
    "date": "2022-02-03",
    "sentence": "However, in looking at the “paper of record” and largest broadcast news shows, you can’t help but wonder why Mayor Jim Kenney, Commissioner Danielle Outlaw, Attorney General <span class='selected-term'>Josh Shapiro</span>, and DA Larry Krasner have avoided any hard questions regarding their culpability for the city’s record homicide rate.",
    "author": "",
    "title": "Record Homicides: Ranking who should be held accountable"
  },
  {
    "id": 2857,
    "mediaId": 8493,
    "date": "2022-02-03",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat, has said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "WKOK Staff",
    "title": "PA Deadlines: State Supreme Court Will Hear Mail-In Voting Testimony"
  },
  {
    "id": 3490,
    "mediaId": 8314,
    "date": "2022-02-03",
    "sentence": "Brian’s opponent in the race, Austin Davis, was endorsed by <span class='selected-term'>Josh Shapiro</span>, the Democratic candidate for Governor.",
    "author": "Mark Segal",
    "title": "A look at the two gay candidates running statewide"
  },
  {
    "id": 2899,
    "mediaId": 6571,
    "date": "2022-02-03",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat, has said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "",
    "title": "Arguments Set For March On Pennsylvania's Mail-In Voting Law"
  },
  {
    "id": 2970,
    "mediaId": 2748,
    "date": "2022-02-03",
    "sentence": "John Fetterman and state Attorney General <span class='selected-term'>Josh Shapiro</span>, respectively — declined to join the president.",
    "author": "STATION GOSSIP",
    "title": "POTUS Suffers Black Eye When Top Dem is Asked if Lefties Should Run as 'Biden Democrats' in 2022"
  },
  {
    "id": 2700,
    "mediaId": 8322,
    "date": "2022-02-03",
    "sentence": "And last week, Pennsylvania Senate candidate John Fetterman and Pennsylvania gubernatorial candidate <span class='selected-term'>Josh Shapiro</span>, who currently serves as the state’s attorney general, both refused Biden’s invitation to join him in Pittsburgh, also citing scheduling conflicts.",
    "author": "Brooke Singman",
    "title": "Biden to meet with New York City Mayor Eric Adams amid surge in violent crime"
  },
  {
    "id": 3229,
    "mediaId": 6404,
    "date": "2022-02-04",
    "sentence": "Several high-profile Democratic candidates have already skipped out on appearing with Biden, including Georgia gubernatorial candidate Stacey Abrams and Pennsylvania Democrats John Fetterman and <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Mike LaChance",
    "title": "Democrat Candidate for Texas Governor Beto O’Rourke ‘Not Interested’ In Help From Joe Biden"
  },
  {
    "id": 2159,
    "mediaId": 6571,
    "date": "2022-02-04",
    "sentence": "They had asked the court to rule that Attorney General <span class='selected-term'>Josh Shapiro</span> has no authority to bind them to the settlement.",
    "author": "",
    "title": "Allegheny, Philadelphia DAs Lose Round In Opioid Settlement Suit"
  },
  {
    "id": 2245,
    "mediaId": 8401,
    "date": "2022-02-04",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> announced on Friday that Bryan Johnson, Dajuan Coffee, and Quadir Burley have each been arrested and charged with multiple counts of illegal transfer for a firearm, conspiracy, and other related offenses.",
    "author": "",
    "title": "3 Men Arrested In Philadelphia For Allegedly Straw Purchasing, Trafficking 19 Firearms, Officials Say"
  },
  {
    "id": 2610,
    "mediaId": 8401,
    "date": "2022-02-04",
    "sentence": "They had asked the court to rule that Attorney General <span class='selected-term'>Josh Shapiro</span> has no authority to bind them to the settlement.",
    "author": "",
    "title": "Philadelphia, Pittsburgh District Attorneys Lose Round In Opioid Settlement Suit"
  },
  {
    "id": 3534,
    "mediaId": 8469,
    "date": "2022-02-04",
    "sentence": "That’s how the office of Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> on Thursday characterized actions by state Republicans who planned to nominate their own electors following the 2020 presidential election in which their candidate lost.",
    "author": "Bill OBoyle boboyle@timesleader.com",
    "title": "Shapiro’s office: GOP elector plan not illegal, but misleading"
  },
  {
    "id": 2163,
    "mediaId": 8305,
    "date": "2022-02-04",
    "sentence": "",
    "author": "Associated Press",
    "title": "GOP’s election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2236,
    "mediaId": 8467,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "Associated Press",
    "title": "GOP’s election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 1973,
    "mediaId": 8427,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "Associated Press",
    "title": "GOP’s election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2507,
    "mediaId": 8270,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "Associated Press",
    "title": "GOP’s election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2363,
    "mediaId": 8409,
    "date": "2022-02-04",
    "sentence": "",
    "author": "Associated Press",
    "title": "GOP’s election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2134,
    "mediaId": 8500,
    "date": "2022-02-04",
    "sentence": "",
    "author": "",
    "title": "Arkoosh ends Senate campaign amid tough Democratic field"
  },
  {
    "id": 2267,
    "mediaId": 8437,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "Associated Press",
    "title": "GOP’s election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2351,
    "mediaId": 8469,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "MARC LEVY",
    "title": "GOP’s election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2201,
    "mediaId": 8253,
    "date": "2022-02-04",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> announced the charges against 24-year-old Bryan Johnson, 21-year-old Dajuan Coffee and 23-year-old Quadir Burley on Friday.",
    "author": "",
    "title": "3 men charged with trafficking guns in Philadelphia"
  },
  {
    "id": 2030,
    "mediaId": 8469,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "Marc Levy Associated Press",
    "title": "GOP’s Pa. election inquiry keeps getting more expensive"
  },
  {
    "id": 2459,
    "mediaId": 8404,
    "date": "2022-02-04",
    "sentence": "They had asked the court to rule that Attorney General <span class='selected-term'>Josh Shapiro</span> has no authority to bind them to the settlement.",
    "author": "Associated Press",
    "title": "Philly, Pittsburgh DAs lose round in opioid settlement suit"
  },
  {
    "id": 1958,
    "mediaId": 2514,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "MARC LEVY",
    "title": "GOP's election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2674,
    "mediaId": 2732,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "Associated Press",
    "title": "GOP's Pennsylvania election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2637,
    "mediaId": 2679,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "MARC LEVY",
    "title": "GOP’s election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2220,
    "mediaId": 2560,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "Marc Levy",
    "title": "GOP’s election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2046,
    "mediaId": 2515,
    "date": "2022-02-04",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "MARC LEVY",
    "title": "GOP’s election inquiry: Courts, conspiracies and more costs"
  },
  {
    "id": 2429,
    "mediaId": 8402,
    "date": "2022-02-04",
    "sentence": "Pennsylvania’s attorney general, <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running for governor, said he is confident the state Supreme Court will uphold the mail-in voting law as constitutional.",
    "author": "Philadelphia Sun Staff",
    "title": "Court throws Pennsylvania’s mail-in voting law into doubt"
  },
  {
    "id": 2177,
    "mediaId": 8469,
    "date": "2022-02-05",
    "sentence": "This week Barletta hit the news again with state Attorney General <span class='selected-term'>Josh Shapiro</span> making statements about the “alternate electors” effort undertaken by Republicans in several states, including Pennsylvania.",
    "author": "",
    "title": "Our view: It’s time for Barletta to admit Biden won"
  },
  {
    "id": 2343,
    "mediaId": 2658,
    "date": "2022-02-05",
    "sentence": "A lower court ruling last week agreed that it was unconstitutional — a decision immediately appealed by Wolf and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee to succeed the term-limited Wolf as governor.",
    "author": "",
    "title": "GOP takes mail voting to court in swing states Biden won"
  },
  {
    "id": 2329,
    "mediaId": 8380,
    "date": "2022-02-05",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "Marc Levy",
    "title": "Pa. GOP's Election Inquiry: Courts, Conspiracies and More Costs"
  },
  {
    "id": 2128,
    "mediaId": 8409,
    "date": "2022-02-05",
    "sentence": "The disrespect for officers is a direct result of despicable politicians like Chrissy Houlahan, Madeleine Dean, <span class='selected-term'>Josh Shapiro</span>, and Kamala Harris who take the side of criminals.",
    "author": "For Medianews Group",
    "title": "The Mercury’s Sound Off for Saturday, February 5"
  },
  {
    "id": 2009,
    "mediaId": 8409,
    "date": "2022-02-05",
    "sentence": "WEST CHESTER — When Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> announced last month that all the state’s counties signed on to the massive, historic settlement of opioid litigation that will bring more than $1 billion for drug treatment and prevention, there was additionally good news for Chester County.",
    "author": "Michael P Rellahan",
    "title": "Chester County’s share of opioid settlement ‘pot’ grows to $19 million"
  },
  {
    "id": 2466,
    "mediaId": 2834,
    "date": "2022-02-06",
    "sentence": "Here, meanwhile, is more quackery from Pennsylvania's attorney general, <span class='selected-term'>Josh Shapiro</span>, who is probably going to be the Democratic nominee for governor this year.",
    "author": "Civis Americanus",
    "title": "The Perfect Label to Destroy Gun-Grabbing Democrats' Credibility"
  },
  {
    "id": 2137,
    "mediaId": 8493,
    "date": "2022-02-06",
    "sentence": "But the court also declined to greenlight the release of some information it sought, citing an argument by Democratic state Attorney General <span class='selected-term'>Josh Shapiro</span> that it is protected by privacy laws.",
    "author": "WKOK Staff",
    "title": "AP: State Republicans Won’t Endorse PA Governor or US Senate"
  },
  {
    "id": 2385,
    "mediaId": 8254,
    "date": "2022-02-06",
    "sentence": "Owens will also talk about how the only democratic candidate for governor, <span class='selected-term'>Josh Shapiro</span> is setting election records.",
    "author": "James Wesser",
    "title": "This Week in Pennsylvania: Feb. 6"
  },
  {
    "id": 2494,
    "mediaId": 8481,
    "date": "2022-02-06",
    "sentence": "They had asked the court to rule that Attorney General <span class='selected-term'>Josh Shapiro</span> has no authority to bind them to the settlement.",
    "author": "The Associated Press",
    "title": "Philly, Pittsburgh DAs lose round in opioid settlement suit"
  },
  {
    "id": 2270,
    "mediaId": 8489,
    "date": "2022-02-07",
    "sentence": "3 months ago\nIn the gubernatorial race, the question of which candidate to fund is, seemingly, less complicated: Attorney General <span class='selected-term'>Josh Shapiro</span> is running unopposed for the Democratic nomination.",
    "author": "Katie Meyer",
    "title": "After a few rocky years, IBEW Local 98 has more campaign cash than ever"
  },
  {
    "id": 2250,
    "mediaId": 2550,
    "date": "2022-02-07",
    "sentence": "Whoever emerges from the busy May primary will be in for an expensive general election fight against Attorney General <span class='selected-term'>Josh Shapiro</span>, who faces no serious intra-party opposition in his bid to succeed his fellow Democrat, termed-out Gov.",
    "author": "",
    "title": "Morning Digest: Democratic Senate primary in Pennsylvania gets smaller as GOP's gets uglier"
  },
  {
    "id": 2241,
    "mediaId": 2693,
    "date": "2022-02-08",
    "sentence": "Democratic Attorney General <span class='selected-term'>Josh Shapiro</span> also said in October 2020 that observing ballot boxes was “voter intimidation.” Pennsylvania mail-in voters are required to “sign and date a declaration on the outside of the (mail-in ballot) envelope….",
    "author": "Jeffrey Lord",
    "title": "The RNC Censures Cheney, Kinzinger"
  },
  {
    "id": 1842,
    "mediaId": 6571,
    "date": "2022-02-08",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> claims he's acting because the dealerships scammed the public.",
    "author": "",
    "title": "Attorney General Josh Shapiro Files Legal Action Against Used Car Dealer In Penn Hills"
  },
  {
    "id": 1876,
    "mediaId": 6571,
    "date": "2022-02-08",
    "sentence": "",
    "author": "",
    "title": "Leak Leaves Manor Township With 1-Day Supply Of Water"
  },
  {
    "id": 1901,
    "mediaId": 6571,
    "date": "2022-02-08",
    "sentence": "",
    "author": "",
    "title": "Father Guilty In Deaths Of 2 Babies Left In Abandoned Cars"
  },
  {
    "id": 2238,
    "mediaId": 2608,
    "date": "2022-02-08",
    "sentence": "“Today, Daniel Barrett pled guilty to the horrific murder of his wife, and was sentenced to life in prison for his unthinkable crimes,” Pennsylvania District Attorney <span class='selected-term'>Josh Shapiro</span> (D) said in a statement.",
    "author": "Jerry Lambe",
    "title": "Pa. Man Who Beat His Wife to Death with Fire Poker in Jealous Rage and Left Her Body in Basement Is Sentenced to Life in Prison"
  },
  {
    "id": 2315,
    "mediaId": 8431,
    "date": "2022-02-08",
    "sentence": "On Thursday, February 3, Attorney General <span class='selected-term'>Josh Shapiro</span> visited Wright Recreation Center, where he took a tour of the Alan Horwitz ‘Sixth Man’ Center currently under construction.",
    "author": "SCOOP",
    "title": "Attorney General visits the Wright Recreation Center for Hoops and Youth “Heart-to-Heart”"
  },
  {
    "id": 2499,
    "mediaId": 8461,
    "date": "2022-02-08",
    "sentence": "When <span class='selected-term'>Josh Shapiro</span> went to bed on election night in 2020, it looked like he was going to lose his bid to be reelected as Pennsylvania’s attorney general.",
    "author": "Gabby Deutch | JewishInsider",
    "title": "Josh Shapiro’s open Pennsylvania primary lane"
  },
  {
    "id": 2344,
    "mediaId": 8481,
    "date": "2022-02-08",
    "sentence": "Some of the properties cater to students at Penn State, such as Calder Commons and Meridian on College Ave.\n“Some of these tenants were students away from home, on their own, for the first time and signing their first leases,” Attorney General <span class='selected-term'>Josh Shapiro</span> said.",
    "author": "Kelsey Rogers",
    "title": "AG Shapiro announces settlement with State College landlord"
  },
  {
    "id": 2145,
    "mediaId": 8438,
    "date": "2022-02-09",
    "sentence": "Tom Wolf and Attorney General <span class='selected-term'>Josh Shapiro</span> have been in fulfilling their duties to protect the citizens of Pennsylvania.",
    "author": "South Philly Review -",
    "title": "Briefs: February 9th, 2022"
  },
  {
    "id": 2399,
    "mediaId": 2650,
    "date": "2022-02-09",
    "sentence": "Two leading Pennsylvania Dems — Lieutenant Governor John Fetterman and Attorney General <span class='selected-term'>Josh Shapiro</span> — also somehow had their dance cards filled when Biden visited to tout his infrastructure law.",
    "author": "Stephen Green",
    "title": "He's Fallen and He Can't Get Up: Joe Biden Poll Average Slumps to Under 40 for the First Time"
  },
  {
    "id": 2569,
    "mediaId": 2732,
    "date": "2022-02-09",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> announced Tuesday he is taking legal action against two Pennsylvania car dealerships, including one in Penn Hills, that he said violated consumer protections laws.",
    "author": "Tanisha Thomas",
    "title": "Penn Hills used car dealership scammed customers, AG Josh Shapiro says"
  },
  {
    "id": 1944,
    "mediaId": 2662,
    "date": "2022-02-10",
    "sentence": "Tom Wolf and Attorney General <span class='selected-term'>Josh Shapiro</span>, both Democrats.",
    "author": "Jim Hoft",
    "title": "The Mystery of the Migrant Kids the Feds Are Spiriting Into the U.S. Interior"
  },
  {
    "id": 1918,
    "mediaId": 6571,
    "date": "2022-02-10",
    "sentence": "MCKEESPORT, Pa. (KDKA) - (KDKA) - Attorney General <span class='selected-term'>Josh Shapiro</span> joined the Pittsburgh and McKeesport police chiefs Thursday to give an update on a program that aims to reduce drug and gun violence in the Mon Valley.",
    "author": "",
    "title": "Attorney General And McKeesport Police Tout Success Of Partnership Cracking Down On Guns And Drugs"
  },
  {
    "id": 1608,
    "mediaId": 2754,
    "date": "2022-02-10",
    "sentence": "Tom Wolf and Attorney General <span class='selected-term'>Josh Shapiro</span>, both Democrats.",
    "author": "Tyler Durden",
    "title": "The Mystery Of The Migrant Kids The Feds Are Spiriting Into The U.S. Interior"
  },
  {
    "id": 2141,
    "mediaId": 2909,
    "date": "2022-02-10",
    "sentence": "Tom Wolf and Attorney General <span class='selected-term'>Josh Shapiro</span>, both Democrats.",
    "author": "Deneen Borelli",
    "title": "Commentary: The Mystery of the Migrant Kids the Feds Are Spiriting into the US Interior"
  },
  {
    "id": 2230,
    "mediaId": 8401,
    "date": "2022-02-10",
    "sentence": "Last month, Commonwealth Court declared Pennsylvania’s mail-in voting law is unconstitutional, but Attorney General <span class='selected-term'>Josh Shapiro</span> has appealed the decision to the state Supreme Court.",
    "author": "",
    "title": "Philadelphia Officials Reminding Voters They Can Still Vote By Mail: ‘Mail-In Voting Is Still Legal’"
  },
  {
    "id": 1994,
    "mediaId": 2665,
    "date": "2022-02-10",
    "sentence": "Tom Wolf and Attorney General <span class='selected-term'>Josh Shapiro</span>, both Democrats.",
    "author": "James Varney",
    "title": "'Ghost Flights': The Mystery of the Migrant Kids the Feds Are Spiriting Into the U.S. Interior"
  },
  {
    "id": 2105,
    "mediaId": 8500,
    "date": "2022-02-10",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, who is running for governor, spoke alongside McKeesport Police Chief Adam Alfer and Pittsburgh Police Chief Scott Schubert at the McKeesport Palisades on Fifth Avenue.",
    "author": "",
    "title": "Pa. attorney general, McKeesport police chief give update on law enforcement partnership"
  },
  {
    "id": 2217,
    "mediaId": 8489,
    "date": "2022-02-10",
    "sentence": "That’s part of the reason why Attorney General <span class='selected-term'>Josh Shapiro</span> created the Conviction Integrity Unit in 2020.",
    "author": "Emily Rizzo",
    "title": "Leroy Evans’ family is hopeful for his release soon, 40 years after a wrongful conviction"
  },
  {
    "id": 1234,
    "mediaId": 8305,
    "date": "2022-02-10",
    "sentence": "Malloy appealed Bradley’s decision to the Superior Court, but later withdrew that appeal in 2020 when Attorney General <span class='selected-term'>Josh Shapiro</span> announced the creation of the Conviction Integrity Section.",
    "author": "Alex Rose",
    "title": "A.G.’s integrity unit urges new look at ‘Avon Lady’ murder"
  },
  {
    "id": 1454,
    "mediaId": 8489,
    "date": "2022-02-11",
    "sentence": "“I want to thank Attorney General <span class='selected-term'>Josh Shapiro</span> and his staff for their investigation and work to hold Mr. Doroshin accountable,” Mayor Jim Kenney said in the joint statement issued Friday by the Office of the Attorney General.",
    "author": "Nina Feldman",
    "title": "Philly Fighting COVID CEO Doroshin banned from working in Pa."
  },
  {
    "id": 1641,
    "mediaId": 8500,
    "date": "2022-02-11",
    "sentence": "Martin exits the Republican primary field still double-digits deep as GOP rivals vie for the nomination to take on the presumed Democratic nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>, in November's election.",
    "author": "",
    "title": "Lawmaker who suffered badly broken leg exits governor's race"
  },
  {
    "id": 1241,
    "mediaId": 8253,
    "date": "2022-02-11",
    "sentence": "PHILADELPHIA (WPVI) -- Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is taking action against the head of 'Philly Fighting Covid.'",
    "author": "",
    "title": "Pennsylvania attorney general files complaint against CEO of 'Philly Fighting Covid'"
  },
  {
    "id": 1286,
    "mediaId": 8481,
    "date": "2022-02-11",
    "sentence": "Martin exits the Republican primary field still double-digits deep as GOP rivals vie for the nomination to take on the presumed Democratic nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>, in November’s election.",
    "author": "The Associated Press",
    "title": "Lawmaker who suffered badly broken leg exits governor’s race"
  },
  {
    "id": 1722,
    "mediaId": 8401,
    "date": "2022-02-11",
    "sentence": "Doroshin put people’s privacy at risk under the guise of serving as a nonprofit, and he is now being held accountable for those actions,” Attorney General <span class='selected-term'>Josh Shapiro</span> said in a statement.",
    "author": "",
    "title": "Disgraced Philly Fighting COVID Founder Facing New Punishment From State"
  },
  {
    "id": 1258,
    "mediaId": 8380,
    "date": "2022-02-13",
    "sentence": "At the end of 2021, Evers had about $10 million while <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee for governor in Pennsylvania, had $13 million, according to state campaign records.",
    "author": "Thomas Beaumont",
    "title": "Democrats Eye Key Governors' Races as Backstop Against GOP"
  },
  {
    "id": 1740,
    "mediaId": 8254,
    "date": "2022-02-14",
    "sentence": "As for the unresolved matter at hand — whether the mayor is the mayor — city council has handed the case to Pa. Attorney General <span class='selected-term'>Josh Shapiro</span> and York County District Attorney Dave Sunday, according to a council press release Friday, which characterized the conflicting legal opinions councilmembers had received and said the AG or DA could petition a court to consider Helfrich’s status.",
    "author": "Seth Kaplan",
    "title": "Probe into York mayor’s oath began after urging by former council member who’s now in North Carolina"
  },
  {
    "id": 1210,
    "mediaId": 8254,
    "date": "2022-02-14",
    "sentence": "At the end of 2021, Evers had about $10 million while <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee for governor in Pennsylvania, had $13 million, according to state campaign records.",
    "author": "THOMAS BEAUMONT Associated Press",
    "title": "Democrats eye key governors’ races as backstop against GOP"
  },
  {
    "id": 1694,
    "mediaId": 6509,
    "date": "2022-02-14",
    "sentence": "At the end of 2021, Evers had about $10 million while <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee for governor in Pennsylvania, had $13 million, according to state campaign records.",
    "author": "Thomas Beaumont",
    "title": "Democrats Eye Key Governors' Races as Backstop Against GOP"
  },
  {
    "id": 1705,
    "mediaId": 6526,
    "date": "2022-02-14",
    "sentence": "At the end of 2021, Evers had about $10 million while <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee for governor in Pennsylvania, had $13 million, according to state campaign records.",
    "author": "Thomas Beaumont",
    "title": "Democrats in Pennsylvania and other swing states eye governor’s races to thwart Republicans"
  },
  {
    "id": 1294,
    "mediaId": 6571,
    "date": "2022-02-15",
    "sentence": "The investigation by Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> showed the group of alleged co-conspirators allegedly tried to rip off PUA funds in excess of almost $1 million.",
    "author": "",
    "title": "Arrests Made In Alleged Scheme To Defraud Pandemic Unemployment Assistance Program"
  },
  {
    "id": 1215,
    "mediaId": 2877,
    "date": "2022-02-15",
    "sentence": "Tom Wolf and Attorney General <span class='selected-term'>Josh Shapiro</span>, both Democrats.",
    "author": "",
    "title": "The Mystery of Migrant ‘Ghost Flights’"
  },
  {
    "id": 1768,
    "mediaId": 2701,
    "date": "2022-02-15",
    "sentence": "Tom Wolf and Attorney General <span class='selected-term'>Josh Shapiro</span>, both Democrats.",
    "author": "James Varney",
    "title": "Biden Admin Hiding ‘Ghost Flights’ Scattering Illegal Migrants Around The Country"
  },
  {
    "id": 1477,
    "mediaId": 8493,
    "date": "2022-02-15",
    "sentence": "“The DGA is trying to rehash old recycled political smear talking points because they see the same numbers we see: Lou Barletta is a strong candidate to challenge <span class='selected-term'>Josh Shapiro</span>, who won’t be able to defend his own failed record as attorney general.” The complaint now goes before the six-member Federal Election Commission, which is largely toothless.",
    "author": "WKOK Staff",
    "title": "PA Headlines: Pres. Trump, Cong. Barletta, Still Popular in State"
  },
  {
    "id": 960,
    "mediaId": 8254,
    "date": "2022-02-15",
    "sentence": "HARRISBURG, Pa. (WHTM) – Attorney General <span class='selected-term'>Josh Shapiro</span> announced Tuesday five people are facing charges for allegedly conspiring to provide false information in an attempt to illegally obtain Pandemic Unemployment Assistance (PUA) through the Coronavirus Aid, Relief, and Economic Security Act (CARES) Act.",
    "author": "George Stockburger",
    "title": "Five facing charges for pandemic unemployment fraud; AG"
  },
  {
    "id": 1033,
    "mediaId": 8449,
    "date": "2022-02-15",
    "sentence": "A fines de 2021, Evers tenía alrededor de $10 millones, mientras que <span class='selected-term'>Josh Shapiro</span>, el probable candidato demócrata a gobernador en Pensilvania, tenía $13 millones, según los registros de campaña estatales.",
    "author": "",
    "title": "Cuatro estados emergen como prioridad para los demócratas"
  },
  {
    "id": 1049,
    "mediaId": 8481,
    "date": "2022-02-15",
    "sentence": "HARRISBURG, Pa. (WHTM) – Attorney General <span class='selected-term'>Josh Shapiro</span> announced today five people are facing charges for allegedly conspiring to provide false information in an attempt to illegally obtain Pandemic Unemployment Assistance (PUA) through the Coronavirus Aid, Relief, and Economic Security Act (CARES) Act.",
    "author": "George Stockburger",
    "title": "Five facing charges for defrauding Pa. Pandemic Unemployment Assistance Program"
  },
  {
    "id": 1490,
    "mediaId": 8282,
    "date": "2022-02-15",
    "sentence": "Wolf and Attorney General <span class='selected-term'>Josh Shapiro</span> in their efforts to “protect and expand” existing abortion access in the state.",
    "author": "Richard Gaw",
    "title": "Local agencies bracing for impact of U.S. Supreme Court ruling on Roe v. Wade"
  },
  {
    "id": 1288,
    "mediaId": 8481,
    "date": "2022-02-16",
    "sentence": "HARRISBURG, Pa. (WHTM) — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> has issued a consumer alert and safety recommendations for potential misuse of Apple AirTags to track their locations and belongings without their knowledge or consent.",
    "author": "George Stockburger",
    "title": "Pa. AG issues warning for AirTag misuse, potential for stalking"
  },
  {
    "id": 967,
    "mediaId": 8254,
    "date": "2022-02-16",
    "sentence": "HARRISBURG, Pa. (WHTM) — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> has issued a consumer alert and safety recommendations for potential misuse of Apple AirTags to track their locations and belongings without their knowledge or consent.",
    "author": "George Stockburger",
    "title": "Pa. AG issues warning for AirTag misuse, potential for stalking"
  },
  {
    "id": 1733,
    "mediaId": 8504,
    "date": "2022-02-16",
    "sentence": "HARRISBURG, Pa. (WHTM) — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> has issued a consumer alert and safety recommendations for potential misuse of Apple AirTags to track their locations and belongings without their knowledge or consent.",
    "author": "George Stockburger",
    "title": "Pa. AG issues warning for AirTag misuse, potential for stalking"
  },
  {
    "id": 1001,
    "mediaId": 8483,
    "date": "2022-02-16",
    "sentence": "Five people are charged with defrauding Pennsylvania's Pandemic Unemployment Assistance program, Attorney General <span class='selected-term'>Josh Shapiro</span> announced Tuesday.",
    "author": "Brian Roche",
    "title": "5 people charged with defrauding Pennsylvania's Pandemic Unemployment Assistance program"
  },
  {
    "id": 907,
    "mediaId": 8254,
    "date": "2022-02-16",
    "sentence": "According to Attorney General <span class='selected-term'>Josh Shapiro</span>, five of the top nine counties across the state with the highest rates of overdose deaths were rural communities.",
    "author": "Kayla Schmidt",
    "title": "Fentanyl test strips could be legalized in Pa. sooner than you think"
  },
  {
    "id": 1561,
    "mediaId": 8314,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Jason Villemez",
    "title": "Your semi-regular reminder to VOTE"
  },
  {
    "id": 1340,
    "mediaId": 6571,
    "date": "2022-02-16",
    "sentence": "PITTSBURGH (KDKA) -- Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> has issued a consumer alert about the malicious use of Apple AirTags.",
    "author": "",
    "title": "Pennsylvania Attorney General Issues Consumer Alert About Apple Airtags' Tracking Threat"
  },
  {
    "id": 1667,
    "mediaId": 8401,
    "date": "2022-02-17",
    "sentence": "READ MORE:\nThe file of Ellen Greenberg is being closed by the office of Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, according to a letter sent to the attorney of Greenberg’s parents.",
    "author": "Matt Petrillo",
    "title": "EXCLUSIVE: Pennsylvania Attorney General Again Determines Mysterious Death Of Ellen Greenberg A Suicide After Review"
  },
  {
    "id": 1479,
    "mediaId": 4071,
    "date": "2022-02-17",
    "sentence": "How to protect yourself\nBoth New York's James and Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> have offered tips to identify whether an AirTag has been placed on your person, as reported earlier by Tom's Guide.",
    "author": "David Lumb",
    "title": "State Officials Warn of Apple AirTag Stalking Danger"
  },
  {
    "id": 1158,
    "mediaId": 8417,
    "date": "2022-02-17",
    "sentence": "That’s the good news, now the bad: Wolf’s Attorney General, <span class='selected-term'>Josh Shapiro</span>, who may be worse, is waiting in the wings to replace his boss.",
    "author": "Dwight Weidman",
    "title": "The Republican primary for Pennsylvania governor should be fun"
  },
  {
    "id": 1300,
    "mediaId": 8422,
    "date": "2022-02-17",
    "sentence": "",
    "author": "Karen Shuey",
    "title": "GOP gubernatorial hopeful PA Sen. Jake Corman visits Berks County"
  },
  {
    "id": 1157,
    "mediaId": 8409,
    "date": "2022-02-17",
    "sentence": "The winner of the Republican primary will likely face state Attorney General <span class='selected-term'>Josh Shapiro</span> — the only established Democrat running — in the general election.",
    "author": "Karen Shuey",
    "title": "GOP gubernatorial hopeful PA Sen. Jake Corman visits Berks County"
  },
  {
    "id": 1013,
    "mediaId": 8404,
    "date": "2022-02-17",
    "sentence": "PHILADELPHIA (WHTM) — <span class='selected-term'>Josh Shapiro</span> and Austin Davis visited a Laborer’s District Council’s new training center in North Philadelphia on Wednesday.",
    "author": "Ben Schad",
    "title": "Shapiro visits laborer center in Philly to talk jobs"
  },
  {
    "id": 1484,
    "mediaId": 8437,
    "date": "2022-02-17",
    "sentence": "",
    "author": "Karen Shuey",
    "title": "GOP gubernatorial hopeful PA Sen. Jake Corman visits Berks County"
  },
  {
    "id": 1140,
    "mediaId": 8380,
    "date": "2022-02-18",
    "sentence": "The state’s criminal case against the driller dates to 2020, when Attorney General <span class='selected-term'>Josh Shapiro</span> — a Democrat now running for governor — charged Cabot with violating the law by allowing methane from the company’s faulty gas wells to escape into drinking-water aquifers in Dimock and nearby communities.",
    "author": "Michael Rubinkam",
    "title": "For Pa. Town Seeking Clean Water in Prominent Fracking Case, No Easy Fixes"
  },
  {
    "id": 813,
    "mediaId": 8402,
    "date": "2022-02-18",
    "sentence": "(AP Photo/Matt Rourke)\nHARRISBURG — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> filed a civil complaint last Friday against Andre Doroshin, director and CEO of Philly Fighting COVID, Inc., for violating Pennsylvania consumer protection, charitable solicitation, and nonprofit corporation laws.",
    "author": "Philadelphia Sun Staff",
    "title": "AG Shapiro files civil complaint against Philly Fighting COVID CEO Andre Doroshin"
  },
  {
    "id": 1771,
    "mediaId": 2679,
    "date": "2022-02-18",
    "sentence": "The state’s criminal case against the driller dates to 2020, when Attorney General <span class='selected-term'>Josh Shapiro</span> — a Democrat now running for governor — charged Cabot with violating the law by allowing methane from the company’s faulty gas wells to escape into drinking-water aquifers in Dimock and nearby communities.",
    "author": "MICHAEL RUBINKAM",
    "title": "‘Irreversible’: No easy fix for water fouled by gas driller"
  },
  {
    "id": 1191,
    "mediaId": 2632,
    "date": "2022-02-18",
    "sentence": "The state’s criminal case against the driller dates to 2020, when Attorney General <span class='selected-term'>Josh Shapiro</span> — a Democrat now running for governor — charged Cabot with violating the law by allowing methane from the company’s faulty gas wells to escape into drinking-water aquifers in Dimock and nearby communities.",
    "author": "Michael Rubinkam",
    "title": "For Pa. Town Seeking Clean Water in Prominent Fracking Case, No Easy Fixes"
  },
  {
    "id": 1440,
    "mediaId": 6526,
    "date": "2022-02-18",
    "sentence": "HARRISBURG — Despite a big discrepancy in the latest federal and state data on overdose deaths in Pennsylvania, state leaders say the crisis is continuing and Attorney General <span class='selected-term'>Josh Shapiro</span> indicated a turnaround could be hindered by a “historic” lack of police.",
    "author": "Ford Turner",
    "title": "State, federal estimates of Pennsylvania deaths in overdose crisis are far apart as Shapiro points to ‘historic’ shortage of police"
  },
  {
    "id": 1420,
    "mediaId": 2594,
    "date": "2022-02-18",
    "sentence": "The state’s criminal case against the driller dates to 2020, when Attorney General <span class='selected-term'>Josh Shapiro</span> — a Democrat now running for governor — charged Cabot with violating the law by allowing methane from the company’s faulty gas wells to escape into drinking-water aquifers in Dimock and nearby communities.",
    "author": "Via AP news wire",
    "title": "‘Irreversible’: No easy fix for water fouled by gas driller"
  },
  {
    "id": 1317,
    "mediaId": 2729,
    "date": "2022-02-18",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> is replacing Wolf on the Democratic ticket.",
    "author": "Towleroad",
    "title": "Governors’ races in ‘blue wall’ states carry high stakes for voting rights"
  },
  {
    "id": 1713,
    "mediaId": 2509,
    "date": "2022-02-18",
    "sentence": "The state’s criminal case against the driller dates to 2020, when Attorney General <span class='selected-term'>Josh Shapiro</span> — a Democrat now running for governor — charged Cabot with violating the law by allowing methane from the company’s faulty gas wells to escape into drinking-water aquifers in Dimock and nearby communities.",
    "author": "MICHAEL RUBINKAM Associated Press",
    "title": "‘Irreversible’: No easy fix for water fouled by gas driller"
  },
  {
    "id": 1090,
    "mediaId": 2592,
    "date": "2022-02-18",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> is replacing Wolf on the Democratic ticket.",
    "author": "James Oliphant",
    "title": "Governors' Races In 'Blue Wall' States Carry High Stakes For Voting Rights"
  },
  {
    "id": 1054,
    "mediaId": 6509,
    "date": "2022-02-18",
    "sentence": "The state’s criminal case against the driller dates to 2020, when Attorney General <span class='selected-term'>Josh Shapiro</span> — a Democrat now running for governor — charged Cabot with violating the law by allowing methane from the company’s faulty gas wells to escape into drinking-water aquifers in Dimock and nearby communities.",
    "author": "Michael Rubinkam",
    "title": "For Pa. Town Seeking Clean Water in Prominent Fracking Case, No Easy Fixes"
  },
  {
    "id": 1316,
    "mediaId": 2601,
    "date": "2022-02-18",
    "sentence": "National File: Pennsylvania Democrat attorney general <span class='selected-term'>Josh Shapiro</span>, who is now running for Governor of Pennsylvania, stands accused of covering up election fraud complaints against Democrats dating back years during his current tenure as attorney general, leading a whistleblower to accuse Shapiro of being “criminally negligent.”\n“AG Shapiro turned a blind eye to the alleged criminal wrongdoing of members of the Democrat Party in our county (Fayette County, Pennsylvania).",
    "author": "MJA",
    "title": "Pennsylvania Governor Candidate Josh Shapiro (D) Covered Up Election Fraud Complaints Against Democrats As Attorney General"
  },
  {
    "id": 795,
    "mediaId": 2640,
    "date": "2022-02-19",
    "sentence": "The state’s criminal case against the driller dates to 2020, when Attorney General <span class='selected-term'>Josh Shapiro</span>—a Democrat now running for governor—charged Cabot with violating the law by allowing methane from the company’s faulty gas wells to escape into drinking-water aquifers in Dimock and nearby communities.",
    "author": "",
    "title": "Media Attention Fades, but Their Well Water Is Still Foul"
  },
  {
    "id": 755,
    "mediaId": 2518,
    "date": "2022-02-19",
    "sentence": "The state’s criminal case against the driller dates to 2020, when Attorney General <span class='selected-term'>Josh Shapiro</span> — a Democrat now running for governor — charged Cabot with violating the law by allowing methane from the company’s faulty gas wells to escape into drinking-water aquifers in Dimock and nearby communities.",
    "author": "",
    "title": "Fouled water tries residents’ patience"
  },
  {
    "id": 744,
    "mediaId": 2730,
    "date": "2022-02-20",
    "sentence": "Last December, PSEA recommended Democratic candidate <span class='selected-term'>Josh Shapiro</span> for governor in the party's primary.",
    "author": "Rebecca Downs",
    "title": "PA Gubernatorial Candidate is Anti-CRT, But Has Hire Lobbyists Who Previously Worked for Teachers Union"
  },
  {
    "id": 339,
    "mediaId": 8254,
    "date": "2022-02-21",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span> is currently the only Democrat running for Governor in 2022.",
    "author": "George Stockburger",
    "title": "Majority of Pennsylvanians undecided in GOP Governor race, Barletta holds lead"
  },
  {
    "id": 172,
    "mediaId": 8254,
    "date": "2022-02-22",
    "sentence": "The updated statement puts Mastriano among the biggest-raising candidates in a double-digits-deep Republican primary field competing for the nomination to challenge the presumed Democratic nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Associated Press",
    "title": "GOP candidate for governor ups campaign cash in late filing"
  },
  {
    "id": 656,
    "mediaId": 8469,
    "date": "2022-02-22",
    "sentence": "The updated statement puts Mastriano in a double-digits-deep Republican primary field competing for the nomination to challenge the presumed Democratic nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "",
    "title": "GOP candidate for governor ups campaign cash in late filing"
  },
  {
    "id": 804,
    "mediaId": 8500,
    "date": "2022-02-22",
    "sentence": "The updated statement puts Mastriano among the biggest-raising candidates in a double-digits-deep Republican primary field competing for the nomination to challenge the presumed Democratic nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "",
    "title": "GOP candidate for governor ups campaign cash in late filing"
  },
  {
    "id": 566,
    "mediaId": 3993,
    "date": "2022-02-22",
    "sentence": "“Ghost guns are essentially a firearm that comes in two separate parts with a couple of screws to drill the gun together and you have a firearm in just a few minutes,” Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> told FOX 29.",
    "author": "Tom Knighton",
    "title": "Philadelphia officials concerned over \"ghost guns\""
  },
  {
    "id": 672,
    "mediaId": 2601,
    "date": "2022-02-23",
    "sentence": "Pennsylvania Democrat attorney general <span class='selected-term'>Josh Shapiro</span>, who is now running for Governor of Pennsylvania, stands accused of covering up election fraud complaints against Democrats dating back years during his current tenure as attorney general, leading a whistleblower to accuse Shapiro of being “criminally negligent.”\n“AG Shapiro turned a blind eye to the alleged criminal wrongdoing of members of the Democrat Party in our county (Fayette County, Pennsylvania).",
    "author": "MJA",
    "title": "Report: Pennsylvania Dem Governor Candidate Josh Shapiro Covered Up Election Fraud Complaints Against Democrats As Attorney General"
  },
  {
    "id": 834,
    "mediaId": 2732,
    "date": "2022-02-23",
    "sentence": "He further points out in his letter that the responsibility for investigating the matter may fall on the county prosecutor since state Attorney General <span class='selected-term'>Josh Shapiro</span> likely is conflicted since he is the presumed Democratic gubernatorial nominee.",
    "author": "",
    "title": "Jake Corman’s campaign calls for probe into GOP gubernatorial opponent’s campaign finance filings"
  },
  {
    "id": 823,
    "mediaId": 8493,
    "date": "2022-02-23",
    "sentence": "The updated statement puts Mastriano among the biggest-raising candidates in a double-digits-deep Republican primary field competing for the nomination to challenge the presumed Democratic nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "WKOK Staff",
    "title": "PA Headlines: GOP Wants Federal Judge to Intervene on Redistricting"
  },
  {
    "id": 818,
    "mediaId": 8464,
    "date": "2022-02-24",
    "sentence": "",
    "author": "Jeff Werner",
    "title": "Bucks County to receive about $45M under global opioid settlement agreement"
  },
  {
    "id": 841,
    "mediaId": 8500,
    "date": "2022-02-24",
    "sentence": "Even with Ciarrocchi's exit, the Republican primary field remains double-digits deep as GOP rivals vie for the nomination to take on the presumed Democratic nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>, in November's election.",
    "author": "",
    "title": "One more drops from GOP field for Pennsylvania governor"
  },
  {
    "id": 807,
    "mediaId": 8483,
    "date": "2022-02-24",
    "sentence": "\"They fail to produce a headstone or other memorial services that are promised, and instead the Stefan family pockets the money,\" Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> said.",
    "author": "Josslyn Howard",
    "title": "Memorial company accused of not delivering headstones to customers"
  },
  {
    "id": 295,
    "mediaId": 2732,
    "date": "2022-02-24",
    "sentence": "Jennifer Canonico was not surprised when Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> took legal action against Martino Motors on Rodi Road in early February for “continued sales of vehicles that are not ‘roadworthy.’ ” The former Munhall resident has her own story.",
    "author": "Tanisha Thomas",
    "title": "Following attorney general's legal action against Martino Motors, buyers share stories of faulty vehicles"
  },
  {
    "id": 587,
    "mediaId": 2830,
    "date": "2022-02-24",
    "sentence": "Looking ahead: The overall picture painted by these data points to a rapid pace of job growth, although with the supply of labor still constrained,” said <span class='selected-term'>Josh Shapiro</span>, chief economist at MFR Inc.",
    "author": "Greg Robb",
    "title": "U.S. jobless claims tumble in latest week, painting a picture of a strong labor market"
  },
  {
    "id": 363,
    "mediaId": 2619,
    "date": "2022-02-24",
    "sentence": "",
    "author": "Greg Robb",
    "title": "U.S. jobless claims tumble in latest week, painting a picture of a strong labor market"
  },
  {
    "id": 262,
    "mediaId": 2619,
    "date": "2022-02-25",
    "sentence": "Looking ahead: “The clear signal from today’s report is that February is likely to see a substantially slower sales rate for existing homes than the 6.5 million unit pace reported for January,” said <span class='selected-term'>Josh Shapiro</span>, chief U.S. economist at MFR Inc.\nMarket reaction: Stocks DJIA, -1.45% SPX, -1.68% were higher Friday on hopes that Russia might agree to talks that could end its invasion of Ukraine.",
    "author": "Greg Robb",
    "title": "U.S. pending home sales slump for third straight month in January"
  },
  {
    "id": 591,
    "mediaId": 2830,
    "date": "2022-02-25",
    "sentence": "Looking ahead: “The clear signal from today’s report is that February is likely to see a substantially slower sales rate for existing homes than the 6.5 million unit pace reported for January,” said <span class='selected-term'>Josh Shapiro</span>, chief U.S. economist at MFR Inc.\nMarket reaction: Stocks DJIA, -1.46% SPX, -1.69% were higher Friday on hopes that Russia might agree to talks that could end its invasion of Ukraine.",
    "author": "Greg Robb",
    "title": "U.S. pending home sales slump for third straight month in January"
  },
  {
    "id": 774,
    "mediaId": 2701,
    "date": "2022-02-25",
    "sentence": "After last fall’s reporting, state Attorney General <span class='selected-term'>Josh Shapiro</span> tweeted “abortion is healthcare.” In November, Gov.",
    "author": "Sam Dorman",
    "title": "Pennsylvania Lawmakers Must Not Let Pitt Bury Experiments On Aborted Babies"
  },
  {
    "id": 802,
    "mediaId": 8493,
    "date": "2022-02-25",
    "sentence": "Even with Ciarrocchi’s exit, the Republican primary field remains double-digits deep as GOP rivals vie for the nomination to take on the presumed Democratic nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>, in November’s election.",
    "author": "WKOK Staff",
    "title": "PA Headlines: GOP Gubernatorial Candidate Ciarrocchi Drops Out"
  },
  {
    "id": 166,
    "mediaId": 8254,
    "date": "2022-02-25",
    "sentence": "The GOP rivals are vying for the nomination to take on the presumed Democratic Party nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>, in November’s general election.",
    "author": "AP",
    "title": "First day of petitions arrives for Pennsylvania’s primaries"
  },
  {
    "id": 428,
    "mediaId": 8469,
    "date": "2022-02-25",
    "sentence": "The GOP rivals are vying for the nomination to take on the presumed Democratic Party nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>, in November’s general election.",
    "author": "",
    "title": "First day of petitions arrives for Pennsylvania’s primaries"
  },
  {
    "id": 482,
    "mediaId": 8254,
    "date": "2022-02-25",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> announced that Stephanie King, Registered Nurse and owner and operator of The Center for Holistic and Integrative Mental Health (CHIMH) was accused of the felony fraud charges.",
    "author": "Carl Aldinger",
    "title": "Pa. nurse charged with writing illegal prescriptions, insurance fraud"
  },
  {
    "id": 469,
    "mediaId": 8254,
    "date": "2022-02-25",
    "sentence": "The updated statement puts Mastriano among the biggest-raising candidates in a double-digits-deep Republican primary field competing for the nomination to challenge the presumed Democratic nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "George Stockburger",
    "title": "Franklin County DA declines to prosecute Mastriano over campaign finance filing"
  },
  {
    "id": 407,
    "mediaId": 8271,
    "date": "2022-02-25",
    "sentence": "The DA’s office recuses itself, instead handing prosecution in the case over to the office of Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Asha Prihar",
    "title": "The engineer in Philly’s deadly 2015 Amtrak crash was found not guilty after 7 years of debate"
  },
  {
    "id": 845,
    "mediaId": 8437,
    "date": "2022-02-26",
    "sentence": "",
    "author": "Fran Maye",
    "title": "Ciarrocchi takes aim at Pa. 6th Congressional seat held by Houlahan"
  },
  {
    "id": 364,
    "mediaId": 8493,
    "date": "2022-02-26",
    "sentence": "The GOP rivals are vying for the nomination to take on the presumed Democratic Party nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>, in November’s general election.",
    "author": "WKOK Staff",
    "title": "AP: Candidates For Primary Can Now Gather Petition Signatures"
  },
  {
    "id": 528,
    "mediaId": 8270,
    "date": "2022-02-26",
    "sentence": "The GOP candidates are competing for the nomination to take on presumed Democratic Party nominee and two-term state Attorney General <span class='selected-term'>Josh Shapiro</span> in November’s general election.",
    "author": "Fran Maye",
    "title": "Ciarrocchi takes aim at Pa. 6th Congressional seat held by Houlahan"
  },
  {
    "id": 228,
    "mediaId": 2550,
    "date": "2022-02-26",
    "sentence": "It’s therefore critical that Democrat <span class='selected-term'>Josh Shapiro</span> win the gubernatorial race.",
    "author": "",
    "title": "Trumpers organize to take over local elections and try another insurrection, but we can stop them"
  },
  {
    "id": 17239,
    "mediaId": 2512,
    "date": "2022-02-28",
    "sentence": "Please understand that this is abnormal and beyond the guardrails, like so much in our civic discourse at this time.”\nDave La Torre, a spokesperson for Corman, told the Philadelphia Inquirer that voters in Pennsylvania “deserve to know that their candidates for governor are transparent and comply with the law.”\nSeidman reports, “(A) letter Wednesday from Corman campaign lawyer Zachary M. Wallen alleged Mastriano ‘may have committed flagrant and willful violations’ of state law by ‘submitting an obviously deficient and incomplete campaign finance report.’ The Corman campaign also sent the letter to state Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat who is also running for governor.”",
    "author": "Alex Henderson",
    "title": "Pennsylvania’s gubernatorial race turns nasty as candidate Corman demands criminal investigation of rival Mastriano"
  },
  {
    "id": 12880,
    "mediaId": 2631,
    "date": "2022-02-28",
    "sentence": "Democrats, meanwhile, already have a presumptive nominee in Attorney General <span class='selected-term'>Josh Shapiro</span>, who has crossover appeal and a national reputation built in part by pushing back against Trump’s election lies.",
    "author": "",
    "title": "Inside the chaotic GOP primary for governor in Pennsylvania"
  },
  {
    "id": 17734,
    "mediaId": 8493,
    "date": "2022-02-28",
    "sentence": "The updated statement puts Mastriano among the biggest-raising candidates in a double-digits-deep Republican primary field competing for the nomination to challenge the presumed Democratic nominee, two-term state Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "WKOK Staff",
    "title": "PA Headlines: Capitol Lit In Ukraine Colors, Mastriano Off The Hook"
  },
  {
    "id": 17781,
    "mediaId": 8437,
    "date": "2022-03-02",
    "sentence": "",
    "author": "Michael P. Rellahan",
    "title": "Ryan, Shapiro announce drug treatment program expansion in Chester County"
  },
  {
    "id": 17769,
    "mediaId": 8409,
    "date": "2022-03-02",
    "sentence": "",
    "author": "Michael P Rellahan",
    "title": "Ryan, Shapiro announce drug treatment program expansion in Chester County"
  },
  {
    "id": 17617,
    "mediaId": 8401,
    "date": "2022-03-02",
    "sentence": "RADNOR, Pa. (CBS) — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, less than two weeks ago, issued a warning about a rise in Apple AirTag crimes.",
    "author": "",
    "title": "Apple AirTags Increasingly Being Used In Stalking, Theft Crimes: ‘Bad Guys Are Just Using Them For Bad Reasons’"
  },
  {
    "id": 17353,
    "mediaId": 6571,
    "date": "2022-03-03",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is joining in the probe.",
    "author": "",
    "title": "Pa. AG Josh Shapiro Opens TikTok Probe, Joins Nationwide Investigation Into Effect On Kids' Health"
  },
  {
    "id": 17562,
    "mediaId": 8254,
    "date": "2022-03-03",
    "sentence": "Pennsylvania is one of the states launching this investigation, led by Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "James Wesser",
    "title": "Pa. joins states investigating TikTok’s effect on kids’ mental health"
  },
  {
    "id": 17318,
    "mediaId": 8254,
    "date": "2022-03-03",
    "sentence": "In a March 3 news release, Attorney General <span class='selected-term'>Josh Shapiro</span> highlighted potential unfair and deceptive practices of car dealerships that violate the commonwealth’s Consumer Protection Law.",
    "author": "Corey Morris",
    "title": "AG Shapiro puts commonwealth car dealers on notice"
  },
  {
    "id": 17759,
    "mediaId": 8500,
    "date": "2022-03-03",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> has launched an investigation into the TikTok social media platform.",
    "author": "Chandi Chapman",
    "title": "Pennsylvania AG Josh Shapiro launching investigation into TikTok"
  },
  {
    "id": 15585,
    "mediaId": 6571,
    "date": "2022-03-04",
    "sentence": "\"We are aware of Judge Legg's recusal in the other case and will not hesitate to make that motion at the appropriate time,\" Jacklin Rhoads, spokesperson for Attorney General <span class='selected-term'>Josh Shapiro</span>, said in response to questions from The Associated Press.",
    "author": "",
    "title": "Judge's Connection To Driller At Issue In Pennsylvania Pollution Case"
  },
  {
    "id": 17434,
    "mediaId": 2532,
    "date": "2022-03-04",
    "sentence": "After the verdict was reached Friday, Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> issued a statement saying, \"There is no question that the excessive speed of the train that the defendant operated resulted in death and injury to his passengers.\"",
    "author": "",
    "title": "Amtrak engineer Brandon Bostian cleared of charges related to 2015 high-speed crash that left 8 people dead, hundreds injured"
  },
  {
    "id": 15591,
    "mediaId": 2636,
    "date": "2022-03-04",
    "sentence": "“He was negligent, and a jury has found that it was not criminal negligence.”\n<span class='selected-term'>Josh Shapiro</span>, Pennsylvania’s attorney general, said in a statement on Friday that his office respected the jury’s verdict.",
    "author": "Vimal Patel",
    "title": "Ex-Amtrak Engineer Acquitted in Philadelphia Crash That Killed 8"
  },
  {
    "id": 17120,
    "mediaId": 2658,
    "date": "2022-03-04",
    "sentence": "Candidates like Attorney General <span class='selected-term'>Josh Shapiro</span>, who is running for Pennsylvania governor, addressed the party activists.",
    "author": "",
    "title": "Barbershop Confrontations, Profane Signs and Despair: Pro-Biden and Alone in Rural America"
  },
  {
    "id": 15866,
    "mediaId": 8409,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Michael P Rellahan",
    "title": "In contested races, Chester County candidates fail to win endorsement"
  },
  {
    "id": 16052,
    "mediaId": 8437,
    "date": "2022-03-05",
    "sentence": "The party also endorsed unopposed candidates for governor and lieutenant governor, <span class='selected-term'>Josh Shapiro</span> and Austin Davis.",
    "author": "Michael P. Rellahan",
    "title": "In contested races, Chester County candidates fail to win endorsement"
  },
  {
    "id": 15796,
    "mediaId": 8393,
    "date": "2022-03-05",
    "sentence": "STROUDSBURG, MONROE COUNTY (WBRE/WYOU) — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> has joined other attorneys general by launching an investigation into the social media app ‘TikTok’ and its association with mental health.",
    "author": "Sydney Kostus",
    "title": "Investigation on TikTok’s mental health impact"
  },
  {
    "id": 15404,
    "mediaId": 8489,
    "date": "2022-03-06",
    "sentence": "Statewide government officials, including Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, spoke in support of the Ukrainian people, who have been under attack by Russian forces for nearly a week.",
    "author": "Tennyson Donyéa",
    "title": "Ukrainian American parishioners in Montco rally against Russian invasion"
  },
  {
    "id": 15598,
    "mediaId": 8468,
    "date": "2022-03-06",
    "sentence": "In prepared remarks PA Attorney General <span class='selected-term'>Josh Shapiro</span> spoke of being the great-grandson of an immigrant and expressed solidarity with the Ukrainian people.",
    "author": "Russell Rubert",
    "title": "Bridgeport residents, Saints Peter and Paul Ukrainian Catholic Church rally to support Ukraine"
  },
  {
    "id": 15737,
    "mediaId": 8253,
    "date": "2022-03-06",
    "sentence": "At the rally she heard from local leaders and politicians too, like Congresswomen Madeleine Dean and Mary Gay Scanlon and Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Beccah Hendrickson",
    "title": "Hundreds attend rally for Ukraine in Montgomery County"
  },
  {
    "id": 15641,
    "mediaId": 8270,
    "date": "2022-03-06",
    "sentence": "“Of course, he met me, that’s the happy ending.”\nPaulette, along with several Berks County religious leaders, U.S. Rep. Chrissy Houlahan and Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, spoke at an interfaith vigil and fundraiser for peace following Russia’s invasion of Ukraine.",
    "author": "Wes Cipolla",
    "title": "Vigil for Ukraine packs Reading church"
  },
  {
    "id": 15859,
    "mediaId": 8380,
    "date": "2022-03-06",
    "sentence": "Most party pillars — Wolf, Sen. Bob Casey and state Attorney General <span class='selected-term'>Josh Shapiro</span> — have not taken sides.",
    "author": "Marc Levy",
    "title": "Pa. Democrats Face Huge Choice in Key US Senate Race: Go Progressive or Moderate"
  },
  {
    "id": 15205,
    "mediaId": 2658,
    "date": "2022-03-06",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> has been directly involved in nearly 50 lawsuits about the 2020 election that involved Trump, his allies, or other parties.",
    "author": "",
    "title": "The Democratic Party’s emerging priority: Save the governors"
  },
  {
    "id": 12882,
    "mediaId": 2679,
    "date": "2022-03-07",
    "sentence": "Most party pillars — Wolf, Sen. Bob Casey and state Attorney General <span class='selected-term'>Josh Shapiro</span> — have not taken sides.",
    "author": "MARC LEVY",
    "title": "‘We want to win’: Democrats face choice in key Senate race"
  },
  {
    "id": 11069,
    "mediaId": 2732,
    "date": "2022-03-07",
    "sentence": "Most party pillars — Wolf, Sen. Bob Casey and state Attorney General <span class='selected-term'>Josh Shapiro</span> — have not taken sides.",
    "author": "Associated Press",
    "title": "'We want to win': Democrats face choice in key Senate race in Pennsylvania"
  },
  {
    "id": 11246,
    "mediaId": 2514,
    "date": "2022-03-07",
    "sentence": "Most party pillars — Wolf, Sen. Bob Casey and state Attorney General <span class='selected-term'>Josh Shapiro</span> — have not taken sides.",
    "author": "",
    "title": "'We want to win': Democrats face choice in key Senate race"
  },
  {
    "id": 15573,
    "mediaId": 6571,
    "date": "2022-03-07",
    "sentence": "In an exclusive interview seen only on KDKA-TV, money editor Jon Delano spoke with Attorney General <span class='selected-term'>Josh Shapiro</span> about price gouging in Pennsylvania.",
    "author": "",
    "title": "Attorney General Josh Shapiro Says He Lacks Power To Investigate Price Gouging At The Pump"
  },
  {
    "id": 15542,
    "mediaId": 6571,
    "date": "2022-03-07",
    "sentence": "",
    "author": "",
    "title": "Truck Crash In Maine Kills 22-Year-Old Woman From Westmoreland County"
  },
  {
    "id": 15838,
    "mediaId": 8483,
    "date": "2022-03-07",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> issued an advisory last week that warns car dealerships against engaging in unfair and deceptive practices.",
    "author": "Brian Roche",
    "title": "Pennsylvania attorney general warns car dealers against deceptive practices"
  },
  {
    "id": 15732,
    "mediaId": 8254,
    "date": "2022-03-07",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is running unopposed on the Democratic ticket.",
    "author": "George Stockburger",
    "title": "Barletta leads in latest Pennsylvania Governor GOP race poll"
  },
  {
    "id": 15875,
    "mediaId": 8500,
    "date": "2022-03-07",
    "sentence": "Most party pillars - Wolf, Sen. Bob Casey and state Attorney General <span class='selected-term'>Josh Shapiro</span> - have not taken sides.",
    "author": "MARC LEVY Associated Press",
    "title": "'We want to win': Democrats face choice in key Senate race"
  },
  {
    "id": 15228,
    "mediaId": 8254,
    "date": "2022-03-07",
    "sentence": "Most party pillars — Wolf, Sen. Bob Casey and state Attorney General <span class='selected-term'>Josh Shapiro</span> — have not taken sides.",
    "author": "Marc Levy",
    "title": "‘We want to win’: Democrats face choice in key Senate race"
  },
  {
    "id": 15693,
    "mediaId": 8469,
    "date": "2022-03-07",
    "sentence": "Most party pillars — Wolf, Sen. Bob Casey and state Attorney General <span class='selected-term'>Josh Shapiro</span> — have not taken sides.",
    "author": "MARC LEVY",
    "title": "‘We want to win’: Democrats face choice in key Senate race"
  },
  {
    "id": 15696,
    "mediaId": 8504,
    "date": "2022-03-07",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is running unopposed on the Democratic ticket.",
    "author": "George Stockburger",
    "title": "Barletta leads in latest Pennsylvania Governor GOP race poll"
  },
  {
    "id": 15992,
    "mediaId": 8437,
    "date": "2022-03-08",
    "sentence": "Current state Attorney General <span class='selected-term'>Josh Shapiro</span> is the only Democrat seeking the state’s highest post.",
    "author": "Michael P. Rellahan",
    "title": "McSwain wins support for Pa. governor of state GOP delegation from Chester County"
  },
  {
    "id": 16060,
    "mediaId": 8437,
    "date": "2022-03-08",
    "sentence": "The AG, <span class='selected-term'>Josh Shapiro</span>, charged them with 48 crimes and one felony.",
    "author": "MediaNews Group",
    "title": "LETTER: To get action, sometimes Mariner East protests are helpful"
  },
  {
    "id": 15869,
    "mediaId": 8409,
    "date": "2022-03-08",
    "sentence": "Current state Attorney General <span class='selected-term'>Josh Shapiro</span> is the only Democrat seeking the state’s highest post.",
    "author": "Michael P Rellahan",
    "title": "McSwain wins support for Pa. governor of state GOP delegation from Chester County"
  },
  {
    "id": 15997,
    "mediaId": 8449,
    "date": "2022-03-08",
    "sentence": "La mayoría de los pilares del partido —Wolf, el senador Bob Casey y el fiscal general estatal <span class='selected-term'>Josh Shapiro</span>— no han tomado partido.",
    "author": "",
    "title": "Demócratas enfrentan importante elección: ser progresistas o moderados"
  },
  {
    "id": 15494,
    "mediaId": 6571,
    "date": "2022-03-08",
    "sentence": "RELATED STORIES:\nUber Adding Surcharge To Help Drivers Deal With Soaring Gas Prices\nGiant Eagle Extends Expiration Of Perks Through 2022 In Response To Gas Prices, Inflation\nAttorney General <span class='selected-term'>Josh Shapiro</span> Says He Lacks Power To Investigate Price Gouging At The Pump\nSmall Business Owners Absorbing Cost Of Rising Gas Prices For Now\nSpike In Gas Prices Making It Harder For Delivery And Rideshare Services\nAs Gas Prices Soar, Pittsburghers Looking Into Alternative Forms Of Transportation\n\"I would hope they would all come together and give us the authority we need to protect consumers at the pump, to protect them at the grocery store, or wherever they're seeing significant spikes in cost,\" said Shapiro.",
    "author": "",
    "title": "Pennsylvania Average Gas Price Jumps To Over $4.30 Per Gallon"
  },
  {
    "id": 15476,
    "mediaId": 6571,
    "date": "2022-03-08",
    "sentence": "RELATED STORIES\nAttorney General <span class='selected-term'>Josh Shapiro</span> Says He Lacks Power To Investigate Price Gouging At The Pump\nSmall Business Owners Absorbing Cost Of Rising Gas Prices For Now\nSpike In Gas Prices Making It Harder For Delivery And Rideshare Services\nAs Gas Prices Soar, Pittsburghers Looking Into Alternative Forms Of Transportation\n#PicturesFromThePump: Share a pic here of the price you paid for gas >> https://cbsloc.al/3IPfAsu\nPosted by KDKA-TV | CBS Pittsburgh on Tuesday, March 8, 2022\nIn:\nGas Prices\nInflation",
    "author": "KDKA-TV News Staff",
    "title": "Pictures From The Pump: Show Us What You're Seeing"
  },
  {
    "id": 15238,
    "mediaId": 8254,
    "date": "2022-03-09",
    "sentence": "HARRISBURG, Pa. (WHTM) — On Wednesday, March 9, Attorney General <span class='selected-term'>Josh Shapiro</span> and Acting Consumer Advocate Patrick Cicero urged residents who are struggling to pay their utility bills to use programs that provide relief.",
    "author": "James Wesser",
    "title": "As utility costs rise, Pa. resident’s bills fall due to special programs"
  },
  {
    "id": 15281,
    "mediaId": 8254,
    "date": "2022-03-09",
    "sentence": "The Fox News poll did not include Democratic candidates with the party backing Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "George Stockburger",
    "title": "Pennsylvania Governor race a virtual tie; Fox News poll"
  },
  {
    "id": 15903,
    "mediaId": 8305,
    "date": "2022-03-09",
    "sentence": "Tom Wolf and state Attorney General <span class='selected-term'>Josh Shapiro</span> planned to appeal it.",
    "author": "Kathleen E. Carey",
    "title": "Delaware County vote-by-mail ballots may not get out until end of April or beginning of May"
  },
  {
    "id": 15913,
    "mediaId": 8279,
    "date": "2022-03-09",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> singled out the bishop, accusing him of covering up the case of one particular priest by not “aggressively pursuing his removal.”\nBishop Trautman said in a statement at the time that there was “simply no pattern or practice of putting the church’s image or a priest’s reputation above the protection of children.",
    "author": "",
    "title": "Late Erie, Pa., bishop gave ‘a full life of service’ to church"
  },
  {
    "id": 15442,
    "mediaId": 8254,
    "date": "2022-03-10",
    "sentence": "HARRISBURG, Pa. (WHTM) - Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is reminding Pennsylvanians of important tips and warnings when it comes to donating money or goods to assist the people of Ukraine.",
    "author": "George Stockburger",
    "title": "Pennsylvania AG offers tips, warning for making donations to Ukraine"
  },
  {
    "id": 15798,
    "mediaId": 8393,
    "date": "2022-03-10",
    "sentence": "We just want to encourage them when they make a charitable donation to have it go to actual charities so they don’t get scammed,” said Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Andy Mehalshick",
    "title": "Scam Alert: PA Attorney General warns of Ukrainian relief scams"
  },
  {
    "id": 15958,
    "mediaId": 8483,
    "date": "2022-03-10",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> said unless there's an emergency declaration in place – and right now, there's not – his hands are tied.",
    "author": "Brian Roche",
    "title": "As gas prices rise, drivers wonder: Is it price gouging?"
  },
  {
    "id": 15608,
    "mediaId": 8356,
    "date": "2022-03-11",
    "sentence": "Tips on donations to help Ukraine\nIn a news release, Attorney General <span class='selected-term'>Josh Shapiro</span> on Thursday encouraged Pennsylvanians to follow three simple steps to avoid being scammed:\nStep 1 — Ask Questions:\nWhere will your donation go specifically?",
    "author": "Kaity Assaf",
    "title": "Wondering how you can help the people of Ukraine? Look no further."
  },
  {
    "id": 15702,
    "mediaId": 8393,
    "date": "2022-03-11",
    "sentence": "WEISSPORT, CARBON COUNTY (WBRE/WYOU) — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> announced Friday that a jury has rendered a guilty verdict for former Weissport Chief of Police Brent Getz for raping a child.",
    "author": "Emily Silvi",
    "title": "Former Weissport police chief found guilty of raping a child"
  },
  {
    "id": 15412,
    "mediaId": 6571,
    "date": "2022-03-11",
    "sentence": "In an interview with KDKA, attorney general <span class='selected-term'>Josh Shapiro</span> said he'd like that authority like attorneys generals in other states.",
    "author": "",
    "title": "State Senator Says Consumers Are Getting Price Gouged At The Pump And Wants To Give Attorney General Power To Investigate"
  },
  {
    "id": 15890,
    "mediaId": 2564,
    "date": "2022-03-12",
    "sentence": "'The defendants terrorized this young victim by assaulting her hundreds of times over seven years,' Attorney General <span class='selected-term'>Josh Shapiro</span> said at the time.",
    "author": "Associated Press",
    "title": "Former Pennsylvania police chief, 30, is found guilty of raping a child HUNDREDS of times when she was six years old and continuing until she was 11 with help from a friend"
  },
  {
    "id": 10763,
    "mediaId": 2526,
    "date": "2022-03-12",
    "sentence": "Tom Wolf (D), and State Attorney General <span class='selected-term'>Josh Shapiro</span> over the “ghost flights” of illegals coming in the dead of the night, “dumping them all over Pennsylvania” without any knowledge.",
    "author": "Hannah Bleau",
    "title": "Exclusive — Gubernatorial Candidate Lou Barletta: Illegal Immigration ‘Ends When I’m Governor of Pennsylvania’"
  },
  {
    "id": 15488,
    "mediaId": 2592,
    "date": "2022-03-12",
    "sentence": "\"This verdict holds Brent Getz accountable for his horrific crimes against a child, and brought justice to a brave survivor who had the courage to come forward,\" Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> said in a statement.",
    "author": "Joseph Patrick",
    "title": "Ex-Police Chief And Friend Raped Child 'Hundreds Of Times' Over 7 Years"
  },
  {
    "id": 15892,
    "mediaId": 8493,
    "date": "2022-03-12",
    "sentence": "SUNBURY – State Attorney General <span class='selected-term'>Josh Shapiro</span> will be in parts of the Valley Saturday for four petition signings, as he continues his bid for the Governor’s race on the Democratic ticket.",
    "author": "WKOK Staff",
    "title": "Gubernatorial Candidate Shapiro Holding Petition Events in Valley"
  },
  {
    "id": 15481,
    "mediaId": 8489,
    "date": "2022-03-13",
    "sentence": "“Throughout his entire career, <span class='selected-term'>Josh Shapiro</span> has worked to defend Pennsylvanians’ constitutional right to clean air and pure water,” said Will Simons, Shapiro’s campaign spokesperson.",
    "author": "Susan Phillips",
    "title": "Mariner East pipeline motivates activist’s Green Party run for Pa. governor"
  },
  {
    "id": 15634,
    "mediaId": 8271,
    "date": "2022-03-13",
    "sentence": "[Billy Penn]\nVISION: Looking forward to the week ahead\n• Gov candidates face filing deadline\nPa. Attorney General <span class='selected-term'>Josh Shapiro</span> is uncontested as the 2022 Democratic candidate for Pa. governor, but the Republican field is still crowded, with no clear leader.",
    "author": "Billy Penn Staff",
    "title": "Missing anti-violence money; ‘The Automat’ recalls past dining glory; Meet school superintendent candidates | Sunday roundup"
  },
  {
    "id": 15462,
    "mediaId": 8481,
    "date": "2022-03-14",
    "sentence": "BEDFORD COUNTY, Pa. (WTAJ) — Attorney General <span class='selected-term'>Josh Shapiro</span> announced Monday that his office has filed suit against Diane Comrey, doing business as “Earthcare & Conservation.”\nComrey reportedly sold herself as someone who could prepare and submit nutrient management plans and other official documents to support government agencies on behalf of farmers through “Earthcare & Conservation.” Preparing and submitting this information ensures farms are operating legally and qualifies them for certain government reimbursement programs.",
    "author": "Alexis Loya",
    "title": "AG Shapiro files suit against woman scamming farmers"
  },
  {
    "id": 15366,
    "mediaId": 8254,
    "date": "2022-03-14",
    "sentence": "“Pennsylvania’s farmers trusted Comrey to complete and submit important plans on their behalf, plans that could make or break their farming operations,” said Attorney General <span class='selected-term'>Josh Shapiro</span> in the press release.",
    "author": "Avery Van Etten",
    "title": "Pa. attorney general suing woman who allegedly scammed farmers"
  },
  {
    "id": 15581,
    "mediaId": 8254,
    "date": "2022-03-14",
    "sentence": "Zito says there are too many Republicans running and an assumption that Democrat Attorney General <span class='selected-term'>Josh Shapiro</span> is a shoe-in.",
    "author": "Dennis Owens",
    "title": "Political forecaster shares thoughts on Pa. Senate and Gov. races"
  },
  {
    "id": 15496,
    "mediaId": 2619,
    "date": "2022-03-14",
    "sentence": "Still, although some of the drama has been removed from Wednesday, the details matter for the market, said <span class='selected-term'>Josh Shapiro</span>, chief U.S. economist at MFR Inc.\n“It’s one of those weird meetings where everybody kind of knows what is going to happen, but nobody has any idea what’s going to happen,” Shapiro said, in an interview.",
    "author": "Greg Robb",
    "title": "Fed to hike interest rates, undeterred by lack of visibility on Russia-Ukraine war’s impact"
  },
  {
    "id": 15469,
    "mediaId": 6571,
    "date": "2022-03-14",
    "sentence": "RELATED STORIES:\nUber Adding Surcharge To Help Drivers Deal With Soaring Gas Prices\nGiant Eagle Extends Expiration Of Perks Through 2022 In Response To Gas Prices, Inflation\nAttorney General <span class='selected-term'>Josh Shapiro</span> Says He Lacks Power To Investigate Price Gouging At The Pump\nSmall Business Owners Absorbing Cost Of Rising Gas Prices For Now\nSpike In Gas Prices Making It Harder For Delivery And Rideshare Services\nAs Gas Prices Soar, Pittsburghers Looking Into Alternative Forms Of Transportation\nAt BJ's, the price of gas is the same as at the other clubs like Costco and Sam's Club, but their deal is also a bit different.",
    "author": "",
    "title": "Ways To Save Money When Filling Up The Tank Amid Continuing Rise In Gas Prices"
  },
  {
    "id": 13934,
    "mediaId": 2608,
    "date": "2022-03-15",
    "sentence": "“This verdict holds Brent Getz accountable for his horrific crimes against a child and brought justice to a brave survivor who had the courage to come forward,” said Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> (D).",
    "author": "Chris Spargo",
    "title": "Jury Convicts Ex-Police Chief of Sex Crimes Against Friend’s Niece Who Was Raped ‘Several Times a Month’ Over Six-Year Span"
  },
  {
    "id": 11403,
    "mediaId": 6526,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Eugene Tauber",
    "title": "Here are the candidates running in Pennsylvania primary for U.S. Senate, governor and Congress"
  },
  {
    "id": 13865,
    "mediaId": 8254,
    "date": "2022-03-15",
    "sentence": "The charges were announced by Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> and the Forty-Ninth Statewide Investigating Grand Jury on Tuesday.",
    "author": "Daniel Hamburg",
    "title": "Former Lancaster County Drug Task Force leader charged with stealing $200K"
  },
  {
    "id": 14089,
    "mediaId": 8483,
    "date": "2022-03-15",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> announced the charges against John Burkhart.",
    "author": "Anne Shannon",
    "title": "Former head of Lancaster County Drug Task Force charged with stealing $200K"
  },
  {
    "id": 13958,
    "mediaId": 8489,
    "date": "2022-03-15",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> met with Philadelphia Police Commissioner Danielle Outlaw, along with area police chiefs, on Tuesday to discuss an ongoing problem: a historic shortage of police officers.",
    "author": "Liz Tung",
    "title": "Pennsylvania faces ‘historic shortage of police.’ AG Shapiro, Commissioner Outlaw call on Harrisburg for help"
  },
  {
    "id": 13721,
    "mediaId": 8253,
    "date": "2022-03-15",
    "sentence": "Philadelphia Police Commissioner Danielle Outlaw, and chiefs from Abington, Chester, Bensalem, and Upper Darby, met with Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "6abc Digital Staff",
    "title": "Police chiefs across the Philadelphia region meet to discuss officer shortages"
  },
  {
    "id": 14172,
    "mediaId": 8436,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Eugene Tauber",
    "title": "Here are the candidates running in Pennsylvania primary for U.S. Senate, governor and Congress"
  },
  {
    "id": 13879,
    "mediaId": 8306,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Eugene Tauber",
    "title": "Here are the candidates running in Pennsylvania primary for U.S. Senate, governor and Congress"
  },
  {
    "id": 13939,
    "mediaId": 8437,
    "date": "2022-03-15",
    "sentence": "Lebanon, AlleghenyKevin Baumlin (D), PhiladelphiaJohn Fetterman (D), Braddock, AlleghenyAlex Khalil (D), Jenkintown Borough, Montgomery\nRepublican\nGeorge Bochetto (R), PhiladelphiaSean Gale (R), Plymouth Township, MontgomeryDave McCormick (R), Pittsburgh, AlleghenyJeff Bartos (R), Lower Merion Township, MontgomeryKathy Barnette (R), Lower Moreland Township, MontgomeryMehmet Oz (R), Bryn Athyn, MontgomeryCarla Sands (R), Wormleysburg Boro, Cumberland\nGovernorDemocratic\n<span class='selected-term'>Josh Shapiro</span> (D), Abington Township, Montgomery\nRepublican\nCharlie Gerow (R), Hampden Township, CumberlandDave White (R), Ridley Township, DelawareLou Barletta (R), Hazleton, LuzerneJason Richey (R), Sewickley Heights, AlleghenyDouglas V Mastriano (R), Greene Township, FranklinJoe Gale (R), Plymouth Township, MontgomeryBill McSwain (R), West Chester, ChesterMelissa Hart (R), Bradford Woods, AlleghenyJake Corman (R), Bellefonte, CentreNche Zama (R), Wind Gap Boro, Lackawanna\nLieutenant GovernorDemocratic\nBrian Sims (D), PhiladelphiaAustin Davis (D), McKeesport, Allegheny\nRepublican\nClarice Schillinger (R), Horsham, MontgomeryTeddy Daniels (R), WayneRick Saccone (R), Elizabeth Township, AlleghenyCarrie Lewis Delrosso (R), Oakmont, AlleghenyJohn Brown (R), Bangor Borough, NorthamptonRuss Diamond (R), Annville Township, Lebanon\nU.S. Congress, 7th DistrictDemocratic\nSusan Wild (D), Lehigh\nRepublican\nLisa Scheller (R), LehighKevin Dellicker (R), Lehigh\nU.S. Congress, 9th DistrictDemocratic\nAmanda R Waldman (D), Lycoming\nRepublican\nDan Meuser (R), Luzerne\nU.S. Congress, 1st DistrictDemocratic\nAshley Ehasz (D), Bucks\nRepublican\nBrian Fitzpatrick (R), BucksCaroline Avery (R), BucksDasha Pruett (R), DelawareAlex Entin (R), BucksBrad Lanning (R), Bucks\nU.S. Congress, 4th DistrictDemocratic\nMadeleine Dean (D), Montgomery\nRepublican\nDaniel Burton Jr (R), LancasterChristian Nascimento (R), Montgomery\nU.S. Congress, 2nd District\nDemocratic\nGilberto Gonzalez (D), PhiladelphiaBrendan F Boyle (D), Philadelphia\nRepublican\nAaron Bashir (R), Philadelphia\nU.S. Congress, 3rd DistrictDemocratic\nMichael Cogbill (D), PhiladelphiaAlexandra Hunt (D), PhiladelphiaDwight Evans (D), Philadelphia\nRepublican\nNo candidates\nU.S. Congress, 5th DistrictDemocratic\nLou Lanni (D), DelawareMary Gay Scanlon (D), Delaware\nRepublican\nDavid Galluch (R), Delaware\nU.S. Congress, 6th DistrictDemocratic\nChrissy Houlahan (D), Chester\nRepublican\nSteve Fanelli (R), ChesterRon Vogel (R), ChesterGuy Ciarrocchi (R), Chester\nU.S. Congress, 8th DistrictDemocratic\nMatt Cartwright (D), Lackawanna\nRepublican\nMike Marsicano (R), LuzerneJim Bognet (R) Luzerne\nU.S. Congress, 10th DistrictDemocratic\nShamaine Daniels (D), DauphinRick Coplen (D), Cumberland\nRepublican\nScott Perry (R), York\nU.S. Congress, 11th DistrictDemocratic\nBob Hollister (D), Lancaster\nRepublican\nLloyd K. Smucker (R), Lancaster\nU.S. Congress, 12th DistrictDemocratic\nSteve Irwin (D), AlleghenyJerry Dickinson (D), AlleghenySummer Lee (D), Allegheny\nRepublican\nMike Doyle (R), Allegheny\nU.S. Congress, 13th District\nDemocratic\nNo candidates\nRepublican\nJeff Manns (R), AdamsJohn Joyce (R), Blair\nU.S. Congress, 14th DistrictDemocratic\nNo candidates\nRepublican\nGuy Reschenthaler (R), Washington\nU.S. Congress, 15th DistrictDemocratic\nNo candidates\nRepublican\nGlenn GT Thompson (R), CentreGeorge Rathmell (R), Jefferson\nU.S. Congress, 16th DistrictDemocratic\nRick Telesz (D), LawrenceDan Pastore (D), Erie\nRepublican\nMike Kelly (R), Butler\nU.S. Congress, 17th DistrictDemocratic\nChris Deluzio (D), AlleghenySean Meloy (D), Allegheny\nRepublican\nJeremy Shaffer (R), AlleghenyJason Killmeyer (R), Allegheny",
    "author": "Eugene Tauber",
    "title": "Here are the candidates running in Pennsylvania primary for U.S. Senate, governor and Congress"
  },
  {
    "id": 14164,
    "mediaId": 8427,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Eugene Tauber",
    "title": "Here are the candidates running in Pennsylvania primary for U.S. Senate, governor and Congress"
  },
  {
    "id": 13903,
    "mediaId": 8409,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Eugene Tauber",
    "title": "Here are the candidates running in Pennsylvania primary for U.S. Senate, governor and Congress"
  },
  {
    "id": 14092,
    "mediaId": 8270,
    "date": "2022-03-15",
    "sentence": "Lebanon, Allegheny\nKevin Baumlin (D), Philadelphia\nJohn Fetterman (D), Braddock, Allegheny\nAlex Khalil (D), Jenkintown Borough, Montgomery\nRepublican\nGeorge Bochetto (R), Philadelphia\nSean Gale (R), Plymouth Township, Montgomery\nDave McCormick (R), Pittsburgh, Allegheny\nJeff Bartos (R), Lower Merion Township, Montgomery\nKathy Barnette (R), Lower Moreland Township, Montgomery\nMehmet Oz (R), Bryn Athyn, Montgomery\nCarla Sands (R), Wormleysburg Boro, Cumberland\nGovernor\nDemocratic\n<span class='selected-term'>Josh Shapiro</span> (D), Abington Township, Montgomery\nRepublican\nCharlie Gerow (R), Hampden Township, Cumberland\nDave White (R), Ridley Township, Delaware\nLou Barletta (R), Hazleton, Luzerne\nJason Richey (R), Sewickley Heights, Allegheny\nDouglas V Mastriano (R), Greene Township, Franklin\nJoe Gale (R), Plymouth Township, Montgomery\nBill McSwain (R), West Chester, Chester\nMelissa Hart (R), Bradford Woods, Allegheny\nJake Corman (R), Bellefonte, Centre\nNche Zama (R), Wind Gap Boro, Lackawanna\nLieutenant Governor\nDemocratic\nBrian Sims (D), Philadelphia\nAustin Davis (D), McKeesport, Allegheny\nRepublican\nClarice Schillinger (R), Horsham, Montgomery\nTeddy Daniels (R), Wayne\nRick Saccone (R), Elizabeth Township, Allegheny\nCarrie Lewis Delrosso (R), Oakmont, Allegheny\nJohn Brown (R), Bangor Borough, Northampton\nRuss Diamond (R), Annville Township, Lebanon\nU.S. Congress, 7th District\nDemocratic\nSusan Wild (D), Lehigh\nRepublican\nLisa Scheller (R), Lehigh\nKevin Dellicker (R), Lehigh\nU.S. Congress, 9th District\nDemocratic\nAmanda R Waldman (D), Lycoming\nRepublican\nDan Meuser (R), Luzerne\nU.S. Congress, 1st District\nDemocratic\nAshley Ehasz (D), Bucks\nRepublican\nBrian Fitzpatrick (R), Bucks\nCaroline Avery (R), Bucks\nDasha Pruett (R), Delaware\nAlex Entin (R), Bucks\nBrad Lanning (R), Bucks\nU.S. Congress, 4th District\nDemocratic\nMadeleine Dean (D), Montgomery\nRepublican\nDaniel Burton Jr (R), Lancaster\nChristian Nascimento (R), Montgomery\nU.S. Congress, 2nd District\nDemocratic\nGilberto Gonzalez (D), Philadelphia\nBrendan F Boyle (D), Philadelphia\nRepublican\nAaron Bashir (R), Philadelphia\nU.S. Congress, 3rd District\nDemocratic\nMichael Cogbill (D), Philadelphia\nAlexandra Hunt (D), Philadelphia\nDwight Evans (D), Philadelphia\nRepublican\nNo candidates\nU.S. Congress, 5th District\nDemocratic\nLou Lanni (D), Delaware\nMary Gay Scanlon (D), Delaware\nRepublican\nDavid Galluch (R), Delaware\nU.S. Congress, 6th District\nDemocratic\nChrissy Houlahan (D), Chester\nRepublican\nSteve Fanelli (R), Chester\nRon Vogel (R), Chester\nGuy Ciarrocchi (R), Chester\nU.S. Congress, 8th District\nDemocratic\nMatt Cartwright (D), Lackawanna\nRepublican\nMike Marsicano (R), Luzerne\nJim Bognet (R) Luzerne\nU.S. Congress, 10th District\nDemocratic\nShamaine Daniels (D), Dauphin\nRick Coplen (D), Cumberland\nRepublican\nScott Perry (R), York\nU.S. Congress, 11th District\nDemocratic\nBob Hollister (D), Lancaster\nRepublican\nLloyd K. Smucker (R), Lancaster\nU.S. Congress, 12th District\nDemocratic\nSteve Irwin (D), Allegheny\nJerry Dickinson (D), Allegheny\nSummer Lee (D), Allegheny\nRepublican\nMike Doyle (R), Allegheny\nU.S. Congress, 13th District\nDemocratic\nNo candidates\nRepublican\nJeff Manns (R), Adams\nJohn Joyce (R), Blair\nU.S. Congress, 14th District\nDemocratic\nNo candidates\nRepublican\nGuy Reschenthaler (R), Washington\nU.S. Congress, 15th District\nDemocratic\nNo candidates\nRepublican\nGlenn GT Thompson (R), Centre\nGeorge Rathmell (R), Jefferson\nU.S. Congress, 16th District\nDemocratic\nRick Telesz (D), Lawrence\nDan Pastore (D), Erie\nRepublican\nMike Kelly (R), Butler\nU.S. Congress, 17th District\nDemocratic\nChris Deluzio (D), Allegheny\nSean Meloy (D), Allegheny\nRepublican\nJeremy Shaffer (R), Allegheny\nJason Killmeyer (R), Allegheny",
    "author": "Eugene Tauber",
    "title": "Here are the candidates running in Pennsylvania primary for U.S. Senate, governor and Congress"
  },
  {
    "id": 14004,
    "mediaId": 8490,
    "date": "2022-03-16",
    "sentence": "Lou Barletta, former Congressman\nJoe Gale, Montgomery County Commissioner\nJake Corman, state senator\nCharlie Gerow, conservative activist\nMelissa Hart, former Congresswoman\nDoug Mastriano, state senator\nJason Richey, Pittsburgh-based attorney\nBill McSwain, former U.S. attorney\nDave White, Delaware County businessman\nNche Zama, heart surgeon\nMeanwhile, <span class='selected-term'>Josh Shapiro</span> was the only Democrat to be on the ballot.",
    "author": "Tyler Friel",
    "title": "Ballots Packed With Candidates In Senate And Governor Race"
  },
  {
    "id": 14155,
    "mediaId": 8490,
    "date": "2022-03-16",
    "sentence": "",
    "author": "Tyler Friel",
    "title": "AG Warns Of Growing Police Shortages"
  },
  {
    "id": 14193,
    "mediaId": 8449,
    "date": "2022-03-16",
    "sentence": "Excepto por la nominación casi segura del demócrata <span class='selected-term'>Josh Shapiro</span> para gobernador, los partidos nacionales y estatales no se han metido en las contiendas por gobernador y Senado de los Estados Unidos, y tampoco lo ha hecho el expresidente Donald Trump.",
    "author": "",
    "title": "Estampida de candidatos se presenta para las primarias"
  },
  {
    "id": 13390,
    "mediaId": 8254,
    "date": "2022-03-16",
    "sentence": "A statement from the office of Pa. Attorney General <span class='selected-term'>Josh Shapiro</span> (D) said Burkhart acted alone.",
    "author": "Ben Schad",
    "title": "Lancaster DA says cop’s arrest ‘impacted some cases’"
  },
  {
    "id": 14182,
    "mediaId": 8380,
    "date": "2022-03-16",
    "sentence": "The Democratic Party's nominee, <span class='selected-term'>Josh Shapiro</span>, filed to run for governor in the midst of serving his second term as Pennsylvania's elected attorney general.",
    "author": "Rudy Chinchilla",
    "title": "Pa. Primary 2022: Early Voter's Guide to Casting a Ballot This Year"
  },
  {
    "id": 13764,
    "mediaId": 8504,
    "date": "2022-03-16",
    "sentence": "(WJET/WFXP/YourErie.com) — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> met with police chiefs from across Pennsylvania where he heard a unified message.",
    "author": "",
    "title": "PA Attorney General told of police shortages"
  },
  {
    "id": 14119,
    "mediaId": 8393,
    "date": "2022-03-16",
    "sentence": "AG <span class='selected-term'>Josh Shapiro</span> recently addressed these types of scams.",
    "author": "Caroline Foreback",
    "title": "Woman falls victim to ‘romance scam’"
  },
  {
    "id": 14202,
    "mediaId": 8448,
    "date": "2022-03-16",
    "sentence": "Last year, the Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> estimated the neighborhood’s drug market is “approaching a billion-dollar enterprise,” with drug corners worth $60,000 a day and some premium blocks earning the dealers a cool million per week.",
    "author": "Sean P. Cooper",
    "title": "Circles of Hell in an American City"
  },
  {
    "id": 13949,
    "mediaId": 8448,
    "date": "2022-03-16",
    "sentence": "Last year, the Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> estimated the neighborhood’s drug market is “approaching a billion-dollar enterprise,” with drug corners worth $60,000 a day and some premium blocks earning the dealers a cool million per week …",
    "author": "Jacob Siegel",
    "title": "What Happened Today: March 16, 2022"
  },
  {
    "id": 10974,
    "mediaId": 6571,
    "date": "2022-03-16",
    "sentence": "But not unexpectedly, only one Democrat is running for governor: Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "",
    "title": "Dozens Of Candidates In Both Parties Run For Statewide And Local Congressional Seats"
  },
  {
    "id": 13525,
    "mediaId": 6571,
    "date": "2022-03-17",
    "sentence": "By: Patrick Damp and Andy Sheehan/KDKA-TV\nHARRISBURG (KDKA) - A coordinated effort between local police and the office of Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> ended with an arrest and a seizure of over $1 million in fentanyl in Braddock.",
    "author": "",
    "title": "AG Josh Shapiro's Office Announces Seizure Of Fentanyl And Guns In Braddock"
  },
  {
    "id": 13656,
    "mediaId": 2732,
    "date": "2022-03-17",
    "sentence": "“Today, thanks to strong collaboration with our local law enforcement partners, we shut down a major drug trafficking operation in Western Pennsylvania,” Attorney General <span class='selected-term'>Josh Shapiro</span> said in a statement.",
    "author": "Megan Guza",
    "title": "AG: 30 pounds of fentanyl, $535K, 6 cars seized during Braddock drug bust"
  },
  {
    "id": 13782,
    "mediaId": 2732,
    "date": "2022-03-17",
    "sentence": "Held directed law enforcement officers to collect campaign contributions while they were on duty,” Attorney General <span class='selected-term'>Josh Shapiro</span> said.",
    "author": "Rich Cholodofsky",
    "title": "Former Westmoreland sheriff Jon Held pleads guilty to theft charge, gets probation"
  },
  {
    "id": 13897,
    "mediaId": 6526,
    "date": "2022-03-17",
    "sentence": "A massive Republican primary field for governor in Pennsylvania is spurring growing discomfort among party leaders that a widely splintered primary vote could produce a winner who cannot beat Democrat <span class='selected-term'>Josh Shapiro</span> in November’s general election.",
    "author": "Marc Levy",
    "title": "Big GOP primary field for Pennsylvania governor has party leaders worried"
  },
  {
    "id": 13495,
    "mediaId": 8254,
    "date": "2022-03-17",
    "sentence": "(WJET/WFXP/YourErie.com) — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> met with police chiefs from across Pennsylvania where he heard a unified message.",
    "author": "",
    "title": "Pa. attorney general meets with police chiefs, discusses shortages"
  },
  {
    "id": 13992,
    "mediaId": 8270,
    "date": "2022-03-17",
    "sentence": "",
    "author": "Karen Shuey",
    "title": "Candidates on May ballot receive endorsements for office"
  },
  {
    "id": 14145,
    "mediaId": 8449,
    "date": "2022-03-17",
    "sentence": "El presunto nominado del Partido Demócrata, <span class='selected-term'>Josh Shapiro</span>, presentó su candidatura a gobernador en medio de su segundo mandato como fiscal general electo de Pensilvania.",
    "author": "",
    "title": "Primarias 2022: guía para entender el contenido de la boleta"
  },
  {
    "id": 14241,
    "mediaId": 8393,
    "date": "2022-03-17",
    "sentence": "EYEWITNESS NEWS (WBRE/WYOU) — In an Eyewitness News exclusive, we speak one-on-one with <span class='selected-term'>Josh Shapiro</span>, the presumptive Democratic nominee for Governor of Pennsylvania.",
    "author": "Andy Mehalshick",
    "title": "Exclusive: One on one interview with Josh Shapiro"
  },
  {
    "id": 13528,
    "mediaId": 8254,
    "date": "2022-03-17",
    "sentence": "HARRISBURG, Pa. (WHTM/AP) — A massive Republican primary field for governor in Pennsylvania is spurring growing discomfort among party leaders that a widely splintered primary vote could produce a winner who cannot beat Democrat <span class='selected-term'>Josh Shapiro</span> in November’s general election.",
    "author": "George Stockburger",
    "title": "Pennsylvania’s big GOP primary field for governor has party leaders worried"
  },
  {
    "id": 13620,
    "mediaId": 8254,
    "date": "2022-03-17",
    "sentence": "EYEWITNESS NEWS (WBRE/WYOU) — In an Eyewitness News exclusive, we speak one-on-one with <span class='selected-term'>Josh Shapiro</span>, the presumptive Democratic nominee for Governor of Pennsylvania.",
    "author": "Andy Mehalshick",
    "title": "Exclusive: One on one interview with Josh Shapiro"
  },
  {
    "id": 13870,
    "mediaId": 8504,
    "date": "2022-03-17",
    "sentence": "Zito says there are too many Republicans running and an assumption that Democrat Attorney General <span class='selected-term'>Josh Shapiro</span> is a shoe-in.",
    "author": "Dennis Owens",
    "title": "Political forecaster shares thoughts on Pa. Senate and Gov. races"
  },
  {
    "id": 14201,
    "mediaId": 8399,
    "date": "2022-03-17",
    "sentence": "After Hours host Natalie Bencivenga interviews <span class='selected-term'>Josh Shapiro</span>, Pa. Attorney General of Pennsylvania, who is running for Governor of Pennsylvania.",
    "author": "Natalie Bencivenga",
    "title": "After Hours: Natalie Bencivenga interviews Josh Shapiro"
  },
  {
    "id": 14209,
    "mediaId": 8469,
    "date": "2022-03-18",
    "sentence": "WILKES-BARRE — Attorney General <span class='selected-term'>Josh Shapiro</span> Thursday released a plan to tackle rising costs and cut taxes for Pennsylvanians if he is elected governor.",
    "author": "Bill OBoyle boboyle@timesleader.com",
    "title": "Shapiro pitches tax plans, including gas refund"
  },
  {
    "id": 14104,
    "mediaId": 8469,
    "date": "2022-03-18",
    "sentence": "HARRISBURG — A massive Republican primary field for governor in Pennsylvania is spurring growing discomfort among party leaders that a widely splintered primary vote could produce a winner who cannot beat Democrat <span class='selected-term'>Josh Shapiro</span> in November’s general election.",
    "author": "Marc Levy Associated Press",
    "title": "Big GOP primary field for governor has party leaders worried"
  },
  {
    "id": 13744,
    "mediaId": 8469,
    "date": "2022-03-18",
    "sentence": "WILKES-BARRE — While <span class='selected-term'>Josh Shapiro</span> visited the Times Leader on Thursday to discuss his proposals to save Pennsylvanians money, the attorney general and Democratic gubernatorial hopeful also responded to our questions about a few other hot topics.",
    "author": "",
    "title": "Shapiro’s thoughts on 2020 election, marijuana, police funding"
  },
  {
    "id": 13966,
    "mediaId": 8493,
    "date": "2022-03-18",
    "sentence": "HARRISBURG, Pa. (AP) — AP is reporting… massive Republican primary field for governor in Pennsylvania is spurring growing discomfort among party leaders that a widely splintered primary vote could produce a winner who cannot beat Democrat <span class='selected-term'>Josh Shapiro</span> in November’s general election.",
    "author": "WKOK Staff",
    "title": "PennLive: Former AG Kane Refused Blood Test After DUI Arrest"
  },
  {
    "id": 13780,
    "mediaId": 8380,
    "date": "2022-03-18",
    "sentence": "A massive Republican primary field for governor in Pennsylvania is spurring growing discomfort among party leaders that a widely splintered primary vote could produce a winner who cannot beat Democrat <span class='selected-term'>Josh Shapiro</span> in November's general election.",
    "author": "Marc Levy",
    "title": "Big GOP Primary Field for Governor Has Party Leaders Worried"
  },
  {
    "id": 13728,
    "mediaId": 8483,
    "date": "2022-03-18",
    "sentence": "HARRISBURG, Pa. —\nA big Republican primary field for governor in Pennsylvania is spurring growing discomfort among party leaders that a widely splintered primary vote could produce a winner who cannot beat Democrat <span class='selected-term'>Josh Shapiro</span> in November's general election.",
    "author": "",
    "title": "Crowded GOP field for Pennsylvania governor has some party leaders concerned"
  },
  {
    "id": 13568,
    "mediaId": 8254,
    "date": "2022-03-18",
    "sentence": "AG <span class='selected-term'>Josh Shapiro</span> recently addressed these types of scams.",
    "author": "Caroline Foreback",
    "title": "Woman falls victim to ‘romance scam’"
  },
  {
    "id": 13460,
    "mediaId": 8254,
    "date": "2022-03-18",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> said of the incident, “These funds should have been used to help law enforcement in Lancaster County battle the opioid epidemic.",
    "author": "Avery Van Etten",
    "title": "Test your knowledge: March 18 weekly news quiz"
  },
  {
    "id": 13549,
    "mediaId": 8254,
    "date": "2022-03-18",
    "sentence": "HARRISBURG, Pa. (AP) — Democrat <span class='selected-term'>Josh Shapiro</span> is rolling out the first tax proposal of his candidacy for governor, saying Friday that he would use surplus state cash and federal pandemic aid to eliminate state taxes on cell phone bills, send payments to car-owning households and expand Pennsylvania’s rent and property tax rebate program.",
    "author": "AP",
    "title": "Shapiro rolls out first tax relief plan of governor’s race"
  },
  {
    "id": 13755,
    "mediaId": 8469,
    "date": "2022-03-18",
    "sentence": "HARRISBURG, Pa. (AP) — Democrat <span class='selected-term'>Josh Shapiro</span> is rolling out the first tax proposal of his candidacy for governor, saying Friday that he would use surplus state cash and federal pandemic aid to eliminate state taxes on cell phone bills, send payments to car-owning households and expand Pennsylvania’s rent and property tax rebate program.",
    "author": "MARC LEVY",
    "title": "Shapiro rolls out first tax relief plan of governor’s race"
  },
  {
    "id": 13413,
    "mediaId": 8504,
    "date": "2022-03-18",
    "sentence": "Supply chain issues, the war in Ukraine and how that’s disrupted global marketplaces, including the oil and gas marketplace,” said <span class='selected-term'>Josh Shapiro</span>, Pennsylvania Attorney General.",
    "author": "Brian Wilk",
    "title": "Attorney General Josh Shapiro makes campaign stop in Erie"
  },
  {
    "id": 14045,
    "mediaId": 6526,
    "date": "2022-03-18",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span> is rolling out the first tax proposal of his candidacy for governor, saying Friday that he would use surplus state cash and federal pandemic aid to eliminate state taxes on cell phone bills, send payments to car-owning households and expand Pennsylvania’s rent and property tax rebate program.",
    "author": "Marc Levy",
    "title": "Josh Shapiro rolls out gas rebate, tax cut plans in Pennsylvania governor’s race"
  },
  {
    "id": 13929,
    "mediaId": 6570,
    "date": "2022-03-18",
    "sentence": "Labeling the prospect of cutting the state’s gas tax a “political talking point” that won’t actually help working Pennsylvanians, state Attorney General <span class='selected-term'>Josh Shapiro</span>, the lone Democratic contender for governor, said “real relief” from rising costs will come from his plan to put money back into the pockets of individuals.",
    "author": "Julian Routh",
    "title": "During Pittsburgh stop, Josh Shapiro promises to cut costs for Pennsylvania families if he's elected governor"
  },
  {
    "id": 14088,
    "mediaId": 2740,
    "date": "2022-03-18",
    "sentence": "Democratic Pennsylvania candidate <span class='selected-term'>Josh Shapiro</span> said Friday he wants to give $250 per vehicle to households to come out of pandemic relief funds, and Republican candidates including Bill McSwain and Jake Corman said they would reduce gas taxes.",
    "author": "Jeanine Santucci",
    "title": "Cut taxes to make gas cheaper? Maryland and Georgia try it temporarily — and other states might too."
  },
  {
    "id": 13594,
    "mediaId": 6571,
    "date": "2022-03-18",
    "sentence": "",
    "author": "",
    "title": "New Charges Against Local Resident In Capitol Riot"
  },
  {
    "id": 13433,
    "mediaId": 6571,
    "date": "2022-03-18",
    "sentence": "HARRISBURG, Pa. (AP) — Democrat <span class='selected-term'>Josh Shapiro</span> is rolling out the first tax proposal of his candidacy for governor, saying Friday that he would use surplus state cash and federal pandemic aid to eliminate state taxes on cell phone bills, send payments to car-owning households and expand Pennsylvania's rent and property tax rebate program.",
    "author": "",
    "title": "Josh Shapiro Rolls Out First Tax Relief Plan Of Governor's Race"
  },
  {
    "id": 13498,
    "mediaId": 6571,
    "date": "2022-03-18",
    "sentence": "",
    "author": "",
    "title": "Pittsburgh Steelers Fans Say They Will Miss JuJu Smith-Schuster"
  },
  {
    "id": 9690,
    "mediaId": 6571,
    "date": "2022-03-19",
    "sentence": "HARRISBURG, Pa. (AP) — A massive Republican primary field for governor in Pennsylvania is spurring growing discomfort among party leaders that a widely splintered primary vote could produce a winner who cannot beat Democrat <span class='selected-term'>Josh Shapiro</span> in November's general election.",
    "author": "",
    "title": "Big GOP Primary Field For Pa. Governor Has Party Leaders Worried"
  },
  {
    "id": 13508,
    "mediaId": 8254,
    "date": "2022-03-19",
    "sentence": "",
    "author": "James Wesser",
    "title": "This Week in Pennsylvania: Natalie Mihalek & Wendell Young"
  },
  {
    "id": 13954,
    "mediaId": 2631,
    "date": "2022-03-20",
    "sentence": "I’d be looking to sound the alarm on this issue, because it’s a turnout issue for Democrats and progressives, and <span class='selected-term'>Josh Shapiro</span> might be worried, with good reason, that they don’t come out,” said former Democratic Gov.",
    "author": "",
    "title": "In Pa. gov. race, Democrat Josh Shapiro banks on abortion rights as a winning issue"
  },
  {
    "id": 14016,
    "mediaId": 2687,
    "date": "2022-03-21",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Dark Money Groups Boost Josh Shapiro In Pennsylvania"
  },
  {
    "id": 14006,
    "mediaId": 8436,
    "date": "2022-03-21",
    "sentence": "“By using data and intelligence facilitated by our Track & Trace program, this joint investigation linked two of the guns straw purchased by the defendant to at least two shooting incidents in Philadelphia,” Attorney General <span class='selected-term'>Josh Shapiro</span> said.",
    "author": "Bucks Local News",
    "title": "‘WE HAVE UNDOUBTEDLY SAVED LIVES:’ City man arrested for illegal straw purchases of 16 firearms"
  },
  {
    "id": 13894,
    "mediaId": 8271,
    "date": "2022-03-21",
    "sentence": "Other elected officials, including Lieutenant Governor John Fetterman, Attorney General <span class='selected-term'>Josh Shapiro</span>, and Mayor Jim Kenney, offered their condolences to the victims’ loved ones on social media.",
    "author": "Asha Prihar",
    "title": "State troopers and another person killed on I-95 in Philly, driver charged with murder and DUI"
  },
  {
    "id": 12136,
    "mediaId": 8436,
    "date": "2022-03-22",
    "sentence": "In December of 2021, Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> announced that the settlement will bring more than $1 billion to Pennsylvania from the $26 billion global settlement.",
    "author": "Bob Keeler",
    "title": "Franconia joins county and state for opioid settlement"
  },
  {
    "id": 12026,
    "mediaId": 8500,
    "date": "2022-03-22",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span>, Pennsylvania's two-time elected attorney general, has a clear path to the Democratic Party's nomination.",
    "author": "",
    "title": "4 GOP candidates for governor set rules to join a debate"
  },
  {
    "id": 12427,
    "mediaId": 8254,
    "date": "2022-03-22",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span>, the commonwealth’s attorney general and candidate on the Democratic ticket for Governor, says he won’t touch the gas tax but he would send federal relief money to help Pennsylvanians who are paying for it.",
    "author": "Dennis Owens",
    "title": "Pennsylvania Governor candidates target commonwealth’s gas tax"
  },
  {
    "id": 11955,
    "mediaId": 8504,
    "date": "2022-03-22",
    "sentence": "“It’s never easy to take the position where you’re gonna be the anti-Santa Claus, but the reality is we have to govern this state and we have to make sure we have safe and efficient transportation assets and we cannot have bridges collapse into ravines.”\nDemocrat <span class='selected-term'>Josh Shapiro</span>, the commonwealth’s attorney general and candidate on the Democratic ticket for Governor, says he won’t touch the gas tax but he would send federal relief money to help Pennsylvanians who are paying for it.",
    "author": "Dennis Owens",
    "title": "Pennsylvania Governor candidates target commonwealth’s gas tax"
  },
  {
    "id": 12227,
    "mediaId": 8393,
    "date": "2022-03-22",
    "sentence": "MATAMORAS, PIKE COUNTY (WBRE/WYOU) — A former Pike County sanitation employee is being charged by Attorney General <span class='selected-term'>Josh Shapiro</span>, for repeatedly violating the Solid Waste Management Act.",
    "author": "Nico Rossi",
    "title": "Former sanitation employee charged for improperly disposing of 60 tons of human waste"
  },
  {
    "id": 8909,
    "mediaId": 2550,
    "date": "2022-03-22",
    "sentence": "PA-Gov: Pennsylvania Works, which is funded by a DGA affiliate, recently began airing ads touting Attorney General <span class='selected-term'>Josh Shapiro</span>, and the Philadelphia Inquirer reports that the size of the buy is $1 million.",
    "author": "",
    "title": "Morning Digest: The top GOP candidate to run Nevada's elections is an antisemitic Big Lie proponent"
  },
  {
    "id": 9168,
    "mediaId": 2732,
    "date": "2022-03-22",
    "sentence": "“This is about partnering with other Republicans to make sure we have a process that doesn’t get hijacked by the media or liberal activists.”\nMurtaugh said, “the media doesn’t have an interest in picking the best Republican candidate to beat <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Associated Press",
    "title": "4 GOP candidates for Pa. governor set rules to join a debate"
  },
  {
    "id": 11597,
    "mediaId": 2572,
    "date": "2022-03-22",
    "sentence": "Democratic incumbent governors are running for reelection in all of those states, other than the key battleground of Pennsylvania, where the party seems to be coalescing around state Attorney General <span class='selected-term'>Josh Shapiro</span> in the race to succeed term-limited Gov.",
    "author": "",
    "title": "Under attack by Trump, Georgia Gov. Kemp gets reinforcements from pro-GOP governors group, Chris Christie"
  },
  {
    "id": 11654,
    "mediaId": 6571,
    "date": "2022-03-22",
    "sentence": "And last week, Attorney General <span class='selected-term'>Josh Shapiro</span> said he would prosecute Taylor to the fullest extent of the law for dealing in the lethal drug Fentanyl.",
    "author": "",
    "title": "Domonique Taylor: Suspect In Huge Fentanyl Seizure Pleads Not Guilty"
  },
  {
    "id": 9253,
    "mediaId": 2699,
    "date": "2022-03-23",
    "sentence": "Rooney said Fetterman could help prevent that possibility, hoping his pairing alongside potential Democratic nominee for governor <span class='selected-term'>Josh Shapiro</span> could be a winning lineup.",
    "author": "Ursula Perano",
    "title": "Will Fetterman Silence Lamb in Pennsylvania Senate Face-Off?"
  },
  {
    "id": 12151,
    "mediaId": 8489,
    "date": "2022-03-23",
    "sentence": "“The media aren’t motivated to select the best candidate to beat [Attorney General and assumed Democratic nominee] <span class='selected-term'>Josh Shapiro</span>, but Republicans are.”\nDavid La Torre, a spokesman for Corman’s campaign, gave a similar explanation, saying that the parameters were established “to ensure Republican candidates for governor could robustly debate one another — not Democratic or partisan moderators — about the issues that are important to Pennsylvania families and job creators.”\nRachel Tripp, a spokesperson for McSwain, also said the campaigns want to “ensure that voters are not misled or unfairly influenced by moderators with a hostile or partisan agenda.”\nThis isn’t standard for Republican — or any — political candidates.",
    "author": "Katie Meyer",
    "title": "What’s behind GOP gov candidates’ ‘bizarre’ new demand to keep debates insular"
  },
  {
    "id": 11673,
    "mediaId": 8254,
    "date": "2022-03-23",
    "sentence": "Trevor Southerland, executive director of the House Democratic Campaign Committee, figures more than two dozen House GOP members currently represent districts in which at least 45% of voters supported either Joe Biden or <span class='selected-term'>Josh Shapiro</span>, the Democratic attorney general who is unopposed for his party’s gubernatorial nomination this year.",
    "author": "MARK SCOLFORO",
    "title": "State legislative races take shape after redistricting delay"
  },
  {
    "id": 12249,
    "mediaId": 8380,
    "date": "2022-03-23",
    "sentence": "Trevor Southerland, executive director of the House Democratic Campaign Committee, figures more than two dozen House GOP members currently represent districts in which at least 45% of voters supported either Joe Biden or <span class='selected-term'>Josh Shapiro</span>, the Democratic attorney general who is unopposed for his party's gubernatorial nomination this year.",
    "author": "Mark Scolforo",
    "title": "Pa. Candidates Scramble to Get on May Ballots After Delays"
  },
  {
    "id": 12202,
    "mediaId": 8380,
    "date": "2022-03-23",
    "sentence": "“This is about partnering with other Republicans to make sure we have a process that doesn't get hijacked by the media or liberal activists.”\nMurtaugh said, “the media doesn't have an interest in picking the best Republican candidate to beat <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Marc Levy",
    "title": "‘Diva-esque': 4 GOP Candidates for Pa. Governor Demand Debate Rules"
  },
  {
    "id": 12262,
    "mediaId": 8493,
    "date": "2022-03-23",
    "sentence": "At 9:47am, we host a call from Democratic gubernatorial candidate <span class='selected-term'>Josh Shapiro</span>.",
    "author": "WKOK Staff",
    "title": "LISTEN: Gubernatorial Candidate Josh Shapiro on On The Mark"
  },
  {
    "id": 12039,
    "mediaId": 8469,
    "date": "2022-03-23",
    "sentence": "Trevor Southerland, executive director of the House Democratic Campaign Committee, figures more than two dozen House GOP members currently represent districts in which at least 45% of voters supported either Joe Biden or <span class='selected-term'>Josh Shapiro</span>, the Democratic attorney general who is unopposed for his party’s gubernatorial nomination this year.",
    "author": "MARK SCOLFORO",
    "title": "State legislative races take shape after redistricting delay"
  },
  {
    "id": 12036,
    "mediaId": 8493,
    "date": "2022-03-23",
    "sentence": "Winning ‘The T’ Are Part of Shapiro’s Campaign\nHARRISBURG – Using the state’s multi-billion-dollar surplus to cut taxes and pay for gas tax givebacks, are part of the <span class='selected-term'>Josh Shapiro</span> tax plan.",
    "author": "WKOK Staff",
    "title": "Shapiro: I’ll Cut the Cellphone Tax, and Give Gas Tax Rebates"
  },
  {
    "id": 12009,
    "mediaId": 8483,
    "date": "2022-03-24",
    "sentence": "CUMBERLAND COUNTY, Pa. —\nPennsylvania gubernatorial candidate <span class='selected-term'>Josh Shapiro</span> was in Cumberland County on Thursday touting a plan he says would give financial relief to households in the commonwealth.",
    "author": "Tom Lehman",
    "title": "Pennsylvania governor candidate Josh Shapiro touts plan to give financial relief to residents"
  },
  {
    "id": 12013,
    "mediaId": 8449,
    "date": "2022-03-24",
    "sentence": "El demócrata <span class='selected-term'>Josh Shapiro</span>, dos veces fiscal general electo de Pensilvania, tiene un camino claro hacia la nominación del partido.",
    "author": "",
    "title": "Candidatos republicanos a gobernación exigen las reglas para debatir"
  },
  {
    "id": 11912,
    "mediaId": 8449,
    "date": "2022-03-24",
    "sentence": "Trevor Southerland, director ejecutivo del Comité de Campaña Demócrata de la Cámara, calcula que más de dos docenas de miembros republicanos de la Cámara actualmente representan distritos en los que al menos el 45% de los votantes apoyaron a Joe Biden o <span class='selected-term'>Josh Shapiro</span>, el fiscal general demócrata que no tiene oposición para la gobernación de su partido.",
    "author": "",
    "title": "Inicia la carrera por figurar en las boletas de las primarias"
  },
  {
    "id": 11703,
    "mediaId": 8254,
    "date": "2022-03-24",
    "sentence": "EAST PENNSBORO TOWNSHIP, Pa. (WHTM) — Gubernatorial candidate <span class='selected-term'>Josh Shapiro</span> (D) made a campaign stop in East Pennsboro Township, Cumberland County on Thursday, March 24.",
    "author": "James Wesser",
    "title": "Josh Shapiro makes campaign stop in Cumberland Co."
  },
  {
    "id": 11918,
    "mediaId": 8504,
    "date": "2022-03-24",
    "sentence": "The media aren’t motivated to select the best candidate to beat <span class='selected-term'>Josh Shapiro</span>, but Republicans are.”\nTim Murtaugh, Senior Advisor to Lou Barletta Campaign.",
    "author": "Brian Wilk",
    "title": "Four GOP Candidates for PA Governor demand debate rules"
  },
  {
    "id": 11786,
    "mediaId": 8254,
    "date": "2022-03-24",
    "sentence": "",
    "author": "James Wesser",
    "title": "New information on police incident in York Co."
  },
  {
    "id": 9271,
    "mediaId": 2732,
    "date": "2022-03-24",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, after all, will come through the primary season without a scratch.",
    "author": "",
    "title": "Editorial: GOP candidates should embrace better debates"
  },
  {
    "id": 12049,
    "mediaId": 2753,
    "date": "2022-03-25",
    "sentence": "He cited Hillyard's purchase of two P80 kits, and his decision to take the kits \"to Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>’s office and asked them to complete the P80s pistol for them.\"",
    "author": "Bob Unruh",
    "title": "Investigation sought into NBC, Pennsylvania officials for possible felonies"
  },
  {
    "id": 12164,
    "mediaId": 3993,
    "date": "2022-03-25",
    "sentence": "Well, as Reporter Hillyard, at least per his LinkedIn page, is a resident of New York (and mentioned having to “return to Pennsylvania”), beyond the inchoate offense of solicitation and conspiracy, both the special agents with <span class='selected-term'>Josh Shapiro</span>’s Office and Reporter Hillyard have committed numerous violations of federal and state law in manufacturing and transferring a firearm.",
    "author": "John Petrolino",
    "title": "Did NBC News and Pennsylvania's AG break the law for a story on \"ghost guns\"?"
  },
  {
    "id": 12067,
    "mediaId": 8300,
    "date": "2022-03-25",
    "sentence": "",
    "author": "Charlotte Valyo",
    "title": "VALYO: Bold leadership needed to become governor"
  },
  {
    "id": 11911,
    "mediaId": 8254,
    "date": "2022-03-25",
    "sentence": "abc27’s This Week in Pennsylvania with Dennis Owens will give you all the highlight coverage this weekend with governor candidate <span class='selected-term'>Josh Shapiro</span> as the guest.",
    "author": "Dennis Owens",
    "title": "Gov. candidate Shapiro to appear on This Week in Pennsylvania"
  },
  {
    "id": 12000,
    "mediaId": 8431,
    "date": "2022-03-25",
    "sentence": "Trevor Southerland, executive director of the House Democratic Campaign Committee, figures more than two dozen House GOP members currently represent districts in which at least 45% of voters supported either Joe Biden or <span class='selected-term'>Josh Shapiro</span>, the Democratic attorney general who is unopposed for his party’s gubernatorial nomination this year.",
    "author": "Associated Press",
    "title": "State legislative races take shape after redistricting delay"
  },
  {
    "id": 12390,
    "mediaId": 8469,
    "date": "2022-03-26",
    "sentence": "Pennsylvania’s two-time elected state Attorney General <span class='selected-term'>Josh Shapiro</span> has a clear path to the Democratic Party’s nomination.",
    "author": "MARC LEVY",
    "title": "Abortion to elections: Republican candidates on the issues"
  },
  {
    "id": 12016,
    "mediaId": 8424,
    "date": "2022-03-26",
    "sentence": "HARRISBURG — Attorney General <span class='selected-term'>Josh Shapiro</span> is warning Pennsylvanians to be on the lookout for bogus fund-raising calls that purport to benefit the families of two fallen Pennsylvania State Police troopers killed Monday on Interstate 95 South in Philadelphia.",
    "author": "",
    "title": "AG warns of scams related to donations for fallen PSP troopers"
  },
  {
    "id": 12254,
    "mediaId": 8380,
    "date": "2022-03-26",
    "sentence": "Pennsylvania's two-time elected state Attorney General <span class='selected-term'>Josh Shapiro</span> has a clear path to the Democratic Party's nomination.",
    "author": "Marc Levy",
    "title": "Abortion to Elections: Republican Candidates on the Issues"
  },
  {
    "id": 11625,
    "mediaId": 8254,
    "date": "2022-03-26",
    "sentence": "He will then speak to Attorney General and governor hopeful <span class='selected-term'>Josh Shapiro</span>.",
    "author": "James Wesser",
    "title": "This Week in Pennsylvania: Josh Shapiro & other Pa. news"
  },
  {
    "id": 11633,
    "mediaId": 6571,
    "date": "2022-03-26",
    "sentence": "",
    "author": "",
    "title": "First Case Of New Avian Flu Strain Detected In Pennsylvania"
  },
  {
    "id": 11687,
    "mediaId": 6571,
    "date": "2022-03-26",
    "sentence": "",
    "author": "",
    "title": "Congressional Candidate Arrested In Ohio On Menacing Charge"
  },
  {
    "id": 11767,
    "mediaId": 6571,
    "date": "2022-03-26",
    "sentence": "By: KDKA-TV News Staff\nHARRISBURG (KDKA) -- Ahead of the April 18 tax deadline, Attorney General <span class='selected-term'>Josh Shapiro</span> is warning taxpayers to be wary about potential scams.",
    "author": "",
    "title": "Attorney General Josh Shapiro Warns About IRS Tax Day Scams"
  },
  {
    "id": 11994,
    "mediaId": 2732,
    "date": "2022-03-26",
    "sentence": "But with Thomas’ former opponent working for Attorney General <span class='selected-term'>Josh Shapiro</span>, Tutera indicated on Friday that he plans to “raise questions” to potential jurors — and perhaps to the court — “over whether this is the appropriate body to handle this process.”\nTutera did not mention the issue during a brief hearing before state Supreme Court-appointed Cambria County Senior Judge Timothy Creany while prosecutors were also present Friday, instead discussing the matter with media afterward.",
    "author": "The Tribune-Democrat, Johnstown",
    "title": "Somerset DA Thomas' defense attorney calls sex assault case 'political'"
  },
  {
    "id": 9022,
    "mediaId": 4045,
    "date": "2022-03-26",
    "sentence": "",
    "author": "MARC LEVY - Associated Press",
    "title": "Abortion to elections: Republican candidates on the issues"
  },
  {
    "id": 11972,
    "mediaId": 8504,
    "date": "2022-03-27",
    "sentence": "He will then speak to Attorney General and governor hopeful <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Dennis Owens",
    "title": "This Week in Pennsylvania: Josh Shapiro & other Pa. news"
  },
  {
    "id": 11658,
    "mediaId": 8254,
    "date": "2022-03-28",
    "sentence": "Pennsylvania’s two-time elected state Attorney General <span class='selected-term'>Josh Shapiro</span> has a clear path to the Democratic Party’s nomination.",
    "author": "Marc Levy",
    "title": "Abortion to elections: Republican candidates on the issues"
  },
  {
    "id": 11936,
    "mediaId": 2732,
    "date": "2022-03-28",
    "sentence": "Tom Wolf and Attorney General <span class='selected-term'>Josh Shapiro</span> in 2017 created the Pennsylvania Reentry Council, or PARC, to help explore the best ways to reintegrate inmates into communities after their release and to keep them from returning to jail or prison.",
    "author": "Joe Napsha",
    "title": "Westmoreland County hires firm to reduce inmate recidivism"
  },
  {
    "id": 12389,
    "mediaId": 2509,
    "date": "2022-03-29",
    "sentence": "“The defendant has now been held accountable for her actions that led to the tragic death of Mr. McMaster,” Attorney General <span class='selected-term'>Josh Shapiro</span> wrote in an emailed release.",
    "author": "CLAUDIA LAUER Associated Press",
    "title": "Nurse pleads guilty in fatal fall of McMaster's father"
  },
  {
    "id": 12278,
    "mediaId": 2594,
    "date": "2022-03-29",
    "sentence": "“The defendant has now been held accountable for her actions that led to the tragic death of Mr. McMaster,” Attorney General <span class='selected-term'>Josh Shapiro</span> wrote in an emailed release.",
    "author": "Via AP news wire",
    "title": "Nurse pleads guilty in fatal fall of McMaster's father"
  },
  {
    "id": 11945,
    "mediaId": 2680,
    "date": "2022-03-29",
    "sentence": "“The defendant has now been held accountable for her actions that led to the tragic death of Mr. McMaster,” Attorney General <span class='selected-term'>Josh Shapiro</span> wrote in an emailed release.",
    "author": "CLAUDIA LAUER",
    "title": "Nurse pleads guilty in fatal fall of McMaster's father"
  },
  {
    "id": 12107,
    "mediaId": 2679,
    "date": "2022-03-29",
    "sentence": "“The defendant has now been held accountable for her actions that led to the tragic death of Mr. McMaster,” Attorney General <span class='selected-term'>Josh Shapiro</span> wrote in an emailed release.",
    "author": "CLAUDIA LAUER",
    "title": "Nurse pleads guilty in fatal fall of McMaster’s father"
  },
  {
    "id": 12415,
    "mediaId": 2728,
    "date": "2022-03-29",
    "sentence": "“The defendant has now been held accountable for her actions that led to the tragic death of Mr. McMaster,” Attorney General <span class='selected-term'>Josh Shapiro</span> wrote in an emailed release.",
    "author": "Claudia Lauer",
    "title": "Nurse pleads guilty in fatal fall of McMaster’s father"
  },
  {
    "id": 12043,
    "mediaId": 8401,
    "date": "2022-03-29",
    "sentence": "“The defendant has now been held accountable for her actions that led to the tragic death of Mr. McMaster,” Attorney General <span class='selected-term'>Josh Shapiro</span> wrote in an emailed release.",
    "author": "",
    "title": "Nurse Pleads Guilty In 2018 Fatal Fall Of H.R. McMaster’s Father At Philadelphia Senior Care Facility"
  },
  {
    "id": 12061,
    "mediaId": 8500,
    "date": "2022-03-29",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> also spoke.",
    "author": "Tom Garris",
    "title": "Pennsylvania AFL-CIO holding convention in Pittsburgh this week"
  },
  {
    "id": 12233,
    "mediaId": 8270,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Karen Shuey",
    "title": "Berks County to receive $16.3 million from national opioid settlement"
  },
  {
    "id": 12170,
    "mediaId": 8415,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Karen Shuey",
    "title": "Berks County to receive $16.3 million from national opioid settlement"
  },
  {
    "id": 10240,
    "mediaId": 8483,
    "date": "2022-03-29",
    "sentence": "Corman said there's growing momentum for a Republican to beat Democrat <span class='selected-term'>Josh Shapiro</span> in November.",
    "author": "Tom Lehman",
    "title": "One-on-one with Pennsylvania gubernatorial candidate Jake Corman"
  },
  {
    "id": 10592,
    "mediaId": 8380,
    "date": "2022-03-30",
    "sentence": "“The defendant has now been held accountable for her actions that led to the tragic death of Mr. McMaster,” Attorney General <span class='selected-term'>Josh Shapiro</span> wrote in an emailed release.",
    "author": "Claudia Lauer",
    "title": "Nurse Pleads Guilty in Fatal Fall of H.R. McMaster's Father in Philadelphia"
  },
  {
    "id": 10501,
    "mediaId": 8315,
    "date": "2022-03-30",
    "sentence": "On the Republican side are seven candidates:\nConservative activist Kathy Barnette, who has aligned herself with leading figures in the Trump-led push to overturn 2020's presidential election\nReal estate investor Jeff Bartos, who was the party's nominee for lieutenant governor in 2018\nLawyer George Bochetto\nLawyer Sean Gale\nFormer hedge fund CEO David McCormick\nMehmet Oz, the self-styled health and wellness guru and author best-known as host of daytime TV's “The Dr. Oz Show\"\nCarla Sands, Trump's former ambassador to Denmark who ran her late husband's commercial real estate empire in California\nGOVERNOR\nThe Democratic Party's presumed nominee, <span class='selected-term'>Josh Shapiro</span>, filed to run for governor in the midst of serving his second term as Pennsylvania's elected attorney general.",
    "author": "",
    "title": "Petitions Submitted for 2022 Primary Election"
  },
  {
    "id": 10279,
    "mediaId": 8404,
    "date": "2022-03-30",
    "sentence": "“The defendant has now been held accountable for her actions that led to the tragic death of Mr. McMaster,” Attorney General <span class='selected-term'>Josh Shapiro</span> wrote in an emailed release.",
    "author": "Associated Press",
    "title": "Nurse pleads guilty in fatal fall of McMaster’s father"
  },
  {
    "id": 10542,
    "mediaId": 8409,
    "date": "2022-03-30",
    "sentence": "While doxxing underage girls is apparently par-for-the-course for Sims, it doesn’t fit into <span class='selected-term'>Josh Shapiro</span>’s clean-cut formula for winning election in November.",
    "author": "Matthew J. Brouillette",
    "title": "Matthew J. Brouillette: Josh Shapiro’s Lt. Governor problem"
  },
  {
    "id": 10545,
    "mediaId": 8441,
    "date": "2022-03-30",
    "sentence": "While doxxing underage girls is apparently par-for-the-course for Sims, it doesn’t fit into <span class='selected-term'>Josh Shapiro</span>’s clean-cut formula for winning election in November.",
    "author": "Matthew J. Brouillette",
    "title": "Matthew J. Brouillette: Josh Shapiro’s Lt. Governor problem"
  },
  {
    "id": 10324,
    "mediaId": 8306,
    "date": "2022-03-30",
    "sentence": "Democrat Attorney General and gubernatorial candidate <span class='selected-term'>Josh Shapiro</span> has a problem.",
    "author": "Matthew J Brouillette",
    "title": "Matthew J. Brouillette: Josh Shapiro’s Lt. Governor problem"
  },
  {
    "id": 10419,
    "mediaId": 8437,
    "date": "2022-03-30",
    "sentence": "Democrat Attorney General and gubernatorial candidate <span class='selected-term'>Josh Shapiro</span> has a problem.",
    "author": "Matthew J Brouillette",
    "title": "Matthew J. Brouillette: Josh Shapiro’s Lt. Governor problem"
  },
  {
    "id": 10666,
    "mediaId": 8468,
    "date": "2022-03-30",
    "sentence": "While doxxing underage girls is apparently par-for-the-course for Sims, it doesn’t fit into <span class='selected-term'>Josh Shapiro</span>’s clean-cut formula for winning election in November.",
    "author": "Matthew J. Brouillette",
    "title": "Matthew J. Brouillette: Josh Shapiro’s Lt. Governor problem"
  },
  {
    "id": 10229,
    "mediaId": 8503,
    "date": "2022-03-30",
    "sentence": "Some of the earliest to arrive to the Bristol funeral home were Pennsylvania state troopers and state Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "",
    "title": "'Ultimate sacrifice:' Law enforcement, mourners honor PA State Trooper Martin Mack at viewing in Bucks County"
  },
  {
    "id": 10634,
    "mediaId": 8271,
    "date": "2022-03-31",
    "sentence": "At that press conference, Pa. Attorney General <span class='selected-term'>Josh Shapiro</span> suggested new statewide policy, like allocating funds to $6,000 signing bonuses for new officers and $1,200 “hero pay” to keep current officers on the job.",
    "author": "Jordan Levy",
    "title": "Philadelphia will consider adding $10k in bonuses to recruit more police officers"
  },
  {
    "id": 10115,
    "mediaId": 8481,
    "date": "2022-03-31",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span> is running unopposed in the Governor race.",
    "author": "George Stockburger",
    "title": "Pennsylvania 2022 Poll: Voters largely undecided in critical Senate, Governor races"
  },
  {
    "id": 10467,
    "mediaId": 8504,
    "date": "2022-03-31",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span> is running unopposed in the Governor race.",
    "author": "George Stockburger",
    "title": "Pennsylvania 2022 Poll: Voters largely undecided in critical Senate, Governor races"
  },
  {
    "id": 10627,
    "mediaId": 8254,
    "date": "2022-03-31",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span> is running unopposed in the Governor race.",
    "author": "George Stockburger",
    "title": "Pennsylvania 2022 Poll: Voters largely undecided in critical Senate, Governor races"
  },
  {
    "id": 10499,
    "mediaId": 8393,
    "date": "2022-03-31",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span> is running unopposed in the Governor race.",
    "author": "George Stockburger",
    "title": "Pennsylvania 2022 Poll: Voters largely undecided in critical Senate, Governor races"
  },
  {
    "id": 10355,
    "mediaId": 8467,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Jeff Werner",
    "title": "Pennsylvania State Trooper killed in the line of duty given a final salute in Bucks County"
  },
  {
    "id": 10383,
    "mediaId": 8493,
    "date": "2022-03-31",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span> is running unopposed in the Governor race.",
    "author": "WKOK Staff",
    "title": "PA Headlines: WHTM/Emerson Poll Has Most People Undecided in PA"
  },
  {
    "id": 9980,
    "mediaId": 8254,
    "date": "2022-03-31",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> sent out a tweet that read: “My heart goes out to Lebanon City Police Department.",
    "author": "James Wesser",
    "title": "Gov. Wolf, Pennsylvania leaders react to fatal Lebanon officer shooting"
  },
  {
    "id": 9813,
    "mediaId": 8322,
    "date": "2022-03-31",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span> tweeted his support of the officers.",
    "author": "",
    "title": "Pennsylvania officer, suspect killed, 2 officers wounded in gunfire exchange"
  },
  {
    "id": 10492,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "The legal request is tied up in court, with legislative Democrats and Democratic Attorney General <span class='selected-term'>Josh Shapiro</span> challenging the subpoena.",
    "author": "",
    "title": "'This is a charade': Pennsylvania Democrats walk out of GOP-led election hearing"
  },
  {
    "id": 10203,
    "mediaId": 2732,
    "date": "2022-04-01",
    "sentence": "That has been the case for this year’s May 17 primary race with Attorney General <span class='selected-term'>Josh Shapiro</span> and state Rep. Austin Davis of Allegheny County on the Democratic end; and Sen. Doug Mastriano of Franklin County and Teddy Daniels on the Republican side of the election ballot.",
    "author": "Angela Couloumbis | Spotlight Pa",
    "title": "Pa. election 2022: A guide to the primary race few voters are paying attention to"
  },
  {
    "id": 10385,
    "mediaId": 8503,
    "date": "2022-04-01",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> posted his condolences on Twitter for the Lebanon City Police Department.",
    "author": "",
    "title": "Lebanon police shooting: Here's what we know"
  },
  {
    "id": 10437,
    "mediaId": 8316,
    "date": "2022-04-01",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> posted his condolences on Twitter for the Lebanon City Police Department.",
    "author": "",
    "title": "Lebanon police shooting: Here's what we know"
  },
  {
    "id": 10656,
    "mediaId": 8483,
    "date": "2022-04-01",
    "sentence": "Pennsylvania State Attorney General <span class='selected-term'>Josh Shapiro</span> also released a statement, saying his heart goes out to the Lebanon City Police Department.",
    "author": "Lori Burkholder",
    "title": "Pennsylvania Sen. Bob Casey offers condolences after three Lebanon police officers are shot"
  },
  {
    "id": 10402,
    "mediaId": 8483,
    "date": "2022-04-02",
    "sentence": "The former congresswoman and state senator from Allegheny County thinks her experience running there could help her take on Democrat <span class='selected-term'>Josh Shapiro</span> in November.",
    "author": "Tom Lehman",
    "title": "One-on-one with Pennsylvania gubernatorial candidate Melissa Hart"
  },
  {
    "id": 10368,
    "mediaId": 8469,
    "date": "2022-04-03",
    "sentence": "• <span class='selected-term'>Josh Shapiro</span> is the only Democrat in the race.",
    "author": "Bill OBoyle boboyle@timesleader.com",
    "title": "Barletta says his experience is key to winning GOP governor nomination"
  },
  {
    "id": 10443,
    "mediaId": 2831,
    "date": "2022-04-03",
    "sentence": "But in Pennsylvania, Attorney General <span class='selected-term'>Josh Shapiro</span> showed how states can corral rapacious hospital chains without even invoking antitrust law.",
    "author": "Rob Wolfe",
    "title": "Laboratories of Anti-Monopoly"
  },
  {
    "id": 10145,
    "mediaId": 6571,
    "date": "2022-04-04",
    "sentence": "By: KDKA-TV News Staff\nPITTSBURGH (KDKA) - A \"predatory\" used car dealership in Penn Hills has been banned from doing business in Pennsylvania, Attorney General <span class='selected-term'>Josh Shapiro</span> announced Monday.",
    "author": "",
    "title": "'Predatory' Penn Hills Dealership Banned From Selling Cars In Pennsylvania"
  },
  {
    "id": 10167,
    "mediaId": 8356,
    "date": "2022-04-04",
    "sentence": "That has been the case for this year’s May 17 primary race with Attorney General <span class='selected-term'>Josh Shapiro</span> and state Rep. Austin Davis of Allegheny County on the Democratic end; and Sen. Doug Mastriano of Franklin County and Teddy Daniels on the Republican side of the election ballot.",
    "author": "Angela Couloumbis of Spotlight PA",
    "title": "Pa. election 2022: A guide to the primary race for lieutenant governor"
  },
  {
    "id": 8600,
    "mediaId": 8468,
    "date": "2022-04-05",
    "sentence": "",
    "author": "Mark Nemirow",
    "title": "Wolf vows special session if lawmaker’s child sexual abuse legislation isn’t passed"
  },
  {
    "id": 8406,
    "mediaId": 8300,
    "date": "2022-04-05",
    "sentence": "In 2018 Attorney General <span class='selected-term'>Josh Shapiro</span> released similar findings in a grand jury investigation of six other Catholic dioceses across the state.",
    "author": "Mark Nemirow",
    "title": "Wolf vows special session if lawmaker’s child sexual abuse legislation isn’t passed"
  },
  {
    "id": 8300,
    "mediaId": 8305,
    "date": "2022-04-05",
    "sentence": "In 2018 Attorney General <span class='selected-term'>Josh Shapiro</span> released similar findings in a grand jury investigation of six other Catholic dioceses across the state.",
    "author": "Mark Nemirow",
    "title": "Wolf vows special session if lawmaker’s child sexual abuse legislation isn’t passed"
  },
  {
    "id": 8450,
    "mediaId": 8418,
    "date": "2022-04-05",
    "sentence": "",
    "author": "Mark Nemirow",
    "title": "Wolf vows special session if lawmaker’s child sexual abuse legislation isn’t passed"
  },
  {
    "id": 8368,
    "mediaId": 8503,
    "date": "2022-04-05",
    "sentence": "Here is the list of candidates who have filed to run on the ballot in the primary:\nUnited States Senator\nThe Democratic candidates are:\nKevin Baumlin\nJohn Fetterman\nMalcolm Kenyatta\nAlex Khalil\nConor Lamb\nThe Republican candidates are:\nKathy Barnette\nJeff Bartos\nGeorge Bochetto\nSean Gale\nDave McCormick\nMehmet Oz\nCarla Sands\nGovernor\nJust one Democratic candidate is running for the position: <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Teresa Boeckel",
    "title": "Primary 2022: Who is on the ballot in central Pa.?"
  },
  {
    "id": 8756,
    "mediaId": 2732,
    "date": "2022-04-05",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> announced in a press release Monday that Martino Motors, 536 Rodi Road, violated an Assurance of Voluntary Compliance (AVC) that the dealership entered into in 2014.",
    "author": "Tanisha Thomas",
    "title": "AG Josh Shapiro bans Martino Motors from selling cars"
  },
  {
    "id": 8389,
    "mediaId": 2732,
    "date": "2022-04-06",
    "sentence": "",
    "author": "",
    "title": "Trib Total Media to co-host political debates ahead of Pa. primary election"
  },
  {
    "id": 8748,
    "mediaId": 8500,
    "date": "2022-04-06",
    "sentence": "Pittsburgh’s Action News 4 asked Democratic opponent, Attorney General <span class='selected-term'>Josh Shapiro</span>, about McSwain's proposal.",
    "author": "",
    "title": "Republican Bill McSwain campaigns for governor; promises to cut state’s gas tax in half"
  },
  {
    "id": 8667,
    "mediaId": 8500,
    "date": "2022-04-06",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> was in Pittsburgh on Wednesday to talk with students about mental health.",
    "author": "",
    "title": "Shapiro talks importance of mental health awareness at Pittsburgh roundtable"
  },
  {
    "id": 8510,
    "mediaId": 8490,
    "date": "2022-04-06",
    "sentence": "Butler Township Commissioner Dave Zarnick, Butler City Mayor Bob Dandoy, and Butler County Commissioner Kevin Boozel join PA Attorney General and Democratic candidate for governor <span class='selected-term'>Josh Shapiro</span> in Butler.",
    "author": "Tyler Friel",
    "title": "Shapiro Stops In Butler"
  },
  {
    "id": 8834,
    "mediaId": 8393,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> says the Safe2Say Something PA special report highlights the need to increase mental health counseling in schools.",
    "author": "Caroline Foreback",
    "title": "‘Safe2Say Something PA’ stepping up resources for mental health"
  },
  {
    "id": 8674,
    "mediaId": 8253,
    "date": "2022-04-07",
    "sentence": "Officials like Mayor Jim Kenney, Fraternal Order of Police President John McNesby, Philadelphia Police Commissioner Danielle Outlaw and Attorney General <span class='selected-term'>Josh Shapiro</span> and SEPTA General Manager Leslie Richards came to check on the officer's condition.",
    "author": "Corey Davis",
    "title": "SEPTA officer shot while providing cover for Philadelphia officer during gun battle"
  },
  {
    "id": 8583,
    "mediaId": 8452,
    "date": "2022-04-08",
    "sentence": "He also makes a point to post about meeting celebrities, like Spike Lee, and politicians, like Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Fallon Roth",
    "title": "Temple president highlights university brand through social media platforms"
  },
  {
    "id": 8003,
    "mediaId": 2621,
    "date": "2022-04-08",
    "sentence": "In the segment, Hillyard also has his firearm put together by off-camera hands working for Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Zachary Leeman",
    "title": "ATF Evaluating Whether NBC News ‘Ghost Guns’ Segment Broke the Law"
  },
  {
    "id": 8729,
    "mediaId": 2522,
    "date": "2022-04-09",
    "sentence": "As a side note, Hillyard also had the firearm constructed in the segment by an off-camera individual who reportedly works for Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Terresa Monroe-Hamilton",
    "title": "ATF responds to claims NBC News’ ‘ghost guns’ segment may have broken the law"
  },
  {
    "id": 8578,
    "mediaId": 8380,
    "date": "2022-04-09",
    "sentence": "The presumed Democratic nominee for governor, state Attorney General <span class='selected-term'>Josh Shapiro</span>, talks of balancing natural gas with expanding renewable energy.",
    "author": "Marc Levy",
    "title": "GOP's Energy Promises Face Limits in Pa. Governor's Race"
  },
  {
    "id": 6511,
    "mediaId": 8254,
    "date": "2022-04-10",
    "sentence": "",
    "author": "George Stockburger",
    "title": "Who’s running for Governor of Pennsylvania in 2022?"
  },
  {
    "id": 6678,
    "mediaId": 8469,
    "date": "2022-04-10",
    "sentence": "The presumed , state Attorney General <span class='selected-term'>Josh Shapiro</span>, talks of balancing natural gas with expanding renewable energy.",
    "author": "MARC LEVY",
    "title": "GOP’s energy promises face limits in Pa. governor’s race"
  },
  {
    "id": 6650,
    "mediaId": 8489,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Kenny Cooper",
    "title": "Delco unveils plan to address kids’ mental health crisis made ‘catastrophically worse’ during pandemic"
  },
  {
    "id": 6900,
    "mediaId": 8483,
    "date": "2022-04-10",
    "sentence": "This time, he's hoping to win the Republican primary for governor and beat Democrat <span class='selected-term'>Josh Shapiro</span> in November.",
    "author": "Tom Lehman",
    "title": "One-on-one with Pennsylvania gubernatorial candidate Lou Barletta"
  },
  {
    "id": 7045,
    "mediaId": 8368,
    "date": "2022-04-10",
    "sentence": "The presumed Democratic nominee for governor, state Attorney General <span class='selected-term'>Josh Shapiro</span>, talks of balancing natural gas with expanding renewable energy.",
    "author": "Associated Press",
    "title": "GOP’s energy promises face limits in Pa. governor’s race"
  },
  {
    "id": 6879,
    "mediaId": 2754,
    "date": "2022-04-10",
    "sentence": "A new ATF rule re-classifying these kits as firearms is pending, but until then, the market is burgeoning as # of them recovered at crime scenes jumps.pic.twitter.com/9FRmOnyI1N https://t.co/2K00kUgWWS\n— Vaughn Hillyard (@VaughnHillyard) March 18, 2022\nLast week, the heads of the Second Amendment Foundation, Gun Owners of America, American Firearms Association, National Association for Gun Rights, and Pennsylvania Firearms Association sent a three-page letter to the Pennsylvania House of Representatives to investigate Attorney General <span class='selected-term'>Josh Shapiro</span> and his special agents who manufactured and transferred an un-serialized weapon to the Hillyard (the NBC reporter).",
    "author": "Tyler Durden",
    "title": "Gun Advocacy Groups Demand Investigation Of Potentially Unlawful NBC News \"Ghost Gun\" Segment"
  },
  {
    "id": 5507,
    "mediaId": 2509,
    "date": "2022-04-10",
    "sentence": "The presumed Democratic nominee for governor, state Attorney General <span class='selected-term'>Josh Shapiro</span>, talks of balancing natural gas with expanding renewable energy.",
    "author": "MARC LEVY Associated Press",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 5564,
    "mediaId": 2680,
    "date": "2022-04-10",
    "sentence": "The presumed Democratic nominee for governor, state Attorney General <span class='selected-term'>Josh Shapiro</span>, talks of balancing natural gas with expanding renewable energy.",
    "author": "MARC LEVY",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 6025,
    "mediaId": 2679,
    "date": "2022-04-10",
    "sentence": "The presumed Democratic nominee for governor, state Attorney General <span class='selected-term'>Josh Shapiro</span>, talks of balancing natural gas with expanding renewable energy.",
    "author": "MARC LEVY",
    "title": "GOP’s energy promises face limits in Pa. governor’s race"
  },
  {
    "id": 5612,
    "mediaId": 4045,
    "date": "2022-04-10",
    "sentence": "",
    "author": "MARC LEVY - Associated Press",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 6894,
    "mediaId": 2685,
    "date": "2022-04-11",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who was attending Monday's event at the White House, applauded the move and pointed to a serious uptick in ghost guns being found by police.",
    "author": "MICHAEL BALSAMO and ZEKE MILLER Associated Press",
    "title": "Biden aims at 'ghost gun' violence with new federal rule"
  },
  {
    "id": 6624,
    "mediaId": 2912,
    "date": "2022-04-11",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who was attending Monday’s event at the White House, applauded the move and pointed to a serious uptick in ghost guns being found by police.",
    "author": "",
    "title": "Biden aims at ‘ghost gun’ violence with new federal rule"
  },
  {
    "id": 6838,
    "mediaId": 2677,
    "date": "2022-04-11",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who was attending Monday’s event at the White House, applauded the move and pointed to a serious uptick in ghost guns being found by police.",
    "author": "Associated Press",
    "title": "Biden aims at ‘ghost gun’ violence with new federal rule"
  },
  {
    "id": 6750,
    "mediaId": 2898,
    "date": "2022-04-11",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who was attending Monday’s event at the White House, applauded the move and pointed to a serious uptick in ghost guns being found by police.",
    "author": "MICHAEL BALSAMO",
    "title": "Biden to nominate new ATF director, release ghost gun rule"
  },
  {
    "id": 6666,
    "mediaId": 6570,
    "date": "2022-04-11",
    "sentence": "Hours after the Biden administration announced measures to make “ghost guns” — home-assembled firearms without serial numbers — harder for felons to access, Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> told media he was prepared to handle legal challenges to the ruling.",
    "author": "Jesse Bunch",
    "title": "AG Josh Shapiro says he'll fight challenges to Biden's crackdown on ghost guns"
  },
  {
    "id": 6192,
    "mediaId": 2658,
    "date": "2022-04-11",
    "sentence": "“It’s long overdue.”\nPennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who also attended the White House announcement, said Philadelphia had seen a nearly 500 percent increase in recovered ghost guns in the past two years.",
    "author": "",
    "title": "Biden’s solution to the politics of rising crime: Focus on guns"
  },
  {
    "id": 5597,
    "mediaId": 2550,
    "date": "2022-04-11",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span>, who has no intra-party opposition, raised $4.53 million, which is almost as much as those five Republicans put together.",
    "author": "",
    "title": "conspiracy, Andrew Cuomo won't be on the ballot"
  },
  {
    "id": 6745,
    "mediaId": 2732,
    "date": "2022-04-11",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who was attending Monday’s event at the White House, applauded the move and pointed to a serious uptick in ghost guns being found by police.",
    "author": "Associated Press",
    "title": "Biden aims at 'ghost gun' violence with new federal rule"
  },
  {
    "id": 6605,
    "mediaId": 2532,
    "date": "2022-04-11",
    "sentence": "",
    "author": "",
    "title": "Watch CBS News"
  },
  {
    "id": 6739,
    "mediaId": 2654,
    "date": "2022-04-11",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who was attending Monday’s event at the White House, applauded the move and pointed to a serious uptick in ghost guns being found by police.",
    "author": "Michael Balsamo",
    "title": "Biden issues new federal rule aimed at privately made ‘ghost guns’ without serial numbers"
  },
  {
    "id": 6994,
    "mediaId": 2572,
    "date": "2022-04-11",
    "sentence": "Pennsylvania gubernatorial candidate <span class='selected-term'>Josh Shapiro</span> came out against Philadelphia's decision to reinstate the indoor mask mandate on Monday.",
    "author": "Lindsay Kornick",
    "title": "Pennsylvania Democrat running for governor opposes Philadelphia's mask mandate"
  },
  {
    "id": 6693,
    "mediaId": 8493,
    "date": "2022-04-11",
    "sentence": "Whoever wins will take on State Attorney General <span class='selected-term'>Josh Shapiro</span>, the presumptive Democratic nominee, who had $16 million in his campaign account at the close of the three-month period ending March 28 — a huge financial advantage over his prospective GOP rivals.",
    "author": "WKOK Staff",
    "title": "PA Headlines: DNA Used in I-81 IDs, GOP Candidate Spending Update"
  },
  {
    "id": 6416,
    "mediaId": 8500,
    "date": "2022-04-11",
    "sentence": "The presumed Democratic nominee for governor, state Attorney General <span class='selected-term'>Josh Shapiro</span>, talks of balancing natural gas with expanding renewable energy.",
    "author": "MARC LEVY Associated Press",
    "title": "GOP's energy promises face limits in Pa. governor's race"
  },
  {
    "id": 6772,
    "mediaId": 8504,
    "date": "2022-04-11",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who was attending Monday’s event at the White House, applauded the move and pointed to a serious uptick in ghost guns being found by police.",
    "author": "The Associated Press",
    "title": "Biden to nominate new ATF director, release ghost gun rule"
  },
  {
    "id": 6290,
    "mediaId": 8368,
    "date": "2022-04-11",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who was attending Monday’s event at the White House, applauded the move and pointed to a serious uptick in ghost guns being found by police.",
    "author": "Associated Press",
    "title": "Biden aims at ‘ghost gun’ violence with new federal rule"
  },
  {
    "id": 6392,
    "mediaId": 8254,
    "date": "2022-04-11",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> points to a bust in the Kensington area where someone left a gun show with duffle bags of gun kits.",
    "author": "Ben Schad",
    "title": "Pa. gun owners, state officials react to new federal ‘ghost gun’ rule"
  },
  {
    "id": 6536,
    "mediaId": 8490,
    "date": "2022-04-12",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> was in Washington D.C. yesterday to join President Joe Biden to promote a new federal rule designed to curb so-called ghost guns.",
    "author": "Tyler Friel",
    "title": "AG Shapiro Praises New Federal Ghost Gun Regulation"
  },
  {
    "id": 6992,
    "mediaId": 8493,
    "date": "2022-04-12",
    "sentence": "Candidates at Susquehanna Valley Conservatives Forum\nLEWISBURG – The current field of candidates for Governor and Lieutenant Governor on the crowded GOP ticket all agree on what’s at stake versus <span class='selected-term'>Josh Shapiro</span> and state democrats…but that didn’t stop one gubernatorial candidate from taking a big shot at one current favorite.",
    "author": "WKOK Staff",
    "title": "At Local Forum, Gubernatorial Candidate Gale Calls Out Mastriano"
  },
  {
    "id": 6300,
    "mediaId": 8368,
    "date": "2022-04-12",
    "sentence": "On the Democratic side, state Attorney General <span class='selected-term'>Josh Shapiro</span> appears set to cruise to his party’s nomination for governor.",
    "author": "Jack Tomczuk",
    "title": "Trump blasts GOP governor hopeful McSwain"
  },
  {
    "id": 6488,
    "mediaId": 8469,
    "date": "2022-04-12",
    "sentence": "The attorney general, <span class='selected-term'>Josh Shapiro</span>, is now the presumptive Democratic nominee for governor.",
    "author": "MICHAEL RUBINKAM",
    "title": "Trump slams McSwain, who’d sought his endorsement for gov"
  },
  {
    "id": 6874,
    "mediaId": 8380,
    "date": "2022-04-12",
    "sentence": "The winner of the May 17 primary will take on state Attorney General <span class='selected-term'>Josh Shapiro</span>, who is running unopposed in the Democratic primary.",
    "author": "Brian X. McCrone",
    "title": "Call with Trump Leads Pa. GOP Candidate to Stay in Race for Governor"
  },
  {
    "id": 6480,
    "mediaId": 8271,
    "date": "2022-04-12",
    "sentence": "“We never dropped the vaccine requirement, either.”\nAsked about Philly’s mask mandate while at a gun safety forum in Washington, Pa. Attorney General <span class='selected-term'>Josh Shapiro</span>, who is running for governor, reportedly called it “counterproductive.”\nMayor Jim Kenney, meanwhile, distanced himself from the announcement.",
    "author": "Billy Penn Staff",
    "title": "Philadelphia’s mask mandate makes national headlines and sparks local debate"
  },
  {
    "id": 6413,
    "mediaId": 8489,
    "date": "2022-04-12",
    "sentence": "In the race for governor, Democrats across the Keystone State are hoping to keep their party in office with the election of lone candidate Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "",
    "title": "Pa. Elections: Political Roundtable"
  },
  {
    "id": 6864,
    "mediaId": 8500,
    "date": "2022-04-12",
    "sentence": "The nine-person field has some state GOP officials worried that a badly divided primary electorate will choose a nominee who can’t beat presumptive Democratic nominee <span class='selected-term'>Josh Shapiro</span>, the state attorney general.",
    "author": "The Associated Press",
    "title": "Trump intervenes in Pennsylvania GOP gubernatorial primary"
  },
  {
    "id": 6659,
    "mediaId": 8469,
    "date": "2022-04-12",
    "sentence": "The nine-person field has some that a badly divided primary electorate will choose a nominee who can’t beat presumptive Democratic nominee <span class='selected-term'>Josh Shapiro</span>, the state attorney general.",
    "author": "",
    "title": "Trump intervenes in Pennsylvania GOP gubernatorial primary"
  },
  {
    "id": 6577,
    "mediaId": 8314,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Jason Villemez",
    "title": "Your equal rights might be gone soon, in Pa. and elsewhere"
  },
  {
    "id": 6799,
    "mediaId": 4024,
    "date": "2022-04-12",
    "sentence": "The government suggested that the level 2 mask measure will “protect our most vulnerable residents,” arguing that “[w]earing a mask around others is an easy way to do that.”\n<span class='selected-term'>Josh Shapiro</span>, the attorney general for Pennsylvania and Democratic gubernatorial candidate for the state’s upcoming election, opposed the decision to reinstate masking in the state’s most populous city.",
    "author": "David\nMcLoone",
    "title": "Philadelphia reinstates mask mandate, encourages residents to snitch on non-compliant businesses"
  },
  {
    "id": 5224,
    "mediaId": 2746,
    "date": "2022-04-12",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> is the presumptive Democratic nominee for governor.",
    "author": "",
    "title": "Trump slams McSwain, who’d sought his endorsement for gov"
  },
  {
    "id": 5836,
    "mediaId": 2746,
    "date": "2022-04-12",
    "sentence": "State Attorney General <span class='selected-term'>Josh Shapiro</span> is the leading Democratic candidate for governor.",
    "author": "Dave Boyer",
    "title": "Trump slams GOP candidate in Pa. governor’s race for not going after 2020 election fraud"
  },
  {
    "id": 5942,
    "mediaId": 8401,
    "date": "2022-04-12",
    "sentence": "READ MORE:\nAttorney General <span class='selected-term'>Josh Shapiro</span> is the presumptive Democratic nominee for governor.",
    "author": "",
    "title": "Former President Donald Trump Slams Bill McSwain, Who’d Sought His Endorsement For Pennsylvania Governor"
  },
  {
    "id": 6848,
    "mediaId": 2732,
    "date": "2022-04-12",
    "sentence": "With so many global issues impacting household expenses, I am grateful for the real solutions recently introduced by Attorney General <span class='selected-term'>Josh Shapiro</span> that will bring real relief to my family.",
    "author": "",
    "title": "Letter to the editor: Shapiro will continue to help Pennsylvanians"
  },
  {
    "id": 5254,
    "mediaId": 2732,
    "date": "2022-04-12",
    "sentence": "Though Attorney General <span class='selected-term'>Josh Shapiro</span> is running unopposed in the gubernatorial primary, the Senate race remains a battle between the party’s progressive and moderate wings.",
    "author": "David Thornburgh",
    "title": "David Thornburgh: High stakes in Pa.'s primary races"
  },
  {
    "id": 5889,
    "mediaId": 2732,
    "date": "2022-04-12",
    "sentence": "Bill’s record of upholding the law and going after criminals speaks for itself.”\nOn the campaign trail, McSwain points to himself as the only prosecutor in the Republican gubernatorial primary race and the opposite of the prosecutor who is running unopposed in his bid for the Democratic gubernatorial nomination: <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Pennlive.Com",
    "title": "Trump weighs in on Pa. governor’s race, naming candidate he's not endorsing"
  },
  {
    "id": 5547,
    "mediaId": 2822,
    "date": "2022-04-12",
    "sentence": "The nine-person field has some state GOP officials worried that a badly divided primary electorate will choose a nominee who can’t beat presumptive Democratic nominee <span class='selected-term'>Josh Shapiro</span>, the state attorney general.",
    "author": "",
    "title": "Trump intervenes in Pennsylvania GOP gubernatorial primary"
  },
  {
    "id": 5357,
    "mediaId": 2664,
    "date": "2022-04-12",
    "sentence": "\"The developments didn’t bring much clarity to the crowded race to take on state Attorney General <span class='selected-term'>Josh Shapiro</span>, the presumptive Democratic nominee.",
    "author": "Bob Brigham",
    "title": "'Whiplash-inducing': Trump is 'still sowing chaos' in Pennsylvania GOP politics"
  },
  {
    "id": 6573,
    "mediaId": 8314,
    "date": "2022-04-13",
    "sentence": "My office still was one of the top offices in terms of responding to unemployment, getting people rent assistance… and also all the random things that come up on a daily basis that people expect their elected officials to help them with and show up and do.”\nAttorney General <span class='selected-term'>Josh Shapiro</span>, who is running unopposed in the gubernatorial primary, spoke via Zoom about his work enacting LGBTQ nondiscrimination laws in Montgomery County, and fighting to preserve marriage equality.",
    "author": "Michele Zipkin -",
    "title": "Candidates make their case to LGBTQ voters"
  },
  {
    "id": 6644,
    "mediaId": 8449,
    "date": "2022-04-13",
    "sentence": "Una pareja de Yardley, Pensilvania, se declaró culpable de robar cientos de vehículos en el estado, así como de un allanamiento de morada en el que cargaron con miles de dólares, informó el fiscal general, <span class='selected-term'>Josh Shapiro</span>.",
    "author": "",
    "title": "Pareja se declara culpable de robar cientos de autos"
  },
  {
    "id": 6510,
    "mediaId": 8404,
    "date": "2022-04-13",
    "sentence": "The nine-person field has some state GOP officials worried that a badly divided primary electorate will choose a nominee who can’t beat presumptive Democratic nominee <span class='selected-term'>Josh Shapiro</span>, the state attorney general.",
    "author": "Associated Press",
    "title": "Trump intervenes in Pennsylvania GOP gubernatorial primary"
  },
  {
    "id": 6410,
    "mediaId": 8418,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Bill Rettew",
    "title": "Upper Uwchlan resident DiGiulio running for governor"
  },
  {
    "id": 7043,
    "mediaId": 8437,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Bill Rettew",
    "title": "Upper Uwchlan resident DiGiulio running for governor"
  },
  {
    "id": 6929,
    "mediaId": 8305,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Bill Rettew",
    "title": "Upper Uwchlan resident DiGiulio running for governor"
  },
  {
    "id": 6562,
    "mediaId": 8270,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Bill Rettew",
    "title": "Upper Uwchlan resident DiGiulio running for governor on Green Party ticket"
  },
  {
    "id": 6467,
    "mediaId": 8427,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Bill Rettew",
    "title": "Upper Uwchlan resident DiGiulio running for governor"
  },
  {
    "id": 6623,
    "mediaId": 8409,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Bill Rettew",
    "title": "Upper Uwchlan resident DiGiulio running for governor"
  },
  {
    "id": 6496,
    "mediaId": 8325,
    "date": "2022-04-13",
    "sentence": "HARRISBURG – Today, Department of Drug and Alcohol Programs (DDAP) Secretary Jen Smith virtually joined Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, Butler County Commissioner and County Commissioners Association of Pennsylvania Board Chairman Kevin Boozel, and Berks County Council on Chemical Abuse to discuss the incoming opioid settlement funding in Pennsylvania.",
    "author": "Gant Team",
    "title": "Dept. of Drug and Alcohol Programs, AG Shapiro Discuss Opioid Settlement Funding in PA"
  },
  {
    "id": 6426,
    "mediaId": 8393,
    "date": "2022-04-13",
    "sentence": "Which sadly kills 14 Pennsylvanians each and every day,” said State Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Cody Butler",
    "title": "Lackawanna County to receive money from opioid lawsuit settlement"
  },
  {
    "id": 6689,
    "mediaId": 8493,
    "date": "2022-04-13",
    "sentence": "Just as notable, it found 44% of those polled remain undecided as to who will get their vote in the primary to face off against presumed Democratic nominee <span class='selected-term'>Josh Shapiro</span>, who is unopposed for his party’s nomination.",
    "author": "WKOK Staff",
    "title": "Report: Mastriano Leads in New Gov Poll, Barletta Falls Behind"
  },
  {
    "id": 6692,
    "mediaId": 8325,
    "date": "2022-04-14",
    "sentence": "The Republican candidate who emerges victorious in the primary will face state Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running unopposed.",
    "author": "Gant Team",
    "title": "PA Primary Election 2022: See How Much Money the GOP Candidates for Governor Have Raised"
  },
  {
    "id": 6961,
    "mediaId": 8380,
    "date": "2022-04-14",
    "sentence": "Democratic Attorney General <span class='selected-term'>Josh Shapiro</span> is running unopposed in the May 17 primary.",
    "author": "Rudy Chinchilla",
    "title": "Progressive Democrat, Far-Right Republican Lead Key Pa. Races, Poll Says"
  },
  {
    "id": 6465,
    "mediaId": 8503,
    "date": "2022-04-14",
    "sentence": "His supporters love him for it, but critics say his base of supporters won’t help him carry the suburban and urban voters he will need to win a general election against Democrat <span class='selected-term'>Josh Shapiro</span>.",
    "author": "",
    "title": "Doug Mastriano could ride 2020 election denial into the PA governor's mansion"
  },
  {
    "id": 6973,
    "mediaId": 6570,
    "date": "2022-04-14",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> has, sensibly, vowed to defend the new regulation against challenges that emerge in this state.",
    "author": "The Editorial Board",
    "title": "Editorial: Joe Biden, Josh Shapiro right to target ghost guns"
  },
  {
    "id": 5873,
    "mediaId": 2732,
    "date": "2022-04-14",
    "sentence": "The Republican candidate who emerges victorious in the primary will face state Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat who is running unopposed.",
    "author": "Angela Couloumbis",
    "title": "Pa. primary election 2022: See how much money the GOP candidates for governor have raised"
  },
  {
    "id": 6301,
    "mediaId": 3993,
    "date": "2022-04-15",
    "sentence": "Pennsylvania State House Speaker Bryan D. Cutler has advised a group of gun rights organizations including the Second Amendment Foundation that he is “reviewing all allowable actions at the disposal of the General Assembly” in reaction to a call for an investigation following what appears to have been a violation of various state and federal gun laws in a recent NBC hidden camera report on “ghost guns.”\nThe undercover report involved NBC reporter Vaughn Hillyard and the office of Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> in which Hillyard purchased two P80 firearm kits.",
    "author": "John Petrolino",
    "title": "PA House Speaker looking into whether laws were broken for NBC's ghost gun story"
  },
  {
    "id": 6681,
    "mediaId": 8449,
    "date": "2022-04-15",
    "sentence": "El fiscal general demócrata <span class='selected-term'>Josh Shapiro</span> se postula sin oposición en las primarias del 17 de mayo.",
    "author": "",
    "title": "Demócrata progresista y republicano de extrema lideran contiendas clave"
  },
  {
    "id": 6331,
    "mediaId": 8254,
    "date": "2022-04-15",
    "sentence": "Democrats have just four candidates in the Senate race and one, <span class='selected-term'>Josh Shapiro</span>, running for Governor.",
    "author": "Dennis Owens",
    "title": "Pennsylvania bill would allow Independents to vote in primary elections"
  },
  {
    "id": 6272,
    "mediaId": 8504,
    "date": "2022-04-15",
    "sentence": "(WJET/WFXP/YourErie.com) — A group of supporters at the iconic Plaza Restaurant in Warren, Pa. applauded as <span class='selected-term'>Josh Shapiro</span> addressed issues facing the state.",
    "author": "Fontaine Glenn",
    "title": "PA Governor Candidate Josh Shapiro visits Warren"
  },
  {
    "id": 6285,
    "mediaId": 8504,
    "date": "2022-04-15",
    "sentence": "Democrats have just four candidates in the Senate race and one, <span class='selected-term'>Josh Shapiro</span>, running for Governor.",
    "author": "Dennis Owens",
    "title": "Pennsylvania bill would allow Independents to vote in primary elections"
  },
  {
    "id": 6183,
    "mediaId": 8254,
    "date": "2022-04-15",
    "sentence": "(WJET/WFXP/YourErie.com) — A group of supporters at the iconic Plaza Restaurant in Warren, Pa. applauded as <span class='selected-term'>Josh Shapiro</span> addressed issues facing the state.",
    "author": "Fontaine Glenn",
    "title": "PA Governor Candidate Josh Shapiro visits Warren"
  },
  {
    "id": 6538,
    "mediaId": 8500,
    "date": "2022-04-15",
    "sentence": "So when the Shapiro camp noticed \"ENDORSED <span class='selected-term'>JOSH SHAPIRO</span>,\" along with a check-marked ribbon, appeared at the end of Sims' new statewide ad, lawyers fired off a cease-and-desist order.",
    "author": "MARK SCOLFORO Associated Press",
    "title": "Shapiro: Dem candidate's ad wrongly implies endorsement"
  },
  {
    "id": 6572,
    "mediaId": 8483,
    "date": "2022-04-16",
    "sentence": "Charlie Gerow, who is running for the Republican nomination, thinks he can offer the GOP its best chance of beating Democrat <span class='selected-term'>Josh Shapiro</span> this fall.",
    "author": "Tom Lehman",
    "title": "One-on-one with Pennsylvania gubernatorial candidate Charlie Gerow"
  },
  {
    "id": 6212,
    "mediaId": 8254,
    "date": "2022-04-16",
    "sentence": "So when the Shapiro camp noticed “ENDORSED <span class='selected-term'>JOSH SHAPIRO</span>,” along with a check-marked ribbon, appeared at the end of Sims’ new statewide ad, lawyers fired off a cease-and-desist order.",
    "author": "Mark Scolforo",
    "title": "Shapiro: Dem candidate’s ad wrongly implies endorsement"
  },
  {
    "id": 6284,
    "mediaId": 6571,
    "date": "2022-04-16",
    "sentence": "So when the Shapiro camp noticed \"ENDORSED <span class='selected-term'>JOSH SHAPIRO</span>,\" along with a check-marked ribbon, appeared at the end of Sims' new statewide ad, lawyers fired off a cease-and-desist order.",
    "author": "",
    "title": "Shapiro: Dem candidate's ad wrongly implies endorsement"
  },
  {
    "id": 5815,
    "mediaId": 2732,
    "date": "2022-04-18",
    "sentence": "There will be no Democratic gubernatorial debate because Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is running unopposed.",
    "author": "Paula Reed Ward",
    "title": "Trib Total Media co-sponsoring debate in Pa.'s hotly contested GOP primary race for governor"
  },
  {
    "id": 6442,
    "mediaId": 8503,
    "date": "2022-04-18",
    "sentence": "The primary election is May 17, and the winner of the Republican nomination will take on state Attorney General <span class='selected-term'>Josh Shapiro</span>, the presumed Democratic nominee.",
    "author": "",
    "title": "Bill McSwain still touts Trump connection even though the ex-president trashed him"
  },
  {
    "id": 4704,
    "mediaId": 8481,
    "date": "2022-04-18",
    "sentence": "We are just going to do the best we can to try and win this because it’s very important that we beat <span class='selected-term'>Josh Shapiro</span> in November.”\nBarletta will be joined on stage with Doug Mastriano, Dave White, and Bill McSwain in Harrisburg on April 27th for a debate right here on WTAJ.",
    "author": "Jordan Tracy",
    "title": "Lou Barletta talks governor’s race as primary looms"
  },
  {
    "id": 4686,
    "mediaId": 8254,
    "date": "2022-04-18",
    "sentence": "We are just going to do the best we can to try and win this because it’s very important that we beat <span class='selected-term'>Josh Shapiro</span> in November.”\nBarletta will be joined on stage with Doug Mastriano, Dave White, and Bill McSwain in Harrisburg on April 27th for a debate right here on WTAJ.",
    "author": "Jordan Tracy",
    "title": "Lou Barletta talks governor’s race as primary looms"
  },
  {
    "id": 5129,
    "mediaId": 8427,
    "date": "2022-04-18",
    "sentence": "",
    "author": "For MediaNews Group",
    "title": "Letter to the Editor: Gov. Wolf ignores Pa. constitution again"
  },
  {
    "id": 4885,
    "mediaId": 8415,
    "date": "2022-04-18",
    "sentence": "Wolf’s term as governor will end this year due to term limits, but his Attorney General, Democrat <span class='selected-term'>Josh Shapiro</span>, will happily step into the role of a dictator if elected in November.",
    "author": "For Medianews Group",
    "title": "Letter to the Editor: Gov. Wolf ignores Pa. constitution again"
  },
  {
    "id": 4752,
    "mediaId": 8315,
    "date": "2022-04-18",
    "sentence": "That one candidate is no stranger to public service: Pennsylvania’s Attorney General, <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Brendan Scanland",
    "title": "Meet the Candidates: Josh Shapiro for PA Governor"
  },
  {
    "id": 5030,
    "mediaId": 8437,
    "date": "2022-04-18",
    "sentence": "Wolf’s term as governor will end this year due to term limits, but his Attorney General, Democrat <span class='selected-term'>Josh Shapiro</span>, will happily step into the role of a dictator if elected in November.",
    "author": "For Medianews Group",
    "title": "Letter to the Editor: Gov. Wolf ignores Pa. constitution again"
  },
  {
    "id": 4744,
    "mediaId": 8315,
    "date": "2022-04-18",
    "sentence": "",
    "author": "",
    "title": "Meet the Candidates: Josh Shapiro for Pennsylvania Governor"
  },
  {
    "id": 5001,
    "mediaId": 8393,
    "date": "2022-04-19",
    "sentence": "Pennsylvania Attorney Generals <span class='selected-term'>Josh Shapiro</span> announced the arrests Tuesday.",
    "author": "Vivian Muniz",
    "title": "AG: Five arrested in Schuylkill County drug bust"
  },
  {
    "id": 4639,
    "mediaId": 8254,
    "date": "2022-04-19",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span>, who is running unopposed, has $12 million more cash on hand than all nine Republican candidates combined.",
    "author": "George Stockburger",
    "title": "Pennsylvania Governor race: Shapiro & White lead Q1 fundraising"
  },
  {
    "id": 4616,
    "mediaId": 8254,
    "date": "2022-04-19",
    "sentence": "Pennsylvania Attorney Generals <span class='selected-term'>Josh Shapiro</span> announced the arrests Tuesday.",
    "author": "Vivian Muniz",
    "title": "AG: Five arrested in Schuylkill County drug bust"
  },
  {
    "id": 4827,
    "mediaId": 8467,
    "date": "2022-04-19",
    "sentence": "",
    "author": "Dan Sokil",
    "title": "North Wales preparing for ‘Earth Day Extravaganza’"
  },
  {
    "id": 4612,
    "mediaId": 6571,
    "date": "2022-04-19",
    "sentence": "In a television campaign ad for lieutenant governor, state Rep. Brian Sims of Philadelphia posted a picture of Democratic governor candidate <span class='selected-term'>Josh Shapiro</span> with the words \"endorsed Josh Shapiro.\"",
    "author": "Jon Delano",
    "title": "Race for lieutenant governor heats up over endorsement claim"
  },
  {
    "id": 4746,
    "mediaId": 3993,
    "date": "2022-04-19",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> was at the Rose Garden ceremony, applauding the president’s restrictions on homemade firearms.",
    "author": "Cam Edwards",
    "title": "GOA explains what the left gets wrong on \"ghost guns\""
  },
  {
    "id": 5828,
    "mediaId": 2732,
    "date": "2022-04-20",
    "sentence": "All nine will appear on the May 17 primary ballots, as will Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who is the only Democrat running for his party’s nomination.",
    "author": "",
    "title": "5 takeaways from Spotlight PA’s Republican gubernatorial debate"
  },
  {
    "id": 5061,
    "mediaId": 8422,
    "date": "2022-04-20",
    "sentence": "“Increasingly, we’re seeing fentanyl replace heroin as the dominant opioid here in Pennsylvania, because of its low cost – as little as 79 cents a dose.” Attorney General <span class='selected-term'>Josh Shapiro</span> said in a statement announcing the arrests.",
    "author": "South Schuylkill News",
    "title": "Five charged in Schuylkill County drug ring"
  },
  {
    "id": 4714,
    "mediaId": 8503,
    "date": "2022-04-21",
    "sentence": "Similarly, four of nine Republican candidates favored in recent polling for the ballot spot to run against presumptive Democratic nominee <span class='selected-term'>Josh Shapiro</span> in November's gubernatorial race declined an invite for a Spotlight debate in Gettysburg this week.",
    "author": "Chris Ullery",
    "title": "This week on the campaign trail for PA governor, Senate races: Polls, debates and pledges"
  },
  {
    "id": 4651,
    "mediaId": 8427,
    "date": "2022-04-21",
    "sentence": "",
    "author": "Dan Sokil",
    "title": "Ukrainian dance troupe highlighting International Spring Festival"
  },
  {
    "id": 5171,
    "mediaId": 8441,
    "date": "2022-04-21",
    "sentence": "",
    "author": "Dan Sokil",
    "title": "Ukrainian dance troupe highlighting International Spring Festival"
  },
  {
    "id": 5029,
    "mediaId": 8409,
    "date": "2022-04-21",
    "sentence": "Festivities begin with a grand parade starting at 11:30 a.m., and at noon on the main stage, local dignitaries will speak; those invited include state Attorney General <span class='selected-term'>Josh Shapiro</span>, U.S.",
    "author": "Dan Sokil",
    "title": "Ukrainian dance troupe highlighting International Spring Festival"
  },
  {
    "id": 4753,
    "mediaId": 8306,
    "date": "2022-04-21",
    "sentence": "Then he sued the Little Sisters of the Poor, or forced them to sue him when he wanted them to foot the bill for someone else’s birth control, and I realized that <span class='selected-term'>Josh Shapiro</span> was willing to do anything to curry favor with the most radical wing of his party.",
    "author": "Christine Flowers",
    "title": "Christine Flowers: Neither Sims nor Shapiro deserve to be in public office"
  },
  {
    "id": 4920,
    "mediaId": 8500,
    "date": "2022-04-21",
    "sentence": "PITTSBURGH —\nThe democratic primary candidate for Pennsylvania governor Attorney General <span class='selected-term'>Josh Shapiro</span> and his running mate Austin Davis came to a union training facility in Pittsburgh on Thursday to talk about their plans for investing in Pennsylvania's skilled job training and jobs future.",
    "author": "Bob Mayo",
    "title": "Shapiro pledges boost in PA jobs skills training, vo-tech programs if elected PA governor"
  },
  {
    "id": 4845,
    "mediaId": 8402,
    "date": "2022-04-21",
    "sentence": "An ad by Rep. Brian Sims seeking the Democratic nomination for Pennsylvania lieutenant governor this year drew a complaint Friday, April 15, 2022 and a sharply worded letter from <span class='selected-term'>Josh Shapiro</span>, the party’s presumed nominee for governor.",
    "author": "Philadelphia Sun Staff",
    "title": "Shapiro: Dem candidate’s ad wrongly implies endorsement"
  },
  {
    "id": 5991,
    "mediaId": 2509,
    "date": "2022-04-22",
    "sentence": "Pennsylvania may not stay in the consortium even if Wolf's successor is Democrat <span class='selected-term'>Josh Shapiro</span>, the party's presumed nominee who is endorsed by Wolf.",
    "author": "MARC LEVY Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 5856,
    "mediaId": 2822,
    "date": "2022-04-22",
    "sentence": "Pennsylvania may not stay in the consortium even if Wolf's successor is Democrat <span class='selected-term'>Josh Shapiro</span>, the party's presumed nominee who is endorsed by Wolf.",
    "author": "MARC LEVY - Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 5020,
    "mediaId": 4045,
    "date": "2022-04-22",
    "sentence": "",
    "author": "MARC LEVY - Associated Press",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 4667,
    "mediaId": 2680,
    "date": "2022-04-22",
    "sentence": "Pennsylvania may not stay in the consortium even if Wolf's successor is Democrat <span class='selected-term'>Josh Shapiro</span>, the party's presumed nominee who is endorsed by Wolf.",
    "author": "MARC LEVY",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 5161,
    "mediaId": 8270,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Steven Henshaw",
    "title": "Voters in for a surprise when they see full menu of primary ballot [Opinion]"
  },
  {
    "id": 4661,
    "mediaId": 8469,
    "date": "2022-04-22",
    "sentence": "Pennsylvania may not stay in the consortium even if Wolf’s successor is Democrat <span class='selected-term'>Josh Shapiro</span>, the party’s presumed nominee who is endorsed by Wolf.",
    "author": "MARC LEVY",
    "title": "Big greenhouse gas state taking biggest climate step yet"
  },
  {
    "id": 4795,
    "mediaId": 2602,
    "date": "2022-04-23",
    "sentence": "The group also supports Pennsylvania’s attorney-general <span class='selected-term'>Josh Shapiro</span> in his gubernatorial race, and Michigan Gov.",
    "author": "OMRI NAHMIAS",
    "title": "Jewish organizations are gearing up as midterm elections nears"
  },
  {
    "id": 5046,
    "mediaId": 8483,
    "date": "2022-04-23",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is the only Democrat running for the state's top office.",
    "author": "Tom Lehman",
    "title": "One-on-one with Pennsylvania gubernatorial candidate Josh Shapiro"
  },
  {
    "id": 5066,
    "mediaId": 8489,
    "date": "2022-04-24",
    "sentence": "In the gubernatorial race, Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is the lone Democrat on the ballot.",
    "author": "Maria Pulcinella",
    "title": "What you need to know ahead of the 2022 Pa. primary election"
  },
  {
    "id": 4659,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "Pennsylvania may not stay in the consortium even if Wolf’s successor is Democrat <span class='selected-term'>Josh Shapiro</span>, the party’s presumed nominee who is endorsed by Wolf.",
    "author": "MARC LEVY Associated Press",
    "title": "Pennsylvania taking biggest climate step yet"
  }
]