[
  {
    "id": 2735,
    "mediaId": 2592,
    "date": "2022-01-28",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> says the ruling will be immediately appealed to the state supreme court.",
    "author": "Ben Scheffer",
    "title": "Pennsylvania Law Rules Mail-In Voting Law Unconstitutional"
  },
  {
    "id": 3534,
    "mediaId": 8469,
    "date": "2022-02-04",
    "sentence": "That’s how the office of Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> on Thursday characterized actions by state Republicans who planned to nominate their own electors following the 2020 presidential election in which their candidate lost.",
    "author": "Bill OBoyle boboyle@timesleader.com",
    "title": "Shapiro’s office: GOP elector plan not illegal, but misleading"
  },
  {
    "id": 15404,
    "mediaId": 8489,
    "date": "2022-03-06",
    "sentence": "Statewide government officials, including Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, spoke in support of the Ukrainian people, who have been under attack by Russian forces for nearly a week.",
    "author": "Tennyson Donyéa",
    "title": "Ukrainian American parishioners in Montco rally against Russian invasion"
  },
  {
    "id": 15737,
    "mediaId": 8253,
    "date": "2022-03-06",
    "sentence": "At the rally she heard from local leaders and politicians too, like Congresswomen Madeleine Dean and Mary Gay Scanlon and Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Beccah Hendrickson",
    "title": "Hundreds attend rally for Ukraine in Montgomery County"
  },
  {
    "id": 15281,
    "mediaId": 8254,
    "date": "2022-03-09",
    "sentence": "The Fox News poll did not include Democratic candidates with the party backing Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "George Stockburger",
    "title": "Pennsylvania Governor race a virtual tie; Fox News poll"
  },
  {
    "id": 15442,
    "mediaId": 8254,
    "date": "2022-03-10",
    "sentence": "HARRISBURG, Pa. (WHTM) - Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is reminding Pennsylvanians of important tips and warnings when it comes to donating money or goods to assist the people of Ukraine.",
    "author": "George Stockburger",
    "title": "Pennsylvania AG offers tips, warning for making donations to Ukraine"
  },
  {
    "id": 15488,
    "mediaId": 2592,
    "date": "2022-03-12",
    "sentence": "\"This verdict holds Brent Getz accountable for his horrific crimes against a child, and brought justice to a brave survivor who had the courage to come forward,\" Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> said in a statement.",
    "author": "Joseph Patrick",
    "title": "Ex-Police Chief And Friend Raped Child 'Hundreds Of Times' Over 7 Years"
  },
  {
    "id": 13721,
    "mediaId": 8253,
    "date": "2022-03-15",
    "sentence": "Philadelphia Police Commissioner Danielle Outlaw, and chiefs from Abington, Chester, Bensalem, and Upper Darby, met with Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "6abc Digital Staff",
    "title": "Police chiefs across the Philadelphia region meet to discuss officer shortages"
  },
  {
    "id": 13764,
    "mediaId": 8504,
    "date": "2022-03-16",
    "sentence": "(WJET/WFXP/YourErie.com) — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> met with police chiefs from across Pennsylvania where he heard a unified message.",
    "author": "",
    "title": "PA Attorney General told of police shortages"
  },
  {
    "id": 13620,
    "mediaId": 8254,
    "date": "2022-03-17",
    "sentence": "EYEWITNESS NEWS (WBRE/WYOU) — In an Eyewitness News exclusive, we speak one-on-one with <span class='selected-term'>Josh Shapiro</span>, the presumptive Democratic nominee for Governor of Pennsylvania.",
    "author": "Andy Mehalshick",
    "title": "Exclusive: One on one interview with Josh Shapiro"
  },
  {
    "id": 13525,
    "mediaId": 6571,
    "date": "2022-03-17",
    "sentence": "By: Patrick Damp and Andy Sheehan/KDKA-TV\nHARRISBURG (KDKA) - A coordinated effort between local police and the office of Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> ended with an arrest and a seizure of over $1 million in fentanyl in Braddock.",
    "author": "",
    "title": "AG Josh Shapiro's Office Announces Seizure Of Fentanyl And Guns In Braddock"
  },
  {
    "id": 14201,
    "mediaId": 8399,
    "date": "2022-03-17",
    "sentence": "After Hours host Natalie Bencivenga interviews <span class='selected-term'>Josh Shapiro</span>, Pa. Attorney General of Pennsylvania, who is running for Governor of Pennsylvania.",
    "author": "Natalie Bencivenga",
    "title": "After Hours: Natalie Bencivenga interviews Josh Shapiro"
  },
  {
    "id": 13495,
    "mediaId": 8254,
    "date": "2022-03-17",
    "sentence": "(WJET/WFXP/YourErie.com) — Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> met with police chiefs from across Pennsylvania where he heard a unified message.",
    "author": "",
    "title": "Pa. attorney general meets with police chiefs, discusses shortages"
  },
  {
    "id": 13460,
    "mediaId": 8254,
    "date": "2022-03-18",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> said of the incident, “These funds should have been used to help law enforcement in Lancaster County battle the opioid epidemic.",
    "author": "Avery Van Etten",
    "title": "Test your knowledge: March 18 weekly news quiz"
  },
  {
    "id": 13413,
    "mediaId": 8504,
    "date": "2022-03-18",
    "sentence": "Supply chain issues, the war in Ukraine and how that’s disrupted global marketplaces, including the oil and gas marketplace,” said <span class='selected-term'>Josh Shapiro</span>, Pennsylvania Attorney General.",
    "author": "Brian Wilk",
    "title": "Attorney General Josh Shapiro makes campaign stop in Erie"
  },
  {
    "id": 8667,
    "mediaId": 8500,
    "date": "2022-04-06",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> was in Pittsburgh on Wednesday to talk with students about mental health.",
    "author": "",
    "title": "Shapiro talks importance of mental health awareness at Pittsburgh roundtable"
  },
  {
    "id": 8003,
    "mediaId": 2621,
    "date": "2022-04-08",
    "sentence": "In the segment, Hillyard also has his firearm put together by off-camera hands working for Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Zachary Leeman",
    "title": "ATF Evaluating Whether NBC News ‘Ghost Guns’ Segment Broke the Law"
  },
  {
    "id": 6879,
    "mediaId": 2754,
    "date": "2022-04-10",
    "sentence": "A new ATF rule re-classifying these kits as firearms is pending, but until then, the market is burgeoning as # of them recovered at crime scenes jumps.pic.twitter.com/9FRmOnyI1N https://t.co/2K00kUgWWS\n— Vaughn Hillyard (@VaughnHillyard) March 18, 2022\nLast week, the heads of the Second Amendment Foundation, Gun Owners of America, American Firearms Association, National Association for Gun Rights, and Pennsylvania Firearms Association sent a three-page letter to the Pennsylvania House of Representatives to investigate Attorney General <span class='selected-term'>Josh Shapiro</span> and his special agents who manufactured and transferred an un-serialized weapon to the Hillyard (the NBC reporter).",
    "author": "Tyler Durden",
    "title": "Gun Advocacy Groups Demand Investigation Of Potentially Unlawful NBC News \"Ghost Gun\" Segment"
  },
  {
    "id": 6666,
    "mediaId": 6570,
    "date": "2022-04-11",
    "sentence": "Hours after the Biden administration announced measures to make “ghost guns” — home-assembled firearms without serial numbers — harder for felons to access, Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> told media he was prepared to handle legal challenges to the ruling.",
    "author": "Jesse Bunch",
    "title": "AG Josh Shapiro says he'll fight challenges to Biden's crackdown on ghost guns"
  },
  {
    "id": 6536,
    "mediaId": 8490,
    "date": "2022-04-12",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> was in Washington D.C. yesterday to join President Joe Biden to promote a new federal rule designed to curb so-called ghost guns.",
    "author": "Tyler Friel",
    "title": "AG Shapiro Praises New Federal Ghost Gun Regulation"
  },
  {
    "id": 6413,
    "mediaId": 8489,
    "date": "2022-04-12",
    "sentence": "In the race for governor, Democrats across the Keystone State are hoping to keep their party in office with the election of lone candidate Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "",
    "title": "Pa. Elections: Political Roundtable"
  },
  {
    "id": 6426,
    "mediaId": 8393,
    "date": "2022-04-13",
    "sentence": "Which sadly kills 14 Pennsylvanians each and every day,” said State Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Cody Butler",
    "title": "Lackawanna County to receive money from opioid lawsuit settlement"
  },
  {
    "id": 6973,
    "mediaId": 6570,
    "date": "2022-04-14",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> has, sensibly, vowed to defend the new regulation against challenges that emerge in this state.",
    "author": "The Editorial Board",
    "title": "Editorial: Joe Biden, Josh Shapiro right to target ghost guns"
  },
  {
    "id": 5815,
    "mediaId": 2732,
    "date": "2022-04-18",
    "sentence": "There will be no Democratic gubernatorial debate because Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is running unopposed.",
    "author": "Paula Reed Ward",
    "title": "Trib Total Media co-sponsoring debate in Pa.'s hotly contested GOP primary race for governor"
  },
  {
    "id": 4746,
    "mediaId": 3993,
    "date": "2022-04-19",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> was at the Rose Garden ceremony, applauding the president’s restrictions on homemade firearms.",
    "author": "Cam Edwards",
    "title": "GOA explains what the left gets wrong on \"ghost guns\""
  },
  {
    "id": 4845,
    "mediaId": 8402,
    "date": "2022-04-21",
    "sentence": "An ad by Rep. Brian Sims seeking the Democratic nomination for Pennsylvania lieutenant governor this year drew a complaint Friday, April 15, 2022 and a sharply worded letter from <span class='selected-term'>Josh Shapiro</span>, the party’s presumed nominee for governor.",
    "author": "Philadelphia Sun Staff",
    "title": "Shapiro: Dem candidate’s ad wrongly implies endorsement"
  },
  {
    "id": 5046,
    "mediaId": 8483,
    "date": "2022-04-23",
    "sentence": "Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is the only Democrat running for the state's top office.",
    "author": "Tom Lehman",
    "title": "One-on-one with Pennsylvania gubernatorial candidate Josh Shapiro"
  }
]