[
  {
    "id": 2449,
    "mediaId": 43,
    "date": "1/1/2022 12:00:00 AM",
    "sentence": "Let's show them we're NOT backing down: https://t.co/4OXYM6kWP5 pic.twitter.com/o6xQ538lJz\n <span class='selected-term'>Mandela Barnes</span> (@TheOtherMandela) December 20, 2021",
    "author": "",
    "title": "The way forward is to view Manchin and Sinema as opportunities not just as obstacles",
    "sentiment": "0.871"
  },
  {
    "id": 1200,
    "mediaId": 19,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver and Matthew Boyle",
    "title": "Analysis: Senate Majority May Come Down to 11 Battleground Races",
    "sentiment": "0"
  },
  {
    "id": 2361,
    "mediaId": 195,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "",
    "author": "Julia Manchester",
    "title": "Democratic group runs ad hitting Ron Johnson over Trump 2017 tax bill",
    "sentiment": "0"
  },
  {
    "id": 2324,
    "mediaId": 239,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "MADISON, Wis. (AP) - Former Democratic state Rep. <span class='selected-term'>Mandela Barnes</span> said Wednesday in launching his campaign for lieutenant governor that he wasn't asking for voter support just because I'm young and black.?\nBut Barnes, a 31-year-old African-American from Milwaukee, said Democrats need to do a better job connecting with people of color and young voters.",
    "author": "SCOTT BAUER",
    "title": "Former state Rep. Barnes running for lieutenant governor",
    "sentiment": "0"
  },
  {
    "id": 2325,
    "mediaId": 239,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "MADISON, Wis. (AP) - Former state Rep. <span class='selected-term'>Mandela Barnes</span> said Wednesday that he is strongly considering? running for lieutenant governor next year, making him the first prominent Democrat to express interest in the position.",
    "author": "SCOTT BAUER",
    "title": "Former state Rep. Barnes considering run for lt. gov.",
    "sentiment": "-0.941"
  },
  {
    "id": 2298,
    "mediaId": 237,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Among the candidates are <span class='selected-term'>Mandela Barnes</span>, the current lieutenant governor; Alex Lasry, son to a part-owner of the Milwaukee Bucks; Sarah Godlewski, current state treasurer; and Tom Nelson, current Outagamie County executive.",
    "author": "Salena Zito",
    "title": "The tea leaves in Wisconsin look promising for Republicans",
    "sentiment": "0"
  }
]