{
  "id": 1041,
  "mediaId": 2643,
  "date": "2022-02-14",
  "headline": "Trump May Bypass Big Names Mandel, Vance in Ohio Race for Unknown Dolan",
  "image": "",
  "link": "https://www.newsweek.com/trump-may-bypass-big-names-mandel-vance-ohio-race-unknown-dolan-1679187",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia McKnight",
  "authorUrl": "https://www.newsweek.com/authors/patricia-mcknight",
  "termIds": [
    0
  ],
  "sentences": [
    "\"In a divided field, anybody willing and able to deploy those kind of personal resources is a credible threat, even though he's out of step with the Republican base across a whole range of issues,\" Luke Thompson, a Republican strategist working for Vance, told Politico.",
    "\"I can assure you that Matt Dolan appreciates and supports the many great accomplishments of the president during his term of office, as do I,\" James Wert, who served as Trump's 2020 finance chair in the state, told Raw Story.",
    "Donald Trump may have his sights set on endorsing a wealthy unknown Ohio Republican whose Senate campaign isn't hyper-focused on the former president, in lieu of his other GOP allies in the race.",
    "Dolan, the 57-year-old state senator whose billionaire family owns Major League Baseball's Cleveland Guardians, is spending over $10 million of his own money on the campaign.",
    "\"[I've] come to the conclusion that Matt Dolan is best positioned among the field to win both the Republican primary in May and also win the general election in November.\"",
    "Trump reportedly decided against endorsing her after she defended Representative Anthony Gonzalez (R-Ohio), who voted in favor of Trump's second impeachment.",
    "Though Dolan might not be his first pick, other GOP candidates have fallen out of Trump's good graces, leaving his future endorsement in doubt.",
    "Trump has yet to endorse anyone in the primary, even though he's waded into more than 50 congressional races across the country.",
    "During meetings and phone calls, Trump has been asking aides and allies about Dolan's campaign, Politico reported Monday.",
    "In fact, Dolan accused the former president of \"perpetuat[ing] lies\" about the outcome of the 2020 election.",
    "Politico reported that Trump had considered endorsing Timken, who rests in last place with only 9.8 percent.",
    "A new survey from Trafalgar found Mandel leading the pack with 21 percent support from likely GOP voters.",
    "In December, a poll from the Trafalgar Group said Vance was in second place with likely GOP supporters.",
    "Vance has dipped to third place with 14.3 percent and Dolan has received 10.2 percent of supporters.",
    "Matt Dolan, unlike other Ohio GOP Senate candidates, hasn't boasted his allegiance to Trump.",
    "He's running against pro-Trump candidates like JD Vance, Josh Mandel and Jane Timken.",
    "With it, he could very much win the May 3 primary with a plurality of the vote.",
    "In 2016, Vance called Trump an \"idiot\" and said he was a \"Never Trump\" person.",
    "Candidates are recognizing Dolan's power at the polls without Trump's support.",
    "Now, Vance's comments have taken a hit on his campaign, dropping him to third.",
    "However, Vance's past comments criticizing Trump are catching up to him.",
    "Mike Gibbons came in second with 16.4 percent."
  ]
}