{
  "id": 231,
  "mediaId": 2641,
  "date": "2022-02-24",
  "headline": "Trump Hosts GOP Candidate Forum at Mar-a-Lago Resort",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=a721d1b1-588d-490c-b570-ed0a70df234f&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/donald-trump-mar-a-lago-gop-candidates-forum/2022/02/24/id/1058362/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Theodore Bunker",
  "authorUrl": "",
  "termIds": [
    5868,
    2137,
    4992,
    2765,
    3925,
    3662,
    748,
    1126,
    6159,
    6175
  ],
  "sentences": [
    "Trump spoke at the event, according to the Hill, commenting on the Russian invasion of Ukraine that same night and saying that Russian President Vladimir Putin has \"taken over a country for $2 worth of sanctions,\" which he said is \"pretty smart.\"",
    "Others in attendance included Senate candidates Herschel Walker of Georgia, Eric Greitens of Missouri, as well as House candidates Morgan Ortagus of Tennessee, Harriet Hageman of Wyoming, and Max Miller of Ohio.",
    "Ted Cruz of Texas, Marsha Blackburn of Tennessee, Lindsey Graham of South Carolina, as well as Reps. Ronny Jackson of Texas, Jim Banks of Indiana, Mike Carey of Ohio, and Mary Miller of Illinois.",
    "Former President Donald Trump held a forum for Republican candidates at his Mar-a-Lago resort in Florida on Wednesday in preparation for the upcoming midterm elections, The Hill reports.",
    "Multiple current members of Congress attended the event, which was called the \"Take Back Congress Candidate Forum,\" as did many candidates seeking a seat in either the House or Senate.",
    "Rep. Mike Waltz, R-Fla., who is moderating one of the event's panels, told NBC News that \"Trump is the most-influential post-president we've had in modern history.",
    "He also claimed that the incident wouldn't have happened if he had been president.",
    "Waltz added he expects Trump to run in 2024.",
    "I'm not going to dance around that one.",
    "I absolutely think he is.\"",
    "It included GOP Sens."
  ]
}