{
  "id": 4245,
  "mediaId": 8494,
  "date": "2022-01-19",
  "headline": "Morning Headlines: Cleveland’s COVID testing site to close; Akron Rep. Emilia Sykes announces run for Congress",
  "image": "https://npr.brightspotcdn.com/dims4/default/ba5d5ca/2147483647/strip/true/crop/1760x924+0+88/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fdf%2Fef%2Fb51ab85c45599635b976cb3e9406%2Fdownload.jpg",
  "link": "https://www.wksu.org/2022-01-19/morning-headlines-clevelands-covid-testing-site-to-close-akron-rep-emilia-sykes-announces-run-for-congress",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Wednesday, January 19:\nCleveland’s COVID testing site to close\nAkron Rep. Emilia Sykes announces run for Congress\nJim Obergefell, the face of gay marriage, to run for Ohio House\nSchool closings and unplowed streets persist after Sunday's winter wallop\nCleveland’s COVID testing site to close\n(WKSU) -- Due to a drop in demand, Cleveland’s mass COVID testing site will close on Sunday.",
    "Jim Obergefell, the face of gay marriage, to run for Ohio House\n(AP) — Gay rights advocate Jim Obergefell who was the lead plaintiff in the U.S. Supreme Court case that legalized same-sex marriage nationwide, says he’s running for a seat in the Ohio legislature.",
    "Some schools close a second day following storm\n(WKSU, Beacon Journal) -- There are still a number of schools closed Wednesday as the region continues to dig out from the more than a foot of snow that fell Sunday night.",
    "The 35-year-old Akron Democrat’s announcement Tuesday sets up a likely faceoff in Ohio’s potentially newly competitive 13th Congressional District against former President Donald Trump-backed Republican Max Miller.",
    "The Democrat will run for the Ohio House in a district that includes his hometown of Sandusky and has been dominated by Republicans for the past eight years.",
    "His name was atop the landmark 2015 ruling that ended same-sex marriage bans and made him a visible figure in the marriage-equality movement.",
    "Akron Rep. Emilia Sykes announces run for Congress\n(AP) — Ex-Ohio House Democratic Leader Emilia Sykes says she’s running for Congress.",
    "On Tuesday, The Beacon Journal reported that around half of the city’s residential streets still had not been plowed.",
    "The district includes Akron, and it leans slightly Democratic on a map the Ohio Supreme Court ordered redrawn Friday.",
    "Mike DeWine says Ohio National Guard members will be deployed to southern Ohio, which is seeing an increased need.",
    "Walker building in University Circle opened late last month ahead of the holiday travel week.",
    "Hospitalizations are down 10% from last week’s high with around 6,000 current patients.",
    "Tuesday’s 15,000 COVID-19 cases are the fewest in Ohio in more than a month.",
    "Summit County’s drive-thru testing location in Akron closed last week.",
    "Miller was a campaign and White House aide to Trump.",
    "The 32-year-old launched his campaign last February.",
    "Around 1,100 COVID patients are in the ICU.",
    "Cleveland and Akron schools are closed.",
    "It has tested nearly 25,000 people.",
    "The drive-thru location at the W.O.",
    "Gov."
  ]
}