{
  "id": 6118,
  "mediaId": 2557,
  "date": "2022-04-13",
  "headline": "NEWS ALERT: Trump announces location of next ‘Save America’ rally",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-1251044496-1.jpg",
  "link": "https://dennismichaellynch.com/news-alert-trump-announces-location-of-next-save-america-rally/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    0
  ],
  "sentences": [
    "45th President of the United States Donald J. Trump to Hold a Rally in Ohiohttps://t.co/7kj0LeDozT pic.twitter.com/0mI6xvbfer\n— Liz Harrington (@realLizUSA) April 13, 2022\nListen to the latest daily DML podcasts below!",
    "In a statement posted to Twitter by his spokesperson, Liz Harrington, Trump announced that he will hold a rally on Saturday, April 23 in Ohio – just days ahead of the state’s May 3 primary election.",
    "In another race in Ohio, Republican Max Miller is running for U.S. Congress in the state’s 7th District, and has been endorsed by Trump.",
    "The rally will be held at the Delaware County Fairgrounds in Delaware, Ohio, with parking and the line opening at 8:00 a.m.",
    "Rob Portman of Ohio is retiring, and a number of Republican candidates are vying for the seat, including businessman J.D.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "Former President Donald Trump announced the location of his next “Save America” rally on Wednesday afternoon.",
    "Vance, businessman Mike Gibbons, former state Treasurer Josh Mandel and former Ohio GOP Chair Jane Timken.",
    "Doors will open at 2:00 p.m. and a number of other speakers will begin delivering remarks at 4:00.",
    "Trump is scheduled to speak at 7 p.m.\nCLICK HERE to register for the event.",
    "Then please share.",
    "Republican Sen."
  ]
}