{
  "id": 6267,
  "mediaId": 8494,
  "date": "2022-04-13",
  "headline": "Trump will hold a rally near Columbus ahead of the May 3 primary",
  "image": "https://npr.brightspotcdn.com/dims4/default/0f50b92/2147483647/strip/true/crop/3464x1819+0+246/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe2%2F8e%2F9e3334344940a71715c9b7b746b4%2Fdonald-trump-shutterstock-538492660-evan-el-amin.jpg",
  "link": "https://www.wksu.org/government-politics/2022-04-13/trump-will-hold-a-rally-near-columbus-ahead-of-the-may-3-primary",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.wksu.org/people/annie-wu",
  "termIds": [
    0
  ],
  "sentences": [
    "Trump rallied his supporters in June 2021 at the Lorain County Fairgrounds where he promoted Republican candidates including Miller, his former adviser, and attacked Republican Rep. Anthony Gonzalez who voted to impeach Trump following the January 6 Capitol insurrection.",
    "Gonzalez announced in September he would not seek reelection, saying on his social media account \"the toxic dynamics inside our own party, is a significant factor in my decision.”\nGonzalez isn't the only Ohio Republican to pull out of this year's election.",
    "In Delaware County where Trump is scheduled to appear, the board of elections reports 996 Republican ballots have been requested either by mail or in person compared to 605 Democratic ballots as of 5 p.m. Tuesday.",
    "News of the rally comes as early voting figures suggest turnout in the populous Midwest battleground Trump won twice by overwhelming margins may be severely depressed this year.",
    "He'll stump for U.S. House candidate Max Miller, his pick for the 7th Congressional District, and perhaps for U.S. Senate or governor choices he's yet to make.",
    "The Secretary of State's office reported 6,058 ballots have been cast in the Republican primary as of April 8, compared to 5,672 Democratic primary ballots.",
    "Former President Donald Trump is returning to Ohio to try to boost Republican candidates and turnout ahead of the May 3 primary.",
    "Rep. Bob Gibbs, who has served in Congress since 2010, announced his retirement last week after early voting had already begun.",
    "With the state legislative maps still tied up in litigation, Ohio Senate and House races are not included on the May 3 ballot.",
    "In Summit County, 1,566 Republican primary ballots have been requested either by mail or in person as of Tuesday evening.",
    "Trump will headline an evening rally at the Delaware County Fairgrounds, north of Columbus, on April 23.",
    "He was facing Miller in the primary under the newly drawn congressional district map.",
    "Democratic ballots total 2,173."
  ]
}