{
  "id": 6329,
  "mediaId": 8331,
  "date": "2022-04-13",
  "headline": "Former President Donald Trump to visit Delaware County ahead of May primary",
  "image": "https://www.gannett-cdn.com/presto/2021/06/27/NABJ/0e83ab27-3027-4e50-9404-8b08bee9ac7c-Trump_Rally_03.jpg?crop=1066,600,x1,y308&width=1066&height=600&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/trump/2022/04/12/donald-trump-hold-ohio-rally-ahead-senate-governor-primary/7282786001/",
  "mediaOutlet": "Granville Sentinel - United States - Ohio",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    4905,
    1991,
    2143,
    4820,
    2765,
    1489,
    1477,
    1126,
    6108,
    6107
  ],
  "sentences": [
    "Haley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Former U.S. Rep. Jim Renacci hasn’t secured the ex-president’s backing, even though he presents himself as a pro-Trump candidate and hired one of Trump’s former campaign managers.",
    "Associates of the former president say he has concerns with most of the candidates, and no clear frontrunner has emerged despite millions of dollars in spending on the race.",
    "Former President Donald Trump will visit central Ohio as Republican voters prepare to choose their nominees for U.S. senator, governor and members of Congress.",
    "Miller initially set out to challenge U.S. Rep. Anthony Gonzalez, who was one of 10 Republicans to vote to impeach Trump over the Jan. 6 insurrection.",
    "All of the candidates, with the exception of state Sen. Matt Dolan, have been angling for an endorsement that Trump has yet to bestow.",
    "DeWine was also among the first Republican leaders to acknowledge President Joe Biden’s victory in the 2020 election.",
    "Mike DeWine, meanwhile, is unpopular with much of Trump’s base and previously said he hadn’t sought Trump’s support.",
    "Farmer and businessman Joe Blystone is also running for the GOP nomination along with former state Rep. Ron Hood.",
    "Because of redistricting, Miller is now the favorite in the GOP primary for Ohio’s 7th Congressional District.",
    "Trump last visited Ohio in June 2021 to stump for his former aide and congressional candidate Max Miller.",
    "Trump’s visit will coincide with the tail end of a contentious GOP primary to replace retiring U.S. Sen.",
    "Doors will open at 2 p.m. and tickets can be reserved through the events page of DonaldJTrump.com.",
    "As for whether DeWine will attend on April 23, the governor's campaign says he's still deciding.",
    "Trump is scheduled to speak at 7 p.m. on April 23 at the Delaware County Fairgrounds.",
    "The event also comes at a precarious time for the Republicans running for governor.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "Anna Staver and jessie Balmert contributed reporting to this article.",
    "Renacci's campaign confirmed he will attend the Delaware rally.",
    "\"Who will be running for Governor of the Great State of Ohio?\"",
    "And it's possible Trump won't back anyone.",
    "Trump tweeted in November 2020.",
    "\"Will be hotly contested!\"",
    "Rob Portman.",
    "Gov."
  ]
}