{
  "id": 7476,
  "mediaId": 2550,
  "date": "2022-04-06",
  "headline": "bid after new map leaves him in tough primary vs.",
  "image": "https://images.dailykos.com/images/1056403/story_image/AP18308523554880.jpeg?1649268690",
  "link": "https://www.dailykos.com/stories/2022/4/6/2090439/-GOP-congressman-ends-re-election-bid-after-new-map-leaves-him-in-tough-primary-vs-Trump-backed-foe?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5712,
    2595,
    2742,
    2905,
    3418,
    4820,
    604,
    6034,
    5926
  ],
  "sentences": [
    "“It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins,” said the incumbent, “especially in the Seventh Congressional District, where almost 90 percent of the electorate is new and nearly two-thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District.” To put it another way, a mere 9% of the residents of the new 7th are already Gibbs' constituents, so he would have been campaigning in largely unfamiliar turf.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nHow Democrats are fighting to hold the House, with Ali Lapp\nThe Downballot\nFollowShare\n0:0050:44\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nMiller ended up taking on Gibbs after redistricting led them to seek the same seat, and Trump’s spokesperson said last month that the endorsement carried over to Miller’s new campaign against the far-more loyal incumbent.",
    "Gibbs in 2009 set his sights on challenging Democratic Rep. Zack Space in the now-defunct 18th Congressional District, a historically red area in the eastern part of the state that had favored John McCain 52-45, but he had to get past seven fellow Republicans in the following year’s primary first.",
    "Retiring Ohio Rep. Bob Gibbs\nRepublican Rep. Bob Gibbs said Wednesday that he was ending his re-election bid for Ohio’s 7th Congressional District, a surprising announcement that came well after candidate filing closed and days following the start of early voting for the state’s May 3 primary.",
    "Gibbs (who happened to share a name with the Obama White House’s press secretary), had the support of the party establishment, including House Minority Leader John Boehner, and he benefited after tea party activists failed to back a single alternative.",
    "Redistricting two years later left the new congressman with a new district, now numbered the 7th, that was largely unfamiliar to him, but unlike in 2022, he faced no serious intra-party opposition in this red constituency.",
    "Miller, who was one of Trump’s favorite aides (an unnamed source told Politico that the two “had … kind of a unique ‘bro’ relationship”) received his old boss’ backing last year against Gonzalez, who voted for impeachment.",
    "Gibbs used his departure announcement to express his anger at the state Supreme Court, which is not scheduled to rule on the fate of the new GOP-drawn congressional map until well after the primary.",
    "The six-term congressman’s abrupt retirement leaves former Trump aide Max Miller as the frontrunner to claim a seat in the Canton area and Akron suburbs that Trump would have carried 54-45.",
    "Miller last year also filed a defamation lawsuit against his ex-girlfriend, former White House Press Secretary Stephanie Grisham, after she accused him of physically attacking her in 2020.",
    "Miller, by contrast, began the cycle by running against Rep. Anthony Gonzalez, who has since announced his own retirement, in the old 16th District, which makes up 65% of the new 7th.",
    "The state senator ultimately beat 2008 nominee Fred Dailey, who had lost to Space 60-40, in a 20.9-20.7 squeaker, though it took another month to confirm Gibbs’ 156-vote victory.",
    "Space went on the offensive early by portraying his opponent as a tax hiker and a supporter of free trade agreements, but Gibbs ended up unseating him in a 54-40 landslide.",
    "Gibbs himself got his start in elected office in 2002 when he won a seat in the Ohio state House, and he won a promotion six years later to the state Senate.",
    "Democrats in 2018 hoped that well-funded Navy veteran Ken Harbaugh could give Gibbs a serious fight, but the congressman decisively turned him back 59-41.",
    "Listen and subscribe to Daily Kos Elections’ The Downballot podcast with David Nir and David Beard\nx\nx\nYou need to enable JavaScript to run this app.",
    "Gibbs’ name will remain on the ballot, but the secretary of state’s office says that any votes cast for him will not be counted.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The general election turned out to be a far easier contest for Gibbs in what was rapidly turning into a GOP wave year.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "This is a short blurb about Daily Kos.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Donate $5 monthly",
    "Please read it."
  ]
}