{
  "id": 7948,
  "mediaId": 2562,
  "date": "2022-04-06",
  "headline": "Ohio GOP Rep. Gibbs Announces Retirement",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid818F56B9-1157-47D3-BE73-A7B5C1DECA97.jpg",
  "link": "https://donaldjtrumppolls.com/ohio-gop-rep-gibbs-announces-retirement/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    4820,
    2905,
    2765,
    1267,
    1126,
    976,
    747,
    6474,
    6358
  ],
  "sentences": [
    "\"It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins, especially in the Seventh Congressional District where almost 90 percent of the electorate is new and nearly two-thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District,\" Gibbs said in a statement he shared on Twitter.",
    "Miller entered the race for Gibbs' district instead, and Trump backed him for that race despite Gibbs having voted against certifying the results of the 2020 election and filing articles of impeachment against President Joe Biden, the Examiner reported.",
    "\"I helped reform federal water resources policy, made clean water utilities more affordable for low-income communities, cut taxes & red tape for millions of American families & businesses … and fought for a cleaner, safer Lake Erie,\" he added.",
    "(Tony Dejak/AP)\nBy Charlie McCarthy | Wednesday, 06 April 2022 12:48 PM\nRep. Bob Gibbs, R-Ohio, who had been expected to face a primary challenge from a candidate endorsed by former President Donald Trump, announced his retirement Wednesday.",
    "Trump initially supported former aide Max Miller in the 16th District to challenge Rep. Anthony Gonzalez, R-Ohio, voted to impeach Trump in the wake of the Jan. 6, 2021, attack on the Capitol.",
    "Gonzalez then decided not to seek reelection, and the latest congressional maps set up a primary between Miller and Gibbs in the 7th District.",
    "Ohio GOP Rep. Gibbs Announces Retirement U.S. Rep. Bob Gibbs speaks at the Mansfield Lahm Regional Airport, Oct. 31, 2018, in Mansfield, Ohio.",
    "\"Max Miller is a wonderful person who did a great job at the White House and will be a fantastic congressman,\" Trump said in February 2021.",
    "Given Ohio’s redistricting fiasco, and the Ohio Supreme Court’s irresponsible handling of it, I’ve been given time to reassess my future.\"",
    "Although the Ohio Supreme Court has yet to weigh in on the state’s latest district map, the primary remained scheduled for May 3.",
    "\"Since 2011, I've had the honor of serving the people of Ohio’s 18th, then 7th District,\" Gibbs tweeted.",
    "\"I am proud of this work and am grateful for the opportunity to do it on behalf of Ohioans.",
    "Gibbs cited the state’s redistricting process as the reason for his decision to retire.",
    "Gibbs first represented Ohio’s 18th Congressional District and later its 7th District.",
    "\"He is a Marine Veteran, a son of Ohio and a true Patriot.",
    "Max Miller has my Complete and Total Endorsement.\"",
    "Original Article"
  ]
}