{
  "id": 8384,
  "mediaId": 8363,
  "date": "2022-04-06",
  "headline": "Ohio Congressman Bob Gibbs drops out of crowded Republican primary, announces retirement",
  "image": "https://www.gannett-cdn.com/-mm-/25a583661f8c6b0513e17c439ef9419b70041e5c/c=0-260-2400-1610/local/-/media/2020/08/31/CantonRepository/ghows_gallery_ei-OH-200839868-c6fad02b.jpg?width=2400&height=1350&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.cantonrep.com/story/news/2022/04/06/congressman-bob-gibbs-retire/9482327002/",
  "mediaOutlet": "mansfieldnewsjournal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Wang",
  "authorUrl": "https://www.cantonrep.com/staff/3476130001/robert-wang/",
  "termIds": [
    0
  ],
  "sentences": [
    "The old 7th District included Canton, Massillon, much of Perry, Lake and Plain townships, Sugar Creek Township, Bethlehem Township, Tuscarawas Township, Bethlehem Township, Pike Township, Sandy Township, Paris Township, Marlboro Township, Washington Township, Louisville, Nimishillen Township and Osnaburg Township,\nThe new 7th Congressional District has been reshaped following the 2020 census and will encompass only Medina and Wayne counties, and parts of Holmes and Cuyahoga counties after this year.",
    "“It is irresponsible to effectively confirm the congressional map for this election cycle seven days before voting begins, especially in the Seventh Congressional District where almost 90 percent of the electorate is new and nearly two thirds is an area primarily from another district, foreign to any expectations or connection to the current Seventh District.",
    "He also has extensive knowledge about the legislative process through his many years of service in the Ohio General Assembly and the United States Congress...\"\nIn a statement Stark County Commissioner Janet Weir Creighton, a Republican, wrote, \"Bob Gibbs served our district with dignity and passion.",
    "What Gibbs is saying about his retirement\nGibbs in his retirement statement said the redistricting process in Ohio has become a \"circus\" and criticized the Ohio Supreme Court for taking weeks to deliberate on whether new congressional districts comply with the state's constitution.",
    "Miller, a former aide to Trump, had originally sought to represent the bulk of the 16th District in order to seek the ouster of Congressman Anthony Gonzalez, R-Rocky River, after Gonzalez voted for Trump's impeachment for his actions in the unrest on Jan. 6, 2021, at the Capitol.",
    "\"In that time, I helped reform federal water resources project policy, made clean water utilities more affordable for low-income communities, lowered taxes and red tape for millions of American families and businesses, and fought for a cleaner, safer Lake Erie.",
    "Gibbs faces four challengers in GOP primary, including one backed by Donald Trump\nBefore he announced his retirement, Gibbs faced four Republican primary challengers, including Max Miller who has been endorsed by former President Donald Trump.",
    "When asked whether Trump or anyone affiliated with Trump had made any inducements to convince Gibbs to drop out, a spokesman for Gibbs in a text message wrote, \"Bob just decided given the redistricting fiasco, it was the right time to retire.\"",
    "What others are saying about Bob Gibbs' retirement\nIn response to Gibb's retirement announcement, Trump issued this statement:\n\"I want to congratulate Congressman Bob Gibbs of Ohio on a wonderful and accomplished career,\" he said.",
    "Gibbs, who was born in Indiana, grew up in Bay Village in Cuyahoga County before becoming a hog farmer in Holmes County for 26 years and later serving as president of the Ohio Farm Bureau.",
    "\"I have had the honor of serving the people of Ohio’s 18th, then 7th Congressional District since 2011,\" Gibbs said in a statement issued by his office.",
    "Gibbs, 67, who lives in Holmes County's Lakeville, is serving his sixth two-year term as congressman, his fifth as congressman for most of Stark County.",
    "Miller chose to compete in the 7th District to take on Gibbs, who has been consistently supportive of Trump during Trump's presidency.",
    "He was a strong ally to me and MAGA, voting to support my America First agenda and fighting strongly against the Radical Left.",
    "He became an avid critic of water regulations issued by the U.S. Environmental Protection Agency under President Barack Obama.",
    "He thanked his supporters, said he was honored as an advocate for to Ohioans and said he would spend more time with family.",
    "Mike DeWine also weighed in, saying: \"He's done a phenomenal job representing his district\" and he's \"sorry to lose him.\"",
    "From 2002 to 2010, he was elected to be state representative from Holmes County three times and a state senator once.",
    "\"He has a wealth of experience in the private sector as a farmer and past President of the Ohio Farm Bureau.",
    "During his time in the House, Gibbs served as chairman of the Water Resources and Environment Subcommittee.",
    "His commitment was appreciated by his constituents and his decision to retire was a choice he made.",
    "Republican Congressman Bob Gibbs announced Wednesday morning he will drop his bid for re-election.",
    "\"His retirement, after serving in Congress for more than a decade, should be celebrated by all.",
    "\"Bob Gibbs will be missed in the U.S. House of Representatives,\" Schuring wrote in a statement.",
    "To that end, after considerable deliberation, I have decided to not seek re-election this year.",
    "State Sen. Kirk Schuring, R-Jackson Township, served in the Ohio General Assembly with Gibbs.",
    "I am proud of this work and am grateful for the opportunity to do it on behalf of Ohioans.\"",
    "He loves his farm and I am sure he will be excited to be back home full time!\"",
    "He indicated it was one reason why he chose to retire at the end of his term.",
    "This was a difficult decision, one which I did not make lightly.\"",
    "“This circus has provided me the opportunity to assess my future.",
    "But Gonzalez announced last year he would not seek re-election.",
    "Reach Robert at (330) 580-8327 or robert.wang@cantonrep.com.",
    "And the 16th District was split apart in redistricting.",
    "Gibbs has represented most of Stark County since 2013.",
    "Thank you for your service, Bob — a job well done!\"",
    "His current term ends in early January.",
    "The U.S. Senate acquitted Trump.",
    "On Twitter: @rwangREP.",
    "Gov."
  ]
}