[
  {
    "id": 10648,
    "mediaId": 6512,
    "date": "2022-03-30",
    "sentence": "Arizona Democrats - Senators Kirsten Sinema and <span class='selected-term'>Mark Kelly</span> - also made the same plea to the administration.",
    "author": "Joshua Summers",
    "title": "Joe Biden's Administration to End Title 42 Expulsion by May; Republicans Push Back"
  },
  {
    "id": 10381,
    "mediaId": 2644,
    "date": "2022-03-30",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Arizona Democrats, issued a similar warning last week, citing the projected impacts on local communities and border security.",
    "author": "Callie Patteson",
    "title": "Biden administration to scrap Title 42 border policy by May 23 despite warnings: reports"
  },
  {
    "id": 10562,
    "mediaId": 2695,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Alex Nitzberg",
    "title": "Manchin condemns 'frightening decision' to nix Title 42 order, says it will result in an even greater flow of migrants along the southern border"
  },
  {
    "id": 10016,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Manchin calls Biden lifting Title 42 border policy 'frightening decision'"
  },
  {
    "id": 9872,
    "mediaId": 2822,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "",
    "title": "Vulnerable Democrats warn Biden about reopening asylum"
  },
  {
    "id": 9894,
    "mediaId": 2594,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Via AP news wire",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9896,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Jonathan J. Cooper and Anita Snow",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9812,
    "mediaId": 2584,
    "date": "2022-04-01",
    "sentence": "We are already facing an unprecedented increase in migrants this year.”\n<span class='selected-term'>Mark Kelly</span>, a Democratic senator from Arizona who faces a tough re-election fight, said: “This is a crisis and in my estimation, because of a lack of planning from the administration, it’s about to get worse.”\nThe Department of Homeland Security (DHS) insists it will be ready.",
    "author": "David Smith",
    "title": "Biden ends Trump-era asylum curbs amid border-region Democrat backlash"
  },
  {
    "id": 7075,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Arizona AG warns of 'tidal wave' of migrants at southern border if Biden admin lifts Title 42"
  },
  {
    "id": 10690,
    "mediaId": 2595,
    "date": "2022-04-02",
    "sentence": "",
    "author": "M Dowling",
    "title": "Sen Manchin Calls Biden’s Rescinding of Title 42 “Frightening”"
  },
  {
    "id": 9921,
    "mediaId": 8350,
    "date": "2022-04-03",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> said in a statement that they asked U.S.",
    "author": "KTAR.COM",
    "title": "Weekend wrap-up: Here are the biggest Arizona stories from April 1-3"
  },
  {
    "id": 8574,
    "mediaId": 2526,
    "date": "2022-04-05",
    "sentence": "Joe Manchin (D-WV), Kyrsten Sinema (D-AZ), <span class='selected-term'>Mark Kelly</span> (D-AZ), and Maggie Hassan (D-NH) have all urged Biden to reverse the decision.",
    "author": "John Binder",
    "title": "More Vulnerable Democrats Blast Biden’s Ending Title 42 at Border"
  },
  {
    "id": 7979,
    "mediaId": 2573,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> have both written to and spoke with Mayorkas to express their concerns about it being lifted without proper planning.",
    "author": "Adam Shaw",
    "title": "Sen. Tester becomes latest Democrat to oppose Biden move to end Title 42"
  },
  {
    "id": 7991,
    "mediaId": 2572,
    "date": "2022-04-06",
    "sentence": "",
    "author": "",
    "title": "Hawley grills Biden admin on migrant surge, whether DHS plans to give phones to illegal immigrants"
  },
  {
    "id": 8480,
    "mediaId": 2574,
    "date": "2022-04-06",
    "sentence": "Arizona Democratic senators <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema sent a letter to the White House last month that asks Biden \"not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border.\"",
    "author": "Joseph Simonson",
    "title": "Migrant Surge May Push DHS To Lower Security Standards at Border"
  },
  {
    "id": 8116,
    "mediaId": 8322,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> have both written to and spoke with Mayorkas to express their concerns about the policy being lifted without proper planning.",
    "author": "Kyle Morris",
    "title": "Georgia Sen. Warnock, other vulnerable Democrats oppose ending Title 42 border policy"
  },
  {
    "id": 7968,
    "mediaId": 2573,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Rep. Val Demings backs Biden admin move to end Title 42, says COVID numbers are ‘way down’"
  },
  {
    "id": 6840,
    "mediaId": 6449,
    "date": "2022-04-11",
    "sentence": "Arizona’s two Democratic senators, Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, already have expressed their opposition, and others are now joining in.",
    "author": "Jarrett Stepman",
    "title": "Biden’s Radical Open Borders Policies Prompt Pushback"
  },
  {
    "id": 4742,
    "mediaId": 2557,
    "date": "2022-04-18",
    "sentence": "Democratic Sen. <span class='selected-term'>Mark Kelly</span> says Biden has 'no plan.'",
    "author": "DML News App",
    "title": "REPORT: Biden faces deepening Democratic rift over Title 42"
  },
  {
    "id": 5168,
    "mediaId": 2522,
    "date": "2022-04-20",
    "sentence": "“In this case, the administration hasn’t even prepared, and they don’t have a plan for what to expect,” Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) said.",
    "author": "Kevin Haggerty",
    "title": "Biden may delay lifting Title 42 as Democrats fret over looming midterm disaster: report"
  }
]