[
  {
    "id": 3602,
    "mediaId": 2590,
    "date": "2022-01-23",
    "sentence": "Georgia Sen. Jon Ossoff, a mainstream liberal, has teamed up with the more moderate Democratic Arizona Sen. <span class='selected-term'>Mark Kelly</span> to write legislation banning corporate PACs and barring members from selling individual stocks.",
    "author": "Kevin Robillard",
    "title": "Joe Biden Still Believes In Washington. He Might Be The Only One."
  },
  {
    "id": 454,
    "mediaId": 2641,
    "date": "2022-02-24",
    "sentence": "The incumbent is Sen. <span class='selected-term'>Mark Kelly</span>, a Democrat.",
    "author": "Brian Trusdell",
    "title": "Arizona AG Brnovich to Newsmax: Biden Admin Intentionally Undermining Law"
  },
  {
    "id": 13430,
    "mediaId": 2745,
    "date": "2022-03-18",
    "sentence": "",
    "author": "Maxine Joselow",
    "title": "High gas prices present a big dilemma for Democrats"
  },
  {
    "id": 9995,
    "mediaId": 2526,
    "date": "2022-03-30",
    "sentence": "Same with Arizona’s Sen. <span class='selected-term'>Mark Kelly</span> and Montana’s Sen. Jon Tester.",
    "author": "Ann Coulter",
    "title": "Ann Coulter: Pro-Crime Party Nominates a Justice"
  },
  {
    "id": 9941,
    "mediaId": 2658,
    "date": "2022-03-30",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> and West Virginia Sen. Joe Manchin eventually joined Republicans to vote against proceeding with the nomination.",
    "author": "",
    "title": "Moderate Dems hand Biden his first nomination vote defeat"
  },
  {
    "id": 10200,
    "mediaId": 2930,
    "date": "2022-03-31",
    "sentence": "Joe Manchin (D-W.Va.), Kyrsten Sinema (D-Ariz.), and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) voted against allowing Dr. David Weil's nomination to move forward Wednesday evening, several months after the former Obama administration official was first nominated for the top wage regulatory role.",
    "author": "Julia Conley",
    "title": "'Body Blow to Working People': Right-Wing Democrats Reject Biden Labor Nominee"
  },
  {
    "id": 10337,
    "mediaId": 2619,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Levi Sumagaysay",
    "title": "Senate’s rejection of Biden Labor Department nominee seen as a win for gig companies, loss for PRO Act"
  },
  {
    "id": 10681,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "Joe Manchin (D-W.Va.), Kyrsten Sinema (D-Ariz.), and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) voted against allowing Dr. David Weil's nomination to move forward Wednesday evening, several months after the former Obama administration official was first nominated for the top wage regulatory role.",
    "author": "Julia Conley",
    "title": "'Body blow to working people': Right-wing Democrats reject Biden labor nominee"
  },
  {
    "id": 9827,
    "mediaId": 2658,
    "date": "2022-03-31",
    "sentence": "Those are all things that people are going to have to take into consideration.”\nSen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), a top target for Republicans in November, said he wants the Senate to ultimately have a say.",
    "author": "",
    "title": "'The president will get his way': Congress likely can't stop new Iran nuke deal"
  },
  {
    "id": 9879,
    "mediaId": 2520,
    "date": "2022-03-31",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> helped torpedo President Joe Biden’s pick to lead an important division of the Labor Department.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Here's why Sens. Kyrsten Sinema, Mark Kelly helped torpedo a top Biden Labor nominee"
  },
  {
    "id": 9923,
    "mediaId": 2644,
    "date": "2022-03-31",
    "sentence": "Joe Manchin of West Virginia and Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona opposed the nomination.",
    "author": "Mark Moore",
    "title": "Biden pick for Labor post defeated in Senate — with three Dems opposing"
  },
  {
    "id": 9881,
    "mediaId": 2636,
    "date": "2022-04-01",
    "sentence": "“I heard from a lot of business owners,” Senator <span class='selected-term'>Mark Kelly</span> of Arizona, one of the three Democrats, told Politico by way of justification for his opposition.",
    "author": "",
    "title": "The People, United, Must Fight Hard or Be Defeated"
  },
  {
    "id": 9795,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Tyler Olson",
    "title": "Democratic Sens. Kelly, Manchin press Biden over Gulf oil leases"
  },
  {
    "id": 10607,
    "mediaId": 2721,
    "date": "2022-04-01",
    "sentence": "They were also joined by <span class='selected-term'>Mark Kelly</span>, Arizona’s other senator.",
    "author": "",
    "title": "Biden embarrassed by Senate defeat"
  },
  {
    "id": 8574,
    "mediaId": 2526,
    "date": "2022-04-05",
    "sentence": "Joe Manchin (D-WV), Kyrsten Sinema (D-AZ), <span class='selected-term'>Mark Kelly</span> (D-AZ), and Maggie Hassan (D-NH) have all urged Biden to reverse the decision.",
    "author": "John Binder",
    "title": "More Vulnerable Democrats Blast Biden’s Ending Title 42 at Border"
  },
  {
    "id": 8385,
    "mediaId": 2650,
    "date": "2022-04-06",
    "sentence": "",
    "author": "Cameron Arcand",
    "title": "Report: Bipartisan Group of Lawmakers Takes on Biden Over Border Crisis"
  },
  {
    "id": 8359,
    "mediaId": 2877,
    "date": "2022-04-06",
    "sentence": "House Minority Leader Kevin McCarthy is opposed, of course, but so are several Democrat senators — Joe Manchin, Kyrsten Sinema, <span class='selected-term'>Mark Kelly</span>, Mark Warner, and Maggie Hassan are warning that Biden’s decision to open the borders even further will result in nothing but a surge of new border crossers.",
    "author": "Nate Jackson /",
    "title": "The Border Is About to Get Even Worse"
  },
  {
    "id": 8699,
    "mediaId": 2609,
    "date": "2022-04-07",
    "sentence": "But rather than view it as a public health victory, some moderate Democrats see a huge political liability, leaving them furious that the White House ended policy ahead of a tough midterm election…\nSen. Joe Manchin (D-W.Va.) called it a “frightening decision.” Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) called it “wrong.” And Sen. Maggie Hassan (D-N.H.) said the Biden administration “does not appear to be ready” for the surge in migration that could result.",
    "author": "Mike LaChance",
    "title": "Obama’s DHS Secretary Jeh Johnson Against Ending Title 42, Says Southern Border Not Sustainable"
  },
  {
    "id": 8302,
    "mediaId": 2548,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona; Maggie Hassan of New Hampshire; Jon Tester of Montana; and Joe Manchin of West Virginia.",
    "author": "Sebastian Hughes",
    "title": "‘Federal Government’s Failure’: Democrats Join Forces With Republicans To Reverse Biden’s Migrant Decision"
  },
  {
    "id": 4664,
    "mediaId": 2556,
    "date": "2022-04-19",
    "sentence": "As she recovered, she became a leading advocate for gun violence prevention, along with her husband, astronaut <span class='selected-term'>Mark Kelly</span>, who was later elected to the Senate.",
    "author": "",
    "title": "Briarcliff Entertainment Acquires Betsy West-Julie Cohen Documentary ‘Gabby Giffords Won’t Back Down’"
  },
  {
    "id": 4724,
    "mediaId": 2634,
    "date": "2022-04-20",
    "sentence": "That isn’t likely to occur because Arizona Senators Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> won’t vote for it and Virginia Senator Mark Warner may not either.",
    "author": "Timothy Noah",
    "title": "Jennifer Abruzzo Has Become One of the Quiet Heroes of the Biden Administration"
  }
]