[
  {
    "id": 3718,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "The state now has two Democratic U.S. senators: Sen. Kyrsten Sinema and Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Alex Henderson",
    "title": "‘Culture war’ bills from far-right Arizona Republicans are becoming increasingly ‘extreme’: report"
  },
  {
    "id": 11187,
    "mediaId": 2868,
    "date": "2022-03-17",
    "sentence": "Senator <span class='selected-term'>Mark Kelly</span>, a Democrat from Arizona, took home funding for a light rail project in Phoenix.",
    "author": "",
    "title": "Why the return of earmarks could be good news for the planet"
  },
  {
    "id": 9327,
    "mediaId": 2790,
    "date": "2022-03-25",
    "sentence": "Senators, led by Maggie Hassan of New Hampshire, <span class='selected-term'>Mark Kelly</span> of Arizona, and Raphael Warnock of Georgia, are calling for a temporary suspension of the 18.4 cents per gallon federal gas tax, as well.",
    "author": "Ayana Archie",
    "title": "California's governor is proposing $11 billion of relief from record gas prices"
  },
  {
    "id": 9804,
    "mediaId": 2572,
    "date": "2022-03-29",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona wrote to Biden in a letter.",
    "author": "",
    "title": "GOP introduces border strategy bill as WH poised to end Trump border policy"
  },
  {
    "id": 7538,
    "mediaId": 2859,
    "date": "2022-04-01",
    "sentence": "Here are the eight races to watch in the West:\nArizona U.S. Senate\nSen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., is facing his first reelection campaign.",
    "author": "D. Hunter Schwarz",
    "title": "These 8 midterm races in the West could decide who controls Congress"
  },
  {
    "id": 9798,
    "mediaId": 2573,
    "date": "2022-04-04",
    "sentence": "INGRAHAM: Oh, and I will say in closing that Maggie Hassan in New Hampshire; <span class='selected-term'>Mark Kelly</span> in Arizona; Cortes Masto in Nevada, you are partly responsible for this.",
    "author": "",
    "title": "'The Ingraham Angle' on Disney, Hunter Biden"
  },
  {
    "id": 8499,
    "mediaId": 6461,
    "date": "2022-04-07",
    "sentence": "In Arizona, where a Democratic senator, <span class='selected-term'>Mark Kelly</span>, is vulnerable, prices are up by 50%.",
    "author": "",
    "title": "Spiralling fuel prices add to Democrats’ woes"
  }
]