[
  {
    "id": 4472,
    "mediaId": 2658,
    "date": "2022-01-13",
    "sentence": "Raphael Warnock of Georgia, Maggie Hassan of New Hampshire, Catherine Cortez Masto of Nevada and <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "",
    "title": "Dems torpedo Cruz’s bid to sanction Russian pipeline"
  },
  {
    "id": 3564,
    "mediaId": 2658,
    "date": "2022-01-15",
    "sentence": "But he’s held off on endorsing a Senate candidate to go up against incumbent Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Trump kicks off midterm year still stuck on last election"
  },
  {
    "id": 3575,
    "mediaId": 2658,
    "date": "2022-01-16",
    "sentence": "DOUG DUCEY as a “terrible representative of your state,” and said that the Republican, who is mulling a run against Democratic Sen. <span class='selected-term'>MARK KELLY</span>, is “not going to get my endorsement.”\nOn the scene: Mark Peterson photographed the rally for POLITICO.",
    "author": "",
    "title": "POLITICO Playbook: A night at the Trump rally"
  },
  {
    "id": 3659,
    "mediaId": 8475,
    "date": "2022-01-21",
    "sentence": "This isn’t the first time Ducey’s name has come up as a potential GOP candidate against Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Jeremy Duda",
    "title": "Ducey: I’m still not running for Senate"
  },
  {
    "id": 3602,
    "mediaId": 2590,
    "date": "2022-01-23",
    "sentence": "Georgia Sen. Jon Ossoff, a mainstream liberal, has teamed up with the more moderate Democratic Arizona Sen. <span class='selected-term'>Mark Kelly</span> to write legislation banning corporate PACs and barring members from selling individual stocks.",
    "author": "Kevin Robillard",
    "title": "Joe Biden Still Believes In Washington. He Might Be The Only One."
  },
  {
    "id": 3590,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "Brnovich is running for the U.S. Senate seat presently held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> and once held by the late Sen. John McCain and, before that, Sen. Barry Goldwater.",
    "author": "Alex Henderson",
    "title": "Arizona's attorney general just got blasted for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 3965,
    "mediaId": 2512,
    "date": "2022-01-25",
    "sentence": "Brnovich is running for the U.S. Senate seat presently held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> and once held by the late Sen. John McCain and, before that, Sen. Barry Goldwater.",
    "author": "Alex Henderson",
    "title": "Arizona writer lambasts State AG Brnovich for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 3637,
    "mediaId": 2590,
    "date": "2022-01-26",
    "sentence": "The state’s other Democratic senator, <span class='selected-term'>Mark Kelly</span>, is already fundraising off of his vote for the filibuster change ahead of a reelection campaign this fall.",
    "author": "Travis Waldron",
    "title": "The Death Of Dems' Voting Rights Bill Is A Green Light For GOP State Legislatures"
  },
  {
    "id": 4325,
    "mediaId": 2636,
    "date": "2022-01-27",
    "sentence": "That would be Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "The Man at the Center of Arizona’s Primary"
  },
  {
    "id": 2936,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "Doug Ducey of Arizona could reshuffle the Arizona Senate race if he changes course and decides to give it a go, according to a new survey of registered voters that pegged him as the best bet to oust Democratic Sen. <span class='selected-term'>Mark Kelly</span> in the 2022 midterm elections.",
    "author": "Seth McLaughlin",
    "title": "Gov. Doug Ducey is GOP’s best bet in Arizona Senate race despite opposition from Trump: Poll"
  },
  {
    "id": 1974,
    "mediaId": 2658,
    "date": "2022-02-06",
    "sentence": "",
    "author": "",
    "title": "POLITICO Playbook: A Manchin-Murkowski mindmeld"
  },
  {
    "id": 1928,
    "mediaId": 2526,
    "date": "2022-02-08",
    "sentence": "This November, at least two Senate Democrats stand to lose their seats in swing states that Biden won by slim margins: Sen. Raphael Warnock of Georgia and Sen. <span class='selected-term'>Mark Kelly</span> of Arizona — neither of whom have called for the president’s aid.",
    "author": "Paul Bois",
    "title": "Poll: Joe Biden Job Approval Rating Crashes to 38 Percent"
  },
  {
    "id": 1932,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Elizabeth Elkind",
    "title": "38 Republican lawmakers write to Biden AGAIN to urge him to take a cognitive test: GOP says 'something isn't right' and Americans deserve to have 'absolute confidence' in the President"
  },
  {
    "id": 1921,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Geoff Earle",
    "title": "Trump says Mitch McConnell 'does NOT speak for the Republican party' and the 'majority of its voters' for calling January 6 an 'insurrection' and criticizing the censure of Liz Cheney and Adam Kinzinger"
  },
  {
    "id": 1805,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Tori Richards",
    "title": "#WalkAway campaign founder: 'Feds tried to destroy me over Jan. 6'"
  },
  {
    "id": 1046,
    "mediaId": 2520,
    "date": "2022-02-10",
    "sentence": "Republican Senate candidate Jim Lamon dresses like an Old West lawman in a new ad in which he engages in a gunfight with actors representing President Joe Biden, House Speaker Nancy Pelosi and incumbent Sen. <span class='selected-term'>Mark Kelly</span>, whose wife was gravely injured in a 2011 mass shooting near Tucson that left six dead and a dozen others injured.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Republican Senate candidate Jim Lamon assailed for gunslinging ad against Kelly, Biden, Pelosi"
  },
  {
    "id": 990,
    "mediaId": 2550,
    "date": "2022-02-11",
    "sentence": "Lamon, dressed in a sheriff's costume, shoots the weapons out of the hands of his three masked enemies with Trump-sounding nicknames who are meant to resemble Democratic incumbent <span class='selected-term'>Mark Kelly</span>, President Joe Biden, and Speaker Nancy Pelosi.",
    "author": "",
    "title": "who refuses to accept his own 2020 defeat"
  },
  {
    "id": 1141,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "A Republican candidate challenging Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span> released a wild west-themed campaign ad that shows him shooting at President Joe Biden, House Speaker Nancy Pelosi and Kelly himself.",
    "author": "Andrew Trunsky",
    "title": "GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  },
  {
    "id": 925,
    "mediaId": 2658,
    "date": "2022-02-11",
    "sentence": "And although vulnerable incumbent Senate Democrats such as Catherine Cortez Masto of Nevada and <span class='selected-term'>Mark Kelly</span> of Arizona support banning lawmaker trades, they also say their constituents are far more concerned about the broader economy.",
    "author": "",
    "title": "Dems' latest challenge: Draining the Hill's swamp (at least a little)"
  },
  {
    "id": 1772,
    "mediaId": 2557,
    "date": "2022-02-11",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nA Republican candidate challenging Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span> released a wild west-themed campaign ad that shows him shooting at President Joe Biden, House Speaker Nancy Pelosi and Kelly himself.",
    "author": "DML News App",
    "title": "VIDEO: GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  },
  {
    "id": 1784,
    "mediaId": 2547,
    "date": "2022-02-14",
    "sentence": "A recent poll shows the current GOP front-runner in that race, Attorney General Mark Brnovich, within two points of the incumbent <span class='selected-term'>Mark Kelly</span>, while Ducey is within three points.",
    "author": "Steve M.",
    "title": "Is There Any Such Thing As An Unelectable Republican Now?"
  },
  {
    "id": 944,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Several Republicans already are vying to run against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., in the key battleground state.",
    "author": "Charlie McCarthy",
    "title": "Trump: 'RINO' Gov. Ducey Wouldn't Win GOP Senatorial Primary"
  },
  {
    "id": 1016,
    "mediaId": 6511,
    "date": "2022-02-15",
    "sentence": "Basta ver, por ejemplo, la barbaridad que ha hecho el aspirante a senador por Arizona, Jim Lamon, en cuyo mensaje de campaña dispara su revólver al estilo Viejo Oeste contra caracterizaciones de la presidenta de la Cámara Baja, Nancy Pelosi, el presidente Joe Biden, y el senador demócrata de Arizona, <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Inimaginables serán para EE.UU. los días sin inmigrantes"
  },
  {
    "id": 916,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "The GOP’s chances of flipping the seat held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> — a key contest in the party’s fight for the Senate majority — are viewed by many in both parties as even better with Ducey, who has been elected statewide three times, than the current cast of MAGA Republicans in the race.",
    "author": "",
    "title": "Ducey looms as last big question on 2022 Senate map"
  },
  {
    "id": 454,
    "mediaId": 2641,
    "date": "2022-02-24",
    "sentence": "The incumbent is Sen. <span class='selected-term'>Mark Kelly</span>, a Democrat.",
    "author": "Brian Trusdell",
    "title": "Arizona AG Brnovich to Newsmax: Biden Admin Intentionally Undermining Law"
  },
  {
    "id": 12674,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "A local candidate wants to transcend party. Does Texas allow that?"
  },
  {
    "id": 12787,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Harris County, home to Houston, warns of delays in counting ballots."
  },
  {
    "id": 12804,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Gov. Greg Abbott wins the G.O.P. nomination, defeating challengers from the right."
  },
  {
    "id": 12808,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Beto O’Rourke snags the Democratic nomination for Texas governor."
  },
  {
    "id": 17254,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "And I didn’t have tickets,” said Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.).",
    "author": "",
    "title": "Congress returns to normal-ish for Biden’s speech — with cheers, jeers and viral moments"
  },
  {
    "id": 17215,
    "mediaId": 2664,
    "date": "2022-03-03",
    "sentence": "Former President Donald Trump celebrated on Thursday after Senate GOP Leader Mitch McConnell (R-KY) failed at recruiting a top contender to challenge Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) in the 2022 midterm elections.",
    "author": "Bob Brigham",
    "title": "Trump brags about destroying Mitch McConnell’s plan to recruit a coveted Senate candidate"
  },
  {
    "id": 17129,
    "mediaId": 2520,
    "date": "2022-03-03",
    "sentence": "Ducey’s announcement to some of his closest financial allies ends the long-running effort by national and local Republican leaders and deep-pocketed donors to recruit him for the race against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., whose reelection could decide which party controls the evenly divided chamber.",
    "author": "Stacey Barchenger",
    "title": "'I have the job I want': Arizona Gov. Doug Ducey will not run for the US Senate in 2022"
  },
  {
    "id": 17049,
    "mediaId": 2621,
    "date": "2022-03-03",
    "sentence": "",
    "author": "Kipp Jones",
    "title": "Democrats a No as Resolution to End Covid-19 Emergency Declaration Passes Senate in Party-Line Vote"
  },
  {
    "id": 17344,
    "mediaId": 2594,
    "date": "2022-03-03",
    "sentence": "We have a strong field of candidates in Arizona and I will be actively supporting our nominee – and perhaps weighing in before the primary.”\nThe news was a major blow to efforts that state Republicans and national GOP leaders are undertaking to unseat <span class='selected-term'>Mark Kelly</span>, the first-term senator from the state who won a special election to fill the seat of Sen John McCain, a Republican who died in 2018, for the remainder of Mr McCain’s term ending this year.",
    "author": "John Bowden",
    "title": "Ducey, Hogan, Sununu: Why GOP governors who spurned Trump are refusing to run for Senate"
  },
  {
    "id": 12806,
    "mediaId": 2636,
    "date": "2022-03-03",
    "sentence": "For months, he had told both reporters pressing him and Republicans courting him that he had little appetite to challenge Senator <span class='selected-term'>Mark Kelly</span>, a first-term Democrat.",
    "author": "",
    "title": "Ducey Confirms He Will Not Run for Senate, Despite McConnell’s Wooing"
  },
  {
    "id": 12873,
    "mediaId": 2641,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state's high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "",
    "title": "No Senate Run for Arizona Gov. Ducey, Blow to GOP Recruiting"
  },
  {
    "id": 12653,
    "mediaId": 2679,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state’s high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "STEVE PEOPLES",
    "title": "No Senate run for Arizona Gov. Ducey, blow to GOP recruiting"
  },
  {
    "id": 12544,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "While I’m disappointed he decided not to run, Arizona will be an important part of our plan to win the majority back.”\nChris Hartline, a spokesperson for the NRSC, said Republicans “have great candidates running in Arizona, one of whom will beat <span class='selected-term'>Mark Kelly</span> in November.”\nDucey’s decision to bypass the race removes a potential obstacle for the other Republican candidates, including state Attorney General Mark Brnovich; Blake Masters, a venture capitalist; and Jim Lamon, an energy executive self-funding his campaign.",
    "author": "",
    "title": "Ducey won't run for Senate in Arizona"
  },
  {
    "id": 17201,
    "mediaId": 2746,
    "date": "2022-03-04",
    "sentence": "Doug Ducey confirmed he will not challenge vulnerable Democratic Sen. <span class='selected-term'>Mark Kelly</span> in November.",
    "author": "Susan Ferrechio",
    "title": "Senate recruiting becomes proxy war in Trump-McConnell feud"
  },
  {
    "id": 11087,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "Brnovich has been criticized for leading the investigation into fraud by Trump supporters while seeking the former president's endorsement in his 2022 midterm challenge of Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ)/\nIn January, MSNBC's Rachel Maddow laid out a damning timeline of events:\nWatch:",
    "author": "Bob Brigham",
    "title": "GOP attorney general investigated Trump’s phony electors — but no charges have been filed: report"
  },
  {
    "id": 9182,
    "mediaId": 2641,
    "date": "2022-03-21",
    "sentence": "The Arizona Republican primary to challenge Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., is shaping up to be a close one between a pair of America First candidates surging in two polls released Monday.",
    "author": "Eric Mack",
    "title": "Two Polls Show Close Race Between Masters, Lamon"
  },
  {
    "id": 11591,
    "mediaId": 8322,
    "date": "2022-03-25",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> are warning President Biden against ending Title 42 border restrictions without a \"comprehensive plan\" in place to ensure order at the southern border -- a sharp contrast to the stance of Senate Majority Leader Chuck Schumer.",
    "author": "Adam Shaw",
    "title": "Arizona Dem senators warn Biden against 'sharp end' to Title 42 border restrictions without plan"
  },
  {
    "id": 12234,
    "mediaId": 2748,
    "date": "2022-03-26",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) are pleading with President Joe Biden to preserve border controls that have stemmed illegal immigration at the United States-Mexico border.",
    "author": "Blarp Blog",
    "title": "Democrats Kyrsten Sinema, Mark Kelly Urge Biden to Enforce Border Controls"
  },
  {
    "id": 11797,
    "mediaId": 2526,
    "date": "2022-03-27",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) have urged the administration to continue enforcing the authority.",
    "author": "John Binder",
    "title": "Report: Biden Officials Prepare for ‘Mass Migration Event’ at Southern Border"
  },
  {
    "id": 10496,
    "mediaId": 6449,
    "date": "2022-03-29",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> sent a letter to Biden expressing their concern.",
    "author": "Jarrett Stepman",
    "title": "Border Crisis Is About to Get a Lot Worse"
  },
  {
    "id": 9804,
    "mediaId": 2572,
    "date": "2022-03-29",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona wrote to Biden in a letter.",
    "author": "",
    "title": "GOP introduces border strategy bill as WH poised to end Trump border policy"
  },
  {
    "id": 9824,
    "mediaId": 5118,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "Asylum limits at Mexico border expected to end May 23, sources say; US braces for influx of migrants"
  },
  {
    "id": 9818,
    "mediaId": 2572,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Biden administration to end Title 42 border policy, despite fears of massive migrant surge: reports"
  },
  {
    "id": 10022,
    "mediaId": 2553,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Gabe Kaminsky",
    "title": "White House Expects Migrant ‘Influx’ If Anticipated Order Scrapping Trump-Era Policy Implemented"
  },
  {
    "id": 10381,
    "mediaId": 2644,
    "date": "2022-03-30",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Arizona Democrats, issued a similar warning last week, citing the projected impacts on local communities and border security.",
    "author": "Callie Patteson",
    "title": "Biden administration to scrap Title 42 border policy by May 23 despite warnings: reports"
  },
  {
    "id": 9976,
    "mediaId": 2590,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "Asylum Limits At Border Expected To End May 23: Report"
  },
  {
    "id": 10584,
    "mediaId": 2801,
    "date": "2022-03-30",
    "sentence": "",
    "author": "COLLEEN LONG, JASON DEAREN and ELLIOT SPAGAT",
    "title": "AP sources: Asylum limits at border expected to end May 23"
  },
  {
    "id": 10648,
    "mediaId": 6512,
    "date": "2022-03-30",
    "sentence": "Arizona Democrats - Senators Kirsten Sinema and <span class='selected-term'>Mark Kelly</span> - also made the same plea to the administration.",
    "author": "Joshua Summers",
    "title": "Joe Biden's Administration to End Title 42 Expulsion by May; Republicans Push Back"
  },
  {
    "id": 10000,
    "mediaId": 8322,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Dem senators sound alarm over reports Biden administration will end Title 42 border policy"
  },
  {
    "id": 10087,
    "mediaId": 2730,
    "date": "2022-03-31",
    "sentence": "pic.twitter.com/esgRMhCFrk\n— House Freedom Caucus (@freedomcaucus) March 30, 2022\nArizona Senators <span class='selected-term'>Mark Kelly</span> (D) and Kyrsten Sinema (D) sent a letter to President Biden last week, stating, \"Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your Administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border.\"",
    "author": "Julio Rosas",
    "title": "Even Some Democrats Are Telling the Biden Admin to Not End Title 42 At the Southern Border"
  },
  {
    "id": 9823,
    "mediaId": 2572,
    "date": "2022-03-31",
    "sentence": "",
    "author": "",
    "title": "Border Patrol agents bracing for new migrant wave if Title 42 lifts: 'We are expecting to get wrecked'"
  },
  {
    "id": 9863,
    "mediaId": 8475,
    "date": "2022-04-01",
    "sentence": "“It is not lost on (us) that folks who seized on the Trump Administration’s Title 42 restrictions to stoke fear about migrants bringing COVID into communities were among the first to lift indoor mask mandates and other restrictions.”\nThey continued: “Our government has the tools to safely process and screen people at the border, as required by law, in order to determine whether they qualify for asylum or other humanitarian protections.”\nArizona’s Democratic senators, <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema, both denounced Biden’s decision to end Title 42.",
    "author": "Ariana Figueroa",
    "title": "Biden administration to halt pandemic policy blocking migrants who claim asylum"
  },
  {
    "id": 9812,
    "mediaId": 2584,
    "date": "2022-04-01",
    "sentence": "We are already facing an unprecedented increase in migrants this year.”\n<span class='selected-term'>Mark Kelly</span>, a Democratic senator from Arizona who faces a tough re-election fight, said: “This is a crisis and in my estimation, because of a lack of planning from the administration, it’s about to get worse.”\nThe Department of Homeland Security (DHS) insists it will be ready.",
    "author": "David Smith",
    "title": "Biden ends Trump-era asylum curbs amid border-region Democrat backlash"
  },
  {
    "id": 9799,
    "mediaId": 8322,
    "date": "2022-04-01",
    "sentence": "\"Senate Democrats like <span class='selected-term'>Mark Kelly</span> created this border crisis and have consistently voted against measures to secure the border,\" National Republican Senatorial Committee (NRSC) spokeswoman Katharine Cooksey claimed in a statement to Fox News.",
    "author": "Paul Steinhauser",
    "title": "Biden immigration decision could make midterm climate even tougher for Democrats"
  },
  {
    "id": 9872,
    "mediaId": 2822,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "",
    "title": "Vulnerable Democrats warn Biden about reopening asylum"
  },
  {
    "id": 9894,
    "mediaId": 2594,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Via AP news wire",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9896,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Jonathan J. Cooper and Anita Snow",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9837,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "Arizona’s two (very nervous) Democratic senators, Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, dashed off a letter to President Biden last week urging him not to cancel Title 42 without a viable plan that will control the border in its absence.",
    "author": "RJ Hauman",
    "title": "Exclusive–Hauman: Get Ready for a Border Surge the Likes of Which Our Country Has Never Seen"
  },
  {
    "id": 10030,
    "mediaId": 2551,
    "date": "2022-04-01",
    "sentence": "Moderate Democratic Senator Kyrsten Sinema said Wednesday that she and fellow Arizona Senator <span class='selected-term'>Mark Kelly</span> spoke with the Department of Homeland Security (DHS) about not ending Title 42 until there are other safeguards in place at the border.",
    "author": "",
    "title": "Biden administration pledges to deport migrants caught illegally crossing the US border 'IMMEDIATELY' as both Democrats and Republican warn of a 'mass migrant event' when Title 42 is lifted in May"
  },
  {
    "id": 10016,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Manchin calls Biden lifting Title 42 border policy 'frightening decision'"
  },
  {
    "id": 7075,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Arizona AG warns of 'tidal wave' of migrants at southern border if Biden admin lifts Title 42"
  },
  {
    "id": 9805,
    "mediaId": 8322,
    "date": "2022-04-03",
    "sentence": "One Democratic lawmaker who spoke out is Arizona Sen. <span class='selected-term'>Mark Kelly</span>, who said the Biden administration ended Title 42 \"without a plan.\"",
    "author": "Hanna Panreck",
    "title": "NBC News contributor says Biden administration more about 'wish casting' than 'preparation'"
  },
  {
    "id": 9912,
    "mediaId": 6509,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Federal Lawsuit Seeks to Block End to Title 42 Asylum Limits"
  },
  {
    "id": 9899,
    "mediaId": 4045,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Missouri among states suing to stop Biden administration from ending asylum limits"
  },
  {
    "id": 10004,
    "mediaId": 8475,
    "date": "2022-04-04",
    "sentence": "It’s unacceptable to end Title 42 without a plan and coordination in place to ensure a secure, orderly and humane process at the border,” said Sen. <span class='selected-term'>Mark Kelly</span>, whose comments were echoed by fellow Arizona Democratic Sen. Kyrsten Sinema.",
    "author": "Emily Sacia",
    "title": "With Title 42 winding down, worries rise about handling migrant surge"
  },
  {
    "id": 7282,
    "mediaId": 8484,
    "date": "2022-04-04",
    "sentence": "Moderate Democratic Senator Kyrsten Sinema said that she and fellow Arizona Senator <span class='selected-term'>Mark Kelly</span>, also a Democrat, spoke with DHS about not ending Title 42 until there are other safeguards in place at the border.",
    "author": "Emily Goodin",
    "title": "Three Republican states SUE the Biden administration to stop lifting Title 42 with growing fears there will be chaos and a huge migrant influx at the southern border in May"
  },
  {
    "id": 7223,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Democrats from Arizona, and Sen. Joe Manchin, a Democrat from West Virginia, also wrote letters last week expressing similar concerns.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 7933,
    "mediaId": 6511,
    "date": "2022-04-04",
    "sentence": "La queja republicana incluso cita a senadores demócratas de Arizona, <span class='selected-term'>Mark Kelly</span> y Kirsten Sinema, que consideran que la Administración Biden terminará el programa “sin estar lista”.",
    "author": "",
    "title": "Tres estados republicanos piden a juez bloquear decisión de Biden para terminar el Título 42 contra inmigrantes"
  },
  {
    "id": 7410,
    "mediaId": 2548,
    "date": "2022-04-04",
    "sentence": "",
    "author": "Nicole Silverio",
    "title": "‘This Is Intentional’: Rep. Jim Jordan Rips Biden Administration’s Handling Of Southern Border, COVID-19"
  },
  {
    "id": 7979,
    "mediaId": 2573,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> have both written to and spoke with Mayorkas to express their concerns about it being lifted without proper planning.",
    "author": "Adam Shaw",
    "title": "Sen. Tester becomes latest Democrat to oppose Biden move to end Title 42"
  },
  {
    "id": 7092,
    "mediaId": 2520,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, would rather perpetuate a lie than structure an actual immigration and border security policy.",
    "author": "EJ Montini",
    "title": "Gov. Doug Ducey and Sens. Kyrsten Sinema and Mark Kelly bolster a border security lie"
  },
  {
    "id": 7055,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Via AP news wire",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7059,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7392,
    "mediaId": 2664,
    "date": "2022-04-06",
    "sentence": "Brnovich is seeking Trump's endorsement as he runs for the U.S. Senate in Arizona against incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "Matthew Chapman",
    "title": "Trump’s 'Big Lie' undermined by long-awaited report from Arizona attorney general"
  },
  {
    "id": 7638,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Can <span class='selected-term'>Mark Kelly</span> run for re-election as a flinty independent in Arizona?",
    "author": "Ed Morrissey",
    "title": "Midterm signals: Kelly looking to break out of Biden's orbit"
  },
  {
    "id": 7549,
    "mediaId": 2679,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump’s endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 8824,
    "mediaId": 2735,
    "date": "2022-04-06",
    "sentence": "Joe Manchin (D-W.Va.), <span class='selected-term'>Mark Kelly</span> (D-Ariz.), and Catherine Cortez Masto (D-Nev.).",
    "author": "Jake Johnson",
    "title": "GOP Threatens to Hold COVID Funding Hostage to Preserve Trump Immigration Policy"
  },
  {
    "id": 8359,
    "mediaId": 2877,
    "date": "2022-04-06",
    "sentence": "House Minority Leader Kevin McCarthy is opposed, of course, but so are several Democrat senators — Joe Manchin, Kyrsten Sinema, <span class='selected-term'>Mark Kelly</span>, Mark Warner, and Maggie Hassan are warning that Biden’s decision to open the borders even further will result in nothing but a surge of new border crossers.",
    "author": "Nate Jackson /",
    "title": "The Border Is About to Get Even Worse"
  },
  {
    "id": 8412,
    "mediaId": 6511,
    "date": "2022-04-06",
    "sentence": "Así lo expresó la portavoz de la Casa Blanca, Jen Psaki, quien fue cuestionada sobre si el término del Título 42 podría permitir una “oleada de inmigrantes” en la frontera con México, una preocupación que han expuesto varios gobernadores y congresistas republicanos e incluso algunos senadores demócratas, como <span class='selected-term'>Mark Kelly</span> y Kirsten Sinema, ambos de Arizona.",
    "author": "Maria Ortiz",
    "title": "“No es momento para venir”: Gobierno advierte a migrantes que la polémica por el Título 42 va a frenarlos en la frontera"
  },
  {
    "id": 8476,
    "mediaId": 2741,
    "date": "2022-04-07",
    "sentence": "(Other Democrats joining Sinema in support of the bill are her fellow Arizonan <span class='selected-term'>Mark Kelly</span>, a vulnerable Democrat facing reelection this year; Maggie Hassan of New Hampshire, also in a tough re-election fight; Montana’s Jon Tester; and Sinema’s fellow conservative, Joe Manchin of West Virginia.)",
    "author": "Eric Lutz",
    "title": "Texas: We're Going to Bus Undocumented Migrants to D.C., Florida: Hold My Beer"
  },
  {
    "id": 8699,
    "mediaId": 2609,
    "date": "2022-04-07",
    "sentence": "But rather than view it as a public health victory, some moderate Democrats see a huge political liability, leaving them furious that the White House ended policy ahead of a tough midterm election…\nSen. Joe Manchin (D-W.Va.) called it a “frightening decision.” Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) called it “wrong.” And Sen. Maggie Hassan (D-N.H.) said the Biden administration “does not appear to be ready” for the surge in migration that could result.",
    "author": "Mike LaChance",
    "title": "Obama’s DHS Secretary Jeh Johnson Against Ending Title 42, Says Southern Border Not Sustainable"
  },
  {
    "id": 7947,
    "mediaId": 2752,
    "date": "2022-04-07",
    "sentence": "So, will this love letter be enough to get Trump's endorsement so Brnovich can be the guy to take on Sen. <span class='selected-term'>Mark Kelly</span>?",
    "author": "Liz Dye",
    "title": "Arizona AG, Hoping For Trump Nod, Produces Election 'Report' Heavy On Innuendo, Light On Data"
  },
  {
    "id": 7968,
    "mediaId": 2573,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Rep. Val Demings backs Biden admin move to end Title 42, says COVID numbers are ‘way down’"
  },
  {
    "id": 8042,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "Maggie Hassan, Raphael Warnock, <span class='selected-term'>Mark Kelly</span> and Catherine Cortez Masto want to stop the rule from being lifted.",
    "author": "",
    "title": "Biden Move Lifting COVID Curbs on Migrants at Border Has Dems on Defensive"
  },
  {
    "id": 7336,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "“Because of <span class='selected-term'>Mark Kelly</span>, Arizona families are facing the highest rate of inflation in the nation, record-high gas prices, and an ever-worsening crisis along the Southern Border.”\n“It would be easier to believe Kelly actually cared about helping struggling Arizona families if his voting record didn’t reveal the exact opposite,” she said.",
    "author": "Seth McLaughlin",
    "title": "Eyeing reelection, Sen. Mark Kelly drifts away from Biden"
  },
  {
    "id": 7353,
    "mediaId": 2526,
    "date": "2022-04-08",
    "sentence": "Kyrsten Sinema (D-AZ), <span class='selected-term'>Mark Kelly</span> (D-AZ), James Lankford (R-OK), John Cornyn (R-TX), Joe Manchin (D-WV), Shelley Moore Capito (R-WV), Jon Tester (D-MT), Rob Portman (R-OH), Maggie Hassan (D-NH), Thom Tillis (R-NC), and John Thune (R-SD) sponsored the Senate version of the bill.",
    "author": "Sean Moran",
    "title": "House Democrats Push Back on Joe Biden’s Ending of Title 42"
  },
  {
    "id": 8161,
    "mediaId": 2520,
    "date": "2022-04-08",
    "sentence": "Kyrsten Sinema, D-Ariz., and <span class='selected-term'>Mark Kelly</span>, D-Ariz., oppose ending the policy without a \"comprehensive, workable plan in place,\" saying the would overwhelm Arizona border communities and stretch the resources of nonprofits that are already near capacity.",
    "author": "Clara Migoya",
    "title": "What is Title 42 and how does it affect the Arizona border? The immigration policy, explained"
  },
  {
    "id": 7070,
    "mediaId": 2572,
    "date": "2022-04-09",
    "sentence": "",
    "author": "Marisa Schultz",
    "title": "Dem Rep. Cuellar joins bipartisan effort to block Biden's rollback of Title 42, opposes bussing migrants to DC"
  },
  {
    "id": 8041,
    "mediaId": 2643,
    "date": "2022-04-09",
    "sentence": "Meanwhile, Senators Krysten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona, Maggie Hassan of New Hampshire, Joe Manchin of West Virginia and Jon Tester of Montana have signed onto similar legislation in Congress' upper chamber.",
    "author": "Andrew Stanton",
    "title": "Henry Cuellar Becomes Sixth House Democrat to Oppose Biden Lifting Title 42"
  },
  {
    "id": 6997,
    "mediaId": 8484,
    "date": "2022-04-10",
    "sentence": "The Democratic senators on board with the upper chamber bill to keep Title 42 as long as the health emergency remains are moderates Krysten Sinema of Arizona and Joe Manchin of West Virginia as well as <span class='selected-term'>Mark Kelly</span> of Arizona, Maggie Hassan of New Hampshire and Jon Tester of Montana.",
    "author": "Katelyn Caralle",
    "title": "Now 11 DEMOCRATS oppose Biden ending Title 42: Texas Rep. Henry Cuellar is the latest to join bipartisan legislation to KEEP the pandemic-era policy at the border"
  },
  {
    "id": 6840,
    "mediaId": 6449,
    "date": "2022-04-11",
    "sentence": "Arizona’s two Democratic senators, Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, already have expressed their opposition, and others are now joining in.",
    "author": "Jarrett Stepman",
    "title": "Biden’s Radical Open Borders Policies Prompt Pushback"
  },
  {
    "id": 6629,
    "mediaId": 2735,
    "date": "2022-04-13",
    "sentence": "Just 19% of Arizona Democratic primary voters have a favorable opinion of Sinema, according to a January Data for Progress poll, compared to 78% for fellow Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz.",
    "author": "Igor Derysh",
    "title": "Kyrsten Sinema Assures Corporate Donors She’ll Protect Their Tax Breaks"
  },
  {
    "id": 6795,
    "mediaId": 2741,
    "date": "2022-04-13",
    "sentence": "Cosponsors on the legislation included two Democrats, <span class='selected-term'>Mark Kelly</span> of Arizona and Maggie Hassan of New Hampshire, both of whom are facing uphill reelection battles this cycle.",
    "author": "Eric Lutz",
    "title": "Beto O'Rourke Wants Biden To End Pandemic Border Restrictions. But Not Like This."
  },
  {
    "id": 5931,
    "mediaId": 2695,
    "date": "2022-04-13",
    "sentence": "Arizona Democrat Senator <span class='selected-term'>Mark Kelly</span> took office in December 2020 following a special election victory in November 2020.",
    "author": "BlazeTV Staff",
    "title": "NPR predicts these 10 Senate seats might see a party FLIP"
  },
  {
    "id": 5870,
    "mediaId": 6503,
    "date": "2022-04-14",
    "sentence": "Arizona Democrat Senator <span class='selected-term'>Mark Kelly</span> took office in December 2020 following a special election victory in November 2020.",
    "author": "Warner Todd Huston",
    "title": "Even Left-Wing NPR is Predicting Ten Senate Seats Could go Red"
  },
  {
    "id": 6780,
    "mediaId": 6519,
    "date": "2022-04-14",
    "sentence": "Even Democrats such as Senators Maggie Hassan, Jon Tester, Joe Manchin, <span class='selected-term'>Mark Kelly</span>, and Kyrsten Sinema are raising the alarm about the consequences of this move by Biden.",
    "author": "Kilian Laverty",
    "title": "FreedomWorks’ Bill of the Month for April 2022: H.R. 741, the PAUSE Act"
  },
  {
    "id": 6700,
    "mediaId": 8347,
    "date": "2022-04-14",
    "sentence": "In Douglas on Wednesday, Senator <span class='selected-term'>Mark Kelly</span> said the immigration system was stressed before Title 42 and lifting the restriction should make things worse.",
    "author": "Craig Smith",
    "title": "Rep. Grijalva splits with Senators on Title 42"
  },
  {
    "id": 6807,
    "mediaId": 6509,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Ben Fox",
    "title": "Migrant Crossings Spike as US Plans to Lift Curb on Asylum"
  },
  {
    "id": 6341,
    "mediaId": 2658,
    "date": "2022-04-18",
    "sentence": "Democrats are defending four incumbents in closely contested states: Hassan, Warnock, Nevada Sen. Catherine Cortez Masto and Sen. <span class='selected-term'>Mark Kelly</span> in Arizona.",
    "author": "",
    "title": "McConnell-tied super PAC makes early $141M play for the Senate"
  },
  {
    "id": 6176,
    "mediaId": 2658,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), facing a tough reelection battle this November, said he’s “continuing to evaluate her record” after a similar meeting.",
    "author": "",
    "title": "Midterm politicking comes for Biden’s stalled tech nominee"
  },
  {
    "id": 5126,
    "mediaId": 8251,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 5205,
    "mediaId": 2654,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Ben Fox",
    "title": "Migrant crossings spike as U.S. plans to lift pandemic limits on asylum"
  },
  {
    "id": 4953,
    "mediaId": 2589,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Ed Morrissey",
    "title": "How will McConnell survive as Senate GOP leader? Here are 141 million reasons ..."
  },
  {
    "id": 4945,
    "mediaId": 2523,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Associated Press",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 5013,
    "mediaId": 2801,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "BEN FOX",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 5060,
    "mediaId": 2632,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Ben Fox",
    "title": "Migrant Crossings Spike as US Plans to Lift Curb on Asylum"
  },
  {
    "id": 4910,
    "mediaId": 2562,
    "date": "2022-04-18",
    "sentence": "\"Right now, this administration does not have a plan,\" Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., said while visiting the border in his state.",
    "author": "NationalWatch",
    "title": "Some Senate Dems Pushing Back on Biden Lifting Title 42 Border Restrictions"
  },
  {
    "id": 4812,
    "mediaId": 2562,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "NationalWatch",
    "title": "Migrant Crossings Spike as US Plans to Lift Title 42"
  },
  {
    "id": 4742,
    "mediaId": 2557,
    "date": "2022-04-18",
    "sentence": "Democratic Sen. <span class='selected-term'>Mark Kelly</span> says Biden has 'no plan.'",
    "author": "DML News App",
    "title": "REPORT: Biden faces deepening Democratic rift over Title 42"
  },
  {
    "id": 4754,
    "mediaId": 2607,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Ben Fox",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 4688,
    "mediaId": 8408,
    "date": "2022-04-18",
    "sentence": "Brnovich is among several Republican candidates who are vying to unseat Democratic Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "Katya Schwenk",
    "title": "Trump Bashes Brnovich, Will Endorse Other Senate Candidate"
  },
  {
    "id": 4653,
    "mediaId": 8350,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "ASSOCIATED PRESS",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 4666,
    "mediaId": 8347,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "",
    "title": "Migrant crossings spike as U.S. plans to lift curb on asylum"
  },
  {
    "id": 4736,
    "mediaId": 2721,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "",
    "title": "Huge spike in border crossings amid new asylum policy"
  },
  {
    "id": 4830,
    "mediaId": 2818,
    "date": "2022-04-19",
    "sentence": "I warned them about this months ago,” Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., told Fox News over the weekend.",
    "author": "The First",
    "title": "REJECTING BIDEN: Dems Turn on Joe, Urge White House to Keep Title 42 at the Border"
  },
  {
    "id": 4943,
    "mediaId": 6627,
    "date": "2022-04-19",
    "sentence": "I warned them about this months ago,” Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., told Fox News over the weekend.",
    "author": "",
    "title": "DEMS Turn On Biden: We Have A CRISIS Here"
  },
  {
    "id": 4915,
    "mediaId": 2919,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "",
    "title": "Migrant crossings spike as U.S. plans to lift curb on asylum"
  },
  {
    "id": 4918,
    "mediaId": 2751,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "BEN FOX",
    "title": "Migrant crossings spike at US-Mexico border as US plans to lift curb on asylum"
  },
  {
    "id": 5043,
    "mediaId": 4032,
    "date": "2022-04-19",
    "sentence": "",
    "author": "R. Cort Kirkwood",
    "title": "March Border Encounters Surpass 221K. Biden Frees 80K-Plus to Establish Illegal-alien Colonies"
  },
  {
    "id": 5033,
    "mediaId": 6428,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Ben Fox",
    "title": "Migrant Crossings Spike as US Plans to Lift Curb on Asylum"
  },
  {
    "id": 5837,
    "mediaId": 8428,
    "date": "2022-04-19",
    "sentence": "The winner of the Republican primaries will face off against incumbent Democrat Sen. <span class='selected-term'>Mark Kelly</span> on Nov. 8.",
    "author": "Alex Caldwell",
    "title": "Trump will not endorse Arizona Attorney General Mark Brnovich for U.S. Senate"
  },
  {
    "id": 5433,
    "mediaId": 2550,
    "date": "2022-04-20",
    "sentence": "Democrats are protecting three incumbents in Georgia (Sen. Raphael Warnock), Arizona (Sen. <span class='selected-term'>Mark Kelly</span>), and Nevada (Sen. Catherine Cortez Masto).",
    "author": "",
    "title": "Senate GOP super PAC playing a lot of defense for a supposed"
  },
  {
    "id": 5062,
    "mediaId": 6746,
    "date": "2022-04-20",
    "sentence": "Senators <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema, both Democrats from Arizona, have questioned whether the Biden administration is adequately prepared to ease the limitations.",
    "author": "Madz Dizon",
    "title": "Title 42: Agencies May Run Out of Funds Amid Looming End of Trump-Era Immigration Policy as Biden Administration Pressure Runs High"
  },
  {
    "id": 5108,
    "mediaId": 2664,
    "date": "2022-04-20",
    "sentence": "A Republican candidate looking to replace Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span> is getting some blowback for a campaign ad, making it the third time this year his public messaging struck a sour note, according to the Phoenix New Times' Elias Weiss.",
    "author": "Sky Palma",
    "title": "GOP candidate released a dramatic 'savior' ad – and it might be blowing up in his face: report"
  },
  {
    "id": 4971,
    "mediaId": 2522,
    "date": "2022-04-20",
    "sentence": "One of those who has expressed doubts that Title 42 should be ended is Senator <span class='selected-term'>Mark Kelly</span> of Arizona who is up for reelection in November in a state that will be heavily affected by the opening of the floodgates, and the retired astronaut raised his concerns with Fox News Digital on Friday.",
    "author": "Chris Donaldson",
    "title": "Midterm reckoning forces ten Dems to turn on Biden, join GOP in opposing plan to end title 42"
  },
  {
    "id": 4989,
    "mediaId": 2694,
    "date": "2022-04-21",
    "sentence": "Senator <span class='selected-term'>Mark Kelly</span> of Arizona visited the U.S.-Mexico border, and in a sign of the issue’s political salience, so did Senator Maggie Hassan of New Hampshire, despite the fact that New Hampshire is nowhere near Mexico.",
    "author": "David A. Graham",
    "title": "The Punt Presidency"
  },
  {
    "id": 4815,
    "mediaId": 2589,
    "date": "2022-04-21",
    "sentence": "Acutely aware of the need to get distance from the president, the four most endangered Democratic incumbents — Arizona Sen. <span class='selected-term'>Mark Kelly</span>, Georgia Sen. Raphael Warnock, Nevada Sen. Catherine Cortez Masto and New Hampshire Sen. Maggie Hassan — are increasingly taking steps to highlight their independence from the president and underscore their differences.",
    "author": "Ed Morrissey",
    "title": "Politico: The Senate Democrat long-distance run from Biden has begun"
  },
  {
    "id": 5184,
    "mediaId": 2699,
    "date": "2022-04-22",
    "sentence": "The senators—<span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema of Arizona, Raphael Warnock of Georgia, Maggie Hassan of New Hampshire, and Joe Manchin of West Virginia—declare that the measure is intended to prevent “disorder” at the border once Title 42 ends.",
    "author": "Scott Bixby",
    "title": "Biden Admin’s Confusing COVID Response Has Experts Crying ‘WTF’"
  },
  {
    "id": 4681,
    "mediaId": 2866,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Fix This Nation Staff",
    "title": "Dem’s Sweetheart Slams Biden’s Border Effort"
  },
  {
    "id": 4759,
    "mediaId": 2790,
    "date": "2022-04-24",
    "sentence": "Senators like Gary Peters of Michigan and <span class='selected-term'>Mark Kelly</span> of Arizona say they want more of a plan from the White House on how to handle the surge of migrants at the border.",
    "author": "Deepa Shivaram",
    "title": "What to know about Title 42, the Trump-era policy now central to the border debate"
  }
]