[
  {
    "id": 12804,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Gov. Greg Abbott wins the G.O.P. nomination, defeating challengers from the right."
  },
  {
    "id": 12787,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Harris County, home to Houston, warns of delays in counting ballots."
  },
  {
    "id": 12674,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "A local candidate wants to transcend party. Does Texas allow that?"
  },
  {
    "id": 12808,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Beto O’Rourke snags the Democratic nomination for Texas governor."
  },
  {
    "id": 17279,
    "mediaId": 2573,
    "date": "2022-03-01",
    "sentence": "",
    "author": "Tyler O'Neil",
    "title": "Senate votes to block Democrat bill enshrining abortion as Supreme Court reconsiders Roe v. Wade"
  },
  {
    "id": 10381,
    "mediaId": 2644,
    "date": "2022-03-30",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Arizona Democrats, issued a similar warning last week, citing the projected impacts on local communities and border security.",
    "author": "Callie Patteson",
    "title": "Biden administration to scrap Title 42 border policy by May 23 despite warnings: reports"
  },
  {
    "id": 9896,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Jonathan J. Cooper and Anita Snow",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9894,
    "mediaId": 2594,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Via AP news wire",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9872,
    "mediaId": 2822,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "",
    "title": "Vulnerable Democrats warn Biden about reopening asylum"
  },
  {
    "id": 7223,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Democrats from Arizona, and Sen. Joe Manchin, a Democrat from West Virginia, also wrote letters last week expressing similar concerns.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 7172,
    "mediaId": 2644,
    "date": "2022-04-06",
    "sentence": "Joe Manchin of West Virginia and Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona — have slammed the administration for lifting Title 42, citing both the ongoing pandemic and an expected migrant influx of up to 170,000 people.",
    "author": "Callie Patteson",
    "title": "Lawmakers rage as Pentagon says it won’t put troops at Mexico border"
  },
  {
    "id": 8559,
    "mediaId": 2890,
    "date": "2022-04-08",
    "sentence": "That didn’t stop five Democratic senators — Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona, Joe Manchin of West Virginia, Raphael Warnock of Georgia, and Maggie Hassan of New Hampshire — from joining Republicans in introducing a bill Thursday that would preserve the policy until 60 days after the surgeon general announces the end of the public health emergency related to Covid-19.",
    "author": "Nicole Narea",
    "title": "The Democratic revolt over Biden’s border policy"
  },
  {
    "id": 7070,
    "mediaId": 2572,
    "date": "2022-04-09",
    "sentence": "",
    "author": "Marisa Schultz",
    "title": "Dem Rep. Cuellar joins bipartisan effort to block Biden's rollback of Title 42, opposes bussing migrants to DC"
  },
  {
    "id": 8041,
    "mediaId": 2643,
    "date": "2022-04-09",
    "sentence": "Meanwhile, Senators Krysten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona, Maggie Hassan of New Hampshire, Joe Manchin of West Virginia and Jon Tester of Montana have signed onto similar legislation in Congress' upper chamber.",
    "author": "Andrew Stanton",
    "title": "Henry Cuellar Becomes Sixth House Democrat to Oppose Biden Lifting Title 42"
  },
  {
    "id": 6997,
    "mediaId": 8484,
    "date": "2022-04-10",
    "sentence": "The Democratic senators on board with the upper chamber bill to keep Title 42 as long as the health emergency remains are moderates Krysten Sinema of Arizona and Joe Manchin of West Virginia as well as <span class='selected-term'>Mark Kelly</span> of Arizona, Maggie Hassan of New Hampshire and Jon Tester of Montana.",
    "author": "Katelyn Caralle",
    "title": "Now 11 DEMOCRATS oppose Biden ending Title 42: Texas Rep. Henry Cuellar is the latest to join bipartisan legislation to KEEP the pandemic-era policy at the border"
  },
  {
    "id": 4943,
    "mediaId": 6627,
    "date": "2022-04-19",
    "sentence": "I warned them about this months ago,” Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., told Fox News over the weekend.",
    "author": "",
    "title": "DEMS Turn On Biden: We Have A CRISIS Here"
  },
  {
    "id": 5152,
    "mediaId": 2721,
    "date": "2022-04-20",
    "sentence": "However, other signatories include lesser-known Democrats in close fights for re-election, like <span class='selected-term'>Mark Kelly</span> of Arizona and Maggie Hassan of New Hampshire.",
    "author": "",
    "title": "Joe Biden’s immigration dilemma"
  },
  {
    "id": 5168,
    "mediaId": 2522,
    "date": "2022-04-20",
    "sentence": "“In this case, the administration hasn’t even prepared, and they don’t have a plan for what to expect,” Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) said.",
    "author": "Kevin Haggerty",
    "title": "Biden may delay lifting Title 42 as Democrats fret over looming midterm disaster: report"
  },
  {
    "id": 4784,
    "mediaId": 2553,
    "date": "2022-04-21",
    "sentence": "",
    "author": "Dillon Burroughs",
    "title": "Florida Congressman: Psaki Should ‘Save Her Tears’ Over Florida Education Law, Save Them For Kids Trafficked Over Biden’s Border Policies"
  }
]