[
  {
    "id": 1784,
    "mediaId": 2547,
    "date": "2022-02-14",
    "sentence": "A recent poll shows the current GOP front-runner in that race, Attorney General Mark Brnovich, within two points of the incumbent <span class='selected-term'>Mark Kelly</span>, while Ducey is within three points.",
    "author": "Steve M.",
    "title": "Is There Any Such Thing As An Unelectable Republican Now?"
  },
  {
    "id": 10854,
    "mediaId": 2658,
    "date": "2022-03-17",
    "sentence": "And Democratic allies of the Biden administration — from Senate Majority Whip DICK DURBIN (Ill.) to swing-state freshman Sen. <span class='selected-term'>MARK KELLY</span> (Ariz.) — continue to push back against Zelenskyy’s desired fighter jet transfer.",
    "author": "",
    "title": "POLITICO Playbook: Scoop: RNC down to two 2024 convention finalists"
  },
  {
    "id": 8574,
    "mediaId": 2526,
    "date": "2022-04-05",
    "sentence": "Joe Manchin (D-WV), Kyrsten Sinema (D-AZ), <span class='selected-term'>Mark Kelly</span> (D-AZ), and Maggie Hassan (D-NH) have all urged Biden to reverse the decision.",
    "author": "John Binder",
    "title": "More Vulnerable Democrats Blast Biden’s Ending Title 42 at Border"
  },
  {
    "id": 5483,
    "mediaId": 2650,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Stephen Kruiser",
    "title": "The Morning Briefing: Do Republicans Have a Legit Shot at the Senate in November?"
  },
  {
    "id": 5931,
    "mediaId": 2695,
    "date": "2022-04-13",
    "sentence": "Arizona Democrat Senator <span class='selected-term'>Mark Kelly</span> took office in December 2020 following a special election victory in November 2020.",
    "author": "BlazeTV Staff",
    "title": "NPR predicts these 10 Senate seats might see a party FLIP"
  },
  {
    "id": 5870,
    "mediaId": 6503,
    "date": "2022-04-14",
    "sentence": "Arizona Democrat Senator <span class='selected-term'>Mark Kelly</span> took office in December 2020 following a special election victory in November 2020.",
    "author": "Warner Todd Huston",
    "title": "Even Left-Wing NPR is Predicting Ten Senate Seats Could go Red"
  },
  {
    "id": 4848,
    "mediaId": 2550,
    "date": "2022-04-19",
    "sentence": "And if fundraising is any measure, Senate Democrats have a fighting chance in November, with their four most vulnerable senators—Raphael Warnock in Georgia, <span class='selected-term'>Mark Kelly</span> of Arizona, Catherine Cortez Masto of Nevada, and Maggie Hassan of New Hampshire—all surpassing the hauls of their leading GOP challengers.",
    "author": "",
    "title": "Midterms will be a heavy lift for the Senate GOP. One super PAC is already shelling out $141 million"
  },
  {
    "id": 5610,
    "mediaId": 2629,
    "date": "2022-04-20",
    "sentence": "Democrats are protecting three incumbents in Georgia (Sen. Raphael Warnock), Arizona (Sen. <span class='selected-term'>Mark Kelly</span>), and Nevada (Sen. Catherine Cortez Masto).",
    "author": "",
    "title": "Suddenly GOP Is On Defensive In Senate 2022 Campaign"
  },
  {
    "id": 4971,
    "mediaId": 2522,
    "date": "2022-04-20",
    "sentence": "One of those who has expressed doubts that Title 42 should be ended is Senator <span class='selected-term'>Mark Kelly</span> of Arizona who is up for reelection in November in a state that will be heavily affected by the opening of the floodgates, and the retired astronaut raised his concerns with Fox News Digital on Friday.",
    "author": "Chris Donaldson",
    "title": "Midterm reckoning forces ten Dems to turn on Biden, join GOP in opposing plan to end title 42"
  }
]