[
  {
    "id": 3572,
    "mediaId": 2658,
    "date": "2022-01-17",
    "sentence": "PHOTO OF THE DAY\nPLAYBOOK READS\nALL POLITICS\nTHE NEW SOUTHWEST CENTRISM — Sen. <span class='selected-term'>MARK KELLY</span> is the subject of a lengthy new profile from the Arizona Republic’s Yvonne Wingett Sanchez that offers as good a glimpse as any into how the freshman Democrat aims to position himself as he heads into what is likely to be a highly competitive reelection campaign this fall.",
    "author": "",
    "title": "POLITICO Playbook: MLK’s family hopes Biden is working today"
  },
  {
    "id": 3723,
    "mediaId": 2658,
    "date": "2022-01-18",
    "sentence": "QUICK LINKS\nIowa’s Child-Care Problems Show Scale of Washington’s Challenge, from The Wall Street Journal\nLiz Cheney’s Wyoming Nemesis Is an Oath Keeper Who Was at Capitol Rally, from Sam Brodney at The Daily Beast\nMarlon Bundo, Pence family rabbit and unlikely gay rights figure, dies, from Bryan Pietsch at The Washington Post\n'Kind of a centrist but very pragmatic': After year in Senate, <span class='selected-term'>Mark Kelly</span> touts microchips bill, infrastructure, COVID-19 aid, from Yvonne Wingett Sanchez at The Arizona Republic\nTRANSITIONS\nBlake Davis has joined the Biden-Harris Administration as a Senior Advisor at OPM.",
    "author": "",
    "title": "Democrats try to go it alone, again"
  },
  {
    "id": 3569,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "and <span class='selected-term'>Mark Kelly</span> (D-Ariz.), all previously reluctant to chip at the filibuster.",
    "author": "",
    "title": "Why Schumer picked a filibuster fight he couldn't win"
  },
  {
    "id": 3573,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) endorsed a rules change specific to elections legislation, and Sens.",
    "author": "",
    "title": "Senate Dems' filibuster ambitions fall short"
  },
  {
    "id": 3565,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "",
    "author": "",
    "title": "The GOP's next big Biden targets"
  },
  {
    "id": 3775,
    "mediaId": 2607,
    "date": "2022-01-22",
    "sentence": "Sinema’s fight with the left has overshadowed the 2022 reelection bid of <span class='selected-term'>Mark Kelly</span>, Arizona’s other Democratic senator, who will be trying to hold on to the seat he won in a special election.",
    "author": "Associated Press",
    "title": "Arizona Democrats censure Sinema over voting rights bill"
  },
  {
    "id": 3555,
    "mediaId": 2658,
    "date": "2022-01-25",
    "sentence": "Sen. <span class='selected-term'>MARK KELLY</span> (D-Ariz.), for example, will almost certainly be compared with Sinema and attacked by Republicans as a party pawn for backing an end run around the filibuster.",
    "author": "",
    "title": "POLITICO Playbook: Schumer strategy leaves some Dems seething"
  },
  {
    "id": 3711,
    "mediaId": 2746,
    "date": "2022-01-26",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> disagrees with the Arizona Democratic Party’s decision to censure Sen. Kyrsten Sinema after she refused to change Senate rules to pass a bill to overhaul federal elections.",
    "author": "Seth McLaughlin",
    "title": "Sen. Mark Kelly defends Sen. Kyrsten Sinema against Arizona Democratic Party censure"
  },
  {
    "id": 2771,
    "mediaId": 2658,
    "date": "2022-02-01",
    "sentence": "So, I don’t get it,” said Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.).",
    "author": "",
    "title": "Dems try to move on"
  },
  {
    "id": 1974,
    "mediaId": 2658,
    "date": "2022-02-06",
    "sentence": "",
    "author": "",
    "title": "POLITICO Playbook: A Manchin-Murkowski mindmeld"
  },
  {
    "id": 937,
    "mediaId": 2746,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Haris Alic",
    "title": "Sen. Manchin balks at vulnerable Democrats’ push to suspend federal gasoline tax"
  },
  {
    "id": 17279,
    "mediaId": 2573,
    "date": "2022-03-01",
    "sentence": "",
    "author": "Tyler O'Neil",
    "title": "Senate votes to block Democrat bill enshrining abortion as Supreme Court reconsiders Roe v. Wade"
  },
  {
    "id": 15377,
    "mediaId": 2658,
    "date": "2022-03-08",
    "sentence": "Sen. Sherrod Brown (D-Ohio) warned more day-to-day discussions would prompt negative headlines saying “that we’re talking to Manchin and this is going here and we’re failing.”\nAnd Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), who also faces a competitive reelection, said he’s focused on “rising costs,” the upcoming government funding package and semiconductor manufacturing.",
    "author": "",
    "title": "Deal with Manchin would reshape Dems’ fight to keep majority"
  },
  {
    "id": 14071,
    "mediaId": 2557,
    "date": "2022-03-15",
    "sentence": "Michael Bennet, Catherine Cortez Masto, Maggie Hassan, <span class='selected-term'>Mark Kelly</span>, Joe Manchin, Jacky Rosen, Kyrsten Sinema, and Jon Tester.",
    "author": "DML News App",
    "title": "REPORT: White House threatens veto of Rand Paul legislation which just passed in Senate with bipartisan support"
  },
  {
    "id": 13635,
    "mediaId": 2745,
    "date": "2022-03-18",
    "sentence": "",
    "author": "",
    "title": "Biden’s chance to tackle climate change is fading amid global energy upheaval"
  },
  {
    "id": 11784,
    "mediaId": 2621,
    "date": "2022-03-21",
    "sentence": "Catherine Cortez-Masto (D-NV); Michael Bennet (D-CO); <span class='selected-term'>Mark Kelly</span> (D-AZ); Maggie Hassan (D-NH); Joe Manchin (D-WV); Kyrsten Sinema (D-AZ); Jon Tester (D-MT) and Jacky Rosen (D-NV).",
    "author": "Kipp Jones",
    "title": "Multiple Democratic Lawmakers Pivot on Mandates Before Midterms: ‘I’m Completely Over Mask Mandates’"
  },
  {
    "id": 11671,
    "mediaId": 2658,
    "date": "2022-03-23",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) said he was “impressed with her testimony so far” and added that the depiction of Jackson as too lenient in sentencing is “just politics.” Sen. Catherine Cortez Masto (D-Nev.) said the soft-on-crime narrative “has been discredited.",
    "author": "",
    "title": "'It's bulls---': Dems reject that Jackson's soft on crime"
  },
  {
    "id": 9941,
    "mediaId": 2658,
    "date": "2022-03-30",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> and West Virginia Sen. Joe Manchin eventually joined Republicans to vote against proceeding with the nomination.",
    "author": "",
    "title": "Moderate Dems hand Biden his first nomination vote defeat"
  },
  {
    "id": 9818,
    "mediaId": 2572,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Biden administration to end Title 42 border policy, despite fears of massive migrant surge: reports"
  },
  {
    "id": 9923,
    "mediaId": 2644,
    "date": "2022-03-31",
    "sentence": "Joe Manchin of West Virginia and Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona opposed the nomination.",
    "author": "Mark Moore",
    "title": "Biden pick for Labor post defeated in Senate — with three Dems opposing"
  },
  {
    "id": 10000,
    "mediaId": 8322,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Dem senators sound alarm over reports Biden administration will end Title 42 border policy"
  },
  {
    "id": 10328,
    "mediaId": 6519,
    "date": "2022-03-31",
    "sentence": "WASHINGTON, D.C.— In response to the Senate’s failed effort to move David Weil’s nomination forward, Adam Brandon, FreedomWorks President, commented:\n“We applaud the 50 Republican Senators and the three Democratic Senators–West Virginia’s Joe Manchin and Arizona’s Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>–who voted against cloture on the nomination of David Weil to be Administrator of the Department of Labor’s Wage and Hour Division.”\n“Weil’s confirmation to this position would have harmed workers as well as employers, particularly small businesses.",
    "author": "Adam Brandon",
    "title": "FreedomWorks Statement in Response to Failed Effort to Move David Weil’s Nomination Forward"
  },
  {
    "id": 10148,
    "mediaId": 2553,
    "date": "2022-03-31",
    "sentence": "Senators Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) wrote to Biden last week with their concerns on ending the directive, telling him to continue the order.",
    "author": "Charlotte Pence Bond",
    "title": "‘The Borders Have To Be Secure’: Manchin Pans Plans To End Title 42"
  },
  {
    "id": 10200,
    "mediaId": 2930,
    "date": "2022-03-31",
    "sentence": "Joe Manchin (D-W.Va.), Kyrsten Sinema (D-Ariz.), and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) voted against allowing Dr. David Weil's nomination to move forward Wednesday evening, several months after the former Obama administration official was first nominated for the top wage regulatory role.",
    "author": "Julia Conley",
    "title": "'Body Blow to Working People': Right-Wing Democrats Reject Biden Labor Nominee"
  },
  {
    "id": 10087,
    "mediaId": 2730,
    "date": "2022-03-31",
    "sentence": "pic.twitter.com/esgRMhCFrk\n— House Freedom Caucus (@freedomcaucus) March 30, 2022\nArizona Senators <span class='selected-term'>Mark Kelly</span> (D) and Kyrsten Sinema (D) sent a letter to President Biden last week, stating, \"Given the impacts that changes to Title 42 could have on border communities, border security, and migrants, we urge your Administration not to make any changes to Title 42 implementation until you are completely ready to execute and coordinate a comprehensive plan that ensures a secure, orderly, and humane process at the border.\"",
    "author": "Julio Rosas",
    "title": "Even Some Democrats Are Telling the Biden Admin to Not End Title 42 At the Southern Border"
  },
  {
    "id": 10337,
    "mediaId": 2619,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Levi Sumagaysay",
    "title": "Senate’s rejection of Biden Labor Department nominee seen as a win for gig companies, loss for PRO Act"
  },
  {
    "id": 10681,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "Joe Manchin (D-W.Va.), Kyrsten Sinema (D-Ariz.), and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) voted against allowing Dr. David Weil's nomination to move forward Wednesday evening, several months after the former Obama administration official was first nominated for the top wage regulatory role.",
    "author": "Julia Conley",
    "title": "'Body blow to working people': Right-wing Democrats reject Biden labor nominee"
  },
  {
    "id": 10607,
    "mediaId": 2721,
    "date": "2022-04-01",
    "sentence": "They were also joined by <span class='selected-term'>Mark Kelly</span>, Arizona’s other senator.",
    "author": "",
    "title": "Biden embarrassed by Senate defeat"
  },
  {
    "id": 10562,
    "mediaId": 2695,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Alex Nitzberg",
    "title": "Manchin condemns 'frightening decision' to nix Title 42 order, says it will result in an even greater flow of migrants along the southern border"
  },
  {
    "id": 10003,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ), both of who urged Biden to keep Title 42 in place, said the decision shows the depth to which the White House does not understand the toll illegal immigration has on border communities.",
    "author": "John Binder",
    "title": "Battleground State Democrats Panic over Biden Ending Trump-Era Border Controls: ‘A Frightening Decision’"
  },
  {
    "id": 10016,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Manchin calls Biden lifting Title 42 border policy 'frightening decision'"
  },
  {
    "id": 9872,
    "mediaId": 2822,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "",
    "title": "Vulnerable Democrats warn Biden about reopening asylum"
  },
  {
    "id": 9795,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Tyler Olson",
    "title": "Democratic Sens. Kelly, Manchin press Biden over Gulf oil leases"
  },
  {
    "id": 10690,
    "mediaId": 2595,
    "date": "2022-04-02",
    "sentence": "",
    "author": "M Dowling",
    "title": "Sen Manchin Calls Biden’s Rescinding of Title 42 “Frightening”"
  },
  {
    "id": 9997,
    "mediaId": 2641,
    "date": "2022-04-04",
    "sentence": "Joe Manchin of West Virginia, and the Arizona senators, <span class='selected-term'>Mark Kelly</span>, who is up for reelection, and Kyrsten Sinema, are opposed to the White House's decision to end Title 42, especially without having a contingent plan to deal with the pressing border crisis.",
    "author": "Peter Malbin",
    "title": "Ending Title 42 Expulsions a 'Disaster Politically' for Democrats: Republican Strategist"
  },
  {
    "id": 7933,
    "mediaId": 6511,
    "date": "2022-04-04",
    "sentence": "La queja republicana incluso cita a senadores demócratas de Arizona, <span class='selected-term'>Mark Kelly</span> y Kirsten Sinema, que consideran que la Administración Biden terminará el programa “sin estar lista”.",
    "author": "",
    "title": "Tres estados republicanos piden a juez bloquear decisión de Biden para terminar el Título 42 contra inmigrantes"
  },
  {
    "id": 7811,
    "mediaId": 2724,
    "date": "2022-04-04",
    "sentence": "Until we have comprehensive, bipartisan immigration reform that commits to securing our borders and providing a pathway to citizenship for qualified immigrants, Title 42 must stay in place.”\nBoth Arizona Senators <span class='selected-term'>Mark Kelly</span> (D) and Kyrsten Sinema (D) have have expressed concerns about ending the order to DHS Secretary Alejandro Mayorkas, and Sen. Maggie Hassan (D-NH) has said that she is concerned about a massive surge at the border.",
    "author": "Becky Noble",
    "title": "GOP States Sue As Biden Adm. Lifts Title 42 Order, Expected To Create Surge Of Illegal Immigrants At Border"
  },
  {
    "id": 8617,
    "mediaId": 2877,
    "date": "2022-04-05",
    "sentence": "From my numerous visits to the southern border and conversations with Arizona’s law enforcement, community leaders, mayors, and non-profits, it’s clear that this administration’s lack of a plan to deal with this crisis will further strain our border communities.” —Senator <span class='selected-term'>Mark Kelly</span>\n“Prematurely ending Title 42 without a comprehensive, workable plan would put at risk the health and safety of Arizona communities and migrants.",
    "author": "Jordan Candler /",
    "title": "Tuesday Short Cuts"
  },
  {
    "id": 8608,
    "mediaId": 2725,
    "date": "2022-04-06",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Arizona) is among others like Democratic Sens.",
    "author": "Murjani Rawls",
    "title": "COVID Bill Hits Impasse As Senate Republicans Block Over Title 42 Amendment"
  },
  {
    "id": 8699,
    "mediaId": 2609,
    "date": "2022-04-07",
    "sentence": "But rather than view it as a public health victory, some moderate Democrats see a huge political liability, leaving them furious that the White House ended policy ahead of a tough midterm election…\nSen. Joe Manchin (D-W.Va.) called it a “frightening decision.” Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) called it “wrong.” And Sen. Maggie Hassan (D-N.H.) said the Biden administration “does not appear to be ready” for the surge in migration that could result.",
    "author": "Mike LaChance",
    "title": "Obama’s DHS Secretary Jeh Johnson Against Ending Title 42, Says Southern Border Not Sustainable"
  },
  {
    "id": 8868,
    "mediaId": 2591,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Human Events Staff",
    "title": "Lawmakers Introduce Bipartisan Bill Requesting Delayed End to Title 42"
  },
  {
    "id": 7968,
    "mediaId": 2573,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Rep. Val Demings backs Biden admin move to end Title 42, says COVID numbers are ‘way down’"
  },
  {
    "id": 8302,
    "mediaId": 2548,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona; Maggie Hassan of New Hampshire; Jon Tester of Montana; and Joe Manchin of West Virginia.",
    "author": "Sebastian Hughes",
    "title": "‘Federal Government’s Failure’: Democrats Join Forces With Republicans To Reverse Biden’s Migrant Decision"
  },
  {
    "id": 6629,
    "mediaId": 2735,
    "date": "2022-04-13",
    "sentence": "Just 19% of Arizona Democratic primary voters have a favorable opinion of Sinema, according to a January Data for Progress poll, compared to 78% for fellow Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz.",
    "author": "Igor Derysh",
    "title": "Kyrsten Sinema Assures Corporate Donors She’ll Protect Their Tax Breaks"
  },
  {
    "id": 6780,
    "mediaId": 6519,
    "date": "2022-04-14",
    "sentence": "Even Democrats such as Senators Maggie Hassan, Jon Tester, Joe Manchin, <span class='selected-term'>Mark Kelly</span>, and Kyrsten Sinema are raising the alarm about the consequences of this move by Biden.",
    "author": "Kilian Laverty",
    "title": "FreedomWorks’ Bill of the Month for April 2022: H.R. 741, the PAUSE Act"
  },
  {
    "id": 4867,
    "mediaId": 2603,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Susan Rinkunas",
    "title": "Ope! Elizabeth Warren Just Took a Little Dig at Nancy Pelosi"
  },
  {
    "id": 4943,
    "mediaId": 6627,
    "date": "2022-04-19",
    "sentence": "I warned them about this months ago,” Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., told Fox News over the weekend.",
    "author": "",
    "title": "DEMS Turn On Biden: We Have A CRISIS Here"
  },
  {
    "id": 5043,
    "mediaId": 4032,
    "date": "2022-04-19",
    "sentence": "",
    "author": "R. Cort Kirkwood",
    "title": "March Border Encounters Surpass 221K. Biden Frees 80K-Plus to Establish Illegal-alien Colonies"
  },
  {
    "id": 5152,
    "mediaId": 2721,
    "date": "2022-04-20",
    "sentence": "However, other signatories include lesser-known Democrats in close fights for re-election, like <span class='selected-term'>Mark Kelly</span> of Arizona and Maggie Hassan of New Hampshire.",
    "author": "",
    "title": "Joe Biden’s immigration dilemma"
  }
]