[
  {
    "id": 3708,
    "mediaId": 8475,
    "date": "2022-01-19",
    "sentence": "U.S. Sen. <span class='selected-term'>Mark Kelly</span> announced Wednesday morning that he would support altering filibuster rules if Republicans block the measures.",
    "author": "Reagan Priest",
    "title": "Arizonans protest at U.S. Capitol as Senate takes up voting rights, Kelly endorses changing filibuster"
  },
  {
    "id": 3718,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "The state now has two Democratic U.S. senators: Sen. Kyrsten Sinema and Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Alex Henderson",
    "title": "‘Culture war’ bills from far-right Arizona Republicans are becoming increasingly ‘extreme’: report"
  },
  {
    "id": 4453,
    "mediaId": 6621,
    "date": "2022-01-26",
    "sentence": "“By contrast, nearly 3 in 4 Democrats polled — 74 percent — said they view Sen. <span class='selected-term'>Mark Kelly</span> (D) favorably, the poll found.",
    "author": "",
    "title": "‘A DEMOCRAT JOHN MCCAIN’: Sinema Polling Better With AZ Republicans Than Democrats"
  },
  {
    "id": 17344,
    "mediaId": 2594,
    "date": "2022-03-03",
    "sentence": "We have a strong field of candidates in Arizona and I will be actively supporting our nominee – and perhaps weighing in before the primary.”\nThe news was a major blow to efforts that state Republicans and national GOP leaders are undertaking to unseat <span class='selected-term'>Mark Kelly</span>, the first-term senator from the state who won a special election to fill the seat of Sen John McCain, a Republican who died in 2018, for the remainder of Mr McCain’s term ending this year.",
    "author": "John Bowden",
    "title": "Ducey, Hogan, Sununu: Why GOP governors who spurned Trump are refusing to run for Senate"
  },
  {
    "id": 12884,
    "mediaId": 2644,
    "date": "2022-03-03",
    "sentence": "Ducey’s decision not to join a crowded Republican primary field leaves state Attorney General Mark Brnovich as the favorite to face incumbent Democrat <span class='selected-term'>Mark Kelly</span> in the November election.",
    "author": "Callie Patteson",
    "title": "Arizona GOP Gov. Ducey won’t run for Senate despite McConnell recruiting pitch"
  },
  {
    "id": 7638,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Can <span class='selected-term'>Mark Kelly</span> run for re-election as a flinty independent in Arizona?",
    "author": "Ed Morrissey",
    "title": "Midterm signals: Kelly looking to break out of Biden's orbit"
  },
  {
    "id": 4729,
    "mediaId": 8284,
    "date": "2022-04-19",
    "sentence": "",
    "author": "",
    "title": "Arizona Senate race nets $61.5 million; Kelly one of top U.S. fundraisers"
  }
]