[
  {
    "id": 3659,
    "mediaId": 8475,
    "date": "2022-01-21",
    "sentence": "This isn’t the first time Ducey’s name has come up as a potential GOP candidate against Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Jeremy Duda",
    "title": "Ducey: I’m still not running for Senate"
  },
  {
    "id": 3419,
    "mediaId": 8350,
    "date": "2022-02-01",
    "sentence": "The poll also showed that more voters said they were likely to choose incumbent Democrat <span class='selected-term'>Mark Kelly</span> over the GOP candidate, whoever it is, 42%-38%.",
    "author": "MARCIA HAMMOND",
    "title": "Poll gives noncandidate Ducey the lead in Arizona GOP Senate race"
  },
  {
    "id": 2936,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "Doug Ducey of Arizona could reshuffle the Arizona Senate race if he changes course and decides to give it a go, according to a new survey of registered voters that pegged him as the best bet to oust Democratic Sen. <span class='selected-term'>Mark Kelly</span> in the 2022 midterm elections.",
    "author": "Seth McLaughlin",
    "title": "Gov. Doug Ducey is GOP’s best bet in Arizona Senate race despite opposition from Trump: Poll"
  },
  {
    "id": 12653,
    "mediaId": 2679,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state’s high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "STEVE PEOPLES",
    "title": "No Senate run for Arizona Gov. Ducey, blow to GOP recruiting"
  },
  {
    "id": 12873,
    "mediaId": 2641,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state's high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "",
    "title": "No Senate Run for Arizona Gov. Ducey, Blow to GOP Recruiting"
  },
  {
    "id": 9182,
    "mediaId": 2641,
    "date": "2022-03-21",
    "sentence": "The Arizona Republican primary to challenge Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., is shaping up to be a close one between a pair of America First candidates surging in two polls released Monday.",
    "author": "Eric Mack",
    "title": "Two Polls Show Close Race Between Masters, Lamon"
  },
  {
    "id": 4688,
    "mediaId": 8408,
    "date": "2022-04-18",
    "sentence": "Brnovich is among several Republican candidates who are vying to unseat Democratic Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "Katya Schwenk",
    "title": "Trump Bashes Brnovich, Will Endorse Other Senate Candidate"
  },
  {
    "id": 5837,
    "mediaId": 8428,
    "date": "2022-04-19",
    "sentence": "The winner of the Republican primaries will face off against incumbent Democrat Sen. <span class='selected-term'>Mark Kelly</span> on Nov. 8.",
    "author": "Alex Caldwell",
    "title": "Trump will not endorse Arizona Attorney General Mark Brnovich for U.S. Senate"
  }
]