[
  {
    "id": 2761,
    "mediaId": 2641,
    "date": "2022-02-03",
    "sentence": "If Masters is able to win the Republican senatorial primary and unseat <span class='selected-term'>Mark Kelly</span>, Arizona can be the stepping stone towards garnering for the America First movement one of its most significant victories of 2022.",
    "author": "Kenny Cody",
    "title": "A Blake Masters Ariz. Win Would Boost America First Movement"
  },
  {
    "id": 9182,
    "mediaId": 2641,
    "date": "2022-03-21",
    "sentence": "The Arizona Republican primary to challenge Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., is shaping up to be a close one between a pair of America First candidates surging in two polls released Monday.",
    "author": "Eric Mack",
    "title": "Two Polls Show Close Race Between Masters, Lamon"
  },
  {
    "id": 5275,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "According to the report from the Beast's Roger Sollenberger, Peter Thiel -- one of Facebook's early investors -- is putting a substantial amount of money behind fellow tech executive Blake Masters who is seeking the seat currently being held by Sen. <span class='selected-term'>Mark Kelly</span> (D).",
    "author": "Tom Boggioni",
    "title": "Pro-Trump Senate candidate using his campaign to promote billionaire backer's businesses: report"
  },
  {
    "id": 6115,
    "mediaId": 2664,
    "date": "2022-04-11",
    "sentence": "He is running against several other Republicans for the nomination to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>, including state Attorney General Mark Brnovich and businessman Jim Lamon.",
    "author": "Matthew Chapman",
    "title": "Pro-Trump Arizona candidate complains Biden's new rules wouldn't let him build his 'very cool' ghost gun"
  },
  {
    "id": 4904,
    "mediaId": 8295,
    "date": "2022-04-18",
    "sentence": "He said the firm’s latest polling shows a generic Republican beating a generic Democrat in three races it is tracking, but that “Kelly is leading against a generic Republican.”\n“Whether you agree with <span class='selected-term'>Mark Kelly</span> or not politically, he has proven to be out-of-this-world in his fundraising prowess, and it’ll be key to his reelection,” Noble said in an email Monday.",
    "author": "Camila Pedrosa",
    "title": "Arizona Senate race nets $61.5 million; Kelly one of top U.S. fundraisers"
  }
]