[
  {
    "id": 3564,
    "mediaId": 2658,
    "date": "2022-01-15",
    "sentence": "But he’s held off on endorsing a Senate candidate to go up against incumbent Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Trump kicks off midterm year still stuck on last election"
  },
  {
    "id": 3565,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "",
    "author": "",
    "title": "The GOP's next big Biden targets"
  },
  {
    "id": 3569,
    "mediaId": 2658,
    "date": "2022-01-19",
    "sentence": "and <span class='selected-term'>Mark Kelly</span> (D-Ariz.), all previously reluctant to chip at the filibuster.",
    "author": "",
    "title": "Why Schumer picked a filibuster fight he couldn't win"
  },
  {
    "id": 3718,
    "mediaId": 2512,
    "date": "2022-01-20",
    "sentence": "The state now has two Democratic U.S. senators: Sen. Kyrsten Sinema and Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Alex Henderson",
    "title": "‘Culture war’ bills from far-right Arizona Republicans are becoming increasingly ‘extreme’: report"
  },
  {
    "id": 3659,
    "mediaId": 8475,
    "date": "2022-01-21",
    "sentence": "This isn’t the first time Ducey’s name has come up as a potential GOP candidate against Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Jeremy Duda",
    "title": "Ducey: I’m still not running for Senate"
  },
  {
    "id": 3639,
    "mediaId": 2520,
    "date": "2022-01-22",
    "sentence": "The liberals' debate over how to respond to Sinema's filibuster stance largely overshadowed the decision by Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., to back a maneuver to weaken the filibuster rule only for the voting rights legislation that he co-sponsored.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Sen. Kyrsten Sinema censured by Arizona Democratic Party executive board over filibuster vote"
  },
  {
    "id": 3602,
    "mediaId": 2590,
    "date": "2022-01-23",
    "sentence": "Georgia Sen. Jon Ossoff, a mainstream liberal, has teamed up with the more moderate Democratic Arizona Sen. <span class='selected-term'>Mark Kelly</span> to write legislation banning corporate PACs and barring members from selling individual stocks.",
    "author": "Kevin Robillard",
    "title": "Joe Biden Still Believes In Washington. He Might Be The Only One."
  },
  {
    "id": 3692,
    "mediaId": 2572,
    "date": "2022-01-25",
    "sentence": "",
    "author": "Paul Steinhauser",
    "title": "Senate GOP re-election arm targets vulnerable 2022 Democrats over giving stimulus checks to prisoners"
  },
  {
    "id": 3590,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "Brnovich is running for the U.S. Senate seat presently held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> and once held by the late Sen. John McCain and, before that, Sen. Barry Goldwater.",
    "author": "Alex Henderson",
    "title": "Arizona's attorney general just got blasted for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 3637,
    "mediaId": 2590,
    "date": "2022-01-26",
    "sentence": "The state’s other Democratic senator, <span class='selected-term'>Mark Kelly</span>, is already fundraising off of his vote for the filibuster change ahead of a reelection campaign this fall.",
    "author": "Travis Waldron",
    "title": "The Death Of Dems' Voting Rights Bill Is A Green Light For GOP State Legislatures"
  },
  {
    "id": 4453,
    "mediaId": 6621,
    "date": "2022-01-26",
    "sentence": "“By contrast, nearly 3 in 4 Democrats polled — 74 percent — said they view Sen. <span class='selected-term'>Mark Kelly</span> (D) favorably, the poll found.",
    "author": "",
    "title": "‘A DEMOCRAT JOHN MCCAIN’: Sinema Polling Better With AZ Republicans Than Democrats"
  },
  {
    "id": 4325,
    "mediaId": 2636,
    "date": "2022-01-27",
    "sentence": "That would be Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "The Man at the Center of Arizona’s Primary"
  },
  {
    "id": 3419,
    "mediaId": 8350,
    "date": "2022-02-01",
    "sentence": "The poll also showed that more voters said they were likely to choose incumbent Democrat <span class='selected-term'>Mark Kelly</span> over the GOP candidate, whoever it is, 42%-38%.",
    "author": "MARCIA HAMMOND",
    "title": "Poll gives noncandidate Ducey the lead in Arizona GOP Senate race"
  },
  {
    "id": 2936,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "Doug Ducey of Arizona could reshuffle the Arizona Senate race if he changes course and decides to give it a go, according to a new survey of registered voters that pegged him as the best bet to oust Democratic Sen. <span class='selected-term'>Mark Kelly</span> in the 2022 midterm elections.",
    "author": "Seth McLaughlin",
    "title": "Gov. Doug Ducey is GOP’s best bet in Arizona Senate race despite opposition from Trump: Poll"
  },
  {
    "id": 2761,
    "mediaId": 2641,
    "date": "2022-02-03",
    "sentence": "If Masters is able to win the Republican senatorial primary and unseat <span class='selected-term'>Mark Kelly</span>, Arizona can be the stepping stone towards garnering for the America First movement one of its most significant victories of 2022.",
    "author": "Kenny Cody",
    "title": "A Blake Masters Ariz. Win Would Boost America First Movement"
  },
  {
    "id": 2274,
    "mediaId": 2644,
    "date": "2022-02-08",
    "sentence": "Brnovich, who is seeking the GOP nomination to challenge US Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) later this year, wrote in the opinion that “only the Governor of the State of Arizona has the power to make a final determination” that the state is under invasion and then “establish the exact parameters for the exercise of the defensive use of force.”\nDucey issued a response to Brnovich that suggested he would not listen to the idea.",
    "author": "Steven Nelson",
    "title": "Arizona AG says state can cite ‘invasion’ to deport migrants without feds"
  },
  {
    "id": 2148,
    "mediaId": 5247,
    "date": "2022-02-08",
    "sentence": "Ducey has aggressively challenged President Joe Biden’s border policies, including in last month’s state of the state address, when he said “the White House and Congress have decided to turn a blind eye” to what he called “a national crisis.”\nBrnovich is among five Republicans competing in August’s primary election for the right to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span> in November.",
    "author": "Bob Christie",
    "title": "Political football? Arizona AG says governor can send armed troops to border."
  },
  {
    "id": 2671,
    "mediaId": 2629,
    "date": "2022-02-09",
    "sentence": "Doug Ducey to mount a challenge against Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "Josh Israel",
    "title": "Another GOP Governor Rejects McConnell Plea To Run For US Senate"
  },
  {
    "id": 2123,
    "mediaId": 8350,
    "date": "2022-02-09",
    "sentence": "",
    "author": "ASSOCIATED PRESS",
    "title": "Sen. Mark Kelly, 2nd Democrat call for gas tax suspension to blunt rising prices"
  },
  {
    "id": 1932,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Elizabeth Elkind",
    "title": "38 Republican lawmakers write to Biden AGAIN to urge him to take a cognitive test: GOP says 'something isn't right' and Americans deserve to have 'absolute confidence' in the President"
  },
  {
    "id": 1921,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Geoff Earle",
    "title": "Trump says Mitch McConnell 'does NOT speak for the Republican party' and the 'majority of its voters' for calling January 6 an 'insurrection' and criticizing the censure of Liz Cheney and Adam Kinzinger"
  },
  {
    "id": 1867,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Katelyn Caralle",
    "title": "Marjorie Taylor Greene's word soup: Republican Rep. compares Capitol cops to the 'Gazpacho' police after colleagues accused officers of illegal raiding their offices during January 6 probe"
  },
  {
    "id": 1845,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "Jim Lamon, a Republican Senate hopeful from the state of Arizona, is showing off a new ad that he says will air during the Super Bowl that features him firing a gun at a likenesses of President Joe Biden, House Speaker Nancy Pelosi, and Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "Brad Reed",
    "title": "Arizona GOP candidate's Super Bowl ad features him firing a gun at likenesses of Biden and Pelosi"
  },
  {
    "id": 1046,
    "mediaId": 2520,
    "date": "2022-02-10",
    "sentence": "Republican Senate candidate Jim Lamon dresses like an Old West lawman in a new ad in which he engages in a gunfight with actors representing President Joe Biden, House Speaker Nancy Pelosi and incumbent Sen. <span class='selected-term'>Mark Kelly</span>, whose wife was gravely injured in a 2011 mass shooting near Tucson that left six dead and a dozen others injured.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Republican Senate candidate Jim Lamon assailed for gunslinging ad against Kelly, Biden, Pelosi"
  },
  {
    "id": 990,
    "mediaId": 2550,
    "date": "2022-02-11",
    "sentence": "Lamon, dressed in a sheriff's costume, shoots the weapons out of the hands of his three masked enemies with Trump-sounding nicknames who are meant to resemble Democratic incumbent <span class='selected-term'>Mark Kelly</span>, President Joe Biden, and Speaker Nancy Pelosi.",
    "author": "",
    "title": "who refuses to accept his own 2020 defeat"
  },
  {
    "id": 974,
    "mediaId": 2550,
    "date": "2022-02-11",
    "sentence": "A GOP Senate candidate who was among the 11 Arizona Republicans who signed a forged electors document has released a violent campaign ad where he shoots at actors representing President Joe Biden, Speaker of the House Nancy Pelosi, and Sen. <span class='selected-term'>Mark Kelly</span>, whose wife—former Rep. Gabby Giffords—survived a brutal assassination attempt in 2011.",
    "author": "",
    "title": "Arizona GOP candidate revels in outrage after releasing vile ad depicting political violence"
  },
  {
    "id": 1175,
    "mediaId": 2590,
    "date": "2022-02-11",
    "sentence": "https://t.co/wbFO0wU76O\n— Fred Guttenberg (@fred_guttenberg) February 10, 2022\nIn which a Republican candidate for Senate play acts shooting a gun at, among others, Senator <span class='selected-term'>Mark Kelly</span>, whose wife, former Congresswoman Gabby Giffords, was gravely injured by gunfire in real life.",
    "author": "Lee Moran",
    "title": "GOP Sen Candidate Shoots At Biden, Pelosi Lookalikes In 'Disgusting' Ad"
  },
  {
    "id": 1334,
    "mediaId": 2512,
    "date": "2022-02-11",
    "sentence": "Jim Lamon, one of the MAGA Republicans competing in Arizona’s 2022 GOP U.S. Senate primary, is drawing criticism for a new campaign ad that depicts him shooting at President Joe Biden, House Speaker Nancy Pelosi and incumbent Sen. <span class='selected-term'>Mark Kelly</span> — who he is hoping to compete with in the general election, and whose wife, Gabby Giffords, survived an attempted murder in 2011.",
    "author": "Alex Henderson",
    "title": "Arizona Republican Senate hopeful slammed as 'disgusting' for violent campaign ad"
  },
  {
    "id": 1141,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "A Republican candidate challenging Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span> released a wild west-themed campaign ad that shows him shooting at President Joe Biden, House Speaker Nancy Pelosi and Kelly himself.",
    "author": "Andrew Trunsky",
    "title": "GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  },
  {
    "id": 1214,
    "mediaId": 2629,
    "date": "2022-02-11",
    "sentence": "In a new campaign ad, Arizona Republican Senate candidate Jim Lamon — appearing as an Old West-style sheriff — shoots at an actor playing his political opponent, incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "Josh Israel",
    "title": "Arizona GOP Candidate Posts Video Threatening To Shoot Democrats"
  },
  {
    "id": 925,
    "mediaId": 2658,
    "date": "2022-02-11",
    "sentence": "And although vulnerable incumbent Senate Democrats such as Catherine Cortez Masto of Nevada and <span class='selected-term'>Mark Kelly</span> of Arizona support banning lawmaker trades, they also say their constituents are far more concerned about the broader economy.",
    "author": "",
    "title": "Dems' latest challenge: Draining the Hill's swamp (at least a little)"
  },
  {
    "id": 1630,
    "mediaId": 2551,
    "date": "2022-02-11",
    "sentence": "+3\nView gallery\nDemocratic Senator <span class='selected-term'>Mark Kelly</span> of Arizona is married to Gabby Giffords, the former congresswoman who was shot in the head at a constituent event in 2011\n+3\nView gallery\nThe ad garnered many critics although Mark Kelly's campaign has not commented but Jim Lamon's Republican primary rivals have\nKelly's campaign has not commented on the ad but Lamon's GOP primary opponents - Blake Masters, a venture capitalist; and Michael 'Mick' McGuire, the retired adjutant general of the Arizona National Guard - criticized it.",
    "author": "Emily Goodin",
    "title": "Republican Senate candidate sparks fury with campaign ad showing him shooting at Biden, Nancy Pelosi and Mark Kelly - whose wife Gabby Giffords was shot in the head in 2011"
  },
  {
    "id": 1772,
    "mediaId": 2557,
    "date": "2022-02-11",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nA Republican candidate challenging Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span> released a wild west-themed campaign ad that shows him shooting at President Joe Biden, House Speaker Nancy Pelosi and Kelly himself.",
    "author": "DML News App",
    "title": "VIDEO: GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  },
  {
    "id": 1500,
    "mediaId": 2618,
    "date": "2022-02-14",
    "sentence": "",
    "author": "Monique Beals",
    "title": "NBC's Michele Tafoya leaving sports to help GOP governor candidate in Minnesota"
  },
  {
    "id": 1784,
    "mediaId": 2547,
    "date": "2022-02-14",
    "sentence": "A recent poll shows the current GOP front-runner in that race, Attorney General Mark Brnovich, within two points of the incumbent <span class='selected-term'>Mark Kelly</span>, while Ducey is within three points.",
    "author": "Steve M.",
    "title": "Is There Any Such Thing As An Unelectable Republican Now?"
  },
  {
    "id": 937,
    "mediaId": 2746,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Haris Alic",
    "title": "Sen. Manchin balks at vulnerable Democrats’ push to suspend federal gasoline tax"
  },
  {
    "id": 944,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Several Republicans already are vying to run against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., in the key battleground state.",
    "author": "Charlie McCarthy",
    "title": "Trump: 'RINO' Gov. Ducey Wouldn't Win GOP Senatorial Primary"
  },
  {
    "id": 1407,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "On Tuesday, Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) had to leave town because his wife, former Rep. Gabby Gifford, had to be hospitalized with appendicitis.",
    "author": "",
    "title": "There can be no bipartisanship in the face of the latest from Senate Republicans"
  },
  {
    "id": 905,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "Tricky math: Sen. Ben Ray Luján (D-N.M.) is still out following his stroke and Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) rushed home this week as his wife, former Rep. Gabrielle Giffords, was hospitalized for appendicitis.",
    "author": "CR stars",
    "title": "CR stars in pre-recess rerun"
  },
  {
    "id": 910,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "Maggie Hassan (D-N.H.) and <span class='selected-term'>Mark Kelly</span> (D-Ariz.), two of the Democratic caucus’ most vulnerable senators, has long odds for passage.",
    "author": "",
    "title": "Ballard to fundraise for potential Ways and Means chair"
  },
  {
    "id": 916,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "The GOP’s chances of flipping the seat held by Democratic Sen. <span class='selected-term'>Mark Kelly</span> — a key contest in the party’s fight for the Senate majority — are viewed by many in both parties as even better with Ducey, who has been elected statewide three times, than the current cast of MAGA Republicans in the race.",
    "author": "",
    "title": "Ducey looms as last big question on 2022 Senate map"
  },
  {
    "id": 29,
    "mediaId": 2550,
    "date": "2022-02-24",
    "sentence": "AZ-Sen: In his first TV ad of the cycle, Democratic incumbent <span class='selected-term'>Mark Kelly</span> tells the audience about his family's financial struggles when he was growing up and declares, \"I know that Arizona families are working hard to get by right now, and that's why I won't give up on getting our economy back on track and lowering every day costs.\"",
    "author": "",
    "title": "Morning Digest: Pennsylvania's top court picks new House map, making one Republican walk the plank"
  },
  {
    "id": 17279,
    "mediaId": 2573,
    "date": "2022-03-01",
    "sentence": "",
    "author": "Tyler O'Neil",
    "title": "Senate votes to block Democrat bill enshrining abortion as Supreme Court reconsiders Roe v. Wade"
  },
  {
    "id": 12808,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Beto O’Rourke snags the Democratic nomination for Texas governor."
  },
  {
    "id": 12674,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "A local candidate wants to transcend party. Does Texas allow that?"
  },
  {
    "id": 12787,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Harris County, home to Houston, warns of delays in counting ballots."
  },
  {
    "id": 12804,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Gov. Greg Abbott wins the G.O.P. nomination, defeating challengers from the right."
  },
  {
    "id": 12653,
    "mediaId": 2679,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state’s high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "STEVE PEOPLES",
    "title": "No Senate run for Arizona Gov. Ducey, blow to GOP recruiting"
  },
  {
    "id": 12544,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "While I’m disappointed he decided not to run, Arizona will be an important part of our plan to win the majority back.”\nChris Hartline, a spokesperson for the NRSC, said Republicans “have great candidates running in Arizona, one of whom will beat <span class='selected-term'>Mark Kelly</span> in November.”\nDucey’s decision to bypass the race removes a potential obstacle for the other Republican candidates, including state Attorney General Mark Brnovich; Blake Masters, a venture capitalist; and Jim Lamon, an energy executive self-funding his campaign.",
    "author": "",
    "title": "Ducey won't run for Senate in Arizona"
  },
  {
    "id": 12806,
    "mediaId": 2636,
    "date": "2022-03-03",
    "sentence": "For months, he had told both reporters pressing him and Republicans courting him that he had little appetite to challenge Senator <span class='selected-term'>Mark Kelly</span>, a first-term Democrat.",
    "author": "",
    "title": "Ducey Confirms He Will Not Run for Senate, Despite McConnell’s Wooing"
  },
  {
    "id": 12873,
    "mediaId": 2641,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state's high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "",
    "title": "No Senate Run for Arizona Gov. Ducey, Blow to GOP Recruiting"
  },
  {
    "id": 12884,
    "mediaId": 2644,
    "date": "2022-03-03",
    "sentence": "Ducey’s decision not to join a crowded Republican primary field leaves state Attorney General Mark Brnovich as the favorite to face incumbent Democrat <span class='selected-term'>Mark Kelly</span> in the November election.",
    "author": "Callie Patteson",
    "title": "Arizona GOP Gov. Ducey won’t run for Senate despite McConnell recruiting pitch"
  },
  {
    "id": 13161,
    "mediaId": 2540,
    "date": "2022-03-03",
    "sentence": "Doug Ducey announced Thursday he would not be a candidate for US Senate in 2022, ending speculation about whether he would reconsider his previous stance against seeking the party's nomination to challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "Kyung Lah, Jeff Zeleny and Rachel Janfaza",
    "title": "Arizona Gov. Doug Ducey rules out US Senate bid and says he may endorse in GOP primary"
  },
  {
    "id": 12969,
    "mediaId": 2605,
    "date": "2022-03-03",
    "sentence": "“Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic Senators like <span class='selected-term'>Mark Kelly</span>,” Democratic Senatorial Campaign Committee spokesman Patrick Burgwinkle said in a statement.",
    "author": "Melanie MasonStaff Writer",
    "title": "Arizona Gov. Doug Ducey opts out of Senate run — a setback for GOP hopes"
  },
  {
    "id": 17002,
    "mediaId": 2590,
    "date": "2022-03-03",
    "sentence": "“Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic senators like [Arizona’s] <span class='selected-term'>Mark Kelly</span>,” said Democratic Senatorial Campaign Committee spokesperson Patrick Burgwinkle in a press release drawing attention to Republicans’ faltering track record on recruitment.",
    "author": "Igor Bobic",
    "title": "GOP Senate Recruitment Efforts Continue To Fizzle"
  },
  {
    "id": 12738,
    "mediaId": 2550,
    "date": "2022-03-03",
    "sentence": "AZ-Sen: Wealthy businessman Jim Lamon's new spot for the August Republican primary rhetorically asks how Democratic incumbent <span class='selected-term'>Mark Kelly</span>, who has only been in office since December of 2020, can run \"to solve the problems you've created?\"",
    "author": "",
    "title": "Morning Digest: A day after being forced into surprise runoff, Texas congressman quits amid scandal"
  },
  {
    "id": 17308,
    "mediaId": 8475,
    "date": "2022-03-03",
    "sentence": "Once again, Senate Republicans’ recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic senators like <span class='selected-term'>Mark Kelly</span>,\" said the Democratic Senatorial Campaign Committee.",
    "author": "Dylan Smith",
    "title": "Ducey firmly disavows Senate run: 'I'm an executive'"
  },
  {
    "id": 17344,
    "mediaId": 2594,
    "date": "2022-03-03",
    "sentence": "We have a strong field of candidates in Arizona and I will be actively supporting our nominee – and perhaps weighing in before the primary.”\nThe news was a major blow to efforts that state Republicans and national GOP leaders are undertaking to unseat <span class='selected-term'>Mark Kelly</span>, the first-term senator from the state who won a special election to fill the seat of Sen John McCain, a Republican who died in 2018, for the remainder of Mr McCain’s term ending this year.",
    "author": "John Bowden",
    "title": "Ducey, Hogan, Sununu: Why GOP governors who spurned Trump are refusing to run for Senate"
  },
  {
    "id": 17027,
    "mediaId": 2641,
    "date": "2022-03-03",
    "sentence": "The Arizona Republic reports that Ducey's announcement ends the effort by local and national GOP leaders and affluent donors to recruit him for the race against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., whose reelection could determine control of the evenly split upper chamber.",
    "author": "Nicole Wells",
    "title": "Arizona Gov. Doug Ducey Will Not Run for US Senate in 2022"
  },
  {
    "id": 17042,
    "mediaId": 8345,
    "date": "2022-03-03",
    "sentence": "Doug Ducey has notified Senate Republican leader Mitch McConnell that he will not enter his state's high-profile Senate contest, a disappointing development for establishment Republicans who saw Ducey as their best hope to defeat Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "",
    "title": "No Senate run for Arizona Gov. Ducey, blow to GOP recruiting"
  },
  {
    "id": 17129,
    "mediaId": 2520,
    "date": "2022-03-03",
    "sentence": "Ducey’s announcement to some of his closest financial allies ends the long-running effort by national and local Republican leaders and deep-pocketed donors to recruit him for the race against Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., whose reelection could decide which party controls the evenly divided chamber.",
    "author": "Stacey Barchenger",
    "title": "'I have the job I want': Arizona Gov. Doug Ducey will not run for the US Senate in 2022"
  },
  {
    "id": 17160,
    "mediaId": 2746,
    "date": "2022-03-03",
    "sentence": "The five non-voting senators were two Republicans — James Inhofe of Oklahoma and Richard Burr of North Carolina — and three Democrats — Alex Padilla and Dianne Feinstein of California and <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Kerry Picket",
    "title": "Senate passes resolution to end federal COVID state of emergency"
  },
  {
    "id": 17201,
    "mediaId": 2746,
    "date": "2022-03-04",
    "sentence": "Doug Ducey confirmed he will not challenge vulnerable Democratic Sen. <span class='selected-term'>Mark Kelly</span> in November.",
    "author": "Susan Ferrechio",
    "title": "Senate recruiting becomes proxy war in Trump-McConnell feud"
  },
  {
    "id": 17820,
    "mediaId": 2629,
    "date": "2022-03-04",
    "sentence": "The Democratic Senatorial Campaign Committee released a statement Thursday noting the trend:\nOnce again, Senate Republicans' recruitment efforts have failed, and their top potential candidates are refusing to run against strong Democratic Senators like <span class='selected-term'>Mark Kelly</span>.",
    "author": "Josh Israel",
    "title": "Mitch McConnell Finds More Rejection In Search For GOP Senate Candidate"
  },
  {
    "id": 15633,
    "mediaId": 8416,
    "date": "2022-03-06",
    "sentence": "Attorney General Mark Brnovich is seeking the Republican nomination for the US Senate to challenge incumbent Democrat and Biden supporter, <span class='selected-term'>Mark Kelly</span>.",
    "author": "David Stringer",
    "title": "Yavapai Republican Men’s Forum – Meet Your 2022 Candidates"
  },
  {
    "id": 13019,
    "mediaId": 2569,
    "date": "2022-03-07",
    "sentence": "Herschel Walker\nMarco Rubio\n<span class='selected-term'>Mark Kelly</span>\nMitch McConnell\nNRSC\nRaphael Warnock\nRick Scott\nVal Dmeings\nAs the prospect of a red wave grows, a series of Republican missteps including recruiting stumbles, weak fundraising and intense infighting is threatening the GOP’s path to the Senate majority.",
    "author": "Associated Press",
    "title": "Republican ‘unforced errors’ threaten path to U.S. Senate control"
  },
  {
    "id": 12767,
    "mediaId": 2679,
    "date": "2022-03-07",
    "sentence": "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "BRIAN SLODYSKO",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 12730,
    "mediaId": 2732,
    "date": "2022-03-07",
    "sentence": "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "Associated Press",
    "title": "Republican 'unforced errors' threaten path to Senate control"
  },
  {
    "id": 15209,
    "mediaId": 2746,
    "date": "2022-03-08",
    "sentence": "Georgia Sen. Raphael Warnock and Arizona Sen. <span class='selected-term'>Mark Kelly</span> pressed the Democrats’ financial advantage by launching an initial round of television ads in recent weeks, while New Hampshire Democratic Sen. Maggie Hassan placed $13 million in initial TV and radio advertising reservations.",
    "author": "",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 10807,
    "mediaId": 2607,
    "date": "2022-03-08",
    "sentence": "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. <span class='selected-term'>Mark Kelly</span> this fall.",
    "author": "Steve Peoples",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 11050,
    "mediaId": 2573,
    "date": "2022-03-08",
    "sentence": "Others, like Democratic senators Maggie Hassan of New Hampshire and <span class='selected-term'>Mark Kelly</span> of Arizona, who are facing tough reelection races in their states, have called for temporarily eliminating the federal gas tax.",
    "author": "Jessica Chasmar",
    "title": "Gas prices fueling coming Democratic bloodbath in midterms, Republicans say"
  },
  {
    "id": 15519,
    "mediaId": 2553,
    "date": "2022-03-10",
    "sentence": "To that end, from now until November, the SBA List is launching campaigns across the country to “expose the extremism of vulnerable pro-abortion Senators.”\nThe pro-life organization boasts of a massive $72 million 2022 election cycle budget — and it is zeroing in on Sen. <span class='selected-term'>Mark Kelly</span>, targeting the Arizona Democrat with a $1 million ad campaign highlighting Kelly’s abortion stances.",
    "author": "Mary Margaret Olohan",
    "title": "Abortion Is The Crux Of 2022 Elections, Major Pro-Life Group Predicts — And They’re Marshaling All Forces To Win That Battle"
  },
  {
    "id": 11087,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "Brnovich has been criticized for leading the investigation into fraud by Trump supporters while seeking the former president's endorsement in his 2022 midterm challenge of Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ)/\nIn January, MSNBC's Rachel Maddow laid out a damning timeline of events:\nWatch:",
    "author": "Bob Brigham",
    "title": "GOP attorney general investigated Trump’s phony electors — but no charges have been filed: report"
  },
  {
    "id": 13443,
    "mediaId": 2540,
    "date": "2022-03-15",
    "sentence": "The Democrats who voted to rid of the mask mandate are: the senators from Nevada, Jacky Rosen and Catherine Cortez Masto; the senators from Arizona, <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema; Michael Bennet of Colorado, Joe Manchin of West Virginia, Maggie Hassan of New Hampshire and Jon Tester of Montana.",
    "author": "Ali Zaslav",
    "title": "Senate votes to repeal travel mask mandates in bipartisan rebuke of Biden administration policy"
  },
  {
    "id": 11784,
    "mediaId": 2621,
    "date": "2022-03-21",
    "sentence": "Catherine Cortez-Masto (D-NV); Michael Bennet (D-CO); <span class='selected-term'>Mark Kelly</span> (D-AZ); Maggie Hassan (D-NH); Joe Manchin (D-WV); Kyrsten Sinema (D-AZ); Jon Tester (D-MT) and Jacky Rosen (D-NV).",
    "author": "Kipp Jones",
    "title": "Multiple Democratic Lawmakers Pivot on Mandates Before Midterms: ‘I’m Completely Over Mask Mandates’"
  },
  {
    "id": 9630,
    "mediaId": 2695,
    "date": "2022-03-22",
    "sentence": "Brnovich is a candidate for U.S. Senate running in the GOP primary to challenge Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.).",
    "author": "Chris Pandolfo",
    "title": "Arizona Republicans advance election bill to end mail-in voting — but it's likely dead on arrival"
  },
  {
    "id": 11605,
    "mediaId": 2641,
    "date": "2022-03-25",
    "sentence": "The Journal said the southern half of McCormick Ranch largely is comprised of middle-class and upper-middle-class families, and retirees on fixed incomes vulnerable to inflation — voters both major parties will eye as they battle for an open governor’s seat and a U.S. Senate seat currently held by Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz.",
    "author": "Charlie McCarthy",
    "title": "Inflation Expected to Be Key Midterm Issue in Battleground States"
  },
  {
    "id": 11665,
    "mediaId": 2745,
    "date": "2022-03-25",
    "sentence": "",
    "author": "",
    "title": "How senators voted on Ketanji Brown Jackson for the Supreme Court"
  },
  {
    "id": 9407,
    "mediaId": 2526,
    "date": "2022-03-26",
    "sentence": "Vulnerable Democrat Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) trails a generic Republican in Arizona’s Senate race, according to a poll from OHPredictive Insights released this past week.",
    "author": "Jacob Bliss",
    "title": "Poll: Democrat Mark Kelly Trails Generic Republican in AZ Senate Race"
  },
  {
    "id": 12232,
    "mediaId": 2526,
    "date": "2022-03-27",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "John Binder",
    "title": "Senate GOP Moderates Silent on Ketanji Brown Jackson’s Trustee Role at Woke, Pro-Critical Race Theory School"
  },
  {
    "id": 11604,
    "mediaId": 2573,
    "date": "2022-03-29",
    "sentence": "Catherine Cortez-Masto, D-Nev., and <span class='selected-term'>Mark Kelly</span>.",
    "author": "Tyler Olson",
    "title": "GOP to use Jackson hearing to spotlight social issues in midterms: 'Literally can't say what a woman is'"
  },
  {
    "id": 9804,
    "mediaId": 2572,
    "date": "2022-03-29",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona wrote to Biden in a letter.",
    "author": "",
    "title": "GOP introduces border strategy bill as WH poised to end Trump border policy"
  },
  {
    "id": 9797,
    "mediaId": 2572,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "House Freedom Caucus calls on House Dems to back vote on keeping Title 42 in place at border"
  },
  {
    "id": 10648,
    "mediaId": 6512,
    "date": "2022-03-30",
    "sentence": "Arizona Democrats - Senators Kirsten Sinema and <span class='selected-term'>Mark Kelly</span> - also made the same plea to the administration.",
    "author": "Joshua Summers",
    "title": "Joe Biden's Administration to End Title 42 Expulsion by May; Republicans Push Back"
  },
  {
    "id": 9941,
    "mediaId": 2658,
    "date": "2022-03-30",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> and West Virginia Sen. Joe Manchin eventually joined Republicans to vote against proceeding with the nomination.",
    "author": "",
    "title": "Moderate Dems hand Biden his first nomination vote defeat"
  },
  {
    "id": 10005,
    "mediaId": 2526,
    "date": "2022-03-31",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) and Sen. Richard Blumenthal (D-CT) join the growing list of Democrats to show concern over Los Angeles Mayor Eric Garcetti’s nomination to serve as U.S. ambassador to India.",
    "author": "Jacob Bliss",
    "title": "Multiple Democrats Show Concern over Eric Garcetti’s Nomination as Ambassador to India"
  },
  {
    "id": 10030,
    "mediaId": 2551,
    "date": "2022-04-01",
    "sentence": "Moderate Democratic Senator Kyrsten Sinema said Wednesday that she and fellow Arizona Senator <span class='selected-term'>Mark Kelly</span> spoke with the Department of Homeland Security (DHS) about not ending Title 42 until there are other safeguards in place at the border.",
    "author": "",
    "title": "Biden administration pledges to deport migrants caught illegally crossing the US border 'IMMEDIATELY' as both Democrats and Republican warn of a 'mass migrant event' when Title 42 is lifted in May"
  },
  {
    "id": 10476,
    "mediaId": 2600,
    "date": "2022-04-01",
    "sentence": "Three Democrats—Joe Manchin, Kyrsten Sinema, and <span class='selected-term'>Mark Kelly</span>—opposed the union favorite on the Senate floor,” WSJ reported.",
    "author": "IWB",
    "title": "Three Dem Senators Flip Sides — Join Republicans To Block Biden"
  },
  {
    "id": 9799,
    "mediaId": 8322,
    "date": "2022-04-01",
    "sentence": "\"Senate Democrats like <span class='selected-term'>Mark Kelly</span> created this border crisis and have consistently voted against measures to secure the border,\" National Republican Senatorial Committee (NRSC) spokeswoman Katharine Cooksey claimed in a statement to Fox News.",
    "author": "Paul Steinhauser",
    "title": "Biden immigration decision could make midterm climate even tougher for Democrats"
  },
  {
    "id": 9870,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "In Arizona, Sen. <span class='selected-term'>Mark Kelly</span> is up for reelection.",
    "author": "Stephen Dinan",
    "title": "Romney predicts GOP election wins due to Biden’s embrace of border chaos"
  },
  {
    "id": 9997,
    "mediaId": 2641,
    "date": "2022-04-04",
    "sentence": "Joe Manchin of West Virginia, and the Arizona senators, <span class='selected-term'>Mark Kelly</span>, who is up for reelection, and Kyrsten Sinema, are opposed to the White House's decision to end Title 42, especially without having a contingent plan to deal with the pressing border crisis.",
    "author": "Peter Malbin",
    "title": "Ending Title 42 Expulsions a 'Disaster Politically' for Democrats: Republican Strategist"
  },
  {
    "id": 7282,
    "mediaId": 8484,
    "date": "2022-04-04",
    "sentence": "Moderate Democratic Senator Kyrsten Sinema said that she and fellow Arizona Senator <span class='selected-term'>Mark Kelly</span>, also a Democrat, spoke with DHS about not ending Title 42 until there are other safeguards in place at the border.",
    "author": "Emily Goodin",
    "title": "Three Republican states SUE the Biden administration to stop lifting Title 42 with growing fears there will be chaos and a huge migrant influx at the southern border in May"
  },
  {
    "id": 7223,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Democrats from Arizona, and Sen. Joe Manchin, a Democrat from West Virginia, also wrote letters last week expressing similar concerns.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 7811,
    "mediaId": 2724,
    "date": "2022-04-04",
    "sentence": "Until we have comprehensive, bipartisan immigration reform that commits to securing our borders and providing a pathway to citizenship for qualified immigrants, Title 42 must stay in place.”\nBoth Arizona Senators <span class='selected-term'>Mark Kelly</span> (D) and Kyrsten Sinema (D) have have expressed concerns about ending the order to DHS Secretary Alejandro Mayorkas, and Sen. Maggie Hassan (D-NH) has said that she is concerned about a massive surge at the border.",
    "author": "Becky Noble",
    "title": "GOP States Sue As Biden Adm. Lifts Title 42 Order, Expected To Create Surge Of Illegal Immigrants At Border"
  },
  {
    "id": 7933,
    "mediaId": 6511,
    "date": "2022-04-04",
    "sentence": "La queja republicana incluso cita a senadores demócratas de Arizona, <span class='selected-term'>Mark Kelly</span> y Kirsten Sinema, que consideran que la Administración Biden terminará el programa “sin estar lista”.",
    "author": "",
    "title": "Tres estados republicanos piden a juez bloquear decisión de Biden para terminar el Título 42 contra inmigrantes"
  },
  {
    "id": 7410,
    "mediaId": 2548,
    "date": "2022-04-04",
    "sentence": "",
    "author": "Nicole Silverio",
    "title": "‘This Is Intentional’: Rep. Jim Jordan Rips Biden Administration’s Handling Of Southern Border, COVID-19"
  },
  {
    "id": 8071,
    "mediaId": 2658,
    "date": "2022-04-05",
    "sentence": "Joe Manchin of West Virginia, <span class='selected-term'>Mark Kelly</span> of Arizona, Kyrsten Sinema of Arizona, Catherine Cortez Masto of Nevada and Raphael Warnock of Georgia.",
    "author": "",
    "title": "Covid deal hampered by GOP opposition to Biden immigration policy"
  },
  {
    "id": 7979,
    "mediaId": 2573,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> have both written to and spoke with Mayorkas to express their concerns about it being lifted without proper planning.",
    "author": "Adam Shaw",
    "title": "Sen. Tester becomes latest Democrat to oppose Biden move to end Title 42"
  },
  {
    "id": 7991,
    "mediaId": 2572,
    "date": "2022-04-06",
    "sentence": "",
    "author": "",
    "title": "Hawley grills Biden admin on migrant surge, whether DHS plans to give phones to illegal immigrants"
  },
  {
    "id": 7638,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Can <span class='selected-term'>Mark Kelly</span> run for re-election as a flinty independent in Arizona?",
    "author": "Ed Morrissey",
    "title": "Midterm signals: Kelly looking to break out of Biden's orbit"
  },
  {
    "id": 7549,
    "mediaId": 2679,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump’s endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 7680,
    "mediaId": 2680,
    "date": "2022-04-06",
    "sentence": "Brnovich is courting Trump's endorsement for his Senate run, which would give him a significant boost in a field with no clear Republican frontrunner to take on Democratic Sen. <span class='selected-term'>Mark Kelly</span>.",
    "author": "JONATHAN J. COOPER and BOB CHRISTIE",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 8824,
    "mediaId": 2735,
    "date": "2022-04-06",
    "sentence": "Joe Manchin (D-W.Va.), <span class='selected-term'>Mark Kelly</span> (D-Ariz.), and Catherine Cortez Masto (D-Nev.).",
    "author": "Jake Johnson",
    "title": "GOP Threatens to Hold COVID Funding Hostage to Preserve Trump Immigration Policy"
  },
  {
    "id": 8608,
    "mediaId": 2725,
    "date": "2022-04-06",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Arizona) is among others like Democratic Sens.",
    "author": "Murjani Rawls",
    "title": "COVID Bill Hits Impasse As Senate Republicans Block Over Title 42 Amendment"
  },
  {
    "id": 8668,
    "mediaId": 2790,
    "date": "2022-04-06",
    "sentence": "Some Democrats question wisdom of terminating order\nSeveral Senate Democrats — including <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema of Arizona, Joe Manchin of West Virginia, and Maggie Hassan of New Hampshire — have questioned the wisdom of terminating the Title 42 order.",
    "author": "Susan Davis",
    "title": "Clash over immigration policy derails Senate COVID aid bill"
  },
  {
    "id": 7616,
    "mediaId": 6449,
    "date": "2022-04-07",
    "sentence": "And quite frankly, politically, this is going to be a hard year for U.S. Sen. <span class='selected-term'>Mark Kelly</span>, between the inflation that’s going on in Arizona and the border crisis that’s going on in Arizona’s border and across the nation.",
    "author": "Douglas Blair",
    "title": "Rep. Debbie Lesko Reveals GOP Plan to Lower Gas Prices"
  },
  {
    "id": 7968,
    "mediaId": 2573,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Rep. Val Demings backs Biden admin move to end Title 42, says COVID numbers are ‘way down’"
  },
  {
    "id": 8302,
    "mediaId": 2548,
    "date": "2022-04-07",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona; Maggie Hassan of New Hampshire; Jon Tester of Montana; and Joe Manchin of West Virginia.",
    "author": "Sebastian Hughes",
    "title": "‘Federal Government’s Failure’: Democrats Join Forces With Republicans To Reverse Biden’s Migrant Decision"
  },
  {
    "id": 7336,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "“Because of <span class='selected-term'>Mark Kelly</span>, Arizona families are facing the highest rate of inflation in the nation, record-high gas prices, and an ever-worsening crisis along the Southern Border.”\n“It would be easier to believe Kelly actually cared about helping struggling Arizona families if his voting record didn’t reveal the exact opposite,” she said.",
    "author": "Seth McLaughlin",
    "title": "Eyeing reelection, Sen. Mark Kelly drifts away from Biden"
  },
  {
    "id": 8559,
    "mediaId": 2890,
    "date": "2022-04-08",
    "sentence": "That didn’t stop five Democratic senators — Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona, Joe Manchin of West Virginia, Raphael Warnock of Georgia, and Maggie Hassan of New Hampshire — from joining Republicans in introducing a bill Thursday that would preserve the policy until 60 days after the surgeon general announces the end of the public health emergency related to Covid-19.",
    "author": "Nicole Narea",
    "title": "The Democratic revolt over Biden’s border policy"
  },
  {
    "id": 7070,
    "mediaId": 2572,
    "date": "2022-04-09",
    "sentence": "",
    "author": "Marisa Schultz",
    "title": "Dem Rep. Cuellar joins bipartisan effort to block Biden's rollback of Title 42, opposes bussing migrants to DC"
  },
  {
    "id": 8041,
    "mediaId": 2643,
    "date": "2022-04-09",
    "sentence": "Meanwhile, Senators Krysten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona, Maggie Hassan of New Hampshire, Joe Manchin of West Virginia and Jon Tester of Montana have signed onto similar legislation in Congress' upper chamber.",
    "author": "Andrew Stanton",
    "title": "Henry Cuellar Becomes Sixth House Democrat to Oppose Biden Lifting Title 42"
  },
  {
    "id": 6997,
    "mediaId": 8484,
    "date": "2022-04-10",
    "sentence": "The Democratic senators on board with the upper chamber bill to keep Title 42 as long as the health emergency remains are moderates Krysten Sinema of Arizona and Joe Manchin of West Virginia as well as <span class='selected-term'>Mark Kelly</span> of Arizona, Maggie Hassan of New Hampshire and Jon Tester of Montana.",
    "author": "Katelyn Caralle",
    "title": "Now 11 DEMOCRATS oppose Biden ending Title 42: Texas Rep. Henry Cuellar is the latest to join bipartisan legislation to KEEP the pandemic-era policy at the border"
  },
  {
    "id": 5275,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "According to the report from the Beast's Roger Sollenberger, Peter Thiel -- one of Facebook's early investors -- is putting a substantial amount of money behind fellow tech executive Blake Masters who is seeking the seat currently being held by Sen. <span class='selected-term'>Mark Kelly</span> (D).",
    "author": "Tom Boggioni",
    "title": "Pro-Trump Senate candidate using his campaign to promote billionaire backer's businesses: report"
  },
  {
    "id": 5483,
    "mediaId": 2650,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Stephen Kruiser",
    "title": "The Morning Briefing: Do Republicans Have a Legit Shot at the Senate in November?"
  },
  {
    "id": 5691,
    "mediaId": 2574,
    "date": "2022-04-11",
    "sentence": "The candidates are vying for a chance to run against incumbent Democratic senator <span class='selected-term'>Mark Kelly</span>, who is viewed as one of the most vulnerable candidates in the election cycle.",
    "author": "Washington Free Beacon Staff",
    "title": "Poll: Lamon Leads in Arizona’s GOP Senate Primary"
  },
  {
    "id": 6592,
    "mediaId": 2589,
    "date": "2022-04-11",
    "sentence": "Specifically, Sen. <span class='selected-term'>Mark Kelly</span> in Arizona, Sen. Raphael Warnock in Georgia, Sen. Maggie Hassan in New Hampshire and Sen. Catherine Cortez-Masto in Nevada.",
    "author": "John Sexton",
    "title": "Democrats are heading for disaster in the Senate"
  },
  {
    "id": 7038,
    "mediaId": 2688,
    "date": "2022-04-12",
    "sentence": "Doug Ducey (R) announced in a letter to donors that he wouldn’t launch a bid against incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ).",
    "author": "John Judis",
    "title": "Where Things Stand: McConnell Warns ‘Unacceptable’ GOP Candidates Could Spoil The Fun For Everyone"
  },
  {
    "id": 6670,
    "mediaId": 2550,
    "date": "2022-04-12",
    "sentence": "While President Biden’s decision to end Stephen Miller’s debunked policy that has for more than two years used the pandemic as an excuse to stomp on U.S. asylum law is a just and moral decision, two Senate Democrats who are up for reelection, <span class='selected-term'>Mark Kelly</span> and Maggie Hassan, are among those who have joined a group of Senate Republicans to delay the president’s action.",
    "author": "",
    "title": "Kansas' Democratic governor signs"
  },
  {
    "id": 6871,
    "mediaId": 6404,
    "date": "2022-04-12",
    "sentence": "Specifically, Sen. <span class='selected-term'>Mark Kelly</span> in Arizona, Sen. Raphael Warnock in Georgia, Sen. Maggie Hassan in New Hampshire and Sen. Catherine Cortez-Masto in Nevada…\nTrending: Steve Hilton: The Idea Of A Second Term For Joe Biden Is Absurd And Offensive (VIDEO)\nSo Democrats are likely to lose 3-4 Senate seats this year and that’s just the start of their troubles.",
    "author": "Mike LaChance",
    "title": "It’s Starting To Look Like Democrats Are Going To Lose The Senate This Year"
  },
  {
    "id": 5931,
    "mediaId": 2695,
    "date": "2022-04-13",
    "sentence": "Arizona Democrat Senator <span class='selected-term'>Mark Kelly</span> took office in December 2020 following a special election victory in November 2020.",
    "author": "BlazeTV Staff",
    "title": "NPR predicts these 10 Senate seats might see a party FLIP"
  },
  {
    "id": 5821,
    "mediaId": 2550,
    "date": "2022-04-14",
    "sentence": "AZ-Sen: Wealthy businessman Jim Lamon, who ran a commercial earlier this year that depicted him firing a gun at Democratic Sen. <span class='selected-term'>Mark Kelly</span>, is now embracing Easter hope and optimism in his new ad for the August GOP primary.",
    "author": "",
    "title": "Morning Digest: The ugliest GOP primary might just be in Alabama's race for governor"
  },
  {
    "id": 5515,
    "mediaId": 3993,
    "date": "2022-04-15",
    "sentence": "There’s a pretty crowded field of Republican candidates vying to unseat first-term senator and gun control activist <span class='selected-term'>Mark Kelly</span> from his seat in Arizona later this year, but to the best of my knowledge only one of them has proudly talked about building his own guns.",
    "author": "Cam Edwards",
    "title": "AZ Senate candidate: gun control is dead"
  },
  {
    "id": 5540,
    "mediaId": 2658,
    "date": "2022-04-16",
    "sentence": "",
    "author": "",
    "title": "GOP megadonors go big in battle for Congress: 5 takeaways from new campaign money filings"
  },
  {
    "id": 6176,
    "mediaId": 2658,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), facing a tough reelection battle this November, said he’s “continuing to evaluate her record” after a similar meeting.",
    "author": "",
    "title": "Midterm politicking comes for Biden’s stalled tech nominee"
  },
  {
    "id": 4953,
    "mediaId": 2589,
    "date": "2022-04-18",
    "sentence": "",
    "author": "Ed Morrissey",
    "title": "How will McConnell survive as Senate GOP leader? Here are 141 million reasons ..."
  },
  {
    "id": 4688,
    "mediaId": 8408,
    "date": "2022-04-18",
    "sentence": "Brnovich is among several Republican candidates who are vying to unseat Democratic Senator <span class='selected-term'>Mark Kelly</span>.",
    "author": "Katya Schwenk",
    "title": "Trump Bashes Brnovich, Will Endorse Other Senate Candidate"
  },
  {
    "id": 4848,
    "mediaId": 2550,
    "date": "2022-04-19",
    "sentence": "And if fundraising is any measure, Senate Democrats have a fighting chance in November, with their four most vulnerable senators—Raphael Warnock in Georgia, <span class='selected-term'>Mark Kelly</span> of Arizona, Catherine Cortez Masto of Nevada, and Maggie Hassan of New Hampshire—all surpassing the hauls of their leading GOP challengers.",
    "author": "",
    "title": "Midterms will be a heavy lift for the Senate GOP. One super PAC is already shelling out $141 million"
  },
  {
    "id": 5108,
    "mediaId": 2664,
    "date": "2022-04-20",
    "sentence": "A Republican candidate looking to replace Arizona Democratic Sen. <span class='selected-term'>Mark Kelly</span> is getting some blowback for a campaign ad, making it the third time this year his public messaging struck a sour note, according to the Phoenix New Times' Elias Weiss.",
    "author": "Sky Palma",
    "title": "GOP candidate released a dramatic 'savior' ad – and it might be blowing up in his face: report"
  },
  {
    "id": 5610,
    "mediaId": 2629,
    "date": "2022-04-20",
    "sentence": "Democrats are protecting three incumbents in Georgia (Sen. Raphael Warnock), Arizona (Sen. <span class='selected-term'>Mark Kelly</span>), and Nevada (Sen. Catherine Cortez Masto).",
    "author": "",
    "title": "Suddenly GOP Is On Defensive In Senate 2022 Campaign"
  },
  {
    "id": 5433,
    "mediaId": 2550,
    "date": "2022-04-20",
    "sentence": "Democrats are protecting three incumbents in Georgia (Sen. Raphael Warnock), Arizona (Sen. <span class='selected-term'>Mark Kelly</span>), and Nevada (Sen. Catherine Cortez Masto).",
    "author": "",
    "title": "Senate GOP super PAC playing a lot of defense for a supposed"
  },
  {
    "id": 5168,
    "mediaId": 2522,
    "date": "2022-04-20",
    "sentence": "“In this case, the administration hasn’t even prepared, and they don’t have a plan for what to expect,” Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) said.",
    "author": "Kevin Haggerty",
    "title": "Biden may delay lifting Title 42 as Democrats fret over looming midterm disaster: report"
  },
  {
    "id": 5697,
    "mediaId": 2656,
    "date": "2022-04-21",
    "sentence": "Recommended: Lefties in Panic Over Biden Support Collapse With Younger Voters\nMy colleague and dear friend Stephen Kruiser — an Arizona native and Tucson resident — just doesn’t see any Republican knocking off <span class='selected-term'>Mark Kelly</span>.",
    "author": "Stephen Green",
    "title": "Sabato: Republicans 'Favorites' to Take Senate"
  },
  {
    "id": 4815,
    "mediaId": 2589,
    "date": "2022-04-21",
    "sentence": "Acutely aware of the need to get distance from the president, the four most endangered Democratic incumbents — Arizona Sen. <span class='selected-term'>Mark Kelly</span>, Georgia Sen. Raphael Warnock, Nevada Sen. Catherine Cortez Masto and New Hampshire Sen. Maggie Hassan — are increasingly taking steps to highlight their independence from the president and underscore their differences.",
    "author": "Ed Morrissey",
    "title": "Politico: The Senate Democrat long-distance run from Biden has begun"
  },
  {
    "id": 4784,
    "mediaId": 2553,
    "date": "2022-04-21",
    "sentence": "",
    "author": "Dillon Burroughs",
    "title": "Florida Congressman: Psaki Should ‘Save Her Tears’ Over Florida Education Law, Save Them For Kids Trafficked Over Biden’s Border Policies"
  }
]