[
  {
    "id": 4469,
    "mediaId": 2658,
    "date": "2022-01-11",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) is not yet committed to a rules overhaul that would allow elections reform legislation to pass by a simple majority, he told Burgess and Marianne on Monday.",
    "author": "",
    "title": "Democrats look for a roadmap on rules changes"
  },
  {
    "id": 2676,
    "mediaId": 2572,
    "date": "2022-01-31",
    "sentence": "OK, <span class='selected-term'>Mark Kelly</span>, think carefully before you vote in lockstep with the radicals.",
    "author": "",
    "title": "'The Ingraham Angle' on Breyer's retirement, school accused of grooming student to change gender identity"
  },
  {
    "id": 10854,
    "mediaId": 2658,
    "date": "2022-03-17",
    "sentence": "And Democratic allies of the Biden administration — from Senate Majority Whip DICK DURBIN (Ill.) to swing-state freshman Sen. <span class='selected-term'>MARK KELLY</span> (Ariz.) — continue to push back against Zelenskyy’s desired fighter jet transfer.",
    "author": "",
    "title": "POLITICO Playbook: Scoop: RNC down to two 2024 convention finalists"
  },
  {
    "id": 10005,
    "mediaId": 2526,
    "date": "2022-03-31",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-AZ) and Sen. Richard Blumenthal (D-CT) join the growing list of Democrats to show concern over Los Angeles Mayor Eric Garcetti’s nomination to serve as U.S. ambassador to India.",
    "author": "Jacob Bliss",
    "title": "Multiple Democrats Show Concern over Eric Garcetti’s Nomination as Ambassador to India"
  },
  {
    "id": 6176,
    "mediaId": 2658,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), facing a tough reelection battle this November, said he’s “continuing to evaluate her record” after a similar meeting.",
    "author": "",
    "title": "Midterm politicking comes for Biden’s stalled tech nominee"
  }
]