[
  {
    "id": 4472,
    "mediaId": 2658,
    "date": "2022-01-13",
    "sentence": "Raphael Warnock of Georgia, Maggie Hassan of New Hampshire, Catherine Cortez Masto of Nevada and <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "",
    "title": "Dems torpedo Cruz’s bid to sanction Russian pipeline"
  },
  {
    "id": 4538,
    "mediaId": 2658,
    "date": "2022-01-14",
    "sentence": "RAPHAEL WARNOCK of Georgia, MAGGIE HASSAN of New Hampshire, CATHERINE CORTEZ MASTO of Nevada and <span class='selected-term'>MARK KELLY</span> of Arizona.",
    "author": "",
    "title": "U.S. has intel about possible Russian false-flag op"
  },
  {
    "id": 3587,
    "mediaId": 2658,
    "date": "2022-01-26",
    "sentence": "KELLY GETS SINEMA’S BACK — Sen. <span class='selected-term'>MARK KELLY</span> (D-Ariz.) defended his fellow Democrat and delegation mate KYRSTEN SINEMA on Tuesday, saying he doesn’t agree with his state party’s move to censure her, the Arizona Republic reports.",
    "author": "",
    "title": "POLITICO Playbook: Ominous signs for Ukraine"
  },
  {
    "id": 2692,
    "mediaId": 2573,
    "date": "2022-02-01",
    "sentence": "The National Republican Senatorial Committee telling us senators from these states will be on defense, saying -- quote -- \"<span class='selected-term'>Mark Kelly</span>, Raphael Warnock, Maggie Hassan, Catherine Cortez Masto, and Michael Bennet will have to spend the rest of the year explaining to voters why they supported the failed Biden agenda that made their lives more expensive.",
    "author": "",
    "title": "'Your World' on US response to growing Russian aggression towards Ukraine"
  },
  {
    "id": 1804,
    "mediaId": 2658,
    "date": "2022-02-04",
    "sentence": "",
    "author": "",
    "title": "The arguments a Russian bank is leaning on to evade potential sanctions"
  },
  {
    "id": 1813,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Rob Crilly &",
    "title": "White House sends Kamala Harris to Europe to 'reassure' allies in Ukraine's standoff with Putin as Pentagon draws up early plan to evacuate Americans from Kiev to avoid another 'messy withdrawal' and Kabul catastrophe"
  },
  {
    "id": 901,
    "mediaId": 2641,
    "date": "2022-02-17",
    "sentence": "Senators <span class='selected-term'>Mark Kelly</span>, D- Ariz., and Maggie Hassan, D- NH, have proposed temporarily suspending the federal gas tax through the end of 2022 as a method to bring relief at the pump, but the plan has faced bipartisan pushback.",
    "author": "Maxwell Newman",
    "title": "Gas Could Hit $7 per Gallon"
  },
  {
    "id": 43,
    "mediaId": 2658,
    "date": "2022-02-21",
    "sentence": "HAPPY BIRTHDAY: Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) … Reps. Steven Palazzo (R-Miss.)",
    "author": "",
    "title": "POLITICO Playbook: The reasons for optimism — but more pessimism — in Ukraine"
  },
  {
    "id": 11,
    "mediaId": 2658,
    "date": "2022-02-24",
    "sentence": "She previously was comms director for Rep. Teresa Leger Fernandez (D-N.M.), and is a <span class='selected-term'>Mark Kelly</span> and Kirsten Gillibrand alum.",
    "author": "",
    "title": "POLITICO Playbook: War in Europe"
  },
  {
    "id": 16998,
    "mediaId": 2520,
    "date": "2022-02-26",
    "sentence": "According to Oli Stokolosa, a Ukraine native and organizer who has lived in Arizona for about 10 years, one of the goals of the protest was to demand action from U.S. Sen. <span class='selected-term'>Mark Kelly</span> and Sinema to deliver the urgency of the message to the White House.",
    "author": "Laura Daniella Sepulveda",
    "title": "'I want Arizonans to be aware': Ukrainians in Phoenix call for more 'severe' action from US against Russia"
  },
  {
    "id": 17040,
    "mediaId": 2658,
    "date": "2022-02-28",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) wrote Biden a letter saying his proposals are “concrete steps that should be taken to drive down gas prices and provide relief to families.” While the White House has said “all options are on the table” the gas tax holiday faces universal opposition from Republicans and has split Democrats on the Hill.",
    "author": "",
    "title": "American air carriers cut off Russia"
  },
  {
    "id": 17199,
    "mediaId": 2569,
    "date": "2022-03-01",
    "sentence": "Senate Democrats like Raphael Warnock, <span class='selected-term'>Mark Kelly</span>, Catherine Cortez Masto, Michael Bennet, and Maggie Hassan have done nothing but rubber stamp Joe Biden’s disastrous agenda that’s hurting American families.",
    "author": "Peter Schorsch",
    "title": "Florida reacts to Joe Biden’s State of the Union address"
  },
  {
    "id": 17264,
    "mediaId": 8350,
    "date": "2022-03-02",
    "sentence": "",
    "author": "ASSOCIATED PRESS",
    "title": "Ukraine war upends Biden’s agenda on energy, climate change"
  },
  {
    "id": 17323,
    "mediaId": 2745,
    "date": "2022-03-03",
    "sentence": "“Ducey had been heavily courted by Senate Minority Leader Mitch McConnell (R-Ky.), the National Republican Senatorial Committee and others in Washington who saw him as the strongest GOP candidate to take on Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) this fall,” Felicia Sonmez reports.",
    "author": "",
    "title": "Of Russian vodka and cheese-eating surrender monkeys"
  },
  {
    "id": 15276,
    "mediaId": 2520,
    "date": "2022-03-07",
    "sentence": "A spokesman for Sen. Kyrsten Sinema, D-Ariz., said she “and her team continue to engage with the U.S. State Department to ensure Ms. Griner is safe and has the appropriate support and assistance.”\nA spokesman for Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., who sits on the Senate Armed Services Committee, said the senator is concerned about Griner’s “well-being and safe return, and we are working with the State Department to ensure this is a top priority.”\nSen. John Cornyn, R-Texas, who sits on the Select Committee on Intelligence, has also been in touch with the State Department, a spokesperson confirmed.",
    "author": "Ronald J. Hansen",
    "title": "Brittney Griner 'just a token' in Russia's efforts against US, political experts say"
  },
  {
    "id": 12502,
    "mediaId": 2658,
    "date": "2022-03-07",
    "sentence": "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. <span class='selected-term'>MARK KELLY</span> this fall.",
    "author": "",
    "title": "POLITICO Playbook: Russia escalates brutality, Congress steps up response"
  },
  {
    "id": 15425,
    "mediaId": 8451,
    "date": "2022-03-08",
    "sentence": "One proposal, from a group of senators including Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., would suspend the federal gasoline tax for the rest of 2022.",
    "author": "Russ Wiles",
    "title": "Arizona gas prices are going up. Here's how to find the cheapest gas"
  },
  {
    "id": 15513,
    "mediaId": 2658,
    "date": "2022-03-09",
    "sentence": "The Complex\nAIR FORCE READY TO SEND F-16 FIGHTERS TO POLAND: Air Combat Command chief Gen. <span class='selected-term'>MARK KELLY</span> said the Air Force is prepared to deliver F-16s to Poland if asked to do so by the Biden administration as part of a larger deal to help Ukraine defend against Russia, per our own LEE HUDSON (for Pros!).",
    "author": "",
    "title": "Poland gets its close-up"
  },
  {
    "id": 15454,
    "mediaId": 2748,
    "date": "2022-03-10",
    "sentence": "Scott Kelly is the twin brother of <span class='selected-term'>Mark Kelly</span>, a Democratic senator representing Arizona",
    "author": "STATION GOSSIP",
    "title": "Epic: Angry US Astronaut Tells Russians What to Do with Special Medal They Awarded Him in 2011"
  },
  {
    "id": 15203,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) have co-sponsored a bill to prohibit defense contractors from buying rare earths from China, one of a number of ideas to address the problem.",
    "author": "",
    "title": "The Market Is Not Enough"
  },
  {
    "id": 13392,
    "mediaId": 2573,
    "date": "2022-03-15",
    "sentence": "Democratic Senators Maggie Hassan and <span class='selected-term'>Mark Kelly</span> want to suspend the federal gas tax.",
    "author": "",
    "title": "'Your World' on Russian missile strike near Poland-Ukraine border"
  },
  {
    "id": 14034,
    "mediaId": 2539,
    "date": "2022-03-16",
    "sentence": "And it came after Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., earlier Wednesday said Biden “absolutely” should call Putin a war criminal.",
    "author": "Dan Mangan",
    "title": "Biden says Russian leader Putin ‘is a war criminal’ for Ukraine attacks"
  },
  {
    "id": 13553,
    "mediaId": 2573,
    "date": "2022-03-16",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., called the scenes in the video \"tragic,\" adding, \"Vladimir Putin is now attacking civilians, which is clearly a war crime.\"",
    "author": "Tyler Olson",
    "title": "'Heart-wrenching' Zelenskyy speech gives Congress 'vivid reminder' of Putin's brutal war"
  },
  {
    "id": 14213,
    "mediaId": 2583,
    "date": "2022-03-16",
    "sentence": "",
    "author": "",
    "title": "Sen. Mark Kelly on No-Fly Zone: ‘It Is in the Best Interest of Everybody’ to Avoid War with Russia"
  },
  {
    "id": 10779,
    "mediaId": 2658,
    "date": "2022-03-16",
    "sentence": "Eight Senate Dems — including several up for reelection this fall — voted with the GOP: MICHAEL BENNET (Colo.), CATHERINE CORTEZ MASTO (Nev.), MAGGIE HASSAN (N.H.), <span class='selected-term'>MARK KELLY</span> (Ariz.), JOE MANCHIN (W.Va.), JACKY ROSEN (Nev.), Sinema and JON TESTER (Mont.).",
    "author": "",
    "title": "POLITICO Playbook: What Zelenskyy wants vs. what he'll get"
  },
  {
    "id": 10873,
    "mediaId": 2520,
    "date": "2022-03-16",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., a member of the Senate Armed Services Committee, said in an interview that enforcing a no-fly zone would require a level of involvement that he can't support.",
    "author": "Ronald J. Hansen",
    "title": "After Zelenskyy speech, Arizona delegation calls for more aid to Ukraine without combat"
  },
  {
    "id": 10854,
    "mediaId": 2658,
    "date": "2022-03-17",
    "sentence": "And Democratic allies of the Biden administration — from Senate Majority Whip DICK DURBIN (Ill.) to swing-state freshman Sen. <span class='selected-term'>MARK KELLY</span> (Ariz.) — continue to push back against Zelenskyy’s desired fighter jet transfer.",
    "author": "",
    "title": "POLITICO Playbook: Scoop: RNC down to two 2024 convention finalists"
  },
  {
    "id": 11187,
    "mediaId": 2868,
    "date": "2022-03-17",
    "sentence": "Senator <span class='selected-term'>Mark Kelly</span>, a Democrat from Arizona, took home funding for a light rail project in Phoenix.",
    "author": "",
    "title": "Why the return of earmarks could be good news for the planet"
  },
  {
    "id": 10673,
    "mediaId": 6598,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Maroosha Muzaffar",
    "title": "Biden news: Harris says US ‘not into regime change’ but won’t say whether she agrees Putin must go"
  },
  {
    "id": 7977,
    "mediaId": 2572,
    "date": "2022-04-05",
    "sentence": "And the people who should be most worried about it are the two senators from Arizona in particular, <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema.",
    "author": "Fox News Staff",
    "title": "'Special Report' All-Star Panel on Bret Baier's exclusive with President Zelenskyy"
  },
  {
    "id": 8561,
    "mediaId": 2640,
    "date": "2022-04-06",
    "sentence": "ZDNet also reports on a recent Twitter tiff between retired astronaut <span class='selected-term'>Mark Kelly</span> and Dmitry Rogozin, head of Russia's Roscosmos space agency, in which Kelly slammed Russia's invasion, while Rogozin seemed to threaten that cosmonauts would abandon Vande Hei in space.",
    "author": "Jenn Gidman",
    "title": "Cosmonauts 'Blindsided' by Hubbub Over Spacesuits"
  },
  {
    "id": 8499,
    "mediaId": 6461,
    "date": "2022-04-07",
    "sentence": "In Arizona, where a Democratic senator, <span class='selected-term'>Mark Kelly</span>, is vulnerable, prices are up by 50%.",
    "author": "",
    "title": "Spiralling fuel prices add to Democrats’ woes"
  },
  {
    "id": 4768,
    "mediaId": 2696,
    "date": "2022-04-23",
    "sentence": "",
    "author": "Marcus E. Howard",
    "title": "Sen. Ed Markey calls on the U.S. to lift the cap on Ukrainian refugees"
  }
]