[
  {
    "id": 4538,
    "mediaId": 2658,
    "date": "2022-01-14",
    "sentence": "RAPHAEL WARNOCK of Georgia, MAGGIE HASSAN of New Hampshire, CATHERINE CORTEZ MASTO of Nevada and <span class='selected-term'>MARK KELLY</span> of Arizona.",
    "author": "",
    "title": "U.S. has intel about possible Russian false-flag op"
  },
  {
    "id": 3575,
    "mediaId": 2658,
    "date": "2022-01-16",
    "sentence": "DOUG DUCEY as a “terrible representative of your state,” and said that the Republican, who is mulling a run against Democratic Sen. <span class='selected-term'>MARK KELLY</span>, is “not going to get my endorsement.”\nOn the scene: Mark Peterson photographed the rally for POLITICO.",
    "author": "",
    "title": "POLITICO Playbook: A night at the Trump rally"
  },
  {
    "id": 3940,
    "mediaId": 2618,
    "date": "2022-01-24",
    "sentence": "",
    "author": "Karen Kataline",
    "title": "Is An Iron Curtain Closing Around America?"
  },
  {
    "id": 2723,
    "mediaId": 8475,
    "date": "2022-01-28",
    "sentence": "Arizona Sen. <span class='selected-term'>Mark Kelly</span>, a Democrat elected in a special election in 2020, praised Breyer for protecting freedom of speech, reproductive rights and health care access as a justice.",
    "author": "Jennifer Shutt",
    "title": "Biden vows to nominate first Black woman to Supreme Court by end of February"
  },
  {
    "id": 1813,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Rob Crilly &",
    "title": "White House sends Kamala Harris to Europe to 'reassure' allies in Ukraine's standoff with Putin as Pentagon draws up early plan to evacuate Americans from Kiev to avoid another 'messy withdrawal' and Kabul catastrophe"
  },
  {
    "id": 1817,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Joshua Klein",
    "title": "Biden’s DHS Brands Free Speech ‘Terrorism Threat’ to U.S. — ‘Welcome to Your Communist Future’"
  },
  {
    "id": 1932,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Elizabeth Elkind",
    "title": "38 Republican lawmakers write to Biden AGAIN to urge him to take a cognitive test: GOP says 'something isn't right' and Americans deserve to have 'absolute confidence' in the President"
  },
  {
    "id": 1894,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Jeff Charles",
    "title": "White House Says It Never Planned to Fund Distribution of Crack Pipes"
  },
  {
    "id": 1949,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Joshua Rhett Miller",
    "title": "Fauci unmasked? Doc says ‘full-blown’ COVID pandemic almost over in US"
  },
  {
    "id": 1950,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Melissa Koenig",
    "title": "Terrifying moment Seattle homeless man cracks female Amazon engineer's skull with a baseball bat as she walks home in random attack: Suspect, 31, finally in jail after 16-year crime spree that includes arrests for robbery, burglary and assault"
  },
  {
    "id": 1972,
    "mediaId": 2618,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Ryan Lovelace",
    "title": "Rep. Maria Cantwell: NASA’s role in space travel is confusing Americans"
  },
  {
    "id": 923,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> of Arizona and a group of five other Senate Democrats last week proposed temporarily suspending the federal 18.4 cent-a-gallon gas tax through the end of the year.",
    "author": "",
    "title": "Biden, Democrats Eye Suspension of 18-Cent Federal Gas Tax: Report"
  },
  {
    "id": 1016,
    "mediaId": 6511,
    "date": "2022-02-15",
    "sentence": "Basta ver, por ejemplo, la barbaridad que ha hecho el aspirante a senador por Arizona, Jim Lamon, en cuyo mensaje de campaña dispara su revólver al estilo Viejo Oeste contra caracterizaciones de la presidenta de la Cámara Baja, Nancy Pelosi, el presidente Joe Biden, y el senador demócrata de Arizona, <span class='selected-term'>Mark Kelly</span>.",
    "author": "",
    "title": "Inimaginables serán para EE.UU. los días sin inmigrantes"
  },
  {
    "id": 43,
    "mediaId": 2658,
    "date": "2022-02-21",
    "sentence": "HAPPY BIRTHDAY: Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) … Reps. Steven Palazzo (R-Miss.)",
    "author": "",
    "title": "POLITICO Playbook: The reasons for optimism — but more pessimism — in Ukraine"
  },
  {
    "id": 17040,
    "mediaId": 2658,
    "date": "2022-02-28",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) wrote Biden a letter saying his proposals are “concrete steps that should be taken to drive down gas prices and provide relief to families.” While the White House has said “all options are on the table” the gas tax holiday faces universal opposition from Republicans and has split Democrats on the Hill.",
    "author": "",
    "title": "American air carriers cut off Russia"
  },
  {
    "id": 17199,
    "mediaId": 2569,
    "date": "2022-03-01",
    "sentence": "Senate Democrats like Raphael Warnock, <span class='selected-term'>Mark Kelly</span>, Catherine Cortez Masto, Michael Bennet, and Maggie Hassan have done nothing but rubber stamp Joe Biden’s disastrous agenda that’s hurting American families.",
    "author": "Peter Schorsch",
    "title": "Florida reacts to Joe Biden’s State of the Union address"
  },
  {
    "id": 17357,
    "mediaId": 8350,
    "date": "2022-03-01",
    "sentence": "Arizona Democratic U.S. Sen. <span class='selected-term'>Mark Kelly</span> also touched on Biden’s statement regarding prescription drug prices, as well as microchip manufacturing, saying he was happy to see the president focused on getting legislation into law.",
    "author": "TORRENCE DUNHAM",
    "title": "Arizona politicians react to President Joe Biden’s first State of the Union address"
  },
  {
    "id": 17264,
    "mediaId": 8350,
    "date": "2022-03-02",
    "sentence": "",
    "author": "ASSOCIATED PRESS",
    "title": "Ukraine war upends Biden’s agenda on energy, climate change"
  },
  {
    "id": 13291,
    "mediaId": 2520,
    "date": "2022-03-02",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., also noted the manufacturing issue, while calling for inflation-fighting moves to aid Americans.",
    "author": "Ronald J. Hansen",
    "title": "Unity at start of Biden's State of the Union speech gives way to familiar domestic battles"
  },
  {
    "id": 15269,
    "mediaId": 8326,
    "date": "2022-03-05",
    "sentence": "Kozachik also contacted the offices of Rep. Raúl Grijalva, Rep. Ann Kirkpatrick, Sen. <span class='selected-term'>Mark Kelly</span> and Sen. Kyrsten Sinema seeking help.",
    "author": "Zayna Syed",
    "title": "A judge fled the Taliban in Afghanistan. Now he waits to be reunited with his family"
  },
  {
    "id": 15425,
    "mediaId": 8451,
    "date": "2022-03-08",
    "sentence": "One proposal, from a group of senators including Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., would suspend the federal gasoline tax for the rest of 2022.",
    "author": "Russ Wiles",
    "title": "Arizona gas prices are going up. Here's how to find the cheapest gas"
  },
  {
    "id": 15513,
    "mediaId": 2658,
    "date": "2022-03-09",
    "sentence": "The Complex\nAIR FORCE READY TO SEND F-16 FIGHTERS TO POLAND: Air Combat Command chief Gen. <span class='selected-term'>MARK KELLY</span> said the Air Force is prepared to deliver F-16s to Poland if asked to do so by the Biden administration as part of a larger deal to help Ukraine defend against Russia, per our own LEE HUDSON (for Pros!).",
    "author": "",
    "title": "Poland gets its close-up"
  },
  {
    "id": 15203,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) have co-sponsored a bill to prohibit defense contractors from buying rare earths from China, one of a number of ideas to address the problem.",
    "author": "",
    "title": "The Market Is Not Enough"
  },
  {
    "id": 13553,
    "mediaId": 2573,
    "date": "2022-03-16",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., called the scenes in the video \"tragic,\" adding, \"Vladimir Putin is now attacking civilians, which is clearly a war crime.\"",
    "author": "Tyler Olson",
    "title": "'Heart-wrenching' Zelenskyy speech gives Congress 'vivid reminder' of Putin's brutal war"
  },
  {
    "id": 13389,
    "mediaId": 2658,
    "date": "2022-03-16",
    "sentence": "Joe Manchin (D-W.Va.) and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) said Tuesday they are undecided on Gonzalez and planned to spend more time reviewing the allegations against him.",
    "author": "",
    "title": "Zelenskyy’s powers of persuasion"
  },
  {
    "id": 10779,
    "mediaId": 2658,
    "date": "2022-03-16",
    "sentence": "Eight Senate Dems — including several up for reelection this fall — voted with the GOP: MICHAEL BENNET (Colo.), CATHERINE CORTEZ MASTO (Nev.), MAGGIE HASSAN (N.H.), <span class='selected-term'>MARK KELLY</span> (Ariz.), JOE MANCHIN (W.Va.), JACKY ROSEN (Nev.), Sinema and JON TESTER (Mont.).",
    "author": "",
    "title": "POLITICO Playbook: What Zelenskyy wants vs. what he'll get"
  },
  {
    "id": 13524,
    "mediaId": 2553,
    "date": "2022-03-19",
    "sentence": "Democrat Senators <span class='selected-term'>Mark Kelly</span> and Maggie Hassan, who are both facing re-election in 2022, authored a bill to suspend the federal gas tax through the end of the year.",
    "author": "John Rigolizzo",
    "title": "Conservatives Roast White House After Report It Considered Giving Americans Gas Cards"
  },
  {
    "id": 12234,
    "mediaId": 2748,
    "date": "2022-03-26",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) are pleading with President Joe Biden to preserve border controls that have stemmed illegal immigration at the United States-Mexico border.",
    "author": "Blarp Blog",
    "title": "Democrats Kyrsten Sinema, Mark Kelly Urge Biden to Enforce Border Controls"
  },
  {
    "id": 11797,
    "mediaId": 2526,
    "date": "2022-03-27",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ) have urged the administration to continue enforcing the authority.",
    "author": "John Binder",
    "title": "Report: Biden Officials Prepare for ‘Mass Migration Event’ at Southern Border"
  },
  {
    "id": 11585,
    "mediaId": 2572,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Border Patrol chief says US on track to hit 1M migrant encounters in 6 months as crisis accelerates"
  },
  {
    "id": 10496,
    "mediaId": 6449,
    "date": "2022-03-29",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> sent a letter to Biden expressing their concern.",
    "author": "Jarrett Stepman",
    "title": "Border Crisis Is About to Get a Lot Worse"
  },
  {
    "id": 9804,
    "mediaId": 2572,
    "date": "2022-03-29",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> of Arizona wrote to Biden in a letter.",
    "author": "",
    "title": "GOP introduces border strategy bill as WH poised to end Trump border policy"
  },
  {
    "id": 10436,
    "mediaId": 4045,
    "date": "2022-03-30",
    "sentence": "",
    "author": "COLLEEN LONG",
    "title": "AP sources: Asylum limits at border expected to end May 23"
  },
  {
    "id": 9976,
    "mediaId": 2590,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "Asylum Limits At Border Expected To End May 23: Report"
  },
  {
    "id": 10584,
    "mediaId": 2801,
    "date": "2022-03-30",
    "sentence": "",
    "author": "COLLEEN LONG, JASON DEAREN and ELLIOT SPAGAT",
    "title": "AP sources: Asylum limits at border expected to end May 23"
  },
  {
    "id": 10648,
    "mediaId": 6512,
    "date": "2022-03-30",
    "sentence": "Arizona Democrats - Senators Kirsten Sinema and <span class='selected-term'>Mark Kelly</span> - also made the same plea to the administration.",
    "author": "Joshua Summers",
    "title": "Joe Biden's Administration to End Title 42 Expulsion by May; Republicans Push Back"
  },
  {
    "id": 10681,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "Joe Manchin (D-W.Va.), Kyrsten Sinema (D-Ariz.), and <span class='selected-term'>Mark Kelly</span> (D-Ariz.) voted against allowing Dr. David Weil's nomination to move forward Wednesday evening, several months after the former Obama administration official was first nominated for the top wage regulatory role.",
    "author": "Julia Conley",
    "title": "'Body blow to working people': Right-wing Democrats reject Biden labor nominee"
  },
  {
    "id": 9959,
    "mediaId": 2553,
    "date": "2022-03-31",
    "sentence": "One of the stricter bills was introduced in January by Senators Jon Ossoff (D-GA) and <span class='selected-term'>Mark Kelly</span> (D-AZ) and includes the legislators’ spouses and dependent children in the restrictions.",
    "author": "Cabot Phillips",
    "title": "Here’s How Members Of Congress Use Inside Information To Make Millions On The Stock Market"
  },
  {
    "id": 10000,
    "mediaId": 8322,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Adam Shaw",
    "title": "Dem senators sound alarm over reports Biden administration will end Title 42 border policy"
  },
  {
    "id": 10328,
    "mediaId": 6519,
    "date": "2022-03-31",
    "sentence": "WASHINGTON, D.C.— In response to the Senate’s failed effort to move David Weil’s nomination forward, Adam Brandon, FreedomWorks President, commented:\n“We applaud the 50 Republican Senators and the three Democratic Senators–West Virginia’s Joe Manchin and Arizona’s Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>–who voted against cloture on the nomination of David Weil to be Administrator of the Department of Labor’s Wage and Hour Division.”\n“Weil’s confirmation to this position would have harmed workers as well as employers, particularly small businesses.",
    "author": "Adam Brandon",
    "title": "FreedomWorks Statement in Response to Failed Effort to Move David Weil’s Nomination Forward"
  },
  {
    "id": 10003,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "Kyrsten Sinema (D-AZ) and <span class='selected-term'>Mark Kelly</span> (D-AZ), both of who urged Biden to keep Title 42 in place, said the decision shows the depth to which the White House does not understand the toll illegal immigration has on border communities.",
    "author": "John Binder",
    "title": "Battleground State Democrats Panic over Biden Ending Trump-Era Border Controls: ‘A Frightening Decision’"
  },
  {
    "id": 10030,
    "mediaId": 2551,
    "date": "2022-04-01",
    "sentence": "Moderate Democratic Senator Kyrsten Sinema said Wednesday that she and fellow Arizona Senator <span class='selected-term'>Mark Kelly</span> spoke with the Department of Homeland Security (DHS) about not ending Title 42 until there are other safeguards in place at the border.",
    "author": "",
    "title": "Biden administration pledges to deport migrants caught illegally crossing the US border 'IMMEDIATELY' as both Democrats and Republican warn of a 'mass migrant event' when Title 42 is lifted in May"
  },
  {
    "id": 10673,
    "mediaId": 6598,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Maroosha Muzaffar",
    "title": "Biden news: Harris says US ‘not into regime change’ but won’t say whether she agrees Putin must go"
  },
  {
    "id": 9795,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Tyler Olson",
    "title": "Democratic Sens. Kelly, Manchin press Biden over Gulf oil leases"
  },
  {
    "id": 9894,
    "mediaId": 2594,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Via AP news wire",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9896,
    "mediaId": 2746,
    "date": "2022-04-01",
    "sentence": "“This is a crisis, and in my estimation, because of a lack of planning from the administration, it’s about to get worse,” said Sen. <span class='selected-term'>Mark Kelly</span> of Arizona.",
    "author": "Jonathan J. Cooper and Anita Snow",
    "title": "Vulnerable Dems plead with Biden to delay reopening asylum"
  },
  {
    "id": 9881,
    "mediaId": 2636,
    "date": "2022-04-01",
    "sentence": "“I heard from a lot of business owners,” Senator <span class='selected-term'>Mark Kelly</span> of Arizona, one of the three Democrats, told Politico by way of justification for his opposition.",
    "author": "",
    "title": "The People, United, Must Fight Hard or Be Defeated"
  },
  {
    "id": 10690,
    "mediaId": 2595,
    "date": "2022-04-02",
    "sentence": "",
    "author": "M Dowling",
    "title": "Sen Manchin Calls Biden’s Rescinding of Title 42 “Frightening”"
  },
  {
    "id": 10280,
    "mediaId": 2894,
    "date": "2022-04-03",
    "sentence": "“I heard from a lot of business owners,” Sen. <span class='selected-term'>Mark Kelly</span> of Arizona, one of the three Democrats, told Politico by way of justification for his opposition.",
    "author": "",
    "title": "BINYAMIN APPELBAUM: The people, united, are not going to get very far"
  },
  {
    "id": 10202,
    "mediaId": 8258,
    "date": "2022-04-04",
    "sentence": "Richard Burr (R-NC), Bill Cassidy (R-LA), Susan Collins (R-ME), Chris Coons (D-DE), Lindsey Graham (R-SC), Maggie Hassan (D-NH), John Hickenlooper (D-CO), <span class='selected-term'>Mark Kelly</span> (D-AZ), Angus King (I-ME), Joe Manchin (D-WV), Jerry Moran (R-KS), Lisa Murkowski (R-AK), Rob Portman (R-OH), Mitt Romney (R-UT), Mike Rounds (R-SD), Jeanne Shaheen (D-NH), Kyrsten Sinema (D-AZ), Jon Tester (D-MT), Thom Tillis (R-NC), Mark Warner (D-VA), and Todd Young (R-IN).",
    "author": "AFF NEWSWIRE- CHLOE",
    "title": "Watch As Queen Pelosi BLOWS UP On National Television- ” If Her Radical Demands Aren’t Met She’s Going To Do THIS”"
  },
  {
    "id": 9997,
    "mediaId": 2641,
    "date": "2022-04-04",
    "sentence": "Joe Manchin of West Virginia, and the Arizona senators, <span class='selected-term'>Mark Kelly</span>, who is up for reelection, and Kyrsten Sinema, are opposed to the White House's decision to end Title 42, especially without having a contingent plan to deal with the pressing border crisis.",
    "author": "Peter Malbin",
    "title": "Ending Title 42 Expulsions a 'Disaster Politically' for Democrats: Republican Strategist"
  },
  {
    "id": 9899,
    "mediaId": 4045,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Missouri among states suing to stop Biden administration from ending asylum limits"
  },
  {
    "id": 9798,
    "mediaId": 2573,
    "date": "2022-04-04",
    "sentence": "INGRAHAM: Oh, and I will say in closing that Maggie Hassan in New Hampshire; <span class='selected-term'>Mark Kelly</span> in Arizona; Cortes Masto in Nevada, you are partly responsible for this.",
    "author": "",
    "title": "'The Ingraham Angle' on Disney, Hunter Biden"
  },
  {
    "id": 7223,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, both Democrats from Arizona, and Sen. Joe Manchin, a Democrat from West Virginia, also wrote letters last week expressing similar concerns.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 7092,
    "mediaId": 2520,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, would rather perpetuate a lie than structure an actual immigration and border security policy.",
    "author": "EJ Montini",
    "title": "Gov. Doug Ducey and Sens. Kyrsten Sinema and Mark Kelly bolster a border security lie"
  },
  {
    "id": 8013,
    "mediaId": 8345,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, have asked the Biden administration to hold off on lifting Title 42 to better prepare for an expected increase in asylum seekers.",
    "author": "",
    "title": "Federal lawsuit seeks to block end to sweeping U.S. asylum limits"
  },
  {
    "id": 7579,
    "mediaId": 2520,
    "date": "2022-04-05",
    "sentence": "Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span> are warning Biden against ending the “border restrictions without a comprehensive plan” to secure the border.",
    "author": "Elvia Díaz",
    "title": "Tired of COVID-19 restrictions? Then don't complain about the end of Title 42"
  },
  {
    "id": 8824,
    "mediaId": 2735,
    "date": "2022-04-06",
    "sentence": "Joe Manchin (D-W.Va.), <span class='selected-term'>Mark Kelly</span> (D-Ariz.), and Catherine Cortez Masto (D-Nev.).",
    "author": "Jake Johnson",
    "title": "GOP Threatens to Hold COVID Funding Hostage to Preserve Trump Immigration Policy"
  },
  {
    "id": 8699,
    "mediaId": 2609,
    "date": "2022-04-07",
    "sentence": "But rather than view it as a public health victory, some moderate Democrats see a huge political liability, leaving them furious that the White House ended policy ahead of a tough midterm election…\nSen. Joe Manchin (D-W.Va.) called it a “frightening decision.” Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.) called it “wrong.” And Sen. Maggie Hassan (D-N.H.) said the Biden administration “does not appear to be ready” for the surge in migration that could result.",
    "author": "Mike LaChance",
    "title": "Obama’s DHS Secretary Jeh Johnson Against Ending Title 42, Says Southern Border Not Sustainable"
  },
  {
    "id": 8499,
    "mediaId": 6461,
    "date": "2022-04-07",
    "sentence": "In Arizona, where a Democratic senator, <span class='selected-term'>Mark Kelly</span>, is vulnerable, prices are up by 50%.",
    "author": "",
    "title": "Spiralling fuel prices add to Democrats’ woes"
  },
  {
    "id": 7468,
    "mediaId": 3987,
    "date": "2022-04-07",
    "sentence": "",
    "author": "AV Press Releases",
    "title": "Dems Should Heed The Call of Leading Voices and Key Constituencies: Title 42 Needs to Go"
  },
  {
    "id": 7616,
    "mediaId": 6449,
    "date": "2022-04-07",
    "sentence": "And quite frankly, politically, this is going to be a hard year for U.S. Sen. <span class='selected-term'>Mark Kelly</span>, between the inflation that’s going on in Arizona and the border crisis that’s going on in Arizona’s border and across the nation.",
    "author": "Douglas Blair",
    "title": "Rep. Debbie Lesko Reveals GOP Plan to Lower Gas Prices"
  },
  {
    "id": 8036,
    "mediaId": 2520,
    "date": "2022-04-08",
    "sentence": "Senator from Arizona, <span class='selected-term'>Mark Kelly</span>, never left her side.",
    "author": "EJ Montini",
    "title": "Reminded of what America lost – and gained – when Gabby Giffords was shot"
  },
  {
    "id": 6840,
    "mediaId": 6449,
    "date": "2022-04-11",
    "sentence": "Arizona’s two Democratic senators, Kyrsten Sinema and <span class='selected-term'>Mark Kelly</span>, already have expressed their opposition, and others are now joining in.",
    "author": "Jarrett Stepman",
    "title": "Biden’s Radical Open Borders Policies Prompt Pushback"
  },
  {
    "id": 6972,
    "mediaId": 8347,
    "date": "2022-04-11",
    "sentence": "The policy change, though, is frustrating conservatives like McCarthy, as well as moderate Democratic senators like Senator <span class='selected-term'>Mark Kelly</span> and Kyrsten Sinema of Arizona, Senator Catherine Cortez Masto of Nevada and Senator Jon Tester of Montana.",
    "author": "Joe St. George",
    "title": "What is Title 42 and what is being done to address an expected surge?"
  },
  {
    "id": 6780,
    "mediaId": 6519,
    "date": "2022-04-14",
    "sentence": "Even Democrats such as Senators Maggie Hassan, Jon Tester, Joe Manchin, <span class='selected-term'>Mark Kelly</span>, and Kyrsten Sinema are raising the alarm about the consequences of this move by Biden.",
    "author": "Kilian Laverty",
    "title": "FreedomWorks’ Bill of the Month for April 2022: H.R. 741, the PAUSE Act"
  },
  {
    "id": 6807,
    "mediaId": 6509,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Ben Fox",
    "title": "Migrant Crossings Spike as US Plans to Lift Curb on Asylum"
  },
  {
    "id": 4870,
    "mediaId": 2855,
    "date": "2022-04-18",
    "sentence": "That is likely why Democratic Sen. <span class='selected-term'>Mark Kelly</span> (Ariz.), who is facing reelection in a tight contest this year, is being so openly critical of DHS’s handling of illegal migration at the Southwest border, and its ability to deal with a post Title 42 migrant tsunami:\nRight now we have a crisis on our southern border.",
    "author": "Andrew R. Arthur",
    "title": "Polling Shows Trouble for Biden"
  },
  {
    "id": 4812,
    "mediaId": 2562,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, D-Ariz., up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "NationalWatch",
    "title": "Migrant Crossings Spike as US Plans to Lift Title 42"
  },
  {
    "id": 4850,
    "mediaId": 6512,
    "date": "2022-04-18",
    "sentence": "Arizona Democratic Senator <span class='selected-term'>Mark Kelly</span> also called the decision wrong.",
    "author": "Joshua Summers",
    "title": "Joe Biden Under Fire Over Title 42 Expulsion, After Ex-ICE Claims End of the Mandate Gives Smugglers, Migrants a 'Head Start'"
  },
  {
    "id": 4945,
    "mediaId": 2523,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Associated Press",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 5013,
    "mediaId": 2801,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "BEN FOX",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 5060,
    "mediaId": 2632,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Ben Fox",
    "title": "Migrant Crossings Spike as US Plans to Lift Curb on Asylum"
  },
  {
    "id": 5126,
    "mediaId": 8251,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 5205,
    "mediaId": 2654,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Ben Fox",
    "title": "Migrant crossings spike as U.S. plans to lift pandemic limits on asylum"
  },
  {
    "id": 4653,
    "mediaId": 8350,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "ASSOCIATED PRESS",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 4754,
    "mediaId": 2607,
    "date": "2022-04-18",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Ben Fox",
    "title": "Migrant crossings spike as US plans to lift curb on asylum"
  },
  {
    "id": 4736,
    "mediaId": 2721,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "",
    "title": "Huge spike in border crossings amid new asylum policy"
  },
  {
    "id": 4666,
    "mediaId": 8347,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "",
    "title": "Migrant crossings spike as U.S. plans to lift curb on asylum"
  },
  {
    "id": 5033,
    "mediaId": 6428,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "Ben Fox",
    "title": "Migrant Crossings Spike as US Plans to Lift Curb on Asylum"
  },
  {
    "id": 4918,
    "mediaId": 2751,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "BEN FOX",
    "title": "Migrant crossings spike at US-Mexico border as US plans to lift curb on asylum"
  },
  {
    "id": 4915,
    "mediaId": 2919,
    "date": "2022-04-19",
    "sentence": "Sen. <span class='selected-term'>Mark Kelly</span>, an Arizona Democrat up for election this year, toured the border last week and warned that the Biden administration is unprepared for asylum restrictions to be lifted.",
    "author": "",
    "title": "Migrant crossings spike as U.S. plans to lift curb on asylum"
  },
  {
    "id": 4989,
    "mediaId": 2694,
    "date": "2022-04-21",
    "sentence": "Senator <span class='selected-term'>Mark Kelly</span> of Arizona visited the U.S.-Mexico border, and in a sign of the issue’s political salience, so did Senator Maggie Hassan of New Hampshire, despite the fact that New Hampshire is nowhere near Mexico.",
    "author": "David A. Graham",
    "title": "The Punt Presidency"
  },
  {
    "id": 4784,
    "mediaId": 2553,
    "date": "2022-04-21",
    "sentence": "",
    "author": "Dillon Burroughs",
    "title": "Florida Congressman: Psaki Should ‘Save Her Tears’ Over Florida Education Law, Save Them For Kids Trafficked Over Biden’s Border Policies"
  },
  {
    "id": 4768,
    "mediaId": 2696,
    "date": "2022-04-23",
    "sentence": "",
    "author": "Marcus E. Howard",
    "title": "Sen. Ed Markey calls on the U.S. to lift the cap on Ukrainian refugees"
  },
  {
    "id": 5112,
    "mediaId": 2522,
    "date": "2022-04-23",
    "sentence": "“And the reality is, Joe Biden and ‘Cartel Kelly'” Brnovich said referring to incumbent Sen. <span class='selected-term'>Mark Kelly</span> (D-Ariz.), “are trying to impose some neo-Marxist vision on this country and Americans are paying the price, not only at the gas pump and the grocery store, but literally with our lives and the lives of our children.",
    "author": "Kevin Haggerty",
    "title": "Arizona AG tears into Dems suddenly recognizing border crisis, importance of Title 42"
  },
  {
    "id": 4759,
    "mediaId": 2790,
    "date": "2022-04-24",
    "sentence": "Senators like Gary Peters of Michigan and <span class='selected-term'>Mark Kelly</span> of Arizona say they want more of a plan from the White House on how to handle the surge of migrants at the border.",
    "author": "Deepa Shivaram",
    "title": "What to know about Title 42, the Trump-era policy now central to the border debate"
  }
]