{
  "id": 10017,
  "mediaId": 8475,
  "date": "2022-04-01",
  "headline": "Time of the season for hatred: Transgender kids are in Arizona's legislative crosshairs",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/031522-gender-cape_1.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/opinion/report/040122_transgender_kids_op/time-season-hatred-transgender-kids-are-arizonas-legislative-crosshairs/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Blake Morlock",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/28262",
  "termIds": [
    5892,
    2915,
    4623,
    2737,
    102,
    5949,
    6667
  ],
  "sentences": [
    "We have been coordinating closely with medical professionals, athletic administrators, and, most importantly, the children and their families who will be directly impacted by this legislation and all are confused, hurt, and scared as to why their legislators have decided to single them out when their lives are already extremely difficult.\"",
    "Well, to hear Ducey say it in a letter he sent to Secretary of State Katie Hobbs on signing the measure: \"The reason is simple and common sense — this is a decision that will dramatically affect the rest of an individual's life, including the ability of that individual to become a biological parent later in life.\"",
    "Doug Ducey, apparently needing to keep his fortunes alive in what is increasingly a rage-a-holic\" Republican Party, signed two bills this week that basically tell transgender kids \"you are freaks and we don't like you.\"",
    "Anyone seriously hung up on grip-strength's link to inevitable championship prowess should read this scouting report from a few years back about a go-nowhere football player out of libtard Ann Arbour:\n\"Poor build ...",
    "The reason they went after LGBTQ adults for matrimonial commitment in the 2000s (after a decades of denouncing \"the promiscuous gay lifestyle\") is because it fell out of fashion to target African Americans.",
    "The new laws are basically designed to take the state back to the 1970s in terms of queer-bashing, to the1950s in terms of voting rights and the Plantagenets, when it comes to a woman's reproductive health.",
    "I seem to remember there's been a bunch of talk about parental rights when it comes to teaching slavery and Jim Crow (or tamping down the teaching if it makes one little white girl uncomfortable).",
    "There's no pandemic of transgender women athletes dominating women's sports (and if there was a pandemic, the last people who would want to do anything about it would be Arizona Republicans).",
    "The bills were two of several nasty ones signed by Ducey on a particularly Red Wednesday to get them all out at once so that by Monday the capitol press will be reporting on other things.",
    "Then the quarterback goes over to that kid — at the urging of his cheerleading girlfriend — and kicks him across the jaw with a steel-toed boot so the rest of the team will laugh.",
    "And like all children, transgender youth deserve to participate in school athletic programs as their true selves, not forced to be isolated and dismissed by their schools.",
    "The deep end\nSpeaking of \"problems\" that don't exist ...\nPenn State swimmer Lia Thomas won a national title this year — becoming the first transgender woman to do so.",
    "Blake Morlock is an award-winning columnist who worked in daily journalism for nearly 20 years, and as a communications director for the Pima County Democratic Party.",
    "Maybe some of these lawmakers graduated from underfunded Arizona schools and don't realize Thomas' victory is only news because it's a first, it is rare.",
    "Blake's Third-Rule of Politics: \"There's an inverse relationship between the deployment of' 'common-sense' as a modifier and the action it describes.\"",
    "She was the only transgender athlete to win a medal in Tokyo and she needed an assortment of strikers, stoppers and keepers alongside her to do it.",
    "And all Ducey and the Legislature are doing is dropping the three-letter F-- bomb as a statement concerning who has no ownership of the U.S. of A.",
    "Were their concerns legitimate and their actions responsible, lawmakers would have held hearing to figure out if their concerns were justified.",
    "Instead, they just slammed the bills through hoping transgender activists would be angry because that works well with the GOP's political base.",
    "Nothing screams religious freedom more than a bunch of pols lording over every family in Arizona and telling them what they can and can't do.",
    "Republicans gained a ton of traction during the 2000s uniting their party against gay marriage and dividing Democrats over the issue.",
    "More studies show that after a couple years of hormone therapy, the differences between trans and cisgender athletes are negligible.",
    "For transgender young folks for whom this care is medically necessary, this bill could have serious, life-threatening consequences.",
    "I'll let Sharpe explain:\nTransgender kids do not deserve to be the targets of dehumanizing attacks that invalidate their identity.",
    "Does not throw a really tight spiral ... System-type player who can get exposed if forced to ad lib ... Gets knocked down easily.\"",
    "In 2015, the U.S. Supreme Court handed down the Obergfell decision that granted gays the right to marry everywhere in the country.",
    "“It is simply not the job of legislators to make healthcare decisions for the families who this legislation will directly impact.",
    "I should have no ability to legislate my ignorance and I don't want these kids to feel abandoned and judged by their community.",
    "I'm sorry, there's a word that keeps getting thrown around when you attempt to erase from public view the existence of people.",
    "The second bans women who receive that procedure from participating in interscholastic athletics up to the collegiate level.",
    "The only reason Republicans are picking on transgender kids now is because they lost the argument over gay marriage in 2015.",
    "I'm sure it never occurred to the child seeking the surgery, the parents who signed off on it or the doctor performing it.",
    "Are you going to say there's no difference between Democratic Sen. Kyrsten Sinema and Republican Congressman Paul Gosar?",
    "Try it like this: \"Segregating rest rooms between races is a 'common-sense approach' to protecting traditional values.\"",
    "\"Nothing, nothing ...\" says the future Democratic political consultant, turning and shuffling away toward math class.",
    "If I seem in the tank for progressives, it's largely because they tend to go after conditions and actions in society.",
    "Protecting sports and kids must seem a pathway for ceaseless transphobia to go down a little smoother with busy moms.",
    "The state of Arizona has jumped in the middle of a family decision because politicians know what's best for everyone.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "Then people stopped to think about the issue and realized their knee- jerk \"iwww-no\" reaction may have been wrong.",
    "Say this about Republicans, their so-called morals always align with what's most politically expedient for them.",
    "\"And all the research shows that even a little acceptance and connection can reduce suicidality significantly.\"",
    "Ducey and the Legislature don't have to be jerks every day of the week to prove themselves true conservatives.",
    "This legislature will stand up for parental rights ... until those rights get in the way of an extreme agenda.",
    "OK, maybe other voters don't hate them all the time, but Republicans can cancel them in these strategic ways.",
    "Here's an idea: Let's stop the suicide and we can fix the rest later (if it even really needs to be fixed).",
    "They probably all thought it would be a neat party trick or something to do on a boring Saturday afternoon.",
    "Big government, bigfoots families\nFirst there's barring teenagers from receiving gender-affirming surgery.",
    "Every election people sit out in protesting the establishment, the more they perpetuate the establishment.",
    "Another athlete, Quinn, a Canadian midfielder, became the first transgender Olympian to win a gold medal.",
    "It must be that the Arizona Legislature is in season (or in session and the rest of us are \"in season).\"",
    "Allow me to lean in over her rhetorical shoulder and declare solidarity with a finger jab and a \"Yeah!\"",
    "Then they'd work to bring various communities together to come up with a solution if a problem existed.",
    "More to the point, they think they have found a way to get swing voters to say \"They are kinda freaks.",
    "Blame shifting\nAnyone watching politics during the past decade or two knows exactly what's going on.",
    "That's the typical response when a Democrat is elected president and the party's spine evaporates.",
    "Somewhere there must be a backlog of people who received this surgery and have come to regret it.",
    "Or how about \"Invading Ukraine is just a 'common-sense' policy to strengthen European stability.\"",
    "You are giving your consent that it's OK to smack people around just because they are different.",
    "So my kid must remain as ignorant as their classmates' most willfully ignorant parent insists.",
    "Canceling transgender youth\nLet's start with the two bills focused on transgender folks.",
    "In fact, parents can't even sign off on a medical procedure concerning their children.",
    "Spencer Cox vetoed a similar bill, citing high suicide rates among transgender youth.",
    "Meanwhile, another study found 40 percent of transgender kids have attempted suicide.",
    "Bridget Sharpe, executive director of Human Rights Arizona, summed it up pretty well.",
    "There are people who's country this is and there are people who's country this isn't.",
    "What's clear is the religious Right is going to keep doing it until it stops working.",
    "If these voters turn out in 2022 in numbers equal to 2024, the Legislature will flip.",
    "Anyone think more than 1 percent of Ducey voters have ever regretted their decision?",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "The Legislature probably should have protected voters from themselves on that one.",
    "The first bans anyone under the age of 18 from receiving gender-affirming surgery.",
    "If they can't unite America in hating gays, then how about transgender Americans?",
    "I don’t understand what they are going through or why they feel the way they do.",
    "For some reason, these days Republicans go after people who exist in our midst.",
    "It's about finding the kid on the playground who feels left out and different.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "If they did, they would find this study which puts the figure at 1 percent.",
    "Lauren Hubbard, a weightlifter from New Zealand, failed on her first lifts.",
    "If they won't, these bills will be simply be \"hatred-affirming procedures.\"",
    "Who doesn't want a lawmaker making their most personal decisions for them?",
    "I believe there's more to the philosophy than cruelty for cruelty's sake.",
    "Who can make up two-tenths of a second in a four-and-a-half minute race?",
    "Maybe the Stanford cis-gender student who finished a half-stroke behind?",
    "Join Rachel Cheeseman, Mary Fimbres, and Anonymous and contribute today!",
    "So clearly we need to ban transgender women from athletic competition.",
    "Ducey and the Legislature just canceled transgender kids and athletes.",
    "Elected officials score so high in terms of public trust and respect.",
    "Ducey called the legislation \"common-sense\" protections of children.",
    "But I want them to live,\" Cox wrote in a letter explaining his veto.",
    "It's a fetish of the Religious Right to isolate and vilify people.",
    "I honestly think they are selling the rest of their ideas short.",
    "Lacks a really strong arm ... Can’t drive the ball downfield ...",
    "I guess Reagan would have called it \"recreational sex changes.\"",
    "I don't understand gender-affirming surgery but you know what?",
    "I'm sure \"if it feels good, do it\" is in the Bible somewhere.",
    "You upset that nothing got done on climate or police reform?",
    "What kind of base needs to be riled up by this kind of B.S.?",
    "Thomas's victory was so newsworthy because it was the first.",
    "\"Rarely has so much fear and anger been directed at so few.",
    "Concerned about keeping quality reporting alive in Tucson?",
    "Concerned about keeping quality reporting alive in Tucson?",
    "Transgender kids are just kids, and they deserve to play.",
    "Anyone stands up and it's \"What are you looking at!?\"",
    "Support TucsonSentinel.com with a contribution today!",
    "Support TucsonSentinel.com with a contribution today!",
    "Opinion\nWhat the Devil won't tell you\nAaaahhh hatred.",
    "Can you smell the acrid scent of judgment in the air?",
    "Sports isn't all about brute strength and raw speed.",
    "The public agreed and changed its collective mind.",
    "In 2016, the religious Right found bathroom bills.",
    "Of course, Utah's legislature over-rode his veto.",
    "Now he’s telling you things that the Devil won’t.",
    "Lacks mobility and ability to avoid the rush ...",
    "Lacks great physical stature and strength ...",
    "Canada topped the podium in women's soccer.",
    "Are you going to sit out the 2022 election?",
    "Did the Legislature do any studies of that?",
    "I guess they learned that in Sunday school.",
    "I can get to them all in the coming days.",
    "So here's the question for the wokesters?",
    "He even has a stupid name: Tom Brady.",
    "I am what they call now \"cis-gender.\"",
    "You gonna let them get away with it?",
    "The issue became a political loser.",
    "I'm glad you straightened that out.",
    "Let's take the bills one at a time.",
    "We can all agree they suck, right?",
    "She won by less than 0.2 seconds.",
    "It's not a thing to worry about.",
    "It riles up the Republican base.",
    "What are you gonna do about it?",
    "And that's all this is about.",
    "It's not important that I do.",
    "We don't like them, either.\"",
    "This is a total non-issue.",
    "My opinion in a nutshell.",
    "They call it: \"cancel.\"",
    "Meanwhile, Utah's Gov.",
    "It's not a juggernaut.",
    "Why can't gays marry?",
    "Well, thank you Doug.",
    "It's not an outrage.",
    "It's understandable.",
    "Let's not get nuts.",
    "Sorry, Bill Maher.",
    "What is it again?",
    "I don't have to.",
    "No good reason.",
    "So what gives?",
    "I have time.",
    "Skinny ...",
    "Oh yeah.",
    "Bingo.",
    "Right?",
    "- 30 -",
    "Gov."
  ]
}