{
  "id": 10239,
  "mediaId": 2532,
  "date": "2022-03-30",
  "headline": "Arizona Governor Doug Ducey signs series of bills limiting abortion access and transgender rights",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/03/30/32310bb8-8591-43c8-add0-faf40b6e286a/thumbnail/1200x630/baa5b43fda0602b2982a1334b55cea97/ap-21231022806452.jpg",
  "link": "https://www.cbsnews.com/news/arizona-abortion-ban-transgender-rights-governor-doug-ducey/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tori B. Powell",
  "authorUrl": "",
  "termIds": [
    4623,
    2915,
    5949
  ],
  "sentences": [
    "Transgender Rights\n More\n Professor awarded $400,000 after being disciplined over wrong pronouns\n Alabama law banning transgender medication challenged in two lawsuits\n South Carolina House passes bill banning transgender students from girls' sports\n Trans health care is a \"matter of life or death,\" doctors say\n Arizona governor signs bills limiting abortion access and transgender rights\n More\nIn:\nArizona\ntransgender\nAbortion\nHealth Care\n Tori B. Powell\nTori B. Powell is a breaking news reporter at CBS News.",
    "Ducey said the legislation \"ensures that the girls and young women who have dedicated themselves to their sport do not miss out on hard-earned opportunities including their titles, standings and scholarships due to unfair competition.\"",
    "\"This onslaught is not an accident; it is overwhelming by design and in direct response to progress in the fight for trans rights,\" Trevor Project director of advocacy and government affairs Sam Ames said in a statement Wednesday.",
    "Among the trio of bills is legislation that restricts physicians in the state from performing an abortion after 15 weeks, except in a medical emergency that could impact \"the life and health of the mother.\"",
    "The bill does not prohibit puberty blocking hormones and other hormone therapies, and will not require children to stop taking any prescribed medications they were on at the time the bill was signed.",
    "Ducey's signing of the extreme and misogynistic abortion ban clarifies the very real & dangerous consequences of electing leaders who are willing to throw away our rights,\" she tweeted Wednesday.",
    "The law also requires any physician who performs an abortion after 15 weeks to document the reasons why, along with the estimated age of the aborted fetus, within 15 days of the procedure.",
    "Physicians who violate the law, known as SB1164 would face a class 6 felony charge, the least severe felony designation in the state, and could have their license suspended or revoked.",
    "\"The irreversible nature of these procedures underscores why such a decision should be made as an adult, not as a child, and further supports the importance of this legislation.\"",
    "Several other states, including Florida, Texas, Arkansas, South Dakota, Oklahoma and Mississippi, have passed similar legislation restricting transgender athletes.",
    "The signings come one day before Transgender Day of Visibility, a day dedicated to celebrating the accomplishments of transgender and gender-nonconforming people.",
    "Ducey on Wednesday also signed into law Senate Bill 1138, which restricts \"irreversible\" gender-affirming surgery for anyone in the state under the age of 18.",
    "The third bill signed Wednesday bars transgender girls and women from competing on women's teams at public schools, colleges and universities across Arizona.",
    "Schools will be required to designate athletic teams \"based on the biological sex of the participating students,\" according to Ducey's office.",
    "LGBTQ+ mental health organization The Trevor Project condemned the bills, saying they will cause harm to transgender and nonbinary children.",
    "Arizona Governor Doug Ducey signed three bills into law Wednesday that limit both transgender rights and abortion access in the state.",
    "The law also prohibits private schools from allowing transgender women and girls to compete in women's sports against public schools.",
    "Arizona Secretary of State Katie Hobbs called the legislation \"a giant step backward for reproductive freedom and women's equality.\"",
    "Failure to fill out the required documentation or falsifying information on them will be punishable by a fine of up to $10,000.",
    "\"In Arizona, we know there is immeasurable value in every life — including preborn life,\" Ducey said in his signing letter.",
    "The Supreme Court is currently considering a similar Mississippi law that also prohibits abortions after 15 weeks.",
    "\"These decisions should be made when an individual reaches adulthood,\" Ducey said in a signing letter.",
    "A pregnant person who receives an abortion after 15 weeks may not be prosecuted under SB1164.",
    "\"I believe it is each state's responsibility to protect them.\"",
    "Reach her at tori.powell@viacomcbs.com\n Twitter",
    "A decision in that case is expected by summer.",
    "\"Gov."
  ]
}