{
  "id": 10315,
  "mediaId": 6551,
  "date": "2022-03-31",
  "headline": "Ariz. Gov. Ducey Signs Bill Which Closes Loophole Allowing Non-Citizens to Vote",
  "image": "https://www.numbersusa.com/sites/default/files/public/assets/news/Ariz.png",
  "link": "https://www.numbersusa.com/news/ariz-gov-ducey-signs-bill-which-closes-loophole-allowing-non-citizens-vote",
  "mediaOutlet": "numbersusa.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Under the Arizonans for Voter ID Act, it will be a \"felony for election officials to register voters without proof of citizenship;\" additionally, county recorders will be required to \"regularly cross-reference registered voters with citizenship databases,\" and gives the Arizona AG authority to investigate potential wrongdoing.",
    "The signing into law of Arizona House Bill 2492, which requires verification of U.S. citizenship to be eligible to vote in Arizona elections, is a giant step toward ensuring elections are easy, convenient, and secure in our state.",
    "Previously, Arizona had passed Proposition 200, which required proof of citizenship to register to vote; however, a loophole was carved by a 7-2 Supreme Court Decision soon after its passage in 2004.",
    "That statutory reference encompasses all of 16-166, including Subsection G, which 'grandfathered' in those who were already registered at the time of Prop 200's effective date in 2005.",
    "16-101 and 16-121 that the opponents claim will cause everyone to re-register, clearly states, \"has provided satisfactory evidence of citizenship as prescribed in section 16-166.",
    "This means that potentially illegal voters would only have to use a federal form affirming their citizenship, signed under the penalty of perjury, to vote in Arizona elections.",
    "The court decided that Arizona could not enforce the rule for those who only intended to vote in federal elections as a federal law from 1993 pre-empts the state in that area.",
    "pic.twitter.com/bEiUDUDveW\n— Secretary Katie Hobbs (@SecretaryHobbs) March 25, 2022\nThe bill will take effect after the 2022 primary election but before the general election.",
    "HB2492 directly refers to that provision, as well as others in 16-166, resulting in those voters still being 'deemed to have provided satisfactory evidence of citizenship.",
    "State Rep. Hoffman stated in an interview with the Arizona Sun-Times;\nToday is a historic day for Arizona and a great victory for Arizonans and all Americans alike.",
    "HB 2492 is an incredibly well-crafted piece of legislation that is on sound legal footing and broadly supported by voters of all political parties.",
    "The law passed through both chambers of the Arizona legislature along party lines and established tough penalties for those who violate it.",
    "And one group, Stand Up America, even made the tall claim - \"The bill could remove millions of eligible Arizonans from the voter rolls.\"",
    "The bill clearly violates federal law & creates new barriers for voters that are unrelated to any legitimate election integrity purpose.",
    "I am confident that should Democrats challenge HB 2492 in court it will only serve to further reinforce its clear constitutionality.",
    "State Rep. Hoffman added in his interview with the Sun-Times;\nThe language of the bill, specifically the new language in A.R.S.",
    "Other opponents made erroneous claims that \"This Arizona bill could keep you from voting early, by mail or for president.\"",
    "This legislation will require proof of citizenship to register to vote in local elections in the state.",
    "The Sun-Times added that the Arizona bill had received immense pushback from Democrats in the state.",
    "veto the bill - complaining about the bill making it a felony to register a non-citizen to vote.",
    "For the good of AZ’s voters, election officials, & taxpayers, @dougducey should veto HB2492.",
    "According to the publisher, Democratic Secretary of State Katie Hobbs demanded that the Gov.",
    "Under this language they are 'deemed to have provided satisfactory evidence of citizenship.'",
    "Arizona Governor Doug Ducey has signed the 'Arizona for Voter ID Act,' HB 2492, into law.",
    "State Rep. Jake Hoffman initially sponsored the bill.",
    "Yesterday, I asked @dougducey to veto HB2492.",
    "For the complete story, please click here."
  ]
}