{
  "id": 10992,
  "mediaId": 2752,
  "date": "2022-03-14",
  "headline": "Trump-Endorsed AZ GOP Gov. Candidate Loves Imprisoning People Without Charges, Except For When She Doesn't",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTUzNDA2Ny9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTcxMDQ5NDA3Nn0.QaoP9-f4y5vFPAMgjpyv-gmkbCN3nCaUJXyCj9ZVf9I/img.png?width=1200&coordinates=0%2C0%2C0%2C344&height=600",
  "link": "https://www.wonkette.com/az-gop-hopeful-loves-imprisoning-people-without-charges-except-for-when-she-doesn-t",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robyn Pennacchia",
  "authorUrl": "https://www.wonkette.com/u/robyn_pennacchia",
  "termIds": [
    0
  ],
  "sentences": [
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nRobyn Pennacchia\nRobyn Pennacchia is a brilliant, fabulously talented and visually stunning angel of a human being, who shrugged off what she is pretty sure would have been a Tony Award-winning career in musical theater in order to write about stuff on the internet.",
    "Lake, who believes the 2020 election was stolen, has also repeatedly called for the imprisonment of Arizona Secretary of State Katie Hobbs (also a Democratic gubernatorial candidate in the race) for having certified the election, encouraging her audience in a \"Lock Her Up!\"",
    "\"What we saw happening in Australia, where you have internment camps, and people are being forced, if they’ve encountered anyone with COVID, to be locked into a quarantine camp, is the most horrifying thing I think I’ve ever seen a government do.",
    "After repeatedly insisting that her position on January 6 defendants didn't matter because it has nothing to do with being governor of Arizona, Lake finally said:\n\"What I don’t like is that people are being held in prison without being charged.",
    "Horrifically, Kari Lake is the current frontrunner for the GOP gubernatorial primary in Arizona, and the only Republican who beats Secretary of State Hobbs — whom, again, she would like to arrest on charges of \"doing her job\" — in a matchup.",
    "Australian schools also do not have to conduct active shooter drills in order for kids to practice \"not dying\" in the event that one of their gun-toting classmates gets turned down for prom and decides to make everyone pay.",
    "Before walking out in a huff, however, Lake managed to demonstrate her astoundingly deep misunderstandings of the situation with January 6 defendants, the US criminal justice system, Australian gun laws and COVID policies.",
    "They didn't get rid of all of the guns, they just enacted gun control, banning certain types of firearms, making it more difficult to buy them illegally and requiring people to have firearms licenses in order to own one.",
    "The Republican hopeful, upon taking deep offense over reporter Liam Bartlett referring to Donald Trump as \"your man Donald,\" had a bit of a meltdown, eventually leading to her storming out of the interview entirely.",
    "Perhaps in Australia because you’ve given your rights away, you’ve melted down all your guns, and you guys have no freedom, you find that OK.\"\nFirst of all, the January 6 defendants have all been charged, etc.",
    "Lake went on for a minute about how Australians have no freedom and Americans have freedom because of the Second Amendment, and then claimed lack of guns was the reason Australia had very strict COVID laws.",
    "Nearly half a million people at any given time are incarcerated in the United States without having been convicted of anything, and much of the time this is because they cannot afford bail.",
    "Rather, those who returned to Australia during the height of the pandemic were required to quarantine for two weeks in a quarantine facility before being able to come back.",
    "So Lake in fact loves the idea of incarcerating people without charging them with crimes, we guess so long as those people are not conservatives.",
    "Ironically, perhaps, Lake herself has a history of announcing that she would like to see people arrested without specific charges of any kind.",
    "But apparently our terrified American children are just the price we have to pay so we can enjoy privileges like the January 6 insurrection.",
    "The first actual policy she proposed was that she wanted to arrest any \"OSHA goons\" trying to enforce COVID mandates in Arizona.",
    "Surely, there are a whole lot of people in the US who would have happily dealt with that to have their loved ones back again.",
    "On Sunday night, \"60 Minutes Australia\" aired an interview with Trump-endorsed Arizona gubernatorial candidate Kari Lake.",
    "Because of this and other measures taken to prevent the virus, the country has only had about 5,000 total deaths.",
    "As a result of these laws, deaths by firearms, including suicide by firearms, decreased 61 percent.",
    "What she's thinking of is the fact that many of them were or are in pretrial detention — i.e.",
    "She has called for the jailing of journalists, leading her audience in a \"Lock them up!\"",
    "[60 Minutes Australia]\nWonkette is independent and fully funded by readers like you.",
    "It's only one percentage point, but that's still enough to be concerned.",
    "It’s frightening, and if you can’t see that, I feel sorry for you.\"",
    "She has also stated her desire to arrest people for being homeless.",
    "being held in jail without having been convicted of anything.",
    "Working for OSHA is not a known criminal offense of any kind.",
    "Lake also clearly does not understand Australian gun laws.",
    "Maybe they get away with that stuff in Australia.",
    "Of course she made up several of those \"laws.\"",
    "chant last year, saying, \"They should be!",
    "I mean some of them probably should be.\"",
    "There were no \"COVID internment camps.\"",
    "And that was all in just three minutes!",
    "Follow her on Twitter at @RobynElyse",
    "How often would you like to donate?",
    "Over 700 of them have been charged.",
    "There are still guns in Australia.",
    "That is super-American.",
    "Click below to tip us!",
    "US American, anyway.",
    "Part of one, anyway.",
    "chant last year.",
    "Lots of them."
  ]
}