{
  "id": 1197,
  "mediaId": 2520,
  "date": "2022-02-13",
  "headline": "What should Arizona governor and legislative candidates be saying about water?",
  "image": "https://www.gannett-cdn.com/presto/2021/12/22/PPHX/b622da19-95e2-4cd0-b87e-c387dab6319c-NDrip_10202021_AT_016.JPG?crop=2499,1406,x0,y249&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/joannaallhands/2022/02/13/what-should-arizona-governor-legislative-candidates-say-water/6653452001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joanna Allhands",
  "authorUrl": "https://www.azcentral.com/staff/2648428001/joanna-allhands/",
  "termIds": [
    2706,
    2344,
    4685,
    4052,
    5949,
    6515
  ],
  "sentences": [
    "Lake says that Arizona should work with the federal government, other states and Mexico to invest in desalination as a long-term solution, while working on shorter-term solutions like increasing our capacity to store water on the Salt and Verde rivers, capturing more storm runoff and expanding water recycling and reuse.",
    "Even if water doesn’t become a major talking point in 2022, candidates better spend some time boning up on the basics and articulating not only where they stand on key issues, such as how and where we grow (and who pays for it), but how they would balance a billion competing interests with valid uses for water.",
    "A lot could happen with water on their watch\nBig, thorny water issues are going to arise in the next few years, and if the next governor and Legislature aren’t anticipating them, they are going to get slapped with even tougher choices and lousy solutions.",
    "Doug Ducey’s plan to invest $1 billion in augmentation ideas, including but not limited to desalination in Mexico, the next governor and Legislature will be tasked with funding the final two years of that investment.",
    "Gaynor says the federal government should build desalination plants along the West Coast and once they start producing, California should cede some of its Colorado River water “to inland states” like Arizona.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "In fact, we’re paying cities, tribes and irrigation districts millions of dollars not to use their Colorado River water, simply to keep the lake from going any lower than a Tier 3 shortage.",
    "We need elected leaders who can build coalitions and find compromises, a governor and Legislature that is willing to tackle water issues head on instead of kicking the can.",
    "Some bills have been proposed this session to address that, but more are expected – particularly as problems in Pinal replicate in parts of metro Phoenix in coming years.",
    "Residential wells are already going dry in some rural areas, and the Pinal Active Management Area has been told that it can no longer grow solely on groundwater.",
    "The next governor may not be intimately involved in this work, but whoever he or she appoints as director of the Arizona Department of Water Resources will.",
    "Karrin Taylor Robson and Aaron Lieberman offer vague references to water on their websites, while Matt Salmon, Katie Hobbs and Marco Lopez don’t mention it.",
    "Consider that:\nA Tier 3 shortage – deep enough to cut into the supplies of metro Phoenix’s largest cities – is nearly guaranteed on Lake Mead before 2026.",
    "But it’s not for 2024 through 2026, when deepening shortages will make finding the water necessary to keep the lake from tanking even more difficult.",
    "What we need from the next governor, Legislature\nWhat we do know is that it takes time to understand the potential implications of water policies.",
    "It’s more of an enigma in the House and Senate, partly because we don’t fully know who’s running yet, but also because of heavy turnover.",
    "These could be tense negotiations that require a lot of diplomacy – and, potentially, a legislative signoff on Arizona’s role.",
    "That plan, which requires saving an additional 500,000 acre-feet of water in Lake Mead each year, is funded for 2022 and 2023.",
    "Several lawmakers who have been most active in water issues are leaving, including Rep. Regina Cobb and Sen. Lisa Otondo.",
    "Arizona’s water work has long been bipartisan, driven more by parochial interests than a rigid “R” or “D” ideology.",
    "The seven basin states also must settle on a new set of operating rules for the Colorado River before 2027.",
    "And this next Legislature will not have much time to get up to speed before things start hitting the fan.",
    "Kari Lake has posted the most detailed water platform in the governor’s race, followed by Steve Gaynor.",
    "If you love this content (or love to hate it – hey, I won't judge), why not subscribe to get more?",
    "And no one wants it to become a political football, a la what we’ve done to COVID-19 and schools.",
    "Lake and Gaynor focus heavily on the need to find more water for the state to continue growing.",
    "This could be one of the most consequential appointments the next governor will make.",
    "And that’s not even close to an exhaustive list of what we might be facing.",
    "Meanwhile, groundwater problems will continue to grow in intensity.",
    "He also mentions investing in water conservation and recycling.",
    "But that doesn’t mean water should be an election afterthought.",
    "Water policy is far too complex to distill into a soundbite.",
    "Not to mention that if this year’s Legislature passes Gov.",
    "The way things are going, they might not have much choice.",
    "Water will not be a driving issue in the 2022 election.",
    "Reach Allhands at joanna.allhands@arizonarepublic.com.",
    "How are candidates planning to respond?",
    "Both emphatically tout desalination.",
    "How might candidates respond?",
    "On Twitter: @joannaallhands.",
    "Nor should it be."
  ]
}