{
  "id": 12638,
  "mediaId": 8428,
  "date": "2022-03-02",
  "headline": "Judge DENIES Arizona Democrat’s request to break election law",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/02/katiehobbs.jpg",
  "link": "https://www.rsbnetwork.com/news/judge-denies-arizona-democrats-request-to-break-election-law/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Summer Lane",
  "authorUrl": "https://www.rsbnetwork.com/author/summer-lane/",
  "termIds": [
    0
  ],
  "sentences": [
    "Arizona Senate Republicans called the ruling against Hobbs a “major victory for AG Brnovich and the rule [of] law” on Twitter, with Kari Lake adding, “Lucky for Arizona, that run [Hobbs’] for office will end in defeat too.”\nHeading into an exciting and important election season in Arizona, Kari Lake is the only conservative candidate who can defeat Katie Hobbs, according to a previous report from RSBN.",
    "According to a ruling from the Superior Court of Arizona in Maricopa County, Hobbs, who was suing Arizona Attorney General Mike Brnovich for threatening to prosecute her if she shut down E-Qual, will not be allowed to shut down the system as she was requesting to do.",
    "“If she can’t play by the rules then she shouldn’t be running for Governor.”\nFor reference, the E-Qual system is often used by candidates to collect signatures that they “need to appear on the ballot,” according to a report from Fox 10.",
    "Arizona’s Secretary of State and current Democrat candidate for governor, Katie Hobbs, has been denied permission to effectively break state election laws to shut down the signature-collecting website, E-Qual.",
    "Lake, a Washington “outsider” and Trump loyalist, is poised to soar to victory as Democrat and Republican establishment politicians continue to trail behind her in the polls leading up to November.",
    "Maintaining election integrity has been one of Lake’s primary concerns, and Hobbs’ defeat in court has scored another win for proponents of free and fair elections in Arizona.",
    "A Data Orbital Polling and Press poll in February found that Lake will likely fare well among Arizonans, with a projected 42.7 to 41.1 percent lead in the race right now.",
    "Hobbs was requesting that she shut down her E-Qual system in order to complete an update ahead of an April 4 deadline related to congressional redistricting.",
    "This is important to note because candidates must gather enough signatures in order to appear on the ballot as a candidate.",
    "Republican and Trump-endorsed candidate for governor, Kari Lake, commented on the ruling on Twitter.",
    "“Katie Hobbs’ attacks on Arizona elections just hit a major setback,” she stated."
  ]
}