{
  "id": 12682,
  "mediaId": 2662,
  "date": "2022-03-04",
  "headline": "POLL: Trump-Endorsed Arizona Gubernatorial Candidate Is The ONLY Republican Who Can Beat Radical Leftist Soros Funded Katie Hobbs",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/A667597F-3208-44E2-9BF9-C6CC35A5E344.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/03/poll-trump-endorsed-arizona-gubernatorial-candidate-republican-can-beat-radical-leftist-soros-funded-katie-hobbs/",
  "mediaOutlet": "progressivestoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Conradson",
  "authorUrl": "https://www.thegatewaypundit.com/author/jordanc/",
  "termIds": [
    4623,
    2706,
    2765,
    1126,
    5949,
    6515
  ],
  "sentences": [
    "With her commanding position in recent primary surveys and her strong performance against Democrat Katie Hobbs, Kari Lake is the Republican frontrunner in the Arizona Gubernatorial race.”\nThis poll of 1,000 likely general election voters was conducted through a live survey that collected 50.7% of the results from landlines and 49.3% from cell phones.",
    "Judge Denies Arizona Secretary of State Katie Hobbs’ Request To Block Arizona AG Brnovich From Potentially Prosecuting Election Law Violations\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nKari Lake has been on the frontlines of the fight to fix 2020.",
    "Arizona Gubernatorial Candidate Kari Lake DESTROYS Fake News Media – Kari’s First Political Ad Will Expose the BS on Arizona Stations During Their News Programs\nAfter the primary election, Lake will likely take on election thief and twice proven racist, Katie Hobbs.",
    "https://t.co/f6Bg3mLjxN\n— Kari Lake for AZ Governor (@KariLake) February 22, 2022\nThe Data Orbital poll of 1,000 likely general election voters shows that nobody but Kari Lake can beat Katie Hobbs in the general election.",
    "President Trump endorsed Kari Lake because she will secure the southern border, fight against medical tyranny, fight for election integrity, and she is a skilled news veteran who makes fake news look like idiots.",
    "Lake is the only candidate that toured the Arizona audit floor, and she is the only candidate calling for decertification of the 2020 election and the arrest of Katie Hobbs for the crime of the century.",
    "A new 2022 Arizona gubernatorial poll shows Trump-endorsed Kari Lake is the only candidate who can beat George Soros-funded Arizona Secretary of State Katie Hobbs in the general election for Governor.",
    "After a federal Jury agreed twice that Talonya Adams was a victim of Hobbs’ discrimination, the abused former staffer called for Hobbs to resign from office and drop out of the race for Governor.",
    "BREAKING: @KariLake expands lead in #Arizona's #2022 #GOP Governor primary per latest tracking poll released today via @Data_Orbital: Lake now at 43%, Salmon-15%, Taylor Robson-13% & Gaynor-4%.",
    "Hobbs is currently facing a lawsuit by the AZGOP and potential prosecution from the Arizona Attorney General for her 2022 election law violations and Arizona’s fraudulent 2020 election.",
    "Pollster George Khalaf had this to say about the latest results, “With all statewide offices up for grabs this year, Arizona once again finds itself in the center of the limelight.",
    "Those looking for leak in Lake still searching as her #s increased despite attacks\n— Jason Rose PR (@jasonrosepr) March 4, 2022\nPresident Trump made another excellent choice!",
    "We offer precise data solutions, informed by political and policy intelligence, so our clients can chart the right course through the corporate or political landscape ahead.",
    "Phoenix, AZ (February 22, 2022) Data Orbital is pleased to announce the results of its latest statewide, live-caller survey of likely general election voters.",
    "With a little more than eight months until the General Election, the share of voters that are “Undecided” on the race is close to 20% across the board.",
    "While there has been chatter among insiders surrounding general election viability for Kari Lake, it is clear voters do not share those same concerns.",
    "With a little more than eight months until the 2022 General Election, Kari Lake is currently besting her fellow Republican challengers.",
    "ABOUT DATA ORBITAL:\nData Orbital is a full-service data solutions and survey research firm with local, state, and national experience.",
    "Respondents were weighted on a number of different demographic figures based on prior general election voter turnout figures.",
    "As of this morning, Kari Lake has boosted her lead in the GOP primary even more, and she is expected to win by a landslide.",
    "Radical leftist Secretary of State Katie Hobbs stole the 2020 election, and she is trying again with the 2022 election.",
    "With little data publicly available, the survey focused on the upcoming, hotly contested race for Governor in Arizona.",
    "All non-released questions would not reasonably be expected to influence responses to all released questions.",
    "Katie Hobbs is toast in the general election if she’s not already in prison for election fraud.",
    "All other candidates lose to Katie Hobbs, with RINO Matt Salmon coming closest at 39.3%-40.7%.",
    "The survey tested all four Republican candidates against likely Democrat nominee Katie Hobbs.",
    "The Legendary Mike Lindell is joining us on March 5th for Arizona’s FIRST-EVER Rodeo Rally!",
    "Join us for Food, Bull Riding, Roping Live Music & hear from some Patriotic Speakers ????",
    "pic.twitter.com/QrN0blIOd2\n— Kari Lake for AZ Governor (@KariLake) February 14, 2022",
    "Sign up for Kari Lake’s rodeo rally with Mike Lindell tomorrow in Morristown, AZ!",
    "The latest polling data shows that Arizona knows the 2020 election was a sham.",
    "It had a margin of error at plus or minus 3.1% with a 95% confidence interval.",
    "The questions released are verbatim from the survey provided to respondents.",
    "I am the ONLY Republican in the Governor's Race who can beat Katie Hobbs.",
    "New poll from most accurate and respectable pollster in AZ @Data_Orbital.",
    "The survey was conducted from February 11th to February 13th.",
    "The poll was conducted from February 11 – February 13, 2022.",
    "Crosstabs for this survey are available upon request.",
    "Lake beats Hobbs 42.7%-41.4% with 15.4% undecided.",
    "Toplines and demographic data can be found here.",
    "Visit https://t.co/p1sxAyd0os for tickets!",
    "INCREDIBLE!",
    "HUGE!",
    "??"
  ]
}