{
  "id": 13677,
  "mediaId": 8326,
  "date": "2022-03-16",
  "headline": "'I love Andy Biggs': Book says Sen. Kyrsten Sinema praised him after Jan. 6",
  "image": "https://www.gannett-cdn.com/presto/2021/07/06/PPHX/07d28ef7-f93f-4d81-b3fa-0b683f6d0284-AP21175638408272.jpg?crop=1023,576,x0,y52&width=1023&height=576&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/03/16/i-love-andy-biggs-book-says-kyrsten-sinema-praised-him-after-jan-6/7059941001/",
  "mediaOutlet": "Gilbert Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald J. Hansen",
  "authorUrl": "https://www.azcentral.com/staff/2647673001/ronald-j-hansen/",
  "termIds": [
    0
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nIn another passage, the authors said in the spring of 2021, Sinema was \"the first-ever lawmaker to argue with White House aides when they asked her to wear a face mask in the company of the president, repeatedly asking why that was necessary when she had been vaccinated.\"",
    "\"This Will Not Pass: Trump, Biden and the Battle for America's Future\" is an account of the shift from former President Donald Trump to the Biden administration, but it adds new detail to the image of Sinema, D-Ariz., often at odds with her own party and who took Republican positions on several fronts, from tax policy to combating the spread of COVID-19.",
    "In a passage about negotiations over Biden's stalled \"Build Back Better\" agenda, authors Jonathan Martin and Alexander Burns, both reporters for the New York Times, use unnamed sources to describe a September fundraiser Sinema attended with Republican-friendly business groups.",
    "She told one unnamed Republican senator she believed there were up to six other Democratic lawmakers who agreed with her on policy matters but were content “hiding behind my skirt.”\nReach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493.",
    "“I know some people think he’s crazy, but that’s just because they don’t know him.”\nSinema has had a long-standing friendship with Biggs and has joked at Phoenix-area business events they both attended in years past about what may have seemed an unlikely relationship.",
    "Sen. Kyrsten Sinema privately praised Rep. Andy Biggs months after the Jan. 6 attack on the U.S. Capitol many suspect he helped stoke, and she questioned why she needed to wear a mask in an early 2021 meeting with President Joe Biden, a new book says.",
    "And that’s about where it ends.”\nAt the same event, Sinema, the book says, also had kind words for Biggs, R-Ariz., who has faced calls for an ethics and criminal investigation after promoting the false narrative of a stolen election in 2020.",
    "\"I don't think it makes sense to design your policy based on whether or not there are enough hospital beds for people to die in,\" she said in a June 2020 interview with \"The Gaydos and Chad Show\" on KTAR-FM (92.3 FM).",
    "Sinema on Tuesday was one of eight Democratic senators, including Sen. Mark Kelly, D-Ariz., to side with Republicans on a vote to end the federal masking mandate on planes and other public transit.",
    "Sinema told the groups there were elements of the package she liked, such as the child tax credit and provisions intended to address climate change, a position she publicly discussed as well.",
    "Sinema described him as a “dear friend.” Both served in the Arizona Legislature, and Sinema has long cast herself as willing to work across the aisle to advance her legislative priorities.",
    "\"I think we should be designing our policy about how do we reduce the spread, so fewer people are dying, fewer people are in the hospitals and fewer people are contracting the virus.",
    "At the outset of the pandemic, Sinema urged Arizona Secretary of State Katie Hobbs to delay the March presidential primary and publicly condemned Gov.",
    "The groups opposed a bill trying to merge the version that passed the House of Representatives and a slimmer outline being considered in the Senate.",
    "“And I’m interested in maintaining pro-growth tax policies that ensure that we can get through this pandemic without losing ground.",
    "Other Democrats in Arizona and elsewhere broke off relations with those they viewed as especially culpable for the Capitol riot.",
    "The book says White House aides thought Sinema \"sounded more like Mitt Romney than a member of Biden’s own party.\"",
    "Sinema's office declined to comment about the forthcoming book, which they characterized as \"unsourced rumors.\"",
    "That came on the heels of Biden's State of the Union address in which no one was asked to wear masks.",
    "And we can do that while also safely reopening our businesses and our economy.\"",
    "That would have been a significant shift from her early stance on the pandemic.",
    "But Sinema then reportedly offered views that were a \"delight\" to her audience.",
    "“I come from a fiscally conservative state,” she said, according to the book.",
    "Doug Ducey for not following scientific guidance on managing the disease.",
    "“Arizonans don’t like taxes, and we don’t really like government.",
    "“I love Andy Biggs,” Sinema said, according to the book.",
    "Subscribe to our free political podcast, The Gaggle.",
    "Follow him on Twitter @ronaldjhansen.",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "That should be our focus.",
    "And we love our military.",
    "We love our country."
  ]
}