{
  "id": 15261,
  "mediaId": 2520,
  "date": "2022-03-05",
  "headline": "Marco López, Democratic candidate for Arizona governor, linked to bribery scheme in Mexico",
  "image": "https://www.gannett-cdn.com/-mm-/40cc0ca38b80832c04f35aa97b527f1b8b6b529d/c=0-78-600-417/local/-/media/2017/02/02/Phoenix/Phoenix/636216399050775886-marco-lopez.jpg?width=600&height=339&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/elections/2022/03/05/gubernatorial-candidate-marco-lopez-linked-bribery-scheme-mexico/9379789002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stacey Barchenger",
  "authorUrl": "https://www.azcentral.com/staff/2646476001/stacey-barchenger/",
  "termIds": [
    4916,
    4685,
    4623,
    3663,
    392,
    6383,
    6005,
    5949
  ],
  "sentences": [
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\nPolitical fallout in governor's race\nBeing linked to the scandal gave ground to López's political opponents for the Democratic nomination for governor and drew mixed responses from López's supporters.",
    "Federal U.S. prosecutors charged Odebrecht bribed foreign government officials and political parties in a dozen countries, in such an evolved scheme that it established a department within the company that \"effectively functioned as a stand-alone bribe department,\" according to statements from prosecutors.",
    "An international bribery scheme that funneled nearly $800 million to a dozen countries, snared political leaders and became a key data point driving efforts to curb corruption in Mexican politics is casting its shadow on Arizona Democratic gubernatorial candidate Marco López.",
    "Former state representative Aaron Lieberman, who is also seeking the nomination, declared himself the best candidate, pointing to López's tie to the bribery scheme and Hobbs' role in firing a Senate staffer years ago in a case that is costing taxpayers over $750,000.",
    "\"Arizonans want their schools to be fully funded and for the state to implement sustainable solutions to climate change, not the embarrassment of being associated with scandal-plagued politicians,\" Lieberman said in a statement.",
    "The payment came to light in 2020 when a Mexican investigative news organization, Mexicanos Contra la Corrupción y la Impunidad, published leaked receipts and records that had been given to the Mexican Attorney General's Office.",
    "Lozoya told investigators in mid-2020 that Peña Nieto, on whose campaign Lozoya worked, and a top aide ordered him to use the bribe money to pay consultants working on the campaign and to influence policy.",
    "The company ultimately agreed to pay billions of dollars to the United States, Brazil and Switzerland because of what U.S. prosecutors dubbed \"a massive and unparalleled bribery and bid-rigging scheme.\"",
    "The records obtained by the Agenda and Mexican news organization show the payments to López's firm went through a Swiss bank account and a company managed by the alleged middleman of the bribery scheme.",
    "He told The Arizona Republic in a written statement that he and his business did nothing wrong and said he could not have been aware of a bribery scheme that led to charges against others years later.",
    "López has been connected to the case after reports that his company, while doing work a decade ago for an adviser to former Mexican president Enrique Peña Nieto's campaign, profited from the scheme.",
    "The fund is the political advocacy arm of the nonprofit with the same name that focuses on eradicating health, housing and economic inequity and has close ties to Arizona's political class.",
    "Intermestic Partners was hired by Lozoya to run security checks, work that was not affiliated with the Peña Nieto campaign, López wrote in response to written questions from The Republic.",
    "That middleman, Emilio Lozoya, later began cooperating with Mexican prosecutors in hopes of reducing his own punishment, according to the Associated Press.",
    "Separate from that work, López said he offered informal advice to Peña Nieto's campaign on border security, never receiving a formal title.",
    "\"CPLC Action Fund PAC stands behind its endorsement of Marco López for governor,\" said Joseph Garcia, executive director of the fund.",
    "Odebrecht pled guilty in 2016 to a charge of conspiracy to violate the anti-bribery provisions of the Foreign Corrupt Practices Act.",
    "Lozoya faces charges he accepted more than $4 million in bribes from Odebrecht, a construction contracting firm based in Brazil.",
    "\"I strongly dispute the notion that I or Intermestic did anything wrong with regard to the payment in question,\" López wrote.",
    "Sophia Carrillo Dahl, president of the Creighton School District governing board in Phoenix, endorsed López in mid-February.",
    "The invoice for the work says López provided two months of \"advisory services\" for something called the \"Colombia project.\"",
    "She wrote on Twitter on Friday, responding to the news of López's involvement, that she was \"disappointed and outraged.\"",
    "The influential Chicanos Por La Causa Action Fund, which endorsed López in December, didn't change its stance.",
    "\"I am proud of the business that I, the son of working class immigrants, built from the ground up.",
    "The Arizona Agenda, a politics newsletter, was the first to detail López's involvement this week.",
    "\"This isn’t about winning but, rather, about restoring decency to our politics here in Arizona.\"",
    "Reach reporter Stacey Barchenger at stacey.barchenger@arizonarepublic.com or 480-416-5669.",
    "Secretary of State Katie Hobbs, the Democratic frontrunner, declined to comment.",
    "López said it was a one-time job and said he did not receive more than $35,000.",
    "At least $35,000 was paid to López's company, Intermestic Partners, in 2012.",
    "Dream big, and if you work hard, you can accomplish anything here.",
    "I’ve worked hard, played by the rules, and I’ve been successful.",
    "López has not been charged in the multi-pronged investigation.",
    "\"My parents always told my sister and I, 'sueñen grande.'",
    "Peña Nieto was president from 2012 to 2018.",
    "I’m not going to apologize for that.\"",
    "One payment went to López's company.",
    "Follow her on Twitter @sbarchenger.",
    "Subscribe to azcentral.com today.",
    "Support local journalism."
  ]
}