{
  "id": 1585,
  "mediaId": 8475,
  "date": "2022-02-15",
  "headline": "Leftist ASU student groups allege infiltration by Kari Lake campaign staffers",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/021522_kari-lake-trump-florence-gs.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/021522_kari_lake_activists/leftist-asu-student-groups-allege-infiltration-by-kari-lake-campaign-staffers/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    0
  ],
  "sentences": [
    "Students for Socialism said two of the five are ASU students, and that the coalition contacted university administration alleging that they violated provisions in the Arizona Board of Regents’ code of conduct for students that prohibit impersonation, interfering with university-sponsored activities, stalking and harassment.",
    "The groups that organized the meetings have pretty left-wing politics, Lopez said, and aren’t really involved in Democrat-versus-Republican “culture debates,” making the comments about the governor’s race stand out, especially given how out-of-context they were with the rest of the meeting.",
    "And they began talking about how they were big fans of Hobbs and how much they disliked Lake, though the gubernatorial race hadn’t been a topic of discussion and had nothing to do with the anti-sexual assault message the organizations were trying to promote with their protest.",
    "Students for Socialism ASU tweeted its allegations on Friday, saying the organizations involved in the protest planning had compared photos of the supposed infiltrators, who joined the coalition using fake names, to photos of Lake campaign team members from social media.",
    "The alleged Lake campaign team members attended several meetings organized by Students for Socialism, Sun Devils Against Sexual Assault, MECHA de ASU, Students for Justice in Palestine, Young Democratic Socialists of America and El Concilio.",
    "He said they also identified some as participants in a protest at ASU supporting Kyle Rittenhouse, the Illinois teenager who was acquitted of murder after shooting three people during a protest over a police shooting in Kenosha, Wisc.",
    "Lopez said the phone numbers that the five provided to join the coalition’s internal communications quickly led back to their social media pages, which included their real names and identified them as members of Lake’s campaign.",
    "Daniel Lopez, an officer with Students for Socialism, said the five Lake campaign members attended multiple meetings without drawing attention to themselves, initially hanging out at the back of the meetings and saying little.",
    "Local\nFive members of Kari Lake’s campaign team attempted to infiltrate planning meetings for an anti-sexual assault protest organized by a coalition of leftist student groups at Arizona State University, the groups alleged.",
    "It’s like a very scary thing when you’re … a group of clubs and organizations that have undocumented students, you have students of color and you have students who face harrassment on campus,” Lopez said.",
    "Rather than give them the opportunity to get any undercover video or claim harassment by the groups, they declined to confront the infiltrators directly, instead announcing on Twitter what had happened.",
    "Students for Socialism said the group is asking GCU, which is a private school not bound by ABOR’s code of conduct, to recognize that those two students are in violation of several of those provisions.",
    "Members of the student groups became suspicious after the purported Lake campaign members made statements espousing conservative talking points and unsuccessfully tried to mimic progressive ideals.",
    "The groups began to suspect the new recruits were actually conservative operatives trying to infiltrate the group, perhaps with the intent of taking covert videos to discredit them or others.",
    "“Until someone opens their mouth, it’s really difficult to tell the difference between someone who’s supposed to be there and someone who’s not,” Lopez told the Arizona Mirror.",
    "The Lake people began making comments critical of the People’s Republic of China, alleging that the communist country was trying to control the U.S. and was using slave labor.",
    "One immediately hung up his phone when he was informed that he was speaking with a reporter from the Mirror, while contact information for the fifth could not be found.",
    "A high school Democratic organization called the Keep Arizona Blue Student Coalition has since said they were contacted by the Lake campaign workers, as well.",
    "One of the five told people that her pronouns were “she” and “it,” appearing to mock people who specify their pronouns in order to be trans-inclusive.",
    "Ross Trumble, a spokesman for Lake, said the five weren’t acting on behalf of the campaign when they infiltrated the coalition of leftist groups.",
    "They also aroused suspicion by making out-of-place comments critical of Lake and supportive of Democratic gubernatorial frontrunner Katie Hobbs.",
    "The groups were planning a Feb. 17 protest against what they say is ASU’s inadequate efforts to prevent or respond to sexual assault on campus.",
    "The groups held off on setting up additional meetings after that incident so they could decide what to do about the suspected infiltrators.",
    "Lopez said they suspected that the infiltrators may have been attempting to get incriminating videos in the style of Project Veritas.",
    "It wasn’t until a Feb. 7 event where they gathered to make signs for the upcoming protest that organizers became suspicious.",
    "“We can make assumptions about what they were trying to do, but we don’t actually know what they were trying to do.",
    "One created a sign with the message, “Hey, students for Kari, you’re not welcome here.”\nLike what you're reading?",
    "The individuals involved will be disciplined internally,” Trumble said in a statement provided to the Mirror.",
    "“It’s really unclear what they were trying to do, because they didn’t do it super well,” Lopez said.",
    "Lopez said they also hoped to alert other groups that may have been infiltrated by the Lake people.",
    "Trumble wouldn’t say how they would be disciplined or whether they would remain on the campaign.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "New people attend these kinds of events all the time, Lopez said, so nothing seemed amiss.",
    "Spokespeople for ASU and GCU did not respond to messages from the Mirror.",
    "“The Lake campaign does not condone any of these activities.",
    "Three of the five did not return messages from the Mirror.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "Two of the others attend Grand Canyon University.",
    "Thanks for reading TucsonSentinel.com.",
    "- 30 -"
  ]
}