{
  "id": 17172,
  "mediaId": 8475,
  "date": "2022-03-04",
  "headline": "Hobbs: Arizona should have state child tax credit, more help for working families",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/030422_hobbs-katie.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/030422_hobbs_families/hobbs-arizona-should-have-state-child-tax-credit-more-help-working-families/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "",
  "termIds": [
    4623,
    3207,
    2915,
    1489,
    5949,
    6515,
    6667
  ],
  "sentences": [
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nExempting feminine hygiene products from sales taxes would cost about $7 million per year, based on previous legislative analyses of similar proposals at the Capitol.",
    "Working families across Arizona have been feeling the strain of inflation and broken economic policies on their pocketbooks, and our leaders are not working in the best interests of all Arizonans to tackle these challenges,” said Hobbs, a former legislator who has served as Arizona’s secretary of state since 2019.",
    "Under Arizona’s last Democratic governor, Janet Napolitano, the state massively increased spending on education and social programs during a major economic boom, only to see those programs cut under her Republican successor, Jan Brewer, amid an unprecedented budget crisis caused by the Great Recession.",
    "Democratic gubernatorial frontrunner Katie Hobbs is calling for a handful of new tax credits and sales tax exemptions aimed at helping working families, including child care assistance and a state-level version of a recently expired federal child tax credit.",
    "But COVID laid bare just how invisible and underappreciated child care efforts can be for so many families,” Hobbs said at a press conference Thursday to announce her plan at the Carpenters Local Union 1912 in Phoenix.",
    "If elected governor, Hobbs said she’ll also push for sales tax exemptions for diapers and baby formula, over-the-counter medicine and feminine hygiene products, and a sales tax holiday for school supplies.",
    "Republicans have controlled the Arizona House of Representatives since 1967, and have only lost control of the Senate for a total of six years during that same period.",
    "Even without a tax hike, Republican lawmakers are likely to balk at implementing the kinds of major social spending programs Hobbs is advocating for.",
    "The most expensive of the proposals would be the child care assistance program, which her campaign estimated would cost $400 million per year.",
    "“Right now, families are struggling, and we have the surplus and we should be using it to help families who are struggling,” she said.",
    "“There are no guarantees in life, but I certainly have a track record of working across the aisle and getting things done,” she said.",
    "“Too many people can’t afford to take the necessary steps to protect their health and well-being, or that of their children.",
    "Hobbs estimates that the program would apply to about 600,000 children, at an annual cost of about $147 milloin.",
    "Hobbs said Arizona’s current budget surplus would pay for the plan, and that it wouldn’t require a tax increase.",
    "She said she would be OK with keeping the historic income tax cuts that the legislature and Republican Gov.",
    "Hobbs said the state can pay for the plan without paying taxes by using its billion-dollar budget surplus.",
    "Nonetheless, she expressed confidence that she’d be able to get needed support from Republican lawmakers.",
    "Hobbs said that example shouldn’t dissuade anyone from enacting the proposals she unveiled on Thursday.",
    "Doug Ducey passed last year, though she criticized them as primarily benefitting wealthier Arizonans.",
    "Ducey is currently pushing an earned income tax credit for families with incomes of $50,000 or less.",
    "If Hobbs is elected governor, she’ll likely face an obstacle in a Republican-controlled legislature.",
    "Under the proposal, families with incomes of up to $100,000 would get $250 per child each month.",
    "She did not have dollar figures for all of the programs, though she had estimates for some.",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "Join Mary Ann Jones, Joan Kaye Cauthorn, and Donald Hartman and contribute today!",
    "The program mimics the federal child tax credit program that ended last month.",
    "And she wants a refundable tax credit for career and technical education.",
    "The package of proposals would cost more than a half billion dollars.",
    "They have faced compounding challenges long before the pandemic.",
    "The campaign did not have dollar figures for the other plans.",
    "“Arizona’s working families are the backbone of our economy.",
    "The other big-ticket item is the child care tax credit.",
    "The Senate approved the proposal in February.",
    "- 30 -"
  ]
}