{
  "id": 17324,
  "mediaId": 2745,
  "date": "2022-03-03",
  "headline": "Opinion Arizona Republicans keep churning out new election legislation targeting voting access",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ENRBIWDVQII6ZITNDQQ4C2Y4SM.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/03/03/arizona-republicans-target-voting-access/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4623,
    2938,
    1126,
    392,
    5949,
    6517,
    6667,
    6515
  ],
  "sentences": [
    "And the goal, she said, “is to try to exclude our most marginalized community members, who are often times Black, Indigenous and people of color; the working class and the working poor; people with disabilities.”\nArizona hasn’t yet shed its reputation as a place of exclusion and racism, even if in its largest cities, Phoenix and Tucson, White people are now in the minority.",
    "By 2021, Arizona ranked third in the country for the number of restrictive bills introduced, an increase no doubt fueled by former president Donald Trump’s dishonest diatribes about a stolen election and his resounding loss in a state no Democratic presidential nominee had won since Bill Clinton in 1996.",
    "Before she became the first Native American elected to countywide office in Pima County, she worked to increase civic engagement among the Tohono O’odham, whose ancestral land extends into Mexico and whose reservation includes 62 miles of the southern border, where Trump once planned to build a wall.",
    "1571 would permit the use of ballot drop boxes, but only if they are outfitted with 24-hour photo or video cameras, an onerous requirement in the remote rural and tribal lands of Arizona, where Internet connectivity is practically nonexistent and exactly where these boxes are needed most.",
    "The state pioneered online voter registration, allowed voters who signed up for it to automatically receive ballots by mail and offered voter-registration opportunities at its department of motor vehicles before the federal government made it a requirement.",
    "And authorities can still hold suspects in jail until their immigration status has been checked, one of the few provisions of the infamous “show me your papers” law of 2010 that the U.S. Supreme Court left in place in a ruling a decade ago.",
    "There’s a systematic attempt to keep communities of color — the new majority — as outsiders through policies that seek to undermine their chances of reaching higher and occupying a space in society that measures up to their numbers.",
    "The files clogged the desk of Pima County Recorder Gabriella Cázares-Kelly — 141 by early last week, she said, or almost 10 percent of all bills filed in the Republican-controlled Arizona legislature so far this year.",
    "“To see efforts to dismantle key aspects of our long-standing and effective election system, in pursuit of baseless conspiracies, is frustrating and disappointing,” Bo Dul, a former state elections director, told me.",
    "All of these challenges that have been magnified by the pandemic.”\nYou might think legislators should be focused on addressing these problems and not trying to use antidemocratic tactics to cling to office.",
    "2577, one of at least 37 similar bills in eight states this year that seek to impose new or more stringent requirements for in-person voting, according to an analysis by the Brennan Center for Justice..",
    "That means she has to be on top of every proposed change and, when warranted, articulate her position to lawmakers, whose job, in theory, is to represent the interests of the people of the state.",
    "Examples include a voter-approved proposition that barred undocumented immigrants from paying less expensive in-state tuition that is still on the books nearly 16 years after its passage.",
    "Arizona also often scores badly in matters such as educational attainment, per-pupil spending and covid-19 deaths, but at least its election system is something of a national model.",
    "She grew up on the western edge of the Tohono O’odham Nation, southwest of Tucson, in a small community nearly an hour by car from the closest post office and grocery store.",
    "1058, which would prohibit drive-up voting and the use of ballot drop boxes outside polling places, voting centers or election and county recorder’s offices.",
    "In Arizona, that would mean presenting an ID card issued only to voters who can show a birth certificate, passport or naturalization document when applying.",
    "Until 2018, the number of legislative proposals about elections and voting hovered around 50 per year, Cázares-Kelly, a Democrat, told me.",
    "Driver’s licenses and tribal membership cards would no longer be acceptable forms of identification.",
    "The election-related bills kept coming, most of them aimed squarely at restricting voting access.",
    "Some weeks ago, Cázares-Kelly hired two part-time workers to help her track this year’s bills.",
    "She is now general counsel for the Arizona secretary of state, Democrat Katie Hobbs.",
    "(A ballot question this year could change that, but its passage is not a sure bet.)",
    "Through her experiences, Cázares-Kelly has seen a “disparity of needs,” she said.",
    "“Part of the tactic is the overwhelming of the system,” Cázares-Kelly told me.",
    "A big part of Cázares-Kelly’s job is to administer elections.",
    "Yet, this is where we are, at 141 bills and counting.",
    "Who is thriving, and who is living on the edge?",
    "Cázares-Kelly knows about that firsthand.",
    "In the House, those efforts include H.B.",
    "“Who is getting help, and who is not?",
    "She’s still trying to catch up.",
    "In the Senate, there’s S.B.",
    "S.B."
  ]
}