{
  "id": 2358,
  "mediaId": 2560,
  "date": "2022-02-09",
  "headline": "State election officials survived Trump’s attacks. Will they survive the ballot box?",
  "image": "https://www.gannett-cdn.com/presto/2020/09/24/PDTN/41b67c72-f855-4756-9f6b-d0038fecfd07-2020-0924-dm-me-earlyvoting0547.jpg?crop=4444,2500,x983,y714&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.detroitnews.com/story/news/politics/2022/02/09/secretaries-state-survived-trumps-attacks-they-survive-ballot-box/6726285001/",
  "mediaOutlet": "Detroit News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arit John",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Los Angeles Times\nWashington – Michigan Secretary of State Jocelyn Benson and her 4-year-old son were settling in to watch “How the Grinch Stole Christmas” after putting up Christmas decorations when dozens of protesters descended on her home in December 2020 chanting “Stop the Steal” and “We want an audit.”\nBenson had been on the radar of President Trump and his allies since the spring, when he railed against her decision to send absentee ballot applications to all Michigan voters, calling her a “rogue Secretary.” But the late-night protest, marked by what she described at the time as “armed individuals shouting obscenities,” solidified her role as a central figure in the fight over control of American elections.",
    "Hice, a former conservative talk show host, told Trump supporters at a Georgia rally in September that Raffensperger had “massively compromised the right of the people at the ballot box” and “opened wide the door for all sorts of irregularities and fraud to march into our election system.”\nRaffensperger, meanwhile, has criticized Hice for challenging the certification of the presidential election but not his own reelection to Congress on the same ballot.",
    "“What I’m grateful for is that more voters than ever before will be paying attention to these important races.”\nThe Democratic Association of Secretaries of State has beefed up its operations ahead of the 2022 elections, hiring its first full-time staffer last April, Executive Director Kim Rogers, and raising a record $4.5 million between the group and its affiliated organizations in 2021.",
    "Democratic groups, donors and incumbents like Benson have raised record amounts to secure seats in battleground states, while Trump loyalists are running on his unfounded election fraud claims, challenging Democrats and Republicans like Georgia’s Brad Raffensperger in their bids to administer elections and sign off on the results.",
    "The effort to elect Trump allies has coincided with a push by Republican lawmakers in several states to shift duties away from secretaries of state, give legislatures more power over elections, and introduce steep fines for election officials who make technical mistakes or send absentee ballot applications to voters.",
    "Rogers said the group is focused on protecting incumbent election officials in Michigan, Colorado, Minnesota and New Mexico, holding on to the open seat in Arizona – where another high-profile Democratic secretary of state, Katie Hobbs, is running for governor – and on potentially flipping Nevada and Georgia.",
    "“[C]learly the work that we did to successfully defend democracy in 2020 has placed us in a greater spotlight.”\nSecretaries of state became household names in the last election as they worked to keep voters safe during the pandemic and debunk election misinformation spread by Trump and others.",
    "“It’s up to us to stop them from continuing to erode public confidence in our elections and to support Republican secretaries of state in their efforts to make it easier to vote and harder to cheat,” RSLC communications director Andrew Romeo said in a statement to The Times.",
    "In response, conservative activists have launched petition drives, including one that would impose stricter voter ID laws, ban donations to local election offices and block local election officials from sending unsolicited absentee ballot applications.",
    "He compared the campaign to a now-defunct group launched by liberal activists in 2006 to help elect Democratic secretaries of state following losses in the 2000 and 2004 presidential elections that they blamed in part on Republican election officials.",
    "“We’ve always said that the states are the last line of defense,” Rogers said, adding that she expects interest in state-level politics to increase in the wake of last month’s failed effort to advance voting rights legislation in the U.S. Senate.",
    "Marchant, who as of now has not been endorsed again by Trump, said allies of the former president encouraged him to forgo a second congressional campaign in favor of running to oversee elections and reaching out to like-minded candidates.",
    "He has also touted the audit of Maricopa County’s 2020 election results, though the review failed to find evidence of fraud, and recently co-sponsored legislation to give the Legislature the power to reject election results.",
    "As the 2022 midterms approach, Benson said she and her staff are meeting with voters to answer questions about election security, encouraging them to attend the testing of election equipment and volunteer to be poll workers.",
    "Trump’s endorsed candidates are part of a coalition of pro-Trump “America First” secretary of state candidates, according to Nevada’s Jim Marchant, a former Republican state representative running to lead elections there.",
    "The powers of the secretary of state are set by state constitutions and election laws, safeguarding against a secretary “going rogue,” said Rebecca Green, co-chair of the Election Law Program at William & Mary Law School.",
    "“Secretaries of state are, in the battle over the future of our democracy, serving on the front lines,” said Benson, who is expected to soon announce her reelection plans, in an interview with the Los Angeles Times.",
    "Although efforts to transfer power from election officials to lawmakers have been successful in Republican-controlled states, they have stalled in states with split government such as Michigan, where Democratic Gov.",
    "The Republican State Leadership Committee, which helps to elect Republicans to a range of down-ballot positions, including secretaries of state, raised $33.3 million in 2021, a $14 million increase from 2019.",
    "From Benson’s absentee ballot applications, to Raffensperger’s rejection of Trump’s request to “find 11,780 votes” – their decisions highlight the outsize role these officials increasingly play in elections.",
    "Trump has endorsed three candidates in those races, including a man seen outside the Capitol during last year’s Jan. 6 attack who has also acknowledged ties to the far-right Oath Keepers group.",
    "“Having the person who oversees elections fundamentally believe in the process and in democracy is a pretty important message right now,” said Rogers, of the Democratic secretaries group.",
    "He has also backed Kristina Karamo in Michigan, who rose to prominence in conservative media after claiming she saw fraudulent absentee ballot counting during the 2020 election.",
    "Karamo testified before a Michigan Senate committee investigating election fraud allegations, which found no evidence of widespread or systematic fraud in the state’s election.",
    "Benson’s decision to send absentee ballot applications ahead of the election helped lead to a record turnout of the state’s 7.7 million registered voters.",
    "She has also out-raised Karamo 7 to 1, collecting $1.6 million in 2021, compared with Karamo’s $228,000, according to recent campaign finance reports.",
    "A January Quinnipiac poll found that 57% of voters surveyed said they did not believe that there was widespread voter fraud in the 2020 election.",
    "“I anticipate the cost of running for secretary of state to more than double this year, because of that additional scrutiny,” Benson said.",
    "In the last two years they have increasingly been responsible for building trust in election processes and in those who administer them.",
    "In Georgia, last year’s election overhaul replaced Raffensperger as the head of the State Board of Elections with a political appointee.",
    "The Georgia secretary has also suffered political consequences: a well-funded primary challenge from Hice and censure by the state GOP.",
    "“We should anticipate that future election subversion efforts will be more sophisticated, and strategic, and perhaps even successful.”",
    "Finchem has acknowledged ties to the far-right Oath Keepers group and was seen outside the Capitol during last year’s Jan. 6 attack.",
    "Trump’s Save America PAC has made donations from $5,000 to $7,000 to his favored candidates in Arizona, Georgia and Michigan.",
    "If elected, Karamo and other Trump-backed candidates wouldn’t be able to unilaterally change election laws and procedures.",
    "In Arizona, lawmakers blocked Hobbs, the Democratic secretary of state, from representing the state in election cases.",
    "It was anticipating the level of doubt, falsehoods and concerted efforts to overturn the results that followed.",
    "He has brought Georgia Rep. Jody Hice and Arizona state Rep. Mark Finchem onstage to speak at recent rallies.",
    "A second petition would create a powerful new board to audit election results, including the 2020 election.",
    "Marchant sued unsuccessfully to request a new election, claiming he was a victim of voter fraud.",
    "The challenge of the 2020 election wasn’t administering it or tabulating the results, she said.",
    "But a secretary’s greatest power might be their role as the face of a state’s election system.",
    "Two dozen states will hold elections this fall to determine who oversees their elections.",
    "Karamo has led fundraising among Republicans vying for the party’s nomination in April.",
    "Still, election officials wield significant power to interpret and implement the rules.",
    "“Though the 2020 effort to overturn a presidential election was a failure,” she said.",
    "The petitions need 340,000 valid signatures to advance to a vote in the Legislature.",
    "However, 71% of Republicans said they did believe there was widespread voter fraud.",
    "Marchant received Trump’s endorsement in his failed congressional bid in 2020.",
    "“We’re just learning from them, and we’re going to counter that,” he said.",
    "Of the 5.5 million votes cast, nearly two-thirds were absentee ballots.",
    "Gretchen Whitmer vetoed new voting laws from the GOP-held Legislature.",
    "Early indicators suggest Benson has fundraising and name advantage.",
    "And anything a secretary of state does can be challenged in court.",
    "The stakes have increased heading into the 2022 midterm elections.",
    "But Democrats say they don’t take those numbers for granted.",
    "The board now has power to take over local election boards.",
    "Karamo did not return requests for an interview.",
    "A recent poll showed her with a 14-point lead.",
    "If passed, they cannot be vetoed."
  ]
}