{
  "id": 3023,
  "mediaId": 2512,
  "date": "2022-01-28",
  "headline": "Rachel Maddow slams Arizona AG for failure to deal with electors scandal",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29186427&width=1200&coordinates=0%2C0%2C0%2C5&height=600",
  "link": "https://www.alternet.org/2022/01/rachel-maddow/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meaghan Ellis",
  "authorUrl": "https://www.alternet.org/author/meaghanellis",
  "termIds": [
    4623,
    2765,
    3363,
    3401,
    838,
    5949
  ],
  "sentences": [
    "MSNBC's Rachel Maddow did not mince words when she criticized Arizona Attorney General Mark Brnovich (R) for his failure to look into the fake electors' scandal after the case was forwarded to his office from the Secretary of State Katie Hobbs.",
    "\"By affixing the state seal to documents containing false and misleading information about the results of Arizona's November 3, 2020 General Election, you undermine the confidence in our democratic institutions,\" Hobbs wrote at the time.",
    "\"Anyone waiting breathlessly for Attorney General Mark Brnovich to launch an investigation into the fake Trump electors who participated in a scheme to overturn Arizona’s vote should wait no longer,\" Roberts wrote.",
    "In a letter to those who crafted the fake electors' documents, Hobbs pointed out a number of offenses, including the illegal and unauthorized use of the Arizona state seal.",
    "According to Maddow, he has been more focused on appeasing former President Donald Trump in hopes of getting an endorsement for his U.S. Senate campaign.",
    "Maddow wondered why only one of the cases had been reviewed when there were two cases of fake electors over the course of a number of days.",
    "The MSNBC primetime host lambasted Brnovich for attempting to appeal to his constituents even though he is failing to do his current job.",
    "Hobbs offered all of the material she'd received and laid out a clear case to support the charges she'd highlighted in the first letter.",
    "Since Trump has shown support for Bronvich's opponent, Blake Masters, he appears to be apprehensive about further rocking the boat.",
    "On Thursday, January 28, Maddow discussed the timeline of events noting that the investigation goes back to December 22, 2020.",
    "She also confirmed that her office would be forwarding the case to the attorney general's office for potential prosecution.",
    "The following day, on December 23, 2020, Hobbs' office made a formal criminal referral to Brnovich's office.",
    "At the time, Hobbs' office had received fake electors' documents from two different sets of Republicans.",
    "The referral included all documents from the Arizona residents who purported to be state officials.",
    "Maddow shared highlights from a critical op-ed written by Arizona Central columnist Laurie Roberts.",
    "She also highlighted how Brnovich may be doing Trump's bidding for the sake of his campaign.",
    "She also wondered why no federal investigation was launched into the second case, as well.",
    "Now, its been more than a year since any action was taken to advance the case.",
    "However, after the case was turned over to Brnovich, nothing else happened.",
    "So what has Brnovich been doing in the meantime?",
    "Both sets of documents included the state seal.",
    "She also raised two questions.",
    "Or was it?"
  ]
}