{
  "id": 3920,
  "mediaId": 2748,
  "date": "2022-01-27",
  "headline": "Arizona bill would allow legislature to overturn election results",
  "image": "https://s.yimg.com/uu/api/res/1.2/o7eugiEY2HJQLRbv.0jtVg--~B/aD01NTE7dz05ODA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_hill_articles_341/4c1cb61fc4ee95b7c007f4787628ae58",
  "link": "https://www.yahoo.com/news/arizona-bill-allow-legislature-overturn-144156589.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    2915,
    2938,
    1690,
    2765,
    1477,
    392,
    361,
    5949
  ],
  "sentences": [
    "An arch conservative member of Arizona's state House of Representatives has proposed a mammoth overhaul of the state's voting procedures that would allow legislators to overturn the results of a primary or general election after months of unfounded allegations and partisan audits.",
    "The bill, introduced by state Rep. John Fillmore (R), would substantially change the way Arizonans vote by eliminating most early and absentee voting and requiring people to vote in their home precincts, rather than at vote centers set up around the state.",
    "Most dramatically, Fillmore's bill would require the legislature to hold a special session after an election to review election processes and results, and to \"accept or reject the election results.\"",
    "But Fillmore said at a committee hearing Wednesday he still does not believe the reports he has seen, though he maintained his skepticism has little to do with the ultimate winner.",
    "Ever since, Arizona Republicans have been riven between election denialists who have pushed to investigate or overturn those results and more mainstream legislators - and Gov.",
    "The proposal comes after President Biden became the first Democrat since former President Clinton to win Arizona's electoral votes.",
    "\"We should have voting in my opinion in person, one day, on paper, with no electronic means and hand counting that day.",
    "An audit, conducted by an inexperienced firm called Cyber Ninjas, failed to uncover evidence of fraud or miscounting.",
    "He defeated former President Trump there by just under 11,000 votes, or about three-tenths of a percentage point.",
    "Everybody's lying to me and I feel like I have a couple hundred ex-wives hanging around me,\" Fillmore said.",
    "I don't trust ABC, CBS, NBC or Fox or anybody out there.",
    "We need to get back to 1958-style voting,\" he added.",
    "This is not a the other red-headed guy thing.\"",
    "Doug Ducey (R) - who have tried to move on.",
    "\"This is not a President Biden thing.",
    "\"I don't care what the press says."
  ]
}