{
  "id": 4290,
  "mediaId": 2550,
  "date": "2022-01-20",
  "headline": "This Week in Statehouse Action: Happy Bidenversary! edition",
  "image": "https://images.dailykos.com/images/1028787/story_image/notaboringidiot.jpeg?1642719918",
  "link": "https://www.dailykos.com/stories/2075648",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Griffey, who also wants an official proclamation from Tennessee—which is not Illinois or Wisconsin or even anywhere near either of those other states—celebrating Rittenhouse, called the prosecution of this murderer “politically-motivated” and bemoaned the “widespread defamation and false branding by corrupt media outlets” he faced “simply for exercising his American, God-given right to self-defense.”\nGriffey is, of course, also a white guy.",
    "In Tennessee, GOP Rep. Bruce Griffey has introduced a piece of trash legislation he likes to call “Kyle’s Law,” because he definitely sees Kyle Rittenhouse—a teenager who illegally possessed a firearm and traveled from his own community in Illinois to stir up trouble in Kenosha, WI, amid protests in the aftermath of the police shooting of Jacob Blake and killed two people and injured another with that illegal firearm—as a hero.",
    "Rearranging Furniture: In case you’re wondering where the redistricting process stands in your state, the amazing folks at Daily Kos Elections have a super handy, daily-updated redistricting tracker that you should totally bookmark (… or just leave it open in a tab forever, if you’re like me, which you definitely shouldn’t be, because my browser tab situation is best described as “unhealthy”).",
    "On Monday, a party-line vote in a Senate committee killed bills that would have classified mask and COVID vaccine requirements implemented by private businesses, schools, or in public places as “illegal discrimination.”\nI’d like to think that it’s not an accident that this garbage legislation was docketed for, heard on, and voted down on MLK Day.",
    "In the course of pushing the Big Lie, Ramthun accused Vos of signing a deal with attorneys for Hillary Clinton (who, you may recall, WASN’T RUNNING IN 2020) to authorize absentee ballot drop boxes and (obviously falsely) claimed that Republican lawmakers could award the state’s Electoral College votes to Trump.",
    "GOP Rep. Michelle Udall has introduced a measure that apparently uses Florida’s “discomfort” metric to ensure that the racism that’s indisputably part of America’s past and present isn’t taught to kids in schools, so the bigger question here is …\n… who drafted the model bill?",
    "Remember, when anyone says that this round of redistricting isn’t that bad for Democrats, that person is undermining their own analysis by failing to take into account that existing maps—both congressional and legislative—are (in the vast majority of states) GOP gerrymanders.",
    "So Vos, who spent $676,000 of Wisconsin taxpayers’ money to “investigate” the 2020 presidential election results, punished Ramthun not because of his serious effort to undermine democracy at a fundamental level, but because he … insulted the Speaker.",
    "The bill has already passed a House committee, and while the Republican majorities in Arizona are small (29 D/31 R House, 14 D/16 R Senate), these “Don’t Say MLK” measures seem to have become the kind of litmus test reproductive rights used to be.",
    "The groundwork for the debacle was laid in December, when all five members of the panel voted in favor of a new congressional map, opening a period of review for local election officials to propose minor administrative adjustments to the lines.",
    "In fact, the legislatively-drawn congressional map actually had bipartisan buy-in (Republicans firmly control both chambers) and, if approved by DeSantis, would create 16 GOP seats and 12 Dem seats (pretty close to the current 16-11 split).",
    "Ron DeSantis cannonballed himself into that state’s redistricting process (which, like in most states, is the responsibility of the legislature) by submitting a super aggro congressional map to lawmakers, who had already drawn their own.",
    "In Wisconsin, a Republican lawmaker in the GOP-controlled Assembly is actually facing *gasp* consequences for pushing the Big Lie that Trump won the state, and tried to shunt the Badger State’s electoral votes to that loser.",
    "Other “Fun” Nonsense: In Virginia, where the legislative session began just over a week ago, the Democratic-majority state Senate (21 D/19 R) is quickly demonstrating its value as a stopper of bullshit and bad things.",
    "Rather, it’s another decade of silencing voters by shunting them into districts specifically designed to serve the interests of Republican lawmakers—not the interests of the people actually living in those districts.",
    "Lerner rejected that allegation and in turn accused GOP commissioner David Mehl of acting to aid Republican legislators, which would violate a constitutional prohibition on taking into account where incumbents live.",
    "This probably has something to do with Lerner and the other Democrat on the board, Derrick Watchman, voting against that map this week, despite supporting mostly the same district boundaries just a few weeks ago.",
    "DeSantis would prohibit public schools and private businesses in Florida from making white people feel “discomfort” when they teach students or train employees about discrimination in America’s history.",
    "… which could leave the Republican with less free time to spread his anti-democratic lies, but I’m guessing he’s more than happy to ignore a few constituent emails in the service of his tired delusion.",
    "Democrats in Arizona were pretty unhappy with the December vote approving the new congressional map, which could shift Dems' 5-4 edge in the state's House delegation into a 6-3 advantage for the GOP.",
    "Tuesday's meeting was ostensibly for the purpose of certifying those tweaks, but one Democratic commissioner, Shereen Lerner, announced that she'd \"made an error\" in backing the congressional map.",
    "You’ll remember, of course, that a Republican racistly dog-whistled his way to the governor’s mansion last fall, and Republicans eked out a tiny majority in the House of Delegates (48 D/52 R).",
    "That reversal infuriated Republican commissioners as well as the commission's independent (… somewhat debatable tbh) chair, Erika Neuberg, who claimed that \"someone was directing” Lerner.",
    "At Tuesday’s “final” meeting, commissioners unexpectedly changed their votes, accused one another of harboring improper motives, and even disappeared from the proceedings completely.",
    "But statehouse action is constant, it’s never boring (as much as I sometimes wish it were), here’s some of the wild stuff happening in our little meth labs of democracy.",
    "But his GOP cronies in the legislature are clearly on board, as the measure received its first approval on Tuesday as it passed a Senate committee on a party-line vote.",
    "Seems like a nice guy, he’s done a lot of really good things already, and hopefully a few jackwagons in the U.S. Senate don’t hamstring him for the rest of his term.",
    "At this point the IRC had been meeting and squabbling for about five hours, so they took a recess before reconvening to consider the state's new legislative map.",
    "… which meant the commission couldn’t certify both maps and transmit them to Secretary of State Katie Hobbs, the step that would make the new districts official.",
    "You may recall that a shitty, racist judge effectively put his thumb on the scales throughout the trial, and the almost all-white jury acquitted the killer kid.",
    "With redistricting’s outsized influence on the balance of power in the U.S. House after 2022, DeSantis is only messing with congressional maps at the moment.",
    "But DeSantis’ map is designed to create an 18-10 split—to say nothing of the fact that it would also dramatically dilute and diminish Black voting strength.",
    "Opt in to email updates from This Week In Statehouse Action\nSponsored by: This Week In Statehouse Action\nIn Florida, trying-to-be-more-Trump-than-Trump Gov.",
    "The IRC was supposed to have its final meeting this week, at which it was slated to give final approval to both congressional and legislative maps.",
    "evergreen sentiment when it comes to most GOP lawmakers tbh\nOn the first anniversary of Joe Biden’s inauguration, I can’t help but think …\nSo?",
    "“Kyle’s Law” would require the state to reimburse defendants similarly found not guilty of homicide charges because of self defense.",
    "Oh, and if you’re keeping track of where these racist, anti-history, anti-education bills are popping up, add Arizona to your list.",
    "And with a 16 D/24 R Senate and a 42 D/78 R House, we should definitely expect this to hit the governor’s desk for his signature.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Vos removed Ramthun’s sole staff member, a legislative aide who answered phones, responded to letters, and that sort of thing.",
    "So it’s up to the Senate to make sure the GOP doesn’t totally run the commonwealth into a ditch over the next couple of years.",
    "Seriously, she was nowhere to be found for the reconvened meeting, and the panel had to adjourn without voting on that plan.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "But pointing this out could get me in a lot of trouble in Florida soon, if some Republican lawmakers there get their way.",
    "United StatesUnited States\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "But with the support of IRC chair Neuberg and the commission's two Republicans, the map passed on a 3-2 vote.",
    "But DeSantis really doesn’t deserved to be singled out here—he can’t pass bills on his own, obviously.",
    "A state Senate (16 D/24 R) map is also moving through that chamber, and it’s mostly status quo-ish.",
    "So, absent a couple of courageous GOP objectors, yeah, expect this garbage to become law here, too.",
    "And while at least we’re not bored, these times are perhaps a little too interesting, so to speak.",
    "… except Assembly Speaker Robin Vos isn’t actually disciplining Rep. Timothy Ramthun for that.",
    "In Arizona, the Independent Redistricting Commission (IRC) is (again) devolving into DRAMA.",
    "And who’s disseminating it to Republican lawmakers in states controlled by the GOP?",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Time to take a breath and gird ourselves for the next wave of terribleness.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "… okay he’d have to be in Florida but\nA bill pushed by our old pal Gov.",
    "No word yet on when the panel will meet again to continue the ... fun.",
    "That’s all the … ah, interesting things I can stomach for one week.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "And it has absolutely nothing to do with Pres.",
    "Things didn’t quite work out that way, though.",
    "Don't miss a single Statehouse Action update!",
    "Maintaining that isn’t fair representation.",
    "Take what you need to to take care of you.",
    "This is a short blurb about Daily Kos.",
    "But Neuberg ghosted on the commission.",
    "What if I cause Griffey “discomfort”?",
    "And Republicans are trying SO HARD.",
    "But presidents come, presidents go.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "You may unsubscribe at any time.",
    "Maybe take a day, if you can.",
    "Like … the tide or whatever.",
    "Obviously, Mehl denied this.",
    "Here's our privacy policy.",
    "His oh-so-dire punishment?",
    "Because you’re important.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Or just the weekend.",
    "… which is not good!",
    "So take a breath.",
    "Donate $5 monthly",
    "Please read it.",
    "Biden himself.",
    "We need you.",
    "Sign Up!",
    "Sign Up!",
    "Yawn.",
    "Welp!"
  ]
}