{
  "id": 440,
  "mediaId": 8251,
  "date": "2022-02-19",
  "headline": "David Bradley, former Arizona legislator and Tucson Democrat, dead at 69",
  "image": "https://media.12news.com/assets/KPNX/images/bca33389-32c0-4ab7-9e93-f1f5cc1f57a1/bca33389-32c0-4ab7-9e93-f1f5cc1f57a1_1140x641.jpg",
  "link": "https://www.12news.com/article/news/local/arizona/former-arizona-legislator-david-bradley-dead-69/75-f283badc-b84b-4042-b98f-bbb597d7596d",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Whether by expanding educational opportunities for foster kids, addressing the opioid epidemic, or passing the Drought Contingency Plan, he made a lasting impact on our state.”\nDucey ordered that flags at all state buildings be lowered to half-staff on Sunday to honor Bradley.",
    "PHOENIX — David Bradley, a Tucson Democrat who served 16 years in the Arizona Legislature with stints in both chambers and who was the leader of the Senate's minority for two years, died Saturday.",
    "Ducey ordered flags on all state buildings to be lowered to half-staff Sunday to honor David Bradley, a Tucson Democrat who served 16 years in the Legislature.",
    "“During his time in the Senate, he lived as an example that working across the aisle, for a common good, benefits all Arizonans,\" Ducey said in a statement.",
    "It was announced Thursday during a Senate floor session that Bradley, who left the Legislature after the 2020 session, had cancer and had stopped treatment.",
    "Secretary of State Katie Hobbs said she was privileged to serve with Bradley in the Senate.",
    "When Bradley spoke, she said on Twitter, “people listened, because what he said mattered.",
    "Track all of our current updates with Arizona politics on our 12 News YouTube channel.",
    "He challenged us all to do better for the most vulnerable Arizonans.\"",
    "Bradley “worked tirelessly to make Arizona a better place,\" Gov.",
    "Survivors include Bradley's wife, Debra D’Amore.",
    "Subscribe for updates on all of our new uploads.",
    "Doug Ducey said Saturday.",
    "He was 69.",
    "Gov."
  ]
}