{
  "id": 4479,
  "mediaId": 8475,
  "date": "2022-01-05",
  "headline": "Arizona Secretary of State’s online signature-gathering system breaks after redistricting",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/010521_e-qual-screenshot.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/010522_sos_online_down/arizona-secretary-states-online-signature-gathering-system-breaks-after-redistricting/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    0
  ],
  "sentences": [
    "A redistricting guide that Hobbs’ office issued for candidates explains that, because E-Qual is tied to the state’s voter registration database, voters “may not immediately see their updated district or the new candidates running in their updated district” and that “there may be some delay in when voters will have access to sign for candidates who are running in their 2022 district.” But it doesn’t lay out any kind of timeline or explain that voters in some counties won’t be able to provide online signatures until shortly before the filing deadline for nominating petitions.",
    "That interpretation would mean, for instance, that residents of Fountain Hills on the eastern edge of the Phoenix metro area who live in the old District 23 could legally sign petitions for Rep. Brian Fernandez, a Democrat who lives in Yuma in the new District 23 — even though it’s more than 200 miles away and those voters could never cast a vote for him.",
    "That would be a complete overhaul and creating kind of a new technology platform.”\nIn Maricopa County, a resolution won’t come until mid-March\nThe new districts won’t technically be official until the AIRC transmits them to Secretary of State Katie Hobbs, and that can’t happen until it implements technical changes proposed by the counties.",
    "Sponsorships available\nSupport TucsonSentinel.com & let thousands of daily readers know\nyour business cares about creating a HEALTHIER, MORE INFORMED Tucson\nLorick disagrees that the Secretary of State’s Office hasn’t done enough to keep candidates informed of the E-Qual issues being caused by redistricting.",
    "Osborne said she can still collect signatures on paper, but doing so online would be preferable, especially considering that she now has only a few months to circulate her petitions, a period of time during which she’ll be tied up with her business and the legislative session, which begins Jan. 10.",
    "When District 15 isn’t really District 15\nRep. Jake Hoffman, a Queen Creek Republican who was elected to the House of Representatives from District 12 in the East Valley in 2020, filed to run for the state Senate after the AIRC placed him in a new district with no incumbent senator.",
    "That’s a weird reading of it that wasn’t done previously and it’s certainly not what we had in mind.”\nMurphy Hebert, a spokeswoman for Hobbs, noted that the Secretary of State’s Office is also advising candidates to seek legal advice from their own attorneys on such matters.",
    "That 2021 law, Senate Bill 1107, stipulated that candidates can file nominating petitions using signatures from “the candidate’s legislative district as used in the 2020 elections” or their new district, as implemented either by the AIRC or by a court of law.",
    "Local\nVoters who want to sign online petitions and the candidates who need those signatures to get their names on the ballot this November are being thwarted by a glitch in the secretary of state’s system caused by the decennial redistricting process.",
    "When Hoffman checked his E-Qual account on Tuesday after being contacted by the Arizona Mirror, he found that he’d collected one online signature — from a voter in Cave Creek, about 50 miles from the boundary of his new legislative district.",
    "“They can choose whether they collect on E-Qual or if they go offline and just collect on paper.”\nWith paper petitions, candidates can collect signatures from anyone, and it’s up to them to ensure that the signatures are valid.",
    "Hoffman, Osborne and others also have the option of re-filing as candidates in their old districts, which would allow them to collect E-Qual signatures from their old constituents, even those who don’t live in the new district.",
    "“But it certainly would be nice if the Secretary of State’s Office would update this accordingly.”\nBut things aren’t nearly that simple, said Kori Lorick, who serves as elections director at the Secretary of State’s Office.",
    "Because most of the new district numbers are different from the old ones, candidates who have already filed to run for office using their new districts are unable to collect signatures online from the voters who live there.",
    "“I printed off all my petitions and I’m starting to knock doors and meet with voters and whatnot to get petition signatures,” said Hoffman, who was unaware of the issues with E-Qual until he was contacted by the Mirror.",
    "The Secretary of State’s Office interprets the safe harbor law to permit candidates to collect signatures not only from their old districts, but from the old districts that bear the same numbers as their new ones.",
    "Candidates who waited to start their campaigns until after the AIRC approved its final maps in late December, and who filed to run in their new districts, can’t get signatures from their new districts on E-Qual.",
    "After the counties complete that work, they’ll send their changes to the statewide voter registration database and the Secretary of State’s Office, which will update E-Qual to include data for the new districts.",
    "In the new District 23, which includes parts of four counties, voters in Pima and Yuma counties will be able to sign petitions online before voters in Maricopa County can sign on E-Qual for the same candidate.",
    "The system automatically rejects signatures from voters who aren’t qualified to sign a candidate’s petition, such as those who live outside a candidate’s district or who are registered with the wrong party.",
    "The law, which the legislature passes every 10 years when the AIRC redraws the state’s political boundaries, allows candidates to collect signatures before they know what their new districts will look like.",
    "Secretary of State’s Office: New district numbers won’t disqualify signatures\nAs for Hoffman’s Cave Creek voter, Lorick said such scenarios won’t be a problem because those signatures are permissible.",
    "So, even though the old District 15 is nowhere near Hoffman’s district, new or old, he would be able to collect signatures from voters there under the secretary of state’s interpretation of the law.",
    "Lawmakers last year passed a “safe harbor” law allowing legislative and congressional candidates in the 2022 election cycle to collect signatures in either their old districts or their new ones.",
    "And in counties that are overseeing springtime municipal elections, the glitch likely won’t be fixed until nearly the deadline for candidates to file signatures so they can appear on the ballot.",
    "“I think if we look at the intent of that legislation, it was to ensure candidates had the flexibility kind of given this uncertainty around the timing of the new 2022 districts,” Lorick said.",
    "Candidates can collect signatures in their old or new districts, so many incumbents and others who started their campaigns last year may already have all the signatures they need.",
    "Candidates must submit their petitions to the secretary of state by April 4, meaning many will have little opportunity to collect online signatures in their new districts at all.",
    "The problems with E-Qual and redistricting will also mean that voters in some counties will be able to provide online signatures for the new districts, while others can’t.",
    "Six counties have provided recommendations, ranging from two to two dozen proposed changes, the commission’s mapping team reported during the AIRC’s meeting on Tuesday.",
    "But it’s creating a problem with the new districts that the Arizona Independent Redistricting Commission recently approved — but that aren’t technically in place yet.",
    "Voters in counties with March elections likely won’t be able to sign online petitions for candidates in their new districts until around the middle part of the month.",
    "That includes Maricopa County, home to nearly 62% of Arizona’s population, which won’t send the new data to Hobbs until after Tempe’s municipal election on March 8.",
    "Rep. Joanne Osborne, R-Goodyear, filed on Monday to run for the Senate in the new District 29, which has an open seat in the state’s upper legislative chamber.",
    "Voters can also use E-Qual to give the $5 contributions that candidates need to qualify for public campaign funding from Arizona’s Clean Elections system.",
    "So, we can keep pushing information out there and then the candidates will have to decide what they want to do with their particular campaign,” she said.",
    "“I passed the exact same bill we had 10 years ago, and that was clearly not the interpretation or the intent,” said Mesnard, a Chandler Republican.",
    "The commission expects to approve those changes at its next meeting on Jan. 18, at which point it can transmit the maps to the secretary of state.",
    "Because E-Qual is tied to the state’s voter registration system, the only options are to use it as-is or to take it offline entirely, she said.",
    "Mesnard, who sponsored the 2021 version of the safe harbor bill, laughed when he heard the secretary of state’s interpretation of the law.",
    "Historically, safe harbor laws have been intended to permit candidates to collect signatures in only the districts they actually live in.",
    "E-Qual hasn’t yet been updated with the new districts and is only programmed with data from the old ones, which were used from 2012-2020.",
    "On Dec. 28, he submitted paperwork to run in District 15, his new district that covers Queen Creek, San Tan Valley and part of east Mesa.",
    "Candidates still have the option of collecting signatures on paper petitions, but can collect 100% of the signatures they need online.",
    "The office also plans webinars and outreach between now and March 5, the first day candidates can file their nominating petitions.",
    "If there’s a good reason why the system can’t accept online signatures from the new districts yet, Osborne said she understands.",
    "But if they’ve filed to run in their new districts, E-Qual will only accept signatures from the old district with that number.",
    "She quickly ran into the unexpected problem of voters from her new district not being able to sign her petitions on E-Qual.",
    "“I also think the candidates have some responsibility to stay informed and think through what’s best for their campaign.",
    "Lorick said the maps would then be sent to the counties so they can update their precincts and their voter information.",
    "E-Qual is a system that allows voters to sign nominating petitions for congressional and legislative candidates online.",
    "They’ll reach out to the other counties and examine the maps themselves to see what other revisions might be needed.",
    "But she wishes the Secretary of State’s Office would have reached out to candidates to inform them of the issue.",
    "Cave Creek was part of District 15 on the old legislative map, but will be in District 3 in the new map.",
    "Counties that have elections in March won’t send that information to Hobbs until the election is over.",
    "But I’m having to already have in my mind that we’re going out for the old-fashioned paper signature.",
    "Lorick said it’s not possible to do the same with E-Qual because it’s tied to the voter database.",
    "For example, if a district boundary splits an apartment complex in half, it needs to be moved.",
    "Normally, that’s a safeguard that helps candidates ensure that their signatures are valid.",
    "Because of that law, candidates can collect signatures online in their old districts.",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson!",
    "“That would require essentially a brand new system to be created,” she said.",
    "Join Andrew Hall, Richard Ringler, and Cindy Laughlin and contribute today!",
    "And they can collect signatures on paper petitions from either district.",
    "Analog campaigning in a digital world\nFor some, this won’t be a problem.",
    "“If the legislature wanted to create something like that, they could.",
    "But that’s not what E-Qual does and that’s not how it was designed.",
    "And if something gets fixed soon, great,” Osborne told the Mirror.",
    "Once that happens, there are additional steps to the process.",
    "He said that wasn’t his intent when he sponsored the law.",
    "The first candidate training webinar will be on Jan. 13.",
    "For some counties, that won’t happen for a while.",
    "“It has nothing to do with (district) number.",
    "“It lets the candidate choose,” Lorick said.",
    "“I’m still running for LD29,” she said.",
    "“Obviously, it’s concerning to me.",
    "Others are in a tougher situation.",
    "Osborne wasn’t keen on the idea.",
    "Sen. J.D.",
    "- 30 -"
  ]
}