{
  "id": 4557,
  "mediaId": 2902,
  "date": "2022-01-13",
  "headline": "“The Coming Coup”: Ari Berman on Republican Efforts to Steal Future Elections",
  "image": "",
  "link": "https://www.democracynow.org/2022/1/13/gop_efforts_to_steal_future_elections",
  "mediaOutlet": "Democracy Now!",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "And obviously, so much of the attention has been on the Democrats and been on Manchin and Sinema to use their power to pass these bills, but Republicans have sort of gotten a free pass in terms of people really saying, “How come you reauthorized the Voting Rights Act overwhelmingly in 2006 — 390 to 33 in the House, 98 to 0 in the Senate — Mitch McConnell led the effort to reauthorize the Voting Rights Act — and just two decades later, you are completely opposing a bill that you basically supported not too long ago?”\nAMY GOODMAN: So, let’s go broader, with your piece that was just released as we went to air, “The Coming Coup: How Republicans Are Laying the Groundwork to Steal Future Elections.” You go beyond the issue of actually casting the ballot and how difficult that is — and you can lay that out — around the country, as well, increasingly, 19 states passing, what, more than 30 laws to restrict voting, but then the issue, for example, of gerrymandering and others.",
    "He was trying to frame the fight for voting rights in moral terms, much like Lyndon Johnson did when he introduced the Voting Rights Act in 1965, saying, “This is a defining moment in American history, and you have to pick a side.” You can’t just praise Martin Luther King on Martin Luther King Day; you have to live the values that Martin Luther King fought for — namely, the values of the right to vote, which Martin Luther King called “civil right number one.”\nAnd I thought it was really interesting what the president said about Republicans previously supporting voting rights, because the Voting Rights Act was reauthorized four times, and every reauthorization was signed by a Republican president and supported by overwhelming bipartisan majorities in Congress.",
    "“That is the ultimate voter suppression method, because if you’re not able to rig the election on the front end, you can throw out votes on that back end.”\nTranscript\nAMY GOODMAN: President Biden is meeting with Senate Democrats on Capitol Hill today for a lunchtime meeting to push for rewriting Senate rules to prevent Republicans from filibustering a pair of major voting rights bills — the John Lewis Voting Rights Advancement Act and the Freedom to Vote Act.",
    "What we’ve seen is that both Democrats and Republicans who defended the integrity of the 2020 election have been purged from their positions, whether it’s taking away the power of the Arizona secretary of state to defend election lawsuits or removing the Republican secretary of state in Georgia, who stood up to Donald Trump, removing him as chair and voting member of the State Election Board.",
    "ARI BERMAN: Well, this was really significant because Ohio Republicans drew these flagrantly undemocratic maps where there was a bipartisan constitutional amendment passed by the voters in 2018 to rein in partisan gerrymandering, and then Republicans essentially hijacked this redistricting commission to draw these extreme gerrymandered maps that go exactly against what the voters wanted.",
    "AMY GOODMAN: And can you talk about something that didn’t get a heck of a lot of attention, the Cyber Ninjas, the company that led that partisan review of the 2020 ballots in Arizona, closing down following a scathing report by election officials and the threat of $50,000 fines a day, the report rebutting almost every claim this company made?",
    "His new piece, out just today, “The Coming Coup: How Republicans Are Laying the Groundwork to Steal Future Elections.”\nAri, I want to start off by talking about what this maneuver is — very complex, I’m sure very hard for people to understand — how the Democrats try to plan to get these bills on the floor and voted on in the Senate.",
    "And the Ohio Supreme Court struck it down, with one of the Republican judges siding with the Democrats and basically saying that the Legislature not just needs to redraw these maps, but that in the future voters might want to consider taking away the power of politicians to be able to draw their districts in the first place.",
    "The man who led the longest — one of the longest filibusters in history in the United States Senate in 1957 against the Voting [sic] Rights Act, the man who led and sided with the old Southern bulls in the United States Senate to perpetuate segregation in this nation — even Strom Thurmond came to support voting rights.",
    "And these same kind of, quote-unquote, “audits” are happening in other states, like in Wisconsin, where a very radically conservative state Supreme Court justice is threatening to jail election officials, threatening to subpoena the mayors of the largest cities, threatening to disband the state’s election commission.",
    "AMY GOODMAN: For example, like in Arizona, Republicans stripped the Democratic Secretary of State Katie Hobbs of the power to defend state election laws, and transferred that authority to the Republican attorney general — but only through the 2022 election, just in case the partisan composition of the offices change.",
    "If you could comment on that and another key point of your piece, being that Trump and his allies are aggressively recruiting “Stop the Steal”-inspired candidates to take over other key election positions, like secretary of state, and also fiercely intimidating, going after election workers all over the country?",
    "They will still need 60 votes to pass the bill if they don’t reform the filibuster, but this will allow at least the Senate to immediately begin debating the bill, probably Friday or Saturday, and then set up a vote on these bills, and also potentially changing the Senate rules, on Martin Luther King Jr. Day.",
    "PRESIDENT JOE BIDEN: We’re here today to stand against the forces in America that value power over principle, forces that attempted a coup — a coup against the legally expressed will of the American people — by sowing doubt, inventing charges of fraud and seeking to steal the 2020 election from the people.",
    "Mother Jones reporter Ari Berman warns the Republican Party is laying the groundwork to steal the 2022 midterms and future elections through a combination of gerrymandering, voter suppression and election subversion, that together pose a mortal threat to voting rights in the United States.",
    "And so, this is both a legal mechanism, in that they’re changing the laws in many states to make it easier to subvert elections, but it’s also a political dynamic, in that people who are election deniers are running to take over election operations in all of these key states.",
    "And The Washington Post had recent article finding that 163 Republicans who have amplified the big lie are running for statewide positions with authority over elections, so positions like gubernatorial races, attorney general races, secretary of state races.",
    "So there’s a fundamental asymmetry here that Republicans have been able to take away voting rights at both the state level and the federal level with 51 votes, but they want Democrats to have 60 votes to be able to protect voting rights in the U.S. Senate.",
    "We’ll link to your new cover story, “The Coming Coup: How Republicans Are Laying the Groundwork to Steal Future Elections.” Ari is the author of Give Us the Ballot: The Modern Struggle for Voting Rights in America, speaking to us from New Paltz, New York.",
    "But I have to say it’s very ironic that Mitch McConnell wants there to be 60 votes to protect voting rights in the U.S. Senate, but he was able to put three justices on the Supreme Court for Donald Trump to take away voting rights with just 51 votes.",
    "On Wednesday, Senate Majority Leader Chuck Schumer outlined a plan to bring the voting bills to a debate using a parliamentary maneuver, but the move would still leave room for Republicans to block final passage of the bills using the filibuster.",
    "And they drew this district to go all the way up to the Appalachian Mountains, and basically took out the most diverse and Democratic parts of her district and added in the most white and conservative parts of the state.",
    "AMY GOODMAN: Democrats are increasingly concerned that Republicans will be able to successfully steal future elections, both on the national and state level, if major voting rights legislation is not immediately passed.",
    "Manchin and Sinema are key because there’s essentially 48 votes for changing the Senate rules to pass voting rights legislation, but they’re two votes short, and the two votes that are short are Manchin and Sinema.",
    "Because I believe if you are willing to overturn the 2020 election for Trump, you are very likely going to be willing to overturn the 2022 and 2024 election for Republican candidates if it doesn’t go in your favor.",
    "Well, the plan is that the House is taking a bill, and they are putting the two voting rights bills — the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act — in what’s essentially a shell bill.",
    "They failed to overturn the 2020 election, so they’re doing everything they can to rig and steal future elections through a toxic combination of voter suppression, extreme gerrymandering and election subversion.",
    "PRESIDENT JOE BIDEN: In 2006, the Voting Rights Act passed 390 to 33 in the House of Representatives and 98 to 0 in the Senate, with votes from 16 current sitting Republicans in this United States Senate.",
    "AMY GOODMAN: So, Ari Berman, it looks like President Biden was trying to cut through all the bureaucracy, as they talk about filibusters and everything else, and just say, “Which side are you on?” Right?",
    "And the federal courts, because of the Supreme Court, have said, “We can’t even review partisan gerrymandering.” So it’s going to be very difficult to fight gerrymandering through the courts writ large.",
    "And then they’ve added all of these new election subversion laws that give “Stop the Steal” Republicans unprecedented power in states like Georgia over how elections are run and how votes are counted.",
    "But I think it’s important to remember that Congress has authority, under both the 15th Amendment and also under the core guarantees of the Constitution, to write the rules of federal elections.",
    "AMY GOODMAN: During his speech on Tuesday in Atlanta, President Biden made reference to Strom Thurmond, the longtime segregationist senator who served in the Senate for nearly half a century.",
    "But I think they accomplished their job, in the sense that after this review Republicans were even more skeptical of the validity of the 2020 election, compared to less skeptical.",
    "But the maps themselves reduced representation for communities of color, reduced representation for Democrats and targeted Black members of Congress like Lucy McBath.",
    "And Democrats have been working feverishly, both publicly and behind the scenes, to get Manchin and Sinema to support the rules changes, but they’re not there yet.",
    "AMY GOODMAN: Talk about Lucy McBath, how you open your piece, a congressmember who we had on for years beforehand, after her son was murdered by a white man.",
    "And that is the ultimate voter suppression method, because if you’re not able to rig the election on the front end, you can throw out votes on the back end.",
    "And so they’re really trying to take over every aspect of the election process to essentially try to succeed in 2022 and 2024 where they failed in 2020.",
    "And that is a form of election rigging, because if you can choose who your electorate is, then the elections themselves become essentially meaningless.",
    "The original content of this program is licensed under a Creative Commons Attribution-Noncommercial-No Derivative Works 3.0 United States License.",
    "Then they will remove the text of that and put the two bills into it, and it’s called a message, that will be sent to the Senate, as they do this.",
    "They’ve passed all of these extreme gerrymandered maps in places like Texas and Georgia, which entrench the power of anti-democratic politicians.",
    "I think the big trend over the last year has been the Republican Party’s single-minded focus on instituting an insurrection through other means.",
    "Two Senate Democrats have so far refused to support changing the filibuster rules: Joe Manchin of West Virginia and Kyrsten Sinema of Arizona.",
    "The last year I was chairman, as some of my friends sitting down here will tell you, Strom Thurmond voted to extend the Voting Rights Act.",
    "During his speech in Atlanta, President Biden made reference to efforts by Donald Trump and his supporters to overturn the 2020 election.",
    "And so, what happened in Georgia is that all of the demographic change was from communities of color, who increasingly lean Democratic.",
    "AMY GOODMAN: Finally, Ari, if the bills are passed, the voting legislation in the Senate, could the U.S. Supreme Court overrule them?",
    "Republicans, many of whom are election deniers, are campaigning for positions that hold immense oversight over the election process.",
    "Ah, but yesterday he invoked the bloody disunion of the Civil War — the Civil War — to demonize Americans who disagree with him.",
    "At the end of the day, they reaffirmed Joe Biden’s victory, so they weren’t actually able to find any of the evidence of fraud.",
    "So it’s not like the House hasn’t taken up the Freedom to Vote Act or the John Lewis Voting Rights Advancement Act already.",
    "So, gerrymandering is one of the many tactics Republicans are using to consolidate power going into the midterm elections.",
    "Not a single Republican has displayed the courage to stand up to a defeated president to protect America’s right to vote.",
    "I mean, this is the Roberts court, and John Roberts has been opposed to voting rights legislation throughout his career.",
    "That’s the only way that Schumer will be able to then have a debate on the bills themselves and on the rules changes.",
    "But there was such a strong bipartisan consensus for these bills that Republicans had no choice but to support them.",
    "Her victory in 2018 really opened the doors for the victories of Raphael Warnock and Jon Ossoff two years later.",
    "But in Texas, in Georgia, in Florida, in other key states, the state supreme courts have moved far to the right.",
    "They’ve passed 34 new laws in 19 states making it harder to vote, so they’re making it harder to cast a ballot.",
    "MINORITY LEADER MITCH McCONNELL: Twelve months ago, this president said disagreement must not lead to disunion.",
    "And that will allow the Senate to immediately debate the bill without needing 60 votes to get it to the floor.",
    "Lots of GOP presidents, like Nixon and Reagan, didn’t want to sign a reauthorization of the Voting Rights Act.",
    "And the Colorado Secretary of State Jena Griswold told me this is akin to giving a robber a key to the bank.",
    "The New Orleans City Council recently voted to rename Robert E. Lee Boulevard to Allen Toussaint Boulevard.",
    "It’s important to remember, this voting rights bill, the Freedom to Vote Act, this is Joe Manchin’s bill.",
    "They just have to do this message bill to get it to the Senate to essentially avoid 60 votes on debate.",
    "Biden heads to Capitol Hill two days after he gave a major speech on voting rights in Atlanta, Georgia.",
    "You are having people who say falsely the election was stolen running to oversee how elections are run.",
    "So, this was a significant victory, but it’s going to be very hard to uphold these maps in most states.",
    "AMY GOODMAN: We’re joined now by Ari Berman, a senior reporter at Mother Jones covering voting rights.",
    "So, just by airing all these conspiracy theories, they made the Republican Party more conspiratorial.",
    "ARI BERMAN: Well, yeah, the entire audit in Arizona was a complete —\nAMY GOODMAN: It cost millions.",
    "AMY GOODMAN: Ari Berman, I want to thank you for being with us, senior reporter for Mother Jones.",
    "ARI BERMAN: Yeah, and it’s important to remember, Amy, these bills have already passed the House.",
    "She represents a metro Atlanta area that has become a lot more diverse, a lot more Democratic.",
    "“What’s really new here are these efforts to take over how votes are counted,” says Berman.",
    "She ran for the House in Georgia after her son, Jordan Davis, was murdered by a white man.",
    "Some of the work(s) that this program incorporates, however, may be separately licensed.",
    "On Wednesday, Senate Republican Minority Leader Mitch McConnell blasted Biden’s remarks.",
    "He’s the author of Give Us the Ballot: The Modern Struggle for Voting Rights in America.",
    "It’s a bill completely unrelated, something to do with NASA, that the House will pass.",
    "AMY GOODMAN: Talk about the victory against gerrymandering in Ohio that just happened.",
    "And what Republicans did is they gerrymandered her out of her congressional district.",
    "ARI BERMAN: Absolutely, it’s possible the Supreme Court could strike down these laws.",
    "He compared — listen to this — a bipartisan majority of senators to literal traitors.",
    "And I think what’s really new here is all of the efforts to subvert fair elections.",
    "What’s really new here are these efforts to take over how votes are counted.",
    "And they’re really trying to take over every aspect of the voting process.",
    "This is not like Build Back Better, where he doesn’t support the bill.",
    "[break]\nAMY GOODMAN: “On Your Way Down” by the late Allen Toussaint.",
    "Now, that didn’t mean every Republicans like the Voting Rights Act.",
    "And when they get this power, who knows what they will do with it?",
    "The Supreme Court can clearly do whatever it wants at this point.",
    "The question is: Is he willing to change the rules to pass them?",
    "Please attribute legal copies of this work to democracynow.org.",
    "For further information or additional permissions, contact us.",
    "And why are Manchin and Sinema key at the point in the Senate?",
    "And that’s the fundamental asymmetry that has to change here.",
    "They are going to pass that today and send it to the Senate.",
    "Are you on the side of Jefferson Davis or Abraham Lincoln?",
    "ARI BERMAN: It cost millions of dollars in taxpayer money.",
    "Lucy McBath is a Black member of Congress from Georgia.",
    "And that is a very, very scary prospect for democracy.",
    "North Carolina has a moderate state Supreme Court.",
    "Coming up, “Confessions of a 'human guinea pig.",
    "So Congress has the power to pass these bills.",
    "It’s gotten worse, but we’ve seen it before.",
    "So, it’s very scary, what’s happening here.",
    "ARI BERMAN: I think this is really telling.",
    "How profoundly, profoundly unpresidential.",
    "AMY GOODMAN: Which, of course, is Monday.",
    "ARI BERMAN: That’s absolutely right, Amy.",
    "Could the Supreme Court strike them down?",
    "Ohio has a moderate state Supreme Court.",
    "But Republicans today can’t and won’t.",
    "We’ve seen voter suppression before.",
    "Sixteen of them voted to extend it.",
    "So, then, what has to happen next?",
    "We’ve seen gerrymandering before.",
    "And as of now, the answer is no.",
    "I mean, this is really unusual.",
    "I mean, it is truly astounding.",
    "ARI BERMAN: Good morning, Amy.",
    "Strom Thurmond or John Lewis?",
    "And that’s really evaporated.",
    "ARI BERMAN: That’s right.",
    "ARI BERMAN: Exactly, Amy.",
    "He supports these bills.",
    "… Think about that.",
    "It’s gone so far.",
    "'” Stay with us.",
    "Strom Thurmond.",
    "Absolutely.",
    "Not one.",
    "Not one."
  ]
}