{
  "id": 4832,
  "mediaId": 8408,
  "date": "2022-04-20",
  "headline": "Arizona GOP Hopeful Jim Lamon's Easter Savior Ad May Be Backfiring",
  "image": "https://media1.phoenixnewtimes.com/phx/imager/u/slideshow/13462706/51298739150_c492621f05_6k.jpg",
  "link": "https://www.phoenixnewtimes.com/news/us-senate-hopeful-jim-lamon-alienates-republican-voters-with-easter-ad-13462700",
  "mediaOutlet": "phoenixnewtimes.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elias Weiss",
  "authorUrl": "https://www.phoenixnewtimes.com/author/elias-weiss",
  "termIds": [
    0
  ],
  "sentences": [
    "Commercial Controversy\nThe Fountain Hills Republican first came under fire in January when Yahoo rejected a different video ad campaign, calling it “overly inflammatory and offensive.” That commercial featured the GOP slogan, “Let’s Go, Brandon,” a play on “Fuck Joe Biden.”\nOne month later, Phoenix New Times reported Lamon was in the hot seat again after a pricey Super Bowl ad depicted the former CEO for DEPCOM Power, a Scottsdale-based utility-scale solar company, shooting Kelly with a revolver.",
    "She and Ryan agreed that alt-right GOP hopefuls in Arizona largely adopted a \"savior technique\" brought into vogue by former President Trump, who on the 2016 campaign trail said, “I alone can fix the system.”\n“It’s that kind of voice in the Republican Party that will potentially be our downfall,” Packard said.",
    "They have included: Jim Pederson, who lost his U.S. Senate bid in 2006; Buz Mills, who tanked in the Republican primary in Arizona’s 2010 race for governor; and Republican Steve Gaynor, who lost his bid for Arizona secretary of state to Katie Hobbs in 2018.",
    "“It was nothing more than an uplifting message about the Easter season.”\nBarrett Marson, a Phoenix-based GOP political strategist with Marson Media, said Lamon should get himself off the air before he stirs up more animus inside the Republican Party.",
    "You show it.”\nLamon trails Arizona Attorney General Mark Brnovich in the polls by 4 percentage points, according to recent data from Kansas City-based nonpartisan pollster co/efficient, but the great majority of voters remain undecided.",
    "“Times of plague and turmoil.”\nLamon claims to know God’s plan to save America throughout most of the 30-second clip before turning the attention back to himself, hinting that such a plan might involve his ascension into office.",
    "Lamon is among several prominent Republicans who falsely claimed to be an elector for Donald Trump in the 2020 presidential election, even though the one-term president lost and the true electors were repeatedly certified.",
    "“Fundraising is not a strategic priority of the campaign.”\nKelly has the edge, political analysts predict, not only because he has more cash on hand, but because that cash came from his supporters and not his own wallet.",
    "She ran for Prescott Valley Town Council as a Republican, and later was elected to the Central Yavapai Fire District Board of Directors and the Central Arizona Fire and Medical Authority Board of Directors.",
    "According to Federal Election Commission filings, the day after the Super Bowl ad Lamon took in a single contribution of $763.64 from WinRed, a fundraising platform run by the Republican National Committee.",
    "Since his campaign launched in April 2021, the multimillionaire, who made his fortune in the coal and natural gas-fired power plant industry, has injected $13 million of his $13.8 million in total receipts.",
    "Lamon is outspending his eight GOP opponents ahead of the August 2 primary, but the latest in a string of controversial television ads rubbed even conservative Christian Republican voters the wrong way.",
    "“He’s definitely the worst part of his TV ads.”\nLots of Cash, Mostly His\nLamon's television ads haven't been particularly popular, but he's got the capital to keep churning them out until Election Day.",
    "The other leading GOP challengers, Arizona Attorney General Mark Brnovich and venture capitalist Blake Masters, have taken in a combined total of $6.4 million, and together have $2.8 million banked.",
    "I get offended at that ‘holier than thou’ attitude.”\nLamon’s campaign didn’t have much to say about the public backlash after A New Dawn aired on TVs across the Grand Canyon State on Easter Sunday.",
    "While he’s seeing an increase in individual campaign contributors, largely Arizona residents, Lamon’s self-funding strategy isn’t attractive to all registered Republican voters in the state.",
    "In the new year, Lamon and the eight other Republicans in this year’s primary collectively raised $8.4 million — less than the $11.3 million raised by the incumbent Democrat Kelly alone.",
    "But that was merely the result of procrastinators waiting until the end of the quarter to contribute, a common pattern among candidates nationwide, according to the Lamon campaign.",
    "He bankrolled security efforts in the widely ridiculed election audit in Maricopa County and bragged about pushing Arizona Senate President Karen Fann into launching the review.",
    "“When you pray, do not be like the hypocrites, for they love to pray standing in the synagogues and on the street corners to be seen by men,” Packard recited from the Bible.",
    "“But when you pray, go into your room, close the door and pray to your Father who is unseen.”\nTouting Christian values doesn’t make you a Christian, Packard said.",
    "She pointed to Matthew 6:5-8 regarding why she was “very offended” when A New Dawn popped up on her television screen as children hunted for colored eggs outside.",
    "Retired energy executive and self-funded political newcomer Jim Lamon is in a crowded field trying to secure the Republican nomination in the U.S. Senate race.",
    "Campaign manager Stephen Puetz told New Times that the dissenters, whom he claims are a loud minority, grossly misinterpreted the message behind the ad.",
    "By hitching their wagon to Christianity, they retain power, like in Nazi Germany.”\nI am offended by Lamon’s Easter ads suggesting he is our Savior!",
    "Senator Mark Kelly swung and missed with a recent campaign ad — the third time this year his message was either rejected or publicly maligned.",
    "“He is a very arrogant man,” Darlene Packard, a straight-ticket Republican voter and devout Christian from Prescott, told Phoenix New Times.",
    "Kelly’s wife, Gabby Giffords, a former congresswoman from Arizona, was shot in the head in 2011 during an assassination attempt near Tucson.",
    "In the first quarter of 2022, Lamon was also the top GOP spender, doling out $4 million for television ads and other campaign expenditures.",
    "It's a close marriage of church and state that doesn't sit right with everyone in his target audience, a departure from previous attempts.",
    "In the first quarter of 2022, Lamon was the top-raising Republican in Arizona's U.S. Senate race, according to recent FEC filings.",
    "“If I had millions and millions of dollars, I’d be fighting hunger and poverty,” said Packard, the Republican voter from Prescott.",
    "Overall, in the election cycle to date, Lamon's $13.8 million in total receipts withers in comparison to Kelly's $38.9 million.",
    "“What was offensive to me was this whole notion that he is the Savior,” Chandler-based trial attorney Tom Ryan told New Times.",
    "On the first Monday after Trump praised Lamon at a rally in Florence, donors sent a little more than $10,000 to his campaign.",
    "Half of Lamon’s individual contributions in the first quarter of 2022 came in March, Federal Election Commission data shows.",
    "The Senate hopeful pulled in $5.3 million in the first three months of the year, but $5 million came from his own coffers.",
    "By comparison, WinRed funneled $3,789.55 to Lamon on the anniversary of the January 6 storming of the U.S. Capitol.",
    "It made me sick to my stomach when I saw that.”\nRyan, a Christian and former GOP voter, jilted the party in 2010.",
    "Lamon’s recent Easter-themed commercial, A New Dawn, isn’t as “in your face” or polarizing as previous attempts.",
    "“Jim has always made a point to focus on the grassroots and not spend a lot of time on fundraising,” said Puetz.",
    "“The problem with just self-funding is people don’t get invested in your campaign, your movement,” Marson added.",
    "Lamon experienced a spike in individual contributions in March after Trump held a January rally in Florence.",
    "That's despite Lamon ending the quarter with more individual contributions than the previous three quarters.",
    "“There is a real rise of Christian dominionism, which is not true Christianity at all,” Ryan said.",
    "For her and other conservative voters, it flies in the face of some of the faith’s core doctrines.",
    "“Jim Lamon's TV ads would be so much better if they didn’t have Jim Lamon in them,” Marson said.",
    "“The feedback that we’ve gotten on the Easter ad overall was very positive,” Puetz said.",
    "— Tom Ryan (@tomryanlaw) April 17, 2022\nTweets praising the ad were nowhere to be found.",
    "“If you live a life with Christian values, you don’t need to stand up there and say it.",
    "After 30 seconds of pious platitudes in the new ad, Lamon hints he's Arizona's savior.",
    "“He’s not the savior of anything.”\nPackard knows a thing or two about local politics.",
    "“When you go too far to the right, you piss people off and they go the other way.",
    "\"Self-funders have a long history of flaming out in Arizona,\" Marson said.",
    "Today, he doesn't recognize the Republican Party he grew up in, he said.",
    "Marson didn’t hold back when New Times asked his opinion on the matter.",
    "Kelly has reserves of $23.3 million, compared to Lamon's $7.2 million.",
    "Arizona voters say one Republican candidate hoping to replace U.S.",
    "What sets it apart is the backlash from voters inside his party.",
    "But the same cannot be said for A New Dawn and his other TV ads.",
    "“He says he’s going to be the savior of Arizona,” Packard said.",
    "“Nothing motivates people to act like a deadline,” Puetz said.",
    "That didn’t lose Lamon too many brownie points in the GOP.",
    "Lamon has promised to spend $50 million by Election Day.",
    "He has spent more than $90,000 on campaign ads so far.",
    "“These are dark times,” Lamon says in the ad.",
    "“It’s wholly inappropriate and offensive.",
    "“I wouldn’t be wasting it on politics.”",
    "It was universally slammed on Twitter.",
    "“It should be concerning to everybody.",
    "It ended her career."
  ]
}