{
  "id": 4931,
  "mediaId": 8428,
  "date": "2022-04-23",
  "headline": "Kari Lake files injunction to STOP voting machines in Arizona",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/04/kari-lake-e1650736990484.png",
  "link": "https://www.rsbnetwork.com/news/kari-lake-files-injunction-to-stop-voting-machines-in-arizona/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Summer Lane",
  "authorUrl": "https://www.rsbnetwork.com/author/summer-lane/",
  "termIds": [
    2706,
    4623,
    1126,
    749,
    6517,
    6729,
    5949,
    6292,
    6360
  ],
  "sentences": [
    "“The election [2020] was a sham,” she stated during an interview with Dan Ball on “Real America.”\nLake’s team continued, “Just as the government cannot insist on ‘trust me,’ so too, private companies that perform governmental functions, such as vote counting, cannot be trusted without verification.”\nThey also noted that if Arizona Attorney General Mike Brnovich fails to defend election integrity in the Grand Canyon State for the midterm election, “This will sink him if he makes the wrong choice.”",
    "According to an official statement from Kari Lake’s team, the plaintiffs have a constitutional and statutory right to have ballots counted “accurately and transparently, so that only legal votes determine the winners of each office contested in the Midterm Election.”\nFurther, they stated that “Election voting machines cannot be deemed reliably secure and do not meet the constitutional and statutory mandates to guarantee a free and fair election.",
    "The use of untested and unverified election voting machines violates the rights of the plaintiffs and their fellow voters and office seekers, and it undermines public confidence in the validity of election results.”\nKari Lake has voiced her support for election reform in Arizona throughout her campaign, pointing to the countless reports of election fraud that have surfaced in both Maricopa County and Pima County and the rest of the nation.",
    "Republican gubernatorial candidate Kari Lake has filed an injunction with a federal court to prohibit electronic voting machines in the state of Arizona ahead of the upcoming election.",
    "The defendants are Lake’s Democrat opponent in the gubernatorial race Katie Hobbs, the Maricopa County Board of Supervisors, and the Pima County Board of Supervisors.",
    "In April, Lake called for the decertification of 2020 presidential election results in Arizona and Wisconsin amid staggering fraud reports.",
    "The injunction would remove Dominion voting machines for the 2022 elections."
  ]
}