{
  "id": 8363,
  "mediaId": 2574,
  "date": "2022-04-09",
  "headline": "With Roe in the Balance, Blue States Push for Abortion on Demand",
  "image": "https://freebeacon.com/wp-content/uploads/2022/04/supreme-court-hears-mississippi-abortion-case-e1649433559413.jpg",
  "link": "https://freebeacon.com/democrats/with-roe-in-the-balance-blue-states-push-for-abortion-on-demand/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patrick Hauf",
  "authorUrl": "https://freebeacon.com/author/patrick-hauf/",
  "termIds": [
    0
  ],
  "sentences": [
    "Democratic legislators in Maryland and California proposed bills this year that go even further, preventing legal action against medical professionals who provide \"perinatal\" abortions, a term used to describe babies in the immediate weeks before and after birth.",
    "But if Roe is overturned, states could legislate on abortion as they choose: The pro-abortion Guttmacher Institute estimates that in the absence of Roe, existing laws in 21 states would limit abortions, while 16 states would protect abortions to some degree.",
    "Democrat-led statehouses across the country have moved to protect and expand abortion access, including constitutional amendments that would recognize abortion up until birth as a human right, preempting any potential pro-life legislation at the state level.",
    "Dr. Ingrid Skop, a practicing obstetrician-gynecologist of more than 25 years, said the legislation could leave room for legal interpretations that allow abortion providers to finish botched late-term abortions even if the baby is delivered alive.",
    "Sue Liebel, state policy director of the pro-life Susan B. Anthony List, said the Maryland and California bills on \"perinatal\" abortion would further the Democrats' extreme position on terminating pregnancies.",
    "Democratic-controlled legislatures in Colorado, Vermont, and New Jersey passed bills in recent months to recognize a right to abortion on demand, joining more than a dozen states that have similar measures.",
    "Democratic lawmakers in each state responded with amendments to specify that abortions can only be performed during pregnancy, but some medical professionals warn the term \"perinatal\" is still too vague.",
    "Other bills that blue states passed this year include Maryland's expansion of which medical professionals can perform abortions as well as a plan in Oregon to allocate $15 million to fund abortions.",
    "The House of Representatives last year passed a bill that would put an end to all abortion restrictions nationwide in favor of abortion on demand, but the bill was spiked in the Senate in February.",
    "Democrats\nAs the Supreme Court prepares to rule on a case that could overturn Roe v. Wade, several blue states have in recent months enshrined so-called abortion rights in their constitutions.",
    "A majority of Americans support abortion access in the first trimester, but roughly two-thirds believe abortion should be illegal in most cases in the second trimester.",
    "And former Virginia governor Ralph Northam said a woman in certain circumstances should be able to decide with a physician whether to kill her child after birth.",
    "Supporters of the bills said they are intended to prevent the legal loophole of Texas's six-week abortion ban, which allows citizens to sue abortion providers.",
    "Florida, West Virginia, and Arizona all advanced or passed 15-week abortion bans that mimic the Mississippi law debated at the Supreme Court.",
    "Katie Hobbs, a Democratic candidate for governor in Arizona, refused to say if there should be any limits on abortion in an April interview.",
    "Several states have attempted to expand access to chemical abortion pills, which have become the most popular method of abortion nationwide.",
    "Many of the pro-abortion bills omit the terms \"woman\" or \"women,\" which they replace with \"pregnant individual\" or \"pregnant person.\"",
    "Other states have proposed bills that prevent legal action against abortion providers, which critics claim could permit infanticide.",
    "The Supreme Court will decide the fate of Roe this spring in a case that regards the legality of Mississippi's 15-week abortion ban.",
    "\"I think this law is trying to protect the abortionist from prosecution in that situation,\" Skop told the Washington Free Beacon.",
    "Current legal precedent prohibits states from banning abortion prior to fetal viability, which is defined as roughly 24 weeks.",
    "Fetuses in the second trimester, which begins at 14 weeks, have all their major organs and may be able to feel pain.",
    "Opposition to abortion access in the third trimester sits at 80 percent, according to a June Associated Press poll.",
    "The states' actions join recent efforts by Democrats to expand abortion access, even up to the moment of birth.",
    "Jay Inslee (D.) in March signed a bill into law that prohibits legal action against abortion providers.",
    "Republican-run states have passed several abortion bans this year in anticipation of a Roe overhaul.",
    "Oklahoma sent a bill to the governor's desk in April that would make performing abortions a felony.",
    "\"Obviously Democrats are not trying to just keep abortion rights,\" Liebel told the Free Beacon.",
    "Opponents of the bills, however, said the \"perinatal\" language would legalize infanticide.",
    "Idaho passed a six-week abortion ban in March that mimics Texas's civil-enforcement law.",
    "\"They're trying to take it to their ultimate level, which is murder.\"",
    "In Washington, meanwhile, Gov."
  ]
}