{
  "id": 8422,
  "mediaId": 2888,
  "date": "2022-04-06",
  "headline": "Arizona Supreme Court Rejects State GOP Lawsuit to Eliminate Mail-In Voting",
  "image": "https://truthout.org/wp-content/uploads/2022/04/2022_0406-arizona-vote-1200x675.jpg",
  "link": "https://truthout.org/articles/arizona-supreme-court-rejects-state-gop-lawsuit-to-eliminate-mail-in-voting/",
  "mediaOutlet": "truthout.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Walker",
  "authorUrl": "",
  "termIds": [
    4623,
    104,
    392,
    99,
    91,
    1269,
    1126,
    5949
  ],
  "sentences": [
    "Republicans issued the request to Arizona’s highest court earlier this year, asking it to dismantle the mail-in voting system, or, failing that, to eliminate the “no excuse” provision of its statute that allows any eligible voter in the state to request an absentee ballot.",
    "The Arizona Republican Party’s attempt to abolish or severely curtail mail-in voting in the state is part of a nationwide push by the GOP to place more restrictions on voting in response to former President Donald Trump’s loss in the 2020 election.",
    "Nevertheless, the party argued in its lawsuit that “in-person voting at the polls on a fixed date (election day) is the only constitutional manner of voting in Arizona.”\nAt the time, Democrats spoke out against the lawsuit.",
    "Still, the temporary win for voting rights will likely be enough to ensure that mail-in voting remains an option for registered voters in the state, at least through the 2022 midterm elections later this year.",
    "Recent polling indicates that Arizonans overwhelmingly support keeping voting by mail as an option in elections, with 74 percent backing the measure and only 10 percent saying they oppose it.",
    "“Abolishing early voting doesn’t make our elections more secure — it just makes it harder for eligible Arizonans to vote,” Hobbs, who is also running for governor, wrote in a tweet.",
    "“This is yet another attempt by the Arizona Republicans to make it harder for people to vote,” said state Sen. Raquel Terán, who is also the chair of the Arizona Democratic Party.",
    "“These partisan attacks on our freedom to vote are about suppressing the vote, not protecting it.”\nAlthough the ruling is a win for voting rights, the victory may be short-lived.",
    "Earlier this week, Arizona Secretary of State Katie Hobbs, a Democrat and a defendant in the lawsuit, condemned the state GOP’s attempt to eradicate mail-in voting.",
    "Arizona Republicans were hopeful that the state Supreme Court would rule in their favor before November, tossing out mail-in voting before this year’s races.",
    "In its ruling, the Arizona state Supreme Court said that they rejected the Republican Party’s lawsuit because it hadn’t gone through the proper channels.",
    "On Tuesday, the Arizona state Supreme Court rejected a lawsuit from the state’s Republican Party that sought to completely eliminate mail-in voting.",
    "That provision has been allowed in the state since 1991, meaning that it has been utilized in the last eight presidential election cycles.",
    "Any attempt to dismantle mail-in voting would be an unpopular choice in the state.",
    "The party can resubmit their complaint in lower state courts, the court said.",
    "Never miss the news and analysis you care about."
  ]
}