{
  "id": 8542,
  "mediaId": 2664,
  "date": "2022-04-06",
  "headline": "GOP-led Arizona Supreme Court shuts down Republican bid to ban early voting",
  "image": "https://www.rawstory.com/media-library/right-wing-judges-threaten-to-toss-minnesota-ballots-that-don-t-arrive-by-election-day-even-if-they-were-sent-on-time.jpg?id=27622524&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.rawstory.com/gop-led-arizona-supreme-court-shuts-down-republican-bid-to-ban-early-voting/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.rawstory.com/u/jonskolniksalon",
  "termIds": [
    5568,
    104,
    392,
    99,
    1126,
    1269,
    5949
  ],
  "sentences": [
    "The decision stems from a lawsuit originally filed by the Arizona Republican Party, along with its secretary, Yvonne Cahill, who argued that early voting is unconstitutional and that the court should, at a minimum, ban absentee voting for anyone who does not have a clear reason for voting by mail.",
    "State Democrats, who previously blasted the lawsuit, have celebrated the decision as a win for voting rights advocates across the Grand Canyon State amid a Republican-led effort to pass bills that would make it harder to vote for minorities, the elderly, and people with disabilities.",
    "Despite conservative claims of widespread fraud in the 2020 election, there is no substantive evidence of foul play having occurred in any battleground states, including Arizona, where 90% of voters casted a ballot by mail, according to the Citizen's Clean Election Commission.",
    "On Tuesday, however, Arizona Supreme Court Chief Justice Robert Brutinel, who was appointed by former Republican Governor Jan Brewer, shot down the GOP's general premise, saying that the party's suit did not meet the factual criteria required to establish standing.",
    "The law was put in place during the GOP-led audit of Maricopa County, a months-long, circus-like affair that ultimately revealed President Biden had defeated Donald Trump in the 2020 election by a wider margin than previously reported.",
    "\"Today, the Arizona Supreme Court dismissed a dangerous lawsuit that threatened early voting in the state and challenged provisions of the Elections Procedures Manual,\" tweeted Katie Hobbs, Arizona's Democratic secretary of state.",
    "NOW WATCH: Liberal derails Fox News host's Biden smear: 'His poll right now is the highest Trump ever reached'\nLiberal derails Fox News host's Biden smear: 'His poll right now is the highest Trump ever reached'",
    "Doug Ducey, for his part, has also come out against the idea of banning early voting, saying that \"it would undo the work of many Republican governors and secretaries of state over the past several decades.\"",
    "Just last week, Ducey signed a bill requiring the state's residents to provide proof of citizenship and residency to cast a ballot – criteria that used to apply to state elections only.",
    "The Arizona Supreme Court on Tuesday denied a request by the state Republican Party to outlaw early voting, a practice that has historically aided participation in elections.",
    "If the court could not deem early voting unconstitutional, the suit also asked the Supreme Court to eliminate ballot drop boxes or ban ballot counting prior to Election Day.",
    "And last May, the governor signed a measure that effectively purged all voters from the state's permanent early voting list.",
    "Last month, the governor called the state Republican Party's lawsuit \"poorly crafted,\" according to The Arizona Daily Star.",
    "\"Arizona voters will still be able to vote early, access drop boxes, and make their voices heard.\"",
    "Still, Arizona Republicans have largely made it their mission to ensure \"election integrity.\"",
    "All seven judges on the state's Supreme Court were appointed by a Republican governor.",
    "It remains unclear whether the GOP will now opt to file a case in Superior Court.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Subscribe to our morning newsletter, Crash Course.",
    "Republican Gov."
  ]
}