{
  "id": 8588,
  "mediaId": 2730,
  "date": "2022-04-06",
  "headline": "GOP Rep Says People Should Hit a Certain Age Before Making ‘Life-Altering’ Decisions About Gender Identity",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/139/93133a65-c067-4464-bbdc-aabeeeb56179.jpg",
  "link": "https://townhall.com/tipsheet/madelineleesman/2022/04/06/gop-rep-says-people-should-hit-a-certain-age-before-making-life-altering-decisi-n2605511",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Leesman",
  "authorUrl": "https://townhall.com/tipsheet/madelineleesman/",
  "termIds": [
    4623,
    5252,
    2915,
    1126,
    1489,
    1394,
    6238
  ],
  "sentences": [
    "— Lauren Boebert (@laurenboebert) April 1, 2022\nLast Thursday, both the United States Department of Health and Human Services’ Office of Population Affairs and the Substance Abuse and Mental Health Services Administration's National Child Traumatic Stress Network released documents on “Transgender Day of Visibility” promoting “gender-affirming” healthcare for minors.",
    "“Why is it so unreasonable to require people to reach a certain level of maturity before making life-altering decisions about their sexuality and identity?”\nWe require people to be 21 to purchase alcohol beverages, and 21 to purchase tobacco products.",
    "Source: AP Photo/Jacquelyn Martin\nRepublican Rep. Lauren Boebert, from Colorado, said Friday that children should be required to reach a certain age before they make life-altering decisions regarding sexual orientation and gender identity.",
    "The reason is simple, and common sense – this is a decision that will dramatically affect the rest of an individual’s life, including the ability of that individual to become a biological parent later in life,” Ducey wrote.",
    "Republican State Rep. Bruce Skaug, who sponsored the bill, told the House State Affairs Committee that children experiencing gender dysphoria should undergo mental health treatment rather than gender affirming treatment.",
    "“If we do not allow minors to get a tattoo, drink alcohol, smoke cigarettes, sign a legal contract, why would we allow them to go through these physical mutilations because of their feelings at the time,” he said.",
    "In addition, he said that children are too young to be making decisions of this magnitude that could alter the course of their lives, NPR-affiliated Boise State Public Radio reported.",
    "Senate Bill 1138 states that “a physician or other health care professional may not provide gender transition procedures to any individual under eighteen years of age.\"",
    "In a letter to Arizona Secretary of State Katie Hobbs, Ducey explained that this type of surgery is irreversible and has a lasting impact on a person’s life.",
    "Why is it so unreasonable to require people to reach a certain level of maturity before making life-altering decisions about their sexuality and identity?",
    "Doug Ducey signed a series of bills, one of which, Senate Bill 1138, prohibits minors from underdoing sex reassignment surgey, as Townhall covered.",
    "“It’s a bill to get proper treatment and to prevent them from lifelong, permanent decisions that will make them sterile and mutilate their bodies.”",
    "“We require people to be 21 to purchase alcohol beverages, and 21 to purchase tobacco products,” Boeert wrote on Twitter.",
    "Lawmakers in Idaho also created legislation that would outlaw “gender-affirming health care” for minors.",
    "1138 delays and irreversible gender reassignment surgery until the age of 18.",
    "The day before, Arizona GOP Gov.",
    "“S.B."
  ]
}