{
  "id": 8795,
  "mediaId": 2532,
  "date": "2022-04-07",
  "headline": "Whitmer moves to protect Michigan's abortion rights ahead of Supreme Court decision that could upend Roe v. Wade",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/04/07/83276733-b698-4738-aa6c-4958239a6815/thumbnail/1200x630/23b009628644cd3fc37c1635ba29a508/gettyimages-1239056750.jpg",
  "link": "https://www.cbsnews.com/news/abortion-rights-michigan-gretchen-whitmer-sues-prosecutors/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Ewall-Wice",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Ron DeSantis signs 15-week abortion ban bill into law\n Kentucky lawmakers override governor's veto of abortion ban\n Yelp will pay for employees who need to travel to get abortions\n Oklahoma governor signs bill to make almost all abortions illegal\n More\nIn:\nAbortion\n Sarah Ewall-Wice\nCBS News reporter covering economic policy.",
    "Unlike these Democratic governors who are signing legislation passed by Democratic legislatures, Whitmer's route runs through the courts because the Michigan legislature is majority-Republican and would not pass a law to protect abortion rights.",
    "The move comes as Democratic governors across the nation brace for decisions about abortion access to be left to states for the first time in more than 50 years, a potentially critical issue that is likely to resonate in the midterm elections.",
    "Whitmer is preemptively suing 13 elected county prosecutors in Michigan who have an abortion clinic within their jurisdiction, a move intended to circumvent a 1931 Michigan abortion law that would ban abortion even in cases of rape or incest.",
    "Anticipating that the U.S. Supreme Court may overturn or weaken the landmark Roe v. Wade case protecting abortion rights, Michigan Governor Gretchen Whitmer is suing county prosecutors in her state in a bid to protect legal abortion.",
    "Whitmer, who is up for reelection in November, is using a state-specific constitutional power conferred on her as governor to ask the Michigan Supreme Court to directly take up her lawsuit and recognize a right to abortion.",
    "This comes as the U.S. Supreme Court is set to make a ruling by the end of June in the case of Dobbs v. Jackson Women's Health Organization, which considers the constitutionality of Mississippi's 15-week abortion ban.",
    "In response to the governor's actions, seven Michigan county prosecutors released their own statement in support of her efforts, saying they \"cannot and will not support criminalizing reproductive freedom.\"",
    "Last month, Arizona's governor signed into law a 15-week abortion ban, Idaho's governor signed a 6-week abortion ban, and South Dakota's governor also signed abortion restrictions.",
    "They point to a recent debate in Arizona, where Democratic gubernatorial candidate Katie Hobbs didn't specify if she supports the state's current ban on abortions after 15 weeks.",
    "This Democrat Governor candidate's inability or refusal to answer underscores how important this question is,\" said Republican National Committee spokesperson Nathan Brand.",
    "\"No matter what happens to Roe, I am going to fight like hell and use all the tools I have as governor to ensure reproductive freedom is a right for all women in Michigan.",
    "The law, which is still on the books, is currently not in effect because the federal 1973 ruling in Roe v. Wade supersedes state law and protects women's abortion rights.",
    "If the high court, which now has a 6-3 conservative majority, were to weaken or strike down Roe this session, it is likely that the Mississippi case would be the vehicle.",
    "\"This is no longer theoretical: it is reality,\" Whitmer said in a statement about the possibility that the U.S. Supreme Court could overturn Roe v. Wade this session.",
    "A woman must be able to make her own medical decisions with the advice of a healthcare professional she trusts – politicians shouldn't make that decision for her.\"",
    "At the same time, Planned Parenthood of Michigan and one of its providers filed a separate lawsuit to block the enforcement of the 1931 abortion ban.",
    "Across the country, 26 states would be likely to ban abortion according to the Guttmacher Institute, a pro-abortion rights research organization.",
    "If Roe v. Wade were to be overturned, more than 2 million women in Michigan would lose access to safe and legal abortion, Whitmer's office says.",
    "Meanwhile, multiple groups including the ACLU of Michigan are collecting signatures for a ballot measure to protect abortion rights in Michigan.",
    "If the U.S. Supreme Court refuses to protect the constitutional right to an abortion, the Michigan Supreme Court should step in,\" she added.",
    "Republicans have been preparing to counter Democrats on abortion by pressing Democratic candidates on what limits on abortion they advocate.",
    "Republican governors and legislators, too, have been making plans in light of the possibility that the federal law on abortion may change.",
    "Colorado Governor Jared Polis, another Democrat up for reelection, codified Roe v. Wade into state law earlier this year.",
    "In California, Governor Gavin Newsom last month signed legislation eliminating out of pocket costs for abortion as well.",
    "Ahead of the Supreme Court decision, CBS News polling found a majority of Americans support keeping Roe v Wade in place.",
    "She added that a total abortion ban, like Michigan's 1931 law, would rob women of their productive and economic freedom.",
    "\"However we personally feel about abortion, a woman's health, not politics, should drive important medical decisions.",
    "If the landmark abortion case is overturned, most said they still want abortion to remain legal in their state.",
    "New Jersey Governor Phil Murphy also signed a law in January protecting women's right to an abortion.",
    "Should they obtain the necessary signatures, that measure could be on the ballot as soon as November.",
    "The Battle Over Abortion\n More\n Doctors face challenges to provide abortion access\n Florida Gov.",
    "On Tuesday, Oklahoma's state House approved a bill that would make performing abortion a felony.",
    "In March, Texas' Supreme Court allowed for its recently passed abortion ban to remain in place.",
    "\"This is the question every pro-abortion Democrat candidate for office will be asked this year.",
    "In Vermont, a constitutional amendment will go before voters in November.",
    "But if Roe v. Wade is overturned, it would automatically be triggered.",
    "Democrats currently hold a 4 to 3 majority on Michigan's high court.",
    "They have been taking up legislature to limit abortion access.",
    "Twitter"
  ]
}