{
  "id": 8804,
  "mediaId": 2680,
  "date": "2022-04-05",
  "headline": "Arizona court declines GOP request to invalidate mail voting",
  "image": "https://www.sfgate.com/img/pages/article/opengraph_default.png",
  "link": "https://www.sfgate.com/news/article/Arizona-court-declines-GOP-request-to-invalidate-17060029.php",
  "mediaOutlet": "sfchronicle",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JONATHAN J. COOPER",
  "authorUrl": "",
  "termIds": [
    4623,
    2765,
    392,
    99,
    1126,
    6515,
    5949
  ],
  "sentences": [
    "If the justices are unwilling to go that far, the GOP asked the court to roll back the expansion of no-excuse absentee voting since 1991, eliminate ballot drop boxes, prohibit ballot counting before election day, or prohibit voting absentee on initiatives and referenda.",
    "PHOENIX (AP) — The Arizona Supreme Court declined Tuesday to consider a request by the Arizona Republican Party to eliminate the early voting system used by 90% of the state's voters and require nearly all voters to cast ballots in person on Election Day.",
    "The lawsuit comes amid GOP efforts on many fronts to remake the system for casting and counting votes as former President Donald Trump repeats the lie that he lost the 2020 election because of fraud in Arizona and other battleground states.",
    "The lawsuit filed in February argued absentee voting is unconstitutional and asked the justices to get rid of it or at least eliminate the no-excuse absentee balloting system Arizona adopted in 1991 and has steadily expanded ever since.",
    "The Arizona Republican Party and its combative chairwoman, Kelli Ward, have been at the forefront of Trump’s efforts to cast doubt on the 2020 election results and block the certification of Democratic President Joe Biden’s victory.",
    "The lawsuit also made two other arguments: that Secretary of State Katie Hobbs erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "The ballots are collected at a central warehouse, where workers confirm the signature on the outside of the ballot envelope matches signatures on file to verify the vote is legitimate.",
    "The court ruled that the case did not meet the limited criteria for a lawsuit filed directly to the state's high court but said the GOP could take its case to Superior Court.",
    "Spokespeople for the Arizona Republican Party and Alex Kolodin, the conservative lawyer whose firm filed the lawsuit, did not immediately respond to requests for comment.",
    "It was blasted by Democrats and voting rights advocates who said the argument was deeply flawed and aimed at undermining elections.",
    "The GOP did not challenge absentee voting for members of the military, which the state is required to allow by federal law.",
    "In 2020, 90% of Arizona voters used a ballot that arrived in the mail, which can be returned through the U.S.",
    "Postal Service, an official drop box run by county election officials or to a polling place.",
    "The latest lawsuit was filed by the state GOP and Yvonne Cahill, the party’s secretary.",
    "It was not immediately clear if the GOP would file the case in Superior Court.",
    "The lawsuit asked the justices to throw out all early voting procedures.",
    "There has been no widespread fraud.",
    "Ward is not named as a plaintiff."
  ]
}