{
  "id": 9498,
  "mediaId": 2618,
  "date": "2022-03-30",
  "headline": "‘Solely focused on our child’: Lunden Roberts finally breaks silence on Hunter Biden",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/30/solely_focused_on_our_child_lunden_roberts_finally_breaks_silence_on_hunter_biden_82323.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Morphet & Bruce Golding",
  "authorUrl": "",
  "termIds": [
    3858,
    1146
  ],
  "sentences": [
    "The mother of Hunter Biden’s love child has finally broken her silence — to disavow her lawyer’s prediction that President Biden’s scandal-scarred son will be charged with tax fraud.“I never said that I thought Hunter would be indicted — my attorney did,” Lunden Roberts exclusively told The Post this week.“His comment to media was without my authorization I might add,” she wrote in a text message.“I have never opined on Hunter’s financial affairs to anyone and do not anticipate doing so.”\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Mitt Romney’s going to need a good lawyer: Tulsi Gabbard is coming after him with a vengeance for the libelous lies he spread about her, having just sent a cease-and-desist letter to Mitt demanding that he stop spreading the “treasonous lies” lie about her.The brilliant, strongly worded letter (perhaps Romney could learn a thing or two about how to have a spine by reading through it a few times), starts on an unapologetically strong note, saying:Dear Senator Romney: Our firm represents former Representative and Lieutenant Colonel Tulsi Gabbard (“Representative Gabbard”) regarding false and defamatory statements you made about Representative Gabbard on Twitter.",
    "“Ads shouldn’t detract from important conversations about the climate crisis,” the company said in a statement outlining its new policy Friday.There was no indication that the change would affect what users post on the social media site, which along with Facebook has been targeted by groups seeking to promote misleading claims about climate change.The announcement coinciding with Earth Day\nJoe Biden was filmed shaking hands this week with a dangerous felon who lied to authorities about carrying an illegal firearm and tried to murder Kyle Rittenhouse.He’s a good Democrat.Via Michael Gallas.",
    "“That’s how badly white guys want to use the ‘N-word.’”“Honestly, I don’t understand why Elon even wants\nIn an interesting chain of events, Clarence Thomas, the senior Associate Justice of the Supreme Court of the United States, part of the conservative majority, was almost prevented from serving due to “a high-tech lynching,”, led by then-Senate Judiciary Committee Chairman Joseph R Biden Jr.As part of President Biden’s campaign pitch in 2019, the former Vice-President under Barack Obama said his administration would work to protect abortion “rights” and Roe.",
    "Elon Musk ribbed “Saturday Night Live” right back after the show mocked the tech billionaire’s intentions to take over Twitter and restore the kind of free speech he believes the platform has abandoned.“Weekend Update” segment regulars Colin Jost and Michael Che joked in the skit about Musk being a poor businessman and only wanting to buy the platform to allow white guys to say “the n-word.”“Elon Musk offered to buy Twitter for over $40 billion so he can loosen its free speech restrictions,” Che began the segment, The Daily Wire reported.",
    "This letter concerns an urgent matter\nCNN political analyst David Axelrod said Friday on “Anderson Cooper 360” that the lawsuit attempting to disqualify Rep. Marjorie Taylor Greene (R-GA) from reelection ballot access over her comments and tweets surrounding the January 6, 2021 riot at the Capitol will fail and increase her fundraising.Cooper said, “Do you think the case brought against Greene would be successful?” CNN legal analyst Jeffrey Toobin said, “No, I don’t.",
    "\"That December, Hunter Biden messaged assistant Katie Dodge asking for information about his firm, Rosemont Seneca.... “And just for clarification who is pay roll paid to now and for past nine months?” he asked, adding in subsequent messages, “So when you took what’s her name off and re directed her income did it also End my insurance.” “Past nine months has been you, me, Lunden, Hallie, Liz & Erin,” Dodge responded.",
    "The gloat fest over CNN+ becoming the sinking Titanic of leftist media continued for a second day on Friday as Fox News hosts Greg Gutfeld and Tucker Carlson skewered former Fox anchor Chris Wallace for jumping ship to the new streaming network only to find himself out of a job, at least temporarily.",
    "President Joe Biden tore into the GOP as the 'MAGA party' following the release of an explosive tape of House Minority Leader Kevin McCarthy in the days after the Capitol riot, termed a party dominated by figures like Ted Cruz as a 'different breed of cat.",
    "Wallace reportedly left because he didn’t like the opinions of other hosts on the network.Carlson appeared on “The Five” to promote an upcoming episode from his “Originals” series and was drawn into mocking Wallace by Gutfeld.",
    "(Tweet) During the trial of Kyle Rittenhouse in Wisconsin witness Gaige Grosskreutz was forced to admit that he was pointing a loaded gun at Kyle Rittenhouse while Rittenhouse was on the ground before he got his arm blown off.",
    "\"our child\", The President of the United States refuses to count your child as a grandchild, and Deadbeat tried to get the paternity case thrown out of court because your child couldn't possibly be his.",
    "What he did is unacceptable,' McCarthy can be heard telling fellow House leaders\nBefore his untimely death ten years ago, Andrew Breitbart's most famous quote was \"politics is downstream from culture.\"",
    "I think this is an embarrassment for Congresswoman Greene.”Cooper said, “David, does this just help her with her base?”Axelrod said, “Yeah, I totally agree with Jeff’s analysis except for one point.",
    "But more importantly, culture is downstream from religion.Andrew Breitbart was born in 1969, when the fundamental destruction of the unifying American religious narrative and morality had begun.",
    "Supreme Court Justice Clarence Thomas has again gone on the record saying that he believes the Roe v. Wade ruling from 1973 that allowed virtually unlimited abortions should be overturned.",
    "That concept is the basis for what is called the Breitbart Doctrine, which holds that in order to change politics, it is first necessary to change culture.Breitbart was partially correct.",
    "Rep. Alexandra Ocasio-Cortez slammed the Supreme Court on Thursday as 'imperialist' after it ruled that Puerto Ricans were not entitled to the same access to benefits as other Americans.",
    "Grosskreutz, 27, who had his gun in his hand as he stepped toward Rittenhouse, was severely wounded moments after Rittenhouse fatally shot two others in the streets of Kenosha.",
    "They’re going to try to play the Jan. 6 committee for all its worth, in the hopes that they find things to hurt Republicans with, like the tape of Rep. Kevin McCarthy (R-CA).",
    "'The president referenced newly revealed audiotapes of McCarthy (R-Calif.) fuming about Trump and claiming he admonished the former president in a private phone call.",
    "Twitter says it will no longer allow advertisers on its site who deny the scientific consensus on climate change, echoing a policy already in place at Google.",
    "But it’s well deserved because of the horrible policies they’ve put forth, and the terrible job that Joe Biden has done.So, they don’t have too many options.",
    "The verdict provoked outrage in Puerto Rico and disbelief among campaigners.Ocasio-Cortez, whose father's family came from the island, made her anger clear.",
    "In a cohesive, functional society whose members generally understand assumptions regarding faith and moral ideals, politics does indeed flow from culture.",
    "The court voted 8-1 that Congress had the power to exclude them from a benefits program that's available in all 50 states and the District of Columbia.",
    "In all seriousness though of course Hunter's baby mama isn't going to \"opine\" on Crack Head Bobby's financial affairs ie ill gotten gains.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "One excerpt has McCarthy claiming that Trump 'told me he does have some responsibility for what happened.",
    "Interest rates are up near 7% now, the highest rates in years and still they are way behind inflation.",
    "Now she says 'our'... Wonder if it's a bribe or threat that made baby-stripper-momma fall in line.",
    "Gutfeld has been on a tear, gleefully mocking Wallace at every opportunity for quitting Fox News.",
    "Inflation is at an all-time high by some measurements and at 50-year highs by other measurements.",
    "They’re trying the redistricting game in the hopes that they can steal some seats that way.",
    "The Dow dropped nearly 1,000 points today – the worst day for the Dow since June 2020.",
    "“But currently only you me & Erin.”\nDarn it #3 you owe me a keyboard and monitor.",
    "Democrats are up a creek without a paddle as we head toward the midterms.",
    "Your donation helps keep our discussions going and our voices heard.",
    "(Snip) With inflation at all-time highs, Biden’s economy is a mess.",
    "They know that they are quite likely to get slaughtered badly.",
    "I just spit out my lunch chocolate milk from laughing so hard.",
    "What I find outrageous is no mention she worked for biden.",
    "This all happened due to Biden’s reckless spending.",
    "The Biden economy is doing bad and getting worse.",
    "The cost of gasoline has reached all-time highs.",
    "She doesn't want Bobby to cut her off.",
    "The claim is she was JUST a stripper.",
    "''I've had it with this guy.",
    "She was a consultant.",
    "Thank you.",
    "B.s."
  ]
}