{
  "id": 9945,
  "mediaId": 8350,
  "date": "2022-04-01",
  "headline": "Arizona AG Brnovich believes Biden administration’s legal analysis ‘flawed’ on new transgender law",
  "image": "https://ktar.com/wp-content/uploads/2021/09/brnovich-biden-split-fb.jpg",
  "link": "https://ktar.com/story/4981840/arizona-ag-brnovich-believes-biden-administrations-legal-analysis-flawed-on-new-transgender-law/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KTAR.COM",
  "authorUrl": "https://ktar.com/story/author/ktar-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "In the letter, the DOJ said “a ban on gender-affirming procedures, therapy or medication may be a form of discrimination against transgender persons, which is impermissible unless it is ‘substantially related’ to a sufficiently important governmental interest.”\nSenate Bill 1138 restricts gender reassignment surgery until the age of 18.",
    "Ducey, in a letter directed to Secretary of State Katie Hobbs explaining his decision, related restricting transgender surgery to protecting children from making other irreversible decisions like buying certain products or participating in activities that can have lifelong health implications.",
    "“We think their legal analysis is flawed and we are very confident what was signed into law was consistent with the constitution and all other federal statues,” Brnovich told KTAR News 92.3 FM on Friday.",
    "The U.S. Department of Justice’s Civil Rights Division sent a letter Thursday to state attorneys general warning that transgender-restricting legislation could break anti-discrimination laws.",
    "“As the Arizona attorney general, I do not need out of state, national interests trying to impose their will on hardworking Arizonans,” Brnovich said.",
    "“So we will fight and push back against whatever the Biden administration tries to do.”\nKTAR News 92.3 FM’s Taylor Tasler contributed to this report.",
    "PHOENIX — Arizona Attorney General Mark Brnovich is prepared to go to court with the Biden administration over a bill signed Wednesday by Gov.",
    "Brnovich expects legal action to happen soon, whether its from his side or the Biden administration.",
    "Doug Ducey that restrict transgender surgeries."
  ]
}