[
  {
    "id": 7078,
    "mediaId": 2715,
    "date": "2022-01-22",
    "sentence": "Hours later, President Biden, Ohio governor <span class='selected-term'>Mike DeWine</span>, US Secretary of Commerce Gina Raimondo, Intel CEO Pat Gelsinger, and other executives and local officials suggested the up-to-$100 billion development could be a panacea for a wide variety of issues, too — including global competitiveness, national security, the chip shortage, the high price of cars, racial and gender gaps in STEM employment, even inflation itself.",
    "author": "Sean Hollister",
    "title": "What we know about Intel’s $20 billion bet on Ohio"
  },
  {
    "id": 5785,
    "mediaId": 2537,
    "date": "2022-02-07",
    "sentence": "",
    "author": "Laura A. Bischoff",
    "title": "Mike DeWine and family members are going to the Super Bowl to cheer on Bengals"
  },
  {
    "id": 6308,
    "mediaId": 2748,
    "date": "2022-02-09",
    "sentence": "Jen Psaki\nSonia Sotomayor, US Supreme Court\nKathy Hochul, Governor of NY\nEric Topol (Scripps)\nZubin Damania (aka Zdoggmd)\nMonica Gandhi (UCSF)\n“Ed” (if you read the comments to my posts, you’ll know who I’m talking about)\nDonald Trump (although he’s more recently spoken out against mandates, he has not spoken out against the vaccines themselves)\nMike Pence\nDeborah Brix\nVinay Prasad (even though he’s right on masks and calling out the misinformation on myocarditis, he’s wrong on vaccines and is costing lives)\nNancy Pelosi\nAnna Eshoo\nBig Bird\nOther members of Congress (with the notable exception of Senator Ron Johnson who is heroic)\nRalph Baric, University of North Carolina Chapel Hill\nPeter Daszak, EcoHealth Alliance, without whom we wouldn’t have a pandemic\nJens Kuhn and Sina Bavari\nMost local officials within our towns/cities/municipalities who supported vaccine/mask mandates\nSchool Boards who supported vaccine/mask mandates\nTeachers unions\nMedical doctors who recommended the vaccines/masks, especially for kids and who ignored early treatment for their patients\nHospitals who took the grift and complied with CDC directives and forbade the use of ivermectin and other life saving treatments\nBusinesses who fired people who didn’t comply with vaccine mandates\nChurches who tell people to get vaccinated\nGovernor Eric Holcomb (Indiana) as well as other governors pushing the narrative (Notable exception: Ron DeSantis)\n<span class='selected-term'>Mike DeWine</span> (R - governor of Ohio).",
    "author": "Steve Kirsch",
    "title": "DHS: Here is a list of top COVID misinformation spreaders you should investigate ASAP"
  },
  {
    "id": 5833,
    "mediaId": 2919,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Kaylyn Hlavaty",
    "title": "Gov. DeWine wages assortment of Cincinnati food in Super Bowl wager with California governor"
  },
  {
    "id": 2880,
    "mediaId": 2658,
    "date": "2022-03-18",
    "sentence": "",
    "author": "",
    "title": "A paper shortage is looming over the 2022 elections. Seriously."
  },
  {
    "id": 2283,
    "mediaId": 2790,
    "date": "2022-03-25",
    "sentence": "Ohio's Republican governor <span class='selected-term'>Mike DeWine</span> is opposing a partial repeal of his state's gas tax.",
    "author": "Ayana Archie",
    "title": "California's governor is proposing $11 billion of relief from record gas prices"
  },
  {
    "id": 1968,
    "mediaId": 2550,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "Morning Digest: Tennessee GOP's bill would block Trump's pick, but they'll need courts to agree"
  },
  {
    "id": 1486,
    "mediaId": 2694,
    "date": "2022-04-03",
    "sentence": "On the afternoon of March 3, 2020, Governor <span class='selected-term'>Mike DeWine</span> stepped to a lectern inside the Ohio statehouse to announce his most difficult pandemic decision.",
    "author": "Russell Berman",
    "title": "The Last of the Establishment Republicans"
  },
  {
    "id": 525,
    "mediaId": 2537,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Laura A. Bischoff",
    "title": "Mike DeWine won't specify cost to send security team to Super Bowl, Enquirer files suit"
  }
]