[
  {
    "id": 6362,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "Arizona GOP Senate candidate <span class='selected-term'>Blake Masters</span> last month raised $550,000 in 36 hours when he auctioned off digital tokens depicting the cover of a book he wrote with tech investor and GOP megadonor Peter Thiel.",
    "author": "",
    "title": "Former Manchin chief signs 2"
  },
  {
    "id": 6922,
    "mediaId": 2636,
    "date": "2022-01-27",
    "sentence": "Trump reserved a warmer reception for <span class='selected-term'>Blake Masters</span>, calling him “a really terrific guy” at the rally.",
    "author": "",
    "title": "The Man at the Center of Arizona’s Primary"
  },
  {
    "id": 6424,
    "mediaId": 2512,
    "date": "2022-01-28",
    "sentence": "Since Trump has shown support for Bronvich's opponent, <span class='selected-term'>Blake Masters</span>, he appears to be apprehensive about further rocking the boat.",
    "author": "Meaghan Ellis",
    "title": "Rachel Maddow slams Arizona AG for failure to deal with electors scandal"
  },
  {
    "id": 6337,
    "mediaId": 2552,
    "date": "2022-02-07",
    "sentence": "Advertisement\nHe reportedly plans to support Republicans in line with Mr Trump’s agenda, such as <span class='selected-term'>Blake Masters</span> and JD Vance, in the 2022 midterm elections.",
    "author": "Giulia Bottaro",
    "title": "Trump-supporting tech billionaire quits Facebook to focus on politics"
  },
  {
    "id": 6124,
    "mediaId": 4418,
    "date": "2022-02-07",
    "sentence": "Thiel has already announced support for <span class='selected-term'>Blake Masters</span> who is running for the US Senate in Arizona.",
    "author": "Jake Lambert",
    "title": "Billionaire Peter Thiel to Step Down from Facebook Board to Support President Trump-Aligned Candidates in 2022"
  },
  {
    "id": 6086,
    "mediaId": 2584,
    "date": "2022-02-07",
    "sentence": "He recently donated $10m each to the Senate campaigns of <span class='selected-term'>Blake Masters</span>, who is running for a seat in Arizona, and JD Vance, who is running in Ohio.",
    "author": "Johana Bhuiyan",
    "title": "Peter Thiel, PayPal founder and Trump ally, to step down from Meta board"
  },
  {
    "id": 5543,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\n<span class='selected-term'>Blake Masters</span>: Well, exactly.",
    "author": "Jim Hoft",
    "title": "Blake Masters: “Joe Biden Violates the Constitution EVERY SINGLE DAY – a Culture of Lawlessness – Look at How They’re Going After President Trump!” (VIDEO)"
  },
  {
    "id": 5577,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "Thiel has already announced support for <span class='selected-term'>Blake Masters</span> who is running for the US Senate in Arizona.",
    "author": "Jim Hoft",
    "title": "Billionaire Peter Thiel to Step Down from Facebook Board to Support President Trump-Aligned Candidates in 2022"
  },
  {
    "id": 5781,
    "mediaId": 2748,
    "date": "2022-02-08",
    "sentence": "",
    "author": "",
    "title": "Blake Masters: “Joe Biden Violates the Constitution EVERY SINGLE DAY – a Culture of Lawlessness – Look at How They’re Going After President Trump!” (VIDEO)"
  },
  {
    "id": 6116,
    "mediaId": 2557,
    "date": "2022-02-11",
    "sentence": "It’s time for a showdown.”\nPromoted Content\nFellow GOP Senate candidate <span class='selected-term'>Blake Masters</span> said in a statement to The Arizona Republic, “Absurd and desperate.",
    "author": "DML News App",
    "title": "VIDEO: GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  },
  {
    "id": 5687,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "(RELATED: Gabby Giffords Gets Standing Ovation As She Returns To Congress To Vote)\n“Absurd and desperate,” fellow GOP Senate candidate <span class='selected-term'>Blake Masters</span> said in a statement to The Arizona Republic.",
    "author": "Andrew Trunsky",
    "title": "GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  },
  {
    "id": 4586,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "In addition to Brnovich, the current front-runner in the race, the field includes tech venture capitalist <span class='selected-term'>Blake Masters</span> and energy executive Jim Lamon.",
    "author": "",
    "title": "Ducey looms as last big question on 2022 Senate map"
  },
  {
    "id": 4618,
    "mediaId": 2664,
    "date": "2022-02-24",
    "sentence": "pic.twitter.com/5HD077MMf4\n— <span class='selected-term'>Blake Masters</span> (@bgmasters) February 22, 2022\nDon't be fooled by the faux-innocuous assertions of cultural history or the glib tokenism of mentioning Chuck Berry.",
    "author": "Amanda Marcotte",
    "title": "The real reason why the GOP loves Putin"
  },
  {
    "id": 4621,
    "mediaId": 2512,
    "date": "2022-02-24",
    "sentence": "A slightly slicker but similarly disturbing message is evident in a recent campaign ad by Peter Thiel-backed GOP candidate for Arizona's Senate seat, <span class='selected-term'>Blake Masters</span>.",
    "author": "Amanda Marcotte",
    "title": "Rick Scott's agenda underscores the love fest between the GOP and Vladimir Putin"
  },
  {
    "id": 3714,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "While I’m disappointed he decided not to run, Arizona will be an important part of our plan to win the majority back.”\nChris Hartline, a spokesperson for the NRSC, said Republicans “have great candidates running in Arizona, one of whom will beat Mark Kelly in November.”\nDucey’s decision to bypass the race removes a potential obstacle for the other Republican candidates, including state Attorney General Mark Brnovich; <span class='selected-term'>Blake Masters</span>, a venture capitalist; and Jim Lamon, an energy executive self-funding his campaign.",
    "author": "",
    "title": "Ducey won't run for Senate in Arizona"
  },
  {
    "id": 2239,
    "mediaId": 2641,
    "date": "2022-03-21",
    "sentence": "\"Brnovich is moving in the wrong direction and <span class='selected-term'>Blake Masters</span>, despite spending millions, is not resonating with voters.\"",
    "author": "Eric Mack",
    "title": "McLaughlin Poll: Jim Lamon Surges in Arizona GOP Senate Primary"
  },
  {
    "id": 2095,
    "mediaId": 2641,
    "date": "2022-03-21",
    "sentence": "\"Brnovich is moving in the wrong direction and <span class='selected-term'>Blake Masters</span>, despite spending millions, is not resonating with voters.\"",
    "author": "Eric Mack",
    "title": "McLaughlin Poll: Jim Lamon Surges in Arizona GOP Senate Primary"
  },
  {
    "id": 1212,
    "mediaId": 2746,
    "date": "2022-04-07",
    "sentence": "Mr. Kelly is set to square off against the winner of the spirited Republican primary race featuring Arizona Attorney General Mark Brnovich, venture capitalist <span class='selected-term'>Blake Masters</span>, solar energy entrepreneur Jim Lamon and retired Air Force Maj. Gen. Mick McGuire.",
    "author": "Seth McLaughlin",
    "title": "Eyeing reelection, Sen. Mark Kelly drifts away from Biden"
  }
]