[
  {
    "id": 4586,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "In addition to Brnovich, the current front-runner in the race, the field includes tech venture capitalist <span class='selected-term'>Blake Masters</span> and energy executive Jim Lamon.",
    "author": "",
    "title": "Ducey looms as last big question on 2022 Senate map"
  },
  {
    "id": 4331,
    "mediaId": 2540,
    "date": "2022-03-03",
    "sentence": "Current GOP Senate hopefuls looking to take on Kelly include state Attorney General Mark Brnovich, solar energy executive Jim Lamon, venture capitalist <span class='selected-term'>Blake Masters</span> and retired Air Force Maj. Gen. Mick McGuire.",
    "author": "Kyung Lah, Jeff Zeleny and Rachel Janfaza",
    "title": "Arizona Gov. Doug Ducey rules out US Senate bid and says he may endorse in GOP primary"
  },
  {
    "id": 3714,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "While I’m disappointed he decided not to run, Arizona will be an important part of our plan to win the majority back.”\nChris Hartline, a spokesperson for the NRSC, said Republicans “have great candidates running in Arizona, one of whom will beat Mark Kelly in November.”\nDucey’s decision to bypass the race removes a potential obstacle for the other Republican candidates, including state Attorney General Mark Brnovich; <span class='selected-term'>Blake Masters</span>, a venture capitalist; and Jim Lamon, an energy executive self-funding his campaign.",
    "author": "",
    "title": "Ducey won't run for Senate in Arizona"
  },
  {
    "id": 4139,
    "mediaId": 2605,
    "date": "2022-03-03",
    "sentence": "Gen. Mark Brnovich, solar executive Jim Lamon, venture capital executive <span class='selected-term'>Blake Masters</span> and retired Air Force Maj. Gen. Michael “Mick” McGuire, who used to lead the state’s National Guard.",
    "author": "Melanie MasonStaff Writer",
    "title": "Arizona Gov. Doug Ducey opts out of Senate run — a setback for GOP hopes"
  },
  {
    "id": 1678,
    "mediaId": 2557,
    "date": "2022-03-31",
    "sentence": "https://t.co/7G0bOOjUTd #azleg pic.twitter.com/WiJLv1HhXL\n— AZ House Republicans (@AZHouseGOP) March 30, 2022\n<span class='selected-term'>Blake Masters</span> of Arizona, a Republican candidate for U.S. Senate, released the following video message praising the newly-passed bill.",
    "author": "DML News App",
    "title": "REPORT: State will force voters to show proof of citizenship in bid to crack down on fraud"
  },
  {
    "id": 1414,
    "mediaId": 2859,
    "date": "2022-04-01",
    "sentence": "The crowded primary still includes Arizona Attorney General Mark Brnovich, retired Maj. Gen. Mick McGuire, former Arizona National Guard adjutant general, and venture capitalist <span class='selected-term'>Blake Masters</span>.",
    "author": "D. Hunter Schwarz",
    "title": "These 8 midterm races in the West could decide who controls Congress"
  }
]