[
  {
    "id": 5576,
    "mediaId": 2551,
    "date": "2022-02-11",
    "sentence": "+3\nView gallery\nDemocratic Senator Mark Kelly of Arizona is married to Gabby Giffords, the former congresswoman who was shot in the head at a constituent event in 2011\n+3\nView gallery\nThe ad garnered many critics although Mark Kelly's campaign has not commented but Jim Lamon's Republican primary rivals have\nKelly's campaign has not commented on the ad but Lamon's GOP primary opponents - <span class='selected-term'>Blake Masters</span>, a venture capitalist; and Michael 'Mick' McGuire, the retired adjutant general of the Arizona National Guard - criticized it.",
    "author": "Emily Goodin",
    "title": "Republican Senate candidate sparks fury with campaign ad showing him shooting at Biden, Nancy Pelosi and Mark Kelly - whose wife Gabby Giffords was shot in the head in 2011"
  },
  {
    "id": 5513,
    "mediaId": 2590,
    "date": "2022-02-11",
    "sentence": "pic.twitter.com/mJTbFuS0du\n— Jim Lamon (@jim_lamon) February 10, 2022\n<span class='selected-term'>Blake Masters</span> and Michael McGuire, two of Lamon’s GOP rivals in the race, led the chorus of criticism.",
    "author": "Lee Moran",
    "title": "GOP Sen Candidate Shoots At Biden, Pelosi Lookalikes In 'Disgusting' Ad"
  },
  {
    "id": 5687,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "(RELATED: Gabby Giffords Gets Standing Ovation As She Returns To Congress To Vote)\n“Absurd and desperate,” fellow GOP Senate candidate <span class='selected-term'>Blake Masters</span> said in a statement to The Arizona Republic.",
    "author": "Andrew Trunsky",
    "title": "GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  },
  {
    "id": 6116,
    "mediaId": 2557,
    "date": "2022-02-11",
    "sentence": "It’s time for a showdown.”\nPromoted Content\nFellow GOP Senate candidate <span class='selected-term'>Blake Masters</span> said in a statement to The Arizona Republic, “Absurd and desperate.",
    "author": "DML News App",
    "title": "VIDEO: GOP Senate Candidate Slammed For Ad That Shows Him Shooting At Biden, Pelosi"
  }
]