[
  {
    "id": 6770,
    "mediaId": 2716,
    "date": "2022-01-10",
    "sentence": "For instance, Democratic House candidate Shrina Kurani and Republican Senate candidate <span class='selected-term'>Blake Masters</span> have both offered NFTs as \"incentives for donors,\" albeit \"to varying degrees of success,\" Bloomberg reports (these are, after all, still \"the early days of crypto's push into politics\").",
    "author": "Brigid Kennedy",
    "title": "Congressional candidates turn to NFTs as form of campaign finance"
  },
  {
    "id": 5744,
    "mediaId": 2702,
    "date": "2022-02-03",
    "sentence": "The conservative Club for Growth’s political action committee is intervening in the Republican Senate primary in Arizona, endorsing venture capitalist <span class='selected-term'>Blake Masters</span> to take on Sen. Mark Kelly (D-Ariz.).",
    "author": "Max Greenwood",
    "title": "Club for Growth endorses Blake Masters in Arizona Senate race"
  },
  {
    "id": 5577,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "Thiel has already announced support for <span class='selected-term'>Blake Masters</span> who is running for the US Senate in Arizona.",
    "author": "Jim Hoft",
    "title": "Billionaire Peter Thiel to Step Down from Facebook Board to Support President Trump-Aligned Candidates in 2022"
  },
  {
    "id": 5832,
    "mediaId": 2644,
    "date": "2022-02-07",
    "sentence": "“Peter is truly an original thinker who you can bring your hardest problems and get unique suggestions.”\nThiel likewise praised Zuckerberg for his “intelligence, energy, and conscientiousness.”\n“His talents will serve Meta well as he leads the company into a new era,” Thiel said\nThiel is now reportedly expected to focus more of his time on conservative political causes, including senate bids by two of his proteges, <span class='selected-term'>Blake Masters</span> and JD Vance, according to the WSJ report.",
    "author": "Theo Wayt",
    "title": "Peter Thiel leaving Meta board, will reportedly focus on pro-Trump advocacy"
  },
  {
    "id": 6337,
    "mediaId": 2552,
    "date": "2022-02-07",
    "sentence": "Advertisement\nHe reportedly plans to support Republicans in line with Mr Trump’s agenda, such as <span class='selected-term'>Blake Masters</span> and JD Vance, in the 2022 midterm elections.",
    "author": "Giulia Bottaro",
    "title": "Trump-supporting tech billionaire quits Facebook to focus on politics"
  },
  {
    "id": 6086,
    "mediaId": 2584,
    "date": "2022-02-07",
    "sentence": "He recently donated $10m each to the Senate campaigns of <span class='selected-term'>Blake Masters</span>, who is running for a seat in Arizona, and JD Vance, who is running in Ohio.",
    "author": "Johana Bhuiyan",
    "title": "Peter Thiel, PayPal founder and Trump ally, to step down from Meta board"
  },
  {
    "id": 6124,
    "mediaId": 4418,
    "date": "2022-02-07",
    "sentence": "Thiel has already announced support for <span class='selected-term'>Blake Masters</span> who is running for the US Senate in Arizona.",
    "author": "Jake Lambert",
    "title": "Billionaire Peter Thiel to Step Down from Facebook Board to Support President Trump-Aligned Candidates in 2022"
  },
  {
    "id": 5881,
    "mediaId": 2584,
    "date": "2022-02-13",
    "sentence": "Last year, Thiel gave $10m each to the campaigns of two protégés – <span class='selected-term'>Blake Masters</span>, who is running for the Senate from Arizona, and JD Vance, from Ohio.",
    "author": "Robert Reich",
    "title": "Beware of this deadly mix: oligarchic economics and racist, nationalist populism"
  },
  {
    "id": 2250,
    "mediaId": 2550,
    "date": "2022-03-20",
    "sentence": "cc @garyvee pic.twitter.com/0OjdAL6nrC\n— Scott Jensen (@drscottjensen) September 1, 2021\n<span class='selected-term'>Blake Masters</span> is another political candidate who has also gotten into the NFT game.",
    "author": "",
    "title": "All About NFTs: What this means for political campaigns"
  },
  {
    "id": 1385,
    "mediaId": 2699,
    "date": "2022-04-01",
    "sentence": "For instance, take <span class='selected-term'>Blake Masters</span>, a far-right Republican candidate vying for Senate in Arizona and a longtime vocal crypto advocate.",
    "author": "Roger Sollenberger",
    "title": "Bitcoin Makes QAnon Candidate’s Fundraising Even Sadder"
  },
  {
    "id": 70,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "According to the report from the Beast's Roger Sollenberger, Peter Thiel -- one of Facebook's early investors -- is putting a substantial amount of money behind fellow tech executive <span class='selected-term'>Blake Masters</span> who is seeking the seat currently being held by Sen. Mark Kelly (D).",
    "author": "Tom Boggioni",
    "title": "Pro-Trump Senate candidate using his campaign to promote billionaire backer's businesses: report"
  },
  {
    "id": 362,
    "mediaId": 2699,
    "date": "2022-04-10",
    "sentence": "Arizona Republican Senate candidate <span class='selected-term'>Blake Masters</span> has made no secret of his connections to his longtime business partner and biggest political benefactor, billionaire tech investor Peter Thiel.",
    "author": "Roger Sollenberger",
    "title": "The Epic Back-Scratching Fest Between a GOP Senate Wannabe and a Trumpy Billionaire"
  },
  {
    "id": 910,
    "mediaId": 2664,
    "date": "2022-04-11",
    "sentence": "But now, thanks to Biden\\u2019s new rule change, I would be a felon if I made another one just like it today.pic.twitter.com/ZkatLvK46s\n— <span class='selected-term'>Blake Masters</span> (@Blake Masters) 1649705241\n\"Ghost guns\" are any privately assembled firearm that lacks a traceable serial number, which makes it harder to identify how they got into the hands of criminals if used in shootings.",
    "author": "Matthew Chapman",
    "title": "Pro-Trump Arizona candidate complains Biden's new rules wouldn't let him build his 'very cool' ghost gun"
  }
]