[
  {
    "id": 6899,
    "mediaId": 2699,
    "date": "2022-01-26",
    "sentence": "When House Minority Leader Kevin McCarthy named the MAGA-friendly Reps. <span class='selected-term'>Jim Jordan</span> and Jim Banks, two known bomb-throwers hostile to the committee, Pelosi exercised her veto power.",
    "author": "Eleanor Clift",
    "title": "The Jan. 6 Committee Members Are Patriots Making Sure Treason is Fully Documented"
  },
  {
    "id": 6843,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "House Minority Leader Rep. Kevin McCarthy submitted his choices — and she rejected two of them, Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "STATION GOSSIP",
    "title": "New Virginia AG Makes Huge Move, Fires Woke University Lawyers, Including One Working on Jan. 6 Commission"
  },
  {
    "id": 6809,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Kinzinger and Cheney are the only two Republicans serving on the January 6 committee after McCarthy withdrew his slate of members during negotiations over the panel’s configuration and House Speaker Nancy Pelosi denied seats on the panel to ultra-conservative Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio – both of whom objected to congressional certification of the election results from two states on January 6, 2021.",
    "author": "Gabby Orr",
    "title": "Proposal to endorse removing Cheney and Kinzinger from House GOP Conference gets more than 50 RNC co-sponsors"
  },
  {
    "id": 6800,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Second, in July, House Minority Leader Kevin McCarthy decided to pull all Republican members he had nominated for the House committee investigating January 6, following House Speaker Nancy Pelosi's rejection of the presence of GOP Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana on the panel.",
    "author": "Chris Cillizza",
    "title": "The massive miscalculation Republicans made on the 1/6 committee"
  },
  {
    "id": 5548,
    "mediaId": 2550,
    "date": "2022-02-04",
    "sentence": "White House Jan. 6 call log confirms what <span class='selected-term'>Jim Jordan</span> couldn't—or wouldn't\nGOP declares Jan. 6 assault was 'ordinary citizens engaged in legitimate political discourse'\nFamily wants answers after 22-year-old Black man, Amir Locke, shot and killed during no-knock raid\nMike Pence calls idea that he could have overturned election results 'un-American'\nMemo shows how Trump's whole legal team made sure fake electors were ready for Jan. 6 scheme\nAs Tennessee bans Holocaust-themed graphic novel 'Maus,' pastor organizes massive book burning\nMissouri parent who tried to ban books for being too sexually explicit faces molestation charges\nRepublican brags he was 'instrumental' in getting funding from infrastructure bill he opposed\nJeffrey Clark clams up in hearing with Jan. 6 committee\nPlan to censure Cheney and Kinzinger suggests Republicans are nervous about the Jan. 6 committee\nFocus groups: Black Americans want Biden to be more aggressive, especially on student loan relief\nAnd from the community:\nWhat it is really like being a Democrat in The Villages, FL (And why Democrats should move here)\nCartoon: Book bans and right-wing boobs???????",
    "author": "",
    "title": "News Roundup: GOP says insurrection is 'legitimate political discourse,' Jim Jordan busted"
  },
  {
    "id": 5737,
    "mediaId": 2594,
    "date": "2022-02-04",
    "sentence": "House Minority Leader Kevin McCarthy initially announced a slate of Republicans that included allies of Mr Trump like Reps Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Eric Garcia",
    "title": "RNC votes to censure Liz Cheney and Adam Kinzinger over January 6 committee investigation"
  },
  {
    "id": 5907,
    "mediaId": 2707,
    "date": "2022-02-05",
    "sentence": "",
    "author": "Associated Press",
    "title": "Trump’s GOP: Party further tightens tie to former president"
  },
  {
    "id": 6174,
    "mediaId": 2808,
    "date": "2022-02-06",
    "sentence": "House Speaker Nancy Pelosi last year vetoed putting Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Rep. Jim Banks, R-Ind., on the panel, so House Minority Leader Kevin McCarthy pulled his three other GOP picks, leaving Pelosi free to tap Kinzinger and Cheney.",
    "author": "",
    "title": "RNC censure of Kinzinger, Cheney could backfire for Illinois Republicans"
  },
  {
    "id": 5658,
    "mediaId": 2569,
    "date": "2022-02-11",
    "sentence": "Explicitly named in the minute-long spot are House Minority Leader Kevin McCarthy, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, and Rep. Marjorie Taylor Greene of Georgia.",
    "author": "",
    "title": "Lincoln Project ad goes for gold, skewers Republicans in ‘Coward Olympics’"
  },
  {
    "id": 5498,
    "mediaId": 2594,
    "date": "2022-02-11",
    "sentence": "House Speaker Nancy Pelosi rejected Mr McCarthy’s selection of Reps <span class='selected-term'>Jim Jordan</span> and Jim Banks.",
    "author": "Eric Garcia",
    "title": "Liz Cheney did not donate to any Republicans during last fundraising quarter"
  },
  {
    "id": 5141,
    "mediaId": 2702,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Mychael Schnell",
    "title": "Republican voters split over RNC censure of Cheney and Kinzinger: poll"
  },
  {
    "id": 5014,
    "mediaId": 2584,
    "date": "2022-02-19",
    "sentence": "Kevin McCarthy, the minority leader, frequently breaks with McConnell in his expressions of fealty, in part because his caucus includes “Make America great again” extremists such as Madison Cawthorn, Matt Gaetz, Ronny Jackson, <span class='selected-term'>Jim Jordan</span> and Marjorie Taylor Greene.",
    "author": "David Smith",
    "title": "Renewed opposition to Trump stirs among establishment Republicans"
  },
  {
    "id": 4581,
    "mediaId": 2564,
    "date": "2022-02-21",
    "sentence": "Trump-aligned lawmakers including Reps. <span class='selected-term'>Jim Jordan</span>, Ronny Jackson, Madison Cawthorn and Sens.",
    "author": "Nikki Schwab",
    "title": "The rival Republican conferences: Democrat Tulsi Gabbard and Dr. Oz join the CPAC line-up alongside Trump this weekend - while election fraud critics hold event to back Cheney, Kinzinger and candidates facing MAGA challengers"
  },
  {
    "id": 4669,
    "mediaId": 2593,
    "date": "2022-02-22",
    "sentence": "You also have Reps. Lauren Boebert and Ken Buck of Colorado, Madison Cawthorn of North Carolina, Ronny Jackson of Texas and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "",
    "title": "Not Satire: 'RINO Convention' Days Away – Cheney, Kinzinger Set to Be Keynote Speakers"
  },
  {
    "id": 5113,
    "mediaId": 2543,
    "date": "2022-02-22",
    "sentence": "You also have Reps. Lauren Boebert and Ken Buck of Colorado, Madison Cawthorn of North Carolina, Ronny Jackson of Texas and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "C. Douglas Golden",
    "title": "Not Satire: 'RINO Convention' Days Away - Guest List is a Who's Who of Rabid Trump-Haters"
  },
  {
    "id": 4818,
    "mediaId": 2748,
    "date": "2022-02-23",
    "sentence": "You also have Reps. Lauren Boebert and Ken Buck of Colorado, Madison Cawthorn of North Carolina, Ronny Jackson of Texas and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "STATION GOSSIP",
    "title": "Not Satire: 'RINO Convention' Days Away - Guest List is a Who's Who of Rabid Trump-Haters"
  },
  {
    "id": 3081,
    "mediaId": 2746,
    "date": "2022-03-08",
    "sentence": "When House Speaker Nancy Pelosi rejected Ohio’s <span class='selected-term'>Jim Jordan</span> and Indiana’s Jim Banks, Mr. McCarthy should have called a strike against the House until his selections were seated — or at least offered replacements.",
    "author": "Peter Navarro",
    "title": "Capitol Hill’s dangerous kangaroo court"
  },
  {
    "id": 2411,
    "mediaId": 2656,
    "date": "2022-03-19",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) injected a note of sanity in the proceedings when he said: “This is what the Democrats are focused on.",
    "author": "Robert Spencer",
    "title": "With the World on Fire, You’ll Be Astonished at What the House of Representatives is Doing"
  },
  {
    "id": 1040,
    "mediaId": 2746,
    "date": "2022-04-04",
    "sentence": "Mrs. Pelosi rejected Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio over their votes to reject certifying the 2020 presidential election results.",
    "author": "Mica Soellner",
    "title": "Rep. Raskin says Jan. 6 panel is a ‘model, bipartisan committee’"
  },
  {
    "id": 1693,
    "mediaId": 2724,
    "date": "2022-04-06",
    "sentence": "Breaking: Following @FDRLST reporting that Adam Schiff and his staff doctored a text message between <span class='selected-term'>Jim Jordan</span> and former WH chief of staff Mark Meadows, the House Jan. 6 committee has just admitted that it did, in fact, doctor the text message.https://t.co/78aRNyOib7\n— Mollie (@MZHemingway) December 15, 2021\nIt seems there isn’t much that Kinzinger isn’t willing to believe if it casts a negative pall on his political adversaries.",
    "author": "Rusty Weiss",
    "title": "Never Trumper Adam Kinzinger Falls For Fake Tucker Carlson Quote Shared By Fellow ‘Never Trumper’ Joe Walsh"
  },
  {
    "id": 735,
    "mediaId": 2643,
    "date": "2022-04-10",
    "sentence": "In July, Pelosi objected to two of McCarthy's appointments to the panel—Representatives <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana.",
    "author": "Xander Landen",
    "title": "Raskin Says 1/6 Committee 'Able to Get Work Done' Thanks to McCarthy Gamble"
  },
  {
    "id": 328,
    "mediaId": 2730,
    "date": "2022-04-10",
    "sentence": "No members appointed by the minority party serve on the select committee, since Pelosi blocked House Minority Leader Kevin McCarthy's picks of Reps. Banks and <span class='selected-term'>Jim Jordan</span> (R-OH), leading McCarthy to pull all his picks.",
    "author": "Rebecca Downs",
    "title": "Chris Christie Has a Theory About Liz Cheney"
  }
]