[
  {
    "id": 6892,
    "mediaId": 2553,
    "date": "2022-01-25",
    "sentence": "https://t.co/hP55vngVbh\n— Cernovich (@Cernovich) January 25, 2022\n“Unconscionable,” reacted Republican Rep. <span class='selected-term'>Jim Jordan</span> (OH).",
    "author": "Amanda Prestigiacomo",
    "title": "‘Kill People To Harm Republicans’: Social Media Clobbers Biden Admin After FDA Blocks Antibody Treatment"
  },
  {
    "id": 3289,
    "mediaId": 2595,
    "date": "2022-03-10",
    "sentence": "Ohio Republican lawmaker <span class='selected-term'>Jim Jordan</span> requested a briefing with the FBI after a whistleblower disclosed information about two pipe bombs planted on January 5, the night before the Capitol riot/rally.",
    "author": "M Dowling",
    "title": "Only J6 Committee Has Info on Would-Be Bomber"
  },
  {
    "id": 3600,
    "mediaId": 4032,
    "date": "2022-03-10",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> of Ohio, the ranking Republican on the House Judiciary Committee, has asked the FBI to provide an immediate briefing regarding the agency’s investigation into the pipe bombs left at the headquarters of the Democrat and Republican parties on January 5 last year.",
    "author": "Gary Benoit",
    "title": "FBI Not Answering GOP Committee Members on Jan. 5 Pipe-bomb Probe. Jordan Demands Briefing on Progress"
  },
  {
    "id": 3330,
    "mediaId": 2754,
    "date": "2022-03-12",
    "sentence": "Authored by Katabella Roberts via The Epoch Times (emphasis ours),\nOhio Republican lawmaker <span class='selected-term'>Jim Jordan</span> said he has requested a briefing with the FBI after a whistleblower allegedly disclosed information regarding the bureau’s investigation into pipe bombs planted near the Democratic National Committee and Republican National Committee headquarters in Washington the night before the Jan. 6 breach of the U.S. Capitol.",
    "author": "Tyler Durden",
    "title": "FBI Whistleblower Raises Questions About Pipe Bombs Set Near DNC, RNC Headquarters: Lawmaker"
  },
  {
    "id": 3564,
    "mediaId": 2748,
    "date": "2022-03-13",
    "sentence": "(From 100PercentFedUp - READ ORIGINAL)\nU.S. Rep. <span class='selected-term'>Jim Jordan</span> (OH), the ranking member of the House Judiciary Committee, sent a letter to Christopher Wray, FBI Director, about the investigation of the D.C.",
    "author": "",
    "title": "Senior FBI Special Agent Whistleblower Provides Damning Information on FBI Jan. 6 “Investigation” from INSIDE the U.S. Stasi (aka FBI)"
  }
]