[
  {
    "id": 5521,
    "mediaId": 2550,
    "date": "2022-02-05",
    "sentence": "x\nNEWS: The Jan. 6 committee is now in possession of White House records that show Trump spoke via phone with GOP Rep. <span class='selected-term'>Jim Jordan</span> for 10 minutes on the morning of the US Capitol riot.",
    "author": "",
    "title": "Abbreviated Pundit Roundup: Biden's mostly, pretty much, not bad at all good week"
  },
  {
    "id": 5159,
    "mediaId": 2547,
    "date": "2022-02-13",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> amplified Trump's dangerous threats with a retweet, which Mediaite noticed.",
    "author": "John Amato",
    "title": "Jordan Amplifies Trump's Call To Execute Hillary Operatives"
  },
  {
    "id": 4730,
    "mediaId": 6621,
    "date": "2022-02-14",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) stopped by Fox & Friends to discuss the latest bombshell report that special counsel John Durham filed a motion in federal court alleging the Clinton campaign paid a tech firm to infiltrate Trump Tower servers —and later, the White House.",
    "author": "",
    "title": "'YEP, THERE WAS SPYING': Jordan Reacts to Bombshell That Clinton Campaign Spied on President Trump"
  },
  {
    "id": 4641,
    "mediaId": 2641,
    "date": "2022-02-14",
    "sentence": "According to the New York Post, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, speaking on Durham's investigation, found credibility in the probe's assertion of spying.",
    "author": "Nick Koutsobinas",
    "title": "Nunes to Newsmax: Durham Probe Will Bring 'More' Indictments Against Clinton Campaign"
  },
  {
    "id": 5269,
    "mediaId": 2548,
    "date": "2022-02-14",
    "sentence": "(RELATED : ‘As Wrong As It Gets’: Rep. <span class='selected-term'>Jim Jordan</span> Calls Out Liberal Media And Democrats For Denying That Trump Was Spied On)\n“Jacqui, my answer is not going to change, I refer you to the Department of Justice,” Jean-Pierre repeated.",
    "author": "Nicole Silverio",
    "title": "‘Can’t Speak To That’: Karine Jean-Pierre Repeatedly Dodges Questions On Durham Report When Pressed By Fox News Reporter"
  },
  {
    "id": 5346,
    "mediaId": 2627,
    "date": "2022-02-14",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, seemed to agree Sunday with a statement from former President Donald Trump that suggested some of Hillary Clinton's associates deserve to be executed.",
    "author": "Ja'han Jones",
    "title": "Rep. Jim Jordan seems to back Trump's comment about executing Clinton aides"
  },
  {
    "id": 4615,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "\"Clinton's cronies asked researchers to search internet data to establish an 'inference' and 'narrative' to tie President Trump to Russia,\" <span class='selected-term'>Jim Jordan</span>, R-Ohio, tweeted Wednesday night.",
    "author": "Eric Mack",
    "title": "Hillary Finally Reacts to Durham Probe Spying Reports: 'Nonsense'"
  },
  {
    "id": 4897,
    "mediaId": 2748,
    "date": "2022-02-16",
    "sentence": "He now works in the Biden White House,' Rep. <span class='selected-term'>Jim Jordan</span> of Ohio wrote on Twitter Monday.",
    "author": "Laura Collins",
    "title": "Hillary IGNORES question about Durham claims she spied on Trump as she arrives at Chelsea's home"
  },
  {
    "id": 5124,
    "mediaId": 2748,
    "date": "2022-02-17",
    "sentence": "According to the New York Post, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, speaking on Durham's investigation, found credibility in the probe's allegation of spying.",
    "author": "",
    "title": "New Video: Devin Nunes Says Durham Probing 'Scam Of The Century'"
  },
  {
    "id": 4944,
    "mediaId": 2583,
    "date": "2022-02-18",
    "sentence": "",
    "author": "",
    "title": "Rep. Jim Jordan on Durham Filing: ‘President Trump Was Right … He Was Being Spied On’"
  },
  {
    "id": 4376,
    "mediaId": 2724,
    "date": "2022-03-01",
    "sentence": "https://t.co/rJ4GDf6hlH\n— Gary Weiss (@gary_weiss) February 28, 2022\nRELATED: Video: <span class='selected-term'>Jim Jordan</span> Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nPsaki then touted Biden’s leadership abilities.",
    "author": "John Hanson",
    "title": "ABC’s George Stephanopoulos Breaks The News To Psaki That A Majority Of Americans ‘Question The President’s Mental Capacity’"
  },
  {
    "id": 1279,
    "mediaId": 2699,
    "date": "2022-04-06",
    "sentence": "Sitting Ohio Rep. <span class='selected-term'>Jim Jordan</span>, a MAGA favorite, was once an assistant wrestling coach at Ohio State University in the 1990s.",
    "author": "Margaret Carlson",
    "title": "Republicans Are Clueless About Living in a Glass House"
  },
  {
    "id": 378,
    "mediaId": 2553,
    "date": "2022-04-20",
    "sentence": "Maybe Obama will beat Special Counsel John Durham to the punch by revealing the truth behind the phony Steele Dossier, the Clinton campaign’s role in the entire affair, and divulging details of who else was involved in what appears to be a cover-up and scandal involving allegations that were, as Congressman <span class='selected-term'>Jim Jordan</span> (R-OH) said on Monday, “it was made up.”\nAt the very least, Obama could apologize to former Trump campaign advisor Carter Page for the fact that FBI agents made “serious errors” that allowed the FISA court to grant the DOJ permission to spy on Page.",
    "author": "Tim Meads",
    "title": "Obama’s Warning About Disinformation Again. Let’s Take A Look At Some Examples, Shall We?"
  }
]