[
  {
    "id": 6380,
    "mediaId": 2658,
    "date": "2022-01-05",
    "sentence": "“We can’t lose the entire WH counsels office,” he wrote to <span class='selected-term'>JIM JORDAN</span> and MARK MEADOWS on Dec. 31, 2020, likely referring to PAT CIPOLLONE’s opposition to pressuring MIKE PENCE to throw the Electoral College count.",
    "author": "",
    "title": "POLITICO Playbook: Republicans dodge and deflect ahead of Jan. 6"
  },
  {
    "id": 6439,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "Now, they say, it is time for Mr. Biden to focus not only on his own achievements, but also on how the Republican Party threatens to reverse those efforts if it returns to power on Capitol Hill — something that has not been at the center of his presidency so far.”\nJAN. 6 AND ITS AFTERMATH\nJORDAN SNUBS JAN. 6 PANEL — Rep. <span class='selected-term'>JIM JORDAN</span> (R-Ohio) is refusing the Jan. 6 committee’s request for an interview, calling the ask an “unprecedented and inappropriate demand.”\nIn a letter to Chair BENNIE THOMPSON (D-Miss.)",
    "author": "",
    "title": "POLITICO Playbook: Biden faces his moment on the filibuster"
  },
  {
    "id": 6359,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "QUICK LINKS\nRep. <span class='selected-term'>Jim Jordan</span> says he won’t cooperate with Jan. 6 committee’s interview request, from Nicholas and Kyle\nTRANSITIONS\nOmair Mirza is joining J.P. Morgan Chase as VP of federal government relations.",
    "author": "",
    "title": "Dems eye voting rights fight, filibuster changes"
  },
  {
    "id": 6775,
    "mediaId": 2690,
    "date": "2022-01-20",
    "sentence": "pic.twitter.com/6zVW0lE0Ni\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 3, 2022\nREPORTER: \"Should members of congress and their spouses be banned from trading individual stocks while serving in congress?\"",
    "author": "",
    "title": "SHOWDOWN: Ex-Navy SEALs Running For Congress Unite To Take Down ‘Grave Threat’ Nancy Pelosi"
  },
  {
    "id": 5002,
    "mediaId": 2643,
    "date": "2022-02-15",
    "sentence": "Congress members such as Blackburn and <span class='selected-term'>Jim Jordan</span> (R-Ohio) both shared social media posts against what Blackburn calls \"government-funded crack pipes.\"",
    "author": "Daniel Villarreal",
    "title": "Biden Admin Commits to No Crack Pipes, Avoids Partial Government Shutdown"
  },
  {
    "id": 1383,
    "mediaId": 2745,
    "date": "2022-04-01",
    "sentence": "… Let’s focus on the things that matter,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said.",
    "author": "",
    "title": "House passes bill decriminalizing marijuana; Senate fortunes unclear"
  },
  {
    "id": 1441,
    "mediaId": 2553,
    "date": "2022-04-01",
    "sentence": "“The left will not let the Democrats do what needs to be done with the inflation problem, the energy problem, the illegal immigration problem on the southern border,” Representative <span class='selected-term'>Jim Jordan</span> (R-OH) said.",
    "author": "Charlotte Pence Bond",
    "title": "House Votes To Legalize Marijuana; Dems Applaud It As ‘Racial Justice Bill’"
  },
  {
    "id": 1315,
    "mediaId": 2679,
    "date": "2022-04-01",
    "sentence": "Advertising\n Skip AdSkip AdSkip Ad\n“The left will not let the Democrats do what needs to be done with the inflation problem, the energy problem, the illegal immigration problem on the southern border,” said Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, the senior Republican on the House Judiciary Committee.",
    "author": "Jonathan Weisman",
    "title": "House votes to decriminalize cannabis"
  },
  {
    "id": 1708,
    "mediaId": 6677,
    "date": "2022-04-01",
    "sentence": "Wow,” said Rep. <span class='selected-term'>Jim Jordan</span> (Ohio), the top Republican on the House Judiciary Committee.",
    "author": "Cristina Marcos",
    "title": "House approves bill legalizing marijuana"
  },
  {
    "id": 1701,
    "mediaId": 2522,
    "date": "2022-04-01",
    "sentence": "The bill was vigorously opposed by some Republicans such as Representative <span class='selected-term'>Jim Jordan</span> (R-OH), who took to the podium to rail against what he argued is a seriously skewed sense of priorities.",
    "author": "Joshua Nybo",
    "title": "‘Wow. Wow!’ Jim Jordan goes OFF on cowardly Dem priorities as House votes to decriminalize marijuana"
  },
  {
    "id": 1573,
    "mediaId": 6669,
    "date": "2022-04-01",
    "sentence": "Wow,” said Rep. <span class='selected-term'>Jim Jordan</span> (Ohio), the top Republican on the House Judiciary Committee.",
    "author": "Cristina Marcos",
    "title": "House approves bill legalizing marijuana"
  },
  {
    "id": 991,
    "mediaId": 2636,
    "date": "2022-04-01",
    "sentence": "“The left will not let the Democrats do what needs to be done with the inflation problem, the energy problem, the illegal immigration problem on the southern border,” said Representative <span class='selected-term'>Jim Jordan</span> of Ohio, the senior Republican on the Judiciary Committee.",
    "author": "",
    "title": "House Votes to Decriminalize Cannabis"
  }
]