[
  {
    "id": 6707,
    "mediaId": 2634,
    "date": "2022-01-21",
    "sentence": "Moreover, even if the committee did subpoena McCarthy, <span class='selected-term'>Jim Jordan</span>, and Scott Perry, it’s unclear whether it would be able to compel them to speak.",
    "author": "Daniel Strauss",
    "title": "A Good Week for the January 6 Committee Means a Bad Week for Donald Trump"
  },
  {
    "id": 5783,
    "mediaId": 2557,
    "date": "2022-02-02",
    "sentence": "pic.twitter.com/J7E6wBRI8l\n— Rep Andy Biggs (@RepAndyBiggsAZ) November 19, 2019\nRep. <span class='selected-term'>Jim Jordan</span>: “You talked to the one guy Adam Schiff won’t let you tell us how he is — is that right?”\nVindman: “Rep.",
    "author": "DML News App",
    "title": "REPORT: Whistleblower who kicked-off first impeachment sues Trump Jr. for ‘intimidation’"
  },
  {
    "id": 5491,
    "mediaId": 2590,
    "date": "2022-02-06",
    "sentence": "— GoFundMe (@gofundme) February 5, 2022\n Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) also complained on Twitter, and Elon Musk gushed: “Canadian truckers rule.”\nIn addition, Louisiana Attorney General Jeff Landry and West Virginia Attorney General Patrick Morrisey, both Republicans, indicated Saturday that they’re investigating the issue.",
    "author": "Mary Papenfuss",
    "title": "Gov. Ron DeSantis Going After GoFundMe For Dumping Anti-Vaccine Ottawa Truckers"
  },
  {
    "id": 5545,
    "mediaId": 2578,
    "date": "2022-02-11",
    "sentence": "Completely devoid of any ethics or integrity, Schiff was caught red-handed only weeks ago editing the text messages of former White House Chief of Staff Mark Meadows as well as Congressman <span class='selected-term'>Jim Jordan</span> in the January 6th Witch Hunt.",
    "author": "Joe Hoft",
    "title": "ROGER STONE EXCLUSIVE: Liar Adam Schiff Faces Challenge from Fiery Conservative Woman Attorney, Descendant of Slaves"
  },
  {
    "id": 5570,
    "mediaId": 2590,
    "date": "2022-02-12",
    "sentence": "Ron DeSantis, Elon Musk, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), and Donald Trump and son Donald Trump Jr.\nGoFundMe earlier this month shut down a site that had raised close to $10 million for the truckers after Ottawa police reached out to the company to complain of illegal activity by the truckers.",
    "author": "Mary Papenfuss",
    "title": "Canadian Judge Blocks Money For Truckers From U.S. Right-Wing Christian Fundraising Site"
  },
  {
    "id": 4579,
    "mediaId": 2594,
    "date": "2022-02-16",
    "sentence": "In a stronger period of time in our country, this crime would have been punishable by death.”\nIn an even briefer statement three days later, evidently still basking in the glow of apparent triumph, he proclaimed: “I was proven right about the spying, and I will be proven right about 2020.”\nThe same development was likewise hailed loudly by Tucker Carlson on Fox News and on social media by loyalists including Donald Trump Jr, Ronna McDaniel, Ted Cruz, Kevin McCarthy, Marjorie Taylor Greene, Mark Meadows and <span class='selected-term'>Jim Jordan</span> but what exactly has Mr Durham alleged?",
    "author": "Joe Sommerlad",
    "title": "Why Donald Trump is once again claiming Democrats ‘spied’ on him"
  },
  {
    "id": 4589,
    "mediaId": 2658,
    "date": "2022-02-17",
    "sentence": "Pic\nHAPPY BIRTHDAY: Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio), Suzan DelBene (D-Wash.) (6-0) and Jake LaTurner (R-Kan.) … Brian Jack … DHS’ Sam Vinograd … Betsy Fischer Martin … Axios’ Lachlan Markay … Keegan Goudiss … McClatchy’s Kristin Roberts … Ashley Berrang … CNN’s Dianna Heitz … Cara Camacho … Boeing’s Fred Schwien … Edith Honan … AARP’s Barbara Shipley … Danielle Most … POLITICO’s Kelsey Tamborrino and Baker Landon … Annamarie Rienzi … Mark Shriver of Save the Children … Drew Cantor … Frederick Hill of FTI Consulting … Steven Grossman … Preston Mizell of Rep. Darrell Issa’s (R-Calif.) office … James Lynch … Alison Kutler … Mike Sager of EMILY’s List … Allison Hunn … David Carreiro … NAICU’s Emmanual Guillory … Shana Marchio … Skyla Freeman … Stephanie Young of When We All Vote … Cliff Sims … Surya Gunasekara … former Rep. Randy Forbes (R-Va.) (7-0) … Robert Giuffra\nDid someone forward this email to you?",
    "author": "",
    "title": "POLITICO Playbook: Operation ‘Stop Greitens’ goes awry"
  },
  {
    "id": 4564,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "The \"Take Back Congress Candidate Forum” will be littered with 10 congressional Trump acolytes like Representative <span class='selected-term'>Jim Jordan</span> of Ohio and 13 hopefuls such as United States Senate candidate Herschel Walker of Georgia.",
    "author": "Brandon Gage",
    "title": "Donald Trump to host ‘Magapalooza’ at Mar-a-Lago on Wednesday"
  },
  {
    "id": 5035,
    "mediaId": 2584,
    "date": "2022-02-23",
    "sentence": "She had the right to review his nominations, and she rejected Republican representative <span class='selected-term'>Jim Jordan</span>, who has now been implicated in the events of the day, and Republican representative Jim Banks, who had attacked the committee as a partisan exercise “solely to malign conservatives and to justify the left’s authoritarian agenda”.",
    "author": "Heather Cox Richardson",
    "title": "Trump claims investigations into him are politically motivated. That is a lie"
  },
  {
    "id": 4448,
    "mediaId": 2862,
    "date": "2022-02-25",
    "sentence": "\"Apart from the former president himself, his son Donald Trump Jr., former Secretary of State Mike Pompeo, Senator Ted Cruz, Florida Governor Ron DeSantis, Nigel Farage, and Rep <span class='selected-term'>Jim Jordan</span> are among the high-profile speakers.While devoted fans are anticipating Trump's undeniably poignant and likely lengthy speech (as usual), other prominent conservatives took their moment to weigh in.",
    "author": "",
    "title": "The Republican Awakening"
  },
  {
    "id": 4371,
    "mediaId": 2682,
    "date": "2022-03-03",
    "sentence": "CPAC 2022 Speakers, in part, were the following:\nDonald Trump\nTed Cruz\nMarco Rubio\nRon DeSantis\nKristi Noem\nDonald Trump Jr.\nMike Pompeo\nTulsi Gabbard\nMatt Gaetz\nRick Scott\nCandace Owens\n<span class='selected-term'>Jim Jordan</span>\nConclusion: Oh, how these installed appeasers are laughing at the people who support them (Ephesians 4:14).",
    "author": "Bradlee Dean",
    "title": "The Show Must Go On: CPAC Brings You the Same Clowns with the Same Empty Promises"
  },
  {
    "id": 3166,
    "mediaId": 2557,
    "date": "2022-03-11",
    "sentence": "https://t.co/KLL7SoYIzP\n— Donald Trump Jr. (@DonaldJTrumpJr) March 10, 2022\nRep. <span class='selected-term'>Jim Jordan</span> tweeted Tuesday, “Keystone Pipeline.",
    "author": "",
    "title": "VIDEO: Americans blast Biden for halting Keystone Pipeline: ‘Killed our economy’"
  },
  {
    "id": 2235,
    "mediaId": 2584,
    "date": "2022-03-23",
    "sentence": "Multiple reporters have placed Brooks with other far-right Republicans including Marjorie Taylor Greene of Georgia and <span class='selected-term'>Jim Jordan</span> of Ohio in White House meetings with Trump.",
    "author": "Martin Pengelly",
    "title": "Republican says Trump asked him to ‘rescind’ 2020 election and remove Biden from office"
  },
  {
    "id": 1255,
    "mediaId": 2550,
    "date": "2022-04-08",
    "sentence": "Incidentally, when the Jan. 6 committee exposed text messages sent by Rep. <span class='selected-term'>Jim Jordan</span> of Ohio to Mark Meadows, Jordan said the same had occurred.",
    "author": "",
    "title": "Trump Jr. pitched 'very simple' plan to White House to overturn 2020 election"
  },
  {
    "id": 1360,
    "mediaId": 2629,
    "date": "2022-04-09",
    "sentence": "Incidentally, when the Jan. 6 committee exposed text messages sent by Rep. <span class='selected-term'>Jim Jordan</span> of Ohio to Mark Meadows, Jordan said the same had occurred.",
    "author": "Brandi Buchman",
    "title": "'Total Control': Trump Jr. Pushed Coup Plot In November 2020 Texts To Meadows"
  },
  {
    "id": 859,
    "mediaId": 2688,
    "date": "2022-04-14",
    "sentence": "The source noted that Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), one of Trump’s staunchest allies in Congress, tried to warn the former president against backing Vance on behalf of Mandel, whom Jordan supports.",
    "author": "Matt Shuham",
    "title": "Trump Set To Endorse JD Vance After Ohio GOPer Spent Months Repenting For Anti-Trump Past"
  },
  {
    "id": 587,
    "mediaId": 2664,
    "date": "2022-04-17",
    "sentence": "Trump's endorsement of the \"Hillbilly Elegy\" author, who has been highly critical of the former president in the past, caught many by surprise with NBC reporting \"The Mandel people hit the roof,\" upon being given advance notice and that Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) tried to talk Trump out of it.",
    "author": "Tom Boggioni",
    "title": "Trump refused to endorse Ohio's Josh Mandel because he's 'embarrassing': report"
  }
]