[
  {
    "id": 6440,
    "mediaId": 2614,
    "date": "2022-01-15",
    "sentence": "",
    "author": "Red Voice Media",
    "title": "Kamala’s Interview Was Really Bad, But A Body Language Expert Reveals It Was Even Worse [VIDEO]"
  },
  {
    "id": 6707,
    "mediaId": 2634,
    "date": "2022-01-21",
    "sentence": "Moreover, even if the committee did subpoena McCarthy, <span class='selected-term'>Jim Jordan</span>, and Scott Perry, it’s unclear whether it would be able to compel them to speak.",
    "author": "Daniel Strauss",
    "title": "A Good Week for the January 6 Committee Means a Bad Week for Donald Trump"
  },
  {
    "id": 6581,
    "mediaId": 2748,
    "date": "2022-01-24",
    "sentence": "",
    "author": "",
    "title": "Must See: Tucker SLAMS Kamala's Illegitimate Election Claims"
  },
  {
    "id": 7031,
    "mediaId": 4091,
    "date": "2022-01-24",
    "sentence": "I will help reinforce.”\nAlso, Hannity said he believed it was “key” to keep Trump away from certain people, texting: “No more crazy people,” leading McEnany to respond: “Yes, 100%.”\nHannity also wrote in a text to Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and then-White House Chief of Staff Mark Meadows:\nGuys, we have a clear path to land the plane in 9 days.",
    "author": "JD Heyes",
    "title": "More leaked texts from the Jan. 6 Committee show messaging coordination between Hannity, McEnany"
  },
  {
    "id": 6960,
    "mediaId": 2625,
    "date": "2022-01-26",
    "sentence": "The event, held at a posh hotel, featured Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Marjorie Taylor Greene (R-Ga.) and Mark Meadows, Trump’s former White House chief of staff.",
    "author": "David Corn",
    "title": "Ski in Jackson Hole? You Could Be Hurting Liz Cheney."
  },
  {
    "id": 7071,
    "mediaId": 2595,
    "date": "2022-01-28",
    "sentence": "They are asking Ivanka Trump, Rudy Giuliani, Kevin McCarthy, <span class='selected-term'>Jim Jordan</span>, Mark Meadows, and Scott Perry to come in and charged Steve Bannon with criminal contempt for not showing up.",
    "author": "M Dowling",
    "title": "Cheney’s J6 Witch Hunt Committee Subpoenas 14 GOP Electors & Others"
  },
  {
    "id": 6809,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Kinzinger and Cheney are the only two Republicans serving on the January 6 committee after McCarthy withdrew his slate of members during negotiations over the panel’s configuration and House Speaker Nancy Pelosi denied seats on the panel to ultra-conservative Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio – both of whom objected to congressional certification of the election results from two states on January 6, 2021.",
    "author": "Gabby Orr",
    "title": "Proposal to endorse removing Cheney and Kinzinger from House GOP Conference gets more than 50 RNC co-sponsors"
  },
  {
    "id": 6800,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Second, in July, House Minority Leader Kevin McCarthy decided to pull all Republican members he had nominated for the House committee investigating January 6, following House Speaker Nancy Pelosi's rejection of the presence of GOP Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana on the panel.",
    "author": "Chris Cillizza",
    "title": "The massive miscalculation Republicans made on the 1/6 committee"
  },
  {
    "id": 5548,
    "mediaId": 2550,
    "date": "2022-02-04",
    "sentence": "White House Jan. 6 call log confirms what <span class='selected-term'>Jim Jordan</span> couldn't—or wouldn't\nGOP declares Jan. 6 assault was 'ordinary citizens engaged in legitimate political discourse'\nFamily wants answers after 22-year-old Black man, Amir Locke, shot and killed during no-knock raid\nMike Pence calls idea that he could have overturned election results 'un-American'\nMemo shows how Trump's whole legal team made sure fake electors were ready for Jan. 6 scheme\nAs Tennessee bans Holocaust-themed graphic novel 'Maus,' pastor organizes massive book burning\nMissouri parent who tried to ban books for being too sexually explicit faces molestation charges\nRepublican brags he was 'instrumental' in getting funding from infrastructure bill he opposed\nJeffrey Clark clams up in hearing with Jan. 6 committee\nPlan to censure Cheney and Kinzinger suggests Republicans are nervous about the Jan. 6 committee\nFocus groups: Black Americans want Biden to be more aggressive, especially on student loan relief\nAnd from the community:\nWhat it is really like being a Democrat in The Villages, FL (And why Democrats should move here)\nCartoon: Book bans and right-wing boobs???????",
    "author": "",
    "title": "News Roundup: GOP says insurrection is 'legitimate political discourse,' Jim Jordan busted"
  },
  {
    "id": 5737,
    "mediaId": 2594,
    "date": "2022-02-04",
    "sentence": "House Minority Leader Kevin McCarthy initially announced a slate of Republicans that included allies of Mr Trump like Reps Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Eric Garcia",
    "title": "RNC votes to censure Liz Cheney and Adam Kinzinger over January 6 committee investigation"
  },
  {
    "id": 5907,
    "mediaId": 2707,
    "date": "2022-02-05",
    "sentence": "",
    "author": "Associated Press",
    "title": "Trump’s GOP: Party further tightens tie to former president"
  },
  {
    "id": 6174,
    "mediaId": 2808,
    "date": "2022-02-06",
    "sentence": "House Speaker Nancy Pelosi last year vetoed putting Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Rep. Jim Banks, R-Ind., on the panel, so House Minority Leader Kevin McCarthy pulled his three other GOP picks, leaving Pelosi free to tap Kinzinger and Cheney.",
    "author": "",
    "title": "RNC censure of Kinzinger, Cheney could backfire for Illinois Republicans"
  },
  {
    "id": 5658,
    "mediaId": 2569,
    "date": "2022-02-11",
    "sentence": "Explicitly named in the minute-long spot are House Minority Leader Kevin McCarthy, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, and Rep. Marjorie Taylor Greene of Georgia.",
    "author": "",
    "title": "Lincoln Project ad goes for gold, skewers Republicans in ‘Coward Olympics’"
  },
  {
    "id": 5498,
    "mediaId": 2594,
    "date": "2022-02-11",
    "sentence": "House Speaker Nancy Pelosi rejected Mr McCarthy’s selection of Reps <span class='selected-term'>Jim Jordan</span> and Jim Banks.",
    "author": "Eric Garcia",
    "title": "Liz Cheney did not donate to any Republicans during last fundraising quarter"
  },
  {
    "id": 5141,
    "mediaId": 2702,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Mychael Schnell",
    "title": "Republican voters split over RNC censure of Cheney and Kinzinger: poll"
  },
  {
    "id": 4973,
    "mediaId": 2553,
    "date": "2022-02-17",
    "sentence": "Make America Great Again!”\nWhen Pelosi launched her January 6 committee, McCarthy recommended that Rep. Jim Banks (R-IN) and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) serve as Republican members.",
    "author": "Ben Zeisloft",
    "title": "McCarthy Endorses Cheney’s Republican Challenger"
  },
  {
    "id": 5113,
    "mediaId": 2543,
    "date": "2022-02-22",
    "sentence": "You also have Reps. Lauren Boebert and Ken Buck of Colorado, Madison Cawthorn of North Carolina, Ronny Jackson of Texas and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "C. Douglas Golden",
    "title": "Not Satire: 'RINO Convention' Days Away - Guest List is a Who's Who of Rabid Trump-Haters"
  },
  {
    "id": 4669,
    "mediaId": 2593,
    "date": "2022-02-22",
    "sentence": "You also have Reps. Lauren Boebert and Ken Buck of Colorado, Madison Cawthorn of North Carolina, Ronny Jackson of Texas and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "",
    "title": "Not Satire: 'RINO Convention' Days Away – Cheney, Kinzinger Set to Be Keynote Speakers"
  },
  {
    "id": 5035,
    "mediaId": 2584,
    "date": "2022-02-23",
    "sentence": "She had the right to review his nominations, and she rejected Republican representative <span class='selected-term'>Jim Jordan</span>, who has now been implicated in the events of the day, and Republican representative Jim Banks, who had attacked the committee as a partisan exercise “solely to malign conservatives and to justify the left’s authoritarian agenda”.",
    "author": "Heather Cox Richardson",
    "title": "Trump claims investigations into him are politically motivated. That is a lie"
  },
  {
    "id": 4818,
    "mediaId": 2748,
    "date": "2022-02-23",
    "sentence": "You also have Reps. Lauren Boebert and Ken Buck of Colorado, Madison Cawthorn of North Carolina, Ronny Jackson of Texas and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "STATION GOSSIP",
    "title": "Not Satire: 'RINO Convention' Days Away - Guest List is a Who's Who of Rabid Trump-Haters"
  },
  {
    "id": 5020,
    "mediaId": 2512,
    "date": "2022-02-24",
    "sentence": "",
    "author": "Brandon Gage",
    "title": "Kevin McCarthy is walking a 'tightrope' in his quest to be House Speaker"
  },
  {
    "id": 3859,
    "mediaId": 2748,
    "date": "2022-03-01",
    "sentence": "On July 21, 2020, Pelosi blocked two of McCarthy's choices, <span class='selected-term'>Jim Jordan</span> and Jim Banks, each of whom supported Trump's decision to contest the election, which they had every legal right to do.",
    "author": "Allan H. Ryskind",
    "title": "Ryskind: Liz Cheney's Unjust War Against Trump, His Jan. 6 Advisers, and the GOP"
  },
  {
    "id": 3727,
    "mediaId": 2550,
    "date": "2022-03-02",
    "sentence": "Republican Senate Minority Leader Mitch McConnell offered only a statement from his office: “There’s no place in the Republican Party for white supremacists or anti-Semitism.” GOP national committee chair Ronna McDaniel would only offer a similarly generic condemnation: “White supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.”\nThe far-right House Freedom Caucus’ newly elected leader, Congressman Scott Perry of Pennsylvania, and its cofounder, <span class='selected-term'>Jim Jordan</span> of Ohio, responded along similar lines asked about Greene and Gosar: They condemned racism, but declined to criticize either by name, or to criticize Fuentes.",
    "author": "David Neiwert",
    "title": "Republicans’ Nutcase Caucus undaunted by party leadership’s feckless response to extremism"
  },
  {
    "id": 3081,
    "mediaId": 2746,
    "date": "2022-03-08",
    "sentence": "When House Speaker Nancy Pelosi rejected Ohio’s <span class='selected-term'>Jim Jordan</span> and Indiana’s Jim Banks, Mr. McCarthy should have called a strike against the House until his selections were seated — or at least offered replacements.",
    "author": "Peter Navarro",
    "title": "Capitol Hill’s dangerous kangaroo court"
  },
  {
    "id": 3469,
    "mediaId": 2699,
    "date": "2022-03-11",
    "sentence": "Among the AIPAC chosen are Ohio Rep. <span class='selected-term'>Jim Jordan</span> (who trashed the Jan. 6 committee), Texas Rep. Ronny Jackson (the former White House physician who says Trump won the 2020 election), and Pennsylvania Rep. Scott Perry (who compared Democrats to Nazis).",
    "author": "Eleanor Clift",
    "title": "AIPAC Is All In on Support for ‘Stop the Steal’ Candidates"
  },
  {
    "id": 2884,
    "mediaId": 2550,
    "date": "2022-03-16",
    "sentence": "Related: Who’s who: A rolling guide to the targets of the Jan. 6 committee\nAccording to ABC, GOP House Leader Kevin McCarthy and Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania have had “no follow-up discussions” about their cooperation since receiving their respective subpoenas.",
    "author": "",
    "title": "Maybe there won't be subpoenas for GOP lawmakers from Jan. 6 probe but that doesn't spell doom"
  },
  {
    "id": 2411,
    "mediaId": 2656,
    "date": "2022-03-19",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) injected a note of sanity in the proceedings when he said: “This is what the Democrats are focused on.",
    "author": "Robert Spencer",
    "title": "With the World on Fire, You’ll Be Astonished at What the House of Representatives is Doing"
  },
  {
    "id": 2660,
    "mediaId": 2663,
    "date": "2022-03-22",
    "sentence": "(@taradublinrocks) March 21, 2022\n<span class='selected-term'>Jim Jordan</span> accused of ‘begging’ former Ohio State wrestler not to support reports of sexual abuse https://t.co/XJK8Pf0Uld\n— Shar G (@hapkidogal) March 21, 2022\nWhich ironically is one way to forget what you did at Ohio State.",
    "author": "Dan Tracer",
    "title": "Jim Jordan’s dumb tweet about SCOTUS hearings backfires spectacularly"
  },
  {
    "id": 1922,
    "mediaId": 2746,
    "date": "2022-03-22",
    "sentence": "The Judiciary Committee, which under GOP control would be headed by Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, would focus on more than a dozen key issues, according to a draft obtained by the Times.",
    "author": "Susan Ferrechio",
    "title": "House GOP to seek unity at annual retreat, plot agenda for takeover of Congress"
  },
  {
    "id": 1929,
    "mediaId": 2526,
    "date": "2022-03-24",
    "sentence": "According to Punchbowl News, Sen. Rand Paul (R-KY), Reps. <span class='selected-term'>Jim Jordan</span> (R-OH), Jim Banks (R-ID), Elise Stefanik (R-NY), South Dakota Gov.",
    "author": "Wendell Husebø",
    "title": "Kevin McCarthy to Host Huge Fundraiser for Liz Cheney’s Opponent, Harriet Hageman"
  },
  {
    "id": 2560,
    "mediaId": 2634,
    "date": "2022-03-25",
    "sentence": "The committee has asked Congressmen Scott Perry and <span class='selected-term'>Jim Jordan</span> to answer questions, and both lawmakers have declined its invitations.",
    "author": "Daniel Strauss",
    "title": "January 6 Recap: Committee Ratchets Up the Pressure on Two Key Trumpies"
  },
  {
    "id": 2612,
    "mediaId": 2636,
    "date": "2022-03-27",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> of Ohio, dressed down in a fleece vest, stood in one corner while Representative Marjorie Taylor Greene of Georgia hustled in and out of the reception area.",
    "author": "",
    "title": "Elise Stefanik, Reinvented in Trump’s Image, Embodies a Changed G.O.P."
  },
  {
    "id": 1173,
    "mediaId": 2621,
    "date": "2022-03-31",
    "sentence": "Congressmen Madison Cawthorn (R-NC) and <span class='selected-term'>Jim Jordan</span> (R-OH) were among the more high-profile members at the event.",
    "author": "Alex Griffing",
    "title": "Newly Hired CBS Contributor Mick Mulvaney Attends Right-Wing Fundraiser For Liz Cheney’s Primary Opponent"
  },
  {
    "id": 1097,
    "mediaId": 2745,
    "date": "2022-03-31",
    "sentence": "“When you actually run on a platform, here’s what we care about, here’s what we’re going to do because the American people care about that —- that will help keep the team together and accomplishing what we told the people we were going to do when we ran for the job and the reason why they’re gonna put us in the majority and make Kevin speaker,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said last Friday in Ponte Vedra, Fla.\nFor Sen. Thom Tillis (R-N.C.) Cawthorn’s latest comments were not the tipping point for him.",
    "author": "",
    "title": "McCarthy tries to navigate splintering divide among House Republicans"
  },
  {
    "id": 1365,
    "mediaId": 2576,
    "date": "2022-04-03",
    "sentence": "When House Speaker Nancy Pelosi rejected two of the five — Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Jim Banks (R-Ohio) — McCarthy decreed that his caucus would boycott the Jan. 6 committee altogether.",
    "author": "Detroit Free Press Editorial Board",
    "title": "Editorial: Will we ever learn what happened on Jan. 6?"
  },
  {
    "id": 1040,
    "mediaId": 2746,
    "date": "2022-04-04",
    "sentence": "Mrs. Pelosi rejected Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio over their votes to reject certifying the 2020 presidential election results.",
    "author": "Mica Soellner",
    "title": "Rep. Raskin says Jan. 6 panel is a ‘model, bipartisan committee’"
  },
  {
    "id": 953,
    "mediaId": 2572,
    "date": "2022-04-07",
    "sentence": "Hageman’s political team noted that no non-incumbent Republican topped $1.3 million in the final quarter of last year and that only five GOP incumbents cracked that threshold – McCarthy ($3.7M), House Minority Whip Steve Scalise ($2.6M), Rep. Dan Crenshaw of Texas ($2.1M), Cheney ($2M), and Rep. <span class='selected-term'>Jim Jordan</span> of Ohio ($1.4M).",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Cheney primary challenger Hageman hauls in over $1.3 million past three months"
  },
  {
    "id": 328,
    "mediaId": 2730,
    "date": "2022-04-10",
    "sentence": "No members appointed by the minority party serve on the select committee, since Pelosi blocked House Minority Leader Kevin McCarthy's picks of Reps. Banks and <span class='selected-term'>Jim Jordan</span> (R-OH), leading McCarthy to pull all his picks.",
    "author": "Rebecca Downs",
    "title": "Chris Christie Has a Theory About Liz Cheney"
  },
  {
    "id": 735,
    "mediaId": 2643,
    "date": "2022-04-10",
    "sentence": "In July, Pelosi objected to two of McCarthy's appointments to the panel—Representatives <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana.",
    "author": "Xander Landen",
    "title": "Raskin Says 1/6 Committee 'Able to Get Work Done' Thanks to McCarthy Gamble"
  },
  {
    "id": 773,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "Kevin McCarthy on the phone with @RepLizCheney “I think this will pass, and it would be my recommendation you should resign.” pic.twitter.com/uk0sLDVdoa\n— Jean (@jeanvas5) April 22, 2022\nThis new audio belies McCarthy’s public face on January 6, where he strongly recommended an investigation into the Capitol attacks, then did an about-face after House Speaker Nancy Pelosi rejected the addition of Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Ind.",
    "author": "Jennifer Oliver O'Connell",
    "title": "GOP Leader Kevin McCarthy Caught on Tape; Says He Would Convince Trump That He 'Should Resign'"
  }
]