[
  {
    "id": 6592,
    "mediaId": 6621,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic,” Trump said.",
    "author": "",
    "title": "WHERE'S THE BEEF? Trump Says DeSantis Feud Fake News, ‘We Get Along Great,’ ‘He’s Done a Terrific Job’"
  },
  {
    "id": 6711,
    "mediaId": 2569,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them; they were fantastic.",
    "author": "",
    "title": "‘Totally fake news’: Donald Trump downplays any split with Ron DeSantis"
  },
  {
    "id": 6575,
    "mediaId": 2569,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them, they were fantastic.",
    "author": "",
    "title": "Sunburn — The morning read of what’s hot in Florida politics — 1.21.22"
  },
  {
    "id": 6840,
    "mediaId": 2526,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them; they were fantastic.",
    "author": "Hannah Bleau",
    "title": "Exclusive — Ron DeSantis’s Office Debunks Rumors of Infighting with Trump: ‘Fabricated’ Narrative to Distract from Biden’s Failures"
  },
  {
    "id": 6877,
    "mediaId": 2595,
    "date": "2022-01-21",
    "sentence": "He was — he was right up front, along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them.",
    "author": "M Dowling",
    "title": "Trump MURDERS the Fake Trump-DeSantis Feud Story"
  },
  {
    "id": 6917,
    "mediaId": 2748,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic,” Trump said.",
    "author": "",
    "title": "WHERE'S THE BEEF? Trump Says DeSantis Feud Fake News, ‘We Get Along Great,’ ‘He’s Done a Terrific Job’"
  },
  {
    "id": 6969,
    "mediaId": 2553,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic.",
    "author": "Ryan Saavedra",
    "title": "Trump Makes Statement Over Reports That He Has A Problem With Governor Ron DeSantis"
  },
  {
    "id": 6965,
    "mediaId": 2730,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic.",
    "author": "Madeline Leesman",
    "title": "Trump Responds to Reports Claiming That He Has Conflict with DeSantis"
  },
  {
    "id": 6570,
    "mediaId": 2634,
    "date": "2022-01-24",
    "sentence": "If the Republicans retake the House this November, the chairman of the Judiciary Committee is going to be <span class='selected-term'>Jim Jordan</span>.",
    "author": "Michael Tomasky",
    "title": "The Case for Impeaching Clarence Thomas"
  },
  {
    "id": 6627,
    "mediaId": 2688,
    "date": "2022-01-25",
    "sentence": "In the wake of the announcement, DeSantis put out a rather misleading tweet, claiming the Biden administration made the decision “without a shred of clinical data.”\nTrumpy lap-dog Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) retweeted it.",
    "author": "Jackie Wilhelm",
    "title": "Where Things Stand: FDA Halting Use Of Some Monoclonal Antibodies Treatments Bursts GOP’s Anti-Vax Bubble"
  },
  {
    "id": 6892,
    "mediaId": 2553,
    "date": "2022-01-25",
    "sentence": "https://t.co/hP55vngVbh\n— Cernovich (@Cernovich) January 25, 2022\n“Unconscionable,” reacted Republican Rep. <span class='selected-term'>Jim Jordan</span> (OH).",
    "author": "Amanda Prestigiacomo",
    "title": "‘Kill People To Harm Republicans’: Social Media Clobbers Biden Admin After FDA Blocks Antibody Treatment"
  },
  {
    "id": 6907,
    "mediaId": 2724,
    "date": "2022-01-27",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them.”\nFurther, Trump has blamed talk of a feud on Mitch McConnell and his allies.",
    "author": "John Hanson",
    "title": "DeSantis Blames ‘Corporate Media’ For Trying To ‘Manufacture’ Feud Between Him And Trump"
  },
  {
    "id": 5949,
    "mediaId": 2644,
    "date": "2022-02-02",
    "sentence": "Ron DeSantis, Sen. Marco Rubio (R-Fla.) former Secretary of State Mike Pompeo and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio).",
    "author": "Mark Moore",
    "title": "Trump, DeSantis confirmed to speak at CPAC in Orlando later this month"
  },
  {
    "id": 6333,
    "mediaId": 2523,
    "date": "2022-02-04",
    "sentence": "",
    "author": "The Associated Press",
    "title": "Pence: ‘Trump is wrong. I had no right to overturn the election’"
  },
  {
    "id": 5491,
    "mediaId": 2590,
    "date": "2022-02-06",
    "sentence": "— GoFundMe (@gofundme) February 5, 2022\n Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) also complained on Twitter, and Elon Musk gushed: “Canadian truckers rule.”\nIn addition, Louisiana Attorney General Jeff Landry and West Virginia Attorney General Patrick Morrisey, both Republicans, indicated Saturday that they’re investigating the issue.",
    "author": "Mary Papenfuss",
    "title": "Gov. Ron DeSantis Going After GoFundMe For Dumping Anti-Vaccine Ottawa Truckers"
  },
  {
    "id": 5552,
    "mediaId": 2550,
    "date": "2022-02-09",
    "sentence": "*Some of those who voted against the bill include the MAGA all-star clown car of Marjorie Taylor Greene, Paul Gosar, Lauren Boebert, Madison Cawthorn, <span class='selected-term'>Jim Jordan</span>, and Chip Roy, among others.",
    "author": "",
    "title": "Rep. Matt Gaetz gives speech against sexual harassment. Yes, that Matt Gaetz"
  },
  {
    "id": 6033,
    "mediaId": 2547,
    "date": "2022-02-09",
    "sentence": "*Some of those who voted against the bill include the MAGA all-star clown car of Marjorie Taylor Greene, Paul Gosar, Lauren Boebert, Madison Cawthorn, <span class='selected-term'>Jim Jordan</span>, and Chip Roy, among others.",
    "author": "Walter Einenkel",
    "title": "Eyeroll Of The Week: Matt Gaetz's Speech On Sexual Harassment"
  },
  {
    "id": 5906,
    "mediaId": 2569,
    "date": "2022-02-11",
    "sentence": "The Lincoln Project is coming out Friday with a new ad targeting congressional Republicans for their participation in the 2022 “Coward Olympics” by continuing to promote falsehoods about the Jan. 6 Capitol riot and standing for Donald Trump‘s electoral “big lie.”\nExplicitly named in the minute-long spot — House Minority Leader Kevin McCarthy, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, and Rep. Marjorie Taylor Green of Georgia.",
    "author": "Peter Schorsch",
    "title": "Sunburn — The morning read of what’s hot in Florida politics — 2.11.22"
  },
  {
    "id": 5823,
    "mediaId": 2643,
    "date": "2022-02-11",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> also believes the committee investigating the Capitol riot wants to keep Trump from running for the White House again.",
    "author": "Jenni Fink",
    "title": "Matt Gaetz Believes Jan. 6 Committee Will Try to Block Trump From 2024 Run"
  },
  {
    "id": 4644,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "School officials or parents in 15 different counties received or witnessed threats they considered serious enough to report to police.”\nAccording to Republicans from state attorneys general to Rep. <span class='selected-term'>Jim Jordan</span> to Sen. Josh Hawley and Florida Gov.",
    "author": "Laura Clawson",
    "title": "'You better grow eyes in the back of your head': Death threats to school boards are very real"
  },
  {
    "id": 4906,
    "mediaId": 2547,
    "date": "2022-02-17",
    "sentence": "School officials or parents in 15 different counties received or witnessed threats they considered serious enough to report to police.”\nAccording to Republicans from state attorneys general to Rep. <span class='selected-term'>Jim Jordan</span> to Sen. Josh Hawley and Florida Gov.",
    "author": "Laura Clawson",
    "title": "Death Threats To School Boards Are Very Real"
  },
  {
    "id": 4942,
    "mediaId": 2584,
    "date": "2022-02-18",
    "sentence": "The Ohio congressman <span class='selected-term'>Jim Jordan</span> similarly decried GoFundMe.",
    "author": "Sergio Olmos",
    "title": "Republicans who opposed racial justice protests hope truckers ‘clog up’ US cities"
  },
  {
    "id": 4647,
    "mediaId": 2564,
    "date": "2022-02-23",
    "sentence": "+6\nView gallery\nFormer Trump Interior Secretary Ryan Zinke, running for a House seat in Montana, posted photos of himself at the event as well\n+6\nView gallery\nThis image shared by Zinke shows Liz Cheney challenger Harriet Hageman (left) speaking at an event with Ohio Rep. <span class='selected-term'>Jim Jordan</span> (right)\n+6\nView gallery\nAnother image showed a donor (right) with former acting Attorney General Matthew Whitaker (left)\nAnother photo from the event appears to show a GOP donor alongside former Acting Attorney General Matthew Whitaker.",
    "author": "Elizabeth Elkind",
    "title": "Trump meets Ted Cruz at Mar-a-Lago ahead of C-PAC: Republicans and conservative donors mingle at private Florida private club ahead of ex-President's prime-time Saturday night speech"
  },
  {
    "id": 4564,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "The \"Take Back Congress Candidate Forum” will be littered with 10 congressional Trump acolytes like Representative <span class='selected-term'>Jim Jordan</span> of Ohio and 13 hopefuls such as United States Senate candidate Herschel Walker of Georgia.",
    "author": "Brandon Gage",
    "title": "Donald Trump to host ‘Magapalooza’ at Mar-a-Lago on Wednesday"
  },
  {
    "id": 4905,
    "mediaId": 2580,
    "date": "2022-02-24",
    "sentence": "A host of prominent conservatives will speak at CPAC this weekend, from U.S. Sen. Ted Cruz to former Secretary of State Mike Pompeo, U.S. Sen. Marco Rubio and U.S. Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "",
    "title": "DeSantis, Trump to speak at CPAC"
  },
  {
    "id": 4448,
    "mediaId": 2862,
    "date": "2022-02-25",
    "sentence": "\"Apart from the former president himself, his son Donald Trump Jr., former Secretary of State Mike Pompeo, Senator Ted Cruz, Florida Governor Ron DeSantis, Nigel Farage, and Rep <span class='selected-term'>Jim Jordan</span> are among the high-profile speakers.While devoted fans are anticipating Trump's undeniably poignant and likely lengthy speech (as usual), other prominent conservatives took their moment to weigh in.",
    "author": "",
    "title": "The Republican Awakening"
  },
  {
    "id": 4112,
    "mediaId": 2658,
    "date": "2022-02-27",
    "sentence": "You know, everyone loves <span class='selected-term'>Jim Jordan</span> here.",
    "author": "",
    "title": "At CPAC, Trump delivers a reminder of his muscle"
  },
  {
    "id": 4125,
    "mediaId": 2584,
    "date": "2022-02-28",
    "sentence": "",
    "author": "David Smith",
    "title": "Trump ignores Farage – and risks midterm elections farrago – with insistence on big lie"
  },
  {
    "id": 3289,
    "mediaId": 2595,
    "date": "2022-03-10",
    "sentence": "Ohio Republican lawmaker <span class='selected-term'>Jim Jordan</span> requested a briefing with the FBI after a whistleblower disclosed information about two pipe bombs planted on January 5, the night before the Capitol riot/rally.",
    "author": "M Dowling",
    "title": "Only J6 Committee Has Info on Would-Be Bomber"
  },
  {
    "id": 3041,
    "mediaId": 2594,
    "date": "2022-03-17",
    "sentence": "Even <span class='selected-term'>Jim Jordan</span> got in on the action, asking on Twitter, \"where’s Fauci?\"",
    "author": "Justin Vallejo",
    "title": "Where’s Fauci? ‘Witness protection’ quip leads to internet conspiracy"
  },
  {
    "id": 2523,
    "mediaId": 2644,
    "date": "2022-03-25",
    "sentence": "If it’s constitutional, that’s what his job should be — it’s him.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), who was seated next to McCarthy at the event, agreed with the minority leader, saying, “Totally.”\nWhile Wyden remains the only lawmaker to call on Thomas to recuse himself, several legal experts have made similar comments.",
    "author": "Callie Patteson",
    "title": "Clarence Thomas called to recuse himself over wife’s alleged texts"
  },
  {
    "id": 1886,
    "mediaId": 2526,
    "date": "2022-03-26",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) told the Washington Times at the Republican retreat in Florida this week.",
    "author": "Wendell Husebø",
    "title": "Top Republicans Consider Impeaching Joe Biden After Midterm Elections"
  },
  {
    "id": 1973,
    "mediaId": 2550,
    "date": "2022-03-27",
    "sentence": "",
    "author": "",
    "title": "Mark Foley. Dennis Hastert. Matt Gaetz. And Republicans want to pontificate about morals?"
  },
  {
    "id": 2602,
    "mediaId": 6404,
    "date": "2022-03-27",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) told the Washington Times at the Republican retreat in Florida this week.",
    "author": "Mike LaChance",
    "title": "Republicans Already Discussing Possibility Of Impeaching Biden After The Midterms"
  },
  {
    "id": 2628,
    "mediaId": 2748,
    "date": "2022-03-27",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) told the Washington Times at the Republican retreat in Florida this week.",
    "author": "Blarp Blog",
    "title": "Top Republicans Consider Impeaching Joe Biden After Midterm Elections"
  },
  {
    "id": 2645,
    "mediaId": 2608,
    "date": "2022-03-29",
    "sentence": "The records show that Trump was on the phone nearly nonstop from 8:23 a.m. until 11:06 a.m. During that time, he spoke with adviser Steve Bannon, who on a Jan. 5 podcast said “all hell is going to break loose tomorrow.” Trump also spoke with Rudy Giuliani, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), adviser Stephen Miller, and others.",
    "author": "Marisa Sarnoff",
    "title": "White House Phone Logs Provided to Jan. 6 Committee Contain Unexplained Eight-Hour Gap: Report"
  },
  {
    "id": 1513,
    "mediaId": 2569,
    "date": "2022-04-01",
    "sentence": "“The campaign’s continued fundraising strength underscores Luna’s momentum in the first quarter of the election year, in which she also announced multiple high-profile endorsements from House GOP leaders including Conference Chair Elise Stefanik, Rep. <span class='selected-term'>Jim Jordan</span>, and others,” her campaign said in a fundraising email.",
    "author": "",
    "title": "Anna Paulina Luna announces $400K in Q1 fundraising for CD 13 race"
  },
  {
    "id": 1351,
    "mediaId": 6627,
    "date": "2022-04-01",
    "sentence": "“Yet because of the way the federal criminal laws are written in the way that cannabis is placed in schedule one, it is very easy for a marijuana offense to actually get someone a worse sentence than an opioid offense like overprescribing OxyContin or selling fentanyl or a firearms.”\nRep. <span class='selected-term'>Jim Jordan</span> voiced outrage at the marijuana bill’s timing, saying that issues such as crime, inflation, and illegal immigration should be taking precedence.",
    "author": "",
    "title": "Inflation, Immigration, Mass Destruction: DEMS FINALLY HAVE A PLAN!"
  },
  {
    "id": 947,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> voiced outrage at the marijuana bill's timing, saying that issues such as crime, inflation, and illegal immigration should be taking precedence.",
    "author": "",
    "title": "House votes to decriminalize marijuana at federal level"
  },
  {
    "id": 1552,
    "mediaId": 2866,
    "date": "2022-04-03",
    "sentence": "“Yet because of the way the federal criminal laws are written in the way that cannabis is placed in schedule one, it is very easy for a marijuana offense to actually get someone a worse sentence than an opioid offense like overprescribing OxyContin or selling fentanyl or a firearms.”\nRep. <span class='selected-term'>Jim Jordan</span> voiced outrage at the marijuana bill’s timing, saying that issues such as crime, inflation, and illegal immigration should be taking precedence.",
    "author": "Fix This Nation Staff",
    "title": "Pelosi Leads Charge To Decriminalize Marijuana Possession"
  },
  {
    "id": 1774,
    "mediaId": 2664,
    "date": "2022-04-05",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> helped cover up a sex-abuse scandal in college.",
    "author": "Bob Brigham",
    "title": "GOP adopts pedophile smear as QAnon conspiracy theory goes mainstream: report"
  },
  {
    "id": 1439,
    "mediaId": 2744,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, a fellow Republican from Ohio, told National Review that Disney appears to have bent to the “woke mob.” He asserted that Disney will be unlikely to appeal to Republicans in stopping its copyrights from expiring given its recent political dalliances.",
    "author": "Zachary Halaschak",
    "title": "GOP takes aim at Mickey Mouse copyright over Disney opposition to Florida bill"
  },
  {
    "id": 949,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "Fellow far-right Congressman <span class='selected-term'>Jim Jordan</span> of Ohio told National Review he supported the move to block Disney’s copyrights.",
    "author": "Bevan Hurley",
    "title": "Congressional Republicans may block Disney copyright after ‘Don’t Say Gay’ bill row"
  },
  {
    "id": 1007,
    "mediaId": 2621,
    "date": "2022-04-07",
    "sentence": "In a New York Times opinion piece, Mast called for taking action such as, but not limited to, “[d]efining what constitutes an assault or tactical firearm and not allowing them for future purchase — just as we already prohibit the purchase of fully automatic firearms” and “[b]anning the sale of accessories and add-ons that circumvent the ban on automatic firearms, and increasing the ages at which individuals can purchase various categories of firearms.”\nIn addition to Mast, Trump also endorsed on Wednesday Reps. Marjorie Taylor Greene (R-GA), Greg Murphy (R-NC), Kat Cammack (R-FL), Mike Johnson (R-LA), <span class='selected-term'>Jim Jordan</span> (R-OH) and Carol Miller (R-WV).",
    "author": "Jackson Richman",
    "title": "Trump Endorses Rep. Brian Mast By Touting Him as ‘Strong’ on 2nd Amendment — Even Though He Supports Assault Weapons Ban"
  },
  {
    "id": 1472,
    "mediaId": 2803,
    "date": "2022-04-09",
    "sentence": "Also in 2018, Rep. <span class='selected-term'>Jim Jordan</span>, one of Trump’s fiercest allies and a co-founder of the hardline conservative Freedom Caucus, became embroiled in a scandal over his time as a wrestling coach at Ohio State University, where a team doctor named Richard Strauss, who committed suicide in 2005, was found to have sexually abused more than 177 male student athletes.",
    "author": "Jordan Weissmann",
    "title": "So, Let’s Talk About Republicans and Sex Crimes"
  },
  {
    "id": 543,
    "mediaId": 2524,
    "date": "2022-04-13",
    "sentence": "Of course this is pure projection, coming from the party who proudly included former Florida Rep. Mark Foley (resigned after he was accused of sending \"sick,\" \"sexually charged\" email to a teenage boy), former House Speaker Dennis Hastert (accused of sexually abusing teenage boys who he silenced with hush money), current Ohio Rep. <span class='selected-term'>Jim Jordan</span> (accused of trying to help cover up sexual abuse by an Ohio State doctor against teenage wrestlers), former Trump advisor George Nader (sentenced to 10 years of prison for child pornography and child molestation), former Alabama Trump-backed nominee for U.S. Senate Roy Moore (accused of sexual abuse against young teenage girls), current Florida Rep. Matt Gaetz (under investigation for sex trafficking and having sex with at least one teenage girl), and many more (see video at bottom).",
    "author": "Carla Sinclair",
    "title": "The sicko GQP can't stop saying their new favorite LGBTQ smear word \"grooming\" in supercut video"
  },
  {
    "id": 705,
    "mediaId": 2676,
    "date": "2022-04-18",
    "sentence": "Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span>, along with several other House Republicans, is threatening to allow Disney's copyright on Mickey Mouse to lapse as early as next year.",
    "author": "Jon Skolnik",
    "title": "Right-wing protesters attempt Disney World \"blockade\" in support of \"Don't Say Gay\" law"
  },
  {
    "id": 274,
    "mediaId": 2532,
    "date": "2022-04-21",
    "sentence": "Following the court decision blocking the CDC's mask order in transportation, Ohio Republican Congressman <span class='selected-term'>Jim Jordan</span> tweeted that \"Fauci lost.",
    "author": "Alexander Tin",
    "title": "Fauci fears judge's ruling on travel mask mandate may set \"dangerous precedent\""
  },
  {
    "id": 319,
    "mediaId": 2685,
    "date": "2022-04-22",
    "sentence": "",
    "author": "LISA MASCARO",
    "title": "McCarthy, Trump have 'positive' call despite Jan. 6 audio"
  }
]