[
  {
    "id": 5486,
    "mediaId": 2572,
    "date": "2022-02-03",
    "sentence": "Reps. James Comer, R-Ky.,, a member of the Oversight and Reform Committee; Steve Scalise, R-La., the minority whip and ranking member of the Select Subcommittee on the Coronavirus Crisis; and <span class='selected-term'>Jim Jordan</span>, R-Ohio, ranking member of the Judiciary Committee, have questioned whether these scientists felt pressure from top health officials like Dr. Antony Fauci and Dr. Francis Collins.",
    "author": "Caitlin McFall",
    "title": "Top oversight Republicans call on 7 scientists to testify on COVID origins, Wuhan lab leak"
  },
  {
    "id": 6320,
    "mediaId": 2580,
    "date": "2022-02-05",
    "sentence": "This deep distrust includes two prominent members of Congress, Rep. <span class='selected-term'>Jim Jordan</span>, ranking member of the Committee on the Judiciary, and U.S. Sen. Roger Marshall, R-Kan., a scientist and physician I spoke with on Wednesday.",
    "author": "GOPUSA",
    "title": "Rep. Jim Jordan and Sen. Roger Marshall Expose Fauci’s Web of Deceit"
  },
  {
    "id": 5851,
    "mediaId": 4032,
    "date": "2022-02-10",
    "sentence": "In a letter to Jeremy Farrar of Britain’s Wellcome Trust and six others, Representatives James Comer of Kentucky, Steve Scalise of Louisiana and <span class='selected-term'>Jim Jordan</span> of Ohio asked for details about a teleconference in February 2020 that included Farrar, Francis Collins of the National Institutes of Health, and Anthony Fauci, head of the National Institute of Allergy and Infectious Diseases, an NIH subsidiary.",
    "author": "Veronika Kyrylenko",
    "title": "Probe Into China Virus Lab Leak Expands. House GOPers Demand Answers From Top Scientists"
  },
  {
    "id": 2422,
    "mediaId": 6449,
    "date": "2022-03-23",
    "sentence": "It is worth recalling Fauci’s comments in response to questions from Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, about health measures amidst the pandemic: “I don’t look at this as a liberty thing … just as a public health thing.”\nHe was wrong.",
    "author": "Frank Yang",
    "title": "‘15 Days’ to 2 Years: How Power Corrupted Our Public Health Bureaucrats"
  }
]