[
  {
    "id": 6390,
    "mediaId": 2658,
    "date": "2022-01-03",
    "sentence": "And House Minority Leader Kevin McCarthy and Judiciary Committee ranking member <span class='selected-term'>Jim Jordan</span> (R-Ohio) have expressed objections to many of the antitrust proposals, casting doubts on the future of these efforts if the GOP takes over the House next year.",
    "author": "",
    "title": "2022 kicks off with tech nomination do-overs"
  },
  {
    "id": 6055,
    "mediaId": 2746,
    "date": "2022-02-02",
    "sentence": "“The only way to fix this is by encouraging competition and allowing it and promoting it, not eliminating it, and certainly not giving people a hall pass to engage in contact that would challenge, threaten, and undermine it.”\nMr. Lee’s opposition to the legislation echoed complaints last year by Rep. <span class='selected-term'>Jim Jordan</span>, Ohio Republican, against the House version of the bill.",
    "author": "Ryan Lovelace",
    "title": "Antitrust panel examines bill to give news publishers more negotiating power against Big Tech"
  },
  {
    "id": 6278,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "Politico also acknowledges that Republican lawmakers have flocked to Breitbart to condemn the legislation:\nBut the bill has also attracted major GOP critics such as Florida Sen. Marco Rubio, Tennessee Sen. Marsha Blackburn, House Minority Leader Kevin McCarthy and House Judiciary ranking member <span class='selected-term'>Jim Jordan</span> of Ohio, all of whom have done interviews with Breitbart opposing the legislation.",
    "author": "Allum Bokhari",
    "title": "Politico Attacks Breitbart for Not Joining Media Cartel Bandwagon"
  },
  {
    "id": 5791,
    "mediaId": 2522,
    "date": "2022-02-07",
    "sentence": "Microsoft has been previously accused by its competitors, as well as lawmakers including Republican Ohio Rep. <span class='selected-term'>Jim Jordan</span>, who chairs the House Judiciary Committee overseeing antitrust legislation, of influencing members of Congress to target Meta, Google, Apple and Amazon while exempting itself.",
    "author": "BPR Wire",
    "title": "Google accuses Microsoft of ‘carving out’ exception in anti-Big Tech bill targeting app stores"
  }
]