[
  {
    "id": 6920,
    "mediaId": 2746,
    "date": "2022-01-28",
    "sentence": "The four-page letter was signed by Reps. Andy Biggs of Arizona; Chip Roy of Texas; Cliff Bentz of Oregon; Dan Bishop of North Carolina; Darrell Issa of California; <span class='selected-term'>Jim Jordan</span> of Ohio; Ken Buck of Colorado; Louie Gohmert of Texas; Matt Gaetz of Florida; Michelle Fischbach of Minnesota; Mike Johnson of Louisiana; Scott Fitzgerald of Wisconsin; Tom McClintock of California; Tom Tiffany of Wisconsin; W. Gregory Steube of Florida and Victoria Spartz of Indiana.",
    "author": "Emily Zantow",
    "title": "House Republicans press DOJ on ‘racial discrimination’ in COVID-19 treatment policies"
  },
  {
    "id": 5737,
    "mediaId": 2594,
    "date": "2022-02-04",
    "sentence": "House Minority Leader Kevin McCarthy initially announced a slate of Republicans that included allies of Mr Trump like Reps Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Eric Garcia",
    "title": "RNC votes to censure Liz Cheney and Adam Kinzinger over January 6 committee investigation"
  },
  {
    "id": 2804,
    "mediaId": 2594,
    "date": "2022-03-09",
    "sentence": "But then House Speaker Nancy Pelosi vetoed the membership of Reps Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Eric Garcia",
    "title": "Republican National Committee sues the January 6 Committee for ‘unlawfully seizing information’"
  },
  {
    "id": 1439,
    "mediaId": 2744,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, a fellow Republican from Ohio, told National Review that Disney appears to have bent to the “woke mob.” He asserted that Disney will be unlikely to appeal to Republicans in stopping its copyrights from expiring given its recent political dalliances.",
    "author": "Zachary Halaschak",
    "title": "GOP takes aim at Mickey Mouse copyright over Disney opposition to Florida bill"
  }
]