[
  {
    "id": 1321,
    "mediaId": 2784,
    "date": "2022-04-05",
    "sentence": "The letter is led by James Lankford of Oklahoma and <span class='selected-term'>Jim Jordan</span> of Ohio and signed by Thom Tillis of North Carolina, James Risch of Idaho, Mike Braun of Indiana, Jim Inhofe of Oklahoma, Roger Marshall of Kansas, Josh Hawley of Missouri, Marsha Blackburn of Tennessee, Mike Lee of Utah, John Boozman of Arkansas, Roger Wicker of Mississippi, and Mike Crapo of Idaho.",
    "author": "",
    "title": "Republican Senators Demand Investigation of 5 Fully-Formed Babies Killed in Late Abortions or Infanticides"
  },
  {
    "id": 1607,
    "mediaId": 4024,
    "date": "2022-04-05",
    "sentence": "In light of the refusal of the D.C. police to investigate potential violations of federal law, the Republican lawmakers wrote in their letter, according to The Daily Wire, that they “demand that a thorough investigation is conducted into the death of each child.” They added that “in order to accomplish such [an] investigation, we request and fully expect the city to preserve all of the children’s remains as evidence and conduct autopsies.”\nLed by James Lankford of Oklahoma and <span class='selected-term'>Jim Jordan</span> of Ohio, the letter also was signed by Thom Tillis of North Carolina, James Risch of Idaho, Mike Braun of Indiana, Jim Inhofe of Oklahoma, Roger Marshall of Kansas, Josh Hawley of Missouri, and Mike Crapo of Idaho.",
    "author": "",
    "title": "US lawmakers call for DC mayor, Dept. of Justice to investigate abortions of late-term babies"
  },
  {
    "id": 1717,
    "mediaId": 4032,
    "date": "2022-04-06",
    "sentence": "Senator James Lankford (R-Okla.) and U.S. Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio), along with 21 of their congressional colleagues, signed an April 5 letter to D.C. Mayor Muriel Bowser and metropolitan police chief Robert J. Contee about the remains.",
    "author": "Rebecca Terrell",
    "title": "U.S. Legislators Demand #JusticeForTheFive"
  }
]