[
  {
    "id": 6081,
    "mediaId": 2522,
    "date": "2022-02-08",
    "sentence": "— Joe Albanese (@jalbanese27) February 7, 2022\nMany on Twitter sounded off on the administration’s stance, including Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Kevin Haggerty",
    "title": "‘Where’s your mask Jen?’ Psaki says WH stands by recommendation that students wear masks in schools"
  },
  {
    "id": 5984,
    "mediaId": 2643,
    "date": "2022-02-09",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio) is attempting to rally the right by repeating a claim that the Biden administration is planning to hand out free \"crack pipes.\"",
    "author": "Aila Slisco",
    "title": "Jim Jordan Rallies the Right by Repeating Government 'Crack Pipe' Fable"
  },
  {
    "id": 5764,
    "mediaId": 2643,
    "date": "2022-02-09",
    "sentence": "Republicans like Representative <span class='selected-term'>Jim Jordan</span>, Senator Marsha Blackburn and Florida congressional candidate Lavern Spicer reacted on social media to the story, with Blackburn tweeting, \"End government-funded crack pipes.\"",
    "author": "Alexandra Hutzler",
    "title": "White House Says Crack Pipes Never Included in Safe Smoking Kits"
  },
  {
    "id": 5002,
    "mediaId": 2643,
    "date": "2022-02-15",
    "sentence": "Congress members such as Blackburn and <span class='selected-term'>Jim Jordan</span> (R-Ohio) both shared social media posts against what Blackburn calls \"government-funded crack pipes.\"",
    "author": "Daniel Villarreal",
    "title": "Biden Admin Commits to No Crack Pipes, Avoids Partial Government Shutdown"
  },
  {
    "id": 4376,
    "mediaId": 2724,
    "date": "2022-03-01",
    "sentence": "https://t.co/rJ4GDf6hlH\n— Gary Weiss (@gary_weiss) February 28, 2022\nRELATED: Video: <span class='selected-term'>Jim Jordan</span> Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nPsaki then touted Biden’s leadership abilities.",
    "author": "John Hanson",
    "title": "ABC’s George Stephanopoulos Breaks The News To Psaki That A Majority Of Americans ‘Question The President’s Mental Capacity’"
  },
  {
    "id": 3453,
    "mediaId": 2724,
    "date": "2022-03-09",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) March 8, 2022\nRELATED: Psaki Gets Testy With Fox News’ Peter Doocy In Tense Back And Forth Over Spiking Gas Prices: ‘Let Me Finish’\nRep. Jordan: ‘The real answer is, let’s increase production here’\nOpening up the segment with clips of reporters asking White House press secretary Jen Psaki about Biden looking to Venezuela, Saudi Arabia, and Iran for help on the oil front, Fox host Steve Doocy asked Jordan what the impact of banning Russian oil imports will be.",
    "author": "John Hanson",
    "title": "Do Democrats Want $7 Gas? Rep. Jim Jordan Says Yes"
  },
  {
    "id": 3290,
    "mediaId": 2590,
    "date": "2022-03-10",
    "sentence": "Biden “shut off the Keystone Pipeline,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) declared in an interview last week.",
    "author": "Chris D'Angelo",
    "title": "The GOP's Biggest Whoppers About Biden And Fossil Fuels"
  },
  {
    "id": 3198,
    "mediaId": 2526,
    "date": "2022-03-11",
    "sentence": "“The First Amendment prohibits the government from directly censoring speech it finds objectionable.”\nThe group of Republicans consists of House Energy and Commerce Committee Ranking Member Cathy McMorris Rodgers (R-WA), House Minority Whip and Select Committee on the Coronavirus Crisis Ranking Member Steve Scalise (R-LA), Judiciary Committee Ranking Member <span class='selected-term'>Jim Jordan</span> (R-OH), and Oversight and Reform Committee Ranking Member James Comer (R-KY).",
    "author": "Jacob Bliss",
    "title": "Exclusive: House Republican Leaders Send Letter to Surgeon General over Big Tech Censorship"
  },
  {
    "id": 3095,
    "mediaId": 2724,
    "date": "2022-03-11",
    "sentence": "",
    "author": "RealClearWire",
    "title": "Will Dems’ Green Dream Fuel GOP Red Wave?"
  },
  {
    "id": 2322,
    "mediaId": 2877,
    "date": "2022-03-23",
    "sentence": "But the Kremlin can.” —Congressman <span class='selected-term'>Jim Jordan</span>\nNon Compos Mentis Awards\n“I can’t.",
    "author": "Jordan Candler",
    "title": "Wednesday Short Cuts"
  },
  {
    "id": 1383,
    "mediaId": 2745,
    "date": "2022-04-01",
    "sentence": "… Let’s focus on the things that matter,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said.",
    "author": "",
    "title": "House passes bill decriminalizing marijuana; Senate fortunes unclear"
  },
  {
    "id": 1670,
    "mediaId": 2644,
    "date": "2022-04-01",
    "sentence": "Bill sponsor Rep. Jerry Nadler (D-NY) urged colleagues to support the MORE Act, saying Friday, “This bill will greatly reduce crime by redefining as not crimes things that are now considered crimes and by releasing people in jail who should not be in jail.”\nBut Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said Democrats called the vote because they “can’t deal” with other problems, such as inflation and illegal immigration, both at four-decade highs.",
    "author": "Steven Nelson",
    "title": "House votes to legalize marijuana despite Biden opposition"
  },
  {
    "id": 944,
    "mediaId": 2572,
    "date": "2022-04-05",
    "sentence": "\"<span class='selected-term'>Jim Jordan</span>, my colleagues and I are ready to see this through to the end.\"",
    "author": "Andrew Mark Miller",
    "title": "House Republicans send letter to Hunter Biden law firm seeking preservation of records"
  }
]