[
  {
    "id": 1842,
    "mediaId": 2572,
    "date": "2022-03-24",
    "sentence": "Ohio Congressman <span class='selected-term'>Jim Jordan</span>, ranking member of House Judiciary, is right in the middle of all this and joins me now.",
    "author": "",
    "title": "'The Ingraham Angle' on Kamala Harris, Ketanji Brown Jackson"
  },
  {
    "id": 143,
    "mediaId": 2664,
    "date": "2022-04-21",
    "sentence": "Lincoln Project co-founder Reed Galen suggested that Reps. Marjorie Taylor Greene (R-GA), Paul Gosar (R-AZ), and <span class='selected-term'>Jim Jordan</span> (R-OH) were imagining themselves holding McCarthy's job.",
    "author": "Bob Brigham",
    "title": "Experts say Kevin McCarthy ‘stepped on a rake’ and ‘Greene, Gosar and Jordan are licking their chops’"
  },
  {
    "id": 319,
    "mediaId": 2685,
    "date": "2022-04-22",
    "sentence": "",
    "author": "LISA MASCARO",
    "title": "McCarthy, Trump have 'positive' call despite Jan. 6 audio"
  },
  {
    "id": 606,
    "mediaId": 2642,
    "date": "2022-04-22",
    "sentence": "“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter, led by Ranking Member <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Missy Crane",
    "title": "GOP Just Came Out Swinging Against Twitter’s Woke Board…They’re Officially On Notice"
  },
  {
    "id": 556,
    "mediaId": 5117,
    "date": "2022-04-22",
    "sentence": "He has tried to temper his closest rivals, Rep. Steve Scalise of Louisiana and Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, even as he works to shore up the votes that would be needed to become speaker.",
    "author": "",
    "title": "Audio reveals GOP leader Kevin McCarthy planned to urge Trump to resign after Jan. 6 attack"
  },
  {
    "id": 773,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "Kevin McCarthy on the phone with @RepLizCheney “I think this will pass, and it would be my recommendation you should resign.” pic.twitter.com/uk0sLDVdoa\n— Jean (@jeanvas5) April 22, 2022\nThis new audio belies McCarthy’s public face on January 6, where he strongly recommended an investigation into the Capitol attacks, then did an about-face after House Speaker Nancy Pelosi rejected the addition of Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Ind.",
    "author": "Jennifer Oliver O'Connell",
    "title": "GOP Leader Kevin McCarthy Caught on Tape; Says He Would Convince Trump That He 'Should Resign'"
  }
]