[
  {
    "id": 5754,
    "mediaId": 2658,
    "date": "2022-02-07",
    "sentence": "“I’m not aware of what his intention is.”\nRep. Rodney Davis (R-Ill.), the party’s top member on the committee with jurisdiction over Capitol security, said: “Look, it’s gonna depend upon what Leader McCarthy wants.” Davis was one of McCarthy’s picks to sit on the select committee before he decided to boycott the panel over Pelosi’s refusal to seat two other Republican selections — Banks and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio).",
    "author": "",
    "title": "The GOP’s Jan. 6 committee dilemma: Disband it, or turn it on Dems?"
  },
  {
    "id": 5552,
    "mediaId": 2550,
    "date": "2022-02-09",
    "sentence": "*Some of those who voted against the bill include the MAGA all-star clown car of Marjorie Taylor Greene, Paul Gosar, Lauren Boebert, Madison Cawthorn, <span class='selected-term'>Jim Jordan</span>, and Chip Roy, among others.",
    "author": "",
    "title": "Rep. Matt Gaetz gives speech against sexual harassment. Yes, that Matt Gaetz"
  },
  {
    "id": 5823,
    "mediaId": 2643,
    "date": "2022-02-11",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> also believes the committee investigating the Capitol riot wants to keep Trump from running for the White House again.",
    "author": "Jenni Fink",
    "title": "Matt Gaetz Believes Jan. 6 Committee Will Try to Block Trump From 2024 Run"
  },
  {
    "id": 4656,
    "mediaId": 2730,
    "date": "2022-02-19",
    "sentence": "House Minority Leader Kevin McCarthy (R-CA) had selected five members, including Banks, but pulled them all back once Pelosi vetoed McCarthy's selection of Banks and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Rebecca Downs",
    "title": "Democratic Challenger's Attempt to Ban Rep. Jim Banks from Office Fails Miserably"
  },
  {
    "id": 4908,
    "mediaId": 2550,
    "date": "2022-02-19",
    "sentence": "It cannot be emphasized enough: This was coming from a caucus that counts among its members the likes of Reps. <span class='selected-term'>Jim Jordan</span>, Andy Biggs, Paul Gosar, Matt Gaetz, Jody Hice, Marjorie Taylor Greene, Louie Gohmert, Madison Cawthorn, and Lauren Boebert.",
    "author": "Darrell Lucus",
    "title": "Freedom Caucus member: Jan. 6 could have been 'a stake in the heart of the federal republic'"
  },
  {
    "id": 3833,
    "mediaId": 2658,
    "date": "2022-02-25",
    "sentence": "I’m going to side with the <span class='selected-term'>Jim Jordan</span>s — the tip of the spear in Washington.”\nAnother consideration for McCarthy, as he makes a play for the speakership, is who will support him and who could threaten his push to secure the role next January if Republicans retake the House.",
    "author": "",
    "title": "The primary foreshadowing the future of the GOP"
  },
  {
    "id": 3292,
    "mediaId": 2644,
    "date": "2022-03-10",
    "sentence": "During the 2019 impeachment proceedings — which culminated with Trump being acquitted in a party-line vote — Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said Ukraine was regarded by accounting firm Ernst & Young as “one of the three most corrupt countries on the planet.”\nCawthorn is running for re-election in North Carolina’s 11th District, where he is facing seven Republican primary challengers.",
    "author": "Evan Simko-Bednarski",
    "title": "GOP Rep. Madison Cawthorn slams Zelensky as a ‘thug’ overseeing ‘evil’ government"
  },
  {
    "id": 2926,
    "mediaId": 2550,
    "date": "2022-03-11",
    "sentence": "Going back a little further than that, during Trump’s first Ukraine-centered impeachment, a standard Republican talking point was that Ukraine was incredibly corrupt, “one of the three most corrupt countries on the planet,” according to Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "",
    "title": "Cawthorn isn't alone as a Republican crapping on Ukraine. He just has bad timing"
  },
  {
    "id": 2216,
    "mediaId": 2699,
    "date": "2022-03-29",
    "sentence": "“I don’t know anything about what Madison referenced,” said Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), a leader of the right-most flank of the conference that includes Cawthorn.",
    "author": "Sam Brodey",
    "title": "Angry GOP Responds to Cawthorn’s ‘Bizarre’ D.C. Orgy Claims: ‘Name Names’"
  },
  {
    "id": 2671,
    "mediaId": 2646,
    "date": "2022-03-30",
    "sentence": "Cover-up specialist Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) refused to defend Cawthorn’s alleged sexcapades, telling The Daily Beast that he doesn’t “know anything about what Madison referenced”\nEven the perennial front runner for dumbest Congressman, Texas Republican Louis Gohmert called the North Carolina freshman’s remarks “bizarre.”\nCawthorn is facing pressure from all sides now, inside and outside the party.",
    "author": "Ty Ross",
    "title": "WHODUNNIT? GOP clamors for names in Cawthorn “Orgy-gate” accusations"
  },
  {
    "id": 988,
    "mediaId": 2550,
    "date": "2022-03-31",
    "sentence": "It's a hell of a coincidence that Rep. Matt Gaetz's closest legislative partner appears to be Rep. <span class='selected-term'>Jim Jordan</span>, the House Republican famous for turning a blind eye to sexual assaults going on around him.",
    "author": "Hunter\nDaily Kos Staff",
    "title": "Madison Cawthorn vows to keep talking about Republican cocaine use and orgies"
  },
  {
    "id": 1097,
    "mediaId": 2745,
    "date": "2022-03-31",
    "sentence": "“When you actually run on a platform, here’s what we care about, here’s what we’re going to do because the American people care about that —- that will help keep the team together and accomplishing what we told the people we were going to do when we ran for the job and the reason why they’re gonna put us in the majority and make Kevin speaker,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said last Friday in Ponte Vedra, Fla.\nFor Sen. Thom Tillis (R-N.C.) Cawthorn’s latest comments were not the tipping point for him.",
    "author": "",
    "title": "McCarthy tries to navigate splintering divide among House Republicans"
  },
  {
    "id": 1336,
    "mediaId": 2590,
    "date": "2022-04-01",
    "sentence": "“Every major urban area has increased crime and Democrats are legalizing drugs and propping up the marijuana industry,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said on the House floor.",
    "author": "Arthur Delaney",
    "title": "House Passes Marijuana Decriminalization Bill"
  },
  {
    "id": 1003,
    "mediaId": 2594,
    "date": "2022-04-02",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span>, one of the co-founders of the House Freedom Caucus and one of Donald Trump’s fiercest apologists in Congress, had nothing to say when The Independent asked about his remarks.",
    "author": "Eric Garcia",
    "title": "Madison Cawthorn’s comments angered House Republicans. He was already in trouble back home"
  },
  {
    "id": 1010,
    "mediaId": 2621,
    "date": "2022-04-03",
    "sentence": "",
    "author": "Katherine Huggins",
    "title": "Fox News’ Trey Gowdy Blasts Cawthorn Over Orgy Comments: ‘Can’t Blame the Media for Something That Came Out of Your Mouth’"
  },
  {
    "id": 472,
    "mediaId": 2746,
    "date": "2022-04-22",
    "sentence": "Ohio protesters have also held demonstrations to keep Rep. <span class='selected-term'>Jim Jordan</span>, a Republican, off the ballot this year for the same reason, though little has come out of the effort in Ohio.",
    "author": "Mica Soellner",
    "title": "Marjorie Taylor Greene tells courtroom that she’s a ‘victim’ of the Jan. 6 riot"
  }
]