[
  {
    "id": 5797,
    "mediaId": 2688,
    "date": "2022-02-10",
    "sentence": "But despite the missing call records, the Jan. 6 committee has reportedly unearthed information on at least one of Trump’s most highly scrutinized calls: A call between him and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Matt Shuham",
    "title": "Report: Jan. 6 Panel Finds Holes In Trump’s Official Call Logs On Day Of Insurrection"
  },
  {
    "id": 5933,
    "mediaId": 2570,
    "date": "2022-02-10",
    "sentence": "Trump reportedly spoke with several members of Congress on January 6, 2021, including Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), Sen. Tommy Tuberville (R-Ala.) and House Minority Leader Kevin McCarthy (R-Calif.), whose call turned into a screaming match as McCarthy demanded that Trump condemn the rioters.",
    "author": "Nicholas Reimann",
    "title": "Jan. 6 Committee Reportedly Finds Sparse White House Records Of Trump Calls On Day Of Riot"
  },
  {
    "id": 5580,
    "mediaId": 2664,
    "date": "2022-02-11",
    "sentence": "\"I mean, I talked to Kevin McCarthy, I have talked to <span class='selected-term'>Jim Jordan</span> and I have talked to other members who were speaking to the president, the former president that day,\" he reported.",
    "author": "Tom Boggioni",
    "title": "Here's why Trump may be headed for a 'criminal referral'"
  },
  {
    "id": 4564,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "The \"Take Back Congress Candidate Forum” will be littered with 10 congressional Trump acolytes like Representative <span class='selected-term'>Jim Jordan</span> of Ohio and 13 hopefuls such as United States Senate candidate Herschel Walker of Georgia.",
    "author": "Brandon Gage",
    "title": "Donald Trump to host ‘Magapalooza’ at Mar-a-Lago on Wednesday"
  },
  {
    "id": 4647,
    "mediaId": 2564,
    "date": "2022-02-23",
    "sentence": "+6\nView gallery\nFormer Trump Interior Secretary Ryan Zinke, running for a House seat in Montana, posted photos of himself at the event as well\n+6\nView gallery\nThis image shared by Zinke shows Liz Cheney challenger Harriet Hageman (left) speaking at an event with Ohio Rep. <span class='selected-term'>Jim Jordan</span> (right)\n+6\nView gallery\nAnother image showed a donor (right) with former acting Attorney General Matthew Whitaker (left)\nAnother photo from the event appears to show a GOP donor alongside former Acting Attorney General Matthew Whitaker.",
    "author": "Elizabeth Elkind",
    "title": "Trump meets Ted Cruz at Mar-a-Lago ahead of C-PAC: Republicans and conservative donors mingle at private Florida private club ahead of ex-President's prime-time Saturday night speech"
  },
  {
    "id": 2436,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Melanie Zanona",
    "title": "Leaning on her Trump ties, Elise Stefanik plots future inside House GOP"
  },
  {
    "id": 1242,
    "mediaId": 2590,
    "date": "2022-04-07",
    "sentence": "He said he spoke to House Minority Leader Kevin McCarthy, Rep. <span class='selected-term'>Jim Jordan</span> and others, but maintained he did not destroy any records or use other phones.",
    "author": "Marita Vlachou",
    "title": "Trump Regrets Not Marching To Capitol On Jan. 6, Blames Pelosi For Violence"
  }
]