[
  {
    "id": 5858,
    "mediaId": 2664,
    "date": "2022-02-06",
    "sentence": "Speaking to the Fox network on Sunday, Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) revealed that the Republican Party campaign strategy for the 2022 midterms will be all about former President Donald Trump.",
    "author": "Sarah K. Burris",
    "title": "Jim Jordan: The GOP's ultimate goal in taking back Congress is to 'frame up' a win for Trump in 2024"
  },
  {
    "id": 5976,
    "mediaId": 2641,
    "date": "2022-02-06",
    "sentence": "Democrats have long claimed to be against gerrymandering, but they have no issue with the partisan redrawing of congressional districts when it suits them, according to Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Eric Mack",
    "title": "Rep. Jordan: Redistricting 'Only Gerrymandering' When GOP Does It"
  },
  {
    "id": 5460,
    "mediaId": 2572,
    "date": "2022-02-06",
    "sentence": "Democrats often cry foul on alleged Republican gerrymandering, but they are silent as they engage in similar conduct on a larger scale, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, said this week on \"Life, Liberty & Levin.\"",
    "author": "",
    "title": "Jim Jordan: Gerrymandering apparently only exists when GOP does it"
  },
  {
    "id": 5646,
    "mediaId": 2621,
    "date": "2022-02-06",
    "sentence": "“In other words, the Democrats are better at being scoundrels than Republicans and Republicans better wake the hell up.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) then said Democrats are frequently hypocritical when it comes to the issue of gerrymandering.",
    "author": "Katherine Huggins",
    "title": "Mark Levin Claims Democrats Are ‘Better at Being Scoundrels’ Than GOP at Gerrymandering: ‘Republicans Better Wake the Hell Up’"
  },
  {
    "id": 5888,
    "mediaId": 2547,
    "date": "2022-02-07",
    "sentence": "",
    "author": "John Amato",
    "title": "Jim Jordan Is An Absurd Hypocrite, Part Infinity"
  }
]