[
  {
    "id": 5878,
    "mediaId": 2746,
    "date": "2022-02-02",
    "sentence": "Among those many guests also set to appear in the four-day event: Reps. Lauren Boebert, Madison Cawthorn, Matt Gaetz, <span class='selected-term'>Jim Jordan</span>, Ronny Jackson, Barry Loudermilk and Roger Williams; Sen. Marsha Blackburn; Florida Gov.",
    "author": "Jennifer Harper",
    "title": "Trump’s advice to CPAC: ‘Let’s have fun’"
  },
  {
    "id": 5791,
    "mediaId": 2522,
    "date": "2022-02-07",
    "sentence": "Microsoft has been previously accused by its competitors, as well as lawmakers including Republican Ohio Rep. <span class='selected-term'>Jim Jordan</span>, who chairs the House Judiciary Committee overseeing antitrust legislation, of influencing members of Congress to target Meta, Google, Apple and Amazon while exempting itself.",
    "author": "BPR Wire",
    "title": "Google accuses Microsoft of ‘carving out’ exception in anti-Big Tech bill targeting app stores"
  },
  {
    "id": 5764,
    "mediaId": 2643,
    "date": "2022-02-09",
    "sentence": "Republicans like Representative <span class='selected-term'>Jim Jordan</span>, Senator Marsha Blackburn and Florida congressional candidate Lavern Spicer reacted on social media to the story, with Blackburn tweeting, \"End government-funded crack pipes.\"",
    "author": "Alexandra Hutzler",
    "title": "White House Says Crack Pipes Never Included in Safe Smoking Kits"
  },
  {
    "id": 4999,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "Marsha Blackburn, Bill Hagerty, James Lankford and Marco Rubio; and Reps. Andy Biggs, Lauren Boebert, Ken Buck, Madison Cawthorn, Byron Donalds, Matt Gaetz, Jody Hice, Ronny Jackson, <span class='selected-term'>Jim Jordan</span>, Billy Long, Barry Loudermilk, Scott Perry and Greg Steube.",
    "author": "Jennifer Harper",
    "title": "Michele Tafoya leaves sports, jumps into politics"
  },
  {
    "id": 5025,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "https://t.co/gGZwcIiczZ\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 13, 2022\nSenator Marsha Blackburn of Tennessee accused Sullivan of a ‘conflict of interest’ in his current efforts trying to de-escalate with Moscow.",
    "author": "Joe Hoft",
    "title": "Republican Leaders Jim Jordan and Marsha Blackburn Raise Concerns with Jake Sullivan as Biden’s National Security Advisor"
  },
  {
    "id": 5002,
    "mediaId": 2643,
    "date": "2022-02-15",
    "sentence": "Congress members such as Blackburn and <span class='selected-term'>Jim Jordan</span> (R-Ohio) both shared social media posts against what Blackburn calls \"government-funded crack pipes.\"",
    "author": "Daniel Villarreal",
    "title": "Biden Admin Commits to No Crack Pipes, Avoids Partial Government Shutdown"
  },
  {
    "id": 4551,
    "mediaId": 2572,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Tyler Olson",
    "title": "Republicans 'concerned' by Durham allegations, McCarthy pledges oversight with potential House majority"
  },
  {
    "id": 1609,
    "mediaId": 2650,
    "date": "2022-04-02",
    "sentence": "The thinking: It will be much easier to blunt the RINO impulse with <span class='selected-term'>Jim Jordan</span> as Speaker and somebody like Marsha Blackburn helming the Senate.",
    "author": "Mark Ellis",
    "title": "Is Conservative Commentary Getting Too Cocky About the Midterms?"
  },
  {
    "id": 1321,
    "mediaId": 2784,
    "date": "2022-04-05",
    "sentence": "The letter is led by James Lankford of Oklahoma and <span class='selected-term'>Jim Jordan</span> of Ohio and signed by Thom Tillis of North Carolina, James Risch of Idaho, Mike Braun of Indiana, Jim Inhofe of Oklahoma, Roger Marshall of Kansas, Josh Hawley of Missouri, Marsha Blackburn of Tennessee, Mike Lee of Utah, John Boozman of Arkansas, Roger Wicker of Mississippi, and Mike Crapo of Idaho.",
    "author": "",
    "title": "Republican Senators Demand Investigation of 5 Fully-Formed Babies Killed in Late Abortions or Infanticides"
  },
  {
    "id": 1250,
    "mediaId": 2745,
    "date": "2022-04-07",
    "sentence": "",
    "author": "",
    "title": "Will Elon Musk bring Trump back to Twitter?"
  },
  {
    "id": 1069,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "She then played clips of Reps. Matt Gaetz (R-FL), <span class='selected-term'>Jim Jordan</span> (R-OH), and Tennessee Republicans.",
    "author": "Bob Brigham",
    "title": "Ted Cruz called out for his 'fake worrying about pretend pedophiles' as GOP becomes the QAnon party"
  }
]