[
  {
    "id": 6724,
    "mediaId": 6621,
    "date": "2022-01-24",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), ranking member of the House Judiciary Committee, has tipped his hand on what he will do if the GOP flips the House after midterms, making Jordan chairman.",
    "author": "",
    "title": "JORDAN’S HIT LIST: GOP Majority Going After Garland, Mayorkas, Fauci"
  },
  {
    "id": 6929,
    "mediaId": 2644,
    "date": "2022-01-28",
    "sentence": "“Racism is an evil that our country has fought against for generations, and we must stand up for the rights of all Americans to receive equal protection under the law,” Reps. <span class='selected-term'>Jim Jordan</span> of Ohio, Dan Bishop of North Carolina, Darrell Issa of California and 13 others wrote in a Friday letter to Attorney General Merrick Garland.",
    "author": "Steven Nelson",
    "title": "Republicans ask DOJ to probe ‘racial discrimination’ against whites in COVID treatment"
  },
  {
    "id": 6150,
    "mediaId": 2744,
    "date": "2022-02-10",
    "sentence": "GOP Rep. <span class='selected-term'>Jim Jordan</span>, who serves as ranking member on the House Judiciary Committee, and 17 fellow Republicans sent a Thursday letter obtained by the Washington Examiner to FBI Director Christopher Wray blasting the bureau for not sufficiently answering months of questions despite significant pressure from congressional Republicans.",
    "author": "Jerry Dunleavy",
    "title": "GOP: FBI ‘refusing to accept accountability’ for enforcing DOJ school boards memo"
  },
  {
    "id": 3327,
    "mediaId": 2744,
    "date": "2022-03-10",
    "sentence": "",
    "author": "Jerry Dunleavy",
    "title": "Garland says Capitol riot investigation is ‘most urgent’ in DOJ’s history"
  },
  {
    "id": 3627,
    "mediaId": 4038,
    "date": "2022-03-10",
    "sentence": "Tillis recalled how Speaker Nancy Pelosi (D-Calif.) blocked House Minority Leader Kevin McCarthy’s (R-Calif.) picks to serve on the panel, Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Jim Banks (R-Ind.).",
    "author": "Bill Sheridan",
    "title": "GOP: A Trump Investigation From Biden Will Result In Political Civil War"
  },
  {
    "id": 3350,
    "mediaId": 2748,
    "date": "2022-03-17",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) slammed Rep. Jerry Nadler (D-NY) over his handling of an investigation into the National School Boards Association (NSBA) letter asking the Biden administration to investigate parents as “domestic terrorists,” as Democrats try to “pass this bill which is going to codify the whole plot.”\nThe House Judiciary Committee is considering H.R.",
    "author": "Blarp Blog",
    "title": "Watch: Jim Jordan Slams Jerry Nadler as Democrats Try to ‘Codify’ School Board Domestic Terrorist ‘Scheme’ into Law"
  },
  {
    "id": 3406,
    "mediaId": 2614,
    "date": "2022-03-17",
    "sentence": "WASHINGTON, DC – Rep. <span class='selected-term'>Jim Jordan</span> went on a tirade on the House floor earlier in March while calling out a bill that he said would “codify” the Biden administration’s past efforts to label parents attending school board meetings as being potential domestic terrorists.",
    "author": "Red Voice Media",
    "title": "Jim Jordan Calls Out Dems Trying To “Codify” Past Efforts To Label Parents Domestic Terrorists [VIDEO]"
  },
  {
    "id": 2545,
    "mediaId": 2641,
    "date": "2022-03-23",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, says FBI Director Christopher Wray needs to explain why an internal audit of the FBI has found violations of its own policies when conducting surveillance investigations, The Washington Examiner reported.",
    "author": "Peter Malbin",
    "title": "Rep. Jim Jordan: 'Pattern of Misconduct and Mismanagement Within the FBI'"
  },
  {
    "id": 2312,
    "mediaId": 2748,
    "date": "2022-03-29",
    "sentence": "“The Judiciary Committee will have oversight in the next session of Congress.”\nBiggs and fellow Republican Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Mike Johnson of Louisiana have written a letter to FBI Director Christopher Wray for an unredacted copy of the audit.",
    "author": "STATION GOSSIP",
    "title": "FBI Made Mistakes Across Hundreds of Cases, But Here's What's Happening Now That Republicans Have Found Out"
  },
  {
    "id": 2659,
    "mediaId": 2689,
    "date": "2022-03-29",
    "sentence": "“The Judiciary Committee will have oversight in the next session of Congress.”\nBiggs and fellow Republican Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Mike Johnson of Louisiana have written a letter to FBI Director Christopher Wray for an unredacted copy of the audit.",
    "author": "",
    "title": "FBI Made Mistakes Across Hundreds Of Cases, But Here’s What Republicans Have Found Out…"
  },
  {
    "id": 1892,
    "mediaId": 2641,
    "date": "2022-03-29",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Tuesday that what the public can divine from Hunter Biden's laptop will depend on Attorney General Merrick Garland, who was nominated by President Joe Biden.",
    "author": "Nick Koutsobinas",
    "title": "Rep. Jordan to Newsmax: We'll Have to Wait for DOJ Regarding Hunter's Laptop"
  },
  {
    "id": 1757,
    "mediaId": 2688,
    "date": "2022-03-31",
    "sentence": "Strzok imagined a Republican-controlled Congress with committees led by figures like Reps. <span class='selected-term'>Jim Jordan</span> (R-OH) and Marjorie Taylor Greene (R-GA), “whose entire existence is devoted to gumming up any DOJ and FBI investigation.”\n“I don’t think anybody can predict what they might do,” he said.",
    "author": "Matt Shuham",
    "title": "Is The Justice Department Finally Going After The Insurrection’s Big Fish?"
  },
  {
    "id": 1422,
    "mediaId": 2730,
    "date": "2022-04-02",
    "sentence": "Source: Michael Reynolds/Pool via AP\nDuring debate on the House Floor Friday regarding legislation to decriminalize possession of marijuana at the federal level, Ohio GOP Rep. <span class='selected-term'>Jim Jordan</span> attempted to compare marijuana legalization to the Federal Bureau of Investigations' actions against parents protesting at school board meetings.",
    "author": "Landon Mion",
    "title": "Jordan Says Marijuana Shouldn't Be Legalized Because the FBI Is Monitoring Parents at School Board Meetings"
  },
  {
    "id": 982,
    "mediaId": 2745,
    "date": "2022-04-07",
    "sentence": "Trump said that he remembered talking to House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and other people during that period.",
    "author": "",
    "title": "Opinion: Trump’s new admission about Jan. 6 should boost pressure on Garland"
  },
  {
    "id": 1571,
    "mediaId": 2634,
    "date": "2022-04-08",
    "sentence": "Other Trump allies, like Congressmen <span class='selected-term'>Jim Jordan</span> and Scott Perry, have refused the committee’s invitation to sit down for interviews.",
    "author": "Daniel Strauss",
    "title": "January 6 Recap: Exactly What Did Ivanka Trump Talk About for Eight Long Hours?"
  },
  {
    "id": 560,
    "mediaId": 6687,
    "date": "2022-04-15",
    "sentence": "“Well, that didn’t happen, so now the United States can look into it when the Republicans take over and have a special counsel to get to the bottom of it.”\nThe candidate was joined by U.S. Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) during the interview, who endorsed Wardynski earlier this week.",
    "author": "Yaffee",
    "title": "AL-5 candidate Casey Wardynski: We need a ‘special counsel to get to the bottom of’ Hunter Biden’s emails"
  },
  {
    "id": 317,
    "mediaId": 2727,
    "date": "2022-04-17",
    "sentence": "Today’s GOP is dominated by extremists like the Freedom Caucus and crazies like Marjorie Taylor Greene, Matt Gaetz, Paul Gosar, Madison Cawthorn, Lauren Boebert and <span class='selected-term'>Jim Jordan</span>.",
    "author": "",
    "title": "Lilliput on the Potomac"
  },
  {
    "id": 551,
    "mediaId": 2934,
    "date": "2022-04-22",
    "sentence": "However, there was no justification for some of the language included in the letter.”\nThe letter noted that the “voices of parents … should and must continue to be heard when it comes to decisions about their children’s education, health, and safety.”\nThe following month, Republican Rep. <span class='selected-term'>Jim Jordan</span> sent a letter to Garland saying that information from a Justice Department whistleblower called into question the accuracy of Garland’s testimony that “the Department of Justice and Federal Bureau of Investigation were not using federal counterterrorism tools to target concerned parents at local school board meetings.”\nJordan said a “protected disclosure” from the whistleblower showed “that the FBI’s Counterterrorism Division is compiling and categorizing threat assessments related to parents, including a document directing FBI personnel to use a specific ‘threat tag’ to track potential investigations.”\nSpecifically, Jordan cited an FBI email that said in response to Garland’s Oct. 4 memo, “the Counterterrorism and Criminal Divisions created a threat tag, EDUOFFICIALS, to track instances of related threats.” It directed FBI offices to apply that threat tag to “investigations and assessments of threats specifically directed against school board administrators, board members, teachers, and staff.”\nAccording to Jordan, “This disclosure provides specific evidence that federal law enforcement operationalized counterterrorism tools at the behest of a left-wing special interest group against concerned parents.”\nBut the email does not say that the FBI ought to apply tags to parents merely speaking out at school board meetings.",
    "author": "Robert Farley",
    "title": "Attorney General Never Called Concerned Parents ‘Domestic Terrorists’"
  }
]