[
  {
    "id": 6849,
    "mediaId": 2690,
    "date": "2022-01-10",
    "sentence": "pic.twitter.com/6zVW0lE0Ni\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 3, 2022\nIn the meantime, those who support Donald Trump and refuse to comply with the requests being made by Pelosi and her committee end up getting indicted and held in contempt of Congress.",
    "author": "",
    "title": "BREAKING: Mike Lindell Files Lawsuit Against Nancy Pelosi"
  },
  {
    "id": 6815,
    "mediaId": 2724,
    "date": "2022-01-13",
    "sentence": "On Sunday, Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) also announced that he would not be cooperating with the committee.",
    "author": "Becky Noble",
    "title": "GOP Leader McCarthy Tells Jan 6 Committee He Will Not Cooperate"
  },
  {
    "id": 6852,
    "mediaId": 2605,
    "date": "2022-01-19",
    "sentence": "“And my guess is those who support it will regret it when people like [Ohio] Congressman <span class='selected-term'>Jim Jordan</span> get the gavel and then decide to use that same authority on them.”\nFor McCarthy, there’s little political incentive to appear before the committee.",
    "author": "Arit John",
    "title": "Will Jan. 6 committee subpoena McCarthy? Congress could set up a political and legal showdown"
  },
  {
    "id": 6775,
    "mediaId": 2690,
    "date": "2022-01-20",
    "sentence": "pic.twitter.com/6zVW0lE0Ni\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 3, 2022\nREPORTER: \"Should members of congress and their spouses be banned from trading individual stocks while serving in congress?\"",
    "author": "",
    "title": "SHOWDOWN: Ex-Navy SEALs Running For Congress Unite To Take Down ‘Grave Threat’ Nancy Pelosi"
  },
  {
    "id": 6721,
    "mediaId": 2690,
    "date": "2022-01-24",
    "sentence": "pic.twitter.com/6zVW0lE0Ni\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 3, 2022\nMeanwhile, Trump supporters who refuse to comply with the requests of Pelosi’s little committee get indicted and held in contempt of court.",
    "author": "",
    "title": "BOOM: House Republicans Turn The Jan. 6 Tables On Nancy Pelosi… Issue Major Accusation"
  },
  {
    "id": 7090,
    "mediaId": 2600,
    "date": "2022-01-24",
    "sentence": "Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span> says the Democrats committee investigating the incident at the U.S. Capitol last January is a “complete assault on Americans’ liberty.”\nJordan said the Dem-led investigation is a “political operation” designed to stop Donald Trump from running for the White House again.",
    "author": "IWB",
    "title": "Jordan Demands Investigation Into Nancy Pelosi After Disturbing Revelation"
  },
  {
    "id": 7031,
    "mediaId": 4091,
    "date": "2022-01-24",
    "sentence": "I will help reinforce.”\nAlso, Hannity said he believed it was “key” to keep Trump away from certain people, texting: “No more crazy people,” leading McEnany to respond: “Yes, 100%.”\nHannity also wrote in a text to Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and then-White House Chief of Staff Mark Meadows:\nGuys, we have a clear path to land the plane in 9 days.",
    "author": "JD Heyes",
    "title": "More leaked texts from the Jan. 6 Committee show messaging coordination between Hannity, McEnany"
  },
  {
    "id": 6904,
    "mediaId": 2636,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Alan Feuer",
    "title": "Stewart Rhodes, Oath Keepers Leader, Is Denied Bail on Sedition Charge"
  },
  {
    "id": 6843,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "House Minority Leader Rep. Kevin McCarthy submitted his choices — and she rejected two of them, Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "STATION GOSSIP",
    "title": "New Virginia AG Makes Huge Move, Fires Woke University Lawyers, Including One Working on Jan. 6 Commission"
  },
  {
    "id": 6800,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Second, in July, House Minority Leader Kevin McCarthy decided to pull all Republican members he had nominated for the House committee investigating January 6, following House Speaker Nancy Pelosi's rejection of the presence of GOP Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana on the panel.",
    "author": "Chris Cillizza",
    "title": "The massive miscalculation Republicans made on the 1/6 committee"
  },
  {
    "id": 5518,
    "mediaId": 2643,
    "date": "2022-02-03",
    "sentence": "Furthermore, other names—such as staunchly pro-Trump GOP Representative <span class='selected-term'>Jim Jordan</span> of Ohio—have been floated for the top post in the legislative body.",
    "author": "Jason Lemon",
    "title": "Trump, Kevin McCarthy Have Equal Support to Be Next House Speaker: Poll"
  },
  {
    "id": 5737,
    "mediaId": 2594,
    "date": "2022-02-04",
    "sentence": "House Minority Leader Kevin McCarthy initially announced a slate of Republicans that included allies of Mr Trump like Reps Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Eric Garcia",
    "title": "RNC votes to censure Liz Cheney and Adam Kinzinger over January 6 committee investigation"
  },
  {
    "id": 5646,
    "mediaId": 2621,
    "date": "2022-02-06",
    "sentence": "“In other words, the Democrats are better at being scoundrels than Republicans and Republicans better wake the hell up.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) then said Democrats are frequently hypocritical when it comes to the issue of gerrymandering.",
    "author": "Katherine Huggins",
    "title": "Mark Levin Claims Democrats Are ‘Better at Being Scoundrels’ Than GOP at Gerrymandering: ‘Republicans Better Wake the Hell Up’"
  },
  {
    "id": 5754,
    "mediaId": 2658,
    "date": "2022-02-07",
    "sentence": "“I’m not aware of what his intention is.”\nRep. Rodney Davis (R-Ill.), the party’s top member on the committee with jurisdiction over Capitol security, said: “Look, it’s gonna depend upon what Leader McCarthy wants.” Davis was one of McCarthy’s picks to sit on the select committee before he decided to boycott the panel over Pelosi’s refusal to seat two other Republican selections — Banks and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio).",
    "author": "",
    "title": "The GOP’s Jan. 6 committee dilemma: Disband it, or turn it on Dems?"
  },
  {
    "id": 5898,
    "mediaId": 2522,
    "date": "2022-02-08",
    "sentence": "He was an original member of the Jan. 6 select committee, but Republicans decided not to participate after Pelosi refused to seat Reps. <span class='selected-term'>Jim Jordan</span> and Jim Banks.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Fuming GOP rep accuses Capitol Police of ‘illegally’ investigating his office, says staffer ‘caught them in the act’"
  },
  {
    "id": 5942,
    "mediaId": 2564,
    "date": "2022-02-08",
    "sentence": "His nomination was withdrawn in protest by McCarthy after House Speaker Nancy Pelosi objected to Donald Trump allies Reps. <span class='selected-term'>Jim Jordan</span> and Jim Banks being on the panel.",
    "author": "Elizabeth Elkind",
    "title": "Republican Rep. Troy Nehls claims Capitol Police disguised as construction workers snuck into his office to take photos of his files after he was picked for the GOP panel to investigate January 6 'security failures'"
  },
  {
    "id": 6148,
    "mediaId": 2699,
    "date": "2022-02-08",
    "sentence": "In July, House Majority Leader Kevin McCarthy nominated Nehls to the Jan. 6 committee, along with Reps. <span class='selected-term'>Jim Jordan</span> (R-OH), Rodney Davis (R-IL), Kelly Armstrong (R-ND), and Jim Banks (R-IN).",
    "author": "Roger Sollenberger",
    "title": "GOP Rep. Claims Capitol Police Secretly Broke Into His Office"
  },
  {
    "id": 5542,
    "mediaId": 2641,
    "date": "2022-02-09",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax that House Speaker Nancy Pelosi, D-Calif., was wrong to tell athletes at the 2022 Beijing Winter Olympics not to protest.",
    "author": "Nick Koutsobinas",
    "title": "Rep. Jim Jordan to Newsmax: Pelosi Wrong to Tell Olympians Not to Speak Out"
  },
  {
    "id": 5511,
    "mediaId": 2550,
    "date": "2022-02-10",
    "sentence": "The members include longtime allies to former President Donald Trump Reps. <span class='selected-term'>Jim Jordan</span> of Ohio, Jim Banks of Indiana, Rodney Davis of Illinois, Kelly Armstrong of North Dakota, and Troy Nehls of Texas.",
    "author": "",
    "title": "A Jan. 6 shadow committee sets its sights on U.S. Capitol Police"
  },
  {
    "id": 4620,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "Pelosi did not object to Nehls, but McCarthy pulled all of his nominees when Pelosi rejected Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Jim Banks, R-Ind., because they had worked to defend Trump on the House Judiciary Committee during House Democrat-led impeachment inquiries.",
    "author": "Eric Mack",
    "title": "Trump Endorses Texas GOP Reps. Nehls, Gooden, Weber"
  },
  {
    "id": 4695,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Mark Sumner",
    "title": "The Republican platform for 2022"
  },
  {
    "id": 5062,
    "mediaId": 2512,
    "date": "2022-02-16",
    "sentence": "That concern was shared by an unidentified member of the House Freedom Caucus, who wrote to Meadows on January 2nd that “if POTUS allows this to occur… we’re driving a stake in the heart of the federal republic.”\nThree days later, former Defense Department Inspector General Joseph Schmitz wrote to election objector Congressman <span class='selected-term'>Jim Jordan</span> (R-Ohio) that “on January 6, 2021, Vice President Mike Pence, as President of the Senate, should call out all electoral votes that he believes are unconstitutional as no electoral votes at all -- in accordance with guidance from founding father Alexander Hamilton and judicial precedence.",
    "author": "Brandon Gage",
    "title": "Text messages showcase the chaos and desperation inside Trumpworld on January 6th"
  },
  {
    "id": 4973,
    "mediaId": 2553,
    "date": "2022-02-17",
    "sentence": "Make America Great Again!”\nWhen Pelosi launched her January 6 committee, McCarthy recommended that Rep. Jim Banks (R-IN) and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) serve as Republican members.",
    "author": "Ben Zeisloft",
    "title": "McCarthy Endorses Cheney’s Republican Challenger"
  },
  {
    "id": 4607,
    "mediaId": 2550,
    "date": "2022-02-18",
    "sentence": "But his nomination was also accompanied by McCarthy’s picks, Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana.",
    "author": "",
    "title": "U.S. Capitol Police watchdog: Long way to go on security improvements"
  },
  {
    "id": 5040,
    "mediaId": 2664,
    "date": "2022-02-21",
    "sentence": "“Now, we witness Ohio Republican U.S. Rep. <span class='selected-term'>Jim Jordan</span> and Mark Meadows, the former chief of staff for ex-President Donald Trump, along with Trump political strategist Steve Bannon, attorney Rudy Giuliani, and others all too cowardly to testify before the Select House Committee investigating the insurrection of Jan. 6, 2021.”\nKorobij goes on to describe January 6 as a “date that will live in infamy,” using the words that President Franklin Delano Roosevelt used to describe the December 7, 1941 attack on the U.S.",
    "author": "Alex Henderson",
    "title": "'Cowardly' Jim Jordan accused of putting party above country in scathing letter to the editor"
  },
  {
    "id": 5106,
    "mediaId": 2512,
    "date": "2022-02-21",
    "sentence": "“Now, we witness Ohio Republican U.S. Rep. <span class='selected-term'>Jim Jordan</span> and Mark Meadows, the former chief of staff for ex-President Donald Trump, along with Trump political strategist Steve Bannon, attorney Rudy Giuliani, and others all too cowardly to testify before the Select House Committee investigating the insurrection of Jan. 6, 2021.”\nKorobij goes on to described January 6 as a “date that will live in infamy,” using the words that President Franklin Delano Roosevelt used to describe the December 7, 1941 attack on the U.S.",
    "author": "Alex Henderson",
    "title": "Ohio reader slams ‘cowardly’ Jim Jordan for putting party above country"
  },
  {
    "id": 5113,
    "mediaId": 2543,
    "date": "2022-02-22",
    "sentence": "You also have Reps. Lauren Boebert and Ken Buck of Colorado, Madison Cawthorn of North Carolina, Ronny Jackson of Texas and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "C. Douglas Golden",
    "title": "Not Satire: 'RINO Convention' Days Away - Guest List is a Who's Who of Rabid Trump-Haters"
  },
  {
    "id": 4669,
    "mediaId": 2593,
    "date": "2022-02-22",
    "sentence": "You also have Reps. Lauren Boebert and Ken Buck of Colorado, Madison Cawthorn of North Carolina, Ronny Jackson of Texas and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "",
    "title": "Not Satire: 'RINO Convention' Days Away – Cheney, Kinzinger Set to Be Keynote Speakers"
  },
  {
    "id": 5035,
    "mediaId": 2584,
    "date": "2022-02-23",
    "sentence": "She had the right to review his nominations, and she rejected Republican representative <span class='selected-term'>Jim Jordan</span>, who has now been implicated in the events of the day, and Republican representative Jim Banks, who had attacked the committee as a partisan exercise “solely to malign conservatives and to justify the left’s authoritarian agenda”.",
    "author": "Heather Cox Richardson",
    "title": "Trump claims investigations into him are politically motivated. That is a lie"
  },
  {
    "id": 4818,
    "mediaId": 2748,
    "date": "2022-02-23",
    "sentence": "You also have Reps. Lauren Boebert and Ken Buck of Colorado, Madison Cawthorn of North Carolina, Ronny Jackson of Texas and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "STATION GOSSIP",
    "title": "Not Satire: 'RINO Convention' Days Away - Guest List is a Who's Who of Rabid Trump-Haters"
  },
  {
    "id": 4489,
    "mediaId": 2528,
    "date": "2022-02-27",
    "sentence": "The California Republican dropped out of the running for speaker in 2015 amid opposition from the ultra-conservative House Freedom Caucus, which Rep. <span class='selected-term'>Jim Jordan</span> of Ohio led at the time.",
    "author": "Warren Rojas",
    "title": "CPAC candidates want to weigh their options for House speaker if elected. Colleagues say Kevin McCarthy's still in good shape."
  },
  {
    "id": 3859,
    "mediaId": 2748,
    "date": "2022-03-01",
    "sentence": "On July 21, 2020, Pelosi blocked two of McCarthy's choices, <span class='selected-term'>Jim Jordan</span> and Jim Banks, each of whom supported Trump's decision to contest the election, which they had every legal right to do.",
    "author": "Allan H. Ryskind",
    "title": "Ryskind: Liz Cheney's Unjust War Against Trump, His Jan. 6 Advisers, and the GOP"
  },
  {
    "id": 4467,
    "mediaId": 2600,
    "date": "2022-03-02",
    "sentence": "Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span> says the Democrats committee investigating the incident at the U.S. Capitol last January is a “political operation” aimed at stopping Donald Trump from running for president in 2024.",
    "author": "IWB",
    "title": "Jim Jordan Calls for Investigation Into Nancy Pelosi"
  },
  {
    "id": 3049,
    "mediaId": 2664,
    "date": "2022-03-08",
    "sentence": "With Melanie Zanona's report pointing out that bombastic Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) is slated to take over the powerful House Judiciary Committee's chairmanship, the report adds that some Republicans are not pleased with the direction the party is going.",
    "author": "Tom Boggioni",
    "title": "GOP lawmaker rips into extremist 'wacky conference' and predicts worse antics to come"
  },
  {
    "id": 2804,
    "mediaId": 2594,
    "date": "2022-03-09",
    "sentence": "But then House Speaker Nancy Pelosi vetoed the membership of Reps Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Eric Garcia",
    "title": "Republican National Committee sues the January 6 Committee for ‘unlawfully seizing information’"
  },
  {
    "id": 3627,
    "mediaId": 4038,
    "date": "2022-03-10",
    "sentence": "Tillis recalled how Speaker Nancy Pelosi (D-Calif.) blocked House Minority Leader Kevin McCarthy’s (R-Calif.) picks to serve on the panel, Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Jim Banks (R-Ind.).",
    "author": "Bill Sheridan",
    "title": "GOP: A Trump Investigation From Biden Will Result In Political Civil War"
  },
  {
    "id": 3573,
    "mediaId": 2701,
    "date": "2022-03-10",
    "sentence": "According to a letter sent on Wednesday from Rep. <span class='selected-term'>Jim Jordan</span>, ranking member of the House Judiciary Committee, to FBI Director Christopher Wray, the FBI agent filed a whistleblower disclosure about the pipe bomb investigation — an investigation the Associated Press had characterized as “one of the highest-priority investigations for the FBI and the Justice Department.” The agent alleged that on Feb. 7, 2022, more than a year after the bombs were planted, the bureau’s Washington Field Office asked its other field offices “to canvass all confidential human sources nationwide for information about the individual and the crime.”\nThe canvass should “include sources reporting on all [types of] threats,” the message from Washington to the other FBI field offices requested, because the bomber’s “motive and ideology remain unknown.”\n“The special agent explained that the [Washington Field Office] request was ‘unusual’ because it was transmitted more than a year after the FBI had begun the investigation, and it raises questions about the progress and extent of the FBI’s investigation,” Jordan’s letter said.",
    "author": "Kylee Zempel",
    "title": "Whistleblower: FBI Is Just Now Asking Basic Questions About Jan. 6 Pipe Bombs — A Year Into Its Investigation"
  },
  {
    "id": 3326,
    "mediaId": 2866,
    "date": "2022-03-11",
    "sentence": "Pelosi and the committee are weaponizing and abusing Congress’ investigatory power.”\nWe here have long maintained that Pelosi’s committee is illegitimate, having rejected two Republicans that McCarthy appointed to the Committee – Reps. <span class='selected-term'>Jim Jordan</span> (R-OH) and Jim Banks (R-IN) – an abuse of power for purely political reasons.",
    "author": "Bill Sheridan",
    "title": "RNC Sues Nancy Pelosi and Jan. 6 Committee for Overreach!"
  },
  {
    "id": 2884,
    "mediaId": 2550,
    "date": "2022-03-16",
    "sentence": "Related: Who’s who: A rolling guide to the targets of the Jan. 6 committee\nAccording to ABC, GOP House Leader Kevin McCarthy and Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania have had “no follow-up discussions” about their cooperation since receiving their respective subpoenas.",
    "author": "",
    "title": "Maybe there won't be subpoenas for GOP lawmakers from Jan. 6 probe but that doesn't spell doom"
  },
  {
    "id": 2463,
    "mediaId": 2589,
    "date": "2022-03-23",
    "sentence": "I’ll bet every populist in the House GOP caucus, from <span class='selected-term'>Jim Jordan</span> to Paul Gosar to Matt Gaetz to Marjorie Taylor Greene and on down, has had to field the same request from Trump at one point or another.",
    "author": "Allahpundit",
    "title": "Mo Brooks turns on Trump: He pushed me to \"rescind\" the 2020 results, remove Biden, and reinstate him as president"
  },
  {
    "id": 2410,
    "mediaId": 2744,
    "date": "2022-03-23",
    "sentence": "Republican Rep. Jim Banks, who along with Rep. <span class='selected-term'>Jim Jordan</span> had been selected by GOP Majority Leader Kevin McCarthy to serve on the Capitol riot committee only to be rejected by Democratic House Speaker Nancy Pelosi, critiqued Buckley’s leadership position.",
    "author": "Jerry Dunleavy",
    "title": "Democratic staffer on Jan. 6 committee was part of intel effort to help Biden out of Hunter jam"
  },
  {
    "id": 2458,
    "mediaId": 2748,
    "date": "2022-03-24",
    "sentence": "She added that Republicans plan to fire “lame duck” House Speaker Nancy Pelosi (D-NY) “once and for all.”\nThe Task Force Leaders of each topic are as follows:\nJobs and the Economy: Rep. Patrick McHenry (R-NC)\nBig Tech Censorship and Data: Rep. Cathy Rodgers (WA)\nFuture of American Freedoms: Rep. <span class='selected-term'>Jim Jordan</span> (R-OH)\nEnergy, Climate and Conservation: Rep. Garret Graves (R-LA)\nAmerican Security: Rep. John Katko (R-NY)\nHealthy Futures: Rep. Brett Guthrie (R-KY) and Rep. Vern Buchanan (R-FL)\nChina Accountability: Rep. Michael McCaul (R-TX)\nDuring the press conference, each Republican member provided a brief preview of the agenda items of their task force .",
    "author": "Blarp Blog",
    "title": "House Republican Leadership Announces Taskforce Leaders to Fix Biden’s Failures"
  },
  {
    "id": 1929,
    "mediaId": 2526,
    "date": "2022-03-24",
    "sentence": "According to Punchbowl News, Sen. Rand Paul (R-KY), Reps. <span class='selected-term'>Jim Jordan</span> (R-OH), Jim Banks (R-ID), Elise Stefanik (R-NY), South Dakota Gov.",
    "author": "Wendell Husebø",
    "title": "Kevin McCarthy to Host Huge Fundraiser for Liz Cheney’s Opponent, Harriet Hageman"
  },
  {
    "id": 2270,
    "mediaId": 2877,
    "date": "2022-03-25",
    "sentence": "You know — the committee that kicked Republican Congressmen <span class='selected-term'>Jim Jordan</span> and Jim Banks off of it because, as Pelosi put it, “With respect for the integrity of the investigation, with an insistence on the truth and with concern about statements made and actions taken by these Members, I must reject the recommendations of Representatives Banks and Jordan to the Select Committee.”\nYeah, because nothing says “integrity” and “truth” like a committee stacked with partisan hacks and liars.",
    "author": "",
    "title": "Top J6 Staffer Is a Russian Disinformationer"
  },
  {
    "id": 2711,
    "mediaId": 2753,
    "date": "2022-03-25",
    "sentence": "Future of American Freedoms\nThe Biden administration has put American freedoms in jeopardy, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, said.",
    "author": "WND News Services",
    "title": "GOP lawmakers cite 7 ways the left has failed Americans"
  },
  {
    "id": 2681,
    "mediaId": 2646,
    "date": "2022-03-28",
    "sentence": "There’s at least one Republican who has spoken up in support: none other than the jacketless GOP Congressman <span class='selected-term'>Jim Jordan</span> (R-OH), who in his not-so-eloquently way of speaking has said “I haven’t seen it, but Fortenberry sounds like he got set up.”\nWell, there you have it.",
    "author": "Ty Ross",
    "title": "FOREIGN INFLUENCE: Convicted GOP Nebraska congressman’s donor tied to terrorist group"
  },
  {
    "id": 2159,
    "mediaId": 2526,
    "date": "2022-03-29",
    "sentence": "Monday on FNC’s “Fox News @ Night,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) argued House Speaker Nancy Pelosi’s (D-CA) purpose for the January 6 Select Committee was not to investigate the January 6 riot on Capitol Hill but to keep former President Donald Trump out of the 2024 presidential election.",
    "author": "Jeff Poor",
    "title": "Jim Jordan: January 6 Investigation ‘Designed’ to Keep Trump off the 2024 Ballot — ‘I Think He’s Going to’ Run, Win"
  },
  {
    "id": 1701,
    "mediaId": 2522,
    "date": "2022-04-01",
    "sentence": "The bill was vigorously opposed by some Republicans such as Representative <span class='selected-term'>Jim Jordan</span> (R-OH), who took to the podium to rail against what he argued is a seriously skewed sense of priorities.",
    "author": "Joshua Nybo",
    "title": "‘Wow. Wow!’ Jim Jordan goes OFF on cowardly Dem priorities as House votes to decriminalize marijuana"
  },
  {
    "id": 1054,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> speculated last week.",
    "author": "Wendell Husebø",
    "title": "Poll: 76 Percent Disapprove of Democrat-Controlled Congress"
  },
  {
    "id": 1365,
    "mediaId": 2576,
    "date": "2022-04-03",
    "sentence": "When House Speaker Nancy Pelosi rejected two of the five — Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Jim Banks (R-Ohio) — McCarthy decreed that his caucus would boycott the Jan. 6 committee altogether.",
    "author": "Detroit Free Press Editorial Board",
    "title": "Editorial: Will we ever learn what happened on Jan. 6?"
  },
  {
    "id": 1423,
    "mediaId": 2672,
    "date": "2022-04-07",
    "sentence": "The former president, who may have violated the Presidential Records Act, claims he didn’t destroy any call logs or speak on “burner phones.” But he said he did remember talking to House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), and others during that time.",
    "author": "William Vaillancourt",
    "title": "Trump Says He Wanted to March to Capitol on Jan. 6, Blames Everyone But Himself for Carnage"
  },
  {
    "id": 1187,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "Trump said he remembered talking to House Minority Leader Kevin McCarthy, R-Calif., and Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and others.",
    "author": "Jeffrey Rodack",
    "title": "Trump: I Wanted to March to the Capitol on Jan. 6"
  },
  {
    "id": 1242,
    "mediaId": 2590,
    "date": "2022-04-07",
    "sentence": "He said he spoke to House Minority Leader Kevin McCarthy, Rep. <span class='selected-term'>Jim Jordan</span> and others, but maintained he did not destroy any records or use other phones.",
    "author": "Marita Vlachou",
    "title": "Trump Regrets Not Marching To Capitol On Jan. 6, Blames Pelosi For Violence"
  },
  {
    "id": 1291,
    "mediaId": 2685,
    "date": "2022-04-07",
    "sentence": "Trump said that he remembered talking to House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and other people during that period.",
    "author": "Josh Dawsey Washington Post",
    "title": "Trump deflects blame for Jan. 6 silence, says he wanted to march to Capitol"
  },
  {
    "id": 1627,
    "mediaId": 2713,
    "date": "2022-04-07",
    "sentence": "Trump said that he remembered talking to House Minority Leader Kevin McCarthy, Republican <span class='selected-term'>Jim Jordan</span> and other people during that period.",
    "author": "Josh Dawsey",
    "title": "Trump deflects blame for January 6 silence, says he wanted to march to Capitol"
  },
  {
    "id": 1568,
    "mediaId": 2701,
    "date": "2022-04-07",
    "sentence": "Instead, Republican Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio have led their own investigation into the Capitol security failures after Pelosi replaced them with Wyoming Rep. Liz Cheney and Illinois’s Adam Kinzinger.",
    "author": "Tristan Justice",
    "title": "House Votes To Seek Jail Time For Former Trump Officials Held In Contempt"
  },
  {
    "id": 1407,
    "mediaId": 2646,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Ty Ross",
    "title": "POSITIVE: House Speaker Nancy Pelosi gets breakthrough COVID infection"
  },
  {
    "id": 1805,
    "mediaId": 2696,
    "date": "2022-04-08",
    "sentence": "Trump said that he remembered talking to House Minority Leader Kevin McCarthy, R-Calif., Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and other people during that period.",
    "author": "David Epstein",
    "title": "Trump deflects blame for Jan. 6 silence, says he wanted to march to Capitol"
  },
  {
    "id": 1372,
    "mediaId": 2518,
    "date": "2022-04-08",
    "sentence": "Trump said he remembered talking to House Minority Leader Kevin McCarthy, R-Calif., Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and other people during that period.",
    "author": "",
    "title": "Why didn’t Pelosi stop Capitol riot? Trump asks"
  },
  {
    "id": 1571,
    "mediaId": 2634,
    "date": "2022-04-08",
    "sentence": "Other Trump allies, like Congressmen <span class='selected-term'>Jim Jordan</span> and Scott Perry, have refused the committee’s invitation to sit down for interviews.",
    "author": "Daniel Strauss",
    "title": "January 6 Recap: Exactly What Did Ivanka Trump Talk About for Eight Long Hours?"
  },
  {
    "id": 907,
    "mediaId": 2630,
    "date": "2022-04-10",
    "sentence": "She rejected two of McCarthy’s five picks for the panel — GOP Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana — saying they had made statements that could jeopardize the “integrity of the election.”\nPelosi told McCarthy she would seat the three other Republicans — Rodney Davis of Illinois, Kelly Armstrong of North Dakota and Troy Nehls of Texas — and suggested that he pick two others.",
    "author": "Scott Wong",
    "title": "McCarthy's Jan. 6 committee gamble faces big test this spring"
  },
  {
    "id": 188,
    "mediaId": 2664,
    "date": "2022-04-10",
    "sentence": "The aide continued, \"One of the reasons Democrats’ impeachment hearings failed so spectacularly in 2019 was because you had [GOP Reps.] Elise Stefanik and <span class='selected-term'>Jim Jordan</span> and Doug Collins and Mike Turner — all of them running interference because they were sitting on the panels.",
    "author": "Tom Boggioni",
    "title": "Kevin McCarthy's 'strategic mistake' on the Jan 6th committee is about to blow up in his face: report"
  },
  {
    "id": 702,
    "mediaId": 2512,
    "date": "2022-04-10",
    "sentence": "The aide continued, \"One of the reasons Democrats’ impeachment hearings failed so spectacularly in 2019 was because you had [GOP Reps.] Elise Stefanik and <span class='selected-term'>Jim Jordan</span> and Doug Collins and Mike Turner — all of them running interference because they were sitting on the panels.",
    "author": "Tom Boggioni",
    "title": "Kevin McCarthy's 'strategic mistake' on the Jan 6th committee is about to blow up in his face: report"
  },
  {
    "id": 735,
    "mediaId": 2643,
    "date": "2022-04-10",
    "sentence": "In July, Pelosi objected to two of McCarthy's appointments to the panel—Representatives <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana.",
    "author": "Xander Landen",
    "title": "Raskin Says 1/6 Committee 'Able to Get Work Done' Thanks to McCarthy Gamble"
  },
  {
    "id": 124,
    "mediaId": 2664,
    "date": "2022-04-11",
    "sentence": "The panel hasn't decided what to do with three Republican lawmakers -- House minority leader Kevin McCarthy and Reps. Scott Perry and <span class='selected-term'>Jim Jordan</span> -- who have refused to voluntarily testify, although committee chairman Bennie Thompson said they would not likely face subpoenas.",
    "author": "Travis Gettys",
    "title": "Jan. 6 panel faces major choices about Trump as investigation enters final phase"
  },
  {
    "id": 743,
    "mediaId": 2656,
    "date": "2022-04-16",
    "sentence": "The House Jan. 6 witch hunt committee admitted that Schiff altered a text message from Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) to former Trump chief of staff Mark Meadows, making it appear much more damning than it actually was.",
    "author": "Robert Spencer",
    "title": "You’ll Never Guess Who Wants to Be Speaker of the House Now"
  },
  {
    "id": 404,
    "mediaId": 2685,
    "date": "2022-04-22",
    "sentence": "On those calls, according to Hutchinson, were representatives from Trump's legal team, including Rudy Giuliani, Jenna Ellis and Sidney Powell, as well as Reps. <span class='selected-term'>Jim Jordan</span> and Scott Perry.",
    "author": "FARNOUSH AMIRI and ERIC TUCKER Associated Press",
    "title": "Official: Meadows had been warned of possible 1/6 violence"
  },
  {
    "id": 369,
    "mediaId": 2594,
    "date": "2022-04-22",
    "sentence": "On those calls, according to Hutchinson, were representatives from Trump's legal team, including Rudy Giuliani, Jenna Ellis and Sidney Powell, as well as Reps. <span class='selected-term'>Jim Jordan</span> and Scott Perry.",
    "author": "Via AP news wire",
    "title": "Official: Meadows had been warned of possible 1/6 violence"
  },
  {
    "id": 773,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "Kevin McCarthy on the phone with @RepLizCheney “I think this will pass, and it would be my recommendation you should resign.” pic.twitter.com/uk0sLDVdoa\n— Jean (@jeanvas5) April 22, 2022\nThis new audio belies McCarthy’s public face on January 6, where he strongly recommended an investigation into the Capitol attacks, then did an about-face after House Speaker Nancy Pelosi rejected the addition of Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Ind.",
    "author": "Jennifer Oliver O'Connell",
    "title": "GOP Leader Kevin McCarthy Caught on Tape; Says He Would Convince Trump That He 'Should Resign'"
  }
]