[
  {
    "id": 5549,
    "mediaId": 2641,
    "date": "2022-02-10",
    "sentence": "In a letter sent Thursday to FBI Director Christopher Wray, posted to Twitter, 18 GOP lawmakers, including ranking member Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, said the agency's \"half-page response to our serious concerns about the FBI’s use of counterterrorism resources — as evidence by documents provided to us by a whistleblower — to target concerned parents at local school board meetings.",
    "author": "Jeffrey Rodack",
    "title": "Judiciary Republicans Rip FBI for Withholding Information on School Boards Probe"
  },
  {
    "id": 2774,
    "mediaId": 2526,
    "date": "2022-03-09",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) is demanding answers from the National School Boards Association (NSBA) regarding its “collusion” with the Biden administration to use federal law enforcement to investigate parents attending school board meetings as “domestic terrorists.”\nIn a letter obtained exclusively by Breitbart News, Jordan — who is the ranking member of the House Judiciary Committee — points out that the NSBA’s original letter to President Joe Biden prompted a “rapid and stunning response … that culminated in a directive from the Attorney General for federal law enforcement to monitor school board matters.”\nJordan also pointed out in the letter that the NSBA and Biden administration sought to manufacture a reason for federal law enforcement to go after parents, saying, “We still have concerns about the NSBA’s collusion with the Biden Administration to develop a pretext for invoking federal law enforcement to intimidate and silence parents.” [Emphasis added].",
    "author": "Breccan F. Thies",
    "title": "Exclusive — Jim Jordan: NSBA Colluded with Biden Admin to ‘Intimidate and Silence Parents’ Using Federal Law Enforcement"
  },
  {
    "id": 3295,
    "mediaId": 2557,
    "date": "2022-03-09",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) is demanding answers from the National School Boards Association (NSBA) regarding its “collusion” with the Biden administration to use federal law enforcement to investigate parents attending school board meetings as “domestic terrorists.”\nIn a letter obtained exclusively by Breitbart News, Jordan — who is the ranking member of the House Judiciary Committee — points out that the NSBA’s original letter to President Joe Biden prompted a “rapid and stunning response … that culminated in a directive from the Attorney General for federal law enforcement to monitor school board matters.”\nThe article goes on to state the following:\nJordan also pointed out in the letter that the NSBA and Biden administration sought to manufacture a reason for federal law enforcement to go after parents, saying, “We still have concerns about the NSBA’s collusion with the Biden Administration to develop a pretext for invoking federal law enforcement to intimidate and silence parents.” [Emphasis added].",
    "author": "DML News App",
    "title": "NEWS ALERT: Jim Jordan: NSBA Colluded with Biden Admin to ‘Intimidate and Silence Parents’"
  }
]