[
  {
    "id": 5500,
    "mediaId": 2641,
    "date": "2022-02-08",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Tuesday that conservatives have a lot of reasons to be confident in a red wave this November, but warned never to be overconfident.",
    "author": "Jeremy Frankel",
    "title": "Rep. Jordan to Newsmax: Be Confident of Red Wave, but Not Overconfident"
  },
  {
    "id": 5542,
    "mediaId": 2641,
    "date": "2022-02-09",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax that House Speaker Nancy Pelosi, D-Calif., was wrong to tell athletes at the 2022 Beijing Winter Olympics not to protest.",
    "author": "Nick Koutsobinas",
    "title": "Rep. Jim Jordan to Newsmax: Pelosi Wrong to Tell Olympians Not to Speak Out"
  },
  {
    "id": 4641,
    "mediaId": 2641,
    "date": "2022-02-14",
    "sentence": "According to the New York Post, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, speaking on Durham's investigation, found credibility in the probe's assertion of spying.",
    "author": "Nick Koutsobinas",
    "title": "Nunes to Newsmax: Durham Probe Will Bring 'More' Indictments Against Clinton Campaign"
  },
  {
    "id": 4055,
    "mediaId": 2641,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday that poor decisions about energy by President Joe Biden have led Russian President Vladimir Putin to use oil and gas as leverage.",
    "author": "Luca Cacciatore",
    "title": "Jim Jordan to Newsmax: 'Putin Is Using Energy as Leverage' on US, NATO"
  },
  {
    "id": 3018,
    "mediaId": 2641,
    "date": "2022-03-09",
    "sentence": "Russian President Vladimir Putin has taken advantage of a lack of leadership in the White House to carry out his invasion of Ukraine, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday.",
    "author": "Brian Freeman",
    "title": "Rep. Jim Jordan to Newsmax: Putin Takes Advantage of WH Weakness"
  },
  {
    "id": 2015,
    "mediaId": 2641,
    "date": "2022-03-28",
    "sentence": "Amid a potential incoming food shortage, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax that in every domain, the Biden administration has \"screwed things up.\"",
    "author": "Jack Gournell",
    "title": "Rep. Jim Jordan to Newsmax: Food Shortage Talks Shows Biden Has 'Screwed Things Up'"
  },
  {
    "id": 1892,
    "mediaId": 2641,
    "date": "2022-03-29",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Tuesday that what the public can divine from Hunter Biden's laptop will depend on Attorney General Merrick Garland, who was nominated by President Joe Biden.",
    "author": "Nick Koutsobinas",
    "title": "Rep. Jordan to Newsmax: We'll Have to Wait for DOJ Regarding Hunter's Laptop"
  },
  {
    "id": 1092,
    "mediaId": 2641,
    "date": "2022-04-01",
    "sentence": "His comments come after 10 committee Republicans, led by ranking member Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, wrote to Twitter CEO Parag Agrawal and Facebook CEO Mark Zuckerberg, quoting a 2020 article from The New York Post about Hunter Biden's laptop and noting that mainstream outlets like The Washington Post, The New York Times and others are now reporting on the matter.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Steube to Newsmax: GOP Will Win, Subpoena Big Tech on Hunter Biden"
  },
  {
    "id": 1109,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, who will chair the powerful House Judiciary Committee if Republicans regain control of the House in this year's elections, told Newsmax there will be a \"number of things\" that will come under investigation, including the details behind the discoveries being made about President Joe Biden's son Hunter and the moves to cover up details about his laptop and actions during the 2020 election.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Jordan to Newsmax: GOP Will Investigate Hunter Biden If House Is Won"
  }
]