[
  {
    "id": 5786,
    "mediaId": 2523,
    "date": "2022-02-09",
    "sentence": "",
    "author": "The Associated Press",
    "title": "Jan. 6 committee subpoenas ex-Trump adviser Navarro"
  },
  {
    "id": 5938,
    "mediaId": 2707,
    "date": "2022-02-09",
    "sentence": "",
    "author": "The Associated Press",
    "title": "Jan. 6 committee subpoenas ex-Trump adviser Navarro"
  },
  {
    "id": 6048,
    "mediaId": 2634,
    "date": "2022-02-11",
    "sentence": "?As the Select Committee will demonstrate in hearings later this year, no foreign power corrupted America’s voting machines, and no massive secret fraud changed the election outcome.”\nWhat they did this week\nRepresentative <span class='selected-term'>Jim Jordan</span> is still declining the committee’s invitation to sit down and answer questions.",
    "author": "Grace Segers",
    "title": "January 6 Committee Recap: Concerns About Trump’s Records Can’t Be Flushed Away"
  },
  {
    "id": 3737,
    "mediaId": 2658,
    "date": "2022-03-02",
    "sentence": "House Minority Leader Kevin McCarthy, Rep. Scott Perry (R-Pa.) and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) have all refused, despite evidence showing they witnessed or participated in significant aspects of Trump’s effort.",
    "author": "",
    "title": "Jan. 6 probe points lawmakers more and more toward GOP colleagues"
  },
  {
    "id": 2560,
    "mediaId": 2634,
    "date": "2022-03-25",
    "sentence": "The committee has asked Congressmen Scott Perry and <span class='selected-term'>Jim Jordan</span> to answer questions, and both lawmakers have declined its invitations.",
    "author": "Daniel Strauss",
    "title": "January 6 Recap: Committee Ratchets Up the Pressure on Two Key Trumpies"
  },
  {
    "id": 2088,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "House Minority Leader Kevin McCarthy and Reps. <span class='selected-term'>Jim Jordan</span> (R-Pa.) and Scott Perry (R-Pa.) were all 'invited' to testify but refused.",
    "author": "Tom Boggioni",
    "title": "Subpoenas for Kevin McCarthy and Jim Jordan 'not off the table': House riot committee chair"
  },
  {
    "id": 1568,
    "mediaId": 2701,
    "date": "2022-04-07",
    "sentence": "Instead, Republican Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio have led their own investigation into the Capitol security failures after Pelosi replaced them with Wyoming Rep. Liz Cheney and Illinois’s Adam Kinzinger.",
    "author": "Tristan Justice",
    "title": "House Votes To Seek Jail Time For Former Trump Officials Held In Contempt"
  },
  {
    "id": 1571,
    "mediaId": 2634,
    "date": "2022-04-08",
    "sentence": "Other Trump allies, like Congressmen <span class='selected-term'>Jim Jordan</span> and Scott Perry, have refused the committee’s invitation to sit down for interviews.",
    "author": "Daniel Strauss",
    "title": "January 6 Recap: Exactly What Did Ivanka Trump Talk About for Eight Long Hours?"
  }
]