[
  {
    "id": 6523,
    "mediaId": 2702,
    "date": "2022-01-20",
    "sentence": "The letter to Ivanka Trump asking her to sit with the committee as soon as early February is the latest in a string of voluntary requests from the panel, including those sent to House Minority Leader Kevin McCarthy (R-Calif.) and Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Scott Perry (R-Pa.).",
    "author": "Rebecca Beitsch",
    "title": "Jan. 6 committee asks Ivanka Trump to sit for interview"
  },
  {
    "id": 6578,
    "mediaId": 2621,
    "date": "2022-01-20",
    "sentence": "No more crazy people.” Kayleigh McEnany responded: “Yes 100%.”\nA few days later, on January 10, 2021, Mr. Hannity wrote to the White House Chief of Staff and Congressman <span class='selected-term'>Jim Jordan</span> with the following message:\n“Guys, we have a clear path to land the plane in 9 days.",
    "author": "Alex Griffing",
    "title": "Hannity Texted White House a Five-Point Plan for How to Deal With Trump on Jan. 7: ‘No More Stolen Election Talk’"
  },
  {
    "id": 6394,
    "mediaId": 2636,
    "date": "2022-01-20",
    "sentence": "Ever,” Mr. Hannity wrote on Jan. 10, 2021, to Mr. Meadows and Representative <span class='selected-term'>Jim Jordan</span>, an Ohio Republican.",
    "author": "",
    "title": "After Jan. 6, Sean Hannity Advised Trump: ‘No More Stolen Election Talk’"
  },
  {
    "id": 6425,
    "mediaId": 2658,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them.”\nWhen he served in Congress, DeSantis was one of Trump’s staunchest defenders on Fox News as former Special Counsel Robert Mueller investigated alleged Russian interference in the 2016 election.",
    "author": "",
    "title": "Trump calls feud with DeSantis ‘fake news’"
  },
  {
    "id": 6711,
    "mediaId": 2569,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them; they were fantastic.",
    "author": "",
    "title": "‘Totally fake news’: Donald Trump downplays any split with Ron DeSantis"
  },
  {
    "id": 6868,
    "mediaId": 2569,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them; they were fantastic.",
    "author": "",
    "title": "Rick Scott says there’s no ‘war’ between Donald Trump, Ron DeSantis"
  },
  {
    "id": 6877,
    "mediaId": 2595,
    "date": "2022-01-21",
    "sentence": "He was — he was right up front, along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them.",
    "author": "M Dowling",
    "title": "Trump MURDERS the Fake Trump-DeSantis Feud Story"
  },
  {
    "id": 6998,
    "mediaId": 2569,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them; they were fantastic.",
    "author": "",
    "title": "‘Remove Ron’ trolls Donald Trump for not keeping DeSantis in line"
  },
  {
    "id": 6965,
    "mediaId": 2730,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic.",
    "author": "Madeline Leesman",
    "title": "Trump Responds to Reports Claiming That He Has Conflict with DeSantis"
  },
  {
    "id": 6969,
    "mediaId": 2553,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic.",
    "author": "Ryan Saavedra",
    "title": "Trump Makes Statement Over Reports That He Has A Problem With Governor Ron DeSantis"
  },
  {
    "id": 6950,
    "mediaId": 2688,
    "date": "2022-01-22",
    "sentence": "Again, on Jan. 10, Hannity texted Meadows and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), expressing some anxiety over a conversation he had had with Trump that day.",
    "author": "Josh Kovensky",
    "title": "‘No More Crazies’: Trump’s Final Days In Office, As Documented By The Jan. 6 Committee"
  },
  {
    "id": 7031,
    "mediaId": 4091,
    "date": "2022-01-24",
    "sentence": "I will help reinforce.”\nAlso, Hannity said he believed it was “key” to keep Trump away from certain people, texting: “No more crazy people,” leading McEnany to respond: “Yes, 100%.”\nHannity also wrote in a text to Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and then-White House Chief of Staff Mark Meadows:\nGuys, we have a clear path to land the plane in 9 days.",
    "author": "JD Heyes",
    "title": "More leaked texts from the Jan. 6 Committee show messaging coordination between Hannity, McEnany"
  },
  {
    "id": 6687,
    "mediaId": 2644,
    "date": "2022-02-01",
    "sentence": "So far, three lawmakers have been asked to help with the investigation: Reps. Kevin McCarthy (R-Calif.), <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Scott Perry (R-Pa.).",
    "author": "Callie Patteson",
    "title": "Ex-Trump press secretary Kayleigh McEnany hands over texts to Jan. 6 panel"
  },
  {
    "id": 6010,
    "mediaId": 4064,
    "date": "2022-02-11",
    "sentence": "Other prominent conservatives, such as Dinesh D’Souza, Sean Hannity, and Representative <span class='selected-term'>Jim Jordan</span>, soon followed.",
    "author": "",
    "title": "What Are the Details of the Trump Media and Rumble Partnership?"
  },
  {
    "id": 4649,
    "mediaId": 2658,
    "date": "2022-02-14",
    "sentence": "Meanwhile, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) defended the truckers on Fox News.",
    "author": "",
    "title": "What's happening with the Canadian trucker convoy? Here's what you need to know"
  },
  {
    "id": 4999,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "Marsha Blackburn, Bill Hagerty, James Lankford and Marco Rubio; and Reps. Andy Biggs, Lauren Boebert, Ken Buck, Madison Cawthorn, Byron Donalds, Matt Gaetz, Jody Hice, Ronny Jackson, <span class='selected-term'>Jim Jordan</span>, Billy Long, Barry Loudermilk, Scott Perry and Greg Steube.",
    "author": "Jennifer Harper",
    "title": "Michele Tafoya leaves sports, jumps into politics"
  },
  {
    "id": 5062,
    "mediaId": 2512,
    "date": "2022-02-16",
    "sentence": "That concern was shared by an unidentified member of the House Freedom Caucus, who wrote to Meadows on January 2nd that “if POTUS allows this to occur… we’re driving a stake in the heart of the federal republic.”\nThree days later, former Defense Department Inspector General Joseph Schmitz wrote to election objector Congressman <span class='selected-term'>Jim Jordan</span> (R-Ohio) that “on January 6, 2021, Vice President Mike Pence, as President of the Senate, should call out all electoral votes that he believes are unconstitutional as no electoral votes at all -- in accordance with guidance from founding father Alexander Hamilton and judicial precedence.",
    "author": "Brandon Gage",
    "title": "Text messages showcase the chaos and desperation inside Trumpworld on January 6th"
  },
  {
    "id": 3737,
    "mediaId": 2658,
    "date": "2022-03-02",
    "sentence": "House Minority Leader Kevin McCarthy, Rep. Scott Perry (R-Pa.) and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) have all refused, despite evidence showing they witnessed or participated in significant aspects of Trump’s effort.",
    "author": "",
    "title": "Jan. 6 probe points lawmakers more and more toward GOP colleagues"
  },
  {
    "id": 1917,
    "mediaId": 2745,
    "date": "2022-03-29",
    "sentence": "",
    "author": "",
    "title": "The people to whom Trump talked on the day of the Capitol riot"
  },
  {
    "id": 1609,
    "mediaId": 2650,
    "date": "2022-04-02",
    "sentence": "The thinking: It will be much easier to blunt the RINO impulse with <span class='selected-term'>Jim Jordan</span> as Speaker and somebody like Marsha Blackburn helming the Senate.",
    "author": "Mark Ellis",
    "title": "Is Conservative Commentary Getting Too Cocky About the Midterms?"
  },
  {
    "id": 1284,
    "mediaId": 6676,
    "date": "2022-04-06",
    "sentence": "But many of Trump’s Republican allies in Congress, including Reps. <span class='selected-term'>Jim Jordan</span> (Ohio), Jim Banks (Ind.",
    "author": "Kelsey Carolan",
    "title": "Trump gets attention for saying he lost election"
  },
  {
    "id": 1423,
    "mediaId": 2672,
    "date": "2022-04-07",
    "sentence": "The former president, who may have violated the Presidential Records Act, claims he didn’t destroy any call logs or speak on “burner phones.” But he said he did remember talking to House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), and others during that time.",
    "author": "William Vaillancourt",
    "title": "Trump Says He Wanted to March to Capitol on Jan. 6, Blames Everyone But Himself for Carnage"
  }
]