[
  {
    "id": 5486,
    "mediaId": 2572,
    "date": "2022-02-03",
    "sentence": "Reps. James Comer, R-Ky.,, a member of the Oversight and Reform Committee; Steve Scalise, R-La., the minority whip and ranking member of the Select Subcommittee on the Coronavirus Crisis; and <span class='selected-term'>Jim Jordan</span>, R-Ohio, ranking member of the Judiciary Committee, have questioned whether these scientists felt pressure from top health officials like Dr. Antony Fauci and Dr. Francis Collins.",
    "author": "Caitlin McFall",
    "title": "Top oversight Republicans call on 7 scientists to testify on COVID origins, Wuhan lab leak"
  },
  {
    "id": 5851,
    "mediaId": 4032,
    "date": "2022-02-10",
    "sentence": "In a letter to Jeremy Farrar of Britain’s Wellcome Trust and six others, Representatives James Comer of Kentucky, Steve Scalise of Louisiana and <span class='selected-term'>Jim Jordan</span> of Ohio asked for details about a teleconference in February 2020 that included Farrar, Francis Collins of the National Institutes of Health, and Anthony Fauci, head of the National Institute of Allergy and Infectious Diseases, an NIH subsidiary.",
    "author": "Veronika Kyrylenko",
    "title": "Probe Into China Virus Lab Leak Expands. House GOPers Demand Answers From Top Scientists"
  },
  {
    "id": 5183,
    "mediaId": 2672,
    "date": "2022-02-15",
    "sentence": "Microsoft lobbyists gave the most, with Fred Humphries donating $2,500 to House Minority Leader Kevin McCarthy (R-Calif.) and $1,000 to Ohio Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "William Vaillancourt",
    "title": "Lobbyists Are Donating to GOP Election Deniers Even After Their Companies Pledged to Stop Giving"
  },
  {
    "id": 3290,
    "mediaId": 2590,
    "date": "2022-03-10",
    "sentence": "Biden “shut off the Keystone Pipeline,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) declared in an interview last week.",
    "author": "Chris D'Angelo",
    "title": "The GOP's Biggest Whoppers About Biden And Fossil Fuels"
  },
  {
    "id": 3140,
    "mediaId": 2550,
    "date": "2022-03-10",
    "sentence": "In the midst of trying to defend Trump, Rep. <span class='selected-term'>Jim Jordan</span> called Ukraine “one of the three most corrupt countries on the planet.” He also condemned efforts to fight corruption in Ukraine as themselves corrupt because Biden was involved.",
    "author": "Laura Clawson",
    "title": "Republicans suddenly claim to be the biggest allies of the nation they once denounced as corrupt"
  },
  {
    "id": 3085,
    "mediaId": 2625,
    "date": "2022-03-11",
    "sentence": "Biden “shut off the Keystone Pipeline,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) declared in an interview last week.",
    "author": "Chris D’Angelo",
    "title": "The GOP’s Four Biggest Lies About Joe Biden and Fossil Fuels"
  },
  {
    "id": 3631,
    "mediaId": 2744,
    "date": "2022-03-15",
    "sentence": "Just In...\nRepublican Reps. Steve Scalise and <span class='selected-term'>Jim Jordan</span> blasted Democrats for their handling of COVID-19, the economy, and the war in Ukraine.",
    "author": "Heather Hamilton",
    "title": "WATCH: GOP lawmakers say Democrats playing 'out of touch' political games"
  },
  {
    "id": 2731,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "She added that Republicans plan to fire “lame duck” House Speaker Nancy Pelosi (D-NY) “once and for all.”\nThe Task Force Leaders of each topic are as follows:\nJobs and the Economy: Rep. Patrick McHenry (R-NC)\nBig Tech Censorship and Data: Rep. Cathy Rodgers (WA)\nFuture of American Freedoms: Rep. <span class='selected-term'>Jim Jordan</span> (R-OH)\nEnergy, Climate and Conservation: Rep. Garret Graves (R-LA)\nAmerican Security: Rep. John Katko (R-NY)\nHealthy Futures: Rep. Brett Guthrie (R-KY) and Rep. Vern Buchanan (R-FL)\nChina Accountability: Rep. Michael McCaul (R-TX)\nDuring the press conference, each Republican member provided a brief preview of the agenda items of their task force .",
    "author": "Hannah Bleau",
    "title": "House Republican Leadership Announces Taskforce Leaders to Fix Biden’s Failures"
  },
  {
    "id": 2458,
    "mediaId": 2748,
    "date": "2022-03-24",
    "sentence": "She added that Republicans plan to fire “lame duck” House Speaker Nancy Pelosi (D-NY) “once and for all.”\nThe Task Force Leaders of each topic are as follows:\nJobs and the Economy: Rep. Patrick McHenry (R-NC)\nBig Tech Censorship and Data: Rep. Cathy Rodgers (WA)\nFuture of American Freedoms: Rep. <span class='selected-term'>Jim Jordan</span> (R-OH)\nEnergy, Climate and Conservation: Rep. Garret Graves (R-LA)\nAmerican Security: Rep. John Katko (R-NY)\nHealthy Futures: Rep. Brett Guthrie (R-KY) and Rep. Vern Buchanan (R-FL)\nChina Accountability: Rep. Michael McCaul (R-TX)\nDuring the press conference, each Republican member provided a brief preview of the agenda items of their task force .",
    "author": "Blarp Blog",
    "title": "House Republican Leadership Announces Taskforce Leaders to Fix Biden’s Failures"
  },
  {
    "id": 2585,
    "mediaId": 6449,
    "date": "2022-03-28",
    "sentence": "And in fact, [Reps.] Cathy McMorris Rodgers and <span class='selected-term'>Jim Jordan</span> have been working on legislation to make changes to Section 230 to take those protections away from Big Tech, because they haven’t been the marketplace of free speech and we need more town squares.",
    "author": "Virginia Allen",
    "title": "Republican House Leaders Elise Stefanik and Steve Scalise Outline GOP Agenda"
  },
  {
    "id": 556,
    "mediaId": 5117,
    "date": "2022-04-22",
    "sentence": "He has tried to temper his closest rivals, Rep. Steve Scalise of Louisiana and Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, even as he works to shore up the votes that would be needed to become speaker.",
    "author": "",
    "title": "Audio reveals GOP leader Kevin McCarthy planned to urge Trump to resign after Jan. 6 attack"
  }
]