[
  {
    "id": 6570,
    "mediaId": 2634,
    "date": "2022-01-24",
    "sentence": "If the Republicans retake the House this November, the chairman of the Judiciary Committee is going to be <span class='selected-term'>Jim Jordan</span>.",
    "author": "Michael Tomasky",
    "title": "The Case for Impeaching Clarence Thomas"
  },
  {
    "id": 6898,
    "mediaId": 2748,
    "date": "2022-01-24",
    "sentence": "",
    "author": "",
    "title": "SCOTUS Allows Pro-Life Laws To Stay In Effect"
  },
  {
    "id": 6301,
    "mediaId": 2629,
    "date": "2022-02-05",
    "sentence": "Records that former President Donald Trump attempted to hide from public scrutiny have now revealed that he spoke on the phone with Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) on Jan. 6, 2021.",
    "author": "Oliver Willis",
    "title": "Records Trump Tried To Hide Reveal Call To Jim Jordan Before Capitol Attack"
  },
  {
    "id": 4391,
    "mediaId": 2702,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Morgan Chalfant",
    "title": "Biden says Jackson will bring ‘uncompromising integrity’ to Supreme Court"
  },
  {
    "id": 4477,
    "mediaId": 2548,
    "date": "2022-02-26",
    "sentence": "Republican Ohio Rep. <span class='selected-term'>Jim Jordan</span> branded President Joe Biden’s Supreme Court nominee as “another left-wing pick” while appearing on “FOX & Friends Saturday.”\nBiden announced Judge Ketanji Brown Jackson as his Supreme Court nominee Friday.",
    "author": "Kaitlin Housler",
    "title": "‘It’s Another Left-Wing Pick’: Rep. Jim Jordan Reacts To Biden’s SCOTUS Nominee"
  },
  {
    "id": 4345,
    "mediaId": 2548,
    "date": "2022-02-27",
    "sentence": "Republican Ohio Rep. <span class='selected-term'>Jim Jordan</span> called Jackson “another left wing pick” and “radical,” criticizing her positions on parental rights in education, the First and Second Amendments and school choice during a Saturday appearance on “Fox & Friends.”\nJackson is one of the most high-profile judicial nominees confirmed to the U.S. Court of Appeals for the D.C.",
    "author": "Nicole Silverio",
    "title": "‘I Find Those Words Offensive’: Sen. Klobuchar Pushes Back On Claims That Biden’s SCOTUS Nominee Is ‘Far Left’"
  },
  {
    "id": 2244,
    "mediaId": 2512,
    "date": "2022-03-22",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Rep. Jim Jordan) 1647972355\nThe problem with the first part of Jordan's complaint is that it makes no sense because coverage of Senate hearings happens in real-time, astute Twitter users pointed out...",
    "author": "Brandon Gage",
    "title": "Jim Jordan's latest 'total bullsh*t' Twitter swipe at Ketanji Brown Jackson backfires spectacularly"
  },
  {
    "id": 2307,
    "mediaId": 2512,
    "date": "2022-03-22",
    "sentence": "Ohio Rep. <span class='selected-term'>Jim Jordan</span> (R) decided to weigh in on the public discourse as confirmation hearings were getting underway for Supreme Court nominee Ketanji Brown Jackson.",
    "author": "Timothy Evans",
    "title": "Twitter aptly reminds Jim Jordan that he holds no ethical high ground"
  },
  {
    "id": 2507,
    "mediaId": 2664,
    "date": "2022-03-22",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Rep. Jim Jordan) 1647874394\nMany of the responses to Jordan's tweet reminded the GOP congressman that his own memory isn't unassailable, specifically that his story seems constantly to be changing about how many times he spoke with former President Donald Trump on the day of the deadly Jan. 6 insurrection at the U.S. Capitol.",
    "author": "Timothy Evans",
    "title": "Jim Jordan’s own troubling history resurfaces after his 'don't forget' tweet about Brett Kavanaugh"
  },
  {
    "id": 2660,
    "mediaId": 2663,
    "date": "2022-03-22",
    "sentence": "(@taradublinrocks) March 21, 2022\n<span class='selected-term'>Jim Jordan</span> accused of ‘begging’ former Ohio State wrestler not to support reports of sexual abuse https://t.co/XJK8Pf0Uld\n— Shar G (@hapkidogal) March 21, 2022\nWhich ironically is one way to forget what you did at Ohio State.",
    "author": "Dan Tracer",
    "title": "Jim Jordan’s dumb tweet about SCOTUS hearings backfires spectacularly"
  },
  {
    "id": 1926,
    "mediaId": 2745,
    "date": "2022-03-24",
    "sentence": "She wrote, “House and Senate guys are pathetic too... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy.” She appeared to be referring to Republican House members Louie Gohmert of Texas, <span class='selected-term'>Jim Jordan</span> of Ohio, Paul A. Gosar of Arizona and Chip Roy of Texas.",
    "author": "",
    "title": "Virginia Thomas urged White House chief to pursue unrelenting efforts to overturn the 2020 election, texts show"
  },
  {
    "id": 2121,
    "mediaId": 2745,
    "date": "2022-03-25",
    "sentence": "“If you’ve spent any time studying the Supreme Court justice, he’s the one who studies correctly.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) — who McCarthy said will become chair of the House Judiciary Committee if Republicans regain the majority in this year’s midterm elections — said he “totally” agreed with McCarthy’s assessment.",
    "author": "",
    "title": "Ethics experts see Ginni Thomas’s texts as a problem for Supreme Court"
  },
  {
    "id": 2523,
    "mediaId": 2644,
    "date": "2022-03-25",
    "sentence": "If it’s constitutional, that’s what his job should be — it’s him.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), who was seated next to McCarthy at the event, agreed with the minority leader, saying, “Totally.”\nWhile Wyden remains the only lawmaker to call on Thomas to recuse himself, several legal experts have made similar comments.",
    "author": "Callie Patteson",
    "title": "Clarence Thomas called to recuse himself over wife’s alleged texts"
  },
  {
    "id": 2399,
    "mediaId": 2672,
    "date": "2022-03-25",
    "sentence": "Republican Reps. Kevin McCarthy and <span class='selected-term'>Jim Jordan</span>, however, aren’t too concerned.",
    "author": "William Vaillancourt",
    "title": "Republicans Shrug at Glaring Conflict of Interest in Clarence Thomas Ruling on Election-Related Cases"
  },
  {
    "id": 2160,
    "mediaId": 2664,
    "date": "2022-03-25",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), who was seated next to McCarthy at an event hosted by the Congressional Institute, said he agreed.",
    "author": "Travis Gettys",
    "title": "GOP's Kevin McCarthy rejects calls for Clarence Thomas to recuse from Jan. 6 cases despite wife's involvement"
  },
  {
    "id": 2175,
    "mediaId": 2664,
    "date": "2022-03-26",
    "sentence": "McCarthy at the time was seated next to Rep. <span class='selected-term'>Jim Jordan</span>, the Ranking Member of the House Judiciary Committee, which just happens to oversee the Supreme Court – including impeachments of Supreme Court justices.",
    "author": "David Badash",
    "title": "As legal experts call for Clarence Thomas to recuse himself, House Republicans say 'we need more' like him"
  },
  {
    "id": 1909,
    "mediaId": 2512,
    "date": "2022-03-26",
    "sentence": "McCarthy at the time was seated next to Rep. <span class='selected-term'>Jim Jordan</span>, the Ranking Member of the House Judiciary Committee, which just happens to oversee the Supreme Court – including impeachments of Supreme Court justices.",
    "author": "David Badash",
    "title": "As legal experts call for Clarence Thomas to recuse House Republicans say ‘we need more’ like him"
  },
  {
    "id": 2662,
    "mediaId": 2694,
    "date": "2022-03-30",
    "sentence": "PSYOP.”\nThe communications between Meadows and Thomas disclosed her anger that so few Republicans were rallying behind Trump in the way that Representatives Louie Gohmert, <span class='selected-term'>Jim Jordan</span>, Paul Gosar, and Chip Roy were.",
    "author": "Peter Wehner",
    "title": "A Glimpse Into a Fearful, Angry, Imaginary World"
  },
  {
    "id": 1291,
    "mediaId": 2685,
    "date": "2022-04-07",
    "sentence": "Trump said that he remembered talking to House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and other people during that period.",
    "author": "Josh Dawsey Washington Post",
    "title": "Trump deflects blame for Jan. 6 silence, says he wanted to march to Capitol"
  },
  {
    "id": 1069,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "She then played clips of Reps. Matt Gaetz (R-FL), <span class='selected-term'>Jim Jordan</span> (R-OH), and Tennessee Republicans.",
    "author": "Bob Brigham",
    "title": "Ted Cruz called out for his 'fake worrying about pretend pedophiles' as GOP becomes the QAnon party"
  }
]