[
  {
    "id": 6775,
    "mediaId": 2690,
    "date": "2022-01-20",
    "sentence": "pic.twitter.com/6zVW0lE0Ni\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 3, 2022\nREPORTER: \"Should members of congress and their spouses be banned from trading individual stocks while serving in congress?\"",
    "author": "",
    "title": "SHOWDOWN: Ex-Navy SEALs Running For Congress Unite To Take Down ‘Grave Threat’ Nancy Pelosi"
  },
  {
    "id": 6898,
    "mediaId": 2748,
    "date": "2022-01-24",
    "sentence": "",
    "author": "",
    "title": "SCOTUS Allows Pro-Life Laws To Stay In Effect"
  },
  {
    "id": 6904,
    "mediaId": 2636,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Alan Feuer",
    "title": "Stewart Rhodes, Oath Keepers Leader, Is Denied Bail on Sedition Charge"
  },
  {
    "id": 6794,
    "mediaId": 2528,
    "date": "2022-01-30",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, an Ohio Republican and Trump ally, also recently listed a slew of investigations he would launch into the Biden administration if Republicans take control of the House and he becomes chair of the House Judiciary Committee.",
    "author": "Alia Shoaib",
    "title": "Trump vows the GOP will investigate 'Biden corruption' if they retake Congress in the midterm elections"
  },
  {
    "id": 6244,
    "mediaId": 2748,
    "date": "2022-02-02",
    "sentence": "",
    "author": "bigprick",
    "title": "MORE THAN 100 CONSTITUENTS OPEN INVESTIGATIONS INTO 2020 ELECTION FRAUD"
  },
  {
    "id": 5565,
    "mediaId": 2550,
    "date": "2022-02-08",
    "sentence": "https://t.co/TZDSTI5Oq0\n— Olivia Beavers (@Olivia_Beavers) October 26, 2021\nNehls never had his shot on the Jan. 6 committee because McCarthy ultimately withdrew his name and every other Republican he proposed for the panel after Speaker Pelosi rejected two of his selections: Rep. <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana.",
    "author": "",
    "title": "Texas Republican and Trump ally accuses Capitol Police of snooping through his office"
  },
  {
    "id": 4620,
    "mediaId": 2641,
    "date": "2022-02-16",
    "sentence": "Pelosi did not object to Nehls, but McCarthy pulled all of his nominees when Pelosi rejected Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Jim Banks, R-Ind., because they had worked to defend Trump on the House Judiciary Committee during House Democrat-led impeachment inquiries.",
    "author": "Eric Mack",
    "title": "Trump Endorses Texas GOP Reps. Nehls, Gooden, Weber"
  },
  {
    "id": 2779,
    "mediaId": 2664,
    "date": "2022-03-18",
    "sentence": "Opponents of the bill, like the Republican <span class='selected-term'>Jim Jordan</span>, accused Democrats of \"avoiding the issues the American people care about,\" like inflation and the soaring cost of gasoline.",
    "author": "Agence France-Presse",
    "title": "US Congress moves to ban discrimination of race-related hairstyles"
  },
  {
    "id": 3012,
    "mediaId": 2614,
    "date": "2022-03-18",
    "sentence": "Fauci is probably responding to House republicans like Texas REP Chip Roy or Ohio REP <span class='selected-term'>Jim Jordan</span> who have made comments that they’ll be coming after him.",
    "author": "SteveGruber.com",
    "title": "Fauci Running Scared"
  },
  {
    "id": 1919,
    "mediaId": 2583,
    "date": "2022-03-25",
    "sentence": "",
    "author": "",
    "title": "Jim Jordan: ‘Every Single Right that We Enjoy under the First Amendment Has Been Assaulted’"
  },
  {
    "id": 1351,
    "mediaId": 6627,
    "date": "2022-04-01",
    "sentence": "“Yet because of the way the federal criminal laws are written in the way that cannabis is placed in schedule one, it is very easy for a marijuana offense to actually get someone a worse sentence than an opioid offense like overprescribing OxyContin or selling fentanyl or a firearms.”\nRep. <span class='selected-term'>Jim Jordan</span> voiced outrage at the marijuana bill’s timing, saying that issues such as crime, inflation, and illegal immigration should be taking precedence.",
    "author": "",
    "title": "Inflation, Immigration, Mass Destruction: DEMS FINALLY HAVE A PLAN!"
  },
  {
    "id": 1211,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "Freedom of speech on campus\nRepublicans on the panel, Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Andy Biggs of Arizona, focused on freedom of speech on college campuses, and argued that these places were not welcoming to conservatives.",
    "author": "Ariana Figueroa",
    "title": "Students who fought book ban tell their story to House panel"
  },
  {
    "id": 755,
    "mediaId": 2548,
    "date": "2022-04-22",
    "sentence": "Republican Ohio Rep. <span class='selected-term'>Jim Jordan</span> said the House needs to consider a possible impeachment of Biden over the large influx of migrants at the U.S.-Mexico border.",
    "author": "Nicole Silverio",
    "title": "‘This Ain’t Your Father’s Republican Party’: Biden Calls The Modern GOP ‘A Different Breed Of Cat’"
  }
]