[
  {
    "id": 6768,
    "mediaId": 2614,
    "date": "2022-01-19",
    "sentence": "but that would only be the case if we don’t get another variant that eludes the immune response.”\nIn the end, Fauci was unclear what the future holds for COVID-19, concluding, “The answer is: We do not know.”\nThe doctor who has not only advised President Joe Biden but has placed himself at the forefront of the pandemic has come under fire recently with Republican Representative <span class='selected-term'>Jim Jordan</span> from Ohio saying they would investigate Fauci if the GOP wins in the 2022 midterm election.",
    "author": "DrewBerquist.com",
    "title": "Fauci Suggests World Is In Phase One Of Five In COVID-19 Pandemic"
  },
  {
    "id": 6592,
    "mediaId": 6621,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic,” Trump said.",
    "author": "",
    "title": "WHERE'S THE BEEF? Trump Says DeSantis Feud Fake News, ‘We Get Along Great,’ ‘He’s Done a Terrific Job’"
  },
  {
    "id": 6917,
    "mediaId": 2748,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic,” Trump said.",
    "author": "",
    "title": "WHERE'S THE BEEF? Trump Says DeSantis Feud Fake News, ‘We Get Along Great,’ ‘He’s Done a Terrific Job’"
  },
  {
    "id": 6421,
    "mediaId": 2550,
    "date": "2022-01-30",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> of Ohio is one of the very worst Republicans, and that is saying something.",
    "author": "",
    "title": "Republicans see masks and vaccines as stifling freedom, but it's actually the best way to restore it"
  },
  {
    "id": 5767,
    "mediaId": 2672,
    "date": "2022-02-10",
    "sentence": "The committee has established that Trump spoke to several figures in this circle on Jan. 6, including Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), who admitted last summer he spoke to Trump on the day of the riot.",
    "author": "Ryan Bort",
    "title": "The White House Reportedly Didn’t Log Some of Trump’s Jan. 6 Calls — for Some Strange Reason"
  },
  {
    "id": 5797,
    "mediaId": 2688,
    "date": "2022-02-10",
    "sentence": "But despite the missing call records, the Jan. 6 committee has reportedly unearthed information on at least one of Trump’s most highly scrutinized calls: A call between him and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Matt Shuham",
    "title": "Report: Jan. 6 Panel Finds Holes In Trump’s Official Call Logs On Day Of Insurrection"
  },
  {
    "id": 5740,
    "mediaId": 2724,
    "date": "2022-02-10",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 9, 2022",
    "author": "Becky Noble",
    "title": "New York Times: Election, Not Science, Driving Democrat Mandate Reversals"
  },
  {
    "id": 3289,
    "mediaId": 2595,
    "date": "2022-03-10",
    "sentence": "Ohio Republican lawmaker <span class='selected-term'>Jim Jordan</span> requested a briefing with the FBI after a whistleblower disclosed information about two pipe bombs planted on January 5, the night before the Capitol riot/rally.",
    "author": "M Dowling",
    "title": "Only J6 Committee Has Info on Would-Be Bomber"
  },
  {
    "id": 2087,
    "mediaId": 2570,
    "date": "2022-03-19",
    "sentence": "For example, here’s what Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio) tweeted back on December 2, 2022:\nIf you recall, December 2, 2022, was before the peak of the latest Covid-19 Winter surge.",
    "author": "Bruce Y. Lee",
    "title": "#CovidIsNotOver Trends Over Concerns About Covid-19 Complacency, Over-Relaxation Of Precautions"
  },
  {
    "id": 2608,
    "mediaId": 2909,
    "date": "2022-03-20",
    "sentence": "",
    "author": "Deneen Borelli",
    "title": "Liberal Media Silent Over Hunter Biden Laptop – Again"
  },
  {
    "id": 2635,
    "mediaId": 2626,
    "date": "2022-03-29",
    "sentence": "According to Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) the only thing fake about Hunter Biden’s laptop is that “fake news” that claimed that it was full of Russian disinformation.",
    "author": "Eric Scheiner",
    "title": "Rep. Jordan: Hunter’s Laptop Is Real - ‘Fake News’ Pushed ‘Total Garbage’"
  },
  {
    "id": 1642,
    "mediaId": 2563,
    "date": "2022-03-31",
    "sentence": "Congressman <span class='selected-term'>Jim Jordan</span> said, “the mainstream press, along with Big Tech and Democrats, all colluded to keep this important information from the American people just days before our most important election, the presidential election.” That about sums it up.",
    "author": "The Daily Skirmish - Liberato.US",
    "title": "The ‘Laptop from Hell’ Burns Our Devilish Elites"
  },
  {
    "id": 1274,
    "mediaId": 2690,
    "date": "2022-03-31",
    "sentence": "",
    "author": "Jake Martinez",
    "title": "Brainwashed the DocuMovie Part One (Part 89)!"
  },
  {
    "id": 1296,
    "mediaId": 2766,
    "date": "2022-04-01",
    "sentence": "Signing the letter were Reps. <span class='selected-term'>Jim Jordan</span>, Steve Chabot, Louie Gohmert, Darrell Issa, Ken Buck, Matt Gaetz, Mike Johnson, Andy Biggs, Tom McClintock, W. Gregory Steube and others.",
    "author": "Bob Unruh",
    "title": "GOP Launches Review Of Facebook’s Censorship Of Hunter Biden Scandal"
  },
  {
    "id": 1601,
    "mediaId": 2833,
    "date": "2022-04-02",
    "sentence": "The letter concludes, “This irresponsible conduct demands a thorough investigation so that we may understand how Big Tech wields its enormous power over the free flow of information to the detriment of free and fair elections.”\nAppearing on Fox Business Thursday, ranking GOP Rep <span class='selected-term'>Jim Jordan</span> declared that “Big Tech, Big Democrat Party and Big Media all colluded to keep critical information from the American people in the run up to the most important election we have — the presidential election, so we’re launching an investigation.”\nWatch:",
    "author": "Sean Adl-Tabatabai",
    "title": "Congress Launches Investigation Into Facebook & Twitter for Censoring Hunter Biden Pedophile Story"
  },
  {
    "id": 1753,
    "mediaId": 2548,
    "date": "2022-04-03",
    "sentence": "(RELATED: ‘The News Was Fake’: Rep. <span class='selected-term'>Jim Jordan</span> Takes Shots At The Media For Disavowing Hunter Biden’s Laptop)\nA grand jury in Delaware is in the midst of investigating possible tax violations, money laundering and foreign lobbying.",
    "author": "Nicole Silverio",
    "title": "‘Had It Wrong’: Chris Christie Calls Out The New York Times And Washington Post Over Misreporting Hunter Biden’s Laptop"
  },
  {
    "id": 1109,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, who will chair the powerful House Judiciary Committee if Republicans regain control of the House in this year's elections, told Newsmax there will be a \"number of things\" that will come under investigation, including the details behind the discoveries being made about President Joe Biden's son Hunter and the moves to cover up details about his laptop and actions during the 2020 election.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Jordan to Newsmax: GOP Will Investigate Hunter Biden If House Is Won"
  }
]