[
  {
    "id": 6410,
    "mediaId": 2614,
    "date": "2022-01-16",
    "sentence": "",
    "author": "Red Voice Media",
    "title": "Navy Seal Who Killed Bin Laden Posts 6 Images That Completely Destroy Dems January 6 Narrative"
  },
  {
    "id": 6713,
    "mediaId": 2742,
    "date": "2022-01-18",
    "sentence": "",
    "author": "",
    "title": "GOP Finally Focusing On Dems’ Drive To Weaponize Big Tech Against America"
  },
  {
    "id": 5704,
    "mediaId": 2578,
    "date": "2022-02-06",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 1, 2022\nA federal firearm registry is explicitly banned by law.",
    "author": "Mike LaChance",
    "title": "Democrats Are Quietly Building A Gun Registry As A First Step In Gun Ban"
  },
  {
    "id": 5721,
    "mediaId": 2512,
    "date": "2022-02-06",
    "sentence": "Why has <span class='selected-term'>Jim Jordan</span> wanted to pretend that pre-attack call didn't happen?https://www.cnn.com/2022/02/04/politics/jim-jordan-trump-january-6/index.html\\u00a0\\u2026\n— Bill Kristol (@Bill Kristol) 1644001901\nJust a casual 10-minute chat with the president on the morning of the insurrection.",
    "author": "Meaghan Ellis",
    "title": "'A lot of explaining to do': Jim Jordan slammed on Twitter for contradictory remarks about 1/6 call to Trump"
  },
  {
    "id": 5491,
    "mediaId": 2590,
    "date": "2022-02-06",
    "sentence": "— GoFundMe (@gofundme) February 5, 2022\n Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) also complained on Twitter, and Elon Musk gushed: “Canadian truckers rule.”\nIn addition, Louisiana Attorney General Jeff Landry and West Virginia Attorney General Patrick Morrisey, both Republicans, indicated Saturday that they’re investigating the issue.",
    "author": "Mary Papenfuss",
    "title": "Gov. Ron DeSantis Going After GoFundMe For Dumping Anti-Vaccine Ottawa Truckers"
  },
  {
    "id": 4736,
    "mediaId": 2550,
    "date": "2022-02-24",
    "sentence": "In the last week, Funes tagged Republican lawmakers like Reps. <span class='selected-term'>Jim Jordan</span>, Jim Banks, and Senator Josh Hawley with messages like, “Not all #J6 prisoners are created equal.",
    "author": "",
    "title": "framed for Jan. 6 meets with probe"
  },
  {
    "id": 3295,
    "mediaId": 2557,
    "date": "2022-03-09",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) is demanding answers from the National School Boards Association (NSBA) regarding its “collusion” with the Biden administration to use federal law enforcement to investigate parents attending school board meetings as “domestic terrorists.”\nIn a letter obtained exclusively by Breitbart News, Jordan — who is the ranking member of the House Judiciary Committee — points out that the NSBA’s original letter to President Joe Biden prompted a “rapid and stunning response … that culminated in a directive from the Attorney General for federal law enforcement to monitor school board matters.”\nThe article goes on to state the following:\nJordan also pointed out in the letter that the NSBA and Biden administration sought to manufacture a reason for federal law enforcement to go after parents, saying, “We still have concerns about the NSBA’s collusion with the Biden Administration to develop a pretext for invoking federal law enforcement to intimidate and silence parents.” [Emphasis added].",
    "author": "DML News App",
    "title": "NEWS ALERT: Jim Jordan: NSBA Colluded with Biden Admin to ‘Intimidate and Silence Parents’"
  },
  {
    "id": 3156,
    "mediaId": 2590,
    "date": "2022-03-10",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) March 9, 2022\nTwitter users quickly turned the post into a game akin to “Jeopardy,” where if Trump is the answer and they supplied the questions:\nWho is the biggest con man this nation has ever known?",
    "author": "",
    "title": "Rep. Jim Jordan Roasted Over Toadying Trump Message On Twitter"
  },
  {
    "id": 3085,
    "mediaId": 2625,
    "date": "2022-03-11",
    "sentence": "Biden “shut off the Keystone Pipeline,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) declared in an interview last week.",
    "author": "Chris D’Angelo",
    "title": "The GOP’s Four Biggest Lies About Joe Biden and Fossil Fuels"
  },
  {
    "id": 3180,
    "mediaId": 2578,
    "date": "2022-03-12",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) sent a letter to FBI Director Chris Wray on Wednesday regarding the investigation of the DC pipe bomber on January 5, 2021.",
    "author": "Jim Hoft",
    "title": "BREAKING: FBI Whistle-Blower Steps Forward to Reveal Secrets on DC Pipe Bombs to Jim Jordan – FBI Is Withholding Information"
  },
  {
    "id": 3398,
    "mediaId": 2818,
    "date": "2022-03-15",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) celebrate the moment on Twitter:\n“Ohio just became the 23rd state in the nation to enact constitutional carry legislation.",
    "author": "The First",
    "title": "OHIO GREENLIGHTS CONSTITUTIONAL CARRY: Jordan Says ‘Big Win for Second Amendment’"
  },
  {
    "id": 3610,
    "mediaId": 2600,
    "date": "2022-03-16",
    "sentence": "",
    "author": "IWB",
    "title": "Rep. Jim Jordan On Democrat Flip Flopping"
  },
  {
    "id": 3041,
    "mediaId": 2594,
    "date": "2022-03-17",
    "sentence": "Even <span class='selected-term'>Jim Jordan</span> got in on the action, asking on Twitter, \"where’s Fauci?\"",
    "author": "Justin Vallejo",
    "title": "Where’s Fauci? ‘Witness protection’ quip leads to internet conspiracy"
  },
  {
    "id": 2087,
    "mediaId": 2570,
    "date": "2022-03-19",
    "sentence": "For example, here’s what Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio) tweeted back on December 2, 2022:\nIf you recall, December 2, 2022, was before the peak of the latest Covid-19 Winter surge.",
    "author": "Bruce Y. Lee",
    "title": "#CovidIsNotOver Trends Over Concerns About Covid-19 Complacency, Over-Relaxation Of Precautions"
  },
  {
    "id": 2660,
    "mediaId": 2663,
    "date": "2022-03-22",
    "sentence": "(@taradublinrocks) March 21, 2022\n<span class='selected-term'>Jim Jordan</span> accused of ‘begging’ former Ohio State wrestler not to support reports of sexual abuse https://t.co/XJK8Pf0Uld\n— Shar G (@hapkidogal) March 21, 2022\nWhich ironically is one way to forget what you did at Ohio State.",
    "author": "Dan Tracer",
    "title": "Jim Jordan’s dumb tweet about SCOTUS hearings backfires spectacularly"
  },
  {
    "id": 2244,
    "mediaId": 2512,
    "date": "2022-03-22",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Rep. Jim Jordan) 1647972355\nThe problem with the first part of Jordan's complaint is that it makes no sense because coverage of Senate hearings happens in real-time, astute Twitter users pointed out...",
    "author": "Brandon Gage",
    "title": "Jim Jordan's latest 'total bullsh*t' Twitter swipe at Ketanji Brown Jackson backfires spectacularly"
  },
  {
    "id": 2307,
    "mediaId": 2512,
    "date": "2022-03-22",
    "sentence": "Ohio Rep. <span class='selected-term'>Jim Jordan</span> (R) decided to weigh in on the public discourse as confirmation hearings were getting underway for Supreme Court nominee Ketanji Brown Jackson.",
    "author": "Timothy Evans",
    "title": "Twitter aptly reminds Jim Jordan that he holds no ethical high ground"
  },
  {
    "id": 2507,
    "mediaId": 2664,
    "date": "2022-03-22",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Rep. Jim Jordan) 1647874394\nMany of the responses to Jordan's tweet reminded the GOP congressman that his own memory isn't unassailable, specifically that his story seems constantly to be changing about how many times he spoke with former President Donald Trump on the day of the deadly Jan. 6 insurrection at the U.S. Capitol.",
    "author": "Timothy Evans",
    "title": "Jim Jordan’s own troubling history resurfaces after his 'don't forget' tweet about Brett Kavanaugh"
  },
  {
    "id": 2284,
    "mediaId": 6449,
    "date": "2022-03-30",
    "sentence": "And I’m working with [Rep.] <span class='selected-term'>Jim Jordan</span> from the Judiciary Committee on draft legislation that would remove those Section 230 provisions for the larger companies and hold them accountable for a new set of rules, while protecting those liability protections for the smaller startups, the new innovators, the Parlers, the Gettr, the Truth media of the future.",
    "author": "Virginia Allen",
    "title": "Rep. Cathy McMorris Rodgers Targets Big Tech’s Censorship of Free Speech"
  },
  {
    "id": 1259,
    "mediaId": 2662,
    "date": "2022-03-31",
    "sentence": "“Big Tech, Big Democrat Party and Big Media all colluded to keep critical information from the American people in the run up to the most important election we have — the presidential election, so we’re launching an investigation,” <span class='selected-term'>Jim Jordan</span> said.",
    "author": "Cristina Laila",
    "title": "House Judiciary Republicans Launch Investigation Into Facebook and Twitter For Blocking Links to Hunter Biden’s Laptop From Hell Story"
  },
  {
    "id": 1118,
    "mediaId": 2557,
    "date": "2022-03-31",
    "sentence": "“Big Tech, Big Democrat Party, and Big Media all colluded to keep critical information from the American people in the run-up to the most important election we have, the presidential election, so we’re launching an investigation,” said Ranking Member <span class='selected-term'>Jim Jordan</span> (R-OH) Thursday on Fox Business.",
    "author": "DML News App",
    "title": "NEWS ALERT: Judiciary GOP Investigating Facebook, Twitter for Suppressing Hunter Laptop"
  },
  {
    "id": 1119,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "In letters posted on Twitter, 10 Republicans, led by Rep. <span class='selected-term'>Jim Jordan</span>, the ranking member of the House Judiciary Committee, wrote to Facebook CEO Mark Zuckerberg and Parag Agrawal, Twitter's CEO.",
    "author": "Jeffrey Rodack",
    "title": "House Republicans Probing Big Tech 'Suppression' of Hunter Biden Laptop Story"
  },
  {
    "id": 1092,
    "mediaId": 2641,
    "date": "2022-04-01",
    "sentence": "His comments come after 10 committee Republicans, led by ranking member Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, wrote to Twitter CEO Parag Agrawal and Facebook CEO Mark Zuckerberg, quoting a 2020 article from The New York Post about Hunter Biden's laptop and noting that mainstream outlets like The Washington Post, The New York Times and others are now reporting on the matter.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Steube to Newsmax: GOP Will Win, Subpoena Big Tech on Hunter Biden"
  },
  {
    "id": 1269,
    "mediaId": 2651,
    "date": "2022-04-01",
    "sentence": "",
    "author": "Pamela Geller",
    "title": "House Judiciary launches investigation into Facebook, Twitter over Hunter Biden coverup"
  },
  {
    "id": 1296,
    "mediaId": 2766,
    "date": "2022-04-01",
    "sentence": "Signing the letter were Reps. <span class='selected-term'>Jim Jordan</span>, Steve Chabot, Louie Gohmert, Darrell Issa, Ken Buck, Matt Gaetz, Mike Johnson, Andy Biggs, Tom McClintock, W. Gregory Steube and others.",
    "author": "Bob Unruh",
    "title": "GOP Launches Review Of Facebook’s Censorship Of Hunter Biden Scandal"
  },
  {
    "id": 1601,
    "mediaId": 2833,
    "date": "2022-04-02",
    "sentence": "The letter concludes, “This irresponsible conduct demands a thorough investigation so that we may understand how Big Tech wields its enormous power over the free flow of information to the detriment of free and fair elections.”\nAppearing on Fox Business Thursday, ranking GOP Rep <span class='selected-term'>Jim Jordan</span> declared that “Big Tech, Big Democrat Party and Big Media all colluded to keep critical information from the American people in the run up to the most important election we have — the presidential election, so we’re launching an investigation.”\nWatch:",
    "author": "Sean Adl-Tabatabai",
    "title": "Congress Launches Investigation Into Facebook & Twitter for Censoring Hunter Biden Pedophile Story"
  },
  {
    "id": 1834,
    "mediaId": 2600,
    "date": "2022-04-05",
    "sentence": "",
    "author": "IWB",
    "title": "Jim Jordan comes out hot… FBI needs to answer on Hunter Biden coverup…"
  },
  {
    "id": 1250,
    "mediaId": 2745,
    "date": "2022-04-07",
    "sentence": "",
    "author": "",
    "title": "Will Elon Musk bring Trump back to Twitter?"
  },
  {
    "id": 744,
    "mediaId": 6746,
    "date": "2022-04-10",
    "sentence": "According to Ohio Republican Representative for Ohio, <span class='selected-term'>Jim Jordan</span>; he said it was a veiled attempt to take away a possible victory of Donald Trump in 2014 again, cited Florida News.",
    "author": "Ed Forster",
    "title": "January 6 Committee Driven by Political Motives To Prevent Donald Trump From a 2024 White House Bid"
  },
  {
    "id": 767,
    "mediaId": 2741,
    "date": "2022-04-14",
    "sentence": "Troy Nehls, a Texas Republican, simply wrote, “Make Twitter Great Again,” while Rep. <span class='selected-term'>Jim Jordan</span> praised Musk on Fox, painting him as the embodiment of “free speech.”\nLast Saturday, Musk rejected an offer from Twitter to join the company’s board—a move that would have barred him from acquiring a Twitter stake greater than 14.9%.",
    "author": "Caleb Ecarma",
    "title": "Right-Wingers Are Absolutely Eating Up the Idea of Elon Musk Taking Over Twitter"
  },
  {
    "id": 502,
    "mediaId": 6676,
    "date": "2022-04-14",
    "sentence": "For example, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said on Fox Business that social media platforms are “the public square today.”\n“This is where we have debate in our culture and in our country today.",
    "author": "Rebecca Klar",
    "title": "How an Elon Musk-led Twitter could change social media"
  },
  {
    "id": 248,
    "mediaId": 2818,
    "date": "2022-04-18",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) spoke with Fox News’ Jimmy Failla about billionaire Elon Musk’s bid to buy Twitter; Jordan is a big fan of the move, saying “I hope it goes through.”\n“I think this is tremendous.",
    "author": "The First",
    "title": "‘A WIN FOR THE FIRST AMENDMENT’: Jordan Says Musk Buying Twitter Would Be ‘Tremendous’"
  },
  {
    "id": 136,
    "mediaId": 2550,
    "date": "2022-04-19",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> was elevated to omnipresence when he was exposed as one of the many, many athletic coaches in America who knew his athletes were being sexually molested and worked to cover it up.",
    "author": "Hunter\nDaily Kos Staff",
    "title": "'Libs of TikTok' founder exposed: Surprise, it's just another"
  },
  {
    "id": 564,
    "mediaId": 2664,
    "date": "2022-04-21",
    "sentence": "His call for more “free speech” on Twitter is being taken up with enthusiasm by conservatives like US Reps. <span class='selected-term'>Jim Jordan</span> and Lauren Boebert, who see Musk as an ally in turning Twitter into a place where hateful and abusive speech are common and encouraged.",
    "author": "Noah Berlatsky",
    "title": "Elon Musk wants 'his speech to trump everyone else’s'"
  },
  {
    "id": 501,
    "mediaId": 2632,
    "date": "2022-04-22",
    "sentence": "\"As Congress continues to examine Big Tech and how to best protect Americans' free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk's offer to purchase Twitter, including Twitter's consideration and response to this offer, and Twitter's evaluation of its shareholder interests with respect to Musk's offer,\" said the letter, led by ranking member <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Lauren Feiner",
    "title": "House Republicans Demand Twitter's Board Preserve All Records About Musk's Bid to Buy the Company"
  },
  {
    "id": 606,
    "mediaId": 2642,
    "date": "2022-04-22",
    "sentence": "“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter, led by Ranking Member <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Missy Crane",
    "title": "GOP Just Came Out Swinging Against Twitter’s Woke Board…They’re Officially On Notice"
  },
  {
    "id": 104,
    "mediaId": 2641,
    "date": "2022-04-22",
    "sentence": "Big Tech in the Crosshairs\n\"As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,\" said the letter signed by the top Republican on the House Judiciary Committee, <span class='selected-term'>Jim Jordan</span>, and others on the committee.",
    "author": "",
    "title": "House Republicans Ask Twitter to Retain Musk Records"
  },
  {
    "id": 266,
    "mediaId": 2539,
    "date": "2022-04-22",
    "sentence": "“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter, led by ranking member <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Lauren Feiner",
    "title": "House Republicans demand Twitter’s board preserve all records about Musk’s bid to buy the company"
  },
  {
    "id": 411,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "Ranking member <span class='selected-term'>Jim Jordan</span> (R-Ohio) made the formal request to the Twitter Board Chair Bret Taylor in one of the letters.",
    "author": "Mike Miller",
    "title": "House Judiciary Republicans 'Ask' Twitter Board to Preserve Records Related to Musk Takeover Bid"
  },
  {
    "id": 289,
    "mediaId": 2924,
    "date": "2022-04-22",
    "sentence": "\"Among other things, the Board’s reactions to Elon Musk’s offer to purchase Twitter, and outsider opposition to Musk’s role in Twitter’s future are concerning,” <span class='selected-term'>Jim Jordan</span> (R-Ohio) and the other 17 lawmakers wrote.",
    "author": "Riley Gutiérrez McDermid",
    "title": "Elon Musk Bid For Twitter Gets Political As Lawmakers Demand Records"
  },
  {
    "id": 291,
    "mediaId": 2600,
    "date": "2022-04-22",
    "sentence": "According to a Friday letter seen by CNBC, House Judiciary Committee Republicans led by ranking member Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) have asked Twitter board chairman Bret Taylor to preserve any communications from both official and personal accounts – including those sent using encryption – that have anything to do with Musk’s offer.”",
    "author": "IWB",
    "title": "Amazing week we are having – Netflix shares crashing, CNN+ shutting down, Spotify removes Obama podcast, Disney stripped of special governing powers, Masks ruled unlawful on public transportation…"
  },
  {
    "id": 817,
    "mediaId": 2937,
    "date": "2022-04-22",
    "sentence": "Article content\n“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter signed by the top Republican on the House Judiciary Committee, <span class='selected-term'>Jim Jordan</span>, and others on the committee.",
    "author": "David Shepardson",
    "title": "House Republicans ask Twitter board to retain records tied to Musk offer"
  },
  {
    "id": 902,
    "mediaId": 2599,
    "date": "2022-04-22",
    "sentence": "According to a Friday letter seen by CNBC, House Judiciary Committee Republicans led by ranking member Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) have asked Twitter board chairman Bret Taylor to preserve any communications from both official and personal accounts – including those sent using encryption – that have anything to do with Musk’s offer.”",
    "author": "Glenn Reynolds",
    "title": "House Republicans Demand Twitter Board Preserve All Records Related To Musk Buyout Bid."
  }
]