[
  {
    "id": 5594,
    "mediaId": 2658,
    "date": "2022-02-10",
    "sentence": "I’m a boots-on-the-ground, actual cop.”\nAs McCarthy and his allies weigh Katko’s successor on the committee, they can look to one prominent example of a Freedom Caucus member who came into their fold: Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), a co-founder of the famously combative group.",
    "author": "",
    "title": "Freedom Caucus members square off for a plum post with all eyes on McCarthy"
  },
  {
    "id": 6232,
    "mediaId": 2580,
    "date": "2022-02-10",
    "sentence": "I’m a boots-on-the-ground, actual cop.”\nAs McCarthy and his allies weigh Katko’s successor on the committee, they can look to one prominent example of a Freedom Caucus member who came into their fold: Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), a co-founder of the famously combative group.",
    "author": "",
    "title": "Freedom Caucus members square off for a plum post with all eyes on McCarthy"
  },
  {
    "id": 3583,
    "mediaId": 2526,
    "date": "2022-03-07",
    "sentence": "I respect that.”\nBishop, who is also a member of the Judiciary Committee and good friends with ranking member Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), noted there is a “particular logic that makes sense” in the possibility of him chairing Homeland.",
    "author": "Ashley Oliver",
    "title": "Exclusive: Freedom Caucus Members Jostle for Top Post on Immigration Oversight Panel"
  },
  {
    "id": 3103,
    "mediaId": 2746,
    "date": "2022-03-14",
    "sentence": "The top Republicans on four House committees are questioning the Biden administration‘s decision to “prematurely release” a Russian cybercriminal, raising concerns that “he may now be working against U.S. interests.”\nReps. <span class='selected-term'>Jim Jordan</span> and Michael Turner, both of Ohio, and Reps. John Katko of New York and Michael McCaul of Texas fired off a letter Monday to White House National Security Adviser Jake Sullivan asking for more information as to why the administration granted Aleksei Burkov early release from U.S. custody.",
    "author": "Seth McLaughlin",
    "title": "Republicans raise questions about U.S. release of Russian cybercriminal"
  },
  {
    "id": 3338,
    "mediaId": 2656,
    "date": "2022-03-15",
    "sentence": "Judiciary Committee Ranking Member <span class='selected-term'>Jim Jordan</span> (R-Ohio), Intelligence Committee Ranking Member Michael Turner (R-Ohio), Homeland Security Committee Ranking Member John Katko (R-N.Y.), and Foreign Affairs Committee Ranking Member Michael McCaul (R-Texas), sent a letter to Joe Biden’s National Security Advisor Jake Sullivan looking for answers.",
    "author": "Matt Margolis",
    "title": "Biden Released a Top Russian Hacker, and Republicans Have Questions"
  }
]