[
  {
    "id": 6789,
    "mediaId": 2614,
    "date": "2022-01-15",
    "sentence": "",
    "author": "Red Voice Media",
    "title": "VA Governor Youngkin’s First Day, Signs Executive Orders Banning CRT And Investigating Loudon County Officials"
  },
  {
    "id": 6843,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "House Minority Leader Rep. Kevin McCarthy submitted his choices — and she rejected two of them, Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "STATION GOSSIP",
    "title": "New Virginia AG Makes Huge Move, Fires Woke University Lawyers, Including One Working on Jan. 6 Commission"
  },
  {
    "id": 5531,
    "mediaId": 2643,
    "date": "2022-02-08",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> has questioned why the House Select Committee investigating the January 6 attack has more than a dozen former prosecutors and attorneys on its panel when it is not a criminal inquiry.",
    "author": "Ewan Palmer",
    "title": "Jim Jordan Rails Against Jan. 6 Committee Having So Many Prosecutors"
  },
  {
    "id": 5500,
    "mediaId": 2641,
    "date": "2022-02-08",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Tuesday that conservatives have a lot of reasons to be confident in a red wave this November, but warned never to be overconfident.",
    "author": "Jeremy Frankel",
    "title": "Rep. Jordan to Newsmax: Be Confident of Red Wave, but Not Overconfident"
  },
  {
    "id": 5467,
    "mediaId": 2572,
    "date": "2022-02-10",
    "sentence": "",
    "author": "",
    "title": "Canada’s trucker protests and history’s parallels"
  },
  {
    "id": 5182,
    "mediaId": 2629,
    "date": "2022-02-18",
    "sentence": "Asked last year by the website Ballotpedia which representatives he wanted to model himself after, Bell named white-nationalist-linked Rep. Paul Gosar (R-AZ) and conspiracy theorist Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Josh Israel",
    "title": "Anti-Semitic, Homophobic Conspiracist Challenging Rep. Luria In Virginia"
  },
  {
    "id": 3461,
    "mediaId": 2764,
    "date": "2022-03-18",
    "sentence": "“This is what the Democrats are focused on,” said Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Joshua Espinoza",
    "title": "U.S. House Passes CROWN Act to Ban Race-Based Hair Discrimination"
  }
]