[
  {
    "id": 6852,
    "mediaId": 2605,
    "date": "2022-01-19",
    "sentence": "“And my guess is those who support it will regret it when people like [Ohio] Congressman <span class='selected-term'>Jim Jordan</span> get the gavel and then decide to use that same authority on them.”\nFor McCarthy, there’s little political incentive to appear before the committee.",
    "author": "Arit John",
    "title": "Will Jan. 6 committee subpoena McCarthy? Congress could set up a political and legal showdown"
  },
  {
    "id": 6570,
    "mediaId": 2634,
    "date": "2022-01-24",
    "sentence": "If the Republicans retake the House this November, the chairman of the Judiciary Committee is going to be <span class='selected-term'>Jim Jordan</span>.",
    "author": "Michael Tomasky",
    "title": "The Case for Impeaching Clarence Thomas"
  },
  {
    "id": 6904,
    "mediaId": 2636,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Alan Feuer",
    "title": "Stewart Rhodes, Oath Keepers Leader, Is Denied Bail on Sedition Charge"
  },
  {
    "id": 6421,
    "mediaId": 2550,
    "date": "2022-01-30",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> of Ohio is one of the very worst Republicans, and that is saying something.",
    "author": "",
    "title": "Republicans see masks and vaccines as stifling freedom, but it's actually the best way to restore it"
  },
  {
    "id": 6638,
    "mediaId": 2636,
    "date": "2022-01-31",
    "sentence": "",
    "author": "",
    "title": "Former Pence Chief of Staff Has Testified to the Jan. 6 Committee"
  },
  {
    "id": 6809,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Kinzinger and Cheney are the only two Republicans serving on the January 6 committee after McCarthy withdrew his slate of members during negotiations over the panel’s configuration and House Speaker Nancy Pelosi denied seats on the panel to ultra-conservative Reps. Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio – both of whom objected to congressional certification of the election results from two states on January 6, 2021.",
    "author": "Gabby Orr",
    "title": "Proposal to endorse removing Cheney and Kinzinger from House GOP Conference gets more than 50 RNC co-sponsors"
  },
  {
    "id": 6301,
    "mediaId": 2629,
    "date": "2022-02-05",
    "sentence": "Records that former President Donald Trump attempted to hide from public scrutiny have now revealed that he spoke on the phone with Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) on Jan. 6, 2021.",
    "author": "Oliver Willis",
    "title": "Records Trump Tried To Hide Reveal Call To Jim Jordan Before Capitol Attack"
  },
  {
    "id": 6174,
    "mediaId": 2808,
    "date": "2022-02-06",
    "sentence": "House Speaker Nancy Pelosi last year vetoed putting Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Rep. Jim Banks, R-Ind., on the panel, so House Minority Leader Kevin McCarthy pulled his three other GOP picks, leaving Pelosi free to tap Kinzinger and Cheney.",
    "author": "",
    "title": "RNC censure of Kinzinger, Cheney could backfire for Illinois Republicans"
  },
  {
    "id": 6232,
    "mediaId": 2580,
    "date": "2022-02-10",
    "sentence": "I’m a boots-on-the-ground, actual cop.”\nAs McCarthy and his allies weigh Katko’s successor on the committee, they can look to one prominent example of a Freedom Caucus member who came into their fold: Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), a co-founder of the famously combative group.",
    "author": "",
    "title": "Freedom Caucus members square off for a plum post with all eyes on McCarthy"
  },
  {
    "id": 5658,
    "mediaId": 2569,
    "date": "2022-02-11",
    "sentence": "Explicitly named in the minute-long spot are House Minority Leader Kevin McCarthy, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, and Rep. Marjorie Taylor Greene of Georgia.",
    "author": "",
    "title": "Lincoln Project ad goes for gold, skewers Republicans in ‘Coward Olympics’"
  },
  {
    "id": 3833,
    "mediaId": 2658,
    "date": "2022-02-25",
    "sentence": "I’m going to side with the <span class='selected-term'>Jim Jordan</span>s — the tip of the spear in Washington.”\nAnother consideration for McCarthy, as he makes a play for the speakership, is who will support him and who could threaten his push to secure the role next January if Republicans retake the House.",
    "author": "",
    "title": "The primary foreshadowing the future of the GOP"
  },
  {
    "id": 4171,
    "mediaId": 4024,
    "date": "2022-03-01",
    "sentence": "WASHINGTON, D.C. (LifeSiteNews) — Republican U.S. Rep. <span class='selected-term'>Jim Jordan</span> of Ohio says investigations into Dr. Anthony Fauci and the Centers for Disease Control (CDC) need to become a top priority if Republicans get control of the House after the 2022 midterm elections.",
    "author": "Jack\nBingham",
    "title": "Jim Jordan says investigating Fauci a priority if GOP controls House after midterm election"
  },
  {
    "id": 3027,
    "mediaId": 2557,
    "date": "2022-03-09",
    "sentence": "Promoted Content\nRep. <span class='selected-term'>Jim Jordan</span>, an Ohio Republican and ranking member of the House Judiciary Committee, sent a letter to FBI Director Christopher Wray on Wednesday saying this “whistleblower disclosure” revealed that the FBI’s Washington Field Office asked FBI field offices last month to canvass all confidential human sources nationwide for relevant information.",
    "author": "DML News App",
    "title": "REPORT: Jim Jordan seeks FBI briefing after ‘whistleblower disclosure’ on DC pipe bomb investigation"
  },
  {
    "id": 3403,
    "mediaId": 2748,
    "date": "2022-03-10",
    "sentence": "— Jordan Schachtel @ dossier.substack.com (@JordanSchachtel) January 15, 2021\nOhio Republican lawmaker <span class='selected-term'>Jim Jordan</span> said he has requested a briefing with the FBI after a whistleblower allegedly disclosed information regarding the bureau’s investigation into pipe bombs planted near the Democratic National Committee and Republican National Committee headquarters in Washington the night before the Jan. 6 breach of the U.S. Capitol.",
    "author": "",
    "title": "Is The January 6th Pipe Bomb Investigation Another F.B.I. False Flag?"
  },
  {
    "id": 3319,
    "mediaId": 2748,
    "date": "2022-03-10",
    "sentence": "Washington – Ranking Member <span class='selected-term'>Jim Jordan</span> sent a letter to FBI Director Christopher Wray following a new whistleblower disclosure from a senior FBI special agent concerning the investigation into the pipe bombs placed near the headquarters of the DNC and RNC on January 5, 2021.",
    "author": "Blarp Blog",
    "title": "FBI Whistleblower raises questions about Jan 6 pipebomb investigation…"
  },
  {
    "id": 3265,
    "mediaId": 2748,
    "date": "2022-03-12",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) sent a letter to FBI Director Chris Wray on Wednesday regarding the investigation of the DC pipe bomber on January 5, 2021.",
    "author": "STATION GOSSIP",
    "title": "BREAKING: FBI Whistle-Blower Steps Forward to Reveal Secrets on DC Pipe Bombs to Jim Jordan – FBI Is Withholding Information"
  },
  {
    "id": 3180,
    "mediaId": 2578,
    "date": "2022-03-12",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) sent a letter to FBI Director Chris Wray on Wednesday regarding the investigation of the DC pipe bomber on January 5, 2021.",
    "author": "Jim Hoft",
    "title": "BREAKING: FBI Whistle-Blower Steps Forward to Reveal Secrets on DC Pipe Bombs to Jim Jordan – FBI Is Withholding Information"
  },
  {
    "id": 3406,
    "mediaId": 2614,
    "date": "2022-03-17",
    "sentence": "WASHINGTON, DC – Rep. <span class='selected-term'>Jim Jordan</span> went on a tirade on the House floor earlier in March while calling out a bill that he said would “codify” the Biden administration’s past efforts to label parents attending school board meetings as being potential domestic terrorists.",
    "author": "Red Voice Media",
    "title": "Jim Jordan Calls Out Dems Trying To “Codify” Past Efforts To Label Parents Domestic Terrorists [VIDEO]"
  },
  {
    "id": 3233,
    "mediaId": 5119,
    "date": "2022-03-18",
    "sentence": "\"Fourteen months of chaos and we're doing a bill on hair,\" Republican Rep. <span class='selected-term'>Jim Jordan</span> of Ohio said Friday, adding, \"I hope we can actually focus on the things that matter to the American people.\"",
    "author": "",
    "title": "Congress passes CROWN Act banning race-based hair discrimination"
  },
  {
    "id": 3461,
    "mediaId": 2764,
    "date": "2022-03-18",
    "sentence": "“This is what the Democrats are focused on,” said Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Joshua Espinoza",
    "title": "U.S. House Passes CROWN Act to Ban Race-Based Hair Discrimination"
  },
  {
    "id": 3490,
    "mediaId": 2747,
    "date": "2022-03-18",
    "sentence": "\"Fourteen months of chaos and we're doing a bill on hair,\" Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, said Friday, adding, \"I hope we can actually focus on the things that matter to the American people.\"",
    "author": "",
    "title": "Legislation prohibiting discrimination against Black hair passed by House"
  },
  {
    "id": 2854,
    "mediaId": 2526,
    "date": "2022-03-18",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) March 17, 2022\nLast week, the TSA announced the decision to extend the mask mandate — which was set to expire Friday, March 18 — another month.",
    "author": "Hannah Bleau",
    "title": "Jim Jordan: ‘End’ the TSA Mask Mandate"
  },
  {
    "id": 2922,
    "mediaId": 5118,
    "date": "2022-03-18",
    "sentence": "\"Fourteen months of chaos and we're doing a bill on hair,\" Republican Rep. <span class='selected-term'>Jim Jordan</span> of Ohio said Friday, adding, \"I hope we can actually focus on the things that matter to the American people.\"",
    "author": "",
    "title": "Congress passes CROWN Act banning race-based hair discrimination"
  },
  {
    "id": 2436,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Melanie Zanona",
    "title": "Leaning on her Trump ties, Elise Stefanik plots future inside House GOP"
  },
  {
    "id": 2362,
    "mediaId": 2509,
    "date": "2022-03-29",
    "sentence": "Trump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other lawmakers.",
    "author": "MARY CLARE JALONICK",
    "title": "8-hour gap in Trump's Jan. 6 White House phone records"
  },
  {
    "id": 2216,
    "mediaId": 2699,
    "date": "2022-03-29",
    "sentence": "“I don’t know anything about what Madison referenced,” said Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), a leader of the right-most flank of the conference that includes Cawthorn.",
    "author": "Sam Brodey",
    "title": "Angry GOP Responds to Cawthorn’s ‘Bizarre’ D.C. Orgy Claims: ‘Name Names’"
  },
  {
    "id": 2639,
    "mediaId": 2862,
    "date": "2022-03-29",
    "sentence": "Conservatives have pointed out that the FBI’s investigation into the 6 January events found no evidence of a conspiracy and also the Select Committee had refused to include lawmakers such as Congressman <span class='selected-term'>Jim Jordan</span> that would be critical of its activities and narrative.",
    "author": "",
    "title": "Trump Denies Use of 'Burner Phone' on 6 Jan. as Seven-Hour Gap in Phone Logs Raises Questions"
  },
  {
    "id": 1097,
    "mediaId": 2745,
    "date": "2022-03-31",
    "sentence": "“When you actually run on a platform, here’s what we care about, here’s what we’re going to do because the American people care about that —- that will help keep the team together and accomplishing what we told the people we were going to do when we ran for the job and the reason why they’re gonna put us in the majority and make Kevin speaker,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said last Friday in Ponte Vedra, Fla.\nFor Sen. Thom Tillis (R-N.C.) Cawthorn’s latest comments were not the tipping point for him.",
    "author": "",
    "title": "McCarthy tries to navigate splintering divide among House Republicans"
  },
  {
    "id": 1331,
    "mediaId": 2727,
    "date": "2022-03-31",
    "sentence": "(Senate Television via AP)\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "Colleen Long",
    "title": "A minute-by-minute of Trump’s 8-hour gap during the storming of the US Capitol"
  },
  {
    "id": 1272,
    "mediaId": 2714,
    "date": "2022-03-31",
    "sentence": "Trump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "",
    "title": "Trump's 8-hour gap: Minute-by-minute during January 6 riot"
  },
  {
    "id": 1396,
    "mediaId": 5329,
    "date": "2022-03-31",
    "sentence": "By her account, when McCarthy told Trump it was his own supporters breaking into the building, Trump responded: “Well, Kevin, I guess these people are more upset about the election than you are.”\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "Colleen Long",
    "title": "Trump’s 8-hour gap: Minute-by-minute during Jan. 6 riot"
  },
  {
    "id": 1275,
    "mediaId": 2514,
    "date": "2022-04-01",
    "sentence": "By her account, when McCarthy told Trump it was his own supporters breaking into the building, Trump responded: “Well, Kevin, I guess these people are more upset about the election than you are.”\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "",
    "title": "Trump's 8-hour gap: Minute-by-minute during Jan. 6 riot"
  },
  {
    "id": 1315,
    "mediaId": 2679,
    "date": "2022-04-01",
    "sentence": "Advertising\n Skip AdSkip AdSkip Ad\n“The left will not let the Democrats do what needs to be done with the inflation problem, the energy problem, the illegal immigration problem on the southern border,” said Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, the senior Republican on the House Judiciary Committee.",
    "author": "Jonathan Weisman",
    "title": "House votes to decriminalize cannabis"
  },
  {
    "id": 1670,
    "mediaId": 2644,
    "date": "2022-04-01",
    "sentence": "Bill sponsor Rep. Jerry Nadler (D-NY) urged colleagues to support the MORE Act, saying Friday, “This bill will greatly reduce crime by redefining as not crimes things that are now considered crimes and by releasing people in jail who should not be in jail.”\nBut Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said Democrats called the vote because they “can’t deal” with other problems, such as inflation and illegal immigration, both at four-decade highs.",
    "author": "Steven Nelson",
    "title": "House votes to legalize marijuana despite Biden opposition"
  },
  {
    "id": 991,
    "mediaId": 2636,
    "date": "2022-04-01",
    "sentence": "“The left will not let the Democrats do what needs to be done with the inflation problem, the energy problem, the illegal immigration problem on the southern border,” said Representative <span class='selected-term'>Jim Jordan</span> of Ohio, the senior Republican on the Judiciary Committee.",
    "author": "",
    "title": "House Votes to Decriminalize Cannabis"
  },
  {
    "id": 1717,
    "mediaId": 4032,
    "date": "2022-04-06",
    "sentence": "Senator James Lankford (R-Okla.) and U.S. Representative <span class='selected-term'>Jim Jordan</span> (R-Ohio), along with 21 of their congressional colleagues, signed an April 5 letter to D.C. Mayor Muriel Bowser and metropolitan police chief Robert J. Contee about the remains.",
    "author": "Rebecca Terrell",
    "title": "U.S. Legislators Demand #JusticeForTheFive"
  },
  {
    "id": 1291,
    "mediaId": 2685,
    "date": "2022-04-07",
    "sentence": "Trump said that he remembered talking to House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and other people during that period.",
    "author": "Josh Dawsey Washington Post",
    "title": "Trump deflects blame for Jan. 6 silence, says he wanted to march to Capitol"
  },
  {
    "id": 1423,
    "mediaId": 2672,
    "date": "2022-04-07",
    "sentence": "The former president, who may have violated the Presidential Records Act, claims he didn’t destroy any call logs or speak on “burner phones.” But he said he did remember talking to House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), and others during that time.",
    "author": "William Vaillancourt",
    "title": "Trump Says He Wanted to March to Capitol on Jan. 6, Blames Everyone But Himself for Carnage"
  },
  {
    "id": 907,
    "mediaId": 2630,
    "date": "2022-04-10",
    "sentence": "She rejected two of McCarthy’s five picks for the panel — GOP Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Jim Banks of Indiana — saying they had made statements that could jeopardize the “integrity of the election.”\nPelosi told McCarthy she would seat the three other Republicans — Rodney Davis of Illinois, Kelly Armstrong of North Dakota and Troy Nehls of Texas — and suggested that he pick two others.",
    "author": "Scott Wong",
    "title": "McCarthy's Jan. 6 committee gamble faces big test this spring"
  },
  {
    "id": 874,
    "mediaId": 3987,
    "date": "2022-04-22",
    "sentence": "Republicans are:\nAdvancing ugly tropes that demonize asylum seekers as criminals: As the New York Times details, Republican Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) has prepared an ugly memo for colleagues advancing the age old “immigrants as criminals and threats” trope: the “60-page guidance memo includes misleading and provocative talking points that seek to portray migrants and refugees as perpetrators of gruesome crimes, especially those involving sexual assault, echoing the language that former President Donald J. Trump used to denigrate immigrants.”\nPromoting the corrupt border wall.",
    "author": "AV Press Releases",
    "title": "GOP Keeps Showing Us Who They Are on Immigration. How Will Democrats Respond?"
  },
  {
    "id": 817,
    "mediaId": 2937,
    "date": "2022-04-22",
    "sentence": "Article content\n“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter signed by the top Republican on the House Judiciary Committee, <span class='selected-term'>Jim Jordan</span>, and others on the committee.",
    "author": "David Shepardson",
    "title": "House Republicans ask Twitter board to retain records tied to Musk offer"
  },
  {
    "id": 319,
    "mediaId": 2685,
    "date": "2022-04-22",
    "sentence": "",
    "author": "LISA MASCARO",
    "title": "McCarthy, Trump have 'positive' call despite Jan. 6 audio"
  },
  {
    "id": 404,
    "mediaId": 2685,
    "date": "2022-04-22",
    "sentence": "On those calls, according to Hutchinson, were representatives from Trump's legal team, including Rudy Giuliani, Jenna Ellis and Sidney Powell, as well as Reps. <span class='selected-term'>Jim Jordan</span> and Scott Perry.",
    "author": "FARNOUSH AMIRI and ERIC TUCKER Associated Press",
    "title": "Official: Meadows had been warned of possible 1/6 violence"
  },
  {
    "id": 556,
    "mediaId": 5117,
    "date": "2022-04-22",
    "sentence": "He has tried to temper his closest rivals, Rep. Steve Scalise of Louisiana and Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, even as he works to shore up the votes that would be needed to become speaker.",
    "author": "",
    "title": "Audio reveals GOP leader Kevin McCarthy planned to urge Trump to resign after Jan. 6 attack"
  }
]