[
  {
    "id": 3634,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "The public has met a series of other players: Philip Waldron, an Army veteran turned cybersecurity investigator; the businessman Russell Ramsland; the Overstock.com founder Patrick Byrne; the professional bad penny Bernard Kerik; and members of Congress such as Representative <span class='selected-term'>Scott Perry</span> of Pennsylvania.\"",
    "author": "Bob Brigham",
    "title": "‘Bumbling consigliere’ Giuliani exposed dozens of seasoned GOP operatives to legal liability: report"
  },
  {
    "id": 3440,
    "mediaId": 2644,
    "date": "2022-01-29",
    "sentence": "“I certainly do think it presents a conflict of interest, and I don’t know how anybody can realistically … tell me how this is essentially different from insider trading,” Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.) told The Post.",
    "author": "Conor Skelding",
    "title": "These woke pols want student loans forgiven — including their own"
  },
  {
    "id": 3273,
    "mediaId": 2630,
    "date": "2022-02-01",
    "sentence": "Last week, The Dispatch reported that House Minority Leader Kevin McCarthy, R-Calif., had pushed back on an effort from Freedom Caucus Chairman <span class='selected-term'>Scott Perry</span>, R-Pa., to boot Cheney from the conference because doing so could lead to Republicans losing committee seats.",
    "author": "",
    "title": "RNC to debate endorsing ouster of Cheney, Kinzinger from House GOP"
  },
  {
    "id": 2768,
    "mediaId": 2592,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Nicholas Morgan",
    "title": "Donald Trump vs. Republicans: Former President Slams Lindsey Graham Over Comments About Jan. 6 Rioters"
  },
  {
    "id": 3246,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-PA), Chairman of the House Freedom Caucus, blasted Biden immigration policies during a recent appearance on Breitbart News Saturday, noting that bureaucrats are “flying unaccompanied aliens in the dead of night right into our cities” as the Biden administration essentially forces U.S. tax dollars to go toward human trafficking.",
    "author": "Hannah Bleau",
    "title": "Poll: Majority Say Biden’s Immigration Policy ‘Worse’ than Trump’s"
  },
  {
    "id": 2536,
    "mediaId": 2629,
    "date": "2022-02-04",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (Pennsylvania)\nPerry signed onto multiple congressional letters touting ivermectin as a safer way to address COVID-19 than vaccinations.",
    "author": "Josh Israel",
    "title": "Meet The GOP's 2022 Covid Misinformation Superspreaders"
  },
  {
    "id": 2520,
    "mediaId": 2540,
    "date": "2022-02-04",
    "sentence": "\"We are all on the same page,\" said Rep. <span class='selected-term'>Scott Perry</span>, a Pennsylvania Republican who chairs the group.",
    "author": "Melanie Zanona",
    "title": "McCarthy in bind as conservatives push GOP to oust Cheney in her primary"
  },
  {
    "id": 2631,
    "mediaId": 2745,
    "date": "2022-02-09",
    "sentence": "When it became clear Rosen would not go along, either, Trump told Jeffrey Clark — who was a mid-level Justice Department official introduced to Trump by Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.) and had indicated a willingness to assist — that he would elevate him to acting attorney general.",
    "author": "",
    "title": "All the ways Trump tried to overturn the election — and how it could happen again"
  },
  {
    "id": 1359,
    "mediaId": 8254,
    "date": "2022-02-16",
    "sentence": "This story has been updated to reflect that Congressman <span class='selected-term'>Scott Perry</span> was not subpoenaed by the committee, which did request information from him and he refused.",
    "author": "Dennis Owens",
    "title": "Mastriano mute for the moment on Jan. 6 subpoena"
  },
  {
    "id": 5,
    "mediaId": 2573,
    "date": "2022-02-21",
    "sentence": "Continue reading …\n<span class='selected-term'>SCOTT PERRY</span> AND DAVID MCINTOSH - President Biden’s approval rate is in a freefall, plunging to an all-time low of 33%, and Democrats are on the precipice of losing both the House and Senate.",
    "author": "Jack Durschlag",
    "title": "Last-ditch Ukraine summit"
  },
  {
    "id": 54,
    "mediaId": 2526,
    "date": "2022-02-22",
    "sentence": "https://t.co/sJfnDJXgCj\n— Chip Roy (@chiproytx) February 20, 2022\nThe Freedom Caucus chair, Rep. <span class='selected-term'>Scott Perry</span> (R-PA), also condemned the event’s coronavirus rules, saying in a statement to Breitbart News, “The arbitrary and capricious rules set forth are nothing short of farce and political theater meant to deeply divide and further distract from a president who just never fails to fail.” The Pennsylvania Republican has not publicly made a decision on if he will attend.",
    "author": "Ashley Oliver",
    "title": "Cotton, Rubio Among Those Planning to Boycott Joe Biden’s State of the Union"
  },
  {
    "id": 79,
    "mediaId": 2658,
    "date": "2022-02-23",
    "sentence": "Two are held by GOP Reps. Brian Fitzpatrick and <span class='selected-term'>Scott Perry</span>, another two are held by Democratic Reps. Susan Wild and Matt Cartwright, and a fifth swing district is the open Pittsburgh-area seat that Democratic Rep. Conor Lamb is vacating to run for Senate.",
    "author": "",
    "title": "State courts shake up Pennsylvania, North Carolina with new House lines"
  },
  {
    "id": 28,
    "mediaId": 2551,
    "date": "2022-02-24",
    "sentence": "'America's incompetent right now,' said TV host Ben Ferguson as he warned that adversaries were taking advantage\n+19\nView gallery\nFormer President Trump called into Fox News on Wednesday to claim the attack would not have happened on his watch\nRep <span class='selected-term'>Scott Perry</span> was among the Republicans who took to Twitter to blast Biden for Putin's aggression in Ukraine\nOthers warned that America's allies were watching what was unfolding and see American weakness on the world stage\n+19\nView gallery\nA steady stream of Republicans tweeted their anger at Biden and warned that the country's enemies would be watching.",
    "author": "Morgan Phillips",
    "title": "Republicans criticize Biden for admitting he 'knew' about Russia's invasion of Ukraine for months but still 'did nothing' and not sanctioning Putin personally is a 'big mistake'"
  },
  {
    "id": 554,
    "mediaId": 2564,
    "date": "2022-02-24",
    "sentence": "'America's incompetent right now,' said TV host Ben Ferguson as he warned that adversaries were taking advantage\n+19\nView gallery\nFormer President Trump called into Fox News on Wednesday to claim the attack would not have happened on his watch\nRep <span class='selected-term'>Scott Perry</span> was among the Republicans who took to Twitter to blast Biden for Putin's aggression in Ukraine\nOthers warned that America's allies were watching what was unfolding and see American weakness on the world stage\n+19\nView gallery\nA steady stream of Republicans tweeted their anger at Biden and warned that the country's enemies would be watching.",
    "author": "Morgan Phillips",
    "title": "Republicans criticize Biden for admitting he 'knew' about Russia's invasion of Ukraine for months but still 'did nothing' and not sanctioning Putin personally is a 'big mistake'"
  },
  {
    "id": 107,
    "mediaId": 2551,
    "date": "2022-02-24",
    "sentence": "'America's incompetent right now,' said TV host Ben Ferguson as he warned that adversaries were taking advantage\n+20\nView gallery\nFormer President Trump called into Fox News on Wednesday to claim the attack would not have happened on his watch\n+20\nView gallery\nRep <span class='selected-term'>Scott Perry</span> was among the Republicans who took to Twitter to blast Biden for Putin's aggression in Ukraine\n+20\nView gallery\nOthers warned that America's allies were watching what was unfolding and see American weakness on the world stage\n+20\nView gallery\nA steady stream of Republicans tweeted their anger at Biden and warned that the country's enemies would be watching.",
    "author": "",
    "title": "'This is what happens when America’s enemies see a weak and incompetent President': Scores of Republicans join calls that Biden is 'unfit' and responsible for letting Putin invade Ukraine"
  },
  {
    "id": 120,
    "mediaId": 8484,
    "date": "2022-02-24",
    "sentence": "'As we pray for the Ukrainian people, make no mistake: THIS is what happens when America’s enemies see a weak and incompetent @POTUS,' tweeted U.S. Rep. <span class='selected-term'>Scott Perry</span>, adding the hashtag Bidenisafailure.",
    "author": "",
    "title": "Trump's deputy national security adviser says Putin can do 'whatever he wants' with oil at $100 a barrel and Russia was hamstrung when it was $40 under her administration"
  },
  {
    "id": 292,
    "mediaId": 8484,
    "date": "2022-02-24",
    "sentence": "'America's incompetent right now,' said TV host Ben Ferguson as he warned that adversaries were taking advantage\n+20\nView gallery\nFormer President Trump called into Fox News on Wednesday to claim the attack would not have happened on his watch\n+20\nView gallery\nRep <span class='selected-term'>Scott Perry</span> was among the Republicans who took to Twitter to blast Biden for Putin's aggression in Ukraine\n+20\nView gallery\nOthers warned that America's allies were watching what was unfolding and see American weakness on the world stage\n+20\nView gallery\nA steady stream of Republicans tweeted their anger at Biden and warned that the country's enemies would be watching.",
    "author": "",
    "title": "'This is what happens when America’s enemies see a weak and incompetent President': Scores of Republicans join calls that Biden is 'unfit' and responsible for letting Putin invade Ukraine"
  },
  {
    "id": 12664,
    "mediaId": 2732,
    "date": "2022-02-28",
    "sentence": "U.S. Rep. <span class='selected-term'>Scott Perry</span> has just vanquished one major potential foe in his quest for a 6th term in Congress, as former Pennsylvania Auditor General Eugene DePasquale has decided not to seek a rematch of their 2020 race.",
    "author": "",
    "title": "Eugene DePasquale will not oppose U.S. Rep. Scott Perry in the 10th Congressional District race"
  },
  {
    "id": 12508,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "He continued to invoke the Fifth Amendment, including to questions about meeting with Corey Lewandowski, Arizona House Speaker Rusty Bowers, DOJ official Jeffrey Clark, Rep. <span class='selected-term'>Scott Perry</span> (R-PA), Sen. Josh Hawley (R-MO), Sen. Ted Cruz (R-TX) and \"any other members of Congress.\"",
    "author": "Bob Brigham",
    "title": "John Eastman invoked 5th Amendment to questions of whether he publicly lied about Trump"
  },
  {
    "id": 9104,
    "mediaId": 2573,
    "date": "2022-03-25",
    "sentence": "PONTE VEDRA, Fla. – Republican Rep. <span class='selected-term'>Scott Perry</span>, who sits on the House Foreign Affairs Committee, told Fox News Digital that \"weakness is provocative,\" warning that President Biden is not equipped to handle the issues at hand during this \"very dangerous and concerning time.\"",
    "author": "Brooke Singman",
    "title": "GOP Rep. Scott Perry says 'weakness is provocative,' warns Biden foreign policy 'encourages' adversaries"
  },
  {
    "id": 9413,
    "mediaId": 2574,
    "date": "2022-03-28",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R., Pa.), a member of the House Foreign Affairs Committee, and six of his congressional colleagues are requesting that VOA and its Persian News Network turn over all internal documents and communications related to its decision to rehire Setareh Derakhshesh Sieg to lead the agency's Iran coverage.",
    "author": "Adam Kredo",
    "title": "Republicans Investigate VOA for Biased Coverage of Iran, Advocacy for Biden"
  },
  {
    "id": 9027,
    "mediaId": 2641,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span>, R-Pa., is the U.S. congressman for Pennsylvania's 10th congressional district.",
    "author": "Rep. Scott Perry",
    "title": "Rep. Perry: Time for US to Rediscover 'Peace Through Strength' and 'Trust but Verify'"
  },
  {
    "id": 10255,
    "mediaId": 2723,
    "date": "2022-03-30",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-PA) (photo), who has been asked by the January 6 Committee to testify but has refused, told Politico’s Olivia Beavers, “I think it is important, if you’re going to say something like that, to name some names.”\nTuesday Beavers also reported that House Republican Minority Leader Kevin McCarthy had wanted to speak with Cawthorn about the allegations – not to start any type of investigation, but because some Republicans said they were “upset” Cawthorn made the claim.",
    "author": "David Badash",
    "title": "‘Name Names’: House Freedom Caucus Chair Demands Cawthorn Reveal Who Invited Him to Coke-Fueled Orgy Parties"
  },
  {
    "id": 9691,
    "mediaId": 2514,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Dave Goldiner",
    "title": "Rep. Madison Cawthorn admits lying about cocaine and orgies after tongue-lashing from GOP leaders"
  },
  {
    "id": 7401,
    "mediaId": 2574,
    "date": "2022-04-04",
    "sentence": "Reps. Brian Mast (R., Fla.) and <span class='selected-term'>Scott Perry</span> (R., Pa.) introduced on Monday the Preventing Terror Sympathizers from Appeasing Terrorists Act, a bill that would block the White House from delisting the IRGC from the Foreign Terrorist Organizations (FTO) list without congressional approval.",
    "author": "Adam Kredo",
    "title": "Republicans Want To Bar Biden Admin From Lifting Sanctions on Iran-Sponsored Terrorists"
  },
  {
    "id": 7640,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Voters can still save the country, but Democrats have to help them\nDaily Kos' The Brief\nFollowShare\n0:0058:38\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nA quick search for the legislation revealed those 10 lawmakers’ names: Rep. August Pfluger of Texas, Rep. Jake Ellzey of Texas, Rep. Brian Mast of Florida, Rep. Alexander Mooney of West Virginia, Rep. Adrian Smith of Nebraska, Rep. Tom McClintock of California, Rep. Yvette Herrell of New Mexico, Rep. Jefferson Van Drew of New Jersey, Rep. <span class='selected-term'>Scott Perry</span> of Pennsylvania, and Rep.",
    "author": "",
    "title": "GOP introduces bill forbidding Biden from potentially declaring climate change the threat that it is"
  },
  {
    "id": 5485,
    "mediaId": 2548,
    "date": "2022-04-21",
    "sentence": "Read the letter here:\nPennsylvania Rep. <span class='selected-term'>Scott Perry</span>, Florida Rep. Bill Posey, and Texas Rep. Randy Weber also signed the letter.",
    "author": "",
    "title": "EXCLUSIVE: House Republicans Call On Biden Admin To End Rule Causing Higher Gas, Corn Prices"
  },
  {
    "id": 4697,
    "mediaId": 8380,
    "date": "2022-04-23",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span>, R-Pa., was texting Meadows as early as Dec. 26, 2020: “Mark, just checking in as time continues to count down.",
    "author": "Farnoush Amiri",
    "title": "Official: Meadows Had Been Warned of Possible 1/6 Violence"
  },
  {
    "id": 4712,
    "mediaId": 8469,
    "date": "2022-04-23",
    "sentence": "Pennsylvania Rep. <span class='selected-term'>Scott Perry</span> was texting Meadows as early as Dec. 26: “Mark, just checking in as time continues to count down.",
    "author": "FARNOUSH AMIRI",
    "title": "Official: Meadows had been warned of possible 1/6 violence"
  },
  {
    "id": 4917,
    "mediaId": 2664,
    "date": "2022-04-23",
    "sentence": "\"In addition, Mr. Meadows communicated repeatedly by text with Congressman <span class='selected-term'>Scott Perry</span> regarding a plan to replace Department of Justice leadership in the days before January 6th.\"",
    "author": "Sarah K. Burris",
    "title": "Secret Service warned the White House of Capitol violence two days before the attack — Trump ignored it: court filing"
  },
  {
    "id": 4977,
    "mediaId": 2621,
    "date": "2022-04-23",
    "sentence": "“It’s just unreal.”\nACOSTA: According to this new court filing from the Jan. six committee, an aide to Mark Meadows told the committee that she heard Republican Congressman <span class='selected-term'>Scott Perry</span> talking about this idea of sending people to the Capitol on January sixth.",
    "author": "Caleb Howe",
    "title": "Michael Fanone Savages Kevin McCarthy After Jan. 6 Audio Released: ‘Potentially Being Speaker Way More Important’ to Him Than Democracy"
  }
]