[
  {
    "id": 3246,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-PA), Chairman of the House Freedom Caucus, blasted Biden immigration policies during a recent appearance on Breitbart News Saturday, noting that bureaucrats are “flying unaccompanied aliens in the dead of night right into our cities” as the Biden administration essentially forces U.S. tax dollars to go toward human trafficking.",
    "author": "Hannah Bleau",
    "title": "Poll: Majority Say Biden’s Immigration Policy ‘Worse’ than Trump’s"
  },
  {
    "id": 1997,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span>, the new chairman of the conservative House Freedom Caucus, is pushing Republican leaders to gut federal agencies of what he says are partisan hacks who dominate middle management throughout Washington.",
    "author": "Kerry Picket",
    "title": "Cleanup of Washington’s partisan bureaucracy emerges as top priority for House Freedom Caucus"
  },
  {
    "id": 13541,
    "mediaId": 8254,
    "date": "2022-03-16",
    "sentence": "We have a voice in this and this should not be unilateral decisions made by the president,” Representative <span class='selected-term'>Scott Perry</span> (R) of the Pa. 13th Congressional District\nRrepesentive Scott Perry says there have been conversations in Congress for weeks over what they could do to help.",
    "author": "James Wesser",
    "title": "Midstate lawmakers react to Zelenskyy speech"
  },
  {
    "id": 8884,
    "mediaId": 2573,
    "date": "2022-03-25",
    "sentence": "Here's a closer look at Kim’s new missile and what he may be planning next:\n(AP Photo/Ahn Young-joon)\nGOP REP. <span class='selected-term'>SCOTT PERRY</span> SAYS ‘WEAKNESS IS PROVOCATIVE,’ WARNS BIDEN FOREIGN POLICY ‘ENCOURAGES’ ADVERSARIES\nAt around 25 meters (82 feet) long, the Hwasong-17 is by some estimates the world’s largest road-mobile ballistic missile system.",
    "author": "",
    "title": "What made North Korea test giant new ICBM?"
  },
  {
    "id": 9120,
    "mediaId": 2590,
    "date": "2022-03-30",
    "sentence": "House Freedom Caucus Chair Rep. <span class='selected-term'>Scott Perry</span> (R-Pa.) previously told Politico he also plans to speak with Cawthorn on the matter, adding that he might ask the lawmaker to name names.",
    "author": "Sara Boboltz",
    "title": "Talking About Cocaine And Orgies Is The GOP's Red Line"
  },
  {
    "id": 7128,
    "mediaId": 2662,
    "date": "2022-03-31",
    "sentence": "Freedom Caucus Chairman Rep. <span class='selected-term'>Scott Perry</span> (R-PA) said he plans to speak to Cawthorn in the near future about his allegations, the lawmaker explained to Politico.",
    "author": "Julian Conradson",
    "title": "House Freedom Caucus Members Want Madison Cawthorn to “Name Names” After Explosive DC Swamp Coke, Orgy Claims"
  },
  {
    "id": 7924,
    "mediaId": 6669,
    "date": "2022-04-06",
    "sentence": "Rep. <span class='selected-term'>Scott Perry</span> (R-Penn.)",
    "author": "Basil John",
    "title": "House Democrats and Republicans concerned about new Iran Nuclear Deal"
  }
]