{
  "id": 10116,
  "mediaId": 2543,
  "date": "2022-04-01",
  "headline": "Op-Ed: Don't Let Biden Distract You - The 16th Amendment Is a Disaster That You're Paying for Every Day",
  "image": "https://www.westernjournal.com/wp-content/uploads/2022/03/Joe-Biden-35.jpg",
  "link": "https://www.westernjournal.com/op-ed-dont-let-biden-distract-16th-amendment-disaster-paying-every-day/",
  "mediaOutlet": "Conservative Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mitch Behna",
  "authorUrl": "https://www.westernjournal.com/author/mbehna/",
  "termIds": [
    0
  ],
  "sentences": [
    "The real question is whether Congressional Republicans agree that’s more important than cutting the deficit and investing in our troops, police, and families?https://t.co/61j8gH6eTS\n— Jen Psaki (@PressSec) March 28, 2022\nSpot the difference:\nPresident Joe Biden’s budget makes sure billionaires pay their fair share.",
    "— Chuck Schumer (@SenSchumer) March 28, 2022\nI find this fascinating because they never seem to give us a concrete number or percentage to define “fair share.”\nHowever, I am optimistic about a growing number of Republicans calling for the repeal of the 16th Amendment, including Rep. Thomas Massie of Kentucky.",
    "“This minimum tax would make sure that the wealthiest Americans no longer pay a tax rate lower than teachers and firefighters.”\nBiden also claimed on Twitter that billionaires pay an average income tax rate of 8 percent, which I highly doubt is true.",
    "— President Biden (@POTUS) March 28, 2022\nRegardless of what the actual tax rates are for millionaires and billionaires, it is long past time to repeal the 16th Amendment, which gave Congress the power to collect federal income taxes.",
    "pic.twitter.com/jDIlECff6F\n— Thomas Massie (@RepThomasMassie) February 23, 2022\nIn October, Rep. Warren Davidson of Ohio introduced a proposal to add an amendment to the Constitution that would repeal the 16th Amendment.",
    "“The Billionaire Minimum Income Tax will ensure that the very wealthiest Americans pay a tax rate of at least 20 percent on their full income, including unrealized appreciation,” the White House said in a news release.",
    "In response to Biden’s new proposal, leftists wasted no time claiming that the rich need to “pay their fair share.”\nIt’s no surprise that some conservatives don’t think billionaires should pay their fair share.",
    "On Monday, President Joe Biden unveiled a new tax initiative he called the “billionaire minimum income tax,” which would apply to those in the top 0.01 percent making over $100 million.",
    "My budget contains a Billionaire Minimum Income Tax — a 20% minimum tax that only applies to the top one-hundredth of one percent of American households.",
    "Although President Abraham Lincoln signed into law the Revenue Act of 1861, which included the first federal income tax, Congress repealed it in 1871.",
    "The views expressed in this opinion article are those of their author and are not necessarily either shared or endorsed by the owners of this website.",
    "Politicians are arguing over income tax rates while the real discussion should be about how to reduce the size of government and the national debt.",
    "It is long past time for all Americans to keep more of their hard-earned money and for Washington to make drastic cuts to government spending.",
    "We already pay plenty of other taxes, so the claim that income taxes are necessary for the federal government to function is simply not true.",
    "If you are interested in contributing an Op-Ed to The Western Journal, you can learn about our submission guidelines and process here.",
    "“The federal income tax will only apply to a few people and it won’t be much.” Repeal the 16th amendment.",
    "Senator Rick Scott’s platform for the Republican Party raises taxes on seniors and working families.",
    "No matter how much Biden raises our taxes, it will never be enough to pay off our national debt.",
    "Critics will often ask, “What would we replace income taxes with?” My simple answer is nothing.",
    "It has now been over a century and our national debt is more than $30 trillion.",
    "Right now, billionaires pay an average rate of 8% on their total income.",
    "Abolishing the income tax would be a small step in the right direction.",
    "The 16th Amendment was one of the worst amendments ever to be ratified.",
    "Who says the government must collect an income tax to function?",
    "We should abolish these income taxes for everyone.",
    "The fruit of one’s labor should never be taxed.",
    "We can’t keep spending money we don’t have.",
    "A firefighter or teacher pays double that.",
    "The 16th Amendment was ratified in 1913.",
    "It currently has 10 co-sponsors.",
    "1913 “trust us” they said."
  ]
}