{
  "id": 11501,
  "mediaId": 2553,
  "date": "2022-03-15",
  "headline": "17 GOP Congress Members Sue The CDC To End Air Travel Mask Mandate",
  "image": "https://dw-wp-production.imgix.net/2022/03/Untitled-design-21-copy-3.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/17-gop-congress-members-sue-the-cdc-to-end-air-travel-mask-mandate",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dillon Burroughs",
  "authorUrl": "https://www.dailywire.com/author/dillon-burroughs",
  "termIds": [
    2065,
    2443,
    2426,
    3855,
    3618,
    1433,
    1126,
    253,
    6279
  ],
  "sentences": [
    "Mask mandates are old news, and are only being kept in place by those who relish controlling our day-to-day lives.”\nThe 16 other Republican Congress members included in the lawsuit are Sen. Rand Paul (R-KY), Rep. Andy Biggs (R-AZ), Rep. Dan Bishop (R-NC), Rep. Lauren Boebert (R-CO), Rep. Andrew Clyde (R-GA), Rep. Warren Davidson (R-OH), Rep. Bob Good (R-VA), Rep. Paul Gosar (R-AZ), Rep. Marjorie Taylor Greene (R-GA), Rep. Brian Mast (R-FL), Rep. Alex Mooney (R-WV), Rep. Barry Moore (R-AL), Rep. Ralph Norman (R-SC), Rep. Bill Posey (R-FL), Rep. Matt Rosendale (R-MT), and Rep. Chip Roy, (R-TX).",
    "“First, none of the statutes or regulations cited by the CDC for the authority to mandate that individuals wear masks on commercial airlines, conveyances, and at transportation hubs, permit the CDC to implement or enforce this mandate.”\nIn addition, “even if Congress had granted the CDC the authority to promulgate the mask mandate, the granting of this authority would violate a principle known as the ‘non-delegation doctrine.",
    "The lawsuit, Massie et al v. Centers for Disease Control and Prevention, seeks to end the CDC's illegal mask mandate for individuals traveling on commercial airlines.https://t.co/8QOLgdWnHB\n— Thomas Massie (@RepThomasMassie) March 14, 2022\n“Congress never passed a law requiring masks on commercial flights.",
    "A group of 17 GOP Congress members, led by Kentucky Republican Rep. Thomas Massie, sued the Centers for Disease Control and Prevention (CDC) Monday, claiming it lacks the legal authority to force people to wear a mask on airplanes.",
    "“I’ve been leading the charge in the Senate to end these unscientific, unconstitutional mask mandates, and am proud to continue the fight by joining Rep. Massie on this effort,” Paul said.",
    "This lawsuit targets the faceless bureaucrats who are behind the CDC’s unscientific regulation so that this illegal mask mandate can be brought to a permanent end,” he added.",
    "“The Centers for Disease Control and Prevention does not have the legal authority to force people traveling on commercial airlines to wear masks,” Massie said in a statement.",
    "— Rep Andy Biggs (@RepAndyBiggsAZ) March 14, 2022\n“The CDC’s mask mandate does not protect public health and is beyond the agency’s statutory authority,” Biggs wrote.",
    "The lawsuit, Massie et al v. Centers for Disease Control and Prevention, seeks to end the CDC’s illegal mask mandate for individuals traveling on commercial airlines.",
    "CDC’s tyrannical bureaucrats must be held accountable for placing anti-science restrictions on individuals who have faced hardship for some time now.",
    "“That’s why nearly a year ago I introduced H.R.4441 – Travel Mask Mandate Repeal Act of 2021 that repealed mask mandates on public transportation.",
    "The Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "'”\nKentucky Republican Sen. Rand Paul, who is also a medical doctor, further spoke out against the “unconstitutional” mandate in the statement.",
    "The case also includes Dr. Rochelle Walensky, Director of the CDC; and Sherri Berger, CDC Chief of Staff, as defendants.",
    "Arizona Republican Rep. Andy Biggs argued the airline mask mandate is “beyond” the agency’s authority.",
    "We intend to end the CDC's illegal mask mandate for individuals traveling on commercial airlines.",
    "The mandate does not protect public health and is beyond the agency’s statutory authority.",
    "The Biden administration recently extended the CDC’s March mask mandate until April 18.",
    "I'm joining @RepThomasMassie and fifteen other lawmakers in a lawsuit against the CDC.",
    "Sixteen of my colleagues and I have filed a lawsuit against the @CDCgov (CDC).",
    "The lawsuit includes two primary claims, according to Massie’s statement.",
    "Get inside access to The Daily Wire by becoming a member."
  ]
}