{
  "id": 222,
  "mediaId": 2658,
  "date": "2022-02-22",
  "headline": "The economic war on Russia has begun",
  "image": "https://static.politico.com/ea/2e/b8ffe7354c6e89fe6f51567744b1/ap22053711106932-1.jpg",
  "link": "https://www.politico.com/newsletters/national-security-daily/2022/02/22/the-economic-war-on-russia-has-begun-00010755",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "What to Read\n— NATIA SESKURIA, Foreign Policy: “Russia Is Reenacting Its Georgia Playbook in Ukraine\"\n— CARL BILDT, Project Syndicate: “Russia’s Lethal Identity Crisis”\n— DENNIS C. BLAIR and JOSEPH F. DUNFORD JR., The New York Times: “Opinion: The West’s Delusion of Energy Independence”\nTomorrow Today\n— The Atlantic Council, 8 a.m.: “Strengthening the Transatlantic Response to Russian Aggression — with MARK BRZEZINSKI, SLAWOMIR DEBSKI, MELINDA HARING, WOJCIECH KONONCZUK and MARCIN PRZYDACZ”\n— The German Marshall Fund of the United States, 9 a.m.: “Adapting NATO to an Age of Technological Innovation — with JOANNA VAN DER MERWE, BRUNO LETE, RALUCA CSERNATONI, PHILIP LOCKWOOD and NIKOLAS OTT”\n— The Center for Strategic and International Studies, 10 a.m.: “What’s Next for the China-Russia Relationship?",
    "— with ANDREA KENDALL-TAYLOR, MICHAEL MCFAUL, EVAN MEDEIROS and ANGELA STENT”\n— The National Defense Industrial Association, 10 a.m.: “Electronics Winter Division Meeting — with DEV SHENOY”\n— POLITICO, 11 a.m.: “Russia and Ukraine: what to know –– with ALEX WARD and others”\n— The Wilson Center, 12 p.m.: “Public Opinion in the Divided Donbas: Results of a January 2022 Survey on Both Sides of the Contact Line — with MYKHAILO MINAKOV, JOHN O’LOUGHLIN, GWENDOLYN SASSE and GERARD TOAL”\n— The Jewish Democratic Council of America, 2 p.m.: “The Crisis in Ukraine — with TOM MALINOWSKI”\nHave a natsec-centric event coming up?",
    "Keystrokes\nU.S. CYBER CHIEF PROPOSES ‘CYBER SOCIAL CONTRACT’: National Cyber Director CHRIS INGLIS co-authored a Foreign Affairs piece to argue the U.S. needs “a new social contract for the digital age — one that meaningfully alters the relationship between public and private sectors and proposes a new set of obligations for each.”\nThe contours of that deal are clear, per Inglis and co-author HARRY KREJSA, acting assistant cyber director for strategy and research: “[T]he private sector must prioritize long-term investments in a digital ecosystem that equitably distributes the burden of cyberdefense.",
    "Should your administration seek to introduce U.S. Armed Forces into hostilities or decline to remove any U.S. military personnel currently deployed inside Ukraine from unauthorized hostilities or imminent hostilities, Congress stands ready to deliberate over the potentially monumental implications of such scenarios.”\n“You must also receive congressional approval before initiating any pre-emptive strike,” they asserted.",
    "NATO Secretary General JENS STOLTENBERG didn’t mince words about the situation during a news briefing: “This is the most dangerous moment in European security for a generation.”\nThe Inbox\nFIRST IN NATSEC DAILY –– RUSSIA-UKRAINE WAR COULD BE LIABILITY FOR BIDEN: A new Morning Consult/Politico poll shows that Russia’s invasion of Ukraine could present Biden with some political challenges at home.",
    "“If implemented, it could hit many sectors of Russia’s economy in a way traditional sanctions might not — blocking Russia from importing technology critical to its oil and gas sectors; maritime, defense, and civil aviation industries; and even the import of cars, smartphones, and other consumer electronics.”\nThose three Asian nations must also issue rules to ensnare technology bound for Russia.",
    "Putin, of course, received the brunt of the blame with 66 percent saying he was “very” culpable and 14 percent only saying “somewhat.”\nNone of those results are particularly comforting for Biden, and they will certainly give some Democrats pause heading into the 2022 midterms — particularly with the president already reeling politically from the disastrous Afghanistan withdrawal.",
    "“The buildup … would require billions of additional dollars in the coming years — and may or may not be a preview of the service’s new 30-Year Shipbuilding Plan that is expected to drop next month along with the fiscal 2023 budget request.”\n“I've concluded, consistent with the analysis, that we need a naval force of over 500 ships,” Gilday said in San Diego.",
    "“We’ve got to hold him accountable and that’s what this effort is all about.”\nShaheen, who co-sponsored a bipartisan resolution showing support for Ukraine that passed last week, expressed confidence that Congress will take more action in the coming days in the form of additional assistance to Ukraine and other Eastern European allies.",
    "Finally, both the public and private sectors must commit to moving toward true collaboration — contributing resources, attention, expertise, and people toward institutions designed to prevent, counter, and recover from cyber-incidents.”\nThe public and private sectors have long argued over how best to counter threats in cyberspace.",
    "And the West has to decide whether it’s going to allow a mark where more and more European land is going to be taken over by force, or whether the West is going to stand up to Putin.”\nThis will continue to be a big battle in Congress, even as the administration today announced large sanctions on Russia.",
    "The economic war on Russia has begun\nBy ALEXANDER WARD and QUINT FORGEY\n02/22/2022 04:49 PM EST\nWith help from Bryan Bender and Daniel Lippman\nSend tips | Subscribe here | Email Alex | Email Quint\nIn 1919, Soviet Russia was one of two republics to suffer a Western blockade despite no declaration of war.",
    "“Unlike sanctions, jurisdiction attaches to the item—and the nationality of the companies involved is irrelevant.”\nIn effect, the participation of Asian partners in this play will severely restrict the kinds of technologies Russia can import, turning the vise an extra rotation on the country’s economy.",
    "He also said Russia would be cut off from foreign financing after sanctioning the country’s sovereign debt, and that Wednesday the U.S. will target elites and their families, with a senior U.S. official later telling reporters the elites are ALEXANDER BORTNIKOV, SERGEY KIRIENKO and PETR FRADKOV.",
    "Key to the gambit is the Foreign Direct Product Rule, which “extends U.S. jurisdiction over products made with U.S. software or technology, even if those products are made abroad by foreign companies without other ties to the United States,” Foreign Policy’s JACK DETSCH and ROBBIE GRAMER wrote.",
    "“If we allow a dictator like Putin to go into Ukraine without having consequences, then where does it stop?”\n“We can’t allow an authoritarian leader like Putin to eliminate the sovereignty of Ukraine without consequences,” Shaheen, who is also a member of the Armed Services Committee, added.",
    "Our own BRYAN BENDER put that question to Sen. JEANNE SHAHEEN (D-N.H.), chair of the Foreign Relations Subcommittee on Europe and Regional Security Cooperation, after she visited with members of the U.S. Army’s 82nd Airborne Division and Belorussian opposition leaders in Poland on Tuesday.",
    "I’m calling on President Biden to ignore the warmongers and receive authorization from Congress — as required by the Constitution and U.S. law — before even considering any involvement by the U.S. military in a conflict between Russia and Ukraine,” DeFazio told NatSec Daily.",
    "While polling has long showed that Americans are opposed to putting U.S. troops into a land war in Europe, a combined 58 percent of respondents said the president would be “very responsible” or “somewhat responsible” if U.S. gas prices increased because of the war.",
    "Eight F-35s currently in Germany will also move to several spots \"along NATO’s eastern flank,\" the official said, along with 20 Apache attack helicopters that will relocate from Germany to the Baltic region, and 12 more Apaches will move from Greece to Poland.",
    "Perhaps 30 or more smaller amphibious ships [and] 60 destroyers and probably 50 frigates, 70 attack submarines and a dozen ballistic missile submarines to about 100 support ships and probably looking into the future about 150 unmanned.”\nIs it possible to do?",
    "Broadsides\nRUBIO: SANCTIONS WON’T STOP PUTIN: Sen. MARCO RUBIO (R-Fla.), the top Republican on the Senate Intelligence Committee, isn’t convinced the sanctions package the U.S. coordinated with allies will deter Putin from a full-on invasion of Ukraine.",
    "Flashpoints\n71 PERCENT OF SOUTH KOREANS WANT NUKES: Threats from China and North Korea have led 71 percent of South Koreans to say they support Seoul developing a nuclear weapon, per a new Chicago Council on Global Affairs poll released Tuesday.",
    "The European Union said the 351 members of Russia’s Duma who voted to recognize the so-called Donetsk and Luhansk People’s Republics would face financial penalties, in addition to 27 “individuals and entities” undermining Ukraine’s sovereignty.",
    "The U.S. piled on once the sun rose over Washington, D.C. Deputy national security adviser JON FINER used the “i” word on CNN, setting the table for President JOE BIDEN to announce America’s sanctions on Russia in a Tuesday afternoon address.",
    "Following his decision to recognize two breakaway regions inside Ukraine as independent Monday, Russian President VLADIMIR PUTIN sent troops into the Donbas — launching a newly dangerous phase in the invasion he started nearly a decade ago.",
    "The letter — led by Reps. PETER DeFAZIO (D-Ore.) and WARREN DAVIDSON (R-Ohio) — is supported by progressive and antiwar groups such as Just Foreign Policy, Common Defense, Heritage Action and the Quincy Institute for Responsible Statecraft.",
    "ASIAN NATIONS JOIN GANG UP ON RUSSIA: The U.S. has received assurances from three Asian nations — Singapore, Japan and Taiwan — that they will participate in the large global sanctions scheme targeting Russia for its invasion of Ukraine.",
    "“All semiconductors on the planet are made with U.S. software or tools in part, so this will catch any destined to Russia,” KEVIN WOLF, a former senior Commerce Department official now at the Akin Gump law firm, told Detsch and Gramer.",
    "On the Hill\nFIRST IN NATSEC DAILY –– LAWMAKERS CALL ON BIDEN TO ASK CONGRESS BEFORE SENDING TROOPS TO UKRAINE: Biden has signaled time and time again that he won’t send American troops into Ukraine to back Ukraine and fight Russia.",
    "And you don't need 200,000 troops with all that armor and airpower and seapower to simply occupy two areas where you’ve already had a strong separatist presence for a long time,” he also said during a separate Fox News appearance.",
    "One European diplomat briefed on the moves told POLITICO that the deployments were decided at a Sunday meeting at the White House between Biden, Defense Secretary Lloyd Austin and Chairman of the Joint Chiefs Gen. Mark Milley.",
    "More than 100 years later, Russia made history again by triggering large sanctions from the Western world over its invasion of Ukraine, even though the U.S. and its allies signal no intention of going to war on Kyiv’s behalf.",
    "While you’re at it, follow the rest of POLITICO’s national security team: @nahaltoosi, @woodruffbets, @politicoryan, @PhelimKine, @BryanDBender, @laraseligman, @connorobrienNH, @paulmcleary, @leehudson and @AndrewDesiderio.",
    "He may have already signaled his choice, pronouncing in a speech today that he recognizes the separatists’ claims to the whole of Donbas — likely setting up a military clash with Ukrainian troops along the line of control.",
    "Where Russian forces went afterward would provide great insight into Putin’s true intentions, they told us — and it turned out the troops will remain indefinitely near the Belarus-Ukraine border about 100 miles from Kyiv.",
    "A defense official later said the new deployments will include about 800 infantry troops based in Italy, which will head to the Baltic, along with dozens of aircraft that will fan out among allied nations in NATO’s east.",
    "And then on Feb. 21 — one day after Feb. 20, we want to underscore — Putin sent Russian so-called “peacekeepers” into the Donbas in Ukraine’s east, a move the Biden administration said constituted an invasion.",
    "In a new bipartisan letter to Biden, more than 40 House members wrote “[w]e strongly urge your administration to respect the separation of powers, U.S. law, and Congress’s constitutional war powers authority.",
    "He went so far as to call our and others’ writings “propaganda, fake news and lies.”\nUnfortunately, it appears Lavrov isn’t reading our work closely (and has confused us with our POLITICO magazine friends).",
    "NatSec Daily would like to take a moment and thank Russian Foreign Minister SERGEY LAVROV for revealing he reads our newsletter: “The Politico magazine has postponed the ‘invasion’ date several times.",
    "While experts agree a retaliation is necessary, there is fear that Russia will respond with aggressive moves of its own, namely with cyberattacks on American and Western financial institutions.",
    "“Support for nuclear weapons is robust, with 71 percent in favor of South Korea developing its own nuclear weapons, while 56 percent support a deployment of US nuclear weapons in South Korea.",
    "Implicitly, however, they strike at a core argument made by Republicans and Democrats, that severely punishing Putin now might make him think twice before escalating the incursion he ordered.",
    "The government mainly wants to control who can and cannot respond to threats and attacks, while companies have long wanted free rein to protect their systems with their own people and tools.",
    "Those surveyed mainly split over Biden’s handling of the crisis, with 40 percent either “strongly” or “somewhat” approving while 45 percent said they “somewhat” or “strongly” disapprove.",
    "Last year, conservatives considered the creation of an indigenous bomb as a central aspect of the party platform, which per the poll is now a mainstream view in South Korean society.",
    "Stock markets dipped in advance of the announcement, expecting the worst, then rebounded slightly — sensing that, for now, there was little blowback to U.S. financial institutions.",
    "Expect the debate over nuclear weapons to continue over the coming weeks and, should the next president make a serious play for them, for tensions to rise on the Korean peninsula.",
    "The answers potentially indicate a continued popular belief that the president can both prevent international crises from happening and likewise mitigate the impact on Americans.",
    "“I don’t believe the sanctions are going to stop them from doing what their plan is,” he said on CBS News today, predicting Russia will take Ukraine’s east and Kyiv, the capital.",
    "“He sees this as his magnum opus, his last chance to put together his last great work,” said the University of Pennsylvania's KIMBERLY ST. JULIAN-VARNON of the 69-year-old Putin.",
    "And 50 percent told pollsters that Biden would be “very” or “somewhat” responsible for Russia’s invasion of Ukraine, while 33 percent said he was “not too” or “not” responsible.",
    "The future of the crisis depends on how Putin weighs the value of economic pain at home against his desire to usurp Ukraine and overthrow that democratically elected government.",
    "This space is reserved for the top U.S. and foreign officials, the lawmakers, the lobbyists, the experts and the people like you who care about how the natsec sausage gets made.",
    "The Hudson Institute’s BRYAN CLARK told Paul that it is, but it would require “discipline” and lots of money, as well as lawmakers agreeing to reduce the role of older vessels.",
    "The fleet would be “stocked with dozens of new unmanned ships, frigates and an extra aircraft carrier — pushing well past the long-held goal of 355 vessels,” Morning D wrote.",
    "NEW MILITARY MOVEMENTS: Biden also announced new U.S. deployments from within Europe to the three Baltic NATO states, Estonia, Latvia and Lithuania, per our own PAUL McLEARY.",
    "A senior administration official told reporters after Biden's address that the U.S. stands ready to \"press a button\" to sanction Sberbank and VTB if Russia goes further.",
    "The Kremlin will pay a “steeper” price if its troops move further into Ukraine, Biden asserted, though he kept the door open to diplomacy even as Putin is shutting it.",
    "For now, the West is holstering the massive sanctions package developed with allies to stop Russia from — as is widely expected — seizing other parts of its neighbor.",
    "Nowhere in the story did we say the invasion would happen, only that it could start “as soon as” that date, per what officials familiar with the intelligence told us.",
    "It’s yet another instance of the transpartisan movement pushing to rein in the president’s martial authorities and swing the balance of power back to Congress.",
    "Otherwise he’ll continue to calibrate in a way he thinks he can get away with,” Sen. BOB MENENDEZ (D-N.J.), the Senate Foreign Relations chair, told CNN today.",
    "Interestingly, 40 percent oppose US deployment, while just 26 percent oppose a domestic nuclear arsenal,” the think tank wrote in a summary of its findings.",
    "“We will observe and assess what actions Russia actually takes and respond accordingly.”\nBy Tuesday morning, the Europeans had observed and assessed enough.",
    "Transitions\n— FIRST IN NATSEC DAILY: JAMES BROOKE is joining the Foundation for Defense of Democracies as a visiting fellow focusing on Russia and Ukraine.",
    "Only 28 percent said Biden would be “not too responsible” or “not responsible at all” for that development, with 15 percent not offering an opinion.",
    "On Feb. 11, we reported that Biden told Western leaders of intelligence the U.S. possessed assessing Russia would launch its invasion on Feb. 16.",
    "noted how Adm. MIKE GILDAY, the Navy’s top admiral, used the Friday before a long weekend to dream big about building a 500-ship maritime force.",
    "However, when asked to choose between these two options, the public overwhelmingly prefer an independent arsenal (67%) over US deployment (9%).",
    "Government, in turn, must provide more timely and comprehensive threat information while simultaneously treating industry as a vital partner.",
    "“The bottom line is, you need to be overwhelming in the response that at the end of the day [Putin] understands there’s real consequences.",
    "What is the best way to accomplish this, whether it should be as an emergency supplemental, whether it should be attached to the omnibus?\"",
    "The initial response from the Biden administration was tepid: “the Russian troops moving into Donbas would not itself be a new step.",
    "Aim your tips and comments at award@politico.com and qforgey@politico.com, and follow us on Twitter at @alexbward and @QuintForgey.",
    "But history is a guide, the president will use (or not use) the military as he deems fit with little to no input from lawmakers.",
    "Rubio sided with the president’s stance of not getting militarily involved in Ukraine: \"We’re not the world’s policemen.",
    "Inglis and Krejsa seem to be offering an olive branch and the broad outlines of a common public-private cyber strategy.",
    "North Korea will of course bristle at the notion of South Korea building nukes, even though Pyongyang did exactly that.",
    "Shoot us an email at award@politico.com or qforgey@politico.com to be featured in the next edition of the newsletter.",
    "— MARIZA MARIN has been named acting chief of staff for Customs and Border Protection’ Office of Field Operations.",
    "The coordinated trans-Atlantic moves amount to the first shots in an economic war with Russia over its incursion.",
    "And thanks to our editor, Ben Pauker, who has cut us off from Politico’s financing for our aggressive behavior.",
    "The survey of 2005 registered voters, conducted between Feb. 19-21, has a margin of error of plus or minus two.",
    "Russia has had forces in the Donbas region for the past eight years,” a senior official told reporters Monday.",
    "“Americans are fed up with risking U.S. troops’ lives and spending taxpayer dollars on endless overseas wars.",
    "— GERSHOM SACKS is now policy adviser to the coordinator for the Middle East and North Africa at the NSC.",
    "The “first tranche,” per Biden, will be sanctions on two Russian banks: VEB and an unnamed military bank.",
    "The lawmakers’ comments are less of a rebuke of the president and more a criticism of Putin’s ambitions.",
    "We need a strong amphibious force to include nine big-deck amphibs and another 19 or 20 to support them.",
    "Five days later, we wrote about how experts set their sights on the immediate time period after Feb. 20.",
    "The administration and European officials publicly also didn’t say that was the for-sure invasion date.",
    "But if he changes his mind, lawmakers want to ensure the president comes to them for permission first.",
    "This poll could fuel an already fiery debate ahead of South Korea’s March 9 presidential election.",
    "That’s when a joint Russia-Belarus military exercise was scheduled to end, among other events.",
    "Join NatSec Daily tomorrow at 11 a.m. for a Twitter Spaces conversation on Russia-Ukraine.",
    "— LAUREN KATZENBERG will start next week as The New York Times’ Latin America editor.",
    "If more countries join in, namely South Korea, the pressure would mount even higher.",
    "The United Kingdom put five Russian banks and three oligarchs on its sanctions list.",
    "But these moves mean the “deter an invasion” phase of the West’s response has ended.",
    "Let us know if you want to join at some point as a speaker at award@politico.com.",
    "Germany announced it would shelve the controversial Nord Stream 2 gas pipeline.",
    "Now it’s on to the “deter a larger invasion of Ukraine” section of the crisis.",
    "He previously reported for The New York Times, Bloomberg and Voice of America.",
    "Follow us on Twitter\nAlex Ward @alexbward\nQuint Forgey @QuintForgey\nFollow Us",
    "She’s currently the Afghanistan and Canada editor for the paper of record.",
    "“He's not going to stop with these two little small areas near the border.",
    "“They have, to date, not been definitive in terms of the amount of money….",
    "“We want to prevent a large-scale invasion of Ukraine,” the official said.",
    "He most recently was policy adviser for legislative affairs at the NSC.",
    "Transitioning to a new defense-adjacent or foreign policy-focused gig?",
    "The Complex\n500-SHIP NAVY: Our friends at Morning Defense (for Pros!)",
    "All parties have agreed — now it’s a matter of defining those rules.",
    "‘WHERE DOES IT STOP?’: Why should Americans care about Ukraine?",
    "She most recently was director for border security at the NSC.",
    "The question now is how companies will react to the proposal.",
    "Their latest forecast is February 20,” he told RT on Feb. 18.",
    "Guess we’re not “propaganda, fake news and lies,” after all.",
    "We’re not sending troops into Ukraine,” he said on CBS News.",
    "“I have been part of some of those discussions,” she said.",
    "Hope that’ll convince Lavrov to keep reading our coverage.",
    "“We know we are in a great power conflict right now.",
    "IT’S TUESDAY: Thanks for tuning in to NatSec Daily.",
    "“What we can’t have here is another Munich moment.",
    "It’s also against Russia,” she said from Warsaw.",
    "Canada and Japan also took their own actions.",
    "The Navy currently operates with 298 ships.",
    "And it’s not just against China.",
    "“We need 12 carriers.",
    "HI, SERGEY!"
  ]
}