{
  "id": 2367,
  "mediaId": 2883,
  "date": "2022-02-07",
  "headline": "House takes its sixth hit on cannabis banking provisions",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/02/MARIJUANA_REFORM_004_10082019.jpg",
  "link": "https://rollcall.com/2022/02/07/house-takes-its-sixth-hit-on-cannabis-banking-provisions/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caitlin Reilly",
  "authorUrl": "https://www.rollcall.com/author/caitlin-reilly/",
  "termIds": [
    0
  ],
  "sentences": [
    "Booker along with Majority Leader Charles E. Schumer of New York and Senate Finance Chairman Ron Wyden, D-Ore., unveiled a draft bill in July that would remove cannabis from the federal list of controlled substances and would ensure individuals aren’t barred from federal services, such as public housing, in states where the substance is legal.",
    "“Cannabis-related businesses — big and small — and their employees are in desperate need of access to the banking system and access to capital in order to operate in an efficient, safe manner and compete in the growing global cannabis marketplace,” Perlmutter said in a statement.",
    "The House on Thursday voted 262-168 to adopt the bipartisan amendment offered by Perlmutter and Democratic Reps. Nydia M. Velázquez of New York, Barbara Lee of California and Earl Blumenauer of Oregon, and Republican Reps. Warren Davidson and David Joyce of Ohio.",
    "“The SAFE Banking Act is the best opportunity to enact some type of federal cannabis reform this year and will serve as the first of many steps to help ensure cannabis businesses are treated the same as any other legal, legitimate business,” Perlmutter said.",
    "The House has previously passed the provisions championed by Rep. Ed Perlmutter, D-Colo., five times, including as a stand-alone bill in April and as an amendment to the fiscal 2022 defense authorization bill, although it was omitted from the final law.",
    "The House passed provisions for the sixth time Friday that would allow cannabis companies to access the banking system, but the latest action, as an amendment to the China competition bill, may have little better chance than earlier ones to become law.",
    "The provisions face an uncertain future in the Senate, where some want to hold off on a cannabis banking law until it can be rolled into a larger marijuana package legalizing the drug on the federal level.",
    "Sen. Cory Booker, D-N.J., previously said he would oppose moving forward with a cannabis banking bill without a broader effort to overhaul the laws applying to the drug.",
    "The Senate has not taken up Perlmutter’s bill passed in March, and the amendment included in the House-passed defense reauthorization bill was removed in conference.",
    "“This bill addresses an important public safety issue by providing legal businesses access to financial services,” he said in a statement.",
    "The amendment would allow banks to provide services to cannabis companies, currently prohibited under federal law.",
    "The amendment faces an uncertain future in the Senate despite bipartisan and industry support.",
    "Credit Union National Association President Jim Nussle praised the bill’s inclusion."
  ]
}