{
  "id": 378,
  "mediaId": 2629,
  "date": "2022-02-22",
  "headline": "Ron Johnson Compares Anti-Vax Convoy To Holocaust Victims",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yODgyMzU4MS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwOTcwOTEyMH0.3PAhQEXU_X12a8NkEuwR7ueOcmiXV7Q3a8MUmG_Maec/img.jpg?width=1200&coordinates=0%2C32%2C0%2C32&height=600",
  "link": "https://www.nationalmemo.com/ron-johnson-2656769886",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Israel",
  "authorUrl": "https://www.nationalmemo.com/u/josh-israel",
  "termIds": [
    4905,
    2329,
    4466,
    471,
    6029,
    6492,
    6729,
    6678
  ],
  "sentences": [
    "He then suggested that the Canadian government's attempts to disburse the convoy were analogous to the genocide of millions of people under Adolf Hitler's Nazi regime:\nI recently downloaded Martin Niemöller's famous quote: \"First they came for the socialists, and I did not speak [out] because I was not a socialist\" — and you know how it goes on — and \"then they came for the trade unionists\" and \"I did not speak out because I was not a trade unionist.",
    "The group of truck drivers upset about a variety of Canada's rules aimed at curbing the spread of COVID-19 — including a rule that unvaccinated truckers quarantine for a few days after reentering the country following travel in the United States — formed a convoy to block highways, bridges, and border crossings in Ottawa and other parts of Canada.",
    "The Auschwitz Memorial in Poland condemned analogies of this type in December, writing, \"Exploiting of the tragedy of all people who between 1933-45 suffered, were humiliated, tortured & murdered by the totalitarian regime of Nazi Germany to argue against vaccination that saves human lives is a sad symptom of moral and intellectual decay.\"",
    "In a separate interview on Monday, Johnson told Family Research Council President Tony Perkins that by continuing to treat the pandemic as a public health emergency — even as the coronavirus kills about 2,000 Americans each day — Biden is keeping the American people in a \"perpetual state of fear.\"",
    "Other convoy members forced small businesses to shut down, caused damage to government vehicles, tried to make an Ottawa homeless shelter feed them, impeded the nation's supply chain and economy, waved Nazi flags, and even desecrated Canada's National War Memorial.",
    "Sen. Ron Johnson (R-WI) on Monday compared a convoy of anti-vaccine truckers in Canada to those exterminated by the Nazis during the Holocaust and falsely claimed that the self-named \"Freedom Convoy\" had acted lawfully to stand up to \"tyrants.\"",
    "Johnson claimed that the federal government, pharmaceutical industry, news media, and tech companies are all part of a nefarious \"COVID cartel\" that has \"cost hundreds of thousands of people their lives\" by not embracing unproven treatments.",
    "After widespread criticism, she apologized for her \"offensive\" and \"hurtful\" analogy — and then three weeks later likened President Joe Biden's efforts to make vaccines available door-to-door for those who wanted them to Nazi \"Brownshirts.\"",
    "In a Wisconsin conservative radio show appearance, Johnson told host Vicki McKenna that \"very peaceful\" protests are the best way to fight COVID-19 safety measures, and said that that was \"the hallmark of what happened in Canada.\"",
    "But Johnson and other Republicans in the United States have been cheering them on and even egging on anti-vaccine extremists at home to follow the Canadian truckers' example and shut down American supply chains and businesses.",
    "Indeed police arrested 11 protesters last Monday blocking a border crossing in Alberta, seizing a \"cache of firearms with a large quantity of ammunition,\" apparently for use in a possible confrontation with law enforcement.",
    "Johnson is but the latest in a growing string of GOP politicians comparing public health efforts to address a pandemic that has killed more than 920,000 Americans with the Holocaust.",
    "In reality, it took a court order to get hundreds of angry truckers to stop blaring their horns as they intentionally blocked traffic in the nation's capital city of Ottawa.",
    "He claimed that his wife had seen a report that the truckers \"were honking their horns, it was kinda disturbing the peace, [and so] they stopped honking their horns.",
    "In January, Ohio Rep. Warren Davidson had to apologize for comparing a vaccination requirement for Washington, D.C., bars, and restaurants to a \"Gesundheitspass.\"",
    "Around the same time, Colorado Rep. Lauren Boebert belittled public health workers offering free in-home vaccination as \"Needle Nazis.\"",
    "Contrary to Johnson's claims that the group's behavior has been \"exemplary\" and lawful, its weeks-long protests were anything but.",
    "Last summer, Georgia Rep. Marjorie Taylor Greene attacked face mask and vaccine requirements as similar to \"Nazi practices.\"",
    "Even Conservative officials in Canada criticized the unpopular demonstrations and urged the convoys to go home.",
    "\"I thought the conduct of the truckers, the Canadians up there, was just exemplary,\" Johnson continued.",
    "German for \"health pass,\" Nazis used the term as part of its \"racial hygiene\" requirement.",
    "Then they came for the Jews, and I did not speak out because I was not a Jew.",
    "I'm hearing a truck convoy in the U.S. — we'll see what comes of that.",
    "Then they came for me and there was no one left to speak for me.\"",
    "I think I heard one of the Canadian protesters paraphrase that.",
    "We'll see how the tyrants react to it.\"",
    "\"That's what you need to keep doing.",
    "Again, it's not gonna go away.",
    "Don't do anything unlawful.\"",
    "People are awakening.",
    "People are noticing.",
    "Ron Johnson"
  ]
}