{
  "id": 42,
  "mediaId": 2641,
  "date": "2022-02-22",
  "headline": "Biden Urged by Lawmakers To Consult Congress Before Sending Military to Ukraine",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=764c9080-1e2c-4cea-ae50-ac61f8222025&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/ukraine-russia-biden-military/2022/02/22/id/1058024/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Frankel",
  "authorUrl": "",
  "termIds": [
    4905,
    3499,
    1433,
    6672,
    6569
  ],
  "sentences": [
    "Therefore, we ask that your decisions comport with the Constitution and our nation's laws by consulting with Congress to receive authorization before any such development.”\nThe Hill reports that the letter was signed by Reps. Nancy Mace, R-S.C., Pramila Jayapal, D-Wash., Ilhan Omar, D-Minn., Matt Gaetz, R-Fla. and Warren Davidson, R-Ohio, among others.",
    "While acknowledging that Biden has said he would not be sending troops to Ukraine, the group noted that Biden’s decision could change, writing that “if the ongoing situation compels you to introduce the brave men and women of our military into Ukraine, their lives would inherently be put at risk of Russia chooses to invade.",
    "The American people deserve to have a say before we become involved in yet another foreign conflict.”\nBiden has not sent troops into Ukraine but announced Tuesday that troops would move to numerous NATO countries, including Estonia, Latvia and Lithuania.",
    "In addition, Rep. Peter DeFazio, D-Ore., posted the letter on Twitter, writing that he is “urging Pres Biden to follow the Constitution and the law and receive authorization from Congress before involving US forces in Russia-Ukraine conflict.",
    "A bipartisan group of 43 lawmakers sent President Biden a letter Tuesday reminding him that, amid rising tensions in Ukraine, he must seek Congressional approval before launching military attacks or sending troops.",
    "Related Stories:"
  ]
}