{
  "id": 470,
  "mediaId": 2537,
  "date": "2022-02-23",
  "headline": "Letters: Would you please get Burrow some protection?",
  "image": "https://www.gannett-cdn.com/presto/2022/02/14/PCIN/e072f199-28af-4dd9-a7b2-5ead99de6261-021322SuperBowl56_65.jpg?crop=2698,1518,x0,y0&width=2698&height=1518&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/02/23/letters-would-you-please-get-burrow-some-protection/6785620001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5772,
    4828,
    4905,
    4568,
    3856,
    2765,
    6060
  ],
  "sentences": [
    "Ollie Smith, Edgewood\nRenewable energy sources would improve Ohioans' health\nAs medical professionals, we are concerned about the impact of coal-burning power plants on Ohioans’ health, and implore our state legislators to accelerate the transition to expanding renewable energy sources.",
    "Monica Lira, Amberley Village\nUnclear why Ohio congressmen voted against postal reform\nI noticed that Congressmen Brad Wenstrup, Jim Jordan and Warren Davidson were the three Ohio representatives (out of 16) that voted NAY on the recently passed H.R.",
    "John F. Michel, Hyde Park\nTime to embrace clean energy sources\nThe inventors of the past transformed our lives in many ways with the light bulb, the telephone, the washing machine, the automobile and so many other things we take for granted today.",
    "This threat to Ohioans’ health is clearly demonstrated in the latest American Lung Association State of the Air report in which three Ohio cities were ranked among the top 14 most-polluted in the country for year-round particulate pollution.",
    "What is an average mortgage payment is an exercise unto itself that should disclose average down payment and if that payment is made up of principal and interest only, or does that also include escrowed property taxes and insurance.",
    "Susan L. Dineen, Montgomery\nBlame big corporations for rising costs\nI understand large companies are increasing the cost of their food products by at least 20% so they can increase corporate salaries and bonuses and buy back stock.",
    "Chabot should focus on Ohio, not corrupt foreign countries\nWhy was Rep. Steve Chabot wasting valuable time meeting with the Ambassador of Kazakhstan less than a week after its president issued a shoot-to-kill order on protestors?",
    "Dedicate King Records building Black musical greats\nAs we draw near to the end of February/Black History Month, what about a resurrection of the King Records building in Evanston, making the spot a museum where folks can visit?",
    "Janet Hackman, Highland Heights\nHave faith, a new bridge is coming eventually\nAre people who constantly complain about the I-75 bridge ignorant, ill-read, or just like to have a topic to squawk about over all forms of media?",
    "Susan Kemp, Fairfield\nSupport based on disdain for Trump, not Biden's leadership\nI don't know how many letters your editors had to read before finding someone who thinks \"the United States is on the way to greatness.\"",
    "Working through the Ohio House of Representatives is House Bill 450 which will allow communities greater availability to develop solar installations that could provide power to homes and businesses located nearby.",
    "Barbara Beischel, Cleves\nAn informed citizenry is essential\nAs one of your recent letter writers correctly pointed out, the social media platforms are censoring all points of view that don't agree with their own.",
    "This should only happen in totalitarian states, but since it's happening in our country, it's up to those of us who actually research the newsworthy issues of the day to keep our fellow citizens informed.",
    "I recently \"opened the eyes\" of family members on an issue that all of the major evening news broadcast networks presented as the truth, but that actually had an equally valid alternative viewpoint.",
    "A carbon fee and dividend strategy is supported by economists and faith leaders around the world as well as many young people who know their future depends on a transition to clean energy.",
    "The effects of climate change from carbon emissions causes erratic weather resulting in more severe hurricanes and tornados, heavy rainfall in some areas and drought in other areas.",
    "Tim Capplinger, Hamilton\nAnalysis of renting vs. homeownership flawed\nA Feb. 13 Enquirer article concluded that home ownership is more affordable in Greater Cincinnati than renting.",
    "Our Enquirer reporter’s source for the article was from The Onion News Network that describes itself as, \"All the news that’s not fit for print – or for that matter, the airwaves.\"",
    "Who wouldn’t want to use these sources of energy over coal, oil and gas, whose carbon emissions are harming the air we breathe, destroying the forests and damaging our oceans?",
    "Vernon, OH\nStick to positive news about our city\nI was so disappointed to read the front page headline story, \"We were way beyond chili,\" that attempted to trash our city.",
    "But unfortunately, that doesn't change the fact that they are still a corrupt and kleptocratic country with a recent track record that runs contrary to American values.",
    "I was incensed when reading the subtitle, \"Cincinnati Residents Take Solace After Loss in City’s Lack of Culture, Terrible Food, Stupid Name, Boring Downtown.\"",
    "Among the most harmful chemicals are fine particulates, mercury and arsenic, all of which increase the risk of pulmonary and cardiac disease and cancer.",
    "Shame on the greedy corporations who intensify the breach between the haves and have-nots, and shame on us for failing to plant blame where it belongs.",
    "My question would be, is that \"support\" based on the merits of Biden's leadership, or are these just people who still haven't gotten over Donald Trump?",
    "The provisions in HB 450 are a much-needed step which will reduce disease and associated deaths, slow climate change and benefit all Ohioans.",
    "I would like to see representatives of Ohio focus on issues here, at home first, before going out of their way to prop up a foreign country.",
    "The elderly and children are especially vulnerable to air pollution with strong connections to premature birth and neurocognitive defects.",
    "Those who complain about the possibility of tolls slowing traffic are also ignorant, ill-read or just like to have a topic to squat about.",
    "We are asking the public and the Ohio legislature to support a more rapid transition to renewable energy alternatives for our power grid.",
    "Hasn’t anyone ever driven in the Bay Area (San Francisco – Golden Gate Bridge), or any state with toll roads (Florida, New York)?",
    "Mitchell Singstock, Medical Student at the University of Cincinnati and member of Ohio Clinicians for Climate Action, Blue Ash.",
    "When these plants burn coal to generate electricity, they release a plethora of chemicals that have adverse health effects.",
    "Robert Michaels, Union, Ky\nLook out for the Bengals in 2022\nFirst of all, thanks to one of the best seasons in a long time.",
    "Does anyone anywhere think this Cincinnati Bengals team can be an annual contender with this level of offensive line play?",
    "Currently, there are 17 coal-fired power plants across the state with a high concentration around the Ohio River Valley.",
    "This came to mind after reading the Feb. 5 Enquirer article \"Philip Paul, legendary Cincinnati drummer, dead at age 96.\"",
    "Diversifying Ohio’s energy mix to include greater renewable energy sources is an essential step to improve our health.",
    "On average, for every plant that closes, the mortality rate of the surrounding community decreases by one percent.",
    "There was resistance to these newfangled ideas, but eventually people accepted and embraced these new inventions.",
    "That analysis was so questionable that it makes me wonder if the National Realtors Association wrote the piece.",
    "It is time for us to accept and embrace these 21st-century inventions and convert to clean energy sources.",
    "Compare it to the fact that the Greater Cincinnati-Northern Kentucky Airport is actually in Kentucky, too.",
    "Apparently, it is a little-known fact that the Ohio River is within the boundaries of Kentucky, not Ohio.",
    "Free agency, draft (trade up), whatever it takes, or Joe will be out of the league by his 30th birthday.",
    "I hope Rep. Chabot quickly resolves to prioritize the Buckeye state, not questionable countries abroad.",
    "It's bad enough that he had already co-sponsored legislation granting them preferred free trade status.",
    "The bottom line: an informed citizenry is essential to keep our government and the media \"honest.\"",
    "Sorry folks, you may actually have to slow down a bit from trying to drive like a Nascar driver.",
    "This amazing team and all who helped along this incredible journey…you give Who Dey Nation hope!",
    "Residents of these areas possess an Easy Pass and zip through the toll plazas quite quickly.",
    "There are alternatives to generating electricity which will improve the health of the state.",
    "3076 Postal Service Reform Act (this bill addresses the finances and operations of the U.S.",
    "The inventors of today have created solar panels, wind turbines and energy storage systems.",
    "It was passed in the House on Feb. 8, with a 79% total majority and an 81% Ohio majority.",
    "License plate readers are now present, and you are later billed, again with short delay.",
    "Remember the saying that goes somewhat like this: We have found the enemy, and he is us.",
    "Why do we print negative news concerning our city that I agree should not be for print.",
    "The writer failed to take into account many other costs associated with home ownership.",
    "That is why all of us were \"inconvenienced\" during the never-ending painting project.",
    "Mike Brown, Duke Tobin, Zac Taylor, someone, anyone, get Joe Burrow some protection!",
    "Coach Zac Taylor you rocked it when you and the team distributed the game balls.",
    "Of course, according to the most recent polling, 38% of the country agrees.",
    "Don’t we have enough divisiveness and anger issues in our communities?",
    "Based on what I see going on in the country, I'd bet it's the latter.",
    "Have faith, it will be built, but it is mainly the call of Kentucky.",
    "Non-residents may be delayed a short time to actually pay the toll.",
    "We are reliant on healthy ecosystems for our survival as a species.",
    "Let’s stick with positive news about our Bengals and beloved city!",
    "Easy enough to do as people are quick to blame him for everything.",
    "Could you please explain to your constituents why you voted NAY?",
    "ANY NEW BRIDGE WILL BE IN ADDITION TO THE BRENT SPENCE BRIDGE!",
    "Lastly, folks, The Brent Spence Bridge WILL NOT COME DOWN.",
    "Fossil fuels are harmful to ecosystems around the world.",
    "Yes, they recently celebrated 30 years of independence.",
    "There are so many greats to dedicate this building to.",
    "Mr. Mike Brown, please get Joe Burrow some protection!",
    "Dedicate it to the Black music culture of Cincinnati!",
    "Who do they then blame – President Biden, of course.",
    "It just cannot handle all the present day traffic.",
    "They made their lives better and more productive.",
    "We also have geothermal and hydroelectric power.",
    "I suggest we look at those who walk among us.",
    "Hurried, harassed, hit, SACKED!",
    "Try again, readers expect more.",
    "Our lives will be better too.",
    "Yes, we do need a new bridge!",
    "All clean sources of energy.",
    "Let’s change with the times.",
    "Robin Cox, Anderson Twp.",
    "M.J. Karch, Hyde Park",
    "You make us believe!",
    "Christie Byrom, Mt.",
    "Postal Service).",
    "2022 look out!",
    "Love you ALL!",
    "Imagine that.",
    "Thank you."
  ]
}