{
  "id": 6539,
  "mediaId": 8497,
  "date": "2022-04-12",
  "headline": "Phil Heimlich challenging Warren Davidson in Ohio's 8th Congressional District election",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/screenshot-3-1649819410.png?crop=0.947xw:1.00xh;0.0272xw,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/phil-heimlich-challenging-warren-davidson-in-ohios-8th-congressional-district-election/39705896",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John London",
  "authorUrl": "https://www.wlwt.com/news-team/0e331c55-fcf7-4f86-b314-3917d61a0129",
  "termIds": [
    0
  ],
  "sentences": [
    "Davidson said his constituents do not want government dictating what should happen in their lives, a slam reference to state and federal mandates that have eased as the pandemic numbers improved.",
    "Heimlich's political maneuver is to try to convince the Trump base in Davidson's district to break with the former president and with the incumbent Congressman they've been comfortable with.",
    "\"Frankly, I'm excited to have the west side of Hamilton County,\" said Davidson, appearing unconcerned that Heimlich could benefit because he's a known commodity there.",
    "\"There's a real hunger for the policies that worked under Donald Trump,\" Davidson countered in an interview prior to last Friday's Lincoln Day dinner in West Chester.",
    "Before holding elected office as a Cincinnati Councilman and a Hamilton County\nCommissioner, Heimlich was a former prosecutor who specialized in white-collar crime.",
    "\"And when I saw his history of stiffing small businessmen and ripping off people through his university, I knew a con man when I saw one.",
    "COLUMBUS, Ohio —\nIn a different atmosphere, Congressman Warren Davidson and fellow Republican Phil Heimlich would be on the same team.",
    "Heimlich views himself as more in the Ronald Reagan tradition that he said is truer to the Republican Party than Davidson or Trump.",
    "Running on a theme of \"Protect Our Democracy,\" Heimlich believes the former president is a dangerous affront to American values.",
    "He pointed to the highest inflation in forty years occurring under the watch of President Joe Biden and the Democrats.",
    "In a different atmosphere, Congressman Warren Davidson and fellow Republican Phil Heimlich would be on the same team.",
    "\"So, in terms of his politics, all I've seen so far is, you know, Davidson's been too supportive of Donald Trump.\"",
    "But broadly within the Republican Party people love the policies and they know that they were very effective.\"",
    "Most pundits believe Heimlich is on a quixotic run that is destined run aground when the votes are counted.",
    "Both fashion themselves as fiscal conservatives who prefer to hold the line on taxes and big government.",
    "Davidson told us he favored a thorough investigation to make sure the vote count was fair and accurate.",
    "\"Well, I'd heard the name but only because of his father,\" he answered with a slight smile.",
    "Heimlich acknowledged Trump as the leader of the party, something he called unfortunate.",
    "But instead of being aligned in 2022, they are opposing each other in the May 3 primary.",
    "He's even warier now, saying Davidson keeps pushing the big lie that 2020 was stolen.",
    "He prefers true conservative Republicans or part of the radical middle, if you will.",
    "Voters in the 8th District will have clear, distinct choices in the GOP primary.",
    "But there are those who see him traveling a principled path that could surprise.",
    "\"He's dangerous,\" Heimlich told WLWT during a recent coffeehouse interview.",
    "\"He's trying to suppress the vote, he's anti-democratic,\" Heimlich stated.",
    "Davidson couldn't resist when we asked what he thought of his opponent.",
    "There's a five-letter word that keeps them politically separate: Trump.",
    "To Trump supporters, Heimlich is a RINO, or \"Republican in name only.\"",
    "\"I think we as Republicans have to stop being the flat earth society.",
    "As for Trump, Davidson described him as a distinct individual.",
    "\"Some people love it, some people can't stand the persona.",
    "\"I believe that global warming is a threat,\" he offered.",
    "Heimlich is a \"never Trumper\" with a well-known name.",
    "You can be a Republican and still be pro-science.\"",
    "He believes if Trump runs, he will probably win.",
    "Just ask anyone who has taken a first aid class.",
    "Davidson offered unstinting support for Trump.",
    "Heimlich's podcast is called \"Hard Truths.\"",
    "\"I knew a con man when I saw one,\" he said.",
    "So, I was very wary when he ran in 2016.\"",
    "Davidson would like to see Florida Gov.",
    "The race has a new 8th District map.",
    "Ron DeSantis as the next president.",
    "Heimlich shudders at the thought.",
    "It's a high mountain."
  ]
}