{
  "id": 7685,
  "mediaId": 2746,
  "date": "2022-04-06",
  "headline": "House passes war-crimes legislation aimed at Putin",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/06/Russia_Ukraine_War_Day_In_Photos_52241.jpg-d3c14_c0-226-5464-3413_s1200x700.jpg?7ff67bef14abbec1dfe9ae66f16dc70ebf2823e3",
  "link": "https://www.washingtontimes.com/news/2022/apr/6/vladimir-putin-russia-war-crimes-bill-passes-house/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Clark",
  "authorUrl": "https://www.washingtontimes.com/staff/joseph-clark/",
  "termIds": [
    4195,
    4591,
    4749,
    1477,
    1470,
    6569,
    6672
  ],
  "sentences": [
    "The bill, which passed on a 418-7 vote, would direct President Biden to report to Congress on government efforts “to collect, analyze, and preserve evidence and information related to war crimes and any other atrocities committed during the full-scale Russian invasion of Ukraine.”\n“We cannot wait for the next atrocity before we act,” said Rep. Michael T. McCaul of Texas, the top Republican on the House Foreign Affairs Committee.",
    "“So, this is a historic moment and I want to thank the Chairman, as always, for working with me to stand up against evil, because that’s exactly what this is.”\nThe seven House members who voted against the resolution were all Republicans: Reps. Andy Biggs and Paul Gosar of Arizona, Liz Cheney of Wyoming, Warren Davidson of Ohio, Marjorie Taylor-Greene of Georgia, Thomas Massie of Kentucky, and Scott Perry of Pennsylvania.",
    "Secretary of State Antony Blinken confirmed in March that U.S. officials are “documenting and evaluating” evidence of potential war crimes by Russia in Ukraine to assist international investigations and “hold those responsible accountable.”\nMr. Blinken said the administration was working with private groups to build a possible case of war crimes against the Kremlin.",
    "“They are deliberately shooting columns of civilians on the road who are trying to escape.”\nThe Biden administration declared last month that Russia‘s invading forces in Ukraine are guilty of war crimes, citing Russia‘s targeting of civilian sites such as apartment buildings, schools, and hospitals, many of which had been clearly labeled as non-military locations.",
    "It also cited U.N. figures estimating that at least 2,500 civilians have been killed or wounded in the fighting and the actual number is “likely higher.”\nOn Wednesday, Mr. Biden announced a new round of sanctions against Russia, specifically targeting the adult children of Russian President Vladimir Putin after the Bucha reports.",
    "A bipartisan group of lawmakers on the House Permanent Select Committee on Intelligence have called on the nation’s intelligence agencies to ramp up their work to document possible Russian military war crimes.",
    "Evidence of Russian atrocities carried out in Bucha, a suburb of Kyiv, shocked the world over the weekend in the wake of the withdrawal of Russian forces from the area around Ukraine’s capital.",
    "Members of the committee said the intelligence community is uniquely situated to document and analyze evidence of war crimes and has a long history of documenting human rights violations.",
    "Ukrainian President Volodymyr Zelenskyy, said in a Tuesday address to the U.N. Security Council that women and children were murdered with their hands tied behind their back.",
    "It will ensure the United States helps the people of Ukraine gather, analyze, and maintain evidence of war crimes,” he said on the House floor Wednesday.",
    "Mr. Putin “will be brought to justice, for without justice, in the face of these crimes against humanity, what good are we?,” Mr. McCaul said Wednesday.",
    "The legislation adds to calls in Washington to label Mr. Putin a war criminal and pressure the international community to hold him accountable.",
    "“We must do what we can now to deter Russian leaders, commanders, and troops in the field from committing further war crimes.",
    "Mr. McCaul introduced the legislation along with Rep. Gregory Meeks, New York Democrat and the foreign affairs chairman.",
    "Ms. Cheney later informed the House clerk that she intended to vote in favor of the bill and changed her vote.",
    "The House passed legislation Wednesday to probe claims of war crimes that Russia has committed in Ukraine.",
    "“Russian troops are deliberately destroying Ukrainian cities to ashes with artillery and air strikes.",
    "Some were shot execution-style in the back of the heads, while others had their throats slashed.",
    "They are deliberately blocking cities [and] creating mass starvation,” Mr. Zelenskyy said.",
    "He also said Russian tanks drove over civilian cars while people were still inside.",
    "That’s why we introduced this legislation.",
    "• Mike Glenn contributed to this report.",
    "The final vote count is 419 - 6."
  ]
}