{
  "id": 7687,
  "mediaId": 2621,
  "date": "2022-04-07",
  "headline": "Here Are The Only House Members to Vote Against Banning Russian Oil and a War Crimes Probe in Ukraine",
  "image": "https://www.mediaite.com/wp-content/uploads/2021/08/Screen-Shot-2021-08-10-at-9.40.39-AM-e1628602887881.jpg",
  "link": "https://www.mediaite.com/politics/here-are-the-only-house-members-to-vote-against-banning-russian-oil-and-a-war-crimes-probe-in-ukraine/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Griffing",
  "authorUrl": "https://www.mediaite.com/author/alex-griffing/",
  "termIds": [
    4905,
    2693,
    3618,
    3514,
    3405,
    3008,
    1477,
    206,
    6672,
    6569
  ],
  "sentences": [
    "Greene and Massie were joined by Reps. Andy Biggs (R-AZ), Paul Gosar (R-AZ), Warren Davidson (R-OH), and Scott Perry (R-PA) in voting against the Ukraine Invasion War Crimes Deterrence and Accountability Act on Wednesday.",
    "The U.S. House of Representatives passed a bill on Thursday, with almost unanimous support, to suspend all free trade with Russia and ban the import of Russian oil, which is keeping the Russian economy alive.",
    "All three tied their opposition to the bill to concerns over the 2012 Magnitsky Act, a law empowering the federal government to sanction entities deemed to be violating human rights.",
    "Earlier in the day, the U.S. Senate passed the measure 100 to 0, with every Senator voting to end our trade relationship with Russia as it continues its brutal invasion of Ukraine.",
    "“HR 7276 would hand over authority & our intelligence to the ICJ & ICC – international courts that could put our military on trial,” Greene said in a Thursday statement.",
    "The bill, which still passed with 418 votes, will empower the State Department to collect evidence and begin investigating allegations of Russian war crimes in Ukraine.",
    "“Extending the already overly broad executive powers in the Magnitsky Act forever is legislative malpractice,” Massie said in a statement to Insider.",
    "“President Biden should not have a blank check to sanction whoever he deems a ‘human rights violator,'” Gaetz said.",
    "Those three members were Reps. Marjorie Taylor Greene (R-GA), Matt Gaetz (R-FL) and Tom Massie (R-KY).",
    "I will only vote to protect America, our military, & our borders.”\nHave a tip we should know?",
    "“I will not vote for globalism & the slow slide to become a one world government.",
    "In the House, however, three Republican members voted against the bill.",
    "Both Greene and Gaetz explained their votes on Twitter.",
    "Four GOP members did not vote.",
    "tips@mediaite.com"
  ]
}