{
  "id": 7865,
  "mediaId": 2594,
  "date": "2022-04-07",
  "headline": "Ex-Trump official calls six Republican lawmakers ‘Vlad’s cover up crew’ for Russia war crime vote",
  "image": "https://static.independent.co.uk/2021/07/17/11/newFile.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/miles-taylor-republicans-war-crimes-ukraine-b2053053.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Johanna Chisholm",
  "authorUrl": "https://www.independent.co.uk/author/johanna-chisholm",
  "termIds": [
    2443,
    2426,
    3008,
    4591,
    4269,
    1441,
    1126,
    6569
  ],
  "sentences": [
    "“The images we have now seen from Bucha and other places – as well as the continued brutal attacks on civilians in Mariupol and Russia’s prevention of humanitarian aid reaching those who need it – are shocking the conscience of our country and the world.”\nEarlier in the vote, there had been seven House Republicans who had indicated they were voting nay on the measure, but Wyoming Representative Liz Cheney later said it was a mistake and that she would amend her vote to a yea.",
    "In the Ukraine Invasion War Crimes Deterrence and Accountability Act, it goes one step further and asserts that the Russian soldiers are intentionally targeting civilians at nonmilitary outposts, such as apartment buildings, schools and hospitals, and that they are wantonly taking civilians hostage while deporting others to Russia.",
    "I will only vote to protect America, our military, & our borders.”\nThe bill, which will now head to the Senate, was introduced on 29 March and seeks to collect, analyse and preserve evidence and “information related to war crimes and any other atrocities committed” since Russia’s invasion of Ukraine on 24 February, the bill reads.",
    "The passage of the bill in the House, which saw only those six Republican representatives oppose it, arrives after a week when foreign media was provided a horrifying glimpse into the sieged villages outside Kyiv that were reclaimed from Russian occupation in recent days.",
    "Miles Taylor, an ex-chief of staff in the Department of Homeland Security under Trump and a former government official within George W Bush’s administration, condemned the six representatives who voted against the act, which passed with an overwhelming majority.",
    "“Today, the House voted to condemn the atrocious actions carried out by Russian forces, under the direction of Vladimir Putin, in areas under their control in Ukraine,\" House majority leader Steny Hoyer said in a statement after the passage of the bill.",
    "In 2018, he famously penned The New York Times opinion piece under his then pseudonym of “Anonymous”, in which he outlined how a “resistance” of Trump insiders were attempting to buttress against some of the former president’s more extreme policies.",
    "The representatives who voted against the bill include: Marjorie Taylor Greene of Georgia, Warren Davidson of Ohio, Thomas Massie of Kentucky, Scott Perry of Pennsylvania and Andy Biggs and Paul Gosar of Arizona.",
    "The videos and photographs captured relay a violent aftermath, with some officials saying the alleged mass graves, dead bodies with bound hands, burned corpses and targeted civilians could amount to war crimes.",
    "He then went on to write a book, under the same name of “Anonymous” where he continued on that same theme of revealing his experiences from inside the White House during the Trump administration.",
    "A former Trump administration official slammed the six Republicans who voted against a Russian war crimes bill in the House on Wednesday, labelling the group “Vlad’s” guys.",
    "Ms Greene defended her vote, saying: “HR 7276 would hand over authority & our intelligence to the ICJ & ICC - international courts that could put our military on trial.",
    "Or as I like to call them, Vlad’s Cover-Up Crew,” he wrote on his personal Twitter account, before listing all six Republicans who voted nay.",
    "“Six Republicans voted AGAINST a bill to preserve evidence of Russian war crimes in Ukraine.",
    "“I will not vote for globalism & the slow slide to become a one world government.",
    "Mr Taylor is no stranger to critiquing those from within his own party lines.",
    "This is the GOP pro-Putin wing."
  ]
}