{
  "id": 7886,
  "mediaId": 2532,
  "date": "2022-04-07",
  "headline": "Senate to vote on revoking Russia's trade status, oil ban",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/04/07/efd7c6e9-5650-492c-b2a7-315473368792/thumbnail/1200x630/a680a8dbe46ca0ed8d461c65c7077a04/gettyimages-1239768303.jpg",
  "link": "https://www.cbsnews.com/news/senate-to-vote-on-revoking-russias-trade-status-oil-ban/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2693,
    4749,
    3008,
    1489,
    1494,
    1477,
    6569,
    5949
  ],
  "sentences": [
    "Trending News\n Supreme Court to hear case of praying football coach who lost job\n Florida governor signs bill that strips Disney of special tax status\n Greene testifies against challenge to her congressional candidacy\n Russian military vehicles abandoned\n Mayorkas says U.S. is preparing for \"significant\" border challenges",
    "The House on Wednesday overwhelmingly passed a bill sponsored by McCaul that directs the president to detail to Congress government efforts \"to collect, analyze, and preserve evidence and information related to war crimes and any other atrocities committed\" during Russia's invasion.",
    "\"They cannot just go kill a bunch of people, destroy cities, kill women and children, and then go back and have business as usual,\" Ukrainian-born U.S. Rep. Victoria Spartz, a Republican from Indiana, said as the trade bill was debated in the House.",
    "\"What I'm telling the senators is that all this foot-dragging in the face of the atrocities that everybody saw this weekend is just really beyond imagination,\" said Sen. Ron Wyden, the Democratic chairman of the Senate Finance Committee.",
    "The House vote in mid-March came one day after Ukrainian President Volodymyr Zelenskyy told Congress in a virtual speech that \"new packages of sanctions are needed constantly every week until the Russian military machine stops.\"",
    "Reports of civilians being tortured and killed in Ukraine, with streets on the outskirts of Kyiv being strewn with corpses, had some lawmakers this week questioning why the Senate had not yet taken action on the bill.",
    "Six Republicans, Reps. Andy Biggs of Arizona, Warren Davidson of Ohio, Paul Gosar of Arizona, Marjorie Taylor Greene of Georgia, Thomas Massie of Kentucky and Scott Perry of Pennsylvania voted against the measure.",
    "But Sen. Rand Paul, a Kentucky Republican, has objected to speedy consideration of the bill over concerns that its language on who can be sanctioned for human rights abuses is too broad, leaving it ripe for abuse.",
    "Rep. Kevin Brady, the ranking Republican on the House Ways and Means Committee, which has jurisdiction over trade, said it was important for Schumer to get senators together and get the bill passed.",
    "Sen. Ben Cardin, a Democrat from Maryland, said, practically speaking, the impact of the delay on the trade bill is minimal \"because there's virtually no trade right now coming in from Russia.\"",
    "The Senate will take up legislation Thursday to end normal trade relations with Russia and to ban the importation of its oil, Senate Majority Leader Chuck Schumer announced Wednesday.",
    "At the time, the legislation was billed as sending a message to Russian President Vladimir Putin and his allies about the economic isolation Russia will face for invading Ukraine.",
    "\"Formally revoking normal trade relations with Russia is precisely the right thing for the Senate to do because it will land another huge blow to Putin's economy,\" Schumer said.",
    "\"I think part of it really is just having leadership in the Senate that is going to manage the floor and is willing to do what it takes to get this thing done,\" Thune said.",
    "It's been three weeks since the House passed the trade suspension measure that paves the way for President Joe Biden to enact higher tariffs on certain Russian imports.",
    "Both bills have been bogged down in the Senate, frustrating lawmakers who want to ratchet up the U.S. response as the Ukraine war enters a gruesome new phase.",
    "\"Now, I wish this could have happened sooner, but after weeks of talks with the other side, it's important that we have found a path forward.\"",
    "Democrats counter that going the route Thune suggested requires dedicating precious floor time for a bill that passed 424-8 in the House.",
    "While GOP Rep. Liz Cheney of Wyoming also cast a \"no\" vote, her office told the Hill it was an error and would be corrected.",
    "\"It seemed like a pretty bipartisan, easy thing to do, just like not importing Russia energy, so it's disappointing.\"",
    "The bill would codify restrictions on Russian oil that Biden has already put in place through executive action.",
    "\"It sends a message of weakness,\" said Rep. Michael McCaul, a Republican from Texas, on the Senate's inaction.",
    "\"It's a key part of any strategy for holding Putin accountable for his savage attacks on innocent civilians.\"",
    "Schumer opted to let senators work it out rather than chew up floor time to overcome the filibuster.",
    "Schumer said Putin needed to be held accountable for what he said were war crimes against Ukraine.",
    "He blocked a request for a voice vote on the bill, which requires consent from all 100 senators.",
    "\"President Zelenskyy asked a month ago for this and here we are — still fussing around.\"",
    "There is overwhelming support for suspending preferential trade treatment for Russia.",
    "2 Republican in the Senate, said the delay in the Senate was hard to explain.",
    "\"Messaging is important here and showing action is important,\" Cardin said.",
    "\"It's a big, big deal that we are finally getting them done,\" Schumer said.",
    "America needs to weigh in now and stop funding the war,\" Brady said.",
    "\"If this had been a priority, I think it would have been done.\"",
    "\"You've got the Ukrainians on the battlefield every day.",
    "The House also passed the oil ban about a month ago.",
    "The least we can do is get these bills passed.\"",
    "He also said Putin was guilty of genocide.",
    "\"We've been watching these atrocities.",
    "Still, he said passage is important.",
    "But he placed the onus on Schumer.",
    "House lawmakers concurred.",
    "Sen. John Thune, the No."
  ]
}