{
  "id": 7894,
  "mediaId": 2752,
  "date": "2022-04-07",
  "headline": "How Are GOP Congressmen Appeasing Putin The Genociding Murderer Today?",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY1MDY0NS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTcxMDAwMzIyOX0.YwNIMQ4XszapR4cafprbJYvFZDUTK-TIDQMmCszb6U0/img.png?width=1200&coordinates=0%2C0%2C5%2C0&height=600",
  "link": "https://www.wonkette.com/how-are-republican-congressmen-sympathizing-with-putin-the-genociding-murderer-today",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Evan Hurst",
  "authorUrl": "https://www.wonkette.com/u/evan_hurst",
  "termIds": [
    4749,
    4257,
    4591,
    3618,
    2887,
    2765,
    3008,
    2151,
    1126,
    6569
  ],
  "sentences": [
    "See if you can catch his drift:\n\"Adopt a new Strategic Concept for NATO that is clear about its support for shared democratic values and committed to enhancing NATO’s capacity to strengthen democratic institutions within NATO member, partner, and aspirant countries.”\n“Use the voice and vote of the United States to establish a Center for Democratic Resilience within NATO headquarters.”\nOf these provisions, Davidson said, “America’s sovereignty is nonnegotiable.",
    "The bill, introduced in the House on March 29 and sponsored by GOP Rep. Michael McCaul of Texas, seeks to \"direct the President to submit to Congress a report on United States Government efforts to collect, analyze, and preserve evidence and information related to war crimes and any other atrocities committed during the full-scale Russian invasion of Ukraine since February 24, 2022.\"",
    "Golly, we'd spend a whole bunch of time trying to give \"Paul Gosar\" and \"Marjorie Taylor Greene\" the benefit of the doubt to find out if there's a good and intellectual (LOL) reason they voted against saying out loud that Russia did war crimes and preserving evidence of it, but that would be Chuck Todd levels of journalistic malpractice.",
    "Could part of it be because, to pull a wild example out of our asses, NATO member Hungary just held a basically fake election to preserve the power of its Putin-adjacent autocrat fuckclown leader Viktor Orban, who is the darling of Putin fanboys and Christian supremacist shitweasels in America?",
    "The bill, titled the Ukraine Invasion War Crimes Deterrence and Accountability Act, asserts that Russian forces have intentionally attacked civilians and nonmilitary buildings, engaged in unnecessary wanton destruction of property, and unlawfully deported civilians and taken hostages.",
    "He called NATO “a relic of the Cold War” and asked, “Why should Americans pay for Europe’s defense?”\nBlake says GOP Rep. Warren Davidson, who was also one of the six who voted against preserving evidence of war crimes, was a bit more \"nuanced.\"",
    "It was all the garbage listed above, plus other garbage like Lauren Boebert, Madison Cawthorn, Matt Gaetz, Scott DeJarlais, Andrew Clyde, Louie Gohmert, Clay Higgins, Jim Jordan, Matt Rosendale, Troy Nehls, and a bunch of others.",
    "So Raskin said, fine, \"I accept the heckling,\" and added, \"That’s all right because if she wants to continue to stand with Vladimir Putin and his brutal bloody invasion against the people of Ukraine, she is free to do so.",
    "… We should be strengthening the alliance, not reimagining it as a tool to interfere in one another’s domestic politics.”\nWait, why would we need a bill to strengthen democratic institutions within NATO countries?",
    "After the vote, Aaron Blake at the Washington Post tried to find out the very serious reasons these congressmen couldn't bring themselves to say NATO is good and Russia invading Ukraine was wrong and unjustified.",
    "So in other words, proponents of illiberalism who are internal threats to America voted against a resolution that called out the internal threats NATO members face from proponents of illiberalism.",
    "As Blake notes, at least one of these Republicans, Andy Harris of Maryland, said out loud that his vote was at least partially about how it was offensive to Hungary and Poland.",
    "He had to scrape the bottom of the barrel:\nAmong the few Republicans to comment on their vote was one of the party’s most anti-NATO voices, Rep. Thomas Massie (R-Ky.).",
    "Last night, as congressmen were speaking before the contempt votes against Peter Navarro and Dan Scavino, Greene tried to heckle Democratic Rep. Jamie Raskin.",
    "It called on President Joe Biden to \"use the voice and vote of the United States to establish a Center for Democratic Resilience within NATO headquarters.\"",
    "Will Saletan spent some time at The Bulwark going over all the thoughts and feelings of the Republican Anti-Ukraine Caucus before the vote happened.",
    "You see, this resolution, just after it calls out Russia and China, says NATO countries face \"internal threats from proponents of illiberalism.\"",
    "Actually there were seven votes, but the seventh was Liz Cheney, whose office said her vote was a fuckup and she's going to fix it.",
    "The correct answer is fuck these anti-American pieces of shit, and that is fair and balanced news you can use.",
    "He didn't like how the bill offered \"unequivocal\" support for NATO, and he also didn't like two other parts.",
    "You know, Hungary, where CPAC is about to throw its big white party in May, with Orban as keynote speaker?",
    "It called Russia and China \"authoritarian regimes\" and blamed the war in Ukraine squarely on Russia.",
    "And we understand there is a strong Trump-Putin axis in the gentlelady’s party.”\nThere sure is.",
    "In fact, seen in that light, it might be surprising that only 63 Republicans voted against it.",
    "If you're not already, would you pls consider being the few thousandth and one?",
    "Earlier this week the House passed a resolution to express support for NATO.",
    "We'll grant at least that he used more big boy words than Massie did.",
    "Wonkette is funded ENTIRELY by a few thousand people like you.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "And 63 Republicans managed to vote against that one!",
    "We're sure Putin appreciates their service, though.",
    "These people are really fucking bad at \"America.\"",
    "I suspect other countries feel the same.",
    "How often would you like to donate?",
    "\"What about Russian collusion?\"",
    "(That guy really likes Orban.)",
    "What's their fucking problem?",
    "\"What about Ashli Babbitt?\"",
    "And now we all get it.",
    "So it's those six.",
    "she grunted.",
    "she shouted."
  ]
}