{
  "id": 9501,
  "mediaId": 3987,
  "date": "2022-03-21",
  "headline": "Delivering on Immigration Part of Recipe for How Democrats Can Appeal to Latino Voters in AZ and NV",
  "image": "http://americasvoice.org/wp-content/uploads/2021/03/Democrats-and-Republicans.png",
  "link": "https://americasvoice.org/press_releases/delivering-on-immigration-part-of-recipe-for-how-democrats-can-appeal-to-latino-voters-in-az-and-nv/?utm_source=rss&utm_medium=rss&utm_campaign=delivering-on-immigration-part-of-recipe-for-how-democrats-can-appeal-to-latino-voters-in-az-and-nv",
  "mediaOutlet": "americasvoice.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AV Press Releases",
  "authorUrl": "",
  "termIds": [
    2057,
    3920,
    4343,
    5376,
    392,
    5949,
    6431
  ],
  "sentences": [
    "The text of his Facebook ads that feature the same video reads: “The radical left has allowed an invasion on our southern border, destroyed our economy, and is pushing CRT on our kids.”\nNevada\nAdam Laxalt, the likely Republican nominee for the Senate seat, compared the situation in Ukraine to that of the southern border and peddled a coded version of racist ‘replacement theory.”\nIn the Nevada GOP gubernatorial primary, candidates Joe Lombardo and John Lee have been competing on who can appear to be the most hostile to immigrants.",
    "Many of the leading GOP candidates in Arizona and Nevada have embraced absurd and deadly conspiracy theories about a migrant “invasion” or “replacement theory.” These dangerous ideas Republican candidates – and the GOP nationally – have adopted are exactly the type of messages espoused by the gunman who committed mass murder in Pittsburgh and the mass murderer who targeted Latinos at a Walmart in El Paso.",
    "Here are just a few examples:\nIn Arizona\nAll of the Republican gubernatorial candidates are promoting the false racist conspiracy theory about a migrant “invasion.”\nRepublican Senate candidates, Jim Lamon, Blake Masters, and Mark Brnovich have also peddled the racist fiction of a migrant “invasion” and made fear-mongering about immigrants a central part of their campaigns.",
    "They’re turning out… but we need to give people something to be excited for.”\nSharpening distinctions between the parties and candidates on immigration – and immigration as a larger lens of what type of country the parties are fighting for – is particularly important as Republicans in both states are running hard on ugly xenophobia.",
    "Washington, D.C. – A new Politico story, “Dems begin building a Latino vote firewall in the West,” highlights how Latino voters’ support and engagement is an essential ingredient in Democrats’ path to victory in the Arizona and Nevada Senate races, which are pivotal races in Democrats’ efforts to keep their Senate majority.",
    "Elijah Norton who is trying a primary challenge to scandal-ridden Republican Rep. David Schweikert for the AZ-01 seat (formally AZ-06) is out with a new ad employing the racist conspiracy theory of a migrant “invasion.” Behind the bold text that reads “INVASION” is an image showing Haitian refugees from last September.",
    "As Chuck Rocha, Democratic strategist and former senior advisor to Sen. Bernie Sanders’ presidential campaign states in the story:\n“These are states where it’s going to be so close — so, losing 2 or 3 percentage points of the Latino vote compared to the last [midterm] election would be devastating for [Sens.]",
    "As Alejandra Gomez, co-executive director of LUCHA, an Arizona grassroots organization, says in the story:\n“Both the administration and the party are falling short of delivering on the promises our communities were expecting and that they showed up for [by voting] in the middle of a pandemic.",
    "Not only do Democrats need to get Latinos to perform — they need to overperform if they’re going to win.”\nWhile the story highlights welcome early and significant investment in Latino voter engagement in both states, the targeted engagement is only part of the recipe for success.",
    "Gubernatorial candidate Karrin Taylor Robson is currently running an ad on TV employing the “invasion” rhetoric and calling for national guard troops to be sent to the border despite the debacle of this political stunt in Texas.",
    "As we enter the busy midterm election season, sharpening distinctions between the parties on immigration, calling out Republicans for their fear-mongering, and showing Latino voters that Democrats can deliver for them is key.",
    "According to Vanessa Cardenas, Deputy Director of America’s Voice:\nThere’s a palpable sense of disillusionment among many Latino voters in Arizona, Nevada, and states across the country when it comes to immigration action.",
    "Delivering on promises and sharpening distinctions between the parties on immigration, including by making progress via executive action, is a big part of overcoming the disillusionment that many Latino voters are feeling.",
    "In NV-04, Republican Sam Peters, a QAnon supporter running for the seat in the GOP primary, made the false racist conspiracy theory about a migrant “invasion” a part of his consistent fundraising appeals.",
    "Meanwhile, at the beginning of the race Lee pushed an ad full of xenophobic misinformation and fear-mongering as he was trying to introduce himself to Republican primary voters.",
    "While the Biden administration has taken some important steps forward on a range of issues that concern Latino voters, immigration is the elephant in the room.",
    "Check out ongoing examples of Republicans’ anti-immigrant ads at the America’s Voice GOP Ad Tracker: http://gopadtracker.com/",
    "Better Nevada PAC, which is allied with Lombardo, bragged about his efforts at mass deportation of immigrants from the state.",
    "The other component is generating enthusiasm among Latino voters and motivating them to turn out and support Democrats.",
    "Biden and Democrats need to fulfill the promises they have made whichever way they can, including Executive Action.",
    "So, I ask: How bad do Democrats want to win?",
    "Because Latinos are ready.",
    "Kelly or Cortez Masto."
  ]
}