{
  "id": 10647,
  "mediaId": 8373,
  "date": "2022-03-31",
  "headline": "Gubernatorial candidate: 'Same guys lining their pockets' at Ohio statehouse",
  "image": "https://jnswire.s3.amazonaws.com/jns-media/51/36/11716278/img_6778.jpeg",
  "link": "https://mountvernonnews.com/stories/622463479-gubernatorial-candidate-same-guys-lining-their-pockets-at-ohio-statehouse",
  "mediaOutlet": "mountvernonnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Pepalis",
  "authorUrl": "https://mountvernonnews.com/author/bob-pepalis",
  "termIds": [
    4710,
    2605,
    2143,
    3346,
    6474,
    6413,
    6104,
    6747,
    6533
  ],
  "sentences": [
    "“What we've seen at the statehouse for the past three decades is the same guys lining their pockets instead of taking care of the issues that I see in Dayton and cities all across the state from Zanesville to Portsmouth to Mount Vernon,” Whaley told the Mount Vernon News.",
    "“Special-interest dealing at the statehouse is done, and we deserve better than what we've gotten.”\nShe grew up in a small town in Indiana, the daughter of a union autoworker and a mom who worked at a laundromat to help make ends meet.",
    "Nan Whaley sees having the same people in charge at the Ohio capital for three decades as a source of the problem of corruption, and she wants to change that by running for governor.",
    "“I think Pennsylvania and Michigan are eating our lunch when it comes to making the wind turbines and solar panels that will fuel this country in the future,” she said.",
    "Elected officials with self-interest and special interests take care of themselves instead of taking care of families and communities in Ohio, Whaley said.",
    "DeWine said what was politically convenient at the time, “but then when the rubber meets the road, he kowtows to the radicals in his party,” Whaley said.",
    "According to ABC News, Acton proposed a shelter-in-place order now lauded by the John F. Kennedy Library Foundation (https://tinyurl.com/39z4f499).",
    "Her top issues include high-quality preschool for every 3- and 4-year-old in the state, something she helped accomplish in Dayton as mayor.",
    "First Energy funded DeWine’s campaign and got a billion-dollar bailout plus one of their lobbyists as a utility regulator, she said.",
    "Whaley cites the leadership of Dr. Amy Acton, Ohio’s former Health Department director, as an example of a good pandemic response.",
    "Ohio needs more working-class families who understand the struggles and challenges families and communities face, she said.",
    "“Two million American women have opted out of the workforce during the pandemic, frankly, because they just cannot get it.",
    "Whaley wants the minimum wage increased to $15 an hour and to invest in small business and renewable energy jobs.",
    "“It is incredibly embarrassing that the FBI calls the Ohio State House the most corrupt in the country.",
    "“I think most communities and families have been suffering under really failed policies,” Whaley said.",
    "One thing she said differentiates her from other candidates is that she’s the only non-millionaire.",
    "Cities had to take the lead with mask mandates when no vaccine or testing was available, she said.",
    "The winner will face off against one of four Republic candidates, including incumbent Gov.",
    "After meeting her husband, Sam, she served as a city commissioner and mayor in Dayton.",
    "And Ohioans aren't being served because of that, and we deserve better,” she said.",
    "She will face John Cranley in the May 3 Democratic primary.",
    "The state also needs to invest in child care, she said.",
    "She graduated from the University of Dayton.",
    "Child care is really scarce,” Whaley said.",
    "The foundation recognized Acton last year.",
    "It’s also expensive.",
    "Mike DeWine."
  ]
}