{
  "id": 11985,
  "mediaId": 8323,
  "date": "2022-03-28",
  "headline": "Watch: Ohio US Senate Republican primary debate",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/03/Debate.jpg?w=1280",
  "link": "https://fox8.com/news/watch-live-ohio-us-senate-republican-primary-debate-kicks-off/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Freeman",
  "authorUrl": "https://fox8.com/author/kevinfreemanfox8news/",
  "termIds": [
    0
  ],
  "sentences": [
    "“They are trying to destroy America and right now, what we need in Washington to defeat the secular left, to defeat the radical left, to defeat Biden and Schumer and Pelosi and save this country for our kids and grandkids,” said Mandel.",
    "They were also asked whether U.S. Supreme Court justice Clarence Thomas should recuse himself from any cases related to Jan. 6, given his wife’s alleged conversations about overturning the election with President Trump’s chief of staff.",
    "“The claim that Mr. Gibbons just made about more ballots cast than registered voters has been fact-checked and no evidence has been found to support it,” said moderator Karen Kasler, to a chorus of boos from the audience.",
    "The candidates answered questions ranging from their position on the United States’ involvement in the war in Ukraine to immigration, to whether the 2020 election was stolen from President Donald Trump.",
    "“Recently, there was a Wisconsin special council that discovered a good number of nursing homes in Wisconsin voted at 103% of their occupancy and they all voted for Joe Biden.",
    "The candidates were also asked about their positions on immigration and all support more enforcement of laws and the completion of the border wall, including author J.D.",
    "Stay tuned for a Democratic gubernatorial debate, featuring John Cranley and Nan Whaley, Tuesday at 7 p.m. That event is also taking place at Central State University.",
    "When asked whether the 2020 election was stolen from President Trump, all but one candidate, state Senator Matt Dolan, said yes, including businessman Mike Gibbons.",
    "Each candidate tried to convince voters why they should replace outgoing Senator Portman, who endorsed former Ohio Republican party chair Jane Timken.",
    "WILBERFORCE, Ohio (WJW) – Seven republican candidates vying to replace Ohio Senator Rob Portman in Congress squared off during a debate Monday night.",
    "–\nThe debate lasted for 90 minutes and was sponsored by the Ohio Debate Commission (you can watch the full debate in the video player above).",
    "“I’m a mom on a mission, ready to take our country back, to fight for American jobs, for border security, for parents’ rights and education.",
    "“This is my time to serve and as your next senator, I say that I would like to protect and secure our Constitution,” Patel said.",
    "My problem is he’s a failed president, everyone up on this stage wants to go to Washington to look backward,” said Dolan.",
    "The exchange of ideas comes exactly one week after five of the GOP hopefuls debated in the studios of FOX 8.",
    "Well, the eastern part should be the Gulf of Mexico and the western part should be San Diego.",
    "The candidates were also asked about what role they think religion should play in government.",
    "“I’ve created over 2,300 jobs for Ohioans, more than all my Senate opponents combined.",
    "Former Ohio state treasurer Josh Mandel said he’s fighting for the country’s future.",
    "Central Ohio businessman Neil Patel wants voters to give him a chance in Washington.",
    "The debate was held on the campus of Central State University in Wilberforce, Ohio.",
    "None of the candidates supported the U.S. establishing a no-fly zone over Ukraine.",
    "We’ve got a lot of show horses in this race, but I’m the workhorse,” Timken said.",
    "I’m doing this because I believe our country is in peril,” said Pukita.",
    "We’re going to have to investigate these things,” said Gibbons.",
    "Entrepreneur Mark Pukita says he can bring jobs to the state.",
    "“Joe Biden is the legitimate president of the United States.",
    "Everyone who answered said no, he should not recuse himself.",
    "That’s the border that we have with Mexico,” said Vance.",
    "You can find out more about that event right here.",
    "You said the eastern to the western part.",
    "“We need to finish Trump’s border wall.",
    "Why am I doing this?",
    "Vance."
  ]
}