{
  "id": 15401,
  "mediaId": 8496,
  "date": "2022-03-10",
  "headline": "DeWine declines to participate in gubernatorial primary debate",
  "image": "https://media.wkyc.com/assets/WBNS/images/a336d699-5524-47b2-b75b-8630fe7935f8/a336d699-5524-47b2-b75b-8630fe7935f8_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/politics/elections/dewine-declines-gubernatorial-primary-debate/530-9e77d747-be90-4369-ac61-ab0d574b862e",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The U.S. Senate debates will be held on Monday, March 28 beginning with the Democrats at 11:30 a.m. and the Republicans at 7 p.m.\nDemocratic candidates for U.S. Senate include Morgan Harper, Traci Johnson and Tim Ryan.",
    "10TV reached out to DeWine's campaign and received the following statement about his decision to decline the invitation:\n\"Mike DeWine is the most publicly accessible Governor in Ohio history.",
    "The debates for gubernatorial and U.S. Senate primary candidates will be held March 28-29 at Central State University in Wilberforce.",
    "In addition to DeWine, who is seeking re-election, other Republicans in the primary include Joe Blystone, Ron Hood and Jim Renacci.",
    "According to a news release, the commission said the governor did not provide a reason and it hopes he reconsiders his decision.",
    "The group of Republicans include Matt Dolan, Mike Gibbons, Josh Mandel, Neil Patel, Mark Pukita, Jane Timken and JD Vance.",
    "The gubernatorial Republican primary debate will be Tuesday, March 29 at 11 a.m. followed by Democrats at 7 p.m.",
    "Mike DeWine has declined to participate in a primary debate against other Republican gubernatorial candidates.",
    "Governor DeWine meets with constituents on a daily basis and regularly takes questions from the media.",
    "Ohioans know where he stands on the issues and that he is fighting and winning for them.\"",
    "The commission adds no other candidate has declined their invitation to participate.",
    "COLUMBUS, Ohio — The Ohio Debate Commission announced Thursday Gov.",
    "The Democratic candidates are John Cranley and Nan Whaley.",
    "The school is the only public HBCU in Ohio."
  ]
}