{
  "id": 1747,
  "mediaId": 8444,
  "date": "2022-02-16",
  "headline": "DeWine re-appoints former utility lawyer as utility regulator",
  "image": "https://ohiocapitaljournal.com/wp-content/uploads/2019/12/DeWine-Dayton.jpg",
  "link": "https://ohiocapitaljournal.com/2022/02/11/dewine-re-appoints-former-utility-lawyer-as-utility-regulator/",
  "mediaOutlet": "State News - United States - Ohio",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Zuckerman",
  "authorUrl": "https://ohiocapitaljournal.com/author/jake-zuckerman/",
  "termIds": [
    0
  ],
  "sentences": [
    "The commission makes regulatory decisions on things like whether utility companies can increase gas and electric costs, whether they’re using their monopolistic power to generate “significantly excessive” profit margins, or whether companies can add extra fees on top of customers’ bills in the form of “riders.”\nThe appointment comes in a moment of heightened scrutiny of Ohio’s energy policy and the government apparatus that regulates it.",
    "“At every turn, DeWine continues to prove that he is focused on big corporations and special interests, not everyday Ohioans who are still footing the bill for the HB 6 bribery scandal.”\nHer opponent, former Cincinnati mayor John Cranley, announced scorched-earth plans in November: “clean house,” fire everyone on the PUCO, and reform the nomination process.",
    "Before DeWine announced his decision Thursday, the OCC and the Ohio Poverty Law Center jointly called on him to reject the entire slate of candidates the nominating council provided him — all of whom bear close ties to the energy and utility industries.",
    "The OCC has drawn attention to texts mentioned in court documents and later obtained in a records request referring to Randazzo “burning” an audit into a controversial and later overturned $460 million charge to FirstEnergy customers as PUCO chairman.",
    "The selection of Conway from a shortlist curated by the PUCO’s nominating council undercuts DeWine’s pledge in January that he wouldn’t name appoint anyone to serve as regulator with ties to the energy and utility industry.",
    "Federal law enforcement officials in 2020 accused Akron-based FirstEnergy Corp. of secretly providing more than $60 million to a nonprofit controlled by the former Speaker of the Ohio House to pass House Bill 6 in 2019.",
    "“Governor DeWine just had an opportunity to show us that he wasn’t beholden to the utility industry, and he failed – again,” said gubernatorial candidate and former Dayton mayor Nan Whaley in a statement.",
    "The two leading Democrats seeking to challenge him in a general election have sought to make the once obscure PUCO appointment process (which is subject to review by the state Senate) a campaign issue.",
    "“We think it’s unfortunate for the public that utility personnel were ever nominated, appointed and confirmed to regulate utilities as PUCO commissioners.”\nDeWine is up for reelection later this year.",
    "Financial disclosure statements from Conway, obtained by the Energy and Policy Institute, show he obtained a gift of unspecified size from American Electric Power Service Company in 2018.",
    "It also created similar subsidies for three Ohio utility companies — American Electric Power, Duke Energy and AES Ohio — for their losses on two coal-fired power plants.",
    "The PUCO has since blocked the OCC’s requests to subpoena the original auditing firm, Oxford Advisors, which was ultimately replaced after only filing an interim audit.",
    "In doing so, it also admitted to paying $4.3 million as a bribe to former PUCO chairman Sam Randazzo shortly before his appointment in exchange for regulatory favors.",
    "Court records show Conway frequently represented utility companies like Columbia Gas, American Electric Power and Monongahela Power Company as an attorney before Gov.",
    "FirstEnergy entered into a deferred prosecution agreement with the U.S. Department of Justice last summer to potentially avert a related charge of wire fraud.",
    "“I would simply note he has been a commissioner for 5 years, been recommended for appointment and subsequently appointed by the governor,” Schilling said.",
    "PUCO critics like the Ohio Consumers’ Counsel have alleged that the PUCO is essentially a shill for Ohio’s regulated, investor-owned utility companies.",
    "“All four of the nominees have a background and connections to the utility industry,” the organizations’ directors wrote in a letter to DeWine.",
    "Mike DeWine named attorney and incumbent utility regulator Dan Conway to renew his five-year term on the Public Utilities Commission of Ohio.",
    "PUCO commissioners oversee utility companies, adjudicating disputes between residential, industrial, commercial, and utility interests.",
    "He said the criteria, mentioned in an interview with Gongwer News Service, was only intended to be applied to a “vacancy” on the PUCO.",
    "PUCO spokesman Matt Schilling didn’t respond to written questions about the existence or appearance of a conflict of interest.",
    "The company, through a nonprofit, contributed $700,000 to the nonprofit that prosecutors say Householder secretly controlled.",
    "It is also the largest equity partner of the company that operates the coal plants that are subsidized under HB 6.",
    "The legislation created ratepayer-funded bailouts to nuclear plants owned at the time by a FirstEnergy subsidiary.",
    "DeWine re-appointed Conway to his current seat, the spokesman said, meaning there was no “vacancy” to be filled.",
    "The PUCO has also received two subpoenas in connection with the investigation, according to a spokesman.",
    "“Commissioner Conway has a track record of being judicious and weighing issues from all sides.",
    "I appreciate Commissioner Conway’s continued service on the PUCO,” DeWine said in a statement.",
    "Among Conway’s former clients, AEP is particularly close to the HB 6 scandal.",
    "Randazzo has not been charged with a crime and has maintained his innocence.",
    "The U.S. Securities and Exchange Commission subpoenaed AEP last summer.",
    "A DeWine spokesman downplayed the governor’s apparent reversal.",
    "Conway declined an interview request.",
    "John Kasich appointed him in 2017.",
    "His first term ends in April.",
    "Gov."
  ]
}