{
  "id": 2045,
  "mediaId": 8323,
  "date": "2022-02-07",
  "headline": "Location selected for Ohio US Senate, governor primary debates",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2021/11/9296a1739e7c472284a9b0f73910673b.jpg?w=1280",
  "link": "https://fox8.com/news/location-selected-for-us-senate-ohio-governor-primary-debates/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cris Belle",
  "authorUrl": "https://fox8.com/author/cris-belle/",
  "termIds": [
    0
  ],
  "sentences": [
    "US Senate candidates for Republican nomination are State Senator Matt Dolan, businessman Mike Gibbons, Bill Graham, former State Treasurer Josh Mandel, Neil Patel, Mark Pukita, former chair of the Ohio Republican Party Jane Timken and author J.D.",
    "Republican gubernatorial office-seekers are Joe Blystone, a central Ohio farmer; incumbent Governor Mike DeWine; former State Representative Ron Hood and former Congressman Jim Renacci.",
    "DeWine in the video, above**\nCLEVELAND (WJW) — The Ohio Debate Commission has selected the location where primary debates for mid-term elections will be held this spring.",
    "The candidates seeking the Democratic Party nomination for Ohio Governor are former Cincinnati Mayor John Cranley and former Dayton Mayor Nan Whaley.",
    "The debates will be made available and free for broadcast and live-streaming to reach as many voters and parts of the state as possible.",
    "Central State University in Wilberforce will be home to the debates between US Senate candidates and Ohio gubernatorial candidates.",
    "If you’d like to submit a question or register for tickets, you can do that here at a later date to be announced.",
    "Democratic candidates are attorney Morgan Harper, Traci Johnson, Congressman Tim Ryan and LaShondra Tinsley.",
    "They’ll take the stage in The Paul Robeson Cultural & Performing Arts Center.",
    "Senator Rob Portman’s retirement leaves a seat open in Ohio’s US Senate.",
    "Guests will be socially distanced in the 1000 seat theater.",
    "Moderators have not yet been chosen or announced.",
    "**Watch our interview last month with Gov.",
    "DeWine is seeking his second 4-year term.",
    "They’ll debate on Tuesday, March 29.",
    "They’ll debate on Monday, March 28.",
    "Vance.",
    "Gov."
  ]
}