{
  "id": 2746,
  "mediaId": 2537,
  "date": "2022-01-31",
  "headline": "What campaign finance hauls say about the state of the Ohio governor's race in 2022",
  "image": "https://www.gannett-cdn.com/presto/2018/10/31/PMAN/8dbd72e5-5ede-4c7e-96bc-df8d5751c05d-Mike_pence_01.jpg?crop=4175,2348,x0,y382&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/politics/elections/2022/01/31/ohio-governor-dewine-raises-renacci-loans-and-democrats-duke-out/9201788002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"The Whaley-Stephens campaign knows that, in order to run a strong campaign in November, we need to spend money, smartly, now,\" Whaley's campaign wrote in a news release, pointing to a \"diverse campaign staff with deep roots in Ohio's communities,\" travel and digital organizing.",
    "The pro-DeWine dark money group, Ohioans for Free and Fair Elections, has spent $64,580 on Facebook ads to promote DeWine as a \"pro-business\" and \"pro-liberty\" Republican since November, according to the social media site's ad tracker.",
    "A pro-DeWine super PAC, Free Ohio PAC, has spent about $179,000 on television and radio ads that bash Democratic President Joe Biden while touting the Republican governor's \"Buckeye Blueprint,\" according to Medium Buying.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "Democratic challengers duke it out\nFormer Cincinnati Mayor John Cranley and running mate, state Sen. Teresa Fedor, reported raising nearly $1.05 million between July 2021 and the end of January.",
    "Fundraising numbers posted Monday offered some insight into the state of the race for governor in 2022 – valuable information as state party leaders mull endorsements before the May primary.",
    "Mike DeWine's fundraising might convince GOP faithful to back his reelection bid while his Democratic challengers' hauls indicate that neither is the clear frontrunner.",
    "He spent $1.8 million in the second half of the year, including more than $183,000 to consultant Brad Pascale, an ex-senior adviser to former President Donald Trump.",
    "And the Ohio Conservative Restoration Project, a pro-DeWine dark money group, has focused on attacking primary challenger Jim Renacci, a former U.S. representative.",
    "To date, Renacci's campaign has spent more than $142,000 on television and radio ads, according to Medium Buying, a Columbus-based ad buying and tracking company.",
    "However, Whaley and running mate Cheryl Stephens, a Cuyahoga County Council member, raised more money than Cranley's campaign: $1.26 million.",
    "The dark money fight is already raging\nThose sums are only a portion of the money that will be spent on expensive governor's races this year.",
    "Former U.S. Rep. Jim Renacci is self-funding his campaign, donating $4.8 million to his own bid and raising $148,700 from other donors.",
    "Another GOP challenger, Canal Winchester's Joe Blystone, had about $214,000 on hand after raising $314,500 and spending $235,000.",
    "“The campaign is grateful to have received such strong support from donors across Ohio,’’ Cranley said in a statement.",
    "Nearly half of that came from Cincinnati addresses, according to filings with the Ohio Secretary of State's office.",
    "The campaign has spent nearly $506,000, mostly on payroll and consulting, and has $1.9 million in its war chest.",
    "Republicans criticized Renacci for not spending his own money against Democratic Sen. Sherrod Brown in 2018.",
    "Jon Husted raised $3.3 million between July and the end of January and reported $9.2 million on hand.",
    "Cranley had been asking the party not to endorse despite seeking local party nods in the past.",
    "Renacci and his running mate Joe Knopp, a Christian film producer, have $4.1 million on hand.",
    "On Tuesday, Whaley tweeted that she wouldn't seek the Ohio Democratic Party's endorsement.",
    "Whaley's campaign spent $863,000 with its largest expenses being payroll and consulting.",
    "As the sitting governor tries to fend off Republican challengers, DeWine and Lt. Gov.",
    "That's more than former Dayton Mayor Nan Whaley, who reported $1.77 million on hand.",
    "The Ohio Republican Party is meeting Friday to consider possible endorsements.",
    "DeWine previously loaned his campaign $4 million, which has not been repaid.",
    "Cleveland.com first reported about the PAC.",
    "Gov."
  ]
}