{
  "id": 3746,
  "mediaId": 2570,
  "date": "2022-01-26",
  "headline": "Ohio Lawmaker Wants To End Wall Street Wealth Transfer At State Teachers Pension",
  "image": "",
  "link": "https://www.forbes.com/sites/edwardsiedle/2022/01/26/ohio-lawmaker-wants-to-end-wall-street-wealth-transfer-at-state-teachers-pension/?sh=488c80f5376e",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Edward Siedle",
  "authorUrl": "https://www.forbes.com/sites/edwardsiedle/",
  "termIds": [
    0
  ],
  "sentences": [
    "Further, assuming STRS pays fees of 2 percent on total unfunded capital commitments, aka “money for nothing,” this amounts to an annual waste of approximately $143 million—enough to restore the COLA benefit to 2 percent.”\nIn short, my forensic investigation of STRS Ohio revealed ample evidence to establish that reducing investment fees paid to Wall Street for secretive, esoteric “alternative” investments, such as private equity, hedge, venture and real estate funds (that have massively underperformed well-established passive indices) could easily cover the cost of restoring the COLA benefits.",
    "In fact, a June 2021 preliminary forensic investigation of Ohio STRS I conducted on behalf of the 20,000- member Ohio Retired Teachers Association concluded there is ample reason to believe “the total fees the pension pays to Wall Street are nearly double what it is reporting, amounting to almost $1 billion annually.",
    "Local media has unfairly criticized Fedor, claiming she doesn’t have a plan to pay for restoring the promised COLA, even as Fedor has suggested the STRS Ohio board look at reducing fees paid to Wall Street and possibly increasing the employer contribution rate.",
    "Not surprising, retirees weren’t told that cutting their COLA benefits by 3 percent to secretly pay Wall Street money managers ever greater fees—often in excess of 4 percent (even when they underperform)—does nothing to strengthen the pension.",
    "Cost of living benefits promised to retired teachers in Ohio were slashed a decade ago and then totally eliminated 5 years later, as payments by the state teachers’ pension to Wall Street’s highest cost money managers secretly skyrocketed.",
    "Local reporters are usually generalists and that’s why they are well-advised to interview experts on these matters, as opposed to merely printing assurances from defensive pension officials seeking to protect their fat salaries.",
    "In addition to reducing investment expenses and improving investment performance, shedding costly, secretive alternative investments in favor of passive index funds would also restore much-needed transparency to the pension.",
    "It’s simply a blatant wealth transfer scheme—the retirement security of hundreds of thousands of retired teachers is undermined to secretly enrich a handful of politically-connected Wall Street billionaires.",
    "To put the hidden, unreported fees—alone—into context, they amount to $2.75 million per school day, and more than twice the $210 million required to pay STRS COLAs annually.",
    "Rest assured, end the Wall Street wealth transfer at Ohio STRS and there will be plenty of money to enhance teacher retirement security by restoring promised COLA benefits.",
    "Ohio Senator Teresa Fedor would like to see COLA benefits promised to teachers restored and end this unconscionable secretive assault on teacher retirement security.",
    "It sounded simple enough: reducing benefits paid to teachers—cutting costs—would result in more money in the pension, i.e., increasing the pension’s funding level.",
    "An Ohio lawmaker wants to end this audacious wealth transfer by trimming payments to Wall Street and restoring the promised COLA benefits to deserving teachers.",
    "Ohio Democrat John Cranley recently picked Fedor, a long-time legislator from Toledo and a former school teacher, as his lieutenant governor running mate.",
    "I am accustomed to local media utterly lacking pension expertise regularly failing, for a host of reasons, to grasp and report on complex pension matters.",
    "Retired teachers in Ohio saw the 3 percent cost of living adjustments they had been promised slashed a decade ago and then totally eliminated in 2017.",
    "If she’s successful, legally-mandated transparency (which STRS Ohio long abandoned to facilitate the wealth transfer scheme) may finally return.",
    "Over the years retirees were told that cutting and then eliminating COLA benefits was necessary to shore up the pension’s finances.",
    "Fedor's bill has support from fellow Senate Democrats but no Republicans have signed on as co-sponsors.",
    "Fedor has introduced legislation to bring back the COLA, calling it \"the right thing to do.\"",
    "Retired teachers have suffered over the past decade as Wall Street has prospered.",
    "That sure sounds like a plan to me."
  ]
}