{
  "id": 3979,
  "mediaId": 2911,
  "date": "2022-01-27",
  "headline": "36 States Are Electing Governors This Year. Here Are 16 That Could Flip.",
  "image": "https://fivethirtyeight.com/wp-content/uploads/2022/01/2022-GOVERNORS-UPDATE-16x9-1.png?w=712",
  "link": "https://fivethirtyeight.com/features/36-states-are-electing-governors-this-year-here-are-the-races-to-watch/",
  "mediaOutlet": "FiveThirtyEight",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathaniel Rakich",
  "authorUrl": "https://fivethirtyeight.com/contributors/nathaniel-rakich/",
  "termIds": [
    0
  ],
  "sentences": [
    "Ron DeSantis, who adopted a hands-off attitude toward the coronavirus, was one of the few governors to see his approval rating decrease amid the pandemic, and three Democrats hope to be the one to end his political ambitions: Rep. Charlie Crist started the campaign as the primary front-runner, but state Agriculture Commissioner Nikki Fried has gained ground in more recent polls, and state Sen. Annette Taddeo has racked up some major endorsements as well.",
    "This version of partisan lean, meant to be used for congressional and gubernatorial elections, is calculated as 50 percent the state or district’s lean relative to the nation in the most recent presidential election, 25 percent its relative lean in the second-most-recent presidential election and 25 percent a custom state-legislative lean.",
    "States like Colorado, Connecticut and Illinois hosted close gubernatorial campaigns in 2010 and 2014, and while two out of the three election handicapping sites rate those state as “solid Democratic” for 2022, Sabato’s Crystal Ball lists them as only “likely Democratic,” acknowledging the possibility for them to get competitive.",
    "Former Rep. Lou Barletta has a history with Trump (though the former president hasn’t endorsed in this race yet); state Senate President Jake Corman has $3 million in the bank; former U.S. Attorney Bill McSwain has the support of a $20 million PAC; and almost a dozen other candidates have designs on the governor’s mansion too.",
    "State Treasurer Tobias Read and former state House Speaker Tina Kotek (who could also be the nation’s first openly lesbian governor) headline a crowded Democratic field, while former state House Minority Leader Christine Drazan and 2016 nominee Bud Pierce are among the Republicans in contention.",
    "However, even though Democrats flipped seven governorships in the 2018 midterms, this is likely to be a better cycle for Republicans: The political winds are at their backs, and Democrats are defending more governorships in red or purple states than Republicans are in blue or purple ones.",
    "In Massachusetts, Baker’s repudiation of former President Donald Trump has kept him in the good graces of the state’s many Democrats, but Republicans don’t appear interested in following that formula for his successor: The GOP front-runner is Trump-endorsed former state Rep. Geoff Diehl.",
    "At the same time, a pair of mayors — Nan Whaley of Dayton and John Cranley of Cincinnati — are facing off in the Democratic primary, no doubt hoping that the far-right Renacci could prove easier to topple than the popular (62 percent approval rating in the third quarter of 2021) DeWine.",
    "Defending enemy territory\nThree of the first four lines in the table above are the three deep-blue states with Republican governors — living proof that strong gubernatorial candidates can overcome their state’s partisanship to a degree congressional candidates can only dream of.",
    "Midterm dynamics suggest that 2022 is likelier to see Republicans making inroads into blue states than Democrats making inroads into red ones, but, since gubernatorial elections can sometimes break the mold, it’s also worth keeping an eye on a few light-red states.",
    "Regardless of who wins, the Republican nominee will likely take high unfavorable ratings (the primary has already turned negative) and a depleted bank account into a difficult general-election campaign against former state House Minority Leader Stacey Abrams.",
    "If you take the median rating of each gubernatorial race from the three major qualitative election handicappers (The Cook Political Report, Inside Elections and Sabato’s Crystal Ball), 16 races are something other than safely Democratic or safely Republican.",
    "Governors have the ability to block — or sign off on — election law changes and election-subversion efforts ahead of the 2024 presidential election, and they are also usually the ones making life-or-death decisions about COVID-19 policy in their states.",
    "As of the third quarter of 2021, a healthy 54 percent of Kansans approved of Kelly’s job performance, but she’ll face a formidable Republican opponent in state Attorney General Derek Schmidt, Kansas’s highest-profile state-level Republican officeholder.",
    "Gretchen Whitmer led her likely Republican opponent, former Detroit police chief James Craig, by margins of 5-10 percentage points, but she didn’t crack 50 percent in either poll, suggesting that the race will tighten as voters get to know Craig.",
    "The nightmare candidate for Democrats (and Republicans who care about electability) would be state Sen. Doug Mastriano, who participated in the Jan. 6 insurrection and plotted to overturn the 2020 presidential election results in Pennsylvania.",
    "Governorships up for election in 2022, by incumbent, incumbent party, median competitiveness rating and state partisan lean\nPartisan lean is the average margin difference between how a state or district votes and how the country votes overall.",
    "First elected in 2010 and reelected in 2014, LePage was the nation’s Trumpiest governor before “Trumpy” even made sense as a political description, routinely making headlines for racist comments and rejection of valid election results.",
    "Tim Walz led all five candidates he was tested against by at least 11 points, but he also took a consistent 47-48 percent in each matchup, so these numbers may tighten once Republicans settle on and get to know their nominee.",
    "Republicans also lack a top-tier candidate in Minnesota, where the gubernatorial hopefuls include former state Senate Majority Leader Paul Gazelka, state Sen. Michelle Benson and former Hennepin County Sheriff Rich Stanek.",
    "Though these states have rarely been competitive over the last three election cycles, we also haven’t experienced a Republican wave election in that span — and they were competitive during the GOP’s strong 2014 and 2010.",
    "Steve Sisolak, but he hasn’t exactly jumped out to a dominant lead: Heller raised just $650,000 in 2021, while Clark County Sheriff Joe Lombardo raised $3.1 million and North Las Vegas Mayor John Lee raised $1.6 million.",
    "Finally, Democrats have a celebrity candidate for governor of Texas (though not the one many thought): former Rep. Beto O’Rourke, who proved his mettle as a prodigious fundraiser with his voguish 2018 Senate campaign.",
    "Notable Democratic candidates include state Comptroller Peter Franchot, former Democratic National Committee Chair Tom Perez, former Prince George’s County Executive Rushern Baker and nonprofit executive Wes Moore.",
    "Working in her favor, though, is the fact that she faces an undistinguished Republican primary field: The biggest name is probably TV meteorologist Mark Ronchetti, who lost the state’s 2020 U.S. Senate race.",
    "Trump has endorsed former TV news anchor Kari Lake, who says she wouldn’t have certified Biden’s 2020 victory in Arizona and has called for the imprisonment of Democratic Secretary of State Katie Hobbs.",
    "Another red wave in 2022 could return him to the Blaine House, especially considering that Maine does not use ranked-choice voting in gubernatorial elections the way it does for federal office.",
    "It’s no surprise, then, that the other gubernatorial toss-up states are the usual suspects: the same six states that have topped the list of swing states in past presidential elections, too.",
    "Abbott has also led most general-election polls (though some have been within the margin of error), suggesting that Democrats’ best shot may be if Abbott loses the upcoming March 1 primary.",
    "Though Trump hasn’t weighed in on the race, he has issued veiled threats against DeWine, and Renacci is running a Trumpy campaign animated by DeWine’s support for coronavirus restrictions.",
    "Ominously for Democrats, Michigan and Wisconsin’s gubernatorial races have both historically gone with the midterm flow: Republicans won them in 2010 and 2014, Democrats in 2006 and 2018.",
    "Kate Brown is not eligible to run for reelection, her lowest-in-the-nation approval rating (according to Morning Consult last year) could weigh down the Democrats trying to succeed her.",
    "Break glass in case of red wave\nThen there are at least four light-blue states where Democrats are favored to hold the governor’s office — but the party shouldn’t take them for granted.",
    "CORRECTION (Jan. 28, 2022, 1:43 p.m.): An earlier version of this article said that there are at least four light-red states where Democrats are favored to hold the governor’s office.",
    "Toss-ups in a toss-up land\nPartisanship may not be the be-all-and-end-all of governor’s races, but it has been growing more and more important in recent gubernatorial elections.",
    "However, the tea party wing of the party (think Sen. Ted Cruz and the Club for Growth) is behind former Rep. Matt Salmon, and “undecided” leads primary polls by a wide margin.",
    "Tom Wolf from running again, but Democrats have a strong candidate in state Attorney General Josh Shapiro, who was Pennsylvania’s best-performing statewide Democrat in 2020.",
    "Though governors have always been important for their influence on health care, education, tax policy and more, the 2022 gubernatorial elections feel particularly urgent.",
    "Polls show Kemp leading Perdue and a handful of minor candidates, but not always by enough to avoid a runoff, which could consolidate the anti-Kemp vote around Perdue.",
    "If the national political environment in 2022 trends that favorably for Republicans, don’t be surprised to see these governorships get swept away in the red wave.",
    "The most recent general-election poll, conducted by Democratic pollster ALG Research, showed both Sisolak-Heller and Sisolak-Lombardo within the margin of error.",
    "Former Texas GOP chair Allen West and former state Sen. Don Huffines are challenging Abbott from the right, but independent polls have given Abbott a wide lead.",
    "O’Rourke raised $7.2 million in the first 46 days of his gubernatorial campaign, which certainly sounds impressive … until you consider that Republican Gov.",
    "Brian Kemp’s certification of Biden’s 2020 win in the Peach State, Trump turned on his one-time ally and recruited former Sen. David Perdue to primary him.",
    "As Democrats’ 2018 nominee for this office, Abrams already has a vaunted field and fundraising operation in place and so far faces no primary opposition.",
    "Tony Evers must contend with not only President Biden’s unpopularity in the state, but also his own mediocre approval ratings (45 percent last October).",
    "Republicans might even have a shot at their white whale — the Oregon governor’s office, which they lost by just 6 points in 2014 and 2 points in 2010.",
    "Their best shot is probably in Florida, which always seems to host a competitive election no matter if the year is good for Republicans or Democrats.",
    "By contrast, Democrats have a heavyweight candidate in state Attorney General Maura Healey, who could be the nation’s first openly lesbian governor.",
    "Coverage of the 2022 midterm elections has tended to focus on control of Congress — but control of state governments will be on the ballot too.",
    "Thanks in part to a $10 million campaign war chest, Shapiro has managed the nearly unprecedented feat of clearing the Democratic primary field.",
    "A handful of governors were on the ballot in 2019, 2020 and 2021, but the bulk of the nation’s chief executives get elected in midterm years.",
    "In Maryland, the primaries are more competitive, but the outcome still likely won’t change the fact that Democrats are favored in the fall.",
    "In fact, with policymaking in Washington at a standstill, state-level elections may well have the bigger impact on Americans’ daily lives.",
    "Finally, both the primary and general election for governor of Georgia are going to be among the most closely watched in the country.",
    "Kelly, though, is running for reelection, which has led handicappers to dub Kansas a toss-up rather than an easy Republican pick-up.",
    "As such, 36 states are hosting gubernatorial elections in 2022; Republicans are defending 20 seats, and Democrats are defending 16.",
    "The incumbent Republican governors in the following three states are certainly favored, but we can’t rule out a Democratic upset.",
    "Massachusetts and Maryland’s mirror image is Kansas, a deep-red state that nevertheless has a Democratic chief executive, Gov.",
    "New Mexicans are divided on her job performance, and she recently settled a lawsuit accusing her of sexual harassment.",
    "As a result, Massachusetts and Maryland are probably the two likeliest governor’s offices to change parties in 2022.",
    "Not all of those 36 races will be competitive, but the playing field is certainly larger than it is for the Senate.",
    "Here’s a breakdown of those races into four different categories based on what color turf they are being fought on.",
    "In Nevada, former Sen. Dean Heller is the big name in the crowded Republican primary to take on Democratic Gov.",
    "And if the red tide rises high enough, even bluer states could be at risk of electing a Republican governor.",
    "Hogan, however, has called Cox “a QAnon whack job” and endorsed state Secretary of Commerce Kelly Schulz.",
    "(The 2010 gubernatorial election was decided by 1.1 points, 2014 by 1.1 points and 2018 by 0.4 points.)",
    "Rebecca Kleefisch is the Republican front-runner here, but businessman Kevin Nicholson and former Gov.",
    "Charlie Baker and Larry Hogan are retiring, giving Democrats an excellent chance to flip their seats.",
    "Doug Ducey of Arizona is term-limited out this year, leaving an unsettled GOP field in his wake.",
    "The other two states would probably require a primary upset in order to get truly suspenseful.",
    "Meanwhile, Democrats again have a strong single front-runner: in this case, Hobbs herself.",
    "New Mexico also elected a Republican governor in 2010 and 2014, and Democratic Gov.",
    "Mike DeWine is facing a spirited primary challenge from former Rep. Jim Renacci.",
    "And the biggest prize on the state level, of course, is the governor’s office.",
    "Phil Scott of Vermont, is expected to run for reelection and should be safe.)",
    "Democrats have a couple opportunities to play offense in this category too.",
    "If she wins, she’d be the first Black female governor in U.S. history.",
    "It should have said at least four light-blue states, not light-red.",
    "Michelle Lujan Grisham could have trouble securing a second term.",
    "The list likely starts with Maine, where Republican former Gov.",
    "Dan Cox, who bused Trump supporters to the Jan. 6 Capitol riot.",
    "Greg Abbott had $65 million cash on hand at the end of 2021.",
    "The Republican primary, meanwhile, is a total free-for-all.",
    "In Pennsylvania, term limits are barring Democratic Gov.",
    "On the Republican side, Trump has endorsed state Del.",
    "(The final member of Maroon Three, Republican Gov.",
    "In two recent polls of Michigan, Democratic Gov.",
    "Paul LePage is looking to unseat Democratic Gov.",
    "(Sisolak, for his part, raised $4.5 million.)",
    "Tommy Thompson may yet still decide to run.",
    "But the band is breaking up: Popular Govs.",
    "In a December poll, Democratic Gov.",
    "And in Wisconsin, Democratic Gov.",
    "Furious at Republican Gov.",
    "Dare to dream, Democrats?",
    "Although Democratic Gov.",
    "Former Lt. Gov.",
    "Republican Gov.",
    "In Ohio, Gov.",
    "Laura Kelly.",
    "Janet Mills.",
    "Gov.",
    "4.",
    "3.",
    "2.",
    "1."
  ]
}