{
  "id": 4195,
  "mediaId": 2658,
  "date": "2022-01-25",
  "headline": "Trump conquered Ohio. Now his followers want the governorship.",
  "image": "https://static.politico.com/49/f7/b12aa5b34161a868b0794d7817f4/election-2018-senate-ohio-39148.jpg",
  "link": "https://www.politico.com/news/2022/01/25/trump-ohio-governorship-00001603",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Not only did he recently announce the largest economic development project in Ohio’s history, but he cut personal taxes by $2.2 billion and has signed the most pro-life and pro-2A legislation that Ohio has seen.”\nIt is unclear if Trump can be enticed to weigh in on the race, though he has flirted with it before.",
    "Parscale shared with POLITICO a polling memo from a survey conducted by Fabrizio Lee — Trump’s longtime pollster — that argued Renacci was in a strong position in his primary challenge, showing Renacci at 46 percent support to DeWine’s 38 percent in a head-to-head match-up among Republican primary voters.",
    "“Although some folks in the base are not happy with him because of the Covid decisions, he’s the most durable brand in Ohio politics,” said Mark Weaver, a former state deputy attorney general and longtime Republican operative in the state who worked on DeWine’s attorney general campaigns.",
    "The GOP primary could show just how far Trumpism, even without the former president’s direct involvement, can take a challenger against a more traditional conservative governor who clashed with the most strident parts of the Republican base during the pandemic.",
    "Renacci’s running mate Joe Knopp even signed off on a recent fundraising email raffling off an autographed copy of a film he worked on called “The Trump I Know.”\nBrad Parscale, Trump’s former campaign manager, is advising Renacci’s bid to dethrone DeWine.",
    "“Mike DeWine’s conservative record has been on display for the last three years,” said Brenton Temple, DeWine’s campaign manager, in a statement touting, among other things, the recent announcement that Intel will build a massive factory in Ohio.",
    "And by God, we’re going to stop him in 2022.”\nRenacci is following a well-trodden path of Republican hopefuls trying to catch the former president’s eye, lavishing praise on Trump and surrounding himself with staffers in Trump’s orbit.",
    "A second pro-DeWine group — Ohioans for Free and Fair Elections — has run between $17,000 and $23,000 of advertising on Facebook with positive messages about DeWine since last Thursday, according to the platform’s ad disclosure portal.",
    "“I was fighting him, and then coronavirus hits, and then everybody jumps in the game and says, ‘We gotta stop this guy,’” Renacci said of DeWine and the state Republican Party during a speech to local activists here last week.",
    "Renacci says he is pouring his own money into the race against the incumbent, trying to push DeWine out in favor of a candidate who claims to more wholly embody the Republican Party shaped by former President Donald Trump.",
    "But DeWine — who co-chaired Trump’s reelection bid in the state — has not faced the sustained barrage that Trump has launched against other Republican governors, like Georgia’s Brian Kemp or Arizona’s Doug Ducey.",
    "The effect is twofold: Airtime will be even more expensive in the battleground state, especially as the May 3 primary draws nearer, and the Senate primary is sucking up much of the political oxygen in the state.",
    "| John Minchillo/AP Photo\nBy Zach Montellaro and Michael Kruse\n 01/25/2022 04:31 AM EST\nSTRONGSVILLE, Ohio — GOP governors across the country are staring down a wave of Trump-inspired primary challengers.",
    "Renacci lost to Democratic Sen. Sherrod Brown by just under 7 points, while DeWine won the governorship and Republicans carried other statewide offices like secretary of state, treasurer and auditor.",
    "Trump seemed to talk up a primary challenge to DeWine in a November 2020 tweet shortly after DeWine became one of the first prominent Republicans to acknowledge President Joe Biden’s victory.",
    "DeWine was one of the first governors to order a state lockdown in March 2020, but his positions on managing the pandemic became controversial among Republicans over the course of the year.",
    "Neither DeWine nor Renacci have announced fundraising numbers yet, although the challenger announced in mid-January that he gave an additional $4 million of his own money to the campaign.",
    "The Senate primary has a raucous field where candidates are lobbing bombs at each other, already spending tens of millions of dollars on the race between candidates and outside groups.",
    "The memo — which was addressed to “Renacci donors” — did not share the entire survey questionnaire, nor did it mention the third Republican primary candidate: Joe Blystone, a farmer.",
    "Mike DeWine, a mainstay of Ohio Republican politics for decades who is seeking reelection to a second term in November, more than 30 years after his first run for statewide office.",
    "A super PAC called Free Ohio booked at least $240,000 worth of television and radio ad time in the state boosting DeWine, according to data from the ad tracking firm AdImpact.",
    "Others — like Alabama’s Kay Ivey — also have opponents trying to cast themselves as more loyal to the former president than the current occupant of the governor’s mansion.",
    "Weaver — who noted that Renacci’s internal poll didn’t include Blystone — said he is working for another pro-DeWine outside group this cycle, but declined to name it.",
    "DeWine has forged a long and decorated career in Ohio capped off by his governorship — but relations with his own changing party have been challenging at times.",
    "The polling, according to the campaign, shows that the vast majority of likely Renacci voters support Trump and believe the 2020 election was “stolen” from him.",
    "The Republican Governors Association “supports its incumbents,” spokesperson Chris Gustafson said of the Ohio race, declining to comment further.",
    "POLITICO previously reported that Trump remarked on Renacci’s 2018 loss during a March meeting with Ohio Senate Republican hopefuls in Florida.",
    "During his 2018 Senate run, Renacci loaned over $8 million to his failed bid, but his campaign ultimately repaid about $7.5 million of that.",
    "“And it is clear from the data that Mike DeWine is the anti-Trump candidate.”\nDeWine’s campaign declined to comment directly on the polling.",
    "The radio ad attacks Biden while promoting DeWine on taxes and cutting red tape, according to a copy of the ad obtained by Cleveland.com.",
    "Then-Rep. Jim Renacci, the 2018 Republican nominee for U.S. Senate in Ohio, shakes hands with then-President Donald Trump at a rally.",
    "Mike McCauley, who is listed as the organization’s treasurer on ad-buying forms, declined to share any details about the group.",
    "On the Democratic side, two former mayors are facing off for the nomination: Dayton’s Nan Whaley and Cincinnati’s John Cranley.",
    "(A phone number listed for the group was disconnected, and the organization did not respond to an email requesting comment.)",
    "Trump has backed former Sen. David Perdue’s primary challenge to Kemp in Georgia and threw his support behind Idaho Lt. Gov.",
    "The primary is developing as an early test case of intra-party rebellion against a number of Republican governors this year.",
    "The next big date on the primary calendar is Jan. 31, when candidates have to submit their 2021 annual fundraising reports.",
    "He was the sole Republican to lose statewide that year in Ohio, even with it being a strong year nationally for Democrats.",
    "“It’s amazing how many people, how many Republicans, in Ohio, believe the election was stolen,” Renacci told POLITICO.",
    "Another challenge for Renacci is breaking through while a contentious Republican primary to replace retiring GOP Sen.",
    "Renacci, meanwhile, has molded his campaign in Trump’s image — though he lacks Trump’s actual endorsement so far.",
    "Renacci also carries a black mark into his gubernatorial campaign: his unsuccessful 2018 Senate bid.",
    "“He’s a known quantity, and he knows how to campaign in the state,” Weaver continued.",
    "And Renacci’s camp is working hard to try to create a wedge between Trump and DeWine.",
    "In all those cases, national Republicans say they have the incumbents’ backs.",
    "Meanwhile, several pro-DeWine outside groups are backing up the governor.",
    "Former Rep. Jim Renacci hopes to be a success story for them in Ohio.",
    "All told, DeWine ran about 178,000 votes ahead of Renacci that year.",
    "DeWine isn’t the only Republican facing a Trump-inspired challenger.",
    "Allies of DeWine say the governor is in a good position.",
    "“Jim Renacci’s the only Trump candidate,” Parscale said.",
    "I was trying to stop him in 2017, 2018, 2019, 2020, ‘21.",
    "Both left office at the beginning of the year.",
    "The former congressman is challenging Gov.",
    "Janice McGeachin’s bid to defeat GOP Gov.",
    "Rob Portman is happening concurrently.",
    "“Well guess what?",
    "Brad Little."
  ]
}