{
  "id": 4723,
  "mediaId": 8358,
  "date": "2022-04-18",
  "headline": "Growing Ohio’s economy: What Ohio’s governor candidates are pledging",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/04/web1_Election-2022May-4.jpg",
  "link": "https://www.limaohio.com/news/505394/growing-ohios-economy-what-ohios-governor-candidates-are-pledging",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2143,
    2121,
    3346,
    1126,
    6060,
    6474
  ],
  "sentences": [
    "We believe with taking on a small amount of risk and making smart bets on Ohio entrepreneurs and growing corporations will greatly increase the number of jobs created and provide a much greater return on how your tax dollars are spent.”\nMike DeWine: “I have a vision for Ohio’s future and will work tirelessly each day to expand our economy and help give every Ohioan a shot at living their American Dream.",
    "I am committed to helping struggling Ohioans get better access to addiction and mental health treatment so they can get back to work and live up to their God-given potential.”\nNan Whaley: “First, we have to invest in Ohio’s small businesses.",
    "Jim Gaines - Springfield News-Sun, Ohio (TNS)\nThe Dayton Daily News asked the Republican and Democratic candidates for governor on the May 3 primary ballot where they stand on five major issues, including economic development.",
    "As his site’s only reference to economic policy, it was also used for his position on job creation:\n“Thanks to the policies of the Biden administration, there are millions of job openings and only a fraction are being filled.",
    "While watching our neighboring states choose a business-friendly atmosphere, Ohio clamped down on licensing, more regulations of corporations, and Ohio’s failure to invest in small businesses, the backbone of our great state.",
    "Moving away from a model mainly based on providing bridge funding for capital expenditures to more strategic investments in growth industries that require the brains from our universities and the brawn of our manufacturing.",
    "By building a more inclusive culture, we will retain and attract — rather than repel — the next generation of entrepreneurs.”\nJoe Blystone: “I will continue reducing burdensome regulations that inhibit responsible growth.",
    "Ohio will become competitive in the national job market if the focus is put on revamping the tax code, limiting licensing, and encouraging manufacturing through incentives, like surrounding states have done.”\nPrevious",
    "With the historic Intel economic development project coming to Ohio, which will bring more than 20,000 well-paying jobs, there is no question Ohio is becoming the global epicenter for modern manufacturing.",
    "“That’s why not only do we see more people flee our state each year than nearly any other state in the country, it’s also why our state’s economic recovery after the COVID-19 pandemic has been abysmal.",
    "More than 140 existing Ohio businesses across the state are already a part of Intel’s supply chain, and the project is expected to bring additional new businesses to Ohio to support the supply chain.",
    "Under my administration, that will change.”\nJim Renacci: “Simply put, Ohio’s ailing economy is a product of policies that have made our state unattractive and costly for workers and employers alike.",
    "Now, we have a great opportunity to bring Ohio back through the lengthy experience of Ron Hood and his serving on Ohio House committees that fostered job growth and restructuring.",
    "I will create the Ohio Business Compact, which pledges to help Ohio businesses grow if those businesses help Ohio’s workers grow, by creating good jobs that can support a family.",
    "Compare that with other Republican-led states with pro-family, pro-business and pro-worker tax policies, which have recovered all of the jobs they lost during the pandemic.",
    "As governor, I will revamp our tax code to make Ohio one of the most attractive states in America to open a business, grow a business, hire employees and raise a family.",
    "“We have a long history in industries such as aviation, steel, agriculture, and manufacturing everything from yesterday’s tractors to today’s most advanced jet engines.",
    "“As I’ve said, government doesn’t create private-sector jobs, but it can and must create an environment that encourages and promotes job growth and economic expansion.",
    "That money will help pay for infrastructure improvements such as universal, high-speed broadband so that every region of Ohio has access to the 21st economy.",
    "While Ohio ranks in the top 10 in highest tax states for families and workers, we’re also in the top 10 worst states when it comes to businesses taxes.",
    "(Editor’s note: the Tax Foundation ranks Ohio 14th in overall business tax climate, and 24th for state and local tax burden on individuals for 2022.)",
    "“At the heart of this campaign is a bold, transformative jobs plan to create 120,000 jobs that pay at least $60,000 annually in our first four years.",
    "I will focus on preparing for and growing those new jobs right here in our state, so that folks all across Ohio have the opportunity to thrive.",
    "“All this is only possible if we reorient our state government to focus on Ohio workers and businesses — not on campaign donors and lobbyists.",
    "Ohio doesn’t even rank in the top 20 when it comes to job recovery — we are currently still down nearly 200,000 jobs from before the pandemic.",
    "The Blystone Plan will continue to move our economy forward by making sure investments are made in growth industries that create jobs here.",
    "“To rise to its highest level, Ohio must also address our communities’ mental health challenges and grow our behavioral health workforce.",
    "As other conservative-led states have shown, we just need a governor with the political will, the integrity and the drive to get it done.",
    "Wages need to go up across the board, and I will use the full influence of the governor’s office to encourage companies to raise wages.",
    "We’ve reversed that decline and now it’s growing twice as fast as the state and reducing poverty one and half times faster than Ohio.",
    "These investments and projects are going to create seismic, generational opportunity for Ohioans in all four corners of our state.",
    "We will also fully fund a constitutional system to pay for K-12 education, giving our children the best chance to succeed.",
    "For too long, powerful special interests that run our Statehouse have gotten richer at the expense of Ohio communities.",
    "DeWine’s high tax policies that are crippling our economy, and driving both businesses and workers out of our state.",
    "We will pay for it by legalizing and taxing adult-use marijuana, reprioritizing JobsOhio and using existing bonds.",
    "Ohio’s government needs to support our small businesses if they are to create the high-wage jobs of the future.",
    "While the DeWine-Husted administration insists our recovery is going ‘as well as any state’ they are lying.",
    "The Blystone Plan will examine how the state currently distributes the revenue from state liquor sales.",
    "We will upscale the research and development capacities of our state universities and major hospitals.",
    "The future Ohio that I envision has the best, most robust behavioral health workforce in the country.",
    "This includes raising the minimum wage, supporting union organizing, and cracking down on wage theft.",
    "Compare that to our neighboring states, all of which are in the top 15 best states to do business.",
    "I will be that governor.”\nRon Hood: Hood’s campaign has not responded to requests for comment.",
    "Three years ago I launched Ohio’s Future Foundation to sound the alarm on Gov.",
    "Cincinnati, like many parts of the state, was losing population my whole life.",
    "Question: What should be done long-term to promote economic growth in Ohio?",
    "“Ohio already tops the charts with our manufacturing workforce.",
    "Look for profiles of the four Republican candidates on Sunday.",
    "Profiles of the Democratic candidates were published April 10.",
    "“Ohio also must reverse socially divisive policies that Gov.",
    "“Ron Hood has been working on job prosperity for many years.",
    "The Democratic candidates are John Cranley and Nan Whaley.",
    "Below are their responses, edited for length and clarity.",
    "This is the last of their responses on specific issues.",
    "John Cranley: “We need a governor who can get results.",
    "“Second, we have to invest in the jobs of the future.",
    "Mike DeWine, Joe Blystone, Ron Hood and Jim Renacci.",
    "The following comes from his campaign website.",
    "“Finally, we have to invest in Ohio workers.",
    "The Republican candidates are incumbent Gov.",
    "“Education is another key driver of growth.",
    "We did that by leading with our values.",
    "And that’s precisely what has happened.",
    "Dignity at work begins with good pay.",
    "“Ron Hood will change that.",
    "It’s not rocket science.",
    "DeWine has put in place."
  ]
}