{
  "id": 6540,
  "mediaId": 8494,
  "date": "2022-04-11",
  "headline": "Democratic Ohio gubernatorial candidate calls on state leaders to offer voluntary summer school",
  "image": "https://npr.brightspotcdn.com/dims4/default/2ee23b3/2147483647/strip/true/crop/2082x1093+0+87/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2F00%2F4e%2F5efd67044601b61e02698eb75920%2Fscreen-shot-2022-04-11-at-10.08.35%20AM.png",
  "link": "https://www.wksu.org/government-politics/2022-04-11/democratic-ohio-gubernatorial-candidate-calls-on-state-leaders-to-offer-voluntary-summer-school",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Republican Sen. Andrew Brenner, chair of the Senate Education Committee, said earlier this year that he'd like to see students receive college credit, an idea the state education department put into action last month.",
    "He and others who back his plan note many teachers work extra jobs in the summer to make money and think there will be a lot of them who would want to get paid to teach during the summer instead.",
    "Dewine and state leaders to make this change now so students can take advantage of this opportunity this summer but if they don’t, and if he is elected governor, he says he’d do it next summer.",
    "Cranley’s running mate, State Sen. Teresa Fedor (D-Toledo), a teacher herself, says the summer school opportunity would allow teachers to focus on students to better meet their needs.",
    "Cranley says current state leaders should take action now to make sure all Ohio school kids have the opportunity to voluntarily attend summer school to make up for lost learning.",
    "“We want our summer school plan to empower those teachers by giving them the flexibility of bringing non-traditional approaches that foster creativity and the love of learning.",
    "The response to Cranley's plan\nThe governor's office says he's already provided funds for summer learning to help kids who lost learning because of the pandemic get caught up.",
    "Earlier this year, the Ohio Department of Education announced school districts could take part in a grant program for summer school learning.",
    "DeWine has been encouraging local school boards to use these funds to focus on catching kids up that may have been adversely affected.",
    "The Ohio Department of Education reports nearly 24% of Ohio’s schoolchildren were chronically absent during the 2020-2021 school year.",
    "As for Cranley's Democratic opponent, former Dayton Mayor Nan Whaley, she says she's also asked DeWine to take action on this issue.",
    "DeWine's spokesman, Dan Tierney, says Ohio schools will have access to $6.5 billion in relief funds of their own from the feds.",
    "Some school districts have come up with plans of their own to help students who lost academic ground during the pandemic.",
    "So, it’s probably no surprise that the agency reports proficiency scores in key areas for that year dropped also.",
    "Cranley’s plan would use some of the $7 billion of federal pandemic money given to the state for education.",
    "Some have provided one-on-one tutoring and/or summer school to meet the needs of kids who are struggling.",
    "Former Cincinnati Mayor John Cranley, one of the Democratic candidates for governor, is calling on Gov.",
    "Mike DeWine and state leaders to offer summer school statewide this summer to help catch kids up.",
    "“We need to help students who fall behind during the pandemic catch up and to do so quickly.",
    "I believe this is a moral imperative, and we have the money to do it,” Cranley says.",
    "It used $89 million of the federal relief funds.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "And some state lawmakers want to do more.",
    "We want teachers to teach,\" Fedor says.",
    "You can read her statement below.",
    "Cranley wants Gov."
  ]
}