{
  "id": 6913,
  "mediaId": 8435,
  "date": "2022-04-14",
  "headline": "The Power of a City’s Resurrection",
  "image": "https://i0.wp.com/wordpress.thetruthtoledo.com/wp-content/uploads/2020/07/cropped-T-truth-1.jpg?fit=32%2C32",
  "link": "http://wordpress.thetruthtoledo.com/index.php/2022/04/14/the-power-of-a-citys-resurrection/",
  "mediaOutlet": "Sojourner's Truth",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sojourner’s Truth",
  "authorUrl": "http://wordpress.thetruthtoledo.com/index.php/author/jennifer/",
  "termIds": [
    0
  ],
  "sentences": [
    "For example, the Cleveland Plain Dealer notes, “Cranley’s record as Cincinnati’s mayor and the range and creativity of his proposals promise a better chance in November and a better outcome in the governor’s office.”\nI spoke with Cranley about his work in Cincinnati and how his proposals might breathe new life into Ohio, including Toledo.",
    "– Eleanor Brownn\nOhioans can say ‘Hello’ to vibrant socioeconomic life after death should voters hear and heed gubernatorial candidate John Cranley’s testimony of Cincinnati’s resurrection under his leadership.",
    "Cranley, who served as Mayor of Cincinnati from December 1, 2013, to January 4, 2022, believes that the comeback he engineered in Cincinnati demonstrates his ability to deliver throughout Ohio.",
    "A report from the Brookings Institute identifies Cincinnati as one of five cities offering a successful framework for using inclusive policies to boost wealth and lower poverty.",
    "Perryman: How will you address legislative issues such as HB-327, which prohibits the teaching of factual history and other things deemed divisive concepts by the Republicans?",
    "Cranley: I grew up in Cincinnati, blessed with faith at a young age, and went to Catholic grade schools and a Jesuit high school called St. Xavier, like St. John’s in Toledo.",
    "So, it felt like we were play-acting when people were literally being killed for standing up for their faith and ideals and for standing up for the poor and the oppressed.",
    "We will create a basic form of income through a dividend to families of $500 per year like they have in Alaska and North Dakota to help people pay for this high inflation.",
    "So, we will tackle and stop the algae blooms and use engineering and farmer-friendly solutions to reduce the fertilizer run-off, which causes a lot of the algae blooms.",
    "Perryman: How will you address the disparities that disproportionately affect minority populations and other issues, such as the attempt to defund public schools?",
    "We will ensure that clean water is never in question in Toledo, get rid of the smell and ensure that we’re taking advantage of a valuable asset like Lake Erie.",
    "I’m also going to restore local government funds that help the city provide the basic services it pays for but doesn’t get the money back from Columbus.",
    "We did a play about the life and assassination of Oscar Romero in high school, who was a human rights activist who was murdered in El Salvador in 1980.",
    "Then, of course, with Marcy Kaptur, who’s supporting our campaign, and Teresa Fedor, we’re also going to bring a community college into Lucas County.",
    "Do you have a specific plan to connect minorities and disaffected whites, including those who formerly voted for Obama but now are supporting Trump?",
    "For example, the number one issue facing inner-city and rural Ohio is the lack of access to good cell phone coverage and high-speed broadband Wi-Fi.",
    "Cranley: Well, it’s the worst scandal in the history of the State of Ohio, and it took money out of people’s pockets to bail out First Energy.",
    "I took city contracts with black-owned businesses from two percent to 17 percent during my time as mayor, and shootings were down last year.",
    "For the last 30 years, the Republicans have led to the average Ohioan making less money than the average American, so we need a comeback.",
    "It’s abominable that Governor DeWine has said that he knows that the maps he had voted for were not constitutional, but he did it anyway.",
    "I’m also going to fire the utility commissioners the day I’m sworn in and replace them with people who will stand up for the ratepayers.",
    "If we’re going to get the Ohio voters to fire Mike DeWine, we need to have a candidate whose economic record is better than the state’s.",
    "In addition, we’re going to propose optional summer school possibilities for families whose kids may have lost learning during COVID.",
    "Perryman: How about people dealing with these insane prescription drug prices and Medicaid expansion to seniors, women, and children?",
    "Cranley: Teresa and I have pledged to fully fund on a constitutional basis, which has never happened in 25 years of K-12 education.",
    "Cranley: I went to John Carroll University, where I was student body president, Harvard Law School, and Harvard Divinity School.",
    "With my law degree, I was the co-founder of the Ohio Innocence Project, which uses DNA evidence to get people out of prison.",
    "Others also attest to Cranley’s ability to bring new vigor to that which was collapsed and decayed as big news for Ohioans.",
    "There are community colleges in the other counties, but not in Lucas County directly, where you have the most diversity.",
    "There’s been a lot of exciting things happening to revitalize the city, and it needs a partner in the state to help out.",
    "Teresa and I will get broadband and Wi-Fi to the whole state in four years, and that’s a way to bring people together.",
    "We reduced poverty 1-1/2 times faster than the State of Ohio, and economically we grew twice as fast as the state.",
    "With Teresa Fedor as my running mate, we’re going to ramp up education from K-12 all the way to graduate schools.",
    "I’m going to take money from the special interests and put it in people’s pockets in the dividend, $500 per year.",
    "The Truth Contributor\nA comeback is a setback that did its homework, learned the lesson, and then moved forward.",
    "This policy is important to farmers, and it’s essential for inner-city kids to be able to do their homework.",
    "Perryman: Given the mess in Ohio’s restricting maps and our gerrymandering problem, how will you respond?",
    "We are also supporting a dividend to help people pay bills, which has never been tried before in Ohio.",
    "Perryman: So why John Cranley for Governor of Ohio, and why is the time right for your leadership?",
    "Those voters who voted for Obama and Trump also support legalized marijuana and my dividend idea.",
    "My program has freed 34 people in the last 20 years, and I’m very proud of that work and effort.",
    "So, my agenda unites the Democratic Party and reaches out to those very voters that we’ve lost.",
    "Perryman: Lastly, please provide The Truth’s readers with the essence of your campaign message.",
    "My personal staff was half white, half black, with leadership roles for women across the board.",
    "So, we’re going to have a standalone K-12 budget in the first 100 days of our time in office.",
    "Perryman: Do you have plans for bringing more women and minorities into leadership positions?",
    "When I was mayor, my police chief, fire chief, and parks director were all African Americans.",
    "Ohio used to be one of the biggest manufacturing powerhouses for the middle class in America.",
    "Cranley: Well, it’s so important that I picked my running mate, Teresa Fedor, from Toledo!",
    "Cranley: She’s an Air Force veteran, a public educator and a fighter for social justice.",
    "Toledo reminds me a lot of Cincinnati in it has enormous potential to make a comeback.",
    "Under my leadership, we became the first comeback city of Ohio to start growing again.",
    "I think we should teach our kids to be proud Americans but not sugarcoat our history.",
    "I’ve always had a diverse team that will reflect the diversity of the State of Ohio.",
    "Cranley: The way to unite them is an agenda that works for the inner city and rural.",
    "We have more black-owned businesses that make $500,000 a year than any city in Ohio.",
    "According to your perspective, what is Toledo’s importance to the State of Ohio?",
    "Perryman: There appears to be a relationship gap between urban and rural voters.",
    "I have delivered a comeback in Cincinnati that is better than the State of Ohio.",
    "While doing the play, six Jesuit priests were murdered in San Salvador again.",
    "Cranley: Of course, I’ve been mayor of Cincinnati for the last eight years.",
    "In contrast, Mike DeWine and the Republicans have made the state worse off.",
    "I think that’s the kind of leadership that I can offer the people of Ohio.",
    "Wages need to go up, and growth needs to happen in all parts of the state.",
    "We will legalize recreational marijuana and put the taxes into those jobs.",
    "That experience really changed my life to want to go into public service.",
    "They have it in Alaska and North Dakota, and we should have it in Ohio.",
    "The current leadership of the state under the Republicans has failed.",
    "Perryman: What were your accomplishments while mayor of Cincinnati?",
    "So, her heart’s in the right place, and she makes a great team.",
    "Perryman: What went into your decision to team up with Fedor?",
    "Donald Perryman, PhD, at drdlperryman@centerofhopebaptist.org",
    "My leadership has led to results, to actual tangible results.",
    "My primary opponent has underperformed the State of Ohio.",
    "I’ve provided faster growth and faster poverty reduction.",
    "Their leadership has failed, while mine has succeeded.",
    "We’re going to guarantee jobs that pay $60,000 a year.",
    "So, I have a master’s in theology and a law degree.",
    "Here is our conversation:\nPerryman: Good Afternoon.",
    "Let’s first let’s talk a little bit about your bio.",
    "Perryman: Let’s talk about Toledo-specific issues.",
    "Teresa Fedor and I will put money in your pockets.",
    "And, it’s also great to bring someone from Toledo.",
    "Cranley: Yes, absolutely, we support all of that.",
    "Perryman: Would you like to discuss First Energy?",
    "So, we want a community college in Lucas County.",
    "They inspired in me a sense of social justice.",
    "Mike DeWine takes money out of your pockets.",
    "Perryman: How about your higher education?",
    "We’re going to make that a huge priority.",
    "I don’t think we should be banning books.",
    "Cranley: I’ll follow the Constitution.",
    "Cranley: Well, Ohio needs a comeback.",
    "He broke his oath, and I never will.",
    "We will do the same as governor.",
    "Cranley: Ohio needs a comeback.",
    "We support anti-price gouging.",
    "I’ve done that in Cincinnati.",
    "Donald L. Perryman, Ph.D.",
    "Only my record is better.",
    "Cranley: I’ll fight it.",
    "I can do that for Ohio.",
    "Cranley: Absolutely.",
    "Contact Rev.",
    "By Rev."
  ]
}