{
  "id": 7004,
  "mediaId": 8496,
  "date": "2022-04-12",
  "headline": "Candidate for Ohio governor John Cranley suggests summer school push to make up for COVID learning loss",
  "image": "https://media.wkyc.com/assets/WKYC/images/f6342d60-81c4-46e4-902c-50d65542f6e3/f6342d60-81c4-46e4-902c-50d65542f6e3_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/ohio-governor-race-candidate-john-cranley-summer-school-covid-learning-loss/95-5d068472-a1dc-4452-9320-91fd0b7cb099",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1725,
    2605,
    2143,
    3493,
    1267,
    967,
    6474,
    6077
  ],
  "sentences": [
    "Dyer cites federal reports in saying the money leftover from pandemic aid distribution would fund summer school for much more than six weeks, and with a commitment by gubernatorial candidates to fully fund the educational funding overhaul called the Fair School Funding Plan, the summer school proposal could be a permanent option for schools.",
    "According to the U.S. Department of Education’s reports on Ohio, the state has only spent 21% of the overall awarded funds from the Elementary and Secondary School Emergency Relief Fund (ESSER) for various COVID-related interventions, such as help with chronic absenteeism and after-school care.",
    "Ohio’s interim superintendent of public instruction, Stephanie Siddens, told a state senate education committee at the beginning of 2022 that the pandemic had caused decreases in enrollment, increases in absenteeism and dips in state testing proficiency.",
    "Cranley said in the decades since the DeRolph v. Ohio decisions, in which the Ohio Supreme Court said the funding model for the state didn’t equally fund K-12 education, funding should have been the policy priority of any governor, including Gov.",
    "Cincinnati Mayor John Cranley and his running mate, state Sen. Theresa Fedor, D-Toledo, told reporters on Monday that the state has a “moral obligation” to pay for students to hit the books this summer, if they so choose.",
    "As a former teacher herself, Fedor said it was hard to watch teachers take on the pandemic, but see support going toward bills battling race education and bills reminiscent of Florida’s “Don’t Say Gay” bill.",
    "But since studies have revealed the losses in categories such as reading and math since the pandemic closed schools and changed the way students were educated, more needs to be done.",
    "Funds for the summer school wouldn’t only benefit the students who may have fallen behind during the pandemic, but also the teachers who have served as supports for those students.",
    "As for funding the summer school proposal, Steve Dyer of the Ohio Education Association says the state has more than enough funding left in federal COVID aid to cover the bill.",
    "Providing this option could allow teachers to continue the education through the summer, though Cranley acknowledges not every teacher will want to teach through the summer.",
    "“I think this rises to the level of leadership to deal with the incredible devastation that so many families have gone through during COVID,” Cranley said on Monday.",
    "“Ohio has had substantial achievement gaps before the pandemic and the gaps were further exacerbated by the events of the past two years,” Siddens said in January.",
    "“It’s something that is optional, but it’s something that needs to be there, and if nothing is done, our students will be further and further behind,” Fedor said.",
    "The state has only used 5.3% of the funds released under the American Rescue Plan for education, though those funds are available through September 2024.",
    "The candidates made it clear that the summer school program is optional, despite the importance of bringing Ohio’s kids back up to their grade-levels.",
    "The Cranley-Fedor plan announced Monday proposes a voluntary K-12 summer school program of at least six weeks for public or private school students.",
    "One gubernatorial candidate is saying the state should push for voluntary summer school to account for losses resulting from the COVID-19 pandemic.",
    "“As teachers watch their students struggle, my colleagues, the legislature, wanted to make things worse,” Fedor said.",
    "Cranley said the state has a 'moral obligation' to pay for students to hit the books this summer if they so choose.",
    "Editor's note: Video in the player above was originally published in a previous election story on April 7, 2022.",
    "Video in the player above was originally published from the Democratic gubernatorial debate on March 30, 2022.",
    "Dyer said some teachers he knows have to take side gigs in the summer, and may rather get paid to teach.",
    "“I think teachers would enjoy doing the thing they’re trained to do, rather than tend bar,” Dyer said.",
    "The program would include free and reduced breakfast and lunch, along with transportation.",
    "COLUMBUS, Ohio — Editor's note: This article was written by the Ohio Capital Journal.",
    "“This is not a question of money, it’s a question of commitment,” Dyer said.",
    "Mike DeWine."
  ]
}