{
  "id": 7147,
  "mediaId": 2550,
  "date": "2022-04-01",
  "headline": "Morning Digest: Why GOP leaders finally want to boot Madison Cawthorn (it's not really about orgies)",
  "image": "https://images.dailykos.com/images/1054700/story_image/GettyImages-1238861934.jpg?1648776186",
  "link": "https://www.dailykos.com/stories/2022/4/1/2089367/-Morning-Digest-Why-GOP-leaders-finally-want-to-boot-Madison-Cawthorn-it-s-not-really-about-orgies?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5399,
    5441,
    1893,
    3214,
    3418,
    3388,
    4066,
    1126,
    6051,
    6456
  ],
  "sentences": [
    "In his Thursday statement touting Edwards, he threw further shade, saying that unlike Cawthorn, his preferred candidate would \"never give up on his day job in search of celebrity status in Washington, D.C.\"\nCNN reports that other like-minded Republicans may soon board the Edwards bandwagon, and in fact, some powerful GOP figures already have: Earlier this month, before Cawthorn's latest spew, state Senate President Pro Tempore Phil Berger and state House Speaker Tim Moore announced that they'd hold a fundraiser for the challenger.",
    "The ad doesn't directly mention any of her opponents, though several of the many televisions that are for some reason strewn about the desert display footage of Democratic incumbent Michelle Lujan Grisham and 2020 GOP Senate nominee Mark Ronchetti as the narrator declares, \"Politicians and TV blowhards talk a lot about the border but out here show ponies spook pretty easily.\"",
    "The senator also horned in an unsubtle reference to Cawthorn's previous attempt to leave his constituents behind to run for an even more conservative district in the Charlotte area that he had almost no ties to before a new court-drawn map foreclosed that possibility, antics that likely did him far more damage at home than his litany of embarrassing behavior.",
    "In fact, it was Cawthorn's abortive move to shop for a more glamorous district that brought Edwards into the race in the first place: During the brief period when Cawthorn planned to run in the Charlotte-based district, Edwards hopped into the contest for Cawthorn's momentarily open seat, a district nestled into the state's far-western tip.",
    "Kapos writes that the commercial, which is not online yet, focuses on Irvin's past career as a defense attorney whose clients included \"violent criminals,\" which is the type of attack that Republicans more commonly use against Democrats—and which Kapos says represents a Democratic attempt to meddle in the GOP nominating contest.",
    "NC-11: Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. Chuck Edwards' campaign to defeat freshman Rep. Madison Cawthorn in the May 17 Republican primary, saying the next day that the incumbent \"has fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "Cannon last time sought to advance to the primary by competing at the party convention without also collecting petitions (we explain Utah's ballot access process here), so her narrow third-place showing at the party gathering ended her campaign; Moore, who edged out Cannon for second, went on to win the nomination 31-29.",
    "MD Redistricting: Democratic Attorney General Brian Frosh finally announced that he would appeal a recent state court ruling that struck down Maryland's new congressional map as an illegal partisan gerrymander on Wednesday, not long after the state House passed a revised map that the Senate had approved a day earlier.",
    "OR-06: Primary School highlights that Protect Our Future, a super PAC backed by cryptocurrency billionaire Sam Bankman-Fried, has deployed an additional $2.5 million to aid economic development adviser Carrick Flynn in the May Democratic primary for this new seat, which takes its total spending here to $3.7 million.",
    "NY Redistricting: A state judge invalidated New York's new congressional and legislative maps on Thursday, ruling that the Democratic-run legislature lacked the power to take over the mapmaking process even though the state's bipartisan redistricting commission failed to reach an agreement on new districts.",
    "OR-04: Climate Hawks Vote, a Democratic group that's supporting communications consultant Doyle Canning, has dropped a survey from Public Policy Polling that shows Labor Commissioner Val Hoyle leading Canning 24-8 in the May 17 primary to succeed retiring Rep. Peter DeFazio, with a 54% majority undecided.",
    "CT Mirror's Mark Pazniokas writes that the commercial, which is not online yet, highlights \"allegations by local officials in several towns that Diamantis pressured them to hire certain contractors\" and insists that Lamont's team knew about the allegations well before the FBI started its investigation.",
    "NV-Sen, NV-Gov: The Democratic firm Blueprint Polling, which says it has no client here, shows former Attorney General Adam Laxalt leading Democratic Sen. Catherine Cortez Masto 47-40 while his fellow Republican, Clark County Sheriff Joe Lombardo, enjoys a smaller 43-40 edge over Democratic Gov.",
    "Steuben County Surrogate Court Judge Patrick McAllister, a Republican, ordered lawmakers to produce new maps by April 11 and, in a very unusual move, decreed that any such maps pass with \"a reasonable amount of bipartisan support,\" though he did not specify what such a threshold might look like.",
    "The survey was also finished before Cawthorn humiliated House Minority Leader Kevin McCarthy and other party leaders this week when he claimed on a podcast that an unidentified colleague had invited him to an \"orgy\" and that he'd witnessed prominent conservatives doing \"a key bump of cocaine.\"",
    "Tillis asserted that Edwards would \"never turn his back on Western North Carolina or abandon his constituents for the sake of political expediency\" and wouldn't \"embarrass Western North Carolina with a consistent pattern of juvenile behavior, outlandish statements, and untruthfulness.\"",
    "AK-AL: Independent Jeff Lowenfels, a former oil executive and state prosecutor who has published a gardening column in the Anchorage Daily News for 45 years, announced Wednesday that he would run in both the special election and regular contest to succeed the late GOP Rep. Don Young.",
    "NE-02: Democratic state Sen. Tony Vargas' allies at 314 Action are out with a Change Research survey that gives him a narrow 40-39 edge over Republican incumbent Don Bacon; this is the first poll that's been publicized for this Omaha-based seat, which would have favored Biden 52-46.",
    "SC-01: Freshman Rep. Nancy Mace infuriated Donald Trump last year when she blamed him for the Jan. 6 attack, and he responded in February by endorsing former state Rep. Katie Arrington's primary campaign against her in South Carolina's 1st District along the state's southern coast.",
    "In 2018, Arrington denied renomination to another incumbent who wound up on Trump's bad side, the one and only Mark Sanford, before losing the general election to Democrat Joe Cunningham, and Mace is arguing Arrington would again endanger Team Red's hold on this seat.",
    "North Carolina Rep. Madison Cawthorn\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "That's because the leading candidate in a primary only needs to clear 30% of the vote in order to avoid a July runoff, and with six other candidates running, it's very possible that Cawthorn can win outright even if he falls well short of a majority.",
    "Rob Bishop, who retired last cycle after 18 years in Congress, published an op-ed in the Deseret News this week detailing five reasons why he's supporting former Morgan County Councilmember Tina Cannon, who unsuccessfully ran to succeed him in 2020.",
    "NY-12: Voting rights advocate Maya Contreras, who struggled to raise money last year, announced Thursday that she was ending her Democratic primary bid against Rep. Carolyn Maloney, though several other intra-party challengers are still running.",
    "However, while PPP found that primary voters would be less likely to support a candidate who backed Jordan Cove, the release doesn't include any questions informing respondents about Canning or anyone else's positions on the now-defunct project.",
    "OHPI also sampled the governor's race but for some reason did not allow respondents to select undecided as an option, requiring us to disregard those results, and we haven't seen any other general election numbers for that contest in 2022.\n?",
    "Cawthorn's failed district-hopping endeavor seemed to be aimed both at boosting his own profile and bullying Moore out of a planned campaign for Congress, so it probably didn't take much to persuade the speaker to come out against him now.",
    "MO Redistricting: Missouri's state Senate rejected a request by the state House to create a conference committee that would hash out a compromise over a new congressional map after the two Republican-run chambers passed different versions.",
    "Hogan is a longtime critic of Democratic incumbent Marilyn Mosby, who is under indictment for allegedly filing false mortgage applications and lying to federal prosecutors, and he argued that defeating her \"rises above partisan politics.\"",
    "Lamont did fire Diamantis last year over questions about how Diamantis' daughter received a $99,000-a-year job in the chief state's attorney's office, and the governor says he wasn't informed about the earlier complaint until afterwards.",
    "IL-Gov: Politico's Shia Kapos reports that the DGA is spending $728,000 on an ad campaign, which is its first broadcast TV buy anywhere in 2022, designed to weaken Aurora Mayor Richard Irvin well ahead of the June Republican primary.",
    "UT-01: Freshman Rep. Blake Moore doesn't appear to be in danger ahead of the June Republican primary for this safely red seat in northern Utah and the northern suburbs of Salt Lake City, but his predecessor is hoping to change that.",
    "SC-07: Rep. Tom Rice shocked observers last year when he became one of the 10 House Republicans to vote to impeach Donald Trump, and he now faces six primary opponents in this safely red seat in the northeastern part of the state.",
    "Republican legislators sought to protect their hold on this seat by extending Trump's 2020 margin from 52-46 to 54-45, but Team Blue is hoping another nasty GOP fight will give them an opening, especially if Arrington beats Mace.",
    "OH-Sen: Former state Treasurer Josh Mandel and his allies have been running ads portraying businessman Mike Gibbons as demeaning towards the military, and Gibbons is now up with a response spot as the two compete for the GOP nod.",
    "In response, the House again demanded a conference committee, though there's virtually no chance of one, as a band of far-right senators promised to once more grind legislative business to a halt if the Senate were to acquiesce.",
    "Climate Hawks argues that Canning, who challenged DeFazio for renomination in 2020 and lost in an 84-15 landslide, has room to grow because of her opposition to the Jordan Cove Energy Project, which was canceled late last year.",
    "IL-03: State Rep. Delia Ramirez has publicized an internal from Impact Research that shows her leading Chicago Alderman Gilbert Villegas 25-10 in the June Democratic primary for this open seat, with a 62% majority undecided.",
    "The winner of the Democratic nomination should have no trouble prevailing in the general election in this loyally blue municipality: Even Hogan lost Baltimore 67-32 in 2018 while he was winning re-election 55-44 statewide.",
    "The commercial touts the state senator's farming background and fights against Madigan and Pritzker before the narrator declares he's running with a \"plan to cut taxes, increase police funding, and prevent voter fraud.\"",
    "OK-Sen-B, OK-Sen-A: The Republican firm Amber Integrated, which does not have a client for this poll, has released the very first survey we've seen of the June special GOP primary to succeed outgoing Sen. Jim Inhofe.",
    "TN-05: State Sen. Heidi Campbell filed paperwork with the FEC this week for a potential bid to succeed Rep. Jim Cooper, a fellow Democrat who announced his retirement after the GOP legislature gerrymandered his seat.",
    "ID-02: Both incumbent Mike Simpson and attorney Bryan Smith are out with new ads attacking one another ahead of their May 17 Republican primary showdown, which is a rematch of the 2014 contest that Simpson won 62-38.",
    "The DGA's buy is a mere fraction of the nearly $19 million AdImpact reports that wealthy incumbent J.B. Pritzker has already spent, though the Democratic governor hasn't targeted any of his many Republican foes yet.",
    "Note that in New York, the \"Supreme Court\" is in fact the lowest level of the court system; the intermediate appellate court is the Appellate Division, and the state's highest court is known as the Court of Appeals.",
    "A mid-March Public Opinion Strategies survey obtained by Jewish Insider's Matthew Kassel shows the far-right congressman defeating Edwards 52-20, while a third candidate who went unidentified in the memo takes 11%.",
    "Smith, for his part, is airing a commercial in which the narrator insists that, despite what Simpson claims, the challenger \"donated to President Trump and helped to nominate him for president as a Trump delegate.\"",
    "Lowenfels, among other things, used his campaign announcement to tout that he was the one who \"introduced pizza by the slice to Alaska\" in 1975 when he co-founded a New York-style pizza restaurant in Anchorage.",
    "NV-04: Air Force veteran Sam Peters is out with a WPA Intelligence poll arguing that the 2020 primary runner-up is in good shape this time to claim the Republican nod to take on Democratic Rep. Steven Horsford.",
    "The only poll we've seen was a February Remington Research Group survey for Arrington that showed Mace beating her 50-35 but argued that the challenger would pull ahead once voters learned she was Trump's pick.",
    "UT-Sen: Dan Jones & Associates' new survey for the Deseret News and University of Utah shows Republican incumbent Mike Lee leading conservative independent Evan McMullin 43-19, with Democrat Kael Weston at 11%.",
    "The pollster argues that Edwards could gain ground once respondents learn more about him and are exposed to negative messaging about Cawthorn, such as claims that he \"favors cutting the U.S. military budget.\"",
    "Another independent running in the top-four primary, 2020 Democratic Senate nominee Al Gross, has meanwhile picked up the support of Tony Knowles, who is the Last Frontier's most recent Democratic governor.",
    "CNN says that even Cawthorn's compatriots at the far-right Freedom Caucus are pissed and have considered ejecting him from their ranks, though these same sources acknowledge such a banishment is unlikely.",
    "NM-Gov: In her first ad for the June Republican primary, state Rep. Rebecca Dow tours a section of the border on horseback with a group of sheriffs and tells the audience, \"I'm not here to put on a show.",
    "This time Cannon, as well as Moore and Vineland Mayor Julie Fullmer, are pursuing both the signature and convention routes, while retired intelligence officer Andrew Badger is only gathering petitions.",
    "Irvin, who has far outspent his intra-party opponents by already spending $7.2 million thanks to the $20 million he's already received from billionaire Ken Griffin, is also out with a new commercial.",
    "As Tillis put it, \"It comes down to focus on the district, producing results for the district, and in my opinion, Mr. Cawthorn hasn't demonstrated much in the way of results over the last 18 months.\"",
    "Mosby that same year fended off a primary challenge from defense attorney Ivan Bates 49-28, with Vignarajah securing 23%; Vignarajah campaigned for mayor in 2020, but he finished fourth with 12%.",
    "State Sen. Darren Bailey, for his part, is also running his first ad, which the Chicago Tribune says is airing downstate rather than in the far more populous and expensive Chicago media market.",
    "NY-16: Freshman Rep. Jamaal Bowman has earned the backing of the influential healthcare workers union 1199SEIU in his June Democratic primary against Westchester County Legislator Vedat Gashi.",
    "Five Democrats are also in, with the two most prominent being former Rep. Joe Cunningham, who lost a tight race for a second term last cycle in the 1st District, and state Sen. Mia McLeod.",
    "The concurrent primary contest for the regular six-year term looks far less competitive, as Amber Integrated gives incumbent James Lankford a 63-10 advantage over pastor Jackson Lahmeyer.",
    "The only other survey we've seen of the Senate race was a January poll from the GOP firm OH Predictive Insights for the Nevada Independent, and it had Cortez Masto ahead of Laxalt 44-35.",
    "The only other poll we've seen was conducted about a month ago by Lake Research Partners on behalf of the pro-Ramirez Working Families Party, and it gave Ramirez a smaller 19-11 edge.",
    "Pazniokas reports, however, that while a contractor did complain in 2020 to two administration officials, \"There is no evidence that either brought the letter to Lamont's attention.\"",
    "Trump's endorsed candidate is state Rep. Russell Fry, while former Myrtle Beach Mayor Mark McBride and Horry County Schools Board of Education Chairman Ken Richardson are also in.",
    "NH-Sen: Millionaire cryptocurrency enthusiast Bruce Fenton announced Wednesday that he was joining the September Republican primary to take on Democratic incumbent Maggie Hassan.",
    "The mayor tells the audience that he won his first campaign despite opposition from the Illinois GOP's favorite foil, former state House Speaker Mike Madigan, adding, \"Now Gov.",
    "Dan Jones also takes a look at the June GOP primary and finds Lee easily defeating former state Rep. Becky Edwards 67-19; OH Predictive Insights previously had him ahead 51-5.",
    "Kassel adds, \"The poll did not include references to some of Cawthorn's recent controversial remarks, such as describing Ukrainian President Volodymyr Zelensky as a 'thug.'\"",
    "MI-10: Donald Trump has endorsed two-time Senate nominee John James, who doesn't face any serious Republican primary opposition weeks ahead of the April 19 filing deadline.",
    "Another Republican, venture capitalist Jesse Sullivan, is likewise running a new spot of his own starring six sheriffs from rural Illinois praising him as tough on crime.",
    "due to an antiquated cap on the number of Supreme Court justices in the state constitution; normally, the Surrogate's Court handles matters related to wills and estates.",
    "CT-Gov: CT Truth PAC, a group that has received at least $500,000 in funding from a GOP donor named David Kelsey, is running a negative TV spot tying Democratic Gov.",
    "A mid-March poll for Fry from Ivory Tusk Consulting (which is run by fellow state Rep. R.J. May) had him leading Rice 39-18, with everyone else taking single digits.",
    "MI-Gov: The Detroit News reports that wealthy businessman Kevin Rinke has launched a new $500,000 TV, radio, and digital buy ahead of the August Republican primary.",
    "To make matters more confusing, McAllister presided over this case as an \"acting\" Supreme Court justice (yes, trial court judges in New York are called \"justices\"!)",
    "On Thursday, he released an ad arguing that, even as \"[t]he entire left-wing establishment has targeted\" him as \"public enemy number one,\" he \"cannot be stopped.\"",
    "But while the cocaine-and-orgy remarks made national headlines, Cawthorn's poor politicking back home has been the chief source of the congressman's troubles.",
    "However, even if Edwards—and Cawthorn's own mouth—can further weaken the incumbent, the state's election laws still pose a huge obstacle for any challengers.",
    "One little-known candidate, Lynz Piper-Loomis, is also in, and her presence could be enough to keep either Mace or Arrington from winning without a runoff.",
    "When state courts replaced the GOP's gerrymandered map with a much fairer one, and Cawthorn skipped back home, Edwards was adamant that he wouldn't defer.",
    "Rinke's spot describes how the candidate \"lost his brother in a terrible plane crash, and in a time of sorrow, he led the family business out of crisis.\"",
    "The survey shows Peters beating Assemblywoman Annie Black 33-14 in the June primary, with 5% going to Las Vegas City Council aide Chance Bonaventura.",
    "A Marine veteran named Jeremy Gons tells the audience, \"Josh Mandel launched attack ads claiming that Mike Gibbons doesn't respect military service.",
    "Gons continues, \"Josh Mandel tells lies because Mike Gibbons told the truth: That Mandel is a 25-year career politician with no business experience.",
    "(Tillis highlighted Cawthorn's insult in his statement, saying Edwards won't \"find himself being used as propaganda on Russian state television.\")",
    "After a private meeting with Cawthorn on Wednesday, McCarthy said, \"I just told him he's lost my trust, and he's going to have to earn it back.\"",
    "Luke Holland, who is Inhofe's endorsed candidate and former chief of staff, takes just 2%, while former White House staffer Alex Gray is at 1%.",
    "One month ago, the GOP firm OH Predictive Insights had Lee beating McMullin by a smaller 34-24 margin, with Weston similarly situated with 12%.",
    "With no deal in sight, the odds that a court takes over increase day by day, and in fact, lawsuits have already been filed seeking just that.",
    "Rep. Markwayne Mullin leads with 39%, which is below the majority he'd need to avoid an August runoff, while former state House Speaker T.W.",
    "KS Redistricting: Kansas' Republican-run state House and Senate approved new legislative maps on Wednesday, sending them to Democratic Gov.",
    "Both chambers passed the maps with veto-proof majorities, and Kelly commented recently that she thought lawmakers \"did a pretty good job.\"",
    "Cannon used a recent appearance in front of a local party organization to unsubtly go after Moore for living outside the new 1st District.",
    "The incumbent, though, does represent over 90% of the redrawn seat, while Fullmer's Vineland community is located entirely in the new 3rd.",
    "Larry Hogan on Thursday endorsed prosecutor Thiru Vignarajah in the July Democratic primary to be the city of Baltimore's top prosecutor.",
    "Meanwhile, another GOP candidate, state Sen. Matt Dolan, is running a spot in which he pledges he'll \"fight Joe Biden's energy agenda.\"",
    "The final candidate, businessman William Campbell, is staking his campaign on a good performance at the April 23 party convention.",
    "VT Redistricting: Vermont's Democratic-run legislature has sent new maps for the state House and state Senate to Republican Gov.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "SC-Gov: Candidate filing closed Wednesday for South Carolina's June 14 primaries, and the state has a list of contenders here.",
    "However, an internal poll for Edwards himself underscores just how tough it will be for him to deny Cawthorn renomination.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Irvin, who is Black, continues, \"There's nothing the left fears more than Republicans who look like me and think like us.",
    "The fast movement on the latest plan met a court deadline that lawmakers enact a remedial map by Wednesday, though Gov.",
    "And if he does win renomination, he'll be difficult to beat in November in a seat that Trump would have carried 54-44.",
    "Another candidate, former prosecutor Roya Hanna, recently exited the Democratic primary to run as an independent.",
    "The release did not mention 2020 Senate candidate Alisha Shelton, who is Vargas' opponent in the May 10 primary.",
    "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n?",
    "I'm here to fight radical socialists, defend our constitutional rights, and finish President Trump's wall.\"",
    "Bishop, who badly lost his own bid for lieutenant governor that year, did not mention Moore in his piece.",
    "OH-Gov: Rep. Marcy Kaptur has endorsed former Cincinnati Mayor John Cranley in the Democratic primary.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWe open our mailbag and answer your questions!",
    "Ned Lamont to Kosta Diamantis, a former school construction chief whom the governor fired in October.",
    "OK-Gov: Amber Integrated (R): Kevin Stitt (R-inc): 44, Joy Hofmeister (D): 30 (Dec.: 47-32 Stitt).",
    "Henry McMaster for renomination in this red state, only two unheralded contenders ended up filing.",
    "That all lives matter, that cops should be defended not defunded, that handouts keep people down.\"",
    "Bates launched his rematch campaign against Mosby in 2021, while Vignarajah got in just last week.",
    "A June 28 runoff will take place in any contests where no one earns a majority of the vote.",
    "Bryan Smith sued me for $36 and change that I owed the pediatrician, plus attorneys fees.",
    "The congressman, just as he did years ago, is portraying his opponent as a greedy lawyer.",
    "The narrator continues, \"Tell Mayor Richard Irvin: Stop pretending to be tough on crime.",
    "The pollster did not test any of the other Republicans competing in either June primary.",
    "However, Democrats could once again override any veto, as they did with their first map.",
    "The plans passed the Senate unanimously and the House with only a few members opposed.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "While some notable Republicans previously expressed interest in challenging Gov.",
    "(Court-ordered redistricting ultimately left Moore without a seat to run for.)",
    "(One of them is the awesomely named, but little-known, Harrison Musselwhite.)",
    "On the Democratic side, pediatrician Annie Andrews has the field to herself.",
    "He called Trump unfit to be president, wouldn't endorse him against Hillary.",
    "Legislative Democrats immediately announced they would appeal the decision.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Mandel exploits military service to score dishonest political points.\"",
    "He concludes, \"Josh Mandel: I served our country, not your career.\"",
    "A retired policeman tells viewers, \"My daughter was born in 2012.",
    "(He didn't reside in the old 1st during the 2020 primary either.)",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Then he voted for Nancy Pelosi's anti-Trump Jan. 6 witch hunt.\"",
    "Shannon edges out state Sen. Nathan Dahm 14-6 for second place.",
    "Fenton previously told Politico that he'd self-fund $5 million.",
    "Dolan does not mention any of his intra-party opponents.",
    "Larry Hogan has yet to take action on the latest plan.",
    "(Mace herself unseated Cunningham two years later.)",
    "This is the first poll we've seen of this contest.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Cawthorn, predictably, shows no sign of changing.",
    "Start supporting policies that keep people safe.\"",
    "The very week Mike's son was deployed overseas.\"",
    "Baltimore, MD State's Attorney: Republican Gov.",
    "Pritzker is afraid that I'll beat him too.\"",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "He continues, \"And RINO Mike Simpson?",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "He refused our payment.",
    "It was all or nothing.\"",
    "Please read it.",
    "Redistricting\n?",
    "Steve Sisolak.",
    "Prosecutors\n?",
    "Laura Kelly.",
    "Former Rep.",
    "Phil Scott.",
    "Governors\n?",
    "Senate\n?",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}