{
  "id": 7482,
  "mediaId": 2537,
  "date": "2022-04-06",
  "headline": "Where Ohio Gov. Mike DeWine, his challengers stand on controversial HB 616",
  "image": "https://www.gannett-cdn.com/presto/2022/03/23/NCOD/6377e722-654f-40f9-92e6-b63cd680f519-State_of_the_State_BJP_10.jpg?crop=3599,2025,x0,y269&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/04/06/ohio-governors-race-where-dewine-challengers-stand-house-bill-616/9482309002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    5035,
    1764,
    1991,
    2143,
    3346,
    1477,
    6077,
    6474,
    6159
  ],
  "sentences": [
    "The Ohio Chamber of Commerce's President and CEO Steve Stivers expressed concern that \"some of the language in this bill may impede Ohio’s ability to lure the best and brightest minds to fill these openings and put down roots in the Buckeye State.\"",
    "\"Anyone who has a problem with this commonsense bill that stops kindergarteners from being indoctrinated with crazy and divisive ideas about sex, gender and race is truly off the deep end,\" Renacci said in a statement.",
    "Jessie Balmert and Anna Staver are reporters for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "Mike DeWine wants Ohio to be an \"inclusive\" and \"welcoming\" state but didn't take a position on House Bill 616, which would restrict how teachers talk about sexual orientation and gender identity.",
    "\"The state of Ohio wants to be an inclusive state that is growing and provides an opportunity for everybody no matter who you love, where you come from or what you believe.\"",
    "Critical race theory, an academic theory that's been taught at the collegiate level for decades, has recently become a lightning rod in conservative politics.",
    "The Ohio Chamber also supports proposed legislation to ban discrimination in housing or employment based on sexual orientation or gender identity.",
    "\"Like all bills, the real key is the language, and I've not seen the language,\" DeWine said Wednesday morning at the Columbus convention center.",
    "\"This is also something that, you know, one would hope that the Legislature would have hearings on and, you know, hear the pros and cons.",
    "House Bill 616 would ban discussion on sexual orientation and gender identity until fourth grade in all public and most private schools.",
    "In a previous interview, Blystone said he opposes equality and inclusion curriculum, which he calls \"indoctrination\" of Ohio's children.",
    "\"I absolutely support prohibiting teachers from injecting their woke identity politics into the classroom curriculum.\"",
    "\"That’s a taught behavior and that needs to stop.”\nDemocrats hoping to unseat DeWine decried the proposed legislation.",
    "\"These radicals in the Statehouse do not speak for the state of Ohio,\" former Dayton Mayor Nan Whaley said Tuesday.",
    "The proposed legislation would also ban \"divisive concepts\" such as the 1619 Project and critical race theory.",
    "Supporters say the bill is about parental rights; opponents say it will alienate LGBTQ and Black Ohioans.",
    "Former U.S. Rep. Jim Renacci has campaigned on keeping critical race theory out of Ohio's public schools.",
    "Hundreds of companies have opposed anti-LGBTQ legislation, saying it harms recruitment and productivity.",
    "What does the rest of the field think of Ohio's version of Florida's 'Don't Say Gay' law?",
    "Those hoping to replace DeWine as governor did weigh in on the proposed legislation.",
    "Former Cincinnati Mayor John Cranley wrote on Twitter: \"This is about banning books.",
    "So will legislation like House Bill 616 harm Ohio's ability to attract businesses?",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "Let's teach our kids to be proud of America but not sugarcoat our history.\"",
    "\"Our goal always is for Ohio to be a welcoming state,\" DeWine said.",
    "This is about demonizing our fellow citizens and blaming victims.",
    "DeWine didn't take a position when asked earlier this year.",
    "We want it to be a state that reaches out to everybody.\"",
    "Reporter Anna Staver contributed to this article.",
    "\"I have not spent much time looking at it.",
    "I don't have an opinion,\" DeWine said.",
    "“You’re not born a racist,\" he said.",
    "We want it to be an inclusive state.",
    "So, nothing today from me.\"",
    "\"We want people here.",
    "Ohio Gov."
  ]
}