{
  "id": 8185,
  "mediaId": 8320,
  "date": "2022-04-06",
  "headline": "Former Dayton Mayor Nan Whaley hits the debate stage ahead of the gubernatorial primary",
  "image": "https://flyernews.com/wp-content/uploads/2018/08/NewNewsLogo-150x150.png",
  "link": "https://flyernews.com/frontpage/former-dayton-mayor-nan-whaley-hits-the-debate-stage-ahead-of-the-gubernatorial-primary/04/06/2022/",
  "mediaOutlet": "flyernews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Ohioans across the state submitted debate questions for the mayors on a number of pressing topics including renewable energy and gas prices, gun violence, COVID-19 mask and vaccine mandates, women’s reproductive rights, police reform, childhood sexual abuse, career retention, LGBTQIA+ rights, corruption and climate change.",
    "“Joe Biden, before he was president, said, ‘I never had an interest in being a mayor ’cause that’s a real job… That’s why I was able to be a senator for 36 years.’”\nShe cited her seven-year tenure leading the Gem City as the source of “the best leadership experience” she could bring to the statehouse.",
    "You can’t be weak in the face of your community when they’ve seen so many troubles and trials and tribulations and death,” Whaley added, referencing the 2019 Memorial Day tornado that hit the city, the Oregon District shooting that same year and the beginnings of the COVID-19 pandemic in Dayton.",
    "Cranley vowed to make sure Ohio would make it to the other side of the COVID-19 pandemic and will be prepared for the next pandemic by fully staffing public health, building contact tracing infrastructure, stocking up on personal protective equipment and investing in mental health care.",
    "“Never in my worst nightmare did I think that the thing he was going to do was to actually make it worse.”\nWhen it comes to women’s reproductive rights, both candidates agree that action to prevent restrictive abortion legislation has to come from the governor’s seat.",
    "“When you’re in a community like Dayton that is gritty and resilient and these kinds of things happen and you don’t get a lot of support, you have to fight your way through by bringing the community together and solving the problems themselves,” Whaley said.",
    "Cranley or Whaley will face off against either incumbent governor Mike Dewine or his Republican challengers, Joe Bystone, Ron Hood and Jim Renacci, in the fall debates leading up to Nov. 8’s general election.",
    "“Mayors, I think, are some of the toughest jobs in the country.”\n— Nan Whaley (@nanwhaley) March 30, 2022\nThe former Dayton mayor then quoted two presidents who would have agreed with her on that statement.",
    "Zoë Hill | News Editor\nFormer Dayton Mayor Nan Whaley took the debate stage Tuesday night at Central State University to answer Ohians’ questions alongside former Cincinnati Mayor John Cranley.",
    "“When Governor Mike Dewine took to the stage to speak, the people in Dayton shouted in frustration ‘Do something!’” Whaley recounted the vigil held just hours after the shooting.",
    "Although Whaley is looking to become the state’s first woman elected governor, she told Flyer News her roots as Dayton mayor will play a big role in how she plans to serve Ohio.",
    "the dialogue focused on the media’s harm- ful portrayal of Asian and Pacific Island- ers through its use of stereotypes, fetish- es and lack of authentic cultural stories.",
    "Whaley said she is running for governor because she witnessed how too often Daytonians who were struggling and wanted a government that worked for them were pushed aside.",
    "The 1998 University of Dayton alumna has a long list of endorsements for her campaign, but she made sure to give her own personal endorsement at the end of the night.",
    "Whaley promoted her jobs plan that would support small businesses, cut down on childcare and healthcare costs, raise the minimum wage and invest in renewable energy.",
    "Dewine’s term has been criticized by the GOP for his COVID-19 protocols which included sweeping lockdowns and state-wide mask mandates early on in the pandemic.",
    "Former mayors Nan Whaley and John Cranley debate at the Voter’s First: 2022 Ohio gubernatorial Democratic primary debate March 29 at Central State University.",
    "“I will make sure your pay goes up, your bills go down and we finally have a state government that’s working for you,” Whaley said in her opening statement.",
    "Whaley and Cranley are hoping to outlast them all and pull out a win for the Democrats, they both said at the debate hosted by the Ohio Debate Commission.",
    "“Lyndon Baines Johnson, in the middle of Vietnam, said ‘When the burdens of the presidency seem unusually heavy, I always remind myself it could be worse.",
    "With a state legislature that will likely remain a Republican majority, having a Democrat with veto power is crucial, according to Cranley and Whaley.",
    "Whaley, who led Dayton through a mass shooting in the Oregon District on Aug. 4, 2019, condemned Dewine’s lack of action on gun safety legislation.",
    "The top seat in the statehouse is highly contested on the Republican side compared to the previous Ohio gubernatorial election cycle in 2018.",
    "Now, as we head into week six of the con- flict, students over 5,000 miles away are\nMaking sense of a conflict 5,000 miles away (cont.)",
    "For more local news coverage like Flyer News on Facebook and follow us on Twitter (@FlyerNews) and Instagram (@flyernews).",
    "Concerning Ohio’s youth and career retention in the state, Whaley quipped that Ohio’s largest export is college graduates.",
    "Eric Spina who thanked the organizers and speak- ers for their time and willingness to educate the cam- pus community.",
    "Cranley wants to give Ohio its “comeback” like he did with the city of Cincinnati during his time as mayor.",
    "Early on in the debate, the candidates were asked how they would combat gun violence in Ohio as governor.",
    "“The answer to Ohio’s young adults can’t be, ‘if you want a good job, move to Columbus,’” Whaley said.",
    "“When you’re mayor, you don’t really have the luxury of saying, ‘that’s not my problem,’” Whaley said.",
    "“Go Flyers!” Whaley said before she left the auditorium-turned-press room at Central State University.",
    "Dewine’s Republican opponents are looking to prove they are a better pick for the party’s nominee.",
    "Spina was unable to attend the en- tire session but attended a large portion of the event.",
    "Both mayors are vying for the Democratic nomination in the 2022 governor’s race.",
    "She aims to bring a middle-class perspective to the Ohio governorship.",
    "The Ohio primary election will take place in a month on May 3.",
    "“Frankly, you’ve got to be tough, right?",
    "I could be a mayor,’” Whaley quoted.",
    "Photo courtesy of Hill."
  ]
}