{
  "id": 8464,
  "mediaId": 8456,
  "date": "2022-04-09",
  "headline": "(Paid Content) Several Races & Issues On May 3rd Ballot",
  "image": "https://thevillagereporter.com/wp-content/uploads/2022/04/4-13-22-elections-scaled.jpg",
  "link": "https://thevillagereporter.com/paid-content-several-races-issues-on-may-3rd-ballot/",
  "mediaOutlet": "The Village Reporter",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Newspaper Staff",
  "authorUrl": "https://thevillagereporter.com/author/villagereporter/",
  "termIds": [
    5581,
    4839,
    5339,
    4306,
    1819,
    2143,
    2290,
    2605,
    2694,
    1355
  ],
  "sentences": [
    "PLEASE LOGIN OR PURCHASE A SUBSCRIPTION TO READ PAID NEWSPAPER CONTENT\nA NOTE FROM THE PUBLISHER: Though the name has changed throughout the years from newspaper mergers and territory expansion, our local news coverage dates back to the 1870s!",
    "Story location listings: (Click Here)\nFree Email News Updates\nJoin over 4,360+ readers who receive email updates highlighting the newest local Williams County - Fulton County area news, sports and breaking news website posts!",
    "Email (required) *\nBy submitting this form, you are consenting to receive marketing emails from: The Village Reporter, 115 Broad Street, Montpelier, OH, 43543, http://www.thevillagereporter.com.",
    "U.S. SENATE\nMatt Dolan (R), Mike Gibbons (R), Morgan Harper (D), Traci TJ Johnson(D), Josh Mandel (R), Neil Patel (R), Mark Pukita (R), Tim Ryan (D), Jane Timken (R), JD Vance (R).",
    "PLEASE CHOOSE A PURCHASE OPTION BELOW:\n*Subscriptions include full website access to daily stories, the weekly E-Edition, along with a traditional weekly mailed newspaper.",
    "Without this support, we would be unable to send our writers and photographers out into our communities to bring forth the news you care about the most, local news.",
    "This long term success is due to readership support from those that have subscribed and/or purchased newspaper copies at local stores.",
    "You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email.",
    "Thank you for supporting our family-owned and local Williams & Fulton County area resident operated newspaper!",
    "GOVERNOR\nJoe Blystone & Jeremiah W. Workman (R), John Cranley & Teresa Fedor (D), Mike DeWine &...",
    "Subscriptions purchases will auto-renew and may be canceled at the end of any term.",
    "Want to purchase a traditional newspaper hard copy for sale locally?",
    "Emails are serviced by Constant Contact",
    "Opt-out at any time."
  ]
}