{
  "id": 924,
  "mediaId": 8313,
  "date": "2022-02-18",
  "headline": "Ohio Democratic Party endorses Tim Ryan for U.S. Senate, stays neutral in governor's race",
  "image": "https://www.gannett-cdn.com/presto/2021/10/07/PLAN/2db4e0fa-d60f-4520-beaf-a76ddaeedcf6-04_LAN_Tim_Ryan_Visit_10072021_BL.jpg?crop=3703,2083,x0,y244&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/02/17/ohio-democratic-party-endorse-senate-governor-races/6782561001/",
  "mediaOutlet": "enquirer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    1819,
    2605,
    3346,
    1489,
    392,
    958,
    1267,
    6104,
    6474
  ],
  "sentences": [
    "\"We’re confident we have a strong, diverse ticket coming out of the primary elections that will show voters we’re on their side and lead us to victory in November,\" chairwoman Elizabeth Walters said in a statement.",
    "Haley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "The party's executive committee ultimately decided not to back a candidate in the gubernatorial primary between former Dayton Mayor Nan Whaley and former Cincinnati Mayor John Cranley.",
    "The party also threw its support behind Ohio Supreme Court Justice Jennifer Brunner, who is vying for chief justice, and Judges Marilyn Zayas and Terri Jamison for Supreme Court.",
    "Whaley’s campaign initially pushed the party to support her, but she changed course earlier this month and asked them to stay neutral \"to avoid internal squabbling.\"",
    "The nod for Ryan, who represents Ohio’s 13th Congressional District, was unsurprising given the support he’s secured from key leaders around the state.",
    "\"Pre-primary endorsements unfairly tip the scales in favor of one candidate over another,\" said a letter signed by 13 Democrats who support Harper.",
    "\"Instead, we must trust the voters to choose who is most aligned with their values and who can best lead the party to victory in November.\"",
    "The Ohio Democratic Party endorsed Tim Ryan for U.S. Senate on Thursday, dismissing calls from some Democrats to stay neutral in the race.",
    "At a stop in Grove City Thursday, he said he's been focused on campaigning and didn't want to insert himself into the party's business.",
    "Thursday’s endorsement came after weeks of infighting over whether the party should endorse in the races for U.S. Senate and governor.",
    "Still, it opens up even more resources and money for a campaign that’s already outpacing the rest of the field in fundraising.",
    "\"Today I asked the Ohio Democratic Party to remain neutral in our Senate race,\" she tweeted after the vote.",
    "The decision was swiftly rebuked by Harper, who received nine votes out of 116 on the committee.",
    "That's their decision, and they've got a lot of different interests to weigh there.\"",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "\"If the party folks decide to endorse, we want the endorsement,\" Ryan said.",
    "Unlike Whaley, Ryan never asked party leaders to stay neutral in his race.",
    "\"We're not going to get into whether or not they should or shouldn't.",
    "Ryan is running in the May primary against progressive Morgan Harper.",
    "They will continue to tip the scales for our establishment opponent.",
    "Cranley had lobbied officials for months to stay out of the race.",
    "It’s official: it’s us against the machine.\"",
    "\"They didn’t listen."
  ]
}