{
  "id": 1012,
  "mediaId": 2641,
  "date": "2022-04-09",
  "headline": "Trump Tells Newsmax He's Endorsing Dr. Oz",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=ebe93d07-c549-4276-ba38-6836659d0bed&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/mehmet-oz-senate-endorsement-donald-trump/2022/04/09/id/1065049/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sandy Fitzgerald",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Former President Donald Trump on Saturday endorsed \"the brilliant and well-known\" Dr. Mehmet Oz in Oz's bid to represent Pennsylvania in the U.S. Senate, saying the \"doctor is smart, tough, and will never let you down; therefore, he has my complete and total endorsement.\"",
    "\"He has authored more than 350 original publications, written eight New York Times bestsellers, and received patents for developing medical devices that have improved countless lives and performed thousands of life-saving heart operations,\" Trump added.",
    "He also lauded Oz for being \"pro-life; very strong on crime, the border, election fraud, our great military, and our vets, tax cuts; and will always fight for and support our under-siege Second Amendment.\"",
    "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate,\" Trump said in his announcement.",
    "\"Perhaps most importantly, I believe that Mehmet Oz will be the one most-able to win the general election against a radical left Democrat looking to do unthinkable harm to our country.\"",
    "Oz is squaring off against Republicans Kathy Barnette, Jeff Bartos, George Bochetto, Sean Gale, Carla Sands, and David McCormick for the nomination, according to WTAE in Pittsburgh.",
    "Oz, along with a wide slate of other candidates, is seeking Pennsylvania's open Senate seat being left vacant by Sen. Pat Toomey, R-Pa., who is not seeking another term.",
    "He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!).\"",
    "\"This is all about winning elections in order to stop the radical-left maniacs from destroying our country,\" the statement read.",
    "Oz also \"passionately believes in high-quality education and protecting parent involvement throughout the process,\" Trump said.",
    "Trump made an exclusive backstage endorsement of Oz to Newsmax's John Bachman at his Selma, North Carolina, Save America rally.",
    "\"And he's just been a very strong, reliable guy – loves the state; loves the people – and he'll be a great senator.\"",
    "\"I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.",
    "Likewise, he will do very well in Philadelphia and Pittsburgh, where other candidates will just not be accepted.",
    "and MBA from the University of Pennsylvania School of Medicine and Wharton School of Finance.",
    "\"He has lived with us through the screen and has always been popular, respected, and smart.",
    "Trump issued his statement at the same time he was holding his rally in North Carolina.",
    "Oz, Trump noted, is a graduate of Harvard University and he had earned a joint M.D.",
    "He went to the Wharton school of finance, and he also went to Penn medical school.",
    "\"Women, in particular, are drawn to Dr. Oz for his advice and counsel,\" he said.",
    "\"I just endorsed, literally as I'm walking up, we endorsed Dr. Oz,\" Trump said.",
    "Trump also said Oz \"will ensure America will become energy independent again.\"",
    "He knows his job is to serve every single Pennsylvanian.",
    "\"Dr. Oz is smart, tough, and will never let you down.\"",
    "He's a tremendous guy, very smart, Harvard educated.",
    "People also know and trust Oz, Trump concluded.",
    "They know him, believe in him, and trust him.",
    "\"I have seen this many times over the years.",
    "That's a pretty unusual combination.",
    "\"I've known him for a long time.",
    "All rights reserved.",
    "© 2022 Newsmax.",
    "Special Links:"
  ]
}