{
  "id": 1064,
  "mediaId": 2550,
  "date": "2022-04-08",
  "headline": "House doc who praised Trump's 'good genes,' is under investigation",
  "image": "https://images.dailykos.com/images/526085/story_image/GettyImages-905748884.jpg?1522425218",
  "link": "https://www.dailykos.com/stories/2022/4/8/2090828/-Rep-Ronny-Jackson-the-ex-White-House-doc-who-praised-Trump-s-good-genes-is-under-investigation?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2232,
    3226,
    3522,
    4052,
    4708,
    4711,
    1094
  ],
  "sentences": [
    "CNN:\nAllegations about his explosive temper and creating a hostile work environment are consistent throughout his time in both the Obama and Trump administrations as an \"overwhelming majority of witnesses (56) ... who worked with RDML Jackson from 2012 through 2018 told us they personally experienced, saw, or heard about him yelling, screaming, cursing, or belittling subordinates,\" the report says.",
    "includes such luminaries as Mehmet Oz, Ben Carson, Scott Atlas, and Ronny Jackson, the dude who turned a slovenly heap of fly-pocked Crisco into a Greek Adonis through the magic of barmy bullsh*t.\nNow Jackson, who leveraged his unique proximity to Donald Trump’s eminently unkissable bum into a congressional seat, is under investigation by the House Ethics Committee.",
    "Voters can still save the country, but Democrats have to help them\nDaily Kos' The Brief\nFollowShare\n0:0058:38\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nOkay, the only way Trump lives to be 200 is if he’s literally sucking the life energy out of me, instead of—as I’ve assumed all along—merely sapping my will to live.",
    "Meanwhile, Pete Souza, a very public Jackson detractor (and former Jackson colleague) who’s devoted his Twitter feed almost exclusively to mocking the disgraced doc—including the frequent posting of upside-down screenshots of the Texas rep’s more irreverent tweets—had a few thoughts of his own on this latest development.",
    "Jackson frequently alleges without evidence that [President Biden] is ‘senile’ and has accused Democrats of weaponising new variants of the coronavirus to assist in this year’s midterm elections.”\nIn other words, Jackson’s gone full MAGA—he’s dishonest and corrupt to the core.",
    "… I told the President that if he had a healthier diet over the last 20 years he might live to be 200 years old.”\nListen and subscribe to Daily Kos' The Brief podcast with Markos Moulitsas and Kerry Eleveld\nx\nx\nYou need to enable JavaScript to run this app.",
    "On a presidential trip to Manila from April 22, 2014, to April 29, 2014, four witnesses who traveled with then-President Barack Obama and Jackson said that Jackson became intoxicated and made inappropriate comments about a female medical subordinate.",
    "You’ll recall Jackson’s North Korean-like spin from his days as Trump’s personal physician, when he issued a bizarre, fawning report on his health—saying, among other things, “He has incredibly good genes, and it’s just the way God made him.",
    "These witnesses also described RDML Jackson's leadership style with terms such as 'tyrant,' 'dictator,' 'control freak,' 'hallmarks of fear and intimidation,' 'crappy manager,' and 'not a leader at all,'\" it adds.",
    "But a spokesperson for Jackson said that the review concerns his campaign finance activities and that the former White House physician-turned-lawmaker has cooperated with the investigation.",
    "), said in a statement that the panel has extended its review of Jackson after receiving a referral from the Office of Congressional Ethics (OCE), an independent watchdog, in late December.",
    "@RonnyJacksonTX https://t.co/6CNYJslc5w pic.twitter.com/zHua2KIr4T\n— Pete Souza (@PeteSouza) April 8, 2022\nWe’ll see where this goes, but this investigation couldn’t happen to a nicer guy.",
    "\"Many of these witnesses described RDML Jackson's behavior with words and phrases such as 'meltdowns,' 'yells' for no reason,' 'rages,' 'tantrums,' 'lashes out,' and 'aggressive.'",
    "A March 2021 Department of Defense inspector general report raised red flags about the rear admiral’s (RDML) conduct while he served as White House physician.",
    "x\nHey Ronny, you’re tweeting BS again because you don’t want to tell your constituents that you’re under investigation by the bi-partisan ethics committee.",
    "We don’t exactly know why yet, but if his past assessments of Trump’s “health” are any indication, it likely has to do with rank dishonesty.",
    "It made comedian Sarah Silverman say, “THIS IS FUCKING BRILLIANT,” and prompted author Stephen King to shout “Pulitzer Prize!!",
    "Or, if you prefer a test drive, you can download the epilogue to Goodbye, Asshat for the low, low price of FREE.",
    "The Hill:\nThe committee’s chairman, Rep. Ted Deutch (D-Fla.), and top Republican, Rep. Jackie Walorski (Ind.",
    "But there Jackson was, spewing a hagiographic profile of Trump that likely bore little relation to reality.",
    "Get them all, including the finale, Goodbye, Asshat: 101 Farewell Letters to Donald Trump, at this link.",
    "I’m actually a little surprised Trump never gave the Presidential Medal of Freedom to Mayor McCheese.",
    "The statement from the House Ethics Committee did not detail the allegations against Jackson.",
    "Of course, this isn’t the first time Jackson has been accused of sketchy behavior.",
    "The GOP’s crack team of doctors (sorry, “quack” team—damn you, autocorrect!)",
    "The viral letter that launched four hilarious Trump-trolling books.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n59.",
    "My intestinal fluke, Skippy, has a more refined palate.",
    "Gee, is it any wonder why Jackson loves Trump so much?",
    "The guy is more milkshake than man, for fuck’s sake.",
    "As The Independent notes, “Mr.",
    "!” (on Twitter, that is).",
    "Godspeed, investigators.",
    "I did Nazi that coming.",
    "And “good genes”?",
    "What is it?",
    "Godspeed."
  ]
}