{
  "id": 1176,
  "mediaId": 2664,
  "date": "2022-04-09",
  "headline": "Trump cites TV while endorsing Dr. Oz for Senate: 'He has lived with us through the screen'",
  "image": "https://www.rawstory.com/media-library/dr-oz.jpg?id=28156053&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/dr-oz-2657128340/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    2201,
    2232,
    1171,
    5036,
    5239
  ],
  "sentences": [
    "The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate,\" Trump said in a statement emailed to reporters.",
    "\"He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!).\"",
    "\"I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.",
    "You know, when you're on television for 18 years, that's like a poll, it means people like you,\" Trump argued.",
    "\"This is all about winning elections in order to stop the Radical Left maniacs from destroying our Country.",
    "\"Dr. Oz is smart, tough, and will never let you down, therefore, he has my Complete and Total Endorsement.",
    "Donald Trump on Saturday endorsed Dr. Mehmet Oz in the Republican primary for U.S. Senate in Pennsylvania.",
    "He has lived with us through the screen and has always been popular, respected, and smart,\" Trump said.",
    "Trump also brought up television in reference to his endorsement at his North Carolina rally.",
    "\"Women, in particular, are drawn to Dr. Oz for his advice and counsel.",
    "The former reality TV star then discussed his love for television.",
    "I have seen this many times over the years,\" Trump said.",
    "our Country needs you!\"",
    "\"That's like a poll.",
    "Good luck, Dr. Oz."
  ]
}