{
  "id": 1179,
  "mediaId": 2636,
  "date": "2022-04-07",
  "headline": "Wawa Stock and $500,000 in Cattle: Dr. Oz’s Senate Bid Reveals His Wealth",
  "image": "https://static01.nyt.com/images/2022/04/07/lens/07onpolitics-pm-newsletter-lede-2/07onpolitics-pm-newsletter-lede-2-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/07/us/politics/dr-oz-pennsylvania-senate.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1664,
    2201,
    2232,
    2599,
    4581,
    4628,
    4762,
    305,
    1171,
    5239
  ],
  "sentences": [
    "According to a police report of the March 27 incident, Smith’s Ford pickup truck was pulled over after it was “failing to maintain its lane.” The officer at the scene said that he smelled alcohol on Smith’s breath and that his eyes were “bloodshot and watery.” Smith failed a roadside sobriety test, then refused a breathalyzer test at the station and was released to a “sober third party.”\nSmith disputes that he was drunk, and denies failing the sobriety test.",
    "As for the comment about being a candidate, Kush said, “What he was trying to say is, ‘I’m running for Congress, I wouldn’t do something so stupid.’” Kush added: “He will have his day in court, he will be vindicated and everyone will owe Ian a big fat apology.”\nSmith is running against Representative Andy Kim, the Democratic incumbent, in New Jersey’s redesigned Third District, which bisects the state to the east of Philadelphia.",
    "He spoke about the accident in an Instagram video, in which he said he accepted “full responsibility” and said that anyone who hated him was “completely justified.”\nHe makes for a sharp contrast with Kim, whose most famous moment in office was an expression of modesty: a viral image captured of the congressman on his hands and knees, cleaning up the wreckage of the Jan. 6 riot at the Capitol.",
    "Although Oz often criticizes Big Tech on the campaign trail, and he has sought to appeal to Trump-centric primary voters by opposing “big government, big media and big business,” his disclosure shows he has huge investments in some of the country’s largest companies, including Amazon, Apple and Alphabet.",
    "The assets, which Oz owns solely or jointly with his wife, include a large private investment in the iconic Pennsylvania gas and convenience chain Wawa, as well as far-flung properties in New Jersey, Pennsylvania, New Hampshire, Florida and Turkey, from which his parents emigrated before he was born.",
    "Heavily muscled, with a long beard and tattooed shoulders he displays while wearing camouflage tank tops, Smith is what you might call a Marjorie Taylor Greene Republican — an unusual cocktail of physical fitness, anti-government sentiment and skepticism of foreign intervention.",
    "Stop the businesses.”\nHe said the choice felt “cathartic almost,” because public office was “perhaps the most important contribution you’ll make.”\nAfter clashing on the airwaves, Oz and McCormick finally met on the same stage at the business-sponsored forum, held in Erie.",
    "The celebrity doctor Mehmet Oz, whose TV career was given liftoff by Oprah Winfrey and who left it behind to run for the Senate in Pennsylvania, has a personal fortune of $76 million to $300 million, he disclosed Wednesday night in a government filing.",
    "“You’ve been running those ads over and over again claiming things you know are dishonest.”\nThe moderator squelched the back-and-forth, reminding candidates that the forum was not a debate and that they had agreed to rules barring personal criticisms.",
    "Senate candidates present, Jeff Bartos and Kathy Barnette, expressed deep frustration that their efforts to barnstorm the state, meeting voters face to face, were being eclipsed by the high-priced television air war between Oz and McCormick.",
    "To reach the general election, Oz will have to emerge victorious from a nasty slugfest with another superrich first-time candidate, David McCormick, the former chief executive of Bridgewater Associates, the world’s largest hedge fund.",
    "The New York State attorney general, Letitia James, filed a motion asking a judge to hold Donald Trump in contempt for failing to turn over documents in her civil investigation into his business activities.",
    "Another source of 2021 income was paid speeches: Oz earned $120,000 to address a medical foundation in Texas and $125,000 to speak to the American Pistachio Growers trade association in California.",
    "Together, Oz, McCormick and several super PACs funded by their wealthy supporters have juiced the rivalry with more than $37 million in advertising, largely on television, according to Ad Impact.",
    "Kim faces a somewhat more plausible Republican challenger in Robert Healey, a yoga instructor who owns a yacht-making business and was once the lead singer in a punk rock band called the Ghouls.",
    "Democrats regard Pennsylvania, which President Biden narrowly won in 2020, as a chance to offset potential losses by the party’s most vulnerable incumbents in states like Georgia and Arizona.",
    "He had a passionate, committed base of supporters animated by lockdowns and mask mandates, and had raised thousands of dollars online to fund his legal battles with the state government.",
    "“Let’s face it, not a lot of people come out in these primary elections,” said Micah Rasmussen, who runs the Rebovich Institute for New Jersey Politics at Rider University.",
    "A consultant for his campaign, Steve Kush, said it “looked to me like he walked a straight line” in the video released by the Cinnaminson Township Police Department.",
    "Our colleague Jonathan Weisman reports on an expanding legal effort to disqualify from re-election lawmakers who participated in events surrounding the Capitol riot.",
    "What to read tonight\nJudge Ketanji Brown Jackson was confirmed to the Supreme Court, becoming the first Black woman to be elevated to the top of the judicial branch.",
    "At a forum for Republican Senate candidates last week, Oz said he had gladly walked away from his lucrative show and its spinoff enterprises to seek public office.",
    "He reported earning $2.2 million last year as the show’s host and supervising producer and another $7 million as an owner of Oz Media, which co-produced the show.",
    "Building on his celebrity, he has used his fortune to propel himself toward the top of the Republican field in one of the country’s most expensive primary races.",
    "Today, a group of voters and a progressive group filed suit against three elected officials in Arizona to bar them under the 14th Amendment from running again.",
    "And Speaker Nancy Pelosi tested positive for the coronavirus, joining a series of prominent officials in Washington who have become infected in recent days.",
    "Before running for office, he presided for more than 12 years over “The Dr. Oz Show” on daytime TV, which he co-produced with Winfrey’s company.",
    "And after all, in the 2021 legislative elections in New Jersey, an unknown truck driver dethroned the state’s longest-serving Senate president.",
    "nomination in what is widely viewed as one of the nation’s most pivotal Senate races, to fill the seat of a retiring Republican, Pat Toomey.",
    "Precise figures can’t be determined because the financial disclosure, required under federal law, asks for asset values in a broad range.",
    "In 2007, he was convicted of vehicular manslaughter after hitting and killing a teenager while intoxicated and served time in prison.",
    "He put in $5.3 million of his own money last year, and he may well report adding more in a new campaign filing later this month.",
    "With less than six weeks until the primary, there may be no stopping the dominance of the ultrawealthy candidates.",
    "A gym owner who gained a following for defying the state’s coronavirus restrictions — at one point, he called Gov.",
    "They are hungry for something different.”\nIn the Trump era, Smith’s path to office once seemed almost plausible.",
    "McCormick, who has not yet filed a financial disclosure, must do so at least 30 days before the May 17 primary.",
    "“Mehmet, on your shows and in your columns, you’ve argued for more regulation in fracking,” McCormick said.",
    "And you’ve argued for a moratorium in Pennsylvania.”\n“That is a lie and you know it’s a lie,” Oz objected.",
    "Three Republican senators joined all 50 members of the Democratic caucus in voting for her nomination.",
    "McCormick swiped at his rival over his position on fracking, a top issue in energy-rich Pennsylvania.",
    "Phil Murphy a “slimeball” — Ian Smith does not cut the figure of a traditional Republican candidate.",
    "But this much is clear: If elected, Oz would be one of the wealthiest members of the Senate.",
    "Last year, Oz bought a cattle farm in Okeechobee, Fla., whose cows are worth up to $500,000.",
    "“I am not part of the establishment,” Smith said when kicking off his campaign in February.",
    "He would look more at home in an episode of “Duck Dynasty” than a congressional hearing.",
    "Before redistricting, Kim was considered one of the most vulnerable members of Congress.",
    "A home he owns in Palm Beach, Fla. is valued between $5 million and $25 million.",
    "Television made Dr. Oz rich, but now we have a better idea just how rich.",
    "Republicans view it as a must-win race for control of the Senate.",
    "Pro-McCormick super PACs have gone after Oz as a closet liberal.",
    "A super PAC backing Oz has denounced McCormick as soft on China.",
    "“You’ve made the case that there’s health effects from fracking.",
    "how they run\nYou wouldn’t necessarily know it from looks alone.",
    "(He once promoted a pistachio protein shake through his show.)",
    "“Give up a television show — the top health show in the world.",
    "His new district is much friendlier Democratic territory.",
    "“I decided that I would burn the boats,” he said.",
    "“People are looking for something different.",
    "Is there anything you think we’re missing?",
    "I’ve sold 20 million books, probably.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "It went off the air in January.",
    "Oz, 61, is vying for the G.O.P.",
    "Smith always faced long odds.",
    "We’d love to hear from you.",
    "Follow live updates.",
    "Stop all the books.",
    "Ten Emmy Awards.",
    "Two other G.O.P.",
    "Thirteen years."
  ]
}