{
  "id": 1226,
  "mediaId": 2557,
  "date": "2022-04-04",
  "headline": "REPORT: Celebrity GOP candidate pushed amnesty for illegal alien youths in 2018",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-1232870873-1.jpg",
  "link": "https://dennismichaellynch.com/report-celebrity-gop-candidate-pushed-amnesty-for-illegal-alien-youths-in-2018/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    1477,
    2232,
    4670,
    151,
    1098,
    5239,
    5371
  ],
  "sentences": [
    "Asked in an interview with Asli Pelit in 2018 what he thinks about so-called “DREAMERs,” Oz replied that he thought the illegal alien youths were being used by both parties to score “political points.”\nThe article goes on to state the following:\n“I think the DREAMERs are being used as political points and both parties are gonna have to figure that out – people should not be penalized because we can’t get our thoughts together,” Oz replied.",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nDr. Mehmet Oz, the celebrity doctor now running as a candidate for the Republican nomination for U.S. Senate in Pennsylvania, as recently as 2018 was publicly advocating for amnesty for illegal alien youths.",
    "NEW from me\nA company owned by Dr. Oz’s family received a $95 million fine from ICE in 2017 over a scheme to hire illegal aliens https://t.co/wphRHrZg7x\n— Jon Levine (@LevineJonathan) February 12, 2022\nListen to the latest daily DML podcasts below!",
    "pic.twitter.com/3k3lWING21\n— Dr. Mehmet Oz (@DrOz) June 5, 2019\n“We do need an immigration policy, I believe, that rewards merit,” Oz said, pushing for a raised quota of immigrants allowed into the US.",
    "I can understand, you don’t want immigrants who are undocumented, may be have dangerous past… I get all the politics, but we don’t want to penalize the dreamers for that.”\nEarlier this year.",
    "the New York Post also revealed that Oz’s family company was hit with the largest fine in history by ICE, reportedly for hiring illegal aliens.",
    "“If I’m trying to bring a heart surgeon to America… why would that be hindered because of some abstract quota that no one can defend?",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "I was proud to meet with this incredible group of Dreamers to celebrate #ImmigrantHeritageMonth.",
    "They’ve all graduated school and are pursuing careers building themselves and America.",
    "To get more information about this article, please visit Breitbart.",
    "Thanks for stopping by!",
    "Then please share."
  ]
}