{
  "id": 133,
  "mediaId": 2664,
  "date": "2022-04-09",
  "headline": "Conservatives lash out after Trump endorses Dr. Oz: 'They played him. Again.'",
  "image": "https://www.rawstory.com/media-library/trump-has-post-election-execution-list-of-top-officials-to-fire-including-fbi-cia-and-pentagon-chiefs-report.jpg?id=24729137&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/trump-dr-oz-maga-endorsement/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    1316,
    1586,
    2201,
    2232,
    4537,
    878
  ],
  "sentences": [
    "The ongoing need to blame everyone but Trump for Trump\\u2019s own choices is striking given that Brooks, who Trump dumped, is one of those doing it.https://twitter.com/mobrooks/status/1512958264895488001\\u00a0\\u2026\n— Maggie Haberman (@Maggie Haberman) 1649560352\nThis is happening because Trump\\u2019s surrounded himself by staff who are on McConnell\\u2019s payroll & hostile to the MAGA agenda.",
    "Donald Trump's once iron-clad grip on the Republican Party appears to have weakened as prominent conservatives are openly griping about his endorsement of Dr. Mehmet Oz in the GOP primary for U.S. Senate in Pennsylvania.",
    "\"The ongoing need to blame everyone but Trump for Trump’s own choices is striking given that Brooks, who Trump dumped, is one of those doing it,\" she wrote.",
    "\"This endorsement could divide MAGA in the only way that matters: he could lose America First conservatives over it,\" he wrote.",
    "\"This is happening because Trump’s surrounded himself by staff who are on McConnell’s payroll & hostile to the MAGA agenda.",
    "\"It’s like Donald Trump’s staff is sabotaging Trump by convincing him to make the worst possible endorsements,\" he tweeted.",
    "Joel Pollack, the senior editor-at-large at Breitbart, said Trump could lose the support of his base over the endorsement.",
    "Rep. Mo Brooks (R-AL), who was un-endorsed by Trump in his Senate campaign, retweeted Erickson with his own thoughts.",
    "Again.https://twitter.com/ewerickson/status/1512943781267529729\\u00a0\\u2026\n— Mo Brooks (@Mo Brooks) 1649552334",
    "Pulitzer Prize-winning New York Times journalist Maggie Haberman was surprised by Brooks' tweet.",
    "Everybody telling Trump who to endorse in primaries works for The Swamp.\\n\\nThey played him.",
    "Everybody telling Trump who to endorse in primaries works for The Swamp,\" he charged.",
    "Prominent far-right blogger Erick Erickson blamed Trump's staff for the endorsement.",
    "\"They played him.",
    "Again.\""
  ]
}