{
  "id": 1345,
  "mediaId": 2532,
  "date": "2022-04-07",
  "headline": "Dr. Oz, running for U.S. Senate in Pennsylvania, reports at least $100 million in assets",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/02/11/316b16d5-9c11-4b1c-8235-7c7f318c17f0/thumbnail/1200x630/1114965272f7ed3d168d0a27f1acf026/GettyImages-1365957831.jpg",
  "link": "https://www.cbsnews.com/news/dr-oz-100-million-in-assets-pennsylvania-senate-race/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2232,
    2542,
    2709,
    3414,
    4021,
    4762,
    1056,
    1171,
    5239
  ],
  "sentences": [
    "2022 Midterm Elections\n More\n A test for Trump as Michigan GOP gathers\n McCarthy considered telling Trump to resign after Jan. 6, recording shows\n Bernie Sanders hasn't ruled out third run for presidency\n Florida governor approves map that could give GOP more U.S. House seats\n Tennessee GOP kicks Trump-backed candidate off congressional primary ballot\n More\nIn:\nPennsylvania\nUnited States Senate",
    "Before he gave up his entertainment career to run for U.S. Senate, Mehmet Oz — the celebrity heart surgeon best known as the host of daytime TV's \"The Dr. Oz Show\" — amassed assets worth more than $100 million, including homes, stock, life insurance and connections to his in-laws' tree-trimming empire.",
    "Oz, a longtime New Jersey resident, lists two homes in that state valued at at least $1 million — including the one where Oz lived for a couple of decades before deciding to run for the Senate — plus another home in suburban Philadelphia valued at $1 million or more.",
    "Oz on Wednesday night filed a financial disclosure form — required of all Senate candidates — that tallies a long list of investments that back up the finances of a man who has said he put $10 million into his campaign in Pennsylvania.",
    "Oz valued his assets at between $104 million and $422 million, according to a tally by The Philadelphia Inquirer, a wide range that is a result of the Senate's request that each asset be valued within a certain dollar bracket.",
    "They list at least $6 million in non-public stock in the convenience store chain Wawa Inc.\nHis tens of millions of dollars in equities includes millions in stock in Amazon, Microsoft and Google's parent company, Alphabet.",
    "Another wealthy candidate, Carla Sands, filed a public disclosure of assets last year, valuing more than 50 accounts or properties at between $35 million and $152 million.",
    "There's also a vacation home in Palm Beach, Florida, that Oz values at $5 million to $25 million and a cattle farm in Okeechobee, Florida, valued at $1 million or more.",
    "The race for the open Senate seat was shaken up when Trump-endorsed Sean Parnell dropped after losing a custody battle amid abuse allegations by his estranged wife.",
    "For Oz, his filing shows at least $11.5 million — and possibly much more — in non-public stock in Asplundh, the tree-trimming company owned by his wife's family.",
    "A TV personality and former faculty member at Columbia University, Dr. Oz is running as a Republican for an open Senate seat in Pennsylvania.",
    "He reported earning about $10 million in 2021, nearly all of it from his TV show host salary and ownership of the show's parent company.",
    "Alexi Rosenfeld/Getty Images\nOz isn't the only multimillionaire in the seven-person Republican primary field in Pennsylvania.",
    "Dr. Mehmet Oz attends The 2022 Champions Of Jewish Values Gala at Carnegie Hall on January 20, 2022 in New York City.",
    "If elected, he would be one of the wealthiest members of the Senate — and possibly the wealthiest.",
    "Pennsylvania is expected to be one of the most expensive Senate races during the 2022 midterms.",
    "Former hedge fund CEO David McCormick has yet to file a financial disclosure.",
    "He puts the value of the cattle at $250,000 to $500,000.",
    "He also lists life insurance policies worth millions.",
    "The primary is scheduled for May 17."
  ]
}