{
  "id": 1598,
  "mediaId": 2664,
  "date": "2022-04-07",
  "headline": "‘Grifter’ Dr. Oz mocked for video blaming Biden for $6 salsa as new disclosure puts his wealth at up to $400 million",
  "image": "https://www.rawstory.com/media-library/dr-mehmet-oz.jpg?id=29651256&width=1200&coordinates=0%2C49%2C0%2C342&height=600",
  "link": "https://www.rawstory.com/grifter-dr-oz-mocked-for-video-blaming-biden-for-6-salsa-as-new-disclosure-puts-his-wealth-at-up-to-400-million/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Badash",
  "authorUrl": "https://www.rawstory.com/u/david_badash_the_new_civil_rights_movement",
  "termIds": [
    2232,
    3975,
    1171
  ],
  "sentences": [
    "\"Carpet-bagging\" Republican U.S. Senate candidate Dr. Mehmet Oz is being mocked for a video that shows him in a supermarket shopping for ingredients for crudité, and complaining that the ingredients – totaling he says about $20 – are too expensive, and President Joe Biden is to blame.",
    "The video comes amid his new financial disclosure that puts the upper end of his wealth at over $400 million, which would make him one of the richest Senators if elected.",
    "\"I'm doing some grocery shopping, I'm at Wegner's,\" Oz says on camera, possibly meaning Wegman's, \"and my wife wants some vegetables for crudité.",
    "Dr. Oz, as he is commonly known, is a television host who, despite being a longtime New Jersey resident, is running for a seat in Pennsylvania.",
    "He has endorsed many products, about half of which a 2014 report showed had no evidence to support their claims.",
    "Oz is a hydroxychloroquine-pushing TV doctor widely known for promoting pseudoscience and fake treatments.",
    "President Biden does not set the price of carrots, asparagus, guacamole, or salsa.",
    "Guys, that's $20 for crudite, and this doesn't include the tequila.",
    "That's $10 of vegetables there, and then we need some guacamole.",
    "That's two bucks, well, that's a ton of broccoli there.",
    "We got Joe Biden to thank for this.\"",
    "She loves salsa, yeah, salsa there.",
    "Must be a shortage of salsa.",
    "I mean, that's outrageous.",
    "That's four more dollars.",
    "There's some asparagus.",
    "So, here's a broccoli.",
    "Oz was quickly mocked.",
    "That's $4 more.",
    "That's $4.",
    "Carrots.",
    "Right?",
    "$6?"
  ]
}