{
  "id": 1650,
  "mediaId": 2570,
  "date": "2022-04-07",
  "headline": "Dr. Oz Wants To Fight Big Tech In The Senate. He Owns At Least $10 Million In Shares Of Alphabet, Amazon, Apple And Microsoft.",
  "image": "",
  "link": "https://www.forbes.com/sites/zacheverson/2022/04/07/dr-oz-wants-to-fight-big-tech-in-the-senate-he-owns-at-least-10-million-in-shares-of-alphabet-amazon-apple-and-microsoft/?sh=4c23762d83bf",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zach Everson",
  "authorUrl": "https://www.forbes.com/sites/zacheverson/",
  "termIds": [
    2232,
    2662,
    4787,
    27,
    28,
    58,
    624,
    1171,
    1221
  ],
  "sentences": [
    "She went on to claim that Oz’s private investment pales in comparison with his primary opponent, former hedge fund executive David McCormick’s, “record of ripping off Pennsylvania taxpayers.”\nOz trails McCormick in Pennsylvania’s Republican Senate primary, according to polls taken by the Philadelphia Inquirer and Washington Free Beacon.",
    "“I’ve got scars to prove it.”\nOz and his wife also have got at least $10.2 million worth of stock in Alphabet, Amazon, Apple and Microsoft, according to a campaign disclosure he filed Wednesday with the Senate.",
    "As for earned income, Oz reported receiving $10 million, $2 million of which came from hosting the Dr. Oz Show while another $7 million was from his stake in Oz Media.",
    "He owns at least $5 million worth of shares in Wawa, the Pennsylvania-based gas station and convenience store that’s a bit of an institution in the Mid-Atlantic.",
    "Update, April 7, 2022, 2:22 p.m.: “You can own stocks and still be critical of a company, look at Elon Musk,” said campaign spokesperson, Brittany Yanick.",
    "While Oz took flack for running to represent Pennsylvania despite living in New Jersey, his disclosures do reveal a Keystone State connection.",
    "“I’ve gone to battle with Big Tech,” Mehmet Oz, the physician and TV personality, said when announcing his Senate campaign in December.",
    "(The $268,000 he was paid for 11 days of hosting the game show is $94,000 more than what his annual salary would be in the Senate.)",
    "His appearances on Jeopardy and the app Cameo as well as three speeches raised $347,000, which he donated to charity.",
    "Oz did pocket the $125,000 he was paid for giving a speech to the American Pistachio Growers Association.",
    "Overall, Oz values his and his wife’s assets at more than $100 million.",
    "The dividends from Wawa alone paid Oz more than $1 million last year.",
    "Additionally, Oz reported $594,000 in honoraria payments.",
    "Voting ends on May 17."
  ]
}