{
  "id": 1712,
  "mediaId": 2596,
  "date": "2022-04-08",
  "headline": "Dr Oz roasted for 'phony' grocery store shopping video",
  "image": "https://www.indy100.com/media-library/here-s-how-much-dr-oz-was-paid-for-his-2-week-jeopardy-host.png?id=29657492&width=1200&coordinates=0%2C132%2C0%2C204&height=600",
  "link": "https://www.indy100.com/news/dr-oz-grocery-store-video",
  "mediaOutlet": "indy100.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2232,
    3975,
    808,
    5180,
    5239
  ],
  "sentences": [
    "Dr. Oz, who is a longtime New Jersey resident (and somehow running for office in Pennsylvania) says during the video: “I’m doing some grocery shopping, I’m at Wengers, and my wife wants some vegetables for crudités.",
    "Thanks a lot, Joe.pic.twitter.com/8kNil6upn8\n— Dr. Mehmet Oz (@Dr. Mehmet Oz) 1649281493\nAnd here comes the Biden slam (if you could even call it that)...\n\"We got Joe Biden to thank for this.",
    "Dr. Oz has caught a lot of heat lately for his cringe-worthy social media posts or stunts, and his latest campaign video is just as equally—if not more—of a mess.",
    "The new video shows the Pennsylvania Senate candidate walking through a grocery store complaining about the high prices.",
    "Dr. Mehmet Oz is apparently now shopping for voters with a new campaign video shot in a Pennsylvania grocery store.",
    "Of course, there is no one to blame but President Joe Biden for the surging supermarket prices, so says Dr. Oz.",
    "\"I, too, have wondered who buys the $6 salsa from the produce section, since like 2015,\" read another one.",
    "Click the upvote icon at the top of the page to help raise this article through the indy100 rankings.",
    "Under Joe Biden, gas prices are skyrocketing and food prices are rising.",
    "Under Joe Biden, gas prices are skyrocketing and food prices are rising.",
    "One tweet reads, \"Won't anyone think of crudite platters, cruel world.\"",
    "Don’t be lazy, make your own guac dude,\" read one tweet in response.",
    "Actually, not then even.Verdict: all whoopie, no pie,\" said another.",
    "Guys, that’s $20 for crudite, and this doesn’t include the tequila.",
    "That’s $10 of vegetables there, and then we need some guacamole.",
    "Not unless they drank all their tequila before shopping.",
    "Thanks a lot, Joe,\" reads his tweet alongside the clip.",
    "That’s two bucks, well, that’s a ton of broccoli there.",
    "\"Inflation is hurting American families.",
    "I just got all the same stuff for ~$10.",
    "Inflation is hurting American families.",
    "Have your say in our news democracy.",
    "\"Clearly you don’t know how to shop.",
    "We must stop the reckless spending.",
    "We must stop the reckless spending.",
    "\"No one eats these things together.",
    "She loves salsa, yeah, salsa there.",
    "Right?”\n“So, here’s a broccoli.",
    "Must be a shortage of salsa.",
    "I mean, that’s outrageous.\"",
    "That’s four more dollars.",
    "There’s some asparagus.",
    "This is outrageous!",
    "This is outrageous!",
    "That’s $4 more.",
    "That’s $4.",
    "Carrots.",
    "No one.",
    "$6?"
  ]
}