{
  "id": 1849,
  "mediaId": 2658,
  "date": "2022-03-21",
  "headline": "Super PAC signals Pennsylvania primary could get rough",
  "image": "https://static.politico.com/36/fb/d95430bb47c799394c6968a1f042/election-2022-pennsylvania-senate-45861.jpg",
  "link": "https://www.politico.com/news/2022/03/21/pennsylvania-primary-super-pac-00018771",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2155,
    3199,
    3280,
    4762,
    221,
    305,
    878,
    5239
  ],
  "sentences": [
    "The document highlights the testing of aggressive negative messaging against Fetterman, who is Pennsylvania’s lieutenant governor, including that he is a “dangerous radical who proudly calls himself a socialist,” “supports far-left policies like a $34 trillion-dollar government takeover of healthcare,” and has “spoken at Defund the Police rallies and wants to release convicted felons back onto our streets.”\nThe Fetterman campaign sought to blame any coming onslaught on the Democratic side on Lamb himself, rather than an independent super PAC.",
    "But the fact that John Fetterman thinks only Fox News Republicans oppose socialism, defunding the police, and banning all private health insurance shows how out of touch he is with reality and why the Republicans are dying to run against him in the fall.”\nA recent email promoting the pro-Lamb group to potential donors said the congressman would join an upcoming call, after which a leader of the super PAC would speak.",
    "| Matt Rourke/AP Photo\nBy Holly Otterbein\n 03/21/2022 04:30 AM EDT\nA super PAC backing Pennsylvania Senate candidate Conor Lamb is warning prospective donors that he is trailing frontrunner John Fetterman by 30 percentage points in the Democratic primary — and that the public’s perception of his opponent’s ideology must change for Lamb to have a shot.",
    "The document cites a poll of the May 17 primary, which was conducted by Impact Research in early February, that found that 47 percent of likely primary voters are for Fetterman, compared to 17 percent for Lamb, 7 percent for Malcolm Kenyatta, 5 percent for Sharif Street, and 3 percent for Val Arkoosh.",
    "It shows Lamb has room to grow and he has proven he can win tough elections in a Trump district.”\nThe slide deck created by the super PAC makes the case that most Democratic voters want a moderate candidate in Pennsylvania’s Senate race, but don’t currently see Fetterman as progressive.",
    "“This is a desperate move from a campaign that hasn’t been able to raise the money on its own, and hasn’t broken through with anyone except for some political insiders.”\nAbby Nassif-Murphy, Lamb’s campaign manager, shot back: “This material did not come from our campaign.",
    "Though many Democrats bristle at the practice, it is legal for candidates to talk to super PAC donors and even attend their fundraisers, as long as they don’t personally ask for contributions in excess of their own campaign finance limits.",
    "Erik Smith, executive director of Penn Progress, said that “without the ability to review [POLITICO’s] source material, I can’t confirm it is valid and hasn’t been altered.”\nHe added, “We are proud to support Conor Lamb in this race.",
    "“For Conor Lamb to have a path in the primary, this dynamic needs to change.”\nUnlike the bloodbath taking place in Pennsylvania’s Republican primary, the contest on the Democratic side has been a relatively tame affair.",
    "Fetterman has taken other progressive positions, such as endorsing Sen. Bernie Sanders (I-Vt.) in the 2016 presidential race and supporting Medicare for All, albeit not as enthusiastically as some on the left.",
    "The slide deck did not make any mention of testing what is considered to be one of Fetterman’s biggest liabilities: an incident in 2013 when he pulled a gun on an unarmed Black man as mayor of Braddock.",
    "“Conor hasn’t been able to gain ground with Democrats, so he’s decided to run like a Republican and use Fox News talking points to attack a fellow Democrat,” said Fetterman spokesperson Joe Calvello.",
    "As chair of Pennsylvania’s Board of Pardons, he has prioritized supporting clemency applications from life prisoners who claim they are innocent or upstanding prisoners.",
    "Penn Progress announced on a recent call that it had raised $1.5 million, a number that included future commitments by donors, according to the source on the call.",
    "Lamb has also received endorsements by groups such as the Philadelphia Democratic Party and the National Organization for Women’s political action committee.",
    "“[P]rimary voters don’t yet see Fetterman as the liberal he is,” reads a memo circulated by the pro-Lamb group Penn Progress, which was obtained by POLITICO.",
    "Fetterman and Lamb haven’t laid a finger on each other on TV, and no outside Democratic groups have aired attack ads on television either.",
    "Fetterman’s campaign has said previously that he has never called himself a socialist, and that he does not support defunding the police.",
    "The nine-page slide deck disseminated by Penn Progress after a recent fundraising call with donors suggests that could soon change.",
    "According to the poll, Fetterman is also supported by 40 percent of Democratic voters who prefer a moderate candidate, a plurality.",
    "Fetterman said he thought the man might be fleeing a shooting, and that he did not know the race or gender of the man at the time.",
    "In the Republican primary, one pro-McCormick group, Honor Pennsylvania, has already spent or booked more than that on advertising.",
    "Kenyatta, who has struggled with fundraising but won some notable endorsements, also received nods from state lawmakers.",
    "All our polling in the primary and general election demonstrates that Conor Lamb is our best shot to win this seat.",
    "It found Fetterman initially leading celebrity doctor Mehmet Oz by 9 percentage points, while Lamb was ahead by 3.",
    "The presentation also showcased a separate survey done in mid-February on a potential general election match-up.",
    "The presentation did not show how the attacks against Fetterman affected his standing in the primary race.",
    "After he faced negative messages, Fetterman trailed Oz by 1 point and McCormick by 12.",
    "Street announced that he was not running for Senate sometime before then, in January.",
    "In the weeks since the poll was in the field, the contours of the race have changed.",
    "It also argues that Fetterman’s liberal ideas are a risk in the general election.",
    "Against former hedge fund CEO David McCormick, Fetterman began 3 points behind.",
    "It also did not demonstrate how negative messaging against Lamb impacted him.",
    "The super PAC previously said it is hoping to bring in more than $8 million.",
    "The margin of error was plus or minus 3.5 percentage points.",
    "Arkoosh dropped out when the survey was being conducted.",
    "It did not show how Lamb performed against McCormick.",
    "Both Fetterman and Lamb have started airing TV ads.",
    "Pennsylvania Senate candidate Conor Lamb.",
    "Thirteen percent are undecided."
  ]
}