{
  "id": 1902,
  "mediaId": 2664,
  "date": "2022-03-23",
  "headline": "Dr. Oz lashes out after Biden boots him off nutrition advisory panel and replaces him with Chef José Andrés",
  "image": "https://www.rawstory.com/media-library/chef-jose-andres-and-dr-mehmet-oz.png?id=29586142&width=1200&coordinates=0%2C18%2C0%2C32&height=600",
  "link": "https://www.rawstory.com/dr-oz-2657027301/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    2201,
    2232,
    2576,
    3972,
    3975,
    1094,
    1241
  ],
  "sentences": [
    "Mehmet Oz has just been fired from the President\\u2019s Council on Sports, Fitness and Nutrition.pic.twitter.com/lvAiOu6JMJ\n— Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6 (@Ron Filipkowski \\ud83c\\uddfa\\ud83c\\udde6) 1648072835\nOz promptly responded on Twitter, proclaiming that he had no intention of resigning voluntarily and the president would have to fire him.",
    "— Geoff Bennett (@Geoff Bennett) 1648065806\nAt the same time, Biden reportedly asked for the resignation of a more controversial member of the council, Dr. Mehmet Oz, a thoracic surgeon and medical talk show host first appointed to the advisory council by former President Donald Trump in 2018.",
    "He has spent much of his campaign railing against the National Institutes of Health's Dr. Anthony Fauci, a top government adviser during the COVID-19 pandemic, whom he referred to as a \"petty tyrant\" and challenged to a debate earlier this year.",
    "I am proud of my service and will not resign.pic.twitter.com/EP1vHWATp4\n— Dr. Mehmet Oz (@Dr. Mehmet Oz) 1648071503\nThis comes as Oz seeks the Republican nomination for Senate in Pennsylvania, even though he actually lives in New Jersey.",
    "In the latest round of presidential \"key appointments,\" President Biden names famed chef and humanitarian Jos\\u00e9 Andr\\u00e9s as co-chair of the the President\\u2019s Council on Sports, Fitness, & Nutrition.",
    "On Wednesday, PBS NewsHour's Geoff Bennett reported that President Joe Biden is naming celebrity chef José Andrés as co-chair of the President's Council on Sports, Fitness & Nutrition.",
    "Andrés, in addition to his work as a chef, is the founder of World Central Kitchen, a nonprofit which works to feed populations affected by natural and humanitarian disasters.",
    "He has for years been accused of peddling dubious dietary supplements as cures for obesity and other complicated medical conditions, with shaky medical evidence at best.",
    "Clearly, Joe Biden can\\u2019t be around anyone who doesn\\u2019t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "The organization has served over 1 million meals in Ukraine as the country has suffered under a brutal invasion by Russia."
  ]
}