{
  "id": 1904,
  "mediaId": 6526,
  "date": "2022-03-24",
  "headline": "Pennsylvania Senate candidate Dr. Oz removed from President’s Sports Council; he and Herschel Walker ousted because they are running for office",
  "image": "https://www.mcall.com/resizer/IADz-8hEqreJogkXE51UDFXsY7w=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/OJ3T56R4KBPIPAEYE6TMLV3PYQ.jpg",
  "link": "https://www.mcall.com/news/pennsylvania/politics/mc-us-election-2022-senate-fitness-council-20220324-v4pe5b4ir5honb7p6ducignt3u-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.mcall.com/mc-staff-associated-press-staff.html#nt=byline",
  "termIds": [
    1684,
    2232,
    962,
    1171,
    5010,
    5239
  ],
  "sentences": [
    "HARRISBURG — The White House has removed Dr. Mehmet Oz — best known as daytime TV’s host of “The Dr. Oz Show” and a candidate to replace Sen. Pat Toomey of Pennsylvania — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "The White House on Wednesday posted two new appointments to the council, while a White House official said Oz and Walker were asked to resign because the White House doesn't permit candidates for federal office to serve on boards.",
    "Oz and Walker — both are Republicans — were appointed by President Joe Biden's predecessor, Donald Trump, and Oz quickly went to social media to claim that he was being removed for political reasons.",
    "The letter from the White House Office of Presidential Personnel asked the men to resign Wednesday or be removed by the end of the day.",
    "“It's beyond sad that Joe Biden would politicize such an important issue like health,” Oz said in a video he posted to Twitter.",
    "Walker announced his candidacy in Georgia on Aug. 25 and Oz announced his candidacy in Pennsylvania on Nov. 30."
  ]
}