{
  "id": 1913,
  "mediaId": 2553,
  "date": "2022-03-24",
  "headline": "Biden Dropping Dr. Oz From Presidential Council",
  "image": "https://dw-wp-production.imgix.net/2022/03/Untitled-design-21-copy-9-1.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/biden-dropping-dr-oz-from-presidential-council",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dillon Burroughs",
  "authorUrl": "https://www.dailywire.com/author/dillon-burroughs",
  "termIds": [
    0
  ],
  "sentences": [
    "Earlier in the day, White House Press Secretary Jen Psaki suggested Spicer was not “qualified” to be on the board and does not “align” with Biden administration “values.”\nThe Daily Wire is one of America’s fastest growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "The Daily Wire previous reported:\nSpicer made the announcement during his Newsmax show, “Spicer & Company,” after he received an email from the Biden camp informing him he would be fired from the board, effective 6 p.m. Wednesday, if he does not resign immediately.",
    "“All Trump appointees, including myself, have been kicked off the boards of the United States Naval Academy Air Force Academy in West Point in an unprecedented move by the Biden administration,” Spicer announced on-air.",
    "pic.twitter.com/fJaVLKVWOC\n— Dr. Mehmet Oz (@DrOz) March 24, 2022\n“It’s against the Biden administration’s policy for federal candidates to serve on presidential boards, according to a White House official.",
    "Last year, several Trump-appointed board members were targeted for removal, including former White House press secretary Sean Spicer, who was asked to leave his board role at the Naval Academy.",
    "In addition, Georgia Republican Senate candidate and college football great Herschel Walker also reportedly received a similar letter requesting his resignation from the same council.",
    "“Earlier Wednesday, the White House announced the appointment of chef and humanitarian José Andrés and WNBA star Elena Delle Donne as co-chairs of the committee,” CNN added.",
    "The Biden administration threatened to remove Pennsylvania Republican Senate candidate Mehmet Oz from the President’s Council on Sports, Fitness & Nutrition on Wednesday.",
    "The White House just emailed me demanding my resignation by the end of the day,” Oz said on Twitter alongside an image of an email regarding the letter.",
    "“Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "“I’m announcing tonight for the first time that I will not be submitting my resignation and I will be joining a lawsuit to fight this,” he added.",
    "pic.twitter.com/EP1vHWATp4\n— Dr. Mehmet Oz (@DrOz) March 23, 2022\nDr. Oz also spoke out regarding the issue in a video on Twitter on Wednesday.",
    "The administration’s letter said that if Dr. Oz did not resign from the board by the end of the day on Wednesday that he would be terminated.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "“I received this letter on behalf of @POTUS requesting I resign from the President’s Council on Sports, Fitness & Nutrition.",
    "I received this letter on behalf of @POTUS requesting I resign from the President's Council on Sports, Fitness & Nutrition.",
    "The official said letters to Oz and Walker were sent Wednesday requesting their resignations by 6 p.m.” CNN reported.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons,” he wrote alongside the video.",
    "Dr. Oz and Walker are not the first Republicans to face board removals under the Biden administration.",
    "“President Trump appointed me to two terms on the President’s Council on Sports, Fitness & Nutrition.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.",
    "The White House did not delay in appointing two new members to the council.",
    "It’s sad that he would politicize such an important issue like health.",
    "It’s sad that he would politicize such an important issue like health.",
    "I am proud of my service and will not resign,” Oz added.",
    "Walker has not yet publicly addressed the issue.",
    "Create a free account to join the conversation!",
    "I am proud of my service and will not resign.",
    "Become a member now and join our mission.",
    "Believe the same?"
  ]
}