{
  "id": 1965,
  "mediaId": 2644,
  "date": "2022-03-30",
  "headline": "It’s Terminal: Dr. Oz fired from presidential council amid GOP Senate run",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/dr-oz-fired-index.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/30/dr-oz-fired-from-presidential-council-amid-gop-senate-run/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jesse O’Neill",
  "authorUrl": "",
  "termIds": [
    2201,
    2232,
    3975,
    878,
    1171
  ],
  "sentences": [
    "You would think record gas prices, a 40-year inflation high, and the situation in Ukraine would be his highest priorities at the moment.”\nThe cardiac surgeon-turned-television personality is running to fill the seat of retiring Sen. Pat Toomey, a Republican.",
    "“President Biden is so scared about us beating Raphael Warnock that he has asked me to resign from my unpaid position on the President’s Council on Sports, Fitness, and Nutrition,” the University of Georgia Heisman Trophy winner wrote.",
    "Former NFL running back Herschel Walker also said he would not step down from his post, as he sought to win the Republican Senate primary in Georgia and unseat Sen. Raphael Warnock, a Democrat.",
    "“I’m not a quitter so you are going to have to fire me.”\nIt was unclear if Walker had also been benched by the White House, which did not immediately respond to The Post’s request for comment.",
    "Republican US Senate candidate Dr. Mehmet Oz was fired from the President’s Council on Sports, Fitness and Nutrition, about a week after the White House asked him to resign.",
    "The Biden administration had also called on another celebrity Republican Senate candidate to quit the council or be fired last week, without citing a reason.",
    "The candidate said last week that he would not step down, after being appointed to the council by former President Donald Trump in 2018.",
    "Oz, 61, who is running for office in Pennsylvania, was formally fired Wednesday, according to the Philadelphia Inquirer.",
    "“If President Biden wants to politicize health, he will have to fire me.",
    "“I have no intention of resigning,” Oz wrote on Twitter."
  ]
}