{
  "id": 1995,
  "mediaId": 2557,
  "date": "2022-03-30",
  "headline": "REPORT: Dr. Oz longtime staffers say they were ‘blindsided’ after campaign announcement",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/03/GettyImages-1211404993mehmetoz.jpg",
  "link": "https://dennismichaellynch.com/report-dr-oz-longtime-staffers-say-they-were-blindsided-after-campaign-announcement/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/yLhKsZm9sl\n— Dr. Mehmet Oz (@DrOz) November 30, 2021\nEXCLUSIVE: ‘Heartless’ Dr. Oz leaves longtime staffers jobless and depressed https://t.co/27Bq5ocjAR pic.twitter.com/S86qLGnkRK\n— Page Six (@PageSix) March 30, 2022\nTo get more information about this article, please visit Breitbart.",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nCelebrity doctor, Mehmet Oz, reportedly left his longtime staffers jobless and “blindsided” after he announced his run for U.S. Senate in Pennsylvania.",
    "Honestly, I was excited to hear he was running…\nAND surprised President Trump did not endorse him…\nUntil… he was interviewed at c-pac and denied that there was wrong doing in the 2020 election… he stated that certifying the election was the correct way to go.",
    "“People who have worked for him for [13] years are now scrambling for work and are furious that he’s left them in a lurch financially after they worked their asses off for him for so long,” a source reportedly told Page Six.",
    "pic.twitter.com/SKF3m6a9qQ\n— Dr. Mehmet Oz (@DrOz) March 27, 2022\nI’m running for U.S. Senate in Pennsylvania because America needs a Conservative Republican to cure what’s wrong with Washington.",
    "Oz decided to remove his show from all markets after the Federal Communications Commission’s equal time rule required Fox television stations in New York City and Philadelphia to pull the show.",
    "The report also explains that Dr. Oz Show had already been renewed for a 14th season, which would have guaranteed his staffers employment for nearly two years.",
    "Oz, the former host of The Dr. Oz Show, ended his show in November, opting for a congressional campaign to replace retiring Republican Sen. Pat Toomey (R-PA).",
    "The article goes on to state the following:\nSome staffers who have worked on Oz’s namesake show since its start in September 2009 were left high and dry.",
    "Oz’s decision to run for senate and cancel his show stunned his staff, as most of them reportedly found out through the media, and not from their boss.",
    "They received no severance package, and are now not only out of a job, but have lost their health insurance benefits as well, the report states.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "I’m a world-class surgeon, fighter, and health care advocate stepping forward to cure our country’s ills.",
    "Just like President Trump, I will take on the establishment in Washington and put America First.",
    "Unfortunately, because he could have been a grate Senator but he has chosen the path of the",
    "He will never question, he is a go along to get along type of guy.",
    "Listen to the latest daily DML podcasts below!",
    "Watch my announcement video now!",
    "Then please share."
  ]
}