{
  "id": 2026,
  "mediaId": 2641,
  "date": "2022-03-30",
  "headline": "Dr. Oz to Newsmax: 'The Green New Deal Is a Hoax, a Fraud'",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=535b8e12-e1b3-44b1-8143-04a5a3455bd7&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/newsmax-dr-oz-energy-rick-perry/2022/03/30/id/1063669/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luca Cacciatore",
  "authorUrl": "",
  "termIds": [
    1872,
    2201,
    2232,
    3223,
    4796,
    715,
    5239
  ],
  "sentences": [
    "\"Many times, we've got financial sectors, we've got media, and we've got government now with [President Joe] Biden's leadership working together to create a storyline around energy that doesn't respect what really needs to happen,\" he continued.",
    "Dr. Mehmet Oz, who is running as a Republican for the U.S. Senate in Pennsylvania, told Newsmax on Wednesday that the Democratic Party's Green New Deal agenda is \"a hoax, a fraud\" and \"can't be done in the timeline that's described.\"",
    "\"It's the least I could do to come up here from Oklahoma today and let everybody know that I endorse him personally, professionally, for what he's seeking to do here in Pennsylvania,\" he added.",
    "\"There's actually Russian misinformation that's allowed some of these false narratives to prosper because they're funding [against oil and gas] both in Europe and in this country,\" Oz said.",
    "349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV’s including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here",
    "Later in the program, fracking billionaire Harold Hamm made an appearance to explain why he was putting his trust behind Oz for the Senate seat in Pennsylvania.",
    "\"But in a professional way, I know that we need someone who can go to Washington, D.C., and be a powerful spokesperson for the energy industry in this country.\"",
    "Oz went on to explain the importance of the U.S. being energy independent and how it is possible only by embracing natural gas and fracking.",
    "I appreciate everything he's done working with kids in school with Health Corps through the 20 years that I've known him,\" Hamm said.",
    "\"The reliability of energy will only exist if we're able to rely on some of the energy sources we have under our ground here.\"",
    "Rick Perry, the energy secretary under former President Donald Trump and the latest supporter of his Senate candidacy.",
    "He highlighted questionable narratives pushed by foreign actors and the left on the viability of green energy.",
    "\"First of all, I have a very good relationship that goes a long ways back, basically on the health side.",
    "\"What we can do is rely on natural gas right here from under our feet in Pennsylvania,\" Oz said.",
    "The celebrity doctor-turned-politician appeared on \"Greg Kelly Reports\" with former Texas Gov.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "\"I know this man, and I respect him in a personal way,\" Perry said of Oz.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "277, AT&T TV Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}