{
  "id": 2051,
  "mediaId": 2641,
  "date": "2022-03-20",
  "headline": "Republicans Demand New Probe Into Hunter Biden Following NYT Story",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=f83ac1cd-2df3-46cd-8a6f-cdb4d82fcfdc&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/hunter-biden-laptop-investigation/2022/03/20/id/1062077/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Freeman",
  "authorUrl": "",
  "termIds": [
    1894,
    2201,
    3102,
    4486,
    734,
    876,
    877,
    878,
    1054
  ],
  "sentences": [
    "Texas Sen. Ted Cruz told the Post regarding the confirmation of the laptop that \"the most basic accountability requires firing those responsible for the 'Russian disinfo' lie about the Biden family’s corruption, including and especially the former intelligence officials who were elevated to the top of cable news because they pushed wild and unsubstantiated Russia conspiracy theories about President Trump,\" adding that \"Big Tech leaders who participated in censoring the truth should answer to Congress and the American people in sworn testimony.\"",
    "\"Big Tech’s censorship of a story the liberal media has now acknowledged to be true just proves that a Republican House majority must take meaningful action to rein in Big Tech censors next year,\" New York Republican Rep. Claudia Tenney said.",
    "Numerous Republicans are calling for a new investigation into Hunter Biden after the New York Times admitted the contents of his abandoned laptop are indeed authentic, the New York Post reported over the weekend.",
    "Republican Pennsylvania Senate candidate Dr. Mehmet Oz told The Post that \"this is just another example of the media being quick to silence anything that would shine a light on the corrupt Biden family.",
    "As Pennsylvania’s next Senator, I will support an investigation into the findings of Hunter Biden’s laptop and any efforts to cover it up.\"",
    "We’re all talking about disinformation in Russia and other totalitarian countries and we are learning that we have it right here at home.\"",
    "Republican National Committee Chairwoman Ronna McDaniel added on Twitter her demand for \"accountability\" from Big Tech on the issue.",
    "\"All options should be on the table, including probes into their conduct and its impact on the Democratic process.\"",
    "There is already an ongoing federal investigation into Hunter Biden's tax filings and business dealings worldwide.",
    "Another GOP New York Rep, Nicole Malliotakis, said that \"it’s sad."
  ]
}