{
  "id": 2109,
  "mediaId": 2641,
  "date": "2022-03-25",
  "headline": "Dr. Oz to Newsmax: Will Keep Fighting After Dismissal From Fitness Council",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=dd5d3c74-f699-4865-9b93-7ce6e8c08fc5&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/dr-oz-herschel-walker-fitness-council/2022/03/25/id/1062921/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sandy Fitzgerald",
  "authorUrl": "",
  "termIds": [
    1578,
    1684,
    2201,
    2232,
    2576,
    3972,
    3975,
    1171
  ],
  "sentences": [
    "Dr. Mehmet Oz said Friday that he won't quit fighting over his position on the President's Council on Sports, Fitness, and Nutrition, telling Newsmax that if he is elected to represent Pennsylvania as a senator, he and NFL great Herschel Walker, who was also fired from the council, will fight back against politically-motivated firings.",
    "He said he also questions the timing for his removal, pointing out that he's been campaigning for months for the Senate, and said he thinks the issue might be because of the administration's insistence on a one-size-fits-all approach to medicine.",
    "\"I have been very harsh on their inability just to let energy producers know that they're part of the national security apparatus of the country, which would give them the confidence to start drilling and producing natural gas.\"",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV’s including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\n© 2022 Newsmax.",
    "Meanwhile, he said he thinks Dr. Anthony Fauci, Biden's chief medical adviser and head of the National Institutes of Allergy and Infectious Diseases should be fired, accusing him of violating the Hatch Act.",
    "The council also has not called a meeting since Biden's inauguration last year, the doctor said, questioning why the health council would not meet during the height of the COVID-19 pandemic recovery.",
    "Earlier this week, President Joe Biden's administration asked Oz and Walker, who is running for the Senate in Georgia, to resign their spots on the council or risk being removed.",
    "Oz insisted Friday that as he and Walker are not federal employees and because the seats on the council are unpaid volunteer spots, the Hatch Act doesn't apply to them.",
    "\"That's what I've done my whole life, and yet when President Trump, who knows a thing or two about firing people heard about this, he was shocked as well,\" Oz said.",
    "\"Even today, I, as a doctor, cannot prescribe you a pill that you can pick up easily at a pharmacy, and yet these pills have existed before COVID started,\" said Oz.",
    "He added that being on the council was a \"wonderful honor\" and that the organization was \"started back in the days of Kennedy and Eisenhower to help children.\"",
    "At a time when there are inflation and gas prices at the highest rates in years, the Ukraine war is heating up, there should be other priorities, said Oz.",
    "Also, the administration has a policy forbidding people running for federal office from serving on boards like the Fitness Council, reports Market Watch.",
    "The White House cited the 1939 Hatch Act, which limits political activities for certain federal employees from engaging in partisan political campaigns.",
    "According to Market Watch, Biden announced that chef and humanitarian Jose Andres and WNBA player Elena Delle Donne will co-chair the council.",
    "They were both appointed to the White House council in 2018 by then-President Donald Trump, and Walker was named to co-chair the council.",
    "There were often meetings under Trump's White House, said Oz, but since December 2020, \"I've gotten very few communications.\"",
    "\"The Hatch Act does not apply to me or Herschel — in fact, quite the opposite,\" Oz said on Newsmax's \"Wake Up America.\"",
    "I thought President Biden meant to fire Fauci, which would have been asking for wishful thinking.",
    "President Joe Biden fired Walker and Oz due to their current candidacies for the U.S. Senate.",
    "Oz added that he thinks he was removed from the council for being \"a thorn in their side.\"",
    "Oz said Friday they were re-appointed in December 2020, just before Trump left office.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "\"I have gone after Dr. Fauci and other failings of the administration,\" he said.",
    "\"Both of us got these bizarre, terse letters from the White House,\" Oz said.",
    "And then I thought he's playing political games.\"",
    "\"That would actually have saved countless lives.\"",
    "\"Initially I thought I was being punked.",
    "102, Cox cable, Suddenlink Ch.",
    "\"It doesn't make any sense.\"",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "All rights reserved.",
    "\"I'm not quitting.\"",
    "102, Mediacom Ch.",
    "615, Frontier Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch.",
    "Special Links:"
  ]
}