{
  "id": 216,
  "mediaId": 6571,
  "date": "2022-04-11",
  "headline": "Pets help manage stress and anxiety, experts say",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/04/01/0906440d-3482-4608-b40f-06685b8d668a/thumbnail/1200x630/a2ba9db990b1ef409086b13a5905fd00/admin-ajax-11.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/pets-help-manage-stress-and-anxiety-experts-say/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    540,
    5249
  ],
  "sentences": [
    "\"Not only does it give someone companionship but it also helps set a routine of getting out of the house, especially with loneliness or feeling sad,\" said AHN psychiatrist Dr. Aleicia Kaplan.",
    "\"I'm the youngest of six kids, so all my siblings have kids, and I got to battle saying, 'she is my daughter, just like they them,'\" said dog owner Katie Bloomgren, the mom of Reagan.",
    "Studies show our four-legged friends are a guiding light and safety net for overall health and mental well-being.",
    "On the KDKA Facebook page, more than a thousand viewers shared pictures of their pets for National Pet Day.",
    "People are complicated and they have complicated expectations and needs,\" said dogwalker Giancarlo Dozzi.",
    "By: Shelley Bortz/KDKA-TV\nPITTSBURGH (KDKA) - Dogs (and cats, too) are more than man's best friend.",
    "Experts say dog owners had more social support and fewer depressive symptoms during the pandemic.",
    "During the pandemic, more people turned toward animals to help get them through the uncertainty.",
    "Experts say we love our animals because they offer things that humans sometimes can't.",
    "We take our dogs to the dog park the same way we take our children to the playground.",
    "Many of us have both pets and children and in many ways treat them the same.",
    "Their unconditional love helps us manage stress and anxiety.",
    "We buy our pets toys and dress them up for the holidays.",
    "We even take them with us on family vacations.",
    "\"They remind us of our place in the world.",
    "In:\nPets"
  ]
}