{
  "id": 218,
  "mediaId": 2746,
  "date": "2022-04-09",
  "headline": "Trump endorses Dr. Oz for Senate",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/09/Election_2022_Senate_Pennsylvania_Trump_Oz_34488.jpg-e834b_c0-163-3640-2286_s1200x700.jpg?5d729bf68230991547cecea24dfa5c77213e334f",
  "link": "https://www.washingtontimes.com/news/2022/apr/9/trump-endorses-dr-oz-senate/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Clark",
  "authorUrl": "https://www.washingtontimes.com/staff/joseph-clark/",
  "termIds": [
    2190,
    2201,
    2232,
    3533,
    4021,
    4762,
    878,
    1094,
    1171,
    5239
  ],
  "sentences": [
    "That means people like you.”\nMr. Oz, host of the syndicated “The Dr. Oz Show,” carries significant name recognition in the race for the open seat after the retirement of Republican senator Pat Toomey — one of seven Republicans in the Senate who voted to convict Mr. Trump in February 2021 following Mr. Trump’s impeachment after a pro-Trump mob stormed the Capitol the month prior over objections to the November 2020 election results.",
    "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate.”\nDuring his speech in North Carolina, Mr. Trump praised Mr. Oz’s career, adding that his success on television will serve him well with voters.",
    "And We’re going to take back America.”\nMr. Trump also spoke in favor of Rep. Ted Budd, a North Carolina Republican who is running for retiring Republican Sen. Richard Burr’s seat against former Republican North Carolina Gov.",
    "Mr. Trump’s spokesperson Liz Harrington announced the endorsement on Twitter Saturday, just before the former president announced the endorsement to the crowd attending his campaign-style rally in Selma, North Carolina.",
    "Mr. Trump also continued to fuel intrigue on Saturday over his plans to run for office in 2024, as he has done in nearly every public appearance this year but stopped short of officially announcing his bid.",
    "The former president has remained powerful in U.S. politics since leaving office and is dead set on a Republican takeover in Congress following the 2022 midterms.",
    "Mr. Trump initially endorsed Sean Parnell for the seat before Mr. Parnell dropped out of the race after being accused of abuse by his former wife.",
    "“This is all about winning elections in order to stop the Radical Left maniacs from destroying our Country,” the statement on Twitter reads.",
    "“And now we just may have to do it again.”\n“Is there anybody here who would like to see me run again?” he said before the cheering crowd.",
    "Mr. Trump, who remains popular among Republican voters, could have significant sway over the race with his endorsement.",
    "Former President Donald Trump on Saturday endorsed Dr. Mehmet Oz, a Republican running for U.S. Senate in Pennsylvania.",
    "“The truth is, I ran twice, I won twice, and I did much better the second time,” Mr. Trump told the crowd.",
    "Former hedge fund CEO David McCormick, a fellow Republican contender, has also met with Mr. Trump.",
    "“This is the year we’re going to take back the House,” he said at Saturday’s rally.",
    "Tremendous, tremendous career, and they liked him for a long time.",
    "When you’re on television for 18 years, that’s like a poll.",
    "This story is based in part on wire service reports.",
    "Mr. Budd secured Mr. Trump’s endorsement in June.",
    "Mr. Oz recently met with Mr. Trump in Mar-a-Lago.",
    "“We’re going to take back the Senate.",
    "“He’s a good man,” Mr. Trump said.",
    "That’s like a poll.",
    "“Harvard educated.",
    "Pat McCrory."
  ]
}