{
  "id": 2198,
  "mediaId": 2512,
  "date": "2022-03-29",
  "headline": "Dr. Oz's TV staffers say he 'blindsided everyone' when he abruptly fired them to run for Senate",
  "image": "https://www.alternet.org/media-library/image.png?id=28136127&width=1200&coordinates=0%2C51%2C0%2C52&height=600",
  "link": "https://www.alternet.org/2022/03/dr-oz-blindsided-tv-staffers/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Evans",
  "authorUrl": "https://www.alternet.org/author/timothy_evans",
  "termIds": [
    2190,
    2201,
    2232,
    3975,
    4762,
    710,
    878,
    1171
  ],
  "sentences": [
    "Last week Oz, who in recent years has promoted dietary supplements with few scientifically proven benefits, lashed out at President Joe Biden for demanding his resignation from the President's Council on Sports, Fitness & Nutrition.",
    "“People who have worked for him for [13] years are now scrambling for work and are furious that he’s left them in a lurch financially after they worked their asses off for him for so long,” one source told the Post's Page Six.",
    "But in November of last year the Donald Trump-supporting TV doctor - and New Jersey resident - apparently sensed political opportunity in Pennsylvania and declared himself a candidate in the Republican U.S. Senate primary.",
    "\"He’s a 'heart doctor without a heart' is how some of Oz’s longtime staffers are describing the way he left them 'high and dry' in order to run for Senate,\" according to the Post.",
    "A recent Fox News poll shows Oz trailing David McCormick in the Republican primary, 24-15 percent, after having enjoyed a lead in the race shortly after announcing his candidacy.",
    "The New York Post is reporting that longtime staffers are seething that he gave them no notice that his run for political office would put them out of work.",
    "Dr. Mehmet Oz has been a fixture on television for the past 13 years, ever since Oprah began featuring him as a guest on her talk show.",
    "Another source told the newspaper that Oz “blindsided everyone” at the show and most people found out about his run from the media.",
    "It was picked up, so that was almost two more years of guaranteed work that’s just gone like that,” the insider said.",
    "In order pursue his quest for the seat of retiring GOP Sen. Pat Toomey, Oz had to shut down his TV show.",
    "Loyal staffers, who worked on “The Dr. Oz Show” since its inception, are depressed.",
    "No health benefits after working for America’s doctor for 13 years.",
    "He tweeted his refusal to submit the requested resignation.",
    "“They’ve lost jobs and they’re losing health benefits.",
    "No one was prepared for this,” they said.",
    "There was supposed to be another season.",
    "He’s leaving his staff without benefits.",
    "No one had a clue.",
    "“It was abrupt."
  ]
}