{
  "id": 2264,
  "mediaId": 2702,
  "date": "2022-03-24",
  "headline": "Trump lawyer urges appeals court to block House from getting tax returns",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/trumpdonald_01122021_ap-gerald-herbert_truth-social.jpg?w=1280",
  "link": "https://thehill.com/regulation/court-battles/599583-trump-lawyer-urges-appeals-court-to-block-house-from-getting-tax/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Harper Neidig",
  "authorUrl": "https://thehill.com/author/harper-neidig/",
  "termIds": [
    1412,
    2201,
    2566,
    2610,
    3975,
    505,
    1163
  ],
  "sentences": [
    "“That it can’t be oversight?”\nNorris responded that the committee has to be more clear about what it intends to do with the tax returns, saying that targeting a specific president with such a request presents a “constitutional minefield.”\n“We want Congress to adequately identify what it’s doing with specificity and not use vague and loosely worded explanations,” he said.",
    "“If we didn’t plausibly allege a non-legislative purpose here, then no one ever could.”\nThe court battle began in July 2019, when the Ways and Means Committee sued the IRS for not complying with its request for the then-president’s tax returns despite a law requiring the Treasury Department to turn such records over to the congressional panel upon request.",
    "Cameron Thomas Norris, an attorney representing Trump in the dispute with the House Ways and Means Committee, told the court the Democratic lawmakers have no valid legislative purpose for their request to the Treasury Department, urging a three-judge panel for the D.C.",
    "In December, U.S. District Judge Trevor McFadden, a Trump appointee, dismissed the former president’s renewed legal effort to block the IRS from handing over the records, ruling that the law favored the committee’s authority to request the tax returns.",
    "Douglas Letter, the House’s general counsel, argued on Thursday that the committee has clearly demonstrated a legitimate legislative purpose and that the courts owe Congress deference when evaluating whether that intent is valid.",
    "The Trump administration fought the lawsuit, but after President Biden took office his administration reversed the previous position and agreed that the committee had the authority to obtain the records.",
    "“The fact that there are allegations of an additional purpose is irrelevant.”\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Trump quickly appealed, and his lawyers have argued that the political animus toward him expressed by Neal and other Ways and Means members undermined the legitimacy of their request.",
    "Judge Robert Wilkins questioned how the courts should be evaluating the committee’s stated legislative purpose, which includes oversight of the IRS’s presidential audits.",
    "“Are you contending that the valid legislative purpose has to be the purpose to pass a bill or to introduce a bill?” asked Wilkins, an Obama appointee.",
    "A lawyer for former President Trump on Thursday argued that a federal appeals court should block a House committee from obtaining his tax returns.",
    "Circuit panel might rule, but the judges probed Norris on Thursday about whether his argument is enough to block the committee’s access.",
    "Norris said during a hearing Thursday there is overwhelming evidence that the committee, led by Rep. Richard Neal (D-Mass.",
    "“[Neal] said to the Treasury Department, to the IRS, ‘Here is what I’m seeking and here’s why I’m seeking it.’ That’s it.",
    "“The key question in these cases is whether the committee has a legitimate legislative purpose,” Norris told the court.",
    "), is seeking Trump’s personal financial information for political reasons.",
    "Circuit Court of Appeals to block the Biden administration from complying.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "There is the purpose,” Letter said.",
    "It’s unclear how the D.C."
  ]
}