{
  "id": 2276,
  "mediaId": 2934,
  "date": "2022-03-23",
  "headline": "Misleading ‘Defund the Police’ Attack on Dr. Oz",
  "image": "https://cdn.factcheck.org/UploadedFiles/OzDefund.png",
  "link": "https://www.factcheck.org/2022/03/misleading-defund-the-police-attack-on-dr-oz/",
  "mediaOutlet": "FactCheck",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Farley",
  "authorUrl": "https://www.factcheck.org/author/robert-farley/",
  "termIds": [
    2201,
    2232,
    3975,
    4611,
    372
  ],
  "sentences": [
    "The California Endowment is a private foundation whose mission is “to expand access to affordable, quality health care for underserved individuals and communities and to promote fundamental improvements in the health status of all Californians.”\nAccording to the Chronicle of Philanthropy article, “Open Society, the California Endowment, the Marguerite Casey Foundation, and other grant makers say they plan to make efforts to cut police spending a long-term priority.” The article noted that the California Endowment spent $5 million in 2020 “to help develop recommendations for alternative approaches to public safety.”\nBut as we said, Oz’s affiliation with the group was a dozen years ago — some 10 years before the “defund” movement took off and related solely to the issue of encouraging people to sign up for insurance plans in the Affordable Care Act.",
    "As we wrote in another story about ads attacking Oz, “In November 2010, eight months after then-President Barack Obama signed the Affordable Care Act into law, and after a bruising election season of Republican attack ads against it, Oz starred in an ad from the nonpartisan California Endowment, a proponent of the law, urging Californians to enroll in the new Affordable Care Act plans.”\nSarah Reyes, managing director of communications for the California Endowment, told us via email that the Affordable Care Act ad that Oz did for the group in 2010 was his only affiliation with the foundation.",
    "He will support efforts to ensure they always have the resources they need to do their job and keep our communities safe.”\nIn December, Oz tweeted, that he wants “to support our police and make Pennsylvania and America safe again,” while “the Left wants to defund our law enforcement.”\nAs we have written in the past, there is no agreed upon definition for the term “defund the police.” Some critics of the police, who believe there is systemic racism in law enforcement, really do want to abolish police forces and replace them with other forms of community safety entities.",
    "Reyes noted that, “we, The California Endowment, as a private foundation are prohibited from taking a position on any issue and thus we don’t take a stand on ‘Defunding the Police’ or any other issue, however we do believe that prevention must be a part of the discussion in order to prevent young people from going on the prison pipeline.”\n“We believe that prevention and police need to be part of the same conversation,” Reyes said.",
    "But an ad from a conservative super PAC misleadingly claims that the Pennsylvania Republican Senate candidate was “a spokesman for a group who wanted to defund the police.”\nThe tangential link the ad relies on is that a dozen years ago, Oz appeared in an ad for a private foundation to encourage Californians to enroll in the new Affordable Care Act plans.",
    "According to the small print in the ad, the ad is referring to Oz’s connection to the California Endowment, and an article in the Chronicle of Philanthropy on July 27, 2021, that discusses how, in the wake of George Floyd protests, foundations were pushing efforts to overhaul police departments.",
    "According to its organizing documents filed in late January with the Federal Election Commission, Pennsylvania Conservative Fund is a committee that supports or opposes more than one federal candidate, and plans to make independent expenditures that are not coordinated with any candidate.",
    "Oz was a spokesman for a group who wanted to defund the police.”\nIn the background, the ad first shows Oz superimposed against the backdrop of protesters calling for police reform after the death of George Floyd, a Black man who was killed by a white police officer in Minneapolis in 2020.",
    "Fund them with the resources and training — resources and training they need to protect our communities.”\nWe reached out to the Pennsylvania Conservative Fund about its claim tying Oz to the “defund” movement, but did not get a response.",
    "Oz has never been a “spokesman” for the California Endowment, she said, and he has never been a funder or board member or in any other way affiliated with the California Endowment since that ad.",
    "During the 2020 presidential campaign, for example, then-President Donald Trump repeatedly accused Joe Biden of wanting to defund the police, despite Biden’s assurances that he did not.",
    "Accusing various Democrats of wanting to defund the police has been a popular attack line from Republicans, though in many cases the accusations have proven demonstrably false.",
    "He believes our law enforcement has a hard enough job on the streets and that they shouldn’t have to fend off calls to ‘defund’ them from radicals and the extreme left.",
    "Biden has since repeatedly said he does not support defunding the police, which he did again most recently in his State of the Union address on March 1.",
    "The ad then shows Oz against the background of a road painted with “defund the police.”\nOz vehemently opposes any efforts to defund the police.",
    "We believe that prevention and healing must be part of the funding cycle.”\nEditor’s note: FactCheck.org does not accept advertising.",
    "If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.",
    "That is the thin reed the ad from Pennsylvania Conservative Fund relies on in its attempt to link Oz to the “defund” movement.",
    "And more recently, the foundation has funded research into alternative approaches to public safety that includes prevention.",
    "Others advocate shifting some money and functions away from police departments to social service agencies.",
    "Oz is a strong supporter of our law enforcement and will give them a powerful voice in Washington.",
    "“We know and research tells us that police enforcement alone doesn’t increase or decrease crime.",
    "“We should all agree the answer is not to defund the police,” Biden said.",
    "Still, others want to increase funding to implement changes in policing.",
    "Dr. Mehmet Oz has been outspoken about opposing defunding the police.",
    "“Is Mehmet Oz a secret Hollywood liberal?” the ad’s narrator asks.",
    "We rely on grants and individual donations from people like you.",
    "Credit card donations may be made through our “Donate” page.",
    "His campaign website says, “Dr.",
    "Please consider a donation.",
    "“It’s to fund the police.",
    "“You decide.",
    "Fund them.",
    "Fund them."
  ]
}