{
  "id": 2425,
  "mediaId": 2659,
  "date": "2022-03-22",
  "headline": "Trump Is Hinting At Meddling And Handing The Pennsylvania Senate Seat To Democrats By Supporting Dr. Oz",
  "image": "https://www.politicususa.com/wp-content/uploads/2022/03/Dr-Oz-Trump.jpg",
  "link": "https://www.politicususa.com/2022/03/22/trump-dr-oz-pennsylvania-senate.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Easley",
  "authorUrl": "",
  "termIds": [
    2201,
    2232,
    3199,
    3280,
    4762,
    305,
    878,
    1171,
    5239
  ],
  "sentences": [
    "The Pennsylvania Senate Republican primary has already been a bloodbath, with the average of polls showing McCormick with a 1.7% edge over Dr. Oz, but recent polling has shown McCormick, Sands, and Oz locked in a tight three-way race with most GOP voters on decided.",
    "If Trump endorsed Oz and he won the primary, it would set Democrats up to flip the Senate seat of retiring Sen. Pat Toomey and take away the GOP path to winning back the Senate in November.",
    "But it’s notable that Trump decided to namecheck Oz rather than David McCormick — the other frontrunner in the Republican primary who’s aggressively courting a Trump endorsement.",
    "“He seems to be doing well, and he’s got a good race, a tough race going.”\nTo be sure, this does not signal anything concrete from Trump, who has tried to play GOP kingmaker.",
    "While delivering a private speech as part of his “American Freedom” tour in Florida this weekend, Trump asked the crowd what they thought about GOP candidate Mehmet Oz.",
    "Pennsylvania is not a state that takes to carpetbagging candidates, and Oz would not match up well in the general election with Fetterman or Lamb.",
    "Trump recently asked a crowd if they like GOP PA Senate candidate Dr. Oz, whose nomination would hand the seat to Democrats.",
    "Trump, who was a celebrity candidate with no qualifications, seems drawn to Dr. Oz because he fits the same profile.",
    "John Fetterman leads Rep. Conor Lamb, but on average, roughly 40% or of Democratic voters who are undecided.",
    "A Trump endorsement has the potential to swing the Pennsylvania Republican primary toward Dr. Oz.",
    "“Does anybody like Dr. Oz?” Trump asked, followed by cheers from the crowd.",
    "A Dr. Oz nomination would virtually hand the Senate seat to Democrats.",
    "As Oz has shown no popularity with the general electorate.",
    "On the Democratic side, Lt. Gov."
  ]
}