{
  "id": 2443,
  "mediaId": 2890,
  "date": "2022-03-28",
  "headline": "What Biden is really saying in his new budget",
  "image": "https://cdn.vox-cdn.com/thumbor/AlBcJs6yMeLFpjhDpEqJ3TidO38=/0x0:5591x2927/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23351041/1388239384.jpg",
  "link": "https://www.vox.com/23000382/joe-biden-budget-police",
  "mediaOutlet": "Vox",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Li Zhou",
  "authorUrl": "https://www.vox.com/authors/li-zhou",
  "termIds": [
    2071,
    2745,
    3975,
    304,
    305,
    878,
    1124
  ],
  "sentences": [
    "“The way the budget is being introduced to the public … is confirmation that the White House agrees that both inflation and crime are issues where they are vulnerable, and they want to be able to point to things they are trying to do about those problems,” says Kyle Kondik, managing editor of Sabato’s Crystal Ball.",
    "The budget, which lays out how much spending Biden is requesting for different federal agencies, is effectively a messaging tool for Democrats to showcase where they stand on key issues ahead of what’s expected to be a challenging midterm election cycle.",
    "Additionally, he backs a new tax minimum on billionaires and stresses that investments in programs like child care will help bring down costs that Americans face, hinting at the hope that Democrats can resurrect parts of the Build Back Better Act.",
    "Much of the budget’s focus on deficit reduction appears aimed at Sen. Joe Manchin (D-WV), a longstanding holdout on Build Back Better who has previously cited concerns about the debt and inflation as a major reason for opposing the legislation.",
    "What’s in the budget\nThe $5.8 trillion plan, which includes $1.6 trillion in discretionary spending, contains significant new tax proposals as well as increases in military funding as Russia’s invasion of Ukraine continues.",
    "In the last year, Republicans have sought to paint Democrats as responsible for an uptick in violent crime in certain cities as well as a surge in inflation, which has only been exacerbated by Russia’s war in Ukraine.",
    "The new tax on billionaires and the tax increase on corporations are among the policies that are seen as helping pay down the deficit in the next decade and cover the costs of any Build Back Better programs.",
    "Its requests are ultimately an increase over the discretionary spending Congress approved for 2022, and feature about $813 billion for defense-related programs and $769 billion for domestic social programs.",
    "In the past, lawmakers in swing states have argued that voters’ affiliation of Democrats with the statement “defund the police” hurt them with moderate voters — though research on this isn’t conclusive.",
    "Republicans have already begun to criticize the budget, which they argue doesn’t do enough to bolster national security spending — a sign that the final spending bills will likely be quite different.",
    "A boost to law enforcement spending: There’s $32 billion in the budget to increase state and local police staffing for programs like community policing, violence interventions, and gun trafficking.",
    "A fund for parts of Build Back Better: There are no specific line items for programs from Build Back Better, but the budget does include a “deficit-neutral fund” as a stand-in for these proposals.",
    "As Vox’s Andrew Prokop has previously noted, it’s unclear how much these proposals will help in the near term because it will take time for them to be implemented and for their effects to be felt.",
    "The budget also references Biden’s support for legislation that reduces costs of prescription drugs, child care, and health care premiums, but notes that discussions about specifics are ongoing.",
    "Here are some of its key provisions:\nNew minimum income tax for billionaires: The budget sets up a notable new 20 percent minimum income tax for households that are worth more than $100 million.",
    "“President Biden’s FY23 budget has proven to be, once again, wholly inadequate,” Rep. Mike Rogers (R-AL), the top Republican on the House Armed Services Committee, said in a Monday statement.",
    "Anna Moneymaker/Getty Images\nPresident Joe Biden released his yearly budget on Monday, and it focuses on two subjects voters have been especially concerned about: crime and inflation.",
    "The budget reveals how Democrats aim to address key issues\nBiden’s budget is a preview of how Democrats will try to combat some of Republicans’ most common lines of attack this fall.",
    "The White House’s attempts to highlight how they are trying to address crime and inflation, though, speak to Democrats’ acknowledgment that both issues could be weaknesses for them.",
    "Major sections of the $5.8 trillion plan are aimed at countering attacks Republicans have levied that frame Democrats as “soft on crime” and responsible for soaring household costs.",
    "“Joe Biden and Democrats’ soft-on-crime policies have emboldened criminals in Democrat-run cities across the country,” RNC Chair Ronna Romney McDaniel said in a February statement.",
    "Vox aims to provide clear, concise information that helps people understand the the issues and policy that affects their lives — and it’s never been more vital than today.",
    "Major increase in defense spending: Biden is requesting $813 billion for defense, $31 billion more than what Congress has approved for 2022, and a 4 percent bump overall.",
    "Biden’s proposal, therefore, serves as much as a roadmap for lawmakers as it does a way for Democrats to broadcast their stances on topics like policing and the economy.",
    "The budget is a chance for Democrats to “inoculate against some of these narratives,” says Celinda Lake, a pollster for the DNC and former pollster for Biden’s campaign.",
    "It echoes comments he made during the State of the Union address in early March, when Biden said he’s focused on adding — and not taking away — funding for the police.",
    "It’s intended to cover the costs of additional aid to Ukraine, investments in the US’s military technology, and efforts to address threats from North Korea and Iran.",
    "New corporate tax rate: The corporate tax rate would be increased to 28 percent, from the current 21 percent level that was set by Republican tax cuts in 2017.",
    "“Because discussions with the Congress continue, the President’s Budget includes a deficit-neutral reserve fund to account for future legislation,” it reads.",
    "This budget is just an opening bid; Congress will take these recommendations and craft its own legislation, which it needs to pass by the end of September.",
    "Biden’s budget aims to emphasize that Democrats still back funding for police and see law enforcement spending as part of the solution to address crime.",
    "The budget also notes that Democrats are focused on reducing inflation, which is a central issue for voters that Republicans have been hitting as well.",
    "This provision, however, is likely to face pushback from Republicans who’ve been reluctant to increase taxes on wealthy individuals.",
    "All told, the White House estimates that its proposed changes to the tax code could reduce the deficit by $1 trillion over 10 years.",
    "It also reiterates backing for programs that would curb the amount that families would pay for services like child care and energy.",
    "“Biden’s reckless spending caused inflation,” Republican Pennsylvania Senate candidate Mehmet Oz said in a recent campaign ad.",
    "In it, Biden calls for major spending for defense and law enforcement, including about $32 billion in new spending for police.",
    "The proposal points specifically to investments in the supply chain as efforts that will help reduce the costs of products.",
    "This new proposal could help raise as much as $360 billion over 10 years, half of which would come from billionaires.",
    "(Biden said Monday that the proposals in the budget were not due to political pressure.)",
    "If not, please consider making a contribution today from as little as $3.",
    "Fund them with resources and training,” Biden said in his March speech.",
    "If you have already made a financial contribution to Vox, thank you.",
    "Similarly, this proposal has seen Republican opposition in the past.",
    "Support from our readers helps us keep our work free for everyone.",
    "An informed electorate is essential to a functioning democracy.",
    "“We should all agree: The answer is not to defund the police.",
    "But our distinctive explanatory journalism is expensive.",
    "It’s to fund the police.",
    "Fund them.",
    "Fund them."
  ]
}