{
  "id": 2453,
  "mediaId": 2747,
  "date": "2022-03-25",
  "headline": "Some federal employees can run for political office under the Hatch Act",
  "image": "https://media.wfaa.com/assets/VERIFY/images/bad6e0e6-d75d-4986-8740-8d5beed3c063/bad6e0e6-d75d-4986-8740-8d5beed3c063_1140x641.jpg",
  "link": "https://www.wfaa.com/article/news/verify/government-verify/how-hatch-act-applies-federal-employees-dr-oz-herschel-walker/536-89e3ef53-db47-4cdd-855c-fef1022c1c32",
  "mediaOutlet": "WFAA ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1684,
    2023,
    2201,
    2232,
    2412,
    2897,
    3975
  ],
  "sentences": [
    "“The law’s purposes are to ensure that federal programs are administered in a nonpartisan fashion, to protect federal employees from political coercion in the workplace, and to ensure that federal employees are advanced based on merit and not based on political affiliation,” the U.S. Office of Special Counsel (OSC), the federal agency tasked with enforcing the Hatch Act, explains on its website.",
    "“While an SGE is generally not subject to the Hatch Act while off duty, a Commission member may not use their official title when engaging in off-duty political activity by, for example, including their Commission title in the signature block of a political fundraising letter.",
    "“President Biden is so scared about us beating Raphael Warnock that he has asked me to resign from my unpaid position on the President’s Council on Sports, Fitness, and Nutrition,” Walker tweeted on Thursday in reference to his opponent in the Georgia Senate race.",
    "Former President Donald Trump appointed Oz and Herschel as council members, who advise the president on the council’s goals of expanding and encouraging youth sports participation, and promoting the overall physical fitness, health and nutrition of Americans.",
    "Comedian Steve Hofstetter claimed in a viral tweet that Oz “violated the Hatch Act by running for Pennsylvania senate while employed by the government.”\nIs it a violation of the Hatch Act to run for political office while working for the federal government?",
    "The provisions of the Hatch Act apply in one way or another to “all federal employees, other than the President and Vice President, in the executive branch of the federal government,” according to a 2014 report from the Congressional Research Service (CRS).",
    "“I'm not a quitter so you are going to have to fire me.”\nIn a video shared on Twitter, Oz also addressed a letter from the Biden administration asking that he resign from his position by close of business or he would be terminated.",
    "However, special government employees (SGEs), such as those who are part of a commission, may run for partisan political office, according to a 2019 advisory opinion issued by OSC Hatch Act Unit Chief Ana Galindo Marron.",
    "According to the U.S. Department of Health and Human Services, members of the President’s Council on Sports, Fitness and Nutrition are considered special government employees and are not paid for their work.",
    "The Hatch Act is a federal law passed in 1939 that limits certain political activities of federal employees, along with some state and local government workers connected to federally funded programs.",
    "President Joe Biden asked former NFL running back Herschel Walker and TV personality Mehmet Oz, M.D., to step down from their positions on the President’s Council on Sports, Fitness, and Nutrition.",
    "Further restricted employees are those who work in intelligence and enforcement agencies, such as the FBI, and are prohibited from engaging in partisan political management or campaigns.",
    "Less restricted employees can engage in other political activities, including contributing money to campaigns or parties and attending political fundraising functions, among others.",
    "Federal employees who need to comply with the Hatch Act are classified into two groups: “less restricted” and “further restricted.” Most federal employees are in the first group.",
    "While it isn’t a violation of the Hatch Act for Oz and Herschel to run for Senate, they could have violated the act if they performed campaign work while they were on duty.",
    "But a White House spokesperson told VERIFY the Biden administration does not allow candidates running for federal office to serve on presidential boards.",
    "Both less and further restricted employees are not allowed to be candidates for partisan political office, according to the OSC and the CRS report.",
    "While most federal employees cannot run for partisan political office under the Hatch Act, some special government employees can do so.",
    "A viral tweet claimed Dr. Oz couldn’t run for political office while serving on a presidential council, but that’s not always the case.",
    "The two Republicans are running for U.S. Senate and were originally appointed to their positions by former President Donald Trump.",
    "Doing so gives the appearance that the member is acting in an official capacity and, therefore, on duty.",
    "They can also run for office in nonpartisan elections, which are those not tied to a political party.",
    "But they cannot participate in campaign-related activity while performing official government work.",
    "We consider such activity to be prohibited by the Hatch Act,” the 2019 advisory opinion says.",
    "Oz and Walker claim they were pushed out because they disagree with Biden’s policies.",
    "This claim needs context."
  ]
}