{
  "id": 247,
  "mediaId": 2699,
  "date": "2022-04-17",
  "headline": "John Oliver Reveals How He’s Been Trolling Dr. Oz for Years",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1369,w_2440,x_58,y_77/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1650252821/Screen_Shot_2022-04-17_at_11.31.18_PM_p2fz6a",
  "link": "https://www.thedailybeast.com/john-oliver-reveals-how-hes-been-trolling-dr-oz-for-years?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marlow Stern",
  "authorUrl": "https://www.thedailybeast.com/author/marlow-stern",
  "termIds": [
    2201,
    2232,
    3582,
    3975,
    4440,
    1171,
    5239
  ],
  "sentences": [
    "“But maybe he’s only posting those videos to push slightly less relatable content further down his page like, I don’t know, this one.”\nHe then threw to a video Dr. Oz posted of himself wakeboarding in Italy accompanied by the caption “Surfin’ through #Italy like” and set to the tune of “Oooh Ahh (My Life Be Like)” by Grits.",
    "I’ve been on TV in this country for 16 years now and I still get YouTube comments like, ‘I hope he stops soon,’ ‘why is less funny mr. bean so mad?’”\nOliver proceeded to describe Dr. Oz’s Senate campaign as “a shitshow,” including the revelation that Dr. Oz has apparently not spent much time at all living in Pennsylvania.",
    "On Sunday evening’s edition of Last Week Tonight, John Oliver kicked off the show by addressing former President Donald Trump’s recent endorsement of snake-oil salesman Dr. Mehmet Oz, who aggressively pushed hydroxychloroquine as a COVID-19 treatment during the pandemic, in the Pennsylvania Senate race.",
    "He had to abandon his show to go run for Senate, and if any of his staff are coming back to our office in the coming weeks to clear their stuff out, we’ve actually left a new special message for them on our alligator: ‘I’m sorry, he seems like a fucking nightmare.’ Because he really does.”",
    "“For years, he’s lived in New Jersey, and his social media still frequently shows him at his North Jersey mansion, so he is running for office in a state that he doesn’t seem to want to live in—a savvy political move known as the ‘Eric Adams Special,’” offered Oliver.",
    "The late-night host then revealed that Dr. Oz’s show shot in the same studio as his and that Dr. Oz’s offices were right across from Last Week Tonight’s, leading Oliver’s staff to position a giant alligator giving the middle finger at Dr. Oz’s office.",
    "“What he doesn’t get to do, though, is stand in front of gas pumps and pretend he’s personally affected by those numbers.”\nHe continued: “I talked a lot of shit about The Dr. Oz Show and I did because it was unremittingly terrible.",
    "“Look, gas prices are a real concern, but Dr. Oz is worth over $100 million, so it’s a little weird for him to act like it’s specifically straining his budget,” said Oliver.",
    "One of Dr. Oz’s biggest campaign kinks is making TikTok videos of himself filling up his car with gas and then blaming Biden and the Democrats for the high prices.",
    "The first growl in that clip was like hearing the sound of a cranking lawn mower you know is about to sexually harass you,” cracked Oliver.",
    "“And the truth is, that is what his life be like because he’s fucking rich, which means he gets to do stuff like that,” Oliver explained.",
    "But what is now clear is that I didn’t appreciate just how hard his staff had to work every day to make sure it wasn’t even worse.",
    "“Now, as for his claim there that being on TV for a long time is like a poll showing that people like you, that is just not true.",
    "I hadn’t heard that voice in a while and, to be honest, I really haven’t missed it.",
    "“You know, when you’re in television for 18 years, that’s like a poll.",
    "But he’s a great guy,” Trump said of Oz.",
    "That means people like you.",
    "Believe me.",
    "“Wow."
  ]
}