{
  "id": 2495,
  "mediaId": 2540,
  "date": "2022-03-23",
  "headline": "Where Donald Trump went wrong with his 2022 endorsements",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/211124104730-01-trump-mo-brooks-0921-super-tease.jpg",
  "link": "https://www.cnn.com/2022/03/23/politics/trump-gop-endorsements-struggles/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Wollner",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Brooks said he had “repeatedly advised” Trump “that January 6 was the final election contest verdict.”)\nLeft unsaid in Trump’s statement is that he wanted to save face after it became increasingly clear he had backed the wrong horse way back in April of last year.",
    "After hinting at it for days, Trump on Wednesday officially rescinded his endorsement of Rep. Mo Brooks, a staunch ally of the former President who was struggling to find his footing in the crowded Alabama US Senate Republican primary.",
    "(Brooks added another layer to the controversy with his own statement, saying Trump pressured him to overturn the 2020 election results and hold a new special election even after Congress had affirmed the results on January 6, 2021.",
    "In a statement, Trump said he was pulling his support from Brooks after the congressman made several comments about wanting to move past the 2020 election, which the former President has continued to falsely claim was rigged.",
    "And in Alaska, Kelly Tshibaka hasn’t caught fire after winning the former President’s endorsement last June, as she challenges Republican Sen. Lisa Murkowski, who voted to convict Trump in his second impeachment trial.",
    "In all of these instances, Trump chose to (quickly) get behind the Republican who he perceived would be his strongest ally – not necessarily who would be the strongest candidate.",
    "Trump also, in surprising fashion, endorsed Rep. Ted Budd for a North Carolina US Senate seat in June of last year, rather than waiting to see how the crowded race sorted out.",
    "Two candidates who have raised more money to date than Brooks, Katie Britt and Mike Durant, were still months away from entering the GOP primary.",
    "Mehmet Oz entered the race roughly a week later, while another current leading contender, David McCormick, announced his candidacy in January.",
    "Instead, these candidates’ struggles will only further fuel questions over just how powerful the former President’s grip on the party remains.",
    "He’s already issued well over 100 endorsements of Republicans running for office in 2022, according to a tally from Ballotpedia.",
    "Pat McCrory and former Rep. Mark Walker – who even declined an offer from Trump to switch to a House race with his endorsement.",
    "Not even three months later, Parnell suspended his campaign after a judge awarded his estranged wife custody of their children.",
    "CNN —\nFrom the outset of this election cycle, Donald Trump decided he wanted to get involved early and often.",
    "But in a few high-profile races, that eagerness to exert his influence over the GOP has backfired.",
    "At that point, the race to replace retiring Alabama Sen. Richard Shelby was still taking shape.",
    "The Point: Trump hoped to use these early endorsements to make his control over the GOP clear.",
    "Last September, he endorsed Army veteran Sean Parnell in the Pennsylvania US Senate race.",
    "Budd wasn’t able to clear the field, leaving him in a three-way contest with former Gov.",
    "It’s not the only instance where a bit more patience may have served Trump well.",
    "He wants to keep his (embellished) endorsement record as sterling as possible.",
    "That means loyalty is a one-way street, as Brooks learned Wednesday.",
    "Ultimately for Trump, it all comes down to one thing: winning."
  ]
}