{
  "id": 2546,
  "mediaId": 2776,
  "date": "2022-03-23",
  "headline": "Dr. Oz Claps Back After Joe Biden Fires Him From President’s Sports Council: Watch",
  "image": "https://hollywoodlife.com/wp-content/uploads/2022/03/doctor-oz-joe-biden-ss-ftr1.jpg",
  "link": "https://hollywoodlife.com/2022/03/23/dr-oz-joe-biden-resign-president-sports-council-video/",
  "mediaOutlet": "hollywoodlife.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cynthia Cook",
  "authorUrl": "https://hollywoodlife.com/author/cynthia-cook/",
  "termIds": [
    2201,
    2232,
    2576,
    3448,
    3975,
    962,
    1094
  ],
  "sentences": [
    "I am proud of my service and will not resign.”\nThe doctor, who is currently running for a senate seat in Pennsylvania, stated he was “proud” of his service to the White House and stated that he “will not resign.”\nPresident Trump appointed me to two terms on the President’s Council on Sports, Fitness & Nutrition.",
    "The White House via President Joe Biden just sent Dr. Mehemet Oz a letter to demand his resignation from the President’s Council on Sports, Fitness, and Nutrition, informing the 61-year-old if he did not resign by 6pm, he would be terminated.",
    "“I would think record high energy prices — a 40-year high with inflation — and the tragedy with Ukraine would be a more important priority.”\nThe council serves as an advisory committee to promote healthy eating habits and physical activity.",
    "I’m also grateful to my colleagues on the committee and the amazing accomplishments we were able to achieve.”\nI received this letter on behalf of @POTUS requesting I resign from the President's Council on Sports, Fitness & Nutrition.",
    "The doctor he should ask to resign is Dr. Anthony Fauci for a multitude of obvious reasons.”\nHe continued, “With that said, I am beyond grateful to President Trump for appointing me to this very prestigious and important position.",
    "pic.twitter.com/fJaVLKVWOC\n— Dr. Mehmet Oz (@DrOz) March 24, 2022\nThe TV host then denounced Biden for being “petty” and “political” in his action, and assured he had “no intention” of resigning.",
    "“I just received the letter on your screen on behalf of [President Biden] requesting that I resign from the President’s Council on Sports, Fitness & Nutrition,” the doctor began his statement.",
    "“Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "“If President Biden wants to politicize health, he’ll have to fire me and let Americans see how truly petty and political he truly is” he went on.",
    "The White House just emailed me demanding my resignation by the end of the day.,” he began in a Twitter thread on Wednesday, March 23.",
    "Dr. Oz served on the board along with New England Patriots coach Bill Belichick and former NFL running back Herschel Walker.",
    "— Dr. Mehmet Oz (@DrOz) March 23, 2022\nThe doctor also posted a video to his Twitter explaining the situation.",
    "It’s not exactly clear why the White House asked Oz to step down or if anyone else received a similar letter.",
    "“President Trump appointed me to two terms on the President’s Council on Sports, Fitness & Nutrition.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.",
    "“It’s beyond sad Joe Biden would politicize such an important issue like health.",
    "The White House just emailed me demanding my resignation by the end of the day.",
    "It’s sad that he would politicize such an important issue like health.",
    "In fact, let me offer a suggestion.",
    "After receiving the letter, Dr. Oz.",
    "clapped back."
  ]
}