{
  "id": 2558,
  "mediaId": 2574,
  "date": "2022-03-23",
  "headline": "Dr. Oz Criticized Trump’s China Trade Policy in Interview With CCP Media",
  "image": "https://freebeacon.com/wp-content/uploads/2022/03/dr-oz-honored-star-hollywood-walk-fame-e1646346582521.jpg",
  "link": "https://freebeacon.com/elections/dr-oz-criticized-trumps-china-trade-policy-in-interview-with-ccp-media/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chuck Ross",
  "authorUrl": "https://freebeacon.com/author/chuck-ross/",
  "termIds": [
    2201,
    2232,
    3975,
    213,
    4852,
    5240
  ],
  "sentences": [
    "Oz spoke at a medical summit alongside Usana executives, where he said that Chinese president Xi Jinping's support for traditional Chinese medicine had \"opened a portal\" for Usana to sell its wellness products in the country.",
    "Oz, who is running for Senate in Pennsylvania, told Chinese state media network CGTN in July 2018 that he opposed trade wars with China and supported closer collaboration in the field of medical research.",
    "Oz gave the interview to CGTN, which operates under the Chinese Communist Party's propaganda department, as part of a promotional tour for a supplement company with extensive business ties to China.",
    "Oz went on to call for closer collaboration between the United States and China in the field of health care, saying it was \"one of the ways we can bridge our relationship.\"",
    "Oz said in the early days of the pandemic that the United States should \"copy\" China's aggressive crackdown on its citizens in order to slow the spread of the virus.",
    "In September 2021, Usana published a book from Oz and Anlong Xu, a professor at Beijing University of Chinese Medicine, to promote Chinese traditional medicine.",
    "The CGTN host has been a vocal critic of China hawks in the U.S. government, and once compared Trump to an infant in a post on social media.",
    "Oz's comments could put him at odds with President Donald Trump, who is yet to endorse a candidate in the Republican primary.",
    "He has also accused the Chinese government of manipulating its currency and stealing American intellectual property.",
    "In the interview, Oz agreed with CGTN host Tian Wei that the United States should not be in a trade war with China.",
    "He visited China in 2018 to promote Usana, a multi-level marketing company that sells health and wellness products.",
    "Dr. Mehmet Oz criticized Trump-era trade policies toward Beijing in an interview on Chinese state TV.",
    "Oz has made millions of dollars in China from his television show and his health sponsorship deals.",
    "Oz's remarks appear to contradict his recent comments on U.S. policy toward China.",
    "Oz has faced scrutiny for praising China's response to the coronavirus pandemic.",
    "Trump imposed tariffs against China in 2018 over its unfair trade practices.",
    "\"I don't think trade wars are worth it,\" Oz said in agreement with Wei.",
    "He urged President Joe Biden this week to \"get tougher\" on Beijing.",
    "\"Take their blueprint and repeat it here in this country,\" Oz said."
  ]
}