{
  "id": 2590,
  "mediaId": 2701,
  "date": "2022-03-29",
  "headline": "5 Pennsylvania GOP Senate Candidates Refuse Philadelphia Inquirer’s Grossly Biased Survey, Torch Paper As A ‘Biased’ ‘Rag’",
  "image": "https://thefederalist.com/wp-content/uploads/2022/03/1186369723_fda8df5338_k-e1648511786697.jpg",
  "link": "https://thefederalist.com/2022/03/29/5-pennsylvania-gop-senate-candidates-refuse-philadelphia-inquirers-grossly-biased-survey-torch-paper-as-a-biased-rag/?utm_source=rss&utm_medium=rss&utm_campaign=5-pennsylvania-gop-senate-candidates-refuse-philadelphia-inquirers-grossly-biased-survey-torch-paper-as-a-biased-rag",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tristan Justice",
  "authorUrl": "https://thefederalist.com/author/tristanjustice/",
  "termIds": [
    2415,
    3975,
    878,
    883,
    1056,
    1171,
    5239,
    5243
  ],
  "sentences": [
    "After filling out the Inquirer’s first seven open-ended questions, Bochetto wrote in a statement to the paper shared with The Federalist he would refuse “to be trapped by ideologically worded questions to which I am denied the ability to fully respond.”\n“As one of the leading information platforms in Pennsylvania,” Bochetto wrote, “I very much hope you will reconsider the policy of denying candidates for the United States Senate the opportunity to be considered for endorsement if they are unwilling to submit to the gamesmanship being played with these multiple-choice questions.”\nOther candidates outright refused to submit answers to the Pennsylvania paper’s questionnaire at all.",
    "Barnette complained the paper was engaged in a double-standard seeking to smear Republicans as enemies of the state after Democrats chanted for years during Trump’s time in office the commander-in-chief was “not my president.”\n“I don’t remember the liberal media using that once as a litmus test to marginalize people, to label people ‘insurrectionist’ during Trump’s term in office when it was very prominent people saying ‘not my president’ in regards to President Trump,” Barnette said.",
    "The survey’s second multiple-choice question asked, “Was the riot inside the U.S. Capitol on January 6 ‘legitimate political discourse,'” with candidates presented options to answer “yes” or no.” The question follows the media twisting the Republican National Committee’s censure of two GOP representatives on the Democrats’ Jan. 6 Committee to extend its reference of protestors engaged in “legitimate political discourse” to those who launched an assault on the Capitol building.",
    "“Ambassador Carla Sands will not be participating in this biased process, nor does she have any desire whatsoever, to receive the endorsement of a left-leaning, slowly-dying newspaper deeply out of touch with the people of Pennsylvania.”\nAnother primary contender, attorney Sean Gale, labeled the Inquirer “a left-wing, liberal rag.”\n“I don’t want their endorsement and I didn’t even look at their undoubtedly biased questionnaire before I trashed it,” Gale told The Federalist.",
    "A spokesman for another candidate, former President Donald Trump’s ambassador to Denmark, Carla Sands, told The Federalist the Philadelphia Inquirer’s Senate Endorsement Questionnaire “is both predictable and laughable at the same time.”\n“The Inquirer’s loaded questions are a biased attempt to harm Republican candidates at the behest of its left-wing owners and editors,” the campaign wrote to The Federalist.",
    "The first in a 25-question multiple-choice section asks candidates, “Who won the 2020 presidential election,” with either “Joe Biden” or “Donald Trump” presented as the only two answers and no room to discuss the complexities of the contest with record-level turnout in the form of mail-in voting monopolized by left-wing private actors.",
    "“Now all of a sudden [it] is the first question in their multiple choice.”\nNo representatives for daytime television star Dr. Mehmet Oz or Montgomery County real estate developer Jeff Bartos, who are also candidates in the race, responded to The Federalist’s inquiries.",
    "At least five of Pennsylvania’s seven Republicans seeking the GOP Senate nomination refused to submit answers to the Philadelphia Inquirer’s multiple-choice questionnaire sent to candidates ahead of the paper’s formal endorsement process with a Monday deadline.",
    "The survey, obtained by The Federalist from Philadelphia Attorney George Bochetto’s campaign, asked candidates questions designed to smear them either as conspiracy theorists or Republican heretics by offering binary choices on complicated topics.",
    "Kathy Barnette, a veteran, author, and conservative political commentator running in the GOP primary, also told The Federalist she rejected the Inquirer’s survey over its “politically driven” questions.",
    "“We did not submit a response,” wrote the press team for David McCormick, a former hedge fund manager who the latest polls show is leading the race, in an email to The Federalist.",
    "Tristan graduated from George Washington University where he majored in political science and minored in journalism.",
    "At least five of Pennsylvania’s seven major Republicans seeking the GOP Senate nomination refused to submit answers.",
    "Follow him on Twitter at @JusticeTristan or contact him at Tristan@thefederalist.com.",
    "The Philadelphia Inquirer also did not respond to a request for comment.",
    "He has also written for The Washington Examiner and The Daily Signal.",
    "His work has also been featured in Real Clear Politics and Fox News.",
    "Tristan Justice is the western correspondent for The Federalist."
  ]
}