{
  "id": 2619,
  "mediaId": 6570,
  "date": "2022-03-30",
  "headline": "Republican frontrunners in Pa.'s U.S. Senate race trade barbs at Erie forum",
  "image": "https://9b16f79ca967fd0708d1-2713572fef44aa49ec323e813b06d2d9.ssl.cf2.rackcdn.com/1140x_a10-7_cTC/Transgender-Political-Pawns-2-1648641696.jpg",
  "link": "https://www.post-gazette.com/news/politics-nation/2022/03/30/david-mccormick-dr-oz-pa-us-senate-republican-primary-race-2022-erie-forum-jeff-bartos-kathy-barnette/stories/202203300119",
  "mediaOutlet": "Pittsburgh Post-Gazette ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2232,
    2431,
    3305,
    4762,
    878,
    4966,
    4967
  ],
  "sentences": [
    "The candidates mostly agreed on policy questions, such as their unanimous support for Pennsylvania to “unleash” its energy potential, the many ways they see Democrats are setting the country up for failure, the role of the federal government in addressing record-high inflation, removing regulatory barriers to help bring down the state’s unemployment rate, and their commitment to civility and working across the aisle.",
    "“Have we learned nothing over these last two years with Democrats putting their foot on our throats?”\nMr. Bartos, in his closing remarks, explained that the frustration and passion from Ms. Barnette and himself come from years of campaigning being overridden by “political tourists” like Mr. Oz and Mr. McCormick, who came into the race from outside Pennsylvania and have spent tens of millions of dollars on TV ads.",
    "The four Republican candidates vying to replace Sen. Pat Toomey as Pennsylvania’s junior senator who appeared Wednesday are: Mr. Oz, a heart surgeon and former daytime TV host; Mr. McCormick, the former CEO of the world’s largest hedge fund; Mr. Bartos, a businessman and former lieutenant governor candidate; and Ms. Barnette, a political commentator and former congressional candidate.",
    "Ms. Barnette stressed the urgency of this election and her resolve as the race’s only “true conservative.”\n“We may have some Republicans; we may have some who have their entire public career they’ve pretended to be a liberal working beside Oprah and Michelle Obama,” Ms. Barnette said, alluding to Mr. Oz.",
    "Mr. Oz is a longtime New Jersey resident who is now living and renting his in-laws’ home in the Philadelphia suburbs, while Mr. McCormick lived in Connecticut for the last 12 years — though he grew up in Bloomsburg and recently bought a home in Pittsburgh’s East End.",
    "The two Republican frontrunners in the U.S. Senate race in Pennsylvania — Mehmet Oz and David McCormick — appeared on stage for the first time Wednesday morning alongside two of their opponents, trading jabs and name-dropping in the at-times heated forum.",
    "Friend attempted to enforce an agreed-upon rule that candidates would not attack or interrupt one another, asking them to save those attacks for the 7 p.m. hour, when attack ads between Mr. McCormick and Mr. Oz are likely to air.",
    "By the second question, Mr. McCormick was the first to attempt to attack Mr. Oz, accusing him of arguing in the past for more regulations and a moratorium on gas production in the state.",
    "Mr. Oz then tried to interrupt and defend himself, noting that “we all have friends.”\nMs. Barnette continued her attacks on the race’s millionaire frontrunners, Mr. Oz and Mr. McCormick.",
    "Friend said as part of his closing remarks following the lively discussion on different policy proposals and who would represent Pennsylvania the best in Washington.",
    "Mr. Bartos and Ms. Barnette have participated in several previous forums, with Mr. Bartos constantly criticizing the frontrunners for posing as Pennsylvanians.",
    "The hourlong forum was hosted by the Manufacturer & Business Association and moderated by its assistant vice president for external relations, Jezree Friend.",
    "But the most popular response in the poll was that 31% of registered GOP voters said they were still undecided on which candidate they’ll support in May.",
    "In a Fox News poll of registered Republican voters from earlier this month, Mr. McCormick led the pack with 24%, with Mr. Oz trailing him at 15%.",
    "From a banquet room in Erie, the four GOP candidates were perched on a stage and sat in leather armchairs and a backdrop resembling a boardroom.",
    "“I would not have to go scorched-earth if they would show up for a debate,” Ms. Barnette added, as she and Mr. Oz yelled over each other.",
    "Mr. Oz and Mr. McCormick sat farthest away from one another, with fellow candidates Jeff Bartos and Kathy Barnette sat in the middle.",
    "“You keep running those ads.”\nMr. Oz attempted to use his position as a common target to show his legitimacy as a candidate.",
    "“You should all ask yourselves, ‘Why is everyone attacking me?’” Mr. Oz asked rhetorically during his closing remarks.",
    "“How has that served us, picking the richest person just because they’re the richest person?” Ms. Barnette asked.",
    "He was mostly successful in doing so, except for a few outbursts between Mr. McCormick, Mr. Oz and Ms. Barnette.",
    "“For me, this campaign has always been about a deep love and commitment to our commonwealth,” Mr. Bartos added.",
    "“We got these strong-willed personalities, and maybe large egos, together in one room for a good cause,” Mr.",
    "Mr. Bartos and Ms. Barnette each had 9% support, and former U.S. ambassador Carla Sands had 6%.",
    "Gillian McGoldrick, gmcgoldrick@post-gazette.com or on Twitter @gill_mcgoldrick.",
    "“Because you’re a liberal,” Ms. Barnette chimed in with a smile.",
    "This story was updated at 12:24 p.m. on Wednesday, March 30.",
    "“That’s a lie, and you know that’s a lie,” Mr. Oz cut in.",
    "First Published March 30, 2022, 5:01am",
    "Mr."
  ]
}