{
  "id": 2672,
  "mediaId": 3993,
  "date": "2022-03-30",
  "headline": "Dr. Oz's claims he didn't write anti-gun columns falls apart",
  "image": "https://media.townhall.com/townhall/reu/o/2009/249/86e7f633-c1ef-480c-a4d4-dfe4e7787b5a@news.ap.org-1110x740.jpg",
  "link": "https://bearingarms.com/tomknighton/2022/03/30/dr-ozs-falls-apart-n56923",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Knighton",
  "authorUrl": "https://bearingarms.com/author/tomknighton",
  "termIds": [
    0
  ],
  "sentences": [
    "Perhaps most significantly, in 2018, Oz tweeted calling for a CDC study on “gun violence in this country” and said he thinks it is “time we view shootings as a public health problem.” The tweet remains public on his Twitter profile, from which he is now campaigning as a U.S. Senate candidate claiming to be a Republican–but from which just a couple of years ago he was pushing full-blown gun control:\nRight now, the @CDCgov is NOT funded to study gun violence in this country.",
    "#EndTheBan https://t.co/iFDGMG7fI5 pic.twitter.com/lZdMXW5zLC\n— Dr. Mehmet Oz (@DrOz) March 14, 2018\nThis latest claim about his columns seems to have been invented by his U.S. Senate campaign when he needed an excuse to get out of the political liability of having written these intensely unpopular views—but when it was convenient to his public image as a celebrity doctor friendly with the American political left, Oz celebrated his column.",
    "In fact, the Bearing Arms editor wrote:\nSo Oz had nothing to do with the columns, but apparently never saw fit to issue any corrections letting readers know that he completely disagreed with the calls for gun bans and other restrictions on the right to keep and bear arms promoted under his name.",
    "But here is the problem for Oz—he cannot blame just the co-author of the column for the radical views he espoused on the Second Amendment in favor of gun control, because there are many other instances where Oz himself pushed gun control outside of the column.",
    "For instance, in a Thanksgiving piece for Time Magazine in 2013, Oz wrote that he constantly runs into people who thank him for writing his column—many of them by this point pushed these gun control ideas—and he said he was proud to put his name on them.",
    "Either that or he thinks name recognition will launch him into office and that the Pennsylvania rednecks are too stupid to look at his history and recognize that he’ll screw them over the first chance he gets.",
    "A 2008 piece by the Telegraph-Journal interviewed Oz about the process for writing the column with Roizen, and says the two had a conference call every Sunday to discuss the content of the columns.",
    "“My wife keeps thinking we’re not actually working.”\nSo yeah, it’s just not possible to buy Dr. Oz’s claims that he was somehow ignorant of the columns in question in light of this information.",
    "Yeah, that sounds totally believable.. as long as you’re the type of person who’ll hand over your life savings to that nice Nigerian prince who emailed you promising a huge return on your loan.",
    "As a result, if Pennsylvania puts him in the Senate, you might as well chalk it up as another vote with the Democrats on any piece of gun control legislation that comes their way.",
    "What that suggests to me is that despite his previous attempts at voicing support for the Second Amendment, he’ll back anti-gun legislation the first chance he gets.",
    "“I get stopped by people who mention they learned something on my show or read my newspaper column and benefitted from it,” Oz wrote of his columns with Roizen.",
    "If so, why isn’t he running as a Democrat when so many of the things he’s previously talked about line up perfectly with their party?",
    "Look, Oz could have dealt with this by simply saying he changed his opinions in light of new information he’d been made aware of.",
    "Still, there will be those who are willing to give the good doctor the benefit of the doubt because he’s running as a Republican.",
    "Look, Dr. Oz may or may not have known what was in those columns, but that doesn’t give him a pass for them having run.",
    "Dr. Mehmet Oz claims that anti-gun columns that appeared with his name were written by a co-writer without his input.",
    "Hawkins also notes that it’s virtually impossible for Oz to have been unaware of the content of those columns.",
    "However, over at Breitbart, AWR Hawkins finds the argument falls apart in light of additional evidence.",
    "Contact your congressperson today to demand they fund the #CDC to comprehensively study gun violence.",
    "“We laugh so hard on those Sunday calls,” Oz said of his calls with Roizen to discuss column content.",
    "Further, it’s consistent with the tweet he sent from his own account in 2018.",
    "Well, never saw fit to issue any corrections until he was running for office.",
    "Instead, he’s counting on Republican voters to be ignorant of his history.",
    "If he was something Dr. Oz opposed, you’d imagine he’d have said so.",
    "Now, if that’s what they want, so be it, but I don’t think they do.",
    "There’s just not any reason to trust him to do anything else.",
    "It’s time we treat shootings as a public health problem.",
    "He doesn’t think he can win as a Democrat, apparently.",
    "Now, Cam was skeptical of what Dr. Oz claimed.",
    "Cam wrote about that claim recently.",
    "It’s harsh, but I tend to agree.",
    "I agree with Hawkins completely."
  ]
}