{
  "id": 2901,
  "mediaId": 2576,
  "date": "2022-03-17",
  "headline": "'MasterChef Junior' is back after three years and there's a hometown kid chef competing",
  "image": "https://www.gannett-cdn.com/presto/2022/03/16/PDTF/094d692d-db42-4f62-b691-154ea3565cd1-mj-s9_29-andrew-purple_1182_f.jpg?crop=1938,1090,x0,y178&width=1938&height=1090&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/local/michigan/2022/03/17/masterchef-junior-superior-township-boy-competing/7065180001/",
  "mediaOutlet": "freep.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Selasky",
  "authorUrl": "https://www.freep.com/staff/2646334001/susan-selasky/",
  "termIds": [
    0
  ],
  "sentences": [
    "Andrew Lee of Superior Township (near Ann Arbor) will be showcasing his culinary skills as one of 16 junior chefs competing for the \"MasterChef Junior\" trophy and the top $100,000 prize.",
    "Andrew, who loves and plays hockey as a center, says his culinary dream is to \"open a hockey-themed establishment in Michigan, where he will serve all kinds of sweets.\"",
    "Famed and renowned chef Gordon Ramsay is the host of the reality show featuring kids ages 8-13 showing off their culinary talents.",
    "After the challenges, kids present dishes to judges and are either eliminated from the competition or move on to the next round.",
    "Andrew counts starfruit and watermelon as ingredients he likes to use often, along with using a lot of spices in his dishes.",
    "Throughout the season, kids are presented with cooking challenges and compete against each other and sometimes in teams.",
    "Filmed in Los Angeles pre-pandemic, this season is the first time the show will be on since 2019, when season 7 aired.",
    "Contact Detroit Free Press food writer Susan Selasky and send food and restaurant news to: sselasky@freepress.com.",
    "Andrew's signature dish is pan-seared filet mignon with baked potato served with a s'more brownie as a dessert.",
    "While compote is a term that most 13-year-olds wouldn't use, Andrew called it a fancy name for jam or jelly.",
    "With the starfruit, he'll typically use it to make a compote to add to some part of a dish, like a filling.",
    "New to the judging lineup is Daphne Oz, a wellness advocate, cookbook author and daughter of Dr. Mehmet Oz.",
    "He came up with the dish based on what his parents liked while adding the brownie as something he likes.",
    "\"MasterChef Junior\" is returning for season 8 on Thursday and there's a hometown contestant to cheer on.",
    "He wants people and especially kids to know when they watch this season that everybody had a chance.",
    "On season 8 of \"MasterChef Junior,\" Ramsay is joined by acclaimed celebrity chef Aaron Sanchez.",
    "Andrew was 10 years old at the time of the filming and called the whole experience exciting.",
    "He was actually really nice to all of us kids and he was very supportive,\" Andrew says.",
    "Andrew says he made a lot of friends on the show, with whom he still keeps in contact.",
    "\"I learned how to work within a set timeframe, which helps me manage my time better.\"",
    "He began learning to cook when he was 3 to 4 years old by helping his mom, Staycee.",
    "\"People with big names in the food industry that I've always wanted to meet them.",
    "\"I was so stoked because it was one of my favorites things to watch as a child.",
    "\"It was so cool because they were some of my childhood idols,\" Andrew says.",
    "Support local journalism and become a digital subscriber to the Free Press.",
    "\"I just thought it would be fun to help her out and make it easier on her.",
    "Ramsay is also the host of the \"Hell's Kitchen\" and \"MasterChef\" shows.",
    "\"I would always watch my mom cook dinner and breakfast,\" Andrew says.",
    "Being on \"MasterChef\" and working with Ramsay taught Andrew a lot.",
    "Meeting the celebrity chefs, of course, was also a huge highlight.",
    "\"MasterChef Junior\" airs at 8 p.m. Thursday on WJBK-TV (Fox 2).",
    "He can be known for his criticism, often harsh, even with kids.",
    "As I got older, I learned more and more projects on my own.\"",
    "\"I got on this TV show — my childhood favorite.",
    "So, if you have a chance, take it,\" he says.",
    "So, I started out when I was really young.",
    "Follow @SusanMariecooks on Twitter.",
    "Getting to meet them was awesome.\"",
    "\"Working with Gordon was so fun!",
    "It was surreal,\" Andrew says."
  ]
}