{
  "id": 2931,
  "mediaId": 6571,
  "date": "2022-03-16",
  "headline": "Dr. Oz Vows To Renounce Turkish Citizenship If Elected Senator In Pennsylvania",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/02/02/1fc45572-d3fe-40a2-bcce-098f529b7485/thumbnail/1200x630/a5539673f3701436893d89d50c0f6617/GettyImages-1365957834.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/oz-vows-to-renounce-turkish-citizenship-if-elected-senator/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "HARRISBURG, Pa. (AP) — Mehmet Oz, warding off criticism from a key rival in Pennsylvania's heated Republican primary race for U.S. Senate, said Wednesday that he will renounce his dual citizenship in Turkey if he is elected, as the expensive campaign took on a harder and more personal edge.",
    "Oz — the celebrity heart surgeon best known as daytime TV's host of \"The Dr. Oz Show\" — made the statement hours after disputing a media report that claimed he said he planned to forego security clearances in the Senate to maintain his dual citizenship.",
    "On a conference call with reporters organized by McCormick's campaign, Republican Sen. Dan Sullivan of Alaska said senators routinely receive briefings from intelligence agencies involving material that is not shared with America's closest allies.",
    "McCormick's campaign on Wednesday brought out a sitting senator to criticize Oz's purported willingness to waive security clearances in the Senate to keep his dual citizenship, well after Oz had disputed the report.",
    "Still, the scrutiny of Oz's dual citizenship gave the campaign a harder and more personal edge, and Oz accused one primary opponent, former hedge fund CEO David McCormick, of \"bigoted attacks.\"",
    "The only comparable situation they found is Texas Sen. Ted Cruz renouncing his Canadian citizenship in 2014 after learning that he had received it by virtue of being born in Canada.",
    "\"To me it's inconceivable that you would make a decision that would somehow limit your access to this kind of intelligence that you need to do the job,\" Sullivan told reporters.",
    "Until Wednesday, Oz said he'd keep his dual citizenship so he has legal power in Turkey to make health care decisions for his Alzheimer's-stricken mother.",
    "\"I was born in America, I'm a proud participant in American society, I've given up everything to run because I love this country so much,\" Oz said.",
    "Oz shot back that McCormick's attacks against him \"as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews.\"",
    "He now says it's become a campaign distraction and, if he wins, he will renounce Turkish citizenship before being sworn in to the Senate.",
    "Oz said there would be no reason for him to give up security clearances anyway, speaking on Philadelphia's WPHT-AM radio.",
    "Oz was born in the United States to Turkish parents and, if elected, would be the first U.S. senator who is Muslim.",
    "\"It is completely disqualifying behavior for anyone aiming to serve in the United States Senate,\" Oz said.",
    "Senate historians have been unable to find a U.S. senator who knowingly maintained dual citizenship.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "\"I have no intention of doing anything that would harm this country.\"",
    "(Copyright 2022 The Associated Press.",
    "All rights reserved.",
    "In:\nPennsylvania"
  ]
}