{
  "id": 2947,
  "mediaId": 2590,
  "date": "2022-03-17",
  "headline": "Dr. Oz's First-Class Flip-Flop On Fracking",
  "image": "https://img.huffingtonpost.com/asset/623378222300004b61137a91.jpeg?cache=6hSzBPWxrx&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/dr-mehmet-oz-fracking-flip-flop_n_6232167de4b09e92692c9712",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris D'Angelo",
  "authorUrl": "",
  "termIds": [
    2232,
    2655,
    2662,
    3782,
    3975,
    5287
  ],
  "sentences": [
    "“We wonder how eager the leaders of the natural gas industry would be to drink well water from a farm next to one of their drilling sites,” Oz and Roizen wrote in a health and wellness Q&A, adding that in Pennsylvania, “there are multiple reports of air and water contamination, possibly from hydraulic fracturing sites, causing folks breathing problems, rashes, headaches, nosebleeds, numbness, nausea and vomiting.”\nAdvertisement\nBut now that Oz is a GOP Senate candidate in Pennsylvania, he is apparently less concerned about fracking’s possible health effects on his potential constituents and more interested in preserving an industry active in the state.",
    "Fracking May Cause Birth Defects.” In it, they cited a study from the University of Missouri-Columbia that they noted “determined that for 15 million Americans living within one mile of sites for fracking sites … exposure to the chemicals released ‘may be harmful to human health’ and ‘can result in adverse reproductive health and developmental defects.’”\nThe two also called for legislation that “requires anyone who profits from a fracking site to drink the local water.”\nIn a second piece in Newsmax in December 2015, Oz and Roizen slammed the lack of accountability surrounding chemicals used by the fracking industry.",
    "In a February interview with The Dom Giordano Program, Oz said Pennsylvanians are “angry” that “corporate elitists” have “aided and abetted by not allowing smart energy policy to thrive, because they’ve had to go along to get along.”\n“They allowed green energy ideologists to argue that anything having to do with natural gas, for example, is bad for the environment, bad for humanity, and can’t occur,” he said.",
    "Roizen took over sole management of the daily column in 2009 and when they disagreed on views, he was supposed to clearly specify he felt a different way than Dr. Oz — these are clear examples that he didn’t do that.”\nAdvertisement\nYanick provided HuffPost with a letter that Roizen signed eight days before Oz announced his Senate bid.",
    "Oz and Roizen threw their support behind an American Medical Association initiative calling for the disclosure and monitoring of fracking chemicals to better protect human health, and encouraged readers living near fracking wells to “get a good water filter now.”\nTo say Oz’s views on fracking have morphed would be an understatement.",
    "I write to ensure that our agreement is part of the public record.”\nThe campaign’s argument raises the question of whether there are other medical advice columns published in 2009 or later that Oz also doesn’t stand behind — columns that had no disclaimer and therefore led readers to believe Oz backed them.",
    "It seems to be able to do things that otherwise we wouldn’t be able to do and keeping ourselves energy independent.”\nOz has even criticized people who’ve raised environmental and human health concerns about the practice — something that the articles attributed to him actually did.",
    "pic.twitter.com/XkIE6qV4R0\n— Dr. Mehmet Oz (@DrOz) March 16, 2022\nOz’s campaign is even denying that he ever voiced any concern about fracking in the first place, claiming that he had no part in any of those earlier columns — even though he is listed as their primary author.",
    "He has done a complete 180 on the issue, even though environmental and public health concerns about the practice persist and a recent poll found that the majority of Pennsylvania residents — 55% — oppose fracking and want to see it brought to an end.",
    "An Environmental Protection Agency study in 2016 concluded that such fracking activities “can impact drinking water resources under some circumstances.”\nOz’s campaign, however, claims his past position on fracking wasn’t really his at all.",
    "Yanick told HuffPost that Oz “has always supported hydraulic fracturing and a strong domestic energy industry.” The campaign provided HuffPost with 10 different comments Oz has made voicing that support — yet all of them were from 2022.",
    "In 2014, an Ohio man asked Oz and Dr. Mike Roizen, then the chief medical officer at the Cleveland Clinic Wellness Institute, whether it was true that fracking is polluting air and groundwater and threatening public health.",
    "“Believe it or not, when chemicals under immense pressure are injected into the ground during hydraulic fracturing, no one is currently held accountable for the amount and/or type of chemicals being used,” they wrote.",
    "Oz is campaigning on a pledge to “fight back against heavy-handed regulations and protect the PA energy industry!” More specifically, he’s going to bat for frackers, arguing that the technology is effective and safe.",
    "He also appeared to be a strong opponent of fracking, warning his readers in multiple articles about the potential health risks associated with one of the more controversial fossil fuel extracting technologies.",
    "Advertisement\nHydraulic fracturing, better known as “fracking,” involves pumping a pressurized mixture of water, sand and chemicals into underground rock formations to release oil and natural gas.",
    "A 2019 report, for example, concluded that new oil and gas drilling, which relies heavily on hydraulic fracturing, would generate planet-warming pollutants equivalent to 1,000 new coal plants.",
    "Advertisement\n“As a doctor, and as an outsider, I can say that natural gas is a much faster way for us to keep the planet safe than most of the other ideas, like buying Teslas,” he said.",
    "pic.twitter.com/ArdXPXqFp1\n— Dr. Mehmet Oz (@DrOz) March 13, 2022\nOz’s promotion of fracking stands in stark contrast to the position he apparently held before running for public office.",
    "While it is true that the U.S. fracking boom helped reduce greenhouse gas emissions by replacing coal-fired electricity, natural gas is not the “clean” fuel the industry claims it is.",
    "Mehmet Oz, the celebrity TV surgeon better known as Dr. Oz, used to write and tweet about the health benefits of coconut oil, lavender oil, CBD oil, MCT oil, avocado and olive oil.",
    "Along with cheerleading for fracking, the GOP candidate has adopted all of his party’s talking points to blame Biden for high gas prices and Russia’s violent invasion of Ukraine.",
    "That denial calls into question which of Oz’s medical advice columns he actually stands behind and raises questions about his brand as a trusted health professional.",
    "Advertisement\nOz has joined the chorus of Republican voices citing Russia’s war in Ukraine to demand President Joe Biden “unleash” American oil and gas production.",
    "Oz and Dr. Roizen have very different positions on energy policy and fracking,” Brittany Yanick, the campaign’s communications director, told HuffPost.",
    "Oz’s flip-flop on fracking highlights the Republican Party’s allegiance to a fossil fuel industry that is the primary driver of global climate change.",
    "— Dr. Mehmet Oz (@DrOz) February 6, 2022\n“Fracking is something I’ve looked at very carefully,” he said on Sean Hannity’s radio show in December 2021.",
    "Methane, the main component of natural gas, is a potent greenhouse gas that accounts for one-third of all human-caused planetary warming.",
    "A spokesperson claimed that the views in their shared columns belonged entirely to Roizen, even though Oz’s name appeared in the byline.",
    "In it, Roizen wrote, “When Dr. Oz shifted his focus to launch his show in 2009, I took over the sole management of his daily column.",
    "Permits mean nothing if Biden refuses to provide certainty that our energy producers' investments will be able to continue.",
    "Give us freedom to frack!” Oz said Wednesday in a rambling TikTok video while pumping gas somewhere in the Keystone State.",
    "As the next US Senator from PA, I will fight back against heavy-handed regulations and protect the PA energy industry!",
    "Click here\nOz and Roizen replied that it was “a fact” that the process pumps “toxic chemicals” deep into the ground.",
    "His Twitter feed is a spitting image of those of many fossil fuel industry-backed GOP lawmakers in recent weeks.",
    "If history is any guide, his rhetoric is all but certain to pay off in the form of industry campaign donations.",
    "In January 2015, he and Roizen also co-authored a piece in right-wing news outlet Newsmax titled, “Surprise!",
    "Yanick did not respond when HuffPost asked if there are examples that predate his bid for Senate.",
    "Oz added that natural gas is the “right” choice scientifically and medically.",
    "When controversial topics arose, we were supposed to debate options.",
    "If we disagreed on an editorial direction, I would specify that ‘Dr.",
    "Pennsylvania is a leader in the production of coal and natural gas.",
    "We have found several columns where this process was not followed.",
    "“You can spread all kinds of rumors about fracking, but it works.",
    "And methane leaks are pervasive across the oil and gas sector.",
    "Back off Biden and give us the freedom to Frack!",
    "Roizen did not return a phone call on Thursday.",
    "Give us the freedom to frack.",
    "Roizen’ felt a certain way.",
    "“Back off Biden!",
    "“Dr.",
    "“Dr."
  ]
}