{
  "id": 300,
  "mediaId": 2634,
  "date": "2022-04-12",
  "headline": "Is Trump’s Endorsement Still Gold for Republicans?",
  "image": "https://images.newrepublic.com/28d0fcfb9c637c9bcd084b528f372a620c1a2d2b.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/166078/trump-endorsement-dr-oz-midterms",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Strauss",
  "authorUrl": "https://newrepublic.com/authors/daniel-strauss",
  "termIds": [
    0
  ],
  "sentences": [
    "The decision was a shocker because McCormick checked all the boxes of a Republican candidate running statewide in 2022: military and business credentials, a spouse with ties to the Trump administration, a habit of effusively praising the former president, and a campaign staff with plenty of Trump connections.",
    "Trump has reportedly been fuming that Guilfoyle would associate with Greitens—a candidate the former president has recently signaled he’s uninterested in endorsing, mostly because of the scandal that pushed him out of office and fresh, related accusations from Greitens’s former wife.",
    "Of the candidates I’ve gotten endorsed, it’s had nothing to do with that situation.”\nThe larger implication of this is that Donald Trump may very well be in danger of losing some of the mojo he’s had to keep an iron grip on the Republican Party since he ran for president and won.",
    "In Wyoming, the primary challenger to Congresswoman Liz Cheney—seemingly Trump’s number one target to remove from office this cycle—is using National Public Affairs LLC, a firm made up of the top advisers of Trump’s erstwhile presidential campaign.",
    "Trump’s endorsement contradicted a hypothesis shared by many statewide campaigns this cycle: Insulate your campaign in the Trumpian universe, and get in good with the man likely to be the GOP 2024 nominee, by filling it with former Trump staffers.",
    "He has lived with us through the screen and has always been popular, respected, and smart.”\nThe endorsement garnered reactions of surprise and, in some corners—like the corner of the Republican Party that Trump’s allies inhabit—fury.",
    "“I can’t tell you how many battles I’ve had with clients this cycle where I’m like, ‘No, we’re not going to pay this retainer that is twice as much a month as mine is.’ Sure, if it actually delivered, it would be worth it.",
    "The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate,” Trump said in his endorsement backing Oz.",
    "The same is true of Greitens and of other candidates who have done the dance of hiring Trump’s friends, prostrating themselves at Mar-a-Lago, and repenting over any past criticism of the former president.",
    "It also, presumably, wasn’t a deliberate campaign move, but McCormick’s wife happens to be Dina Powell, a former Trump administration deputy national security adviser for strategy.",
    "Yet it’s almost a prerequisite for a major Republican campaign to have some kind of Trump alum or Trumpy figure working for it if it is to be taken seriously in GOP circles.",
    "Republicans, unsurprisingly, are hesitant to talk about anything associated with how important or unimportant a Trump association is to a candidate’s overall chances.",
    "Over the weekend Donald Trump upended the political status quo by endorsing Dr. Mehmet Oz over Republican David McCormick in the Pennsylvania GOP primary for Senate.",
    "But she’s been able to raise huge sums of money and retain support from other influential quarters of the party, including Senate Minority Leader Mitch McConnell.",
    "One Republican strategist I talked with said it didn’t matter “one whit” whether a campaign employed Trump’s favorite allies and former White House staffers.",
    "And even when candidates do get Trump’s endorsement, recent developments in major primaries across the country show that doesn’t necessarily end the contest.",
    "Sarah Huckabee Sanders, Trump’s former White House press secretary and now a Republican nominee for governor of Arkansas, has held an event with McCormick.",
    "Trump likes to brag about how his endorsement can win a candidate just about any primary and boost that candidate “like a rocket” in the general election.",
    "The assumption among Republican campaigns has been that having Trump allies on the campaign creates a serious pathway to getting Trump’s endorsement.",
    "“To some degree, anybody who is a competitive candidate with a budget does” hire someone from Trumpworld, said a veteran Republican campaign manager.",
    "McCormick, for instance, could still win the primary and show that in spite of Trump’s coronation of an opponent, a Republican can get the nod.",
    "It’s extremely rare that a gubernatorial candidate will take time off to campaign for a Senate candidate of a completely different state.",
    "Greitens is in a close three-way primary, and although he’s not the runaway favorite, he could still win it, sans Trump’s endorsement.",
    "Yet Greitens could easily lose the primary, in part because of new revelations about a sex scandal that dashed his time as governor.",
    "Republican candidates, though, almost always prioritize it, even when there’s a hefty price tag behind bringing some Trump alums on.",
    "At the very least, it will call into question whether inhabiting Trump’s universe and trying to get close to him is worth it at all.",
    "Trump’s endorsement is clearly still seen as useful in Republican politics, given that so many conservative candidates seek it.",
    "Trump has endorsed Perdue and seethes over Kemp’s honesty in the way Kemp acknowledges Joe Biden’s win in the state.",
    "“I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.",
    "But Trump, in the end, apparently saw more of himself in the TV personality turned first time political candidate.",
    "“This is all about winning elections in order to stop the Radical Left maniacs from destroying our Country.",
    "McCormick himself was spotted at Mar-a-Lago in the last few weeks making his pitch for Trump’s endorsement.",
    "In Georgia, Republican challenger David Perdue is not the favorite to oust incumbent Governor Brian Kemp.",
    "But he’s shown that getting his endorsement requires a high level of fealty to him and how he campaigns.",
    "Former Trump White House advisers Hope Hicks and Stephen Miller have been advising the campaign.",
    "In Wyoming, Harriet Hageman, the Cheney challenger, has also been using National Public Affairs.",
    "In Missouri, former Governor Eric Greitens is running for Senate as a dyed-in-the-wool Trumper.",
    "President [Trump] endorsed this guy?” referring to a photo of Oz, according to the Daily Beast.",
    "But there’s no recipe to getting it, including building as Trumpy a campaign as possible.",
    "Cheney has outraised Hageman, with $2.94 million this quarter to Hageman’s $1.3 million.",
    "Roger Stone, one of Trump’s oldest and most incendiary allies, wrote on Telegram: “Wait?",
    "Cheney currently has $6.8 million cash on hand while Hageman has only about $1 million.",
    "“I think everyone in that world overpromises and under-delivers,” the strategist said.",
    "Kellyanne Conway, Trump’s pollster turned White House counselor, has also pitched in.",
    "His national campaign chair is Kimberly Guilfoyle, the girlfriend of Donald Trump Jr.",
    "In other words, Trump’s backing hasn’t brought a windfall of money to his candidate.",
    "Even when candidates get Trump’s endorsement, it doesn’t mean the primary is over.",
    "Miller has left the campaign since Trump’s Oz endorsement, according to the Beast.",
    "Cheney is hardly a lock for reelection (the primary will take place August 16).",
    "And yet in both cases a Trump endorsement is hardly a herald of victory.",
    "Cheney also is polling ahead of Hageman right now, but polling is scant.",
    "The more that’s put into question, the more it’s a disaster for Trump.",
    "He’s behind some other candidates who aren’t getting traction.",
    "He shocked and enraged some Republicans by backing Dr. Oz.",
    "But behind closed doors there’s plenty of skepticism.",
    "Yet all those connections meant nothing in the end.",
    "Kemp led Perdue by double digits in a recent poll.",
    "“They’re obsessed with it,” the strategist said.",
    "And those alumni often get paid extremely well.",
    "Is it finally starting to wear off?",
    "McCormick’s was one such campaign.",
    "But I have yet to have it deliver.",
    "Except that’s not always true."
  ]
}