{
  "id": 308,
  "mediaId": 2688,
  "date": "2022-04-11",
  "headline": "Texas Drops Murder Charge Against Woman For Alleged ‘Self-Induced Abortion’",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/04/GettyImages-1235646245.jpg",
  "link": "https://talkingpointsmemo.com/morning-memo/texas-drops-murder-charge-against-woman-for-alleged-self-induced-abortion?utm_source=rss&utm_medium=rss&utm_campaign=texas-drops-murder-charge-against-woman-for-alleged-self-induced-abortion",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Cabrera",
  "authorUrl": "https://talkingpointsmemo.com/profile/cristina_cabrera",
  "termIds": [
    0
  ],
  "sentences": [
    "Key Analysis\nVirginia GOP Official Resigns After Calling Secretary of Defense The N-Word\nDavid Dietrich, the Republican chair of the Electoral Board in Hampton, Virginia, heeded calls from his own party for his resignation on Saturday over his racist post about Defense Secretary Lloyd Austin and retired Gen. Russel Honoré, whom House Speaker Nancy Pelosi (D-CA) had appointed to investigate the security failures of the Jan 6. insurrection.",
    "Trump was clearly dazzled by Oz’s celebrity, declaring during a rally on Saturday that being on TV as long as Oz has (18 years) was “like a poll” and “means people like you.”\nElon Musk Decides Not To Join Twitter Board\nTesla CEO Elon Musk, who recently became Twitter’s biggest shareholder after buying a 9.2% stake in the company, won’t be joining Twitter’s board of directors, Twitter CEO Parag Agrawal announced on Sunday.",
    "Ginni Grifted During Meeting Between Clarence Thomas And Trump\nPresident Trump hosted a private lunch with the Supreme Court Justice Clarence Thomas and his wife Ginni a week after the 2018 midterms, during which she pushed the president to install her far-right allies and fellow activists at the White House as part of her reportedly “insane” hiring/firing recommendations, according to a new CNN report.",
    "Dodging A Nightmare (For Now)\nDistrict Attorney Gocha Allen Ramirez of Starr County, Texas announced on Sunday that he wouldn’t be pursuing prosecution of a woman who had been indicted for murder after allegedly being involved in a “self-induced abortion.”\nThe circumstances of the alleged incident remain unclear, including whether the woman was inducing her own abortion or assisting in someone else’s.",
    "Third Biden Cabinet Member Gets COVID\nSeveral days after Attorney General Merrick Garland and Commerce Secretary Gina Raimondo revealed that they had come down with COVID-19, Agriculture Secretary Tom Vilsack announced on Saturday that he too had tested positive for COVID-19.",
    "Kay Ivey (R) put out a campaign ad last week claiming that “fake news, Big Tech and blue state liberals stole the election” from Trump–”but not here in Alabama,” she proudly declared of her state, as if it were ever in question that Alabama would vote for Trump.",
    "Their attempt at stuffing the ballot boxes came after the county GOP chair claimed during the same meeting that paper ballots for the primary election would be “safest.” “But look—we fixed it, right?” the chair responded when asked about the clear self-own.",
    "Republicans had been hoping that Musk’s appointment to the board would lead to Trump’s Twitter account being restored given the Tesla leader’s previous complaints about the social media giant supposedly stifling “free speech” by banning elected officials.",
    "Utah GOPers Catch Voter Frauding At Own Convention\nTwo men were caught trying to vote more than once as the votes in the Republican primary race for Salt Lake County clerk were being counted at the Salt Lake County GOP Convention on Saturday.",
    "MAGALand Is Big Mad After Trump Endorsed Dr. Oz\nThe ex-president endorsed fellow TV star Dr. Mehmet Oz in the Pennsylvania Senate race on Saturday, incensing some of Trump’s top supporters in right-wing media and conservative circles.",
    "The prosecutor still defended her arrest, however, saying that the county sheriff’s office “did their duty in investigating the incident brought to their attention by the reporting hospital.”\nThe woman was arrested on Friday.",
    "It’s unclear how far along the pregnancy was or under which statue she was indicted, given that none of Texas’ new anti-abortion bans directly target people actually carrying the fetus.",
    "Agrawal didn’t explain exactly why Musk decided not to join the board, but apparently the move was “for the best,” according to the Twitter chief.",
    "Dietrich had directed the N-word at Austin and Honoré in a Facebook rant posted in February last year but which only recently came to light.",
    "All three had attended the Gridiron dinner last weekend, after which at least 67 people (including House Speaker Nancy Pelosi) got infected.",
    "The official agreed to do so after that, the governor’s office told WAVY-TV, after reportedly ignoring calls from the Hampton GOP to quit.",
    "They compared Oz to Sen. Mitt Romney (R-UT), apparently believing that the TV doctor isn’t MAGA enough to be worthy of Trump’s support.",
    "Ramirez said the woman “cannot and should not be prosecuted for the allegation against her” after he reviewed her case.",
    "Both abortion rights groups and some anti-abortion advocates hailed the decision not to prosecute.",
    "Glenn Youngkin (R) had publicly demanded earlier on Saturday that Dietrich resign.",
    "Alabama Guv Goes All In On Trump’s Big Lie\nIn case you missed it, Alabama Gov.",
    "A Palate Cleanser\nDo you like Morning Memo?",
    "Here are some of the things.",
    "This is TPM’s Morning Memo.",
    "A lot of things happened.",
    "Virginia Gov.",
    "Let us know!"
  ]
}