{
  "id": 314,
  "mediaId": 2912,
  "date": "2022-04-09",
  "headline": "Trump backs Dr. Oz in key Senate endorsement for midterms",
  "image": "https://www.staradvertiser.com/wp-content/uploads/2022/04/web1_20220409-web-oz.jpg",
  "link": "https://www.staradvertiser.com/2022/04/09/breaking-news/trump-backs-dr-oz-in-key-senate-endorsement-for-midterms/",
  "mediaOutlet": "HonululuAdvertiser",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Jeff Roe, general counsel for the McCormick campaign, reacted to the Trump endorsement by saying on Twitter that McCormick “is going to be the next Senator from the Commonwealth of Pennsylvania.”\nTight Race\nOz and McCormick are among seven GOP candidates for the seat being vacated by retiring Republican Senator Pat Toomey in one of the key elections in November that will decide which party controls the chamber.",
    "Surveys last year by Franklin and Marshall College found that the largest percentage of commonwealth Republicans think of themselves as “Trump Republicans,” so it’s difficult to imagine a candidate winning the GOP Senate primary if the former president endorsed someone else, said Berwood Yost, director of the college’s Center for Opinion Research.",
    "Other GOP candidates in the race include real estate developer Jeff Bartos; Carla Sands, Trump’s former ambassador to Denmark; conservative political commentator Kathy Barnette and Philadelphia attorney George Bochetto, who hope to emerge with McCormick and Oz attacking each other.",
    "McCormick surrounded himself with former Trump administration officials, including Hope Hicks, Stephen Miller and Kellyanne Conway, while former White House Press Secretary Sarah Huckabee Sanders and others close to Trump are supporting McCormick.",
    "And while Trump’s endorsement could help Oz win the GOP primary, it could be a drawback in the general election by motivating voters who don’t like Trump, said former Pennsylvania Republican Senator Rick Santorum, who’s supporting McCormick.",
    "“That means people like you.”\nMcCormick made a concerted effort to court Trump’s favor, including with the help of his wife, Goldman Sachs Group Inc. partner Dina Powell McCormick, a former deputy national security adviser under Trump.",
    "Oz, best known for hosting “The Dr. Oz Show” before he ended it to run for the Senate, has been playing up his support for Trump’s “America First” agenda and highlighting McCormick’s past comments critical of Trump and praising Biden.",
    "Donald Trump endorsed celebrity physician Mehmet Oz over former Bridgewater Associates executive David McCormick in the Republican primary for a Pennsylvania Senate seat, providing crucial support that could swing a close race.",
    "For example, former Georgia Senator David Perdue, whom Trump recruited to challenge Republican Governor Brian Kemp, is lagging in the polls and fundraising despite the backing and an in-state rally by the former president.",
    "Oz “will be the one most able to win” the general election, Trump said in the statement, citing the Republican’s stands on issues including abortion, crime, education the U.S. southern border, tax cuts and gun rights.",
    "Polls show McCormick and Oz in a tight race after both candidates entered the primary late when Sean Parnell, the candidate Trump previously endorsed in the race, suspended his campaign last November.",
    "The heart surgeon had the endorsement of Fox News host Sean Hannity, who’s close to Trump and frequently has Oz on his show, and the support of Trump’s wife, Melania, NBC News has reported.",
    "The former president released a statement backing Oz while campaigning for his favored candidates in North Carolina’s Republican primary on May 17 — the same day as the Pennsylvania vote.",
    "His decision came after a judge sided with his estranged wife in a custody battle that included allegations that Parnell physically and verbally abused her and their children.",
    "Addressing a rally Saturday evening, Trump called Oz a “good man, Harvard-educated” with a “tremendous career” who had proved his popularity with his long-running “Dr.",
    "The Democratic primary race includes Lieutenant Governor John Fetterman, U.S. Representative Conor Lamb and state Representative Malcolm Kenyatta.",
    "The choice of Oz over the former Wall Street executive is arguably the former president’s most consequential nod of the 2022 midterms.",
    "“You know, when you’re in television for 18 years, that’s like a poll,” Trump said at the rally in Selma, North Carolina.",
    "“Certainly it helps whoever he endorses in a primary — but hurts them in a general,” Santorum said.",
    "Women in particular “know him, believe in him, and trust him,” he said.",
    "But Trump’s endorsement isn’t looking decisive in all races.",
    "Oz” television show."
  ]
}