{
  "id": 3161,
  "mediaId": 3993,
  "date": "2022-03-18",
  "headline": "Dr. Oz says he didn't write pro-gun control columns bearing his name",
  "image": "https://media.townhall.com/townhall/reu/o/2009/131/1886d3f7-ed99-4063-84f6-8afa15dcb169@news.ap.org-1110x740.jpg",
  "link": "https://bearingarms.com/camedwards/2022/03/18/dr-oz-says-he-didnt-write-pro-gun-control-columns-bearing-his-name-n56581",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cam Edwards",
  "authorUrl": "https://bearingarms.com/author/camedwards",
  "termIds": [
    0
  ],
  "sentences": [
    "Dr. Mehmet Oz continues to show surprisingly strong poll numbers in his bid for the Republican nomination for the U.S. Senate seat currently held by Pat Toomey, especially for a guy who may or may not live in the state and has long taken positions on the Second Amendment that are far more in line with anti-gun activists.",
    "I’d be happy to pose those questions to Oz himself, and my offer to appear on Bearing Arms’ Cam & Co to talk about his positions on some key Second Amendment issues still stands, but so far anyway, when it comes to talking 2A specifics on camera with a knowledgeable interviewer, the doctor’s been out.",
    "I mean, we have plenty of evidence that Oz previously supported gun control, but I’m not aware of any statements he made detailing his gun ownership, even when he was talking about things like red-flag laws on his television show, where it would have made sense to bring it up.",
    "So Oz had nothing to do with the columns, but apparently never saw fit to issue any corrections letting readers know that he completely disagreed with the calls for gun bans and other restrictions on the right to keep and bear arms promoted under his name.",
    "As Fox News details, many of the columns advocated bans on so-called assault weapons, mandatory waiting periods, gun licensing laws, and more, but there’s a catch; Dr. Oz’s colleague says even if the columns ran under his name, he didn’t write them.",
    "Roizen’s letter did not specify which or how many columns were erroneously attributed to both doctors, but sought to “acknowledge periodic errors.”\n“When controversial topics arose, we were supposed to debate options.",
    "Oz has not only amplified calls for bans on modern sporting rifles and backed red-flag gun seizure laws, he’s used his television show to promote those gun control positions to an audience of millions.",
    "Yeah, that sounds totally believable.. as long as you’re the type of person who’ll hand over your life savings to that nice Nigerian prince who emailed you promising a huge return on your loan.",
    "Dr. Oz believes every law-abiding American should be allowed to buy a gun of their choice and he will support legislation in the U.S. Senate that protects our right to keep and bear arms.",
    "We have found several columns where this process was not followed, I write to ensure that our agreement is part of the public record and acknowledge periodic errors,” Roizen concluded.",
    "He does not support any measures that infringe on the Second Amendment and will oppose them,” Oz’s campaign told Fox News Digital in an exclusive statement.",
    "Oz’s campaign team also declared that the doctor has been a “proud gun owner for many years,” which makes me wonder: is there any evidence of that?",
    "Roizen produced a letter to Fox News Digital in which he stated Oz’s involvement in the columns was minimal due to other media commitments.",
    "Roizen went on to state that there were “several columns” where he failed to clarify that the text reflected only his own opinion.",
    "When Dr. Oz shifted his focus to launch his show in 2009, I took over the sole management of this daily column,” Roizen wrote.",
    "For his part, Oz released a statement to Fox News declaring his full and complete support for the Second Amendment.",
    "His anti-gun points of view extended to a syndicated column co-written with business partner Dr. Michael Roizen.",
    "Oz and I have been media partners for almost 20 years, including our best-selling YOU books.",
    "Well, never saw fit to issue any corrections until he was running for office.",
    "If we disagreed on an editorial direction, I would specify that ‘Dr.",
    "We started working on a daily “YouDocs” newspaper column in 2007.",
    "Roizen’ felt a certain way.",
    "“Dr."
  ]
}