{
  "id": 3223,
  "mediaId": 2660,
  "date": "2022-03-09",
  "headline": "Oprah Winfrey is not hawking diet pills",
  "image": "https://static.politifact.com/politifact/rulings/tom_ruling_pof.png",
  "link": "https://www.politifact.com/factchecks/2022/mar/09/facebook-posts/oprah-winfrey-not-hawking-diet-pills/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Monique Curet",
  "authorUrl": "https://www.politifact.com/staff/monique-curet/",
  "termIds": [
    4581,
    1249
  ],
  "sentences": [
    "The post includes an article headline that says, \"Oprah swears: ‘It’s a treadmill in a pill,’\" which links to a blog that does not contain information about Oprah or specific details about any weight loss product or method.",
    "Oprah Winfrey has famously, publicly shared her weight-loss journey for decades, but she is not hawking diet pills, despite a spate of social media claims that say she is.",
    "The false Facebook post includes a photo of Winfrey, Dr. Mehmet Oz and acupuncturist Daniel Hsu, who appeared on Winfrey’s TV show in 2014.",
    "A March 7 post on Facebook says, \"Oprah reveals her fully-natural solution,\" a pill that allowed her to lose 62 pounds in six weeks.",
    "The image is a screenshot from that episode, which featured Winfrey’s first acupuncture session and was not about weight loss.",
    "Winfrey has a partnership with WW, formerly known as Weight Watchers, and has owned a stake in the company since 2015.",
    "Fact checkers recently have debunked identical claims that contain the same wording but different images and links.",
    "We rate the claim that Winfrey has revealed a pill that allowed her to lose 62 pounds in six weeks Pants on Fire!",
    "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed.",
    "In January, Winfrey highlighted her relationship with WW in an Instagram post.",
    "The claim is \"completely false,\" a spokesperson for Winfrey said.",
    "(Read more about our partnership with Facebook.)"
  ]
}