{
  "id": 3229,
  "mediaId": 2738,
  "date": "2022-03-08",
  "headline": "US Senate Candidate/Quack TV Doctor Dr. Oz Is Fighting With His Sister Over Their Father’s Estate",
  "image": "https://uproxx.com/wp-content/uploads/2021/03/dr-oz.jpg?w=1024",
  "link": "https://uproxx.com/viral/dr-oz-fighting-sister-family-estate/",
  "mediaOutlet": "uproxx.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Wood",
  "authorUrl": "https://uproxx.com/author/jennifer-wood/",
  "termIds": [
    2232,
    3762,
    4536,
    710,
    711,
    1171,
    5126,
    5363,
    5373
  ],
  "sentences": [
    "According to Page Six, Dr. Oz noted in an affidavit filed in Manhattan Supreme Court that Turkish authorities had been able to locate some of the missing money stashed away in secret bank accounts in three other countries, including the Cayman Islands.",
    "As Page Six notes, the troubles all began back in 2020, when Oz’s sister, Nazlim Oz, sued her big bro for withholding the $15,000 per month she usually made from several rental properties the family owns on Manhattan’s Upper East Side.",
    "Dr. Oz, announced that he would be ending his long-running daily talk show in order to make a run for the U.S. Senate in Pennsylvania (despite the state of Pennsylvania doing nothing to deserve this).",
    "According to Page Six:\nNazlim — who lives in Turkey — allegedly hid money “from her father’s estate to her own use and to the ongoing detriment of her sister, Seval Oz,” the affidavit alleges.",
    "Oz ceased the distributions because he, [sister] Seval, and their mother (Suna Oz) uncovered evidence that Nazlim had been stealing her father’s money,” Michael J. Cohen, Oz’s lawyer, wrote.",
    "Now, in what is definitely not a great look for a wannabe senator, Page Six reports that he’s embroiled in a legal brouhaha with his sister over their late father’s estate.",
    "Nazlim said the gravy train stopped running following the death of their father, Mustafa Oz, in February 2019 (it was Mustafa who had purchased the condos).",
    "But now Dr. Oz is claiming it’s his sister who is in the wrong, and suing her for allegedly stealing millions of dollars from their late pops’ estate.",
    "Nazlim also allegedly “deprived our mother of funds with which to live, and deprived her of her inheritance,” the papers say.",
    "Dr. Oz claims Nazlim forged their dad’s will in 2018 in an attempt to override the real one, according to the affidavit.",
    "Nazlim Oz’s lawyers did not immediately respond to Page Six’s request for comment.",
    "He’s using this information to ask a judge to halt Nazlim’s lawsuit against him.",
    "In the months since then, the TV quack has made one public gaffe after another.",
    "In late 2021, “serial testicle fondler” Mehmet Oz, a.k.a.",
    "(Via Page Six)",
    "“Dr."
  ]
}