{
  "id": 3281,
  "mediaId": 2732,
  "date": "2022-03-14",
  "headline": "The super PAC hammering Mehmet Oz as a RINO is getting money from longtime Democratic donors",
  "image": "",
  "link": "https://triblive.com/news/pennsylvania/the-super-pac-hammering-mehmet-oz-as-a-rino-is-getting-money-from-longtime-democratic-donors/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Philadelphia Inquirer",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "McCormick “has widespread Republican support,” said campaign spokesperson Jess Szymanski, “who all believe Dave is the only candidate that will keep the open Senate seat red and reverse Joe Biden’s disastrous policies.” She highlighted endorsements from former Secretary of State Mike Pompeo, Sen. Ted Cruz, R-Texas, and former White House press secretary Sarah Huckabee Sanders.",
    "The big bucks from finance and tech industry donors, regardless of their usual leanings, also reflect the vast network of wealthy allies that McCormick and his wife, herself political and business powerhouse, can tap into for a hugely expensive and critical Senate race.",
    "Joel Klein, an executive at the insurance company Oscar who was once Bill Clinton’s deputy White House counsel, has given regularly to Democrats in Congress, and in 2016 supported Katie McGinty, the Democratic nominee for Senate in Pennsylvania.",
    "PHILADELPHIA — Wealthy investors and executives supporting Republican Senate candidate David McCormick have helped flood Pennsylvania’s airwaves with ads accusing GOP rival Mehmet Oz of being too liberal, a RINO — Republican In Name Only.",
    "He and several others who have either donated primarily to Democrats or to members of both parties are among the early funders backing the pro-McCormick super PAC Honor Pennsylvania — whose ads challenge Oz’s conservative credentials.",
    "The vast majority of the money detailed to this point has come from a stalwart GOP donor, Kenneth Griffin, head of the hedge fund Citadel Investment Group, who provided $5 million of Honor Pennsylvania’s initial $5.45 million.",
    "Because McCormick isn’t required by law to file his own campaign finance report until April, the super PAC’s few disclosed donors provide the only clues so far about who is backing an astounding level of early advertising.",
    "The money has helped fuel a $7.7 million — and counting — ad barrage that has changed the shape of Pennsylvania’s Republican Senate primary, elevating McCormick and pulling down Oz, the celebrity surgeon known as “Dr.",
    "McCormick was CEO of the world’s largest hedge fund, Bridgewater Associates, and his wife, Dina Powell McCormick, is a Goldman Sachs executive who also served in the George W. Bush and Donald Trump administrations.",
    "For example Arjun Gupta, officially listed as the “chief believer” of the venture capital firm Telesoft, has over the years given hundreds of thousands of dollars in donations almost exclusively to Democrats.",
    "But of the seven known donors, at least four gave to Clinton’s presidential bid and a fifth made a $100,200 donation to the Democratic National Committee weeks before the 2016 election.",
    "The PAC, which formed late last year, has only had to reveal a fraction of its fund-raising so far under federal reporting rules, so only seven donors have been publicly disclosed.",
    "Cory Booker of New Jersey and Ron Wyden of Oregon, and are now writing $50,000 or $100,000 checks to the pro-McCormick group hammering Oz for being soft on abortion and gun laws.",
    "While it’s still early, the spending has so far been the single biggest factor in the race, overwhelming, for now at least, Oz’s own massive burst of TV advertising.",
    "But support from people who backed Clinton and other Democrats might run counter to McCormick’s attempts to play up his connections to former President Donald Trump.",
    "Investor Harry Sloan Evans, for example, gave major sums to the Mitt Romney’s and John McCain’s presidential campaigns, and the Republican National Committee.",
    "But some of those same donors have also supported some of the most liberal Democrats in Congress, and Hillary Clinton’s 2016 presidential campaign.",
    "McCormick’s campaign has added another $6.5 million in ads itself through last week, according to AdImpact, which tracks political advertising.",
    "That includes contributions to Booker and U.S. Rep. Ro Khanna, D-Calif., one of the most progressive members of the House.",
    "Gupta gave $100,000 to Honor Pennsylvania, his largest federal campaign donation ever, according to public records.",
    "Oz.”\nThe PAC’s spending shows that others have given even more since the Dec. 31 cutoff for its last public report.",
    "No campaign team in the country has spent more on a single Senate race than McCormick and his super PAC.",
    "Asked about such donations, McCormick’s campaign pointed to endorsements from major Trump allies.",
    "Honor Pennsylvania donors have also given to high-profile Democrats such as Sens.",
    "Neither would any of the donors who had previously given regularly to Democrats.",
    "But in 2016, he donated $38,800 to Clinton as she campaigned against Trump.",
    "He gave Honor Pennsylvania $50,000, his largest federal political donation.",
    "He and McCormick both served as board members of the Aspen Institute.",
    "It’s common for major donors to give to candidates in both parties.",
    "Categories: News | Pennsylvania | Politics Election | Top Stories",
    "Three other donors have almost exclusively given to Republicans.",
    "McCormick has also hired a number of former Trump advisers.",
    "He gave $100,000 to the McCormick-allied super PAC.",
    "One of them worked in Bill Clinton’s White House.",
    "The super PAC wouldn’t comment on the record."
  ]
}