{
  "id": 3293,
  "mediaId": 2712,
  "date": "2022-03-09",
  "headline": "Dr Oz’s daughter Daphne’s show The Good Dish canceled as she ‘struggled’ to book A-list guests on ‘doomed’ series",
  "image": "https://www.thesun.co.uk/wp-content/uploads/2022/03/pc-daphne-oz-the-good-dish-cancelled-offplat.jpg?strip=all&quality=100&w=1500&h=1000&crop=1",
  "link": "https://www.thesun.co.uk/tv/17900200/dr-oz-daughter-show-canceled/",
  "mediaOutlet": "The Sun | The Best for News, Sport, Showbiz, Celebrities & TV | The Sun| The Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessica Finn",
  "authorUrl": "https://www.thesun.co.uk/author/jessica-finnthe-sun-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Most read in TV\nGOGGLEFLOP\nGogglebox slammed by fans for 'destroying' family viewing with explicit content\n'horrible'\nLaura Whitmore hits back at Love Island star over Iain Stirling job claims\n'I'M IN SHOCK'\nMy husband cheated on me with his best friend's girlfriend, says BGT star\nget me out of there\nI'm A Celebrity All Stars show turned DOWN by major ITV celeb\n“The show was doomed to fail from the outset,” the insider added.",
    "Andy Cohen was one of the show's first guests according to a press releaseCredit: The Good Dish/Facebook\nFoodgod, formerly known as Jonathan Cheban, also made an appearance on The Good DishCredit: The Good Dish/Facebook\nThe Good Dish premiered in January and struggled with ratingsCredit: The Good Dish/Facebook\nWe pay for your stories!",
    "Inside Khloe's perfect pantry with $2K JARS in new $15M mansion\nINCOMING CASH\nChecks worth $400 will be issued to residents in weeks – see if you qualify\nHe was also met with criticism about his stance on sending children back into schools at the height of the pandemic.",
    "Daphne Oz's show The Good Dish has been canceled after it replaced Dr Oz's showCredit: Getty\nThe Good Dish premiered in January & struggled to book A-list guests\nThe chef and TV host, 36, just launched her new series in January.",
    "In a 2020 interview, Dr Oz said schools should reopen because doing so “may only cost us 2% to 3% in terms of total mortality” of the population- a statement he would later apologize for on Twitter, while claiming he misspoke.",
    "READ MORE ON DAPHNE OZ\nSERVING UP SOMETHING NEW\nMeet Dr Oz's daughter Daphne Oz\nLET'S DISH\nEverything to know about the new television show The Good Dish\n\"Things would be different if Dr. Oz was running as a Democrat.",
    "He was among the medical experts to tout the benefits of hydroxychloroquine, the malaria drug pushed by former President Donald Trump as a treatment for COVID-19, despite insufficient evidence.",
    "“The show was struggling to book any decent guests and had a recent dip in ratings from its start earlier this year,” one source claimed of The Good Dish’s troubled beginnings.",
    "Oz’s first guest ever was Oprah, while Daphne’s biggest star guest was Andy Cohen.”\nOther guests included singer Marie Osmond, as well as Kim Kardashian's best friend Foodgod.",
    "DR MEHMET Oz’s daughter Daphne’s new show has been canceled after she struggled to book A-list guests and failed to bring in high ratings, The Sun can report.",
    "Back in November of 2021, Dr. Mehmet Oz announced that he was running for US Senate, and that his daughter was taking his place with her new talk show.",
    "He faced backlash from the medical community for using his platform to release questionable information about the COVID-19 pandemic.",
    "Sources exclusively told The Sun that Daphne’s cooking and talk show, The Good Dish, will not be returning for another season.",
    "The source said her famous father's political leanings may have been partly to blame for the lackluster guest roster.",
    "Oz eventually dialed back his endorsement, saying people should wait for more substantial evidence from trials.",
    "DR OZ CONTROVERSIES\nDr Oz is no stranger to controversy, even before he announced he was running for office.",
    "Like us on Facebook at www.facebook.com/TheSunUS and follow us from our main Twitter account at @TheSunUS",
    "\"If that were the case, people in Hollywood would have been lining up to be on her show.”\n“Dr.",
    "The Good Dish premiered on January 17, 2022, just three days after her father's show ended.",
    "The show is expected to finish out its current season, according to the insider.",
    "When reached by The Sun, Sony stated they have no comment at this time.",
    "“Big stars don’t want to be associated with Daphne or her father.",
    "Email us at exclusive@the-sun.com or call 212 416 4552.",
    "Do you have a story for The US Sun team?",
    "Read More on The US Sun\nNO KHLUTTER!"
  ]
}