{
  "id": 331,
  "mediaId": 2537,
  "date": "2022-04-10",
  "headline": "Trump endorses celebrity surgeon Dr. Oz in Pennsylvania's Senate race",
  "image": "https://www.gannett-cdn.com/presto/2021/12/13/USAT/56361969-d468-4978-a812-db10d393d22b-AP_TV-Dr_Ozs_Exit.jpg?crop=5201,2926,x0,y576&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/04/10/donald-trump-endorses-mehmet-oz/9532026002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Wadington",
  "authorUrl": "https://www.usatoday.com/staff/4395552002/katie-wadington/",
  "termIds": [
    2201,
    2232,
    3975,
    878,
    1171,
    5239
  ],
  "sentences": [
    "Trump said he's known the doctor \"for many years, as have many others, even if only through his very successful television show\" and noted Oz's medical advice: \"He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!).\"",
    "The former president on Saturday gave his backing to Oz, the cardiac surgeon, TV host and author known as \"Dr. Oz,\" saying Pennsylvania voters have \"a tremendous opportunity to Save America by electing the brilliant and well-known\" candidate.",
    "Last month, President Joe Biden asked Oz and Georgia Senate candidate Herschel Walker to leave the Presidential Council on Sports, Fitness, and Nutrition.",
    "Oz is among 11 total candidates running in the primaries to replace Republican Sen. Pat Toomey; the Republican primary has seven of those candidates.",
    "According to a new poll from The Hill and Emerson College, Oz is in a near dead heat with former hedge fund manager Dave McCormick in the race.",
    "The biggest name in Pennsylvania's Senate race – Mehmet Oz – has secured the endorsement of the GOP's biggest name, Donald Trump.",
    "Among likely Republican voters, McCormick has 18% support, with Oz at 17%.",
    "Oz's campaign said he was fired from the council.",
    "Both were appointed to their posts by Trump.",
    "Contributing: Chelsey Cox"
  ]
}