{
  "id": 3344,
  "mediaId": 2630,
  "date": "2022-03-18",
  "headline": "Dr. Oz has a fan at Mar-a-Lago: Melania Trump",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220318-mehmet-oz-mjf-1213-e9c932.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/dr-oz-fan-mar-lago-melania-trump-rcna20641",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nOz also has faced attacks for positions that he advanced in the past — including more liberal stances on gun control and abortion rights — but that run counter to the conservative orthodoxy required of a GOP Senate candidate today.",
    "Oz’s main opponent in the Senate primary, former hedge fund executive David McCormick, has a bevy of Trump advisers and influential figures working in his campaign and super PAC, starting with his wife, Dina Powell, who served as a deputy national security adviser to the former president.",
    "One ad from the pro-McCormick super PAC Honor Pennsylvania brands Oz as a RINO, or Republican In Name Only, while recapping previous comments on guns, abortion and transgender children and showing footage of him dancing in 2013 with another first lady, Michelle Obama.",
    "In Pennsylvania’s shadow Republican primary to score a Donald Trump endorsement, celebrity doctor Mehmet Oz has the support of the ultimate insider: former first lady Melania Trump, according to sources familiar with her views on the race.",
    "They have a very personal relationship with Dr. Oz.”\nWhile Melania Trump is perhaps Oz’s most-influential backer in the primary, he can boast of a second: Fox personality Sean Hannity, who frequently speaks to the former president.",
    "Production on Oz’s syndicated show ended this year, and TV stations in Pennsylvania already had begun pulling it from their programming lineups to conform with federal equal time rules after he announced his candidacy in November.",
    "Trump had previously endorsed military veteran Sean Parnell, but the Republican dropped out of the race after losing a custody battle against his ex wife who accused him of domestic battery.",
    "Pennsylvania GOP Senate primary heats up between Dr. Oz and hedge fund executive\nFeb. 7, 202202:46\nMcCormick landed Parnell’s endorsement and campaigned with him this week near Pittsburgh.",
    "In a sign of how combative the race between them has become, Oz — who holds dual citizenship in the U.S. and Turkey — this week announced he would give up Turkish citizenship if elected.",
    "Trump also embraced the drug, which other medical experts had flagged for rare but potentially fatal side effects and which subsequent studies found did not effectively treat Covid.",
    "The May primary is crowded with other candidates, including Carla Sands, Trump’s former ambassador to Denmark, but polls have shown a tight race brewing between McCormick and Oz.",
    "And when Oz entered politics on his own late last year, he was aided by an expanded Fox News profile cultivated through appearances on Hannity’s program during the pandemic.",
    "He became friendly with Trump, who discussed the results of his much-scrutinized physical on “The Dr. Oz Show” in the middle of the 2016 presidential campaign.",
    "And that matters.”\nOz’s long-running daytime talk show career — launched by Oprah Winfrey and built around his medical expertise — made him a household name.",
    "Hannity recently endorsed Oz on his radio show and has often featured him on both his radio and TV shows, giving him valuable free media exposure.",
    "Trump recently said that he plans to endorse in the Pennsylvania Senate race, which is one of the most competitive GOP primaries in the nation.",
    "Trump adviser and 2016 campaign manager Kellyanne Conway serves on McCormick’s super PAC along with former campaign operative Andy Surabian.",
    "A Fox News survey last week showed McCormick in first place, at 24 percent among primary voters, with Oz in second place at 15 percent.",
    "McCormick and his allies had hammered Oz on that front, suggesting it would limit his access to U.S. intelligence on foreign countries.",
    "But Oz’s campaign has sought to replicate the look and feel of his familiar talk show on his “Dose of Reality” tour across the state.",
    "A second Republican source familiar with Melania Trump’s support for Oz said the deluge of opposition research has left a mark on Oz.",
    "“But this isn’t just about what Melania wants,” said the source, who is neutral in the race and was not authorized to speak publicly.",
    "And that matters,” said a top Republican familiar with the conversation inside Trump’s orbit at his Mar-a-Lago club in Palm Beach.",
    "“I know this is not a pep rally,” Oz said last month at an event in suburban Philadelphia, according to The Associated Press.",
    "In the past, his aides have declined to comment on private conversations and the former president’s endorsement preferences.",
    "Former White House Press Secretary Sarah Huckabee Sanders and former White House adviser Tony Sayegh also back McCormick.",
    "Critics have panned Oz, though, for promoting the use of hydroxychloroquine, an anti-malaria drug, as a Covid treatment.",
    "“But don’t underestimate the influence of the first lady,” the source, who frequently speaks with Trump, said.",
    "There are a lot of women, in whose living room and bedroom TVs Dr. Oz has been for a decade.",
    "“It really is for you to understand who I am, which is exactly what I want.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "A Trump spokesperson did not respond to a request for comment Friday.",
    "“The first lady has let the president know that she likes Dr. Oz.",
    "Yeah, I know him from television, but what is he really about?’”",
    "“She normally doesn’t weigh in, but she has here.",
    "I want skeptical people kicking the tires.",
    "“There are a lot of Melanias out there.",
    "Does he represent my values?",
    "‘Is this guy legit?"
  ]
}