{
  "id": 3382,
  "mediaId": 2716,
  "date": "2022-03-18",
  "headline": "Melania Trump has reportedly 'let the president know' she likes Senate candidate Dr. Oz",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1647626796/GettyImages-1370026514.jpg",
  "link": "https://theweek.com/melania-trump/1011499/melania-trump-has-reportedly-let-the-president-know-she-likes-senate",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    0
  ],
  "sentences": [
    "Even with these purported endorsements, however, Oz's main opponent in the primary — ex-hedge fund executive David McCormick — \"has a bevy of Trump advisers and influential figures working in his campaign and super PAC,\" including Dina Powell, a former Trump administration official, NBC News notes.",
    "Former President Donald Trump has said he plans to make another one of his valuable endorsements in PA, after his first choice Sean Parnell dropped out in the wake of domestic abuse allegations, and Melania's opinion might carry great weight.",
    "the other big endorsement\nIt looks like daytime-host-turned-Senate-candidate Dr. Mehmet Oz has a friend in Melania Trump, sources familiar with the former first lady's thinking told NBC News.",
    "Just \"don't underestimate the influence of the first lady,\" said a second Republican source, who reportedly often speaks with the former president.",
    "Meanwhile, Fox host Sean Hannity, who also \"frequently speaks to the former president,\" recently backed Oz on his radio show, writes NBC News.",
    "Melania Trump's supposed interest in Oz could prove crucial in the tight and already-contentious Pennsylvania Senate race, NBC News notes.",
    "Both Oz and McCormick are running to replace retiring Republican Sen. Pat Toomey, as are a number of other candidates.",
    "There are a lot of women, in whose living room and bedroom TVs Dr. Oz has been for a decade.",
    "And that matters,\" said a top Republican familiar with the conversation.",
    "\"But this isn't just about what Melania wants,\" the source added.",
    "\"The first lady has let the president know that she likes Dr. Oz.",
    "\"She normally doesn't weigh in, but she has here.",
    "They have a very personal relationship with Dr.",
    "\"There are a lot of Melanias out there.",
    "Read more at NBC News.",
    "And that matters.\"",
    "Oz.\""
  ]
}