{
  "id": 3673,
  "mediaId": 2658,
  "date": "2022-02-28",
  "headline": "6 House races to watch in Texas",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/02/28/6-house-races-to-watch-in-texas-00012219",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2504,
    2936,
    3267,
    3768,
    4322,
    4426,
    4662,
    1163,
    4977,
    5351
  ],
  "sentences": [
    "Yet Oz could be found in Florida this weekend along with more than a dozen other Republican Senate hopefuls, aiming to make an impression at the Conservative Political Action Conference.”\nEVERYTHING’S BIGGER IN TEXAS — “Debate between Texas GOP attorney general candidates got heated, even though incumbent Ken Paxton wasn’t there,” by James Barragán, Texas Tribune: “A debate between Republican Texas attorney general candidates turned into an all-out brawl Thursday as Land Commissioner George P. Bush and former Texas Supreme Court Justice Eva Guzman attacked each other, and U.S. Rep. Louie Gohmert targeted incumbent Ken Paxton, who declined to participate.”\nTHE KEYSTONE STATE — “No notes, same logo: Dr. Oz’s campaign is like his TV show,” by Marc Levy, The Associated Press: “Welcome to Oz’s campaign for U.S. Senate, where the celebrity heart surgeon and former host of daytime TV’s ‘Dr.",
    "But the 15-9 vote came with two Republicans voting no along with Democrats and after acrimonious debate.”\nGETTING IN — “Activist famed for Kavanaugh elevator confrontation to run for New York lieutenant governor’s race,” by Bill Mahoney, POLITICO New York: “Ana Maria Archila, a Queens activist who gained national attention in 2018 for confronting Sen. Jeff Flake in a Capitol elevator to protest Brett Kavanaugh’s appointment to the Supreme Court, will launch a campaign for lieutenant governor on Saturday.”\nBALLOT BATTLE — “Unlike Texas, new voter ID rules in Georgia didn’t cause surge in rejections,” by Mark Niesse, The Atlanta Journal-Constitution: “Since Texas introduced ID requirements for voting by mail, ballot rejections have spiked before next week’s primary election.",
    "Also running in the Democratic primary are former state Rep. Barbara Mallory Caraway, community organizer Arthur Dixon, 2020 Biden Texas state director Jane Hope Hamilton, former Dallas City Council member Vonciel Jones Hill, Cedar Hill School Board Member Keisha Lankford, Navy veteran Jessica Mason, former legislative staffer Abel Mulugheta and former Dallas County Constable Roy Williams Jr.\nTX-35: National progressives have rallied around Democrat Greg Casar in TX-35 open-seat primary, after Rep. Lloyd Doggett (D-TX) swapped districts to run in the new TX-37.",
    "Pat McCrory, former U.S. Rep. Mark Walker and Marjorie K. Eastman, a combat veteran who served in Iraq and Afghanistan, took turns going after Democratic President Joe Biden, their opponent Rep. Ted Budd (R-N.C.) and each other, as they made their cases for why Republicans should vote for them in the upcoming primary.”\nTHE MAP LINES — “Florida GOP splits amid DeSantis’ push to upend redistricting,” by Gary Fineout, POLITICO Florida Pro: “The main House panel handling redistricting on Friday advanced a new map that gives Republicans an additional two seats.",
    "Overall, 44 percent say they strongly disapprove.”\n“Asked whether they would prefer the next Congress to be in the hands of Republicans acting as a check against the president or in Democratic hands to support Biden’s priorities, 50 percent of adults say they would rather have Republicans in charge on Capitol Hill while 40 percent prefer the Democrats.”\n— The Republican State Leadership Committee released a pair of videos ahead of the State of the Union targeting Democrats in Colorado and Minnesota over inflation.",
    "Inside the confines of CPAC — a conference that provides a pulse read for the conservative movement — there was little sense that the former president was anything other than the center of attention.”\nCODA — HEADLINE OF THE DAY — “A semi-nude video, corruption allegations and a fatal crash roil GOP primary for Texas Railroad Commission” — Texas Tribune\nFollow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "They are backed in the case by lawyers for two conservative nonprofits.”\nPresidential Big Board\n2024 WATCH — “Donald Trump wins CPAC straw poll,” by Meridith McGraw and Natalie Allison, POLITICO: “At the annual gathering of conservatives in Orlando, former President Donald Trump delivered his strongest signal yet he plans to run for president again in 2024 — and if he does — a straw poll shows he has the support of a majority of Conservative Political Action Conference attendees.",
    "It wasn’t the first time, either: Trump has repeatedly told Scott he’d be great at the job and should challenge Mitch McConnell.”\nMIDTERM MESSAGING — “Post-ABC poll finds a deeply pessimistic nation, worried about the economy and Biden’s leadership,” by Dan Balz, Scott Clement and Emily Guskin, The Washington Post: “The poll finds Biden’s presidential approval rating at a new low, with 37 percent saying they approve of the job he is doing and 55 percent saying they disapprove.",
    "Oz Show’ is making his way around Pennsylvania in town hall-style settings that seem very much like the TV studio where he once presided.”\nPARTY PROBLEMS — “Trump tries to recruit Rick Scott for majority leader,” by Rachael Bade, POLITICO: “In a recent private meeting at Mar-a-Lago, Donald Trump made a personal pitch to Senate Republican campaign chief Rick Scott.",
    "Pompeo and Donald Trump Jr. tied for second with 6 percent support.”\n— “At CPAC, Trump delivers a reminder of his muscle,” by Meridith McGraw, POLITICO: “For all the chatter that Trump’s influence over the Republican Party is growing weaker, that others in the GOP tent are feeling more emboldened to break with him, there were few signs of it here.",
    "Trump won 59 percent support from attendees when asked their preference of potential 2024 presidential candidates, according to results released Sunday.”\n“When attendees were given a list of potential 2024 candidates that did not include Trump, DeSantis was the overwhelming favorite, with 61 percent support.",
    "Down the Ballot\nWEEKEND UPDATE — “How Orlando became the center of the universe for GOP Senate hopefuls,” by Natalie Allison, POLITICO: “Mehmet Oz has less than 90 days left before Pennsylvania Republican voters cast their ballots in one of the most contentious Senate primaries in the nation.",
    "DAY IN COURT — “Republicans seek to overturn Colorado’s candidate donation limits in federal court,” by Sandra Fish, The Colorado Sun: “Two Republican candidates have filed a federal lawsuit seeking to unwind Colorado’s 20-year-old campaign donation limits.",
    "Greg Lopez, who is running for governor, and state Rep. Rod Pelton, of Cheyenne Wells, who is running for state Senate, along with former Colorado Republican Party Chair Steve House are plaintiffs in the lawsuit against the Secretary of State’s Office.",
    "Days until the Texas primary: 1\nDays until the CA-22 special election primary: 536\nDays until the Indiana and Ohio primaries: 65\nDays until the general election: 253\nDays until the 2024 election: 981\nWant to receive this newsletter every weekday?",
    "“Two, we need to bolster the ranks of the Congressional Progressive Caucus.” Our Revolution, an offshoot of Sen. Bernie Sanders’ presidential campaign, has more than 50 volunteers involved in these three contests.",
    "Republicans have lined up behind two candidates in the crowded race: former Navy SEAL Morgan Luttrell and far-right activist Christian Collins, POLITICO’s Ally Mutnick, Olivia Beavers and Elena Schneider wrote.",
    "But preliminary data indicates a similar voter ID law in Georgia might not result in a dramatic increase in absentee ballot rejections here before the May 24 primary.”\nENDORSEMENT ALERT — California Gov.",
    "TX-11: The race to replace retiring Rep. Kevin Brady (R-Texas) has attracted some of the GOP’s biggest names, including House Minority Leader Kevin McCarthy and Rep. Marjorie Taylor Greene (R-Ga.).",
    "THE TAR HEEL STATE — “NC Republicans seek to differentiate themselves in first US Senate debate,” by Avi Bajpai, News & Observer: “Over the course of a little more than an hour, former N.C. Gov.",
    "Crenshaw’s acceptance of the 2020 election results put him at odds with his primary challengers, who echo Trump’s false claims that the vote was rigged, the Texas Tribune’s Andrew Zhang noted.",
    "“What has he really done to involve himself in these primaries?” His role is very limited and hard to even pin down,” Travis County GOP chair Matt Mackowiak told Score, referencing Trump.",
    "TX-03: Rep. Van Taylor (R-TX) is defending his House seat against a group of GOP challengers, including businessperson Suzanne Cassimatis Harp and former Collin County Judge Keith Self.",
    "TX-28: The Democratic primary match-up between Rep. Henry Cuellar (D-Texas) and progressive challenger Jessica Cisneros will be the most-watched House race on the ballot tomorrow.",
    "Both candidates are running to Taylor’s right and weaponizing his vote for a commission to investigate the Jan. 6 attack on the Capitol, the Texas Tribune’s Patrick Svitek wrote.",
    "While Cuellar has outraised his challenger, Justice Democrats, a progressive group, has spent more than $420,000 on TV, mail and digital ads via its independent expenditure arm.",
    "The high-profile Crenshaw is a Trump ally, but he isn’t exactly a loyalist, as POLITICO’s Olivia Beavers noted last year, and he’s cultivated his own army of youth activists.",
    "ON THE AIRWAVES — Save Missouri Values, a super PAC backing Missouri state Attorney General Eric Schmitt for Senate, is up with a new ad featuring Sen. Ted Cruz (R-TX).",
    "One is take out corporate Democrats, Democrats who are not 100 percent behind the Democratic platform,” Our Revolution Executive Director Joseph Geevarghese told Score.",
    "— Republican Senate candidates converged on CPAC in Florida over the weekend, taking advantage of the conservative gathering to boost their campaigns.",
    "‘You should run for Senate majority leader,’ he told the National Republican Senatorial Committee, according to a person familiar with the exchange.",
    "6 House races to watch in Texas\nBy STEPHANIE MURRAY\n02/28/2022 10:00 AM EST\nQuick Fix\n— The first primaries of the midterms are only a day away.",
    "The Democratic primaries: Progressives are hoping to finish one primary fight they started in 2020, and claim a pair of open seats on Tuesday.",
    "Under the old lines, Trump won Taylor’s district by 1 percentage point in 2020, but carried it by nearly 15 percentage points on the new map.",
    "TX-02: Rep. Dan Crenshaw (R-Texas) isn’t in danger of losing reelection, but he’s still an interesting candidate to watch on Tuesday night.",
    "The Republican primaries: Trump hasn’t backed GOP primary challengers to Texas congressional incumbents the way he has in other states.",
    "But his influence, and Trump-adjacent issues like the 2020 election and the Jan. 6 attack, loom large in the Lone Star state.",
    "TX-30: Rep. Eddie Bernice Johnson (D-Texas) opened up a crowded Democratic primary when she opted to retire from the House.",
    "— Former President Donald Trump still has a solid grip on the GOP, as he weighs whether to run for president again in 2024.",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "The map also dismantles the North Florida congressional seat now held by Rep. Al Lawson, a Black Democrat from Tallahassee.",
    "Also running are Democratic state Rep. Eddie Rodriguez and former San Antonio City Council member Rebecca Viagran.",
    "Every day and every event matters, especially to a candidate like him who only recently moved back to the state.",
    "Cruz, who endorsed Schmitt, delivers a direct-to-camera pitch for the GOP Senate hopeful in the 30-second spot.",
    "The former president’s energy has been more focused on statewide races for governor and state attorney general.",
    "Here’s a roundup of six key House races, three on each side, that could tell us where the midterms are headed.",
    "Cisneros came close to beating Cuellar when she ran against him in 2020, losing by fewer than 3,000 votes.",
    "You’ll also receive daily policy news and other intelligence you need to act on the day’s biggest stories.",
    "— Arkansas Republican Sarah Huckabee Sanders is airing a new 60-second ad for her gubernatorial campaign.",
    "This time around, Cisneros and her allies have seized on a recent FBI raid of Cuellar’s home in Laredo.",
    "The commercial ends with a photo of Sanders walking alongside Trump, who has endorsed her in the race.",
    "One thing to remember: Crenshaw’s seat became significantly more conservative during redistricting.",
    "Top Line\nPRIMARY SOURCES — The first big election of the 2022 midterm cycle is almost here.",
    "Rep. Alexandria Ocasio-Cortez (D-N.Y.) recently visited Texas to boost Casar and Cisneros.",
    "Sanders, the former White House press secretary, highlights her Arkansas roots in the ad.",
    "The primary races will give the first window into what voters are thinking this cycle.",
    "Johnson recruited and endorsed state Rep. Jasmine Crockett to replace her in Congress.",
    "Gavin Newsom endorsed Democrat Asif Mahmood against Rep. Young Kim (R-CA) in CA-40.",
    "The deep blue district encompasses parts of Austin and stretches to San Antonio.",
    "Email me at smurray@politico.com and follow me on Twitter at @stephanie_murr.",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "The ad will begin airing statewide today, with an initial buy of $500,000.",
    "There are 38 congressional districts on the ballot in Texas tomorrow.",
    "Trump won the district by 23 percentage points under the new lines.",
    "Redistricting made Taylor more vulnerable to a primary challenge.",
    "(Casar is a former member of the Austin City Council).",
    "We’ve got six House races to watch tomorrow.",
    "Crockett has the backing of Our Revolution.",
    "Subscribe to POLITICO Pro.",
    "“We have to do two things.",
    "Good Monday morning."
  ]
}