{
  "id": 375,
  "mediaId": 2569,
  "date": "2022-04-14",
  "headline": "Sunburn — The morning read of what’s hot in Florida politics — 4.14.22",
  "image": "https://floridapolitics.com/wp-content/uploads/2019/01/Sunburn-Orange-Tally-3-1.jpg",
  "link": "https://floridapolitics.com/archives/515632-sunburn-the-morning-read-of-whats-hot-in-florida-politics-4-14-22/",
  "mediaOutlet": "floridapolitics.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Schorsch",
  "authorUrl": "https://floridapolitics.com/archives/author/peterdschorsch/",
  "termIds": [
    1971,
    2359,
    2426,
    3901,
    4977,
    5053,
    5344
  ],
  "sentences": [
    "— DAYS UNTIL —\n‘Better Call Saul’ final season begins — 4; Magic Johnson’s Apple TV+ docuseries ‘They Call Me Magic’ begins — 8; ‘We Own This City’ premieres on HBO Max — 11; 2022 Florida Chamber Transportation, Growth & Infrastructure Solution Summit — 14; ‘The Godfather’ TV series ‘The Offer’ premieres — 14; 2nd half of ‘Ozark’ final season begins — 15; ‘Doctor Strange in the Multiverse of Madness’ premieres — 22; Florida TaxWatch’s Spring Meeting — 28; ‘Obi-Wan Kenobi’ starts on Disney+ — 42; ‘Top Gun: Maverick’ premieres — 43; ‘Platinum Jubilee’ for Queen Elizabeth II — 49; California, Iowa, Mississippi, Montana, New Jersey, New Mexico and South Dakota hold midterm Primaries — 54; ‘Thor: Love and Thunder’ premieres — 85; San Diego Comic-Con 2022 — 98; Michael Mann and Meg Gardiner novel ‘Heat 2’ publishes — 117; ‘House of the Dragon’ premieres on HBO — 129; ‘The Lord of the Rings’ premieres on Amazon Prime — 141; 2022 Emmys — 151; ‘Spider-Man: Into the Spider-Verse’ sequel premieres — 175; Cormac McCarthy’s ‘The Passenger’ releases — 194; Jon Meacham’s ‘And There Was Light: Abraham Lincoln and the American Struggle’ releases — 194; ‘Black Panther 2' premieres — 211; ‘Captain Marvel 2’ premieres — 211; ‘The Flash’ premieres — 216; The World Cup kicks off in Qatar — 221; The U.S. World Cup Soccer Team begins play — 221; McCarthy’s ‘Stella Maris’ releases — 222; ‘Avatar 2' premieres — 246; 2023 Legislative Session convenes — 327; ‘John Wick: Chapter 4’ premieres — 344; 2023 Session Sine Die — 386; ‘Ant-Man and the Wasp: Quantumania’ premieres — 470; ‘Dune: Part Two’ premieres — 554; Opening Ceremony of the 2024 Olympic Games — 834.",
    "“I know she will be a key asset that will provide a great blend of knowledge and passion to this role as we continue to fight and advocate for the constituents of this district and beyond.”\n— LOCAL NOTES: N. FL —\n“Marco Rubio stumps in Pensacola; advocates for burn pits health care bill for veterans” via Jim Little of the Pensacola News Journal — Speaking to reporters Tuesday at a campaign event in Pensacola, U.S. Sen. Rubio said a bill that will provide health care coverage for veterans exposed to toxic burn pits in war zones will get a floor vote in the Senate before August.",
    "In a news release issued by Sturgill’s campaign, Adams called him “a true conservative who recognizes the need to get government off the necks of the people.”\n“Shevrin Jones crosses $1M raised for Senate defense as old foe resurfaces to challenge him” via Jesse Scheckner of Florida Politics — Sen. Jones hit the ground running in fundraising following the Legislative Session, amassing more than $45,000 in less than two weeks through a mix of grassroots and corporate contributions.",
    "“County responds to 30A homeowner: Code violation of ‘Trump Won’ banners not ‘content-related’” via Jim Thompson of the Northwest Florida Daily News — Merely looking at two massive pro-Trump banners hanging from the side of a home on Walton County Road 30A should be enough to determine they violate county ordinance provisions limiting signage along the scenic beachside route, the county’s land-use counsel argued in a brief filed late last week in Circuit Court.",
    "— D.C. MATTERS —\n“The CDC extends the mask mandate on planes and public transit another two weeks.” via Heather Murphy of The New York Times — Despite great pressure from airlines, the hospitality industry and Republican lawmakers to lift the rule requiring masks on planes and trains, in airports and on some buses, the CDC said it would extend the federal transportation mask requirement for two weeks on Wednesday, five days before it was set to expire.",
    "Oz’s campaign to this point had not been smooth sailing — the Philadelphia Inquirer refused to call him “Dr.” Oz, which they called a commitment to fairness, and he called an attempt to “cancel” him; local activists spurned him; he recently sounded off to a Bloomberg reporter in a restroom about the media’s supposed failure to scrutinize his main rival, David McCormick — and so the endorsement looked like a boon.",
    "— ALOE —\n“Universal accused of ‘at least one’ patent infringement over Jimmy Fallon ride” via Gabrielle Russon of Florida Politics — An Austrian ride manufacturer suing Universal over the Race Through New York Starring Jimmy Fallon ride says it inspected the attraction for the first time last month and found Universal was infringing on “at least one claim” in each of its patents, according to new court documents.",
    "— MORE LOCAL: S. FL —\n“Venezuelan Democrats respond to Rubio statements in Doral: ‘We are proud Democrats’” via Bianca Padró Ocasio of the Miami Herald — A group of Venezuelan and other Latino Democrats protested in front of U.S. Sen. Rubio’s Miami-Dade office, following comments he made last week during a campaign stop in Doral where he dismissed criticism of his stance on immigration as partisan attacks.",
    "To watch the ad, click on the image below:\n“Michael Grieco collects $10K for SD 36 bid as Ileana Garcia skips March fundraising” via Jesse Scheckner of Florida Politics — Miami Beach Democratic Rep. Grieco dove right back into fundraising after the Legislative Session ended last month, collecting more than $10,000 toward his bid to unseat incumbent Miami Republican Sen. Garcia in Senate District 36.",
    "“Cuba has stopped accepting deportations of its nationals from the U.S., ICE says” via Nora Gámez Torres of the Miami Herald — The Cuban government has not been accepting deportations of Cuban nationals from the U.S. for more than six months, at a time when tens of thousands are leaving the island to reach the U.S. in the largest exodus since the 1980s Mariel boatlift.",
    "“Leon Co. Commission drafting resolution asking Legislature to protect Al Lawson’s district” via Tristan Wood of Florida Politics — The Leon County Commission voted unanimously to waive its rules and begin drafting a resolution asking the Legislature to protect the state’s minority access congressional districts ahead of the upcoming redistricting Special Session.",
    "“It’s bipartisan, but it doesn’t have unanimous support in either party.” The Florida Republican partnered with Democratic U.S. Sen. Kirsten Gillibrand of New York to introduce bipartisan legislation to have Veterans Affairs cover veterans’ health problems after being exposed to toxic pollution from burn pits common on U.S. military bases in Afghanistan and Iraq.",
    "— MORE LOCAL: C. FL —\n“Sarasota County ends economic development grant program, so Rumble won’t get county money” via Anne Snabes of the Sarasota Herald-Tribune — Sarasota County will stop awarding economic development incentive grants to businesses considering creating new jobs in the area, which means that the video platform Rumble won’t receive such money.",
    "Rubio, who has supported Temporary Protected Status for Venezuelans and asked the Biden administration for renewal, has come under fire from some Venezuelans for not backing an extension to the eligibility cutoff date for Venezuelans who arrived in the U.S. after March 9, 2021, and a path to citizenship for Venezuelans fleeing the Nicolás Maduro regime.",
    "The brief was filed in response to Seagrove Beach homeowner Marvin Peavy‘s appeal of a county citation for a massive banner hanging down three stories of his house reading “Trump Won” and an order that a second banner of the same size reading “Let’s Go Brandon” — a euphemistic insult to Biden — hung after he was cited for the first banner, be removed.",
    "“Appeals court bounces bars’ lawsuit over COVID-19 shutdown damages” via Gray Rohrer of Florida Politics — The 5th District Court of Appeal on Tuesday threw out a lawsuit brought by a group of Central Florida bars seeking damages after being shut down or limited in their businesses by emergency COVID-19 lockdown rules.",
    "—“Rebecca Bays adds $22K in March for HD 23 race” via Mike Wright of Florida Politics\n“Rene Plasencia endorses Robyn Hattaway in HD 30” via Scott Powers of Florida Politics — Canaveral Port Authority Commissioner Hattaway has received the endorsement of former Rep. Plasencia for her run in House District 30.",
    "Then ditch the politicians” via Scott Maxwell of the Orlando Sentinel — We have a trio of topics today, including an update on the investigation into dark money and a ghost candidate in Seminole County and an odd story about a Florida Congressman who voted against his own bill and claimed he didn’t know why.",
    "“State money to fix Nassau County road’s ‘excessive rutting’ problem” via Wes Wolfe of Florida Politics — Money secured by Nassau County’s departing delegation of Sen. Aaron Bean and Rep. Cord Byrd is going a long way toward a long-sought fix for a county road falling victim to flooding and shifting soils.",
    "“House candidate Rhonda Rebman Lopez breaks state campaign fundraising rules with event invite” via Jesse Scheckner of Florida Politics — Lopez broke Florida campaign fundraising rules with an invitation to a Wednesday campaign event listing Republican U.S. Rep. Brian Mast as a featured attendee.",
    "“Your tax dollars pay lawyers $675 an hour to defend unconstitutional laws” via Scott Maxwell of the Orlando Sentinel — Florida lawmakers keep getting smacked around by federal judges who say the politicians in Tallahassee treat toilet paper with more respect than the United States Constitution.",
    "“Joe Biden to unveil five new judicial nominees, bringing total to 90” via Sahil Kapur of NBC News — Biden plans to roll out five new judicial nominees on Monday, elevating two judges to federal circuit courts and picking three to serve on district courts, a White House official told NBC News.",
    "“I went through nine years, different drug treatment programs before I finally got it.” So as the case against Walgreens in Pasco County unfolds, where the state accuses its store in Hudson of increasing their order for opioids by 600% in a two-year period, Rouson is floored by that idea.",
    "“The misguided obsession over Donald Trump’s endorsements” via Jon Allsop of the Columbia Journalism Review — On Saturday, after months of local and national media speculation, former TV businessman Trump endorsed former TV doctor Mehmet Oz for an open U.S. Senate seat in Pennsylvania.",
    "— STATEWIDE —\n“Chief Justice Charles Canady says the courts are making a dent in case backlogs” via Mark D. Killian of The Florida Bar — Florida’s trial courts and the state’s lawyers are collaboratively working through the pandemic induced backlog of cases and progress is being made.",
    "“Former U.S. Rep. Sandy Adams endorses Scott Sturgill in CD 7” via Scott Powers of Florida Politics — Former U.S. Rep. Adams has endorsed Sturgill in the crowded Republican field for Florida’s 7th Congressional District, a Central Florida district that has lineage back to her tenure.",
    "“In preparing this proposal, the Governor’s Office has adhered to geographical and political boundaries whenever possible, and indeed did so at a greater rate than the Legislature’s primary map,” wrote Bryan Griffin, DeSantis’ Deputy Press Secretary, in an email to Florida Politics.",
    "— OPINIONS —\n“Now is not the time to reinstate mask mandates” via Leana S. Wen of The Wall Street Journal — The city of Philadelphia reinstated its indoor mask mandate on Monday, citing an increase in daily COVID-19 cases driven by the highly contagious BA.2 omicron subvariant.",
    "It is an honor to offer my support toward her campaign and stand behind her as a dear friend.” Amesty, vice president at Central Christian University, is one of several Republicans who have filed to run in HD 45, a newly drawn district covering southwestern Orange County.",
    "In the fiscal year 2022, which started Oct. 1, 20 Cubans returned voluntarily to the island, but the Cuban government “has not accepted any ICE removals via commercial or charter flights,” a spokesperson for U.S. Immigration and Customs Enforcement told the Miami Herald.",
    "“Two men from The Villages admit to casting multiple ballots in 2020 election” via Amanda Rabines and the Orlando Sentinel — Two residents from The Villages confessed to voter fraud charges after filing two ballots in the 2020 Presidential election, court records show.",
    "Great staff – make sure to stop by: https://t.co/n6iTc7VvrP pic.twitter.com/1Df6fg0ttK\n— Ron DeSantis (@GovRonDeSantis) April 13, 2022\n—@EvanDonavan: Odd phrasing from (Charlie) Crist here — “When I said pro-life, I’m still pro-life, meaning I’m for life.",
    "“Legislator who fought addiction watches trial against Walgreens” via Trevor Pettiford of Spectrum News 9 — When State Sen. Darryl Rouson isn’t fighting for his constituents in Tallahassee, he says he’s fighting his addiction to opioids and other drugs.",
    "For the past decade, Fiveash — a 62-year-old part-time bakery worker from Milton — and a couple of other divorcees have driven 200 miles across the Panhandle to the state Capitol to protest measures like SB 1796, approved last month by the Legislature.",
    "— 2022 —\n“Nikki Fried talks affordable housing at Tallahassee campaign stop” via Tristan Wood of Florida Politics — Fried held a news conference Wednesday outside a controversial Tallahassee mobile home park to discuss affordable housing in the state.",
    "Judges from both sides of the aisle have shot down the Governor’s and Legislature’s attempts to manipulate election laws, control privately funded social media operations and imprison citizens who donate to political causes the politicians dislike.",
    "“When I say I’m pro-life, I mean I’m for life and I’m for a woman’s right to choose and make her own decisions about her body.”\n—@TonyDungy: 2 days ago, I spoke on behalf of a Florida bill that supports dads & families and it offended some people.",
    "“Carolina Amesty scores Aurélien Collin endorsement in HD 45” via Drew Wilson of Florida Politics — Republican Amesty on Wednesday announced that former Orlando City soccer player Aurélien Collin has endorsed her campaign for House District 45.",
    "“It really, really — it makes a big difference for those folks out there to get the road fixed.” The Nassau County Board of County Commissioners awarded Preferred Materials the asphalt services contract for paving County Road 121 in March 2021.",
    "“I am pleased to report on this occasion the state of our court and of the Florida judiciary is strong,” Canady told a full house in brief remarks at the event that was held in person for the first time since the onset of the pandemic in 2020.",
    "The County Commission’s decision came after backlash from many community members to the board’s plan to give grant money to Rumble, a video platform that has continued broadcasting the Russian state news channel RT during the war in Ukraine.",
    "Ron DeSantis submits map he wants to pass in Special Session” via Jacob Ogles of Florida Politics — Sen. Ray Rodrigues, an Estero Republican and Chair of the Senate Reapportionment Committee, said he was briefed on the submission (P 0109).",
    "And as an openly queer father with a child in elementary school, Salazar also felt a siren call to the race after the Legislature passed a controversial “Parental Rights in Education” law, derided by critics as the “Don’t Say Gay” bill.",
    "As stated on the Division of Elections website, any political advertisement paid for by a candidate that is published, displayed or circulated before an election must include a disclaimer denoting the candidate’s political affiliation.",
    "According to the pre-trial intervention documents, the prosecution of Barnes, 64, and Ketcik, 63, will be deferred if they abide by a series of court-ordered requirements set by the office of Ocala-based State Attorney Bill Gladson.",
    "— SITUATIONAL AWARENESS —\n—@MappingFL: Ron DeSantis‘ latest map is drawn to make #FL10 a Democratic vote-sink, but it doesn’t even consolidate Orange County’s Black population, and as a result, the primary is plurality White.",
    "We’re going to do the same thing with our streetcar ridership.” The Hillsborough Area Regional Transit Authority (HART) announced Tuesday that Tampa’s streetcar service had its busiest month in close to 20 years of service.",
    "—TOP OPINION —\n“The final pandemic betrayal” via Ed Yong of The Atlantic — The number of people who have died of COVID-19 in the United States, as the CDC and other official sources suggest, will soon surpass 1 million.",
    "“Divisive alimony bill on third trip to Florida Governor’s desk; critics point to cash pipeline” via James Call of the Tallahassee Democrat — Camille Fiveash is among thousands of divorced women waiting to see what Gov.",
    "Some of those big bills were paid in the case where DeSantis and GOP legislators tried to make it illegal for you to donate more than $3,000 to any grassroots efforts to get an amendment proposal on the Florida ballot.",
    "“She is a strategic communicator who knows how to craft stories, so they are visual, newsworthy, and compelling.”\nPoe is a former news producer and comes to Sachs Media after four years at WJAX-TV in Jacksonville.",
    "The CDC cited the spread of the Omicron subvariant of the coronavirus known as BA.2, which the agency said now makes up more than 85% of new U.S. virus cases, in its decision to continue the mask requirement.",
    "“Dems retreat on crime and police reform” via Holly Otterbein and David Siders of POLITICO — Biden proclaims that it’s time to “fund the police” and pouring more money into law enforcement in his budget plan.",
    "“This isn’t Vladimir Putin’s inflation” via The Washington Post editorial board — White House aides were out in force on Monday warning that Tuesday’s inflation report would be ugly and blaming it on Putin.",
    "DeSantis has elevated social issues in a way that Florida hasn’t experienced in recent memory, as highlighted by bills he supported that are now landing on his desk following the 60-day Legislative Session.",
    "According to a new survey conducted by the National Retail Federation, American shoppers who plan to celebrate Easter will spend a combined $20.8 billion this year — that’s an average of $167.69 per person.",
    "Wilkens, who owns Bannerman Nutrition in Bannerman Crossings on Thomasville Road, told the Tallahassee Democrat that he plans to open a Fazoli’s restaurant in the summer but has not yet selected a location.",
    "If Curry were to launch a congressional campaign, he would begin as the instant front-runner assuming the Governor gets his way — he will — and lawmakers approve a “race-neutral” seat in Northeast Florida.",
    "That truism has not always guided political campaigns in our history, but to paraphrase Damon Runyon: the race is not always to the smartest, nor the battle to the principled … but that’s the way to bet.",
    "“Vicki Lopez jumps into SD 38 race with mostly self-funded $52K springboard” via Jesse Scheckner of Florida Politics — Lopez had just six days to fundraise after launching her campaign in late March.",
    "He plans to nominate Stephen Henley Locher to the Southern District of Iowa, Nancy L. Maldonado to the Northern District of Illinois, and Gregory B. Williams to be district court judge in Delaware.",
    "That’s the message Chief Justice Canady delivered in his annual state of the judiciary commentary at the Supreme Court Historical Society’s annual Supreme Evening event on April 7 in Tallahassee.",
    "Some of the top activities for the weekend include cooking a holiday meal (56%), visiting family and friends (51%), going to church (37%), watching TV (33%) and planning an Easter Egg Hunt (32%).",
    "“Anthony Sabatini cheers DeSantis map for helping Republicans” via Jacob Ogles of Florida Politics — Not everyone is happy with how a Special Session on redistricting appears to be shaking out.",
    "“Eleuterio Salazar Jr., gay father and local activist, filed for HD 70 contest” via Jacob Ogles of Florida Politics — Salazar Jr. thought he’d be running for a Soil and Water Conservation job.",
    "Inside plan to bring Fazoli’s back to Tallahassee” via TaMaryn Waters of the Tallahassee Democrat — A social media post is dropping major hints that Fazoli’s will be returning to Tallahassee.",
    "County Commissioners voted to end the incentive grant program on Tuesday, as they said they see flaws in the program and concluded it’s no longer needed in the current economic environment.",
    "“Tampa’s TECO Line Streetcar has busiest month ever with 108K rides in March” via Daniel Figueroa of Florida Politics — Only one city in the U.S. outpaces Tampa for its streetcar ridership.",
    "Before working at WJAX-TV, she worked as a news producer and photographer at WCIV-TV in Charleston, South Carolina, where she shot and edited news stories that aired locally and nationwide.",
    "Lauren Book announces five-figure ad buy in SD 35 — Senate Democratic Leader Book’s campaign announced a five-figure digital ad buy on Wednesday as the race for Senate District 35 heats up.",
    "Court records show the men will avoid further punishment if they regularly meet with a supervising officer, complete 50 hours of community service, and attend a 12-week adult civics class.",
    "DeSantis rose to fame fighting COVID-19 restrictions but lately has become the face of the GOP’s efforts to push back against liberal cultural values, particularly race and LGBTQ issues.",
    "Her motion specifically calls for the resolution to back maintaining Florida’s 5th Congressional District, which includes a chunk of the county and is currently held by Rep. Al Lawson.",
    "“Floridians are excited about springtime, and shopping for Easter festivities is the perfect way to celebrate,” said Scott Shalley, president and CEO of the Florida Retail Association.",
    "Until he resigned last month, Plasencia, of Orlando, represented much of the area now included in the newly drawn HD 30 for three terms, and she had campaigned for his past elections.",
    "Charles F. Barnes and Jay Ketcik pleaded guilty to casting more than one ballot in an election, a third-degree felony that could have resulted in a maximum five-year prison sentence.",
    "If 2020 was the year progressives reordered the traditional politics of crime and policing, 2022 looks like the year centrists are regaining their footing and nullifying those gains.",
    "What that means in 2022 is that Republican candidates who intend to run on simply reminding voters of the Democrats’ numerous policy missteps and blunders are making a sucker’s bet.",
    "— DATELINE TALLY —\n“COVID-19 crusader DeSantis gets new title: Chief of ‘woke’ police” via Zac Anderson of the Sarasota Herald-Tribune — Jeb Bush was the education reform Governor.",
    "Several other political observers and operatives in Northeast Florida confirmed that Curry is considering running for the still-to-be-drawn district covering the Jacksonville area.",
    "“Tell every flag-waving American in the country to stay vigilant and to keep their eye on the Legislature and make sure they do the right thing and follow through,” Sabatini said.",
    "The motion, made by Commissioner Kristin Dozier, asks city staff to draft a motion showing the county’s support for protecting Black access congressional districts in the state.",
    "The Tallahassee-based agency, which has offices across the state, said Poe will work with its full range of clients, focusing on industries including nonprofits and health care.",
    "That number — the sum of a million individual tragedies — is almost too large to grasp, and only a few professions have borne visceral witness to the pandemic’s immense scale.",
    "Lauren Book: mom, leader, fighter.” Book, who has held the current SD 32 since 2016, is moving to avoid a contest against Sen.-elect Rosalind Osgood in the newly drawn SD 32.",
    "Her hands-on understanding of how the media works and what makes for a great story will be a terrific value to our clients,” said Michelle Ubben, president of Sachs Media.",
    "Fifty percent of holiday shoppers plan to purchase gifts at discount stores, while 41% will shop at department stores, and 35% will purchase Easter eggs and more online.",
    "Personnel note: Frederica Wilson taps Karol Molinares for Communications Director — U.S. Rep. Wilson announced Molinares would serve as her new Communications Director.",
    "He’s thinking about it.” via Peter Schorsch of Florida Politics — Curry’s next stop may be Washington, according to those in the second-term Republican’s inner circle.",
    "Each American who died of COVID-19 left an average of nine close relatives bereaved, creating a community of grievers larger than the population of all but 11 states.",
    "His sole opponent in SD 34, former Democratic Miami Gardens Council member and Vice Mayor Erhabor Ighodaro, raised about $33,000 since entering the race in February.",
    "Last month marked a milestone in this election cycle for Jones, a West Park Democrat who is moving south to run for re-election in a reconfigured Senate District 34.",
    "The resolution approved Tuesday night unanimously allows Preferred Materials to receive its contracted $147,696 to stabilize the road’s “excessive rutting” problem.",
    "Because asking politicians to fairly choose their own districts works about as well as asking a flock of turkey vultures to equitably split up a pile of roadkill.",
    "State and local elected officials criticized the owners of Sun Estates earlier this year after they doubled rent and enacted controversial policy changes in 2021.",
    "Fried was flanked at the podium by former residents of the property and Tallahassee City Commissioner Jack Porter, who has supported residents through her office.",
    "Nearly two-thirds of shoppers told NRF they’d pick up some gifts, while 49% said they’d buy clothes, and 48% said they were in the market for Easter decorations.",
    "Less than two months ago, the CDC laid out new masking recommendations that changed the primary measurement from cases to hospitalizations and hospital capacity.",
    "Sabatini, one of seven GOP members of the Florida House to vote against a map approved by the Legislature, cheered a decision to leave cartography to DeSantis.",
    "___\nSachs Media has expanded its team with the addition of former television journalist Kayla Poe, who joins the firm as an account executive in Jacksonville.",
    "“Karol is a Miami native with tested communications experience and a strong Florida background, and I am thrilled to welcome her to our office,” Wilson said.",
    "Under normal circumstances, 10% of bereaved people would be expected to develop prolonged grief, which is unusually intense, incapacitating, and persistent.",
    "As a producer, she contributed to an increase in ratings in the age 25-54 demographic and helped create a strategy that made the station’s morning show No.",
    "Assignment editors — Crist will take questions at the campaign’s first Town Hall event, 7 p.m., St. Lucie County Town Hall, RSVP at press@charliecrist.com.",
    "The disclaimer states in small print: “Paid for by Rhonda Rebman Lopez Candidate for Florida House District 120.” That’s a clear violation of state rules.",
    "By shopping local during the Easter season, you help support small businesses in your community.”\nThe impact of inflation has affected shopping behavior.",
    "“The COVID orders represented a valid use of the state’s police power to protect the general welfare,” reads the ruling, written by Judge James Edwards.",
    "Molinares brings over 10 years of political experience and will oversee Wilson’s communications staff at both the district and Washington D.C. offices.",
    "Head bowed, Steve Wilkens posted a selfie wearing a Fazoli’s cap and shirt with a caption reading, “Whoops, I did it again … Coming soon,” on his page.",
    "Book is instead running for the new Senate District 35, where she faces former Broward County Commissioner Barbara Sharief in the Democratic Primary.",
    "“Rick Scott’s plan is a foundation for Republican victory and governance” via David McIntosh of The Hill — You can’t beat something with nothing.",
    "The White House was right about the consumer-price index, which rose 1.2% in March, the highest monthly rise since the current inflation set in.",
    "Though the uptick in cases is important to keep an eye on, I believe it was premature for the local government to reimpose a mask requirement.",
    "That’s why Florida should look at what Arizona did to neuter the influence of politicians on this process by removing them from it altogether.",
    "“Lauren has taken on dangerous predators to protect children and led the fight against Republican efforts to limit women’s rights in Florida.",
    "Dynamic Motion Group filed a lawsuit last year in Orange Circuit Court that was re-filed this week in U.S. District Court’s Orlando division.",
    "Edwards was joined in the decision by the other two members of the three-judge panel hearing the case: Judges Kerry Evander and John Harris.",
    "The property, renamed Florida Sun Estates when new owners purchased it, was the third stop in Fried’s “Lower costs, Higher standards” tour.",
    "“The damage to Dynamic Motion is irreparable by monetary damages alone,” said Dynamic, the parent company of DyMoRides, in the new lawsuit.",
    "The remainder came from Donald Wolfe III, a former aide to Miami-Dade County Commissioner Xavier Suarez who now advises the city of Miami.",
    "But she made sure to put in plenty of her own cash, stacking $52,000 toward her bid for the vacant seat representing Senate District 38.",
    "This map has 20 seats where Republican Donald Trump won the 2020 Presidential Election, and just eight seats won by Democrat Joe Biden.",
    "“Lenny Curry is definitely interested in running for Congress,” according to a source especially familiar with the Mayor’s thinking.",
    "As of March 31, Grieco had about $192,000 between his campaign account and political committee, Strong Leadership for South Florida.",
    "Garcia, meanwhile, took the remainder of March off from adding to her campaign coffers and spent nearly the same sum Grieco gained.",
    "COVID-19 has become the third most common cause of death in the U.S., which means that it is also the third leading cause of grief.",
    "The proposal ends what is known as permanent alimony, reopening marital settlement agreements that have been in place for decades.",
    "“Every time it rains, people on social media, they’re ‘marked safe’ from County Road 121,” County Commissioner Thomas Ford said.",
    "Circuit Court of Appeals, and Salvador Mendoza Jr., a district court judge in Washington, to the 9th Circuit Court of Appeals.",
    "Hattaway is running against Port Orange City Council member Chase Tramont in the August Republican Primary Election for HD 30.",
    "The survey found four out of five Americans plan to celebrate the holiday, and more than half of them plan to do so in person.",
    "“Lauren Book, unanimously elected by Senate Democrats to lead the fight in Tallahassee,” a narrator says in the 15-second ad.",
    "Sunburn is authored and assembled by Peter Schorsch, Phil Ammann, Daniel Dean, Renzo Downey, Jacob Ogles, and Drew Wilson.",
    "Additionally, 42% of those polled said they’d comparison shop to get the best price on the items on their shopping lists.",
    "She entered the race in mid-March and, in two weeks, raised about $45,000 in donations and lent $200,000 to her campaign.",
    "He noted state action to prevent the sale of fireworks during the drought, and rampant wildfires of 1998 was also upheld.",
    "Records the First Amendment Foundation obtained show Florida has paid lawyers $425 an hour and as much as $675 an hour.",
    "So that the staff of Florida Politics can fully enjoy the Easter holiday, there will be no Sunburn on Friday or Monday.",
    "“When you’re preparing your Easter baskets and hiding treats for the annual egg hunt, remember to Find it in Florida.",
    "For COVID-19 grievers, that proportion may be even higher because the pandemic has ticked off many risk factors.",
    "You’ve probably seen how Florida Republicans are fighting with each other over the state’s redistricting plan.",
    "Inflation is impacting some shoppers’ plans, with half saying they’ll make their purchases at discount stores.",
    "His March haul put him over the $1 million mark in funds raised since he won his Senate seat in November 2020.",
    "More disrespect to the Black community of Florida\n—@MarcEElias: If this map is enacted, Florida will be sued.",
    "Sabatini, a candidate for Congress, went on to talk about the maps with Bannon in explicitly partisan terms.",
    "Fortunately, a smart, principled agenda for Republican candidates has been crafted by Republican Sen. Scott.",
    "As it happens, the same Session when soil boards came into lawmakers’ sights was also a redistricting year.",
    "Walgreens, with more than 9,000 outlets on street corners throughout the country, says it will not settle.",
    "Florida shoppers are looking on the sunny side for their Easter celebrations and focusing on cost savings.",
    "“I’m 24 years, 25 days clean now through the grace of God in a 12-step program of recovery,” Rouson said.",
    "Several parts of the invitation are questionably worded, but the disclaimer at the bottom skirts the law.",
    "Even in liberal bastions like Los Angeles, candidates are sprinting to claim the tough-on-crime mantle.",
    "But inflation didn’t wait to appear until the Ukraine invasion, and by now, it will be hard to reduce.",
    "Twice, Fiveash and an ad hoc group, which the media dubbed a “First Wives Club,” convinced then-Gov.",
    "The only potential roadblocks are how life as a Congressman would affect his family and business.",
    "It’s a thoughtful, forward-thinking agenda that can help Republican candidates win the midterms.",
    "Lawmakers are barred from fundraising during the Legislative Session, which ended on March 14.",
    "Another 41% said they’ll do some shopping at department stores, while 35% plan to shop online.",
    "Tweet, tweet:\nEnjoyed a fresh grouper Reuben sandwich at Half Shell Dockside in Apalachicola.",
    "The ruling upheld a Central Florida circuit court’s decision to dismiss the lawsuit in 2021.",
    "The Legislature is set to reconvene during a Special Session to finalize the maps after Gov.",
    "Nine out of 10 of those lists will include candy, with food following close behind at 88%.",
    "Instead, legislation passed this year severely limited who could hold that volunteer job.",
    "Now, he’s gunning for a seat in the same Legislature that took that opportunity away.",
    "But Rep. Sabatini went on right-wing activist Steve Bannon’s show and celebrated it.",
    "Biden is nominating John Z. Lee, a district court judge in Illinois, to the 7th U.S.",
    "“My understanding is that we’re going to get a floor vote on our bill,” Rubio said.",
    "More than 46,000 Cubans arrived at the U.S. border with Mexico in the same period.",
    "DeSantis does with a contentious alimony overhaul bill that is headed to his desk.",
    "Democratic Mayors in deep-blue cities are promising to hire hundreds more cops.",
    "The conference comes as rent prices are skyrocketing in Florida and nationwide.",
    "Salazar said he can’t ignore an opportunity into which he was literally drawn.",
    "In the last 12 months, the price rise hit 8.5%, the fastest rate in 40 years.",
    "“She is an experienced leader and prioritizes the importance of education.",
    "The event will be livestreamed on Crist’s Facebook page (@CharlieCristFL).",
    "Scott to veto similar measures the Legislature approved in 2013 and 2016.",
    "“And we know what we did to Kansas City when they came to the Super Bowl.",
    "Scott’s “Plan to Rescue America” is a potential game-changer for the GOP.",
    "But they are one among many and should not be driving this much coverage.",
    "Toronto-based Rumble is setting up its U.S. headquarters on Longboat Key.",
    "The Easter Bunny is bringing baskets full of cash to Florida retailers.",
    "DeSantis vetoed a map approved by both chambers at the end of Session.",
    "The former Lee County Commissioner directly lent her campaign $50,000.",
    "Nearly 108,000 riders took trips on the 2.7 miles of track in March.",
    "He spoke at length on the issue on Steve Bannon’s War Room podcast.",
    "It’s in the wrong format and illegally omits party identification.",
    "2 only behind Kansas City,” she said of Tampa’s ridership numbers.",
    "But that’s just for now, as far as Mayor Jane Castor is concerned.",
    "The five additions bring Biden’s total to 90 judicial nominations.",
    "I am serving the Lord, so I’ll keep supporting dads and families.",
    "“Kayla brings a great perspective as a television news producer.",
    "The mask mandate is now extended through May 3, the agency said.",
    "1 candidate for the Florida House District 45,” Collin said.",
    "This happens every decade among both parties in most states.",
    "“No one is telling him, ‘No, don’t run,’” one source said.",
    "Endorsements can be an indicator of political influence.",
    "ago, Pres Obama said the same things almost verbatim.",
    "Her business, VLL Consulting, gave another $1,000.",
    "All but $1,000 of that sum came from a self-loan.",
    "“Sick of the politics in Florida’s redistricting?",
    "Happy Easter from our little chickee, Ella Joyce.",
    "But let’s start with a hot topic: redistricting.",
    "Then there’s DeSantis, chief of the woke police.",
    "No doubt that beats blaming your own policies.",
    "I’m assuming people were outraged at him too.",
    "Trump won Florida by three percentage points.",
    "He said it’s one the Florida Senate can pass.",
    "“Bottomless breadstick baskets coming back?",
    "Rick Scott was all about jobs, jobs, jobs.",
    "Crist campaigned on pocketbook issues.",
    "We will resume publication on Tuesday.",
    "I hope most people are …” Crist said.",
    "Other cities should not follow suit.",
    "Garcia held more than double that.",
    "“Carolina Amesty is the No.",
    "“Lenny Curry for Congress?",
    "Good Thursday morning.",
    "— TOP STORY —\n“Gov.",
    "1 in the market.",
    "14 yrs.",
    "Why?",
    "“No."
  ]
}