{
  "id": 3969,
  "mediaId": 6746,
  "date": "2022-02-27",
  "headline": "New York City Mayor Eric Adams Teases Removal of COVID-19 Vaccine Mandate; But Why Will It Happen Next Week?",
  "image": "https://1075914428.rsc.cdn77.org/data/images/full/269260/new-york-city-mayor-eric-adams-teases-removal-of-covid-19-vaccine-mandate-but-why-will-it-happen-next-week.jpg",
  "link": "https://www.hngn.com/articles/240818/20220227/new-york-eric-adams-new-york-covid-19-vaccine-mandate-covid-19-vaccine-mandate.htm",
  "mediaOutlet": "hngn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Renz Soliman",
  "authorUrl": "https://www.hngn.com/reporters/renz-soliman",
  "termIds": [
    0
  ],
  "sentences": [
    "Read Also: Scientists Engineer Synthetic Coronavirus To Study SARS-CoV-2 Innate Mechanisms Better To Devise Countermeasures\nAccording to NBC New York, Mayor Adams put the mandate in place to curb the spread of the coronavirus in the city and is now being pulled back in a crucial moment in the pandemic.",
    "Adams noted that the potential removal of the vaccine mandate will allow businesses the time to adapt and give authorities the chance to make the best public health decision for the people of the region.",
    "Furthermore, New York City's COVID indicators will also be removed along with the vaccine mandate and the mayor's team reviewed them before they officially announced the end of the vaccine mandate.",
    "New York City Mayor Eric Adams teased on Twitter about the planned end to the region's vaccine mandate that will affect indoor businesses, dining, and events in the next coming days.",
    "Her remarks followed guidance from the U.S. Centers for Disease Control and Prevention (CDC) that said most residents can stop wearing masks, including students, in school.",
    "Vaccine Mandate\nAdditionally, schools will have their indoor mask mandate lifted on the same day so long as there are no unexpected coronavirus cases spikes, said Adams.",
    "The state of New York has roughly 2.7 million children in school that the mandate applies to, including children two years and older who are in childcare facilities.",
    "She said that New York counties and cities can continue to keep their own mandates and parents still had the option of sending their kids to school wearing masks.",
    "Hochul added that she will continue to stick with experts and health data as her guide in making decisions for public health guidance, The Guardian reported.",
    "Related Article: Dr. Mehmet Oz Says Dr. Anthony Fauci Misleads Americans, Decries COVID-19 Mandates After Chief Adviser Expresses Concern on Taking Off Masks",
    "In their discussion, Adams said that a decision for city schools would not come until Friday after students in the region return from a week-long vacation.",
    "Adams did not mention any details regarding the removal of the mandate that requires all private-sector workers to be vaccinated in New York City.",
    "The mandate was first announced in August and required any person who wanted to dine or attend an indoor event to be vaccinated, as per NBC News.",
    "The official made an announcement on Sunday that his administration was in talks to end the city's vaccine mandate requirements on Monday, Mar.",
    "Kathy Hochul was the one who announced the planned removal of the mask mandate in schools that would take effect on Wednesday.",
    "Hochul said that the CDC's guidance was the reason authorities were feeling very confident about lifting the mask mandates.",
    "He is the most recent public official to make similar decisions in cities such as Seattle and Boston in the past few weeks.",
    "But with the official announcement, the city's vaccine requirement will still be in place for people who are working.",
    "1, 2020 marks the day, two years ago, when New York City recorded its first case of the coronavirus.",
    "In his announcement, the mayor said New York City's infections continue to trend downward every day.",
    "The governor said that Adams consulted her before her announcement.",
    "7, as long as coronavirus cases continued to decrease.",
    "Masks in School\nGov.",
    "Mar."
  ]
}