{
  "id": 405,
  "mediaId": 2629,
  "date": "2022-04-20",
  "headline": "Suddenly GOP Is On Defensive In Senate 2022 Campaign",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMjgwNTkzNy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwNTA1NjU2MH0.4TAEfOG_x6geAXzrZpY9Zt7s735Auhg5BQVBQuCMEzY/img.jpg?width=1200&coordinates=0%2C80%2C0%2C80&height=600",
  "link": "https://www.nationalmemo.com/republicans-2657185134",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1684,
    3434,
    3834,
    4397,
    305,
    873,
    878,
    1171,
    5199,
    5402
  ],
  "sentences": [
    "“While Senate Democrats have a favorable map and strong incumbents, Senate Republicans have suffered a series of recruitment failures, and their flawed candidates are locked in vicious, expensive intra-party fights,” David Bergstein, Democratic Senatorial Campaign Committee spokesperson, told The Hill.",
    "One thing that jumps out immediately is the fact that the New Hampshire seat held by Democratic Sen. Maggie Hassan is nowhere to be found on either list, which is likely due to Minority Leader Mitch McConnell's misfire on recruiting the state's popular Republican governor, Chris Sununu, to run.",
    "In terms of pickups, Republicans appear to be betting the farm on Georgia, where they are saddled with Trump-backed political neophyte and alleged wife abuser Herschel Walker.",
    "Another revelation given a political environment that supposedly favors Republicans by a lot is the fact that they are playing a whole lot of defense to save GOP-held seats.",
    "The 2022 Senate map is taking shape after outside groups for both parties placed initial ad buys for their top targets totaling nearly a quarter of a billion dollars.",
    "In both states, Trump’s meddling has complicated the path for Republicans (not to mention the Trump effect in North Carolina, Arizona, Nevada, and Ohio).",
    "Also, don’t sleep on Ohio, Florida, or North Carolina, where Democrats are fielding strong candidates who could potentially capitalize on GOP missteps.",
    "Democrats are protecting three incumbents in Georgia (Sen. Raphael Warnock), Arizona (Sen. Mark Kelly), and Nevada (Sen. Catherine Cortez Masto).",
    "(It does not include Alaska, where Senate Republicans are mainly defending Sen. Lisa Murkowski against Trump-inspired primary challenges.)",
    "Amid all that defense, GOP Senate Leadership Fund President Steven Law is talking up what a “strong” environment it is for Republicans.",
    "The GOP-aligned Senate Leadership Fund super PAC dropped a record-breaking early investment of $141 million centered on seven states.",
    "Democrats clearly see their best pickup opportunity in Pennsylvania, where Trump recently endorsed fellow TV huckster Dr. Mehmet Oz.",
    "For the GOP, that figure includes open Senate seats in Pennsylvania and North Carolina, plus Sen. Ron Johnson’s seat in Wisconsin.",
    "“All of these factors have contributed towards putting the GOP on defense in Senate races.”\nYep, that about covers it.",
    "In fact, at $66 million, Republicans are spending roughly the same as Democrats are to defend seats: $68 million.",
    "“This is such a strong year that we need to invest as broadly and deeply as we can,” Law told Politico.",
    "Both parties will surely invest more money later, but below is how the top tier generally shakes out.",
    "Democrats' Senate Majority PAC booked ad reservations totaling $106 million in five states.",
    "Published with permission from DailyKos.",
    "campaign 2022"
  ]
}