{
  "id": 4083,
  "mediaId": 2641,
  "date": "2022-02-26",
  "headline": "Dr. Oz to Newsmax: DC Politicians Lack Values of Their Constituents",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=1badec0a-d889-40aa-85b4-349053859391&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/dr-mehmet-oz-oprah-pennsylvania-senate/2022/02/26/id/1058648/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Koutsobinas",
  "authorUrl": "",
  "termIds": [
    2232,
    4491,
    715,
    5239
  ],
  "sentences": [
    "\"When Republicans, and conservatives, in particular, hear that we have to challenge why Washington is getting it wrong and if you really dig into why they're getting it wrong, with the economy, and with schools, and brainwashing our children, and the border, which is basically a cartel-run human trafficking operation, as well as catastrophes overseas, it comes down to values,\" Oz said.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nSpecial Links:",
    "\"We're speaking to the reality that we have in authoritarian overreach by the federal government; that does not make us safer,\" Oz told host Tom Basile.",
    "Dr. Mehmet Oz told Newsmax on Saturday that politicians in Washington, D.C., do not hold the same values as Pennsylvania's electorate.",
    "Oz told Saturday's \"America Right Now\" the reason why he is ahead in the polls for Pennsylvania's senate race is due to \"the message.\"",
    "According to a Trafalgar Group, Oz was shown to be leading in the polls with a 27.4% approval rating among those polled.",
    "The poll was conducted from Feb. 16 to Feb. 17 and surveyed 600 GOP primary voters, 27% of which were undecided.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "The closest candidate behind Oz was David McCormick, who showed a 16% approval.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "102, Mediacom Ch.",
    "615, Frontier Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}