{
  "id": 4156,
  "mediaId": 2644,
  "date": "2022-02-28",
  "headline": "Scott Peterson juror ‘Strawberry Shortcake’ breaks down over misconduct allegations",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/richelle-nice-scott-peterson-03.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/28/scott-peterson-juror-richelle-nice-breaks-down-over-misconduct-allegations/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marjorie Hernandez",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "When asked if she had any bias against Peterson when she was selected as a juror in his case, Nice replied, “Nope.”\nThe prosecutor asked, “Did you decide the case based on just the evidence that was in the courtroom and not some preconceived notion that you brought with you?”\nNice replied, “Absolutely.”",
    "Former Scott Peterson juror Richelle Nice says she’s no ‘victim’ during hearing\nThey claim Nice, who later co-authored a book about the case — and now has brunette locks with blond highlights — was biased against Peterson and lied to get on the jury.",
    "On Friday, Harris had asked Nice how she responded to the question that asked, “Have you ever been a victim of a crime?”\nNice had responded “No” to that question — and testified Friday that she did not consider herself a victim.",
    "On her second day on the stand in a San Mateo, Calif., courtroom, Nice was overcome with emotion when Peterson’s lawyer Pat Harris asked her about a letter she wrote the convict while he was on death row.",
    "Richelle Nice — dubbed “Strawberry Shortcake” for her flaming red hair at trial — is under fire from the convicted killer’s lawyers, who are demanding a retrial on the grounds of alleged juror misconduct.",
    "A juror at Scott Peterson’s 2004 trial broke down in court Monday while being grilled over whether she profited off the infamous slay case and purposely lied on a questionnaire to get on the panel.",
    "Nice responded to Harris, “I don’t remember.”\nDuring cross-examination by prosecutor David Harris, Nice said she did not participate in writing the book but was only interviewed by two writers.",
    "I didn’t do it intentionally.”\nHarris also asked her about a TV interview with Dr. Mehmet Oz in which she said, “The balls on that guy,” in reaction to Peterson walking into the courtroom.",
    "She has admitted she did not disclose on the Peterson jury questionnaire that she obtained a restraining order in 2001 against her then-boyfriend and a woman he’d been involved with.",
    "When Nice was then asked about her alleged profiteering, she defiantly shot back, “I didn’t get rich!” before Judge Anne-Christine Massullo stopped the line of questioning.",
    "Nice and six other jurors went on to co-author the book, “We, the Jury: Deciding the Scott Peterson Case,” which was released in 2007.",
    "On Monday, Nice maintained she didn’t lie on the jury questionnaire when she didn’t include her own domestic-violence incidents.",
    "Nice then started to cry on the stand while Harris, Massullo and prosecutors met privately in the judge’s chambers.",
    "“When I filled out that questionnaire, honestly and truly, nothing of this ever crossed my mind,” Nice said.",
    "Harris said that in that letter, Nice said she was upset that “others got rich” after the trial.",
    "“I’ll say it again — I didn’t write it on the questionnaire because it never crossed my mind.",
    "Nice was among the 12 jurors who found Peterson guilty of killing his pregnant wife, Laci.",
    "It’s not clear who the “others” were.",
    "“I’ve never read it,” she claimed."
  ]
}