{
  "id": 4190,
  "mediaId": 2539,
  "date": "2022-03-04",
  "headline": "Pivotal Senate GOP race pits billionaire Ray Dalio’s former CEO against his friend Dr. Oz",
  "image": "https://image.cnbcfm.com/api/v1/image/107004487-1642769624499-gettyimages-1365957834-ajr_0360_b5209d47-0341-43e2-af07-ea2864b0a279.jpeg?v=1642769673&w=1920&h=1080",
  "link": "https://www.cnbc.com/2022/03/04/pivotal-senate-gop-race-pits-billionaire-ray-dalios-former-ceo-against-his-friend-dr-oz.html",
  "mediaOutlet": "CNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Schwartz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Oz said he also partnered with Dalio, Huffington and others to give away 20,000 $50 TisBest Philanthropy Charity Gift Cards to people who could then donate those funds to the charity of their choosing, according to a December 2020 post on Oz’s Facebook page.",
    "Oz and Dalio have been working together on philanthropic efforts for years, although the physician disagrees with the billionaire hedge fund founder on the issue of China, Brittany Yanick, a spokesperson for Oz’s campaign, confirmed to CNBC in a statement.",
    "Alexi Rosenfeld | Getty Images\nBillionaire hedge fund founder Ray Dalio finds himself inadvertently in the middle of a key congressional race that could determine the balance of power in the Senate in November’s midterm elections.",
    "Hastings has been a major donor to the Democratic Party, including more than $1 million in donations to the Senate Majority PAC during the 2020 election cycle, according to data from the nonpartisan Center for Responsive Politics.",
    "Dalio called McCormick and Oz “two good friends of mine and two great men who have lived and personify the American Dream in different ways,” in a LinkedIn post he published in January about the Pennsylvania Senate race.",
    "Oz founded it over 10 years ago with the goal of “saving lives by addressing health inequities in at-risk communities through educational leadership, programming, and service learning,” according to their website.",
    "He’s recently came under fire for his comments on CNBC about China’s human rights abuses, comparing their government’s authoritarian rule to a “strict parent.” Dalio tried to clarify his remarks on Twitter.",
    "She was pictured alongside both men at at 2014 town hall for the David Lynch Foundation, a nonprofit that uses transcendental meditation to help eradicate trauma and toxic stress for at-risk populations.",
    "The closely watched primary race on May 17 and later general election to replace retiring Republican Sen. Pat Toomey this fall could play a key role in determining the balance of power in the Senate.",
    "Dalio, who is co-chair of Bridgewater Associates, is personal friends with both Republican candidates vying for Pennsylvania’s Senate seat: Dr. Mehmet Oz and former Bridgewater CEO David McCormick.",
    "Oz and McCormick are each publicly vying to distance themselves from Dalio’s pro-China comments and are campaigning as pro-Trump America First candidates, despite their own past ties to China.",
    "Further ties between Dalio and Oz go back to a partnership Oz said he had with the hedge fund executive, Netflix Chair Reed Hastings and Huffington Post co-founder Arianna Huffington.",
    "Dr. Oz disagrees with Mr. Dalio about China, but Dr. Oz would never throw a friend under the bus just because he has decided to run for office,” Yanick said in an email on Tuesday.",
    "The Dalio Foundation, which Ray Dalio runs, has donated over $1.5 million to Oz’s foundation, HealthCorps, since 2011, according to 990 disclosure reports reviewed by CNBC.",
    "Dalio, who has an estimated net worth of $20 billion, hasn’t donated to a political campaign since the 2016 election cycle, according to campaign finance disclosures.",
    "Meanwhile, TV host and longtime physician Oz and and a super PAC that’s supporting his campaign have been blasting Bridgewater in campaign ads over its work in China.",
    "That charity partnership, called TisBest, also appears to have once included McCormick and his wife, Dina Powell McCormick, who is an executive at Goldman Sachs.",
    "The foundation has, in some years, donated over $100 million in grants to various charities, including repeatedly to the one once chaired by Oz.",
    "And with the Senate currently split 50-50, such contests are critical in determining which party will control that chamber in 2023 and beyond.",
    "McCormick, who resigned in January, reportedly told staff while he was still Dalio’s CEO that he disagreed with his boss’s views on China.",
    "The Dalio Foundation’s latest known contribution to HealthCorps came in 2019 for $100,000, according to tax filings from that year.",
    "Yet Oz has long benefited from Dalio’s financial support for his many charitable initiatives, a review of tax disclosures shows.",
    "The foundation’s website quotes Dalio from the event saying “If there’s stress, I’ll just break off and go into the meditation.",
    "A recent Franklin & Marshall College poll shows the race is wide open, with McCormick holding a small lead in the GOP primary.",
    "Other documents show that HealthCorps received two separate checks worth $325,000 in 2012 and 2013 from Dalio’s foundation.",
    "Dr. Mehmet Oz attends The 2022 Champions Of Jewish Values Gala at Carnegie Hall on January 20, 2022 in New York City.",
    "Representatives for Netflix and Thrive Global, Huffington’s company, did not respond to requests for comment.",
    "It will just wash off of me.” Oz, Huffington and celebrity chef Mario Batali were among the speakers.",
    "A representative for Bridgewater declined to comment beyond Dalio’s LinkedIn post.",
    "Oz has supported philanthropic efforts with many people, including Mr. Dalio.",
    "Huffington has also been involved with Oz and Dalio’s charitable work.",
    "Oz is currently listed on the website as chair emeritus.",
    "The super PAC backs Democrats running for Senate seats.",
    "Cook Political Report marks the seat as a toss-up.",
    "“Dr."
  ]
}