{
  "id": 4390,
  "mediaId": 2553,
  "date": "2022-03-04",
  "headline": "Dr. Oz Raises Eyebrows Swearing To ‘Defend The Sanctity Of Life’",
  "image": "https://dw-wp-production.imgix.net/2022/03/Screen-Shot-2022-03-03-at-5.50.30-PM.png?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/dr-oz-raises-eyebrows-swearing-to-defend-the-sanctity-of-life",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Margaret Olohan",
  "authorUrl": "https://www.dailywire.com/author/mary-margaret-olohan",
  "termIds": [
    0
  ],
  "sentences": [
    "And this is something that should not be taken away from us by judiciary legislating from the bench.”\nThough Oz discusses how “state legislatures nationwide have taken action to protect the most vulnerable among us?” in his Washington Examiner op-ed — and hits at Democrats attacking these laws — the senatorial candidate said in 2019 he was “really worried” about a pro-life law pushed by Alabama Republicans.",
    "50% of women don’t know they’re pregnant when they’re pregnant.”\nIn that same Breakfast Club interview, Oz not only defended Roe v. Wade as a measure that prevents coat hanger abortions, he also said that he did not “want to interfere” with a woman’s ability to abort her baby, accused pro-lifers of “picking fights,” and suggested that pro-life laws would make businesses leave red states.",
    "Oz explained that, as a physician, he thinks that if the litmus test for abortion must be that the baby’s heart is beating, “then really make it the heart beating.”\n“Don’t make some surrogate version of it when you know cells are, you know, have electrical path,” he said at the time.",
    "The problem with the law as it stands now, and I think they’ll always really only pass to generate a Supreme Court challenge.”\nWATCH:\n“But most women don’t know they’re pregnant, it’s only, it’s two weeks past your last period is when you have to decide by,” he continued.",
    "“I will always defend the sanctity of life.”\nDr. Oz spokeswoman Brittany Yanick told The Daily Wire Thursday evening that Oz is strongly pro-life and has been “very vocal about this for years.”\n“As a heart surgeon, Dr. Oz spent his whole career saving lives,” Yanick said.",
    "“I won’t ever shy away from sharing my pro-life beliefs, even as pro-abortion advocates in medicine, the media, and Big Tech try to silence me.”\n“I’ve taken on the establishment countless times before, and I am ready to do it again for the most vulnerable,” he added.",
    "Kay Ivey signed it into law, was one of the most restrictive abortion laws in the country at the time and banned almost all abortions with no exceptions for rape or incest, though it would make exception if the mother’s health was in serious danger.",
    "“I told my kids this, I mean I love the lives that they’re creating so much that I personally wouldn’t want it.”\n“But I don’t want to interfere with everyone else’s stuff because it’s hard enough getting through life as it is,” he continued.",
    "When should we draw the line when abortion is is legal?”\nOz responded by emphasizing that “as a doctor,” he appreciates “the sanctity of life.”\n“And for that reason, I’m strongly pro-life with the three exceptions I’ve mentioned,” he said.",
    "Republican Pennsylvania senatorial candidate Mehmet Oz is raising eyebrows with promises to “defend the sanctity of life” in light of past comments he made suggesting he was open to abortions.",
    "That’s not what’s going on at six weeks.”\nThe Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "Dr. Oz is a pro-life conservative who is adamantly opposed to abortion.”\nBut Oz struggled addressing when he believes life begins during a December 2021 Fox News hit.",
    "“But that carries you all the way up to nine months of pregnancy.”\n“No, of course not,” Oz said “Life’s already started when you’re in your mother’s womb.",
    "“So, setting aside the exceptions, which I appreciate, what about, what is your position as both a doctor and a senatorial candidate on when life begins?",
    "“I will be a bold voice in the Senate and a proud champion for the pro-life movement,” Oz wrote in a Washington Examiner op-ed published Wednesday.",
    "That Alabama case is in point did not include those exceptions.”\n“But, Dr. Oz, that’s currently being debated at the Supreme Court,” Cain said.",
    "“He has literally held a baby’s tiny beating heart in his hand, and in that very moment, it is impossible to deny how precious every life is.",
    "And I would vote to ensure that if the judiciary is reviewing an abortion law that they follow the Constitution, it’s quite clear.",
    "If I’m pro-life, then that’s a decision that comes back to the sanctity of when you think life does begin,” Dr. Oz responded.",
    "“I do believe in three exceptions, the health for the mother being the primary one, but rape and incest as well.",
    "“Well, I have people on the show all the time who never know they were pregnant even when they were delivering.",
    "“And I believe it begins when you’re in the mother’s womb.”\n“When you’re in the mother’s womb?” Cain asked.",
    "And people like me and you may be in the same camp, who are pro-life, have our feelings respected.",
    "“At a personal level, I wouldn’t want anyone in my family to have an abortion,” he said.",
    "“I’ll tell you, I’ve taken care of a lot of women who’ve had issues around childbirth.",
    "The legislation, which was blocked by a federal judge after Republican Alabama Gov.",
    "“As a senator, how would you vote?” Fox News “Primetime” host Will Cain asked Oz.",
    "“What do you think the laws should be on abortion?”\n“I’m pro-life,” Oz responded.",
    "We need as a nation to make sure the Constitution is appropriately followed.",
    "“That’s how I would vote.”\n“And when does that life begin?” Cain pressed.",
    "The average person is envisioning a little acorn heart beating in there.",
    "It’s a rathole to get trapped into different ways of talking about it.",
    "“I’m really worried about it,” he told The Breakfast Club at the time.",
    "Get inside access to The Daily Wire by becoming a member.",
    "Create a free account to join the conversation!",
    "“That’s not what the average person thinks.",
    "“You know, I get it."
  ]
}