{
  "id": 4567,
  "mediaId": 2594,
  "date": "2022-02-22",
  "headline": "Republican candidate denounces Michael Flynn as a ‘traitor’ during bad-tempered GOP debate",
  "image": "https://static.independent.co.uk/2022/02/22/22/newFile.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/michael-flynn-kathy-barnette-everett-stern-b2020977.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Io Dodds",
  "authorUrl": "https://www.independent.co.uk/author/io-dodds",
  "termIds": [
    2014,
    2201,
    2232,
    3450,
    4226,
    4762,
    475,
    878,
    1171
  ],
  "sentences": [
    "Yet it did feature fireworks from Mr Stern, who declared his mission to save the Republican Party from the \"right-wing extremism\" that led to the Capitol riot and calling on other candidates to recognise Joe Biden as president.",
    "Ms Barnette is a leading figure in Pennsylvania's election fraud conspiracy theory movement, who became a regular far-right media pundit after growing suspicious of her defeat in the 2020 House of Representatives election.",
    "Gen Flynn, meanwhile, is a decorated US Army officer and former National Security Adviser to Donald Trump who has since become a leading light of the extremist QAnon movement after apparently swearing an oath to its goals.",
    "After leaving HSBC, Mr Stern said he was \"blacklisted\" from the financial industry and worked as a waiter at the restaurant chain PF Chang's before founding his own corporate investigation firm called Tactical Rabbit.",
    "Everett Stern, a former banking whistleblower who is running for Pennsylvania's open Senate seat in this year's midterm elections, made the remark while debating other GOP candidates in Philadelphia on Monday night.",
    "On her website, Ms Barnette proudly bears an endorsement from Gen Flynn, whom she quotes as calling her \"bold, courageous, and accountable for her actions, unlike most politicians we have serving in Washington DC\".",
    "Monday's debate did not include high profile candidates such as the celebrity doctor Mehmet Oz and former George W Bush official David McCormick, both of whom took flak for skipping the event.",
    "Mr Everett first found fame in 2012 after blowing the whistle on alleged money laundering at HSBC, which paid $1.9bn (£1.4bn) to settle those accusations with the US government.",
    "He also called on Ms Barnette to apologise for bringing supporters to the Trump rally that preceded and evolved into the Capitol riot.",
    "A Republican candidate for the US Senate has denounced QAnon leader Gen Michael Flynn as a \"traitor\" in a hot-tempered primary debate.",
    "While his opponent Kathy Barnette was speaking, Mr Stern interrupted to say \"You're being backed by General Flynn.",
    "According to The Philadelphia Inquirer, he was booed and jeered by some in the audience.",
    "You're being backed by a traitor.\""
  ]
}