{
  "id": 4662,
  "mediaId": 2746,
  "date": "2022-02-14",
  "headline": "Pa. poll finds Dr. Oz leading with GOP voters, but many still undecided in Senate race",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/11/Mehmet_Oz_Honored_with_a_Star_on_the_Hollywood_Walk_of_Fame_07560.jpg-f3920_c0-135-3000-1885_s1200x700.jpg?4c785ab3f64f41678c405698f59f296d092df6e5",
  "link": "https://www.washingtontimes.com/news/2022/feb/14/dr-oz-leading-gop-voters-many-still-undecided-sena/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Boyer",
  "authorUrl": "https://www.washingtontimes.com/staff/dave-boyer/",
  "termIds": [
    2190,
    2232,
    2662,
    3199,
    3280,
    4762,
    305,
    878,
    1171
  ],
  "sentences": [
    "A source familiar with the McCormick campaign said the poll results are positive for Mr. McCormick, showing that he’s gaining ground quickly after entering the race last month and having “virtually zero name recognition to start.”\nThe source, who spoke on condition of anonymity, noted that Mr. Oz is “only at 27 [%] after near universal name ID and spending $8 million on advertising.”\nMs. Yanick said Mr. McCormick “continues to flounder, despite spending millions on a China-funded smear campaign.” The Oz campaign has attacked Mr. McCormick for his former role leading a hedge fund that does substantial business with China.",
    "Oz campaign spokeswoman Brittany Yanick said GOP voters are rallying behind his campaign “because they know he is on their side, taking on the political, media, and medical establishments to protect their freedoms.”\nMcCormick campaign spokeswoman Jess Szymanski said the poll shows that Mr. Oz “is being rejected by Pennsylvania conservatives.”\n“He started with 100% name ID and a huge lead and has dropped every single week that he’s been in the race.",
    "TV personality Dr. Mehmet Oz leads the field for the Republican nomination for Pennsylvania’s U.S. Senate seat, but a large swath of GOP voters is undecided, according to a poll released Monday.",
    "But the survey by the Trafalgar Group found that 21.6% of GOP voters said they were either undecided or wouldn’t vote.",
    "The candidates are vying for the seat held by Republican Sen. Patrick J. Toomey, who is retiring.",
    "Mr. Oz had 27.4% support, compared with 15.9% for former hedge-fund executive David McCormick.",
    "Carla Sands, a former Trump administration diplomat, came in third at 14.8%.",
    "The poll of 1,070 respondents was conducted from Feb. 1 to Feb. 4.",
    "At this rate he will be back on TV in China by April,” she said.",
    "John Fetterman and Rep. Conor Lamb are the top fundraisers.",
    "It had a margin of error of 2.99%.",
    "On the Democratic side, Lt. Gov.",
    "The primaries are on May 17."
  ]
}