{
  "id": 484,
  "mediaId": 2752,
  "date": "2022-04-18",
  "headline": "PA Senate Candidate John Fetterman Leading Race To Convince Voters He’s Better Than Dr. Oz",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY5Mjg1Ni9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTcwMzM0MzUzN30.iUXUQSmpclTsax9N3uPsSR7igSofdBUSwigSs2nI6hw/img.png?width=1200&coordinates=0%2C0%2C0%2C18&height=600",
  "link": "https://www.wonkette.com/pa-senate-candidate-john-fetterman-winning-race-to-convince-voters-hes-better-than-dr-oz",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    2155,
    2232,
    3199,
    3280,
    4411,
    405,
    808,
    1171,
    5239
  ],
  "sentences": [
    "[ ... ]\nOnly one in four (29%) registered voters believes the state is “headed in the right direction.” Three in four (75%) voters who say they are “worse off” financially this year than last also say the state is “on the wrong track.”\nAccording to the F&M poll, 33 percent of registered voters think President Joe Biden is doing an “excellent” or “good” job.",
    "It doesn’t seem like Lamb is making any inroads in his name recognition.”\nThe poll surveys registered voters, and Fetterman’s advantage has increased 13 percent in the past month, despite Lamb’s campaign reminding voters that Fetterman’s a radical, defund-the-police-supporting socialist who pointed a shotgun at a Black guy.",
    "Economic concerns remain high and voters “feel deeply frustrated and mostly dissatisfied with President [Joe] Biden’s performance.”\nMore than one in three (36%) respondents say they are “worse off” financially than a year ago, about the same as last month.",
    "Black Pennsylvania voters are likely fully represented in a Democratic primary poll, so the shotgun incident hasn’t gained the traction Lamb or others might’ve hoped, no matter how often they compare Fetterman to the racists who murdered Ahmaud Arbery.",
    "His positive ratings have dropped from 78 percent to 61 percent among Democrats, from 38 percent to 24 percent among independents, from 79 percent to 64 percent among liberals, and from 50 percent to 42 percent among moderates since August.",
    "The Republican primary is a tighter race with Dr. Mehmet Oz and David McCormick more or less tied, although Oz has more support among the “Trump faction of the party,” which is all that’s left of the GOP.",
    "Fetterman was dinged for ghosting on the recent Democratic primary debate, but as with Herschel Walker in Georgia, there’s apparently no compelling reason for primary frontrunners to participate.",
    "Many Republicans and conservatives say they are “worse off” than last year, but a quarter of Democrats (26%) and a plurality of independents (40%) also say they are worse off financially.",
    "“If you are a candidate, you want to be in Fetterman’s position,” said Berwood Yost, the director of Franklin & Marshall College’s Center for Opinion Research, based in Lancaster.",
    "Yes, I get it: Democracy dies in darkness if candidates don’t have debates, but there’s no real proof that voters will punish a candidate if they don’t show up.",
    "Fetterman, meanwhile, is running as Biden’s reliable “51st vote” in the Senate, vowing to advance the president's agenda with a “put me in coach” enthusiasm.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "So far, 26 percent of voters are still undecided, but that’s not great news for Lamb or Kenyatta, because that number was 44 percent last month.",
    "She described Biden in 2020 as half a bowl of shit to Trump’s overflowing bowl of excrement, which is an insulting and unappetizing image.",
    "Turner curiously chose to present herself as a pain in the ass to Democrats, who are the primary participants in Democratic primaries.",
    "Lamb supporters have pointed to Rep. Shontel Brown’s surge to victory in Ohio’s 11th congressional district Democratic primary.",
    "A little under half the voters polled could change their minds, but the primary election’s on May 17 so the clock is ticking.",
    "Hillary Clinton and Rep. Jim Clyburn endorsed Brown, while Democratic leadership is staying out of the Pennsylvania primary.",
    "I probably wouldn’t bury compelling facts in a mountain of hyperbole, but I’ve never run a successful Senate campaign.",
    "Fetterman is leading 49 to 13 among progressives but he also has a 10 point lead among self-identified centrists.",
    "However, multiple polls showed Brown gaining on frontrunner Nina Turner in the weeks leading up to the election.",
    "The general mood of the electorate is like a downbeat Morrissey track, which isn’t great for the party in power.",
    "Voters could suddenly get happy, like Judy Garland but without all the pharmacological assistance.",
    "Let’s hope Pennsylvania Democrats turn out in force regardless of who their eventual nominee is.",
    "Fetterman gained the most ground, while Lamb picked up a statistically insignificant two points.",
    "Democrats find it easier to vote for candidates whose rhetoric doesn’t literally nauseate them.",
    "Rep. Conor Lamb has 17 percent support and state Rep. Malcolm Kenyatta has just four percent.",
    "After all, these polls are from right now and the elections aren’t until later.",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "A Franklin & Marshall College Poll released Thursday shows Lt. Gov.",
    "Here’s some more Senate race news, this time from Pennsylvania.",
    "John Fetterman leading the Democratic primary at 41 percent.",
    "He's also on the board of the Portland Playhouse theatre.",
    "“[Fetterman] seemed to solidify his advantage.",
    "His son describes him as a “play typer guy.\"",
    "Please click the clickie, if you are able.",
    "That last one is even objectively true.",
    "I have that much in common with Lamb.",
    "Krypton’s simply shifting its orbit.",
    "But enough with the doom and gloom!",
    "How often would you like to donate?",
    "He writes reviews for the A.V.",
    "That's you!"
  ]
}