{
  "id": 4901,
  "mediaId": 2641,
  "date": "2022-02-15",
  "headline": "Pennsylvania GOP Senate Candidates Fight for Trump's Endorsement",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=585f4c8f-86e5-4cf8-ae97-0ca53d620f79&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/pennsylvania-republicans-senate-donald-trump/2022/02/15/id/1056986/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Theodore Bunker",
  "authorUrl": "",
  "termIds": [
    2201,
    3434,
    3975,
    4762,
    878,
    883,
    5239
  ],
  "sentences": [
    "Two of the leading Republican candidates in the Pennsylvania Senate race, David McCormick and Mehmet Oz, have hit each other over a perceived lack of loyalty to former President Donald Trump, who has yet to issue an endorsement in the race.",
    "\"Most of the attention has been on the millions of dollars spent on TV ads by Dr. Oz and hedge fund executive McCormick and their supporting PACs,\" noted Jeffrey Brauer, who teaches political science at Pennsylvania's Keystone College.",
    "When asked for comment by the Examiner, a McCormick campaign spokesperson said, \"Dave is the only true, 'America First' candidate that, if elected, will work every day to restore the pro-growth policies implemented by President Trump.\"",
    "Some of McCormick's supporters have also hit Oz for meeting with Senate Minority Leader Mitch McConnell, R-Ky., although the Washington Examiner reports that a source states McCormick previously requested a similar sit-down.",
    "Oz recently hired Jon Lerner, a former member of Trump's administration who worked for his ambassador to the United Nations who has come under fire from the former president's supporters who say he is disloyal.",
    "Oz's supporters have also noted that McCormick initially avoided answering in a recent interview whether or not he would have voted to impeach Trump over the Capitol riot before saying, \"No.\"",
    "The Oz campaign has hit McCormick over his past public remarks criticizing Trump's \"divisiveness\" and complimenting President Joe Biden’s \"tone\" of inclusion.",
    "\"It seems to be a contest of who is more conservative and more aligned with former President Trump and his America First assertions.",
    "Oz's campaign declined to comment to the Examiner.",
    "Both have the carpetbagger problem.\""
  ]
}