{
  "id": 4940,
  "mediaId": 2641,
  "date": "2022-02-18",
  "headline": "Dr. Oz to Newsmax: Energy Is 'Big Issue' in Pennsylvania Senate Campaign",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=427402d5-c30a-4bc4-a6c3-1f71ac5ad59e&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/oz-pennsylvania-senate-biden/2022/02/18/id/1057536/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charles Kim",
  "authorUrl": "",
  "termIds": [
    2232,
    2327,
    4762,
    4796,
    715,
    878,
    1032,
    1171,
    5239,
    5287
  ],
  "sentences": [
    "He said that there is enough natural gas under the Pennsylvania soil to power the entire country for the next century, while the Green New Deal being pushed by Biden and the Democrats is not ''scientifically feasible,'' and creates other problems for the state's economy.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\n© 2022 Newsmax.",
    "Oz said that the policies of President Joe Biden are hurting the energy industry in Pennsylvania by restricting fracking, a large moneymaker for the commonwealth, as well as hurting the industry nationwide.",
    "''Energy is really the big issue, both in the commonwealth of Pennsylvania, but [also] across the country,'' Oz, who is running as a Republican in the race, said on ''Eric Bolling: The Balance.''",
    "Television personality and U.S. Senate candidate Dr. Mehmet Oz told Newsmax on Friday that energy is ''the big issue'' in Pennsylvania, where he is running, as it is across the country.",
    "He said he is barnstorming the state and hosting town hall gatherings that have ''a lot of energy'' from the people attending to find out who he is and what he is about.",
    "The poll has a margin of error of 2.99% and was conducted Feb. 1-4 with 1,070 likely GOP primary voters from, according to the organization.",
    "A recent Trafalgar Group poll puts Oz in the lead by 11 points for the Republican nomination against seven other candidates.",
    "''The biggest energy issue, you know, the gas prices have gone up since last January from $2.40 to $3.40'' per gallon.",
    "If you go to New England, they will not use Pennsylvania natural gas; they'd rather [get it] imported from Russia.",
    "''We are angry at our government and at each other,'' Oz wrote in a guest Washington Examiner column at the time.",
    "During the pandemic, I learned that when you mix politics and medicine, you get politics instead of solutions.",
    "According to the poll, Oz gets 27.4% of the vote with the next challenger, David McCormick, getting 15.9%.",
    "I have not been to a single shop, pizza shop, deli, or a big factory that's fully employed.''",
    "That's why I am running for the U.S. Senate: to help fix the problems and to help us heal.''",
    "Oz announced his Senate bid in November after hosting a television show for 13 seasons.",
    "''Problems there are really paralyzing industry in Pennsylvania that's ready to thrive.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "You're actually blocking the ability for this country to be energy self-sufficient.",
    "''This is not just about the citizens of Pennsylvania, it's for the whole country.",
    "''We have not managed our crises as effectively as past generations.",
    "''[We should] get the federal government out of our way.",
    "''It also leads to lots of other problems,'' he said.",
    "We are hurting our nation,'' Oz said.",
    "That's not the wise move for us.''",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "All rights reserved.",
    "102, Mediacom Ch.",
    "615, Frontier Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch.",
    "Special Links:"
  ]
}