{
  "id": 503,
  "mediaId": 2721,
  "date": "2022-04-11",
  "headline": "Trump splits conservatives by endorsing Dr. Oz",
  "image": "https://thehornnews.com/wp-content/uploads/2020/11/Trump-Look-Up-AP-600x315-cropped.jpg",
  "link": "https://thehornnews.com/trump-splits-conservatives-by-endorsing-dr-oz/",
  "mediaOutlet": "thehornnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1316,
    1584,
    2022,
    2201,
    2202,
    2232,
    4762,
    5239
  ],
  "sentences": [
    "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that Mehmet Oz will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” he added.",
    "pic.twitter.com/Tz0Sb0Rtr7\n— Justin Baragona (@justinbaragona) April 10, 2022\nSponsored: 100-Year-Olds Take ½ Teaspoon Of THIS…Result Should Have Been On News\nOz had been competing for Trump’s endorsement in the May 17 primary against former hedge fund CEO David McCormick, whose wife, Dina Powell, served in Trump’s administration.",
    "That has opened McCormick, who spent a dozen years as an executive at one of the nation’s biggest hedge funds, to charges from some conservatives that he is a “globalist,” a derogatory term as adopted by Trump and others in his orbit to conjure up an elite, international coterie that doesn’t serve America’s best interests.",
    "The turnabout raised questions about the vigor of Trump’s vetting process and concerns among Republicans about whether the former president was bolstering candidates who might be able to win their respective primaries but flounder in general elections that will determine which party controls the Senate.",
    "Oz is the antithesis of everything that made Trump the best president of my lifetime—he’s the farthest thing from America First & he’d be very bad for PA.”\nEven Laura Ingraham of Fox News Channel retweeted an article called, “What the hell was he thinking?”\nTake a look —\n'What the hell was he thinking?",
    "However, he still said on Fox News Sunday, “I think we’re in a good position to win that race regardless of who the nominee is and I guess we will find out in the next few weeks how much this endorsement made a difference.”\nPlus, Sean Hannity of Fox News Channel endorsed Oz last month.",
    "Despite Trump's endorsement last night, Mitch McConnell still isn't sold on Dr. Oz:\n\"I think we're in a good position to win that race regardless of who the nominee is and I guess we will find out in the next few weeks how much this endorsement made a difference.\"",
    "100%, yes.”\nAs of Monday, Oz has already changed his Twitter bio to “Trump Endorsed Candidate for U.S. Senate.”\nThe decision marks a disappointment for McCormick, who met with Trump last week and had hired a litany of former Trump aides for his campaign.",
    "— Allie Beth Stuckey (@conservmillen) April 9, 2022\nThis Food Grows Cancerous Tumors – Do Not Eat It [Sponsored]\nTrump had previously endorsed Parnell, but Parnell withdrew his candidacy amid allegations of abuse from his estranged wife.",
    "The ads pick apart Oz’s long career on TV and as a public personality and accuse him of being a liberal, pointing, for instance, to his repeated public advocacy for Obamacare, former President Barack Obama’s signature health care law.",
    "REVEALED: The shocking cause of ringing ears [Sponsored]\n“President Trump was very out of sync in picking Oz,” Dave Ball, chairman of the Washington County Republican Party, told The Washington Examiner on Monday.",
    "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate,” Trump said, in part.",
    "The two had gone to extensive lengths to win over the former president, who remains popular with the Republican base and has been wooed by candidates in primary races across the country.",
    "The former president endorsed Mehmet Oz, the celebrity heart surgeon best known as the host of daytime TV’s The Dr. Oz Show… and not every conservative is happy about the endorsement.",
    "McCormick has made deep inroads with party donors and officials in Pennsylvania, and has landed endorsements from former Trump administration officials Sarah Sanders and Mike Pompeo.",
    "At a conservative forum in Pennsylvania last weekend, the candidates were asked if they would like Trump’s endorsement and for him to come to Pennsylvania to campaign for them.",
    "': Pennsylvania conservatives react to Trump's support of Oz https://t.co/25Do3BHEot\n— Laura Ingraham (@IngrahamAngle) April 11, 2022\nYou’re not America First.",
    "Oz said in a recent interview that he had first met Trump in 2004 or 2005 when he asked Trump to use his golf course for an event for Oz’s children’s charity.",
    "Though he was virtually unknown to voters before declaring his candidacy in January, he topped a recent Fox News poll of Pennsylvania GOP primary voters.",
    "“I’d like to know who it is who lives in Pennsylvania that knows the voters well told Trump to pick Oz.”\n“I have enormous respect for President Trump.",
    "After that, they saw each other intermittently at social events before Oz interviewed Trump about his health during the 2016 presidential campaign.",
    "“He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!",
    "— Erick Erickson (@EWErickson) April 10, 2022\nIt’s pretty hard for me to fully express how disappointed in Trump I am for endorsing Oz.",
    "When Oz interviewed Trump on his show in 2016, Trump told him at one point that his wife, Melania Trump, was “a big fan” of the show.",
    "He lived in New Jersey for two decades until just before deciding to run in neighboring Pennsylvania, where his in-laws live.",
    "“That’s the easiest question we’re going to get all day,” replied one of the candidates, Jeff Bartos, a real estate investor.",
    "McCormick carries strong Republican establishment ties going back to his days in President George W. Bush’s administration.",
    "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed Oz.",
    "Later, at a rally in North Carolina, he said: “You know when you’re in television for 18 years, that’s like a poll.",
    "For months, Pennsylvania’s Senate candidates have been jockeying for the support of former President Donald Trump.",
    "Eggs do this to senior brains [Sponsored]\nOther conservatives have expressed warmer reactions to the endorsement.",
    "It’s like Donald Trump’s staff is sabotaging Trump by convincing him to make the worst possible endorsements.",
    "That means people like you.”\nThis time, Trump made clear that electability was top of mind.",
    "Meanwhile, McCormick and a super PAC supporting him have spent millions attacking Oz.",
    "Trump, in conversations, has often praised Oz for his positive treatment on the show.",
    "I was honored to have his endorsement in PA,” former candidate Sean Parnell tweeted.",
    "But he has had to work to turn himself into a pro-Trump, America First candidate.",
    "https://t.co/avkowcZRuz\n— Sean Parnell (@SeanParnellUSA) April 10, 2022\nSurprise!",
    "The Horn editorial team and the Associated Press contributed to this article.",
    "Senate Minority Leader Mitch McConnell expressed reservations about Oz.",
    "“Women, in particular, are drawn to Dr. Oz for his advice and counsel.",
    "In 2015, McCormick held a fundraiser for Jeb Bush, Trump’s 2016 rival.",
    "On Sunday, Trump finally threw his hat in the very crowded ring.",
    "They know him, believe in him, and trust him,” he said.",
    "— Kurt Schlichter (@KurtSchlichter) April 9, 2022\nWait.",
    "Oz also has taken heat in the race for carpetbaggery.",
    "Sponsored: Deadliest Drug Ever (are you taking it?)",
    "Oz also has a long personal history with Trump.",
    "Is there anything conservative about Dr. Oz?",
    "I have seen this many times over the years.",
    "They also accuse Oz of being too Hollywood.",
    "You’re not even from Pennsylvania.",
    "),” Trump wrote in his statement.",
    "“But I’m disappointed by this.",
    "You’re not a conservative.",
    "Trump agreed.",
    "Hell no.",
    "“Yes."
  ]
}