{
  "id": 51,
  "mediaId": 2658,
  "date": "2022-04-11",
  "headline": "Donald Trump endorsed Dr. Mehmet Oz over the weekend in the Pennsylvania Senate race. Mitch McConnell didn't follow suit.",
  "image": "https://www.politico.com/interactives/uploads/image-service/2022/4/10/24204d2ca2-1200.jpeg",
  "link": "https://www.politico.com/minutes/congress/04-11-2022/oz-endorsement-split/",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2232,
    2412,
    2808,
    3434,
    3477,
    808,
    1171,
    4984,
    5239
  ],
  "sentences": [
    "He does fly occasional flights to maintain his certification.”\nAhn said Kahele, who has voted by proxy exclusively since January, flies a “drastically reduced schedule to maintain his active status.”\nHawaiian Airlines, in response to a question regarding how frequently the congressman flies, said only that it can confirm he is an active employee.",
    "Sarah Palin has dominated much of the national focus, but there are a bunch of notables: Republican Nick Begich III, the Republican son of a famous political family; Independent Al Gross, who sought the Senate seat in 2020; Tara Sweeney, a former Trump administration official and (no joke!)",
    "Although the state has mostly voted Republican during the presidential elections, the state broke even for President Joe Biden in 2020, marking the first time a Democratic presidential candidate carried the state since Bill Clinton in 1996.",
    "— Minority Leader Mitch McConnell (R-Ky.)\n\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate.",
    "That special will be the first test of the state's new ranked-choice voting system (the top four vote recipients advance out of the primary regardless of party — and then will be ranked in order of preference).",
    "(A spokesperson told POLITICO she \"made the decision to vote by proxy because her husband is immunocompromised and his health could be severely impacted if infected\" but was in Washington last week.)",
    "Winning a seat that was once thought to be faithfully red, Warnock's performance will be closely watched to see if Democrats will be able to hold onto their two newly won Senate seats in the state.",
    "Republican candidates jockeying against each other for the seat include big celebrity names such as Dr. Mehmet Oz and Bridgewater CEO David McCormick plus former Trump campaign advisor Carla Sands.",
    "The special contest will take place under the old GOP-friendly lines (the seat got bluer in redistricting), but the Republican candidate in November, Mayra Flores, also plans to run in the special.",
    "Here's the deal: There are now five vacancies in the House — through a combination of resignations and deaths — and we'll see a slew of special elections to fill those slots until January.",
    "What happened: Speaker Nancy Pelosi, second-in-line to the presidency after the vice president, said Monday she's tested negative for Covid after contracting the virus late last week.",
    "On the GOP side, most prominent are state Reps. Nels Pierson and Jeremy Munson, as well as Jennifer Carnahan, the (controversial) former state Republican chair and Hagedorn's wife.",
    "Minnesota's 1st (Aug. 9): There's a May 24 primary and Aug. 9 general election to replace the late-Rep. Jim Hagedorn (R-Minn.), who passed away from cancer on Feb. 17.",
    "Pennsylvania: With Toomey retiring after an 11-year-run, this election will be for an open seat, with a packed Democratic primary and an even messier Republican field.",
    "Alaska at-large (Aug. 16): Voters will pick the successor to the late Rep. Don Young (R-Alaska) through a June 11 primary followed by the Aug. 16 special election.",
    "Tomorrow, I will be exiting isolation at the direction of the Capitol’s Attending Physician and consistent with CDC guidelines for asymptomatic individuals.",
    "California's 22nd (runoff June 7): This race is to replace former Rep. Devin Nunes (R-Calif.), who left Congress to run the Trump Media & Technology Group.",
    "John Fetterman and Rep. Connor Lamb (D-Pa.) have been have been the top names to watch, with the race becoming increasingly hostile as the primary nears.",
    "But this district's boundaries changed radically in redistricting — neither Conway nor Hubbard will seek a full term — so this will be a short-term gig.",
    "— Former President Donald Trump's endorsement of Oz\nThe context: McConnell and Trump have, of course, not spoken since before the Jan. 6 insurrection.",
    "Georgia: After winning a close special election against former Republican Sen. Kelly Loeffler, Warnock will be seeking out a full term come November.",
    "“He is an active member of the airline union, the ALPA Pilots Union, and is a certified commercial pilot and active member of Hawaiian Airlines.",
    "Some of those races will be more competitive than others in the general election, particularly depending on who makes it through the primary.",
    "As we enter the primary election season, here's a handy guide to important dates for tracking where the Senate majority will land next year.",
    "The parties picked two state senators — Republican Mike Flood and Democrat Patty Pansing Brooks — as their nominees for the June 28 contest.",
    "Rep. Filemon Vela Jr. (D-Texas) resigned this seat, where Republicans made significant inroads with Hispanic voters in 2020, on March 31.",
    "McConnell's priority in the Senate primaries has been ensuring the party picks candidates who can prevail in the general elections.",
    "For the Democrats in this red-trending seat, there's ethics lawyer Richard Painter and Jeffrey Ettinger, the former CEO of Hormel.",
    "In a state where Joe Biden won by a mere point, this race marks a high target for Democrats and essential defense for Republicans.",
    "A spokesperson said the congressman, an airline pilot, flies a \"drastically reduced schedule to maintain his active status.\"",
    "— Nancy Pelosi (@SpeakerPelosi) April 11, 2022\nThere are now 5 special elections for House seats on the books for this year.",
    "Wisconsin on Aug. 9: Sen. Ron Johnson stands as one of the most vulnerable Republicans running for reelection this cycle.",
    "Georgia on May 24: Democratic incumbent Sen. Raphael Warnock will defend the seat he won in a special election in 2020.",
    "Democrat Daniel Sanchez, a former Cameron County commissioner, announced a bid for the seat in the special last week.",
    "Connie Conway, the former California Assembly Republican Leader, and Democrat Lourin Hubbard advanced to the runoff.",
    "I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.",
    "Florida on Aug. 23: GOP Sen. Marco Rubio will have to defend his seat, likely against Democratic Rep. Val Demings.",
    "New Hampshire on Sept. 13: Democratic Sen. Maggie Hassan still faces stiff Republican competition, even after Gov.",
    "For those wanting to know which party will control the Senate next year, you can narrow down those dates a bit.",
    "Rep. Al Lawson (D-Fla.): 100 percent\nRep. Kai Kahele (D-Hawaii), who's mulling a run for governor: 96 percent.",
    "A new analysis finds some lawmakers running or considering higher office are using proxy voting quite a lot.",
    "Rep. Charlie Crist (D-Fla.), who's seeking a return to his state's governor's mansion: More than 85 percent.",
    "Some good news: Nancy Pelosi says she's tested negative for Covid after coming up positive late last week.",
    "Arizona: Incumbent Democrat Kelly will be running in a toss-up state with a crowded Republican primary.",
    "Nebraska's 1st (June 28): They're moving quickly in Nebraska following Rep. Jeff Fortenberry's (R-Neb.)",
    "If you thought 20 candidates was a lot then steel yourself; this race has a field of nearly 50 people.",
    "Check out our archive for previous minutes, or sign up for Huddle our morning Capitol Hill newsletter.",
    "Primary season is almost upon us, when nearly every week there's a different election result to track.",
    "Colorado on June 28: A tough Republican field is looking to challenge Democratic Sen. Michael Bennett.",
    "Rep. Tom Suozzi (D-N.Y.), who (as an aide noted) is running for governor of New York: Over 94 percent.",
    "Kai Kahele is still a pilot on \"occasional flights\" for Hawaiian Airlines while a member of Congress.",
    "We've reached out to the offices here to see if they want to comment on the use of proxy voting.",
    "Republicans would love to score a flip here, cementing the progress they've made in south Texas.",
    "Nevada on June 14: Democratic incumbent Sen. Catherine Cortez Masto will be defending her seat.",
    "He has lived with us through the screen and has always been popular, respected, and smart.\"",
    "Rep. Vicente Gonzalez (D-Texas) will run for the seat in the fall, but not in the special.",
    "I think we’ve been in a good position to win that race regardless of who the nominee is.",
    "I guess we’ll find in the next few weeks how much this endorsement made a difference.\"",
    "There are also three Democratic members who've voted 100 percent by proxy this year.",
    "Rep. Albio Sires (D-N.J.), who's retiring after this term in Congress: 100 percent.",
    "Arizona on Aug. 2: Democratic Sen. Mark Kelly also faces robust GOP competition.",
    "This is pretty red turf so the Republicans will be favored to hold the seat.",
    "Many thanks to everyone for their good wishes, chocolates and chicken soup.",
    "North Carolina on May 17: To replace retiring Republican Sen. Richard Burr.",
    "Pennsylvania on May 17: To replace retiring Republican Sen. Pat Toomey.",
    "She thanked people for the \"good wishes, chocolates and chicken soup.\"",
    "Texas' 34th (June 14): This is probably the most interesting contest.",
    "Oklahoma on June 28: To replace retiring Republican Sen. Jim Inhofe.",
    "Missouri on Aug. 2: To replace retiring Republican Sen. Roy Blunt.",
    "All it takes is one seat to flip control in the upper chamber.",
    "I think we’ve got a good choice of candidates in Pennsylvania.",
    "Oz won Trump's backing over David McCormick in the key race.",
    "resignation stemming from felony convictions on March 31.",
    "In the Democratic primary, the state's Lieutenant Gov.",
    "What they may or may not tell us about the midterms.",
    "Rep. Lucille Roybal-Allard (D-Calif.): 100 percent.",
    "Chris Sununu declined a highly-favored Senate bid.",
    "Ohio on May 3: To replace retiring Republican Sen.",
    "He is fully in compliance with Ethics,” Ahn said.",
    "Check back later today for updates from the Hill.",
    "Nine GOP candidates are running to unseat Kelly.",
    "Today, happily I tested negative for COVID.",
    "“The congressman is not making $120,000.",
    "Tap, click or scroll to read more ??",
    "Tap, click or scroll to read more ??",
    "Tap, click or scroll to read more ??",
    "Tap, click or scroll to read more ??",
    "Tap, click or scroll to read more ??",
    "Tap, click or scroll to read more ??",
    "Santa Claus of North Pole, Alaska.",
    "We'll update if we hear back.",
    "We'll walk you through them.",
    "There are 20 contenders.",
    "That's all for now.",
    "Want to see more?",
    "Rob Portman.",
    "\"We'll see."
  ]
}