{
  "id": 5330,
  "mediaId": 2790,
  "date": "2022-02-20",
  "headline": "Pennsylvania Senate contests will be some of the most closely watched this year",
  "image": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400",
  "link": "https://www.npr.org/2022/02/20/1082012462/pennsylvania-senate-contests-will-be-some-of-the-most-closely-watched-this-year",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Don Gonyea",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "It is absolutely wonderful to be here to announce my support and my endorsement for...\nGONYEA: Congressman Lamb describes himself as a strong supporter of President Biden's agenda, especially the infrastructure plan that was passed with bipartisan support and the so-called Build Back Better proposals which have not passed.",
    "(APPLAUSE)\nGONYEA: In an interview, I asked Fetterman about the drive over - 90 minutes on back roads, rolling past countless signs and banners reading Trump-Pence, Trump 2024, impeach Biden, plus those with a four-letter word next to Biden's name.",
    "CONOR LAMB: Yeah, well, I'm not really big on the term centrist because when I hear centrist, what I think of is someone who just looks at where the two extremes are and jumps in the halfway point regardless of what they actually believe.",
    "And my experience is that I've beaten Republicans three times in a row in tough districts and under a big spotlight, and so, you know, I've been making the case that that qualifies me to be the one to carry our banner this year.",
    "GONYEA: Kenyatta says he'll campaign all across the state and that he'll rally Democrats wherever they are, but he also stresses that he's the one who can drive turnout in the state's urban areas, especially with the Black vote.",
    "But it's also considered a prime pickup opportunity for Democrats, whose top contenders we'll be looking at right now - three very different personalities all taking very different approaches to campaigning.",
    "It's about your life experiences and what it means to have to look your kids in the eyes, as my parents had to look me in the eyes, and say, baby, I don't know what we're going to do this week.",
    "Congressman Conor Lamb, a moderate Democrat who represents a western Pennsylvania district where he has shown he can win in a place that's closely divided between Democrats and Republicans.",
    "And I also think my work in Congress and especially my votes in Congress on many of the most important issues give people a little bit of certainty about how I would perform as a senator.",
    "And at these events, you do sense the anxiety that they feel at the start of a midterm election year when historic trends show that the party that holds the White House takes a beating.",
    "When it comes to driving out the impurity in the party in terms of, like, the Liz Cheneys and the Adam Kinzingers, they are ruthless and united because they do not tolerate dissent.",
    "They are designed to address what's known as human infrastructure, things that include funding for home health care and for the transition to jobs in energy-efficient industries.",
    "Fetterman describes himself as a progressive, but he likes to say things he supported years ago, like the $15 minimum wage, are now the mainstream of the Democratic Party.",
    "The top Republicans in the race to replace him are a TV personality, Dr. Mehmet Oz, better known as Dr. Oz, and a former hedge fund manager, David McCormick.",
    "GONYEA: Back at the fire hall in Smethport after that John Fetterman event, most of those we talked to were either Fetterman supporters or leaning that way.",
    "I appreciate how you really - I see you on TV, how you fight, you know, take the...\nGONYEA: The candidate has five stops on this day, all in Trump country.",
    "(APPLAUSE)\nGONYEA: Fetterman is from western Pennsylvania, far from the state's major population center in and around Philadelphia to the east.",
    "We'll be watching it and covering it all year, tracking candidates from both major parties and watching the voters watch them.",
    "And I'm like, because you have rooms like this, and you have people that have the same core values and same issues as you do.",
    "And ultimately, Lamb says, his resume and his record make him the one that can beat a Republican in the fall in Pennsylvania.",
    "DON GONYEA, HOST:\nNow a trip to Pennsylvania, which is home to one of this year's most closely watched U.S. Senate contests.",
    "Another thing Fetterman promises - that he'll be tough on Republicans and that he can play hardball as well as they can.",
    "We're going to have to have a lot of people turnout in southeastern Pennsylvania as well as everywhere across the state.",
    "KENYATTA: Because I inhabit so many different communities, we're going to be well-positioned to bring people together.",
    "Look no further than Lamb's Facebook profile, which says, quote, \"marine, prosecutor, patriot, Catholic, Democrat.\"",
    "You know, I have things I really believe in, and I've been campaigning on them and voting for them for four years.",
    "LAMB: I think the overriding issue in the primary is simply who can stand a chance to win the general election.",
    "GONYEA: The building is a brewpub open early and serving coffee to about 60 local Democrats who have shown up.",
    "When you know what it's like to be treated differently because of who you are, you think about that in policy.",
    "That's why we're here, to see the lieutenant governor who's running for U.S. Senate, Democrat John Fetterman.",
    "GONYEA: The third leading Democrat running for the U.S. Senate seat is State Representative Malcolm Kenyatta.",
    "When it came to blocking Merrick Garland's appointment to the Supreme Court, they were united and ruthless.",
    "And many Pennsylvania Democrats aren't banking on many votes from the other side in the general election.",
    "KENYATTA: It is going to be critical that we have massive, massive turnout in southeastern Pennsylvania.",
    "In Pennsylvania, three Democratic contenders for the U.S. Senate are campaigning in very different ways.",
    "And if he had that much energy for his own town, he just might have that much energy for the state.",
    "It's cold outside, but his campaign wardrobe today - shorts and an oversized Carhartt sweatshirt.",
    "He voted for Trump but said he's open to possibly supporting Fetterman in the general election.",
    "It's that person's notion of where the votes are that will ultimately shape the fall campaign.",
    "For us, we understand that our story is grounded in a reality that so many other people share.",
    "Kenyatta would also be the first statewide officeholder who's a member of the LGBTQ community.",
    "Today, you were talking about the Republican Party and describing them as united and ruthless.",
    "Visit our website terms of use and permissions pages at www.npr.org for further information.",
    "We're in a parking lot in Clarion, Penn., about an hour and a half northeast of Pittsburgh.",
    "And If you believe that 7.25 as a minimum wage is plenty, I'm probably not your candidate.",
    "His stump speech is short and informal and hits topics important to working-class voters.",
    "And if you don't show up and you don't engage, then who else are they going to listen to?",
    "The former president lost the state in 2020 but still carried rural PA by wide margins.",
    "FRANCIS AURIEMMO: You know, just his thoughts on revitalization - that shows promise.",
    "This text may not be in its final form and may be updated or revised in the future.",
    "GONYEA: Fetterman is the early front-runner, and he's raised the most money so far.",
    "GONYEA: This is from an event two days ago in the former steel town of Bethlehem.",
    "But call Lamb the centrist candidate in the race, and you get a reply like this.",
    "When it comes to achieving a goal that they want, they are united and ruthless.",
    "He has tattoos, shaved head, chin beard, listens to heavy metal in his truck.",
    "MALCOLM KENYATTA: Being a working person is not about dressing a certain way.",
    "GONYEA: In a few months, Pennsylvania will have a Democratic Senate nominee.",
    "Early afternoon, it was another event in another small community, Smethport.",
    "GONYEA: But this is a Democratic primary, and Republicans can't vote in it.",
    "And being in the middle of Trump country up here, it's a little bit scary.",
    "And why can't Democrats embrace that philosophy but for working families?",
    "But many also said they don't yet know which Democrat they'll support.",
    "NPR transcripts are created on a rush deadline by an NPR contractor.",
    "FETTERMAN: No, not enemy territory, just friends we haven't met yet.",
    "FETTERMAN: And some folks would say, why would you waste your time?",
    "The authoritative record of NPR’s programming is the audio record.",
    "GONYEA: He's also running in hopes of seeing two barriers crumble.",
    "Now, it's my understanding, when he was mayor, he did do a lot.",
    "We need to continually make more and more stuff in our country.",
    "In appearance and style, Lamb and Fetterman are opposites.",
    "Local Democrats are thrilled Fetterman has shown up here.",
    "The Pennsylvania primary is just about three months away.",
    "UNIDENTIFIED PERSON #2: Thanks for coming out to see us.",
    "He wants to be Pennsylvania's first Black U.S. senator.",
    "(SOUNDBITE OF ARCHIVED RECORDING)\nWILLIAM REYNOLDS: OK.",
    "(SOUNDBITE OF METAFORM'S \"CRUSH\")\nCopyright © 2022 NPR.",
    "She's the chairperson of the McKean County Democrats.",
    "GONYEA: Fetterman's working the room, taking selfies.",
    "That means campaigning is really starting to pick up.",
    "I tried to make a bet on if you'd wear shorts or not.",
    "UNIDENTIFIED PERSON #3: Coming into enemy territory.",
    "More than 100 people showed up at a local fire hall.",
    "He represents North Philadelphia in the state House.",
    "So that's one slice of the story from Pennsylvania.",
    "If folks want to win this race, then you know what?",
    "And maybe some others will give a listen as well.",
    "Fetterman's image is that of the anti-politician.",
    "Have you found health care useful in your life?",
    "GONYEA: He says there are Democrats out here.",
    "Then there was the Republican we spoke with.",
    "MARTY WILDER: I'm terrified, in all honesty.",
    "He too has his eye on working-class voters.",
    "He says that's the community he grew up in.",
    "He was elected lieutenant governor in 2018.",
    "Two-term Republican Pat Toomey is retiring.",
    "FETTERMAN: How's your broadband up here?",
    "I don't know where the country's going.",
    "The speaker is Mayor Willie Reynolds.",
    "But another leading contender is U.S.",
    "I don't know what's going to happen.",
    "Accuracy and availability may vary.",
    "I just fundamentally believe that.",
    "UNIDENTIFIED PERSON #5: Terrible.",
    "And I'll just end with this note.",
    "I can just see what's going on.",
    "UNIDENTIFIED PERSON #4: Awful.",
    "He's been a small-town mayor.",
    "UNIDENTIFIED PERSON #1: Good.",
    "His name is Francis Auriemmo.",
    "JOHN FETTERMAN: How are you?",
    "FETTERMAN: It is awful.",
    "All rights reserved.",
    "Take Marty Wilder.",
    "FETTERMAN: Yeah.",
    "You meet them.",
    "I'm honest.",
    "It's good.",
    "I have."
  ]
}