{
  "id": 5356,
  "mediaId": 6526,
  "date": "2022-02-23",
  "headline": "Dr. Oz, other carpetbaggers insulted Pennsylvania voters by skipping Senate debate",
  "image": "https://www.mcall.com/resizer/EjT4ZTyPFiTX_eDFewzBFbZ4XjI=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/XIPVJKZDABZVDJGDNQ4SHLAEAE.jpg",
  "link": "https://www.mcall.com/opinion/mc-opi-pennsylvania-senate-debate-dr-oz-mccormick-muschick-20220223-7ospnclwzfdrroied6qhkaocl4-story.html#ed=rss_www.mcall.com/arcio/rss/category/news/",
  "mediaOutlet": "Morning Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Muschick",
  "authorUrl": "https://www.mcall.com/mc-bio-paul-muschick-staff.html#nt=byline",
  "termIds": [
    2014,
    2232,
    2415,
    3414,
    3450,
    4762,
    1171,
    4938,
    5239
  ],
  "sentences": [
    "Oz was raised in Delaware and lived in New Jersey until registering to vote in Pennsylvania in December 2020, at the Bryn Athyn home he is renting from his in-laws, according to The Philadelphia Inquirer.",
    "Mehmet Oz, David McCormick and Carla Sands want voters to believe they can represent Pennsylvania in the U.S. Senate despite the fact they’ve lived elsewhere until recently.",
    "Oz did not show up at Villanova because of a scheduling conflict and McCormick bailed after learning Oz wouldn’t be there, City & State Pennsylvania reported.",
    "The Constitution requires only that you be a resident of a state “when elected.”\nIf they aren’t elected, where will they live then?",
    "His attended the University of Pennsylvania and married a Pennsylvania girl, but that’s not what I’d call deep roots.",
    "Oz, McCormick and Sands are considered front-runners in the race for the Republican nomination in the May primary.",
    "Four of the seven GOP candidates — Jeff Bartos, Kathy Barnette, George Bochetto and Everett Stern — attended.",
    "They try to be careful about what they say, and answering questions without a script can be a minefield.",
    "That will tell you more than you might have learned from them had they appeared at Monday’s debate.",
    "He worked in Connecticut as CEO of a hedge fund before moving to Pittsburgh recently.",
    "They must show they can relate to its citizens, that they understand the issues.",
    "The trio blew off a Republican debate Monday night at Villanova University.",
    "It’s hard to take them seriously as candidates when they refuse to debate.",
    "They need to start acting like it and show the public what they’ve got.",
    "Sands, McCormick and Oz have the most to prove to Pennsylvania voters.",
    "So they bow out and figure people will forget they chickened out.",
    "McCormick was born near Pittsburgh and raised in Bloomsburg.",
    "There are no residency requirements to run for Senate.",
    "They must prove they can represent the commonwealth.",
    "It’s not unheard of for candidates to skip a debate.",
    "All that does is cement their carpetbagger status.",
    "There was plenty of debate to be had.",
    "You can live anywhere in the country.",
    "Keep an eye on that."
  ]
}