{
  "id": 5482,
  "mediaId": 2658,
  "date": "2022-02-05",
  "headline": "Pennsylvania GOP declines to endorse in Senate race",
  "image": "https://static.politico.com/06/3b/dc2f51f4451195c0fb11e6aad29c/election-2022-senate-pennsylvania-61681.jpg",
  "link": "https://www.politico.com/news/2022/02/05/pennsylvania-republican-party-declines-endorse-senate-00005999",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2232,
    4762,
    305,
    878,
    883,
    1171,
    5239,
    5412
  ],
  "sentences": [
    "Jeff Bartos speaks during a debate with other Republican Party candidates seeking to win the party nomination in the 2022 election for the U.S. Senate on Jan. 12, in New Castle, Pa. | Keith Srakocic/AP Photo\nBy Holly Otterbein\n 02/05/2022 12:18 PM EST\nYORK, Pa. — The Pennsylvania Republican Party declined Saturday to endorse a candidate in the state’s highly competitive and increasingly ugly Senate primary.",
    "Conor McGuinness, Bartos’ campaign manager, said, “These straw polls have been the only votes cast in this election — and the results are clear: Republicans prefer an actual Pennsylvanian, an actual conservative, to slick TV ads from out of state pretenders.”\nTo date, Bartos has demonstrated in straw polls that he is the favorite among the GOP grassroots across the state.",
    "Still, the non-endorsement was a disappointment for real estate developer Jeff Bartos, whose campaign did not project a victory before the meeting but had received the most votes in straw polls of committee members in regional caucuses in the weeks leading up to Saturday.",
    "The members of the GOP state committee, which closed its meeting in Lancaster on Saturday to the press, voted down a motion to endorse candidates in any statewide race by voice vote, according to several sources in the room.",
    "Bartos, who has struggled in the polls and been outspent by celebrity physician Mehmet Oz and former hedge fund CEO David McCormick, needs to shake up the race to overcome his rivals’ financial and name ID advantages.",
    "Saturday’s event was marked by high levels of party optimism, with speakers at the gathering trumpeting that 2022 would be a fantastic year for the party.",
    "Oz, in particular, benefits from the lack of an endorsement after performing poorly in prior straw polls of party activists.",
    "At a meeting last week, the state’s Democratic Party also did not endorse a candidate for Senate.",
    "Oz and McCormick have also spent more on television ads so far than a pro-Bartos super PAC.",
    "Ahead of the vote, most state Republicans predicted there would be no endorsement."
  ]
}