{
  "id": 5782,
  "mediaId": 2570,
  "date": "2022-02-02",
  "headline": "Billionaires And Big-Money Families Are Bankrolling Dr. Oz’ Senate Run",
  "image": "",
  "link": "https://www.forbes.com/sites/michelatindera/2022/02/02/billionaires-and-big-money-families-are-backing-dr-oz-senate-run/?sh=6ae469ad487c",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michela Tindera",
  "authorUrl": "https://www.forbes.com/sites/michelatindera/",
  "termIds": [
    1560,
    2174,
    2232,
    3675,
    3727,
    4313,
    4706,
    398,
    5234,
    5239
  ],
  "sentences": [
    "Who is funding the likely-to-fail campaign of Mehmet Oz, the celebrity known as Dr. Oz, who promoted unproven medical claims during the pandemic and is now trying to become a U.S. senator from Pennsylvania?",
    "Oz himself loaned his campaign $5.2 million–the sort of money that most celebrities wouldn’t consider throwing away unless they knew they had an especially large stash as backup.",
    "Former Trump commerce secretary, Wilbur Ross, who is not a billionaire despite claiming for years that he was one, donated $11,600 with his wife Hilary Geary Ross.",
    "Roughly $100,000 came from donors who self-reported a Pennsylvania residence, and about $75,000 came from people who said they lived in Palm Beach, Florida.",
    "Oz also received $10,000 from activist investor Nelson Peltz and his wife Claudia, plus $5,600 from John Catsimatidis and his daughter Andrea Catsimatidis.",
    "Pennsylvania billionaire Michael Rubin, who is the owner of sports retailer Fanatics, donated $11,600 along with his girlfriend Camille Fishel.",
    "Former RNC finance chair Steve Wynn, who stepped down in 2018 amid sexual misconduct allegations, gave $11,600 with his wife Andrea.",
    "Wynn and Ross were part of a larger group of donors who reportedly hosted a fundraiser for Oz in Palm Beach, Florida last month.",
    "For starters, there’s the Asplundh family, heirs to a tree-trimming fortune based in the Keystone State.",
    "Oz married into one branch of the family, which Forbes estimated was worth $2.6 billion in 2015.",
    "One donor who has given to both Democrats and Republicans in recent years chipped into the pot.",
    "Rubin donated $50,000 to Joe Biden’s committees during the 2020 presidential election.",
    "Four people with the last name Asplundh donated $15,000 to his campaign in December.",
    "Oz faces a crowded field in the Republican primary, which will be held May 17.",
    "Other than that, Oz raised just $670,000 from other donors in December.",
    "Other candidates include Carla Sands, Trump’s ambassador to Denmark.",
    "Donors cannot give more than $5,800 directly to campaigns this year.",
    "Former Bridgewater hedge fund CEO David McCormick is also running.",
    "Same with a Pennsylvania real estate developer named Jeff Bartos.",
    "It turns out, some of the richest people in the country.",
    "Then there’s the Republican bigwigs."
  ]
}