{
  "id": 5808,
  "mediaId": 2553,
  "date": "2022-02-06",
  "headline": "Abrams Slammed For Being Maskless Next To Masked Children: ‘This Photo Is Catastrophic’ For Democrats",
  "image": "https://dw-wp-production.imgix.net/2022/02/FBSA-scaled.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/abrams-slammed-for-being-maskless-next-to-masked-children-this-photo-is-catastrophic-for-democrats",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daily Wire News",
  "authorUrl": "https://www.dailywire.com/author/daily-wire-news",
  "termIds": [
    1902,
    2255,
    2722,
    3854,
    4419,
    4654,
    431,
    4984
  ],
  "sentences": [
    "“It is shameful that our opponents are using a Black History Month reading event for Georgia children as the impetus for a false political attack, and it is pitiful and predictable that our opponents continue to look for opportunities to distract from their failed records when it comes to protecting public health during the pandemic,” Abrams’ campaign said in a statement, later adding: “This pathetic, transparent and silly attack is beneath anyone who claims he wants to lead Georgia.”\nWhy is the one person who’s truly at risk of COVID-19 infection the only one not wearing a mask?",
    "Because of course they are.”\nDr. Mehmet Oz, U.S. Senate candidate: “This picture encompasses everything wrong with the far left, like Stacey Abrams and the mandates harming our children.”\nBenjamin Weingarten, RealClearInvestigations: “So they have no explanation for why the indefensible masking of children persists while the non-Governor of Georgia—who is more at risk than the kids—gets to breathe freely.”\nScott Walker, former Wisconsin governor: “This will go down as one of the dumbest political moves in history.",
    "Cooke, National Review: “This photo is catastrophic for Abrams, and her party, and you know it.”\nCaleb Hull, digital strategist: “Stacey Abrams, who is obese and in the high risk category, not wearing a mask while children, who are in the lowest risk category, are all masked just about sums this whole pandemic up.”\nBrian Riedl, economist: “To the surprise of no one, Stacey Abrams is once again refusing to take the ‘L.",
    "It’s that those kids and their families are denied the opportunity to make the same choice.”\nStephen Miller, former Trump adviser: “In so many ways, this picture embodies the elitism, arrogance, cruelty, science denial, and glib authoritarianism of Joe Biden’s Democrat Party.”\nChris Barron, political consultant: “Did she have an invisible mask on?",
    "pic.twitter.com/xQo4W3InNi\n— Donald Trump Jr. (@DonaldJTrumpJr) February 6, 2022\nNotable responses to the incident and to the statement from Abrams’ campaign included:\nBetsy DeVos, former Education Secretary: “It’s not that Abrams chose not to wear a mask.",
    "Abrams’ campaign claimed without evidence that the photo was “a false political attack,” even though a photograph exists of the incident that happened while Abrams was visiting Glennwood Elementary School to kick off its annual African American read-in.",
    "Given her obesity and the co-morbidity concerns with COVID shouldn’t be the one with mask on?”\nKayleigh McEnany, former press secretary: “The Left has betrayed our children with these totally insane COVID mandates.",
    "Georgia Democratic gubernatorial candidate Stacey Abrams faced intense backlash this weekend after a photo surfaced of her being the only person in a room full of children who was not wearing a mask.",
    "'”\nThe Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "This pictures says it all!”\nGuy Benson, Townhall: “Abrams campaign now playing the race card in defending that pathetic photo-op.",
    "Total contempt for voters- particularly parents with kids forced to wear masks in schools.",
    "They can post a million tweets trying to distract but voters can see it.”\nCharles C.W.",
    "Get inside access to The Daily Wire by becoming a member.",
    "Create a free account to join the conversation!",
    "I would run this picture over and over again.",
    "Did someone rip her mask off?",
    "Is this photo-shopped?",
    "Trust the science!!!",
    "What a travesty."
  ]
}