{
  "id": 589,
  "mediaId": 2593,
  "date": "2022-04-11",
  "headline": "Trump Endorses Dr. Oz in Pennsylvania Senate Race",
  "image": "https://ijr.com/wp-content/uploads/2022/04/GettyImages-611389040.jpg",
  "link": "https://ijr.com/trump-endorses-dr-oz-pennsylvania-senate-race/",
  "mediaOutlet": "IJR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "— Erick Erickson (@EWErickson) April 10, 2022\nThis endorsement could divide MAGA in the only way that matters: he could lose America First conservatives over it https://t.co/UC22IlLdFy\n— Joel Pollak (@joelpollak) April 10, 2022\n“This endorsement could divide MAGA in the only way that matters: he could lose America First conservatives over it,” Breitbart News’ Joel Pollak tweeted.",
    "“Perhaps most importantly, I believe that Mehmet Oz will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\nThe race is set to be one of the most competitive this November, as GOP Sen. Pat Toomey is retiring.",
    "(For all the latest news and analysis of the 2022 midterms that you won’t see from the establishment media or Big Tech, make sure to check back with The Western Journal, where we equip readers with the truth from a Christian, conservative perspective.",
    "However, the move has divided Republicans and Trump insiders over Oz’s questionable conservative bona fides and his viability against a likely progressive Democrat challenger for an open seat that currently belongs to the Republicans.",
    "— Ryan Fournier (@RyanAFournier) April 10, 2022\n“It’s like Donald Trump’s staff is sabotaging Trump by convincing him to make the worst possible endorsements,” wrote conservative radio host Eric Erickson in a Twitter post.",
    "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. Mehmet Oz for the United States Senate,” Trump wrote in a statement on Saturday.",
    "While he has name recognition, that isn’t necessarily a good thing; he’s promoted alternative treatments of dubious value on his TV show, something which has raised the heckles of many a medical professional.",
    "Oz is Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our Vets, Tax Cuts, and will always fight for and support our under-siege Second Amendment,” the statement continued.",
    "pic.twitter.com/7gmhZupinr\n— Dr. Mehmet Oz (@DrOz) April 10, 2022\nAs The Hill noted, Trump had initially endorsed former congressional candidate and Army vet Sean Parnell in the race for the GOP nomination.",
    "While Fetterman would normally be well outside the mainstream of Pennsylvania political sentiment, he’s beloved by the left’s fundraising class and could manage to score a win against a weak GOP candidate.",
    "While McCormick had 18 percent vs. Oz’s 17 percent in that survey, when undecided voters were asked to pick which way they leaned, the advantage jumped to 27 percent for McCormick to 21 percent for Oz.",
    "https://t.co/avkowcZRuz\n— Sean Parnell (@SeanParnellUSA) April 10, 2022\nAnd it’s difficult to call that sour grapes when plenty of other individuals in Trump’s orbit were disappointed in the decision.",
    "In what may be the most-watched Senate race in the 2022 midterms, former President Donald Trump has officially thrown his support behind Dr. Mehmet Oz for the Republican nomination in Pennsylvania.",
    "His views on abortion have shifted frequently, with the doctor previously having said he doesn’t believe life begins at conception and that personhood only happens at the point of fetal viability.",
    "John Fetterman, the leading candidate for the senatorial nomination — a burly, goateed progressive who looks like a “Street Fighter 2” character and talks like Bernie Sanders.",
    "I’m ready to bring an America First agenda to the Senate for Pennsylvania.”\nI am honored to receive President Trump’s full support and endorsement, and I thank him for that.",
    "Should the endorsement put Dr. Oz over the top, he could end up being the perfect candidate and turn out to be a rock-ribbed conservative once he enters the upper chamber.",
    "According to the RealClearPolitics polling average as of Monday, Oz is a little more than 2 percentage points behind McCormick, 21.0 percent to 18.4 percent.",
    "A Trump endorsement is a huge boost in a Republican primary, obviously — but there are some close to the former president questioning whether he chose well.",
    "He has no prior government experience and his links to Pennsylvania are tenuous at best, as the (extremely liberal) Philadelphia Inquirer has documented.",
    "Parnell, Trump’s former favorite before he dropped out of the race, blasted the Oz Twitter post accepting the former president’s endorsement.",
    "President Donald J. Trump announces his endorsement of Dr. Oz pic.twitter.com/k6U7UrkmdC\n— Liz Harrington (@realLizUSA) April 9, 2022\n“Dr.",
    "That still feels risky when control of the evenly divided Senate may hang in the balance, however — especially since the words “Sen.",
    "“I am honored to receive President Trump’s full support and endorsement, and I thank him for that,” Oz wrote in a Twitter post.",
    "Of course, Trump has made a career out of proving conventional political wisdom is merely conventional, not necessarily wise.",
    "“I have known Dr. Oz for many years, as have many others, even if only through his very successful television show.",
    "The Sunday endorsement could well give the TV doctor a leg up on his biggest rival, businessman David McCormick.",
    "It’s not just that, if the Republican nominee loses in November, the seat becomes a net gain for the Democrats.",
    "Recent polls have trended toward McCormick, including a poll from The Hill/Emerson College released last week.",
    "It’s like Donald Trump’s staff is sabotaging Trump by convincing him to make the worst possible endorsements.",
    "Parnell withdrew last year amid a contentious divorce from his wife in which she accused him of abuse.",
    "It’s that the beneficiary of that pick-up, in all likelihood, will be Democrat Pennsylvania Lt. Gov.",
    "He has lived with us through the screen and has always been popular, respected, and smart.”\nNEW!",
    "“President Trump knows how critical it is to change the kinds of people we send to Washington.",
    "President Trump knows how critical it is to change the kinds of people we send to Washington.",
    "John Fetterman” should rightly strike fear and loathing in the heart of every Republican.",
    "“I support Trump wholeheartedly – but I disagree with this endorsement and that’s okay.",
    "I support Trump wholeheartedly – but I disagree with this endorsement and that’s okay.",
    "I’m ready to bring an America First agenda to the Senate for Pennsylvania.",
    "I know MANY others feel the same way.”\nDr. Oz will never have my support.",
    "We are committed to truth and accuracy in all of our journalism.",
    "Ever,” tweeted Students for Trump founder Ryan Fournier.",
    "This article appeared originally on The Western Journal.",
    "You’re not even from Pennsylvania,” Parnell wrote.",
    "If you support our mission, consider subscribing.)",
    "And therein lies the problem with Dr. Oz.",
    "I know MANY others feel the same way.",
    "“Hell no.”\nYou’re not America First.",
    "You’re not even from Pennsylvania.",
    "Oz will never have my support.",
    "Read our editorial standards.",
    "You’re not a conservative.",
    "“You’re not America First.",
    "You’re not a conservative.",
    "Hell no.",
    "Ever.",
    "“Dr."
  ]
}