{
  "id": 5927,
  "mediaId": 2528,
  "date": "2022-02-07",
  "headline": "Divorce documents provide a rare glimpse into the wealth of Republican Senate candidate David McCormick",
  "image": "https://i.insider.com/62019a86fa4f1f0018265f95?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/david-mccormick-divorce-senate-wealth-pennsylvania-trump-oz-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "C. Ryan Barber",
  "authorUrl": "https://www.businessinsider.com/author/ryan-barber",
  "termIds": [
    0
  ],
  "sentences": [
    "\"The Husband shall be obligated to make the ONE MILLION ($1,000,000) DOLLAR payment to the Wife set forth above, regardless of how long he remains employed in the public sector so long as he is employed on a full-time basis, which shall be defined for the purposes hereof as working forty (40) hours per week,\" the agreement states.",
    "The divorce documents, obtained by Insider, provide a rare glimpse into the wealth of an ambitious hedge fund executive who reached the pinnacle of his profession and is now attempting to win in what's likely to be one of the most competitive — and expensive — Senate races of the 2022 midterm election.",
    "The advertisements convey a \"regular guy\" image, even as Pennsylvania voters following the Senate race understand that McCormick brings vast personal wealth to the race, said Terry Madonna, a senior fellow in residence for political affairs at Millersville University in Millersville, Pennsylvania.",
    "The agreement between McCormick and his ex-wife, Amy Richardson, defined \"public domain\" as employment in \"any government entity\" and required him to pay the seven-figure sum in a pair of $500,000 installments in the first two years of any full-time public sector job.",
    "The provision was part of the \"alimony and support\" section of the 2015 divorce agreement, which spelled out sums McCormick would have to pay his ex-wife \"during his lifetime, until her death, remarriage, or December 31, 2022, whichever event shall occur first.\"",
    "His wealth quickly emerged as an issue in the wide-open Republican primary field, which includes Carla Sands, who served as US ambassador to Denmark during the Trump administration, and Mehmet Oz, a doctor and TV personality with Trump ties of his own.",
    "McCormick retained ownership of a house in Southport, Connecticut, and 70 acres of farmland in central Pennsylvania, while his wife kept their former primary residence in Westport, Connecticut, along with a cottage and personal plot in the Adirondacks.",
    "Tom Williams/CQ-Roll Call\n'His Pennsylvania roots'\nMcCormick jumped into Pennsylvania's Republican primary in January after the first Trump-endorsed candidate, Sean Parnell, dropped out amid a bitter custody battle with his estranged wife.",
    "\"The White House says that Mr. Biden is coming to our city to 'discuss strengthening the nation's supply chains, revitalizing American manufacturing, creating good-paying, union jobs, and building a better America,'\" McCormick wrote.",
    "McCormick agreed to pay his ex-wife $6 million — in eight annual installments of $750,000 — in a portion of the divorce agreement in which she waived her claims to the discretionary awards and other deferred compensation.",
    "Drew Angerer/Getty Images\nTrump ties\nMcCormick, 56, served in the George W. Bush administration as a top Treasury Department official before joining Bridgewater Associates and rising to become the hedge fund's CEO.",
    "So it's one of those things where money is going to rule in terms of reaching the public, which is not uncommon in our state,\" Madonna said, noting Pennsylvania's relatively large size and multiple media markets.",
    "But McCormick's everyman campaign persona contrasts with the wealth he built from a hedge fund career, according to details contained in a 2015 New York state divorce filing between McCormick and his now ex-wife.",
    "Senate Republican hopeful David McCormick is portraying himself to Pennsylvania's voters as a successful businessman from modest roots who worked on his family farm and served in the first Gulf War.",
    "McCormick's divorce agreement includes a clause stipulating that he would pay his ex-wife $1 million if he voluntarily left his lucrative position at Bridgewater Associates for the \"public domain.\"",
    "He lived for years in Connecticut, where his divorce was adjudicated, but Republicans recruited him to return to Pennsylvania and run to replace retiring Sen. Pat Toomey, a two-term Republican.",
    "An Army veteran and West Point graduate, he was happy with his job at the hedge fund Bridgewater Associates and did not see the deputy defense secretary role as the right fit, Reuters reported.",
    "If elected in November, McCormick would likely avoid having to pay the $1 million because he would not be sworn in until January 2023 — just days after the \"public domain\" clause expires.",
    "McCormick reportedly turned down an offer to serve in the Trump administration as the deputy secretary of defense, a role that likely would have triggered the \"public domain\" clause.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "With the vast wealth from his hedge fund career, McCormick has an ability to self-fund a Senate race in a crowded field in which Oz, his main rival, also brings Trump ties.",
    "Lesser-known Republican candidates have also characterized McCormick, Oz, and Sands as carpetbaggers who have entered Pennsylvania's US Senate race as \"political tourists.\"",
    "An additional Republican vote in the US Senate could be the difference in making or breaking President Joe Biden's agenda during the second half of his 4-year term.",
    "The divorce documents lay out more than $70 million in so-called discretionary awards connected to Bridgewater Associates' \"phantom equity\" incentive award plan.",
    "That's a big argument he's trying to make, to show that he's just one of the folks given his background, even though he's obviously quite wealthy,\" Madonna said.",
    "Divorce agreement between David McCormick and Amy Richardson\nThe last of the eight $750,000 installments is due December 31, according to the divorce agreement.",
    "The full extent of his wealth is unknown, but McCormick comes from a business universe where fellow chief executives can pull in upward of $100 million a year.",
    "In another ad about \"his Pennsylvania roots,\" McCormick reminisced about shooting his first deer and playing running back on his high school football team.",
    "Oz has hosted Trump on his show, and the former Republican president has reportedly been complimentary of the onetime television doctor's Senate candidacy.",
    "A pro-Oz super PAC called American Leadership Action has released an ad panning McCormick as an out-of-touch businessman who's tried to get \"rich off us.\"",
    "His second and current wife, Dina Powell, served as Trump's deputy national security advisor and has close ties to Trump's eldest daughter, Ivanka Trump.",
    "A woman who answered the phone at the office of McCormick's divorce lawyer, Jill Blomberg, said \"no comment\" in response to an inquiry from Insider.",
    "\"The truth is that Mr. Biden is coming to double down on his failed agenda that has decimated Pennsylvania's economy and hurt working families.",
    "McCormick received more than $70 million in discretionary awards connected to a Bridgewater Associates plan, according to divorce documents.",
    "It's a populist campaign message designed to connect with Trumpworld and ultimately help the hedge fund CEO score a new job in Washington.",
    "In late January, he published an op-ed in the Pittsburgh Post-Gazette criticizing Biden ahead of his recent visit to the City of Bridges.",
    "His Senate campaign advisors include former Trump White House aides Hope Hicks, Stephen Miller, and Cliff Sims, according to Politico.",
    "If elected to the Senate, a legislative body full of independently wealthy individuals, he would make an annual salary of $174,000.",
    "As a Senate candidate, McCormick is required to file a financial disclosure at least 30 days before Pennsylvania's May 17 primary.",
    "Announcing his candidacy, McCormick declared that he's running for Senate to \"fight the woke mob hijacking America's future.\"",
    "But the truth is that it was the policies of Mr. Trump that set America on a sure path to reaching all of these goals.\"",
    "Tom Williams/CQ-Roll Call\nRepublican David McCormick brings big money and Trump ties to Pennsylvania's US Senate race.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "In the face of that attack, McCormick has underscored his Bloomsburg, Pennsylvania, upbringing and military service.",
    "McCormick also parted ways with his family's boat — a Sea Ray — but held onto his Harley-Davidson motorcycle.",
    "His ex-wife kept most items in the family's Westport house, save for a select few that McCormick handpicked.",
    "McCormick has turned not just to advertisements but also to the power of the pen for his messaging.",
    "Since Parnell's withdrawal, Trump has yet to make a second endorsement in the Pennsylvania race.",
    "McCormick agreed to pay his ex-wife $1 million if he left his hedge fund for the public sector.",
    "The West Point graduate has touted his service in the Army and his upbringing in Pennsylvania.",
    "David McCormick said he's running for the US Senate in Pennsylvania to \"fight the woke mob.\"",
    "McCormick served in the George W. Bush administration before joining Bridgewater Associates.",
    "\"The anti-McCormick commercials are flooding the market, and so are the anti-Oz commercials.",
    "\"More broadly, he's trying to make the point that he's a Pennsylvanian through-and-through.",
    "Among them was an Iraq map,fossils, a bridge drawing, and two photographs of Pittsburgh.",
    "One campaign advertisement featured him in the high school gym where he once wrestled.",
    "Seven years before the op-ed, his divorce agreement noted a Pittsburgh connection.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "In their divorce, McCormick and Richardson divided bank accounts and property.",
    "Elsewhere in the agreement, the end of 2022 reappears as a significant moment.",
    "Richardson and her divorce lawyer, Frederic Siegel, also declined to comment.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "McCormick and some of his top rivals have been labeled carpetbaggers.",
    "The visit closely followed a bridge collapse in the city.",
    "Already, McCormick's wealth has become a campaign issue.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "McCormick's campaign had no comment.",
    "And he's openly embraced Trump.",
    "Loading Something is loading."
  ]
}