{
  "id": 6071,
  "mediaId": 2634,
  "date": "2022-02-02",
  "headline": "Democrats Can Win the Pennsylvania Senate Seat—if They Don’t Slaughter One Another First",
  "image": "https://images.newrepublic.com/44b3947c2768122753d7ac58e8e79709c355f138.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/165262/pennsylvania-senate-lamb-fetterman-2022",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Strauss",
  "authorUrl": "https://newrepublic.com/authors/daniel-strauss",
  "termIds": [
    2155,
    2533,
    2542,
    3280,
    305,
    803,
    808,
    1163,
    1171,
    5239
  ],
  "sentences": [
    "The primary is divided among four Democrats: Congressman Conor Lamb, who won an intensely fought race for a swingy district in the western part of the state in 2018; Lieutenant Governor John Fetterman, a six-foot-nine Democrat aligned with the progressive wing of the party; state Representative Malcolm Kenyatta, another progressive who is the only Black candidate in the primary; and Dr. Val Arkoosh, the chair of the Montgomery county commission—a crucial Philadelphia suburb.",
    "In the state that offers the best Senate pickup opportunity for Democrats this cycle, Pennsylvania Democrats are having to grapple with an increasingly unwieldy and heated Democratic primary contest, a fact that threatens to play a major role in the direction of the race—and the balance of the Senate in 2022.",
    "“I think engaging the electorate, particularly the base of the Democratic Party, is going to be essential over the next few months to improve chances for the general.”\nBut at some point Democratic voters in Pennsylvania will have to pick a candidate and unite.",
    "I’ve already had to cast those votes so I can provide a level of certainty to the people that I want to represent that I’m going to deliver for them.”\nJoe Calvello, Fetterman’s communications director, said, “2022 is going to be a tough year for Dems.",
    "He’s running against former television host Dr. Mehmet Oz, former Republican nominee for lieutenant governor Jeff Bartos, and former Trump administration Ambassador Carla Sands (who saw a major staff exodus among lackluster fundraising numbers).",
    "David McCormack, a former hedge fund executive who served in the George W. Bush administration’s Treasury Department, has been leveraging his finances and financial connections to rise to contention in the Republican primary.",
    "In this case that would mean if the Democratic fight goes on for a while, Republicans could wait in the wings and use some of the same attacks that Democrats leveled against each other in trying to pick a candidate.",
    "“Yeah, I think it will,” Jonathan Seidel, a Pennsylvania Democratic National Committeeman said when I suggested the internal feuding among the four candidates could go on and intensify until the May 17 primary.",
    "Fetterman got a distant 23 percent, Kenyatta won 15 percent on the second ballot, and Arkoosh did not pass the 15 percent threshold to make it to the second ballot (she got just 17 votes in the first round).",
    "He’s raised $2.7 million in the fourth quarter, and a new internal poll released by the Data for Progress think tank on Tuesday found Fetterman leading the rest of the field by about 30 points.",
    "In interviews I did over the last two days, Democrats are conceding that this primary won’t be locked up with a de facto candidate who can leverage the blue tilt of the state.",
    "Maybe a divided primary with many candidates representing the liberal wing of the party could wake voters up to the urgency of this election and its outsized implications.",
    "“I think the candidates being out there and talking about what’s at stake isn’t necessarily a bad thing,” said J.J. Abbott, a longtime Democratic operative in the state.",
    "In an interview on Tuesday, Lamb told me that the question of who can win in the general election is the main focus of this primary, not some ideological or policy view.",
    "It’s unclear who has the inside track at the moment, but McCormack and Oz both have attributes that could easily propel them to victory: name identification and money.",
    "An extended, bloody primary will often result in a depressed base electorate and a nominee whose faults have already been exposed ahead of the general election.",
    "In other words, a flip of this seat would help Democrats keep and maybe expand their Senate majority, thereby making Joe Manchin’s machinations less pivotal.",
    "Last weekend, the Pennsylvania Democratic Party opted against endorsing any candidate in the state’s primary to succeed retiring Senator Pat Toomey.",
    "There are too many races where they hope to have the advantage and flip a Senate seat: Georgia, New Hampshire, and Arizona all look flappable.",
    "Again and again, Pennsylvania Democrats conceded that although it’s early and the field is divided, the primary would likely stay that way.",
    "The outcome was expected, but it only increased the likelihood of an extended primary with multiple candidates and no presumptive nominee.",
    "There’s real enthusiasm and there’s deep support.”\nThe conventional wisdom is that divided primaries give an advantage to the other side.",
    "Lamb has long associated himself with the more moderate or establishment wing of the party, as someone who represents a swing district.",
    "Research from the University of Chicago found that the vote share could decrease from anywhere between six and nine percentage points.",
    "The candidates in the Republican primary are also jostling to associate themselves most closely with former President Donald Trump.",
    "Support for Trump is a valuable commodity in the primary, as well, but that could end up being a liability in the general election.",
    "There’s research that suggests that divided primaries don’t always kill a nominee’s chances of winning a general election contest.",
    "At last weekend’s endorsement meeting, he came close to getting the official nod and ran far ahead of Fetterman and the others.",
    "For Republicans, winning the Senate race would allow them to retain a seat that could very easily fall into Democratic hands.",
    "Pennsylvania tilts blue, and it even elected a Democratic governor during Trump’s rise to the presidency and time in office.",
    "The Democratic primary is increasingly looking like a major battleground for two rival factions within the Democratic Party.",
    "In the most realistic scenarios where Democrats retain control of the Senate, they will do so by the thinnest of margins.",
    "As with Democrats, there’s no sign that the primary will dwindle down to just one candidate, officially or otherwise.",
    "This is a year when Republican enthusiasm is high across the country and comparably depressed on the Democratic side.",
    "His endorsements are somewhat sparse for a candidate who’s polled ahead of the field and outraised his rivals.",
    "There’s almost no way these two don’t become champions for their opposing factions as the nomination nears.",
    "“I think in the primary it’s basically a single issue, which is who is most likely to win in November.",
    "But in federal races, heated primaries do often hurt a party’s chances of winning a general election.",
    "But I think right now the interplay between the four major candidates is a good thing.” Right now.",
    "Fetterman, who backed Bernie Sanders for president in 2016, is the front-runner by most metrics.",
    "“I’m the only one who has cast votes on all of these important issues that we’re talking about.",
    "“There is a point where the interplay has to stop, and we have to get behind a candidate.",
    "And the margin of victory in this race is very likely to be smaller than that in 2022.",
    "It’s important to note that Republicans have their own increasingly heated primary.",
    "Democrats hope that a divided primary could actually have some beneficial effects.",
    "But Dems are looking at four months of a grueling and potentially rough primary.",
    "The Keystone State is the party’s most likely chance at flipping a Senate seat.",
    "Fetterman is a longtime ally of the Bernie Sanders–progressive wing.",
    "Lamb may not have won the party’s nod, but he just barely missed it.",
    "For all of Fetterman’s advantages, though, he’s far from a sure bet.",
    "A candidate needed two-thirds of the vote to secure the endorsement.",
    "You need someone who people are excited about, and John’s that guy.",
    "That’s what everyone asks me when I’m in front of them,” Lamb said.",
    "But Pennsylvania isn’t the biggest priority for the GOP this cycle.",
    "Pennsylvania is the best pickup opportunity for them this cycle.",
    "For Republicans, this Senate race is somewhat important.",
    "“I think the interplay is good,” Jonathan Siedel said.",
    "The Voting Rights Act and women’s health protections.",
    "Of course the same could be true of the Republicans.",
    "That’s what the state committee want to know about.",
    "He got 61 percent of the vote on the second ballot.",
    "For Democrats, the situation is far more serious.",
    "But Lamb is the favorite of the party insiders.",
    "Viability is an ongoing theme in this primary.",
    "So they don’t really need Pennsylvania.",
    "That’s what the voters are telling me.",
    "It may feel different in May."
  ]
}