{
  "id": 609,
  "mediaId": 2634,
  "date": "2022-04-21",
  "headline": "Is Conor Lamb Collapsing Against John Fetterman in Pennsylvania?",
  "image": "https://images.newrepublic.com/b2ab905b655bbc48e7476fc1030944ac89e23406.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/166164/conor-lamb-collapsing-john-fetterman-pennsylvania",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Strauss",
  "authorUrl": "https://newrepublic.com/authors/daniel-strauss",
  "termIds": [
    0
  ],
  "sentences": [
    "*\nLamb first rose to national prominence when he won a much tougher special election for Pennsylvania’s 18th congressional district in March 2018, beating Republican Rick Saccone by less than one percentage point in a district that had previously been in Republican control since 2003 and that Donald Trump carried against Hillary Clinton.",
    "Figures obtained by The New Republic show that from late March through this week Fetterman was averaging around $500,000 per week on advertising while Lamb’s campaign, during the weeks he’s been dark, was spending $0.",
    "He’s built up a national profile, albeit while skipping out on some of the usual relationship building at home that candidates aspiring for higher office usually do, like schmoozing with local elected officials.",
    "“I haven’t endorsed anybody but if I was a betting man today, I would assume, based on everything I see, that Fetterman would win the primary,” Pennsylvania Democratic National Committeeman Jon Saidel told me.",
    "But he looks to be on course to win the nomination in which case, for once, progressives will get their preferred candidate with the help of more moderate voters instead of the more frequent other way around.",
    "At least as of now it seems to be at least not completely cemented, it’s firming up considerably and I think the biggest thing is [Fetterman’s] money advantage.”\nLamb is in a bit of a nightmarish situation.",
    "McCormick has been able to leverage his Wall Street connections to enjoy a steady flow of money and his advisers have vowed to go on and win the primary for McCormick, Trump’s endorsement be damned.",
    "Fetterman has been on the political scene for years and has firmly ensconced himself as a national Democratic curiosity and minor standard bearer for the Bernie Sanders wing of the Democratic Party.",
    "There is a pro-Lamb super PAC that has been spending on ads essentially on Lamb’s behalf, but that group, Pennsylvania Progress, is averaging $300,000 per week, still behind Fetterman’s campaign.",
    "Donald Trump recently endorsed Oz, and while post-Trump endorsement polling is scant, the possibility that Oz, a TV personality doctor, becomes the Republican nominee for U.S. Senate is serious.",
    "He’s easily recognizable as the only six-foot-nine, hoodie-and-cargo-shorts wearing lieutenant governor in the country firmly entrenched in the progressive movement of the Democratic Party.",
    "A former undersecretary of the Treasury for International Affairs during the Bush administration, he’s married to former Trump administration Deputy National Security Advisor Dina Powell.",
    "Some of that money is available only for the general election, and there too Fetterman has the advantage: The lieutenant governor has $3.9 million while Lamb has just $1.2 million.",
    "One of McCormick’s first moves in his Senate bid was to hire the same Republican consulting firm that advised Republican Glenn Youngkin on his successful gubernatorial campaign.",
    "Increasingly, Pennsylvania Democrats expect Fetterman to win and are chalking up Lamb losing to a poorly executed campaign, even with a host of local endorsements.",
    "The danger there is that could leave lasting scars for Pennsylvania Democrats and depress some of the voters the eventual nominee needs in the general election.",
    "“I think the biggest thing right now has been he’s been the candidate with the high profile and the money,” Democratic strategist Mike Mikus said of Fetterman.",
    "His war chest is low, and although the pro-Lamb super PAC is providing air cover for him he’s still not matching his primary archenemy with a few weeks to go.",
    "He’s no stranger to being a formidable fundraiser and Cooper Teboe, an adviser to Democratic megadonor Karla Jurvetson, has been advising Lamb’s campaign.",
    "Meanwhile, Fetterman has been cranking out ads this whole time with recent ones focused on specific issues like marijuana, immigration, and LGBTQ rights.",
    "In the final weeks before the Pennsylvania Democratic primary for Senate, one of the best ways to see how that contest is going is through advertising.",
    "His only realistic play outside of some external Hail Mary in his favor is to amp up the acrimony in the race and attack Fetterman on anything he can.",
    "Speaking of the Republican side, for much of the race it seemed like former Bridgewater CEO David McCormick was the sure bet for the nomination.",
    "Trump said in his endorsement that he was drawn to endorse Oz partially because Oz’s background is in television, as the host of Surgeon Oz.",
    "The most recent Franklin & Marshall poll of the Democratic Primary found Fetterman leading the rest of the field with 41 percent support.",
    "Fetterman, 52, has an undergraduate degree from Albright College in Reading and a master’s in public policy from Harvard University.",
    "In Congress, Lamb has been a member of the bipartisan Problem Solvers Caucus and of the Congressional LGBT Equality Caucus.",
    "There hasn’t been much polling since Trump endorsed, but the most recent poll showed Oz in the lead by mid-single digits.",
    "Pennsylvania Democrats, like Democrats in similar major battleground states, put a lot of energy into being pragmatic.",
    "He’s the moderate in the race and is the choice of party insiders in this hard-fought state in a tough election cycle.",
    "But the seat Lamb, Fetterman, Oz, and McCormick are vying for is held by retiring Senator Pat Toomey, a Republican.",
    "Oftentimes that view excludes the favored candidates of the activist wing of the Democratic Party like Fetterman.",
    "He filled his campaign with alumni of the Trump administration, but in the end Trump’s endorsement went to Oz.",
    "The clip at which Lamb’s campaign has been sending out fundraising emails is eclipsed by Fetterman’s team too.",
    "Lamb had been off the air since March but went back up in the last week, according to an ad tracking source.",
    "* This article originally misstated which of Lamb’s family members is the city controller of Pittsburgh.",
    "Lamb had 17 percent support and state Representative Malcom Kenyatta of Philadelphia was at 4 percent.",
    "He was an active-duty Marine for four years and is currently a major in the U.S. Marine Reserve Corps.",
    "Paradoxically, Lamb’s successful congressional race garnered national attention and a flood of money.",
    "His grandfather, a Navy veteran of World War II, was a member of the Pennsylvania General Assembly.",
    "The centrist congressman ran no TV ads for nearly three weeks—with the primary just one month away.",
    "He’s clearly an unconventional candidate (how many former Turkish soldiers run for federal office?)",
    "McCormick’s credentials and approach to the race seemed impeccably tailored to Trumpy Republicans.",
    "Whoever wins will face either Dr. Mehmet Oz or former Bridgewater Associates CEO David McCormick.",
    "with some of the normal credentials of a modern candidate: Like Fetterman, he’s a Harvard grad.",
    "Increasingly, it looks like Fetterman will face whomever emerges from the Republican primary.",
    "As of the end of March, Fetterman had $4.2 million cash on hand while Lamb had $2.2 million.",
    "John Fetterman is a statewide elected official, was able to build an artificial lead early.",
    "Two years before that, incumbent Governor Tom Wolf won reelection by almost 900,000 votes.",
    "Fetterman is a former mayor of Braddock, a tiny town in the eastern suburbs of Pittsburgh.",
    "Lamb was also an assistant U.S. attorney for the Justice Department’s Pittsburgh office.",
    "He got both his undergraduate and law degrees from the University of Pennsylvania.",
    "Joe Biden won Pennsylvania by just about 80,000 votes out of almost 7 million.",
    "Even though it’s a bad election cycle for Democrats, this is Pennsylvania.",
    "Fetterman previously ran a longshot Senate campaign in 2016 to no success.",
    "Most polling shows Fetterman well ahead of Lamb in the May 17 primary.",
    "The two candidates will have their first debate on Thursday night.",
    "“I mean Conor Lamb was never a permanent presence on cable news.",
    "But for Lamb, the primary has been telling in a different way.",
    "They tend to try and pick a candidate who can win a general.",
    "The 37-year-old Lamb seems like a dream candidate on paper.",
    "Lamb’s family has political roots in Pennsylvania as well.",
    "MoveOn is one of the outside groups that has endorsed him.",
    "The second time looks like it will be the trick for him.",
    "Signs are good for Lieutenant Governor John Fetterman.",
    "It’s a competitive but definitely light blue state.",
    "Lamb’s uncle is the city controller of Pittsburgh.",
    "He’s also proven to be a formidable fundraiser.",
    "But for Congressman Conor Lamb, not so much.",
    "Voters seem to like the Fetterman package.",
    "He has about twice as much money as Lamb.",
    "Fetterman also has a money advantage.",
    "The outcome is still uncertain."
  ]
}