{
  "id": 6110,
  "mediaId": 6571,
  "date": "2022-02-05",
  "headline": "Pennsylvania Republican Party Decides Against Endorsing Candidates In Senate And Governor Races",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/11/03/354d7ebd-3f50-4e6f-a07c-92137399b2e4/thumbnail/1200x630/ec5739de5c06048c3655b749407e516e/election-day-1.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/pa-gop-not-making-endorsements/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4021,
    883,
    1171,
    5010,
    5083,
    5239
  ],
  "sentences": [
    "The Senate field is notable for wealthy and well-connected candidates moving from out of state to run, including Mehmet Oz, best known as daytime TV's host of \"The Dr. Oz Show,\" and David McCormick, the just-resigned CEO of one of the world's largest hedge funds.",
    "HARRISBURG, Pa. (AP) — The Pennsylvania Republican party on Saturday decided against endorsing in huge primary fields for governor, U.S. Senate, and lieutenant governor, ensuring that this spring's races will be that much more wide open.",
    "The former president had endorsed Sean Parnell in the Senate primary, but Parnell ended his campaign in November amid an ugly custody battle with his estranged wife.",
    "The primary field for governor is double-digits deep, while the fields for Senate and lieutenant governor each feature at least a half-dozen candidates.",
    "It is the first time in decades that Pennsylvania has held an election for an open Senate seat and an open governor's office.",
    "The party banned reporters from the ballroom where it held its winter meeting at a Lancaster hotel.",
    "However, committee members and candidates said the party held a voice vote against endorsing.",
    "Both candidates and their allies, meanwhile, are spending millions of dollars on TV ads.",
    "Party committee members had predicted for months that nobody would win an endorsement.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "In addition, no candidate can claim the endorsement of Donald Trump.",
    "(Copyright 2022 The Associated Press.",
    "The primary is May 17.",
    "All rights reserved."
  ]
}