{
  "id": 612,
  "mediaId": 2524,
  "date": "2022-04-15",
  "headline": "Dr. Oz says the left thinks human beings are cockroaches and that's why they don't like fracking",
  "image": "https://i0.wp.com/boingboing.net/wp-content/uploads/2022/04/oz.jpeg?fit=1200%2C798&ssl=1",
  "link": "https://boingboing.net/2022/04/15/dr-oz-says-the-left-thinks-human-beings-are-cockroaches-and-thats-why-they-dont-like-fracking.html",
  "mediaOutlet": "Boing Boing",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Frauenfelder",
  "authorUrl": "https://boingboing.net/author/mark_frauenfelder_1",
  "termIds": [
    2232
  ],
  "sentences": [
    "The reality is that there are many legitimate reasons to oppose fracking, such as\nwater contamination\nrelease of methane gas, which is a powerful greenhouse gas\ndisruption of local ecosystems\ngas explosions\nnoise and visual pollution\ntoxic chemical exposure\nNone of these have anything to do with some kind of conspiracy to keep humans from prospering.",
    "Nostrum peddler and GOP political candidate Mehmet Oz shared his bizarre thinking about human beings, God, and fracking on Ted Nugent's internet video show, The Nightly Nuge.",
    "If you think God created man to be something that was special, unique, and that is the divinity — I can look in your eyes I see that spark of God in you.",
    "But if you think we're bad, evil, toxic creatures that should not be on the planet, you're going to block every effort and that's what happened.",
    "If you believe that, then you would want us harvesting the cleanest energy possible and using it while we move to even better sources.",
    "If anything, Oz must think people are cockroaches, the only creatures hardy enough to survive an environment ravaged by fracking.",
    "They are simply the result of fracking being an industrial process that comes with environmental costs.",
    "If you give us tools to prosper, we'll just destroy more because we're not a force for good.",
    "The far left believes we're a pestilence, human beings are cockroaches on the planet.",
    "Here's why I think they don't want energy coming out of the ground.",
    "This is, of course, a completely unfounded and ridiculous claim."
  ]
}