{
  "id": 617,
  "mediaId": 2656,
  "date": "2022-04-12",
  "headline": "The Silly Talk of Trump's Demise Over Oz Endorsement",
  "image": "https://media.townhall.com/townhall/reu/o/2022/59/1110ed01-b9e6-4dbb-b90b-98946a400e3e-1110x740.jpg",
  "link": "https://pjmedia.com/news-and-politics/rick-moran/2022/04/12/the-silly-talk-of-trumps-demise-over-oz-endorsement-n1588962",
  "mediaOutlet": "PJMedia",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rick Moran",
  "authorUrl": "https://pjmedia.com/columnist/rick-moran",
  "termIds": [
    2201,
    3267,
    3434,
    4021,
    878,
    1171,
    4814,
    5199,
    5239
  ],
  "sentences": [
    "A former Senate candidate in Pennsylvania, Sean Parnell, was quoted as saying, “Oz is the antithesis of everything that made Trump the best president of my lifetime.”\n“Is Trump being undermined by his staff?” Rep. Mo Brooks (R-Ala.), who is running for the Senate in Alabama and recently had Trump withdraw his support, thinks that there’s a conspiracy by Mitch McConnell loyalists who slithered their way into Trump’s confidence.",
    "Across each of the four early primary states, the former president is more popular than other prominent GOP figures, including: Vice President Mike Pence, who’s seen positive sentiment decline across the map since January 2021; Senate Minority Leader Mitch McConnell (R-Ky.), who is most polarizing among the GOP electorate; and House Minority Leader Kevin McCarthy (R-Calif.), who is still largely unknown to the rank and file.",
    "“It’s one thing to say, ‘Trump is popular,’ and quite another to say, ‘voters will do whatever they are told every time,’” she said, shaking off the potential losses of Trump-backed candidates as a pivotal indicator of Trump’s power with the GOP base.",
    "So while the mainstream press is celebrating Trump’s imminent downfall and loss of support from Republican voters, they once again demonstrate a cluelessness about ordinary voters by prematurely predicting Trump’s demise.",
    "Noting how candidates are seeking his endorsement, he said, “our numbers are higher than ever.”\nIndeed, Trump’s popularity among Republicans in those states roughly matches his standing nationwide.",
    "Gail Gitcho has worked for a wide ideological and stylistic gamut of GOP candidates, from Sen. Mitt Romney’s 2012 presidential campaign to Sen. Josh Hawley’s successful 2018 bid.",
    "In fact, even if a Trump-backed candidate loses in any of those Senate primaries, it won’t mean that Trump’s influence is diminishing.",
    "So they reduce an entire complicated, obscure reality to a few silly generalizations and proclaim the end of Trump’s influence.",
    "Trump has a favorable rating in Georgia of 86%, in North Carolina, it’s 87%, in Ohio, it’s 80%, and in Pennsylvania, it’s 77%.",
    "The question of Trump’s popularity appeared to be on his mind when he sat last week for an interview with The Washington Post.",
    "Donald Trump’s recent endorsement of Dr. Mehmet Oz in the Pennsylvania Republican Senate primary shook MAGA world to its core.",
    "“This is happening because Trump’s surrounded himself by staff who are on McConnell’s payroll & hostile to the MAGA agenda.",
    "The media hates this sort of ambiguity because they can’t wrap it up, tie it down, and present it as unbridled truth.",
    "She said there is a difference between political authority with voters and the ability to totally pull their strings.",
    "Trump will be a force in the Republican Party for as long as he’s above ground and probably long afterward.",
    "Oz, like Trump before him, was invited into people’s living rooms and family rooms for nearly 20 years.",
    "Some MAGA loyalists think that Trump will lose “America First conservatives” over his choice.",
    "“That means people like you.”\nThe power of celebrity in politics is vastly underestimated.",
    "Giving him a premature burial only shows how desperate some people are to see him gone.",
    "Everybody telling Trump who to endorse in primaries works for The Swamp,” Brooks said.",
    "Trump is counting on voter familiarity with Oz being the deciding factor in the race.",
    "“When you’re in television for 18 years, that’s like a poll,” Trump said of Oz.",
    "The latest Morning Consult poll should clarify that fact.",
    "Again.”\nTrump had his own reasons for endorsing Oz.",
    "There’s too much nuance, too much uncertainty.",
    "It’s just too hard to explain.",
    "It’s a pretty good bet.",
    "“They played him."
  ]
}