{
  "id": 628,
  "mediaId": 2522,
  "date": "2022-04-13",
  "headline": "Mick Mulvaney throws some curve balls on who he believes can derail Trump’s potential reelection",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/04/sg-Trump-feature-e1649868278238.jpg",
  "link": "https://www.bizpacreview.com/2022/04/13/mick-mulvaney-throws-some-curve-balls-on-who-he-believes-can-derail-trumps-potential-re-election-1225400/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joshua Nybo",
  "authorUrl": "https://www.bizpacreview.com/author/joshua-nybo/",
  "termIds": [
    1301,
    2201,
    3874,
    3975,
    4357,
    878
  ],
  "sentences": [
    "Given Trump’s questionable actions that jeopardize a 2024 run, such as his highly controversial endorsement of Mehmet Oz in the Pennsylvania Republican primary for one of the state’s Senate seats, some believe that Trump doesn’t plan to run at all:\nTrump’s endorsement of Mehmet Oz over McCormick in the Pennsylvania Senate GOP primary has outraged numerous prominent Trump supporters, who now say they’ll support DeSantis in 2024 over Trump.",
    "He wound up taking a pass at the 2020 race, but has stated in an interview with USA Today last year that he’s still toying with the idea, and would run “if that’s what the people wanted.”\n“Truly I mean that, and I’m not flippant in any way with my answer.",
    "DeSantis has been a Republican darling, rising to prominence during the Covid-19 pandemic with his defiant stance against the Biden administration and solidly conservative positions in social policy and culture wars.",
    "There’s been much speculation that Trump has his eyes on the Oval Office with his vocal presence on social media (where it’s allowed) and his campaign-style rallies continuing to draw large crowds across the nation.",
    "The poll indicated that people don’t actually mind celebrities and movie stars in leadership positions, due to the name recognition and the charisma and appeal that is needed to become a star in the first place.",
    "Speaking to Politico in an item that was published on Wednesday, Mulvaney gave a rundown of people who he believes could derail the Trump train:\n“[Governor Ron] DeSantis could give him a run for his money.",
    "Mulvaney believes he could indeed in the primary battle that is likely going to feature a large and diverse cast in 2024, and with a little help from the Trump camp itself.",
    "— Palmer Report (@PalmerReport) April 10, 2022\nEither way, it would seem that Trump’s worst enemy may the same as everyone else’s: the person in the mirror.",
    "However, there are a few surprising names that Donald Trump’s former Chief of Staff considers to be significant contenders for the White House.",
    "However, according to Mulvaney the dark horse challenger that he believes poses the gravest danger to Trump… is Trump himself.",
    "Actually, a surprising number, according to a Piplsay poll in 2021, which indicated a notable amount of interest in the idea.",
    "Trump’s former top staffer Mick Mulvaney, however, believes there are a few names that could give Trump serious trouble.",
    "SIGN UP HERE\nThere’s a long list of Republicans who smell blood in the water regarding the presidency of Joe Biden.",
    "Donald Trump is sometimes his own worst enemy when it comes to campaigning,” Mulvaney told Politico.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "I would have my finger on the pulse, my ear to the ground,” Johnson said in the interview.",
    "In 2017, he told GQ that there was a “real possibility” of him running for president.",
    "The actor and former wrestling star has spoken of a presidential run for years now.",
    "Dwayne ‘The Rock’ Johnson could give him a run for his money,” he said.",
    "That would be up to the people … So I would wait, and I would listen.",
    "“There’s one other person who could beat him — which is himself.",
    "It’s increasingly obvious he’s not trying to set up a 2024 run.",
    "Johnson and politics aren’t necessarily a radically new idea.",
    "[Senator] Tim Scott [R-SC] can give him a run for his money.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "Seeing his name in the front of the pack is no shocker.",
    "The public will not see it and we do not share it.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "But could The Rock thrash Trump?",
    "How many people want that?",
    "As if Trump cares."
  ]
}