{
  "id": 6361,
  "mediaId": 2658,
  "date": "2022-01-16",
  "headline": "POLITICO Playbook: A night at the Trump rally",
  "image": "https://static.politico.com/7f/98/dc2c713d4f648264608653a79172/gettyimages-1364881984.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/01/16/a-night-at-the-trump-rally-495742",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1301,
    1589,
    2149,
    2201,
    2400,
    3434,
    3975,
    831,
    5371
  ],
  "sentences": [
    "“One more thing: After talking for weeks about the booster and the vaccine, [Trump] barely mentioned it and focused instead on going after vaccine mandates.”\nThe Arizona Republic’s Ronald Hansen, Ray Stern and Dan Nowicki have some more highs and lows from the 93-minute speech, which they call an “updated version of Trump’s usual America-first rhetoric, long on personal boasts and lacking in subtlety.”\n— He repeated demonstrably false claims about the 2020 election being “rigged,” fumed that news media “refuse to talk about it,” and said that referring to his grand lies about the election as a “Big Lie” is itself “a lot of bullshit.”\n— He “decried the treatment of those arrested in connection with the insurrection, calling it an ‘appalling persecution of political prisoners.’ He called their continued confinement ‘brutal lockdowns.’ Trump called the police officer who killed ASHLI BABBITT, the California woman who was climbing through a barricaded door outside House offices, ‘a dope.’”\n— He attacked Gov.",
    "Troy Balderson (R-Ohio) (6-0) … USAID’s Luke Knittig … Maria Hatzikonstantinou of CRC Public Relations … Vincent Frillici … Bracewell’s Frank Maisano … Clay Dumas of Lowercarbon Capital … Iulia Gheorghiu … Dan Hill … Greg Polk … Matt Herrick of the International Dairy Foods Association … The Daily Beast’s Kelly Weill … Genevieve Wilkins of Rokk Solutions … Cameron Poursoltan … Bruce Collins … POLITICO’s Jerry Gray … NYT’s Sheera Frenkel … UPS’ Dontai Smalls … Kelley Williams ... Paolo Liebl von Schirach ... Jackie Huelbig ... Linda Semans … Ed Cafiero of Marathon Strategies … former Labor Secretary Alexander Acosta … former Rep. Diane Black (R-Tenn.) … former Coast Guard Commandant Adm. Thad Allen … Cathryn Donaldson ... Debbie Berger Fox ... Mitch Dworkin ... Norman Podhoretz … Sam Pritchard\nDid someone forward this email to you?",
    "NYT’s Ross Douthat tries to imagine “some kind of strategic vision behind the Biden administration’s recent decision making — the strange pivot from the stalled-out Build Back Better negotiations to election reform theatrics, in which a president with miserable approval ratings managed to advertise his own political weakness and alienate potential negotiating partners, all in the service of legislation remote from most Americans’ immediate concerns and unlikely to address the genuine problems in the system.”\n— A (slightly early) look at Biden’s first full year in office, from AP’s Zeke Miller and Calvin Woodward: “For Biden, it’s been a year of lofty ambitions grounded by the unrelenting pandemic, a tough hand in Congress, a harrowing end to an overseas war and rising fears for the future of democracy itself.",
    "Fifty-nine of the 91 have questioned the 2020 election results, according to an NBC News review, including those who voted against certifying President Joe Biden's victory in Congress.”\nIntroducing the ‘anti-endorsement’: “[Trump] has also become enamored of the anti-endorsement, ripping into Republican incumbents who challenge him or his lie about the election.”\nTHE WHITE HOUSE\nSECOND GENT FILES — AP’s Will Weissert and Darlene Superville talk to DOUG EMHOFF about his first year as the nation’s first-ever second gentleman, a role in which he has emerged as a “public link to White House.” Emhoff has “visited 31 states over the past year, meeting with doctors, parents, community leaders and small-business owners everywhere from Albuquerque, New Mexico, to Allentown, Pennsylvania.",
    "The first banned “the teaching of critical race theory, an academic framework for examining racism in society that has never been part of the state’s public school curriculum.” The second was “aimed at giving parents the ability to opt out of mask mandates in schools, which Democratic former governor RALPH NORTHAM’s health commissioner had ordered statewide for public and private K-12 schools.”\nALL POLITICS\nOZ LOSES BIG IN PA GOP STRAW POLL — POLITICO national political reporter and resident Pennsylvania expert Holly Otterbein writes in:\nMEHMET OZ didn’t get a very warm welcome from party activists in Pennsylvania on Saturday.",
    "The former Pentagon chief has provided conflicting testimony to Congress in the past, at one time saying that former President Donald Trump had ‘encouraged the protesters’ with his remarks on Jan. 6 and then later saying he believed an ‘organized conspiracy’ played a role in the Capitol attack.”\nPOLICY CORNER\nCENSUS TROUBLES — NYT’s Michael Wines has the scoop on a “newly disclosed memorandum citing ‘unprecedented’ meddling by the Trump administration in the 2020 census” that was circulated among Census Bureau officials.",
    "And some clinics and family practices that typically provide care that can keep people from landing at hospitals are closing because Omicron has hobbled their workforces, too.”\n… MEETS VACCINE RESISTANCE — On the heels of the Supreme Court’s decision to uphold a vaccine mandate for health care workers, “the nation’s health care systems braced for the possibility of some resistance and more staff shortages — particularly in the states that banned mandates or had none,” NYT’s Audra Burch and Reed Abelson report.",
    "Biden’s opportunity could be to try to shift the focus, to prompt swing suburban voters to ask themselves whether a Republican Congress would return the country to the chaos of the Trump years, with House GOP leaders promising retribution if they take control and the party generally lacking a clear governing agenda.”\nSUNDAY BEST …\n— “Frustrated” and “disappointed” are the most common words Americans use to describe how the Biden presidency has made them feel one year in, per new CBS polling.",
    "WaPo’s Matt Viser and Seung Min Kim report that McConnell was “incensed over Biden comparing opponents to the legislation to [GEORGE] WALLACE, [JEFFERSON] DAVIS and [BULL] CONNOR,” and have this interesting detail: “Biden, while at the Capitol on Wednesday, went into McConnell’s office to attempt to meet with him directly, intending to — as he later recounted to Senate Democrats — explain to McConnell that he wasn’t likening him to the notorious racists and segregationists.",
    "I don’t know where we got the notion from that this democracy is here to stay no matter how we conduct ourselves.” More from Hannah Farrow\n— Surgeon General VIVEK MURTHY on the Supreme Court blocking Biden’s large-employer vaccine mandate, on ABC’s “This Week”: “It was a setback for public health, because what these requirements ultimately are helpful for is not just protecting the community at large, but making our workplaces safer for workers as well as for customers.",
    "Glenn Youngkin received the key to the Virginia governor’s mansion from Ralph Northam — “a plastic card — punctured by tooth marks from [Northam’s] Labrador puppy, Pearl.”\nSPOTTED at Youngkin’s inauguration party Saturday night at Main Street Station in Richmond, which featured the Zac Brown Band: Suhail Khan, Jill and Alex Vogel, David Javdan, Jeff Roe, Ashley Gunn, Samantha Dravis, Bill Guidera, Becca Glover, Kristin Davison, Devin O’Malley and Ali Ahmad.",
    "NBC’s Jonathan Allen and Marc Caputo have the details of Trump’s “sometimes secretive process” for handing out endorsements, as “described in interviews with more than half a dozen people familiar with aspects of the endorsement operation.”\nThe golden ticket: “The most common theme of Trump's endorsements, particularly at the state level, is that he is backing candidates who have voiced support for his lie that the 2020 election was rigged against him.",
    "So the good news, though, is that there is nothing that stops workplaces from voluntarily putting these requirements in place.”\n— Rep. MICHAEL MCCAUL (R-Texas) on how the U.S. withdrawal from Afghanistan has emboldened Russia on Ukraine, on “State of the Union”: “Our foreign adversaries, like Putin, President XI in China, the ayatollah and KIM JONG UN, all view that as a moment of weakness.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nTRUMP CARDS\nWhile Trump was in Arizona on Saturday, “2,000 miles to the east in Washington, there are small signs that some Republicans are tiring of the charade,” AP’s Jill Colvin writes, citing the reaction to South Dakota Sen. MIKE ROUNDS’ acknowledgment of “the reality that the election was in fact fair,” among other things.",
    "MIKE LINDELL, the MyPillow CEO, was treated like a rockstar and repeated his untrue claims of a rigged election; KARI LAKE, who has Trump’s support in her campaign for governor, said she wanted to lock up ANTHONY FAUCI and anyone involved in the 2020 election; Rep. PAUL GOSAR talked of a ‘storm coming’ — a phrase used by QAnon supporters.",
    "“The issues involved crucial technical aspects of the count, including the privacy of census respondents, the use of estimates to fill in missing population data, pressure to take shortcuts to produce population totals quickly and political pressure on a crash program that was seeking to identify and count unauthorized immigrants.",
    "McConnell wasn’t there, however, so they didn’t meet.”\n— The 30,000-foot view, via WSJ’s Ken Thomas: “Taken together, Mr. Biden’s rough week put into sharp relief the limits of the president’s powers, as he finds himself with little recourse to tame a pandemic, halt inflation or coax victories out of a 50-50 Senate,” he writes.",
    "“He takes office in the midst of two states of emergency — a 30-day limited state of emergency aimed at the state’s hospitals, which are struggling amid soaring coronavirus caseloads, and another ahead of a snowstorm slated to hit the state Sunday,” write WaPo’s Gregory Schneider and Laura Vozzella.",
    "In particular, the administration was adamant that — for the first time ever — the bureau separately tally the number of undocumented immigrants in each state.”\nVALLEY TALK\nMUSK-READ — ELON MUSK is the world’s richest man, CEO of Tesla, CEO of SpaceX and apparently a man with time to hold a grudge.",
    "… His training as a lawyer, he says, taught him the value of ‘listening over talking and really trying to understand issues, understand people and understand a problem.’”\nVIRGINIA\nYOUNGKIN SWORN IN — On Saturday, GLENN YOUNGKIN took the oath of office to become Virginia’s 74th governor.",
    "POLITICO Playbook: A night at the Trump rally\nBy TARA PALMERI\n01/16/2022 11:36 AM EST\nPresented by\nDRIVING THE DAY\nIt was cold, dusty and more than an hour south of Phoenix … and yet about 15,000 people showed up Saturday night for DONALD TRUMP’s first campaign rally of 2022.",
    "Our roving Trump rally correspondent Meridith McGraw texts in from Arizona:\n“The rally was supposed to be about turning people out for the midterms, but I got the feeling they weren’t really there to hear about 2022 — they were way more interested in what happened in 2020.",
    "“Authorities said the hostage-taker was killed in a shooting but did not answer a question about whether he was shot by law enforcement or if the gunshot was self-inflicted.”\nPLAYBOOKERS\nKathy Hochul forecast Saturday night’s victory by the Buffalo Bills incredibly well.",
    "‘I don’t see any situation in which he does,’ one top adviser said.”\nWHO’S TALKING — CHRISTOPHER MILLER, the acting Defense secretary at the time of the Jan. 6 Capitol attack, met Friday with members of the committee, NBC’s Courtney Kube and Leigh Ann Caldwell report.",
    "The survey shows Americans don’t think Biden is focused enough on inflation and the economy, though they don’t blame him entirely for rising prices, and that getting inflation under control would change their minds on Biden much more than passing Build Back Better.",
    "But “the panel is divided on whether to pursue such subpoenas, in part over fears that a protracted legal fight would delay the committee’s goal of issuing a report ahead of the November midterms,” WaPo’s Tom Hamburger, Josh Dawsey and Jacqueline Alemany report.",
    "DOUG DUCEY as a “terrible representative of your state,” and said that the Republican, who is mulling a run against Democratic Sen. MARK KELLY, is “not going to get my endorsement.”\nOn the scene: Mark Peterson photographed the rally for POLITICO.",
    "“The last several days are likely to intensify criticism — from Republicans, some within the Democratic Party and voters — that Mr. Biden has played the cards that he does hold badly, a sentiment broadly reflected in his low approval ratings.",
    "— House Majority Whip JIM CLYBURN (D-S.C.) on the existential stakes for election reform, on CNN’s “State of the Union”: “If we do not protect the vote with everything that we’ve got, we will not have a country to protect going forward.",
    "Options for obtaining his cooperation have been discussed in preliminary conversations between the committee’s chief counsel, TIM HEAPHY, and Pence’s attorney, RICHARD CULLEN, who was just named as counselor to Virginia Gov.",
    "… In the dispiriting close of Biden’s first year, roadblocks stood in the way of all big things pending.” And here’s RON KLAIN: “The Biden presidency remains a work in progress.”\n— Is there a “second act” ahead for Biden?",
    "TRANSITION — Malcolm Wright, the former chief compliance officer at BitMEX, has joined Shyft Network to head the company’s Veriscope expansion and serve as head of strategy for global regulatory and compliance solutions.",
    "It’s only one small survey of party insiders — but still, Oz’s dismal showing has Republicans abuzz that his past comments in favor of abortion rights and “red flag” gun laws might be hurting him among the grassroots.",
    "WSJ’s Rebecca Elliott, Justin Scheck and Drew FitzGerald report that last year, the Cooley law firm was given an ultimatum by Tesla, one of its most famous clients: fire one of its attorneys or lose Tesla’s business.",
    "“The memo laid out a string of instances of political interference that senior census officials planned to raise with WILBUR ROSS, who was then the secretary of the Commerce Department, which oversees the bureau.",
    "BIDEN’S ROUGH WEEK — If you somehow missed the relentless drumbeat of tough news for Biden as of late, Maureen Dowd’s got you covered in this morning’s NYT: “Oh, the tribulations of Job Biden!",
    "RNC Chair Ronna McDaniel was at the inauguration Saturday morning, and Reince Priebus was at a “Spirit of Imagination” candlelight dinner for Youngkin at the Science Museum on Friday night.",
    "Oz was there, along with ex-Bridgewater Associates CEO DAVID MCCORMICK, real estate developer JEFF BARTOS, former ambassador CARLA SANDS and political commentator KATHY BARNETTE.",
    "So we are not projecting strength, as REAGAN talked about, but rather projecting weakness, which, historically, going back to HITLER and CHAMBERLAIN, always invites aggression.",
    "BEYOND THE BELTWAY\nTEXAS HOSTAGES FREED — After being held captive for nearly 11 hours Saturday, three hostages in a Colleyville, Texas, synagogue were freed unharmed.",
    "At a hotel just outside Harrisburg, candidates in the GOP primary for Senate spoke at the first of several regional caucus meetings of the state Republican Party.",
    "WaPo’s Dan Balz: “Looking to November, absent a turnaround, the more the elections become a pure referendum on the president, the more his party will suffer.",
    "THE PANDEMIC\nTHE OMICRON CRUNCH … Hospitals across the country are struggling to keep up with a surge in Omicron-induced cases, WSJ’s Julie Wernau writes.",
    "The dozen people I talked to before Trump got on stage really felt like there is a path for overturning the election, even though there is zero chance.",
    "Those stood at 42% Friday, according to FiveThirtyEight’s aggregation of public polls, down from 53% when he took office.”\n— What’s the strategy here?",
    "Bartos, whose team has aggressively courted state party members, came in first place, followed by Barnette, McCormick and Sands, respectively.",
    "The attorney in question formerly worked at the SEC, and in that capacity had interviewed Musk during the agency’s investigation of Tesla.",
    "Check out his photo essay, \"MAGA hats and QAnon: Inside Trump’s first rally of 2022\"\nGood Sunday morning, and thanks for reading Playbook.",
    "“Cooley has declined to fire the attorney,” the WSJ reports, and now, Musk’s companies are taking some of their legal business elsewhere.",
    "“In his speech, Trump gave a boost to his endorsed candidates, slammed [President JOE] BIDEN, the media and his other political enemies.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "Biden’s pandemic rating is also at a record low, with confusing information from health officials topping the list of concerns.",
    "— Lawmakers on the Jan. 6 select committee want to bring in some of their colleagues and former VP MIKE PENCE for questioning.",
    "“For Pence, the committee’s goal would be to get the former vice president to answer questions under oath, ideally in public.",
    "… And I think you’re going to see a lot more of it.”\nBIDEN’S SUNDAY — The president has nothing on his public schedule.",
    "Café Mozart, the beloved hole-in-the-wall German restaurant in downtown D.C., has reportedly closed its doors for good.",
    "Many rural facilities say they can’t afford to hire travel nurses at rates that have skyrocketed during the pandemic.",
    "The hostage-taker is dead “after a hostage rescue team breached the building,” reports the Fort Worth Star-Telegram.",
    "Afterward, the party faithful took a straw poll — and Oz got a single vote out of the 100-plus ballots cast.",
    "Beyond all that, the most striking feature wasn’t Trump himself, but the people he invited to introduce him.",
    "And they were most psyched about the possibility Trump could announce another run — if not him, Florida Gov.",
    "Even STACEY ABRAMS stiffed him.”\n— Not even Biden’s big speech in Atlanta seemed to go quite as planned.",
    "On the other hand, many Republicans are still clamoring for the former president’s stamp of approval.",
    "Marlon Bundo, the Pence family’s beloved pet rabbit (and children’s book star), has died.",
    "Most of those issues directly affected the population estimates used for reapportionment.",
    "But Pence does not want to appear in front of the committee, people close to him say.",
    "The big picture: “One or two missing workers can shut down an entire clinic.",
    "BIRTHWEEK (was Saturday): Janet Katowitz of Sage Media\nHAPPY BIRTHDAY: Rep.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza, Tara Palmeri.",
    "VP KAMALA HARRIS’ SUNDAY — The VP has nothing on her public schedule.",
    "“It was not immediately clear what Miller discussed with the panel.",
    "Ned Lamont dusted off a classic meme for some pizza braggadocio.",
    "Biden did score a public-works achievement for the ages.",
    "JAN. 6 AND ITS AFTERMATH\nWILL THEY OR WON’T THEY?",
    "Youngkin signed 11 executive orders on day one.",
    "Send Playbookers tips to playbook@politico.com.",
    "But America’s cracks go deeper than pavement.",
    "RON DESANTIS was the clear second choice.",
    "Now many are out sick with Omicron.",
    "Oz’s campaign declined to comment.",
    "MITCH MCCONNELL disrespected him.",
    "The Supreme Court blocked him.",
    "KYRSTEN SINEMA humiliated him.",
    "VLADIMIR PUTIN scorned him.",
    "And the crowd ate it up.",
    "Inflation defied him.",
    "Covid stalked him.",
    "Glenn Youngkin.",
    "Sign up here.",
    "Why?"
  ]
}