{
  "id": 6387,
  "mediaId": 2658,
  "date": "2022-01-11",
  "headline": "POLITICO Playbook: Biden gets a rude welcome to Georgia",
  "image": "https://static.politico.com/51/0a/cfe9bcfb45cd84dcf81e2746888e/220111-biden-getty-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/01/11/biden-gets-a-rude-welcome-to-georgia-495674",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1268,
    1762,
    2983,
    3393,
    3854,
    3975,
    831,
    1171,
    4984
  ],
  "sentences": [
    "And so the question is where will the institution of [the] United States Senate stand?”\nBiden, whose support for the filibuster has softened since taking office, is also expected to reiterate that he backs “changing the Senate rules to ensure it can work again … Because abuse of what was once a rarely used mechanism that is not in the Constitution has injured the body enormously, and its use to protect extreme attacks on the most basic constitutional right is abhorrent.”\nA White House aide says Biden will again invoke Jan. 6 and will “describe this as one of the rare moments in a country’s history when time stops and the essential is immediately ripped away from the trivial, and that we have to ensure Jan. 6 doesn’t mark the end of democracy but the beginning of a renaissance for our democracy.”\nMEANWHILE, MCCONNELL MAKES A THREAT — Senate Majority Leader CHUCK SCHUMER and Minority Leader MITCH MCCONNELL spent Monday trading shots on the Senate floor over the filibuster.",
    "Such referrals, in Mr. Pence’s view, appear designed to hurt Republican chances of winning control of Congress in November.”\nAnd on top of that, Pence has also “grown annoyed that the committee is publicly signaling that it has secured a greater degree of cooperation from his top aides than it actually has, something he sees as part of a pattern of Democrats trying to turn his team against Mr. Trump.”\nA HEATED EXCHANGE — U.S. District Judge AMIT MEHTA said in a hearing Monday that Trump’s hourslong silence on Jan. 6 “while a violent mob ransacked the Capitol could be plausibly construed as agreement with rioters’ actions,” Kyle Cheney and Josh Gerstein report.",
    "Wooters … John Emerson … PhRMA’s Ashley Czin … Jonathan Kott … John Milne … Daria Grastara of the NRSC … Jennifer Higgins of Guardant Health … Joe Lai of BGR Group … Jessica Brouckaert of Dickinson Wright … Kevin Mooney … Chris Beauregard … Anne Cronin … Ron Phillips … Colton Henson … Jim Hightower … Frederic Mishkin … Alex White … Ben Barrett of the Aspen Institute … Richard Posner … Emma Ernst of Rep. Morgan Griffith’s (R-Va.) office … Gerald Rafshoon … Peacock’s Caragh Fisher O’Connor\nDid someone forward this email to you?",
    "THE HOUSE will meet at 10 a.m. House Sergeant-at-Arms WILLIAM WALKER, U.S. Capitol Police Chief THOMAS MANGER and Architect of the Capitol BRETT BLANTON will testify before an Appropriations subcommittee on the post-Jan. 6 security of the Capitol campus at 10 a.m.\nPHOTO OF THE DAY\nPLAYBOOK READS\nALL POLITICS\nSANDERS ISSUES WARNING TO DEMS AHEAD OF MIDTERMS — Sen. BERNIE SANDERS said Democrats need a “major course correction” ahead of the midterms.",
    "Eleven of those members, six Democrats and five Republicans, are running for Senate or governor.”\nJAN. 6 AND ITS AFTERMATH\nPENCE UNDECIDED — Former VP MIKE PENCE remains undecided on whether to cooperate with the Jan. 6 committee’s investigation, and sources tell NYT’s Michael Schmidt and Alan Feuer he’s most recently “grown increasingly disillusioned with the idea of voluntary cooperation.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Several other Washington officials have made financial pledges or shared internal polling to try to convince Hogan that he has a path to victory.”\nOZ’S TURKISH CITIZENSHIP — As celebrity doc MEHMET OZ runs for Senate, he’s indicating he has no intention of renouncing his Turkish citizenship — and is being challenged repeatedly on the campaign trail to answer why.",
    "WHAT BIDEN WILL SAY TODAY — Look for him to crank up the heat on the party’s voting push, calling the next few days “a turning point in this nation,” and posing a question: “Will we choose democracy over autocracy, light over shadow, justice over injustice?”\n“I know where I stand,” Biden will say, according to a preview shared with Playbook.",
    "POLITICO Playbook: Biden gets a rude welcome to Georgia\nBy RACHAEL BADE and EUGENE DANIELS\n01/11/2022 06:12 AM EST\nPresented by\nDRIVING THE DAY\nSO MUCH FOR UNITY — Democratic leaders hoped to spend the week before Martin Luther King Jr. Day presenting a united front for voting rights legislation and blasting Republicans as undemocratic.",
    "The Banking Committee will hold a confirmation hearing on Fed Chair JEROME POWELL’s nomination for another term at 10 a.m. CDC Director ROCHELLE WALENSKY, ANTHONY FAUCI, acting FDA Commissioner JANET WOODCOCK and HHS’ DAWN O’CONNELL will testify before the HELP Committee about new coronavirus variants at 10 a.m.",
    "The two, who met through mutual friends at a wedding in San Diego, plan to marry this fall in Henderson, Nev. Pic\nBIRTHWEEK (was Monday): Raman Kaur of the Brookings Institution\nHAPPY BIRTHDAY: Rep. Mike Turner (R-Ohio) … MSNBC’s Rashida Jones … Alex Stone of GOPAC Education Fund … Steven Law … Uber’s C.R.",
    "ENGAGED — Alec Aramanda, a professional staff member for the House Energy & Commerce GOP, and Vanessa Napoli, a senior scientist at Applied Research Associates, got engaged Dec. 27 in Old Town Alexandria and were greeted afterward by their families nearby at Il Porto.",
    "Pic … Another pic\n— Brittany Walker, director of policy and government affairs for the Nevada Health Care Association and a Trump Ex-Im Bank and HUD alum, and Michael Hausle, VP of operations for Kaleidoscope Inc., got engaged over the holiday season in Las Vegas.",
    "He currently is executive producer of CNN’s “Early Start.”\nWHITE HOUSE DEPARTURE LOUNGE — David Kieve, public engagement director at the White House Council on Environmental Quality (and Kate Bedingfield’s husband), is leaving next week, per NBC’s Josh Lederman.",
    "Pic\n— Betsy Barrett, comms and marketing director at North America's Building Trades Unions, and Ken Barbieri, EVP of growth at Code3, got engaged on New Year’s Day in Seagrove, Fla., on the beach at sunset, a day after her birthday, surrounded by family.",
    "(h/t Manu Raju)\nBen Affleck passed on a run for Congress because Ayanna Pressley “would have cleaned my clock.”\nA producer for “The Rachel Maddow Show” accidentally copied an aide to Madison Cawthorn on an email, which quickly found its way to Fox News.",
    "— 10:40 a.m.: Biden will depart the White House en route to Atlanta, where he is scheduled to arrive at 12:45 p.m.\n— 2:40 p.m.: Biden and VP KAMALA HARRIS will participate in a wreath laying at the crypt of MARTIN LUTHER KING JR. and CORETTA SCOTT KING.",
    "— The Institute of Politics and Public Service at Georgetown University’s McCourt School of Public Policy has named its 2022 spring fellows: Kristen Soltis Anderson, Ashley Etienne, Alyssa Farah Griffin, Dafna Linzer, Wesley Lowery and Elliot Williams.",
    "It’s because in too many ways the Democratic party has turned its back on the working class.”\nFULL COURT PRESS FOR HOGAN — “Senate Minority Leader Mitch McConnell and other top Republicans are stepping up a personal campaign to persuade Maryland Gov.",
    "Asked for comment, an Oz spokesperson pointed to an op-ed Oz wrote in the Washington Examiner in which he said he has kept his Turkish citizenship to make it easier to visit family, including his mother, who has Alzheimer’s and lives in Istanbul.",
    "She said in an internal note that she plans “to take on some new projects, continuing my role as a CNN commentator and having more time for family and travel.” … Michael Starr Hopkins is joining Wachsman in a senior role.",
    "We need action, and that actually is in the form of the John Lewis Voting Rights Act, as well as the Freedom to Vote Act — and we need that immediately.”\nSTACEY ABRAMS won’t be there either, citing a scheduling conflict.",
    "(h/t Sam Gringlas from NPR’s Atlanta bureau)\n“We do not need any more speeches, we don’t need any more platitudes,” former NAACP of Georgia President JAMES WOODALL told NYT’s Nick Corasaniti and Reid Epstein.",
    "Then late Monday night, the GOP leader escalated the war by vowing to force votes on a dozen GOP bills — on sanctuary cities, vaccine mandates and more — if Democrats lower the chamber’s 60-vote threshold.",
    "Moderate Senate Republicans, including SUSAN COLLINS of Maine, have also been in direct contact with Hogan to note that his centrist brand of politics would be welcome in a chamber riven with partisanship.",
    "She previously was executive director of Care in Action and political director for the National Domestic Workers Alliance, and is co-founder of Families Belong Together, Supermajority and Poderistas.",
    "— 6:15 p.m.: Biden will depart Atlanta to return to the White House, where he is scheduled to arrive at 8:05 p.m.\nPress secretary JEN PSAKI will gaggle aboard Air Force One en route to Atlanta.",
    "In recent weeks, the Pennsylvania hopeful has been asked multiple times by Republicans about his dual citizenship, two people with direct knowledge of the conversations told Daniel Lippman.",
    "He has told aides that the committee has taken a sharp partisan turn by openly considering the potential for criminal referrals to the Justice Department about [DONALD] TRUMP and others.",
    "The back-and-forth “was potentially the most significant in an explosive — and lengthy — hearing on three lawsuits filed against Trump for his actions leading up to and on Jan. 6.",
    "Multiple high-profile voting rights leaders are planning to skip President JOE BIDEN’s speech on the matter in Atlanta today, dismissing the address as too little too late.",
    "“It is no great secret that the Republican party is winning more and more support from working people,” Sanders said in an interview with The Guardian’s Steven Greenhouse.",
    "She previously was senior producer for CNN’s “The Lead with Jake Tapper.” …\n… Max Frankel is joining Invariant, with a focus on climate, energy and environment issues.",
    "Sen. JONI ERNST (R-Iowa), vice chair of the Senate GOP Conference, and at least 20 other Republicans will speak on the Senate floor against nuking the filibuster.",
    "Oz’s connections to Turkey, for instance, have come up on calls with GOP donors, including one in which he was pressed on his relationship with the country.",
    "Two of the suits were filed by Democratic members of Congress, and one was brought by a pair of Capitol Police officers injured during the Jan. 6 fighting.",
    "The cases have been on file for more than nine months, but the hearing Monday was the first substantive one on the issues involved,” Kyle and Josh write.",
    "But late Monday night, Schumer moved to call up all of the GOP bills — plus Democrats’ two voting proposals — and pass them at a majority threshold.",
    "Ernst is also promoting a new hashtag to call out Democrats who’ve changed their position on the filibuster over the years: #FilibusterFlipFlop.",
    "“The recruitment effort has included McConnell’s wife, ELAINE CHAO, who held Cabinet positions in the Trump and GEORGE W. BUSH administrations.",
    "“I have deep concerns about many of its authoritarian domestic policies and harmful foreign policies,” he wrote of the Turkish government.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "FIRST IN PLAYBOOK — Former Colombian VP and Ambassador Francisco Santos is joining the Global Situation Room as EVP of global affairs.",
    "She most recently served as a senior policy adviser for the state of New York in Washington, D.C., and is a Hillary for America alum.",
    "At the same time, Democrats are facing growing doubts within their own ranks about nixing the filibuster to pass the voting bills.",
    "LARRY HOGAN to run for the Senate and help the party’s chances of regaining control of the chamber,” AP’s Steve Peoples reports.",
    "Per CNN: “So far 26 of the 37 members who’ve announced they’re leaving the chamber at the end of the term have been Democrats.",
    "— 3:50 p.m.: Biden and Harris will deliver remarks on voting rights legislation at the Atlanta University Center Consortium.",
    "The two were introduced by mutual friends Adrienne Elrod, Bob Russell and Jeanne Wolak at a happy hour three years ago.",
    "He previously was founding partner at Northern Starr Strategies, and is a John Delaney presidential campaign alum.",
    "Another person said the issue was raised during a December meet-and-greet with Republican officials in Pittsburgh.",
    "Burgess Everett reports that Sen. MARK KELLY (D-Ariz.) is undecided on what to do while Sen. JON TESTER (D-Mont.)",
    "Pope Francis has some thoughts about “cancel culture.”\nKelly O’Donnell got creative in asking Biden questions.",
    "Sen. TED CRUZ (R-Texas), by contrast, renounced his Canadian citizenship in 2014 after he learned of it.",
    "They plan to wed later this year at St. Agnes Catholic Church in Arlington, Va., where they both attend.",
    "TRANSITIONS — Hilary Rosen is leaving SKDKnickerbocker, where she’s vice chair, at the end of March.",
    "John Thune commiserated with fellow South Dakotan Mike Rounds over getting attacked by Donald Trump.",
    "… Democratic lobbyist George Agurkis is now director of federal government relations at H&R Block.",
    "SPEAKING OF: What’s really on and off the table when it comes to possibly changing the filibuster?",
    "ANOTHER ONE BITES THE DUST — Rep. ED PERLMUTTER (R-Colo.) announced he’s retiring after 16 years.",
    "— Sarah Paden is joining the Progressive Policy Institute as VP and national political director.",
    "THE SENATE is in, with a recess from 12:30 p.m. to 2:15 p.m. for weekly conference meetings.",
    "I will defend your right to vote and our democracy against all enemies foreign and domestic.",
    "Alec and Vanessa met via a “double match” on both Hinge and CatholicMatch in January 2021.",
    "He previously was senior director of advocacy at the Credit Union National Association.",
    "… Elena Brennan is now media and stakeholder relations manager at Piper Communications.",
    "MEDIA MOVES — WaPo columnist George Will is joining NewsNation as a senior contributor.",
    "— Jess Morales Rocketto is joining Equis Research as director of Moonshot Strategies.",
    "BIDEN’S TUESDAY:\n— 9:30 a.m.: The president will receive the President’s Daily Brief.",
    "But the TV star’s status has invited questions — from the National Review and others.",
    "PLAYBOOKERS\nAndrew Yang hung out with Marianne Williamson, for old times’ sake.",
    "… Lindsey O’Shaughnessy is joining HP as strategy and external engagement lead.",
    "All of the bills, we’re told, have the backing of all 50 Senate Republicans.",
    "admits he’s not crazy about a filibuster “carveout.” That’s aside from Sens.",
    "JOE MANCHIN (D-W.Va.) and KYRSTEN SINEMA’s (D-Ariz.) long-stated opposition.",
    "We’re beyond events,” said LATOSHA BROWN, the leader of Black Voters Matter.",
    "— 3 p.m.: Biden and Harris will visit the Historic Ebenezer Baptist Church.",
    "But Trump’s lawyers argued that he can’t be legally punished for inaction.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza, Tara Palmeri.",
    "He previously was legislative director for Rep. Mike Quigley (D-Ill.).",
    "She previously was a policy adviser for Rep. Tim Walberg (R-Mich.).",
    "“It’s not because the Republican party has anything to say to them.",
    "He previously was chief of staff for Rep. Richie Neal (D-Mass.).",
    "Spaet is moving to CNN+, where he’ll be a supervising producer.",
    "— William Tranghese is joining Platinum Advisors as an SVP.",
    "— Jo Maney has been named president of the BGR Foundation.",
    "A dual citizen is legally permitted to serve in Congress.",
    "The idea was to show Schumer that two can play this game.",
    "Good Tuesday morning, and thanks for reading Playbook.",
    "That means they would need only one Democrat to pass.",
    "Our Marianne LeVine has a handy guide this morning.",
    "… Patrick Maks is now comms director at Conde Nast.",
    "He previously was a media relations manager at AP.",
    "Send Playbookers tips to playbook@politico.com.",
    "She’s a principal at BGR Public Relations.",
    "The partisan sparring will continue today.",
    "Check out the Maya Angelou quarter.",
    "“We don’t need any more photo ops.",
    "(McConnell, of course, objected.)",
    "(Yang’s wife Evelyn joined, too.)",
    "“We’re beyond speeches.",
    "“I will not yield.",
    "I will not flinch.",
    "So much for that.",
    "Sign up here.",
    "… L.J."
  ]
}