{
  "id": 6452,
  "mediaId": 2590,
  "date": "2022-01-12",
  "headline": "Columbia University Quietly Changes Mehmet Oz's Position Amid Senate Run",
  "image": "https://img.huffingtonpost.com/asset/61dde218260000d7e13d26a6.jpeg?cache=fk7eXU6EAB&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/dr-oz-columbia-university-emeritus_n_61ddde0ee4b0d637aea82fef",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    1917,
    2232,
    244,
    1171,
    5239,
    5389
  ],
  "sentences": [
    "The university declined to take action then, defending Oz’s right to “freedom of expression.”\nIronically, one of the doctors who signed the 2015 letter, Scott Atlas of Stanford University’s Hoover Institution, a conservative think tank, later came under fire for spreading disinformation about coronavirus.",
    "But as of early December, Oz was still listed as a professor of surgery and as director of the Integrative Medicine Center — a department that, according to its description, would combine traditional medicine with alternative practices such as acupuncture, meditation and yoga.",
    "Advertisement\nColumbia University’s Irving Medical Center maintains a page for Oz, listing an office for him at its Washington Heights campus and noting that he specializes as a board-certified cardiac and thoracic surgeon.",
    "Whatever the nature of his pathology, members of the public are being misled and endangered, which makes Dr. Oz’s presence on the faculty of a prestigious medical institution unacceptable,” they wrote.",
    "An emeritus status is conferred to retired professors and faculty members “in recognition of distinguished service to the university and eminence in their discipline,” according to the university.",
    "Advertisement\nThe title reflects the fact that Oz, 61, no longer sees patients, according to a Columbia spokesperson, but it’s unclear how long he’s been retired from his clinical practice.",
    "Last weekend, the heart surgeon’s campaign tweeted a photo of him engaging in some classic retail politicking — posing in front of a giant butter sculpture at the Pennsylvania Farm Show.",
    "TV doctor-turned-politician Mehmet Oz has apparently retired from clinical practice and his faculty role at Columbia University since announcing his Senate run in Pennsylvania.",
    "UPDATE: Jan. 26 — After the publication of this article, a spokesman for Columbia University told HuffPost that Oz became a professor emeritus and special lecturer in 2018.",
    "Advertisement\nIn 2015, 10 nationally renowned physicians wrote to the medical dean at Columbia, calling on the school to remove Oz over his promotion of “quack” treatments.",
    "The doctors said they were “surprised and dismayed” the university’s College of Physicians and Surgeons would allow Oz to continue to hold a senior administrative role.",
    "He has also written books and columns offering health advice while promoting unproven and potentially unhealthy weight loss and longevity cures.",
    "Oz, who once served as vice chair of the surgery department, now holds the title of “professor emeritus of surgery” at the Ivy League school.",
    "Both Atlas and Oz went on to become health advisers to President Donald Trump, who is notorious for promoting his own medical disinformation.",
    "Oz is guilty of either outrageous conflicts of interest or flawed judgements about what constitutes appropriate medical treatments, or both.",
    "For more than a decade, Oz hosted his daytime medical advice show, “The Dr. Oz Show,” which he left after launching his campaign.",
    "The university didn’t respond to questions about when the change took place or how involved Oz still is with its medical faculty.",
    "Oz is now busy running for U.S. Senate in Pennsylvania, where he’s competing in a crowded GOP primary for an open seat.",
    "Oz’s reputation as a world-class cardiothoracic surgeon is at odds with his penchant for hawking New Age treatments.",
    "Oz didn’t have the emeritus title as recently as last month, just after he launched his campaign.",
    "Oz’s campaign wouldn’t comment on when he stepped back from his clinical practice.",
    "Oz may have too much else going on to focus on performing surgery.",
    "Oz is also now a special lecturer in the surgery department.",
    "Atlas could not be reached for comment about Oz.",
    "It’s unclear what happened with that role.",
    "“Dr."
  ]
}