{
  "id": 647,
  "mediaId": 2688,
  "date": "2022-04-10",
  "headline": "McConnell Sidesteps Trump’s Endorsement Of Celebrity Doctor Oz Weeks Before GOP Primary",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/04/GettyImages-1239767560-1.jpg",
  "link": "https://talkingpointsmemo.com/news/mcconnell-trump-endorsement-mehmet-oz-pennsylvania-senate?utm_source=rss&utm_medium=rss&utm_campaign=mcconnell-trump-endorsement-mehmet-oz-pennsylvania-senate",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Shuham",
  "authorUrl": "https://talkingpointsmemo.com/profile/matt-shuham",
  "termIds": [
    2201,
    2232,
    3434,
    878,
    1171,
    5239,
    5243
  ],
  "sentences": [
    "The former president quipped that Oz’s 18-year stint on TV is “like a poll” which he equated to “people like you.”\nAppearing on Fox News Sunday, McConnell was asked about his thoughts on Trump’s endorsement of Oz, who has come under scrutiny from some prominent Republicans and Trumpworld figures for his history of previously living in New Jersey for the past two decades before registering to vote in Pennsylvania in 2020 under his in-laws’ address in suburban Philadelphia.",
    "“I guess we’ll find in the next few weeks how much this endorsement made a difference.”\nMcConnell’s remarks come amid the former president’s ongoing crusade against the Senate minority leader to get him booted as leader, following McConnell’s condemnation of Trump for his role in inciting the deadly Capitol insurrection.",
    "As he mounts a bid to become Senate majority leader if the GOP retakes the chamber in this year’s midterm elections, McConnell has repeatedly shrugged off Trump’s vengeance even as Trump allies such as Sen. Lindsey Graham (R-SC) threaten to vote against McConnell if he doesn’t “effectively work” with Trump.",
    "The celebrity doctor launched his Senate campaign shortly after the Trump-endorsed Republican Sean Parnell dropped his Senate bid in Pennsylvania after losing a child custody battle against his estranged wife, a ruling which came amid allegations of spousal abuse.",
    "Well before launching his Senate bid, Oz previously served on the former president’s administration’s health council after Trump appeared on the doctor’s now-defunct TV show to tout his medical records while running for the presidency in 2016.",
    "Senate Minority Leader Mitch McConnell (R-KY) on Sunday declined to weigh in on former President Trump’s endorsement of celebrity doctor Mehmet Oz in the crowded Pennsylvania Senate race just weeks before the GOP primary.",
    "Oz announced his bid late last year in an op-ed published in the Washington Examiner, in which the celebrity doctor griped about the simmering anger in the electorate and the federal government’s response to COVID-19.",
    "Trump bragged that Oz backed up his claims of being in “extraordinary health,” which apparently made the former president “like him even more (although he also said I should lose a couple of pounds!",
    "McConnell continues to be one of Trump’s punching bags over supposed insufficient loyalty, especially whenever the Senate minority leader joins Democrats in helping score legislative victories.",
    "One example is McConnell aiding Democrats in passing the bipartisan infrastructure bill last year (which Trump couldn’t seem to get off the ground during his four years in office.)",
    "I think we’ve got a good choice of candidates and I think we’ve been a good position to win that race regardless of who the nominee is,” McConnell said.",
    "In a statement issued Saturday night, the former president announced his endorsement, touting the celebrity doctor’s education and medical career.",
    ").”\nTrump also praised Oz’s longtime career on TV during a rally on Saturday night.",
    "McConnell sidestepped the question.",
    "Watch McConnell’s remarks below:",
    "“Well, we’ll see."
  ]
}