{
  "id": 6495,
  "mediaId": 2590,
  "date": "2022-01-05",
  "headline": "How Many Celebrity Politicians Have To Ruin America Before Americans Stop Electing Them?",
  "image": "https://img.huffingtonpost.com/asset/61ce1a752600002baa3d1a6d.jpeg?cache=vE2SxWhPQf&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/reagan-trump-kanye-celebrities-win-elections_n_61ce1984e4b0bb04a637d73a",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2202,
    2659,
    3481,
    4581,
    878,
    5371
  ],
  "sentences": [
    "This is rich considering it’s coming from the same Oz who told Sean Hannity that reopening schools “may only cost us 2% to 3% in terms of total mortality” and that “might be a trade-off some folks would consider.” Oz posted an apology video on Twitter days later, saying, “I’ve realized my comments on risks around opening schools have confused and upset people, which was never my intention.”\nOz, much like most of the celebrities before him, has nothing in the way of political experience but is willing to push all his chips into the middle of the table because his mentor Donald Trump did it, and it worked.",
    "Arnold Schwarzenegger was great as the governor of California until the state needed someone who understood that “the state’s persistent budget crisis is deeply interwoven with the flaws in its government structure, and untangling that mess requires both hard labor and imagination,” as columnist Michael Hiltzik wrote in the LA Times.",
    "Advertisement\nPast political norms often demanded that would-be politicos actually do things like “read the Constitution” or study courses in U.S. government or hold law degrees or perhaps have an organizing background in various grassroots organizations or community work.",
    "And today, the phenomenon of celebrities becoming politicians has led to an endless stream of “celebriticians.” Like NBA players who all believe themselves to be rappers, everyone seems to think they can govern because they, too, have slept at a Holiday Inn Express.",
    "For some reason, Oz — who is running as a Trump Republican and is actually a real doctor despite his inaccurate and medically unsound takes on coronavirus precautions — believes that he is ready to govern the people of Pennsylvania despite living in New Jersey.",
    "He’s shown those willing to follow his steps that you can win over Midwestern and Southern voters — and, in the process, discredit science and disparage the LGBTQ community and people of color — by capitalizing on his reality TV fame.",
    "And this is skipping over all of Reagan’s biggest failures, such as refusing even to acknowledge the AIDS crisis, falling asleep during a meeting with the pope, the savings and loan crisis, and the full-on Iran-Contra scandal.",
    "Advertisement\nThere have been countless celebrities who believed that just because they care about the environment or donate to causes or have used their fame to promote charities, they are ready to govern.",
    "I don’t know if losing to Ruben Studdard in Season 2 of “American Idol” is enough of a résumé to run for the House of Representatives in North Carolina’s 2nd District, but that didn’t stop Clay Aiken.",
    "Then, fresh off his role as the five-time president of the Screen Actors Guild, he decided there were more things he could run for — like the state of California, where he ran for governor and won.",
    "Sixty-three percent of Americans believe Hollywood stars can make good politicians “with the right attitude and support staff,” according to a 2021 survey from Piplsay, a market research company.",
    "Now, America has to take Dr. Mehmet Oz seriously as he runs for Senate in Pennsylvania in an already tightly contested race to replace Sen. Pat Toomey, a Republican who is retiring from office.",
    "Like Dr. Victor Frankenstein, Oprah Winfrey gave life to Oz and then watched as her creation quickly became ungovernable as “America’s doctor,” a name that he, yes, actually trademarked.",
    "The story didn’t turn out to be accurate, but that didn’t stop Reagan from telling it and spinning a yarn about Black people abusing public funds that still haunts folks today.",
    "He started out as a radio announcer before he was discovered by a Warner Bros. agent, who cast him in a movie, and, well, the rest was a Hollywood ending that no one scripted.",
    "Clint Eastwood spent several years undoing all of his acting credits by shilling for the Republican Party and, somehow, was made mayor of Carmel-by-the-Sea, California.",
    "He opposed sanctions against South Africa during apartheid, and well before Trump, Reagan continuously lied to support a narrative that served his administration.",
    "Trump’s presidency proved that more than a third of America loves nothing more than upholding racism, reinforcing bigotry and celebrating misogyny.",
    "But his only campaign position seems to be that the government got the handling of the pandemic all wrong, and he’s going to do something about it.",
    "The outcome could tip the Senate’s 50-50 balance toward the GOP, ending Vice President Kamala Harris’ ability to cast a tie-breaking vote.",
    "After Saddam Hussein ordered a hit on a U.S. Navy ship in 1987, killing 37 men, the president of the United States did absolutely nothing.",
    "America needs sound leadership, a concrete plan to deal with climate change, and a proper strategy to get us out of the ongoing pandemic.",
    "Then-President Donald Trump meets with rapper Kanye West in the Oval Office of the White House in Washington, D.C., on Oct. 11, 2018.",
    "Remember the “Chicago Welfare Queen” who then-candidate Reagan claimed had 80 aliases that she used to collect some $150,000?",
    "I hear all you Reagan Republicans scoffing at the idea because you consider Reagan to be the best politician in U.S. history.",
    "?It’s hard to imagine the cult of celebrity before Instagram, but in the 1940s, Ronald Reagan was becoming a household name.",
    "That same study found that 58% would support Matthew McConaughey and Dwayne “The Rock” Johnson should they run for office.",
    "Just look at Herschel Walker, beloved Georgia running back who is riding his (friend-of-Trump) wave into a run for Senate.",
    "Not sure how being a singer-actor prepared Sonny Bono to represent California’s 44th District, and yet, there he was.",
    "But let’s take a whole look at Reagan’s legacy: He secretly gave money and weapons to Iraq during its war with Iran.",
    "He won’t win, but the fact that he even believes he’s got a chance with absolutely no experience is mind-boggling.",
    "He’s made the crucial Republican rounds, meaning he is a frequent guest on GOP echo chambers Fox News and Newsmax.",
    "It doesn’t even seem to matter that celebrities turned politicians have had marginal crossover success at best.",
    "Advertisement\nBut Reagan is far from unique in his turn as a successful celebrity-slash-failed-politician.",
    "The celebrity obsession has convinced those who are intoxicated by their own success to believe the hype.",
    "Never in the history of America has anyone ever said, “We are on the brink of war with Afghanistan.",
    "Being the mayor of Carmel-by-the-Sea, California, is probably really easy, but you get my point.",
    "Reagan would go on to own the big screen for years as a stern-faced Western actor.",
    "The woman he claimed wore fur coats and drove a Cadillac to the welfare office?",
    "It doesn’t need Kanye West, Cynthia Nixon, Matthew McConaughey or Ben Affleck.",
    "Jesse ‘The Mind’ Ventura couldn’t stop shouting like he was still wrestling.",
    "Reagan’s victory forever changed who could be viewed as politically viable.",
    "The Trump show was a disaster on all fronts; everyone knows this.",
    "Former Minnesota Sen. Al Franken was pretty good until he wasn’t.",
    "But he is famous; he’s Georgia-football-famous, so there’s that.",
    "Oh, and 30% would support Angelina Jolie for president.",
    "But what exactly qualifies Oz for a Senate position?",
    "Trump took all this to the next level — and beyond.",
    "Where is Ja Rule?”\nAnd there is a reason for that.",
    "Can someone get Ja Rule on the phone?",
    "SAUL LOEB via Getty Images\n???",
    "Just one word: fame.",
    "Ex-Minnesota Gov.",
    "OK, fine."
  ]
}