{
  "id": 6688,
  "mediaId": 2718,
  "date": "2022-02-01",
  "headline": "‘Dr. Oz’ Spinoff’s Debut Ratings Down One Third From Final Week of ‘Dr. Oz’",
  "image": "https://www.thewrap.com/wp-content/uploads/2021/12/The-Good-Dish.jpg",
  "link": "https://www.thewrap.com/the-good-dish-debuts-33-lower-in-ratings-than-prior-weeks-dr-oz-average/",
  "mediaOutlet": "The Wrap",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tony Maglio",
  "authorUrl": "https://www.thewrap.com/author/tony-maglio/",
  "termIds": [
    1416,
    2201,
    2232,
    2309,
    2843,
    3448,
    3481,
    3534,
    322
  ],
  "sentences": [
    "He becomes the latest TV or movie star to seek public office, following the likes of Ronald Reagan, Donald Trump, Al Franken, Arnold Schwarzenegger and Cynthia Nixon, the “Sex & the City” actress who unsuccessfully ran for New York governor.",
    "Oz.”\nOn Nov. 30, the cardiothoracic surgeon turned daytime-TV host formally announced that he’s entering the Republican primary field to replace the outgoing Sen. Pat Toomey.",
    "Oz” was previously renewed through the 2022-23 season, which would have taken it well into any potential Senate career if Oz were to win next year.",
    "“Ellen” (a 1.1, +10%) and “Wendy Williams” (a 0.8, +14%) were the only talk shows to grow week to week.",
    "“The Good Dish” served up some lukewarm ratings in its premiere week, the week ending Jan. 23.",
    "In addition to Daphne Oz, “The Good Dish” is also hosted by Gail Simmons and Jamika Pessoa.",
    "Elsewhere, “Kelly Clarkson” had a 1.0 rating and “Drew Barrymore” had a 0.6 rating.",
    "Oz” spinoff, hosted by Mehmet Oz’s daughter Daphne Oz, debuted to a 0.4 rating.",
    "Wendy Williams has been out for months while attending to health issues.",
    "“Wendy” was guest-hosted by Kym Whitley and Finesse Mitchell that week.",
    "Three days later, “The Good Dish” premiered in 90% of the country.",
    "Oz” ended when Mehmet Oz entered the senate race in Pennsylvania.",
    "Oz” averaged the prior week, which was its final week.",
    "That was flat with the show’s prior-week performance.",
    "“The Good Dish” was the replacement show for “Dr.",
    "The trio did a weekly cooking segment on “Dr.",
    "1 talk show, with a 1.8 in ratings.",
    "For the third straight week, “Dr.",
    "That’s 33% lower than what “Dr.",
    "Oz” ended on Jan. 14.",
    "Oz” in most markets.",
    "Phil” was the No.",
    "The “Dr.",
    "“Dr.",
    "“Dr.",
    "“Dr."
  ]
}