{
  "id": 6694,
  "mediaId": 2746,
  "date": "2022-02-01",
  "headline": "Pa. Democrats had vote-counting snag in attempt to endorse Senate candidate",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/01/29/Pennsylvania_Democrats_13426.jpg-f80a3_c0-138-3324-2077_s1200x700.jpg?f10b25abd55588e8d6f028e4f259bde7467ea195",
  "link": "https://www.washingtontimes.com/news/2022/feb/1/pennsylvania-democrats-had-vote-counting-snag-atte/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Boyer",
  "authorUrl": "https://www.washingtontimes.com/staff/dave-boyer/",
  "termIds": [
    1813,
    2068,
    3199,
    3280,
    305,
    803,
    1171
  ],
  "sentences": [
    "Mr. Welch said the tabulation error “did not impact any of the endorsement decisions, nor did it change any of the candidates’ placements in the final vote tally for any round of balloting.”\nAn unidentified state Democratic official told Politico that they believed “more than five” votes had not been counted originally.",
    "“As soon as we became aware of the issue, we conducted a full review of the system and released the updated results to the candidates and our State Committee members yesterday.”\nNo candidate received the required two-thirds of votes to earn the party’s endorsement.",
    "Former hedge-fund executive David McCormick, who joined the race in the past month and wasn’t yet required to file a report with the Federal Election Commission, has spent more than $4 million on TV advertising, according to The Philadelphia Inquirer.",
    "A glitch in the Pennsylvania Democratic Party’s voting system resulted in some votes not being counted when the party met last weekend to consider an endorsement in the Senate primary, officials have acknowledged.",
    "Mr. McCormick held a high-dollar fundraiser in New York on Jan. 24 that included former Trump administration officials Hope Hicks, Tony Sayegh, Nick Ayers and Gary Cohn.",
    "“A minor glitch in our system meant that a handful of votes were recorded, but did not make it into the final tally at the meeting,” Mr. Welch said in a statement.",
    "State party spokesman Brendan Welch said the error occurred when Democrats used a “hybrid endorsement vote” for the first time due to COVID-19 safety concerns.",
    "The system allowed credentialed party committee members who received an emailed link to record their vote on a Google form, with votes tabulated in real time.",
    "Carla Sands, a former ambassador to Denmark in the Trump administration, raised $165,000 in the fourth quarter and had $1.5 million on hand as of Dec. 31.",
    "In the Republican field, TV personality Dr. Mehmet Oz has raised $5.7 million, having donated more than $5 million of his own money to his campaign.",
    "It is considered one of the Democrats’ top opportunities to pick up a Senate seat, in a state that President Biden won in 2020.",
    "On the Democratic side, Mr. Fetterman has $5.3 million in cash on hand, according to fourth-quarter 2021 fundraising totals.",
    "The Senate primaries will be held on May 17 for the seat being vacated by Republican Sen. Pat Toomey, who is retiring.",
    "Real estate developer Jeff Bartos raised $456,000 in the last quarter and had $2.5 million on hand at year’s end.",
    "Rep. Conor Lamb received 61% of the votes on a second ballot, far ahead of second-place candidate Lt. Gov.",
    "John Fetterman, who is leading the Democratic pack in fundraising.",
    "Mr. Fetterman raised about $2.7 million in the fourth quarter.",
    "State Rep. Malcolm Kenyatta of Philadelphia finished third.",
    "Mr. Kenyatta has $285,000 cash on hand.",
    "Mr. Lamb has $3 million."
  ]
}