{
  "id": 6780,
  "mediaId": 6598,
  "date": "2022-01-27",
  "headline": "Senate GOP sets high bar to support Biden's Supreme Court pick",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220127194909-mitch-mcconnell-capitol-121621-file-super-tease.jpg",
  "link": "https://www.cnn.com/2022/01/27/politics/senate-republicans-biden-supreme-court-pick/index.html",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Manu Raju and Lauren Fox",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Lisa Murkowski of Alaska, Lindsey Graham of South Carolina and Susan Collins of Maine all voted for Ketanji Brown Jackson last summer when she was confirmed as a circuit court judge on the US Court of Appeals for the District of Columbia, the second most important court in the country.",
    "Added Mehmet Oz, the Republican Senate hopeful in Pennsylvania: \"Based on the policies of division and control that have marked Joe Biden's first year in office, and the names being floated, I'm worried he will put forth someone who will legislate from the bench with radical ideas.\"",
    "While some Republicans may ultimately back Biden's pick, a number of GOP Senate sources believe that it would only be a handful at most -- underscoring the polarizing nature of the modern Supreme Court confirmation process after years of intense and viciously partisan battles.",
    "Scott's spokesperson, Caroline Anderegg, said in a statement Thursday, \"Senator Scott is aware of Michelle Childs' respected reputation as a judge in South Carolina, which has earned her universal acclaim, and he looks forward to engaging with her if she is the nominee.",
    "With that fact, combined with the likelihood that the nominee won't impact the court's 6-3 ideological balance, some Republicans are uncertain how vocal to be in opposing the nomination -- especially given the favorable midterm environment they are now encountering.",
    "\"I think that'll all depend on who the nominee is, and frankly, how cooperative the White House is, in getting us the standard vetting information and making sure that this is not a sham process,\" Hawley said when asked if he would advocate for such an approach.",
    "One GOP source close to the process says that efforts are already underway to scrub the writings, decisions and records of the short list of candidates that have been floated and that could shift how Republicans approach the nomination process.",
    "(CNN)President Joe Biden and Senate Democrats are making plans to advance his history-making Supreme Court pick, selling the country on a Black female nominee they plan to argue is eminently qualified and barrier-breaking at the same time.",
    "GOP senators and Senate candidates are already concluding that the unnamed nominee is certain to be far left, throwing cold water on the names floated as being on Biden's potential short list, and calling for a slow confirmation process.",
    "And Rep. Jim Clyburn, a Democrat from South Carolina who has been pushing Biden for two years for her selection, told CNN he has spoken to both South Carolina GOP senators -- Graham and Tim Scott -- and believes they both would back her.",
    "\"I think the important thing is that this is someone who will uphold the Constitution faithfully, regardless of their ethnic background or gender or anything else,\" Sen. Josh Hawley, a member of the Senate Judiciary Committee, told CNN.",
    "A source familiar with Schumer's thinking told CNN that the New York Democrat is looking at replicating the GOP timeline for confirming Amy Coney Barrett to the bench -- which took a month, completed just days before the 2020 election.",
    "But Graham, who backed then-President Barack Obama's two Supreme Court picks, said in a statement that \"elections have consequences -- and that is most evident when it comes to fulfilling vacancies on the Supreme Court.\"",
    "Speaking to reporters in Mayfield, Kentucky, Senate Minority Leader Mitch McConnell would not directly answer when asked about Biden's assessment that it was long overdue to nominate a Black woman to the court.",
    "\"I want a judge who understands that the Bill of Rights is not an à la carte menu,\" Sen. John Kennedy, a Republican from Louisiana who sits on the Senate Judiciary Committee, said in an interview Thursday.",
    "\"Mitch McConnell has declared these things have to be done very quickly, as we saw during the last nominee,\" Vermont Sen. Patrick Leahy, the longest-serving Democratic senator, told reporters Thursday.",
    "Asked about the fact that Biden is poised to pick an African American woman, Kennedy said: \"I'm going to judge the nominee on his or her qualifications, on the basis of the criteria I just gave you.\"",
    "Collins, who opposed Barrett's nomination because she objected to the speedy process and said it was too close to the election, also supported then-President Donald Trump's two Supreme Court picks.",
    "Joe Manchin and Kyrsten Sinema, both of whom came under fire with members of their own caucus last week for voting against gutting the filibuster to pass a bill to overhaul voting laws last week.",
    "Under the power-sharing agreement governing the evenly divided Senate, one tactic Republicans could deploy would be to deny Democrats a quorum to vote in committee by boycotting the proceedings.",
    "\"Far more important than the race or gender of any judicial nominee, is their commitment to uphold our Constitution,\" said Mark Brnovich, the Arizona attorney general and a Senate GOP candidate.",
    "\"In a year, when Republicans are asking voters to return control of the Senate to them, I would hope that Republicans would want to prove that the Senate matters,\" the Missouri Republican said.",
    "Another GOP source said McConnell is in touch with his top Judiciary member, Republican Sen. Chuck Grassley of Iowa, but warned that until there is a choice, there cannot be much of a strategy.",
    "\"I think it sends the wrong signal to say that, 'Well if a person is of a certain ethnic background, that we don't care what their record is, we don't care what their substantive beliefs are.'",
    "Another potential nominee is Judge Wilhelmina \"Mimi\" Wright, who in 2016 was also confirmed to her district judgeship with the support of some Republicans still serving: Collins and Sens.",
    "Biden said Thursday the diverse background of his pick won't be the only factor, vowing to nominate a justice with \"extraordinary qualifications, character, experience and integrity.\"",
    "\"I'm going to give the President's nominee, whoever that might be, a fair look and not predict today when I don't even know who the nominee is how I might vote,\" the GOP leader said.",
    "But Republicans haven't yet had a chance to meet and discuss the path forward and sources told CNN that those discussions are happening at a member-level and still early.",
    "\"They're both South Carolinians, they both know Michelle Childs, and they both know that she has strong credentials on both sides of the aisle,\" Clyburn said Thursday.",
    "One GOP aide told CNN that unless Biden nominated a \"lightning rod\" they didn't anticipate a scorched-earth strategy to stop the President from filling the seat.",
    "There are a handful of GOP senators who voted for some of the names on the Supreme Court short list back when they were nominated to lower court positions.",
    "Manchin indicated Thursday in a local interview that he'd be comfortable supporting a justice that represented more liberal views than he had.",
    "Plus a number of Republicans say the nominee's history-making credentials -- being an African American woman -- are not enough to sway them.",
    "Aides say Republicans' only hope is to potentially draw on any tensions left over between Democratic leaders and moderates such as Sens.",
    "We can take our time, have hearings, go through the process, which is a very important one it is a lifetime appointment after all.\"",
    "It would not bother me having a person who is sound in their thought [process] and who is sound in their disbursement of justice.\"",
    "Senate Majority Leader Chuck Schumer wants to move the nomination quickly -- potentially in a month after Biden makes his pick.",
    "And Hawley threw cold water on talk that Democrats may move at the same pace as Barrett's nomination, which he supported.",
    "The only serious chance Republicans have of blocking the nominee is to convince moderate Democrats to stand in the way.",
    "The senator will carefully consider the qualifications of whomever is eventually nominated, as he's done in the past.\"",
    "\"I think it's going to be awfully difficult for the Republicans, after setting that precedent, to stretch things out.\"",
    "\"As you know, I felt that the timetable for the last nominee was too compressed,\" Collins told reporters in Maine.",
    "\"I want a judge who will not try to rewrite the Constitution every other Thursday to advance a political agenda.",
    "I guess what I'm saying is I want a judge who understands and appreciates Madisonian separation of powers.\"",
    "And they're settling on a theme: that Biden's pick will likely undercut his promise to unite the country.",
    "\"It's not going to change the makeup of the court,\" Manchin said on Thursday on a local radio station.",
    "Kennedy, the Louisiana Republican, said he just wants \"sufficient time\" to prepare for the hearings.",
    "\"And I've got a file this thick on, mostly handwritten notes, and I need plenty of time to prepare.",
    "But Hawley added that Republicans can't let the nominee sail through without a \"thorough\" vetting.",
    "\"The President must not outsource this important decision to the radical left,\" McConnell said.",
    "In 2010, J. Michelle Childs was confirmed for her district court spot by a voice vote.",
    "Manchin and Sinema have yet to vote against any of Biden's federal judicial nominees.",
    "\"I think that'll be a heavy lift,\" Hawley said of confirming Biden's pick in a month.",
    "This is a 50-50 Senate, so they're not going to be able to ramrod anybody through.\"",
    "Yet there's another potential hang up: The process for moving a nomination through.",
    "If Democrats stay unified, the nominee can win confirmation on their votes alone.",
    "But GOP aides warned that would be a risky gambit -- and unlikely to succeed.",
    "CNN's Morgan Rimmer, Alex Rogers and Ali Zaslav contributed to this report.",
    "Plus it is still possible that the nominee could win some Republican votes.",
    "Republicans are not yet moved -- and it's unclear if they ever will be.",
    "On Wednesday, Collins warned Democrats against moving too quickly.",
    "Republicans warn their strategy has yet to be fully fleshed out.",
    "\"This process needs to be thorough, and it needs to be serious.",
    "\"I prepare a long time for a Supreme Court hearing,\" he said.",
    "Joni Ernst of Iowa and Shelley Moore Capito of West Virginia.",
    "\"It's not too hard to get more liberal than me.",
    "\"This time there is no need for any rush.",
    "Whether they go that far is uncertain.",
    "I need time to research background.",
    "I need time to research cases.\"",
    "That would be extraordinary.\"",
    "GOP Sens.",
    "..."
  ]
}