{
  "id": 6824,
  "mediaId": 2602,
  "date": "2022-01-24",
  "headline": "Carnegie Hall event champions the lessons of the Holocaust - opinion",
  "image": "",
  "link": "https://www.jpost.com/diaspora/antisemitism/article-694430",
  "mediaOutlet": "Jerusalem Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "SHMULEY BOTEACH",
  "authorUrl": "https://www.jpost.com/author/shmuley-boteach",
  "termIds": [
    0
  ],
  "sentences": [
    "Marion’s presence electrified the audience, and in addition to addressing Wannsee, she delivered a special tribute to mega-philanthropist Sheldon Adelson at his first yahrzeit, awarding him, with her son Elisha, the Light of the Jewish People Award which Sheldon had himself presented to Elie in 2015 at our gala in Times Square, just one year before the world’s most famous Holocaust survivor died.",
    "Five months ago I started planning, along with our team from the World Values Network, a special commemoration at Carnegie Hall for the 80th anniversary of the Wannsee Conference, the 90-minute meeting, held over cognac, cigars and caviar, that planned the Holocaust on January 20, 1942, and which was convened by Reinhard Heydrich and Adolf Eichmann.",
    "Ambassador Kelly Craft, America’s immediate past representative to the United Nations, delivered an impassioned and deeply moving address about Holocaust memory and the ongoing battle against genocide and human rights abuses, citing the Uighurs and the world’s abandonment of them at the onset of the Beijing Winter Olympics.",
    "I reminded all in the audience of how the most disastrous decision of the FDR administration was appointing the dyed-in-the-wool antisemite Breckenridge Long to head the visa section of the State Department which ended up stopping most Jewish refugees from entering the United States, dooming them to annihilation.",
    "American Jews are today experiencing levels of antisemitism never seen in American history, as we witnessed with the recent horrific hostage-taking attack in a Texas synagogue on January 15. Who would have thought that the Wannsee 80 commemorations would be so poignant and prescient even in America?",
    "In my lengthy and unforgettable interview of Albert for the gala, I told him to just imagine the pride his Holocaust survivor parents feel in Heaven, watching a son who developed the COVID vaccines that are saving billions of lives, the ultimate expression of choosing life amid unspeakable tragedy.",
    "It’s a mark of the utter professionalism of the Carnegie Hall staff, our partners in so many previous public events and under the inspired and incredible leadership of our dear friend Sir Clive Gillinson, that the event actually went off and was easily one of the most moving we ever held.",
    "I publicly thanked Poland, one of our important partners in this unique Wannsee 80 commemoration at Carnegie Hall, for everything the Polish people and government do to preserve and protect the Nazi German death camps and Holocaust memory so that the six million are never forgotten.",
    "At the gala we launched my book Holocaust Holiday: One Family’s Descent into Genocide Memory Hell, with its chronicle of everything our family witnessed Poland is doing to preserve the memory of the millions of Jewish murdered by the Germans in the Holocaust on Polish soil.",
    "And then, the day came last Thursday and hundreds of people gathered for our special commemoration upstairs at Carnegie Hall, followed by a Carnegie Hall concert featuring Maxim Vengeroff, the violinist considered by many to be the greatest living string player on earth.",
    "SIR CLIVE and Lady Anya Gillinson of Carnegie Hall opened the evening with an impassioned plea for Holocaust memory and human rights, and it was incredible to see the world’s most important performance arena highlighting the sacred memory of the six million.",
    "Miriam’s words, about Sheldon and Elie Wiesel, reminded all present that the Jewish community is shaped and sculpted by great men and women of extraordinary courage and vision who, even after their deaths, continue to inspire us to follow their example.",
    "Filling out the evening was the vice chairman of research for Columbia University’s department of medicine, our friend Dr. Ira Tabas, who received the Award for Public Health, and Kramer Levin partner Tzvi Rokeach, for outstanding communal service.",
    "As arguably the world’s most famous Muslim non-head of state, Mehmet has shown unparalleled friendship to the Jewish community and to Israel, where I hosted him in 2013 with both our families on a tour that encompassed nearly all of the holy land.",
    "It reminded us all that the precursor to the unforgettable commitment of “Never Again” is first and foremost “Never Forget.”\nThe writer has recently published Holocaust Holiday and Kosher Hate: How to Combat Antisemitism, Racism, and Bigotry.",
    "THE GREATEST highlight was the speech delivered by a living Holocaust legend, Marion Wiesel, wife of Elie Wiesel, who this week will celebrate her 91st birthday, God willing, and who braved the coronavirus to actually attend in person.",
    "My friend of many years and former colleague from Oprah’s broadcasting days is physician and TV host Dr. Mehmet Oz, who has attended nearly every one of our galas from the first gala, where he was honored 10 years ago.",
    "About five years ago Miriam Adelson and I worked to rescue two Afghani Muslim families who risked being murdered by the Taliban, one for protecting women and the other in an attempted honor killing.",
    "And one of the most powerful speeches of the evening was delivered by former chief strategist to vice president Mike Pence, Tom Rose, who received our special award for US-Israel relations.",
    "The World Values Network’s Annual “Champions of Jewish Values International Awards” is the world’s leading celebration of those who use Jewish values to bring positive change to the world.",
    "Kelly is one of the finest friends the Jewish community and Israel has ever had in American public life, and her deep emotion, expressed as she spoke about the Holocaust, was riveting.",
    "As America’s most famous physician, Mehmet has helped guide America through the ravages of the coronavirus pandemic and committed himself endlessly to the welfare of ordinary people.",
    "Then, from some of our leading supporters and philanthropists, we heard that it’s the week of the World Economic Forum in Davos, and we would lose their participation to Switzerland.",
    "Carnegie Hall held a commemoration event for the 80th anniversary of Wannsee Conference on January 20, with hundreds of attendees, impassioned speeches and incredible performances.",
    "It was therefore our great honor to host CEO of the Israel-based humanitarian organization IsraAid, Yotam Polizer, whose organization has rescued hundreds of Afghani refugees.",
    "Consul-General of the Republic of Poland in New York Adrian Kubicki is my close friend and is a phenomenal bridge-builder between the Polish people and the Jewish community.",
    "Events all over New York were being canceled, and I waited on a daily basis to hear from Carnegie Hall that our special Wannsee 80 commemoration wouldn’t make it.",
    "A highlight of the evening was the virtual appearance by Pfizer CEO Albert Bourla, who just one day earlier had been awarded the Genesis Prize from Jerusalem.",
    "Elisha is a tireless fighter for Israel in the world’s most prestigious forums, including the United Nations, the National Cathedral and the US Capitol.",
    "(photo credit: JOHN THYS/POOL VIA REUTERS)\nI’ve always believed that if you do something with true sincerity – if you really mean it – it will succeed.",
    "Then the call came through that in addition to all participants being vaccinated, all speakers and honorees needed PCR tests as they entered the hall.",
    "First I started hearing from Orthodox Jewish friends that this was “yeshiva week,” where all the Orthodox day schools are closed and people vacation.",
    "But by far the greatest challenge was Omicron, which spread coronavirus infection with a vengeance even to those who were fully vaccinated.",
    "And what an incredible story he has as the son of Holocaust survivors from Thessalonica in Greece, where 96% of all Jews were murdered.",
    "Thousands attended, and Maxim joined us for a special reception commemorating Wannsee 80 following his incredible performance.",
    "His wife, our dear friend Dr. Miriam Adelson, accepted the Light of the Jewish People Award on behalf of her late husband.",
    "Carnegie Hall protocol now forbade absolutely any kind of food or drink so that no one would remove their mask.",
    "American Jewry therefore must forever stand up for refugees.",
    "Follow him on Instagram and Twitter @RabbiShmuley.",
    "The entire Jewish world felt the loss of Adelson.",
    "Both families are now in the United States.",
    "The date was fraught with difficulties.",
    "Yet, miraculously, the event was on.",
    "No one, they told me, would attend.",
    "Indeed, the calls came."
  ]
}