{
  "id": 6836,
  "mediaId": 2643,
  "date": "2022-01-26",
  "headline": "Despite High Profile, Dr. Oz Underperforms in GOP Straw Polls Ahead of 2022 Midterms",
  "image": "",
  "link": "https://www.newsweek.com/despite-high-profile-dr-oz-underperforms-gop-straw-polls-ahead-2022-midterms-1673216",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Jackson",
  "authorUrl": "https://www.newsweek.com/authors/jon-jackson",
  "termIds": [
    2201,
    2232,
    4021,
    4762,
    878,
    1171,
    5010,
    5239
  ],
  "sentences": [
    "Daniel Hopkins, a professor in the Political Science Department at the University of Pennsylvania, told Newsweek that he feels the straw polls don't necessarily carry a tremendous amount of weight.",
    "\"Dr. Mehmet Oz has been advertising heavily—I saw at least two ads during the Eagles game a little more than a week ago—and that's reflected in sizable support in some surveys,\" Hopkins said.",
    "The judge who made the custody decision also determined that Parnell, who was endorsed in the Senate race by former President Donald Trump, had committed abusive acts in his marriage.",
    "He has been criticized in recent years for public comments regarding COVID-19, including endorsing the use of hydroxychloroquine, which has been called ineffective by many experts.",
    "A native Pennsylvanian, McCormick is seen as another potential front-runner for the Senate seat, and he finished in second place in the two caucus votes over the weekend.",
    "The open seat is viewed by political analysts as an important target in the 2022 midterm elections as both political parties look to take a majority in the Senate.",
    "He joined a crowded field of Republicans looking to replace Senator Pat Toomey, a Republican who said he would fulfill a campaign pledge of not serving four terms.",
    "In April 2020, he controversially said that opening schools during the pandemic would \"only cost us 2 to 3 percent in terms of total mortality\" in the population.",
    "Mehmet Oz, a physician known to TV audiences as Dr. Oz, did not perform well in three early tests of his candidacy in Pennsylvania's Republican Senate primary.",
    "Oz and other Republican Senate candidates met with GOP state committee members in Harrisburg, Pennsylvania, before the poll for a question and answer session.",
    "They are more familiar with candidates' backgrounds and thinking ahead to candidates who can withstand the inevitable attacks in the primary and the general.\"",
    "However, he suspended his campaign in November after his estranged wife was granted physical custody and sole legal custody of the couple's three children.",
    "That survey asked likely 2022 Republican primary voters in Pennsylvania whom they would vote for if the state's primary for senator \"were held tomorrow.\"",
    "Oz led the field of candidates, with 18.8 percent of the likely GOP voters surveyed saying they would vote for the celebrity physician.",
    "Hopkins added, \"So it's not necessarily surprising that Oz's support among party leaders has lagged behind his support among voters.\"",
    "Oz first came to public prominence as a regularly appearing health expert on The Oprah Winfrey Show before starting his own show.",
    "Though the straw polls reflect the opinions of GOP activists, they are certainly not representative of the overall electorate.",
    "In two other straw polls of state committee members this past weekend, Oz placed third in one and fourth in the other.",
    "Sean Parnell, an Army veteran and former congressional candidate, was once a GOP front-runner for the Senate seat.",
    "State and local Republican party leaders, on the other hand, aren't just thinking about what they saw on TV.",
    "A poll from the Trafalgar Group in December found Oz to be the most popular choice among respondents.",
    "However, that poll was conducted before former hedge fund CEO David McCormick announced his campaign.",
    "The first straw poll came from the Republican State Committee's Central Caucus on January 15.",
    "Newsweek contacted Oz's campaign for comment but did not hear back in time for publication.",
    "He continued, \"But many voters—even highly engaged ones—aren't tuned in at this point.",
    "Oz, who Politico reported has spent $5.4 million on TV ads, received only one vote.",
    "Oz announced he would run in Pennsylvania for the U.S. Senate on November 30.",
    "Afterward, the straw poll was held, with more than 100 votes cast.",
    "He later said he had \"misspoke.\""
  ]
}