{
  "id": 684,
  "mediaId": 2732,
  "date": "2022-04-12",
  "headline": "Trump weighs in on Pa. governor’s race, naming candidate he's not endorsing",
  "image": "",
  "link": "https://triblive.com/news/pennsylvania/trump-weighs-in-on-pa-governors-race-naming-candidate-hes-not-endorsing/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pennlive.Com",
  "authorUrl": "",
  "termIds": [
    2201,
    3150,
    3807,
    3896,
    4599,
    4943,
    5239,
    5243
  ],
  "sentences": [
    "“When I’m governor, we’re going to get back to a voting system that everyone has confidence in, and that begins with repealing the unconstitutional Act 77 that [fellow GOP gubernatorial nominee] Doug Mastriano voted for.”\nMatt Brouillette, president of Commonwealth Partners Chamber of Entrepreneurs, which endorsed McSwain and has a political action committee that is his biggest campaign funder, said, “The only thing predictable about former President Trump is that he’s unpredictable.",
    "Barr told the Inquirer last summer that he had given McSwain discretion to “investigate specific, credible allegations of major fraud” but instead said McSwain used it to make “political statements.”\nTrump went on: “He said Barr told him not to do anything (because Barr was afraid of being impeached by the Democrats), but he should have done his job anyway.",
    "Bill’s record of upholding the law and going after criminals speaks for itself.”\nOn the campaign trail, McSwain points to himself as the only prosecutor in the Republican gubernatorial primary race and the opposite of the prosecutor who is running unopposed in his bid for the Democratic gubernatorial nomination: Josh Shapiro.",
    "“He was the U.S. attorney who did absolutely nothing on the massive election fraud that took place in Philadelphia and throughout the commonwealth.”\nTrump raised McSwain’s claim that former U.S. Attorney General Bill Barr blocked him from looking into allegations of voter fraud in Philadelphia.",
    "They said Philadelphia and Detroit were two of the most corrupt places in the country, with Georgia being one of the most corrupt states!”\nOver the weekend, Trump endorsed Mehmet Oz in the GOP primary race for Pennsylvania’s open U.S. Senate seat.",
    "Former President Donald Trump weighed in on Pennsylvania’s governor’s race Tuesday indicating which of the nine Republican candidates he will not be endorsing.",
    "Hence, our country is going to hell.”\nMcSwain responded to Trump’s non-endorsement saying he is proud of his record as a federal prosecutor.",
    "“I’ve prosecuted and put people behind bars who committed voter fraud, and put rioters and looters in jail,” he said in a statement.",
    "Trump’s statement ended saying McSwain “should be ashamed of himself, as should many Republican leaders who didn’t act.",
    "“One person in Pennsylvania who I will not be endorsing is Bill McSwain for governor,” Trump said in a statement.",
    "Many of the U.S. attorneys were probably told not to do anything by Barr.",
    "Do not vote for Bill McSwain, a coward, who let our country down.",
    "“Without free and fair elections, we don’t have a country.",
    "It was there for the taking and he failed so badly.",
    "Categories: News | Pennsylvania | Politics Election",
    "He knew what was happening and let it go."
  ]
}