{
  "id": 714,
  "mediaId": 2851,
  "date": "2022-04-22",
  "headline": "It’s Not News That McConnell and McCarthy Are Craven Patsies for Trump, but the Danger Has Grown",
  "image": "https://media.newyorker.com/photos/6262bc278f88f7e16cb79145/16:9/w_1280,c_limit/Cassidy-McCarthy-McConnell.jpg",
  "link": "https://www.newyorker.com/news/our-columnists/its-not-news-that-mcconnell-and-mccarthy-are-craven-patsies-for-trump-but-the-danger-has-grown",
  "mediaOutlet": "New Yorker",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Cassidy",
  "authorUrl": "https://www.newyorker.com/contributors/john-cassidy",
  "termIds": [
    0
  ],
  "sentences": [
    "Mark Bednar, a spokesman for McCarthy, insisted to the paper that “McCarthy never said he’d call Trump to say he should resign.” McCarthy himself also issued a statement, in which he said, “The New York Times reporting on me is totally false and wrong.” On Thursday night, however, MSNBC played an audiotape, obtained by the Times, in which McCarthy, when asked by Representative Liz Cheney whether there was a chance that Trump would resign before an impeachment vote, said, “The only discussion I would have with him is I think this will pass, and it would be my recommendation that he should resign.”\nNeither McConnell’s gnomish silence nor McCarthy’s eagerness to distance himself from the suggestion that, even for a moment, he had summoned the gumption to consider standing up to Trump was in the least surprising.",
    "In a phone call with other senior House Republicans on January 8, 2021, Minority Leader Kevin McCarthy described Trump’s conduct on January 6th as “atrocious and totally wrong,” and, in another conversation, on January 10th, he said he was planning to call the President and advise him to resign, according to Burns and Martin’s new book, “This Will Not Pass: Trump, Biden, and the Battle for America’s Future.” This sighting of McCarthy potentially demonstrating some backbone was particularly remarkable because McCarthy’s grovelling attitude toward Trump in the previous four years had convinced virtually everybody in Washington that he was spineless.",
    "After Trump complained that Brnovich was taking too long with his report, and strongly hinted that he will be endorsing another candidate in Arizona’s Senate race, Brnovich issued a milquetoast statement saying, “I understand his frustration, but as I’ve said previously, I will continue to follow the facts and evidence and do what the law requires.”\nIt’s eminently clear where Republican candidates are learning the techniques of prostration: from their own leaders.",
    "On the night of January 6, 2021, Mitch McConnell, then the Senate Majority Leader, “predicted to associates that his party would soon break sharply with Mr. Trump and his acolytes; the Republican leader even asked a reporter in the Capitol for information about whether the Cabinet might really pursue the 25th Amendment,” a Times article by Burns and Martin said.",
    "By the end of January, 2021, barely three weeks after the violence on Capitol Hill, McCarthy flew to Mar-a-Lago, where he kissed Trump’s ring, and, according to a subsequent readout from the Trump camp, “discussed many topics, number one of which was taking back the House in 2022.”\nVideo From The New Yorker\nThe Allure of QAnon for a U.S.",
    "Shortly after issuing the evacuation order, the Capitol Police retracted it because the plane had turned out to be carrying members of the U.S. Army’s Golden Knights parachute team, who were preparing to drop into Nationals Park, where the Nats were playing the Arizona Diamondbacks, to mark Military Appreciation Day.",
    "Five days later, with talk of an impeachment of Trump swirling, McConnell reportedly told a couple of his political advisers that he expected enough Republican senators to vote with the Democrats to secure a conviction of Trump—an act that would bar the rogue President from holding office in the future.",
    "Earlier this week, he ripped into Arizona’s attorney general, Mark Brnovich, whose long-running investigation into the 2020 election in Maricopa County, which includes much of Phoenix, so far hasn’t turned up any evidence of the widespread fraud that Trump and his acolytes allege took place.",
    "As Trump continues to spread the Big Lie that he didn’t lose the 2020 election, he’s busy doling out endorsements to his favored Republican candidates in this year’s midterm races, particularly the Senate ones—Herschel Walker in Georgia, Mehmet Oz in Pennsylvania, J. D. Vance in Ohio.",
    "The other reported Capitol Hill sighting was unconfirmed: even now, it’s not clear whether the descriptions of what allegedly happened involved an actual vertebrate Republican leader or merely an invertebrate who was aching to grow a backbone but knew it couldn’t happen.",
    "In fact, the situation is even worse than it used to be, because the demagogue is now explicitly demanding that Republican candidates sign on to his Big Lie about 2020—a modern version of the “stab-in-the-back” conspiracy theory that helped undermine the Weimar Republic.",
    "A couple of weeks ago, McConnell told Jonathan Swan, of Axios, “I think I have an obligation to support the nominee of my party, and I will.”\nBehind the scenes, of course, there is still a struggle of sorts going on for the future of the G.O.P.",
    "To be sure, there are some individual elected Republicans, such as Cheney and Mitt Romney, who are still willing to criticize and challenge Trump, but none of them are in positions of authority within the Party.",
    "According to Alexander Burns and Jonathan Martin, two political reporters at the Times, the sightings took place after the January 6, 2021, assault on Capitol Hill by thousands of supporters of Donald Trump.",
    "On the other side, McConnell is busy trying to prevent the former President from saddling the Party with “goofball” candidates who might deprive it of a majority in both chambers.",
    "On Wednesday evening, the Capitol Police ordered anyone inside the Capitol to leave immediately because of a possible threat from an aircraft that was flying over the area.",
    "Immigrant\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n[Support The New Yorker’s award-winning journalism.",
    "If the events of January 6, 2021, weren’t sufficient to embolden the likes of McCarthy and McConnell for more than a few days, could anything effect such a transformation?",
    "is still in the same position it has been in for the past five and a half years: beholden to a narcissistic demagogue who has no respect for democracy or the law.",
    "Since then, he has studiously avoided the entire subject, while confirming that he will support Trump in 2024 if he is the Republican candidate for President.",
    "Not so the second one, which involved two alleged sightings of a Washington creature that was widely believed to be extinct: the vertebrate Republican leader.",
    "After the impeachment vote fell short of a two-thirds majority, he also gave a speech on the Senate floor, in which he criticized Trump’s conduct.",
    "From his Palm Beach stronghold, he freely lashes out at any Republican candidate whom he considers insufficiently loyal or pandering.",
    "With Congress on Easter break, Capitol Hill has been quiet this week, but that hasn’t prevented a couple of disturbing false alarms.",
    "In one sense, it’s fun to read yet another story confirming the utter spinelessness and cravenness of McConnell, McCarthy, et al.",
    "“If this isn’t impeachable, I don’t know what is.”\nMcConnell’s office refused to comment to the Times about these reports.",
    "“I didn’t get to be leader by voting with five people in the conference,” he told a friend, according to the Times report.",
    "“The Democrats are going to take care of the son of a bitch for us,” McConnell said, according to the Times account.",
    "E-mail address\nSign up\nBy signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement.",
    "hadn’t warned those responsible for security at the Capitol that the aircraft would be in the area.",
    "But, as usual, it is Trump who is setting the terms of this contest.",
    "Subscribe today »]\nMcConnell didn’t go that far in abasing himself.",
    "Meanwhile, any public criticism of Trump is strictly verboten.",
    "But, in February, 2021, he voted against Trump’s impeachment.",
    "Be the first to know when John Cassidy publishes a new piece.",
    "And this abject situation isn’t likely to change.",
    "The latest on politics and the economy.",
    "Ultimately, though, the joke is on us.",
    "That scare was quickly resolved.",
    "Taken as a whole, the G.O.P.",
    "Evidently, the F.A.A.",
    "Probably not."
  ]
}