{
  "id": 721,
  "mediaId": 2659,
  "date": "2022-04-14",
  "headline": "John Fetterman’s Support Grows 13 Points In A Month In PA Senate Primary",
  "image": "https://www.politicususa.com/wp-content/uploads/2022/04/fetterman-lamb.jpg",
  "link": "https://www.politicususa.com/2022/04/14/john-fettermans-support-grows-13-points-in-month-in-pa-senate-primary.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Easley",
  "authorUrl": "",
  "termIds": [
    3199,
    3280,
    305,
    808,
    878,
    1171,
    5239
  ],
  "sentences": [
    "According to a new Franklin & Marshall College Poll:\nJohn Fetterman has increased his advantage in the Democratic US Senate primary since March–Fetterman now leads Conor Lamb, 41% to 17%, with one in four (26%) still undecided about their preference.",
    "There is a sense that Fetterman will have an advantage in flipping the seat if Oz is the Republican nominee, and right now, John Fetterman is the only PA Senate candidate in either primary who is demonstrating growing momentum.",
    "The state Democratic Party’s decision to recruit Rep. Lamb because they are afraid that Fetterman can’t win a general election looks like the wrong choice.",
    "Fetterman looks like he is gaining momentum, and if this continues, he could have himself an easy primary victory in about a month.",
    "Establishment Republicans want McCormick, but Trump endorsed Dr. Oz, and the result has been fighting among Trump’s own supporters.",
    "Fetterman has opened up a 41%-17% lead over Rep. Conor Lamb in the Pennsylvania Democratic Senate primary.",
    "Nearly half (47%) of those who have a preference report they could change their mind about their choice.",
    "The campaigns have been lackluster, and boatloads of money have been spent on attack ads on all sides.",
    "Rep. Lamb has not been able to gain any traction in the primary against the Lt.",
    "On the Republican side, neither candidate is particularly liked by voters.",
    "Governor, who is well known and liked figure on the left.",
    "The Republican Senate primary remains a trainwreck.",
    "Lt. Gov."
  ]
}