{
  "id": 7213,
  "mediaId": 2934,
  "date": "2022-01-28",
  "headline": "Dr. Fauci Still Treats Patients, Contrary to Dr. Oz’s Claim",
  "image": "https://cdn.factcheck.org/UploadedFiles/fauci-w-first-ebola-patient-in-us.png",
  "link": "https://www.factcheck.org/2022/01/dr-fauci-still-treats-patients-contrary-to-dr-ozs-claim/",
  "mediaOutlet": "FactCheck",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brea Jones",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "But Dr. Mehmet Oz, who has criticized Fauci’s public guidance during the pandemic and called for him to resign, falsely claimed that “Fauci’s never taken care of patients,” while suggesting that Fauci does not approach COVID-19 from the perspective of “patient care.”\n\n“Of course, try to prevent illness but have a strategy, a backup plan,” Oz said in a Jan. 24 Fox News interview, as he discussed what he perceived as a lack of emphasis on using therapeutics to treat COVID-19.",
    "And so, there’s no approach to patient care, the ministering of people who are ill that’s required and that’s where you need leadership and it’s not been there.”\n\nOz, a heart surgeon who previously hosted his own eponymous TV show, is running as a Republican for the Pennsylvania U.S. Senate seat currently held by Republican Sen. Pat Toomey, who is not seeking reelection in 2022.",
    "Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases and chief medical adviser to the president, has been working for nearly two years to help end the COVID-19 pandemic — even directly treating patients with the disease.",
    "Fauci is currently a senior attending physician at the National Institutes of Health Clinical Center where he has been seeing patients continually for the past 54 years since his infectious diseases fellowship that began in 1968,” the NIAID said.",
    "“[R]ather he is an immunologist/infectious diseases expert who is board certified by the American Board of Internal Medicine, the American Board of Infectious Diseases and the American Board of Allergy and Immunology.",
    "He has never stopped seeing patients, and he still makes regular Clinical Rounds at the NIH Clinical Center, including COVID-19 patients.”\n\n“He is not just a ‘virologist,'” the NIAID statement continued.",
    "“He has seen, consulted on and/or personally taken care of literally thousands of patients over the years at the NIH Clinical Center.",
    "We reached out to Oz’s campaign to ask what evidence he had that “Fauci’s never taken care of patients,” but we didn’t hear back.",
    "He is internationally recognized for his basic and clinical research contributions to HIV and other areas of human health.”",
    "However, in a statement emailed to FactCheck.org, the NIAID rebutted Oz’s claims about Fauci.",
    "“Fauci’s never taken care of patients.",
    "He works in test tubes.",
    "He’s a virologist.",
    "“Dr."
  ]
}