{
  "id": 7216,
  "mediaId": 2543,
  "date": "2022-01-31",
  "headline": "GOP Upstart 'Doctor Oz' Springs Into Action When Man Collapses Right in Front of Him",
  "image": "https://www.westernjournal.com/wp-content/uploads/2022/01/Untitled-design-2022-01-31T094448.372.jpg",
  "link": "https://www.westernjournal.com/gop-upstart-doctor-oz-springs-action-man-collapses-right-front/",
  "mediaOutlet": "Conservative Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Davis, Michael Austin, Elizabeth Stauffer, Contributor, Jack Davis Is A Freelance Writer Who Joined The Western Journal In July, Chronicled The Campaign That Saw President Donald Trump Elected. Since Then, He Has Written Extensively For The Western Journal On The Trump Administration As Well As Foreign Policy, Military Issues., New York City, Languages Spoken",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "You also agree to our Privacy Policy and Terms of Use Yes: 89% (873 Votes) No: 11% (109 Votes)\n\nDr. Oz helped moved the man to a flat surface outside the meeting room, where reportedly another seizure took place, according to TMZ.",
    "They will come after us, not with just their economic machine — but every weapon they have to try and destabilize our country.” “We cannot in any way take our eye off them,” said Oz.",
    "It might be too soon to tell whether Dr. Oz has made any believers in his campaign for the U.S. Senate, but when it comes to making a difference, he has already delivered.",
    "Dr. Oz, whose real name is Mehmet Oz, is trying to make the leap from television personality to the Senate, and is crisscrossing Pennsylvania to seek Republican support.",
    "“I’m a doctor, it’s my calling, I’ll always be a doctor, and whether I go into politics or any other profession, I’ll always be a physician,” he said, according to WOLF.",
    "“I’m optimistic that we’ll find out what’s happening and be able to address it expeditiously.”\n\nWhen the emergency was over, Oz was able to deliver his speech.",
    "Dr. Oz, a newcomer to running for office who was a cardiothoracic surgeon long before he made it to TV, treated the man until help could arrive.",
    "Following the lessons learned from a life in medicine, I did my job until EMS arrived to transport him to a nearby hospital,” he told TMZ.",
    "During a campaign swing Friday through Meadville, Pennsylvania, he talked about some issues, according to the Meadville Tribune.",
    "“I am a doctor first and always will be, so I responded immediately to a call for help when a nearby man collapsed.",
    "As part of that, he was in the Pittsburgh area Saturday to visit with the Pennsylvania House Republican Caucus.",
    "As he was getting ready to speak, a man called out for medical help and then collapsed, according to WOLF-TV.",
    "Yes No\n\nCompleting this poll entitles you to The Western Journal news updates free of charge.",
    "He says he’s doing OK and I’ll keep checking up on him,” Oz said, according to WOLF.",
    "“Having a $30 trillion dollar debt does destabilize the dollar,” he said.",
    "“I started practicing the ABCs, and it’s a bit of a teachable moment.",
    "What happened to our country that’s taken us off our game?” he said.",
    "And then C is their circulation, is their blood flowing?” he said.",
    "“That’s a real threat.”\n\nTruth and Accuracy Submit a Correction ?",
    "We are committed to truth and accuracy in all of our journalism.",
    "So, the first thing you do is check the airway, that’s the A.",
    "* Name\n\n* Email\n\n* Message\n\n\n\n* All fields are required.",
    "“Once he got to the emergency room, he got stabilized.",
    "The man appeared to have a seizure and blackout.",
    "He also cited the potential threat from China.",
    "Do think Dr. Oz would be a good senator?",
    "“I think China is coming after us.",
    "Oz said he kept to the basics.",
    "Read our editorial standards.",
    "You may opt out at anytime.",
    "Are they breathing?",
    "“What happened?",
    "That’s the B.",
    "Success!"
  ]
}