{
  "id": 7218,
  "mediaId": 2575,
  "date": "2022-02-01",
  "headline": "Who Is Bill Maher In The Anti-Woke Avengers?",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-news/4034425/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "TOPICS:\n\nCulture/Society\n\nEditorial\n\nKEYWORDS:\n\nbillmaher\n\nelonmusk\n\njoerogan\n\nwokeness\n\n\n\n\n\nTo: Kaslin\n\nloki\n\n\n\nTo: Kaslin\n\n\"Although the 2022 election promises to be the biggest bloodbath in a century for Democrats...\" LOL...We'll know that's a lie when the polls shut down overnight because of water leaks, etc., and the workers start covering windows...\n\n\n\nTo: Kaslin\n\nClever.",
    "It basically gives mean people a reason – it gives them a shield to be mean and cruel armored in false virtue.” The billionaire-philanthropist tech genius has described himself as “nauseatingly pro-American.” He’s got to be the Iron Man of the group.",
    "While other woke billionaires “donate” their fortunes to “non-profits” as a way to reinforce their empires and avoid paying taxes, Jo is probably the only person on Earth who gave so much away she stopped being a billionaire.",
    "Townhall.com ^ | February 1, 2022 | Jared Whitley\n\nPosted on by Kaslin\n\nAlthough the 2022 election promises to be the biggest bloodbath in a century for Democrats, there is a lot of cause to feel grim nowadays.",
    "To: Kaslin\n\nClever article\n\n\n\nTo: Kaslin\n\nBill Maher and his Anti-Woke so called avengers see their party getting more feral and no chance of returning back the death of the party ensues.",
    "Second Amendment is just in case the first one doesn’t work out.” I love that\n\n\n\nTo: Kaslin\n\n\n\n\n\nby 9 posted onby kanawa ((Securing the 2022/2024 elections is of paramount importance.))",
    "Russell Brand was a mediocre comedian who told fairly obvious anti-Bush jokes 15 years ago, but has somehow become the voice of reason for both conservatives and traditional liberals.",
    "To: NurdlyPeon\n\n“Who do we want as the Black Widow?” Stacy Abrams\n\n\n\nby 18 posted onby EQAndyBuzz (If you are vaccinated, you cannot get COVID from someone who is not vaccinated.",
    "However, as dark as things are looking, fate seems to have brought together a group of remarkable people to fight the battles that we never could: namely, the Anti-Woke Avengers.",
    "I don’t know if he’s friends with the Dalai Lama – who pushes back on dishonest, sinister globalist replacement strategies – but the Tibetan mystic could be the Ancient One.",
    "J.K. Rowling has earned the ire of the woke crowd for – get this – insisting male sex offenders shouldn’t be put in women’s prisons simply because they lied on a form.",
    "You want to call him the villain Thanos, especially with the baldness, but – at some point – he realized Western Civilization was in trouble and has changed course.",
    "by 14 posted onby Mr. K (No consequence of repealing obamacare is worse than obamacare itself)\n\nTo: Mr. K\n\nThe price of being never Trump comes at a very high cost.",
    "Time Magazine’s Person of the Year and one of the richest men in the world, Musk recently said that, “At its heart, wokeness is divisive, exclusionary, and hateful.",
    "Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "To: Mr. K\n\n“But we tried to warn them that this is where it would go” And a lot of them launched their careers mocking conservatives for sounding that warning.",
    "He refuses to apologize for stating basic biological facts, makes fun of Jussie Smollet, and famously says, “The First Amendment is first for a reason.",
    "Wokeness – a violent, godless religion – has permeated all levels of society, including traditional religious organizations that should know better.",
    "So given that he’s a wisecracker with a troubled past who’s somehow managed to grow to the right size when things get tough, let’s call him Ant-Man.",
    "Corporate America has taken sides not just against the conservatives who always defended them, but – in selling out to China – against America too.",
    "Putin has spent the last 20 years getting away with whatever mischief he wanted to while Western Europe and North America kept the world running.",
    "Of course, in our Anti-Woke Avengers, we don’t worry about sucking up to China, so we don’t need to whitewash the Ancient One like Disney did.",
    "Jordan Peterson has more genuine intellectual strength than every other academic in Canada combined – though that may not be saying much.",
    "While in the face of woke blasphemy every (good) comedian has had to become conservative, Dave Chapelle seems to be the tip of the spear.",
    "Second Amendment is just in case the first one doesn't work out.” Loves America, good sense of humor, adds some (ahem) nice diversity?",
    "by 7 posted onby ConservativeMind (Trump: Befuddling Democrats, Republicans, and the Media for the benefit of the US and all mankind.)",
    "Joe Rogan, who became a celebrity by hosting a show about eating bugs, has somehow become the most influential member of the media.",
    "The current political climate should be at the very least troubling for anyone paying attention, but it is certainly not hopeless.",
    "He’s certainly no conservative, but in recent years – by defending basic reason and virtue – he’s somehow become a friend to them.",
    "by 13 posted onby Mr. K (No consequence of repealing obamacare is worse than obamacare itself)\n\nTo: NurdlyPeon\n\nEasy- Melania!",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "by 4 posted onby NohSpinZone (First thing we do, let's kill all the lawyers)\n\nTo: Kaslin\n\nWho do we want as the Black Widow?",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "To: EQAndyBuzz\n\n““Who do we want as the Black Widow?”” Although Candice Owens would look great in that uniform.",
    "by 19 posted onby EQAndyBuzz (If you are vaccinated, you cannot get COVID from someone who is not vaccinated.",
    "by 6 posted onby xenia (\"In times of universal deceit, telling the truth becomes a revolutionary act.\"",
    "He’s attacked radical political correctness, woke fundamentalism, and ridiculous COVID overreaches.",
    "Both the strongest and the smartest here, I think we can call him both The Hulk and Bruce Banner.",
    "by 20 posted onby NurdlyPeon (It is the nature of liberals to pervert whatever they touch.)",
    "by 5 posted onby NurdlyPeon (It is the nature of liberals to pervert whatever they touch.)",
    "The Democrats have run our once-great cities into the ground with smiles on their faces.",
    "(And of course, if Musk is Iron Man, then tech-tyrant Jeff Bezos is absolutely Dr.",
    "Short memories, Trump was going to win in 2020.....that was the general consensus.",
    "To: Kaslin\n\nWOW ..\n\nby Dave Chappell: “The First Amendment is first for a reason.",
    "To: Kaslin\n\nThere’s a Disney ad on TV now with a black woman playing Snow White.",
    "To: Vaduz\n\nThey were all for this, until now when they see where it is heading.",
    "Dr. Mehmet Oz is a charismatic surgeon who learned his craft in an exotic land.",
    "He’s a guy who has spent his life avoiding fights because he knows he’ll win.",
    "Personally I am so over the superhero thing and the 500 movies made of it.",
    "And he’s even adopted the catch-phrase “You can’t cancel the truth!\"",
    "Bill has confessed that red states are better run than blue states.",
    "He has almost 5 million subscribers on YouTube as of this writing.",
    "He’s gotten so sensible that MSNBC even did a hit piece on him!",
    "Luckily, the Anti-Woke Avengers understand what is at stake.",
    "That’s when you know you’re pointed in the right direction.",
    "How sad that we use “wokeness” to kill an American classic.",
    "I don’t see the Republicans working on securing elections.",
    "But we tried to warn them that this is where it would go.",
    "He’s a mountain of muscles and electrifies the airwaves?",
    "His daily audience is 10 to 15 times bigger than CNN’s.",
    "The tricky part here is what to do with Vladimir Putin.",
    "For obvious reasons, let’s call her the Scarlet Witch.",
    "To: moovova\n\nThe 2022 election.... bloodbath.... Sure.",
    "When I expressed doubt about that I got criticized.",
    "So then the question is what to do with Bill Maher.",
    "To: Kaslin\n\nMaher wants to be the “new opposition”.",
    "Steve Harvey, who’s almost as good, can be Falcon.",
    "Elon Musk is the de facto front-man of the AWA.",
    "Who Is Bill Maher In The Anti-Woke Avengers?",
    "In other words, the “controlled opposition”.",
    "To: EQAndyBuzz\n\nStacy Abrams Aaaaaa.....ya.",
    "Whataya say we go with Candice on that one.",
    "Dark-haired British bad-boy who turns good?",
    "George Orwell)\n\nTo: TexasFreeper2009\n\nYes!",
    "by 10 posted onby econjack (I'm not bossy.",
    "Our universities are communist madrassas.",
    "I just know what you should be doing.)",
    "She quotes 1984 in woketarians’ faces.",
    "I don’t see the deep state letting go.",
    "Well, I think we all know who he is.",
    "Oh, and as for Captain America?",
    "(Ask Cathy Newman about that.)",
    "Let’s call him War Machine.",
    "Lighted up Karen!)",
    "Lighted up Karen!)",
    "What has changed?",
    "Skip to comments.",
    "Gotta be Thor.",
    "Brand is Loki.",
    "He’s Dr.",
    "Strange.",
    "Doom.)"
  ]
}