{
  "id": 727,
  "mediaId": 2556,
  "date": "2022-04-10",
  "headline": "Dr. Oz Picks Up Donald Trump Endorsement For Republican Nod In Pennsylvania Senate Race",
  "image": "https://deadline.com/wp-content/uploads/2021/12/Oz_Round1_-09-scaled-1-e1638397788189.jpeg?w=1024",
  "link": "https://deadline.com/2022/04/dr-oz-donald-trump-endorsement-pennsylvania-republican-nod-senate-race-1234998811/",
  "mediaOutlet": "Deadline",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2232,
    4021,
    878,
    1171,
    5239,
    5243,
    5249
  ],
  "sentences": [
    "“The great commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr Mehmet Oz for the United States Senate.”\nIn his statement, Trump also said Oz was especially popular with women because of his work in daytime TV, and could do well in Philadelphia and Pittsburgh.",
    "The power of television has apparently brought together former President Donald Trump and daytime talk show host Dr. Mehmet Oz, who is running for the Republican nomination in the Pennsylvania Senate election this November.",
    ")”\nAt the Selma rally, Trump followed up his statements with another Oz tout, calling him a “great guy, good man … Harvard-educated, tremendous, tremendous career and they liked him for a long time.",
    "“President Trump wisely endorsed me because I’m a conservative who will stand up to Joe Biden and the woke left.”\nSubscribe to Deadline Breaking News Alerts and keep your inbox happy.",
    "You know, when you’re in television for 18 years, that’s like a poll, that means people like you.”\nThe Pennsylvania endorsement is Trump’s second in the race.",
    "Oz faces a tough fight in Pennsylvania, with some claiming living two decades in New Jersey puts him out of touch with Pennsylvania’s needs.",
    "“He even said that I was in extraordinary health, which made me like him even more (although he also said I should lose a couple of pounds!",
    "“This is all about winning elections in order to stop the radical left maniacs from destroying our country,” Trump said in his statement.",
    "Trump also mentioned his own appearance on the Dr. Oz show during the 2016 campaign, when Trump showed partial results of a physical.",
    "The endorsement is seen as a test of Trump’s grip on the Republican party, since Oz is not considered to be a conservative by some.",
    "He previously backed Sean Parnell, who withdrew after being accused by his wife of abuse, allegations he denied.",
    "Trump made an endorsement of Oz in a statement before a rally in Selma, North Carolina on Saturday night.",
    "Polling shows his evenly matched with fellow Republican David McCormick.",
    "Accepting the endorsement, Oz issued his own statement.",
    "That’s like a poll.",
    "8 Comments"
  ]
}