{
  "id": 741,
  "mediaId": 2730,
  "date": "2022-04-20",
  "headline": "It Would Seem Dr. Oz Really Needs a History Lesson About This Thing Called Genocide",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/334/886c4880-6644-454b-a346-f7f63c7943ae.jpg",
  "link": "https://townhall.com/tipsheet/mattvespa/2022/04/20/it-would-seem-dr-oz-really-needs-a-history-lesson-about-this-thing-called-genocide-n2606091",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Vespa",
  "authorUrl": "https://townhall.com/tipsheet/mattvespa/",
  "termIds": [
    2232,
    4796,
    305,
    4834,
    4887,
    5239,
    5243,
    5363
  ],
  "sentences": [
    "But some Armenian American leaders say Oz has failed to adequately answer questions about a 100-year-old dispute over the mass deportations and massacres of Armenians in the early 20th century Ottoman Empire, widely characterized as genocide, a description Turkey vigorously disputes.",
    "He’s Turkish, and these folks are very touchy about what they did in Armenia during World War I.\nOz declined to recognize the Armenian genocide, and his campaign then said we should “commemorate” the evils of World War I. That’s a very poor choice of words (via NBC News):\n.",
    "https://t.co/3sTkL1WFTg by @aseitzwald\n— Josh Rogin (@joshrogin) April 19, 2022\nPennsylvania Senate hopeful Mehmet Oz has faced a barrage of questions and criticism from his Republican primary opponents about his initial refusal to relinquish his dual Turkish citizenship.",
    "Senator for #Pennsylvania I will only be a U.S. citizen,\" #DrOz sayshttps://t.co/XxQ8oGqtfa\n— Brooke Singman (@BrookeSingman) March 16, 2022\nNow, if elected, he said he would relinquish his Turkish citizenship, but this is not a good look.",
    "But prominent leaders of a minority group argue that his ties to Turkey demand further scrutiny as Oz, the celebrity physician who picked up the endorsement of former President Donald Trump, competes in the crowded Senate race.",
    "“We are convinced that he is part of a denial campaign when it comes to the Armenian genocide.”\n[…]\nAsked for Oz’s view, campaign spokesperson Brittany Yanick said in a statement: “Dr.",
    "Oz looks forward to those important discussions, as well as helping the three million people of Armenia today.”\nHis campaign’s response didn’t use the words \"Armenian genocide.\"",
    "“No one in this community will ever vote for Dr. Oz,” said Mark Momjian, a prominent Philadelphia attorney and the former chair of the Armenian Center at Columbia University.",
    "We’ll have to reassess through independent agents this allegation of a Ukrainian genocide by Russian troops once the dust settles which won’t be anytime soon.",
    "EXCLUSIVE: @DrOz tells me he will renounce his Turkish citizenship if elected to the #Senate\n\"I’m committing that before I am sworn in as the next U.S.",
    "It’s not playing well in an area—collar counties around Philly—where a Republican at least must have something of a pulse to have a prayer at winning.",
    "The word didn’t exist in 1915, but facts and policies instituted at the time pretty much fit the current description under international law.",
    "And yes, when Turkey got a whiff that Hollywood was doing film projects about the Armenian Genocide, they phoned our State Department.",
    "Turkey is a NATO member, it was a key listening outpost for Soviet activity during the Cold War, and we store nuclear weapons there.",
    "He’s a top-tier candidate in the state because the Keystone State hasn’t had any good candidates run statewide in quite some time.",
    "Campaign spox: “The evils of World War I should be commemorated... Dr. Oz looks forward to those important discussions.\"",
    "Sen. Pat Toomey (R-PA) is leaving public life so there’s a vacancy and it very well could go blue come November.",
    "In 2018 and 2020, it was feeling the blues, but COVID and school boards running amok might be turning the tide.",
    "Until Trump in 2016, the only other time the state has gone red in a presidential election was 1988.",
    "Source: Photo by Chris Pizzello/Invision/AP\nDr. Mehmet Oz is running for US Senate in Pennsylvania.",
    "Both have camps that deny it ever happened despite overwhelming evidence to the contrary.",
    "Allies have rejected questions about Oz’s Turkish heritage as racist and as dog whistles.",
    "Is this akin to someone refusing to recognize the Holocaust committed by Nazi Germany?",
    "Yet, the Philly suburbs, where elections are decided, was tilting heavily Democratic.",
    "No doubt war crimes are being committed but both sides are playing propaganda games.",
    "What’s keeping the state from going full-blown California is the legislature.",
    "If Oz had denied the Jewish Holocaust, I’m sure his campaign would be dead.",
    "Mehmet Oz opposes genocide and the murder of innocent people in all forms.",
    "And it doesn’t help that Dr. Oz refuses to call a genocide…a genocide.",
    "“The evils of World War I should be commemorated,” Yanick continued.",
    "Oz relented and said he would give up his formal ties with Turkey.",
    "Trump endorsed this guy as well which was beyond disappointing.",
    "Genocide has been suggested in the current Russia-Ukraine war.",
    "Genocide is a war crime but not all war crimes are genocide.",
    "After this, maybe he should have just passed on this one.",
    "@DrOz declines to call the Armenian Genocide a genocide.",
    "I’m sure the media reaction would be different as well.",
    "We slow walked recognition for geopolitical reasons.",
    "The Armenian genocide, on the other hand, is a fact.",
    "This is a state is a cruel mistress to Republicans.",
    "Both were heinous crimes against humanity.",
    "We lost the governor’s mansion in 2014.",
    "They’re located at Incirlik Air Base.",
    "Both sides are controlling the media.",
    "Denying genocides is simply wrong.",
    "It’s a public relations nightmare.",
    "He didn’t need to endorse anyone.",
    "There’s no other way to put it.",
    "Still, it’s a crapshoot here.",
    "This isn’t a good look.",
    "I would have to agree.",
    "It’s still Republican.",
    "We’ll see about that.",
    "Both are genocides.",
    "It’s bad.",
    "Wow.",
    "“Dr."
  ]
}