{
  "id": 754,
  "mediaId": 2752,
  "date": "2022-04-13",
  "headline": "Trump To Ron DeSantis: Just Do Me A Favor Though",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY3NTc4OC9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY1MjIxMjM3NH0.-uvmStm2RwqqlFlWK9foy46rf_E6mpncuiGI8g9NQBU/img.png?width=1200&coordinates=0%2C0%2C212%2C0&height=600",
  "link": "https://www.wonkette.com/trump-just-wants-teeny-tiny-favor-from-gop-florida-gov-ron-desantis-before-he-endorses-him",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    0
  ],
  "sentences": [
    "As Forbes reported, he went even further than the guidance issued by the federal government and required travelers from New York, New Jersey, Connecticut, and Louisiana to self-isolate for two weeks after arriving in Florida.",
    "According to a top Republican donor, Trump is likely holding out because DeSantis hasn’t officially declared that he won’t run for president in 2024 if Trump decides to finish his hit job on the nation.",
    "Maggie Haberman at the New York Times claimed in 2016 that Trump’s more “accepting views” on gays set him apart from the GOP pack, but now Trump has eagerly jumped on the “Don’t Say Gay” bandwagon.",
    "I think once he does that, an endorsement would probably come pretty quick.”\nSee, he just wants DeSantis to do him a “favor” first and then he’ll release the military aid deliver the endorsement.",
    "He praised DeSantis for signing the grotesque bill, which he considers a “good move.”\n“I have a good relationship with Ron, I have a good relationship with all the names you mentioned.",
    "During his deranged interview last week with the Washington Post,Trump once again claimed credit for DeSantis’s political success, suggesting he’d made him a man in just seven days.",
    "This is a blatant lie, considering that he ordered schools to shut down, closed down bars and prohibited indoor dining at restaurants in March 2020, just like most other governors.",
    "Despite Senator Susan Collins’s most absurd hopes, Trump hasn’t learned a valuable moral lesson after his attempted extortion of Ukrainian President Volodymyr Zelenskyy.",
    "PREVIOUSLY: Roger Stone Pretty Sure Ron DeSantis A Disloyal Creep Who Cheats On His Wife (Allegedly)\nDeSantis has openly criticized the Trump administration recently.",
    "DeSantis, who narrowly won election in 2018, is considered a rising star somehow after at least 73,588 Floridians died from COVID-19 as a result of his negligence.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "He now claims his biggest regret wasn’t “speaking louder” against the administration’s call for lockdowns in the early days of the pandemic.",
    "Jeff Sessions endorsed Trump early into his first presidential campaign, and Trump paid him back with public contempt and political ruin.",
    "The GOP primary for governor is still four months away, but unfortunately, no viable opposition to DeSantis has yet emerged.",
    "Trump insists that he “gave” DeSantis and other governors the right to manage the pandemic however they chose.",
    "Republican bigots across the nation admire his single-minded obsession with tormenting the LGBTQ community.",
    "He’s endorsed Dr. Mehmet Oz in the Pennsylvania GOP Senate primary and South Dakota Governor Kristi Noem.",
    "He’s already given the MAGA stamp of approval to Little Marco Rubio in his Senate reelection bid.",
    "He even had police checkpoints set up on interstates that monitored travelers entering the state.",
    "He’s down with quacks and frauds but he’s shown no love for his fellow sociopath DeSantis.",
    "“I think with the president, you don’t get anything for free,” one Republican donor said.",
    "That’s not how the Constitution works but it’s still unclear if he’s read the document.",
    "If DeSantis did ultimately “betray” his benefactor, he would’ve learned from the best.",
    "\"You know Ron was at 3 percent, and the day I endorsed him, he won the race,” he said.",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Florida Man Donald Trump still hasn’t endorsed Florida Governor Ron DeSantis.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "“He wants DeSantis to come out and say that he won’t run if [Trump] runs.",
    "Asked if he thought he “made” DeSantis, Trump said he knew he did.",
    "We’re sure that’s exactly what happened in Trump’s diseased mind.",
    "It’s like Dreamgirls, except everyone’s evil and no one can sing.",
    "\"As soon as I endorsed him, the race was over,” Trump claimed.",
    "PREVIOUSLY: DeSantis's Dilemma: Kiss Trump's Ass, Or Govern?",
    "This has been an ongoing, tedious drama for almost a year.",
    "He's also on the board of the Portland Playhouse theatre.",
    "He’d opposed basic public health measures all along!",
    "His son describes him as a “play typer guy.\"",
    "Please click the clickie, if you are able!",
    "He still operates like a common mob boss.",
    "Turn up the AC at Mar-a-Lago, folks.",
    "How often would you like to donate?",
    "Someone’s obviously sweating hard.",
    "I doubt they would run against me.",
    "I doubt it,” Trump reiterated.",
    "He writes reviews for the A.V.",
    "Would they run against me?",
    "Trump feels overshadowed.",
    "No one twisted his arm.",
    "What’s keeping him?",
    "That's you!"
  ]
}