{
  "id": 808,
  "mediaId": 2672,
  "date": "2022-04-10",
  "headline": "Fraud Endorses Quack",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/AP22100000684145.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/donald-trump-endorsement-mehmet-oz-pennsylvania-senate-1335478/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Wade",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I have known Dr. Oz for many years, as have many others, even if only through his very successful television show,” Trump said in the statement, adding, “He has lived with us through the screen and has always been popular, respected and smart.” Trump also praised Oz’s popularity with women.",
    "But Oz accepted at face value the letter Trump showed him and later said on the Today show that the information he saw “indicate[d] that [Trump] is healthy enough to be president.”\nTrump referenced his appearance on Oz’s show in his endorsement.",
    "During the 2016 race, Oz invited Trump to his show where the then-candidate shared a letter about his health signed by Dr. Howard Bornstein, a gastroenterologist who later admitted that Trump “dictated that whole letter” to him.",
    "Women “are drawn to Dr. Oz for his advice and counsel,” said Trump, who has been credibly accused of assault by multiple women and bragged on tape about serially groping women.",
    "And during the pandemic, Oz promoted hydroxychloroquine — a drug heavily promoted by Trump despite a serious lack of evidence that it was an effective treatment for Covid-19.",
    "And a few weeks after Trump entered office, Bornstein said that Trump’s bodyguard and a Trump Organization lawyer “raided” the doctor’s office, leaving with Trump’s records.",
    "President Donald J. Trump announces his endorsement of Dr. Oz pic.twitter.com/k6U7UrkmdC\n— Liz Harrington (@realLizUSA) April 9, 2022\nOz and Trump have a history.",
    "“[Oz] even said that I was in extraordinary health, which made me like him even more (although he said I should lose a couple of pounds!",
    "A study published in the British Medical Journal in 2014 found that at least half of the medical advice Oz gave on his show was bunk.",
    "Former reality TV star and former president Donald Trump endorsed former TV huckster Dr. Mehmet Oz in a statement on Saturday.",
    "But Oz’s popularity, like Trump’s, is built on a foundation of misinformation.",
    "Oz is running as a Republican for a Pennsylvania Senate seat.",
    "I just made it up as I went along,” Bornstein said.",
    "Trump never released his full medical records.",
    "No wonder Trump feels fondly about Oz.",
    "“I didn’t write that letter.",
    "),” Trump said.",
    "NEW!"
  ]
}