{
  "id": 812,
  "mediaId": 2540,
  "date": "2022-04-11",
  "headline": "The very simple reason why Donald Trump chose Mehmet Oz in Pennsylvania",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/210303095131-dr-mehmet-oz-getty.jpg?q=x_0,y_60,h_1767,w_3140,c_crop/w_800",
  "link": "https://www.cnn.com/2022/04/11/politics/donald-trump-mehmet-oz-pennsylvania/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    2201,
    2232,
    4255,
    4762,
    878,
    1094,
    1171,
    5189,
    5199
  ],
  "sentences": [
    "Remember all the way back in August 2015, shortly after Trump had announced his candidacy, the following exchange happened between Trump and NBC's Chuck Todd:\nTodd: \"Who do you talk to for military advice right now?\"",
    "His Twitter feed -- back before he got permanently banned from the social media service -- was filled with often embittered comments about cable TV shows he didn't watch (wink, wink, nudge, nudge).",
    "That fact was borne out over the weekend when Trump endorsed TV doctor Mehmet Oz over hedge fund rich guy David McCormick in advance of next month's Republican Senate primary.",
    "At a rally in North Carolina where, oddly, Trump talked about his endorsement of Oz, the former President was even more blunt about the reasoning behind his pick.",
    "To understand that logic you have to understand how central a role television plays in the life (and political thoughts and opinions) of Donald Trump.",
    "And, if it's on TV for a long time -- as he would often note his show \"The Apprentice\" was -- then it (and the person behind it) must be good.",
    "\"I have known Dr. Oz for many years, as have many others, even if only through his very successful television show,\" Trump said.",
    "I mean, I really see a lot of great, you know, when you watch your show and all of the other shows, and you have the generals.\"",
    "There's no part of his calculation to endorse Oz that dealt with whether the TV doctor would actually make a good senator.",
    "Also, never forget this: For Trump, the fundamental calculation isn't good or bad in any moral sense.",
    "No, for Trump the world is split between those who can do things for him and those who can't.",
    "\"He has lived with us through the screen and has always been popular, respected and smart.\"",
    "He often described members of his Cabinet and inner circle as out of \"central casting.\"",
    "Oz, because he was on TV, can win -- and by winning that makes Donald Trump look good.",
    "\"When you're in television for 18 years, that's like a poll,\" Trump said of Oz.",
    "TV then is -- and always has been -- the way that Trump relates to the world.",
    "He would tape -- or have taped -- his favorite shows, watching them to relax.",
    "Trump isn't endorsing Oz for any reason other than Oz, like Trump, is on TV.",
    "He had a TV installed in a private White House dining room.",
    "And the most important people on it are the ones on TV.",
    "(CNN)For Donald Trump, all the world's a stage.",
    "It also makes him popular\nThat's basically it.",
    "During his presidency, the trend continued.",
    "If it's on TV, it's real to Trump.",
    "Trump: \"Well, I watch the shows.",
    "That's good enough for Trump.",
    "So, voila, Trump endorses Oz.",
    "\"That means people like you.\"",
    "That makes him famous\n3.",
    "2."
  ]
}