{
  "id": 839,
  "mediaId": 2629,
  "date": "2022-04-13",
  "headline": "Endorse This: Colbert Hilariously Explains Why Trump Endorsed Dr. Oz (VIDEO)",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY3NzA3MC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwNTMxOTU0MX0.FA1tTCxNwXwBS0SUR1wXeJkWr3B4h2bnq_ej-5GCiy8/img.jpg?width=1200&coordinates=0%2C37%2C0%2C38&height=600",
  "link": "https://www.nationalmemo.com/dr-oz",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Hayne",
  "authorUrl": "https://www.nationalmemo.com/u/michaelhayne1",
  "termIds": [
    1601,
    2201,
    2232,
    5015
  ],
  "sentences": [
    "Over the weekend, Trump discussed his Senate endorsement of Oz -- for which Colbert called the former President, “The Douche of Hazard,” while showing a picture of the TV doctor dressed in a tuxedo.\\\n“There’s news from the former President, The Douche of Hazard.",
    "“Come on, he’s a con man, and so is Doctor Oz!”\nColbert then went on to list all the scams Dr. Oz forced on his audience, \"but we only have an hour-long show,” he said.",
    "However, pseudo-science TV host and noted quack Dr. Mehmet Oz is a pretty close second, which clearly explains why Trump endorsed his run for Senate in Pennsylvania.",
    "“Among the many snake oil supplements he has peddled are: raspberry ketones for fat burning, lavender soap for leg cramps, and strawberries for teeth whitening.",
    "Over the weekend he weighed in on the political future of charlatan and cater waiter holding the hors d’oeuvres tray up with his penis–Dr.",
    "Mehmet Oz.” And his reaction to hearing Trump endorsed Oz for a Senate seat, caused him to reveal what he thinks is their true nature.",
    "And while there exists a plethora of lying and greedy Republicans, they're all living in amateur land compared to the former guy.",
    "When it comes to being a con man and charlatan, former defeated President Trump takes the whole damn bakery.",
    "None of these work of course.”\nWatch the segment below:\ndr oz"
  ]
}