{
  "id": 869,
  "mediaId": 6428,
  "date": "2022-04-11",
  "headline": "Trump Endorses Dr. Oz in Pennsylvania's Crowded GOP Senate Primary",
  "image": "https://www1.cbn.com/sites/default/files/media/standard/images/trump_2022.png",
  "link": "https://www1.cbn.com/cbnnews/politics/2022/april/trump-endorses-dr-oz-in-pennsylvanias-crowded-gop-senate-primary",
  "mediaOutlet": "CBN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1352,
    2142,
    2201,
    2232,
    4284,
    878,
    1171,
    5239
  ],
  "sentences": [
    "Gonzalez continued, \"Just having Trump's endorsement does not guarantee that you're going to win and so you have a wide variety of candidates from Congresswoman Liz Cheney in Wyoming who I think faces a very serious primary to Congressman Tom Rice of South Carolina who isn't at as much a risk of losing a primary.\"",
    "\"What I'm interested in watching is what happens as these primaries play out and if Trump's candidates don't win, how does he react and does cause him to shake up how he endorses candidates in primaries later on through the summer,\" Gonzalez said.",
    "Trump's endorsement of the celebrity heart surgeon over the weekend not only adds wind to Dr. Oz's political sails but will underscore the enduring effect of Trump's hold on GOP politics.",
    "\"This particular endorsement was a little bit of a surprise because typically, we're seeing Trump try to endorse frontrunners or people he thinks are going to a sure bet of winning.",
    "Nathan Gonzalez, editor and publisher of Inside Elections, told CBN News' Faith Nation that having Trump's support in a Republican primary is beneficial, but not enough.",
    "***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.",
    "Secretary of State Raffensperger in Georgia who didn't do enough to overturn Georgia's election results and give those to him.",
    "That's fine but that isn't necessarily the same thing as being focused on Republicans winning back the House and the Senate.",
    "Trump is under the Republican party umbrella too, but the party doesn't necessarily have the same goals he does.\"",
    "It's up to candidates to use that endorsement to raise money, to communicate to voters whether it's in t.v.",
    "But in this case, Dr. Oz is one of the top candidates but he hasn't had the most momentum,\" he said.\"",
    "He also noted that he's eager to see how Trump responds if a primary that he supports doesn't win.",
    "Help us continue to be a voice for truth in the media by supporting CBN News for as little as $1.",
    "Oz is part of a crowded field of Republican candidates vying for Pennsylvania's open Senate seat.",
    "\"What we're seeing is Trump's endorsement in primaries is important, but it's not sufficient.",
    "\"I think it shows that he is focused on defeating people who he thinks have done him wrong.",
    "Gonzalez noted that it's crucial how Dr. Oz uses Trump's backing during the primaries.",
    "We are committed to delivering quality independent Christian journalism you can trust.",
    "He is on a mission to end those different individuals' political careers.",
    "Dr. Mehmet Oz gained a celebrity endorsement from another prominent T.V.",
    "But it takes a lot of hard work, time, and money to do what we do.",
    "It is not enough just for a candidate to have Trump's blessing.",
    "star turned commander in chief, former President Donald Trump.",
    "That’s why we view every news story through the lens of faith.",
    "Some candidates are doing a better job than others.\"",
    "ads, radio ads, or direct mail pieces.",
    "This shakes up the face a little bit.\"",
    "In this case, voted to impeach him.",
    "God is everywhere—even in the news.",
    "***\nDid you know?"
  ]
}