{
  "id": 97,
  "mediaId": 2594,
  "date": "2022-04-10",
  "headline": "Trump allies claim he was ‘played’ after endorsing TV’s Dr Oz for Senate seat",
  "image": "https://static.independent.co.uk/2022/04/10/01/Election_2022_Senate_Pennsylvania_Trump_Oz_84145.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/trump-dr-oz-endorsement-pennsylvania-b2055017.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Bowden",
  "authorUrl": "https://www.independent.co.uk/author/john-bowden",
  "termIds": [
    0
  ],
  "sentences": [
    "If you believe this, then you’re a useful idiot & it’s no surprise that you’re supporting Oz.”\nAnother Republican furious at the news was Rep Mo Brooks, a GOP congressman from Alabama who was rebuked with a rescinded endorsement from the former president after he encouraged Trump supporters to move on from the 2020 election and told reporters that Mr Trump had asked him to illegally “rescind the 2020 elections”, and “immediately remove Joe Biden from the White House”.",
    "Mr Schlichter was more succinct in his rejection of the TV doctor: “Endorsing Dr Oz is like arguing that Limp Bizkit is the greatest band ever.”\nPennsylvania’s Senate primary will be held on 17 May; Republicans battling over the nomination will likely face either Lieutenant Gov John Fetterman or Rep Conor Lamb, the two leading candidates in the state’s Democratic primary, in November.",
    "Mr Posobiec, a self-styled political operative known for his past support of a litany of wild conspiracies like Pizzagate, spent the evening digging up Dr Oz’s past shows on issues of transgender equality, and calls for the Centers for Disease Control to study gun violence as a public health issue.",
    "Again.”\nRight-wing commentator John Cardillo, a vocal Trump loyalist, warned in a series of tweets that the GOP could not afford a centrist Republican (as he characterised Dr Oz) in the Senate, given how slim the party’s majority in the chamber would likely be if it retakes the Senate in November.",
    "The move drew an immediate reaction from the Trump-aligned segment of Twitter, where many commentators and allies of the former president had been openly pushing for Mr Trump to endorse David McCormick, a hedge fund executive running against Dr Oz in for the GOP nomination in Pennsylvania.",
    "One of the loudest critics of Mr Trump’s decision to support Dr Oz was Mr Parnell, whose decision to drop out of the race after receiving the former president’s endorsement was a clear moment of embarrassment for the former president’s post-presidential political ventures.",
    "In a statement released on Saturday evening as he attended a campaign-style rally in North Carolina, the 45th president made his second attempt at kingmaking in the Republican Senate primary, following his previous endorsement and retraction of support for Sean Parnell.",
    "The state’s Senate race is seen as one of the most contested in the country due to the retirement of Sen Pat Toomey and the aim of Republicans to retake the upper chamber; a victory by Democrats in the state would be a significant blow to those efforts.",
    "Turning his fire on Fox’s Sean Hannity, whom he blamed for convincing Mr Trump as one of the president’s continued confidantes, Mr Cardillo added: “There was no reason whatsoever for Trump to endorse in the Pennsylvania Senate primary.",
    "Over the course of several hours, Mr Parnell retweeted a number of posts pointing to Dr Oz’s past comments in support of the Affordable Care Act, transgender Americans including children, abortion rights and a host of other issues.",
    "Recent internal polling from the Lamb campaign has shown Mr Fetterman, who leads the Democratic primary by a wide margin according to recently-released data, with a strong lead over Dr Oz in a hypothetical November matchup.",
    "Mr Brooks joined the criticism of the former president (indirectly) on Twitter, writing: “This is happening because Trump’s surrounded himself by staff who are on McConnell’s payroll & hostile to the MAGA agenda.",
    "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr Mehmet Oz for the United States Senate,” read Mr Trump’s statement.",
    "Some of former President Donald Trump’s loudest allies on Twitter are in open revolt after the ex-president made his endorsement in the Pennsylvania US Senate race this weekend.",
    "He has lived with us through the screen and has always been popular, respected and smart.”\nAt his rally, he added to cheers: “By they way, I endorsed another person today.",
    "And responding to one critic who said he supported Mr Parnell’s candidacy before his withdrawal from the race, Mr Parnell wrote: “ I have NEVER abused women or children.",
    "Horrible call.”\nStill other Trump fans on the platform, including far-right activist Jack Posobiec and Town Hall columnist Kurt Schlichter were also against the move.",
    "Mr Parnell dropped out of the race after domestic abuse allegations were raised against him; he has denied the accusations.",
    "“Should we win back the Senate our margins will be far too slim have someone as liberal as Dr Oz sitting as a Republican.",
    "“I have known Dr Oz for many years, as have many others, even if only through his very successful television show.",
    "Hannity begged him to endorse Dr Oz because Sean is a celebrity obsessed moron, and Trump accommodated.",
    "Everybody telling Trump who to endorse in primaries works for The Swamp.”\nHe added: “They played him.",
    "That means people like you,” the former president added, pointing to a reason for his endorsement.",
    "Dr Oz in Pennsylvania.”\n“When you’re in television for 18 years.",
    "I have a wonderful relationship with my own children.",
    "Romney, Murkowski, and Collins disappoint us enough.",
    "I have been a protector my entire life.",
    "We don’t need one more,” he wrote.",
    "That’s like a poll."
  ]
}