[
  {
    "id": 6865,
    "mediaId": 2522,
    "date": "2022-01-26",
    "sentence": "— Congresswoman <span class='selected-term'>Debbie Lesko</span> (@RepDLesko) January 25, 2022\nTexas Senator Ted Cruz wrote on Twitter, “The Biden-Harris Administration is rolling out the red carpet for illegal aliens.”\nThe Biden-Harris Administration is rolling out the red carpet for illegal aliens.",
    "author": "Chris Donaldson",
    "title": "Shocking video shows mostly adult male illegals released and then taken to TX airport"
  },
  {
    "id": 6784,
    "mediaId": 2644,
    "date": "2022-01-28",
    "sentence": "Disgraceful.”\nAnd Rep. <span class='selected-term'>Debbie Lesko</span> (R-Ariz.) said: “President Biden and VP Harris obviously want open borders!",
    "author": "Callie Patteson",
    "title": "US braces for record arrests at border as Biden continues flights of migrants"
  },
  {
    "id": 1930,
    "mediaId": 2724,
    "date": "2022-03-21",
    "sentence": "pic.twitter.com/6ATt9waaxN\n— Congresswoman <span class='selected-term'>Debbie Lesko</span> (@RepDLesko) January 24, 2022\nBloomberg isn’t the first media outlet to scold Americans to change their ways when it comes to the Biden economy.",
    "author": "Rusty Weiss",
    "title": "Bloomberg Lectures Americans On Inflation: Eat Lentils, Take The Bus, And Let Your Pets Die"
  },
  {
    "id": 1068,
    "mediaId": 2526,
    "date": "2022-04-05",
    "sentence": "https://t.co/aUG6nnPheE\n— Senator Todd Young (@SenToddYoung) April 4, 2022\n“Over TWO million illegal immigrants have crossed into our nation since President Biden took office,” wrote Rep. <span class='selected-term'>Debbie Lesko</span> (R-AZ).",
    "author": "Joshua Klein",
    "title": "Republicans Warn of ‘Biggest Migration Crisis in U.S. History’ as Joe Biden Nixes Title 42"
  },
  {
    "id": 1492,
    "mediaId": 6449,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Debbie Lesko</span>, a member of the House Energy and Commerce Committee, has some answers on today’s edition of “The Daily Signal Podcast.”\nLesko, R-Ariz., pledges that if the GOP regains the majority in Congress, lawmakers will act swiftly to reduce gas prices and increase America’s energy independence.",
    "author": "Douglas Blair",
    "title": "Rep. Debbie Lesko Reveals GOP Plan to Lower Gas Prices"
  },
  {
    "id": 681,
    "mediaId": 2547,
    "date": "2022-04-20",
    "sentence": "And you wonder why Ron DeSantis, Greg Abbott, and others are so keen to burn math textbooks...\nArizona's Republican Congresswoman <span class='selected-term'>Debbie Lesko</span> said on Twitter that Border Patrol agents had arrested a billion people at the U.S.-Mexico border over the past six months—wrongly adding three zeros to the correct number of a million people.",
    "author": "Ed Scarce",
    "title": "AZ Rep Bashed On Twitter, Says A Billion Migrants Apprehended At Border"
  },
  {
    "id": 566,
    "mediaId": 2596,
    "date": "2022-04-20",
    "sentence": "Congresswoman <span class='selected-term'>Debbie Lesko</span>, who represents Arizona's 8th congressional district, hugely overstated the arrest figures in the US over the last six months with an erroneous social media post.",
    "author": "",
    "title": "Republican says 'one billion people' have been caught at the southern border"
  }
]