{
  "id": 10075,
  "mediaId": 2546,
  "date": "2022-03-30",
  "headline": "Chief asks for $105.5 million more in funding for Capitol Police",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/03/uscp_BC_278_033022.jpg",
  "link": "https://rollcall.com/2022/03/30/chief-asks-for-105-5-million-more-in-funding-for-capitol-police/",
  "mediaOutlet": "CQ Politics ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Marquette",
  "authorUrl": "https://www.rollcall.com/author/chris-marquette/",
  "termIds": [
    0
  ],
  "sentences": [
    "Manger told ranking member Jaime Herrera Beutler, R-Wash., he regrets “that we're the choke point, we’re the problem in terms of getting it reopened fully, but I do think everybody's on board that they want to make sure that the safety and security of this campus is what it should be as we reopen.”\nSalaries under the fiscal 2023 request would be $522.2 million, a $53.4 million increase over the previous fiscal year.",
    "Manger said it was his decision to recommend a phased reopening to House leadership “because we don’t have the staffing to be at all the posts where we were pre-pandemic.”\nThere are currently 130 people in training to become officers, which Manger said is a sign of progress on the staffing front.",
    "Capitol Police Chief J. Thomas Manger wants a $105.5 million budget increase for fiscal 2023 to hire more officers for what he describes as a severely understaffed department, an issue that has hampered the force since the Jan. 6 riot and slowed reopening of the campus.",
    "\"And you know, we want you to know that we're partners with you and as we appreciate your leadership, these are very difficult times and we have to be united as we move forward to try to do this and that the American people want to get back here.\"",
    "The Connecticut Democrat added the department needs “more funding for staffing,” “increased overtime pay” and “most importantly a better work life balance.”\nSince the Jan. 6 insurrection, an officer exodus and overwork have been major issues.",
    "As part of the emergency supplemental appropriations package in response to the Jan. 6 violence, the wellness center was named the Howard “Howie” C. Liebengood Office of Wellness.",
    "That facility, named after the officer who died by suicide days after working on Jan. 6, 2021, is set to formally open soon and could be a matter of weeks, Manger said.",
    "“We basically have been able to say ‘look, this is what we can do.’ And so as people are working with us on that we appreciate it,” Manger said of the phased plan.",
    "Manger said one of the reasons so many officers left is because the department was “burning them out” by having them work forced overtime and canceling days off.",
    "Manger asked the House Legislative Branch Appropriations Subcommittee on Wednesday for $708 million, an increase of 17.5 percent over the previous fiscal year.",
    "The center will offer fitness centers, peer support, a dog support program, trauma counselors, a nutritionist and a chaplain program, the chief said.",
    "From Jan. 6, 2021 to Jan. 6, 2022, the Capitol Police lost between 140-150 officers, an attrition rate double that of normal years, Manger said.",
    "The reason for the delay in fully reopening the complex has been due to the department's inability to staff all the necessary posts.",
    "\"We are here to fund the police,” said Rep. Rosa DeLauro, the chair of the full Appropriations Committee.",
    "This is clearly a process,\" said Rep. Tim Ryan, an Ohio Democrat and the chairman of the subcommittee.",
    "Currently, the department has 1,849 officers, about 300 short of what the chief said is necessary.",
    "\"There's no magic wand here that we could just waive and all of a sudden there's 300 new officers.",
    "Over the next five years, Manger said he hopes to have between 2,300 and 2,400 officers on staff.",
    "Limited tours in the Capitol began Monday as part of a phased reopening plan.",
    "He noted the training process for officers takes the better part of a year.",
    "That would mark a $192.5 million boost from the 2021 fiscal year budget.",
    "Top appropriators signaled they are inclined to support the request."
  ]
}