{
  "id": 10468,
  "mediaId": 8496,
  "date": "2022-03-31",
  "headline": "Funeral for Bluffton Police Officer Dominic Francis will take place on Friday",
  "image": "https://media.wkyc.com/assets/WKYC/images/12c63960-8742-487f-818d-183e1a715a11/12c63960-8742-487f-818d-183e1a715a11_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/condolences-pouring-in-death-of-bluffton-police-officer-dominic-francis/512-4b9f074e-5511-40af-abfa-19d49357c1aa",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/niV1giGdxd\n— Chief George Kral (@gkraltoledo) March 31, 2022\nHANCOCK COUNTY FIREFIGHTERS ASSOCIATION\n\"It is with great sorrow that today we report the passing of Southwestern Hancock Joint Fire Department Captain Dominic Francis and offer our sincere condolences to the Francis family.",
    "pic.twitter.com/HSnSxlSrjp\n— Congressman Tim Ryan (@RepTimRyan) March 31, 2022\nCITY OF PERRYSBURG\nThe Perrysburg Police Department is offering thoughts and prayers to the Bluffton community after the tragic loss of police officer Dominic Francis who was killed in the line of duty early this morning.",
    "Praying the third suspect is apprehended wi… https://t.co/ctdw2ZXxTG pic.twitter.com/tmnw5rXmqt\n— Haraz N. Ghanbari (@HarazGhanbari) March 31, 2022\nBLUFFTON UNIVERSITY\nThis morning, Bluffton Police Officer Dominic Francis was killed in the line of duty during a manhunt in the Village of Bluffton.",
    "pic.twitter.com/JCYR8hdoTa\n— Bluffton University (@BlufftonU) March 31, 2022\nU.S. REP. TIM RYAN (D-Niles), CANDIDATE FOR U.S. SENATE\nHeartbroken to learn that Bluffton Police Officer Dominic Francis was killed in the line of duty early this morning.",
    "My deepest condolences are with Officer Francis’ loved ones and the residents of Bluffton.”\nOHIO STATE REP. HARAZ GHANBARI (R-PERRYSBURG)\nRIP Officer Dominic Francis — Village of Bluffton Police Department.",
    "pic.twitter.com/zSKqmrrmjq\n— City of Perrysburg (@PerrysburgGov) March 31, 2022\nTOLEDO POLICE CHIEF GEORGE KRAL\nMy thoughts and prayers are heading to the family, friends and colleagues of fallen Ofc.",
    "TOLEDO, Ohio — Funeral arrangements will be announced on Tuesday for the Bluffton police officer who was killed early Thursday morning while attempting to stop a vehicle fleeing police on I-75.",
    "Bluffton police announced on their Facebook page that although a specific time and location has yet to be determined, the funeral will take place on Friday, April 8.",
    "Dominic answered his final alarm this morning (March 31, 2022) working as Officer Francis with the Bluffton Police Department and was killed in the line of duty.",
    "MIKE DEWINE\nFran and I are sad to learn of the death of Bluffton Police Officer Dominic Francis, who tragically died today after being hit by a fleeing driver.",
    "Officer Dominic Francis was attempting to place stop strips on the interstate when he was struck and killed by the suspect vehicle shortly before 3 a.m., Sgt.",
    "\"Captain Francis was very active having worked for the Hancock County Sheriff's Office for many years as a dispatcher and as a reserve deputy sheriff.",
    "We are grateful to him for his selfless service to Ohio, and our hearts go out to his family and his colleagues at the Bluffton PD.",
    "— Governor Mike DeWine (@GovMikeDeWine) March 31, 2022\nOHIO ATTORNEY GENERAL DAVE YOST\n“A hero has died and a community is shaken.",
    "Captain Francis was also with the Jenera and Mount Cory Fire Departments which became Southwestern Hancock Joint Fire Department.",
    "Condolences from around the state came pouring in on Thursday:\nOHIO STATE HIGHWAY PATROL\nTOLEDO POLICE\nOHIO GOV.",
    "Two of the three suspects believed to be in the vehicle that struck the officer were arrested Thursday morning.",
    "Please pray for Officer Francis’ family and all the law enforcement officers involved in this tragic incident.",
    "\"Please keep the Francis family in your thoughts and prayers along with all of his brothers in red and blue.",
    "Prior to joining the Bluffton Police Department he was with the Findlay Police Department.",
    "Brice Nihiser of the Ohio State Highway Patrol said during a news conference this morning.",
    "Our community sends prayers to the Bluffton Police Department in this time of grief.",
    "Andrea and I are praying for him, his loved ones and his fellow officers today.",
    "The bravery of the men and women that wear the badge is astounding.",
    "Our deepest condolences to BPD and the family of Officer Francis.",
    "Officer Francis’ valor will live on and never be forgotten.",
    "Francis, the Bluffton PD, and the City of Bluffton.",
    "Rest in peach brother and we'll take if from here.\"",
    "We will never forget his service and sacrifice.",
    "A third suspect was arrested in the afternoon.",
    "U.S. ATTORNEY MICHELLE BAEPPLER",
    "End of Watch: 31 MARCH 2022.",
    "Heaven has a new hero."
  ]
}