{
  "id": 10504,
  "mediaId": 6656,
  "date": "2022-04-01",
  "headline": "House of Representatives passes marijuana legalization bill",
  "image": "https://cdnph.upi.com/sv/ph/og/upi_com/7251648836581/2022/1/965affbc904f021a27a839ed0216e5a6/v1.5/House-of-Representatives-passes-marijuana-legalization-bill.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/04/01/house-of-representatives-passes-marijuana-legaliation-bill/7251648836581/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Simon Druker",
  "authorUrl": "",
  "termIds": [
    1819,
    3369,
    3514,
    4135,
    4777,
    1477,
    1489
  ],
  "sentences": [
    "Three Republicans joined all but two Democrats in supporting the Marijuana Opportunity Reinvestment and Expungement Act, which would also create a process to expunge non-violent marijuana criminal convictions and review criminal sentences for offenders.",
    "\"Make no mistake: Yes, it IS a racial justice bill...We must end this failed policy of marijuana prohibition, which has led to the shattering of so many lives-primarily Black and Brown people,\" said Lee, a 12-term Democrat from California.",
    "Today, I'm voting to end the criminalization of marijuana and begin investing in affected communities with the #MOREAct.— Rep. Barbara Lee (@RepBarbaraLee) April 1, 2022",
    "\"I have seen first hand the devastating impacts of our current marijuana policy and the irreparable harm it's doing, particularly to Black Ohioans and people of color.",
    "Sen. Joe Manchin, D-W.Va., often seen as a swing vote on certain issues, has voiced concerns over the idea of legalizing marijuana amid the ongoing opioid crisis.",
    "Today, I'm voting to end the criminalization of marijuana and begin investing in affected communities with the MORE Act,\" she wrote on Twitter.",
    "Democratic leader Chuck Schumer is working with his party to introduce a marijuana legalization bill into the Senate as soon as this spring.",
    "A 2020 act would have removed marijuana from the list of scheduled substances but the legislation failed to get through the Senate.",
    "The legislation would also impose a federal tax on marijuana and allow the government to provide loans to cannabis businesses.",
    "\"A country where Black and Latino people serve harsh sentences while others make millions in profit from cannabis is unjust.",
    "April 1 (UPI) -- The U.S. House of Representatives voted on Friday to legalize recreational marijuana by a count of 220-204.",
    "A country where Black and Latino people serve harsh sentences while others make millions in profit from cannabis is unjust.",
    "\"The House just passed a bill that would legalize marijuana and expunge marijuana-related convictions and arrests.",
    "Florida's Matt Gaetz and Brian Mast joined California's Tom McClintock to give the bill its Republican support.",
    "If we are truly a nation that believes in second chances, our federal marijuana laws must change,\" wrote Ryan.",
    "A total of 18 states, two territories and Washington, D.C., currently allow marijuana for non-medical use.",
    "Ryan, a nine-term Democratic congressman, co-chairs the House Addiction, Treatment and Recovery Caucus.",
    "Rep. Barbara Lee called the bill an important step in the fight against racial injustice.",
    "No person should be sentenced to a lifetime of hardship because of a marijuana arrest.",
    "This isn't the first time a similar act has passed the House of Representatives.",
    "It's not clear if he'll have the 60 votes required to pass the legislation.",
    "I was proud to support it,\" Ohio Rep. Tim Ryan wrote on Twitter.",
    "The bill was passed almost entirely along party lines.",
    "The issue now heads the Senate."
  ]
}