{
  "id": 10519,
  "mediaId": 2528,
  "date": "2022-04-02",
  "headline": "Democratic Rep. Tim Ryan criticized for 'sinophobic' campaign ad referencing 'Communist China'",
  "image": "https://i.insider.com/6247f08182200b001943d2dd?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/ohio-rep-tim-ryan-called-out-communist-china-political-ad-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Getahun",
  "authorUrl": "https://www.businessinsider.com/author/hannah-getahun",
  "termIds": [
    1819,
    3068,
    1489,
    1477,
    1126,
    392,
    6474,
    6509
  ],
  "sentences": [
    "\"Rep. Tim Ryan's ad for his Ohio Senate campaign stirs up a racist pedagogy vis-à-vis China and makes Americans of East Asian descent vulnerable to attack,\" Shekar Narasimhan, AAPI Victory Fund chairman and founder, said in the statement.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "In a statement to Insider, Ryan said China is the US's \"greatest economic adversary,\" adding \"I've been in office to level the playing field and invest in workers here.\"",
    "Rep. Tim Ryan, D-Ohio Caroline Brehman/CQ-Roll Call, Inc via Getty Images\nRep. Tim Ryan released a campaign ad directed at Ohio workers, saying \"it's us versus China.\"",
    "The ad comes during a time when anti-Asian hate crimes and attacks are on the rise in major US cities, with many of them linked to anti-China sentiment and COVID-19.",
    "The ad, which features Ryan speaking to different groups of workers in his state, references China as an enemy to workers and claims that it is \"us versus China.\"",
    "\"Ohio workers are the best in the world, and I will never apologize for doing everything in my power to take on China and fight for all Ohioans,\" Ryan said.",
    "Ohio Rep. Tim Ryan, a Democrat who is running for Senate, released a campaign ad seemingly blaming China for issues related to wages and jobs in the US.",
    "The AAPI Victory Fund released a statement condemning the ad, saying it was sinophobic and pitted Asian Americans against other Americans.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Critics, including AAPI organizations and Rep. Grace Meng, said the campaign ad contributes to anti-Asian sentiment.",
    "\"That may not be what Rep. Ryan intended, but as he seeks higher office, his words have added meaning.\"",
    "Ryan told Insider he would \"never apologize for doing everything in my power to take on China.\"",
    "We've got to go all in and it starts by investing in Ohio workers,\" a tweet from Ryan read.",
    "AAPI Victory Fund said the video \"stirs up a racist pedagogy\" against East Asian Americans.",
    "The ad was met with swift criticism from Asian American Pacific Islander advocates.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "\"China is out-manufacturing us left and right and it's time we fight back.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}