{
  "id": 10549,
  "mediaId": 8278,
  "date": "2022-04-02",
  "headline": "Ryan Votes to Decriminalize Marijuana",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/04/marijuana-leaves.jpg",
  "link": "https://businessjournaldaily.com/ryan-votes-to-decriminalize-marijuana/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“As co-chair of the House Addiction, Treatment, and Recovery Caucus, I have seen firsthand the social and economic injustices of our current marijuana policy and the irreparable harm it’s doing in Ohio and throughout our nation, particularly to communities of color,” Ryan said.",
    "The bill also aims to correct the historical injustices of failed drug policies that have disproportionately impacted communities of color and low-income communities by requiring resentencing and expungement of prior convictions, the congressman’s office said.",
    "Rep. Tim Ryan, D-13, on Friday voted in support of the Marijuana Opportunity Reinvestment and Expungement Act, or More Act, of 2021, legislation that decriminalizes marijuana at the federal level and expunges prior marijuana-related convictions and arrests.",
    "The bill also allows banks and financial institutions to service the marijuana industry for the first time, which is a public safety and economic issue for many cannabis businesses, Ryan’s office said.",
    "I am proud to have voted in favor of the More Act.”\nFollowing efforts led by states across the nation, the More Act decriminalizes marijuana at the federal level.",
    "This will create new opportunities for individuals as they work to advance their careers, education, and overall quality of life.",
    "It is morally wrong, economically nonsensical, and an unnecessary burden on our already strained law enforcement officials.",
    "If we are truly a nation that believes in second chances, our federal marijuana laws must change.",
    "The More Act also ensures that all benefits in the law are available to juvenile offenders.",
    "“No person should be sentenced to a lifetime of hardship because of a marijuana arrest.",
    "However, the measure is unlikely to gain much support in the U.S. Senate.",
    "The U.S. House of Representatives passed the bill 220-204 on Friday.",
    "Published by The Business Journal, Youngstown, Ohio.",
    "WASHINGTON, D.C. —U.S."
  ]
}