{
  "id": 10595,
  "mediaId": 6656,
  "date": "2022-03-30",
  "headline": "Capitol police ask for $105M budget increase citing understaffing",
  "image": "https://cdnph.upi.com/sv/ph/og/upi/2551648681635/2022/1/2d15b449d2070a2b1a36edcb373ddb44/v1.5/Capitol-police-ask-for-105M-budget-increase-citing-understaffing.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/03/30/Capitol-police-budget-increase-105-million/2551648681635/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Calley Hair",
  "authorUrl": "",
  "termIds": [
    4929,
    226,
    1433,
    1429
  ],
  "sentences": [
    "March 30 (UPI) -- The chief of the Capitol Police asked Congress Wednesday for an additional $105.5 million in the upcoming fiscal year in order to increase its ranks and enact a gradual reopening of the Capitol.",
    "Manger told lawmakers that his department wants the Capitol facility \"opened as much as anybody, and I regret that we're the choke point, we're the problem, in terms of getting it reopened fully.\"",
    "Additional funds would help the department deal with its severe understaffing issues, Capitol Police Chief J. Thomas Manger told the House Legislative Branch Appropriations Subcommittee.",
    "Manger said the force has struggled to fill open positions and retain officers since the Jan. 6, 2021, attack at the Capitol and in the aftermath of the COVID-19 pandemic.",
    "The Capitol Police force lost approximately 150 officers in the year after the Jan. 6, 2021, attack, which is around double the department's typical attrition rate.",
    "\"These are very difficult times and we have to be united as we move forward to try to do this, and that the American people want to get back here.\"",
    "She added that the department needs more funding for staff, increased overtime pay and a better culture of work-life balance for its employees.",
    "The public's access to the Capitol has been restricted for more than a year amid persistent security concerns.",
    "\"We are here to fund the police,\" said Rep. Rosa DeLauro, chairwoman of the full appropriations committee.",
    "\"There's no magic wand here that we could just waive and all of a sudden there's 300 new officers.",
    "The department is currently around 300 officers short -- 14% of its full budgeted payroll.",
    "The lack of officers also resulted in the existing staff being overworked, he added.",
    "This is clearly a process,\" subcommittee chairman Rep. Tim Ryan, D-Ohio, said.",
    "Manger asked for a total budget of $708 million in the 2023 fiscal year.",
    "His request would bump up the force's annual budget by 17.5%.",
    "Subcommittee members appeared receptive to his request.",
    "A phased reopening process began Monday."
  ]
}