{
  "id": 10672,
  "mediaId": 6512,
  "date": "2022-03-31",
  "headline": "AAPI Victory Fund Condemns Xenophobic Rhetoric by All Parties",
  "image": "https://1622179098.rsc.cdn77.org/data/images/full/142667/u-s-rep-for-ohio-tim-ryan.jpg",
  "link": "https://www.latinpost.com/articles/154709/20220331/aapi-victory-fund-condemns-xenophobic-rhetoric-parties.htm",
  "mediaOutlet": "Latin Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessel Thomas",
  "authorUrl": "",
  "termIds": [
    1819,
    392
  ],
  "sentences": [
    "Joe Biden's State of the Union Address\nAAPI Statement\nAAPI Victory Fund Chairman and Founder Shekar Narasimhan issued the following statement:\n\"To be an inclusive party, Democrats must not incite hate or fear just to whip up their base.",
    "Earlier this week, Rep. Tim Ryan launched an ad buy for his Senate campaign that is rife with sinophobic rhetoric, a move which pits nativists against those within the AAPI community.",
    "Republicans and Democrats must recognize the detrimental impact that words, which appear to target them, have on the lives and livelihoods of the Asian American community.",
    "About AAPI Victory Fund\nThe AAPI Victory Fund is focused on mobilizing Asian American and Pacific Islanders (AAPI) eligible voters and moving them to the ballot box.",
    "Rep. Tim Ryan's ad for his Ohio Senate campaign stirs up a racist pedagogy vis-à-vis China and makes Americans of East Asian descent vulnerable to attack.",
    "READ MORE: AAPI Victory Fund Reflects on Biden-Harris Administration's First Year in Office, Urges them to Prioritize Economic Recovery",
    "As the nation seeks to rebuild from COVID-19, incendiary rhetoric linked to the alarming rise in anti-AAPI hate crimes must end.",
    "To get AAPI votes, we must fight ignorance with education and good policy and governance, not inflammatory rhetoric.\"",
    "That may not be what Rep. Ryan intended but, as he seeks higher office, his words have added meaning.",
    "That's what the Trump Republicans do and why we fight them everywhere.",
    "READ NEXT: AAPI Victory Fund Remarks on Pres."
  ]
}