{
  "id": 12069,
  "mediaId": 2702,
  "date": "2022-03-29",
  "headline": "Tim Ryan launches $3.3 million ad buy",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2020/07/ryantim_071420gn_lead.jpg?w=1280",
  "link": "https://thehill.com/homenews/campaign/600150-tim-ryan-launches-33-million-ad-buy/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester/",
  "termIds": [
    1819,
    1489,
    1126,
    392,
    6474,
    6678,
    6509
  ],
  "sentences": [
    "Ryan goes on to lament how China is “out-manufacturing us left and right” and how “America can never be dependent on communist China.”\nThe language used in the ad appears to be aimed at manufacturing workers in Ohio, many of whom have been negatively impacted by jobs being outsourced to China, as well as the U.S. heavily relying on Chinese manufacturing.",
    "But Ryan, who is widely seen as the front-runner in the state’s Democratic primary, appears to be going full-steam ahead in the Senate race, which The Cook Political Report rates as “lean Republican.”\nDemocrats Morgan Harper, Traci Johnson and LaShondra Tinsley are also running in the contest.",
    "The ad buy, which was launched on Monday, includes spots that start airing this week through May 17, which is two weeks after the state’s scheduled Democratic primary.",
    "Republicans, including former President Trump, have used similar phrasing in the past to hit back against what many say is an over-reliance on Chinese manufacturing.",
    "“It is us versus China, and instead of taking them on, Washington is wasting our time on stupid fights,” Ryan says in the 30-second spot.",
    "Last week, Ryan’s Senate campaign announced it will invest more than $3 million to support down-ballot Ohio Democrats this year.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Rep. Tim Ryan’s (D) Ohio Senate campaign launched a $3.3 million ad buy, marking his first of the campaign cycle.",
    "The GOP has made gains in the Buckeye State, with the messaging going back to Trump’s election in 2016.",
    "The congressman’s first ad, titled “One Word,” is focused solely on China.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}