{
  "id": 12106,
  "mediaId": 8276,
  "date": "2022-03-22",
  "headline": "After morning rally in Bucyrus, lighting plant workers will travel to Columbus for protest",
  "image": "https://www.gannett-cdn.com/presto/2022/03/09/PBUC/a88c817c-6261-446c-9cb3-3c4e9ff79a0e-ge_2.JPG?crop=4253,2393,x0,y94&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.bucyrustelegraphforum.com/story/news/2022/03/22/bucyrus-ge-lighting-workers-call-ohio-sen-rob-portman-save-jobs/7132590001/",
  "mediaOutlet": "bucyrustelegraphforum.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gere Goble",
  "authorUrl": "https://www.bucyrustelegraphforum.com/staff/4395714002/gere-goble/",
  "termIds": [
    0
  ],
  "sentences": [
    "Bucyrus rally starts at 8:30 a.m. Wednesday\nAfter a brief rally outside the 1250 S. Walnut St. plant at 8:30 a.m., workers with picket signs and banners will board a bus at 9 a.m. and travel to Portman’s Columbus office, 37 W. Broad St., Columbus, with the news conference and rally scheduled for 10:45 a.m., according to campaign representatives.",
    "Speakers in Columbus will include Carl Kennebrew, president of IUE-CWA; Tim Burga, president of Ohio AFL-CIO; Will Evans, president of IUE-CWA Local 84704, which represents workers at the Bucyrus plant; and Barb Basore, a worker at the Bucyrus plant whose family has provided a combined 500 years of service to the company.",
    "On March 9, GE Lighting, a Savant company, informed its Bucyrus employees it intends to close the plant this fall as part of a restructuring effort \"to reduce organizational complexity and refocus on its long-term portfolio and market demand.\"",
    "According to the \"Bring it Home, GE\" news release, during the same week, Senate Republicans blocked an amendment that would have required that LED bulbs purchased by the Department of Defense be made or assembled in the United States.",
    "\"The petition calls on Sen. Portman to support legislation that would mandate the Department of Defense to buy Made in America LED lightbulbs, a move that would protect good jobs in Ohio,\" according to the news release.",
    "\"The majority of the workers are Republican and say they want Sen. Portman to return the loyalty that many of them have shown him by helping elect him to office,\" according to the news release.",
    "After a morning rally outside the Bucyrus lamp plant owned by GE Lighting, a Savant Company, dozens of workers will travel to Columbus on Wednesday to deliver a petition to U.S. Sen.",
    "According to a news release from the \"Bring It Home, GE\" campaign, workers also will have a press conference and rally outside the office.",
    "The \"Bring it Home, GE\" campaign is led by union workers in Bucyrus and nationwide who are members of IUE-CWA, a representative said.",
    "The campaign targets both GE and Savant Systems-owned GE Lighting, encouraging both to reinvest in American workers.",
    "The provision was introduced by U.S. Rep. Tim Ryan, D-Warren, a U.S. Sena candidate.",
    "\"They want him to support new Buy American Lightbulb legislation in the Senate.\"",
    "The move would eliminate all 174 jobs at the plant, which opened in 1942.",
    "ggoble@gannett.com\n419-559-7263",
    "Rob Portman's office."
  ]
}