{
  "id": 12373,
  "mediaId": 8496,
  "date": "2022-03-24",
  "headline": "Ohio University students protest amid investigation into reported racially motivated incidents on campus",
  "image": "https://media.wkyc.com/assets/WBNS/images/ac21673c-5bec-4253-863c-0c4a8be0eb3d/ac21673c-5bec-4253-863c-0c4a8be0eb3d_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/ohio-university-police-investigating-racially-motivated-incidents/530-953edb18-eb4b-499d-adda-d84e7ce8efb8",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“These are rapidly evolving events, but we are committed to using every resource at our disposal to investigate incidents such as these and hold those responsible fully accountable under the law,” Ryan said in the statement.",
    "About 100 students, along with university president Hugh Sherman, voiced their concerns in response to the incidents that some students believe to be racially motivated.",
    "After interviewing the student and the resident advisor twice, police did not find a motive for the crime or evidence that the victim had been specifically targeted.",
    "In a statement from campus police, Lt. Tim Ryan expressed that the police department is concerned about the incidents and their impacts on communities of color.",
    "\"In my opinion, it's happened every semester since I've been enrolled at school here and we want to give everybody a chance to let their voices be heard.\"",
    "These types of incidents set us back from our educational mission and our efforts to build and support a diverse University community.,\" he said.",
    "ATHENS, Ohio — Ohio University students gathered on campus Thursday to protest while police investigate a series of incidents in the past week.",
    "After police found the bag and recovered evidence, detectives began to review video and speak with hall residents to find possible witnesses.",
    "Over the weekend in Sargent Hall, someone left a note containing racial and misogynistic epithets on a bag of trash outside a room.",
    "Police said a male student urinated on the door of junior Christopher Brown, who is Black and a resident advisor in James Hall.",
    "\"Our community will not tolerate a culture that threatens, physically or emotionally, any group or individual on our campus.",
    "According to police, the message stated that a post was made on Snapchat where an unknown person wanted to see him lynched.",
    "Investigators later found that the urine damaged Brown’s property and the student was then charged with criminal mischief.",
    "Students organized a march and protest Thursday afternoon on campus to voice concerns in response to the recent incidents.",
    "As students marched on campus, they hope that the protest will change the way the university addresses racism on campus.",
    "\"The person who did this lives all the way down the hall and came to the only black RA's room, urinated and ran.",
    "Sherman issued his own statement, saying the school is providing support to build a more inclusive community.",
    "The fourth incident was reported on Wednesday afternoon when Brown received an anonymous message on Twitter.",
    "The first incident reported to campus police involved a Black doll taped to a residence hall room door.",
    "\"A lot of people have experienced racial instances at Ohio University,\" said senior Maurice Swift.",
    "Mine was the one that got the exposure, so we are forcing their hand to talk right now,\" he said.",
    "The student, who police said lived in the residence hall, was cited with public urination.",
    "Posts about the doll were shared on social media, but it was not reported to police.",
    "Police are working to identify the Twitter user and further investigate the post.",
    "However, Brown expressed that the incident was racially motivated.",
    "Of course, my situation is extreme but things like this happen.",
    "The third incident happened on early Monday morning."
  ]
}