{
  "id": 135,
  "mediaId": 8497,
  "date": "2022-02-24",
  "headline": "Ohio, Kentucky, Indiana leaders react to Russia attack on Ukraine",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ukraine-tensions-1645720831.jpg?crop=0.976xw:1.00xh;0.0128xw,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-leaders-lawmakers-react-to-russia-attack-on-ukraine/39206112",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Indiana leaders react\nIndiana Sen. Mike Braun (R-IN) issued a statement following the attack:\n“Though I hoped the administration would proactively shut down Russian energy assets such as Nord Stream 2 to deter further aggression as a majority of Senators voted to do, Putin and his cronies must now be punished with severe economic consequences for their unjustified invasion of Ukraine.",
    "— Aftab Pureval (@AftabPureval) February 24, 2022\nOhio Democratic Party Chair Elizabeth Walters issued a statement in support of Ohio’s Ukrainian American community following Russia’s attack:\n“Ohio Democrats stand strong with Ohio’s Ukrainian American community amid Russia’s unprovoked attack on the nation of Ukraine.",
    "Our thoughts are with our fellow Ohioans during these difficult days ahead and we stand ready to offer any support we can.”\nFormer governor of Ohio John Kasich released the following statement:\n\"This violent action by Russia is immoral, unjustified and completely incompatible with modern, civilized leadership.",
    "As I’ve said before, the United States and NATO must redouble our material support for Ukraine’s resistance, further shore up our allies, get serious about energy independence, and invest in the capabilities needed for long-term military competition with Russia and China.",
    "President Biden has made it clear the U.S. and our allies and partners will impose the strongest sanctions Russia has ever seen, and I will work with the Biden Administration to implement them against Russian officials and oligarchs who prop up Putin’s regime.",
    "The U.S. must unleash independent American energy production to lessen the pain of rising fuel prices on Americans, and the U.S. must be watchful to avoid endangering U.S. troops by involving them further in this volatile situation.”",
    "U.S. Senate Republican Leader Mitch McConnell (R-KY) issued the following statement:\n\"As I stated several days ago, it was clear that Putin’s initial aggression was just a small foretaste of what this thug had planned for Ukraine.",
    "The United States, in coordination with our European allies, must impose the strongest possible sanctions and work swiftly to make him pay for the pain and suffering he has already caused and will continue to cause.",
    "As civilians piled into trains and cars to flee, NATO and European leaders rushed to respond, if not directly in Ukraine, with strong financial sanctions against Russia and moves to strengthen their own borders.",
    "My full statement: https://t.co/TmXN1tOtCn pic.twitter.com/NVwi3rGlKu\n— Rob Portman (@senrobportman) February 24, 2022\nSen. Sherrod Brown (D-OH) also shared a statement, condemning the attack.",
    "Russian troops launched a broad assault on Ukraine from three sides Thursday, an attack that brought explosions before dawn to the country’s capital, Kyiv, and other cities.",
    "Andy Beshear shared a message on unit following the attack:\n\"Today, we're waking up to the news that Russia has engaged in a full-fledged invasion of Ukraine,\" Kentucky Gov.",
    "This violation of the territorial integrity of a sovereign nation is unprovoked, is a flagrant violation of international law, and will result in senseless loss of life.",
    "Russia’s aggressive ambitions threaten the core interests of the United States, NATO, and the West, as strong voices like Senator Romney have been warning for years.",
    "Moving forward, how America leads the response from all freedom-loving nations will be measured carefully by our friends, by our adversaries, and by history itself.",
    "Ukraine’s leadership said at least 40 people had been killed so far in what it called a “full-scale war” targeting the country from the east, north and south.",
    "The President should have exercised his extensive authorities to impose certain tough sanctions early enough to actually deter invasion and weaken Russia.",
    "Russian troops launched their anticipated attack on Ukraine on Thursday, as President Vladimir Putin cast aside international condemnation and sanctions.",
    "“Andrea and I are praying for the Ukrainian people and our Ukrainian-American friends and neighbors who are watching these events unfold in horror.",
    "“Vladimir Putin’s insatiable pursuit of power has driven him to a decision that will kill innocent men, women and children in a democratic nation.",
    "Russia’s invasion of Ukraine is an unprovoked, flagrant violation of international law, one that will result in senseless loss of life.",
    "Now is not the moment for partisan division – Americans stand united with all our NATO allies, and we pray for the people of Ukraine.\"",
    "Vladimir Putin chose war, he is unleashing senseless death and destruction on the Ukrainian people, and he will face the consequences.",
    "\"This is a foreign policy crisis not just for Ukraine, but for the United States and all freedom-loving countries around the globe.",
    "It said Russia’s intent was to destroy the state of Ukraine, a Western-looking democracy intent on moving out of Moscow’s orbit.",
    "You may be able to find the same content in another format, or you may be able to find more information, at their web site.",
    "You may be able to find the same content in another format, or you may be able to find more information, at their web site.",
    "You may be able to find the same content in another format, or you may be able to find more information, at their web site.",
    "It has already begun to destabilize Eastern Europe in ways not seen since World War II and started a humanitarian crisis.\"",
    "Here's the statement in part:\n“Tonight, President Putin declared an illegal, unwarranted attack on the people of Ukraine.",
    "— Congressman Tim Ryan (@RepTimRyan) February 24, 2022\nCincinnati Mayor Aftab Pureval shared a similar sentiment.",
    "Ohio, Kentucky and Indiana lawmakers are sharing their reactions following Russia's attack on Ukraine Thursday.",
    "'The worst sunrise in my life': Ukrainians describe waking up to Russian attack\nOhio leaders react\nOhio Sen.",
    "For its part, Congress would support truly devastating sanctions against the Kremlin and its enablers.",
    "Here in Congress, upcoming defense spending measures will provide an opportunity to lead by example.",
    "\"Today, we pray for the people of Ukraine — in our sister city of Kharkiv and across the nation.",
    "Today, we pray for the people of Ukraine — in our sister city of Kharkiv and across the nation.",
    "\"Russia’s unprovoked assault on Ukraine is an affront to freedom and democracy the world over.",
    "Our state is a stronger, richer place because of the Ukrainian Americans who call Ohio home.",
    "And we should have sent more reinforcements to support NATO’s eastern flank allies earlier.",
    "Praying for the Ukrainian people and our Ukrainian-American friends and loved ones tonight.",
    "\"It's time for America to be united, every single one of us, against this external threat.",
    "Make no mistake: Putin will regret this decision.”\nThis content is imported from Twitter.",
    "We should have ensured that the pipeline of lethal aid to Ukraine was flowing far sooner.",
    "This attack will be met with united, decisive action by the United States and our allies.",
    "I condemn this latest Russian invasion of Ukraine in the strongest possible terms.",
    "Russia must cease its hostilities and withdraw its forces to within its borders.",
    "My heart is with the Ukrainian people now for their safety and security.\"",
    "Congressman Tim Ryan said on Twitter he's thinking of those in Ukraine.",
    "On Thursday, Beshear weighed in with a video message on social media.",
    "We're tough enough...now is the time for patriotism,\" he said.",
    "Rob Portman (R-OH) shared a statement following the attack.",
    "Putin has made his decision, and now we must make him pay.",
    "Sadly, deterrence after the fact is not deterrence at all.",
    "The entire world is now watching how we respond.",
    "Now we are watching his full brutality unfold.",
    "But this behavior will not stop with Ukraine.",
    "This content is imported from Twitter.",
    "We stand with you today and every day.",
    "This content is imported from Twitter.",
    "Kentucky leaders react\nKentucky Gov.",
    "We cannot afford to fail this test.\"",
    "Cincinnati stands with you.\"",
    "Cincinnati stands with you.",
    "Andy Beshear said."
  ]
}