{
  "id": 13916,
  "mediaId": 2702,
  "date": "2022-03-16",
  "headline": "Zelensky challenges conscience of Congress",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/zelenskyaddress1.jpg?w=1280",
  "link": "https://thehill.com/homenews/house/598510-zelensky-challenges-conscience-of-congress/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike Lillis",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“There are a lot of things we can do that we haven’t yet done.”\nShortly after Zelensky’s speech, Biden announced $800 million in new assistance for Ukraine, including helping provide 800 anti-aircraft systems to combat Russian planes; 9,000 anti-armor systems to help destroy Russian tanks and armored vehicles; 7,000 small arms such as machine guns and shotguns; and a total of 20 million rounds of ammunition, including artillery and mortar rounds.",
    "“It’s only being held up by one person: Biden.”\nSen. Lindsey Graham (S.C.), the top Republican on the Senate Appropriations Subcommittee on State, Foreign Operations, and Related Programs, also circulated a draft of a nonbinding resolution shortly after Zelensky’s speech to urge the Biden administration to support transferring the planes and air defense systems to Ukraine.",
    "Ukrainian President Volodymyr Zelensky confronted Americans on Wednesday with a graphic portrait of his country’s suffering in the face of Russian hostility, delivering an impassioned speech that challenged both the policies of the Biden administration and the conscience of a Congress that’s now vowing to escalate its response.",
    "While Zelensky failed to secure the backing for his most urgent request, the creation of a no-fly zone over Ukraine, his subsequent plea for less drastic interventions — including more anti-aircraft weapons and tougher economic sanctions — won the enthusiastic support of lawmakers on both sides of the aisle.",
    "It’s exactly what he should be doing.”\nWhile warning against Congress trying to “micromanage” the administration, Sen. Chris Murphy (D-Conn.), a member of the Foreign Relations Committee, predicted that Zelensky’s speech would prompt lawmakers to seek additional ways to defuse Russia’s aggression.",
    "New aircraft were not on the president’s list, an expected omission after the Pentagon had previously rejected a Polish plan to send Ukrainian Soviet-era MiG-29 fighter jets, to be replaced by U.S. fighters, with warnings that Russia could mistakenly perceive the transfer as escalatory.",
    "“The point of the no-fly zone request is to make us feel guilty that we can’t do the no-fly zone, so that we work even harder on everything that we can do,” said Rep. Tom Malinowski (D-N.J.), who served as a pro-democracy official at the State Department.",
    "As Russia’s bloody invasion of Ukraine was poised to enter its fourth week, Zelensky has launched a series of virtual speeches, to the United States and other western allies, in an effort to build public pressure for more military assistance to Ukraine.",
    "But Putin’s got to be stopped.”\n“The administration has led the world and the coalition in support of Ukraine, but without more that’s not going to be enough,” echoed Rep. Jason Crow (D-Colo.), a veteran of both the Iraq and Afghanistan wars.",
    "Airing a highly graphic video of mass graves and dead children, he said Ukraine is “fighting for the values of Europe and the world.” He called out President Biden’s non-interventionist approach to Putin’s aggression.",
    "Malinowski noted that, after calling for the no-fly zone, Zelensky began his menu of alternatives with the S-300 anti-aircraft missiles — a more realistic weapon, Malinowski argued, both practically and politically.",
    "Rob Portman (R-Ohio), the co-chair of the Senate Ukraine Caucus, urged the administration to broaden the banks that are cut off from SWIFT, an internal communications system used by banks to finalize transactions.",
    "Yet military experts are warning that the MiG-29s are outdated, and that providing them to Ukraine would not only be ineffective in providing air cover, it would also force Ukrainian pilots into suicide missions.",
    "But there’s broader support in Congress for ramping up air defense systems, and lawmakers are working on a separate deal to formally end normal trade relations with Russia, after Biden backed the idea Friday.",
    "That bill has been stalled amid disagreements between the White House and Congress over who would have the authority to restore normal relations, but Democratic leaders are predicting a quick resolution.",
    "“But we will do it soon.”\nBiden, in coordination with European allies, has also imposed several rounds of financial penalties, including those targeting Russian banks, oligarchs and Putin himself.",
    "House Minority Leader Kevin McCarthy (R-Calif.) said Wednesday that Biden, by refusing the transfer, is single-handedly preventing the Ukrainians from creating their own no-fly zone.",
    "The emotive speech brought tears to the eyes of some lawmakers, who are facing mounting pressure from voters at home to do more to help Ukraine without launching a third World War.",
    "“I don’t think the American people have an appetite for a shooting war, but that doesn’t mean that we’re limited to what we’re doing now,” said Rep. Dan Kildee (D-Mich.).",
    "“We can sanction every single Russian individual on the face of the planet, and I think we should listen to President Zelensky’s call for increased economic sanctions.",
    "“This is a moment in history that everybody will be watching and judging how this unfolds and we have a chance in real time to make a difference,” Graham said.",
    "Invoking touchstone events from U.S. history, including Pearl Harbor and 9/11, he framed the conflict as a universal battle between freedom and tyranny.",
    "“The MiG wouldn’t last a second in Ukrainian air space right now,” said Rep. Adam Smith (D-Wash.), chairman of the House Armed Services Committee.",
    "You have a choice.”\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "“We need to tighten the sanctions on the banks, include them all in SWIFT, and do more in terms of sanctioning individuals,” Portman said.",
    "“That is not only more possible, but actually a much more effective way of achieving his goal of clearing the skies,” Malinowski said.",
    "Though the decision has been backed by top Democrats, there’s also bipartisan support for getting the planes to Ukraine.",
    "“We’re going to give Ukraine the arms to fight and defend themselves through all the difficult days ahead,” Biden said.",
    "“And today I would make a statement to those Russian officials, and to those Russian commanders: You have a choice.",
    "“The president wanted some time to talk about that,” House Majority Leader Steny Hoyer (D-Md.)",
    "“You’d be better served to get drones or javelins, more Stingers or surface-to-air missiles.",
    "If those positions weren’t exactly new, Zelensky’s gripping appeal seemed to reinforce them.",
    "Those are the things that are proving most effective for the Ukrainian to use right now.",
    "But lawmakers on Wednesday wasted no time echoing Zelensky’s call for broader sanctions.",
    "And I think that will be the question a lot of members are asking,” Murphy said.",
    "“To be the leader of the world means to be the leader of peace,” Zelensky said.",
    "“You can’t leave the speech without thinking to yourself, what more can we do?",
    "… But I would expect that there would be more sanctions to come,” Murphy said.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "“You have an air defense that you can provide,” he said.",
    "Some lawmakers said that was his strategy all along.",
    "Zelensky’s entreaty in the address was not subtle.",
    "That’s where our focus should be,” he said.",
    "“We have to be smart about it, obviously.",
    "War crimes are being recorded.",
    "told reporters Wednesday.",
    "The world is watching.",
    "“It’s brilliant.",
    "Sen."
  ]
}