{
  "id": 1449,
  "mediaId": 6406,
  "date": "2022-02-17",
  "headline": "Vulnerable Democrats are Hidin’ from Biden",
  "image": "https://americarisingpac.org/wp-content/uploads/2019/07/GettyImages-1162219738-e1564415026973.jpg",
  "link": "https://americarisingpac.org/vulnerable-democrats-are-hidin-from-biden/",
  "mediaOutlet": "americarisingpac.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Tim Ryan, a Senate contender who represents another northern Ohio district, was invited, according to a spokesperson, but had a previous campaign commitment.”\nGubernatorial candidate Stacey Abrams also skipped out on attending an event with Biden in Georgia because of an alleged “scheduling mix-up.” No actual conflict was reported.",
    "“Fetterman himself told the Associated Press that there was a scheduling conflict that would prevent him from meeting with the president.”\nPennsylvania Attorney General and Gubernatorial candidate Josh Shapiro did not attend Biden’s event, choosing to keep distance between himself and the unpopular president.",
    "Whitney Robertson, America Rising PAC Press Secretary: “Democrats are avoiding Biden like the plague while championing the same policies that led to skyrocketing inflation, soaring violent crime, and a botched COVID response.",
    "John Fetterman on Friday ended up attending President Joe Biden’s speech in Pittsburgh after an earlier report said he and another top Democratic candidate would be missing the event.",
    "Progressive Senate candidate John Fetterman showed up to Biden’s event in Pennsylvania only after the President visited the site of a bridge that had collapsed that very morning.",
    "Biden traveled to Ohio today where top Democratic Senate candidate Tim Ryan was nowhere to be seen due to a “previous campaign commitment.”\nNBC News: “Rep.",
    "Their failed agenda left hard working Americans behind, and voters will not forget it when they go to the ballot box this November.”\nShare this article:",
    "As Joe Biden’s approval rating plummets in nearly all 50 states, vulnerable Democrats are keeping the historically unpopular president at arm’s length.",
    "Business Insider: “Pennsylvania Lt. Gov."
  ]
}