{
  "id": 15886,
  "mediaId": 8473,
  "date": "2022-03-09",
  "headline": "Congressmen back Biden’s move to ban Russian oil imports",
  "image": "https://ogden_images.s3.amazonaws.com/www.tribtoday.com/images/2022/03/09011745/030822...R-GAS-4.jpg",
  "link": "https://www.tribtoday.com/news/local-news/2022/03/congressmen-back-bidens-move-to-ban-russian-oil-imports/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Skolnick",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“As Putin’s war continues to squeeze working people at the pump in Ohio and across the country, we need to immediately pass a working-class tax cut that will help absorb some of these costs and get money into people’s pockets.”\nRyan added: “We must also seize this moment to fully restore America’s energy independence” as it’s a “vital step toward strengthening our national security, supporting American workers and beating back Russia and China who are strategically working together to outcompete us.”\nU.S. Rep. Bill Johnson, R-Marietta, said: “The decision to ban Russian oil imports is long overdue, but unless the president decides to take his foot off the throat of American energy producers, the American economy is going to continue to struggle, and it’s going to result in more pain for the American people.",
    "This will help keep gas prices under control and help alleviate Ohioans’ pain at the gas pump.”\nNEWSLETTER\nToday's breaking news and more in your inbox\nLocal News\nBishop OKs worship sites for parishes\nBishop David Bonnar of the Diocese of Youngstown has confirmed the worship-site recommendations made by pastors at ...\nTrumbull Regional to present heart health event\nWARREN — Trumbull Regional Medical Center is hosting a free community event on advanced heart care.",
    "Now we must do more here at home to put in place an all-of-the-above energy strategy and expand domestic energy production.”\nU.S. Sen. Sherrod Brown, D-Cleveland, said the ban will “increase the economic consequences of Putin’s invasion even further.”\nBrown also said: “We will do all we can to protect families from high prices here at home.",
    "The event ...\nODOT announces road adjustments for Trumbull\nHerner County Line Road between state Route 534 and U.S. Route 422 in Southington will be closed Wednesday to ...\nNiles holds tire drop-off May 2 at recycling center\nNILES — Niles will host its biannual tire drop-off May 2 to 14 for Niles city residents who may place up to 10 ...",
    "“Even if we’re independent from Russian oil, we’d pay more because of the European dependence on it.”\nDELEGATION\nU.S. Rep. Tim Ryan, D-Howland, was among the Valley’s congressional delegation to praise Biden’s Tuesday announcement that the United States is banning all Russian oil imports in retaliation for its invasion of Ukraine.",
    "Solid waste district shred event takes place Saturday\nWARREN — The Geauga-Trumbull Solid Waste Management District has teamed up with Protect-N-Shred Inc. of Cortland ...\nGirard fire department heads to Lewis Court blaze\nGIRARD — City fire crews were called out Sunday evening to a house fire on Lewis Court.",
    "Unless the president also takes immediate action to increase U.S. energy production, prices will continue to rise here at home.”\nJoyce said he didn’t understand why Biden would “turn to dictators in Iran and Venezuela for oil and gas” instead of American energy producers.",
    "“Even before this decision, there were issues with an increase in demand as the economy expands rapidly with not enough supply.”\nAlso, a temporary elimination of the federal and / or state gas tax would have a minimal impact on surging prices at the pump, Sumell said.",
    "“Congress has a moral obligation to investigate whether or not Russia has been interfering in American oil and gas policy and markets today and dating as far back as 2011,” Johnson wrote in a letter to the heads of four U.S. House committees.",
    "President Joe Biden’s decision to ban all Russian oil and gas imports drew unanimous support from members of Congress who represent the Mahoning Valley even though it will result in the record-high price of gas to increase.",
    "Albert J. Sumell, a Youngstown State University economics professor, said increasing American energy production is a potential long-term solution, but it won’t do anything to resolve the current rise in oil and gas costs.",
    "That’s why I called on the White House to release oil from the Strategic Petroleum Reserve, and President Biden is doing that” and “is taking steps to increase U.S. energy supplies from other countries.",
    "“By cutting off the impact of Russian oil and gas — Russia’s main export — the United States is delivering a massive blow to (Vladimir) Putin (its president) where it hurts,” Ryan said.",
    "“Gas prices are up because Joe Biden campaigned on, and has done his best to deliver, an energy transition away from fossil fuels, especially oil and gas,” he said.",
    "Rob Portman, R-Terrace Park, said he was pleased with Biden’s decision as it’s “another tool we can use to bankrupt President Putin’s economy and his war machine.",
    "Johnson also questioned if Russia has assisted the movement in this country to oppose fracking, shale development and building new pipeline capacity.",
    "Energy security is national security.”\nJohnson pointed out that gas prices were increasing long before Russia’s invasion of Ukraine.",
    "U.S. Rep. Dave Joyce, R-Bainbridge, said banning Russian oil, gas and coal imports “is absolutely the right thing to do.",
    "But the reality is that any ban on Russian energy that fails to flip the switch on American energy is incomplete.",
    "Russian oil makes up a small amount of the U.S. supply, but European countries rely heavily on it, Sumell said.",
    "“Not only does this damage our national security, but it also hurts the environment,” Joyce said.",
    "“By the time that happens, hopefully the problem is resolved,” Sumell said.",
    "Several also called for America to become energy independent.",
    "The high gas prices could last through the summer, he said.",
    "We cannot continue to fund Vladimir Putin’s war on Ukraine.",
    "“It’s a global market,” he said.",
    "A department spokesman ...",
    "U.S. Sen."
  ]
}