{
  "id": 15926,
  "mediaId": 8278,
  "date": "2022-03-08",
  "headline": "Sodexo Roth Is a Perfect Fit For ‘Voltage Valley’",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/03/wilcox.jpg",
  "link": "https://businessjournaldaily.com/sodexo-roth-is-a-perfect-fit-for-voltage-valley/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan O'Brien",
  "authorUrl": "https://businessjournaldaily.com/author/dobrienbusiness-journal-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "Sodexo Roth was founded in 1923 as Roth Bros. a roofing company that has evolved into a sophisticated tech-oriented company that today provides smart building automation, HVAC and facility management, manufacturing and its traditional roofing services.",
    "“We’ve added some construction there with HVAC systems and now looking at processing lines.”\nUltium is building a $2.3 billion battery-cell manufacturing plant in Lordstown that will serve GM’s next generation of electric vehicles.",
    "YOUNGSTOWN, Ohio – Business is growing at a healthy clip for a company established here nearly a century ago, due in part to increased demand for its facility maintenance services for some prominent industrial clients.",
    "Sodexo Roth has seen business increase in its facilities maintenance and HVAC divisions, driven by the need for clients to install more sophisticated air filtration systems during the pandemic.",
    "Moreover, the company is able to remotely monitor client facility’s operations – electrical usage, natural gas, and temperature, as an example – from a control room in the Youngstown office.",
    "“Especially in North America, we have key clients and that’s where we’re trying to expand.”\nBusiness has increased by between as much as 10% over the last three years, Sheppard says.",
    "“Our services have helped those organizations,” he said, such as the installation of ultraviolet technology to remove airborne contaminants in schools and industry.",
    "“They’re in the heart of Voltage Valley – they’re in the heart of the new economy that’s coming.”\nPictured at top: Ken Wilcox, sheet metal worker at Sodexo Roth.",
    "Among these clients is Ultium Cells, LLC, a partnership between General Motors and LG Energy Solution, says Rick Sheppard, vice president of Sodexo Roth.",
    "The congressman said that Sodexo Roth’s investment in new technologies makes it a competitive force in the Mahoning Valley and the rest of the country.",
    "U.S. Rep. Tim Ryan, D-13, paid a visit to the company Monday to speak with executives, workers and take a short tour of the metal fabricating plant.",
    "“It’s been a bright spot for our community,” John Schuler, Sodexo Roth senior director of marketing and communications, says of the Ultium project.",
    "The vast majority of operational issues – about 70% – are resolved remotely from the systems room instead of dispatching a field technician.",
    "That’s really helped us really grow our business over the past two years.”\nSodexo Roth has clients all over North America, Sheppard says.",
    "Sodexo, a multinational food service and facilities management corporation based near Paris, purchased the company in 2011.",
    "“This is a company that has a vision for the future when you look at the cutting-edge stuff that is happening,” he says.",
    "The plant is expected to begin production sometime in August and employ more than 1,100 when it reaches capacity.",
    "These workers fabricate products such as metal ductwork used in complex industrial HVAC systems.",
    "Sodexo Roth’s manufacturing operations include 60 members of Sheet Metal Workers Local 33.",
    "The Youngstown operation employs about 350, including field technicians.",
    "“Sodexo is a global company with 420,000 employees,” Sheppard says.",
    "“We look to be a great partner with them,” Sheppard says.",
    "“We want to make sure they have a safe work environment.",
    "Copyright 2022 The Business Journal, Youngstown, Ohio."
  ]
}