{
  "id": 17180,
  "mediaId": 8491,
  "date": "2022-03-03",
  "headline": "Rep. Ryan sponsors bill to restore Delphi pensions",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2021/12/tim-ryan-generic.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/tim-ryan-sponsors-court-battle-over-pensions/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gerry Ricciutti",
  "authorUrl": "https://www.wkbn.com/author/gerry-ricciutti/",
  "termIds": [
    5627,
    5408,
    2736,
    1819,
    1035,
    77,
    532,
    6474,
    6744
  ],
  "sentences": [
    "Supporters, including both Ohio senators Sherrod Brown and Rob Portman, admit it was wrong to cover pensions for GM and Delphi union workers but then to cut them for employees in other positions.",
    "The group is introducing new legislation called the Susan Muffley Act to restore the pensions for more than 20,000 former Delphi employees, 5,000 of those former employees live in Ohio.",
    "YOUNGSTOWN, Ohio (WKBN) – A group of federal lawmakers says 13 years is far too long to have waited, but relief may finally be coming for Delphi Salaried Retirees.",
    "Her husband, David, worked at Delphi as an electronics technician for 31 years but lost the full value of his pension in 2009.",
    "Despite health problems, Susan avoided seeing her doctor given her family’s financial constraints due to losing their pension.",
    "The legislation is named after Susan Muffley who was part of the core leadership in the effort to restore Delphi pension.",
    "Now, congressional action is the only option and Congressman Tim Ryan has now opted to cosponsor the new legislation.",
    "If the workers get their pensions restored, the impact in the Mahoning Valley would be about $100 million.",
    "The PBGC claims they have been paid what they’re entitled to and it can’t pay more than the law permits.",
    "The group hoped to have its case heard by U.S. Supreme Court but late last year, the high court refused.",
    "Editor’s note: This story clarifies that the legislation does not restore healthcare, only pensions.",
    "She was ultimately diagnosed with pancreatic cancer and passed away on August 9, 2012.",
    "“This has a unique bend to it because the government handled the auto rescue package.",
    "And so we have an obligation to make sure that everybody is made whole,” Ryan said.",
    "Their plans were cut by as much as 70% during the GM bankruptcy bailout from 2008.",
    "This is an opportunity for us with this particular bill.",
    "We are going to put on the full-court press,” Ryan said.",
    "“Just know that we are never giving up in this.",
    "Hopefully, to get some movement on it."
  ]
}