{
  "id": 17464,
  "mediaId": 8496,
  "date": "2022-03-02",
  "headline": "Ohio mapmakers OK 2nd congressional map over Democratic objections",
  "image": "https://media.wkyc.com/assets/WKYC/images/bd42d0f1-6716-49c6-bb6c-a736f9179bed/bd42d0f1-6716-49c6-bb6c-a736f9179bed_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/ohio-mapmakers-ok-2nd-congressional-map-democratic-objections/95-4f47372e-0a91-4858-985f-801d36ad0be9",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "That's assuming it is upheld by the court, where separate lawsuits have been brought by the National Democratic Redistricting Committee's legal arm, as well as the Ohio offices of the League of Women Voters and the A. Philip Randolph Institute.",
    "Ohio's one lost congressional seat is subtracted in the Akron area, where the once reliably safe districts of Democratic U.S. Rep. Tim Ryan and Republican U.S. Rep. Anthony Gonzalez were merged into a single district leaning 4.3% Democratic.",
    "COLUMBUS, Ohio — Republicans on the Ohio Redistricting Commission sent an adjusted map of congressional districts that delivers two-thirds of the seats to their party back to the state’s high court on Wednesday.",
    "They began the hearing by offering their own, more closely divided map — and then a series of four targeted amendments aimed at boosting Democratic representation within the GOP-drawn map.",
    "That decision said it didn’t have to match Ohio’s 54% Republican-46% Democratic breakdown, as legislative maps were ordered to, but should be fair.",
    "They have so far refused, despite concern from the state's attorney general, secretary of state and its association of county election officials.",
    "Ryan is seeking a U.S. Senate seat and Gonzalez announced his retirement after voting to impeach former Republican President Donald Trump.",
    "Congressional representatives are not required to live in their districts, but it can be a political disadvantage to live outside them.",
    "The invalidated map included six safe GOP seats, two safe Democratic seats and seven tossups that experts said favored Republicans.",
    "Troy Balderson's partisan advantage in the Columbus-area 12th District that was competitive for Democrats as recently as 2018.",
    "“The amendments don't particularly solve any of the problems,” Republican House Speaker Bob Cupp, the panel's co-chair, said.",
    "Without bipartisan support, the map will last just four years — rather than the possible 10 stretching until the next census.",
    "The other in the Toledo area represented by Democratic U.S. Rep. Marcy Kaptur, the longest serving woman in Congress.",
    "One of those competitive districts is in the Cincinnati area now represented by Republican U.S. Rep. Steve Chabot.",
    "Republicans sought to pass it Wednesday, because the candidate filing deadline for Congress is coming up Friday.",
    "Democrats argued the deadline was artificial, given lawmakers have within their power to move the May 3 primary.",
    "The 5-2 vote was in response to justices invalidating an earlier congressional map as gerrymandered in January.",
    "The new map includes 10 safe Republican seats, three safe Democratic seats and two Democratic-leaning tossups.",
    "The adjusted map by the Ohio Redistricting Commission delivers two-thirds of congressional seats to the GOP.",
    "The state will lose one seat with the 2022 elections due to lagging population recorded in the 2020 Census.",
    "Frustrated Democrats again opposed the latest plan, which is subject to Ohio Supreme Court review.",
    "Twelve of Ohio's 16 current U.S. House seats are held by Republicans.",
    "The map approved Wednesday adds to Republican U.S. Rep.",
    "The new maps are designed to account for that shift.",
    "Both efforts were unsuccessful.",
    "Previous Reporting:"
  ]
}