{
  "id": 17488,
  "mediaId": 2560,
  "date": "2022-03-03",
  "headline": "Bill to restore lost Delphi workers' pensions could top $1B, lawmaker says",
  "image": "https://www.gannett-cdn.com/presto/2018/11/01/PDTN/24e5fc73-f3ae-49f4-bdb1-b02f56618497-FILE-Kildee.jpg?crop=479,269,x0,y8&width=479&height=269&format=pjpg&auto=webp",
  "link": "https://www.detroitnews.com/story/news/politics/2022/03/03/bill-restore-lost-delphi-workers-pensions-could-top-1-b-lawmaker-says/9360460002/",
  "mediaOutlet": "Detroit News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melissa Nann Burke",
  "authorUrl": "https://www.detroitnews.com/staff/2684082001/melissa-nann-burke/",
  "termIds": [
    0
  ],
  "sentences": [
    "The area between Saginaw and Flint and Troy was especially hard hit because that's where most of the Michigan employees worked and where many still live, said Ron Beeber of Pentwater, a retired Delphi manager and board member for the Delphi Salaried Retirees Association.",
    "The Pension Benefit Guaranty Corp. — the government-owned pension insurer — terminated the Delphi salaried workers' plan and has since been paying retirement benefits to the former plan participants out of its insurance funds, but only up to the statutory cap.",
    "The bill, led by Michigan U.S. Rep. Dan Kildee in the House, would set up a trust fund at the U.S. Department of Treasury that would be used to top off the benefits of the nonunion retirees of the former General Motors Corp. parts unit to make them whole.",
    "The bill comes about six weeks after the U.S. Supreme Court declined to hear the retirees' case in January, letting stand a ruling by the 6th Circuit U.S. Court of Appeals upholding the government termination of their pension plans.",
    "As GM went through a quick-exit bankruptcy that year, the decision was made to \"top up\" the pensions of most union Delphi hourly workers and retirees, largely those of the United Auto Workers, to the full amount promised by GM.",
    "Portman, a co-sponsor of the bill, said the legislation requires the PBGC to calculate the cost of making the Delphi retirees whole, but that his office has estimated it will probably be close to $1 billion.",
    "Michigan and Ohio had the most workers affected by the benefit cuts, but Delphi salaried workers lived in nearly every state, said Bruce Gump, chair of the Delphi Salaried Retiree Association.",
    "The PBGC in court records last year indicated that the agency has paid nearly $1.5 billion in benefits out of its insurance funds since 2009 that were unfunded in the Delphi plan.",
    "GM did not do the same for 20,000 salaried retirees and pension participants at Delphi, a former GM subsidiary that was spun off in 1999 and which filed for bankruptcy in 2005.",
    "Washington — New legislation in Congress to restore full pensions for Delphi salaried retirees around the country could top $1 billion, a Republican senator said Thursday.",
    "\"By the way, all this was earned, so this is not a freebie,\" Portman said, adding his disappointment that the last three administrations never took on the issue.",
    "They worked in positions such as clerks and secretaries, cost estimators, technicians, engineers and foremen, among hundreds of other tasks, Gump said.",
    "Rob Portman, R-Ohio, told reporters the legislation is meant to \"infuse\" the PBGC with the cash needed to take care of the retirees' clipped benefits.",
    "\"These retirees have worked hard, they played by the rules, and then they had the rug pulled out from under them, and that's not right,\" Kildee said.",
    "Some pensioners and other plan participants lost as much as 70% of their vested benefits, as well as their health care coverage.",
    "GM later told a 2011 government audit that it made the call \"because of its dependence\" on the United Auto Workers union.",
    "\"These people were as necessary for the company to function as the workers on the production lines,\" Gump said.",
    "\"When U.S. government rescued GM but left these workers and their families behind, they left them hanging.\"",
    "Democratic Ohio Sen. Sherrod Brown introduced the bill in the Senate, along with Michigan Democratic Sens.",
    "\"When we tell people the story, the response we typically get is, 'Boy, you got screwed,'\" Beeber said.",
    "Co-sponsors of the bill include Ohio Reps. Michael Turner, a Republican, and Tim Ryan, a Democrat.",
    "About 20,000 workers were affected by the cuts, including close to 6,000 in Michigan.",
    "\"This bill will help all of those who are left behind.\"",
    "\"That's why we haven't given up this fight.\"",
    "The Delphi retirees' lawsuit dated to 2009.",
    "Debbie Stabenow and Gary Peters.",
    "mburke@detroitnews.com",
    "Sen."
  ]
}