{
  "id": 17765,
  "mediaId": 8283,
  "date": "2022-03-01",
  "headline": "Ohio redistricting: GOP unveils new congressional map. See it here.",
  "image": "https://www.gannett-cdn.com/presto/2022/03/01/NCOD/7ebac262-c553-48bb-9972-f4f85c49b1c0-congressional_map_March_1_3.jpg?crop=2302,1295,x0,y676&width=2302&height=1295&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/03/01/ohio-redistricting-republicans-propose-new-congressional-map/6923713001/",
  "mediaOutlet": "chillicothegazette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    0
  ],
  "sentences": [
    "Here is the proposed districts' partisan breakdown:\n1st district, represented by Republican Rep. Steve Chabot: +2 Democratic\n2nd district, represented by Republican Rep. Brad Wenstrup: +39.5 Republican\n3rd district, represented by Democratic Rep. Joyce Beatty: +37.8 Democratic\n4th district, represented by Republican Rep. Jim Jordan: +35.7 Republican\n5th district, represented by Republican Rep. Bob Latta: +22.7 Republican\n6th district, represented by Republican Rep. Bill Johnson: +18.1 Republican\n7th district, represented by Republican Rep. Bob Gibbs: +8.8 Republican\n8th district, represented by Republican Rep. Warren Davidson: +24.9 Republican\n9th district, represented by Democratic Rep. Marcy Kaptur: +0.5 Democratic\n10th district, represented by Republican Rep. Mike Turner: +6.6 Republican\n11th district, represented by Democratic Rep. Shontel Brown: +59.7 Democratic\n12th district, represented by Republican Rep.",
    "Troy Balderson: +22.7 Republican\n13th district, currently represented by Democratic Rep. Tim Ryan and Republican Rep. Anthony Gonzalez: +4.3 Democratic\n14th district, represented by Rep. Dave Joyce: +9.7 Republican\n15th district, represented by Republican Rep. Mike Carey: +8.6 Republican\nJessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "Those highly competitive districts include one in Cincinnati that stretches to Warren County, currently represented by GOP Rep. Steve Chabot, and another in Toledo that stretches from the northwest corner of the state to Erie County, currently represented by Democratic Rep. Marcy Kaptur, the longest-serving woman in the U.S. House of Representatives.",
    "The proposed 13th congressional district, which combines Akron's Summit County with parts of Stark County and a sliver of Portage County, leans Democratic but Republicans could easily win in a good GOP year.",
    "Republicans and Democrats on the commission disagree over whether the map must last 10 years, thus requiring votes from both Democratic members, or if GOP members could pass a four-year map instead.",
    "The rejected map also protected two GOP congressional districts in Hamilton County, even though the county voted for Democratic President Joe Biden with 57% of the vote.",
    "Under new rules, the city of Cincinnati must be kept whole in one congressional district, but mapmakers diluted Democratic votes there with GOP ones from Warren County.",
    "The Ohio Redistricting Commission could approve a new plan as soon as Wednesday, racing to finish a plan before candidates file paperwork to run Friday.",
    "The situation is less dire than with state legislative candidates because members of Congress are not required to live in the district they represent.",
    "Lawmakers were sent back to the drawing board but they couldn't cobble together the votes needed for a map to take effect immediately.",
    "Republican mapmakers revealed a new congressional plan Tuesday after the first one was rejected by a divided Ohio Supreme Court.",
    "Ohio Attorney General Dave Yost agreed with fellow Republicans that the commission could pass a map without Democratic support.",
    "Republican candidate Max Miller, who is backed by former President Donald Trump, would face a primary with GOP Rep. Bob Gibbs.",
    "The new proposal would place Kaptur in a tossup district stretching from Williams County to Erie County along Lake Erie.",
    "But the map appears to draw Democratic Rep. Joyce Beatty and Republican Rep. Mike Carey into the same Columbus district.",
    "In Tuesday's proposal, Cincinnati was combined with Warren County once again, in a district that is barely Democratic.",
    "The new map would create 10 safe Republican seats, three Democratic districts and two tossups that lean Democratic.",
    "The first map threatened Kaptur by drawing her into a district with several more-rural, more-Republican counties.",
    "That sent the pen back the seven-member Ohio Redistricting Commission, which had yet to pass a bipartisan map.",
    "She currently represents the infamous \"snake on the lake\" district, which stretches from Toledo to Cleveland.",
    "Her father, state Sen. Vernon Sykes, is on the seven-member commission working on the new congressional map.",
    "Ohio's GOP-controlled Legislature passed a map in November that could have given the GOP a 12-3 advantage.",
    "Sen. Vernon Sykes said that Cincinnati should be wholly contained in a Hamilton County district.",
    "But Ohio is losing a congressional seat because its population grew slower than the nation's.",
    "The most competitive Republican district is the 10th, represented by Dayton Rep. Mike Turner.",
    "That's important because control of the U.S. House of Representatives hangs in the balance.",
    "No incumbents would face off against one another, Senate President Matt Huffman said.",
    "Justice Michael Donnelly wrote that Republicans had stacked the deck in their favor.",
    "Ohio's current congressional delegation includes 12 Republicans and four Democrats.",
    "Ohio is one of the last states to finalize its map of congressional districts.",
    "On Friday, candidates interested in running for Congress must file paperwork.",
    "See the map on Dave's Redistricting App, a popular redistricting website.",
    "Democrats are hoping to makes some changes before the plan is finalized.",
    "Once again, the commission is under a tight deadline to pass a map.",
    "Any approved map will face a review from the Ohio Supreme Court.",
    "State Rep. Emilia Sykes, D-Akron, is hoping to win that seat.",
    "Without a strong challenger, Chabot could still win there.",
    "But the Ohio Supreme Court rejected it in a 4-3 decision.",
    "Right now, candidates don't know where they are running.",
    "That proposed district favors the GOP 53.3% to 46.7%.",
    "Ultimately, the Ohio Supreme Court will decide.",
    "But it certainly helps, politically.",
    "What does the proposal look like?"
  ]
}