{
  "id": 17851,
  "mediaId": 2576,
  "date": "2022-03-02",
  "headline": "Bipartisan proposal in Congress would restore pensions for Delphi's salaried retirees",
  "image": "https://www.gannett-cdn.com/presto/2021/09/01/PDTF/61e493e1-4da9-4240-bf73-eb475c26f0d8-AP_Delphi_Bankruptcy_M.jpeg?crop=3146,1770,x0,y18&width=3146&height=1770&format=pjpg&auto=webp",
  "link": "https://www.freep.com/story/news/politics/2022/03/02/delphi-retiree-pensions/9347673002/",
  "mediaOutlet": "freep.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Todd Spangler",
  "authorUrl": "https://www.freep.com/staff/2646148001/todd-spangler/",
  "termIds": [
    0
  ],
  "sentences": [
    "On Thursday, a group of Republican and Democratic members of Congress will announce legislation that, if passed, would require the U.S. Treasury to fully pay the pensions that more than 20,000 salaried workers saw slashed even as union workers for the Troy-based auto parts supplier had their pensions fully funded amid the Obama administration's rescue of General Motors in 2009.",
    "For years, the retirees have reached out to lawmakers at the state and federal levels and an impressive array of officeholders from both parties have argued that something should be done to restore their pensions, given that union workers, largely represented by the UAW, had their pensions restored.",
    "They have also argued that if GM, which spun off its auto parts wing as Delphi in 1999, was going to fully fund union pensions for Delphi employees as part of its own government-planned bankruptcy in 2009, then their pensions should have been covered as well.",
    "They argued that the Pension Benefit Guaranty Corp. or PBGC, the government-charted insurer of last resort for failing pension plans, had no right to take over their pension plan after Delphi's bankruptcy without a court hearing their objections first.",
    "More:For Delphi's former salaried workers, retirement has been a long fight for fair treatment\nIn the wake of the PBGC's takeover of their plan, pensioners and their beneficiaries saw their monthly payments cut by 30% and in some cases far more.",
    "But the fate of its workers' pension plans became intertwined with that of GM in 2009, since the automaker needed parts — and the UAW's agreement — to the proposed reorganization drawn up by President Barack Obama's auto task force.",
    "Less than two months after Delphi's salaried retirees lost their last appeal to the U.S. Supreme Court, they have yet another chance to have the pensions they saw cut more than a decade ago finally restored.",
    "The proposed legislation will be introduced in the U.S. House by Democratic U.S. Reps. Dan Kildee of Flint Township and Tim Ryan of Ohio and Republican U.S. Rep. Mike Turner of Ohio and in the Senate by Sen.",
    "But union employees — who had their own plans also assumed by the PBGC — saw their payments topped off by GM following the government rescue to ensure they received all to which they were entitled.",
    "Saying they were treated unfairly, Delphi's salaried retirees and their beneficiaries — largely based in Michigan, New York and Ohio — had been battling in court for 12 years.",
    "A draft copy of the legislation also indicated the measure could provide full benefits for a set of smaller pension plans related to Delphi's bankruptcy that were also cut.",
    "Kildee's office, in announcing a news conference Thursday morning to unveil the legislation, put out a statement saying the PBGC treated the retirees unfairly.",
    "\"These hardworking retirees suffered significant losses to their earned benefits, with devastating impacts on many of their lives,\" it said.",
    "In January, however, the Supreme Court declined without comment to hear the retirees' appeal of a lower court's ruling against their claims.",
    "Both then-President Donald Trump and current President Joe Biden talked about the pensioners' plight on the campaign trail in 2020.",
    "As such, it may represent the best chance the retirees have had to date to get their pensions restored.",
    "That left Congress as the retirees' only chance of having their pensions restored.",
    "Read more onMichigan politics and sign up for ourelections newsletter.",
    "Contact Todd Spangler:tspangler@freepress.com.",
    "Delphi entered bankruptcy in 2005.",
    "Follow him on Twitter@tsspangler.",
    "Rob Portman, R-Ohio."
  ]
}