{
  "id": 189,
  "mediaId": 8496,
  "date": "2022-02-24",
  "headline": "Ohio politicians react to Russian invasion of Ukraine",
  "image": "https://media.wkyc.com/assets/CCT/images/fdb2e18d-fc78-4e42-bbdd-4c3a92ee9fd3/fdb2e18d-fc78-4e42-bbdd-4c3a92ee9fd3_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/ohio-politicians-react-russia-invasion-ukraine/95-68d1a787-6eb5-4832-b15a-631b45fe0530",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "My full statement: https://t.co/TmXN1tOtCn pic.twitter.com/NVwi3rGlKu\n— Rob Portman (@senrobportman) February 24, 2022\nPortman also made more comments Thursday prior to President Biden's address:\n\"The United States should lead the international community to hold Russia accountable for this tragedy.",
    "While the world waits on a response from President Biden, NATO, and the European Union, here is how Ohio's lawmakers are reacting to the Russian aggression in Ukraine:\nSen. Sherrod Brown (D): \"Russia's unprovoked assault on Ukraine is an affront to freedom the world over.",
    "President Biden has made it clear the U.S. and our allies and partners will impose the strongest sanctions Russia has ever seen, and I will work with the Biden Administration to implement them against Russian officials and oligarchs who prop up Putin's regime.\"",
    "Rep. Marcy Kaptur (D), co-chair of Congressional Ukraine Caucus: \"Without provocation – and in a reprehensible violation of international law – Vladimir Putin has rejected diplomacy and chosen the path of brutal and senseless war with Ukraine.",
    "\"I call on President Biden and his team, working with our allies across the globe, to impose immediate, tougher – as harsh as possible - sanctions and export controls to create more of an effective deterrent on Putin’s tyranny.",
    "Parma Mayor Tim DeGeeter (D): \"Each year, we have a parade in August celebrating Ukraine's independence and a festival that attracts thousands to join the celebration of Ukraine's rich culture, music, food and history.",
    "CLEVELAND — Much of the nation awoke Thursday to the news of Russia's launch of a wide-ranging attack on Ukraine, hitting cities and bases with airstrikes or shelling, as civilians piled into trains and cars to flee.",
    "The security and stability of Europe – and the preservation of global liberty – are all on the line.”\nRep. Shontel Brown (D): \"I am praying for the Ukrainian people during this unjustified invasion.",
    "Rob Portman, co-chair of Senate Ukraine Caucus (R): \"Russia's invasion of Ukraine is an unprovoked, flagrant violation of international law, one that will result in senseless loss of life.\"",
    "\"I now call on the Biden administration to lead the world in the strongest sanctions possible, to include sanctions on Russian banks, key oligarchs and President Putin and his associates.",
    "We must also impose strong export controls to significantly limit Russia’s access to technology, including semiconductors, which are vital to both Russia’s economy and their military.\"",
    "Rep. Bob Gibbs (R): \"It is time to impose crippling sanctions on Putin, Russian gov't officials, and their cronies, and to provide as much military hardware to Ukraine as possible.",
    "\"Many Ukrainian residents in Parma and Northeast Ohio have family and friends living in Ukraine and are praying for their safety and a peaceful conclusion to this current crisis.",
    "While our immediate focus should be on supporting the Ukrainian people and deterring future Russian aggression, we should also be very aware that our enemies are watching.",
    "\"Putin has repeatedly justified his aggression with lies, but the world must understand that he spills innocent blood because freedom and democracy are his true enemies.",
    "While we should not commit our military to another costly war in another far away land, we simply must do more to raise the cost of today’s invasion to Putin.",
    "In a show of support for Ukrainian Village's numerous businesses and Ukrainian residents, we placed Ukrainian flags along State Road in the Village.\"",
    "In a show of support for Ukrainian Village’s numerous businesses and Ukrainian residents, we placed Ukrainian flags along State Road in the Village.",
    "\"Together, the United States and our allies must unleash crippling sanctions against Russia, and swiftly bolster Ukraine’s military capabilities.",
    "Absent a more forceful response that changes the calculation for Mr. Putin, we should expect more of the same from him and our other enemies.",
    "Troy Balderson (R): \"Russia's unprovoked assault on Ukraine represents the most flagrant attack on democracy in Europe since World War II.",
    "By invading Ukraine, Putin has affirmed Russia’s status as a criminally rogue state, and launched an offensive against the entire world.",
    "Russia’s invasion of Ukraine is an unprovoked, flagrant violation of international law, one that will result in senseless loss of life.",
    "Mike DeWine (R): \"At the direction of President Vladimir Putin, Russian forces have invaded Ukraine in violation of international law.",
    "John Kasich (R): \"This violent action by Russia is immoral, unjustified and completely incompatible with modern, civilized leadership.",
    "I believed they were warranted and would have been appropriate for the malign actions Russia committed prior to the current invasion.",
    "As missiles tear through Ukraine’s skies, and tanks begin to roll through its streets – the Free World must rise up in its defense.",
    "Vladimir Putin chose war, he is unleashing senseless destruction on the Ukrainian people, and he will face the consequences.",
    "\"In the past, Ukrainians have suffered through Russian aggression and, once again, their independence is being threatened.",
    "The United States must stand in solidarity with Ukrainians as they defend their nation and their right to self-governance.",
    "In the past, Ukrainians have suffered through Russian aggression and, once again, their independence is being threatened.",
    "\"I pray that our nation finds the wisdom to make the right decisions and prevent the most catastrophic of outcomes.\"",
    "America and its allies will hold Russia accountable for the destruction and devastating loss of life it will bring.",
    "I pray that our nation finds the wisdom to make the right decisions and prevent the most catastrophic of outcomes.\"",
    "Rep. Tim Ryan (D): \"Praying for the Ukrainian people and our Ukrainian-American friends and loved ones tonight.",
    "Rep. Anthony Gonzalez (R): \"Today we pray for the brave Ukrainians who have awoken to invasion led by a tyrant.",
    "Ukraine has been a sovereign and independent state since the collapse of the former Soviet Union in the 1990s.",
    "Putin does not get to desecrate the borders of a sovereign country and threaten the safety of its citizens.\"",
    "\"It is time to send a strong message to Vladimir Putin that such acts of aggression will not be tolerated.",
    "China, Iran, and others will see our actions and those of our allies and adjust their plans accordingly.",
    "NATO and the West must stand united in imposing harsh consequences on Putin for this unprovoked attack.\"",
    "This invasion will inflict unimaginable suffering the likes of which we have not seen in recent memory.",
    "And there is only one person responsible for the tragedy unfolding in Eastern Europe: Vladimir Putin.",
    "Thinking about the unnecessary loss of life and suffering that will occur in Ukraine is very somber.",
    "The United States and Ukraine share common values including freedom, democracy, and the rule of law.",
    "We pray that the Ukrainian people will muster the courage and strength they need in this dark time.\"",
    "\"This is unacceptable, and all freedom-loving people should stand against this unprovoked invasion.",
    "Nations across the globe must come together to hold Russia accountable for this unprovoked attack.",
    "... pic.twitter.com/VD5RJcVGvM\n— Mayor Tim DeGeeter (@ParmaMayor) February 24, 2022\nFormer Gov.",
    "\"Extra vigilance should be maintained right now to protect our NATO allies in Eastern Europe.",
    "\"The great conflicts of the past have taught us that Putin’s aggression cannot be tolerated.",
    "Today, we stand united with our Parma and NE Ohio Ukrainian residents and for Ukraine.",
    "Russia must cease its hostilities and withdraw its forces to within its borders.",
    "There are no winners in war, only horrific death and catastrophic destruction.",
    "Rep. Dave Joyce (R): \"May God be with the brave, innocent people of Ukraine.",
    "Rep. Bill Johnson (R): \"We've seen nothing like this in Europe since WWII.",
    "My heart is with the Ukrainian people now for their safety and security.",
    "This attack will be met with decisive action by the U.S. and our allies.",
    "\"There are millions of innocent civilians who don't want conflict.",
    "NATO’s unified resolve against Russia’s aggression is essential.\"",
    "Whether we like it or not, we have a responsibility to lead.",
    "Putin has made his decision, and now we must make him pay.\"",
    "Our adversaries and allies alike are watching how the U.S.",
    "I have been clear that I supported pre-invasion sanctions.",
    "Ohio is home to 80,000 citizens of Ukrainian descent.",
    "What has been tried thus far clearly did not work.",
    "America stands with Ukraine and with democracy.\"",
    "\"Our thoughts are with the Ukrainian people.\"",
    "Rep. Jim Jordan (R): \"Pray for Ukraine.",
    "May God bless its brave citizens.\"",
    "More Coverage:",
    "responds.\"",
    "Rep.",
    "Gov.",
    "Sen."
  ]
}