{
  "id": 2033,
  "mediaId": 8278,
  "date": "2022-02-08",
  "headline": "Ohio to Receive $46.6M for Coal Mine Communities Through Infrastructure Law",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2021/08/coal-industry-8-19.jpg",
  "link": "https://businessjournaldaily.com/ohio-to-receive-46-6m-for-coal-mine-communities-through-infrastructure-law/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“The Biden-Harris administration is committed to helping working families, often in rural and Tribal communities, who face hazardous pollution, toxic water levels, and land subsidence both during mining and long after coal companies have moved on,” Interior Secretary Deb Haaland said in a separate release posted on the department’s website.",
    "“I am proud to have voted in support of this historic legislation that will create thousands of jobs across Ohio through reclaiming abandoned mine lands and paving the way for redevelopment opportunities, like advanced manufacturing and renewable energy deployment,” Ryan, D-13 Ohio, said in the release.",
    "“Many of our communities across Ohio played a significant role in the industrial development of the United States, and now we must ensure their land and their economies are revitalized.”\nAs required by the law, this funding will prioritize projects that will employ dislocated coal industry workers.",
    "These investments will provide needed jobs for coal communities, while simultaneously closing dangerous mine shafts, reclaiming unstable slopes, improving water quality by treating acid mine drainage, and restoring water supplies damaged by mining, according to the release.",
    "“The Bipartisan Infrastructure Law’s historic investments will help revitalize these local economies and support reclamation jobs that help put people to work in their communities, all while addressing environmental impacts from these legacy developments,” she added.",
    "“This investment is a promise, a down payment to create new jobs and give local communities resources they need to restore the land and keep their communities safe.”\nCopyright 2022 The Business Journal, Youngstown, Ohio.",
    "WASHINGTON – Ohio will receive $46.4 million to reclaim abandoned mine lands and eliminate dangerous environmental conditions and pollution caused by past coal mining though the Infrastructure Investment and Jobs Act.",
    "The funding is part of a total of $11.3 billion in funding over 15 years announced by U.S. Rep. Tim Ryan – who voted in favor of the bipartisan bill – and the Department of the Interior, according to a news release.",
    "“Ohio coal communities helped build and power this country and they deserve our respect and attention,” U.S. Sen. Sherrod Brown, D-Ohio, said in a release sent by his office."
  ]
}