{
  "id": 2251,
  "mediaId": 2890,
  "date": "2022-02-06",
  "headline": "The best $69.99 I ever spent: A pickleball paddle",
  "image": "https://cdn.vox-cdn.com/thumbor/-bQAEMFTu_QSpmXGmCeO5qXCEug=/0x95:4000x2189/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23215909/Paddle.jpg",
  "link": "https://www.vox.com/the-goods/22916261/pickleball-sports-older-adults-best-money-pandemic-hobby",
  "mediaOutlet": "Vox",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Ryan Williams",
  "authorUrl": "https://www.vox.com/authors/tim-ryan-williams",
  "termIds": [
    0
  ],
  "sentences": [
    "So when I was inevitably cut from the lineup, I wish I could say I shrugged it off and gave a hearty, “Thanks for nothing, jerks.”\nInstead, the defeat became a chip on my shoulder, a reason to scorn people who care about sports — aided by the many other things very wrong with the sports industrial complex.",
    "A representative text “exchange” (read: extremely one-sided conversation) with a friend from this period:\n“I just paid money for a pickleball lesson”\n“like 40 dollars”\n“it’s at 8 am on a saturday”\n“I’m very excited”\nOn that October morning, I was late, and not quite as excited.",
    "I joined them to hit the ball around and found myself immediately chasing after every volley like a happy pup, the perfect sun of a Midwestern summer shining down on my arms, as scrawny and freckled and slathered in sunscreen as they were in my soccer days.",
    "But sticking around rewarded me with an invite to gay pickleball, which in my limited experience takes an already pretty relaxed game and truly brings it to the level of friendly competition and affirmation I crave.",
    "The “just try to bounce the ball on your paddle like a ping-pong ball” exercise immediately sent me chasing balls into the rose bushes, as did the “just gently bounce the ball and tap it over the net” exercise.",
    "I was matched with two much older women who were much better at bending their knees than me, and one ringer with suspiciously pendulum-like serves who eventually admitted to extensive tennis training.",
    "I was a wallflower: I walked around to get a closer look; confirmed that, yes, everyone here knew everyone already; walked out; and sat on a park bench, shielding my paddle in my jacket from the rain.",
    "This is a game about polite introductions: The serves are underhand, and you have to wait for the ball to bounce once on each side of the court before you can start smashing it at each other.",
    "Pickleball has seen a surge in interest with the rise of the pandemic hobby; this one has the advantage of being outdoors, social, and relatively easy to pick up for people of all ages.",
    "It’s all very Pacific Northwest, I assume; that’s where the sport sprang up in the ’60s after a family was bored in their backyard one day and could only find half a badminton set.",
    "You might see them engaging in very light trash talk while tossing back wayward balls or, in at least one incredible case, stuffing a spare one into tight gym short pockets.",
    "In ninth grade, while trying to avoid exposing any part of my body in the locker room after soccer practice, my never-promising career in sports came to an abrupt end.",
    "I didn’t like when boys would show off their ball juggles, high above their floppy ’90s haircuts, for the very simple reason that I couldn’t do anything like that.",
    "I found our instructor on the court already, clad in athletic wear, a visor emblazoned with pickleballs, a slightly worrying leg cast, and a boundless smile.",
    "It’s hopeless to try to break down why anyone likes anything, but here are the main points for me: Pickleball looks supremely silly, but feels like a sport.",
    "Every time, I’m surprised at how good it feels; I otherwise would only be outside in the winter to shuffle in my parka to the corner store for some seltzer.",
    "Still, after whiffing many a dink and cross-dink, soon my doubles partner and I were playing and winning a real game, grunts and sighs and smashes and all.",
    "And under the glaring stadium lights, an endless pop pop pop pop on a grid of green courts, full of young, hungry pickleball players here for drop-in play.",
    "As a kid, I took up soccer without much thought; it seemed less boring than T-ball, which reliably put me and the other 5-year-olds to sleep in left field.",
    "To pique my flagging interest in the endeavor over the phone, they mentioned there was a pickleball court in the half-built development they were joining.",
    "“Have you heard of pickle … ball?”\nIn the midst of the pandemic, my parents were about to move from their Minnesotan home to a house four miles away.",
    "“It’s too aggro; those guys just smash the ball,” one attendee said, although to be clear, smashing the ball is something that person does very well.",
    "Financial contributions from our readers are a critical part of supporting our resource-intensive work and help us keep our journalism free for all.",
    "It’s slow enough to feel strategic and not make you too winded, but you also get to chase after balls and attempt athletic flailing of the limbs.",
    "But I knew that casual barb was really aimed at me, the kid who was too old to be this terrible at soccer and still expect to play on the team.",
    "Our coach beamed at our modest improvement, and encouraged us to take another class and then maybe check out drop-in play with the local club.",
    "My parents weren’t too sure what the game was or how to play it — it sounded like a fever dream combining badminton, ping-pong, and tennis.",
    "They’re all angling to play someone who is just a little better than they are, in hopes of making it up a rung on the metaphorical ladder.",
    "Also: The paddles make a nice thwacking sound, much like, say, a locker room towel fight, but blissfully free of teenage, bro-y bullshit.",
    "Finally, I dragged a friend on an inflation-era shopping spree and found the best pickleball paddle a medium amount of money can buy.",
    "If you are wondering what the vibe of a not-quite-professional pickleball player is, it’s maybe like someone who bikes a lot.",
    "In middle school, others on my team picked up another skill with ease: riffing on a hefty supply of homophobic jokes.",
    "But it’s okay to fool yourself; it’s okay to try on a new persona that feels a little ridiculous, no matter your age.",
    "It takes up space in your home, and it’s a little scary to walk by every day: A person who plays sports lives here?",
    "A pastiche of every ’90s underdog sports movie ran through my head: This was the big leagues, and I was not ready.",
    "I was determined, however, to keep up the pretense long enough that it would be too embarrassing to suddenly quit.",
    "I liked the Ziplocs of orange slices and the ritual of arming yourself with shin guards, long socks, and cleats.",
    "When I flew back home, I lurked around local tennis courts to see if people like me were really allowed there.",
    "I once moved apartments by lugging four broken suitcases and a trash bag on the New York subway to a Megabus.",
    "“How can you even hit with that thing?” one of the regulars asked, eyeing my $15 glorified piece of plywood.",
    "Well, we’ll give it a go.”\nWhen I finally was able to come visit, they had three paddles ready for action.",
    "She could not have been more enthusiastic about this sport — perhaps still riding the pandemic hobby high.",
    "“Some tough cuts coming up,” a teammate said to no one in particular, in between half-hearted towel whips.",
    "I bit the bullet and asked a couple people lounging in camp chairs by the court if I could join a game.",
    "Maybe, I hoped, this was the infinite confidence of a person who had found their thing\nA cold night.",
    "The thrill of facing a tiny fear can only last so long — I’m not dreaming about pickleball anymore.",
    "Our mission has never been more vital than it is in this moment: to empower through understanding.",
    "I tried to delicately broach the subject of non-gay pickleball and got a lot of reassuring nods.",
    "At my parents’ place, I started waking up early, eager to practice hitting balls to no one.",
    "Or maybe, I hoped, this was the infinite confidence of a person who had found their thing.",
    "I have the privilege of relatively good health, and the time and money for a hobby.",
    "Or, for that matter, a paddle that could reliably hit the ball more than 6 feet.",
    "I don’t know if I ever really enjoyed the sport; I always hated the running.",
    "I scanned the courts from a distance and saw no friendly older ladies.",
    "I sometimes go to absurd lengths to avoid spending money on myself.",
    "(I may or may not have also bought rollerblades I have never used.)",
    "Tim Ryan Williams is the deputy style and standards editor at Vox.",
    "There is a high skill ceiling, but the floor is low and inviting.",
    "Whatever the “working out” gene is, I absolutely do not have it.",
    "Millions turn to Vox to understand what’s happening in the news.",
    "Last time I played, everyone went home with a birthday cookie.",
    "But didn’t she see me crush those limber-limbed older ladies?",
    "If I got a real paddle, I fretted, it would be a statement.",
    "Now I was intrigued; we are usually a sit-and-read family.",
    "I play a sport now, and no one can take that away from me.",
    "But I decided I was ready to spend a little — on a sport!",
    "Isn’t this why I gave up on sports in the first place?",
    "What if there were some other sport out there for me?",
    "As I grew older, I occasionally felt pangs of regret.",
    "The bench was cold, though, and I came all this way.",
    "Over the course of my stay, I began to fall in love.",
    "Please consider making a contribution to Vox today.",
    "I’m not sure I’m getting any better at it, either.",
    "Four million Americans are supposedly playing now.",
    "(See also: wanting to hide every part of my body.)",
    "“It seems like it might be kind of noisy, though?",
    "It was apparently next door to their new house.",
    "— and signed up for a single pickleball lesson.",
    "For months, I resisted spending any more money.",
    "This was just fun, unadulterated by adulthood.",
    "Good, however, for exercise with aging knees.",
    "I did not even own gym shorts at that point.",
    "Here, confuse yourselves more with a video.",
    "But I like being outside, and I like games.",
    "(They were ready to be done with stairs.)",
    "My serves got only begrudging approval.",
    "I try to show up regularly anyway.",
    "I was ready for the big leagues!",
    "Why did the stakes feel so high?",
    "Take that, ninth grade jerks.",
    "Obviously, I got trounced.",
    "The early going was rough.",
    "I still play in jeans.",
    "Is this who I am now?",
    "We nodded dutifully.",
    "Plus a whiffle ball?",
    "Who am I fooling?",
    "A misty rain.",
    "I’m not sure."
  ]
}