{
  "id": 2553,
  "mediaId": 2676,
  "date": "2022-02-09",
  "headline": "Republicans in chaos: Conflict with Trump endangers GOP Senate prospects",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/02/hogan-trump-mcconnell-0209221.jpg",
  "link": "https://www.salon.com/2022/02/09/in-chaos-conflict-with-endangers-senate-prospects/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    0
  ],
  "sentences": [
    "Vance is \"now underwater\" with Trump supporters and \"very conservative voters, groups needed to win a GOP primary,\" the pollster's presentation reported, adding that Vance's \"association as a Never Trumper has only grown since November\" and that \"being anti-Trump is the #1 reason voters do not like Vance.\"",
    "Trump is also backing former NFL star Herschel Walker in the race against Democratic Sen. Raphael Warnock in Georgia, where many Republicans blamed the former president for costing the party both its Senate seats in a January 2021 runoff by stoking debunked conspiracy theories about election fraud.",
    "Larry Hogan, a Republican moderate who has often criticized Donald Trump, has decided not to run for U.S. Senate this year — after vigorous lobbying by Senate Minority Leader Mitch McConnell — dealing the latest blow to the party's chances of retaking control of the chamber in the 2022 midterms.",
    "As a result, Republicans heading into the midterms with some of their most popular state executives on the sidelines while Trump-friendly Big Lie supporters threaten to upend Republican primaries and undermine the party's prospects in potentially winnable races this November.",
    "Dr. Mehmet Oz, a TV personality who lives in New Jersey, and David McCormick, a hedge fund executive who is married to former Trump adviser Dina Powell, are now trying to win over Trump's base in the crowded Pennsylvania GOP field.",
    "He told the Washington Examiner last month that \"virtually every GOP senator\" he had spoken to told him that \"they plan to do little more with the majority they are fighting to win this November than obstruct President Joe Biden.\"",
    "Trump, meanwhile, has prioritized a campaign of revenge against those \"RINOs\" (Republicans in name only) he sees as traitors over attempts to unseat Democrats, and is backing an array of far-right loyalists in Senate races.",
    "Hogan said he believed he could have beaten Van Hollen, but suggested that other factors were more important: \"Just because you can win a race doesn't mean that's the job you should do if your heart's not in it,\" he said.",
    "There has not been much polling in Ohio but a poll last fall showed Rep. Tim Ryan, the likely Democratic nominee, in a tight race with any of the likely Republican nominees in a state that Trump easily carried twice.",
    "Though the ex-president has held back his endorsement in many Republican primaries, he threw his early support behind election conspiracist Sean Parnell in Pennsylvania, where Republican Sen. Pat Toomey is retiring.",
    "The party clearly needs Trump's fired-up base of supporters to turn out to win key states but Trump's feuds with a growing number of prominent Republicans threaten to hamper the party's chances in general elections.",
    "Doug Ducey, who is leaving office thanks to term limits, to run against Democratic Sen. Mark Kelly, who took office after a 2020 special election to fill the remainder of the late Sen. John McCain's term.",
    "Only 20% of Georgia general election voters would be more likely to support a Trump-endorsed candidate, according to a recent Atlanta Journal-Constitution poll, while 49% said they would be less likely.",
    "Ducey would lead the Arizona Republican primary field if he chose to run, according to an OH Predictive Insights poll that found him leading Attorney General Mark Brnovich by a three-to-one margin.",
    "With Ducey out of the race, Brnovich leads the field with just 25% of the vote and nearly half of GOP primary voters undecided, apparently leaving Kelly in a strong position to retain his seat.",
    "\"I'm sure McConnell is concerned that we might nominate — in what should be a good year for Republicans — candidates who will lose the election,\" Republican strategist Doug Heye told USA Today.",
    "But Trump fired off an irate statement attacking Ducey, who refused to help the then-president try to overturn his loss in Arizona, and Ducey reiterated that he has no plans to run for Senate.",
    "McConnell's primary focus is on winning back majority control in the Senate, while Trump appears far more interested in settling personal scores and establishing hegemony within the GOP.",
    "Groups backing McCormick have attacked Oz as a \"Hollywood liberal\" and McCormick's campaign has suggested that Oz has \"dual loyalties\" because his show is syndicated in China.",
    "Oz's campaign has fired back with ads accusing McCormick of being \"China's friend, not ours\" (over past business dealings) and of being dishonest with voters.",
    "Vance had been highly critical of Trump in the past but made a concerted effort to endear himself to Trump fans in the increasingly red Buckeye State.",
    "But Vance's internal pollster recently warned that the candidate has seen a \"precipitous decline\" among likely primary voters, according to Politico.",
    "Polls had repeatedly shown Sununu, a popular Republican governor who has pushed back against Trump and the far right, with a narrow lead over Hassan.",
    "Trump donor Peter Thiel brought Vance to Mar-a-Lago to appeal to the ex-president in person, and Vance's public persona has become ever more Trumpy.",
    "Those two candidates and their associated PACs have spent more than $13 million flooding local TV with ads attacking one another, according to CNN.",
    "Mitt Romney, R-Utah, and Susan Collins, R-Maine, all tried to convince Hogan to jump into the race to no avail, according to the Washington Post.",
    "Parnell was forced drop out of the race in November after losing a child custody battle amid domestic abuse allegations from his estranged wife.",
    "Hogan is the third anti-Trump GOP governor to back away from a possible Senate bid despite a recruiting effort by McConnell and his allies.",
    "Vance, a longtime venture capitalist and the best-selling author of \"Hillbilly Elegy,\" to run for Senate in Ohio, where Republican Sen.",
    "Recent polls showed Hogan leading Van Hollen, in a traditionally Democratic state that President Biden carried by more than 30 points.",
    "\"A number of people said that they thought I could make a difference in the Senate and be a voice of common sense and moderation.",
    "\"I will not be a candidate for the U.S. Senate,\" Hogan, who has one year left in his term, said at a news conference on Tuesday.",
    "\"It bothered me that they were OK with that,\" he said, adding that he had been \"pretty close\" to running for Senate beforehand.",
    "Chris Sununu to challenge Sen. Maggie Hassan, D-N.H., who was elected in 2016 by just over 1,000 votes, a margin of 0.14%.",
    "With no prominent Republicans eager to challenge Van Hollen, the party is now once again scrambling to field a candidate.",
    "It may be much less helpful in the general election, especially after Democrats won all three statewide races in 2020.",
    "McConnell led a full-court blitz to recruit Hogan into the race against first-term Sen. Chris Van Hollen, D-Md.",
    "Trump's endorsement has been a boon so far for Walker, who is polling at 74% among Republican primary voters.",
    "But as I have repeatedly said, I don't aspire to be a United States senator, and that fact has not changed.\"",
    "But Sununu took GOP Senate leaders by surprise in announcing that he would run for re-election instead.",
    "\"McConnell is very aware of this and he clearly wants to avoid it; Donald Trump doesn't care about it.\"",
    "But Sununu said he wasn't interested in going to Washington simply to be a Republican obstructionist.",
    "Republicans already faced an uphill climb in a state Biden carried in 2020 and where Democratic Gov.",
    "Trump's efforts to recruit candidates into Senate races have not been entirely successful either.",
    "With many weeks to go until the May primary, intramural GOP attacks are expected to get worse.",
    "National Republican Senatorial Committee Chairman Rick Scott, R-Fla., along with Sens.",
    "I was certainly humbled by that, and it gave me and my family reason to consider it.",
    "Republican primary dynamics have also muddied McConnell's plans to win a majority.",
    "This trend has left McConnell and Republican leadership in a precarious spot.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "McConnell and his allies also tried to recruit New Hampshire Gov.",
    "McConnell and Scott both sought to recruit Arizona Gov.",
    "Read more on the shifting political landscape of 2022:",
    "A similar trend has played out in other key states.",
    "Subscribe to our morning newsletter, Crash Course.",
    "The GOP leader was instrumental in recruiting J.D.",
    "\"And I just didn't see myself being a U.S.",
    "Tom Wolf won election by 16 points.",
    "Rob Portman is retiring.",
    "Maryland Gov.",
    "senator.\""
  ]
}