{
  "id": 2825,
  "mediaId": 8491,
  "date": "2022-02-02",
  "headline": "Tim Ryan aide, others file for state representative",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/02/peterson-files-for-state-rep.jpg?w=1280",
  "link": "https://www.wkbn.com/news/elections/tim-ryan-aide-files-for-state-representative/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nadine Grimley",
  "authorUrl": "https://www.wkbn.com/author/nadine-grimley/",
  "termIds": [
    1819,
    2793,
    1590,
    6702,
    6703,
    6666,
    6115
  ],
  "sentences": [
    "Meanwhile, two Republicans, Rep. Mike Loychik who represents the 63rd House District and former Trumbull County GOP Chair Randy Law have filed petitions to run for the 65th House District.",
    "Both Bria Bennett of Warren and Vincent Peterson, II of Howland filed their paperwork with the Trumbull County Board of Elections this morning to run in the May Primary.",
    "“I’m very excited for the work that we’ll do between now and November to make sure we’re fighting for Trumbull County.",
    "At the end of the day, we need people in office that genuinely care about Trumbull County,” Peterson said.",
    "All candidates must file petitions by 4 p.m. if they want to run and some are coming in under the wire.",
    "Republican Nick Santucci of Howland has also filed to run in the May primary for the 64th District.",
    "They’re running to fill the seat currently held by Democratic Representative Mike O’Brien.",
    "Peterson, from Howland, has been a legislative aide for Congressman Tim Ryan since 2017.",
    "Knocking on doors, making phone calls and being out in the community,” she said.",
    "O’Brien can’t seek re-election for state representative due to term limits.",
    "Bennett said she plans to spend the next few months knocking on doors.",
    "WARREN, Ohio (WKBN) – Wednesday is deadline day for the May Primary.",
    "“I think it’s time we get some fresh ideas, some new things moving."
  ]
}