{
  "id": 2885,
  "mediaId": 2699,
  "date": "2022-02-01",
  "headline": "Fox News Anchor Just Won’t Accept That Hillary’s Not Running for President",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_719,w_1280,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1643741271/faulkner-focus_67_jpyoym",
  "link": "https://www.thedailybeast.com/fox-news-anchor-harris-faulkner-just-wont-accept-that-hillarys-not-running-for-president?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Justin Baragona",
  "authorUrl": "https://www.thedailybeast.com/author/justin-baragona",
  "termIds": [
    0
  ],
  "sentences": [
    "And while those close to Clinton have noted that she and former president Bill Clinton are itching to get back into the political spotlight, they’ve also said that “there’s no chance she runs for president again.” At the same time, she does reportedly see the wild speculation as a “gift” since “it allows her to gauge public reaction as she sets her sights on reemerging in lower-profile ways,” such as campaigning for others or advocating for policies.",
    "Fueling more speculation she may take another run at the White House in 2024.”\nAfter airing a montage of remarks from Republicans mocking Democrats for considering the former first lady in 2024 (even though speculation over a Clinton run has been largely a right-wing media invention), Faulkner then turned to ex-Trump flack Mercedes Schlapp to keep the chatter going.",
    "And quite frankly, when you have the current president, whose approval numbers are so low, you know, I think in Hillary’s mind and in her team’s mind, look, they’re like, ‘She probably has the most experienced background.’”\nTurning to former Democratic congressional candidate Suraj Patel, Faulkner wondered aloud if the 2024 presidential race could be 2016 redux.",
    "Weeks after Fox News devoted days of round-the-clock coverage to a Wall Street Journal column concern-trollingly urging Clinton to run as a “change candidate,” Faulkner kicked off yet another Hillary-watch segment by noting the 2016 Democratic nominee recently attended a Senate fundraiser for Rep. Tim Ryan (D-OH).",
    "Fox News anchor Harris Faulkner attempted to will another round of Hillary Clinton 2024 speculation into existence on Tuesday morning, even after a Democratic politician told her “full stop” the ex-secretary of state is not going to try for the White House again.",
    "He is the standard-bearer for the Democratic Party and the rest of it is just silly season.”\nFaulkner reacted by saying, “There are some Republicans cheering hearing you say that” before citing Biden’s and Vice President Kamala Harris’ low job approval ratings.",
    "Earlier this week, conservative media ran wild with theories that Biden would nominate Harris to the Supreme Court in order to rid her from the White House amid her decreasing popularity with the American public.",
    "“There was some talk that maybe former president Donald Trump might jump back in,” Faulkner said of the twice-impeached ex-president, who has all but confirmed he’s running again.",
    "Fox News wannabe Newsmax even went so far as to suggest Justice Stephen Breyer’s retirement was an intricate plot to install Clinton as president.",
    "She is always there,” Faulkner said about Clinton, who has been a relentless source of conservative media outrage for more than three decades.",
    "“Could she beat him?”\n“I can just tell you, full stop, that Secretary Clinton is not planning to run for president in 2024,” Patel shot back.",
    "I mean, it’s a silly thing.”\nUndeterred, the Fox News anchor asked Patel if Clinton could beat Trump in 2024.",
    "“We just saw recent polling that said Joe Biden would beat Donald Trump in 2024,” Patel patiently explained.",
    "“I was going to say, Harris, I think retirement is so boring, why not step back into the political fray?",
    "She’s not the first or last former politician to do fundraisers for her friends and for the party.",
    "“Hillary Clinton stepping back into the political spotlight,” the midday news host declared.",
    "The Clintons have a long history in Ohio and a personal friendship with Tim Ryan.",
    "“Everyone you showed is speculating for no reason,” Patel replied.",
    "“Look, Tim Ryan is an excellent Senate candidate in Ohio.",
    "“First off, she is not planning to run,” he answered.",
    "“So Joe Biden is going to be the nominee in 2024.",
    "“A lot has been said about Hillary Clinton.",
    "“How do you know?” Faulkner exclaimed.",
    "“We heard you,” the host interjected.",
    "I argue she never really went away.",
    "“When did she leave?"
  ]
}