{
  "id": 2988,
  "mediaId": 2919,
  "date": "2022-01-28",
  "headline": "Naval shipyards, thousands of jobs could be coming to Lorain and Lordstown",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/b14f855/2147483647/strip/true/crop/3578x1878+0+66/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F35%2Ff9%2Fa43e407e488799c97b53e84a70cd%2Fscreen-shot-2022-01-28-at-4.26.28%20PM.png",
  "link": "https://www.news5cleveland.com/news/local-news/oh-lorain/naval-shipyards-thousands-of-jobs-could-be-coming-to-lorain-and-lordstown",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jade Jarvis",
  "authorUrl": "https://www.news5cleveland.com/jade-jarvis",
  "termIds": [
    0
  ],
  "sentences": [
    "Congressman Tim Ryan released a statement to News 5 about the Lordstown-Lorain Project: “Congressman Ryan has been working with Bartlett Maritime Corporation for over a year on this project.",
    "He said Lorain County Community College has agreed to partner with unions to provide job training to attract young people to skilled trades and get some of the jobs that will be available.",
    "He said it's a multi-billion dollar project funded with both private and federal money and it would create 5,000 to 6,000 direct, permanent jobs, along with thousands more indirectly.",
    "And I'm sure some of those former ship builders, who probably are in heaven now, are smiling saying, ‘Alright, we're getting shipbuilding back in the city of Lorain,’” said Bradley.",
    "LORAIN, Ohio — The U.S. military, Biden administration, and other Washington officials are discussing a proposal that would bring naval shipyards to Lorain and Lordstown.",
    "A definitive location for the new facility in Lorain hasn’t been set, but officials are looking at a couple places, including the old Gypsum plant along the Black River.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "While the project remains under development, Ryan is supportive and hopeful it will come to fruition.”\nJade Jarvis is a reporter at News 5 Cleveland.",
    "I was around when American shipbuilding was still in Lorain, so I've kind of seen the devastation that took place after they pulled out.",
    "But before any construction happens, the Biden administration has to give the final OK. Bartlett doesn’t think that will be a problem.",
    "Anthony Gallo, president and CEO of the Lorain County Chamber of Commerce, said the potential investment in the area is massive.",
    "As for Lordstown, Bartlett said the city was chosen to be part of the project because of its location and community members.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "We're not quite in the end zone yet, but we're hopeful that we'll be under contract within a month,” said Bartlett.",
    "He admits he wasn’t sure anything would happen until the AFL-CIO signed off on the project Thursday in Washington.",
    "“The U.S. Navy does not have enough organic infrastructure to properly maintain the submarine force,” said Capt.",
    "“Some of the local unions have reached out to me already, they are very enthusiastic about this.",
    "He’s hoping to get a definitive answer soon and break ground in Lorain and Lordstown by October.",
    "Bartlett’s plan is to build enclosed production facilities in both cities to work on submarines.",
    "The Ohio Turnpike, Interstate 76, Interstate 80—it’s well connected to wherever you need to go.",
    "“Due to the unfortunate closure of multiple industrial plants along the north coast of Ohio.",
    "Plus it's got two airports within about an hour, two major airports, Cleveland, Pittsburgh.",
    "“I just got an email from the White House right before I talked to you,” said Bartlett.",
    "Just like Lorain, Lordstown has been very helpful and very supportive,” said Bartlett.",
    "So when you talk about those types of numbers, that's a huge investment,” said Gallo.",
    "And they will do anything in their power to help,” said Lorain mayor Jack Bradley.",
    "And then it's got the workforce and it's got a very cooperative local community.",
    "They’re also looking into land owned by Republic Steel along the river.",
    "The project could mean thousands of new jobs created in Northeast Ohio.",
    "Download now on your Apple device here, and your Android device here.",
    "He said the solution to the problem is the Lordstown-Lorain Project.",
    "“I grew up in Lorain, so I know how desperately the jobs are needed.",
    "He said Lorain would gain a minimum of 3,000 jobs from the project.",
    "Bradley said it could mean a shipbuilding renaissance for Lorain.",
    "Bartlett formed the company back in 2019 to address that issue.",
    "We've had a lot of folks that are unemployed or underemployed.",
    "Ed Bartlett, the founder of the Bartlett Maritime Corporation.",
    "“It's the availability of the rail, CSX and Norfolk Southern.",
    "“We had a very, very proud tradition of building ships here.",
    "Bradley has been working with Bartlett from the beginning.",
    "Skilled tradespeople are available here,” said Bartlett.",
    "Follow her on Facebook, Twitter, and Instagram.",
    "“We're in the football playoff season, right?",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "We're on the five-yard line."
  ]
}