{
  "id": 3035,
  "mediaId": 2695,
  "date": "2022-02-01",
  "headline": "Democratic Sen. Ben Ray Luján 'suffered a stroke in the cerebellum' but is expected to fully recover",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTIxNjgzNy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY4NjQ2ODUwNX0.j6lboONTul5eSZyynQkS29WgCSPqEfbKPhyKG3PJtKQ/img.jpg?width=1200&coordinates=0%2C171%2C0%2C0&height=600",
  "link": "https://www.theblaze.com/news/democratic-sen-ben-ray-lujan-had-a-stroke-but-is-expected-to-recover",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Nitzberg",
  "authorUrl": "https://www.theblaze.com/u/alexnitzberg",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/xtvU641wdq\n— Senator Ben Ray Luj\\u00e1n (@Senator Ben Ray Luj\\u00e1n) 1643749278\nThe 49-year-old Democrat has served as a senator since early January of 2021 — he previously served six terms in the U.S. House of Representatives.",
    "\"Praying for @SenatorLujan’s swift and complete recovery,\" tweeted GOP Sen. Marsha Blackburn of Tennessee\n\"Thinking of you, my friend, and sending my best wishes for a speedy and full recovery,\" Democratic Sen. Jeff Merkley of Oregon tweeted.",
    "U.S. Sen. Ben Ray Luján of New Mexico was hospitalized last week and it was discovered that he had suffered a stroke, according to a statement issued on Monday by Carlos Sanchez, the lawmaker's chief of staff.",
    "“He is currently being cared for at UNM Hospital, resting comfortably, and expected to make a full recovery,\" the statement noted.",
    "As part of his treatment plan, he subsequently underwent decompressive surgery to ease swelling.\"",
    "“Early Thursday morning, Senator Luján began experiencing dizziness and fatigue,\" Sanchez noted.",
    "Wishing you a full and speedy recovery, my friend,\" Democratic Rep. Tim Ryan of Ohio tweeted.",
    "\"Senator Luján was found to have suffered a stroke in the cerebellum, affecting his balance.",
    "\"Wishing @SenatorLujan a speedy recovery,\" tweeted Republican Sen. Steve Daines of Montana.",
    "Lawmakers on both sides of the political aisle expressed their well-wishes.",
    "The statement said that the lawmaker is expected to recover.",
    "\"Andrea and I are praying for you, @SenatorLujan."
  ]
}