{
  "id": 3050,
  "mediaId": 2658,
  "date": "2022-01-28",
  "headline": "The inflation signal keeping the Fed on edge",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/morning-money/2022/01/28/the-inflation-signal-keeping-the-fed-on-edge-00003117",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "SEC Chair Gary Gensler on Thursday announced new tweaks to the proposal, which would require SEC-registered companies to disclose how executive compensation reflects their underlying financial performance.”\nIRS BACKLOG DELAYED EMERGENCY RELIEF FOR BUSINESSES — Our Aaron Lorenzo: “Emergency tax refunds meant to help businesses weather pandemic woes were significantly delayed because their applications got ensnared in the IRS paperwork backlog, according to a new Government Accountability Office report.",
    "“The group, dubbed GMI PAC, said it has already attracted $5.3 million in contributions that it will use to back candidates and members of Congress ‘who work to give consumers and innovators the opportunity to build and use next-generation technologies and services here in America.’”\nBEHNAM SIGNALS CFTC WON’T RUSH TO REWRITE RULES FOR CRYPTO — Sam again: “CFTC Chair Rostin Behnam said Thursday his agency should tread carefully before drafting new rules or policy changes aimed at digital assets.",
    "And, for the first time in 20 years, our economy grew faster than China’s.”\nU.S. CHAMBER ISSUES RARE WARNING ON RASKIN — Reuters’ Andrea Shalal: “The U.S. Chamber of Commerce on Thursday sent an unprecedented letter to lawmakers raising concerns about Sarah Bloom Raskin, President Joe Biden's nominee as the Federal Reserve's vice chair for supervision, and her calls for federal regulators to transition financing away from the fossil fuel industry.",
    "Driving the Day\nFourth-quarter employment cost index, and December consumer spending and PCE inflation data released at 8:30 a.m. … University of Michigan releases consumer sentiment data at 10 a.m.\nCRYPTO SUPER PAC PLANS TO SPEND $20M — Our Sam Sutton: “A group of crypto financiers said Friday it's launching a super PAC that aims to spend more than $20 million to support congressional candidates ahead of the November elections.",
    "But don’t sleep on the lesser-known employment cost index, which also comes out this morning and will have increasing importance for the path of Fed policy in 2022\nIf you read Morning Money religiously, or you’re just a Fed nerd, you know that Chair Jay Powell has flagged this somewhat obscure data point as something officials are keeping an eye on as they assess improvements in the labor market.",
    "And, in the interim, those who leaned on the policy to navigate the pandemic and lift their children out of poverty are struggling to adjust both their perceptions of political leaders and the day-to-day chaos of their own lives.”\nJobs Report\nKristen Hutchens has been promoted to director of policy and government affairs at the North American Securities Administrators Association.",
    "But growth recently has run into obstacles that could lead to more modest growth this year, economists say.”\n— Biden statement: “The GDP numbers for my first year show that we are finally building an American economy for the 21st Century, with the fastest economic growth in nearly four decades, along with the greatest year of job growth in American history.",
    "‘This requires, obviously, conversations with stakeholders.’”\n— Meanwhile: Reps. Patrick McHenry (R-N.C.), Tim Ryan (D-Ohio) and nine other lawmakers on Thursday urged Treasury Secretary Janet Yellen to set a narrow lens when determining what digital asset businesses will be subject to new IRS reporting rules from last year's bipartisan infrastructure law.",
    "U.S. ECONOMY GROWS AS FOURTH-QUARTER GDP SHOWS STRONGEST YEAR IN DECADES — WSJ’s Josh Mitchell: “The U.S. economy grew rapidly in the fourth quarter of last year, advancing to a 6.9% annual rate, capping the strongest year of growth in nearly four decades as the country rebounded quickly from the pandemic-induced recession.",
    "— Bloomberg’s Mark Gurman\nThe U.N. chief urged nations Wednesday to greatly boost humanitarian aid for millions of Afghans living in “a frozen hell” and release nearly $9 billion in frozen assets to pull Afghanistan’s economy back from the brink of a collapse that could set off a mass exodus of people fleeing the country.",
    "— WSJ’s Gregory Zuckerman, Gunjan Banerji and Michael Wursthorn\nThe UK and EU are preparing to hit new Russian gas projects with sanctions if the Kremlin orders an attack on Ukraine, the first time Europe has weighed targeting a sector it relies on for 40 percent of its gas imports.",
    "“It would signal perhaps something more permanent, and it would be that wage-price spiral dynamic that Powell and others have talked about.”\nWe’re not at that stage yet, Bostjancic said, but we’re starting to see wage gains broaden beyond workers near the bottom of the income scale.",
    "“The U.S. industry lobby group urged leaders of the Senate Banking Committee to question Raskin about those statements and her criticism of the Fed for allowing oil and gas companies to access emergency pandemic funds, among other issues.”\nCTC RECIPIENTS WONDERING: WTF HAPPENED?",
    "The holdup required the IRS to shell out tens of millions of dollars in interest on top of the refunds.”\n— GAO also said the Treasury Department lacks the ability to identify and recover fraudulent payments under its $46.5 billion rental aid program, our Katy O’Donnell reported.",
    "The inflation signal keeping the Fed on edge\nBy KATE DAVIDSON\n01/28/2022 08:00 AM EST\nPresented by\nEditor’s Note: Morning Money is a free version of POLITICO Pro Financial Services morning newsletter, which is delivered to our subscribers each morning at 5:15 a.m.",
    "The index, a quarterly report that details total employee compensation and the cost of labor for employers, jumped in the third quarter, and was one factor that prompted central bank officials to pivot toward tighter policy late last year, Powell said.",
    "— Crypto in NY: Environmental advocates and key state lawmakers are pushing again this year for a three-year moratorium on permits for power plants that burn fossil fuels to mine Bitcoin, a measure that would be the first of its kind in the nation.",
    "— FT’s Henry Foy, Sam Fleming, David Sheppard and Laura Hughes\nApple Inc. rallied in late trading after quarterly revenue sailed past Wall Street estimates, marking a victory against a supply-chain crunch fueled by the pandemic and chip shortages.",
    "— AP’s Edith Lederer\nFollow us on Twitter\nMark McQuillian @mcqdc\nKate Davidson @KateDAvidson\nAubree Eliza Weaver @aubreeeweaver\nBen White @morningmoneyben\nVictoria Guida @vtg2\nKaty O'Donnell @katyodonnell_\nZachary Warmbrodt @Zachary\nFollow Us",
    "The backers include a top executive at the digital currency trading platform FTX, as well as SkyBridge Capital, the hedge fund led by former Trump communications director Anthony Scaramucci, who is trying to start a Bitcoin investment fund.",
    "‘I’d hate to be viewed as a fourth branch of government,’ Behnam said during a virtual event hosted by the American Bar Association, adding that it would be a ‘balancing act.’\n‘This requires conversations with Congress,’ he said.",
    "“If real wages rise faster than real productivity, then unit labor costs rise, and then that sets off that dynamic where companies are paying more for workers, and it’s starting to eat into their profit margins,” Bostjancic said.",
    "Fly Around\nThe end of the Fed’s easy-money era is prompting investors to reverse course on two years of investing strategies, kicking off this month’s broad market rout, the worst selloff since the early days of the pandemic.",
    "Warren and seven other congressional Democrats on Thursday sent letters to several of the largest domestic cryptocurrency miners demanding more information about their power consumption and environmental impact.",
    "That might help explain why consumer sentiment readings — and the president’s approval ratings on the economy — are so low, even while workers' paychecks are growing and economic growth is surging.",
    "So far, Powell has emphasized that inflation has been driven largely by factors relating to the pandemic — stronger demand for goods has collided with supply constraints, pushing up prices.",
    "SEC REVISITS EXECUTIVE PAY RULE — From Sam: “The SEC is reopening the comment period on an unfinished executive pay rule that was mandated under the Dodd-Frank law more than a decade ago.",
    "— Our Adam Cancryn: “Lawmakers are currently scrambling to try to find a way to extend the expanded child tax credit, with the Biden administration stressing that it remains a priority.",
    "Powell said as much at his December press conference:\n“Wages have also risen briskly, but, thus far, wage growth has not been a major contributor to the elevated levels of inflation.",
    "But he omitted the words, “but, thus far, wage growth has not been a major contributor to the elevated levels of inflation.”\nWhy could this become a bigger problem now?",
    "“If that took hold, it would actually be more problematic than the supply chain disruption,” said Kathy Bostjancic, chief U.S. financial economist for Oxford Economics.",
    "is drawing more Democrats into her crackdown on Bitcoin mining companies, which critics say contribute to climate change because of their growing electricity usage.",
    "Some businesses that may have raised wages last year but resisted raising prices, in hopes inflation would soon ease, could start to pass that on to consumers.",
    "“If it’s felt in the second half, does this really work its way into consumer expectations before the mid-terms?”\nIT’S FRIDAY — Four weeks down, 48 more to go.",
    "Send us your best snow pics, plus tips, ideas, feedback, at kdavidson@politico.com, aweaver@politico.com, or on Twitter @katedavidson or @aubreeeweaver.",
    "We are attentive to the risks that persistent real wage growth in excess of productivity [growth] could put upward pressure on inflation,” he said then.",
    "If wages can continue rising while inflation declines, that might turn attitudes around, said Tim Duy, chief U.S. economist at SGH Macro Advisors.",
    "The Fed’s preferred inflation gauge, the personal consumption expenditures index, is due out this morning and it’s expected to be another doozy.",
    "Prior to joining the group in May, she worked at the Municipal Securities Rulemaking Board and was a staffer on the Senate Banking Committee.",
    "Many employers go through salary renegotiations at the start of the year and could feel pressure to lift wages amid persistent inflation.",
    "“The administration’s problem I think is, to the extent that happens, it’s not going to be felt in the first half of the year,” Duy said.",
    "The longer that prices stay elevated, the greater the risk that higher inflation will become embedded in people’s expectations.",
    "The POLITICO Pro platform combines the news you need with tools you can use to take action on the day’s biggest stories.",
    "Bostjancic looked at the past eight quarters, or two years, to try to smooth out some of the volatility in the data.",
    "During that time, they’ve risen at a 4.9 percent annualized rate, the fastest since the first quarter of 1983.",
    "And that’s where you get that virtual reinforcing spiral on the upside.”\nWhere are unit labor costs now?",
    "Hope you’ve got the salt ready and the snowblower gassed up for this weekend’s bomb cyclone.",
    "This week, he repeated nearly the same passage in his opening statement.",
    "But there is no indication that an agreement is coming soon, if at all.",
    "“One way to offset that is to pass along higher prices to consumers.",
    "One place that could start showing up is in higher wages.",
    "Yes, but not if they’re being eaten up by inflation.",
    "And just seven until the (official) start of spring.",
    "I’m looking at you, New Yorkers and New Englanders.",
    "— And: Sen. Elizabeth Warren (D-Mass.)",
    "Act on the news with POLITICO Pro.",
    "Aren’t wage gains a good thing?",
    "Why does it matter now?"
  ]
}