{
  "id": 3136,
  "mediaId": 2810,
  "date": "2022-01-28",
  "headline": "A Transformative Green New Deal Requires Inclusive Manufacturing",
  "image": "https://www.thenation.com/wp-content/uploads/2022/01/quality-control-engineer-gty_img.jpg",
  "link": "https://www.thenation.com/article/politics/gnd-inclusive-manufacturing/",
  "mediaOutlet": "The Beat",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carl Davidson",
  "authorUrl": "https://www.thenation.com/authors/carl-davidson/",
  "termIds": [
    0
  ],
  "sentences": [
    "Instead of complaining about neoliberalism and struggling to make it less onerous, we must work to replace speculative and low-road capital (real estate, finance, insurance) with productive and high-road investments in advanced manufacturing: enterprises committed to technical skill career paths, continuous skill development, wages and benefits that provide a secure future, and democratic relations between owners, managers, workers, and local communities.",
    "While many environmentalists dismiss manufacturing as irrelevant or anti-green, the climate crisis still requires a Green New Deal to transform our energy sources into renewables, design and build new infrastructure, and manufacture hardware—including wind turbines; solar arrays; wave generators; systems of locks, dams, trains, and rails to transport components;a new Smart Grid; and EV charging stations.",
    "Beyond traditional set-asides for women and minority-owned businesses, inclusion is accomplished through public policy that identifies and prioritizes disadvantaged communities for investment in advanced manufacturing and provides training, financing, and strategic support to ensure success of individuals as well as high-road enterprises.",
    "The bill creates the opportunity for dramatic increases in the number of companies owned by their employees and by Black and Latino entrepreneurs by funding programs and policies that lead to greater inclusion of workers, women, and people of color in all aspects of manufacturing, particularly in ownership.",
    "The bill calls for massive investment throughout the US manufacturing ecosystem and addresses the inadequacy of many of our public schools (a result of decades of underfunding) along with the currently prohibitive costs of post-secondary education and advanced technical skills training.",
    "The designers of the legislation—a core team of progressive electoral leaders; advanced manufacturing advocates; trade union veterans; community, faith, and education leaders; and solidarity economy thinkers—have launched the Manufacturing Renaissance Campaign.",
    "Only a Green New Deal that demands a different approach to power relations in the economy will create new wealth for the working class and people of color, shift control of production, and move toward a more equitable, inclusive, and sustainable future.",
    "With adequate funding and support, worker-cooperative ownership can succeed by learning from the Union Coop model designed by the United Steelworkers and from the example of the longtime achievements of the Mondragon coops in the Basque region of Spain.",
    "HR 5124 will foster a diverse workforce with the advanced skills and knowledge to design, manufacture, build, and maintain new energy systems and their components and the lighter eco-footprint production and transportation systems of the future.",
    "Public investment in advanced manufacturing that is democratic, inclusive, and well-funded can offer solutions for a just transition and the foundation for more significant transformations, building popular unity and momentum for change.",
    "Inclusion in a manufacturing renaissance creates opportunities for the working class and people of color to develop the technical skills, knowledge, and values to guide a revolutionary change in the social relations of production.",
    "Without fundamental rethinking of how such a transformational GND will work, however, the default potential outcome is a system that, while it may be less damaging to the environment, reinforces racial and economic inequality.",
    "We must also aim to shift control of green production toward workers and entrepreneurs who share our commitment to a truly sustainable and inclusive society and away from a “greener” continuation of the status quo.",
    "We must work together to form broad coalitions of labor, government, community, schools, and high-road entrepreneurs to gain local control of the means of production—both old and new enterprises.",
    "Advanced manufacturing can build a broad-based working class with much higher incomes and create social capital at work, provide a decent standard of living, and be an engine for job growth.",
    "We live in the economic wreckage wrought by unproductive owners and speculative investors who accumulate profits but do not invest in the equitable and sustainable future we need.",
    "We must also take on the equally crucial challenge of intolerable wealth accumulation and income inequality through more wealth creation as well as more equitable distribution.",
    "Currently, US industry and its workforce lack the capacity to produce many of these components—let alone install and maintain them (all potentially high-wage, long-term jobs).",
    "For a more equitable, inclusive, and sustainable future, we need to manufacture new equipment and products with new supply chains, new skills, and new relations of production.",
    "Environmentalists and labor unionists talk about a “just transition” to new jobs and a new economy, but without a concrete plan of how to accomplish either.",
    "Workers or minority entrepreneurs can take over hundreds of thousands of viable inner-city and rural manufacturing firms whose white owners are retiring.",
    "Progressives who care about the climate, democracy, economic justice, and sustainability need to incorporate a new economic vision into their projects.",
    "The labor movement primarily focuses on its own growth and bargaining for wages and benefits within the “management’s rights” framework.",
    "The progressive movement needs a distinctive industrial policy: a manufacturing renaissance in addition to a Green New Deal (GND).",
    "Inclusive capital strategies are critical for achieving the goals of both environmentalists and the labor movement (and others).",
    "Green New Deal advocates need to be thinking deeply about how the economy actually functions and whose interests it serves.",
    "It routinely does not contend for power over how capital is invested or what technology, products, and processes are used.",
    "Such a coalition can shape government policy that supports intervention and provides effective regulation and incentives.",
    "A vital next step is getting 100 or more members of Congress to sign on to the bill and a parallel process in the Senate.",
    "Manufacturing is the only economic sector that can generate new wealth for communities currently shut out of access.",
    "We must insist on inclusion as a priority in a renaissance of manufacturing and transformation of the economy.",
    "When workers are owners and stakeholders, neoliberal capitalists will no longer maintain unfettered command.",
    "The new HR 5124 introduced by Representative Jan Schakowsky (D-Ill.) speaks directly to this issue.",
    "A truly transformative Green New Deal requires a new paradigm of inclusive advanced manufacturing.",
    "), Danny Davis (D-Ill.), Marie Newman (D-Ill.), Tim Ryan (D-Ohio), and Brendan Boyle (D-Penn.).",
    "Such a radical shift in our thinking requires a deep look into our political economy.",
    "We will not have a sustainable society without a strong manufacturing foundation.",
    "High-road, advanced manufacturing is fundamental to addressing progressive goals.",
    "We can drive strategic direction through intervention in particular companies.",
    "Neoliberal assumptions and institutions would remain in control of our future.",
    "Subscribe to The Nation\nSubscribe now for as little as $2 a month!",
    "Cosponsors include Ro Khanna (D-Calif.), Michael Doyle (D-Penn.",
    "We need to bring management rights into bargaining."
  ]
}