{
  "id": 3213,
  "mediaId": 2790,
  "date": "2022-02-01",
  "headline": "Democrat Tim Ryan faces long odds running for Senate in Trump's Ohio",
  "image": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400",
  "link": "https://www.npr.org/2022/02/01/1077371562/democrat-tim-ryan-faces-long-odds-running-for-senate-in-trumps-ohio",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Don Gonyea",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "RYAN: And we've had a lot of economic policy decisions that have been made for the last 30 or 40 years that have wrecked the middle class - the trade deals, the outsourcing, then automation, all of these things.",
    "(SOUNDBITE OF HAMMERS POUNDING)\nGONYEA: Tim Ryan grew up in the Youngstown area, so union halls are a second home to him, but he can't take support in a place like this for granted.",
    "Next stop is a company that makes clay roof tiles, then to the river town of McConnelsville for a small meet-and-greet and late lunch at the Chatterbox Tavern.",
    "MCKINNEY: Going back and counting the votes, I think that everybody did their best to make sure that it was fair and all of the votes were counted correctly.",
    "GONYEA: She did vote for Donald Trump, but she says she does not like Trump's obsession with the 2020 result, nor does she believe the election was stolen.",
    "On the Democratic side, the leading candidate is Congressman Tim Ryan, who's aiming to win over working-class voters that Trump himself relied on.",
    "That's because Joe Burrow, who played high school ball about an hour from here, is the quarterback for the Super Bowl-bound Cincinnati Bengals.",
    "She says she's a Republican, but...\nLYNSI MCKINNEY: I am going to vote for whoever I believe is going to do right by my family and my friends.",
    "RYAN: Sherrod Brown is an economic Ohio Democrat, and so am I.\nGONYEA: Ryan stresses he's ready to pick fights with anyone, even Democrats.",
    "He also makes it clear that despite his strong support for President Biden's economic agenda, he won't be seeking Biden's help campaigning.",
    "GONYEA: But she still likes Trump, and if he endorses one of the Republicans running for Senate in Ohio, that would be a plus for her.",
    "GONYEA: There was talk here of how stretched basic city services are and how getting broadband would give this town a boost.",
    "Democratic Congressman Tim Ryan is trying to flip a Senate seat in a state that's turned more Republican in recent years.",
    "Hopefully, he can go ahead and push some of that things (ph) forward and keep us working and, you know, keep us happy.",
    "Three-term Senator Sherrod Brown is a Democrat who's found continued success in Ohio even as the state turns more red.",
    "But, you know, some guys I work with will never hear his name and will never get to hear him talk to a crowd.",
    "The center tables were already filled with local citizens, all Democrats in a county Trump carried 3 to 1.",
    "There is evidence in his longshot bid to challenge Nancy Pelosi as House Democratic leader back in 2016.",
    "Next, another 60-mile trek to the city of Marietta and the offices of the local Democratic Party.",
    "It's a reminder of how big a task Tim Ryan has in trying to win votes in these Trump strongholds.",
    "It's voters like this that Ryan needs, and it's why he spends so much time talking about jobs.",
    "Visit our website terms of use and permissions pages at www.npr.org for further information.",
    "GONYEA: The next morning, Ryan walked into a coffee shop on the Ohio River in Meigs County.",
    "A Democrat, he said he wished his Republican coworkers would hear what Ryan's got to say.",
    "A union equipment operator named Heath Stevens was in the back nodding in agreement.",
    "The thing about him, though - he can get sacked five times, and he's still standing.",
    "RYAN: It always gets back to broadband infrastructure, skills, education, you know?",
    "This text may not be in its final form and may be updated or revised in the future.",
    "The GOP field is crowded with candidates in the mold of former President Trump.",
    "He backed Joe Biden but says he did consider voting Trump for economic reasons.",
    "HEATH STEVENS: It's hard for me to see why some people wouldn't vote for him.",
    "GONYEA: Ryan said that's why he's in places where Democrats don't usually go.",
    "The first one here, just outside Columbus, is at the Carpenters Union Hall.",
    "There is a template for the kind of jobs-focused campaign Ryan is running.",
    "He's aiming to win over working-class voters that Trump himself relied on.",
    "But Ryan faces an uphill battle in a state that's become more Republican.",
    "GONYEA: Thirty-three-year-old carpenter Jamel Kendrick was in the group.",
    "She told me they talked about the economy, and she liked what she heard.",
    "GONYEA: Ryan has a long chat with a woman seated over in the corner.",
    "NPR transcripts are created on a rush deadline by an NPR contractor.",
    "The authoritative record of NPR’s programming is the audio record.",
    "Ryan chats up a group of carpenter apprentices, first about jobs.",
    "TAMARA KEITH, HOST:\nThere's a key Senate race in Ohio this year.",
    "(SOUNDBITE OF JELLIS AND SUBSETS' \"KYOTO\")\nCopyright © 2022 NPR.",
    "Her name is Lynsi McKinney, a stay-at-home mom with three kids.",
    "GONYEA: And he said politicians of both parties were to blame.",
    "Ryan travels in a maroon GMC pickup truck with a few aides.",
    "But almost immediately, the conversation turns to football.",
    "GONYEA: The talk goes back and forth, football and jobs.",
    "I don't need, you know, someone to come campaign for me.",
    "RYAN: This is a mushroom burger with hot peppers on it.",
    "RYAN: Well, I'll let you guys get back - appreciate it.",
    "DON GONYEA, BYLINE: It's 9 in the morning, 22 degrees.",
    "I just want to make sure that the work just stays.",
    "UNIDENTIFIED PERSON: I'm out there at Facebook.",
    "UNIDENTIFIED PERSON: He can still win a game.",
    "Columbus is doing a lot of growing right now.",
    "JAMEL KENDRICK: We're getting plenty of work.",
    "He admits he doesn't know much about Ryan.",
    "GONYEA: Kendrick is an independent voter.",
    "He's got a busy day ahead - five stops.",
    "I'm following Congressman Tim Ryan.",
    "Accuracy and availability may vary.",
    "I don't need anyone to help me.",
    "Mushroom, provolone - oh, my.",
    "It was packed as Ryan spoke.",
    "RYAN: I don't need proxies.",
    "Where are you guys working?",
    "Maybe with Mr. - I'm sorry.",
    "It's frustrating, he says.",
    "I can handle this myself.",
    "TIM RYAN: Long way to go.",
    "NPR's Don Gonyea reports.",
    "RYAN: It's unbelievable.",
    "They're banana peppers.",
    "Well, they're not hot.",
    "The talk was familiar.",
    "Don Gonyea, NPR News.",
    "All rights reserved.",
    "KENDRICK: Mr. Ryan.",
    "You guys take care.",
    "What was his name?",
    "And nobody cared.",
    "Let's go inside.",
    "So I don't know.",
    "GONYEA: Ryan.",
    "Nobody cared.",
    "Thank you.",
    "Jesus."
  ]
}