{
  "id": 3319,
  "mediaId": 2537,
  "date": "2022-01-31",
  "headline": "Tired of receiving political text messages? Here's why you're getting so many",
  "image": "https://www.gannett-cdn.com/presto/2019/03/23/PCIN/035d8e58-28cd-4be0-b0ed-a8715d22b06f-MUR1Brd_12-12-2018_DNJ_1_A002__2018_12_11_IMG_texting_cell_phone_1_1_T3NJEAD1_L1317126673_IMG_texting_cell_phone_1_1_T3NJEAD1.jpg?crop=533,300,x0,y71&width=533&height=300&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/politics/elections/2022/01/31/tired-political-text-messages-do-not-call-list-wont-help/6613616001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    0
  ],
  "sentences": [
    "Charities, political groups and debt collectors are exempt from the Federal Trade Commission's robocall-blocking list, said Andy Geronimo, who is director of the First Amendment Clinic at Case Western Reserve University School of Law.",
    "\"In the long history of how the First Amendment was developed, part of the reason the First Amendment is in the Constitution in the first place is so that we can have informed discourse about our politics,\" Geronimo said.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "The Federal Communications Commission also prohibits automatic dialing systems that could allow campaigns to send unlimited text messages or phone calls without recipients' prior consent.",
    "Americans received an estimated 18.5 billion political text messages in 2020, according to RoboKiller's Political Message Insights, which also markets a cellphone app to block robocalls.",
    "But there's a loophole: a slew of campaign volunteers can text unsolicited information to unsuspecting Ohioans about when to vote, who to vote for or how the race is shaping up.",
    "That means you could be working on a Wordle puzzle when your cellphone dings with: \"Never-Trumper JD Vance looks down on Ohioans and despises Trump supporters.\"",
    "Ohio's voter rolls, which are public records, do not include phone numbers but do include addresses and details like whether you voted in recent elections.",
    "These text messages are permitted because political speech is sacrosanct under the First Amendment and the government is loath to limit it, Geronimo said.",
    "\"Insofar as politicians or issues are interested in garnering support, they would probably be amenable to removing you from their list,\" Geronimo said.",
    "And it might be easier to recruit volunteers to send a bevy of text messages than to knock on strangers' doors during Ohio's coldest months.",
    "How to stop political text message\nThe Do Not Call Registry won't protect you from political text messages, but there are alternatives.",
    "Campaigns can collect phone numbers that individuals volunteer on politicians' websites or purchase them from commercial data brokers.",
    "Or you could be scrolling through TikTok to see if a pug will forecast a lazy day and be hit with: \"It's Tim Ryan.",
    "\"It's easier to say, 'I'll take these 50 names and text them in the hour of downtime that I have,'\" Geronimo said.",
    "Called peer-to-peer texting, the practice complies with all federal rules and is becoming increasingly popular.",
    "Research indicates that a text message reminder to vote can increase turnout, especially among younger voters.",
    "But there's a less-technological option: Simply respond to the text message with a request to stop.",
    "But they are becoming more prevalent as an easy and effective tool to connect with likely voters.",
    "That's because the National Do Not Call Registry does not apply to political text messages.",
    "The rise of the political text message\nText messages aren't a new political campaign tool.",
    "Former President Barack Obama announced his running mate via text message in August 2008.",
    "But you can't escape the latest Ohio Senate polling numbers delivered to your cellphone.",
    "This doesn't block the messages entirely but does make them easier to delete and ignore.",
    "Because these messages must be sent by a real person, they are likely to respond.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "On Android devices, you can find this option under \"Message\" and \"Settings.\"",
    "If we win in Ohio, Democrats are virtually guaranteed to expand the Senate.\"",
    "Cellphones often have options to filter messages from unknown senders.",
    "You can opt out of scam text messages pitching the latest fitness fad.",
    "Under\n\"Spam message settings\" you can check \"Block unknown senders.\"",
    "On the iPhone, the function is under \"Settings\" and \"Messages.\"",
    "You can block that annoying relative's emoji-laden message.",
    "You can swipe to \"Filter Unknown Senders.\"",
    "After all, they still want your vote."
  ]
}