{
  "id": 3329,
  "mediaId": 2658,
  "date": "2022-02-04",
  "headline": "Judges take over drawing dozens of House districts — and throw Dems a bone",
  "image": "https://static.politico.com/99/8f/af2527c3453e9ff25a921c71edd5/ap22022618557562.jpg",
  "link": "https://www.politico.com/news/2022/02/04/judges-take-over-redistricting-states-00005500",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Looking at the makeup of our North Carolina Supreme Court, we have a very, a very good chance to have a decision made that particularly extreme, intentional partisan gerrymandering suppresses the ability of voters to have their votes count,” said Rep. Kathy Manning, a Democrat who won her Greensboro-based district in 2020 after a lower court ruled Republicans had unfairly cracked it.",
    "Courts are also likely to determine the contours of the maps in Louisiana, where the Democratic governor and Republican legislature are barreling toward a deadlock; Wisconsin, where a similar partisan split has already resulted in a stalemate; and Minnesota, which is one of only two state legislatures in the country where a different party controls the upper and lower chambers.",
    "Minnesota just barely held onto its eight congressional seats in reapportionment and the biggest question is how they will alter the swing-seat held by Democratic Rep. Angie Craig\nThe Wisconsin state Supreme Court already decided in November that it would make as little changes as possible to the current map, drawn by Republicans in 2011.",
    "We’re not taking anything for granted but we’re doing a hell of a lot better than I thought we would.”\nDemocrats notched a huge win this week in Pennsylvania when the state Supreme Court agreed to take control of the fraught congressional redistricting process there, which had been in the hands of a pro-Trump lower court judge.",
    "There’s no precedent for what’s happening in several of these states.”\nIn Pennsylvania, the commonwealth court justice assigned to the case was the same judge who handed former President Donald Trump a rare victory in his 2020 battle to have his electoral loss overturned — something she brags about on her campaign website.",
    "“This time they just punted.”\nThe liberal-leaning state Supreme Court helped Democrats claim the gavel in 2018 when it ruled the GOP-drawn congressional map was an illegal partisan gerrymander, ordering a redraw that saw the delegation shift from a 13-5 Republican advantage to an even split.",
    "“Look at the teamwork on the part of the DCCC, the National Democratic Redistricting Committee under Eric Holder’s leadership and a lot of our allies and partners,” said Rep. Sean Patrick Maloney (D-N.Y.), the chair of the Democratic Congressional Campaign Committee.",
    "Democrats are perhaps most optimistic about netting seats in North Carolina, where a liberal majority on the state Supreme Court heard opening arguments Wednesday against a Republican congressional map that could relegate Democrats to just three of the 14 seats.",
    "Most states have finished their maps already, but state and federal courts will direct the drawing of some 75 congressional districts in at least seven states in the coming months, marking a new phase in the process before the first 2022 primaries begin.",
    "So far, the decisions have validated the party’s state-by-state legal strategy and, critically, offered a surprising reprieve from several Republican gerrymandering attempts before a single election could be held under the new lines.",
    "In the next few weeks alone, North Carolina, Ohio and Pennsylvania courts are likely to impose new maps blocking Republican legislators’ attempts to relegate Democrats to small slivers of those congressional delegations.",
    "Ron DeSantis asked the state’s high court to preemptively weigh in on whether the legislature could eliminate a heavily Black district in North Florida, a request that brought the redistricting process there to a halt.",
    "Legislators in St. Paul have until mid-February to agree on a proposal and a five-judge panel is already preparing its own maps in the likely event that the GOP state Senate and the Democratic state house cannot agree.",
    "“It could really be huge,” Rep. Tim Ryan (D-Ohio) said of the Ohio Supreme Court’s decision to strike down a Republican-drawn map that could have left Democrats with just two of the state’s 15 seats.",
    "The case, one of many where the National Democratic Redistricting Committee has gotten involved, is a significant decision that could pave the way for more Democratic seats in other southern states.",
    "I’m refreshing my screen, trying not to crash the court website,” Rep. Mary Gay Scanlon (D-Pa.) said Wednesday, less than an hour before the justices announced they would take over the case.",
    "Meanwhile, federal judges last month struck down Alabama’s congressional lines and ordered Republican lawmakers to craft a new map that includes two heavily Black districts instead of one.",
    "In Ohio, the state Supreme Court, narrowly controlled by a GOP majority, struck down the congressional map in mid-January, giving the Republican legislature a month to alter its plan.",
    "| Julie Carr Smyth/AP Photo\nBy Ally Mutnick\n 02/04/2022 04:30 AM EST\nUpdated: 02/04/2022 10:35 AM EST\nThe redistricting wars are shifting into a new arena: the courtroom.",
    "But because those maps largely maintain the status quo, the seat held by retiring Rep. Ron Kind (D-Wis.) is likely to remain a top-tier pickup opportunity for the GOP.",
    "Members of the Ohio Senate Government Oversight Committee hear testimony on a new map of state congressional districts on Nov. 16 at the Statehouse in Columbus, Ohio.",
    "In an 82-page ruling, the justices said that mapmakers unduly split Summit, Cuyahoga and Hamilton counties — home to Akron, Cleveland and Cincinnati, respectively.",
    "“Republicans need to take supreme State Supreme Court races seriously,” said Adam Kincaid, the executive director of the National Republican Redistricting Trust.",
    "“Our state legislature is useless because they have failed to do their job the last two cycles, which is to draw a fair and constitutional map,” she said.",
    "But she’s continued to raise money and prepare to seek reelection because she believes the court will honor communities of interest in the Triad region.",
    "Taken together, the court interventions have eased Democratic fears about redistricting as they sweat over a tough midterm political environment.",
    "And the court was always set to play an outsize role in the remap because the Republican-controlled state legislature and Democratic Gov.",
    "Minnesota and Wisconsin — two states with divided government — have long prepared for the courts to dominate their redistricting process.",
    "The chief justice, Maureen O’Connor, a moderate Republican, sided with three Democrats, all of whom were elected in the last few years.",
    "Democrats have made the election of state Supreme Court a top priority recently, with an eye on influencing the 2021 redistricting.",
    "“We need conservative judges who will actually apply the laws as written versus these liberal judges who will just create new law.",
    "But Democrats panicked when their liberal-leaning state Supreme Court declined to claim jurisdiction over the case last month.",
    "She will get the first pass at selecting a new congressional map, but the state Supreme Court will weigh in later this month.",
    "“I mean, it could make the difference down here,” he said, referring to Democrats’ fight to keep their razor-thin majority.",
    "Republicans’ state legislative campaign arm ran ads urging Justice Sam Ervin, a potential swing vote, to recuse himself.",
    "Pennsylvania and its 17 congressional districts will be pivotal in determining the House majority in 2022.",
    "Republicans are backing a new suit just filed in New York to block the state’s Democratic gerrymander.",
    "If they miss that deadline, a bipartisan commission will get a chance at the lines.",
    "The new GOP proposal would split the city again, leaving Manning nowhere to run.",
    "“I’m really optimistic that I’m going to get a united Greensboro,” she said.",
    "Ryan predicted a new map could yield as many six seats for his party.",
    "The justices are now considering proposals from Democratic Gov.",
    "“This has been a team effort and we’re in decent shape.",
    "Their allies quickly asked the court to reconsider.",
    "Tony Evers, the Republican legislature and others.",
    "Democrats were counting on that backstop again.",
    "Tom Wolf were likely to reach an impasse.",
    "“We’re all waiting and waiting.",
    "Even more cases are pending.",
    "And in Florida, GOP Gov.",
    "He declined."
  ]
}