{
  "id": 3428,
  "mediaId": 8484,
  "date": "2022-02-01",
  "headline": "The Squad member Ilhan Omar announces she will RUN in 2022 with 29 of her Democrat colleagues already backing out in the face of a Republican bloodbath",
  "image": "https://i.dailymail.co.uk/1s/2022/02/01/15/53640329-0-image-a-14_1643730992921.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10464277/The-Squad-member-Ilhan-Omar-announces-RUN-2022.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "whatdoesitmean.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rob Crilly",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Rob+Crilly,+Senior+U.S.+Political+Reporter+For+Dailymail.Com",
  "termIds": [
    4195,
    2298,
    3448,
    3049,
    392,
    1126,
    6253,
    6396,
    6367
  ],
  "sentences": [
    "+8\nView gallery\nRep. Ilhan Omar announced on Monday night that she will run for a third term representing Minnesota's Fifth District - after 29 other Democratic members said they will not stand again\n+8\nView gallery\n'I still believe in a world where we choose peace over war, diplomacy over bellicosity, and the human rights of all people over the profits of the military-industrial complex,' she said\nLike many others he blamed redistricting, and accused state Republicans of 'dismembering Nashville.'",
    "Butterfield, 74, said in November 2021 that he won't run for reelection, accusing his state's Republican-led legislature of drawing a 'racially gerrymandered' map\nJim Cooper\nThe Tennessee Democrat became the 29th to announce he was not seeking reelection last week when he blasted Republicans in his state's general assembly for 'dismembering Nashville' during the redistricting process.",
    "+8\nView gallery\nMurphy said that she was 'consistently named one of the most bipartisan and effective members of Congress' and was among a small band of Democrats who threatened to vote against Biden's Build Back Better plan until lawmakers knew the full price tag\nEd Perlmutter\nAt the end of last year the eight-term Colorado congressman said he was planning to run again.",
    "+8\nView gallery\nRep. Jim Cooper of Tennesse became the 29th Democrat to announce he will not be running for re-election this year as the party fears losing control of Congress in November\n'Equating the United States and Israel to Hamas and the Taliban is as offensive as it is misguided,' wrote the group, led by New York Democrat Jerry Nadler.",
    "THESE ARE THE 29 HOUSE DEMOCRATS NOT RUNNING FOR REELECTION IN 2022\nCalifornia Representative Karen Bass is running to be mayor of Lose Angeles\nKaren Bass\nThe 68-year-old was originally elected to the House in the 2010 elections and formerly served as chairwoman of the Congressional Black Caucus from January 2019-January 2021.",
    "Time for me to be more than a weekend wife, mother and friend,' California Rep. Jackie Speier said when announcing she won't run again in 2022\nJackie Speier\nCo-chair of the Democratic Women's Caucus Jackie Speier, 71, has served California in the U.S. House since 2008 for both the 12th and 14th districts during her tenure.",
    "She is leaving her House seat to run for Senate in Florida against incumbent Republican Marco Rubio\nMichael Doyle\nAfter serving in the House since 1995, the 68-year-old Pennsylvania representative announced in October 2021 he will 'torch to the next generation' and not seek reelection.",
    "Conor Lamb is running for the open Senate seat in Pennsylvania\nConor Lamb\nBy far the youngest Democrat not seeking reelection in 2022, Conor Lamb, 37, announced in August 2021 that he is instead running for an open Senate seat in Pennsylvania.",
    "Brenda Lawrence\nAmid suspicions that Michigan's only black member of Congress was unhappy with redistricting, the 67-year-old this month said she was confident she would have won the new district but wanted to spend more time with her family.",
    "'We must have the same level of accountability and justice for all victims of crimes against humanity,' she wrote, alongside video of her quizzing Secretary of State Antony Blinken during a committee hearing in the House of Representatives.",
    "The 80-year-old chairwoman of a House Appropriations subcommittee overseeing immigration issues said she was unhappy with the California redistricting commission's map due to concerns it doesn't ensure adequate Hispanic representation.",
    "Charlie Crist\nThe Republican-turned-Democrat announced in May 2021 he is running to once against be governor of Florida – a race unlikely to be victorious in the swing state of Florida, which has gone progressively red in recent years.",
    "Price served North Carolina from 1987-1995 and again from 1997 to now, where he currently chairs a House Appropriations subcommittee that has oversight of the Departments of Transportation and Housing and Urban Development.",
    "'Ignoring the differences between democracies governed by the rule of law and contemptible organizations that engage in terrorism at best discredits one's intended argument and at worst reflects deep-seated prejudice.'",
    "In December 2021, he announced he would not seek reelection, claiming he feels good being able to retire with the passage of the bipartisan infrastructure bill, which he considers 'the capstone to a career of service.'",
    "'I still believe in a world where we choose peace over war, diplomacy over bellicosity, and the human rights of all people over the profits of the military-industrial complex,' she said in comments posted to Facebook.",
    "Two years earlier she had to apologize for suggesting that American support for Israel was fueled by political donations from a pro-Israel lobby group when she was accused of perpetuating 'anti-Semitic tropes.'",
    "He was seen as a low-key presence in the House of representatives, advocating for people with disabilities and working on cybersecurity - he was a founder of the House Cybersecurity Caucus, which he co-chairs.",
    "Rush represented the state's 1st congressional district since 1993 and was the only politician to ever beat Barack Obama in an election – besting him in the 2000 primary race for the seat he already held.",
    "At times she has attracted as much anger from her Democratic colleagues - some of whom rebuked her last year for comments that seemed to liken the US and Israel to Hamas and the Taliban - as Republicans.",
    "Before her only 4-point win last cycle, Bustos won in 2018 by nearly 25 points, exhibiting her falling favor with constituents in Illinois' 17th district, which voted heavily for Donald Trump.",
    "Ryan currently chairs a House Appropriations subcommittee with jurisdiction over legislative branch spending, where he has attempted to investigate Capitol Police handling of January 6.",
    "Val Demmings\nServing as Orlando's police chief from 2007-2011, Demings, 64, became a rising star of the Democratic Party and even made Joe Biden's shortlist of running mates in 2020.",
    "She originally came to represent Florida's 7th congressional district in 2016 by unseating longtime GOP incumbent John Mica, who served there from 1993 until he was beat by Murphy.",
    "Filemon Vela\nSince 2013, Filemon Vela has represented Texas' 34th congressional district – but he announced in March 2021 that he will not seek reelection in 2022 for a sixth term.",
    "Rep. Ilhan Omar has announced she will run for a third term representing Minnesota's Fifth District - after 29 of her colleagues have opted not to defend their seats in November.",
    "Eddie Bernice Johnson\nJohnson was the first black woman to chair the House Science, Space and Technology Committee and was the first registered nurse to be elected to Congress.",
    "The 70-year-old former chief executive of a wind power start-up served on the House Committee on Energy and Commerce and the House Committee on Science, Space and Technology.",
    "Tim Ryan\nOhio will lose their ambitious 13th district representative at the close of 2022 as Tim Ryan, 48, attempts to rise to the Senate in a race for Rob Portman's seat.",
    "John Yarmuth\nThe House Budget committee chairman has helped Democrats craft their social spending package, but will end that effort after next year when he leaves office.",
    "'A world where we put human rights at the center of U.S. foreign policy, oppose war and militarism and pursue accountability for human rights abuses wherever they occur.",
    "David Price\nAfter three-and-a-half decades in Congress – with a short two-year break in the 1990s – the 81-year-old representative will retire at the end of this term.",
    "In recent years, Oregon's 4th congressional district has become increasingly competitive, causing him to remain in place for fear of giving up the seat to Republicans.",
    "In December 2021, Murphy became one of the most recent Democrats to announce she won't run for reelection in 2022 midterms, but says she won't leave 'public service.'",
    "Ann Kirkpatrick\nArizona's representative for the 2nd congressional district said in March 2021 she is 'term-limiting myself' by refusing to seek reelection in 2022.",
    "'Anti-Semitism is real and I am grateful for Jewish allies and colleagues who are educating me on the painful history of anti-Semitic tropes,' she said at the time.",
    "And she quickly rose to prominence as a member of the 'Squad' - a small grouping of ultra liberal lawmakers, including Alexandria Ocasio-Cortez and Rashida Tlaib.",
    "+8\nView gallery\nJohn Yarmuth helped Democrats craft the social spending package, but might not be able to see it over the finish line if it doesn't pass in 2022",
    "Anthony Brown\nThe congressman has served in Maryland politics since 1999 – most recently representing the state's 4th congressional district in the U.S. House.",
    "His statement made reference to the 'newly created 9th Congressional District,' hinting that redistricting was a factor but he offered no further explanation.",
    "Jim Langevin\nLangevin made history as the first quadriplegic to serve in Congress when he was first elected to represent Rhode Island's 2nd district in 2001.",
    "Kirkpatrick, 71, represented the state's 1st district from 2009-2011 and again from 2013-2017 before she switched to the 1st district from 2019 present day.",
    "'This is the right time to turn the page and spend more time with my family — my husband, daughter, son and granddaughter — and put them first,' she said.",
    "Peter Welch\nAfter representing Vermont in the House since 2007, Welch, 74, is now taking his ambitions further to represent the state in the U.S. senate.",
    "Bobby Rush\nThe 15-term 75-year-old representative from Illinois told the Chicago Sun-Times on January 3 that he would not seek a 16th term in the House.",
    "Last week, Rep. Jim Cooper of Tennessee became the 29th to say he was not seeking reelection, amid fears that they face devastating results in November.",
    "And she has helped pass eight bills and amendments into law through four years of being in office, she said as she launched her campaign for reelection.",
    "Something I said to myself and to the voters over and over: I believe that a better world is possible,' she said as she announced her intention to run.",
    "Cheri Bustos\nAfter narrowly winning reelection in 2020, Bustos announced in April 2021 that she will retire from Congress at the end of her fifth term.",
    "The congresswoman for Florida's 10th district served as one of the House prosecutors during Trump's impeachment trial after the January 6 Capitol riot.",
    "Last year she triggered controversy with tweets that accused the U.S. of committing 'unthinkable atrocities,' alongside Hamas, Israel and the Taliban.",
    "Ryan officially launched his Senate campaign in April 2021 after an unsuccessful run to be the Democratic presidential nominee in the 2020 election.",
    "Yarmuth, 74, announced in October 2021 he will not seek reelection after 14 years in the House representing Kentucky's 3rd congressional district.",
    "He first came to represent Pennsylvania's 18th – now 17th – district in a 2018 special election for a district previously held by a Republican.",
    "The congresswoman took a leave of absence from the House in 2020 to recover from alcoholism, but said that did not play a role in her decision.",
    "But Perlmutter, 68, later praised her performance and said it had been a mistake to push for what he described as change 'for change's sake.'",
    "The redistricting process this year further gives Republicans in Texas the opportunity to draw a border district to be more competitive.",
    "Lucille Roybal-Allard\nFirst elected to the House in 1993, Roybal-Allard announced in December 2021 that she will not seek reelection.",
    "She announced in June 2021 that she will end her House tenure to challenge Republican Marco Rubio for his Senate seat in Florida.",
    "Ron Kind\nThe Wisconsin representative is one of only seven Democrats representing a district that was carried by Trump in 2020.",
    "in a dig at then President Donald Trump who said that she and other black congresswomen should 'go back' to their countries.",
    "Peter DeFazio\nThe Oregon congressman announced in December 2021 that he won't seek reelection after 18 terms in the House.",
    "Brown, 60, will not seek reelection because he launched a campaign in October 2021 to serve as Maryland attorney general.",
    "Stephanie Murphy\nMurphy, 43, is the first Vietnamese American woman elected to Congress and leads the Blue Dog Coalition.",
    "Following Senator Patrick Leahy's retirement announcement, Welch said in November 2021 that he will vie to succeed him.",
    "The 58-year-old was in a district considered a Democratic stronghold, but it swung hard to the right from 2016 to 2020.",
    "He attributed his retirement wanting to spend more time with his family and share his story with the next generation.",
    "Lowenthal announced in December 2021 he will retire at the end of the 117th Congress to spend more time with family.",
    "He was among those who opposed Pelosi from becoming Speaker of the House in 2018, and then pushed for term limits.",
    "Tom Suozzi\nLong Island's two-term representative Tom Suozzi will not seek a third, he announced in November 2021.",
    "In November 2021, Speier announced she would run again for the House, claiming, 'It's time for me to come home.",
    "Alan Lowenthal\nThe 80-year-old has represented a safely Democratic Long Beach, California district since 2013.",
    "'I would have felt more obligation to run again' if the district remained a potential swing seat DeFazio said.",
    "The 65-year-old was governor of the Sunshine State from 2007–2011 and was first elected to the House in 2016.",
    "Rush was a civil rights activist and co-founded the Illinois chapter of the Black Panther Party in the 1960s.",
    "Instead, the 59-year-old launched a campaign running for governor of New York as a 'common sense Democrat.'",
    "California had yet to finalize its new congressional map, which could affect his current district's lines.",
    "He announced in August 2021 that he would not seek reelection in his state's 3rd congressional district.",
    "Jerry McNerny\nThe California Democrat became the 27th to say he would not be standing for reelection.",
    "Lamb narrowly won in 2020 with just two points over his Republican challenger in the swing state.",
    "The 60-year-old led the Democratic Congressional Campaign Committee in the 2020 election cycle.",
    "But with President Joe Biden's numbers heavily underwater they could lose a lot more than that.",
    "The 86-year-old first assumed office in 1993 to represent Texas' 30rd congressional district.",
    "DeFazio, 74, serves as chairman of the House Transportation and Infrastructure Committee.",
    "When Omar ran for reelection in 2020, she chose the slogan, 'Send her back to Congress!'",
    "Her decision comes amid a string of retirements by other Democratic members of Congress.",
    "Her supporters say she has been an effective member during her four years in Congress.",
    "In her 12 years, Bass represented California's 33rd and 37th congressional districts.",
    "G.K. Butterfield\nThe North Carolina congressman has served in the House since 2004.",
    "Omar, 39, was first elected in 2019 becoming the first Somali American in Congress.",
    "Democrats can afford to lose only three seats to maintain a majority in the House.",
    "Albio Sires\nSires, 70, has served in the House representing New Jersey since 2006.",
    "Redistricting will also likely change his Pittsburgh-based district's boundaries.",
    "It came soon after hostilities ended between Hamas and Israel in the Middle East.",
    "A group of Democrats said her 'false equivalence' gave cover to terrorist groups.",
    "'My intention is never to offend my constituents or Jewish Americans as a whole.'",
    "Doyle cited wanting to spend retirement with his wife and their growing family.",
    "Kind, 58, narrowly won reelection in 2020 with only 51 per cent of the vote.",
    "'When I first ran for this office there was one thing I kept coming back to.",
    "+8\nView gallery\nVal Demings quickly became a star of the Democratic Party.",
    "She announced in November 2021 she won't seek reelection for a 15th term.",
    "But in January he said it was time to pass the baton to a new generation.",
    "He will have served 32 years in Congress when he retires next January.",
    "His disability was the result of a firearms accident when he was 16.",
    "Instead, in 2020, Ryan was reelection to his 10th term in Congress.",
    "She launched her campaign for Los Angeles mayor in September 2021.",
    "Time for me to be more than a weekend wife, mother and friend.'",
    "Price announced in October 2021 that he won't seek reelection.",
    "Recently redrawn lines make the district more solidly blue.",
    "'If you believe a better world is possible, join me.'",
    "She cited wanting to spend more time with family.",
    "+8\nView gallery\n'It's time for me to come home.",
    "'I still believe that.'"
  ]
}