{
  "id": 3807,
  "mediaId": 2594,
  "date": "2022-01-27",
  "headline": "Sexism row over backlash at Pelosi running again: ‘The same people tell Bernie to run for president’",
  "image": "https://static.independent.co.uk/2022/01/13/16/1364441862.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/pelosi-reelection-sexism-sanders-b2002284.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Bowden",
  "authorUrl": "https://www.independent.co.uk/author/john-bowden",
  "termIds": [
    0
  ],
  "sentences": [
    "CNN’s Bakari Sellers, a centrist Democratic former state lawmaker in South Carolina, said on Tuesday that he “firmly believe[s] that it’s time for new leadership in the House Democratic Caucus.”\n“Not only do we have to get younger, but we have to be more vibrant and have to have bigger and bolder ideas to bring in a new generation of voters,” he added.",
    "Kimberly Cissell, another supporter, added: “Pelosi, Feinstein, RBG … they push older women to retire but fawn over a man just as old like he is the second coming of Stalin.”\nHer tweet referred to the anger many liberals have expressed at former Supreme Court Justice Ruth Bader Ginsburg’s decision not to retire during the Obama administration.",
    "Ms Pelosi previously faced a revolt from members of her own caucus in 2018, led by Rep Tim Ryan, for control of the Speaker’s gavel but successfully fought off the challenge; Mr Ryan remains in the House but is now running for the Senate in Ohio’s hotly contested race to replace retiring Sen Rob Portman.",
    "SE Cupp, a conservative political commentator, laid blame on the Speaker for her party having “no clear bench” of new leaders rising to leadership roles in the party, which she said was because “folks like Pelosi haven’t given them a chance to develop one”.",
    "Supporters of Speaker Nancy Pelosi were outraged after news of her re-election was met on cable news and social media with calls for the 81-year-old Speaker of the House to retire or step back from leadership of the Democratic Party by some commentators.",
    "Ms Pelosi, currently one of the most powerful women in the country, assumed the Speakership once again in 2018 when her party won resounding victories over then-President Donald Trump’s party in the midterm elections that year.",
    "“If we’re in the minority,” one Democratic member of the House told The Hill in an interview, “I can’t imagine her wanting to [remain leader].”\nOthers were public with their speculation and advice.",
    "“Sexism and misogynism is when Nancy Pelosi who's 81 years old is told to retire by the same people who's telling Bernie Sanders who's 80 years old he should run for President,” wrote Dane Weeks.",
    "With that in mind, the California congresswoman officially announced her bid for re-election — which was widely expected — earlier this week in a video message released on her Twitter account.",
    "Many pointed to widespread support for Sen Bernie Sanders in the past two presidential elections by large swaths of the Democratic Party; Mr Sanders turned 80 in the fall.",
    "The message was met with immediate speculation about her future as leader of the House Democratic caucus across cable news and print media, as well as on Twitter.",
    "Now, she faces the prospect of the Republicans enacting that same scenario and potentially ousting House Democrats from power in November.",
    "On Twitter, Ms Pelosi’s supporters fumed that the criticism of her decision to seek a 19th term in Congress was a symptom of sexism.",
    "Ms Ginsburg’s seat on the Court would later be filled by Justice Amy Coney Barrett, nominated by Donald Trump.",
    "“Thank you for recognizing that sexism exists,” a female commenter wrote in response to Mr Weeks’s tweet.",
    "Nothing less is at stake than our democracy,” she warned in the video.",
    "“This election is crucial."
  ]
}