{
  "id": 3994,
  "mediaId": 2644,
  "date": "2022-01-24",
  "headline": "House lawmakers call on Pelosi, McCarthy to pass stock trade ban",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/01/newspress-collage-20946897-1643061857220.png?w=1024",
  "link": "https://nypost.com/2022/01/24/house-lawmakers-call-on-pelosi-mccarthy-to-pass-stock-trade-ban/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Juliegrace Brufke",
  "authorUrl": "",
  "termIds": [
    3246,
    4066,
    5381,
    4923,
    1477,
    1433
  ],
  "sentences": [
    "“Both of you have recently addressed this issue in public comments, but this glaring problem will not go away until it is fixed and Congress should not delay when we have the power to fix it.”\nThe letter cited a 2020 investigation by the Justice Department into stock trades made by several senators in the early days of the COVID-19 pandemic.",
    "Instead, Congress should close these loopholes by simply banning members from owning or trading individual stocks while in office.”\nThe lawmakers further argued that there is “no reason that members of Congress need to be allowed to trade stocks when we should be focused on doing our jobs and serving our constituents.",
    "Led by Rep. Jared Golden (D-Maine), the 27 lawmakers insisted in a Monday letter to Speaker Nancy Pelosi (D-Calif.) and House Minority Leader Kevin McCarthy (R-Calif.) that action was necessary to restore the public’s trust in Congress amid allegations that members have misused their positions for personal gain.",
    "However, the legislators who signed Monday’s letter insisted that the 2020 controversy showed “the current rules are not working.”\n“The law prohibits only those stock trades that members of Congress make or direct because of their nonpublic knowledge,” they said.",
    "Members should live by the rules every American lives by, not remove us from the economy.”\nTwo Republicans — Matt Gaetz of Florida and Brian Fitzpatrick of Pennsylvania — were among the letter’s 27 signatories.",
    "Prominent Democratic members who signed on include Rashida Tlaib (D-Mich.), Pramila Jayapal (D-Wash.) Tom Malinowski (D-NJ), Kathleen Rice (D-NY), Andy Kim (D-NJ), Ritchie Torres (D-NY) and Tim Ryan (D-Ohio).",
    "Currently, lawmakers and staff are prohibited from using non-public information for financial gain and are required to publicly disclose stock and bond transactions within 45 days under the STOCK Act of 2012.",
    "McCarthy recently floated a ban or additional restrictions on member trades if Republicans win back the House majority in November, though other members of the GOP conference have pushed back on the idea.",
    "The Post previously reported that the Speaker and her husband Paul have made up to $30 million with the help of his holdings in five major Big Tech firms: Facebook, Google, Amazon, Apple and Microsoft.",
    "More than two dozen members of the House of Representatives have called on leadership to bring a bill aimed at banning members from trading and owning individual stocks to the floor.",
    "We came to Congress to serve our country, not turn a quick buck.”\nThough Pelosi herself does not own any individual stocks, she has expressed support for members’ ability to trade.",
    "“[C]ommon-sense, bipartisan legislation is unfortunately necessary in light of recent misconduct, and is supported by Americans across the political spectrum,” the letter read.",
    "One lawmaker, Sen. Richard Burr (R-NC), stepped down as chairman of the Senate Intelligence Committee amid the furor, though the Justice Department opted not to pursue charges.",
    "James Inhofe (R-Okla.) and Dianne Feinstein (D-Calif.) were also among those whose transactions were scrutinized, though the DOJ again declined to take further action.",
    "“It’s short-term political gain against Pelosi, while making members worse off for the long term,” one Republican lawmaker recently told The Post.",
    "“But it can be nearly impossible to determine what counts as ‘nonpublic knowledge’ or how personally involved members are in their stock trades.",
    "Pelosi is one of the richest members of Congress, with an estimated net worth of more than $106 million, according to an analysis by The Post.",
    "“Perhaps this means some of our colleagues will miss out on lucrative investment opportunities,” they added.",
    "“Pelosi’s stock portfolio isn’t representative of 98 percent of House members’ net worth.",
    "“We don’t care.",
    "Sens."
  ]
}