{
  "id": 401,
  "mediaId": 2526,
  "date": "2022-02-22",
  "headline": "Midterm Analysis: GOP to Win House Based on Democrat Retirements Alone",
  "image": "https://media.breitbart.com/media/2022/02/AP22045579349166-640x335.png",
  "link": "https://www.breitbart.com/midterm-election/2022/02/22/midterm-analysis-gop-to-win-house-based-on-democrat-retirements-alone/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    0
  ],
  "sentences": [
    "However, Punchbowl estimated the following districts will change from blue to red:\nRep. Ann Kirkpatrick (AZ-6) — Lean R (R+7)\nRep. Cheri Bustos (IL-17) Toss-up (D+4)\nRep. Tim Ryan (OH-13) — Map not finalized\nRep. Charlie Crist (FL-13) — Map not finalized\nRep. Ron Kind (WI-3) — Map not finalized\nRep. Conor Lamb (PA-17) — Map not finalized\nRep. G.K. Butterfield (NC-1) — Map not finalized\nRep. Stephanie Murphy (FL-7) — Map not finalized\nRep. Ed Perlmutter (CO-7) — Toss-up (D+6)\nRep. Jim Cooper (TN-5) — R+15, solid R\nThe analysis also includes three house seats that Republicans have a shot at flipping but may be an uphill battle:\nRep. Jerry McNerney (CA-9) — D+8.",
    "Republicans winning back the House would give them an opportunity to impeach Biden, investigate the origins of the coronavirus, fire Dr. Anthony Fauci, and investigate the invasion on the southern border and the deadly collapse of Afghanistan.",
    "Rep. Kathleen Rice (NY-4) — D+8\nRep. Peter DeFazio (OR-4) — D+9\nThe analysis continued, revealing that Republicans are favored to pick up three seats based on state redistricting, along with a member retiring.",
    "House Republicans are scheduled to pick up at least ten House seats due to Democrat retirements alone, according to an analysis by left-leaning Punchbowl News.",
    "Some of the districts that will likely fall to Republicans from Democrats’ grasp have not been finalized by state legislatures or courts.",
    "Among registered voters, Republicans lead Democrats by 14 points in enthusiasm (79 – 65 percent), according to an Emerson survey.",
    "Republicans are only in the minority by five seats with 30 total Democrat retirements, the largest mass exodus in three decades.",
    "The mass Democrat exodus from Congress is likely due to the failings of President Biden’s leadership throughout 2021.",
    "Polling indicates Biden’s woes have contributed to the Democrats’ challenge of maintaining the House majority.",
    "During Biden’s presidency, more than two million migrants have been apprehended at the southern border.",
    "The poll also asked respondents which congressional candidate they would vote for on a generic ballot.",
    "Enthusiasm is a relevant metric because it indicates turnout levels among voters.",
    "And Americans suffered embarrassment from the deadly Afghan withdrawal.",
    "Fentanyl deaths have become the greatest killer among 18-45-year-olds.",
    "Redistricted into the same district as Rep. Vicente Gonzalez.",
    "Republicans led Democrats by nine points (50 – 41 percent).",
    "These include:\nRep. Filemon Vela (TX-34) — Solid D (D+17).",
    "Redistricted into a seat with Frontline Rep. Josh Harder.",
    "Redistricted into the same district as Roybal-Allard.",
    "Rep. Lucille Roybal-Allard (CA-42) — Solid D (D+44).",
    "Redistricted into the same district as Lowenthal.",
    "Gas prices have increased $1.00 since last year.",
    "Turnout greatly impacts closely contested races.",
    "Rep. Alan Lowenthal (CA-42) — Solid D (D+44).",
    "Inflation has hiked to a 40-year-high.",
    "Supply chain woes have persisted.",
    "Weekly wages have sagged."
  ]
}