{
  "id": 4164,
  "mediaId": 2694,
  "date": "2022-01-20",
  "headline": "Democrats Moved the Filibuster Overton Window",
  "image": "https://cdn.theatlantic.com/thumbor/bAAMxqNXmpVHoU-hpqa1Wsavcq4=/0x43:2000x1085/1200x625/media/img/mt/2022/01/DEMSvotingRights/original.png",
  "link": "https://www.theatlantic.com/politics/archive/2022/01/manchin-sinema-democrats-filibuster/621298/?utm_source=feed",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald Brownstein",
  "authorUrl": "https://www.theatlantic.com/author/ronald-brownstein/",
  "termIds": [
    0
  ],
  "sentences": [
    "“If the Senate cannot even begin to debate and vote on something as foundational as voting rights, we must reform Senate rules,” wrote the group, which includes centrist former Senate Majority Leader Tom Daschle as well as Doug Jones, Blanche Lincoln, Kent Conrad, and Mary Landrieu, each of whom operated on the right end of the party’s spectrum\nYesterday morning, Sinema’s Arizona colleague, Senator Mark Kelly, announced that he would support changing Senate rules for voting-rights issues “to pass them with a majority vote.” His announcement completed the steady movement toward that position of other Democratic senators in potentially tough 2022 races, including Maggie Hassan of New Hampshire and Catherine Cortez Masto of Nevada.",
    "During the debate, several GOP senators, including Susan Collins, Rob Portman, and Republican Leader Mitch McConnell, loudly professed their support for the Voting Rights Act without mentioning that they are filibustering the Democratic bill to restore it, after party-line decisions in 2013 and 2021 by the Republican-appointed Supreme Court justices gutted the law’s two major enforcement provisions.",
    "That consensus extends from 2022 Senate contenders who identify with the left, such as Wisconsin Lieutenant Governor Mandela Barnes and Pennsylvania Lieutenant Governor John Fetterman, to those who identify much more with the center, such as Representatives Conor Lamb and Val Demings, who are seeking Senate nominations in Pennsylvania and Florida, respectively.",
    "In a subsequent tweet, Finkenauer flatly declared, “I’ll vote for filibuster reform to pass voting rights legislation.”\nYesterday’s debate on voting rights likely solidified the Democratic consensus on changing the filibuster by demonstrating how completely the congressional GOP has turned against virtually any federal role in protecting voters.",
    "“It is no longer a tenable position to defend the broken status quo.”\nAll of this may be cold comfort to advocates smarting from last night’s defeat—and facing the prospect that red states could have almost unfettered freedom to restrict voting rights over the next few years if Republicans regain one or both congressional chambers this fall.",
    "These rapid-fire developments include:\nLast Thursday, a coalition of leading party interest groups, including the League of Conservation Voters, the Black Voters Matter Fund, the Latino Victory Fund, and End Citizens United/Let America Vote announced that they would withhold endorsements from senators who opposed the filibuster changes.",
    "But for activists, the long battle over voter protections hasn’t been entirely in vain: It’s fundamentally changed the center of gravity in the Democratic Party to the point where those two holdouts are likely to be the last Democrats ever elected to the Senate who support maintaining the filibuster, at least for voting rights.",
    "These declarations from the groups and candidates alike make it highly probable, even virtually certain, that the filibuster will fall, at least on voting-rights issues, the next time Democrats hold a governing trifecta of the House, Senate, and White House that does not depend on the votes of Manchin and Sinema.",
    "It also extends from the challengers running in purple swing states such as Wisconsin and Pennsylvania to candidates in Republican-leaning terrain, including Demings in Florida, former state Supreme Court Chief Justice Cheri Beasley in North Carolina, Representative Tim Ryan in Ohio, and Abby Finkenauer in Iowa.",
    "The irony is that while Senate Republicans are now professing their fealty to the filibuster, Democrats and many academics who study Congress believe that the GOP is highly likely to retrench or revoke it if it blocks their agenda the next time they hold unified control of the House, Senate, and White House.",
    "Republicans’ resistance even to the bill that would revive the VRA to its strength, when they, along with every other senator, voted to reauthorize it in 2006, underscored the impracticality of relying on bipartisan supermajorities, as the filibuster requires, to pass federal voting-rights protections.",
    "On Monday, EMILY’s List, the fundraising behemoth that supports female Democratic candidates who endorse abortion rights, said in an unusually pointed statement that it would no longer support Sinema if she maintained her opposition to changing the filibuster.",
    "On Tuesday, NARAL Pro-Choice America, another leading Democratic group that backs candidates who support abortion rights, more sweepingly announced, “We will not endorse or support any senator who refuses to find a path forward” on voting-rights legislation.",
    "The letter was directed toward incumbent Democratic senators, but Gene Karpinski, the president of the League of Conservation Voters, told me that the group will likely apply the same standard to Democratic challengers in the 2022 and future elections.",
    "EMILY’s List recorded nearly $46 million in direct contributions and outside spending for Democrats in the 2020 election cycle and, two years earlier, was among Sinema’s biggest donors, according to the campaign-finance watchdog group OpenSecrets.",
    "And when Republicans hold that power, few would be surprised if McConnell, who has repeatedly discovered new Senate “rules” that advantage the GOP, finds another timely justification to reverse his unflinching defense of the filibuster this week.",
    "In fact, by blocking any federal response to the voter-suppression legislation advancing across so many red states, the two Democratic holdouts are increasing the chances that it will be Republicans who next seize unified control of Washington.",
    "But a series of events over roughly the past week suggest that by forcing the voting-rights fight to a climactic, if doomed, vote, Senate Majority Leader Chuck Schumer has accelerated the development of a new consensus position in the party.",
    "Sinema’s decision to reject the voices of allies, partners and constituents who believe the importance of voting rights outweighs that of an arcane process means she will find herself standing alone in the next election,” the group wrote.",
    "Zupnick said that when the party won the Senate majority last January, “we had a list of 10 Democratic senators who were reluctant or flat-out opposed” to changing the filibuster, or who would not commit to any position on the issue.",
    "“I think going forward, particularly when it comes to an issue like voting rights, senators and people who want to be senators need to understand there is only one place to stand to be on the right side of history,” he said.",
    "Republicans need a net gain of only five seats to win back the House majority in November’s election and the party out of the White House has won at least that many in all but four midterm elections since the Civil War.",
    "Democrats and civil-rights advocates were devastated when Joe Manchin and Kyrsten Sinema blocked a change in Senate rules last night and allowed a Republican filibuster to kill crucial voting-rights legislation.",
    "“It does feel like the world is changing so much that the Manchin stance isn’t going to make sense for anybody, anywhere,” Kristin Ford, NARAL’s vice president of communications and research, told me.",
    "“I think it is very likely they are the last two elected Democrats who support the filibuster,” Eli Zupnick, the spokesperson for Fix Our Senate, a group advocating for filibuster reform, told me.",
    "Finkenauer, running in an uphill race against long-serving Republican Senator Charles Grassley, released a video last week condemning Sinema by name as a “sellout” for defending the filibuster.",
    "It’s difficult to identify any plausible Democratic Senate candidate this year who has not endorsed rolling back the filibuster, at least for voting rights, and many of them for other issues.",
    "The League of Conservation Voters alone spent about $52 million supporting Democratic Senate candidates over the past three elections, including nearly $4 million for Sinema in 2018.",
    "Also on Tuesday, a group of 10 centrist and center-right former Democratic senators issued a statement endorsing a change in the filibuster rules to pass voting-rights legislation.",
    "Most of these Democratic challengers are looking not to downplay this position, but instead to highlight their commitment to changing the filibuster, at least on voting rights.",
    "The party out of the White House hasn’t recorded major gains as consistently in midterm Senate races, but there, of course, Republicans need only a net pickup of a single seat.",
    "If Democrats lose unified control of Congress in November, it’s not clear when they will regain it and the power to implement their new consensus on retrenching the filibuster.",
    "Ultimately, every Democratic senator except Manchin and Sinema voted to change the filibuster rules in an attempt to pass the party’s twin voting-rights bills last night.",
    "The leading Democratic Senate challengers for 2022, even in tough swing states such as Wisconsin and Pennsylvania, have already indicated support for changing the rules.",
    "That prospect suggests that whichever party gains the electoral advantage in the next few years, Manchin and Sinema are only delaying the inevitable.",
    "At that time, another prominent former senator, the newly elected President Joe Biden, was openly resistant to changing the rules too.",
    "The Democratic-leaning groups now conditioning future support on retrenching the filibuster exert substantial influence in the party.",
    "Unless Biden’s approval ratings jump substantially before November, Republicans could post considerable gains in both chambers.",
    "And, even if Biden’s popularity recovers by 2024, the map of Senate seats at stake that year is more challenging for Democrats.",
    "They’re not alone: Key party constituencies are pledging to withhold support for Democrats who do not back filibuster reform.",
    "But it is clear that Manchin and Sinema are holding to a position that leaves them almost completely isolated in the party.",
    "“This is no longer just a progressive issue—it is a consensus Democratic position,” Zupnick said.",
    "The movement has been as striking among incumbents, including those from tough swing states.",
    "It’s easy to lose sight of how big a change this represents for Democrats.",
    "That level of agreement seemed very much an uphill climb one year ago.",
    "The question, of course, is when that will be.",
    "“Sen."
  ]
}