{
  "id": 4306,
  "mediaId": 2550,
  "date": "2022-01-22",
  "headline": "It's time for Democrats to quit talking about Democrats and do nothing but pillory Republicans",
  "image": "https://images.dailykos.com/images/1028459/story_image/GettyImages-1237837543.jpg?1642630421",
  "link": "https://www.dailykos.com/stories/2076140",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    1819,
    4267,
    3367,
    4885,
    1489,
    1339,
    1126,
    392,
    6239
  ],
  "sentences": [
    "In short: these are ahistorical times, redistricting has not gone nearly as badly for Democrats as originally thought, Republicans are going to nominate a bunch of looney extremists, Democratic candidates are pretty strong across the board, and Democrats have 7 million more people on their voter rolls who voted for Biden in 2020 and can be targeted by turnout operations.",
    "Rep. Tim Ryan of Ohio, for instance, is running for the state's open Senate seat and just might make that race competitive if inflation comes down, the pandemic becomes more manageable, and Republicans nominate a pro-Trump extremist who can't moderate for the general election (odds are decent on that part of the equation).",
    "If Democrats are asked about the failure to pass voting rights (or really anything else), congressional Democrats should have one message and one message only: We've got 50 Senate Democrats who support it and 50 Senate Republicans who oppose it and they are abusing Senate rules to block its passage.",
    "The poll dropped in the middle of a discouraging week for Democrats, as they reeled from the failure to pass President Joe Biden's signature $2 trillion Build Back Better bill while hitting the same frustrating road blocks on critical voting rights legislation.",
    "The overwhelming majority of Americans have as much access to vaccines as they want, and it’s worth reminding them that congressional Republicans along with state GOP officials have deliberately done everything in their power to block that access.",
    "This type of repeated refrain throughout a press conference isn't a coincidence, it's a deliberate messaging choice—an invitation to journalists to make the topic a prominent part of their stories and put the question to Republicans.",
    "I found that message instructive, encouraging, and inspirational—don't get weighted down by congressional Democrats who are so bogged down in conventional thinking that they haven't realized these are unconventional times.",
    "I asked Trippi if he was discouraged by the posture of congressional Democrats, and he basically responded by explaining that most of them are caught in an old way of thinking—the conventional way of thinking.",
    "Speaking to the Times, Ryan lamented Democrats' failure to extend the monthly child tax credit they had originally folded into the American Rescue Plan, which not a single congressional Republican supported.",
    "After reporters asked Biden about Senate Minority Leader Mitch McConnell's suggestion that the midterms would be a \"report card\" on his administration's progress, Biden turned the question on its head.",
    "Basically, any time Democrats are talking about themselves is a bad messaging moment—unless they are touting accomplishments like pandemic relief, infrastructure investments, and the vaccine roll out.",
    "Instead, they need to be constantly reminded that the GOP is now an anti-democratic party that espouses extremist policies on everything from Jan. 6 to voting rights to abortion and more.",
    "Had one been beamed down to earth only to read this New York Times piece, they would have concluded that Biden's one-term presidency had suffered an early death just one year in.",
    "Any normal columnist would stop here, but I would like to make one more point that came up during the interview Markos Moulitsas and I did with Joe Trippi this week on The Brief.",
    "As a point of comparison, President Biden this week gave a nearly two-hour press conference in which he repeatedly asked the exact opposite question: What are Republicans for?",
    "Unless you're a GOP operative, that type of sour grapes comment is 100% counterproductive at this point, particularly from someone who's no longer fighting for their seat.",
    "Asked how he could possibly be surprised by GOP obstruction after serving as vice president for President Barack Obama, Biden used the opportunity to return to his theme.",
    "In Jan. 2021, Democrats held a 9-point advantage over Republicans in partisanship lean, 49% - 40%; but by year's end Republicans held a 5-point advantage, 47% - 42%.",
    "Trippi laid out several reasons why he thinks Democrats have a much better chance of keeping their congressional majorities than most people in the Beltway believe.",
    "“Leadership set out with a failed strategy, and while I guess, maybe they can message that they tried, it actually isn’t going to yield real laws,” Murphy offered.",
    "Swing-district Democrats are understandably worried as they face down a year in which historical trends favor them losing some 26 seats on average in the House.",
    "Trippi basically said, forget about the congressional Democrats who are approaching this election like it's any other midterm—especially those who are retiring.",
    "This week brought one of the surest signs yet that Democrats are spending too much time talking about themselves and not enough time talking about Republicans.",
    "Gallup released polling showing that Americans' political party preferences had undergone a 14-point shift in 2021 away from Democrats and toward Republicans.",
    "The piece was fueled partly by quotes from centrist Democrats like Reps. Cheri Bustos of Illinois and Stephanie Murphy of Florida—both of whom are retiring.",
    "We're trying to save the republic here, folks, and what the Gallup polling makes perfectly clear is that voters don't need to hear any more about Democrats.",
    "The message that should be pounded home again and again is the fact that the extremist Republican Party is wildly out of step with mainstream America.",
    "As I surveyed press coverage last weekend, I was astounded by several stories in which Democrats engaged in doomsday circular-firing-squad sniping.",
    "Before the press conference had even ended, one reporter did ask McConnell, and he confirmed that Republicans stand for absolutely nothing.",
    "But overall it's time for congressional Democrats to quit talking about other Democrats and, alternatively, talk solely about Republicans.",
    "Democrats understandably still want to get portions of BBB passed, and it's certainly possible that will happen in some scaled-back form.",
    "It's time for Democrats to start helping Biden make the case he has been prosecuting against Republicans rather than working against him.",
    "Biden has come out swinging this year in a series of speeches during which he has begun to define Republicans for the American people.",
    "Conventional wisdom on the Hill is that this midterm election is like any other election and will follow normal historical patterns.",
    "Ryan's frustration is totally justified, but the time for airing it aloud is over and only stands to hamper Democrats’ 2022 effort.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Sure, some voters are capable of a much more sophisticated analysis, but for the purposes of a broad public message, it works.",
    "What do you think their position is on whether or not we should — on what we should do about the cost of prescription drugs?\"",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "They have uniformly blocked Democratic efforts to ensure all Americans can exercise their fundamental right to vote.",
    "Name me one thing they’re for,\" Biden told reporters as they questioned whether his agenda had been too ambitious.",
    "Murphy is more than entitled to her opinion, but don't do us any favors by airing them on the way out the door.",
    "They're trying to bury evidence of the violent insurrection launched by pro-Trump supporters on Jan. 6.",
    "The American people are going to have to form a pro-democracy movement and save ourselves this cycle.",
    "You can watch the Trippi episode of The Brief here—it’s perfect if you’ve been feeling a bit gloomy.",
    "“If the Democrats can’t get on with a tax cut for working families, what are we for?” said Ryan.",
    "And their days of trying to improve the lives of everyday Americans have long since passed.",
    "But now is not the time to ponder Democratic failures and strategize aloud in the press.",
    "And they have no proposals whatsoever for how to improve the actual lives of Americans.",
    "Do you want a continuation of the child tax credit Democrats passed in pandemic relief?",
    "That's what grassroots activism is all about and that's exactly why this site exists.",
    "50 Senate Republicans are blocking it so their right-wing court can gut Roe v. Wade.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Do you want to ensure access to abortion and other reproductive health care?",
    "We don't have corporate backers that are only in it for the bottom line.",
    "50 Senate Republicans are blocking Democrats from making it permanent.",
    "\"I mean, I wonder what would be the Republican platform right now.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Biden wondered, referencing issues like immigration and Russia.",
    "They are Jan. 6 denialists who promoted Trump's election lies.",
    "\"I think that the fundamental question is: What’s Mitch for?\"",
    "They're trying to rig election outcomes at the state level.",
    "It's that simple, no need to get into the filibuster, etc.",
    "What do you think their position on — on human rights is?",
    "\"I just — I, honest to God, don’t know what they’re for.\"",
    "They've packed the Supreme Court with right-wing judges.",
    "They voted against the peaceful transfer of power.",
    "Senate trends in the midterms are less definitive.",
    "What do you think their position on taxes are?",
    "What’s he proposing to make anything better?\"",
    "Trippi simply does not believe that's true.",
    "x\nx\nThis is a short blurb about Daily Kos.",
    "50 Senate Republicans are blocking it.",
    "We are and must be our own saviors.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Do you want voting rights?",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "They're anti-vaccine.",
    "\"What are they for?",
    "What do you think?",
    "\"What’s he for?",
    "Please read it.",
    "he posited.",
    "Absolutely."
  ]
}