{
  "id": 4330,
  "mediaId": 8278,
  "date": "2022-01-18",
  "headline": "US Supreme Court Declines to Take Up Delphi Retirees’ Case",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2021/10/auction-gavel.jpg",
  "link": "https://businessjournaldaily.com/us-supreme-court-declines-to-take-up-delphi-retirees-case/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "I will continue to work with my colleagues to see what can be done legislatively to honor the commitment the company made to these Ohioans.”\nPhoto by EKATERINA BOLOVTSOVA from Pexels\nPublished by The Business Journal, Youngstown, Ohio.",
    "“When the Delphi Salaried Pension Plan was terminated, this devastated the long-term financial security of the almost 22,000 salaried employees at Delphi whose benefits were subsequently reduced,” Ryan said.",
    "I will continue to work with my colleagues in both parties to do just that.”\n“These retirees worked hard their entire lives to earn their pensions,” said U.S. Sen. Sherrod Brown, D-Ohio, in a statement.",
    "The retiree group filed suit in 2009 against PBGC after the agency took over employee pensions after Delphi field for bankruptcy, leading to the reduction of pensions for many salaried retirees.",
    "The requested writ would have permitted a review of a decision by the U.S. Sixth District Court of Appeals, which upheld a federal court ruling that dismissed the retiree lawsuit.",
    "“Today’s decision highlights the need for Congressional action to restore their pensions and provide them with the retirement benefits that they have always deserved.",
    "Ohio Attorney General Dave Yost joined a coalition of state attorneys general in a brief that argued the former Delphi employees’ rights were violated.",
    "YOUNGSTOWN, Ohio — The U.S. Supreme Court declined to take up the case of Delphi salaried retirees against the Pension Benefit Guaranty Corp.",
    "The high court denied the petition for a writ of certiorari in Black, Dennis, et al v. Pension Benefit Guarantee Corp. Tuesday.",
    "Rob Portman, R-Ohio, joined several colleagues in signing an amicus brief wit the Supreme Court in the case.",
    "In a statement Tuesday, Ryan said he was “deeply disappointed” by the Supreme Court’s declination.",
    "It granted a motion to file a reply brief under seal with redacted copies for the public record.",
    "Last fall, U.S. Reps. Tim Ryan, D-13 Ohio, and Bill Johnson, R-6 Ohio, and U.S. Sen.",
    "“They deserve to be made whole."
  ]
}