{
  "id": 4402,
  "mediaId": 2589,
  "date": "2022-01-25",
  "headline": "Democrats drawing up midterm primary hit list",
  "image": "https://media.townhall.com/townhall/reu/o/2011/6/224db9cf-2ae2-48b7-a829-f96c26e06f03@news.ap.org-1110x740.jpg",
  "link": "https://hotair.com/jazz-shaw/2022/01/25/democrats-drawing-up-midterm-primary-hit-list-n443944",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jazz Shaw",
  "authorUrl": "https://hotair.com/author/jazz-shaw",
  "termIds": [
    0
  ],
  "sentences": [
    "They see the skeleton Build Back Better (BBB) package and failed voting rights bill as warning signs that a few stubborn lawmakers can – and, if given the chance, will – block and blow up the liberal vision they had dreamed about enacting when President Biden took office.",
    "If any of our liberal friends were hoping that the ongoing Democratic civil war might be drawing to a close with the rancor over the BBB Act and the voting bills starting to fade into the background for a while, they’ll need to temper their expectations.",
    "Rather than focusing their fire on Republicans who appear to be threatening to summon up a serious red wave in the midterms, they are drawing up a hit list of insufficiently progressive members of their own party to target in the primaries.",
    "And no matter who wins in these primaries, the people in the more vulnerable districts and states are going to have to deal with the negative coattails of President Biden, whose approval ratings are now somewhere in the vicinity of the IRS.",
    "When things fell further apart last week, leaving the president and congressional Democrats scrambling for a way to advance their two main priorities, progressives saw a clear fix to all of it: primary challenges ahead of November.",
    "But as Karen recently pointed out, Cuellar’s position is complicated by recent FBI visits to his home, asking questions about some dubious dealings in Azerbaijan, so he may not be as secure as previously thought.",
    "Every Democratic seat that sees a serious primary challenge unfolding will be draining campaign contributions from the incumbents, leaving less ammunition to work with in the general election.",
    "A the same time, however, things in New York City have been changing over the past year as crime rates continue to rise and extreme progressive policies fall out of favor.",
    "Carolyn Maloney of New York is being targeted by challenger Rana Abdelhamid, who is hoping to recreate the AOC magic in her home state and knock her out of the primary.",
    "Progressives are preparing to try and clear out Democrats they say are hampering their ability to remodel the country while their party still controls Congress.",
    "The far more moderate Mayor Eric Adams (who was formerly a Republican) carried that part of the city handily, so that race is probably far from a sure thing.",
    "For any Republicans who are breaking out the popcorn to watch all of this infighting unfold, there’s plenty of action to take some encouragement from.",
    "Cuellar has already been the target of progressive Democrat Jessica Cisneros for a few years and she unsuccessfully challenged him in 2020.",
    "Multiple sitting Democrats are in the crosshairs in both the House and the Senate and candidates are being courted to take them out.",
    "Let’s see who made the Democratic Santa’s “naughty list” and will be drawing fire from their own ranks in the coming months.",
    "The simmering anger hasn’t gone away and the far-left progressives in both chambers are having thoughts of revenge.",
    "As Hanna Trudo reports at The Hill this week, the list goes much further than just Joe Manchin and Kyrsten Sinema.",
    "On the Senate side, in addition to Manchin and Sinema, progressives want to take a run at Tim Ryan of Ohio.",
    "This may well turn out to be one of the more exciting and chaotic midterm elections we’ve seen in a while.",
    "He’s a ten-term incumbent who probably shouldn’t have had much trouble holding on to his position.",
    "The 12th is rated as D+34 by Cook so the AOC formula could potentially be replicated there.",
    "Others on the list of targets include Danny Davis in Illinois and Jim Cooper in Tennessee.",
    "Maloney represents the 12th District, primarily on the east side of Manhattan.",
    "Cuellar still retains the backing of House Majority Leader Steny Hoyer.",
    "At the top of the scale is moderate Texas Democrat Henry Cuellar.",
    "It should be interesting to watch, so stay tuned.",
    "(That one will be a tall hill to climb.)",
    "(Or possibly an STD.)"
  ]
}