{
  "id": 5081,
  "mediaId": 2746,
  "date": "2022-04-23",
  "headline": "Trump touts Vance at Ohio rally",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/23/Trump_47631.jpg-1f892_c0-150-3600-2250_s1200x700.jpg?187bc123cc4510feb7f1966081317bdd024739c4",
  "link": "https://www.washingtontimes.com/news/2022/apr/23/trump-touts-jd-vance-ohio-rally/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joseph Clark",
  "authorUrl": "https://www.washingtontimes.com/staff/joseph-clark/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We’re excited to see big man, the 45th president of the United States and the 47th president of the United States tonight.”\nMr. Vance also decried Washington’s “corruption” which he said led to the FBI obtaining an “illegal wiretap” on the Trump campaign and to protesters the Jan. 6, 2021, attack on the Capitol being detained.",
    "He said it was “all about winning.”\nThe endorsement by Trump, who continues to maintain significant pull within the Republican Party, came as a blow to the top contenders in the field including former Ohio Republican Party Chair Jane Timken, investment banker Mike Gibbs and Mr. Mandel.",
    "Vance for U.S. Senate, ladies and gentlemen, because I am the America First candidate.”\nMr. Vance was a staunch critic of Mr. Trump in the lead-up to the 2016 election, slamming Mr. Trump as an “idiot.” He floated the idea of voting for Democratic presidential nominee Hillary Clinton.",
    "Mr. Trump’s recent endorsement of Mr. Vance, who in 2016 described himself as a “Never Trump guy” has exposed fissures within the state party with the Trump-aligned Club for Growth pledging to back former Ohio Treasurer Josh Mandel.",
    "Vance to the United States Senate.”\nPast transgressions between Mr. Trump and Mr. Vance appeared to be long gone at Saturday’s rally, with Mr. Vance praising the former president’s tough-on-China and pro-life policies.",
    "Several Republican leaders in Ohio mounted a last-ditch effort to urge Mr. Trump against endorsing Mr. Vance, citing his past disparaging comments and for his threats to support Mrs. Clinton.",
    "But on Saturday, Mr. Trump stood firmly behind Mr. Vance and assured his audience that he would be part of a Republican wave elected to Congress in this year’s primaries.",
    "Joe Kildea, a Club for Growth spokesperson, said told The Associated Press that the group will increase its spending in the coming days to air even more anti-Vance ads.",
    "And by the way, he’s been incredible the last long period of time.”\nMr. Trump said the final decision was not easy when he announced the endorsement last week.",
    "Mr. Trump shrugged it off Saturday, saying many of the candidates he has endorsed have, at one time or another, had less than flattering things to say.",
    "More recently, Mr. Vance has walked back the remarks during his prime-time cable news appearances and town halls as a Senate candidate.",
    "And with just weeks remaining until the primary, Mr. Trump’s endorsement has added another level of contention in the field.",
    "“Seven months from now the people of Ohio are going to vote to fire the radical left Democrats,” Mr. Trump told the crowd.",
    "“You’re going to elect an incredible slate of true ‘America First’ Republicans to Congress, and we’re going to send J.D.",
    "“I’m honored, honored to have the endorsement of Donald J. Trump for my Senate candidacy in Ohio,” Mr. Vance said.",
    "But said Mr. Vance was best positioned to take on Democratic front-runner, Rep. Tim Ryan, in the fall.",
    "Vance in a campaign-style rally in Ohio weeks ahead of the state’s highly competitive May 3 primary.",
    "“If I went by that standard, I don’t think I would have endorsed anybody in the country,” he said.",
    "Another group backing Mr. Mandel, Ohio Value Voters, called for a boycott of Saturday’s rally.",
    "Former President Donald Trump on Saturday touted Republican Senate candidate J.D.",
    "“I’m so honored to be here at this Trump rally,” Mr. Vance said.",
    "“I have to do what I have to do,” Mr. Trump told the crowd.",
    "This state loves the president and on May 3, vote J.D.",
    "“A lot of them said some really bad things.",
    "“We have to pick somebody that can win.”",
    "But ultimately, I put that aside.",
    "“The President loves this state."
  ]
}