{
  "id": 5269,
  "mediaId": 2746,
  "date": "2022-04-18",
  "headline": "J.D. Vance worried Trump could be ‘America’s Hitler,’ according to former roommate",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/15/Election_2022_Senate_Ohio_Trump_49616.jpg-6bd01_c0-124-4852-2954_s1200x700.jpg?a423c8e1ad5a5d8e7fd7e08034242c48bb553fb3",
  "link": "https://www.washingtontimes.com/news/2022/apr/18/jd-vance-worried-trump-could-be-americas-hitler-ac/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth McLaughlin",
  "authorUrl": "https://www.washingtontimes.com/staff/seth-mclaughlin/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Trump is the fruit of the party’s collective neglect … I go back and forth between thinking Trump is a cynical a——— like Nixon who wouldn’t be that bad (and might even provide useful) or that he’s America’s Hitler.”\nMr. Vance concluded his text: “How’s that for discouraging?”\nMr. Vance has been open about his change of heart regarding Mr. Trump, whom he criticized on a number of occasions in 2016, and the Vance campaign downplayed the text Monday on those grounds as “old news.”\n“It’s laughable that the media treats JD not liking Trump 6 years ago as some sort of breaking news, when they’ve already covered it to death since this race began,” campaign manager Jordan Wiggins said.",
    "Vance’s former law school roommate on Monday shared a screenshot of a text from 2016 in which the U.S. Senate candidate said Donald Trump could be “America’s Hitler.”\nGeorgia state Rep. Josh McLaurin, who roomed with Mr. Vance for a year at Yale University, shared a text from Mr. Vance saying “the public deserves to know the magnitude of this guy’s bad faith.”\nMr. Vance recently won Mr. Trump’s coveted endorsement in the Republican primary for Ohio’s U.S. Senate seat.",
    "“Clearly, President Trump trusts that JD is a genuine convert, as out of all the Republican candidates running, he endorsed JD and concluded that he is the strongest America First conservative in the race.”\n“Despite the leftwing media’s obsession with this old news, JD is proud to have President Trump’s support and will stand with him to fight back against the radical left and the establishment RINOs as Ohio’s next Senator,” Mr. Wiggins said.",
    "“We are, whether we like it or not, the party of lower-income, lower-education white people, and I have been saying for a long time that we need to offer those people something (and hell, maybe even expand our appeal to working class black people in the process) or a demagogue would,” he said.",
    "is the most likely to take out the weak, but dangerous, Democrat opponent — dangerous because they will have so much money to spend.”\nThe winner of the GOP primary is expected to square off against Democratic Rep. Tim Ryan in the general election.",
    "“This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race — they’ve said great things about ‘Trump’ and, like me, they love Ohio and love our Country,” Mr. Trump said.",
    "Mr. Trump rewarded Mr. Vance on Friday with his endorsement, giving him bragging rights in a GOP primary race where several of his rivals — Josh Mandel, Mike Gibbons and Jane Timken — have wrestled for the Trump mantle.",
    "is the conservative outsider who will continue Trump’s fight to secure our borders, protect the unborn, get rid of the corrupt politicians and stop Joe Biden,” the narrator says in the ad.",
    "“I’m not surprised by Trump’s rise, and I think the entire party has only itself to blame,” Mr. Vance said in the leaked screenshot.",
    "Mr. Vance touted Mr. Trump’s endorsement in a new television ad released Monday.",
    "“Trump fought back and so have I,” Mr. Vance says in the spot.",
    "“I’ve studied this race closely and I think J.D.",
    "“Now I will take our fight to the U.S. Senate.”",
    "“We are now at that point,” Mr. Vance said.",
    "“J.D.",
    "J.D."
  ]
}