{
  "id": 5711,
  "mediaId": 2883,
  "date": "2022-04-18",
  "headline": "Senate Democrats raise money furiously to defend majority",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/04/PAPOL808_041622.jpg",
  "link": "https://rollcall.com/2022/04/18/senate-democrats-raise-money-furiously-to-defend-majority/",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Ellen McIntire",
  "authorUrl": "https://www.rollcall.com/author/mary-ellen-mcintire/",
  "termIds": [
    1727,
    2137,
    2459,
    3026,
    3005,
    4080,
    3401,
    1489,
    388,
    6175
  ],
  "sentences": [
    "“While Republicans’ flawed candidates attack each other in brutal, expensive primaries, Senate Democrats’ record-setting fundraising demonstrates the strong grassroots support behind our campaigns – and the enthusiasm for Democrats' work to cut costs for working families and fight back against the GOP agenda of higher taxes, higher health care costs, and an end to Medicare and Social Security,” said Eli Cousin, a spokesperson for the Democratic Senatorial Campaign Committee.",
    "“We’re seeing that reflected in many Republican candidates’ fundraising reports from this quarter, and it will give them the ability to litigate the records of Democratic candidates and hold them accountable for their votes and stances enabling Joe Biden’s disastrous policies.”\nAlaska Sen. Lisa Murkowski outraised her primary challenger, Kelly Tshibaka, raising $1.6 million to her $673,000.",
    "Wisconsin Sen. Ron Johnson raised $5.9 million and had $3.6 million on hand, which is more than his potential Democratic opponents have in the bank and a significant increase over his fundraising efforts in the last quarter of 2021, when he reported just over $700,000 in receipts.",
    "“We’re seeing tremendous enthusiasm across the country to take back the Senate,” said Jack Pandol, communications director for the Senate Leadership Fund, a super PAC affiliated with Senate Minority Leader Mitch McConnell.",
    "Open seats competitive\nDonors and some of the candidates put up millions for the pursuit of open seats caused by the retirements of Republican senators in Alabama, Missouri, North Carolina, Ohio and Pennsylvania.",
    "Among the Democrats vying to challenge Johnson, Milwaukee Bucks executive Alex Lasry raised $3.9 million, including a personal loan to his campaign of $3.5 million, and he had $997,000 on hand.",
    "Major General Michael McGuire raised $1.1 million, including a $750,000 loan for $994,000 in cash on hand, while state Attorney General Mark Brnovich raised $736,000 and had $529,000 on hand.",
    "The highest fundraiser in the GOP primary to take him on, Jim Lamon, a former Army officer and businessman, reported having $7.2 million on hand, including a $5 million loan to his campaign.",
    "Senate Democrats built up their war chests this quarter, including candidates who don’t face primary challengers but will contend in some of the most closely watched elections in November.",
    "With Democrats controlling a 50-50 Senate only because of Vice President Kamala Harris' power to break ties, the loss of one seat in November would give the GOP the majority.",
    "Retired Army Brigadier Gen. Don Bolduc raised $105,000 and had $82,000 on hand, while former Londonderry town manager Kevin Smith raised $409,000 and had $312,000 on hand.",
    "And in New Hampshire, Sen. Maggie Hassan outraised her potential Republican opponents, with $4.3 million in receipts bringing her total cash on hand to $7.6 million.",
    "In Missouri, where there’s a competitive Republican primary, state Sen. Dave Schatz raised $1.1 million with a $1 million loan and had $2.1 million on hand.",
    "Mandela Barnes raised $1.7 million and also had $1.6 million on hand, while Outagamie County Executive Tom Nelson raised $224,000 and had $550,000 on hand.",
    "Rep. Mo Brooks, who was endorsed by Trump before the former president rescinded the endorsement last month, raised $564,000 and had $1.6 million on hand.",
    "In North Carolina, former state Supreme Court Chief Justice Cheri Beasley, a Democrat, raised $3.7 million, bringing her cash on hand to $5.1 million.",
    "Democrats argue that their opponents face more bruising primaires than their candidates, which could hurt Republicans ahead of the general election.",
    "McCormick reported loaning $7 million to his campaign, bringing his total raised to $11.3 million and leaving him $1.8 million on hand on March 31.",
    "In Alabama, businessman and Army veteran Mike Durant raised $2.9 million, including a $2.7 million personal loan, and had $4.1 million on hand.",
    "Rep. Vicky Hartzler raised $497,000 and had $1.5 million on hand, while fellow Rep. Billy Long raised $216,000 and had $500,000 on hand.",
    "Scott Sifton dropped out of the race and endorsed beer heiress Trudy Busch Valentine, but reported having raised $124,000 this quarter.",
    "That’s more than double the $5.2 million raised by Herschel Walker, the former football player running in Georgia’s Republican primary.",
    "On the Republican side, hedge fund executive Dave McCormick and former television show host Mehmet Oz both donated to their campaigns.",
    "Oz loaned $5.9 million to his campaign, which helped bring his total raised to $7.6 million and left him with $2.6 million on hand.",
    "Sarah Godlewski, the state treasurer, raised $2.1 million, including a personal loan of $1.5 million, and had $1.6 million on hand.",
    "Vance, who Trump endorsed last week, raised $918,000, including a $600,000 loan, to bring his cash on hand to $1.6 million.",
    "Democratic Rep. Val Demmings, the favorite to challenge Rubio, raised $10.1 million and had $13.2 million in cash on hand.",
    "Jane Timken raised $809,000 and had $1.5 million on hand, while Josh Mandel raised $519,000 and had $2.8 million on hand.",
    "Eric Greitens, who has faced domestic violence accusations, raised $379,000 with a $30,000 loan and had $345,000 on hand.",
    "Michael Gibbons raised $5.3 million, including a $5 million loan and a personal contribution of $150,000 on top of that.",
    "Ohio Democratic Rep. Tim Ryan, the favorite for the Senate nomination, raised $4.1 million and has $6.5 million on hand.",
    "Walker leads the state’s GOP field in fundraising but also faces four other candidates who all raised less than him.",
    "State Senate President Chuck Morse, the top Republican fundraiser, brought in $750,000 and had $672,000 on hand.",
    "Former Rep. Mark Walker raised $105,000, while Marjorie Eastman raised $372,000, which included a $160,000 loan.",
    "John Fetterman outraised the Democratic field and had almost double the amount in the bank as Rep. Conor Lamb.",
    "Last quarter, Fetterman raised $3.1 million, while Lamb raised $1.8 million and Kenyatta raised $306,000.",
    "Murkowski had $5.3 million in the bank, while Tshibaka, endorsed by Trump, had $968,000 in cash on hand.",
    "Nevada Republican Adam Laxalt reported raising $1.6 million to bring his total on hand to $2.2 million.",
    "In Nevada, Sen. Catherine Cortez Masto raised $4.4 million to bring her cash on hand to $11.1 million.",
    "Rep. Ted Budd raised $1.1 million, bringing his cash on hand to $1.9 million, while former Gov.",
    "Pat McCrory also raised $1.1 million and had $2.2 million on hand ahead of the May 17 primary.",
    "Georgia Sen. Raphael Warnock raised $13.6 million, bringing his cash on hand to $25.6 million.",
    "In Arizona, Sen. Mark Kelly raised $11.4 million to bring his cash on hand to $23.3 million.",
    "Former Senate chief of staff Katie Britt raised $1.4 million and had $3.2 million on hand.",
    "Florida Sen. Marco Rubio raised $5.8 million, bringing his cash on hand to $13.1 million.",
    "Eric Schmitt, the state attorney general, raised $481,000 and had $1.3 million on hand.",
    "Venture capitalist Blake Masters raised $1.2 million and had $2.3 million on hand.",
    "The Republican primary in the Tar Heel State is expected to be more competitive.",
    "Justin Olson raised $50,000, including a $17,000 loan and had $144,000 on hand.",
    "On the Democratic side, Lucas Kunce raised $851,000 and had $942,000 on hand.",
    "Former Army ranger Sam Brown raised $1.2 million and had $680,000 on hand.",
    "Busch Valentine raised $894 between March 23 and the end of the month.",
    "Elvi Gray-Jackson, a Democrat, raised $144,000 in the first quarter.",
    "Fetterman had $4.2 million cash on hand to Lamb’s $2.2 million.",
    "Ahead of the Pennsylvania Senate primary next month, Lt. Gov.",
    "But Republican incumbents also reported strong quarters.",
    "State Sen. Malcolm Kenyatta had $271,000 in the bank.",
    "He ended the quarter with $3.3 million on hand.",
    "The state’s Republican field is more crowded.",
    "Stephanie Akin contributed to this report.",
    "Former Gov.",
    "Lt. Gov.",
    "J.D."
  ]
}