{
  "id": 621,
  "mediaId": 8278,
  "date": "2022-02-23",
  "headline": "Lawmakers Urge Sanctions against Russia",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/02/ukraine.jpg",
  "link": "https://businessjournaldaily.com/lawmakers-urge-sanctions-against-russia/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Our European allies have begun implementing sanctions and ours must go further in holding President Putin and Russian entities accountable for their illegal actions.”\nU.S. Rep. Tim Ryan, D-13 Ohio, called Putin a “tyrant and a thug who, in league with his allies in the Chinese Communist Party, intends to undermine democracy and freedom in Europe and around the world” in a separate news release.",
    "“When Russia illegally annexed Crimea and essentially occupied the Donbas eight years ago, the United States and our allies west did not impose the kind of strong sanctions that were needed to create a deterrent to Russian malign actions,” Portman, co-chairman of the Senate Ukraine Caucus he said.",
    "“He’ll make the same argument that they were part of the old Soviet Union.”\nThe United States has made clear that its response to any incursion will be “painful” sanctions aimed at Russian oil companies and banks, as well as at Putin and the oligarchs that surround him, he said.",
    "“People tell me Putin likely would already have invaded of not for his concern bout what the sanctions are going to do to him personally, maybe even to the stability of his government,” he said.",
    "Brown weighed in on the Ukraine situation in response to reporters’ questions during a visit to Youngstown to discuss mass transit funding provided by the infrastructure Investment and Jobs Act.",
    "Rob Portman, R-Ohio, encouraged the Biden administration in a news release to impose “devastating sanctions” on Russia to deter further military operations against Ukraine, a U.S. ally.",
    "“We are also working with our European allies to ensure Ukraine’s military has the equipment and resources to defend itself.”\nCopyright 2022 The Business Journal, Youngstown, Ohio.",
    "“The United States must stand in solidarity with Ukraine by immediately imposing crippling sanctions that will be devastating to Putin’s interests,” he said.",
    "YOUNGSTOWN, Ohio — Russian president Vladimir Putin won’t stop at Ukraine if Russia fully invades its neighboring country, U.S. Sen. Sherrod Brown warns.",
    "Putin has said that the Soviet Union’s dismantling was “the worst thing that’s happened” to the Soviet empire in his lifetime, Brown, D-Ohio, said.",
    "“We know if he takes Ukraine, he’ll probably look at the Baltic states,” he continued.",
    "“He certainly has designs on more,” he remarked during the midday visit.",
    "Brown’s colleague, U.S. Sen."
  ]
}