{
  "id": 7072,
  "mediaId": 8322,
  "date": "2022-04-05",
  "headline": "JD Vance hits Biden on immigration in $1 million Ohio ad buy as president set to roll back Title 42",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/01/JD-Vance-Middletown-Ohio-July-1-2021.jpg",
  "link": "https://www.foxnews.com/politics/ohio-jd-vance-biden-immigration-border-wall-title-42",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    4306,
    4905,
    1819,
    1900,
    2765,
    1126,
    392,
    6474
  ],
  "sentences": [
    "REPUBLICAN STATES SUE TO STOP BIDEN ADMIN'S LIFTING OF TITLE 42 BORDER POLICY\nThe message in the 30-second spot largely fits with the central, nationalistic message of Vance's campaign, which includes closing the border and focusing on domestic U.S. issues rather than foreign entanglements.",
    "CRUZ ENDORSES MANDEL IN OHIO'S CROWDED AND COMBUSTABLE GOP SENATE PRIMARY\nThere's been a massive influx of migrants at the southern border since Biden entered office, which Republicans largely attribute to Biden's softer immigration stance than former President Trump.",
    "Vance is spending $1 million on a statewide ad buy attacking President Biden for the border crisis – just as Biden rescinds COVID-era policy that has been used to expel most migrants since 2020.",
    "A Fox News Poll conducted early last month showed investment banker Mike Gibbons leading the race 22% over former state Treasurer Josh Mandel, who registered at 20%.",
    "The Trump administration announced the policy in March 2020 in response to COVID-19, allowing rapid expulsion of aliens coming to the southern U.S. border.",
    "But Biden will now rescind that policy starting May 23, citing \"current public health conditions and an increased availability of tools to fight COVID-19.\"",
    "Joe Biden's open border is killing Ohioans with more illegal drugs and more Democrat voters pouring into this country,\" Vance said in the ad.",
    "Progressives like Rep. Pramila Jayapal, D-Wash., lauded the Title 42 decision as \"a momentous day for immigrant rights activists.\"",
    "Vance is competing in a crowded May 3 GOP primary that's delivered no shortage of drama and animosity among the candidates.",
    "The volume of people crossing the border has wreaked havoc on border communities and strained border enforcement agencies.",
    "Despite rolling back many other Trump policies, the Biden administration left in place Title 42 since it came into office.",
    "In his ad, meanwhile, Vance references his mother's battle with addiction to \"the poison coming across our border.\"",
    "And a group of Republican state attorneys general are suing the Biden administration to keep Title 42 in place.",
    "But Vance's campaign says it has momentum after their candidate's performance at several recent debates.",
    "The winner of the GOP primary will likely face Rep. Tim Ryan, D-Ohio, in the general election.",
    "But Democrats like Sen. Joe Manchin, D-W.Va., are calling the move by Biden \"frightening.\"",
    "Vance came in third at 11% ahead of a handful of other candidates in the single-digits.",
    "\"The media calls us racist for wanting to build Trump's wall.",
    "\"Whatever they call us, we will put America first,\" he adds.",
    "They censor us, but it doesn't change the truth.",
    "Fox News' Adam Shaw contributed to this report.",
    "FIRST ON FOX – GOP Ohio Senate candidate J.D.",
    "Vance says in a provocative open to the ad.",
    "Do you hate Mexicans?\"",
    "\"Are you a racist?"
  ]
}