{
  "id": 7428,
  "mediaId": 2726,
  "date": "2022-04-05",
  "headline": "Ohio US Senate candidates called out for racist campaign ads: \"Do you hate Mexicans?\"",
  "image": "https://i.insider.com/618994c7326b26001835526e?width=1200&format=jpeg",
  "link": "https://www.insider.com/top-ohio-us-senate-candidates-called-out-racist-campaign-ads-2022-4",
  "mediaOutlet": "thisisinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DeArbea Walker",
  "authorUrl": "https://www.insider.com/author/de-arbea-walker",
  "termIds": [
    4905,
    1819,
    4306,
    1489,
    394,
    6383,
    6474
  ],
  "sentences": [
    "\"I've spent my entire career sounding the alarm on China, who — thanks to a concerted strategy by their Communist government that has included currency manipulation, intellectual property theft, and artificially depressed wages, use of child labor, and brutal working conditions — has been our greatest economic adversary for 40 years,\" Ryan said in a statement first provided to NBC News.",
    "Asian American organizers have said Ryan's ad is Sinophobic and shifts blame away from the US policies that led to a drop in US manufacturing jobs and onto a foreign \"bogeyman.\"",
    "Another ad released by Democratic Representative, Tim Ryan — who is also running for the open Senate seat — has been called out for stoking anti-Asian sentiment.",
    "The AAPI Victory fund said that Ryan's ad targets Asian American communities at a time when they already feel increased anxiety because of a rise in hate crimes.",
    "AAPI Victory Fund released a statement saying that Ryan's ad is particularly dangerous at a time when hate crimes against Asian Americans are on the rise.",
    "Conservative commentator and author JD Vance released an ad on Tuesday, April 5, that has been called out for provoking racism toward Mexicans.",
    "Vance goes on to falsely accuse Joe Biden of having an \"open border\" that is \"killing Ohioans\" and leading to an increase in Democratic voters.",
    "According to Fox News, Vance is spending $1 million throughout the state to air the ad leading up to the Republican primary on May 3, 2022.",
    "Democrat Tim Ryan and Republican JD Vance unsubstantiatedly blame China and Mexico respectively for social issues within their state.",
    "The lead contenders in Ohio's US Senate race released campaign ads targeting the Chinese and Mexican communities.",
    "New campaign ads from two top contenders in the Ohio US Senate race has communities of color calling foul.",
    "He also claims to have \"nearly lost\" his mother because of the \"poison coming across our border.\"",
    "The ad, titled \"One word: China,\" baselessly accuses China of taking jobs from Ohioans.",
    "The media calls us racist for wanting to build Trump's wall,\" Vance says in the ad.",
    "The Republican candidate is vying to take over outgoing Senator Rob Portman's seat.",
    "Ohioians and Mexican Americans have called Vance out for the racist ad.",
    "Many highlighted that Ohio is only 4.4% Hispanic or Latino.",
    "It is us versus China,\" Ryan says in the ad.",
    "It's definitely China.",
    "Do you hate Mexicans?",
    "Workers are losing. \"",
    "\"Are you a racist?",
    "\"China's winning.",
    "One word China.",
    "\"China."
  ]
}