{
  "id": 8213,
  "mediaId": 8491,
  "date": "2022-04-06",
  "headline": "Teal ribbons signify support for sexual assault victims in Brookfield",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/04/brookfield-police-cruiser-teal-ribbon.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/teal-ribbons-signify-support-for-sexual-assault-victims-in-brookfield/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nadine Grimley",
  "authorUrl": "https://www.wkbn.com/author/nadine-grimley/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I just think it’s an issue that really goes under the radar screen but causes a tremendous amount of pain and damage to so many people in our society,” Ryan said.",
    "“I think their main purpose is just to try to get some conversation with people so it brings more attention to it,” said Brookfield Police Chief Daniel Faustino.",
    "BROOKFIELD, Ohio (WKBN) – A local police department is taking part in an effort to raise awareness while showing support for victims of sexual assault.",
    "It may be simple — a ribbon tied to an antenna, but what it signifies means so much more: support for victims while raising awareness.",
    "Throughout the month of April, you’ll see teal ribbons on Brookfield’s police cruisers to recognize Sexual Assault Awareness Month.",
    "Where each year, Trumbull County’s Rape Crisis Team delivers ribbons to law enforcement agencies within the county.",
    "In a tweet on Tuesday, he reminded followers about the role each person plays in putting a stop to sexual assault.",
    "“Those being visible maybe gets people to talk about sexual violence a little bit more.",
    "It’s all a part of the “Operation Law Enforcement & the Rape Crisis Team” project.",
    "It maybe coaxes people to report something they may not report,” he said.",
    "Congressman Tim Ryan is doing his part to raise awareness too.",
    "Faustino says Brookfield participates every year."
  ]
}