{
  "id": 8584,
  "mediaId": 8324,
  "date": "2022-04-08",
  "headline": "Community Calendar",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/38/2022/04/web1_calendar-28850138-2.jpg",
  "link": "https://www.galioninquirer.com/news/73834/community-calendar-21",
  "mediaOutlet": "Galion Inquirer",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Galion Inquirer",
  "authorUrl": "https://www.galioninquirer.com/author/englewoodindependent-2-9",
  "termIds": [
    1819,
    1760,
    2736,
    6017,
    6173
  ],
  "sentences": [
    "For information, go to the district website www.galionschools.org\nCity council police, fire, health committee meets April 21\nGalion council committee will meet at 7 p.m. on Thursday in Council Chambers at the Municipal Building, 301 Harding Way East.",
    "Economic Development Committee meeting April 19\nThe Galion City Council Economic Development and Airport Committee will meet at 7 p.m. on Tuesday in Council Chambers at the Municipal Building, 301 Harding Way East.",
    "Candidate Tim Ryan at Bucyrus library April 11\nCongressman Tim Ryan, who is running for the Democratic nomination for U.S. Senate, will be at the Bucyrus Public Library at 3 p.m. Monday, April 11.",
    "Crawford County Board of DD meets April 21\nThe Crawford County Board of DD will hold their regular board meeting on Thursday at 7 p.m. in the board room at 1630 E. Southern Avenue, Bucyrus, Ohio.",
    "Northmor Local Schools BOE meets April 19\nThe Northmor Local School District Board of Education will meet at 5:30 p.m. on Tuesday, April 19 in the board office at 5247 County Road 29, Galion.",
    "Crestline Schools BOE meets April 11\nThe Crestline Exempted Village School District Board of Education will meet at 5:30 p.m. on Monday, April 11 in the Crestline High School cafetorium.",
    "Streets, alleys, trees, bridges meets April 14\nGalion council committee will meet at 7 p.m. on Thursday in Council Chambers at the Municipal Building, 301 Harding Way East.",
    "Galion Schools BOE meets April 19\nThe Galion City School District Board of Education will meet at 6:30 p.m. on Tuesday, April 19 in the Galion Middle School computer lab.",
    "City Council meets April 26\nGalion City Council will conduct its regular meeting at 7 p.m. in Council Chambers at the Municipal Building, 301 Harding Way East.",
    "City Council meets April 12\nGalion City Council will conduct its regular meeting at 7 p.m. in Council Chambers at the Municipal Building, 301 Harding Way East.",
    "American Legion Post 243 will meet April 11\nGalion Post 243 will have a meeting on April 11 at 8 p.m. for the election of officers for the following year.",
    "Galion Board of Health meets April 12\nThe Galion Board of Health will meet at 5 p.m. at the Health Department office, 113 Harding Way East, Galion.",
    "Food Pantry open April 16\nSt. Paul United Methodist Church’s Monthly Food Pantry, Saturday, April 16, from 9 to 11 a.m.",
    "For information, go to the city’s website galion.city or contact the clerk of council at 419-468-9557.",
    "For information, go to the city’s website galion.city or contact the clerk of council at 419-468-9557.",
    "For information, go to the city’s website galion.city or contact the clerk of council at 419-468-9557.",
    "If you have served honorably any time in the service, you are eligible to become a member.",
    "Parks committee meets April 13\nCity Council Parks committee meets at East Park at 7 p.m.",
    "For information, go to the district’s website www.crestlinebulldogs.org.",
    "The meeting will be livestreamed on The City of Galion Facebook page.",
    "The meeting will be livestreamed on The City of Galion Facebook page.",
    "The meeting will be livestreamed on The City of Galion Facebook page.",
    "For information, go to the district’s website www.knightpride.org.",
    "Please bring a photo ID and proof of residency in Crawford County.",
    "Use galnews@aimmediamidwest.com to submit your calendar items.",
    "For more information call 419-468-1208 or 419-571-9170.",
    "Ryan is vying for the seat currently held by Sen.",
    "Rob Portman, who is not seeking re-election.",
    "The post is also accepting new members.",
    "The public is invited to attend."
  ]
}