{
  "id": 8819,
  "mediaId": 8497,
  "date": "2022-04-06",
  "headline": "Ohio US Senate debate: Where candidates stand on second amendment",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/copy-of-diagird-template-7-1649186143.png?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-us-senate-debate-republicans-jane-timken-j-d-vance-matt-dolan-mike-gibbons-josh-mandel/39653247",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    5581,
    4839,
    3947,
    2290,
    2684,
    1489,
    789,
    6474,
    6201
  ],
  "sentences": [
    "But the reality is - I'm the only one up on this stage who's got the guts to say that if somebody is determined mentally ill by a court of law and a doctor that person maybe should not have firearms until they get help,\" Matt Dolan said.",
    "But I'm the only one who is up here, defending and fighting for Joe Deters, the Hamilton County prosecutor to be re-elected, who was, by the way, attacked and challenged by a George Soros-backed candidate,\" Jane Timken.",
    "One of the questions asked was what they would do about rising crime rates and about whether they supported Ohio's new gun law eliminating Ohio's concealed weapon permit requirement.",
    "Candidates also spoke about their thoughts on diversity and reaching minority voters, inflation and how they would be a senator for all Ohioans even if you didn't vote for them.",
    "If half of these people who got in trouble with the police just knew the words 'yes, sir' and 'no, sir,' none of these problems would have ever occurred,\" Mike Gibbons said.",
    "Five Republican candidates took the stage last night for a debate hosted by WLWT and Miami University for their last chance to speak to voters and try and win you over.",
    "\"I voted for the permitless carry, working with the police to make some changes so that if you lie to the police, you're going to be held more accountable.",
    "And two, a very destructive set of policies, funded by a guy named George Soros to elect radical prosecutors all over towns and cities across this country.",
    "\"I also do not believe that anyone watching at home or in this auditorium tonight should need a license, be required to have a license to carry a firearm.",
    "Vance, Matt Dolan, Mike Gibbons and Josh Mandel, shared their stances on topics ranging from war in Ukraine to critical race theory.",
    "\"It's time we get back to where we treat criminals like criminals and police officers like the heroes they are.",
    "We all already have that license; it's called the second amendment to the constitution,\" Josh Mandel said.",
    "OXFORD, Ohio —\nOhioans are once again heading to the polls Tuesday on the second day of early voting.",
    "It was done by enforcement by the police, by where the average individual respected a policeman.",
    "Here's what they had to say:\n\"Crime fell dramatically from the '90s until just a few years ago.",
    "One of the most-watched races in the county the senate seat here in Ohio.",
    "Also, there's a lot of talk about defending the second amendment.",
    "One, because of the 'defund the police' movement from the left.",
    "And those prosecutors let people out on $100 cash bail,\" J.D.",
    "Why we had a massive increase in crime.",
    "The five candidates, Jane Timken, J.D.",
    "\"What has happened in this country.",
    "We have a problem right now.",
    "Vance said.",
    "I get it."
  ]
}