{
  "id": 9024,
  "mediaId": 2540,
  "date": "2022-03-27",
  "headline": "The 10 Senate seats most likely to flip in 2022",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220326204124-senate-race-rankings-march-elections-super-tease.jpg",
  "link": "https://www.cnn.com/2022/03/27/politics/senate-race-rankings-march-elections/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Simone Pathe",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The most vulnerable Democratic Senate incumbents -- Raphael Warnock of Georgia, Mark Kelly of Arizona, Catherine Cortez Masto of Nevada and Maggie Hassan of New Hampshire -- have tried to get ahead of the inevitable GOP attacks by introducing legislation that would suspend the federal gas tax through the end of the year.",
    "Nevada\nIncumbent: Democrat Catherine Cortez Masto\nSen. Catherine Cortez Masto is running ads featuring hospitality and restaurant workers touting her pandemic recovery efforts -- another Democratic incumbent who's using her campaign coffers to go up with positive spots while she has the airwaves to herself.",
    "It's a tactic that House Democrats successfully used against the GOP in 2018, when they tied even Republicans who had voted against repealing Obamacare to that effort, and that Republicans used against Democrats in 2020 in linking the entire party to the \"defund the police\" movement.",
    "But attacks from his primary rivals and recent negative headlines over his business record could preview some of the scrutiny to come in the general election as Democrats gear up to face a first-time candidate whom much of the GOP establishment was bad mouthing this time last year.",
    "Democrats are hopeful that a Black woman who's previously been elected statewide will help mitigate the turnout problem they've often faced in North Carolina, especially in midterm years, but that may not be enough to overcome any anti-Democratic headwinds in a Trump state.",
    "The former Democratic Senatorial Campaign Committee chair hasn't raised nearly as much money as two of her higher-profile colleagues up for reelection (Warnock and Kelly) and has less recent experience trying to distance herself from the national party when facing voters.",
    "(CNN)The war in Ukraine has shifted attention overseas, but even if President Joe Biden's approval has ticked up nominally, the national environment heading into the 2022 midterms still looks treacherous for his fellow Democrats as they try to hold their Senate majority.",
    "Former Rep. Mark Walker and combat veteran Marjorie K. Eastman are still in the race but even if they peel some votes away from Budd or McCrory, it may not be enough to spoil an outright victory since the threshold needed to avoid a primary runoff is only 30%.",
    "But, given how much the GOP primary is pushing candidates toward Trump in a state Biden won (and all the millions of dollars putting that message in front of voters), this Democratic pickup opportunity is still the most likely to change party hands.",
    "Democrats think New Hampshire is one state where the abortion issue may prove to be particularly salient if the Supreme Court overturns Roe v. Wade this year, because of the higher concentration of college-educated voters in the Granite State.",
    "Venture capitalist Blake Masters picked up the backing of the anti-tax Club for Growth and already had the support of a super PAC funded by tech entrepreneur Peter Thiel, his onetime boss, so he's not suffering for lack of outside assistance.",
    "Two of his challengers who have poured their own money into their campaigns -- Milwaukee Bucks executive Alex Lasry and state Treasurer Sarah Godlewski -- are on TV, so voters' familiarity with them could grow ahead of the August primary.",
    "Republican candidates and super PACs have spent nearly $40 million in the open-seat race to succeed retiring GOP Sen. Pat Toomey ahead of the May 17 primary, with much of it coming from Mehmet Oz and David McCormick and their allies.",
    "The crowded field of GOP challengers, all jockeying for a Trump endorsement, is pulling the candidates to the right, potentially complicating the eventual nominee's ability to make a general election pivot after the August primary.",
    "And even though she doesn't have a voting record, her judicial record could provide fodder for Republicans to try to paint her as soft on crime, similar to the way they've gone after Jackson since her Supreme Court nomination.",
    "With the GOP primary still in flux, Kelly's using his massive fundraising advantage to run positive spots about infrastructure and his work to address supply chain issues, with Democrats also spending on Spanish-language ads.",
    "But Biden didn't win Nevada by all that much (about 2 points), and in a challenging national environment -- with voters here especially worried about inflation and the economy -- Cortez Masto is likely in for a tough race.",
    "Nearly two-thirds of New Hampshire adults in that UNH poll (which was taken before Biden nominated Ketanji Brown Jackson to the Supreme Court) said they wanted him to pick a justice who would vote to uphold Roe v. Wade.",
    "Democrat Lucas Kunce, a Marine veteran, outraised most of the top GOP candidates as of Dec. 31, 2021, but the Democratic nominee would not have an easy path to victory in a state that backed Trump by 15 points in 2020.",
    "He has impressed with strong fundraising and is on the air with positive spots leaning into his background as a pastor and touting the legislation he's co-sponsored that would temporarily suspend the federal gas tax.",
    "McCrory's first statewide TV ad accused Budd of being \"friendly\" toward Russia, selectively splicing comments the congressman has made about the Russian President, including calling him a \"very intelligent actor.\"",
    "Demings, who has impressed with her fundraising, has a compelling profile -- she's a former Orlando police chief with firsthand experience fighting crime, a detail that appears prominently in her campaign media.",
    "In a sign they're trying to distance themselves from the national party, most of them also sided with Republicans on a recent vote to overturn the requirement that passengers wear masks on public transportation.",
    "Oz and allies of the former daytime host have attacked McCormick, a former hedge fund executive, as a \"Wall Street insider\" and said he \"invested billions in China,\" while casting Oz as an outsider like Trump.",
    "That would only give Republicans more time for the kinds of attacks that have made this a topsy-turvy race, with poll leads fluctuating depending on who's on the receiving end of the most televised vitriol.",
    "As CNN's Gabby Orr reported, Trump has expressed concern about the general election viability of Mandel and is hung up about critical things \"Hillbilly Elegy\" author JD Vance has said about him in the past.",
    "Much to Senate Minority Leader Mitch McConnell's chagrin, the chair of the GOP committee charged with flipping the Senate recently released an 11-point plan that calls for all Americans to pay income tax.",
    "But regardless of how badly dinged the eventual nominee emerges from the primary, he or she will start with the advantage for this open seat in an increasingly red state that Trump twice won by 8 points.",
    "Expect Democrats to tie all Republicans, even those who have disavowed the tax proposal, to Florida Sen. Rick Scott's plan (released by his campaign, not the National Republican Senatorial Committee).",
    "But even with an untested likely opponent and a fundraising prowess that bests longer-serving Democratic incumbents on this list, Warnock is highly vulnerable because of the fundamentals of Georgia.",
    "Later in the week, Trump, who had previously left the door open to endorsing Greitens, gave US Rep. Billy Long reason to hope when he issued a positive statement about the former auctioneer.",
    "John Fetterman and US Rep. Conor Lamb, both from Western Pennsylvania, are on the air, mostly with positive bio spots that give the primary a noticeably different tone than the GOP contest.",
    "Voters may know him more recently for serving as Trump's state campaign co-chair and echoing his election fraud claims, which Democrats point to in calling Laxalt too extreme for the state.",
    "Wisconsin\nIncumbent: Republican Ron Johnson\nAs the only Republican running for reelection in a state Biden won in 2020, Sen. Ron Johnson remains the most vulnerable GOP incumbent this year.",
    "Florida\nIncumbent: Republican Marco Rubio\nGOP Sen. Marco Rubio, who's likely to face Democratic Rep. Val Demings in the fall, starts this race ahead in a state that Trump carried twice.",
    "A Marquette University Law School poll conducted at the end of February found that 45% of registered Wisconsin voters had an unfavorable view of him with only 33% seeing him favorably.",
    "That's a debate Democrats are happy to have after running on defending Obamacare in the 2018 midterms, when the law was much more popular than when Johnson last faced voters, in 2016.",
    "Two seats have traded places on the latest list, however, which underscores the difficult environment for Democrats: New Hampshire slides above North Carolina as more likely to flip.",
    "By far the biggest motif in GOP advertising isn't Russia, but something a little closer to home, although still some 1,500 miles away from Ohio -- the US southern border with Mexico.",
    "Establishing their own brands in their states, independent of Biden, will be a challenge for Democrats running in November if the President's approval rating remains in the low 40s.",
    "Trump has yet to weigh in after his chosen candidate dropped out in November, which is fueling even more spending as Republicans try to prove their loyalty to the former President.",
    "There's still time for these relatively unknown candidates to introduce themselves, but a September primary also doesn't give them much time to position for the general election.",
    "Fifty-five percent of New Hampshire adults disapproved of Biden's job performance while 43% approved, according to a University of New Hampshire poll conducted in late February.",
    "The paid media (i.e., television advertising) portion of the campaign is just taking off in many of these races, so we'll see how much that message sticks in the months to come.",
    "Former state Attorney General Adam Laxalt, who has the backing of Trump and McConnell, is expected to win the June Republican primary, but he still faces a well-funded opponent.",
    "Like Warnock, Kelly overperformed Biden in 2020, but the national environment has gotten worse for Democrats since and they cannot count on presidential-level turnout this year.",
    "North Carolina\nIncumbent: Republican Richard Burr (retiring)\nTrump took sides in the GOP primary in June, but his chosen candidate, US Rep. Ted Budd, hasn't cleared the field.",
    "The worsening headlines for Greitens could cause more Democrats to take another look at the race, but there's not much time before the candidate filing deadline on March 29.",
    "Turnout will be a crucial question in a midterm year, but in that regard, Democrats are excited that Stacey Abrams' candidacy for governor may help energize nonwhite voters.",
    "Democrats point to the pandemic and stuck supply chains for the current inflation woes, blaming corporations for pocketing profits while Americans pay the price at the pump.",
    "The club responded with an ad calling McCrory's attack a \"low-down, dirty hit job\" and surfacing footage of Budd calling Putin \"evil\" and expressing support for Ukraine.",
    "Doug Ducey said (again) that he would not run for Senate, which was a major relief for Democrats as Sen. Mark Kelly runs for a full six-year term in the purple state.",
    "Businessman Mike Gibbons and former state Treasurer Josh Mandel led the pack in a Fox poll conducted in early March, with a quarter of GOP primary voters undecided.",
    "Georgia\nIncumbent: Democrat Raphael Warnock\nDemocratic Sen. Raphael Warnock is running for a full six-year term after winning a special election runoff last year.",
    "(Johnson later issued a clarifying statement, saying he he did not mean to suggest that repealing and replacing Obamacare should be a top priority for his party.)",
    "Those pains got more intense when Greitens' ex-wife alleged he was physically abusive toward his children and her, according to court documents filed last week.",
    "But given Biden's low approval rating and a sour national mood, even a Republican with a much lower profile than Sununu should be able to keep this one close.",
    "Democrats were ecstatic that Johnson decided to break a pledge to serve only two terms, and they see political hay in his penchant for controversial remarks.",
    "The ranking is based on CNN's reporting and fundraising and advertising data, as well as historical data about how states and candidates have performed.",
    "As the GOP field has grown, the Democratic one has thinned with Val Arkoosh -- a doctor and the only woman in the primary -- dropping out in February.",
    "Ohio\nIncumbent: Republican Rob Portman (retiring)\nThe Buckeye State is playing host to one of the nastiest Republican primaries of the election cycle.",
    "New Hampshire\nIncumbent: Democrat Maggie Hassan\nDemocratic Sen. Maggie Hassan is in for a competitive race, even without a challenge from GOP Gov.",
    "State Attorney General Mark Brnovich is seen as the GOP front-runner, considering he's already won statewide, but he's struggled with fundraising.",
    "Solar energy entrepreneur Jim Lamon, who had loaned his campaign $8 million by the end 2021, is up with plenty of ads talking about immigration.",
    "Laxalt is the grandson of a former governor and senator with the same last name, but he lost his most recent election, the 2018 governor's race.",
    "And while Biden narrowly carried the Badger State, his approval rating is at 43% (with 52% disapproving), according to the same Marquette poll.",
    "McCormick and his allies have tried to tie Oz to Oprah Winfrey, Hollywood and former first lady Michelle Obama and say he \"promoted Obamacare.\"",
    "\"He's loved by, especially, the conservative wing of the party — highly respected guy,\" Trump told the Washington Examiner earlier this month.",
    "His primary opponents immediately called for him to drop out of the race, with some members of GOP leadership in Washington, DC, echoing that.",
    "Just how competitive November's race is, however, may depend on what kind of campaigns Republicans Chuck Morse and Kevin Smith put together.",
    "Ratings for 2022 Senate elections\nDespite those obstacles, the Senate seat most likely to flip is still a pickup opportunity for Democrats.",
    "Budd has had plenty of help on the airwaves from the political arm of the Club for Growth, which has spent millions attacking former Gov.",
    "The Club for Growth's political arm, which is backing Mandel, has tried tying Timken to Russia, but she has the backing of retiring Sen.",
    "Those may be difficult numbers for Hassan, a first-term senator, to overcome in an era when Senate races are increasingly nationalized.",
    "The current ratings from Inside Elections forecast competitive races in eight states, including tossups in Arizona, Georgia and Nevada.",
    "Former NFL star Herschel Walker is the prohibitive Republican favorite in the May 24 primary, with both McConnell and Trump behind him.",
    "Her campaign and Democratic outside groups are also running Spanish-language ads -- an important early investment in the Silver State.",
    "Businessman Jeff Bartos, former US ambassador to Denmark Carla Sands and political commentator Kathy Barnette all drew single digits.",
    "(Ohio has a significant Ukrainian American population, although Portman's is not an endorsement that would go over well with Trump.)",
    "\"Have the great people of Missouri been considering the big, loud, and proud personality of Congressman Billy Long for the Senate?\"",
    "(Former Sen. Martha McSally, whom Kelly defeated in a 2020 special election, struggled with this dynamic in her races for Senate.)",
    "She won with about 47% of the vote in 2016, underperforming Hillary Clinton, to become the first Latina elected to the US Senate.",
    "The bottom line here is that both parties think the other side's primary will take the eventual nominee too far to the extremes.",
    "His campaign has attacked Biden and Democrats for not doing more to increase domestic oil production amid a surge in gas prices.",
    "The war in Ukraine has brought plenty of earned media opportunities for the vice chairman of the Senate Intelligence Committee.",
    "Mandela Barnes, whom the Marquette poll found in the lead among Democratic primary voters with 23%, was unknown to 53% of them.",
    "Pennsylvania has led this list since its incarnation -- a testament to it being an open seat in a state Biden carried in 2020.",
    "(Trump just rescinded his endorsement for the open Senate seat in Alabama, where Rep. Mo Brooks' campaign was underwhelming.)",
    "May primaries in Ohio and Pennsylvania are heating up as GOP candidates jockey for former President Donald Trump's blessing.",
    "And given Biden's sagging approval ratings, the senator will need to maintain -- and grow -- his margins over the President.",
    "McCormick has his own \"fight China\" message and has argued Oz's dual citizenship precludes him from putting \"America first.\"",
    "But Republicans are signaling they will continue to tie her to the national party, even on the issue of rising crime rates.",
    "Eric Greitens winning the GOP nomination was already causing headaches in a red state that has no other reason to go blue.",
    "State Rep. Malcolm Kenyatta, who hails from the vote-rich city, has some significant labor endorsements but is not on TV.",
    "But Lamb has a record of winning tough House races, with his ads touting that he's previously beaten \"the Trump machine.\"",
    "It's possible the May 3 primary will be delayed because of uncertainty over state legislative and congressional maps.",
    "See, for example, his recent call for Republicans to repeal the Affordable Care Act if they win control of Congress.",
    "Sen. Josh Hawley, who called for Greitens to resign as governor in 2018, has already backed US Rep. Vicky Hartzler.",
    "Fetterman is seen as the current front-runner because of his fundraising advantage and statewide name recognition.",
    "Those three states are now represented by Democrats in the Senate and also went for President Joe Biden in 2020.",
    "But Republicans are hammering Democrats for rising inflation, which they argue predates the conflict in Ukraine.",
    "Much of the rhetoric is standard GOP primary fare, enlivened with some quirks from the candidates' biographies.",
    "(There are plenty of similar ads -- he had loaned his campaign more than $11 million by the end of last year.)",
    "The former state Supreme Court chief justice hasn't raised as much money as some Democrats in other races.",
    "Here are the 10 Senate seats most likely to flip with less than eight months to go before Election Day:\n1.",
    "The party in the White House traditionally loses seats during the first midterm of a new president's term.",
    "At the same time, candidates who do have his backing are finding that it doesn't solve all their problems.",
    "And yes, by the numbers, it's the most daunting for Republicans given that Biden carried it by 7 points.",
    "Things got so heated between them at a recent candidate forum that they had to be physically separated.",
    "Arizona\nIncumbent: Democrat Mark Kelly\nThe biggest news in Arizona over the past month is that GOP Gov.",
    "The Democratic field is essentially set, with Cheri Beasley seeing her most viable opponents drop out.",
    "Missouri Attorney General Eric Schmitt held a fundraiser at Mar-a-Lago with Trump earlier this month.",
    "Still, Republicans note that Johnson has been underestimated before and has come from behind to win.",
    "Russian President Vladimir Putin has given Biden a convenient foil on whom to blame high gas prices.",
    "He's backed candidates in two competitive states with May primaries -- Georgia and North Carolina.",
    "(His ads often cut to clips of Oz shaking hands with Trump as he welcomed him on his TV show.)",
    "He narrowly overperformed Biden in 2020, but both won by close margins in this purple state.",
    "Democratic Rep. Tim Ryan faces a primary, too, but he's largely consolidated party support.",
    "The primary isn't until August 2, and so far, there's no sign Greitens is going anywhere.",
    "McCormick led Oz 24% to 15% in a Fox poll of GOP primary voters conducted in early March.",
    "Others in the race include former state GOP chair Jane Timken and state Sen. Matt Dolan.",
    "Yes, the Granite State has gone blue in every federal election in the past six years.",
    "Pennsylvania\nPennsylvania once again tops the list of seats most likely to flip.",
    "Missouri\nIncumbent: Republican Roy Blunt (retiring)\nThe prospect of former Gov.",
    "Lamb has also picked up the endorsement of the Philadelphia Democratic Party.",
    "Republicans have their own challenges, though, mostly candidate-driven.",
    "But nearly a third of primary voters were undecided, per the Fox poll.",
    "\"Let's tell politicians, 'You're fired,'\" he says in one recent spot.",
    "(Oz has since vowed to renounce his Turkish citizenship if elected.)",
    "Gibbons is leaning hard into the outsider businessman persona.",
    "Plenty of other candidates are vying for Trump's backing too.",
    "Rob Portman, the co-chair of the Senate Ukraine Caucus.",
    "The latest back-and-forth in this race is about Putin.",
    "Pat McCrory ahead of the May 17 Republican primary.",
    "Ratings of his handling of the economy were worse.",
    "\"This is not an Endorsement, but I'm just askin'?\"",
    "In November, 34 states will hold Senate elections.",
    "The Democratic field remains largely unknown.",
    "(\"Putin's price hike,\" he has called it.)",
    "(More on that here from CNN's KFile).",
    "So what are all the attacks about?",
    "(Greitens has denied this.)",
    "Chris Sununu.",
    "Even Lt. Gov.",
    "Trump said.",
    "Lt. Gov.",
    "10.",
    "7.",
    "8.",
    "9.",
    "2.",
    "4.",
    "3.",
    "6.",
    "5."
  ]
}