{
  "id": 9032,
  "mediaId": 2573,
  "date": "2022-03-26",
  "headline": "Ohio GOP Senate showdown: Gold Star mother takes aim at Gibbons in new Mandel ad blitz",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Mandel-Gibbons.gif",
  "link": "https://www.foxnews.com/politics/ohio-republican-senate-race-gold-star-mother-gibbons-mandel-ad",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "",
  "termIds": [
    2290,
    2917,
    5207,
    4306,
    1489,
    976,
    1126,
    6067,
    6077,
    6474
  ],
  "sentences": [
    "FIRST ON FOX: A week after nearly coming to blows during a heated face-to-face encounter in the first debate in Ohio’s Republican Senate primary, Josh Mandel is taking aim at rival Mike Gibbons in a new campaign commercial that plays off of their near physical confrontation and alleges that Gibbons insulted the service of military veterans.",
    "Also taking part in the debates are two other major contenders – former Ohio GOP chair Jane Timken, whose husband is the former chairman, CEO and president of his family’s steel manufacturing corporation, and state Sen. Matt Dolan, a former county and state prosecutor whose family owns Major League Baseball’s Cleveland Guardians.",
    "Video of nearly physical confrontation on March 18 at a debate outside of Columbus between Gibbons, a Cleveland entrepreneur, real estate developer and investment banker who’s running a second time for the Senate, and Mandel, a former Ohio treasurer who’s making his third bid for the Senate, quickly went viral.",
    "It’s important that these difficult sacrifices are recognized by our political leaders, and I know U.S. Senate candidate Mike Gibbons is a strong advocate for our service members and their families,\" Gold Star father Gary Ward of Marietta, Ohio told Fox News in a statement.",
    "A Fox News poll conducted March 2-6 – which is the most recent public opinion survey in the race - indicated Gibbons at 22% among like Republican primary voters, with Mandel at 20%, Vance at 11%, Timken at 9%, Dolan at 7%, and nearly a quarter of those surveyed undecided.",
    "Flynn - who briefly served as former President Donald Trump's national security adviser and was a central figure in the Mueller investigation during the Trump presidency, and who was pardoned by Trump after pleading guilty to lying to the F.B.I.",
    "GIBBONS LAUNCHES NEW AD BLITZ TO GIVE VOTERS BEHIND THE SCENES LOOK\nThe two candidates were physically separated by debate moderators, but not before an expletive was uttered by one of the candidates, although it’s not clear who said it.",
    "THE LATEST FOX NEWS POLL IN OHIO'S CROWDED AND COMPETITIVE GOP SENATE PRIMARY\nThe Mandel campaign tells Fox News that they’re spending $750,000 to run the ad – which was shared first with Fox News – for a week statewide on TV in Ohio.",
    "The Mandel campaign said that Mandel has known the Nowacki family since 2005, when he served on the honor guard that escorted Andy’s body from the airport and that conducted the\n21-gun salute and honor ceremony at Andy’s funeral.",
    "THREE TOP OHIO SENATE GOP RIVALS MAKE THEIR CASE TO TRUMP SUPPORTERS AT CPAC\nGibbons, in his statement, when on to charge that \"Josh Mandel’s manufactured outrage is based on a lie as he is desperate, flailing, and losing.\"",
    "They also note that ever since, Mandel has stayed close with the Nowacki family, and that Sheila Nowacki \"felt compelled to speak out on behalf of her son Andy’s legacy\" after hearing Gibbons comments.",
    "The winner of the GOP contest will likely face off in November against longtime Rep. Tim Ryan of northeast Ohio, who’s the frontrunner in a much smaller and less combustible Democratic Senate primary.",
    "Vance, a venture capitalist and best-selling author who also served in the Marines, is another of the top contenders in the GOP Senate primary in Ohio in the race to succeed retiring Republican Sen.",
    "Fast-forward a week and the Mandel campaign on Saturday is launching a new ad that features Sheila Nowacki, a Gold Star mother from Painesville, Ohio whose son Andy was killed in the war in Iraq.",
    "The new ad by the Mandel campaign follows an open letter by 15 veterans who back Mandel that was released on Monday that said they were \"disgusted beyond belief\" with Gibbons comments.",
    "Following the near physical face off at the first debate, Vance accused Mandel of being \"disgraceful\" for what he charged was using the Marine Corps as a \"political football.\"",
    "TIMKEN TOUTS SHE'S ‘TRUMP TOUGH’ IN NEW CAMPAIGN COMMERCIAL\nAnd a day later, retired Lt. Gen. Michael Flynn demanded in a video that Gibbons apologize.",
    "The Ohio primary is currently scheduled for May 3, but a dispute over redistricting may force state lawmakers to move back the date of the contest.",
    "Since the debate confrontation, Gibbons has pushed back against the charges that he was insulting the service of military members and veterans.",
    "\"I’ve met with Mike and can clearly see he has the utmost honor and respect towards our courageous men and women in uniform,\" Ward emphasized.",
    "I understand both the dedication and sacrifices of the men and women in uniform–and that of their families,\" Gibbons said in a statement.",
    "Senator requires an understanding beyond perpetually running for office as Josh Mandel has throughout his adult life,\" Gibbons argued.",
    "The verbal fireworks ignited after Mandel accused Gibbons of \"making millions\" off stock in a Chinese company.",
    "\"Two tours in Iraq,\" Mandel – a Marine veteran – shouted after rising from his seat and moving toward Gibbons.",
    "\"Mike Gibbons has the nerve to say military service doesn’t count as real work,\" Nowacki charges in the spot.",
    "\"As a gold star parent, I know first-hand the hardships faced by military families all over the nation.",
    "\"I have nothing but respect for those who have served, including my opponents Josh Mandel and J.D.",
    "After the debate neither candidate would admit to using the inappropriate and offensive language.",
    "The Gibbons campaign noted that a number of Gold Star parents were supporting their candidate.",
    "\"Gibbons owes Josh and all veterans and those currently in the service an apology\" they wrote.",
    "\"My son is in the U.S. Navy and was deployed to an undisclosed location earlier this month.",
    "Responding, Gibbons dismissively accused Mandel of not understanding how investments work.",
    "Their work is so much more important than Gibbons just making millions for himself.",
    "\"I don't know why you use the Marine Corps every single time you're attacked, Josh.",
    "\"Marines like Josh Mandel, like my son Andy, risked their lives for our country.",
    "It is a fact that Josh Mandel has never worked in the private sector.",
    "\"Back off, buddy, or you’re going to end up — ,\" Gibbons responded.",
    "\"His attacks show he is unhinged and unfit to serve in the Senate.",
    "\"You’ve never been in the private sector in your entire life.",
    "\"No, you’re dealing with the wrong guy,\" Mandel countered.",
    "The Flynn video was first reported by Fox News on Tuesday.",
    "And at the second debate on Monday, Vance said.",
    "For God and country, please vote for Josh.\"",
    "You don’t know squat,\" Gibbons charged.",
    "\"You’re dealing with the wrong dude.\"",
    "\"Don’t tell me I haven’t worked!\"",
    "Josh Mandel came home from Iraq.",
    "My daughter-in-law flies F-18s.",
    "– recently endorsed Mandel.",
    "It's kind of ridiculous.\"",
    "\"You watch what happens.\"",
    "My son didn’t.",
    "Being a U.S.",
    "Rob Portman.",
    "Vance.\""
  ]
}