{
  "id": 9770,
  "mediaId": 2528,
  "date": "2022-03-25",
  "headline": "21 DC power couples who have influenced politics together for years",
  "image": "https://i.insider.com/62473686e22adb0018d1a299?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/ginni-clarence-thomas-text-messages-dc-power-marriages-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kayla Epstein",
  "authorUrl": "https://www.businessinsider.com/author/kayla-epstein",
  "termIds": [
    0
  ],
  "sentences": [
    "Ginni Thomas, a conservative author and activist, is under fire from the left following revelations that she sent a series of text messages in late 2020 and early 2021 to then-White House Chief of Staff Mark Meadows, urging him to fight on behalf of Donald Trump's bid to remain president after losing the election.",
    "Kaplan got his start working in the George W. Bush White House as a deputy chief of staff, and his work for Facebook came under intense scrutiny after journalists revealed Facebook had altered its moderation policies to be more forgiving to Trump and conservative content, even if they violated the rules.",
    "And in the years since, Giffords has dedicated herself to the work of her now-eponymous organization that, through its nonprofit and political action committee arms, advocates against gun violence and \"supports elected officials who step up to fight the gun violence epidemic.\"",
    "Mark Kelly and Gabrielle Giffords\n Mark Kelly leans his head on the shoulder of his wife and former Rep. Gabby Giffords as they attend a news conference asking Congress and the Senate to provide stricter gun control in the United States on March 6, 2013 in Tucson, Arizona.",
    "Mitch McConnell and Elaine Chao\n Sen. Mitch McConnell and Elaine Chao in 2014 Win McNamee/Getty Images\nSenate Minority Leader Mitch McConnell and two-time cabinet secretary Elaine Chao have been married since 1993, making them one of DC's most established power couples.",
    "Her business success has helped make Peters, a Democratic congressman from California, one of the wealthiest members of Congress, with a minimum net worth of nearly $40 million, according to an Insider analysis of federal lawmakers' personal financial disclosures.",
    "John Sciulli/Getty Images for Politicon\nAntony Blinken, who serves as Biden's secretary of State, has his hands full at the moment as the US tries to stamp out a Russian invasion of Ukraine without the war escalating to the point of direct American involvement.",
    "Ritu Khanna, a former product marketing specialist for luxury item brand Bulgari, is also an heir to a family fortune built by her father, Monte Ahuja, the long-time leader of investment firm MURA Holdings and automotive company Transtar Industries.",
    "Susan Molinari and Bill Paxon\n Susan Molinari and Bill Paxon in 1994 Maureen Keating/CQ Roll Call via Getty Images\nThese two former members of Congress have gone on to have powerful and lucrative careers as lobbyists since departing Capitol Hill.",
    "Brendan Hoffman/Getty Images\nA quarter-century after marrying — then-Supreme Court Justice Ruth Bader Ginsburg officiated — Andrea Mitchell and Alan Greenspan remain unrivaled among DC couples bridging the media-government divide.",
    "Tom Williams/CQ-Roll Call, Inc via Getty Images\nPowell McCormick served as Trump's deputy national security counsel during the early months of his administration and is now a partner in Goldman Sachs investment banking division.",
    "Bill Paxon, a five-term Republican congressman from New York who served a stint as National Republican Congressional Committee chairman during the 1990s, was until 2017 a partner at the high profile lobbying firm Akin Gump.",
    "Matt Gaetz, 39, is a Florida congressman who is facing a federal sex trafficking investigation, after accusations emerged that he and his associates may have solicited minors for sex, and trafficked them across state lines.",
    "While his wife's salvos lit up Washington circles, Clarence Thomas, the high court's most reliably conservative member, was hospitalized for days in March fighting an infection until doctors released him on March 25.",
    "Supreme Court Associate Justice Clarence Thomas, right, and wife Virginia \"Ginni\" Thomas arrive for a State Dinner with Australian Prime Minister Scott Morrison and President Donald Trump at the White House in 2019.",
    "They reached the height of their influence during the Trump administration, when the former president appointed Chao to run the Transportation Department and her husband oversaw a Republican majority in the Senate.",
    "Earlier this year, Jamie Raskin violated the Stop Trading on Congressional Knowledge Act's disclosure provisions in February by failing to properly report a massive stock holding and payout for Sarah Bloom Raskin.",
    "She served as Biden's White House senior advisor during the first several months of his administration and is now back at SKDK, her public affairs and political consulting firm for much of the past two decades.",
    "Catherine Russell and Tom Donilon\n Catherine Russell, director of UNICEF Jörg Carstensen/picture alliance via Getty Images\nThese longtime Biden loyalists have seen their stars rise alongside their former boss.",
    "In modern times, however, George Conway is more famous for being the husband of Kellyanne Conway, a Republican pollster who later served as the senior counselor to Donald Trump, a man she previously opposed.",
    "AP Photo/Andrew Harnik\nSure, Pete Buttigieg is the former 2020 presidential candidate who became US secretary of Transportation, and many Democrats expect the 40-year-old to one day occupy the White House.",
    "McConnell, of course, is the shrewd leader of the senate Republicans, who over the past three decades has found myriad ways to stymie Democratic initiatives through filibuster blockades and rule changes.",
    "Matt Rourke/AP\nGeorge Conway is a long-term Republican lawyer who played a key role in the Bill Clinton impeachment that stemmed from the Democratic president's illicit affair with a White House intern.",
    "The Khanna's estimated wealth is well into the tens of millions of dollars, according to Ro Khanna's most recent annual personal financial disclosure, with most of that coming from Ritu Khanna's assets.",
    "Bryan Bedder/Getty Images for Gabrielle's Angel Foundation\nCarville and Matalin have long been Washington's oddest political couple — well before the Conways gave politics an even stranger pairing.",
    "Hillary Clinton remains active on the Democratic fundraising scene, having, for example, appeared in January at a pricey virtual gathering for Rep. Tim Ryan of Ohio, who's running for the Senate.",
    "Greenspan served five terms as chairman of the Federal Reserve in the United States, from 1987 to 2006 and is widely regarded as one of the most consequential financial figures in modern history.",
    "Heidi Cruz, a managing director at Goldman Sachs in Houston, took a leave of absence from her job during the rough-and-tumble Republican 2016 presidential race to work on her husband's campaign.",
    "Bauer played the role of Trump during mock debate sessions Biden conducted ahead of the 2020 presidential debates, and in 2021, he co-wrote the book \"After Trump: Reconstructing the Presidency.\"",
    "Since leaving the White House, the Obamas have published best-selling autobiographies and worked together on a variety of charitable endeavors, many under the auspices of the Obama Foundation.",
    "Clarence Thomas and Ginni Thomas\n Associate Supreme Court Justice Clarence Thomas and his wife and conservative activist Virginia Thomas arrive at the Heritage Foundation on October 21, 2021.",
    "Joshua Lott/Getty Images\nIn the days after a gunman shot Rep. Gabrielle Giffords in the head in January 2011, it wasn't clear whether the Democratic congresswoman from Arizona would survive.",
    "And some Republicans continue to delight in (and raise money off) making the couple a foil while suggesting Hillary Clinton will run for president again in 2024 — even as she says she won't.",
    "Laura Cox Kaplan spent 10 years leading the public policy practice at the accounting powerhouse PricewaterhouseCoopers, before starting a podcast and media company called She Said/She Said.",
    "George Conway, on the other hand, became a leading voice of the anti-Trump movement, helping found the Lincoln Project, a social-media-savvy super PAC with a mission of taking down Trump.",
    "Jose More/VW Pics/Universal Images Group via Getty Images\nThe Cruzes met while working on George W. Bush's 2000 presidential campaign and married just a few months after their first date.",
    "Ginni Thomas' actions have raised serious ethical questions about whether a spouse of a Supreme Court justice should be attempting to influence issues that could come before the court.",
    "Michael Ciaglo/Getty Images\nThe Gaetzes, who married in 2021, are one of Washington's most controversial couples, but they've built a following on the right and among fans of Trump.",
    "Scott Peters and Lynn Gorguze\n Rep. Scott Peters during a hearing on Capitol Hill Tom Williams/CQ Roll Call\nGorguze is president and CEO of Cameron Holdings, a private equity firm.",
    "But even though Michelle Obama hasn't been first lady since 2017, she's been the \"most admired woman\" in the world for three years running, according to research firm Gallup.",
    "Ryan serves as a conduit between the White House and the president's cabinet, who lead the federal agencies and carry out Biden's policy agenda in their various departments.",
    "Tom Donilon, who was a national security advisor to Obama, is now the chairman of the BlackRock Investment Institute, a think tank within the powerful financial institution.",
    "Though neither had had previous political or policy experience, they both landed cushy advisory roles in the Trump administration that did not require Senate confirmation.",
    "Pete Buttigieg and Chasten Buttigieg\n Pete Buttigieg, left, and his husband Chasten Buttigieg, right, stand onstage at a campaign stop on Monday, Jan. 13, 2020 in Iowa.",
    "She's been with NBC since 1978 and long ago established herself as one of the nation's most notable journalists — one with 1.9 million Twitter followers, to boot.",
    "Joel Kaplan is currently the head lobbyist for Meta, formerly known as Facebook, and has been at the forefront of the social media giant's battles with Congress.",
    "Linda Davidson/Washington Post via Getty Images\nAnita Dunn has served in a variety of high-profile capacities as a Democratic Party communicator and operative.",
    "Mitchell is NBC News' chief Washington correspondent and chief foreign affairs correspondent and anchor who also hosts her own early-afternoon show on MSNBC.",
    "Drew Angerer/Getty Image\nSupreme Court Justice Clarence Thomas and his wife, Ginni Thomas, have suddenly found their marriage under intense public scrutiny.",
    "Catherine Russell was appointed executive director of UNICEF in December, after serving as the director of the White House Office of Presidential Personnel.",
    "Earlier in her career, she served Republican administrations as an assistant secretary of state for educational and cultural affairs, among other positions.",
    "After all, they've together served as a governor, senator, secretary of state, and president, and between them, they've run for the White House four times.",
    "Jamie Raskin and Sarah Bloom Raskin\n Sarah Bloom Raskin (left) and Rep. Jamie Raskin (right) wear masks on the front porch of their Maryland home in 2020.",
    "Bloom Raskin is a former deputy Treasury secretary and was until recently Biden's nominee to serve as the Federal Reserve's chief Wall Street watchdog.",
    "Paul Morigi/WireImage for The Recording Academy\nRep. Ro Khanna, a California Democrat, votes on big-ticket legislation by virtue of his elected office.",
    "And neither have run for elected office or served in a prominent governmental capacity since Hillary Clinton lost her bid for the White House in 2016.",
    "McCormick, meanwhile, is looking to serve on Capitol Hill as a US senator — he's a leading candidate for the Republican nomination in Pennsylvania.",
    "Joel Kaplan and Laura Cox Kaplan\n Joel Kaplan (right) speaks with Facebook founder Mark Zuckerberg as they make their way through Congress in 2019.",
    "Dina Powell McCormick and David McCormick\n Dave McCormick, a Republican US Senate candidate from Pennsylvania, and his wife Dina Powell McCormick.",
    "As of February 28, Giffords PAC has more than $2.4 million cash on hand, according to its latest disclosure with the Federal Election Commission.",
    "Kellyanne Conway and George Conway\n Kellyanne and George Conway rarely failed to make headlines during President Donald Trump's term in office.",
    "\"He went after Heidi directly and smeared my wife, attacked her — apparently she's not pretty enough for Donald Trump,\" Cruz said in May 2016.",
    "In 2018, he co-wrote \"Capitalism in America: A History,\" and he's continued to consult and make periodic personal and television appearances.",
    "BRENDAN SMIALOWSKI/AFP via Getty Images\nThe daughter and son-in-law of former President Donald Trump followed him to the White House in 2017.",
    "While Giffords left Congress in 2012, her husband, Mark Kelly, joined in 2020, having won a special US Senate election to represent Arizona.",
    "Molinari was Republican congresswoman from New York from 1990 to 1997, and was Google's top lobbyist in DC until she stepped aside in 2018.",
    "As CEO Mark Zuckerberg made repeated visits to Capitol Hill to defend his company, Kaplan was frequently pictured sitting just behind him.",
    "Meanwhile, Ginger Luckey is a senior associate for sales transformation at tax and accounting firm KPMG US, and a MAGA social media star.",
    "Chao, who immigrated from Taiwan when she was eight, has served under three presidents: Ronald Reagan, George W. Bush, and Donald Trump.",
    "Biden withdrew her nomination in March after Republicans, along with Sen. Joe Manchin, a West Virginia Democrat, refused to support her.",
    "Sen. Ted Cruz, a Republican of Texas, at the time blasted Trump as a \"pathological liar,\" saying \"morality does not exist for him.\"",
    "Cruz went on to become one of Trump's staunchest defenders during Trump's presidential administration, particularly toward the end.",
    "Barack Obama can no longer compete: he had been Gallup's \"most admired man\" from 2008 to 2019 — until Donald Trump supplanted him.",
    "The Obamas are still very much DC denizens, having decided to stay within the capital city's limits after exiting the White House.",
    "He gained a new level of prominence in 2021, after he led the Democratic prosecution for Donald Trump's second impeachment trial.",
    "This article was originally published on March 26, 2022, and updated to reflect news developments about several couples listed.",
    "Both Ted Cruz and Heidi Cruz held high-profile jobs in Washington, and have spent much of their marriage in separate states.",
    "AP Photo/Patrick Semansky\nIn a town that runs on insider connections, a marriage between two power players can make careers.",
    "His wife, Evan Ryan, also serves in a high-profile role in the Biden administration as the White House Cabinet Secretary.",
    "The Thomases' drama shows how — for better or for worse — they're one of Washington, DC's most prominent power couples.",
    "James Carville and Mary Matalin\n Mary Matalin and James Carville speak onstage at the 2015 Angel Ball in New York City.",
    "Matalin is now a Libertarian although she's well-known for her work as a Republican strategist and political analyst.",
    "Both of them worked on Biden's unsuccessful 1988 presidential campaign, his first of three runs for the White House.",
    "The Senate ultimately acquitted Trump on charges that he instigated a deadly riot at the Capitol on January 6, 2021.",
    "Cox Kaplan got her start on Capitol Hill as a communications director for the Senate Republican Conference in 1999.",
    "They aren't afraid to be seen around town, either, frequently showing up at various DC restaurants and bookshops.",
    "Democrats are now calling for him to recuse himself from any cases involving the January 6 insurrection or Trump.",
    "As advisor to the president, Ivanka Trump was known to show up during the president's interviews with reporters.",
    "But ask anyone to name the nation's most powerful political couple, and the Clintons will still top many lists.",
    "The couple often appear together at political events and Mar-a-Lago, Trump's compound in Palm Beach, Florida.",
    "The Clinton Foundation is still very much a major platform for Bill Clinton, even if donations have waned.",
    "A few are even calling for the impeachment of Thomas, one of the court's most reliably conservative votes.",
    "Antony Blinken and Evan Ryan\n Antony Blinken, right, and Evan Ryan, left, backstage at Politicon in 2017.",
    "The Buttigieges are fast-becoming Washington's \"it\" couple, if they haven't already achieved that status.",
    "Bauer is one of DC's most notable Democratic lawyers who served a stint as Obama's White House counsel.",
    "Samuel Corum/Getty Images\nThe Kaplans have held some of the most plum lobbying gigs in Washington, DC.",
    "The two, who have been married since 1993 and have two children, remain influential in US politics.",
    "Jim Young/AFP/Getty\nBarack Obama may have been a two-term president who bagged a Nobel Peace Prize.",
    "Drew Angerer/Getty Images\nJamie Raskin represents a swath of suburban Maryland just outside of DC.",
    "Carville is a longtime Democratic strategist famous for helping get Bill Clinton elected in 1992.",
    "For starters, Chasten Buttigieg has more than 619,000 Twitter followers and a best-selling book.",
    "Justin Sullivan/Getty Images\nThe Clintons don't visit the nation's capital so often these days.",
    "He lead the proceedings all while grieving his son who had died by suicide just weeks earlier.",
    "The retired NASA astronaut is running for a full six-year term in the 2022 midterm election.",
    "But it can also open them up to public criticism, should the appearance of conflict arise.",
    "Chao resigned from her position after the January 6, 2021, insurrection at the Capitol.",
    "\"I may be biased, but I think if he's making that allegation he's also legally blind.\"",
    "And she withstood personal attacks on her appearance from then-candidate Donald Trump.",
    "Here 21 married couples who both wield political power and influence in DC and beyond.",
    "He is now a professor and distinguished scholar-in-residence at the NYU School of Law.",
    "But Chasten Buttigieg, his husband since 2018, has a major fan club in his own right.",
    "Bush appointed her secretary of labor, and she served in the post from 2001 to 2009.",
    "Matt Gaetz and Ginger Luckey\n Rep. Matt Gaetz, R-Fla., with his wife, Ginger Luckey.",
    "But his wife, Ritu Khanna, is the one who brings home big money for the couple.",
    "His brother, Mike Donilon, currently serves as a senior advisor to Biden.",
    "Kushner was senior advisor and Trump's emissary on Middle East politics.",
    "Ivanka Trump and Jared Kushner\n Ivanka Trump and Jared Kushner in 2018.",
    "Andrea Mitchell and Alan Greenspan\n Andrea Mitchell and Alan Greenspan.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "McCormick has served as the CEO of hedge fund Bridgewater Associates.",
    "Ro Khanna and Ritu Khanna\n Rep. Rho Khanna and Ritu Khanna in 2017.",
    "Matalin helped run the campaign of his rival, President George H.W.",
    "Gaetz has not been charged with a crime and has denied wrongdoing.",
    "She made headlines in 2020 for endorsing Biden for president.",
    "The couple has been married since 2001 and has two daughters.",
    "Barack Obama and Michelle Obama\n Barack and Michelle Obama.",
    "Bill Clinton and Hillary Clinton\n Hillary and Bill Clinton.",
    "Ted Cruz and Heidi Cruz\n Ted Cruz and Heidi Cruz in 2016.",
    "Anita Dunn and Bob Bauer\n Bob Bauer and Anita Dunn.",
    "Close icon Two crossed lines that form an 'X'.",
    "Now 96 years old, Greenspan is still working.",
    "She did.",
    "Bush."
  ]
}