{
  "id": 10038,
  "mediaId": 8358,
  "date": "2022-03-31",
  "headline": "Ohio legislators pass bills on online sale protections, sex trafficking and medication costs",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/03/web1_Ohio-56.jpg",
  "link": "https://www.limaohio.com/news/502937/ohio-legislators-pass-bills-on-online-sale-protections-sex-trafficking-and-medication-costs",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Many people are unable to afford the high prices of lifesaving drugs for which there are no generic equivalents, said state Rep. Susan Manchester, R-Waynesfield, who sponsored the bill with state Rep. Thomas West, D-Canton.",
    "Exempted from the bill would be situations where a generic drug exists, but a doctor prescribes the name-brand version without it being medically necessary, according to a state Legislative Service Commission analysis.",
    "31—A bill requiring third-party sellers to disclose contact information when they sell large quantities in online marketplaces unanimously passed the Ohio Senate on Wednesday, sending it on to Gov.",
    "State Rep. David Leland, D-Columbus, said the bill also will require police to check their evidence records for any previously obtained test kits, potentially helping to identify more traffickers.",
    "House members also unanimously approved House Bill 390, which requires police to offer rape kits for testing of sex trafficking victims and retain for testing any such kits already obtained.",
    "Medication help\nA bill to require insurers to accept any type of financial assistance to apply toward a patient’s drug deductible or coinsurance passed the Ohio House unanimously.",
    "Sub House Bill 276, sponsored by state Reps. Jena Powell, R-Arcanum, and Jean Schmidt, R-Loveland, creates the criminal offense of receiving the proceeds of prostitution.",
    "Lang said the bills’ intent is to weed out sellers of counterfeit or stolen items by letting customers know who’s selling an item and where the product is coming from.",
    "Sponsored by state Reps. Laura Lanese, R-Grove City, and Marilyn John, R-Shelby, the bill was introduced in August and approved by a committee this month.",
    "West said the bill would ensure that insurance companies accept copay coupons, family contributions or church assistance toward that deductible cost.",
    "The charge would not apply to the trafficking victim, but would make it easier for authorities to tie ‘the pimp’ to the crime, she said.",
    "Insurers could still withdraw coverage of a drug if doing so wouldn’t violate any other laws or regulations, according to the analysis.",
    "Schmidt told the story of an unnamed 12-year-old girl from Dayton who was prostituted by a relative who used the money to buy drugs.",
    "State Sen. George Lang, R-West Chester Twp., and Michael Rulli, R-Salem, sponsored a very similar bill in the Senate.",
    "Manchester and West introduced House Bill 135 in February 2021 and it passed a House committee this month.",
    "The girl was rescued, but there was no charge specifically for the relative getting that money, she said.",
    "Substitute House Bill 272, sponsored by state Rep. Phil Plummer, R-Dayton, passed the House in December.",
    "But the House version is simpler, Rulli told his colleagues Wednesday as he endorsed the House bill.",
    "It’s a “consumer friendly” measure that’s also backed by much of the business community, he said.",
    "Introduced nearly a year ago, it passed a House committee this month, and cleared the House 81-4.",
    "Manchester said a dozen states have passed similar bills and two dozen more are considering it.",
    "Sex trafficking\nAlso on Wednesday the Ohio House passed two bills targeting sex traffickers.",
    "Then they’re blindsided by insurance deductibles they thought had been covered, she said.",
    "Thus Attorney General Dave Yost’s office asked Powell to submit this bill, Schmidt said.",
    "“If that victim is a minor, that will become a second-degree felony,” Schmidt said.",
    "It also wouldn’t make insurance cover a drug that is not already covered.",
    "John said current law doesn’t require providing such tests to victims.",
    "The bill would make receiving such money a third-degree felony.",
    "The testing would be voluntary, she said.",
    "The bill now heads to the Ohio Senate.",
    "The bill now heads to the Ohio Senate.",
    "The bill now heads to the Ohio Senate.",
    "Mike DeWine.",
    "Previous",
    "Mar."
  ]
}