{
  "id": 1010,
  "mediaId": 8283,
  "date": "2022-02-14",
  "headline": "MyPillow fight: How Mike Lindell's endorsement for Ohio governor unraveled",
  "image": "https://www.gannett-cdn.com/presto/2022/02/14/PCIN/6eecab6d-562c-47bf-9fde-01f20016dcd4-mike-lindell.jpg?crop=1520,855,x0,y92&width=1520&height=855&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/politics/elections/2022/02/14/ohio-governor-election-jim-renacci-mypillow-ceo-mike-lindell-endorsement/6781690001/",
  "mediaOutlet": "chillicothegazette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    2121,
    1991,
    4669,
    2143,
    2263,
    843,
    421,
    6060,
    6030,
    6474
  ],
  "sentences": [
    "Shortly before 9 a.m. Friday, Renacci emailed media to tout his new endorsement: \"Mike Lindell has entered the Ohio Political Scene this week, endorsing Jim Renacci for Governor of Ohio in his bid to remove RINO Mike Dewine.\"",
    "A few hours after Renacci touted the endorsement, Cincinnati-area chemist Douglas Frank, who is also a purveyor of election falsehoods, shared a text message chain that he said was between him and a baffled Lindell.",
    "\"Everyone is atwitter in Ohio, wondering why you would endorse an establishment RINO who has been calling you a nutjob for over a year,\" Frank, who backs Blystone for governor, wrote in a text message to Lindell.",
    "But that endorsement quickly unraveled, smothered either because of miscommunication, an unreliable endorser or backlash against Renacci from Republicans who see him as another \"Republican in Name Only.\"",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "Dominion Voting Systems has sued Lindell, saying he “knowingly lied about Dominion to sell more pillows to people who continued tuning in to hear what they wanted to hear about the election.\"",
    "Right now, Renacci, former state Rep. Ron Hood and Canal Winchester businessman Joe Blystone are fighting to distinguish themselves as the most viable alternative to DeWine.",
    "Trump backed Renacci in the 2018 race for U.S. Senate against Democrat Sherrod Brown, sending then-Vice President Mike Pence to campaign for Renacci.",
    "Shortly after, Renacci adviser Brad Parscale responded on Facebook, saying Lindell had promised his endorsement to friend Knopp in text messages.",
    "Mike Lindell: From MyPillow CEO to Trump stalwart\nBut first, who is Mike Lindell and why would a candidate want his endorsement?",
    "MyPillow CEO Mike Lindell couldn't pronounce the name of the man he had supposedly endorsed for Ohio governor earlier that day.",
    "The CEO of a Minnesota-based pillow manufacturing company, Lindell is best known for pushing 2020 election conspiracies.",
    "Even now, Renacci spokesman Tom Weyland called the Lindell endorsement \"pending\" rather than completely off the table.",
    "Campaign manager Brenton Temple tweeted that night: \"lmk (let me know) if you have any good pillow recommendations.\"",
    "That somebody was the campaign of former U.S. Rep. Jim Renacci, one of three Republicans hoping to unseat GOP Gov.",
    "On Saturday morning, Renacci's campaign still sent out text messages to Republicans touting the endorsement.",
    "Lindell is a former crack addict turned evangelical Christian and ally of former President Donald Trump.",
    "A spokesman said Renacci's running mate Joe Knopp had spoken with Lindell three times that day.",
    "But Renacci ultimately lost that race, so it's unclear whether Trump would endorse him again.",
    "Was the DeWine campaign paying any attention as the Lindell endorsement was laid to rest?",
    "It appeared on Friday morning that Renacci had won the pillow fight – until he hadn't.",
    "The Lindell debacle comes as a possible Trump endorsement looms over the GOP primary.",
    "But Lindell also has a significant following, especially among Trump supporters.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "\"Giving your word to someone and then calling them a liar is the worst.",
    "I did not endorse him,\" Lindell said on a livestreamed Facebook video.",
    "\"So that is not true with Jim – Reh-NAH-she or NAH-key, NAH-she?",
    "\"The Jim Renacci (Reh-NEE-shaw) endorsement in Ohio.",
    "\"Well I thought Mike Lindell was an honorable man.",
    "A nod from Lindell could help that quest.",
    "The proper pronunciation is reh-NAY-see.",
    "Then came Lindell's Facebook livestream.",
    "The two will both be in Canton together.",
    "\"Tell them I am not endorsing him !!!!\"",
    "Mike, sad to see what you have become.\"",
    "But the Renacci campaign didn't waver.",
    "Lindell supposedly replied to Frank.",
    "Mike DeWine in this May's primary.",
    "That is not true,\" Lindell said.",
    "I was wrong,\" Parscale wrote.",
    "There was a lot of confusion.",
    "Somebody put it out there.\"",
    "\"People were misconstrued.",
    "Especially a friend.",
    "– endorsement."
  ]
}