{
  "id": 10210,
  "mediaId": 8324,
  "date": "2022-04-01",
  "headline": "ODNR announces trail improvements through grant programs",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/38/2022/04/web1_ODNR-LOGO.jpg",
  "link": "https://www.galioninquirer.com/sports/73550/odnr-announces-trail-improvements-through-grant-programs",
  "mediaOutlet": "Galion Inquirer",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Galion Inquirer",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’m thrilled to be a part of a program that can improve trails and make them more accessible and teach people steps they can take to stay safe.”\nFrom forests to park systems, the projects chosen to receive RTP funding include:\nFranklin County\n• City of Reynoldsburg – $28,117 for reconstruction and relocation of the Blacklick Creek Trail pedestrian trail within Huber Park.",
    "To date, the program has awarded nearly $106 million to provide Ohioans with better access to recreational opportunities through the creation of nearly 500 miles of trails and the acquisition of 128 miles of abandoned railroad and greenway corridors.",
    "Medina County\n• Medina County Park District – $500,000 for the Lake Medina Greenway extension the State Route 18 trailhead at Lake Medina, extending through the Summa Health Campus, and onward to Chandler Wildlife Sanctuary on E. Smith Rd.",
    "“Trails play such an important role in creating a love and appreciation for the outdoor space people can find right here in Ohio – and it goes beyond our state parks or nature preserves,” ODNR Director Mary Mertz said.",
    "“I’m excited for families and friends to have even more opportunities to see Ohio through every season.”\nODNR administers the federal RTP grant program, which reimburses up to 80 percent of a project’s funding.",
    "Sandusky County\n• Sandusky County Park District – $122,810 for a shared use path to connect the City of Fremont and the North Coast Inland Trail (NCIT) with the Terra State Community College (TSCC).",
    "Approved projects include:\nAshtabula County\n• Ashtabula County Metroparks – $500,000 for extension of an off-road, paved, ADA-compliant trail connecting Ashtabula County with parts of Pennsylvania.",
    "COLUMBUS — The Ohio Department of Natural Resources (ODNR) is helping communities maintain or add new trail systems through the Recreational Trails (RTP) and Clean Ohio Trails programs.",
    "Tuscarawas County\n• New Philadelphia – $500,000 for construction of a 1.6-mile trail connecting Kent State University on the southern side of New Philadelphia with the downtown area.",
    "Delaware County\n• Preservation Parks of Delaware County – Approximately $478,000 for construction of a rail trail and conversion to a pedestrian bridge over Big Walnut Creek.",
    "The Clean Ohio Trails Fund, administered by ODNR, is one of three components of the Clean Ohio Fund, which restores, protects, and connects Ohio’s natural and urban places.",
    "Hocking/Athens County\n• USDA Forest Service, Wayne National Forest, Athens Ranger District – $201,525 for 35 miles of tread maintenance on the Dorr Run Loop.",
    "Chosen projects create and maintain trails, improve access for people with disabilities, and provide education about trail safety and the environment.",
    "Miami County\n• City of Piqua – $81,631 for construction on the Great Miami River Trail to Ohio to Indiana Connector making it an ADA-compliant trail.",
    "More than 397 local trail projects across the state have received more than $35 million in federal funds through ODNR since RTP began in 1993.",
    "Applications for funding are evaluated using criteria such as need for the trail, public participation during design, and trail linkages.",
    "The work will link people to statewide trails, connect urban areas to recreational areas, and upgrade regional trail systems across Ohio.",
    "“Ohioans loves to get outside and take in the natural beauty this great state has to offer,” Governor Mike DeWine said.",
    "Grants through the Clean Ohio Trails Fund will be used to improve existing trails and purchase land to build new ones.",
    "Clean Ohio Trail Grant recipients provide a 25% match for their projects.",
    "To learn more about Ohio’s trails, please visit trails.ohiodnr.gov."
  ]
}