{
  "id": 10343,
  "mediaId": 8497,
  "date": "2022-03-31",
  "headline": "Ohio officer killed trying to stop fleeing car on highway",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/1632750-wlky-police-lights-1-1520186177.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-officer-killed-trying-to-stop-fleeing-car-on-highway/39599700",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"In honor of the life and legacy of Bluffton Police Officer Dominic Francis, Governor DeWine has ordered that flags of the United States and the State of Ohio be flown at half-staff upon all public buildings and grounds throughout Allen and Hancock counties, the Ohio Statehouse, the Vern Rife Center and the Rhodes State Officer Tower.",
    "BLUFFTON, Ohio —\nA police officer in Ohio was struck and killed by a fleeing car on Interstate 75 during a high-speed chase through multiple counties Wednesday, authorities said.",
    "The search caused schools in the nearby village of Bluffton to cancel classes, and Bluffton University told students to stay in their rooms and advised employees to stay home.",
    "The officer, Dominic Francis of the Bluffton police department, was struck around 2:30 a.m. while he was setting up stop sticks, which flatten tires, said Sgt.",
    "One was found nearby while a second one was arrested in a stolen car in Elyria, about 100 miles (161 kilometers) northeast of Bluffton, Nihiser said.",
    "The chase first began near Marion when authorities saw the car going more than 100 mph and continued across several counties, Nihiser said.",
    "He also worked as a school teacher, bus driver and as a football and softball coach with Cory-Rawson schools.",
    "In a statement on Thursday, Governor Mike DeWine has ordered flags to be lowered in honor of Dominic Francis.",
    "Francis, 41, had been an officer in Bluffton the past nine years, said Police Chief Ryan Burkholder.",
    "I-75 also was shut down while authorities looked through barns, farm fields and around houses.",
    "Three suspects inside the car drove away for a short distance before they jumped out and ran.",
    "The flags shall remained lowered until the day of his funeral,\" said DeWine.",
    "Authorities were continuing to look for the third suspect.",
    "The chase had reached speeds up to 120 mph (193 kph).",
    "Brice Nihiser of the Ohio State Highway Patrol.",
    "“He had a heart of gold,” Burkholder said."
  ]
}