{
  "id": 10463,
  "mediaId": 8496,
  "date": "2022-03-31",
  "headline": "Gov. Mike DeWine, Ohio Attorney General Dave Yost announce new criminal justice initiative to solve gun crimes",
  "image": "https://media.wkyc.com/assets/WKYC/images/caa1cb8f-49de-4d2b-b559-f754263c2bbe/caa1cb8f-49de-4d2b-b559-f754263c2bbe_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/governor-mike-dewine-ohio-attorney-general-dave-yost-announce-new-criminal-justice-initiative/95-45b8ee31-4f2b-4ddb-bbf3-db7dd6317523",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "As part of the new Ohio Ballistics Testing Initiative, the Ohio Department of Public Safety’s Office of Criminal Justice Services will award a total of $10.5 million to the Ohio Attorney General's Bureau of Criminal Investigation (BCI) and Ohio State Highway Patrol (OSHP) to increase the number of National Integrated Ballistic Information Network (NIBIN) units in Ohio from seven to 16.",
    "LONDON, Ohio — On Thursday, Ohio Governor Mike DeWine, Ohio Attorney General Dave Yost, and Ohio State Highway Patrol Superintendent Col. Richard Fambro announced a joint criminal justice initiative to help local law enforcement identify criminals responsible for deadly shootings and other incidents of gun violence in Ohio.",
    "“We must do more to hold accountable the small number of dangerous criminals who are responsible for most of the gun violence in our state -- the convicted felons who have lost their right to possess firearms, yet they continue to carry and use guns to hurt and kill people,” said DeWine in a statement.",
    "According to DeWine's office, the joint initiative will provide more opportunities for law enforcement to submit firearm evidence for scientific analysis, while simultaneously decreasing turnaround time on testing results.",
    "“By more than doubling the number of NIBIN units in Ohio, we’ll give our local law enforcement partners easier access to this crime-solving technology to help develop investigative leads that result in arrests.",
    "Of the $10.5 million in funding, the Ohio Attorney General's Office will receive $9.2 million to place five new NIBIN machines at BCI’s state crime labs in Richfield, as well as London and Bowling Green.",
    "newsletter\nThe Hancock County Sheriff's Department said officer Dominic Francis was fatally struck along I-75 near exit 142 by the suspect's vehicle while attempting to deploy stop sticks.",
    "We are grateful to him for his selfless service to Ohio, and our hearts go out to his family and his colleagues at the Bluffton PD,\" DeWine tweeted on Thursday.",
    "With the help of this initiative, we are confident that more gunmen will be brought to justice, future shootings will be prevented, and lives will be saved.\"",
    "\"Fran and I are sad to learn of the death of Bluffton Police Officer Dominic Francis, who tragically died today after being hit by a fleeing driver.",
    "The situation initially started in Hancock County before the pursuit concluded in Elyria on Route 57 near Chestnut Ridge Road.",
    "SUBSCRIBE: Get the day's top local and national headlines sent to your email inbox each weekday morning with the 3News to GO!",
    "Officer Dominic Francis was killed during a pursuit that started in Northwest Ohio before coming to an end in Lorain County.",
    "Yost began Thursday's events with comments about the death of a Bluffton police officer that happened earlier on Thursday.",
    "The grants awarded today are funded through the American Recovery Plan Act (ARPA).",
    "Want to be among the first to know the most important local and national news?",
    "Download the free WKYC app today: Android, Apple.",
    "You can watch his remarks in the video below.",
    "Their names have not yet been provided.",
    "Three suspects have been arrested.",
    "Related Stories:"
  ]
}