{
  "id": 10531,
  "mediaId": 8252,
  "date": "2022-03-31",
  "headline": "UPDATE: Bluffton Police Officer Killed in the Line of Duty",
  "image": "https://i.iheart.com/v3/re/new_assets/6245d865ce2900405cbb3b53?ops=gravity(%22north%22),fit(740,416),quality(65)",
  "link": "https://610wtvn.iheart.com/content/2022-03-31-bluffton-police-officer-killed-in-the-line-of-duty/",
  "mediaOutlet": "610wtvn.iheart.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Crumley",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In honor of Officer Francis' life and legacy, I have ordered that flags be flown at half-staff on all public buildings and grounds in Allen and Hancock counties, as well as in Columbus at the Statehouse, Riffe Center, and Rhodes Tower.",
    "pic.twitter.com/YkJkCX2gz6\n— Governor Mike DeWine (@GovMikeDeWine) March 31, 2022\nOhio Governor Mike DeWine has ordered flags to half-staff until the day of Officer Francis' funeral.",
    "During the pursuit, Bluffton Police Officer Dominic Francis (pictured) was trying to deploy stop sticks, and he was fatally struck by the suspects' vehicle.",
    "The Prius was seen again on Interstate 71 in the Medina area, and that led to a chase that ended with a second suspect being arrested in Elyria.",
    "The Ohio State Highway Patrol says it started with a high speed chase on Interstate 75 in Hancock County around 2:30 Thursday morning.",
    "Officer Francis is being remembered as a police officer, a husband, a father, a teacher, a coach, and more.",
    "The suspect is described as a young black man last seen wearing black pants and a gray sweatshirt.",
    "( Bluffton, Ohio ) - Mourning a loss in northwest Ohio and the search is on for a suspect.",
    "===\nUPDATE: The Ohio State Highway Patrol says that third suspect has now been arrested.",
    "They are considered dangerous, but it's unknown if they're armed.",
    "A black Infinity sedan was allegedly driving well over 100 mph.",
    "The suspects fled on foot, then stole a Toyota Prius.",
    "A third suspect remains at large.",
    "One suspect was arrested nearby."
  ]
}