{
  "id": 10612,
  "mediaId": 8276,
  "date": "2022-04-02",
  "headline": "Wind turbines in Crawford County, Ohio: Here's what we know about Honey Creek Wind",
  "image": "https://www.gannett-cdn.com/presto/2021/11/04/PMAN/826a5540-ba42-4b2d-ad86-1ad7a4c8a61e-isabella_1.JPG?crop=1718,966,x1250,y543&width=1718&height=966&format=pjpg&auto=webp",
  "link": "https://www.bucyrustelegraphforum.com/story/news/2022/04/02/wind-turbines-crawford-county-ohio-honey-creek-wind-faq/9382089002/",
  "mediaOutlet": "bucyrustelegraphforum.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gere Goble",
  "authorUrl": "https://www.bucyrustelegraphforum.com/staff/4395714002/gere-goble/",
  "termIds": [
    0
  ],
  "sentences": [
    "...\n\"As you think about a developer that's coming in to build a wind project, they try to understand the wind resource, the topography, the geography, potential siting restrictions that are in place, and they work with the turbine manufacturer to basically select a configuration of turbine that works for that particular area.",
    "We have to measure the ambient noise level, so we find the average ambient noise level for the entire project area and after we do that, the state of Ohio requires that we are not allowed to raise the ambient sound level more than 5 decibels from the level found at the outside of a nonparticipating home.\"",
    "Last month, Crawford County commissioners announced they will seek public input on a proposal that would effectively prevent the development of wind farms in the county during a public meeting at 1 p.m. Thursday, April 21, in the youth building at the Crawford County Fairgrounds.",
    "John Hensley, vice president of research and analytics for the American Clean Power Association, an industry group: Of 70,000 to 80,000 wind turbines currently operating across the country, his organization's records suggest about 2,000 are roughly 600 feet or taller.",
    "Especially in areas that are land-constrained, where it's difficult to get enough land leases or a large enough tract of land available to put in many smaller wind turbines, then in some cases it makes sense to sort of consolidate and put in many larger wind turbines.",
    "Lynette Moritz, member: \"Crawford Anti-Wind is a group of concerned citizens dedicated to preserving our quiet, beautiful, rural settings, wildlife, property values and overall quality of life in the beautiful scenic settings in which we live and work.",
    "\"We have a team of very talented engineers and scientists who know what it takes, and know what will hold up a turbine of this size,\" he said \"It would be very poor, unwise business practice for us to put less than was needed and risk losing a tower.",
    "The bill significantly changed Ohio's laws governing siting requirements for industrial solar and wind projects, giving county commissioners the ability to prevent Ohio Power Siting Board certification of certain wind and solar facilities.",
    "The state's two-year budget bill, also passed last summer, extends the law allowing counties to offer a payment in lieu of taxes, or PILOT fee, option for renewable energy projects until the end of 2024.",
    "Throughout the winter months, volunteers went door-to-door and manned drive-thru signing events for petitions intended to convince commissioners that many Crawford County residents oppose the project.",
    "\"A lot of times they’ll shuffle things around and move them and where they get moved to often determines how many we have, and how many we are allowed to place determines the size that we need.\"",
    "The legislation also adds two ad hoc members representing the community to the siting board while it reviews the local project — leaders of the township trustees and county commissioners.",
    "Provided the county is not designated a restricted zone, Apex plans to wrap up its studies this year \"and then choose a time to kick off the official application process,\" Fehrman said.",
    "Fehrman: Apex also would make payments to a number of property owners: 319 leases, 97 participation agreements, 56 transmission right-of-way agreements and three access agreements.",
    "From T-F archives: Under terms of an Alternative Energy Zone approved by Crawford County commissioners in 2011, renewable energy developers would not pay standard property taxes.",
    "\"We do know that in terms of raw concrete that goes into a wind turbine that it takes roughly on the order of 440 tons per megawatt of concrete to have a sufficient foundation.\"",
    "If a facility is in multiple townships, all of the trustee members are to vote on a representative — or all commissioners would vote if the project involves multiple counties.",
    "Instead, wind farm developers would make an annual Payment in Lieu of Taxes, or PILOT fee, of $9,000 per megawatt, nameplate capacity, Commissioner Doug Weisenauer has said.",
    "The company, founded in 2009, now has the largest clean energy development portfolio in the U.S., with more than 30 gigawatts, \"which is just an absolutely amazing number.\"",
    "Members have distributed the now-familiar yellow and black yard signs; brought in anti-wind speakers; and attended township, school board and county commissioner meetings.",
    "Together, we form a grassroots effort to hold wind energy accountable to the impact on our surroundings and the cost to our communities now and for generations to come.\"",
    "Hensley: The characteristics required for footers is very site-specific, depending on things such as soil type, wind speed and sheer expected or the height of the tower.",
    "So if you do all of the math and you're very generous, we're looking at maybe 50 to 60 acres in total that are taken out of farm production in that entire project area.\"",
    "No one who has signed a lease or easement agreement with the developer of a utility facility, or holds any other beneficial interest in a utility facility, can serve.",
    "The project would also generate up to $2.7 million for annual revenue in Crawford County, with the money going to local schools, infrastructure, government services.",
    "The group became active as Crawford Anti-Wind early this year, evolving out of Crawford-Seneca Anti-Wind, which offered a series of informational meetings last year.",
    "After the hearing, commissioners can adopt a resolution designating unincorporated land in the county as a restricted area, prohibiting construction of wind farms.",
    "We have to work through such rigorous processes with the state of Ohio and different agencies within the state to ensure we're not disrupting anything like that.",
    "The project also will create several hundred construction jobs in its construction phase and three to five permanent jobs once it begins operating, Fehrman said.",
    "If such a resolution is passed, people who support wind farm development would have 30 days to circulate petitions to request a referendum vote on the decision.",
    "Commissioners can adopt a resolution designating any portion of unincorporated land in the county as a restricted area, prohibiting construction of wind farms.",
    "Exact figures on how much Apex would pay those landowners are not available because \"it's a private agreement between us and our leaseholders,\" Fehrman said.",
    "Apex is hoping Honey Creek will produce 300 megawatts using 60 turbines, so that would mean using 4- to 5-megawatt turbines, which are around 600 feet tall.",
    "... We do have to do sound studies on every project, and that means essentially we take sound monitors and we place them all around the entire project area.",
    "In the 90 days that follow, commissioners may pass a resolution prohibiting the construction of the facility or limiting its boundaries to a smaller area.",
    "Developers submit a proposed project layout to the Ohio Power Siting Board, but that body has the ability to make changes to the plan, he explained.",
    "Fehrman: \"That's not been an issue and we hear that quite a bit... if you think about tile, which is all over farmland up there, it's very similar.",
    "Mike DeWine signed Senate Bill 52, which significantly changed Ohio's laws governing siting requirements for industrial solar and wind projects.",
    "\"Then on top of that, each turbine, including the access road to that individual turbine typically requires less than half an acre all together.",
    "The law also requires developers to present their plans at a public meeting 90 prior to filing an application with the Ohio Power Siting Board.",
    "Then every five years, the state of Ohio reanalyzes that bond for inflation rates and if there is a difference, we have to pay the difference.",
    "Members of that group traveled to Columbus to support the passage of SB 52, which changed the rules for clean energy development in the state.",
    "Fehrman: \"We go 10 feet deep, and then we pour the visible, above-ground circumference or the pad above ground ... about 16 feet all together.",
    "That’s held the entire time.”\nThat guarantees that no matter what happens to the company owning a wind farm, the project is removed, he said.",
    "As we site the turbines and we figure out what works and what doesn't, that boundary shrinks, so it becomes what we call the buildable area.",
    "Fehrman: “Before we can ever begin construction on a project, we have to purchase a decommissioning bond that is held by the state of Ohio.",
    "At the meeting, they must present the scale of the project, its maximum nameplate capacity and a map of the proposed geographic boundaries.",
    "Originally, it would have consisted of about 115 wind turbines spread across 14,000 acres of leased land in Crawford and Seneca counties.",
    "\"In January of this year, the group expanded and continued the work of those that had been in the battle for years,\" Moritz said.",
    "The group's next informational meeting is scheduled for 7 p.m. April 14 in the Youth Building at the Crawford County Fairgrounds.",
    "It gives county commissioners the ability to prevent Ohio Power Siting Board certification of certain wind and solar facilities.",
    "So as of right now, we're looking at 60 turbines and the turbines have to be spaced out between a quarter and a half mile apart.",
    "Given the $9,000 per megawatt PILOT fee, a 300 megawatt wind farm would generate $2.7 million in payments to local government.",
    "Once a wind farm is permitted with a PILOT fee, that same amount will be paid annually throughout the lifespan of the project.",
    "Those 40,000 acres are spread across Auburn, Chatfield, Cranberry, Holmes, Liberty, Lykens and Texas townships, he added.",
    "honeycreekwindpower.com, and click the \"Meet the Team\" link, which provides direct email address for all team members.",
    "Fehrman: 319 leases, 97 participation agreements, 56 transmission right-of-way agreements and three access agreements.",
    "Ohio law requires a setback of 1,125 feet plus the length of the rotor radius from a nonparticipating property line.",
    "...There's no risk to water tables, there's no risk that we're going to leech anything into the soil that's harmful.",
    "It gets more costly as you go higher up and put in a bigger turbine, so they don't do that for no reason at all.",
    "The Ohio Power Siting Board process \"can take a while,\" so there's no way to know when construction could begin.",
    "\"In some cases, footers are designed to be much more spread out; in other cases, they're designed to be deeper.",
    "Tyler Fehrman, field manager for Apex Clean Energy: It is a proposed 300-megawatt wind farm in Crawford County.",
    "People also can leave a message for the team at 419-664-3769 or visit the office at 122 E. Main St., Bellevue.",
    "Ideally, that would happen by the end of this year, \"but we're looking at the last quarter, at the earliest.\"",
    "The proposed Honey Creek Wind project has sparked much debate and controversy in Crawford County this year.",
    "We're not going any deeper than is standard for other things that are dug and built down into the ground.",
    "If such a resolution is passed, petitioners have 30 days to request a referendum vote on the decision.",
    "\"And so they’re big, but bigger turbines generate more power, so you need less of them,\" Fehrman said.",
    "Fehrman: \"A lot of time when you go and stand underneath a wind turbine, they make a whooshing noise.",
    "It will include about 60 wind turbines capable of producing enough power to power 85,000 U.S. homes.",
    "\"We do see sort of a trend toward taller wind turbines, but it hasn't been kind of that rapid yet.\"",
    "The new law also requires developers to submit a decommissioning plan along with their application.",
    "He said that at public meetings he has attended, people have challenged whether that's adequate.",
    "NextEra Energy Honey Creek Wind LLC announced it was pulling out of the project in October 2015.",
    "Fehrman: “It’s an individual, case-by-case process” based on the terms of each lease agreement.",
    "Team members regularly attend county commissioner, township trustee and other public meetings.",
    "Which again takes up minimal land and makes it so that the folks can farm right up to them.\"",
    "Among projects currently in development, 520 feet is the average height, Hensley estimated.",
    "If commissioners take no action, developers can proceed with seeking siting board approval.",
    "It's all sited on open farmland that Apex Clean Energy has been leased from local farmers.",
    "It's all very site-specific and a very kind of technical engineering question,\" he said.",
    "Hensley: Wind projects being developed today are expected to operate for 30 to 35 years.",
    "The hearing is part of a process set out by Senate Bill 52, which became law in July.",
    "Fehrman: \"We've signed over 40,000 acres, and that creates just the general boundary.",
    "Will the excavation for footers disrupt the water table and neighboring wells?",
    "It's the effect caused when direct sunlight passes through a turbine's blades.",
    "We would not be allowed to site a project if there was a public health risk.",
    "Did SB 52 include any other changes to how wind farms are permitted in Ohio?",
    "The same information must be submitted in writing to county commissioners.",
    "What happens if someone has signed a lease, but that land isn’t used?",
    "What can commissioners do after a wind farm plan has been presented?",
    "How many Crawford County land owners have signed lease agreements?",
    "\"And they tend to be done for a very specific reason for the site.",
    "Fehrman: The easiest way would be to visit the project's website.",
    "How can county commissioners block wind farm development in Ohio?",
    "Fehrman: Apex Clean Energy is based in Charlottesville, Virginia.",
    "Visit CrawfordAntiWind.com or email CrawfordAntiWind@gmail.com.",
    "How much money would Honey Creek Wind bring to Crawford County?",
    "That would not make sense for us, because they're expensive.\"",
    "\"So they are, at least at this point of time, rare,\" he said.",
    "A Facebook group, YouTube channel and website were created.",
    "From T-F archives: Preliminary development started in 2011.",
    "Is there a deadline for how long PILOT fees can be offered?",
    "And the state digs into that and makes sure that we can't.",
    "How can I contact Crawford Anti-Wind for more information?",
    "How can I contact Apex Clean Energy for more information?",
    "What is the current timeline for the Honey Creek project?",
    "It has roughly 300 employees, and is growing rapidly.",
    "Every time a blade passes, there's a flicker effect.",
    "How close can a wind turbine be to a house in Ohio?",
    "But it's stable income for landowners, for decades.",
    "\"It will pump money into Crawford County,\" he said.",
    "How long has Honey Creek Wind been in development?",
    "Apex purchased the project in 2018, Fehrman said.",
    "How big is Honey Creek Wind Farm expected to be?",
    "It also has an office in Minneapolis, Minnesota.",
    "What happens when the project is decommissioned?",
    "How long would Honey Creek Wind be in operation?",
    "The purchase included previously signed leases.",
    "How tall will the Honey Creek wind turbines be?",
    "Fehrman: \"It is little bit of a moving target.\"",
    "How deep are the footers for the wind turbines?",
    "Is Crawford County an Alternative Energy Zone?",
    "But to me, honestly, it sounds like wind.",
    "What will Apex do to limit noise issues?",
    "\"We haven't set the dates yet,\" he said.",
    "Who pays to decommission the wind farm?",
    "Who is developing Honey Creek Wind?",
    "What is Honey Creek Wind Farm?",
    "What is Crawford Anti-Wind?",
    "It's just not an issue.\"",
    "What is shadow flicker?",
    "What is a PILOT fee?",
    "In July, Gov.",
    "419-559-7263",
    "..."
  ]
}