{
  "id": 10668,
  "mediaId": 8379,
  "date": "2022-04-04",
  "headline": "Ohio Redistricting Commission responds to state Supreme Court contempt charges",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/04/Redistricting-commission.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/your-local-election-hq/ohio-redistricting-commission-responds-to-state-supreme-court-contempt-charges/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allen Henry",
  "authorUrl": "https://www.nbc4i.com/author/allen-henry/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Anyone who fails to follow a court order should have consequences, and I really don’t think we want to enter a situation where just because you’re really important, just because you’re the Speaker of the House or the president of the Senate, you can fail to obey a court order and there’s no consequences,” Lewis said.",
    "In filings, Democratic commission members Allison Russo, Ohio House minority leader, and Vernon Sykes, Senate minority leader, apologized for the commission’s failures, but put blame on the five Republican commission members for “hijacking the process” in an attempt to hold onto power.",
    "“Well yes, it’s impossible to meet a deadline if you’re trying to make it impossible by stalling and wasting time, etc.”\nShe said she supports efforts to hold members of the commission in contempt, even if it’s unclear what that would mean for those members.",
    "“We’re going to end up with a map and there’s going to be an election, but I think we have to look at what the voter’s expectations were when they passed this constitutional amendment versus how it really played out,” DeWine said.",
    "But Ohioans want fair maps and we’re going to find a way to make sure we get fair maps.”\nOne Ohio Supreme Court justice, Pat DeWine, has agreed to recuse himself from the decision because it involves his father… Gov.",
    "“This entire year has been an effort to run out the clock,” said Mia Lewis, associated director of Common Cause Ohio, one of the groups that fought the redistricting commission for fair election maps.",
    "With early voting starting Tuesday, it’s unclear when Ohio’s elected leaders will know what districts they’re running to represent, or even when they’ll have a ballot with their name on it.",
    "“One of the things that the Republicans on the commission did was to waste a lot of time so that… they said, ‘Oh, it was impossible to meet that deadline,’” Lewis said.",
    "Mike DeWine, a member of the commission, said while a split primary needs to be figured out in the short term, there also needs to be a big picture look at the process.",
    "That’s the question the Ohio Supreme Court is facing after the commission passed another questionable set of state election maps last week.",
    "Ohio House Speaker Robert Cupp and Ohio Senate President Matt Huffman said the problem was the deadline imposed by the court.",
    "The Ohio Supreme Court ordered members of the commission to explain why they shouldn’t be held in contempt.",
    "“None of us want to go through this again and so I think Ohioans would support such a measure,” she said.",
    "“And now we have three court decisions to interpret the constitutional amendment.”\nLewis agrees.",
    "COLUMBUS, Ohio (WCMH) – Should the Ohio Redistricting Commission be found in contempt of court?",
    "“I think that, let’s get through this process first and think about it and see where we land.",
    "Ohio Secretary of State Frank LaRose said he voted for the best possible option, while Gov.",
    "Mike DeWine said between the two choices laid out by the court, there was no good choice.",
    "“I don’t think any of us want to live in a society like that.”\nIn Springboro Monday, Gov.",
    "The results of the approved maps, however, are not what she hoped for.",
    "However, Republicans filed several different responses.",
    "DeWine."
  ]
}