{
  "id": 10751,
  "mediaId": 2573,
  "date": "2022-03-16",
  "headline": "'The Five' on Ukraine war red lines",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1aa6d529-1eed-46c6-a0e6-465bffff9873/e33b46db-ddbd-4f53-9208-e32846a5cb6b/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/transcript/the-five-on-ukraine-war-red-lines",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1892,
    4591,
    4204,
    3702,
    4905,
    5072,
    5639,
    5249,
    5774,
    6286,
    6672
  ],
  "sentences": [
    "Copyright 2022 VIQ Media Transcription, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of VIQ Media Transcription, Inc. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
    "PIRRO: Well, we're certainly all praying for him, but you know, Jesse, when the Biden administration talks about unequivocal support, but then they say we will not facilitate the transfer of fighter jets, what do you think Biden is going to say when he gets to Brussels assuming he gets there next week?",
    "That's why I think the Judge's point about bail reform is the one that resonates because when you commit a crime, you should be charged to the fullest extent of the law, held if you are a threat to society pretrial, and then given the full sentence if you're convicted.",
    "So if the alternative to the Biden administration is we're not going to drill here, we're not going to loosen up the regulations, we'll go to -- we'll go to Venezuela, we'll beg the Saudis although they won't take our call, and we want electric cars.",
    "If you were to think about something really reasonable to hear from this administration, the oil and gas industry, the American Petroleum Institute says just send a friendlier message that you're not out to demonize the oil companies.",
    "A suspected serial killer has been arrested in connection with the heinous set of shootings that targeted vulnerable homeless people in New York City and Washington D.C. That killing spree leaving two dead, injuring three others.",
    "Some good news out of Mariupol after multiple ceasefire attempts for humanitarian purposes have fallen apart, a humanitarian convoy or civilian convoy, some 160 vehicles long, made its way to Zaporizhzhia and to safety.",
    "The thing about the Russians -- very quickly -- the thing about the Russian arm, they're saying now that as evidence of the Russian army falling apart, they're looting, killing, and terrorizing the -- that's a weapon.",
    "WATTERS: So, Zelenskyy is going to make an extremely emotional appeal to Congress tomorrow, and Congress will be very affected by that appeal and they will move Biden to do something differently than he's done so far.",
    "And so if you have the city surrounded by these armaments that are shelling, not only could you block it with the missile defense system you could take out the Russian tank columns with the Stingers and the Javelins.",
    "I'm just saying, get inside the guy's head, do something that he's not expecting, because you have about a week and a half -- two and a half weeks before Kyiv is surrounded, and then you have no leverage after that.",
    "And we -- I'm not going to say we talked about it because frankly it's nobody's business, but he did say something that I agreed with a hundred percent and he said, \"Greg, you can't do my job and I can't do yours.\"",
    "But Ukraine is running low on surface-to-air defensive missile systems and that would be -- make a huge difference because if you could get him into Kyiv now before it's encircled that would stop the shelling.",
    "And to go to Geraldo's point about the relentless Vladimir Putin and the audacious diplomacy that is needed, the next big event is going to be President Zelenskyy addressing the U.S. Congress tomorrow morning.",
    "It is harder to do now than ever given social media, the internet, the rise of constant disinformation, but if you're sitting here at this table you must be a radical skeptic because you aren't there, Ben is.",
    "We need more oil production to bring the -- and by the way, the message to the TikTok viewer out there is green energy, in a moment where 65 percent of the American people are living paycheck to paycheck.",
    "RIVERA: My point is that the oil companies are reaping record profits, some of this could be handed to the consumers rather than all of these --\nSMAITH: You want the oil companies to cut tax to Americans?",
    "But I tell you right now, that he didn't do it when Trump was president, because he knew that Donald Trump would come in if you touch one hair on one innocent civilian, he wouldn't care NATO or non NATO.",
    "The serial killer claims by his dad to be mentally ill.\nAt a certain point, you know, despite all the billions that we've spent on the mentally ill, it all goes into the pockets of the administrators.",
    "An American commander will see an outpost, an enemy strong point and flank it and do all -- Russians will keep slamming it, slamming it, slamming it till finally, there's a last Russian left bell.",
    "GUTFELD: I'm going to quote my favorite philosopher Tim Dillon who said that Putin is a monster but demanding a no-fly zone and jets before you try to make a deal as people die seems to be crazy.",
    "The Red Cross is now accusing Russia of blocking the aid convoys that we're attempting to bring food and water to the people who have been without water, power, and heat now for at least 10 days.",
    "RIVERA: I am suggesting that the oil companies are reaping windfall profits and Ro Khanna's suggestion of a windfall profits tax is much more viable to me than getting rid of the taxes.",
    "(BEGIN VIDEO CLIP)\nPETE BUTTIGIEG, SECRETARY, U.S. DEPARTMENT OF TRANSPORTATION: Gas prices are famously something that is largely outside of the direct control of any political figure.",
    "A team led by our correspondent Benjamin Hall was attacked grievously wounding the correspondent, the person you see there in the foreground, Pierre Zakrzewski, his cameraman killed.",
    "Ambassador to NATO Kurt Volker just made an incredibly important point about this moment saying that Vladimir Putin, Geraldo, to your point, is desperate and dangerous at this hour.",
    "I think you go back to Ambassador Volker's words that this is a defining moment in all of this and we have to start saying what we are going to do rather than what we will not do.",
    "I don't want to -- I don't want to take all the time, but unless you change the bail law in New York State, and unless we get rid of these progressive DAs, then we've got no hope.",
    "As far as Lindsey Graham earlier today saying why he believes that the U.S. is not getting involved and President Biden folding like a cheap suit, I think, was his exact words.",
    "And unless the government wants to give them a voucher for an electric car with their next social security check, they're not -- they're the ones who are lost in all of this.",
    "(COMMERCIAL BREAK)\nRIVERA: We've been talking here a lot about the war overseas, but we are also as you know, fighting a war right here at home for the streets of our cities.",
    "No, he should be on a plane right now meeting with the very top players, with other top players of the country, not this casual diplomacy and back padding is just disgusting.",
    "It is the Zelenskyy and the Ukrainians and we have to give them whatever we can without putting Americans in the cockpit or behind the buttons of the Patriot missile system.",
    "But you are obviously correct that what he has -- he has been very clear and consistent about his -- that he does not have the intention of sending U.S. troops to Ukraine.",
    "I mean, you're on top of this and I love watching you, but you know, the human corridors that we hear about where they're supposed to be an escape for people from Ukraine.",
    "(COMMERCIAL BREAK)\nWATTERS: President Biden getting more desperate after failing to gaslight the American people into thinking that Putin is behind higher gas prices.",
    "Jen Psaki was asked about it again today in the White House press briefing and her answer is always that this is a priority for him to address these price spikes.",
    "And that for us to believe that Putin will submit to the mother of all negotiations that Greg keeps promoting, I think is extremely naA_ve, with all due respect.",
    "Are you suggesting that those companies are engaging in illegal activity by falsely propping up gas prices because if you are, they should be held accountable?",
    "We have heard for many years about the open doors but we also heard that we can't enter those doors and this is truth and we have simply to accept it as it is.",
    "If you can't take the capital and you just get your artillery destroyed and you can't even go in and kill the president, the Ukrainians win in that scenario.",
    "SMITH: Can I just get this one last point in there because the White House and the Democrats like to tout the 9,000 leases that are not getting tapped into.",
    "And now you've got these two Democrats, Sheldon Whitehouse and Ro Khanna, they want to tax the oil companies more in a moment where we actually need them.",
    "Does anything suggest dysfunction more eloquently than that visible problem were all of these people, whatever their background, are all over the place?",
    "SMITH: I hope she watched her back every time she turned a corner or walked down a block because it's scary in New York City right now and that is fact.",
    "You have a cultural institution, the Museum of Modern Art, you are a young woman working behind the desk and some guy -- a normal-looking guy comes in.",
    "So while we're going la di da di da di da, why don't we consider our parents, our grandparents, the people who fought the wars, who built the streets.",
    "I think that people who are optimistically forecasting that they're running out of ammo or the offensive is petering out are -- they don't know Putin.",
    "GREG GUTFELD, FOX NEWS HOST: Well, you know, I want to talk about Ben, but first, the fact that Joe is announcing that he's going to Europe next week.",
    "An apartment building was hit and this as the Russian army attempts to bring forces from the north and the east to surround the capital city of Kyiv.",
    "But here's the bottom line is lawyers then come out and they say we can't have him in protective custody because it's a danger to his mental health.",
    "GERALDO RIVERA, FOX NEWS HOST: I don't think enough will be enough for Putin and less and until Ukraine is absolutely crushed, crumbled, destroyed.",
    "According to reports, Russian forces are getting low on equipment and manpower and may only be able to fight full strength for 10 to 14 more days.",
    "PIRRO: But I also want -- but I also want to talk about a segment of our population that we haven't talked about, and that's the senior citizens.",
    "There you see Sasha in the background that little person, just 24 years-old, dead now as is the cameraman in this photo, Pierre Zakrzewski, dead.",
    "RIVERA: Erica was in town, Sandra, over the weekend and went shopping on Madison Avenue, noting some of the stores still closed from the riots.",
    "We're supposed to help the mentally ill but we leave them on the streets and we let them -- you know, maybe we just treat them like criminals.",
    "She suffered multiple contusions, lacerations, bleeding on the brain, and other Asian women victimized in stable condition after that assault.",
    "(BEGIN VIDEO)\nELLIE ZEILER, TIKTOK STAR: I had the opportunity to ask the White House why gas down the street is $7 and here's what they said.",
    "He said this is why this is the most dangerous phase of this invasion right now and why the U.S. must manage this moment extremely carefully.",
    "So, we have to make it -- we're putting you in a psych ward because you put this noose around your neck before you might put it around again.",
    "The only people who are making windfall profits are Russia and Venezuela is about to make some, but let me just comment on the TikTok first.",
    "But since I'm not going anywhere near the war, I'm sure as hell not going to tell a single person to go there and die in a foreign country.",
    "We're monitoring the latest from Ukraine but in the meantime, a suspected serial killer nabbed after a murder spree in two liberal cities.",
    "The actor of sentenced to 150 days behind bars for staging a hate crime is demanding to be set free after spending only five days in jail.",
    "Because he knows that everybody -- it's so -- it's such an ironic mind-bender because he was the person who put the noose around his neck.",
    "Because as we've seen, Biden leads from behind, and that's the only way you're going to get any action out of that guy unless he's pushed.",
    "She was going up the stairs when a career criminal in an unprovoked attack, grabbed her, 62-years-old, threw that nurse down the stairs.",
    "RIVERA: In Ohio yesterday, Mike DeWine, the governor, passed the law that allows concealed carry even without a license or any training.",
    "RIVERA: Get them into you -- because the only -- the only red line right now is the blood of the Ukrainian people fighting the Russians.",
    "That they are closed essentially and that is the more Putin is bombing, the more Putin is shelling, the more people are getting killed.",
    "I ask them what could be done to increase and incentivize more drilling, obviously, more oil production to bring those gas prices down.",
    "PIRRO: And that's one of the problems with this administration, not saying what they will do and telling the world what they won't do.",
    "They actually see it, which is why when I'm sitting here, for me, I must be as anti-war as possible until I can no longer be anti-war.",
    "(BEGIN VIDEO CLIP)\nJEN PSAKI, WHITE HOUSE PRESS SECRETARY: We don't like red lines around here so I'm not going to use that phrasing.",
    "SMITH: All right, so Jussie Smollett's family announced that they received a call where the caller used racist and homophobic slurs.",
    "I mean, that's basically, you know, we are not going to take a stand or maybe they're just keeping their cards close to their vest.",
    "Now with Putin starting this horrific fight between Ukraine and Russia nobody wants to work with him and do an international trade.",
    "He's meeting with these -- he's meeting with the oil people, the gas people because he's not concerned with pleasing 20-somethings.",
    "RIVERA: Many politicians of various stripes have pondered cutting off the excise, the gas tax and all comes to the same conclusion.",
    "It is now under a 35-hour curfew as imposed by Mayor Vitaly Klitschko who said Kyiv is now the forward operating base for freedom.",
    "(BEGIN VIDEO CLIP)\nSEN. TOM COTTON (R-AK): What we should stop doing is worry about what Vladimir Putin thinks will be escalatory.",
    "I never thought anything could be more ridiculous than when Kamala Harris had those young child actors helper in that space video.",
    "We've been showing this for two and a half years, this crime wave, and everybody knows what needs to be done, but no one does it.",
    "You just better hope that if you get shot or stabbed, that you don't die, because justice isn't coming, the cavalry isn't coming.",
    "And don't think all you social justice warriors, don't think that you're saving one guy because he committed or made one mistake.",
    "WATTERS: Are you -- are you now on board with the Putin price hike after watching that young lady sell you on the talking points?",
    "And President Zelenskyy who is set to address Congress tomorrow is signaling a possible breakthrough about wanting to join NATO.",
    "(COMMERCIAL BREAK)\nGUTFELD: New fears, Vladimir Putin is ramping up his brutality because time is running out for his military.",
    "And the thing that pisses me off most about him is that he's handsome and he's funny and we joked about what went on THE FIVE.",
    "Why not use an app favored by 12-year-olds that's created by China that has infiltrated and mangled so many adolescent brains?",
    "SMITH: President Zelenskyy said today that 97 children have died in his country since the beginning of this and that's awful.",
    "We've got a bully in the in -- the in the yard, in the playground yard, in the schoolyard and everybody's back at the fence.",
    "But mostly noticing how prevalent homeless people are on the premier shopping boulevard of the premier city in the country.",
    "But right now the Biden administration is not only hurting the Americans and all this hashtag blame Putin TikTok nonsense.",
    "And another man has been charged with a hate crime -- look at this animal - - for the horrific beating of an Asian woman.",
    "You created a tremendous problem for this country, dividing us and putting salt in an old wound having to do with racism.",
    "RIVERA: Can you believe --\nWATTERS: And they're going to go to work tomorrow in Albany and not do a damn thing about it.",
    "You know, this suspect is was homeless, probably mentally ill. All these people stabbing people, homeless, mentally ill.",
    "RIVERA: Well, first of all, he's obviously referencing Jeffrey Epstein and worrying that he could have the similar fate.",
    "Because it's like those TV hosts that were telling you to stay home indefinitely during COVID because they still worked.",
    "GUTFELD: I was sitting around going like could there be a move that's any more unserious than sending kamala to Poland?",
    "But I'm worried that in prison, there's going to be two red hat-wearing MAGA supporters who will inevitably target him.",
    "SMITH: So he's saying a lot, including his brother, who says he, Jussie, wants to let folks know that he's very stable.",
    "And stop this act or nonsense, where you're the victim and you should be freed because you're -- you may be in trouble.",
    "This guy is lucky that he was sentenced in a state where he only has to serve half of the time that the judge gave him.",
    "All we have to do is we have enough oil in Canada, the United States, and Mexico, and we could be our own superpowers.",
    "And we had General Kellogg on the show last night and he said we have to send them the Patriot Missile Defense System.",
    "(END VIDEO CLIP)\nWATTERS: And transportation secretary, Pete Buttigieg isn't even focused on the surging gas prices.",
    "And that is just one example of the many unprovoked attacks that are happening in these cities all over the country.",
    "I don't see why just because you are in favor of a green future, you can't do practical -- I'm a pragmatic idealist.",
    "We should get off the back foot, get on the front foot and make Vladimir Putin worry about what will be escalatory.",
    "GUTFELD: You know, Geraldo, we were talking in the green room that we keep -- we keep hearing competing narratives.",
    "Meaning if they find him, you know, in an attempted suicide or suicide --\nRIVERA: They had a noose around his neck.",
    "Fighting continues to rage in Ukraine as the country's president, Zelenskyy is set to address Congress tomorrow.",
    "MIKE TOBIN, FOX NEWS CORRESPONDENT: Well, judge, just about every night is a rough night in the city of Kharkiv.",
    "Well, it seems like the slaughter is continuing and it's getting worse by the day, Geraldo, I'll start with you.",
    "You can't say you're stable, and then say your mental health has bothered because you're in protective custody.",
    "Do you think that his lawyers are going to effectively make the case that he shouldn't ride out his sentence?",
    "Now, remember those four years, it was -- it seemed chaotic, but it was relatively stable on the world stage.",
    "They've got the permits issued, but then create a friendlier environment for those energy companies to drill.",
    "They can't afford to pontificate at all because they're always in danger and that's kind of been my lodestar.",
    "President Biden is headed to Europe and NATO headquarters next week as Russia launches more barbaric attacks.",
    "A missile strike hitting an apartment building in Kyiv sparking a massive fire and destroying it completely.",
    "You could even send them the Russian-made ones, the S300's, and you basically can take out a cruise missile.",
    "(END VIDEO CLIP)\nGUTFELD: And Republican Senator Tom Cotton calling on Biden to actually stand up to Putin.",
    "Maybe you pay a visit to his girlfriend in the Swiss Alps chalet, knock on the door with a stripper graham.",
    "PIRRO: The reason -- the reason he's in protective custody is because he said his life is being threatened.",
    "It is to the far east of the country, very near the Russian border and it was one of the first cities hit.",
    "She was rushed to the hospital, the very hospital where she has worked for 25 years helping other people.",
    "He said, we are the consequences of the likes of which few throughout history have ever suffered before.",
    "Judge, should he be let out of his 100 day sentence in jail because it may risk his ability to survive?",
    "Exxon, Chevron, BP and Shell are all enjoying the highest profits they have in seven and a half years.",
    "It if this is a limited war, it makes no sense to not take those patriots and get them into Ukraine.",
    "So, in case you think as an actor, you're more important than you really are, that you're protected.",
    "He can cause people to be very emotional and I think it's going to -- he's going to do a great job.",
    "Why don't you just shut up, get your three meals a day, and you're caught, and serve this sentence?",
    "Russia is one of the top three producers of oil and it is actually their number one revenue source.",
    "A jury of your peers convicted you, a judge has sentenced you, and you are legitimately in a jail.",
    "And I think -- I think that tomorrow in Congress, I think that's Zelenskyy will be very effective.",
    "So, the question that I asked you, Geraldo, is why didn't Putin do this when Trump was President?",
    "PIRRO: Didn't we just have --\nRIVERA: But you can't -- you can't get rid --\nWATTERS: Oh, Geraldo.",
    "I'm Judge Jeanine Pirro along with Geraldo Rivera, Jesse Watters, Sandra Smith, and Greg Gutfeld.",
    "RIVERA: -- Exxon, Chevron, BP, Shell, I mean, why don't we look to them and say what's going on?",
    "RIVERA: Next, convicted hate crime hoaxer Jussie Smollett already scheming to get out of prison.",
    "He Alexander Jay, 40 years old, cement steps, she suffered a broken clavicle, three broken ribs.",
    "WATTERS: You can't live in a society if half the society doesn't want to live in a civilization.",
    "And therefore we are letting Putin determine the next moves of the United States in this fight.",
    "He said, \"instead of saying what we won't do, in this moment, we need to say what we will do.\"",
    "Is there some kind of like a special episode of Matlock that he's watching that he's too busy?",
    "And these fine people now struck down in the prime of their lives just a child, 24 years-old.",
    "It's a horrible thing that happened to him and he's a -- to sound British, he's a lovely guy.",
    "He's in very good health and ready to take on the challenge that has been put up against him.",
    "RIVERA: Our thoughts and prayers with our colleague, Benjamin Hall, our brave correspondent.",
    "SMITH: -- he's going to make his statement very heard for U.S. members of Congress tomorrow.",
    "(BEGIN VIDEO CLIP)\nVOLODYMYR ZELENSKYY, PRESIDENT OF UKRAINE: Ukraine is not a NATO member.",
    "I think that that was strategic error regardless of the TikTokian (ph) presentation there.",
    "RIVERA: You are -- you're in these -- in solitary confinement, you have no one to talk to.",
    "The racist punk stomping, punching the 67-year-old woman in the head more than 125 times.",
    "People who are committing these crimes are committing them over and over and over again.",
    "WATTERS: Are you now convinced everything is okay after watching that TikTok propaganda?",
    "TikTok might be the most effective cyber warfare in history because it's in every house.",
    "They don't remember Hitler and Napoleon, how they underestimated the Russian army also.",
    "So ahead, the White House says there's no red line when it comes to Putin's atrocities.",
    "You know, there's another part of this that we talked about before it drives me crazy.",
    "Boris Johnson, the guy whose hair looks like somebody dumped a bowl of linguine on it.",
    "WATTERS: And Tesla just raised their prices because of all the supply chain problems.",
    "His invasion of his neighboring sovereign nation is as barbaric as it is unjustified.",
    "RIVERA: When you see that he was --\nPIRRO: He didn't invade when Trump was president.",
    "And they are very quick to say what they will not do and not broadcast what we won't.",
    "But then you look at the map, and the map doesn't look -- the map doesn't look good.",
    "RIVERA: How do you know that Putin didn't think Trump would give him Ukraine anyway?",
    "And I'm not surprised that this guy, one of the attackers, had 22 prior convictions.",
    "It's not just here but the one attack in Seattle stood out to me and broke my heart.",
    "GUTFELD: And Geraldo, you don't see that -- you will not see that on other networks.",
    "WATTERS: You know, he is behaving exactly how we expected Jussie Smollett to behave.",
    "And that would really be the decisive action to make Putin --basically he's blocked.",
    "If we get rid of the gas tax --\nWATTERS: We just spent trillions on infrastructure.",
    "I don't -- I do get death threats but they're usually from Dana on pink stationary.",
    "SMITH: The caller also said that they hoped someone would take care of him in jail.",
    "WATTERS: We're going to do some profiteering right now and go to commercial break.",
    "And then he told Putin that if he invaded Ukraine on his watch, he'd nuke Moscow.",
    "WATTERS: We can't do anything if the liberals won't help us do anything, Geraldo.",
    "If this is a limited bore now, it makes no sense to me not to deliver the May 29.",
    "I'm not going to -- it's like the boy who cried wolf except you did it last time.",
    "As for Ben, I spoke to him last week at length after we had our little kerfuffle.",
    "And Greg, I mean, at some point, I mean, America has to start drawing a red line.",
    "So, what can the Ukrainian people hope for in terms of what our limitations are?",
    "I concede that President Biden blew it when he crushed domestic oil production.",
    "RIVERA: And how do you know -- how do you know that Putin wasn't playing Trump?",
    "So, we're just sitting here complaining because liberal politicians don't care.",
    "Talk to Chevron, Exxon, BP and Shell and say listen, you guys are doing great.",
    "But it's just, again, it shows you how unserious we are about ending this war.",
    "Certainly, President Biden when he visits Brussels next week, possibly Poland.",
    "Now, he's resorting to teenage TikTok stars to push his price hike propaganda.",
    "He's doubling down on his aggressions even as his strategic position weakens.",
    "But if they are, then evidence should be provided because that's a big claim.",
    "I'm so angry and at the same time I feel so helpless to do anything about it.",
    "He says he believes Putin got in his ear and threatened escalation if you do.",
    "They -- they're looting -- they don't have supplies, but they'll loot anyway.",
    "And you can't disarm a public if you also have no consistent law enforcement.",
    "We talked about how horrible things are, but then we go like, what do we do?",
    "So, as a guy in an air conditioned studio, I'm not going to beat a war drum.",
    "But we can afford to pontificate because we're here thousands of miles away.",
    "Sasha Kuvshynova, their local producer and translator and guide also killed.",
    "We send him our condolences for the loss of his colleagues, our colleagues.",
    "RIVERA: But the gas tax is the only thing that keeps the highways together.",
    "The White House deploying TikTok stars to blame soaring gas costs on Putin.",
    "You eat, you know, your steak and your salad and your unsweetened iced tea.",
    "Despite evidence of war crimes, the White House saying there is no redline.",
    "You see if you're watching, we have a lot of times, we have her briefings.",
    "Maybe a naval blockade, maybe the missile defense system that I suggested.",
    "And you know enough with people laughing at him because he was a comedian.",
    "I learned that lesson with Iraq and I'm never gonna go through that again.",
    "This man is a man who stands tall and stand tall I think for all history.",
    "That's the -- that's the front line of humanity, civilization right now.",
    "GUTFELD: I guess when -- if the cavalry isn't coming, that's a solution.",
    "JESSE WATERS, FOX NEWS HOST: He could get there during a hostage crisis.",
    "(END VIDEO CLIP)\nPIRRO: Mike Tobin is in Lviv, Ukraine with the latest.",
    "WATTERS: Yes, I mean, this is what you should be doing with your time.",
    "And you know, Sandra, I mean, you know, I watch your show every day.",
    "WATTERS: But you own stock --\nGUTFELD: The answer is always the tax.",
    "Copy: Content and Programming Copyright 2022 Fox News Network, LLC.",
    "Smollett's lawyers claim being locked up is a danger to his health.",
    "They're being crushed while this president only cares about TikTok.",
    "And here are the latest examples of the wicked battle being waged.",
    "RIVERA: (INAUDIBLE)\nSMITH: Greg, I wish you could respond to this.",
    "It causes kids to do really bad stuff to each other and to others.",
    "SMITH: If he does, he hasn't broadcast them or said what they are.",
    "So that's what they need to do and they need to do it immediately.",
    "Ben's job is to go there and delineate the truth through imagery.",
    "They acknowledge that, and say that all options are on the table.",
    "WATTERS: I remember when Trump just threatened to nuke everybody.",
    "Ask the German women who they feared at the end of World War II.",
    "I know it in my -- in my DNA from having done this for 30 years.",
    "So, we keep pointing out these liberal laws and nothing changes.",
    "They go, I mean, it's like -- and yet we're polluting ourselves.",
    "That city could be completely surrounded and he has no leverage.",
    "Possibly we could hear something different from this president.",
    "I want you to know that we are a family and we mourn this loss.",
    "All he has to do is turn to America and let us be the strength.",
    "(END VIDEO CLIP)\nGUTFELD: So, Sandra, they don't like redlines.",
    "SMITH: You know, again, I think tomorrow will be a big moment.",
    "Quit letting him set the terms of how we will support Ukraine.",
    "Here is what I think as far as the progression of all of this.",
    "It's about the fact that Trump had everybody against the wall.",
    "It's our fault that they're running around and victimizing us.",
    "He's upset, you know, that his permit was revoked or whatever.",
    "(COMMERCIAL BREAK)\nSMITH: Jussie Smollett will not go quietly.",
    "GUTFELD: You know what, they're worried about Hillary Clinton.",
    "Do you know the average price of an electric vehicle is today?",
    "But I am absolutely 100 percent against solitary confinement.",
    "Remember, my button is bigger than yours and my button works.",
    "It's like your typical, you know, Washington business lunch.",
    "And then he said all options were on the table in Venezuela.",
    "Senior citizens drive cars with internal combustion engines.",
    "RIVERA: Yes, like a prison -- you know, like the kids go to.",
    "We're talking about apartment buildings now, civilian buses.",
    "Does it say that I guess Biden doesn't have any real fixes?",
    "WATTERS: Geraldo, you know what they did today in Congress?",
    "See, the people that are committing --\nRIVERA: 24-year-old.",
    "So, maybe we just stop -- like, what are we supposed to do?",
    "That might be my favorite conversation of this whole year.",
    "RIVERA: How do you know --\nPIRRO: All we -- wait a minute.",
    "Remember, where you could see with your own eyes the moon.",
    "Meanwhile in China, they use TikTok to educate their kids.",
    "But what Ben and his co-workers do, they don't imagine it.",
    "This is a rush transcript of \"The Five\" on March 15, 2022.",
    "This copy may not be in its final form and may be updated.",
    "Geraldo said war is the worst thing that you can imagine.",
    "This is -- what we need is audacious diplomacy right now.",
    "So I would suggest you do something dramatic before then.",
    "SANDRA SMITH, FOX NEWS HOST: They're running out of time.",
    "I'm getting involved with the transfer of those MIG jets.",
    "You know, I like that line, all options are on the table.",
    "You're not going to --\nGUTFELD: And what's your solution?",
    "They continue on their crime spree until they're stopped.",
    "So, what they did was they put you in protective custody.",
    "We're going to have more breaking news from Ukraine next.",
    "You could star as the -- as the head of the prison gang.",
    "GUTFELD: You know, he also said that he wasn't suicidal.",
    "Then go to the Department of Justice and tell them that.",
    "Does he want to stick around here for St. Patrick's Day?",
    "War is not the romantic panorama you see in the movies.",
    "And Benjamin Hall, you know, in the fight for his life.",
    "He was going to designate the cartels as terror groups.",
    "It's like he's a NATO hawk, but a typical liberal dove.",
    "What we are seeing right now is --I can't say the word.",
    "He's making it all about him, so he gets his attention.",
    "And you're never going to get any kind of retribution.",
    "This is what -- this is what we voted for in New York.",
    "They're very expensive, about $100 million per system.",
    "WATTERS: We're meeting with teenagers --\nGUTFELD: Yes.",
    "SMITH: So are we --\nRIVERA: Look to the oil companies.",
    "WATTERS: Yes, but they should insert it into Ukraine.",
    "It is easy to talk about war at home as Geraldo says.",
    "And now his brutality has struck the Fox News family.",
    "And don't tell me that Putin isn't afraid of someone.",
    "Gutfeld has worst death threats every Monday morning.",
    "But then I realized, everyone in jail is a Democrat.",
    "(CROSSTALK)\nPIRRO: He needs to shut up and sit down.",
    "Geraldo said it's not about Biden, it's about Putin.",
    "He doesn't care -- he'll send those troops charging.",
    "War is hell, judge, we talk about that all the time.",
    "RIVERA: They put it on the border already of Poland.",
    "WATTERS: Unless the government cut the gas tax then.",
    "It's basically delivering crap to our kid's brains.",
    "RIVERA: It doesn't (inaudible) necessarily illegal.",
    "And I don't bring up President Trump that much, OK.",
    "Jen Psaki said, I'm about no consequences to crime.",
    "But that seems even worse, but we've got no choice.",
    "He jumps the desk to stab you and your girlfriend.",
    "PIRRO: The people that are committing -- coworker.",
    "Because if they drill, guess what they have to do?",
    "They are the -- they are defending the free world.",
    "You could come out of this and write a screenplay.",
    "You could take out fixed- wing aircraft like that.",
    "We are quite adequate regarding our understanding.",
    "When do you think enough will be enough for Putin?",
    "Official saying at least three people were killed.",
    "It is 5:00 in New York City and this is THE FIVE.",
    "PIRRO: Well, so many people are feeling helpless.",
    "Anyway, coming up, Biden's price hike propaganda.",
    "For the average American consumer, it is painful.",
    "Biden should admit that he made a terrible error.",
    "So, what we're asking is Joe, order off the menu.",
    "That means you can go drone inside Mexico proper.",
    "Biden is responsible for the decline of the West.",
    "RIVERA: Mentally ill or not, a crime is a crime.",
    "RIVERA: No, my solution is you have to beat him.",
    "They can't even think about an electric vehicle.",
    "It's no more, you know, just military buildings.",
    "I mean, he's really after the Ukrainian people.",
    "They got the camera crew coming to their house.",
    "WATTERS: So they can't spin that as offensive.",
    "They're telling you on TikTok to go buy an EV.",
    "We send our condolences, our deep condolences.",
    "Unless they're profiteering, leave them alone.",
    "WATTERS: They made Daylight Saving permanent.",
    "PIRRO: I don't give a damn what Putin thinks.",
    "Benjamin, as I mentioned, grievously injured.",
    "It is, judge, something that is so appalling.",
    "JEANINE PIRRO, FOX NEWS HOST: Hello everyone.",
    "So these batteries, they are surface to air.",
    "I understand that they are still in trouble.",
    "Whether that changes anything, I don't know.",
    "WATTERS: And that's what they're busy about.",
    "WATTERS: He threatened to nuke the Iranians.",
    "It says that we should be setting the terms.",
    "He said, I'm not suicidal, I'm not suicidal.",
    "They pretend that it's for your protection.",
    "PIRRO: I mean, you can't have it both ways.",
    "And I listen to Jen Psaki every day, judge.",
    "Shut up, sit down, and serve your sentence.",
    "And he was a wuss when Trump was president.",
    "They were divorced from their consequences.",
    "We still don't know what those options are.",
    "You know that -- I was thinking about this.",
    "The capital city, Kyiv, took more pounding.",
    "SMITH: So, let me just ask you a question.",
    "(END VIDEO CLIP)\nRIVERA: Why do you laugh?",
    "And don't think it was anything different.",
    "You keep saying you don't have a solution.",
    "Use this to bone up on your craft, Jussie.",
    "And with Sasha and Pierre, rest in peace.",
    "Putin has utter disregard for human life.",
    "That's according to U.K. defense sources.",
    "RIVERA: Look at this -- look at this guy.",
    "This is just like talking about the war.",
    "They memorialized Daylight Savings Time.",
    "I know we're talking about New York now.",
    "RIVERA: I think that is not about Biden.",
    "This is an existential crisis right now.",
    "WATTERS: I didn't want to bring that up.",
    "But I did -- I did look into that today.",
    "GUTFELD: -- it won't be -- yes, exactly.",
    "And now, he say, I'm not going to do it.",
    "And debating over MIG's forget about it.",
    "It's something that is deeply heartfelt.",
    "You know, you have a great opportunity.",
    "SMITH: All right, We'll leave it there.",
    "(COMMERCIAL BREAK)\nPIRRO: Welcome back.",
    "WATTERS: And then he threatened Mexico.",
    "You can -- stop advertising everything.",
    "And they have this all over the street.",
    "She was on her way at the rail station.",
    "We've been doing this for three years.",
    "He only has to serve 75 of those days.",
    "So, he threatened to nuke North Korea.",
    "Zelenskyy is going to --\nGUTFELD: Yes.",
    "Let's get to our quick final thoughts.",
    "GUTFELD: Maybe a petting zoo, Geraldo.",
    "\"SPECIAL REPORT\" is up next with Bret.",
    "RIVERA: He could produce it in prison.",
    "And I hope to God he makes it through.",
    "You can take out a ballistic missile.",
    "And that's a big part of this moment.",
    "But this, Sandra Smith, is also true.",
    "He's on top of the energies question.",
    "WATTERS: You want him in general pop?",
    "RIVERA: I was worried about that one.",
    "PIRRO: Is this a capitalist society.",
    "Biden's approach is so conventional.",
    "He should be in some farm someplace.",
    "We are so sorry about what happened.",
    "WATTERS: -- on social media, Sandra.",
    "I speak to the oil and gas industry.",
    "That definitely put me over the top.",
    "SMITH: Brain room (ph) says $60,000.",
    "You already spent the money on that.",
    "They still got their damn paychecks.",
    "PIRRO: I have a couple of thoughts.",
    "They cannot afford an electric car.",
    "She's a longtime healthcare worker.",
    "PIRRO: It's not about loving Trump.",
    "They commit mistake after mistake.",
    "PIRRO: They are on a fixed income.",
    "GUTFELD: Jesse, what should we do?",
    "Our love to you and your families.",
    "WATTERS: He needs to go to a farm.",
    "The siege on Mariupol is constant.",
    "No major announcement made so far.",
    "This is what we're talking about.",
    "RIVERA: Petting zoo would be fun.",
    "It's really solitary confinement.",
    "So, here's what I suggest you do.",
    "RIVERA: You look related you two.",
    "PIRRO: Let me tell you something.",
    "But let me make one thing clear.",
    "RIVERA: Is that the (INAUDIBLE)?",
    "So you're getting rich, Geraldo.",
    "GUTFELD: Yes, thank you, Sandra.",
    "That was a very important thing.",
    "They call it protective custody.",
    "You count the tiles on the roof.",
    "It's reckless and irresponsible.",
    "Sometimes it's self-mutilation.",
    "He knows he is losing, he said.",
    "Like I said, they're from Dana.",
    "And that has to come to an end.",
    "We can crow about this old day.",
    "PIRRO: I disagree with Geraldo.",
    "Arrest them and put them away.",
    "WATTERS: That's what they did.",
    "Senator -- what's the senator?",
    "RIVERA: They are profiteering.",
    "He could produce it in prison.",
    "GUTFELD: You have no solution.",
    "PIRRO: Oh, I didn't get that.",
    "WATTERS: Make sense, Geraldo?",
    "WATTERS: They always do that.",
    "The crime is running rampant.",
    "And I know this, I know this.",
    "Send them the missile system.",
    "That would be a game changer.",
    "He's just worried about P.R.?",
    "SMITH: So what's your point?",
    "That is the same thing here.",
    "Last night was no different.",
    "When you --\nPIRRO: Oh, stop.",
    "The Russians are on the run.",
    "That might not work, though.",
    "They cannot afford anything.",
    "GUTFELD: No, it's profiting.",
    "RIVERA: Now, do me a favor.",
    "Now go out there and drill.",
    "I think that you can do it.",
    "I only care what Putin did.",
    "RIVERA: People really know.",
    "You get out one hour a day.",
    "PIRRO: Yes, very, very sad.",
    "He is a great communicator.",
    "PIRRO: That's the question.",
    "That's a defensive system.",
    "There's no doubt about it.",
    "He said that on the phone?",
    "He is destroying the West.",
    "GUTFELD: Judge, last word.",
    "What would those terms be?",
    "PIRRO: Is this capitalism?",
    "What do you make of that?",
    "GUTFELD: That's the term.",
    "They'll terrorize anyway.",
    "And that's the end of it.",
    "This stuff doesn't exist.",
    "He's being a drama queen.",
    "GUTFELD: I wish I could.",
    "Ask them what it's like.",
    "It is really punishment.",
    "He wasn't playing Trump.",
    "RIVERA: That's a weapon.",
    "How do you get it there?",
    "You go by they and them.",
    "WATTERS: Oh, just Pete.",
    "That's what we do here.",
    "I'm not in any danger.\"",
    "SMITH: Sen. Tom Cotton.",
    "RIVERA: I'm all for it.",
    "RIVERA: I'm all for it.",
    "That's the bottom line.",
    "WATTERS: Geraldo, farm?",
    "You go absolutely nuts.",
    "What about petting zoo?",
    "RIVERA: It is vicious.",
    "He knows the Clintons.",
    "GUTFELD: There you go.",
    "RIVERA: Let me finish.",
    "PIRRO: Yes, we all do.",
    "RIVERA: Who said that?",
    "GUTFELD: There you go.",
    "It's a it's a miracle.",
    "First comment on that.",
    "WATTERS: You're right.",
    "WATTERS: Yes, he does.",
    "They're not drilling.",
    "PIRRO: Oh, all right.",
    "That has not changed.",
    "You have to beat him.",
    "RIVERA: I love Trump.",
    "They just don't care.",
    "That gives me chills.",
    "PIRRO: You know what?",
    "My job is way easier.",
    "We pray for Benjamin.",
    "WATTERS: What's that?",
    "The spin is so hard.",
    "PIRRO: Thanks, Mike.",
    "He's a war criminal.",
    "ALL RIGHTS RESERVED.",
    "PIRRO: That was big.",
    "This is about Putin.",
    "WATTERS: Make sense.",
    "Spend those profits.",
    "WATTERS: All right.",
    "It's getting worse.",
    "Is that a solution?",
    "GUTFELD: It's true.",
    "Putin is the devil.",
    "We understand that.",
    "It's not romantic.",
    "SMITH: His family.",
    "GUTFELD: Yes, yes.",
    "What do you think?",
    "RIVERA: It's true.",
    "Remember that one?",
    "That's what it is.",
    "I can't remember.",
    "Leave them alone.",
    "PIRRO: I hate it.",
    "I love Trump too.",
    "All this is crap.",
    "Real quick, Greg.",
    "That's it for us.",
    "WATTERS: Come on.",
    "He's very strong.",
    "WATTERS: Geraldo.",
    "WATTERS: Geraldo.",
    "RIVERA: Aye, aye.",
    "What could it be?",
    "What could it be?",
    "He will not stop.",
    "It's just awful.",
    "We pray for him.",
    "They have rules.",
    "WATTERS: A farm?",
    "How do you know?",
    "He got 150 days.",
    "PIRRO: Oh, okay.",
    "That's the term.",
    "GUTFELD: Right.",
    "PIRRO: Oh, wow.",
    "PIRRO: Oh, yes.",
    "We got nothing.",
    "GUTFELD: Right.",
    "SMITH: Geraldo?",
    "So we lost two.",
    "And I said duh.",
    "Listen to this.",
    "There's no TV.",
    "He's an actor.",
    "He's bitching.",
    "That is awful.",
    "PIRRO: Sandra?",
    "That is awful.",
    "Let me finish.",
    "You know what?",
    "Look at this.",
    "Look at this.",
    "WATTERS: Yes.",
    "GUTFELD: Yes.",
    "It's obvious.",
    "GUTFELD: Yes.",
    "WATTERS: Yes.",
    "WATTERS: Yes.",
    "PIRRO: Jesse?",
    "He's moaning.",
    "GUTFELD: Yes.",
    "It's amazing.",
    "GUTFELD: Yes.",
    "I\nIt's funny.",
    "I don't know.",
    "PIRRO: Right.",
    "RIVERA: I do.",
    "PIRRO: Right.",
    "RIVERA: Yes.",
    "Look at him.",
    "It's a wuss.",
    "SMITH: Yes.",
    "Fight them.",
    "SMITH: Yes.",
    "Former U.S.",
    "We imagine.",
    "It's dirty.",
    "It's ugly.",
    "All right.",
    "I hate it.",
    "That's it.",
    "Prove it.",
    "Come on.",
    "Geraldo?",
    "Judge?",
    "Mike?",
    "Greg?",
    "Okay.",
    "Tom?",
    "No."
  ]
}