{
  "id": 10919,
  "mediaId": 3993,
  "date": "2022-03-15",
  "headline": "A (mostly) clean sweep for Constitutional Carry?",
  "image": "https://bearingarms.com/wp-content/uploads/media/2022/03/CAMCO_Youtube_Thumbnail_611-1110x740.png",
  "link": "https://bearingarms.com/camedwards/2022/03/15/a-clean-sweep-for-constitutional-carry-n56433",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cam Edwards",
  "authorUrl": "https://bearingarms.com/author/camedwards",
  "termIds": [
    5167,
    4906,
    5020,
    2143,
    4081,
    4258,
    6175,
    6241
  ],
  "sentences": [
    "I don’t want to start counting chickens before they’re hatched, but on today’s Bearing Arms’ Cam & Co we’re taking stock of the current crop of Constitutional Carry bills around the country, and compared to just a couple of weeks ago, the odds of a clean sweep (with one notable exception) are looking much better now that two of the five GOP-controlled states that have pursued Constitutional Carry bills this year have now enshrined the measures into law.",
    "Douglas Carter, who is Holcomb’s superintendent of state police has also been a staunch opponent of the Constitutional Carry legislation this year, and Holcomb recently said he stands behind the superintendent, while still putting some distance between himself and the content of Carter’s testimony.",
    "Already more than half of the U.S. population now lives in a Constitutional Carry state, and by the time the Supreme Court issues its ruling in a key case dealing with the right to carry in a few months more than half of the 50 states may very well have Constitutional Carry laws on the books.",
    "The untimely demise of that particular piece of legislation is worthy of a blog post of its own, but it also shouldn’t detract too much from the continued progress that we’re seeing when it comes to the full recognition of our right to bear arms in self-defense.",
    "In fact, I can’t recall a single Republican governor who has ever vetoed Constitutional Carry, though we have seen Democrats like John Bel Edwards in Louisiana and Tom Wolf in Pennsylvania shoot down the proposals after they were approved by lawmakers.",
    "Of the six Constitutional Carry bills introduced in Republican-controlled states this year, the only one that has no chance of passage is the bill in Florida, which was withdrawn from consideration last week after it failed to get a committee hearing.",
    "Holcomb’s office in support of the measure, but I’m impressed by what Second Amendment activists have been able to accomplish this year and I suspect that we’ll have more to celebrate in the days ahead.",
    "Holcomb doesn’t have long to act if he plans on vetoing the measure, because even if he doesn’t sign the bill it will become law seven business days after the legislation was transferred to his office.",
    "Holcomb may genuinely be torn about what to do with the bill on his desk, but I don’t think he really wants to be the only Republican governor to veto a Constitutional Carry bill this year.",
    "Kay Ivey signing a Constitutional Carry bill late last week, the number of Constitutional Carry states has now grown to 23, and there are two other bills that are awaiting signatures.",
    "Unlike Kemp and DeWine, Holcomb is not up for re-election this year, so he doesn’t have to worry about shoring up his base of support ahead of a contested primary.",
    "Brian Kemp has already indicated he’ll sign the Constitutional Carry measure that received final legislative approval last Friday, but so far Indiana Gov.",
    "Pete Ricketts has said that he will not only sign the bill if it gets to him, but that he wants to see the measure approved by lawmakers in Lincoln.",
    "While the legislation still needs a final vote, it did survive an attempted filibuster by Democrats last Friday, and Gov.",
    "I wouldn’t want to be a part of that club if I were Holcomb, even if I didn’t have to face voters this November.",
    "Eric Holcomb has been mum about what he plans to do with the bill that was sent to his desk last week.",
    "There’s also the Constitutional Carry bill that’s currently on the floor of the Nebraska Senate.",
    "We’re not across the finish line yet, and I’d encourage gun owners in Indiana to contact Gov.",
    "Mike DeWine signing SB 215 into law on Monday, and Alabama Gov.",
    "In Georgia, Gov.",
    "With Ohio Gov."
  ]
}