{
  "id": 11094,
  "mediaId": 2919,
  "date": "2022-03-09",
  "headline": "Q&A: Gov. DeWine discusses Ukrainian refugees, COVID-19 2 years later, gas prices in Ohio",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/ca79933/2147483647/strip/true/crop/640x336+0+12/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fa8%2Fd5%2Fa1bf751848c996b0b0f5944cbaae%2Fvlcsnap-2022-03-09-18h12m24s178.png",
  "link": "https://www.news5cleveland.com/news/local-news/q-a-gov-dewine-discusses-ukrainian-refugees-covid-19-2-years-later-gas-prices-in-ohio",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "News 5 Staff",
  "authorUrl": "https://www.news5cleveland.com/news-5-staff",
  "termIds": [
    2143,
    6672,
    6502,
    6474
  ],
  "sentences": [
    "CLEVELAND — In a wide-ranging Zoom interview covering a variety of topics important to Ohioans, News 5's Rob Powers spoke to Ohio Governor Mike DeWine Wednesday afternoon about an upcoming summit to discuss the potential resettlement of Ukrainian refugees in Ohio, where the state is in terms of the COVID-19 pandemic exactly two years after the first cases were confirmed in Ohio, and what DeWine thinks should be done to quell the skyrocketing price of gasoline in Ohio and the U.S.\nWatch the complete interview below:\nNews 5's Rob Powers: Ohio's always been a welcoming place, northeast Ohio in particular, we've already spoken to Ukrainians in Northeast Ohio, Parma in particular.",
    "And this meeting that we're putting together on March 17 is really one way that we can get people to come together and get better information about exactly what it will be like and what we'll be able to do if and when refugees come to Ohio.",
    "If you've already been vaccinated and you are at a high risk, let's say you have some medical problems or you're over 50 or 60 years of age or older, getting that booster shot is just really, really important.",
    "There's nine separate agencies that have been contracted by the federal government, and they have been involved, for example, in settling some of the Afghan refugees who have been sent to the state of Ohio.",
    "The thing that we do know is that with every variant that we've had, so far, that people who are vaccinated are so, so much safer and we just continue to encourage people to get vaccinated.",
    "When you talk to them — Fran and I were at St. Andrews a couple of weeks ago and talked to people who have family members in the Ukraine, and it's just gut-wrenching when you talk to them.",
    "You know, the whole idea is to make the settlement smooth, to make it work, to make sure that people have the help and the support that they need to get started in the United States.",
    "Both the number of cases, the percentage of positivity, and that very important number of how many Ohioans we have in the hospital who have COVID, and that number continues to drop.",
    "DeWine: Well, we have people from Ukraine in different parts of Ohio, but we certainly have a significant number of them in Parma and other places in Northeast Ohio.",
    "We will also have some people who have been refugees who have come here as refugees to the United States and they'll talk about what their experience has been.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "Just an average mom or dad who's taken their kids around to soccer practice or to other this time of year or to maybe basketball or something like that.",
    "We're getting a lot of calls in the governor's office from people who just want to help — people who say, \"I open my home, I'll do this, I'll do that.\"",
    "DeWine: Well, I think we feel it may be a little more because we have people from Ukraine who live here, who have family members back there.",
    "I think we're also united in our desire to help people who have fled the country and to help people who are who remain in the country.",
    "We don't know the role our state will play just now, but this summit is simply a way to toss ideas around if and when the time comes.",
    "We've come a long way from where we were and we're just hopeful that, you know, we don't hit another variant that spikes back up.",
    "We're going to have a panel of some of the agencies that in the past have been directly involved in resettling refugees in Ohio.",
    "Powers: Take it to a street-level here, I have been down State Road in Parma many times, and especially in the last week or so.",
    "For two years, I've watched the numbers and I've gotten a report every single day and so the numbers continue to go down.",
    "I think we're almost unanimous in our disgust for Putin and our belief that this is just horrendous what he is doing.",
    "So it made sense to have this meeting in Parma and put it in a place where we have a significant Ukraine population.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "But, I think if you look from the long point of view, what we have to do is become much more energy independent.",
    "Governor Mike DeWine: Well, the federal government will determine if and when we get refugees from the Ukraine.",
    "He is causing this horror today — more stories, schools being hit, and kids suffering and families suffering.",
    "It hurts people who use their car to work, and it hurts people who have any kind of commute at all.",
    "I mean, when you fill up your car and it's $80, you know, that's a lot of money or $4 a gallon.",
    "DeWine: Well, I don't think anyone knows, you know, how much further we have to go, for sure.",
    "It would seem so because Ohio has such a concentration of Ukrainians already in place here.",
    "But I think for all Americans, we've certainly been pulled together, I think, by this.",
    "The Biden administration said they were moving forward with [closing] the pipeline.",
    "So they'll talk a little bit about kind of how the process has worked in the past.",
    "What can we do about this and what do we just sit and wait for this to come down?",
    "Powers: Okay, governor, today on the way to work, I filled up my Jeep with gas.",
    "And this summit that we have put together is really informational for everyone.",
    "For the first time, it really hit that the cost of gasoline is skyrocketing.",
    "I think we have to be very aggressive in regard to being energy independent.",
    "Powers: Governor DeWine, thank you so much for a few minutes of your time.",
    "Why would it be important for eventual refugees to come to Northeast Ohio?",
    "I mean, we get calls, a lot of calls from people saying, \"What can I do?\"",
    "And so we thought it would be good to just have an informational session.",
    "Download now on your Apple device here, and your Android device here.",
    "Powers: Okay, I think we're going to jump off topic here if we may.",
    "Why is it so important to have the summit in Northeast Ohio?",
    "There's nothing that has really changed in regard to that.",
    "Two years ago today, Ohio saw its very first COVID cases.",
    "I'm going to bring it full circle and go back to Ukraine.",
    "There are two other things that we wanted to talk about.",
    "Is this a personal thing for you and for our state?",
    "That's going in the wrong direction, in my opinion.",
    "Is this effort, is this a personal thing for you?",
    "So we're certainly headed in the right direction.",
    "But it's important, I think, for us to be ready.",
    "Or is there a view that you have that I don't?",
    "That means that we have to open up pipelines.",
    "Learn more about our streaming options here.",
    "They happened to be here in Northeast Ohio.",
    "How far we have come governor in two years.",
    "I'm watching case numbers drop every day.",
    "So that message continues to be the same.",
    "The sun seems to be shining and it looks.",
    "I love the view outside your window.",
    "We're also on Amazon Alexa devices.",
    "How much further do we have to go?",
    "And you know, this hurts people.",
    "We can't be closing pipelines.",
    "DeWine: Well, it's very high.",
    "So yeah, it's very hurtful.",
    "Powers: Thank you for that.",
    "DeWine: The sun is shining!",
    "Powers: There's hope ahead.",
    "I really appreciate it.",
    "I appreciate that.",
    "DeWine: Thank you.",
    "Good to see you.",
    "Thank you, sir.",
    "Enjoy your day.",
    "It looks great.",
    "Thank you.",
    "Holy cow!"
  ]
}