{
  "id": 11366,
  "mediaId": 6598,
  "date": "2022-03-14",
  "headline": "Ohio Gov. Mike DeWine signs bill allowing people to carry concealed firearms without training or permits",
  "image": "https://www.cleveland.com/resizer/jcTOKQm_0Udh4HszhNntDmtOQQY=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/V7HF5OCQ2ZE4JNSPZNVTZVI774.jpg",
  "link": "https://www.cleveland.com/news/2022/03/ohio-gov-mike-dewine-signs-into-law-bill-allowing-people-to-carry-guns-without-training-or-permits.html",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Pelzer",
  "authorUrl": "http://www.cleveland.com/staff/jpelzer/posts.html",
  "termIds": [
    5814,
    1911,
    2143,
    1489,
    1126,
    6077,
    6474,
    6104
  ],
  "sentences": [
    "However, after a 2019 mass shooting in Dayton that left nine dead, DeWine responded to calls by Dayton residents to “do something” by introducing a package of moderate gun-reform proposals, including creating a voluntary state-level background check process for gun sales between private sellers, increasing state penalties for illegally selling a firearm and expanding the state’s existing “pink-slip” law to allow authorities to send people with drug or alcohol problems to a psychiatric hospital, where they cannot legally have access to guns.",
    "“Once again, he’s failed on both fronts, putting his own political interests over the safety and well-being of his constituents.”\nDean Rieck, executive director of the Buckeye Firearms Association, said in a statement that Monday “is a day that will go down in history” in Ohio.",
    "Mike DeWine on Monday signed Republican-backed legislation to allow people in the state to carry a concealed handgun without a permit or training and no longer require them to proactively tell law enforcement during traffic stops that they’re armed.",
    "SB215 will also no longer require motorists to proactively tell law enforcement about concealed handguns in their vehicles during traffic stops, though drivers would still have to truthfully say whether they have a gun with them if an officer asks.",
    "The governor, a Greene County Republican running against three other candidates in this year’s primary, was put in a tough spot over the bill, as he has made different statements to gun-rights and gun-control groups about his stance on gun policy.",
    "And I have a decision to make.”\nThe Ohio Democratic Party, in a release, said DeWine has sold out to “extremists and special interests at the expense of Ohio families and law enforcement officers.”\n“This bill will make all Ohioans less safe.",
    "Right now, drivers who fail to pre-emptively notify an officer in Ohio that they have a gun with them face a first-degree misdemeanor, punishable by up to six months in jail, a $1,000 fine and suspension of their concealed-handgun license.",
    "Even though people will no longer need a license to carry a concealed firearm in Ohio, many state residents will likely continue applying for permits so they can carry a concealed firearm in other states that still require a license.",
    "While DeWine has vowed to continue fighting for his gun proposals, last year he signed a controversial “stand your ground” bill to eliminate Ohio’s “duty to retreat” before using force in self-defense.",
    "When running for governor in 2018, DeWine indicated to the pro-gun rights Buckeye Firearms Association that he would support legislation to allow people to carry concealed firearms without a permit.",
    "Time and again, DeWine has promised to support law enforcement officers and ‘do something’ to combat gun violence in our state,” said state Democratic Party Chair Liz Walters in a statement.",
    "DeWine made a campaign promise to Buckeye Firearms Association and to Ohio’s 4 million gun owners that he would sign a Constitutional Carry bill if it was put on his desk,” Rieck said.",
    "When DeWine was asked Friday about the promises he made to gun-rights and gun-control advocates, the governor replied: “The job of the governor is to make tough decisions.",
    "Ohio will become the 23rd state to allow conceal-carry in public without needing a license, according to the National Rifle Association’s Institute for Legislative Action.",
    "Senate Bill 215, which takes effect in 90 days, allows anyone 21 or older to carry a concealed firearm unless state or federal law prohibits them from possessing a gun.",
    "Supporters of SB215 note that both the U.S. and Ohio constitutions guarantee the right to bear arms, and neither mention anything about training requirements.",
    "They also say that so-called “constitutional carry” will make Ohioans safer by lifting restrictions on their ability to carry a concealed firearm.",
    "“And he has fulfilled his promise.”\nNote to readers: if you purchase something through one of our affiliate links we may earn a commission.",
    "Hamilton County Sheriff Charmaine McGuffey and the Fraternal Order of Police of Ohio, among others, have come out against SB215.",
    "Opponents of the bill have said the legislation would make Ohio more dangerous for residents and law enforcement.",
    "Ohio currently requires conceal-carry applicants to take eight hours of training and pass a background check.",
    "COLUMBUS, Ohio — As of June 12, you no longer need a permit or training to carry a concealed handgun in Ohio.",
    "Those proposals, however, were dead on arrival in the Republican-dominated Ohio General Assembly.",
    "SB215 eliminates that penalty.",
    "“Gov.",
    "Gov."
  ]
}