{
  "id": 11396,
  "mediaId": 2656,
  "date": "2022-03-14",
  "headline": "VICTORY: Gun-Rights Advocates Score a MAJOR Win in Ohio",
  "image": "https://media.townhall.com/townhall/reu/o/2021/270/c004c71a-42ed-49b0-81d9-b1c4c1a23cf8-1110x740.jpg",
  "link": "https://pjmedia.com/news-and-politics/paula-bolyard/2022/03/14/victory-ohio-becomes-the-27th-constitutional-carry-state-n1566470",
  "mediaOutlet": "PJMedia",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paula Bolyard",
  "authorUrl": "https://pjmedia.com/columnist/paula-bolyard",
  "termIds": [
    0
  ],
  "sentences": [
    "DeWine, bill sponsor Sen. Terry Johnson, and the numerous Ohio senators and representatives for their unwavering leadership in making Ohio the 23rd state to enact permitless-carry legislation; a trend we aim to continue in the months and years ahead.”\nSB 215 is just the latest measure to chip away at burdensome firearm restrictions in the state, including the 2020 repeal of the “duty to retreat” bill that left victims of violent crime unable to defend themselves.",
    "“This completely flies in the face of Ohioans who have called time after time for commonsense gun safety legislation, not extreme bills that endanger the lives of our children and families.”\nThe Firearms Policy Coalition thanked those involved with the passage of the bill in a press release: “We recognize that this historic achievement in human liberty would not be possible without the dedicated effort made by the good people of Ohio.",
    "(3) The right of a person who is a qualifying adult to carry a concealed handgun that is not a restricted firearm that is granted under divisions (B)(1) and (2) of this section is the same right as is granted to a person who has been issued a concealed handgun license, and a qualifying adult who is granted the right is subject to the same restrictions as apply to a person who has been issued a concealed handgun license.",
    "(2) Regardless of whether the person has been issued a concealed handgun license, subject to the limitations specified in divisions (B)(3) and (C)(2) of this section, a person who is a qualifying adult may carry a concealed handgun that is not a restricted firearm anywhere in this state in which a person who has been issued a concealed handgun license may carry a concealed handgun.",
    "This is a great moment for Ohio and for those who wish to more fully exercise their Constitutional right to keep and bear arms.”\nRieck noted that DeWine had promised his group in a candidate questionnaire that he would sign a constitutional carry bill if it landed on his desk, saying that the governor has fulfilled his promise” to Ohio’s four million gun owners.",
    "The text of the legislation stipulates:\n(1) A person who is a qualifying adult shall not be required to obtain a concealed handgun license in order to carry in this state, under authority of division (B)(2) of this section, a concealed handgun that is not a restricted firearm.",
    "Buckeye Firearms Association (BFA) summarized the new law in layman’s terms:\nObtaining a concealed handgun license will become optional, so if you are able to legally carry a concealed handgun with a license, you will also be able to carry without a license.",
    "It should be noted that the new law only applies to “qualifying adults” who have resided in Ohio for at least 45 days, are age 21 or older, and are not otherwise prohibited from owning a firearm under state or federal law.",
    "“Once again, the Republican supermajority has passed dangerous permitless carry legislation that puts our communities at an even greater risk of gun violence than before,” argued House Minority Leader Allison Russo.",
    "The law removes requirements for training and obtaining a permit from the local sheriff’s office in order to exercise one’s Second-Amendment right to bear arms in the state of Ohio.",
    "To no one’s surprise, Ohio Democrats are blasting the bill—and you can bet they will be milking it for all it’s worth in the upcoming primary election.",
    "Instead, you must disclose that you are carrying a concealed handgun only when an officer asks, unless you have already notified another officer.",
    "In the House it passed 58-36, with no Democrats voting for and two Republicans, one of which said the bill does not go far enough, voting nay.",
    "Mike DeWine signed into law a bill that removes the state’s training and permitting requirements to carry a concealed handgun in the state.",
    "“The brass ring has always been to eliminate the licensing mandate, which people refer to as permitless carry or Constitutional Carry.",
    "As for me, 91 days from now I’ll be taking my firearms out for a walk around my neighborhood—and anywhere else I darn well please.",
    "Senate Bill 215, which takes effect in 90 days, will allow adult residents of the state to lawfully carry a concealed handgun.",
    "If you choose to obtain a concealed handgun license, you will no longer be required to carry the license on your person.",
    "Those who wish to utilize reciprocity agreements with other states will still need to obtain a license to do so.",
    "You will no longer have the duty to “promptly” notify every law enforcement officer during an official stop.",
    "“This is a day that will go down in history,” Dean Rieck, executive director of BFA, said in a statement.",
    "In the Senate, it passed 24-9 with all Republicans in favor and all Democrats against.",
    "The bill passed in both the House and Senate largely along party lines.",
    "BFA has a full list of gun-rights successes in the state here.",
    "The same rights and responsibilities apply in either case.",
    "On behalf of our members and supporters, FPC thanks Gov.",
    "And now, finally, that day is here.",
    "On Monday afternoon, Ohio Gov."
  ]
}