{
  "id": 11445,
  "mediaId": 2540,
  "date": "2022-03-17",
  "headline": "US governors look for ways to aid Ukraine, from field hospital kits to rebuilding funds",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220317134243-gavin-newsom-ukraine-supplies-0315-super-tease.jpg",
  "link": "https://www.cnn.com/2022/03/17/politics/governors-aide-to-ukraine/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maeve Reston and Eric Bradner",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "California's donation will be added to a much larger March 26 shipment -- including emergency and chronic disease medications, antibiotics and backpacks filled with supplies for emergency first responders -- that is being assembled by the California-based charity Direct Relief and flown via a FedEx 777 charter to Poland, with all items specifically requested by the Ukrainian Ministry of Health.",
    "Cox, a Republican, recently appeared at the launch of a fundraiser and community donation drive known as \"Driven to Assist,\" where private donors have pledged to match donations of up to $2 million as they also collect items for refugees like diapers, waterproof jackets, warm hats, mittens and base layers, as well as emergency thermal blankets, which will be flown to Europe.",
    "(CNN)As Ukrainian President Volodymyr Zelensky calls on US officials \"to do more\" to help his country, governors around the US are mobilizing to bolster shipments of humanitarian aid and other supplies, including at least one state sending personal protective and medical equipment it had been scrambling to acquire at the beginning of the Covid-19 pandemic.",
    "In a letter to the state legislature requesting rebuilding funds that would be used \"once the conflict has ended and the sovereign Ukraine is victorious, independent and free,\" the Republican governor said he hoped the pledge would \"spur others to contribute\" and \"show Putin that the free world stands together in support of Ukraine.\"",
    "At least 10 states have stopped selling Russian alcohol in their state-run liquor stores, but business analysts have questioned the efficacy of that move since very few US consumers buy vodka that is made in Russia and some smaller US companies that import it will be harmed by the boycotts.",
    "While some of the supplies California is offering Ukraine -- like PPE and ventilators -- were in critically short supply in the US just two years ago, the state now has an emergency stockpile that fills more than a million square feet of warehouse space, Newsom said.",
    "Phil Scott, a Republican who recently signed legislation to provide nearly $645,000 in humanitarian aid to Ukraine that is being sent through Save the Children, is supporting a body armor drive coordinated by Vermont law enforcement agencies through next Wednesday.",
    "\"What a gift for us, for all of us as taxpayers, as Californians, to do this, without any impact whatsoever in terms of our own capacity to maintain readiness and keep us safe,\" Newsom told reporters, describing the state as being in \"an abundant place.\"",
    "After loading and shrink-wrapping boxes for shipment alongside state emergency workers, the Democratic governor scrawled a message in black marker on one of the containers, promising that this would be just the first of multiple donations from his state.",
    "Phil Murphy, the Democratic governor of New Jersey, signed a new law last week unanimously approved by the legislature that aims to prevent companies that do business with the state from dealing with the Russian and Belarusian governments.",
    "The self-contained package of hospital beds, IV-starter kits and poles, tourniquets, trauma and oxygen supplies, and automated external defibrillators fits in a 53-foot trailer that will now be deployed in Ukraine.",
    "\"We'd be more than willing to work with other states, particularly if they have supplies that match the requests that we have from Ukraine,\" said Leighton Jones, Direct Relief's director of emergency response.",
    "Mike DeWine, a Republican, has asked law enforcement agencies to look for personal protective gear that could be shipped to Ukraine, including expired or extra helmets and body armor.",
    "Officials with Direct Relief said California's donation was the first the charity had received from a state government or municipality that had included surplus Covid-19 supplies.",
    "Newsom and a number of other US governors and municipal agencies are also collecting bulletproof vests, helmets and other protective equipment that has been requested by Ukraine.",
    "Jim Justice asked the legislature to approve $5 million in spending to help rebuild the maternity ward and children's hospital in Mariupol that was devastated by bombing.",
    "The equipment would be collected, DeWine's office said, only if a need is identified by US European Command, which is helping coordinate shipments of weapons to Ukraine.",
    "Direct Relief noted that medical-grade oxygen is critically needed in Ukraine and demand is likely to grow depending on both the course of the war and the pandemic.",
    "The idea for California's medical supply donations stemmed from a recent meeting between Newsom and Consul General of Ukraine in San Francisco Dmytro Kushneruk.",
    "Other states with defense contractors manufacturing weapons in their states have been touting the role that their state workers are playing in arming Ukraine.",
    "It would prevent companies with such ties from bidding on or renewing state contracts, working with state agencies and qualifying for tax abatements.",
    "Some states are also taking steps to divest their retirement funds from Russian-owned assets while severing other financial ties with Russia.",
    "Gavin Newsom helped pack up a field hospital kit designed for use during the pandemic to treat 50 patients over three days.",
    "Kay Ivey took to Twitter to boast about Javelin anti-tank missiles being manufactured by Lockheed Martin in Troy, Alabama.",
    "Spencer Cox, have joined forces with private donors to aid in the collection of donations.",
    "At a state disaster logistics warehouse in Solano County this week, California Gov.",
    "\"We want the last thing Putin ever reads to be 'Made in Alabama,'\" Ivey tweeted.",
    "Several other governors, including Utah Gov.",
    "Alabama Republican Gov.",
    "In West Virginia, Gov.",
    "Vermont Gov.",
    "Ohio Gov."
  ]
}