{
  "id": 11459,
  "mediaId": 2790,
  "date": "2022-03-16",
  "headline": "Politicians and experts debate whether gas tax holidays are worthwhile",
  "image": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400",
  "link": "https://www.npr.org/2022/03/16/1086832833/politicians-and-experts-debate-whether-gas-tax-holidays-are-worthwhile",
  "mediaOutlet": "NPR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Schaper",
  "authorUrl": "https://www.npr.org/people/2101136/david-schaper",
  "termIds": [
    0
  ],
  "sentences": [
    "SCHAPER: But consumers like 30-year-old Jessica Aguillar of Chicago, who are facing skyrocketing fuel costs on top of sharp price increases for just about everything else, want to be able to save even just a few bucks when filling their tank.",
    "SCHAPER: That was Georgia state Representative Jodi Lott, a Republican; Democratic Connecticut Governor Ned Lamont; Republican state Representative Steve Johnson of Michigan; and Maryland state Comptroller Peter Franchot, a Democrat.",
    "They're among the elected officials in at least 20 states proposing gas tax holidays of anywhere from one month to two years, which, depending on how high their state gas tax is, could save consumers up to 50 cents a gallon or more.",
    "DAVIS: You got to remember, the federal taxes are levied at the refinery, so there's no guarantee that that's going to - that savings is going to be passed on through the wholesaler and then the - gets it to the service station.",
    "SCHAPER: Another problem is that, like at the federal level, state and local gas taxes are often strictly dedicated to maintaining, repairing and replacing the very aging and crumbling roads and bridges that drivers rely upon.",
    "NED LAMONT: Now is the time to provide immediate relief, aid to the people in Connecticut, broadly in terms of inflationary pressures and specifically as it regards drivers getting hit at the pump.",
    "SCHAPER: These and other drivers are practically begging for relief, so from coast to coast, politicians are proposing measures to slash or temporarily suspend state and local gas taxes.",
    "SCHAPER: It's also an election year, which is why voters from Florida to Washington state and many states in between may be celebrating gas tax holidays later this year.",
    "This idea may seem good on paper, but there are concerns that gas tax cuts could reduce the funding that's available to fix and replace crumbling roads and bridges.",
    "But as of the moment, they're still near record highs, so politicians are proposing gas tax holidays to give consumers a little relief at the pump.",
    "(SOUNDBITE OF ARCHIVED RECORDING)\nMIKE DEWINE: We need this money to keep our roads going and repair our roads and make our roads safer.",
    "PETER FRANCHOT: And it would immensely help these low-wage earners who are getting back into the workforce and beginning to commute.",
    "I've been finding myself getting really empty quickly because I'm not filling my tank as I usually would 'cause of the gas prices.",
    "Transportation experts say such moves won't provide much relief and would cut into needed spending on roads, bridges and transit.",
    "(SOUNDBITE OF MONTAGE)\nJODI LOTT: This body has an opportunity to save Georgians near $157 million each month at the pumps.",
    "STEVE JOHNSON: We actually have the power here to reduce gas prices by 28 cents a gallon for every Michigander.",
    "SCHAPER: Meris Gonzalez is among those wincing as he pumps 10 1/2 gallons of gas on Chicago's northwest side.",
    "JESSICA AGUILLAR: Temporary relief is better than no relief (laughter), even if it's just for a little bit.",
    "SCHAPER: And Davis says even if Congress does cut the gas tax, it may not trickle down to the pump price.",
    "SCHAPER: The problem, he says, is that cutting the federal gas tax really won't save drivers much money.",
    "It's the reason Ohio's Republican Governor Mike DeWine opposes a partial repeal of his state's gas tax.",
    "(SOUNDBITE OF GAS STATION AMBIENCE)\nDAVID SCHAPER, BYLINE: The pain at the pump these days is palpable.",
    "Such proposals are not a surprise, says Jeff Davis of the nonpartisan Eno Center for Transportation.",
    "Especially with summer coming up, I'm sure a lot of people are going to be traveling a lot more.",
    "Visit our website terms of use and permissions pages at www.npr.org for further information.",
    "And several Democratic U.S. senators are calling to suspend the federal gas tax as well.",
    "This text may not be in its final form and may be updated or revised in the future.",
    "JEFF DAVIS: The public wants the politicians doing something about it.",
    "NPR transcripts are created on a rush deadline by an NPR contractor.",
    "As gas prices rise, politicians call for gas taxes to be suspended.",
    "The authoritative record of NPR’s programming is the audio record.",
    "DAVIS: Well, you know, we're paying $4 at the pump right now.",
    "SCHAPER: Twenty-six-year-old Miriam Khoshaba feels it, too.",
    "So I'm sure that people are going to appreciate that, yeah.",
    "Only 18.4 cents of that, per gallon, is the federal taxes.",
    "MERIS GONZALEZ: Gas prices are way too much, you know?",
    "Our pays are not going up, but the gas is going up.",
    "MIRIAM KHOSHABA: It's a lot of money (laughter).",
    "But they should be lowering it down, you know?",
    "RACHEL MARTIN, HOST:\nOil prices are dropping.",
    "(SOUNDBITE OF MUSIC)\nCopyright © 2022 NPR.",
    "So it would just be a mistake to do that.",
    "And so it's what comes up, unfortunately.",
    "Here's NPR's David Schaper from Chicago.",
    "Accuracy and availability may vary.",
    "People can't, you know, afford it.",
    "So gas prices may soon drop, too.",
    "David Schaper, NPR News, Chicago.",
    "They're now below $100 a barrel.",
    "A gas tax holiday is something.",
    "This is ridiculous, you know?",
    "GONZALEZ: There you go - $50.",
    "Everything else is going up.",
    "All rights reserved.",
    "Yeah, definitely."
  ]
}