{
  "id": 11468,
  "mediaId": 8258,
  "date": "2022-03-13",
  "headline": "REMEMBER THESE NAMES: List Of Turncoat TRAITOR Republicans That Just Stabbed Trump In The Back By Doing THIS [VID]",
  "image": "https://americasfreedomfighters.com/wp-content/uploads/2020/11/CAPTURE5171.jpg",
  "link": "https://americasfreedomfighters.com/remember-these-names-list-of-turncoat-traitor-republicans-that-just-stabbed-trump-in-the-back-by-doing-this-vid-3/",
  "mediaOutlet": "americasfreedomfighters.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AFF NEWSWIRE- CHLOE",
  "authorUrl": "https://americasfreedomfighters.com/author/blaze/",
  "termIds": [
    0
  ],
  "sentences": [
    "Mitt Romney – UT\nMarco Rubio – FL\nMike Shirkey – MI\nMike DeWine – OH\nBrian Kemp – GA\nBrad Raffensperger – GA\nPat Toomey – PA\nLiz Cheney – WY\nDoug Ducey – AZ\nLarry Hogan – MD\nFred Upton – MI\nJohn Cornyn – TX\nJames Lankford – OK\nLisa Murkowski – AK\nBen Sasse – NE\nSusan Collins – ME\nJim Durkin – IL\nDan Young – AK\nFrancis Rooney – FL\nJohn Shimkus – IL\nAdam Kinzinger – IL\nPaul Mitchell – MI\nDon Bacon – NE\nTom Reed – NY\nWill Hurd – TX\nJohn Kurtis – UT\nDenver Riggleman – VA\nREMEMBER THESE NAMES!",
    "Brian Kemp:\n“I’m ashamed that I endorsed him.”pic.twitter.com/ZwkOQ7jGtK\n— Alex Salvi (@alexsalvinews) November 29, 2020\nGovernor Mike DeWine of Ohio, who Trump brought up on stage during his rallies on several occasions, is another Turncoat according to Trump’s supporters.",
    "Here’s a list of elected republicans who either have directly called for Trump to concede, called for a peaceful transfer of power and for Biden to receive intel briefings, or outright attempting to sabotage any real audits of every single signature and vote.",
    "Lin Wood, who’s been fighting to uncover voter fraud in Georgia, has been threatening that he will expose ties to Dominion with Governor Brian Kemp, whose former chief of staff is a top lobbyist for Dominion and Republican Secretary of State Raffensperger.",
    "Rep. Doug Collins, formerly a staunch defender of President Trump, has remained silent on the battle Trump and his lawyers have been fighting in GA. conceded to GOP rival Sen. Kelly Loeffler (R-GA) on the eve of the election.",
    "Now that they hold office, many of them have completely turned their backs on the President, even going so far as to publicly call for him to concede the election to Joe Biden before any audit can occur.",
    "Outside of Kemp and DeWine, there are countless others who refuse to support Trump in his challenging of the election, and the list has been growing over the past several days.",
    "Since November 4th, Kemp has done little to help the President in his fight to overturn an election that most Republicans and a plurality of Americans agree was stolen.",
    "Even two-faced, insanely jealous Republicans like Mitt Romney got the backing of the most powerful Republican since Ronald Reagan during his run for US Senator in Utah.",
    "The lamestream media refuses to report the overwhelming evidence that proves that Trump won but we will continue to present the evidence until justice is served.",
    "When Republicans across the nation needed help to boost their popularity during an election, they knew they could rely on President Trump to have their backs.",
    "The Red Elephants– Many republicans that hold office today, were elected solely because of the support from President Donald Trump.",
    "We have reported ample evidence that the election was rigged and America has the right to know the facts.",
    "Please take a moment and share our articles with your friends, family and on all social media sites!",
    "President Trump told Fox Business News’ Maria Bartiromo that he’s ashamed he endorsed Governor Kemp.",
    "Governor Brian Kemp of Georgia for example owes his entire election victory to President Trump.",
    "Wood has also been coming down pretty hard on Rep. Doug Collins for abandoning President Trump.",
    "?Be sure to sign up for our FREE newsletter and we’ll keep you in the loop by CLICKING HERE!??",
    "Recently DeWine urged President Trump to allow a peaceful transfer of power to Joe Biden.",
    "?It’s time to enjoy social media again… without the filthy Communist censorship!",
    "Join us at SPREELY, PARLER, GETTR, WeGo, Gab, Codias, Mumblit, and WorldAnon.",
    "Look, only a braindead moron would believe that Biden beat Trump.",
    "INVITE YOUR FRIENDS AND MAKE SURE TO SUBSCRIBE!",
    "COMMIE TWITTER DELETED THE POST\nPres.",
    "WE APPRECIATE YOU ALL PATRIOTS!",
    "SCROLL DOWN TO LEAVE A COMMENT!",
    "Thank you, we appreciate it!",
    "WELCOME TO THE AFF FAMILY!",
    "Trump on Georgia Gov.",
    "God Bless.",
    "?",
    "?",
    "?"
  ]
}