{
  "id": 11648,
  "mediaId": 8480,
  "date": "2022-03-22",
  "headline": "How a seat belt saved a life",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/preston-crash.jpg?w=1280",
  "link": "https://www.wdtn.com/news/ohio/how-a-seat-belt-saved-a-life/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Rodriguez",
  "authorUrl": "https://www.wkbn.com/author/jennifer-rodriguez/",
  "termIds": [
    982,
    1590,
    6538
  ],
  "sentences": [
    "“This new dashboard highlights those who have been saved by wearing a safety belt and raises awareness on the importance of buckling up every time you travel.”\nThe new Safety Belt Dashboard is a part of the Ohio Statistics and Analytics for Traffic Safety (OSTATS), which is a series of internal and public-facing dashboards dedicated to exploration, analysis and visualization of crash data across Ohio.",
    "The new Safety Belt Dashboard is a tool for the public, media, and policymakers to see how important it is for motorists to buckle up – every trip, every time.”\nAccording to a press release from Highway Patrol, since 2017, there have been over 254,000 unbelted crashes in Ohio, with over 2,500 of those crashes resulting in fatalities.",
    "When you click on the “Saved by the Belt” section, you can see an interactive map of incidents where lives were saved thanks to safety belts — like Mr. Miller, whose car was struck when a vehicle tried to turn across his lane.",
    "“Troopers see the devastating results of unbelted crashes firsthand, which is why safety belt usage remains a top concern,” said Colonel Richard S. Fambro, Highway Patrol superintendent.",
    "“One of the easiest and most effective ways for motorists to avoid serious injuries or death in a crash is by wearing their safety belt,” said Ohio Governor Mike DeWine.",
    "The database allows viewers to pull up statistics of “Unbelted Driving Crashes” by the seriousness of the injury, ranging from property damage only to fatal injuries.",
    "She is one of many Ohioans who were “Saved by the Belt,” according to the new online Safety Belt Dashboard by the Ohio State Highway Patrol.",
    "(WKBN) – It was October 29, 2021, when a woman traveling westbound on State Route 14 would find herself in a life-changing event.",
    "Her vehicle rolled over, but she was able to walk away with minor injuries because she had her seat belt on.",
    "Ms. Preston’s vehicle went off the right side of the road and struck a building, a tree, then a ditch.",
    "He did suffer serious injuries, but they could have been worse if he didn’t have on his seat belt.",
    "Thankfully, she was wearing a seat belt and her injuries were not as bad as they could have been.",
    "You can also look up safety belt violations, unbelted crashes by routes and by dates.",
    "During the same time frame, troopers have issued over 516,000 safety belt citations.",
    "That caused his vehicle to travel off the side of the road and hit a guardrail.",
    "“This dashboard furthers the Patrol’s prioritization of saving lives.",
    "Or, Laruen Satterfield who was driving in Lisbon on a snowy day."
  ]
}