{
  "id": 1165,
  "mediaId": 8324,
  "date": "2022-02-18",
  "headline": "Redistricting commission insults Ohioans by waiting until last minute to meet",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/38/2017/12/cropped-favicon-11-32x32.png",
  "link": "https://www.galioninquirer.com/opinion/72566/redistricting-commission-insults-ohioans-by-waiting-until-last-minute-to-meet",
  "mediaOutlet": "Galion Inquirer",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Galion Inquirer",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "As the Cleveland.com editorial board noted, slamming these legislative leaders for their delays Wednesday, while Huffman said last week that, “we’ve got to figure out a way,” he added that “doesn’t change the reality that it doesn’t appear that we can do that, and no one has found a way.”\nThe way that apparently doesn’t exist in Huffman’s mind is to pass fair maps that actually represent the political makeup of Ohio voters.",
    "Despite being smacked down twice so far by a bipartisan 4-3 majority on the Ohio Supreme Court, they continue to play political power games, no matter the cost to Ohio’s 2022 election cycle and the public trust — no matter the chaos they inflict by holding their middle fingers up to the more than 71% of Ohio voters who amended the Ohio Constitution to pass anti-gerrymandering reform.",
    "Their personal and professional interests are maintaining their leadership and the supermajority strength of their caucuses — essentially their political power — and not drawing mortar fire from their members who’ve been enjoying the fat steak of gerrymander-rigged elections for many years, and would rather not give up their seats to the ideal of a truly representational Republic.",
    "Sykes noted in his response that the rules adopted by the commission require the co-chairs to jointly call a meeting, adding that he had “repeatedly and continuously indicated the availability of Democrats to meet at any time,” and said that Cupp told him he couldn’t get the Republican majority members of the commission to confirm their availability.",
    "But instead of buckling down and getting to good, honest work as Republican Ohio Supreme Court Justice Maureen O’Connor shot down their gerrymandering attempts not once but twice, Huffman and Cupp have instead been throwing themselves a temper-tantrum pity party trying to place blame on anybody but the men in their own mirrors.",
    "Things got so bad with this meeting that Republican Ohio Auditor Keith Faber sent a letter to Democratic state Sen. Vernon Sykes, the co-chair of the commission, telling him he believes that he had the authority to call a meeting himself, as Republican Ohio House Speaker Bob Cupp, the other co-chair, had not done so.",
    "Mike DeWine, Auditor Keith Faber and Secretary of State Frank LaRose — have stood around like spectators at a traffic accident, waiting for somebody else, anybody else, to summon ambulances and wreckers.”\nThis undershoots it quite a bit.",
    "As I wrote in September, Huffman and Cupp on the commission are tasked with drawing the districts of the very caucuses they lead, a huge conflict when it comes to them desiring accurately bipartisan fairness in representation.",
    "The contempt majority legislative leaders on the Ohio Redistricting Commission are showing to the public by waiting until the last possible day to draw a third round of Statehouse maps is nothing short of astounding.",
    "‘Seems simple, but not when you’re obsessed with keeping power at all costs in defiance of the voters and in abdication of your duty to uphold the Ohio Constitution.",
    "appropriate transparency in a process about which everyone from anti-gerrymandering advocates to the Republican commission members themselves have complained.",
    "“I find it perplexing that this would be the case considering the seriousness of the situation and the rapidly approaching deadline,” Sykes wrote.",
    "This pathetic charade on an issue so critical to the health of Ohio government is a stark and startling case study in that cowardice.",
    "Then the second round of maps they presented — working off their previous gerrymandered maps — were also ruled unconstitutional.",
    "In short, it’s only perplexing if you assume these Republican majority legislative leaders are in any way acting in good faith.",
    "DeWine, Faber, and LaRose could’ve supported fair maps either of the two previous times they had the opportunity.",
    "Faber said he had been available to meet since the day the second round of maps were declared unconstitutional.",
    "Meanwhile, as the Cleveland.com editorial board also noted, “the commission’s other three Republicans — Gov.",
    "Instead they all towed the Huffman/Cupp line and voted for unconstitutionally gerrymandered, partisan maps.",
    "They meet today, Thursday, Feb. 17, the same day the maps are due to the Ohio Secretary of State’s Office.",
    "Perplexing indeed, if one is to assume that these Republican majority legislative leaders truly wanted 1.)",
    "The maps they drew in September were ruled by the Ohio Supreme Court to be unconstitutional gerrymanders.",
    "That’s not just watching a traffic accident; it’s removing the stop sign that could’ve prevented it.",
    "fair, constitutional districts that don’t rig the game for them to keep their supermajorities, 2.)",
    "It wasn’t until more than a week later, the night of Feb. 15, they even announced a meeting.",
    "They had 10 days to draw new maps, not based on previous maps.",
    "Moral and ethical cowardice abounds in Ohio’s halls of power.",
    "ample time for public review and input, and 3.)",
    "That was on Feb. 7.",
    "They are not."
  ]
}