{
  "id": 11679,
  "mediaId": 8394,
  "date": "2022-03-28",
  "headline": "Potential buyer of former Longaberger basket building sues owner for breach of contract",
  "image": "https://www.gannett-cdn.com/presto/2019/10/21/PNEW/360904b5-89d2-4fd2-a23e-5cb75771a46a-102019_Longaberger_08_ML.JPG?crop=5183,2915,x1,y397&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.newarkadvocate.com/story/news/2022/03/28/longaberger-building-owner-sued-breach-contract/7195881001/",
  "mediaOutlet": "Pataskala Standard",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kent Mallett",
  "authorUrl": "https://www.newarkadvocate.com/staff/4395572002/kent-mallett/",
  "termIds": [
    0
  ],
  "sentences": [
    "Intel in Ohio:Licking County homeowners got top dollar selling for Intel site, but many still emotional\n\"It was after this announcement that Historic Newark Basket refused to allow Stanley’s environmental inspectors on the property to inspect the mold situation,\" the lawsuit states.",
    "It was Oct. 21, 2019, before the deadly coronavirus pandemic, when local dignitaries gathered inside the lobby of the basket building to hear Ceres Enterprises' plans to convert Dave Longaberger's dream creation into a hotel with 150 rooms, a restaurant and an indoor pool.",
    "The building and surrounding property, once valued at $28 million, was valued between $12 million and $13 million for more than a decade until it was further reduced to $8 million on Jan. 1, 2017.\nkmallett@newarkadvocate.com\n740-328-8545\nTwitter: @kmallett1958",
    "Brandon Hess, partner and broker with Shai-Hess Commercial Real Estate, confirmed in January 2021 that Ceres had canceled the hotel project due to the impact of coronavirus on company's finances, putting the building back on the market for $6.5 million.",
    "Bryan Stanley, a Florida developer, filed the lawsuit in the U.S. District Court, Southern District of Ohio, Eastern Division, seeking a jury trial, compensatory damages exceeding $75,000 and compliance with all promises made in the contract.",
    "The 180,000-square-foot building at 1500 E. Main St., was vacated by the basket-maker in 2016 and saved from foreclosure in late 2017 when Historic Newark Basket purchased the property from the Longaberger Company for $1.2 million.",
    "But a lawsuit filed Friday in federal court states the seven-story building was already under contract and broken promises by owner Historic Newark Basket were the only reasons the sale had not already closed.",
    "Steve Coon, who owns the building with Historic Newark Basket partner Robert George, told Columbus Business First last week he decided not to sell the building and wanted to capitalize on the Intel project.",
    "The lawsuit alleges Historic Newark Basket accepted Stanley's offer in June to purchase the property for $5.5 million, then the parties modified the purchase terms and set a new closing date for Feb. 15.",
    "The broken promises, according to the lawsuit, were to remove mold from inside the building, power wash the exterior and remove dead vegetation and debris from the parking lot, according to the lawsuit.",
    "NEWARK — The owner of the former Longaberger basket building said last week he no longer wants to sell the iconic Newark structure because of the Intel Corporation project coming to Licking County.",
    "Stanley's attorney, Barton Keyes, of Cooper Elliott law firm in Columbus, said Historic Newark Basket can't get out of a contract because of its own non-compliance with the terms of the contract.",
    "The obligations of removing mold, debris and dead vegetation, and power washing the building, were not only ignored, but Stanley was pressured to close on the building anyway, the lawsuit states.",
    "\"In March, Historic Newark Basket principal Steven Coon said to news media that he now does not wish to sell the property, and wants to explore all development avenues for the property.",
    "Mike DeWine and Intel executives came to Newark on Jan. 21 to announce the $20 billion Intel computer chip manufacturing development coming to Jersey Township, south of Johnstown.",
    "\"The accepted contract was comprised of a document entitled 'Real Estate Purchase Contract' along with a document designated 'Counter Offer #1,'\" the lawsuit states.",
    "The December 2017 sale of the building to Coon and George paid off what is believed to be the largest delinquency in Licking County history, at about $850,000.",
    "Keyes said Stanley's plans for the building are not final, but it would likely be a commercial or mixed-use development, not including housing.",
    "Coon did not return a Monday phone message left for him at his Coon Restoration and Sealants office in Louisville, Ohio.",
    "\"By accepting Counter Offer #1 as part of the Purchase Contract, Historic Newark Basket agreed to certain obligations.\"",
    "The building, which once housed 500 Longaberger employees, sits on a 21.5-acre site on the eastern edge of Newark.",
    "The Licking County Board of Revision reduced the building’s value from $8 million to $1.2 million in March 2018.",
    "Intel’s planned development in Licking County has likely increased the value of the property.\"",
    "\"The (court) filing was in response to not removing mold and complying with the promises.",
    "The Longaberger Company built the structure, which opened in 1997, for $32 million.",
    "Coon said an offer on the building fell through a couple of months ago.",
    "Coon and George requested the reduction to lower their property taxes.",
    "\"That doesn't mean they can walk away from the deal,\" Keyes said.",
    "What will the Longaberger basket building become?",
    "The Intel announcement came on Jan. 21.",
    "The promises were made before Intel.\"",
    "Gov."
  ]
}