{
  "id": 11670,
  "mediaId": 8379,
  "date": "2022-03-23",
  "headline": "DeWine touts accomplishments, future priorities in State of the State address",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/03/AP22056040862237.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/dewine-to-give-state-of-the-state-address-wednesday/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maeve Walsh",
  "authorUrl": "https://www.nbc4i.com/author/maeve-walsh/",
  "termIds": [
    0
  ],
  "sentences": [
    "“They assisted with staffing at our nursing homes, and most recently, they worked in more than 64 hospitals and at 21 testing sites across Ohio, preventing a crisis in care during the recent Omicron surge.”\nDeWine’s address was largely non-controversial and avoided hot-button topics – besides a brief acknowledgment of Ohio’s recent abortion-restricting efforts to protect the unborn and a subtle jab at supporters of defunding the police, to which he received a standing ovation.",
    "In addition to backing Ohio’s police officers, DeWine called for cracking down on violent offenders – to which he said “we must remove them from society.”\nHe touted a pending bill backed by chiefs, deputies and prosecutors that would increase criminal penalties for repeat felony offenders and urged the Ohio General Assembly to strengthen laws dealing with violent offenders who continue to use firearms to commit crimes.",
    "While Intel’s $20 billion investment in the state made national headlines, DeWine acknowledged other manufacturing companies that have made Ohio their home: Cleveland Cliffs’ steel plant in Toledo, Sherwin Williams’ research facility in Brecksville, Sierra Nevada Corporation’s aerospace operations in Miami Valley and Global Cooling in Athens County.",
    "“And, I see an Ohio where those who seek help are met with respect – and treated with the dignity that they deserve.”\nAlong with a shout out to the efforts of Fran DeWine, his wife of 55 years, to bolster kids’ education by partnering with the Dolly Parton Imagination Library, the governor’s speech wasn’t complete without a reference to Joe Burrow.",
    "In a gubernatorial term shadowed by nearly 38,000 Ohioan deaths due to COVID-19, DeWine thanked the state for showing “the world that Ohioans are resilient” and commended frontline workers and first responders – particularly the Ohio National Guard – for their “tireless efforts” in protecting the health of fellow Ohioans.",
    "To support individuals and families experiencing mental health crises, DeWine urged the Ohio General Assembly and stakeholders in the state to invest in the following: behavioral health workforce, mental health research and innovation, crisis response services, and residential and outpatient services.",
    "“If we can remove this small group of dangerous offenders from our streets, the violent crime in our neighborhoods will be reduced dramatically — and the citizens and families who live there will be safer, and lives will be saved,” DeWine said.",
    "With suicide as one of the top ten causes of death for Ohioans aged 10 to 64 and accidental drug overdose deaths at record levels, DeWine said access to mental health care remains unreachable for too many Ohioans.",
    "From Intel’s $20 billion investment in Ohio to a bill expanding telehealth coverage effective Wednesday, DeWine received several rounds of applause and standing ovations as he touted the state’s achievements.",
    "“While some people talk of defunding the police, we are doubling down – we are doubling down on our support for law enforcement by giving them more resources to keep our communities safe,” DeWine said.",
    "He also spoke about Ohio’s economy, applauding the state’s lowest taxes in more than 40 years as a result of state efforts to cut taxes by about $3.6 million dollars.",
    "We’re here to make noise, and teams are going to have to pay attention to us [because] we are coming for it all!’”\nRead DeWine’s full State of the State address here.",
    "“Perhaps fellow Ohioans, Joe Burrow said it best after the Bengals advanced to the AFC Championship game when he said, ‘We’re a really, really good team.",
    "At the top of DeWine’s list for future priorities – and perhaps the subject he devoted the most time toward in his speech – was mental health.",
    "DeWine highlighted the goals and accomplishments of the state in front of a joint session of the Ohio General Assembly in the House Chambers.",
    "The state, according to DeWine, slashed spending by a “whopping” $1.2 billion, and Ohio’s bond rating is the highest it’s been since 1979.",
    "Wednesday’s speech will be the last address of his first term as governor at a time when he faces a four-way GOP primary.",
    "“And to think we have done all these many things, all of them, during a once-in-a-hundred-years pandemic,” DeWine said.",
    "“Our Guard members responded to every call when asked during the pandemic — from testing to vaccinations,” he said.",
    "Mike DeWine delivered the annual State of the State address Wednesday afternoon at the Statehouse.",
    "I see an Ohio where mental illness is treated as a health issue – not as a crime,” DeWine said.",
    "Although he commended Ohio’s accomplishments, DeWine also recognized the state’s shortfalls.",
    "Independent polling commissioned by NBC4 shows he large lead over challengers in that race.",
    "He postponed, then canceled, his March 2020 speech due to the COVID-19 pandemic.",
    "“I see an Ohio where shame, fear, stigma and embarrassment are erased.",
    "DeWine delivered his first and only State of the State in 2019.",
    "COLUMBUS, Ohio (WCMH/AP)– After a two-year hiatus, Gov."
  ]
}