{
  "id": 11699,
  "mediaId": 8379,
  "date": "2022-03-23",
  "headline": "Mixed reaction for DeWine’s State of the State speech",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/03/snapshot-2-4.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/columbus/mixed-reaction-for-dewines-state-of-the-state-speech/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karina Cheung",
  "authorUrl": "https://www.nbc4i.com/author/karina-cheung/",
  "termIds": [
    2143,
    5761,
    5185,
    4298,
    1489,
    970,
    392,
    6077,
    6474
  ],
  "sentences": [
    "“To me, our entire health care workforce and our caregiving workforce has been a consistent theme throughout this pandemic.”\nDemocrats also called out the governor for not discussing the state redistricting process, which has been ongoing since September due to the Ohio Supreme Court ruling all maps presented to it as unconstitutional.",
    "We’ll give it our regular scrutiny.”\nHouse Minority Leader Allison Russo said Democrats would have liked to have heard DeWine talk about the state’s healthcare system and the strains it has been under the last two years.",
    "“He appropriately recounted some of the successes that we’ve had over the last few years and the many good things that have occurred and also looking ahead.,” said Ohio House Speaker Bob Cupp.",
    "Mike DeWine’s 2022 State of the State address\nDemocrats made note of the lack of talk about federal pandemic relief dollars and were critical about the lack of talk around guns.",
    "DeWine called for three specific improvements for Ohio’s future: investment in mental health care, Ohio’s state park system, and the Appalachia section of the state.",
    "“So, we’ll wait for the details to see, many things are good, many things get a small start, and you see whether they produce the results you’re looking for.",
    "Mike DeWine laid out his vision for Ohio and improvements he would like to see made across the state in his first State of the State address since 2019.",
    "We’ve given permission for people to carry a gun without any training without informing law enforcement,” said Ohio Sen. Kenny Yuko.",
    "“Sure, you always want to know what it’s going to cost,” Cupp said about spending taxpayer money on the programs.",
    "Following the speech, politicians on both sides of the aisle weighed in on what the governor did and didn’t say.",
    "Cupp said he would like to see the General Assembly take a wait-and-see approach to some of DeWine’s proposals.",
    "Republicans said the speech focused on the good that Ohio has achieved these last few years.",
    "“Would probably highlight some additional key priorities,” she said.",
    "“We passed your Stand Your Ground bill; how does that help?",
    "COLUMBUS, Ohio (WCMH) – Ohio Gov.",
    "FULL VIDEO: Gov.",
    "It doesn’t."
  ]
}