{
  "id": 11798,
  "mediaId": 8379,
  "date": "2022-03-29",
  "headline": "Ohio drivers could soon see enhanced restrictions on texting while driving",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2016/05/ap_091215133603_39581755_ver1.0.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/ohio-drivers-could-soon-see-enhanced-restrictions-on-texting-while-driving/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maeve Walsh",
  "authorUrl": "https://www.nbc4i.com/author/maeve-walsh/",
  "termIds": [
    5902,
    4142,
    3886,
    2143,
    2037,
    970,
    982,
    6077,
    6241,
    6474
  ],
  "sentences": [
    "We’re going to be doing everything we can to drive that number to zero.”\nNihiser said a motorist behind the wheel on a cellular device is inherently dangerous to others around them – and the Ohio State Highway Patrol will always support laws that strengthen its ability to “make the lives of Ohioans safer.”\nAccording to AAA, about 76 percent of respondents in a 2019 Traffic Safety Culture Index survey said they supported hand-held bans.",
    "“When it’s ‘Not as I drive, it’s what I say,’ teens whose parents text while driving are more prone to distraction.”\nAlthough Galaviz said it’s too soon to tell whether Indiana’s prohibition on using handheld devices while driving will significantly prevent traffic fatalities, Shoots-Reinhard said other states that have passed laws combating distracted driving have seen a reduction in crashes.",
    "Brittany Shoots-Reinhard, a research assistant professor at Ohio State’s Department of Psychology, said there are three types of distracted driving: cognitive distraction, when your mind is focused on things besides driving; visual distraction, when your eyes aren’t on the road; and manual distraction, when your hands aren’t on the wheel.",
    "House Bill 283, introduced by Rep. Cindy Abrams (R-Harrison) and Rep. Brian Lampton (R-Beavercreek) in May 2021, would make driving with an electronic device in your hand a primary offense – meaning law enforcement would no longer need a second reason, like swerving between lanes, to pull Ohioans over for using a phone while driving.",
    "Just a year later, after the state’s “hands-free” driving bill was enacted, Galaviz said 5,500 citations and 10,600 warnings were issued to Indiana drivers from July 2020 to June 2021 – a 766 percent increase in citations and a 1,364 percent increase in warnings from the year prior.",
    "Although Shoots-Reinhard said drivers – especially young drivers – think they can multitask while driving, in reality, the brain is simply switching back and forth between tasks, thus completing those tasks with poorer quality and posing a greater threat on the roads.",
    "If HB 283 is passed, DeWine said Ohio would join 24 other states who have implemented “hands-free” driving laws, including Indiana, where Ron Galaviz, a spokesperson for the Indiana State Police, said a similar bill was enacted in June 2020.",
    "During the one-year period prior to the prohibition of holding an electronic device while driving, Galaviz said law enforcement agencies across Indiana issued 635 citations and 724 warnings to motorists from July 2019 to June 2020.",
    "Not only did Shoots-Reinhard say that HB 283 can serve as a deterrent for distracted driving among teens, she also said more must be done on the parenting front to model to kids the appropriate behavior behind the wheel.",
    "“Concern about manual use of cellphones while driving is because they’re all three of those distractions – hands off the wheel, taking your mind off the road and taking your eyes off the road,” Shoots-Reinhard said.",
    "During his State of the State address Wednesday, DeWine urged the Ohio General Assembly to pass HB 283, which, if enacted, could decrease the number of fatal accidents in one year by 20 percent, according to Abrams.",
    "COLUMBUS, Ohio (WCMH) – Scrolling through texts or TikTok behind the wheel could soon become a primary offense in Ohio – a pending change in the state’s distracted driving laws that garnered praise from Gov.",
    "“Whether driving under the influence of alcohol, marijuana, or other drugs or driving while texting, too many Ohio lives — too many family members — are still being lost on our highways,” DeWine said.",
    "Abrams said she anticipates HB 283, which currently sits in the House Criminal Justice Committee, to be enacted into law in the near future – especially with increased pressure from DeWine.",
    "When Georgia passed a law banning handheld device use while driving, she said stores throughout the state sold out of cell phone mounts even before the bill went into effect.",
    "Young drivers, who are typically more attached to their cell phones than older generations, are more likely to engage in distracted driving, Shoots-Reinhard said.",
    "“If we think as a state that it’s unacceptable to be texting while driving, it communicates to everyone, ‘This is not behavior that we’ll tolerate,’” she said.",
    "“I don’t care where you live, what political party you belong to, what school you go to, what neighborhood you live in – this affects everyone in Ohio.",
    "From 2017 to 2021, distracted driving accounted for 64,108 crashes in Ohio, according to Ohio State Highway Patrol spokesperson Brice Nihiser.",
    "According to DeWine, nearly 40 percent of distracted driving-related crashes in Ohio in 2021 involved drivers who were 15 to 24 years old.",
    "“While numbers went up because of the newly enacted law, for us, it’s not about writing tickets, it’s about saving lives,” Galaviz said.",
    "Under the bill, Ohioans are still permitted to use hands-free methods to communicate, like Bluetooth or speaker phone.",
    "Of those crashes, he said 206 were considered fatal – resulting in the deaths of 226 Ohioans.",
    "“Obviously a tragic number because many people lost their lives,” Nihiser said.",
    "The minute you pull out of your driveway, you’re affected by this.”",
    "“This is not a partisan issue; this affects everyone,” Abrams said.",
    "“Teenagers do not appreciate hypocrisy,” she said.",
    "“That causes concern for us.",
    "Mike DeWine last week."
  ]
}