{
  "id": 11878,
  "mediaId": 8494,
  "date": "2022-03-25",
  "headline": "Morning Headlines: Ohio Department of Health: New COVID-19 subvariant unlikely to cause a surge; The Ohio Supreme Court to weigh in on the end of weekly unemployment payments",
  "image": "https://npr.brightspotcdn.com/dims4/default/41688c5/2147483647/strip/true/crop/7680x4032+0+144/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fdf%2F49%2F47286f014e1483009780c514d1e4%2Fshutterstock-1667357200.jpg",
  "link": "https://www.wksu.org/2022-03-25/morning-headlines-ohio-department-of-health-new-covid-19-subvariant-unlikely-to-cause-a-surge-the-ohio-supreme-court-to-weigh-in-on-the-end-of-weekly-unemployment-payments",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Meyer",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Friday, March 25:\nOhio Department of Health: New COVID-19 subvariant unlikely to cause a surge\nThe Ohio Supreme Court to weigh in on the end of $300 weekly unemployment payments\nCourt rulings invalidating GOP-drawn redistricting maps threaten May primary\nHollywood biopic about Lebron James to be filmed in Akron\nSecond grand jury declines to indict Cleveland Browns QB Deshaun Watson\nCavs fall to Raptors 117-104 amid tight conference playoff race\nOhio State looks to end Elite 8 drought against Texas\nOhio Department of Health: New COVID-19 subvariant unlikely to cause a surge\n(Ideastream Public Media) -- New COVID-19 cases and hospitalizations in Ohio are at their lowest levels since July.",
    "That's left candidates scrambling to shift their strategies for fundraising, advertising and voter outreach just as they thought they were nearing the end of the primary campaign\nHollywood biopic about Lebron James to be filmed in Akron\n(Akron Beacon Journal) -- A movie adaptation of the biography of LeBron James high school years could be filmed in Northeast Ohio.",
    "Second grand jury declines to indict Cleveland Browns QB Deshaun Watson\n(AP) -- A second grand jury in Texas has declined to indict new Cleveland Browns quarterback Deshaun Watson, who has been accused of sexual misconduct by 22 women and still faces civil lawsuits.",
    "The Akron Beacon Journal reports that a local casting call has gone out and an Akron police spokesman says representatives from Universal Studios and James production company, SpringHill Entertainment have toured the area.",
    "There’s even a chance the election could be split onto two dates, with one focusing on statewide races and the other on the Statehouse and congressional contests that are tied up in the mapmaking fight.",
    "The movie would be an adaptation of Buzz Bissinger’s book, “Shooting Stars” about James' time at St. Vincent St. Mary during which the team won three statewide titles and one national title.",
    "Cavs fall to Raptors 117-104 amid tight conference playoff race\n(AP) -- The Toronto Raptors tightened the Eastern Conference playoff race by beating Cleveland 117-104 last night.",
    "The Cavs had won all three previous meetings with the Raptors this season, and they hold the tiebreaker over Toronto and retain possession of the sixth-seed in the East.",
    "Ohio State looks to end Elite 8 drought against Texas\n(AP) -- It's been nearly 30 years since Ohio State last advanced past the Sweet 16 in the women's NCAA Tournament.",
    "Former coach Dru Joyce II tells the Beacon Journal that while he doesn’t know much about filming, he knows it’s coming and is excited to see how the story is portrayed.",
    "Mike DeWine had the legal ability to end the state's participation in a federal pandemic unemployment aid program ahead of a government deadline stopping the payments.",
    "The Ohio Supreme Court to weigh in on the end of $300 weekly unemployment payments\n(AP) -- The Ohio Supreme Court has scheduled oral arguments over whether Gov.",
    "There really is still a level of distrust out there.” 80 of Ohio's 88 counties are at the lowest level of concern for COVID spread, according to the CDC.",
    "He says BA-2 might be slightly more contagious than Omicron-1, but has the same level of severity and response to vaccines and natural immunity.",
    "While Watson was undergoing a physical and meeting with Browns coaches, the grand jury in Brazoria County, Texas was listening to evidence.",
    "A series of court rulings invalidating Republican-drawn redistricting maps has threatened to delay the May 3rd primary by a month or more.",
    "You can hear more about the Browns' decision to make Watson their franchise quarterback on this week’s The View From Pluto at wksu.org.",
    "Critics of ending the payments 10 weeks early last June said workers had multiple reasons why they might not be returning to jobs.",
    "Court rulings invalidating GOP-drawn redistricting maps threaten May primary\n(AP) -- The Ohio primary is just six weeks away.",
    "DeWine followed the position of business groups that said the weekly payment was making it difficult to recruit employees.",
    "But Ohio Department of Health Director Dr. Bruce Vanderhoff is keeping an eye on the new omicron variant known as BA-2.",
    "The last time Ohio State advanced beyond the Sweet 16 was 1993 when the Buckeyes reached the national title game.",
    "“To use a baseball analogy, BA-2 is playing cleanup, but probably won't hit a home run,” Vanderhoff said.",
    "Twenty-two massage therapists have accused Watson of sexual assault and harassment in lawsuits.",
    "The decision was announced shortly after Watson arrived in Cleveland to meet his new team.",
    "Kevin Love had 12 points and 10 rebounds and Darius Garland had 18 points and 10 assists.",
    "It later announced it had declined to charge the three-time Pro Bowler with any crimes.",
    "The sixth-seeded Buckeyes will get a chance to end that drought when they face No.",
    "Dr. Kevin Sharrett in Cedarville says the rate is about 20% below urban areas.",
    "But candidates still don't know whether the contest will happen on that date.",
    "The Buckeyes have lost the last five times they've reached the round of 16.",
    "Brazoria County District Attorney Tom Selleck said the matter is closed.",
    "The program provided $300 in weekly coronavirus unemployment funds.",
    "Vaccination rates, however, continue to lag in rural counties.",
    "They don't trust the vaccine manufacturers.",
    "2 seed Texas in the Spokane Regional today.",
    "Cavs rookie Evan Mobley scored 11 points.",
    "“They simply do not trust our government.",
    "They don't trust our government.",
    "He says it comes down to trust.",
    "They don't trust the vaccine.",
    "Let's face it."
  ]
}