{
  "id": 11871,
  "mediaId": 8494,
  "date": "2022-03-29",
  "headline": "Fourth set of Ohio legislative redistricting maps go to Ohio Supreme Court",
  "image": "https://npr.brightspotcdn.com/dims4/default/f568d53/2147483647/strip/true/crop/2800x1470+0+1015/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Flegacy%2Fsites%2Fwcpn2%2Ffiles%2F201612%2Fohio_supreme_court_main_courtroom.jpg",
  "link": "https://www.wksu.org/government-politics/2022-03-29/fourth-set-of-ohio-legislative-redistricting-maps-go-to-ohio-supreme-court",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "pic.twitter.com/CfkCrb7z7h\n— Katy Shanahan (@KatyAShanahan) March 29, 2022\nIn the end, the independent mapmakers produced some House and Senate district maps before the midnight deadline set by the court but Republicans on the committee said there were just too many questions about them.",
    "“We just lit $49,000 of taxpayer-funded money for those independent mappers on fire because, at the last minute, Republicans had yet another set of maps that they had drawn behind closed doors,” Shanahan said.",
    "Republican House Speaker Bob Cupp raised concerns about compactness and cited areas where he said the mapmaker's maps didn't conform with the constitutionally mandated requirement.",
    "Republicans on the commission had questioned the process being used by the independent mapmakers during their four days of drawing maps for Ohio's House and Senate districts.",
    "But Democratic Minority Leader Allison Russo was quick to point out incumbency was not a factor that the state's high court said should be considered when drawing the lines.",
    "On Saturday, Republican Senate President Matt Huffman told mapmakers they should put addresses of current lawmakers on working maps for consideration in future iterations.",
    "By the time the commission voted on the maps late Monday night, some of the people who had been watching the process play out in real life gathered in the hearing room.",
    "Instead, the majority of Republicans on the commission approved a tweaked version of earlier maps ruled unconstitutional by the Ohio Supreme Court.",
    "Redistricting reform backers like Katy Shanahan with All on the Line said it was “another gutted blow” and adds those should have been used.",
    "And when the motion was made last night to adopt the revised Republican-backed maps, several of them shouted out their opposition.",
    "In the meantime, redistricting reformists say they are talking about waging yet another ballot issue to change the process.",
    "Earlier in the day, Governor Mike DeWine told reporters the commission should pass maps by the court's midnight deadline.",
    "And minutes later, some of them were asked to leave by the Ohio State Highway Patrol officers who guard the Statehouse.",
    "It could reject the maps passed last night or even retained the right to hold commission members in contempt of court.",
    "MEANWHILE:\nTroopers are kicking people out of the hearing room for reacting to the undermining of our democracy.",
    "They yelled out \"No, no, no, no,\" \"shame on you\" and \"cheater\" as the vote was being taken.",
    "Democratic Committee Co-Chair Vernon Sykes asked the crowd to quiet down and they did.",
    "And they aren’t the ones independent mapmakers have been drawing for days.",
    "Two new maps have been adopted by the Ohio Redistricting Commission.",
    "The court order does not provide for a continuance of that time.",
    "At most, people have said aloud one or two words at a time.",
    "Now the question is what the Ohio Supreme Court will do.",
    "So the goal has to still be to get a map,” DeWine said.",
    "“The court order says we are supposed to approve a map.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "That didn't happen.",
    "We’ve also clapped.",
    "Just wild."
  ]
}