{
  "id": 11917,
  "mediaId": 8379,
  "date": "2022-03-23",
  "headline": "DeWine announces new investments in Appalachian Ohio, state parks",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/03/hocking-hills-state-park-mail-pouch-tobacco-barn.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/dewine-announces-new-investments-in-appalachian-ohio-state-parks/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Orner",
  "authorUrl": "https://www.nbc4i.com/author/ben-orner/",
  "termIds": [
    0
  ],
  "sentences": [
    "“One of the most important things we can do that will benefit not only the 32 counties in the Appalachian region but also our entire state,” DeWine said, “is to make a long-overdue, comprehensive investment in Appalachia.”\nThe governor did not include dollar values in his announcement, but he told lawmakers in attendance, “I intend to work with you and local leaders in Appalachia to create an investment program to revitalize and rebuild the economies and the Main Streets of the area where Ohio began.”\n“We have an historic opportunity to dedicate resources to an area of our state that is ready to move and ready to flourish.”\nDeWine noted downtown redevelopment, broadband internet expansion, workforce development, student wellness in schools and fighting addiction as specific parts of this Appalachian investment plan that will “reflect the vision of local communities” and support a “larger renaissance” happening in the region.",
    "“In the weeks and months ahead, I’ll be asking you to reinvest in our magnificent state parks,” DeWine told lawmakers, “as I know we share a commitment to preserving their natural beauty.”\nAs with the Appalachian investment plan, the governor did not mention dollar values of the state park reinvestment, and he also provided fewer specifics.",
    "The governor also touted ongoing investments in Ohio’s state parks in his Wednesday speech, including development at Shawnee State Park along the Ohio River, a new lodge at Hocking Hills State Park and a “master plan” connecting a wildlife area and two state parks near Wayne National Forest.",
    "As for timing, the governor said he will work with lawmakers and community leaders “in the coming days and weeks.”\nAppalachian areas of Ohio have borne a sizable brunt of decades of Rust Belt deindustrialization and an economy that modernized for the 21st Century.",
    "Mike DeWine said a “comprehensive investment” plan is coming for Ohio’s Appalachian communities, as well as new support for state parks, when he addressed a joint session of the General Assembly at his state of the state address Wednesday afternoon.",
    "But DeWine did tell lawmakers, “Our dream is for Ohio to have the best state park system in the country.”\n“By continuing to invest in our parks, when visitors come, they will feel like family,” the governor said.",
    "Of the 10 Ohio counties that lost the most population over the past decade, according to the U.S. Census Bureau, all were in Appalachia.",
    "“And they will say, ‘This is Ohio.’”\nDeWine’s State of the State address was his first since early 2019 shortly after being elected.",
    "Ohio has 75 state parks and will soon have 76 when a Native American historical and educational park opens near Xenia.",
    "DeWine is up for reelection this year, first facing three Republican challengers in the May 3 primary.",
    "Generations have built a life there, planting roots deep in the soil along the Ohio River.",
    "Addresses were not held in 2020 and 2021 due to the COVID-19 pandemic.",
    "And this — this is now Appalachia’s time,” DeWine said.",
    "“Our citizens in Appalachia are strong.",
    "They have a great and proud history.",
    "COLUMBUS, Ohio (WCMH) – Gov."
  ]
}