{
  "id": 12003,
  "mediaId": 8283,
  "date": "2022-03-25",
  "headline": "Despite permitless carry being approved, firearm safety classes not expected to decline",
  "image": "https://www.gannett-cdn.com/-mm-/c8be3fb16488486f9584d89f97d3401bcd76082b/c=0-386-7360-4526/local/-/media/2015/06/13/Chillicothe/B9317487657Z.1_20150613113412_000_GBKB248ER.1-0.jpg?width=3200&height=1800&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.chillicothegazette.com/story/news/2022/03/25/despite-permitless-carry-passing-firearm-classes-not-expected-decline/9437844002/",
  "mediaOutlet": "chillicothegazette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Megan Becker",
  "authorUrl": "https://www.chillicothegazette.com/staff/9157515002/megan-becker/",
  "termIds": [
    0
  ],
  "sentences": [
    "On the other hand, Smith said his classes are designed to teach students about how to understand firearms, learn the laws of carrying a gun and to understand how self-defense works — not just earning a permit.",
    "If you're going to carry that without regard to your knowledge and your training, you're being naïve thinking that things are going to turn out okay if you have to use it.\"",
    "Citizens cannot bring firearms into school safety zones, but people with a concealed carry permit may bring the weapon in their car on school property, Smith said.",
    "According to the 2021 annual concealed carry report from the Ohio Attorney General, Ohio sheriffs issued 94,298 licenses in 2021, slightly fewer than 2020.",
    "\"Those guys are teaching at 35, 40 dollars for a concealed carry class and they are only teaching students that know they have to have the certificates.\"",
    "Brad Smith, owner of Chillicothe Firearms Training and an NRA Certified Instructor, said he doesn't expect people to stop taking safety classes from him.",
    "He said eliminating the requirement for people to notify police immediately can eliminate some confusion and tension between citizens and officers.",
    "The law also eliminates the requirement to notify law enforcement officers that they are carrying a weapon, but an officer can still ask.",
    "He said some instructors provide firearm training courses just so people can obtain a permit, but he provides a quality education.",
    "CHILLICOTHE— Governor Mike DeWine signed Senate Bill 215 into law on March 14, making concealed-carry permits optional in Ohio.",
    "Regardless of the new law, Smith said he recommends that anyone using firearms or CCW should take classes on firearm safety.",
    "It states that people 21 and older can carry a concealed gun without a permit if they are legally allowed to own the gun.",
    "Smith said the biggest change with the new law will be how people notify police officers about their concealed weapon.",
    "\"What I always tell students is you're going to be carrying a gun that has the possibility of ending someone's life.",
    "She can be reached at 740-349-1106, email her at mbecker@gannett.com or follow her on Twitter @BeckerReporting",
    "As the law stands, someone carrying a concealed weapon is responsible for notifying the police immediately.",
    "They're probably going to see a sharp decline in the amount of clientele that they work with,\" Smith said.",
    "The number of regular licenses denied in 2021 rose significantly by 50%, with 2,668 Ohioans being denied.",
    "Call them at 740-466–4697, email them at chillicothefirearmstraining@gmail.com or like them on Facebook.",
    "\"Most of my students, I could say almost all of my students, come to take the class for the education.\"",
    "In Ross County, 206 licenses were issued, 638 were renewed, three were suspended, and one was revoked.",
    "Some states honor all state-issued permits, while others only allow residents to conceal carry.",
    "People planning to travel should check local guidelines for CCW, or carrying concealed weapons.",
    "When traveling, states without constitutional carry may require a concealed carry permit.",
    "\"I'm still getting as many phone calls set up for classes as I always have,\" Smith said.",
    "Ohio is the 23rd state in the United States to eliminate permits for concealed carry.",
    "\"Should we interrupt the law enforcement officer the second he comes to the window?..",
    "Ohioans still need a concealed carry permit to carry a firearm onto school property.",
    "\"I feel anybody that's going to use a firearm should have training,\" Smith said.",
    "Having a concealed carry permit is also still required in some instances.",
    "\"A lower code quality instructor probably is not going to be very busy.",
    "Lying to an officer about carrying a weapon is a misdemeanor offense.",
    "\"It doesn't sound like it would make that much of a difference.",
    "should you let him give his speech first and then tell him?...",
    "Chillicothe Firearms Training is located at 808 Old Elm Road.",
    "License renewals were 50% higher than 2020 and a record high.",
    "This set an all-time record for the second consecutive year.",
    "The new law makes the police officer responsible for asking.",
    "Megan Becker is a reporter for the Chillicothe Gazette.",
    "But in reality, it's a big distinction,\" Smith said.",
    "'immediately notify' is very, very gray.\"",
    "The law will go into effect on June 12.",
    "Six people were denied a license."
  ]
}