{
  "id": 12088,
  "mediaId": 8293,
  "date": "2022-03-28",
  "headline": "Local News Briefs: Rotary Club leasing flags",
  "image": "https://www.gannett-cdn.com/-mm-/1f5cf201681a65be6127472788853de159a5467f/c=0-729-3333-2604/local/-/media/2019/11/19/Coshocton/B9338526119Z.1_20191119151011_000_G2TPN697T.1-0.jpg?width=3200&height=1801&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.coshoctontribune.com/story/news/local/2022/03/28/local-news-briefs-rotary-club-leasing-flags/7157080001/",
  "mediaOutlet": "coshoctontribune.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Coshocton Tribune",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Election letters deadline set\nCOSHOCTON — The Coshocton Tribune will accept letters to the editor relating to any candidates and issues pertaining to the May 3 primary election until April 19.\nLetters are to be no more than 350 words.",
    "Cemetery clean-up set\nCOSHOCTON — The City of Coshocton has announced that annual clean-up of South Lawn, Roscoe, Caldersburg and Oakridge cemeteries will be April 4 to 8.",
    "Rotary Club leasing flags\nCOSHOCTON - The Coshocton Rotary Club will be running its annual lease a U.S. flag program with a kickoff on Memorial Day.",
    "For $25 a year, members of the club will place a flag on your front lawn for major holidays between May and November.",
    "Mike DeWine to the historic boilers licensing board for a term running from March 25, 2022, to Sept. 30, 2026.",
    "Sharier gets governor's appointment\nCOLUMBUS — John Edward Sharier of Cohocton has been appointed by Gov.",
    "Only one letter per election cycle is allowed for an elected official or candidate for elective office.",
    "Letters must be exclusive to the Tribune and come from a resident of the paper's direct coverage area.",
    "Flags are 3' by 5' and will be placed on a 10' staff in a plastic anchor pipe buried in the yard.",
    "For questions or issues, call 740-294-9708 or 740-502-3536 or email coshoctonrotary@gmail.com.",
    "Any flowers, decorations and borders one wishes to keep should be removed by that time.",
    "Box 675, Coshocton, OH 43812 or register online at coshoctonrotary.eventbrite.com.",
    "Other writers are permitted one letter every 30 days from the date of publication.",
    "Letters can be emailed to ctnews@coshoctontribune.com in a copy and paste format.",
    "Contact the public works department for any questions at 740-622-2686.",
    "Letters must include the writer's full name and city of residence.",
    "A phone number must be provided for verification purposes only.",
    "Any plants bushes or flowers should be maintained by family.",
    "Once approved for publication, letters must be confirmed.",
    "Checks can also be sent to Coshocton Rotary Club, P.O.",
    "Overground flowers and bushes will be removed.",
    "Proceeds benefit local Rotary projects."
  ]
}