{
  "id": 12142,
  "mediaId": 8494,
  "date": "2022-03-24",
  "headline": "Morning Headlines: House, Senate races to be removed from May primary ballot; Attorneys name FirstEnergy executives who paid bribes in HB6 scandal",
  "image": "https://npr.brightspotcdn.com/dims4/default/23d6d16/2147483647/strip/true/crop/4096x2150+0+5/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff5%2F8d%2Fb1c8fe8d4a82933b71b62ab2cf57%2Fshutterstock-1743370412-1.jpg",
  "link": "https://www.wksu.org/2022-03-24/morning-headlines-house-senate-races-to-be-removed-from-may-primary-ballot-attorneys-name-firstenergy-executives-who-paid-bribes-in-hb-6-scandal",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Thursday, March 24:\nHouse, Senate races to be removed from May primary ballot\nAttorneys name FirstEnergy executives who paid bribes in HB6 scandal\nOhio governor makes 1st statewide address in 3 years\nNewcomer in Ohio governor race told to refund campaign cash\nCleveland man sentenced to 4 years for damage during May protests\nAkron installing 28 speed tables\nHouse, Senate races to be removed from May primary ballot\n(Statehouse News Bureau) -- Ohio Secretary of State Frank LaRose has ordered county election boards to remove Ohio House and Senate races from the May 3 primary ballot as the legal fight over redistricting continues.",
    "Attorneys name FirstEnergy executives who paid bribes in HB6 scandal\n(AP) -- Attorneys representing investors in utility giant FirstEnergy Corp. say the company’s former chief executive and a top official were behind the payments in an alleged $60 million scheme to get the nuclear bailout law passed.",
    "Cleveland man sentenced to 4 years for damage during May protests\n(Ideastream Public Media) -- A man convicted on robbery and tampering charges associated with the 2020 protests in Cleveland has been sentenced to four years in prison.",
    "The Republican governor used his hourlong speech Wednesday to promote the state's recovery from the coronavirus pandemic, its manufacturing health, and measures to support law enforcement.",
    "The review of Blystone’s campaign finance reports from 2021 also found missing information about donors and missing or vague details about expenditures and contributors.",
    "DeWine also called for more efforts to improve mental health treatment in Ohio and promised measures to invest in Appalachia and improve opportunities for children.",
    "LaRose says if the federal court gets involved in the next few days, a supplemental second ballot could be used – but he says that can create confusion for voters.",
    "The Ohio Supreme Court recently rejected a third set of maps, and LaRose says the close of business Wednesday was the final deadline for those races.",
    "Photos showed Tandre Buchanan, 24, destroying the window at the Colossal Cupcakes shop on Euclid Avenue and others robbing the store as a result.",
    "The office says the money collected by political newcomer Joe Blystone violated limits on cash donations and bans on corporate contributions.",
    "He avoided mention of the state's ongoing bribery scandal and a failure to adopt new legislative maps that could force a new primary date.",
    "Newcomer in Ohio governor race told to refund campaign cash\n(AP) — The Ohio Secretary of State’s office says a Republican challenging Gov.",
    "DeWine also asked lawmakers to pass priority legislation adding penalties for violent felons and toughening laws on distracted driving.",
    "The city says it tested temporary speed tables in two Akron neighborhoods in 2020 and found a 23% reduction in the number of speeders.",
    "Akron installing 28 speed tables\n(WKSU) -- Akron will install 28 speed tables throughout the city to slow the speed of traffic.",
    "They said former FirstEnergy CEO Chuck Jones and senior vice president Michael Dowling were responsible for the company’s role.",
    "Installation begins this week and is expected to take nine to twelve weeks, as each table takes a full day to be set in place.",
    "An attorney for the former CEO asserted Wednesday that Jones didn't break the law or violate any of FirstEnergy’s policies.",
    "Shop owner Kelly Kandah says she and employees had to lock themselves in the bathroom and hide during the incident.",
    "The two attorneys revealed the names in new court documents Wednesday under order from a federal judge.",
    "He was convicted of interference with commerce in a three-day trial last December in federal court.",
    "Mike DeWine has given his first State of the State address since the pandemic struck in March 2020.",
    "Unlike speed bumps, the tables are raised areas on the road with tapered ends and long flat tops.",
    "Lawmakers still haven’t proposed moving the primary or splitting it into two events.",
    "The riots began as a protest against the death of George Floyd in Minneapolis.",
    "The central Ohio farmer has until Friday to respond to the violations.",
    "Ohio governor makes 1st statewide address in 3 years\n(AP) — Gov.",
    "Mike DeWine must refund $100,000 in campaign contributions.",
    "Both Jones and Dowling were fired by FirstEnergy in 2020.",
    "Absentee ballots are supposed to go out by April 5.",
    "Neither have been criminally charged.",
    "They will be removed before winter."
  ]
}