{
  "id": 1218,
  "mediaId": 8496,
  "date": "2022-02-14",
  "headline": "Latest Ohio inmate removed from death row via mental illness law",
  "image": "https://media.wkyc.com/assets/WBNS/images/f215a308-220c-4a71-a380-d5d05db6675b/f215a308-220c-4a71-a380-d5d05db6675b_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/politics/latest-inmate-removed-from-death-row-via-mental-illness-law/530-e1af5488-3793-4b7d-a625-14e87d805e95",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2143,
    6474,
    6164,
    6077
  ],
  "sentences": [
    "COLUMBUS, Ohio — A convicted killer who fatally shot a man nearly 40 years ago has been removed from Ohio's death row under a new law that prohibits the execution of people who had severe mental illness at the time of their crime.",
    "Last month, a judge in Stark County ruled that death row inmate David Sneed, 60, had schizoaffective disorder at the time of the November 1984 shooting death of Herbert Rowan in a botched robbery.",
    "The legislation that took effect in April 2021 provides a one-year window for current death row inmates to file to have their death sentences revoked because of the serious mental illness clause.",
    "Last year, judges also removed inmates in Butler and Franklin counties from death row after their attorneys successfully argued they met the mental illness criteria.",
    "Mike DeWine signed the bill into law last year covering killers diagnosed with schizophrenia, schizoaffective disorder, bipolar disorder or delusional disorder.",
    "The law covers killers diagnosed with schizophrenia, schizoaffective disorder, bipolar disorder or delusional disorder when they committed their offenses.",
    "The state’s last execution was July 18, 2018, when Ohio put to death Robert Van Hook for killing David Self in Cincinnati in 1985.",
    "Inmates who successfully appeal their sentences are removed from death row but still face life in prison without parole.",
    "Gov."
  ]
}