{
  "id": 122,
  "mediaId": 8491,
  "date": "2022-02-23",
  "headline": "Governor DeWine makes stop in Columbiana County",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/02/governor-dewine-in-salem-at-heggys.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/governor-dewine-makes-stop-in-columbiana-county/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooke Meenachan",
  "authorUrl": "https://www.wkbn.com/author/brooke-meenachan/",
  "termIds": [
    2143,
    1591,
    6076,
    6474,
    6576
  ],
  "sentences": [
    "“Usually, we have customers who solve the world’s problems at the big table, but we really have people who solve the world’s problems in here today,” said owner Christopher Heggy.",
    "It’s great to have him see what we’re doing and be able to share with his constituents what’s going on in small towns and how valuable this is to the state of Ohio,” Needs said.",
    "“What I do is I take information from meetings like this and go back to my team and say how can we be of help and how can we be of help to Columbiana County?” DeWine said.",
    "there, he heard from organizers about how the nonprofit helps with economic development in Salem and surrounding townships and its plans for future growth.",
    "Executive Director Julie Needs talked about some of the work the SOD Center has been doing and the projects she and her team have planned.",
    "She says this visit with the governor shows the importance of economic development in small communities.",
    "He started the morning off with breakfast at Heggy’s Confectionery off of East State Street in downtown.",
    "The governor also paid a visit to the Sustainable Opportunity Development Center (SOD).",
    "WKBN was told that DeWine had a private fundraiser in the area Tuesday night.",
    "SALEM, Ohio (WKBN)- Ohio Governor Mike DeWine was in Salem Wednesday morning.",
    "DeWine enjoyed a family-style breakfast alongside city and county leaders.",
    "The bacon was local bacon and sausage and everything was great,” he said.",
    "The visit was part of his campaign and governor duties.",
    "“So honored to have him here.",
    "“Breakfast was great."
  ]
}