{
  "id": 12349,
  "mediaId": 8283,
  "date": "2022-03-25",
  "headline": "Veterans demand to keep healthcare in Chillicothe at Veterans Council town hall",
  "image": "https://www.gannett-cdn.com/presto/2022/03/25/PCHI/52ffb0f6-17fb-48d9-8816-ff34534f3057-Townhall__13.jpg?crop=2399,1350,x0,y122&width=2399&height=1350&format=pjpg&auto=webp",
  "link": "https://www.chillicothegazette.com/story/news/2022/03/25/veterans-demand-keep-local-healthcare-chillicothe-town-hall-va-military/7073841001/",
  "mediaOutlet": "chillicothegazette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Megan Becker",
  "authorUrl": "https://www.chillicothegazette.com/staff/9157515002/megan-becker/",
  "termIds": [
    0
  ],
  "sentences": [
    "Beth Clodfelter, Appalacian Regional Representative for Senator Sherrod Brown, spoke with multiple members of the crowd, took notes on what each speaker talked about and handed out her contact information, showing support for the VA.\nBonnie Ward, Southeast Ohio Regional Liason with the office of the governor, said Mike DeWine is fighting to keep the Chillicothe VA.\n\"Hearing these stories is heart-wrenching and the governor is a big fan of what you guys do,\" Ward said.",
    "Garber-Cardwell agreed with Westfall, saying, \"I remember specifically asking the vendor that was doing the market assessments to please not sacrifice our 20,000 veterans for the 80,000 in Columbus.\"",
    "More: Report gives more insight into possible Chillicothe VA closure\nAl Baerkircher said he prefers the local Chillicothe VA Medical Center because he is treated differently at other hospitals.",
    "The Department of Veterans Affairs' recommended closing the Chillicothe VA in a report to the Asset and Infrastructure Review (AIR) Commission March 14, among other recommendations.",
    "State Representatives Mark Johnson (R-Chillicothe) has introduced a resolution urging the U.S. Department of Veterans Affairs to keep the Chillicothe VA Medical Center open.",
    "Garber-Cardwell said \"it's an all or nothing package\" and there will not be a line-item veto, so they will either approve or disapprove all of the recommendations.",
    "More: Chillicothe VA possible closure townhall discussion photos\nAlongside the veterans, former employees, spouses and other family members came to support the VA.",
    "She said she encourages older veterans to seek long-term care at the Georgetown Ohio Veterans Homes, but most say the hour drive is too far from Chillicothe.",
    "CHILLICOTHE— Over 50 people attended the Veterans Council town hall in a sea of black, blue and camouflage military hats to discuss the VA market assessment.",
    "Department of Veterans Affairs' recommendations\nMike Westfall, a Navy veteran, said the recommendations appeared to be based on population, not geography.",
    "The medical center has grown to oversee six community-based outpatient clinics in Athens, Cambridge, Lancaster, Marietta, Portsmouth and Wilmington.",
    "Several people also expressed that they feel safe at the Chillicothe VA and would feel in danger at facilities in Cincinnati, Columbus or Dayton.",
    "Renovate not tear down\nA common sentiment among the crowd was that the almost 100-year-old building would be better off renovated than torn down.",
    "Ohio State Representative Mark Johnson was also there, as well as aides to Senator Sherrod Brown, Senator Rob Portman and Governor Mike DeWine.",
    "Many asked questions about what the market assessment means for the veterans, but more stood up to voice their opinion on the recommendations.",
    "Stacey Boroff, an Air Force veteran and Ross County veteran service officer, held her hand high in the air waiting for her turn to speak.",
    "Boroff also said it has been a struggle to get veterans to seek mental health services, so the distance could cause an extra obstacle.",
    "\"What scares me is, when it goes to Congress or the President, they're not gonna read it... they're gonna rubber stamp this thing.\"",
    "Johnson wants to stop any possible consolidation from impacting the Chillicothe VA Medical Center that serves rural southeast Ohio.",
    "Westfall called for the community to contact their state representatives and voice their opinion on the VA market assessment.",
    "Clapping often followed each speaker while the crowd listened and understood the personal importance of the medical center.",
    "\"When I finally get these guys to go in and get help and treatment, and now they're getting battered,\" Boroff said.",
    "\"When we go to the Veterans Hospital, we're treated with kindness and respect that's not addressed in this report.",
    "Stacia Ruby and Diane Garber-Cardwell were at the meeting to represent the Chillicothe VA and answer questions.",
    "She can be reached at 740-349-1106, email her at mbecker@gannett.com or follow her on Twitter @BeckerReporting",
    "I'm afraid that this report is engineered to wipe out what we've got and build new stuff elsewhere,\" he said.",
    "If the recommendations were approved, she said veterans would have to drive even further for health care.",
    "President Joe Biden and Congress will either accept or reject the recommendations by January 2023.",
    "\"We also have a state representative who is fighting with the governor and the governor's office.",
    "\"You got number crunchers coming in here from somewhere else who don't even know the area.",
    "Many questioned the accuracy of the report and the qualifications of the evaluators.",
    "\"There's a big difference between the private sector and the veteran system.\"",
    "\"I don't think you understand how bad that is going to be for our veterans.\"",
    "He has a resolution and it is amazing and the governor will sign it.\"",
    "In 2021 the medical center received 221,979 outpatient visits.",
    "Megan Becker is a reporter for the Chillicothe Gazette.",
    "We cannot let this happen,\" Westfall said.",
    "They don't know the geography.",
    "They don't know the culture.",
    "They don't know the people."
  ]
}