{
  "id": 12363,
  "mediaId": 8425,
  "date": "2022-03-23",
  "headline": "DeWine makes first statewide address in 3 years",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/27/2017/12/cropped-favicon-31-32x32.png",
  "link": "https://www.recordherald.com/news/73389/dewine-makes-first-statewide-address-in-3-years",
  "mediaOutlet": "Record Herald - United States - Ohio",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Record Herald",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Over the past two years, the governor has faced criticism from many fellow Republicans for his efforts to slow the spread of the pandemic, and DeWine acknowledged at the start of his speech that, “no governor and General Assembly agree on everything.”\nLater, he touched on two of those disagreements: asking lawmakers to pass a stalled proposal to increase penalties on violent felons, part of a package of proposals DeWine offered after the August 2019 mass shooting in Dayton.",
    "Mike DeWine used his first State of the State speech in three years on Wednesday to boast about Ohio’s recovery from the coronavirus pandemic and its economic health while also pledging new investments in Appalachia and calling for more efforts to address mental illness treatment.",
    "Just minutes before the governor began speaking, attorneys representing investors in utility giant FirstEnergy Corp. for the first time said the company’s former chief executive and a top official masterminded payments to public officials in that scheme.",
    "During the speech, DeWine left unmentioned the possibility Ohio may have to move its May 3 primary because the Ohio Redistricting Commission, of which DeWine is a member, has failed three times to adopt a new set of constitutional legislative maps.",
    "The governor spent more than 10 minutes talking about the need for Ohio to improve mental health treatment, and also promised efforts to boost investment in Appalachia and strengthen programs benefitting students.",
    "DeWine faces a faces a four-way GOP primary in May, thanks to anger from conservatives over his efforts to slow the pandemic spread, including early shutdown orders and a statewide mask mandate.",
    "He also promoted his administration’s efforts to help law enforcement, contrasting that with calls to defund the police, spurring a standing ovation in the Republican-dominated legislature.",
    "And we are in fact coming for it all,” DeWine concluded, echoing the words of Cincinnati Bengals quarterback — and Ohio native — Joe Burrow before the team’s Super Bowl appearance.",
    "Democrats noted that earlier this month, the governor signed legislation ending the state’s concealed weapons permit requirement over the opposition of law enforcement groups.",
    "The governor indirectly kept politics out of his speech, instead promoting the notion that the state’s time “is now,” as illustrated by projects such as the Intel investment.",
    "DeWine also did not reference an ongoing $60 million bribery scheme that included passage of a 2019 bill that the governor signed bailing out two nuclear power plants.",
    "He highlighted Intel’s recent announcement of a $20 billion investment in two semiconductor factories, which will bring thousands of jobs to the state.",
    "Bohdan John Danylo, of the Ukrainian Catholic Eparchy of Saint Josaphat in Parma, gave the opening prayer, and DeWine’s first words addressed the war.",
    "But the state workforce also has shrunk by about 190,000 workers since the pandemic, and many companies are still struggling to find workers.",
    "Even with the governor in the midst of a reelection campaign this year, he didn’t propose any major initiatives during the hourlong speech.",
    "The scandal resulted in charges against former Republican House Speaker Larry Householder, who was expelled from office last summer.",
    "DeWine delivered his only other State of the State on March 5, 2019, with the pandemic canceling the next two annual addresses.",
    "Afterward, Democrats criticized the governor for failing to focus more on gun control issues and the redistricting chaos.",
    "Ohio’s unemployment rate this past January was slightly lower than what it was when the pandemic struck in March 2020.",
    "Instead, he ticked off a list of accomplishments and mostly avoided addressing the rough patches in his first term.",
    "He also asked lawmakers to pass a bill cracking down on distracted driving that also is stuck in the Legislature.",
    "“On behalf of the people of the state of Ohio, and all who love freedom, I say in salute: Glory to Ukraine.",
    "The Republican governor also applauded residents’ efforts to battle the coronavirus pandemic.",
    "DeWine began the speech in the Ohio House chamber with references to the war in Ukraine.",
    "“Ohio is making some noise and people are going to have to pay attention to us.",
    "He ducked a chance to debate his three far-right challengers next week.",
    "And you showed the world that Ohioans are resilient,” DeWine said.",
    "You made extraordinary sacrifices.",
    "Glory to the heroes,” DeWine said.",
    "COLUMBUS, Ohio (AP) — Gov.",
    "“You rallied together."
  ]
}