{
  "id": 12460,
  "mediaId": 8278,
  "date": "2022-03-28",
  "headline": "Laura Lyden Named to YSU Board of Trustees",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/03/laura-lyden925.jpg",
  "link": "https://businessjournaldaily.com/laura-lyden-named-to-ysu-board-of-trustees/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3541,
    2143,
    1625,
    6347,
    6744
  ],
  "sentences": [
    "She also pursued graduate studies in analytical chemistry at YSU and previously managed of environmental technology for the YSU-Technology Development Corp. She was manager of environmental and analytical services for the YSU Center for Engineering Research and Technology, where she directed the Mahoning County Industrial Waste Minimization Project and was director of Mahoning Valley Brownfields Inc., according to a university release.",
    "Among her community activities: past vice president and community investment chair for the United Way of Youngstown and the Mahoning Valley; past president and member of the Mahoning County Mental Health Board; past president and member of the Ellsworth Township Zoning Board; past judging chair of the Lake to River Science Day; and past board president of the Volunteer Services Agency.",
    "Paul Lyden’s father, William G. Lyden Jr., played a major role in securing funds to build YSU’s Stambaugh Stadium in the early 1980s and, in 1988, received an honorary degree and delivered the commencement address at Spring graduation, according to the release.",
    "She then served three years as president of JLT Research Inc., an environmental consulting and research firm, and then seven years as safety, health and environmental manager at True North Management LLC/The Lyden Co.",
    "YOUNGSTOWN, Ohio — Laura Lyden, sales and operations manager and corporate secretary of Lyden Oil Co., has been named to the Youngstown State University Board of Trustees.",
    "In 2006, Lyden took her current position at Lyden Oil and is responsible for the daily operations of the Youngstown division of the company that includes 70 employees.",
    "Mike DeWine appointed Lyden to fill the unexpired term of Capri Cafaro, who resigned from the board earlier this year.",
    "Burke Lyden, great uncle of Laura’s husband, Paul, founded The Jambar student newspaper at Youngstown College in 1931.",
    "In 2019, Paul and Laura and the Lyden Oil family were named Penguins of the Year.",
    "Paul’s brother, Mark, was a member of the YSU Board of Trustees in the 1990s.",
    "Lyden holds a bachelor’s in combined science from YSU.",
    "Published by The Business Journal, Youngstown, Ohio.",
    "The Lyden name is long been associated with YSU.",
    "Lyden’s term will run through April 30, 2026.",
    "Gov."
  ]
}