{
  "id": 12640,
  "mediaId": 2564,
  "date": "2022-02-28",
  "headline": "Groundswell of states demand BAN on Russian imports like caviar, furs and candy as bars pour out the few brands of vodka made in Moscow",
  "image": "https://i.dailymail.co.uk/1s/2022/02/28/20/54771037-0-image-a-35_1646080347475.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10560285/Groundswell-states-demands-Russian-products-removed-shelves-bars-pour-away-Russian-vodka.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Drudge Report",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Hammer For Dailymail.Com",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Alex+Hammer+For+Dailymail.Com",
  "termIds": [
    5418,
    4591,
    4081,
    6569
  ],
  "sentences": [
    "Black caviar - one of the most famous and expensive delicacies in the world, and the oil-rich country's original 'black gold' - was once one of the nation's leading exports and sources of wealth, but production has since dwindled since the fall of the former Soviet Union, after the country lost two thirds of its access to sturgeon species endemic to the Caspian Sea to nations formed after the fall of the Iron Curtain.",
    "+7\nView gallery\nTotal Wine & More in New Jersey lets its shoppers know it has pulled Russian-made liquors from its shelves Monday\n+7\nView gallery\nPremier Wines in Amherst, New York, posted image of Ukrainian flag in announcing it won't sell Russian-made spirits\nStill, the few specialty items that are imported, whether it's the popular Russian ice cream brand Bandi or dairy products like kefir, could soon be scarce.",
    "+7\nView gallery\nWhile caviar made in Russia may be pulled from store shelves, other ethnic delicacies are expected to be available because the majority are made in the US\nUtah Governor Spencer Cox requested Saturday that state-run liquor outlets 'remove all Russian-produced and Russian-branded products,' stating that Russia's invasion of Ukraine is an 'egregious violation of human rights.'",
    "+7\nView gallery\nBill McCormick (pictured), owner of Pine Tavern in Bend, Oregon, is emptying the entire bar's Russian vodka in protest against Russia, which is 'acting as though it's 1939'\n+7\nView gallery\nTwo men working at Evel Pie - a popular pizzeria / bar in Las Vegas - decided to dump out all the Russian Vodka that it owned and replace it with Ukrainian Vodka.",
    "pic.twitter.com/5y2TWP8feK\n— Magic Mountain (@SkiMagicVT) February 24, 2022\nSome brands are already feeling the effects of the boycott, with the company behind Russian-named Stolichnaya, the Stoli Group, quick to point out that they are not a Russian company, when reaching out to bar and liquor store owners to ask them to continue supporting their products.",
    "American store and bar owners have also joined in on the makeshift sanctions by the state officials, dumping out bottles of Russian vodka - and even liquor originating from other country's bearing Russian branding, such as Stolichnaya, which bears a Russian name and origin but is produced in Latvia, is based in pro-Ukraine Luxemburg.",
    "+7\nView gallery\nNew York Governor Kathy Hochul signed an executive order Sunday forbidding New York from doing business with Russia\nMeanwhile, in Arizona, the proprietor of Scottsdale restaurant SumoMaya took a similar stand against the conflict in Ukraine, by dumping all the establishment's Russian alcohol and fine caviar.",
    "Earlier in the week, Colorado Governor Jared Polis ordered his state's Office of Information Technology and the Department of Personnel and Administration to peruse state contracts to see if any Russian state-owned companies are currently doing business with Colorado, instructing officials to nix any that are found.",
    "RUSSIAN-MADE PRODUCTS SOLD IN THE UNITED STATES\n-Vodka\n-Furs\n-Jewelry (pearls, stones, metals, coins)\n-Caviar\n-Seafood\n-Meats\n-Candies\n-Corn\n-Grain\n-Fertilizers\nAdvertisement\n'We live in an amazing country that allows us to do this freely and not have any negative repercussions from it,' Gutierrez said.",
    "Most of Russia's $22.3 billion in exports to the US are not things you're likely to find at your local grocery, with its biggest contribution to the country being mineral fuels - estimated at $13 billion - which accounts for more than half of the goods supplied by the country.",
    "Russia's most famous export, vodka, has so far been at the forefront of the burgeoning backlash, with officials in Pennsylvania, Ohio, Utah and New Hampshire last week calling on liquor shops to remove Russian-made or Russian-branded products from their store stock.",
    "Meanwhile, bars and liquor store owners responded to Putin's aggression by pouring out Russian-branded spirits such as Russian Standard and Stolichnaya, with some stores shilling Russian products at a slashed rate to get rid of their stock.",
    "An increasing number of US states have demanded stores remove Russian products from their shelves to protest the unprovoked invasion of Ukraine, which may result in shoppers struggling to find certain Russian staples at their local market.",
    "In West New York, liquor store Attica Wine & Spirits announced Friday that it would be doing away with its Russian-made spirits, saying it would be selling off remaining Russian items at a reduced rate in an effort to rid their supply.",
    "The country currently exports 50 metric tons a year, which then sells for as much as $1,000 to $2,000 per kilogram - a yield of just $1-to-2million, due to the sturgeon's reduced numbers as a result of centuries of overfishing.",
    "On Saturday, Virginia Governor Glenn Youngkin ordered the Department of General Services to review state contracts to see if tax dollars were being spent on goods and services from Russian companies, WRIC-TV reported.",
    "They are donating all of the proceeds to help the people of Ukraine\nAnother bar owner in Grand Rapids, Michigan, told MLive.com he cleaned his shelves of Russian items as a 'protest against the aggression.'",
    "The sale of Russian furs, meanwhile, has also declined in recent years, due to the advent of other, cheaper options from Asian countries like China, and finer options in countries like France and Italy.",
    "'I think the whole world knows by now that Russia's at war with Ukraine for no apparent reason,' Jamie Stratton, wine director and partner of Jacob Liquor Exchange, told KSNW-TV in Wichita, Kansas.",
    "'The majority of Russian food products sold in US stores are made in Los Angeles, Chicago and New York,' said Gary Korkin, an Odessa-born US citizen who owned a Russian grocery story in the Bronx.",
    "Guillermo Gutierrez, the restaurant's general manager, says his boss told him telling nix the products - worth thousands of dollars - at the Asian eatery and his other restaurant, Local Bistro.",
    "'Due to the current situation in Ukraine, we have decided to remove all items made in Russia from our shelves,' the liquor store, located 30 miles east of Buffalo wrote in a post on Facebook.",
    "Elsewhere in the US, a liquor store in Wichita, Kansas, has removed more than 100 bottles of Russian vodka from its shelves and pouring some of it on the ground in protest to Putin's actions.",
    "Americans looking to indulge in Russian caviar may find the delicacy hard to find as states across the country push for a ban on products imported from warmonger Vladimir Putin's nation.",
    "At Ann's Deli & Bakery, a longtime fixture selling Russian goods in Chicago, a sign greeted shoppers Monday, saying: 'Ann's Bakery no longer supplies Russian-made products.'",
    "New York Governor Kathy Hochul signed an executive order Sunday forbidding her state from doing business with Russia, and said Ukrainian refugees are welcome in New York.",
    "New Hampshire's Governor Chris Sununu made a similar announcement, asking for the removal of 'Russian-made and Russian-branded spirits' in the 'Live Free or Die' state.",
    "Isely said that while ditching Russian products may put a squeeze on Russian businesses and manufacturers, it's not likely to change the country's course with Ukraine.",
    "Russia sells about $41 million worth of vodka to the U.S. every year, which economics professor Paul Isely says is a drop in the bucket for the Kremlin-led country.",
    "'We are a global organization with a significant portfolio of spirits and wine brands from around the world, with Stoli's European Global HQ based in Luxembourg.",
    "And as the conflict continues, other exports from the Eastern European nation - such as caviar, seafood, jewelry, corn, furs and grain - may soon become scarce.",
    "However, the Eastern European nation does provide an array of items associated with lavish living, including black caviar - a historic staple of the country.",
    "She joined a long list of politicians seeking to show solidarity with Ukraine and hurt Russia economically, though the impact will mostly be symbolic.",
    "'Russia is acting as though it's 1939 and going into Europe with a full force that they have in the Ukraine,' owner Bill McCormick told the station.",
    "On Sunday, Pennsylvania Governor Tom Wolf asked the Pennsylvania Liquor Control Board to remove Russian-sourced products from stores in the state.",
    "In Ohio, Governor Mike DeWine moved to halt the purchase and sale of all vodka made by Russian Standard, a renowned, Russian-owned liquor company.",
    "The bartender tells him that 'we don't serve Russian products here,' before dumping a bottle of Stolichnaya vodka down the bar counter's drain.",
    "According to the Associated Press, the removal of Russian-made products from shelves is happening across the country and even in Canada.",
    "However, many popular ethnic food staples like kielbasas, cheeses and candies should remain in stores since they are produced in the US.",
    "'We have said we'll open up our hearts, our homes, our resources to the people of the Ukraine, to say, 'We stand with you,' Hochul said.",
    "'That's really small compared to the $1.7 trillion economy in Russia,' the Grand Valley State University educator told TV station WZZM.",
    "The store then announced in a subsequent post Sunday it was going to replace Russian-made vodkas with Vodka from the Ukraine next week.",
    "Quay added that, once it's warmer outside, he might organize an event to pour the bottles out in the parking lot in front of a crowd.",
    "We are absolutely NOT a Russian company,' Damian McKinney, Stoli Group global CEO, wrote in a letter to Stratton, according to KSNW.",
    "In Oregon, the owner of Pine Tavern in Bend recorded himself emptying all of his Russian vodka, according to FOX 12 of Portland.",
    "The board later decreed that all Russian-made products be removed as a show of solidarity and support for the people of Ukraine.",
    "He added that he expects to lose a few hundred dollars over his decision - but said that the protest was worth it.",
    "A ski resort in Vermont took to Twitter to share a video of staffers pouring Russian vodka down a literal drain.",
    "'Starting next week, Ukrainian vodka will be taking the place of Russian vodka on our shelves,' owners wrote.",
    "In a video attached to the tweet, a customer off-camera can be heard asking for a Stoli and soda.",
    "'I guess this is our sanction … and this may be small, but every small thing makes a difference.'",
    "The same type of messages have popped up mainly at liquor stores around the country.",
    "'It is a small gesture, but millions of small gestures make a large gesture!",
    "'I just made the decision on the spot,' Bob Quay, owner of Bob's Bar, said.",
    "Stoli Premium and Elit are manufactured and bottled in Riga, Latvia.'",
    "They'll also be replacing the lost items with Ukrainian products.",
    "'I am so concerned about it metastasizing into other countries.'",
    "'Sorry @Stoli lovers,' Magic Mountain Ski Area said in a Tweet.",
    "'These items will be discounted until gone.",
    "'It's just something little we can do.'",
    "'We're very passionate about it.'",
    "'With regard to us being Russian.",
    "Thanks for your understanding.'",
    "#westandwithukraine.'",
    "Sorry @Stoli lovers.",
    "'No more.'",
    "No more.",
    "????????"
  ]
}