{
  "id": 1284,
  "mediaId": 8507,
  "date": "2022-02-15",
  "headline": "Ohio redistricting: Few signs that third time's a charm for state House and Senate maps",
  "image": "https://www.gannett-cdn.com/presto/2022/01/18/NCOD/4f0c4c34-e64d-4f1b-bdbe-97de227bc6eb-Ohio_Redistricting_Commission_KWR_02.jpg?crop=2499,1406,x0,y0&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/02/12/ohio-redistricting-whats-happening-ohios-new-maps/6749928001/",
  "mediaOutlet": "zanesvilletimesrecorder.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I’m sure at this point, Democrats believe they could draw House and Senate maps in crayon and watercolor and the same four members of the court would approve their unconstitutional maps,\" Senate Republican spokesman John Fortney said.",
    "The new versions were similar to the ones Senate President Matt Huffman skewered in late January, but Democratic map consultant Chris Glassburn said they fixed the techical problems Huffman pointed out.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "The seven-member Ohio Redistricting Commission now tasked with redrawing both statehouse and congressional districts had no official maps, no plan to meet and no signs of compromise.",
    "\"If there was the will to engage in a robust bipartisan process, they would have already established a schedule,\" said Catherine Turcer, executive director of Common Cause Ohio.",
    "Several days after the Ohio Supreme Court rejected legislative maps for the second time, those tasked with trying again offered few signs that the third time would be a charm.",
    "But Republicans were quick to point out ways the Democratic map split cities like Toledo or Akron into multiple districts, unnecessarily dividing communities of interest.",
    "If the Ohio Redistricting Commission can approve maps that the Ohio Supreme Court will okay by Thursday, lawmakers shouldn't have to move the May 3rd primary, Russo said.",
    "Russo said she wouldn't speculate on whether the Super Bowl had derailed redistricting progress, adding \"the Super Bowl is happening this weekend and go Bengals.\"",
    "On Friday, the commission's two Democrats – House Minority Leader Allison Russo and Sen. Vernon Sykes – presented their latest House and Senate maps to reporters.",
    "Glassburn also said he didn't know how many Republican lawmakers would be grouped into the same districts in the House, but no Democratic legislators were.",
    "\"I always listen to what our local officials who actually have to implement this have to say and they've made it clear that that would be untenable.\"",
    "Their proposals would give Republicans a 54-45 advantage in the House and 18-15 in the Senate – hitting the proportional mark.",
    "Russo and Sykes expressed frustration that Republicans hadn't shown them any maps to date or set a meeting for the commission.",
    "Russo floated a vague threat that the Ohio Supreme Court could take action if mapmakers refuse to approve constitutional maps.",
    "Democrats decried the now-rejected GOP maps that created about a dozen Democratic districts that were more like tossups.",
    "If all of that doesn't sound like the parties are close to a bipartisan compromise, that's because they aren't.",
    "Huffman had pitched holding two primaries, but local election officials had pushed back against that idea.",
    "The commission hasn't set a meeting because Republicans haven't been able to agree on a date, Sykes said.",
    "But if the primary must be moved, Russo said she would support moving all of the races to the same date.",
    "Mike DeWine, a member of the commission, is in Los Angeles for the Super Bowl and flies home Monday.",
    "Staff members have so far met less frequently than they did while working on the second set of maps.",
    "A spokesman said the governor has still been involved in redistricting discussions every day.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "That frustration is shared by those who advocated for redistricting reforms.",
    "Russo said two primaries would be very expensive and difficult to pull off.",
    "\"It just feels like a merry-go-round or some sort of weird Groundhog Day.\"",
    "\"We certainly can still hold a primary in May that is doable,\" Russo said.",
    "The court-imposed deadline for new House and Senate maps is Thursday.",
    "\"The court has tools to deal with those who break the law.",
    "See the Democrats' House map and Senate map here.",
    "It's what courts do every day,\" Russo said.",
    "The Democrats' House proposal creates five.",
    "What will happen to the Ohio primary?",
    "Super Bowl delay?",
    "Gov."
  ]
}