{
  "id": 12892,
  "mediaId": 2919,
  "date": "2022-03-01",
  "headline": "Gov. Mike DeWine orders ODOT to light George. V. Voinovich Bridge with colors of Ukraine's flag",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/b407f55/2147483647/strip/true/crop/2016x1058+0+436/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F23%2F90%2Fed32c5134a7bb55afe61d69707e8%2Ffmzk9oxxeaagri3.jpeg",
  "link": "https://www.news5cleveland.com/news/national/russia-ukraine-conflict/gov-mike-dewine-orders-odot-to-light-george-v-voinovich-bridge-with-colors-of-ukraines-flag",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Drew Scofield",
  "authorUrl": "https://www.news5cleveland.com/drew-scofield",
  "termIds": [
    2143,
    966,
    6474,
    6104,
    6077,
    6569,
    6672
  ],
  "sentences": [
    "Details: https://t.co/KU3VFEv38b #StandWithUkraine @ODOT_Statewide pic.twitter.com/cmjmwxoi0C\n— Governor Mike DeWine (@GovMikeDeWine) March 1, 2022\nHe continued, “I also urge other public and privately-owned building owners to join us in demonstration of deep concern about the senseless attack on Ukraine,” said Governor DeWine.",
    "“I hope all Ohioans will join with the more than 42,000 Ukrainians living in our state and continue to pray for a peaceful end to this senseless Russian aggression.”\nWe're lighting up several Ohio bridges tonight to show support for Ukraine.",
    "“In Ohio, we rally around those who need support, and this is a simple way to not only support those living in Ukraine but also our Ukrainian friends and neighbors living in Ohio.\"",
    "Over the weekend, DeWine showed support by ordering Russian Standard vodka removed from store shelves, which is the only Russian-owned vodka distillery that sells vodka in Ohio.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "DeWine's office said the Ashtabula County Engineer's Office will also show its support for Ukraine by having the Ashtabula Harbor Lift Bridge lit up.",
    "“This is a way to show our support of the Ukrainian people in their struggle against Russia’s unprovoked attack on their country,” said DeWine.",
    "COLUMBUS, Ohio — Tuesday night, two local bridges will glow blue and yellow in support of Ukraine after the invasion by Russia.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "Additionally, DeWine has ordered ODOT to light the bridges in Dayton over Interstate 75.",
    "Currently, the Ukrainian flag is being flown over the Ohio Statehouse in Columbus.",
    "Download now on your Apple device here, and your Android device here.",
    "Toledo is planning to light the Anthony Wayne Bridge as well.",
    "This isn't the first move DeWine has made to back Ukraine.",
    "V. Voinovich Bridge with the colors of the Ukraine flag.",
    "Mike DeWine ordered ODOT to illuminate the George.",
    "DeWine also has it flown over his home in Bexley.",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "Gov."
  ]
}