{
  "id": 12911,
  "mediaId": 6571,
  "date": "2022-03-05",
  "headline": "Ohio Bill Seeks Removal Of Russian Assets From State Funds",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/01/26/2192e557-8dc3-4cb9-998d-ad54e9ab8820/thumbnail/1200x630/9ae81ca0199085b9e59e6c6ff73c632f/government_court.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/ohio-bill-seeks-removal-of-russian-assets-from-state-funds/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3235,
    3992,
    1126,
    6104,
    6474,
    6077,
    6569
  ],
  "sentences": [
    "COLUMBUS, Ohio (AP) — Ohioan's five public employee pension funds would have to divest themselves of all Russian-connected assets and state and local governments would be banned from contracting with Russian companies under emergency GOP legislation introduced Thursday.",
    "The measure sponsored by state Sen. Niraj Antani, a suburban Dayton Republican, also prohibits state or local governments from providing tax incentives, loans, or grants to Russian companies.",
    "Mike DeWine that immediately lays out such requirements for state entities, and one day after Ohio Attorney General Dave Yost also asked the pension funds to divest their Russian assets.",
    "Governors and lawmakers in numerous U.S. states took actions this week to pull state investments from Russian companies while encouraging private entities to do the same.",
    "Antani's bill, meant to punish Russia for its invasion of Ukraine, contains an emergency clause meaning it would take effect immediately if signed into law.",
    "\"By requiring the state to cut all ties with Russia, we are doing our part to increase the financial strain on Russia,\" Antani said.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "The bill came the same day as an executive order from Republican Gov.",
    "(Copyright 2022 The Associated Press.",
    "All rights reserved.",
    "In:\nRussia\nOhio"
  ]
}