{
  "id": 13010,
  "mediaId": 2919,
  "date": "2022-03-04",
  "headline": "Gun lobbyist wrote GOP lawmakers’ ‘permitless carry’ speech, document data shows",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/06ea0cc/2147483647/strip/true/crop/1024x538+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fda%2Ff7%2Fe7f7eb6f4e7cbf352009568def3e%2Fbrinkman-and-jordan-1024x576.jpeg",
  "link": "https://www.news5cleveland.com/news/state/gun-lobbyist-wrote-gop-lawmakers-permitless-carry-speech-document-data-shows",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Zuckerman",
  "authorUrl": "https://www.news5cleveland.com/jake-zuckerman",
  "termIds": [
    5616,
    2143,
    2142,
    3208,
    1068,
    1126,
    973,
    6474,
    6713
  ],
  "sentences": [
    "Sadly, that individual instantly turns into a felon if they have not gone through some the government-mandated rigmarole first, which is a violation of their God-given rights stipulated under the Second Amendment.”\nBrinkman said he doesn’t know who wrote it but it’s possible his staff went back and forth with Dorr to “polish” the speech.",
    "In 2021, Dorr and his brothers were the subject of a Pulitzer prize winning podcast series investigating “[the] ‘no compromise’ gun rights activists that illuminated the profound differences and deepening schism between American conservatives.”\nBoth Dorr and Brinkman said Thursday they expect DeWine will ultimately sign the bill.",
    "‘We tried to fix the bill’\nOn Tuesday, Republicans on the House Government Oversight Committee adopted two last-minute amendments to the permitless carry bill sent to the governor, one of which gun owners said could allow law enforcement to stop and frisk people who are spotted carrying a concealed weapon.",
    "The Jordan-Brinkman is what’s known as a “companion bill” — part of a legislative strategy in which proponents run two versions of the same legislation in both the House and Senate at the same time to boost its odds of becoming law.",
    "Last April, two Republicans in the Ohio House told lawmakers their “constitutional carry” bill would ease the bureaucratic hassle of undergoing training and a background check to obtain a license to carry a concealed weapon.",
    "During the floor debate Wednesday, Brinkman tried to force an amendment on the floor removing the committee’s changes, but was blocked on procedural grounds by House Speaker Bob Cupp, R-Lima.",
    "Dorr said DeWine tends to drag his feet on gun issues but will likely pull through — he’s facing primary challenges from the right and doesn’t want to make the election about guns.",
    "Brinkman said while the vote Wednesday fell short of the 60-vote supermajority required for a veto, the Republican caucus could muster requisite support from its 64 members.",
    "They generally seek to outflank Republicans and other gun lobby organizations from the right via a no-compromise advocacy and grass roots approach.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "He deserves a big shoutout.”\nBesides the local organization, Dorr and his brothers represent affiliate gun owner organizations in 11 states.",
    "Dorr, wearing sunglasses for a video posted to his Facebook account Wednesday, praised Brinkman for trying to scrap the committee changes.",
    "Dorr writing the testimony is among the clearest signs of the close working relationship between gun lobbyists and Republican lawmakers.",
    "On April 15, 2021, Reps. Tom Brinkman and Kris Jordan stood before the House Government Oversight Committee introducing House Bill 227.",
    "“In order to avoid unnecessary hassle from the public or law enforcement, one may decide to put a coat or jacket over their firearm.",
    "For instance, Sen. George Lang, a West Chester Township Republican, co-sponsored the permitless carry bill that was sent to DeWine.",
    "His business partners include the Buckeye Firearms Association’s executive director and another lawyer with the lobbying group.",
    "Dorr said in text messages and an interview Thursday he “maybe/probably” wrote the speech, but he couldn’t remember for sure.",
    "Metadata attached to a copy of their testimony on the legislature’s website shows his name as the author of the document.",
    "He owns an insurance company that sells firearms liability policies for those who shoot others in purported self-defense.",
    "“My feeling of, non-concern — my lack of concern is I know we’ve passed it and can override his veto,” Brinkman said.",
    "The bill would allow anyone 21 and older who can lawfully own a weapon to carry it concealed on their persons.",
    "Financial disclosures show Lang has earned more than $100,000 annually from the business since at least 2016.",
    "Lawmakers on Wednesday passed a separate, Senate version of a permitless carry bill and sent it to Gov.",
    "“Most gun owners know that openly carrying their firearm is not always practical,” Brinkman said.",
    "In it, the two lawmakers said carrying an openly displayed firearm in Ohio is already legal.",
    "Chris Door, the “no compromise” gun lobbyist and executive director of Ohio Gun Owners, did.",
    "“Whether it’s one step or two.”\nJordan did not respond to inquiries left with his office.",
    "He seemingly acknowledged the possibility of a conflict of interest in a 2020 interview.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "So why should carrying a concealed weapon without a permit be illegal?",
    "Both the House and the Senate passed the bill shortly afterward.",
    "“We tried to fix the bill on the house floor,” he said.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "“Of course, they used procedure to cut that down.",
    "That’s what staff is for,” Brinkman said.",
    "“I have no idea who writes my testimony.",
    "I never write my floor speeches.",
    "They didn’t write the speech.",
    "I never write my testimony.",
    "Mike DeWine."
  ]
}