{
  "id": 13087,
  "mediaId": 6676,
  "date": "2022-02-27",
  "headline": "Some U.S. governors calling for removal of Russian vodka, products",
  "image": "https://www.wkrg.com/wp-content/uploads/sites/49/2022/02/AP22057771820187-1.jpg?w=1280",
  "link": "https://www.wkrg.com/international/some-u-s-governors-calling-for-removal-of-russian-vodka-products/",
  "mediaOutlet": "wkrg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Addy Bink",
  "authorUrl": "https://www.newsnationnow.com/?post_type=profile&p=1777414",
  "termIds": [
    5078,
    4081,
    2743,
    419,
    1029,
    1161,
    6074,
    6672,
    6569
  ],
  "sentences": [
    "In a statement shared with WRIC, Youngkin said he was directing the Department of General Services, which oversees the state’s contracts with private companies, to determine whether any public money was being spent on “goods and services from primarily Russian companies.”\nAs of Sunday, the Virginia Alcoholic Beverage Control has removed seven Russian-sourced vodka brands from shelves, WAVY reports.",
    "Greg Abbott tweeted Saturday that he is asking members of the state’s Restaurant Association, Package Stores Association and other retailers to “voluntarily remove all Russian products from their shelves.” According to KXAN, some have already done so and are even looking to bring in more Ukrainian products.",
    "Jared Polis of Colorado has directed his state’s Office of Information Technology and the Department of Personnel and Administration to look through current state contracts to see if there are any Russian state-owned companies currently doing business with Colorado.",
    "In a statement from DeWine’s office, the Division of Liquor Control estimates there are approximately 6,400 bottles of Russian vodka currently on sale in the state’s liquor stores, WCMH reports.",
    "He says the board has already identified Russian-sourced products currently being sold at Fine Wine & Good Spirits stores, but is urging for sales to cease as quickly as possible, WJET reports.",
    "Mike DeWine has ordered the state’s Department of Commerce to stop buying and selling vodka made by Russian Standard, the only Russian-owned vodka distillery selling the spirit in Ohio.",
    "(NEXSTAR) – While the U.S. has already imposed official sanctions against Russia, some states are taking it upon themselves to pose economic pain following Russia’s invasion of Ukraine.",
    "Spencer Cox have both issued executive orders requiring their state liquor outlets to remove all Russian-produced and Russian-branded products.",
    "Bars and liquor stores throughout the U.S. and Canada have already begun removing Russian vodka and other liquor from their shelves.",
    "Tom Wolf is asking the Pennsylvania Liquor Control Board to remove Russian-sourced products from stores in the Commonwealth.",
    "A handful of governors are now encouraging – and in some cases, ordering – businesses in their states to go even further.",
    "Glenn Youngkin has called for the Commonwealth and local governments to sever ties with Russian entities.",
    "Two other states are looking deeper into the government-related connections they have with Russia.",
    "The Associated Press contributed to this report.",
    "Any found will be terminated, KDVR reports.",
    "Chris Sununu and Utah Gov.",
    "New Hampshire Gov.",
    "Virginia’s Gov.",
    "Texas Gov.",
    "Ohio Gov.",
    "Gov.",
    "Gov."
  ]
}