{
  "id": 13130,
  "mediaId": 3993,
  "date": "2022-03-04",
  "headline": "DeSantis on Constitutional Carry: \"Put it on my desk and I'll sign it\"",
  "image": "https://media.townhall.com/townhall/reu/o/2022/55/471a9f95-aa18-43ef-a5fe-1b8f2e4eee03-1110x740.jpg",
  "link": "https://bearingarms.com/camedwards/2022/03/04/desantis-on-constitutional-carry-put-it-on-my-desk-and-ill-sign-it-n56087",
  "mediaOutlet": "bearingarms.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cam Edwards",
  "authorUrl": "https://bearingarms.com/author/camedwards",
  "termIds": [
    5370,
    5298,
    1679,
    4876,
    6159,
    6257,
    6488
  ],
  "sentences": [
    "The governor could have said something like “Look, we’ve got nine days left in the session and I want to see this bill become law, so I’m calling on the House Speaker to get this bill going and bring it forward for a full vote in the House by the end of the week.”\nDeSantis could also have called out the Republican House member whose staffer recently trashed petitions from voters calling for Constitutional Carry, especially since Rep. Chuck Brannan heads up the House subcommittee that has kept Sabatini’s bill bottled up for most of the session.",
    "Eskamani’s bizarre argument against permitless carry aside, she’s right that it would be highly unlikely for Sabatini’s Constitutional Carry bill to be discharged directly to the House floor for a vote, especially with Sabatini himself calling the guy who can make it happen a RINO squish.",
    "Ron DeSantis gave his strongest statement of support for Constitutional Carry on Thursday, responding to a question from a reporter about the fate of permitless carry by declaring that if legislators “put it on my desk” he’s willing to sign the bill.",
    "As things stand right now, I feel very good about Alabama, Georgia, and Ohio becoming Constitutional Carry states this year, and I think there’s a really good chance that Indiana lawmakers get it done as well.",
    "“The notion that a bill as substantial as this would just come to the floor without going through the committee process is highly unlikely,” said State Representative Anna Eskamani (D-Orlando).",
    "Unless something dramatic happens in the next couple of days, however, I’m afraid that Florida’s permitless carry bill is gonna run out gas before it ever gets to DeSantis’ desk.",
    "I take the governor at his word that he would indeed sign Constitutional Carry if it gets to desk, but he just doesn’t seem that interested in pushing it across the finish line.",
    "Democratic State Representative Anna Eskamani not only believes constitutional carry is likely dead in the water this year, but she argues it’s dangerous public policy.",
    "Unfortunately, as Jacksonville television reporter Jake Stofan notes, the governor’s backing may be too little, too late to ensure a legislative win for the measure.",
    "If that were the case, DeSantis would have been much more direct much earlier in the session rather than taking the hands-off approach that we’ve seen to date.",
    "It hasn’t gotten a single hearing in either chamber and the Governor’s endorsement came with only nine days remaining in the legislative session.",
    "Mike DeWine, but at the same time it’s an awfully passive tone to take if DeSantis were really throwing his full weight behind permitless carry.",
    "Sabatini on the other hand thinks the Governor’s endorsement carries enough weight to push the bill over the finish line.",
    "“In cases of mass shootings, it becomes very difficult to even detect who is the perpetrator of that act of violence.",
    "We can waive the rules and bring it to the floor immediately if they wish, and it’s time we do that,” said Sabatini.",
    "Instead, in response to a question by a reporter he said that he’d sign the bill if it gets to his desk.",
    "And despite what Sabatini claimed, DeSantis didn’t demand that lawmakers approve Constitutional Carry.",
    "That’s why so many law enforcement officers have opposed something like open carry,” said Eskamani.",
    "He wants it on his desk and the RINO Speaker of the House Chris Sprowls is still blocking it.",
    "On the one hand, that’s more than we’ve heard from Republicans like Ohio Gov.",
    "“The Governor is demanding that this bill pass.",
    "The governor did none of those things.",
    "Recommended Bearing Arms Video:",
    "Florida Gov."
  ]
}