{
  "id": 13157,
  "mediaId": 5117,
  "date": "2022-02-28",
  "headline": "Stoli Vodka, Smirnoff - neither made in Russia - being dumped out as states boycott",
  "image": "https://cdn.abcotvs.com/dip/images/11607529_022822smirnoff.jpg?w=1600",
  "link": "https://abc7.com/russian-made-alcohol-boycott-stoli-vodka-latvia-smirnoff-made-in-illinois-russian-standard/11607533/",
  "mediaOutlet": "abc7.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Valinsky",
  "authorUrl": "",
  "termIds": [
    5418,
    1161,
    1211,
    6672,
    6678,
    6569,
    6506,
    6512
  ],
  "sentences": [
    "These boycotts are largely symbolic because Russian-made vodka accounts for a very small percentage of the roughly $7 billion in annual vodka sales, according to the Distilled Spirits Council (DISCUS), a national trade organization that represents spirits makers.",
    "So far, officials in Pennsylvania, Ohio, Utah and New Hampshire have called on liquor stores to remove Russian-made or Russian-branded products from shelves, a move that largely targets vodka since it's most closely associated with the country.",
    "Utah Governor Spencer Cox requested on Saturday that state-run liquor outlets \"remove all Russian-produced and Russian-branded products,\" explaining that Russia's invasion of Ukraine is an \"egregious violation of human rights.\"",
    "On Saturday, he asked the state's nearly 500 liquor stores to \"cease both the purchase and sale of all vodka made by Russian Standard, the only overseas, Russian-owned distillery with vodka sold in Ohio.\"",
    "In a statement to CNN Business, Stoli Group said it \"unequivocally condemns the military action in Ukraine and stands ready to support the Ukrainian people, our teams and partners.\"",
    "In fact, more than half of all vodka consumed domestically is actually made here, according to data from IWSR Drinks Market Analysis, a global firm that tracks alcohol sales.",
    "These moves are largely symbolic - and may even miss their intended target - as very few brands imported to the United States still produce the liquor in Russia.",
    "Although it traces its heritage to 19th century Russia, the company has long been owned by British spirits giant Diageo and is manufactured in Illinois.",
    "The vodka is actually made in Latvia, and the company's headquarters is in Luxembourg - a member of NATO which has spoken against the Russian invasion.",
    "Russian Standard, along with lesser-known vodka Green Mark, are one of the few alcohol brands imported from Russia and sold in the United States.",
    "Many of the top-selling vodka brands that trace their origins to Russia are now distilled in multiple countries - including the United States.",
    "It's parent company, Roust International, is owned by Roustam Tariko, a Russian oligarch who also owns Russian Standard Bank.",
    "PHILADELPHIA -- Russian-made alcohol is the latest target in the growing backlash against the country's invasion of Ukraine.",
    "Chris Sununu made a similar announcement, also asking for the removal of \"Russian-made and Russian-branded spirits.\"",
    "Problem is, it's only Russian by name, which is loosely translated as \"capital city\" due to its origins in Moscow.",
    "Vodka imported from Russia has been on the decline for several years, and is down 79% since 2011, DISCUS said.",
    "\"For decades, Stoli Group has supported the marginalized and those at risk of unwarranted aggression.",
    "We stand now with all Ukrainians and Russians calling for peace,\" a company spokesperson said.",
    "For example, some bar owners are protesting the invasion by dumping out Stoli Vodka.",
    "The alcohol company didn't immediately respond to CNN Business' request for comment.",
    "Less than 1% of vodka consumed in the United States is produced in Russia.",
    "The-CNN-Wire\n& 2022 Cable News Network, Inc., a WarnerMedia Company.",
    "Ohio Governor Mike DeWine was more targeted with his announcement.",
    "Smirnoff is another brand being confused as being Russian.",
    "New Hampshire's Gov.",
    "All rights reserved."
  ]
}