{
  "id": 13412,
  "mediaId": 8323,
  "date": "2022-03-15",
  "headline": "Ohio sheriff encourages firearms classes despite new constitutional carry law",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2021/11/GettyImages-471332909.jpg?w=1280",
  "link": "https://fox8.com/news/ohio-sheriff-encourages-firearms-classes-despite-new-constitutional-carry-law/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jen Steer",
  "authorUrl": "https://fox8.com/author/jensteer8/",
  "termIds": [
    2143,
    6474,
    6192,
    6102
  ],
  "sentences": [
    "Under the new law, if a law enforcement officer asks if you are carrying a handgun, you must answer the officer truthfully.”\nWhittaker said his office will continue to provide concealed weapons licenses and reminded residents having a license allows them to carry a concealed handgun in states that have reciprocity agreements with Ohio.",
    "I would also ask that if you are carrying a weapon on you, and find yourself in an interaction with law enforcement, that you voluntarily inform the officer as soon as possible for everyone’s safety.",
    "I will not be sympathetic to criminals who receive the wrong end of the gun when a law abiding citizen is protecting themselves.”\nThere are 22 other states with constitutional carry laws.",
    "“As a supporter of the Second Amendment, I understand the importance of your rights to lawfully possess and carry firearms for personal protection or sporting purposes, if you choose.",
    "I would like to believe that the criminals will think twice about committing crimes in Darke County, given the possibility that more people may be armed to protect themselves.",
    "It makes a concealed weapons permit optional and eliminates the requirement that people quickly notify law enforcement that they’re carrying a concealed weapon.",
    "GREENVILLE, Ohio (WJW)– Darke County Sheriff Mark Whittaker weighed in on Ohio’s new constitutional carry law, which goes into effect on June 13.",
    "I continue to encourage all firearms owners, new or seasoned to consider attending firearms courses for safety and proficiency.",
    "“As your sheriff, and a firearms owner, I am also an advocate of responsible and safe firearms handling.",
    "This law will make it easier for you to exercise this right,” Whittaker said on Facebook on Tuesday.",
    "This right is especially important to our citizens that live in the rural areas of Darke County.",
    "“It remains to be seen what impact the law will have on crime.",
    "Mike DeWine signed Senate Bill 215 on Monday.",
    "He also had a message for criminals.",
    "Ohio Gov."
  ]
}