{
  "id": 13451,
  "mediaId": 8358,
  "date": "2022-03-17",
  "headline": "Chipmaker Intel details $100 million education investment",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2017/12/cropped-web1_Ohio-31-32x32.jpg",
  "link": "https://www.limaohio.com/news/501268/chipmaker-intel-details-100-million-education-investment",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Welsh-Huggins - Associated Press",
  "authorUrl": "",
  "termIds": [
    2594,
    2143,
    1872,
    646,
    6077,
    6474
  ],
  "sentences": [
    "2 semiconductor manufacturer globally, with $73.1 billion in revenue last year, behind South Korean world leader Samsung Electronics with $76 billon, according to market analysis from Gartner Inc.\nCentral Ohio, long known for a largely white-collar workforce in banking and insurance, has added high-tech jobs in recent years, with Amazon, Facebook, and Google all building data centers in the region.",
    "COLUMBUS, Ohio (AP) — Chipmaker Intel said Thursday it will invest $50 million in Ohio higher education initiatives targeting the semiconductor industry, and partner with the U.S. National Science Foundation which is providing an additional $50 million for research grants nationally.",
    "“At Intel, we strongly believe that investing in education is necessary to ensure we have the right talent to support our growth and help the U.S. regain leadership in semiconductor manufacturing,” Christy Pambianchi, Intel executive vice president, said in a statement.",
    "Details of the education funding follow the company’s January announcement that it’s investing $20 billion in semiconductor production in Ohio, an attempt to help alleviate a global shortage of chips powering everything from phones to cars to home appliances.",
    "The $50 million NSF investment will provide $5 million in national grants for 10 years for researchers improving STEM education at two- and four-year universities and advancing research on semiconductor design and manufacturing, according to Intel.",
    "The U.S. share of the worldwide chip manufacturing market has declined from 37% in 1990 to 12% today, according to the Semiconductor Industry Association, and shortages have become a potential risk.",
    "Intel CEO Patrick Gelsinger has said he expects the Ohio site will also supply specialized chips for cars — a priority for U.S. consumers and officials — and other products such as mobile devices.",
    "The two planned factories on a 1,000-acre site in Licking County, just east of Columbus, are expected to create 3,000 company jobs — many of them highly skilled — and 7,000 construction jobs.",
    "The $50 million Ohio investment includes the creation of a semiconductor education and research program across state institutions, the company said.",
    "Construction of two factories, or fabs, is expected to begin this year, with production coming online at the end of 2025.",
    "To win the project, Ohio offered Intel roughly $2 billion in incentives, including a 30-year tax break.",
    "Total investment could top $100 billion over the decade, with six additional factories down the road.",
    "Jon Husted planned to detail the educational funding Thursday in Columbus.",
    "Pambianchi, other Intel executives, and Ohio’s Republican Gov.",
    "It’s the largest private sector investment in Ohio history.",
    "Mike DeWine and Lt. Gov.",
    "Intel is the No."
  ]
}