{
  "id": 13468,
  "mediaId": 8495,
  "date": "2022-03-18",
  "headline": "Ohio State Highway Patrol unveils new Safety Belt Dashboard",
  "image": "https://wktn.com/wp-content/uploads/2022/03/Safety-Belt-Dashboard.png",
  "link": "https://wktn.com/ohio-state-highway-patrol-unveils-new-safety-belt-dashboard",
  "mediaOutlet": "WKTN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2143,
    982,
    6077,
    6474
  ],
  "sentences": [
    "“This new dashboard highlights those who have been saved by wearing a safety belt and raises awareness on the importance of buckling up every time you travel.”\nWearing a safety belt is one of the most important things a motorist can do to prevent life-threatening injuries resulting from a crash.",
    "The new Safety Belt Dashboard is a tool for the public, media, and policymakers to see how important it is for motorists to buckle up – every trip, every time.”\nSince 2017, there have been over 254,000 unbelted crashes in Ohio, with over 2,500 of those crashes resulting in fatalities.",
    "The Safety Belt Dashboard can be viewed at: http://www.SafetyBeltDashboard.ohio.gov\n“One of the easiest and most effective ways for motorists to avoid serious injuries or death in a crash is by wearing their safety belt,” said Ohio Governor Mike DeWine.",
    "The new Safety Belt Dashboard is a part of the Ohio Statistics and Analytics for Traffic Safety (OSTATS), which is a series of internal and public-facing dashboards dedicated to exploration, analysis, and visualization of crash data across Ohio.",
    "COLUMBUS – The Ohio State Highway Patrol released a new dashboard today devoted to safety belt enforcement and education, furthering its emphasis that the use of safety belts by the motoring public continues to be a top priority for troopers.",
    "In addition, an interactive map shows photos of recipients of the Patrol’s “Saved by the Belt” award, which recognizes motorists who avoided life-threatening injuries by making the decision to wear their safety belt.",
    "“Troopers see the devastating results of unbelted crashes firsthand, which is why safety belt usage remains a top concern,” said Colonel Richard S. Fambro, Patrol superintendent.",
    "The Safety Belt Dashboard is a detailed view of unbelted crashes across Ohio, and the important work that troopers around the state are doing to ensure motorists are buckled up.",
    "Users of the public-facing Safety Belt Dashboard have the ability to filter data, find specific county and route statistics and see the life-saving results of buckling up.",
    "Safety belt compliance in Ohio has averaged 84% since 2016, but when compared to the national average of over 90%, troopers know there is much more work to be done.",
    "The interactive map also shows the location and description of the crash, as well as photos of their vehicles.",
    "Motorists are reminded to follow speed limits, always buckle up, and never drive impaired or distracted.",
    "During the same timeframe, troopers have issued over 516,000 safety belt citations.",
    "If you see dangerous driving, safely call #677 to contact a local Patrol post.",
    "“This dashboard furthers the Patrol’s prioritization of saving lives."
  ]
}