{
  "id": 13503,
  "mediaId": 8491,
  "date": "2022-03-15",
  "headline": "Which states have permitless carry gun laws?",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/03/GettyImages-1180393933-1.jpg?w=1280",
  "link": "https://www.wkbn.com/news/national-world/which-states-have-permitless-carry-gun-laws/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Russell Falcon",
  "authorUrl": "https://www.newsnationnow.com/?post_type=profile&p=1811687",
  "termIds": [
    0
  ],
  "sentences": [
    "Currently, the other states with permitless carry laws are Alabama, Alaska, Arizona, Arkansas, Idaho, Iowa, Kansas, Kentucky, Maine, Mississippi, Missouri, Montana, New Hampshire, North Dakota, Oklahoma, South Dakota, Tennessee, Texas, Utah, Vermont, West Virginia and Wyoming.",
    "“Permitless carry,” sometimes referred to as “constitutional carry” by proponents, allows anyone who can legally have a gun to do so without undergoing training or background checks, The Hill explains.",
    "Last year, Miami Police Chief Art Acevedo came out against Texas’ law, saying “responsible gun owners” — including police chiefs, sheriffs and police labor — are opposed to permitless carry.",
    "SB 215 also eliminates a requirement that gun carriers inform police officers of their weapons, though denying having a weapon when an officer asks is still a misdemeanor offense.",
    "Supporters of “constitutional carry” argue that the Second Amendment of the U.S. Constitution grants the right to carry a gun without a permit.",
    "Bills like SB 215 are polarizing among law enforcement officials, some of whom worry it will put their lives in increased danger.",
    "Permitless carry laws aren’t the same as open carry, however, and Ohio’s law requires residents to have concealed carry permits.",
    "A recently passed House bill in Indiana could soon make permitless carry legal there, too, the Cincinnati Enquirer reports.",
    "Mike DeWine signed Senate Bill 215, which will allow residents over the age of 21 to carry firearms without a permit.",
    "Georgia’s House also approved a similar bill last week, and it’s expected to become law pending Republican Gov.",
    "That bill, which would allow residents 18 and older to carry guns without permits, is now awaiting Gov.",
    "Detractors say permitless carry laws will allow people who shouldn’t have guns to get them.",
    "Ohio is the 23rd U.S. state to enact such a measure.",
    "The law goes into effect in three months.",
    "(NEXSTAR) — On Tuesday, Ohio Gov.",
    "Eric Holcomb’s signature.",
    "Brian Kemp’s signature."
  ]
}