{
  "id": 13556,
  "mediaId": 8313,
  "date": "2022-03-18",
  "headline": "Department of Justice allows Ohio to delay sending military, overseas primary ballots",
  "image": "https://www.gannett-cdn.com/presto/2020/11/03/NCOD/59f606a9-b653-4255-b5ab-dca257f550a2-less_levies_ac_07.JPG?crop=4383,2466,x0,y292&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/2022/03/18/ohio-delay-sending-military-overseas-ballots-may-primary/7091962001/",
  "mediaOutlet": "enquirer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    0
  ],
  "sentences": [
    "Ohio reached an agreement with the federal government on Friday to delay sending ballots to military and overseas voters, giving election officials more time to finalize them as a May 3rd primary hangs in the balance.",
    "Haley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "LaRose told DeWine and lawmakers on Thursday that it's impossible to put legislative races on the May 3rd ballot unless a federal court allows Ohio to use previously rejected maps.",
    "LaRose previously said holding two primaries could cost taxpayers an extra $20 million to $25 million, and his office already received $9.2 million to help prepare for May.",
    "\"(The department) made clear that Ohio’s accommodations will be adequate to make sure every overseas Ohioan who wants to cast a ballot will be able to do so,\" LaRose said.",
    "House Democrats argued the changes will disenfranchise military voters, but Secretary of State Frank LaRose said rushed mail will ensure they have enough time to vote.",
    "That could set up a split election if the Legislature decides not to postpone altogether, something GOP leaders have so far been unwilling to do.",
    "Election officials are proceeding with plans to hold a May 3rd primary for statewide, congressional and local races unless otherwise instructed.",
    "\"What we don’t want to do is mail out ballots to overseas military voters that include contests that should not be on that ballot,\" he said.",
    "The Ohio Supreme Court rejected the latest set of legislative maps on Wednesday, essentially dooming any prospect of a full May primary.",
    "He said it's now his responsibility to ensure boards of election are ready for any outcome, including a partial primary on May 3.",
    "Overseas voters will have 10 extra days after the election to return their ballots, as long as they're mailed by election day.",
    "Federal officials granted a waiver for Ohio because of election uncertainty fueled by a chaotic redistricting process.",
    "Federal law typically requires them to go out 30 days before the election, which was a Friday deadline for May 3.",
    "Mike DeWine that allows boards of elections to send overseas ballots as late as April 5 with expedited postage.",
    "The court is expected to rule on a motion requesting a three-judge panel to potentially impose those maps.",
    "LaRose also ordered boards of election not to send any overseas ballots on Friday.",
    "The U.S. Department of Justice approved a plan based on legislation signed by Gov.",
    "\"We are not going to make the mistake of being unprepared,\" LaRose said.",
    "A ruling on new congressional maps is expected any day.",
    "\"We’re not going to assume tomorrow’s a snow day.\""
  ]
}