{
  "id": 136,
  "mediaId": 8496,
  "date": "2022-02-18",
  "headline": "Ohio redistricting maps debate could be decided in federal court",
  "image": "https://media.wkyc.com/assets/WBNS/images/8875df9f-7066-4bb4-9054-9dfe4f4199e2/8875df9f-7066-4bb4-9054-9dfe4f4199e2_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/politics/ohio-redistricting-maps-debate-be-decided-in-federal-court/530-ab21137f-2f88-48da-8b22-fd2f942efe18",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In a ruling Friday night, the court said the commission needs to show cause as to why they should not be held in contempt by Feb 23. at noon\nOn Thursday, a group of Republicans led by Michael Gonidakis of Ohio Right to Life, argues that because the federal court has the power to draw redistricting lines, something the Ohio Supreme Court doesn’t have the power to do, the ultimate decider of this impasse should be at the federal level.",
    "The motion Friday said “In light of the Commission’s repeated failures to enact a constitutionally compliant plan and bald refusal to abide by this Court’s February 7 order, the above-captioned Petitioners respectfully request that the Court order Respondents to show cause why they failed to comply”\nThe motion requests the defendants respond by Feb. 25 by 9 a.m.",
    "“The Second Plan changed five House districts from the Redistricting Commission's First Plan from Republican-leaning to Democratic-leaning and changed three Senate districts from Republican-leaning to Democratic-leaning representing a greater than 6% total increase in the number of Democratic-leaving districts.\"",
    "COLUMBUS, Ohio — The League of Women Voters Friday filed a motion with the Ohio Supreme Court to counter a motion filed Thursday in federal court by a group of Republicans regarding the failure of the Ohio Redistricting Commission to draw a map that would not violate the state constitution.",
    "Three cases filed in federal court by Ohio voters, civil rights organizations and an environmental organization contend that the new state legislative maps enacted by the Ohio Redistricting Commission unfairly give an advantage to Republican voters in violation of the Ohio Constitution.",
    "What remains unclear is if the Ohio Supreme Court will hold members of the redistricting commission in contempt of court for violating its deadline to come up with a legislative map.",
    "“This case is all about gerrymandering which means the politicians are able to draw their districts to give themselves a very good chance of being re-elected,” he said.",
    "Under the state house map, if Republican candidates earned 54% of the statewide vote, they would win a supermajority in Ohio’s House of Representatives.",
    "The Ohio Redistricting Commission, which Governor Mike DeWine is a part of, failed to redraw legislative districts for a third time on Thursday.",
    "The suits allege that the maps intentionally dilute the voting power of Ohio Democrats and minority voters through packing and cracking.",
    "A federal court cannot approve the adoption of a plan that has been rejected by state courts on state constitutional grounds,” he says.",
    "We have an obligation to follow the court order and we have an obligation to produce a map,\" DeWine said on Thursday.",
    "The Ohio Redistricting Commission has failed three times to design maps that don’t violate the state's constitution.",
    "He says while the federal court can decide state issues, he doesn't believe they can in this case.",
    "Steven Steinglass is Dean Emeritus Cleveland State at Cleveland-Marshall College of Law.",
    "The motion states that a federal panel should adopt what’s called the second plan.",
    "“The state courts are the final arbitral as to the meaning of state law.",
    "“I believe we have an obligation to follow the constitution.",
    "Dan Kobil teaches constitutional law at Capital University."
  ]
}