{
  "id": 13747,
  "mediaId": 8278,
  "date": "2022-03-15",
  "headline": "Mahoning Valley Incubators Aid Startups by Minorities, Women",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/03/Stephanie-Gilchrist.jpg",
  "link": "https://businessjournaldaily.com/mahoning-valley-incubators-aid-startups-by-minorities-women/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Lydic",
  "authorUrl": "https://businessjournaldaily.com/author/jlydic/",
  "termIds": [
    0
  ],
  "sentences": [
    "In its report, “Double Jeopardy: COVID-19’s Concentrated Health and Wealth Effects in Black Communities,” published in August 2020, the Fed reported 42% of Black-owned businesses had a “healthy or stable” financial position pre-pandemic, while 58% were “at risk or distressed.” That compares to 73% of White-owned businesses that were healthy or stable, and 27% that were at risk or distressed, according to the report.",
    "“We’re encouraged by what we’ve seen thus far.”\nTo help outreach efforts, Brite appointed four new board members in March – Alexander Fitzsimmons, senior director of ClearPath; Courtney Gerowitz, startup community lead for Amazon Web Services; Jonathan Bridges, managing director of automotive for JobsOhio; and Heather Taylor-Miesle, senior vice president of advocacy and regional conservation at American Rivers.",
    "“This is a class that we’re going to continue throughout the year sporadically,” Gilchrist says, “so we can get as many people in as we can.”\nBrite looks to continue the program with MBAC while encouraging area minority- and women-led startups to make use of its own programming and co-working space, says spokeswoman Jennifer Brindisi.",
    "“We all had the same experiences, regardless of our counties and our cities when it came to the barriers facing African American businesses and women-owned businesses.”\nThe legislation will help to open the door for the MBAC to promote entrepreneurship with new populations in areas like Steubenville and St. Clairsville.",
    "Being privileged enough to be able to have the luxury to start a company and potentially having some sort of financing or even just not being in debt to be able to do that.”\nIn her role, Lyon wants to work with more female and minority founders, which she says are underrepresented among energy startups.",
    "We want to load them with all of the tools that they need to succeed.”\nThis year, Brite is collaborating with United Returning Citizens, the Ohio Environmental Council and Power a Clean Future Ohio to apply for a $200,000 Inclusion Energy Innovation Prize through the U.S. Department of Energy.",
    "So giving that support to them, to work with them to get those skills, and to build up their idea so that they are ready.”\nLyon likens success in the energy sector to playing poker – to win requires a full hand with market, customers, technology and finance.",
    "Applications for certification with the state’s Minority Business Enterprise (MBE), Women Business Enterprise (WBE), and Encouraging Diversity, Growth and Equity (EDGE) programs have been coming in at least five per week “if not more,” she says.",
    "Every startup is at different stages with each card, she says, so the onus is on organizations like Brite to sit down with them, identify where they are struggling and help them acquire the pieces they need, she says.",
    "YOUNGSTOWN, Ohio – Stephanie Gilchrist has her work cut out for her as the offices of the Minority Business Assistance Center in Youngstown are flooded with applications from women-led and minority-owned businesses.",
    "That is a huge part of the equation – to get some of those conversations happening that we need with other organizations like United Returning Citizens and the Ohio Environmental Council,” Brindisi says.",
    "“Especially in the minority community where people feel like there is no hope.”\nIt’s a positive change considering the challenges minority entrepreneurs faced during the last two years.",
    "That’s in addition to the state’s 0% interest microloan program, with a $10,000 minimum and $45,000 maximum, and the Minority Business Direct loan program with a $1.5 million maximum.",
    "Lyon began her position less than two months ago and brings a decade of relevant experience, including running her own business in the energy battery fuel cell space, EcoSpinners.",
    "“Especially with younger entrepreneurs, they never had to meet with a venture firm or business people who may or may not know as much about their specific technology,” Lyon says.",
    "The MBAC, which operates in the Youngstown Business Incubator, serves entrepreneurs in seven counties from Ashtabula County south to Monroe County, says Gilchrist, its director.",
    "From February through April 2020 – the height of the COVID pandemic – Black-owned small businesses dropped by 41%, according to data from the Federal Reserve Bank of New York.",
    "“It’s a beautiful thing.”\nGilchrist testified on behalf of SB 105 last October, joining female business owners and other advocates, including Secretary of State Frank LaRose.",
    "“I was lucky enough to have the opportunity to do what I did,” says Lyon, who holds a bachelor of science in chemical engineering from Case Western Reserve University.",
    "MBAC Create began with 10 participants and will run through the end of this month, after which the MBAC will host a pitch competition with a $500 grand prize.",
    "Now, startups will need just one certification to work in the state, even if they’re serving counties and cities outside their jurisdiction, she says.",
    "While financing is a challenge for minority-owned businesses, area incubators say most startups have difficulty with putting together business plans.",
    "“We’re actively working on our tenants, our workshops [and] encouraging more organizations and business groups to use our space,” Brindisi says.",
    "She founded it in the Cleveland/Akron area in September 2012 and served as president until December 2015, according to her LinkedIn profile.",
    "Brite currently works with 10 customers that are owned, controlled or led by women, nine that are minority-owned and six veteran-owned.",
    "Additionally, Brite’s entrepreneur programs director, Jing Lyon, offers perspective on being an entrepreneur from those populations.",
    "Getting capital to its customers is a goal for the MBAC this year as it focuses heavily on partnering with funders, Gilchrist says.",
    "And when intersecting with other industries, such as the automotive industry, “I was in lots of rooms with all older White guys.",
    "If awarded, the funds would aid the organizations in getting underrepresented populations involved in the clean energy industry.",
    "That’s any type of business, not just energy-based.”\nReaching underrepresented populations has been a challenge, Brindisi says.",
    "Mike DeWine signed Senate Bill 105 into law earlier this month, streamlining the application process for those certifications.",
    "On April 9, the organization will host a business plan workshop from 9 a.m. to 4 p.m. at Brite Energy Innovators in Warren.",
    "The five-week MBAC Create accelerator program, for instance, focuses entirely on building a business model, Gilchrist says.",
    "That compares to a 32% drop in Latino-owned businesses, 26% for Asian-owned businesses, and 17% for White-owned businesses.",
    "During her time working in the energy industry, Lyon was often the only woman and the only minority in the room, she says.",
    "Their diversity “gives voice to a lot of folks that we might not be in touch with all of the time,” Brindisi says.",
    "“Now the women can participate where their services and their products are necessary and needed,” she says.",
    "It will also make collecting and submitting the paperwork for those certifications much simpler, she says.",
    "Typically, the entrepreneurs who are comfortable in seeking funding are already coming out of industry.",
    "In Ohio, active Black-owned businesses dropped 59.3% from 55,175 to 22,464 from February to May 2020.",
    "Pictured at top: Stephanie Gilchrist, MBAC director, gets five applications weekly from startups.",
    "Staff members are working to raise awareness to the resources available to these entrepreneurs.",
    "She recognizes her ability to achieve success goes back to having had the right opportunities.",
    "State loan programs are also driving much of the interest among entrepreneurs, Gilchrist says.",
    "The goal is to get startups the facilities and staffing they need to scale their businesses.",
    "Because now they want that certification.”\nGilchrist expects interest to increase after Gov.",
    "It started back in choosing to go into a degree in STEM, being able to afford that.",
    "“Sometimes it’s digging in and working through whatever the current problem is.",
    "“And we prioritize minority-owned and female-led businesses at our facility.",
    "Finding sources of financing is one of the ways Brite can help, she says.",
    "From May to June, those numbers improved to 35,420, the Fed reports.",
    "That’s an increase of at least 25% since the beginning of the year.",
    "Startups can apply for up to $500,000 in the WBE loan program.",
    "MBAC held a similar workshop in November with 20 participants.",
    "That includes local inquiries and referrals from the state.",
    "“It would allow us to coordinate more community engagement.",
    "“Sometimes it’s just to be a sounding board,” she says.",
    "Copyright 2022 The Business Journal, Youngstown, Ohio.",
    "“Our goal is to get those numbers up,” Brindisi says.",
    "The new members give the board a more national reach.",
    "“It’s all the different puzzle pieces,” she says.",
    "“The growth is beautiful to see,” Gilchrist says.",
    "Winners will be announced near the end of April.",
    "“We’re overloaded right now,” Gilchrist says.",
    "“It doesn’t start with founding a company.",
    "They tend to be white males, she says.",
    "“And it’s always a challenge.",
    "“It was amazing,” she says.",
    "“And it’s beautiful."
  ]
}