{
  "id": 13813,
  "mediaId": 8491,
  "date": "2022-03-15",
  "headline": "What new permitless carry bill means for Ohioans",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2016/02/guns-generic_39767518_ver1.0.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/what-new-permitless-carry-bill-means-for-ohioans/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gerry Ricciutti",
  "authorUrl": "https://www.wkbn.com/author/gerry-ricciutti/",
  "termIds": [
    0
  ],
  "sentences": [
    "AUSTINTOWN, Ohio (WKBN) – Whether by coincidence or not, Ohio’s status as a “constitutional state” will go into effect right around the time some will be deciding how to spend their refund from the IRS.",
    "Experts also say it will be solely the owner’s responsibility to be aware of gun laws in other states and to be sure to follow them if they take their firearm outside of Ohio.",
    "On Monday, Ohio Governor Mike DeWine signed a law doing away with concealed carry permits as well as requirements that gun owners complete firearms safety training.",
    "“In the Mahoning Valley, if you get a stimulus check or a tax refund, people invest in firearms,” said Tom Rinehart with Precision Shooting in Austintown.",
    "But the sheriff worries about the lack of training as well as a requirement for owners to tell police they have a gun in their car.",
    "I have always been a fan of the good guy being able to carry a firearm to protect themselves or to protect others,” Greene said.",
    "Last year, Mahoning County issued more than 2,600 new concealed carry permits and renewed nearly 2,000 more.",
    "I don’t know what that percentage is gonna be,” said Mahoning County Sheriff Jerry Greene.",
    "“It goes over all the legal aspects for concealed carry — what you can do, cannot do.",
    "An officer’s gonna wanna know if there is a gun in the vehicle,” Greene said.",
    "The changes will leave it up to gun owners to get the training on their own.",
    "Rinehart though says his shop will continue offering the course.",
    "Where you can carry, where you can’t carry it,” he said.",
    "“I personally think it’s gonna drop dramatically.",
    "“This is very important for me to say this.",
    "“Obviously, it’s gonna affect the officer."
  ]
}