{
  "id": 1385,
  "mediaId": 8494,
  "date": "2022-02-14",
  "headline": "Commissioners are left waiting for Ohio House Speaker to call next redistricting meeting",
  "image": "https://npr.brightspotcdn.com/dims4/default/37d4712/2147483647/strip/true/crop/2208x1159+0+41/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Fc7%2F85%2F41c1b2fe41ad960f061b8cace7f6%2Fimg-54ddaa61bf19-1.jpeg",
  "link": "https://www.wksu.org/government-politics/2022-02-14/commissioners-are-left-waiting-for-ohio-house-speaker-to-call-next-redistricting-meeting",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow",
  "authorUrl": "https://www.wksu.org/people/andy-chow",
  "termIds": [
    0
  ],
  "sentences": [
    "There's no word yet from Cupp on when the redistricting commission will meet to adopt new state House and Senate district maps, after its second attempt was again found unconstitutional by the Supreme Court.",
    "The commission has until the end of Thursday to adopt a new state House and Senate district map after the previous plan was ruled unconstitutional by the Ohio Supreme Court.",
    "Mike DeWine (R-Ohio), says the governor believes the commission should meet and do all they can to follow the constitution and the recent court decision.",
    "Prentiss Haney, Ohio Organizing Collaborative co-executive director, is among the plaintiffs that challenged those previous maps in court.",
    "The elected officials who are part of the process don't feel accountable to the voters and to the Ohio Constitution,\" Haney said.",
    "The biggest hurdle remains that Ohio’s political geography does not match the proportionality of recent statewide votes.",
    "That being said, the Governor believes the Commission should attempt to comply with the recent order,\" Tierney said.",
    "\"However, Governor DeWine believes significant roadblocks remain to achieving a consensus map.",
    "Haney says the inaction from the commission is an argument for why fair districts are needed.",
    "Recent proposals do not greatly differ from previous maps that had constitutional issues.",
    "\"This particular moment is showing what happens when we have extreme gerrymanders.",
    "The commission has yet to see a map that is both proportional and constitutional.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "Dan Tierney, spokesperson for Gov."
  ]
}