{
  "id": 13880,
  "mediaId": 8497,
  "date": "2022-03-18",
  "headline": "Ohio pauses preparations for May 3 primary amid map flap",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ap22054855076541.jpg?crop=1.00xw:0.823xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-may-primary-redistricting-maps-election/39472857",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Associated Press",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Republican Secretary of State Frank LaRose coupled a directive issued to county election boards Thursday night with a two-page letter to fellow members of the Ohio Redistricting Commission explaining that counties are now “simply out of time” to complete the work necessary to hold elections for state representatives and state senators as scheduled.",
    "\"And the idea that we're going to be able to go out and hire somebody new and have them do this work - and do this work in 10 days - I think presents some very significant challenges.”\nHe declined to join fellow Republicans' attacks on Chief Justice Maureen O'Connor, a GOP moderate who has joined court Democrats in invalidating the maps.",
    "He said he is urging fellow members of the commission to pass a resolution requiring the three top mapmakers - one for Senate Republicans, one for House Republicans and one working jointly for the Democratic caucuses - to get in a room and draw new, constitutionally compliant maps.",
    "He accused the Biden administration of intentionally delaying census results on which maps are built, deep-pocketed “out of state special interests” for a time-eating litigation strategy and the high court's bipartisan majority for dawdling in its deliberations.",
    "The agency attributed a monthslong delay to difficulties presented by the global coronavirus pandemic in conducting the head count, which mostly took place in 2020 - during the presidency of Republican Donald Trump.",
    "COLUMBUS, Ohio —\nOhio's top elections official is pausing certain preparations for the May 3 primary in the face of a third court decision invalidating GOP-drawn maps of new legislative districts.",
    "LaRose said that decision now must come from either the Legislature or “immediate action of a federal court.”\nLaRose blasted national Democrats and the Ohio Supreme Court for the predicament.",
    "In its decision Wednesday night, the Supreme Court ruled the third set of legislative maps remains gerrymandered in favor of Republicans, in violation of the state Constitution.",
    "The Ohio Redistricting Commission neither issued a public statement, scheduled a meeting nor hinted at a timeline for addressing its latest court-imposed deadline.",
    "The U.S. Census Bureau was supposed to deliver new population tallies to states last spring, kicking off the once-per-decade redrawing of political boundaries.",
    "“Regardless, we've never let up in the effort to make a complete May 3 primary election a success, and I'm confident we're prepared to do that,” he wrote.",
    "His order prohibits counties from altering or sending ballots until further notice and pauses reprogramming of voter registration and tabulating systems.",
    "It instructs boards to continue recruiting poll workers, advertising voter registration information and conducting other tasks unrelated to the maps.",
    "As has been standard following each successive court rebuke, a mad scramble ensued behind the scenes while official action was nil.",
    "The court gave the Republican-dominated Redistricting Commission until March 28 to remedy the situation.",
    "“There are other options, but the Supreme Court has only given 10 days to do this,” he said.",
    "The secretary of state does not have the power to change Ohio's primary election date.",
    "Mike DeWine told reporters Thursday he was “taking the lead” in resolving the issue.",
    "Good Housekeeping",
    "Republican Gov."
  ]
}