{
  "id": 1394,
  "mediaId": 2919,
  "date": "2022-02-18",
  "headline": "The Ohio State Fair returns this summer, July 27-Aug. 7",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/4d49e1c/2147483647/strip/true/crop/4928x2587+0+346/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F48%2Fde%2F46171d8d4403b16bce076720d1db%2Fcute-little-girl-enjoing-time-at-fun-fair-chain-swing-ride-amusement-park-in-summer-re-sbi-305226220.jpg",
  "link": "https://www.news5cleveland.com/news/state/the-ohio-state-fair-returns-this-summer-july-27-aug-7",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kaylyn Hlavaty",
  "authorUrl": "https://www.news5cleveland.com/kaylyn-hlavaty",
  "termIds": [
    0
  ],
  "sentences": [
    "We have experienced so many remarkable moments with our children and grandchildren at fairs over the years, and this summer, we can’t wait to enjoy the Ohio State Fair once again.”\nThe big-name acts headlining this year’s fair will be announced on March 7, with additional announcements to follow on March 21 and April 4.",
    "All the fair favorites that attendees have come to love and look forward to will return, including the butter cow sculpture, Smokey the Bear and livestock competitions.",
    "In 2019, 934,925 attended the 12-day festival, with attendees coming from all of Ohio’s 88 counties, all 50 states, the District of Columbia and Mexico and Canada.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "It’s a place where we can all celebrate our great state and make memories that will last a lifetime,” said Governor Mike DeWine.",
    "COLUMBUS, Ohio — The Ohio State Fair, a summer favorite among Ohioans, is returning to full capacity from July 27 until Aug. 7.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "Last year’s fair was closed to the general public due to the coronavirus pandemic.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "“Fran and I absolutely love fairs, none more than the Ohio State Fair.",
    "Download now on your Apple device here, and your Android device here.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "The 2021 fair was open to a limited number of guests.",
    "“The Ohio State Fair brings people together.",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "More details can be found here.",
    "General parking is free."
  ]
}