{
  "id": 13953,
  "mediaId": 8498,
  "date": "2022-03-21",
  "headline": "Athens-area gun activists and city officials react to Ohio’s new permitless concealed carry gun law",
  "image": "https://woub.org/wp-content/uploads/2022/03/lepof_featured_image_3-21.jpg",
  "link": "https://woub.org/2022/03/21/athens-area-gun-activists-and-city-officials-react-to-ohios-new-gun-law/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lexi Lepof",
  "authorUrl": "https://woub.org/post_author_new/lexi-lepof/",
  "termIds": [
    0
  ],
  "sentences": [
    "This allows someone to not have to go through any level training and have a firearm in their pocket.”\nOpponents said they are concerned for police officers\nThe new legislation also drew concern from Ohio law enforcement agencies because it removes the requirement for gun owners to inform police officers they are carrying – unless they are specifically asked.",
    "EPA Science Panel Considering Guidelines That Upend Basic Air Pollution Science Walmart Chief Responds To Furor Over Treatment Of Greeters With Disabilities Charges Dropped Against Woman in Rhoden Family Killing Case Rural Women Have Started and Led Monumental Women’s Movements",
    "0+1\n0Like\n0Share\n< < Back to\nATHENS, Ohio (WOUB) – Jim Salzman, a board member of Hilltop Gun Club, is just one example of second amendment activists who think Ohio’s new gun legislation goes too far.",
    "“At this point, the best we can do is to continue to advocate for change; be vocal, either through phone calls to the governor’s office or writing letters and voice your concern,” he said.",
    "Patterson said he is going to work with the Athens Area Chamber of Commerce to make local business owners aware that they have the right to prohibit concealed-carry in their stores.",
    "“I think it will be not necessarily an increase in gun violence, but an increase on complaints for people carrying a [concealed carry weapon] where it is prohibited,” he said.",
    "“I was raised on a farm and taught how to safely use firearms as a young boy, and my time in Air Force, we were well trained on how to use firearms, but this is different.",
    "City officials address concerns in Athens\nPyle said he does not think gun violence will increase in Athens, but thinks there may be an increase in related violations.",
    "Mike DeWine signed Senate Bill 215 into law allowing Ohioans to carry concealed guns without a permit – which eliminates mandatory training and background checks.",
    "“If you don’t train, you have a greater likelihood, I think, of finding yourself in a situation where you make a mistake and somebody gets hurt,” Salzman said.",
    "Pyle said an example of this violation would be someone carrying a concealed weapon onto campus or into a business where it is clearly posted as prohibited.",
    "“For a legislature who talks about how pro-police they are, to do something like this, amid the outcry from them, I think it is unconscionable,” he said.",
    "“I think it is careless, but it is the best we can do at this point because it has been penned into law.”\nThe new law is set to go into effect June 12.",
    "“The fact that somebody can go out and buy a gun, and they get to carry it around and no one knows if they have it or not, it frightens me,” he said.",
    "“We will definitely be having an open and frank conversation on what people can and can’t do when it comes to this new law,” he said.",
    "While Salzman and Hilltop said they believe in the right to carry, they said proper training and gun safety is essential.",
    "Through the Ohio Association of Chiefs of Police, Athens City Chief of Police Tom Pyle lobbied against the bill.",
    "Ohio is the twenty-third state to allow gun owners to legally carry a concealed gun without a permit.",
    "“I am disappointed because I think it has the opportunity to be an officer-safety issue,” Pyle said.",
    "Salzman said this legislation is not in keeping with lawmakers’ rhetoric on supporting the police.",
    "Athens City Mayor Steve Patterson also expressed his displeasure with the no-training requirement.",
    "Many police officers and organizations across Ohio advocated to maintain the duty to disclose.",
    "Patterson said he empathizes with Athens residents who are feeling fearful about the new law.",
    "It took Salzman many hours of training until he felt completely comfortable to carry.",
    "“I was not happy when the training went down from 12 hours to eight hours,” he said.",
    "He said he can not imagine how anyone could carry without the training.",
    "“You spend more time learning how to drive a car than that,” he said.",
    "He was in his fifties when he shot a gun for the first time.",
    "Salzman did not become a gun owner until later in his life.",
    "“You know, second amendment, I get it,” he said.",
    "Ohio Gov."
  ]
}