{
  "id": 14157,
  "mediaId": 8354,
  "date": "2022-03-17",
  "headline": "Sheriff's office will still issue concealed carry permits despite new law",
  "image": "https://www.gannett-cdn.com/-mm-/839a7d6fd10d4eee47d409629d76a5330934598e/c=0-289-2000-1414/local/-/media/Bucyrus/2014/12/03/B9315362760Z.1_20141203181846_000_G629ADLT5.1-0.jpg?width=2000&height=1125&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.lancastereaglegazette.com/story/news/2022/03/17/sheriffs-office-still-give-concealed-carry-permits-despite-new-law/7047508001/",
  "mediaOutlet": "lancastereaglegazette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Barron",
  "authorUrl": "https://www.lancastereaglegazette.com/staff/4395684002/jeff-barron/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"And then other folks that have plans to travel will need to have the CCW permit for the reciprocity feature that is honored by the states that are in that reciprocity agreement.\"",
    "\"Whether you're going through the CCW permit process or you're planning on carrying a weapon, there's a degree of responsibility,\" Lape said.",
    "LANCASTER — The Fairfield County Sheriff's Office has granted about 30,000 concealed carry handgun permits since 2004.",
    "The new law takes effect in 90 days from the signing and also eliminates mandated firearms training to conceal carry.",
    "The reciprocity agreement is one that some states honor an Ohio resident's right to carry concealed in their state.",
    "While the new law will no longer require gun training, Lape said there is some merit to still receiving training.",
    "Therefore, Lape said gun owners should check with the states they are traveling through to see if they do.",
    "\"It's a huge responsibility that somebody would be taking on to exercise that right under the new law.",
    "Additionally, drivers do not have to tell a police officer they have a weapon unless the officer asks.",
    "Lape said his office will still issue concealed-carry permits for those who want them, though.",
    "He said such gun owners will probably determine how many permit applications his office gets.",
    "He said for a lot of people, the new law is a move in the right direction in their viewpoint.",
    "\"When CCW was new there was a period of time for everybody to get acclimated to the change.",
    "Currently, drivers must immediately inform the officer if they have a weapon with them.",
    "\"Some people will want it just to go through the requisite training,\" he said.",
    "So I'm sure we'll go through the same type of process with this as well.\"",
    "\"But at this point, we really don't know what that effect will be.\"",
    "Mike DeWine on Monday signed a law that makes the permits optional.",
    "Not all states have a reciprocity agreement with Ohio, however.",
    "It would be in their best interest to get some familiarity.\"",
    "\"I'm sure it will have some effect,\" Sheriff Alex Lape said.",
    "But the department could issue fewer permits after Gov.",
    "jbarron@gannett.com\n740-304-9296\nTwitter: @JeffDBarron",
    "\"It's like anything new,\" Lape said."
  ]
}