{
  "id": 14194,
  "mediaId": 8455,
  "date": "2022-03-17",
  "headline": "Chipmaker Intel details Ohio education investment",
  "image": "https://www.toledoblade.com/image/2022/01/29/600x_q90_a4-3_cTCjpg/Intel-Plant-Ohio-17.jpg",
  "link": "https://www.toledoblade.com/business/development/2022/03/17/chipmaker-intel-details-100-million-education-investment/stories/20220317107",
  "mediaOutlet": "The Toledo Blade",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "",
  "termIds": [
    2594,
    646,
    316,
    1193,
    6077,
    6474,
    6310
  ],
  "sentences": [
    "2 semiconductor manufacturer globally, with $73.1 billion in revenue last year, behind South Korean world leader Samsung Electronics with $76 billon, according to market analysis from Gartner Inc.\nCentral Ohio, long known for a largely white-collar workforce in banking and insurance, has added high-tech jobs in recent years, with Amazon, Facebook, and Google all building data centers in the region.",
    "“We are today making a substantive investment to help catapult the U.S. back to a leading position not only in invention, innovation, manufacture and production, but also the generation of that future workforce that we all want,” she said during an event at Columbus State Community College.",
    "The $50 million NSF match investment will provide $5 million in national grants for 10 years for researchers improving STEM education at two- and four-year universities and advancing research on semiconductor design and manufacturing, according to Intel.",
    "About 40% of those 3,000 jobs will involve people with associate's degrees taking technicians' jobs to run the operation, Keyvan Esfarjani, Intel's manufacturing, supply chain and operations executive vice president, said Thursday.",
    "Intel's $50 million investment in Ohio includes the creation of a semiconductor education and research program across state institutions, including the expansion and diversification of STEM education, the company said.",
    "COLUMBUS — Chipmaker Intel on Thursday outlined $150 million in educational funding aimed at growing the workforce for the semiconductor industry, as part of its $20 billion investment in a production hub in Ohio.",
    "The U.S. share of the worldwide chip manufacturing market has declined from 37% in 1990 to 12% today, according to the Semiconductor Industry Association, and shortages have become a potential risk.",
    "Intel CEO Patrick Gelsinger has said he expects the Ohio site will also supply specialized chips for cars — a priority for U.S. consumers and officials — and other products such as mobile devices.",
    "The two planned factories on a 1,000-acre site in Licking County, just east of Columbus, are expected to create 3,000 company jobs — many of them highly skilled — and 7,000 construction jobs.",
    "Similarly, an additional $50 million investment by the company will support the development of two- and four-year college semiconductor research curriculums and programs nationally.",
    "The investments spelled out Thursday are an effort to help address that manufacturing disparity, said Christy Pambianchi, Intel executive vice president and chief people officer.",
    "The company announced the Ohio development in January, part of Intel's efforts to alleviate a global shortage of chips powering everything from phones to cars to home appliances.",
    "Not only do they pay more, \"they’re more secure because so much of the economy is going to be built around STEM jobs,” he said.",
    "Construction of two factories, or fabs, is expected to begin this year, with production coming online at the end of 2025.",
    "To win the project, Ohio offered Intel roughly $2 billion in incentives, including a 30-year tax break.",
    "Total investment could top $100 billion over the decade, with six additional factories down the road.",
    "People filling the remaining jobs will have degrees from a bachelor's up to a PhD, Esfarjani said.",
    "The company is also committed to hiring as diverse a workforce as possible, he said.",
    "Boosting STEM education is key to future job growth, said Lt. Gov.",
    "It's the largest private sector investment in Ohio history.",
    "First Published March 17, 2022, 4:18am",
    "Intel is the No.",
    "Jon Husted."
  ]
}