{
  "id": 1523,
  "mediaId": 8473,
  "date": "2022-02-18",
  "headline": "Group of GOP voters sue to force Ohio legislative map fix",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/news/latest-news/2022/02/group-of-gop-voters-sue-to-force-ohio-legislative-map-fix/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "COLUMBUS (AP) — The stalemate over redrawing state legislative maps in the face of a court-set deadline is depriving voters of the rights to know their voting districts and interact with candidates ahead of elections, a group of Republican voters said today in a federal lawsuit seeking to force the implementation of a new set of maps.",
    "“The Commission made no apparent effort whatsoever to adopt any plan, and did so without providing any explanation for its noncompliance with the Court’s order,” the organization said, referring to the Supreme Court’s Feb. 7 directive to the commission to try again.",
    "The federal lawsuit was filed one day after Republicans on the Redistricting Commission stopped work without a solution, saying they saw no path forward that would both comply with orders from the state Supreme Court and meet state Constitutional requirements.",
    "In a separate complaint, the League of Women Voters of Ohio today asked the Ohio Supreme Court to force the Republican-dominated Ohio Redistricting Commission to explain why it declared an impasse a day earlier.",
    "“Unfortunately, as a practical matter, it would appear — at least at this point — that this body is at an impasse,” said Secretary of State Frank LaRose, one of five Republicans on the commission.",
    "The uncertainty also restricts voters “ability to assess candidate positions and qualifications, advocate for candidates, and associate with like-minded voters,” according to the lawsuit.",
    "11:20 a.m.: Warren to face suit over Summit dam dangers\nWARREN -- The family of Lisa Zitello will file a lawsuit against the city of Warren over the lack of adequate ...\nTue.",
    "LaRose and other Republicans said the party’s expert mapmakers simply could not find a way to draw constitutional maps that met all the Ohio Supreme Court’s requirements.",
    "State Sen. Vernon Sykes, a Democrat and Redistricting Commission co-chair, criticized Republicans for what he said was a dereliction of duty as the state’s ruling party.",
    "The Democratic maps would have delivered approximately 45% of legislative seats to their party and 54% to the GOP, which roughly matches Ohio’s political breakdown.",
    "Maps drawn by Democrats that their designers said were constitutional went down to defeat Thursday in a party-line vote shortly before the deadlock was declared.",
    "10:27 a.m.: Todd Rundgren announced for both Robins, Packard\nWARREN — Todd Rundgren will be making two appearances in Warren five weeks apart.",
    "The Ohio Supreme Court rejected those maps earlier this month, saying they remained gerrymandered in favor of Republicans.",
    "LaRose has said the state is now precariously close to violating federal and state laws for carrying out the election.",
    "“There’s no role for the federal court here.”\nNEWSLETTER\nToday's breaking news and more in your inbox\nLatest News\nTue.",
    "The lawsuit requested that a three-judge panel force the implementation of House and Senate maps approved Jan. 22.",
    "Unnecessary uncertainty about the 2022 election harms candidates’ abilities to run for office, the lawsuit said.",
    "11:15 a.m.: State awards $3.4M toward St. Joseph Riverside demo\nWARREN Ohio Governor Mike DeWine and Lt.",
    "“The Ohio Supreme Court has jurisdiction over the drawing of Ohio General Assembly maps,” Miller said.",
    "“This blatant disregard of this Court’s mandate requires an immediate explanation,” the League said.",
    "The League of Women Voters noted DeWine’s comment in its complaint to the state Supreme Court.",
    "The stalemate raises questions for the fate of Ohio’s primary, still scheduled for May 3.",
    "Mike DeWine, a commission member, said Thursday it was a mistake to declare an impasse.",
    "Governor Jon Husted today awarded more than $60 million in funding to ...\nTue.",
    "In an interview, League director Jen Miller criticized the federal lawsuit.",
    "Tickets will go on sale ...",
    "Republican Gov."
  ]
}