{
  "id": 15360,
  "mediaId": 8358,
  "date": "2022-03-10",
  "headline": "Cross’ HB-430 passes house",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/03/web1_E295D7BE-61D9-465E-BA93-AC26F09762E7_ne202238182253588.jpeg",
  "link": "https://www.limaohio.com/news/500331/cross-hb-430-passes-house",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Keeping an eye toward protecting all parties as the construction season approaches, Cross said of HB 430, “This legislation seeks to create a safety dialogue between property developers and hazardous liquids or interstate gas pipeline operators when new land use or property development is planned near a transmission pipeline.”\nAlong with the notification requirements, House Bill 430 will also designate April as Ohio Work Zone Safety Awareness Month.",
    "Current law requires that in the case of interstate hazardous liquid pipelines or interstate gas pipelines, the owner or operator of a utility must provide written notice to the developer or designer of any special notification requirements.",
    "Having the bill passed in the house and sent to the senate now could be an important piece of the legislation as the calendar moves closer to the spring season — a time when projects typically ramp up as the weather turns warm and dry.",
    "If a development will take place inside this prescribed radius, the owner of the pipeline will be required to provide specific information to the public authority that is constructing the public improvement project.",
    "While Cross is the bill’s primary sponsor, the bipartisan bill had 17 Republican and 7 Democratic co-sponsors and was passed through the House with 91 “yeas” and zero “nay” votes on March 2.",
    "HB 430 would lay out certain requirements developers must follow when project construction and/or public improvements are located near an interstate transmission pipeline.",
    "By Joe Gilroy - jgilroy@limanews.com\nCOLUMBUS — A bill sponsored by Ohio Rep. Jon Cross, R-Kenton, has passed through the House and is now headed to the Senate.",
    "Cross’ House Bill 430 sets out to improve public safety and the efficiency of communications between project developers and local utilities companies.",
    "The bill would designate that required notifications must be made within a 660-foot radius that surrounds the center point of any nearby pipeline.",
    "“This bill is pro-business, pro-safety and pro-development and will help to improve Ohio’s infrastructure and economy,” Cross stated.",
    "A DeWine veto can be overruled by a three-fifths vote in both the House and Senate chambers of state congress.",
    "Cross explained that the bill effectively takes care of the interests of all parties involved.",
    "Reach Joe Gilroy at 567-242-0398 or on Twitter @TLNJoeGilroy\nPrevious",
    "Mike DeWine (R) to either sign the bill into law or veto it.",
    "The bill now moves to the Ohio Senate Chamber for passage.",
    "If passed in the Senate it will then be passed onto Gov."
  ]
}