{
  "id": 15389,
  "mediaId": 8497,
  "date": "2022-03-07",
  "headline": "Ohio State Fair announces all-star lineup with Toby Keith, Nelly and more",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/rides-giant-slide-7-1645216742.jpg?crop=1.00xw:0.848xh;0,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/ohio-state-fair-toby-keith-nelly-gabriel-fluffy-iglesias/39353920",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WLWT Digital Staff",
  "authorUrl": "",
  "termIds": [
    5087,
    5364,
    4324,
    1813,
    1982,
    981,
    6077
  ],
  "sentences": [
    "We have experienced so many remarkable moments with our children and grandchildren at fairs over the years, and this summer, we can’t wait to enjoy the Ohio State Fair once again.”\nTickets are $10 for adults (ages 13-59), $8 for youth (ages 6-12), $8 for seniors (ages 60+) and tickets are free for children under 5 years old.",
    "Then in 2021, the state fair was closed to the public while it remained open for agricultural and educational competitions for exhibitors, their families and guests.",
    "Toby Keith will perform Thursday, Nelly will perform Saturday, Zach Williams will perform Monday and Gabriel Iglesias will perform Wednesday.",
    "There will be food, fun games, thrilling rides, educational activities, friendly competitions, concerts agriculture and more this year.",
    "COLUMBUS, Ohio —\nThe Ohio State Fair is returning this year and it just announced an all-star concert lineup.",
    "You can sign up for the Ohio State Fair newsletter to be the first to know about the concert announcements.",
    "It’s a place where we can all celebrate our great state and make memories that will last a lifetime,” Gov.",
    "After two years of a hiatus, the Ohio State Fair is returning to full capacity this summer.",
    "Performers include Toby Keith, Nelly, Zach Williams and Gabriel \"Fluffy\" Iglesias.",
    "The Ohio State Fair plans to follow state and local protocols regarding COVID-19.",
    "As an added bonus, general parking is now free for all fairgoers any day.",
    "“Fran and I absolutely love fairs, none more than the Ohio State Fair.",
    "The 2020 Ohio State Fair was canceled amid the COVID-19 pandemic.",
    "Additional announcements will be held on March 21 and April 4.",
    "The 2022 Ohio State Fair will be held from July 27 to Aug. 7.",
    "“The Ohio State Fair brings people together.",
    "The first four acts have been announced.",
    "Tickets go on sale Friday.",
    "Click here to learn more.",
    "Mike DeWine said."
  ]
}