{
  "id": 15563,
  "mediaId": 8358,
  "date": "2022-03-12",
  "headline": "$650M to support child care centers in Ohio",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2017/12/cropped-web1_Ohio-31-32x32.jpg",
  "link": "https://www.limaohio.com/news/500787/650m-to-support-child-care-centers-in-ohio",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“The funding that will be forthcoming will hopefully help providers to regain stability, hire and retain professional staff, and continue to offer the highest quality of care possible.”\nThe grants are available for child care centers regulated by the Ohio Department of Job and Family Services; family child care type A and B homes; in-home aides; approved day camps, and preschool or school-age programs licensed by the Ohio Department of Education that are approved to provide publicly funded child care.",
    "“We know that the pandemic has disproportionately affected many of these families.”\nIn March 2021 DeWine — who served in the U.S. House from 1983 to 1991, and the U.S. Senate from 1995 to 2007 — said he would’ve voted against the stimulus package.",
    "“Throughout the pandemic and still to this day, these early care and education professionals served families and children in their care, often at risk to themselves, and frequently with great financial difficulty,” she said.",
    "Stabilization grants such as the funding DeWine announced helps child care centers cover gaps caused by the pandemic, but resources remain inadequate and jobs in child care are often low paid and stressful, she said.",
    "— Access development, such as expanding or reopening classrooms to serve more children or those with special needs; new equipment; addressing learning gaps and providing for social-emotional needs.",
    "Child care executive Karen Lampe said the one-time funding will help providers keep supporting working families, and give children the best care and education in preparation for future success.",
    "The Ohio Association of Child Care Providers, along with the state’s Child Care Resource and Referral system, has been helping the state’s providers apply for the grants, Lampe said.",
    "She hopes the last two years have proven to the public that child care is part of critical infrastructure, and needs to be supported with consistent long-term funding, she said.",
    "In 2021, the poverty line for an Ohio family of three was $21,960, meaning the new income cutoff for a child care subsidy would be $31,403 for a three-person household.",
    "Gina Ginn, CEO of Columbus Early Learning Centers, gave DeWine a tour while describing the multitude of programs offered there, many of which are funded by grants.",
    "This can include building maintenance and renovation, sanitizing and protective equipment, accessibility for the disabled, and paying employee wages and benefits.",
    "11—Ohio’s child care centers will be eligible for $650 million in grants to assist and stabilize them amid the lingering financial pressures of the pandemic.",
    "— Workforce recruitment and retention, including pay and benefits, bonuses or hazard pay, background checks, training and arranging for substitutes.",
    "The $800 million in total childcare funding comes from the American Rescue Plan, the $1.9 trillion federal stimulus package approved in early 2021.",
    "On Friday, DeWine said he had criticized “some of the programs” in the ARPA, but wasn’t sure he’d criticized child care funding specifically.",
    "Ohio has more than 6,000 licensed child care providers, said Matt Damschroder, director of the state Department of Job and Family Services.",
    "The eligibility threshold for child care subsidies also has increased from 130% to 142% of the federal poverty line, Damschroder said.",
    "Lampe said CWCC received grants for operating costs, workforce and child care access from the previous $150 million round of funding.",
    "“Research has shown us over and over how important high-quality child care is, especially for our most at-risk children.,” she said.",
    "The new, larger grant pool will help child care providers stay in operation and provide high-quality programming, Lampe said.",
    "The grants will be available for four categories of use: — Operating costs, or new costs related to the COVID-19 pandemic.",
    "The center was vital in helping her overcome homelessness and get through a period of medical disability, Hardy said.",
    "Child care centers have been islands of stability for children throughout the disruption caused by COVID-19, Gov.",
    "Ginn introduced Tashauna Hardy, who said two of her three children attend Columbus Early Learning Centers.",
    "Now she works there as a teacher, which enabled her to provide for her family throughout the pandemic.",
    "That was of “immeasurable” help in offsetting inflation and rising wage costs, she said.",
    "As governor, his job is to make the best use of available funding, DeWine said.",
    "Now it’s essential to help those centers stay open and attract staff, he said.",
    "This new round of grants is in addition to $150 million announced in December.",
    "“Each day the demand for child care resources is increasing,” Ginn said.",
    "A majority of OACCP members offer publicly funded child care, she said.",
    "— Mental health support for child care workers and for families.",
    "About half of CWCC’s clients receive subsidized care.",
    "Detailed information is available at www.occrra.org.",
    "It passed Congress without any Republican support.",
    "About $60 million of that has been distributed.",
    "They also freed up parents to go to work.",
    "Mike DeWine said Friday.",
    "Previous",
    "Mar."
  ]
}