{
  "id": 15619,
  "mediaId": 8480,
  "date": "2022-03-11",
  "headline": "Miami Valley child care centers grateful for additional funding",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/child-care-centers.jpg?w=1280",
  "link": "https://www.wdtn.com/news/miami-valley-child-care-centers-grateful-for-additional-funding/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Riley Phillips",
  "authorUrl": "https://www.wdtn.com/author/riley-phillips/",
  "termIds": [
    0
  ],
  "sentences": [
    "The money will help with things like new operating costs caused by the pandemic, recruiting and retaining care givers, expanding access to more classrooms and equipment, as well as supporting the mental health and well being of staff and children.",
    "“The most pressing need is the increasing funds for teachers now and in the future, and we hope the state and the federal government continue to invest in our children and our families in the workforce,” Purvis said.",
    "“The hope is for these grants to help providers keep these doors open, retain and attract teachers, and continue providing essential care for working families and provide excellent care for these children,” Gov.",
    "“The last two years have been really difficult as far as decreasing the children in the classroom and also coming out of the pandemic and keeping quality staff,” Purvis said.",
    "“In order to properly change an infant, we utilize a barrier on our hands, we utilize gloves, and the price of just gloves quadrupled.",
    "Combined with the $150 million announced in December 2021, the state is providing a total of $800 million for child care centers.",
    "“Times are tough and though we’re here to serve the community, we do have a hole to fill in, in terms of business structure.",
    "Loren Nelson, director of operations for Victorum Learning Center, said the cost of supplies increased dramatically.",
    "So when you’re changing a child at least every two hours with two gloves, the cost just skyrocketed,” Nelson said.",
    "DAYTON, Ohio (WDTN) – Child care centers across the Miami Valley were hit hard during the COVID-19 pandemic.",
    "At Rainbow Years, preschool teacher Heather Purvis said these last two years proved to be a challenge.",
    "So having any sort of extra funding is going to be a boom for us local businesses,” Nelson said.",
    "An additional $650 million in grant money is being provided from the American Rescue Plan.",
    "While this extra money is welcome news, Purvis knows their work is never finished.",
    "Mike DeWine announced additional funding for child care centers across Ohio.",
    "Nelson said this money will be beneficial to the learning center.",
    "However, more relief is on the way.",
    "DeWine said.",
    "Gov."
  ]
}