{
  "id": 15632,
  "mediaId": 8323,
  "date": "2022-03-11",
  "headline": "Ohio lawmakers pushing for DeWine to temporarily remove gas tax",
  "image": "https://fox8.com/wp-content/uploads/sites/12/2022/03/F4074BC121B963A680C8A4B185B261C5_3.jpg?w=1280",
  "link": "https://fox8.com/news/ohio-lawmakers-pushing-for-dewine-to-temporarily-remove-gas-tax/",
  "mediaOutlet": "fox8.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Suzanne Stratford",
  "authorUrl": "https://fox8.com/author/suzannestratford/",
  "termIds": [
    0
  ],
  "sentences": [
    "“You know that extra dime per gallon, I understand it matters, but I think it would be a mistake to do that because ODOT would not be able to provide repairing of the roads as well, all the projects under track would be in jeopardy,” DeWine said.",
    "CLEVELAND (WJW) – As gas prices continue to soar to record highs across the nation and here in Northeast Ohio, some state lawmakers are pushing Governor Mike DeWine to remove a gas tax.",
    "The tax increase was added in 2019 to help repair the state’s deteriorating infrastructure and amounts to 10.5 cents per gallon of gasoline and 19 cents per gallon on diesel fuel.",
    "“We just had an infrastructure bill so that money’s going to be coming to Ohio, so I would say help the people out and drop it for a little while,” said James Spithas in Lakewood.",
    "He also disputes reports that the state will be receiving over $11 billion over the next five years from the federal government as part of the infrastructure bill.",
    "“The extra money we’re getting from the federal government, I’m told by ODOT, will amount to about a billion and a half over a five-year period,” said DeWine.",
    "According to AAA, the national average climbed to $4.33 per gallon Friday and locally FOX 8 found prices as high as $4.19 per gallon in Cuyahoga County.",
    "So while those numbers are sorted out and the bill works its way through the state legislature, drivers are left to deal with the skyrocketing prices.",
    "The gas tax generates well over a billion dollars annually and the governor says half the money would come out of townships, counties and cities.",
    "On Friday, Governor Mike DeWine said that he is currently reviewing the legislation, but his initial response is that it would be a mistake.",
    "277 would temporarily suspend the tax for 5 years, as well as additional registration taxes on electric and hybrid vehicles.",
    "I mean, I drive a pretty fuel efficient car which helps a lot but I hope they go down,” said Taylor Boutcher.",
    "I own a yoga studio so I don’t make a ton of money,” said Evan Scharfeld, from Cultivate Yoga Space.",
    "“Even now when I’m driving back and forth to the studio, I think a little bit more about it.”",
    "“So they would be hurt as well,” said DeWine.",
    "“I think that they’re really expensive.",
    "“It’s definitely affecting my life.",
    "Senate Bill No."
  ]
}