{
  "id": 15651,
  "mediaId": 8494,
  "date": "2022-03-09",
  "headline": "Morning Headlines: Mask mandate lifted in Cleveland schools; Ohio prepares for Ukrainian refugees",
  "image": "https://npr.brightspotcdn.com/dims4/default/8ed9285/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9f%2F27%2F334653ac4e5fbecf86efaa7bfa54%2Fshutterstock-550302502.jpg",
  "link": "https://www.wksu.org/2022-03-09/morning-headlines-mask-mandate-lifted-in-cleveland-schools-ohio-prepares-for-ukrainian-refugees",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Wednesday, March 9:\nMask mandate lifted in Cleveland schools\nOhio prepares for Ukrainian refugees\nLawmakers rush to extend overseas absentee ballots deadline\nErosion shuts down some Cuyahoga Valley Scenic Railroad runs\nCAK adds more flights\nMask mandate lifted in Cleveland schools\n(WKSU) -- The Cleveland Metropolitan School District has decided to drop its mask mandate.",
    "Erosion shuts down some Cuyahoga Valley Scenic Railroad runs\n(Beacon Journal) -- Significant erosion along the Cuyahoga River has prompted the Cuyahoga Valley Scenic Railroad to cancel all runs on its scenic route through the National Park through May 1.",
    "Ohio Job and Family Services has a refugee program that works with local agencies to provide capacity information to the federal government and also helps refugees with economic and social adjustments upon arrival.",
    "Lawmakers rush to extend overseas absentee ballots deadline\n(AP) — Ohio lawmakers are rushing to extend the deadline for the return of overseas absentee ballots as debate over new state legislative maps continues.",
    "Ohio prepares for Ukrainian refugees\n(Ideastream Public Media) -- State agencies and organizations will start planning to assist Ukrainian refugees at a summit in Northeast Ohio next week.",
    "The Beacon Journal reports the railway is halting passenger service to and from Akron Northside Station and Peninsula Depot as well as stops for hikers, bicyclists, and kayakers.",
    "Mike DeWine says resettlement agencies, faith-based organizations, charities, and more will find out their role and how to assess what the needs of Ukrainians may be.",
    "The move comes after Ohio election officials raised serious concerns about their ability to carry out a successful primary election on May 3.",
    "The state Senate unanimously approved a measure Tuesday allowing overseas ballots to be processed up to 20 days after the primary.",
    "Breeze Airways announced year-round nonstop service to Nashville beginning in May and Hartford, Connecticut in June.",
    "It comes a week after Allegiant announced nonstop service to destination sites in Florida and the Hilton Head area.",
    "The measure, which largely affects military personnel, is expected to go before the Ohio House on Wednesday.",
    "The decision comes one week after CEO Eric Gordon said the policy would remain in place but not be enforced.",
    "And Columbus city schools, Ohio's largest district, announced Monday that it’s dropped its mask mandate.",
    "Ohio State University says masks will be optional in most indoor spaces on campus beginning Friday.",
    "Those officials cite the already tight timeline due to still-unresolved state legislative maps.",
    "CAK adds more flights\n(WKSU) -- More direct flights have been added to Akron-Canton Airport.",
    "Since 2018, more than 500 Ukrainians have been resettled in Ohio, mostly in Cleveland.",
    "A shortened ride from the Rockside Station in Independence will continue on weekends.",
    "Ohio's capital has also dropped its indoor mask mandate.",
    "He now says masks are recommended but not required.",
    "Gov."
  ]
}