{
  "id": 15658,
  "mediaId": 8465,
  "date": "2022-03-04",
  "headline": "Van Wert Foward receives state tax credit",
  "image": "https://thevwindependent.com/news/wp-content/uploads/2022/03/Downtown-Van-Wert-award-3-4-2022.jpg",
  "link": "https://thevwindependent.com/news/2022/03/04/van-wert-foward-receives-2-6m-state-tax-credit-award/",
  "mediaOutlet": "thevwindependent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "VW independent staff and submitted information\nThe ongoing Van Wert Forward project has received a significant boost from the state in the form of $2.6 million in tax credits from the Transformational Mixed-Use Development (TMUD) Program administered by the Ohio Department of Development.",
    "Van Wert is one of ten cities to be awarded TMUD credits in the competitive application process, and Van Wert Forward is one of 13 projects included as a recipient in this round of TMUD applications.",
    "Van Wert Forward is transforming quality of place by planning, developing and sustaining the built environment in downtown Van Wert and is vision-driven by The Van Wert County Foundation.",
    "Van Wert Forward Phase One has a number of mixed-use spaces with four buildings including space for commercial units on the first floor and plans for residential units above them.",
    "The TMUD credits are awarded to organizations that demonstrate and ability to spur conomic growth and social well-being that produces long-term, positive change for a community.",
    "For more information visit Van Wert Forward’s website vanwertforward.org, or contact the Director of Engagement and Outreach, Joel Germann at joel@vanwertforward.org.",
    "Ovearll, the Van Wert Forward project includes the historic rehabilitation of 19 buildings on a 2.8-acre site in the Downtown Business District of Van Wert.",
    "The project will preserve and enhance the downtown assets which will be redeveloped as retail, office, institutional, and dining space.",
    "Copyright © 2010-2022 The Van Wert Independent — Subscribe to our RSS feed — Web Site Design by J. DeWert Enterprises, LLC",
    "To be considered for an award, a project must include a minimum of two uses benefiting the community’s public members.",
    "The announcement was made this week by the Van Wert County Foundation, Governor Mike DeWine and Lt.",
    "It will also house 58 residential units, with more than 49,000 square feet of commercial space.",
    "The selected projects are the first proposals to receive state support.",
    "Governor Jon Husted."
  ]
}