{
  "id": 15713,
  "mediaId": 8498,
  "date": "2022-03-08",
  "headline": "Most Ohio Senate Republicans back bill to repeal gas tax increase, but DeWine calls it a “mistake”",
  "image": "https://woub.org/wp-content/uploads/2016/03/gas-feature-2-e1550764536974.png",
  "link": "https://woub.org/2022/03/08/most-ohio-senate-republicans-back-bill-to-repeal-gas-tax-increase-but-dewine-calls-it-a-mistake/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Kasler | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/karen-kasler-statehouse-news-bureau/",
  "termIds": [
    0
  ],
  "sentences": [
    "“It sounds like there’s plenty of money to go around to build those roads, bridges and highways.”\nHuffman, who is running for re-election this year, said this isn’t just a response to inflation and high gas prices drivers are seeing now, but he said the bill would put money back in people’s hands, especially lower-income Ohioans, as higher gas prices hit them hard.",
    "I think that there will be plenty of money to fund that bridge and other projects.”\nThough the transportation budget passed the House and Senate comfortably in 2019, two-thirds of Republican Senate caucus is listed as sponsoring Huffman’s bill – including four Senators who voted for that budget with the gas tax increase two years ago.",
    "And we need a new bridge, and we need to fix the bridge that we have.”\nHuffman said he expects both states to chip in a billion dollars each, and he doesn’t think his bill to repeal of the gas tax and the hybrid fees increases is in conflict with the goal of getting the money to fix the bridge.",
    "“We’re getting $10 billion from the federal government and hopefully, some of that money is going to go to the Brent Spence Bridge because it is an economic drive that we at some point soon have to address for the benefit of all of Ohio,” Huffman said.",
    "Huffman said he’s proposing repealing the gas tax increase for five years, because over that time, Ohio will get $11.5 billion in federal funds from the infrastructure bill, while the gas tax would only generate $1.5 billion.",
    "“So it would just be a mistake to do that.”\nHuffman’s bill would also suspend the $200 annual registration fee for electric vehicles and $100 yearly fee for plug-in hybrids, both also from that transportation budget.",
    "The back-and-forth over the next few weeks brought this notable sound bite from Republican former House Speaker Larry Householder, talking about the Senate’s unwillingness to bargain on a gas tax hike in March 2019.",
    "This comes as the state is working on repairing the crumbling Brent Spence Bridge in Cincinnati, mentioned by three presidents as a poster child for the need for more federal infrastructure spending.",
    "Ohio and Kentucky have signed a deal to work together to apply for funding for improvements to the bridge and to build a second one – with a total cost of $2.8 billion and a five year timeline.",
    "“If we do not have the funding to fix Ohio roads, more crashes will happen, and I’m sad to say more people will get hurt and even sadder to say that some people will die,” Marchbanks said.",
    "“The state of Ohio, in the next five years, will get $10 billion more than we estimated we’d need and what the governor thought we needed when we passed the tax in 2019,” Huffman said.",
    "Ohio Department of Transportation director Jack Marchbanks said in February that year that his agency was in a grim financial situation, and this was simply a safety issue.",
    "Fast forward three years, and Sen. Steve Huffman (R-Tipp City), one of the nine Republican “no” votes on that transportation budget in the Senate in 2019, has a new bill.",
    "Eventually, lawmakers and DeWine compromised on a 10.5 cent increase per gallon in the gas tax, with a 19 cent hike in the price per gallon for diesel.",
    "But in this election year as gas prices move higher, some Republican state lawmakers are pushing forward on a proposal to put the brakes on that tax.",
    "0+1\n0Like\n0Share\n< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — Ohioans have been living with a gas tax increase for almost three years.",
    "But Huffman said while he had proposed to repeal all the increases from that budget, those fees are an area where he could negotiate.",
    "“We think we’ll get something, and we think we have a very compelling case that this is a bridge of great national significance.",
    "You’ve got to pull your binkie out of your mouth and you’ve got to make tough decisions,” Householder said at the time.",
    "But there is a bill in the House from two Democratic representatives that would cut the hybrid fees in half.",
    "It’s the second-most congested corridor in the US, and was shut down for weeks in 2020 after a fiery crash.",
    "Mike DeWine, who’s also up for re-election, said now isn’t the time to pull back on that source of revenue.",
    "“The first thing we have to do is see how much money we can get from the federal government,” DeWine said.",
    "“We need this money to keep our roads going and repair our roads and make our roads safer,” DeWine said.",
    "“It would repeal, essentially, the tax increase from the transportation budget of 2019,” Huffman said.",
    "2019 started with a battle over the gas tax, with newly inaugurated Republican Gov.",
    "And DeWine said a big chunk of that money will come from the states.",
    "“When you come here, you’ve got to put on your big boy pants.",
    "Mike DeWine wanting an 18-cent a gallon increase.",
    "“So I don’t think there’s a competition.",
    "It has no Democratic co-sponsors.",
    "But Gov."
  ]
}