{
  "id": 15800,
  "mediaId": 8494,
  "date": "2022-03-14",
  "headline": "Morning Headlines: 70% of Ohioans 12 and older now vaccinated; Ohio law enforcement asked to inventory PPE to donate to Ukraine",
  "image": "https://npr.brightspotcdn.com/dims4/default/9ca4b05/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F82%2F29%2Faa533ce541099baa0012344a44c4%2Fshutterstock-1767084407.jpg",
  "link": "https://www.wksu.org/2022-03-14/morning-headlines-70-of-ohioans-12-and-older-now-vaccinated-ohio-law-enforcement-asked-to-inventory-ppe-to-donate-to-ukraine",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Monday, March 14:\n70% of Ohioans 12 and older now vaccinated\nOhio law enforcement asked to inventory PPE to donate to Ukraine\nPortman travels to Poland\nCleveland and DOJ reach agreement on moving forward with Issue 24\nEx-Columbus Zoo CEO to repay $400,000 audit said he owed\nAkron punches ticket to March Madness\n70% of Ohioans 12 and older now vaccinated\n(WKSU) -- Ohio’s COVID-19 data continues to improve.",
    "Ex-Columbus Zoo CEO to repay $400,000 audit said he owed\n(AP) — A former chief executive officer has agreed to repay hundreds of thousands of dollars to the Columbus Zoo and Aquarium after audits concluded that improper spending and questionable business practices cost the institution more than $630,000.",
    "His comments came after Pentagon press secretary John Kirby said that Poland's proposal to transfer the fighter jets to a U.S. airbase in Germany in order to help Ukraine was not tenable, and could increase the risk of furthering tensions with Russia.",
    "Ohio law enforcement asked to inventory PPE to donate to Ukraine\n(Ideastream Public Media) -- Ohio may soon send surplus personal protective gear to the Ukrainian military as they defend the country against Russian aggression.",
    "That means the new commission, acting as a part of “the City”, can start working on policies and training and officer discipline, without the court having to add all its new responsibilities into the consent decree.",
    "Cleveland and DOJ reach agreement on moving forward with Issue 24\n(Ideastream Public Media) -- The city of Cleveland and the U.S. Department of Justice have reached an agreement on amending the consent decree.",
    "Portman says the group is meeting with Polish officials and visiting refugee sites to reaffirm the U.S.’ commitment to Poland, Ukraine, and other allies in response to President Putin’s invasion of Ukraine.",
    "The Ohio National Guard will coordinate collecting and delivering the donated equipment if they get the green light from the United States European Combatant Command, according to a press release.",
    "The zoo’s board of directors on Friday announced the approval of a settlement with former CEO Thomas Stalf for $400,000, which an August 2021 forensic audit said he received inappropriately.",
    "The Columbus Dispatch reports that Stalf’s attorney said he agreed to pay back the money so that he could move forward with his life, but alleged that his client was made a scapegoat.",
    "Mike DeWine is asking state and local law enforcement agencies to assess their surplus or expired personal protective equipment -- like body armor and helmets -- to send to Ukraine.",
    "So, in many sections of the consent decree, where the responsible party was the Cleveland Division of Police, CDP has been crossed out and replaced with “the City”.",
    "Akron punches ticket to March Madness\n(WKSU) -- Akron will face UCLA this Thursday in the first round of the NCAA men's college basketball tournament.",
    "But when voters passed Issue 24, the commission was given expanded powers – powers that conflict with police department responsibilities.",
    "During an appearance on CNN on Sunday, Portman questioned why the U.S. scrapped Poland’s proposal to transfer fighter jets to Ukraine.",
    "The Community Police Commission’s responsibilities don’t change at all in the proposal between the city and Department of Justice.",
    "The Zips advanced and secured the 13th seed after upsetting Kent State on Saturday in the Mid-American Conference Championship.",
    "The vaccination rate hit a milestone on Saturday with 70% of Ohioans 12 and older who have received at least one dose.",
    "The Ohio Hospital Association says the number of COVID patients in Ohio has dropped 60% in the last three weeks.",
    "Beginning this week, the state will move to weekly reporting of COVID data, rather than daily.",
    "Rob Portman is among a group of senators that traveled to Poland over the weekend.",
    "Judge Solomon Oliver will consider the proposed changes at a hearing Thursday.",
    "7 seed and will play 10th seeded Loyola Chicago Friday in Pittsburgh.",
    "It will still be an advisory group focused on public engagement.",
    "It's the Zips' first appearance in March Madness since 2013.",
    "The rate drops to 66% when figuring in Ohioans ages 5-11.",
    "They've never won a game in the marquee tournament.",
    "The Bruins made it to the Final Four last year.",
    "Ohio’s three-week case average is below 1,000.",
    "Portman travels to Poland\n(WKSU) -- Ohio Sen.",
    "Meanwhile, Ohio State earned the No.",
    "Gov."
  ]
}