{
  "id": 1583,
  "mediaId": 8494,
  "date": "2022-02-15",
  "headline": "Morning Headlines: Hudson mayor quits amid controversies; House and Senate district maps remain in limbo",
  "image": "https://npr.brightspotcdn.com/dims4/default/c07620d/2147483647/strip/true/crop/800x420+0+15/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F47%2F18%2F6ca676744bf78596525e79453d32%2Fjchmbwnmfjqemov-800x450-nopad.jpg",
  "link": "https://www.wksu.org/2022-02-15/morning-headlines-hudson-mayor-quits-amid-controversies-house-and-senate-district-maps-remain-in-limbo",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Tuesday, February 15:\nHudson mayor quits amid controversies\nHouse and Senate district maps remain in limbo\nLatest inmate removed from death row via mental illness law\nCOVID cases, hospitalizations are the lowest in six months\nCoast guard cautions people to stay off Lake Erie ice\nHudson mayor quits amid controversies\n(AP) — Hudson Mayor Craig Shubert has resigned following comments he made that have drawn national attention.",
    "The mayor also made national headlines last fall when he threatened prosecution of school board members over a book in an optional, college-level class that the mayor deemed “child pornography.”\nHouse and Senate district maps remain in limbo\n(Statehouse News Bureau) -- State lawmakers that make up the Ohio Redistricting Commission have until Thursday to approve new maps for the state’s Ohio House and Senate districts.",
    "Latest inmate removed from death row via mental illness law\n(AP) — A new Ohio law prohibiting the execution of people severely mentally ill at the time of their crime has led to the removal of another prisoner from death row.",
    "Coast guard cautions people to stay off Lake Erie ice\n(WKSU) -- With warmer weather on the way this week, the Coast Guard is urging people to stay off the ice on Lake Erie.",
    "The Beacon Journal reports the number of COVID-19 patients in the four major Akron-area hospitals dropped 44% over the weekend, reaching the lowest number since last July.",
    "Mike DeWine signed the bill into law last year covering killers diagnosed with schizophrenia, schizoaffective disorder, bipolar disorder, or delusional disorder.",
    "Last year, judges removed inmates in Butler and Franklin counties from death row after their attorneys successfully argued they met the mental illness criteria.",
    "COVID cases, hospitalizations are the lowest in six months\n(WKSU) -- COVID cases in Ohio continue to decline with just 1,300 reported Monday statewide.",
    "Last month a Stark County judge found that death row inmate David Sneed had schizoaffective disorder when he fatally shot a man in 1984.",
    "Mike DeWine believes the commission should meet and do all they can to follow the constitution and the recent court decision.",
    "During last week’s council meeting, Shubert said allowing ice fishing shanties on a lake could lead to prostitution.",
    "The Ohio Supreme Court has twice ruled that the maps approved by Republicans are unconstitutionally gerrymandered.",
    "He had previously told local media that the statement was based on stories he had covered as a news reporter.",
    "However, there has been no word from Republican House Speaker Bob Cupp, who would have to call a meeting.",
    "In the last couple of weeks, more than a dozen people were rescued from ice floes on Lake Erie.",
    "In his resignation letter, Shubert said it was an attempt at humor that was misinterpreted.",
    "The National Weather Service says that means the lake will begin to thaw quickly.",
    "Temperatures will be in the mid-50s on Wednesday and Thursday with rain.",
    "There were just 35 COVID patients in the four hospitals on Monday.",
    "Democratic commissioners say they should meet as soon as possible.",
    "Sneed was resentenced to life without parole.",
    "That’s the lowest daily total in six months.",
    "Hospitalizations also decreased statewide.",
    "A spokesperson says Gov.",
    "Gov."
  ]
}