{
  "id": 15906,
  "mediaId": 8373,
  "date": "2022-03-11",
  "headline": "Ohio planning to receive Ukrainian refugees",
  "image": "https://jnswire.s3.amazonaws.com/jns-media/1d/e8/11701829/adobestock_490465847.jpeg",
  "link": "https://mountvernonnews.com/stories/621672231-ohio-planning-to-receive-ukrainian-refugees",
  "mediaOutlet": "mountvernonnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "J.D. Davidson",
  "authorUrl": "https://mountvernonnews.com/author/j-d-davidson",
  "termIds": [
    0
  ],
  "sentences": [
    "“While we do not yet know what role Ohio will play in helping these families, I want us to be prepared when the time does come.”\nThe Ohio Department of Job and Family Services (ODJFS) plans to bring together multiple organizations March 17, including resettlement agencies, faith-based organizations and charities.",
    "Many came through the Lautenberg Amendment, a federal program established in 1990 that allows religious minorities from the former Soviet Union to seek refuge in the U.S. More than 14,000 Ukrainian nationals have been resettled in the U.S. under the amendment in the past five years.",
    "The ODJFS Refugee Services Program oversees programs that help refugees achieve economic self-sufficiency and social adjustment after their arrival in the U.S. Services are provided by nine resettlement agencies and other nonprofit groups in Ohio.",
    "“Over the next few days, we’ll be finalizing an agenda and providing more information to the key players in this effort.”\nMore than 500 Ukrainians have been resettled in Ohio since 2018, mostly in Cleveland.",
    "\"ODJFS is pleased to help bring Ohio’s resettlement agencies and other charitable organizations together to seek ways of helping displaced Ukrainians,” ODJFS Director Matt Damschroder said.",
    "“Like many Ohioans, I am disgusted by the senseless aggression of the Russian military and want to support Ukrainian families being driven out of their country,” DeWine said.",
    "The timing and number of refugees is unknown, DeWine said in a news release, but he expects the state will play a role in relocating Ukrainian families in northeast Ohio.",
    "Ohio accepted nearly 900 Afghan evacuees in September, placing them with eight local resettlement agencies, mainly in Northeast and Central Ohio.",
    "Mike DeWine has directed the state’s service agencies to gather quickly and prepare for the possibility of an influx of Ukrainian refugees.",
    "The placements took place over six months, with 285 Cleveland, 150 in Akron, 50 in Cincinnati, 25 in Toledo and 350 in Columbus.",
    "The plan, according to DeWine, is to give those groups a better understanding of what might be needed.",
    "At that time, ODJFS also worked with the federal government to provide information on capacity.",
    "(THE CENTER SQUARE) – Ohio Gov."
  ]
}