{
  "id": 1676,
  "mediaId": 8313,
  "date": "2022-02-17",
  "headline": "Robert D. Lindner Sr., who built United Dairy Farmers, dies at age 101",
  "image": "https://www.gannett-cdn.com/presto/2021/12/27/PCIN/cf482e24-e1c9-4120-ade3-b4fa53dff183-lindner01.jpg?crop=5426,3052,x0,y196&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/02/17/robert-d-lindner-sr-who-built-united-dairy-farmers-dies-age-101/9028690002/",
  "mediaOutlet": "enquirer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Enquirer",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"He loved everything about UDF; making and eating ice cream, being in the stores and especially the people who made it all happen.”\nThe money from milk, cream and ice cream sales at UDF became the basis for the rest of the Lindner family's business ventures, including American Financial Group – now ranked 376th on the Fortune 500 list of American businesses.",
    "Robert Lindner owned four working ranches and a farm near Pagosa Springs, Colorado, which he placed in a conservation easement, ensuring that 15,000 acres of rangeland, ponderosa pines and mountain streams will never be developed.",
    "Robert D. Lindner Sr., who went to work every day into his 90s and helped build United Dairy Farmers into a business that combined a regional chain of convenience stores and dairy product manufacturing, died on Wednesday.",
    "Campus housing, a conference center and an endowed professorship at Northern Baptist Theological Seminary in Lombard, Ill., are named after either him or his wife, Betty.",
    "As a sergeant stationed on a remote island in the Pacific during World War II, he remembers the USO showing up, even as bullets were still flying, to cheer up the troops.",
    "Lindner and his three siblings built on a dairy business their father, Carl Sr., started in the early 1900s by delivering milk to homes, ladling it out of a jug.",
    "Robert oversaw production and the plant's operation; Richard maintained the fleet of vehicles and facilities; Dorothy kept the books; Carl was the salesman.",
    "Lindner visited the ranches, but usually not for more than 10 days at a time, preferring not to be away from the business for that long even when he was 90.",
    "Mike DeWine remembered Lindner as a member of the Greatest Generation who \"served in the Pacific in World War II and was a steadfast supporter of the USO.\"",
    "An example of the family-owned touch: UDF offered free ice cream cones on Aug. 5, 2020 for Lindner's 100 birthday and the 80th anniversary of the company.",
    "UDF started on May 6, 1940, when he and his siblings began selling milk, cheese, cream and buttermilk from a storefront on Montgomery Road in Norwood.",
    "A lot has changed since 1940, but more than 80 years later, UDF is still a family-owned business based on selling dairy products at the corner store.",
    "He and his wife, Betty, also supported a variety of substance-abuse prevention programs, including Cincinnati Teen Challenge and City Gospel Mission.",
    "He supported the $1 million renovation of what is now called the Robert D. Lindner Family Omnimax Theater at the Cincinnati Museum Center in 2006.",
    "History of philanthropy\nWith the wealth that Robert Lindner built over decades, he supported a variety of causes, some of them behind the scenes.",
    "He also was instrumental in starting a Baptist seminary in Moscow, Russia, and was a big supporter of the Montgomery Community Baptist Church.",
    "Dorothy married in the 1950s and bowed out of the business, after being a key player at UDF during World War II and after, to raise a family.",
    "UDF has grown into what now ranks as the region's 15th largest privately held company on the most recent Deloitte Cincinnati USA 100 list.",
    "Robert remembers Carl sitting for hours talking to the late Jim Luken, head of the dairy workers union and a future mayor of Cincinnati.",
    "But by the early 1930s, he had come up with what was then a revolutionary idea: selling milk from a store and undercutting the milkman.",
    "In the 1950s, they started buying savings and loans that were used to build American Financial Group, now a $4 billion giant.",
    "That placed UDF fifth among donors to the group that attacked Democratic presidential candidate John Kerry's war record.",
    "AFG led by brother Carl was fourth at $350,000, according to Open Secrets, a website that tracks money in U.S. politics.",
    "\"When he does go to the ranch, he calls in to see what's going on,\" his longtime assistant, Phyllis McCoy, said in 2010.",
    "The sibling bonds were evident as Robert Lindner talked in that 2010 interview about the early days of what became UDF.",
    "The family opened a few more stores from 1940 to 1942, then Robert went off to World War II and so did brother Richard.",
    "He was a major donor to the Robert D. and Richard E. Lindner Sports Complex at Cincinnati Hills Christian Academy.",
    "The company didn't disclose revenues, which totaled more than $828 million based on where UDF stands on the list.",
    "Its corporate headquarters and plant are still at that Montgomery Road spot in the heart of blue-collar Norwood.",
    "Robert bought Carl's interest in United Dairy Farmers in 1980, solidifying Robert's leadership of that business.",
    "Carl H. Lindner Jr., the best known of the siblings who later owned the Reds, stayed behind to mind the store.",
    "They called it \"cash and carry,\" and at 28 cents a gallon, they were selling milk cheaper than anyone else.",
    "\"When I say 'I,' I'm speaking as much for Carl, Rich and Dorothy, because we're all together,\" he said.",
    "“One of his proudest accomplishments was the success of this company,\" a statement from UDF said.",
    "He later showed his appreciation with steady financial support for the service organization.",
    "Lindner gave to political candidates and causes, but not as lavishly as his brother Carl.",
    "Winn-Dixie bought the Thriftway chain in 1995, then closed or sold the stores in 2004.",
    "Richard in the 1960s began running and expanding the Thriftway chain of supermarkets.",
    "?UDF made a contribution of $260,000 to Swift Boat Veterans & POWs for Truth in 2004.",
    "\"We leveraged the dairy company,\" Lindner said in a 2010 interview with The Enquirer.",
    "The company now has nearly 200 stores in three states and more than 2,000 employees.",
    "he sent condolences to his family and friends in a statement Thursday night.",
    "That first day's sales, Lindner remembered in a 2010 interview, were $8.28.",
    "A list of survivors and funeral arrangements weren't immediately available.",
    "One family's multiple businesses\nAs UDF grew, the unions came calling.",
    "Brother Carl bought some of Robert's interest in AFG in the 1980s.",
    "\"I call them my Rembrandts,\" he said in the 2010 interview.",
    "Dorothy Kreuzman died on Sept. 20, 2021, at the age of 98.",
    "The Lindners started a life insurance business in Texas.",
    "\"The way they are today is the way they'll be forever.\"",
    "When the war was over, they resumed their expansion.",
    "Carl Lindner died on Oct. 17, 2011, at age 92.",
    "She died on Dec. 24, 2013, at age 89.",
    "He died in January 2010 at age 88.",
    "Each had responsibilities.",
    "But UDF never unionized.",
    "For example, ?????",
    "He was 101.",
    "Ohio Gov."
  ]
}