{
  "id": 17082,
  "mediaId": 8480,
  "date": "2022-02-28",
  "headline": "House bill prompted after Takoda Collins’ death signed into law",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2020/01/takoda_Collins.jpeg?w=1280",
  "link": "https://www.wdtn.com/news/local-news/house-bill-prompted-after-takoda-collins-death-signed-into-law/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Morse",
  "authorUrl": "https://www.wdtn.com/author/caroline-morse/",
  "termIds": [
    3309,
    2425,
    1477,
    6474,
    6407,
    6104
  ],
  "sentences": [
    "“God bless the people at child services but we just can’t drop the ball when we’re dealing with youths and their lives, this is a tragedy.”\nThe family of Takoda Collins released the following statement after the bill was signed into law:\n“While nothing can ease the pain of Takoda’s mother, grandmother and family, our hope is that this legislation will have a positive impact on the way in which children like Takoda are protected.",
    "We need to ensure that no other children are left behind or forgotten in a system that should be designed with our kids’ best interests at heart.”\nTakoda Collins’ family\n“Until you get closure until someone says we’re investigating your complaint, don’t stop with one entity,” said Plummer.",
    "The legislation will require Public Children Services Agency (PCSA) to disclose confidential information discovered during child abuse investigations to any federal, state or local government entity including law enforcement.",
    "House Bill 4 will also create a youth and family ombudsman program, an official appointed to investigate complaints on behalf of families that believe their case is not being handled appropriately.",
    "Montgomery County Criminal Division Deputy Chief Lynda Dodd said prosecutors considered the death penalty but it couldn’t be given since evidence couldn’t prove McLean intended to kill Takoda.",
    "Plummer inspired House Bill 4 in memory of 10-year old Takoda Collins, a boy who was brutally raped and excessively abused by his father for years and murdered in December 2019.",
    "Lastly, the legislation also requires PCSA to provide written notice receipt of an investigation’s report or closure to the reporter of the abuse or neglect.",
    "“Just keep pushing because as we’ve seen if someone drops the ball it can be fatal.”\nTakoda’s father Al McLean was sentenced to 51 years to life in prison.",
    "The legislation stems from the death of 10-year-old Montgomery County native Takoda Collins who was killed in December 2019 after years of extensive abuse.",
    "He said the bill will prevent child abuse cases like Takoda’s from falling through the cracks between child protective services and law enforcement.",
    "DAYTON, Ohio (WDTN) – Governor Mike DeWine signed House Bill 4 into law Monday, which added a layer of security for Ohio’s children.",
    "Representative and former Montgomery County Sheriff Phil Plummer led House Bill 4 using decades of law enforcement experience.",
    "“This will help fill those gaps, more accountability, more eyes on children services and more cross reporting,” said Plummer.",
    "“The young man in our community fell through the cracks, Takoda Collins was a tragedy,” said Rep Plummer.",
    "House Bill 4 will go into law in 90 days."
  ]
}