{
  "id": 17088,
  "mediaId": 8480,
  "date": "2022-03-03",
  "headline": "Ohio lawmakers call for state to pull investments, end business with Russia",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/GettyImages-1207620988.jpg?w=1280",
  "link": "https://www.wdtn.com/news/local-news/ohio-lawmakers-call-for-state-to-pull-investments-end-business-with-russia/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allison Gens",
  "authorUrl": "https://www.wdtn.com/author/allison-gens/",
  "termIds": [
    5846,
    2736,
    3992,
    2143,
    980,
    6077,
    6569,
    6672,
    6474
  ],
  "sentences": [
    "Thursday, State Senator Niraj Antani (R-Miamisburg) introduced a bill that would require Ohio pension systems divest from Russia, prohibit state and local contracting with Russian companies and ban tax, loan or grant incentives from Russian companies.",
    "“We are the only state in the nation that’s doing all three of these things to join this effort, this worldwide effort of the West, to combat Russian aggression and to stand up for Ukraine,” Antani said.",
    "“There are a few things like ammunition we buy from Russia and a few other manufactured goods, but we will essentially take away any advantage Russia might have had selling those goods,” Brown said.",
    "A statement from DeWine said, in part:\n“I want to assure Ohioans that our state has no contracts with Russian businesses now, and will not have any contracts for goods and services going forward.",
    "COLUMBUS, Ohio (WDTN) – State and U.S. lawmakers from Ohio are calling the state to pull investments and stop doing business with Russia in response to their invasion of Ukraine.",
    "We will not support Russia with Ohio taxpayer dollars.”\nSentator Sherrod Brown (D-Ohio) is commending the state’s actions, saying everything we can do is the right thing to do.",
    "The governor signed an order Thursday prohibiting Ohio from providing finances that might aid Russia in their attack on Ukraine.",
    "That just makes no sense to me.”\nCopyright 2022 Nexstar Media Inc. All rights reserved.",
    "Senator Rob Portman (R-Ohio) said more is needed, including more sanctions nationally.",
    "DeWine also banned Ohio from purchasing or investing in Russian goods and services.",
    "“We need to continue to tighten the noose on the Putin economy,” Portman said.",
    "Mike DeWine has already taken action this week by signing executive orders.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "“And of course, we should cut off the oil from Russia.",
    "Gov."
  ]
}