{
  "id": 17183,
  "mediaId": 8480,
  "date": "2022-03-02",
  "headline": "Bill getting rid of concealed carry permit requirements heads to DeWine’s desk",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/generic-handgun.jpg?w=1280",
  "link": "https://www.wdtn.com/news/ohio/ohio-house-passes-bill-getting-rid-of-concealed-carry-permit-requirements/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Suzanne Stratford",
  "authorUrl": "https://fox8.com/author/suzannestratford/",
  "termIds": [
    4001,
    4478,
    2143,
    1489,
    1477,
    970,
    6077,
    6474
  ],
  "sentences": [
    "COLUMBUS, Ohio (WJW) — The Ohio House of Representatives voted on proposed legislation Wednesday that eliminates a concealed carry permit requirement for Ohioans 21 and over who are legally eligible to own and carry a firearm in the state.",
    "“It’s important because it allows people who haven’t gotten the training and license to carry a gun if a sudden need arises for them to be able to protect themselves,” said Jim Irvine, tactical trainer and chairman of A1S4 Protection PAC.",
    "Bob Cornwell, Executive Director of the Buckeye State Sheriff’s Association, representing sheriffs across Ohio, told FOX 8 that they are “neutral” on the bill, because of an amendment which was added Wednesday.",
    "“If an individual is approached by a law enforcement officer, the individual, if they’re carrying a firearm, must notify the law enforcement officer that they are carrying.",
    "If passed, Ohio would become the 22nd state to not require permits for concealed carry, State Sen. Terry Johnson (R-McDermott), who sponsored the bill, said.",
    "Following Wednesday’s decision, State Rep. Joe Miller (D-Amherst) was just one of many Democrats who voiced a dissenting opinion of the passed bill.",
    "As some amendments were added to the legislation, the Senate had to give a final sign-off Wednesday, but the bill is now heading to Ohio Gov.",
    "By a vote of 57-35, the House passed Senate Bill 215, after it moved through the House Government Oversight Committee Tuesday.",
    "We have passed too many bills in this General Assembly that have made Ohioans less safe,” Rep. Miller said in a statement.",
    "“As a supporter of the Second Amendment and a gun owner, I believe that this legislation goes too far.",
    "Proponents of the bill say it allows for Ohioans to more fully realize their Second Amendment rights.",
    "If they fail to do so then it would be a misdemeanor of the second degree,” said Cornwell.",
    "Failure to notify is an M-2 punishable by up to 90 days in jail and a $750 fine.",
    "Read more on the bill right here.",
    "Mike DeWine‘s desk."
  ]
}