{
  "id": 17265,
  "mediaId": 8496,
  "date": "2022-03-02",
  "headline": "Ohio Attorney General Dave Yost wants state pension funds to remove Russian assets",
  "image": "https://media.wkyc.com/assets/WBNS/images/b21f883f-7f04-4d8b-8b84-b27380d0e115/b21f883f-7f04-4d8b-8b84-b27380d0e115_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/politics/ohio-ag-wants-state-pension-funds-to-remove-russian-assets/530-706029c1-bc3e-4cd7-b371-705e9d3d9538",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The Montana Board of Investments — which oversees nearly $25 billion in assets held by the state’s pension funds, workers’ compensation funds and money held by schools, universities and local governments — has identified about $15 million in assets that are “tied to Russian interests,” and is reviewing ways to exit from them, Dan Villa, the board’s executive director, said Tuesday.",
    "“That money should not be used to help keep an economy afloat that is sponsoring a war machine.”\nFurthermore, Ohio has a large Ukranian-American population and some public retirees are undoubtedly of Ukranian descent and don’t want their money invested in Russia, the attorney general said.",
    "COLUMBUS, Ohio — Ohio’s five public employee retirement funds have a “moral imperative” to divest themselves of Russian financial holdings to further punish the country over its invasion of Ukraine, state Attorney General Dave Yost said Wednesday.",
    "The Ohio Police and Fire Pension Fund, with about $6.5 million in Russian investments in its $19 billion portfolio, is reviewing its options for withdrawing from Russian interests, fund spokesperson David Graham said.",
    "Mike DeWine directed the state’s Commerce Department to cease the purchase and sale of Russian Standard, the only Russian vodka sold in Ohio (under the brand names Green Mark and Russian Standard).",
    "In addition to punishing Russia, Ohio pension fund divestment is necessary to protect retired Ohioans, since Russia’s increasing isolation could lead to the devaluation of its assets, Yost said.",
    "Governors and lawmakers in numerous U.S. states took actions beginning Monday to pull state investments from Russian companies while encouraging private entities to do the same.",
    "A spokesperson for the Ohio Public Employee Retirement System said its executive board planned to meet later Wednesday to discuss the attorney general’s request.",
    "“Widespread bankruptcies seem a likely outcome--an outcome in which our Ohio public pension systems and their members should not share,” Yost said.",
    "OPERS, with assets of about $127 billion, is the state’s largest public pension system and the 12th largest in the nation.",
    "“The pension systems invest billions of dollars of assets that belong to public employee retirees,” Yost said.",
    "Yost directed the five funds to identify Russian equities and divest the funds of them as quickly as possible.",
    "The request is nonbinding, but he said the funds have a fiduciary responsibility to their members.",
    "Last week, Ohio Gov."
  ]
}