{
  "id": 173,
  "mediaId": 8454,
  "date": "2022-02-22",
  "headline": "Zayas: From Spanish Harlem to Candidate for Ohio Supreme Court",
  "image": "https://thecincinnatiherald.com/wp-content/uploads/2022/02/JudgeMarilynZayas1.jpg",
  "link": "https://thecincinnatiherald.com/2022/02/zayas-from-spanish-harlem-to-candidate-for-ohio-supreme-court/",
  "mediaOutlet": "The Cincinnati Herald | Established in 1955 | Cincinnati, Ohio",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Refusing to become a statistic, Judge Marilyn Zayas overcame a traumatic childhood, tough, crime-ridden New York City neighborhoods, and numerous educational obstacles.”\nSince joining the court, Judge Zayas has been appointed by Ohio’s Chief Justice to sit with the Ohio Supreme Court and on the Second, Sixth, Eighth, and Tenth District Courts of Appeal.",
    "Celebrities nominated the honorees, according to goodmorningamerica.com Actor-comedian John Leguizamo, who nominated Zayas, said:\n“How inspiring that a little girl from Spanish Harlem fought her way to becoming a twice-elected court of appeals judge in Ohio.",
    "“I am grateful that Ohio voters entrusted me to serve as their Judge, and I strive to ensure that justice is administered with integrity, independence, and common sense,” said Zayas.",
    "“If elected, I will bring these same values to our highest court.”\nMuch has been written recently regarding the judicial ethics of her opponent, Justice Pat Dewine.",
    "The questionable actions involve DeWine’s refusal to recuse himself from two lawsuits, when the decision-making process involved his father, Governor Mike DeWine.",
    "ABC’s “Good Morning America” recently honored Judge Marilyn Zayas as one of 26 Hispanic/Latino leaders nationwide who are making an impact in their communities.",
    "She has represented clients in the legal areas of Intellectual Property, Labor and Employment, Juvenile Delinquency, Criminal Defense, Custody, and Adoptions.",
    "Judge Zayas was first elected in 2016 as a political outsider in Hamilton County after defeating the incumbent who had been appointed by the governor.",
    "Prior to joining the court, Judge Zayas came to Ohio in 1988 to begin her career as an Information Technology Manager at Procter and Gamble.",
    "Her oldest brother served as a police officer until injured in the line of duty, and her other two brothers are currently teachers.",
    "After founding her own law office, she helped businesses, investors, and individuals navigate the complex immigration system.",
    "Judge Marilyn Zayas’ humble beginnings bring a unique and much needed perspective to the Ohio Supreme Court.",
    "She quickly earned a reputation as a well-prepared judge who listens and considers all sides of each case.",
    "She and her brothers were committed to their education and chose careers of public service.",
    "Judge Marilyn Zayas is officially on the ballot for the Ohio Supreme Court.",
    "In 1994, she left P & G to pursue her dream to become a lawyer.",
    "Zayas served the community as an attorney for nearly 20 years.",
    "Judge Zayas faced many childhood difficulties.",
    "Zayas is challenging Justice Pat DeWine."
  ]
}