{
  "id": 17415,
  "mediaId": 8487,
  "date": "2022-03-03",
  "headline": "Peoples Convoy Draws Onlookers and Supporters",
  "image": "https://whiznews.com/wp-content/uploads/2022/03/0303221706a_HDR-scaled.jpg",
  "link": "https://whiznews.com/2022/03/03/peoples-convoy-draws-onlookers-and-supporters/",
  "mediaOutlet": "whiznews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Morris",
  "authorUrl": "https://whiznews.com/author/mmorris/",
  "termIds": [
    0
  ],
  "sentences": [
    "Gas prices being what they are, I didn’t necessarily want to drive to Cambridge and back, so I blew it off and when I come past the State Street overpass, I seen where I may have missed it, So I pulled in here, saw all the people, now I’m going to stick it out.”\nJay Smith is a local mechanic who came to support the truckers, sees the convoy as a show of solidarity.",
    "ZANESVILLE, Ohio – The truck’s are part of “The People’s Convoy” that left California last month for a cross country trip to Washington D.C. Convoy organizer’s say they are making the trip to promote freedom and liberty and to request an end to the state of emergency that led to overreaching mandates.",
    "Local onlookers like John Niceswanger and Jay Smith had heard reports about the convoy and showed up to witness the spectacle as well as show their support.",
    "Ohio has been without a mask mandate and health orders since last spring when they were lifted by Governor Mike Dewine.",
    "The guys that are out here, we’re standing behind them because they’re standing with us,” Smith said.",
    "“When I was coming down State Street, I seen everybody standing on the bridge,” Niceswanger said.",
    "They demand government accountability through full and transparent congressional hearings.",
    "“And Facebook this morning said they were going to be in Cambridge between 11 and 1.",
    "The convoy will stay overnight in Lore City at the Old Shenandoah truck stop.",
    "Many people lined the route of the convoy waving American flags.",
    "They’ll travel onto D.C. and arrive in the area by Saturday.",
    "“Freedom for, basically, the rest of us."
  ]
}