{
  "id": 17450,
  "mediaId": 8498,
  "date": "2022-02-28",
  "headline": "Boycotts of Russian products and groups spread, but the effects may be limited",
  "image": "https://woub.org/wp-content/uploads/2022/02/shutterstock_1765453394-1-e1646079348836.jpg",
  "link": "https://woub.org/2022/02/28/boycotts-of-russian-products-and-groups-spread-but-the-effects-may-be-limited/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emma Bowman | NPR",
  "authorUrl": "https://woub.org/post_author/emma-bowman-npr/",
  "termIds": [
    0
  ],
  "sentences": [
    "“So even if you start mixing your martinis with Absolut or Ketel One instead of Russian Standard, it is really not going to make much of a difference, especially when compared to some of the big, country-level economic sanctions that have been levied on Russia.”\nOksana Markarova, Ukraine’s ambassador to the United States, said that the recent vodka boycotts from U.S. and Canada businesses are “definitely not enough,” in a Sunday interview with ABC This Week.",
    "“The only Russian brands that you might find on the store shelves are Russian Standard and Green Mark vodkas, yet even their sales in North America make up only a minuscule amount of their global sales,” said Schrad, who wrote the 2014 book Vodka Politics: Alcohol, Autocracy and the Secret History of the Russian State.",
    "On Sunday, the Latvian club Dinamo Riga pulled out of the Russian-owned and run Kontinental Hockey League in response to the “military and humanitarian crisis.”\nPro-Moscow voices are also a target\nThe protests have spread in the arts world, too.",
    "Paul Isely, an economics professor at Grand Valley State University, told a Michigan ABC TV station that a squeeze on Russian vodka companies is unlikely to hurt the country’s economy, let alone sway Russian President Vladimir Putin.",
    "The news follows a similar move from the Rotterdam Philharmonic Orchestra and the Munich Philharmonic, with the latter giving conductor Valery Gergiev until Monday to retract his support for Russia’s military assault, or be fired.",
    "Some sports leagues are cutting ties with Russia\nFIFA on Sunday yanked international competitions hosted on Russian land “until further notice,” while allowing “home” matches to take place on neutral soil without spectators.",
    "0+1\n0Like\n0Share\n< < Back to\nWASHINGTON, D.C. (NPR) — As world governments step up their penalties against Russia over its invasion of Ukraine, businesses and consumers are protesting the country with sanctions of their own.",
    "“By boycotting a product, it can help show people across the world that the United States isn’t divided by these types of things.”\nSome establishments are confused about what products actually come from Russia.",
    "Clearing vodka from the shelves is largely symbolic\nGovernments and alcohol regulators across North America have either proposed or enacted boycotts against Russian vodka.",
    "The governors of both Utah and New Hampshire this past week ordered Russian-branded and Russian-made vodka to be pulled the shelves in government-run liquor stores.",
    "“Having this symbolism that says, yes, there’s a large group of people who are supporting this by showing it and doing this type of thing,” he told the ABC station.",
    "Mike DeWine moved to halt the purchase and sale of all vodka made by Russian Standard, a Russian-owned maker that sells its liquor under two names in the state.",
    "The international governing body of soccer said the country must play under its federation name, the Football Union of Russia, and without its flag and anthem.",
    "But as Mark Schrad, an associate professor of political science at Villanova University, notes, the Stoli vodka Americans drink is actually made in Latvia.",
    "England’s soccer league said its national teams won’t play Russia for the “foreseeable future.”\nOne of Putin’s favorite sports, ice hockey, isn’t immune.",
    "One of the world’s largest alcohol buyers, Canada’s Liquor Control Board of Ontario, said it’s removing all products made in Russia from its 679 stores.",
    "Nonetheless, Markarova pressed American businesses to take action against Russia and for the U.S. and its allies to level more sanctions.",
    "The Metropolitan Opera said on Sunday that it would end its relationships with artists who support Russian President Vladimir Putin.",
    "Our stance remains intact: Polish National Team will NOT PLAY with Russia, no matter what the name of the team is,” Kulesza tweeted.",
    "A growing range of Russian businesses, organizations and individuals are facing boycotts over their country’s invasion of Ukraine.",
    "In the U.S., less than 1% of vodka consumed is made in Russia, alcohol sales tracking firm IWSR Drinks Market Analysis told NPR.",
    "The FIFA decision drew criticism from European soccer affiliates that are implementing more restrictive bans against Russia.",
    "Poland, along with the Czech Republic and Sweden are refusing to play Russia in qualifying matches for the 2022 World Cup.",
    "Cezary Kulesza, president of Poland’s soccer federation, called FIFA’s decision “totally unacceptable,” in a tweet.",
    "But some people have questioned the effectiveness of such protests in terms of putting economic pressure on Russia.",
    "But the solidarity against Russia that vodka boycotts demonstrate is no small thing, Isely said.",
    "Kathy Hochul on Sunday ordered state agencies to stop doing business with Russian entities.",
    "A similar boycott in 2013, ahead of the Sochi Olympics, also impacted the distiller.",
    "A Vermont ski resort bar worker was not alone in pouring Stolichnaya down the drain.",
    "The maestro was dropped from previous performances over his pro-Putin views.",
    "Boycotters say these steps are meant to show solidarity with Ukraine.",
    "“We are not interested in participating in this game of appearances.",
    "Many businesses have already taken a stand.",
    "To see more, visit https://www.npr.org.",
    "Copyright 2022 NPR.",
    "New York Gov.",
    "In Ohio, Gov."
  ]
}