{
  "id": 17581,
  "mediaId": 8318,
  "date": "2022-03-03",
  "headline": "$10M in grants awarded to Ohio processors",
  "image": "https://s3-wp-lyleprintingandp.netdna-ssl.com/wp-content/uploads/2019/04/24120355/cattle-3886528_1280-e1556121863413.jpg",
  "link": "https://www.farmanddairy.com/news/10m-in-grants-awarded-to-ohio-processors/704833.html?utm_source=rss&utm_medium=rss&utm_campaign=10m-in-grants-awarded-to-ohio-processors",
  "mediaOutlet": "farmanddairy.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Other News",
  "authorUrl": "https://www.farmanddairy.com/author/othernews",
  "termIds": [
    0
  ],
  "sentences": [
    "Each company will receive a grant of up to $250,000, with half of the funds disbursed before projects are started and the other half awarded after the companies show that the initial funds were spent on eligible costs.",
    "The $10 million grant program, administered by the Ohio Department of Development in collaboration with the Ohio Department of Agriculture, generated tremendous interest from the meat processing industry.",
    "Governor Jon Husted announced that 40 Ohio livestock and poultry producers will receive grants totaling $10 million to help them expand capacity and meet the growing demand for meat processing services.",
    "Grant funding will be used to implement processing efficiencies, expand or construct facilities at existing sites, assist in training and certification and improve harvest services.",
    "In total, the businesses receiving awards have estimated that the funds will help them create up to 830 jobs, retain 300 jobs and nearly $30 million payroll.",
    "The funding was made available through the Ohio Meat Processing Grant Program, included in the state’s 2022-2023 operating budget.",
    "For more information about the grant, visit Development.Ohio.Gov/MeatProcessing.",
    "Grants were awarded on a first-come, first-served basis to eligible businesses.",
    "A total of 143 applications requesting more than $28 million were submitted.",
    "COLUMBUS — Ohio Governor Mike DeWine and Lt."
  ]
}