{
  "id": 17667,
  "mediaId": 8494,
  "date": "2022-03-04",
  "headline": "Cleveland’s gay bars fought to survive the pandemic. Will patrons return?",
  "image": "https://npr.brightspotcdn.com/dims4/default/ff4d94c/2147483647/strip/true/crop/1100x578+0+78/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fda%2F80b48655401fbb92b5182bcb89f9%2Fcocktails-13.jpg",
  "link": "https://www.wksu.org/economy/2022-03-04/clevelands-gay-bars-fought-to-survive-the-pandemic-will-patrons-return",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Kusnic",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Those are the places where the decline concerns me most,” Mattson said, “because losing that one place can mean losing the one spot where someone who is newly out or newly widowed can find connection with the community.”\nGay bar owners and managers in Cleveland acknowledge the decline, but said they’re not worried because they understand the need they fill for many parts of the LGBTQ+ community.",
    "“But also, I think the pandemic reminded us that virtual interactions aren’t always a substitute for the in-person pleasure of sitting next to a stranger and getting to know someone who’s perhaps different from you, whether in terms of generation or ethnicity or hometown.”\nAs the dust of the pandemic settles, Cleveland’s gay bars are adapting to a new landscape.",
    "Cocktails stopped doing live shows – previously a reliable entertainment staple on Friday and Saturday nights – but people started coming more often for the laid-back, everybody-knows-your-name atmosphere of both the main bar upstairs and the newly revamped second bar in the basement, said Tasker, the manager at Cocktails.",
    "“What are they going to do?”\nThe Payroll Protection Program eventually helped cover employee wages for Vibe and other gay bars in Cleveland, but business owners had to dig into their own pockets to cover other expenses: internet, utilities, maintenance costs.",
    "The number of LGBTQ+ bars and clubs has dwindled from a high-water-mark of over two dozen establishments serving a wide array of community niches in the 1970s and 1980s, to just six gay bars, most small establishments, when the pandemic struck.",
    "A professor of LGBTQ+ social history at Oberlin, Mattson has interviewed more than 130 LGBTQ+ bar and club owners in 37 states as part of his work researching the decline in the number of these businesses nationwide over the past two decades.",
    "Mattson, the researcher at Oberlin, said the bars most likely to succeed post-COVID will be those that are deeply involved in their community, support other community organizations, and reach out to serve the vast diversity of LGBTQ+ people.",
    "“Times have changed,” said Tasker, the manager at Cocktails, “but I think some people will always feel more comfortable going to a gay bar.”\nFor that reason alone, he thinks there will always be at least one gay bar in Cleveland.",
    "Ken Myers, who has owned the Leather Stallion Saloon, near downtown Cleveland since 2014 and officially the city’s oldest operating gay bar, said that keeping a gay bar afloat – even before the pandemic – could be difficult.",
    "You could feel that energy at the bar.”\nIn the year-plus since vaccines and boosters were made widely available and government health orders on businesses were lifted, people have begun doing more of what they used to do.",
    "Studio West 117, the newest addition to Cleveland's LGBTQ+ nightlife scene, actually opened during the pandemic and is already sporting a full slate of events in The Symposium, a \"true gay dive bar atmosphere.\"",
    "Depending on the night, the dance floor at Twist is packed, the pool tables at Cocktails are full, the stage at Vibe is booked, and the (heated) patio at the Leather Stallion Saloon is the place to be.",
    "Nevertheless, COVID is still here, and many people who used to go to gay bars before the pandemic are still staying home, some out of an abundance of caution and others because of lifestyle changes.",
    "“We’re in it for the community, not to make money, we’re just trying to do our best.”\nNearly two years into the pandemic, things have returned to some semblance of normal at Cleveland’s gay bars.",
    "With the rise of dating apps and social acceptance of LGBTQ+ people, community members in Cleveland and other cities around the country now have a lot more options when it comes to connecting.",
    "This story is sponsored by the Northeast Ohio Solutions Journalism Collaborative, which is composed of 16-plus Northeast Ohio news outlets including WKSU and Ideastream Public Media.",
    "Gay bars and nightclubs in Cleveland and nationally had been closing at high rates for more than a decade before the pandemic, according to research by an Oberlin College professor.",
    "To lure customers back, most bars redecorated or made other renovations like expanding and weatherizing patio areas, which became popular features in the era of social distancing.",
    "He attributes the Leather Stallion’s survival to its roots in the leather and greater fetish community, which the bar will welcome back in full force when CLAW returns in April.",
    "They’ve often survived by tapping federal Covid relief for small businesses and by coming up with programming that has appealed to patrons’ desires for Covid-safe entertainment.",
    "Even with such events, remaining open before the pandemic was difficult for many such establishments, says Greggor Mattson, a professor of LGBTQ+ social history at Oberlin.",
    "Despite the historic decline of LGBTQ+ bars and clubs, they remain the most common LGBTQ+ space – particularly in suburbs and rural areas lacking in other friendly spaces.",
    "“But if the customers don’t support and keep supporting their local gay bars, they will become a memory.”\nPeter Kusnic is a writer and editor based in Cleveland, Ohio.",
    "“I think people are going out more now than they used to,” said Jim Tasker, who has managed Cocktails, a bar in the Cudell neighborhood, for nearly three decades.",
    "Although many people drank more during the pandemic, there are indications that some people -- especially Millennials -- are cutting back on drinking.",
    "Like many entertainers, she took her routine online to stay connected with her audience during the pandemic but missed the rush of a live audience.",
    "And, in cities lucky enough to have them, LGBTQ+ centers and other community-oriented spaces provide still more places to meet other than a bar.",
    "Like other gay bar owners in town, Briggs and his husband had other sources of income to keep the lights on through the three-month shutdown.",
    "Social-distancing requirements limited the number of people who could be served and fear of COVID-19 restrained the number who wanted to be.",
    "Over time, we’ve acquired more.”\nAdvances in technology and sociological changes were stressing gay bars even before the pandemic, he said.",
    "He and his husband John had owned Vibe Bar & Patio, a gay bar on Lorain Avenue near West 117th Street in Cleveland, for only about a year.",
    "When Governor Mike DeWine ordered bars and clubs to shut down in March 2020 to stop the spread of the coronavirus, Kevin Briggs panicked.",
    "The rise of the Delta and Omicron variants caused further disruptions in business for many places, raising concerns about future waves.",
    "While countless other small businesses in the city have shut down permanently, Cleveland’s gay bars have so-far survived the pandemic.",
    "Some expanded programming, adding enticements such as drag shows, go-go dancers, karaoke, trivia, open-mic nights and other events.",
    "Events that bring customers and additional revenue to town – like CLAW, the national annual leather event downtown – were canceled.",
    "Early in the pandemic, they didn’t know how long the shutdown would last or if their fledgling business would survive it.",
    "And as the pool of customers remains smaller than before the pandemic, some venues are struggling while others thrive.",
    "At Vibe, for instance, Briggs launched new events on Mondays, Tuesdays and Wednesdays, hoping business would pick up.",
    "Pride flags fly outside of all types of businesses – from board game cafes to coffee shops in addition to other bars.",
    "“To some degree it’s a historical accident that bars would be the one place queers could find each other,” he said.",
    "Briggs remembers the anxiety he felt when he first learned of the shutdown, long before vaccines were available.",
    "“That’s what the places that have survived here in Cleveland are doing or have moved to do much more,” he said.",
    "The Hawk boasts a steady roster of regulars and Old Brooklyn's Shade is steadily building faithful clientele.",
    "Sassy Sascha, a cis-female drag queen who hosts events at Vibe, Twist, and other venues throughout the city.",
    "And while most people obeyed mask mandates and social-distancing rules, others resisted the health orders.",
    "“We’re about back to where we were at before the pandemic, attendance-wise,” said Sascha Mascias, a.k.a.",
    "Vibe and the handful of Cleveland gay bars and nightclubs in business before the pandemic, remain open.",
    "“We lose money, that’s one thing, but I was really\nfreaking out about my employees,” Kevin Briggs said.",
    "“That suggests to me that the most vulnerable gay bars had closed before the pandemic,” Mattson noted.",
    "“Whether or not Cocktails is still here in 15 years – I hope so; [even though] I won’t be!,” he quips.",
    "“Bars have never been the totality of the LGBTQ+ community, but they’ve been important tent poles.",
    "“A lot of people don’t understand that many of these businesses are labors of love,” Myers said.",
    "His research shows that 37% of gay bars and clubs nationwide closed between 2007 and 2019.",
    "Meanwhile, other bars haven’t changed much at all, relying on a built-in base of regulars.",
    "“We all have our crowds and the different things each bar is known for,” said Myers.",
    "“We didn’t do weekday events before, and it’s definitely helping,” Briggs said.",
    "Greggor Mattson, whose partner is immunocompromised, is one of those people.",
    "“It’s like they were so bottled up for so long from all the restrictions.",
    "That rate has been much higher in Cleveland due to population declines.",
    "For the gays of Cleveland in particular that often means going out.",
    "“It’s going to be a while before we’re back at the bars,” he said.",
    "“The bills didn’t stop just because we were closed,” said Briggs.",
    "But the subsequent reopening in May posed further challenges.",
    "There were new expenses – masks, sanitizers, signage.",
    "“Whatever we’re doing, it’s working,” he said.",
    "Also alcohol consumption habits are changing.",
    "“The show must always go on!” Mascias said.",
    "Would the pandemic add to these closures?",
    "“COVID willing,” Myers said dryly.",
    "But that’s really up to patrons.",
    "Cruising has become app-based.",
    "Not in Cleveland."
  ]
}