{
  "id": 205,
  "mediaId": 8283,
  "date": "2022-02-22",
  "headline": "Ohio Redistricting: Maps for legislative, congressional districts in limbo as primary looms",
  "image": "https://www.gannett-cdn.com/presto/2022/01/18/NCOD/be00dee9-b363-44ea-9189-39d94438f666-Ohio_Redistricting_Commission_KWR_05.jpg?crop=2499,1406,x0,y100&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/politics/elections/2022/02/22/ohio-redistricting-mapmakers-take-2nd-crack-congressional-map/6878298001/",
  "mediaOutlet": "chillicothegazette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    0
  ],
  "sentences": [
    "Senate President Matt Huffman, R-Lima, said Tuesday that he didn't believe it was impossible to draw maps that complied with the Ohio Constitution's anti-gerrymandering language and multiple court orders – simply that it couldn't be done in 10 days when starting from scratch.",
    "The commission has until mid-March to pass a map for Ohio's 15 congressional districts – boundaries for the lawmakers who represent Ohioans in Washington, D.C. Ohio recently lost a congressional district because its population grew at a slower rate than the nation's.",
    "It's not clear whether these state House and Senate maps, mentioned publicly for the first time Tuesday, would prevent the Ohio Supreme Court from holding the Ohio Redistricting Commission in contempt of its court order to pass new legislative maps.",
    "“We just didn’t have a viable product prior to the 10-day deadline for a variety of reasons, and we’ve been working on them since then,” said Huffman, whose staff has been crafting a third set of legislative maps with House GOP employees.",
    "Auditor Keith Faber said he's open to starting with other maps, including one proposed by Stanford professor Jonathan Rodden as an alternative to commission-approved maps or one offered by Democrats in the first round of redistricting.",
    "Huffman did not disclose the partisan breakdown of the maps Republicans had been working on, saying instead: \"It's one that has to be compliant with the court's order and so that gives you a pretty good idea about what it looks like.\"",
    "American Civil Liberties Union of Ohio attorney Freda Levenson, who has sued the commission over maps, said her interpretation is that the commission could pass either a four-year map or a 10-year map.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "Talk of possible new statehouse maps overshadowed the short meeting of the Ohio Redistricting Commission Tuesday, which was slated as an opportunity to get started on a new congressional map.",
    "Ohio Secretary of State Frank LaRose was tasked with certifying the official ballots Tuesday, but the ballots cannot include details on legislative races because the maps are not finalized.",
    "After failing to pass state House and Senate maps last week, Republicans on the seven-member commission now say they could present new legislative maps in the coming days.",
    "If maps for statehouse and congressional maps are approved this week, that could fend off a delayed primary, which is currently set for May 3.",
    "But Sen. Vernon Sykes, D-Akron, told reporters that he was “interested in any avenue\" that would give the commission a pathway to new maps.",
    "Unlike the rules for statehouse districts, the Ohio Constitution doesn't expressly forbid the court from drawing congressional districts.",
    "\"There's no reason we don't wrap up the congressional maps in such time that people can file on the March filing deadline,\" Faber said.",
    "Ohio is one of eight states that hasn't finalized its congressional map yet, according to FiveThirtyEight's redistricting tracker.",
    "The commission faces another deadline: the date for congressional candidates to file paperwork to run is March 4.",
    "That could give the court some wiggle room if the commission passes another unconstitutional map, Levenson said.",
    "The Ohio Supreme Court rejected the commission's first map, which could have given Republicans a 12-3 advantage.",
    "In a 4-3 decision, the majority ruled that the map unfairly favored Republican candidates over Democratic ones.",
    "On a commission that has agreed on little else, members seemed united in their desire to make some progress.",
    "The commission's two Democrats said they hadn't been involved in drawing new state House and Senate maps.",
    "But the language is new, passed by voters in 2018, so the Ohio Supreme Court could read it differently.",
    "\"Courts have drawn maps or hired special masters to draw maps or regulate the process,\" Levenson said.",
    "Now the task falls to the Ohio Redistricting Commission, which has yet to pass a constitutional map.",
    "The court requested an explanation of the commission's actions – or inactions – by noon Wednesday.",
    "Senate President Huffman said the map could be enacted with only GOP support and last four years.",
    "\"I'm hoping in the next couple days we can have something that we can present to the commission.\"",
    "The court asked Ohio lawmakers to fix it, but legislators didn't get the job done after 30 days.",
    "Mike DeWine put it simply: \"We have an obligation to produce a map and we need to do that.\"",
    "That's not to say the Ohio Supreme Court will take that step, simply that it's an option.",
    "It's not clear when Republicans will introduce a new proposal for Ohio's 15 districts.",
    "Democrats and Republicans on the commission disagree over how long the map could last.",
    "Ohio Attorney General Dave Yost, in a letter to lawmakers, said that was a problem.",
    "Democrats have already proposed a map that would give the GOP an 8-7 advantage.",
    "Democrats argued that any map must have their support and must last 10 years.",
    "Once the commission approves a map, the Ohio Supreme Court will review it.",
    "\"We are dealing with a new amendment to the Constitution,\" Levenson said.",
    "What happens in Ohio will affect the national political picture, too.",
    "Reporter Mary Jane Sanese contributed to this article.",
    "“I am interested in making progress,\" he said.",
    "What's happening with the congressional map?",
    "The delays are starting to have an effect.",
    "Gov."
  ]
}