{
  "id": 2075,
  "mediaId": 8491,
  "date": "2022-02-09",
  "headline": "Cleveland ready for NBA All-Star tip-off",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/02/NBA_AS22_Court.jpg?w=1280",
  "link": "https://www.wkbn.com/sports/cleveland-ready-for-nba-all-star-tip-off/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Talia Naquin",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here’s a list of starters for the Feb. 20 game:\nLeBron James, of the Los Angeles Lakers\nKevin Durant, of the Brooklyn Nets\nStephen Curry, of the Golden State Warriors\nGiannis Antetokounmpo, of the Milwaukee Bucks\nNikola Jokic, of the Denver Nuggets\nDeMar DeRozan, of the Chicago Bulls\nJa Morant, of the Memphis Grizzlies\nJoel Embiid, of the Philadelphia 76ers\nAndrew Wiggins, of the Golden State Warriors\nTrae Young, of the Atlanta Hawks\nThe 2021 NFL Draft held in Cleveland was touted as a success for the city.",
    "Before participating in any ticketed event, guests 5 and up will need to show proof of being fully vaccinated against COVID-19 or of having a negative COVID-19 test, a negative PCR test 48 hours before their first event or a negative Antigen test the day of their first event, Komoroski shared.",
    "Jon Husted joined representatives from the Cleveland Cavaliers, Destination Cleveland and the Ohio Department of Development for a question-and-answer session on the festivities.",
    "Tickets are not available for the All-Star game or the events Saturday night, Len Komoroski, CEO of Cleveland Cavaliers and Rocket Mortgage FieldHouse shared.",
    "Komoroski said the process of verifying vaccinations would be similar to how they have handled it for events like the Rock Hall Induction Ceremony.",
    "CLEVELAND (WJW) – Cleveland is getting ready to return to the center of the sports world when NBA All-Star 2022 rolls into Ohio.",
    "The Cleveland Cavaliers don’t have any starters in the game however, guard Darius Garland will represent the team as a reserve.",
    "24 of the NBA’s star players will play in an exhibition game at Rocket Mortgage FieldHouse that weekend.",
    "Wednesday, organizers will talk about what’s coming during the big event.",
    "Husted says the event will have an economic impact of $100 million.",
    "Destination Cleveland released a hype video to FOX 8 for the event.",
    "The NBA is also celebrating its 75th anniversary season.",
    "There are several fan events on the schedule.",
    "The 3-day event kicks off Friday, Feb. 18.",
    "Click here for the schedule of events.",
    "Mike DeWine and Lt. Gov.",
    "Ohio Gov."
  ]
}