{
  "id": 2190,
  "mediaId": 2537,
  "date": "2022-02-09",
  "headline": "National Guard to assist with COVID-19 for one more week, Hamilton County officials say",
  "image": "https://www.gannett-cdn.com/presto/2022/01/24/PCIN/1247aabf-2e49-4b03-8a22-bd44d30ba16a-COVID19_National_Guard_at_UC_Health.jpg?crop=3599,2024,x0,y173&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/02/09/covid-19-ohio-national-guard-stick-around-cincinnati-hospitals-week-after-super-bowl/6720304001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooks Sutherland",
  "authorUrl": "https://www.cincinnati.com/staff/6341521001/brooks-sutherland/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"There still remains to be this hesitancy, or I don't even know if it's hesitancy anymore, (but there's) questions that cause people to wonder why they need to take the vaccine,\" Harris said at the briefing, detailing a report her organization conducted in which 168 people were surveyed and 47% reported they were not vaccinated.",
    "Speaking at a weekly COVID-19 briefing, Hamilton County Health Commissioner Greg Kesterman said the guard will leave as the demand for testing has declined significantly, but noted the members have committed to sticking around for another week after Super Bowl 56 just in case the county sees any increases.",
    "As novel coronavirus cases continue to plummet downward and testing in the region has decreased dramatically, Hamilton County health officials said Wednesday the Ohio National Guard has committed to one more week of assistance before it will be dismissed from hospitals and test sites.",
    "While the massive drop in cases and hospitalizations continues to be a good sign for the region, the officials warned that Cincinnati isn't completely out of the woods with the virus, urging the public to continue to stay home when sick and urge those who haven't to become vaccinated.",
    "As of Monday, 62% of all county residents had completed the process of receiving the vaccine, but Renee Mahaffey Harris, president and chief executive officer of the Center for Closing the Health Gap, said a mistrust still exists.",
    "Harris said her organization is working on conversations about getting children vaccinated following the report, which revealed that 81% of the survey's participants said they wouldn't vaccinate their children.",
    "\"I hope we don't see a spike after the Super Bowl, but they've been gracious to say that they'll hang around another week,\" Hamilton Commissioner Denise Driehaus said of the guard.",
    "\"I think it's still worth pointing out that 616 individuals within our hospital systems is still a very high number for our community,\" Kesterman said.",
    "The discharge comes as the seven-day case average in Hamilton County dropped from 2,470 per day on Jan. 16 to 309 cases per day as of Wednesday.",
    "Hospitalizations in the region fell to 616 as of Wednesday with 130 individuals in the intensive care unit and 101 patients using ventilators.",
    "\"Our kids getting vaccinated are the biggest key to how we address this state of COVID cases in our country and in our community,\" she said.",
    "Mike DeWine to send nearly 200 guard members to the Cincinnati region to assist with hospitals and help facilitate testing in January.",
    "\"So, our hospitals are still being impacted, our physicians, our nurses, and our care teams are certainly still exhausted.\"",
    "Officials have found no link however to spikes in cases or spread due to Bengals playoff games this year, Kesterman said.",
    "\"We want to make sure we have capacity here in Hamilton County,\" he said at the virtual meeting.",
    "Officials remain persistent in efforts to get more individuals vaccinated.",
    "\"...Where our focus is, is making sure that we continue the conversation.\"",
    "For much of January, hospitalizations hovered around 1,000 in the region.",
    "The winter surge of COVID-19 due to the omicron variant spurred Gov.",
    "Last week, the region surpassed 5,000 deaths."
  ]
}