{
  "id": 2196,
  "mediaId": 8497,
  "date": "2022-02-08",
  "headline": "3-year-old boy in need of new heart capturing community's heart as he roots for Bengals in Super Bowl",
  "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/sammy-heart-transplant-1644012364.png?crop=0.931xw:1.00xh;0.0353xw,0&resize=1200:*",
  "link": "https://www.wlwt.com/article/3-year-old-boy-in-need-of-new-heart-capturing-communitys-heart-as-he-roots-for-bengals-in-super-bowl/39010967",
  "mediaOutlet": "wlwt.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Megan Mitchell",
  "authorUrl": "https://www.wlwt.com/news-team/b7950bf7-f263-4793-886a-e1ad77eb4900",
  "termIds": [
    0
  ],
  "sentences": [
    "Things took a turn in December and now he needs a new heart, so he's at Cincinnati Children's, being kept on a machine that keeps his blood pumping.",
    "Sammy will have to stay in the hospital until he finds a heart, but they already have their party planned with nurses and hospital staff for Sunday.",
    "Mike DeWine gave Sammy a shoutout on Twitter, and a grassroots effort was started to get a game ball from the AFC Championship game to Children's.",
    "The Bengals' winning season and trip to the Super Bowl are giving Sammy something to look forward to while stuck in the hospital.",
    "CINCINNATI —\nBengals fans young and old, new and seasoned are all excited for the team's chance to make history.",
    "He's just really jacked up like any other fan in the stands, we're just stuck in this room watching football.\"",
    "\"So we can't be far at all from this machine and can't leave the floor,\" said Sammy's father, Garland Jones.",
    "He yells it at every one of them and he has decked out his room, arms and heart machine in Who Dey swag.",
    "\"It's just mentally, physically and emotionally exhausting,\" explained Sammy's mother, Courtney Jones.",
    "\"Daddy, when's football coming on,\" he asked his father ahead of the Bengals' trip to the Super Bowl.",
    "But one young fan is determined to show his stripes even from a hospital bed.",
    "When he plays the Madden video games, he always chooses to be the Bengals.",
    "He watches the games, and then the highlights, over and over on his TV.",
    "A tiny Bengals fan who's bringing a lot of heart to a tough situation.",
    "He may only be 3, but he already knows a lot about his favorite team.",
    "It's a call the nurses have gotten used to hearing from his room.",
    "No surprise there, his favorite part, and player, is Joe Burrow.",
    "Sammy has a bad heart and has had multiple open-heart surgeries.",
    "Superman Sammy, like many other 3-year-olds, has many questions.",
    "\"It just puts him in a good mood,\" Garland said.",
    "Like his favorite part about the game?",
    "\"He just gets excited.",
    "Sammy is a super fan.",
    "Last week, Ohio Gov.",
    "\"Quarterback.\"",
    "\"Who Dey!!!\""
  ]
}