{
  "id": 2301,
  "mediaId": 8480,
  "date": "2022-02-08",
  "headline": "5 local police departments to receive grants",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/02/GettyImages-1311901568.jpg?w=1280",
  "link": "https://www.wdtn.com/news/ohio/5-local-police-departments-to-receive-grants/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katie Shatsby",
  "authorUrl": "https://www.wdtn.com/author/katie-shatsby/",
  "termIds": [
    0
  ],
  "sentences": [
    "“The agencies receiving grants today have all developed plans that will help them recruit more qualified job candidates, particularly women and minorities who oftentimes face barriers to employment in criminal justice careers.”\nLaw enforcement agencies and their total awarded grant money are as follows:\nAkron Police Department $58,733.80\nBellefontaine Police Department $18,960\nBoardman Police Department $25,000\nCincinnati Police Department $67,500\nClark County Sheriff’s Office $58,248.80\nMedina County Sheriff’s Office $18,270\nSidney Police Department $36,945\nSummit County Sheriff’s Office $61,069\nToledo Police Department $29,000\nUpper Arlington Police Divison $10,600\nWest Carrollton Police Department $8,093.90\nXenia Police Department $32,450.28",
    "“Law enforcement is a distinguished and honorable profession, but agencies all over the country are facing serious shortages in new recruits, which is dangerous for the current workforce and for the citizens they serve and protect,” said Governor DeWine.",
    "According to DeWine, agencies from Clark, Franklin, Greene, Hamilton, Logan, Lucas, Mahoning, Medina, Montgomery, Shelby and Summit counties will receive grants as part of the first round of funding offered through the Recruitment Grant program.",
    "With support from the Ohio Office of Law Enforcement Recruitment, DeWine announced that 12 law enforcement agencies, including five local departments, will strengthen their recruitment efforts through grants.",
    "COLUMBUS, Ohio (WDTN) – Governor Mike DeWine announced on Tuesday that 12 law enforcement agencies will strengthen their recruitment efforts through grant funding."
  ]
}