{
  "id": 2311,
  "mediaId": 8360,
  "date": "2022-02-08",
  "headline": "Ohio Supreme Court invalidates legislative maps for second time",
  "image": "https://i0.wp.com/www.lovelandmagazine.com/wp-content/uploads/2021/12/ohiosupremecourt.jpg?fit=800%2C600&ssl=1",
  "link": "https://www.lovelandmagazine.com/ohio-supreme-court-invalidates-legislative-maps-for-second-time/",
  "mediaOutlet": "lovelandmagazine.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "SUSAN TEBBEN",
  "authorUrl": "https://ohiocapitaljournal.com/author/susan-tebben/",
  "termIds": [
    0
  ],
  "sentences": [
    "It was clear, according to supreme court justices, that the commission knew the approach of starting with the invalidated map and switching some competitive Republican districts to competitive Dem-leaning districts “would have the dual effect of eliminating weak Republican districts and creating weak Democratic districts.”\n“This was not the process that our decision contemplates, and the commission’s awareness of the partisan effects supports an ‘inference of predominant partisan intent’ similar to the one we found with respect to the original plan,” the majority justices wrote.",
    "Because the majority opinion does not allow the map to stand as a four-year map, as the constitution states happens with a simple majority vote for adoption, Fischer said invalidating the maps “impinges upon the citizens’ right to vote in two General Assembly elections according to the terms of (redistricting constitutional amendment) Article XI.”\nHe also argued that the constitution does not define the “threshold to having been drawn ‘primarily to favor’ a political party,” yet another reason he said the court should not be making the blanket decision to invalidate the maps.",
    "In a 4-3 split, Chief Justice Maureen O’Connor, Justice Michael Donnelly, Justice Melody Stewart and Justice Jennifer Brunner ordered that the Ohio Redistricting Commission convene for the third time and “draft and adopt an entirely new General Assembly-district plan that conforms with the Ohio Constitution.”\nThe ORC now has until Feb. 17 to file a new plan with the Ohio Secretary of State’s office, and a copy with the court by the next morning.",
    "“It is apparent that in disregard of constitutional standards, four members of this court have now commandeered the redistricting process and that they will continue to reject any General Assembly-district plan until they get the plan they want,” Kennedy and DeWine wrote.",
    "They said the court should “not demand exact proportionality when there is scant evidence that it is possible to draw districts that are exactly proportional to the partisan preferences of Ohio voters” without violating other constitutional map-drawing requirements.",
    "The GOP said they had made their best attempt at meeting the 54-46 split the supreme court had asked for, with House Speaker and commission co-chair Bob Cupp saying the court was not asking for perfection, but for an attempt at less partisanship.",
    "Fischer accused the majority justices of being “seemingly more interested in making policy than enforcing the Constitution’s text as written.”\nObjections will be allowed in this third attempt, just as they were in the second revision of the map.",
    "Fischer agreed in a separate dissent that the majority “does not follow the text of the Ohio Constitution.”\n“The majority opinion again attempts to exercise authority not granted to this court by the state Constitution,” Fischer wrote.",
    "“DiRossi and Springhetti started with the same plan that we invalidated and then merely adjusted certain districts just enough so that they could nominally be reclassified as ‘Democratic-leaning,” the majority of the court wrote.",
    "The majority torched mapmakers Ray DiRossi and Blake Springhetti for using the previously invalidated map as a starting point for the revised map, and said that was not what the court wanted when they struck down those maps.",
    "“The (Ohio Redistricting Commission’s) choice to avoid a more proportional plan for no explicable reason points unavoidably toward an intent to favor the Republican Party,” the majority wrote in a Monday ruling.",
    "Kennedy and DeWine argued that the court overextended its power in invalidating the map as a whole, and that the revised map, in their eyes, does not violate the partisanship standard within the constitution.",
    "Susan Tebben is an award-winning journalist with a decade of experience covering Ohio news, including courts and crime, Appalachian social issues, government, education, diversity and culture.",
    "Justices Sharon Kennedy, Patrick DeWine and Patrick Fischer all dissented for many of the same reasons they disagreed with the majority in invalidating the previous legislative maps.",
    "After adopting a new map with a 5-2 party-line vote, the group sent the court a map with a 57-42 split in the House, and a 20-13 split, keeping the GOP majority in both chambers.",
    "The court called up the partisanship standard in their majority opinion on the revised maps, once again observing that the maps were made with GOP favoritism in mind.",
    "The Ohio Supreme Court has sent back the state’s legislative redistricting maps yet again, rebuffing GOP claims that they attempted to bring about a partisan balance.",
    "DeWine, who is the son of ORC member and Governor Mike DeWine, chose not to recuse himself from the case, saying he saw no conflict of interest in judging the case.",
    "Several districts were considered “toss up” districts, despite the GOP calling them “Democratic leaning” during their map presentation.",
    "The court previously rejected the map approved by the commission in September, giving the ORC 10 days to revise the maps.",
    "“We retain jurisdiction for the purpose of reviewing the new plan,” the majority stated in the Monday opinion.",
    "She has worked for The Newark Advocate, The Glasgow Daily Times, The Athens Messenger, and WOUB Public Media.",
    "Those wanting to file an objection to the map have three days after the plan is filed with the court.",
    "She has also had work featured on National Public Radio.",
    "MORE FROM AUTHOR"
  ]
}