{
  "id": 2382,
  "mediaId": 8496,
  "date": "2022-02-09",
  "headline": "Ohio Gov. Mike DeWine, local officials, discuss NBA All-Star Game in Cleveland",
  "image": "https://media.wkyc.com/assets/WKYC/images/59f9a2cb-548e-4439-9b4b-ba6a6d873135/59f9a2cb-548e-4439-9b4b-ba6a6d873135_1140x641.jpg",
  "link": "https://www.wkyc.com/article/sports/nba/nba-all-star-game/ohio-gov-mike-dewine-local-officials-discuss-nba-all-star-game-cleveland/95-622e8e69-71d3-49c7-ba9c-c207e551f9ef",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2143,
    5656,
    4736,
    288,
    852,
    6067,
    6474
  ],
  "sentences": [
    "Governor of the State of Ohio\nLydia Mihalik — Moderator and Director of the Ohio Department of Development\nDavid Gilbert — President and CEO of Destination Cleveland/Greater Cleveland Sports Commission\nLen Komoroski — CEO of the Cleveland Cavaliers/Rocket Mortgage FieldHouse\nThe primary message of Wednesday's press briefing was to encourage potential visitors from Ohio and surrounding states to join the fun as Cleveland serves as the epicenter of the NBA universe next week.",
    "NBA All-Star Weekend will kickoff on Friday, Feb. 18 with the opening of NBA Crossover, a \"weekend-long fan event will showcase the intersection of basketball culture through art, fashion, music, technology and entertainment that surround today’s game.\"",
    "CLEVELAND — With nearly a week to go until the start of the 2022 NBA All-Star Weekend in Cleveland, Ohio Governor Mike DeWine and local officials held a virtual press briefing to discuss the event.",
    "ET on Saturday night, Rocket Mortgage FieldHouse will play host to NBA All-Star Saturday Night, with events including the Skills Challenge, 3-Point Contest and Dunk Contest.",
    "Friday night will also mark the annual Rising Stars Game at Rocket Mortgage FieldHouse, as well as the league's Celebrity Game, which will be played at the Wolstein Center.",
    "On Saturday, the men's basketball teams from Howard University and Morgan State University will square off in the first-ever HBCU Classic at 2 p.m.",
    "Then on Sunday, Rocket Mortgage FieldHouse will play host to the 71st annual NBA All-Star Game, which will tip-off at 8 p.m.",
    "Joining DeWine, who delivered the opening remarks on Wednesday, were the following officials from \"Ohio.",
    "The press conference comes nearly a week before the start of NBA All-Star Weekend in Cleveland.",
    "Find It Here,\" the Cleveland Cavaliers and Destination Cleveland:\nJon Husted — Lt.",
    "The weekend will also serve as a celebration of the league's 75th anniversary.",
    "ET at the Wolstein Center.",
    "At 8 p.m.",
    "ET."
  ]
}