{
  "id": 2487,
  "mediaId": 8494,
  "date": "2022-02-08",
  "headline": "One Ohio Christian group suggests chief justice could be impeached, but another stays mostly quiet",
  "image": "https://npr.brightspotcdn.com/dims4/default/ac9bebb/2147483647/strip/true/crop/4032x2117+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2Fe8%2Faa%2F920b279b4b67b0bd3a632704c7cd%2Faaron-baer.jpg",
  "link": "https://www.wksu.org/government-politics/2022-02-08/one-ohio-christian-group-suggests-chief-justice-could-be-impeached-but-another-stays-mostly-quiet",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "After the 4-3 ruling rejecting the latest legislative maps, in which Chief Justice Maureen O’Connor once again sided with the Court's minority Democratic justices, the Ohio Christian Alliance issued a statement that said O’Connor could face impeachment because of her “rogue manner” and that’s she’s joined “the radical left by trying to disrupt the 2022 mid-terms.”\nThe Ohio Christian Alliance has this response: “It's time to move on and ignore the court” and if Chief Justice O’Connor “wants to continue in her rogue manner, as she has obviously joined the radical left by trying to disrupt the 2022 mid-terms, she may be facing impeachment.” pic.twitter.com/V06TRM71SV\n— Karen Kasler (@karenkasler) February 8, 2022\nThe Court ruled the maps were unconstitutional based on the 2015 amendment approved overwhelmingly by voters.",
    "One of the state’s leading Christian coalitions has strong words for the Republican Chief Justice of the Ohio Supreme Court after she and the court’s Democrats struck down the latest set of House and Senate maps from the Republican-dominated Ohio Redistricting Commission.",
    "Mike DeWine who’s on the redistricting commission, wrote “one must wonder which seven-member body is the true redistricting commission—the constitutionally named officers or this court?\"",
    "But Aaron Baer with the group Center for Christian Virtue said his organization hasn’t commented on redistricting so far and isn't doing so now.",
    "We’ve got our plate pretty full here at CCV.”\nOn Tuesday, CCV announced its opposition to the potential legalization of marijuana in Ohio.",
    "The ruling said the maps failed to meet the state's constitutional requirement for maps to reflect the partisan voter preference of Ohio.",
    "The first ruling in the maps case indicated voters have split about 54% Republican and 46% Democratic in statewide elections.",
    "But at the same time, we’re focused now on telling people about the dangers of marijuana, trying to pass the Backpack Bill.",
    "The organization has been championing the universal school voucher measure known as the \"Backpack Bill\" for a few months.",
    "But he did say, \"We’re frustrated by the Court’s stepping in an area where they very clearly don’t have authority.",
    "The maps would likely give Republicans 57% of the seats in the Statehouse for the next two years.",
    "In one of the two dissents, Justices Sharon Kennedy and Pat DeWine, son of Gov.",
    "Baer's remark echoes the comments from the court’s three Republicans.",
    "But another influential Christian group isn’t saying much.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau."
  ]
}