{
  "id": 2666,
  "mediaId": 8494,
  "date": "2022-02-09",
  "headline": "Morning Headlines: Suspect in Akron teen’s 2020 shooting death arrested; Peloton pulls the plug on Toledo factory",
  "image": "https://npr.brightspotcdn.com/dims4/default/d92388e/2147483647/strip/true/crop/1760x924+0+188/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F93%2F26%2F61aeb0a345f7820dfa262905eab3%2Fdownload.jpg",
  "link": "https://www.wksu.org/2022-02-09/morning-headlines-suspect-in-akron-teens-2020-shooting-death-arrested-peloton-pulls-the-plug-on-toledo-factory",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Wednesday, February 9:\nSuspect in Akron teen’s 2020 shooting death arrested\nPeloton pulls the plug on Toledo factory\nAppeals court rules in Biden’s favor on abortion referrals\nMarijuana legalization issue draws divisions\nFamily of Canton man killed by police on NYE asking city to release officer’s name\nSuper Bowl Sunday to be 'Cincinnati Bengals Day' in Ohio\nSuspect in Akron teen’s 2020 shooting death arrested\n(WKSU) -- An arrest has been made in the 2020 shooting death of an 18-year-old Akron woman.",
    "Family of Canton man killed by police on NYE asking city to release officer’s name\n(Canton Repository) -- The family of a Canton man shot and killed by police after firing celebratory rounds into the air on New Year’s Eve is asking the city to release the officer’s name.",
    "The changes returned the program to how it ran under the Obama administration\nMarijuana legalization issue draws divisions\n(Statehouse News Bureau) -- A battle over whether to legalize marijuana is taking shape at the Ohio Statehouse.",
    "Circuit Court of Appeals said the new Department of Health and Human Services regulations for the Title X family planning program can remain in place during the states’ challenge.",
    "Appeals court rules in Biden’s favor on abortion referrals\n(AP) — A court has allowed federally funded family planning clinics to continue to make abortion referrals for now.",
    "In a statement, DeWine says the Bengals have had a great season and \"hopefully they can win once more to bring home Ohio's first Super Bowl championship and tenth NFL title!\"",
    "Video footage shows the white officer, firing without warning through a privacy fence after Williams, who is Black, fired a burst of rounds from an AR-15 rifle into the air.",
    "The decision Tuesday was a setback for a dozen Republican attorneys general, including Ohio’s Dave Yost, who are seeking to restore a Trump-era ban on the practice.",
    "The Canton Repository reports that the city so far has refused to name the officer who killed 46-year-old James Williams because he remains an \"uncharged suspect\".",
    "Marshals Service says investigators followed leads all over Ohio and several other states searching for Black, who was found living in Atlanta under a fake name.",
    "Super Bowl Sunday to be 'Cincinnati Bengals Day' in Ohio\n(WVXU) -- Super Bowl Sunday will officially be Cincinnati Bengals Day in Ohio.",
    "Authorities say Adarus Black, 19, of Lakemore is accused of shooting Na’Kia Crawford as she sat in a car on Akron’s North Side.",
    "Peloton pulls the plug on Toledo factory\n(AP) — Peloton is ending its plans to open its first U.S. factory in Ohio.",
    "The Ohio Bureau of Criminal Investigation is reviewing the police shooting but has not yet released any findings.",
    "If lawmakers don’t pass it, that organization could gather signatures and take it to voters, perhaps this year.",
    "The conservative Center for Christian Virtue says it is poised to fight efforts to legalize cannabis in Ohio.",
    "Its leader, Aaron Baer, says the group opposed the failed 2018 attempt to legalize pot and will fight again.",
    "The decision announced Tuesday by the home fitness equipment maker comes as it plans a major restructuring.",
    "The company broke ground on the site this past summer and had expected to begin production there in 2023.",
    "Crawford’s death sparked protests calling for justice, and got the attention of NBA star LeBron James.",
    "Mike DeWine signed a proclamation honoring the football team and wishing them well against the Rams.",
    "The proclamation also calls on Ohioans to wear orange and black on Sunday and cheer on the Bengals.",
    "But those plans changed quickly as demand for its interactive bikes and treadmills dropped off.",
    "Peloton says it will finish work on the building’s shell and sell it and the surrounding land.",
    "The Biden administration reversed that prohibition in new regulations implemented in October.",
    "Two are sponsored by lawmakers themselves, a Democratic bill and a Republican measure.",
    "The other is an initiated statute brought by an outside group.",
    "Police have said the shooting was a case of mistaken identity.",
    "Two others were previously arrested on obstruction charges.",
    "Ohio lawmakers are now considering three proposals.",
    "It would have employed 2,000 workers near Toledo.",
    "Construction already was underway on the factory.",
    "The 6th U.S.",
    "The U.S.",
    "Gov."
  ]
}