{
  "id": 2688,
  "mediaId": 2573,
  "date": "2022-02-01",
  "headline": "Governors grade Joe Biden: ‘Solid’ D, and ‘I’m trying to be generous there’",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/10/16d1db4d-Biden.jpg",
  "link": "https://www.foxnews.com/media/governors-biden-grade-failing",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelsey Koberg",
  "authorUrl": "https://www.foxnews.com/person/k/kelsey-koberg",
  "termIds": [
    2869,
    2915,
    3554,
    3679,
    4905,
    5418,
    392,
    5925,
    6678
  ],
  "sentences": [
    "\"The failed exit from Afghanistan, the surging inflation that’s a hidden tax on everyone in this country, the highest cost of everyday living that we’ve seen in 40 years, the crisis at the border that’s not only affecting Arizona but every state with fentanyl spilling in, and now this muddled policy in Ukraine, we’ve never projected more weakness on the global stage, and there’s no real sense to his economic policy,\" Ducey said.",
    "\"I sure as heck did not vote in support of President Biden when he was running for office, but there was an expectation with a lot of those independents in America that said, ‘well, I’m hoping he will use his relationships, reach across the aisle, build consensus, find some way to get Republicans’ voice in there … not come in with an authoritarian approach … make it a one-size-fits-all,\" Sununu continued.",
    "The letter Gianforte referenced was sent by more than two dozen Republican governors, who demanded a meeting with Biden to address the crisis at the southern border, saying the illegal immigration surge created an \"international humanitarian crisis.\"",
    "Governors from across the United States gave President Biden a \"failing\" or \"poor\" review, and a \"generous\" D when asked to grade his White House performance, citing a lack of communication, inflation and the botched withdrawal from Afghanistan.",
    "BIPARTISAN LEADERSHIP FROM AMERICA'S GOVERNORS DELIVERS SOLUTIONS THAT WORK FOR ALL OF US\nTheir comments came as Biden’s approval rating hovers just above 40% due to voter concerns on rising inflation, foreign policy blunders, and other issues.",
    "Murphy highlighted the American Rescue Plan; the bipartisan infrastructure bill; and progress on vaccination, boosters, testing and the number of kids in schools as positives for the Biden administration.",
    "\"Whether you talk about border security, whether you talk about Afghanistan withdrawal, whether you talk about the inflation challenges we have, all of those areas the grade is poor,\" Hutchinson said.",
    "\"That’s been a lot of contact, and look, we’ve had a good relationship in regard to the pandemic with the Trump administration, and we’ve had a good relationship with the Biden administration.",
    "Brad Little, R-Idaho, said that in the last administration, he and other governors had a weekly call, often with the vice president, president and secretary of Health and Human Services.",
    "Despite the heavy criticism of the president and his policies and lack of communication, some governors said they had been in contact with the president and had a good relationship.",
    "\"This administration said they’re going to work with Congress to get their initiatives done, at the expense of working with us, the governors, who have to get things done.\"",
    "Gianforte added he was pleased that NGA attendees were able to meet with Biden at the White House, but it was the first opportunity many had to engage with the president.",
    "Phil Murphy said there is more work to do, and \"nobody’s perfect,\" but that the public and the media should focus more on the accomplishments of the Biden administration.",
    "\"We’d love the flexibility to address it because all 50 states are vastly different, and what works in Idaho doesn’t work in Virginia or Maryland,\" he said.",
    "Little said the difference in approach has led the Biden administration to implement policies without providing states the flexibility to implement them.",
    "Several governors Fox News Digital spoke to cited Biden’s lack of communication with state executives as part of the reason for their low grades.",
    "\"We’ve had a lot of interaction with the Biden administration, and before that with the Trump administration, in regard to the pandemic,\" Gov.",
    "\"Even my Democratic colleagues say they got better service form the Trump White House than they are from the Biden White House,\" Little said.",
    "\"Hopefully there’s a pivot and a change, but nobody’s seeing it right now, and that’s why they’re sitting at 38% approval,\" Sununu said.",
    "Asa Hutchinson, R-Ark., said he would not give Biden a letter grade, but \"in terms of effectiveness, it’s been poor on effectiveness.\"",
    "Greg Gianforte, R-Mont., labeled Biden’s performance as simply an \"F.\"\n\"I’m going to give the Biden administration a solid D,\" Gov.",
    "\"We look for effectiveness and we look for some measure of bipartisanship, and we really haven’t seen that yet,\" Hutchinson said.",
    "Doug Ducey, R-Ariz., told Fox News Digital at the National Governors Association (NGA) winter meeting in Washington, D.C.\nGov.",
    "\"I’d have to give them a failing grade, and they’re going to need a lot of work to turn this around,\" Ducey concluded.",
    "\"I’m not big into grades, but I do think we focus, I think all of us, media or otherwise, on what didn’t get done.",
    "These are issues where we’re trying to save lives, and also keep people working and keep our economy moving.\"",
    "Several governors also criticized the president for running as a moderate, but failing to govern that way.",
    "Ducey told Fox News Digital the only day Biden governed \"in those terms\" was on Inauguration Day.",
    "\"Twenty-six governors sent the president a letter in September asking for a meeting.",
    "Other governors hoped for a change in the administration’s policies and actions.",
    "\"I think this is a failing administration, and I think it’s a real shame,\" Gov.",
    "Story tips can be sent to kelsey.koberg@fox.com and on Twitter: @KelseyKoberg.",
    "Little said he was not alone in this assessment of the Biden administration.",
    "Gianforte said governors \"have not seen the engagement\" they had hoped for.",
    "Fox News' Cortney O'Brien and Brandon Gillespie contributed to this report.",
    "\"That was just a difference in style, that was the biggest part of it.\"",
    "I think we should shine a light on what did get done,\" Murphy said.",
    "\"And from a leadership perspective, communication is everything.",
    "Communication builds public confidence and builds transparency.\"",
    "\"Now the call is with somebody much lower down,\" Little said.",
    "\"Their communication is just terrible,\" Sununu said.",
    "Kelsey Koberg is an Editor with Fox News Digital.",
    "We have not gotten a response,\" he said.",
    "\"And I’m trying to be generous there.\"",
    "So, these are not partisan issues.",
    "New Jersey’s Democratic Gov.",
    "Chris Sununu, R-N.H., said.",
    "Mike DeWine, R-Ohio, said.",
    "Gov.",
    "Gov."
  ]
}