{
  "id": 2897,
  "mediaId": 8363,
  "date": "2022-01-30",
  "headline": "Intel's $20B plant in Licking County will have benefits for Richland County",
  "image": "https://www.gannett-cdn.com/presto/2022/01/21/PNEW/8d8dd1e0-065e-4b4e-8149-7d2288bb351e-Intel_Rendering_Beauty.jpg?crop=5099,2869,x0,y330&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/01/30/mansfield-richland-county-residents-benefit-intel/6636779001/",
  "mediaOutlet": "mansfieldnewsjournal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Caudill",
  "authorUrl": "https://www.mansfieldnewsjournal.com/staff/4395513002/mark-caudill/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"Ohio’s 23 community colleges are well-prepared for that challenge and eager to collaborate to help Intel and other industries of the future thrive here by developing the talent they need to succeed.”\nNC State, OSU-Mansfield welcome opportunities for students\nDorey Diab, president of NC State, sees opportunity for area business and students.",
    "“We’re committed to working with these new businesses and the state of Ohio as an education partner to develop relevant coursework and training programs, beyond the ones we already have in these high-tech areas, to meet the unique needs of this new semiconductor industry segment in Ohio,\" he said in a prepared statement.",
    "Local students will have training to fill jobs\n\"The Ohio State University at Mansfield recognizes the importance of strong partnerships between higher education, government, and business and industry in our region, and now we see this success at the state level,\" Jones said in a prepared statement.",
    "Ohio gets the job done:Intel picks Columbus area for largest chip factory in the world\nRichland County could attract supply businesses\nPerry said Richland County has places where businesses could build, including the greenfield sites near Mansfield Lahm Regional Airport and Ontario Commerce Park.",
    "\"I was proud to support HB 110, the state operating budget, which included the 'Mega Projects' program to help increase Ohio's competitiveness in trying to attract large economic development proposals to Ohio, such as Intel,\" she said.",
    "\"The residents and businesses of north central Ohio, just one hour north of the new Intel facility, are in a prime location for employment, living conditions and technical support.”\nDiab pointed to offerings at the local college.",
    "\"We have begun working to expand offerings in cybersecurity and IT, and we have a wonderful partnership with North Central State College to ensure a rich spectrum of opportunities in higher education for the region,\" he said.",
    "These efforts have led to the development of new majors in cyber security, bioscience, plastics manufacturing, communication tower technician training and the bachelor of applied science in mechanical engineering technology.",
    "The man with the Intel:CEO Pat Gelsinger 'thrilled to be launching the Silicon Heartland in Ohio'\nInvestment return is jobs, direct and indirect\nIn return, Ohio will get 3,000 jobs paying an average of $135,000 per year.",
    "The plants will establish America in the global market as a massive producer of semiconductor chips, which help power many digital and electronic devices, and will elevate the nation’s status as a manufacturing power.",
    "\"Launched in 2020 and offered on the regional campuses of Ohio State, the bachelor of science in engineering technology major is designed to prepare current and future students for these new careers,\" he said.",
    "Local development head wants to position county for the 'ripple effects'\nThe forthcoming $20 billion Intel microchip plant will be located in Licking County, but it will have a direct impact on this area.",
    "\"The job opportunities generated by Intel and by other high-tech industries sure to follow will require a strong and sustainable pipeline of skilled workers ready and able to seize those opportunities.",
    "The curriculum can be tailored to meet the needs for industry related to microchip production, and it was designed to prepare Ohio’s workforce to be nimble in manufacturing leadership for the future.\"",
    "Investments Intel and other chip companies are making are meant to stem the global chip supply shortage that has left car lots empty and consumers struggling to buy appliances and other goods.",
    "\"Ohio State-Mansfield is already seen as a destination campus for students from many parts of the state, and this can only flourish and be strengthened with the announcement by Intel.\"",
    "\"This Intel project will create 3,000 jobs directly and provide up to $100 billion over potentially four phases to build the world's largest chip-manufacturing plant in our state.",
    "\"By every measure, this is an historic moment for our state, a game-changing success that will bring lasting benefits to every corner of Ohio,\" he said in a prepared statement.",
    "\"Coursework includes both mechanical and electrical engineering components, as well as a focus on leadership and the latest technology in automation and networking.",
    "The new factories will enhance American resilience against disruptions in the global supply chain and inflation, an issue that the COVID-19 pandemic has worsened.",
    "\"Preparing that work force will be an ongoing challenge, requiring the very best, coordinated efforts from every level of education in our state,\" Hershey said.",
    "In what's being called the biggest economic development project in Ohio's history, local, state and federal leaders from President Joe Biden to Gov.",
    "Dog service:Boy, 8, with autism, autoimmune encephalitis seeks service dog\n\"It's right on the edge of where people will want to commute,\" he said.",
    "Bowersock said studies have shown the numbers of people commuting to a job from Mansfield and the numbers coming here to work are \"pretty close.\"",
    "Jack Hershey, president of the Ohio Association of Community Colleges, recognized the governor and JobsOhio for helping bring Intel to the state.",
    "Tim Bowersock, Mansfield's economic development director, said he's not sure what effect the Intel plant will have on city residents.",
    "The investment by Intel will also bring so many more economic development opportunities in the long-term as the ecosystem enlarges.\"",
    "Because of that, officials at North Central State College and the Ohio State University-Mansfield are more than a little excited.",
    "\"We don't see jobs like that very often,\" said Jodie Perry, president and CEO of Richland Area Chamber & Economic Development.",
    "\"The ripples of opportunity to hire our talented graduates from this exciting development will extend throughout the state.",
    "Like Perry, Bowersock said there are businesses in Mansfield that could be on the supply chain for a plant such as Intel.",
    "Intel will look for workers from wide area\nBowersock added there is a long way to go before the jobs will be available.",
    "The state disclosed the incentives it will provide to the Silicon Valley-based chip company likely will top $1 billion.",
    "\"Students understand process engineering and can integrate between production, supply chain and logistics.",
    "Mike DeWine welcomed the company's investment to build two semiconductor plants on land in New Albany.",
    "Marilyn John, state representative for Ohio's District 2, said the Intel plant will be big for Ohio.",
    "There also will be 7,000 construction jobs and thousands of additional indirect jobs in the region.",
    "They're going to need a lot of higher-end people that are IT-oriented or engineering-oriented.\"",
    "\"Attracting an economic development project like this will have ripple effects,\" Perry said.",
    "Our goal is to add microchip semiconductor manufacturing support to this list,\" Diab said.",
    "\"Suppliers and others that want to work with that company want to have facilities nearby.",
    "Thank you to all who worked diligently to bring this opportunity to the State of Ohio.\"",
    "\"An additional 20,000 jobs will be created in construction, indirect and support jobs.",
    "The Columbus Dispatch, a sister paper of the News Journal, contributed to this story.",
    "\"We do have some folks who are invested in electronics and circuit boards,\" he said.",
    "Jones also noted the branch campus' collaboration with North Central State College.",
    "\"A lot will come out in the next 12-18 months on how to apply if you're interested.",
    "“NC State continues to meet the changing needs of employers throughout the region.",
    "\"This is indeed exciting for Ohio as a top magnet for a new generation of talent.",
    "\"It sounds like it will be three years before they turn the switch on,\" he said.",
    "Norman Jones, dean of OSU-M, also welcomed the opportunities Intel will bring.",
    "Jones said OSU-M students will have the training to fill the job openings.",
    "\"People don't think of Ohio when it comes to that type of profession.\"",
    "She explained how the project will benefit Richland County.",
    "They're not looking at only Newark to fill that work force.",
    "That's something we would want to position ourselves for.\"",
    "\"This is a major win for Ohio,\" DeWine said last week.",
    "mcaudill@gannett.com\n419-521-7219\nTwitter: @MNJCaudill",
    "\"It's really a game-changer for our economic future.\"",
    "\"They're going to draw from a pretty wide area.",
    "\"It's good for Ohio,\" Bowersock noted.",
    "That's just my opinion."
  ]
}