{
  "id": 2956,
  "mediaId": 8278,
  "date": "2022-02-01",
  "headline": "United Way of Youngstown Leads Response",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/01/GR22_Youngstown1-01-1.png",
  "link": "https://businessjournaldaily.com/united-way-of-youngstown-leads-response/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Guest Author",
  "authorUrl": "https://businessjournaldaily.com/author/guest-author/",
  "termIds": [
    0
  ],
  "sentences": [
    "By STEVEN LOGAN\nDirector of Marketing and Communication, United Way of Youngstown and Mahoning Valley\nYOUNGSTOWN, Ohio – When the world came to a stop, The United Way of Youngstown and the Mahoning Valley took a stand, rising up to face the unprecedented challenges presented by the COVID-19 pandemic.",
    "Ed Muransky noticed a gap in the populations being served during the pandemic – seniors, shut-ins, and families that could not or should not venture outside because of health concerns.",
    "Working with the Mahoning Valley’s 19 school districts, we were able to identify and distribute over $200,000 in grocery store gift cards to students and families in need.",
    "Nearly 600 children across 18 school districts participated in our kindergarten readiness program, showing improvement in math, literacy and social emotional development.",
    "When the pandemic forced schools to move to online learning, our staff began pivoting educational wrap-around services to virtually support students and families.",
    "Similarly, our Success After 6 staff began pivoting to welcome students back to in-person after school programming, while continuing to offer virtual tutoring.",
    "2021 ended with a substantial holiday food giveaway that distributed more than 1,000 holiday food boxes filled with fresh foods and nonperishable items.",
    "These efforts, combined with our donors once again giving back to our community, put us on track to exceed $3 million for the fourth straight year.",
    "Of the 10 most populous counties in Ohio, Mahoning County reported the highest percentage of children enrolled, 12% higher than state average.",
    "The United Way of Youngstown and the Mahoning Valley was founded in 1919 and today funds programs in early education and emergency services.",
    "As students prepared to return to face-to-face learning in 2021, United Way staff began transitioning back to in-person programming.",
    "We shaped our programming to serve the most vulnerable in our community and reinvented the way we connect and assist those in need.",
    "The Vello Program offers one-on-one reading sessions for students and tutors through a safe and secure digital setting.",
    "One of our most popular programs is the Imagination Library, which United Way launched in 2014 in Mahoning County.",
    "In 2021, we worked through many hybrid and alternative fundraisers that allowed us to raise significant dollars.",
    "Even though we were forced to cancel many in-person events and fundraisers, our campaign exceeded $3 million.",
    "The Success By 6 staff worked tirelessly to welcome students and their families back over the summer months.",
    "In April 2020, in partnership with the Muransky family, we began our Satur-Day of Caring food distribution.",
    "Despite job loss, shutdowns and increasing uncertainty, United way donors stepped up in a big way in 2020.",
    "Mike DeWine launched the Ohio Governor’s Imagination Library, which extended the reach of the program.",
    "More than 6,000 children across the county, from birth to age five, receive one free book a month.",
    "We are thankful to our donors and volunteers who were able to give back to our neighbors in need.",
    "We will continue this initiative in 2022 to better serve the most vulnerable in our community.",
    "On our first Satur-Day of Caring, 25 volunteers packed and delivered food to 110 households.",
    "Now more than 150 volunteers deliver essentials to more than 400 households every month.",
    "Mahoning County now has 51% of eligible children enrolled in the program.",
    "The program promotes the love of reading at the earliest of ages.",
    "In 2021, that program expanded from just one school to four.",
    "Copyright 2022 The Business Journal, Youngstown, Ohio.",
    "We have eight full-time and two part-time employees.",
    "We will announce our final amount in mid-February.",
    "Our United Way chapter shifted into response mode.",
    "This initiative will continue in 2022.",
    "In 2019, Gov."
  ]
}