{
  "id": 3052,
  "mediaId": 8365,
  "date": "2022-01-31",
  "headline": "4 Marion County fire departments receive MARCS grants",
  "image": "https://www.gannett-cdn.com/presto/2022/01/28/PMAR/9fb236c1-d4d2-4da0-8e0d-898d61a4b1be-OHIO_STATE_FIRE_MARSHAL_LOGO.jpg?crop=1169,658,x1,y130&width=1169&height=658&format=pjpg&auto=webp",
  "link": "https://www.marionstar.com/story/news/2022/01/31/4-marion-county-fire-departments-receive-marcs-grants/9256652002/",
  "mediaOutlet": "marionstar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Carter",
  "authorUrl": "https://www.marionstar.com/staff/4395745002/andrew-carter/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Having first responders with these state-of-the-art radios improves emergency services for these counties, which increases the level of safety for the communities they protect.”\nAccording to the press release, the MARCS system provides statewide, secure, reliable public service wireless communication for first responders.",
    "“This is a highly-competitive selection process, so our emphasis has been on growing the MARCS program with the goal that one day every department in Ohio is on this communication system,” said State Fire Marshal Kevin S. Reardon.",
    "Local recipients included the Fort Morrow Consolidated Fire Department ($20,000), Green Camp Township Fire Department ($40,000), Marion Township Fire Department ($20,000), and Scioto Valley Fire District ($1,385).",
    "Priority funding goes to departments applying as part of a regional or county-wide effort, as well as departments that show they are prepared to immediately begin using the MARCS radios upon receiving the award.",
    "According to a press issued by the governor’s office, the MARCS radio system allows first responders to seamlessly communicate, not only with each other, but with other agencies responding to an incident.",
    "Four fire departments that serve Marion County were among the recipients of the 2022 MARCS (Multi-Agency Radio Communications System) grants awarded by the State Fire Marshal’s Office.",
    "The MARCS Grant is available annually to fire departments with service areas of 25,000 residents or less and up to $50,000 per department is available through this grant.",
    "There are currently over 120,000 voice units and over 1,800 mobile data units on the MARCS system with over 2,800 local, state, and federal agencies statewide.",
    "\"This grant will help our first responders save lives and be more effective in responding to everyday operations and emergency situations across the state.\"",
    "This funding cycle, the State Fire Marshal received more than $8.5 million in requests for the $3.5 million in total available funding.",
    "\"We are dedicated to helping Ohio's first responders by equipping them with state-of-the-art wireless digital communications,\" Gov.",
    "MARCS radio system technology is advanced and the costs to acquire and operate can be significant.",
    "A total of $3.5 million in funding was awarded to 212 fire departments in 57 Ohio counties.",
    "Mike DeWine said."
  ]
}