{
  "id": 3140,
  "mediaId": 2921,
  "date": "2022-02-02",
  "headline": "Judge blocks Ohio law requiring proper disposal of aborted babies",
  "image": "https://cdn.christianpost.com/files/original/thumbnail/24/67/246736.jpg",
  "link": "https://www.christianpost.com/news/judge-blocks-ohio-law-requiring-proper-disposal-of-aborted-babies.html",
  "mediaOutlet": "Christian Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Gryboski",
  "authorUrl": "https://www.christianpost.com/by/michael-gryboski",
  "termIds": [
    0
  ],
  "sentences": [
    "“We will continue to do everything in our power to ensure Ohioans have the freedom to make their own decisions about their bodies, their families, and their futures.”\nIn late December 2020, Ohio Governor Mike DeWine signed SB 27 into law, which requires “final disposition of fetal remains from a surgical abortion at an abortion facility (to) be by cremation or interment.”\nOther provisions include requiring abortion facilities to “document in the pregnant woman’s medical record the final disposition determination made” and “maintain evidentiary documentation demonstrating the date and method of the disposition of fetal remains from surgical abortions performed or induced in the facility.” Failure to comply with these will be “a misdemeanor of the first degree.”\nOhio Right to Life President Mike Gonidakis said in a statement released at the time that the new law showed that “we respect life and we bury our dead.”\n“No longer will the tiny bodies of babies whose lives have been tragically taken through abortion be treated like trash,” said Gonidakis.",
    "“SB27 is not narrowly tailored to serve a compelling state interest … the State does not require health care facilities to dispose of identical tissue after miscarriage and infertility treatments by cremation or interment, thus casting strong doubt on the State’s claimed purposes.”\nThe Planned Parenthood Federation of America, the American Civil Liberties Union, and a couple of abortion clinics issued a joint statement on Wednesday supporting the ruling.",
    "“Today’s ruling reaffirms what we already know to be true: aggressive and cruel regulations like SB27 serve no other purpose than to impose severe burdens on abortion patients and providers, and to shame and stigmatize patients seeking essential health care,” they stated.",
    "“Given the breadth of the Ohio Constitution’s guarantees of bodily autonomy, privacy, and freedom of choice in health care, strict scrutiny must apply to a law that infringes on this protection,” ruled Hatheway.",
    "“The abortion industry, who has for decades tried to convince women that the lives of their children don’t matter and should simply be thrown away, will now be unable to hide behind this blatant lie.”",
    "Judge Alison Hatheway of the Court of Common Pleas in Hamilton County entered a preliminary injunction on Monday against Ohio Senate Bill 27, also known as the Unborn Child Dignity Act.",
    "While the first preliminary injunction against the law was a temporary measure issued last year, this second injunction will remain in effect until a judgment in the case is reached.",
    "A judge has issued a second preliminary injunction against an Ohio law that, among other things, requires that aborted babies be given proper disposal through burial or cremation."
  ]
}