{
  "id": 3263,
  "mediaId": 8360,
  "date": "2022-02-03",
  "headline": "DeWine can’t run from energy bailout bribery scandal as dirty laundry keeps piling up",
  "image": "https://i0.wp.com/www.lovelandmagazine.com/wp-content/uploads/2016/12/dewine-feature.jpg?fit=1074%2C438&ssl=1",
  "link": "https://www.lovelandmagazine.com/dewine-cant-run-from-energy-bailout-bribery-scandal-as-dirty-laundry-keeps-piling-up/",
  "mediaOutlet": "lovelandmagazine.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Guest Column -",
  "authorUrl": "https://www.lovelandmagazine.com/author/guest-column/",
  "termIds": [
    0
  ],
  "sentences": [
    "Even after the FBI raided Randazzo’s home as part of the FirstEnergy bribery probe and he resigned under a cloud of suspicion, DeWine praised him for doing “very, very good work as chair.”\nPerhaps anticipating incredulity with that assessment, the Republican later suggested he was “open” to reforming the process for choosing state utility regulators.",
    "But even damning disclosures of Randazzo’s $4.3 million utility bribe and his blatant efforts on behalf of FirstEnergy — constructing House Bill 6, delaying a company rate case, lobbying for legislation to save the utility millions — didn’t dissuade DeWine from expressing “great confidence” in his regulator.",
    "Three of the four indicted individuals who will be in court on federal racketeering charges — in connection with a billion-dollar ratepayer bailout of two nuclear power plants to benefit FirstEnergy and its affiliates — donated thousands to DeWine’s gubernatorial campaign.",
    "But the Republican-controlled legislature, complicit in the worst scandal “ever perpetrated against the people of the state of Ohio,” is content to become synonymous with corruption and fleece Ohioans on their monthly electric bills if that makes utility donors happy.",
    "The Ohio Manufacturers Association estimated electricity customers will pay a total of $1.8 billion in coal plant subsidies by 2030 — more than the cost of the nuke bailout — unless integrity intrudes on the General Assembly and House Bill 6 is fully repealed.",
    "Ohioans didn’t know how crooked House Bill 6 was or how many politicians, including the governor, were willing to look away until federal prosecutors blew the lid off the alleged criminal enterprise to screw ratepayers in return for boosted political careers.",
    "But when people in high places slip on hubris and expose brazen graft at public expense — and they always do — the swarm of politicians who were only too happy to pocket donor checks and look the other way scatter like insects under a rock that’s been lifted.",
    "DeWine hired multiple administration staffers and advisors with close ties to FirstEnergy, including a former top aide linked to one of the dark money groups implicated in passage of the bailout legislation (House Bill 6) written for and by the utility.",
    "Even after the FBI arrested former House Speaker Larry Householder, who engineered approval of House Bill 6 and was subsequently charged with taking money to pass it, DeWine rejected an effort to repeal the corruption-ridden legislation.",
    "Find out who in Columbus is greasing palms, funding campaigns and writing public policy for private interests, and you’ll also discover who is standing in line with their hand out willing to reciprocate with public favors.",
    "The “energy” legislation championed by DeWine also put ratepayers on the hook to bail out two money-losing, hyper-polluting coal plants (one in Indiana) partially owned by other utilities and two FirstEnergy subsidiaries.",
    "DeWine reversed himself but reiterated his support for FirstEnergy’s ultimate bribery goal — giving $1.3 billion in public money to two unprofitable nuke plants with new surcharges paid by everyratepayer in the state.",
    "Plus, the bailout boondoggle the governor couldn’t sign fast enough thoroughly gutted renewable energy and energy efficiency standards and removed all incentive to build more renewable energy projects in the state.",
    "In a seemingly flagrant quid pro quo, the governor’s pick for the powerful chair of the state utilities commission pocketed a massive sum of money from FirstEnergy just weeks before his appointment.",
    "From the biggest online charter school rip-off of tax dollars to the largest public corruption indictment in state history, money has paved the way to epic wrongdoing under GOP management.",
    "DeWine is understandably trying to put as much distance as possible between his reelection campaign and the biggest open investigation of Statehouse corruption in the country.",
    "Eighteen months on, the DeWine-appointed nominating council that recommends PUCO candidates to the governor includes members tied to passage of the notorious bailout bill.",
    "Mike DeWine is one of those spooked bugs racing away from his political entanglement in the blockbuster bribery and money-laundering case that goes to trial this year.",
    "Marilou Johanek is a veteran Ohio print and broadcast journalist who has covered state and national politics as a longtime newspaper editorial writer and columnist.",
    "The governor also appointed and steadfastly supported Ohio’s former top utility regulator, now accused of profiting in association with the FirstEnergy scandal.",
    "The state’s largest electric utility pumped $1 million into groups backing DeWine in 2018, according to a Dayton Daily News investigation following the money.",
    "He had put the full weight of the governor’s office behind the nuclear bailout bill and signed the corrupt measure into law the very day it passed.",
    "Those utility-written provisions have still not been repealed under a 2019 embarrassment that should have been scrapped outright.",
    "DeWine knew of Sam Randazzo’s deep business relationship with the utility when he chose him at the urging of company executives.",
    "“We need balance in our energy,” was all he could say about a bill passed with more than $60 million in bribe money.",
    "The company also pumped big bucks into groups helping his daughter’s failed campaign for county prosecutor.",
    "Its corrupting influence runs through all the great scandals piling up in Ohio under Republican rule.",
    "But it’s hard to escape dirty laundry that keeps piling up when you can’t hide under a rock anymore.",
    "But remember, this outrage happened on DeWine’s watch and with his blessing.",
    "So did the Akron-based energy giant at the heart of the bailout scheme.",
    "COMMENTARY\nby MARILOU JOHANEK – Ohio Capital Journal\nollow the money.",
    "FirstEnergy has legendary pull with pliable politicians.",
    "Don’t hold your breath.",
    "MORE FROM AUTHOR",
    "Republican Gov."
  ]
}