{
  "id": 3266,
  "mediaId": 8491,
  "date": "2022-02-01",
  "headline": "ODOT urges against unnecessary travel during storm",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2021/01/snow-plow-snowing-winter-weather-generic.jpg?w=1280",
  "link": "https://www.wkbn.com/news/local-news/odot-urges-against-unnecessary-travel-during-storm/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabrielle Owens",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Once the storm moves out, our crews will be able to make progress toward getting traffic moving at regular speed.”\nODOT’s goal is to have the average traffic speed of 10 mph posted within two hours on secondary routes and four hours of the end of a storm.",
    "“For those who must travel, please be safe and take it slow, giving yourself plenty of time to get to your destination.”\nRight now, it looks like the storm will start with rain showers into Wednesday afternoon and evening.",
    "“During winter storms, ODOT strives to keep roads passable to help ensure that emergency services and essential workers can safely reach their destinations,” said ODOT Director Jack Marchbanks.",
    "COLUMBUS, Ohio (WKBN) – The Ohio Department of Transportation highly discourages Ohioans to travel Wednesday through Friday, due to a major storm heading to the Buckeye state.",
    "If you must drive during the storm, follow ODOT winter driving safety tips, which include leave early, plan your route, clean your car and inspect your vehicle.",
    "“We are encouraging Ohioans to avoid any unnecessary trips during the storm to help give all of our road crews room to work,” said Governor Mike DeWine.",
    "“But even with our crews out in full force, roads will likely be snow and ice-covered, and it will take much longer to travel.",
    "As we get deeper into Wednesday night and Thursday morning, look for the potential of freezing rain and sleet to mix in.",
    "Drivers can find updated travel information, traffic cameras, and more online at OHGO.com.",
    "ODOT advises drivers to avoid driving through high water and street barricades.",
    "Temperatures will be above freezing as the storm starts."
  ]
}