{
  "id": 3292,
  "mediaId": 2679,
  "date": "2022-01-29",
  "headline": "In North Carolina, a pitched battle over gerrymanders and justices",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/in-north-carolina-a-pitched-battle-over-gerrymanders-and-justices/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "MICHAEL WINES",
  "authorUrl": "https://www.seattletimes.com/author/michael-wines/",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s just that here, it’s on steroids.”\nAdvertising\n Skip AdSkip AdSkip Ad\nIt also is a reminder that for all the attention on the U.S. Supreme Court this week after Justice Stephen Breyer announced his retirement, it is in supreme courts in states like North Carolina, Michigan, Wisconsin, Pennsylvania and Ohio that many of the most explosive questions about the condition of American democracy are playing out.",
    "“The real battle is between a Democratic governor and a pretty durable majority in the General Assembly.” The calls for recusal, he said, “raised this to an unprecedented level.”\nLike North Carolina, some 34 other states allow supreme court justices to rule on recusal motions aimed at them.",
    "But when Russell Wheeler, a Brookings Institution scholar and president of the nonpartisan Governance Institute, analyzed individual judges’ votes, he found a different pattern: 27 of the 123 state court judges who heard the cases actually supported Trump’s arguments.",
    "So it is unsurprising that North Carolina’s latest battle, over new political maps that decisively favor Republicans, is unfolding in what has become an increasingly contested and influential battlefield in United States governance: the state Supreme Court.",
    "The court meets Wednesday to consider whether a map drawn by the Republican-dominated legislature that gives as many as 11 of 14 seats in the next Congress to Republicans — in a state almost evenly divided politically — violates the state constitution.",
    "In 2019, a $1.3 million barrage of last-minute advertising by the Republican State Leadership Committee was credited with giving the GOP-backed candidate for the Wisconsin Supreme Court, Brian Hagedorn, a 6,000-vote victory out of 1.2 million cast.",
    "Woodhouse’s reference to impeachment in a recent column led some to wonder whether, given the state’s slash-and-burn partisanship, that could be a fallback tactic to erase the court’s Democratic majority should redrawn maps wind up there again.",
    "Well over 4 in 10 dollars came from political parties and interest groups, including the conservative nonprofit Judicial Crisis Network, which has financed national campaigns backing recent Republican nominees to the U.S. Supreme Court.",
    "Additionally, they said, Earls’ 2018 campaign received a $199,000 donation that apparently had been channeled through the state Democratic Party from the National Democratic Redistricting Committee, an arm of the national party.",
    "And there are also national partisan infrastructures that know how important these courts are to any number of high-profile issues, and probably to issues around democracy and elections.”\nHow important is easy to overlook.",
    "Atop that, an influential former chair of the state Republican Party has suggested that the legislature could impeach some Democratic justices, a move that could remove them from the bench until their fates were decided.",
    "The current gerrymander suit was filed long after Earls left the social justice coalition, but while there, she worked on challenges to the state’s gerrymanders with a lawyer in the current case, Allison Riggs.",
    "In the North Carolina case, one of the plaintiffs in the redistricting suit, a group of North Carolina Democrats, acted first Dec. 6, asking that a Republican justice, Phil Berger Jr., withdraw from the case.",
    "Earls, the founder and former executive director of the Southern Coalition for Social Justice, had battled Republican gerrymanders in North Carolina for years before winning election to the court in 2018.",
    "A month later, the defendants — Republican legislators who drew and oversaw the political maps — urged Justice Samuel Ervin, a Democrat, to recuse himself because he is seeking reelection in November.",
    "They kicked off the recusal battle last summer, he said, when the state NAACP sought to force two Republican justices to withdraw from a case challenging two referendums for constitutional amendments.",
    "It is well known, for example, that former President Donald Trump’s legal efforts to overturn the results of the 2020 election were rejected by every court where he filed suit, save one minor ruling.",
    "But Dallas Woodhouse, a former state Republican Party chair and columnist for the conservative Carolina Journal, said blame for the current tempest lay not with Republicans, but their critics.",
    "How the recusal demands and the impending hearing play out in North Carolina will be closely watched by Republican lawmakers who would have to redraw the maps should the court invalidate them.",
    "But a growing partisan split is turning what once were sleepy races for judicial sinecures into front-line battles for ideological dominance of courts with enormous sway over people’s lives.",
    "Berger is the son of Phil Berger, the president of the state Senate and a defendant in the case whose own Senate district, the plaintiffs said, was among those that had been gerrymandered.",
    "“I think we’re at the brass-knuckles level of political fighting in this state,” said Michael Bitzer, a scholar of North Carolina politics at Catawba College in Salisbury, North Carolina.",
    "A new report from the Brennan Center for Justice, at New York University, concluded that a record $97 million was spent on 76 state supreme court races in the most recent election cycle.",
    "Increasingly, businesses and advocacy groups turn to them for rulings on crucial issues — gerrymandering is one, abortion another — where federal courts have been hostile or unavailing.",
    "“There are in-state financial interests that know these courts are really important for their bottom lines, so they’re putting money toward defeating or supporting justices to that end.",
    "Similarly, the code calls for recusal when judges have “a personal bias” toward a party or previously worked with a lawyer while that lawyer was involved in a case before the court.",
    "It is the state that put the hyper in partisan politics, setting the blunt-force standard for battles over voting rights and gerrymanders that are now fracturing states nationwide.",
    "Woodhouse crusaded against the demands in his columns, and the Supreme Court left the decision up to the justices, both of whom said this month that they would hear the case.",
    "Days later, the state Republican Party urged a Democratic justice, Jennifer Brenner, to recuse herself because she had made redistricting an issue when running for office.",
    "State supreme courts have become especially critical forums since the U.S. Supreme Court said in 2019 that partisan gerrymanders were political matters outside its reach.",
    "“I think that impeaching judges would be the worst thing for North Carolina,” he said, “other than judicial tyranny.”\nThis story was originally published at nytimes.com.",
    "The National Redistricting Foundation, a nonprofit affiliate of the redistricting committee, is underwriting the legal expenses of one plaintiff in the case.",
    "But for weeks, both sides of a lawsuit have been waging an extraordinary battle over whether three of the court’s seven justices should even hear the case.",
    "It says judges should disqualify themselves from matters affecting anyone “within the third degree of relationship,” which would include Berger’s father.",
    "In Ohio, Justice Pat DeWine of the state Supreme Court rebuffed calls last fall to recuse himself from redistricting lawsuits in which his father — Gov.",
    "Conservative groups spent $18.9 million in the 2019-20 cycle, the report stated, but liberal groups, which spent $14.9 million, are fast catching up.",
    "The central issue — whether familial, political or personal relationships have rendered the justices unfit to decide the case — is hardly frivolous.",
    "But the subtext is hard to ignore: The Supreme Court has a one-justice Democratic majority that could well invalidate the Republican-drawn maps.",
    "The court said last month that individual justices would evaluate charges against themselves unless those justices asked the full court to rule.",
    "(Ervin is the grandson of former Sen. Sam Ervin, the longtime North Carolina Democrat and steward of Senate hearings on the Watergate scandal.)",
    "Advertising\n Skip AdSkip AdSkip Ad\nTwenty-one of the 27 held elected posts on state supreme courts in Michigan, Pennsylvania and Wisconsin.",
    "Keith called that a red flag, signaling the rising influence of money in determining which judges define the rules for political behavior.",
    "Advertising\n Skip Ad\nThe recusal motions were later met by responses arguing that Berger, Earls and Ervin should remain on the case.",
    "Of $10.5 million spent on the state’s Supreme Court races in 2020, $6.2 million was devoted to a single race, for chief justice.",
    "Both Michigan and Wisconsin are among the top five states in spending for supreme court races, the Brennan Center study found.",
    "Most Read Nation & World Stories\nThe court has become increasingly partisan, largely at the Republican legislature’s behest.",
    "Legislators ended public financing for Supreme Court races in 2013, and made elections partisan contests in 2016.",
    "But he did not rule out drastic action should the court go further and dictate how the maps should be drawn.",
    "Most interest group spending has involved so-called dark money, in which donors’ identities are hidden.",
    "Sponsored\n Skip Ad\n Skip Ad\n Skip Ad\n Skip Ad\n“The battle is bigger than redistricting,” he said.",
    "The Republican legislators then asked another Democratic justice, Anita Earls, to recuse herself.",
    "Republicans noted that lawyers from the coalition represent Common Cause in the gerrymander case.",
    "Nationwide, 38 of 50 states elect justices for their highest court rather than appoint them.",
    "They argued that Samuel Ervin should not hear election-law cases until his race is decided.",
    "The state Code of Judicial Conduct suggests that some of the complaints could carry weight.",
    "“Two things are happening,” said Douglas Keith, a co-author of the Brennan Center report.",
    "But the high stakes reflect what may happen elsewhere — and in some cases, already has.",
    "“It is a microcosm of the partisan polarization that I think we’re all experiencing.",
    "But they have outspent conservatives in recent races in Michigan and North Carolina.",
    "Most other states require independent reviews that even then may not be binding.",
    "In North Carolina, the justices seem likely to reject calls for their recusal.",
    "Similarly lopsided state legislative maps are also being contested.",
    "Justices do disqualify themselves, but how frequently is unclear.",
    "State supreme courts decide more than 10,000 cases every year.",
    "Advertising\n Skip Ad\nCampaign spending underscores the trend.",
    "The U.S. Supreme Court issued 68 opinions in its last term.",
    "Knocking justices off the case could change that calculus.",
    "They were later joined by lawyers for Common Cause.",
    "Liberal groups have not matched that success.",
    "For decades, those races got scant attention.",
    "Mike DeWine, a Republican — was a defendant.",
    "North Carolina is another top-five state.",
    "Woodhouse said that was not his intent.",
    "Both figures are state records.",
    "The money has brought results.",
    "Read it here."
  ]
}