{
  "id": 3429,
  "mediaId": 8379,
  "date": "2022-01-28",
  "headline": "Ohio details $1.2 billion in incentives it gave Intel for computer chip plant",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/01/intel-rendering-012821.jpg?w=1280",
  "link": "https://www.nbc4i.com/intel-in-ohio/ohio-to-detail-incentives-it-gave-intel-for-computer-chip-plant/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Hofmann",
  "authorUrl": "https://www.nbc4i.com/author/brian-hofmann/",
  "termIds": [
    0
  ],
  "sentences": [
    "Development Director Lydia Mihalik broke down the incentives into two main categories:\n$600 million in incentive grants\n$691 million invested into infrastructure\nThe incentive grants amount to $300 million for each of the two computer chip plants that Intel has planned.",
    "Renderings of Intel facility\nThe infrastructure investment breaks down to about $100 million for water and wastewater capacity upgrades in the area, and nearly $300 million each for road improvements and a water reclamation facility.",
    "And New Albany announced it will extend to Intel its complete property tax abatement that it offers other occupants of its International Business Park for 30 years.",
    "Eligibility for the grants will be performance-based, and the state will have the option to end eligibility or reclaim funds if certain standards are not met.",
    "Also on Friday, JobsOhio, a private economic development group that receives state funding, said it is offering Intel up to $150 million in grants.",
    "Mike DeWine and Intel CEO Patrick Gelsinger announced a $20 billion plan to manufacture computer chips in Licking County.",
    "The plant, on land in Jersey Township that will be annexed into New Albany, is expected to create at least 20,000 jobs.",
    "In addition, a recently passed law makes Intel eligible for a $650 million job creation tax credit over 30 years.",
    "Mihalik said some of the funds still need final approval either by state boards or the General Assembly.",
    "On Friday, the state development department outlined what Ohio agreed to in order to land the project.",
    "Intel will be required to report its number of employees and other factors to determine eligibility.",
    "Intel said Ohio beat out 40 others as it ramps up computer chip manufacturing in the United States.",
    "Jon Husted described it as Ohio making an investment of 6 cents for every dollar Intel is.",
    "COLUMBUS, Ohio (WCMH) — A week ago, Gov.",
    "Lt. Gov."
  ]
}