{
  "id": 3466,
  "mediaId": 8496,
  "date": "2022-02-02",
  "headline": "'Difficult for our crews to keep up': ODOT warns drivers to expect tough road conditions during winter storm",
  "image": "https://media.wkyc.com/assets/WKYC/images/19237650-5f38-4fb3-9539-5dd56e25e8d4/19237650-5f38-4fb3-9539-5dd56e25e8d4_1140x641.jpg",
  "link": "https://www.wkyc.com/article/weather/odot-prepares-winter-storm-northeast-ohio-snow-plows/95-9fc2b80d-474b-4bb5-a276-491ed75ca191",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "… Especially through the night, when there’s less traffic and it’s snowing as heavy as one to two inches an hour, you may see more plowing than you do treating.”\nOn Tuesday morning, ODOT officials said their goal is to keep roads passable during winter storms to help ensure that emergency services and essential workers can safely reach their destinations.",
    "We do have some auxiliary drivers that we have called in to help out with this storm.”\nWe streamed ODOT's preparations live, which you can watch in the player below:\nThere’s also 166,000 tons of salt on hand, but you’ll primarily notice trucks plowing with this storm at first.",
    "This particular storm is expected to drop a lot of snow quickly, and when we see that much snow accumulate on our roadways that fast, if we treat the roads, it’s just going to get covered with snow and so it won’t be as effective.",
    "\"We are anticipating them to be snow-covered.”\nODOT crews will be working 12-hour shifts, but even fully staffed officials are warning drivers to expect tough travel conditions during the winter weather event.",
    "If we’re having the visibility issues we’re expected to get with this particular storm, our crews are going to have to slow down even more than that.”\nHer best advice?",
    "“But even with our crews out in full force, roads will likely be snow and ice-covered, and it will take much longer to travel,” said ODOT Director Jack Marchbanks.",
    "ODOT says their goal is to have the average traffic speed on primary routes back to within 10 mph of the posted speed limit within two hours after the storm ends.",
    "CLEVELAND — Prepare for some difficult driving conditions Thursday as a strong winter storm makes its way through Northeast Ohio.",
    "“For those who must travel, please be safe and take it slow, giving yourself plenty of time to get to your destination,” Gov.",
    "SUBSCRIBE: Get the day's top local and national headlines sent to your email inbox each weekday morning with 3News to GO!",
    "“Once the storm moves out, our crews will be able to make progress toward getting traffic moving at regular speed.\"",
    "Mike DeWine, meanwhile, is asking Ohioans to avoid any unnecessary travel so road crews have more room to work.",
    "“Something different about this particular storm, you may see crews plowing more than you see them treating.",
    "“With the amount of snow that we’re expected to get, it’s going to be difficult for our crews to keep up.",
    "newsletter\n“It’s going to get bad,” said Crystal Neelon, ODOT District 3 Public Information Officer.",
    "Mike DeWine is asking drivers to avoid any unnecessary trips so road crews have more room to work.",
    "Our routes could take anywhere from an hour to an hour and a half to complete one round.",
    "As a result of the difficult travel expected during the storm, Ohio Gov.",
    "“If you don’t have to leave your home tomorrow, try not to leave.",
    "“In Northeast Ohio we’re going to have over 300 plow trucks out.",
    "For secondary routes, that goal is four hours.",
    "Roads are going to be bad,\" Neelon said.",
    "We are fully staffed.",
    "Stay home if you can.",
    "DeWine said.",
    "Gov."
  ]
}