{
  "id": 351,
  "mediaId": 8288,
  "date": "2022-02-21",
  "headline": "Calls for Ohio to Make Public Planning Process for Remaining ARPA Dollars",
  "image": "",
  "link": "https://www.clevescene.com/cleveland/calls-for-ohio-to-make-public-planning-process-for-remaining-arpa-dollars/Content?oid=38432514",
  "mediaOutlet": "clevescene.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Kuhlman",
  "authorUrl": "https://www.clevescene.com/author/mary-kuhlman-ohio-news-service",
  "termIds": [
    0
  ],
  "sentences": [
    "\"So there are opportunities to approach your counties, your cities, your municipalities, or if you have a local project that you would be beneficial and funded through ARPA dollars, the state is not your only avenue,\" Murnieks emphasized.",
    "William Tarter, Jr., fellow at the Center for Community Solutions, which launched the Greater Cleveland American Rescue Plan Council to examine how the dollars can be maximized, said two schools of thought are emerging.",
    "\"One that said let's get these dollars out the door to address the urgent needs of the community, and there's others who are saying, we have time, let's be methodical and deliberate,\" Tarter explained.",
    "\"If you look at what the state has already appropriated some of the ARPA funding dollars on things like infrastructure for our children's behavior-health hospitals,\" Murnieks outlined.",
    "Tarter added ARPA dollars can specifically focus on ensuring a fair and equitable recovery by addressing housing affordability, improving health-care access and supporting workers.",
    "Ohio still has billions of American Rescue Plan Act (ARPA) funds on the table, and advocates are calling for a public planning process to ensure the needs of communities are met.",
    "\"And that's something that I think can be really interesting, in terms of how those dollars are spent, how they respond to the needs of various communities across the state.\"",
    "Mike DeWine, argued it is important to avoid investing in the creation of new programs with ongoing costs beyond when ARPA dollars run dry.",
    "\"We look at the disparate impact of the pandemic, and how it impacted different portions of the population,\" Tarter pointed out.",
    "Murnieks noted half of Ohio's ARPA funds were already appropriated to the state and the other went to local governments.",
    "\"That's why we want to make sure we have a great chorus around the table that can inform those conversations.\"",
    "$2.7 billion of the more than $5 billion allotted to the Buckeye State have already been assigned.",
    "ARPA funds need to be assigned by Dec. 31, 2024, and spent by the end of 2026.",
    "Advocacy groups are calling for public input on how the money will be spent.",
    "Kim Murnieks, director of the Office of Budget and Management for Gov.",
    "\"They're one-time costs that have lasting benefits to communities.\""
  ]
}