{
  "id": 367,
  "mediaId": 2643,
  "date": "2022-02-26",
  "headline": "Governors Push Retailers to Stop Selling Russian Products in Nod to Ukraine",
  "image": "",
  "link": "https://www.newsweek.com/governors-push-retailers-stop-selling-russian-products-nod-ukraine-1683011",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fatma Khaled",
  "authorUrl": "https://www.newsweek.com/authors/fatma-khaled",
  "termIds": [
    0
  ],
  "sentences": [
    "The governor said that Russian Standard is currently selling around 6,400 bottles of vodka across the state's 487 liquor agencies, according to Ohio Liquor Control, a division of the Ohio Department of Commerce that manages the wholesale and retail operations of liquor across the state.",
    "\"Vodka is one of the top Russian imports in our industry, but we have many award-winning alternatives distilled right here in Texas, including Tito's, Deep Eddy Vodka, Dripping Springs Vodka, Enchanted Rock Vodka, BlackEyed Distilling Vodka, and Western Son Vodka,\" she added.",
    "Other governors condemned Russia's attacks on Ukraine, including New Jersey Governor Phil Murphy who tweeted on Saturday: \"Over the last few days, the Ukrainian people have shown that they will not bow to thugs like Vladimir Putin.",
    "Emily Williams Knight, the president and CEO of the Texas Restaurant Association, told Newsweek on Sunday that it is still \"too soon\" to know how those economic sanctions will impact the restaurant industry and food supply chains.",
    "Similarly, Arkansas Governor Asa Hutchinson said in a statement that the Russian president \"needs to pay a price for this invasion and Russia needs to feel the full weight of the sanctions now.\"",
    "\"I've asked the members of the Texas Restaurant Association, Texas Package Stores Association & all Texas retailers to voluntarily remove all Russian products from their shelves,\" he tweeted.",
    "\"This morning I signed an Executive Order instructing @nhliquorwine outlets to begin removing Russian-made and Russian-branded spirits from our liquor and wine outlets until further notice.\"",
    "\"I think the whole world knows by now that Russia's at war with Ukraine for no apparent reason,\" Jamie Stratton, the store's partner and wine director said, according to KSNW-TV.",
    "\"Today I directed @OhioCommerce to cease both the purchase & sale of all vodka made by Russian Standard, the only overseas, Russian-owned distillery with vodka sold in Ohio.",
    "Some governors are pushing local retailers to stop selling Russian products in support of Ukraine as the country continues to face an invasion by Russian forces.",
    "\"This is a dangerous moment for all of Europe,\" Biden said, describing Putin's decision to invade Ukraine as \"a sinister vision for the rest of the world.\"",
    "The president said that the new sanctions will target Russia's largest banks, wealthy individuals, and will exclude the country from the global economy.",
    "In a similar move, Ohio Governor Mike DeWine said he ordered the halt of the purchase and the sale of all vodka made by the company Russian Standard.",
    "The push comes after Russia invaded Ukraine late Wednesday, prompting anti-war protests worldwide in support of the Eastern European country.",
    "Some restaurants across Texas already began taking down Russian imports from their menus, according to Knight, and are using alternatives.",
    "\"Retailers have been asked to immediately pull Green Mark Vodka and Russian Standard Vodka from their shelves,\" he said in another tweet.",
    "Texas Governor Greg Abbott said on Saturday that he asked retailers statewide to \"voluntarily\" stop selling Russian products in stores.",
    "\"We are monitoring the situation closely and are ready to assist our members as they navigate these uncertain times,\" she said.",
    "Russian Standard's vodka is sold under the brand names of Green Mark Vodka & Russian Standard Vodka,\" he wrote on Saturday.",
    "Newsweek contacted the Ohio Commerce Department for comment and will update the story once a response is received.",
    "Biden on Thursday announced that the U.S. and its European allies are imposing economic sanctions against Russia.",
    "A number of liquor stores in some states already began removing Russian products off their shelves.",
    "We stand with @ZelenskyyUa [Volodymyr Zelenskyy] in supporting a free and independent Ukraine.\"",
    "Hutchinson also called on President Joe Biden to \"push for the most severe sanctions now.\"",
    "In Wichita, Kansas, Jacob Liquor Exchange has taken down all of its Russian vodka bottles.",
    "In Grand Rapids, Michigan, Bob's Bar also stopped selling the Russian vodka bottles.",
    "But yeah, it's a small statement on behalf of this local bar here.",
    "\"We need to give Ukraine all the defensive arms we can muster.",
    "It's not gonna cause Vladimir [Putin] to move out of Ukraine.",
    "It's what I can do,\" Bob Quay, the bar's owner, told WOOD-TV.",
    "There's no reason for them to invade the Ukrainians.\"",
    "\"The rest of the free world must support Ukraine.",
    "Europe needs to do more,\" he said.",
    "There's no reason to support it.",
    "\"I mean, it's just a statement.",
    "Ukraine knows how to use them.\"",
    "\"I guess this is our sanction.",
    "We don't support it."
  ]
}