{
  "id": 3691,
  "mediaId": 8413,
  "date": "2022-01-19",
  "headline": "Ohio Redistricting Commission offers few details on how it will draw constitutional maps",
  "image": "https://www.gannett-cdn.com/presto/2021/10/28/NCOD/b87ab956-0526-40d4-8a50-260d2b7f0d1d-Ohio_redistricting_protest_fs_3.jpg?crop=1999,1124,x0,y98&width=1999&height=1124&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/2022/01/18/ohio-redistricting-commission-works-new-maps/6554643001/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    1710,
    5185,
    5761,
    3469,
    1489,
    1267,
    973,
    6311,
    6474
  ],
  "sentences": [
    "District maps:Ohio Supreme Court case interviews detail how negotiations on Statehouse maps fell apart\nMap reactions:DeWine weighs in on legislative redistricting breakdown: 'They were not going to move, ever'\nWhat to do with Ohio's primary?",
    "With days to draw new state House and Senate maps, the seven-member Ohio Redistricting Commission set some bare-bones guidelines for the task ahead of it: work together and try to match the statewide voting preferences of Ohioans.",
    "\"They've determined that that needs to be closely followed, or the number of seats needs to closely follow that ratio,\" said Speaker Bob Cupp, R-Lima, a co-chairman of the commission, which met Tuesday morning.",
    "\"These folks are not used to working in a bipartisan fashion, and that was really clear in September,\" said Catherine Turcer, executive director of Common Cause Ohio and longtime redistricting reform advocate.",
    "\"Consistent with the court’s ruling, individual commission members will have access to other commission members’ relevant staff and contractors,\" according to a joint statement from the commission's members.",
    "Those statewide voting preferences amount to about 54% of voters preferring GOP candidates and about 46% selecting Democratic ones, the court ruled last week, giving the commission 10 days to redraw maps.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "Another co-chairman, Sen. Vernon Sykes, D-Akron, put it simply: \"We are required to attempt to do that unless there's some other, technical guidance that prevents us from doing it.\"",
    "The only new member of the Ohio Redistricting Commission is Rep. Allison Russo, D-Upper Arlington, whom Democrats recently selected to replace Rep. Emilia Sykes as their leader.",
    "Redistricting:Ohio Supreme Court strikes down state House and Senate maps\nOhio Supreme Court:The courtrt ordered the redistricting commission to redraw legislative maps.",
    "But the commission offered little insight into how they would draw maps that meet both technical requirements and anti-gerrymandering provisions by the end of Saturday.",
    "Mike DeWine, Secretary of State Frank LaRose and Auditor Keith Faber – had no access to mapmaking software and little role in the districts drawn.",
    "On Monday, several legislative staff members, both Republican and Democratic, met to discuss possible ways to comply with the court's decision.",
    "Finally, the commission was speaking the same language Tuesday – albeit after an Ohio Supreme Court decision forced Republican members' hands.",
    "Commission members didn't say when they would meet next or how the public could offer input on the maps, once they are introduced.",
    "\"What we would like to see is bipartisan discussion about the maps in public so that they're more likely to come to better maps.\"",
    "During the last mapmaking effort, legislative Republicans and Democrats each had their own staff members working on districts.",
    "Cupp said that House Republicans weren't interested in moving the primary filing deadline, currently Feb. 2, or the primary.",
    "That frustrated advocates of redistricting reform who were left unimpressed by the commission's initial efforts this fall.",
    "They proved that in 2020, these are enormously dedicated, hard-working people, but they need finality very soon.\"",
    "LaRose, in letters, asked legislative leaders for some latitude to adjust election administration deadlines.",
    "New maps could last for 10 years if they received support from both Democrats and at least two Republicans.",
    "LaRose called the GOP's explanation of the maps \"asinine\" in a text message to his chief of staff.",
    "Ohio election officials need to start the process of setting up a primary, which is set for May 3.",
    "That could lead to about 54 GOP-leaning seats and 45 Democratic-leaning seats in the Ohio House.",
    "Advocates of redistricting reform are urging a better, more transparent process for round two.",
    "Commission members agreed on which data to use: statewide results between 2016 and 2020.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "LaRose made clear that the court's deadline wasn't the only one that mattered.",
    "The last Ohio Redistricting Commission ended in gridlock and frustration.",
    "The Ohio Supreme Court also ordered commission members to work together.",
    "\"The sooner we can get finality, the better,\" LaRose told reporters.",
    "\"That is not something in contemplation at this time,\" Cupp said.",
    "Without that bipartisan support, they would last for four years.",
    "The three statewide elected officials on the commission – Gov.",
    "She said the task ahead of them was difficult but achievable.",
    "They did not agree on which maps to use as a starting point.",
    "\"They (election officials) can pull off some miracles.",
    "I know that we can get this work done,\" Russo said.",
    "\"So, we're working to comply with the decision.\"",
    "But he doesn't want to move the actual primary.",
    "We are experienced people on this commission.",
    "\"It is hard, but we are smart.",
    "What happens next?",
    "Working together?",
    "That will change.",
    "We are talented."
  ]
}