{
  "id": 3697,
  "mediaId": 8413,
  "date": "2022-01-24",
  "headline": "Ohio's House Bill 6 corruption case: 'It's all systems go,' former federal prosecutor says",
  "image": "https://www.gannett-cdn.com/presto/2020/07/21/PCIN/40cc9db8-9bba-4404-b310-0b3cad5aceaf-OHCOL_072220_PB_CORRUPTION_04.JPG?crop=2499,1406,x0,y138&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/01/24/house-bill-6-corruption-case-new-prosecutor-other-pieces-fall-place/9129198002/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura A. Bischoff",
  "authorUrl": "https://www.dispatch.com/staff/7138143002/laura-a-bischoff/",
  "termIds": [
    2933,
    2774,
    5211,
    5836,
    494,
    6060,
    6474
  ],
  "sentences": [
    "\"It's all systems go, depending on COVID concerns,\" DeVillers said\nThe case burst into public view in July 2020 when federal agents arrested then Ohio House Speaker Larry Householder, former Ohio GOP chairman Matt Borges, lobbyists Juan Cespedes and Neil Clark and political strategist Jeff Longstreth.",
    "Where HB 6 case stands now\nOver the past 18 months, the case saw some dramatic developments:\nFirstEnergy Corp. fired top executives and disclosed it paid $4.3 million to Sam Randazzo just before he became chairman of the Public Utilities Commission of Ohio.",
    "Ohio Statehouse Corruption Case:What you need to know\nFederal prosecutors say Householder and the others participated in a conspiracy that funneled $60 million from Akron-based FirstEnergy Corp. through political dark money groups.",
    "Laura Bischoff is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "The investigators – Rivers and his FBI agents, Parker and his team of attorneys – continue to look at House Bill 6 related threads and present witnesses to the grand jury, he said.",
    "Randazzo and former FirstEnergy executives, who are implicated in the company's deferred prosecution agreement, have not been charged and have said publicly they did nothing wrong.",
    "Former U.S. Attorney for the Southern District of Ohio, David DeVillers, said he's certain Black will set the trial date at the conference call this week.",
    "The cash was used to return Householder to speaker and in turn pass and protect a $1 billion bailout bill to benefit FirstEnergy and other utilities.",
    "In recent months, pieces have fallen into place for the federal government to move forward on the biggest public corruption case in state history.",
    "U.S. District Court Judge Timothy S. Black elected to take \"senior status,\" freeing him to focus on cases he chooses to handle.",
    "He also noted that while there are still some COVID-related delays, juries and grand juries are back at work.",
    "Black will hold a status conference Wednesday, and he set Feb. 1 as the deadline for all pre-trial motions.",
    "FirstEnergy signed a deferred prosecution agreement and acknowledged it bribed Randazzo and Householder.",
    "DeVillers said if more defendants are added to the current indictment, \"that would slow down the trial.",
    "The case is on two tracks right now: the ongoing investigation and the upcoming trial, DeVillers said.",
    "A new boss, Will Rivers, is in place as the special agent in charge at the FBI Cincinnati office.",
    "I'm not saying that's going to happen....who gets charged, when they get charged, I don't know.\"",
    "Clark died by suicide in Florida, while wearing a Mike DeWine for governor t-shirt.",
    "Parker declined to say if or when more people may be charged in the case.",
    "Massive spy case concluded, freeing up lead prosecutor Emily Glatfelter.",
    "Federal agents searched Randazzo's condo and he resigned from the PUCO.",
    "\"We're going to go where ever any evidence takes us.\"",
    "Clark's family published his memoir after his death.",
    "Householder and Borges have pleaded not guilty.",
    "New U.S. Attorney Ken Parker sworn into office.",
    "Check.",
    "Check.",
    "Check.",
    "Check."
  ]
}