{
  "id": 3801,
  "mediaId": 2919,
  "date": "2022-01-21",
  "headline": "Redistricting commission gives glimpse of Franklin, Hamilton county maps as talks continue",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/de1f097/2147483647/strip/true/crop/1024x538+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fa8%2F28%2F430a878a4240b50ce88699cf8cf5%2Fscreen-shot-2022-01-20-at-7.13.44-PM-1024x769.png",
  "link": "https://www.news5cleveland.com/news/state/redistricting-commission-gives-glimpse-of-franklin-hamilton-county-maps-as-talks-continue",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Tebben",
  "authorUrl": "https://www.news5cleveland.com/susan-tebben",
  "termIds": [
    5761,
    3469,
    2143,
    1489,
    392,
    1126,
    6164,
    6201,
    6703,
    6673
  ],
  "sentences": [
    "Democratic caucus staffer Chris Glassburn presented the Democratic map proposals, saying the minority party made several concessions to what the GOP asked for, such as extending the Hamilton County districts into Warren County rather than Butler County\nGlassburn said staff for the Democrats have been putting their heads together to get to map proposals that meet the standards spelled out in the Ohio Constitution and the Ohio Supreme Court order.",
    "The commission is taking a “regional approach” to map-making, according to Sykes, who said he came up with the idea to look at the “building blocks” of the maps statewide, rather than a blanket approach to the entire state.",
    "But the commission gave an update on the process Thursday, after pushing back their meeting time in an attempt to “see if we can come a little closer” to agreement, according to co-chair state Sen. Vernon Sykes, D-Akron.",
    "The House districts proposed in the Democratic caucuses Franklin County map would have 10 strongly leaning Democrat, one leaning strongly Republican, and one (District 10) split 48.96% to 48.72% with a GOP advantage.",
    "Mike DeWine asked Glassburn if it was clear the two sides were working toward the goal of complying with the supreme court decision, including all of the sections of the constitution regarding redistricting.",
    "The Republican proposals for the House would have 11 Democratic-leaning districts in Franklin and Union counties and one Republican leaning district, according to numbers provided with the maps.",
    "“That has not been the instruction that has been expressed by the other map drawers and the other people that we’ve been working with, and that has been a significant obstacle,” Glassburn said.",
    "Districts 27 and 28 could be more like toss-up districts based on GOP numbers, with District 27 having only a 50.1% advantage to the Democrats, and District 28 holding a 51%-48% Dem advantage.",
    "“I think there must be some miscommunication somewhere, because the directions to our staff have been to draw district maps that fully comply with the constitutional requirements,” Cupp said.",
    "The commission also might be looking at congressional maps, which were rejected by the state’s highest court the same week as the legislative maps, and now have to be redone within 30 days.",
    "The General Assembly is tasked to correct them within 30 days, a mid-February deadline, but if they can’t come to an agreement, the ORC may be brought in to make that decision as well.",
    "The House districts in the Democratic Hamilton County proposal would have four Democratic leaning, two Republican, and one (District 27) with a 49%-48% split leaning Dem.",
    "House Speaker and commission co-chair Bob Cupp said there has been collaboration between state Republicans and Democrats on the commission, but no agreement quite yet.",
    "The Democrats’ reply has two Democratic leaning districts in the Hamilton County Senate seats, and one that could be a toss-up, with a 49%-48% Democratic advantage.",
    "In Hamilton and Warren counties, the proposal from the Republicans would lead to five districts in Hamilton County leaning Democratic, and two leaning Republican.",
    "The Republican maps were posted to the Ohio Redistricting Commission’s website, and a Democratic “reply” was sent to media for each of the House and Senate maps.",
    "The commission is working on a Saturday deadline, based on the Ohio Supreme Court order giving them 10 days from the date of the order to complete a new map.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "The proposal would result in one Democratic leaning district in the Senate for Hamilton and Warren Counties, with two others leaning Republican.",
    "Franklin County’s Senate seats would lean Democratic in three instances, with one district (District 6) holding a 48.95%-48.74% Dem advantage.",
    "The Republicans and Democrats released map proposals for four specific counties on Thursday: Franklin, Union, Hamilton and Warren Counties.",
    "After the meeting, Cupp said as far as his staff is concerned, fulfilling the supreme court directive was the commitment for the staffers.",
    "The Ohio Redistricting Commission still hasn’t come to a complete agreement on new district maps ordered by the Ohio Supreme Court.",
    "But he said multiple times during Thursday’s commission meeting that “the other side” has not seen fit to do the same.",
    "“The staff has been working on both sides … what’s before the commission right now is not comprehensive,” Sykes said.",
    "The Senate proposal has four districts leaning Democratic and none leaning Republican in those counties.",
    "Warren County would have two Republican leaning districts in the House, and no Democratic districts.",
    "The public then has three days to file objections to the maps, which the court will then consider.",
    "Gov."
  ]
}