{
  "id": 3921,
  "mediaId": 8266,
  "date": "2022-01-21",
  "headline": "'This is just the beginning,' Biden says as Intel plans $20 billion semiconductor complex in Ohio amid chip shortage",
  "image": "https://www.gannett-cdn.com/presto/2022/01/21/USAT/3f4ca94d-a048-43d9-8056-97c6e9967039-biden_intel.jpg?crop=5859,3296,x0,y297&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/01/21/intel-20-billion-semiconductor-ohio-plant-chip-shortage/6603101001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatoday-newstopstories",
  "mediaOutlet": "auroraadvocate.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Williams",
  "authorUrl": "https://www.dispatch.com/staff/5748338002/mark-williams/",
  "termIds": [
    0
  ],
  "sentences": [
    "More:Here's how Ohio won a bid by Intel to build the world's largest chip factory\nCommerce Secretary Gina Raimondo said car manufacturing that slowed during the pandemic has fueled a third of rising inflation, which last month soared to a 39-year high in the U.S. She said increasing semiconductor production domestically will shore up supply chains, bring costs down and keep manufacturing jobs from going overseas.",
    "WASHINGTON — Intel, the world's largest semiconductor manufacturer, unveiled plans Friday to build a $20 billion complex outside of Columbus, Ohio, a move President Joe Biden hailed as a major sign of progress in his administration's work to boost U.S. production of the critical microchips.",
    "'REALLY AWESOME CHRISTMAS PRESENT':Intel picks Greater Columbus for what could be the world's largest semiconductor operation\nHISTORIC TURN:Toyota outsells GM for first time – but can it keep the crown once chip shortage ends?",
    "Biden called the project, which will include two factories spanning 1,000 factories in New Albany, Ohio, a \"game-changer\" to revive the Midwest's hollowed out industrial sector and address supply-chain bottlenecks.",
    "\"To be able to say 'made in Ohio,' 'made in America,' we used to always be able to say that 25, 30 years ago,\" Biden said in remarks from the White House with Intel CEO Pat Gelsinger on hand.",
    "The COVID-19 pandemic has led to a shortage of semiconductor microchips, which power thousands of products such as cars, cell phones, appliances, gaming consoles and medical devices.",
    "\"Advanced manufacturing, research and development, and talent are part of Ohio’s DNA, and we are proud that chips – which power the future – will be made in Ohio, by Ohioans.”",
    "Intel CEO Pat Gelsinger likened the future Ohio mega site to a \"small city,\" calling its impact on the community \"simply profound\" and a magnet for the entire tech industry.",
    "\"Ultimately, we hope to establish the largest semiconductor manufacturing site on the planet,’’ Gelsinger and Senior Vice President Keyvan Esfarjani told DeWine and Lt. Gov.",
    "\"A COVID disruption, a typhoon, political instability in another country has the potential to shut down an auto facility and harm American families in places like Ohio.\"",
    "DeWine, a Republican, who played a central role in talks with the company, was not present but will join the senators in Ohio later Friday to discuss plans further.",
    "The Senate bill is part of a revised United States Innovation and Competition Act, which would authorize more than $90 billion for research and manufacturing.",
    "The project, which will be Intel's first new manufacturing site in 40 years, includes two semiconductor fabrication plants, or what the company calls fabs.",
    "The president also urged Congress to pass the CHIPS for America Act, which would provide $52 billion to incentivize future semiconductor investments.",
    "It eventually could involve eight factories and $100 billion in investment over the next decade, including Intel and its suppliers and partners.",
    "DeWine, who engaged in negotiations with Intel for eight months, called the factories \"monumental news for the state of Ohio\" in a statement.",
    "The shortage depleted vehicle inventory, producing global supply chain issues and increasing consumer prices on automobiles and other goods.",
    "Since the beginning of 2021, the semiconductor industry has announced $80 billon in new projects in the U.S., according to the White House.",
    "\"And the only way to address this economic and security risk is to increase our domestic semiconductor manufacturing capacity.\"",
    "He said the company's decision was motivated by the CHIPS Act, which would allow the complex to be built \"bigger and faster.\"",
    "\"Today our semiconductor supply chain is far too dependent on conditions and countries halfway around the world,\" she said.",
    "Currently, 12% of the world's chips are made in the U.S., down from 37% in the 1990s, according to industry officials.",
    "Ohio's two U.S. senators, Democrat Sherrod Brown and Republican Rob Portman, joined Biden to announce the project.",
    "The Ohio project is expected to create 3,000 construction jobs and an additional 7,000 construction jobs.",
    "\"I want other cities and states to be able to make announcements like the one being made here today.",
    "\"As a country we cannot rely solely on imports for such essential technology,\" Gelsinger said.",
    "Construction is expected to start this year, with the first chips being produced by 2025.",
    "It would be the largest private sector investment in Ohio history, according to Ohio Gov.",
    "And that's why I want to see Congress pass this bill right away and get it to my desk.\"",
    "Speaker Nancy Pelosi said House Democrats would introduce its version soon.",
    "It's the latest in a string of semiconductor projects announced this year.",
    "Increasingly, the U.S. has relied on foreign imports for computer chips.",
    "Mike DeWine, who helped negotiate with Intel to attract the project.",
    "\"This is just the beginning,\" Biden said.",
    "Jon Husted in a letter last month.",
    "\"That's what this is about.\"",
    "About 80% are made in Asia."
  ]
}