{
  "id": 3933,
  "mediaId": 8455,
  "date": "2022-01-24",
  "headline": "Proposal seeks to move Ohio's primary date",
  "image": "https://www.toledoblade.com/image/2022/01/24/600x_q90_a4-3_cTCjpg/Election-2022-Ohio-2.jpg",
  "link": "https://www.toledoblade.com/local/politics/2022/01/24/proposal-seeks-move-ohios-primary-date/stories/20220124117",
  "mediaOutlet": "The Toledo Blade",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We had a second chance to draw fair maps, but with the possibility of another court challenge, we must prepare to delay the primary.”\nDemocrats contend that 12 of the 42 purported Democratic districts in the Ohio House and four of the would-be 13 seats in the Ohio Senate would just barely register as “light blue.”\nRepublicans countered that a 57-42 split was the best that could be done without violating other provisions of the Ohio Constitution requiring geographically compact districts that did not unnecessarily split counties and municipalities.",
    "“All through this discussion we talked about districts that lean one way or the other, but the reality is, as I've learned from being involved in many races for many years, that ultimately in close districts, it's still going to come down to the candidate, down to what the momentum is for that year, where the voters are that particular year.”\nFirst Published January 24, 2022, 11:10pm",
    "In its 4-3 decision on Jan. 12 rejecting previous maps, the state high court found the commission did not “attempt” to draw legislative districts that generally reflected Ohioans' voting preferences as required by gerrymandering reforms state voters approved in 2015.",
    "House Assistant Minority Leader Thomas West (D., Canton), president of the Ohio Legislative Black Caucus, and Rep. Lisa Sobecki (D.,Toledo), chairman of the Ohio Democratic Women’s Legislative Caucus introduced House Bill 544, an announcement stated.",
    "COLUMBUS – Legislation was introduced Monday to move Ohio’s 2022 primary election date to June 7, action that two state lawmakers reported was in response to the uncertainty surrounding Ohio’s new congressional and state legislative maps.",
    "The Republican-dominated Ohio Redistricting Commission again voted along party lines on Saturday for GOP-drawn legislative district maps, betting it made enough changes to sway at least one member of the state Supreme Court.",
    "“We feel that this change to the election calendar is necessary to ensure that Ohioans have a thorough understanding of their new districts and the candidates running in those districts,” Rep. West said in a statement.",
    "Mike DeWine, a Republican and a member of the Republican-dominated Ohio Redistricting Commission, said on Saturday, “I think we complied with what the Supreme Court said.”\n“...I think it's a fair map,” Mr. DeWine said.",
    "Democrats had proposed maps with ratios of 54-45 and 18-15, closely corresponding with how Ohioans have actually voted over the last decade and the ratio pointed to by the Supreme Court.",
    "“We haven’t seen a map that does get down to 54 in the House that is compliant with the Ohio Constitution,” the House Republicans’ map-maker, Blake Springhetti, said this past weekend.",
    "“We need to move the primary date to June because of uncertainty and unknowns about the new district lines after Republicans failed to draw fair maps the first time,” she said.",
    "On Monday, Ms. Sobecki said in a statement that hundreds of Ohioans testified and demanded fair districts, but they were ignored by the Republican commissioners.",
    "The GOP plan purports to create a 57-42 Republican majority in the Ohio House of Representatives and 20-13 in the state Senate.",
    "Those early maps, adopted in September, were seen as largely locking in much of the current GOP super-majorities.",
    "Currently, Feb. 2 marks the deadline for candidates to file to run in the May 3 primary election.",
    "Republicans currently hold 65-34 and 25-8 super-majorities in those respective chambers.",
    "The bill would also move the filing deadline for legislative candidates to March 3.",
    "Gov."
  ]
}