{
  "id": 3985,
  "mediaId": 8462,
  "date": "2022-01-20",
  "headline": "Ohio National Guard provides support at Wexner Medical Center as omicron variant spreads",
  "image": "https://www.thelantern.com/files/2020/09/DSC_0652.jpg",
  "link": "https://www.thelantern.com/2022/01/ohio-national-guard-provides-support-at-wexner-medical-center-as-omicron-variant-spreads/",
  "mediaOutlet": "thelantern.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daria Novikov",
  "authorUrl": "https://www.thelantern.com/author/daria-novikov/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Seeing help arrive and having people to work side by side with you, and again, their positive attitude, has really been important to the overall morale of our institution.”\nStokes said he and his fellow Guard members have been welcomed by the hospital’s workers, which makes their deployment much easier.",
    "“That helps us to be able to perform our mission when we have that kind of support from hospital staff as well.”\nStokes said many of the Guard members are serving in their own community, which helps nurture the relationship between them and hospital staff.",
    "“The general public was getting omicron more, but our own staff was also getting it more.”\nBachmann said the presence of the Guard serves to relieve hospital employees, whose workload has increased enormously since December’s spike in COVID-19 cases.",
    "“There’s no one single most important person in an organization, and that includes in our hospital; if we can’t get our beds clean, then that would shut it down, just like not having a doctor or nurse to take care of the patients,” Bachmann said.",
    "Mike DeWine and Maj. Gen. John Harris assigned units of the Ohio National Guard to assist local hospitals, including the Wexner Medical Center at Ohio State, in response to the omicron variant.",
    "Bachmann said a number of Guard members with clinical training are working with the emergency department and COVID-19 testing site in the CAS parking garage on Olentangy River Road.",
    "“Omicron, by many metrics, broke previous records for the pandemic, meaning more patients hospitalized, more cases per day, more staff out with COVID,” Bachmann said.",
    "Dr. Daniel Bachmann, medical director for the medical center’s East Hospital, said the guard’s deployment came at a time of unprecedented COVID-19 hospitalizations.",
    "1st Class Jason Stokes, Black Hawk crew chief for the Guard, said members help with transportation, nutrition, kitchen and environmental services.",
    "As hospitals reach capacity due to the omicron surge, the Ohio National Guard has found its way to campus to help.",
    "“A lot of the soldiers, airmen, including myself, are born and raised from the area, from central Ohio.",
    "He said members with little experience working in hospitals are lending a hand in other areas.",
    "A crucial, intrapersonal effect also emerged from the Guard’s deployment, Bachmann said.",
    "“We’re happy to be here, to be able to work within our community,” Stokes said.",
    "“It has stressed our medical system in a way that we’ve never seen before.",
    "To use the word historic is not being superlative,” Bachmann said.",
    "They’ve taken very good care of us in all areas,” Stokes said.",
    "There’s an ability to basically help out our fellow Ohioans.”",
    "“The hospital staff is very happy to have us.",
    "On Dec. 27, 2021, Gov.",
    "Sgt."
  ]
}