{
  "id": 4149,
  "mediaId": 8473,
  "date": "2022-01-21",
  "headline": "Fri. 8:57 a.m.: Intel building $20B Ohio chip facility amid global shortage",
  "image": "https://ogden_images.s3.amazonaws.com/www.tribtoday.com/images/2022/01/21085630/AP22021459365892-750x500.jpg",
  "link": "https://www.tribtoday.com/news/latest-news/2022/01/fri-857-a-m-intel-building-20b-ohio-chip-facility-amid-global-shortage/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "2 semiconductor manufacturer globally, with $73.1 billion in revenue last year, behind South Korean world leader Samsung Electronics with $76 billon, according market analysis from Gartner Inc.\nCentral Ohio, long known for a largely white-collar workforce, has added high-tech jobs in recent years, with Amazon, Facebook, and Google all building data centers in the region.",
    "Two chip factories on the 1,000 acre site in Licking County, just east of Columbus, are expected to create 3,000 company jobs and 7,000 construction jobs, and to support tens of thousands of additional jobs for suppliers and partners, the company and local and state officials announced today.",
    "It’s also pitching for European subsidies to build a big plant somewhere within the European Union and last month said it will invest $7.1 billion to expand its decades-old manufacturing operation in Malaysia, home to roughly 10 percent of the company’s global workforce.",
    "Micron Technology, based in Boise, Idaho, said it will invest $150 billion globally over the next decade in developing its line of memory chips, with a potential U.S. manufacturing expansion if tax credits can help make up for the higher costs of American manufacturing.",
    "The plants are expected to create 3,000 Intel jobs and 7,000 construction jobs over the course of the build, and to support tens of thousands of additional local long-term jobs across a broad ecosystem of suppliers and partners.",
    "After years of heavy reliance on Asia for the production of computer chips, vulnerability to shortages of the crucial components was exposed in the U.S. and Europe as they began to emerge economically from the pandemic.",
    "(AP Photo/Richard Drew, File)\nCOLUMBUS (AP) — Intel will invest $20 billion in a new computer chip facility in Ohio amid a global shortage of microprocessors used in everything from phones and cars to video games.",
    "The U.S. share of the worldwide chip manufacturing market has declined from 37 percent in 1990 to 12 percnt today, according to the Semiconductor Industry Association, and shortages have become a potential risk.",
    "The Intel project is the largest single private-sector investment in Ohio’s history, on par with an agreement in 1977 that brought Honda to central Ohio, where it now employs more than 14,000 people.",
    "Shortages of chips have crimped the ability of U.S. automakers to produce vehicles and last year, General Motors was unseated by Toyota as the nation’s top-selling automaker for the first time.",
    "Not only has the chip shortage disrupted the U.S. economy, it is creating a vulnerability in the country’s defense system since eight of every 10 chips are produced in Asia, lawmakers say.",
    "Intel Corp. is planning an initial investment of more than $20 billion for two semiconductor chip plants in central Ohio to help address a global shortage of semiconductor chips.",
    "11:20 a.m.: Warren to face suit over Summit dam dangers\nWARREN -- The family of Lisa Zitello will file a lawsuit against the city of Warren over the lack of adequate ...\nTue.",
    "“Intel’s new facilities will be transformative for our state, creating thousands of good-paying jobs in Ohio manufacturing strategically vital semiconductors,” Ohio Gov.",
    "Several chipmakers last year signaled an interest in expanding their American operations if the U.S. government is able to make it easier to build chip plants.",
    "The U.S. and Europe are pushing to aggressively to build chip making capacity and reduce reliance on producers that are now mostly based in Asia.",
    "10:27 a.m.: Todd Rundgren announced for both Robins, Packard\nWARREN — Todd Rundgren will be making two appearances in Warren five weeks apart.",
    "Separate federal legislation also under consideration would create a new tax credit for investment in semiconductor manufacturing facilities.",
    "They want Congress to fully fund the $52 billion CHIPS for America Act, allowing for stateside investment in semiconductor factories.",
    "Lawmakers have been urging House and Senate leaders to fully fund a law meant to address the semiconductor chip shortage.",
    "Intel, based in Santa Clara, Calif., announced plans last year to spend $20 billion for two new factories in Arizona.",
    "In this October 2019 photo, the symbol for Intel appears on a screen at the Nasdaq MarketSite, in New York.",
    "11:15 a.m.: State awards $3.4M toward St. Joseph Riverside demo\nWARREN Ohio Governor Mike DeWine and Lt.",
    "Along with the U.S. and Malaysia, Intel also has existing plants in Ireland, Israel, Vietnam and China.",
    "Construction is expected to begin this year, with production coming online at the end of 2025.",
    "Samsung said in November it plans to build a $17 billion factory outside of Austin, Texas.",
    "Chipmakers are diversifying their manufacturing sites in response to the shortages.",
    "Governor Jon Husted today awarded more than $60 million in funding to ...\nTue.",
    "10:41 a.m.: US consumers still confident in April, but slightly less so\nTue.",
    "NEWSLETTER\nToday's breaking news and more in your inbox\nLatest News\nTue.",
    "10:16 a.m.: Housing shortage, soaring rents squeeze US college students",
    "10:44 a.m.: Stocks fall ahead of earnings from Big Tech companies\nTue.",
    "However, demand for computer chips continues to grow.",
    "Mike DeWine said in a prepared statement.",
    "Tickets will go on sale ...\nTue.",
    "Intel is the No."
  ]
}