{
  "id": 4229,
  "mediaId": 8379,
  "date": "2022-01-24",
  "headline": "Ohio’s come-from-behind win on Intel",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/01/CBF-Intel-location.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/columbus-business-first/ohios-come-from-behind-win-on-intel/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carrie Ghose | Columbus Business First",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Among some 40 states that answered Intel’s first call for proposals, the state won largely because of a “compelling case” built by a united, collaborative team of state, local, and private persuaders, said Jason Bagley, senior director of state government relations for the California-based company.",
    "“We were focused on other areas,” he said in a downtown Newark theater – shortly after the company and Ohio officials announced that the Licking County half of New Albany will be home not only to a plant but eventually one of the largest semiconductor manufacturing complexes in the world.",
    "“This underscores the need to think years ahead.”\nSeveral speakers emphasized the state’s manufacturing workforce and the willingness of its many colleges and universities to create programs for the skills Intel needs.",
    "“This was shotgunned out to all of the regional economic development groups, a very tight turnaround,” said Steve Steinour, CEO of Columbus-based Huntington Bancshares Inc. and co-chairman of the Columbus Partnership.",
    "NEW ALBANY, Ohio (COLUMBUS BUSINESS FIRST) — Ohio was not among the first states Intel Corp. considered for its first greenfield manufacturing complex in 40 years, a lobbyist for the tech titan confirmed.",
    "“What makes this announcement truly transformative for Ohio is that from now on, any company anyplace thinking about opening a new plant will simply have to give Ohio a good look,” DeWine said.",
    "If there’s vibrations, it’s going to throw tools off.”\nUnprompted, Steinour described the economic transformation Intel will bring to the state as “an earthquake,” but a positive one.",
    "New Albany has agreements in place that will allow it eventually to annex some 3,200 acres, over several transactions, to an already 5,000-acre International Business Park.",
    "Besides jobs at Intel and its suppliers, and ripple effects to housing, retail, and education – the win forever makes Ohio stand out on the site selection map, Gov.",
    "State officials said details of an incentive package, made possible by a provision for “mega” projects in the latest two-year budget, will be released later.",
    "State and Intel officials cited Ohio’s history of innovation, including Thomas Edison and the Wright brothers, as well as a strong manufacturing heritage.",
    "Jon Husted, their administration, lawmakers, and private development groups JobsOhio and One Columbus exemplified “teamwork at its best,” Steinour said.",
    "The first two microchip fabrication plants, or fabs, will require nearly 1,000 acres, according to a promotional video on the project.",
    "As Intel took a closer look at Ohio, Bagley said, “It really started to snowball.”\nOhio first learned of the hunt in May.",
    "“The (Intel) team had very, very, very little exposure to what Ohio had,” Columbus Partnership CEO Kenny McDonald said.",
    "And here’s an obscure plus: According to U.S. Geological Survey data, Licking County has never recorded an earthquake.",
    "Once they got on the ground, it got to be a real interesting conversation about what’s possible.”\nNumber one: Land.",
    "“We hope more companies will do that in the future.”\nFor more business headlines, go to ColumbusBusinessFirst.com.",
    "“As usual, Ohio’s economy and communities are terrific – they surprise people with their depth.",
    "A federal incentive for domestic semiconductor production also is pending in the U.S. House.",
    "“They did, and I think they were quite surprised in a very positive way about what we offer.",
    "“It was very clear they had vision, they had commitment all the way through,” Bagley said.",
    "“We turned it around and we kept going at it, nights and days, weekends, very long hours.",
    "But incentives were only one of many factors, and not the deciding one, Bagley said.",
    "Ohio State University President Kristina Johnson was onstage for the announcement.",
    "A solar farm was approved Thursday in Licking County, and a second is in process.",
    "We invested in it when it wasn’t immediately clear there would be a return.”\nGov.",
    "That’s actually “super important” for semiconductor manufacturing, Bagley said.",
    "“Not everybody takes the time to look at the Midwest,” McDonald said.",
    "Several practical factors were in Licking County’s favor as well.",
    "“We don’t want to be near railroads, near airports,” he said.",
    "Intel also wants the complex to run on 100% renewable energy.",
    "For one thing, Ohio lacks an existing semiconductor industry.",
    "But we did it,” Steinour said in a phone interview.",
    "“It sounded like we were almost an afterthought.",
    "Should the deals pass, Intel can move faster.",
    "Mike DeWine said at the announcement event.",
    "“That was the first filter,” McDonald said.",
    "Mike DeWine, Lt. Gov.",
    "“It’s very serious."
  ]
}