{
  "id": 4262,
  "mediaId": 8337,
  "date": "2022-01-26",
  "headline": "Intel's $20 Billion Tech Investment Could Be Huge for Midwestern Companies",
  "image": "https://img-cdn.inc.com/image/upload/w_1024,h_576,c_fill/images/panoramic/GettyImages-615254566_493399_ovkony.jpg",
  "link": "https://www.inc.com/kevin-j-ryan/ohio-intel-20-billion-chip-manufacturing-plants.html",
  "mediaOutlet": "inc.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin J. Ryan",
  "authorUrl": "https://www.inc.com/author/kevin-j-ryan",
  "termIds": [
    0
  ],
  "sentences": [
    "Steve Case, co-founder of AOL and founder of the VC firm Revolution, pointed out in 2020 that Midwestern cities have been more successful at retaining talent in recent years--particularly in cities like Ann Arbor and Pittsburgh, which are home to major research institutions.",
    "Real estate in the Midwest is also far cheaper than in many coastal regions, which could make the area enticing to other entrepreneurs looking to start up or companies seeking secondary locations.",
    "Intel CEO Pat Gelsinger said during a news conference that he expects the move to draw more tech companies to the region, potentially turning the area into the \"the Silicon Heartland.\"",
    "The initiative could also help Ohio-based tech companies lure talent from all over the world to the state and encourage other tech companies to create headquarters in the region.",
    "The U.S. was home to about 37 percent of global chip manufacturing in the early 1990s, but that number has dropped to about 12 percent in recent years, according to the Post.",
    "The Post reports that limited auto manufacturing due to chip shortages reduced the U.S.'s gross domestic product by two percentage points during the third quarter of 2021.",
    "Ohio State University, one of the nation's largest universities by enrollment, is located just a few miles from the site, which Gelsinger said was a draw.",
    "\"Before, people would go to those great universities and leave as part of that brain drain,\" he told the audience at the Inc. 5000 Vision Conference.",
    "During a news conference on Friday, Ohio governor Mike DeWine reiterated the idea that the plants will be a boon for business in the state.",
    "\"From now on, any company any place that's thinking about opening a new plant will simply have to give Ohio a good look,\" he said.",
    "Tech giant Intel recently announced a $20 billion investment to build two semiconductor manufacturing plants near Columbus, Ohio.",
    "Intel said the two factories will create 3,000 Intel jobs and about 7,000 construction jobs, according to The Washington Post.",
    "Chip manufacturing is coming to Ohio, and it could lead to a significant boost for entrepreneurs in the area.",
    "The $20 billion investment is the first major foray into the Midwest for Santa Clara, California-based Intel.",
    "A global shortage of the chips dating back to last year has exacerbated global supply chain issues.",
    "Semiconductor chips are used in products ranging from phones to home appliances to vehicles.",
    "The company said the investment is the largest private sector investment in Ohio's history.",
    "\"Now more people graduating are staying, and some people are even returning.\"",
    "Those numbers could increase if the company builds more plants on the sites.",
    "About 75 percent of chip manufacturing today takes place in East Asia.",
    "Construction is slated to begin later this year and finish by 2025."
  ]
}