{
  "id": 4439,
  "mediaId": 8346,
  "date": "2022-01-27",
  "headline": "Ohio lawmakers approve revised map in 5-2 party line vote",
  "image": "https://kenyoncollegian.com/wp-content/uploads/2017/07/logo-placeholder.jpg",
  "link": "https://kenyoncollegian.com/news/2022/01/ohio-lawmakers-approve-revised-map-in-5-2-party-line-vote/",
  "mediaOutlet": "kenyoncollegian.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Margolis",
  "authorUrl": "https://kenyoncollegian.com/author/adammargolis/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We also conclude that the commission did not attempt to draw a plan that meets the standard in Section 6(A) —that no plan shall be drawn primarily to favor a political party.”\nFollowing the ruling, the redistricting commission was given 10 days to redraw their state legislative map.",
    "Professor Powers also noted that the distribution of districts, which favors Republicans by 52 to 42, will also likely fail to meet the Ohio Supreme Court’s order to redraw the districts in alignment with the amendment’s requirement to create proportional representation.",
    "“For Knox County voters, the commission’s January 2022 map is identical to the September 2021 map,” Professor of Political Science and Associate Director of Kenyon’s Center for the Study of American Democracy (CSAD) Nancy Powers wrote in an email to the Collegian.",
    "That redesigned congressional map would likely change the landscape for Ohio’s U.S. House seats, which would primarily affect the districts in which two incumbents will need to face off against each other to fill one seat in the upcoming midterms.",
    "In its 4-3 decision, the Ohio Supreme Court struck the proposed map down, claiming it unduly favored the Republican Party and violated a 2018 amendment to the Ohio Constitution aimed at inhibiting partisan gerrymandering in the state.",
    "Ohio’s state legislative district map was originally introduced late last year, when the Ohio House and Senate approved a map that would have given the Republican Party an additional five state House and three state Senate seats.",
    "On Saturday, Jan. 22, the Ohio Redistricting Commission voted 5-2 along party lines to approve an updated state legislative redistricting map that would give Republicans in both the state House and Senate significant majorities.",
    "Knox County is currently part of Ohio District 68, which Powers noted includes an affluent, suburban area on the northeast edge of the Columbus metro area where the district’s Republican State Rep. Rick Carfagna lives.",
    "“We hold that the plan is invalid because the commission did not attempt to draw a plan that meets the proportionality standard in Article XI, Section 6(B),” Justice Melody Stewart wrote for the majority.",
    "In the coming days, the Ohio Supreme Court will likely rule on whether or not the maps reapportioning state legislative districts meet the Ohio Constitution’s proportionality standards.",
    "Mike DeWine, opined that it would be difficult to draw a map that both respects the Ohio Constitution’s proportionality requirement and obeys the 2018 anti-gerrymandering amendment.",
    "The plan gives Ohio State House Republicans a 15-seat advantage with a 57-42 seat breakdown, and State Senate Republicans a 17-seat advantage with a 20-13 seat breakdown.",
    "So I think the newly proposed House District 98 complies with the spirit of the constitutional amendment that Ohio voters approved six years ago,” she said.",
    "They also reduced the overall number of U.S. Congressional districts the state has from 16 to 15, meaning at least one incumbent would have lost their seat.",
    "Ohio’s redrawn congressional district map, approved by the Ohio State Legislature late last year, was also struck down by the Ohio Supreme Court.",
    "“It is shameful that we are here again, adopting yet another unconstitutional map in direct contradiction to the Ohio Supreme Court,” she said.",
    "As for the state’s U.S. House district maps, lawmakers have until mid-February to come up with new plans and send them to the Court for review.",
    "Powers implied that redistricting would allow Knox County voters to select a representative with whom they have more in common.",
    "Since the plans were approved along party lines by the commission’s three Republicans, the new maps will only last four years.",
    "Ohio state Democrats argue that the new maps are not proportional, as they do not align with statewide voting preferences.",
    "In a Columbus Dispatch article, Democrat and Ohio House Minority Leader-elect Allison Russo, Ohio-24, expressed dismay.",
    "The map would have removed two of Ohio’s Democratic U.S. House seats, giving the GOP a 13-2 advantage in Congress.",
    "According to reports, about 54% of Ohio voters prefer GOP candidates, while 46% prefer Democratic candidates.",
    "In January, the Ohio Supreme Court struck that map down in a 4-3 decision, deeming it unconstitutional.",
    "The future of the newly redrawn state legislative and congressional district maps remains uncertain.",
    "Candidates for the U.S. House of Representatives are required to file to run by early March.",
    "The new state legislative maps approved on Saturday still significantly favor Republicans.",
    "However, Democratic state legislators remain displeased with the redrawn state maps.",
    "“That part of the district has little in common with the communities of Knox County.",
    "The filing date for state-level candidates is Feb. 2, 90 days before the election.",
    "Maybe there’s a map out there, but we didn’t see one,” DeWine told the Dispatch.",
    "Still, Ohio Republicans, including Gov.",
    "“I can’t say it’s impossible."
  ]
}