{
  "id": 4450,
  "mediaId": 8496,
  "date": "2022-01-26",
  "headline": "2 BGSU fraternities suspended for alleged hazing, alcohol incidents",
  "image": "https://media.wkyc.com/assets/WTOL/images/d37d2a23-5793-4d6e-9dd4-8e1a001e725d/d37d2a23-5793-4d6e-9dd4-8e1a001e725d_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/crime/bowling-green-state-university-fraternities-suspended-for-hazing-and-alcohol-violations/512-bb5bab48-247b-48c2-8a37-7ddbf5e6a7f6",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2824,
    3719,
    383,
    183,
    1043,
    5999
  ],
  "sentences": [
    "This includes, but is not limited to, providing alcohol to a person under the legal drinking age;\nFailure of a recognized student organization or student group to take all necessary steps to ensure that no person under the legal drinking age possesses alcoholic beverages at functions it sponsors or within any property or transportation it owns, operates, and/or rents;\nHosting or participating in any activity that promotes excessive consumption of alcohol;\nCausing, inciting, or participating in any conduct that unnecessarily disturbs others or disrupts local municipalities including, but not limited to, participating in or inciting a riot.",
    "Violations connected with that incident included:\nFailure of a recognized student organization or student group to take all necessary steps to ensure that no person under the legal drinking age possesses alcoholic beverages at functions it sponsors or within any property or transportation it owns, operates, and/or rents;\nCausing, inciting, or participating in any conduct that unnecessarily disturbs others or disrupts local municipalities including, but not limited to, participating in or inciting a riot.",
    "A letter sent to Delta Chi from Dean of Students Christopher Bullins details a series of offenses, including an underage student being hospitalized after over-drinking at a party and a hazing incident in fall of 2020 that required forced consumption of hot sauce and illegal trespassing, among other issues.",
    "The first was at an off-campus event that lasted from Oct. 9 into Oct. 10, 2021, which allegedly brought four violations of the code of student conduct, including:\nSelling, distributing or furnishing alcoholic beverages except as expressly permitted by law and university policy.",
    "“The announcement that Bowling Green State University has suspended two fraternities over hazing and alcohol violations proves that fraternity members still don’t get it as they continue to engage in the types of practices that tragically ended Stone’s life,\" he said.",
    "\"To be clear the University will not tolerate behavior that disregards the Code of Student Conduct and the health and safety of those students involved, and BGSU has extended this chapter’s suspension to fall 2026,\" Solis said.",
    "This comes less than a year after BGSU sophomore Stone Foltz died as the result of a hazing incident at an off-campus party thrown by the Pi Kappa Alpha fraternity, which has since been permanently banned from the university.",
    "Mike DeWine signed an anti-hazing law known as Collin's Law, named for 18-year-old Ohio University freshman Collin Wiant who died in a 2018 hazing incident at an off-campus fraternity house in Athens, Ohio.",
    "BOWLING GREEN, Ohio — One fraternity at Bowling Green State University was suspended and a second had its suspension extended on Tuesday for alleged incidents of hazing and parties with excessive drinking.",
    "The law includes measures to combat hazing, including, but not limited to:\nExpands the definition of hazing and specifies that hazing may include “coercing another to consume alcohol or a drug of abuse.\"",
    "We have already lost our son, and we can’t bear the thought of another family living this nightmare because Universities do not do everything in their power to put a stop to these illegal practices.",
    "It read:\n\"It’s been less than a year since Stone died from hazing, and it devastates us to learn that nothing has changed for certain fraternities at Bowling Green State University.",
    "The university's Phi Delta Theta chapter also was suspended Tuesday, and accepted responsibility for violations that included having alcohol parties resulting in 911 calls.",
    "That suspension was supposed to last one year, however, Solis said the university has since received \"concerning\" reports regarding the fraternity's off-campus activity.",
    "According to BGSU spokesperson Alex Solis, the Delta Chi fraternity was initially suspended in the summer of 2021 for a hazing violation of the code of student conduct.",
    "We demand more from Universities on down, or we will continue to read about more tragedies just like Stone’s completely preventable death.”\nIn July 2021, Ohio Gov.",
    "The only solution to hazing is zero tolerance.”\nRex Elliot, an attorney for the Foltz family, said universities must continue to do more.",
    "Requires that those aware of hazing report it to authorities, with penalties up to a 1st-degree misdemeanor for failing to do so.",
    "They released a statement Wednesday, further advocating for zero-tolerance hazing policies at universities across the country.",
    "\"Before BGSU considers reinstatement, no current member or advisor may be affiliated with this fraternity,\" Solis said.",
    "\"BGSU and all universities must do more because mere suspensions have never worked to stop these illegal activities.",
    "Requires staff and volunteers at colleges and universities to undergo training on hazing awareness and prevention.",
    "The Foltz family said they were devastated to learn about the alleged activities of Delta Chi and Phi Delta Theta.",
    "The second incident was at another off-campus get-together that took place on Oct. 29 and into the next morning.",
    "Phi Delta Theta has been suspended for having alcohol parties that led to calls to emergency services.",
    "Assistant Dean of Students Michael Botts described two incidents in a letter to the fraternity.",
    "Requires the Ohio Department of Higher Education to implement a statewide anti-hazing plan.",
    "Widens the scope of those who can be punished for participating in or permitting hazing.",
    "Every University in this country must stand up and do more because lives are at risk.",
    "(A violation that results in serious harm is a 3rd-degree felony).",
    "We promised Stone that we would never stop fighting for change.",
    "Increases the penalty for hazing to a 2nd-degree misdemeanor.",
    "Zero tolerance is the only way to prevent injury and death.",
    "Expands the list of officials required to report hazing.",
    "When we said zero tolerance, we thought we were clear.",
    "Phi Delta Theta will be suspended until fall of 2024.",
    "Delta Chi's suspension has been extended until 2026.",
    "Delta Chi was already suspended for hazing.",
    "We will continue to keep you updated."
  ]
}