{
  "id": 4460,
  "mediaId": 8278,
  "date": "2022-01-21",
  "headline": "LIVE | Gov. DeWine and Lt. Gov. Husted Comment on Intel Corp. Project",
  "image": "https://businessjournaldaily.com/wp-content/uploads/2022/01/Intel-expansion-ohio.jpg",
  "link": "https://businessjournaldaily.com/live-gov-dewine-and-lt-gov-husted-comment-on-intel-corp-project/",
  "mediaOutlet": "businessjournaldaily.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2143,
    646,
    6310,
    6474
  ],
  "sentences": [
    "The megaproject, which will be the largest single private sector company investment in Ohio’s history, will generate more than 20,000 jobs in the state, including 3,000 direct Intel jobs earning an average of $135,000 per year plus benefits, 7,000 construction jobs over the course of the build, and tens of thousands of additional indirect and support jobs including contracted positions, electricians, engineers, and jobs in restaurants, health care, housing, entertainment and more, according to a press release.",
    "“Intel’s new facilities will be transformative for our state, creating thousands of good-paying jobs in Ohio manufacturing strategically vital semiconductors, often called ‘chips.’ Advanced manufacturing, research and development, and talent are part of Ohio’s DNA, and we are proud that chips — which power the future — will be made in Ohio, by Ohioans.”\nThe announcement will be broadcast live at 2:30 p.m. at OhioChannel.org.",
    "Jon Husted will join representatives from JobsOhio, One Columbus and other local, state and federal leaders to announce Intel Corp.’s plans to invest more than $20 billion into two state-of-the-art factories in the state by 2025.",
    "The Business Journal will also share the feed on this post at that time from the Ohio Channel’s YouTube page.",
    "“Today’s announcement is monumental news for the state of Ohio,” DeWine said in the release.",
    "The project is expected to add $2.8 billion to Ohio’s annual gross state product.",
    "Published by The Business Journal, Youngstown, Ohio.",
    "LICKING COUNTY, Ohio — At 2:30 p.m., Gov.",
    "Mike DeWine and Lt. Gov."
  ]
}