{
  "id": 4487,
  "mediaId": 8264,
  "date": "2022-01-07",
  "headline": "Ohio National Guard to deploy to OhioHealth O'Bleness for COVID-19 relief mission",
  "image": "https://bloximages.chicago2.vip.townnews.com/athensnews.com/content/tncms/assets/v3/editorial/7/7e/77e34795-0813-5163-b574-5b9862e8da99/5fda77ac1b87f.image.jpg?crop=1662%2C873%2C0%2C186&resize=1200%2C630&order=crop%2Cresize",
  "link": "https://www.athensnews.com/news/ohio-national-guard-to-deploy-to-ohiohealth-obleness-for-covid-19-relief-mission/article_f905cc54-6fe1-11ec-8a09-97ee772fec04.html",
  "mediaOutlet": "athensnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cole Behrens Athens NEWS Associate Editor",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The support of the Ohio National Guard will provide a welcome relief and we’re very grateful to accept this resource.”\nGuard members will arrive at O’Bleness on Monday, Jan. 10, for orientation and will begin working at the hospital beginning Tuesday, Jan. 11, the release said.",
    "Guard members will take on tasks that allow the hospital’s caregivers to focus on delivering high-quality care for patients as the community experiences a surge in COVID-19 hospitalizations, the release said.",
    "“We appreciate the efforts of Governor DeWine to deploy Ohio National Guard members across Ohio to assist hospitals including O’Bleness,” said LeeAnn Lucas-Helber, OhioHealth O’Bleness Hospital president.",
    "“Though our hospital has remained stable throughout the pandemic and continues to provide safe and high-quality care for our community, our associates are feeling the strain of this present surge.",
    "Examples of roles for the guard members include serving as patient companions, providing assistance to patients with mobility limitations, stocking supplies and answering phones.",
    "The deployment is part of a larger statewide mission the Ohio National Guard is conducting to alleviate medical care providers as coronavirus cases continue to remain high.",
    "Guard members at O’Bleness will not provide direct patient care but will serve as nonclinical support to care teams in various areas of the hospital, the release said.",
    "Guard members are slated to assist at O’Bleness for 90 days, however, assignments will be continually evaluated during that time and shortened or lengthened as needed.",
    "OhioHealth O’Bleness Hospital announced Friday ten members of the Ohio National Guard will deploy to Athens next week to assist with COVID-19 relief efforts.",
    "According to the U.S. Health and Human Services ICU capacity dashboard, O’Bleness currently has no available ICU beds out of eight total ICU beds.",
    "Mike DeWine announced in December over 1,000 national guard troops would deploy to Ohio hospitals during the holiday season.",
    "Coronavirus cases in the county, state and nation continue to rise.",
    "Ohio Gov."
  ]
}