{
  "id": 4637,
  "mediaId": 8358,
  "date": "2022-04-20",
  "headline": "Federal judges create May 28 showdown for Ohio state legislative redistricting",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/04/web1_Ohio-27.jpg",
  "link": "https://www.limaohio.com/news/505664/federal-judges-create-may-28-showdown-for-ohio-state-legislative-redistricting",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2765,
    5212,
    1126,
    392,
    1267,
    1456,
    6474,
    6077
  ],
  "sentences": [
    "Marbley asserted that “the majority opinion is grounded on a faulty premise, reasoning that an unconstitutional map is the sole alternative and lesser evil to a cancelled election.”\nMarbley wrote that the map drawn up by two outside, bipartisan mapmakers hired by the redistricting commission, Michael McDonald and Douglas Johnson — which Republicans abandoned at the last minute in favor of approving a slightly modified version of the third map — was preferable to using the commission’s third map, on the grounds that its districts are more compact than the third map and the state wouldn’t need to use a plan ruled unconstitutional by its own Supreme Court.",
    "He said he disagreed with the majority’s decision to potentially move ahead with primary elections using the redistricting commission’s third map – which Marbley called “irredeemably flawed.”\nUsing the third map, Marbley wrote, would be in “direct contravention” of the 2015 legislative redistricting constitutional amendment passed by Ohio voters, as well as the Ohio Supreme Court’s ruling that the map violates that amendment.",
    "“Indeed, the Republican Commissioners will benefit directly from a crisis they created, and which the Ohio Supreme Court has attributed squarely to them.”\nThe panel of three federal judges got involved in response to a Republican-backed lawsuit filed in late February that sought to bypass the Ohio Supreme Court, which had rejected three sets of GOP-drawn district maps, including a congressional map at the time.",
    "Yet with deference to the State in mind, we see it as the best of our bad options.”\nThe third map, approved by Republicans on the Ohio Redistricting Commission on Feb. 24, favors Republicans to win 54% of Ohio’s state legislative seats, and Democrats 46%, numbers that correspond with each party’s recent share of the statewide vote, a figure referenced in the state constitution.",
    "The Supreme Court majority has criticized Republicans for passing maps slanted in their favor, using a nontransparent process without significant Democratic input, and most recently approving districts with a large number of tightly competitive Democratic districts with no corresponding Republican ones.",
    "By stating that the third map will be the “backstop” if state leaders don’t act by May 28, the majority “set a strong, almost immovable default” that Republicans will opt to use the third map they approved instead of going through the “thorny” process of passing a new map, Marbley wrote.",
    "U.S. Sixth Circuit Court of Appeals Judge Amul Thapar and U.S. Western District of Kentucky Judge Benjamin Beaton — two appointees of Republican ex-President Donald Trump — said they also would order state legislative races to be held on Aug. 2, in a 2-1 decision issued Wednesday night.",
    "COLUMBUS, Ohio — A federal court has given the Republican-dominated Ohio Redistricting Commission until May 28 to come up with a new state legislative map plan, or it said it will impose a map the Ohio Supreme Court rejected as an unconstitutional, pro-GOP gerrymander last month.",
    "In repeated 4-3 votes, most recently last week, the Ohio Supreme Court has rejected four sets of Republican-approved maps as unconstitutionally slanted in favor of the GOP, citing new anti-gerrymandering rules voters added to the state constitution in 2015.",
    "“In more than one way, this case brings to mind Winston Churchill’s famous quip that ‘democracy is the worst form of government except for all those other forms that have been tried from time to time,’” wrote Thapar and Beaton.",
    "The showdown is one of the ugliest in recent state political history, with some Republicans floating the idea of impeaching O’Connor, who’s retiring at the end of the year after holding statewide office for more than 20 years.",
    "Mike DeWine, Secretary of State Frank LaRose, Auditor Keith Faber, Ohio House Speaker Bob Cupp and Ohio Senate President Matt Huffman — could do nothing until May 28 as a way to get the federal court to order the map.",
    "Every time the Ohio Supreme Court has rejected a map, with Republican Chief Justice Maureen O’Connor joining the court’s three Democrats to make a 4-3 majority, the court has cited the new anti-gerrymandering rules.",
    "But a significant number of the Democratic-leaning seats are hotly competitive, giving Republicans the chance to win upwards of 70 seats, with no corresponding competitive Republican-leaning districts.",
    "The lawsuit initially sought to force the state to use the second state legislative map plan the court rejected, but has expanded in scope as federal judges considered other ways to break the impasse.",
    "The races were supposed to be held during the May 3 primary election, but were pulled due to delays in redistricting, the regular process of redrawing political maps to reflect population changes.",
    "And Republicans on the redistricting commission have accused the Ohio Supreme Court majority of overstepping their legal authority, leading to delays in the state legislative elections.",
    "Chief U.S. District Judge Algernon Marbley, a 1997 appointee of Democratic ex-President Bill Clinton, referenced this scenario in his dissenting opinion issued Wednesday night.",
    "The Ohio Supreme Court, while rejecting a slightly modified version of the third map in a ruling last week, gave the redistricting commission until May 6 to approve a new one.",
    "And we are confident that not a single member of the Commission or the Ohio Supreme Court wants to run through this gauntlet again next spring,” the majority opinion said.",
    "The Ohio Supreme Court could use its theoretical contempt of court powers to try to force the commission to act, although it has declined to do so thus far.",
    "In their written ruling, the Ohio Supreme Court majority urged the federal court to wait to intervene in the state’s redistricting process.",
    "Republicans have taken no steps toward doing so, declining to even schedule a meeting while they awaited Wednesday’s federal court ruling.",
    "In their majority opinion, Thapar and Beaton expressed optimism the extra time will give Ohio officials to come up with a new plan.",
    "And any appeal of whatever the federal three-judge panel ends up ordering would go straight to the U.S. Supreme Court.",
    "Wednesday’s ruling also sets up one possible scenario: Republicans on the redistricting commission — Gov.",
    "The third map plan only would be used for the 2022 elections, Wednesday’s federal court decision said.",
    "This asymmetry in competitive districts is a primary reason the Ohio Supreme Court rejected it.",
    "“The Republican Commissioners and legislators will not blink at that invitation,” he wrote.",
    "The redistricting commission would have to come up with new maps for 2024 and onward.",
    "“After all, a state-made solution, unlike ours, would last four or even ten years.",
    "Wednesday’s federal court ruling gives the state more time, but sets a deadline.",
    "The court has rejected two more state legislative map plans since then.",
    "We are acutely aware of its flaws.",
    "“The same can be said for Map 3.",
    "Previous"
  ]
}