{
  "id": 4741,
  "mediaId": 8494,
  "date": "2022-04-18",
  "headline": "Future of Ohio's state legislative district maps could be in the hands of federal judges",
  "image": "https://npr.brightspotcdn.com/dims4/default/b973280/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnpr.brightspotcdn.com%2F6a%2F15%2F246186b44c398f679e03acc6d1b9%2Fmaps-on-floor.jpg",
  "link": "https://www.wksu.org/government-politics/2022-04-18/future-of-ohios-state-legislative-district-maps-could-be-in-the-hands-of-federal-judges",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Chow",
  "authorUrl": "https://www.wksu.org/people/andy-chow",
  "termIds": [
    4005,
    5128,
    4730,
    5185,
    5761,
    1710,
    980,
    973,
    5926
  ],
  "sentences": [
    "\"The commission should continue the course it began when it followed our and the attorney general’s recommendations to engage independent map drawers,\" the court wrote, referring to mapmakers Michael McDonald, a University of Florida professor, and Douglas Johnson, president of the National Demographics Corporation.",
    "Republican members on the commission, especially House Speaker Bob Cupp (R-Lima) and Senate President Matt Huffman (R-Lima), have accused the majority on the supreme court of going beyond their authority in interpreting the state's constitutional laws on redistricting.",
    "In ruling against the maps, the majority of the court wrote that the commission had a head start in accomplishing constitutional maps by bringing in outside \"independent\" experts to draft the maps.",
    "Auditor Keith Faber, a Republican, joined House Minority Leader Allison Russo (D-Upper Arlington) and Sen. Vernon Sykes (D-Akron) in voting against the last two sets of maps.",
    "But petitioners have challenged those maps in court arguing that the number of Democratic seats is misleading considering how many of those districts would be toss-up races.",
    "The Ohio Redistricting Commission has approved a set of state legislative district maps four times, and each time those maps have been invalidated by the Ohio Supreme Court.",
    "\"Even if the commission is unable to engage Dr. McDonald and Dr. Johnson, the commission has a head start toward a complete and possibly constitutionally compliant plan.\"",
    "Voting rights advocates have said the blame falls squarely on the Republicans on the redistricting commission for consistently approving unconstitutional maps.",
    "The federal court has been considering a case filed by Republican voters who have said the state is unable to implement new state legislative district maps.",
    "The secretary of state's office told the court it would need a decision on House and Senate maps by April 20 in order to run a second primary on Aug. 2.",
    "A three-judge panel has given state officials until April 20 to find a way to implement new district maps for the Ohio House and Ohio Senate.",
    "The Ohio Supreme Court gave the Ohio Redistricting Commission until May 6 to adopt a fifth attempt at state legislative district maps.",
    "Those rejected maps created 54 Republican and 46 Democratic House seats along with 18 Republican and 15 Democratic Senate seats.",
    "The delay has already caused those races to be removed from the May 3 primary ballot, with a separate primary to be held later.",
    "They ended up adopting a plan that only made minor changes to a previous set of maps that were already deemed unconstitutional.",
    "Although, Faber said his opposition is based on the lack of compact districts and not the partisan breakdown of the maps.",
    "The stalemate between those two state government bodies could be a recipe for the federal court to take action.",
    "The latest round of maps was approved by four of the five Republicans on the Ohio Redistricting Commission.",
    "Early voting is under way, and there is still a May 3 primary for other statewide and local races.",
    "The last two attempts at state legislative district maps were approved by Gov.",
    "of State Frank LaRose, both Republicans, along with Cupp and Huffman.",
    "That work was done under the transparent view of a live stream.",
    "To see more, visit The Statehouse News Bureau.",
    "Copyright 2022 The Statehouse News Bureau.",
    "Mike DeWine and Sec."
  ]
}