{
  "id": 4786,
  "mediaId": 8360,
  "date": "2022-04-20",
  "headline": "Jewish Community Grateful for Governor DeWine’s Leadership in Fighting Antisemitism",
  "image": "https://i0.wp.com/www.lovelandmagazine.com/wp-content/uploads/2022/04/Ohio-Jewish-Communities.png?fit=800%2C532&ssl=1",
  "link": "https://www.lovelandmagazine.com/jewish-community-grateful-for-governor-dewines-leadership-in-fighting-antisemitism/",
  "mediaOutlet": "lovelandmagazine.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Miller -",
  "authorUrl": "https://www.lovelandmagazine.com/author/david/",
  "termIds": [
    2143,
    4736,
    593,
    474,
    6077,
    6474
  ],
  "sentences": [
    "You are modern day exemplars of that\nThank you,\nOhio Jewish Communities\nby Loveland Magazine – Apr 14, 2022\nColumbus, Ohio – Ohio Governor Mike DeWine today signed Executive Order 2022-06D to further define antisemitism using the International Holocaust Remembrance Alliance’s working definition, and…",
    "Sadly, statistics bear out that antisemitism is on the rise in Ohio, nationally, and throughout the world, including recent incidents at The Ohio State University and a frightening arrest of a security guard who was betraying the very Jewish institutions in Central Ohio he was supposedly protecting.",
    "Both Hillel and ADL statistics also show a rise in anti-Jewish hate on campus, with Hillel showing an astonishing 178 incidents in 2019-20, in a year when many campuses were shut down for months due to the pandemic.",
    "Together with his powerful letter to college and university presidents in December on making the campus safe for Jewish students, faculty, and staff, Ohio leads the way in facing this ancient hatred head-on.",
    "FBI hate crimes statistics bear out this trend, with nearly 55 percent of religiously motivated hate crimes in the US targeting Jews, despite being only 2 percent of the population.",
    "Husted, we say: as Passover falls this week, we are reminded that at times of danger and persecution, the Jewish community has always counted on allies to help protect them.",
    "Governor Mike DeWine has repeatedly given his personal commitment to our community on combating hate, especially Jew-hatred.",
    "His issuance of last week’s Executive Order defining antisemitism is the latest step.",
    "We are grateful for his leadership.",
    "To Governor DeWine and Lt. Gov."
  ]
}