{
  "id": 4826,
  "mediaId": 8289,
  "date": "2022-04-24",
  "headline": "Governor DeWine announces Ohio State Parks Week",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/28/2017/12/cropped-favicon-24-32x32.png",
  "link": "https://www.portsmouth-dailytimes.com/news/75046/governor-dewine-announces-ohio-state-parks-week",
  "mediaOutlet": "Community Common",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Portsmouth Daily Times",
  "authorUrl": "",
  "termIds": [
    2143,
    972,
    963,
    6077,
    6474
  ],
  "sentences": [
    "“I encourage you to celebrate our state parks by taking time to get outside and enjoy a walk along a Storybook Trail with your family, a day on the water with friends, or a hike to some of Ohio’s most scenic spots.”\nIn partnership with the Ohio Department of Natural Resources (ODNR) and the Ohio State Parks Foundation, Governor DeWine is inviting everyone to visit a state park near them from April 22-29, 2022.",
    "“From a hike along the trails at the southern tip of the Buckeye State to a sunset paddle along the shores of Lake Erie, our parks offer tranquility, adventure, and everything in between.”\nGovernor DeWine announced the purchase and plans for Ohio’s 76th state park near Xenia in 2021.",
    "The area used to be touted as “Ohio’s Inland Seashore” and the “Atlantic City of the Middle West.” During the early 20th century, the lake shores were lined with hotels and restaurants meant for families who came to experience amusement park rides, a skating rink, and arcade games.",
    "Ohioans are lucky to have 75 state parks to choose from where they can visit with family and friends and enjoy, learn about, and support the beautiful landscape and natural features of Ohio.",
    "Governor DeWine and ODNR announced the creation of the Ohio State Parks Foundation last year to protect and enhance Ohio’s parks and advocate for their future.",
    "The park will feature an interpretation center developed in partnership with the three federally recognized Shawnee tribes and the Ohio History Connection.",
    "A full list of programming and activities happening at Ohio state parks is available on the Ohio Department of Natural Resources’ event calendar.",
    "“From Maumee Bay to Forked Run, our state parks add so much to our quality of life and make Ohio a great place to live,” said Governor DeWine.",
    "The state of Ohio has a rich history of parks, starting in 1949 when Buckeye Lake was officially named Ohio’s first state park.",
    "“Our state parks offer a little bit of everything, no matter what your family is looking for,” said ODNR Director Mary Mertz.",
    "COLUMBUS—Ohio Governor Mike DeWine issued a proclamation today recognizing April 22-29, 2022, as Ohio State Parks Week.",
    "Construction is planned to begin in the summer of 2022, and the facility is expected to open in the fall of 2023.",
    "Visitors can experience thousands of miles of trails, mountain biking, beaches, disc golf, and much more.",
    "Visit www.ohiostateparksfoundation.org to vote for your favorite state park."
  ]
}