{
  "id": 493,
  "mediaId": 8498,
  "date": "2022-02-21",
  "headline": "The Ohio Supreme Court wants Redistricting Commission to explain why it shouldn’t be held in contempt",
  "image": "https://woub.org/wp-content/uploads/2021/12/supreme_court_bench-scaled-e1640121832498.jpg",
  "link": "https://woub.org/2022/02/21/the-ohio-supreme-court-wants-redistricting-commission-to-explain-why-it-shouldnt-be-held-in-contempt/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Kasler | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/karen-kasler-statehouse-news-bureau/",
  "termIds": [
    0
  ],
  "sentences": [
    "“We have to leave that to the courts to make that decision.”\nAttorney General Dave Yost doesn’t represent any commissioner, but says since contempt has individual consequences, Democratic commissioners have been assigned outside counsel, which they say will file their response.",
    "< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — The Ohio Supreme Court has given the members of the Ohio Redistricting Commission till Wednesday at noon to show why they shouldn’t be held in contempt for ignoring a deadline set by the Court.",
    "But Republican former justice Paul Pfeifer said Ohio Department of Natural\nResources Director Jim Zehringer was held in contempt of court in December 2012, when ODNR failed to pay property owners along Grand Lake St. Marys for flood damage.",
    "Co-chair Sen. Vernon Sykes (D-Akron) said in an interview for “The State of Ohio” that he is concerned about being held in contempt but hopes that introducing maps the Republicans voted down will help their cause.",
    "“We have documented our attempts to do that, including a vote on the committee, so I think we’re insulated from it, but again, not a lawyer, not a legal scholar,” Sykes said.",
    "Majority Republicans on the commission didn’t present new House and Senate district maps and adjourned the meeting a few hours before the Court’s midnight deadline.",
    "The commission’s two Democrats had proposed new House and Senate maps, but the five Republican commissioners rejected them, saying they aren’t constitutional.",
    "“I don’t think that sent shivers down the spine of the director of natural resources because he was taking orders from Gov.",
    "“We have an obligation to file the Constitution, file the court order and to pass a map.",
    "It’s unclear what might happen if the Commission or any members are held in contempt.",
    "It didn’t really matter that the court found him in contempt,” said Pfeifer.",
    "Mike DeWine, said he was concerned the court’s order hadn’t been followed.",
    "The commission failed to pass new House and Senate maps last Thursday.",
    "Kasich at the time and he’s not going to violate his bosses orders.",
    "I think we could have passed a map,” DeWine said after the meeting.",
    "One of those Republicans, Gov.",
    "That was the obligation."
  ]
}