{
  "id": 4982,
  "mediaId": 2590,
  "date": "2022-04-23",
  "headline": "Inside The Final Days Of Ohio's MAGA Senate Primary",
  "image": "https://img.huffingtonpost.com/asset/626334201e0000169a1b32e1.jpeg?cache=kfM5RLIYeN&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/jd-vance-josh-mandel-donald-trump-ohio-senate-primary_n_62633360e4b0d077486014b1",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I guarantee that anybody who knew him as a young man will probably say he’s never changed.”\nThe comments stood out in contrast to a commercial tweeted out by Trump Jr. this week showing Mandel campaigning with Mitt Romney in 2012, when Romney was the Republican presidential nominee and Mandel was running for U.S. Senate against Democrat Sherrod Brown.",
    "That bit of good news for Vance was followed days later by his Yale Law School roommate releasing an old message in which Vance questioned whether Trump might be “America’s Hitler.” Vance argued to reporters that he wasn’t directly calling Trump “Hitler” in the direct message and that he was making a more subtle argument about political power.",
    "In a state that Trump won twice by 8-percentage-point margins, with the help of a unified state Republican Party, at least 40 county GOP leaders and supporters of other candidates in the seven-way race signed a letter urging Trump to ditch Vance, a venture capitalist author who wrote about growing up amid drugs and poverty in Middletown, Ohio.",
    "Addressing the anti-abortion group, Mandel delivered his standard stump speech, which — like Vance’s — is peppered with social grievances, like claiming a friend’s daughter was forced to identify as a white “oppressor” during an exercise in school and blasting the First Amendment’s separation of church and state.",
    "“I’m confident we’re going to win this primary May 3, and I look forward to working with President Trump to beat the Democrats in November,” Mandel said this week in response to a question about whether a now-infamous chest-thumping debate performance cost him Donald Trump’s endorsement.",
    "We’re doing our homework, so I think there’s going to be a rude awakening.”\n- Jeanna Jesse, a 62-year-old Ohioan at a Josh Mandel event\n“I wasn’t shocked it was me, but I definitely thought there was a chance [Trump] would stay neutral,” Vance said of the endorsement.",
    "Vance told a crowd in Ohio this week that “boy, was I proven wrong” and that Trump was the “best president of my lifetime.”\nAdvertisement\nMandel and Vance are battling for the top slot since Trump weighed in, with less than two weeks before voting closes.",
    "Flynn said the Vance endorsement is one area where he disagreed with the former president, who pardoned Flynn after he pleaded guilty to lying to the FBI about his conversations with a Russian ambassador before Trump’s inauguration in 2017.",
    "“I just think the president made a mistake on that particular front.”\nFlynn said he endorsed Mandel “because when you look at his background, he’s pretty much never wavered on anything,” especially on being anti-abortion, he added.",
    "Jeff Dean/Associated Press\nKETTERING, Ohio — At a modern-looking evangelical church outside Dayton, Josh Mandel picked a strawberry from a bowl, ate it, then grudgingly returned to the task at hand: talking to reporters.",
    "Mandel hardly mentioned Trump in his stump speech in Kettering but unequivocally stated that Trump won the 2020 presidential election when asked, endorsing the lie that widespread fraud put Joe Biden in the White House.",
    "Advertisement\nMandel, who was standing next to Trump’s former national security adviser Michael Flynn, answered two additional questions - whether he’s spoken to Trump since the former president endorsed rival J.D.",
    "Trump Jr. also suggested that it was Mandel’s March debate performance, when Mandel and financier Mike Gibbons hurled insults at one another and almost got into a physical fight, that cost him the endorsement.",
    "Joshua A. Bickel/The Columbus Dispatch via AP\nThere was some speculation among Mandel supporters this week that Vance might get booed at his own rally, the same way that Trump’s mention of Ohio Gov.",
    "The video was meant to highlight Mandel associating with a Trump antagonist — long before Trump was ever a consideration in the party and Republicans were lined up behind Romney as their nominee.",
    "Advertisement\nAfter his rally on Wednesday with Trump Jr. at a Holiday Inn conference room in Independence, Ohio, Vance said he was just as surprised as anyone about Trump’s endorsement.",
    "“But there were plenty of people whispering in his ear.”\nImmediately after the endorsement, Thiel pledged an additional $3.5 million to the Vance-aligned super PAC, Protect Ohio Values.",
    "Vance started running for the Senate in July with $10 million from Thiel in the super PAC, but the group was down to less than $300,000 before Thiel swooped in to replenish.",
    "Mandel appeared with Flynn at several campaign stops Thursday, including at Victory Christian Church (where Mandel was gulping down strawberries between interviews).",
    "For this coveted endorsement, Trump didn’t go with the candidate who has most embraced the posture of an over-the-top “Make America Great Again” fighter — Mandel.",
    "He is nothing if not publicly confident “we’re going to win the primary May 3.”\nWelcome to Ohio’s Republican Senate primary — chaotic, expensive and almost over.",
    "“I’m going to vote for J.D., mainly because Trump said to,” Linda Davidson, a 70-year-old retiree told HuffPost while waiting around for Vance after his event.",
    "“The base, we’re going on our homework, and we know who we want,” Jeanna Jesse, a 62-year-old who came to see Mandel and Flynn in Kettering, told HuffPost.",
    "Advertisement\nJane Timken, the former chair of the Ohio Republican Party, is struggling to gain traction against Josh Mandel, a former state treasurer.",
    "The “Hillbilly Elegy” memoirist scored his support despite bashing Trump early and often in his presidency, before having a dramatic change of heart.",
    "It’s also this election cycle’s earliest Senate contest, signaling to candidates and voters in other states whether Trump’s brand is still relevant.",
    "They argued that endorsing Vance would “confuse and upset voters.”\nIt’s even weirder that the candidate campaigning with retiring GOP Sen.",
    "He instead went with Vance, who’s close with Donald Trump Jr., backed by tech billionaire Peter Thiel and somewhat of a celebrity.",
    "Mandel, a former state treasurer and consistent front-runner, is now having to awkwardly sidestep not getting the endorsement.",
    "Vance in Ohio’s GOP primary and whether he’s seen any data to suggest he was decisively beating Vance - in the exact same way.",
    "He argued the so-called “deep state” attacked Trump and Flynn to achieve its ends but didn’t specify what those ends might be.",
    "He said he was having cookies-and-cream milkshakes with one of his kids on Good Friday when Trump called to deliver the news.",
    "Vance, formerly lagging in the polls and nearly out of cash, is suddenly flush with super PAC money from Thiel and surging.",
    "But it’s hard to tell anymore.”\nBoth Mandel and Vance are using these last few days to trot out their best endorsers.",
    "They were just the two guys in between,” said Mandel, who has been running his campaign through evangelical churches.",
    "“You can like someone individually and say that’s not a performance you want to hang your hat on,” Trump Jr. said.",
    "Asked whether Mandel was going to Trump’s rally in central Ohio on Saturday, Mandel’s spokesperson didn’t respond.",
    "We’re doing our homework, so I think there’s going to be a rude awakening.”\n“There was no traction for J.D.",
    "He addressed this immediately to the crowd, which was there to hear from Trump’s son as much as Vance.",
    "The Republican U.S. Senate candidate doesn’t seem to enjoy it, and he doesn’t make it easy.",
    "Rob Portman, former Ohio Republican Party chair Jane Timken, is struggling to break out.",
    "“Obviously, I had a little something to do [with it],” Trump Jr. told reporters.",
    "The dynamic that emerged since Trump endorsed Vance is new and unusual.",
    "“I think everyone has to make their own decision about who to endorse.",
    "Extremist right-wing Rep. Marjorie Taylor Greene has endorsed J.D.",
    "Mike DeWine (R) has previously elicited jeers from the MAGA base.",
    "“The base, we’re going on our homework, and we know who we want.",
    "“Josh was actually my first pick before [Trump] did that.”",
    "Vance,” another woman at Mandel’s event told HuffPost.",
    "That doesn’t mean we think Trump is a bad president.",
    "That doesn’t mean we think Trump is a bad president.",
    "“You know who else didn’t like Trump in 2016?",
    "“If [Trump] gets it wrong, he gets it wrong.",
    "If [Trump] gets it wrong, he gets it wrong.",
    "Only that GOP voters were the targets.",
    "“They weren’t coming for Trump.",
    "I’m here,” Flynn told HuffPost.",
    "They weren’t coming for Flynn.",
    "Vance for U.S. Senate in Ohio.",
    "Everybody!” Trump Jr. said.",
    "They’re coming for us.",
    "“He’s very believable.",
    "He’s very articulate.",
    "Will voters buy it?",
    "He seems genuine."
  ]
}