{
  "id": 5035,
  "mediaId": 8379,
  "date": "2022-04-20",
  "headline": "Ohio National Guard to provide armored carriers to Ukraine",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/04/Ukraine-1.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/columbus/ohio-national-guard-to-provide-armored-carriers-to-ukraine/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Griffin",
  "authorUrl": "https://www.nbc4i.com/author/daniel-griffin/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Ohio has a strong Ukrainian community, and we stand behind them and their families overseas.”\nThe carriers are used to move soldiers and equipment across the battlefield while providing protection from small arms fire and the effect of artillery, the governor’s office statement said.",
    "The state has also started preparations to house Ukrainian refugees should the time come, ordered all Ohio investments and purchasing activity to divest from Russia, and prohibited the purchase and sale of Russian-made vodka.",
    "Mike DeWine made the announcement Wednesday, saying the Guard would be providing an undisclosed number of M-113 Armored Personnel Carriers to Ukraine at the request of the U.S. Department of Defense.",
    "COLUMBUS, Ohio (WCMH) — In the state’s latest move to support Ukraine, the Ohio Army National Guard will be providing armored personnel carriers for the country’s war against Russia.",
    "In addition, DeWine has asked the state’s law enforcement agencies to donate surplus or expired personal protective gear to donate to members of the Ukrainian civilian defense.",
    "“As we continue to learn about Russian war crimes in Ukraine, those of us in Ohio stand ready to help the Ukrainian people in any way possible,” DeWine said in a statement.",
    "So far, the effort has gathered about 75 ballistic and riot helmets and 840 pieces of body armor, the governor’s office said.",
    "The transports are just the latest steps the Ohio government has taken to support the Ukrainian efforts.",
    "Ohio Gov."
  ]
}