{
  "id": 5072,
  "mediaId": 8496,
  "date": "2022-04-18",
  "headline": "Fran DeWine diagnosed with COVID-19 days after governor",
  "image": "https://media.wkyc.com/assets/WBNS/images/aefa7485-ebb6-4af4-ae8f-92336c01d985/aefa7485-ebb6-4af4-ae8f-92336c01d985_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/health/coronavirus/dewines-test-positive-covid-19/530-78731a9a-ff49-43dd-8b80-3fa66557f4e0",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2143,
    6077,
    6474
  ],
  "sentences": [
    "The governor's diagnosis came just 18 days before Ohio's May 3 primary, in which he faces two Republican challengers, and just eight days before former President Donald Trump plans an Ohio rally.",
    "Last week, the governor reported he was diagnosed by his personal physician after experiencing mild symptoms such as a runny nose, headache, body aches and a sore throat.",
    "According to the governor’s office, Fran was diagnosed by her personal physician and is experiencing symptoms similar to the governor’s.",
    "COLUMBUS, Ohio — The Office of Ohio Governor Mike DeWine announced Monday that first lady Fran DeWine has been diagnosed with COVID-19.",
    "He had previous plans to attend a celebration of the 200th birthday of President Ulysses S. Grant, an Ohio native, on that day.",
    "It was unclear whether his diagnosis would affect DeWine's attendance at the rally, or if he would have attended in any case.",
    "The governor’s office said he is continuing to have mild symptoms which have not worsened since his announcement last week.",
    "Those conflicting results came just before the governor was to meet with Trump, then the president, in Cleveland.",
    "The governor and Fran both received a monoclonal antibody treatment, which is designed to fight the infection.",
    "DeWine tested positive for COVID-19 once before, in 2020, before testing negative later the same day.",
    "Both the governor and his wife have received two coronavirus vaccines and a booster.",
    "Both are continuing to quarantine at home."
  ]
}