{
  "id": 515,
  "mediaId": 8498,
  "date": "2022-02-24",
  "headline": "Ohio Supreme Court orders elected officials on redistricting commission to hearing on contempt",
  "image": "https://woub.org/wp-content/uploads/2019/08/another_shot_of_ohio_supreme_court_gavel__credit_dan_konik_-e1566946449440.jpg",
  "link": "https://woub.org/2022/02/24/ohio-supreme-court-orders-elected-officials-on-redistricting-commission-to-hearing-on-contempt/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Kasler | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/karen-kasler-statehouse-news-bureau/",
  "termIds": [
    0
  ],
  "sentences": [
    "House Speaker Bob Cupp (R-Lima) and Senate President Matt Huffman (R-Lima) said in their response, through their lawyer Phillip Strach, that not only is a contempt finding “inappropriate”, but also: “In any event, it may be unnecessary as the Speaker and the President anticipate the Commission will vote on a new plan this week.”\nThe Commission itself responded through its lawyer, saying no member should be held in contempt because “a new plan could be approved in the coming days” but also that “it appears each member acted in good faith in an effort to comply timely with the Court’s order”.",
    "The Ohio Redistricting Commission is ordered to appear before the Ohio Supreme Court for a hearing March 1 over their filings showing why they shouldn’t be held in contempt for not passing House/Senate maps on Feb 17 pic.twitter.com/kKloc9S66f\n— Karen Kasler (@karenkasler) February 24, 2022\nRepublican Justice Sharon Kennedy said in a letter she intends to write a dissent, opposing the contempt hearing.",
    "Mike DeWine, Auditor Keith Faber and Secretary of State Frank LaRose – also responded separately, saying they shouldn’t be individually liable because the panel “could not do in just ten days what it was previously unable to do in four months: adopt an Ohio General Assembly district plan that it, and this Court, will approve.”\nThe Commission has a meeting scheduled for this afternoon.",
    "Kennedy and the two other Republicans on the Court, Pat DeWine and Pat Fischer, have upheld the maps in the redistricting cases and disagreed with the decisions striking down the maps from the three Democrats and Republican Chief Justice Maureen O’Connor.",
    "They said in their response that they proposed maps last Thursday but Republicans on the Commission rejected them and that: “We apologize to the Court for the Commission’s failures.”\nAnd the three Republicans on the panel who hold statewide office – Gov.",
    "< < Back to\nCOLUMUBS, Ohio (Statehouse News Bureau) — The five Republicans and two Democrats on the Ohio Redistricting Commission have been ordered to appear before the Ohio Supreme Court for a hearing March 1.",
    "But he said he won’t be recusing himself from the redistricting cases, because he’s said his father is just a single member of the Commission and has no personal stake in how the districts are drawn.",
    "Justice Pat DeWine said he’s recusing himself from the contempt proceedings, which could impose sanctions on individual commission members – which include his father, Gov.",
    "LaRose said after yesterday’s meeting that the primary will likely have to be moved to June or that there will be two primaries, with one being held as scheduled May 3.",
    "Also responding separately are the panel’s two Democrats, co-chair Sen. Vernon Sykes and House Minority Leader Allison Russo.",
    "Meanwhile, the possibility of a single May primary for all offices on this year’s ballot appears to be gone.",
    "O’Connor can’t run again because state law sets an age limit of 70 years on justices seeking office.",
    "Kennedy is running for Chief Justice this year against Democratic Justice Jennifer Brunner.",
    "Mike DeWine."
  ]
}