{
  "id": 550,
  "mediaId": 2919,
  "date": "2022-02-24",
  "headline": "Gov. Mike DeWine calls Ukraine invasion 'unacceptable' and 'unprovoked'",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/08915bf/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F0c%2F83%2Fc27f14d2499a8f041f8515ca638b%2Fdewine.jpg",
  "link": "https://www.news5cleveland.com/news/local-news/gov-mike-dewine-calls-ukraine-invasion-unacceptable-and-unprovoked",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "News 5 Staff",
  "authorUrl": "https://www.news5cleveland.com/news-5-staff",
  "termIds": [
    0
  ],
  "sentences": [
    "From the moment the first wave of Ukrainians settled in Tremont — before relocating to Parma a few decades later — Ukrainians have left an indelible impact.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "The Russian military commenced a widespread attack on Ukraine early Thursday morning from its northern, southern and eastern borders.",
    "The shelling prompted thousands of people living in Kyiv — a city of about 3 million people — to pack up and evacuate the city.",
    "He continued, \"Ukraine has been a sovereign and independent state since the collapse of the former Soviet Union in the 1990s.",
    "\"At the direction of President Vladimir Putin, Russian forces have invaded Ukraine in violation of international law.",
    "From churches to businesses to city hall and healthcare, their immigration story has become part of the region’s DNA.",
    "Mike DeWine denounced the Russian invasion of Ukraine Thursday, calling the move a \"violation of international law.\"",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "This is unacceptable, and all freedom-loving people should stand against this unprovoked invasion,\" DeWine said.",
    "Shelling was reported in cities across the country, including in towns on the outskirts of the capital of Kyiv.",
    "The United States and Ukraine share common values including freedom, democracy, and the rule of law.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "Download now on your Apple device here, and your Android device here.",
    "Here in Northeast Ohio, many Ukrainians call the area home.",
    "\"Our thoughts are with the Ukrainian people,\" DeWine said.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "Ohio is home to 80,000 citizens of Ukrainian descent.\"",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "COLUMBUS, Ohio — Ohio Gov."
  ]
}