{
  "id": 5562,
  "mediaId": 2562,
  "date": "2022-04-19",
  "headline": "Newsmax to Host Town Hall With JD Vance, Renacci in Ohio",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguidF88BFD0A-E9B9-4792-8D05-9C4A28A433B5.jpg",
  "link": "https://donaldjtrumppolls.com/newsmax-to-host-town-hall-with-jd-vance-renacci-in-ohio/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    1991,
    3534,
    4306,
    2628,
    1489,
    1126,
    910,
    6474,
    6475,
    6107
  ],
  "sentences": [
    "Vance, a venture capitalist, conservative commentator and author of \"Hillbilly Elegy,\" received former President Donald Trump's primary endorsement on Friday in a field vying for retiring Republican Rob Portman that also includes former state treasurer Josh Mandel, investment banker Mike Gibbons and former Ohio Republican Party chair Jane Timken.",
    "The town halls will be shown at 8 p.m., starting with Vance live at the Chappelear Theater Center, at Ohio Wesleyan University in Delaware, Ohio, followed by Renacci.",
    "Newsmax host and town hall moderator Rob Schmitt will be joined by audience members, asking questions of concern to state voters in this vitally important election.",
    "\"People are hungry for information about the candidates as they finalize their choices in this important Republican primary,\" said Chris Ruddy, Newsmax CEO.",
    "Newsmax to Host Town Hall With JD Vance, Renacci in Ohio Former Rep. Jim Renacci R-Ohio, left, and Republican Senate candidate, author and commentator J.D.",
    "\"Newsmax is delighted to be actively involved in presenting in Ohio and across the nation a series of town halls and debates to further voter awareness.\"",
    "(AP)\nTuesday, 19 April 2022 03:58 PM\nNewsmax will broadcast two Ohio Republican town hall events on Wednesday featuring Senate candidate J.D.",
    "Renacci, a former U.S. Representative from Ohio's 16th Congressional District, is running to unseat incumbent Republican Gov.",
    "Renacci's appearance will be from his town hall recorded on Tuesday at the same venue.",
    "Mike DeWine in a field that also includes Joe Blystone and Ron Hood.",
    "The Ohio Town Hall show will rebroadcast on Newsmax this weekend.",
    "Vance and gubernatorial hopeful Jim Renacci.",
    "The Ohio primary is May 3.",
    "Original Article",
    "Vance."
  ]
}