{
  "id": 5671,
  "mediaId": 2919,
  "date": "2022-04-19",
  "headline": "Specialized training seeks to shatter the stigma of PTSD, first responders",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/53b14d7/2147483647/strip/true/crop/0x0+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fsharing.news5cleveland.com%2Fsharewcpo%2Fphoto%2F2010%2F05%2F15%2Fcrime_tape_20100515222524_640_480.JPG",
  "link": "https://www.news5cleveland.com/news/local-news/cleveland-metro/specialized-training-seeks-to-shatter-the-stigma-of-ptsd-first-responders",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Vandenberge",
  "authorUrl": "https://www.news5cleveland.com/jordan-vandenberge",
  "termIds": [
    1857,
    4525,
    721,
    6139,
    6326
  ],
  "sentences": [
    "\"We need to understand that the things we see every day doesn’t make us weak, but we do need to learn how to deal with it.”\nBarfield said the accumulation of stress and trauma associated with the job had long been hidden from his own recognition until, one day, it poured out of him after a seemingly innocuous conversation with a family member.",
    "I’m not sure if I was dealing with it as much as I should have.”\nExperiences like Barfield’s are growing more and more common, especially for those in law enforcement, said Gary Wolske, a retired police detective and current president of the Ohio Fraternal Order of Police.",
    "In addition to continued efforts on the state level, a national organization is in Lorain County this week to provide first responders with mental health training that will help them identify operational stress and trauma in themselves and their colleagues.",
    "This policy gap also prevented many law enforcement officers suffering from PTSD from coming forward to their superiors out of fear that they could lose their pay and benefits while seeking treatment — or potentially losing their jobs entirely, Wolske said.",
    "The legislation served as a compromise with many businesses, including the Ohio Chamber of Commerce, who expressed concern if the state were to require PTSD to be covered under workers' compensation, it would cause an undue burden for small businesses.",
    "For example, if a law enforcement officer were to respond to a mass shooting event — and the trauma associated with it — he or she would not be eligible for workers’ compensation coverage if there wasn’t a physical injury also associated with it.",
    "“There is a lot of training now where they are actually training supervisors to recognize [PTSD symptoms] in the men and women that work for them.”\nThis awareness has also led to new policies and programs on the state level.",
    "First H.E.L.P, a national advocacy organization whose mission is to reduce the stigma around mental health and first responders, is providing free mental health training this week at Lorain County Community College.",
    "ELYRIA, Ohio — Once considered a silent crisis, there continues to be a growing dialogue and conversation centered around first responders and the impact and prevalence of post-traumatic stress among the ranks.",
    "The workshops being offered to first responders include small group discussions that encourage participants to examine and acknowledge the impact that stress and trauma have on their day-to-day lives.",
    "Mike DeWine, a former prosecutor, signed off on HB 308, which created a special fund for the compensation and benefits for first responders who become disabled as a result of PTSD.",
    "Although it has certainly taken time, there is a greater understanding among those in law enforcement that their jobs can have a profound impact on their mental health.",
    "“Once we identify it as a problem then we can go on to talk about how to mitigate it and how to talk about it.”\nCopyright 2022 Scripps Media, Inc. All rights reserved.",
    "There is more awareness to mental health issues with not just the citizens in the community but the effects that it has on law enforcement officers,” Wolske said.",
    "“It’s tough enough being on the street and answering calls but when you have to worry about the mental aspect of it as well, that’s tough,” Wolske said.",
    "Now, supervisors are more likely to approach a subordinate if they notice a change in behavior after a traumatic event or a series of traumatic events.",
    "“It does have an effect on you.”\nThat simple understanding is the focal point of the training being offered in Lorain County this week, Barfield said.",
    "The workshops are being done in partnership with the AT&T-built FirstNet, a nationwide wireless broadband network for first responders.",
    "The scenario-based training teaches first responders how to initiate potentially difficult conversations with their colleagues.",
    "“The first part of the training is ‘let’s identify what stress is and let’s take a look at how it impacts us,’” Barfield said.",
    "For decades, the Ohio Bureau of Workers’ Compensation has only covered PTSD treatment if it accompanied a physical injury.",
    "That really just made me think and realize how much it had impacted me even though I didn’t think it had,” Barfield said.",
    "“The normal citizen, hopefully, will never see anything traumatic; that’s what we do every day,” Wolske said.",
    "Wellington Police Chief Tim Barfield said the training is especially critical for law enforcement officers.",
    "“There is a stigma among first responders that if we're bothered by something, we’re weak,” Barfield said.",
    "Recent studies have found an estimated 1 in 3 law enforcement officers suffers from PTSD.",
    "“At least there is some support now and some understanding of it.”\nIn early 2021, Gov.",
    "I realized how much of an impact that was, although I thought I was dealing with it.",
    "“I had tears in my eyes trying to explain to them this conflict inside of me.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "Removing the stigma associated with that is an important step, he said.",
    "“I wasn’t crying like a baby but I had tears in my eyes.",
    "“We need to break that stigma,\" he said.",
    "“We see things that nobody else sees."
  ]
}