{
  "id": 5739,
  "mediaId": 2752,
  "date": "2022-04-22",
  "headline": "Trump At War With Club For Growth Over OH Senate Race, Because There Is No One He Won't Burn To The Ground",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNjkxOTUzNi9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY3NTE1NDc0N30.smoD9dUUFBHUcwWVYIFJPRi6Azqf1hGP9_tEmA4koNI/img.png?width=1200&coordinates=0%2C2%2C0%2C2&height=600",
  "link": "https://www.wonkette.com/-2657195066",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Dye",
  "authorUrl": "https://www.wonkette.com/u/five_dollar_feminist",
  "termIds": [
    0
  ],
  "sentences": [
    "In today's episode of \"Let Them Fight\" we check in on Ohio's US Senate race, where Donald Trump, Lord High Emperor of the Republican Party, is fightin' mad that those peons in the Club for Growth have refused to fall in line behind his endorsement of elegiac hillbilly JD Vance.",
    "This would be merely funny if it weren't for the fact that McIntosh and Trump appeared on stage together just two weeks ago in North Carolina, where the Club has dutifully lined up behind Trump's chosen favorites Ted Budd for Senate and 26-year-old Bo Hines for the US House.",
    "In open defiance of the patron saint of MAGA, the Club kids upped the ante, paying to put this ad on the air reminding Ohioans that before he sold his soul, Vance couldn't say enough about what a disgusting piece of shit he thought Donald Trump was.",
    "Those wacky anti-tax loons endorsed Josh Mandel way back in March, calling him \"a strong constitutional conservative who believes in limited government, balanced budgets, low taxation, and parental school choice.\"",
    "\"Poll after poll shows that Republicans respect President Trump and don’t want RINO’s representing them — that will be no different this year in North Carolina,” McIntosh said at the time.",
    "Just six years ago Vance was calling himself a \"never Trump guy\" who \"can't stomach\" Trump, and might even consider voting for Hillary Clinton if Trump were on the ballot.",
    "And the thanks he gets is to be kneecapped by this feckless playboy who can barely hold his jaw in place because the Club for Growth had the nerve to defy daddy.",
    "But Trump is reportedly skeeved out by Mandel, and can't stop talking about that \"fucking weird\" guy and his supposedly weird sex life.",
    "The same cannot be said of his number one son, who went apeshit and attacked Mandel and \"The Club for Chinese Growth\" on Twitter.",
    "So Trump decided to pretend that Vance hadn't called him \"America's Hitler\" and give him the nod in the race to replace Sen.",
    "How very dare Josh Mandel accept the endorsement of Mitt Romney, former Ohio Governor John Kasich, and dead John McCain?",
    "Instead he sent Club for Growth President David McIntosh a special love note, according to the Times's Maggie Haberman.",
    "Mike DeWine in 2011 and didn't kick him in the nuts, so obviously he is a gross establishment squish.",
    "Sure, those things happened in 2018 and 2012, and Mandel recently attacked Romney as a RINO.",
    "\"My God, what an idiot,\" he tweeted in October of 2016 before he sold his soul to the devil.",
    "(Aside: are we sure this kid isn't just Madison Cawthorn wearing eyebrow pencil?",
    "But at least Trump was smart enough to do his dirty talking behind closed doors.",
    "And he expected the Club for Growth to obediently kick Mandel to the curb, too.",
    "The President shares this message with you: Go fuck yourself,” it read.",
    "Mandel has practically fellated Trump in a frenzied show of obeisance.",
    "And if you're ordering from Amazon, use this link, because reasons.",
    "Smash that donate button to keep your Wonkette ad-free and feisty.",
    "But Trump is bigly mad at this act of gross insubordination.",
    "Has anyone ever seen the two of them in the same room?)",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "Because our former president is nothing if not classy.",
    "And that makes the whole thing hilarious.",
    "No, just kidding, he's not that eloquent.",
    "We almost feel sorry for young Joshy.",
    "But he once introduced sitting Gov.",
    "How often would you like to donate?",
    "\"Le parti, c'est moi!\"",
    "“Hi Mr. McIntosh.",
    "But not quite.",
    "Rob Portman.",
    "he shouted.",
    "But!"
  ]
}