{
  "id": 5839,
  "mediaId": 2919,
  "date": "2022-04-14",
  "headline": "Billboards in major U.S. cities take quirky approach to encourage people to move to Ohio",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/0de887c/2147483647/strip/true/crop/1529x803+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Ff5%2F24%2Fdf9f643a4fc5a29729480aa496b0%2Fbrown.png",
  "link": "https://www.news5cleveland.com/news/state/billboards-in-major-u-s-cities-take-quirky-approach-to-encourage-people-to-move-to-ohio",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Clay LePard",
  "authorUrl": "https://www.news5cleveland.com/clay-lepard",
  "termIds": [
    4699,
    2143,
    673,
    6582,
    6596,
    6474,
    6097,
    6068,
    6067,
    5997
  ],
  "sentences": [
    "According to PODS, the moving and storage company which showed similar moving trends for those coming to and leaving Ohio, those relocating to Ohio were coming from the following states:\nFlorida\nCalifornia\nTexas\nArizona\nAdditionally, a PODS spokesperson said those leaving Ohio were headed to the following states:\nFlorida\nTexas\nCalifornia\nNorth Carolina\nIn the span of the past four years, Marne Friedman and her family of five went from a two-bedroom apartment in Brooklyn, New York to a small house in the suburbs of New Jersey to a home in Pepper Pike.",
    "While the split was even, U-Haul saw its trucks coming into Ohio increase 11% from 2020 to 2021, with the most popular cities for new residents being Miamisburg, Huber Heights, Cleveland, Cleveland Heights, Delaware, North Canton, the Cuyahoga Falls-Kent corridor, Canal Winchester, Port Clinton, Trotwood, Worthington, Athens, Hamilton and Elyria.",
    "One sign in Seattle reads “Live where you can actually save for a rainy day.”\nWith the pandemic permanently changing the way many work and live, the billboards make up part of an up to $70 million campaign over the past year and a half by JobsOhio to try to lure more people to Ohio.",
    "“There is no better place in the world to start a business than Ohio, no better place to grow a business, no better place to live and no better place to raise a family,” DeWine said during the unveiling of the Intel plant back in January 2022.",
    "Billboards posted in cities such as New York, Boston, Seattle, San Francisco and Chicago don’t hold back when it comes to pointing out advantages to living in the Buckeye State over urban alternatives.",
    "“People are talking about Ohio.”\nAccording to a spokesperson with U-Haul, the moving and storage company, 50.4% of their Ohio trucks entered the state while 49.6% of their trucks left Ohio in 2020.",
    "The money does not come from taxpayers, but rather Ohio liquor profits that were directed by Governor Mike DeWine towards attracting more workers and more people to the Buckeye State.",
    "We wanted to break down some of that Midwest modesty and we wanted Ohio to be part of the conversation.”\nBut are the people coming to Ohio since this ad campaign began?",
    "The signs direct interested individuals to OhioisForLeaders.com, which features vignettes and data promoting the benefits of moving to Ohio.",
    "She saw as her dollar kept stretching after each and every move, adding square footage and cutting down the cost of a home along the way.",
    "According to the U.S. Census, Ohio’s population grew a mere 1.3%, a sign of growth, but behind the national growth rate of 6.3%.",
    "'”\nFriedman admits the pandemic played a prominent role in helping push her family back to Ohio where she grew up.",
    "As a result, U-Haul ranked Ohio as 24th in the nation when it came to “growth states” for 2021.",
    "“Real estate prices in our area were skyrocketing, and we said, 'Let’s get out while we can.",
    "“It’s nice going places and every place I go, I run into someone I know and that’s awesome.",
    "CLEVELAND — They are not subtle, and they are not written with “Midwest modesty” in mind.",
    "She doesn't view it as a step back, but rather a leap forward for their quality of life.",
    "It’s the same city I left, but it’s a totally different city I'm coming back to.”",
    "“We went from two bathrooms to five bathrooms for half the price,” she explained.",
    "Renae Scott serves as managing director for marketing at JobsOhio.",
    "“We really wanted to make sure we stood out,” she said.",
    "“We knew businesses were starting to flee the coast.",
    "“Our impressions are over-delivering,” Scott said.",
    "Ask JobsOhio and you get the answer you expect.",
    "However in 2021, that split was an even 50/50.",
    "“It’s nice being home,” she said.",
    "And where are they coming from?"
  ]
}