{
  "id": 5977,
  "mediaId": 2537,
  "date": "2022-04-10",
  "headline": "In Ohio's redistricting battle, Gov. Mike DeWine said he'd take the lead. But did he?",
  "image": "https://www.gannett-cdn.com/presto/2022/01/18/NCOD/82da8eab-2096-4314-a555-4ac34d87a04a-Ohio_Redistricting_Commission_KWR_03.jpg?crop=2499,1406,x0,y17&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/politics/elections/2022/04/11/ohio-redistricting-gov-mike-dewine-said-hed-take-lead-did-he/9467933002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    5761,
    2143,
    3644,
    4005,
    1710,
    1267,
    970,
    6077,
    6474
  ],
  "sentences": [
    "\"I believed that the best way – the best shot that we had at getting a 10-year map and getting a nonpartisan map was to let the Democrats come forward with a proposal and the Republicans come forward with a proposal and then see where everybody was and then be a person that could try and pull this together,\" DeWine said.",
    "As a longtime Republican, DeWine could try to maximize the number of GOP legislators in the Ohio Statehouse – the approach embodied by former U.S. House Speaker John Boehner who said: \"When you've got the pencil in your hand, you're going to use it to the best of your advantage.\"",
    "That is not what was intended at all.”\nDeWine can't control the commission\nIn legal filings attempting to fend off the threat of contempt of court, DeWine argues that he can't be held responsible for the actions – or lack thereof – of fellow commission members.",
    "The commission includes three statewide officials – DeWine, Ohio Auditor Keith Faber and Ohio Secretary of State Frank LaRose, all Republicans – in addition to four legislative leaders, two Republicans and two Democrats.",
    "But the GOP supermajority hasn't been kind to some of DeWine's policies, overriding the governor's veto on health orders and stymying efforts to increase penalties on texting while driving or reform police training.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "In 2015 and 2018, Ohio voters overwhelmingly voted for changes to Ohio's redistricting process aimed at curbing partisan gerrymandering – defined as unnecessarily favoring one party over the other.",
    "After several rounds of letting Republican legislative leaders control mapmaking, DeWine told reporters in mid-March that he would take a more active role: \"I'm taking the lead right now,\" he said.",
    "That decision was partially practical: Huffman and Cupp employ staff who understand how to draw maps and have crafted every proposal approved by the Commission or state lawmakers to date.",
    "Democrats blame Republicans who hold five of the seven seats on the Ohio Redistricting Commission and who crafted maps that the Ohio Supreme Court has struck down repeatedly.",
    "In the end, DeWine voted for maps tweaked by Republican legislative staff from plans already rejected by the Ohio Supreme Court, maps he saw shortly before approving them.",
    "'Major, major stumbling blocks'\nIn the months of mapmaking, DeWine has largely deferred to Senate President Matt Huffman and Speaker Bob Cupp, both Lima Republicans.",
    "Statewide officials were included on the Ohio Redistricting Commission, in part, because they were historically involved in crafting legislative districts.",
    "\"Nothing in the Constitution grants him power over the commission, which can adopt new voting districts only by majority vote,\" DeWine's attorneys wrote.",
    "Ohio's messy redistricting process has cost the state millions, forced a second primary and frustrated those who voted for a better way of drawing maps.",
    "DeWine pushed to keep redistricting efforts moving, trying to broker consensus between Republicans and Democrats on instructions for hired mapmakers.",
    "Republicans blame Democrats suing over the maps and the Supreme Court led by GOP Chief Justice Maureen O'Connor for delays and \"judicial activism.\"",
    "It was also strategic, at least in the beginning, to try to bring Republicans and Democrats together, DeWine told attorneys suing over Ohio's maps.",
    "Mike DeWine to lead the state, but when it comes to the state's chaotic and expensive redistricting process, he has acted more like a follower.",
    "That's disproportionately high for a state that elected both Democratic President Barack Obama and Republican President Donald Trump, twice.",
    "Ohio redistricting:Ohio Supreme Court case interviews detail how negotiations on Statehouse maps fell apart\nBut he didn't pull it together.",
    "\"I did take a more active role behind the scenes and talking and trying to move things forward.”\nWhat is happening with Ohio redistricting?",
    "Entering this new redistricting process, DeWine's political calculus was more complicated than other members of the commission.",
    "LaRose and Faber have also ceded mapmaking duties to lawmakers, but neither has declared an interest in leading the commission.",
    "When a mediator negotiated a sticking point on incumbents, legislative leaders were in the room negotiating – not DeWine.",
    "Every 10 years, Ohio's leaders redraw districts for politicians who represent Ohioans in Columbus and Washington, D.C.",
    "DeWine is one of seven members of the Ohio Redistricting Commission, which is tasked with crafting and approving maps.",
    "Republicans currently hold 12 of Ohio's 16 congressional seats and veto-proof majorities in the Ohio Legislature.",
    "DeWine contends that his leadership style on redistricting has been more behind the scenes rather than out front.",
    "The commission's Republicans, including DeWine, approved four-year maps without the support of Democrats.",
    "Once again, Republican legislative leaders were in the driver's seat, and DeWine was along for the ride.",
    "DeWine now says mapmaking has fallen away from what Ohio voters actually wanted: competitive districts.",
    "\"The governor cannot unilaterally issue new redistricting maps or dictate the commission’s decisions.\"",
    "Despite these reforms, Ohio's redistricting process has devolved into a messy, political brawl.",
    "\"The way it turned out was they were putting a premium on fewer competitive districts.",
    "But they also were seen as a possible check on lawmakers drawing their own districts.",
    "“This process has clearly had some major, major stumbling blocks,\" DeWine said.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "After all, he's just one member of a seven-member commission – not its leader.",
    "\"Taking leadership is not always everything you do in public,\" DeWine said.",
    "A GOP lawmaker even tried to impeach DeWine at one point.",
    "The Ohio Supreme Court later rejected those maps.",
    "But as the days went on, he said less and less.",
    "Faber has also voted against two sets of maps.",
    "At first, he appeared to take charge.",
    "Ohioans elected Gov."
  ]
}