{
  "id": 6094,
  "mediaId": 3986,
  "date": "2022-04-20",
  "headline": "26 state governors announce new ‘Border Strike Force’",
  "image": "https://americanmilitarynews.com/wp-content/uploads/35035812945_6b0edafb11_k.jpg",
  "link": "https://americanmilitarynews.com/2022/04/26-state-governors-announce-new-border-strike-force/",
  "mediaOutlet": "americanmilitarynews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz George",
  "authorUrl": "https://americanmilitarynews.com/author/liz-george/",
  "termIds": [
    5167,
    5213,
    2915,
    4618,
    4905,
    3734,
    3554,
    1258
  ],
  "sentences": [
    "Republican Governors Doug Ducey, Greg Abbott and dozens more announced on Wednesday the formation of the American Governors’ Border Strike Force, a multi-state effort to combat the influx of illegal immigrants at the U.S.-Mexico border caused by President Joe Biden’s “disastrous border policies.”\nA news release from the Republican Governors Association stated that 26 GOP governors have joined the partnership “designed to disrupt and dismantle the transnational criminal organizations taking advantage of the chaos Joe Biden has created along the southern border.”\nThe strike force’s plan is to target cartels and other criminal organizations by bolstering collaboration, intelligence, and analysis with the goal of “combating human smuggling, and stopping drug flow among each of the participating states.”\nThe association asserted that Biden’s “reckless immigration policies” coupled with “the lack of adequate federal resources” have led to the unprecedented flow of illegal immigration and criminal operations along the southern border.",
    "The governors involved in the partnership include: Doug Ducey (AZ), Greg Abbott (TX), Kay Ivey (AL), Mike Dunleavy (AK), Asa Hutchinson (AR), Ron DeSantis (FL), Brian Kemp (GA), Brad Little (ID), Eric Holcomb (IN), Kim Reynolds (IA), Larry Hogan (MD), Tate Reeves (MS), Mike Parson (MO), Greg Gianforte (MT), Pete Ricketts (NE), Chris Sununu (NH), Doug Burgum (ND), Mike DeWine (OH), Kevin Stitt (OK), Henry McMaster (SC), Kristi Noem (SD), Bill Lee (TN), Spencer Cox (UT), Glenn Youngkin (VA), Jim Justice (WV), and Mark Gordon (WY).",
    "“If Biden will not come to the border, we’re sending the border to Biden and his administration so that they can begin to grapple with the challenges that we’re dealing with,” he said, adding, “But also, we will be looking for other locations like Delaware, Biden’s home state.",
    "Abbott said his state has sent eight buses carrying illegal immigrants to Washington, D.C. in an effort to protect small Texas communities that have been overrun with illegal immigrants due to the Biden administration’s lax border policies.",
    "“As dangerous transnational criminal organizations continue to profit from holes in the border and fill our communities with drugs, it’s no coincidence that we’re seeing historic levels of opioid-related deaths,” he continued.",
    "“The American Governors’ Border Strike Force will serve as a force multiplier in the fight against criminal activity directly tied to our border.",
    "“Every state is a border state, dealing with the flow of illegal immigrants and drugs into states across America,” the release stated.",
    "My thanks to my fellow governors who saw the problem and chose to be part of the solution.”\nAlso this week, Gov.",
    "… The people in Delaware are going to see what the people in Texas are having to grapple with.”",
    "If our entire southern border isn’t secure, our nation isn’t secure,” Gov.",
    "But this is not just an Arizona issue, it’s a national issue.",
    "“What we’re doing in Arizona works.",
    "Ducey said in a statement."
  ]
}