{
  "id": 6100,
  "mediaId": 2919,
  "date": "2022-04-20",
  "headline": "Ohio National Guard providing Ukraine with armored vehicles for war against Russia",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/20cd06f/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fa5%2Ffd%2Feba8371b4f3aba345e4a89da0aa3%2Fap22110454552613.jpg",
  "link": "https://www.news5cleveland.com/news/national/russia-ukraine-conflict/ohio-national-guard-providing-ukraine-with-armored-vehicles-for-war-against-russia",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Drew Scofield",
  "authorUrl": "https://www.news5cleveland.com/drew-scofield",
  "termIds": [
    2143,
    951,
    6077,
    6474,
    6672,
    6569
  ],
  "sentences": [
    "The Ohio Summit on Ukrainian Refugees also provided the opportunity for the state to declare unequivocally that it will welcome people that had to flee war-torn Ukraine.",
    "In March, DeWine joined officials from a myriad of different nonprofits to continue laying the groundwork needed to get ready for the arrival of Ukrainian refugees.",
    "\"As we continue to learn about Russian war crimes in Ukraine, those of us in Ohio stand ready to help the Ukrainian people in any way possible,\" said DeWine.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "The APCs \"are used to move soldiers and equipment across the battlefield while providing protection from small arms fire and the effects of artillery.\"",
    "COLUMBUS, Ohio — The Ohio National Guard will send an \"undisclosed\" number of armored personnel carriers to Ukraine to fight against Russia, Gov.",
    "Earlier this month, Ohio started collecting surplus personal protection gear such as ballistic and riot helmets, and bulletproof vests.",
    "In total, dozens of of police agencies across the state donated around 75 helmets and more than 800 pieces of body armor.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "According to the governor, the move follows a request from the Department of Defense to support Ukraine.",
    "\"Ohio has a strong Ukrainian community, and we stand behind them and their families overseas.\"",
    "Specifically, the Ohio National Guard will send M-113 Armored Personnel Carriers overseas.",
    "Download now on your Apple device here, and your Android device here.",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "Mike DeWine said Wednesday."
  ]
}