{
  "id": 6197,
  "mediaId": 8413,
  "date": "2022-04-15",
  "headline": "DeWine might skip Trump rally to honor another ex-president: Ulysses S. Grant",
  "image": "https://www.gannett-cdn.com/presto/2020/09/17/PCIN/dd3192b3-304d-450b-a7dd-2c095e50e286-DeWine_Trump_2018_rally.jpg?crop=1023,576,x0,y0&width=1023&height=576&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/politics/elections/2022/04/14/ohio-governors-race-dewine-might-skip-trump-rally/7318416001/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    2143,
    1991,
    2765,
    2736,
    5838,
    4905,
    4736,
    748,
    6474,
    6159
  ],
  "sentences": [
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "Contrast that response with primary challenger Jim Renacci, a former U.S. representative, who has sent news releases and text messages about his attendance at Trump's Delaware County rally.",
    "DeWine hasn't courted the former president's favor and support with any of the fervor that Republicans in the U.S. Senate primary to replace Terrace Park's Rob Portman have exhibited.",
    "DeWine said Thursday that he made a commitment to attend the kickoff of Grant's 200th birthday, which is scheduled for 11 a.m. to 5 p.m. April 23 in New Richmond.",
    "In fact, DeWine said in January that he hadn't personally asked for Trump's support and he had never been to the former president's Florida resort Mar-a-Lago.",
    "Shortly before, DeWine had told CNN that Trump should begin the transition to President-elect Joe Biden, acknowledging Biden's win in 2020.",
    "Mike DeWine might skip a rally with former President Donald Trump next week to honor another ex-president: Ulysses S. Grant.",
    "Trump backed DeWine's gubernatorial bid in 2018, but fired off a tweet about DeWine's primary being \"hotly contested.\"",
    "Trump's event begins at 7 p.m. that day at the Delaware County Fairgrounds – about a two-and-a-half-hour drive away.",
    "Trump supporters booed Husted when he talked about masks and DeWine at a rally outside Dayton in September 2020.",
    "Trump hasn't endorsed in the Ohio governor's race or the U.S. Senate race, and it's not clear whether he will.",
    "DeWine skipped Trump's most recent rally in Lorain County in 2021 because of a family conflict.",
    "\"Sure, would love it but would love anyone's endorsement,\" DeWine said Thursday.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "The campaign did not immediately respond to a question about whether Lt. Gov.",
    "\"So would love the former president's endorsement, absolutely.\"",
    "\"So we'll have to kind of see if that works out,\" DeWine said.",
    "Still, DeWine said he'd welcome the support.",
    "Husted attended a December wedding there.",
    "Jon Husted would attend.",
    "Ohio Gov."
  ]
}