{
  "id": 6245,
  "mediaId": 8495,
  "date": "2022-04-15",
  "headline": "DeWine Announces Ohio Task Force on Volunteer Fire Service",
  "image": "https://wktn.com/wp-content/uploads/2021/05/Gov-DeWine.jpg",
  "link": "https://wktn.com/dewine-announces-ohio-task-force-on-volunteer-fire-service",
  "mediaOutlet": "WKTN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“This is not only an Ohio issue, this is a national problem, but Ohio can and will serve as an example.”\nPotential issues the Ohio Task Force on Volunteer Fire Service will examine include:\n.Recruitment of volunteers\n.Financial stability of volunteer fire departments\n.Training issues\n.Resource assessment, and\n.Long-term stability of the volunteer fire department structure\nChaired by State Fire Marshal Reardon, members of the task force include:\n.Ohio State Fire Marshal Kevin Reardon\n.William (BJ) Jetter, City Manager, Deer Park\n.Mayor Ben Stahler, City of Bellfontaine\n.Mark Stahl, Ottawa County Commissioner\n.Dean Fadel, President, Ohio Insurance Institute\n.Chief Kyle Miller, Cedarville Township Volunteer Fire Department\n.Chief Dorothy Battles, OFE, Thompson Fire Department\n.Chief Ed Koziol, Rome Fire Department\n.Chris Rotondo, Trustee, Brown Township (Carroll County)\n.Ron Miller, Trustee, Holmes Township (Crawford County)\n.Tom Bentley, Secretary/Treasurer, Ohio Society of Fire Service Instructors (OSFSI)\n.Charlie Dixon, Vice President, OSFSI\n.John Desmarteau, Northeast Ohio Fire Prevention Association (NEOFPA)\n.Jim Davis, NEOFPA\n.Chief Scott Skeldon, Ohio State Firefighters Association (Jefferson Twp.",
    "Fire Department (Jackson County)\n.Chief Jack Smith, Ohio Fire Academy\n.Aaron Jennings, EMS Deputy Director, Ohio Department of Public Safety\n.Matt Jaksetic, EMA Planner, Ohio Department of Public Safety\nAt the event, Governor DeWine held a moment of silence in remembrance of Fire Lt. Philip M. Wigal of Town & Country Fire District in West Salem who was tragically struck and killed on Monday afternoon while working at the scene of an accident on I-71 in Wayne County.",
    "“I asked Fire Marshal Reardon to assemble the Ohio Task Force on Volunteer Fire Service to examine these issues and the state of fire services throughout Ohio and to provide recommendations so we can ensure the continuation of reliable emergency coverage for our communities.”\nData collected by the Division of State Fire Marshal shows more than half of registered fire departments in Ohio are staffed by volunteers.",
    "In making the announcement at the Central Ohio Fire Museum, Governor DeWine was joined by Ohio Department of Commerce Director Sherry Maxfield, State Fire Marshal Kevin Reardon, and several local elected officials and firefighters.",
    "There is no single greatest issue of concern, for the volunteer firefighter service there are many – and together, they are creating challenges never before seen,” said State Fire Marshal Kevin Reardon.",
    "(COLUMBUS, Ohio)—Ohio Governor Mike DeWine today announced the formation of the Ohio Task Force on Volunteer Fire Service to study and make recommendations to improve volunteer fire service in Ohio.",
    "“As a career firefighter, I know the fire service is rooted deep in tradition, but the challenges of today can only be addressed through forward-thinking, innovative solutions.",
    "“You never know when you may need emergency services, but you want to make sure that when you do need them, they are fast and efficient,” said Governor DeWine at the event.",
    "While there has been a 6.5 percent decrease in the number of volunteers in the state since 2018, there has been a continual increase in the number of emergency calls.",
    "(Clermont County)\n.Mark Gibson, Indian Joint Fire District (Logan County)\n.Justin Whitehead, Pleasant Twp.",
    "Volunteer Fire Department (Crawford County)\n.Jason Pollitt, Williamsburg Twp.",
    "Fire Department (Clark County)\n.Arron Lemaster, Scioto Twp.",
    "), Madison County EMA\n.Zach Wolfe, Holmes Twp."
  ]
}