{
  "id": 6439,
  "mediaId": 8358,
  "date": "2022-04-14",
  "headline": "Dark-money group helping Gov. Mike DeWine was funded by Republican Governors Association PAC",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/04/web1_DeWine-Mike.jpg",
  "link": "https://www.limaohio.com/news/504881/dark-money-group-helping-gov-mike-dewine-was-funded-by-republican-governors-association-pac",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4710,
    2143,
    1991,
    1122,
    1126,
    476,
    508,
    6474
  ],
  "sentences": [
    "Last year, major donors to the RGA from Ohio included:\nCincinnati-based health insurer Anthem Blue Cross Blue Shield ($540,000 in 2021 total donations)\nKaren Buchwald Wright and Thomas Rastin, a married couple who are top executives at Mount Vernon-based Ariel Corporation, which makes natural-gas compressors ($250,000 each)\nCareSource Management Services, which offers Ohio’s largest Medicaid managed care plan ($185,450)\nSugar Creek Packing Co., a Washington Court House-based bacon manufacturer ($100,000)\nAlbert Ratner of Lyndhurst, the former CEO of Forest City Enterprises ($50,000)\nTaft Stettinius and Hollister, a prominent Cincinnati law firm ($25,900)\nBesides Free Ohio, at least two other dark-money groups have been working to help DeWine win the May 3 primary against three challengers.",
    "Dark-money groups have proliferated in Ohio and around the nation following the U.S. Supreme Court’s landmark “Citizens United” decision in 2010 which opened the door for unlimited political spending by outside political groups so long as they don’t directly coordinate with political candidates.",
    "One of those groups, Ohioans for Free and Fair Elections has spent somewhere between $46,000 and $62,000 on Facebook ads in January and February promoting DeWine, according to the social media website’s ad-transparency portal.",
    "Another group called the Ohio Conservative Restoration Project, a 501(c)4 non-profit based in the state of Delaware, has launched attack ads against ex-U.S. Rep. Jim Renacci, one of DeWine’s Republican primary opponents.",
    "The other two Republicans on this year’s gubernatorial primary ballot, Columbus-area farmer Joe Blystone and ex-state Rep. Ron Hood of Pickaway County, have not yet purchased TV or radio spots.",
    "During the 2018 general-election campaign, the political action committee directly reserved hundreds of thousands of dollars worth of TV ad time to help the Greene County Republican.",
    "DeWine’s own campaign has spent about $1.5 million on ads since last November, including more than $1.1 million worth of broadcast TV ads, according to Medium Buying.",
    "The RGA itself last filed a campaign-finance report in December 2021 and doesn’t have to start reporting its 2022 receipts or spending until mid-year.",
    "Mike DeWine’s re-election is being funded by the campaign arm of the Republican Governors’ Association, according to federal campaign-finance records.",
    "Renacci’s campaign has spent about $800,000 on ads as of Thursday, the majority of which ran on cable TV networks, Medium Buying statistics show.",
    "Free Ohio has spent nearly $778,000 on pro-DeWine TV and radio ads in recent months, according to Columbus-based ad tracker Medium Buying.",
    "By Jeremy Pelzer - cleveland.com (TNS)\nCOLUMBUS, Ohio — A dark-money group that’s been running a barrage of advertising supporting Gov.",
    "Free Ohio PAC received $1,050,000 in the first three months of 2022, according to the Federal Election Commission.",
    "It’s not the first time the Right Direction PAC has helped buy ads on DeWine’s behalf.",
    "All of that money came from the RGA Right Direction PAC, FEC records show.",
    "Previous"
  ]
}