{
  "id": 6447,
  "mediaId": 8455,
  "date": "2022-04-11",
  "headline": "Ohio Restaurant Association endorses DeWine-Husted ticket in Toledo",
  "image": "https://www.toledoblade.com/image/2022/04/11/600x_q90_a4-3_cTCjpg/CTY-Husted12-6.jpg",
  "link": "https://www.toledoblade.com/local/politics/2022/04/11/ohio-restaurant-association-endorses-dewine-husted-ticket/stories/20220411130",
  "mediaOutlet": "The Toledo Blade",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Trevor Hubert",
  "authorUrl": "",
  "termIds": [
    1991,
    2121,
    2143,
    4736,
    3346,
    3871,
    6077,
    6474,
    6155,
    6660
  ],
  "sentences": [
    "“They want to have places to go and spend that money when they have a little extra at the end of the day and at the end of the week, and restaurants and entertainment like [Tony Packo’s] are the places that they love to go.”\nThe idea that the pandemic lockdowns imposed by the administration were too restrictive and hurt small businesses have been a talking point for the incumbent ticket’s GOP opponents, but the restaurant association, who worked closely with the administration through the pandemic, were confident in the abilities of Mr. DeWine and Mr. Husted to lead Ohio through a difficult time.",
    "“They were very balanced in their thinking, and the balance was making sure we were safe.”\nMr. Husted even followed the tradition of the celebrities and public figures who have come to eat at the famous Toledo venue, signing a hot dog bun to be placed on the restaurant’s wall during his visit.",
    "“When we thought about this election again, and who do we need in the governor’s office to kind of lead this, it makes sense to us to work with people who are focused on making good decisions, working with businesses,” Mr. Barker said.",
    "Governor Jon Husted received an endorsement on Monday for their quest for re-election from the Ohio Restaurant Association, which in Toledo praised the efforts that were made to support the industry through the coronavirus pandemic.",
    "Mr. Husted used the Intel semiconductor plant coming to Columbus and the Whirlpool facility in Findlay, which he also visited on Monday, as places that can create good jobs that bring a ripple effect to other Ohio industries.",
    "“We greatly appreciate the restaurant association’s efforts in the last couple of years, especially helping us, as well as all the restaurants,” said Scott Radel, executive vice president of the Tony Packo Food Company.",
    "The DeWine-Husted ticket is on the Republican primary ballot with three opponents: former U.S. Rep. Jim Renacci, central Ohio cattle farmer Joe Blystone, and former state Rep. Ron Hood.",
    "The winner of the GOP nomination will go on to face the Democratic primary winner in November, which is between former Dayton Mayor Nan Whaley and former Cincinnati Mayor John Cranley.",
    "The official announcement came before a small crowd at Tony Packo’s Cafe in East Toledo, with Mr. Husted appearing beside Ohio Restaurant Association President John Barker.",
    "Mr. Husted touted the work that has been done by the DeWine administration to continue to make Ohio an attractive place to do business for companies large and small.",
    "\"Ask the bar & grill owner in Maumee who lost everything or the couple in Toledo who owned a coffee shop who closed the doors forever if they endorse DeWine?",
    "\"When you are losing like DeWine is, all you have left are bought and paid for special interest endorsements,\" Renacci campaign spokesman Tom Weyand said.",
    "The Renacci campaign provided a statement in response to Monday's endorsement.",
    "The Blystone and Hood campaigns did not respond to a request for comment.",
    "“When you create great jobs, people have money in their pocket,” he said.",
    "Early voting for the May 3 primary election is under way.",
    "The other 65 percent will be supporting Jim Renacci.\"",
    "First Published April 11, 2022, 2:45pm",
    "The swamp will support the swamp.",
    "Mike DeWine and Lt.",
    "Ohio Gov."
  ]
}