{
  "id": 6453,
  "mediaId": 8381,
  "date": "2022-04-12",
  "headline": "Northwest Ohio ODOT to observe National Work Zone Awareness Week",
  "image": "https://www.thenbxpress.com/wp-content/uploads/2018/05/cropped-NBX-Site-Icon-June-2018-1-32x32.jpg",
  "link": "https://www.thenbxpress.com/odot-national-work-zone-awareness-week-in-nw-ohio/?utm_source=rss&utm_medium=rss&utm_campaign=odot-national-work-zone-awareness-week-in-nw-ohio",
  "mediaOutlet": "NBX Press",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff \"JP\" Miklovic",
  "authorUrl": "https://www.thenbxpress.com/author/jpmiklovichotmail-com/",
  "termIds": [
    5126,
    4082,
    2143,
    966,
    982,
    6345,
    6474
  ],
  "sentences": [
    "“This is when we show an extra level of support for those who maintain the highways, who work alongside their coworkers performing needed work under significant risk, and who truly serve the public through their jobs,” said Pat McColley, ODOT District 2 deputy director.",
    "Focus on safety of workers, motorists\nBOWLING GREEN, Ohio (Monday, April 11, 2022) – An important week for the Ohio Department of Transportation (ODOT) is National Work Zone Awareness Week, which is April 11-15 this year.",
    "“We emphasize repeatedly to our employees to work safely every day, to be on watch for each other, and to keep our work zones safe for motorists passing through,” said Chris Hughes, ODOT District 1 deputy director.",
    "In 2020, 117 of the 857 fatalities were work zone workers, making it all the more important for drivers to slow down and stay focused while approaching and passing through a roadway work zone.",
    "The men and women who work hard each day to ensure that we have safe roads and bridges in good condition deserve to make it home safely to their family at the end of the day,” said Gov.",
    "National Work Zone Awareness Week first launched in 1997 as a public awareness campaign to help everyone understand they play a role in keeping motorists and roadway workers safe.",
    "“Drivers can protect themselves and our workers simply by slowing down.”\nLast year, there were 4,796 crashes in Ohio work zones, 35% of them occurred with workers present.",
    "Here are more work zone stats:\nIn 2021, the Ohio State Highway Patrol issued 6,015 citations in work zones with 41% being more than 20 mph over the posted speed limit.",
    "There have been 162 ODOT workers killed on the job, the last being John Pasko who was hit on I-680 in Mahoning County on March 15, 2018.",
    "“We rely on those we share the road with to drive as safely as possible all the time, but especially through work zones,” he said.",
    "Locally, ODOT crews in northwest Ohio were struck nine times in 2021 while performing work related to highway maintenance.",
    "What many fail to recognize is the vast majority of people killed in work zone crashes are motorists and their passengers.",
    "This year’s theme is “Work Zones are a Sign to Slow Down.”\n“Driving in a work zone requires your undivided attention.",
    "Ohio law requires you to move over a lane for any roadside worker or vehicle with flashing lights.",
    "ODOT workers, vehicles, and equipment were hit 154 times last year, resulting in five injuries.",
    "“Speed and distracted driving are two of the biggest issues we see in our work zones.",
    "The lives of our men and women depend on it,” said ODOT Director Jack Marchbanks.",
    "Move over, slow down, and above all pay attention when you’re on the road.",
    "Nationally, work zone deaths have risen for five of the past six years.",
    "Ask any ODOT worker and they likely have a ‘close call’ story to tell.",
    "Already this year, ODOT crews have been hit more than 70 times.",
    "If you cannot safely move over, you’re required to slow down.",
    "These crashes resulted in 1,759 injuries and 29 deaths.",
    "Of those, 20 workers were injured and 1 killed.",
    "That’s unacceptable.",
    "Mike DeWine."
  ]
}