{
  "id": 6559,
  "mediaId": 8496,
  "date": "2022-04-15",
  "headline": "Ohio Gov. Mike DeWine reveals COVID-19 diagnosis in Twitter post",
  "image": "https://media.wkyc.com/assets/WKYC/images/f855a1b1-4ba3-497b-9477-24298e9fbeb5/f855a1b1-4ba3-497b-9477-24298e9fbeb5_1140x641.jpg",
  "link": "https://www.wkyc.com/article/news/local/ohio/governor-mike-dewine-diagnosed-covid-19/95-9db96c1a-8f5d-4ba0-940e-e305b8b71493",
  "mediaOutlet": "WKYC NBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Beeble",
  "authorUrl": "",
  "termIds": [
    2143,
    253,
    6077
  ],
  "sentences": [
    "— Governor Mike DeWine (@GovMikeDeWine) April 15, 2022\nMore on rising COVID-19 numbers from a WKYC report that aired on April 13, 2022:\nRelated Stories:\nWant to be among the first to know the most important local and national news?",
    "COLUMBUS, Ohio — Editor's note: The above video is from an unrelated news report on a new COVID-19 variant\nHe is currently experiencing mild symptoms including a runny nose, headache, body aches and sore throat.",
    "— Governor Mike DeWine (@GovMikeDeWine) April 15, 2022\nBoth Governor DeWine and Mrs. DeWine are fully vaccinated, each having received the two-dose vaccination and a booster shot.",
    "— Governor Mike DeWine (@GovMikeDeWine) April 15, 2022\nEarly this evening, Governor DeWine received a monoclonal antibody treatment.",
    "The governor underwent monoclonal antibody treatment earlier in the evening and is currently in quarantine, according to the post.",
    "The CDC's mask mandate on public transportation was set to expire on April 18 but was extended to May 3 earlier this week.",
    "Governor DeWine has been experiencing mild symptoms such as a runny nose, headache, body aches, and a sore throat.",
    "Today, Ohio Governor Mike DeWine announced that he has been diagnosed with COVID-19 by his personal physician.",
    "Both Gov, DeWine and his wife Fran are fully vaccinated and have each received a booster shot.",
    "Mrs. DeWine is not currently experiencing any symptoms and has tested negative for COVID.",
    "The governor's positive test comes on the heels of a national uptick in COVID cases.",
    "Download the free WKYC app and get updates right on your phone: Android, Apple.",
    "To follow CDC COVID-19 diagnosis protocol, Governor DeWine is in quarantine.",
    "First Lady Fran DeWine is experiencing no symptoms and has tested negative."
  ]
}