{
  "id": 6622,
  "mediaId": 8276,
  "date": "2022-04-15",
  "headline": "Program that provides housing to pregnant moms expanding in effort to cut infant mortality",
  "image": "https://www.gannett-cdn.com/presto/2022/04/13/NCOD/eaa95858-cc46-4d3f-a8f2-93769aac633c-MT_Pegnancy_homes_ea5.JPG?crop=1999,1125,x0,y243&width=1999&height=1125&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/homelessness/2022/04/14/ohio-healthy-beginnings-at-home-pregnant-woman-infant-mortality-outcomes-state-arpa-funding/9490049002/",
  "mediaOutlet": "bucyrustelegraphforum.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Titus Wu",
  "authorUrl": "https://www.dispatch.com/staff/6329307002/titus-wu/",
  "termIds": [
    2143,
    3038,
    30,
    6077,
    6060,
    5926,
    6104
  ],
  "sentences": [
    "\"It's exciting to have a way to demonstrate in a very specific, very stubborn problem of infant mortality, that a housing strategy can make a measurable difference,\" said Bill Faith, executive director of the Coalition on Homelessness and Housing in Ohio.",
    "In an effort to reduce infant mortality in Ohio, a pilot program that provides housing to pregnant women dealing with or at risk of homelessness will soon expand in Columbus and put new roots in Akron.",
    "Titus Wu is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "If this project replicates the same positive results, it will pave the way for all levels of government, especially at the federal level, to invest and turn it into real policy, supporters said.",
    "Named Healthy Beginnings at Home, the research program had a first iteration that began in 2018, when it studied 100 pregnant women in Columbus, of whom half were given subsidized housing.",
    "Ohioans interested in participating can contact one of the many organizations involved, such as CareSource, Summit County Public Health, the Homeless Families Foundation and others.",
    "Currently, the initial $2.25 million will only cover 60 women in Columbus and 30 in Akron with a starting date in the summer, said Maureen Stapleton, who leads CelebrateOne.",
    "According to the Centers for Disease Control and Prevention, Ohio had the 10th worst infant mortality rate in the nation during 2020, at 6.53 deaths per 1,000 births.",
    "Advocates are asking the rest come from the state's portion of federal aid from the American Rescue Plan Act, combined with other grants and fundraising.",
    "The state will provide $2.25 million from its budget for the expansion, but groups behind the program are asking for $9 million more for further growth.",
    "That's why a second iteration is being put into motion, with the goal of housing 300 women across Columbus, Akron, Dayton and Cincinnati.",
    "Mike DeWine prioritized setting that initial amount aside in the state budget and promoted the program in his State of the State address.",
    "There were fewer fetal deaths, less Medicaid spending and shorter stays at newborn intensive care units for those who received housing.",
    "Spearheaded by CelebrateOne, a public-private partnership backed by the city of Columbus, the project had positive results.",
    "Community services such as health care coordination and landlord mediation were also provided over two years to the women.",
    "\"I don't know of any other state where the governor took this kind of personal interest in a project like this,\" he said.",
    "Faith said talks with lawmakers and the DeWine administration on the additional dollars have been receptive.",
    "When asked if DeWine supported spending ARPA dollars for it, a spokesperson said it was still under review.",
    "Regardless, cities are currently making steps to prepare for Healthy Beginnings at Home.",
    "\"This is an opportunity to change how the world views this work.\"",
    "\"We're not going to stop with 300 (women),\" said Stapleton.",
    "But the study sample was not big enough.",
    "Gov."
  ]
}