{
  "id": 671,
  "mediaId": 6545,
  "date": "2022-02-19",
  "headline": "Brian Flores Hired By Pittsburgh Steelers",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/02/19/1af76887-ebae-4ced-9f91-d6f11908fed7/thumbnail/1200x630/d7ee6613efe39c9735b0ddbb574351bc/GettyImages-1363920993.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/brian-flores-pittsburgh-steelers/",
  "mediaOutlet": "newyork.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KDKA-TV News Staff",
  "authorUrl": "",
  "termIds": [
    3258,
    2513,
    893,
    901,
    1054,
    397,
    859,
    785,
    691
  ],
  "sentences": [
    "— Pittsburgh Steelers (@steelers) February 19, 2022\n\"I am excited about Brian Flores joining our coaching staff given his history of developing and teaching defensive players during his time in the NFL,\" Steelers Head Coach Mike Tomlin said.",
    "His lawsuit, which alleges his interview earlier this year for the New York Giants head coach role was only done to satisfy the Rooney Rule, has placed a spotlight on NFL coaches and diversity.",
    "He made national headlines earlier this month for his lawsuit against the NFL and several other teams, alleging racial discrimination in the coach hiring process.",
    "Flores has coached with the NFL for over 14 years, first with the New England Patriots before accepting the head coach position with the Miami Dolphins in 2019.",
    "By: KDKA-TV News Staff\nPITTSBURGH (KDKA) -- The Pittsburgh Steelers just announced they are hiring Brian Flores as their senior defensive assistant/linebackers.",
    "In his time as the Dolphins' head coach, he managed a 24-25 record, so his firing came as a surprise to the fanbase.",
    "Flores fills in the vacancy left by Teryl Austin, who is now defensive coordinator after Keith Butler's retirement.",
    "He served as the Miami Dolphins head coach from 2019 to 2021, and he was let go after two winning seasons.",
    "\"Brian's resume speaks for itself, and I look forward to him adding his expertise to help our team.\"",
    "The Steelers are still looking for a candidate to replace Kevin Colbert as general manager.",
    "Stay with KDKA as we follow this developing story\nIn:\nPittsburgh Steelers\nFootball\nNFL",
    "The NFL, Dolphins, Broncos and Giants deny wrongdoing in response to the suit.",
    "We have named Brian Flores as our senior defensive assistant/linebackers.",
    "Flores went on to interview for other head coach positions in the NFL.",
    "Mike Tomlin currently is the only Black head coach in the NFL."
  ]
}