{
  "id": 791,
  "mediaId": 2640,
  "date": "2022-02-26",
  "headline": "Bars Replace Russian Vodka",
  "image": "https://img2-azrcdn.newser.com/image/1400533-12-20220326011424.jpeg",
  "link": "https://www.newser.com/story/317431/bars-replace-russian-vodka.html",
  "mediaOutlet": "newser.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Mike DeWine ordered the Department of Commerce to halt the purchase and sale of Russian Standard vodka, and Ohio's 487 liquor agencies have been asked to pull Russian Standard and Green Mark vodka, per WKYC.",
    "(Newser) – Some bars and liquor stores think they’ve found a potent way to punish Russia for invading Ukraine: They’re pulling Russian vodka off their shelves and promoting Ukrainian brands instead.",
    "The Magic Mountain ski resort in Londonderry, Vermont, posted a video on Twitter showing an employee pouring Stolichnaya down the drain and saying, \"Sorry, we don't serve Russian products here.\"",
    "In Canada, the Liquor Control Board of Ontario on Friday announced that \"all products produced in Russia will be removed from LCBO channels,\" including 679 of its stores across the province.",
    "Likewise, the Southern Spirits liquor store in Indian Land, South Carolina, is doing a booming business in the Ukrainian vodka Kozak after pulling Russian brands off its shelves.",
    "It promised to accept the return of any Russian products and declared that it \"stands with Ukraine\" and the Ukrainian Canadian community in Ontario.",
    "So he rid his shelves of the old Soviet brand Stolichnaya and started promoting Ukraine’s Vektor, the AP reports.",
    "You wonder what you can do,\" said Bob Quay, owner of Bob's Bar in Grand Rapids, Michigan.",
    "\"It's selling out a lot faster than we thought,\" said general manager Drew Podrebarac.",
    "\"I woke up yesterday morning, and I saw that Russia had invaded Ukraine.",
    "In Wichita, retailer Jamie Stratton recommends Khor vodka, per WJW.",
    "We've got people coming in who've never been in the bar before.\"",
    "\"If you want to buy some vodka, don’t buy Russian,\" he said.",
    "Quay announced the move on Facebook, and \"it blew up.",
    "\"We have a sign above it that says: Support Ukraine.\"",
    "A Ukrainian flag is going up next week, he said.",
    "(Read more Russia-Ukraine conflict stories.)",
    "I thought I would put on sanctions as well.\"",
    "\"The US obviously is putting on sanctions.",
    "\"It's been awesome.\"",
    "\"Buy Ukrainian.\"",
    "In Ohio, Gov."
  ]
}