{
  "id": 8180,
  "mediaId": 8320,
  "date": "2022-04-06",
  "headline": "Making sense of a conflict 5,000 miles away",
  "image": "https://flyernews.com/wp-content/uploads/2018/08/NewNewsLogo-150x150.png",
  "link": "https://flyernews.com/campus/making-sense-of-a-conflict-5000-miles-away/04/06/2022/",
  "mediaOutlet": "flyernews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Bilocerkowycz also described the anxiety that many Americans feel while trying to stay up-to-date on the war, adding that even with constant news coverage, “we get just a fraction of what they’re feeling.”\n“We can barely handle the news of the event, let alone they’re dealing with the dislocation, the horror, the destruction, the death,” Bilocerkowycz said.",
    "“But at the same time, I’m so proud of how defiant, how strong, how unified [the Ukrainians] are against odds – it’s really a David against a Goliath.”\nFor more campus news like Flyer News on Facebook and follow us on Twitter (@FlyerNews & @FlyerNewsSports) and Instagram (@flyernews).",
    "“You have your analytical side, but you also have your human side of wow, they’re destroying these beautiful key cities.”\nBilocerkowycz said that one of his relatives, who works as a farmer, is still living in Western Ukraine in a small village just outside a bigger town.",
    "Bilocerkowycz said that a good way to support Ukraine from thousands of miles away is to continue to educate others on the conflict as well as show solidarity in small acts, such as hanging up Ukrainian flags like many political science professors have in St. Joseph Hall.",
    "As Bilocerkowycz put it, Putin “doesn’t want a democracy at his doorstep.”\nThe impact in Dayton, Ohio\nUkraine is not only a strategic country for Russia, Bilocerkowycz said, but the invasion of Europe’s largest country poses an issue for the West as well.",
    "“And now, the rest of the world has discovered Ukraine, too.”\nIn addition to his own studies, Bilocerkowycz’s daughter, Sonya, taught English abroad for two years, one of them being at Ukrainian Catholic University in Lviv, Ukraine.",
    "The Associated Press reports that after anti-government protests eventually ran Yanukovych out of Ukraine, Russia invaded Ukraine in February 2014 and seize the Crimean Peninsula as a way to salvage its lost influence in Ukraine.",
    "Not only has the Russian president claimed that Ukraine has always been a part of Russia, denouncing the country’s sovereignty, but having a successful democracy so close to home poses and threat to Putin’s political grip.",
    "Sonya, a UD alumna, is also the author of the award-winning book, “On Our Way Home from the Revolution: Reflections on Ukraine,” and is currently teaching creative writing at the State University of New York Geneseo.",
    "Most recently, Bilocerkowycz noted the impact of the 2013 Ukrainian crisis, when Ukrainian President Viktor Yanukovych sparked mass protests after rejecting a deal for greater integration with the European Union.",
    "Now, as we head into week six of the conflict, students over 5,000 miles away are able to watch first-hand accounts of the destruction, whether it’s 24/7 news coverage or videos shared on social media platforms.",
    "In a release on March 17, Ohio Governor Mike DeWine said that the state is open to assisting Ukrainian refugees, and added that over 500 Ukrainians have resettled in Ohio since the Lautenberg Amendment in 2018.",
    "Students, staff and faculty have also shown an interest in learning more about the conflict, Bilocerkowycz said, who teaches the history of Ukraine and Russia in several of his courses at UD.",
    "But experts like UD political science professor Dr. Jaro Bilocerkowycz can point back as far as the fall of the Soviet Union for answers as to why Russia decided to invade Ukraine.",
    "Not only was Ukraine the largest non-Russian nation at the fall of the Soviet Union in 1991, but the country has had a 30-yearlong fight to establish democracy in its state.",
    "Explaining February’s invasion\nAs an expert on the topic, Bilocerkowycz offered several reasons why Ukraine plays an important role for Russia’s President Vladimir Putin.",
    "The professor wrote in his article for The Conversation that “ideological battle lines this time will be between democracies and autocracies” as opposed to communism.",
    "The University of Dayton has also been vocal about standing in solidarity with Ukraine, from offering prayers for peace to hosting the Ukrainian teach-in in March.",
    "Kaitlin Lewis | Online Editor-in-Chief\nFor many students, the Russia-Ukraine war was the first international conflict they watched unfold in front of their eyes.",
    "Bilocerkowycz, whose studies have focused on post-Communist states including Russia and Ukraine, also has a personal connection to the current conflict abroad.",
    "“Some of my students, because I share this in many of my classes, say they are sharing it with their roommates and with their parents,” Bilocerkowycz said.",
    "Balancing feelings of empathy\nFor someone with a personal connection to Ukraine, Bilocerkowycz said that the war does weigh on him psychologically as well.",
    "While the smaller village has been left mostly unaffected by the conflict, Bilocerkowycz’s relative has still watched the devastation to the nearby town.",
    "For one, if Ukraine falls to Russia, it poses a threat to its neighbors such as Poland and Romania, allowing the conflict to become an issue for NATO.",
    "Students, faculty and staff can also show support through donations, such as to organizations like the Ukrainian Catholic University’s relief fund.",
    "“Ukraine has always been a key focus of my intellectual interest as well as sort of cultural background,” Bilocerkowycz explained.",
    "Even prior to the invasion of Ukraine on February 24, anxiety was growing as news outlets warned of advancing Russian troops.",
    "Photo caption: Easter eggs painted with sunflowers in the colors of the Ukrainian flag are on display in Roesch Library.",
    "With his parents being of Ukrainian descent, Bilocerkowycz himself is well-versed in the Ukrainian language and culture.",
    "During the conflict, Russia backed President Yanukovych’s choice while the U.S. and Europe supported the protestors.",
    "Roesch Library is also holding a small display of Ukrainian Easter eggs on its main floor through April 25.",
    "Now, Putin’s invasion in 2022 is another example of him trying to protect his legacy, Bilocerkowycz said.",
    "“It’s like two generations now of focus on this and shares that with our students,” Bilocerkowycz said.",
    "“It’s always been a challenging relationship from Ukraine’s perspective,” Bilocerkowycz said.",
    "In addition, Bilocerkowycz said that Ukrainian roots can be found all throughout the U.S.",
    "Bilocerkowycz said that fighting in eastern Ukraine has stayed fairly consistent since.",
    "Bilocerkowycz also argues that the conflict could result in a new Cold War.",
    "“You just pray that he’s going to be okay,” Bilocerkowycz added.",
    "Photo by Keegan Gupta, director of digital media & photography.",
    "“In some ways, the war began in 2014,” Bilocerkowycz said.",
    "UD expert shares insight on the Russian-Ukraine war.",
    "“It’s heart-wrenching,” he added."
  ]
}