{
  "id": 8395,
  "mediaId": 8498,
  "date": "2022-04-05",
  "headline": "Advocates for low-income, minority Ohioans call on House speaker to stop “divisive concepts” bill",
  "image": "https://woub.org/wp-content/uploads/2021/12/statehouse_cupola-scaled-e1638548911197.jpg",
  "link": "https://woub.org/2022/04/05/advocates-for-low-income-minority-ohioans-call-on-house-speaker-to-stop-divisive-concepts-bill/",
  "mediaOutlet": "woub.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Karen Kasler | Statehouse News Bureau",
  "authorUrl": "https://woub.org/post_author/karen-kasler-statehouse-news-bureau/",
  "termIds": [
    0
  ],
  "sentences": [
    "0+1\n0Like\n0Share\n< < Back to\nCOLUMBUS, Ohio (Statehouse News Bureau) — Advocates for low-income and minority Ohioans are blasting a Republican-backed bill that goes beyond banning the teaching of so-called “divisive concepts” or what some call “critical race theory” in just K-12 schools.",
    "“Further, instead of having individuals on staff with non-profits or public agencies to further this understanding, to get to root causes, to get to continuous improvement, instead there’s going to be policing, policing and making sure that people aren’t violating this law.",
    "We should be united in an effort to create solutions to health disparities, not greater gaps.”\nThe groups are asking House Speaker Bob Cupp (R-Lima) to stop further hearings on the bill, which is a hot issue among GOP candidates.",
    "It denies data research and what’s going on in everyday communities.”\nDemocratic former state senator Charleta Tavares is the Chief Executive Officer of PrimaryOne Health, a nonprofit that operates health centers in Columbus.",
    "And instead create a myriad of challenges for educators, for state and local government agencies, and for nonprofit organizations that receive funding from the state of Ohio and local and local funding,” Najera said.",
    "“They would lose their funding by attempting to address health disparities and state or local governments would be barred from giving out funding to address health disparities going forward,” Tavares said.",
    "House Bill 327 would prevent K-12 schools, colleges and universities, state agencies and local governments from discussing racism in public policy in training and educational events.",
    "Period.”\nThere was no response to a request for comment from the bill’s Republican sponsors, Rep. Diane Grendell (R-Chesterland) and Rep. Sarah Arthur Fowler (R-Ashtabula).",
    "The groups noted the state’s infant mortality rate is three times higher for Black infants than white infants, and Black Ohioans have shorter lifespans than white Ohioans.",
    "Tim Ahrens is the senior minister at Columbus’ First Congregational Church, and said the bill is morally bankrupt because it ignores obvious racial disparities.",
    "Mike DeWine launched a minority health strike force during the pandemic, to look into why COVID was hitting minority communities harder.",
    "Tracy Najera is the executive director of the Children’s Defense Fund, and said the bill is a solution to a problem that doesn’t exist.",
    "And they said the bill is especially surprising because Ohio was the first state to create an Office of Minority Health, and that Gov.",
    "Black Ohioans are also more to be overweight/obese, have adult onset diabetes, and experience long-term complications from diabetes.",
    "In short, averting our eyes from reality does nothing to help Ohioans.”\nAnd some religious leaders are speaking out as well.",
    "“House Bill 327 represents an unprecedented attack on public health efforts for the least of these in Ohio,” said Ahrens.",
    "It cannot be amended to make it better,” said Tim Johnson with the Ohio Poverty Law Center.",
    "She said the bill could strip the funding of groups receiving state grants.",
    "“Every single one of us who call ourselves righteous should be ashamed.",
    "The bill had its first hearing in June and hasn’t had a second one.",
    "“The legislature must acknowledge that the bill cannot be fixed.",
    "And they want a key Republican leader to halt the bill entirely.",
    "“House Bill 327 must not move forward.",
    "“It denies history.",
    "“It will hurt.",
    "Rev."
  ]
}