{
  "id": 8529,
  "mediaId": 8379,
  "date": "2022-04-06",
  "headline": "Bigotry or parental choice? Ohio’s proposed ‘don’t say gay’ bill",
  "image": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/03/cfc2d8ee98ea466d9960a6f205dfab14.jpg?w=1280",
  "link": "https://www.nbc4i.com/news/local-news/downright-bigotry-teachers-lgbtq-leaders-condemn-dont-say-gay-bill/",
  "mediaOutlet": "nbc4i.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maeve Walsh",
  "authorUrl": "https://www.nbc4i.com/author/maeve-walsh/",
  "termIds": [
    0
  ],
  "sentences": [
    "In addition to barring topics related to gender identity and sexual orientation, HB 616 would prohibit the following concepts:\nCritical race theory\nIntersectional theory\nThe 1619 Project\nDiversity, equity, and inclusion learning outcomes\nInherited racial guilt\n“As a social studies teacher and someone who majored in history in college, our history is not this perfect whitewashed thing we grew up with,” Coneglio said.",
    "And we can’t even recognize the family unit of some of our students?”\nConeglio, who formerly taught high school social studies for Columbus City Schools, described HB 616 as “mean-spirited” and “downright bigotry” that serves to marginalize the LGBTQ community while threatening to strip funding from schools where teachers are found in violation of the bill’s provisions.",
    "“We want kids to flourish and to be themselves and to grow up and be successful – nobody should be ashamed of who they are.”\nBut John Stover, president of Ohio Value Voters, said HB 616 ensures that instruction pertaining to LGBTQ-related issues is left in the hands of parents – who he said aren’t interested in having their children indoctrinated with sexual material.",
    "On Tuesday afternoon, the bill’s sponsors released a statement in which they touted HB 616 as a way to ensure students receive “a quality education that is fair, unbiased and age appropriate.”\n“The classroom is a place that seeks answers for our children without political activism,” Schmidt said in a statement.",
    "“But they’re trying to pander to a group of voters to get reelected.”\nNot only did Coneglio say the bill opens the door to punishing teachers who recognize the existence of a student’s LGBTQ family members, but it also sets a dangerous precedent stifling the support teachers can provide LGBTQ students.",
    "The intent of this bill is to provide them with the tools to be able to see what their child is being taught.”\nAlthough the sponsors provided comments in a release, Coneglio said “they should be ashamed of themselves” for initially dodging questions from reporters at the Statehouse earlier in the day.",
    "House Bill 616, introduced by Reps. Jean Schmidt (R-Loveland) and Mike Loychik (R-Bazetta), prohibits schools from teaching about “divisive or inherently racist concepts” – including sexual orientation and gender identity for students between kindergarten and third grade, according to the bill’s text.",
    "Youth who identify as LGBTQ are more than four times as likely as their peers to attempt suicide, with more than 1.8 million LGBTQ youth seriously considering suicide each year in the U.S., according to The Trevor Project, a suicide prevention and crisis intervention organization for LGBTQ people.",
    "We can’t improve in the future if we don’t address those tragedies.”\nFor Densil Porteus, the executive director of Stonewall Columbus, HB 616 reflects the erasure of the LGBTQ community from U.S. history and culture – and could be detrimental to the mental and physical health of LGBTQ youth.",
    "But he said Ohio Value Voters hope for a change in Republican leadership in November – particularly an election of Jim Renacci, one of DeWine’s challengers in the May primary – who will commit to supporting HB 616 and other efforts to restore the basic tenets of public education in Ohio.",
    "“If young people who are queer or LGBTQ and aren’t seeing their identities in education and the history of America, they aren’t seeing themselves as part of our history.”\nThe Trevor Project’s 24/7 crisis hotline can be reached by phone at 1-866-488-7386 or by texting “START” to 678-678.",
    "While Coneglio said it’s important that parents have input in their children’s development, teachers must be able to have the academic freedom to address students’ questions which, he said, deserve to be answered.",
    "COLUMBUS, Ohio (WCMH) – An Ohio bill similar to a recent one signed into law in Florida that opponents have called the “Don’t Say Gay” bill is the latest attempt by lawmakers to influence public education.",
    "Since being introduced Monday, the bill has been condemned as downright bigotry by some and lauded by others as a way to prevent the sexual indoctrination of schoolchildren and protect parental rights.",
    "LGBTQ youth who reported high levels of parental rejection are eight times more likely to attempt suicide than those whose parents are accepting of their sexuality, according to the Trevor Project.",
    "“The teaching of schools today, they’re on a mission to indoctrinate children, whether it’s with social-emotional learning, comprehensive sex education or CRT (critical race theory),” Stover said.",
    "“It certainly brings educators back to their primary mission that many parents feel that they should have, and that’s teaching children to read, write and learn math in schools,” Stover said.",
    "“And it’s extremely important that parents have their rights in place relative to the teaching of their children.”\nStover said he’s convinced that Gov.",
    "“I can’t even put into words the stupidity of this bill,” said John Coneglio, president of the Columbus Education Association.",
    "A bill aimed at “divisive concepts” such as critical race theory has been stalled in a House committee for months.",
    "“When some teachers aren’t accepting of their kids, it causes them to shut down,” Coneglio said.",
    "“Parents deserve and should be provided a say in what is taught to their children in schools.",
    "“If they’re proud of the legislation, they should be out there talking about it,” he said.",
    "“Identity is wrapped up in mental and physical wellness,” Porteus said.",
    "Mike DeWine, who he said isn’t cut from the same cloth as Florida Gov.",
    "“First of all, teachers are going to start having to pull books.",
    "Ron DeSantis, will veto HB 616 if it reaches his desk.",
    "“You can see all sorts of tragedies in our past.",
    "That’s even if it ever does."
  ]
}