{
  "id": 8673,
  "mediaId": 8473,
  "date": "2022-04-07",
  "headline": "We must hold Ohio officials accountable",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/opinion/letters-to-the-editor/2022/04/we-must-hold-ohio-officials-accountable/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "I witnessed appalling obstruction of justice tactics by some of the members to ensure they would be able to take this issue to Federal court where they think they have a better chance of getting a gerrymandered map approved.",
    "DEAR EDITOR:\nI watched most of the March 28 Ohio Redistricting Commission’s meeting to finalize non-gerrymandered Ohio constitutional maps due by midnight per the Ohio Supreme Court’s order.",
    "– Auditor Keith Faber -R-OH, 614-466-4514\n– State Rep. Allison Russo -D-OH, 614-466-8012 A call is warranted for her stellar representation of the Ohio Constitution and its citizens.",
    "– State Sen. Vernon Sykes -D-OH, Co-Chair of the Commission, 614-466-7041\nROBIN COX\nCincinnati\nNEWSLETTER\nToday's breaking news and more in your inbox",
    "– State Sen. Matt Huffman, R-OH, 614-466-7584\n– Frank LaRose, Secretary of State, R-OH, 330-349-2764\n– Rep. Robert Cupp, R-OH, 614-466-9624\n– Gov.",
    "Ohio Attorney General Yost’s office tells me that we, the voters, are the only ones that can hold these politicians accountable by our votes.",
    "I also witnessed stellar behavior by State Representative C. Allison Russo Ohio-D, District 24, a politician with a steel spine.",
    "Call to demand they deliver fair legislative maps per the Ohio Constitution regardless of what court they end up in.",
    "I suggest that we Ohioans take action right now and call their offices.",
    "Call to thank them for supporting Ohio’s Constitution and voters.",
    "Mike Dewine, R-OH, 614-466-3555\nNon-offender numbers.",
    "Contempt of court order offenders’ phone numbers."
  ]
}