{
  "id": 8854,
  "mediaId": 8285,
  "date": "2022-04-06",
  "headline": "Killing off Ohio’s Death Penalty",
  "image": "https://cdn2.cincinnatimagazine.com/wp-content/uploads/sites/5/2022/03/APR22_DeathPenaltyArt.jpg",
  "link": "https://www.cincinnatimagazine.com/article/killing-off-ohios-death-penalty/",
  "mediaOutlet": "cincinnatimagazine.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia Gallagher Newberry",
  "authorUrl": "https://www.cincinnatimagazine.com/author/patricia-gallagher-newberry/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I would rather spend the rest of my life in prison, being a better person, than be executed for something I did back when I was 19 and I’m very sorry for doing.” Given the severe restrictions on death row, he adds, “giving us life in prison would be like giving us our freedom back.”\nAfter a few e-mails and one call, he declined to talk again and asked not to be named, saying it could harm his ongoing efforts to win a sentence that could remove him from death row.",
    "“The death penalty is on its way out,” Ohioans to Stop Executions predicted in a year-end letter, “and this year has ensured that its demise will be sooner rather than later.”\nOthers, particularly those in charge of prosecuting murder charges, believe a death sentence is warranted for certain heinous crimes and that supposed public opposition to capital punishment is overstated.",
    "Margery Koosed knows all about the costs of the death penalty, along with a long list of other issues that, in her words, make Ohio’s death penalty “the most inefficient state program ever devised.” She’s researched and written about the topic since the 1970s, as a law professor (now retired) at the University of Akron and currently as chair of Ohioans to Stop Executions.",
    "It’s very subjective.”\nHe’s convinced a life sentence is not adequate punishment for some murderers, since prison time can include “working out every day, watching TV and movies, [using] your computer.” He’s concerned that life sentences are sometimes wiped away by “a goofy governor that lets them out” and returns murderers to communities where they can commit new crimes.",
    "Hamilton County Prosecutor Joe Deters, for one, thinks the death penalty is “sometimes the only thing that [victims’] families or the community demands and can get justice for.”\nJamison, as one of 186 inmates exonerated from death rows across the U.S., says the criminal justice system too often convicts innocent people.",
    "After a variety of interruptions—including a U.S. Supreme Court ruling in 1972 that the death penalty was unconstitutional and the drafting of a new Ohio capital punishment law in 1981—the state resumed executions in 1999, as “volunteer” Wilford Berry selected lethal injection over electrocution.",
    "One said he’s focused on getting evidence in his case reviewed and that “the topic of prison life, for a number of reasons, is not something that I like to discuss.” Another agreed to an interview and sent a dense four-part history of his case, but then changed his mind about talking.",
    "They include prosecutors who handle murder cases in Warren, Cleveland, and Cincinnati, along with the Ohio Prosecuting Attorneys Association, which wants to preserve the death penalty for “the worst-of-the-worst offenders,” Executive Director Louis Tobin told legislators last summer.",
    "It’s not the victim’s family.”\nThis spring, as lawmakers consider whether to end executions, 131 inmates will continue sitting in single cells on death row in the Chillicothe Correctional Institution, with the lone woman housed at the Ohio Reformatory for Women in Marysville.",
    "The most recent Ohio death row arrival, 40-year-old Joel Drain, was convicted of killing fellow Warren Correctional Institution inmate Christopher Richardson in 2019, hitting him with a fan before putting a pencil in his eye and strangling him with a cord.",
    "She spoke with exonerees convicted of murder with flawed evidence, such as Tyra Patterson, a Cincinnati woman released in 2017 after 23 years behind bars, and Joe D’Ambrosio, a Cleveland man released in 2010 after 21 years in prison.",
    "“If you’re a conservative Republican, chances are you have great concern about governmental overreach—and the most serious form of governmental overreach is taking life.”\nRukiye Abdul-Mutakallim serves on Koosed’s OTSE board.",
    "“They came to ask me six times what did I want for my last meal and where did I want my body sent.”\nAmong Jamison’s former Ohio death row friends, five with 2022 execution dates will be asked those same questions this year.",
    "Yet we still put young people in prison without addressing the root causes of their [criminal] actions.”\nThis year, the retired banking professional is aiming to raise $7,000 to install 1,000 flowerpots across Cincinnati.",
    "The annual review of Ohio death row cases, published by the attorney general’s office, reads like 132 mini horror stories, with terse retellings of shootings, stabbings, slashings, strangulations, beatings, and bindings.",
    "As just one example, in the Akron area, Summit County spent close to $268,000 on just the initial trial in a capital case in 2017, compared to $19,000 for a murder case without a death penalty specification.",
    "“Lethal injection appears to us to be impossible from a practical point of view today,” he told the Associated Press at the end of 2020, confirming the state’s “unofficial moratorium” on capital punishment.",
    "Or, like Jamison, they could be saved by a dramatic turn of events—in this case, the votes of Ohio lawmakers who are currently considering identical bills in the Senate and House to end capital punishment.",
    "In the last two decades, Ohio lawmakers have revisited capital punishment regularly and governors have had their say by way of commutations, typically turning death sentences into life without parole.",
    "When cases play out over years and years— the average stay for Ohio’s 56 executed inmates was more than 17 years—the families of victims and murderers are in and out of the court system and headlines.",
    "Koosed’s verdict is that the death penalty is “a wasteful system that’s totally broken and provides no societal benefit.” Even some right-of-center politicians are coming to that conclusion, she says.",
    "The Chillicothe prison—built as a federal facility in 1936 and taken over by Ohio in 1966—is situated on 72 acres along the Scioto River 50 miles south of Columbus and 100 miles east of Cincinnati.",
    "With SB103 and HB183 on the table, Koosed helped OTSE summarize its objections to capital punishment in The Failed Experiment: 40 Years of Ohio’s Death Penalty, a report released in December 2020.",
    "Study after study has shown that persons on trial for murder are more likely to face the death penalty if they’re Black and/or tried in a county with a prosecutor who favors the death penalty.",
    "Last year, Butler County’s Donald Ketterer became the second removed from death row under a new law prohibiting the execution of people with severe mental illness at the time of their crimes.",
    "The pots would replace pop-up memorials that mark trauma—the kind with teddy bears, balloons, and flower bouquets that die— with QR codes that provide the backstories of victims of violence.",
    "The first in line was an unlikely champion: Jean Schmidt, a Republican who supported capital punishment in her first four years in the Ohio House, then during eight years in the U.S. House.",
    "Throughout it all, he worked on his case, eventually convincing a court that he was convicted of murdering Cincinnati bartender Gary Mitchell based on false testimony and withheld evidence.",
    "“You have defense attorneys arm in arm with complacent judges…who are against the death penalty, for whatever reason, and they subvert it by delay after delay after delay,” says Deters.",
    "“No one takes any pleasure because there’s tragedy everywhere.” His job, says Deters, is to enforce the law of Ohio, which currently calls for the death penalty for certain murderers.",
    "They have a governor, running for re-election, who hasn’t overseen any executions since his election in 2018 and a state that’s produced just one death sentence in the last two years.",
    "“I was in hell, a living hell,” Jamison says now from Tampa, Florida, where he lives with his dog, Lucky, and works for the national anti-death penalty group Witness to Innocence.",
    "“When I left Congress, I began to go back into my community…and became convinced that we needed to end this.” Early on, she heard anti-death-penalty nun Sr. Helen Prejean speak.",
    "The state moved death row inmates to Chillicothe from Youngstown in early 2012 to reduce the time and cost of transporting them between death row and the so-called death house.",
    "The second longest held, John Stumpf, was convicted of shooting Mary Jane Stout four times in 1984, when he showed up at her Guernsey County home and asked to use the phone.",
    "A bipartisan coalition of state lawmakers hopes to end executions and make Ohio the 24th state to stop the death penalty’s “failed experiment.” Joe Deters is not on board.",
    "In Ohio, 59 percent prefer life in prison (with or without the possibility of parole) to death, according to a 2020 poll of 600 voters commissioned by OTSE and the ACLU.",
    "On a June night in 2015, Suliman Abdul-Mutakallim withdrew $60 from an ATM, picked up food from White Castle, and began walking back to his South Cumminsville home.",
    "Tobin believes polls overstate public opposition to capital punishment because their questions fail to highlight the circumstances that allow for a death sentence.",
    "Besides the 18 inmates convicted by Hamilton County juries, Ohio’s current death row population holds another 10 from Butler, Clermont, Brown, and Warren counties.",
    "I contacted those seven with local ties and asked how their lives would change if the pending bills become law; three responded via the penitentiary e-mail system.",
    "And he’s most agitated by the argument that says the death penalty should be eliminated because of the long number of years between death sentences and execution.",
    "Death row residents live in one of three 50-inmate units in Chillicothe, segregated from the rest of the 2,800 or so other prisoners in the general population.",
    "A third offered details about his day-to-day life, saying he spends most of his time in his cell drawing, listening to music, reading, and working on his case.",
    "Most recently, she’s taken interest in the case of Anthony Apanovitch, released from death row in 2015 but returned in 2018 for an error in his earlier appeal.",
    "Those encounters and her faith— she’s a pro-life, practicing Catholic— convinced Schmidt that a life sentence is the better punishment for convicted murderers.",
    "If they vote to keep capital punishment, he says, “then we owe it them to find a way forward” by figuring out a way to reduce delays and resume executions.",
    "Deters says he pursues the death penalty in Hamilton County only when he’s 100 percent sure a defendant is guilty and when he’s got solid proof for trial.",
    "Among them: killing a governor or president; killing someone younger than 13; and killing that involves kidnapping, rape, aggravated arson, or terrorism.",
    "On the cost front, the report notes that capital murder cases, from start to finish, cost two-and-a-half to five times more than non-capital ones.",
    "She can’t visit or write letters, but she’s sent him a dictionary and a book on Black history, and she’s seeking other ways to connect this year.",
    "Aggravated murder convictions would instead result in either a life sentence without parole or a life sentence with parole after 20 or 30 years.",
    "Death row’s longest resident, Gregory Esparza, was convicted of killing a Toledo store clerk in 1983 and stealing money from her cash register.",
    "The Findlay man was already serving time for killing an associate named Randy Grose in 2016, strangling and stabbing him and stealing his car.",
    "She read False Justice, written by former Ohio Attorney General Jim Petro and his wife, Nancy, about failings of the criminal justice system.",
    "Nationally, 54 percent support the death penalty for murder convictions, lower than at any time since 1966, according to a 2021 Gallup poll.",
    "This spring, Ohio legislators could write new state history with Senate Bill 103 and House Bill 183, which would abolish the death penalty.",
    "He believes life without parole is not the ultimate solution because it provides no greater punishment for committing more than one murder.",
    "Just 1.6 percent by this math: Ohio counties have filed 3,365 capital cases since the state enacted its current death penalty law in 1981.",
    "More recently, the state has not been able to buy the drugs it needs, since pharmaceutical companies don’t want to be tied to executions.",
    "Since he took office in January 2019, Mike DeWine has not made any commutations, but he has issued 30 reprieves to delay execution dates.",
    "Last summer, when Senate and House committees staged hearings on the bills, 58 witnesses spoke in favor of them and three spoke against.",
    "He takes issue with many of the arguments offered by their supporters and is especially aggrieved when appeal cases blame bad lawyering.",
    "Raised in a big family and the product of local Catholic schools, Deters originally opposed capital punishment, even as a law student.",
    "Like a growing number of Ohioans, he believes a life sentence—with or without possibility of parole—is a better option for the guilty.",
    "One additional expense: The state last year paid D’Ambrosio, the Cleveland exoneree, $1 million from its wrongful imprisonment fund.",
    "“There are some cases that are so horrible that I never saw until I was in this office and that leave incredible carnage,” he says.",
    "She and Columbus Democrat Adam Miller are the primary sponsors of HB183 with 16 other Democrats and six Republicans as cosponsors.",
    "“Appellate judges are reading a transcript and aren’t seeing the reaction of the witnesses, of the jury, of the judge,” he says.",
    "Executions, when and if they resume, take place about 40 miles south in Lucasville at the Southern Ohio Correctional Facility.",
    "Current death row inmates would not get an automatic reprieve and would instead need to seek resentencing to avoid execution.",
    "Nobody should have the right to say who should live or die.”\nOhio has been killing people who kill people since its founding.",
    "Put another way, the state spends at least double when it sentences a convicted murderer to death instead of life in prison.",
    "That’s 1.6 percent of the initial cases, “not worth the massive investment Ohioans have made in it,” the OSTE report says.",
    "He faced six execution dates himself, with the governor calling off each, one just 90 minutes before it was scheduled.",
    "“Do I want to die as opposed to spending the rest of my life in prison?” he asks in a subsequent phone conversation.",
    "The state can seek the death penalty only in aggravated murder cases—that is, killings with special circumstances.",
    "And the blame for high costs and inefficiency, he says, is baked into a system that allows for extended appeals.",
    "Two years later, Javon Coulter, one of three assailants, was sentenced to 20 years for his part in the murder.",
    "Seven of the inmates from southwest Ohio are among the 29 with scheduled execution dates stretching into 2025.",
    "“You have to get to the root of our prison situation, and I found that it’s the disease of trauma,” she says.",
    "“They’re just detached from everything, which makes it easy for a defendant to claim Oh, I had a bad lawyer.",
    "She created a nonprofit called The Musketeer Association, launching projects that address childhood trauma.",
    "In public appearances, Schmidt is asked about COVID and the economy more often than her death penalty bill.",
    "In the years since her son’s death, Abdul-Mutakallim has become an advocate for reform at multiple levels.",
    "The prison system has made that difficult, since inmates are barred from communication with their victims.",
    "With a judge’s permission and cameras rolling, she offered him forgiveness and he in turn asked for hers.",
    "Alternatives (firing squads, a return to hanging or electrocution) have not been seriously considered.",
    "He is among 11 Ohio death row inmates released after courts determined they were wrongfully convicted.",
    "She’s the Cincinnati woman who won national attention when she hugged the killer of her son in court.",
    "Abdul-Mutakallim was moved, then as now, by Coulter’s youth; he was just 14 at the time of his crime.",
    "In 2001, the state disconnected the electric chair, allowing for execution only by lethal injection.",
    "Eighteen of the current 132 inmates are from Hamilton County, second only to Cuyahoga County (24).",
    "En route, the 39-year-old Navy veteran was shot in the back of the head, robbed, and left to die.",
    "The balance of the state’s 131 condemned men, plus one woman, will face them in the years ahead.",
    "Before that, on his way out of office in 1991, Richard Celeste commuted eight death sentences.",
    "She was drawn back to state politics in 2020, she says, partly to repeal the death penalty.",
    "So did the expense of capital punishment, which she’d rather see directed to crime victims.",
    "Those dollars are largely wasted, Koosed says, since so few capital cases end in execution.",
    "He was awaiting his mother’s visit one day in 1997 when guards arrived to report her death.",
    "After nearly three decades on death row, he lives in hope that the death penalty will end.",
    "“I do believe that I’m changing hearts on my side of the aisle, one at a time,” she says.",
    "He landed on death row that September and is scheduled for execution on August 13, 2024.",
    "“The first thing they say is We need to end the death penalty because it takes too long.",
    "They have access to a common area, outdoor recreation, and a limited number of programs.",
    "If the bills pass, Ohio would be the 24th state in the country without a death penalty.",
    "“The death penalty simply adds to the pain for all those involved,” OTSE’s report says.",
    "But she says she’s not been shy about raising the issue with fellow Ohio lawmakers.",
    "Derrick Jamison served 20 years on Ohio’s death row for a crime he did not commit.",
    "“Most of the guys” on death row, he says, know about the bills and hope they pass.",
    "Deters did not testify against the state bills and doesn’t think they will pass.",
    "She’s also working to keep a promise she made to Coulter to stay in his life.",
    "One YouTube recording of the hug has been watched more than 37 million times.",
    "Bob Taft commuted one sentence; Ted Strickland, five; and John Kasich, seven.",
    "By its own count, Ohio has executed 393 convicted murderers in its history.",
    "He lived in a one-man cell, his meal trays slid through a slot in the door.",
    "And finally, as Derrick Jamison knows, the state sometimes gets it wrong.",
    "That’s when Rukiye Abdul-Mutakallim asked to hug Coulter and his mother.",
    "Support for capital punishment is in decline, the report reminds.",
    "They have national trends and prominent advocates on their side.",
    "When family visited, he talked with them from behind Plexiglas.",
    "The drugs often don’t work, leading to ugly botched procedures.",
    "“We should end the death penalty in America, period,” he says.",
    "In 2005, he was freed, with all charges against him dismissed.",
    "“Too many children suffer from trauma not of their own making.",
    "When they leave their unit, two guards cuff and escort them.",
    "Domestic partners (and their families) are frequent victims.",
    "Not everyone thinks SB103 and HB183 will pass, or should.",
    "She speaks against the death penalty on behalf of OTSE.",
    "He said goodbye to 18 fellow inmates who were executed.",
    "The death penalty is not applied evenly, says Koosed.",
    "Execution by lethal injection has been problematic.",
    "From 1897 to 1963, they died in the electric chair.",
    "She told Suliman’s story on stage at Memorial Hall.",
    "Tobin’s group believes Ohio voters should weigh in.",
    "He changed his mind while prosecuting murder cases.",
    "Meals still come on trays slid through cell doors.",
    "Supporters of the bills think they have the votes.",
    "6 nationally for its number of death row inmates.",
    "Of that number, 56 defendants have been executed.",
    "“You know, life changes you,” Schmidt says now.",
    "“I don’t enjoy it,” he says of capital cases.",
    "He arrived on death row the following May.",
    "Of those, 340 ended with a death sentence.",
    "In the 1800s, the condemned were hanged.",
    "They have sponsors from both parties.",
    "Alcohol and drugs are often involved.",
    "The death penalty prolongs trauma.",
    "It’s not the prosecutor’s office.",
    "At present, the state ranks No.",
    "In 2000, he won a new trial.",
    "Who’s causing this delay?",
    "“It’s wrong.",
    "How few?",
    "Really?"
  ]
}