{
  "id": 9073,
  "mediaId": 2919,
  "date": "2022-03-28",
  "headline": "The Intel project is great news. But what happens if it goes bad?",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/be2c9c1/2147483647/strip/true/crop/1024x538+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F34%2Fff%2F24b659604df7ac3c99fc8cd20dfd%2Fcash-incentives-slide-1024x576.jpeg",
  "link": "https://www.news5cleveland.com/news/state/the-intel-project-is-great-news-but-what-happens-if-it-goes-bad",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marty Schladen",
  "authorUrl": "https://www.news5cleveland.com/marty-schladen",
  "termIds": [
    4650,
    673,
    646,
    878,
    6310,
    6474
  ],
  "sentences": [
    "“Moreover, the subsidies will be drawn from Ohio’s public resources that will not be available to provide education to our young people, recover from the pandemic, and meet a host of other needs, from providing child care for families who desperately need support and keeping college tuition costs down to replacing lead water lines that threaten our health.”\nAn important question is whether state officials will set clear performance standards and create a mechanism to claw back public monies if it doesn’t meet them.",
    "When it announced in January that it would build two massive new plants in Licking County, semiconductor manufacturer Intel called it the “largest single private-sector investment in Ohio history.”\nBut what is perhaps obscured by that statement is that Ohio is also investing heavily in Intel.",
    "“The Job Creation Tax Credit is performance based, meaning if metrics are not achieved, the full benefit of the tax credit is not awarded,” Tierney said in an email, referring to a benefit that will be paid out as the project proceeds — not before the first chip is made.",
    "Intel’s plans for two electronic-chip plants near New Albany are indeed gargantuan: The company says it plans to spend at least $20 billion to create 3,000 jobs at the plants and “tens of thousands” more among suppliers and other support companies.",
    "“The Onshoring Grant goes towards facility construction,” he said and described another group of sweeteners that are controlled by local governments and thus outside the purview of the governor’s office, and its ability to protect taxpayers.",
    "“Other items labeled as incentives are local infrastructure improvements to water, sewer, and roads.”\nA spokeswoman for Intel was asked whether her company would commit to refund taxpayer incentives if the company’s commitments aren’t met.",
    "To support that, the report pointed to a 2016 internal email in which Intel CEO Brian Krzanich told employees that 12,000 positions would be eliminated globally as the company restructured in an attempt to stay competitive.",
    "That includes cash, infrastructure investments and future tax breaks, as well as funding from JobsOhio and local tax breaks, the research group Policy Matters Ohio said in a report that was released earlier this month.",
    "The company’s announcement also makes much of the $100 million it plans to spend in Ohio and with the National Science Foundation to create educational programs to foster a talent pipeline.",
    "“The giant amount of public money the state is spending to support the deal, and local property tax breaks, should come with measures to ensure a maximum of benefits for Ohioans,” it said.",
    "The Policy Matters report said that a good deal of the incentives Ohio plans to provide for the project will be paid before the plants are built and providing benefits to Ohioans.",
    "Tierney described the purpose of a $600 million grant that would be passed by the legislature, but he didn’t say how the state might recover those funds if the project goes bust.",
    "It’s early days for the project and action needs to be taken by the General Assembly, state agencies and local governments before public assets are committed to the project.",
    "Intel officials said that if they fully build out their campus on a 1,000 acre parcel near New Albany it spends as much as $100 million building eight semiconductor plants.",
    "But that makes it the right time to ask what’s being done to maximize public benefits and minimize risks associated with such a huge public investment, the report said.",
    "Mike DeWine, was asked to describe what mechanisms his administration would use to make taxpayers whole in the event that the Intel project doesn’t live up to promises.",
    "The spokeswoman, Lisa Malloy, did, however, say that her company would publicly report data regarding hiring, pay and diversity as it does throughout the United States.",
    "“The DeWine administration agreed to pay the bulk of these incentives up front — effectively betting that Intel will come through on its promises,” it said.",
    "As of March 7, it said, the Department of Development had completed no agreements with Intel, so it’s unknown what — if any — such measures will be taken.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "But it doesn’t mention that to attract all that largesse from Intel, Ohio officials have offered an incentive package of about $2 billion.",
    "To protect Ohio taxpayers, Policy Matters is advocating that clawback mechanisms be built into state contracts with the company.",
    "A policy-research group recently issued a report advocating ways to protect taxpayers should the mammoth deal go south.",
    "That’s why it’s important to have effective ways to get that money back if jobs don’t come later as promised, it said.",
    "The Intel announcement also said that 7,000 construction workers will be needed to build the plants.",
    "Nothing is assured in the rapidly changing technology sector.",
    "And the project could grow even bigger.",
    "Dan Tierney, press secretary to Gov.",
    "She didn’t answer directly."
  ]
}