{
  "id": 9080,
  "mediaId": 2784,
  "date": "2022-03-25",
  "headline": "Planned Parenthood Fined After It Tossed Remains of Aborted Baby and Patient Records in Trash",
  "image": "https://www.lifenews.com/wp-content/uploads/2015/08/plannedparenthood180.jpg",
  "link": "https://www.lifenews.com/2022/03/25/abortion-facility-fined-after-it-tossed-remains-of-aborted-baby-and-patient-records-in-trash/",
  "mediaOutlet": "LifeNews",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2143,
    71,
    961,
    969,
    1057,
    6474,
    6097
  ],
  "sentences": [
    "On Friday, Whitmarsh said the Ohio Department of Health responded to their complaints by saying the abortion facility “failed their patients’ trust and confidence with their medical records.”\n“Ohio Right to Life is fully invested in this case and will continue to work closely with a medical board and federal officials to ensure that the clinic is held accountable for any laws broken,” Whitmarsh said.",
    "“Based on review of pictures provided from outside source, record review, investigative report review and interview with staff and outside source, the facility failed to follow patient care policies that ensured each patient’s medical records were kept in confidence and a patient’s privacy to treatment at the facility,” according to a state inspection report.",
    "“We ask our pro-life leaders to handle this situation appropriately and to serve justice to those responsible.”\nWhitmarsh said it was precisely because of situations like this that Ohio Right to Life lobbied for legislation requiring the health department to establish rules for the proper and humane burial or cremation of aborted babies.",
    "Additional information about the process can be found in Ohio Right to Life’s press release which can be read here.”\nElizabeth Whitmarsh, director of communications at Ohio Right to Life, also shared the news from the health department Friday and promised that pro-lifers will keep fighting to shut down abortion facilities.",
    "Last year, pro-life advocates with Right to Life of Northeast Ohio and Ohio Right to Life urged state health officials to investigate Planned Parenthood and the Northeast Ohio Women’s Center in Cuyahoga Falls after pro-life advocates found the remains of an aborted baby, hazardous waste and patient records in the trash.",
    "“Sadly, it does not appear that Northeast Ohio Women’s Center is going be held accountable for the dumping of an abortion victim’s body in the trash by government agencies at this time,” said Allie Frazier, executive director of Right to Life of Northeast Ohio.",
    "Pro-lifers said they also found in the trash used urine cups, soiled suction cannulas, bloody blue surgical papers and other items that appear to be infectious waste, likely violations of state environmental hazard and disposal regulations.",
    "In July 2021, pro-life advocates reported finding a second-trimester aborted baby, hazardous medical waste and patients’ personal information in the trash outside the Northeast Ohio Women’s Center in Cuyahoga Falls.",
    "Denise Leipold, executive director of Right to Life of Northeast Ohio at the time, said the baby’s body was wrapped in a blood-stained sheet, and its left leg, left foot and right hand were fully intact.",
    "Frazier continued:\n“After a long investigative process, the Ohio Environmental Protection Agency and Ohio Department of Health have taken first steps and announced their findings.",
    "In 2015, the Ohio Attorney General’s office also discovered that Planned Parenthoods in Ohio contract with waste disposal companies that dispose of aborted babies in landfills.",
    "In a nutshell, the improper treatment of confidential patient information and a waste management logging error are the violations they are or have taken action against.",
    "An Ohio Planned Parenthood abortion facility is being fined $5,000 after pro-life advocates reported finding confidential patient records in the trash last year.",
    "The Ohio Department of Health confirmed the fine to the Planned Parenthood Bedford facility in a letter last week, provided to LifeNews by Ohio pro-life leaders.",
    "Mike DeWine signed a law in 2020 that helps ensure abortion facilities are not selling aborted baby body parts or disposing their bodies with medical waste.",
    "Currently, the investigations are now being handed over to the State Medical Board for and the Human Services Office of Civil Rights for further review.",
    "Ohio Right to Life and Right to Life of Northeast Ohio quickly filed complaints with the state health department and urged them to investigate.",
    "It requires abortion facilities to bury or cremate aborted babies’ bodies or allow the mother to make arrangements to do so herself.",
    "The department also told the abortion facility that it must submit a plan to correct the deficiencies to the state within 10 days.",
    "“We will maintain our fight to shut them down for good so they can never perform such barbaric atrocities again,” Whitmarsh said.",
    "Other parts of the baby’s body were badly mangled and crushed, the results of a brutal dismemberment abortion, she said.",
    "They said items with patients’ names and contact information also were in the trash – potential HIPAA violations.",
    "LifeNews Note: This story has been updated and corrected to show Planned Parenthood was fined.",
    "Northeast Ohio Women’s Center advertises abortions up to 15.6 weeks on its website.",
    "Pro-life advocates estimated the baby was between 16 weeks and 17 weeks gestation.",
    "Failure to comply could result in misdemeanor charges or loss of medical license.",
    "However, the ACLU is suing to overturn the law.",
    "Gov."
  ]
}