{
  "id": 9353,
  "mediaId": 2919,
  "date": "2022-03-24",
  "headline": "DeWine orders flags be flown at half-staff in honor of former Secretary of State Madeleine Albright",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/f304690/2147483647/strip/true/crop/640x336+0+72/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediaassets.news5cleveland.com%2Fphoto%2F2012%2F02%2F27%2FIMAG0224_20120227214733_640_480.JPG",
  "link": "https://www.news5cleveland.com/news/state/dewine-orders-flags-be-flown-at-half-staff-in-honor-of-former-secretary-of-state-madeleine-albright",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kaylyn Hlavaty",
  "authorUrl": "https://www.news5cleveland.com/kaylyn-hlavaty",
  "termIds": [
    2143,
    2938,
    4898,
    6678,
    6474
  ],
  "sentences": [
    "Mike DeWine has ordered all United States and State of Ohio flags on public buildings and grounds to be flown at half-staff in honor of the life of former Secretary of State Madeleine Albright who died Wednesday at 84.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "Before being appointed Secretary of State by President Bill Clinton in 1997, she was the U.S. permanent representative to the United Nations.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "Her family said she died from cancer, while surrounded by family and friends.",
    "Albright was born in Prague and immigrated to the U.S. as a refugee in 1948.",
    "Albright was a professor at Georgetown University at the time of her death.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "All flags are ordered to be flown at half-staff until sunset on March 27.",
    "Download now on your Apple device here, and your Android device here.",
    "Copyright 2022 Scripps Media, Inc. All rights reserved.",
    "Learn more about our streaming options here.",
    "We're also on Amazon Alexa devices.",
    "CLEVELAND — Ohio Gov."
  ]
}