{
  "id": 9776,
  "mediaId": 2703,
  "date": "2022-03-21",
  "headline": "Gov. Holcomb signs bill eliminating permit requirement to carry handguns in Indiana",
  "image": "https://www.gannett-cdn.com/presto/2019/04/26/PIND/f46a7f87-b01e-4d8f-a6a7-8bcaf76424cf-B40I3108.JPG?crop=5471,3063,x0,y0&width=3200&height=1792&format=pjpg&auto=webp",
  "link": "https://www.indystar.com/story/news/politics/2022/03/21/indiana-gov-holcomb-signs-constitutional-carry-handun-laws-bill/7088876001/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=indystar/todaystopstories",
  "mediaOutlet": "The Indianapolis Star",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kaitlin Lange",
  "authorUrl": "https://www.indystar.com/staff/2647212001/kaitlin-lange/",
  "termIds": [
    0
  ],
  "sentences": [
    "\"I will work with law enforcement leaders across our state to make necessary changes to firearms enforcement as well as identifying the best way to identify individuals who are not allowed to carry a firearm as defined by Indiana statute.”\nDemocrats and some Republicans also questioned the odd path the permitless carry language took to cross the finish line.",
    "The so-called \"constitutional carry\" language was later put in a different bill on the final day of the legislative session, even though the committee had voted to push forward the watered down version of the bill, and committee chair Sen. Liz Brown, R-Fort Wayne, remained opposed to a complete permitless carry bill.",
    "The Statehouse building's public access hours are 8 a.m. to 5 p.m.but it's not uncommon for members of the public to be inside the Statehouse after 5 p.m.\nA half hour to 45 minutes later, Hilbert said they were released and told they wouldn't be charged as long as they picked up their signs and left.",
    "At odds over constitutional carry bill\nThe issue of so called \"constitutional carry\" met fierce resistance as it worked through the legislative process, splitting the Republican party and leading to accusations that Republican lawmakers who supported the measure weren't \"backing the blue.\"",
    "Officers and representatives from the Fort Wayne Police Department, Evansville Police Department, the Indiana Association of Chiefs of Police, the Indiana State Fraternal Order of Police and Indiana State Police all testified against the bill in the Senate Judiciary Committee.",
    "More:Indiana Republicans push social issues in legislature as heavily contested primary nears\nCarter released a statement after Holcomb signed the bill saying he will continue to encourage Hoosiers to apply for handgun permits, even if it's not required.",
    "“I sure hope you choose to show deference to law enforcement professionals that understand the magnitude and the frontline effects of this legislation, rather than the possibility of getting reelected or elected the next primary,\" Carter said.",
    "There was widespread opposition to the bill among law enforcement due to safety concerns, because there will no longer be a way to quickly determine whether someone legally should be carrying a handgun during a traffic stop.",
    "But, advocates of the proposal argued Hoosiers shouldn't have to ask for permission to exercise a constitutional right, and they should have the same ability to defend themselves with a handgun in public as they do at home.",
    "Last month, the Senate Judiciary committee gutted House Bill 1077, the original home of permitless carry language, and turned into a bill that would have created a temporary license to solve concerns about delays.",
    "Eric Holcomb signed a bill into law Monday that eliminates the license requirement to carry a handgun in Indiana, despite initial opposition from the Holcomb-appointed head of state police due to safety concerns.",
    "Indiana State Police Superintendent Douglas Carter ruffled some feathers when he accused lawmakers of pandering to lobbyists and political posturing during his testimony on the bill in committee last month.",
    "Ron Galaviz, chief public information officer for Indiana State Police, confirmed the three were detained after refusing to leave the Statehouse at 5 p.m. and were released when they did agree to leave.",
    "The measure still easily sailed through a final floor vote in both chambers on the final day of session earlier this month, passing the House by a 69-30 vote and the Senate by a 30-20 vote.",
    "\"It’s important to note that if a person is prohibited, under federal or state laws, from possessing a firearm before this law goes into effect, that person will still be prohibited.",
    "He added that if there are no public events inside the Statehouse, police routinely make rounds to ensure only state employees are left in the building after public access hours.",
    "Hilbert said they and one other person were detained in handcuffs by Capitol Police around 5:30 p.m. after being told they were going to be charged with criminally trespassing.",
    "Gun safety activists Heather Hilbert and Becca McCracken said they waited outside Holcomb's office at the Indiana Statehouse all day hoping to land a meeting with the governor.",
    "That means most Hoosiers 18 years and older can carry a handgun in public without ever having received a background check, unless they had done so to purchase a handgun.",
    "\"It's a false premise that is trying to define who is a conservative and who is not, which is unfortunate,\" Brown said on the Senate floor before the vote.",
    "\"HEA 1296, which I've signed today, entrusts Hoosiers who can lawfully carry a handgun to responsibly do so within our state,\" Holcomb said in a statement.",
    "Starting in July, anyone who legally could carry a handgun with a permit previously now could do so without one moving forward, due to House Bill 1296.",
    "Lawmakers had made the permit free during the 2021 legislative session, nor was there any training requirement attached to the permitting process.",
    "Permits still will be available to those who want one, such as those traveling to another state that has reciprocity with Indiana.",
    "Brown argued the fight wasn't about guns anymore, or fixing the permitting process so that it works for Hoosiers and police alike.",
    "\"I, like Governor Holcomb, feel enormous responsibility for frontline law enforcement officers,\" Carter said in a statement.",
    "Erin Murphy, a spokeswoman for Holcomb said his office did not tell Capitol Police to detain the activists.",
    "Only two members of law enforcement testified in support, including the Hamilton County sheriff.",
    "Lawmakers reduce e-cigarette tax before it goes into effect: Health experts are concerned.",
    "And if a prohibited person has a firearm, he or she can be prosecuted.\"",
    "Already, Indiana's handgun carry laws were weaker than other states.",
    "Mike DeWine, also a Republican, signed a similar bill into law.",
    "Call IndyStar reporter Kaitlin Lange at 317-432-9270.",
    "Already 21 other states don't require a permit.",
    "How many states have permitless carry?",
    "Follow her on Twitter: @kaitlin_lange.",
    "Do you need a gun permit in Indiana?",
    "\"This is a political discussion.\"",
    "Just last week, Ohio Gov.",
    "They opposed the bill.",
    "Capt.",
    "Gov."
  ]
}