{
  "id": 9858,
  "mediaId": 8358,
  "date": "2022-04-01",
  "headline": "DeWine, Huffman appear in Lima on Friday",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/04/web1_031A1476.jpg",
  "link": "https://www.limaohio.com/news/503044/dewine-huffman-appear-in-lima-on-friday",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Gilroy",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "When it is settled I will be happy to answer any questions about the process from beginning to end, but not until then.”\nCupp fell somewhere in between mentioning that there is pending litigation and that he didn’t want to look too far ahead.",
    "Cupp and DeWine were in town to celebrate the Allen County Economic Development Group’s recent successes and Huffman was invited to be the guest speaker for the Allen County Republican Party luncheon.",
    "“If you take the constitution and the three Supreme Court decisions the result has been a premium has been put on making fewer competitive districts — that’s not what people intended.",
    "With the least to lose DeWine easily spoke the most candidly and even went as far as to mention the whole thing may need to be overhauled to include district competitiveness.",
    "“We have at least different cases being litigated in court right now and the smart thing to do for anyone who has something pending in court is not to talk about it publicly.",
    "While all three were here for other reasons, none of them could get out of town without being asked about the redistricting process that has devolved into a debacle.",
    "As district maps continue to be an issue and the focus of nearly every interview they grant, the three leaders answered questions on the topic to varying degrees.",
    "I think we (post-election) we have take a look at this.”\nHuffman shut redistricting map questions down immediately during his visit to the Lima Eagles Lodge.",
    "DeWine says he believes unintended consequences have come out of the redistricting process that has not lived up to spirit of what Ohio voters voted for.",
    "Just like every other election in the state of Ohio, everyone will be able to vote and have that vote counted by a non-partisan election board.”\nPrevious",
    "“The important thing I would say to people is that they shouldn’t worry about the process being fair or not.",
    "Cupp did take the time to also reassure that Ohio would have a complete election even if split in two.",
    "“One of the things that was said was that this would make more competitive districts,” said DeWine.",
    "LIMA — For a fleeting few hours on Friday the city of Lima seemed to be the epicenter of Ohio.",
    "Mike DeWine, Senate President Matt Huffman and House Speaker Bob Cupp visited Lima on Friday.",
    "That is the advice that every lawyer gives their client and I am going to follow it.",
    "“Right now we will have an election in May and then another in August,” Cupp said.",
    "He cited the longtime preferred advice by almost every lawyer for his silence.",
    "“I’m not going to answer any questions about the map,” Huffman said.",
    "Some of the state’s political heavy hitters, such as Gov."
  ]
}