{
  "id": 9865,
  "mediaId": 8480,
  "date": "2022-03-31",
  "headline": "Ohio lawmakers announce gun-violence initiative",
  "image": "https://www.wdtn.com/wp-content/uploads/sites/45/2022/03/F4949B2894277349504737493298225D.jpg?w=1280",
  "link": "https://www.wdtn.com/news/local-news/ohio-lawmakers-announce-gun-violence-initiative/",
  "mediaOutlet": "wdtn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Bean",
  "authorUrl": "https://www.wdtn.com/author/sarah-bean/",
  "termIds": [
    3898,
    3235,
    625,
    953,
    982,
    6474,
    6318
  ],
  "sentences": [
    "With the help of this initiative, we are confident that more gunmen will be brought to justice, future shootings will be prevented, and lives will be saved.”\nThe joint initiative will provide more opportunities for law enforcement to submit firearm evidence for scientific analysis, while simultaneously decreasing turnaround time on testing results.",
    "“We must do more to hold accountable the small number of dangerous criminals who are responsible for most of the gun violence in our state — the convicted felons who have lost their right to possess firearms, yet they continue to carry and use guns to hurt and kill people,” Gov.",
    "“By more than doubling the number of NIBIN units in Ohio, we’ll give our local law enforcement partners easier access to this crime-solving technology to help develop investigative leads that result in arrests.",
    "According to a release, Ohio governor Mike DeWine was joined by Ohio Attorney General Dave Yost, Ohio State Highway Patrol Superintendent Col. Richard Fambro and Ohio BCI Superintendent Joe Morbitzer.",
    "These four announced a joint criminal justice initiative that will help local law enforcement identify those responsible for deadly shootings and other gun violence, the release said.",
    "LONDON, Ohio (WDTN) – Ohio lawmakers visited the Ohio Bureau of Criminal Investigation on Thursday to announce a new initiative intended to reduce gun violence in Ohio.",
    "The full press conference will be available in the video player above shortly.",
    "DeWine said."
  ]
}