{
  "id": 1083,
  "mediaId": 2520,
  "date": "2022-02-15",
  "headline": "Kari Lake wants journalists 'punished'? Look how that's turning out in Mexico",
  "image": "https://www.gannett-cdn.com/presto/2022/01/27/PPHX/b290d475-4dc6-4999-9bd8-5f97033f0c81-74f9f095-b7db-4164-9e8d-4a0f83dfecfa.jpeg?crop=639,360,x0,y72&width=639&height=360&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/elviadiaz/2022/02/15/kari-lake-wants-punish-journalists-5-murdered-mexico/6799736001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elvia Díaz",
  "authorUrl": "https://www.azcentral.com/staff/2647952001/elvia-daz/",
  "termIds": [
    0
  ],
  "sentences": [
    "With charts in hand, Obrador assailed Loret de Mola’s supposedly multimillion-dollar salary, calling him and anyone else who dare criticize him or his government “thugs, mercenaries, sellouts.”\nLoret de Mola disputes the salary amount, pointing to obvious errors, but the bigger concern here is that the president himself is doubling down on his attacks on journalists while so many are being gunned down.",
    "AMLO has only doubled down on his attacks\nThis week, Mexico’s President Andrés Manuel López Obrador went after prominent columnist Carlos Loret de Mola, who has reported on the entanglement of his son’s living arrangement in Texas with a business person with lucrative contracts with a government-owned company in Mexico.",
    "This isn't that\nOn Monday, the Inter American Press Association called out López Obrador’s “smear campaign against journalists.”\n“The case of Loret Mola is an example of the vindictive stance of the president, who used confidential tax information to attack the journalist,” Carlos Jornet, the group’s chairman, said.",
    "But it’s something else to go after reporters, like López Obrador is doing in Mexico and Kari Lake – a former journalist herself – is doing in calling for media workers to be “punished.”\nThat isn’t just the empty rhetoric of heated campaigning.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "5 journalists killed in Mexico this year\nBarchenger shouldn’t be the only one underscoring Lake’s reckless and dangerous attacks on press freedom just because she doesn’t like the coverage.",
    "That didn’t save her or López Vásquez, sowing deeper fears for the lives of media workers that dare to do their jobs, calling out rampant corruption and raging drug-related violence.",
    "It’s part of living in a healthy democratic society where reporters are free to do their jobs and everyone else is free to like or dislike such coverage.",
    "And that’s happening under the watch of a democratically elected president, who like Lake is constantly throwing fuel on the fire against journalists.",
    "“Denigrating the press from the top of power is not a dialectic game,” said the group’s in an earlier letter sent to López Obrador this month.",
    "“LIKE & SHARE if you agree.”\nNearly 3,000 Twitter users liked it, meaning they presumably agree with Lake that journalists should be punished.",
    "In January, the killing of veteran journalist Lourdes Maldonado López in the border city of Tijuana drew international condemnation.",
    "It’s putting journalists in danger and plunging a dagger into the heart of the First Amendment that guarantees press freedom.",
    "China, Egypt, Russia and others,” The Arizona Republic’s Stacey Barchenger, who’s covering the governor’s race snapped back.",
    "But it’s also happening south of our border, even if Americans are paying little or no attention to the killing spree.",
    "On Feb. 10, journalist Heber López Vásquez of the state of Oaxaca became the fifth killed just this year.",
    "Kari Lake’s reckless attacks on journalists are no joke – just look at Mexico’s latest killing spree.",
    "I believe they should,” the Arizona Republican gubernatorial candidate tweeted over the weekend.",
    "She covered politics and corruption and had earlier told the president she feared for her life.",
    "We know what repressive China and Russian regimes do to journalists, for example.",
    "Want to know how things might turn out when journalists are “punished”?",
    "Elvia Díaz is an editorial columnist for The Republic and azcentral.",
    "Opinion: Kari Lake's reckless attacks on journalists are dangerous.",
    "They are imprisoned or killed in retaliation for their coverage.",
    "“You know which countries penalize journalism they don’t like?",
    "Reach her at 602-444-8606 or elvia.diaz@arizonarepublic.com.",
    "That brings us back to Kari Lake’s attacks on journalists.",
    "“Should lying ‘journalists’ (propagandists) be punished??",
    "Five Mexican journalists have been killed in 2022.",
    "Just look at Mexico's latest killing spree.",
    "It's one thing to criticize coverage.",
    "That’s almost one killing per week.",
    "Follow her on Twitter, @elviadiaz1.",
    "Criticizing coverage is fair game.",
    "Just look south of the border.",
    "Think about that for a second."
  ]
}