{
  "id": 15445,
  "mediaId": 8475,
  "date": "2022-03-08",
  "headline": "Kelly Townsend drops Az congressional bid to challenge Wendy Rogers",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/rogers-townsend-2021-07-25-torn-1024x614.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/030822_townsend_v_rogers/kelly-townsend-drops-az-congressional-bid-challenge-wendy-rogers/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    2756,
    4039,
    1126,
    1489,
    1477,
    6518,
    5949,
    6157,
    5943
  ],
  "sentences": [
    "The Senate censured Rogers in a historic vote last week for her speech to the white nationalist America First Political Action Conference, where she called public hangings of people she perceived to be America's enemies, and subsequent threats to politically \"destroy\" any Republican colleagues who censured her.",
    "\"The lack of the endorsement means that instead of being able to unite the field behind a single banner, my presence in the Republican primary will serve only to split the conservative vote even further and make it more difficult to elect an authentic America First candidate,\" Townsend wrote on social media.",
    "Townsend, who was first elected to the House of Representatives in 2012 and won her Senate seat in 2020, also announced last week that an expected endorsement from former President Donald Trump didn't materialize, which she said led her to pull the plug on her congressional campaign.",
    "Republican gubernatorial hopeful Matt Salmon has called on her to resign from the Senate, and even allies like gubernatorial candidate Kari Lake and Arizona Republican Party Chairwoman Kelli Ward, both of whom thrive on controversy, have shied away from publicly defending her.",
    "Rather than seek reelection, Townsend decided instead to run for the new 6th Congressional District, which covers much of Tucson and southeastern Arizona, extending north along the Interstate 10 corridor — but not into the Valley, where she lives.",
    "She has toured the country and raised nearly $2.5 million for her re-election last year on the back of her false attacks on the 2020 election results, shattering fundraising records for legislative candidates in Arizona.",
    "In what might be the closely watched legislative race of 2022, Sen. Kelly Townsend is withdrawing from her short-lived congressional campaign to challenge recently censured Sen. Wendy Rogers in the Republican primary.",
    "I resent having to do that and I will push back against anyone who allows it to happen and will not be guilty of remaining silent about anti-Jewish hate,\" Townsend wrote on Twitter on Friday.",
    "Townsend has also criticized Rogers for social media posts that contained antisemitic tropes and rhetoric, and blasted her on the Senate floor for using fundraising off of the censure vote.",
    "Like Rogers, she has been a vocal advocate of the baseless allegations that the 2020 election was rigged against Trump, and has promoted drastic new restrictions on voting.",
    "Since winning her seat in 2020, a race that saw her take out a conservative incumbent senator in the GOP primary, Rogers has fashioned herself into a pro-Trump celebrity.",
    "She faced criticism last year from the Anti-Defamation League for comparing COVID-19 vaccine advocates to Nazis and tweeting an image of a swastika made from syringes.",
    "Townsend on Monday filed to run for reelection to the Arizona Senate in District 7, a sprawling, rural swath that runs from southern Flagstaff to eastern Pinal County.",
    "Rogers has become toxic for her unapologetic embrace of white nationalism, getting national headlines for her inflammatory comments and antisemtic rhetoric.",
    "That could prompt organizations that normally support more moderate, establishment-friendly Republicans to aid Townsend in her quest to unseat Rogers.",
    "The day after the censure vote, she gave Rogers an opportunity to repudiate white nationalist leader Nick Fuentes, the organizer of the conference.",
    "But the Arizona Independent Redistricting moved Rogers' Flagstaff residence into the same district as Apache Junction, where Townsend lives.",
    "Very little of the old district that she's represented for the past decade, which is based in east Mesa, is part of the new district.",
    "However, by taking on Rogers, Townsend could get support from outside groups that wouldn't normally back someone with her views.",
    "Townsend was absent for the censure vote, which passed 24-3, with 11 Republicans joining their Democratic colleagues.",
    "\"When you have someone pushing a white supremacist in your party, it is your duty to spend the time to tear it down.",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "Townsend has long represented the right wing of the Republican Party in Arizona.",
    "In contrast, Townsend had just $13,000 in her campaign account on Jan. 1.",
    "Join Vicki Evans, Tanya Ahern, and Lynnette Casey and contribute today!",
    "Townsend is also more of an unknown to voters in the new District 7.",
    "Most of Rogers' pre-existing District 6 is part of the new district.",
    "Much has changed since Townsend announced those plans, however.",
    "As of the start of 2022, she had nearly $1.6 million on hand.",
    "Rogers and Townsend currently represent different districts.",
    "But she has since become harshly critical of Rogers.",
    "Challenging Rogers will be difficult."
  ]
}