{
  "id": 17364,
  "mediaId": 8350,
  "date": "2022-03-03",
  "headline": "Arizona gubernatorial GOP candidate calls for state Sen. Rogers to resign",
  "image": "https://ktar.com/wp-content/uploads/2022/03/MicrosoftTeams-image-103.jpg",
  "link": "https://ktar.com/story/4927476/arizona-gubernatorial-gop-candidate-calls-for-state-sen-rogers-to-resign/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KTAR.COM",
  "authorUrl": "https://ktar.com/story/author/ktar-com/",
  "termIds": [
    0
  ],
  "sentences": [
    "She was censured for “engaging in conduct unbecoming of a senator, including publicly issuing and promoting social media and video messages encouraging violence against and punishment of American citizens and making threatening statements declaring ‘political destruction’ of those who disagree with her views.”\nRogers argued that the censure was merely an attempt to limit her speech.",
    "“I do not wish to accept financial donations that she solicited and will respectfully return them.”\nPressure mounted within the GOP this week after Rogers said over the weekend that her political opponents should face a “newly built set of gallows.”\nShe spoke in a video played at the America First Political Action Conference, a white nationalist gathering.",
    "Rogers must resign her seat in the Legislature for the greater good of Arizona and so that LD6 can be effectively represented on issues of public policy, which her ongoing conduct and associations make her incapable of doing,” Salmon said in a statement.",
    "“I supported the Arizona Senate’s censure of Sen. Wendy Rogers, but the dismissive response that I have witnessed from her indicates a level of misjudgment and a failure of character so outrageous that more stringent action is needed,” Salmon said.",
    "PHOENIX — Matt Salmon, a Republican Arizona candidate for governor, on Thursday called on fellow GOP member and state Sen. Wendy Rogers to resign from her post over rhetoric that got her censured in the Senate earlier this week.",
    "“I emphatically reject @WendyRogersAZ endorsement of my campaign for Congress,” Townsend said on Twitter.",
    "Rogers is endorsed by Kari Lake, a key opponent of Salmon’s on the GOP side in the race for governor.",
    "State Sen. Kelly Townsend said she wouldn’t accept Rogers’ endorsement for the 2022 election.",
    "But Salmon wasn’t the only Arizona Republican to push back against Rogers on Thursday.",
    "Rogers on Tuesday became the first Arizona lawmaker censured in decades.",
    "Salmon said her comments had no place in politics.",
    "The Associated Press contributed to this report.",
    "“Sen."
  ]
}