{
  "id": 1881,
  "mediaId": 2618,
  "date": "2022-02-04",
  "headline": "It Sure Seems Like the January 6th Committee Was Colluding With Jeff Zucker",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/04/it_sure_seems_like_the_january_6th_committee_was_colluding_with_jeff_zucker_78492.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bonchie",
  "authorUrl": "",
  "termIds": [
    4794,
    3084,
    300
  ],
  "sentences": [
    "Rather, it was that he was protecting the right people, within the network and outside the network.And when it comes to the latter group, it sure seems like the January 6th Committee was\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Many of us saw the events of that day as they unfolded LIVE on TV and what was observed has never matched the scripted storyline spoon-fed daily by CNN and their alphabet news pals throughout this past year.",
    "Wonder if Warner will start to investigate the expenditures over the last few years, which might include multiple electronic devices (one official and one non-official) used to communicate with \"sources\".",
    "Also, Megyn Kelly mentions there are more shoes to drop, indicating there is MUCH more to the story, and it's not likely the new owners appreciate what they ended up with from their purchase.",
    "Ostensibly, the reason given was that he failed to disclose an affair with his long-time lieutenant, who is still employed by CNN.",
    "But there’s plenty of reason to believe that the story goes much further, (Snip) The network was and is collapsing, after all.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "He resigned (not by choice) on Wednesday, bringing an end to his nine-year tenure as head of the liberal network.",
    "Communists use as a rhetorical tool that if a lie is repeated often enough people will come to believe it.",
    "Do not doubt that some members on that Jan 6 commission are sources for the Clown News Network.",
    "In fact - - if you do the math - - you'll discover that there's a Zucker born every minute.",
    "Under Zucker, CNN has repeated the lies about Jan.6 continually 24/7!",
    "Your donation helps keep our discussions going and our voices heard.",
    "Most people don't realize that Zucker is a very common surname.",
    "In case you haven’t heard, CNN’s Jeff Zucker is out of a job.",
    "They likely used a \"personal\" phone for communicating leaks.",
    "Yes - - crunch the numbers - - you'll see that it's true.",
    "The media has now lost credibility and viewers as well.",
    "CNN has repeated lies against Pres.",
    "TRUMP for 6 years.",
    "Thank you."
  ]
}