{
  "id": 2656,
  "mediaId": 8251,
  "date": "2022-02-07",
  "headline": "Brnovich says Arizona has right to defend itself against border 'invasion'",
  "image": "https://media.12news.com/assets/KPNX/images/9a791794-c540-4bce-940b-567ad2568708/9a791794-c540-4bce-940b-567ad2568708_1140x641.jpg",
  "link": "https://www.12news.com/article/news/local/arizona/brnovich-says-arizona-has-right-to-defend-itself-against-border-invasion/75-187e664c-a248-493d-bda6-2319d8dfe6d8",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "\"...any such use of defensive force to protect the State against actual invasion must also be consistent with applicable federal law and treaties and particular attention must be paid to the State’s relationship with Native American tribes with reservations at the Arizona-Mexico border,\" the opinion states.",
    "https://t.co/VqOCI9qGHk\n— Mark Brnovich (@GeneralBrnovich) February 7, 2022\nBrnovich wrote it's up to the governor to determine what type of defensive force should be used and the governor must take into account other stakeholders located in Arizona who may be affected.",
    "TODAY our office issued a legal opinion determining the current crisis at Arizona’s southern border, fueled by violence and lawlessness of cartels & gangs, legally qualifies as an “invasion” under the U.S. Constitution, & AZ has the power to defend itself.",
    "Gubernatorial candidate Kari Lake, a Republican, promises to declare an invasion, if elected, in order \"to fend off the invasion at our southern border in the absence of federal protection,\" according to her website.",
    "In response to an inquiry submitted by a Republican lawmaker, Brnovich released a legal opinion Monday declaring Arizona has the authority to \"exercise its own power of self-defense\" at the border.",
    "Arizona Attorney General Mark Brnovich believes the state is under invasion and has the legal right to use force against \"transnational cartels and gangs\" operating at the border.",
    "The federal government has typically been given authority to declare war or initiate force against an enemy, but Brnovich thinks Arizona is in a position to take action.",
    "The issue delves into the complexities of the U.S. Constitution and whether individual states have sovereignty to engage in conflict with foreign powers.",
    "Arizona Attorney General Mark Brnovich, who's running for a Senate seat, thinks Arizona is under invasion and has the right to take defensive action.",
    "\"The federal government’s failure to secure the border and protect Arizona from invasion is dangerous and unprecedented,\" Brnovich's opinion states.",
    "\"An actual invasion permits the State to engage in defensive actions within its own territory at or near its border,\" the opinion states.",
    "A clause in the constitution offers states the ability to engage in war without the consent of Congress if they're \"actually invaded.\"",
    "Brnovich, who is running for a seat in the U.S. Senate, believes the current activity at the Arizona-Mexico border would allow Gov.",
    "The constitutional issue of border security has become a policy issue among the candidates hoping to replace Ducey in 2023.",
    "Catch up on the latest news and stories on the 12 News YouTube channel.",
    "PHOENIX — Editor's Note: The above video is from an earlier broadcast.",
    "Doug Ducey to constitutionally take action.",
    "Subscribe today."
  ]
}